{"id":105554,"no":33,"title":"Page 33","content":"“Not defiled exactly,” I said. “I don’t think that’s quite it. I think it all grew out of the chastity precept. Maybe it’s a way of playing it safe. If a man never lays eyes on a woman, let alone touches her, he’s not in much danger of losing control and jumping her bones.”\\n\\n “Perhaps that is the justification for it, Evan. But that is not what it says to me. To me it says women are dirty, women are immoral, women exist to lure men into sinful behavior. It is cloaked in religion, but it is not religion because it is to be found in one form or another in all religions.”\\n\\n “You’re right about that part,” I said.\\n\\n “It is men,” she said. “They despise women, so they make a religion out of it. But it is not religious. It is just men being disgusting.”\\n\\n “Men are swine,” I agreed. “Are you sure you don’t want to look for a nunnery along the way? It would shake them up a little when you walked in the door, but as soon as you got rid of your robes and stood naked before them they’d recognize you as a soul sister.”\\n\\n “Oh, shut up,” she said.\\n\\n A while later, she said, “I am sorry, Evan.”\\n\\n “For what?”\\n\\n “For telling you to shut up. For saying nasty things about men.”\\n\\n “I’m the one who said men are swine,” I said, “and we probably are, all things considered.”\\n\\n “Nevertheless, I apologize. It is the sun, I think. It is so strong.”\\n\\n “Why don’t we take a break? There’s a shady spot coming up.”\\n\\n “If I sit down I won’t want to get up again.”\\n\\n “Are you feeling all right, Katya?”\\n\\n “Yes, I think so,” she said. “I think it is just the sun.”\\n\\n A couple of hours later the sun was lower in the sky, and we had eaten and rested a little, and shared a large bottle of orange soda from a roadside stand. This didn’t go in the begging bowl; the vendor expected to be paid for it. But it was only twenty kyat. That was hardly any money, but we had started out with hardly any money, so I was doing what I could do to make our remaining kyat last.\\n\\n The orange soda tasted of sugar and chemicals, but I found I didn’t mind. The sugar was welcome after all the exercise we’d had, and the chemicals were reassuring; I knew the stuff was safe to drink, because no known pathogens could possibly survive in it.\\n\\n We got back on the road, and I was wondering where we would spend the night. There was another village down the road ahead of us – there always is, sooner or later – but it was hard for me to gauge just how far it was, or if we could expect to reach it before it was too dark to walk.\\n\\n We were walking more slowly today, it seemed to me. I kept having to ease my pace to accommodate Katya. And we were making more frequent stops.\\n\\n I looked at her now, and she caught me looking and asked me what was the matter.\\n\\n “You look a little tired,” I said.\\n\\n “I am a little tired.”\\n\\n “Yes, but you look different. Stressed out.”\\n\\n “There is nothing wrong with me, Evan.”\\n\\n “I didn’t say there was. I just-”\\n\\n “I am perfectly fine.”\\n\\n “Whatever you say,” I said.\\n\\n Traffic was generally pretty light. A couple of times a day a bus would pass, each time reminding me that a bus would have conveyed us from Bagan to Taunggyi in a day instead of the week or more it was taking us. But I had not seen how we could have spent that much time in such close quarters without having our deception exposed by the other passengers. We’d be in Taunggyi in a matter of hours, all right, and as soon as we got there we’d be placed under arrest.\\n\\n There were other public conveyances, too, for those citizens who couldn’t afford the luxury of a broken-down bus. For even fewer kyat one could ride in a van, with everybody’s luggage tied to the roof and everybody’s children hanging out the windows. The van passengers stood up throughout the journey, pressed together like upright sardines. I didn’t imagine monks ever rode those things. A monk could be deaf and blind, and he’d still break the chastity precept before the van had gone ten miles.\\n\\n There was some military traffic, too, and the first time a truck full of soldiers passed us I got a little nervous. But we got used to it.\\n\\n This afternoon a whole convoy passed us, every driver sounding his horn, young men in fatigues leaning out of the troop carriers to wave to us as they went by.\\n\\n “So many soldiers,” she said. “Where do you think they are going, Evan?”\\n\\n “To the Shan state,” I said.\\n\\n “The same as us.”\\n\\n “Yes.”\\n\\n “But why?”\\n\\n “Probably to kill the very people who are supposed to help us get out of the country.”\\n\\n “There is fighting there? I thought there was peace.”\\n\\n “There was,” I said, “the last I heard. But they’ve been waging this war off and on for close to forty years. All a peace treaty does is give both sides a chance to catch their breath.”\\n\\n “I wish I could,” she said.\\n\\n “You wish you could what?”\\n\\n “Catch my breath. We have to stop for a minute, Evan.”\\n\\n “There’s some good shade just up ahead on the left.”\\n\\n “I don’t think I can wait that long,” she said, and dropped her shoulder bag to the ground, and dropped down next to it herself.\\n\\n I squatted beside her. “Katya,” I said, “you don’t look well.”\\n\\n “I don’t feel well.”\\n\\n “It must be something we ate this morning. It hasn’t hit me yet, but-”\\n\\n “It is not something we ate, Evan.” She took my hand, put it to her forehead.\\n\\n “My God, you’re burning up!”\\n\\n “Yes,” she said. “And I feel dizzy and light-headed. And I have been seeing things out of the corners of my eyes. Flashing lights, bolts of lightning. And my muscles are sore, but not from walking so much. A different kind of soreness. And there is a pain deep in my bones.”\\n\\n “It sounds terrible,” I said. I put my hand on her forehead again and tried to estimate how much fever she had. “You’re very calm about it,” I said. “Has this happened before?”\\n\\n “Many times,” she said. “Evan, this is malaria.”\\n\\n Chapter 19\\n\\n It was not that bad, she assured me. She had had it before and she knew what to expect. When this happened in Rangoon she had a way of dealing with it. She would take a lot of aspirin and quinine, drink a pint of whiskey, and get in bed underneath a lot of blankets. And she would feel much better in the morning.\\n\\n The only problem lay in the fact that we didn’t have any aspirin or quinine. Or any whiskey. Or any blankets. Or even a bed for her to get into.\\n\\n “I’ll stop a car,” I said. “We’ll get you to a hospital. There has to be some kind of clinic somewhere. In Taunggyi, or back in Bagan.”\\n\\n “I do not want to go back to Bagan, Evan. And I do not need to go to a hospital.”\\n\\n “Are you sure?”\\n\\n “I am positive. We will find a place for me to sleep, and the fever will break during the night. And I will feel better in the morning.”\\n\\n And we did, and it did, and she did. We bedded down in an orchard a few dozen yards from the side of the road. The trees were laden with a fruit I couldn’t recognize, the size of a peach but shaped like a pear, with a glossy yellow skin. It would have been nice if they’d turned out to be durian, but when I broke the skin of one, the odor was closer to that of an apple. Whatever they were, they were a long way from ripe, and I let them stay on the trees.\\n\\n When she was comfortable – or as comfortable as she was likely to get, lying out in the open wracked with malaria – I went out foraging. I found the farmhouse where the keeper of the orchard presumably lived, and I skirted it carefully, hoping my scent wouldn’t set off a canine burglar alarm. But my luck held. Either the family dog wasn’t paying attention or the family had eaten him. Whatever it was, nobody barked at me.\\n\\n There were several outbuildings, and I slipped in and out of each of them. I found a heavy canvas jacket with a fleece lining, and I found a couple of reasonably clean towels, and that was all I could turn up that looked at all useful. Back in the orchard, I wrapped Katya’s feet in the towels and laid the coat over her for a blanket.\\n\\n It seemed to me there ought to be something more I could do, but I couldn’t think what. There would be a village within a few miles, but it might be an hour’s walk there and an hour’s walk back, and I didn’t want to leave Katya alone that long. Suppose she woke up in a panic? Suppose the coat’s owner decided to check his fruit trees in the middle of the night? Suppose the last man-eating leopard of Burma ran into her while making his midnight rounds?\\n\\n I ate some of my leftover food but made sure I saved most of it for the morning. Then I lay down at her side and did my relaxation exercises, and then I sat up and tried meditating. I suppose an accomplished monk could have meditated until the cows came home, or at least until the sun rose, but a half hour was about my limit.\\n\\n I wished I had a book and a flashlight. I wished I had a Billie Holiday record and something to play it on. I wished I had a bathtub full of gin. I wished I had any sort of bathtub – that bath in the Strand had worked wonders, but the best bath in the world can only deal with the dirt of the moment. Once you dry off and go back out into the world, you get dirty all over again. I had dried off a long time ago, and I’d shared a jail cell with an unrepentant durian eater and a boat with a load of dried fish, and I’d sweated my way down the hot and humid and dusty roads of central Burma. My red robes were pretty filthy, and so was I.\\n\\n She was a lot better in the morning. Her fever had broken during the night, and her robes were wet with perspiration. I spread them out in the sun to dry while she wore the farmer’s canvas coat. When I brought her the robes – drier, and somewhat aired out – she wrinkled her nose at them. But she got dressed, and we ate our breakfast and got on our way.\\n\\n “So that’s what it’s like,” I said.\\n\\n “Malaria? That is what it is like.”\\n\\n “It can’t be much fun.”\\n\\n “It is always bad in the evening and not so bad in the morning. It may be different for different people, and with different strains of the disease. The good thing is that I know it will not kill me. When I first came down with it I did not know that, because it does kill some people, you know, so how could I be sure I was not to be one of them? I had never felt so bad in my life, Evan, and I was afraid I was dying, and the fear made it all so much worse.”\\n\\n “Fear does that.”\\n\\n “Yes. But I did not die the first time, and I feared it less from then on. And it was not so bad. When you know you will be all right, then it is not so bad.” She smiled. “If it does not kill you early on, then it will probably never kill you. Unless, you know, you develop other problems. If your heart is bad, or you are weakened with age. But I think my heart is good, and I am not so old, am I?”\\n\\n “Not old at all.”\\n\\n “But it is still not eating outdoors.” That threw me, until we worked it out – she was saying it was no picnic, and I couldn’t argue the point. \\n\\n","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-33.html","bookId":1535,"book":{"id":1535,"title":"Tanner on Ice (Evan Tanner #8)","description":"Storyline: Tanner on Ice (Evan Tanner #8) \\n Once, Evan Tanner was known as the thief who couldn\u0027t sleep, carrying out his dangerous duties for a super-secret intelligence agency. Then someone put him on ice -- for about twenty-five years. Returning to the world (and trying to catch up with a quarter century\u0027s worth of current events), Tanner is about to embark on a new covert assignment that will take him to the exotic Far East, where mystery and menace are a way of life ....Now, whether he\u0027s dodging double crosses or disguising himself as a monk, Tanner is learning that when it comes to power games, pretty women, and political wrangling, some things never change. And he\u0027s making up for lost time -- with a vengeance.\\n","cover":"https://allnovel.net/images/tanner-on-ice-evan-tanner-8.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-on-ice-evan-tanner-8.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:47:39 PM"}}
