{"id":105525,"no":4,"title":"Page 4","content":"I looked at him. He looked at me. I said, “I give up. How can that be possible?”\n “Mr. Tanner,” he said, “have you ever heard of cryonics?”\n Well, of course I had. Based on the notion that biological processes ground to a halt at a lower temperature, cryonics postulated that dead people might be frozen for years on end, then thawed when science had advanced to the point of finding a cure for whatever it was that had killed them. Today’s incurable illness might be a mere nuisance twenty or fifty or a hundred years from now, when a pill or a shot or a surgical procedure could make you fit as a fiddle again.\n There had been rumors, I remembered, that various prominent persons had had themselves frozen after death. It seemed to me I’d heard it said about Walt Disney, though I couldn’t be sure whether he was ultimately going to be thawed or simply animated.\n It sounded nice in theory. It was a new wrinkle in the hopeless war against mortality, and while it might not extend the normal life span, it might serve as a weapon against early death. If your heart failed, well, we’ll just freeze you until artificial hearts have been perfected. Same with the liver and lungs. Whatever’s wrong with you, sooner or later medical science will work out a way to fix it, and when that happens we’ll warm you up and set you straight.\n The trouble was that it was still highly theoretical. While various cryonic facilities around the country had various deceased citizens as clients – “Many are cold and a few are frozen” was the phrase which leapt unbidden to mind – no one had as yet been thawed out to see if it was possible to restart his engine. (Some of the frozen ones were disembodied brains, the doctor told me. It seemed that it was considerably less expensive to have your brain frozen than to have them do your whole body. It struck me as a false economy. How could you go about reviving a frozen brain, and what on earth would you do with it? You needed a body for it, and where would you go for a volunteer? I suppose you could transplant it into the body of a horse, say, but would you really want to return to life as Mister Ed?)\n And it was still as theoretical as ever, the fact notwithstanding that I had a pulse once again after a quarter-century in the deep freeze. All my pulse proved was that you could successfully freeze and thaw the living, something they’d long since established through experiments with fish, frogs, and the occasional mammal, including at least a few human volunteers. Such volunteers had never spent more than a day or two frozen stiff, but, if time essentially stopped for one when the body temperature got low enough, then a few days and a couple of dozen years were all one.\n That was the theory, anyway, and I looked to be the living proof of it. Dramatic proof at that, if I said so myself. Twenty-five years at zero degrees – I’m guessing at that, nobody was ever able to tell me the precise temperature at which I was maintained – twenty-five years, by God, and I didn’t even need a shave.\n How had this happened to me? That’s what I wanted to know, and Dr. Fischbinder wasn’t much help on that point. (That was his name, Warner Fischbinder, and he was an M.D. and a specialist in heroic procedures. At first I thought that meant he saved people trapped in burning buildings, but it turned out his specialty involved treating patients brought back from the very brink of death. His associate, the sallow blonde, was Laura Westerley, and she was a doctor as well, specializing in internal medicine, which, if you think about it, ought to take in just about everything but dermatology. I’d assumed she was a nurse, because most women in white had been nurses when I was frozen. That was just one of the things that were not the same anymore.)\n “You were found,” Fischbinder told me, “in a frozen-food locker in the sub-basement of a house in Union City, New Jersey.”\n “At 673 Parkside Avenue,” I said.\n “You remember the address after all these years?”\n “As if it were yesterday. As far as I’m concerned, it was yesterday.”\n “Yes, of course. For years the house was owned and occupied by a family named Akesson.”\n “Swedish Danes,” I said. “Or Danish Swedes.”\n “You know them?”\n I shook my head. “I knew a man named Harald Engstrom, and the last thing I remember was drinking a drink he poured for me. He was staying at a friend’s house, and Akesson must have been the friend. And I wound up in the family freezer, next to the cans of Birdseye frozen orange juice.”\n “Not the family freezer.”\n “Well, I didn’t exactly mean-”\n “I doubt the family could have known about it,” he explained. “This was a special hi-tech unit, state-of-the-art in 1972 and still impressive all these years later. And it was installed in a sub-basement of the Akesson house, a small one-room affair reached through a trapdoor in the floor of the furnace room. Someone had run an electrical line to the chamber, and that supplied the power to keep the thing running and you well frozen. And there was also a backup system, a battery-operated generator that would kick in and power the chamber if the power lines were down in a storm. Whoever did this wasn’t taking any chances that you would thaw prematurely.”\n “Then how come I’m not still there?”\n “The family sold the house,” he said. “It changed hands a couple of times, as a matter of fact. The most recent tenant was doing some remodeling, and had reason to take up the tile floor in the basement instead of just laying new tile on top of it. And in the course of it they discovered the trapdoor, and went to see where it led.”\n “They were probably expecting buried treasure,” I said, “and found me instead. But how did they know to call someone who would know what to do?”\n “There was a notice posted,” he said. “Hand lettered in block capitals. I don’t recall the wording, but the point of it was that the unit contained a living human being in a frozen state, and that it should not be opened or the power shut off except under the supervision of qualified medical personnel.”\n “And that’s where the two of you come in.”\n “Not immediately, but soon enough.”\n “And you brought me here, or someone did, anyway. Where’s here, anyway? Where are we?”\n “ New York University Medical Center.”\n “On First Avenue?”\n “Yes.”\n “And you thawed me out. I suppose it took awhile.”\n “It was a very gradual process.”\n “When you asked me my name,” I said, “it was the same as asking me who was the president. You already knew the answer.”\n “Your name is Evan Michael Tanner. And there is a government file on you. I’ve seen parts of it, but only parts of it.”\n “How was I identified? Fingerprints?”\n He shook his head. “There was a small suitcase found next to the chamber in which you were frozen. In it were clothes, which I presume were yours.”\n “I was wearing a striped shirt with a button-down collar,” I said, “and a pair of khaki pants, and a tweed jacket with elbow patches. And don’t look so surprised, Doctor. Can’t you remember what you were wearing yesterday?”\n “I can’t,” he said, “but I know that most people can. Those are in fact the clothes that were in the suitcase, along with shoes and socks and underwear. There were also a watch and wallet, and the wallet held identification, along with membership cards in a variety of organizations. Are you really a member of the Flat Earth Society?”\n “Well, I was for many years,” I said, “but if I haven’t paid my dues in twenty-five years they may have dropped me from the rolls.”\n “Then there really is such an organization?”\n “There was,” I said. “I can only hope there still is.”\n “And they believe…”\n “That man should trust the evidence of his senses,” I said, “which make it very clear that the earth is flat.”\n “How can you possibly believe that?”\n “And how can you possibly believe otherwise? Oh, I know how entrenched the globularist heresy has become, but-”\n “But to believe as you do now, after men have walked on the moon. Or was that…”\n “After my time?” I shook my head. “The moon walk happened three years ago. Well, more like twenty-eight years ago, come to think of it. I could explain it in Planoterrestrial terms, but I don’t expect it would convince you. Anyway, the real point of the Flat Earthers hasn’t got that much to do with the shape of the planet. It’s philosophical, and it’s about trusting one’s own interpretation of evidence and not…”\n “And not what?”\n “And not swallowing everything the Establishment tells you. The only reason you believe the world is round – or spherical, really – is that’s what they told you in school. And the only reason I believe I spent twenty-five years colder than a welldigger’s ass in the Klondike is because you told me so. Now I can’t imagine why you’d want to lie to me, and I don’t think that’s what’s happening, but I’d feel a lot more in tune with my Flat Earth principles if you could show me some supporting evidence.”\n He started to say something, then decided to humor me and slipped out of the room. The woman asked if I really thought they were making this up to fool me. I didn’t, and told her so. “But if I see something concrete,” I said, “it’ll help me believe it.”\n Fischbinder came back with a copy of the New York Times. The date was right – March 14, 1997 – and there was a front-page story about the president, who did indeed seem to be named Clinton. There was turmoil in the Middle East, for a change, and there was trouble as well in Zaire and Bosnia. There was a map, and Bosnia seemed to be a country, and not just a province of Yugoslavia. In fact they all seemed to be countries, Bosnia and Croatia and Macedonia and Serbia and Slovenia.\n Could I be dreaming? Because I had dreamed of the day when all the parts of Yugoslavia would be sovereign nations, I and my brothers in a handful of disparate groups. If the newspaper was to be believed, the day had come while I lay frozen and unknowing. And now, from the looks of things, the citizens of all these new republics were busy killing one another. Not quite the heaven on earth I’d had in mind, but still…\n “I don’t suppose it would be that difficult,” I said, “to have a newspaper printed.”\n They exchanged glances again. Neither of them actually said the word paranoia, but I could almost hear it just the same. And I guess I knew I was being unrealistic. They might have dummied up the front page of a newspaper, with some imaginative headlines over blocks of jumbled type. They do that all the time in the movies. But this was a whole copy of the New York Times, pages and pages of it, with ads and photos and stories all the way through.\n And it cost sixty cents, I noticed. The last time I bought it, all it set me back was a quarter.\n “I’m being silly,” I admitted. “I think I believed you from the beginning, and the paper’s a convincer, even if it does raise two questions for every one it answers. But, see, I look the same. You both probably look a lot older than you did in 1972, but I didn’t know you then, so you couldn’t prove it to me. You know what they say, seeing is believing, and if I could just see something that would cut through this inner skepticism of mine…” \n","sourceLink":"https://allnovel.net/tanner-on-ice-evan-tanner-8/page-4.html","bookId":1535,"book":{"id":1535,"title":"Tanner on Ice (Evan Tanner #8)","description":"Storyline: \n Tanner on Ice (Evan Tanner #8) \n Once, Evan Tanner was known as the thief who couldn\u0027t sleep, carrying out his dangerous duties for a super-secret intelligence agency. Then someone put him on ice -- for about twenty-five years. Returning to the world (and trying to catch up with a quarter century\u0027s worth of current events), Tanner is about to embark on a new covert assignment that will take him to the exotic Far East, where mystery and menace are a way of life ....Now, whether he\u0027s dodging double crosses or disguising himself as a monk, Tanner is learning that when it comes to power games, pretty women, and political wrangling, some things never change. And he\u0027s making up for lost time -- with a vengeance.\n \n","cover":"https://allnovel.net/images/tanner-on-ice-evan-tanner-8.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-on-ice-evan-tanner-8.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:47:39 PM"}}
