{"id":71607,"no":17,"title":"Page 17","content":"\"Of course, when I mentioned sledding I didn\u0027t mean downhill. Nothing quite so childish.\"\n \"Well, Laurent, we couldn\u0027t very well fly in a team of dogs.\"\n \"True. But what\u0027s a country house without dogs, Nara?\"\n \"Dogs aren\u0027t fashionable on Home, I\u0027m afraid.\"\n He sighed. \"So I\u0027d noticed.\"\n Zai turned down the heating in his uniform. His metabolism was enough to keep him warm inside Navy wool. The snow crunched under his boots with the bright sound of a recent fall. Perfect powder for sledding.\n If only he had a long, flat stretch of it and a team of huskies.\n Nara\u0027s blue eyes were flashing with a smile. \"I\u0027m relieved to see that you Vadans don\u0027t slavishly follow the Emperor\u0027s taste in these matters.\"\n Laurent cleared his throat. \"There\u0027s nothing wrong with cats . . . strictly speaking.\"\n The trail began only a few meters from the door. It was shiny and slick, as if incised into the snow with lasers. On the mountain side of the trail the snow had been melted into an overhang, forming a half-cylinder of ice that wound downward around the peak. On the other side loomed a vertiginous drop.\n Zai felt a bit dizzy, possibly from exhaustion. With only an hour of darkness every night, they hadn\u0027t slept much in the last three days.\n He took a deep breath. \"\\ hope your house knows what it\u0027s doing.\" \"Sometimes I think my house knows altogether too much,\" Nara said. \"It has an excess of time on its hands.\"\n Zai looked up at the building, which seemed quite modest from the outside. Most of its bulk was hidden within the stone of the mountain, its true extent revealed only by the glimmer of a hundred polarized windows. Not all looked out from Nara\u0027s living quarters, of course. He had toured the gardens this morning, or at least some of them. The warrens that had produced three days of sumptuous meals seemed endless.\n That sort of decadence always resulted when machines were given too much autonomy. Zai adjusted his tunic waist, which was growing tighter by the day.\n \"I get the feeling it can still hear us,\" he said.\n \"Probably.\" She shrugged in her coat.\n Laurent pulled the glove from his real hand and ran his fingers through the short, yellow-gray fur.\n \"Paracoyote,\" Nara said.\n His eyes widened. \"You\u0027re wearing a canine? That\u0027s a crime on Vada.\"\n She laughed. \"They\u0027re a pest on Vasthold, to say the least.\"\n Zai wondered if Nara knew how extraordinary it was to come from a planet where \"pest\" could mean something bigger than an insect. On Vada, hunting was only allowed on stocked private lands, a sport for the unthinkably rich. \"Vasthold is fortunate that terraforming has taken so well. Did you kill it yourself?\"\n \"No, I haven\u0027t hunted since I was a kid.\" She smiled, fingering the fur. \"And then only with a slingshot. This was a political gift from a conservationist group. But taken in the wild, with a bow, I think.\"\n Zai shook his head. \"We have no wild mammals on Vada.\"\n He placed the sled on the snow.\n \"I wish I could take you on a proper sled ride, Nara. With a team of huskies, across a floe of new sea ice.\"\n \"Sea Zee? You mean without land underneath?\"\n \"It\u0027s very smooth when it\u0027s new.\"\n \"No, thank you.\" \"Well, after a few days of strong wind, pressure ridges break up he landscape.\"\n She laughed. \"It\u0027s not the monotony, Laurent. It\u0027s the thought of lothing but ice between me and an ocean!\"\n \"There is safety equipment. When you fall through--\"\n \"When?\"\n He cleared his throat again. \"Perhaps we should get started.\"\n \"Yes. I\u0027m beginning to think you\u0027re delaying us intentionally. Afraid Df heights, Laurent?\"\n He looked down the trail. The surface looked somewhat glassy, a 3it fast. Too slick for dogs\u0027 feet, certainly. He wondered if the runners .vould find any purchase to keep them on the track. The trail was Danked to keep them from flying off the mountain, but they had no way to control their speed.\n \"Not heights.\"\n \"What then?\"\n \"Putting my life in the hands of an Al.\"\n She smiled, and sat down on the front of the sled. \"Come on, Laurent. It\u0027s a very clever house.\"\n It was marvelous.\n The sled accelerated quickly, like a dropship spiraling down a gravity well. Laurent clung to it fiercely, his fingers wound into the leather straps that held it together. The runners found the ruts pre-cut deep into the ice and stayed in them, banking comfortably with the turns.\n The trail seemed never to pass into the shadow of the mountain; the clever house reflected sunlight from the surrounding peaks, the snow in their path glowing with the warm red of the rising sun. But his eyes still reduced to slits against the wind, the crisp air turned freezing by their velocity.\n Nara leaned back into Laurent\u0027s chest, laughing hysterically, her arms wrapped around his legs. She was warm, and her chaotic hair 229 brushed his cheeks. He squeezed his knees together tightly to hold her in the plummeting sled, and to keep her warmth against him.\n After four turns around the mountain, the trail slanted upward, slowing them as it straightened. The rise hid the terrain before them.\n \"I\u0027d do that again,\" Laurent shouted as the sled came almost to a halt.\n \"I don\u0027t think it\u0027s done,\" Nara said, shaking her head. \"Are you familiar with the term \u0027roller-coaster\u0027?\"\n \"I don\u0027t think-- Godspite!\"\n The sled had crested the rise, revealing a gut-loosening decline dotted with giant boulders. The trail ahead was lined with high snow banks, but the ruts guiding the runners suddenly disappeared, leaving the sled free for the straight decline. The slope was forty-five degrees at least.\n \"It\u0027s trying to kill us!\" Zai shouted.\n \"We\u0027ll see!\"\n Laurent and Nara clutched each other, screaming, as the sled dropped into the canyon of ice.\n After the acceleration of the first mad drop, the trail leveled, descending gradually between icy walls. The exposed interior of the glacier was deep blue, the color of a clear Vadan sky on the Day of Apogee. In the rift\u0027s protection, the air was still except for the wind of their passage, but Laurent held his lover closer. He touched his lips to her left ear, which was bright red and as cold as the metal buttons of her coat.\n \"Remember when I said we had no technology for slowing down time?\" he whispered.\n \"Yes?\"\n \"I was wrong. This lasts forever.\"\n She reached back and put a gloved finger to his lips softly, and Laurent felt foolish. It wasn\u0027t right to speak of these things. This was a fragile endlessness, soon followed by an onrushing of events that would part them for decades.\n Tomorrow, they would take the suborbital back to the capital. The commissioning of the Lynx was set for the day after. On Home, any such event would be a tremendous affair, lasting an entire night and filling the great square before the Diamond Palace with supplicants, zealots, and status-seekers. After that, Captain Zai had only a matter of weeks to train his crew in orbit before leaving for Legis.\n But he had these moments here with Nara. Against the weight of years and the depredations of the Time Thief, he had only the sharp and brittle thing that was now. Laurent wondered if it were possible that any alliance formed across days could really last decades. Or would what they\u0027d shared in this icy waste prove illusory, born of torturous memories, lack of sleep, and the romance of its own improbability?\n Of course, Laurent realized, what was real or unreal would be determined in the years to follow. Falling in love was never genuine in itself; what had happened in these four days would be given meaning over their decades apart. Like some figment of the quantum, love was made true only when measured against the rest of the world.\n The sled was slowing, and Laurent Zai sighed softly to himself. Thinking of the future, he had missed the present.\n Nara kissed him and stood. They were at the blind end of the rift.\n \"What now? Climb out?\" He looked back up the trail at the kilometers-distant house, just visible on its mountain peak. It would take hours.\n Nara shook her head and pointed to a patch of icicles, which shattered as something metal rumbled behind it. A door opened, and warm air rushed out carrying the scent of jasmine.\n \"Just through the tea gardens, I think,\" she said. \"I hope you don\u0027t mind riding in a drone elevator.\"\n Laurent smiled. \"So we can go again?\"\n \"Of course. As many times as you like.\"\n Something broke inside him, but the fissure didn\u0027t open onto the familiar well of sadness. Laurent found himself laughing hard, almost hysterically as he lifted the sled. Nara smiled quizzically, waiting as he gathered himself.\n When Laurent found his breath, the echo of his laughter still played at the edge of hearing. It was a wonder he hadn\u0027t brought an avalancheVdown upon them.\n He felt a small tear already freezing in the corner of one eye.\n \"Laurent?\"\n \"I was just thinking, Nara: You have a very clever house.\"\n Part 3\n WAR PRIZE When a single nation\u0027s armies are ordered against each other, all is lost.\n --ANONYMOUS 167\n Dead Woman\n The Other came to her talking of darkness.\n There were no words, just gray shapes issuing from a maw, inside a cave whose blackness invoked faerie lights upon her optic nerve. So dark that whispers rode the ears. Her blindness made things calm and rich.\n Rich, but so many things were missing now. The keen edges of desire, the pleasures of flesh, all the appetites of drama, expectation and dread, hope and disappointment--all the anguished terrain of uncertainty had been flattened into an arid plane. And soon, the Other explained, she would entirely forget the phantom shapes of those extinct emotions.\n It led her toward a bloodred horizon.\n She didn\u0027t know where they were headed, but she felt no worry. The Other explained that worry was one of those missing things.\n The dead woman took a deep, calm breath. No more fear, ever again.\n The red horizon opened up--like the slit of opening one\u0027s eyes.\n \"Rana Harter,\" a voice said.\n The woman at the end of her bed was short and had the gray skin of the dead. She wore an Imperial uniform, the dully glinting, gun-metal robe of the Political Apparatus.\n \"Yes. I know who I am.\"\n She nodded. \"My name is Adept Harper Trevim.\"\n \"Honored Mother,\" she said. The Other had prompted her with the proper form of address. (The Other lived inside her like an organ, like a software guide, like a subtle form of second sight.)\n \"You will live forever.\" Rana nodded. Then a moment of disorientation troubled her, as she wondered if she should be joyful. Immortality was the highest reward her society could bestow on any citizen, an honor that had seemed utterly out of her humble grasp. But joy was such a gross emotion. Instead, Rana Harter closed her eyes again and regarded the subtle beauty of eternity, which had the pleasures of a geometrical simple, the ray of her lifetime extending indefinitely.\n But the question lingered: Why was she--a militia worker, a lower-school dropout, and a recent traitor--one of the honored dead?\n \"How am I risen, Mother?\"\n \"By the action of the symbiant.\"\n A trivial answer, using the outsiders\u0027 word for the Other.\n \"I was never elevated, Mother.\"\n \"But you died at the hands of the enemy, Rana.\"\n \"I died in the arms of my lover,\" she answered. The self-damning words surprised her in a dull way, but it seemed that it was not within the dead to lie.\n The honored mother blinked.\n \"You were taken hostage, Rana Harter. A terrible experience. The minds of the living are fragile, and under stress they are bent with strange emotions. You suffered from a weakness called Stockholm Syndrome. Your \u0027love\u0027 for your captor was a perversion caused by the t~~* ,,( Aa-stu -\u003e nooH to hpnp nn to something, anything. But now you 237 have faced death and crossed it, and your mind is clear. Those feelings will pass.\" The adept brought her hands together. \"Perhaps they have passed already, and you spoke out of habit.\"\n Rana Harter narrowed her eyes. The Other prompted her to agree, but she found herself resisting. She remembered the avian precision of Herd\u0027s movements, the sure violet of her eyes, the alien pathways of her mind.\n \"We shall see, Mother.\"\n The dead woman nodded, unperturbed.\n \"You will discover your old life slipping away, Rana. And ultimately, you will be glad to be free of it.\"\n The honored mother held out a hand, and Rana grasped it. Tre-vim helped her rise into a seated position, and the bed re-formed to support her back. Her muscles felt different, strangely supple and free of tension, but a bit weak. Rana looked around the room. The walls were a deep, rich color, full of shapes and suggestive motions, immanent with potential, covered with old and pure ideas.\n She realized that this eloquent surface was painted with the color she had once called black. It was more than a color now.\n The two of them were silent for a time that could have been a minute or an hour, or longer. Then the honored mother spoke again.\n \"Rana Harter, let me ask you some questions.\"\n \"Certainly, Mother.\"\n The adept pressed her palms together.\n \"In your time with the Rixwoman, did you ever see signs of... another presence?\"\n \"You mean Alexander.\"\n Her eyebrows arched. \"Alexander?\"\n \"The compound mind, Mother. It chose a name from the history of Earth Prime. The founder of a great empire.\"\n \"Ah, yes. He died young, I believe.\"\n Rana shrugged, a gesture of millimeters among the dead. Trevim looked pleased, as if she were already making unexpected progress.\n \"The Apparatus has reason to suspect that this entity possessed certain critical information.\"\n Rana looked up at the black ceiling. \"Alexander is information. All the data on Legis.\"\n The honored mother shook her head. \"Not all. There are some things hidden away, crucial secrets. But there is evidence that the compound mind went to great lengths to uncover them. And to transmit them from Legis.\"\n \"Why don\u0027t you ask it?\"\n The adept frowned. \"Have you . . . spoken with this abomination?\"\n Rana sighed, her mind returning to the halcyon days of her captivity, learning the Rix language and working under Alexander\u0027s guidance on necessary changes to the entanglement facility. Rana remembered the embrace of the compound mind, the security of knowing that practically every object on the planet was imbued with her lover\u0027s protector.\n \"Spoken is the wrong word, Mother. But let me use the infostruc-ture, and perhaps I can find an answer for you.\"\n The adept shook her head. \"Alexander no longer exists.\"\n For a second, Rana felt one of the vanquished emotions of the living. Shock coursed through her, a sudden fire. The Other calmed it.\n \"How?\"\n \"We don\u0027t know. It seems to have fled. Or perhaps it simply ceased to exist.\"\n Rana closed her eyes, calling on her brainbug. She thought of the work she had done, when Alexander had helped her through the intricacies of the translight communication facility. The floating synesthesia icons of their researches appeared in memory, their meanings inflected by whatTrevim had just reported.\n Here in the arid place inside her dead woman\u0027s eyes, Rana\u0027s brainbug was different. It moved with new surety, open and confident where once it had been furtive. She could guide her ability now, instead of having to turn her mind away to give it freedom.\n In a few minutes, she saw the answer.\n \"Alexander sent itself away.\"\n The honored mother swallowed.\n \"Did it know?\" As she said these words, pain seemed to cross her face. Odd to see Dain in a dead woman.\n \"Did it know what?\"\n Trevim\u0027s features contorted again. \"The Emperor\u0027s Secret,\" she gasped.\n Rana narrowed her eyes.\n \"Are you well, Honored Mother?\"\n Adept Trevim wiped her brow, the gray skin of which shone with a milky-looking sweat. \"It is forbidden to speak of it,\" she managed, \"to one uninitiated.\"\n Rana Harter looked down at her bedclothes. Her mind moved lightly across the weeks she\u0027d spent in the shadow of Alexander. The brainbug searched for clues to what the adept might be talking about. But there was no purchase for the question; the evidence was insufficient.\n \"Mother, I know nothing about this.\"\n Trevim sighed, making the crude facial movements that showed a living person\u0027s relief. Then she nodded. \"I hoped you would not.\"\n Trevim stood silent for a few minutes, regaining her composure by staring at the engaging blackness of the walls.\n \"You will go on a journey now, Rana.\"\n \"Where?\"\n \"To meet the Emperor. He would speak to you of this.\"\n \"Home?\"\n \"Yes. A great honor.\"\n Rana frowned. The trip would take ten years Absolute. \"But where is Herd?\" she asked.\n \"Your Rix captor?\" The adept\u0027s face seemed to hold distress again. How agitated she was for a dead woman. The Other in Rana rippled with cool displeasure.\n \"Yes.\"\n \"Don\u0027t think of her, Rana. You must let that unfortunate episode pass into memory. You don\u0027t need such attachments anymore.\"\n Rana closed her eyes, thinking of the Rixwoman. When she opened them again, the honored mother was gone, leaving Rana alone with the question.\n Would her love for Herd really slip away?\n She stared at the walls and considered. The afterlife was clean, and pure, and good. The propaganda of the grays was true. Fear was vanquished now, the Old Enemy death had been beaten, and with it pain and need.\n But Rana Harter shook her head in quiet disagreement with the honored mother\u0027s words. She knew that she would always miss that other heaven, those weeks with her Rix lover that had changed everything. That time with Herd had been so short. The alien woman had given her happiness, had somehow placed her on the path to immortality.\n Most of all, the alien Herd had been beautiful, even more so than this wondrous blackness.\n Rana wanted to see her. Desired-- no other word was correct--the alien lemongrass of her touch. Where was her lover now?\n The Other calmed these thoughts before they grew too anxious. It explained that the still-living were never suitable companions for the dead. The pinks were like spoiled children, petty and tempestuous. They were ugly creatures, squalling brats who vied constantly for attention, for the baubles of wealth and power. They were blind to the subtle beauties of the darkness. The dead rightly kept themselves apart.\n You don\u0027t know Herd, Rana Harter thought.\n The Other was silent at this, as if it were a bit surprised.\n And Rana closed her eyes, slipping back across the red horizon onto the calm, arid plane of death, and soon was smiling, an odd expression for a dead woman.\n Executive Officer\n Katherie Hobbes awoke. \n","sourceLink":"https://allnovel.net/the-killing-of-worlds-succession-2/page-17.html","bookId":1753,"book":{"id":1753,"title":"The Killing of Worlds (Succession #2)","description":"Storyline: \n The Killing of Worlds (Succession #2) \n The immortal Emperor can grant a form of eternal life-after-death, creating an elite known as the Risen, and so has ruled the eighty worlds unchallenged for sixteen hundred years. The only thing he fears are the Rix, machine-augmented humans who worship AI compound minds. They are dedicated to replacing his prolonged rule with an eternal cybernetic dynasty of their own. Brilliant tactician Captain Laurent Zai of the Imperial Frigate Lynx faces a suicide mission: stopping the next thrust of the Rix invasion with just his own vessel. While ship-to-ship combat rages among the stars, Zai\u0027s lover, Senator Nara Oxham, is caught in a deadly political fencing match with the Emperor himself. The Emperor has a terrible secret, a secret Nara is in danger of finding out, a secret for which he would countenance the killing of worlds.\n \n","cover":"https://allnovel.net/images/the-killing-of-worlds-succession-2.jpg","author":"Scott Westerfeld","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-killing-of-worlds-succession-2.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:20:37 AM"}}
