{"id":28754,"no":4,"title":"CHAPTER III THE TURTLES","content":"SOMETIMES we find interesting little comedies mapped on the sands. One morning the July sun had come from behind the clouds, after a heavy rain, and quickly dried the surface, leaving the firm, wet sand underneath. On the dunes, walks are particularly delightful when the moist, packed sand becomes a yellow floor, but it requires much endurance and{48} enthusiasm to trudge through miles of soft sand on a hot day and retain a contemplative mood. We suddenly came upon some turtle tracks, beginning abruptly out on an open space, indicating that the traveler had probably withdrawn into the privacy and shelter of his mobile castle, and resumed his journey when the sun appeared. All traces of his arrival at the point where the tracks began had been obliterated by the rain. We were curious to ascertain his objective, and as the trail was in perfect condition, we followed it carefully for several hundred yards, when we found another trail interrupting it obliquely from another direction. Within an area of perhaps twenty feet in diameter the tracks had left a confused network on the smooth sand. Evidently there had been much discussion and consideration before a final decision had been reached. Then the trails started off in the same direction, side by side, varying from a foot to two feet or so apart. There was much mystery in all this. Our curiosity continued, and about half a mile farther on the smaller trail of the last comer suddenly veered off toward the lake and disappeared in the wet{49} sand of the beach. The original trail finally ended several hundred yards farther on in a clear stream, and there we saw Mr. Hardfinish resting quietly on the shallow bottom, with the cool current flowing over him. We may have stumbled on a turtle romance. Perhaps a tryst had been kept, and after much argument and persuasion the two had decided to combine their destinies. It may have been incompatibility of temperament, or affection grown cold, which caused the later estrangement. A fickle heart may have throbbed under the shell of the faithless amphibian who had joined the expedition, but whatever the cause of the separation was, the initiator of the journey had been left to finish it alone. His trail showed no wavering at the point of desertion, and evidently the rhythm of his march was not disturbed by it. There is much food for reflection in this story on the sand. What we call human nature is very largely the nature of all animal life, and community of interest governs all association. When it ceases to exist, the quadruped or biped invariably seeks isolation. Selfishness is soul solitude.{50} In the case of the turtles the highly civilized divorce courts were not necessary. They simply quit. The record of the little romance was written upon a frail page, which the next wind or shower obliterated as completely as time effaces most of the stories of human lives. The turtles are persistent wanderers. Their trails are found all through the dune country, and usually a definite objective seems to be indicated. A trail will begin at the margin of a small pond back of the hills, and follow practically a direct route for a long distance to another pond, often over a mile away. Sometimes high eminences intervene, which are patiently climbed over without material alteration in the course which the mysterious compass under the brown shell has laid before it. The deserted habitat may have been invaded by unwelcome new arrivals and rendered socially unattractive. Domestic complications may have inspired the pilgrimage, the voyager may have decided that he was unappreciated in the community in which he lived, or he may have been{51} excommunicated for unbelief in established turtle dogmas. The common variegated pond turtle, which is the variety most often found among the dunes, is a beautiful harmless creature, but his wicked cousin, the snapping turtle, is an ugly customer. He leads a life of debased villainy, and no justification for his existence has yet been discovered. He is a rank outlaw, and the enemy of everything within his radius of destruction. His crimes are legion, and like the sand-burr, he seems to be one of nature’s inadvertencies. The mother ducks, the frog folk, and all the small life in the sloughs dread his sinister bulk and relentless jaws. He is a voracious brute, and feeds upon all kinds of animal fare. He often attains a weight of about forty pounds, and the rough moss covered shell of a full grown specimen is sometimes fourteen inches long. One of the peculiarities of this repulsive wretch is that he strikes at his victims much in the same manner as a rattlesnake, and with lightning-like rapidity. Possibly he was sent into the world to assist in enabling us to accentuate our blessings by con{52}trast—as some people we occasionally meet undoubtedly were—and it is best to let him absolutely alone. He is an evil and unclean thing and we will pass him by. Like the skunk, he does not invite companionship, and has no social charms whatever. It was not he who helped to play the little comedy on the sand.","sourceLink":"http://novel.tingroom.com/duanpian/2707/74445.html","bookId":1441,"book":{"id":1441,"title":"The Dune Country","description":"简介： THE text and illustrations in this book are intended to depict a strange and picturesque country, with some of its interesting wild life, and a few of the unique human characters that inhabit it....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2707","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
