{"id":28755,"no":5,"title":"CHAPTER IV THE CROWS","content":"OF all the wild life among the dunes, the crow is the most active and conspicuous. He is ever present in the daytime, and his black form seems to be intimately associated with nearly every mass and contour in the landscape. \\n\\n \\n\\n The artists and the poets can love him, but the hand of the prosaic and the philistine is against him. His enemies are numberless, and his life is one of constant combat and elusion. The owls seek him at night, and during the day he meets antagonism in many forms. Some ornithologists have tried to find justification for the crow, but the weight of the testimony is against him. He pilfers the eggs and nestlings of the songsters, invades the newly planted cornfields, and apparently abuses every confidence reposed in him. \\n\\n \\n\\n He has been known to take his family into fields of sprouting potatoes and, when the plants were hardly out of the ground, feed its members on the{56} soft tubers which were used as seed. Even very young chickens and ducks enter into his economies. He is an inveterate mischiefmaker, and by those who fail to see the attractive sides of his character, is looked upon as a general nuisance. \\n\\n \\n\\n He cannot be considered valuable from a utilitarian point of view, but as a picturesque element he possesses many charms. Notwithstanding the sins laid at his door, this bird is of absorbing interest. His genteel insolence, his ability to cope with the wiles of his persecutors, and his complete self-assurance may well challenge our admiration. \\n\\n \\n\\n He takes full charge of the dune country before the morning sun appears above the horizon, and maintains his vigils until the evening shadows relieve him from further responsibility. All of the happenings on the sands, and among the pines, are subjected to his careful inspection and noisy comment. His curiosity is intense, and any unusual object or event will attract his excited scrutiny and an agitated assemblage of his friends. \\n\\n \\n\\n Like many people, he is both wise and foolish to a surprising degree. He is crafty and circumspect in his methods of obtaining food and avoid{57}ing most of his enemies, but shows a lack of judgment when his curiosity is aroused. \\n\\n \\n\\n He will approach quite near to a person sitting still, but will retreat in great trepidation at the slightest movement. An old crow knows the difference between a cane and a gun, but a man carrying a gun can ride a horse much nearer to him than he can go on foot. \\n\\n \\n\\n In the community life of the crows there is much material for study. Their social organization is cohesive and effective. It is impossible not to believe that they have a limited language. Different cries produce different effects among them. They undoubtedly communicate with each other. The older and wiser crows have qualities of leadership which compel or attract the obedience of the sable hordes that follow them in long processions through the air, to and from the feeding grounds, and to the roosting-places at night. \\n\\n \\n\\n The cries of the leaders are distinctive, and the entire band will wheel and change the direction of its flight when the loud signal comes from the head of the column. These bands often number several thousand birds.{58} \\n\\n \\n\\n After spending the day in detached groups, they gather late in the afternoon, and prepare for the flight to the roosting-grounds, which is an affair of the utmost importance and ceremony. A single scout will come ahead, and after slowly and carefully inspecting the area in the forest where the night is usually spent, he returns in the direction from which he came.{59} \\n\\n \\n\\n In a few minutes several crows come over the same course and apparently verify the conditions. These also return, and a little later, perhaps twenty or thirty more will appear and fly all over the territory under consideration. They go and report to the main body beyond the hills, and soon the horizon becomes black with the oncoming phalanxes, steadily winging their way to the chosen spot. \\n\\n \\n\\n For a long time the sky above it is filled with their dark forms, circling and hovering over and among the trees. Much uncertainty seems to agitate them, and there is a great deal of noisy confusion before even comparative quiet comes. It requires about half an hour for them to get comfortably settled after their arrival. Sentinels are posted and they maintain a vigilant watch during the night. \\n\\n \\n\\n I have sat quietly on a log and seen these multitudes settle into the trees around me in the deep woods. Although perfectly motionless, I have sometimes been detected by a watchful sentinel. His quick, loud note of alarm arouses the entire aggregation, and the air is immediately filled with{60} the turmoil of discordant cries and beating wings. Sacred precincts have been invaded, and an enemy is within the gates. \\n\\n \\n\\n After much anxiety, and shifting of positions, confidence seems to be finally restored, and the black masses on the bending boughs become quiet. \\n\\n \\n\\n A footfall on the dead leaves, the snapping of a twig, a suspicious movement among the trees, or the hoot of an owl, may alarm the wary watchers and start another uproar that will result in complete desertion of the vicinity of the suspected danger. \\n\\n \\n\\n When morning comes, various groups visit the beach and strut along the shore, drinking and picking up stray morsels. Dead fish that have been cast in by the waves, and numerous insects crawling on the sand, are eagerly devoured. Usually before sunrise the crows have started out over the country in detached flocks. \\n\\n \\n\\n Like all the affairs of the crows, courtship is a serious and important matter. The young male stretches his wings, struts dramatically, and performs all kinds of crow feats to attract favorable glances from the coy eyes of a black divinity who{61} sits demurely still and waits. After the manner of female kind, she will remain obdurate as long as supplication continues. She will yield only when it ceases. \\n\\n \\n\\n Several days are spent in the wooing. It often has its vicissitudes. The proverbial course of true love has its rough spots, for sometimes shiny-coated rivals come which are insistent and boisterous.{62} They refuse to respect a privacy that is much desired, and create unwelcome disturbances. \\n\\n \\n\\n There are battles in the tree-tops that send many black feathers down before the fickle beauty makes her final decision. She has little love for defeated suitors, and her admiration is the spoil of the victor when trouble comes. \\n\\n \\n\\n When the love-making is over the happy pair begin the construction of the nest, which is usually composed of broken twigs or small bits of grape vine, and lined with moss or dead grass. It is generally built about thirty feet from the ground among the strong branches in the deep woods. It is jealously guarded, and combats with would-be intruders are numerous and desperate. The sharp bills are effective weapons when the home is at stake, and it is a bold invader who would risk contact with them for the sake of the mottled eggs or the tender young in the nest. \\n\\n \\n\\n The crow may be a subtle and artful villain, and his evil ways may have brought him into disrepute, but he has picturesque quality. His black form is often an effective accent in composition, and his{63} presence adds character and interest to the waste places. \\n\\n \\n\\n The black roving flocks impart a peculiar charm to the white winter landscapes. The bleak uplands and the solemn trees in the still bare woods are enlivened by the dark busy forms. They seem undaunted by the cold and but few of them migrate. During the winter storms they find what refuge they can in the seclusion of the hollows in the deep woods, and among the heavy foliage of the pines. They eke out a precarious livelihood, with scanty food and uncertain shelter, until nature becomes more heedful of their wants and again sends the springtime into the world. \\n\\n \\n\\n This bird has his own peculiar and special ways of living, which are adapted to his own temperament and necessities. He is only a crow, and nature never intended that he should adjust himself to the convenience and desires of other forms of animal life. He is without ethics or conscience, and in this he differs little from the man with a gun. \\n\\n \\n\\n Some of the most pleasant memories of the dunes are clustered around “Billy,” a pet crow which re{64}mained with us one summer through the kindness of a naturalist friend. He was acquired at a tender age, a small boy having abstracted him from a happy home in an old tree in the deep woods. \\n\\n \\n\\n \\n\\n His early life was devoted principally to bread and milk, hard boiled eggs, bits of meat, and other food, with which he had to be constantly supplied. A large cage was built for his protection as well{65} as for his confinement, until he could become domesticated and strong enough to take care of himself. \\n\\n \\n\\n He became clamorous at unreasonable morning hours, and required constant attention during the day. His comical and whimsical ways soon found him a place in our affections, and Billy became a member of the family. \\n\\n \\n\\n He developed a decided character of his own. When he was old enough to fly he was given his freedom, which he utilized in his own way. He would spend a large part of his time in a nearby ravine, studying the problems of crow life, but his visits to the house were frequent, and his demands insistent when he was hungry. \\n\\n \\n\\n He would almost invariably discover the departure of any one of us who left the house, flying short distances ahead and waiting until he was overtaken, or proudly riding on our heads or shoulders, if he was not quite sure of the general direction of the expedition. \\n\\n \\n\\n The berry patch was a great attraction to him, and if we took a basket with us he would help{66} himself to the fruit after it had been picked, much preferring to have the picking done for him. \\n\\n \\n\\n One of his delights was walking back and forth on the hammock. The loose meshes seemed to fascinate him, and he would spend much time in studying its intricacies and picking at the knots. He soon became distantly acquainted with Gip, our black cocker spaniel. While no particular intimacy developed between them, each seemed to understand that the other was a part of the family. They finally got to the point where they would eat out of the same dish. \\n\\n \\n\\n Billy was a delightful companion on many sketching trips into the dunes, and it was amusing to watch the perplexities of the wild crows when my close association with one of their own kind was observed. They could not understand the relationship, and it gave rise to much animated discussion. Billy was immediately visited when he flew into a tree top, and carefully looked over. Other crows joined in the consultations and the final verdict was not always favorable, for hostility frequently became evident, and poor Billy was compelled to leave the tree, often with cruel{67} wounds. He was probably regarded as a heretic and a backslider, who had violated all crow traditions—a fit subject for ostracism and seclusion beyond the pale. \\n\\n \\n\\n He promptly responded to my call when he got into trouble, or thought it might be lunch-time. He would watch with much interest the undoing of the sandwiches, and would wait expectantly on my knee for the coveted tid-bits which constituted his share of the meal. \\n\\n \\n\\n When preparations were made for the return, Billy’s interest in the day’s proceedings seemed to flag, and he would suddenly disappear, not to be seen again until the next morning, when he would alight on the rail of the back porch and loudly demand his breakfast. \\n\\n \\n\\n I was never able to ascertain where he spent a great part of his time. His identity was, of course, lost when he was with the other crows unless he happened to get into a storm center near the house, and we only knew him when he was with us. \\n\\n \\n\\n He had the elemental love of color, which always begins with red, and the vermilion on my palette seemed to exercise a spell over him. After{68} getting his bill into it, he would plume and pick his feathers, and I have spent considerable time with a rag and benzine in trying to make him presentable after he had produced quite good post-impressionistic pictures on the feathers of his breast. \\n\\n \\n\\n Occasionally he would take my pencils or brushes into the trees while I was at work, and play with them for some time, but would not return anything that he had once secured. I often had difficulty in recovering lost articles, but usually he would accidentally drop them. In such cases there would be a race between us, for he quickly became jealous of their possession. \\n\\n \\n\\n Billy was, to a certain extent, affectionate, and would often come to be petted, alighting on my outstretched hand and holding his head down toward me. When his head feathers were stroked gently, low, contented sounds indicated the pleasure he took in the attention devoted to him. \\n\\n \\n\\n Stories of the numerous little tricks and insinuating ways of this interesting bird could occupy many pages, but enough has been told to convey an idea of his character. Perhaps he may have{69} been a rascal at heart, but his ancestry was responsible for his moral shortcomings. \\n\\n \\n\\n One morning we missed Billy, and we possibly have never seen him since. He may have answered “the call of the wild” and joined the black company that goes over into the back country in the morning and returns to the bluffs at night, or he may have fallen a victim to indiscriminating over-confidence in mankind—a misfortune that is not confined to crows. \\n\\n \\n\\n He left tender recollections with us. He had an engaging personality, and was a most admirable and lovable crow. Such an epitaph would be due him if he has departed from life, and a more sincere tribute could not be offered him if he still lives. \\n\\n \\n\\n During the following year I was able to approach quite near to a crow who seemed to show slight signs of recognition. A broken pinion in his left wing, a reminiscence of a vicious battle in the fall, seemed to complete the identification of Billy. He appeared to be making his headquarters in the ravine. Further careful observation and investigation convinced me that if this crow was actually Billy, he had laid three eggs.{70} \\n\\n \\n\\n The name, however, meant much to us, and by simply changing its spelling to “Billie,” we preserved its pleasant associations. \\n\\n \\n\\n It was a contented couple whose nest was in the gnarled branches in the ravine, where the little home was protected from the chill spring winds. In due time small, queer-looking heads appeared{71} above the edge of the nest, with widely opened bills that clamored continuously for the bits of food which the assiduous parents had to supply constantly. The nest required much attention. Marauding red squirrels, owls, hawks, and other enemies had to be kept away from the time the first egg was laid until the fledglings were old enough to fly. Their first attempts resulted in many falls, but they soon became experts, and one morning the entire family was gone. \\n\\n \\n\\n They probably flew over into the back country, where food was more abundant and where they were subjected to less observation. \\n\\n \\n\\n The nest was never used again. The twigs, little pieces of wild grapevine, and moss of which it was made, have gradually fallen away during the succeeding years, until but a few fragments remain in the tree crotch. A red lead pencil was found under the tree. Possibly “Billie” may have tucked it in among the twigs as a souvenir of former ties, or its color may have suggested esthetic adornment of a happy home. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2707/74446.html","bookId":1441,"book":{"id":1441,"title":"The Dune Country","description":"简介： THE text and illustrations in this book are intended to depict a strange and picturesque country, with some of its interesting wild life, and a few of the unique human characters that inhabit it....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2707","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
