{"id":79795,"no":4,"title":"Page 4","content":"Later. After the tears. Sitting around the living room. Annie had recovered from the worst of the shock. All three of us were drinking hot chocolate. I hadn\u0027t called the others in yet - I wanted some personal time with Annie before I dumped the full fallout from the War of the Scars upon her.\n Annie made me tell her more about my life. She wanted to hear about the countries I\u0027d visited, the people I\u0027d met, the adventures I\u0027d had. I told her some of the highlights, leaving out the darker aspects. She listened, dazed, touching me every few minutes to make sure I was real. When she heard I was a Prince, she laughed with delight. \"Does that make me a princess?\" she smiled.\n \"Afraid not,\" I chuckled.\n In return, Annie told me what her life had been like. The hard months after I\u0027d \u0027died\u0027. Slowly returning to normal. She was young, so she recovered, but Mum and Dad never really got over it. She raised the question of whether or not they should be told I was alive. Then, before I could speak, she said, \"No. They\u0027re happy now. It\u0027s too late to change the past. Best not to drag it up again.\"\n I paid close attention when she spoke about Steve. \"I was a teenager,\" she said angrily, \"mixed-up and unsure of myself. I had some friends but not many. And no serious boyfriend. Then Steve came back. He was only a few years older than me, but he looked and acted grown-up. And he was interested in me. He wanted to talk to me. He treated me like an equal.\"\n They spent a lot of time together. Steve put on a good act - kind, generous, loving. Annie thought he cared for her, that they had a future together. She fell in love with him, and gave her love to him. Then she found out she was expecting a baby.\n \"His face lit up when he heard,\" she said, shivering from the memory. Darius was by her side, solemn, silent, listening intently. \"He made me believe he was delighted, that we\u0027d get married and have lots of children together. He told me not to tell anyone - he wanted to keep it secret until we were husband and wife. He went away again. He said it was to earn money, to pay for our wedding and the baby\u0027s upkeep. He stayed away a long time. He returned late one night, while I was sleeping. Woke me up. Before I could say anything, he clamped a hand over my mouth and laughed. \u0027Too late to stop it now!\u0027 he mocked me. He said other things, horrible things. Then he left. I haven\u0027t heard from him since.\"\n She had to tell Mum and Dad about the baby then. They were furious - not with her, but with Steve. Dad would have killed Steve if he\u0027d found him. But nobody knew where Steve was. He\u0027d vanished.\n \"Raising Darius was hard,\" she smiled, ruffling his hair, \"but I wouldn\u0027t give up a day of it. Steve was wicked, but he gave me the most marvellous gift anyone could have ever given me.\"\n \"Soppy old cow,\" Darius grunted, fighting hard not to smile.\n I was quiet a long time after that. I wondered if Steve had meant to use Darius against me even then. This was back before he met the vampaneze and learnt of his abominable destiny. But I bet he was already planning my downfall, one way or the other. Did he deliberately get Annie pregnant, so he could use his nephew or niece to hurt me? Knowing Steve as I did, I guessed those were his exact intentions.\n Annie started telling me about her life with Darius, from how Mum and Dad helped rear him until they moved away, how the pair were managing now on their own. She worried about him not having a father, but her experience with Steve had made her wary of men, and she found it hard to trust anyone. I could have listened to Annie talk all night, telling tales about Mum, Dad and Darius. I was catching up on all those missed years. I felt like part of the family again. I didn\u0027t want it to stop.\n But we were in the middle of a crisis. I\u0027d delayed the moment of truth, but now I had to tell her about it. The night was drawing on, and I was keen to conclude the business I\u0027d come about. I let her finish the story she was telling - about Darius\u0027s first week in school - then asked if I could introduce her to some of my friends.\n Annie wasn\u0027t sure what to make of Vancha, Alice and Evanna. Alice dressed normally, but Vancha in his animal hides, with his straps of throwing stars and green hair, and the hirsute, deliriously ugly Evanna draped in ropes... They would have stuck out like a couple of gargoyles anywhere!\n But they were my friends (well, Vancha and Alice were, whatever about the witch), so Annie welcomed them - though I could tell she didn\u0027t entirely trust the trio. And I knew she sensed they weren\u0027t here just to make up the numbers. She guessed that something bad was coming.\n We made small talk for a while. Alice told Annie about her years on the police force, Vancha described some of his Princely duties and Evanna gave her tips on how to breed frogs (not that Annie had any interest in that!). Then Darius yawned. Vancha looked at me meaningfully - it was time.\n \"Annie,\" I started hesitantly, \"I told you Darius pledged himself to the vampaneze. But I didn\u0027t tell you what precisely that means.\"\n \"Go on,\" Annie said when I stalled.\n \"Steve blooded him,\" I said. \"He transferred some of his vampaneze blood to Darius. The blood isn\u0027t very strong within him, but it will strengthen. The cells will multiply and take over.\"\n \"You\u0027re saying he\u0027ll become like you?\" Annie\u0027s face was ashen. \"He won\u0027t age normally? He\u0027ll need to drink blood to survive?\"\n \"Yes.\" Her face crumpled - she thought that was the worst, the part I\u0027d been holding back. I wished I could spare her the truth, but I couldn\u0027t. \"There\u0027s more,\" I said, and she stiffened. \"Vampires can control their feeding habits. It isn\u0027t easy - it requires training - but we can. Vampaneze can\u0027t. Their blood forces them to kill every time they feed.\"\n \"No!\" Annie moaned. \"Darius isn\u0027t a killer! He wouldn\u0027t!\"\n \"He would,\" Vancha grunted. \"He\u0027d have no choice. Once a vampaneze gets the taste of blood, his urges consume him. He goes into a kind of trance and feeds until he\u0027s drained the source dry. He can\u0027t stop.\"\n \"But there must be some way to help him!\" Annie insisted. \"Doctors... surgery... medicine...\"\n \"No,\" Vancha said. \"This isn\u0027t a human disease. Your doctors could study him, and restrain him while he was feeding - but do you want your son to spend his life imprisoned?\"\n \"Also,\" I said, \"they couldn\u0027t stop him when he was older. As he comes into his full powers, he\u0027ll grow incredibly strong. They\u0027d have to keep him comatose to control him.\"\n \"No!\" Annie shouted, her face dark with stubborn rage. \"I won\u0027t allow this! There must be a way to save him!\"\n \"There is,\" I said, and she relaxed slightly. \"But it\u0027s dangerous. And it won\u0027t restore his humanity - it will merely drive him towards a different corner of the night.\"\n \"Don\u0027t talk in riddles!\" Annie snapped. \"What does he have to do?\" \"Become a vampire,\" I said. Annie stared at me in disbelief. \"It\u0027s not as bad as it sounds,\" I went on quickly. \"Yes, he\u0027d age slowly, but that\u0027s something you and he\n could learn to cope with. And yes, he\u0027d have to drink blood, but he wouldn\u0027t harm when he drank. We\u0027d teach him to master his urges.\" \"No,\" Annie said. \"There must be another way.\"\n \"There isn\u0027t,\" Vancha huffed. \"And even this way isn\u0027t certain. Nor is it safe.\" \"I\u0027ll have to trade blood with him,\" I explained. \"Pump my vampire cells into his body, and accept his vampaneze cells into mine. The vampire and vampaneze cells will attack each other. If all goes well, Darius will become a half-vampire and I\u0027ll carry on as before.\"\n \"But if it fails, you\u0027ll become a half-vampaneze and Darius won\u0027t change?\" Annie guessed, trembling at the thought of such a horrible fate. \"No,\" I said. \"It\u0027s worse that that. If it fails, I\u0027ll die - and so will Darius.\" And then I sat back numbly and awaited her decision. \n","sourceLink":"https://allnovel.net/sons-of-destiny-the-saga-of-darren-shan-12/page-4.html","bookId":2448,"book":{"id":2448,"title":"Sons of Destiny (The Saga of Darren Shan #12)","description":"Storyline: \n The Saga of Darren Shan #12: Sons of Destiny \n After Darren was told by Steve that Darius is also Darren\u0027s nephew, Darren couldn\u0027t bear to kill him. He was later shown taking Darius back to his house and there he also revealed his true identity to Annie, his sister. Darren also told Annie that Darius was blooded by Steve as a Vampaneze and he would kill everyone he feeds from. Annie was told about the life and history of Darren. Darren blooded Darius so he wouldn\u0027t have to kill as a Vampaneze and becomes a vampire instead. Darren, Alice Burgess, and Vancha would have to prepare for a break in at the stadium to save their friends and the Cirque performers...\n \n","cover":"https://allnovel.net/images/sons-of-destiny-the-saga-of-darren-shan-12.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/sons-of-destiny-the-saga-of-darren-shan-12.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:20:12 PM"}}
