{"id":11691,"no":14,"title":"Chapter 13","content":"Staines, where the road leaves Middlesex and crosses the Thames into Surrey, is almost as commonplace a little town as it is possible to find within the home counties. Late Georgian and Early Victorian stuccoed villas and square, box-like, quite uninteresting houses struggle for numerical superiority over later buildings in the long High Street, and the contest is not an exciting one. Staines, sixteen miles from London, is, in fact, of that nondescript—‘neither fish, flesh, fowl, nor good red-herring’—character that belongs to places situated in the marches of town and country. Almost everything of interest has vanished, and although the railway has come to Staines, it has not brought with it the life and bustle that are generally conferred by railways on places near London. But, of course, Staines is on the London and South-Western Railway, which explains everything.{82} \n \n Staines disputes with Colnbrook, on the Bath Road, the honour of having been the Roman station of Ad Pontes, and has the best of it, according to the views of the foremost authorities. ‘At the Bridges’ would doubtless have been an excellently descriptive name for either place, in view of the number of streams at both, and the bridges necessary to cross them; but the very name of Staines should of itself be almost sufficient to prove the Roman origin of the place, even if the Roman remains found in and about it were not considered conclusive evidence. There are those who derive ‘Staines’ from the ancient stone still standing on the north bank of the Thames, above the bridge, marking the historic boundary up-stream of the jurisdiction exercised over the river by the City of London; but there can be no doubt of its real origin in the paved Roman highway, a branch of the Akeman Street, on which this former military station of Ad Pontes stood. The stones of the old road yet remained when the Saxons overran the country, and it was named ‘the Stones’ by that people, from the fact of being on a paved highway. The very many places in this county with the prefixes, Stain, Stone, Stan, Street, Streat, and Stret, all, or nearly all, originate in the paved Roman roads (or ‘streets’) and fords; and there is little to support another theory, that the name of Staines came from a Roman milliarium, or milestone, which may or may not have stood somewhere here on the road. \n STAINES STONE \n \n The stone column, very like a Roman altar, standing on three steps and a square panelled plinth, and placed in a meadow on the north bank of the river, is{83} known variously as ‘Staines Stone,’ and ‘London Stone.’ It marks the place where the upper and lower Thames meet; is the boundary line of Middlesex and Buckinghamshire; and is also the boundary mark of the Metropolitan Police District. Besides these manifold and important offices, it also delimits the western boundary of the area comprised within the old London Coal and Wine Duties Acts, by which a tax, similar to the octroi still in force at the outskirts of many Continental towns, was levied on all coals, coke, and cinders, and all wines, entering London. Renewed from time to time, the imposts were finally abolished in 1889, but the old posts with cast-iron inscriptions detailing the number and date of the several Acts of Parliament under which these dues were levied, are still to be found beside the roads, rivers, and canals around London. \n \n Much weather-worn and dilapidated, ‘London Stone’ still retains long inscriptions giving the names of the Lord Mayors who have officially visited the spot as ex-officio chairmen of the Thames Conservancy;— \n Conservators of Thames from mead to mead, \n Great guardians of small sprites that swim the flood, \n Warders of London Stone, \n \n as Tom Hood mock-heroically sings. \n \n Above all is the deeply cut aspiration, ‘God Preserve the City of London, A.D. 1280.’ The pious prayer has been answered, and six hundred and twenty years later the City has been, like David, delivered out of the hands of the spoiler and from{84} the enemies that compassed it round about; by which Royal Commissions and the London County Council may be understood. \n Image unavailable: THE STAINES STONE. \n THE STAINES STONE. \n AD PONTES \n \n If the Roman legionaries could return to Ad Pontes and see Staines Bridge and the hideous iron girder bridge by which the London and South-Western Railway crosses the Thames they would be genuinely astonished. The first-named, which is the stone bridge built by Rennie in 1832, carries the{85} Exeter Road over the river, and is of a severe classic aspect which might find favour with the resurrected Romans; but what could they think of the other? \n \n We may see an additional importance in this situation of Ad Pontes in the fact that between Staines Bridge and London Bridge there was anciently no other passage across the river, save by the hazardous expedient of fording it at certain points. The only way to the West of England in medi?val times, it was then of wood, and zealously kept in repair by the grant of trees from the Royal Forest of Windsor and by the pontage, or bridge toll levied from passengers. Still, it was often broken down by floods. The poet Gay, in his Journey to Exeter, says, passing Hounslow:— \n Thence, o’er wide shrubby heaths, and furrowed lanes, \n We come, where Thames divides the meads of Staines. \n We ferried o’er; for late the Winter’s flood \n Shook her frail bridge, and tore her piles of wood. \n \n That would probably have been about the year 1720. In 1791 an Act of Parliament authorised the building of a new bridge, and accordingly a stone structure was begun, and eventually opened in 1797. This had to be demolished, almost immediately, owing to a failure of one of its piers, and an iron bridge was built in its stead, presently to meet with much the same fate. This, then, gave place to the existing bridge. \n \n The ‘Vine Inn,’ which once stood by the bridge and was a welcome sight to travellers, has disappeared, together with most of the old hostelries that once{86} rendered Staines a town of inns. Gone, too, is the ‘Bush,’ and others, although not demolished, have either retired into private life, or are disguised as commonplace shops. The ‘Angel’ still remains, but not the ‘Blue Boar,’ kept, according to Dean Swift, by the quarrelsome couple, Phyllis and John. Phyllis had run away from home on her wedding morn with John, who was her father’s groom, and a good-for-naught. At the inn they were installed at last, John as the drunken landlord, Phyllis as the kind landlady:— \n They keep at Staines the Old Blue Boar, \n Are cat and dog— \n \n and other things unfitted for ears polite. \n \n The church is without interest, but there lies in its churchyard, among the other saints and sinners, Lady Letitia Lade, the foul-mouthed cast-off chère amie of the Prince Regent, who married her off to John Lade, his coachman, whom he knighted for his complaisance. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1738/50895.html","bookId":1129,"book":{"id":1129,"title":"The Exeter Road","description":"简介： THIS, the fifth volume in a series of works purporting to tell the Story of the Great Roads, requires but few forewords; but occasion may be taken to say that perhaps greater care has been exercised than in preceding volumes to collect and put on rec...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1738","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
