{"id":11710,"no":33,"title":"Chapter 32","content":"Soon after those two comrades had met their end, there arose a highway-woman to trouble the district. This was Mary Sandall, of Baverstock, a young woman of twenty-four years of age, who had borrowed a pair of pistols and a suit of his clothes from the blacksmith of Quidhampton, and, bestriding a horse, set out one day in the spring of 1779, and meeting Mrs. Thring, of North Burcombe, robbed her of two shillings and a black silk cloak. Mrs. Thring went home and raised an alarm, with the result that Mary Sandall was captured, and committed for trial at the next assizes. Although there seems to have been some idea that this was a practical joke, the authorities were thick-headed persons who had heard too much of the real thing to be patient with an amateur highway-woman, and so they sentenced Mary Sandall to death in due form, although she was afterwards respited as a matter of course. \n WILLIAM PEARE \n \n William Peare was the next notability of the roads, but it is not certain that he was the one who stopped Mr. Jeffery, of Yateminster, on his way home from Weyhill, 9th October 1780, and knocking him off his horse, robbed him of ￡500 in bank-notes and ￡37 in coin. It was the same unknown,{229} doubtless, who during the same week robbed a Mrs. Turner, of Upton Scudamore, of ￡45, in broad daylight. He was a ‘genteelly-dressed’ stranger. Making a low bow, he requested her money, and that within sight of many people working in the fields, who concluded, from his polite manners, that he was a friend of the lady. \n \n William Peare was only twenty-three years of age when he was executed, 19th August 1783. His first important act was the robbing of the Chippenham coach on the 2nd of February 1782. Captured, and lodged in Gloucester Gaol, he escaped on the 19th of April, and began a series of the most daring highway robberies. On the 8th of February 1783 he stopped the Salisbury diligence just beyond St. Thomas’s Bridge, smashed the window, and fired a shot into the coach, terrifying the lady and gentleman who were the only two passengers, so that they at once gave up their purses. He then went on to Stockbridge, where he stopped a diligence full of military officers; but finding the occupants prepared to fight for the military chest they were escorting, hurried off. After many other crimes in the West, he was captured in the act of undermining a bank at Stroud, in Gloucestershire. He was tried and sentenced at Salisbury, and executed at Fisherton, going to the gallows with the customary nosegay, which remained tightly held in his hand when his body was cut down. A set of verses, purporting to be by his sweetheart, was published that year, lamenting his untimely end:—{230} \n For me he dared the dangerous road, \n My days with goodlier fare to bless; \n He took but from the miser’s hoard, \n From them whose station needed less. \n \n Highwaymen continued numerous at the dawn of the nineteenth century, as may be judged from the executions at Fisherton Gaol, or on the scenes of their misdeeds, that continued to afford a spectacle for the mob. For highway robbery alone one man was hanged in 1806, one in 1816, two in 1817, and two in 1824; while three were sentenced to fifteen years’ transportation in 1839 for a similar offence near Imber, in the very centre of the Plain. \n A TRAGEDY OF THE PLAIN \n \n The spot was Gore Cross, a solitary waste; time and date, seven o’clock on the evening of 21st October 1839. Upon this wilderness entered Mr. Matthew Dean, of Imber, returning on horseback from Devizes Fair, when he was suddenly set upon by four men, dragged off his horse, and robbed of ￡20 in notes of the North Wilts Bank, and ￡3: 10s. in coin. The gang then made off, but Mr. Dean followed them on foot. On the way he met Mr. Morgan, of Chitterne; but being afraid that the men carried pistols they decided to get more help before pursuing them farther. So they called on a Mr. Hooper, who joined the chase on horseback, armed with a double-barrelled gun. Meeting a Mr. Sainsbury, he accompanied the party, and, pressing on, they presently came in sight of the men. One ran away for some miles at a great pace, and they could not overtake him until about midway between Tilshead and Imber, where he fell down and lay still on{231} \n Image unavailable: HIGHWAY ROBBERY MONUMENT AT IMBER. \n HIGHWAY ROBBERY MONUMENT AT IMBER. \n \n the grass. His pursuers thought this to be a feint, and were afraid to seize him, so they continued the chase of the other three, who were eventually captured. The next day the body of the unfortunate man was found where he had fallen, quite dead. He had died from heart disease. An inquest was held on him, and the curious verdict of felo-de-se returned, according to the law which holds a person a suicide who commits an unlawful act, the consequence{232} of which is his death. Two memorial stones mark the spot where the robbery took place and the spot, two miles distant, where the man fell. \n \n The times were still dangerous for wayfarers here, for a few weeks later, on the night of 16th November, between nine and ten o’clock P.M., a Mr. Richard Brown, of Little Pannel, driving a horse and cart, was attacked by two footpads near Gore Cross Farm. One seized the horse, while the other gave him two tremendous blows on the head with a bludgeon, which almost deprived him of his senses. Recovering, he knocked the fellow down with his fist. Then the two jumped into the cart and robbed him of ten shillings, running away when he called for help, and leaving him with his purse containing ￡14 in notes and gold. \n \n With this incident the story of highway robbery on Salisbury Plain comes to an end, and a very good thing too. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1738/50914.html","bookId":1129,"book":{"id":1129,"title":"The Exeter Road","description":"简介： THIS, the fifth volume in a series of works purporting to tell the Story of the Great Roads, requires but few forewords; but occasion may be taken to say that perhaps greater care has been exercised than in preceding volumes to collect and put on rec...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1738","creation":"Aug 1, 2019 12:24:25 AM","modification":"Aug 1, 2019 12:24:25 AM"}}
