{"id":33593,"no":20,"title":"Chapter 20. His Fate.","content":"CLEVE VERNEY, as we know, was a young gentleman in whose character were oddly mingled impetuosity and caution. A certain diplomatic reserve and slyness had often stood him in stead in the small strategy of life, and here, how skillfully had he not managed his visits to Penruthyn, and hid from the peering eyes of Cardyllian his walks and loiterings about the enchanted woods of Malory. Visiting good Mrs. Jones’s shop next day to ask her how she did, and gossip a little across the counter, that lady, peering over her spectacles, received him with a particularly sly smile, which, being prone to alarms just then, he noted and did not like. Confidential and voluble as usual, was this lady, bringing her black lace cap and purple ribbons close to the brim of Mr. Verney’s hat, as she leaned over the counter, and murmured her emphatic intelligence and surmises deliberately in his ear. She came at last to say — “You must be very solitary, we all think, over there, at Ware, sir; and though you have your yacht to sail across in, and your dog-cart to trot along, and doesn’t much mind, still it is not con venient, you know, for one that likes this side so much better than the other. We think, and wonders, we all do, you wouldn’t stay awhile at the Verney Arms, over the way, and remain among us, you know, and be near everything you might like; the other side, you know, is very dull; we can’t deny that, though its quite true that Ware is a very fine place — a really beautiful place — but it is lonely, we must allow; mustn’t we?” “Awfully lonely,” acquiesced Cleve, “but I don’t quite see why I should live at the Verney Arms, notwithstanding.” “Well, they do say — you mustn’t be angry with them, you know — but they do, that you like a walk to Malory,” and this was accompanied with a wonderfully cunning look, and a curious play of the crow’s-feet and wrinkles of her fat face, and a sly, gentle laugh. “But I don’t mind.” “Don’t mind what?” asked Cleve, a little sharply. “Well, I don’t mind what they say, but they do say you have made acquaintance with the Malory family — no harm in that, you know.” “No harm in the world, only a lie,” said Cleve, with a laugh that was not quite enjoying. “I wish they would manage that introduction for me; I should like it extremely. I think the young lady rather pretty — don’t you? — and I should not object to pay my respects, if you think it would not be odd. My Cardyllian friends know so much better than I what is the right thing to do. The fact is, I don’t know one of our own tenants there, except for taking off my hat twice to the only sane one of the party, that old Miss Anne — Anne —something— you told me —” “Sheckleton that will be,” supplemented Mrs. Jones. “Sheckleton. Very well; and my real difficulty is this — and upon my honour, I don’t know how to manage it. My grandmother, Lady Verney, puts me under orders — and you know she does not like to be disobeyed — to go and see poor old Rebecca, Mrs. Mervyn, you know, at the steward’s house, at Malory; and I am looking for a moment when these people are out of the way, just to run in for five minutes, and ask her how she does. And my friend, Wynne Williams, won’t let me tell Lady Verney how odd these people are, he’s so afraid of her hearing the rumour of their being mad. But the fact is, whenever I go up there and peep in through the trees, I see some of them about the front of the house, and I can’t go up to the door, of course, without annoying them, for they wish to be quite shut up; and the end of it is, I say, that, among them, I shall get blown up by Lady Verney, and shan’t know what to answer — by Jove! But you may tell my friends in Cardyllian, I am so much obliged to them for giving me credit for more cleverness than they have had in effecting an introduction; and talking of me about that pretty girl, Miss — oh! — what’s her name? — at Malory. I only hope she’s not mad; for if she is I must be also.” Mrs. Jones listened, and looked at him more gravely, for his story hung pretty well together, and something of its cunning died out of the expression of her broad face. But Cleve walked away a little disconcerted, and by no means in a pleasant temper with his good neighbours of Cardyllian; and made that day a long visit at Hazelden, taking care to make his approaches as ostentatiously as he could. And he was seen for an hour in the evening, walking on the green with the young ladies of that house, Miss Charity flanking the little line of march on one side, and he the other, pretty Miss Agnes, of the golden locks, the pretty dimples, and brilliant tints, walking between, and listening, I’m afraid, more to the unphilosophic prattle of young Mr. Verney than to the sage conversation, and even admonitions and reminders, of her kind, but unexceptionable sister. From the news-room windows, from the great bow-window of the billiard-room, this promenade was visible. It was a judicious demonstration, and gave a new twist to conjecture; and listless gentlemen, who chronicled and discussed such matters, observed upon it, each according to his modicum of eloquence and wisdom. Old Vane Etherage, whose temperament, though squally, was placable, was won by the frank courtesy, and adroit flatteries of the artless young fellow who had canvassed boroughs and counties, and was master of a psychology of which honest old Etherage knew nothing. That night, notwithstanding, Cleve was at the gate of Malory, and the two ladies were there. “We have been looking at the boat ten minutes, just, since it left. Sir Booth is out as usual, and now see how far away; you can scarcely see the sail, and yet so little breeze.” “The breeze is rather from the shore, and you are sheltered here, all this old wood, you know. But you can hear it a little in the tops of the trees,” Cleve answered, caring very little what way the breeze might blow, and yet glad to know that Sir Booth was on his cruise, and quite out of the way for more than an hour to come. “We intended venturing out as far as the pier, there to enjoy once more that beautiful moonlight view, but Sir Booth went out to-night by the little door down there, and this has been left with its padlock on. So we must only treat this little recess as the convent parlour, with the grating here, at which we parley with our friends. Do you hear that foolish old dog again? I really believe he has got out of the yard,” suddenly exclaimed good-natured Miss Anne, who made the irregularities of old Neptune an excuse for trifling absences, very precious to Cleve Verney. So now, she walked some ten or twenty steps toward the house, and stood there looking up the avenue, and prattling incessantly, though Cleve could not hear a word she said, except now and then the name of “Neptune,” when she ineffectually accosted that remote offender. “You have not said a word, Miss Fanshawe. You are not offended with me, I hope?” he murmured. “Oh, no.” “You have not shaken hands,” he continued, and he put his hand between the bars; “won’t you?” So she placed hers in his. “And now, can you tell me nothing?” “I’ve been thinking that I may as well speak now,” she said, in very low tones. “There must be uncertainty, I believe, in all things, and faith in those who love us, and trust that all may end in good; and so, blindly— almost blindly— I say, yes, if you will promise me — oh! promise, that you will always love me, as you do now, and never change. If you love me, I shall love you, always; and if you change, I shall die. Oh! won’t you promise?” Poor fluttering heart! The bird that prunes its wing for the untried flight over the sea, in which to tire is to die, lonely, in the cold waste, may feel within its little breast the instinct of that irrevocable venture, the irresistible impulse, the far-off hope, the present fear and danger, as she did. Promises! What are they? Who can answer for the follies of the heart, and the mutations of time? We know what we are; we know not what we may be. Idlest of all idle words are these promises for the affections, for the raptures and illusions, utterly mortal, whose duration God has placed quite beyond our control. Kill them, indeed, we may, but add one hour to their uncertain lives, never. Poor trembling heart! “Promise never to change. Oh! won’t you promise?” Promises spoken to the air, written in dust — yet a word, a look, like a blessing or a hope — ever so illusive, before the wing is spread, and the long and untried journey begins! What Cleve Verney swore, and all the music he poured into those little listening ears in that enchanting hour, I know not. Miss Anne Sheckleton came back. Through the convent bars Cleve took her hand, in a kind of agitation, a kind of tumult, with rapture in his handsome face, and just said, “She has told me, she will” and Miss Sheckleton said nothing, but put her arms round Margaret’s neck, and kissed her many times, and holding her hand, looked up smiling, and took Cleve’s also, and in the old spinster’s eyes were glittering those diamond tears, so pure and unselfish that, when we see them, we think of those that angels are said to weep over the sorrows and the vanities of human life. Swiftly flew the hour, and not till the sail was nearing the shore, and the voices of the boatmen were audible across the water, did the good old lady insist on a final farewell, and Cleve glided away, under the shadow of the trees that overhang the road, and disappeared round the distant angle of the wall of Malory.","sourceLink":"http://novel.tingroom.com/jingdian/1365/40934.html","bookId":1450,"book":{"id":1450,"title":"The Tenants of Malory","description":"简介： This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1365","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
