{"id":33638,"no":65,"title":"Chapter 18. Mr. Dingwell and Mrs. Mervyn Converse.","content":"CLEVE was assiduous in consoling Miss Caroline Oldys, a duty specially imposed upon him by the voluntary absence of Lady Wimbledon, who spent four or five hours every day at Malory, with an equally charitable consideration for the spirits of Lord Verney, who sat complaining in pain and darkness. \\n\\n \\n\\n Every day he saw more or less of the Rev. Isaac Dixie, but never alluded to his midnight interview with him at Clay Rectory. Only once, a little abruptly, he had said to him, as they walked together on the green —— \\n\\n \\n\\n “I say, you must manage your duty for two Sundays more — you must stay here for the funeral — that will be on Tuesday week.” \\n\\n \\n\\n Cleve said no more; but he looked at him with a fixed meaning in his eye, with which the clergyman somehow could not parley. \\n\\n \\n\\n At the post-office, to which Miss Oldys had begged his escort, a letter awaited him. His address was traced in the delicate and peculiar hand of that beautiful being who in those very scenes had once filled every hour of his life with dreams, and doubts, and hopes; and now how did he feel as those slender characters met his eye? Shall I say, as the murderer feels when some relic of his buried crime is accidentally turned up before his eyes — chilled with a pain that reaches on to doomsday — with a tremor of madness — with an insufferable disgust? \\n\\n \\n\\n Smiling, he put it with his other letters in his pocket, and felt as if every eye looked on him with suspicion — with dislike; and as if little voices in the air were whispering, “It is from his wife — from his wife — from his wife.” \\n\\n \\n\\n Tom Sedley was almost by his side, and had just got his letters — filling him, too, with dismay — posted not ten minutes before from Malory, and smiting his last hope to the centre. \\n\\n \\n\\n “Look at it, Cleve,” he said, half an hour later. “I thought all these things might have softened him — his own illness and his mother’s death; and the Etherages — by Jove, I think he’ll ruin them; the poor old man is going to leave Hazelden in two or three weeks, and — and he’s utterly ruined I think, and all by that d — d lawsuit, that Larkin knows perfectly well Lord Verney can never succeed in; but in the meantime it will be the ruin of that nice family, that were so happy there; and look — here it is — my own letter returned — so insulting — like a beggar’s petition; and this note — not even signed by him.” \\n\\n \\n\\n “Lord Verney is indisposed; he has already expressed his fixed opinion upon the subject referred to in Mr. Sedley’s statement, which he returns; he declines discussing it, and refers Mr. Sedley again to his solicitor.” \\n\\n \\n\\n So, disconsolate Sedley, having opened his griefs to Cleve, went on to Hazelden, where he was only too sure to meet with a thoroughly sympathetic audience. \\n\\n \\n\\n A week passed, and more. And now came the day of old Lady Verney’s funeral. It was a long procession — tenants on horseback, tenants on foot — the carriages of all the gentlemen round about. \\n\\n \\n\\n On its way to Penruthyn Priory the procession passed by the road, ascending the steep by the little church of Llanderris, and full in view, through a vista in the trees, of the upper windows of the steward’s house. \\n\\n \\n\\n Our friend Mr. Dingwell, whose journey had cost him a cold, got his clothes on for this occasion, and was in the window, with a field-glass, which had amused him on the road from London. \\n\\n \\n\\n He had called up Mrs. Mervyn’s servant girl to help him to the names of such people as she might recognise. \\n\\n \\n\\n As the hearse, with its grove of sable plumes, passed up the steep road, he was grave for a few minutes; and he said — \\n\\n \\n\\n “That was a good woman. Well for you, ma’am, if you have ever one-twentieth part of her virtues. She did not know how to make her virtues pleasant, though; she liked to have people afraid of her; and if you have people afraid of you, my dear, the odds are they’ll hate you. We can’t have everything — virtue and softness, fear and love — in this queer world. An excellent — severe — most ladylike woman. What are they stopping for now? Oh! There they go again. The only ungenteel thing she ever did is what she has begun to do now — to rot; but she’ll do it alone, in the dark, you see; and there is a right and a wrong, and she did some good in her day.” \\n\\n \\n\\n The end of his queer homily he spoke in a tone a little gloomy, and he followed the hearse awhile with his glass. \\n\\n \\n\\n In two or three minutes more the girl thought she heard him sob; and looking up, with a shock, perceived that his face was gleaming with a sinister laugh. \\n\\n \\n\\n “What a precious coxcomb that fellow Cleve is — chief mourner, egad — and he does it pretty well. ‘My inky cloak, good mother.’ He looks so sorry, I almost believe he’s thinking of his uncle’s wedding. ‘Thrift, Horatio, thrift!’ I say, miss — I always forget your name. My dear young lady, be so good, will you, as to say I feel better today, and should be very happy to see Mrs. Mervyn, if she could give me ten minutes?” \\n\\n \\n\\n So she ran down upon her errand, and he drew back from the window, suffering the curtain to fall back as before, darkening the room; and Mr. Dingwell sat himself down, with his back to the little light that entered, drawing his robe-dechambre about him and resting his chin on his hand. \\n\\n \\n\\n “Come in, ma’am,” said Mr. Dingwell, in answer to a tap at the door, and Mrs. Mervyn entered. She looked in the direction of the speaker, but could see only a shadowy outline, the room was so dark. \\n\\n \\n\\n “Pray, madam, sit down on the chair I’ve set for you by the table. I’m at last well enough to see you. You’ll have questions to put to me. I’ll be happy to tell you all I know. I was with poor Arthur Verney, as you are aware, when he died.” \\n\\n \\n\\n “I have but one hope now, sir — to see him hereafter. Oh, sir! did he think of his unhappy soul — of heaven.” \\n\\n \\n\\n “Of the other place he did think, ma’am. I’ve heard him wish evil people, such as clumsy servants and his brother here, in it; but I suppose you mean to ask was he devout — eh?” \\n\\n \\n\\n “Yes, sir; it has been my prayer, day and night, in my long solitude. What prayers, what prayers, what terrible prayers, God only knows.” \\n\\n \\n\\n “Your prayers were heard, ma’am; he was a saint.” \\n\\n \\n\\n “Thank God!” \\n\\n \\n\\n “The most punctual, edifying, self-tormenting saint I ever had the pleasure of knowing in any quarter of the globe,” said Mr. Dingwell. \\n\\n \\n\\n “Oh! thank God.” \\n\\n \\n\\n “His reputation for sanctity in Constantinople was immense, and at both sides of the Bosphorus he was the admiration of the old women and the wonder of the little boys, and an excellent Dervish, a friend of his, who was obliged to leave after having been bastinadoed for a petty larceny, told me he has seen even the town dogs and the asses hold down their heads, upon my life, as he passed by, to receive his blessing!” \\n\\n \\n\\n “Superstition — but still it shows, sir”—— \\n\\n \\n\\n “To be sure it does, ma’am.” \\n\\n \\n\\n “It shows that his sufferings — my darling Arthur — had made a real change.” \\n\\n \\n\\n “Oh! a complete change, ma’am. Egad, a very complete change, indeed!” \\n\\n \\n\\n “When he left this, sir, he was — oh! my darling! thoughtless, volatile”—— \\n\\n \\n\\n “An infidel and a scamp — eh? So he told me, ma’am.” \\n\\n \\n\\n “And I have prayed that his sufferings might be sanctified to him,” she continued, “and that he might be converted, even though I should never see him more.” \\n\\n \\n\\n “So he was, ma’am; I can vouch for that,” said Mr. Dingwell. \\n\\n \\n\\n Again poor Mrs. Mervyn broke into a rapture of thanksgiving. \\n\\n \\n\\n “Vastly lucky you’ve been, ma’am; all your prayers about him, egad, seem to have been granted. Pity you did not pray for something he might have enjoyed more. But all’s for the best — eh?” \\n\\n \\n\\n “All things work together for good — all for good,” said the old lady, looking upward, with her hands clasped. \\n\\n \\n\\n “And you’re as happy at his conversion, ma’am, as the Ulema who received him into the faith of Mahomet —happier, I really think. Lucky dog! what interest he inspires, what joy he diffuses, even now, in Mahomet’s paradise, I dare say. It’s worth while being a sinner for the sake of the conversion, ma’am.” \\n\\n \\n\\n “Sir — sir, I can’t understand,” gasped the old lady, after a pause. \\n\\n \\n\\n “No difficulty, ma’am, none in the world.” \\n\\n \\n\\n “For God’s sake, don’t; I think I’m going mad” cried the poor woman. \\n\\n \\n\\n “Mad, my good lady! Not a bit. What’s the matter? Is it Mahomet? You’re not afraid of him?” \\n\\n \\n\\n “Oh, sir, for the Lord’s sake tell me what you mean?” implored she, wildly. \\n\\n \\n\\n “I mean that, to be sure; what I say,” he replied. “I mean that the gentleman complied with the custom of the country — don’t you see? — and submitted to Kismet. It was his fate, ma’am; it’s the invariable condition; and they’d have handed him over to his Christian compatriots to murder, according to Frank law, otherwise. So, ma’am, he shaved his head, put on a turban — they wore turbans then — and, with his Koran under his arm, walked into a mosque, and said his say about Allah and the rest, and has been safe ever since.” \\n\\n \\n\\n “Oh, oh, oh!” cried the poor old lady, trembling in a great agony. \\n\\n \\n\\n “Ho! no, ma’am; ‘twasn’t much,” said he, briskly. \\n\\n \\n\\n “All, all; the last hope!” cried she, wildly. \\n\\n \\n\\n “Don’t run away with it, pray. It’s a very easy and gentlemanlike faith, Mahometanism — except in the matter of wine; and even that you can have, under the rose, like other things here, ma’am, that aren’t quite orthodox; eh?” said Mr. Dingwell. \\n\\n \\n\\n “Oh, Arthur, Arthur!” moaned the poor lady distractedly, wringing her hands. \\n\\n \\n\\n “Suppose, ma’am, we pray it may turn out to have been the right way. Very desirable, since Arthur died in it,” said Mr. Dingwell. \\n\\n \\n\\n “Oh, sir, oh! I couldn’t have believed it. Oh, sir, this shock — this frightful shock!” \\n\\n \\n\\n “Courage, madam! Console yourself. Let us hope he didn’t believe this any more than the other,” said Mr. Dingwell. \\n\\n \\n\\n Mrs. Mervyn leaned her cheek on her thin clasped hands, and was rocking herself to and fro in her misery. \\n\\n \\n\\n “I was with him, you know, in his last moments,” said Mr. Dingwell, shrugging sympathetically, and crossing his leg. “It’s always interesting, those last moments — eh? — and exquisitely affecting, even —particularly if it isn’t very clear where the fellow’s going.” \\n\\n \\n\\n A tremulous moan escaped the old lady. \\n\\n \\n\\n “And he called for some wine. That’s comforting, and has a flavour of Christianity, eh? A relapse, don’t you think, very nearly? — at so unconvivial a moment. It must have been principle; eh? Let us hope.” \\n\\n \\n\\n The old lady’s moans and sighs were her answers. \\n\\n \\n\\n “And now that I think on it, he must have died a Christian,” said Mr. Dingwell, briskly. \\n\\n \\n\\n The old lady looked up, and listened breathlessly. \\n\\n \\n\\n “Because, after we thought he was speechless, there was one of those what-d’ye-call-‘ems — begging dervish fellows — came into the room, and kept saying one of their long yarns about the prophet Mahomet, and my dying friend made me a sign; so I put my ear to his lips, and he said distinctly, ‘He be d — d!’— I beg your pardon; but last words are always precious.” \\n\\n \\n\\n Here came a pause. \\n\\n \\n\\n Mr. Dingwell was quite bewildering this trembling old lady. \\n\\n \\n\\n “And the day before,” resumed Mr. Dingwell, “Poor Arthur said, ‘They’ll bury me here under a turban; but I should like a mural tablet in old Penruthyn church. They’d be ashamed of my name, I think; so they can put on it the date of my decease, and the simple inscription, Check-mate.’ But whether he meant to himself or his creditors I’m not able to say.” \\n\\n \\n\\n Mrs. Mervyn groaned. \\n\\n \\n\\n “It’s very interesting. And he had a message for you, ma’am. He called you by a name of endearment. He made me stoop, lest I should miss a word, and he said, ‘Tell my little linnet,’ said he”— \\n\\n \\n\\n But here Mr. Dingwell was interrupted. A wild cry, a wild laugh, and —“Oh, Arthur, it’s you!” \\n\\n \\n\\n He felt, as he would have said, “oddly” for a moment — a sudden flood of remembrance, of youth. The worn form of that old outcast, who had not felt the touch of human kindness for nearly thirty years, was clasped in the strain of an inextinguishable and angelic love — in the thin arms of one likewise faded and old, and near the long sleep in which the heart is fluttered and pained no more. \\n\\n \\n\\n There was a pause, a faint laugh, a kind of sigh, and he said — \\n\\n \\n\\n “So you’ve found me out.” \\n\\n \\n\\n “Darling, darling! you’re not changed?” \\n\\n \\n\\n “Change!” he answered, in a low tone. “There’s a change, little linnet, from summer to winter; where the flowers were the snow is. Draw the curtain, and let us look on one another.” \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1365/40979.html","bookId":1450,"book":{"id":1450,"title":"The Tenants of Malory","description":"简介： This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1365","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
