{"id":100094,"no":21,"title":"Page 21","content":"\n “I\u0027m making you and me dinner,” she declared, and eyeballed the tiny button for the minimized window. “Watcha doing?”\n “Research for Cian,” Roberto answered truthfully, but did not enlarge the window.\n Samantha tossed back her shoulder length hair and flopped onto the second computer chair that Cian had bought just for her. She tended to lurk when he was on the computer. Bothered with her hanging over his shoulder, Cian had bought a chair for her to sit in. Samantha reacted like it was a sweet gesture, even if it was born out of annoyance. Cian was on the computer a lot lately. He was taking another online course to get yet another degree. Without a doubt, Roberto\u0027s master and Samantha\u0027s fiancé was an information whore. Or maybe he was just bored after being a alive for so long. Roberto wasn\u0027t sure which.\n “You\u0027re hiding something,” she chided Roberto. “Cian does his own homework.”\n “Not homework. Business related,” Roberto answered with a charming smile.\n “You do remember the part where I am the Executive Vice President of one of his companies, right?”\n “Of a company with ten people in it,” was his tart little answer.\n “Oh, bosh. Semantics.” She exhaled dramatically, then continued in her Texas twang, “Well, at least the title makes my parents happy.” She leaned toward him, her cute little face looking so innocent and fresh. “Watcha doing?” she asked again.\n “I am certainly not telling you,” Roberto said firmly. He was used to this game and growing more immune to her charms. Or lack thereof. He wasn\u0027t truly sure which.\n “I\u0027m marrying him,” she reminded Roberto, wrinkling her nose.\n “I know.”\n “And you\u0027re his best man friend servant thing. We shouldn\u0027t keep secrets from each other,” she declared with a bright smile. Slowly, she reached out for the mouse. As expected, Roberto took hold of her wrist and smiled at her charmingly.\n “No?”\n “No,” he answered. “Secrets are sometimes necessary.”\n “You are so not fun when you keep secrets.”\n “I do keep secrets, which is why I have been with him for nearly a hundred years,” Roberto said firmly, and turned off the monitor for good measure. He crossed his arms firmly across his chest and gave her a terse smile.\n Looking toward the enclosed sleeping space Cian spent his days in, Samantha sighed. “A hundred years. Do you ever wish he could be out during the day?”\n “Yes,” Roberto answered simply.\n “So you wouldn\u0027t have to deal with me?”\n “Yes.”\n “I\u0027m not that bad!” She waved a hand at him and kicked off her shoes.\n Roberto tried not to think about the probability that her shoes were from a discount store. Disgusting imitation leather. But Samantha tended to be cheap. She considered Dillards terribly expensive and he suspected most of her work clothes were from Target. He plucked at his Armani trousers, and then settled back in the chair waiting for her to retire to the kitchen.\n “You\u0027re very much you and that is sufficient,” he finally answered.\n With a snort, she grabbed up the bags, and padded barefoot to the state of the art kitchen. “I\u0027m making you some enchiladas with verde sauce.”\n “Sounds amazing,” he answered.\n “Are you being sarcastic?”\n “Me? Sarcastic?” Arching an eyebrow at her, he turned back to the screen.\n She was now safely away from him among the teak wood cabinets and stainless steel of the kitchen, so it was time to get back to work. Maximizing the screen, he returned to his conversation with a bounty hunter that specialized in the supernatural. Ignoring Samantha\u0027s muttering, he typed in a few short sentences, then watched the scroll.\n “You know, we\u0027re going to be in each other\u0027s lives for a long time. You\u0027re going to have to give in to my Texan charm eventually.” She stomped across the loft and into the bathroom on the far side. It was the same old routine. He ignored her, she sulked. They were both devoted to Cian and both were sure they knew what was good for him. Of course, they did not necessarily think that the other one was good for him.\n sleazydino: THERE WAS A MURDER IN DALLAS AT A MOTEL. I\u0027M ALREADY SUSPECTING A FLEDGLING.\n The bounty hunter always wrote in caps and Roberto wondered if he understood, that in Internet etiquette, it meant he was shouting. Probably not. Bounty hunters of supernatural creatures were odd humans. They were separated from their own kind and obeyed their own rules.\n Roberto rubbed his chin before typing back and waited for an answer.\n Sleazydino: THE MASTER OF DALLAS IS WAITING TO HEAR FROM HIS SPIES AT THE CORONER\u0027S OFFICE BEFORE ISSUING A BLOODHUNT. BUT THE SECOND HE DOES, I\u0027M ON IT.\n “And it\u0027s not like I\u0027m not nice to you,”\n Samantha barged back into the room wearing what Roberto regarded as Austin hippy wear. A green, multi-layered skirt hung low on her hips and swung down around her knees. A tank top, adorned with Bob Marley\u0027s face, hugged her small breasts, and fell to just above her navel. Her blond hair was twisted up into two little ponytails on either side of her head. He was certain that it was very hard for the little blond firecracker to put on her corporate attire. She could never wait to get it off.\n “You\u0027re very nice,” he admitted and typed in a few more sentences, then waited.\n Sleazydino: I\u0027LL CONTACT CIAN IF I HAVE TO PASS INTO HIS TERRITORY. AS FOR THE OTHER ONE, NO ONE WILL GO NEAR HIM. THERE IS NO WAY ANYONE WOULD RISK THAT HIT.\n Frowning slightly, Roberto began to type, then saw Samantha on her tip toes peering down over the screen. He minimized the window and looked up at her. “Yes?”\n “Do you have an online girlfriend?” She raised her eyebrows.\n “No.”\n “Boyfriend?”\n “Would that make you happy?”\n She rolled her eyes and stomped off again.\n Roberto opened the window and finished typing.\n Sleazydino: I LOVE THE CHALLENGE BUT NO ONE EVER COMES BACK FROM HUNTING HIM. I HAVE A WIFE AND KID NOW. IF YOU NEED THAT TAKEN CARE OF, YOU\u0027LL NEED TO GO TO SOMEONE ELSE.\n With a sigh, Roberto typed in a few terse comments, then logged off. The Summoner\u0027s power was well known in the underworld. The damn creature walked through other\u0027s territories with ease and without fear of reprisals. And if he was once more in the States and in Texas, that mean Cian could possibly be in danger.\n Samantha banged around in the kitchen, mumbling to herself as she waited for the slowly sinking sun to make its final exist for the evening. Outside the massive windows of the loft, the sky was a glorious mix of gold, purple and pink.\n “Do you think you\u0027ll ever like me?” Samantha asked loudly.\n “No,” Roberto answered truthfully. “But Cian loves you so that is enough for me.” That was a lie.\n Frowning, she waved a knife covered in bits of onion at him. “I\u0027m good for him. I make him feel human.”\n “But he\u0027s not human,” Roberto answered, and fixed his cuffs. It was an old argument.\n “But he was human. It\u0027s at his core.” She gave him a fierce look and turned on the radio.\n With a weary sigh, Roberto stood and moved to the far end of the apartment. Cian kept an extensive library of books and Roberto looked over them thoughtfully. How could Cian, a man of such great wealth and intelligence, love such a simple, country bumpkin? She was hopelessly lower middle class and annoying.\n He caught sight of what he was looking for and pulled an old journal from the top shelf. It was Cian\u0027s own recollection of The Summoner. It was time to reacquaint himself with the creature they had not encountered in nearly forty years.\n Outside the tall windows, the sun slipped behind the wooded hills and the last vestiges of the purple and pink sunset lingered on the horizon.\n There was a loud metallic sound, then the steady hum of a motor as the thick walls around Cian\u0027s sleeping chamber rose into the ceiling above. Roberto didn\u0027t even look up as he heard the quick, steady footfalls of Samantha running across the long loft to throw herself into Cian\u0027s arms. Her laughter and their soft voices made him scowl even more. Snapping the book shut, he calmly ascended the spiral staircase to the floor above, grateful that Cian had two of the lofts remodeled as one.\n It gave him a safe place away from the annoying lovers.\n Reaching Austin had been a huge relief. Amaliya had made it just an hour before sunrise. Seeing the familiar landmarks of the city had made her feel more hopeful than she had in a long while.\n Austin was still suffering growing pains as it evolved from a college town to a full blown city. The capital city of Texas was finally stepping fully into its role. The downtown was growing rapidly with new high rises being built and the suburbs and surrounding towns were expanding rapidly. Its high tech industries were still a huge draw to countless people looking not only for a good place to live, but a high paying job. And yet, it was still a music capital, college town, and magnet for the artistic and wild at heart.\n As she had driven past the University of Texas, she had felt a pang of remorse as she remembered her short time there as a student. If any time in her life had actually seemed good, it was the year she had spent in Austin attending the university. \n","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-21.html","bookId":2616,"book":{"id":2616,"title":"Pretty When She Dies (Pretty When She Dies #1)","description":"Storyline: \n Pretty When She Dies (Pretty When She Dies #1) \n Amaliya wakes under the forest floor, disoriented, famished and confused. She digs out of the shallow grave and realizes she is hungry... \n ... in a new, horrific, unimaginable way... \n Sating her great hunger, she discovers that she is now a vampire, the bloodthirsty creature of legend. She has no choice but to flee from her old life and travels across Texas. Her new hunger spurs her to leave a wake of death and blood behind her as she struggles with her new nature. \n All the while, her creator is watching. He is ancient, he is powerful, and what\u0027s worse is that he\u0027s a necromancer. He has the power to force the dead to do his bidding. Amaliya realizes she is but a pawn in a twisted game, and her only hope for survival is to seek out one of her own kind. \n But if Amaliya finds another vampire, will it mean her salvation... or her death?\n \n","cover":"https://allnovel.net/images/pretty-when-she-dies-pretty-when-she-dies-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:48:39 PM"}}
