{"id":100081,"no":8,"title":"Page 8","content":"\n The sight of blood made her body tremble. She felt an ache in her teeth and a deep need unfurl inside of her. She took a step toward her brother, as her gaze grew deadly. All she wanted to do was run her tongue over his wound and taste the exquisite elixir seeping from it.\n “Oh, sweet Jesus,” Mae whispered in horror.\n What Amaliya did not know was that her eyes had turned completely red as she drew near her huddled kinfolk.\n “Amaliya!” her father shouted.\n She whirled toward him and hissed.\n “What the hell happened to you?” her father exclaimed, his expression of horror widening his eyes.\n Overwhelmed, she grabbed her bag up in her arms and stood trembling before them.\n “What the hell are you? Possessed by the devil?” Kelly Ann gasped.\n With a soft sob, Amaliya shook her head. “I don\u0027t know.”\n “Get out.” Samuel\u0027s voice was low and hard. “Get out of my house!”\n Bloody tears running down her face, Amaliya slowly backed toward the door.\n “You\u0027re not wanted here anymore! Get out!”\n As though shoved by an invisible hand, Amaliya suddenly lost her footing and slid right out of the door with a terrified shout. Thrown onto the porch, she lay there gasping.\n “Get the shotgun!” Mae screamed.\n Scrambling to her feet, Amaliya grabbed her bag and leaped off the porch. She landed a good fifteen feet from the house. She whirled around to see her Dad rushing out the door. In his hand was a rifle.\n “Daddy, please,” she cried.\n “Get out of here, you whore of the devil!”\n “He raped me and killed me! He did this to me!” Her voice was a shriek of anger and fear that tore through the night.\n “Get out!”\n He fired once over her head and that was enough.\n She fled.\n Chapter Four\n Her bag weighed heavily on her shoulder as she walked down the long country road. The night air was cool and fresh, though the heat coming off the asphalt spoke of a hot day. Sighing, Amaliya tilted her hat back on her head. She felt like she needed a checklist of cheesy vampire clichés to start checking off. So far she had fangs, superhuman strength and agility, and blood lust to put a nice big red checkmark next to. Standing still, the lights of her old home twinkled behind her. She wondered if she could see the sun. The heat from its unyielding glare during the day had made the road very warm beneath her feet. She bent down and laid a hand against the ground. Again, tears sprang up, but she fought them back.\n The sound of a car broke her reverie. She looked up to see headlights approaching. The rumble of the motor spoke of an old sports car. When the ancient Mustang drew up next to her, she let out a sigh of relief. Pete must have been hanging out with Damon and heard the commotion at her Dad\u0027s place. Pete and her had gotten along pretty well all through their lives. He was more Damon\u0027s friend than hers, but he never treated her wrong. They had never dated, but had gone out with friends to shoot pool and drink beers back when Damon had yet to fall under his step-grandmother\u0027s sway. After Damon had decided Amaliya was a whore for sleeping with one of his friend\u0027s when she was seventeen, Pete had remained her friend.\n “I heard it got bad,” Pete\u0027s rich voice said out of the darkness filling the car.\n Leaning down, she saw his pleasant features illuminated by the pale glow of the dashboard. His black hair was a tangled mess of curls on his forehead and his blue eyes were warm and inviting. His goatee was neatly trimmed. He smelled of beer, barbecue and aftershave.\n “Doesn\u0027t it always?”\n “They\u0027re really drunk this time. I heard the shotgun go off and Mae is telling everyone you\u0027re possessed.”\n “Great,” Amaliya sighed, averting her gaze, trying to look harmless.\n “Mae\u0027s a toothless bitch.”\n Amaliya laughed bitterly, then nodded. “Yeah. Without a doubt.”\n Pete looked at her evenly. “You\u0027ve been putting up with that shit a long time. You know, it\u0027s okay to walk away.”\n “I didn\u0027t have a choice but to walk away. I got tossed out. They didn\u0027t want me.”\n “Yeah, but they don\u0027t get you. And never will.”\n “Truer words have never been spoken.” She sighed softly and shrugged. “I\u0027ll be okay. I\u0027ll find a place where I am wanted.” She tried to sound light-hearted, but she knew her voice was thick with emotion.\n “You\u0027re wanted, Amal,” Pete assured her. “People do care about you. I know I do.”\n She tucked her hair behind one ear and smiled at him. “You\u0027re always sweet to me.”\n Pete looked a little embarrassed. He gave her a sheepish smile. “Need a ride somewhere?”\n Amaliya leaned her elbow on the edge of the passenger window and looked at him for a long time. He smelled of good things; it made her feel safe all at once. “Yeah. Yeah,” she decided. “I can\u0027t stay here.”\n “I can take you anywhere you want. I got nothing planned tonight, but going to bed.”\n “That sounds good,” she decided. “Take me to the Dixie Motel.”\n Pete nodded slowly, his lips pressed together, his eyes on her face. “You sure?”\n “Yeah. I am very damn sure.” She was tired of walking. All she wanted to do was rest.\n He looked startled for some reason, and said quickly, “Okay, sounds like a plan.”\n Yanking the door open, Amaliya tossed her bag into the back seat and slid in. “I don\u0027t know why I bothered coming home.”\n “Home is home,” Pete answered. “For better or for worse. It\u0027s where you came from.”\n “And what you\u0027re trying to escape,” Amaliya added.\n “Some of us. I like my home. Did you know I\u0027m building out on the acre my Daddy gave me?”\n “Really?”\n “Yep. Three bedroom house and a big ol\u0027 porch,” Pete grinned. “I remember playing house when we were kids. You always said a three bedroom house was a rich person\u0027s house.”\n “I shared a room with two brothers.” She laughed. “Having a canopy bed and a Barbie were rich folk stuff.”\n Shifting gears, Pete pulled the rumbling Mustang back onto the road. The scene at her Dad\u0027s house faded to the back of her mind. Her family didn\u0027t matter anymore; they didn\u0027t want her and she didn\u0027t want them. She was on her own now and she knew it. It was okay. With the wind in her hair and the roar of the engine filling her ears, she felt safe again.\n “Yeah, well, your Daddy is doing much better now. I\u0027m sorry he doesn\u0027t help you out more. Or your brothers. I told Damon and Ray to give you a break. They don\u0027t know what all is going on with you and they don\u0027t have a right to hold you back from your education. I know it’s always been real important to you. It used to be all you talked about.”\n “Well, it was a way of getting away from them,” she answered. She set her battered cowboy hat on her lap before it could blow away.\n “Yeah, I know,” Pete said.\n And he did know. She had run to him and told him she had caught her cousin and her Dad doing married folk stuff in the barn. It was Pete who told her not to tell anyone least her Momma in the hospital find out. And Amaliya could not hurt her mother with the truth as she lay dying. So she had kept silent.\n “What about you? How are you doing since I left?”\n “Got that job down at the refinery. Manager. My experience and those classes I took down at the community college paid off. That\u0027s why I\u0027m building my house.”\n “That\u0027s good! Real good!” Amaliya grinned at him with a flash of white teeth. To her surprise, he seemed a little dazzled by her and despite the dark, she could see him blush.\n “I like the black hair,” he said after a moment of silence. “It looks good. I remember you had it like that when you got back from Austin.”\n “Yeah, Dad threw a shitfit so I dyed it back to blond. But I figured I\u0027m twenty-four and I can do what I like since I don\u0027t live under his roof.”\n “Liking school?”\n Turning her head away from him, she slightly nodded. “Yeah. I liked school, but it’s been rough lately.”\n “Classes are a bitch. But I was never as smart as you. You were always making B\u0027s and I was barely getting D\u0027s.” He laughed his rich, wonderful laugh. “You always were smart.”\n “Not smart enough at times,” she answered softly.\n The Dixie Motel sign flickered into view up ahead. Its bright pink and blue lights stood out against the black relief of the trees towering over the road. The faux, German-style hotel was lit up with pale blue lights that blinked on and off as bugs buzzed around them. A large sign announced the $39.95 per night rate and Amaliya inwardly grimaced as she thought of her small cache of money.\n “Pete, thanks for doing this,” she said. “For picking me up. You could have stayed back there drinking.”\n “I\u0027d rather stay here with you,” he answered with a shy smile. The car rumbled to a stop. He flipped off the headlights and turned off the car. “I think you\u0027re a good person. And you got a raw deal. Besides, I kinda like your fiery Mexican streak that only comes out when you\u0027re pissed.” \n","sourceLink":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1/page-8.html","bookId":2616,"book":{"id":2616,"title":"Pretty When She Dies (Pretty When She Dies #1)","description":"Storyline: \n Pretty When She Dies (Pretty When She Dies #1) \n Amaliya wakes under the forest floor, disoriented, famished and confused. She digs out of the shallow grave and realizes she is hungry... \n ... in a new, horrific, unimaginable way... \n Sating her great hunger, she discovers that she is now a vampire, the bloodthirsty creature of legend. She has no choice but to flee from her old life and travels across Texas. Her new hunger spurs her to leave a wake of death and blood behind her as she struggles with her new nature. \n All the while, her creator is watching. He is ancient, he is powerful, and what\u0027s worse is that he\u0027s a necromancer. He has the power to force the dead to do his bidding. Amaliya realizes she is but a pawn in a twisted game, and her only hope for survival is to seek out one of her own kind. \n But if Amaliya finds another vampire, will it mean her salvation... or her death?\n \n","cover":"https://allnovel.net/images/pretty-when-she-dies-pretty-when-she-dies-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/pretty-when-she-dies-pretty-when-she-dies-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:48:39 PM"}}
