{"id":15481,"no":13,"title":"13. A Giggle Box, a Leaky Faucet, and a Foghorn 咯咯机、漏水龙头以及大喇叭","content":"Every day after lunch Mrs. Jewls read a story to the class. \\n\\n \\n\\n Dana hated stories. \\n\\n \\n\\n The last book Mrs. Jewls had read was a story about a pig and spider. The pig was real cute and the spider was very wise. \\n\\n \\n\\n Dana thought it was a horrible book. It made her laugh too much. Everyone else laughed too, but the problem was that Dana always kept laughing long after everyone else in the class had stopped. It was very embarrassing. And sometimes she broke out laughing at a part that wasn\u0027t even funny because she remembered something funny that had happened earlier. \\n\\n \\n\\n John called her a giggle box. \\n\\n \\n\\n That only made her laugh harder. \\n\\n \\n\\n Once she broke up laughing in the middle of an arithmetic test because she remembered something funny the pig had said. \\n\\n \\n\\n \"There goes the giggle box,\" said John. \\n\\n \\n\\n She hated John. \\n\\n \\n\\n But that wasn\u0027t the worst part of the book. In the end, the spider died. \\n\\n \\n\\n Dana couldn\u0027t stop crying. And she thought it was so silly, too, because in real life she didn\u0027t even like spiders! She squashed them all the time. \\n\\n \\n\\n John called her a leaky faucet. \"Somebody better call a plumber to fix the leaky faucet,\" he said. \\n\\n \\n\\n She laughed through her tears. She hated John. \\n\\n \\n\\n Once in music, they had learned a song about a dragon. When the song begins the dragon is very brave, but then he loses his only friend, so he isn\u0027t brave anymore. He just goes back to his cave, where he is sad and lonely for the rest of his life. \\n\\n \\n\\n The song always made Dana cry. Every recess John \\n\\n \\n\\n 73 \\n\\n \\n\\n and Joe would chase after her, singing it. She\u0027d run across the playground with her hands over her ears and tears streaming down her face. \\n\\n \\n\\n The bell rang. Lunch was over. Dana nervously walked up the stairs to Mrs. Jewls\u0027s room. Mrs. Jewls would start a new book today. She hoped it wouldn\u0027t be funny or sad. She hoped Mrs. Jewls would read a boring story with no jokes. \\n\\n \\n\\n When she got to class, John and Joe were standing by her desk waiting for her. \\n\\n \\n\\n \"Happy birthday, Dana,\" said John. He was holding a present. It was wrapped in green paper and had a pink bow. \\n\\n \\n\\n \"But it\u0027s not my birthday,\" said Dana. \\n\\n \\n\\n \"Well, that\u0027s okay,\" said John. \"You can have it anyway. Since I\u0027m always teasing you.\" He and Joe snickered. \\n\\n \\n\\n Dana eagerly tore off the wrapping paper. Maybe John wasn\u0027t so bad after all, she thought. \\n\\n \\n\\n It was a box of tissues. \\n\\n \\n\\n John and Joe laughed hysterically. \\n\\n \\n\\n \"That\u0027s not funny!\" said Dana. She raised her fist and started to chase after them. \\n\\n \\n\\n Mrs. Jewls rang her cowbell, and all the children settled quietly in their seats. \\n\\n \\n\\n \"We are ready to begin a new story,\" said Mrs. Jewls. She held up the book. \"It\u0027s called \u0027Stinky.\u0027 \" \\n\\n \\n\\n 74 \\n\\n \\n\\n Dana laughed at the title, then quickly covered her mouth. \\n\\n \\n\\n \"It\u0027s about a cute and playful skunk,\" said Mrs. Jewls. \\n\\n \\n\\n \"Oh, no!\" gasped Dana. She knew animal stories always made her cry. The animal\u0027s mother would get shot by human hunters. Or else humans would build a shopping center and destroy the animal\u0027s home. \\n\\n \\n\\n She hated humans. But she knew that was silly, because she was a human, and so were all her friends. The only human she really hated was John, and she didn\u0027t think he was even human! \\n\\n \\n\\n Mrs. Jewls read: \\n\\n \\n\\n \"It was such a beautiful day, Stinky and his mother went for a walk across the forest. \u0027Hi, Stinky,\u0027 said Charlie the chipmunk. \u0027Hi, Charlie,\u0027 said Stinky. \u0027Come along, Stinky,\u0027 called his mother. Stinky hurried after her. They came to a road. Suddenly Stinky heard a noise he had never heard before. It was very loud, like thunder. A car, driven by humans, was speeding toward him! \u0027Look out!\u0027 shouted his mother. Stinky stopped in the middle of the road and stared at the onrushing car. He had never seen a car before. His mother pushed him out of the way just in time. He was safe, but unfortunately, the car ran over his mother. \u0027Mama, Mama,\u0027 he sobbed over and \\n\\n \\n\\n 75 \\n\\n \\n\\n over again, but his mother didn\u0027t answer. She was dead.\" \\n\\n \\n\\n Dana cried. \\n\\n \\n\\n \"Uh-oh, there goes the leaky faucet,\" said John. He and Joe laughed. \\n\\n \\n\\n Dana sniffled and wiped her eyes, but the tears wouldn\u0027t stop. She just kept thinking about poor Stinky. What would he do without his mother? she wondered. Maybe he could go live with Charlie the chipmunk, she hoped. \\n\\n \\n\\n She pulled a tissue out of the box John had given her and loudly blew her nose. \\n\\n \\n\\n \"There goes the foghorn,\" said John. \\n\\n \\n\\n Dana laughed into her tissue. She blew her nose again, even louder. \\n\\n \\n\\n \"It must be a very foggy day,\" said John. \\n\\n \\n\\n The next day after lunch Dana hurried up the thirty flights of stairs before the bell rang, so she could talk to Mrs. Jewls before class started. \\n\\n \\n\\n \"Yes, Dana?\" said Mrs. Jewls. \\n\\n \\n\\n \"Can I leave the room when you read today?\" asked Dana. \\n\\n \\n\\n \"Why?\" asked Mrs. Jewls. \\n\\n \\n\\n \"Because I hate stories,\" said Dana. \"They make me laugh and cry too much.\" \\n\\n \\n\\n \"You don\u0027t hate stories, Dana,\" Mrs. Jewls told her. \"You love stories. I wish everybody laughed and cried as much as you.\" \\n\\n \\n\\n \"Really?\" asked Dana. She couldn\u0027t believe it. All \\n\\n \\n\\n 76 \\n\\n \\n\\n this time she thought she hated stories when really she loved them. She was glad she really loved stories. \\n\\n \\n\\n Suddenly she made a face. \"Oh, yuck!\" she said. \\n\\n \\n\\n \"What is it?\" asked Mrs. Jewls. \\n\\n \\n\\n \"What if I really love John, too?\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/1989/56870.html","bookId":626,"book":{"id":626,"title":"歪歪小学：我们的学校要倒了 Wayside School is Falling Down","description":"简介： 你见过用袜子解答数学问题吗？你知道惊喜蘑菇这道菜到底有多惊喜吗？你知道怎么倒着讲故事吗？你知道怎么到不存在的扎芙斯老师班上去吗最神奇的是，在这本书里，歪歪小学竟然在一阵大风里被一群母牛攻占了。这到底是怎么回事呢？歪歪学校里每天都发生着匪夷所思的事，你...","cover":"http://novel.tingroom.com/file/upload/201803/01/09-42-30-53-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1989","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
