{"id":15488,"no":20,"title":"20. A Wonderful Teacher 一位好老师","content":"Allison was still on the nineteenth story. The desks were arranged in clusters of four. Allison sat at a cluster with a girl named Virginia, a boy named Nick, and a boy named Ray. But Virginia looked old enough to be her mother. And Nick looked like he should be in high school. Ray was a couple of years younger than Allison. \"Miss Zarves is a wonderful teacher,\" said Virginia in a singsong voice. \"She\u0027s the nicest teacher I ever had.\" 112 \"She\u0027s the only teacher you ever had,\" said Nick. \"So? She\u0027s still nice,\" said Virginia. \"I\u0027ve always gotten all A\u0027s.\" \"Aren\u0027t you a little old to be going to school?\" Allison asked her. \"You\u0027re never to old to learn,\" said Virginia. \"No one ever leaves Miss Zarves\u0027s class,\" said Nick. \"How long have you been here, Virginia?\" Virginia thought a moment. \"Thirty-two wonderful years.\" \"I\u0027ve been here nine years,\" said Nick. \"But she always gives us good grades,\" said Virginia. \"That\u0027s true,\" Nick agreed. \"I\u0027ve gotten all A\u0027s since I\u0027ve been here too.\" \"Me too,\" said Ray. \"And sometimes I answer all the problems wrong on purpose!\" \"Where were you before you came here?\" Allison asked him. \"I went to, um, I was ...\" Ray shook his head. \"That\u0027s funny-I don\u0027t remember.\" \"I don\u0027t remember where I came from either,\" said Virginia. \"Well, I do!\" said Allison. \"I was in . . .\" But suddenly she couldn\u0027t remember either. Then it came to her. \"Mrs. Jewls\u0027s class! And Rondi was in the class, and Jason, and Dana, and Todd ...\" She named every member of the class, including all three Erics. She didn\u0027t want to forget where she 113 came from. If I forget where I came from, I might never get back, she thought. \"Did you say there was a girl named Bebe Gunn?\" asked Ray. \"Yes,\" said Allison. \"Bebe\u0027s a very good artist.\" \"My last name is Gunn, too,\" said Ray. \"I wonder if we\u0027re related.\" \"Ray, no talking please,\" said Miss Zarves. \"Now, everyone please take out a pencil and some paper. I want you to write all the numbers from zero to a million in alphabetical order.\" \"From zero to a million?\" asked Allison. She couldn\u0027t believe it. \"Don\u0027t worry,\" said Virginia. \"If you run out of paper, Miss Zarves has more in the closet.\" Allison stared at her in horror. \"But it will take over a hundred years,\" she said. \"So?\" asked Virginia. \"What\u0027s your hurry?\" Allison started to work. It was bad enough having to write down all the numbers from zero to a million, but she couldn\u0027t imagine how she\u0027d ever put them in alphabetical order. One came before two. Three came after one, but before two. Four came before one. Five came before four. Six came after one, but before three. \"Don\u0027t worry,\" said Virginia. \"Even if you miss a 114 few, Miss Zarves will give you an A when you finish.\" Seven came after one and before six. Eight came first. Allison couldn\u0027t think of any number that would come before eight, so she wrote it down. She also knew zero would come last, if she ever got that far. By then she\u0027d be older than Virginia. Ill talk to Louis at recess, she thought. He\u0027ll save me. \"When\u0027s recess?\" she asked. \"There is no recess,\" said Ray. \"We\u0027re not allowed out of the classroom.\" \"What about if you have to go to the bathroom?\" \"What\u0027s a bathroom?\" asked Virginia. \"We don\u0027t eat, either,\" said Nick. \"We just work all the time.\" \"But we never have homework,\" Virginia said cheerfully. \"That\u0027s because we never go home,\" said Nick. \"We get a two-minute break every eleven hours.\" \"But don\u0027t worry,\" said Virginia. \"Miss Zarves always gives us good grades.\" Miss Zarves walked around the room checking everybody\u0027s work. \"Excellent, Ray!\" she said. \"Very good, Virginia. You\u0027re doing wonderfully, Allison. You get an A for the day.\" Big deal! thought Allison. She had to figure out some way out of there. It was clear that Virginia, Nick, and Ray were all too far gone to help her. 115 \"Are there any other new kids in the class?\" she asked. \"Ben\u0027s new,\" said Nick. He pointed Ben out to her. Ben appeared to be about Allison\u0027s age. She was glad about that. When the two-minute break came, she went over and talked to him. \"Are you Ben?\" she asked. \"No,\" he said. \"Oh,\" said Allison. \"I was looking for Ben.\" \"That\u0027s me,\" said the boy. \"But you just said-\" \"My name\u0027s Mark Miller,\" said the boy. \"But for some reason everybody calls me Benjamin Nushmutt.\" \"There\u0027s a Mark Miller in my class!\" exclaimed Allison. \"I know, that\u0027s me,\" said Mark. \"I\u0027m Mark Miller.\" \"No, I mean my other class,\" said Allison. \"What other class?\" Allison thought a moment. \"I don\u0027t remember. ...\" she said. After putting numbers in alphabetical order for eleven hours, her brain had turned into spaghetti. \"Time\u0027s up,\" said Miss Zarves. \"Everyone back to work.\"","sourceLink":"http://novel.tingroom.com/ertong/1989/56877.html","bookId":626,"book":{"id":626,"title":"歪歪小学：我们的学校要倒了 Wayside School is Falling Down","description":"简介： 你见过用袜子解答数学问题吗？你知道惊喜蘑菇这道菜到底有多惊喜吗？你知道怎么倒着讲故事吗？你知道怎么到不存在的扎芙斯老师班上去吗最神奇的是，在这本书里，歪歪小学竟然在一阵大风里被一群母牛攻占了。这到底是怎么回事呢？歪歪学校里每天都发生着匪夷所思的事，你...","cover":"http://novel.tingroom.com/file/upload/201803/01/09-42-30-53-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1989","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
