{"id":75271,"no":21,"title":"Page 21","content":"Screaming kids and the lightning-flash mood swings of little girls didn\u0027t appear to ruffle Duncan\u0027s feathers. In fact, his easy slide through kid world had Phoebe wondering if the man had any feathers to ruffle.\\n\\n What he did, she noted, was play like a maniac. Whatever it wasvideo arcade, miniature golf, whack-a-mole, he was into it. She liked games as much as the next person, and God knew she\u0027d done her stints at fun centers. But she\u0027d never come out of one, in her memory, without a vague headache, a stomach uneasy from strange combinations of food, and feet that ached like a tooth headed for a root canal.\\n\\n She had a touch of all three results, and sat herself down on a bench while Duncan took on all challengers in what he called the Champion Round of mini-golf.\\n\\n Carly was having the time of her life, and the other kids who\u0027d packed along were flocked around him like he was the Pied Piper. And how, Phoebe wondered, did spending hours racing virtual cars or hit ting a red ball through the rotating fans of a plastic windmill equal researching an investment possibility?\\n\\n Loo dropped down beside her. \"I should\u0027ve gotten a manicure. These places wear me out and I knew that man would talk me into coming.\"\\n\\n \"Phin\u0027s looking a little worn himself.\"\\n\\n \"Not Phin.\" Loo sucked diet soda through a straw. \"I know all his tricks by now. Duncan. I know all his, too, but damn that man always gets around me.\"\\n\\n From her vantage point, Phoebe studied him. He\u0027d sat through an elementary school production of Cinderella with every appearance of being thoroughly entertained. And had capped that off by insisting on buying the redheaded stepsister an ice cream cone. Naturally, Carly was crazy about him.\\n\\n And now he was giving every appearance of being thoroughly entertained by playing mini-golf with a platoon of overexcited children.\\n\\n \"Duncan doesn\u0027t look worn at all,\" Phoebe observed.\\n\\n \"Probably live here if he could.\" Loo slipped her own aching feet out of her sandals. \"Look at him, crouched down on that old green carpet eyeballing the hole like he\u0027s Tiger Woods in the Playland Open. Kids eating it right up like ice cream sundaes, which I warn you, he\u0027ll insist on after this is over.\"\\n\\n Phoebe pressed a hand to her stomach. \"Oh God.\"\\n\\n \"Won\u0027t play real golf. Phin\u0027s dragged him out several times, and tells me Duncan says stuff like: \u0027Where\u0027s the windmill?\u0027 or \u0027When do we get to the troll bridge?\u0027\" She let out her big laugh. \"Bruises our Phin\u0027s dignity, which is exactly Dune\u0027s purpose.\"\\n\\n Because she could hear Duncan say it, Phoebe smiled. \"So he just wanted to come out and play. This investment business is a ruse.\"\\n\\n \"Oh no, he\u0027s given it serious thought. He\u0027ll be working out the pros and cons now.\"\\n\\n Lips pursed, Phoebe studied Duncan as he argued the count of strokes on a hole with Phin. \"Yes, I can see that.\"\\n\\n \"I mean it.\" Loo gave Phoebe a poke. \"He\u0027s going to have a good ballpark idea how many kids and adults came through the turnstiles today, which areas got the most play, which didn\u0027t. You can bet he\u0027s asked the kids we brought, and those of complete strangers, what they like. He\u0027ll have himself a baseline before we\u0027re sick off ice cream sundaes, then he\u0027ll go-or won\u0027t go-from there.\"\\n\\n \"I can\u0027t quite fit him into the businessman mold.\"\\n\\n Loo\u0027s smile was lit with affection. \"He\u0027s his own mold.\"\\n\\n \"Apparently.\"\\n\\n \"Got a nice ass on him, too.\"\\n\\n \"Unquestionably.\"\\n\\n \"He\u0027s got what my mother calls the calfs eyes for you.\"\\n\\n \"Does he? It\u0027s hard for me to see clearly with all these hearts circling in front of mine. I just wanted a hot affair.\" She shifted toward Loo, kept her voice low. \"I figured, hell, I deserve one.\"\\n\\n \"Who doesn\u0027t?\" Loo shifted in turn. \"How about some salient details?\"\\n\\n \"Maybe some other time. The thing is, I don\u0027t know if I can manage what\u0027s going on in here.\" She pressed a hand to her heart. \"I don\u0027t know if I have the tools or the room or-\"\\n\\n \"Why? You\u0027re-\"\\n\\n \"Wait.\" Phoebe turned her hand palm out now. \"You\u0027re married, and happily by every sign. You have a pretty little girl and an ugly dog.\\n\\n You have a big family, dual careers that complement each other and exceptional taste in shoes.\"\\n\\n \"I do.\" Loo pursed her lips at the stacked-heel, copper-toned sandals. \"The shoes are the kicker.\"\\n\\n \"I\u0027m divorced with a career that pulls me in conflicting directions constantly, and a family I love, but that does the same. My foundation is shaky at best, and what I\u0027ve built on it takes a lot of time and effort to tend. It\u0027s never been just me for a lot of reasons. It can never be just me.\"\\n\\n \"You\u0027re thinking Duncan can\u0027t handle the complications of your life?\"\\n\\n \"I\u0027m not sure he\u0027d want to, or why he would. Right now, he\u0027s infatuated and intrigued. And the sex, like the shoes, is quite the kicker. But\\n\\n I\u0027m a lot to deal with on a daily basis. And there are things I can\u0027t change or adjust. I\u0027m just not in a position to.\"\\n\\n Loo sucked through her straw, considered. \"Do you always analyze everything into tiny pieces, and pick out the harder points?\"\\n\\n \"Yes. Occupational hazard, I guess. Tough fit, I\u0027d think, for a man who appears to take in the big picture quickly and find the shiny nuggets. I keep trying to... I\u0027d say talk myself down from all this. Step back from the ledge, Phoebe. Your life\u0027s good enough, full enough as it is, so accept that. Take that last step, there\u0027s no coming back from it, not without a world of hurt.\"\\n\\n \"Love as suicide?\"\\n\\n \"Maybe it is. Or it\u0027s walking out with your hands up in surrender, to take the consequences.\"\\n\\n \"Or it\u0027s coming out free, instead of staying a hostage.\"\\n\\n \"That\u0027s a point. I know what I\u0027m doing, have to know what I\u0027m doing just about all the time. It\u0027s annoying, and damn disconcerting, not to know what I\u0027m doing with him.\"\\n\\n \"Can\u0027t tell you. But I think it\u0027d be fun finding out.\"\\n\\n Fun was exhausting. Carly gave in to it and sprawled sleeping in the back of Duncan\u0027s car on the way home.\\n\\n \"In case she\u0027s too zonked to thank you, I can tell you she had a big, bright, red-letter day.\"\\n\\n \"Me, too.\"\\n\\n \"I noticed. Boys and toys. She\u0027s got a whopping crush on you.\"\\n\\n \"It\u0027s mutual.\"\\n\\n \"I noticed that, too. Duncan, I have one favor to ask, and I hope you\u0027ll understand why I need to.\"\\n\\n \"Sure. You had too many hot dogs and want me to stop for Pepto.\"\\n\\n \"I had one hot dog, and I have Turns at home. Duncan, seriously. I\u0027m saying-asking, really-that if things between us take a slide, or we get pissed off and each decide the other is the spawn of Satan, if you\u0027ll ease away from Carly. Give her time to adjust. This is a crappy thing to bring up after you\u0027ve given us such a good day, but-\"\\n\\n \"You\u0027ve got-what\u0027s his name?-Ralph stuck in your head.\"\\n\\n \"Roy,\" she corrected. \"And, yes, that\u0027s part of it. I can\u0027t think of anyone less like him than you are.\"\\n\\n I m\\n\\n \"If that\u0027s true, you should already know it\u0027s a favor you don\u0027t have to ask. I know what it\u0027s like to be shut out and shut down.\"\\n\\n \"You do.\" She touched a hand to his arm. \"I\u0027m a worrying, overprotective mother.\"\\n\\n \"She\u0027s lucky to have one.\" He aimed a look at her. \"Even if you turn out to be the spawn of Satan.\"\\n\\n She wiggled her tired toes as he turned toward the house. \"How about coming in, having a cool glass of wine in the courtyard?\"\\n\\n \"Exactly what I had in mind.\"\\n\\n A week later, Phoebe sat in Duncan\u0027s garden. Carly was having a sleepover at her new second best friend Livvy\u0027s house, which meant her mama could have the adult version of a sleepover.\\n\\n They\u0027d had a swim, and made love. They\u0027d had dinner, and made love. Now it was nearly midnight-and it didn\u0027t matter!-with her sitting out in a lush garden smelling night-blooming jasmine, a glass of wine in her hand. She wore a flimsy excuse for a robe she\u0027d paid entirely too much money for.\\n\\n But if a woman couldn\u0027t splurge for such an occasion, when could she?\\n\\n The night hummed, the breeze just balmy enough to cut back the heat while a fat old moon sailed over a sky dashed with stars and smeared with filmy clouds. He\u0027d turned music on so that Bonnie Raitt\u0027s Deltarich voice oozed out of the garden speakers.\\n\\n Phoebe sipped wine and gave some lazy thought to making love again.\\n\\n \"I feel like I\u0027m on vacation,\" she told Duncan.\\n\\n \"I should\u0027ve put little umbrellas in the drinks.\" His voice was as lazy as she felt. \"Something with steel drums on the stereo. Except I don\u0027t have little umbrellas or any steel-drum CD. No, Jimmy Buffett. It should\u0027ve been Jimmy Buffett and margaritas.\"\\n\\n \"This is fine. This is perfect. I may never move from this exact spot.\" She turned her head to smile at him. \"You\u0027ll have to start charging me rent.\"\\n\\n \"I\u0027ll take it out in trade.\"\\n\\n \"I\u0027m so glad you didn\u0027t want to go anywhere tonight. Clubs, bars, movies. It\u0027s so nice to just be.\"\\n\\n \"Clubs, bars, movies, they\u0027re not going anywhere. It\u0027s nice to just kick back.\"\\n\\n \"You had a busy week.\"\\n\\n \"Ava\u0027s a slave driver. Beneath that pretty face is the heart of Simon Legree. I think I looked at every tree and shrub for sale in greater Savannah yesterday. And all those drawings and layouts. Sod. Fountains. Statuary. Birdbaths, feeders, houses. What-all. She doesn\u0027t care for the concept of \u0027do whatever you like.\u0027\"\\n\\n \"She mentioned you took her by an old warehouse the other day. That you\u0027re converting it into apartments and shops.\"\\n\\n \"Yeah. Thought she\u0027d get some ideas going on that and be too busy to drag me to another nursery. How about we take a sail in the morning? In fact, we can sail over to Savannah.\"\\n\\n \"That sounds perfect. Everything\u0027s just about perfect.\"\\n\\n \"Give me a couple minutes.\" He shifted toward her on the wide chaise, then slid a finger down to open the thin robe. \"And I\u0027ll make it absolutely perfect.\"\\n\\n She didn\u0027t have a doubt in the world, not when his mouth found hers, when his hands began to cruise. She reached out blindly until her glass clinked against the table. With her hands free, she tangled her fingers in his hair.\\n\\n The breeze played along her skin; the music thrummed just under it. When her head fell back so he could run his lips down her throat, there was the white ball of moon overhead.\\n\\n She moved under him, opened for him so when their mouths met again he slipped inside her. Slow and easy now, loose and lazy. Her eyes stayed open so that she could see herself in his. She felt herself rising and falling, rising and falling, in long, liquid waves of arousal and pleasure. When she spilled over the crest, she was still there, trapped in the blue of his eyes.\\n\\n Why, she wondered, would she want to be anywhere else? \"One more.\" He murmured it, then captured her mouth again, sumptuously. Her heartbeat thickened, her bones softened.\\n\\n I love you. The words rose in her throat, ached to be said.\\n\\n They were good words, Phoebe told herself. Good, strong words that deserved to be said. But perhaps saying them for the first time when still coupled with the man on his garden chaise wasn\u0027t the best choice of time and place.\\n\\n Instead, she framed his face with her hands. \"You were right. You made it perfect.\"\\n\\n \"Being with you...\" He turned his head so his mouth pressed to her palm.\\n\\n The gesture had her heart taking another stumble. Something fluttered inside her belly. \"Being with me?\"\\n\\n His gaze leveled on hers. \"Phoebe-\" Her cell phone rang.\\n\\n \"I jinxed it!\" She struggled up. \"I should never have said perfect.\" She thought of Carly, her mother, her brother. Snatched up the phone. \"Phoebe MacNamara.\" The sound of Dave\u0027s voice didn\u0027t loosen the knots in her gut until she was certain it wasn\u0027t her family.\\n\\n \"Bonaventure? Where?\" Without pen, paper or much of anything else, Phoebe took mental notes. \"Yes. For me, specifically? I\u0027m on Whitfield Island, at a friend\u0027s. I\u0027ll be there as soon as I can. All right. Yes, all right. I\u0027ll be headed out in five minutes.\"\\n\\n In fact she was already up and hurrying toward the house as she spoke. \"Tell him I\u0027m en route. No, no, don\u0027t.\" She glanced at Duncan as he pushed the door open for her. \"I have access to a very fast car, but I\u0027ll need a kit. I\u0027ll call you back when I\u0027m on the road.\"\\n\\n She clicked off.\\n\\n \"I need to borrow your Porsche.\"\\n\\n \"No problem, but it comes with me at the wheel.\"\\n\\n \"I can\u0027t take you where I\u0027m going.\"\\n\\n \"Yes, you can,\" he corrected as they ran up the stairs.\\n\\n \"Duncan.\" She tossed off her robe as she rushed into his bedroom. \"There\u0027s a man chained to a grave at Bonaventure Cemetery.\" She grabbed clothes. \"All he\u0027s wearing, apparently, is a vest of explosives.\"\\n\\n \"If he\u0027s going to blow himself up, I hope he\u0027s already got a reservation. Bonaventure\u0027s pretty full up.\"\\n\\n \"He\u0027s the hostage,\" she snapped back as she pulled on clothes. \"He\u0027s claiming to be, and he claims whoever strapped the bomb on him ordered him to call nine-one-one at a specific time, and ask for me by name. If I\u0027m not there by one, whoever\u0027s holding the trigger pushes it, and he goes up.\"\\n\\n \"Only another reason I\u0027ll be driving. You don\u0027t know the car, I doand I know the roads better. I\u0027ll get you where you need to be. When\u0027s the last time you drove a six-speed?\" he demanded when he saw the argument in her eyes.\\n\\n Phoebe dragged on her shoes, nodded. \"You\u0027re right. Let\u0027s go.\"\\n\\n It made more sense to have him driving the Porsche like a hellhound over the island roads toward the bridge. She had her hands and mind free to contact Dave, to take notes.\\n\\n \"He claims he can\u0027t give his name, not until you get here,\" Dave told her. \"He\u0027s saying he\u0027s wired for sound as well as the bomb, and the person behind it can hear everything. He\u0027s wearing an ear bud and a mike.\"\\n\\n \"Is he lying?\"\\n\\n \"I don\u0027t think so. I\u0027ll be there inside five minutes myself, but from the sound of it, my professional assessment would be he\u0027s scared shitless. On-scene reports there are a lot of fresh bruises on his face, his torso, arms and legs. So far, he hasn\u0027t told us who did it, how, when, why. He can\u0027t, he says. He can only tell you.\"\\n\\n \"The way we\u0027re moving, I\u0027ll be there inside fifteen. What grave is he chained to?\"\\n\\n \"Jocelyn Ambuceau, 1898 to 1916.\"\\n\\n \"Unlikely that\u0027s random. It or she means something.\"\\n\\n \"Having it run.\"\\n\\n \"Tell me more about the unidentified man.\"\\n\\n \"White, mid-thirties, brown and brown. Solid build. Accent sounds local. No jewelry, no tats. Arms and legs in shackles, shackles hammered into the ground with posts. He\u0027s in his boxers, barefoot. He\u0027s broken down twice since officers arrived. Just cried like a baby. He\u0027s begging us not to let him die. Begging us to get you here. Get Phoebe.\"\\n\\n \"My first name? He calls me by my first name, like he knows me?\"\\n\\n \"That\u0027s my take, yeah.\"\\n\\n \"Tell him I\u0027m nearly there.\" As they roared around a turn, she I braced a hand against the dash. \"Make sure if anyone is listening, they can hear I\u0027m nearly there.\" She looked at her watch. \"I know it\u0027s nearly deadline, but we\u0027ll make it. Make sure they know I\u0027m coming in. Ten minutes, Captain.\"\\n\\n \"I\u0027m turning in now. I\u0027ll hold things until you get here.\" She clicked off, looked at Duncan.\\n\\n \"You\u0027ll make it.\" His eyes stayed on the road as he took the car down the little two-lane road at a hundred and ten. \"Have you ever dealt with something like this before?\"\\n\\n \"No. Not like this.\" She spotted the lights up ahead, got Dave back on the phone. \"I see the radio cars. Let them know we\u0027re not stopping at the gate. Have one lead us in.\"\\n\\n The Porsche fishtailed on the turn, grabbed road and lunged forward again. It was a blur of moss-draped trees, ornate statuary that gleamed under the moon. Heat put a shimmer on the air, on the thin spit of ground fog. Then there were lights up ahead, through dripping arches of trees. The Porsche slammed to a halt behind the radio car, and Phoebe jumped out.\\n\\n \"You have to stay back,\" she shouted at Duncan as she dashed through gravestones and winged angels.\\n\\n Dave moved toward her quickly, gripped her arm. \"The bomb squad\u0027s marked off the minimum safe distance. Nobody goes beyond it. Not negotiable.\"\\n\\n \"All right, okay. Situation changes?\"\\n\\n \"I just got here two minutes ago.\"\\n\\n \"Let me get started.\"\\n\\n She went forward slowly now. Even with the lights there were pockets of dark. Someone handed her a vest, and she shrugged it on as she studied the weeping man sitting on the grave.\\n\\n An angel looked out over him, her face serene, her wings spread wide. There was a lute clutched against her breasts.\\n\\n Below, the man hunched with his face pressed to his updrawn knees, the sound of his weeping raw and harsh against the insect buzz. Pink roses-fresh to her eye-were scattered around him. \"I\u0027m Phoebe MacNamara,\" she began, and his head jerked up.\\n\\n She froze, stopped in her tracks well before reaching the tape strung out by the bomb detail. Everything in her turned to ice, then thawed again in a sudden gush of hot panic.\\n\\n \"Roy.\"\\n\\n \"Jesus.\" Beside her Dave clamped a hand on her wrist. \"I didn\u0027t see his face. I didn\u0027t recognize him.\" Wasn\u0027t entirely sure he would have. \"Phoebe, you can\u0027t approach,\" Dave said over Roy\u0027s wild shouts. \"You cannot approach.\"\\n\\n \"Understood. Understood.\" But panic sweat sprang onto her skin.\\n\\n \"Roy, be quiet now. You have to calm down. Take a breath and calm down. I\u0027m here now.\" While she spoke, she wrote quickly on her pad. Check on myfamily! Cop on the door. Carly here. She dashed down Phin\u0027s address. \"We\u0027re going to be all right.\"\\n\\n \"He\u0027s going to kill me. He\u0027s going to kill me.\"\\n\\n \"Who?\"\\n\\n \"I don\u0027t know. Oh God, I don\u0027t know. Why is this happening?\"\\n\\n \"Can he hear us, Roy?\"\\n\\n \"He says he can hear. Yes, he can hear. You... you fucking bitch. I have to say what he tells me or he\u0027ll blow it up.\"\\n\\n \"It\u0027s all right. If he can hear me, can he tell you what he wants?\"\\n\\n \"I... I want you to shove some of this C-4 up your twat, you useless cunt.\"\\n\\n \"Do we know each other?\"\\n\\n \"You cost me,\" Roy said with tears running down his cheeks. \"Now I cost you.\"\\n\\n \"What did I cost you?\"\\n\\n \"You\u0027re going to remember. Phoebe, help me, for God\u0027s sake, help me.\"\\n\\n \"All right, Roy. All right. Let me keep talking to him. You must be angry with me. Will you tell me why?\"\\n\\n \"Not... not time yet.\"\\n\\n \"You called me out here, and I came. There must be something you want from me, something you want to tell me. If you\u0027ll explain to me why-\"\\n\\n \"Fuck you,\" Roy said on a hitching sob.\\n\\n \"I feel as though you don\u0027t want to talk to me yet. Is it all right if I talk to Roy? Can I ask Roy questions?\"\\n\\n \"He\u0027s laughing. He\u0027s laughing. He... Go ahead, have a nice chat. I need a beer.\"\\n\\n \"Roy, how did you get here?\"\\n\\n \"He... drove.\" Eyes swollen from weeping and blows darted around the graveyard. \"I think. In my car.\"\\n\\n \"What kind of car do you have?\"\\n\\n \"M-Mercedes. E55.1 just got it a few weeks ago. I just...\"\\n\\n \"All right.\" She scribbled down the make of the car. Find, she wrote. \"He drove your car from Hilton Head?\"\\n\\n \"I was in the trunk of my car. I couldn\u0027t see. Blindfold, gag. Coming home, driving into the garage. In the garage. Gun to the back of my head.\" He pressed his battered face to his knees again. \"Came up behind me. Then, I don\u0027t remember. I don\u0027t know until I woke up and I couldn\u0027t see or talk. Hard to breathe. In the trunk, tape over my mouth. Couldn\u0027t find air.\"\\n\\n She took one relieved breath when Dave stepped back and wrote All safe. Cop on doors. \"How long ago?\"\\n\\n \"I don\u0027t know. \"\\n\\n \"Okay, it\u0027s okay. How did you get here, where you are now?\"\\n\\n \"Heard the trunk open.\" He lifted his head again, shivering. Phoebe could see the insects feasting on him. \"Something over my face-got dizzy, tried to fight. Hit me, hit me in the face. I woke up, and I was here, like this. He was talking in my head. In my head. I screamed and I shouted, but nobody came. He talked in my head, told me what to do. My phone, he left me my phone, told me to call nine-one-one, what to say. Only that one call, he said, only say what he told me to say, or he\u0027d push the button.\"\\n\\n \"You never saw him,\" Phoebe said as she scribbled down Roy\u0027s full name, address, telephone number, and wrote How long missing? under it, circled it twice before passing it to Dave.\\n\\n \"Roy...\"\\n\\n But he was sobbing now. \"I didn\u0027t do anything. Why is this happening?\"\\n\\n \"That\u0027s not helping, Roy. Roy!\" She sharpened her voice enough to get through. \"You need to try to stay calm. The important thing is for us to work together so we can resolve this. I\u0027d like to talk to him again, if he\u0027s ready. I wonder if he could give me a name-it doesn\u0027t have to be his name, just any name he\u0027s comfortable with. So I\u0027d have a way to address him.\"\\n\\n \"I feel sick. I feel... No! No! Don\u0027t! Please, don\u0027t!\" Roy\u0027s eyes wheeled as he strained against the shackles. \"Please, God... Okay... Okay. I... I\u0027m-I\u0027m tired of listening to you whine, you worthless piece of shit. Keep it up and-and I\u0027ll blow you to hell and be done with it.\"\\n\\n \"If you do that, I won\u0027t know why you wanted me out here tonight. Why you\u0027re angry. Will you give me a name to call you?\"\\n\\n \"He-\" Roy\u0027s teeth chattered. \"S-sure, Phoebe. You can call me Cooper.\"\\n\\n Though her throat tightened, she wrote the name clearly on the pad, followed it up with. \"All right, Cooper. Since I can\u0027t talk to you directly, I can\u0027t hear how you feel. Can you tell me how you feel?\"\\n\\n \"Powerful. In fucking charge.\"\\n\\n \"Is being in charge important to you?\"\\n\\n \"Damn right.\"\\n\\n \"Wouldn\u0027t it be more direct, more in charge, if you and I talked face-to-face?\"\\n\\n \"Not time.\"\\n\\n She stared into Roy\u0027s flooded eyes, listened to Roy\u0027s tortured voice, and fought to get inside the head of a man she couldn\u0027t see, couldn\u0027t hear.\\n\\n \"Can you tell me how we know each other, Cooper? Where we know each other from?\"\\n\\n \"You tell me something.\"\\n\\n \"All right. What do you want me to tell you?\"\\n\\n \"Do you care about this... worthless son of a bitch?\"\\n\\n Tricky, she thought. Care too much or care too little, either could incite. \"Do you mean Roy?\"\\n\\n \"You know I mean fucking Roy asshole Squire.\"\\n\\n \"He\u0027s my ex-husband. I don\u0027t want to see him or anyone else hurt. You haven\u0027t really hurt anyone yet, Cooper. We can resolve this without-\"\\n\\n \"Tell that to Charles Johnson. You see-you see- God, okay- Did you see how surprised he looked when those bullets hit him?\"\\n\\n \"Are you telling me you\u0027re responsible for the death of Charles Johnson?\"\\n\\n \"Can\u0027t you fucking understand fucking English, bitch? I put him in the ground. Not the first time you helped somebody into the ground, is it? Is it? Won\u0027t be the last, and that\u0027s a promise. Please,\" Roy wheezed. \"Please, please, please.\" And he shuddered under the spreading wings of the angel.\\n\\n \"Did you know Charles Johnson?\"\\n\\n \"Just another worthless gangbanger. But you got him to come out, didn\u0027t you? Got him to come out without doing any hostages. Nobody inside that place worth crap, but you saved them, didn\u0027t you?\"\\n\\n \"Who didn\u0027t I save, Cooper? Are the roses for her? Who is it you cared about I didn\u0027t save?\"\\n\\n \"Figure that out, Phoebe, figure it out and beg for forgiveness. Maybe you\u0027ll save yourself.\"\\n\\n \"I\u0027ll beg for forgiveness now. If I wasn\u0027t good enough or smart enough to save someone, I\u0027ll beg for forgiveness now. Tell me what you want me to say, and I will.\"\\n\\n \"Better get started. Say... what? No, no, no!\" Roy tried to stand, could only kneel. \"Please. Okay, okay. Say time\u0027s up. Goodbye, Phoebe.\"\\n\\n \"Cooper, if you-\"\\n\\n The blast lifted her off her feet, shot her back through a hot burst of air. She landed in a heap, across a stranger\u0027s grave.\\n\\n She knew what was whizzing overhead, thudding into the ground. Pieces of an angel, pieces of dirt. Pieces of Roy.\\n\\n Images flashed through her mind, fast, disjointed. The first time she\u0027d met him, at a party, and the big megawatt smile he dazzled her with. Making love with him on the big bed in the hotel suite where he\u0027d surprised her with a weekend, and roses, and champagne. The instant before their lips met the first time as husband and wife. Dancing.\\n\\n Lights.\\n\\n Then blank dark.\\n\\n Someone was shouting for her.\\n\\n Phoebe pushed up to her elbows. She caught a blur of movement as Duncan dove. And he was over her, holding her down. Through a tunnel she heard more shouts, pounding feet, the crackle of radio static.\\n\\n She didn\u0027t struggle; there was nothing to struggle for.\\n\\n \"What have I done?\" she whispered. \"Oh my God, what have I done?\" \\n\\n","sourceLink":"https://allnovel.net/high-noon/page-21.html","bookId":2412,"book":{"id":2412,"title":"High Noon","description":"Storyline: Police Lieutenant Phoebe MacNamara found her calling at an early age when an unstable man broke into her family\u0027s home, trapping and terrorizing them for hours. Now she\u0027s Savannah\u0027s top hostage negotiator, defusing powderkeg situations with a talent for knowing when to give in-and when to jump in and take action. It\u0027s satisfying work-and sometimes those skills come in handy at home dealing with her agoraphobic mother, still traumatized by the break-in after all these years, and her precocious seven-year-old, Carly. \\n It\u0027s exactly that heady combination of steely courage and sensitivity that first attracts Duncan Swift to Phoebe. After observing her coax one of his employees down from a roof ledge, he is committed to keeping this intriguing, take-charge woman in his life. She\u0027s used to working solo, but Phoebe\u0027s discovering that no amount of negotiation can keep Duncan at arm\u0027s length. \\n And when she\u0027s grabbed by a man who throws a hood over her head and brutally assaults her-in her own precinct house-Phoebe can\u0027t help but be deeply shaken. Then threatening messages show up on her doorstep, and she\u0027s not just alarmed but frustrated. How do you go face-to-face with an opponent who refuses to look you in the eye? \\n Now, with Duncan backing her up every step of the way, she must establish contact with the faceless tormentor who is determined to make her a hostage to fear . . . before she becomes the final showdown.\\n","cover":"https://allnovel.net/images/high-noon.jpg","author":"Nora Roberts","type":"Mystery","source":"allnovel","link":"https://allnovel.net/high-noon.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:34:15 AM"}}
