{"id":75273,"no":23,"title":"Page 23","content":"With Carly curled in her lap, Phoebe rocked and stroked as she used to when Carly was a baby. She knew what it was like to lose a father, to be told he was gone and never coming back. The hitch and jolt of it, the impossibility of the concept of death and forever to a child. But she didn\u0027t know, couldn\u0027t know, what it was to lose a father she\u0027d never really had. Or to lose anyone to such sudden and stunning violence. No matter how she\u0027d softened or edited the details, it was still horrible. And those details would eke through, like fetid water through a crack in a wall-widening little by little from the whispers of neighbors, the blasts on television, the questions from other children at school. There was no shoring it all up, blocking it all out. So it was best, always best, to be as honest as possible. \"Did it hurt?\" Carly asked her. \"I don\u0027t know. I just don\u0027t know. I hope not.\" \"How come he had to die here when he didn\u0027t live here?\" \"I\u0027m not sure. I\u0027m going to try to find out.\" Carly nestled in closer. \"Is it bad I didn\u0027t love him?\" \"No, baby.\" Phoebe could only hold tighter. \"No.\" \"I didn\u0027t love him, but I didn\u0027t wish he would die.\" \"I know. Me, too. I know.\" \"Poppy\u0027s granddad died, and she went to the funeral, where he was dead in a big box. Do I have to go to the funeral?\" \"No. I don\u0027t know if there\u0027s going to be one, or where or when. We weren\u0027t... it\u0027s not up to us. If I find out and you want to go-\" \"I don\u0027t. Is that okay? Please, I don\u0027t want to.\" \"That\u0027s fine.\" The quick fear in Carly\u0027s voice had Phoebe rocking again. \"You\u0027re not to worry about that, sweetie.\" \"What if he hurts you? The man who hurt Roy, what if-\" \"I\u0027m not going to let that happen. Carly-\" \"The other man hurt you. He hurt your face and your arm.\" Tears trembled now as Carly rubbed her hands on Phoebe\u0027s cheeks. \"What if he comes back and hurts you again, or he kills you like Roy got killed? Mama.\" \"He\u0027s not going to come back and hurt me. The police are going to make sure he doesn\u0027t. Isn\u0027t that what I do, Carly? You have to trust me to take care of you and Gran and Ava, and myself. Even Carter and Josie. We\u0027re going to be careful. Don\u0027t cry now, listen to me. Listen, okay? We\u0027re going to be so careful,\" Phoebe said gently. \"We\u0027re going to have police right outside the house for a while, even inside if it makes you feel safer.\" \"If he comes into the house, will they shoot him with their guns? Will you?\" Oh, well, God. \"He won\u0027t get into the house. But if he did, we\u0027d do whatever we had to do to be safe. I promise you. We\u0027re all going to be careful, right? So you\u0027ll remember everything I told you about talking to strangers, and getting into someone\u0027s car-even going near the car. No matter what they say to you, no matter what they tell you. What do you do instead of going near the car?\" \"I yell no as loud as I can and I run away.\" \"That\u0027s exactly right. We\u0027re all going to be fine, baby, because I\u0027m going to find out who did this to Roy. Then he\u0027s going to go to prison. And he\u0027ll never get out again.\" \"Will you find out soon?\" \"I\u0027m going to try. And Uncle Dave\u0027s going to try. All the police I work with? They\u0027re all going to try.\" Satisfied, comforted, Carly laid her head back on Phoebe\u0027s breast. \"Are you sad, Mama?\" \"I am. I am sad.\" \"Are you scared?\" Truth, Phoebe thought-but simple truth. \"I\u0027m scared enough to be careful, and to work really hard to find out why this happened. You know what happens when I work really hard?\" The smallest hint of a smile curved Carly\u0027s lips. \"You get the job done.\" \"That\u0027s exactly right.\" She gathered Carly close, spoke almost to herself. \"That\u0027s exactly right.\" She got the call, and had to go. It was difficult, more difficult than she\u0027d prepared herself for to leave her family. Cops on the door, she reminded herself. But none of those cops was her. She\u0027d consider the control issue some other time, Phoebe told herself. But right at the moment, she wished that she could split herself into two parts, and that one of them could stand watch over the house and everyone in it. She hated, too, that she\u0027d had to ask Carter and Josie to move in temporarily. It was safer, and more efficient to have the people she considered most at risk under one roof. But it was still a hell of a thing to ask a couple who were basically still on their honeymoon. Yet they\u0027d come. There was little, she knew, Carter wouldn\u0027t do for her. And less yet, Phoebe thought, he wouldn\u0027t do to make sure his wife was safe and sound. And still, come morning, they\u0027d all have to go on-to some extent-with their lives. To work, to the market, to the bank. She\u0027d keep Carly home from school-just a day or two of indulgence thereuntil she was confident her daughter could be protected outside the house. For now, she went downstairs to tell her family she had to leave. And was surprised to see Duncan huddled in the parlor with Carter and Josie. She\u0027d assumed he went home after she took Carly upstairs to tell her about her father. They stopped talking when she stepped in, and every eye turned to her. \"Plots, plans?\" she said, in a halfhearted attempt to keep it light. \"Duncan, I didn\u0027t realize you were still here.\" \"Thought I\u0027d hang around awhile. How\u0027s the kid?\" \"She\u0027s a tough little bird. She\u0027ll be okay. She went down the back way to see my mother in the kitchen. Carter, Jo... Lousy situation, that\u0027s about all I can say. I have a number I\u0027d like both of you to log into your cell phones. Direct line to the precinct, and a situation room set up for your protection. Anything, anything at all strikes you as off, you call it. Duncan, I\u0027d appreciate it if you\u0027d log in the number, too.\" \"Do you really think this lunatic would try to hurt one of us?\" Josie asked her. \"I\u0027m not going to take the chance.\" Stress, Phoebe noted, around Josie\u0027s usually cheerful eyes. Death threats weren\u0027t the norm for a hospice nurse who marries a schoolteacher. \"You\u0027re on a case now, right?\" \"Yeah. I\u0027m taking the seven-to-four shift, cancer patient. Private home on Bull Street.\" \"Good, close to my cop shop. If you could write down all the particulars, all the names-the other nurses, the people in the house, your routine, it\u0027ll be helpful. Same for you, Carter-your class schedule, meetings, everything. Duncan-\" \"I\u0027m probably a little less structured, schedule-wise.\" \"Have you considered private security? Just temporarily.\" \"I\u0027m not having some hulk walking two steps behind me. My house is covered; I\u0027ve taken care of it. You\u0027ve got enough to worry about. I\u0027ll worry about me.\" \"I\u0027m not egotistic enough to say this is happening because of me. It\u0027s not. But I\u0027m pissed enough-and I\u0027m good enough-to say I\u0027m going to find out who\u0027s trying to get to me through the people in my life. And doing that is one of the reasons I have to go.\" \"You\u0027re going out?\" Carter moved forward immediately to take her arm. \"Phoebe, the point is he\u0027s trying to get to you. Herding us up elim inates his being able to hurt any of us. And gives him more reason to go straight at you.\" \"If and when, I\u0027ll be ready. Carter, I\u0027ve got a child who needs me. I don\u0027t intend to be careless or stupid. Dave\u0027s coming by to pick me up, and I\u0027m going into the station house, where I\u0027ll be surrounded by other cops.\" \"Being surrounded by cops didn\u0027t stop one of them from sending you to the hospital,\" Josie pointed out. \"No, and I won\u0027t be that easy a mark again. Arnie Meeks is the reason I need to go in. He\u0027s being brought in for questioning. I need to be there. I need you to stay here, to keep everything as calm and normal as possible.\" She touched Carter\u0027s cheek. \"Roy wasn\u0027t prepared. Why should he have been? But we are. And we\u0027re going to get through this. It\u0027s what we do, isn\u0027t it? Get through.\" \"Mama\u0027s scared to death.\" \"I know.\" Nothing could be done about it. \"I\u0027m counting on you. And I\u0027m resting easier on that count having a nurse in residence. You\u0027re taking a lot of weight off me, Josie.\" \"We\u0027ll be fine,\" Josie assured her. \"We were just talking about what we could do to keep things as normal as possible. Food, games, music. Business,\" she added with a quick smile at Duncan. \"I thought Essie and I could come up with a business plan.\" \"Good. That\u0027s good. Keep them busy, will you? And when they ask, tell them I\u0027m with Dave. I\u0027ll be back soon. Duncan, maybe you could walk me out.\" \"Sure.\" She waited until they were on the veranda. \"It has to be said,\" she began. \"You\u0027d be smarter, safer and certainly saner if you went home, kept your distance. Not only from me, but from my family.\" He nodded as he studied the lovely tree-lined street. \"Didn\u0027t help Roy much, did it?\" \"No.\" Blunt help, she discovered. Straight to the point. \"You have the resources to go anywhere, and for any length of time. You could get out of Savannah for a while, and those resources would also ensure no one outside your inner circle had to know where you are.\" \"Cut and run.\" \"It\u0027s not running, and you\u0027ll still have your balls in Tahiti or wherever.\" \"Easy to say when you don\u0027t have any balls-so to speak-in the first place. I\u0027m not going to Tahiti. Savannah\u0027s my home, and I have projects in the works I\u0027m not prepared-okay, not willing-to put on hold. And I\u0027m not ditching the redheads to go drink mai tais. But you knew that.\" \"Deduced that,\" she corrected. \"Still, it had to be said. I also have every confidence you\u0027ll take care of yourself, but that doesn\u0027t mean I won\u0027t worry-and you knew that. So I need to ask you to check in, every two hours. A quick call, a text message, I don\u0027t care how you check in, but I need you to do it.\" \"I can agree to that, if it\u0027s reciprocal.\" She lifted her eyebrows. \"You want me to check in with you?\" Brows still lifted, she flipped back her jacket where her badge was clipped to her waistband. \"Yeah, real pretty. I call you, two hours later you call me, two hours later, back to me. That\u0027s how it works.\" She tapped her fingers on her badge as she studied him. \"You might be good in my line of work. That\u0027s agreed. Here.\" She handed him a piece of paper. \"Emergency number\u0027s on there. If you could make sure everyone inside has it on both cells and the house line, I\u0027d appreciate it.\" She turned, scanned the street, the trees, the cars, over to the park. \"He could be watching the house. He could be anywhere.\" \"Let\u0027s give him something to look at.\" He pulled her close, covered her mouth with his. As he started to ease her back, she wrapped her arms tight for one hard embrace. \"Don\u0027t take any chances. Zero chances. If it even seems like it might somehow be related to taking a chance, don\u0027t.\" \"Yoo-hoo!\" Phoebe\u0027s nerves were stretched tightly enough that even recognizing Lorelei Tiffany\u0027s voice, she laid a hand on the butt of her weapon. But her tone was easy when she turned and waved. \"Hey there, Miz Tiffany.\" \"Don\u0027t you two make a picture! That\u0027s a handsome man you got there, Phoebe. Few years ago, I\u0027d\u0027ve stolen him right out from under you.\" Decked in daffodil yellow, with little Maximillian Dufree coordinating with leash, collar and bow tie, Mrs. Tiffany sent Duncan a flirtatious smile. \"Ma\u0027am. When the woman\u0027s as delicious as you, I\u0027d be the one doing the stealing.\" Mrs. Tiffany let loose a girlish giggle. \"Oh, you! Better keep a hold of that one, Phoebe. Maximillian Dufree and I are about to take a turn in the park, if y\u0027all like to join us.\" \"I wish we could.\" \"Don\u0027t blame you. I\u0027d find something more energetic than dogwalking to do if I had a handsome man like that around. Bye now.\" \"Normal,\" Phoebe murmured when the pair clipped off. \"There\u0027s still a lot of normal in the world.\" \"Savannah\u0027s a world where a dog in a yellow bow tie\u0027s pretty normal. I saw that hairless dog humping a pink toy poodle across the way a while back. I guess that\u0027s normal, too.\" \"For Maximillian Dufree, it is. The pink poodle would be Lady Delovely, who carelessly seduces Maximillian Dufree-despite his lack of essential equipment-and all the other dogs-including several females of her acquaintance-with wanton regularity.\" She watched Mrs. Tiffany, in bright yellow glory, breeze into the park. \"I wish we could do something as nice and normal as walk in the park and watch a couple of silly-looking dogs.\" Duncan ran a hand down Phoebe\u0027s arm when Dave\u0027s car pulled in. \"You take care, Phoebe. We\u0027ll get down to some normal of our own real soon.\" \"Counting on it.\" She took one last look at him, one last look at the house, and walked down to Dave\u0027s car. \"Everybody okay?\" Dave asked her. \"Holding.\" \"Mr. Lucky appears to be sticking.\" She glanced back, saw Duncan still standing on the veranda. \"He does. I think that\u0027s one of the things he\u0027s good at. He\u0027s good at sticking. So are you,\" she added. \"You stuck by my whole family, all these years. Which makes you a target, Dave. You\u0027re as close to me as any of my family, a hell of a lot closer to me than Roy was.\" o \"I\u0027m taking precautions.\" He took one hand off the wheel to pat hers. \"Be sure.\" She shifted toward him. \"You\u0027ve been my father since I was twelve. The one I looked up to, depended on and, in a lot of ways, the one I\u0027ve tried to emulate. If he knows me, and he must, he knows that.\" This time his hand squeezed hers. \"I\u0027ve been proud of you since before I ever met you face-to-face. Fact is, I love you like my own. I\u0027m not going to let him use me to hurt you. All right?\" \"Yes. Yes. All right.\" She took in a breath, let it go. \"Why did they bring Arnie in? I thought they were going to question him informally at home.\" \"They did, or attempted to, then hauled him in when he took a swing at one of the detectives. Little bastard put his own ass in the sling.\" \"Short fuse,\" Phoebe replied. \"The man who killed Roy has a long one. Long and cold. Arnie Meeks doesn\u0027t fit the profile, Dave.\" \"Maybe not. Could be he has a friend or family member who does. Let\u0027s put it through the process, Phoebe. One step, then the next.\" He hadn\u0027t asked for a lawyer. That was to prove he was a hard-ass, Phoebe concluded as she studied Arnie through the one-way glass. It was also monumentally stupid. He\u0027d been a cop long enough to know better, but he wanted to show that he could tough it out, this was no big deal. He wore a gray T-shirt and jeans, scuffed Nike low-tops and a surly expression. He hadn\u0027t shaved, so there was a rough stubble on his face that suited the look in his eye. The screw-you-all look. He\u0027d hurt and humiliated her, laid in wait for her and violated her. She understood the knot squeezed in her sternum was a normal, natural reaction to that, to standing here looking at the man who\u0027d bound and beaten and stripped her. But she couldn\u0027t loosen it. \"You don\u0027t have to do this.\" Dave put a hand on her shoulder, gave it a quick squeeze. \"Yes, I do.\" \"You\u0027ve already faced him down once, Phoebe. There\u0027s nothing to prove.\" \"I have to do this. I have to see him while they question him.\" Look in his eyes, listen to his voice. \"It\u0027s the only way I\u0027ll know, that I can be sure, if he\u0027s the one who killed Roy. Or if he knows who did.\" \"I\u0027m going to say what has to be said. You don\u0027t owe Roy anything.\" \"Maybe not. But I owe it to Carly. I\u0027ll be fine.\" Fine might have been an exaggeration, but she got through and that was good enough. She watched Sykes and Liz double-team him, work him around, and poke and prod at Arnie\u0027s non-answers. All three knew how to play the game, she thought. But Arnie was outnumbered, outmatched. \"Can\u0027t deny you\u0027ve got it in for Lieutenant MacNamara,\" Sykes said casually. \"Old news.\" \"A man pounds on a woman that way, it never gets old. The kind of man who does that?\" Sykes stopped, shook his head. \"On my gauge he\u0027s low enough to do anything.\" \"Oughta have your gauge checked.\" \"Tell you what mine says, Arnie.\" Liz circled around to speak from behind him. \"It says you\u0027re a fucking coward. The kind of sick son-ofabitching coward who\u0027d blow some helpless bastard to pieces. Did it make you feel big? Make you feel important to take him out?\" \"I didn\u0027t even know the asshole. I told you. I never touched the bastard. Why would I? Seems to me he had the good sense to dump that know-it-all bitch. I\u0027da bought him a drink if I\u0027d met him.\" \"He was nothing to you, right?\" Liz leaned in. \"Nothing but a tool you could use to fuck with the lieutenant.\" \"I don\u0027t need to fuck with her. Like I said, old news.\" \"How do you like playing rent-a-cop for a bunch of yuppies in Calvin Klein suits, tourists in flip-flops, Arnie? Bet that never gets old.\" Arnie\u0027s face darkened-anger, Phoebe thought, and more. Embarrassment. \"It\u0027s temporary.\" \"Oh yeah? You think your daddy\u0027s going to get you back on the job?\" Drumming the flats of his hands on his own belly, Sykes let out a hoot. \"Pig\u0027s eye, Arnie, and you know it. You\u0027re done, broke the family chain. Some bitch cost me my badge, I\u0027d sure as hell want payback. Why don\u0027t you tell us where you were last night, Arnie? Where you were from ten to three in the morning?\" \"I toldyou. I was home, with my wife.\" \"Stupid to lie, don\u0027t you think? Doesn\u0027t show a bright light.\" Sykes tapped his temple. \"Especially when the wife\u0027s not too happy with you to begin with.\" Sykes pushed through the file in front of him. \"Her statement says she doesn\u0027t know when you got home, but you weren\u0027t there when she went to bed at eleven.\" \"She\u0027s wrong.\" After a shrug, Arnie tipped his head back to study the ceiling. \"I was down in the den, fell asleep watching TV.\" \"She locked up, Arnie. She did the walk-through before she went up to bed. If you were there, snoozing in front of the tube, where was your car?\" \"She didn\u0027t see it. She\u0027s pissed at me, sure. Just giving me a hard time.\" \"He\u0027s lying,\" Phoebe stated. \"He\u0027s lying about being home. And he\u0027s nervous.\" \"She can\u0027t place you on the day of the Johnson shooting either. Too bad.\" \"It was my day off, goddamn it.\" Anger punched through the shaky nonchalance. \"I was running errands. I had things to do.\" \"Yeah, things to do,\" Liz agreed. \"Like set yourself up in an apartment window and shoot an unarmed man, a surrendering teenager.\" \"Fuck that. Fuck this. Fuck you. I\u0027m not getting screwed on this because that bitch MacNamara wants more blood. She\u0027s got you bowing and scraping and doing whatever she wants. I wanted to kill anybody, you can bet your ass it\u0027d be her.\" \"Killing her ex in front of her, that\u0027s a handy way to shove it in her face. Killing Johnson after she\u0027d spent hours talking him down, that\u0027s rubbing it in.\" Sykes shot out his index finger like the barrel of a gun. \"You\u0027ve got a twenty-two pistol, Arnie. You shouldn\u0027t have left the slug in that dumb rabbit.\" \"What? What rabbit? What the fuck are you talking about?\" \"He\u0027s not lying about that.\" Phoebe shook her head. \"He doesn\u0027t know what they\u0027re talking about.\" \"Once we match the bullet and the gun, we\u0027ll have ourselves stalking and harassment charges. Breaks your probation. You\u0027ll do time. You\u0027ll go inside. No way your daddy\u0027s going to be able to dig you out this time.\" \"Leave my father out of this.\" \"You won\u0027t,\" Liz tossed back. \"You\u0027ll be calling Daddy for help any minute. We\u0027ll match the bullets from the rabbit. Then there\u0027s the dead snake, the dead rat. Upped it from the doll you mutilated and left for her. I\u0027m betting you upped it from wildlife to Roy Squire.\" \"I don\u0027t know anything about any damn dead rabbit.\" \"The doll,\" Phoebe said quietly, even as Sykes narrowed his eyes. \"You know something about the doll, don\u0027t you? You got sweatier over the doll.\" \"I don\u0027t know what you\u0027re talking about.\" \"Messed up the doll like you\u0027d planned to mess up the lieutenant,\" Sykes continued. \"Rang her bell one night and left it outside her door. Then the dead rat, then right up to Roy Squire. Yeah, smells like pattern to me.\" \"That\u0027s bullshit. Maybe I tossed a doll by her house, so what? That was weeks ago, and I haven\u0027t gone near her place since. I haven\u0027t gone near MacNamara since...\" \"Since you beat her in the stairwell?\" Sykes finished. \"Since you put a fucking bag over her head and stripped her down? You don\u0027t have any friends here, Arnie. Nobody wants to help you, so you keep lying. Makes me warm inside. You keep right on lying your way into a cage, and this time there\u0027s going to be a hotshot on the other side. There\u0027s a needle waiting for you, you sack of shit.\" \"You\u0027re out of your goddamn mind.\" Arnie was sheet white now, and running sweat. \"I didn\u0027t kill anybody. I didn\u0027t shoot any damn rabbit either.\" \"We got motive, means, opportunity. Yeah, keep lying, fuckhead. You know how the DA loves it when a coward killer whines and lies. He\u0027ll go for the needle, no question.\" \"I didn\u0027t know the son of a bitch. I haven\u0027t been to Hilton Head where you said he lives. You can\u0027t put me there.\" \"Give us time. I was never happy, were you, Liz, with the way this asshole skated after messing with the lieutenant?\" \"Me, I wanted to see him get some serious tuning on that. This time...\" \"She\u0027s behind it.\" Arnie swiped the back of his hand over his mouth. \"You know damn well. Trying to set me up, that\u0027s what she\u0027s doing. I saw the damn doll at a yard sale, just used it to give her something to think about. I didn\u0027t kill anyone, I haven\u0027t been to goddamn Hilton Head. She\u0027s trying to fuck me over. She can go to hell. I wasn\u0027t anywhere near Bonaventure last night.\" \"Where were you, Arnie? Prove it, and make this go away.\" \"I got me a girlfriend, okay? My wife\u0027s not giving me any support, or any sex, or anything else. So I\u0027ve got someone who will. I was with her last night at her place. And I was banging her until after two in the morning.\" \"Name.\" Liz shoved a notebook across the table. \"Address. We\u0027ll ask her how much she got banged.\" \"She\u0027s got a husband, okay? He was up at Myrtle Beach playing golf for a few days, so we used her place. You\u0027ve got to let me talk to her first, tell her this is serious shit so she won\u0027t blow it off. Her husband finds out, he\u0027ll knock her around. She has to know you\u0027re not going to use her name.\" \"Let you talk to her first, prime her?\" Sykes snorted out derision. \"Not going to happen, Arnie. You\u0027re telling the truth, we\u0027ll keep her out of it. Sounds like you deserve each other.\" \"My wife\u0027s already talking divorce, and all because MacNamara-\" \"Oh yeah, all this is MacNamara\u0027s fault. Sure. She tricked you into busting her up just so you\u0027d get tossed off the job. Write the name down, Arnie.\" \"She\u0027s an exec at Terrance, Inc. You go see her there, not at her place. You go talk to her at her office. You have to give me the courtesy of being discreet.\" Sykes\u0027s eyes were hard as stone. \"You lost the right to courtesy from anyone here when you jumped Lieutenant MacNamara in that stairwell. You remember that, asshole. Ain\u0027t nobody on your side. You want to save yourself, you write down the name. Otherwise, you\u0027re going in on assaulting an officer and you\u0027re staying in until we put all these ducks in a row.\" As he wrote, Phoebe turned to Dave. \"It wasn\u0027t him. He\u0027s a pig, and he\u0027s stupid with it. He didn\u0027t kill Charles Johnson or Roy. He hasn\u0027t got the stones or the smarts.\" She turned back to the glass. \"He\u0027d really like to hurt me. He\u0027d still like to make me pay. But he wouldn\u0027t understand that killing that boy, that killing Roy, hurts me, that it makes me pay. He doesn\u0027t understand me at all. Whoever did those things does.\" \"We\u0027ll check out the woman, see if the alibi holds.\" \"Yeah. I\u0027m going home. I\u0027ll start going through the files. He\u0027ll be in there. He\u0027s in there somewhere.\" As Phoebe stepped out of observation, Liz slipped out of the interview room. \"I was just coming back to talk to you. Got a minute?\" \"Sure.\" \"Let\u0027s, ah...\" Liz glanced over, gestured toward the women\u0027s room. \"Take it in here.\" When they were inside, Liz leaned back on a sink. \"Hard for you, watching that. Watching him. The glass isn\u0027t much of a barrier.\" \"Yeah, it was, and no, it\u0027s not. But it had to be done.\" \"He\u0027s not the guy, Phoebe.\" \"No, he\u0027s not the guy. You and Bull did good in there. His alibi\u0027s going to check out, and we\u0027ll be able to eliminate that avenue.\" \"How are you holding up?\" \"Truth? I have no idea.\" Phoebe ran her hands over her face, back into her hair. \"I\u0027ve got my family holed up inside the house like a group of hostages. No choice. Whoever did this to Roy has made us all hostages, and I don\u0027t know the terms. I don\u0027t know what he wants or why. I can\u0027t negotiate their safety if I don\u0027t know the terms.\" \"You want to go grab some coffee?\" As she asked, Liz tipped back her watch to check the time. \"I can take thirty while Bull wraps up.\" \"I look that bad?\" \"You look like you could use a cup of coffee and a friend.\" \"I could, but I need to get home. Pull out the linchpin, the wheel slips off. Right now, for my family, I\u0027d be the linchpin. Could you let me know if and when his alibi\u0027s confirmed?\" \"No problem.\" Phoebe opened the door, shut it again. \"I wish it was him. Wish it was that son of a bitch. Roy\u0027s dead, can\u0027t change that. Part of me wishes it was Meeks so it would be over and done, and I\u0027d know my family\u0027s safe. But there\u0027s another part, Liz, just as active, just as sharp, that wishes it was him so he\u0027d go down. All the way down. And not for Roy, not in the guts, you know? So he\u0027d go down for every minute inside that stairwell. I thought I\u0027d come to terms with the way all that shook out, with the payment made. But standing in there, looking at him? I haven\u0027t come to terms with it.\" \"Understandable.\" \"Is it?\" \"Scales are only balanced when your gut tells you they are. You may have to accept the payment. You don\u0027t have to like it.\" \"I don\u0027t.\" Something loosened in her chest because she\u0027d been able to say it, to spew it out to someone who understood. \"I don\u0027t like it one damn bit. He should do a little time helpless and terrified, then maybe...\" Phoebe shook her head. \"Problem for another day. I think I have enough others to fill the plate for now.\" \"You should give some thought to talking to the counselor.\" \"I will. Really. I need to get through this first.\" She managed a smile. \"That was better than coffee. Thanks for the ear, Liz.\" \"I got two when you need another.\"","sourceLink":"https://allnovel.net/high-noon/page-23.html","bookId":2412,"book":{"id":2412,"title":"High Noon","description":"Storyline: Police Lieutenant Phoebe MacNamara found her calling at an early age when an unstable man broke into her family\u0027s home, trapping and terrorizing them for hours. Now she\u0027s Savannah\u0027s top hostage negotiator, defusing powderkeg situations with a talent for knowing when to give in-and when to jump in and take action. It\u0027s satisfying work-and sometimes those skills come in handy at home dealing with her agoraphobic mother, still traumatized by the break-in after all these years, and her precocious seven-year-old, Carly. It\u0027s exactly that heady combination of steely courage and sensitivity that first attracts Duncan Swift to Phoebe. After observing her coax one of his employees down from a roof ledge, he is committed to keeping this intriguing, take-charge woman in his life. She\u0027s used to working solo, but Phoebe\u0027s discovering that no amount of negotiation can keep Duncan at arm\u0027s length. And when she\u0027s grabbed by a man who throws a hood over her head and brutally assaults her-in her own precinct house-Phoebe can\u0027t help but be deeply shaken. Then threatening messages show up on her doorstep, and she\u0027s not just alarmed but frustrated. How do you go face-to-face with an opponent who refuses to look you in the eye? Now, with Duncan backing her up every step of the way, she must establish contact with the faceless tormentor who is determined to make her a hostage to fear . . . before she becomes the final showdown.","cover":"https://allnovel.net/images/high-noon.jpg","author":"Nora Roberts","type":"Mystery","source":"allnovel","link":"https://allnovel.net/high-noon.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:34:15 AM"}}
