{"id":97929,"no":10,"title":"Page 10","content":"And that was al the edge that ‘Telcam needed. He was organized. The Arbiter wasn’t, not yet.\\n\\n Phil ips realized that he was hoping for a draw, just like ONI. So he didn’t trust ‘Telcam to keep his side of the deal after al , to leave Earth colonies alone if humans kept out of his way. Wel , if he survived this, he’d have one hel of a lecture tour ahead of him, let alone the chat shows and books.\\n\\n Funnily enough, the last place he wanted to be right now was back in Sydney at the university, safe and planned out to retirement. He started wandering around the chamber, remembering what he’d come here for. He was going to check out ancient Forerunner inscriptions to see if there were clues to the locations of the remaining Halos.\\n\\n “‘Telcam,” he said, “do you mind if I look around the temple?”\\n\\n The Sangheili didn’t look up from his charts. “You won’t find a way out.”\\n\\n “I meant that I’d like to take a look at the carvings and relics. Is that al right? I promise I’l treat it with respect.”\\n\\n “Very wel . You’l know when you’ve reached an unsafe area.”\\n\\n “Oh.” Booby traps? “What’s unsafe?”\\n\\n “Some passages have been wal ed off,” ‘Telcam said. “That was carried out at the time the Forerunners built this temple, and there must have been good reason. The Servants of the Abiding Truth have never breached those wal s, nor shal we.”\\n\\n Phil ips had no taboos in his life and found it bizarre that a commander used to making hard decisions on a battlefield would accept that kind of mystical keep-out sign without question. But then Phil ips didn’t fear the hand of some god reaching out and smacking him around the ear. BB had mentioned the slipspace bubbles in the Onyx Dyson sphere. The Forerunners had contained them in some kind of field and had been able to control the passage of time inside them, so Phil ips wondered if they’d built that into other facilities. He didn’t want to push his luck and end up in one. He’d heard about the Spartan-I I who got lost in one and was lucky there were Huragok around to get her out.\\n\\n I wonder where Adj is now? I hope ONI aren’t vivisecting him or anything. Cute little guy. Amazingly useful.\\n\\n Phil ips could have done with Adj right then, and BB, too. He was real y on his own now. He walked slowly through the maze of passages, writing each turn that he took on his datapad so that he could find his way out again, and was struck by the precision of the stone blocks. The temple was thousands of years old but the stonework was crisp and immaculate, the joints perfectly square and almost invisible. He ran his palm along the right-hand side of the wal as he walked. The stone was peach-smooth and warmer to the touch than he expected. A string of dim lights ran the length of the ceiling, but that looked to be a Sangheili addition, not the work of aliens who could bend time and space to create a bomb shelter.\\n\\n Grimy lightbulbs spattered with dead insects just didn’t seem to be their style.\\n\\n And then he saw the panels on the wal , the shadows cast by inscriptions, and the anthropologist core of his being went into a feeding frenzy. He speeded up to a trot and stood gazing at the first panel in academic ecstasy.\\n\\n He would have described it as a cartouche, but that made it sound quaint and primitive. The symbols engraved on it were what he’d come to recognize as Forerunner glyphs. Suck on this, Howard Carter. I’ve just become the first human to read an actual message from the gods. He decided to risk a thunderbolt and put his hand out to touch the symbols, but his fingertips brushed against something that felt solid, a barrier that he could feel but not see. He flattened his cheek against the wal in case he could see an actual sheet of transparent material, but there was nothing. It was one of their protective fields.\\n\\n Wow. How the hell did they build that into stone and keep it powered all this time? Damn, BB, you’re missing all the good stuff. Come to that … why did they put that barrier there? To keep it clean?\\n\\n The symbols were laid out in rows with lines leading from them to other symbols around the margin of the panel. It reminded him of a touch panel on a kitchen appliance.\\n\\n Maybe those aren’t engravings. Maybe they’re buttons. Switches.\\n\\n Pressing them was a risk, but he couldn’t work out how to get past that protective screen anyway. Human logic told him that it might have been the whole point—to stop people pressing them by accident. He was so pumped up with adrenaline now that the sheer ravenous greed to know about this thing, to understand it, had made the fact he was a hostage of a heavily armed religious lunatic fade into the background.\\n\\n Oh, BB, you should see this.\\n\\n Phil ips took a few images with his datapad, noting the charge was low. He didn’t know when he’d get out of here to top it up again so he’d have to conserve power. Damn, he real y needed BB to see this. Should he risk trying to repair the radio cam? He didn’t know the first thing about how to fix it other than digging out the fragment of shrapnel, and he didn’t know if he’d end up triggering the needle and kil ing himself. He stood there in the dimly lit tunnel for minutes, just daring himself to take out that lump of metal.\\n\\n The needle would eject from the back plate. That was why he had to wear it clipped to his jacket. Shit, lucky? You said it. What if the impact had triggered it? He held the radio against the stone wal so that he couldn’t fumble with it and accidental y stab himself, then began prying the metal out with his stylus. It started to bend the front cover out as wel . The shrapnel suddenly flew out and pinged on the floor.\\n\\n Phil ips kept the radio flat against the wal , just in case, and pressed the switch on and off a few times. The pinpoint of green light came on but died again.\\n\\n Ah well. I tried. No point wasting time. Better start cataloguing all these inscriptions. I’ve got Halos to find.\\n\\n He twisted the clip around on the radio and attached it to his top pocket with surgical care, making sure the back plate was facing out. Then he carried on looking along the wal s for inscriptions, searching for repeating symbols that might give him a way in to the Forerunner language.\\n\\n This one was interesting. It was an oval with what looked like a section through a vertebra in the middle of it, and it appeared in every cartouche several times. He was trying to think like aliens who could bend time when he put his hand on the invisible barrier and a voice suddenly spoke to him out of nowhere.\\n\\n He almost crapped himself, but it wasn’t the voice of God, anybody’s god.\\n\\n “Please activate the video input,” BB said. “Continue when ready.”\\n\\n UNSC PORT STANLEY, EN ROUTE TO SANGHELIOS “Bloody hel , BB,” Mal said, leaning on the chart table. “There’s a lot of gaps in this schematic.”\\n\\n “In case you hadn’t noticed, Malcolm, ” BB said acidly, “I was put out of action while I was doing the survey. And since when did you ever have perfect recon data before insertion?”\\n\\n “Just making an observation, mate.”\\n\\n Everyone was a bit sensitive right now. Mal prided himself on being able to focus on the job at hand no matter what else was going on, but part of him had disconnected from Phil ips’s plight to worry about Naomi’s reaction to the bombshel about her father. Perhaps it didn’t hurt as much as he’d thought: she said she couldn’t even remember her childhood before she’d been taken for Spartan training, so maybe this seemed just as unreal to her. Mal had grown up without a father as wel . He tried out the idea of being told that his dad had final y shown up and had a steady career as a serial kil er. How did he feel about that? Nothing, nothing at al . It wasn’t real and he couldn’t make it feel that way. Staffan Sentzke was definitely real, though. And Mal didn’t have a mess of buried traumas like Naomi did.\\n\\n Nobody in Kilo-Five had any family ties. That was part of the selection criteria, BB had told them, no complications if they needed to vanish for years at a time. But now one of them had a real live relative they’d never bargained for, and a real y embarrassing one at that.\\n\\n “Are you listening, Staff?” Osman asked.\\n\\n Mal wondered what he’d missed. The captain could make him flinch, informal and easygoing or not. “Sorry, ma’am.”\\n\\n “I was saying that as Ontom’s coastal, we could insert by sea.”\\n\\n “It’s going to have to be at night, either way. But we’re not equipped for going in by sea. You can’t adapt the jump pods to make them into boats.”\\n\\n “I can get in there and drop you without them,” Devereaux said. “Swim in, like the good old days.”\\n\\n “We’d be putting a lot of faith in Tart-Cart’s stealth,” Vaz said.\\n\\n Naomi had been staring at the 3-D projection suspended above the chart table in absolute silence. She started shaking her head very slowly.\\n\\n “Armor. You need it. And I’m carrying three hundred kilos of it. It’s got to be a land insertion, and that means coming in from the north.”\\n\\n “I don’t plan to deploy you, Naomi,” Osman said.\\n\\n “Why not, ma’am? This is exactly what I’m designed for.”\\n\\n The designed bit stung. Osman looked as if she’d taken a deep breath. She could easily have been where Naomi was now. It was almost the first thing she’d told them about herself, like she’d needed to get it off her chest: that she’d been a Spartan kid, but the surgical enhancements had crippled her, and Parangosky had picked her up and put her back together again.\\n\\n And I don’t have to be Freud to work out that relationship.\\n\\n “I don’t want to lose the entire squad,” Osman said at last. “If this goes pear-shaped, I’d lose one of the last Spartan-Twos. No offense, marines.”\\n\\n “It’s okay, ma’am,” Vaz said. “We know she’s a bigger budget item than us.”\\n\\n Naomi just looked at Osman as if she was shaping up to argue, but she let it go. They went back to the holographic fly-through of the approach to Sanghelios and Ontom, trying to work out which features from the mapping run were some kind of radar and where the sensors might be. The 3-D projection suspended over the chart table was finely detailed in places, but it stopped dead at the temple doorway. That would have to be enough.\\n\\n Considering how long Earth had been at war with the Covenant, it stil didn’t have much reconnaissance imaging of Sanghelios. Pretty wel everything they were looking at had come from one mission, Admiral Hood’s trip to meet the Arbiter. One orbit of Sanghelios had enabled UNSC Iceni to map the planet’s topography, and the shuttle had surveyed a narrow corridor across the Arbiter’s home city of Vadam in some detail, but Sanghelios was stil mostly unknown territory. And BB was right. Mal and Vaz had done orbital jumps onto planets with almost no information about where the pods would land.\\n\\n “I think we’re going to have to make orbit and remap al this before we commit to landing anybody,” BB said. “It’l be time wel spent. Just remember that the last fix we have on Phil ips suggests he’s in the temple complex, though.”\\n\\n “So we go in,” Mal said.\\n\\n “Forerunner ruins. As Halsey found on Onyx, they can be a tad irregular.”\\n\\n “So we stil go in.” Mal carried on because not even Osman was fil ing the gaps, and he needed to kil the silence. “Because we want to recover your fragment as wel , don’t we? Or can you just throw it away like a duplicate file?”\\n\\n For an entity determined not to have even a holographic body, BB had quite a repertoire of body language. He could express a hel of a lot with just six plain, flat surfaces that weren’t even there. Mal could have sworn that the watery blue light dimmed for a moment. He got the sense that BB had glanced down at the deck, troubled.\\n\\n He’s based on a human brain’s structure. Whatever he says about meatbags, that’s got to influence how he behaves.\\n\\n “I’ve never lost a fragment before,” BB said. “I’ve generated and shut down many, but this one wasn’t closed. It was interrupted.”\\n\\n Devereaux looked up. “Like pul ing out a chip too fast and corrupting the data?”\\n\\n “That’s a fair approximation. Except … I am data. That’s me. I think it’s more like brain damage caused by anoxia.”\\n\\n “Wow. So you can’t load it al back in again.”\\n\\n “I don’t like gaps in my memory, Lian. They’re painful and distressing.”\\n\\n “But it’s only a duplicate of you, in a way. You can work without it.”\\n\\n “No, it’s not, because that fragment is what you’d cal BB Lite. It had limited functions in case it fel into enemy hands. And its experiences and memories won’t be the same as mine, either, so I need to reintegrate them, to put them back in my timeline, or else … I’m sorry, it’s hard to explain, but it’l leave me with gaps in my mind.”\\n\\n “I used to get those a lot,” Mal said, trying to reassure the AI. “It’s cal ed beer.”\\n\\n “I appreciate the laddish chumminess, but when a mind is al you are, that’s rather disturbing.”\\n\\n Like the rest of the squad, Devereaux always looked straight at the holographic box as if she was making eye contact. BB was supposed to be omnipotent and omniscient, at least for his seven-year lifespan. Mal thought of al the survivable things that went wrong with human brains—strokes, dementia, hal ucinations, memory loss, injury that changed your entire personality—and realized that if those scared him, then it was probably like the threat of terminal il ness for BB. The AI thought, or he didn’t exist. It was that stark.\\n\\n “I bet we find your fragment and it’s fine,” Vaz said. “The first thing it’l do is bitch at us for taking so long to recover it.”\\n\\n Everyone stopped talking again. Mal thought this was the worst thing about slipspace: not the uncertainty of where you’d drop back into normal space, or if the trip had taken longer than you’d planned, but that you were cut off from comms, left to stew in your own juice until you decelerated and could talk to the world again. And the one thing Port Stanley needed now was information from outside. \\n\\n","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-10.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: Halo: The Thursday War (Halo #10) \\n Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.\\n","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
