{"id":97939,"no":20,"title":"Page 20","content":"“I believe some of the symbols are coordinates.”\\n\\n “Just grab everything you can. Once I’m out of here, I doubt they’l let me back in.” Phil ips pushed back from the wal and started pacing sideways around the edge of the room again. He recorded it al from a different angle. “For al we know, the Arbiter might blow this place up if ‘Telcam doesn’t win.”\\n\\n “Do you want ‘Telcam to win?”\\n\\n “Apparently, we want them both to win. And lose. A stalemate. A never-ending nil-nil draw that’s gone into injury time and has an endless penalty shoot-out.”\\n\\n “Should I understand soccer, Professor?”\\n\\n “You get the idea. We want to keep them busy.”\\n\\n Phil ips stood staring at the wal for a long time without saying a word. Then he reached into his bag and took out something. It was food. BB could hear his jaws chomping and see the movement of his throat. Eventual y he swal owed for the last time and went back to the wal , running his hand along it.\\n\\n “Furry barrier … another furry barrier … and now the dictatorish didactic bit … whoa.” As his hand passed over the panel that warned not to do something, whatever it was, the symbols changed conspicuously. One of them lit up, red and blue. “Christ, is that light right in the stone? That’s some trick.”\\n\\n “I real y think you should leave it alone.”\\n\\n “I hear you.” Phil ips took a lot more images of the panel, then touched the plain section next to it and the lights went out. “I hope it’s not a burglar alarm. If we get a bunch of Forerunner cops kicking the doors down, you’l know what it was.”\\n\\n “There are no more Forerunners.”\\n\\n “You’re never normal y this literal. I could get pissed off with this if I didn’t know you’d be back to normal soon.” Phil ips went on, touching every part of the wal s that he could reach. He didn’t seem deterred by the risk. Then, without warning, a piece of stone extruded from the wal as his fingers passed over it. For a second it looked like a plain brick, but then it took shape, developing intricate perforations and turning into a sphere.\\n\\n “Doorknob?” BB suggested.\\n\\n Phil ips pressed his face close to it as if he was trying to peer inside. BB couldn’t see his expression, but he heard the wet click as his jaws moved and the muscles under his chin tightened. He was smiling.\\n\\n “No,” he said. His fingers spun the sphere and BB could see that the doorknob was in fact interconnecting, nested layers. “Arum. Do you remember any of that? The Sangheili puzzle bal that’s supposed to teach their kids persistence and that everyone has their al otted station in society. Except arums are completely smooth, and this has holes carved in it.”\\n\\n “And you’re going to open it.”\\n\\n “Might as wel try.”\\n\\n “Is that wise?”\\n\\n “We’l see.”\\n\\n BB had to admit it was an impressive skil . It took Phil ips under a minute to turn the spheres in such a way that something went click deep inside.\\n\\n That was very fast indeed for a slow-thinking entity like a human.\\n\\n “Now what?” Phil ips stepped back. “Don’t I get a cuddly toy or a coconut or something? Ah … look. ”\\n\\n The panel in front of him was changing completely. BB watched the stone rearranging itself like coalescing mercury. Now the symbols offered a long list of options, locations judging by the string of numbers after each, and the engraving right at the top read … “Doors. ” BB was pretty sure now. “Portals. Entrances. Powered in some way. Expressway? Elevators? No, Professor, don’t touch them. ”\\n\\n Phil ips took a deep breath and held it. “Let’s give it a go,” he said. “This might be the only chance I ever get.”\\n\\n “Don’t you think that we should wait and—”\\n\\n “Can’t,” Phil ips said, and touched the first symbol on the list.\\n\\n CHAPTER SEVEN\\n\\n THE MOST INTERESTING THING ABOUT THE FORERUNNERS AS FAR AS I’M CONCERNED IS WHY THEY’RE NOT AROUND ANY LONGER. SPECIES GO EXTINCT ALL THE TIME, BUT SOME OF THEIR RELATIVES USUALLY SURVIVE. A TECHNOLOGICALLY SOPHISTICATED, GALACTICALLY DISTRIBUTED RACE GETTING WIPED OUT TO THE LAST INDIVIDUAL, THOUGH—THAT REQUIRES INTERVENTION.\\n\\n (ADMIRAL MARGARET PARANGOSKY, CINCONI)\\n\\n VADAM, SANGHELIOS\\n\\n So this was Jul’s world; this was what he did, what he’d done almost every day since Raia had first met him, and it was nothing like she’d imagined.\\n\\n It was noise and shock and blinding light, and now it stank of blood, too.\\n\\n She ducked as the bolt of white fire came right at her. It was pure instinct, absolute animal terror, but the missile detonated some way off Unflinching Resolve’s bow and never made contact at al . The shock wave did, though. The ship shuddered and bucked. Two strips of metal broke free from the bulkhead and shot across the deck, one bouncing down the polished metal, the other embedding itself like a blade in one of the warriors at the helm controls. He went down like a fel ed tree. The metal fragment vibrated for a few seconds, standing upright in his back. Two of his brothers rushed forward to drag him clear but Raia didn’t see where they took him or even if he was stil alive. She cowered. Nobody on the bridge took any notice of her. She couldn’t see what was happening outside, and the glimpses she snatched of monitors and sensors meant nothing to her.\\n\\n Buran roared, exasperated, grabbing the helm. “We must withdraw, Field Master. Do you hear me? We need to withdraw, or move into orbit.”\\n\\n ‘Telcam stood at the console as if he hadn’t even noticed the ground fire coming up at the ship. The deck shook again.\\n\\n “And the Arbiter wil pursue us into space, Buran, and where wil we go from there?” he asked. “We have nowhere to retreat.”\\n\\n “We weren’t ready to move.”\\n\\n “But we moved nonetheless, and the battle isn’t lost yet. Come about. Bring the ship around.”\\n\\n Raia looked to her side. A young male was trying to repair a control panel that smoked and sparked every time he touched it.\\n\\n “We’ve lost navigation, my lord,” he said. “I can’t repair it.”\\n\\n “Then we fly by sight, Dunil.” ‘Telcam stalked across the deck and went to the other viewscreen. “I need cannon. Now. ”\\n\\n Raia caught Dunil’s eye. “Are we going to crash?” she asked.\\n\\n “Possibly, my lady.” He lowered his voice. “Bend your limbs and protect your head if we start to lose height. That might save you from breaking bones.”\\n\\n The booming sound was louder and the white-hot flashes were much closer together now. Then the whole ship lurched as if it had crashed into something. Raia felt the shock ripple back through the deck. Jets of white vapor began punching out of conduits that then burst and sent fluid gushing like a ruptured artery.\\n\\n “Direct hit!” someone roared. “Direct hit! The hul is breached, we’re losing height, we have no propulsion—”\\n\\n The ship peeled off in a total y different direction, suddenly much quieter, and for a moment there was an il usion of things returning to normal, but everyone was rushing to console positions and Raia knew it was anything but.\\n\\n “Crash landing,” Buran yel ed. “Brace for crash landing. Steer to the shore.”\\n\\n “Shipmaster, we can’t—”\\n\\n “I said steer for the shoreline!”\\n\\n I won’t survive this.\\n\\n I’m going to die, and I’ll never find Jul.\\n\\n Raia braced as she was told, waiting second after second for an impact that would throw her into dark oblivion. I’m sorry, Jul. I had to try. Then there was a huge jolt, then another, and another, and the deck was bouncing her like a pebble on the skin of a drum. Metal screamed. Fittings tore from the bulkheads. The lights went out. Then everything stopped dead and she was flung into a row of bench seats.\\n\\n Now I’m dead. Now I’ll see for myself if the gods exist or not, and if they do I shall spit on them for abandoning us when we most needed them.\\n\\n But she wasn’t dead, or else she wouldn’t have been able to feel the rip in her shoulder muscles as someone grabbed her and tried to pul her with them.\\n\\n “Get out, my lady.” It was Dunil. “We’l be burned alive if we don’t run.”\\n\\n Instinct made her scramble upright and run with him, stumbling over bodies and not looking down to see who they were. She was swept up in the tide as everyone abandoned ship. Cool, fresh air hit her face and she was suddenly skidding down a torn sheet of metal the size of a raft, hot under her hands, then fal ing a short distance onto grass and pebbles. She had already run some way from the wreckage before she looked back to see what was cracking and groaning behind her.\\n\\n Flames licked what was left of the hul for a few moments, then engulfed it. The last thing she saw before she fled for her life was jets of leaking coolant ignite and send columns of flame into the air like blowtorches. When had she last run like this, throwing every muscle fiber into it? She’d been a child. She’d been playing chase with her brothers and sisters. As she grew up, she learned that females didn’t run. They had no need to.\\n\\n But she needed to run now. Her legs pumped but she felt as if she were struggling through mud. Her lungs screamed for breath. Then a blast— silent, oddly silent—caught her ful in the back and lifted her off the ground. She landed hard and the last gulps of air were knocked out of her. Noise and blisteringly hot air swept over her moments later. Al she could do was lie there, unable to move, noticing just how many smal black clouds of smoke were hanging in the sky above her, and wait to die.\\n\\n Someone grabbed her arm again and pul ed her to her feet. “Run, my lady.” It was Dunil, the young male who’d been so patient with her on the bridge. “We have to get out.”\\n\\n “Where’s Forze?” She couldn’t get her breath. “Where is he?”\\n\\n “I can’t see him. Everyone’s scattered. Quick, find cover. They’re coming for us.”\\n\\n “Who is?”\\n\\n “The Arbiter’s troops.”\\n\\n Al Thel ‘Vadam’s forces had to do was head for the crashed ship, now a burning beacon on the edge of the city. There was no hiding from them: if she tried to pass as a local in Vadam, her accent and light skin would mark her out as coming from a foreign keep. The entire crew was in the same position. They would have to fight their way home. She found herself stumbling through thorn bushes and then into trees, and only when she ran out of breath and her legs wouldn’t carry her any farther did she stop, dropping to the ground. Dunil stopped with her.\\n\\n “You have to keep going.”\\n\\n “Go. Leave me here.”\\n\\n “I can’t.”\\n\\n Raia could think of nothing now but survival. Just when she thought her lungs would burst and she could never stand up again, a cold and intense clarity swept over her and stripped away every thought that wasn’t devoted to the immediate moment. She reached into her holster and took the plasma pistol, checking the charge.\\n\\n “I have several hundred shots in this, don’t I?” She held it so that Dunil could see it. “Tel me. How many?”\\n\\n “That model? Four hundred.”\\n\\n “More than enough.”\\n\\n “For what?”\\n\\n “To kil any fool who tries to kil me. ” Finding Jul was a secondary issue now and she was shocked to find she felt no guilt for thinking that way.\\n\\n She was no use to Jul dead. “I have nothing to lose. What do we do now, regroup or press on?”\\n\\n Dunil looked down at her as if she was mad. “Do you want the command view, or the real one? I could tel you that we press on and die gloriously, or I could tel you that the intel igent thing to do is to escape and come back another day with greater forces.”\\n\\n “Then we wil do the intelligent thing,” Raia said. She looked around, buoyed up on new clarity, and spotted some of Unflinching Resolve’s crew moving through the trees at a crouch, pistols in hands. “I have never traveled far from my keep. How do we get home now?”\\n\\n “Ah, that’s the question,” Dunil said.\\n\\n Forze came crashing through the undergrowth, smoke-smeared and angry. “Raia, come with me. We must get down the shore. Naxan’s going to send Gusay to col ect you.”\\n\\n “Is that it? What about everyone else?”\\n\\n “Let us worry about that. You shouldn’t be here. This is no place for an elder’s wife.”\\n\\n “Don’t start that argument again.”\\n\\n She could stil hear the sporadic crack and hiss of cannon somewhere in the distance. Then another sound began to drown it out, a ship’s drives, and she assumed it was Gusay showing up to take her home. It was only when the sound multiplied that she realized there was a squadron of vessels somewhere overhead, and her assumption changed: this was the Arbiter’s fleet, coming to hunt them down and finish them off. She wasn’t the only one. She saw al the males look up and aim their weapons, pointless though it was to try to take on warships with pistols.\\n\\n But she raised hers, too.\\n\\n Then ‘Telcam came stalking into the clearing just ahead of her. He held out his arms as if he was summoning his crew for an address.\\n\\n “Do you hear that?” he cal ed. “Do you hear it? Do you know what that is?”\\n\\n He was taking a huge risk. Whoever was flying overhead would be able to see him. But he looked more than unconcerned. He looked triumphant.\\n\\n “What is it, brother?” one of the monks asked.\\n\\n “Listen to your communications,” ‘Telcam said. “Open the channel. The gods have come to our aid.”\\n\\n Raia’s heart sank. The monk had lost his mind. She waited for a searing energy bolt to vaporize him where he stood, but she turned and caught the expression on Dunil’s face and Forze’s. Al the troops were listening to something.\\n\\n She had no communications equipment. She wouldn’t even have known which channel to switch to. \\n\\n","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-20.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: Halo: The Thursday War (Halo #10) \\n Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.\\n","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
