{"id":97954,"no":35,"title":"Page 35","content":"“And now,” Devereaux said, “I’m going to show you something you really have to see. Check your HUDs.”\n “Oh, damn, I can’t do this.…” Phil ips seemed to be moving his head rather than his eyes in a bid to activate the right icon. “Can I take this helmet off now?”\n “Yeah, take a look out of the viewscreen.” Devereaux gestured to him through the hatch without turning around. “Come up front. Check this out.”\n Phil ips left his helmet on the bench seat and moved forward. It took Mal a few seconds to work out what Devereaux was sending to everyone’s display. On first glance he thought it was a section of a refit station, a long slab of a hul with bristles of sensor masts dotted along its length that stretched past the limits of the frame. Then the image tracked to port and the vertical wal of metal plate turned into a flared section bearing white lettering: UNSC INFINITY.\n He couldn’t quite get the scale. But it had to be bloody enormous.\n Phil ips was in the cockpit, seeing it with the naked eye. Mal could tel by the whoops.\n “Ohhhh my God. ” Phil ips’s head bobbed up a couple of times as if he was bouncing in his seat. “Oh my God, that’s a monster. That can’t possibly land anywhere, can it?”\n Vaz started laughing. Phil ips loved al this stuff and seemed total y unashamed of his excitement. Mal wondered how the professor would ever make the transition back into academic life, where the biggest battles he saw were probably over parking spaces or dodgy research papers, and then realized that he never would. Who’d want to go back to that? Kilo-Five got to see and do things that no other human being did. This was life, lived.\n “Move over, Prof, we want to see her too.” Mal got up to peer through the cockpit hatch and found himself jockeying for position with Vaz and Naomi. Phil ips slid out of the seat and Mal took his place.\n Now he could get the scale of the ship. She was in just the right position to be ful y lit by the sun with nothing behind her, hanging there like a long, thin, death-dealing shoebox.\n “Oo-er missus,” he said.\n “And we’re stil fifty klicks away from her.” Devereaux magnified the image on her monitor. “I can’t even see Stanley, but if we could, she’d be a dot.”\n Vaz didn’t sound remotely excited. “So the hinge-heads have to be able to see her from the ground.”\n Phil ips half-turned to say something to him but he was drowned out instantly by the fire alarm klaxon. Devereaux reached out across the control panel and shut it off.\n “’Scuse me, folks, I need to check that’s not a real one,” she said, squeezing out of her seat. “None of the monitoring’s working properly. BB, what are you getting?”\n “Something’s hotter than it should be in section seven-alpha-ten,” he said. “Nothing specific from the entire port quarter, though.”\n “I’l go.” Naomi motioned Devereaux back to the cockpit. Tart-Cart was only a heavily modified Pelican airframe, roughly thirty meters nose to tail.\n There weren’t many compartments to check out. “Is the fire suppression stil working?”\n Osman’s voice cut in. BB was embedded in both ships and sharing what little status data was coming out of Tart-Cart. “Port Stanley to Kilo- Five, I’m standing by.”\n “Naomi’s checking it out, ma’am.”\n Mal was stil in the copilot’s seat, listening to Naomi thud down the length of the crew bay and slide open a door in the transverse bulkhead.\n There was an internal cam facing aft, so he could see the open door and caught a glimpse of Naomi feeling her way along another bulkhead, using her glove sensors to pick up hot spots. Phil ips was about halfway down the bay, watching.\n “It’s pretty hot behind this panel,” Naomi said. “If the suppressant system isn’t working, you’d better seal the bulkhead behind me and I’l use the —”\n She was cut short by a smal explosion. A flash of yel ow light overwhelmed the cam. Mal didn’t get a chance to move before Vaz sprang back into the crew bay, grabbed Phil ips’s helmet, and slammed it straight down on his head. A sheet of flame shot out and licked over them before dying away as if something had sucked it back.\n “Shit shit shit.” Phil ips was rooted to the spot, armor smoking at the shoulder seals. “Oh shit.”\n Vaz had a tight grip on his arm. “You’re okay. The suit’s sealed. Relax.”\n Mal went aft to check them over. The view from the exterior hul cam showed oddly shaped flames jetting out into space as the oxygen escaped.\n Naomi, calm as anything, let out a breath. “Hul breach. Something’s blown a hole in the repair.”\n “Okay, everybody chil ,” Mal said. “We’re al suited and sealed. The fire’s not going to kil us, and we’re almost home. You okay, Naomi?”\n Mjolnir armor was built to take close detonations. More flame licked out from the ruptured compartment for a few seconds and the Spartan just stood there, letting it curl past her. “Hit the fire suppressant, Dev,” she said. “It hasn’t kicked in automatical y.”\n A mist of nitrite mix clouded the air. It was touch and go whether the fire control system kil ed the flames first or the oxygen ran out and stifled them. Osman’s voice came over the radio.\n “How bad is it?” Osman asked. “I’ve got the cam feed. Everyone okay?”\n “We’re dead in the water, ma’am,” Devereaux said. “The fire’s suppressed, but we’ve lost propulsion. We’re going to need a hand.”\n Phil ips pushed back the top filter on his visor. Mal could now see his eyes, and it was the first time the poor bugger had actual y looked terrified.\n A shipboard fire was pretty scary stuff at the best of times, but everyone knew their armor would almost certainly withstand it for long enough to get the blaze under control, and al they had to do was not panic if the flames passed over them. It was a natural animal reflex to fire that took a lot of training to resist. Phil ips hadn’t had it.\n “It’s okay, mate,” Mal said. There was no shame in being terrified of a blaze in a ship. “You won’t cook and you won’t asphyxiate. Trust the suit.\n And underwear washes.”\n “This,” Phil ips whispered, eyes stil wide, “has been the most amazing week of my entire life. Fantastic. ”\n Mal knew what he meant. There was nothing like pushing yourself to your absolute limits and maybe a bit beyond. You knew you were alive. But they were stil fifty klicks from safety, and ODST armor was rated at fifteen minutes in vacuum. Mjolnir’s endurance was a lot longer.\n “UNSC dropship, this is Infinity, ” said a voice Mal didn’t recognize. “Stand by for assistance. We’re on our way.”\n Nobody cheered. It was a measure of how tight the team had become that Infinity was almost an interloper. “Ma’am, are you okay with Infinity picking us up?” Mal asked.\n “Can’t refuse,” said Osman. “Check her out while you’re there, and be nice to the Admiral.”\n “Hood or Parangosky?”\n “There is only one.”\n “Okay.” Mal checked his air supply readout. “Dropship to Infinity, yes please, and make it snappy. We’re on suit air.”\n “We can do snappy,” the voice said. “We’ve got frigates underslung.”\n Devereaux let out a breath. Mal thought she was just pissed off that her repairs hadn’t held up after al , but then he caught movement on the external cam and saw what had grabbed her attention. A point of light went from a pinprick to a frigate in seconds.\n “So that’s where our tax dol ars went,” she said. “Do you think I can sweet-talk them into customizing Tart-Cart in their workshop?”\n CHAPTER TWELVE\n ONE DAY WE’LL LOOK BACK AND REALIZE THAT THE TURNING POINT WASN’T A BIGGER, BETTER SHIP OR BIGGER, BETTER WEAPONS, BUT THE FACT THAT WE ACQUIRED HURAGOK AND OUR ENEMIES LOST THEM. IF WE LOSE A SHIP, WE CAN NOW REPLACE IT WITH AN EVEN BETTER ONE. IF THE SANGHEILI LOSE ONE, THEN THERE ARE NO HURAGOK LEFT TO MANAGE THEIR SHIPYARDS OR CARRY OUT COMPLEX REPAIRS, LET ALONE DEVELOP BETTER EQUIPMENT. EVERY SANGHEILI ASSET WE DESTROY DEGRADES THEIR CAPABILITY FAR INTO THE FUTURE. WARS TURN ON THE ACTIONS OF INDIVIDUALS: FIRST THE SPARTANS, NOW THE HURAGOK.\n (ADMIRAL MARGARET PARANGOSKY, CINCONI: DRAFT OF PROPOSED EVIDENCE TO UEG SECURITY SELECT COMMITTEE)\n OPPOSITION CAMP, VADAM\n “Consider this,” Forze said. “It doesn’t matter if the rest of the states sit and dither. When the Arbiter’s deposed, they’l al creep out of their holes and say they agreed with us al along.”\n He took the Phantom through clouds of smoke so dense that it seemed more like dusk than morning. Raia remembered that she hadn’t cal ed her keep to check that everything was under control, and felt ashamed. No matter: Umira was sensible and wouldn’t worry—yet. Raia had shifted her perspective from a ground-level one, the day-to-day life of the keep, to a world seen from an elevated position in every sense of the word. The experiences of the last few days had raised her eyes. She leaned forward a little to get a better view of the terrain as Forze descended over the Vadam coast.\n I had no idea all this was possible.\n Why are these decisions all made by males? Why don’t I have a say in this? Why did I never seek to have one?\n She had power within the keep, the power over bloodlines and control of the estate, a responsibility that determined the fate of generations to come long after she was gone: but that wasn’t the same. This was where the next day, the next week, the next year was decided. This was where things happened that could render al the slower, subtler decisions irrelevant. The choices were made by warriors on battlefields, and she wasn’t consulted. Her fear for Jul’s safety was tinged with anger at being left behind to pick up the pieces.\n Dead ahead, Mount Kolaar was a jagged spearhead shape stabbing the sky, its lower slopes curtained with smoke. She could stil see sporadic plasma flashes. If Jul was a prisoner of the Arbiter and held in Vadam keep, then that was the worst place he could possibly be. Fire shot out from the keep at long intervals, and fire spat back. There seemed to be no end in sight.\n “Why is it taking so long to dislodge the Arbiter?” she asked. “We used to be able to destroy entire worlds in the course of a day.”\n “Because destroying someone else’s world is warfare, but destroying your own is suicide,” Forze muttered. “And … damn them, something has a lock on us—”\n Raia saw a control panel indicator change color and begin pulsing as Forze swung the Phantom around an almost vertical climb. Her stomach plummeted. She grabbed for the closest solid object—the cockpit trim in front of her—as a hot white streak passed wide of the viewscreen and suddenly the sky was clear again. The layer of smoke spread below them like thin, grubby cloud.\n “Anti-air defenses,” Forze said. “Enough of that nonsense.”\n He looped to the left and headed back over the coast. The loop turned into a circle, and suddenly he was accelerating back inland again, making the drive scream and skimming lower across the tops of trees and buildings until he was about to crash into them, and then— Raia wanted to shut her eyes but couldn’t. We’re going to crash. We’re going to crash. We’re going to die.\n The Phantom shuddered as if it had been kicked. Raia’s field of view was bleached out by an instant bal of light, then resolved into a pil ar of flame and black smoke just as the noise of an explosion hit her in the chest. She felt the shock wave al the way through to her spine.\n “That’l teach the traitor,” Forze said. He didn’t seem shaken at al , more annoyed than anything. “Got him.”\n Raia let go of the curved cockpit section and sat up, trying to regain her composure. “Got what?”\n “The mobile artil ery position. My apologies for the close detonation, Raia.”\n So that was a strafing run, a bombing run, something like that. She’d heard Jul use those words over the years and never real y taken much notice, but he should have said that it was terrifying and deafening and so fast that he didn’t have time to think. Then she would have understood.\n But perhaps he didn’t find it frightening at al . Perhaps he switched into glacial calm. Perhaps he even enjoyed the exhilaration. Or maybe he was just irked by the audacity of someone trying to kil him, like Forze was.\n “I’m … glad,” she said.\n “I shouldn’t do this with you on board.” Forze shook his head slowly. “But then if I had any sense, I should have diverted to Mdama and taken you home instead of bringing you back to a battle. It might be easier than arguing with you, but this won’t help you find Jul.”\n Yes, she realized that. She also knew that she couldn’t just sit at home and wait by the window like some docile, obedient wife from the old sagas. She knew now that she would never be able to do that again even if—no, when, it had to be when—Jul came back. She had no ambition to become a warrior, but she was never going to be excluded from these decisions again, either.\n “There were once female swordmasters,” she reminded him.\n “I have heard of one. ”\n “A principle is not about numbers. A convention either is, or is not. That one— is. ”\n “Please don’t tel me you want to be a warrior.”\n “No. But I should have the choice.”\n Forze snapped his jaws a few times, obviously lost for words. “I swear it, Jul wil snap my neck when he finds out what I’ve let you become.”\n The Phantom jinked again. Raia braced for the flash, shudder, and explosion, but none came. The dropship was now flying slowly over ‘Telcam’s lines, which looked much more organized than they’d been when she’d left for Acroli. Warriors were massed in orderly groups, Revenants and other transports were lined up on the flanks, and there were even defensive barriers being built, Sangheili and Unggoy digging trenches and piling up earthworks side by side. They seemed to be preparing for a long siege. \n","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-35.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: \n Halo: The Thursday War (Halo #10) \n Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.\n \n","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
