{"id":97965,"no":47,"title":"Page 47","content":"“The Didact,” Jul said. “The warrior god who had to be concealed.”\n Phil ips nodded with that crinkling of the brow that indicated a wistful sadness. It probably wasn’t genuine. “The Forerunners certainly put a lot of prohibitions around him.”\n Now Jul was getting somewhere. He had the feeling that Phil ips was testing him as much as he was testing Phil ips, but that could be exploited.\n He needed locations. He needed to know more about portals, where they went, where he would end up if he touched that wal and activated one.\n He might simply end up in a field on the same world, just like Phil ips had.\n “He hated humans,” Jul said. “Your species has been causing offense for mil ennia.”\n Phil ips didn’t even twitch. “I’d never come across his name before in my studies.” He pul ed out a datapad and made some marks on it, gaze flicking between the pad and Jul’s belt. “Could you stand up, please? I’d like to record those as wel .”\n “Why?”\n “Because Sangheili language and culture is my life’s work, and I have a theory that some of your language came from the Forerunners.” Phil ips had that fire in his eyes once again. He wanted to know simply for the sake of knowing. It was luminous and honest, a child’s passion. “Have you heard of the Hittites? Probably not. An ancient human empire—military heavyweights. They used an alphabet that looked like other languages in what we cal ed the Middle East, but we couldn’t translate their inscriptions. We just knew what the sounds were. Then a scholar transcribed some words phonetical y, and recognized sounds from European languages. Once he explored that tiny detail, just those few words that struck a spark in him, we were able to translate the Hittite language, and we found they weren’t Middle Eastern at al . They came from another part of our world. It changed everything we thought we knew about them.”\n There was no harm humoring Phil ips now. He loved his subject, he loved to talk, and he loved to show off his knowledge. This was how tables were turned. Magnusson simply watched, looking mesmerized by Phil ips’s fluency. She kept staring at him as if she couldn’t believe the alien sound that was coming out of his mouth.\n “What happened to them?” Jul asked.\n Phil ips’s face relaxed in that dismayed way, as if he hadn’t been expecting to be asked. “Their civilization disappeared,” he said. “They were destroyed by their own civil war. And no, I didn’t tel you that to make some point about your fate. I just want to find those few hidden words, that key to understanding both cultures.”\n If Jul knew anything about humans, it was that Phil ips meant that last sentence regardless of whatever other lies he told. He went on sketching on his pad, face flushed under that thin layer of wiry brown hair around his mouth and chin. He had something that he wanted, and now Jul would try again. It was hard to play this game under so much scrutiny from others who played it every minute of their lives.\n “So what was of interest in Acroli, other than crops?” he asked.\n “Forerunner ruins,” Phil ips said, distracted. “You have so many on Sanghelios. Far more than on Earth. I exited in a col apsed building. A few inscriptions, but nothing significant.”\n If Phil ips had been ported to another Forerunner site, even the wrong one, then that confirmed Jul’s theory. The answer was smal but had been worth the effort.\n Suddenly Phil ips frowned at his screen and looked put out. “I’m sorry, Jul,” he said. “I’ve just had a message. I have to go back. I’d hoped we’d have longer. Perhaps I can come again sometime.”\n Make it soon. Or you won’t find me here. “I hope you find your key.”\n “I’l keep looking. And if I can, I’l ask about Raia. I promise.”\n Magnusson didn’t say a word. She fol owed Phil ips out of the cel and Jul went to the window to gaze out and make sense of what he’d gleaned from that conversation. It had made up his mind to risk accessing a portal as soon as he could. The Warthog was stil parked where he could see it, in the shade of some trees. A few minutes later, Phil ips walked briskly up to it, punching his palm.\n It was a strangely inverted human gesture, just like baring teeth to show peaceful intent. They hurt their hands to show they were pleased.\n Phil ips would keep his word and try to find out about Raia. But if he found out anything, if he passed that back to Jul—it would be unbearable.\n Jul would never see her again. The humans would never let him go home. He had to do it soon, very soon, now, or die in the attempt.\n UNSC PORT STANLEY, FORMER ONYX SECTOR Mike Spenser was a patient man. He nursed a mug of coffee while he chatted on the secure link, more like a man catching up with his family than an agent operating undercover on a planet where the entry permit was a criminal record, official or otherwise.\n “I hear you’ve been wreaking havoc on Sanghelios, Mal,” he said. “Are you on your way back now? It’s kind of quiet here. I could do with some entertainment.”\n Mal stil wasn’t sure how much to tel Spenser. That was a job for Parangosky, but she wasn’t here, and Osman was on the hangar deck with the rest of the squad. In a day or so, Mal would be relying on Spenser to help them infiltrate New Tyne. He wanted to build more trust with the man.\n “Not exactly us, ” Mal said. “We just had to extract Phil ips. The hinge-heads were kil ing each other pretty efficiently without any help from us.”\n “Wel , if Infinity had the same effect on them that it’s had on the rest of UNSC, then I’d cal that a result.”\n “It’s amazing how you can hide something that big for years, isn’t it?”\n “Even from fel ow intel igence agencies.”\n “Yeah, sorry about that. But half of ONI didn’t know about it, either.”\n Spenser didn’t look as if he believed him. It was just a faint flash of the brows. “And word’s out in Kig-Yar cafe society about a new chick in town.\n Shipmistress Lahz.”\n “Ah. BB’s missed his cal ing as a female impersonator.”\n “He did a good job. Maybe too good. I’m not sure whether to keep that show going or not.”\n BB popped up out of nowhere and hung between Mal and the screen. “What do you mean, too good? I’l have you know I got rave reviews for my Lady Macbeth.”\n “You know Kig-Yar. Very territorial, al the gang bosses panicking about who this character is and how she can get hold of UNSC missiles.”\n Spenser spun around slowly in his chair to pick up something from the table behind him. He was in his makeshift basement ops center, the one where Mal had first realized that Venezia was going to get personally messy for Kilo-Five. “Anyway, word travels fast. Might be useful when we need to do deals with the buzzards. Now … Sentzke. He left Venezia a couple of days ago, and I’ve lost track of him. He rarely travels, and I rarely lose his trail, but this time I’ve no idea where he’s gone.”\n “But he’l be back, right?”\n “He always has been. Do I take it that you’re going to handle this internal y?”\n “Yes,” Mal said, without thinking. “Leave him to us.”\n “Okay. And stil no sign of Pious Inquisitor, although I think I know where Sav is. Sav Fel. Handy intel, by the way. Thanks.”\n “So if you were a Kig-Yar, who would you sel a stolen battlecruiser to?”\n “I might keep it for myself, if I had designs on lifting Jackal-kind up the social ladder in the new world order. But as long as it doesn’t end up in a used warship auction here, that’l be a result. Because that’s what’s real y worrying me.” Spenser put his mug down with a thunk and looked like he was finished. “Okay, I’l wait to hear from you. Just remember to give me some notice if you need to land anything real y big and hide it.”\n “See you later,” Mal said. “We’l bring the coffee.”\n BB placed himself on the chair next to Mal, hovering at head height. “Phil ips is back. Just docked, wittering on about knowing who the teacher is.\n I hope Trevelyan’s evil boffins haven’t tested some new psychotropic drug on him.”\n “You’re in a good mood. I thought you were having a sulk.”\n “I’ve been contemplative, yes.”\n “But your reintegration thing worked okay, didn’t it?”\n “Sort of.” BB knew everything and ran everything. Hearing him say sort of wasn’t reassuring. “Mal, what are you more afraid of, death itself—you know, the things you’l never do, the finality of it—or of how you’re going to die?”\n Mal had a feeling he knew where this was going. “The how, I think,” he said, “and I’m an ODST, so I’ve given it plenty of thought. Normal y two seconds before they drop my pod. But the way things are going now, I’l probably die from sitting on my arse and overeating. There are some ways of dying that seem less crappy than others. I’ve seen a fair old selection to help me make up my mind.”\n “I know exactly how I’m going to die. And almost exactly when. Unless someone like Halsey pul s my plug, there’s only one way out for an AI.”\n “It’s okay to be scared of that. We can kid ourselves that it’l never happen to us, but you’re too smart for that.” There was no shoulder to slap or hair to ruffle. Mal couldn’t even drag him out to a bar and pour beer down his throat. “Do what I do. Make yourself think about it until you’re sick of it, then get on with your life.”\n “You know, you’re rather good at this leadership thing. Have you ever considered a career in the marines?”\n “See, you’re better already.”\n “Look sharp, Staff, Captain on deck.”\n Osman swept in with the rest of the squad and took her seat. No ginger to ease the jump today, then; maybe she was going cold turkey on it.\n BB twirled away and settled on the nav console, back to his usual self. “Everyone got their passport? False nose and mustache? Let’s spin up for sunny New Tyne, then.”\n Phil ips plopped down into his seat on the bridge, looking a bit breathless. “I know who the teacher is. Or was. A Forerunner cal ed the Didact.\n He hated humans.”\n “Wel , the Forerunners are extinct and we’re not,” Mal said. “So neener-neener.”\n “Jul said something about him needing to be hidden. I think he was just winging it, though, because this Didact guy has only just popped up. If this was part of their faith that even a semi-atheist like Jul knows, then the Abiding Truth would have had a whole library about it. A sub-cult, even.”\n “So was he hiding from something, or did they lock him away? Don’t tel me they had a nutter god.”\n “No idea, but the only risk to us is probably any countermeasures they put in place that stil work. Like the Halos. Which is what I’m going to focus on.” Phil ips gave Devereaux a grin. “So you were right. The Forerunners had some issue with the Didact, but that was a hundred thousand years ago.”\n “So was Onyx,” Devereaux said. “And it’s stil going strong.”\n Mal was sure that the drives felt smoother as Port Stanley wound up for the jump and flung herself into another dimension. Sometimes he spent a few minutes concentrating on the featureless nothingness beyond the viewscreen, trying to get some feel for what slipspace was beyond a set of numbers and diagrams. He stil couldn’t quite grasp it. It was a curtain behind which the real world went on, a blackout blind, a tunnel that he’d emerge from sooner or later, never a separate reality. It was one of those things he knew existed, and could prove and see, but didn’t believe in at a level that resonated in his chest. Sometimes, when he was having trouble sleeping and needed to numb his brain, he thought about religion.\n There were people like ‘Telcam and Manny Barakat, not even the same species, who could believe completely in something that not only couldn’t be proven but showed no sign of existence at al —quite the opposite, in fact. The nearest Mal could get to knowing how they felt was to take hold of his unbelief in the slipspace he knew to be there and turn it upside down in the hope that he’d final y understand how they felt. Occasional y, for a few fleeting seconds, he did. Vaz had told him that a doc could stick an electrode in a certain part of the brain and give even an atheist a religious experience with every zap, guaranteed, but Mal didn’t want his sense of reality messed around any more than it already was.\n Kilo-Five wasn’t a spiritual outfit at al . ONIHR had personality-matched the squad pretty wel , he decided, and went down the hangar bay to see what Adj and Leaks were doing with Tart-Cart. Even the Huragok had merged into the team without a hiccup.\n “Oh, great,” Vaz said. “You’ve accessorized it.”\n The dropship, already subtly altered, was now changing color. Her hul cycled through various camo patterns—desert, arctic, forest—and then took on the palette of the hangar so exactly that it looked like some street artist had done it for a laugh. Then the hul went back to matte charcoal gray.\n “I don’t know why I didn’t think to ask for that before.” Devereaux walked around the ship with her arms folded, grinning from ear to ear. “Reactive camo. It was just a matter of getting Adj and Leaks to incorporate it into the stealth coating without messing up the carbon nanotube kit.”\n “So how invisible are we going to be?”\n “Stil not completely invisible, and there’s not much I can do about the noise, but I can land this and lay her up with more peace of mind.”\n “Shame we couldn’t have had these extras while the war was stil on.”\n “Hey, that’s life in a blue suit. And our war isn’t over.”\n Mal felt that his was. He went back to the gal ey and set the processor to whip up some more yeast nutrient for the Huragok, then drew up a roster for making the stuff and posted it on the bulkhead. It was like arguing over whose turn it was to feed the bloody cat. The idea of Adj and Leaks making a fuss of him to get fed struck him as funny, not that he could ever see them doing that, and he was stil laughing to himself when Vaz came in and tapped his finger to his ear to indicate his earpiece. \n","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-47.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: \n Halo: The Thursday War (Halo #10) \n Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.\n \n","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
