{"id":97924,"no":5,"title":"Page 5","content":"“Ma’am,” Mal said, “we’ve got a unique problem.”\\n\\n “That’s an unusual word for you, Staff.”\\n\\n “It’s an unusual situation.”\\n\\n “Just tel me they’ve not acquired orbital nukes.”\\n\\n “I think Spenser would have mentioned that, but we’ve got a complication that … wel , it’s something I think Naomi needs to hear as wel .”\\n\\n Osman didn’t even blink. “Is it something I need to hear?”\\n\\n “Oh yes.”\\n\\n “Like I’ve said before—we’ve got no secrets in Kilo-Five. We’ve got to trust each other to do this kind of job.”\\n\\n Mal half-turned to Naomi and hesitated, one of those short human pauses that was an eternity for an AI. BB was used to knowing what was coming next: he thought far faster than a human and his awareness was literal y everywhere at once. But he had no idea where this was leading, and it both scared and thril ed him. Information. It was an AI’s addiction.\\n\\n But Vaz got there first. He didn’t seem to relish that.\\n\\n “Naomi,” he said. “Your father’s stil alive. He’s on Venezia.”\\n\\n BB wasn’t expecting that at al . It shocked him, not because her home planet had been glassed long ago, but because he didn’t know already.\\n\\n How had he missed that? He knew her real background, the backgrounds of al the Spartan-IIs. Somehow he’d overlooked something. He took five nanoseconds to trawl through al his databases again, every casualty list, every criminal record, every census, and stil came up blank on Sentzke.\\n\\n Now al he could do was observe Naomi and study her reaction.\\n\\n She was getting better at dealing with bad news. Like the ODSTs, she didn’t turn a hair at operational surprises, but personal matters caught her off balance. She’d hold her breath and almost freeze for a second, then gather herself and look impassive again. She was doing that now.\\n\\n “I don’t know if I even remember him,” she said at last. “How come he survived? And why is he on Venezia?”\\n\\n So this was what Vaz insisted he’d do if Mal didn’t. He was going to tel her about her father. BB could see from the muscles twitching in Vaz’s temples that the worst was stil to come.\\n\\n “He’s part of the anti-Earth rebel ion,” Vaz said. “He’s on the terrorist watch list, Naomi.”\\n\\n CHAPTER TWO\\n\\n I SHOULD HAVE THOUGHT OF THIS BEFORE, BUT WHAT DO SANGHEILI EAT? I DON’T MEAN NUTRITION. WE KNOW THEIR PHYSIOLOGY WELL ENOUGH NOW TO KNOW HOW TO KEEP THEM ALIVE. I MEAN THE CULTURAL ELEMENT IN THIS—WHICH DISHES COMFORT THEM? WHAT REMINDS THEM OF HOME AND CHILDHOOD? DON’T THINK I’M GOING SOFT. I HAVE MY REASONS FOR ASKING.\\n\\n (DR. IRENA MAGNUSSON, ONI RESEARCH FACILITY TREVELYAN, TO COLLATION SERVICES, OFFICE OF NAVAL INTELLIGENCE)\\n\\n ADMIRALS’ INSPECTION, UNSC INFINITY: SOMEWHERE IN THE OORT CLOUD Parangosky could tel everything about a warship from those first few unplanned, unguarded moments when she deviated from the inspection plan and wandered off on her own.\\n\\n “Ma’am? The command bridge is this way.” The young petty officer came trotting after her as she peeled off down an unlit passage in the opposite direction. “It’s easy to get lost in Infinity. She’s nearly six kilometers long, and—”\\n\\n Parangosky carried on walking and held up her datapad like a security pass. “I know, Richardson, I’ve got the blueprints. I’l be fine. Worry about Admiral Hood.”\\n\\n “You’re going to want to take a supply trol ey, then, ma’am. The deck transit system’s going to be down for a few hours and it takes forever to walk around. Hang on.”\\n\\n He had a point. She stopped, leaning on her cane until she heard a smal vehicle whir up the passage and stop just behind her. It looked like a narrower version of a golf buggy. Richardson jumped down from the seat and held out his hand to help her climb on, a perfect little gentleman.\\n\\n “Thank you, Petty Officer,” she said, giving him a wink. “Now go and put a col ar and lead on Admiral Hood. We don’t want him getting into mischief, do we?”\\n\\n Richardson took the hint. She heard his boots fading behind her, listened to make sure he wasn’t warning the engineering crew that she was heading their way, and started the buggy. If she’d read the deck plan correctly, she was heading for the engineering section at the stern, in the opposite direction to the command bridge located amidships. The Huragok would be there and nobody was expecting her. Least of all Catherine Halsey. A scientist who didn’t exist on a ship that didn’t exist: Parangosky could keep Halsey declared dead and out of contact with al but Infinity’s handpicked crew for as long as she liked.\\n\\n Infinity had swal owed so much of the UNSC budget that Parangosky had to cooperate with Fleet and accept joint control. No wonder this ship cost so much. She could see it al around her. Every scrap of Forerunner technology that they’d recovered over the years had gone into Infinity. The ship should have been ready to deploy by now, but then something akin to a miracle had happened: Onyx had yielded a treasure trove of even more advanced Forerunner technology that the artificial world had held hidden.\\n\\n It made tolerating Halsey a few years longer worth the pain. No hijack and escape to Onyx—no game-changing refinements for Infinity, or the Huragok to instal and maintain them. The greatly improved drive speed and accuracy of slipspace navigation were just the first things plucked from the Dyson sphere’s cache. There was no tel ing what other tactical advantages were stil waiting for the Trevelyan crew to unearth.\\n\\n An excellent result. Just what we needed. But you’re still in permanent detention, Catherine. Because I say so.\\n\\n The buggy gave Parangosky her own unexpected tactical advantage. Nobody would hear her distinctive gait and the tap of her cane. She rode down the passage toward a faint glow of light, a little too much like a vision of fading, tunneled consciousness for her liking. She shook it off, daring death to interfere with her plans, then checked her datapad for the latest on Phil ips. Osman was on her way to Sanghelios; there was no official word from the Arbiter yet. Parangosky couldn’t simply cal him and ask if there was anything he wanted to tel her—not yet, anyway.\\n\\n My responsibility. My idea to co-opt Phillips for the mission. So now’s the time to see if it can actually present us with an opportunity.\\n\\n She drove past sealed doors and hatches bearing temporary warning signs like CABLING OUT and SAFETY GEAR MUST BE WORN. A ship in refit was a dangerous environment. The lights at the end of the passage gradual y resolved into detail, picking out long horizontal runs of titanium conduit. Then she caught a glimpse of something delicate, translucent, shimmering with points of soft lilac and rose lights, floating away in an instant like an apparition.\\n\\n As hard-hats went, Huragok were extraordinarily pretty.\\n\\n Parangosky slowed down. As she reached the next deck flat, a square-shouldered figure appeared silhouetted in the brightly lit doorway ahead.\\n\\n A couple of crewmen walked across from an adjacent compartment and squeezed past him with a cursory glance. He wasn’t their focus.\\n\\n And that tells me everything. Not that I didn’t already know.\\n\\n “Ma’am, you should have cal ed ahead.” It was Andrew Del Rio, wearing his captain’s best blues. He wasn’t a sleeves-up kind of CO. “I’ve got coffee and cakes laid on for you on the command bridge.”\\n\\n Del Rio wasn’t her choice of captain for Infinity. She’d learned to pick her battles and had conceded that one, but she felt vindicated by observing his crew’s body language. He was just something fil ing the uniform, a manager rather than a leader. They weren’t in awe of him and they weren’t devoted to him. She could tel . She’d seen the way crews looked at charismatic commanders, a real snap-to-it kind of wil ingness to please, very aware of the man—or woman—when they were around. Del Rio would be obeyed, and perhaps even respected for his fairness, but he would never be loved or gladly died for. He didn’t have the Nelson touch.\\n\\n But that was fine by her. His first officer was Lasky. Tom Lasky deserved better than to play bagman to Del Rio, but this was where Parangosky needed him to be, and XOs had control over the things that most concerned her. She’d see that Lasky got a reward for his quiet patience later.\\n\\n “I know I’m not where I should be,” Parangosky said, easing herself off the buggy. Del Rio didn’t rush to help her. She wondered if it hadn’t even crossed his mind or if he was too scared of her to remind her she was old and final y wearing out. “I’ve come to see our little friends. How are they doing?”\\n\\n “Breeding, ma’am.” Del Rio stood back and ushered her into one of the engine management compartments. “We’ve got three more. Yes, I know they don’t breed in the technical sense, but they certainly replicate and teach the offspring.”\\n\\n “Wel , it’s definitely a happy event.” Huragok shared al their information, whether by contact or by creating progeny. “A synthesis of al the technical expertise of the Covenant and the Forerunners. I’d cal that an edge and a half.”\\n\\n Parangosky counted seven Huragok drifting around the compartment, al utterly absorbed with modifying the controls. Their tentacles fascinated her. The tiny cilia on the tips were a blur as they worked, like flagel a on microscopic protozoa. The panel they were working on changed right before her eyes, rebuilt molecule by molecule at astonishing speed. Infinity might have been the most advanced warship since the Forerunner fleet, but these oddly endearing organic computers were ONI’s real prize. One of them—Requires Adjustment, nicknamed Adj by BB—had been snatched from Covenant service. The others were straight from the Dyson sphere, repositories of the original Forerunner technology and cut off from al external contact for mil ennia, and the Covenant certainly didn’t have anything like that.\\n\\n Now we can crush the Sangheili. And they’ll stay crushed.\\n\\n It was hard to tel one Huragok from another. Parangosky approached the creature closest to her, unsure whether to reach out and touch it to get its attention. In some ways they were like autistic children fixated on their task, but she’d had glimpses into their personalities. They could be gently but stubbornly assertive. Gossip originating from the Spartan-IIIs said that back in the Dyson sphere, one had actual y smacked Halsey for interfering with his work. Parangosky knew that urge only too wel .\\n\\n She held up her datapad so that the Huragok nearest to her could see the screen. The creatures used sign language. So she would, too.\\n\\n Courtesy cost nothing but bought a great deal.\\n\\n “Are you Perfect Density?” she asked.\\n\\n Her screen translated the words into a flurry of tentacle gestures, courtesy of custom-made software from BB. The Huragok turned its little multi- eyed armadil o head to peer at her, then gestured back.\\n\\n \u003c I am Adj,\u003e he signed. The words were relayed to her as audio. \u003c And I hear and understand your language, even if you cannot speak mine.\u003e Parangosky lowered her datapad. So he thought of himself as Adj now. Del Rio watched, arms folded, then seemed distracted by something at the other end of the compartment. Parangosky kept one eye on him as he walked over to a hatch in the deck and peered down.\\n\\n “My apologies, Adj,” she said. In her peripheral vision, she watched Lasky climb up from the hatch on the far side of the compartment to join Del Rio. “How are you?”\\n\\n \u003c I am very content, \u003e Adj signed. \u003c I have new knowledge and great purpose. Where is BB? Where are the marines?\u003e It was an interesting question. “They’re al on a mission. Do you miss them?”\\n\\n \u003c There was much I could have done for their ship. All left undone.\u003e Yes, in his obsessive Huragok way, he missed them. Adj would have been a useful resource for Osman. One day, we’ll have Huragok in every ship. And then we’ll end up putting explosive collars on them just like the Brutes did, in case they fall into enemy hands. They still lose. Del Rio could probably spare a couple of his Huragok for Osman in due course. Parangosky would see to it.\\n\\n “Perhaps we can arrange for you to finish that one day, Adj,” she said.\\n\\n \u003c I would like that. \u003e “So what have you done with our lovely new ship?”\\n\\n \u003c Improved her slipspace capability. Much faster. Much more accurate insertion into normal space. Next we shall work on communications, so that you can maintain contact from slipspace. \u003e “No need to drop out of slip to send signals? How do you do that?”\\n\\n \u003c By using the—of the—field to bypass—and make—. \u003e Some of the words had defeated the translation software, leaving gaps as if profanities were being bleeped out. Parangosky found the idea of a Huragok swearing a blue streak wonderful y appealing.\\n\\n Lasky caught her eye. “They have physics concepts we don’t yet have language for, ma’am. We’re the dim kids at the back of the class.”\\n\\n “Does Halsey understand what they’re doing?”\\n\\n “No, and it’s real y getting to her.”\\n\\n Parangosky was equal y wary of anything she couldn’t see for herself, but she’d taken far more than that on faith before. At least Huragok had transparent motives. The Forerunners had created them with one overwhelming passion: to make things that worked and to constantly improve them. That was good enough for Parangosky. They weren’t going to misuse the budget, break the law, and be a constant pain in the ass like Halsey.\\n\\n “I’m very pleased with your progress. Thank you, Adj.” Parangosky gave Del Rio a pointed look. “And Andrew’s very pleased, too. Aren’t you, Andrew?”\\n\\n Del Rio’s expression was unreadable for a moment. He seemed to have noted the eye contact between her and Lasky. “They’re doing a fine job, ma’am. And we take very good care of them.”\\n\\n Parangosky risked patting Adj on one of his arms, found it smooth and cool, and walked over to Lasky with her hand held out for shaking. You’re my anointed on this tub, Tom. Remember that. Lasky took it with a smile—a wholesomely good-looking man, easy to like, easier stil to trust—and nodded in the direction of the other Huragok, drifting around a terminal with their tentacles working like crazed concert pianists. \\n\\n","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-5.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: Halo: The Thursday War (Halo #10) \\n Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.\\n","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
