{"id":97972,"no":54,"title":"Page 54","content":"The elder lowered his voice, al calm certainty. “Then you must have your vengeance. Before Sanghelios has its own.” “I shal .” If only there real y was an avenging god who could come and erase humanity from the galaxy. Jul would gladly have become a monk if that kind of miracle could be persuaded to happen. Raia’s gone. Raia’s dead. What will I do without her? He felt his hands shaking. The shock wasn’t receding but getting worse, and he had to remain calm. If the situation had been reversed, Raia would have been in control of herself and thinking only of the clan, however much she grieved. She thought I was a fool to follow ‘Telcam. She was right. I’m so sorry, Raia. His sons would be distraught. He couldn’t even go to comfort them. He got up and walked to the door, desperate to be alone for a moment or two. “I must get some air, Kaidon,” he said. “Forgive me. I’l be back when my head has cleared.” Jul stil had no faith in gods, but Forerunner ruins always seemed to be the best places for private contemplation. It was the habit and indoctrination of childhood, he knew, but that didn’t make them any less comforting. He walked back out across the fields and sat down again in the shade of the stone wal s where he’d made his undignified entrance from the unstable portal. He leaned back against the blocks, staring at the horizon but not real y taking it in. There was a real pain in his chest, no il usion. Grief hurt. It would only get worse, too. She’s gone. It’s not fair. She did nothing to deserve it. It was another reason not to believe in gods. Either they let terrible things happen, or they were so cal ous that they cared nothing for creatures they created. He refused to worship them. Now he wanted them to exist, though, simply to scream his pain and outrage at them. It wasn’t going to happen. He sat there for a long time, watching the shadows slowly track across the grass, going through an agonizing and unending loop of realizing Raia was gone forever, as if he forgot the terrible news one second and then remembered it afresh the next. He wanted it to stop. Eventual y he found himself looking at the symbols carved into the wal s. It was a strange time to find that he was starting to recognize Forerunner symbols a lot more easily. There it was: there was the symbol for the Didact, just like the one on his belt, and there was the symbol for Requiem. He spent a few minutes trying to match the symbols scratched into the leather with the carvings on the stone. You were right about the humans, Didact. It’s a pity you aren’t around now to help Sanghelios. Jul tried to recal what he could of Onyx, the place where the Forerunners had managed to make time pass at the precise pace that they wished, defying creation. He almost wished he’d had more time to work on Prone and tease more information out of him. There were military advantages in Onyx, technology that Sanghelios needed, but the humans had laid claim to it first. No matter: he would find a way to destroy them, or die in the attempt, and both options seemed the same to him at that moment. He ran his fingertips over the stone, trying to find distraction or focus in the symbols so that he could snap out of this fog of grief and do something. Eventual y he realized someone was watching him. It was Ilic, the young lad. Jul stared at him. The youngster edged forward. “The kaidon sent me to see that you were al right,” Ilic said. “I shal be,” Jul said. “Thank you.” “Are you praying?” “I’m looking for answers.” “You can read the language of the gods.” Ilic tilted his head, and Jul realized he was fascinated by the belt. “You write it, too. That’s the symbol for the holy warrior who’l return one day to save us.” He was pointing at the Didact symbol. “The Didact,” Jul said. “Not even the Huragok were al owed to know where he went.” Jul was about to point out that he would be long dead now, but this wasn’t the time to crush any more hopes. “He despised humanity, as should we al .” Jul took off his belt and laid it across his knees. Ilic sat down beside him and tried to read the other symbols gouged into the leather. They looked like the scrawling of an infant to Jul now. He placed his hand on the symbol for the Didact’s name, and tried to think beyond the pain that was gradual y setting his chest as hard as mortar. “Is it true that you came from a shield world, and that those living there have survived since the gods went away?” Ilic asked. “That’s a very long time.” Jul nodded. “The Forerunners could manipulate the—they are the masters of time.” Jul managed to stay in character. His own restraint amazed him. Talking to this child felt like a rehearsal for the conversation he might one day have to have with his own sons. “I saw it with my own eyes.” “And what’s this symbol?” “It’s a place. It’s cal ed Requiem. But I don’t know where it is. Nobody does.” “Why?” “Because the Didact went there, and for some reason the gods wanted it to be kept hidden.” Ilic considered the symbols for a long time, frowning. He was much younger than Jul had first thought. He was also terribly serious. He’d grow up to be a kaidon, that much was obvious: some children had their destiny written on them from the day they were born. “Would you like to see the other holy gate?” For a moment, Ilic sounded rather like Prone to Drift, trying to keep Jul’s interest piqued during his exile by showing him the sites. “The symbols are there, too. Some are missing, though.” Jul swal owed and concentrated on standing up. If he made his body act, then his mind would fol ow. It felt like he was turning his back on his grief and not mourning properly, but he could hear Raia now as clearly as he had in life: Don’t submit to things, Jul, change them, take action. He got up. It didn’t relieve the weight in his chest or ease the misery, but he felt that he was at least doing something. “Show me,” he said. He fol owed Ilic back toward the keep and through a smal thicket. In the middle, a sad and crumbling wal stood alone with the remains of its three brothers scattered around it as rubble. “There,” Ilic said. He tugged at Jul’s belt, quite a courageous act for a smal child, and pointed up. “Some of it matches your belt.” Jul took a few moments to see what he meant. There was a row of symbols at about eye height—adult height—and they looked familiar. Jul took off the belt and held it up against the wal , aligning the symbols as best he could. He’d simply copied what he’d seen on the wal back in Onyx- Trevelyan to help him find his way back in the maze of tunnels. The scale of the symbols wasn’t the same as his handwritten ones, but he could see that it was effectively the same sentence, if a sentence was what it was. But the wal was damaged. Two of the carved symbols had long since crumbled away. Jul wondered if it was too much to assume that they would have been the same ones as on his belt, three scratched ideograms on the section of leather that held his holster. He looked around to see if the pattern repeated anywhere else, but there was nothing. “The bits that are missing probably looked like my belt, then,” he said. “What’s the line below?” “I think they’re numbers. Holy numbers.” Jul didn’t believe in divine hands shaping his life, but he did believe in the Forerunner gift for thorough records, and their astonishing technical skil . Numbers. What if this was a set of coordinates, like the engraved stone on Onyx? Jul held the belt against the wal again and slid it from side to side to realign the symbols. Didact: yes, that matched. Requiem: yes, that matched, too. On the line below that, though, none of the symbols looked familiar at al . New data. Or just my ignorance. But new data … They said the eye could recognize patterns even if the brain didn’t understand them, that it could see tiny differences in pictures—symbols—even if they made no sense as words, and recal them. His stomach knotted. This was insane. It was his grief fooling him, making him clutch at stupid, superstitious ideas rather than face the reality of what was happening to him. “Ilic,” Jul said. “Fetch Panom.” Ilic ran off. Jul was left alone with nothing in his mind now but the bad news churning over and over, threatening to drown him. I’m sorry, Raia. I’m so sorry. Yes, it was insane. At that moment, insanity was al he was, insanity and instinct. Requiem, Didact, numbers. Perhaps this was the information the Forerunners wouldn’t give the Huragok. It had to be recorded somewhere. And why did the portal bring him here? Had it routed to another Forerunner garrison, one that was off-limits? No, this was getting ridiculous. Even if this helped him locate Requiem, the Forerunners were long gone. Their technology might stil be there, though. Requiem might contain another cache like the one the humans had claimed. He almost didn’t hear Panom come up behind him. It was only when the kaidon trod on some twigs right next to him that he turned around. Jul steeled himself to look composed. He held his belt up to the symbols again for the old man’s benefit. “Look,” he said. “Are these the missing symbols?” Panom opened his jaws to speak but then he stopped dead. He leaned into the wal , not looking along the horizontal width of the belt but up and down, at what was below it. Ilic studied the symbols, too. “What is it?” Jul asked. “What do the numbers tel you?” Panom had the most extraordinary expression on his face. Jul wasn’t sure if he was shocked or ecstatic. “They are coordinates,” Panom said. “This adds greatly to our knowledge. We seek to record al the holy sites, but some remain hidden from us.” “And which one is this?” Jul slid the belt back and forth again. “Which world?” “I’m not sure.” Jul felt possessed by sudden certainty. Part of him knew it was manic behavior brought on by the shock of Raia’s death, but he was prepared to grasp at anything now, and even an animal—even a human—could understand things at an unthinking, instinctive level beyond their conscious mind. This compulsion felt exactly like that. “I think this tel s us where Requiem is,” Jul said. “Requiem. ” He groped for the right words that would galvanize Panom. Hidden Forerunner technology was now the best hope that Sanghelios had to crush humanity, and Jul was determined to seek it out. He’d need Panom’s help to do that. These people were the only ones he could truly trust. “Don’t you see it? Requiem. That’s where the Didact was hidden. That’s where they say he waits.” Panom took a couple of shaky steps backward. “This is why you were sent,” he said. “Now I understand.” “What?” “The gods sent you where you didn’t expect to be. They don’t make mistakes. They sent you because you had information we need—that Sanghelios needs. You know where the Didact is. Do you not see the answer to prayers in there?” Is this true, Raia? Where are you now? Are you looking down at me now, knowing what I can’t see? Tell me. Tell me what I have to do. I’ll do it. I’ll do it for you. Jul didn’t dare slap Panom down with cold rationality, not when he himself was talking to a dead woman. Al things were possible. He and the Panom keep had common cause now, so their private motivation was irrelevant. “You believe this, Elder? Truly?” “You said it yourself. You’ve come from a world where time was held frozen by the gods for mil ennia. The Didact awaits us.” “This is the hour of our greatest need, Elder Panom,” Jul said. I have to do this. I have to at least follow the path that’s being laid in front of me. He touched his fingertip to the numerical symbols. “We must find Requiem. This is where I believe it to be.” “This is a long way to travel. We have poor ships.” “Then we’l get better ones. I don’t think the gods would let us down now, do you?” Panom nodded, the speed of the nod increasing as the glorious plan seemed to form in his mind. “Yes, let it be so,” he said. “We wil seek the Didact, and ask for his help to cleanse the galaxy of humanity. You are blessed, brother. You have a special cal ing.” Jul hoped the help was planet-crushing weaponry and obedient Huragok caretakers, but if the Didact was real y waiting, that would be fine, too. Raia. Vengeance—mostly for Raia, partly for Sanghelios—would be Jul’s food, air, and water from now on. Epilogue Uncle Naxan says my mother is dead. And I must not cry. She died as heroically as any warrior. She went into battle armed, seeking Elder Jul ‘Mdama, but Naxan can’t—or won’t—tell me more than that. Perhaps he knows no more, or he fears the truth will either upset me or make me so angry that I lose my reason. Whatever the truth of it, Naxan is now elder of Bekan keep, there will be more civil war, and I must grow up faster now. I must train harder and study more. My brother Asum has gone off into the fields, probably to cry where nobody can see him. I shall cry, but not until I kill those who killed my mother. It might not be the humans, but I shall kill them anyway because they threaten Sanghelios and support the Arbiter, and I shall kill whichever Sangheili was responsible as well, because species does not make a man a true brother. And when I have done that, I shall carve my mother’s story into the saga wall of our keep, as a warrior deserves. Yes, I can wait to shed my tears. I can wait as long as it takes. (DURAL ‘MDAMA, SON OF RAIA ‘MDAMA)","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-54.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: Halo: The Thursday War (Halo #10) Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
