{"id":97926,"no":7,"title":"Page 7","content":"Jul had almost forgotten about the guard standing in front of the door. For a moment he glanced at the man and noted that he seemed oblivious of the conversation going on at the table, just staring at a point somewhere on the wal facing him. Then he touched his finger to his ear. Jul realized he was listening to something on his radio receiver. The guard moved up behind Magnusson, tapped her on the shoulder, and motioned to her to switch off her translation device. She nodded, and spoke with him in quiet English words that Jul couldn’t fol ow, except for two: Sanghelios, whose meaning was clear, and hinge-heads, which he recognized but stil didn’t understand. Whatever the guard had told her had made her smile. For a few moments, she twiddled a stylus between her fingers, reading the papers laid out on the table in front of her, and then touched the translation device again. “Things are getting quite tense on Sanghelios,” she said. “There’s been a bomb attack in one of your cities and reports of Jiralhanae attacking Sangheili. I thought that might cheer you up, seeing as you’ve been planning a revolt.” So ‘Telcam had made his move. Jul’s first thought was worry for Raia, and his second was frustration that he wasn’t there to fight. “As I said, ‘Vadam wil be overthrown.” “I should hope so,” Magnusson said. “It’s costing us a fortune to arm your insurrection. Yes, your friend ‘Telcam knows he’s being bankrol ed by ONI. Stil , we did get a Huragok out of it.” So I was right—at least partly. Jul had seen the female shipmaster, the one they cal ed Osman, delivering arms to ‘Telcam. But he hadn’t realized the monk had known exactly who he was dealing with. Jul had been so sure that ‘Telcam was being duped. How could a fanatical member of the Abiding Truth strike a deal with the enemy? Everybody seemed to be abandoning their senses. “What did he offer you in exchange?” Jul asked. “We agreed to stay out of each other’s keeps, so to speak. We help ‘Telcam remove the Arbiter and set up a religious state—you agree to stay away from human territory.” Magnusson was stil fidgeting with that stylus, twirling it slowly between her thin, wormlike little human fingers. “But it’s capability that counts, not intent. I’m afraid we have to make sure you can never threaten us again, no matter how many assurances you give us. We’re rather unforgiving when it comes to attempted genocide.” Jul should have known better than to expect anything else from humans. They were incapable of giving up their expansionist habits. The Arbiter was a fool, as Jul suspected, and thought he could trust them when they said things would be different. This was exactly what had made Jul join the coup against him. “We should have wiped you out,” Jul said. “We could never coexist in one galaxy.” “But you never got the chance.” Magnusson did one of those tight smiles, the one that showed no fangs but oozed contempt. “Nor wil you ever get one again. I agree with you—one of us has got to go, and my job is to make sure it’s not us.” “You’ve lost hundreds of warships. You can’t possibly threaten Sanghelios.” “Oh, come now, Jul. You know it won’t be that old-fashioned. You’re already sliding into civil war for the second time in a year. And we’re ONI. We do things differently to Admiral Hood. None of that Nelsonian square-jawed stuff. ” The translation software didn’t manage to interpret the last few words. Jul heard only the English. Magnusson pushed back from the table and got up to wander around the room. What could he possibly do for her that was of any use? Unless this was al a bluff, unless the humans had no intel igence or functioning warships, then al Jul knew was what ONI seemed to know already. In fact, they knew more than he did. For a moment he found himself distracted by the idea that the Forerunners could have built stars. That dwarfed the technology of the Halo Array. Mil ennia later, no civilization had even come close to that. What else had these not-gods been able to do? “I don’t like the food here,” he said, changing the subject. “It upsets my digestion.” “The more you tel us about your native foods, the more I’l be able to get supplies that suit you. I thought you were satisfied with the meat.” “I am. But the grain gives me gas.” “Wheat, you mean.” “Yes. The grain the Kig-Yar grow—that’s a Sangheili crop. Can you not acquire some of that?” Magnusson smiled again and sat down. “I never saw you people as farmers.” “We’re not. The San’Shyuum kept us supplied, and what farms we stil had were maintained by alien labor.” “So you’re having to learn to take care of yourselves again. No hired help in the fields. No Huragok to build and repair machines for you.” Jul felt a little mocked. “We are, and we are succeeding,” he said, indignant. Could this creature survive without the trappings of technology she didn’t understand? “And my wife believes self-reliance is the key to regaining our military greatness.” Magnusson just nodded. “We’l find some of that grain for you. What’s it cal ed?” “The Kig-Yar name is irukan. ” She pressed the end of her stylus, making it click, and pushed it across the table to him with a sheet of paper. “Give me a shopping list. ” Again the translation failed. “Write down a list of common foods. I’l do what I can.” Jul fumbled with the stylus. It was short and slender, far too smal for Sangheili hands. Eventual y he managed to grip it like a dagger and held the paper steady with his free hand while he scrawled unsteady ideograms. It looked like a child’s first efforts, and he was embarrassed. Perhaps Magnusson didn’t know what passed for neat handwriting in an alien system. He pushed the paper back across the desk to her and watched her frowning at the shapes, eyes scanning. “These are al staples, are they?” she asked. “Anything exotic?” “No. Just basic grains and fruits.” “What do you feed your livestock?” She was trying to be sociable by chatting about irrelevant nonsense to him. Humans always assumed other species shared their social conventions. “The same grain,” Jul said, wishing she would get to the point and simply threaten him. “I’m trying to keep this simple for you.” Magnusson folded the paper and put it in her pocket. “Do you have children?” “Of course.” “They’l be missing you.” “No. They won’t. No Sangheili is al owed to know who his father is.” “I’d heard that. So it’s true.” “Yes.” “But you miss them. You know who they are, I assume. If someone didn’t manage the bloodlines, you’d be very inbred.” “I have not spent enough time with them to miss them. Nor been parted from them long enough.” If she thought she could put pressure on him that way, then she had more to learn about Sangheili than he’d thought. “Now, either tel me what you want from me, or leave me in peace.” Magnusson didn’t appear offended. Jul knew what to watch for in human faces now. They were a mass of signals, and al could be learned. She looked over her shoulder at the guard, then stood up, col ecting the files and sheets of paper again, and Jul wondered why she’d brought them with her if she’d decided not to make use of them. I must learn to read their language. That’s essential if I’m to get out of here. Escape had to be his sole focus now. He’d take everything else as it came. His next step would be to work out the geography—to understand where he was and what other facilities were here. He got up and went over to the window again, watching for signs of activity. The land outside was rol ing grassland, but new low-rise prefabricated buildings were springing up, and he could hear the occasional hum of vehicles. The humans were making Trevelyan their own. He heard the door open behind him. He didn’t turn. “Actual y, Jul, the most useful thing you can do for me right now is just to be yourself,” Magnusson said. “You don’t have to tel me anything, although it would be great if you had jamming frequencies for Sangheili air defenses and the command codes. But we’ve got Huragok who can deal with al that. We’ve even got some that the Forerunners left here to look after the place. Imagine it, knowledge from the time of the gods.” The door closed again and Jul tried to make sense of the encounter. Magnusson was working up to something, or perhaps she was simply not very good at her job. Humans didn’t kil incompetent inferiors, so they multiplied. It was a miracle that they could achieve so much. But they had Huragok now. They could be as stupid and lazy as they wished, and stil have the military advantage over Sanghelios. Huragok left here by the Forerunners. A race that could build stars. That kind of knowledge is too dangerous to fall into human hands. Jul didn’t believe in divine plans, but he did believe in seizing advantages. Who was best placed to stop humans exploiting the Huragok to wipe out the Sangheili? It was him. He was here. He was in the heart of the enemy camp, breathing their air, knowing their intent—and their capability. In fact, he was in the very best place that a warrior could be to save his people. His plans needed to change a little. He would start with the Huragok. ADMIRALS’ INSPECTION, UNSC INFINITY: COMMAND BRIDGE There were already three hundred personnel working in Infinity, and stil she felt like a ghost ship. Parangosky thought of al the families back home who never asked where their loved ones had been for the past six months. They’d learned not to. Many of the crew didn’t have families, of course. They were from colony worlds now wiped off the charts, reduced to glass. And we’ll never let that happen again. We’ll reclaim those worlds. And we’ll hold them. She reached for a pastry, watching Hood having one of those very quiet, nose-to-nose boys’ chats with Del Rio. She kept an eye on the officers coming and going, too. It was a very junior staff considering that this was the UNSC’s flagship. Parangosky racked her brains to think of any of Del Rio’s key officers other than Lasky who were above the rank of lieutenant, and came up empty. Rank wasn’t any gauge of effectiveness or combat experience, though. It told her more about bottlenecks in the rank structure and the lack of ships to promote people to than the caliber of the crews. That, and the sheer number of people we lost. Parangosky felt bul ish rather than defiant for the first time in years. The scent of new upholstery, adhesive, and that hot radiator smel of components being run up to operating temperature for the first time was a fragrance she wished she could bottle. It had been a very long time indeed since she’d served in a warship. She recal ed her first ship as if it was last week. UNSC Lutyens. Broke my heart when she went for scrap. You could truly love a ship. She was glad she hadn’t forgotten how that felt. But she was here to work, to evaluate, to spot the cracks, and she was letting nostalgia and sugar get the better of her. Her datapad vibrated gently in her pocket. There was only one cal er it could be. “What have you got for me, BB?” It was the AI’s fragment in the Bravo-6 system, not his matrix. “We’ve now had contact from the Arbiter—he’s sent a message to Hood’s office that the official escort has misplaced Phil ips. I just happened to fal over it before it was read.” “Wel done. Stil no sign of him or your other fragment, then.” “No, and the explosion was linked to an attack in Ontom by Jiralhanae stil working on Sanghelios. We didn’t see that one coming.” “Thank you for the heads-up, BB. I may have to get things moving myself. Stand by.” Parangosky realized this was rapidly adding up to a dead operative. Much as she liked Phil ips, his death would be marginal y easier to handle from a political perspective than his capture. But she had to be sure. She needed confirmation, and not from the Sangheili. I’m betting Kilo-Five could infiltrate Sanghelios. I’d lose some of them, though, and it’d be politically messy for everyone. On the other hand … I could play this straight, and use the leverage I’ve already got. The mission—destabilizing Sanghelios—came first. There were many ways to skin that proverbial cat. Hood could do what he seemed to do best: dealing man to man, handshake to handshake, with Thel ‘Vadam, the Arbiter. She drained her coffee and made a beeline for Hood. Del Rio saw her coming and melted away. “I think I’m final y enjoying my Medusa reputation,” she said, forcing a laugh out of Hood. “Women normal y become invisible to men at the age of forty. But he can obviously stil see me.” “Yes, I warned him not to look directly at you, merely to gaze on your reflection for his own safety.” Even Hood’s sarcasm was gracious. Parangosky stil liked him, for al his excessive optimism. “You real y don’t care for the cut of his jib, do you, Margaret?” “No, I do not.” “He’s a safe pair of hands. We won’t get any surprises from him. And he’s Halsey-proof. She won’t be able to manipulate him.” Parangosky kept walking. “You don’t have to sel him to me any longer. He already has the ship.” “And you have Lasky.” “And you’l need Lasky one day when Del Rio can’t politic his way out of a tight spot.” “Why do you always go for the straight-as-a-die, man-of-the-people types?” “Because they’re so unlike me, my dear. My morbid fascination with the exotic.” “So you feel you have your budget’s worth.” “I’m satisfied we’ve got a vessel that’l not only loosen Sangheili bowels, but that can also vaporize them.”","sourceLink":"https://allnovel.net/halo-the-thursday-war-halo-10/page-7.html","bookId":1640,"book":{"id":1640,"title":"Halo: The Thursday War (Halo #10)","description":"Storyline: Halo: The Thursday War (Halo #10) Welcome to humanity’s new war: silent, high stakes, and unseen. This is a life-or-death mission for ONI’s black-ops team, Kilo-Five, which is tasked with preventing the ruthless Elites, once the military leaders of the Covenant, from regrouping and threatening humankind again. What began as a routine dirty-tricks operation―keeping the Elites busy with their own insurrection―turns into a desperate bid to extract one member of Kilo-Five from the seething heart of an alien civil war. But troubles never come singly for Kilo-Five. Colonial terrorism is once again surfacing on one of the worlds that survived the war against the Covenant, and the man behind it is much more than just a name to Spartan-010. Meanwhile, the treasure trove of Forerunner technology recovered from the shield world of Onyx is being put to work while a kidnapped Elite plots vengeance on the humans he fears will bring his people to the brink of destruction.","cover":"https://allnovel.net/images/halo-the-thursday-war-halo-10.jpg","author":"Karen Traviss","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-thursday-war-halo-10.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:29:35 PM"}}
