{"id":89221,"no":18,"title":"Page 18","content":"Bryce checked the time and said, “We’ve got ten more minutes until one.”\n She tried to open the door to the inner office. It was locked.\n “Apparently he doesn’t want us rifling through his files,” she said.\n “We shouldn’t have to wait. This is outrageous,” Roger muttered. “This outfit isn’t going to be handling my share of the money, I promise you that.”\n “How much do you think there is?” Bryce asked.\n “Millions,” Roger answered.\n “That doesn’t answer the question. How many millions?” Ewan wanted to know.\n “I’m guessing sixty million,” Bryce said.\n “That’s a high estimate,” Ewan said.\n “Guessing is rather pointless,” Vanessa interjected.\n Ewan glared at her. “Why are you here?”\n “You two have never gotten along, have you?” Roger said. He sounded like he’d just figured that out.\n “That’s soft-pedaling the truth,” Ewan responded. “I detest her. Her holier-than-thou attitude. She’s a snob, and I have no use for her.”\n “The feeling’s mutual,” she responded.\n “I repeat, why are you here?” Ewan asked again.\n “Bryce and I both received letters.”\n “And you couldn’t ride with your husband?” he asked.\n “I had a meeting with the art council. It was cultural, so of course you wouldn’t understand.”\n Her condescension infuriated him. He turned to Bryce and said, “How in God’s name do you stand her?”\n Bryce smiled at his wife. “The question should be, how does she stand me?”\n “Oh, please. Your self-loathing became tiresome years ago,” Ewan scoffed.\n Vanessa was saved from having to listen to any more of Ewan’s sarcastic drivel when the door swung open and Anderson Smith, trailed by his assistant, swept into the room.\n The attorney’s manner was as smooth as alabaster. Without saying a word, he demanded attention, and he got it. He introduced himself and Terrance and shook hands with each one, starting with Vanessa.\n He was an older gentleman and quite charismatic. She watched him work his magic on the brothers and was both fascinated and amused, for they were suddenly all on their best behavior.\n Terrance unlocked the door, and one by one they filed into the inner sanctum.\n Roger spotted the video equipment and asked, “What’s all this for? Are we going to see a movie?”\n “I wouldn’t call it a movie,” Anderson responded. “Please make yourselves comfortable. We’ll begin in just a few minutes.”\n “Why can’t we start now?” Ewan asked.\n Anderson walked to the office door and was pulling it closed when he answered, “Not everyone is here yet.”\n Chapter Twenty-three\n Dylan made certain they weren’t being followed, and when they were closing in on Savannah, he left the highway and took less-traveled roads into the city.\n He got lost in no time at all, but because he was a Buchanan male, he wasn’t about to admit it or ask for directions. Kate was filling him in on some historical facts about Charleston’s sister city and wasn’t paying attention to the route he was taking.\n “Savannah’s called the jewel of the south,” she said. “But you probably already knew that.”\n “Uh-huh.”\n “Are you listening to me?”\n “Sure I am. You’re a jewel.”\n “No, Savannah’s the jewel.”\n “Yes,” he agreed. “But so are you, Pickle.”\n She gave up trying to educate him, picked up her BlackBerry, and checked for any new messages.\n Dylan still hadn’t gotten his bearings. He was certain he’d passed the very same park a couple of times now. He kept driving west. Several blocks later he stopped to let some jaywalkers cross in front of him and happened to look at the number on the door across the street.\n Son of a gun, they were exactly where they were supposed to be.\n The attorney’s office was on the perimeter of a large square that surrounded a shaded park. In the center was a monument to one of the South’s revered statesmen, who stood perched on a tall pedestal looking down on the sidewalks and park benches scattered about. Ancient oaks dripping with moss provided shade.\n All of the buildings butted up against one another and were once the grand homes of Savannah’s finest citizens. Some were still residences, but others had been renovated and converted and now fit into the urban mixture of offices and galleries and restaurants.\n Dylan got lucky again when a car pulled out of a prime parking spot near the corner. He backed into the space, put the car in park, and said, “All right.”\n “We’re here?” She looked startled.\n “Yes, we’re here,” he said. “We made good time.”\n She glanced at the digital clock on the dashboard. “We’re twenty minutes early.”\n “It’s closer to fifteen minutes.” He unsnapped his seat belt and tried to open the door.\n She grabbed his arm. “I don’t want to get there early.” She sounded apprehensive now.\n “Sure, okay. We won’t be early.” He reached for the door again.\n “Wait.”\n “Yes?”\n “Would you mind if I made a quick call first? I need to talk to Haley about ribbon. It won’t take long.”\n “No problem. While you’re doing that, I’ll check in with Nate.”\n Kate was suddenly feeling nervous. She couldn’t remember Haley’s phone number and had to look it up on her BlackBerry.\n Haley’s assistant answered and explained that she had left for a luncheon appointment. Kate left the message that she would be unavailable for a few hours but that she would call Haley later that afternoon.\n Dylan got hold of Nate right away. It was a one-sided conversation, and Kate had to wait until he’d flipped his cell phone closed to find out anything.\n “Did he have any news?” she asked.\n “Some.” He didn’t expound.\n Dylan got out of the car, grabbed his suit jacket from the backseat, and put it on so his gun would be concealed, then he went around the car and opened her door.\n He was acting like a bodyguard, she thought. He was watching the street when he said, “You stay close to me.” It wasn’t a suggestion but an order.\n “I plan to,” she said. She gathered her things, stuffed them into her purse, and took his hand.\n They crossed the street and walked around the corner. Kate did not want to think about where they were headed. The notion to bolt was gaining momentum. She needed to stall—to give herself a few minutes to gather her thoughts. She glanced at the park across the street and blurted out, “Look at the park. Isn’t it lovely? Did you know that there are over twenty squares in Savannah? All have parks in the center.” She stopped and said, “This one is my favorite.”\n Dylan seemed more interested in the people and the cars. He was subtle about it, but he was making certain that his body protected hers as they walked along.\n “Let’s go,” he said.\n She deliberately slowed the pace. “We’re building a park like that in Silver Springs.”\n He glanced over his shoulder, nodded, and said, “I noticed it on our way to the police station.”\n She walked even more slowly. “And we have three more in the works. They’re going to be interconnected when they’re finished. The buildings aren’t on this grand scale, of course.”\n Kate saw the door with the names Smith and Wesson engraved on a plaque directly ahead of her, and stopped. “Let’s go sit on the park bench for a little while.”\n “No.”\n “We still have fifteen minutes.”\n Dylan didn’t know what was going on in her mind, but he wasn’t about to stand on the sidewalk and argue with her. She obviously needed a few minutes to calm down, and then maybe she would tell him what was bothering her.\n “Okay, we won’t be early. We’ll find someplace to wait.”\n Relieved, she said, “Thank you.” She looked around and spotted a coffee shop catty-corner to the law firm. “Would you like to get some coffee? I’m sure they have iced tea, too.”\n A few minutes later they were seated at a tiny round table in the back of the coffee shop. There wasn’t any air-conditioning, and both front and back doors were wide open. Two ceiling fans were going full speed. Both made a clicking noise that sounded like fingers snapping.\n “It’s lunchtime,” she said. “We were lucky to get a table.”\n “It’s hot in here. That’s why we got a table. Look around. We’re the only ones here.”\n “We could find somewhere else if the heat bothers you.”\n “I’m good.”\n Kate waited until the waitress had left with their iced-tea orders to ask, “What did Nate have to say?”\n “They still can’t find Carl. The case is building against him.”\n “How so?”\n “He’s in trouble with the IRS.”\n “Are you serious?”\n “I never joke about the IRS. He’s in trouble,” he repeated.\n “What kind of trouble?”\n “Back taxes.”\n “But he’s . . .”\n “What?”\n “Rich. He inherited a fortune.”\n “If he did, he’s gone through it.”\n “I’m stunned.”\n “He never said anything to you about money worries?”\n “Good heavens, no. Carl is every inch the southern gentleman,” she explained. “And southern gentlemen never ever discuss money problems. It would be . . . unseemly.”\n “Is that part of the southern gentleman code?”\n He was teasing, but she was serious when she answered. “Yes, it is. Being a gentleman is serious business here.”\n The waitress had eyes for Dylan only as she placed the iced tea on the table. Kate thanked her anyway, took a sip of the cold drink, and said, “I can’t figure this out. Poor Carl, bless his heart. He’s always trying to help others.”\n “How does he help?”\n “He gives lavish parties to promote the arts. And he’s helped promote my company, too.”\n “He asked you to bring those gift baskets to his party, didn’t he?”\n “Yes, he did. He thought it would be good promotion. Oh, I see that look in your eyes. Dylan, Carl was trying to help. I’m telling you, he’s a good man. He wanted to buy into my company. I’m sure he thought I needed financial assistance, and of course he couldn’t talk about it . . . so he offered to be a partner. If he had such terrible money problems, where would he get the money to help me?”\n “When did he try to buy into your company? For God’s sake, Kate, why didn’t you tell me this?”\n “I didn’t think it was relevant.”\n “When?” he repeated.\n “Over a year ago.”\n Dylan checked the time, pulled his wallet out, and put money on the table. “Drink up. We have to get going.”\n “We’ve still got time,” she said. “What else did Nate tell you?”\n “He’s doing a background check on your relatives, and I had hoped he’d have something for me by now.”\n “But no such luck?”\n “Not yet. He got pulled into a meeting, but he has people working on it.”\n “We’ll be finding out about them soon enough.” Too soon, she thought. Why, oh, why had she agreed to come to Savannah? Guilt, she decided. Isabel and Kiera had guilted her into coming.\n “I don’t like walking in blind. I want to know what I’m dealing with. You understand?”\n Oh, boy, did she. “Yes.”\n “You’re dreading it.”\n “Yes, I am.”\n “Why?” And when she didn’t immediately answer, he asked, “Why are you so worried?”\n “I’m not worried,” she said. “I just hope . . .”\n “Yes?”\n She guessed there really wasn’t any reason not to tell him. He already knew about her financial situation and her mother’s devastating business and personal decisions. “I hope this meeting isn’t another surprise my mother left behind. I don’t think I could take another . . . disappointment.”\n “Why do you think that’s a possibility? Seems pretty remote to me. You told me your mother never mentioned her husband’s relatives,” he reminded her.\n “The letter . . . by special messenger . . . it started me thinking. Mother might have borrowed money from this uncle and now the estate wants it paid back.”\n He looked at her a long minute and then asked, “How long are you going to stay mad at her?”\n “I’m not mad. I’m disappointed.”\n “Yeah, right.”\n She bristled. “I’m telling you the truth.”\n “No, you’re not. I guess you’re just not ready to say it, so how about I say it for you? You’re furious with her.”\n Her spine stiffened. The defiance didn’t last long. Tears sprang into her eyes, and she couldn’t stop them. She’d already cried in front of him once; she wasn’t about to do it again.\n “Yes, I’m angry,” she said, her voice shaking. “She lied about everything, and she left a mess.”\n He put his hand on top of hers. “Ah, Katie. It’s not about the money.”\n She pulled her hand away. “Oh? Then what is it about?”\n “Your mother got sick, and she died, and no matter how hard you tried, you couldn’t stop it from happening.”\n “That doesn’t make sense.”\n “No, it doesn’t,” he agreed, and stood. “So maybe you ought to think about forgiving her.”\n She wanted to argue, to tell him his amateur analysis was way off, but something stopped her. What if there was a germ of truth in what he was saying? Was she using anger to shield herself from the pain of losing her mother?\n He pulled her to her feet. “Come on, Pickle. Time to meet the relatives.”\n Chapter Twenty-four\n The law firm of Smith and Wesson and Associates resided in an early-nineteenth-century, three-story home that had been transformed into offices but had kept its antebellum elegance.\n The lobby was wide, and the eye was immediately drawn to the colorful mosaic design on the tiled floor. A grand staircase in the center led up to an open balcony that surrounded the lobby and was supported by white Doric columns. \n","sourceLink":"https://allnovel.net/slow-burn-buchanan-renard-5/page-18.html","bookId":1832,"book":{"id":1832,"title":"Slow Burn (Buchanan-Renard #5)","description":"Storyline: \n Every fire begins with a little heat–and in Slow Burn, bestselling author Julie Garwood provides the spark, skillfully blending pulse-pounding action, intense emotion, and characters with grit and heart. The result is an electrifying novel of romantic suspense that will have readers burning through the pages. \n An unpretentious beauty who radiates kindness, Kate MacKenna doesn’t have a bad bone in her body–or an enemy in the world. So why are bombs igniting everywhere she goes? The first explosion brings her face-to-face with a handsome Charleston police detective. The second sends her into the arms of her best friend’s brother–a Boston cop who’s a little too reckless and way too charming for comfort. But Dylan Buchanan won’t let emotion prevent him from doing his job: Someone is trying to kill Kate, and Dylan is the only one standing between her and the monster who wants her dead.\n \n","cover":"https://allnovel.net/images/slow-burn-buchanan-renard-5.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/slow-burn-buchanan-renard-5.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:33:07 PM"}}
