{"id":6572,"no":8,"title":"Chapter 7","content":"It is some time since I receiv\u0027d the above letters, but I have been too busy till now to think of complying with the request they contain. It might, too, be much better done if I were at home among my papers, which would aid my memory, and help to ascertain dates; but my return being uncertain and having just now a little leisure, I will endeavor to recollect and write what I can; if I live to get home, it may there be corrected and improv\u0027d. \\n\\n Not having any copy here of what is already written, I know not whether an account is given of the means I used to establish the Philadelphia public library, which, from a small beginning, is now become so considerable, though I remember to have come down to near the time of that transaction (1730). I will therefore begin here with an account of it, which may be struck out if found to have been already given. \\n\\n At the time I establish\u0027d myself in Pennsylvania, there was not a good bookseller\u0027s shop in any of the colonies to the southward of Boston. In New York and Philad\u0027a the printers were indeed stationers; they sold only paper, etc., almanacs, ballads, and a few common school-books. Those who lov\u0027d reading were oblig\u0027d to send for their books from England; the members of the Junto had each a few. We had left the alehouse, where we first met, and hired a room to hold our club in. I propos\u0027d that we should all of us bring our books to that room, where they would not only be ready to consult in our conferences, but become a common benefit, each of us being at liberty to borrow such as he wish\u0027d to read at home. This was accordingly done, and for some time contented us. \\n\\n Finding the advantage of this little collection, I propos\u0027d to render the benefit from books more common, by commencing a public subscription library. I drew a sketch of the plan and rules that would be necessary, and got a skilful conveyancer, Mr. Charles Brockden, to put the whole in form of articles of agreement to be subscribed, by which each subscriber engag\u0027d to pay a certain sum down for the first purchase of books, and an annual contribution for increasing them. So few were the readers at that time in Philadelphia, and the majority of us so poor, that I was not able, with great industry, to find more than fifty persons, mostly young tradesmen, willing to pay down for this purpose forty shillings each, and ten shillings per annum. On this little fund we began. The books were imported; the library wag opened one day in the week for lending to the subscribers, on their promissory notes to pay double the value if not duly returned. The institution soon manifested its utility, was imitated by other towns, and in other provinces. The libraries were augmented by donations; reading became fashionable; and our people, having no publick amusements to divert their attention from study, became better acquainted with books, and in a few years were observ\u0027d by strangers to be better instructed and more intelligent than people of the same rank generally are in other countries. \\n\\n When we were about to sign the above-mentioned articles, which were to be binding upon us, our heirs, etc., for fifty years, Mr. Brockden, the scrivener, said to us, \"You are young men, but it is scarcely probable that any of you will live to see the expiration of the term fix\u0027d in the instrument.\" A number of us, however, are yet living; but the instrument was after a few years rendered null by a charter that incorporated and gave perpetuity to the company. \\n\\n The objections and reluctances I met with in soliciting the subscriptions, made me soon feel the impropriety of presenting one\u0027s self as the proposer of any useful project, that might be suppos\u0027d to raise one\u0027s reputation in the smallest degree above that of one\u0027s neighbors, when one has need of their assistance to accomplish that project. I therefore put myself as much as I could out of sight, and stated it as a scheme of a number of friends, who had requested me to go about and propose it to such as they thought lovers of reading. In this way my affair went on more smoothly, and I ever after practis\u0027d it on such occasions; and, from my frequent successes, can heartily recommend it. The present little sacrifice of your vanity will afterwards be amply repaid. If it remains a while uncertain to whom the merit belongs, some one more vain than yourself will be encouraged to claim it, and then even envy will be disposed to do you justice by plucking those assumed feathers, and restoring them to their right owner. \\n\\n This library afforded me the means of improvement by constant study, for which I set apart an hour or two each day, and thus repair\u0027d in some degree the loss of the learned education my father once intended for me. Reading was the only amusement I allow\u0027d myself. I spent no time in taverns, games, or frolicks of any kind; and my industry in my business continu\u0027d as indefatigable as it was necessary. I was indebted for my printing-house; I had a young family coming on to be educated, and I had to contend with for business two printers, who were established in the place before me. My circumstances, however, grew daily easier. My original habits of frugality continuing, and my father having, among his instructions to me when a boy, frequently repeated a proverb of Solomon, \"Seest thou a man diligent in his calling, he shall stand before kings, he shall not stand before mean men,\" I from thence considered industry as a means of obtaining wealth and distinction, which encourag\u0027d me, tho\u0027 I did not think that I should ever literally stand before kings, which, however, has since happened; for I have stood before five, and even had the honor of sitting down with one, the King of Denmark, to dinner. \\n\\n We have an English proverb that says, \"He that would thrive, must ask his wife.\" It was lucky for me that I had one as much dispos\u0027d to industry and frugality as myself. She assisted me cheerfully in my business, folding and stitching pamphlets, tending shop, purchasing old linen rags for the papermakers, etc., etc. We kept no idle servants, our table was plain and simple, our furniture of the cheapest. For instance, my breakfast was a long time bread and milk (no tea), and I ate it out of a twopenny earthen porringer, with a pewter spoon. But mark how luxury will enter families, and make a progress, in spite of principle: being call\u0027d one morning to breakfast, I found it in a China bowl, with a spoon of silver! They had been bought for me without my knowledge by my wife, and had cost her the enormous sum of three-and-twenty shillings, for which she had no other excuse or apology to make, but that she thought her husband deserv\u0027d a silver spoon and China bowl as well as any of his neighbors. This was the first appearance of plate and China in our house, which afterward, in a course of years, as our wealth increas\u0027d, augmented gradually to several hundred pounds in value. \\n\\n I had been religiously educated as a Presbyterian; and tho\u0027 some of the dogmas of that persuasion, such as the eternal decrees of God, election, reprobation, etc., appeared to me unintelligible, others doubtful, and I early absented myself from the public assemblies of the sect, Sunday being my studying day, I never was without some religious principles. I never doubted, for instance, the existence of the Deity; that he made the world, and govern\u0027d it by his Providence; that the most acceptable service of God was the doing good to man; that our souls are immortal; and that all crime will be punished, and virtue rewarded, either here or hereafter. \\n\\n These I esteem\u0027d the essentials of every religion; and, being to be found in all the religions we had in our country, I respected them all, tho\u0027 with different degrees of respect, as I found them more or less mix\u0027d with other articles, which, without any tendency to inspire, promote, or confirm morality, serv\u0027d principally to divide us, and make us unfriendly to one another. This respect to all, with an opinion that the worst had some good effects, induc\u0027d me to avoid all discourse that might tend to lessen the good opinion another might have of his own religion; and as our province increas\u0027d in people, and new places of worship were continually wanted, and generally erected by voluntary contributions, my mite for such purpose, whatever might be the sect, was never refused. \\n\\n Tho\u0027 I seldom attended any public worship, I had still an opinion of its propriety, and of its utility when rightly conducted, and I regularly paid my annual \\n\\n subscription for the support of the only Presbyterian minister or meeting we had in Philadelphia. He us\u0027d to visit me sometimes as a friend, and admonish me to attend his administrations, and I was now and then prevail\u0027d on to do so, once for five Sundays successively. Had he been in my opinion a good preacher, perhaps I might have continued, notwithstanding the occasion I had for the Sunday\u0027s leisure in my course of study; but his discourses were chiefly either polemic arguments, or explications of the peculiar doctrines of our sect, and were all to me very dry, uninteresting, and unedifying, since not a single moral principle was inculcated or enforc\u0027d, their aim seeming to be rather to make us Presbyterians than good citizens. \\n\\n At length he took for his text that verse of the fourth chapter of Philippians, \"Finally, brethren, whatsoever things are true, honest, just, pure, lovely, or of good report, if there be any virtue, or any praise, think on these things.\" And I imagin\u0027d, in a sermon on such a text, we could not miss of having some morality. But he confin\u0027d himself to five points only, as meant by the apostle, viz.: 1. Keeping holy the Sabbath day. 2. Being diligent in reading the holy Scriptures. 3. Attending duly the publick worship. 4. Partaking of the Sacrament. 5. Paying a due respect to God\u0027s ministers. These might be all good things; but, as they were not the kind of good things that I expected from that text, I despaired of ever meeting with them from any other, was disgusted, and attended his preaching no more. I had some years before compos\u0027d a little Liturgy, or form of prayer, for my own private use (viz., in 1728), entitled, Articles of Belief and Acts of Religion. I return\u0027d to the use of this, and went no more to the public assemblies. My conduct might be blameable, but I leave it, without attempting further to excuse it; my present purpose being to relate facts, and not to make apologies for them. \\n\\n It was about this time I conceiv\u0027d the bold and arduous project of arriving at moral perfection. I wish\u0027d to live without committing any fault at any time; I would conquer all that either natural inclination, custom, or company might lead me into. As I knew, or thought I knew, what was right and wrong, I did not see why I might not always do the one and avoid the other. But I soon found I had undertaken a task of more difficulty than I bad imagined. While my care was employ\u0027d in guarding against one fault, I was often surprised by another; habit took the advantage of inattention; inclination was sometimes too strong for reason. I concluded, at length, that the mere speculative conviction that it was our interest to be completely virtuous, was not sufficient to prevent our slipping; and that the contrary habits must be broken, and good ones acquired and established, before we can have any dependence on a steady, uniform rectitude of conduct. For this purpose I therefore contrived the following method. \\n\\n In the various enumerations of the moral virtues I had met with in my reading, I found the catalogue more or less numerous, as different writers included more or fewer ideas under the same name. Temperance, for example, was by some confined to eating and drinking, while by others it was extended to mean the moderating every other pleasure, appetite, inclination, or passion, bodily or mental, even to our avarice and ambition. I propos\u0027d to myself, for the sake of clearness, to use rather more names, with fewer ideas annex\u0027d to each, than a few names with more ideas; and I included under thirteen names of virtues all that at that time occurr\u0027d to me as necessary or desirable, and annexed to each a short precept, which fully express\u0027d the extent I gave to its meaning. \\n\\n These names of virtues, with their precepts, were: \\n\\n I made a little book, in which I allotted a page for each of the virtues. I rul\u0027d each page with red ink, so as to have seven columns, one for each day of the week, marking each column with a letter for the day. I cross\u0027d these columns with thirteen red lines, marking the beginning of each line with the first letter of one of the virtues, on which line, and in its proper column, I might mark, by a little black spot, every fault I found upon examination to have been committed respecting that virtue upon that day. \\n\\n I determined to give a week\u0027s strict attention to each of the virtues successively. Thus, in the first week, my great guard was to avoid every the least offence against Temperance, leaving the other virtues to their ordinary chance, only marking every evening the faults of the day. Thus, if in the first week I could keep my first line, marked T, clear of spots, I suppos\u0027d the habit of that virtue so much strengthen\u0027d and its opposite weaken\u0027d, that I might venture extending my attention to include the next, and for the following week keep both lines clear of spots. Proceeding thus to the last, I could go thro\u0027 a course compleat in thirteen weeks, and four courses in a year. And like him who, having a garden to weed, does not attempt to eradicate all the bad herbs at once, which would exceed his reach and his strength, but works on one of the beds at a time, and, having accomplish\u0027d the first, proceeds to a second, so I should have, I hoped, the encouraging pleasure of seeing on my pages the progress I made in virtue, by clearing successively my lines of their spots, till in the end, by a number of courses, I should he happy in viewing a clean book, after a thirteen weeks\u0027 daily examination. \\n\\n Another from Cicero, \\n\\n \"O vitae Philosophia dux! O virtutum indagatrix expultrixque vitiorum! Unus dies, bene et ex praeceptis tuis actus, peccanti immortalitati est anteponendus.\" \\n\\n Another from the Proverbs of Solomon, speaking of wisdom or virtue: \"Length of days is in her right hand, and in her left hand riches and honour. Her ways are ways of pleasantness, and all her paths are peace.\" \\n\\n \"Father of light and life, thou Good Supreme! O teach me what is good; teach me Thyself! Save me from folly, vanity, and vice, From every low pursuit; and fill my soul With knowledge, conscious peace, and virtue pure; Sacred, substantial, never-fading bliss!\" \\n\\n The precept of Order requiring that every part of my business should have its allotted time, one page in my little book contain\u0027d the following scheme of employment for the twenty-four hours of a natural day: \\n\\n THE MORNING. { 5 } Rise, wash, and address { } Powerful Goodness! Contrive Question. What good shall { 6 } day\u0027s business, and take the I do this day? { } resolution of the day; prose- { 7 } cute the present study, and { } breakfast. 8 } 9 } Work. 10 } 11 } \\n\\n NOON. { 12 } Read, or overlook my ac- { 1 } counts, and dine. 2 } 3 }Work. 4 }5 } \\n\\n EVENING. { 6 } Put things in their places. { 7 } Supper. Music or diversion, Question. What good have { 8 } or conversation. Examination I doneto-day? { 9 } of the day. \\n\\n { 10 } { 11 } { 12 } \\n\\n NIGHT. { 1 } Sleep. { 2 } { 3 } { 4 } \\n\\n I enter\u0027d upon the execution of this plan for self-examination, and continu\u0027d it with occasional intermissions for some time. I was surpris\u0027d to find myself so much fuller of faults than I had imagined; but I had the satisfaction of seeing them diminish. To avoid the trouble of renewing now and then my little book, which, by scraping out the marks on the paper of old faults to make room for new ones in a new course, became full of holes, I transferr\u0027d my tables and precepts to the ivory leaves of a memorandum book, on which the lines were drawn with red ink, that made a durable stain, and on those lines I mark\u0027d my faults with a black-lead pencil, which marks I could easily wipe out with a wet sponge. After a while I went thro\u0027 one course only in a year, and afterward only one in several years, till at length I omitted them entirely, being employ\u0027d in voyages and business abroad, with a multiplicity of affairs that interfered; but I always carried my little book with me. \\n\\n My scheme of ORDER gave me the most trouble; and I found that, tho\u0027 it might be practicable where a man\u0027s business was such as to leave him the disposition of his time, that of a journeyman printer, for instance, it was not possible to be exactly observed by a master, who must mix with the world, and often receive people of business at their own hours. Order, too, with regard to places for things, papers, etc., I found extreamly difficult to acquire. I had not been early accustomed to it, and, having an exceeding good memory, I was not so sensible of the inconvenience attending want of method. This article, therefore, cost me so much painful attention, and my faults in it vexed me so much, and I made so little progress in amendment, and had such frequent relapses, that I was almost ready to give up the attempt, and content myself with a faulty character in that respect, like the man who, in buying an ax of a smith, my neighbour, desired to have the whole of its surface as bright as the edge. The smith consented to grind it bright for him if he would turn the wheel; he turn\u0027d, while the smith press\u0027d the broad face of the ax hard and heavily on the stone, which made the turning of it very fatiguing. The man came every now and then from the wheel to see how the work went on, and at length would take his ax as it was, without farther grinding. \"No,\" said the smith, \"turn on, turn on; we shall have it bright by-and-by; as yet, it is only speckled.\" \"Yes,\" said the man, \"but I think I like a speckled ax best.\" And I believe this may have been the case with many, who, having, for want of some such means as I employ\u0027d, found the difficulty of obtaining good and breaking bad habits in other points of vice and virtue, have given up the struggle, and concluded that \"a speckled ax was best\"; for something, that pretended to be reason, was every now and then suggesting to me that such extream nicety as I exacted of myself might be a kind of foppery in morals, which, if it were known, would make me ridiculous; that a perfect character might be attended with the inconvenience of being envied and hated; and that a benevolent man should allow a few faults in himself, to keep his friends in countenance. \\n\\n In truth, I found myself incorrigible with respect to Order; and now I am grown old, and my memory bad, I feel very sensibly the want of it. But, on the whole, tho\u0027 I never arrived at the perfection I had been so ambitious of obtaining, but fell far short of it, yet I was, by the endeavour, a better and a happier man than I otherwise should have been if I had not attempted it; as those who aim at perfect writing by imitating the engraved copies, tho\u0027 they never reach the wish\u0027d-for excellence of those copies, their hand is mended by the endeavor, and is tolerable while it continues fair and legible. \\n\\n It may be well my posterity should be informed that to this little artifice, with the blessing of God, their ancestor ow\u0027d the constant felicity of his life, down to his 79th year, in which this is written. What reverses may attend the remainder is in the hand of Providence; but, if they arrive, the reflection on past happiness enjoy\u0027d ought to help his bearing them with more resignation. To Temperance he ascribes his long-continued health, and what is still left to him of a good constitution; to Industry and Frugality, the early easiness of his circumstances and acquisition of his fortune, with all that knowledge that enabled him to be a useful citizen, and obtained for him some degree of reputation among the learned; to Sincerity and Justice, the confidence of his country, and the honorable employs it conferred upon him; and to the joint influence of the whole mass of the virtues, even in the imperfect state he was able to acquire them, all that evenness of temper, and that cheerfulness in conversation, which makes his company still sought for, and agreeable even to his younger acquaintance. I hope, therefore, that some of my descendants may follow the example and reap the benefit. It will be remark\u0027d that, tho\u0027 my scheme was not wholly without religion, there was in it no mark of any of the distingishing tenets of any particular sect. I had purposely avoided them; for, being fully persuaded of the utility and excellency of my method, and that it might be serviceable to people in all religions, and intending some time or other to publish it, I would not have any thing in it that should prejudice any one, of any sect, against it. I purposed writing a little comment on each virtue, in which I would have shown the advantages of possessing it, and the mischiefs attending its opposite vice; and I should have called my book THE ART OF VIRTUE because it would have shown the means and manner of obtaining virtue, which would have distinguished it from the mere exhortation to be good, that does not instruct and indicate the means, but is like the apostle\u0027s man of verbal charity, who only without showing to the naked and hungry how or where they might get clothes or victuals, exhorted them to be fed and clothed.-James ii. 15, 16. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/41/182.html","bookId":212,"book":{"id":212,"title":"The Autobiography Of Benjamin Franklin富兰克林自传","description":"简介： The Autobiography of Benjamin Franklin is the traditional name for the unfinished record of his own life written by Benjamin Franklin from 1771 to 1790; however, Franklin himself appears to have called the work his Memoirs. Although it had a tort...","cover":"http://novel.tingroom.com/uploads/allimg/101230/128356223067909.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/41","creation":"Aug 1, 2019 12:18:24 AM","modification":"Aug 1, 2019 12:18:24 AM"}}
