{"id":5517,"no":11,"title":"Chapter 11","content":"11:1 [hgb] 诡 诈 的 天 平 ， 为 耶 和 华 所 憎 恶 。 公 平 的 法 码 ， 为 他 所 喜 悦 。 \n [kjv] A false balance is abomination to the LORD: but a just weight is his delight. \n [bbe] Scales of deceit are hated by the Lord, but a true weight is his delight. \n 11:2 [hgb] 骄 傲 来 ， 羞 耻 也 来 。 谦 逊 人 却 有 智 慧 。 \n [kjv] When pride cometh, then cometh shame: but with the lowly is wisdom. \n [bbe] When pride comes, there comes shame, but wisdom is with the quiet in spirit. \n 11:3 [hgb] 正 直 人 的 纯 正 ， 必 引 导 自 己 。 奸 诈 人 的 乖 僻 ， 必 毁 灭 自 己 。 \n [kjv] The integrity of the upright shall guide them: but the perverseness of transgressors shall destroy them. \n [bbe] The righteousness of the upright will be their guide, but the twisted ways of the false will be their destruction. \n 11:4 [hgb] 发 怒 的 日 子 ， 赀 财 无 益 。 惟 有 公 义 能 救 人 脱 离 死 亡 。 \n [kjv] Riches profit not in the day of wrath: but righteousness delivereth from death. \n [bbe] Wealth is of no profit in the day of wrath, but righteousness keeps a man safe from death. \n 11:5 [hgb] 完 全 人 的 义 ， 必 指 引 他 的 路 。 但 恶 人 必 因 自 己 的 恶 跌 倒 。 \n [kjv] The righteousness of the perfect shall direct his way: but the wicked shall fall by his own wickedness. \n [bbe] The righteousness of the good man will make his way straight, but the sin of the evil-doer will be the cause of his fall. \n 11:6 [hgb] 正 直 人 的 义 ， 必 拯 救 自 己 。 奸 诈 人 必 陷 在 自 己 的 罪 孽 中 。 \n [kjv] The righteousness of the upright shall deliver them: but transgressors shall be taken in their own naughtiness. \n [bbe] The righteousness of the upright will be their salvation, but the false will themselves be taken in their evil designs. \n 11:7 [hgb] 恶 人 一 死 ， 他 的 指 望 必 灭 绝 。 罪 人 的 盼 望 ， 也 必 灭 没 。 \n [kjv] When a wicked man dieth, his expectation shall perish: and the hope of unjust men perisheth. \n [bbe] At the death of an upright man his hope does not come to an end, but the hope of the evil-doer comes to destruction. \n 11:8 [hgb] 义 人 得 脱 离 患 难 ， 有 恶 人 来 代 替 他 。 \n [kjv] The righteous is delivered out of trouble, and the wicked cometh in his stead. \n [bbe] The upright man is taken out of trouble, and in his place comes the sinner. \n 11:9 [hgb] 不 虔 敬 的 人 用 口 败 坏 邻 舍 。 义 人 却 因 知 识 得 救 。 \n [kjv] An hypocrite with his mouth destroyeth his neighbour: but through knowledge shall the just be delivered. \n [bbe] With his mouth the evil man sends destruction on his neighbour; but through knowledge the upright are taken out of trouble. \n 11:10 [hgb] 义 人 享 福 合 城 喜 乐 。 恶 人 灭 亡 ， 人 都 欢 呼 。 \n [kjv] When it goeth well with the righteous, the city rejoiceth: and when the wicked perish, there is shouting. \n [bbe] When things go well for the upright man, all the town is glad; at the death of sinners, there are cries of joy. \n 11:11 [hgb] 城 因 正 直 人 祝 福 便 高 举 。 却 因 邪 恶 人 的 口 就 倾 覆 。 \n [kjv] By the blessing of the upright the city is exalted: but it is overthrown by the mouth of the wicked. \n [bbe] By the blessing of the upright man the town is made great, but it is overturned by the mouth of the evil-doer. \n 11:12 [hgb] 藐 视 邻 舍 的 ， 毫 无 智 慧 。 明 哲 人 却 静 默 不 言 。 \n [kjv] He that is void of wisdom despiseth his neighbour: but a man of understanding holdeth his peace. \n [bbe] He who has a poor opinion of his neighbour has no sense, but a wise man keeps quiet. \n 11:13 [hgb] 往 来 传 舌 的 ， 泄 漏 密 事 。 心 中 诚 实 的 ， 遮 隐 事 情 。 \n [kjv] A talebearer revealeth secrets: but he that is of a faithful spirit concealeth the matter. \n [bbe] He who goes about talking of others makes secrets public, but the true-hearted man keeps things covered. \n 11:14 [hgb] 无 智 谋 ， 民 就 败 落 。 谋 士 多 ， 人 便 安 居 。 \n [kjv] Where no counsel is, the people fall: but in the multitude of counsellors there is safety. \n [bbe] When there is no helping suggestion the people will have a fall, but with a number of wise guides they will be safe. \n 11:15 [hgb] 为 外 人 作 保 的 ， 必 受 亏 损 。 恨 恶 击 掌 的 ， 却 得 安 稳 。 \n [kjv] He that is surety for a stranger shall smart for it: and he that hateth suretiship is sure. \n [bbe] He who makes himself responsible for a strange man will undergo much loss; but the hater of such undertakings will be safe. \n 11:16 [hgb] 恩 德 的 妇 女 得 尊 荣 。 强 暴 的 男 子 得 赀 财 。 \n [kjv] A gracious woman retaineth honour: and strong men retain riches. \n [bbe] A woman who is full of grace is honoured, but a woman hating righteousness is a seat of shame: those hating work will undergo loss, but the strong keep their wealth. \n 11:17 [hgb] 仁 慈 的 人 ， 善 待 自 己 。 残 忍 的 人 ， 扰 害 己 身 。 \n [kjv] The merciful man doeth good to his own soul: but he that is cruel troubleth his own flesh. \n [bbe] The man who has mercy will be rewarded, but the cruel man is the cause of trouble to himself. \n 11:18 [hgb] 恶 人 经 营 ， 得 虚 浮 的 工 价 。 撒 义 种 的 ， 得 实 在 的 果 效 。 \n [kjv] The wicked worketh a deceitful work: but to him that soweth righteousness shall be a sure reward. \n [bbe] The sinner gets the payment of deceit; but his reward is certain who puts in the seed of righteousness. \n 11:19 [hgb] 恒 心 为 义 的 ， 必 得 生 命 。 追 求 邪 恶 的 ， 必 致 死 亡 。 \n [kjv] As righteousness tendeth to life: so he that pursueth evil pursueth it to his own death. \n [bbe] So righteousness gives life; but he who goes after evil gets death for himself. \n 11:20 [hgb] 心 中 乖 僻 的 ， 为 耶 和 华 所 憎 恶 。 行 事 完 全 的 ， 为 他 所 喜 悦 。 \n [kjv] They that are of a froward heart are abomination to the LORD: but such as are upright in their way are his delight. \n [bbe] The uncontrolled are hated by the Lord, but those whose ways are without error are his delight \n 11:21 [hgb] 恶 人 虽 然 连 手 ， 必 不 免 受 罚 。 义 人 的 后 裔 ， 必 得 拯 救 。 \n [kjv] Though hand join in hand, the wicked shall not be unpunished: but the seed of the righteous shall be delivered. \n [bbe] Certainly the evil-doer will not go free from punishment, but the seed of the upright man will be safe. \n 11:22 [hgb] 妇 女 美 貌 而 无 见 识 ， 如 同 金 环 带 在 猪 鼻 上 。 \n [kjv] As a jewel of gold in a swine\u0027s snout, so is a fair woman which is without discretion. \n [bbe] Like a ring of gold in the nose of a pig, is a beautiful woman who has no sense. \n 11:23 [hgb] 义 人 的 心 愿 ， 尽 得 好 处 。 恶 人 的 指 望 ， 致 干 忿 怒 。 \n [kjv] The desire of the righteous is only good: but the expectation of the wicked is wrath. \n [bbe] The desire of the upright man is only for good, but wrath is waiting for the evil-doer. \n 11:24 [hgb] 有 施 散 的 ， 却 更 增 添 。 有 吝 惜 过 度 的 ， 反 致 穷 乏 。 \n [kjv] There is that scattereth, and yet increaseth; and there is that withholdeth more than is meet, but it tendeth to poverty. \n [bbe] A man may give freely, and still his wealth will be increased; and another may keep back more than is right, but only comes to be in need. \n 11:25 [hgb] 好 施 舍 的 ， 必 得 丰 裕 。 滋 润 人 的 ， 必 得 滋 润 。 \n [kjv] The liberal soul shall be made fat: and he that watereth shall be watered also himself. \n [bbe] He who gives blessing will be made fat, but the curser will himself be cursed. \n 11:26 [hgb] 屯 粮 不 卖 的 ， 民 必 咒 诅 他 。 情 愿 出 卖 的 ， 人 必 为 他 祝 福 。 \n [kjv] He that withholdeth corn, the people shall curse him: but blessing shall be upon the head of him that selleth it. \n [bbe] He who keeps back grain will be cursed by the people; but a blessing will be on the head of him who lets them have it for a price. \n 11:27 [hgb] 恳 切 求 善 的 ， 就 求 得 恩 惠 。 惟 独 求 恶 的 ， 恶 必 临 到 他 身 。 \n [kjv] He that diligently seeketh good procureth favour: but he that seeketh mischief, it shall come unto him. \n [bbe] He who, with all his heart, goes after what is good is searching for grace; but he who is looking for trouble will get it. \n 11:28 [hgb] 倚 仗 自 己 财 物 的 ， 必 跌 倒 。 义 人 必 发 旺 如 青 叶 。 \n [kjv] He that trusteth in his riches shall fall; but the righteous shall flourish as a branch. \n [bbe] He who puts his faith in wealth will come to nothing; but the upright man will be full of growth like the green leaf. \n 11:29 [hgb] 扰 害 己 家 的 ， 必 承 受 清 风 。 愚 昧 人 必 作 慧 心 人 的 仆 人 。 \n [kjv] He that troubleth his own house shall inherit the wind: and the fool shall be servant to the wise of heart. \n [bbe] The troubler of his house will have the wind for his heritage, and the foolish will be servant to the wise-hearted. \n 11:30 [hgb] 义 人 所 结 的 果 子 ， 就 是 生 命 树 。 有 智 慧 的 必 能 得 人 。 \n [kjv] The fruit of the righteous is a tree of life; and he that winneth souls is wise. \n [bbe] The fruit of righteousness is a tree of life, but violent behaviour takes away souls. \n 11:31 [hgb] 看 哪 ， 义 人 在 世 尚 且 受 报 ， 何 况 恶 人 和 罪 人 呢 ？ \n [kjv] Behold, the righteous shall be recompensed in the earth: much more the wicked and the sinner. \n [bbe] If the upright man is rewarded on earth, how much more the evil-doer and the sinner! \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/123/1817.html","bookId":180,"book":{"id":180,"title":"箴言 Proverbs","description":"简介： 1:1 [hgb] 以 色 列 王 大 卫 儿 子 所 罗 门 的 箴 言 。 [kjv] The proverbs of Solomon the son of David, king of Israel; [bbe] The wise sayings of Sol...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/123","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
