{"id":5515,"no":9,"title":"Chapter 9","content":"9:1 [hgb] 智 慧 建 造 房 屋 ， 凿 成 七 根 柱 子 ， \n [kjv] Wisdom hath builded her house, she hath hewn out her seven pillars: \n [bbe] Wisdom has made her house, putting up her seven pillars. \n 9:2 [hgb] 宰 杀 牲 畜 ， 调 和 旨 酒 ， 设 摆 筵 席 。 \n [kjv] She hath killed her beasts; she hath mingled her wine; she hath also furnished her table. \n [bbe] She has put her fat beasts to death; her wine is mixed, her table is ready. \n 9:3 [hgb] 打 发 使 女 出 去 ， 自 己 在 城 中 至 高 处 呼 叫 ， \n [kjv] She hath sent forth her maidens: she crieth upon the highest places of the city, \n [bbe] She has sent out her women-servants; her voice goes out to the highest places of the town, saying, \n 9:4 [hgb] 说 ， 谁 是 愚 蒙 人 ， 可 以 转 到 这 里 来 。 又 对 那 无 知 的 人 说 ， \n [kjv] Whoso is simple, let him turn in hither: as for him that wanteth understanding, she saith to him, \n [bbe] Whoever is simple, let him come in here; and to him who has no sense, she says: \n 9:5 [hgb] 你 们 来 ， 吃 我 的 饼 ， 喝 我 调 和 的 酒 。 \n [kjv] Come, eat of my bread, and drink of the wine which I have mingled. \n [bbe] Come, take of my bread, and of my wine which is mixed. \n 9:6 [hgb] 你 们 愚 蒙 人 ， 要 舍 弃 愚 蒙 ， 就 得 存 活 。 并 要 走 光 明 的 道 。 \n [kjv] Forsake the foolish, and live; and go in the way of understanding. \n [bbe] Give up the simple ones and have life, and go in the way of knowledge. \n 9:7 [hgb] 指 斥 亵 慢 人 的 ， 必 受 辱 骂 。 责 备 恶 人 的 ， 必 被 玷 污 。 \n [kjv] He that reproveth a scorner getteth to himself shame: and he that rebuketh a wicked man getteth himself a blot. \n [bbe] He who gives teaching to a man of pride gets shame for himself; he who says sharp words to a sinner gets a bad name. \n 9:8 [hgb] 不 要 责 备 亵 慢 人 ， 恐 怕 他 恨 你 。 要 责 备 智 慧 人 ， 他 必 爱 你 。 \n [kjv] Reprove not a scorner, lest he hate thee: rebuke a wise man, and he will love thee. \n [bbe] Do not say sharp words to a man of pride, or he will have hate for you; make them clear to a wise man, and you will be dear to him. \n 9:9 [hgb] 教 导 智 慧 人 ， 他 就 越 发 有 智 慧 。 指 示 义 人 ， 他 就 增 长 学 问 。 \n [kjv] Give instruction to a wise man, and he will be yet wiser: teach a just man, and he will increase in learning. \n [bbe] Give teaching to a wise man, and he will become wiser; give training to an upright man, and his learning will be increased. \n 9:10 [hgb] 敬 畏 耶 和 华 ， 是 智 慧 的 开 端 。 认 识 至 圣 者 ， 便 是 聪 明 。 \n [kjv] The fear of the LORD is the beginning of wisdom: and the knowledge of the holy is understanding. \n [bbe] The fear of the Lord is the start of wisdom, and the knowledge of the Holy One gives a wise mind \n 9:11 [hgb] 你 借 着 我 ， 日 子 必 增 多 ， 年 岁 也 必 加 添 。 \n [kjv] For by me thy days shall be multiplied, and the years of thy life shall be increased. \n [bbe] For by me your days will be increased, and the years of your life will be long. \n 9:12 [hgb] 你 若 有 智 慧 ， 是 与 自 己 有 益 。 你 若 亵 慢 ， 就 必 独 自 担 当 。 \n [kjv] If thou be wise, thou shalt be wise for thyself: but if thou scornest, thou alone shalt bear it. \n [bbe] If you are wise, you are wise for yourself; if your heart is full of pride, you only will have the pain of it. \n 9:13 [hgb] 愚 昧 的 妇 人 喧 嚷 。 她 是 愚 蒙 ， 一 无 所 知 。 \n [kjv] A foolish woman is clamorous: she is simple, and knoweth nothing. \n [bbe] The foolish woman is full of noise; she has no sense at all. \n 9:14 [hgb] 她 坐 在 自 己 的 家 门 口 ， 坐 在 城 中 高 处 的 座 位 上 ， \n [kjv] For she sitteth at the door of her house, on a seat in the high places of the city, \n [bbe] Seated at the door of her house, in the high places of the town, \n 9:15 [hgb] 呼 叫 过 路 的 ， 就 是 直 行 其 道 的 人 ， \n [kjv] To call passengers who go right on their ways: \n [bbe] Crying out to those who go by, going straight on their way, she says: \n 9:16 [hgb] 说 ， 谁 是 愚 蒙 人 ， 可 以 转 到 这 里 来 。 又 对 那 无 知 的 人 说 ， \n [kjv] Whoso is simple, let him turn in hither: and as for him that wanteth understanding, she saith to him, \n [bbe] Whoever is simple, let him come in here: and to him who is without sense, she says: \n 9:17 [hgb] 偷 来 的 水 是 甜 的 ， 暗 吃 的 饼 是 好 的 。 \n [kjv] Stolen waters are sweet, and bread eaten in secret is pleasant. \n [bbe] Drink taken without right is sweet, and food in secret is pleasing. \n 9:18 [hgb] 人 却 不 知 有 阴 魂 在 她 那 里 。 她 的 客 在 阴 间 的 深 处 。 \n [kjv] But he knoweth not that the dead are there; and that her guests are in the depths of hell. \n [bbe] But he does not see that the dead are there, that her guests are in the deep places of the underworld. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/123/1815.html","bookId":180,"book":{"id":180,"title":"箴言 Proverbs","description":"简介： 1:1 [hgb] 以 色 列 王 大 卫 儿 子 所 罗 门 的 箴 言 。 [kjv] The proverbs of Solomon the son of David, king of Israel; [bbe] The wise sayings of Sol...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/123","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
