{"id":30088,"no":16,"title":"CHAPTER XV. CRUISING.","content":"Before sailing, the yellow band was painted out, for the pirates who escaped would probably carry the news of what had happened over the whole archipelago. Ten men were put on board each of the prizes, and the Tigress sailed up through the islands and escorted them to Smyrna, where the pasha, after hearing an account of their capture, at once gave permission for them to be sold as prizes, and as the news of the retreat of the French had given a considerable impetus to trade, they fetched good prices. As soon as this was arranged, the Tigress sailed away again. For some months they cruised among the islands, putting into every little bay and inlet, boarding every craft found there, and searching her thoroughly to see if there was any property belonging to plundered vessels on board. Once or twice she came upon two or three large craft together, and had some hard fighting before she captured or sank them; but, as a rule, the crews rowed ashore as soon as they saw the real nature of the new-comer. Some thirty craft were sent as prizes into Smyrna or Rhodes, and there sold, as many more were sunk or burned. They had, in no case, found spoil at all equal to that which had been cap[Pg 271]tured at Astropalaia, but the total was nevertheless considerable. Once or twice they were attacked by boats when anchored in quiet bays, but as a vigilant watch was always kept they beat off their assailants with heavy loss. The rig of the brig was frequently altered. Sometimes she was turned into a schooner with yards on her foremast, sometimes into a fore-and-aft craft; and as the time went on and captures became fewer and fewer, it was evident that she had established a thorough scare throughout the archipelago, and that for the time the pirates had taken to peaceful avocations, and were indeed completely crippled by the loss of so large a number of their craft. The Tigress had but one awkward incident during the voyage. The day was bright and clear. The two Turks had been, as was their custom, squatting together on the deck, smoking their pipes. Wilkinson and Edgar were pacing together up and down, when the latter said: \"Look at these two native craft; they have both let their lateen sails run down. I am sure I don\u0027t know why; there is not a cloud in the sky, except that little white one over there.\" They were passing the Turks at the moment, and Edgar said to one of them: \"The two craft over there have just let their sails run down. What can that mean?\" The Turk leapt to his feet with a quickness very unusual to him. \"It is a white squall!\" he shouted. \"Down with every stitch of canvas, sir. Quick, for your lives! the squall will be upon us in five minutes.\" It was Wilkinson\u0027s first experience of the terribly sudden squall of the Levant, but he had heard of them and knew their danger, and he shouted at the top of his voice:[Pg 272] \"All hands take in sail! Quick, lads, for your lives!\" The boatswain\u0027s whistle rang loudly in the air, and he repeated the order at the top of his voice. The men on deck, who had been engaged on various small jobs since they came up from dinner, looked astounded at the order, but without hesitation ran up the ratlines at the top of their speed, while the watch below looked equally surprised as they glanced upwards and around at the deep blue of the sky. \"Quick, quick!\" the Turk exclaimed. \"Let go all sheets and halliards!\" Wilkinson shouted, \"Do the sails up anyhow, men.\" Although the sky was unchanged they could see the light cloud Edgar had noticed advancing towards them at an extraordinary rate of speed, while a white line on the sea kept pace with it. \"Hard up with the helm—hard up!\" Wilkinson shouted. \"Hold on a moment with those head sails; that will do, that will do. Let go the halliards; down staysails and jib.\" The sailors, now conscious of the coming danger, worked desperately. The light upper sails were secured, the courses had been clewed up, but the topsails were still but half-lashed when Wilkinson shouted again: \"Down for your lives! Down on the weather side; slip down by the back-stays. You men to leeward, hold on—all hold on,\" he shouted a few seconds later. There was a dull roaring sound, rising to a shriek as the squall struck the vessel. Most of the men had gained the deck in safety, but many of those coming down by the ratlines were still some distance from the deck. It was well for them that they were on the weather side; had they been to leeward they would have been torn from their grasp, whereas they were now[Pg 273] pinned to the rigging. Two sounds like the explosion of cannon were heard. The main and foretopsails both blew out of their gaskets, bellied for an instant, and then burst from the bolt-ropes and flew away, and were speedily lost to sight. So great was the pressure that the brig was driven bodily down until the water was almost level with the rail at the bow, and it looked for a moment as if she would go down by the head. One of the jibs was run up, but only to be blown away before it was sheeted home. Another was tried, the sheet being kept very slack. This held, her head lifted, and in a minute the Tigress was flying along dead before the wind. The storm-jib was brought up, hooked on, and hoisted. This, being of very heavy canvas, could be trusted, and as soon as it was set the other was hauled down. \"Thank God, that is over!\" Wilkinson said, \"and we have not lost a hand.\" By this time all the men had gained the deck. \"How long will this last?\" Edgar shouted in one of the Turks\u0027 ears. \"Perhaps one hour; perhaps four.\" \"Let us have a look at the chart,\" Wilkinson said. \"When we last looked there was a group of rocks ten miles ahead, and at the rate we are going the Tigress will be smashed into matchwood if she keeps on this course for long.\" Edgar nodded. \"We must get trysails on the main and foremast,\" Wilkinson went on, \"and manage to lay her course a couple of points to the west. I wish we had those upper spars down on deck, but it is of no use talking of that now.\" Wilkinson went down to the sail-room with the boatswain and four seamen to bring up the two heaviest and strongest of the triangular sails.[Pg 274] \"We must sheet them home before we hoist them,\" he said, as they returned on deck. \"We should never be able to haul the sheets in when the sails once fill.\" Twenty men went aft with them and commenced the task. The fore-trysail was bent to some of the mast-hoops, and the sheet fastened to a cavel on the port side. \"Port your helm a little, my man,\" Wilkinson said. \"That will do, just enough to keep the wind on the starboard quarter. Keep her at that, keep her at that.\" Edgar had the sail ready to hoist. \"Slacken the tack a little. Now, half a dozen of you tail on here, and get ready to haul it down as soon as the sail is up to its full height and the halliards secured. Now, lads, tail on to the halliards. Away with her.\" The sailors ran forward with the rope, but as the sail rose the strain was so great that once or twice they were brought to a standstill. At last the boatswain shouted: \"That is enough. Come back a little, but keep a firm grip of it. That is right!\" he shouted, as he twisted the slack of the rope over the cleet. \"Now, lads, down with the tack; down with it! Belay!\" The main-trysail was hoisted as successfully. Small as were the sails, and slight the angle with the wind, the pressure brought the ship down nearly to her covering-board. Wilkinson and the boatswain took their places by the wheel. \"Keep her full, lads, but not a bit more. She will do at that. By Jove, Blagrove,\" he said, as Edgar came aft and glanced at the compass, \"that was a narrow squeak! If you hadn\u0027t noticed those native craft lower their sails and called our attention to it, we should have turned turtle as sure as fate. We have got her snug now. If we were right as to our position at noon we shall clear those rocks nicely.\" \"I don\u0027t think we can have been far wrong, by the posi[Pg 275]tion of the islands. At the same time I will go up to the foretop,\" Edgar said; \"I shall be able to make them out some distance away, for, if you remember, two of them are thirty or forty feet above the water.\" \"Mind how you go,\" Wilkinson said. \"You had better take one of the men up with you; you can hold each other on then.\" Edgar went forward and told one of the best of the hands to go aloft with him. \"All right, your honour!\" \"It will be a tight job, but I daresay we can do it. Get a couple of lines seven or eight feet long; we will fasten them under our arms, and if a puff comes harder than usual we can twist the end round a shroud or ratline.\" In a couple of minutes both were roped and ready to mount. It was hard work, and several times they had to use the rope to prevent their being torn from their hold. But at last they reached the top, and fastened themselves securely there. The scene was a singular one. Overhead was a cloudless sky, somewhat paler in tint than it had been before the squall burst. Below was a white mass of foam, which, from the height on which they stood, seemed almost pressed level by the force of the wind. On deck they had been drenched with the sheets of spray torn off the heads of the waves as soon as they began to lift themselves, but here they were above this, and there was nothing to prevent their looking round in all directions. \"There are the rocks, sir,\" the top-man said, after they had been some twenty minutes in their position, \"over the lee bow, about two points off our course.\" \"I see them now,\" Edgar said. \"I thought we should have made them out by the white foam round them, but it is white everywhere.\"[Pg 276] He shouted down to the deck, but it was some time before he could make his voice heard above the roar of the squall. He pointed aft when at last one looked up. The sailor ran aft to the helm, and called Wilkinson\u0027s attention to Edgar. The latter pointed in the direction of the rocks. Wilkinson waved his hand, and Edgar, then leaving the sailor on watch, made his way down to the deck. \"We shall go within half a mile of them,\" he said, when he joined his comrade. \"It is lucky that we looked at the chart as soon as we did,\" Wilkinson shouted back, \"for even with this rag of sail I should not have liked to bring her nearer to the wind than we are now.\" \"I don\u0027t think it is blowing quite as hard as it was,\" Edgar said. \"I certainly got down more easily than I went up.\" \"I was thinking so myself, Blagrove, though there is not much difference. I don\u0027t care, now that we are clear of those rocks, how long it keeps on. Directly we pass them we can keep her off the wind again, and there is nothing in our course then for over forty miles, and then it is only a small island with deep water all round. I have just been taking another look at the chart.\" By another hour the strength of the wind had considerably abated, the fore-staysail was reefed and hoisted, and before sunset sail was on her again, and the hands were aloft preparing to get up fresh topsails. At the end of six months, on their going into Rhodes they found that a small gun-boat had arrived with orders from Sir Sidney Smith for them to rejoin him. \"You have done exceedingly well,\" the latter said in his letter. \"The pashas both of Smyrna and Rhodes have written to me expressing their admiration at the work that[Pg 277] you have accomplished, and indeed your report of the number of pirate vessels taken or destroyed speaks for itself.\" They were not sorry at the receipt of the order. During the past month they had only made two or three captures, and these were craft of small size, and they were well content to give up their independent life, and return to regular duty. A week later they made out the Tigre lying off the Damietta mouth of the Nile. The man-of-war signalled to them to anchor near her. As soon as they did so Wilkinson went on board. \"I am glad to see you back, Mr. Wilkinson,\" Sir Sidney said cordially. \"You have fully justified my confidence in your energy and discretion. The pashas write to me saying that piracy seems to be completely suppressed, and that it is two months since either of them received a complaint of a vessel being chased or missing. Therefore, as I wanted you here, where we have not half enough ships for the work, I thought it as well to recall you. Your craft seems,\" he went on, as he surveyed the Tigress through his glass, \"a good deal lower in the water than she was?\" \"Yes, sir, she is down nearly two feet and a half. I reported to you that we gained a considerable amount of booty at Astropalaia, and of course we have added gradually to that, but never had anything like so good a haul. The hold up to the level of the main deck is full.\" \"Full of what, Mr. Wilkinson?\" \"Miscellaneous cargo, sir—dried fruit, Manchester goods, and Eastern goods of all sorts. I have not taken an exact inventory of them, sir, for we were generally pressed for time, and I thought that the things were less likely to be damaged if I did not open the bales. I really do not know exactly what we have got, but there is certainly a good deal of silk and a quantity of embroidered things.\"[Pg 278] \"That sounds well, anyhow,\" Sir Sidney said, smiling, \"but I am afraid that it will not turn out so well for you personally as it ought to do. You see the craft herself was a prize of the Tigre, and her officers and crew are still borne on our books; therefore, although you were detached on altogether independent work, you still rank as a tender of the Tigre, and we all share with you, and indeed all your names have been sent in on the list of those entitled to share in the prizes that we have made here. As these have been generally laden partly with ammunition and partly with luxuries for the use of the army, they were for the most part valuable, and up to this time we calculate that a sum of fifty or sixty thousand pounds will be shared.\" \"We quite understood, sir, that we should share with the Tigre in all that we captured. It would have been too bad if, in addition to our luck in having an independent cruise on board the Tigress, we were to get an advantage over our comrades in the way of prize-money. We have, as I told you in my last report, received twelve thousand five hundred pounds, the result of the sale of the thirty-two craft we sent into Smyrna and Rhodes. It is in gold, and I thought that it would be better for you to send off a boat for it than for me to bring it myself now. What are we to do with the cargo, sir?\" \"I must think that over, Mr. Wilkinson. You have not lost many hands, I hope, while you were away?\" \"No, sir, we have not done any very hard fighting. We had two men shot in the attack of the pirates\u0027 hold at Astropalaia, and more than half the crew have been wounded more or less seriously, but fortunately all got over it.\" \"That is very satisfactory, Mr. Wilkinson. In giving me a full report of your work, give a list of the casualties in each case. Some of the people at the Admiralty seem to[Pg 279] have an idea that the credit of any affair depends largely on the size of the butcher\u0027s bill, whereas, in point of fact, it should be exactly the other way, for not unfrequently heavy loss means that measures were badly taken by the officers in command, whereas a light one shows that the arrangements were all excellent, and the work carried out without a hitch. I shall be glad if you and Mr. Blagrove will dine with me. It is not very regular for you both to leave the ship together, but there are no signs whatever of change of wind, and one can reckon with some certainty here upon the weather for at any rate twenty-four hours in advance. If you should see any change before you come off, or any fall in the glass, Mr. Blagrove must stay on board.\" Wilkinson now joined his comrades, who were gathered a short distance away waiting until he had finished his talk with Sir Sidney. \"Come down below, Wilkinson, and give us the news. We heard that you had taken some prizes from the pirates; we want to hear all about it. Is Blagrove all right?\" They were soon gathered in the cockpit. \"I have not much time to stay,\" Wilkinson said, \"and, before I tell you my story, I want to hear your news, for beyond a few rumours current at Smyrna and Rhodes, we really know hardly anything of what has taken place since we left you at Acre.\" \"We have had rather a dull time,\" one of them said; \"the only excitement was a fight between the Turks, aided by our boats, and the French. When we returned here, we found that instead of being fifteen thousand strong, as promised, the Turks on board their transports under Mustapha Pasha were but five thousand strong, which was raised to seven thousand by the two thousand we brought with us[Pg 280] from Acre. On the 15th of July they landed, attacked the redoubt and castle of Aboukir with great pluck, and carried it by assault. A week later, we heard that Bonaparte was at Ramanieh, and had no doubt that the Turks would soon have him on them. Sir Sidney tried hard to get them to erect a strong line of works across the spit of ground on which the fort stands. \"Had they done so they could, with the assistance of our boats and their own gun-boats, have maintained their ground. The chief set to work at once to endeavour to get things into shape. The Chiflick regiment, that we had brought with us from Acre, was posted in the village at the end of the spit. The Turkish gun-boats were ordered to take their places directly the assault began on each side of the isthmus, so as to sweep it with their fire, but when that time came the beggars would not move, and did not arrive until it was all over. \"The Turks in the village were attacked several times, but made a magnificent defence. We helped them with our guns as much as we could, but could render them very little assistance. At last we saw that an attack was to be made in earnest; peremptory orders were sent to the Turkish gun-boats to go in and take up their stations, and our boats all went in to the west side of the spit. Nothing could be worse than the arrangements of the Turks. They had sent very little provisions and next to no water on shore, and their troops were nearly half-mad with thirst, and more than half-mutinous. However, they moved forward to the village, and they there repulsed three attacks made by the French columns. Probably no more attacks would have been made, if it had not been for their beastly custom of cutting off the heads of the fallen. Lots of them ran out of the village to do this, and this so infuriated the French[Pg 281] that they came on again with such a rush that they entered the village with the flying Turks. \"The confusion was terrible, and the Turks were driven out. The spit of sand was covered with fugitives, hundreds threw themselves into the water and swam out to us. The castle, which, as you know, is a little bit of a place, was crowded almost to suffocation, and thousands could not get in. The fire of our boat guns kept the French back for a time, and when at last the Turkish gun-boats got into position, they had to fall back and make advances against the castle in a regular way. Unfortunately Mustapha Pasha had been taken in the village, and the garrison had no one to command them, still they resisted for two days, and then surrendered, being almost mad with thirst, for, although we spared as much water as we could, it was impossible for us to find sufficient for six or seven thousand extra men. \"Our marines saved the castle the first day, Colonel Douglas landing and taking command and restoring order, for the Turks were fighting fiercely among themselves when we got in, and during the night he managed to send off about a thousand of them to their ships. The whole business was brought about owing to Mustapha Pasha not acting in accordance with the advice that Sir Sidney had sent him to act against either Damietta or Rosetta, as our ships would station themselves in the Bay of Aboukir, and so threaten Alexandria that the French would not care to weaken their force there by sending any considerable number of men to act against the Turks. There, that is all that has happened. Now let us hear your yarn.\" Wilkinson gave a brief account of the trip of the Tigress. \"You see,\" he said, \"we have not done much fighting; indeed, with the exception of the first scrimmage at Astro[Pg 282]palaia we can scarcely have said to have had anything worth calling fighting at all. We picked up a lot of small piratical craft, destroyed the majority of them, and sold the others at Smyrna or Rhodes. We got altogether twelve thousand five hundred for them, and as, of course, that will be shared by the Tigre, we have done pretty well our share in the way of earning prize-money for the ship. More, indeed, for the Tigre\u0027s share of the prizes that you have taken here won\u0027t come to more than fifteen or twenty thousand at the outside. Besides that, we have got some booty on board the Tigress, but what it is worth I have no idea, for we simply bundled the things down below without opening anything. Still, no doubt it will be enough to give you a few pounds a head.\" As soon as he could get away Wilkinson returned to the brig. That evening, at the admiral\u0027s table, he gave a much more detailed account of their doings than he had done in his reports. When he had finished, Sir Sidney Smith said: \"That attack upon the pirates\u0027 hold was extremely well managed, Mr. Wilkinson, and does you and Mr. Blagrove great credit. You were very brief in your account of it, and only said that a considerable amount of booty, which had evidently been taken from plundered ships, was found concealed, and that the more valuable portion was shipped on the Tigress. I will come on board in the morning, and you can have a few of those bales brought up on to the main deck, and we can see what is in them.\" A dozen bales were opened the next day; two contained European goods, the rest Eastern manufactures, silks and embroideries, Turkish, Syrian, and Persian carpets and rugs. \"That is enough!\" Sir Sidney said. \"Now, can you roughly give me an idea what proportion of European goods,[Pg 283] dried fruits, and what we may call generally Eastern goods, you have?\" \"There are about twenty tons of fruit, sir, thirty tons of European bales, and fifty or sixty tons of Eastern goods. Of these, I should say that two-thirds are carpets and rugs, we could pretty well tell these from the others by the size and feel of the bales; the rest are, judging from the few we opened, cloth for female garments—muslin, silks, scarves, sashes, and embroidered goods. \"It is extraordinary how so great a collection could have been made.\" \"There have been a great many vessels employed in the making of it, sir, and we may say that we have here the pick from at least a hundred, perhaps several times that number, of captured craft of several sizes. No doubt the pirates would, in all cases, put aside goods of this kind, for although of no use to themselves, and no doubt very difficult to sell, they would store them away under the idea that some time or other an opportunity would occur of turning them into money.\" \"Well, there is no doubt that you have an extremely rich prize. I should be afraid to give even an approximate calculation of what all this is worth. Some of our East-Indiamen bring very valuable cargoes home; but I should doubt whether any one ship ever carried as much costly merchandise as you have stored here. I will think over how they had best be got to England. The things will require careful handling, for if they were consigned to an ordinary prize agent they might be sold anyhow and for half their value.\" On the following day the two midshipmen were signalled to come on board the Tigre. \"I have been thinking your matter over, gentlemen,\"[Pg 284] Sir Sidney said when they had entered his cabin. \"I have power to appoint a prize agent in England. As a matter of fact I have not done so. Coming out here, as I did, on a diplomatic mission, I had no thought of taking prizes. Those we have picked up here I simply sent to the agent at Gibraltar, which, by the way, is one of the very worst places one can send them to, as the vessels are sold at ridiculous prices. Ordinarily Malta would be the port we should have sent them to from here, but as it is still in the possession of the French, Gibraltar is the only port in the Mediterranean. Of course they might be sent to England; but there is the difficulty of detaching men and officers, and the risk of their being captured by French privateers, so that practically we are driven to Gibraltar. \"Of course the prize court will have the disposal of the cargo, but I will write to the head of the court, who is a personal friend of mine, asking him to intrust the sale of the Eastern goods to your father, Mr. Blagrove, saying that as he has been for years engaged in trade in the East, and must therefore be acquainted with the value of these things, is in the habit of sending Egyptian silks and so on to London for sale, he must know the channels in which they could be best disposed of. Of course the dried fruits and the English goods could be sold by the court, but it would never do to throw such a quantity of Eastern goods on the market at once. Among the prizes that have been taken is a smart brig of about the same size as the Tigress. She was caught making for Alexandria with powder and ball for the French army. Fortunately for us her captain was not a first-class navigator, and so missed his mark by about ten miles, and found himself, to his consternation and our satisfaction, close under our guns. \"I was going to send her to Gibraltar to be sold. I do[Pg 285] not think that we can do better than buy her to carry home your cargo. I will call a court of four officers to put on her the price they consider it probable that she will fetch, which, I should say, if she were sold at Gibraltar, would not be over eight or nine hundred pounds. You, Mr. Blagrove, can buy her in the name of your father, and I will take your bill at three months upon him. Then there is the question of the crew. As to the officers, I can send you home, Mr. Wilkinson, with despatches. I have not had an opportunity of forwarding any for some weeks now; and to you, Mr. Blagrove, I can give three months\u0027 leave on urgent private business. As to men, we have small craft coming over here constantly from Sicily with fruit and fresh provisions, and I have no doubt that, with the offer of good wages, you would be able to pick up ten or twelve men without much difficulty. \"On board our ships there are, I should say, at least twenty men who have been invalided by boards of doctors as being unfit for service, either from the effects of wounds or climate, and this would be a good opportunity for sending them home. Many of them are still fit for easy work, and would, at any rate, counterbalance your Italian crew. Of course I should formally take a passage for them in Mr. Blagrove\u0027s ship. The prize mounts six guns, but I would advise you to keep well out of the way of French privateers. Of course the final result of the sale of the merchandise would have to be paid by your father, Mr. Blagrove, into the prize court for division among those entitled to it. \"With the ship, as your father\u0027s property, the case is different; that is his private venture. He will, of course, charge freight on the merchandise, and he will get two or three pounds a head for taking the invalids home. As he will certainly get double the price the brig would fetch at[Pg 286] Gibraltar, that and the freight would a good deal more than clear all expenses, and he will of course have the usual prize-agent\u0027s commission on the sales he effects. What do you think of that plan?\" Both the midshipmen were highly pleased with the proposal, and thanked their commander very heartily for his kindness. A board of officers assembled on the following day and assessed the value of the French brig at ￡850, and Edgar formally bought her in his father\u0027s name for that sum, and drew a bill upon him for payment in three months. He had several times heard from him since he had entered on board the Tigre, and in the first letter Mr. Blagrove gave a hearty approval of the course that he had adopted, and said that a year or two at sea would give him a thorough knowledge of ships and be a considerable advantage to him in their business. The receipt of Edgar\u0027s first letter, and of a heavy budget containing the account of his doings in Egypt from the day on which he was left behind to that on which he sailed, had been an immense relief to them all, for hitherto they had been in absolute ignorance of what had taken place. His father, however, thought that he had, even according to his own account, run a very needless risk in taking part in the rising at Cairo, although he saw that, having for the time become so thoroughly associated with the Arabs, it would have been difficult for him to avoid acting with them when there was danger in so doing.","sourceLink":"http://novel.tingroom.com/duanpian/3158/86697.html","bookId":876,"book":{"id":876,"title":"At Aboukir and Acre","description":"简介： Two lads were standing in one of the bastions of a fort looking over the sea. There were neither guards nor sentinels there. The guns stood on their carriages, looking clean and ready for action, but this was not the result of care and attention, but...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3158","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
