{"id":38441,"no":4,"title":"CHAPTER IV. THE LONE INDIAN.","content":"\n “Steady, Ph?be,” murmured the stranger in a dazed, uncertain way, recognizing the voice of his faithful mare, but not realizing where he was. “Sweet Ph?be,” he whispered again, his eyes closing dreamily as the horse answered to his words with a delighted little neigh. \n \n “Out of his head,” whispered John Jerome in tones of sympathy. \n \n “He must have lain here since last evening, at least,” Ree answered, “and his horse has not moved from the spot. He had probably ridden up here to camp for the night and had not even unsaddled his mare when he was shot. We must keep our eyes wide open, old chap.” \n 53 \n \n “It is just such another sneaking murder as they told about at Pittsburg, Ree.” \n \n “You go back and bring up the cart, John. We may as well camp right here. It is the safest spot we can find, according to the old saying that ‘lightning doesn’t strike twice in the same place.’” \n \n John hurried away to carry out this suggestion, while Kingdom prepared to build a small fire, taking the precaution to dig a hole in the earth for that purpose, and covering this nearly over with strips of green bark that the flame would be concealed and not bring the Indians down upon them. \n 54 \n \n In a short time John returned with Neb and the wagon and with blankets and fur robes a comfortable bed for the wounded stranger was soon made. While one lad prepared supper, then, the other unharnessed and unsaddled their own and the Quaker’s horse and tethered them by short ropes where they might drink or graze along the bank of the stream. It was apparent that the dapple gray had eaten nothing during the long watch over its wounded master for now the animal drank and ate most greedily. \n \n A sort of broth, not unlike beef tea, was prepared from venison for the sick man and though the boys persuaded him to swallow some of it, he was still delirious and knew nothing of where he was or what had happened. \n \n A more thorough examination of the stranger’s condition revealed the fact that he had been shot through the left side, just over the heart, and either in falling or from the butt of a rifle or some similar instrument had received an ugly wound on his head, just back of his right ear. These injuries, added to the fact that his scalp had been carried off, made it quite miraculous that he was still alive. \n \n “But I have heard of men living after having been scalped,” said John. “Poor fellow!” \n 55 \n \n “It’s a bad business; but we must pull him through,” Kingdom replied with determination. “I’ll watch him and the camp till midnight or after. You get some sleep, John, while you can.” \n \n As Jerome had fully expected, though he knew it was useless to remonstrate, Ree did not call him until almost daylight. Getting up, he hitched up Neb and saddled the stranger’s horse, which came up to him with perfect gentleness when he called “Ph?be,” the name he had heard the master use. A little later he broiled some venison steaks, and then called Ree to breakfast. \n \n Theodore Hatch, if such was the stranger’s name, though the boys doubted it, had been very restless during the night. Often in his delirium he had spoken of a letter and twice had mentioned the name of Ichabod Nesbit. How so gentlemanly appearing a man could be connected with the dead robber was more than the boys could guess, though they now considered it certain that he, as well as the precious pair of rogues they had met at the Eagle tavern, had some mysterious interest in the man whom the Indian, Black Eagle, had killed. \n 56 \n \n As the stranger was still unconscious Ree and John had no fear of giving offense as they spoke of these things in his presence. Indeed, he had not the least understanding of what was taking place around him. \n \n How to continue their journey, carrying the sick man with them, was considerable of a problem for the young travelers, as their cart was already heavily loaded; but they solved the difficulty by making a pack-horse of the stranger’s mare, thus providing room under the canvas of their covered wagon to prepare a bed for the injured stranger. They raised him up and placed him upon the blankets with much effort but successfully, and before the sun was an hour high, were once more on their way. \n 57 \n \n Fifty miles ahead of them was the lonely cabin by the Cuyahoga river. A somewhat greater distance on the backward trail was Pittsburg. To the south and west almost an equal distance was the only other semblance of civilization in all the surrounding wilderness—the missionary settlement of the Moravians. \n \n Whether to take the wounded man to the latter place or back to Pittsburg or straight on to the cabin was a question the boys discussed at some length. The result was their decision to push on toward the Cuyahoga, and before nightfall they had traveled a good twelve miles. They saw no sign of an enemy during the day or the night which followed. The stranger continued insensible of all that was taking place, though he called out frequently, often speaking to his horse, his tones showing the deepest love for the animal. And the mare, pricking up her ears at every sound of her master’s voice, exhibited for him an attachment far beyond anything of the kind the boys had ever seen. \n 58 \n \n It may have been this very love the unhappy animal had for its stricken master which resulted in the mare’s giving the alarm when the two boys had almost forgotten the dangers constantly surrounding them. For suddenly, as the sun was going down in the afternoon of the second day after the discovery of the unconscious form of Theodore Hatch, when preparations were being made to camp in a convenient gully, the horse sniffed the air and snorted and neighed violently. \n \n Quick to realize that something was wrong, Kingdom leaped for his rifle, and had no more than secured the weapon when a bullet shrieked close to his shoulder and buried itself in a tree behind him. \n \n “Down, John!” Ree called, but not heeding the command, Jerome, who had gone a few rods away for water, sped forward to the camp before seeking shelter behind a tree trunk. \n \n Vigilantly both boys watched for a sight of the would-be assassin. They could see nothing but a streak of smoke curling up in the direction from which the shot had been fired. Several minutes passed, and though no sound of footsteps was heard, there came just as suddenly as before, from another direction, the crack of a rifle and a bullet speeding so near John Jerome’s head that he dropped flat on the ground. \n 59 \n \n “It looks as if we were surrounded,” said Kingdom coolly, as John called out that he was not hurt. \n \n The stranger’s dapple gray was trembling with fear, though Neb, the cart horse, was not in the least disturbed. \n \n “There’s more than just a different degree of intelligence to cause that,” whispered Kingdom, crouching behind a tree and cautiously peering out, John having called attention to the behavior of the horses. “I’ll venture to say that the Redskins around us now are the same that scalped the stranger, and the horse knows it.” \n \n No further sign of the attacking party was seen. What had become of the foe or foes neither Ree nor John could guess, and though, when the twilight had given way to dense darkness, they took turn about in making a half dozen scouting expeditions to learn if possible where the enemy was, and what might be expected from that source, no trace of savage or savages could be discovered. \n 60 \n \n Puzzled as they were, neither boy lay down to sleep that night, nor did they build a fire, whose light might make them easy targets. \n \n While it was still dark Neb was hitched up, the still unconscious stranger in the cart made as comfortable as possible, and with the first light of the dawn of another day, the young emigrants were pushing on farther and deeper into the wilds, undaunted by the night’s experience. \n \n All possible care was taken to guard against surprise, however, and with much coaxing and petting and painstaking instruction Ring, the big, yellow half-mastiff, was taught to give up the place he liked best, close beside Neb, for which horse he showed a deep friendship, and follow along a hundred yards or so in the rear. Ree went ahead an equal distance, except when it was necessary to help John clear the way of trees or logs for the cart to pass, and John himself kept a sharp lookout on either side, while driving. \n 61 \n \n So the day passed and nothing occurred further to alarm the two boys or retard their advance. But they reminded one another that they must not relax their watchfulness. \n \n They hoped and fully believed that when they reached the country about their cabin—with all the woods near which they were well acquainted, their trouble would be at an end. If Captain Pipe, the Delaware chief, were in his village, he would permit no attack to be made upon them by Big Buffalo or any other of his tribe, and there would be only the wandering Mingoes to fear. Some of these and many others the lads had traded with and knew personally. A few presents would renew their friendship, and all would be well. \n 62 \n \n Until the cabin was reached, however, there were many dangers to be reckoned with, and these were increased by the fact that they were trying to save the life of the, to them, almost unknown man, who might have enemies they knew not of, and who could not help them one bit, while positively delaying their progress by adding to their load and the care with which they must travel, on his account. \n \n Camp was made, the evening following the mysterious attack, in the center of a considerable open space, nearly bare of trees, which may have been at one time an Indian corn field. The horses were picketed close to the wagon and a defense of brush and small logs was built to a height of a few feet all about the cart. The wagon’s contents were then so arranged that the wounded man, who, though still delirious, seemed to be gaining in strength, was protected from stray bullets by boxes and other articles piled at either side of him. \n \n “It seems actually foolish to go to all this trouble,” was Ree Kingdom’s comment as he surveyed the completed task. \n \n Bang!—pr-r-r-r-s-s-st! A bullet whizzed through the low breast-works and flattened itself on the iron tire of the cart, close to John’s left elbow. \n 63 \n \n “Look! There he goes!” cried young Jerome, and leveled his rifle at an Indian who leaped from tree to tree with most astonishing speed, traveling in a circle about the camp at a distance of eighty or ninety yards, loading his rifle as he ran, with the greatest dexterity. \n \n In another moment, as he thought the chance was favorable, John fired. A second later Kingdom also let drive, but all to no purpose, for the next second there came from the side of the camp opposite that from which the first bullet had flown, another to keep it company, splitting a spoke in one of the cart’s wheels. \n \n No sooner had he fired this second time than the Indian disappeared in the depths of the woods. \n \n “Land o’ Goshen! What does the Redskin mean?” exclaimed John, as both boys saw him fleeing away. \n \n “He’s the same fellow that fired at us last night. Look how nervous this poor mare is. That proves it if nothing else does,” answered Kingdom, boldly rising from behind the brush-work defenses, and patting the terror-stricken horse of the stranger. \n 64 \n \n “And did you see him run?” John added. “I’ve heard people talk of horses going like a streak of lightning, but I never saw anything on legs get over the ground the way that buck did. I wonder, now, how long he intends keeping up this game!” \n \n Before Ree could answer the voice of Theodore Hatch was heard loudly calling, “Nay, do not shoot! Thou art my friend. Hast thou the letter, Ichabod—Ichabod Nesbit?” \n \n They were the most connected and intelligible words the stranger had uttered, though often in his unconsciousness he had called out, but usually in a disconnected, incomprehensible way. \n \n “Ichabod, dost thou not know me? Thou art not dead, Ichabod! Ah, I was deceived. They told me thou wert killed by an Indian in the forest.” \n 65 \n \n The boys looked questioningly one to the other. Their thoughts ran back to the frayed letter the men at the Eagle tavern had had, and back farther still to the death of Ichabod Nesbit at the hands of Black Eagle. \n \n “I believe he is better,” said Kingdom, referring to the stranger. “His brain is clearer, though he doesn’t know anything. I’ll fix him up some fresh medicine.” \n \n By turns the two boys slept and watched the long night through. As before, the mysterious enemy gave no further trouble after twice firing upon the camp, and another day came and passed without incident. \n \n Fearful of a repetition of the attack of the two preceding evenings, the young travelers made camp early this day that they might make a more secure defense than before, ere nightfall. This work they completed to their satisfaction while the sun was still shining. \n \n The rise of ground on which they had halted gave them an advantage over their foe which they had not had before. Impatiently they watched and waited for the expected appearance of the lone savage. \n 66 \n \n “The third time’s the charm, they say,” remarked John, with an uneasy little laugh. “I believe we will get him or he will get us, this time.” \n \n Kingdom did not answer, and the minutes slipped slowly by. The sun was just disappearing from view, like an immense ball of red among the western trees, when the Indian came. \n \n Both boys caught sight of him at the same moment, standing on a hill-top across a rugged little valley from themselves, quietly surveying them. As he was between them and the fading light, they saw his face, painted a bright red, and his buckskin clad figure most distinctly; and both were certain that a belt which hung loose about his waist was adorned with human scalps. \n \n For several seconds the young savage stood gazing vacantly toward the lads. Then he saw that he was observed. Quick as magic, and as mysteriously, he disappeared. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2695/74082.html","bookId":1463,"book":{"id":1463,"title":"Connecticut Boys in the Western Reserve","description":"简介： A dismally wet and cold September day had come early to a close and thick darkness had settled down an hour since, when the horse attached to a heavy, canvas-covered, two-wheeled emigrant wagon stopped, at its drivers command, before an inhospitable...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2695","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
