{"id":13302,"no":3,"title":"CHAPTER II. AT CHELTENHAM.","content":"\"Everything packed and ready, boys?\" \"Yes, father, I think so.\" \"The dog-cart will be at the door at eleven. Be sure and be ready in time. It won\u0027t do to miss your train, you know. Well, you have had a pleasant holiday this time, haven\u0027t you?\" \"Very,\" both boys replied together. \"It has been awfully jolly,\" one went on, \"and that trip in Brittany was certainly the best thing we have done, though we have always enjoyed our holidays. It is ever so much nicer going to out-of-the-way sort of places, and stopping at jolly little inns without any crowd and fuss, than being in those great Swiss hotels as we were last year, where every one was English, and one had to be in at regular times and almost fight to get something to eat. I hope next year you will be able to take us to Norway, as you were saying yesterday. I[Pg 28] should think it would be just the same sort of thing as Brittany, only, of course, different sort of scenery, and different language and different people. Madge, you will have to set to and get up Norse to act as our interpreter.\" \"You are very lazy boys. I had to do all the talking in Brittany. You are supposed to have learnt French longer than I have.\" \"Oh, yes; supposed. Nobody cares about their French lessons. They make no difference in your place in the school, and so no one takes the trouble to grind at them. Well, come along, let us take a turn round the place for an hour before we start.\" And the two boys and Madge, who was a year their junior, went out through the French window into the garden. Captain Clinton walked to the window and looked after them. They were lads any father might be proud of, straight, well-built, handsome English lads of about sixteen. Rupert was somewhat taller than Edgar, while the latter had slightly the advantage in breadth of shoulders. Beyond the fact that both had brown hair and gray eyes there was no marked likeness between them, and their school-fellows often wondered that there should not be more similarity between twins. Both had pleasant open faces, and they were equally popular among their school-fellows. As to which was the cleverest, there were no means of ascertaining; for although both were at Cheltenham together, one was on the modern and the other on the classical side, Captain Clinton having made this arrangement purposely in order that there should be no rivalry between them, and the unpleasantness that sometimes arises when two brothers are at the same school, and one is more clever than the other, was thereby obviated. Rupert was the more lively of the two, and generally did the largest share of talking when they were together; but Edgar, although he talked less, had the more lively sense of humour, and the laughter that broke out in the garden was caused by some quiet remark of his. Captain Clinton turned sharply round upon hearing a sigh from his wife.[Pg 29] \"Well, Lucy, I know what you are thinking: another holiday over, and we are no nearer to the truth. I own that our plan has failed so far, for I can\u0027t see in either of the boys a shadow of resemblance either to you or myself. Some people profess to see likenesses. Mr. Tomline remarked yesterday that he should have known Rupert anywhere as my son, but then Colonel Wilson said the day before that Edgar had got just your expression. I don\u0027t see a scrap of likeness either way, and I begin to think, dear, that I don\u0027t want to see it.\" \"No, I don\u0027t want to see it either, Percy; I love one as well as the other. Still I should like to know which is our own.\" \"I used to think so too, Lucy; but I have been doubting for some time about it, and now I am quite sure that I don\u0027t want to know. They are both fine lads, and, as you say, we love one just as well as the other. Parental instinct, you see, goes for nothing. I should like to know that one of them was my son, but on the other hand I should be very sorry to know that the other wasn\u0027t. I think, dear, that it is much better as it is. We have got two sons instead of one; and after all, the idea that there would be a great satisfaction in the real one inheriting all our landed property has very little in it. There is plenty for them both, and each of them will be just as happy on three thousand a year as he would on six. \"As matters stand now, I have divided the property as nearly as possible equally between them. Madge, of course, will have her share; and I have left it in my will that they shall draw lots which shall have the part with the house and park on it, while the other is to have a sum of money sufficient to build an equally good house on his share of the estate. We can only hope that chance will be wiser than we, and will give the old house to the right boy. However, whether our son or our adopted son, whichever be which, gets it, does not concern me greatly. There is enough for our son to hold a good position and be comfortable and happy. Beyond this I do not trouble. At any rate the grievance, if there is a grievance, is a sentimental[Pg 30] one; while it would be a matter of real grief to me should either of them, after having always looked upon us as his parents, come to know that he does not belong to us, and that he has been all along in a false position, and has been in fact but an interloper here. That would be terribly hard for him—so hard that I have ceased to wish that the matter should ever be cleared up, and to dread rather than hope that I should discover an unmistakable likeness to either of us in one or other of them.\" \"You are right, Percy; and henceforth I will worry no more about it. It would be hard, dreadfully hard, on either of them to know that he was not our son; and henceforth I will, like you, try to give up wishing that I could tell which is which. I hope they will never get to know that there is any doubt about it.\" \"I am afraid we can hardly hope that,\" Captain Clinton said. \"There are too many people who know the story. Of course it was talked about at every station in India at the time, and I know that even about here it is generally known. No, it will be better some day or other to tell it them ourselves, making, of course, light of the matter, and letting them see that we regard them equally as our sons, and love and care for them alike, and that even if we now knew the truth it could make no difference in our feelings towards them. It is much better they should learn it from us than from anyone else.\" At eleven o\u0027clock the dog-cart came to the door. The boys were ready. Captain Clinton drove them to the station four miles away, and in two hours after leaving home they arrived at Cheltenham with a large number of their school-fellows, some of whom had been in the train when they entered it, while others had joined them at Gloucester. At Cheltenham there was a scramble for vehicles, and they were soon at the boarding-house of Mr. River-Smith, which had the reputation of being the most comfortable of the Cheltenham boarding-houses.[Pg 31] There was a din of voices through the house, and in the pleasure of meeting again and of exchanging accounts of how the holidays had been spent, the few lingering regrets that school-time had come round again completely vanished. Then there was a discussion as to the football prospects and who would get their house colours in place of those who had gone, and whether River-Smith\u0027s was likely to retain the position it had won by its victories over other houses in the previous season; and the general opinion was that their chances were not good. \"You see,\" Skinner, the captain of the team, said to a party gathered in the senior boys\u0027 study, \"Harrison and White will be better than last year, but Wade will of course be a great loss; his weight and strength told tremendously in a scrimmage. Hart was a capital half-back too, and there was no better goal-keeper in the college than Wilson. We have not got any one to take their places, and there are four other vacancies in the team, and in each case those who have left were a lot bigger and stronger than any of the young ones we have got to choose from. I don\u0027t know who they will be yet, and must wait for the trial matches before we decide; but I think there is plenty of good material to choose from, and we shall be nearly all up to last year\u0027s mark, except in point of weight—there is a terrible falling off there, and we have no one who can fill the place of Wade. He was as strong as a bull; yes, he is an awful loss to us! There was not a fellow in the college who could go through a grease as he could. You remember last year how he rolled those fellows of Bishop\u0027s over and carried the ball right through them, and then kicked the deciding goal? That was grand! Why don\u0027t some of you fellows grow up like him?\" And he looked round reproachfully at his listeners. \"Over thirteen stone Wade was, and there is not one of you above eleven and a half—anyhow, not more than a few pounds.\" \"Why don\u0027t you set us an example?\" Edgar Clinton asked;[Pg 32] and there was a laugh, for the captain of the team was all wire and muscle and could not turn ten stone. \"I am not one of that kind,\" he said; \"but there is Wordsworth, who is pretty near six feet in length, and who, if he gave his mind to it and would but eat his food quietly instead of bolting it, might put some flesh on those spindle-shanks of his and fill himself out till he got pretty near to Wade\u0027s weight. A fellow ought to do something for his house, and I call it a mere waste of bone when a fellow doesn\u0027t put some flesh on him.\" \"I can run,\" Wordsworth said apologetically. \"Yes, you can run when you get the ball,\" Skinner said in a tone of disgust; \"but if a fellow half your height runs up against you, over you go. You must lay yourself out for pudding, Wordsworth. With that, and eating your food more slowly, you really might get to be of some use to the house.\" Wordsworth grumbled something about his having done his share last year. \"It all depends what you think your share is,\" Skinner said severely. \"You did your best, I have no doubt, and you certainly got a good many goals, but that arose largely from the fact that there was nothing tangible in you. You see, you were something like a jointed walking-stick, and, naturally, it puzzled fellows. You have grown wider a bit since then, and must therefore try to make yourself useful in some other line. What we want is weight, and the sooner you put weight on the better. I see Easton has not come yet.\" \"He never comes until the evening train,\" another said. \"He always declares it has something to do with cross lines not fitting in.\" \"It takes him so long,\" Skinner growled, \"to fold up his things without a crease, to scent his pocket-handkerchief, and to get his hair to his satisfaction, that you may be quite sure he cannot make an early start. As he is not here, and all the rest that are left out of last year\u0027s team are, it is a good[Pg 33] opportunity to talk him over. I did not like having him in the team last year, though he certainly did better than some. What do you think? Ought we to have him this year or not? I have been thinking a lot about it.\" \"I don\u0027t care for him,\" Scudamore said, \"but I am bound to say he does put off all that finicking nonsense when he gets his football jersey on, and plays a good, hard game, and does not seem to mind in the least how muddy or dirty he gets. I should certainly put him in again, Skinner, if I were you.\" There was a murmur of assent from three or four of the others. \"Well, I suppose he ought to play,\" Skinner said; \"but it does rile me to see him come sauntering up as if it was quite an accident that he was there, and talk in that drawling, affected sort of way.\" \"It is riling,\" another said; \"but besides that I do not think there is much to complain about him, and his making an ass of himself at other times does not affect us so long as he plays well in the team.\" \"No, I do not know that it does, but all the same it is a nuisance when one fellow keeps himself to himself and never seems to go in for anything. I do not suppose Easton means to give himself airs, but there is nothing sociable about him.\" \"I think he is a kind-hearted fellow,\" Edgar Clinton said, speaking, however, with less decision than usual, as became one who was not yet in the first form. \"When young Jackson twisted his ankle so badly last term at the junior high jump, I know he used to go up and sit with him, and read with him for an hour at a time pretty near every day. I used often to wish I could manage to get up to him, but somehow I never could spare time; but Easton did, though he was in the college four and was working pretty hard too. I have known two or three other things he has done on the quiet. I don\u0027t care for his way of dressing nor for his drawling way of talking, in fact, I don\u0027t care for him at all personally; but he is a good-natured fellow in spite of his nonsense.\"[Pg 34] \"Well, then, we must try him again,\" Skinner said, \"and see how he does in the trial matches. There is no certainty about him, that is what I hate; one day he plays up and does uncommonly well, then the next day he does not seem to take a bit of interest in the game.\" \"I have noticed several times,\" Scudamore said, \"that Easton\u0027s play depends very much on the state of the game: if we are getting the best of it he seems to think that there is no occasion to exert himself, but if the game is going against us he pulls himself together and goes into it with all his might.\" \"He does that,\" Skinner agreed; \"that is what riles me in the fellow. He can play a ripping good game when he likes, but then he does not always like. However, as I said, we will give him another trial.\" Half an hour later the subject of the conversation arrived. He was in the first form on the classical side, and was going up at the next examination for Sandhurst. Easton was one of the monitors, but seldom asserted his authority or put himself out in any way to perform the duties of the office. He was dressed with scrupulous care, and no one from his appearance would have said that he had just come off a railway journey. He nodded all round in a careless way as he came in, and there was none of the boisterous friendliness that had marked the meeting of most of the others. \"Affected ass!\" Skinner growled to Rupert who was next to him. \"You are a prejudiced beggar, Skinner,\" Rupert laughed. \"You know very well he is not an ass, and I am not at all sure he is affected. I suppose it is the way he has been brought up. There is no saying what you might have been yourself if you had had nurses and people about you who always insisted on your turning out spick-and-span. Well, Easton, what have you been doing with yourself since we saw you last?\" \"I have been on the Continent most of the time,\" Easton said, in the quiet, deliberate tone that was so annoying to[Pg 35] Skinner. \"Spent most of the time in Germany: had a week at Munich, and the same time in Dresden doing the picture-gallery.\" \"That must have been a treat,\" Skinner said sarcastically. \"Yes, it was very pleasant. The worst of it is, standing about so long makes one\u0027s feet ache.\" \"I wonder you did not have a bath-chair, Easton; delicate people go about in them, you know.\" \"It would be a very pleasant way, Skinner, only I don\u0027t think I could bring myself to it.\" There was a laugh at his taking Skinner\u0027s suggestion seriously. \"What have you been doing, Skinner?\" \"I have been up in Scotland climbing hills, and getting myself in good condition for football,\" Skinner replied shortly. \"Ah, football? Yes, I suppose we shall be playing football this term.\" There was another laugh, excited principally by the angry growl with which Skinner greeted this indifference to what was to him the principal feature of the year. \"I shouldn\u0027t mind football,\" Easton went on, after looking round as if unable to understand what the others were laughing at, \"if it wasn\u0027t for the dirt. Of course it is annoying to be kicked in the shins and to be squeezed horribly in the greases, but it is the dirt I object to most. If one could but get one\u0027s flannels and jerseys properly washed every time it would not matter so much, but it is disgusting to have to put on things that look as if they had been rolled in mud.\" \"I wonder you play at all, Easton,\" Skinner said angrily. \"Well, I wonder myself sometimes,\" Easton said placidly. \"I suppose it is a relic of our original savage nature, when men did not mind dirt, and lived by hunting and fighting and that sort of thing.\" \"And had never learned the nuisance of stiff shirts and collars, and never heard of such a thing as a tailor, and did not[Pg 36] part their hair in the middle, Easton, and had never used soap,\" Skinner broke in. \"No; it must have been beastly,\" Easton said gravely. \"I am very glad that I did not live in those days.\" \"Ah, you would have suffered horribly if you had, wouldn\u0027t you?\" \"Well, I don\u0027t know, Skinner; I suppose I should have done as other people did. If one does not know the comfort of a wash and a clean shirt, one would not miss it, you see. I have sometimes thought—\" \"Oh, never mind what you thought,\" Skinner broke in out of all patience. \"Come, let us go for a walk; it is no use stopping here all this fine afternoon. Let us take a good long spin. I can see half you fellows are out of condition altogether, and the sooner we begin work the better. Will you come, Easton? After lolling about looking at pictures a twelve-mile spin will do you good.\" \"Thank you, Skinner; I don\u0027t know that I want any good done to me. I should not mind a walk, if it is to be a walk; but a walk with you generally means rushing across ploughed fields and jumping into ditches, and getting one\u0027s self hot and uncomfortable, and splashing one\u0027s self from head to foot. It is bad enough in flannels, but it is downright misery in one\u0027s ordinary clothes. But I don\u0027t mind a game at rackets, if anyone is disposed for it.\" \"I will play you,\" Mossop said. \"I want to get my hand in before the racket matches come off.\" So they went and put on their flannels and racket shoes, while the rest of the party started for a long walk with Skinner. \"I am glad he has not come,\" the football captain said as they started; \"he drives me out of all patience.\" \"I don\u0027t think you have much to drive out of you, Skinner,\" Rupert Clinton laughed. \"I believe Easton puts about half of it on, on purpose to excite you. I am sure just now I saw a little amusement in his face when he was talking so gravely.\"[Pg 37] \"He will find he has got in the wrong box,\" Skinner said angrily, \"if he tries to chaff me.\" A quiet smile was exchanged among the others, for Easton was tall and well built and had the reputation of being the best boxer in the school; and although Skinner was tough and wiry, he would have stood no chance in an encounter with him. \"Well, how did you get on, Mossop?\" Scudamore asked as they sat down to tea. \"Easton beat me every game. I had no idea that he was so good. He says he does not intend to play for the racket, but if he did he would have a first-rate chance. I was in the last ties last year and I ought to have a good chance this, but either I am altogether out of practice or he is wonderfully good. I was asking him, and he said in his lazy way that they had got a decent racket-court at his place, and that he had been knocking the balls about a bit since he came home.\" \"If he is good enough to win,\" Pinkerton, the captain of the house, said, \"he ought to play for the honour of the house. He has never played in any matches here before. I did not know he played at all.\" \"That is the way with Easton,\" Edgar Clinton said; \"he is good all round, only he never takes trouble to show it. He could have been in the college cricket eleven last year if he liked, only he said he could not spare the time. Though Skinner doesn\u0027t think so, I believe he is one of the best in our football team; when he chooses to exert himself he is out and out the best chess player in the house; and I suppose he is safe to pass in high for Sandhurst.\" \"He is a queer fellow,\" Pinkerton said, \"one never knows what he can do and what he can\u0027t. At the last exam Glover said that the papers he sent in were far and away the best, but that he had only done the difficult questions and hadn\u0027t sent in any answers at all to the easy ones, so that instead of coming in first he was five or six down the list. I believe myself he did not want to beat me, because if he had he would have[Pg 38] been head of the house, and that would have been altogether too much trouble for him. Glover wanted him to go up for the last Indian Civil, and told him he was sure that he could get in if he tried, but Easton said he wasn\u0027t fond of heat and had no fancy for India.\" \"I suppose he was afraid to take the starch out of his collars,\" Edgar laughed. \"Ah! here he is; late as usual.\" Easton strolled quietly in and took his place, looking annoyingly fresh and clean by the side of those who had accompanied Skinner on his walk, and who, in spite of vigorous use of clothes brushes, showed signs of cross-country running. \"Have you had a pleasant walk?\" he asked calmly. \"Very pleasant,\" Skinner said, in a tone that defied contradiction. \"A delightful walk; just the thing for getting a little into condition.\" There was a murmur of assent among the boys who had accompanied him, but there was no great heartiness in the sound; for indeed Skinner had pressed them all to a much higher rate of speed than was pleasant in their ordinary clothes, although they would not have minded it in flannels. \"You all look as if you had enjoyed it,\" Easton said, regarding them one by one with an air of innocent approval; \"warmed yourselves up a bit, I should say. I remark a general disappearance of collars, and Rupert Clinton\u0027s face is scratched as if he had been having a contest with some old lady\u0027s cat.\" \"I went head-foremost into a hedge,\" Rupert laughed. \"My foot slipped in the mud just as I was taking off, and I took a regular header into it.\" \"And what is the matter with your hand, Wordsworth?\" \"A beast of a dog bit me. We were going across a field, and the brute came out from a farmhouse. My wind had gone, and I happened to be last and he made at me. Some fool has written in a book that if you keep your eyes fixed upon a dog he will never bite you. I fixed my eye on him like a gimlet but it did not act, and he came right at me and sprang at[Pg 39] me and knocked me down and got my hand in his mouth, and I don\u0027t know what would have happened if Skinner hadn\u0027t pulled a stick out of the hedge, and rushed back and hit him such a lick across the back that he went off yelping. Then the farmer let fly with a double-barrelled gun from his garden; but luckily we were pretty well out of reach, though two or three shots hit Scudamore on the cheek and ear and pretty nearly drew blood. He wanted to go back to fight the farmer, but as the fellow would have reloaded by the time he got there, and there was the dog into the bargain, we lugged him off.\" \"Quite an adventurous afternoon,\" Easton said in a tone of cordial admiration, which elicited a growl from Skinner. \"You wish you had been with us, don\u0027t you?\" he said, with what was meant to be a sneer. \"No, rackets was quite hard work enough for me; and I don\u0027t see much fun in either taking a header into a hedge, being bitten by a farmer\u0027s dog, or being peppered by the man himself. Still, no doubt these things are pleasant for those who like them. What has become of Templar?\" \"He fell into a ditch,\" Wordsworth said; \"and he just was in a state. He had to go up to the matron for a change of clothes. He will be here in a minute, I expect.\" \"Quite a catalogue of adventures. If I had known beforehand that there was going to be so much excitement I might have been tempted to go with you. I am afraid, Mossop, I have kept you out of quite a good thing.\" \"There, shut up Easton!\" Pinkerton said, for he saw that Skinner was at the point of explosion; \"let us have peace and quiet this first night. You have got the best of it, there is no doubt. Skinner would admit that.\" \"No I wouldn\u0027t,\" Skinner interrupted. \"Never mind whether you would or not, Skinner, it clearly is so. Now, let us change the conversation. For my part I cannot make out why one fellow cannot enjoy football and that sort of thing, and another like to lie on his back in the shade,[Pg 40] without squabbling over it. If Skinner had his own way he would never sit quiet a minute, if Easton had his he would never exert himself to walk across the room. It is a matter of taste. I like half and half, but I do not want to interfere with either of your fancies. Now, it is about time to set to work. I expect there are a good many holiday tasks not perfect.\" There was a chorus of assent, and the senior boys went off to their private studies, and the juniors to the large study, where they worked under the eye of the house-master. Skinner\u0027s mournful anticipations as to the effect of the want of weight in the football team were speedily verified. The trial matches were almost all lost, the team being fairly borne down by the superior weight of their opponents. There was general exasperation at these disasters, for River-Smith\u0027s House had for some years stood high, and to be beaten in match after match was trying indeed. Skinner took the matter terribly to heart, and was in a chronic state of disgust and fury. As Easton observed to Edgar Clinton: \"Skinner is becoming positively dangerous. He is like a Scotch terrier with a sore ear, and snaps at every one who comes near him.\" \"Still it is annoying,\" Edgar, who thoroughly sympathized with Skinner, said. \"Well, yes, it is annoying. I am annoyed myself, and it takes a good deal to annoy me. I think we ought to do some thing.\" \"Well, it seems to me that we have been doing all we can,\" Edgar said. \"I am sure you have, for it was only yesterday Skinner was holding you up as an example to some of us. He said, \u0027You ought all to be ashamed of yourselves. Why, look at that lazy beggar Easton, he works as hard as the whole lot of you put together. If it was not for him I should say we had better chuck it altogether.\u0027\" \"I observe that Skinner has been a little more civil to me lately,\" Easton said. \"Yes, I do my best. I object to the whole[Pg 41] thing, but if one does play one does not like being beaten. I think we had better have a talk over the matter together.\" \"But we are always talking over the matter,\" Edgar objected. \"All the fellows who had a chance of turning out well have been tried, and I am sure we play up well together. Every one says that we are beaten just because we cannot stand their rushes.\" That afternoon the house was badly beaten by the Greenites in the trial match, and as there was a special rivalry between Green\u0027s and River-Smith\u0027s the disgust not only of the members of the team but of the whole house was very great. Seven of the seniors met after tea in Skinner\u0027s study to discuss the situation. \"I don\u0027t see any thing to be done,\" Skinner said, after various possible changes in the team had been discussed; \"it is not play we want, it is weight. The Greenites must average at least a stone and a half heavier than we do. I have nothing to say against the playing. We simply cannot stand against them; we go down like nine-pins. No, I suppose we shall lose every match this season. But I don\u0027t see any use in talking any more about it. I suppose no one has anything further to suggest.\" \"Well, yes, I have a few words to say,\" Easton, who had been sitting on the table and had hitherto not opened his lips, remarked in a quiet voice. \"Well, say away.\" \"It seems to me,\" Easton went on without paying any regard to the snappishness of Skinner\u0027s tone, \"that though we cannot make ourselves any heavier, weight is not after all the only thing. I think we might make up for it by last. When fellows are going to row a race they don\u0027t content themselves with practice, they set to and train hard. It seems to me that if we were to go into strict training and get ourselves thoroughly fit, it ought to make a lot of difference. We might lose goals in the first half of the play, but if we were in good[Pg 42] training we ought to get a pull in the second half. By playing up all we knew at first, and pumping them as much as possible, training ought to tell. I know, Skinner, you always said we ought to keep ourselves in good condition; but I mean more than that, I mean strict training—getting up early and going for a three or four mile run every morning, taking another run in the afternoon, cutting off pudding and all that sort of thing, and going in for it heart and soul. It is no use training unless one does a thing thoroughly.\" \"Well, one could but try,\" Skinner said. \"There is no reason why one shouldn\u0027t train for football just as one does for rowing or running. You are the last fellow I should have expected to hear such a proposal from, Easton, but if you are ready to do it I am sure every one else will be.\" There was a cordial exclamation of assent from the others. \"Well, of course it will be a horrible nuisance,\" Easton said regretfully; \"but if one does go in for a thing of this sort it seems to me that it must be done thoroughly. And besides, it is very annoying just at the ticklish point of a game, when you would give anything to be able to catch the fellow ahead of you with the ball, to find that your lungs have given out, and that you haven\u0027t a cupful of wind left.\" \"I believe, Easton, that you are a downright humbug,\" Scudamore said; \"and that while you pretend to hate anything like exertion, you are just as fond of it as Skinner is.\" \"Well, at any rate,\" Skinner broke in, \"we will try Easton\u0027s suggestion. From to-night the team shall go into strict training. I will see River-Smith now and get leave for us to go out at six o\u0027clock every morning. We will settle about the afternoon work afterwards. Of course pudding must be given up, and there must be no buying cakes or things of that sort. New bread and potatoes must be given up, and we must all agree never to touch anything to drink between meals. We will try the thing thoroughly. It will be a month before we play our next match with Green\u0027s. If we can but beat them[Pg 43] I do not care so much about the others. There are two or three houses we should have no chance with if we were to train as fine as a university eight.\" The rest of the team were at once informed of the determination that had been arrived at. Had it emanated only from Skinner several of the members might have protested against the hardship of going into training for football, but the fact that Easton had proposed it weighed with them all. If he was ready to take such trouble over the matter no one else could reasonably object, and the consequence was that, although not without a good deal of grumbling at being got up before daylight, the whole team turned out in their flannels and two thick jerseys punctually at six o\u0027clock. \"Here is an egg and half cupful of milk for each of you,\" Skinner said as they gathered below. \"Look sharp and beat up your egg with the milk. Here is a mouthful of biscuit for each. River-Smith said he did not like our going out without taking something before we started, and Cornish, who rowed in the trials at Cambridge, told me that egg and milk was the best thing to take.\" Five minutes later, comforted by the egg and milk, the party started. \"We don\u0027t want to go at racing speed,\" Skinner said; \"merely a good steady trot to make the lungs play. We don\u0027t want to pull ourselves down in weight. I don\u0027t think, after the last month\u0027s work, we have any fat among us. What we want is wind and last. To-morrow we will turn out with the heaviest boots we have got instead of running shoes. When we can run four miles in them, we ought to be able to keep up pretty fairly through the hardest game of football.\" There was a good deal of lagging behind towards the last part of the run, a fact that Skinner pointed out triumphantly as a proof of want of condition, but after a wash and change of clothes all the party agreed that they felt better for the run.[Pg 44] Mr. River-Smith was as much concerned as the boys at the defeats of the house at football, and when they sat down to breakfast the members of the team found that a mutton-chop was provided for each of them. Strict orders had been issued that nothing was to be said outside the house of the football team going into training; and as, for the afternoon\u0027s exercise, it was only necessary that every member of the team should take part in football practice, and play up to the utmost, the matter remained a secret. In the first two or three matches played the training made no apparent difference. \"You must not be disheartened at that,\" Mr. Cornish, who was the \"housemaster,\" told them. \"Fellows always get weak when they first begin to train. You will find the benefit presently.\" And this was the case. They won the fourth match, which was against a comparatively weak team. This, however, encouraged them, and they were victorious in the next two contests, although in the second their opponents were considered a strong team, and their victory had been regarded as certain. The improvement in the River-Smithites\u0027 team became a topic of conversation in the college, and there were rumours that they had put themselves into regular training, and that some one had seen them come in in a body at seven in the morning after having been for a run. The challenge cup matches were now at hand, and as it happened they were drawn to meet the Greenites, and the match was regarded with special interest throughout the school. The rivalry between the two houses was notorious, and although the Greenites scoffed at the idea of their being defeated by a team they had before so easily beaten, the great improvement the latter had made gave promise that the struggle would be an exceptionally severe one. Skinner had for some days before looked after the team with extreme vigilance, scarcely letting one of them out of his sight, lest they might eat forbidden things, or in other ways transgress the rules laid down.[Pg 45] \"We may not win,\" he admitted, as they talked over the prospect on the evening before the match, \"but at any rate they will have all their work cut out to beat us. I know they are very confident, and of course their weight is tremendously in their favour. Now, mind, we must press them as hard as we can for the first half the game, and never leave them for a single moment. They are sure to get savage when they find they have not got it all their own way, and that will help to pump them. We shall have more left in us the second half than they will, and then will be our chance.\" These tactics were followed out, and from the first the game was played with exceptional spirit on both sides; and as the Greenites failed, even by the most determined rushes, to carry the ball into their opponents\u0027 goal, the game became, as Skinner had predicted, more and more savage. The sympathies of the school were for the most part with River-Smith\u0027s, and the loud shouts of applause and encouragement with which their gallant defence of their goal was greeted, added to the irritation of the Greenites. When the half-play was called neither party had scored a point, and as they changed sides it was evident that the tremendous pace had told upon both parties. \"Now is our time,\" Skinner said to his team; \"they are more done than we are, and our training will tell more and more every minute. Keep it up hard, and when we see a chance make a big rush and carry it down to their end.\" But the Greenites were equally determined, and in spite of the efforts of their opponents, kept the ball at their end of the field. Then Skinner got it and made a rush. One of the heaviest of the Greenites charged down upon them at full speed, but was encountered by Easton before he reached him, and the two rolled over together. The River-Smithites backed up their leader well, and he was more than half-way down the ground before the Greenites had arrested his progress. Then there was a close scrimmage, and for a time the mass swayed[Pg 46] backwards and forwards. But here weight counted for more than wind, and the Greenites were pushing their opponents back when the ball rolled out from the mass. Edgar Clinton picked it up, and was off with it in a moment, dodging through those who attempted to check his course. He was down near the Greenites\u0027 goal before two of them threw themselves upon him together; but his friends were close behind, and after a desperate scrimmage the ball was driven behind the Greenite goal. Some loose play followed, and a Greenite who had the ball threw it forward to one of his own team, who caught it and started running. The River-Smithites shouted \"Dead ball!\" \"Dead ball!\" and claimed the point; but the holder of the ball, without heeding the shouts, ran right through followed by the rest of his team, and touched down behind the River-Smith goal. The ball was then brought out and a goal kicked. All this time the River-Smithites had not moved from behind the Greenite goal, but had remained there awaiting the result of their appeal to the umpire, who now at once decided in their favour. Not satisfied with this the Greenites appealed to the referee, who confirmed the decision of the umpire. Too angry to be reasonable, the captain refused to continue the game, and called upon his team to leave the field. They were going, when the derisive shouts of the lookers-on caused them again to alter their intentions, and the game was renewed. There were ten minutes yet remaining, and for that time the game was played with a fury that caused it to be long memorable in the annals of Cheltenham football. But weight and strength could not prevail over the superior last and coolness of the defenders of the River-Smith goal. Every attempt was beaten off, every rush met, and as no point had been added to the score when time was called, the umpire decided that the game had been won by the River-Smithites by one touch down to nothing. The captain of the Greenites appealed from the umpire\u0027s and referee\u0027s decision to the football committee of[Pg 47] the college, who gave it against him, and he then appealed to the Rugby union, who decided that the umpire\u0027s decision was perfectly right, and the victory thus remained beyond further contention with the River-Smithites.","sourceLink":"http://novel.tingroom.com/duanpian/3124/85915.html","bookId":900,"book":{"id":900,"title":"The Dash for Khartoum","description":"简介： The story of the Nile Expedition is so recent that no word of introduction is necessary to the historical portion of the tale. The moral, such as it is, of the story of the two lads brought up as brothers isNever act in haste, for repentance is sure...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3124","creation":"Aug 1, 2019 12:23:50 AM","modification":"Aug 1, 2019 12:23:50 AM"}}
