{"id":40005,"no":24,"title":"CHAPTER TWENTY-THREE","content":"FREE SILVER, THE SPANISH WAR, AND IMPERIALISM The three great final battles of Godkin’s editorship were those against the free silver craze, the Spanish War, and the retention of the Philippines. The first was decisively won, but the decisive loss of the other two cast a shadow over Mr. Godkin’s last days. “American ideals were the intellectual food of my youth, and to see America converted into a senseless, Old World conqueror, embitters my age,” he wrote a friend in May, 1899. In all three struggles the Evening Post took the same aggressive leadership as in the Mugwump campaigns against Blaine and in Godkin’s fifteen years of war upon Tammany. The portents of the free silver uprising first became alarming to the Evening Post in 1890. The Sherman Silver Purchase Act of that year it roundly attacked, and Horace White and the other editors always regarded it as the chief cause of the panic of 1893. As he pointed out, it added nearly $200,000,000 to the fiat money of the country, alarmed men at home and abroad regarding the ability of the United States to redeem its obligations in gold upon demand, caused the steady withdrawal of capital from the country, and decreased business confidence and increased money rates until failures took place on every hand. The Post’s detestation of the Sherman Act was increased by the fact that it was passed by a nefarious combination of silver men and supporters of the McKinley Tariff, a measure which the Post equally abominated. For some years in the nineties the silver danger seemed the greater because Republicans flirted with it as coyly as Democrats. In 1894 both Speaker Reed and Senator Lodge proposed to force silver upon the world by high discriminating tariffs against nations497 which refused to adopt bimetallism. Lodge, in fact, left the Evening Post aghast by introducing a demagogic resolution in the Senate for applying this policy against England. Late in 1894 the reception given “Coin’s Financial School” showed how irresistibly the free silver question was thrusting itself into the political foreground. This famous pamphlet, by W. H. Harvey, related how a “smooth little financier” of Chicago named Coin, struck by the rural distress and business depression, opened a school of finance in the Art Institute in May, 1894. His lectures and colloquies continued six days. At first only young men were present, but the audience increased until it included statesmen, professors, bank presidents, and others of note, many of them—as Lyman J. Gage and J. Laurence Laughlin—designated by name. When they interrupted Coin, he quickly silenced them by his incisive logic and superior knowledge. In the end, completely converted, the company tendered him a glittering reception at the Palmer House. The pamphlet was illustrated by coarse woodcuts. One showed silver a beautiful woman decapitated by her enemies; another depicted America as a cow which the farmers were laboriously feeding while a fat capitalist milked her; a third represented the gold standard by a man hobbling on one leg. Coin had made the utmost of his ability to ask the questions as well as answer them. As Horace White said, his discussion with Prof. Laughlin was equaled by nothing save the debate in Rabelais upon the question whether a chimera ruminating in a vacuum devoureth second intentions. The booklet was full of deceptive analogies. For example, when asked if Government coinage of depreciated silver would really make it worth a dollar in gold, Coin replied: “Certainly; if the Government bought 100,000 horses, wouldn’t the price go up?” This retort was set off with a woodcut of a horse. No man in the country, not even Prof. W. G. Sumner, was so well equipped to answer Coin as Horace White. The “comic publication,” as the Post called it, would498 have been unworthy of attention had its influence not been tremendous. Silver miners, mortgage-ridden farmers, small shopkeepers and workmen, were everywhere soon studying it, making its specious arguments their own, and convincing themselves that an Eastern plutocracy had committed “the crime of ’73”—the demonetization of silver—in order to depress the prices of crops and labor. By March, 1895, it was impossible to ignore the booklet. In a series of twelve articles Mr. White exposed its many misstatements and fallacies. Coin asserted that silver was “demonetized secretly” in 1873, whereas the discussion had been full and open. He said that the silver dollar was the monetary unit of the United States 1792–1873, when it was actually so only from 1783 to 1792. He stated that the United States was the first nation to demonetize silver, whereas Germany had closed her mints to silver except for small coins in 1871. As for the horse-buying illustration, Mr. White showed that when in 1890 the Government began buying 4,500,000 ounces of silver each month, the price actually fell because the supply increased also. He discussed in detail the greenback question, Coin’s queer delusion that the country had never been prosperous since 1873, and the supposed “English octopus” that had fastened gold upon the world. With some revision, his articles appeared early in 1895 as a pamphlet entitled “Coin’s Financial Fool,” and were distributed in large numbers by the Reform Club at fifteen cents a hundred. At the beginning of 1896 the Evening Post welcomed the signs that a great national battle over free silver was coming. The result, it predicted, would be the same that had crowned the greenback contest. “A sharp division between those who want an honest dollar and those who do not is on all accounts to be desired,” it said on April 10. “A year’s discussion of the principles that enter into this question is the best possible preparation of the public mind for the presidential campaign of 1896.” It knew that the sharp division would have to be a division between the two great parties. As the isolation of Cleveland499 and other gold men in the Democrat party, and the ascendancy of silverites like Bland and Tillman, became more emphatic, it frankly pinned its hopes to the Republicans. To them it promised victory if only they refused to “straddle.” An editorial of April, 1896, called “Assurance of the Gold Standard,” told them that on a gold platform they could carry all the States north of Delaware and the Ohio River, and east of the Mississippi. This would give them 210 electoral votes, and the ten more needed could certainly be obtained from Iowa, the Dakotas, and the border States. Throughout May and June the Evening Post called upon McKinley, who was almost certain to be the nominee, to declare himself for the gold standard. He had voted for the Sherman Silver Purchase Act, and had made alarming utterances in favor of silver coinage as late as the fall of 1894; hence the editors’ anxiety over his uncertain position, and their resentment of his talk of making the tariff the chief issue. But McKinley refused to commit himself. He was assured of a majority of the Republican Convention if he acted tactfully, and he had no intention of antagonizing the silver wing of his party before he won the prize. In his speeches both before and just after the convention he failed to allude to the free silver issue, while in several he emphasized the “great American doctrine of protection.” McKinley’s nomination was therefore received by Godkin and his associates with hostility. Not since 1860, they wrote, had the nation so needed a man of strong character and clear views; yet the Republicans had chosen a trimmer of uncertain mental operations. The gold plank in the platform was admirable, but it simply emphasized the fact that McKinley was, at the time he was named, a total misfit. Nevertheless, Godkin tried to be optimistic: Nothing marks more clearly than McKinley’s nomination the mistake of turning nominating conventions into vast exciting crowds, doing their work under the eyes of a larger crowd, more excited still. There can be little doubt that the gold in the platform500 was forced on the convention by the business men, and that, had the convention been a deliberative body, McKinley’s unfitness to stand on any such platform would have been recognized. But the pledges given by the delegates before they ever met or compared notes, made it impossible to choose any other. About the platform they were free, but about the candidate they were tied up, so that they were compelled to put him astride a body of doctrine with which he had never been in thorough sympathy. But the formal recognition of the doctrine by the party at least insures discussion, and encourages us to hope that there will be no more difficulty in killing the silver heresy through the country by free debate than there has been in getting such a collection of politicians as met at St. Louis to declare for the gold standard. If the Evening Post was frigid toward McKinley, it was filled with angry contempt by the nomination of Bryan. He was totally unknown to the country at large; he had not even been a regular delegate to the convention; he made a windy speech to the roaring mob of repudiators which called itself the Democratic party, and was nominated because he was of the stamp of Tillman and Altgeld, with a more attractive personality—so ran its verdict. The decadence of the great party of Jackson, Benton, Tilden, and Cleveland seemed to it confirmed by the platform, which Horace White pronounced “baser than anything ever avowed heretofore by a political party in this country outside of the slavery question.” The free coinage plank, he said, with the silver dollar really worth 52 cents, meant the repudiation of the half part of all the debts incurred since 1872, when the gold dollar had been made the unit of value. One of the campaign achievements of the Evening Post was truly spectacular. Immediately after Bryan’s nomination its financial editor, Mr. A. D. Noyes, began publishing a series of editorials called “A Free Coinage Catechism.” This question-and-answer presentation of controversial subjects was a familiar one in the Evening Post ever since Godkin assumed control, but it was never more effectively used than in July and August, 1896. Mr.501 Noyes slashed directly into the errors of the Democrats, as a single brief excerpt will show: Q. What is the fundamental contention of the free coinage advocates? A. That the amount of money in circulation has been decreasing since the demonetization of silver, and that this decrease has caused a general fall in prices. Q. Is it true that the money supply has been decreasing? A. It is not. Q. What are the facts? A. So far as the United States is concerned, there has been an enormous increase. In 1860 the money in circulation in this country was $442,102,477; in 1872 it was $738,309,549; by the Treasury bulletin, at the beginning of the present month of July, it was $1,509,725,200. Q. What does this show? A. It shows that our money supply has increased 240 per cent. as compared with 1860, and 104 per cent. as compared with 1872. These editorials were immediately issued by the Evening Post in a sixteen-page pamphlet, and by Sept. 4 a first edition of 1,350,000 copies had been sold. A new edition with two new chapters and other additional matter was then brought out, and by Nov. 2 the total sale had reached 1,956,000 copies. Horace White’s pamphlet, “Coin’s Financial Fool,” continued to sell, and was supplemented by the publication in leaflet form of a public address which he had made in Chicago in 1893 upon “The Gold Standard: How It Came Into the World, and Why It Will Stay.” It can safely be said that the most important campaign documents issued in behalf of sound money were these by Mr. Noyes and Mr. White. Less spectacular, but no less effective, were Horace White’s editorials throughout the summer. As reprinted by the Nation, they reached editors and other leaders of opinion the land over, and filtered down to the public by a thousand channels. Godkin wrote upon the more general political aspects of the campaign, leaving the hard day-to-day arguing mainly to Mr. White. During the whole campaign the paper managed to attack Bryan and Democracy without open advocacy of McKinley and the Republican Party. When McKinley published his letter502 of acceptance, the Post wholeheartedly praised its financial passages, and declared that they defined the one real issue of the campaign. But its distaste for McKinley’s personality, its aversion for his high-tariff views, and the repugnant character of the dominant Republican leaders—Hanna, Platt, Quay, Lodge, Frye, and others—prevented it from giving more than implied and tacit approval to his candidacy. Godkin himself voted the Gold Democratic ticket. The New York press approached nearer to unanimity that summer than in any Presidential campaign since the era of good feeling. The Journal was Bryan’s one important supporter. When he was nominated, the World turned its back upon him, saying: “Lunacy having dictated the platform, it was perhaps natural that hysteria should evolve the candidate.” Though Dana called himself a Democrat, the Sun was more fervently anti-Bryan than the Tribune. Bryan called New York “the heart of what seems to be the enemy’s country.” His attempt to invade it in mid-August, when he journeyed 1,500 miles to Madison Square Garden to be notified of his nomination, was a dismal failure. The night was one of intense heat, the notification speech of Gov. W. J. Stone of Missouri was intolerably long, and the very character of Bryan’s address was a disappointment. He had been expected to display the eloquence which had so dazzled the Chicago Convention. Instead, he read from manuscript a long speech on the model of Lincoln’s Cooper union Address, dealing in the dry tone of a student with what he imagined to be economic facts and governmental principles. Many hearers left early. But the Post explained his failure, not by his refusal to attempt eloquence, but by the fact that his dreary discourse abounded in “the most grating self-contradictions, the grossest blunders in matters of fact, the emptiest platitudes and vaguest assertions”; and by the fact that while Lincoln had appealed to national honor, the young man from the Platte argued “the cause of private dishonesty and public disgrace.” Some newspapers indulged in downright ferocity. The503 Journal spoke of the plutocrats, the monopolists, the great corporations, and their protector Hanna, in characteristic Journal fashion. The Tribune called Bryan a “wretched, addle-pated boy posing in vapid vanity and mouthing resounding rottenness”; a man “apt ... at lies and forgeries and blasphemies”; a “puppet in the blood-imbued hands of Altgeld, the anarchist” and of others who made up a “league of hell.” The Sun applauded the Yale students who tried to break up a New Haven speech by Bryan. Even the Post spoke in the harshest tones of those Western farmers the genuineness of whose hardships no one now denies, and characterizes the struggle as one between “the great civilizing forces of the republic” and “the still surviving barbarism bred by slavery in the South and the reckless spirit of adventure in the mining camps of the West.” Such overstatements show how intense was Eastern feeling over the election. Though the Post’s attitude toward McKinley tempered its rejoicings in the result, it nevertheless hailed it as “the most impressive vindication of democracy governing according to law and order that the country has ever seen.” II The one great doctrine that the Evening Post has maintained as insistently as its low-tariff stand is its opposition to any artificial extension of American sovereignty. From Coleman’s protests against Jackson’s high-handed invasion of the Floridas to Mr. Ogden’s protest against the purchase of the Danish West Indies, this position has been unfalteringly sustained. Bryant was among the first to oppose the annexation of Texas, denounced Walker’s filibusterers as “desperadoes” and “pirates,” and could not condemn too fiercely the Southern projects for acquiring Cuba in the fifties. When Seward purchased Alaska, he opposed that act; for, as he said, many Congressmen advocated it not because they felt they were getting anything of value, but because it was a blow at the prestige of Great Britain and a precaution against the growth of her Pacific power. The basis of the Evening Post’s scathing504 attacks on President Grant’s effort to annex Santo Domingo was its belief that the Anglo-Saxon rule of a Latin and negro people would be contrary to all traditions of the republic, and a complete evil for both countries. The attitude of the paper toward conquest and military adventure was the same no matter what country was involved. Bryant could never see anything in the Crimean War but a useless and inexcusable sea of blood and misery. When the threat of the Franco-Prussian War first appeared, the Evening Post held that if the ambition of the French to dictate boundaries and sovereigns to Europe was to go on retarding civilization till it met an effectual check, now was the time to check it. Like every other American newspaper, the Post had been embittered against Napoleon III by his interference in Mexico and other acts of hostility toward the United States. The receipt of the news of Sedan was the signal for an impromptu celebration in the editorial rooms. Nevertheless, Bryant and his sub-editors warned Germany against annexation as a “barbarous custom,” saying that she should let Napoleon III be the last European ruler who aspired to govern by force an unwilling and subjugated people. They also warned her against militarism, which had been the curse of France. “It is for united Germany to say that this wrong shall no longer continue; and the way to say it is to disband, as soon as peace is won, those huge armies which have done such mighty deeds, and thus declare to the world that Germany, like America, means peace; and has no fear, because it intends no wrong.” But if Bryant was always vigorous in denouncing armed aggression, Godkin was always savage. His hatred of national truculence colored his earliest public utterances. It inspired his indignant letters to the London Daily News upon the Trent Affair in 1861, when the tone of the British press and Foreign Office seemed to him needlessly offensive. The attitude he took in the Nation toward Dominican annexation and the designs of many Americans upon Cuba in the seventies was one of trenchant hostility. When he became editor of the Evening Post, not a year505 passed without fresh criticism of this spirit. His attacks upon British military adventures were as freely expressed. When Gordon was killed at Khartum, he wrote with the utmost bitterness of the whole Sudan tragedy—the British Jingo demand for destruction of the Mahdi, its collision with the really admirable spirit of Arab nationalism, the waste of hundreds of millions, the death of hundreds of brave Britons and thousands of brave Arabs. “There is a powerful passage in De Maistre, apropos of war,” he concluded, “describing the loathing and disgust which would be excited in the human breast by the spectacle of tens of thousands of cats meeting in a great plain, and scratching and biting each other till half their number were dead and mangled. To beings superior to man, conflicts like this in the Sudan must have much the same look of grotesque horror.” By 1894 Mr. Godkin was convinced that the spirit of jingoism was growing more and more rampant the world over. The Continent was divided between the Dual and Triple Alliances. The desire to grab territory had infected even Italy. That country had emerged from the struggle for unification one of the poorest in Europe, with taxation at the last limit of endurance. She badly needed reforms in education, administration, and communication. Yet she hastened to establish an army of 600,000, and a navy of a dozen battleships, and to hunt up some African natives to subjugate like other nations. The result of her efforts to assume a protectorate over Abyssinia was a series of defeats, heavy loss in men, the overthrow of the Crispi Ministry, and reduction to the verge of bankruptcy. “It is no longer sufficient for a people to be happy, peaceful, industrious, well-educated, lightly taxed,” tauntingly wrote Godkin. “It must have somebody afraid of it. What does a nation amount to if nobody is afraid of it? Not a fico secco, as King Humbert would say.” England was clearly headed for war in South Africa. But what grieved Mr. Godkin most was the evident desire of many Americans, the Hearsts and Lodges leading them, to fight somebody. In February, 1896, he wrote upon this phenomenon506 under the title “National Insanity,” comparing it to the recurrent disposition of some men to get drunk in spite of reason. After the Venezuela Affair, the eagerness of these jingoes for a war turned toward Spain as an object. The Cubans had renewed their revolt in February, 1895, and fought so well that by the end of the next year they controlled three-fourths of the inland country. The cruelty of the struggle shocked Americans, while our heavy Cuban investments and trade gave us a pecuniary interest in the island. When it was proposed in Congress that the Cubans be recognized as belligerents (March, 1896), Godkin regarded this as evidence that Cleveland’s Venezuela message had turned the thoughts of Congressmen toward baiting other nations. “He suggested to a body of idle, ignorant, lazy, and not very scrupulous men an exciting game, which involved no labor and promised lots of fun, and would be likely to furnish them with the means of annoying and embarrassing him.” Recognition was out of the question, for the Cubans had no capital, no government, and no army but guerrilla bands. These facts A. G. Sedgwick demonstrated in “A Cuban Catechism.” However, a number of incidents showed that American feeling was really growing. Princeton students that spring hanged the boy heir to the Spanish throne in effigy, miners in Leadville burnt a Spanish flag in the street, and Senator Morgan of Alabama tried in June to lash Congress into excitement over the American citizens who had been roughly treated by the Spanish authorities in Cuba. At no time did the Evening Post conceal the fact that American interference might become necessary. Civil war in Cuba could not continue indefinitely; if the island were not pacified within a reasonable period, the United States would be justified in demanding a new policy on the part of Spain. Nor did it at any time conceal its indignation at Weyler’s inhumane policy of herding the Cuban peasantry into the Spanish lines, and at other Spanish mistakes. Late in 1897 Spain offered Cuba a form of autonomy, but on careful examination, the Post pronounced507 it a hollow cheat. The great essentials of government were kept in Spanish hands, and only a pretty plaything was extended. When Weyler was replaced by Blanco, who was sent out to pursue conciliation, the paper predicted that he would fail as generations before Alexander of Parma had failed when sent by Philip II to replace the bloody Alva in the low countries. No man, it said, could rule Cuba with a sword in one hand and an olive branch in the other. On Sept. 18, 1897, our Minister at Madrid tendered the friendly offices of the United States, and hinted that if the rebellion continued, President McKinley would take serious action. The Post spoke approvingly: This, it is important to recall, is the historic American position, and is the only rational and justifiable way of dealing with an affair which, in any aspect, is deplorable and thick with embarrassments. No longer ago than President Cleveland’s message of Dec. 7, 1896, interference on the lines indicated was distinctly foreshadowed, and he was but taking his stand where President Grant had taken his in 1874 and 1875. With our foreign affairs then in the careful hands of Hamilton Fish, interference with Spain on the ground of the prolonged rebellion in Cuba was yet distinctly intimated. In his annual message of Dec. 7, 1874, Gen. Grant referred to the continuance of the “deplorable strife in Cuba,” then of six years’ duration, and said that “positive steps on the part of other Powers” might become “a matter of self-necessity.” But the Evening Post believed such interference should be peaceful. As the year 1898 opened, it was confident that war could be avoided. It knew that the Cubans would keep on fighting, and that Spain, nearly bankrupt, her soldiers dispirited, could not suppress the rebellion. But it thought that patient, friendly pressure by the United States upon Spain would force her to recognize the facts and give the Cubans a government that would satisfy them. When in February the Journal published a letter by the Spanish Minister, Dupuy de Lome, calling McKinley a cheap politician and caterer to the rabble, Godkin credited most Americans with taking the incident508 good-naturedly—with finding De Lome’s mortification and immediate resignation a source of amusement rather than anger. A few days later (Feb. 15) the destruction of the Maine, with the loss of 226 lives, caused a wave of horror and indignation, unparalleled since Fort Sumter, to sweep the country. Even yet, however, the Post could point with gratification to the steadiness of the general public, and its willingness to suspend judgment till an inquiry was made. The attitude of both Capt. Sigsbee of the Maine and President McKinley it pronounced admirable, as it did that of many important newspapers: The danger was that something rash would be done in the first confused moments. When once we began to think quietly about the affair, the rest was easy. It was at once evident that the chances were enormously in favor of the theory that the blowing up of the Maine was due to accident. But suppose it were shown that she was destroyed by foul play ... what would that prove? That we should instantly declare war against Spain? By no means. It is simply inconceivable that the Spanish authorities in Cuba, high or low, could have countenanced any plot to destroy the Maine. Make them out as wicked as you please, they are not lunatics.... The first effect, then, of this shocking calamity upon the nation has been salutary. It has discovered in us a reserve of sanity, of calmness, of poise, and weight, which is worth more than all our navy. If we are able to display these qualities throughout, the world will think better of us and our self-respect will be heightened; and, despite the Jingoes, it is better to have foreign nations admire us than dread us, better to be conscious of strength of character than of strength of muscle. One exception to this steadiness of opinion was furnished by a large Congressional group. When early in March Congress debated resolutions declaring Cuba a belligerent, Mr. Godkin characterized the debate as one that Americans could not read without humiliation. Many Republican Congressmen frankly looked to war for partisan advantage. Representative Grosvenor of Ohio said that it would be a Republican war, and that it offered the most brilliant opportunity that any Administration509 had seen since Lincoln “to establish itself and its party in the praise and honor and glory of a mighty people.” Senator Hale echoed him. Senator Platt said there would be one great compensation for the loss of life and treasure—“it would prevent the Democratic party from going into the next Presidential campaign with ‘Free Cuba’ and ‘Free Silver’ emblazoned on its banner.” Until war was declared on April 25, the Post consistently praised President McKinley in one column, and assailed Congress in the next. But its chief indignation was reserved for the war press, and especially for the Journal and World. These newspapers presented a curious study. From the files of the Evening Post it would hardly have been gathered that the nation was laboring under marked excitement, but from the editorials, pictures, and lurid headlines of the other two it appeared that the people were at fever heat. “The Worst Insult to the United States in Its History,” was the heading the Journal gave De Lome’s letter. For days thereafter nearly every headline contained the word “war.” “Spain Makes War on the Journal by Seizing the Yacht Buccaneer,” ran one, this being Hearst’s news-boat at Havana. “Threatening Moves by Both Spain and the United States—We Send Another War Vessel to Join Maine at Sea,” followed it next day. After the catastrophe to the Maine the Journal made the welkin ring. “The Warship Maine Was Split in Two by an Enemy’s Secret Infernal Machine!” it trumpeted. “Officers and Men at Key West Describe the Mysterious Rending of the Vessel, and Say It Was Done by Design and Not by Accident—Captain Sigsbee Practically Declares That His Ship Was Blown Up by a Mine or Torpedo.” These were the first page headlines on the 17th. Inside were ribbon headlines running across the next half dozen pages. “Belief in Havana That the Maine Was Anchored Over a Mine”; “Foreign Nations Shocked by the Belief in Spanish Treachery”; “War Probable if Spaniards Blew Up American Warship”; “Let the Cabinet Soon Avenge the Slaughtered Sailors.” Next day the Journal blared,510 “The Whole Country Thrills With the War Fever,” while it reported a poll of both houses showing an overwhelming sentiment in favor of immediate intervention. The World also knew positively within a few hours that the Maine was blown up by Spanish treachery. When Secretary Long pleaded for patience, it exposed him in a glaring indictment: “Long’s Exoneration of Spain Nets Senatorial Clique $20,000,000.” That is, it accused Senators of playing the market. On the same page a news-story demanded a whole bank of headlines. “‘Send Maine Away!’ Begged a Stranger at Our Consulate—Every Day for a Week a Mysterious Elderly Spaniard Offered That Warning, But It Was Unheeded, for He Was Deemed a Crank.” It had the same iteration as the Journal. Thus on March 4 its headlines ran, “Torpedo Blew Up the Maine, High Spanish Officer Says—If His Story Is True, It Verifies the World Correspondent’s Earliest News.” On March 12 it announced: “Full and Convincing Proof That the Maine Was Destroyed Exactly as the World Exclusively and Authoritatively Told Three Days After the Disaster.” The Journal and World were the two New York newspapers then pre?minent for their illustrations. The former specialized in pictures of “How the Maine Actually Looks, Wrecked by Spanish Treachery.” It had drawings of dead bodies, “vultures hovering over their grim feast”; piles of coffins; divers among the tangled wreckage; starving reconcentrados; the Vizcaya in New York harbor; Mayor Van Wyck insulting the Vizcaya’s captain at City Hall; big guns being mounted on American forts; of troops drilling; and a “frenzy on the stock exchange, realizing the imminence of war.” More than a month before war was declared the Journal plastered its first page with an announcement of its “War Fleet, Correspondents, and Artists,” these including Julian Hawthorne, James Creelman, Alfred Henry Lewis, and Frederic Remington. The World was notable for cartoons, the prevailing theme of which was Uncle Sam kicking Spain out of Cuba into the Atlantic. 511 Mr. Godkin’s opinion of the newspaper jingoes was only a little more savage than that of many other sober men. When a Journal reporter just before war began fabricated an interview with Roosevelt, then Assistant Secretary of the Navy, the latter seized the opportunity for a frank statement of his estimate of the paper. When the same sheet asked ex-President Cleveland to serve on a committee to erect a monument to the Maine heroes, Mr. Cleveland wired back: “I decline to allow my sorrow for those who died on the Maine to be perverted to an advertising scheme for the New York Journal.” Godkin was brutally frank. “A yellow journal office is probably the nearest approach, in atmosphere, to hell, existing in any Christian state,” he wrote. This press he deemed a totally irresponsible force, without the restraint of conscience, law, or the police. It treated war, he said, as a prize fight, and begat in hundreds of thousands of the class which enjoys prize-fights an eager desire to read about it. “These hundreds of thousands write to their Congressmen clamoring for war, as the Romans used to clamor for panem et circenses, and as the timid and quiet are generally attending only too closely to their business, the Congressman concludes that if he, too, does not shout for war, he will lose his seat.... Our cheap press to-day speaks in tones never before heard out of Paris. It urges upon ignorant people schemes more savage, disregard of either policy, or justice, or experience more complete, than the modern world has witnessed since the French Revolution.” It was with reference to such journalism that the Times, which this year went to the one-cent basis of the World and Journal, spoke of itself as a paper which does not “soil the breakfast table.” Godkin argued that the public, by purchasing the yellow sheets, made itself the accomplice of their jingo editors. The Journal struck back at him and Bennett of the Herald. It was not surprised, it said, by the abuse it received from editors who either lived in Europe, or, being native there, came to this country too late in life to absorb the spirit of American512 institutions; these men were unfitted to gauge the trend and force of national opinion, and were un-American in their instincts, while the Journal, with its million buyers a day, was an American paper for the American people. Until just before the declaration of war, Godkin tried to cling to his faith in McKinley’s steadfastness. On April 5 he wrote: “He has, with a firmness for which we confess we did not give him credit, retained the Cuban matter in his own hands, and has made no concealment of his belief that he could settle it, if left alone, by peaceful methods.” The editor believed that America could justly demand of Spain an immediate armistice, relief of the reconcentrados, and an offer of genuine autonomy to the Cubans. It appeared in the early days of April that Premier Sagasta was willing to concede as much, and Godkin thought this offered a bridge to assured peace. Why not accept the Spanish Ministry’s concessions, he wrote April 9 and later, and give a fair trial to their autonomy? What reason had we to make a further demand for the withdrawal of all Spanish troops? And if we did demand it, how could we expect Spain to accede until the Cortes met on April 25, since only the Cortes had power to surrender Spanish territory? It was true that the Cubans refused an armistice and autonomy. But, argued Godkin, they did so only because they counted on dragging us into the war upon the margin between autonomy and absolute independence. And what a pitiful margin that was! No one believed that the Cubans were ready for absolute independence, for like the Central American peoples, they would be turbulent and unstable, requiring constant oversight. Then why not leave them under the Spanish flag so long as they had the healthy substance, even though not the name, of freedom? Mr. Godkin did not give up hope even when, on April 11, McKinley sent Congress his war message, asking that he be empowered to use the armed forces of the United States “to secure a full and final termination of hostilities between the Government of Spain and the people of Cuba.” He took the view that this was not equivalent to513 a use of our armed forces against Spain—that it meant only that McKinley was going to insist upon a truce. The Evening Post seized upon the fact that McKinley had advised against recognition of the Cuban Republic, and upon his hopeful words regarding Queen Isabel’s proclamation of an armistice, as proof that the door to peace was not closed. In fact, many sober men hoped for days after this message that McKinley would somehow avert a collision with Spain. Howells says that on one of these warm April nights he walked down the street with Godkin, the two talking gloomily of the outlook, and that as they parted, Godkin shook off his fears with a quick, “O, well, there isn’t going to be any war, after all.” But Spain at once severed diplomatic relations, the United States declared a blockade of Cuba, and the die was cast. A few mornings after Godkin’s talk with Howells, the jingo press gloated over the capture of a poor little Spanish schooner, whose captain and owner wept to find his all confiscated. Not until later was it revealed that when he sent his war message to Congress, President McKinley failed to inform it of the full scope and definiteness of the Spanish concessions regarding Cuba. Of this failure two views may be taken. One is that he knew no reliance could be placed upon Spain’s good faith, and that she could not end the intolerable state of affairs in the island if she tried. The other is that McKinley was guilty of duplicity all along; that he had played a waiting game until preparations could be made for war and the public mind accustomed to it, and then willingly let the advocates of intervention have their way. Godkin and the Post took the second view, and in later days spoke of the President’s conduct in this crisis with scorn. Yet the newspaper, applauded though it was in its protestant attitude by the intellectual group which Howells, Carl Schurz, Charles Eliot Norton, and Charles Francis Adams represented, rallied to support the war. Since it had come, it hoped it would be short and decisive. Before514 hostilities began, it had said much regarding the unpreparedness of the nation, and the certainty of graft in conducting the conflict. But now it urged the energetic prosecution of the contest, praised the martial ardor of American youth, and commended the military and naval policies of the Administration. Mr. Godkin had no petty rancor and no lack of patriotism. Other journals were lavish of faultfinding, but no criticism found its way into the Evening Post until practically all fighting was ended. To the series of victories which began with Dewey’s exploit at Manila, the Post rose with fitting enthusiasm. It called the Santiago campaign, when it ended on July 15, a brilliant impromptu. Who would have thought two months earlier that a triumph of such magnitude would so soon be won? Then the flower of the Spanish navy had lain in the harbor, and a Spanish force estimated at 20,000 to 35,000 held the well-fortified city; but in less than two months the fleet had been destroyed, the city taken, and the army made prisoners, all with a loss of less than 300 American lives. The Post paid a due tribute to the valor of American fighting men: Lieut. Hobson deprecated the cheers that welcomed him back to the American lines. “Any of you would have done it.” Very likely. We know that practically every man on the fleet offered to go with him when volunteers were called for. Such high appeals to bravery and duty command their own response. But the men below—the engineers, exposed to death without being able to strike a blow; the stokers, whose enemy is the cruel heat in which they have to work—where does their heroism come in? Of course, in the same self-forgetful devotion to their duty which marks some world-resounding deed of an officer like Hobson. That was a frightful detail of the Spanish flight to ruin—the officers having to stand over gunners and stokers with drawn pistols to keep them to their task. Ships on which that was necessary were evidently beaten in advance. Contrast the state of things on the Oregon, in her long voyage against time from the Pacific. Captain Clark reported that even the stokers worked till they fainted in the fire-room, and then would fight to go back as soon as they recovered consciousness. To hurry up coaling, the officers threw off their coats and slaved like navvies. There we515 see the spirit of heroism pervading a ship from captain to coal-heaver; and it is that which makes the navy invincible. III As summer ended, however, and the cessation of fighting gave the country an opportunity to ask itself what it should do with Cuba, Porto Rico, and the Philippines, the continuity of the Evening Post’s policy became plain. For one thing, it now felt able to state its frank opinion that the war had been criminally unnecessary. Gen. Woodford, our last Minister at Madrid, and Congressman Boutelle made speeches at a Boston dinner on Oct. 28 in which they both virtually said as much. In all its references to the conflict after midsummer the paper made clear its conviction that it was “due solely to the combination of a sensational and unscrupulous press with an equally reckless and unscrupulous majority in Congress and a weak executive in the White House.” But the chief energies of the Post were devoted to opposing the designs of those who wanted to annex the Philippines and Cuba, or at least the former. When the war was impending, it had dreaded the loss in life and money much less than the deterioration which might be produced in the national fiber, and had predicted the possible transformation of America into an international swaggerer. Now Godkin saw indisputable evidence that the European virus of imperialism, economic and political, was entering our veins. “Manifest Destiny” was the argument used against the Evening Post, Springfield Republican, Senators Hoar, Hale, and Spooner, Carl Schurz, and the other leaders in the struggle against annexations. What would you do with the Philippines? they were asked. Since they were in our hands, could we abandon them without thought of their future? “As matters now stand,” answered the Evening Post on Oct. 1, 1898, “having possession of Manila, we should do what we could to make Spain give the Philippines a better government or hand them over to the lawful owners—the inhabitants.” The whole American theory of government was opposed to alien rule.516 We could never incorporate the Philippines in the union—this argument the Post had also used against annexing Hawaii—and it was a total reversal of national policy to acquire territory that could not be incorporated. Replying to the contention that the Filipinos might be unable to erect a good government, the Post asked if New York and Pennsylvania under Platt and Quay had one. The chief assertions of the Evening Post, some of them since validated and some invalidated by time, are worth noting seriatim. It feared that the cost of subjugating, garrisoning and governing the Philippines would be heavy. It pointed out that in the management of inferior peoples—the negro slaves, Indians, Chinese—had lain the source of our chief national troubles. Our Federal authorities had always shown marked incapacity for governing such wards, as their “century of dishonor” in dealing with the Indians, and wretched treatment of the freedmen during Reconstruction proved. The American Government had been erected to provide for the welfare and liberty of the American nation alone, and if we undertook in a spirit of expansion to carry benefits to every misgoverned race with which we came in accidental contact, we would soon be in trouble in every part of the globe. The Post believed that half the talk of Duty and Destiny was raised by people on the make, who wanted their trade to follow the flag. The name of the United States, it asserted, had been great because it stood for peaceful industry, contempt for the military adventures of Europe, and the right of every separate people to liberty; its influence had furnished the chief hope for disarmament, and now was it to be thrown away for the pride of possessing “subjects”? Above all, Godkin apprehended the effect of expansion on our national character. The great question, as Bishop Potter put it, was not what we should do with the Philippines, but what the Philippines would do with us. So intense was the Post’s feeling that it virtually opposed Theodore Roosevelt when the fall of 1898 he ran for the Governorship against the Tammany candidate Van Wyck. Ordinarily, it would have supported him enthusiastically517 in such a contest, but Roosevelt’s annexationist speeches led it to declare that Tammany control would be a local and temporary evil, while any encouragement to imperialism would be national and irrevocable. Early in 1899 the Post’s correspondents in Manila warned it that, as one wrote, “the United States must make up their minds either to fight for these islands or to give them up.” Just before the peace treaty, carrying annexation of the islands, was ratified, occurred Aguinaldo’s attempt to rush the American lines at Manila. Godkin declared that we had paid $20,000,000 simply for a right to conquer, adding bitterly: We have apparently rushed into this business with as little preparation or forethought as into the Cuban War. We got hold of the notion that it would be a good thing to annex 1,200 islands at the other end of the world, simply because we won a naval victory over a feeble Power in the harbor of one of them, and because people like Griggs of New Jersey wanted some “glory.” We then went to work to buy 1,200 islands without any knowledge of their extent, population, climate, production, or of the feelings, wishes, or capacity of the inhabitants. We did not even know their number. While in this state of ignorance, far from trying to conciliate them, assure them of our good intentions, disarm their suspicions of us—men of a different race, language, and religion, of whom they had only recently heard—we issued one of the most contemptuous and insulting proclamations a conqueror has ever issued, announcing to them that their most hated and secular enemy had sold them to us, and that if they did not submit quietly to the sale we should kill them freely. It was now impossible to advocate immediate and complete evacuation, and during the spring of 1899 the Post suggested another solution. It proposed that instead of administering the islands as a possession, we content ourselves with setting up a protectorate, allowing the Filipino republic to function under our general oversight. The islanders were willing to accept this, for they knew they could not stand alone against the voracity of Europe. We could send them schoolteachers, sanitary experts, missionaries, and government advisers, but we would not have518 to crush their spirit before we began helping them, and would be their friends, not their conquerors. Godkin was shocked by the lighthearted irresponsibility of the annexationists. “The one thing which will prevent expansion being a disgrace, is a permanent colonial civil service,” he wrote a friend, “but who is doing a thing or saying a word about it?” While the controversy over the Philippines was at its hottest, in the spring of 1899, Mr. Godkin left for Europe, where he had spent every summer but one since 1891. In 1897 he had received his D. C. L. at Oxford, and in 1898 an honorary degree at Cambridge, but this year the alarming state of his health was his sole reason for sailing. The warnings of the doctors in Paris and Vichy were so earnest that he resolved to give up his connection with the Evening Post. His formal withdrawal took place Jan. 1, 1900, but though he was home in New York by the beginning of the preceding October, he contributed only advice and an “occasional roar,” as Henry James put it, to the Post thereafter. It was a depressing moment for him to lay down his pen. The United States seemed to have caught the infection of the Old World fever that he feared. His native country was busy crushing the Boer republics. The political condition of the nation, the State, and the city, with Mark Hanna, Platt and Quigg, Croker and Sheehan at the height of their power, was such as to make the editor feel that the forces against which he had battled were too strong to defeat. But as Charles Eliot Norton wrote him, he had earned the right to leave the field. “When the work of this century is summed up, what you have done for the good old cause of civilization, the cause which is always defeated, but always after defeat taking more advanced position than before—what you have done for this cause will count for much.”","sourceLink":"http://novel.tingroom.com/duanpian/3288/89924.html","bookId":489,"book":{"id":489,"title":"The Evening Post","description":"简介： This volume took its origin in the writers belief that a history of the Evening Post would be interesting not merely as that of one of the worlds greatest newspapers, but as throwing light on the whole course of metropolitan journalism in America sin...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3288","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
