{"id":23454,"no":59,"title":"SECTION XV OPERATIONS IN NORTHERN SPAIN (MARCH-JUNE 1809) CHAPTER I","content":"NEY AND LA ROMANA IN GALICIA AND THE ASTURIAS \n \n While following the fortunes of Soult and the 2nd Corps in Northern Portugal, we have been constrained to withdraw our attention from Galicia, where we left Marshal Ney busied in a vain attempt to beat down the insurrections which had sprung up in every corner of the kingdom, at the moment when the melting of the snows gave notice that spring was at hand. It was with no good will that the Duke of Elchingen had seen his colleague depart from Orense and plunge into the Portuguese mountains. Indeed he had done his best to induce Soult to disregard the Emperor’s orders, and to join him in a strenuous effort to pacify Galicia before embarking on the march to Oporto[459]. When he found that his appeal had failed to influence the Duke of Dalmatia, and that the 2nd Corps had passed out of sight and left the whole of Galicia upon his hands, he was constrained to take stock of his position and to think out a plan of campaign. \n \n Ney had at his disposal some 17,000 men, consisting of the twenty-four infantry battalions of his own corps, which formed the two divisions of Marchand and Maurice Mathieu, of the two regiments of his corps-cavalry, and of Fournier’s brigade of Lorges’ dragoons, which Soult, by the Emperor’s orders, had transferred to him before crossing the Minho. Among his resources it would not be fair to count the two garrisons at[p. 368] Vigo and Tuy which the 2nd Corps had left behind it. They numbered more than 4,000 men, but were so placed as to be more of a charge than a help to Ney. They failed to keep him in touch with Soult, and their necessities distracted some of his troops to their aid when he was requiring every man for other purposes. \n \n On March 10, when he was left to his own resources, Ney had concentrated the greater part of his corps in the north-western corner of Galicia. He had placed one brigade at Lugo, a second with Fournier’s dragoons at Mondonedo, in observation of the Asturias, a third at Santiago, the remainder at Corunna and Ferrol. The outlying posts had been called in, save a garrison at Villafranca, the important half-way stage between Lugo and Astorga, where the Marshal had left a battalion of the 26th regiment, to keep open his communication with the plains of Leon. The insurgents were already so active that touch with this detachment was soon lost, the peasants having cut the road both east and west of Villafranca. \n \n The whole month of March was spent in a ceaseless endeavour to keep down the rising in Northern Galicia: the southern parts of the kingdom had been practically abandoned, and the French had no hold there save through the garrisons of Tuy and Vigo, both of which (as we have seen in an earlier chapter) were blockaded by the local levies the moment that Soult had passed on into Portugal. \n \n Ney’s object was to crush and cow the insurgents of Northern Galicia by the constant movement of flying columns, which marched out from the towns when his brigades were established, and made descents on every district where the peasantry had assembled in strength. This policy had little success: it was easy to rout the Galicians and to burn their villages, but the moment that the column had passed on the enemy returned to occupy his old positions. The campaign was endless and inconclusive: it was of little use to kill so many scores or hundreds of peasants, if no attempt was made to hold down the districts through which the expedition had passed. This could not be done for sheer want of numbers: 16,000 men were not sufficient to garrison the whole of the mountain valleys and coast villages of this rugged land. The French columns went far afield, even[p. 369] as far as Corcubion on the headland of Cape Finisterre, and Ribadeo on the borders of Asturias: but though they scathed the whole region with fire and sword, they made no impression. Moreover, they suffered serious losses: every expedition lost a certain number of stragglers cut off by the peasantry, and of foragers who had wandered too far from the main body in search of food. All were murdered: for the populace, mad at the burning of their homes and the lifting of their cattle—their only wealth—never gave quarter to the unfortunate soldiers who fell into their hands. \n \n It is curious and interesting to compare Ney’s actual operations with the orders which the Emperor had sent to him[460]. In these he was directed to establish his head quarters at Lugo, and to leave no more than a regiment at Ferrol and another regiment at Betanzos and Corunna. He was to keep a movable column of three battalions at work between Santiago and Tuy, to ‘make examples’ and prevent the English from landing munitions for the insurgents. With the rest of his corps, five regiments of infantry and a brigade of cavalry, he was to establish himself at Lugo, and from thence to send out punitive expeditions against rebellious villages, to seize hostages, to lend aid if necessary to Soult’s operations in Portugal, and finally ‘to utilize the months of March and April, when there is nothing to fear on the Galician coasts, for an expedition to conquer the Asturias.’ Here we have all Napoleon’s illusions concerning the character of the Peninsular War very clearly displayed. He supposes that a movable column of one regiment can hold down a rugged coast region one hundred miles long, where 20,000 insurgents are in arms. He thinks that punitive expeditions, and the taking of hostages, will keep a province quiet without there being any need to establish garrisons in it. ‘Organize Galicia,’ he writes, ‘make examples, for severe examples well applied are much more effective than garrisons.... Leave the policing of the country to the Spanish authorities. If you cannot occupy every place, you can watch every place: if you cannot hold every shore-battery to prevent communication with the English, you can charge the natives with this duty. Your movable columns will punish any of the people of the coast who behave badly.’ \n \n [p. 370] \n \n To Ney, when he received this dispatch, many weeks after it had been written, all this elaborate advice must have appeared very futile. Considering the present attitude of the whole population of Galicia, he must have been much amused at the proposal that he should entrust them with the task of keeping off the British, should ‘organize’ them, and ‘make them police themselves.’ As to ‘severe examples’ he had now been burning villages and shooting monks and alcaldes for two months and more: but the only result was that the insurrection flared up more fiercely, and that his own stragglers and foragers were being hung and tortured every day. As to the idea of movable columns, he had (on his own inspiration) sent Maucune to carry out precisely the operations that the Emperor desired in the country between Santiago and Tuy. The column had to fight every day, and held down not one foot of territory beyond the outskirts of its own camp. And now, in the midst of all his troubles, he was ordered to attempt the conquest of the Asturias, no small undertaking in itself. The Emperor’s letter ended with the disquieting note that ‘no further reinforcements can be sent to Galicia. It is much more likely that it may be necessary to transfer to some other point one of the two divisions of the Sixth Corps[461].’ \n \n We have hitherto had little occasion to mention the two Spanish regular armies on which Ney, in addition to all his troubles with the insurgents, had to keep a watchful eye. The first was the force in the principality of Asturias, which had been lost to sight since the day on which it fled homeward after the battle of Espinosa. The second consisted of the much-tried troops of La Romana, who since their escape from Monterey had enjoyed some weeks of comparative rest, and were once more ready to move. \n \n The Asturian force was far the larger in point of numbers, and ought to have made its influence felt long ere now. But even more than the other Spaniards, the Asturians were given over to particularism and provincial selfishness. In 1808 they had done nothing for the common cause save that they had lent the single division of Acevedo—comprising about half their[p. 371] provincial levy[462]—to the army which Blake led to defeat in Biscay. After Espinosa this corps had not retired with La Romana to Leon, but had fallen back within the frontier of its native principality, and had joined the large reserve which had never gone forward from Oviedo. During the three winter months, the Asturians had contented themselves with reorganizing and increasing the numbers of their battalions, and with guarding the passes of the Cantabrian chain. They had refused to send either men or money to La Romana, thereby provoking his righteous indignation, and furnishing him with a grudge which he repaid in due season. When he was driven away from their neighbourhood, and forced to retire towards Portugal, they still kept quiet behind their hills, and made but the weakest of attempts to distract the attention of the enemy. There were at first no French forces near them save Bonnet’s single division at Santander, which was fully occupied in holding down the Monta?a, and a provisional brigade at Leon consisting of some stray battalions of the dissolved Eighth Corps[463]. As neither of these forces had any considerable reserves behind them[464], when once Ney and Soult had passed on into Galicia, it is clear that a demonstration in force against Santander or Leon would have thrown dismay along the whole line of the French communications, and have disarranged all the Emperor’s plans for further advance. \n \n The only operation, however, which the Asturians undertook was a petty raid into Galicia with 3,000 or 4,000 men, who[p. 372] went to beat up Ney’s detachment at Mondonedo on April 10, and were driven off with ease[465]. The Junta had fully 20,000 men under arms, but they contrived to be weak at every point by trying to guard every point. They had sent, to observe Bonnet, the largest body of their troops, nearly 10,000 men, under General Ballasteros: he had taken up the line of the Deba, and lay with his head quarters at Colombres, skirmishing occasionally with the French outposts. At the pass of Pajares, watching the main road that descends into the plain of Leon, were 3,000 men, and 2,000 more at La Mesa guarded a minor defile. Another division of 4,000 bayonets was at Castropol, facing Ney’s detachment which had occupied Mondonedo: this was the column which had made the feeble advance in April to which we have already alluded. Finally, a Swiss Lieutenant-General named Worster lay at Oviedo, the capital of the principality, with a small reserve of 2,000 men[466]. It does not seem that Cienfuegos, the Captain-General of Asturias, exercised any real authority, as the Junta took upon itself the settling of every detail of military affairs[467]. Thus a whole army was wasted[p. 373] by being distributed all along the narrow province, awaiting an attack from an enemy who was far too weak to dream of advancing, and who, as a matter of fact, did not move till May. La Romana might well be indignant that the Asturians had done practically nothing for the cause of Spain from December to March, especially since they had obtained more than their share of the British arms and money[468] which had been distributed in the autumn of 1808. \n \n Ney’s new troubles in April did not spring from the activity of the Asturian troops, but from that of the much-battered army of Galicia, which was destined in this month to achieve the first success that had cheered its depleted ranks since the combat of Guenes. When La Romana, on March 8, had found himself free from the pursuit of Franceschi’s cavalry, he had marched by leisurely stages to Puebla de Senabria on the borders of Leon. He doubted for a moment whether he should not turn southward and drop down, along the edge of Portugal, to Ciudad Rodrigo, the nearest place of strength in Spanish hands. But, after much consideration, he resolved to leave behind him the weakest of his battalions and his numerous sick, together with his small provision of artillery, and to strike back into Galicia with the best of his men. It would seem that he was inspired partly by the desire of cutting Ney’s communications, partly by the wish to get into touch with the Asturians, whose torpidity he was determined to stir up into action. Accordingly he left at Puebla de Senabria his guns and about 2,000 men, the skeletons of many ruined regiments, under General Martin La Carrera, while with the 6,000 infantry that remained he resolved to cross the Sierra Negra and throw himself into the upper valley of the Sil. The road by Corporales and the sources of the Cabrera torrent proved to be abominable; if the[p. 374] army had possessed cannon or baggage it could not have reached its goal. But after several hard marches La Romana descended to Ponferrada on March 16. He learnt that the insurrection had compelled the French to concentrate all their small posts, and that there was no enemy nearer than Villafranca on the one hand and Astorga on the other. Thus he found himself able to take possession of the high-road from Astorga to Lugo, and to make use of all the resources of the Vierzo, and of Eastern Galicia. He might have passed on undisturbed, if he had chosen, to join the Asturians. But learning that the French garrison at Villafranca was completely isolated, he resolved to risk a blow at it, in the hopes that he might reduce it before Ney could learn of his arrival and come down from Lugo to its aid. He was ill prepared for a siege, for he had but one gun with him—a 12-pounder which he had abandoned in January when retreating from Ponferrada to Orense, and which he now picked up intact, with its store of ammunition, at a mountain hermitage, where it had been safely hidden for two months. \n \n Marching on Villafranca next day he fell upon the French before they had any conception that there was a hostile force in their neighbourhood. He beat them out of the town into the citadel after a sharp skirmish, and then surrounded them in their refuge, and began to batter its gates with his single gun. If the garrison could have held out for a few days they would probably have been relieved, for Ney was but three marches distant. But the governor, regarding the old castle as untenable against artillery, surrendered at the first summons. Thus La Romana captured a whole battalion of the 6th Léger, 600 strong[469], together with several hundreds more of convalescents and stragglers who had been halted at Villafranca, owing to the impossibility of sending small detachments through the mountains[470] when the insurgents were abroad[471]. \n \n Having accomplished this successful stroke La Romana was[p. 375] desirous of pursuing his way to the Asturias, where he was determined to make his power felt[472]. He took with him only one regiment (that of La Princesa, one of his old corps from the Baltic), and handed over the temporary command of the army to General Mahy, with orders to hold on to the Vierzo as long as possible, but to retire on the Asturias if Ney came up against him in force. The Marshal, however, did not move from Lugo; when he heard of the fall of the garrison of Villafranca, he was already so much entangled with the insurrection that he could spare no troops for an expedition to the Vierzo. In order to reopen the communication with Astorga he would have had to call in his outlying brigades, and at the present moment he was more concerned about the fate of Tuy and Vigo than about the operations of La Romana. Accordingly, Mahy was left unmolested for the greater part of a month in his cantonments along the banks of the Sil; it was a welcome respite for the much-wandering army of Galicia. \n \n Romana meanwhile betook himself to Oviedo with his escort, and on arriving there on April 4 entered into a furious controversy with the Junta. Finding them obstinate, and not disposed to carry out his plans without discussion, he finally executed a petty coup d’état[473]. It bears an absurd resemblance to Crom[p. 376]well’s famous dissolution of the Long Parliament. Coming into their council-room, with Colonel Joseph O’Donnell and fifty grenadiers of the Princesa regiment, he delivered an harangue to the members, accusing them of all manner of maladministration and provincial selfishness. Then he signed to his soldiers and bade them clear the room[474]. \n \n La Romana then, on his own authority, nominated a new Junta; but many of its members refused to act, doubting the legality of his action, while the dispossessed delegates kept up a paper controversy, and sent reams of objurgatory letters to the Government at Seville. Ballasteros and his army, at the other side of the Principality, seem to have paid little attention to La Romana, but the Marquis so far got his way that he began to send much-needed stores, medicines, munitions, and clothing to his troops in the Vierzo. He even succeeded in procuring a few field-pieces for them[475], which were dragged with difficulty over the passes via Cangas de Tineo. \n \n Thus strengthened Mahy, much to his chief’s displeasure, advanced from the Vierzo towards Lugo, with the intention of beating up the French brigade there stationed. He took post at Navia de Suarna, just outside the borders of the Asturias, and called to his standards all the peasantry of the surrounding region. La Romana wrote him urgent letters, directing him to avoid a battle and to await his own return. ‘He should remember that it was the policy of Fabius Maximus that saved Rome, and curb his warlike zeal[476].’ It is satisfactory to find that one Spanish general at least was free from that wild desire for pitched battles that possessed most of his contemporaries. \n \n Mahy, thus warned, halted in his march towards Lugo, and remained in his cantonments in the valley of the Navia. His chief should have returned to him, but lingered at Oviedo till April was over, busy in the work of reorganization and in the [p. 377]forwarding of supplies. Meanwhile the French hold on Southern Galicia had completely disappeared: Vigo had fallen in March, Tuy had been evacuated. Maucune’s column had cut its way back to Santiago with some difficulty, bringing to Ney the news of Soult’s capture of Oporto, but also the assurance that the whole valley of the Minho and the western coast-land had passed into the hands of the insurgents. \n \n What the Duke of Elchingen’s next move would have been, if he had not received further intelligence from without, we cannot say. But in the first week in May the long-lost communication with Madrid was at last reopened, and he was ordered to take his part in a new and broad plan of operations against La Romana’s army and the Asturias. \n \n Ever since La Romana had stormed Villafranca, and all news from Galicia had been completely cut off, King Joseph and his adviser Jourdan had been in a state of great fear and perplexity as to the condition of affairs in the north-west. Soult had long passed out of their ken, and now Ney also was lost to sight. In default of accurate information they received all manner of lugubrious rumours from Leon and Astorga, and imagined that the Sixth Corps was in far more desperate straits than was actually the case. Fearing the worst, they resolved to find out, at all costs, what was going on in Galicia. To do so it was necessary to fit out an expedition sufficiently strong to brush aside the insurgents and communicate with Ney. Troops, however, were hard to find. Lapisse had already marched from Salamanca to join Victor. In Old Castile and Leon there were but Kellermann’s dragoons and a few garrisons, none of which could leave their posts. Marshal Bessières, to whom the general charge of the northern provinces had been given by the Emperor, could show conclusively that he was not able to equip a column of even 5,000 men for service in Galicia. \n \n The only quarter whence troops could be procured was Aragon, where everything had remained quiet since the fall of Saragossa. The Emperor had issued orders that of the two corps which had taken part in the siege, the Third only should remain to hold down the conquered kingdom: hence Mortier and the Fifth should have been disposable to reinforce the troops in Old Castile. But, with the Austrian war upon his hands, Napoleon[p. 378] was thinking of withdrawing Mortier and his 15,000 men from Spain. In a dispatch dated April 10, he announced that the Marshal was to retire from Aragon to Logro?o in Navarre, from whence he might possibly be recalled to France if circumstances demanded it[477]. At the same moment King Joseph was writing to Mortier to summon him into Old Castile, and pointing out to him that the safety of the whole of Northern Spain depended upon his presence. Much perplexed by these contradictory orders, the Duke of Treviso took a half-measure, and marched to Burgos, which was actually in Old Castile, but lay only three marches from Logro?o and upon the direct route to France. A few days later the Emperor, moved by his brother’s incessant appeals, and seeing that it was all-important to reopen the communication between Ney and Soult, permitted Mortier to march to Valladolid, where he was in a good position for holding down the entire province of Old Castile. He also gave leave to the King to employ for an expedition to Galicia the two regiments of the Third Corps, which had escorted the prisoners of Saragossa to Bayonne, and which were now on their homeward way to join their division in Aragon. \n \n It was thus possible to get together enough troops to open the way to Galicia. The charge of the expedition was handed over to Kellermann, who was given his own dragoons, the two regiments from Bayonne, a stray battalion of Leval’s Germans from Segovia, a Polish battalion from Buitrago, and a provisional regiment organized from belated details of the Second and Sixth Corps, which had been lying in various garrisons of Castile and Leon[478]. He had altogether some 7,000 or 8,000 men, whom he concentrated at Astorga on April 27. Marching on Villafranca he met no regular opposition, but was harassed by the way by the peasantry, who had abandoned their villages and retired into the hills. Mahy had moved off the main road by making his advance to Navia de Suarna, and was not sighted by Kellermann, nor did the Spaniard think fit to meddle with such a powerful force as that which was now passing him. \n \n On May 2 the column reached Lugo, where it fell in with[p. 379] Maurice Mathieu’s division of the Sixth Corps, and obtained full information as to Ney’s position. The Marshal was absent at Corunna, but sent his chief of the staff to meet Kellermann and concert with him a common plan of operations. It was settled that they should concentrate their attention on La Romana and the Asturians, leaving southern Galicia alone for the present, and taking no heed of Soult, of whom they had received no news for a full month. \n \n For the destruction of the Spanish armies of the north a concentric movement was planned. Ney undertook to concentrate the main body of his corps at Lugo, and to fall on the Asturians from the west, crushing Mahy on the way. He stipulated, however, that he should be allowed to return to Galicia as quickly as possible, lest the insurgents should make havoc of his garrisons during his absence. Kellermann was to retrace his steps to Astorga and Leon, and from thence to march on the Asturias by the pass of Pajares, its great southern outlet. At the same moment Bonnet at Santander was to be requested to fall on from the east, and to attack Ballasteros and the division that lay behind the Deba. \n \n When it was reported to Mahy and La Romana that Kellermann had turned back from Lugo, and was retreating upon Astorga, they failed to grasp the meaning of his movement, and came to the conclusion that his expedition had been sent out with no purpose save that of communicating with Ney. Unconscious that a simultaneous attack from all sides was being prepared against them, they failed to concentrate. By leaving small ‘containing’ detachments at the outlying posts, they could have massed 20,000 men against any one of the French columns: but they failed to see their opportunity and were caught in a state of complete dispersion. Ballasteros with 9,000 men still lay opposite Bonnet; Worster at Castropol did not unite with Mahy’s army at Navia de Suarna; and La Romana remained at Oviedo with two regiments only. \n \n Hence came hopeless disaster when the French attack was at last let loose upon the Asturias. On May 13 the Duke of Elchingen drew together at Lugo four of the eight infantry regiments which formed the Sixth Corps, with two of his four cavalry regiments, and eight mountain-guns carried by mules.[p. 380] This formed a compact force of 6,500 bayonets and 900 sabres[479]. He left behind him four battalions and a cavalry regiment under Maucune at Santiago, the same force under the cavalry brigadier Fournier at Lugo, two battalions at Corunna, one at Betanzos, and one at Ferrol. \n \n The obvious route by which the Marshal might have advanced on Oviedo was the coast-road by Mondonedo and Castropol, which Worster was guarding. But in order to save time and to fall upon the enemy on an unexpected line, he took a shorter but more rugged mountain road by Meyra and Ibias, which led him into the valley of the Navia. This brought him straight upon Mahy’s army: but that general, when he learnt of the strength that was directed against him, retreated in haste after a skirmish at Pequin, and fled, not to the Asturias, but westward into the upper valley of the Minho. [May 14.] This move was vexatious to Ney, who would have preferred to drive him on to Oviedo, to share in the general rout that was being prepared for the Asturians. The Marshal refused to follow him, and pushed on to Cangas de Tineo in the valley of the Narcea, capturing there a large convoy of food and ammunition which was on its way from La Romana to Mahy. On May 17 he hurried on to Salas, on the 18th he was at the bridge of Gallegos on the Nora river, only ten miles from Oviedo. Here for the first time he met with serious opposition: hitherto he had suffered from nothing but casual ‘sniping’ on the part of the peasantry. His march had been so rapid that La Romana had only heard of his approach on the seventeenth[480], and had not been able to call in any of his out[p. 381]lying detachments. The Marquis was forced to attempt to defend the passage of the Nora with nothing more than his small central reserve—the one Galician regiment (La Princesa, only 600 bayonets) that he had brought with him from Villafranca, and one Asturian battalion—not more than 1,500 men. Naturally he was routed with great loss, though Ney allows that the Princesa regiment made a creditable defence at the bridge[481]. The Spanish troops therefore dispersed and fled eastward, while Romana rode down to the seaport of Gijon and took ship on a Spanish sloop of war along with the members of his Junta. The Marshal seized Oviedo on the nineteenth: the place was pillaged in the most thorough fashion by his troops. In his dispatch he makes the excuse that a few peasants had attempted to defend some barricades in the suburbs, and that they, not the soldiery, had begun the sack. Credat Judaeus Apella! The ways of the bands of Napoleon are too well known, and we shall not believe that it was Spaniards who stole the cathedral plate, or tore the bones of the early kings of Asturias from their resting-places in search of treasure[482]. On May 20 Ney marched with one regiment down to Gijon, where he found 250,000 lbs. of powder newly landed from England, and a quantity of military stores. An English merchantman was captured and another burnt[483]. A detached column occupied Aviles, the second seaport of the Asturias. \n \n On the following day, May 21, a detachment sent inland from Oviedo up the valley of the Lena, with orders to search for the column coming from the south, got into touch with that[p. 382] force. Kellermann had duly reached Leon, where he found orders directing him to send back to Aragon the two regiments of the Third Corps which had been lent him[484], and to take instead a division of Mortier’s corps, which was now disposable for service in the north. Accordingly he picked up Girard’s (late Suchet’s) division, and leaving one of its brigades at Leon, marched with the other and the remainder of his original force, to storm the defiles of Pajares. He had with him between 6,000 and 7,000 troops, a force with which he easily routed the Asturian brigade of 3,000 men under Colonel Quixano, which had been set to guard the pass. At the end of two days of irregular fighting, Kellermann descended into the valley of the Lena and met Ney’s outposts on May 21. The routed enemy dispersed among the hills. \n \n It remains to speak of the third French column which started to invade the Asturias, that of Bonnet. This general marched from Santander on May 17 with 5,000 men, intending to attack Ballasteros, and force his way to Oviedo by the coast-road that passes by San Vincente de la Barquera and Villaviciosa. But he found no one to fight, for Ballasteros had been summoned by La Romana to defend Oviedo, and had started off by the inland road via Cangas de O?is and Infiesto. The two armies therefore were marching parallel to each other, with rough mountains between them. On reaching Infiesto on May 21, Ballasteros heard of the fall of Oviedo and of the forcing of the pass of Pajares: seeing that it would be useless to run into the lion’s mouth by proceeding any further, he fell back into the mountains, and took refuge in the upland valley of Covadonga, the site of King Pelayo’s famous victory over the Moors in the year 718. Here he remained undiscovered, and was gradually joined by the wrecks of the force which Ney had routed at Oviedo, including O’Donnell and the Princesa regiment. Bonnet passed him without discovering his whereabouts, advanced as far as Infiesto and Villaviciosa, and got into touch with Kellermann. \n \n Thus the three French columns had all won their way into the heart of the Asturias, but though they had seized its capital and its seaports, they had failed to catch its army, and only half their task had been performed. Of all the Asturian troops[p. 383] only the two small forces at Oviedo and Pajares had been met and routed. Worster had not been molested, Mahy had doubled back into Galicia, Ballasteros had gone up into the mountains. If the invasion was to have any definite results, it was necessary to hunt down all these three divisions. But there was no time to do so: Ney was anxious about his Galician garrisons; Bonnet remembered that he had left Santander in charge of a weak detachment of no more than 1,200 men. Both refused to remain in the Asturias, or to engage in a long stern chase after the elusive Spaniards, among the peaks of the Pe?as de Europa and the Sierras Albas. They decided that Kellermann with his 7,000 men must finish the business. Accordingly they departed each to his own province—and it was high time, for their worst expectations had been fulfilled. Mahy in the west and Ballasteros in the east had each played the correct game, and had fallen upon the small garrisons left exposed in their rear. Moreover, the insurgents of Southern Galicia had crossed the Ulla and marched on Santiago. If Ney had remained ten days longer in the Asturias, it is probable that he would have returned to find the half of the Sixth Corps which he had left in Galicia absolutely exterminated. \n \n The Marshal, however, was just in time to prevent this disaster. Handing over the charge of the principality to Kellermann, he marched off on May 22 by the coast-road which leads to Galicia by the route of Navia, Castropol, and Ribadeo. He hoped to deal with Worster by the way, having learnt that the Swiss general had advanced from Castropol by La Romana’s orders, and was moving cautiously in the direction of Oviedo. But Worster was fortunate enough to escape: he went up into the mountains when he heard that Ney was near, and had the satisfaction of learning that the Marshal had passed him by. The rivers being in flood, and the bridges broken, the French had a slow and tiresome march to Ribadeo, which they only reached on May 26. Next day the Duke of Elchingen was at Castropol, where he received the news that Lugo had been in the gravest peril, and had only been relieved by the unexpected appearance of Soult and the Second Corps from the direction of Orense. \n \n The sequence of events during the Marshal’s absence had[p. 384] been as follows. When Mahy found that he had escaped pursuit, he had immediately made up his mind to strike at the French garrisons. He tried to persuade Worster to join him, or to attack Ferrol, but could not induce him to quit the Asturias. So with his own 6,000 men Mahy marched on Lugo, beat General Fournier (who came out to meet him) in a skirmish outside the walls, and drove him into the town. Lugo had no fortification save a mediaeval wall, and the Spaniards were in great hopes of storming it, as they had stormed Villafranca. But when they had lain two days before the place, they were surprised to hear that a large French force was marching against them; it was not Ney returning from the Asturias, but the dilapidated corps of Soult retreating from Orense. Wisely refusing to face an army of 19,000 men, Mahy raised the siege and retired to Villalba in the folds of the Sierra de Loba. On May 22 Soult entered Lugo, where he was at last able to give his men nine days’ rest, and could begin to cast about him for means to refit them with the proper equipment of an army, for, as we have seen, they were in a condition of absolute destitution and wholly unable to take the field. \n \n At Castropol Ney heard at one and the same moment that Lugo had been in danger and that it had been relieved. But he also received news of even greater importance from another quarter. Maucune and the detachment which he had left at Santiago had been defeated in the open field by the insurgents of Southern Galicia, and had been compelled to fall back on Corunna. This was now the point of danger, wherefore the Marshal neither moved to join Soult at Lugo, nor set himself to hunt Mahy in the mountains, but marched straight for Corunna to succour Maucune. \n \n The force which had defeated that general consisted in the main of the insurgents who had beleaguered Tuy and Vigo in March and April. They were now under Morillo and Garcia del Barrio, who were beginning to reduce them to some sort of discipline, and were organizing them into battalions and companies. But the core of the ‘Division of the Minho,’ as this force was now called, was composed of the small body of regulars which La Romana had left at Puebla de Senabria, under Martin La Carrera. That officer, after giving his feeble detachment some[p. 385] weeks of rest, had marched via Monterey and Orense to join the insurrectionary army. He brought with him nine guns and 2,000 men. On May 22 Carrera and Morillo crossed the Ulla and advanced on Santiago with 10,000 men, of whom only 7,000 possessed firearms. Maucune came forth to meet them in the Campo de Estrella[485], outside the city, with his four battalions and a regiment of chasseurs, thinking to gain an easy success when the enemy offered him battle in the open. But he was outnumbered by three to one, and as the Galicians showed much spirit and stood steadily to their guns, he was repulsed with loss. Carrera then attacked in his turn, drove the French into Santiago, chased them through the town, and pursued them for a league beyond it. Maucune was wounded, and lost 600 men—a fifth of his whole force—and two guns. He fell back in disorder on Corunna. He had the audacity to write to Ney that he had retired after an indecisive combat: but the Marshal, reading between the lines of his dispatch, hastened to Corunna with all the troops which had returned from the Asturias, and did not consider the situation secure till he learnt that Carrera had not advanced from Santiago. \n \n Leaving his main body opposite the ‘Division of the Minho,’ the Duke of Elchingen now betook himself to Lugo, to concert a joint plan of operation with Soult [May 30]. The results of their somewhat stormy conference must be told in another chapter. \n \n Meanwhile the situation behind them was rapidly changing. On May 24 La Romana, who had landed at Ribadeo, rejoined Mahy and his army at Villalba. The Marquis, on surveying the situation, came to the conclusion that it was too dangerous to remain in the northern angle of Galicia, between the French army at Lugo and the sea. He resolved to return to the southern region of the province, and to get into touch with Carrera and the troops on the Minho. He therefore bade his army prepare for another forced march across the mountains. They murmured but obeyed, and, cautiously slipping past Soult’s corps by a flank movement, crossed the high-road to Villafranca and reached Monforte de Lemos. From thence[p. 386] they safely descended to Orense, where La Romana established his head quarters [June 6]. Thus the Spaniards were once more in line, and prepared to defend the whole of Southern Galicia. \n \n We have still to deal with the state of affairs in the Asturias. After Ney’s departure on May 22, Kellermann lay at Oviedo and Bonnet at Infiesto. But a few days later the latter general received the disquieting news that Ballasteros, whose movements had hitherto escaped him, was on the move towards the east, and might be intending either to make a raid into the plains of Castile, or to descend on Santander and its weak garrison. \n \n Ballasteros, as a matter of fact, had resolved to stir up trouble in Bonnet’s rear, with the object of drawing him off from the Asturias. Leaving his refuge at Covadonga on May 24 he marched by mule-tracks, unmarked on any map, to Potes in the upper valley of the Deba. There he remained a few days, and finding that he was unpursued, and that his exact situation was unknown to the French, resolved to make a dash for Santander. Starting on June 6 and keeping to the mountains, he successfully achieved his end, and arrived at his goal before the garrison of that place had any knowledge of his approach. On the morning of June 10 he stormed the city, driving out General Noirot, who escaped with 1,000 men, but capturing 200 of the garrison and 400 sick in hospital, as well as the whole of the stores and munitions of Bonnet’s regiments. Among his other prizes was the sum of ￡10,000 in cash, in the military chest of the division. Some of the French tried to escape by sea, in three corvettes and two luggers which lay in the harbour, but the British frigates Amelia and Statira, which lay off the coast, captured them all. This was a splendid stroke, and if Ballasteros had been prudent he might have got away unharmed with all his plunder. But he lingered in Santander, though he knew that Bonnet must be in pursuit of him, and resolved to defend the town. The French general had started to protect his base and his dép?ts, the moment that he ascertained the real direction of Ballasteros’ march. On the night of June 10 he met the fugitive garrison and learnt that Santander had fallen. Late on the ensuing day he reached its suburbs, and sent in two battalions to make a dash at the place. They were beaten off; but next[p. 387] morning Bonnet attacked with his whole force, the Asturians were defeated, and Ballasteros’ raid ended in a disaster. He himself escaped by sea, but 3,000 of his men were captured, and the rest dispersed. The French recovered their sick and prisoners, and such of their stores as the Spaniards had not consumed[486]. The wrecks of Ballasteros’ division drifted back over the hills to their native principality, save one detachment, the regulars of La Romana’s old regiment of La Princesa. This small body of 300 men turned south, and by an astounding march across Old Castile and Aragon reached Molina on the borders of Valencia, where they joined the army of Blake. They had gone 250 miles through territory of which the French were supposed to be in military possession, but threaded their way between the garrisons in perfect safety, because the peasantry never betrayed their position to the enemy. \n \n Disastrous as was its end, Ballasteros’ expedition had yet served its purpose. Not only had it thrown the whole of the French garrisons in Biscay and Guipuzcoa into confusion, but even the Governor of Bayonne had been frightened and had sent alarming dispatches to the Emperor. This was comparatively unimportant, but it was a very different matter that Bonnet had been forced to evacuate the Asturias, all of whose eastern region was now free from the invaders. \n \n More was to follow: Kellermann still lay at Oviedo, worried but not seriously incommoded by Worster and the Asturians of the west. But a few days after Bonnet’s departure he received a request from Mortier (backed by orders from King Joseph), that the division of the 5th Corps which had been lent him should instantly return to Castile. This was one of the results of Wellesley’s campaign on the Douro, for Mortier, hearing of Soult’s expulsion from Northern Portugal, imagined that the British army, being now free for further action, would debouch by Almeida and Ciudad Rodrigo and fall upon Salamanca. He needed the aid of his second division, which Kellermann was forced to send back. But it would have been not only useless but extremely dangerous to linger at Oviedo with the small remnant of the expeditionary force, when Girard’s regiments[p. 388] had been withdrawn. Therefore Kellermann wisely resolved to evacuate the whole principality, and returned to Leon by the pass of Pajares in the third week of June. \n \n Thus ended in complete failure the great concentric attack on the Asturias. The causes of the fiasco were two. (1) The French generals chose as their objective, not the enemy’s armies, but his capital and base of operations. Both Ney and Bonnet while marching on Oviedo left what (adapting a naval phrase) we may call an ‘army-in-being’ behind them, and in each case that army fell upon the detachments left in the rear, and pressed them so hard that the invading forces could not stay in the Asturias, but were forced to turn back to protect their communications. (2) In Spain conquest was useless unless a garrison could be left behind to hold down the territory that was overrun. But neither Ney, Kellermann, nor Bonnet had any troops to devote to such a purpose: they invaded the Asturias with regiments borrowed from other regions, from which they could not long be spared. As later experience in 1811 and 1812 showed, it required some 8,000 men merely to maintain a hold upon Oviedo and the central parts of the principality. The invaders had no such force at their disposition—the troops from the 6th Corps were wanted in Galicia, those of the 5th Corps in Castile, those of Bonnet in the Monta?a. If it were impossible to garrison the Asturias, the invasion dwindled down into a raid, and a raid which left untouched the larger part of the enemy’s field army was useless. It would have been better policy to hunt Mahy, Worster, and Ballasteros rather than to secure for a bare three weeks military possession of Oviedo and Gijon. If Soult had not dropped from the clouds, as it were, to save Lugo: if Ballasteros had been a little more prudent at Santander, the Asturian expedition would have ended not merely in a failure, but in an ignominious defeat. It should never have been undertaken while the Galician insurrection was still raging, and while no troops were available for the permanent garrisoning of the principality. \n \n Searching a little deeper, may we not say that the ultimate cause of the fiasco was Napoleon’s misconception of the character of the Spanish war? It was he who ordered the invasion of the Asturias, and he issued his orders under the hypothesis that it[p. 389] could be not only conquered but retained. But with the numbers then at the disposal of his generals this was impossible, because the insurrection absorbed so many of their troops, that no more could be detached without risking the loss of all that had been already gained. By grasping at the Asturias Napoleon nearly lost Galicia. Only Soult’s appearance prevented that province from falling completely into the hands of Mahy and La Carrera: and that appearance was as involuntary as it was unexpected. If the Duke of Dalmatia had been able to carry out his original design he would have retreated from Oporto to Zamora and not to Orense. If Beresford had not foiled him at Amarante, he would have been resting on the Douro when Fournier was in such desperate straits at Lugo. In that case Ney might have returned from Oviedo to find that his detachments had been destroyed, and that Galicia was lost. It was not the Emperor’s fault that this disaster failed to occur. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2040/58153.html","bookId":611,"book":{"id":611,"title":"A History of the Peninsula war 半岛战争史","description":"简介： It is many years since an attempt has been made in England to deal with the general history of the Peninsular War. Several interesting and valuable diaries or memoirs of officers who took part in the great struggle have been published of late[1], but...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2040","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
