{"id":86257,"no":23,"title":"Page 23","content":"He carried me up to the penthouse and to the bedroom. He started to help me undress as I stopped him.\\n\\n “I’m fine; you need to get out of those wet clothes. Please go change; I’m going to take a hot bath.”\\n\\n “Do you feel well enough to take a bath by yourself?”\\n\\n I shot him a look, “If I said no does that mean you’ll get in with me?”\\n\\n He looked down, “Ellery.”\\n\\n I saw the look on his face, and it was one of pain, almost the same look as the day in the hotel room.\\n\\n “I was kidding Connor, now get out of here and go change.”\\n\\n He walked out and left me standing there feeling like an idiot. I didn’t make it to the bathtub. I put on my nightshirt and robe and collapsed on top of the bed.\\n\\n Chapter 28\\n\\n I woke up 4 hours later and couldn’t move. The part I feared the most hit me; the pain. I started to whimper when I wanted to scream because I didn’t want anyone to hear me. My body felt like it’d been hacked into a million pieces, starting from the top of my head down to my toes. There wasn’t a single bone, joint, or muscle that didn’t hurt. I tried to get comfortable, but I couldn’t. I slowly got off the bed and wanted to scream when my feet touched the floor. I stood up and made my way to the door; I stepped out into the hallway and dropped to my knees and then onto my side.\\n\\n I started to cry, more a soft whimper like a puppy. Connor must have been in his office, which was the room next to the staircase because I could hear him on the phone. I tried to crawl to the bathroom, but the pain was too great. It wasn’t too long when I saw Connor running up the stairs, skipping a step in between.\\n\\n “Ellery, my god, what’s wrong?”\\n\\n At that point, I was shaking uncontrollably. I put my hand up. “Don’t touch me, it hurts,” I cried.\\n\\n He yelled for Claire and told her to call the nurse immediately and get her over to the penthouse. He sat down beside me and touched my hair.\\n\\n “I need to get back in bed, just pick me up and get it over with,” I begged. He stood and picked me up off the ground. He flinched as I screamed. He carefully carried me into the bedroom and laid me on the bed.\\n\\n “The nurse will be here soon; she’ll help you,” he said as he gently brushed the hair away from my face.\\n\\n I looked at him and cried, “I’m sorry, I’m so sorry for this, I never wanted you to see me like this.”\\n\\n He knelt down beside the bed and lightly touched my hand. “You have nothing to be sorry for; I’m the one who is sorry. It kills me to see you in such pain,” he said as a single tear fell down his cheek.\\n\\n I took my thumb and gently wiped the tear from his face as he took my hand and looked at my wrist; the one tattooed with his name. He didn’t have a chance to say anything as the nurse came in with her bag. Connor stood up and sat at the edge of the bed while Claire stood in the doorway.\\n\\n “You are going to be just fine sweetie,” she said as she held up a needle. “I’m going to give you a shot of morph**e for the pain.”\\n\\n She injected the shot into my hip and told me to relax. She then asked Connor to step into the hallway. I started to relax as the pain started to subside. Connor walked back in room and to the other side of the bed, where he sat up with his back against the headboard. I turned on my side to face him.\\n\\n “It isn’t always going to be like this,” I said. “The first 3 days after chemo are the worse than I am usually fortunate enough to have a few days where I feel good; well as good as can be expected on chemo.” He didn’t say a word; he only sat there playing with my hair.\\n\\n “Don’t get to use to doing that, it’s going to be gone soon.”\\n\\n He flashed me that smile that melts my heart, “I don’t care; you’ll still be just as beautiful.”\\n\\n I smiled at him, and he kissed me lightly on my forehead. He softly took a hold of both my wrists and looked at them, rubbing the tattoos lightly. I saw the anguish in his eyes.\\n\\n “I noticed these at the hospital when you were receiving chemo. I’ve been waiting for you to show me; why Ellery?” He asked.\\n\\n I rolled over as the morph**e settled through my body and I was able to step out of bed and slowly walked over to the window. “Because at some point you have to realize that some people can stay in your heart, but not in your life, and this is my way of keeping you in my heart.”\\n\\n Silence overtook the large room until I felt his arms wrap around me and he softly whispered in my ear.\\n\\n “Get back in bed and I’ll bring you some tea.”\\n\\n I turned around with his arms still wrapped around me as I delicately kissed him on the cheek. He closed his eyes and took in a sharp breath. He released his arms from me and left the room. He came back a few minutes later with a cup of peppermint tea and set it on the nightstand, then climbed on the other side and sat next to me.\\n\\n “Peyton called me and read me the riot act,” he laughed.\\n\\n “Why would she do that?” I asked.\\n\\n “She said she’s been trying to get a hold of you for a couple of days and when she didn’t have any luck, she called me. When I told her about your chemo and that you were staying here, she started yelling and said to sit tight because she was coming straight over from the airport to kick my ass.”\\n\\n I rolled my eyes, “Oh god, not tonight.”\\n\\n Connor lightly laughed, “No, tomorrow, her flight was delayed.\\n\\n I let out a sigh of relief, “Good, because tonight I couldn’t deal with her.”\\n\\n I must have drifted to sleep because when I woke up I was under the covers and Connor was gone. I felt so alone and did the only thing I couldn’t control, I cried. As my shoulders were shaking and the sobs were buried deep in my pillow, I felt an overwhelming sense of comfort from behind.\\n\\n “It’s ok baby, I’m here.” Connor wrapped his arms around me and held me the rest of the night.\\n\\n I woke up and patted the empty side where Connor laid and held me last night. I wanted to wake up in his arms and I wanted him to tell me that he loved me. I’m getting too many mixed signals from him; it’s hurting me and I don’t have the strength to fight cancer and him at the same time.\\n\\n I felt like my chemo fog lifted and I was starting to feel somewhat normal, as if I even knew what normal was anymore. I followed the aroma of coffee down the stairs and into the kitchen where Claire was cooking.\\n\\n “Good morning dear,” she turned and smiled.\\n\\n “Good morning Claire, I am in desperate need of some coffee.”\\n\\n She walked to the cabinet and grabbed a mug, “One cup coming right up.”\\n\\n I heard a raised voice coming from over by the living room. I took my coffee and walked towards it when I noticed it was coming from Connor’s office. He was on the phone and he sounded angry.\\n\\n “It’s complicated Ashlyn. Yeah, well I’m sorry about the other night but something came up; fuck,” I heard him yell as he threw his phone across his desk. He paced back and forth, rubbing the back of his neck and shaking his head. It hurt me to the very core that he still talked to her and still never explained to me who she was and what their relationship was. I heard his footsteps coming towards the door as I darted back into the kitchen.\\n\\n He walked in and looked at me, “Are you ok today? You look better.” I could see the anguish in his face. He looked tired and weary.\\n\\n “I’m fine,” I said as I looked down.\\n\\n Then out of nowhere he went off on a tangent and started yelling, “You always say you’re fine Elle, even when you’re not, are you ever really fine? Can you ever just tell me the f**king truth for once in your f**king life so I can stop playing these goddamn guessing games? Can you say something other than I’m fine Connor, because you know what Ellery, it makes me sick.”\\n\\n I stood there shocked, unable to say anything in my defense. I didn’t know this man standing in front of me and I didn’t want to know him at this moment either. He stood with his hands on the counter, his body pushed away from it with his head down. I walked over to him and as he looked at me, I took my hand and slapped him as hard as I could across his face. There was no emotion in his eyes or on his face, just like that night at the club. I walked out of the kitchen and started up the stairs. I heard something break as Claire looked at me from the living room. Before I made it to my room, I heard the front door slam. My heart was racing, but other than that I felt nothing at that moment. I couldn’t stay in his house another day. He was too affected by my illness and he didn’t deserve to live like this. I packed my bag and left.\\n\\n I hailed a cab and went back to my cold, lonely apartment. I walked to my room and pulled out a piece of paper from under my mattress. I stared at it for a while, folded it up and tucked it in my purse. I threw the rest of my clothes, or really what would fit into the bag that was already packed. I grabbed some cash from my drawer, grabbed my laptop and left. I walked down the street for a bit until I was able to hail a cab. I got in and smiled when I saw Manny looking at me from the front.\\n\\n “Are you going somewhere Elle?”\\n\\n “Yeah Manny, I am going somewhere, but I need you to promise me something.”\\n\\n “Of course, anything,” he said.\\n\\n “I need you to take me to the airport and you cannot tell a single person where you took me or that you saw me, please.” He looked at me from the rearview mirror, “Yeah, ok Elle, don’t worry, I never saw you.”\\n\\n I arrived at airport and was fortunate enough to book the flight that was leaving in 30 minutes to Michigan. I checked my bag and ran to the gate. I handed the man my ticket and boarded the plane. I sat in my seat and took a deep breath. My phone beeped and as I took it out of my pocket; I saw a text message from Connor.\\n\\n “I want to apologize for my behavior, I’m on my way back to the penthouse and we need to talk, if you’re feeling up to it we can go out for lunch.”\\n\\n My heart sank as I read his words, but it was too late, I knew what I had to do now; it’s probably what I should have done from the start, before Connor Black walked into my life.\\n\\n Chapter 29\\n\\n I took a cab to the bank where my father used to do all his banking. I stepped inside and walked over to the teller handing her the folded piece of paper I took from my purse. She walked me over to the safety deposit boxes, pulled the number that was indicated on the paper and led me to a small room.\\n\\n “Let me know when you’re finished,” she smiled. I stared at the box and the letter as the memory of my father’s death haunted me.\\n\\n Dear Ellery,\\n\\n If you’re reading this letter that means one thing that I’ve gone to be with your mother. I’m sorry for being such a lousy father to you. I tried to do what’s right by you, but the death of your mother was too much for me to handle and drinking was the only way to kill the pain, at least for me. No matter how bad it got you always stood by me and took care of me when I should have been the one taking care of you. You had to grow up so fast and I’m sorry for that. I feel like I stole your childhood from under you. You should have been playing with your friends and having fun, instead you were home taking care of your alcoholic father because he wasn’t strong enough to help himself. I do know one thing Ellery; I know that you grew into a strong young lady. I know you’ve endured a lot of heartache through the years and then having to fight cancer was unfair, but you did it baby and I’m so proud of you. If I don’t or didn’t get the chance to tell you that, I am now. I am so proud of my little girl. Your mother gave me the attached instructions before she died and asked me to hold it until you were eighteen. It’s the number of a safety deposit box your mother had kept for you. I’ve been adding to it every year since your mother passed. When you are ready, go and open the box and remember how much you are loved. Love always, Dad. \\n\\n","sourceLink":"https://allnovel.net/forever-black-forever-1/page-23.html","bookId":1821,"book":{"id":1821,"title":"Forever Black (Forever #1)","description":"Storyline: When Ellery moved to New York with her boyfriend, she thought they’d live happily ever after in their small New York apartment. She never thought he’d pack his bags and leave because he “needed space.” With her newfound single status and fear of being alone, Ellery buries herself in her artwork and paintings until one night she helps a mysterious intoxicated stranger get home safely. Little did she know the mysterious stranger is none other than CEO and millionaire Connor Black. After finding Ellery in his kitchen the next morning and assuming she broke his #1 rule about sleepovers, he becomes intrigued, not only by her stubbornness and defiance, but by her kindness. \\n Connor Black, emotionally dead and damaged, that stemmed from a personal tragedy, made a vow to never love or fall in love with a woman, until Ellery Lane walked into his life by accident. After she opens up and shows him her world, Connor starts to feel emotions and feelings he never knew existed. Despite the rumors and warnings regarding Connor Black and his use and misuse of women, Ellery finds herself being drawn into his world. \\n Ellery knows they can never be together because she is harboring a deep secret that could destroy Connor emotionally forever. \\n Join Connor and Ellery as they embark on a journey of courage, love and strength. Will it be enough to save them?\\n","cover":"https://allnovel.net/images/forever-black-forever-1.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-black-forever-1.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:12:16 PM"}}
