{"id":86244,"no":9,"title":"Page 9","content":"Connor let go of my hand, put his arm around me and pulled me into him. I rested my head on his shoulder. He was firm, and it felt good to be held.\\n\\n “That is why you have this overwhelming need to help others isn’t it?” he asked as he lightly kissed the top of my head. “You’re a good person Ellery Lane,” he whispered in my ear.\\n\\n I smiled and closed my eyes. I felt his strong arms pick me up as he carried me across the sand and to his car, which was not his Limo, it was a Range Rover. He carefully laid me in the front seat as I stirred; he whispered, “Sleep angel.”\\n\\n He pulled up to my apartment, opened my purse to find my keys then carried me to the door. My arms were tightly wrapped around his neck. He inserted the key into the lock and lightly kicked the door open with his foot. He carried me to the bedroom and laid me gently on the bed. I was somewhat aware of what he was doing, but I was too exhausted to move.\\n\\n He covered me with a blanket and brought the back of his hand to my cheek as he softly rubbed it, “Sleep well angel and sweet dreams.”\\n\\n Chapter 13\\n\\n The next morning was a work day, and I did not have to be there till noon. I dragged my ass out of bed and got out of my evening gown. I was thankful he didn’t undress me, ok maybe I wanted him to because the moments we shared on the beach was something I never wanted to forget. I felt something change in him last night.\\n\\n I stood under the hot water and let it overtake me. I couldn’t stop thinking about Connor and how sweet and gentle he was with me last night. I exposed my deepest secret to him, and now regret was settling in. I should not have shown him that side of me; it was too dangerous. I dressed in my leggings and long tunic top, put my hair up in a ponytail and headed to the kitchen to make some coffee. I couldn’t shake the feeling of stupidity for telling him; sometimes I just do not know when to keep my mouth shut.\\n\\n As I waited for the coffee to brew, I went in my purse and grabbed my phone; there was a text message from Connor.\\n\\n “Hi, I hope you slept well, I just wanted to see if you were up and how you were feeling.”\\n\\n A small smile escaped me as I replied, “Good morning, I slept good and I’m feeling fine, thank you for your concern. I hope you have a terrific day and don’t work too hard.”\\n\\n “I’m glad you are feeling fine, and I always work hard, it’s why I’m as successful as I am.”\\n\\n “I believe that and thank you for taking care of me last night, I owe you one!\\n\\n “Consider it repayment for when you got me home safe. I have a meeting TTYL.”\\n\\n “Bye.”\\n\\n I poured some coffee into a mug that read: “I’m not gay, but my ex-boyfriend is,” compliments of Peyton. I walked over at the desk that housed my laptop, opened the drawer and took out the piece of paper that sits neatly on top of a magazine. I looked over the paper and with a pen I scribbled on it and put it back in its place till I needed it again.\\n\\n I stepped outside and walked down the street, I had an hour before I had to be at work, so I decided to walk the few blocks it took to get there. The air was cooler today as the sun hid behind a stream of clouds. Today was a different sight than it had been in months. People had broken into their fall wardrobe and pulled out the “chilly” day clothes. Pants, long sleeves, cardigans and light jackets graced the streets of New York City as people prepared for the arrival of fall.\\n\\n I passed Starbucks on my way to work, and of course, I had to stop as if I needed more caffeine. I walked in and stood in a line that took up half the café. I reached in my bag and grabbed my phone, I promised Peyton I would call and tell her about last night. I dialed her number and waited for her to answer; after a few rings it went to voicemail.\\n\\n “Hey Peyton, it’s me, I had a fabulous time last night with Connor. I’m on my way to work, call me later for girl talk, love ya.”\\n\\n It was finally my turn as I ordered a Grande Cinnamon Dolce Latte. I paid the barista and walked outside with my coffee in hand and on my way to work. As I walked down the crowded street, I noticed a black Limo parked across from a tall building. The Limo door opened as a familiar woman got out and then came Connor, following her and adjusting his tie. My stomach felt sick and my heart started racing, not out of passion, but out of nerves. He looked over and saw me standing there a few feet away. I couldn’t let him know the rage and jealousy I was feeling at that moment seeing them together, so I smiled and waved just like any friend would do. His face looked pained when he saw me. He did not smile back; he could only manage a small wave. They walked up to the tall building and went inside. As I walked past, I noticed the name of the business on the large double doors, “Black Enterprises.” I never realized that is what this building was as I passed it all the time.\\n\\n I continued walking as a wave of betrayal coursed through my veins. There was no reason for me to feel this way. Connor and I are friends and nothing more; there could never be more. I struggled with my emotions all the way to work and tried to reason with myself that he did nothing wrong. If he and I were going to remain friends, then I would have to get used to seeing him with other women. He was not mine, and I was not his. I kept saying that as I finally arrived at work.\\n\\n It was a slow day at work, which sucked because it gave me more time to think about Connor and the tall beautiful woman that got out of the Limo. I had no right to even think about them, but after the moment we shared last night, I could not help but wonder that maybe he had feelings for me. Whom was I kidding? Connor Black is a player, and I’ve already been warned about him. I needed to do some serious soul-searching, and the best place to do that was at my favorite pizza place.\\n\\n The workday finally ended. I grabbed my phone and purse and headed out the door. I came to a standstill when I saw Denny leaning up against the Limo parked at the curb. I narrowed my eyes at him.\\n\\n “Hi Denny, what are you doing here?” I curiously asked.\\n\\n “Hello Miss Lane, Mr. Black sent me to pick you up and take you to the restaurant where he will meet you in 15 minutes for dinner.”\\n\\n “Is that so?” I asked as I put my hands on my hips. He looked at me with a smirk on his face because he knew what was coming next.\\n\\n “You can tell Mr. Black that I am not available this evening. I have other plans.”\\n\\n I started walking away as I turned my head back, “Also, tell him that if he wants to have dinner with me then he can pick up the phone and ask me.” I put my hand up and waved, “Bye Denny have a great night.”\\n\\n Pizzapopolous was a couple of blocks away, and the chilly evening air was settling in. I sat down at a table close to the window and opened the menu. The restaurant was small with about 20 tables that took up the space. The white walls were decorated with photographs of all the celebrities that dined there. The tables were decorated with red and white gingham tablecloths and white napkins. The atmosphere was casual and quaint, and they had the best pizza.\\n\\n I was digging through my purse for my phone when I saw the shadow of someone sit down across from me. I looked up, and there was Connor glaring at me; I rolled my eyes.\\n\\n “So, this is where you want to have dinner?” he asked.\\n\\n I tilted my head to the side and looked at his smoldering face, “Yes Connor, this is where I’m having dinner tonight, and I don’t believe you were invited.”\\n\\n He put his hand over his heart, “Ouch that stings Ellery. I invited you to dinner, and you turned me down, so I took it upon myself to join you.”\\n\\n “How do you know I want company?”\\n\\n He put his hands on the table and folded them, “I don’t, but since I’m here we might as well dine together,” he said as he looked around the restaurant.\\n\\n The whole point of this dinner was for me to do some soul-searching and that was going to be extremely hard with him sitting across from me.\\n\\n The waitress came over and started drooling when she asked Connor what he would like to order. He looked the menu up and down and decided on a salad. I looked at him and grabbed the menu out of his hand.\\n\\n “You cannot sit in a pizza place and only get a salad.”\\n\\n I looked at the waitress and cleared my throat to divert her attention away from Connor. “We’ll have a large deep dish with pepperoni, mushrooms and black olives, a large antipasto salad and an order of bread sticks.”\\n\\n Connor brought his finger up and rested it on his lips, “Do you actually think I’m going to eat that pizza?”\\n\\n “I don’t think you are; I know you are,” I smiled.\\n\\n I set my phone on the table and looked at him. If he so rudely wanted to interrupt my dinner plans, then he will have to answer some questions. “Who is that woman you’re always with?” The words just came out before I could think about them. He shifted in his seat.\\n\\n “She’s a friend Ellery,” he softly answered my question. I knew he was lying. Perhaps she was a friend, but what kind of friend is what I wanted to know.\\n\\n “What kind of friend Connor?”\\n\\n His green eyes turned dark as he glared at me, “She doesn’t matter Ellery; she is a friend and that is all you need to know.”\\n\\n I raised my eyebrows, “I think after what I told you last night you would be willing to tell me a few things.”\\n\\n “I’m not in the habit of discussing my personal life. It’s called personal for a reason Ellery.”\\n\\n He didn’t realize it, but at that moment he made a decision for me. The waitress brought our pizza and put it in the middle of the table along with salad and bread sticks. I picked up a slice of pizza with the spatula and put it on his plate. He sighed and grabbed his fork and knife.\\n\\n “What? Are you kidding me? Put that down right now Connor Black.”\\n\\n He looked startled, “What? What the hell is wrong?”\\n\\n I leaned over the table and grabbed the knife and fork out of his hand, “You are not eating pizza with a knife and fork.”\\n\\n “Then how the hell am I supposed to eat it?”\\n\\n He was so damn sexy at that moment. I picked up my pizza and took a bite. With a mouthful, I said, “Like this, pick it up and bite into it.”\\n\\n “That’s disgusting and don’t talk with your mouth full.”\\n\\n “If you won’t do it then I will.” I picked up the pizza from his plate and held it up to his mouth.\\n\\n “Bite” I demanded.\\n\\n He raised his eyebrows at me, “Do you have any idea how sexy that sounds?” he winked.\\n\\n I couldn’t help but let out a light laugh as I hit him on his arm. He rolled his eyes, which was sexy as hell, opened his mouth and took a bite of the pizza. I smiled as I put the pizza back on his plate.\\n\\n “My turn,” he smiled.\\n\\n “Your turn what?”\\n\\n He took the pizza from my plate and held it up.\\n\\n “Bite” he demanded.\\n\\n I took a bite, and a wide grin graced his perfect face. I think that may have been the first time since I’ve known him that I’ve seen him smile like that. It was the most beautiful and warm smile I’ve ever seen, and it made my heart flutter.\\n\\n We ate more pizza, talked and ate some salad. The waitress kept walking by our table and giving Connor flirtatious smiles. \\n\\n","sourceLink":"https://allnovel.net/forever-black-forever-1/page-9.html","bookId":1821,"book":{"id":1821,"title":"Forever Black (Forever #1)","description":"Storyline: When Ellery moved to New York with her boyfriend, she thought they’d live happily ever after in their small New York apartment. She never thought he’d pack his bags and leave because he “needed space.” With her newfound single status and fear of being alone, Ellery buries herself in her artwork and paintings until one night she helps a mysterious intoxicated stranger get home safely. Little did she know the mysterious stranger is none other than CEO and millionaire Connor Black. After finding Ellery in his kitchen the next morning and assuming she broke his #1 rule about sleepovers, he becomes intrigued, not only by her stubbornness and defiance, but by her kindness. \\n Connor Black, emotionally dead and damaged, that stemmed from a personal tragedy, made a vow to never love or fall in love with a woman, until Ellery Lane walked into his life by accident. After she opens up and shows him her world, Connor starts to feel emotions and feelings he never knew existed. Despite the rumors and warnings regarding Connor Black and his use and misuse of women, Ellery finds herself being drawn into his world. \\n Ellery knows they can never be together because she is harboring a deep secret that could destroy Connor emotionally forever. \\n Join Connor and Ellery as they embark on a journey of courage, love and strength. Will it be enough to save them?\\n","cover":"https://allnovel.net/images/forever-black-forever-1.jpg","author":"Sandi Lynn","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-black-forever-1.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:12:16 PM"}}
