{"id":109608,"no":18,"title":"Page 18","content":"I CERTAINLY HADN\u0027T EXPECTED to walk away from today\u0027s trip with joint custody of a miniature dragon. (I refused to call it a demon). And, as it turned out, Adrian was already proving not to be the most dedicated of \"fathers.\" \"You can take him for now,\" he told me when we got back to Amberwood. \"I\u0027ll handle weekend visitations.\" \"You don\u0027t have anything going on. Besides, we\u0027re only a few days from the weekend,\" I protested. \"And you don\u0027t know that it\u0027s a \u0027he.\u0027\" \"Well, I don\u0027t think he\u0027ll mind, and besides, I\u0027m not going to investigate to find out the truth.\" Adrian put the quartz in the basket and closed the lid before handing it over to me. \"You don\u0027t have to summon him back, you know.\" I took the basket and opened the car door. \"I know. But I feel kind of bad leaving him as a rock.\" Ms. Terwilliger had told me it\u0027d be healthier for him if I let him out once in a while. \"See? Motherly instinct already. You\u0027re a natural, Sage.\" Adrian grinned and handed me a bag of pie slices. He\u0027d kept some for himself. \"Look at you. You don\u0027t even need to break the tattoo. You think you would\u0027ve been mothering a baby dragon a month ago?\" \"I don\u0027t know.\" But he had a point. It seemed likely I would\u0027ve run screaming from it back in the desert. Or maybe tried to exorcise it. \"I\u0027ll take him for now, but you\u0027ve got to pull your weight at some point. Ms. Terwilliger says the callistana needs to spend time with both of us. Hmm.\" \"Hmm, what?\" I shook my head. \"Just getting ahead of myself. Wondering what I\u0027d do with him if I did go to Mexico.\" Adrian gave me a puzzled look. \"What about Mexico?\" It had never come up, I realized. All Adrian had known about was Marcus\u0027s mission and the initial tattoo breaking, not the sealing. I hadn\u0027t been keeping the rest a secret, but suddenly, I felt uncomfortable telling Adrian about it. \"Oh. Well, Marcus says that after I perform this rebellious act, we can break the elements and free me from the tattoo\u0027s control. But to truly bind the spell and make sure the tattoo is never repaired, I need to tattoo over it - like he did. He calls it sealing. But it takes some special compound that\u0027s hard to find. He got his done in Mexico and is going to take some of his Merry Men there so they can do it.\" \"I see.\" Adrian\u0027s smile had vanished. \"So. Are you joining them?\" I shrugged. \"I don\u0027t know. Marcus wants me to.\" \"I\u0027m sure he does.\" I ignored the tone. \"I\u0027ve thought about it . . . but it\u0027s a big step. Not just for the tattoo, either. If I did that, there\u0027d be no going back. I\u0027d be turning my back on the Alchemists.\" \"And us,\" he said. \"Unless you really are only helping Jill because of your orders.\" \"You know it\u0027s not about that anymore.\" Again, I didn\u0027t like his tone. \"You know I care about her and . . . and the rest of you.\" His face was hard. \"And yet you\u0027d run off with some guy you just met.\" \"It\u0027s not like that! We wouldn\u0027t be \u0027running off together. I\u0027d be coming back! And we\u0027d be going for a specific reason.\" \"Beaches and margaritas?\" I was speechless for a few moments. It was so close to what Marcus had joked about. Was that all anyone associated with Mexico? \"I see how it is,\" I snapped. \"You were all in favor of me breaking the tattoo and thinking on my own - but that\u0027s only okay if it\u0027s convenient for you, huh? Just like your loving from afar\u0027 only works if you don\u0027t have an opportunity to get your hands all over me. And your lips. And . . . stuff.\" Adrian rarely got mad, and I wouldn\u0027t quite say he was now. But he was definitely exasperated. \"Are you seriously in this much self-denial, Sydney? Like do you actually believe yourself when you say you don\u0027t feel anything? Especially after what\u0027s been happening between us?\" \"Nothing\u0027s happening between us,\" I said automatically. \"Physical attraction isn\u0027t the same as love. You of all people should know that.\" \"Ouch,\" he said. His expression hadn\u0027t changed, but I saw hurt in his eyes. I\u0027d wounded him. \"Is that what bothers you? My past? That maybe I\u0027m an expert in an area you aren\u0027t?\" \"One I\u0027m sure you\u0027d just love to educate me in. One more girl to add to your list of conquests.\" He was speechless for a few moments and then held up one finger. \"First, I don\u0027t have a list.\" Another finger. \"Second, if I did have a list, I could find someone a hell of lot less frustrating to add to it.\" For the third finger, he leaned toward me. \"And finally, I know that you know you\u0027re no conquest, so don\u0027t act like you seriously think that. You and I have been through too much together. We\u0027re too close, too connected. I wasn\u0027t that crazy on spirit when I said you\u0027re my flame in the dark. We chase away the shadows around each other. Our backgrounds don\u0027t matter. What we have is bigger than that. I love you, and beneath all that logic, calculation, and superstition, I know you love me too. Running away to Mexico and fleeing all your problems isn\u0027t going to change that. You\u0027re just going to end up scared and confused.\" \"I already feel that way,\" I said quietly. Adrian moved back and leaned into his seat, looking tired. \"Well, that\u0027s the most accurate thing you\u0027ve said so far.\" I grabbed the basket and jerked open the car door. Without another word, I stormed off toward the dorm, refusing to look back in case he saw the tears that had inexplicably appeared in my eyes. Only, I wasn\u0027t sure exactly which part of our conversation I was most upset about. The tears seemed like they were going to stay put by the time I reached my room, but I still had to calm down. Even once my emotions were settled, it was hard to shake his words. You\u0027re my flame in the dark. We chase away the shadows around each other. What did that even mean? At least smuggling a dragon into my room provided a pretty good distraction. I brought the basket inside, hoping demonic dragons weren\u0027t contraband. No one stopped me when I went upstairs, and I was left wondering how I was going to confine him if I did summon him back. The basket didn\u0027t seem all that secure, and I certainly wasn\u0027t going to let him run loose in my dorm room. When I reached my door, I found Jill standing outside, her pale green eyes wide with excitement. \"I want to see him,\" she said. The bond was strongest in moments of high emotion, and judging from Adrian\u0027s face when the dragon had been chasing us, his emotions had been running pretty strong. I wondered if she\u0027d witnessed our argument too or if that hadn\u0027t come through the bond. Maybe the tension between him and me was second nature to her now. \"I can\u0027t let him out yet,\" I said, letting her into my room. \"I need something to keep him in. Like a birdcage. Maybe I can get one tomorrow.\" Jill frowned in thought, then brightened. \"I have an idea.\" She glanced at my alarm clock. \"I hope it\u0027s not too late.\" And without further explanation, she took off, promising to be back soon. I was still a little shaky from today\u0027s magic but hadn\u0027t had time to rectify the situation after all the other excitement. So, I sat at my desk with a spell book and ate the rest of the now-soft coconut cream pie, careful to first cut off the part where the dragon had eaten. I didn\u0027t know if callistanas had communicable germs, but I wasn\u0027t taking any chances. Jill returned an hour later, bearing a rectangular glass aquarium, like the kind you\u0027d keep fish or gerbils in. \"Where\u0027d you get that?\" I asked, moving a lamp off my desk. \"My biology teacher. Our guinea pig died a couple weeks ago, and she\u0027s been too sad to replace him.\" \"Didn\u0027t she ask what you needed it for?\" I examined the tank and found it spotless, so someone had apparently cleaned it after the guinea pig\u0027s unfortunate passing. \"We can\u0027t have pets.\" \"I told her I was building a diorama. She didn\u0027t question it.\" Jill eagerly brought the aquarium over to the desk. \"We can give it back when you get your own.\" I set the quartz crystal inside and slammed on the tank\u0027s lid, making sure it was securely attached. After more entreating from Jill, I spoke the summoning words. A bit of smoke appeared, and the quartz transformed back into the dragon. Mercifully, he didn\u0027t make any more of that screeching, so I guessed he was still full. Instead, he scampered around the tank, examining his new home. At one point, he tried to climb the side, but his tiny claws couldn\u0027t get traction on the glass. \"Well, that\u0027s a relief,\" I said. Jill\u0027s face was filled with wonder. \"I think he\u0027ll be bored in there. You should get him some toys.\" \"Toys for a demon? Isn\u0027t it enough that I give him pie?\" \"He wants you,\" she insisted. Sure enough, I glanced back at the tank and found the callistana regarding me adoringly. He was even wagging his tail. \"No,\" I said sternly. \"This isn\u0027t a Disney movie where I have an adorable sidekick. You aren\u0027t coming out.\" I cut off a piece of blueberry pie and put it in the tank in case he wanted a midnight snack. No way would I risk a late-night wakeup call. After a moment\u0027s thought, I added a stress ball and a scarf. \"There,\" I told Jill. \"Food, a toy, and a bed. Happy?\" The callistana apparently was. He batted the ball around a few times and then curled up on the nest I\u0027d made with the scarf. He looked more or less content, aside from the fact that he kept watching me. \"Aww,\" she said. \"Look how sweet he is. What are you going to name him?\" Like I needed something else to worry about. \"His \u0027father\u0027 can name him. I\u0027m already on the hook for the Mustang.\" After a bit more swooning, Jill finally retired for the night. I made my own preparations for bed, always keeping one eye on the dragon. He did nothing threatening, however, and I even managed to fall asleep, though my sleep was restless. I kept imagining he\u0027d find a way out and come get into bed with me. And of course, I had my usual fears about Veronica coming after me. I did hit one stretch of sound sleep, during which Adrian pulled me into a spirit dream. After our earlier fight, I honestly hadn\u0027t expected to see him tonight, a thought that had saddened me. The reception hall materialized around us, but the image wavered and kept fading in and out. \"I didn\u0027t think you\u0027d come,\" I told him. No wedding clothes tonight. He wore what he\u0027d had on earlier, jeans and the AYE shirt, though both looked a bit more wrinkled. He was dressed as he was in reality, I realized. \"You think I\u0027d abandon you to Veronica?\" \"No,\" I admitted. \"What\u0027s wrong with the room?\" He looked a little embarrassed. \"My control\u0027s not all it could be tonight.\" I didn\u0027t understand . . . at first. \"You\u0027re drunk.\" \"I\u0027ve been drinking,\" he corrected, leaning against one of the tables. \"If I was drunk, I wouldn\u0027t be here at all. And really, this is pretty good for four White Russians.\" \"White what?\" I almost sat down but was afraid the chair might dematerialize beneath me. \"It\u0027s a drink,\" he said. \"You\u0027d think I wouldn\u0027t be into something named that - you know, considering my own personal experience with Russians. But they\u0027re surprisingly delicious. The drinks, not real Russians. They\u0027ve got Kahlua. It might be the drink you\u0027ve been waiting your whole life for.\" \"Kahlua does not taste like coffee,\" I said. \"So don\u0027t start with that.\" I was insanely curious to know why he\u0027d been drinking. Sometimes he did it to numb spirit, but he seemed to still want to access that magic tonight. And of course, half the time, he didn\u0027t even need a reason to drink. Deep inside me, I wondered if our fight had driven him to it. I didn\u0027t know whether to feel guilty or annoyed. \"I also had to come tonight to apologize,\" he said. He sat down, apparently not having the same fears about chairs. For one inexplicably terrifying moment, I thought he was going to take back the part about me being his flame in the dark. Instead, he told me, \"If you need to go to Mexico to finish this process off, then I understand. I was wrong to criticize you for it or even imply that I had some kind of say in it. One of the greatest things about you is that in the end, you always make smart decisions. Can\u0027t always say the same for myself. Whatever you need to do, I\u0027ll support you.\" Those annoying tears almost returned, and I blinked them back. \"Thank you. That means a lot . . . and to tell you the truth, right now, I still don\u0027t know what I\u0027m going to do. I know Marcus is worried about me eventually getting in trouble and being under their control. Then again, staying part of the Alchemists seems like it\u0027d give me more power, and besides . . . I don\u0027t want to leave you. Er, you guys.\" He smiled, and it lit up his whole face. Like a flame in the dark. \"Well, \u0027we\u0027 are certainly happy to hear that. Oh, and I\u0027m also happy to watch our darling little love child dragon while you\u0027re in St. Louis.\" I grinned back. \"As a rock or in his real form?\" \"Haven\u0027t decided yet. How\u0027s he doing right now?\" \"He\u0027s locked in an aquarium. I\u0027m guessing I\u0027d wake up if he got into bed with me, so he must still be asleep.\" I hoped. \"Well, I\u0027m sure getting into bed with you would be - \" Adrian held back whatever comment he\u0027d been about to utter. He instead gestured to the table, and a Monopoly board appeared. \"Shall we play?\" I walked over and peered at the board. It apparently was also suffering from his drinking, seeing as half the streets were blank. The ones that were there had names like \"Castile Causeway\" and \"Jailbait Avenue.\" \"The board\u0027s a little incomplete,\" I said diplomatically. Adrian didn\u0027t seem concerned. \"Well, then, I guess that improves your odds.\" I couldn\u0027t resist that and took a gamble on sitting in one of the chairs. I smiled at him and then began counting money, happy that all was (relatively) right in the world with us again.","sourceLink":"https://allnovel.net/the-indigo-spell-bloodlines-3/page-18.html","bookId":2043,"book":{"id":2043,"title":"The Indigo Spell (Bloodlines #3)","description":"Storyline: Sydney Sage is an Alchemist, one of a group of humans who dabble in magic and serve to bridge the worlds of humans and vampires. They protect vampire secrets - and human lives. In the aftermath of a forbidden moment that rocked Sydney to her core, she finds herself struggling to draw the line between her Alchemist teachings and what her heart is urging her to do. Then she meets alluring, rebellious Marcus Finch--a former Alchemist who escaped against all odds, and is now on the run. Marcus wants to teach Sydney the secrets he claims the Alchemists are hiding from her. But as he pushes her to rebel against the people who raised her, Sydney finds that breaking free is harder than she thought. There is an old and mysterious magic rooted deeply within her. And as she searches for an evil magic user targeting powerful young witches, she realizes that her only hope is to embrace her magical blood--or else she might be next.","cover":"https://allnovel.net/images/the-indigo-spell-bloodlines-3.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-indigo-spell-bloodlines-3.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:39:17 PM"}}
