{"id":70330,"no":22,"title":"Page 22","content":"\\n\\n Which is why she’d felt guilty keeping her purchase of the building in Moorcroft a secret from him.\\n\\n Now she was lying to him about her engagement to Jack. Although her dad would rejoice when it ended.\\n\\n Keely originally figured she’d have the same wahoo! sense of relief, but now, she wasn’t so sure. Jack Donohue had more layers, sides and facets to him than she’d imagined. He’d acted sweet and sour, kind and mean, gruff and gregarious, concerned and aloof. Maybe she’d misjudged him.\\n\\n Or maybe the rocking sex is clouding your judgment.\\n\\n Yeah. That had to be it.\\n\\n She put thoughts of Jack and her father out of her mind as she mentally planned her week. She heard tires crunching on the gravel, but it didn’t sound like her mother’s Lincoln Town Car. She stripped off her gloves and hung them to dry on the hook embedded in the wooden support beams. The door squeaked as she ventured out of the barn.\\n\\n Shielding her eyes from the sun didn’t help cut the glare. “Dad? Mom?”\\n\\n “No. It’s me.”\\n\\n She froze. “Jack? What’re you doin’ here?”\\n\\n “Have you ever noticed your tendency to slip into a Wyomin’ drawl is more pronounced whenever you’re nervous?”\\n\\n Keely snorted. “You do not make me nervous. Anyway, you didn’t answer my question.” She moved until she saw him leaning against his Beemer.\\n\\n Jack kept his arms crossed over his chest. “I had brunch with my mom and brother. Evidently my mom ended up with a piece of Carolyn’s silver service. She was mortified and I volunteered to bring it back for her.”\\n\\n She looked at Jack skeptically. There was an edge to him, an edge that automatically made her bristle.\\n\\n If he was here just to return a piece of silverware, she’d eat her hat.\\n\\n “Is your mother around?”\\n\\n “No. She and Dad haven’t come back yet. If you leave it with me, I’ll be sure she gets it.”\\n\\n He cocked his head. “What’s up with you acting so formal?”\\n\\n “Jesus, Jack, make up your mind. First you accused me of reverting to a twang, now you’re claiming I’m acting formal?”\\n\\n “I meant you’re acting awful formal for a woman who was on her knees with my dick in her mouth not five hours ago.”\\n\\n A blush stole across her cheeks, which pissed her off. This was how he treated her after she opened herself up to him? Screw him. “How’s this for formal? Fuck. Off. You’re an asshole.” Keely pivoted and stomped up the porch steps.\\n\\n Too bad she couldn’t provide him with a dramatic exit, slamming the door after she flounced into the house and locking it behind her. But her boots were filthy and she knew better than to track mud and horseshit across her mother’s floor. She sat on the edge of the boot bench.\\n\\n “Would you let me—”\\n\\n “Keep sayin’ crude shit like that to piss me off? Hell no. Go away.”\\n\\n “Look. I came here to try and do something nice—”\\n\\n “That comment was not nice by any stretch of the imagination.” She grunted as she yanked off her right boot. “I don’t know why I’m surprised we’re back to you only being nice to me when we’re in public.”\\n\\n “Or you only being nice to me when we’re fucking?” he taunted back.\\n\\n That did it.\\n\\n Goaded beyond control, Keely whipped her dirty boot at him. At least the man had good reflexes out of bed too and he was fast enough to duck.\\n\\n Jack’s look of surprise was downright comical. And totally worth it. “What the hell was that for?”\\n\\n “Because I gave you a chance to leave and you didn’t.”\\n\\n “So whipping a boot at my head is supposed to be an incentive?”\\n\\n “Yep.”\\n\\n “You’re a fucking riot, buttercup.” He flashed his teeth. “And guess what? It didn’t work.”\\n\\n “I have another boot,” she warned.\\n\\n “And lousy aim. You’re goddamn lucky—”\\n\\n “I missed on purpose, Jack-off. And you’re goddamn lucky you’re not wearing a dirt halo and a dent in your fat head.” She hopped up and sought refuge in the house. Maybe her over-the-top behavior would convince the stupid, smarmy jerk to take off so she could calm down.\\n\\n The porch door slammed again.\\n\\n Or maybe not.\\n\\n Keely took the shortcut from the back entryway to the kitchen. She scrubbed her hands in the sink and ignored Jack’s gaze burning a hole in her back. When she deigned to look at him, leaning indifferently in the doorjamb, she noticed he was tapping the metal serving utensil against his palm. Smack, smack, smack over and over.\\n\\n “Go away, Jack.”\\n\\n “No.” Smack, smack, smack.\\n\\n “I cannot deal with you right now.”\\n\\n “Tough. You brought this on yourself.” Smack, smack, smack.\\n\\n “I’ll remind you you’re an uninvited guest in my parents’ house. I may not be able to throw you out of the apartment you own, but I can toss you out of here.”\\n\\n “Try it.” Smack, smack, smack.\\n\\n “Will you stop smacking that goddamn thing? It’s giving me a headache.”\\n\\n “I’m just warming it up so the metal isn’t cold when I spank your bare ass with it.” Smack, smack, smack.\\n\\n Keely couldn’t help it; she laughed. “Right.” She’d gone about six steps when the word, “Stop,” had the effect he’d intended. She stopped.\\n\\n “Do not push your luck with me any more than you already have, Keely,” he warned. Smack, smack, smack.\\n\\n Of all the freakin’ nerve. Keely spun around. Her stomach fluttered. She’d never seen that look in his eye—the taskmaster with a lesson to teach. “You’re serious.”\\n\\n “Completely.” Smack, smack, smack.\\n\\n “You really think I’m going to let you…hit me?”\\n\\n “Not hit you. Spank you. Big difference. Losing your temper and throwing your boot at me proved you need to learn there are consequences for acting out against me.” Smack, smack, smack.\\n\\n “No. Way. You are fucking delusional.” The continual smack, smack, smack was wearing on her nerves. “I haven’t been spanked since I was about six years old.”\\n\\n In a clipped tone, Jack said, “Then it’s past time you had a reminder.”\\n\\n “Maybe you need a reminder not to goad me,” she retorted.\\n\\n Silence.\\n\\n A stalemate?\\n\\n “I don’t make idle threats. Drop your jeans and show me that ass.”\\n\\n “No.”\\n\\n “I’ll have my way, Keely. You give it or I’ll take it.”\\n\\n A small thrill surfaced. How far would he take this?\\n\\n Let’s find out.\\n\\n She walked away. As she bypassed the living room, she realized he’d followed her. If she picked up speed, so did he. Smack, smack, smack echoed until she was surrounded. The noise was in her head.\\n\\n Pounding in her blood. Throbbing in her groin.\\n\\n She took the stairs at a dead run.\\n\\n Jack gave chase.\\n\\n Keely shrieked. Her heart nearly beat out of her chest. Adrenaline soared and her pulse exploded. Her breathing sputtered after climbing the second set of stairs.\\n\\n Then she was zipping down the hallway. Her room had a hefty lock. If she could get there first…\\n\\n As she pushed the door open, a strong set of arms circled her waist. She shrieked again—which was quickly muffled when Jack lifted her off her feet and dropped her face-first on her bed.\\n\\n Chapter Eleven\\n\\n Jack absorbed the brunt of the fall when they hit the mattress. He quickly immobilized Keely’s hands above her head and used his body weight to hold her down. Still, the woman bucked like wild bronc.\\n\\n When she turned tail and ran, Jack acted like any predatory male in his position: He’d raced after her to gauge how far she’d take the battle of wills.\\n\\n The question was what to do with her now that he’d caught her.\\n\\n He’d ditched the cake server after she’d taken off. So he’d have to implement a different tool. His hand? It’d be hot as sin seeing his imprint on her remarkable ass, all pink and red and his.\\n\\n “Don’t you dare spank me, or I’ll…”\\n\\n That settled it. Keely was getting a spanking. Her lilac scent permeated the braid and he inhaled as much of the sweetness as his lungs would hold.\\n\\n “You’ll take whatever I decide to dish out. And if you weren’t so goddamn hotheaded, you’d realize that I was trying to apologize for my smartass comment. But you opted to push me, so I’m pushing back.”\\n\\n “Jack. Please.”\\n\\n “Please what?” he murmured in her ear.\\n\\n “Move.”\\n\\n “Move like this?” He slid his hips from side to side, grinding his erection into her ass. “Or like this?”\\n\\n He bumped his pelvis, thrusting as he rolled his hips.\\n\\n “You are such a pervert.”\\n\\n “Just another thing we have in common, cowgirl.” Jack lightly sank his teeth into the shell of her ear and soothed the sting with a soft sucking kiss.\\n\\n She hissed.\\n\\n His mouth returned to the curve of her jaw. “I will fuck you like this, Keely, if I choose to. Face down on the bed. Keeping my intentions unclear until the moment my cock shoves into you. Might be your cunt.\\n\\n Might be your ass. Might be I’ll stroke my dick in your butt crack and come all over your back.”\\n\\n Keely shivered and not from fear.\\n\\n “Hold still. Take what you’ve got coming to you.” Maintaining his grip on her wrists in his left hand, he rolled to his left side, stretching his right leg over the back of her thighs.\\n\\n She stopped struggling.\\n\\n Jack rubbed his palm over her butt cheeks. Damn. Keely’s ass filled out a pair of 501s to perfection.\\n\\n He kept stroking, building her anticipation. With his fingers around her wrists, he felt her pulse leap every time he changed direction or speed.\\n\\n His first swat wasn’t hard. Neither was the second. But the third and fourth—one on each butt cheek—stung his hand. Jack knew they’d stung her, even through the denim. He peppered each side with a series of fast smacks, finishing with three hard swats down low where her thigh curved into her ass. \\n\\n","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-22.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: All Jacked Up (Rough Riders #8) \\n Pulling off the ultimate con...if they can keep from pulling off their clothes \\n Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \\n Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \\n Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \\n When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \\n Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\\n","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
