{"id":70342,"no":28,"title":"Page 28","content":"\n Keely’s eyes nearly bugged out of her head. Holy shit. That amount would eat a huge chunk of her budget for the first year. But if she didn’t get it done…the clinic couldn’t open. As it looked right now this dream of hers was nothing more than a pipedream. Her eyes burned hot with unshed tears.\n Bawling wouldn’t solve a damn thing. She needed to think this through. Like she should’ve done from the beginning. It embarrassed her she’d gone off half-cocked, believing she had the construction portion of the project under control.\n “We’ll help in whatever way we can, Keely, you know that,” Remy said quietly.\n “I do know that.” She looked at her watch. “I also know I’m late for my babysitting gig with Colby and Channing’s hellions. I’ll see you guys tomorrow.”\n Jack didn’t chase Keely down because she needed time to process her mistake. Later tonight they could discuss solutions like rational adults. He pointed to Chet’s cooler. “Got anything stronger than water?”\n “Sure.” He pulled out a bottle of Coors Light. “Here.”\n “Thanks.” Jack cracked the top, tempted to drain it in one swallow.\n “So can me and Remy ask you something, Jack, without you getting all pissed off at us?”\n “Give it a shot, but no guarantees.”\n “How come you didn’t tell Keely she needed to budget separately for teardown? Especially since you were helping her figure out what it’d take to get this place up to snuff?”\n “An oversight. We’ve all made them,” he lied. “I’m kicking myself same as you guys are.”\n “She’s a fiery, independent woman. This oversight will drive her crazy. She’ll blame herself, lose confidence, close down…”\n “And then she’ll pull up her bootstraps and do what needs done,” Remy added. “She ain’t the type to stand around, wringing her hands and waiting for someone to rescue her. Which is damn amazing when you think about it. She could’ve turned out so much differently.”\n “Amen, bro.”\n That startled him. “What do you mean?”\n “We’ve—her brothers and cousins on both the McKay and West side—looked out for her. She wouldn’t have had to do nothin’ but stand around and look pretty and helpless. But that’s not what Keely is made of. That’s not who she is now, or who she was even when she was a girl. She don’t want nothin’ handed to her. She learned to do things for herself. If she didn’t know how to do something, she found folks to teach her. We admire the hell outta her for standing her ground when it’d be easier to give in.”\n “To her family?\n “Yeah. God love our McKay cousins, but they would’ve put the kibosh on her buying the building straight away. They would’ve accidentally made Keely feel stupid for trying to do something without their help.”\n Jack scowled.\n “Don’t get us wrong,” Chet said. “They ain’t cruel to her. And hell, I don’t even think they realize they’re doin’ it. But because they’re all older males, they don’t see Keely in an adult role. They treat her like a little girl. And they’d see purchasing this building as another one of Keely’s whims. We knew how much it meant to her, fulfilling this lifelong dream. We also know that if this clinic project falls through, her family will act like it’s no big deal, when it will crush her.”\n “Which is also why if she don’t have the money to hire someone to do the teardown, she absolutely will not ask anyone in her family for financial help,” Remy pointed out. “Hell, she’ll be here with a crowbar and do the whole thing herself.”\n They were lost in their separate thoughts until Jack felt Chet and Remy’s curious gazes on him.\n “What?”\n “Since you and Keely are gonna get married, if she finds a company that’ll do the teardown, would you be willing to pay for it?” Chet asked carefully.\n Another tricky question. “I’ll do whatever it takes to help her. But we all know she won’t take money from me. It’s not because I can’t afford it, but it’ll be a matter of pride to her.”\n “Yeah, she wasn’t none too happy to find out you owned the Sandstone Building, was she?” Remy mused.\n “No. I’m living with her and she’s still paying me rent. So as much as you guys didn’t want to see her brothers crushing her dreams, I won’t play a part in making her feel beholden to me. She hired me. She’s paying me. In her mind when it comes to the building stuff I just work for her. Period.”\n Remy and Chet exchanged a skeptical look.\n “You saw how Keely acted. Did she fly in here and lay a sloppy kiss on me? No. Did she cry on my shoulder when she discovered she’d made a big mistake that would cost her a pile? No. She bucked up, offered to rectify things with you two and she treated me like she would’ve any other employee.”\n Truthfully, her behavior stung like hell. But this situation wasn’t about him.\n “I get what you’re sayin’, Jack, I really do. I just wish there was some way to help her without any of us trying to sneak her money.”\n A solution started to form. “How many guys are on that crew out of Meeteetsee?”\n Remy scratched his chin. “Probably a dozen. Why?”\n “If they had a dozen guys on the clock, how long would it take to teardown this place?”\n “Three days. But that’d probably be milking it. Customers would freak if they thought the company could make fifty thou in a single day.”\n “But if we could get a dozen guys here, say tomorrow. For all day, would you two be willing to help me supervise what gets torn out and what stays?”\n Chet and Remy nodded at each other. “Absolutely. What did you have in mind?”\n Jack grinned. “I’ll tell you, but you’ve got to promise me that Keely won’t ever find out.”\n Jack called Carson McKay. He was actually relieved the ornery SOB answered with a gruff hello.\n “Carson. Jack Donohue. Got a minute to talk?”\n “Only about that long. I gotta get Caro pretty quick. What did you need?”\n “First off, Keely can’t know I called you about this.”\n Carson harrumphed, which Jack took as assent.\n Jack spun a tale about the company Keely hired for the teardown backing out. How it could jeopardize the entire clinic project because of time constraints. Keely was mightily upset, but she didn’t want to inconvenience anyone in her family by asking for help.\n “That girl. Don’t she know we’d do anything for her?” Carson said with exasperation.\n “Which is why I called you. If you show up at the building tomorrow with a bunch of guys ready to work, under the direction of me and Chet and Remy, Keely won’t lose a single dollar, or a day on the timeframe of getting the building up to speed.”\n Carson was quiet for a minute or so but Jack suffered through it. Finally he said, “I’ll take care of it.\n But I wanna know why you ain’t takin’ credit for it?”\n “I don’t have to tell you Keely McKay is stubborn and filled with pride. If I arranged to fix it she’d see it as me meddling in her business. And trust me, when it comes to that building, my relationship with her is all business.”\n He snorted.\n “If you show up with her brothers and assorted cousins wanting to help her out of a jam…she’ll see it differently. Plus, all of you will have been involved in some part of the process, of this project that means everything to her.” Jack paused. “She helps out her brothers all the time. In fact, she’s watching Colby’s kids right now. It’d be good for your family to pay back that kindness when Keely needs it the most and expects it the least. And trust me, she needs it.”\n Another bout of silence.\n “You got all the bases covered, son, and I can’t fault you for lookin’ out for her, in fact, I appreciate it. But how’s that snoopy girl gonna believe I just happened to hear about her building troubles?”\n “Easy. Chet and Remy. Just tell her you stopped by last night to see the progress after talking to her on Sunday. Chet and Remy mentioned issues with the teardown process. You went home, made a few calls and set up an old-fashioned barn raising in reverse.”\n “You sure you ain’t a politician, Jack?”\n “Hell, no, Carson, you sure know how to throw an insult like a damn dagger.”\n Carson chuckled. “See you tomorrow. But if this scheme backfires? I’m rolling on you first, guaranteed.”\n Jack said, “I’d expect nothing less,” to the dial tone.\n Although Jack was restless, he dragged his laptop into the bedroom and caught up on paperwork. He figured trying to sleep was pointless, so it shocked him to wake up at one in the morning completely disoriented. He stacked his papers, powered down his laptop and wandered into the living room.\n There she was, fully dressed, asleep on the couch.\n A protective feeling expanded in his chest. He wanted to take care of her. And not just tonight. Jack lifted her into his arms.\n She blinked her eyes sleepily. “Jack? What are you doin’?”\n “Tucking you in bed. You fell asleep on the couch, buttercup.”\n “I got home and thought about watching TV but I couldn’t figure out how to turn it on. I’m hopeless with everything today.”\n “Don’t say that. I’ll show you tomorrow.” Jack kicked the bedroom door shut.\n “I swear I just closed my eyes for a minute. Those kids of Colby’s wear me out.”\n He set Keely on her feet by the bed. He undressed her down to panties and a tank top. She crept under the covers.\n Once Jack was in bed, she wrapped herself around him. “You know, GQ, I’m kinda starting to like you a little bit.”\n He kissed the top of her head. “Same goes, cowgirl.”\n The next morning Keely started her day with less enthusiasm than usual. Jack had made coffee but he was already gone. He’d left a note by her favorite mug, reminding her she’d promised to pay Chet and Remy for the teardown work today. \n","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-28.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: \n All Jacked Up (Rough Riders #8) \n Pulling off the ultimate con...if they can keep from pulling off their clothes \n Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \n Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \n Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \n When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \n Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\n \n","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
