{"id":70352,"no":33,"title":"Page 33","content":"\n “Hell,” Ramona said with no sarcasm. “I fired my travel coordinator the second I had cell service in the States. Trust me, you do not want to hear me whine about the Orient.” She paused. “You okay? For being wildly in luurrve and all, you don’t sound like your chipper self.”\n “I’m nervous about meeting Jack’s clients. I do not want to say or do anything to fuck it up.”\n “You’ll be fine. You’re charming, funny and you can drink any man under the table. At least you used to, but damn, you’ve been dull as dirt the last few years, cuz.”\n “Ramona!”\n “Kidding. Sheesh. Should I build up your confidence with serious stuff since your sense of humor has vanished?”\n “Yes, please.”\n “Let’s start with the obvious. What are you wearing tonight?”\n Keely rolled her eyes. Ramona lived the code “clothes make the woman” and truly believed all that fashionista crap. “I’m wearing my emerald moleskin skirt, brown boots with the orange and green butterflies, a slim-fitting, button-up shirt in dark tan and a brown bolero jacket.”\n “Good. How many events do you have to dress for?”\n “One more tomorrow night and that’s formal.”\n “What else did you pack?”\n Keely described her engagement dress.\n “It sounds perfect, but showcase your personality by adding a splash of color. Look for a funky scarf in those shops you’re hitting tomorrow.”\n Funky. Right. Milford, Utah didn’t like funky.\n “Oh, and I’m sending you a box of samples I picked up. One pair of jeans will make you look totally hot. You’ll be a trendsetter in Sundance.”\n “Another dream realized,” she said dryly. She tacked on, “Thanks, Ramona,” lest her cousin stop sending her free, cast-off western clothes.\n “I’ve gotta run, hon, I just wanted to send my love and give you congrats on hooking a hottie. Does he have a big dick too?”\n “Yep. And he knows how to use it.”\n “Bitch. Call me next week when you get the clothes.”\n “I will. Thanks.”\n “Knock ’em dead, Keely. I have total faith in you.”\n After she hung up she stared at the ceiling. “At least someone does.”\n Keely swore she’d make the best of the next two days, her last two days with Jack as his fake fiancée.\n She’d smile and act happy, even when it hurt that this make-believe situation was nearly over.\n Too bad her feelings for him were real.\n Jack nearly swallowed his tongue when Keely stepped from the elevator. And he was damn glad he had a suit jacket on to cover his immediate erection.\n Holy fuck. She was a goddess.\n He was used to seeing her dressed casually, wearing jeans, minimal makeup and her ever-present cowgirl boots. The outfit she’d chosen wasn’t overly dressy. Her choice of earth tones fit her personality.\n Yet the cut and color of the clothing let her natural beauty shine through, so you didn’t notice the clothes, but the woman.\n His woman.\n Keely approached him with a cautious smile. “Hey.”\n He reached for her hand and kissed her palm before threading their fingers together. “You are absolutely exquisite.”\n She blushed. Shifted from boot to boot, apparently stunned into speechlessness.\n “Come on. It’s a short walk and I cannot wait to show you off.”\n Her blue eyes sparked fire. “I am not a show heifer, Donohue.”\n Jack was relieved her fit of nerves had passed. “There’s my feisty fiancée.”\n They were quiet as they strolled to the restaurant. The hostess showed them to a small banquet room filled with people. Keely’s hand tightened around his.\n “Relax, buttercup.” Jack put his mouth to her ear. “If you’re nervous, just imagine them in their underwear.”\n “You’re the only person I want to imagine that way. You really want me staring at your crotch all night?”\n “Whatever works.”\n “Jack! My boy, how are you?”\n Jack grinned at Henry Smith, a balding, barrel-shaped man with two chins and a politician’s smile. He thrust out his hand to shake Henry’s hand vigorously. “Henry. Great to see you again.”\n “We are pleased to have you back.”\n “I appreciate the second chance.” He curled his arm around Keely’s shoulder and brought her forward. “This is my fiancée, Keely McKay. Keely, this is Henry Smith, the brains and power behind the Milford Historical Preservation Committee.”\n “Brains and power, bah.” Henry delicately shook Keely’s hand. “A real pleasure to meet you, Keely.\n Although, I’ll admit to being surprised when Jack told me about your engagement. He’d never indicated in his dealings with the committee that he was involved in a serious relationship.”\n “Oh, Jack keeps his personal and professional life separate, so I’m not surprised,” Keely said with a smile. “To be fair, I’d not heard of you either.”\n He chuckled. “Well, I can certainly see why he’d want to keep such a beautiful woman all to himself.\n Have you set a wedding date yet?”\n “No. But my parents did throw us an engagement party last weekend.”\n “How marvelous. My wife, April, whom you’ll meet shortly, will be so disappointed she didn’t get to send a gift.”\n “Not to worry. I do have pictures of the party I’d love to show her.”\n Jack patted her shoulder. “Keely. Sweetheart. I’m sure Henry and April aren’t interested in—”\n “Nonsense. We’d be delighted to see them,” Henry said. “And we would love an invite to the wedding.”\n “We’re still working out schedules and details. I have a large family, and naturally I want all of them to be in attendance. It’s tricky trying to figure it all out.”\n “I imagine.” Henry smiled at Jack. “Shall we catch up with the other committee members while we’re waiting for dinner to be served?”\n “Absolutely.” Jack kept Keely close by because he could tell she was still nervous. These people made him uneasy too. As if they were waiting for him to fuck up and say or do something to take him out of the running for the job.\n Why does this job matter to you so much? You’d rather pretend to be someone you’re not? Just so you can flip Baxter the bird?\n No. That wasn’t it… Was it?\n “Jack?”\n He refocused on Keely, not his burst of self-doubt. “Yes, sweetheart?”\n “It’s time to eat.”\n “Good. I’m starving.”\n The committee separated them. The men sat at one end of the table and the women at the other. Jack forced himself to concentrate on business and not how Keely was faring.\n He snuck looks at her every so often. She was smiling, engaged in conversation, but she’d barely eaten two bites of her meal. Dessert was a gingerbread cake, dry as dust. Keely picked off the maple frosting and drank lots of water.\n On a professional level, the meal was a success. Jack pointed out permit issues other companies under consideration might’ve missed. During their partnership, Baxter had left those details to Jack. And Jack had heard through the grapevine Baxter had been fined on other projects because of oversights. When he learned that BDM hadn’t made a formal pitch to the Milford Committee yet, Jack kicked himself for opening his big mouth, because he’d just given Baxter another advantage.\n Once the table was cleared, several people left and others changed seats. Jack motioned to Keely to take the empty chair beside him.\n They’d barely situated themselves when Henry addressed them. “So, Jack, since you kept us in the dark about your lovely Keely, we’re anxious to hear how you two ended up engaged.”\n Murmurs of assent sounded from around the table.\n Jack said, “It’s sort of complicated—”\n Keely patted Jack’s hand on the table. “Jack, darlin’, no offense, but you’re a man and you don’t do this story justice. Why don’t you let me tell it?”\n Soft laughter.\n He bared his teeth at her in warning. “Go ahead, sweetheart. But I’ll jump in if you get something wrong.”\n “I’m never wrong.”\n “See what I’m up against?” he said innocently to the men.\n They all nodded.\n “If you would’ve told me a year ago I’d be engaged to Jack Donohue, I would’ve said you were plumb crazy,” Keely said. “See, Jack and I hated each other.”\n A few gasps sounded.\n Jack withheld a groan. Dammit. She’d better not fuck this up.\n “Maybe hate is too strong a word. We disliked each other intensely. I’ve known Jack since I was sixteen. He and my brother Carter became best friends in college and Carter dragged Jack home to the ranch one weekend. We detested each other on sight. He was rude and mean.”\n “And she was a total spoiled brat,” Jack inserted.\n Laughter.\n “Needless to say, our paths have crossed many times over the years. We never moved past the ‘I can’t stand to look at you’ stage. In fact, it was worse the more time we spent around each other.”\n “It was much worse when you started dating my little brother.”\n “And his brother Justin…dumped me.”\n Muted female murmurs of understanding.\n “Did you swoop in and mend the pieces of her broken heart?” April Smith asked dreamily.\n Keely leaned forward. “No, he did not. We ended up swapping insults at my brother Colt’s wedding reception.”\n She took a drink of water; the tiny pause let the drama build.\n “Fast forward to six months ago. I bought an old building in Moorcroft that needed serious renovation. It was also listed in the Wyoming Historic Register, and I don’t have to explain to you all what a nightmare that is.” \n","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-33.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: \n All Jacked Up (Rough Riders #8) \n Pulling off the ultimate con...if they can keep from pulling off their clothes \n Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \n Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \n Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \n When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \n Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\n \n","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
