{"id":70356,"no":35,"title":"Page 35","content":"\\n\\n Her entire posture stayed tight. Closed off. Skeptical. “Why?”\\n\\n “A week from today there’s a job I have to be on site for until it’s finished. I’ll be gone for three full weeks. But this week and especially next weekend, I need you to keep up this pretense.” Inwardly, Jack winced at his word choice. What had developed between them hardly felt like make-believe.\\n\\n “What’s going on next weekend?”\\n\\n “Convention in Denver.”\\n\\n Keely scowled. “First I’ve heard of it. A lot has happened. You can’t expect me to remember all of it.”\\n\\n I’ll remember all of it. The way you taste first thing in the morning. The sweet scent of lilacs surrounding me last thing before I drift off at night. Your eyes glaring at me with anger. Your eyes devouring me with hunger. Your laugh. Your determination. The unquestioning love you have for your family. The way you make love with your heart and soul as well as your body. I’ll never forget any of that.\\n\\n “Jack?”\\n\\n “I swore I told you. This is our annual Professional Preservationist’s Society meeting; it just happens to be in Denver this year. I’ve already booked us a suite at the Adam’s Mark downtown.”\\n\\n “When would I have to be there?”\\n\\n “By six o’clock Friday night for a cocktail party and a dinner.”\\n\\n “Will we have separate hotel rooms?”\\n\\n Jack got right in her face. “No. Way. You will be in my king-sized bed all weekend.”\\n\\n Something shifted. Keely reached out and fiddled with his collar. “Did you miss the sex the last two days?\\n\\n “No, I missed sleeping with you.” Jack slid his hand up to cradle her beautiful, but strangely sad face.\\n\\n “Did you miss it?”\\n\\n “Yeah.”\\n\\n It wasn’t like Keely not to elaborate. So he took it upon himself to fill the void. “I was so horny I had to whack off. Twice.”\\n\\n She blinked with surprise. “You did?”\\n\\n “First thing in the morning I relived our first shower. How amazing it felt shoving my cock in your mouth. How hot it was seeing my come on your face.”\\n\\n “What about the second time?”\\n\\n “The second time I thought about all the positions we haven’t tried yet. Sixty-nine. Reverse cowgirl.\\n\\n Or in your truck, which is a personal fantasy of mine, believe it or not.”\\n\\n “A truck fantasy, GQ? How rural.”\\n\\n “And it’s a crude and lewd fantasy too.” He crowded her. “My dick buried in your hot little ass was the visual that sent me over the edge. Imagining you on your hands and knees with those sexy butt cheeks spread wide. Watching my dick disappear into that tightly puckered pink hole. You’re not a virgin to anal sex, but I’ll bet my cock is bigger than anything you’ve had. The thought of how hot and tight you’d be as I rammed into your back door. Jesus, Keely, I shot all over my hand. And I used the come to get myself off again, imagining you still bent over as I whacked off all over your ass. Seeing my come sliding down the crack of your butt and running into your asshole.”\\n\\n Lust glittered in her eyes. “Graphic much?”\\n\\n “You love it.”\\n\\n “I do, but that’s three times you jacked off, not two.”\\n\\n “I wanted to see if I could get you so hot and bothered just from the verbal description of what I want to do to you that you forgot to count.” He feathered his lips over hers, testing her response.\\n\\n And there it was. Keely’s hungry, unabashed need. Giving him everything, holding nothing back, she was his equal in every way. He wanted her in every way.\\n\\n “I want you, Keely. Right now. Up against the car.” Jack dragged his mouth down her neck, leaving sucking kisses.\\n\\n Keely stepped back. Way back. “Huh-uh. I will let you fuck me in the men’s bathroom at the Golden Boot, but I draw the line at screwing outside the cemetery in Beulah.”\\n\\n “Fine. But hold that thought until we get home.”\\n\\n “If you’re lucky.”\\n\\n Jack kissed her again. “I’m feeling very lucky.”\\n\\n Could Keely spend another week with him? Without Jack figuring out she’d fallen in love with him?\\n\\n Yeah. Don’t act like a complete freak like you’ve been doing all day. The no talking, no looking, no touching reaction is a dead giveaway. Fuck him, insult him and he’ll never guess anything has changed.\\n\\n Even when everything had changed.\\n\\n She filled the rest of the drive with stories of how she’d spent Saturday, a captive audience with April, Phyllis and Georgette. Shopping, lunch and a three-hour tour of the town. Fielding pointed questions about her religious affiliation. Fielding pointed questions about being a “working woman”. Fielding pointed questions about what it was like to be with a devastatingly handsome, completely charming, totally put together man such as Jack Donohue.\\n\\n Jack preened when Keely relayed the women’s flattery.\\n\\n “Of course, I couldn’t tell them you’re the ultimate package because in addition to your stunning good looks and mouth-watering physique, you have a big cock.”\\n\\n “There’s my sarcastic cowgirl.”\\n\\n “Miss me?” she cooed.\\n\\n “Like an oozing canker sore.”\\n\\n She laughed. “We’ve come a long way in three weeks, haven’t we?”\\n\\n “Yes, and amazingly, with no knife wounds.”\\n\\n They pulled into Sundance as the sun turned the hills bronze, reflecting gold across the valley, showcasing the beautiful landscape she’d never tire of looking at. Keely breathed deeply.\\n\\n “Why the contented sigh?”\\n\\n “Because I’m home. Every time I come back from a trip I realize how much I love this place and how I never want to leave it.”\\n\\n “Never?”\\n\\n “Never. Everything I’ve ever wanted is right here. Why would I leave what makes me happy?”\\n\\n He didn’t comment, but she hadn’t expected him to.\\n\\n At the apartment, Jack dragged the suitcases upstairs. Then he dragged her straight into the bedroom.\\n\\n “Keely.” He framed her face in his hands and blew her mind with an infinitely gentle kiss.\\n\\n She didn’t let him speed race them to the next level of seduction. She kept kissing him. Wetly.\\n\\n Deeply. Softly. Firmly. No rush; she wanted to savor him.\\n\\n “Naked,” she murmured between flirty kisses. “Completely buck-assed nekkid. We’re usually in such a hurry we still have half our damn clothes on.”\\n\\n Jack leisurely undressed her. She unclothed him with equal deliberation. He stripped away the quilt and eased her onto the mattress. Kissing a path down her body, he inadvertently tickled her bared flesh with his hair. Keely adored his too-long mop of glossy black. It fit him.\\n\\n His mouth proceeded straight to her pussy. He groaned and lapped at the wetness. “I could taste you for hours.”\\n\\n “I’ll take you up on that another time. Right now, I need you.”\\n\\n He situated his hands by her shoulders and kneed apart her thighs. “You ready?”\\n\\n “You asking? Instead of taking? You hit your head or something?”\\n\\n “Smartass.” Jack’s thickness filled her in a slow, sweet glide that satisfied more than the sexual ache in her body. “Put your legs around my hips,” he urged.\\n\\n Keely rocked up to meet his relaxed thrusts.\\n\\n But Jack reset the pace to slow-mo, while intently peering at her face. “You’re beautiful. I don’t say that enough.”\\n\\n Don’t say it again or I might believe it means something.\\n\\n “Let me take care of you.”\\n\\n Forever? Or just for tonight?\\n\\n “Look in my eyes when you come, Keely.”\\n\\n He flexed his hips at the end of every stroke, propelling his cock deeper, but keeping the withdrawal of his shaft agonizingly unhurried.\\n\\n “Jack—”\\n\\n “My. Eyes. Don’t look away. Show me what I do to you.”\\n\\n She concentrated on the telltale tug in her womb. It took all her self-control not to grab Jack’s ass and greedily chase down the orgasm, grinding her way to bliss via his body. Letting him bring the pleasure to her.\\n\\n When Keely’s pussy muscles contracted and her clit started to throb, she locked her gaze on Jack’s slumberous eyes and came in silence. No keening wails or soft gasps. No arching or straining. The orgasm was no less intense for the quietness.\\n\\n Heat expanded inside her as Jack came in the same intense stillness. Watching her with focus equal to what she’d given him.\\n\\n It was as strange as it was wonderful.\\n\\n Jack buried his face in her neck. “Fall asleep with me like this, Keely. Just for a little while.”\\n\\n Another unusual request. But she wouldn’t deny him. Keely was beginning to believe she wouldn’t deny him anything.\\n\\n The next night Keely stripped off her clothes the second she’d closed the apartment door.\\n\\n “Now that’s what I love to see. Eagerness to get naked with me, buttercup.”\\n\\n She scowled at Jack in his usual place on the couch. “No time for slap and tickle. I’m late.”\\n\\n Thud. Boot one hit the ground. Thud. Boot number two hit. She raced into the laundry room and dumped the stinky bundle, then zipped to the bathroom.\\n\\n “Late for what?” Jack yelled.\\n\\n “Colt’s basketball game starts in fifteen minutes.” Keely flipped the handles and the shower kicked on. She twisted her hair in a clip on top of her head and climbed in.\\n\\n “Why didn’t you go straight to the game from work?”\\n\\n She shrieked. Jack stood at the end of the tub. Gawking at her. Not at her face, either. “Do you mind?”\\n\\n “Not at all.” His eyes ate her up. The man actually licked his chops.\\n\\n “I repeat. No time for water games.” She faced the water and rinsed.\\n\\n After she finished, Jack handed her a towel.\\n\\n “Thanks. My last patient showed up for her therapy session with a case of the flu and she barfed all over me.” Keely shuddered and toweled off. “I’m surprised you didn’t smell it when I walked in.” \\n\\n","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-35.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: All Jacked Up (Rough Riders #8) \\n Pulling off the ultimate con...if they can keep from pulling off their clothes \\n Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \\n Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \\n Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \\n When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \\n Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\\n","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
