{"id":70381,"no":47,"title":"Page 47","content":"“By whom,” Jack repeated. “If my professional reputation is being examined, I have a right to know who is attempting to malign it. It is your moral obligation to tell me, is it not?”\\n\\n Henry sighed. “Baxter Ducheyne’s company pitched to us. In the two days Baxter and his lovely wife Martine spent in Milford, she revealed a few disturbing things, including your past relationship with her.\\n\\n Martine questioned whether you’d follow through with your wedding to Miss McKay, given your inability to commit to her during the year you were together in Chicago. She also mentioned you immediately dissolved the partnership with Baxter and moved across the county before she married your partner.”\\n\\n Jack seethed. Too angry to speak.\\n\\n “Baxter brought up the ethics of your company signing off with the Wyoming Historical Society on Miss McKay’s building, especially since the two of you are intimately involved.”\\n\\n Unreal. This was a fucking nightmare.\\n\\n “Imagine our surprise when Mrs. Ducheyne asked if we’d agreed to consider western artwork projects from Miss McKay’s brother. I believe you mentioned him to us as a possible sculptor for our city square project, did you not?”\\n\\n “Yes. But Carter McKay—”\\n\\n “Will possibly be your brother-in-law, so you can see the committee’s point of view about another case of nepotism, Jack. With all of these…incidences staring us in the face, I’m sure you understand why we had concerns.”\\n\\n “I’m sure you can understand why I would feel Mrs. Ducheyne’s information to you would be biased, based on my past history with her. How she came across information about—”\\n\\n “I suggest you speak with your fiancée, Mr. Donohue,” Henry said coolly. “Mrs. Ducheyne stated Miss McKay freely relayed this information to her, during a business conference in Denver a few weeks ago.”\\n\\n Jack froze.\\n\\n “In addition, your fiancée boldly claimed you had this restoration project wrapped up. Baxter was mightily upset, understandably so, as he hadn’t the opportunity to pitch us his ideas yet.”\\n\\n He couldn’t think of damn thing to say.\\n\\n “Rest assured, this information about your company will stay confidential among the committee members. Good-bye Jack and good luck.”\\n\\n Henry hung up.\\n\\n That big-mouthed cowgirl had fucked him over.\\n\\n What goes around comes around.\\n\\n Infuriated, he headed for Moorcroft.\\n\\n Keely couldn’t believe how fast the building was shaping up. In another month, the clinic could open for business.\\n\\n The door slammed and Jack barreled in.\\n\\n Speaking of dream fulfillment…Keely intended to tell Jack she loved him, hoping the last piece of the puzzle of her life would fit into place.\\n\\n But Jack wasn’t wearing the soft look of a man in love. Jack was absolutely infuriated. And he got right in her face.\\n\\n “Did you tell Martine we were living together?”\\n\\n Weird way to start a conversation. “Yes, but—”\\n\\n “Did you also tell her I had the Milford restoration project ‘wrapped up’?”\\n\\n “I don’t think I said ‘wrapped up’ but I told her the committee liked your concept—”\\n\\n “Jesus fucking Christ, Keely, do you have any idea what the fuck you’ve done to me? You’ve torpedoed my goddamn career!”\\n\\n Before Keely defended herself, Jack went off on a tangent.\\n\\n “I trusted you. And how did you repay that trust? By fucking me over. Big time. Because Martine somehow hurt your poor little feelings, you just had to open your big mouth and one-up her, didn’t you? By telling her we were living together. By telling her I had the Milford project in the bag. By taunting her that I offered to marry you, when I hadn’t offered to marry her.”\\n\\n “But I didn’t—”\\n\\n “Well, guess what, cowgirl? That offer of marriage is off the fucking table for good.”\\n\\n Keely’s stomach roiled.\\n\\n “Now, not only did I lose the goddamn Milford project, my ethics are in question.” Jack jabbed a finger at his chest. “My ethics. Do you know how fucking hard I’ve worked to keep my reputation impeccable? Now I’m being accused of nepotism.”\\n\\n “Nepotism?”\\n\\n “Don’t play stupid. Baxter and Martine are questioning whether I should even be allowed to sign off on this project for you since we’re intimately involved. What do you think the odds are the next call they make is to the Wyoming Department of Historic Preservation? I could get my fucking certification pulled!\\n\\n And if I’m pulled in one state, what do you think the odds of me getting pulled in every other state are?\\n\\n Pretty much fucking guaranteed.\\n\\n “Not only that, you told Martine about Carter? How the fuck do you think that makes me look? Not to mention your brother? Yes, I suggested the Milford committee consider hiring Carter to do a couple of bronzes. Now, I’m being accused of nepotism again, and Carter is going to lose out on a potentially huge fucking commission. Because of you. How do you think he’ll react when he finds out you fucked this up for him? You think he’ll be so goddamn eager to leap to his baby sister’s defense every fucking time I turn around?”\\n\\n Don’t cry. Don’t cry. Jesus, Keely, stay Wyoming tough.\\n\\n “Don’t have anything to say for yourself?”\\n\\n She swallowed hard. Her voice came out softer than usual. “What do you want me to say, Jack?\\n\\n You’ve got it all figured out. Got all the blame placed. Good for you. Must be nice to be so fucking perfect.\\n\\n So goddamn…smug and self-righteous. But the main thing you’re forgetting? Maybe the Milford committee had every right to call your ethics into question.”\\n\\n He bit off, “What. The. Hell. Are. You. Babbling. About.”\\n\\n “You set up a fake engagement with me—a woman you professed to hate—just to get a crack at their project. And blame me all you want for your ex-girlfriend having such a big mouth and blabbing your sordid past personal history so your ex-partner could fuck you over in front of a supposed professional organization, but it’s bullshit and you know it. The bottom line is this: you’d already lost any chance at the contract before you decided to shitcan your ethics and pull one over on the committee. You were so fucking desperate to spit in their eye when they didn’t consider you good enough or moral enough to even be considered for their precious fucking project. Did I go along with this charade because I wanted something from you? Yes. Do I feel guilty? No. Because of me and this stupid fake fucking engagement you concocted, you actually had a shot at getting that all-important, career-boosting, fucking over Baxter and Martine project. Whereas, before, you didn’t. And maybe it’s irony or poetic justice or whatever you wanna call it that you’re exactly in the same fucking position now as you were two months ago: no chance in hell of getting what you want.”\\n\\n Jack laughed harshly. “Listen up and listen good. I won’t be the only one who doesn’t get what I want in this fucked up situation, because there’s no way in hell I’m ever signing off on this building project, Keely. No. Fucking. Way.”\\n\\n “I expected nothing less of you, Jack-off.” In angry, jerking movements, Keely tugged off the engagement ring and whipped at his feet as hard as she could. “You’ve got ten minutes to get the fuck off my property or I will call the cops.”\\n\\n Keely spun on her bootheel and left without looking back.\\n\\n Jack picked up the ring and stared at it. He felt none of the vindication he’d expected. In fact, he felt sick to his stomach. Like he’d lost more than a job. He’d lost his dignity. His purpose. His morals. His way.\\n\\n You lost your way a long time ago, buddy. And now you’ve lost the best thing that ever happened to you. Happy?\\n\\n No. Fuck no. What was wrong with him?\\n\\n Jesus. When had his life become such a fucked-up mess? Just when it’d seemed like everything he’d ever wanted was within reach? What kind of fucking moron slapped it away with both hands and harsh words?\\n\\n He curled his fingers around the ring, half wishing she’d broken the damn thing and shards of metal would dig into his skin. Maybe then he’d feel something besides the utter desolation weighting him down like an anvil.\\n\\n You did this to yourself. Everything word she said was true and like usual, you didn’t want to hear it.\\n\\n Go to her. Go after her. Make it right. For both of you. Plead your case. Plead insanity. Just don’t let this get any more out of hand.\\n\\n The enormity of Jack’s mistake sucked the breath from his lungs. And he’d accused her of having a big mouth? Jesus. Profound shame paralyzed him to the point his damn feet wouldn’t move. He knew he needed to chase Keely down right fucking now. Apologize, grovel, cry, beg, crawl. He’d have his mouth surgically sewn shut to stop from ever spewing such vile bullshit again. He’d devote his life to worshipping her as she deserved. He’d show her a hundred times a day he loved her. If only she’d give him one more chance.\\n\\n “You heard the lady. Get the fuck out.”\\n\\n Jack’s head snapped up.\\n\\n Chet and Remy West were standing side-by-side, fists clenched, postures screaming, We’re gonna kick your ass, dumb fucker.\\n\\n “How much did you hear?”\\n\\n “Enough.”\\n\\n Silence.\\n\\n “Fucking great.”\\n\\n “By my estimation you’ve got six minutes left. And trust me, you don’t wanna be here when Cam McKay gets wind of this,” Chet warned.\\n\\n “Or Cord,” Remy said.\\n\\n “Don’t forget Colby is one mean bastard,” Chet added with a sneer.\\n\\n Remy shrugged. “My money is on Colt.”\\n\\n “Carter’s no slouch either. It’s them quiet ones ya gotta worry about, huh bro?”\\n\\n Jack got the warning loud and clear: quiet ones like Chet and Remy, not to mention Keely’s father, would be gunning for him. Soon. “Look. If Keely comes back—”\\n\\n “We’ll hand your sorry ass to her on a silver fuckin’ platter if you’re stupid enough to stick around,” \\n\\n","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-47.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: All Jacked Up (Rough Riders #8) \\n Pulling off the ultimate con...if they can keep from pulling off their clothes \\n Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \\n Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \\n Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \\n When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \\n Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\\n","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
