{"id":70383,"no":48,"title":"Page 48","content":"Remy snarled. “Five minutes,” Chet snapped. “I appreciate that you care about her, but don’t kid yourselves for a second that I don’t care about her too.” They snorted in stereo. Which just pissed him off. “And honestly, this is between Keely and me, no one else, so I’m gonna say this once, and feel free to pass this on to all the McKays: back the fuck off.” “Four minutes,” Remy announced. Chet leaned forward. “I’ll be honest. Part of me wants you to stick around.” Fuck this. His body heeded the message to scram. He stormed out the door, half-shocked he hadn’t felt a crowbar whacking him in the back of the head. But that wasn’t the West boys’ style. Nor the McKays’. No, that psycho bunch of cowboys would come for him with a full frontal attack, no backstabbing bullshit like Baxter. Jack welcomed it. In fact, he had half a mind to make some calls and get the whole fucking thing underway. He had nothing else to lose. Chapter Twenty-One Keely didn’t hang around to ensure Jack vacated the premises. Her tires spit gravel as she zoomed off in her truck. The cold, cutting wind from the open window cooled her face, but she couldn’t blame the icy air for the numbness inside her. Tempting, as she whizzed past the Golden Boot, to belly up to the bar and drown her sorrows. Too public. She’d deal with this humiliation in private. She drove without direction, lost in her misery. She couldn’t return to her apartment, which was really Jack’s apartment. Neither would she burden her family. Part of her feared her brothers wouldn’t let this situation with Jack slide, but an equal part feared her brothers were all male bluster. Leaning on her parents wasn’t happening either. Her mother would talk her ear off and her father wouldn’t talk at all, so it was best to split the difference and avoid going home to the ranch. Truthfully, it’d be best if she disappeared for a day or so to decide the best way to deal with the Jack issue. Issue? What issue? You weren’t in the wrong. Not about the Milford situation. Jack had lashed out at her because he’d made a mistake and got caught. It sucked Baxter and Martine were so damn vindictive, but Keely figured they’d move on now, after giving Jack the smackdown. Besides, if Baxter called Jack’s ethics into question, his might be questioned. From what Keely ascertained from other architects at the conference, Baxter’s methods were already under scrutiny. So despite the stinging accusation, Keely hadn’t ruined Jack’s professional reputation. But had she ruined any chance of them being together permanently? His claim the marriage offer was “off the table” confused her, now that she thought about it. Had he intended to make the offer for real? Jack had been purposely vague last night when he told her they needed to have a serious talk this morning. Her grandmother’s warning, Never put off until tomorrow what you can do today, rang in her ears. Good advice, but Keely feared it was too late. She loaded up on camping supplies at the grocery store, successfully avoiding anyone she knew. Like any Wyomingite worth her salt, Keely already carried what passed for Wyoming emergency gear—a tarp, a knife, ammo, matches, jerky, a Chris LeDoux CD and a shovel, as well as an old sleeping bag—in her truck. As she followed the twisty roads leading to the campground at the base of Devil’s Tower, Keely realized it’d been months since she’d spent the night under the stars. She had no qualms about camping alone in a remote area. She had food. Water. A pistol. Most importantly, a don’t-fuck-with-me attitude. The campsite she’d chosen was far enough away she could see the entire monument rising up out of the trees like an ancient skyscraper. No wonder the laccolith had been—and still was—worshipped by the Native Americans as a holy place. The quiet power of the rock formation always gave her chills. Keely set up camp. She had nothing but time on her hands and a whole lot to think about. But bone deep she knew what she wanted. She just needed to gather up the courage to go after it. The next morning Jack was past crazy, on his way to certifiable. When he’d first pulled up to the apartment after he’d left Moorcroft, he half-expected to see his personal shit strewn in the alley from where Keely had heaved it out the window in a fit of rage. As hours passed and she didn’t come home and she didn’t answer her phone, Jack paced to the point he pissed himself off. But he couldn’t sit around with his thumb up his ass when he had no fucking clue where Keely had run off to. Call her family; they’ll know where to find her. True, but the fact her brothers hadn’t shown up guns blazing meant her family wasn’t aware she’d taken off. Maybe he had a chance to correct the biggest mistake of his life, without any of the crazy-assed male McKays knowing Jack Donohue had done Keely wrong. So, with nothing else to do but wait, Jack worked out. He did crunches until his stomach hurt. Then he did pushups until his arms wouldn’t hold him up. He ran in place until his legs gave out. Covered in sweat, body aching, he fell on the floor and waited until the worst of the muscle cramps passed. Then he started all over again, adding chin ups to the mix. The third go around he added squats to his routine. He planned to add jumping jacks to the fourth set, but he laughed until he cried, knowing Keely would’ve gotten a big kick out of the play on words. Jack. Doing jumping jacks. At that point in his delirium last night, he’d considered drinking until he passed out. But he feared Keely would come home and think he was a drunk as well as an asshole, so he’d scratched that idea. When his stomach rumbled, he realized he hadn’t eaten for over twenty-four hours. He shuffled to the kitchen and opened the refrigerator. What he saw on the top shelf almost made him weep. A meatloaf. Mixed up in a glass baking dish, wrapped in tinfoil, ready to be popped in the oven. She’d gone out of her way to prepare his favorite food. He didn’t know why he was so surprised. She was sweet. Funny. Thoughtful. Absolutely perfect for him. Keely McKay was everything he’d never wanted and everything he needed. The enormity of his mistake increased exponentially with every minute of her absence. He’d do anything to spend his life with her. Move to Wyoming. Become a cowboy. Work on the family ranch. Hell, he’d even listen to that shitty country music she loved. Take her line dancing. Join her dart league. Impregnate her with all the kids she could handle. If she’d just come home. Jack was so goddamn tired, physically from punishing his body to the point he could barely move. And the emotional beating he’d given himself was way worse. Man up. He dialed the only person who could help him. He barely heard the phone ringing over the thumping of his heart. When the line was picked up, Jack blurted, “I did a dumb, stupid, asinine thing, which is all my fault and I need your help.” Talk about making him sweat. He’d made the phone call three hours ago. When he heard footsteps on the stairs, he forced himself to stay focused on the paper in front of him. No knocking. The apartment door crashed open. “It’s about fucking time,” he snapped, without turning around. “I know you’re pissed at me, but Jesus, I’m worried about her—” “You don’t have a fucking clue how pissed we are.” We. Jack turned around. Holy fucking shit. Cord, Colby, Colt, Cam and Carter McKay were spread out like a bunch of goddamn gunslingers. “What the hell are you guys doing here?” “What the hell do you think we’re doing here?” Cord said. “Trespassing on private property.” “So call a cop,” Cam shot back. Laughter. “What’s that in your hand, Donohue? Your last will and testament?” Carter asked. “You’re fucking hilarious. Why don’t you all trot home to your wives because this doesn’t concern you—” “Wrong fucking answer. If it concerns Keely, it concerns us.” “Back off,” Jack warned. “I’m handling it.” “And just how the hell are you ‘handling’ it?” Colt demanded. “Near as we can tell, she ain’t here. She ain’t been here all goddamn night, has she?” “Have you talked to her?” he asked Colt. “We talked to Chet and Remy. We know what went down.” Jack shook his head. “No, you don’t.” “Then why don’t you tell us why Keely threw her engagement ring at you and vanished?” Colby demanded. “What happened is between Keely and me. Period.” His tired eyes sought Cord’s. “AJ hasn’t heard from Keely?” “That’s between Keely and AJ,” Cord said. “Besides, it ain’t like you weren’t warned about what we’d do to you if you fucked with her. We’re here to make good on our promise.” The room seemed to shrink to the size of a dollhouse. Jack’s whole body hurt. If even one of these psycho brothers came after him, he couldn’t put up a decent fight, say nothing of taking on five pissed-off cowboys. You deserve to get your ass handed to you. And it’s going to happen either way. “You know what? You’re right. I don’t know where the hell Keely is. I’ve been going crazy waiting for her to show up and yell at me or kick my sorry ass or something.” He met each of her brother’s gazes, one at a time. “That’s why you’re here, right? To kick my ass? So go ahead.” Carter stepped forward. “Remember you asked for this, Donohue.” The last thing Jack heard was a cracking sound as Carter’s fist connected with his jaw…and then the lights went out. Dusk started to fall when Keely recognized the crunch of tires on gravel. She kept the pistol within arm’s length until she determined whether friend or foe approached. The smoke from the campfire switched direction, making her squint at the vehicle.","sourceLink":"https://allnovel.net/all-jacked-up-rough-riders-8/page-48.html","bookId":2688,"book":{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"Storyline: All Jacked Up (Rough Riders #8) Pulling off the ultimate con...if they can keep from pulling off their clothes Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. When the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/all-jacked-up-rough-riders-8.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:56 AM"}}
