{"id":35430,"no":5,"title":"HOME GIRL","content":"Wilson avenue, Chicago, is not merely an avenue but a district; not only a district but a state of mind; not a state of mind alone but a condition of morals. For that matter, it is none of these things so much as a mode of existence. If you know your Chicago—which you probably don\u0027t—(sotto voce murmur, Heaven forbid!)—you are aware that, long ago, Wilson Avenue proper crept slyly around the corner and achieved a clandestine alliance with big glittering Sheridan Road; which escapade changed the demure thoroughfare into Wilson Avenue improper. \\n\\n \\n\\n When one says \"A Wilson Avenue girl,\" the mind—that is, the Chicago mind—pictures immediately a slim, daring, scented, exotic creature dressed in next week\u0027s fashions; wise-eyed; doll-faced; rapacious. When chiffon stockings are worn Wilson Avenue\u0027s hosiery is but a film over the flesh. Aigrettes and mink coats are its winter uniform. A feverish district this, all plate glass windows and delicatessen dinners and one-room-and-kitchenette[Pg 151] apartments, where light housekeepers take their housekeeping too lightly. \\n\\n \\n\\n At six o\u0027clock you are likely to see Wilson Avenue scurrying about in its mink coat and its French heels and its crêpe frock, assembling its haphazard dinner. Wilson Avenue food, as displayed in the ready-cooked shops, resembles in a startling degree the Wilson Avenue ladies themselves: highly coloured, artificial, chemically treated, tempting to the eye, but unnutritious. In and out of the food emporia these dart, buying dabs of this and bits of that. Chromatic viands. Vivid scarlet, orange, yellow, green. A strip of pimento here. A mound of mayonnaise there. A green pepper stuffed with such burden of deceit as no honest green pepper ever was meant to hold. Two eggs. A quarter-pound of your best creamery butter. An infinitesimal bottle of cream. \"And what else?\" says the plump woman in the white bib-apron, behind the counter. \"And what else?\" Nothing. I guess that\u0027ll be all. Mink coats prefer to dine out. \\n\\n \\n\\n As a cripple displays his wounds and sores, proudly, so Wilson Avenue throws open its one-room front door with a grandiloquent gesture as it boasts, \"Two hundred and fifty a month!\" Shylock, purchasing a paper-thin slice of pinky ham in Wilson Avenue, would know his own early Venetian transaction to have been pure philanthropy.[Pg 152] \\n\\n \\n\\n It took Raymond and Cora Atwater twelve years to reach this Wilson Avenue, though they carried it with them all the way. They had begun their married life in this locality before it had become a definite district. Twelve years ago the neighbourhood had shown no signs of mushrooming into its present opulence. Twelve years ago Raymond, twenty-eight, and Cora, twenty-four, had taken a six-room flat at Racine and Sunnyside. Six rooms. Modern. Light. Rental, $28.50 per month. \\n\\n \\n\\n \"But I guess I can manage it, all right,\" Raymond had said. \"That isn\u0027t so terrible—for six rooms.\" \\n\\n \\n\\n Cora\u0027s full under lip had drawn itself into a surprisingly thin straight line. Later, Raymond came to recognize the meaning of that labial warning. \"We don\u0027t need all those rooms. It\u0027s just that much more work.\" \\n\\n \\n\\n \"I don\u0027t want you doing your own work. Not unless you want to. At first, maybe, it\u0027d be sort of fun for you. But after a while you\u0027ll want a girl to help. That\u0027ll take the maid\u0027s room off the kitchen.\" \\n\\n \\n\\n \"Well, supposing? That leaves an extra room, anyway.\" \\n\\n \\n\\n A look came into Raymond\u0027s face. \"Maybe we\u0027ll need that, too—later. Later on.\" He actually could have been said to blush, then, like a boy.[Pg 153] There was much of the boy in Raymond at twenty-eight. \\n\\n \\n\\n Cora did not blush. \\n\\n \\n\\n Raymond had married Cora because he loved her; and because she was what is known as a \"home girl.\" From the first, business girls—those alert, pert, confident little sparrows of office and shop and the street at lunch hour—rather terrified him. They gave you as good as you sent. They were always ready with their own nickel for carfare. You never knew whether they were laughing at you or not. There was a little girl named Calhoun in the binoculars (Raymond\u0027s first Chicago job was with the Erwin H. Nagel Optical Company on Wabash). The Calhoun girl was smart. She wore those plain white waists. Tailored, Raymond thought they called them. They made her skin look fresh and clear and sort of downy-blooming like the peaches that grew in his own Michigan state back home. Or perhaps only girls with clear fresh skins could wear those plain white waist things. Raymond had heard that girls thought and schemed about things that were becoming to them, and then stuck to those things. He wondered how the Calhoun girl might look in a fluffy waist. But she never wore one down to work. When business was dull in the motor and sun-glasses (which was where he held forth) Raymond would stroll over to Laura[Pg 154] Calhoun\u0027s counter and talk. He would talk about the Invention. He had no one else to talk to about it. No one he could trust, or who understood. \\n\\n \\n\\n The Calhoun girl, polishing the great black eyes of a pair of field glasses, would look up brightly to say, \"Well, how\u0027s the Invention coming on?\" Then he would tell her. \\n\\n \\n\\n The Invention had to do with spectacles. Not only that, if you are a wearer of spectacles of any kind, it has to do with you. For now, twelve years later, you could not well do without it. The little contraption that keeps the side-piece from biting into your ears—that\u0027s Raymond\u0027s. \\n\\n \\n\\n Knowing, as we do, that Raymond\u0027s wife is named Cora we know that the Calhoun girl of the fresh clear skin, the tailored white shirtwaists, and the friendly interest in the Invention, lost out. The reason for that was Raymond\u0027s youth, and Raymond\u0027s vanity, and Raymond\u0027s unsophistication, together with Lucy Calhoun\u0027s own honesty and efficiency. These last qualities would handicap any girl in love, no matter how clear her skin or white her shirtwaist. \\n\\n \\n\\n Of course, when Raymond talked to her about the Invention she should have looked adoringly into his eyes and said, \"How perfectly wonderful! I don\u0027t see how you think of such things.\" \\n\\n \\n\\n What she said, after studying its detail thought[Pg 155]fully for a moment, was: \"Yeh, but look. If this little tiny wire had a spring underneath—just a little bit of spring—it\u0027d take all the pressure off when you wear a hat. Now women\u0027s hats are worn so much lower over their ears, d\u0027you see? That\u0027d keep it from pressing. Men\u0027s hats, too, for that matter.\" \\n\\n \\n\\n She was right. Grudgingly, slowly, he admitted it. Not only that, he carried out her idea and perfected the spectacle contrivance as you know it to-day. Without her suggestion it would have had a serious flaw. He knew he ought to be grateful. He told himself that he was grateful. But in reality he was resentful. She was a smart girl, but—well—a fella didn\u0027t feel comfortable going with a girl that knew more than he did. He took her to the theatre—it was before the motion picture had attained its present-day virulence. She enjoyed it. So did he. Perhaps they might have repeated the little festivity and the white shirtwaist might have triumphed in the end. But that same week Raymond met Cora. \\n\\n \\n\\n Though he had come to Chicago from Michigan almost a year before, he knew few people. The Erwin H. Nagel Company kept him busy by day. The Invention occupied him at night. He read, too, books on optometry. Don\u0027t think that he was a Rollo. He wasn\u0027t. But he was naturally some[Pg 156]what shy, and further handicapped by an unusually tall lean frame which he handled awkwardly. If you had a good look at his eyes you forgot his shyness, his leanness, his awkwardness, his height. They were the keynote of his gentle, studious, kindly, humorous nature. But Chicago, Illinois, is too busy looking to see anything. Eyes are something you see with, not into. \\n\\n \\n\\n Two of the boys at Nagel\u0027s had an engagement for the evening with two girls who were friends. On the afternoon of that day one of the boys went home at four with a well-developed case of grippe. The other approached Raymond with his plea. \\n\\n \\n\\n \"Say, Atwater, help me out, will you? I can\u0027t reach my girl because she\u0027s downtown somewheres for the afternoon with Cora. That\u0027s her girl friend. And me and Harvey was to meet \u0027em for dinner, see? And a show. I\u0027m in a hole. Help me out, will you? Go along and fuss Cora. She\u0027s a nice girl. Pretty, too, Cora is. Will you, Ray? Huh?\" \\n\\n \\n\\n Ray went. By nine-thirty that evening he had told Cora about the Invention. And Cora had turned sidewise in her seat next to him at the theatre and had looked up at him adoringly, awe-struck. \"Why, how perfectly wonderful! I don\u0027t see how you think of such things.\" \\n\\n \\n\\n \"Oh, that\u0027s nothing. I got a lot of ideas. Things I\u0027m going to work out. Say, I won\u0027t always be[Pg 157] plugging down at Nagel\u0027s, believe me. I got a lot of ideas.\" \\n\\n \\n\\n \"Really! Why, you\u0027re an inventor, aren\u0027t you! Like Edison and those. My, it must be wonderful to think of things out of your head. Things that nobody\u0027s ever thought of before.\" \\n\\n \\n\\n Ray glowed. He felt comfortable, and soothed, and relaxed and stimulated. And too large for his clothes. \"Oh, I don\u0027t know. I just think of things. That\u0027s all there is to it. That\u0027s nothing.\" \\n\\n \\n\\n \"Oh, isn\u0027t it! No, I guess not. I\u0027ve never been out with a real inventor before ... I bet you think I\u0027m a silly little thing.\" \\n\\n \\n\\n He protested, stoutly. \"I should say not.\" A thought struck him. \"Do you do anything? Work downtown somewheres, or anything?\" \\n\\n \\n\\n She shook her head. Her lips pouted. Her eyebrows made pained twin crescents. \"No. I don\u0027t do anything. I was afraid you\u0027d ask that.\" She looked down at her hands—her white, soft hands with little dimples at the finger-bases. \"I\u0027m just a home girl. That\u0027s all. A home girl. Now you will think I\u0027m a silly stupid thing.\" She flashed a glance at him, liquid-eyed, appealing. \\n\\n \\n\\n He was surprised (she wasn\u0027t) to find his hand closed tight and hard over her soft dimpled one. He was terror-stricken (she wasn\u0027t) to hear his voice saying, \"I think you\u0027re wonderful. I think you\u0027re[Pg 158] the most wonderful girl I ever saw, that\u0027s what.\" He crushed her hand and she winced a little. \"Home girl.\" \\n\\n \\n\\n Cora\u0027s name suited her to a marvel. Her hair was black and her colouring a natural pink and white, which she abetted expertly. Cora did not wear plain white tailored waists. She wore thin, fluffy, transparent things that drew your eyes and fired your imagination. Raymond began to call her Coral in his thoughts. Then, one evening, it slipped out. Coral. She liked it. He denied himself all luxuries and most necessities and bought her a strand of beads of that name, presenting them to her stammeringly, clumsily, tenderly. Tender pink and cream, they were, like her cheeks, he thought. \\n\\n \\n\\n \"Oh, Ray, for me! How darling! You naughty boy!... But I\u0027d rather have had those clear white ones, without any colouring. They\u0027re more stylish. Do you mind?\" \\n\\n \\n\\n When he told Laura Calhoun she said, \"I hope you\u0027ll be very happy. She\u0027s a lucky girl. Tell me about her, will you?\" \\n\\n \\n\\n Would he! His home girl! \\n\\n \\n\\n When he had finished she said, quietly, \"Oh, yes.\" \\n\\n \\n\\n And so Raymond and Cora were married and went to live in six-room elegance at Sunnyside and Racine. The flat was furnished sumptuously in Mission and those red and brown soft leather cush[Pg 159]ions with Indian heads stamped on them. There was a wooden rack on the wall with six monks\u0027 heads in coloured plaster, very life-like, stuck on it. This was a pipe-rack, though Raymond did not smoke a pipe. He liked a mild cigar. Then there was a print of Gustave Richter\u0027s \"Queen Louise\" coming down that broad marble stair, one hand at her breast, her great girlish eyes looking out at you from the misty folds of her scarf. What a lot of the world she has seen from her stairway! The shelf that ran around the dining room wall on a level with your head was filled with steins in such shapes and colours as would have curdled their contents—if they had ever had any contents. \\n\\n \\n\\n They planned to read a good deal, evenings. Improve their minds. It was Ray\u0027s idea, but Cora seconded it heartily. This was before their marriage. \\n\\n \\n\\n \"Now, take history alone,\" Ray argued: \"American history. Why, you can read a year and hardly know the half of it. That\u0027s the trouble. People don\u0027t know the history of their own country. And it\u0027s interesting, too, let me tell you. Darned interesting. Better\u0027n novels, if folks only knew it.\" \\n\\n \\n\\n \"My, yes,\" Cora agreed. \"And French. We could take up French, evenings. I\u0027ve always wanted to study French. They say if you know French you can travel anywhere. It\u0027s all in the accent;[Pg 160] and goodness knows I\u0027m quick at picking up things like that.\" \\n\\n \\n\\n \"Yeh,\" Ray had said, a little hollowly, \"yeh, French. Sure.\" \\n\\n \\n\\n But, somehow, these literary evenings never did materialize. It may have been a matter of getting the books. You could borrow them from the public library, but that made you feel so hurried. History was something you wanted to take your time over. Then, too, the books you wanted never were in. You could buy them. But buying books like that! Cora showed her first real display of temper. Why, they came in sets and cost as much as twelve or fifteen dollars. Just for books! The literary evenings degenerated into Ray\u0027s thorough scanning of the evening paper, followed by Cora\u0027s skimming of the crumpled sheets that carried the department store ads, the society column, and the theatrical news. Raymond began to use the sixth room—the unused bedroom—as a workshop. He had perfected the spectacle contrivance and had made the mistake of selling his rights to it. He got a good sum for it. \\n\\n \\n\\n \"But I\u0027ll never do that again,\" he said, grimly. \"Somebody\u0027ll make a fortune on that thing.\" He had unwisely told Cora of this transaction. She never forgave him for it. On the day he received the money for it he had brought her home a fur set of baum marten. He thought the stripe in it beau[Pg 161]tiful. There was a neckpiece known as a stole, and a large muff. \\n\\n \\n\\n \"Oh, honey!\" Cora had cried. \"Aren\u0027t you fun-ny!\" She often said that, always with the same accent. \"Aren\u0027t you fun-ny!\" \\n\\n \\n\\n \"What\u0027s the matter?\" \\n\\n \\n\\n \"Why didn\u0027t you let me pick it out? They\u0027re wearing Persian lamb sets.\" \\n\\n \\n\\n \"Oh. Well, maybe the feller\u0027ll change it. It\u0027s all paid for, but maybe he\u0027ll change it.\" \\n\\n \\n\\n \"Do you mind? It may cost a little bit more. You don\u0027t mind my changing it though, do you?\" \\n\\n \\n\\n \"No. No-o-o-o! Not a bit.\" \\n\\n \\n\\n They had never furnished the unused bedroom as a bedroom. When they moved out of the flat at Racine and Sunnyside into one of those new four-room apartments on Glengyle the movers found only a long rough work-table and a green-shaded lamp in that sixth room. Ray\u0027s delicate tools and implements were hard put to it to find a resting place in the new four-room apartment. Sometimes Ray worked in the bathroom. He grew rather to like the white-tiled place, with its look of a laboratory. But then, he didn\u0027t have as much time to work at home as he formerly had had. They went out more evenings. \\n\\n \\n\\n The new four-room flat rented at sixty dollars.[Pg 162] \"Seems the less room you have the more you pay,\" Ray observed. \\n\\n \\n\\n \"There\u0027s no comparison. Look at the neighbourhood! And the living room\u0027s twice as big.\" \\n\\n \\n\\n It didn\u0027t seem to be. Perhaps this was due to its furnishings. The Mission pieces had gone to the second-hand dealer. Ray was assistant manager of the optical department at Nagel\u0027s now and he was getting royalties on a new smoked glass device. There were large over-stuffed chairs in the new living room, and a seven-foot davenport, and oriental rugs, and lamps and lamps and lamps. The silk lampshade conflagration had just begun to smoulder in the American household. The dining room had one of those built-in Chicago buffets. It sparkled with cut glass. There was a large punch bowl in the centre, in which Cora usually kept receipts, old bills, moth balls, buttons, and the tarnished silver top to a syrup jug that she always meant to have repaired. Queen Louise was banished to the bedroom where she surveyed a world of cretonne. \\n\\n \\n\\n Cora was a splendid cook. She had almost a genius for flavouring. Roast or cheese soufflé or green apple pie—your sense of taste never experienced that disappointment which comes of too little salt, too much sugar, a lack of shortening. Expert as she was at it, Cora didn\u0027t like to cook. That is, she didn\u0027t like to cook day after day. She rather[Pg 163] liked doing an occasional meal and producing it in a sort of red-cheeked triumph. When she did this it was an epicurean thing, savoury, hot, satisfying. But as a day-after-day programme Cora would not hear of it. She had banished the maid. Four rooms could not accommodate her. A woman came in twice a week to wash and iron and clean. Often Cora did not get up for breakfast and Ray got his at one of the little lunch rooms that were springing up all over that section of the North Side. Eleven o\u0027clock usually found Cora at the manicure\u0027s, or the dressmaker\u0027s, or shopping, or telephoning luncheon arrangements with one of the Crowd. Ray and Cora were going out a good deal with the Crowd. Young married people like themselves, living royally just a little beyond their income. The women were well-dressed, vivacious, somewhat shrill. They liked stories that were a little off-colour. \"Blue,\" one of the men called these stories. He was in the theatrical business. The men were, for the most part, a rather drab-looking lot. Colourless, good-natured, open-handed. Almost imperceptibly the Crowd began to use Ray as a target for a certain raillery. It wasn\u0027t particularly ill-natured, and Ray did not resent it. \\n\\n \\n\\n \"Oh, come on, Ray! Don\u0027t be a wet blanket.... Lookit him! I bet he\u0027s thinking about those smoked glasses again. Eh, Atwater? He\u0027s in[Pg 164] a daze about that new rim that won\u0027t show on the glasses. Come out of it! First thing you know you\u0027ll lose your little Cora.\" \\n\\n \\n\\n There was little danger of that. Though Cora flirted mildly with the husbands of the other girls in the Crowd (they all did) she was true to Ray. \\n\\n \\n\\n Ray was always talking of building a little place of their own. People were beginning to move farther and farther north, into the suburbs. \\n\\n \\n\\n \"Little place of your own,\" Ray would say, \"that\u0027s the only way to live. Then you\u0027re not paying it all out in rent to the other feller. Little place of your own. That\u0027s the right idear.\" \\n\\n \\n\\n But as the years went by, and Ray earned more and more money, he and Cora seemed to be getting farther and farther away from the right idear. In the $28.50 apartment Cora\u0027s morning marketing had been an orderly daily proceeding. Meat, vegetables, fruit, dry groceries. But now the maidless four-room apartment took on, in spite of its cumbersome furnishings, a certain air of impermanence. \\n\\n \\n\\n \"Ray, honey, I haven\u0027t a scrap in the house. I didn\u0027t get home until almost six. Those darned old street cars. I hate \u0027em. Do you mind going over Jo Bauer\u0027s to eat? I won\u0027t go, because Myrtle served a regular spread at four. I couldn\u0027t eat a thing. D\u0027you mind?\" \\n\\n \\n\\n \"Why, no.\" He would get into his coat again[Pg 165] and go out into the bleak November wind-swept street to Bauer\u0027s restaurant. \\n\\n \\n\\n Cora was always home when Raymond got there at six. She prided herself on this. She would say, primly, to her friends, \"I make a point of being there when Ray gets home. Even if I have to cut a round of bridge. If a woman can\u0027t be there when a man gets home from work I\u0027d like to know what she\u0027s good for, anyway.\" \\n\\n \\n\\n The girls in the Crowd said she was spoiling Raymond. She told Ray this. \"They think I\u0027m old-fashioned. Well, maybe I am. But I guess I never pretended to be anything but a home girl.\" \\n\\n \\n\\n \"That\u0027s right,\" Ray would answer. \"Say, that\u0027s the way you caught me. With that home-girl stuff.\" \\n\\n \\n\\n \"Caught you!\" The thin straight line of the mouth. \"If you think for one minute——\" \\n\\n \\n\\n \"Oh, now, dear. You know what I mean, sweetheart. Why, say, I never could see any girl until I met you. You know that.\" \\n\\n \\n\\n He was as honestly in love with her as he had been nine years before. Perhaps he did not feel now, as then, that she had conferred a favour upon him in marrying him. Or if he did he must have known that he had made fair return for such favour. \\n\\n \\n\\n Cora had a Hudson seal coat now, with a great kolinsky collar. Her vivid face bloomed rosily in this soft frame. Cora was getting a little heavier.[Pg 166] Not stout, but heavier, somehow. She tried, futilely, to reduce. She would starve herself at home for days, only to gain back the vanished pounds at one afternoon\u0027s orgy of whipped-cream salad, and coffee, and sweets at the apartment of some girl in the Crowd. Dancing had come in and the Crowd had taken it up vociferously. Raymond was not very good at it. He had not filled out with the years. He still was lean and tall and awkward. The girls in the crowd tried to avoid dancing with him. That often left Cora partnerless unless she wanted to dance again and again with Raymond. \\n\\n \\n\\n \"How can you expect the boys to ask me to dance when you don\u0027t dance with their wives! Good heavens, if they can learn, you can. And for pity\u0027s sake don\u0027t count! You\u0027re so fun-ny!\" \\n\\n \\n\\n He tried painstakingly to heed her advice, but his long legs made a sorry business of it. He heard one of the girls refer to him as \"that giraffe.\" He had put his foot through an absurd wisp of tulle that she insisted on calling a train. \\n\\n \\n\\n They were spending a good deal of money now, but Ray jousted the landlord, the victualler, the furrier, the milliner, the hosiery maker, valiantly and still came off the victor. He did not have as much time as he would have liked to work on the new invention. The invisible rim. It was calculated so to blend with the glass of the lens as to be, in ap[Pg 167]pearance, one with it, while it still protected the eyeglass from breakage. \"Fortune in it, girlie,\" he would say, happily, to Cora. \"Million dollars, that\u0027s all.\" \\n\\n \\n\\n He had been working on the invisible rim for five years. Familiarity with it had bred contempt in Cora. Once, in a temper, \"Invisible is right,\" she had said, slangily. \\n\\n \\n\\n They had occupied the four-room apartment for five years. Cora declared it was getting beyond her. \"You can\u0027t get any decent help. The washwoman acts as if she was doing me a favour coming from eight to four, for four dollars and eighty-five cents. And yesterday she said she couldn\u0027t come to clean any more on Saturdays. I\u0027m sick and tired of it.\" \\n\\n \\n\\n Raymond shook a sympathetic head. \"Same way down at the store. Seems everything\u0027s that way now. You can\u0027t get help and you can\u0027t get goods. You ought to hear our customers. Yesterday I thought I\u0027d go clear out of my nut, trying to pacify them.\" \\n\\n \\n\\n Cora inserted the entering wedge, deftly. \"Goodness knows I love my home. But the way things are now ...\" \\n\\n \\n\\n \"Yeh,\" Ray said, absently. When he spoke like that Cora knew that the invisible rim was revolving in his mind. In another moment he would be off to[Pg 168] the little cabinet in the bathroom where he kept his tools and instruments. \\n\\n \\n\\n She widened the opening. \"I noticed as I passed to-day that those new one-room kitchenette apartments on Sheridan will be ready for occupancy October first.\" He was going toward the door. \"They say they\u0027re wonderful.\" \\n\\n \\n\\n \"Who wants to live in one room, anyway?\" \\n\\n \\n\\n \"It\u0027s really two rooms—and the kitchenette. There\u0027s the living room—perfectly darling—and a sort of combination breakfast room and kitchen. The breakfast room is partitioned off with sort of cupboards so that it\u0027s really another room. And so handy!\" \\n\\n \\n\\n \"How\u0027d you know?\" \\n\\n \\n\\n \"I went in—just to look at them—with one of the girls.\" \\n\\n \\n\\n Until then he had been unconscious of her guile. But now, suddenly, struck by a hideous suspicion—\"Say, looka here. If you think——\" \\n\\n \\n\\n \"Well, it doesn\u0027t hurt to look at \u0027em, does it!\" \\n\\n \\n\\n A week later. \"Those kitchenette apartments on Sheridan are almost all gone. One of the girls was looking at one on the sixth floor. There\u0027s a view of the lake. The kitchen\u0027s the sweetest thing. All white enamel. And the breakfast room thing is done in Italian.\" \\n\\n \\n\\n \"What d\u0027you mean—done in Italian?\"[Pg 169] \\n\\n \\n\\n \"Why—uh—Italian period furniture, you know. Dark and rich. The living room\u0027s the same. Desk, and table, and lamps.\" \\n\\n \\n\\n \"Oh, they\u0027re furnished?\" \\n\\n \\n\\n \"Complete. Down to the kettle covers and the linen and all. The work there would just be play. All the comforts of a home, with none of the terrible aggravations.\" \\n\\n \\n\\n \"Say, look here, Coral, we don\u0027t want to go to work and live in any one room. You wouldn\u0027t be happy. Why, we\u0027d feel cooped up. No room to stretch.... Why, say, how about the beds? If there isn\u0027t a bedroom how about the beds? Don\u0027t people sleep in those places?\" \\n\\n \\n\\n \"There are Murphy beds, silly.\" \\n\\n \\n\\n \"Murphy? Who\u0027s he?\" \\n\\n \\n\\n \"Oh, goodness, I don\u0027t know! The man who invented \u0027em, I suppose. Murphy.\" \\n\\n \\n\\n Raymond grinned in anticipation of his own forthcoming joke. \"I should think they\u0027d call \u0027em Morphy beds.\" Then, at her blank stare. \"You know—short for Morpheus, god of sleep. Learned about him at high school.\" \\n\\n \\n\\n Cora still looked blank. Cora hardly ever understood Ray\u0027s jokes, or laughed at them. He would turn, chuckling, to find her face a blank. Not even bewildered, or puzzled, or questioning. Blank. Unheeding. Disinterested as a slate.[Pg 170] \\n\\n \\n\\n Three days later Cora developed an acute pain in her side. She said it was nothing. Just worn out with the work, and the worry and the aggravation, that\u0027s all. It\u0027ll be all right. \\n\\n \\n\\n Ray went with her to look at the Sheridan Road apartment. It was one hundred and fifty dollars. \"Phew!\" \\n\\n \\n\\n \"But look at what you save? Gas. Light. Maid service. Laundry. It\u0027s really cheaper in the end.\" \\n\\n \\n\\n Cora was amazingly familiar with all the advantages and features of the sixth-floor apartment. \"The sun all morning.\" She had all the agent\u0027s patter. \"Harvey-Dickson ventilated double-spring mattresses. Dressing room off the bathroom. No, it isn\u0027t a closet. Here\u0027s the closet. Range, refrigerator, combination sink and laundry tub. Living room\u0027s all panelled in ivory. Shower in the bathroom. Buffet kitchen. Breakfast room has folding-leaf Italian table. Look at the chairs. Aren\u0027t they darlings! Built-in book shelves——\" \\n\\n \\n\\n \"Book shelves?\" \\n\\n \\n\\n \"Oh, well, we can use them for fancy china and ornaments. Or—oh, look!—you could keep your stuff there. Tools and all. Then the bathroom wouldn\u0027t be mussy all the time.\" \\n\\n \\n\\n \"Beds?\" \\n\\n \\n\\n \"Right here. Isn\u0027t that wonderful. Would you[Pg 171] ever know it was there? You can work it with one hand. Look.\" \\n\\n \\n\\n \"Do you really like it, Coral?\" \\n\\n \\n\\n \"I love it. It\u0027s heavenly.\" \\n\\n \\n\\n He stood in the centre of the absurd living room, a tall, lank, awkward figure, a little stooped now. His face was beginning to be furrowed with lines—deep lines that yet were softening, and not unlovely. He made you think, somehow, as he stood there, one hand on his own coat lapel, of Saint-Gaudens\u0027 figure of Lincoln, there in the park, facing the Drive. Kindly, thoughtful, harried. \\n\\n \\n\\n They moved in October first. \\n\\n \\n\\n The over-stuffed furniture of the four-room apartment was sold. Cora kept a few of her own things—a rug or two, some china, silver, bric-à-brac, lamps. Queen Louise was now permanently dethroned. Cora said her own things—\"pieces\"—would spoil the effect of the living room. All Italian. \\n\\n \\n\\n \"No wonder the Italians sit outdoors all the time, on the steps and in the street\"—more of Ray\u0027s dull humour. He surveyed the heavy gloomy pieces, so out of place in the tiny room. One of the chairs was black velvet. It was the only really comfortable chair in the room but Ray never sat in it. It reminded him, vaguely, of a coffin. The corridors of the apartment house were long, narrow, and white-walled. You traversed these like a convict,[Pg 172] speaking to no one, and entered your own cubicle. A toy dwelling for toy people. But Ray was a man-size man. When he was working downtown his mind did not take temporary refuge in the thought of the feverish little apartment to which he was to return at night. It wasn\u0027t a place to come back to, except for sleep. A roost. Bedding for the night. As permanent-seeming as a hay-mow. \\n\\n \\n\\n Cora, too, gave him a strange feeling of impermanence. He realized one day, with a shock, that he hardly ever saw her with her hat off. When he came in at six or six-thirty Cora would be busy at the tiny sink, or the toy stove, her hat on, a cigarette dangling limply from her mouth. Ray did not object to women smoking. That is, he had no moral objection. But he didn\u0027t think it became them. But Cora said a cigarette rested and stimulated her. \"Doctors say all nervous women should smoke,\" she said. \"Soothes them.\" But Cora, cooking in the little kitchen, squinting into a kettle\u0027s depths through a film of cigarette smoke, outraged his sense of fitness. It was incongruous, offensive. The time, and occupation, and environment, together with the limply dangling cigarette, gave her an incredibly rowdy look. \\n\\n \\n\\n When they ate at home they had steak or chops, and, perhaps, a chocolate éclair for dessert; and a[Pg 173] salad. Raymond began to eat mental meals. He would catch himself thinking of breaded veal chops, done slowly, simmeringly, in butter, so that they came out a golden brown on a parsley-decked platter. With this mashed potatoes with brown butter and onions that have just escaped burning; creamed spinach with egg grated over the top; a rice pudding, baked in the oven, and served with a tart crown of grape jell. He sometimes would order these things in a restaurant at noon, or on the frequent evenings when they dined out. But they never tasted as he had thought they would. \\n\\n \\n\\n They dined out more and more as spring drew on and the warm weather set in. The neighbourhood now was aglitter with eating places of all sorts and degrees, from the humble automat to the proud plush of the Sheridan Plaza dining room. There were tea-rooms, cafeterias, Hungarian cafés, chop suey restaurants. At the table d\u0027h?te places you got a soup, followed by a lukewarm plateful of meat, vegetables, salad. The meat tasted of the vegetables, the vegetables tasted of the meat, and the salad tasted of both. Before ordering Ray would sit down and peer about at the food on the near-by tables as one does in a dining car when the digestive fluids have dried in your mouth at the first whiff through the doorway. It was on one of these evenings that he noticed Cora\u0027s hat.[Pg 174] \\n\\n \\n\\n \"What do you wear a hat for all the time?\" he asked, testily. \\n\\n \\n\\n \"Hat?\" \\n\\n \\n\\n \"Seems to me I haven\u0027t seen you without a hat in a month. Gone bald, or something?\" He was often cross like this lately. Grumpy, Cora called it. Hats were one of Cora\u0027s weaknesses. She had a great variety of them. These added to Ray\u0027s feeling of restlessness and impermanence. Sometimes she wore a hat that came down over her head, covering her forehead and her eyes, almost. The hair he used to love to touch was concealed. Sometimes he dined with an ingénue in a poke bonnet; sometimes with a se?orita in black turban and black lace veil, mysterious and provocative; sometimes with a demure miss in a wistful little turned-down brim. It was like living with a stranger who was always about to leave. \\n\\n \\n\\n When they ate at home, which was rarely, Ray tried, at first, to dawdle over his coffee and his mild cigar, as he liked to do. But you couldn\u0027t dawdle at a small, inadequate table that folded its flaps and shrank into a corner the minute you left it. Everything in the apartment folded, or flapped, or doubled, or shot in, or shot out, or concealed something else, or pretended to be something it was not. It was very irritating. Ray took his cigar and his evening paper and wandered uneasily into the Italian living[Pg 175] room, doubling his lean length into one of his queer, angular hard chairs. \\n\\n \\n\\n Cora would appear in the doorway, hatted. \"Ready?\" \\n\\n \\n\\n \"Huh? Where you going?\" \\n\\n \\n\\n \"Oh, Ray, aren\u0027t you fun-ny! You know this is the Crowd\u0027s poker night at Lil\u0027s.\" \\n\\n \\n\\n The Crowd began to say that old Ray was going queer. Honestly, didja hear him last week? Talking about the instability of the home, and the home being the foundation of the state, and the country crumbling? Cora\u0027s face was a sight! I wouldn\u0027t have wanted to be in his boots when she got him home. What\u0027s got into him, anyway? \\n\\n \\n\\n Cora was a Wilson Avenue girl now. You saw her in and out of the shops of the district, expensively dressed. She was almost thirty-six. Her legs, beneath the absurdly short skirt of the day, were slim and shapely in their chiffon hose, but her upper figure was now a little prominent. The scant, brief skirt fore-shortened her; gave her a stork-like appearance; a combination of girlishness and matronliness not pleasing. \\n\\n \\n\\n There were times when Ray rebelled. A peace-loving man, and gentle. But a man. \"I don\u0027t want to go out to eat. My God, I\u0027m tired! I want to eat at home.\"[Pg 176] \\n\\n \\n\\n \"Honey, dear, I haven\u0027t a thing in the house. Not a scrap.\" \\n\\n \\n\\n \"I\u0027ll go out and get something, then. What d\u0027you want?\" \\n\\n \\n\\n \"Get whatever looks good to you. I don\u0027t want a thing. We had tea after the matinée. That\u0027s what made me so late. I\u0027m always nagging the girls to go home. It\u0027s getting so they tease me about it.\" \\n\\n \\n\\n He would go foraging amongst the delicatessen shops of the neighbourhood. He saw other men, like himself, scurrying about with moist paper packets and bags and bundles, in and out of Leviton\u0027s, in and out of the Sunlight Bakery. A bit of ham. Some cabbage salad in a wooden boat. A tiny broiler, lying on its back, its feet neatly trussed, its skin crackly and tempting-looking, its white meat showing beneath the brown. But when he cut into it at home it tasted like sawdust and gutta-percha. \"And what else?\" said the plump woman in the white bib-apron behind the counter. \"And what else?\" \\n\\n \\n\\n In the new apartment you rather prided yourself on not knowing your next-door neighbours. The paper-thin walls permitted you to hear them living the most intimate details of their lives. You heard them laughing, talking, weeping, singing, scolding, caressing. You didn\u0027t know them. You did not[Pg 177] even see them. When you met in the halls or elevators you did not speak. Then, after they had lived in the new apartment about a year Cora met the woman in 618 and Raymond met the woman in 620, within the same week. The Atwaters lived in 619. \\n\\n \\n\\n There was some confusion in the delivery of a package. The woman in 618 pressed the Atwaters\u0027 electric button for the first time in their year\u0027s residence there. \\n\\n \\n\\n A plump woman, 618; blonde; in black. You felt that her flesh was expertly restrained in tight pink satin brassières and long-hipped corsets and many straps. \\n\\n \\n\\n \"I hate to trouble you, but did you get a package for Mrs. Hoyt? It\u0027s from Field\u0027s.\" \\n\\n \\n\\n It was five-thirty. Cora had her hat on. She did not ask the woman to come in. \"I\u0027ll see. I ordered some things from Field\u0027s to-day, too. I haven\u0027t opened them yet. Perhaps yours ... I\u0027ll look.\" \\n\\n \\n\\n The package with Mrs. Hoyt\u0027s name on it was there. \"Well, thanks so much. It\u0027s some georgette crêpe. I\u0027m making myself one those new two-tone slip-over negligees. Field\u0027s had a sale. Only one sixty-nine a yard.\" \\n\\n \\n\\n Cora was interested. She sewed rather well when she was in the mood. \"Are they hard to make?\" \\n\\n \\n\\n \"Oh, land, no! No trick to it at all. They just[Pg 178] hang from the shoulder, see? Like a slip-over. And then your cord comes round——\" \\n\\n \\n\\n She stepped in. She undid the box and shook out the vivid folds of the filmy stuff, vivid green and lavender. \"You wouldn\u0027t think they\u0027d go well together but they do. Makes a perfectly stunning negligee.\" \\n\\n \\n\\n Cora fingered the stuff. \"I\u0027d get some. Only I don\u0027t know if I could cut the——\" \\n\\n \\n\\n \"I\u0027ll show you. Glad to.\" She was very friendly. Cora noticed she used expensive perfume. Her hair was beautifully marcelled. The woman folded up the material and was off, smiling. \"Just let me know when you get it. I\u0027ve got a lemon cream pie in the oven and I\u0027ve got to run.\" She called back over her shoulder. \"Mrs. Hoyt.\" \\n\\n \\n\\n Cora nodded and smiled. \"Mine\u0027s Atwater.\" She saw that the woman\u0027s simple-seeming black dress was one she had seen in a Michigan Avenue shop, and had coveted. Its price had been beyond her purse. \\n\\n \\n\\n Cora mentioned the meeting to Ray when he came home. \"She seems real nice. She\u0027s going to show me how to cut out a new negligee.\" \\n\\n \\n\\n \"What\u0027d you say her name was?\" She told him. He shrugged. \"Well, I\u0027ll say this: she must be some swell cook. Whenever I go by that door at dinner time my mouth just waters. One night last[Pg 179] week there was something must have been baked spare-ribs and sauerkraut. I almost broke in the door.\" \\n\\n \\n\\n The woman in 618 did seem to cook a great deal. That is, when she cooked. She explained that Mr. Hoyt was on the road a lot of the time and when he was home she liked to fuss for him. This when she was helping Cora cut out the georgette negligee. \\n\\n \\n\\n \"I\u0027d get coral colour if I was you, honey. With your hair and all,\" Mrs. Hoyt had advised her. \\n\\n \\n\\n \"Why, that\u0027s my name! That is, it\u0027s what Ray calls me. My name\u0027s really Cora.\" They were quite good friends now. \\n\\n \\n\\n It was that same week that Raymond met the woman in 620. He had left the apartment half an hour later than usual (he had a heavy cold, and had not slept) and encountered the man and woman just coming out of 620. \\n\\n \\n\\n \"And guess who it was!\" he exclaimed to Cora that evening. \"It was a girl who used to work at Nagel\u0027s, in the binoculars, years ago, when I started there. Calhoun, her name was. Laura Calhoun. Smart little girl, she was. She\u0027s married now. And guess what! She gets a big salary fitting glasses for women at the Bazaar. She learned to be an optician. Smart girl.\" \\n\\n \\n\\n Cora bridled, virtuously. \"Well, I think she\u0027d better stay home and take care of that child of hers.[Pg 180] I should think she\u0027d let her husband earn the living. That child is all soul alone when she comes home from school. I hear her practising. I asked Mrs. Hoyt about her. She say\u0027s she\u0027s seen her. A pindling scrawny little thing, about ten years old. She leaves her alone all day.\" \\n\\n \\n\\n Ray encountered the Calhoun girl again, shortly after that, in the way encounters repeat themselves, once they have started. \\n\\n \\n\\n \"She didn\u0027t say much but I guess her husband is a nit-wit. Funny how a smart girl like that always marries one of these sap-heads that can\u0027t earn a living. She said she was working because she wanted her child to have the advantages she\u0027d missed. That\u0027s the way she put it.\" \\n\\n \\n\\n One heard the long-legged, melancholy child next door practising at the piano daily at four. Cora said it drove her crazy. But then, Cora was rarely home at four. \"Well,\" she said now, virtuously, \"I don\u0027t know what she calls advantages. The way she neglects that kid. Look at her! I guess if she had a little more mother and a little less education it\u0027d be better for her.\" \\n\\n \\n\\n \"Guess that\u0027s right,\" Ray agreed. \\n\\n \\n\\n It was in September that Cora began to talk about the mink coat. A combination anniversary and Christmas gift. December would mark their twelfth anniversary. A mink coat.[Pg 181] \\n\\n \\n\\n Raymond remembered that his mother had had a mink coat, back there in Michigan, years ago. She always had taken it out in November and put it away in moth balls and tar paper in March. She had done this for years and years. It was a cheerful yellow mink, with a slightly darker marking running through it, and there had been little mink tails all around the bottom edge of it. It had spread comfortably at the waist. Women had had hips in those days. With it his mother had carried a mink muff; a small yellow-brown cylinder just big enough for her two hands. It had been her outdoor uniform, winter after winter, for as many years as he could remember of his boyhood. When she had died the mink coat had gone to his sister Carrie, he remembered. \\n\\n \\n\\n A mink coat. The very words called up in his mind sharp winter days; the pungent moth-bally smell of his mother\u0027s fur-coated bosom when she had kissed him good-bye that day he left for Chicago; comfort; womanliness. A mink coat. \\n\\n \\n\\n \"How much could you get one for? A mink coat.\" \\n\\n \\n\\n Cora hesitated a moment. \"Oh—I guess you could get a pretty good one for three thousand.\" \\n\\n \\n\\n \"You\u0027re crazy,\" said Ray, unemotionally. He was not angry. He was amused. \\n\\n \\n\\n But Cora was persistent. Her coat was a sight.[Pg 182] She had to have something. She never had had a real fur coat. \\n\\n \\n\\n \"How about your Hudson seal?\" \\n\\n \\n\\n \"Hudson seal! Did you ever see any seals in the Hudson! Fake fur. I\u0027ve never had a really decent piece of fur in my life. Always some mangy make-believe. All the girls in the Crowd are getting new coats this year. The woman next door—Mrs. Hoyt—is talking of getting one. She says Mr. Hoyt——\" \\n\\n \\n\\n \"Say, who are these Hoyts, anyway?\" \\n\\n \\n\\n Ray came home early one day to find the door to 618 open. He glanced in, involuntarily. A man sat in the living room—a large, rather red-faced man, in his shirt-sleeves, relaxed, comfortable, at ease. From the open door came the most tantalizing and appetizing smells of candied sweet potatoes, a browning roast, steaming vegetables. \\n\\n \\n\\n Mrs. Hoyt had run in to bring a slice of fresh-baked chocolate cake to Cora. She often brought in dishes of exquisitely prepared food thus, but Raymond had never before encountered her. Cora introduced them. Mrs. Hoyt smiled, nervously, and said she must run away and tend to her dinner. And went. Ray looked after her. He strode into the kitchenette where Cora stood, hatted, at the sink. \\n\\n \\n\\n \"Say, looka here, Cora. You got to quit seeing that woman, see?\"[Pg 183] \\n\\n \\n\\n \"What woman?\" \\n\\n \\n\\n \"One calls herself Mrs. Hoyt. That woman. Mrs. Hoyt! Ha!\" \\n\\n \\n\\n \"Why, Ray, what in the world are you talking about! Aren\u0027t you fun-ny!\" \\n\\n \\n\\n \"Yeh; well, you cut her out. I won\u0027t have you running around with a woman like that. Mrs. Hoyt! Mrs. Fiddlesticks!\" \\n\\n \\n\\n They had a really serious quarrel about it. When the smoke of battle cleared away Raymond had paid the first instalment on a three thousand dollar mink coat. And, \"If we could sub-lease,\" Cora said, \"I think it would be wonderful to move to the Shoreham. Lil and Harry are going there in January. You know yourself this place isn\u0027t half respectable.\" \\n\\n \\n\\n Raymond had stared. \"Shoreham! Why, it\u0027s a hotel. Regular hotel.\" \\n\\n \\n\\n \"Yes,\" placidly. \"That\u0027s what\u0027s so nice about it. No messing around in a miserable little kitchenette. You can have your meals sent up. Or you can go down to the dining room. Lil says it\u0027s wonderful. And if you order for one up in your room the portions are big enough for two. It\u0027s really economy, in the end.\" \\n\\n \\n\\n \"Nix,\" said Ray. \"No hotel in mine. A little house of our own. That\u0027s the right idea. Build.\" \\n\\n \\n\\n \"But nobody\u0027s building now. Materials are so high. It\u0027ll cost you ten times as much as it would if[Pg 184] you waited a few—a little while. And no help. No maids coming over, hardly. I think you might consider me a little. We could live at the Shoreham a while, anyway. By that time things will be better, and we\u0027d have money saved up and then we might talk of building. Goodness knows I love my home as well as any woman——\" \\n\\n \\n\\n They looked at the Shoreham rooms on the afternoon of their anniversary. They were having the Crowd to dinner, downtown, that evening. Cora thought the Shoreham rooms beautiful, though she took care not to let the room-clerk know she thought so. Ray, always a silent, inarticulate man, was so wordless that Cora took him to task for it in a sibilant aside. \\n\\n \\n\\n \"Ray, for heaven\u0027s, sake say something. You stand there! I don\u0027t know what the man\u0027ll think.\" \\n\\n \\n\\n \"A hell of a lot I care what he thinks.\" Ray was looking about the garish room—plush chairs, heavy carpets, brocade hangings, shining table-top, silly desk. \\n\\n \\n\\n \"Two hundred and seventy-five a month,\" the clerk was saying. \"With the yearly lease, of course. Otherwise it\u0027s three twenty-five.\" He seemed quite indifferent. \\n\\n \\n\\n Ray said nothing. \"We\u0027ll let you know,\" said Cora. \\n\\n \\n\\n The man walked to the door. \"I can\u0027t hold it for[Pg 185] you, you know. Our apartments are practically gone. I\u0027ve a party who practically has closed for this suite already. I\u0027d have to know.\" \\n\\n \\n\\n Cora looked at Ray. He said nothing. He seemed not to have heard. His face was gaunt and haggard. \"We\u0027ll let you know—to-morrow,\" Cora said. Her full under lip made a straight thin line. \\n\\n \\n\\n When they came out it was snowing. A sudden flurry. It was already dark. \"Oh, dear,\" said Cora. \"My hat!\" Ray summoned one of the hotel taxis. He helped Cora into it. He put money into the driver\u0027s hand. \\n\\n \\n\\n \"You go on, Cora. I\u0027m going to walk.\" \\n\\n \\n\\n \"Walk! Why! But it\u0027s snowing. And you\u0027ll have to dress for dinner.\" \\n\\n \\n\\n \"I\u0027ve got a little headache. I thought I\u0027d walk. I\u0027ll be home. I\u0027ll be home.\" \\n\\n \\n\\n He slammed the door then, and turned away. He began to walk in the opposite direction from that which led toward the apartment house. The snow felt cool and grateful on his face. It stung his cheeks. Hard and swift and white it came, blinding him. A blizzard off the lake. He plunged through it, head down, hands jammed into his pockets. \\n\\n \\n\\n So. A home girl. Home girl. God, it was funny. She was a selfish, idle, silly, vicious woman. She was nothing. Nothing. It came over him in a sudden blinding crashing blaze of light. The wo[Pg 186]man in 618 who wasn\u0027t married to her man, and who cooked and planned to make him comfortable; the woman in 620 who blindly left her home and her child every day in order to give that child the thing she called advantages—either of these was better than his woman. Honester. Helping someone. Trying to, anyway. Doing a better job than she was. \\n\\n \\n\\n He plunged across the street, blindly, choking a little with the bitterness that had him by the throat. \\n\\n \\n\\n Hey! Watcha!—--A shout rising to a scream. \\n\\n \\n\\n A bump. Numbness. Silence. Nothingness. \\n\\n \\n\\n \"Well, anyway, Cora,\" said the girls in the Crowd, \"you certainly were a wonderful wife to him. You can always comfort yourself with that thought. My! the way you always ran home so\u0027s to be there before he got in.\" \\n\\n \\n\\n \"I know it,\" said Cora, mournfully. \"I always was a home girl. Why, we always had planned we should have a little home of our own some day. He always said that was the right idear—idea.\" \\n\\n \\n\\n Lil wiped her eyes. \"What are you going to do about your new mink coat, Cora?\" \\n\\n \\n\\n Cora brushed her hair away from her forehead with a slow, sad gesture. \"Oh, I don\u0027t know. I\u0027ve hardly thought of such trifling things. The woman next door said she might buy it. Hoyt, her name is. Of course I couldn\u0027t get what we paid for it, though[Pg 187] I\u0027ve hardly had it on. But money\u0027ll count with me now. Ray never did finish that invisible rim he was working on all those years. Wasting his time. Poor Ray.... I thought if she took it, I\u0027d get a caracul, with a black fox collar. After I bought it I heard mink wasn\u0027t so good anyway, this year. Everything\u0027s black. Of course, I\u0027d never have said anything to Raymond about it. I\u0027d just have worn it. I wouldn\u0027t have hurt Ray for the world.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2690/74043.html","bookId":1478,"book":{"id":1478,"title":"Gigolo","description":"简介： Though he rarely heeded its summonscagy boy that he wasthe telephone rang oftenest for Nick. Because of the many native noises of the place, the telephone had a special bell that was a combination buzz and ring. It sounded above the roar of outgoing...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2690","creation":"Aug 1, 2019 12:25:13 AM","modification":"Aug 1, 2019 12:25:13 AM"}}
