{"id":78364,"no":19,"title":"Page 19","content":"I climbed the stairs to the deck instead of going around to the front door, still moving slowly and marvelling at how my legs felt twice their normal weight. When I stepped into the living room I looked around with the wide eyes of someone who has been away for a decade and returns to find everything just as he left it ¡ª Bunter the moose on the wall, the Boston Globe on the couch, a compilation of Tough Stuff crossword puzzles on the end-table, the plate on the counter with the remains of my stir-fry still on it. Looking at these things brought the realization home full force ¡ª I had gone for a walk, leaving all this normal light clutter behind, and had almost died instead. Had almost been murdered.\n I began to shake. I went into the north-wing bathroom, took off my wet clothes, and threw them into the tub ¡ª splat. Then, still shaking, I turned and stared at myself in the mirror over the washbasin. I looked like someone who has been on the losing side in a barroom brawl. One bicep bore a long, clotting gash. A blackish-purple bruise was unfurling what looked like shadowy wings on my left collarbone. There was a bloody furrow on my neck and behind my ear, where the lovely Rogette had caught me with the stone in her ring.\n I took my shaving mirror and used it to check the back of my head. \u0027Can\u0027t you get that through your thick skull?\u0027 my mother used to shout at me and Sid when we were kids, and now I thanked God that Ma had apparently been right about the thickness factor, at least in my case. The spot where Devore had struck me with his cane looked like the cone of a recently extinct volcano. Whitmore\u0027s bull\u0027s-eye had left a red wound that would need stitches if I wanted to avoid a scar. Blood, rusty and thin, stained the nape of my neck all around the hairline. God knew how much had flowed out of that unpleasant-looking red mouth and been washed away by the lake.\n I poured hydrogen peroxide into my cupped palm, steeled myself, and slapped it onto the gash back there like aftershave. The bite was monstrous, and I had to tighten my lips to keep from crying out. When the pain started to fade a little, I soaked cotton balls with more peroxide and cleaned my other wounds.\n I showered, threw on a tee-shirt and a pair of jeans, then went into the hall to phone the County Sheriff. There was no need for directory assistance; the Castle Rock P.D. and County Sheriff\u0027s numbers were on the IN CASE OF EMERGENCY card thumbtacked to the bulletin board, along with numbers for the fire department, the ambulance service, and the 900-number where you could get three answers to that day\u0027s Times crossword puzzle for a buck-fifty.\n I dialed the first three numbers fast, then began to slow down. I got as far as 955-960 before stopping altogether. I stood there in the hall with the phone pressed against my ear, visualizing another headline, this one not in the decorous Times but the rowdy New York Post. NOVELIST TO AGING COMPU-KING: \u0027YOU BIG BULLY!\u0027 Along with side-by-side pictures of me, looking roughly my age, and Max Devore, looking roughly a hundred and six. The Post would have great fun telling its readers how Devore (along with his companion, an elderly lady who might weigh ninety pounds soaking wet) had lumped up a novelist half his age ¡ª a guy who looked, in his photograph, at least, reasonably trim and fit.\n The phone got tired of holding only six of the required seven numbers in its rudimentary brain, double-clicked, and dumped me back to an open line. I took the handset away from my ear, stared at it for a moment, and then set it gently back down in its cradle.\n I\u0027m not a sissy about the sometimes whimsical, sometimes hateful attention of the press, but I\u0027m wary, as I would be around a bad-tempered fur-bearing mammal. America has turned the people who entertain it into weird high-class whores, and the media jeers at any \u0027celeb\u0027 who dares complain about his or her treatment. \u0027Quitcha bitchin!\u0027 cry the newspapers and the TV gossip shows (the tone is one of mingled triumph and indignation).\n \u0027Didja really think we paid ya the big bucks just to sing a song or swing a Louisville Slugger? Wrong, asshole! We pay so we can be amazed when you do it well ¡ª whatever \"it\" happens to be in your particular case ¡ª and also because it\u0027s gratifying when you fuck up. The truth is you\u0027re supplies. If you cease to be amusing, we can always kill you and eat you.\u0027\n They can\u0027t really eat you, of course. They can print pictures of you with your shirt off and say you\u0027re running to fat, they can talk about how much you drink or how many pills you take or snicker about the night you pulled some starlet onto your lap at Spago and tried to stick your tongue in her ear, but they can\u0027t really eat you. So it wasn\u0027t the thought of the Post calling me a crybaby or being a part of Jay Leno\u0027s opening monologue that made me put the phone down; it was the realization that I had no proof. No one had seen us. And, I realized, finding an alibi for himself and his personal assistant would be the easiest thing in the world for Max Devore.\n There was one other thing, too, the capper: imagining the County Sheriff sending out George Footman, aka daddy, to take my statement on how the mean man had knocked li\u0027l Mikey into the lake. How the three of them would laugh later about that!\n I called John Storrow instead, wanting him to tell me I was doing the right thing, the only thing that made any sense. Wanting him to remind me that only desperate men were driven to such desperate lengths (I would ignore, at least for the time being, how the two of them had laughed, as if they were having the time of their lives), and that nothing had changed in regard to Ki Devore ¡ª her grandfather\u0027s custody case still sucked bogwater.\n I got John\u0027s recording machine at home and left a message ¡ª just call Mike Noonan, no emergency, but feel free to call late. Then I tried his office, mindful of the scripture according to John Grisham: young lawyers work until they drop. I listened to the firm\u0027s recording machine, then followed instructions and punched STO on my phone keypad, the first three letters of John\u0027s last name.\n There was a click and he came on the line ¡ª another recorded version, unfortunately. \u0027Hi, this is John Storrow. I\u0027ve gone up to Philly for the weekend to see my mom and dad. I\u0027ll be in the office on Monday; for the rest of the week, I\u0027ll be out on business. From Tuesday to Friday you\u0027ll probably have the most luck trying to reach me at . . . \u0027\n The number he gave began 207-955, which meant Castle Rock. I imagined it was the hotel where he\u0027d stayed before, the nice one up on the View. \u0027Mike Noonan,\u0027 I said. \u0027Call me when you can. I left a message on your apartment machine, too.\u0027\n I went in the kitchen to get a beer, then only stood there in front of the refrigerator, playing with the magnets. Whoremaster, he\u0027d called me. Say there, whoremaster, where\u0027s your whore? A minute later he had offered to save my soul. Quite funny, really. Like an alcoholic offering to take care of your liquor cabinet. He spoke of you with what I think was genuine affection, Mattie had said. Your great-grandfather and his great-grandfather shit in the same pit.\n I left the fridge with all the beer still safe inside, went back to the phone, and called Mattie.\n \u0027Hi,\u0027 said another obviously recorded voice. I was on a roll. \u0027It\u0027s me, but either I\u0027m out or not able to come to the phone right this minute. Leave a message, okay?\u0027 A pause, the mike rustling, a distant whisper, and then Kyra, so loud she almost blew my ear off: \u0027Leave a HAPPY message!\u0027 What followed was laughter from both of them, cut off by the beep.\n \u0027Hi, Mattie, it\u0027s Mike Noonan,\u0027 I said. \u0027I just wanted ¡ª \u0027\n I don\u0027t know how I would have finished that thought, and I didn\u0027t have to. There was a click and then Mattie herself said, \u0027Hello, Mike.\u0027 There was such a difference between this dreary, defeated-sounding voice and the cheerful one on the tape that for a moment I was silenced. Then I asked her what was wrong.\n \u0027Nothing,\u0027 she said, then began to cry. \u0027Everything. I lost my job. Lindy fired me.\u0027\n Firing wasn\u0027t what Lindy had called it, of course. She\u0027d called it \u0027belt-tightening,\u0027 but it was firing, all right, and I knew that if I looked into the funding of the Four Lakes Consolidated Library, I would discover that one of the chief supporters over the years had been Mr. Max Devore. And he\u0027d continue to be one of the chief supporters . . . if, that was, Lindy Briggs played ball.\n \u0027We shouldn\u0027t have talked where she could see us doing it,\u0027 I said, knowing I could have stayed away from the library completely and Mattie would be just as gone. \u0027And we probably should have seen this coming.\u0027\n \u0027John Storrow did see it.\u0027 She was still crying, but making an effort to get it under control. \u0027He said Max Devore would probably want to make sure I was as deep in the corner as he could push me, come the custody hearing. He said Devore would want to make sure I answered \"I\u0027m unemployed, Your Honor\" when the judge asked where I worked. I told John Mrs. Briggs would never do anything so low, especially to a girl who\u0027d given such a brilliant talk on Melville\u0027s \"Bartleby.\" Do you know what he told me?\u0027\n \u0027No.\u0027\n \u0027He said, \"You\u0027re very young.\" I thought that was a patronizing thing to say, but he was right, wasn\u0027t he?\u0027\n \u0027Mattie ¡ª \u0027\n \u0027What am I going to do, Mike? What am I going to do?\u0027 The panic-rat had moved on down to Wasp Hill Road, it sounded like.\n I thought, quite coldly: Why not become my mistress? Your title will be \u0027research assistant,\u0027 a perfectly jake occupation as far as the IRS is concerned, I\u0027ll throw in clothes, a couple of charge cards, a house ¡ª say goodbye to the rustbucket doublewide on Wasp Hill Road ¡ª and a two-week vacation: how does February on Maui sound? Plus Ki\u0027s education, of course, and a hefty cash bonus at the end of the year. I\u0027ll be considerate, too. Considerate and discreet. Once or twice a week, and never until your little girl is fast asleep. All you have to do is say yes and give me a key. All you have to do is slide over when I slide in. All you have to do is let me do what I want ¡ª all through the dark, all through the night, let me touch where I want to touch, let me do what I want to do, never say no, never say stop.\n I closed my eyes. \u0027Mike? Are you there?\u0027\n \u0027Sure,\u0027 I said. I touched the throbbing gash at the back of my head and winced. \u0027You\u0027re going to do just fine, Mattie. You ¡ª \u0027\n \u0027The trailer\u0027s not paid for!\u0027 she nearly wailed. \u0027I have two overdue phone bills and they\u0027re threatening to cut off the service! There\u0027s something wrong with the Jeep\u0027s transmission, and the rear axle, as well! I can pay for Ki\u0027s last week of Vacation Bible School, I guess ¡ª Mrs. Briggs gave me three weeks\u0027 pay in lieu of notice ¡ª but how will I buy her shoes? She outgrows everything so fast . . . there\u0027s holes in all her shorts and most of her g-g-goddam underwear . . . \u0027\n She was starting to weep again.\n \u0027I\u0027m going to take care of you until you get back on your feet,\u0027 I said.\n \u0027No, I can\u0027t let ¡ª \u0027\n \u0027You can. And for Kyra\u0027s sake, you will. Later on, if you still want to, you can pay me back. We\u0027ll keep tabs on every dollar and dime, if you like. But I\u0027m going to take care of you.\u0027 And you\u0027ll never take off your clothes when I\u0027m with you. That\u0027s a promise, and I\u0027m going to keep it.\n \u0027Mike, you don\u0027t have to do this.\u0027\n \u0027Maybe, maybe not. But I am going to do it. You just try and stop me.\u0027 I\u0027d called meaning to tell her what had happened to me ¡ª giving her the humorous version ¡ª but that now seemed like the worst idea in the world. \u0027This custody thing is going to be over before you know it, and if you can\u0027t find anyone brave enough to put you to work down here once it is, I\u0027ll find someone up in Derry who\u0027ll do it. Besides, tell me the truth ¡ª aren\u0027t you starting to feel that it might be time for a change of scenery?\u0027\n She managed a scrap of a laugh. \u0027I guess you could say that.\u0027\n \u0027Heard from John today?\u0027\n \u0027Actually, yes. He\u0027s visiting his parents in Philadelphia but he gave me the number there. I called him.\u0027\n He\u0027d said he was taken with her. Perhaps she was taken with him, as well. I told myself the thorny little tug I felt across my emotions at the idea was only my imagination. Tried to tell myself that, anyway. \u0027What did he say about you losing your job the way you did?\u0027\n \u0027The same things you said. But he didn\u0027t make me feel safe. You do. I don\u0027t know why.\u0027 I did. I was an older man, and that is our chief attraction to young women: we make them feel safe. \u0027He\u0027s coming up again Tuesday morning. I said I\u0027d have lunch with him.\u0027\n Smoothly, not a tremor or hesitation in my voice, I said: \u0027Maybe I could join you.\u0027\n Mattie\u0027s own voice warmed at the suggestion; her ready acceptance made me feel paradoxically guilty. \u0027That would be great! Why don\u0027t I call him and suggest that you both come over here? I could barbecue again. Maybe I\u0027ll keep Ki home from VBS and make it a foursome. She\u0027s hoping you\u0027ll read her another story. She really enjoyed that.\u0027\n \u0027That sounds great,\u0027 I said, and meant it. Adding Kyra made it all seem more natural, less of an intrusion on my part. Also less like a date on theirs. John could not be accused of taking an unethical interest in his client. In the end he\u0027d probably thank me. \u0027I believe Ki might be ready to move on to \"Hansel and Gretel.\" How are you, Mattie? All right?\u0027\n \u0027Much better than I was before you called.\u0027\n \u0027Good. Things are going to be all right.\u0027\n \u0027Promise me.\u0027\n \u0027I think I just did.\u0027\n There was a slight pause. \u0027Are you all right, Mike? You sound a little . . . I don\u0027t know . . . a little strange.\u0027\n \u0027I\u0027m okay,\u0027 I said, and I was, for someone who had been pretty sure he was drowning less than an hour ago. \u0027Can I ask you one question before I go? Because this is driving me crazy.\u0027\n \u0027Of course.\u0027\n \u0027The night we had dinner, you said Devore told you his great-grandfather and mine knew each other. Pretty well, according to him.\u0027\n \u0027He said they shit in the same pit. I thought that was elegant.\u0027\n \u0027Did he say anything else? Think hard.\u0027\n She did, but came up with nothing. I told her to call me if something about that conversation did occur to her, or if she got lonely or scared, or if she started to feel worried about anything. I didn\u0027t like to say too much, but I had already decided I\u0027d have to have a frank talk with John about my latest adventure. It might be prudent to have the private detective from Lewiston George Kennedy, like the actor ¡ª put a man or two on the TR to keep an eye on Mattie and Kyra. Max Devore was mad, just as my caretaker had said. I hadn\u0027t understood then, but I did now. Any time I started to doubt, all I had to do was touch the back of my head.\n I returned to the fridge and once more forgot to open it. My hands went to the magnets instead and again began moving them around, watching as words formed, broke apart, evolved. It was a peculiar kind of writing . . . but it was writing. I could tell by the way I was starting to trance out.\n That half-hypnotized stare is one you cultivate until you can switch it on and off at will . . . at least you can when things are going well. The intuitive part of the mind unlocks itself when you begin work and rises to a height of about six feet (maybe ten on good days). Once there, it simply hovers, sending black-magic messages and bright pictures. For the balance of the day that part is locked to the rest of the machinery and goes pretty much forgotten . . . except on certain occasions when it comes loose on its own and you trance out unexpectedly, your mind making associations which have nothing to do with rational thought and glaring with unexpected images. That is in some ways the strangest part of the creative process. The muses are ghosts, and sometimes they come uninvited.\n My house is haunted.\n Sara Laughs has always been haunted . . . you\u0027ve stirred em up.\n stirred, I wrote on the refrigerator. But it didn\u0027t look right, so I made a circle of fruit and vegetable magnets around it. That was better, much. I stood there for a moment, hands crossed over my chest as I crossed them at my desk when I was stuck for a word or a phrase, then took off stirr and put on haunt, making haunted.\n \u0027It\u0027s haunted in the circle,\u0027 I said, and barely heard the faint chime of Bunter\u0027s bell, as if in agreement.\n I took the letters off, and as I did found myself thinking how odd it was to have a lawyer named Romeo ¡ª\n (romeo went in the circle)\n ¡ª and a detective named George Kennedy.\n (george went up on the fridge)\n I wondered if Kennedy could help me with Andy Drake ¡ª\n (drake on the fridge)\n ¡ª maybe give me some insights. I\u0027d never written about a private detective before and it\u0027s the little stuff ¡ª\n (rake off, leave the d, add etails)\n ¡ª that makes the difference. I turned a 3 on its back and put an I beneath it, making a pitchfork. The devil\u0027s in the details.\n From there I went somewhere else. I don\u0027t know where, exactly, because I was tranced out, that intuitive part of my mind up so high a search-party couldn\u0027t have found it. I stood in front of my fridge and played with the letters, spelling out little pieces of thought without even thinking about them. You mightn\u0027t believe such a thing is possible, but every writer knows it is.\n What brought me back was light splashing across the windows of the foyer. I looked up and saw the shape of a car pulling to a stop behind my Chevrolet. A cramp of terror seized my belly. That was a moment when I would have given everything I owned for a loaded gun. Because it was Footman. Had to be. Devore had called him when he and Whitmore got back to Warrington\u0027s, had told him Noonan refuses to be a good Martian so get over there and fix him.\n When the driver\u0027s door opened and the dome-light in the visitor\u0027s car came on, I breathed a conditional sigh of relief. I didn\u0027t know who it was, but it sure wasn\u0027t \u0027daddy.\u0027 This fellow didn\u0027t look as if he could take care of a housefly with a rolled-up newspaper . . . although, I supposed, there were plenty of people who had made that same mistake about Jeffrey Dahmer.\n Above the fridge was a cluster of aerosol cans, all of them old and probably not ozone-friendly. I didn\u0027t know how Mrs. M. had missed them, but I was pleased she had. I took the first one my hand touched ¡ª Black Flag, excellent choice ¡ª thumbed off the cap, and stuck the can in the left front pocket of my jeans. Then I turned to the drawers on the right of the sink. The top one contained silverware. The second one held what Jo called \u0027kitchenshit\u0027 ¡ª everything from poultry thermometers to those gadgets you stick in corncobs so you don\u0027t burn your fingers off. The third one down held a generous selection of mismatched steak knives. I took one, put it in the right front pocket of my jeans, and went to the door.\n The man on my stoop jumped a little when I turned on the outside light, then blinked through the door at me like a nearsighted rabbit. He was about five-four, skinny, pale. He wore his hair cropped in the sort of cut known as a wiffle in my boyhood days. His eyes were brown. Guarding them was a pair of horn-rimmed glasses with greasy-looking lenses. His little hands hung at his sides. One held the handle of a flat leather case, the other a small white oblong. I didn\u0027t think it was my destiny to be killed by a man with a business card in one hand, so I opened the door.\n The guy smiled, the anxious sort of smile people always seem to wear in Woody Allen movies. He was wearing a Woody Allen outfit too, I saw ¡ª faded plaid shirt a little too short at the wrists, chinos a little too baggy in the crotch. Someone must have told him about the resemblance, I thought. That\u0027s got to be it.\n \u0027Mr. Noonan?\u0027\n \u0027Yes?\u0027\n He handed me the card. NEXT CENTURY REAL ESTATE, it said in raised gold letters. Below this, in more modest black, was my visitor\u0027s name.\n \u0027I\u0027m Richard Osgood,\u0027 he said as if I couldn\u0027t read, and held out his hand. The American male\u0027s need to respond to that gesture in kind is deeply ingrained, but that night I resisted it. He held his little pink paw out a moment longer, then lowered it and wiped the palm nervously against his chinos. \u0027I have a message for you. From Mr. Devore.\u0027\n I waited.\n \u0027May I come in?\u0027\n \u0027No,\u0027 I said.\n He took a step backward, wiped his hand on his pants again, and seemed to gather himself. \u0027I hardly think there\u0027s any need to be rude, Mr. Noonan.\u0027\n I wasn\u0027t being rude. If I\u0027d wanted to be rude, I would have treated him to a faceful of roach-repellent. \u0027Max Devore and his minder tried to drown me in the lake this evening. If my manners seem a little off to you, that\u0027s probably it.\u0027\n Osgood\u0027s look of shock was real, I think. \u0027You must be working too hard on your latest project, Mr. Noonan. Max Devore is going to be eighty-six on his next birthday ¡ª if he makes it, which now seems to be in some doubt. Poor old fella can hardly even walk from his chair to his bed anymore. As for Rogette ¡ª \u0027\n \u0027I see your point,\u0027 I said. \u0027In fact I saw it twenty minutes ago, without any help from you. I hardly believe it myself, and I was there. Give me whatever it is you have for me.\u0027\n \u0027Fine,\u0027 he said in a prissy little \u0027all right, be that way\u0027 voice. He unzipped a pouch on the front of his leather bag and brought out a white envelope, business-sized and sealed. I took it, hoping Osgood couldn\u0027t sense how hard my heart was thumping. Devore moved pretty damned fast for a man who travelled with an oxygen tank. The question was, what kind of move was this?\n \u0027Thanks,\u0027 I said, beginning to close the door. \u0027I\u0027d tip you the price of a drink, but I left my wallet on the dresser.\u0027\n \u0027Wait! You\u0027re supposed to read it and give me an answer.\u0027\n I raised my eyebrows. \u0027I don\u0027t know where Devore got the notion that he could order me around, but I have no intention of allowing his ideas to influence my behavior. Buzz off.\u0027\n His lips turned down, creating deep dimples at the corners of his mouth, and all at once he didn\u0027t look like Woody Allen at all. He looked like a fifty-year-old real-estate broker who had sold his soul to the devil and now couldn\u0027t stand to see anyone yank the boss\u0027s forked tail. \u0027Piece of friendly advice, Mr. Noonan ¡ª you want to watch it. Max Devore is no man to fool around with.\u0027\n \u0027Luckily for me, I\u0027m not fooling around.\u0027\n I closed the door and stood in the foyer, holding the envelope and watching Mr. Next Century Real Estate. He looked pissed off and con-fused ¡ª no one had given him the bum\u0027s rush just lately, I guessed. Maybe it would do him some good. Lend a little perspective to his life. Remind him that, Max Devore or no Max Devore, Richie Osgood would still never stand more than five-feet-seven. Even in cowboy boots.\n \u0027Mr. Devore wants an answer!\u0027 he called through the closed door.\n \u0027I\u0027ll phone,\u0027 I called back, then slowly raised my middle fingers in the double eagle I\u0027d hoped to give Max and Rogette earlier. \u0027In the meantime, perhaps you could convey this.\u0027\n I almost expected him to take off his glasses and rub his eyes. He walked back to his car instead, tossed his case in, then followed it. I watched until he had backed up to the lane and I was sure he was gone. Then I went into the living room and opened the envelope. Inside was a single sheet of paper, faintly scented with the perfume my mother had worn when I was just a kid. White Shoulders, I think it\u0027s called. Across the top ¡ª neat, ladylike, printed in slightly raised letters ¡ª was\n ROGETTE D. WHITMORE\n Below it was this message, written in a slightly shaky feminine hand:\n 8.30 P.M.\n Dear Mr. Noonan,\n Max wishes me to convey how glad he was to meet you! I must echo that sentiment. You are a very amusing and entertaining fellow! We enjoyed your antics ever so much.\n Now to business. M. offers you a very simple deal: if you promise to cease asking questions about him, and if you promise to cease all legal maneuvering ¡ª if you promise to let him rest in peace, so to speak then Mr. Devore promises to cease efforts to gain custody of his granddaughter. If this suits, you need only tell Mr. Osgood \u0027I agree.\u0027 He will carry the message! Max hopes to return to California by private jet very soon ¡ª he has business which can be put off no longer, although he has enjoyed his time here and has found you particularly interesting. He wants me to remind you that custody has its responsibilities, and urges you not to forget he said so.\n Rogette\n P.S. He reminds me that you didn\u0027t answer his question ¡ª does her cunt suck? Max is quite curious on that point.\n R.\n I read this note over a second time, then a third. I started to put it on the table, then read it a fourth time. It was as if I couldn\u0027t get the sense of it. I had to restrain an urge to fly to the telephone and call Mattie at once. It\u0027s over, Mattie, I\u0027d say. Taking your job and dunking me in the lake were the last two shots of the war. He\u0027s giving up.\n No. Not until I was absolutely sure.\n I called Warrington\u0027s instead, where I got my fourth answering machine of the night. Devore and Whitmore hadn\u0027t bothered with anything warm and fuzzy, either; a voice as cold as a motel ice-machine simply told me to leave my message at the sound of the beep.\n \u0027It\u0027s Noonan,\u0027 I said. Before I could go any further there was a click as someone picked up.\n \u0027Did you enjoy your swim?\u0027 Rogette Whitmore asked in a smoky, mocking voice. if I hadn\u0027t seen her in the flesh, I might have imagined a Barbara Stanwyck type at her most coldly attractive, coiled on a red velvet couch in a peach-silk dressing gown, telephone in one hand, ivory cigarette holder in the other.\n \u0027If I\u0027d caught up with you, Ms. Whitmore, I would have made you understand my feelings perfectly.\u0027\n \u0027Oooo,\u0027 she said. \u0027My thighs are a-tingle.\u0027\n \u0027Please spare me the image of your thighs.\u0027\n \u0027Sticks and stones, Mr. Noonan,\u0027 she said. \u0027To what do we owe the pleasure of your call?\u0027\n \u0027I sent Mr. Osgood away without a reply.\u0027\n \u0027Max thought you might. He said, \"Our young whoremaster believes in the value of a personal response. You can tell that just looking at him.\u0027\u0027\n \u0027He gets the uglies when he loses, doesn\u0027t he?\u0027\n \u0027Mr. Devore doesn\u0027t lose.\u0027 Her voice dropped at least forty degrees and all the mocking good humor bailed out on the way down. \u0027He may change his goals, but he doesn\u0027t lose. You were the one who looked like a loser tonight, Mr. Noonan, paddling around and yelling out there in the lake. You were scared, weren\u0027t you?\u0027\n \u0027Yes. Badly.\u0027\n \u0027You were right to be. I wonder if you know how lucky you are?\u0027\n \u0027May I tell you something?\u0027\n \u0027Of course, Mike ¡ª may I call you Mike?\u0027\n \u0027Why don\u0027t you just stick with Mr. Noonan. Now ¡ª are you listening?\u0027\n \u0027With bated breath.\u0027\n \u0027Your boss is old, he\u0027s nutty, and I suspect he\u0027s past the point where he could effectively manage a Yahtzee scorecard, let alone a custody suit. He was whipped a week ago.\u0027\n \u0027Do you have a point?\u0027\n \u0027As a matter of fact I do, so get it right: if either of you ever tries anything remotely like that again, I\u0027ll come after that old fuck and jam his snot-smeared oxygen mask so far up his ass he\u0027ll be able to aerate his lungs from the bottom. And if I see you on The Street, Ms. Whitmore, I\u0027ll use you for a shotput. Do you understand me?\u0027\n I stopped, breathing hard, amazed and also rather disgusted with myself. If you had told me I\u0027d had such a speech in me, I would have scoffed.\n After a long silence I said: \u0027Ms. Whitmore? Still there?\u0027\n \u0027I\u0027m here,\u0027 she said. I wanted her to be furious, but she actually sounded amused. \u0027Who has the uglies now, Mr. Noonan?\u0027\n \u0027I do,\u0027 I said, \u0027and don\u0027t you forget it, you rock-throwing bitch.\u0027\n \u0027What is your answer to Mr. Devore?\u0027\n \u0027We have a deal. I shut up, the lawyers shut up, he gets out of Mattie and Kyra\u0027s life. If, on the other hand, he continues to ¡ª \u0027\n \u0027I know, I know, you\u0027ll bore him and stroke him. I wonder how you\u0027ll feel about all this a week from now, you arrogant, stupid creature?\u0027\n Before I could reply ¡ª it was on the tip of my tongue to tell her that even at her best she still threw like a girl ¡ª she was gone.\n I stood there with the telephone in my hand for a few seconds, then hung it up. Was it a trick? It felt like a trick, but at the same time it didn\u0027t. John needed to know about this. He hadn\u0027t left his parents\u0027 number on his answering machine, but Mattie had it. If I called her back, though, I\u0027d be obligated to tell her what had just happened. It might be a good idea to put off any further calls until tomorrow. To sleep on it.\n I stuck my hand in my pocket and damned near impaled it on the steak knife hiding there. I\u0027d forgotten all about it. I took it out, carried it back into the kitchen, and returned it to the drawer. Next I fished out the aerosol can, turned to put it back on top of the fridge with its elderly brothers, then stopped. Inside the circle of fruit and vegetable magnets was this:\n 19n\n Had I done that myself?. Had I been so far into the zone, so tranced out, that I had put a mini-crossword on the refrigerator without remembering it? And if so, what did it mean?\n Maybe someone else put it up, I thought. One of my invisible roommates.\n \u0027Go down 19n,\u0027 I said, reaching out and touching the letters. A compass heading? Or maybe it meant Go 19 Down. That suggested crosswords again. Sometimes in a puzzle you get a clue which reads simply See 19 Across or See 19 Down. If that was the meaning here, what puzzle was I supposed to check?\n \u0027I could use a little help here,\u0027 I said, but there was no answer ¡ª not from the astral plane, not from inside my own head. I finally got the can of beer I\u0027d been promising myself and took it back to the sofa. I picked up my Tough Stuff crossword book and looked at the puzzle I was currently working. \u0027Liquor Is Quicker,\u0027 it was called, and it was filled with the stupid puns which only crossword addicts find amusing. Tipsy actor? Marion Brandy. Tipsy southern novel? Tequila Mockingbird. Drives the DA to drink? Bourbon of proof. And the definition of Down was Oriental nurse, which every cruciverbalist in the universe knows is amah. Nothing in \u0027Liquor Is Quicker\u0027 connected to what was going on in my life, at least that I could see.\n I thumbed through some of the other puzzles in the book, looking at 19 Downs. Marble worker\u0027s tool (chisel). CNN\u0027s favorite howler, 2 wds (wolfblitzer). Ethanol and dimethyl ether, e.g. (isomers). I tossed the book aside in disgust. Who said it had to be this particular crossword collection, anyway? There were probably fifty others in the house, four or five in the drawer of the very end-table on which my beer can stood. I leaned back on the sofa and closed my eyes.\n I always liked a whore . . . sometimes their place was on my face.\n This is where good pups and vile dogs may walk side-by-side.\n There\u0027s no town drunk here, we all take turns.\n This is where it happened. Ayuh.\n I fell asleep and woke up three hours later with a stiff neck and a terrible throb in the back of my head. Thunder was rumbling thickly far off in the White Mountains, and the house seemed very hot. When I got up from the couch, the backs of my thighs more or less peeled away from the fabric. I shuffled down to the north wing like an old, old man, looked at my wet clothes, thought about taking them into the laundry room, and then decided if I bent over that far, my head might explode.\n \u0027You ghosts take care of it,\u0027 I muttered. \u0027If you can change the pants and the underwear around on the whirligig, you can put my clothes in the hamper.\u0027\n I took three Tylenol and went to bed. At some point I woke a second time and heard the phantom child sobbing.\n \u0027Stop,\u0027 I told it. \u0027Stop it, Ki, no one\u0027s going to take you anywhere. You\u0027re safe.\u0027 Then I went back to sleep again. \n","sourceLink":"https://allnovel.net/bag-of-bones/page-19.html","bookId":2432,"book":{"id":2432,"title":"Bag of Bones","description":"Storyline: \n Four years after the sudden death of his wife, forty-year-old bestselling novelist Mike Noonan is unable to write and plagued by vivid nightmares set at the Maine summerhouse he calls Sara Laughs. Mike reluctantly returns to the lakeside getaway and finds his beloved Yankee town held in the grip of a vindictive millionaire, Max Devore, who is trying to take his three-year-old granddaughter away from her widowed young mother, Mattie. As Mike is drawn into Mattie\u0027s struggle -- and begins to fall in love with her -- he is also drawn into the mystery of Sara Laughs, now the site of ghostly visitations and escalating terrors. What do the forces that have been unleashed here want of Mike Noonan?\n \n","cover":"https://allnovel.net/images/bag-of-bones.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/bag-of-bones.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:07:26 PM"}}
