{"id":78370,"no":26,"title":"Page 26","content":"For men, I think, love is a thing formed of equal parts lust and astonishment. The astonishment part women understand. The lust part they only think they understand. Very few ¡ª perhaps one in twenty ¡ª have any concept of what it really is or how deep it runs. That\u0027s probably just as well for their sleep and peace of mind. And I\u0027m not talking about the lust of satyrs and rapists and molesters; I\u0027m talking about the lust of shoe-clerks and high-school principals.\n Not to mention writers and lawyers.\n We turned into Mattie\u0027s dooryard at ten to eleven, and as I parked my Chevy beside her rusted-out Jeep, the trailer door opened and Mat-tie came out on the top step. I sucked in my breath, and beside me I could hear John sucking in his.\n She was very likely the most beautiful young woman I have ever seen in my life as she stood there in her rose-colored shorts and matching middy top. The shorts were not short enough to be cheap (my mother\u0027s word) but plenty short enough to be provocative. Her top tied in floppy string bows across the shoulders and showed just enough tan to dream on. Her hair hung to her shoulders. She was smiling and waving. I thought, She\u0027s made it ¡ª take her into the country-club dining room now, dressed just as she is, and she shuts everyone else down.\n \u0027Oh Lordy,\u0027 John said. There was a kind of dismayed longing in his voice. \u0027All that and a bag of chips.\u0027\n \u0027Yeah,\u0027 I said. \u0027Put your eyes back in your head, big boy.\u0027\n He made cupping motions with his hands as if doing just that.\n George, meanwhile, had pulled his Altima in next to us.\n \u0027Come on,\u0027 I said, opening my door. \u0027Time to party.\u0027\n \u0027I can\u0027t touch her, Mike,\u0027 John said. \u0027I\u0027ll melt.\u0027\n \u0027Come on, you goof.\u0027\n Mattie came down the steps and past the pot with the tomato plant in it. Ki was behind her, dressed in an outfit similar to her mother\u0027s, only in a shade of dark green. She had the shys again, I saw; she kept one steadying hand on Mattie\u0027s leg and one thumb in her mouth.\n \u0027The guys are here! The guys are here!\u0027 Mattie cried, laughing, and threw herself into my arms. She hugged me tight and kissed the corner of my mouth. I hugged her back and kissed her cheek. Then she moved on to John, read his shirt, patted her hands together in applause, and then hugged him. He hugged back pretty well for a guy who was afraid he might melt, I thought, picking her up off her feet and swinging her around in a circle while she hung onto his neck and laughed.\n \u0027Rich lady, rich lady, rich lady!\u0027 John chanted, then set her down on the cork soles of her white shoes.\n \u0027Free lady, free lady, free lady!\u0027 she chanted back. \u0027The hell with rich!\u0027 Before he could reply, she kissed him firmly on the mouth. His arms rose to slip around her, but she stepped back before they could catch hold. She turned to Rommie and George, who were standing side-by-side and looking like fellows who might want to explain all about the Mormon Church.\n I took a step forward, meaning to do the introductions, but John was taking care of that, and one of his arms managed to accomplish its mission after all ¡ª it circled her waist as he led her forward toward the men.\n Meanwhile a little hand slipped into mine. I looked down and saw Ki looking up at me. Her face was grave and pale and every bit as beautiful as her mother\u0027s. Her blonde hair, freshly washed and shining, was held back with a velvet scrunchy.\n \u0027Guess the fridgeafator people don\u0027t like me now,\u0027 she said. The laughter and insouciance were gone, at least for the moment. She looked on the verge of tears. \u0027My letters all went bye-bye.\u0027\n I picked her up and set her in the crook of my arm as I had on the day I\u0027d met her walking down the middle of Route 68 in her bathing suit. I kissed her forehead and then the tip of her nose. Her skin was perfect silk. \u0027I know they did,\u0027 I said. \u0027I\u0027ll buy you some more.\u0027\n \u0027Promise?\u0027 Doubtful dark blue eyes fixed on mine.\n \u0027Promise. And I\u0027ll teach you special words like \"zygote\" and \"bibulous\". I know lots of special words.\u0027\n \u0027How many?\u0027\n \u0027A hundred and eighty.\u0027\n Thunder rumbled in the west. It didn\u0027t seem louder, but it was more focused, somehow. Ki\u0027s eyes went in that direction, then came back to mine. \u0027I\u0027m scared, Mike.\u0027\n \u0027Scared? Of what?\u0027\n \u0027Ofi don\u0027t know. The lady in Mattie\u0027s dress. The men we saw.\u0027 Then she looked over my shoulder. \u0027Here comes Mommy.\u0027 I have heard actresses deliver the line Not in front of the children in that exact same tone of voice. Kyra wiggled in the circle of my arms. \u0027Land me.\u0027\n I landed her. Mattie, John, Rommie, and George came over to join us. Ki ran to Mattie, who picked her up and then eyed us like a general surveying her troops.\n \u0027Got the beer?\u0027 she asked me.\n \u0027Yessum. A case of Bud and a dozen mixed sodas, as well. Plus lemonade.\u0027\n \u0027Great. Mr. Kennedy ¡ª \u0027\n \u0027George, ma\u0027am.\u0027\n \u0027George, then. And if you call me ma\u0027am again, I\u0027ll punch you in the nose. I\u0027m Mattie. Would you drive down to the Lakeview General\u0027-she pointed to the store on Route 68, about half a mile from us ¡ª \u0027and get some ice?\u0027\n \u0027You bet.\u0027\n \u0027Mr. Bissonette ¡ª \u0027\n \u0027Rommie.\u0027\n \u0027There\u0027s a little garden at the north end of the trailer, Rommie. Can you find a couple of good-looking lettuces?\u0027\n \u0027I think I can handle that.\u0027\n \u0027John, let\u0027s get the meat into the fridge. As for you, Michael . . . \u0027 She pointed to the barbecue. \u0027The briquets are the self-lighting kind ¡ª just drop a match and stand back. Do your duty.\u0027\n \u0027Aye, good lady,\u0027 I said, and dropped to my knees in front of her. That finally got a giggle out of Ki.\n Laughing, Mattie took my hand and pulled me back onto my feet. \u0027Come on, Sir Galahad,\u0027 she said. \u0027It\u0027s going to rain. I want to be safe inside and too stuffed to jump when it does.\u0027\n In the city, parties begin with greetings at the door, gathered-in coats, and those peculiar little air-kisses (when, exactly, did that social oddity begin?). In the country, they begin with chores. You fetch, you carry, you hunt for stuff like barbecue tongs and oven mitts. The hostess drafts a couple of men to move the picnic table, then decides it was actually better where it was and asks them to put it back. And at some point you discover that you\u0027re having fun.\n I piled briquets until they looked approximately like the pyramid on the bag, then touched a match to them. They blazed up satisfyingly and I stood back, wiping my forearm across my forehead. Cool and clear might be coming, but it surely wasn\u0027t in hailing distance yet. The sun had burned through and the day had gone from dull to dazzling, yet in the west black-satin thunderheads continued to stack up. It was as if night had burst a blood-vessel in the sky over there.\n \u0027Mike?\u0027\n I looked around at Kyra. \u0027What, honey?\u0027\n \u0027Will you take care of me?\u0027\n \u0027Yes,\u0027 I said with no hesitation at all.\n For a moment something about my response ¡ª perhaps only the quickness of it ¡ª seemed to trouble her. Then she smiled. \u0027Okay,\u0027 she said. \u0027Look, here comes the ice-man!\u0027\n George was back from the store. He parked and got out. I walked over with Kyra, she holding my hand and swinging it possessively back and forth. Rommie came with us, juggling three heads of lettuce ¡ª I didn\u0027t think he was much of a threat to the guy who had fascinated Ki on the common Saturday night.\n George opened the Altima\u0027s back door and brought out two bags of ice. \u0027The store was closed,\u0027 he said. \u0027Sign said WILL RE-OPEN AT 5 P.M. That seemed a little too long to wait, so I took the ice and put the money through the mail-slot.\u0027\n They\u0027d closed for Royce Merrill\u0027s funeral, of course. Had given up almost a full day\u0027s custom at the height of the tourist season to see the old fellow into the ground. It was sort of touching. I thought it was also sort of creepy.\n \u0027Can I carry some ice?\u0027 Kyra asked.\n \u0027I guess, but don\u0027t frizzicate yourself,\u0027 George said, and carefully put a five-pound bag of ice into Ki\u0027s outstretched arms.\n \u0027Frizzicate,\u0027 Kyra said, giggling. She began walking toward the trailer, where Mattie was just coming out. John was behind her and regarding her with the eyes of a gutshot beagle. \u0027Mommy, look! I\u0027m frizzicating!\u0027\n I took the other bag. \u0027I know the icebox is outside, but don\u0027t they keep a padlock on it?\u0027\n \u0027I am friends with most padlocks,\u0027 George said.\n \u0027Oh. I see.\u0027\n \u0027Mike! Catch!\u0027 John tossed a red Frisbee. It floated toward me, but high. I jumped for it, snagged it, and suddenly Devore was back in my head: What\u0027s wrong with you, Rogette? You never used to throw like a girl Get him!\n I looked down and saw Ki looking up. \u0027Don\u0027t think about sad stuff,\u0027 she said.\n I smiled at her, then flipped her the Frisbee. \u0027Okay, no sad stuff. Go on, sweetheart. Toss it to your mom. Let\u0027s see if you can.\u0027\n She smiled back, turned, and made a quick, accurate flip to her mother ¡ª the toss was so hard that Mattie almost flubbed it. Whatever else Kyra Devore might have been, she was a Frisbee champion in the making.\n Mattie tossed the Frisbee to George, who turned, the tail of his absurd brown suitcoat flaring, and caught it deftly behind his back. Mattie laughed and applauded, the hem of her top flirting with her navel.\n \u0027Showoff!\u0027 John called from the steps.\n \u0027Jealousy is such an ugly emotion,\u0027 George said to Rommie Bissonette, and flipped him the Frisbee. Rommie floated it back to John, but it went wide and bonked off the side of the trailer. As John hurried down the steps to get it, Mattie turned to me. \u0027My boombox is on the coffee-table in the living room, along with a stack of CDs. Most of them are pretty old, but at least it\u0027s music. Will you bring them out?\u0027\n \u0027Sure.\u0027\n I went inside, where it was hot in spite of three strategically placed fans working overtime. I looked at the grim, mass-produced furniture, and at Mattie\u0027s rather noble effort to impart some character: the van Gogh print that should not have looked at home in a trailer kitchenette but did, Edward Hopper\u0027s Nighthawks over the sofa, the tie-dyed curtains that would have made Jo laugh. There was a bravery here that made me sad for her and furious at Max Devore all over again. Dead or not, I wanted to kick his ass.\n I went into the living room and saw the new Mary Higgins Clark on the sofa end-table with a bookmark sticking out of it. Lying beside it in a heap were a couple of little-girl hair ribbons ¡ª something about them looked familiar to me, although I couldn\u0027t remember ever having seen Ki wearing them. I stood there a moment longer, frowning, then grabbed the boombox and CDs and went back outside. \u0027Hey, guys,\u0027 I said. \u0027Let\u0027s rock.\u0027\n I was okay until she danced. I don\u0027t know if it matters to you, but it does to me. I was okay until she danced. After that I was lost.\n We took the Frisbee around to the rear of the house, partly so we wouldn\u0027t piss off any funeral-bound townies with our rowdiness and good cheer, mostly because Mattie\u0027s back yard was a good place to play ¡ª level ground and low grass. After a couple of missed catches, Mattie kicked off her party-shoes, dashed barefoot into the house, and came back in her sneakers. After that she was a lot better.\n We threw the Frisbee, yelled insults at each other, drank beer, laughed a lot. Ki wasn\u0027t much on the catching part, but she had a phenomenal arm for a kid of three and played with gusto. Rommie had set the boombox up on the trailer\u0027s back step, and it spun out a haze of late-eighties and early-nineties music: U2, Tears for Fears, the Eurythmics, Crowded House, A Flock of Seagulls, Ah-Hah, the Bangles, Melissa Etheridge, Huey Lewis and the News. It seemed to me that I knew every song, every riff.\n We sweated and sprinted in the noon light. We watched Mattie\u0027s long, tanned legs flash and listened to the bright runs of Kyra\u0027s laughter. At one point Rommie Bissonette went head over heels, all the change spilling out of his pockets, and John laughed until he had to sit down. Tears rolled from his eyes. Ki ran over and plopped on his defenseless lap. John stopped laughing in a hurry. \u0027Ooofl\u0027 he cried, looking at me with shining, wounded eyes as his bruised balls no doubt tried to climb back inside his body.\n \u0027Kyra Devore!\u0027 Mattie cried, looking at John apprehensively.\n \u0027I taggled my own quartermack,\u0027 Ki said proudly.\n John smiled feebly at her and staggered to his feet. \u0027Yes,\u0027 he said. \u0027You did. And the ref calls fifteen yards for squashing.\u0027\n \u0027Are you okay, man?\u0027 George asked. He looked concerned, but his voice was grinning.\n \u0027I\u0027m fine,\u0027 John said, and spun him the Frisbee. It wobbled feebly across the yard. \u0027Go on, throw. Let\u0027s see whatcha got.\u0027\n The thunder rumbled louder, but the black clouds were all still west of us; the sky overhead remained a harmless humid blue. Birds still sang and crickets hummed in the grass. There was a heat-shimmer over the barbecue, and it would soon be time to slap on John\u0027s New York steaks. The Frisbee still flew, red against the green of the grass and trees, the blue of the sky. I was still in lust, but everything was still all right ¡ª men are in lust all over the world and damned near all of the time, and the icecaps don\u0027t melt. But she danced, and everything changed.\n It was an old Don Henley song, one driven by a really nasty guitar riff.\n \u0027Oh God, I love this one,\u0027 Mattie cried. The Frisbee came to her. She caught it, dropped it, stepped on it as if it were a hot red spot falling on a nightclub stage, and began to shake. She put her hands first behind her neck and then on her hips and then behind her back. She danced standing with the toes of her sneakers on the Frisbee. She danced without moving. She danced as they say in that song ¡ª like a wave on the ocean.\n \u0027The government bugged the men\u0027s room\n in the local disco lounge,\n And all she wants to do is dance, dance . . .\n To keep the boys from selling\n all the weapons they can scrounge,\n And all she wants to do, all she wants to do is dance.\u0027\n Women are sexy when they dance ¡ª incredibly sexy ¡ª but that wasn\u0027t what I reacted to, or how I reacted. The lust I was coping with, but this was more than lust, and not copeable. It was something that sucked the wind out of me and left me feeling utterly at her mercy. In that moment she was the most beautiful thing I had ever seen, not a pretty woman in shorts and a middy top dancing in place on a Frisbee, but Venus revealed. She was everything I had missed during the last four years, when I\u0027d been so badly off I didn\u0027t know I was missing anything. She robbed me of any last defenses I might have had. The age difference didn\u0027t matter. If I looked to people like my tongue was hanging out even when my mouth was shut, then so be it. If I lost my dignity, my pride, my sense of self, then so be it. Four years on my own had taught me there are worse things to lose.\n How long did she stand there, dancing? I don\u0027t know. Probably not long, not even a minute, and then she realized we were looking at her, rapt ¡ª because to some degree they all saw what I saw and felt what I felt. For that minute or however long it was, I don\u0027t think any of us used much oxygen.\n She stepped off the Frisbee, laughing and blushing at the same time, confused but not really uncomfortable. \u0027I\u0027m sorry,\u0027 she said. \u0027I just . . . I love that song.\u0027\n \u0027All she wants to do is dance,\u0027 Rommie said.\n \u0027Yes, sometimes that\u0027s all she wants,\u0027 Mattie said, and blushed harder than ever. \u0027Excuse me, I have to use the facility.\u0027 She tossed me the Frisbee and then dashed for the trailer.\n I took a deep breath, trying to steady myself back to reality, and saw John doing the same thing. George Kennedy was wearing a mildly stunned expression, as if someone had fed him a light sedative and it was finally taking effect.\n Thunder rumbled. This time it did sound closer.\n I skimmed the Frisbee to Rommie. \u0027What do you think?\u0027\n \u0027I think I\u0027m in love,\u0027 he said, and then seemed to give himself a small mental shake ¡ª it was a thing you could see in his eyes. \u0027I also think it\u0027s time we got going on those steaks if we\u0027re going to eat outside. Want to help me?\u0027\n \u0027Sure.\u0027\n \u0027I will, too,\u0027 John said.\n We walked back to the trailer, leaving George and Kyra to play toss. Kyra was asking George if he had ever caught any crinimals. In the kitchen, Mattie was standing beside the open fridge and stacking steaks on a platter. \u0027Thank God you guys came in. I was on the point of giving up and gobbling one of these just the way it is. They\u0027re the most beautiful things I ever saw.\u0027\n \u0027You\u0027re the most beautiful thing I ever saw,\u0027 John said. He was being totally sincere, but the smile she gave him was distracted and a little bemused. I made a mental note to myself: never compliment a woman on her beauty when she has a couple of raw steaks in her hands. It just doesn\u0027t turn the windmill somehow.\n \u0027How are you at barbecuing meat?\u0027 she asked me. \u0027Tell the truth, because these are way too good to mess up.\u0027\n \u0027I can hold my own.\u0027\n \u0027Okay, you\u0027re hired. John, you\u0027re assisting. Rommie, help me do salads.\u0027\n \u0027My pleasure.\u0027\n George and Ki had come around to the front of the trailer and were now sitting in lawn-chairs like a couple of old cronies at their London club. George was telling Ki how he had shot it out with Rolfe Nedeau and the Real Bad Gang on Lisbon Street in 1993.\n \u0027George, what\u0027s happening to your nose?\u0027 John asked. \u0027It\u0027s getting so long.\u0027\n \u0027Do you mind?\u0027 George asked. \u0027I\u0027m having a conversation here.\u0027\n \u0027Mr. Kennedy has caught lots of crooked crinimals,\u0027 Kyra said. \u0027He caught the Real Bad Gang and put them in Supermax.\u0027\n \u0027Yes,\u0027 I said. \u0027Mr. Kennedy also won an Academy Award for acting in a movie called Cool Hand Luke.\u0027\n \u0027That\u0027s absolutely correct,\u0027 George said. He raised his right hand and crossed the two fingers. \u0027Me and Paul Newman. Just like that.\u0027\n \u0027We have his pusgetti sauce,\u0027 Ki said gravely, and that got John laughing again. It didn\u0027t hit me the same way, but laughter is catching; just watching John was enough to break me up after a few seconds. We were howling like a couple of fools as we slapped the steaks on the grill. It\u0027s a wonder we didn\u0027t burn our hands off.\n \u0027Why are they laughing?\u0027 Ki asked George.\n \u0027Because they\u0027re foolish men with little tiny brains,\u0027 George said. \u0027Now listen, Ki ¡ª I got them all except for the Human Headcase. He jumped into his car and I jumped into mine. The details of that chase are nothing for a little girl to hear ¡ª \u0027\n George regaled her with them anyway while John and I stood grinning at each other across Mattie\u0027s barbecue. \u0027This is great, isn\u0027t it?\u0027 John said, and I nodded.\n Mattie came out with corn wrapped in aluminum foil, followed by Rommie, who had a large salad bowl clasped in his arms and negotiated the steps carefully, trying to peer over the top of the bowl as he made his way down them.\n We sat at the picnic table, George and Rommie on one side, John and I flanking Mattie on the other. Ki sat at the head, perched on a stack of old magazines in a lawn-chair. Mattie tied a dishtowel around her neck, an indignity Ki submitted to only because (a) she was wearing new clothes, and (b) a dishtowel wasn\u0027t a baby-bib, at least technically speaking.\n We ate hugely ¡ª salad, steak (and John was right, it really was the best I\u0027d ever had), roasted corn on the cob, \u0027strewberry snortcake\u0027 for dessert. By the time we\u0027d gotten around to the snortcake, the thunderheads were noticeably closer and there was a hot, jerky breeze blowing around the yard.\n \u0027Mattie, if I never eat a meal as good as this one again, I won\u0027t be surprised,\u0027 Rommie said. \u0027Thanks ever so much for having me.\u0027\n \u0027Thank you,\u0027 she said. There were tears standing in her eyes. She took my hand on one side and John\u0027s on the other. She squeezed both. \u0027Thank you all. If you knew what things were like for Ki and me before this last week . . . \u0027 She shook her head, gave John and me a final squeeze, and let go. \u0027But that\u0027s over.\u0027\n \u0027Look at the baby,\u0027 George said, amused.\n Ki had slumped back in her lawn-chair and was looking at us with glazing eyes. Most of her hair had come out of the scrunchy and lay in clumps against her cheeks. There was a dab of whipped cream on her nose and a single yellow kernel of corn sitting in the middle of her chin.\n \u0027I threw the Frisbee six fousan times,\u0027 Kyra said. She spoke in a distant, declamatory tone. \u0027I tired.\u0027\n Mattie started to get up. I put my hand on her arm. \u0027Let me?\u0027\n She nodded, smiling. \u0027If you want.\u0027\n I picked Kyra up and carried her around to the steps. Thunder rumbled again, a long, low roll that sounded like the snarl of a huge dog. I looked up at the encroaching clouds, and as I did, movement caught my eye. It was an old blue car heading west on Wasp Hill Road toward the lake. The only reason I noticed it was that it was wearing one of those stupid bumper-stickers from the Village Cafe: HORN BROKEN ¡ª WATCH FOR FINGER.\n I carried Ki up the steps and through the door, turning her so I wouldn\u0027t bump her head. \u0027Take care of me,\u0027 she said in her sleep. There was a sadness in her voice that chilled me. It was as if she knew she was asking the impossible. \u0027Take care of me, I\u0027m little, Mama says I\u0027m a little guy.\u0027\n \u0027I\u0027ll take care of you,\u0027 I said, and kissed that silky place between her eyes again. \u0027Don\u0027t worry, Ki, go to sleep.\u0027\n I carried her to her room and put her on her bed. By then she was totally conked out. I wiped the cream off her nose and picked the corn-kernel off her chin. I glanced at my watch and saw it was ten \u0027til two. They would be gathering at Grace Baptist by now. Bill Dean was wearing a gray tie. Buddy Jellison had a hat on. He was standing behind the church with some other men who were smoking before going inside.\n I turned. Mattie was in the doorway. \u0027Mike,\u0027 she said. \u0027Come here, please.\u0027\n I went to her. There was no cloth between her waist and my hands this time. Her skin was warm, and as silky as her daughter\u0027s. She looked up at me, her lips parted. Her hips pressed forward, and when she felt what was hard down there, she pressed harder against it.\n \u0027Mike,\u0027 she said again.\n I closed my eyes. I felt like someone who has just come to the doorway of a brightly lit room full of people laughing and talking. And dancing. Because sometimes that is all we want to do.\n I want to come in, I thought. That\u0027s what I want to do, all I want to do. Let me do what I want. Let me ¡ª\n I realized I was saying it aloud, whispering it rapidly into her ear as I held her with my hands going up and down her back, my fingertips ridging her spine, touching her shoulderblades, then coming around in front to cup her small breasts.\n \u0027Yes,\u0027 she said. \u0027What we both want. Yes. That\u0027s fine.\u0027\n Slowly, she reached up with her thumbs and wiped the wet places from under my eyes. I drew back from her. \u0027The key ¡ª \u0027\n She smiled a little. \u0027You know where it is.\u0027\n \u0027I\u0027ll come tonight.\u0027\n \u0027Good.\u0027\n \u0027I\u0027ve been . . . \u0027 I had to clear my throat. I looked at Kyra, who was deeply asleep. \u0027I\u0027ve been lonely. I don\u0027t think I knew it, but I have been.\u0027\n \u0027Me too. And I knew it for both of us. Kiss, please.\u0027\n I kissed her. I think our tongues touched, but I\u0027m not sure. What I remember most clearly is the liveness of her. She was like a dreidel lightly spinning in my arms.\n \u0027Hey!\u0027 John called from outside, and we sprang apart. \u0027You guys want to give us a little help? It\u0027s gonna rain!\u0027\n \u0027Thanks for finally making up your mind,\u0027 she said to me in a low voice. She turned and hurried back up the doublewide\u0027s narrow corridor. The next time she spoke to me, I don\u0027t think she knew who she was talking to, or where she was. The next time she spoke to me, she was dying.\n \u0027Don\u0027t wake the baby,\u0027 I heard her tell John, and his response: \u0027Oh, sorry, sorry.\u0027\n I stood where I was a moment longer, getting my breath, then slipped into the bathroom and splashed cold water on my face. I remember seeing a blue plastic whale in the bathtub as I turned to take a towel off the rack. I remember thinking that it probably blew bubbles out of its spout-hole, and I even remember having a momentary glimmer of an idea ¡ª a children\u0027s story about a spouting whale. Would you call him Willie? Nah, too obvious. Wilhelm, now ¡ª that had a fine round ring to it, simultaneously grand and amusing. Wilhelm the Spouting Whale.\n I remember the bang of thunder from overhead. I remember how happy I was, with the decision finally made and the night to look forward to. I remember the murmur of men\u0027s voices and the murmur of Mattie\u0027s response as she told them where to put the stuff. Then I heard all of them going back out again.\n I looked down at myself and saw a certain lump was subsiding. I remember thinking there was nothing so absurd-looking as a sexually excited man and knew I\u0027d had this same thought before, perhaps in a dream. I left the bathroom, checked on Kyra again ¡ª rolled over on her side, fast asleep ¡ª and then went down the hall. I had just reached the living room when gunfire erupted outside. I never confused the sound with thunder. There was a moment when my mind fumbled toward the idea of backfires ¡ª some kid\u0027s hotrod ¡ª and then I knew. Part of me had been expecting something to happen . . . but it had been expecting ghosts rather than gunfire. A fatal lapse.\n It was the rapid pah! pah! pah! of an auto-fire weapon ¡ª a Glock nine-millimeter, as it turned out. Mattie screamed ¡ª a high, drilling scream that froze my blood. I heard John cry out in pain and George Kennedy bellow, \u0027Down, down! For the love of Christ, get her down!\u0027\n Something hit the trailer like a hard spatter of hail ¡ª a rattle of punching sounds running from west to east. Something split the air in front of my eyes ¡ª I heard it. There was an almost-musical sproing sound, like a snapping guitar string. On the kitchen table, the salad bowl one of them had just brought in shattered.\n I ran for the door and nearly dived down the cement-block steps. I saw the barbecue overturned, with the glowing coals already setting patches of the scant front-yard grass on fire. I saw Rommie Bissonette sitting with his legs outstretched, looking stupidly down at his ankle, which was soaked with blood. Mattie was on her hands and knees by the barbecue with her hair hanging in her face ¡ª it was as if she meant to sweep up the hot coals before they could cause some real trouble. John staggered toward me, holding out a hand. The arm above it was soaked with blood.\n And I saw the car I\u0027d seen before ¡ª the nondescript sedan with the joke sticker on it. It had gone up the road ¡ª the men inside making that first pass to check us out ¡ª then turned around and come back. The shooter was still leaning out the front passenger window. I could see the stubby smoking weapon in his hands. It had a wire stock. His features were a blue blank broken only by huge gaping eyesockets ¡ª a ski-mask.\n Overhead, thunder gave a long, awakening roar.\n George Kennedy was walking toward the car, not hurrying, kicking hot spilled coals out of his way as he went, not bothering about the dark-red stain that was spreading on the right thigh of his pants, reaching behind himself, not hurrying even when the shooter pulled back in and shouted \u0027Go go go!\u0027 at the driver, who was also wearing a blue mask, George not hurrying, no, not hurrying a bit, and even before I saw the pistol in his hand, I knew why he had never taken off his absurd Pa Kettle suit jacket, why he had even played Frisbee in it.\n The blue car (it turned out to be a 1987 Ford registered to Mrs. Sonia Belliveau of Auburn and reported stolen the day before) had pulled over onto the shoulder and had never really stopped rolling. Now it accelerated, spewing dry brown dust out from under its rear tires, fishtailing, knocking Mattie\u0027s RFD box off its post and sending it flying into the road.\n George still didn\u0027t hurry. He brought his hands together, holding his gun with his right and steadying with his left. He squeezed off five deliberate shots. The first two went into the trunk ¡ª I saw the holes appear. The third blew in the back window of the departing Ford, and I heard someone shout in pain. The fourth went I don\u0027t know where. The fifth blew the left rear tire. The Ford veered to that side. The driver almost brought it back, then lost it completely. The car ploughed into the ditch thirty yards below Mattie\u0027s trailer and rolled over on its side. There was a whumpf! and the rear end was engulfed in flames. One of George\u0027s shots must have hit the gas-tank. The shooter began struggling to get out through the passenger window.\n \u0027Ki . . . get Ki . . . away . . . \u0027 A hoarse, whispering voice.\n Mattie was crawling toward me. One side of her head ¡ª the right side ¡ª still looked all right, but the left side was a ruin. One dazed blue eye peered out from between clumps of bloody hair. Skull-fragments littered her tanned shoulder like bits of broken crockery. How I would love to tell you I don\u0027t remember any of this, how I would love to have someone else tell you that Michael Noonan died before he saw that, but I cannot. Alas is the word for it in the crossword puzzles, a four-letter word meaning to express great sorrow.\n \u0027Ki . . . Mike, get Ki . . . \u0027\n I knelt and put my arms around her. She struggled against me. She was young and strong, and even with the gray matter of her brain bulging through the broken wall of her skull she struggled against me, crying for her daughter, wanting to reach her and protect her and get her to safety.\n \u0027Mattie, it\u0027s all right,\u0027 I said. Down at the Grace Baptist Church, at the far end of the zone I was in, they were singing \u0027Blessed Assurance\u0027 . . . but most of their eyes were as blank as the eye now peering at me through the tangle of bloody hair. \u0027Mattie, stop, rest, it\u0027s all right.\u0027\n \u0027Ki . . . get Ki . . . don\u0027t let them . . . \u0027\n \u0027They won\u0027t hurt her, Mattie, I promise.\u0027\n She slid against me, slippery as a fish, and screamed her daughter\u0027s name, holding out her bloody hands toward the trailer. The rose-colored shorts and top had gone bright red. Blood spattered the grass as she thrashed and pulled. From down the hill there was a guttural explosion as the Ford\u0027s gas-tank exploded. Black smoke rose toward a black sky. Thunder roared long and loud, as if the sky were saying You want noise? Yeah? I\u0027ll give you noise.\n \u0027Say Mattie\u0027s all right, Mike!\u0027 John cried in a wavering voice. \u0027Oh for God\u0027s sake say she\u0027s ¡ª \u0027\n He dropped to his knees beside me, his eyes rolling up until nothing showed but the whites. He reached for me, grabbed my shoulder, then tore damned near half my shirt off as he lost his battle to stay conscious and fell on his side next to Mattie. A curd of white goo bubbled from one corner of his mouth. Twelve feet away, near the overturned barbecue, Rommie was trying to get on his feet, his teeth clenched in pain. George was standing in the middle of Wasp Hill Road, reloading his gun from a pouch he\u0027d apparently had in his coat pocket and watching as the shooter worked to get clear of the overturned car before it was engulfed. The entire right leg of George\u0027s pants was red now. He may live but he\u0027ll never wear that suit again, I thought.\n I held Mattie. I put my face down to hers, put my mouth to the ear that was still there and said: \u0027Kyra\u0027s okay. She\u0027s sleeping. She\u0027s fine, I promise.\u0027\n Mattie seemed to understand. She stopped straining against me and collapsed to the grass, trembling all over. \u0027Ki . . . Ki . . . \u0027 This was the last of her talking on earth. One of her hands reached out blindly, groped at a tuft of grass, and yanked it out.\n \u0027Over here,\u0027 I heard George saying. \u0027Get over here, motherfuck, don\u0027t you even think about turning your back on me.\u0027\n \u0027How bad is she?\u0027 Rommie asked, hobbling over. His face was as white as paper. And before I could reply: \u0027Oh Jesus. Holy Mary Mother of God, pray for us sinners now and at the hour of our death. Blessed be the fruit of thy womb Jesus. Oh Mary born without sin, pray for us who have recourse to Thee. Oh no, oh Mike, no.\u0027 He began again, this time lapsing into Lewiston street-French, what the old folks call La Parle.\n \u0027Quit it,\u0027 I said, and he did. It was as if he had only been waiting to be told. \u0027Go inside and check on Kyra. Can you?\u0027\n \u0027Yes.\u0027 He started toward the trailer, holding his leg and lurching along. With each lurch he gave a high yip of pain, but somehow he kept going. I could smell burning tufts of grass. I could smell electric rain on a rising wind. And under my hands I could feel the light spin of the dreidel slowing down as she went.\n I turned her over, held her in my arms, and rocked her back and forth. At Grace Baptist the minister was now reading Psalm 139 for Royce: If I say, Surely the darkness shall cover me, even the night shall be light. The minister was reading and the Martians were listening. I rocked her back and forth in my arms under the black thunderheads. I was supposed to come to her that night, use the key under the pot and come to her. She had danced with the toes of her white sneakers on the red Frisbee, had danced like a wave on the ocean, and now she was dying in my arms while the grass burned in little clumps and the man who had fancied her as much as I had lay unconscious beside her, his right arm painted red from the short sleeve of his WE ARE THE CHAMPIONS tee-shirt all the way down to his bony, freckled wrist.\n \u0027Mattie,\u0027 I said. \u0027Mattie, Mattie, Mattie.\u0027 I rocked her and smoothed my hand across her forehead, which on the right side was miraculously unsplattered by the blood that had drenched her. Her hair fell over the ruined left side of her face. \u0027Mattie,\u0027 I said. \u0027Mattie, Mattie, oh Mattie.\u0027\n Lightning flashed ¡ª the first stroke I had seen. It lit the western sky in a bright blue arc. Mattie trembled strongly in my arms ¡ª all the way from neck to toes she trembled. Her lips pressed together. Her brow furrowed, as if in concentration. Her hand came up and seemed to grab for the back of my neck, as a person falling from a cliff may grasp blindly at anything to hold on just a little longer. Then it fell away and lay limply on the grass, palm up. She trembled once more ¡ª the whole delicate weight of her trembled in my arms ¡ª and then she was still. \n","sourceLink":"https://allnovel.net/bag-of-bones/page-26.html","bookId":2432,"book":{"id":2432,"title":"Bag of Bones","description":"Storyline: \n Four years after the sudden death of his wife, forty-year-old bestselling novelist Mike Noonan is unable to write and plagued by vivid nightmares set at the Maine summerhouse he calls Sara Laughs. Mike reluctantly returns to the lakeside getaway and finds his beloved Yankee town held in the grip of a vindictive millionaire, Max Devore, who is trying to take his three-year-old granddaughter away from her widowed young mother, Mattie. As Mike is drawn into Mattie\u0027s struggle -- and begins to fall in love with her -- he is also drawn into the mystery of Sara Laughs, now the site of ghostly visitations and escalating terrors. What do the forces that have been unleashed here want of Mike Noonan?\n \n","cover":"https://allnovel.net/images/bag-of-bones.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/bag-of-bones.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:07:26 PM"}}
