{"id":78371,"no":27,"title":"Page 27","content":"After that I was mostly in the zone. I came out a few times ¡ª when that scratched-out scrap of genealogy fell from inside one of my old steno books, for instance ¡ª but those interludes were brief. In a way it was like my dream of Mattie, Jo, and Sara; in a way it was like the terrible fever I\u0027d had as a child, when I\u0027d almost died of the measles; mostly it was like nothing but itself. It was just the zone. I was feeling it. I wish to God I hadn\u0027t been.\\n\\n George came over, herding the man in the blue mask ahead of him. George was limping now, and badly. I could smell hot oil and gasoline and burning tires. \u0027Is she dead?\u0027 George asked. \u0027Mattie?\u0027\\n\\n \u0027Yes.\u0027\\n\\n \u0027John?\u0027\\n\\n \u0027Don\u0027t know,\u0027 I said, and then John twitched and groaned. He was alive, but there was a lot of blood.\\n\\n \u0027Mike, listen,\u0027 George began, but before he could say more, a terrible liquid screaming began from the burning car in the ditch. It was the driver. He was cooking in there. The shooter started to turn that way, and George raised his gun. \u0027Move and I\u0027ll kill you.\u0027\\n\\n \u0027You can\u0027t let him die like that,\u0027 the shooter said from behind his mask. \u0027You couldn\u0027t let a dog die like that.\u0027\\n\\n \u0027He\u0027s dead already,\u0027 George said. \u0027You couldn\u0027t get within ten feet of that car unless you were in an asbestos suit.\u0027 He reeled on his feet. His face was as white as the spot of whipped cream I\u0027d wiped off the end of Ki\u0027s nose. The shooter made as if to go for him and George brought the gun up higher. \u0027The next time you move, don\u0027t stop,\u0027 George said, \u0027because I won\u0027t. Guaranteed. Now take that mask off.\u0027\\n\\n \u0027No.\u0027\\n\\n \u0027I\u0027m done fucking with you, Jesse. Say hello to God.\u0027 George pulled back the hammer of his revolver.\\n\\n The shooter said, \u0027Jesus Christ,\u0027 and yanked off his mask. It was George Footman. Not much surprise there. From behind him, the driver gave one more shriek from within the Ford fireball and then was silent. Smoke rose in black billows. More thunder roared.\\n\\n \u0027Mike, go inside and find something to tie him with,\u0027 George Kennedy said. \u0027I can hold him another minute ¡ª two, if I have to ¡ª but I\u0027m bleeding like a stuck pig. Look for strapping tape. That shit would hold Houdini.\u0027\\n\\n Footman stood where he was, looking from Kennedy to me and back to Kennedy again. Then he peered down at Highway 68, which was eerily deserted. Or perhaps it wasn\u0027t so eerie, at that ¡ª the coming storms had been well forecast. The tourists and summer folk would be under cover. As for the locals . . .\\n\\n The locals were . . . sort of listening. That was at least close. The minister was speaking about Royce Merrill, a life which had been long and fruitful, a man who had served his country in peace and in war, but the old-timers weren\u0027t listening to him. They were listening to us, the way they had once gathered around the pickle barrel at the Lakeview General and listened to prizefights on the radio.\\n\\n Bill Dean was holding Yvette\u0027s wrist so tightly his fingernails were white. He was hurting her . . . but she wasn\u0027t complaining. She wanted him to hold onto her. Why?\\n\\n \u0027Mike!\u0027 George\u0027s voice was perceptibly weaker. \u0027Please, man, help me. This guy is dangerous.\u0027\\n\\n \u0027Let me go,\u0027 Footman said. \u0027You\u0027d better, don\u0027t you think?\u0027\\n\\n \u0027In your wettest dreams, motherfuck,\u0027 George said.\\n\\n I got up, went past the pot with the key underneath, went up the cement-block steps. Lightning exploded across the sky, followed by a bellow of thunder.\\n\\n Inside, Rommie was sitting in a chair at the kitchen table. His face was even whiter than George\u0027s. \u0027Kid\u0027s okay,\u0027 he said, forcing the words. \u0027But she looks like waking up . . . I can\u0027t walk anymore. My ankle\u0027s totally fucked.\u0027\\n\\n I moved for the telephone.\\n\\n \u0027Don\u0027t bother,\u0027 Rommie said. His voice was harsh and trembling. \u0027Tried it. Dead. Storm must already have hit some of the other towns. Killed some of the equipment. Christ, I never had anything hurt like this in my life.\u0027\\n\\n I went to the drawers in the kitchen and began yanking them open one by one, looking for strapping tape, looking for clothesline, looking for any damned thing. If Kennedy passed out from blood-loss while I was in here, the other George would take his gun, kill him, and then kill John as he lay unconscious on the smoldering grass. With them taken care of, he\u0027d come in here and shoot Rommie and me. He\u0027d finish with Kyra.\\n\\n \u0027No he won\u0027t,\u0027 I said. \u0027He\u0027ll leave her alive.\u0027\\n\\n And that might be even worse.\\n\\n Silverware in the first drawer. Sandwich bags, garbage bags, and neatly banded stacks of grocery-store coupons in the second. Oven mitts and potholders in the third ¡ª\\n\\n \u0027Mike, where\u0027s my Mattie?\u0027\\n\\n I turned, as guilty as a man who has been caught mixing illegal drugs. Kyra stood at the living-room end of the hall with her hair falling around her sleep-flushed cheeks and her scrunchy hung over one wrist like a bracelet. Her eyes were wide and panicky. It wasn\u0027t the shots that had awakened her, probably not even her mother\u0027s scream. I had wakened her. My thoughts had wakened her.\\n\\n In the instant I realized it I tried to shield them somehow, but I was too late. She had read me about Devore well enough to tell me not to think about sad stuff, and now she read what had happened to her mother before I could keep her out of my mind.\\n\\n Her mouth dropped open. Her eyes widened. She shrieked as if her hand had been caught in a vise and ran for the door.\\n\\n \u0027No, Kyra, no!\u0027 I sprinted across the kitchen, almost tripping over Rommie (he looked at me with the dim incomprehension of someone who is no longer completely conscious), and grabbed her just in time. As I did, I saw Buddy Jellison leaving Grace Baptist by a side door. Two of the men he had been smoking with went with him. Now I understood why Bill was holding so tightly to Yvette, and loved him for it ¡ª loved both of them. Something wanted him to go with Buddy and the others . . . but Bill wasn\u0027t going.\\n\\n Kyra struggled in my arms, making big convulsive thrusts at the door, gasping in breath and then screaming it out again. \u0027Let me go, want to see Mommy, let me go, want to see Mommy, let me go ¡ª \u0027\\n\\n I called her name with the only voice I knew she would really hear, the one I could use only with her. She relaxed in my arms little by little, and turned to me. Her eyes were huge and confused and shining with tears. She looked at me a moment longer and then seemed to understand that she mustn\u0027t go out. I put her down. She just stood there a moment, then backed up until her bottom was against the dishwasher. She slid down its smooth white front to the floor. Then she began to wail ¡ª the most awful sounds of grief I have ever heard. She understood completely, you see. I had to show her enough to keep her inside, I had to . . . and because we were in the zone together, I could.\\n\\n Buddy and his friends were in a pickup truck headed this way. BAMM CONSTRUCTION, it said on the side.\\n\\n \u0027Mike!\u0027 George cried. He sounded panicky. \u0027You got to hurry!\u0027\\n\\n \u0027Hold on!\u0027 I called back. \u0027Hold on, George!\u0027\\n\\n Mattie and the others had started stacking picnic things beside the sink, but I\u0027m almost positive that the stretch of Formica counter above the drawers had been clean and bare when I hurried after Kyra. Not now. The yellow sugar cannister had been overturned. Written in the spilled sugar was this:\\n\\n \u0027No shit,\u0027 I muttered, and checked the remaining drawers. No tape, no rope. Not even a lousy set of handcuffs, and in most well-equipped kitchens you can count on finding three or four. Then I had an idea and looked in the cabinet under the sink. When I went back out, our George was swaying on his feet and Footman was looking at him with a kind of predatory concentration.\\n\\n \u0027Did you get some tape?\u0027 George Kennedy asked.\\n\\n \u0027No, something better,\u0027 I said. \u0027Tell me, Footman, who actually paid you? Devore or Whitmore? Or don\u0027t you know?\u0027\\n\\n \u0027Fuck you,\u0027 he said.\\n\\n I had my right hand behind my back. Now I pointed down the hill with my left one and endeavored to look surprised. \u0027What the hell\u0027s Osgood doing? Tell him to go away!\u0027\\n\\n Footman looked in that direction ¡ª it was instinctive ¡ª and I hit him in the back of the head with the Craftsman hammer I\u0027d found in the toolbox under Mattie\u0027s sink. The sound was horrible, the spray of blood erupting from the flying hair was horrible, but worst of all was the feeling of the skull giving way ¡ª a spongy collapse that came right up the handle and into my fingers. He went down like a sandbag, and I dropped the hammer, gagging.\\n\\n \u0027Okay,\u0027 George said. \u0027A little ugly, but probably the best thing you could have done under . . . under the . . . \u0027\\n\\n He didn\u0027t go down like Footman ¡ª it was slower and more controlled, almost graceful ¡ª but he was just as out. I picked up the revolver, looked at it, then threw it into the woods across the road. A gun was nothing for me to have right now; it could only get me into more trouble.\\n\\n A couple of other men had also left the church; a carful of ladies in black dresses and veils, as well. I had to hurry on even faster. I unbuckled George\u0027s pants and pulled them down. The bullet which had taken him in the leg had torn into his thigh, but the wound looked as if it was clotting. John\u0027s upper arm was a different story ¡ª it was still pumping out blood in frightening quantities. I yanked his belt free and cinched it around his arm as tightly as I could. Then I slapped him across the face. His eyes opened and stared at me with a bleary lack of recognition.\\n\\n \u0027Open your mouth, John!\u0027 He only stared at me. I leaned down until our noses were almost touching and screamed, \u0027OPEN YOUR MOUTH! DO IT NOW!\u0027 He opened it like a kid when the nurse tells him just say aahh. I stuck the end of the belt between his teeth. \u0027Close!\u0027 He closed. \u0027Now hold it,\u0027 I said. \u0027Even if you pass out, hold it.\u0027\\n\\n I didn\u0027t have time to see if he was paying attention. I got to my feet and looked up as the whole world went glare-blue. For a second it was like being inside a neon sign. There was a black suspended river up there, roiling and coiling like a basket of snakes. I had never seen such a baleful sky.\\n\\n I dashed up the cement-block steps and into the trailer again. Rom-mie had slumped forward onto the table with his face in his folded arms. He would have looked like a kindergartner taking a timeout if not for the broken salad bowl and the bits of lettuce in his hair. Kyra still sat with her back to the dishwasher, weeping hysterically.\\n\\n I picked her up and realized that she had wet herself. \u0027We have to go now, Ki.\u0027\\n\\n \u0027I want Mattie! I want Mommy! I want my Mattie, make her stop being hurt! Make her stop being dead!\u0027\\n\\n I hurried across the trailer. On the way to the door I passed the end-table with the Mary Higgins Clark novel on it. I noticed the tangle of hair ribbons again ¡ª ribbons perhaps tried on before the party and then discarded in favor of the scrunchy. They were white with bright red edges. Pretty. I picked them up without stopping, stuffed them into a pants pocket, then switched Ki to my other arm.\\n\\n \u0027I want Mattie! I want Mommy! Make her come back!\u0027 She swatted at me, trying to make me stop, then began to buck and kick in my arms again. She drummed her fists on the side of my head. \u0027Put me down! Land me! Land me!\u0027\\n\\n \u0027No, Kyra.\u0027\\n\\n \u0027Put me down! Land me! Land me! PUT ME DOWN!\u0027\\n\\n I was losing her. Then, as we came out onto the top step, she abruptly stopped struggling. \u0027Give me Stricken! I want Stricken!\u0027\\n\\n At first I had no idea what she was talking about, but when I looked where she was pointing I understood. Lying on the walk not far from the pot with the key underneath it was the stuffed toy from Ki\u0027s Happy Meal. Strickland had put in a fair amount of outside playtime from the look of him ¡ª the light-gray fur was now dark-gray with dust ¡ª but if the toy would calm her, I wanted her to have it. This was no time to worry about dirt and germs.\\n\\n \u0027I\u0027ll give you Strickland if you promise to close your eyes and not open them until I tell you. Will you promise?\u0027\\n\\n \u0027I promise,\u0027 she said. She was trembling in my arms, and great globular tears ¡ª the kind you expect to see in fairy-tale books, never in real life ¡ª rose in her eyes and went spilling down her cheeks. I could smell burning grass and charred beefsteak. For one terrible moment I thought I was going to vomit, and then I got it under control.\\n\\n Ki closed her eyes. Two more tears fell from them and onto my arm. They were hot. She held out one hand, groping. I went down the steps, got the dog, then hesitated. First the ribbons, now the dog. The ribbons were probably okay, but it seemed wrong to give her the dog and let her bring it along. It seemed wrong but . . .\\n\\n It\u0027s gray, Irish, the UFO voice whispered. You don\u0027t need to worry about it because it\u0027s gray. The stuffed toy in your dream was black.\\n\\n I didn\u0027t know exactly what the voice was talking about and had no time to care. I put the stuffed dog in Kyra\u0027s open hand. She held it up to her face and kissed the dusty fur, her eyes still closed.\\n\\n \u0027Maybe Stricken can make Mommy better, Mike. Stricken a magic dog.\u0027\\n\\n \u0027Just keep your eyes closed. Don\u0027t open them until I say.\u0027\\n\\n She put her face against my neck. I carried her across the yard and to my car that way. I put her on the passenger side of the front seat. She lay down with her arms over her head and the dirty stuffed dog clutched in one pudgy hand. I told her to stay just like that, lying down on the seat. She made no outward sign that she heard me, but I knew that she did.\\n\\n We had to hurry because the old-timers were coming. The old-timers wanted this business over, wanted this river to run into the sea. And there was only one place we could go, only one place where we might be safe, and that was Sara Laughs. But there was something I had to do first.\\n\\n I kept a blanket in the trunk, old but clean. I took it out, walked across the yard, and shook it down over Mattie Devore. The hump it made as it settled around her was pitifully slight. I looked around and saw John staring at me. His eyes were glassy with shock, but I thought maybe he was coming back. The belt was still clamped in his teeth; he looked like a junkie preparing to shoot up.\\n\\n \u0027Iss ant eee,\u0027 he said ¡ª This can\u0027t be. I knew exactly how he felt.\\n\\n \u0027There\u0027ll be help here in just a few minutes. Hang in there. I have to go.\u0027\\n\\n \u0027Go air?\u0027\\n\\n I didn\u0027t answer. There wasn\u0027t time. I stopped and took George Kennedy\u0027s pulse. Slow but strong. Beside him, Footman was deep in unconsciousness, but muttering thickly. Nowhere near dead. It takes a lot to kill a daddy. The jerky wind blew the smoke from the overturned car in my direction, and now I could smell cooking flesh as well as barbecued steak. My stomach clenched again.\\n\\n I ran to the Chevy, dropped behind the wheel, and backed out of the driveway. I took one more look ¡ª at the blanket-covered body, at the three knocked-over men, at the trailer with the line of black bulletholes wavering down its side and its door standing open. John was up on his good elbow, the end of the belt still clamped in his teeth, looking at me with uncomprehending eyes. Lightning flashed so brilliantly I tried to shield my eyes from it, although by the time my hand was up, the flash had gone and the day was as dark as late dusk.\\n\\n \u0027Stay down, Ki,\u0027 I said. \u0027Just like you are.\u0027\\n\\n \u0027I can\u0027t hear you,\u0027 she said in a voice so hoarse and choked with tears that I could barely make out the words. \u0027Ki\u0027s takin a nap wif Stricken.\u0027\\n\\n \u0027Okay,\u0027 I said. \u0027Good.\u0027\\n\\n I drove past the burning Ford and down to the foot of the hill, where I stopped at the rusty bullet-pocked stop-sign. I looked right and saw the pickup truck parked on the shoulder. BAMM CONSTRUCTION on the side. Three men crowded together in the cab, watching me. The one by the passenger window was Buddy Jellison; I could tell him by his hat. Very slowly and deliberately, I raised my right hand and gave them the finger. None of them responded and their stony faces didn\u0027t change, but the pickup began to roll slowly toward me.\\n\\n I turned lift onto 68, heading for Sara Laughs under a black sky.\\n\\n Two miles from where Lane Forty-two branches off the highway and winds west to the lake, there stood an old abandoned barn upon which one could still make out faded letters reading DONCASTER DAIRY. As we approached it, the whole eastern side of the sky lit up in a purple-white blister. I cried out, and the Chevy\u0027s horn honked ¡ª by itself, I\u0027m almost positive. A thorn of lightning grew from the bottom of that light-blister and struck the barn. For a moment it was still completely there, glowing like something radioactive, and then it spewed itself in all directions. I have never seen anything even remotely like it outside of a movie theater. The thunderclap which followed was like a bombshell. Kyra screamed and slid onto the floor on the passenger side of the car with her hands clapped to her ears. She still clutched the little stuffed dog in one of them.\\n\\n A minute later I topped Sugar Ridge. Lane Forty-two splits left from the highway at the bottom of the ridge\u0027s north slope. From the top I could see a wide swath of TR-90 ¡ª woods and fields and barns and farms, even a darkling gleam from the lake. The sky was as black as coal dust, flashing almost constantly with internal lightnings. The air had a clear ochre glow. Every breath I took tasted like the shavings in a tinderbox. The topography beyond the ridge stood out with a surreal clarity I cannot forget. That sense of mystery swarmed my heart and mind, that sense of the world as thin skin over unknowable bones and gulfs.\\n\\n I glanced into the rearview mirror and saw that the pickup truck had been joined by two other cars, one with a V-plate that means the vehicle is registered to a combat veteran of the armed services. When I slowed down, they slowed down. When I sped up, they sped up. I doubted they would follow us any farther once I turned onto Lane Forty-two, however.\\n\\n \u0027Ki? Are you okay?\u0027\\n\\n \u0027Sleepun,\u0027 she said from the footwell.\\n\\n \u0027Okay,\u0027 I said, and started down the hill.\\n\\n I could just see the red bicycle reflectors marking my turn onto Forty-two when it began to hail ¡ª great big chunks of white ice that fell out of the sky, drummed on the roof like heavy fingers, and bounced off the hood. They began to heap in the gutter where my windshield wipers hid.\\n\\n \u0027What\u0027s happening?\u0027 Kyra cried.\\n\\n \u0027It\u0027s just hail,\u0027 I said. \u0027It can\u0027t hurt us.\u0027 This was barely out of my mouth when a hailstone the size of a small lemon struck my side of the windshield and then bounced high into the air again, leaving a white II mark from which a number of short cracks radiated. Were John and George Kennedy lying helpless out in this? I turned my mind in that direction, but could sense nothing.\\n\\n When I made the left onto Lane Forty-two, it was hailing almost too hard to see. The wheelruts were heaped with ice. The white faded out under the trees, though. I headed for that cover, flipping on my headlights as I went. They cut bright cones through the pelting hail.\\n\\n As we went into the trees, that purple-white blister glowed again, and my rearview mirror went too bright to look at. There was a rending, crackling crash. Kyra screamed again. I looked around and saw a huge old spruce toppling slowly across the lane, its ragged stump on fire. It carried the electrical lines with it.\\n\\n Blocked in, I thought. This end, probably the other end, too. We\u0027re here. For better or for worse, we\u0027re here.\\n\\n The trees grew over Lane Forty-two in a canopy except for where the road passed beside Tidwell\u0027s Meadow. The sound of the hail in the woods was an immense splintery rattle. Trees were splintering, of course; it was the most damaging hail ever to fall in that part of the world, and although it spent itself in fifteen minutes, that was long enough to ruin a season\u0027s worth of crops.\\n\\n Lightning flashed above us. I looked up and saw a large orange fireball being chased by a smaller one. They ran through the trees to our left, setting fire to some of the high branches. We came briefly into the clear at Tidwell\u0027s Meadow, and as we did the hail changed to torrential rain. I could not have continued driving if we hadn\u0027t run back into the woods almost immediately, and as it was the canopy provided just enough cover so I could creep along, hunched over the wheel and peering into the silver curtain falling through the fan of my headlights. Thunder boomed constantly, and now the wind began to rise, rushing through the trees like a contentious voice. Ahead of me, a leaf-heavy branch dropped into the road. I ran over it and listened to it thunk and scrape and roll against the Chevy\u0027s undercarriage.\\n\\n Please, nothing bigger, I thought . . . or maybe I was praying. Please let me get to the house. Please let us get to the house.\\n\\n By the time I reached the driveway the wind was howling a hurricane. The writhing trees and pelting rain made the entire world seem on the verge of wavering into insubstantial gruel. The driveway\u0027s slope had turned into a river, but I nosed the Chevy down it with no hesitation ¡ª we couldn\u0027t stay out here; if a big tree fell on the car, we\u0027d be crushed like bugs in a Dixie cup.\\n\\n I knew better than to use the brakes ¡ª the car would have heeled sideways and perhaps have been swept right down the slope toward the lake, rolling over and over as it went. Instead I dropped the transmission into low range, toed two notches into the emergency brake, and let the engine pull us down with the rain sheeting against the windshield and turning the log bulk of the house into a phantom. Incredibly, some of the lights were still on, shining like bathysphere portholes in nine feet of water. The generator was working, then . . . at least for the time being.\\n\\n Lightning threw a lance across the lake, green-blue fire illuminating a black well of water with its surface lashed into surging whitecaps. One of the hundred-year-old pines which had stood to the left of the railroad-tie steps now lay with half its length in the water. Somewhere behind us another tree went over with a vast crash. Kyra covered her ears.\\n\\n \u0027It\u0027s all right, honey,\u0027 I said. \u0027We\u0027re here, we made it.\u0027\\n\\n I turned off the engine and killed the lights. Without them I could see little; almost all the day had gone out of the day. I tried to open my door and at first couldn\u0027t. I pushed harder and it not only opened, it was ripped right out of my hand. I got out and in a brilliant stroke of lightning saw Kyra crawling across the seat toward me, her face white with panic, her eyes huge and brimming with terror. My door swung back and hit me in the ass hard enough to hurt. I ignored it, gathered Ki into my arms, and turned with her. Cold rain drenched us both in an instant. Except it really wasn\u0027t like rain at all; it was like stepping under a waterfall.\\n\\n \u0027My doggy!\u0027 Ki shrieked. Shriek or not, I could hardly hear her. I could see her face, though, and her empty hands. \u0027Stricken! I drop Stricken!\u0027\\n\\n I looked around and yes, there he was, floating down the macadam of the driveway and past the stoop. A little farther on, the rushing water spilled off the paving and down the slope; if Strickland went with the flow, he\u0027d probably end up in the woods somewhere. Or all the way down to the lake.\\n\\n \u0027Stricken!\u0027 Ki sobbed. \u0027My DOGGY!\u0027\\n\\n Suddenly nothing mattered to either of us but that stupid stuffed toy. I chased down the driveway after it with Ki in my arms, oblivious of the rain and wind and brilliant flashes of lightning. And yet it was going to beat me to the slope ¡ª the water in which it was caught was running too fast for me to catch up.\\n\\n What snagged it at the edge of the paving was a trio of sunflowers waving wildly in the wind. They looked like God-transported worshippers at a revival meeting: Yes, Jeesus! Thankya Lawd! They also looked familiar. It was of course impossible that they should be the same three sunflowers which had been growing up through the boards of the stoop in my dream (and in the photograph Bill Dean had taken before I came back), and yet it was them; beyond doubt it was them. Three sunflowers like the three weird sisters in Macbeth, three sunflowers with faces like searchlights. I had come back to Sara Laughs; I was in the zone; I had returned to my dream and this time it had possessed me.\\n\\n \u0027Stricken!\u0027 Ki bending and thrashing in my arms, both of us too slippery for safety. \u0027Please, Mike, please!\u0027\\n\\n Thunder exploded overhead like a basket of nitro. We both screamed. I dropped to one knee and snatched up the little stuffed dog. Kyra clutched it, covered it with frantic kisses. I lurched to my feet as another thunderclap sounded, this one seeming to run through the air like some crazy liquid bullwhip. I looked at the sunflowers, and they seemed to look back at me ¡ª Hello, Irish, it\u0027s been a long time, what do you say? Then, resettling Ki in my arms as well as I could, I turned and slogged for the house. It wasn\u0027t easy; the water in the driveway was now ankle-deep and full of melting hailstones. A branch flew past us and landed pretty much where I\u0027d knelt to pick up Strickland. There was a crash and a series of thuds as a bigger branch struck the roof and went rolling down it.\\n\\n I ran onto the back stoop, half-expecting the Shape to come rushing out to greet us, raising its baggy not-arms in gruesome good fellowship, but there was no Shape. There was only the storm, and that was enough.\\n\\n Ki was clutching the dog tightly, and I saw with no surprise at all that its wetting, combined with the dirt from all those hours of outside play, had turned Strickland black. It was what I had seen in my dream after all.\\n\\n Too late now. There was nowhere else to go, no other shelter from the storm. I opened the door and brought Kyra Devore inside Sara Laughs.\\n\\n The central portion of Sara ¡ª the heart of the house ¡ª had stood for almost a hundred years and had seen its share of storms. The one that fell on the lakes region that July afternoon might have been the worst of them, but I knew as soon as we were inside, both of us gasping like people who have narrowly escaped drowning, that it would almost certainly withstand this one as well. The log walls were so thick it was almost like stepping into some sort of vault. The storm\u0027s crash and bash became a noisy drone punctuated by thunderclaps and the occasional loud thud of a branch falling on the roof. Somewhere ¡ª in the basement, I guess ¡ª a door had come loose and was clapping back and forth. It sounded like a starter\u0027s pistol. The kitchen window had been broken by the topple of a small tree. Its needly tip poked in over the stove, making shadows on the counter and the stove-burners as it swayed. I thought of breaking it off and decided not to. At least it was plugging the hole.\\n\\n I carried Ki into the living room and we looked out at the lake, black water prinked up in surreal points under a black sky. Lightning flashed almost constantly, revealing a ring of woods that danced and swayed in a frenzy all around the lake. As solid as the house was, it was groaning deeply within itself as the wind pummelled it and tried to push it down the hill.\\n\\n There was a soft, steady chiming. Kyra lifted her head from my shoulder and looked around.\\n\\n \u0027You have a moose,\u0027 she said.\\n\\n \u0027Yes, that\u0027s Bunter.\u0027\\n\\n \u0027Does he bite?\u0027\\n\\n \u0027No, honey, he can\u0027t bite. He\u0027s like a . . . like a doll, I suppose.\u0027\\n\\n \u0027Why is his bell ringing?\u0027\\n\\n \u0027He\u0027s glad we\u0027re here. He\u0027s glad we made it.\u0027\\n\\n I saw her want to be happy, and then I saw her realizing that Mattie wasn\u0027t here to be happy with. I saw the idea that Mattie would never be here to be happy with glimmer in her mind . . . and felt her push it away. Over our heads something huge crashed down on the roof, the lights flickered, and Ki began to weep again.\\n\\n \u0027No, honey,\u0027 I said, and began to walk with her. \u0027No, honey, no, Ki, don\u0027t. Don\u0027t, honey, don\u0027t.\u0027\\n\\n \u0027I want my mommy! I want my Mattie!\u0027\\n\\n I walked her the way I think you\u0027re supposed to walk babies who have colic. She understood too much for a three-year-old, and her suffering was consequently more terrible than any three-year-old should have to bear. So I held her in my arms and walked her, her shorts damp with urine and rainwater under my hands, her arms fever-hot around my neck, her cheeks slathered with snot and tears, her hair a soaked clump from our brief dash through the downpour, her breath acetone, her toy a strangulated black clump that sent dirty water trickling over her knuckles. I walked her. Back and forth we went through Sara\u0027s living room, back and forth through dim light thrown by the overhead and one lamp. Generator light is never quite steady, never quite still ¡ª it seems to breathe and sigh. Back and forth through the ceaseless low chiming of Bunter\u0027s bell, like music from that world we sometimes touch but never really see. Back and forth beneath the sound of the storm. I think I sang to her and I know I touched her with my mind and we went deeper and deeper into that zone together. Above us the clouds ran and the rain pelted, dousing the fires the lightning had started in the woods. The house groaned and the air eddied with gusts coming in through the broken kitchen window, but through it all there was a feeling of rueful safety. A feeling of coming home.\\n\\n At last her tears began to taper off. She lay with her cheek and the weight of her heavy head on my shoulder, and when we passed the lakeside windows I could see her eyes looking out into the silver-dark storm, wide and unblinking. Carrying her was a tall man with thinning hair. I realized I could see the dining-room table right through us. Our reflections are ghosts already, I thought.\\n\\n \u0027Ki? Can you eat something?\u0027\\n\\n \u0027Not hung\u0027y.\u0027\\n\\n \u0027Can you drink a glass of milk?\u0027\\n\\n \u0027No, cocoa. I cold.\u0027\\n\\n \u0027Yes, of course you are. And I have cocoa.\u0027\\n\\n I tried to put her down and she held on with panicky tightness, scrambling against me with her plump little thighs. I hoisted her back up again, this time settling her against my hip, and she subsided.\\n\\n \u0027Who\u0027s here?\u0027 she asked. She had begun to shiver. \u0027Who\u0027s here \u0027sides us?\u0027\\n\\n \u0027I don\u0027t know.\u0027\\n\\n \u0027There\u0027s a boy,\u0027 she said. \u0027I saw him there.\u0027 She pointed Strickland toward the sliding glass door which gave on the deck (all the chairs out there had been overturned and thrown into the corners; one of the set was missing, apparently blown right over the rail). \u0027He was black like on that funny show me and Mattie watch. There are other black people, too. A lady in a big hat. A man in blue pants. The rest are hard to see. But they watch. They watch us. Don\u0027t you see them?\u0027\\n\\n \u0027They can\u0027t hurt us.\u0027\\n\\n \u0027Are you sure? Are you, are you?\u0027\\n\\n I didn\u0027t answer.\\n\\n I found a box of Swiss Miss hiding behind the flour cannister, tore open one of the packets, and dumped it into a cup. Thunder exploded overhead. Ki jumped in my arms and let out a long, miserable wail. I hugged her, kissed her cheek.\\n\\n \u0027Don\u0027t put me down, Mike, I scared.\u0027\\n\\n \u0027I won\u0027t put you down. You\u0027re my good girl.\u0027\\n\\n \u0027I scared of the boy and the blue-pants man and the lady. I think it\u0027s the lady who wore Mattie\u0027s dress. Are they ghosties?\u0027\\n\\n \u0027Yes.\u0027\\n\\n \u0027Are they bad, like the men who chased us at the fair? Are they?\u0027\\n\\n \u0027I don\u0027t really know, Ki, and that\u0027s the truth.\u0027\\n\\n \u0027But we\u0027ll find out.\u0027\\n\\n \u0027Huh?\u0027\\n\\n \u0027That\u0027s what you thought. \"But we\u0027ll find out. \"\u0027\\n\\n \u0027Yes,\u0027 I said. \u0027I guess that\u0027s what I was thinking. Something like that.\u0027\\n\\n I took her down to the master bedroom while the water heated in the kettle, thinking there had to be something left of Jo\u0027s I could pop her into, but all of the drawers in Jo\u0027s bureau were empty. So was her side of the closet. I stood Ki on the big double bed where I had not so much as taken a nap since coming back, took off her clothes, carried her into the bathroom, and wrapped her in a bathtowel. She hugged it around herself, shaking and blue-lipped. I used another one to dry her hair as best I could. During all of this, she never let go of the stuffed dog, which was now beginning to bleed stuffing from its seams.\\n\\n I opened the medicine cabinet, pawed through it, and found what I was looking for on the top shelf: the Benadryl Jo had kept around for her ragweed allergy. I thought of checking the expiration date on the bottom of the box, then almost laughed out loud. What difference did that make? I stood Ki on the closed toilet seat and let her hold on around my neck while I stripped the childproof backing from four of the little pink-and-white caplets. Then I rinsed out the tooth-glass and filled it with cold water. While I was doing this I saw movement in the bathroom mirror, which reflected the doorway and the master bedroom beyond. I told myself that I was only seeing the shadows of windblown trees. I offered the caplets to Ki. She reached for them, then hesitated.\\n\\n \u0027Go on,\u0027 I said. \u0027It\u0027s medicine.\u0027\\n\\n \u0027What kind?\u0027 she asked. Her small hand was still poised over the little cluster of caplets.\\n\\n \u0027Sadness medicine,\u0027 I said. \u0027Can you swallow pills, Ki?\u0027\\n\\n \u0027Sure. I taught myself when I was two.\u0027\\n\\n She hesitated a moment longer ¡ª looking at me and looking into me, I think, ascertaining that I was telling her something I really believed. What she saw or felt must have satisfied her, because she took the caplets and put them in her mouth, one after another. She swallowed them with little birdie-sips from the glass, then said: \u0027I still feel sad, Mike.\u0027\\n\\n \u0027It takes awhile for them to work.\u0027\\n\\n I rummaged in my shirt drawer and found an old Harley-Davidson tee that had shrunk. It was still miles too big for her, but when I tied a knot in one side it made a kind of sarong that kept slipping off one of her shoulders. It was almost cute.\\n\\n I carry a comb in my back pocket. I took it out and combed her hair back from her forehead and her temples. She was starting to look put together again, but there was still something missing. Something that was connected in my mind with Royce Merrill. That was crazy, though . . . wasn\u0027t it?\\n\\n \u0027Mike? What cane? What cane are you thinking about it?\u0027\\n\\n Then it came to me. \u0027A candy cane,\u0027 I said. \u0027The kind with stripes.\u0027 From my pocket I took the two white ribbons. Their red edges looked almost raw in the uncertain light. \u0027Like these.\u0027 I tied her hair back in two little ponytails. Now she had her ribbons; she had her black dog; the sunflowers had relocated a few feet north, but they were there. Everything was more or less the way it was supposed to be.\\n\\n Thunder blasted, somewhere close a tree fell, and the lights went out. After five seconds of dark-gray shadows, they came on again. I carried Ki back to the kitchen, and when we passed the cellar door, something laughed behind it. I heard it; Ki did, too. I could see it in her eyes.\\n\\n \u0027Take care of me,\u0027 she said. \u0027Take care of me cause I\u0027m just a little guy. You promised.\u0027\\n\\n \u0027I will.\u0027\\n\\n \u0027I love you, Mike.\u0027\\n\\n \u0027I love you, too, Ki.\u0027\\n\\n The kettle was huffing. I filled the cup to the halfway mark with hot water, then topped it up with milk, cooling it off and making it richer. I took Kyra over to the couch. As we passed the dining-room table I glanced at the IBM typewriter and at the manuscript with the cross-word-puzzle book lying on top of it. Those things looked vaguely foolish and somehow sad, like gadgets that never worked very well and now do not work at all.\\n\\n Lightning lit up the entire sky, scouring the room with purple light. In that glare the laboring trees looked like screaming fingers, and as the light raced across the sliding glass door to the deck I saw a woman standing behind us, by the woodstove. She was indeed wearing a straw hat, with a brim the size of a cartwheel.\\n\\n \u0027What do you mean, the river is almost in the sea?\u0027 Ki asked.\\n\\n I sat down and handed her the cup. \u0027Drink that up.\u0027\\n\\n \u0027Why did the men hurt my mommy? Didn\u0027t they want her to have a good time?\u0027\\n\\n \u0027I guess not,\u0027 I said. I began to cry. I held her on my lap, wiping away the tears with the backs of my hands.\\n\\n \u0027You should have taken some sad-pills, too,\u0027 Ki said. She held out her cocoa. Her hair ribbons, which I had tied in big sloppy bows, bobbed. \u0027Here. Drink some.\u0027\\n\\n I drank some. From the north end of the house came another grinding, crackling crash. The low rumble of the generator stuttered and the house went gray again. Shadows raced across Ki\u0027s small face.\\n\\n \u0027Hold on,\u0027 I told her. \u0027Try not to be scared. Maybe the lights will come back.\u0027 A moment later they did, although now I could hear a hoarse, uneven note in the gennie\u0027s roar and the flicker of the lights was much more noticeable.\\n\\n \u0027Tell me a story,\u0027 she said. \u0027Tell me about Cinderbell.\u0027\\n\\n \u0027Cinderella.\u0027\\n\\n \u0027Yeah, her.\u0027\\n\\n \u0027All right, but storyguys get paid.\u0027 I pursed my lips and made sipping sounds.\\n\\n She held the cup out. The cocoa was sweet and good. The sensation of being watched was heavy and not sweet at all, but let them watch. Let them watch while they could.\\n\\n \u0027There was this pretty girl named Cinderella ¡ª \u0027\\n\\n \u0027Once upon a time! That\u0027s how it starts! That\u0027s how they all start!\u0027\\n\\n \u0027That\u0027s right, I forgot. Once upon a time there was this pretty girl named Cinderella, who had two mean stepsisters. Their names were . . . do you remember?\u0027\\n\\n \u0027Tammy Faye and Vanna.\u0027\\n\\n \u0027Yeah, the Queens of Hairspray. And they made Cinderella do all the really unpleasant chores, like sweeping out the fireplace and cleaning up the dogpoop in the back yard. Now it just so happened that the noted rock band Oasis was going to play a gig at the palace, and although all the girls had been invited . . . \u0027\\n\\n I got as far as the part about the fairy godmother catching the mice and turning them into a Mercedes limousine before the Benadryl took effect. It really was a medicine for sadness; when I looked down, Ki was fast asleep in the crook of my arm with her cocoa cup listing radically to port. I plucked it from her fingers and put it on the coffee-table, then brushed her drying hair off her forehead.\\n\\n \u0027Ki?\u0027\\n\\n Nothing. She\u0027d gone to the land of Noddy-Blinky. It probably helped that her afternoon nap had ended almost before it got started.\\n\\n I picked her up and carried her down to the north bedroom, her feet bouncing limply in the air and the hem of the Harley shirt flipping around her knees. I put her on the bed and pulled the duvet up to her chin. Thunder boomed like artillery fire, but she didn\u0027t even stir. Exhaustion, grief, Benadryl . . . they had taken her deep, taken her beyond ghosts and sorrow, and that was good. I bent over and kissed her cheek, which had finally begun to cool. \u0027I\u0027ll take care of you,\u0027 I said. \u0027I promised, and I will.\u0027\\n\\n As if hearing me, Ki turned on her side, put the hand holding Strickland under her jaw, and made a soft sighing sound. Her lashes were dark soot against her cheeks, in startling contrast to her light hair. Looking at her I felt myself swept by love, shaken by it the way one is shaken by a sickness.\\n\\n Take care of me, I\u0027m just a little guy.\\n\\n \u0027I will, Ki-bird,\u0027 I said.\\n\\n I went into the bathroom and began filling the tub, as I had once filled it in my sleep. She would sleep through it all if I could get enough warm water before the generator quit entirely. I wished I had a bath-toy to give her in case she did wake up, something like Wilhelm the Spouting Whale, but she\u0027d have her dog, and she probably wouldn\u0027t wake up, anyway. No freezing baptism under a handpump for Kyra. I was not cruel, and I was not crazy.\\n\\n I had only disposable razors in the medicine cabinet, no good for the other job ahead of me. Not efficient enough. But one of the kitchen steak knives would do. If I filled the washbasin with water that was really hot, I wouldn\u0027t even feel it. A letter T on each arm, the top bar drawn across the wrists ¡ª\\n\\n For a moment I came out of the zone. A voice ¡ª my own speaking as some combination of Jo and Mattie ¡ª screamed: What are you thinking about? Oh Mike, what in God\u0027s name are you thinking about?\\n\\n Then the thunder boomed, the lights flickered, and the rain began to pour down again, driven by the wind. I went back into that place where everything was clear, my course indisputable. Let it all end ¡ª the sorrow, the hurt, the fear. I didn\u0027t want to think anymore about how Mattie had danced with her toes on the Frisbee as if it were a spotlight. I didn\u0027t want to be there when Kyra woke up, didn\u0027t want to see the misery fill her eyes. I didn\u0027t want to get through the night ahead, the day that was coming beyond it, or the day that was coming after that. They were all cars on the same old mystery train. Life was a sickness. I was going to give her a nice warm bath and cure her of it. I raised my arms. In the medicine cabinet mirror a murky figure ¡ª a Shape ¡ª raised its own in a kind of jocular greeting. It was me. It had been me all along, and that was all right. That was just fine.\\n\\n I dropped to one knee and checked the water. It was coming in nice and warm. Good. Even if the generator quit now, it would be fine. The tub was an old one, a deep one. As I walked down to the kitchen to get the knife, I thought about climbing in with her after I had finished cutting my wrists in the hotter water of the basin. No, I decided. It might be misinterpreted by the people who would come here later on, people with nasty minds and nastier assumptions. The ones who\u0027d come when the storm was over and the trees across the road cleared away. No, after her bath I would dry her and put her back in bed with Strickland in her hand. I\u0027d sit across the room from her, in the rocking chair by the bedroom windows. I would spread some towels in my lap to keep as much of the blood off my pants as I could, and eventually I would go to sleep, too.\\n\\n Bunter\u0027s bell was still ringing. Much louder now. It was getting on my nerves, and if it kept on that way it might even wake the baby. I decided to pull it down and silence it for good. I crossed the room, and as I did a strong gust of air blew past me. It wasn\u0027t a draft from the broken kitchen window; this was that warm subway-air again. It blew the Tough Stuff crossword book onto the floor, but the paperweight on the manuscript kept the loose pages from following. As I looked in that direction, Bunter\u0027s bell fell silent.\\n\\n A voice sighed across the dim room. Words I couldn\u0027t make out. And what did they matter? What did one more manifestation ¡ª one more blast of hot air from the Great Beyond ¡ª matter?\\n\\n Thunder rolled and the sigh came again. This time, as the generator died and the lights went out, plunging the room into gray shadow, I got one word in the clear:\\n\\n Nineteen.\\n\\n I turned on my heels, making a nearly complete circle. I finished up looking across the shadowy room at the manuscript of My Childhood Friend. Suddenly the light broke. Understanding arrived.\\n\\n Not the crossword book. Not the phone book, either.\\n\\n My book. My manuscript.\\n\\n I crossed to it, vaguely aware that the water had stopped running into the tub in the north-wing bathroom. When the generator died, the pump had quit. That was all right, it would be plenty deep enough already. And warm. I would give Kyra her bath, but first there was something I had to do. I had to go down nineteen, and after that I just might have to go down ninety-two. And I could. I had completed just over a hundred and twenty pages of manuscript, so I could. I grabbed the battery-powered lantern from the top of the cabinet where I still kept several hundred actual vinyl records, clicked it on, and set it on the table. It cast a white circle of radiance on the manuscript ¡ª in the gloom of that afternoon it was as bright as a spotlight.\\n\\n On page nineteen of My Childhood Friend, Tiffi Taylor ¡ª the call-girl who had re-invented herself as Regina Whiting ¡ª was sitting in her studio with Andy Drake, reliving the day that John Sanborn (the alias under which John Shackleford had been getting by) saved her three-year-old daughter, Karen. This is the passage I read as the thunder boomed and the rain slashed against the sliding door giving on the deck:\\n\\n FRIEND, by Noonan/Pg. 19\\n\\n over that way, I was sure of it,\u0027 she said, \u0027but\\n\\n when I couldn\u0027t see her anywhere, I went to\\n\\n look in the hot tub.\u0027 She lit a cigarette. \u0027What I\\n\\n saw made me feel like screaming, Andy ¡ª Karen was\\n\\n underwater. All that was out was her hand . . . the\\n\\n nails were turning purple. After that . . . I guess I\\n\\n dived in, but I don\u0027t remember; I was zoned out.\\n\\n Everything from then on is like a dream where stuff\\n\\n runs together in your mind. The yard-guy ¡ª Sanborn ¡ª\\n\\n shoved me aside and dived. His foot hit me in the\\n\\n throat and I couldn\u0027t swallow for a week. He yanked\\n\\n up on Karen\u0027s arm. I thought he\u0027d pull it off her\\n\\n damn shoulder, but he got her. He got her.\u0027\\n\\n In the gloom, Drake saw she was weeping. \u0027God.\\n\\n Oh God, I thought she was dead. I was sure she was.\u0027\\n\\n I knew at once, but laid my steno pad along the left margin of the manuscript so I could see it better. Reading down, as you\u0027d read a vertical crossword-puzzle answer, the first letter of each line spelled the message which had been there almost since I began the book:\\n\\n owls undEr stud O\\n\\n Then, allowing for the indent next-to-last line from the bottom:\\n\\n owls undEr studIO\\n\\n Bill Dean, my caretaker, is sitting behind the wheel of his truck. He has accomplished his two purposes in coming here ¡ª welcoming me back to the TR and warning me off Mattie Devore. Now he\u0027s ready to go. He smiles at me, displaying those big false teeth, those Roebuckers. \u0027If you get a chance, you ought to look for the owls,\u0027 he tells me. I ask him what Jo would have wanted with a couple of plastic owls and he replies that they keep the crows from shitting up the woodwork. I accept that, I have other things to think about, but still . . . \u0027It was like she\u0027d come down to do that errand special,\u0027 he says. It never crosses my mind ¡ª not then, at least ¡ª that in Indian folklore, owls have another purpose: they are said to keep evil spirits away. If Jo knew that plastic owls would scare the crows off, she would have known that. It was just the sort of information she picked up and tucked away. My inquisitive wife. My brilliant scatterbrain.\\n\\n Thunder rolled. Lightning ate at the clouds like spills of bright acid. I stood by the dining-room table with the manuscript in my unsteady hands.\\n\\n \u0027Christ, Jo,\u0027 I whispered. \u0027What did you find out?\u0027\\n\\n And why didn\u0027t you tell me?\\n\\n But I thought I knew the answer to that. She hadn\u0027t told me because I was somehow like Max Devore; his great-grandfather and my own had shit in the same pit. It didn\u0027t make any sense, but there it was.\\n\\n And she hadn\u0027t told her own brother, either. I took a weird kind of comfort from that.\\n\\n I began to leaf through the manuscript, my skin crawling.\\n\\n Andy Drake rarely frowned in Michael Noonan\u0027s My Childhood Friend. He scowled instead, because there\u0027s an owl in every scowl. Before coming to Florida, John Shackleford had been living in Studio City, California. Drake\u0027s first meeting with Regina Whiting occurred in her studio. Ray Garraty\u0027s last-known address was the Studio Apartments in Key Largo. Regina Whiting\u0027s best friend was Steffie Underwood. Steffi\u0027s husband was Towle Underwood ¡ª there was a good one, two for the price of one.\\n\\n Owls under studio.\\n\\n It was everywhere, on every page, just like the K-names in the telephone book. A kind of monument, this one built ¡ª I was sure of it ¡ª not by Sara Tidwell but by Johanna Arlen Noonan. My wife passing messages behind the guard\u0027s back, praying with all her considerable heart that I would see and understand.\\n\\n On page ninety-two Shackleford was talking to Drake in the prison visitors\u0027 room ¡ª sitting with his wrists between his knees, looking down at the chain running between his ankles, refusing to make eye-contact with Drake.\\n\\n FRIEND, by Noonan/Pg. 92\\n\\n only thing I got to say. Anything else, fuck,\\n\\n what good would it do? Life\u0027s a game, and I\\n\\n lost. You want me to tell you that I yanked\\n\\n some little kid out of the water, pulled her\\n\\n up, got her motor going again? I did, but\\n\\n not because I\u0027m a hero or a saint . . . \u0027\\n\\n There was more but no need to read it. The message, owls under studio, ran down the margin just as it had on page nineteen. As it probably did on any number of other pages as well. I remembered how deliriously happy I had been to discover that the block had been dissolved and I could write again. It had been dissolved all right, but not because I\u0027d finally beaten it or found a way around it. Jo had dissolved it. Jo had beaten it, and my continued career as a writer of second-rate thrillers had been the least of her concerns when she did it. As I stood there in the flicker-flash of lightning, feeling my unseen guests swirl around me in the unsteady air, I remembered Mrs. Moran, my first-grade teacher. When your efforts to replicate the smooth curves of the Palmer Method alphabet on the blackboard began to flag and waver, she would put her large competent hand over yours and help you.\\n\\n So had Jo helped me.\\n\\n I riffled through the manuscript and saw the key words everywhere, sometimes placed so you could actually read them stacked on different lines, one above the other. How hard she had tried to tell me this . . . and I had no intention of doing anything else until I found out why. I dropped the manuscript back on the table, but before I could re-anchor it, a furious gust of freezing air blew past me, lifting the pages and scattering them everywhere in a cyclone. If that force could have ripped them to shreds, I\u0027m sure that it would have.\\n\\n No! it cried as I grabbed the lantern\u0027s handle. No, finish the job!\\n\\n Wind blew around my face in chill gusts ¡ª it was as if someone I couldn\u0027t quite see was standing right in front of me and breathing in my face, retreating as I moved forward, huffing and puffing like the big bad wolf outside the houses of the three little pigs.\\n\\n I hung the lantern over my arm, held my hands out in front of me, and clapped them together sharply. The cold puffs in my face ceased. There was now only the random swirling air coming in through the partially plugged kitchen window. \u0027She\u0027s sleeping,\u0027 I said to what I knew was still there, silently watching. \u0027There\u0027s time.\u0027\\n\\n I went out the back door and the wind took me at once, making me stagger sideways, almost knocking me over. And in the wavering trees I saw green faces, the faces of the dead. Devore\u0027s was there, and Royce\u0027s, and Son Tidwell\u0027s. Most of all I saw Sara\u0027s.\\n\\n Everywhere Sara.\\n\\n No! Go back! You don\u0027t need no truck with no owls, sugar! Go back! Finish the job! Do what you came for!\\n\\n \u0027I don\u0027t know what I came for,\u0027 I said. \u0027And until I find out, I\u0027m not doing anything.\u0027\\n\\n The wind screamed as if in offense, and a huge branch split off the pine standing to the right of the house. It fell on top of my Chevrolet in a spray of water, denting the roof before rolling off on my side.\\n\\n Clapping my hands out here would be every bit as useful as King Canute commanding the tide to turn. This was her world, not mine . . . and only the edge of it, at that. Every step closer to The Street and the lake would bring me closer to that world\u0027s heart, where time was thin and spirits ruled. Oh dear God, what had happened to cause this?\\n\\n The path to Jo\u0027s studio had turned into a creek. I got a dozen steps down it before a rock turned under my foot and I fell heavily on my side. Lightning zigged across the sky, there was the crack of another breaking branch, and then something was falling toward me. I put my hands up to shield my face and rolled to the right, off the path. The branch splashed to the ground just behind me, and I tumbled halfway down a slope that was slick with soaked needles. At last I was able to pull myself to my feet. The branch on the path was even bigger than the one which had landed on the roof of the car. If it had struck me, it likely would have bashed in my skull.\\n\\n Go back! A hissing, spiteful wind through the trees.\\n\\n Finish it! The slobbering, guttural voice of the lake slamming into the rocks and the bank below The Street.\\n\\n Mind your business! That was the very house itself, groaning on its foundations. Mind your business and let me mind mine!\\n\\n But Kyra was my business. Kyra was my daughter.\\n\\n I picked up the lantern. The housing was cracked but the bulb glowed bright and steady ¡ª that was one for the home team. Bent over against the howling wind, hand raised to ward off more falling branches, I slipped and stumbled my way down the hill to my dead wife\u0027s studio. \\n\\n","sourceLink":"https://allnovel.net/bag-of-bones/page-27.html","bookId":2432,"book":{"id":2432,"title":"Bag of Bones","description":"Storyline: Four years after the sudden death of his wife, forty-year-old bestselling novelist Mike Noonan is unable to write and plagued by vivid nightmares set at the Maine summerhouse he calls Sara Laughs. Mike reluctantly returns to the lakeside getaway and finds his beloved Yankee town held in the grip of a vindictive millionaire, Max Devore, who is trying to take his three-year-old granddaughter away from her widowed young mother, Mattie. As Mike is drawn into Mattie\u0027s struggle -- and begins to fall in love with her -- he is also drawn into the mystery of Sara Laughs, now the site of ghostly visitations and escalating terrors. What do the forces that have been unleashed here want of Mike Noonan?\\n","cover":"https://allnovel.net/images/bag-of-bones.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/bag-of-bones.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:07:26 PM"}}
