{"id":101448,"no":38,"title":"Page 38","content":"He was doing wonders for my self-confidence.\\n\\n “Look at it this way. Every cell in your body is encased in light. Picture in your mind pulling all those cells together and feel the light. It’s warm. It should vibrate and hum. It’s like lightning in your veins. Think of something that feels that way.”\\n\\n I yawned. “I’ve tried—”\\n\\n He shot off the chair, moving faster than I’d ever seen him. Grabbing my wrist until his thumb and forefinger met, he stared into my wide eyes. “You’re not trying hard enough, Katy. If you can’t manipulate light, then…”\\n\\n “Then what?” I demanded.\\n\\n Blake drew in a deep breath. “It’s just that…if you can’t control the strongest part of you, there’s a chance you’ll never really be under control. And you’ll never be able to defend yourself.”\\n\\n I wondered if it had been this hard for Bethany. “I’m trying. I promise.”\\n\\n He let go of my wrist and ran a hand through his spiky hair. Then he smiled. “I have an idea.”\\n\\n “Oh, no.” I shook my head. “I don’t like your ideas at all.”\\n\\n He cast a grin over his shoulder as he pulled his keys out of his pocket. “You said you’d trust me, right?”\\n\\n “Yeah, but that’s before you threw a knife at my chest and caught my fingers on fire.”\\n\\n Blake laughed, and I scowled. None of that was funny. “I’m not doing anything like that. I think we just need to get out of here. Go grab something to eat.”\\n\\n Wary, I shuffled from one foot to the next. “Really? That…doesn’t sound like a bad idea.”\\n\\n “Yeah, why don’t you grab a jacket and we’ll get some food.”\\n\\n Lately, I was always hungry, so the prospect of greasy food sealed the deal. Grabbing my chunky sweater, I slipped it on and followed Blake out to his truck. It wasn’t as huge as the ones the guys drove around here, but it was nice and brand spanking new.\\n\\n “What are you in the mood for?” He clapped his hands together, warming them up as the engine roared to life.\\n\\n “Anything that will cause me to gain ten pounds.” I buckled myself in.\\n\\n Blake laughed. “I know just the place.”\\n\\n Pressing against the seat, I decided to ask the question that had been plaguing me since Daemon and I talked to Matthew. “What happened to the Luxen who healed you?”\\n\\n His hand clenched the steering wheel until his knuckles bleached. “I…I don’t know. And not knowing kills me, Katy. I’d do anything to find out.”\\n\\n I stared at him as sadness crept into me. Since Blake was here, his friend had to be alive. Most likely the DOD had him. I started to say something about it but stopped.\\n\\n Lately, I’d started to feel more and more weird around Blake. I couldn’t put my finger on it, and maybe it was just a matter of Daemon repeating it every chance he got, but I didn’t trust Blake as much anymore.\\n\\n “Why do you ask?” He glanced at me, face drawn tight.\\n\\n I shrugged. “I was just curious. I’m sorry about what happened.”\\n\\n He nodded, and neither of us said anything for a while. It wasn’t until we passed the exit for Moorefield that I started to get nervous. “Is it safe for us to go this far? The Rocks only have a fifty-mile radius, right?”\\n\\n “That’s just a guesstimate. We’ll be fine.”\\n\\n I nodded, unable to shake the sudden dread curling around my insides. Each mile farther Blake took me from home, I started to get antsy. The Arum were obviously around, could even know who we were, since it looked like they might be in cahoots with the DOD. This was reckless, even stupid. Running my hands over my jeans, I stared out the window as Blake hummed along to a rock song.\\n\\n I reached into my purse and pulled out my cell. If we were really within the shelter of the beta quartz, Blake should be cool with me letting Daemon know.\\n\\n “You’re not one of those girls who has to tell her boyfriend every move she makes, are you, Katy?” Blake nodded at my phone and smiled, but the humor never reached his eyes. “Besides, we’re here anyway.”\\n\\n I wasn’t one of those girls, but…\\n\\n He pulled into the parking lot of a little joint that boasted the best wings in West Virginia. Christmas lights decorated their pitch-black windows. There was a giant mountaineer statue guarding the entrance.\\n\\n It all looked incredibly normal.\\n\\n I silently blamed Daemon for making me doubt Blake, shoved my phone back in my purse, and headed into the restaurant.\\n\\n Dinner was oddly strained. Nothing like the first two times Blake and I had gone out. Trying to get him to even talk about surfing was like squeezing glass—painful and pointless. I talked about how much I missed blogging and reading while he texted away on his phone. Or played a game—I couldn’t be sure. Once I thought I heard a pig oink. Eventually I stopped talking and focused on ripping the skin off my wings.\\n\\n It was past six, and we’d been sitting at the little table, going on our third soda refill, when I couldn’t deal with this anymore. “Are you ready?”\\n\\n “Just a few more minutes.”\\n\\n This was the second set of “Just a few more minutes.” I sat back, blowing out a long breath, and started counting the red squares on some dude’s flannel jacket. I’d already memorized the Christmas song they’d been playing over and over.\\n\\n I glanced at Blake. “I’m really ready to go home.”\\n\\n Annoyance flared in his hazel eyes, turning the flecks of brown dark. “I thought you’d enjoy getting out and just chilling.”\\n\\n “I am, but we’re sitting here, not even talking to each other, while you play some pig-poking game on your phone. Seriously not a fun time for me.”\\n\\n He propped his elbows on the table and rested his chin in his hands. “What do you want to talk about, Katy?”\\n\\n My irritation rose at his tone. “I’ve been trying to talk to you about all kinds of topics for over an hour.”\\n\\n “So, doing anything for Christmas?” he asked.\\n\\n Taking a deep breath, I reined in my temper. “Yeah, Mom is actually off for once. We’re doing something with Will.”\\n\\n “The doctor? Sounds like they’re getting pretty serious.”\\n\\n “They are.” I pulled my sweater closer, shivering as the door opened. “I’m pretty sure that’s the only reason why—”\\n\\n Blake’s phone dinged, and he immediately checked it out. Annoyed, I clamped my mouth shut and stared at the empty table behind him. “You ready?” he asked.\\n\\n Thank freaking God. I grabbed my purse and stood, walking out without waiting for him to pick up the check. My boots crunched over the packed snow and ice. As soon as November had rolled around, all it did was snow an inch or two every few days. It was like one giant prelude to a blizzard.\\n\\n Blake joined me a couple minutes later, frowning. “Way to wait.”\\n\\n I rolled my eyes but said nothing as I climbed into his truck. We headed back onto the road in silence. Arms folded tightly across my chest, I felt like a pissy girlfriend, which was so wrong. We weren’t like that, but it was as if we’d just had the date from hell.\\n\\n And to make everything worse, he was driving at the speed of Grandma. My leg bounced with annoyance and impatience. I just wanted to go home. There would be no training tonight. I was going to pick up an effin’ book, and I was going to read for fun. Then I would blog. I would forget about Blake and this stupid, craptastic alien power. My gaze dropped to my boot. There was something on the floor, hard and slender under the thin soles of my boot. Moving my foot to the side, the passing highway lights reflected off something gold and shiny. Curious, I started to bend down.\\n\\n The obsidian flared under my sweater without any warning at the same moment Blake swerved the truck off the road and into a ditch.\\n\\n Swinging toward him, my heart raced as the heat from the obsidian seared my skin. “There’s an Arum nearby.”\\n\\n “I know.” He killed the engine, jaw tight. “Get out of the truck, Katy.”\\n\\n “What?” I shrieked.\\n\\n “Get out of the truck!” He reached over, unhooking my seat belt. “We’re training.”\\n\\n Realization set in, hard and frightening. I let out a shaky breath as the obsidian continued to increase in heat. “You brought me out of the safety of the beta quartz on purpose!”\\n\\n “If your strongest abilities are attached to your emotions, then we need to find out how to tap into them when you’re feeling all emotional to see what you can do, then practice with less excitement. Like we did with the knife and then pillows.” He stretched over farther and opened my car door. “Arum can sense us better than they can the Luxen. It’s the DNA thing. Luxen have a built-in cloaking in their DNA. We don’t.”\\n\\n My chest rose and fell quickly. “You never told me that before.”\\n\\n “You were safe within the beta quartz. It wasn’t an issue.”\\n\\n I stared at him, horrified. What if I had left with my mom to go shopping out of the radius without knowing this? We would’ve been attacked. Did Blake even care about my safety?\\n\\n “Now get out,” he said.\\n\\n Obviously not. “No! No way am I going out there with an Arum! You’re a crazy—”\\n\\n “You’re going to be okay.” He sounded as if he were telling me to give a speech in front of a class and not face a murderous alien. “I’m not going to let anything happen to you.”\\n\\n Then he got out of the car, disappearing into the thick tree line and leaving me alone in the truck. Too stunned to move, I stared at the encroaching darkness. I couldn’t believe he’d done this.\\n\\n If I survived tonight, I was going to kill Blake.\\n\\n An inky shadow glided over the road and followed the trail Blake has walked into the woods. A burst of light exploded, filling up the sky, but was quickly snuffed out as I heard Blake’s pained scream.\\n\\n Scrambling out of the truck, I slammed the door shut and squinted into the darkness. “Blake?” After several moments of no answer, panic clawed up my throat. “Blake!”\\n\\n I stopped at the edge of the woods, wary to enter them. Clutching my sweater close, I shivered as an unnatural silence settled around me. Screw this. Turning around, I headed back to the truck. I’d call my mom. I’d even call Daemon. There was no—\\n\\n A shadow pooled in front of the passenger door before I could take another step. Dark and oily, it built onto itself until an outline of a man blocked my path.\\n\\n “Crap,” I whispered.\\n\\n It took the form of a human male, a startling resemblance to the one we’d seen outside of Vaughn’s house. “Hello, little one. Aren’t you something...special?”\\n\\n Spinning around, my sweater flapped like wings behind me as I took off. I ran fast—faster than I’d ever run before. So fast that the little flakes of snow the biting wind pelted against my cheeks felt like tiny pebbles. I wasn’t even sure my feet were touching the ground.\\n\\n But no matter how fast I ran, the Arum was faster.\\n\\n A dark, murky shade appeared beside me and then in front of me. Sliding across snow and ice, I grabbed for my obsidian. Ready to shove the point into whatever part my hand landed on. \\n\\n","sourceLink":"https://allnovel.net/onyx-lux-2/page-38.html","bookId":1662,"book":{"id":1662,"title":"Onyx (Lux #2)","description":"Storyline: Onyx (Lux #2) \\n Being connected to Daemon Black sucks… \\n Thanks to his alien mojo, Daemon’s determined to prove what he feels for me is more than a product of our bizarro connection. So I’ve sworn him off, even though he’s running more hot than cold these days. But we’ve got bigger problems. \\n Something worse than the Arum has come to town… \\n The Department of Defense are here. If they ever find out what Daemon can do and that we\u0027re linked, I’m a goner. So is he. And there\u0027s this new boy in school who’s got a secret of his own. He knows what’s happened to me and he can help, but to do so, I have to lie to Daemon and stay away from him. Like that\u0027s possible. Against all common sense, I\u0027m falling for Daemon. Hard. \\n But then everything changes… \\n I’ve seen someone who shouldn’t be alive. And I have to tell Daemon, even though I know he’s never going to stop searching until he gets the truth. What happened to his brother? Who betrayed him? And what does the DOD want from them—from me? \\n No one is who they seem. And not everyone will survive the lies…\\n","cover":"https://allnovel.net/images/onyx-lux-2.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/onyx-lux-2.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:00:44 PM"}}
