{"id":77648,"no":15,"title":"Page 15","content":"While they say a mind is a terrible thing to waste, they neglect to mention that a body is a terrible thing to waste also. Especially when it’s a body like Jason’s. My husband’s past gorgeous and way past fine. In fact, I can’t even think of a word that would do him justice. He’s a far cry from the little knucklehead I got in a fistfight with the day we met. To make matters worse, he has a scrumptious dick. He just doesn’t know how to use it. I had been working after school part-time at a fast food joint, and Jason worked with the county recreation department. We both had plans to attend college, and one of us did—Jason. I chose to pursue full-time employment as an administrative assistant and worked for a dentist’s office all the way through my pregnancy. Jason had a full basketball scholarship to State, and we stuck with that plan. His major was architecture, of course. The times he was out of town at away games were dismal, but Brina and my mother tried their best to keep me in good spirits. As horrible as our sex life was, the little bit of satisfaction I was garnishing from being close to Jason was unavailable when he was away. In fact, the further I got into my pregnancy, the more sexually repressed I became, and desperation set in.Simple masturbation was no longer good enough, so I began to play with toys. You name it, and I had it hidden away in a box on a closet shelf where Jason couldn’t find it— everything from a dildo to a vibrator to Ben Wa balls. My fascination with sex was quickly turning into an obsession. “Jason!” “Yes, Boo?” He was holding my hand, caressing it gently and using his other hand to dab the sweat away from my forehead with a moistened towel. “Jason!” “Yes, Zoe?” “I fucking hate you!” I pushed his hands away from me and tried to get up off the hospital bed so I could kick his ass, but the next contraction set in and kicked my ass from the inside out instead. “Zoe, just calm down and do the breathing exercises they taught us in Lamaze class!” He came toward mewith all the pampering nonsense again and started taking short, quick breaths, as if a demonstration was going to make the pain go away. “Jason, I hate you and I hate the fucking doctor and I hate all the fucking nurses!” I paused just long enough to clench my teeth and push. The pain was excruciating, ten million times worse than I ever imagined it would be. I leaned up a little off the pillow, looking like a whale trying to do a sit-up, so I could look my doctor in the eye while he sat between my legs messing with my coochiecoo. “Dr. Henry, I fucking hate you!” They all laughed at me, even Jason. The nerve of the bitches! Everyone, including my mother, had warned me about labor. They warned me it is the closest to death a woman could ever come. If they weren’t speaking the Gospel, then there isn’t a dog in the entire state of Georgia. The Lamaze teacher had cautioned all the fathers that their wives or girlfriends might be a bit angry at them during labor. Poor Jason had to feel my wrath, because I was past angry. I was ready to kill his ass for putting something so big in me, I was going to have to rip my ass open to push it out. The Lamaze teacher also told the women to bring a stuffed animal or some other comforting item in the delivery room to soothe their thoughts during labor. Jason bought me a huge, stuffed brown teddy and named him Casanova Brown. Jason retrieved it from a chair in the corner and brought it over to me. “Look, baby, Casanova wants to keep you company.” He started moving the bear around, like it was dancing the jig. Trying to focus on the damn thing made me nauseous. I grabbed the stupid-ass bear from Jason and threw it so hard, it hit a nurse in the head who was walkinginto the room. Then I slapped Jason upside his fucking head. The rest of the delivery went about like that. I repetitively cussed everyone out and didn’t care what they thought about it. It’s amazing that even the shyest woman doesn’t care how many people are staring at her pussy like a bull’s-eye on a target during labor. At least a dozen people were in and out the delivery room, and I didn’t give a rat’s ass. Seven hours and fifty-six stitches later, unto us a son was born—Peter Jason Reynard, given the first name of my father, just like Jason and I had always planned. Once I heard all the stats—6 lb. 11 oz., 21 inches long, 10 fingers, 10 toes, and healthy—I was satisfied and passed out. I woke up in the recovery room with Jason rubbing my tummy, probably glad as hell my shape was back ’cause making love to a blue whale, even for only two minutes at a time, must’ve been kind of frustrating. “I love you, Jason!” I caressed the side of his face, the same side I had slapped the shit out of during labor, with my right hand. “I’m so sorry I said I hated you and even more sorry I hit you!” He started laughing. “I know you love me, Boo, and this is forever.” “Always has been! Always will be!” We kissed for a few moments, and then he climbed beside me on the bed, since we could both fit on that bad boy, and fell asleep in my arms. The nurse woke us up a while later so she could check my vitals. After the birth of our son, several landmark events took place in our lives, some very good and some very bad, but together, we always came out on top.The first emotional upset came about when Jason’s mother found out she had breast cancer. His father retired from his state government job, using the early-out option, and they moved to North Carolina, where they’re both originally from. Then, my mother turned around and married Aubrey. I was devastated but had no choice except to live with it. I didn’t have a clue things between them were that serious and was totally shocked when she showed up at my apartment sporting a ring. No sooner had I recovered from that quandary when my Boo got hurt in a game and tore the ligaments of his knee to shreds. Instead of having one baby to take care of, I had two, one little and one big. Both of them as cute as they could be. I used to take pictures of Jason and Peter while they were sleeping, the baby lying comfortably on his daddy’s chest, their heartbeats as if synchronized. Watching the two of them on the bed together gave me the idea of starting Shades. Shades is my corporation. It started out on a wing and a prayer but grossed me over half a million dollars last year. Watching my son fast asleep on his father gave me the idea to make my own calendar celebrating the role of the African-American father. So many African-American women are raising their children alone, it’s a blessing to see a man living up to his responsibility. I borrowed some money from my new stepfather, who has a small contracting company, found some people willing to pose for a small stipend, and made a calendar for the following year. The cover had a photo of Jason and Peter with bare chests and sporting Atlanta Braves baseball caps. Using the computer Jason’s parents bought him for his college studies, I began to advertise them on the Internet, and the most miraculous thing happened. They sold like hotcakes. I didn’t make a fortune the first year, but I made enough for us to get by between the calendar and my job at the dentist’s office. Jason was able to keep his scholarship, even though his career as a ballplayer was over, and the high school we attended, Central, hired him as their head basketball coach. It worked out very well because he could attend college in the morning and coach once school let out in the afternoon. The second year I put out three calendars: one with African-American fathers and children, one with African-American families, and an African-American swimsuit calendar featuring some coeds from the university.Business really picked up then. I started my business at a time when calendars that portrayed beautiful African-American women were few and far between. It was like selling bottles of ice-cold spring water to people stranded in 110-degree desert heat. To make a long story short, every year Peter grew, so did our bank account. We moved out of our apartment and rented a three-bedroom house so I could use one room as a home office. The following year Jason graduated summa cum laude and got a great job with the top architectural design firm in the city. When Peter was five, Jason kept the promise he made on our prom night and built my dream house. It’s a 4,500-square-foot, five-bedroom, four-bath cul-de-sac in a new development and it has over two dozen skylights in it so I can see all the stars. We were still decorating when I got pregnant again. When Dr. Henry said the wordtwins, I wanted to faint but had to maintain my composure long enough to hold Jason up when he practically passed the hell out. The shock wore off, and the excitement took over. We turnedone of the guest bedrooms into a nursery and began shopping for two of everything. Of course, when I went into labor, I was ready to kick everyone’s ass again. This time Jason was prepared for battle and wore a baseball umpire’s mask, more as a joke than for protection. I must admit the mask was mad funny and helped keep my mind off the horrific pain. He also brought in reinforcements the second time around, begging my mother to stay in the delivery room and be his tag-team partner. Somehow, I managed to push Kyle Michael and Kayla Michelle out, instantly making our family unit expand from three to five. After a brief recuperation period, I got back to business and decided to market more than just calendars on the Net. I became an African-American arts dealer, marketing all types of artwork from up and coming artists who had the vision but lacked the sales ability.","sourceLink":"https://allnovel.net/addicted/page-15.html","bookId":1847,"book":{"id":1847,"title":"Addicted","description":"Storyline: The New York Times bestseller Adapted into a major motion picture distributed through Lionsgate From the Queen of Erotica, Addicted tells the provocative story of one married woman’s struggle to deal with the fall-out of her forbidden desires. The world of Addicted is continued in the New York Times bestseller Nervous, and Zane’s highly-anticipated upcoming novel Vengeance, available May 24, 2016. For successful businesswoman Zoe Reynard, finding the pleasure she wants, the way she wants it, is not worth the risk of losing everything she has: a charmed marriage to her childhood sweetheart, a thriving company, and three wonderful children. But Zoe feels helpless in the grip of an overpowering addiction…to sex. After finding a compassionate therapist to help her, Zoe finally summons the courage to tell her torrid story, a tale of guilt and desire as shocking as it is compelling. From the sensitive artist with whom she spends stolen hours on rumpled sheets, to the rough and violent man who leads her toward destruction, Zoe is desperately searching for fulfillment—and, perhaps, something darker and deeper. As her life spins out of control and her sexual escapades carry her toward a dangerous fate, Zoe races to uncover the source of her “fatal attraction.” Chilling secrets tumble forth and perilous temptations build toward a climax that could threaten her sanity, her marriage…and her life.","cover":"https://allnovel.net/images/addicted.jpg","author":"Zane","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/addicted.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:37:59 PM"}}
