{"id":77654,"no":21,"title":"Page 21","content":"“Not a problem, Zoe. I can call you that, right?” “Please do, Quinton.” Damn, on a first-name basis already! I wondered if that meant hellified sex was right around the corner. I was leaving, trying to get out of there before my mind went even further into the gutter than it already was, when he grabbed me around the waist from behind and spoke softly in my ear. “You cannot begin to imagine the things I want to do to you.” He took my earlobe into his mouth, small hoop earring and all, suckling on it for a brief second until I freed myself from his grasp. I hauled ass toward the door, face flustered and heart pounding so hard in my chest, I could actually hear the echo of it ringing in my ears. I glanced back at his fine ass one last time. He was still staring at me. He held my business card up to his well-defined lips, smelled it like it had been hand-dipped in fine perfume, and used it to blow me a kiss. I daydreamed about him all the way to the twins’ day-care center, more worried about what might not happen the next morning than what might.I got home, threw a couple of Cornish hens in the oven, told Peter to go do his homework, popped a cartoon video into the great room VCR for the twins, and then went to my bedroom and locked the door. I laid there on the bed, fantasizing about Quinton Matthews while I masturbated and hoped I would cum before Jason got home. I came three times in twenty minutes and would’ve cum at least three more if Peter hadn’t knocked on the door, informing me that he’d broken the lead of his pencil and couldn’t find his pencil sharpener. chapterthirteen “Jason,” I whispered, trying to wake him up gently by rubbing him on the shoulder. Still half asleep, he answered. “Yes, Boo?” “I need to talk to you.” He opened one eye, sat up just far enough to glance at the alarm clock on my side of the bed. “Zoe, it’s three in the morning. Can’t this wait till later?” “No, not really.” It was storming that night. One of the worst lightning storms of the season, and the weather center had issued a flash flood warning. The lightning was coming in from all directions and appeared to be dancing on the carpet. I couldn’t fall asleep if my life depended on it. I was like a bitch in heat. My pussy was feenin’ for some action. Jason took a deep breath and propped himself up on his pillow. “You wanna talk? Okay, let’s talk. ’Sup, Boo?” “I want to make love.” He sighed. “Zoe, we made love less than three hours ago. Can I just get some sleep, please?” He turned over on his stomach, his head facing away from me. “I have an early day tomorrow, baby.” What I should’ve done, at that moment, is tell my husband the freakin’ truth. I should’ve told him that, even though I love him and would take a bullet for him, I needed him to be more sexually open and willing to try new things. I should’ve suggested we seek counseling. I should’ve told him I started masturbating way back in junior high school and had been doing it ever since. I should’ve told him about all the sex toys I had hidden all throughout the house and at my office. I should’ve demanded he try harder to fulfill my needs and desires. I should’ve forced him to listen to me for a change instead of just brushing me off whenever the conversation turned to sex. Instead, I lay there listening to the thunder, watching the rain and lightning, and praying I wouldn’t get into trouble the next morning when I went to discuss business with Quinton Matthews. I knocked even though the door was already ajar. “Mr. Matthews?”“Come on in, Zoe!” I entered his studio, which doubled as his apartment, at exactly nine sharp. I didn’t see him, but I could hear him moving around in the loft upstairs. “Hello. Good morning. Am I too early?” “No, right on time.” He appeared at the top of the steps with nothing on but a pair of silk pajama pants. He was wiping the last of some shaving cream off his face with a towel when he came down the steps to join me. “Care for some coffee?” “I’m fine, thanks. I have enough nervous energy already. I don’t need caffeine to exacerbate it.” “You’re just a little Energizer bunny, huh?” I smiled. “Yes, but I hardly ever wear pink and I don’t own a drum.” We both laughed, and then he motioned me toward the leather sofa. “Have a seat, Zoe.” I sat down, putting my briefcase on the marble coffee table in front of me. I made sure I brought enough information with me to try to sell his ass on the idea the first time around. “Well, you may have natural energy, but I need some coffee. Be right back.” I watched him walk into the kitchen and then took a quick survey of his place. It was awesome. I assumed he was buying the space, because just about every wall had a mural on it. They were all magnificent, and he had a set of crates covered with black velvet in one corner. I figured they were used for people to sit on and pose while he spent hours on end painting their portraits. I noticed there was a canvas on the easel and decided to be nosy. I went over, lifted up the oilcloth covering the piece, and looked at it. I was surprised to discover it was a portrait of the governor. The state must have commissioned him to do it for the state capitol building. Quinton made him appear so lifelike, it was unreal. The studio was located on the top floor of an old department-store warehouse downtown, which had been renovated and turned into huge lofts. There was only one other tenant on his floor, located at the other end of the hall. “Hmm, inquisitive too. I like that in a woman.” I didn’t notice he had returned with a steaming hot mug of coffee in his hand. “Sorry.” I replaced the cloth. “I guess I was a bit out of line. It could’ve been a portrait of your woman or something like that.” “Well, for future reference, I don’t have a woman.” He started looking me up and down again. “At least, not yet.” I turned toward the window, away from him, so he wouldn’t see me grinning from ear to ear. “Oh, wow!” “Oh wow, what?” I walked closer to the window so I could get a better look. “The mural you painted at the MARTA station. It’s right across the street.” “Yes, it is. In fact, that’s how I came across this condo. They were renovating the building while I was working on the mural, and well, you know the rest.” “Cool. I didn’t realize you were right across from it. I go there a lot and eat lunch, but I approach it from another direction.” He took a sip of his coffee, so close to me by that time, I could hear him gulp it down. “Why do you go there and eat lunch? I didn’t know they had a restaurant over there. Unless you include the hot dog vendors on the corner.” I giggled and looked back at him. The sunlight was hitting his green eyes, and I almost fainted.“Very cute! No, they don’t have a restaurant. It’s just that my office is not that far away, and I love the mural, so I walk over here and eat the lunch I bring from home. Walking is good exercise.” “From where I’m sitting, you don’t need any exercise.” “Well, since you’re standing and not sitting, I’ll take that as an almost compliment.” I brushed past him, catching a whiff of his aftershave and the soap residue left over from a shower he obviously took before my arrival. “Shall we get down to business?” I sat down on the sofa, opened my briefcase, andstarted pulling out the presentation folder I had rushed to prepare that morning, since I had no idea he would agree to see me the very next day after we met. “Hold up.” He put his hand on top of mine, pushing the folder back into the briefcase. “Basically, you want to take some of my works, turn them into marketable, affordable prints, and then sell them through your arts business?” “Yes, that’s exactly what I want to do. Now, if you’ll allow me to show you some figures I worked out, we can—” “Don’t worry about it. I trust you, and we can do this.” “Huh?” I was shocked. “You’re agreeing to it just like that?” “Yes. I made some phone calls last night and checked you out. It’s all good. Anyway, I’ve been thinking of doing a venture like this for quite some time.” I was ecstatic and had to keep myself from jumping up and doing cartwheels. “Well, I don’t know what to say.” “Say it’s a deal, and we can work on all the figures at a later date.” I reached for his hand to shake it. “Deal!” He held true to form and kissed it instead. “Well, I’m sure you have a lot to do today, so I’ll get out of your way. Thanks so much for the opportunity to market your work for you.”","sourceLink":"https://allnovel.net/addicted/page-21.html","bookId":1847,"book":{"id":1847,"title":"Addicted","description":"Storyline: The New York Times bestseller Adapted into a major motion picture distributed through Lionsgate From the Queen of Erotica, Addicted tells the provocative story of one married woman’s struggle to deal with the fall-out of her forbidden desires. The world of Addicted is continued in the New York Times bestseller Nervous, and Zane’s highly-anticipated upcoming novel Vengeance, available May 24, 2016. For successful businesswoman Zoe Reynard, finding the pleasure she wants, the way she wants it, is not worth the risk of losing everything she has: a charmed marriage to her childhood sweetheart, a thriving company, and three wonderful children. But Zoe feels helpless in the grip of an overpowering addiction…to sex. After finding a compassionate therapist to help her, Zoe finally summons the courage to tell her torrid story, a tale of guilt and desire as shocking as it is compelling. From the sensitive artist with whom she spends stolen hours on rumpled sheets, to the rough and violent man who leads her toward destruction, Zoe is desperately searching for fulfillment—and, perhaps, something darker and deeper. As her life spins out of control and her sexual escapades carry her toward a dangerous fate, Zoe races to uncover the source of her “fatal attraction.” Chilling secrets tumble forth and perilous temptations build toward a climax that could threaten her sanity, her marriage…and her life.","cover":"https://allnovel.net/images/addicted.jpg","author":"Zane","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/addicted.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:37:59 PM"}}
