{"id":77636,"no":3,"title":"Page 3","content":"I was playing hopscotch about an hour later when he came out of his house, stood on the curb on his side of the street, and started talking trash. “You know what? I hate you and I hope all your hair falls out and you get red pimples all over your face!” I stopped hopping on number six with my right foot up in the air, gave him an icy cold look, and decided to pay his ass back for the comment. “Oh, yeah? Well, I hate you too, and I hope the next time you shoot that cheap rocket of yours, it gets stuck up your behind!” As an afterthought, I added, “And I hope your itsy bitsy dang-alang falls off too!” I held up my pinkie finger to emphasize the point, and he left the curb, on his way over to my side of the street to finish off the fistfight we started the Saturday before. I was about to meet him in the middle when my mother opened up the front door. “Zoe, get in here and get washed up for dinner! Now!” Walking away, I placed my hands on my hips and strutted like Greta Garbo. I turned around and addressed him with my best voice imitation. “Next time, Big Boy!” I left his cross between Chewbacca fromStar Warsand Scooby Doo ass standing right there in the street withhis hands balled into fists and a look of hatred on his pathetic face. I tried to keep my distance from Jason, other than in school, but my daddy wasn’t making it easy for me. For some odd reason, the two of them bonded. Maybe it was because Jason’s daddy was always working, or maybe it was because my daddy was good with his hands and Jason admired the way he fixed things around the house and made furniture out of wood as a hobby. Whatever it was, I didn’t like or appreciate them being buddy-buddy at all.I was up in my bedroom one Saturday morning, sorting out my record collection and singing my ass off, when my mother yelled for me to come down. I had just taken “The Best of My Love” by the Emotions off the turntable. I was about to pull my shades down and throw on “ Flashlight” by Parliament Funkadelic and dance around my room, making circles on the walls and ceiling with the Maglite my daddy gave me when my mother interrupted my flow. “Zoe, can you come down here for a second?” Her voice carried well up the stairwell, and I knew she deliberately waited for a break in the music to call for me. It was a regular routine. “Okay, Momma. I’ll be right down.” I muttered under my breath while I gathered the dirty clothes out of my wicker hamper and tossed them in a laundry basket. It was laundry day, and I hadn’t done a thing, so I lugged my clothes downstairs with me in order to save myself a return trip. As soon as I turned the corner into the kitchen, my eyes lit up as I spotted the ice-cold pitcher of freshly squeezed lemonade and the cookie sheet of chocolate chipcookies with Hershey’s Kisses hidden inside cooling on the stove. “Momma, you made my favorite cookies!” I let the laundry basket drop on the floor and gave my mother a huge, elephantine hug. “You’re the most spantacular, bomb-diggity, coolest mother in the whole wide world.” She let out a slight giggle and then gently pushed my hands away. “Zoe, quit before you make me spill the lemonade.” “Sorry, Momma.” I licked my lips, dreaming about how delectable the cookies were going to taste hitting my throat, and decided to earn some brownie points so I could sneak a couple before dinner was ready. I retrieved my laundry basket and headed toward the basement steps. “I’m going to go ahead and put my clothes on, and then maybe I can help you with the other cleaning like vacuuming or polishing the furniture.” My mother walked over to me, wiping her hand on the bib of her apron, and placed her right palm over my forehead, checking for a fever. “Is this my child?” she asked sarcastically. I grimaced. “Yeah, Momma. I’m just trying to do my share around here.” She gleamed at me. “Good, do me a favor before you go downstairs.” She took two glasses out of the cabinet and poured some lemonade in them. Then she put four cookies on a saucer and placed everything on a wooden tray. “Take this lemonade and cookies out to the garage for your daddy and Jason.” “Jason? What the hell, I mean heck, is he doing over here?” I felt a sudden tension in the back of my neck, hotter under the collar than the pot of white potatoes my mother had simmering on the stove for dinner. “Why does he have to come over here all the time?” “First of all, Miss Thing,” my mother scolded me, “Jason isn’t over hereall the time.Your daddy’s helping him build a go-cart.” “A go-cart?” That did it! “I asked Daddy to help me build a tree house like fifty million times, and he hasn’t done it yet.” v style\u003d\"text-align:center; padding: 15px 0;\"\u003e","sourceLink":"https://allnovel.net/addicted/page-3.html","bookId":1847,"book":{"id":1847,"title":"Addicted","description":"Storyline: The New York Times bestseller Adapted into a major motion picture distributed through Lionsgate From the Queen of Erotica, Addicted tells the provocative story of one married woman’s struggle to deal with the fall-out of her forbidden desires. The world of Addicted is continued in the New York Times bestseller Nervous, and Zane’s highly-anticipated upcoming novel Vengeance, available May 24, 2016. For successful businesswoman Zoe Reynard, finding the pleasure she wants, the way she wants it, is not worth the risk of losing everything she has: a charmed marriage to her childhood sweetheart, a thriving company, and three wonderful children. But Zoe feels helpless in the grip of an overpowering addiction…to sex. After finding a compassionate therapist to help her, Zoe finally summons the courage to tell her torrid story, a tale of guilt and desire as shocking as it is compelling. From the sensitive artist with whom she spends stolen hours on rumpled sheets, to the rough and violent man who leads her toward destruction, Zoe is desperately searching for fulfillment—and, perhaps, something darker and deeper. As her life spins out of control and her sexual escapades carry her toward a dangerous fate, Zoe races to uncover the source of her “fatal attraction.” Chilling secrets tumble forth and perilous temptations build toward a climax that could threaten her sanity, her marriage…and her life.","cover":"https://allnovel.net/images/addicted.jpg","author":"Zane","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/addicted.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:37:59 PM"}}
