{"id":77663,"no":30,"title":"Page 30","content":"Tyson and I kicked it for about ten minutes, just shooting the breeze. He asked me if I wanted a drink, Itold him no thanks, and then he decided to cut the bullshit. “Take off your dress.” “Excuse me?” “I said take off your dress.” He was sitting on a dining room chair, and I was standing over by his entertainment center, looking at some family photos. I should’ve cussed his ass out and left, but I reached behind my back and unzipped my gray casual dress instead. I lowered it off of my shoulders, stepped out of it, and ended up standing there only in my black slip, panties, and black leather, low-heel pumps. “Come over here.” He spread his legs open and patted his right thigh, motioning for me to sit on it. “Damn, aren’t you the assuming one, and demanding too! Sheeesh!” I was talking junk but walking over toward him at the same time. “I’m not assuming anything. I’m just not into playing games. We both know why you’re here, woman, so come and get what you came for.” I decided if he could be off the hook, I could be off the hook too. My nymphomaniac evil twin woke up and took over. “Don’t mind if I do.” I sat down on his leg and started rubbing his crotch. “Ummm, damn, is he hard for me already?” “He stays hard. Take him out and put him in your mouth.” “Hmph, I think not.” I removed my hand. “You do me first.” “Oh, so it’s like that, huh, Miss Zoe?” “Damn straight. No licking, no sticking.” He grinned as I got up off his leg and climbed up on the table. He stood up just long enough to turn his seat around so he was facing me. “Ummm, okay, I’ll play along with your little game.”He raised up my slip and started trying to pull my panties down, but I wouldn’t lift my hips so he could get them over my ass. I grabbed his face with my hands and slipped him the tongue. It was a brief, rough kiss, but I was in the mood for something rough for a change. When we came up for air, I instructed him, “Rip my panties off!” As big and strong as Tyson was, he had to exert little effort tearing them bad boys off. He tossed them on the floor, stood up, and started kissing me again, pressing my back onto the table’s cold metal surface. He decided to take it to the bridge and ripped the straps off my slip too, pulling the nylon material down over my ribcage so he could grab both my breasts at the same time and bite gently on my nipples. I grabbed the back of his head, bringing his mouth closer into my breasts. He pushed them together, taking both nipples into his mouth at the same time so he could suckle on them. He licked a trail with his tongue from my nipples down the middle of my stomach to my belly button, pausing there to dip his tongue in it and then blowing on it to make his saliva dry up. Damn, that shit turned me on! He spread my legs open and went to work on my pussy. Tyson’s technique was different from Quinton’s. He bit on my clit, and while it was painful, it made me cum almost immediately. I was discovering yet another part of my sexual desires I never knew existed. I discovered I liked it rough. That fact became even more obvious when he made me sit in a chair while he held my head and plummeted his dick in and out my mouth. I thought his dick was going to knock all of my front teeth out at one point. He was working his thang in and out my mouth so fast, but Iheld my own and sucked him until he came. His cum had a different taste than Quinton’s. It was more salty. Once I realized that every man’s cum had a distinctive taste, I began to wonder what Jason’s cum would taste like. The man I wanted to taste the most wouldn’t let my mouth anywhere near his dick. “I have to go!” Tyson had just exploded in my mouth, and there were still a few droplets of cum trickling out the sides onto my chin when I blurted it out. He looked at me like I had lost my fuckin’ mind. “You’ve got to be kidding!” “No, I really do have to go.” I got up from the chair and headed toward the door. Looking back at it now, I don’t know what my issues were, but I definitely had some. It was almost as if I thought oral sex wasn’t actual cheating or something. Like with what I did with Quinton in the beginning, I intended to leave it at oral sex and go home. But Tyson wasn’t even going out like that. I was standing on the backside of his couch, putting my dress back on, opting to ditch the torn panties and slip at his place, when he came up behind me and pushed me over the back of the couch so my head ended upside down and my feet were dangling off the floor. “Tyson, stop!” “Sure, I’ll stop when I’m done.” I tried to get up, but he was too strong and forced me to stay bent over while he stuck his dick in my pussy from behind. He fucked the living daylights out of me, and there was no point in saying it wasn’t what I really wanted. The streams of cum and pussy juice trickling down my inner thighs onto the floor told the true story. He fucked me so hard, I could feel his balls slamming up against the back of my thighs while he pumped his dick in and out of me. When it was all over and he hadbusted his second nut, he let me down. I finished getting dressed, and we were both breathing like we had just crossed the finish line in a twenty-six-mile marathon. I had never been turned out in such a fashion. After I got my shoes on, I headed for the door. “Hold up, Zoe. I know you’re married and all, but do you have an office number where I can reach you? I want to see you again.” I opened the front door of his apartment and glanced back at him sitting on the couch, still trying to catch his breath. “No, I’m a housewife. I don’t have an office number.” “Pager? Cell phone?” “No, none of that.” My ass was lying big-time, but keeping my anonymity was the one bright side to the whole fucked-up situation. Tyson only knew me as Zoe,and that’s all his ass needed to know. “So, will I see you again?” “I’ll be in touch!” With that, I left his place, got in my car, and drove home. Jason still had a couple of friends over when I arrived home. The game was over, but they were sitting around drinking beers and talking about various player’s career statistics. He waved at me as I came in. “Hey, baby. Have a good time with Brina?” “Yes, we had a nice, long talk.” Yet another lie! I was getting too good at fabrication. Before Jason could get up to come over and give me a kiss, I told him I was going upstairs to take a hot shower because my back was sore. I didn’t want him to smell sex on me, and besides, my back and everything else was sore from being fucked so hard. When he came to bed later that night, I was asleep, but he woke me up to have sex. I was ecstatic—he was the only man I ever truly wanted in the first place. Asusual, he just used me to do his do, and when I tried to go down on him, he refused me once again. I decided to tell him the truth about what happened with Brina. Well, kind of. I conveniently made it sound like I stayed there for hours after Dempsey left, comforting her, when that wasn’t even the case. However, the black eye was pure fact, and Jason told me to stay away from the stupid bitch if she was dumb enough to let herself be beat like that. I ended up having to listen to the all-your-friends-are-sluts speech, but I fell asleep in the middle of it. chaptereighteen “Mrs. Reynard, there’s a Quinton Matthews here to see you.” My secretary’s voice screeched out over the speaker on my desk. I was in the middle of drinking a cup of hot tea and almost spilled it on a pile of prints, new additions to the collection. I had decided not to use Quinton’s work because I knew the affair would eventually have to end, and I didn’t want anything tying us together when it did. I wanted the break to be clean, and as far as I was concerned, the affair ended the day I caught him with his dick all up in Diamond’s pussy. “Send him in, please.” I released the speak button on the intercom and wondered why the hell he would risk coming to my office when he could’ve called. I wasn’t about to confront him in the outer office. All I needed was some drama getting into the hands of gossipmongers. He stormed into my office like he owned the place and sat on the edge of my desk. “Zoe, why haven’t you called me or come by?” His ass was really trippin’, so I told him, “Your ass is trippin’. Why the hell do you think I haven’t?” “You tell me!” He started getting loud on a sistah. “Keep your voice down,” I insisted. “This is a business.” Once he calmed down and started breathing through his mouth again, I added, “You know why I haven’t called your ass. Get real! The last time I saw you, you were fucking the hoochie down the hall.” “I told you that was an accident.” He came closer to me, trying to give me a hug. “It’s all about you and me, Boo. You’re my girl.” “Get your fuckin’ hands off me!” I started getting loud my damn self.","sourceLink":"https://allnovel.net/addicted/page-30.html","bookId":1847,"book":{"id":1847,"title":"Addicted","description":"Storyline: The New York Times bestseller Adapted into a major motion picture distributed through Lionsgate From the Queen of Erotica, Addicted tells the provocative story of one married woman’s struggle to deal with the fall-out of her forbidden desires. The world of Addicted is continued in the New York Times bestseller Nervous, and Zane’s highly-anticipated upcoming novel Vengeance, available May 24, 2016. For successful businesswoman Zoe Reynard, finding the pleasure she wants, the way she wants it, is not worth the risk of losing everything she has: a charmed marriage to her childhood sweetheart, a thriving company, and three wonderful children. But Zoe feels helpless in the grip of an overpowering addiction…to sex. After finding a compassionate therapist to help her, Zoe finally summons the courage to tell her torrid story, a tale of guilt and desire as shocking as it is compelling. From the sensitive artist with whom she spends stolen hours on rumpled sheets, to the rough and violent man who leads her toward destruction, Zoe is desperately searching for fulfillment—and, perhaps, something darker and deeper. As her life spins out of control and her sexual escapades carry her toward a dangerous fate, Zoe races to uncover the source of her “fatal attraction.” Chilling secrets tumble forth and perilous temptations build toward a climax that could threaten her sanity, her marriage…and her life.","cover":"https://allnovel.net/images/addicted.jpg","author":"Zane","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/addicted.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 3:37:59 PM"}}
