{"id":20922,"no":12,"title":"CHAPTER XII DESERTED","content":"Pee-wee worked alone all that afternoon. Hope’s ready talent had transformed the outlandish rolling combination into a thing of gala beauty and he had only to clear out the interior and wrap bunting around the shaft and other parts which she had mentioned. He always prided himself on knowing all about girls, but her sudden desertion was something he had never seen the like of before. He was utterly staggered. But he was no quitter and he worked sturdily all afternoon. After an hour or more he saw the Ford returning with Hope and her mother and soon afterward saw it go away with no one but Everett Braggen in it. Everett did not bother to visit Pee-wee’s domain in these important comings and goings. But a little while before supper-time, Hope came tripping across the barnyard calling gayly, “Now I’ll help you some more.” “Are you going to go away?” Pee-wee asked grimly. “Yes, we’re going to stay at the Snailsdale House to-morrow, and you mustn’t forget to come up there and see us, and we’ll play croquet. They have a perfectly lovely croquet field.” “You needn’t help me,” said Pee-wee, as she took up a strip of bunting, “because I don’t want you to. Anyway, I bet they don’t have any better desserts at that house than they have here. I’m coming here every summer, I am. “You needn’t think I’m mad because you don’t want to be partners with me, because, gee whiz, you’re a girl and you’ve got a right to change your mind, that’s sure. But, anyway, you’re a quitter, that’s what you are. You let that feller scare you and make you think you can’t do a thing, and he can’t do things, that’s sure. If a feller wants to be a scout he doesn’t go to some other town and join but he starts a patrol in his own town and makes it a go. Do you think I can’t make this place a go? That shows how much you know about advertising. I wouldn’t run after fellers, but I’d make them run after me, because look at—at—at—look at John Burroughs—people used to go and see him way off in the woods and you bet your life he didn’t go running after people. You’re a quitter, that’s what you are! You’re a double quitter! And I’m going in the parade anyway and I’m going to have a lot of fun.” “You’re horrid!” she said. “And you’re just—you’re impudent and I don’t want to help you.” “Quitter, quitter!” taunted Pee-wee. His attitude of bravado seemed to relieve Hope of any stings of conscience which she might have felt, and at supper she talked blithely of the whirl of gayety at the Snailsdale House. She said that Everett Braggen was a perfect gentleman and that she was sure he would never call names. She spoke of the Russian pianist and of the “two perfectly lovely fellows” who were coming, and who were going to win the tennis match for the Snailsdale House. “And we’re going to have music and dancing and if we get the prize money for our float (as of course we will, for it’s going to be simply gorgeous) we’re going to send to New York for a perfect heap of dance records—they have hardly any two-steps at all now. And after it’s all over I told Mrs. Goodale that we’re coming down here again to this dear old place to rest up before going back to New York. We’re just going to lie around for a whole week.” Mr. and Mrs. Goodale said pleasantly that they hoped to see them again and that they supposed it was rather quiet at the farm. Sweet, motherly Mrs. Goodale said she reckoned young folks had to have their fling. She said that she trusted Hope’s ankle was all healed and that it would not interfere with dancing. “I’ve forgotten all about it,” said Hope. Which was undoubtedly true. “I tell this youngster he’ll hev ter make twice as much noise now so’s ter make up,” smiled Mr. Goodale, alluding to Pee-wee. Pee-wee had been so engrossed with his supper that he had paid no attention to the talk. He had said all he had to say on this subject. He now hastened the consumption of a piece of cake to acknowledge kind Mr. Goodale’s remark. “You leave it to me,” he said. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3045/84116.html","bookId":1029,"book":{"id":1029,"title":"Pee-Wee Harris in Luck","description":"简介： Whenever Pee-wee Harris was given the choice of two desserts he invariably chose both. This policy, which eliminated all possibility of vain regrets, had worked so well that he applied it on all occasions where a difficult choice was involved, on the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3045","creation":"Aug 1, 2019 12:24:12 AM","modification":"Aug 1, 2019 12:24:12 AM"}}
