{"id":20929,"no":19,"title":"CHAPTER XIX GOING DOWN","content":"Down, down, down, rolled the float, with its shaft bobbing after it. It plunged into hollows, it surmounted hubbies, it swayed and lurched, and groaned and creaked. It halted, it swerved, it almost stopped, then thought better of it, and plunged forward again. Scout Harris could see nothing but a milky whiteness all about him. The fog lay so heavy in this lower land that the runaway float seemed actually to cut a path through it. Suddenly it struck something and there was a medley of startled but familiar voices, the cackling of hens. The advancing caravan must have run down a lowly coop and trampled it under its gorgeous, imperial wheels. The released prisoners seemed to be scattering in panic all about. Then a board walk loomed up just ahead, the speed of the truant vehicle slackened, and it bumped into this obstacle, projecting the astonished Pee-wee forward upon the straw-covered floor inside. On that memorable late afternoon, Tony Sigliatto was sitting within his humble domestic establishment eating spaghetti, when suddenly the plate went sliding off the table, accompanied by a resounding crash, and the spaghetti was spread upon the floor. His first thought was that he was the victim of a concerted attack by the Black Hand and he looked about him for the remains of a bomb. Then he stole cautiously outside and beheld a sight which puzzled him but confirmed his worst suspicions. There stood Pee-wee, his bunting turban utterly demolished and streaming off his head, which gave him a rakish and abandoned look. But worst of all he was still gripping the patrol staff which he had reached for at the moment of his descent and from the end of this hung the pennant of the Raven Patrol, with its ominous black namesake printed with spreading wings upon it. And more darkly suggestive than that was the brown canteen with its ominous looking nozzle which Pee-wee always carried full of stale water. Tony gave one look at this infernal engine of destruction and poured forth the torrents of his wrath. “Hey, whata you do here? You getta de bomb! Hey, where de rest of you?” he inquired in great agitation, glancing fearfully into the wagon and then cautiously around the corner. “The rest of me is up there,” said Pee-wee. “I don’t know where it is—” “Hey, whata you gotta de bomb, hey! You blowa de house for de mon, spilla de spagett. What you do hey? Who maka you come? How you coma here, maka de big noise, whata you get huh, maka de trespass, you getta de jail, longa time—” To Pee-wee the word which stood out most conspicuously in all this was the word trespass. “Do you mean to tell me I stopped here on purpose?” he shouted. “Your house was in the way and it stopped me. Is this house on a road?” “Plenty de roada—” “If it hadn’t been for your house I’d have gone right through to the road,” Pee-wee said excitedly. “Do you think I wanted to roll down the hill? Do you think I’m to blame if this wagon got separated from the oxen? That shows how much you know about breaking the law, because I know all about it and a wagon can’t trespass all by itself and I was inside of it and I didn’t make it go so I’m not to blame either. Your house is just as much to blame as I am because anyway I don’t know where I’m at and I can prove it!” Either his finely conceived argument or his vehemence, seemed to impress the astonished Italian for he subsided to a less warlike attitude and seemed the more curious the more he inspected the gaudy meteor which had been precipitated into his premises. Perhaps the predominance (albeit disordered and bedraggled) of red, white and blue upon the float and its small passenger suggested to him that Uncle Sam was in supervision of this singular affair and he could not afford to trifle with that august friendship. “Hey, whata you do?” he asked. “You maka de big bunk, spilla de spagett, spilla de chickens, whata you maka, hey?” This seemed reasonable enough and Pee-wee shouted, “I’m here because I’m here and I don’t know what happened but if you see any oxen around here they belong to me and there’s another boy too. I was coming home from the parade and we kind of all of a sudden got cut in half. Maybe we got cut in three, because I don’t even know if he’s with the oxen, but anyway I’d like to know where I am.” “You maka de biga fall, hey? Quicka lika dat?” That was the idea exactly. They were getting together now. Tony must have had an inspiration. “Alla white lika de milk, can’t see, huh, you goa de whata you call, tumble, huh? Shoo. Disa der alla right, boss. You hava de good luck no banga de head. Shoo.” “I always have good luck,” Pee-wee said, “and anyway I’d rather be with this half, so that shows I’m lucky.” It was fortunate that this talk was pitched in deafening tones for these guided the faithful Simon to this scene of Pee-wee’s latest triumph. For a moment after their enforced parting he had been perplexed as to what he should do. And he acted, as usual, with plain common sense. He knew that if he left the oxen to their own devices they would probably reach the farm and that their arrival there would arouse the gravest apprehensions about his fate and Pee-wee’s. Tony poured forth the torrents of his wrath. On the other hand he must find Pee-wee lest his companion be injured. He therefore, drove the oxen as fast as he could make them go along the road till the slope had sufficiently eased to permit of driving them down. He had then driven in the direction of the voices and was greeted vociferously by Tony who knew him well, and who insisted that the travelers partake of spaghetti in his little makeshift home. The warm food tasted good to the adventurers, and after reuniting the essential units of their outfit and accepting the proffer of a nut from Tony’s miscellaneous junk heap, they set off upon their way. Returning up the hill at that point was quite out of the question and the safest thing to do seemed to be to find some way of getting to the lower road. You are to understand that Pee-wee’s float had collided with the rear of Tony’s abode. The front of the house faced a road but it was not the main road which ran through the valley. However, since Tony’s directions were not altogether clear, our travelers decided to follow this road and see where it would bring them out. To make sure that the road lay north and south and that they were heading south, Pee-wee made a critical inspection at the base of a tree in search of the guiding moss on its north side. He was rather surprised to find moss all around it, which seemed to prove that the magnetic pole had suddenly gone mad and started on a world tour. “Maybe it proves that the road goes every which way,” said Pee-wee with a sudden inspiration. “Maybe it proves that it goes around and around and around kind of.” In the light of their subsequent adventures this seemed likely enough.... \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3045/84123.html","bookId":1029,"book":{"id":1029,"title":"Pee-Wee Harris in Luck","description":"简介： Whenever Pee-wee Harris was given the choice of two desserts he invariably chose both. This policy, which eliminated all possibility of vain regrets, had worked so well that he applied it on all occasions where a difficult choice was involved, on the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3045","creation":"Aug 1, 2019 12:24:12 AM","modification":"Aug 1, 2019 12:24:12 AM"}}
