{"id":20916,"no":6,"title":"CHAPTER VI THE WOODS TRAIL","content":"Pee-wee swallowed his disappointment, trudging sturdily along in silence. The realization that something was going to happen and that he was not going to be in it was hard for him to bear. With one willing collaborator he could do anything. There was no one else about the place but Simon Hasbrook, the farm boy, who was always busy with his chores. Besides, Pee-wee liked Hope Stillmore; she was his pal.... Hope, on her part, seemed not to take his disappointment to heart. Perhaps she thought that with so many ideas bubbling up in his mind, he would soon think of something else. “Let me go ahead,” she said gayly, “and see if I can follow the trail.” So he let her pass him and she led the way along the narrow, all but indistinguishable path which wound through the woods. She seemed very graceful and pretty tripping along in her little pumps, the absurdest things for hiking, pausing now and then to make sure of the elusive trail and then tripping gayly on again in triumph. “You see I’m just as good on frontiers as I am on front porches,” she said. “You thought I was going to turn to the left, didn’t you? Little Smarty!” The almost obliterated path had probably once been used as a short cut through the woods. But a long period of disuse had reduced it to a mere line of least resistance through the dense foliage. In places its course was distinguishable only by the piles of dried brush, which had once been cut along the way, to make travel easier. These odds and ends of bushes and low-hanging branches had been gathered into little mounds at intervals. They looked like piles ready for burning. In places they were the only guide-posts. They must have been cut long since, for the surrounding growth showed no sign of pruning. Pee-wee, always curious, examined one of these brittle, interwoven mounds and found it dank and soppy underneath, with a multitude of repulsive little slugs darting about. He could lift the whole mass a little, like a mattress and see the bare, damp ground with its one or two blades of light green grass poking out of the over-rich earth. The slugs seemed aroused out of a lifetime of darkness and inertia. As Pee-wee dropped the mass, the brittle twigs cracked, and he heard a sort of continuation of this sound after the tangled mound had settled. The noise was not unlike the crackling of twigs but it seemed more continuous and aggressive than the passive sound of the subsiding debris. Something, he did not at the time know what, caused Pee-wee to start, then shudder. It was not that he knew the sound, for he did not; he thought it must be the natural sequel of the disturbance he had caused. Nor for a moment did he see aught. But that strange telegraphy which heralds things ghastly and mortal, touched the chords of his nature and he quaked and his blood ran cold. Then, suddenly he heard a piercing, agonizing scream....","sourceLink":"http://novel.tingroom.com/duanpian/3045/84110.html","bookId":1029,"book":{"id":1029,"title":"Pee-Wee Harris in Luck","description":"简介： Whenever Pee-wee Harris was given the choice of two desserts he invariably chose both. This policy, which eliminated all possibility of vain regrets, had worked so well that he applied it on all occasions where a difficult choice was involved, on the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3045","creation":"Aug 1, 2019 12:24:12 AM","modification":"Aug 1, 2019 12:24:12 AM"}}
