{"id":43137,"no":35,"title":"Chapter 9","content":"\"Ess, ma\u0027am? Many pranes! Big, big drir!\" The storekeeper stood beside her, offering her the package with a toothy smile that almost shut his eyes. His children stood behind him on the porch, pointing at the sky and chattering in shrill Japanese. Janice stared at him. Nearly everybody in the Navy disliked the Hawaiian Japanese and assumed they were spies. She had caught the feeling. Now here was this jap grinning at her, and overhead jap planes were actually flying! Flying over Hawaii! what could it mean? The nerve of these japs! She took the package and abruptly, rudely offered him the binoculars. The man bobbed his head and peered upward at the planes, now beginning to peel off and dive, one by one, glinting silver amid the thickening black puffs. With a queer noise in his throat, he pulled himself erect and held out the binoculars to her, regarding her with a blank face, his slant eyes like black glass. More than the unreal, startling sight of the orange-marked planes, the look on his face told Janice Henry what was happening in Pearl Harbor. She snatched the binoculars, jumped into her car, slammed the door, and whirred the ignition. He hammered on the door, holding out his hand, palm up, and shouting. She had not paid him. but now with a pulse of pleasure Janice was an honest lady, you able childish excitement she shouted harshly-using the sailor epithet for the first time in her life-\u0027Fuck you!\" and shot off up the road. That was how the war came to Janice Henry, and that was the story she told down the years after a few drinks in suitable company, usually to laughter and applause. Accelerator to the floor, she careered and screeched uphin and around curves to the top of the ridge, jammed on the brakes, and leaped out into roadside grass. She was all alone here. Below, silver planes were flitting and diving about the peaceful Navy base, where the morning mist still lay pearly pink around the ships. Columns of water were shooting up, a couple of ships were on fire, and here and there guns were flashing pale yellow. But it still looked much more like a drill than Bke war. Then she saw a very strange and shocking sight. A battleship vanished ! One instant the vessel stood in the outer row and the next second nothing was there but a big red ball surrounded by black and yellow smoke. A cracking explosion hit and hurt her ears; the pressure wave struck her face like an errant warm breeze; and the ball of smoke and red fire climbed high into the air on a pillar of lighter smoke, and exploded again, in a beautiful giant burst of orange and purple, with another delayed BOOM The vanished battleship dimly appeared again in the binoculars, a vast broken twisted wreck all on fire, sinking at a slant. Men were running around and jumping overboard, and some with their white suits on fire were moving in and out of the smoke, silently screaming. It looked like a movie, exciting and unreal, but now Janice Henry began to grow horrified. Here was one battleship actually sinking before her eyes, and the whole thing had scarcely bee, going on ten minutes! She saw more planes coming in overhead. Bombs began to explode in the hills. Remembering her baby, she ran to the car, backed it squealing onto the road, and raced home. The Chinese maid sat in an armchair, dressed for church, hat on her knee, glumly leafingthrough the mist. \"The baby\u0027s asleep,\" she said in clear English; she was island-born and convent-raised. \"The Gillettes never even came. They forgot me. So I\u0027ll have to go to ten o\u0027clock mass. Please telephone Mrs. Fenney.\" \"Anna May, don\u0027t you know that the Japanese are attacking us?\" \"What?\" \"Yes! Can\u0027t you hear the guns, the explosions?\" Janice gestured nervously toward the window. \u0027Turn on the radio. You\u0027ll hear plenty! jap Planes are all over the harbor. They\u0027ve already hit a battleship!\" Victor lay on his back, still doped by the cough syrup, breathing loud and fast. Janice stripped the hot, flushed little body. From the ra o me ttl ro dica the sliding twangs of Hawaiian guitars and a woman\u0027s voice singing \u0027Lovely Hula Hands.-As Janice , sponged the infant an announcer gibbered cheerfully about Cashmere Bouquet Soap, and another Hawaiian melody began. The maid came to the doorway. \u0027,you sure about the war, Mis\u0027 Henry? There\u0027s nothin on the radio. I think maybe you just saw a drill.\" \u0027Oh, for heaven\u0027s sake! A drill! How stupid do you think I am? I saw a battleship blow up, I tell you, I saw a hundred jap planes, maybe more! They\u0027re all asleep or out of their minds at that radio station. Here-please give him the aspirin. He feels a lot cooler. I\u0027D try to call the Fenneys.\" But the line was dead. She jiggled and jiggled the hook to no avail. \"Sp dip-the tar that causes tobacco harshness. Lucky strike is the only cigarette from which every trace of sheep dip has been removed,\" said a rich, happy male voice. \"Smoke Luckies, they\u0027re kind to your throat-\u0027 Janice spun the dial to another station and got organ music. \"Good God! What\u0027s the mamr with them?\" The maid leaned with arms crossed in the doorway, regarding Janice with quizzical slanted eyes as she twisted the dial, looking in vain for news. \"Why, they\u0027re all insane! Sailors are burning up and drowning out there! What\u0027s that? Who\u0027s there? Is that the Gillettes?\" She heard tires rattling the driveway gravel. A fist banged at the door and the ben chimed. The maid stared at her mistress, unmoving. Janice ran to the door and opened it. Bloody-faced, Warren Henry stumbled inside, in heavy flying boots, a zipper suit, and a bloodied yellow life-jacket. \"Hi, have you got twenty bucks?\"\"My God, Warren!\" \"Go ahead, pay off the cab, Jan.\" His voice was hoarse and, tight \"Anna May, get out some bandages, will you?\" The taxi driver, a hatchet-faced old white man, said, \"Lady, I\u0027m entitled to fifty. I heard the japs have already landed at Kahuku Point. I got my own family to worry about-\"-She gave him two bills. \"Twenty is what my husband said.\" \u0027I\u0027m getting on the first boat out of here,\" said the driver, pocketing the bills, \"if I have to shoot my way aboard. Every white person in Hawaii will be butchered. That\u0027s Roosevelt for you.\" In the kitchen, Warren sat bare-chested. The maid was dabbing antiseptic on his blood-dripping upper left arm. \u0027I\u0027ll do that,\" Janice said, taking the sponge and bottle. \"Make sure Victor\u0027s all right.\" Warren gritted his teeth as Janice worked on a raw wound two inches long. \"Jan, what\u0027s wrong with Vic?\" \u0027Oh, a fever. A cough. Darling, what in God\u0027s name happened to you?\" y \u0027I got shot down. Those bastards killed my radioman. Light me a cigarette, will you? Our squadron flew patrol ahead of the Enterprise and ran into them-hey, easy with the iodine, that\u0027s plentyHow about these goddamned Japs? ) \"Honey, you\u0027ve got to go to the hospital. This has to be stitched up.\" \u0027No, no. The hospital will be jammed. That\u0027s one reason I came here. And I wanted to be sure you and Vic were okay. I\u0027m going to Ford Island, find out what\u0027s happening, and maybe get a plane. Those jap carriers haven\u0027t gone far. We\u0027ll be counterattacking, that\u0027s for sure, and I\u0027m not missing that. just bandage it up, Jan, and then dress this nick, in my ear. That\u0027s what\u0027s dripped most of this gore all over me.\" Janice was dizzied to have Warren suddenly back, literally fallen out of the sky, half-naked, bloody, returned from battle. She felt deep happy stirrings as she rubbed his skin, smelled his sweat and blood, and bound up his wounds. He talked on at a great rate, all charged up. \"God, it was weird-I thought those A.A. bursts were target practice, of course. We could see them forty miles away. There was a hell of a lot of smoke coming off the island, too. I talked to my wing mate about it. We both figured they were burning sugarcane. We never did spot the japs until six of them jumped us out of the sun. That was the last I saw of Bill Plantz. I still don\u0027t know what happened to him, all I was doing from then on was trying to stay alive. The way those fellows came diving-zoe-\" \"Hold still, honey.\" \"Sorry. I tell you, it was rough, Jan. The SBD\u0027s a good dive bomber, but these jap Zeroes! The speed they\u0027ve got, the maneuverability! They can Turn inside you-whoosh! It\u0027s no contest. They do acrobatics like birds. You can\u0027t shake them and you can\u0027t hold them in your sights. the pilots are hot, let me tell you. I don\u0027t know if the F4F\u0027s a match for them, but one thing\u0027s sure, an SBD against Zeroes is simply a dead pigeon. All I could do was keep turning and turning to evade. They got De Lashmutt right away. He almost broke my eardrums with a horrible scream on the intercom. And then he yelled, \u0027Mr. Henry, I\u0027m pouring blood, I\u0027m dying,\" and he moaned and that was all. There was nothing I could do. They kept coming at me. They were so eager, one of them finally overshot and hung for a second or two, in my sights, turning. I let go with my fifties and I could swear he started smoking, but I can\u0027t claim anything. I lost sight of him. Tracers started from three sides, right past my vindows, these big pink streaks, zing, zing, zing-and then, goddamn it, our own A.A. opened up! Why the hell they shot at me I\u0027ll never know, the silly sons of bitches-maybe they were gunning for the japs and missing-but the flak was bursting all around me. I still don\u0027t know whether they got me, or one of the japs did. All I know is my gas tank caught fire. Poor De lashmutt, I yelled and yelled at him, till the flames were coming up around the cockpit, but he didn\u0027t answer, he certainly was dead. So I popped the canopy and jumped. I didn\u0027t even see where I was until the parachute opened, I just saw water. I was out over Honolulu Harbor, but the wind took me inshore. I almost got hung up in a palm tree in a little park off Dillingham Boulevard; then I cleared it and got down. I grabbed that cab, but I had a time with that fellow. He saw the chute draped all over the tree, he saw me unbuckling-he stopped to watch-and he still wanted fifty dollars to take me home. A patriot, that one!\" \"I\u0027ve got the bleeding sort of under control, sweetie. just sit quiet, will you?\" \"Good girl. One thing I want to do before this day\u0027s out is get at a typewriter. I may file the first combat report of this war on Zeroes. Hey? How about that?... You should see the sights downtown!\" Warren crookedly grinned at his wife. \"People out in pajamas, nightgowns, or less, yelling, running around gawking at the sky. Old people, kids, mothers shrapnel was rainin with babies. Damn loo s, when A-A. shr g all over the place! The only safe place was inside. I saw this beautiful Chinese girlacross Dillingham Boulevard Anna May reminds me of her-go galloping in nothing but a bra and pink panties, and I mean small transparent panties-really a sight-\"\"You would notice something like that,\" said Janice. \"No doubt you\u0027d notice it if your arm had been shot clean off.\" With his good arm, Warren gave her a rough intimate caress, and she slapped his hand. \u0027All right! I\u0027ve got this wound plastered down. Maybe it\u0027ll hold for a while. Your ear is all right too. I still think you should see a doctor at the Naval Air Station.\" \u0027If there\u0027s time, if there\u0027s time.\" Grimacing as he moved the arm, Warren put on his shirt and sweater and zipped up the suit. \"I\u0027ll have a look at Vic. Get out the car.\" He emerged from the house a few moments later and opened the car door. \u0027y, the son of a gun\u0027s sleeping peacefully. He feels cool and he looks like he\u0027s grown twice as big.\" \u0027Maybe the fever broke.\" Janice paused, hand on the gearshift. The car radio was broadcasting an appeal from the governor to keep calm, with assurances that fleet damage was slight and that the attackers had all been driven off. \u0027Warren, that cab driver said the japs were landing at Kahuku. Do you suppose there\u0027s any danger of that, and-\" \"No, no, get started. Landing? How the hell could they keep a beachhead supplied from four thousand miles away? You\u0027ll hear all kinds of crazy scuttlebutt. This was a hit-and-run raid. Christ, the high brass on this rock must be cutting their collective throats about now. Of all the sucker plays, a Sunday morning sneak attack! Why, it\u0027s been a routine battle problem for years.\" On the ridge sightseers stood in the grass beside parked cars, chattering and pointing. Heavy black smoke boiled up out of the anchorage and mushroomed over the sky, darkening the sun to a pale ball. Janice stopped the car. Through the windshield, Warren swept the harbor with the binoculars. \"Good God, Jan, Ford Island\u0027s a junkyard! I don\u0027t see one undamaged plane. But there must be many left in the hangars. Lord, and there\u0027s a battlewagon CaPsized. \"I\u0027ll bet a thousand guys are caught inside that-Hey!! Jesus Christ! Are they coming back?\" All over the harbor guns began rattling and flaming, and black A.A. balls blossomed again in the blue. Warren peered skyward. \"I\u0027ll be goddamned. There they are. How about that? Those sons of bitching jap\"; are sure betting everything on this one, Janice! Well, that means the carriers are still in range anyway, waiting to recover them. Great! Move over. I\u0027m driving.\" Speeding made Janice nervous when she wasnpt at the wheel, and Warren knew it, but he whistled down to Pearl City like an escaping bank bandit. After a few moments of fright his wife began to enjoy the breakneck ride. Everything was different on this side of time, the side after the japs attacked; more adventurous, almost more fun. How handsome Warren looked, how competent, how desirable, handling the wheel with a relaxed turn of his unhurt arm, puffing a cigarette in his taut mouth, watching the road through narrow eyes! Her boredom and irritability were gone and forgotten The black puffballs were far thicker than before, andthrough the windshield they saw one Japanese plane after another burst into flames and fall. Each time Warren cheered. The fleet landing was a mess and a horror. Sailors with blistered faces and hands, with skin hanging in yellow or black scorched pieces from bloody flesh, were being helped out of whaleboats or lifted off in stretchers and loaded onto hospital trucks by men in red-smeared whites. Wounded and unwounded alike were bawling obscenities, unmindful of the women crowding the landing and gnawing their fingers as then scanned the faces of the hurt men; unmindful too of the children who played and joked around the women\u0027s skirts-those not old enough to stare with round eyes at the burned sailors. The coxswain of a whaleboat full of sheeted bodies was trying to come alongside, and a fat old chief in khaki kept cursing at him and waving him off. Over all this noise rolled the massive thumping and cracking of guns, the wail of sirens, the blasts of ships\u0027 horns, and the roar of airplanes, for the second attack was now in full swing. There was a heavy smell of firecrackers in the air, mingled with a sour stink from the black oil burning on the water all around Ford Island and sending up clouds of thick smoke. Hands on hips, cigarette dangling from his mouth, Warren Henry calmly surveyed the terrible and spectacular scene. Janice said, in shaken tones, \"I don\u0027t know how you\u0027ll ever get across.\" absently, then strode to the end of the landing to a long He nodded after him. \"Coxswain, whose barge is this?\" canopied boat. Janice hurried a The immaculate sailor at the tiller flipped a hand to a white hat perfectly squared on his close-cropped head. Big-jawed, bronzed, and tall, he eyed Warren\u0027s gory life-jacket curiously, and drawled, \"Suh, this is Admiral Radburn\u0027s barge.\" \"Is the admiral on the beach?\" \"Yes, suh.\" \"Do you know how long he\u0027ll be?\" \"Negative, suh, he just told me to wait.\" Glancing back at the milling boats along the landing, Warren said \"Well, look, here\u0027s how it is. I\u0027m Lieutenant Henry, off the Enterprise. I\u0027m a dive bomber pilot.\" \"Yes, suh?\" g, just when the attack started. The japs shot \"I flew in this mornin me down. I have to find another plane and get into this fight, so how\u0027s for taking me over to Ford Island?\" The coxswain hesitated, then straightened up and saluted. \"Come t those sons of bitches. Excuse aboard, suh. The important thing is to ge am.))me, ma \"Oh, quite all right,\" Janice laughed. \"I want him to get those sons of bitches too.\" Hair stirring in the wind, bloody lifeiacket dangling open, Warren stood in the stern sheets, hands on hips, smiling at her as the barge pulled away. \"Get them,\" she called. \"And come back to me.\" \"Roger. Don\u0027t drive back till these bastards quit, or you may get strafed. Be seeing you.\" He ducked as a red and yellow Japanese plane passed right over his head, not twenty feet in the air, its motor noisily coughing and missing; then it turned sharply and flew away across the channel, over the capsized crimson hull of a battleship. Warren straightened, still grinning. Janice watched the admiral\u0027s beautiful barge, all new gray paint, shiny brass, snowy curtains and cordwork, carry her bloodstained husband away to the flaming smoky mid-harbor island that was the Navy\u0027s airfield. He waved and she wildly waved back. She was horror-stricken by what she had seen at the Beet landing; yet never had she felt so aroused, so fuu of life, so plain damn good, and so much in love. An Army spokesman came on the automobile radio as she drove home, urging calm, warning against sabotage, and assuring the people that the second attack had been turned back with little further damage to the fleeting over the and at fearful cost to the Japanese. All-clear sirtenisngwetroe twheailradio, which island. She found the maid in an armchair us was playing Hawaiian music again. \"Victor\u0027s been very quiet, Missus Henry,\" she said. \"Not a sound. Isn\u0027t it terrible about the war? But we\u0027ll beat them.\" ace of sheep \"SheeP dip-the tar that causes tobacco harshness))) said the -olin, voice. \"Lucky Strike is the dip-\u0027 ri , O,l y cigarette from which every tr In his bedroom Victor coughed, a deep harsh cough like a man. \"Why, there he goes now,\" Janice said. \"The very first time, ma\u0027am, since he got his medicine. I\u0027ve been listening.\" Janice\u0027s watch read eight minutes to ten. \"Well, it\u0027s been about two hours. I guess that\u0027s all the medicine\u0027s good for. I\u0027ll give him more.\" The, baby still felt cool. He took the spoonful of brown syrup without opening his eyes, sighed, and turned over. Janice sank in a chair, perspiring and spent, thinking that a war had begun and the Pacific fleet had been smashed between her baby\u0027s two doses of cough medicine. The sun poked up over the horizon, painting a red Hush on the TClipper\u0027s wing. Wide awake, Victor Henry watched the brightening disk rise free of the ocean. The flying boat\u0027s engines changed pitch, rasping at his nerves. Since he had said good-bye to Pamela Tudsbury in Red Square in the snow, he had been shaken up in trains, planes, boats, trucks, jeeps, sleighs, and even oxcarts. He thought his bones would vibrate aboard the California for a month. Fortyeight hours, two more fifteenhundred-mile hops, and if nothing went wrong the trek halfway round the earth would be over. The sun moved sidewise. The turn was so shallow that he felt no tilt in his seat. A pink ray shot across his lap from the opposite side of the plane. Pug left his seat and walked forward into the galley, where the steward was scrambling eggs. \"I\u0027d like to talk to Ed Connelly, if he\u0027s free.\" The steward smiled, gesturing at the door marked FLiGffrDEcx. The naval officer and the Clipper captain had been eating meals together and sharing rooms at the island hotels. In the dial-filled cockpit the engines sounded much louder, and beyond the plexiglass the void purple sea and clear blue sky stretched all around. The captain, a beefy ckled man in shirt-sleeves and headphones, looked oddly at Pug Henry. \u0027Morning, Ed. Why are we heading back?\" Connelly passed him a radio message, hand-printed in red ink on a yellow form. CINCPAC OR CMCUIT GENERAL PLMN LANGUAGE MESSAGE QUOTE AIR RAM ON PEARL HARBOR X THIS IS NO DRILL UNQUOTE X HEAVY GUNFIRE IN ANCHORAGE X RECOMMEND YOU RETURN WAKIR TILL srruAInoN CLARLFMS \"How about that?\" The captain removed the sponge-rubber headphones and rubbed his curly red hair. \"Do you suppose it\u0027s for real?\" \"I wouldn\u0027t doubt it,\" said Victor Henry. \"I\u0027m damned. I honestly never thought they\u0027d go. Attacking Pearl! They\u0027ll get creamed.\" \"Let\u0027s hope so. But what\u0027s the point of turning back, Ed?\" \"I guess they might be hitting Midway, too.\" \"Well, they might be hitting Wake, for that matter.\" \"I\u0027ve talked to Wake. All quiet.\" Victor Henry returned to his seat, agitated though far from astonished. Here it was at last, he thought: an attempted sneak attack on Pearl, in the midst of a war scare. The uninventive Asiatics had elected to try the Port Arthur trick again, after all. But surely this time they were running their heads into a noose! The United States in 1941 wasn\u0027t Czarist Russia in 1904One phrase in Cincpac\u0027s message nagged at him: This is no drill. That was silly, to a fleet onw2r alert! Some low-level communicator must have tacked that one on. A calm sunburned man\u0027the in a jeep, naked except for shorts, socks, and boots, waited for him at the landing. The marine commander had put his forces on combat alert and wanted to see Captain Henry. They drove along the beach road in blazing sunlight and choking coral dust, then turned off into the brush. Combat alert had not changed the look of Wake in the past hours: three Hat sandy peaceful islands in a horseshoe shape around emerald shallows, ringed by the wide sea, alive with myriads of birds-for it had been a sanctuary-and bustling with the bulldozers and trucks of civilian construction gangs. The queer humpbacked island rats hopped like tiny kangaroos out of the jeep\u0027s path, and brilliantly colored bircls rose from the brush in chirping cloud.-,. Perfectly camouflaged by scrub, the command post was sunk far down in coral sand. When Victor Henry faced the marine colonel in this deep timbered hole, saw the radio gear and crude turn:,ture and smelled perking coffee and freshly dug soil, the war with japan became a fact for him. The dugout did not have the graveyard-muck odor of the Russian trenches; it was roasting hot and dry, not freezing cold and wet; the men frantically working on the telephone lines and the overhead beams were not frostbitten, pale, bundled-up Slavs, but sunburned, heavily sweating Americans in shorts. Yet here, where the roar of the Pacific dimly sounded, these Americans-like the Russians outside Moscow-were going into the ground to await attack. The United States was in. The colonel, a mild-faced scrawny man with whom Pug had dined the night before, gave him an envelope to take to Cincpac. \"Put it in the adrriral\u0027s hand yourself, Captain. Please! It\u0027s a list of my worst shortages. We can make a fight of it here, Maybe we can hold out till we\u0027re relieved, if he\u0027ll send us that stuff. Radar gear for Wake is sitting right now on the dock in Hawaii. It\u0027s been there for a month. For God\u0027s sake, ask him to put it on a destroyer or better yet a bomber, and rush it here. I\u0027m blind without radar. I can\u0027t send fighters on patrols, I have too few. I\u0027m twenty feet above the ocean at my highest point, and I only gain a few more feet with my water tower. We\u0027ll probably end up eating fish and rice behind barbed wire anyway, but at least we can make the bastards work to take the place.\" Pug got back to the hotel just ahead of a rain squall. The Clipper passengers were sitting down to lunch when blasts shook the floor, rattled the dishes, and sent broken windowpanes clinking to the tiles. Amid shouts and cries the passengers jumped for the windows. Fat cigar-shaped airplanes, with orange circles painted on their flamboyant jungle camouflage, were flashing past in the rain; Pug noted their twin engines and twin tails. Smoke and fire were already rising from the airfield across the lagoon, and more explosions, bigger flames, heavier smoke, came fast. Pug had often seen bombing, but this attack, destroying an American installation with impunity, still outraged and numbed him. The marauding bombers, blurry in the rain, kept crisscrossing the islands and the lagoon with thunderous engine roars, meeting only meager bursts of fire. Soon a line of bombers camewinging straight for the Pan American compound, and this was what Victor Henry was fearing. An attack on the Clipper might strand him and paralyze his war career before it started. There was no way off Wake Island, except aboard that huge inviting silvery target. Savage explosions and crashes burst around them as the planes bombed and machine-gunned the hotel, the Pan Am repair shops, the dock, and the radio tower. A gasoline dump close by went up in a colossal sheet of white flame, climbing to the sky with a terrific howl. The passengers dove under tables or huddled in corners, but Victor Henry still crouched at the window beside the pilot, watching. They saw spurts of water approach the flying boat. They saw pieces of the Clipper go flying. When the bomber sounds faded, Pug followed the pilot out onto the pier at a run. Like a clothed ape, Ed Connelly clambered over the slipery flying boat in the rain, making it rock and slosh. \"Pug, so help me God, I think we can still fly! They didn\u0027t hole the tanks or the engines. At least I don\u0027t think they did. I\u0027m hauling my passengers the hell out of here now, and I\u0027ll argue with Hawaii later.\" The passengers eagerly scrambled aboard. The Clipper took off, and it flew. Below, smashed airplanes named and all three islands poured smoke. Pug could see little figures looking up at the departing Clipper. Some waved. Even in the dead of night, nine hours later, Midway was not hard to find. The pilot called Victor Henry to the cockpit to show him the star of flame far ahead on the black sea. \"Christ, these japs had the thing all lined up, didn\u0027t they?\" he said. \"They hit everywhere at once. I heard the radio they\u0027already in Malaya, Thailand, Hong Kong, they\u0027re bombing Singapore\"C(over) an we land, Ed?\"(re) \"We\u0027ve got to try. I can\u0027t raise them. All the navigation lights are out. Midway has a lot of underground tanks. And if we can just get down, we can fuel. Soooo-here goes.\" The riving boat dropped low over dark waters, lit only by the glare from blazing hangars and buildings. On slapping into the sea, it hit something solid with a frightening clang, but slowed and floated undamaged. The airfields of Midway, they soon learned, had been shelled by a japanese cruiser and a destroyer. An eaflarated mob of almost naked fire fighters was flooding the blazes with chemicals and water, generating giant billows of acrid red smoke. Victor Henry found his way to the commandant\u0027s office and tried to get news of the Pearl Harbor attack. The lieutenant on duty was obsequious and vague. The commandant was out inspecting the island\u0027s air defenses, he said, \u0027and he had no authority to show top secret dispatches, but he could tell the captain that the Navy had shot down a mess of Japanese planes. \u0027How about the California? I\u0027m going there to take command of her.\"The lieutenant looked impressed. \"Oh, really, sir? The California? I\u0027m sure she\u0027s all right, sir. I don\u0027t recall any word about the California.\" This news enabled Victor Henry to sleep a little, though he tossed and muttered all night and got up well before dawn to pace the cool hotel veranda. The goony birds of Midway, big book-beaked creatures which he had heard about but never seen, were out by the dozens, walking the gray dunes. He saw them clumsily Ely, and land, and tumble on their heads. He watched a pair do a ridiculous mating dance on the beach as the sun came up, plopping their feet like a drunken old farm couple. Ordinarily Victor Henry would have seized the chance to inspect Midway, for it was a big installation, but today nothing could draw him out of sight of the flying boat, rising and falling on the swells and bumping the dock with dull booms. The four hours to Hawaii seemed like forty. Instead of melting away at its usual rate, time froze. Pug asked the steward for cards and played solitaire, but forgot he was playing. He just sat, enduring the passage of time like the grind of a dentist\u0027s drill, until at last the steward came and spoke to him, smiling. \"Captain Connelly would like you to come up forward, sir.\" Ahead, through the pie;dglass, the green sunny humps of the Hawaiian Islands were showing over the horizon. \"Nice?\" said the pilot. \"Prettiest sight I\u0027ve seen,\" said Pug, \"since my wife had a girl baby.\" \u0027Stick around, and we\u0027ll take a look at the fleet.\" Nobody aboard the Clipper knew what to expect. The rumors on Midway had varied from disaster to victory, with graphic details both ways. The Clipper came in from the north over the harbor and hooked around to descend. In these two passes, Victor Henry was struck sick by what his disbelieving eyes saw. All along the east side of Ford Island the battleships of the Pacific Fleet lay careened, broken, overturned, in the disorder of a child\u0027s toys in a bath. Hickam Field and the Navy\u0027s air base were broad dumps of blackened airplane fragments and collapsed burned hangar skeletons. Some dry docks held shattered tumbled-over ships. Pug desperately tried to pick out the California in the hideous smoky panorama. But at this altitude the ships with basket masts looked alike. Some of the inboard vessels appeared just slightly damaged. If only one was the California! \"My God,\" Connelly said, looking around at Pug, his face drawn, what a shambles!\" Speechless, Victor Henry nodded and sat on a folding seat, as the flying boat swooped low past a smashed gutted battleship with tripod masts, sunk to the level of its guns and resting on the bottom at a crazy angle. The Clipper threw up a curtain of spray that wiped out the heart-rending sight lourmy) s end. Passing several clanging, speeding Navy ambulances, Pug went from the customs shed at the Pan Am landing straight to the Cincpac building, where officers and sailors busily swarmed. They all wore unsure scared expressions, like people after a bad earthquake. A very handsome ensign in whites, at a desk that barred access to Cincpac\u0027s inner offices, looked incredulously atPug, who wore wrinkled slacks and a seersucker jacket. The admiral? You mean Cincpac, sir? Admiral Kimmel?\" \"That\u0027s right,\" Pug said. \"Sir, you don\u0027t really expect to see Admiral Kimmel today, do you? Shall I try his Assistant Chief of Staff?\" \"Give the admiral a message, please. I\u0027m Captain Victor Henry. I\u0027ve just come in on the Clipper with a personal letter for him from the marine commandant on Wake Island.\" The very handsome ensign gestured wearily at a chair and picked up a telephone. \"You may have to wait all day, or a week, sir. You know what the situation is.\" \"I have the general picture.\" A minute or so later, a pretty woman in a tailored blue suit looked through the double doors. \"Captain Henry? This way, sir.\" The ensign stared at Victor Henry walking past him, as though the captain had sprouted another head. Along the corridor, the offices of Cincpac\u0027s senior staff stood open, and the sound of excited talk and typewriter clatter drifted out. A marine rigidly saluted before high doors decorated with four gold stars and a Navy seal, and labelled in gold comMANDER-INCHIEF, PACIFIC FLEET. Hey passed into a wood-panelled anteroom. The woman opened a heavy polished mahogany door. \"Admiral, here\u0027s Captain Henry.\" \"Hey, Pug! Great day, how long has it been?\" Kimmel waved cheerily from the window, where he stood gazing out at the anchorage. He was dressed in faultless gold-buttoned whites, and looked tanned, fit, and altogether splendid. though much older and quite bald. \"Have I seen you since you worked for me on the Maryland?\" \"I don\u0027t think so, sir.\" \"Well, the years are dealing kindly with you! Sit you down, sit you down. Been flying high, haven\u0027t you? Observing in Roosia, and all thatch?\" They shook, hands. Kimmel\u0027s voice was as hearty and winning as ever. this was an outstanding officer, Pug thought, who had been marked for success all the way and had gone all the way. Now, after twenty years of war exercises and drills against Orange, the fleet he commanded lay in sight beyond the window, wrecked in port by the Orange team in one quick real action. He appeared remarkably chipper, but for his eyes, which were reddened and somewhat unfocussed. \"I know how little time you have, sir.\" Pug drew out of his breast pocket the letter from Wake Island. \u0027Not at all. It\u0027s nice to see an old familiar face. You were a good gunnery officer, Pug. A good officer all around. Cigarette?\" Kimmel offered him the pack, and lit one for himself. \"Let\u0027s see. Don\u0027t you have a couple of boys in the service now?\" \"Yes, sir. One flies an SBD off the Enterprise, and-\" \"Well, fine! They didn\u0027t get the Enterprise or any other carrier, Pug, because the carriers at least followed my orders and were on one hundred percent alert. And the other lad?\" \"He\u0027s aboard the Dfish in Manila.\" \"Manila, eh? They haven\u0027t hit the fleet at Manila yet, though I understand they\u0027ve bombed the airfields. Tommy Hart\u0027s got some warning now, and he\u0027ll have no excuse. I only hope the Army Air people in Manila aren\u0027t as totally asleep as they were here! The Army was and is completey responsible for the safety of these islands and of this anchorage, Pug, including the definite responsibility of air patrol and radar search. Nothing on God\u0027s earth could be clearer than the way that is spelled out in the islands\u0027 defense instructions. The documents leave no doubt about that, fortunately. Well-you have something from Wake, don\u0027t you? Let\u0027s have a look-see. Were you there when they hit?\" \"Yes, sir.\" \"How bad was it? As bad as this?\" \u0027well, I\u0027d say about two dozen bombers worked us over. Mainly they went after planes and air installations, Admiral. No ships were there to get bombed.\" CincPac shot a glance at Victor Henry, as though suspecting irony in his words. \"Say, weren\u0027t you supposed to relieve Chip Walenstone in the California?\" \u0027Yes, sir.\" Kimmel shook his head, and started to read the letter. Pug ventured to say, \"How did the California make out, Admiral?\" \"Why, don\u0027t you know?\" \u0027No, sir. I came straight here from the Clipper.\" Not looking up, in the brisk tone of a report, Kimmel said, \"She took two torpedoes to port and several bomb hits and near misses. One bomb penetrated below decks and the explosion started a big fire. She\u0027s down by the bow, Pug, and sinking. They\u0027re still counterflooding, so she may not capsize. She\u0027s electric drive, and the preliminary estimate\"-he pulled toward him a sheet on his desk, and peered at it-\"a year and a half out of action, possibly two. That\u0027s top secret of course. We\u0027re releasing no damage information.\" Cincpac finished the letter from Wake in a heavy silence, and tossed it on the desk. Victor Henry\u0027s voice trembled and he swallowed in mid-sentence. \"Admiral, if I broke a lot of asses, including my own-ah, is there a chance I could put her back on the line in six months?\"\u0027Go out and see for yourself. It\u0027s hopeless, Pug. A salvage officer will relieve Chip.\" The tone was sympathetic, but Victor Henry felt it did Cincpac good to give someone else catastrophic news. \"Well, that\u0027s that, then, I guess.\" \"You\u0027ll get another command.\" \"The only thing is, Admiral, there aren\u0027t that many available battleships. Not any more.\" Again, the quick suspicious glance. It was hard to say anything in this context without seeming to needle the commander of the Pacific Fleet. Kimmel made a curt gesture at the letter Pug had brought. \"Now there\u0027s a problem for you. Do we relieve Wake or not? It means exposing a carrier. We can\u0027t go in without air cover. He\u0027s asking for a pile of things I can\u0027t give him, for the simple reason that the Russians and the British have got the stuff. Mr. Roosevelt was a great Navy President until that European fracas started, Pug, but at that point he took his eye off the ball. Our real enemy\u0027s always been right here, here in the Pacific. This ocean is our nation\u0027s number one security problem. That\u0027s what he forgot. We never had the wherewithal to conduct proper patrols. I didn\u0027t want to rely on the Army, God knows, but equipment only has so much life in it, and what would we have had to fight the war with if we\u0027d used up our planes in patrolling? Washington\u0027s been crying wolf about the japs for a year. We\u0027ve had so many full alerts and air raid drills and surprise attack exercises and all, nobody can count them, but-well, the milk is spilled, the horse is stolen, but I think it\u0027s pretty clear that the President got too damned interested in the wrong enemy, the wrong ocean, and the wrong war.\" It gave Victor Henry a strange sensation, after Berlin and London and Moscow, and now this staggering personal disappointment, to hear from Admiral\u0027Kinnnel the old unchanged Navy verbiage about the importance of the Pacific. \"Well, Admiral, I know how busy you are,\" he said, though in fact he was struck by the quiet at the heart of the cataclysm, and by Kimmel\u0027s willingness to chat with a mere captain he did not know very well. Cincpac acted almost as lonesome as Mp Tollever had. \"Yes, well, I do have a thing or two on my mind, and you\u0027ve got to go about your business too. Nice seeing you, Pug,\" said Admiral Kimmel, in a sudden tone of dismissal. Janice answered Pug\u0027s telephone call and warmly urged him to come and stay at the house. Pug wanted a place where he could drop his bags, and get into uniform to go to the California. He drove out in a Navy car, took suitable if brief delight in his grandson, and accepted Janice\u0027s commiseration over his ship with a grunt. She offered to get his whites quickly pressed by the maid. In the spare room he opened his suitcase to pull out the crumpled uniform, and his letter to Pamela Tudsbury fell to the floor. In a dressing gown he glanced through the letter, which he had written during the long hop from Guam to Wake Island. It embarrassed him as one of his old love letters to Rhoda might have. There wasn\u0027t much love in this one, mostly a reasoned and accurate case for his livingout his life as it was. The whole business with the English girl-romance, flirtation, love affair, whatever it had been-had begun to seem so far away after his stops in Manila and Guam, so dated, so unlike him, so utterly outside realities and possibilities! Pamela was a beautiful young woman, but odd. The best proof of her oddness was her very infatuation with him, a grizzled United States Navy workhorse with whom she had been thrown together a few times. Dour and repressed though he was, she had ignited a flash of romance in him in those last turbulent hours in Moscow. He had allowed himself to hope for a new life, and to half believe in it, in his elation over his orders to the California. And now-how finished it all was! California, Pamela, the Pacific Fleet, the honor of the United States, and-God alone knew-any hope for the civilized world. A knock at the door; the voice of the Chinese maid: \"Your uniform, Captain?\" \u0027Thank you. Ah, that\u0027s a fine job. I appreciate it.\" He did not tear the letter up. He did not think he could write a better one. The situation of a man past fifty declining a young woman\u0027s love was awkward and ridiculous, and no words could help much. He slipped the envelope into his pocket, When he passed a mailbox on his way to the Navy Yard, he stopped and mailed it. The clank of the box was a sad sound in a sad day for Captain Victor Henry. Sadder yet was the trip to the California, through foul-smelling water so coated with black oil that the motor launch cut no wake, but chugged slimily along in smoky air, thumping like an icebreaker through a floating mass of black-smeared garbage and debris. The launch passed all along Battleship Row, for the California lay nearest the channel entrance. One by one Pug contemplated these gargantuan gray vessels he knew so well-he had served in several-fireblackened, bomb-blasted, down by the head, down by the stern, sitting on the bottom, listing, or turned turtle. Grief and pain tore at him. He was a battleship man. Long, long ago he had passed up flight school. Navy air had seemed to him fine for reconnaissance, bombing support, and torpedo attacks, but not for the main striking arm. He had argued with the fly-fly boys that when war came, the thin-skinned carriers would lurk far from the action and would fuss at each other with bombings and dogfights, while the battleships with their big rifles came to grips and slugged it out for command of the sea. The fliers had asserted that one aerial bomb or torpedo could sink a battleship. He had retorted that a sixteen-inch steel plate wasn\u0027t exactly porcelain, and that a hundred guns firing at once might slightly mar the aim of a pilot flying a little tin crate. His natural conservative streak had been reinforced by his football experience. To him, carriers had been the fancy-Dan team with tricky runners and razzle-dazzle passers; batdewagons, the heavy solid team of chargers, who piled up the yardage straight through the line. These tough ground gainers usually became the champions. So he had thought-making the mistake of his life. He had been as wrong as a man could be, in the one crucial judgment of hisprofession. . Other battleship men might still find excuses for these tragic slaughtered dinosaurs that the launch was passing. For Pug Henry, facts governed-Each of these vessels was a giant engineering marvel, a floating colossus as cunningly put together as a lady\u0027s watch, capable of pulverizing a city. All true, all true. But if caught unawares, they could be knocked out by little tin flying crates. The evidence was before his eyes. The twenty-year argument was over. The setting sun cast a rosy glow on the canted superstructure of the California. She listed about seven degrees to port, spouting thick streams of filthy water in rhythmic pumped spurts. The smoke.-streaked, flameblistered, oil-smeared steel wall, leaning far over Pug\u0027s head as the motor launch drew up,to the accommodation ladder, gave him a dizzy, doomed feeling. The climb up the canted and partly submerged ladder was dizzying, too. What an arrival! In bad moments in Kuibyshev, on Siberian trains, in Tokyo streets, in the Manila club, Pug had cheered himself with pictures of his reception aboard this ship: side boys in white saluting, honor guard on parade, boatswain\u0027s pipe trilling, commanding officers shaking hands at the gangway, a sweet triumphant tour of a great ship shined up to holiday beauty and brilliance.for the eye of a new captain. Often he had played a minor part in such rituals. But to be the star, the center, the incoming \u0027old man\"I It was worth a lifetime of the toughest drudgery. And now this! A vile corrupt stink hit Victor Henry in the face as he stepped on the sloping quarterdeck of the California, and said, \"Request permission to come aboard, sir \u0027Permission granted, sir.\" The O.O.D\u0027s salute was smart, His sunburned boyish face attractive. He wore grease-streaked khakis, with gloves and a spyglass. Five corpses lay on the quarterdeck, under sheets stained with water and oil, their soggy black shoes projecting, their noses poking up the cloth, water trickling from them down the slanted deck toward the O.O.D\u0027s stand. The smell came partly from them, but it was a compound of reeks-seeping smoke, gasoline fumes from the pumps, burnt oil, burnt wood, burnt paper, burnt flesh, rotted food, broken waste lines; a rancid mildewy effluvium of disaster, of a great machine built to house human beings, broken and disintegrating. Unshaven sailors and officers in dirty clothing wandered about. Above the filth and mess and tangled hoses and scattered shells and ammo boxes on the main deck, the superstructure jutted into the sunset sky, massive, clean, and undamaged. The long sixteen-inch guns were trained neatly fore and aft, newly and smoothly painted gray, tampions in place, turrets unscathed. The ship bristled with A.A. guns. The old Prune Barge was tantalizingly alive and afloatwounded, but still mighty, still grandiose. \u0027I\u0027m Captain Victor Henry.\" \"Yes, sir? Oh! Yes, sir\u0027 Captain Wallenstone\u0027s been expecting you for quite a while.\" He snapped his fingers at a messenger in whites, and said with a winning sad grin, \"It\u0027s awful that you should find the ship like this, sir. Benson, tell the C.O. that Captain Henry is here.\"\"One moment. Where\u0027s your C.O.?\" \"Sir, he\u0027s with the salvage officers down in the forward engine room.\" \u0027I know the way.\" Walking familiar decks and passageways that were weird in their fixed slant, climbing down tipped ladders, choking on smoke, gasoline, and oil fumes, and a gruesome smell of rotting meat, penetrating ever deeper into gloom and stench, realizing that these fume-filled spaces were explosive traps, Victor Henry got himself down to the forward engine room, where four officers huddled on a high catwalk, playing powerful hand lights on a sheet of oil-covered water. By an optical illusion, the water half-drowning the engines appeared slanted, rather than the listing bulkheads. With little ceremony, Victor Henry joined in the engineering talk about saving the ship. The quantity of water flooding through the torpedo holes was more than the pumps could throw out, so the ship was slowly settling. It was that simple. Pug asked about more pumps, about pumping by tugs and auxiliary vessels; but all over the anchorage the cry was for pumps. No more pumping was to he had, not in time to keep the battleship off the mud. Captain WaUenstone, haggard and untidy in greasy khalds and looking about sixty years old, reeled off sad answers to Pug\u0027s other ideas. Patching the holes would take months of underwater work. They stretched over a dozen frames. Sealing off the damaged spaces by sending in divers and closing them off one by one could not be done in time. In short, the California, though not yet on the bottom, was done for. The talk was about cofferdams and cement patches, about a complete refitting in the States, about return to service in 1943 or 1944. Wallenstone took Victor Henry up to his cabin. It was a blessed thing to smel) fresh air again streaming in through windward portholes, and to see the evening star bright in the apple-green sky. The commanding officer\u0027s quarters were intact, spacious, shipshape, glamorous, and beautiful, on this battleship sinking uncontrollabjy to the bottom. A Filipino steward brought them coffee, which they had to hold on their laps, for it would have slid off the tilted tables. Mournfully, the captain told Pug his experiences of the Japanese attack. Pug had never encountered this officer before, but Wallenstone appeared to know a lot about him. He asked Victor Henry what President Roosevelt was really like, and whether he thought the Russians could hold out much longer against the Germans. \u0027Oh. by the way,\" he said, as he started to accompany Pug out, \u0027quite a bit of mail accumulated here for you. I\u0027m not sure that\"-he opened and closed desk drawers-\"yes, here it is, all together.\" Victor Henry tucked the bulky envelope under his arm and picked his way with the captain across the cluttered, stinking main deck in the twilight. \u0027You wouldn\u0027t believe what this ship looked like two days ago.\" The captain shook his head sadly, pitching his voice above the whine and thud of the pumps and the metallic hammering everywhere. \u0027We had the word from Manila to expect you. I ranoff a captain\u0027s inspection on Saturday. I was at it for five hours. What a job they\u0027d done! You could have eaten your dinner off the engine room deck. It gleamed. She was the smartest ship in this man\u0027s Navy, Henry, and she had the finest crew that everoh well, what\u0027s the use? What\u0027s the use?\" At the quarterdeck the bodies were gone. The captain looked around and said, \"Well, they took those poor devils away. That\u0027s the worst of it. At the last muster forty-seven were still missing. They\u0027re down below, Henry, all drowned. Oh, God! These salvage fellows say this ship will come back and fight one day, but God knows! And God knows where I\u0027ll be then\u0027 Who would think the sons of bitches could sneak all the way to Hawaii undetected Who\u0027d think they\u0027d be screwy enough to try? Where was our air cover?\" \u0027Is that the Enterprise?\" Pug pointed at a black rectangular shape moving down channel, showing no lights. Wallenstone peered at the silhouette. \"Yes. Thank Christ she wasn\u0027t in port Sunday morning.\" \"My son\u0027s a flier on board her. Maybe I\u0027ll get to see him. First time in a long while.\" \"Say! \u0027That should cheer you up some. If anything can. I know how you must feel. All I can say is, I\u0027m sorry, Henry. Sorry as a human being can be.\" Captain Wallenstone held out his hand. Victor Henry hesitated. In that tiny pause, he thought that if this man had been wiser than all the rest, had held the ship in readiness condition Zed or even Yoke -after all, be too had received a war warning-and had ordered a dawn air alert, the California might be the most famous battleship in the Navy now, afloat and ready to fight. Wallenstone then would be a national hero with a clear red carpet to the office of Chief of Naval Operations, and he would be turning over a fighting command to his relief. Instead, he was one of eight battleship captains conferring with salvage officers and saying how unfortunate it all was; and he was offering a handshake to the man who would never relieve him, because he had let the enemy sink his ship. But could he, Pug Henry, have done any better? A battleship captain who roused his crew for dawn general quarters in port, while half a dozen other battleships slept, would have been a ridiculous eccentric. The entire fleet from Cincpac down had been dreaming. That was the main and forever unchangeable fact of history. The sinking of the California was a tiny footnote nobody would ever pay attention to. He shook Wallenstone\u0027s hand, saluted the colors, and made his way down the ladder-which leaned nauseatingly over the water-to the luxurious and unharmed captain\u0027s gig that the O.O.D had summoned. The gig ran darkened to the landing. In the dim dashboard light of the car, Pug glanced over the envelopes of his piled-up mail; official stuff for the most part, with a couple of letters from Rhoda and one from Madeline. He did not open any of them. \u0027Dad!\" Warren not only was at home, he had already changed into slacks and a flowered loose-hanging shirt. He came lunging into the living room, and threw an arm around his father, holding the other stiff at his side. One ear was plastered with surgical tape. \"Well, you finally made it! Some haul, dear from Moscow! How are you, Dad?\" \"I\u0027ve just visited the California.\" \"Oh, Jesus. Bourbon and water?\" \u0027Not that much water, and damned rich on the bourbon. What happened to your arm?\" \"Jan told you about how I ran into those japs, didn\u0027t she?\" \u0027She didn\u0027t tell me you were wounded.\" \"It\u0027s just a few stitches. I\u0027m still flying, that\u0027s the main thing. Come, it\u0027s cooler out here, Dad.\" In the shadowy screened porch, Pug bitterly described the California\u0027s state. Warren was scornful. The battleship Navy had been a lot of sleepy fat cats primed for defeat, he said; obsessed by promotions and competition scores, ignorant of the air, and forever drilling to fight the Battle of Jutland against the japs. But the Japs had grasped naval aviation and had made a slick opening play. \"We\u0027ll get \u0027em,\" he said, \"But it\u0027ll be a long hard pull, and the naval aviators\u0027ll do it. Not the battlewagons, Dad.\" \"Seems to me a few airplanes got caught on the ground,\" Pug growled, -feeling the bourbon comforting and radiant inside him. \"Sure, I admit that. This whole base was all unbuttoned. Dad, I\u0027ll tell you one thing, if Halsey had been Cincpac, none of it would have happened. He\u0027s been so ready and eager for war, his tongue\u0027s been hanging out. He\u0027d have kept this goddamn fleet in condition Zed, and on dawn and dusk GQ\u0027s for a year. He\u0027d have run patrols till the planes fell apart. He\u0027d have been the most hated son of a bitch in Hawaii, but by God, when they came he\u0027d have been waiting for \u0027em! Why, we stripped ship in November. We\u0027ve run darkened ever since, with warheads in our torpedoes, and bombs in the planes, and depth charges on ready. Of course he does go galloping about like an old mule with a bee up its ass.\" Warren \u0027described Halsey\u0027s futile dart south of Oahu looking for Japanese carriers. The direction had seemed dead wrong to Warren Henry and the other fliers. The only place for the japs to be lurking was north, where they could dash straight for home after the strike. But Halsey-so they later learned-had received a direction-finder report of heavy radio signa to the south, so southward he had roared, launching all his torpedo Planes and dive bombers. For hours the planes had scoured over empty wen, dE the Enterprise had sheepishly summoned them back. The report had the commons been st of direction-finder errors, a reciprocal bearing. The japs had lain in the exact opposite direction-north. By then, of course, catching up with them had been hopeless. His father grunted incredulously. \u0027Is that what happened? God Almighty, that\u0027s nearly as stupid as the battleship performance.\"\"Well, yes, somebody on that big staff should have thought of the reciprocal bearing. But nobody\u0027s head was too clear, and I don\u0027t know -it was one carrier against four or five, anyway. Maybe it was for the best. At least he did try to find a fight. Listen, Dad, our own A.A. shot down many of our planes, and they sure peppered me. It was just a his toric snafu all around. Tell me how\u0027s Briny? Did you see him in Manila?\" The bourbon helped Victor Henry\u0027s sickened spirit, but talking to Warren was better medicine. Slanting light from the living room on his son showed him changed: older, more relaxed, rather hard-bitten, the dangling cigarette almost a part of his features. He had fought with the enemy and survived. That edge was in his bearing, though he deferred carefully to Pug. \u0027I\u0027ll tell you, Dad,\" he said, bringing him a refill from the other room, \"I\u0027m not saying this wasn\u0027t a defeat. It was the worst defeat in our history. The Navy will be a hundred years living down the shame of it. But by God, the Congress voted for war today with one dissenting vote! Only one! Think-what else could have accomplished that? The japs were stupid not to move south and dare Roosevelt to come on. He\u0027d have been in trouble.\" Warren took a deep drink of bourbon. \"What\u0027s more, operationally they blew this attack. They had us flattened with the first wave. All they did the second time was paste the wagons some more and bomb a few smaller ships. What good was that? Our oil farm was sitting behind the sub base, wide open. Dozens of fat round juicy targets you couldn\u0027t miss with your hat. Why, if they\u0027d gotten the oil-and nothing could have stopped them-we\u0027d be evacuating Hawaii right now. The fleet couldn\u0027t have operated from here. We\u0027d be staging a Dunkirk across two thousand five hundred miles of ocean. Moreover, they never hit the subs. They\u0027ll regret that! They never touched our repair shops-\" \u0027I\u0027m convinced,\" Pug said. \"I\u0027m sure that jap admiral is committing hara-kiri right now over his disgraceful failure.\" \u0027I said it was a defeat, Dad.\" Warren, unoffended, came back sharply but pleasantly. \"I say they achieved surprise at high political cost, and then failed to exploit it. Say, it\u0027s another quarter of an hour to dinner. How about one more shortie?\" Pug wanted to examine his mail, but Warren\u0027s acumen was rejoicing his heavy heart, and the strong drink was working wonders. \"Well, very short.\" He told Warren about his meeting with Achniral Kimmel. The young aviator flipped a hand at the complaint of too much war material going to Europe. \u0027Jesus, him too? just a feeble excuse. It\u0027s got to cost several million lives to stop the Germans. Whose lives? Could be ours! The Russians made one deal with Hitler, and they could make another one. The Communists signed a separate peace in 1917, you know. It was the first thing Lenin did on taking over. The whole game here is to keep the Soviet union fighting. That\u0027s so obvious!\" \"You know, you ought to go over in your spare time, Warren, an(i straighten out Cincpac.\" \"I\u0027d be glad to, but I\u0027ll have to move fast to catch him while He\u0027s Cincpac.\"\"Oh? You got some inside scoop?\" \"Dad, the President isn\u0027t going to resign, and somebody\u0027s head\u0027s got to row.\" \"Dinner, fellas,\" Janice\u0027s voice called. \"The only thing is,\" Warren said, as they walked in, \"those Russians are going to exact payment for all those lives one day. They\u0027ll get to annex Poland, or Czechoslovakia, or some damn thing. But that\u0027s fair enough, maybe. Russia keeps swallowing and then puking up Poland every half century or so. What was it like in Moscow anyway, Dad? What are the Russkis like? How much did you see?\" Pug talked straight through dinner about his adventures in Russia. Janice had provided several bottles of red wine. It wasn\u0027t very good wine, and he wasn\u0027t much of a wine drinker, but tonight he poured down glass after glass, thinking that red wine was really remarkably fine stuff. Continuous talking, another unusual thing for him, eased his heart. Janice asked questions about Pam Tudsbury, which led him to relate his experiences in England too, and his flight over Berlin. Warren pressed his father for details of the bomb racks and release mechanisms, but Pug could tell him nothing. Warren interrupted Pug\u0027s flow of words to describe his run-in with the Bureau of Ordnance over the bombing assembly of his plane, and the improved rack he had manufactured in the shipfitter\u0027s shop, which the Bureau was now grudgingly examining for possible use in all planes. Pug tried to keep surprise and pride out of his face, saying, \"You\u0027ll get no thanks from anybody, boy. Especially if it works! just a reputation as a troublemaker.\" \"I\u0027ll get what I want-bombs that fall straight and hit.\" Over brandy, back on the dark\u0027screened porch, Pug, now fairly close to being drunk, asked his son what he thought he should do, with the California command gone. It was an honest question. His son impressed him, and he thought Warren might give him good advice. Warren laughed and said, \"Dad, learn to fly.\" \"Don\u0027t think I haven\u0027t thought of it.\" \"Well, seriously, you\u0027d better go back to Cincpac\u0027s staff tomorroland pound desks till you get a command. They probably believe that you draw a lot of water with the President. You\u0027ll get what you ask for. But you have to move fast. If Mr. Roosevelt remembers that you\u0027re on the loose again, he\u0027ll send you on some other mission. Although I don\u0027t know, it must be very interesting work, at that.\" \"Warren, I hope you believe me-thanks, thanks, boy, just a little more, this is damn goodbrandy-nearly everything I\u0027ve been doing in the past two years has given me a swift pain in the ass. I don\u0027t know why Mr. Roosevelt chose in his wisdom to make a sort of high-octane errand boy out of me. I\u0027ve talked to great men face to face, and that\u0027s a privilege, sure. If I were planning to write a book or go into politics, or something along that line, it would be dandy. But the bloom soon comes off the rose. You\u0027re a zero to these people. It\u0027s in their manner. You have to watch every sentence you utter and keep your eyes and ears peeled for every move, every word, every tone of some bird who may go down in history, but he\u0027s just another man, basically, and maybe even a big criminal, like Stalin or Hitler. I think you have to have a taste for associating with great men. There are people who do, God knows, who crave it, but I\u0027m not one of them. I never want to get out of sight of ships and the water again, and I never want to see the inside of another embassy.\" \"How did it ever start, Dad? Here, have some more.\" \"No, no, Warren, I\u0027m feeling no pain at all as it is. Well, okay, just wet the bottom of the glass-thanks, boy. How did it start? Well-\" Pug recounted his prediction of the Nazi-Soviet pact, his visits to the President, his assembling of the planes for England, and his reports from Berlin. He felt he was getting loose-tongued. \"Well, that\u0027s the idea. I\u0027ve never discussed these things before with anybody, Warren. Not even your mother. You strike me now as a thoroughgoing professional officer. It does my heart good and it gives me pleasure to confide a little in you. Also, I\u0027m drunk as a fiddler.\" Warren grinned. \"Ha! You haven\u0027t told me a thing. That story about the planes for England cropped up in Time a couple of months ago.\" \"I\u0027m well aware of that\" said his father, \u0027but I wasn\u0027t the one who spilled the beans. You didn\u0027t see my name in that story.\" \u0027I sure didn\u0027t. Dad, don\u0027t you know why the President likes you? You\u0027ve a keen mind, you get things done, you don\u0027t talk-a rare enough combination-and added to all that, you don\u0027t want the job. He must be up to his nates in these people you describe who keep shoving to get near him. He must find You refreshing, as well as useful. There can\u0027t be many patriots in Washington.\" \"Well, that\u0027s an interesting thought. I don\u0027t know why you\u0027re buttering me up, but thanks for calling me a patriot with a keen mind. I do try to be as keen as the next guy, Warren. Possibly I was a wee bit mistaken in that small dispute about carriers versus battleships. If I\u0027d been ordered to the Enterprise, for instance, instead of the California-which Might well have been, had I ever learned to fly-I would have a command right now, instead of a skinful ofbooze. Thank\" Warren. Thanks for everything, and God bless You. Sorry I did so much talking. Tomorrow I want to hear all about your tangle with the Zeroes. Now if my legs will support me, I think I\u0027ll go to bed.\" He did not stir till noon. Janice was out on the back lawn, playing with the baby on a blanket, when her father-in-law emerged yawning on the screen porch in a white silk kimono, carrying a manila envelope. \"Hi, Dad,\" she called. \"How about some breakfast?\" He sat in a wicker chair. \"You mean lunch. No thanks, I\u0027m still off \u0027Schedule from the travelling, Your maid\u0027s making me coffee. I\u0027ll have a look at my mail, then mosey on down to Cincpac.\" A few minutes later Janice heard a loud clink. Victor Henry sat upright staring at a letter in his lap, his hand still on the coffee cup he had set down so hard. \u0027What\u0027s the matter, Dad?\" \"Eh? What? Nothing.\" \"Bad news from home?\" \"That coffee\u0027s mighty hot. I burned my tongue. It\u0027s nothing. Where\u0027s Warren, by the way?\" \u0027Went to the ship. He expects to be back for dinner, but I guess we can never be sure about anything any more.\" \"That\u0027s exactly right.\" His voice and his manner were strained and queer, she thought. Covertly she watched him read and reread two handwritten letters, looking from one to the other, leaving a pile of office mail unopened. \" Say, Jan.\" He stood, stuffing the mail back in the big envelope. \"Yes, Dad. You\u0027re sure you won\u0027t eat something?\" \"No, no. I don\u0027t want to eat. I\u0027m a little tireder than I figured. I may even crawl back in the sack for a bit.\" When night fell, his bedroom door was still shut. Warren came home after seven. Janice told him what had been happening. He cautiously rapped at his father\u0027s door. \u0027Dad?\" Rapping louder, he tried the knob and went into the black room. Soon he came out with an empty brandy bottle. The cork and foil lay in his palm. \"It was a fresh bottle, Janice. He opened it and drank it all.\" \"Is he all right?\" \"He\u0027s just out. Out cold.\" \"Maybe you should look at his mail.\" Warren gave her a frigid glare, lighting a cigarette. \"Listen,\" she said with mixed timidity and desperation, \"those letters, whatever they were, upset him. You\u0027d better find out what the trouble is.\" \"If he wants me to know, he\u0027ll tell me.\" \"What are you going to do?\" \"Eat my dinner.\" Warren did not speak again until he finished his meal. He sat silent, looking straight ahead when food was not before him. \"Dad\u0027s taking the California thing hard,\" he finally said. \"That\u0027s the whole trouble.\" \"Well, I hope that\u0027s all.\" He said, \"Did you listen to the evening news?\" \"No.\" \u0027Big air strike on Manila. They made a mess of the Cavite Navy Yard. That\u0027s all the news Washington put out. But the communicator on the Enterprise told me two submarines were bombed, and one was sunk. That one was the Devilfish.\" \"Oh God, no!\" \"And there\u0027s no word on survivors.\" \"Maybe it\u0027s a mistaken report.\" \"Maybe.\" \u0027Warren, I feel in my bones that Byron is all right.\" His chilly grim face looked much like his father\u0027s. \"That\u0027s comforting. Till we get some more definite information.\" o military specialists, \"Clark Field\" is the name of a United States Tdefeat as grave as Pearl Harbor. With this catastrophe at the main -Army airfield on Luzon, the Philippines lost their air cover; the Asiatic Fleet had to flee south; and the rich south sea islands and archipelagoes were laid bare at a stroke for conquest. There has never been a rational explanation for what happened there. Yet Congress did not investigate it. Nobody was relieved. History stillignores Clark Field, and remembers Pearl Harbor. Clark Field half a day late for immortality.Twogreatdisastersfivethousandmilesapartinonedayare(was) boring, and like any good editor, history has cut the repetition. Clark Field occurred half a day later than Pearl Harbor because the Japanese could not, for all their clever planning, arrange for the dawn to come up everywhere at once. They gave up hope of surprising the Philippines, for the sunrise took five hours to traverse the bulge of ocean from Hawaii. Their bombers waited for good weather in starting from Formosa, and droned straight in over the main island of Lazon just before high noon, expecting alert and violent opposition. The ground observers, on a war footing after the Pearl Harbor news, sent a spate of reports to the command center, tracking the attackers from the coast all the way to their objective. They got there unopposed, nevertheless, and found the fighterb and bombers of the Far East Air Force-a formidable armada, built up in recent weeks as the hard core of resistance to japan-lined up on the ground. This ignominious occurrence remains unaccounted for. It was the Japanese, this time, who were surprised, very pleasantly so. They laid utter waste to General Douglas MacArthur\u0027s air force, and flew away. Thus ended, in a quarter of an hour, any hope of stopping the Japanese in the south seas. No course remained for the American forces there but last-ditch stands and surrenders. The Japanese at once set about to cash in on this startling success. Step one was to make Manila Bay uninhabitable for the United States Navy. Two days after Clark Field a horde of bombers came in and carefully, painstakingly destroyed the Cavite Naval Base at their leisure, having no air defenders to worry about. The Devilfish and Byron Henry were at dead center of this attack. When the attack actually began, Byron was ashore with a working party, drawing torpedoes. The terrifying wail of the siren broke out not far from the big open shed of the torpedo shop. The overhead crane clattered to a halt. The echoing clanks and squeals of repair machinery quieted down. Chiefs, torpedomen, and machinists\u0027 mates in greasy dungarees trotted away from their benches and lathes to take battle stations. Byron\u0027s party had four torpedoes in the truck. He decided to load two more before leaving. His orders called for six, and false alarms had been plentiful ever since Clark Field. But with the overhead crane shut down, it was slow work moving an assembled Mark 14 torpedo, a ton and a half of steel cylinder packed with explosives, propellant, and motor. The sweating Devilfish sailors were rigging one to the guy chains of a small cherry-picker crane when Byron\u0027s leading torpedoman glanced out at the sky. \"Mr. Henry, here they come.\" Hansen had the best eyes on the Devilfish. It took Byron half a minute to discern the neat V of silvery specks shining in the blue, far higher than the German planes he had seen over Poland. The old Warsaw feeling overwhelmed him-the fear, the exhilaration, the call to look sharp and act fast. \"God, yes, fifty or sixty of \u0027em,\" he said. I \u0027 I \u0027I counted fifty-seven. They\u0027re headed this way, sir. Target angle zero. \"So I see. Well, let\u0027s hurry.\" The sailor at the wheel of the cherry picker began gunning the motor, tightening the chains on the torpedo. \"Hold it!\" Byron exclaimed, hearing a distant explosion. More CRUMPS! sounded closer. The cement floor trembled. Now for the first time since Warsaw Byron\u0027s ears caught a familiar noise-a high whistle ascending in pitch and getting louder. \"Take cover!\" The sailors dove under the truck and a heavy worktable nearby. An explosion blasted close to the shed, then a cataract of noise burst all around, the floor shook and heaved, and Byron too threw himself under the table onto rough cement coaled with sandy grease. Quarters were narrow here and his face was jammed against somebody\u0027s scratchy dungarees. Byron had never endured a bombing like this. Over and over he winced and gritted his teeth at the cracking blasts that shook the ground. It seemed to him a fifty-fifty chance that he would get killed in the next minute. But at last the noise lessened as the bombing moved along to another part of the base. He crawled free and ran outside. Flame and smoke were billowing all around and walls were starting to crash down. The serene blue sky was flecked with A.A. bursting impotently far below the bombers, which were quite visible through the smoke. The Devilfish sailors came huddling around Byron, brushing themselves off and staring at the fires. \u0027Hey, Mr. Henry, it looks kind of bad, don\u0027t it?\" \u0027Are we going back aboard?\" \u0027Should we finish loading the fish?\" \"Wait.\" Byron hurried through the smoky shed to see the situation on the other side. Hansen came with him. Hansen was an old able submariner, a fat Swede from Oregon more than six feet tall, with a bushy blond beard and a belt pulled tight under a bulging paunch. Hansen had failed to make chief because once in Honolulu he had resisted arrest by three manne shore patrol men, had given one a brain concussion, and had broken another\u0027s arm. He liked Byron and had taught him a lot without seeming to; and Byron had grown his beard partly in sympathy with Hansen, because the captain had been harrying the stubborn Swede to trim it or remove it. On the other side of the torpedo shop, large fires also roared and crackled, fanned by a sea wind. In the street a bomb had blown a large crater water was\u0027 shooting up out of a brokenmain, and fat blue sparks were \u0027Hashing among the torn and twisted underground cables. Three heavy Navy trucks stood halted by the smoking pit, and their Filipino drivers, chattering in Tagalog, were peering down into the hole. Byron shouted above the chaotic din, \"Looks like we\u0027re stuck, maybe, Hansen. What do you think?\" \"I don\u0027t know, Mr. Henry. If these trucks would move clear we could probably get out by doubling back around the Commandancia.\" One of the drivers called to Byron, \"Say, can we drive through this shop? There a way through to the wharf?\" Byron shook his head and raised his voice over the shrieking siren and the yells of fire fighters dragging hoses along the street. \"All blocked on that side! Solid fire, and some walls down!\" Squinting up at the wind-driven smoke and flame, Hansen said, \"Mr. Henry, the fire\u0027s gonna spread to this shop and all these fish are gonna go.\" Byron understood the pain in the torpedoman\u0027s voice. Without torpedoes, what good was a submarine squadron? The shortage was already well known and acute. He said, \"Well, if you could operate that overhead crane, maybe we could still pull out a few.\" Hansen scratched his balding head. \"Mr. Henry, I\u0027m not a crane man.\" Standing by the flooding crater was a lean civilian in overalls and a brown hard hat. He said, \u0027I\u0027m a crane operator. What\u0027s your problem?\" Byron turned to the Filipino driver. \"Will you guys give us a hand? We want to move some torpedoes out of here.\" After a rapid exchange in Tagalog with the other drivers, the Filipino exclaimed, \"Okay! Where we go?\" \u0027Come on,\" Byron said to the civilian. \"In this shop. It\u0027s an overhead crane.\" \u0027I know, sonny.\" In the bay off Sangley Point, meanwhile, a gray speedboat swooped alongside the Devilfish, which was under way, fleeing the Navy Yard and heading for the submarine base at Bataan. It was Red Tully\u0027s speedboat, and he was bringing the skipper of the Devilfish back from the base. Branch Hoban jumped from the speedboat to the forecastle of his vessel, as Captain Tully yelled up at the bridge through a megaphone, \"Ahoy the Dlfishl What about Seadragon and Sealion?\" Lieutenant Aster cupped his hands around his mouth. \"They were all right when we left, sir. But they\u0027re stuck alongside. No power.\"\"Oh, Christ. Tell Branch to lie off here. I\u0027ll go have a look.\" \u0027Shall we pull the plug, sir?\" \u0027Not unless you\u0027re attacked.\" Hoban arrived on the bridge as the speedboat thrummed away. \u0027Lady, what about Briny and the working party?\" Aster gestured back toward the Navy Yard, which appeared solidly afire under towering pillars of smoke. \"They never showed. I figured I\u0027d better get away from alongside, Captain.\" \"Damn right. Glad one of us was aboard.\" In a short time the speedboat returned. The coxswain swerved it alongside and Tully came aboard the Devilfish white-faced and hoarse. \"Bad business. They got straddled with bombs. I think the Sealion\u0027s a goner-she\u0027s on fire, her after engine room\u0027s flooded, and she\u0027s sinking fast.\" \"Ye gods,\" Hoban said. \"We were outboard of her.\" \"I know. Damn lucky.\" \u0027The Pigeon\u0027s trying to tow the Seadragon clear. Better go back in there, Branch, and see if you can help.\" \u0027Aye aye, sir.\" A sooty motor whaleboat was puttering toward the Devilfish. \"Who\u0027s this now?\" Tully said. Hoban shaded his eyes. \"Say, Lady, is that Pierce?\" \"Yes, it\u0027s Pierce, sir,\" Lieutenant Aster said, glancing through binoculars. Sailors ran out on the forecastle to help the young seaman scramble aboard. He came to the bridge, his eyes showing white and his mouth red as a minstrel\u0027s in a soot-covered face. -Captain, Mr. Henry sent me to tell you the working party\u0027s all right.\" \"Well, thank God! Where are they?\" \"They\u0027re taking torpedoes out of the shop.\" Tully exclaimed, \"The torpedo shop? You mean it\u0027s still standing?\" \"Yes, sir. The fire sort of blew away in another direction, so Mr. Henry and Hansen got these trucks and-\" \"You come with me,\" Tully said. \u0027Branch, I\u0027m going back in there.\" But when the squadron commander and the sailor reached the blazing Navy Yard, there was no way to get to the torpedo shop. Fallen buildings and smoking debris blocked every route into the wharf area. Tully circled in vain through drifting smoke in a commandeered jeep, avoiding bomb craters,rubble, and careering, screaming ambulances. \"Captain Tully, sir, I think I see them trucks,\" said Pierce. He pointed to a grassy area on the other side of a small bridge crowded with cars, ambulances, and foot traffic. \u0027See? Over there by the water tower.\" \u0027The big gray ones?\" \"Yes, sir. I think that\u0027s them, sir.\" Tully pulled the jeep out of the road and shouldered his way over the bridge. He found Byron Henry sitting on top of heaped torpedoes in a truck, drinking a Coca-Cola. Byron was almost unrecognizable, for his hands, face, and beard were sooty. The three trucks were full of torpedoes, and two cherry-picker crane trucks held more. A small army truck was piled high with stencilled c,rates and boxes. The Filipino drivers sat on the grass, eating sandwiches and cracking jokes in Tagalog. The Devilfish working party lay sprawled in exhausted attitudes, all except Hansen, who sat smoking a pipe with his back to a huge tire of the truck on which Byron perched. \"Hello there, Byron,\" Tully called. Byron turned around and tried to jump up, but it was hard to do on the heap of long cylinders. \"Oh, good afternoon, sir.\" \"How many did you get?\" \"Twenty-six, sir. Then we had to leave. The fire was closing in.\" \u0027I see you scooped up a truckload of spare parts, too.\" \u0027That was Hansen\u0027s idea, sir.\" \"Who\u0027s Hansen?\" Byron indicated the torpedoman, who had leaped to his feet on recognizing Captain Tully. \"What\u0027s your rating?\" \"Torpedoman first class, sir.\" \u0027That\u0027s where you\u0027re wrong. You\u0027re a chief torpedoman.\" Hansen\u0027s beard opened in an ecstatic smile, and his eyes gleamed at Ensign Henry. Tully looked around at the trove of rescued torpedoes. \"You got exploders?\" \"Yes, sir.\" \"Well, good. Suppose you drive this haul around to Mariveles.\" \u0027Aye aye, sir.\" \u0027I\u0027ll want a report on this, Byron, with the names and ratings of your working party and of these drivers.\" \"Yes, sir.\"\"Any chance of getting more fish out of there?\" \u0027Depends on what the fire leaves, sir. The shop hadn\u0027t caught when we left, but now-I don\u0027t know.\" \"All right. I\u0027ll see about that. You get going.\" Next morning Byron presented himself to Captain Tully. The squadron commander was working at a desk in a Quonset but on the beach at Mariveles Harbor, a deep cove in the mountainous Bataan peninsula. Behind Tully\u0027s tanned hairless pate a large blue and yellow chart of Manila Bay covered most of the plasterboard wall. Byron handed him a twopage report. Tully glanced through it and said, \u0027Pretty skimpy document.\" \u0027It has the facts, Captain, and all the names and ratings.\" Tully nodded and dropped the sheets in a basket. \u0027Branch told me you\u0027re allergic to paperwork.\" \"It\u0027s not my strong point, sir. I\u0027m sorry.\" \"Now! did he tell you what I want you for?\" \"Just something about salvage, sir.\" \u0027Byron, the japs are bound to land soon. We probably can\u0027t hold Manila, but as long as MacArthur hangs on to Bataan, the squadron can go on operating out of Mariveles. This is a hell of a lot closer to japan than any other sub base we\u0027ve got now, or will have for a good long while.\" Tully stood, and gestured at the wall. \"So-the idea is to clean out Cavite, what\u0027s left of it, and Manila, of every single item we can use, and fetch it here. You seem to have a sort of scavenger instinct.\" Tully laughed, and Byron responded with a ] polite smile. \"You\u0027ll work on this until the Devilfish goes out on operations. Lieutenant Commander Percifield is in charge, and you\u0027ll report to him now over at Admiral Hart\u0027s headquarters in Manila. He\u0027s expecting you.\" \"Aye aye, sir.\" \"While you\u0027re there, look in on Admiral Hart. He\u0027s an old submariner, you know. I told him about those torpedoes. He appreciated it, and is writing a letter of commendation.\" \u0027Yes, Captain.\" \"Oh, and incidentally, I\u0027ve written your father about your exploit, though Lord knows when and how it\u0027ll catch up with him.\" Tully irresolutely,took off his glasses, looked at the erect impassive ensign, and swiveled to and fro. \"Now, Byron. Do you still want to go to the Atlantic? With all hell busting loose out here?\" \"Yes, sir. I do want that.\" \"You do? When there\u0027s only our squadron now to oppose the japs on the sea? When this is where the fighting is?\" Byron did not reply.","sourceLink":"http://novel.tingroom.com/jingdian/1587/47214.html","bookId":1254,"book":{"id":1254,"title":"The Winds of War ","description":" ...","cover":"http://novel.tingroom.com/file/upload/201606/24/13-38-35-70-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1587","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
