{"id":43138,"no":36,"title":"Chapter 10","content":"\u0027As for your wife and baby in Italy-that\u0027s unfortunate, but you know, she\u0027ll be an enemy alien now.\" \"Sir, we\u0027re not at war with Italy. Not yet.\" \"Oh, that\u0027s inevitable. Hitler\u0027s scheduled to make this big speech today, you know. Everybody expects him to declare war, and old Musso will just follow suit, p.d.q. Your wife will be interned, but that\u0027s no cause for alarm. After a while she\u0027ll be exchanged. The Italians are civilized people. I\u0027m sure she\u0027ll be all right.\" \"Captain Tully, my wife\u0027s Jewish.\" The squadron commander looked surprised, and turned a bit red. He avoided Byron\u0027s eye. \"Well now, that I didn\u0027t know.\" \"My captain knows. I\u0027ve told him. The Italians-and what\u0027s more to the point, the Germans-will class my baby son as Jewish, too.\" Blowing out a long audible breath, Tully said, \"Okay. That\u0027s a problem. I still don\u0027t see what you can do about it. Our submarine operations in the Atlantic will be minor for a long, long time. Here\u0027s where we need you.\" He looked up at the ensign, who stood at attention, blank-faced. \"However, Byron, I\u0027m going to send a dispatch, recommending your transfer to Submarine Force Atlantic-as and when the Devilfish gets a replacement for you. Not before.\" Byron Henry showed no sign of the relief that filled him. \"Thank you, Captain Tully.\" The squadron commander opened a desk drawer. \"One more thing. Your commanding officer concurs in this, so congratulations.\" He laid on the desk before Byron a gold pin, the dolphins of a submariner. (from WORLD EMPIRE LOST) Hitler\u0027s Blowup On December 11, the final calamity occurred. Adolf Hitlerafter pausing for four days in which History herself must have held her breath-summoned the Reichstag and declared war upon the United States. Franklin Roosevelt, in his war speech to Congress on December 8, had not so much as mentioned Germany. And with good reason! The surge of war spirit in his country was directed one hundred percent against \"infamous\" Japan. As usual, the wily President did not stick his neck out one inch beyond the stretch of public opinion. For four anxious days it appeared to some of our staff that the Pearl Harbor attack might prove the great break of the war for us. Conceivably America might turn its back entirely on Europe to cope with Japan; the hysterical war pressure built up by Roosevelt would all vent itself ihto the Pacific Ocean, drying up Lend-Lease; and we would at last have the breathing space in which to strangle England and knockout the Soviet union, after which we could deal with the USA in our own time and fashion. However, the Fuhrer was under violent Japanese pressure to \"honor\" the so-called Tripartite Pact. A Pact Becomes a Trap This pact was mainly a propaganda sham, like the Pact of Steel between Germany and Italy. Japan joined the Pact of Steel in 1940, and so it became the Tripartite Pact, and the chimera of the worldwide \"Axis\" was born. It was a hollow bluff. Italy of course was a zero. Japan wanted to threaten the Americans with Germany, and Hitler wanted to threaten them with Japan. By uniting in a pact, the two poor nations hoped to paralyze into inactivity the rich notion that lay between them. But the earth is round, and another powerful notion lay between them in the other direction-the Soviet union. This was a different matter! Germany and Russia were linked by Ribbentrop\u0027s nonaggression pact. Therefore our diplomats had written a clause into the Tripartite Pact, saying that relations with the Soviet union would not be affected by the new treaty. When we began operations against Russia, the Japanese found this clause of ours a very lucky escape hatch. They politely cited it and the neutrality pact they had meantime signed with Russia, and declined to march. They might do so later when conditions permitted, they said-meaning, when Germany had done all the fighting and bleeding, and the winnings were about to be raked in. But with Pearl Harbor, global conditions suddenly reversed; and now Japan demanded that Germany come to her aid against America, though she had failed Germany against Russia! It is self-evident that Adolf Hitler owed the Japanese nothing. The pact obliged the partners to assist each other only if one was attacked by a third party. To call Pearl Harbor an \"attack\" by America on Japan was stretching language, even in Oriental rhetoric. Hitler certainly had the right to demand at least that Japan should now as a quid pro quo declare war on the Soviet union. The news of such a Japanese act would have raised the spirits of our snowbound troops in Russia beyond all measure. it might have changed the whole picture. But Hitler never made the demand. He allowed Japan to stay on neutral terms with Russia, while he plunged the German people into war with America. With this one mystifying blowup, the Fuhrer threw away his historic gains and the future of the Reich. Why? I myself was on an inspection tour by air of the Moscow front when the Fuhrer journeyed to Berlin to declare war. When I saw him again at Wolf\u0027s Lair in mid-December, he was very unconcerned and airy-fairy about the United States. In dinner table talk one evening when I was present, he calledAmerica a mongrel nation, half Jewified and half Negrified, incapable of making serious war. The United States would have its hands full just with Japan, he crowed, and would probably be defeated. There was no chance that it could intervene in Europe. So he said; but I believed then, and still do, that this was cheerful blather for his subordinates, or narcotic self-deception. Unlike the Japanese leaders, Hitler knew at heart the one crucial military fact about America: that nothing must be done to awaken and unite that confused, quarrelsome, luxury-rotted titan. Pearl Harbor had done it. This war was at bottom a chess game with men and nations played between two wills and two world views, which had been competing since 1933-between Adolf Hitler and Franklin D. Roosevelt. Hitler started with a handicap of rook and two pawns, as it were, in industrial plant, population, allies, and natural resources. These odds compelled his flamboyant and desperate style. The man in the wheelchair could afford the cautious game, waiting for his opponent to defeat himself by unsound gambles. Hitler appeared to outplay Roosevelt brilliantly, year after year. His bloodless victories before 1939, his swift conquest of Poland and western Europe, and his breathtaking seizure of European Russia in 1941, turned the game heavily in his favor. Adolf Hitler was within sight of checkmate, when Japan attacked Pearl Harbor. That was the break Roosevelt had been waiting for. \" am well aware of the conventional explanation that Hitler felt we had a de facto war going with America anyway in the Atlantic, and wanted to beat Roosevelt to the punch with his declaration, for reasons of prestige. It is even contended that declaring war on America was a clever move to boost our morale, by taking the public mind Off our halts and setbacks on the Eastern Front. But these conjectures ignore the fatal failure to demand Japanese action against Russia, and also the text of the actual war declaration. This unstatesmonlike document is one long scream of despair and rage, all directed against Roosevelt. My judgment will always be that Hitler saw the game unexpectedly go glimmering, and In anger kicked over the board. Finis Germaniae Other writers follow Churchill and place the turning point of the war a year later, in the triple cluster of events-Stalingrad, El Alamein, and the North African landings-when the turn became visible in the field. But the true turn was Pearl Harbor. We scored our greatest successes, without question, and expanded our short-lived German empire to its amazing farthest reach only in 1942, long after Pearl Harbor and the halt atMoscow. Our U-boats almost mastered the Atlantic, sending whole fleets of British and American ships to the bottom. Our armies marched to the Caucasus Mountains,. the Caspion Sea, and the Nile. Our energetic ally, Japan, captured her East Asian empire in swift blazing victories. But one memory haunted me during all those victories: the airplane trip I had made to the Moscow front right after Pearl Harbor. From the air I saw German tanks, trucks, and gun carriages straggled over hundreds of miles of desolate plains, frozen in mud or bogged in snow under the gloomy low Russian sun. I saw dead horses lying in the snow, and our soldiers hacking at their frozen carcasses for meat to eat. We landed often among and boys shivering in ragged green-gray summer uniforms,buildingfiresundertheirveh(man) icles to keep the radiators from bursting and the oil from getting too viscous to flow. Endless were the complaints I heard then about the lack of boots, heavy socks, gloves, antifreeze, and the solve that was supposed to free the tanks\u0027 telescopic sights. When the telescopes froze stuck without the salve, the tankists could not see to maneuver and protect themselves. Pathetic were the shivering soldiers wearing ladies\u0027 fur coats and boas, collected by Goebbels and sent to the front. My trip took me within sight of Moscow\u0027s barrage balloons and antiaircraft flashes. There I tasted the full bitterness of that tantalizing halt, and there I first heard that we were at war again with America. In my heart I knew that spelled, once and for all, finis Germaniae. Germany after 1941 was like a charging elephant with a bullet in its brain, trampling and killing its tormentors with its last momentum before falling. The bullet was Pearl Harbor. World Empire Lost With these comments, I conclude Volume I of my operational analysis of the Second World War, and a word of summary is in order. General George Marshall, in his 1945 victory report, called Germany, Japan, and Italy \"three criminal nations bent on easy loot.\" But if we had won, as we almost did, the leaders who would have hung would have been Stalin, Churchill, Roosevelt, and Mr. Marshall. The criminal nations would have been the Allies, who tried to keep their plutocratic loot of previous centuries by murdering German and Japanese women and children from the air. Hitler did not order Hiroshima and Dresden! There is no morality in world history. There are only tides of change borne on violence and death. The victors write the history, pass the judgments, and hang or shoot the losers. In truth history is an endless chain of hegemony shifts, based on the decay of old political structures and the rise of new ones. Wars are the fever crises of those shifts. Wars are inevitable; there will always be wars; and the one war crime is to lose. That is the reality, and the rest is sentimental nonsense. \n We went on following Adolf Hitler to the last, to unbelievable triumphs and unparalleled disasters, from Pearl Harbor to the fall of Berlin, because he was our national destiny. A romantic idealist, an inspiring leader, dreaming grand dreams of new heights and depths of human possibilities, and at the same time an icy calculator with iroti willpower, he was the soul of Germany. We are a romantic people, and Hitler was German Romance incarnate. No truthful history of our nation will ever be written which does not face that fact. He had his faults, including a definite taste for cruelty, a certain ingrained petit bourgeois vulgarity, an exaggerated opinion of his military acumen, and the well-known, regrettable tendency to anti-Semitism. Such were the blemishes of this worldhistorical individual, but no human being is perfect. TRANSLATOR\u0027S NOTE: Armin von Roon properly breaks his two-part operational analysis of the Second World War at Pearl Harbor. In the period covered by World Empire Lost, a European war like World War I raged, with much the same lineup; for that reason Winston Churchill co/led it a continuation after a truce, and both conflicts together a new Thirty Years\u0027 War. But all that time, the United States was out of it. After Pearl Harbor, we were in it up to our necks, and it become the Rest global war. That is another story. Roon\u0027s summaries from his second volume have recently appeared in Germany under the title World Holocaust. Analyzing mainly Germany\u0027s defeats and downfall, it has not been much of a success. His concluding estimate of Hitler overlooks one or two small points. This able and resolute homicidal maniac, using modern Germany as his murder instrument, directly caused between twenty-five and thirty-five million human deaths; the exact figure will never be known. To stop him cost the world billions, maybe trillions, of dollars. Had the German people shut this strange individual away in an insane asylum, instead of setting him up as their adored leader and throwing their full strength behind him for twelve years, these deaths and this waste would not have occurred. On the historical record Adolf Hitler was certainly the worst liar, doublecrosser, destroyer, and mass murderer in the world\u0027s amnals. Roon might have mentioned these facts among Hitler\u0027s blemishes.-V.Him door stood open to Natalie\u0027s bedroom, and Hitler\u0027s screeching Twoke the baby. In the sitting room Natalie had the radio turned low, but at the Fuhrer\u0027s sudden shriek-\u0027ROOSEVELTI\u0027-she and Aaron looked at each other in alarm, and Louis began sobbing. \u0027He is a maniac, after all.\" Slumped in an armchair in a bathrobe and muffler, his sunken red-shadowed eyes watering, Aaron Jastrow shook his head and lifted a trembling teacup to his mouth, as Hitler went on with his hoarse bellows, sneers, whispers, and yells. \"Extremely clever, persuasive, and forceful, but a maniac. I confess I never grasped it before. I thought he playacted.\" With a faintly contemptuous glance at her uncle, Natalie went to the baby. \n The Fuhrer\u0027s speech, starting with the usual complaints of injustices endured by Germany and himself, had worked up to the naming of the one supreme war criminal responsible for all the bloodshed and misery that he, the Fuhrer, had worked so hard to avert, the insane hypocrite who had sold out his country and himself to the Jews, thwarted Germany at every turn, and loosed destruction on mankind. After a strangely long pause, came the wild scream that woke the child: \"Roo-oo-ss-felt!\u0027 And this bitter hate-filled animal cry somehow woke Aaron Jastrow, too. In recent years, Jastrow had listened to few Hitler speeches. They bored him. He was a historian, and history\u0027s pages were crowded with such flamboyant tyrants who had strutted their brief seasons, done their damage, bunt their grandiose monuments, and passed away. So it would be with Hitler, he had once written after a visit to Germany, in a cool meditative essay in Harper\u0027s entitled \"Der Fuhrer: Thoughts Before Midnight.\" In this essay, Jastrow had pigeonholed the Nazi boilup with other brief violent mass upheavals which through the ages had come and gone. Sometimes they changed the order of things, like the Crusades and the French Revolution; sometimes they left only destruction, like the flashflood massacres of Alaric and Tamerlane. Perhaps this weirdly glorified little beggar had something to contribute to the world. His call for a new unified order in Europe made a certain sense. He might start a world war; he might win it or he might lose it; but in any case he wouldd at last die, and the world would wag on. God-Jastrow used the term with arch irony to denote the blind drift of events-like a good roadside juggler, did his act with whatever objects came to his hand. If Hitler triumphed and brought a tyrannic German unity to Europe, or even to the whole earth, lasting a century or two, perhaps that meant he had been needed at this time on our tiny earth. What happened, after all, was only what had to happen. There were no dice in, heaven. The human spirit in its unending quest for freedom would either soften and tame its Teuton masters at last, or would crack the prison Of tyranny, as a grass blade cracks a concrete pavement. Having thus boxed the German dictator away in some neat paragraphs, Aaron Jastrow had mentally shelved the man. Hitler broke from Aaron Jastrow\u0027s mental box on this day, with his scream of Roosevelt\u0027s name. As the dictator went on with his long, almost raving, yet mordant comparison between Roosevelt and himself-he the poor son of struggling parents, Roosevelt the pampered only child of a millionaire; he the common soldier of the First World War, enduring rain and gunfire and muck for four years, Roosevelt the highborn insider, enjoying a safe cushy desk job in the Navy Department; he the gassed veteran, lying penniless in a hospital, Roosevelt the tricky postwar financial speculator doubling his inherited wealth; he the restorer and rebuilder of a defeated, prostrate nation, Roosevelt the economic tinkerer, the wrecker of a rich country with his crackpot New Deal schemes; he the valiant fighter of old wrongs, the messianic unifier ofEurope, Roosevelt the master war cnal, seeking to stave off the future and preserve the world hegemony of the Jews -listening to this ferocious, crazed, queerly coherent fantasy, Aaron Jastrow wavered in his philosophic stance, and finally became scared. The Italians had already cancelled the exit visas of Americans. The charge had told Jastrow that this was just a precautionary move, and that they should still plan to leave on the fifteenth if meantime war was not declared. For days Jastrow had slept and eaten little. Now Hitler\u0027s speech, as he listened, seemed to be clanging shut an iron door. \"Well?\" Natalie said, carrying in the blanket-wrapped squalling baby. \"Is there any hope?\" \"He hasn\u0027t declared war yet. Not in so many words.\" In an absent practiced way, without much effort at modesty, she opened her sweater, suit jacket, and blouse, flashed a white breast, and drew the brown sweater over the baby. \u0027y is it so much colder in this room? It\u0027s icy, and the more-\"- Jastrow put a finger to his lips. Hitler was whipping himself up to a crescendo. His audience, hushed for a long time, broke out in applause, cheers, and roars of \u0027Sieg Heil!\" \"Now what was that, Aaron?\" Jastrow raised his voice over the raucous noises of the crowd. \"I\u0027m afraid that was it. He said he\u0027s called in the United States diplomats and given them their papers. That started the cheering.\" \"Well, all I can say is, I couldn\u0027t be less surprised.\" Natalie stroked the baby\u0027s cheek with a finger, and dolefully smiled as it quieted and began sucking. \"You\u0027re just hungry, monkey, aren\u0027t you?\" Her uncle said \u0027Mussolini still has to talk. We\u0027ll know in another hour or so.\" \u0027Oh, Aaron, what choice has he?\" He shut off the radio. \"Well, that\u0027s that. I believe I\u0027ll have a glass of sherry. You, too?\" \"No, no. I\u0027d better keep my wits about me today, what\u0027s left of them.\" Jastrow poured and gulped a glassful, then took another, and shrank in his armchair, sipping it, looking vacantly around at the high long frigid room paed with suitcases and wooden boxes. The hotel was silent and the street outside was silent. \u0027Don\u0027t despair, Natalie. In 1939 E Duce did manage to squirm out of it, you know. He\u0027s no use to Hitler militarily. The Italians are sick and sour and beaten. If he declares war against the United States, he might be assassinated, and Hitler surely doesn\u0027t want that. Besides, he\u0027s wily. \n He may well find some weaseling formula, and we may yet be on that plane on the fifteenth.\" \u0027Oh, Aaron, quit it, for God\u0027s sake. He\u0027ll declare war.\" Jastrow sighed heavily. \u0027I suppose so. Natalie, I\u0027m sorry, deeply and tragically sorry.\" She held up a hand, palm out. \"No, no. Don\u0027t. What\u0027s the use?\" \"let me have my say. I simply can\u0027t bear the way I\u0027ve involved you and your baby. I\u0027ve never-\" \"Aaron, I did it myself. Don\u0027t rake it over now. Don\u0027t. I can\u0027t stand that.\" A long silence, except for the baby making loud sucking noises. Jastrow sipped the sherry, glancing at his niece with a hang\u0026g expression. \"I might telephone the embassy, my dear, and ask if there are any plans afoot for the diplomatic n.\" \"That\u0027s a good idea, if you can get through. Otherwise we\u0027d better go there.\" \"I\u0027m planning to,\" Jastrow said, \"in any case.\" He made the call, but the embassy lines were busy. Pouring more sherry, he spoke slowly, coughing now and then. \"One thing wrong with being a historian is the way it distorts one\u0027s view of the present. I seem to see current events through the wrong end of a telescope. The figures look small and comical. The happenings seem so trivial, so repetitious, so banal! I can read the past fairly well, I think, and I also have some clarity about the future. Only in the present am I so dense. Hitler and Mussolini don\u0027t have the resources to last, my dear. This gaudy shabby militaristic madhouse in central Europe will fall. Russia and America are awesome, and between them they will crush Nazism. The only question is how soon. Well, I\u0027d better dress.\" \"Yes, do that, Aaron.\" \"I\u0027ll just finish my wine first.\" Natalie impatiently arose and took the baby into the bedroom to avoid a row with her uncle. She had no store of kindness left for this garrulous, vain, cranky old man, whose Olympian irony and willfully blinkered optimism had mired her and her baby in this peril; though in the end-she always came back to this-she herself was most responsible. Natalie Henry had thought and thought about her predicament until she could no longer bear the self-probing. Where had she committed the fatal stupidity? In coming back? in marrying Byron? In not taking the German plane out of Zurich? In not following Herb Rose to the Palestine ship? No, something deep was wrong with her; she was in some Ultimate sense, for all her apparent cleverness, a terrible fool. She was nothing and nobody; she had no real identity; all her life she had been floating like dandelion fuzz on the wind. She was \u0027Jewish,\" but the label meant nothing to her beyond the trouble it caused. She had had her first love affair with an intellectual heathen Gentile. She had married a Christian without giving the dash of backgrounds much thought; his youth and lack of learning had bothered her more. What a queer, random, disjointed chain of happenings had created this sleepy blue-eyed little living thing at her breast! In the past weeks, Natalie had started dreaming at night that none of it hadhappened. In these dreams time reeled back, sometimes to Paris, sometimes to college, most often to her childhood on Long Island. Relief and joy would fill her in her sleep at finding that she was out of the nightmare; cold sinking sadness would follow when she woke to discover that the wrong side of the dream-line was the real side. But at least on this side the baby dwelled. The baby was becoming her anchor to life. At the moment the most real tung on earth was the warm little mouth at her chest: alive, sweet, and sublimely good. Beyond it-in the hotel suite, in Rome, in Europe -all was squalor, danger, uncertainty, and darkening horizons. The diplomatic train was the very last chance. Natalie tucked the infant away when he dropped asleep, and dressed to go to the embassy. \u0027Ah, my dear, you look very well.\" In the sitting room Aaron now reclined rather grandly on a couch, in the handsome blue cape that the Searles had given him for his sixty-second birthday, his best dark suit, and a large bow tie. He was still drinking sherry. \u0027Balderdash. If I ever get home safe, one of my first orders of business will be to burn this damned dress, and I\u0027ll never wear brown again.\" Waving his half-full glass at her with stiff jauntiness, Aaron laughed merrily. \"It\u0027s grand that you\u0027ve kept your sense of humor,\" he said, although Natalie had been quite serious. \"Sit down, my dear. Don\u0027t pace.\" \u0027Aren\u0027t we going to the embassy?\" She perched on the arm of a couch. \"Tell me, Natalie, did you ever meet Father Enrico Spanelli?\" \"That Vatican librarian? No.\" He gave her the squinting teasing smile that appeared in late evenings when he had taken too much brandy. \"But I thought we all had dinner one evening together.\" \u0027We were supposed to. Louis got sick.\" \"Oh yes. I remember now. Well, Enrico is coming in a little while to drive us to the Piazza Venezia. He knows all the newspapermen, and we\u0027ll hear and see Mussolini from the press section.\" \u0027What! Good Lord, I don\u0027t want to go there with the baby in that Fascist mob! What about-\" Jastrow held up a cautionary hand and began scrawling on a pad, talking at the same time. \"Well, my dear, it\u0027s visible history. Since we\u0027re in a tight spot, we may as well have the good of it.\" The sheet he passed to her read: If it\u0027s war he\u0027ll take us straight to the embassy. That\u0027s the idea. We\u0027ll be out of the hotel, where we might be picked up. She wrote underneath, Why do you trust him? They did not know for certain that microphones had been planted in their suite, but they sometimes wrote notes as a precaution. \n Jastrow blinked at her, took off his glasses, and polished them with a handkerchief. This was his unconscious signal, long familiar to Natalie, of a harangue. Softly he said, \"Natalie, do you know that I am a Catholic?\" \"What! What do you mean?\" \"Ah, then you don\u0027t know. I thought perhaps you were being tactful, all these years, Well, it\u0027s quite true.\" Aaron often made odd remarks over brandy or wine, but he had never said anything this strange. Puzzled and disconcerted, Natalie shrugged, \"What am I supposed to say? Are you serious?\" \"Oh, very. It\u0027s the family skeleton, my dear. I\u0027m a bit surprised that they never told you. I converted when I was twenty-three.\" He gave her a red-eyed, twisted, sheepish grin, scratching his beard. \"It never took. I fear I\u0027m the wrong blood type for that or any religion, At the time the act was sincere.\" Aaron now told her about a Radcliffe girl whom he had tutored in history and aesthetics, a girl of a wealthy Catholic family. After a stormy year and a half the love affair had collapsed. He had left Cambridge and finished up his doctorate at Yale, to put behind him the girl and his memories. His conversion had been a very private matter. He had been discreet and stealthy about taking instruction, for many Jewish friends in Boston had been kind to him and he did not want to upset or argue with them. By the time he departed from Harvard, he had decided that the conversion was a mistake, having painfully worked his way to the skeptical naturalism that was his settled view. Thereafter, whenever the question of his religion came up, he had mentioned his self-evident Jewish origin and said no more. He had done nothing further about the Catholic episode; he had simply let it lapse from his life. But he had made one bad mistake, very early in the affair. He had discussed it with his family. What I\u0027ve always regretted,\" he said gloomily. \"It Probably shortened my father\u0027s life-my mother by then was dead -and your parents certainly never got over the shock. We were estranged for good, though I once told your father that that phase was over, that I considered myself a non-practicing Jew and nothing else. It didn\u0027t help. They dropped me. \u0027When the Book-of-the-Month Club chose A Jew\u0027s Jesus, Louis did write me a stiff little letter. His rabbi wanted me to come and lecture at his temple. He phrased it so that I could hardly accept. I thought his letter was cruel. I replied very warmly, but I declined. That was that. I never saw either of them again. I\u0027ve only discussed this with one other person beside Yourself in more than thirty years, Natalie, and that other person is Enrico Spanelli. \"I told him in September, when I was turned back from Switzerland. \n I thought it might prove useful. He\u0027s an excellent fellow and a fine classical scholar, though rather weak on early Byzantium. Well, he has beer, Marvelously sympathetic. He never argued my religious position, but simply wrote to the United States for verification. He\u0027s got the documents, and I have copies. So-we have friends in the Vatican, my dear. I hope we won\u0027t need them, but it is a sort of insurance.\" Natalie, who could think only of the possible effect on her baby, was pleased and amazed. This was like finding a forgotten rusty key to a dungeon cell. Aaron\u0027s youthful religious flip-flops were his own business; but the technicality might indeed bring help and refuge, or even escape in an emergency! This disclosure also explained, at long last, her parents\u0027 peculiarly strained and glum attitude about Aaron. Deep down, she herself felt a small involuntary stirring of disdain for her uncle. She said, \"Why, Aaron, I\u0027m gasping a bit, but I think it\u0027s most amazingly clever of you to have stopped being a Jew more than forty years ago. What foresight!\" \"Oh, I\u0027m still a Jew. Don\u0027t make that mistake. So was Paul after his conversion, you know. You\u0027re not disgusted with me, then, as your parents were? How nice.\" A satirical smile wrinkled her mouth. \"A jew\u0027s Jesus, indeed. You fraud.\" \"He was a Jew\u0027s Jesus.\" Aaron Jastrow straightened up inside the heavy cape and raised a bearded proud chin. \"I insist on that. The book is the fruit of a bitter wrestle with myself. I was frankly swept away by the whole opulent Christian structure of thought and art that I discovered in college, all built on what that Palestinian fellow called a murdered Jew. We Jews pretend that structure doesn\u0027t exist, Natalie-that is, Jews like your parents and mine do-but that won\u0027t wash, you know. It\u0027s there. In the end I probed past the religious metaphors and came to grips with Jesus as he was, trying to grasp the historical reality. That was the essence of my wrestle for a year. I found an extraordinarily winning and magnetic personality, a talented and tragic poor relative of mine, who lived in Palestine in olden days. So the book really-\" The telephone rang. \"Ah,\" Jastrow said, pushing himself out of his chair, \"that\u0027s bound to be Enrico. Get the baby, dear.\" Natalie hesitated, then said, \"All right. Let\u0027s go.\" At the wheel of a rusty, faded little car outside the hotel, a man wearing a clerical hat, and an overcoat with a ratty fur collar, waved a smoking cigarette at them in a thick peasant hand. \"Professorel\" The librarian/priest had a face strangely like Mussolini\u0027s-prominent brown eyes, big curved jaw, and wide fleshy mouth. But glasses and a sweet placid expression under the flat black hat, as well as his indoor pallor, much reduced the ominoui; resemblance. \"You look tired, Professors,\" he said, after greeting Natalie in charming Roman Italian, and admiring theheavily wrapped, almost invisible baby. The car started with rheumatic wheezings. \"I\u0027ve not slept well.\" The priest\u0027s glance was Mild and kind. \u0027I understand. As you requested, I\u0027ve made inquiries about your taking refuge in the Vatican. It\u0027s not impossible, but the concordat pathetically limits our freedom of action. I would offer you one word of caution. Such exceptional expedients can have negative results. One calls attention to oneself. One becomes a special case.\", He drove carefully down the almost deserted boulevard and turned into a street where people were crowding toward the Piazza Venezia, with placards swaying above their heads. \"The trouble is,\" said Jastrow, \u0027I already am one.\" The priest pursed His lips and tilted his head in a most Italian way. \"True. Well, your cloudy nationality might be an advantage. If you are actually stateless, then clearly you are not an enemy alien.\" Spanelli glanced around at Natalie with drooping eyes. \u0027This is not true of your niece, naturally. One assumes your embassy will somehow provide for her-\" \"Father, pardon me. Whoever gives me refuge must take her in too.\" The priest pursed his lips again and was silent. The crowd thickened as they neared the piazza: quiet sad-looking people in shabby winter clothes. The blackshirts carrying the placards were trying to hold up their chins and glare like 11 Duce. \u0027These I signs are viler than usual,\" Jastrow said. Beside the car, a fat red-faced blackshirt marched with a crude cartoon of Mrs. Roosevelt sitting on a chamber pot, squawking obscenities about her husband. Ahead of the car, on another sign, a bag of money with a Roosevelt grin walked on crutches, smoking a cigarette in an uptilted holder. \u0027When the pot boils, the scum comes to the surface,\" said the priest. He slipped the car through narrow side streets, parked in a rubbishfilled archway, and guided them down an alley into the Piazza Venezia. The thronged square was surprisingly still. People stood around saying nothing, or chatting in low tones. The sky was gray, the wind strong and cold. Flag-bearing schoolchildren were huddled in front of the balcony in a docile mass, not laughing or playing pranks, just holding their flapping flags up and fidgeting. The priest brought Jastrow and Natalie into a roped-off section near the balcony, wherephotographers clustered with reporters, including a few Americans, as well as the grinning happy Japanese correspondents Natalie had met at the party. Somebody produced a folding chair for her. She sat holding the sleeping baby tightly in her lap, now and then shuddering, though she wore a heavy sweater under her coat. The raw wind seemed to cut through to her skin. they waited a long time before Mussolini ruddenly stepped out on the balcony and raised a hand in salute. A crowd roar cascaded and reechoed in the square: \"Duce! Duce! Duce!\" It was a strange effect, since all the people were looking up silently, with blank or hostile faces, at the tubby figure in the gold-eagled, tasselled black hat, and the black and gold jacket, a getup more like an opera costume than a uniform. Under the balcony, a few blackshirts were diligently manufacturing the cheers, huddled around microphones. A tall man in the uniform of the German Foreign Service appeared next, with a Japanese in a cutaway coat and high hat. They flanked the dictator, who was even smaller than the Oriental; and Mussolini looked as though he were between guards come to arrest him. The blackshirts quit their noise and turned their oval, sallow faces up at the balcony, a pack of waiters and harbors, Natalie thought, in sloppy pseudomilitary masquerade. The brief erh was belligerent, the tone was belligerent, the gestures were very familiar and very belligerent, but it all came out ridiculous. The sound did not fit the gestures Mulini Hailed his flet when he dropped his voice, and shouted fiercely some inn()cuotis prepositions and conjunctions, and at the most inappropriate-. points he griinned The old ptif.Fv dictator, already defeated in CTeece and shorn of much of his North African empire, seemed to be having a highly irrelevant good time, as he declared war on the United States of America. While the blackshirts at random moments cheered and shouted \"Doo-cha-vi\u0027 the crowd began to leave. Mussolini bellowed his last sentences at thousands of departing backs-an incredible sight in this dictatorship-an old ham actor scorned by the audience: \u0027Italians, once more arise and be ivorthy of this historic hour. We shall WIN!\" And again he smiled. To blackshirt cheers, the three figures on the balcony withdrew; Mussolini came out twice to bow, but the mob was dispersing as though a cloudburst had started. The little knot of Americans stayed together, talking excitedly in low tense tones. Though the thing was no surprise, it felt strange now that it had happened; they stood on the soil of an enemy country. The debate among the correspondents, who kept glancing at policemen hovering nearby, was whether to go to their offices to clear out their desks, or head straight for the embassy. Several decided for the office first, arguing that once in the embassy they might be holed up for a long time, perhaps even until the diplomatic train left. This put Aaron Jastrow in mind of his manuscript. He asked Father Spanelli to take them to the hotel before going on to the embassy. The priest was agreeable, and Natalie did not argue. She was in a shocked state. The baby was beginning to cry, and she thought of picking up some diapers and supplier, for him. They\u0027 returned to the car and drove to the Excelsior, but the priest suddenly braked, a block from the hotel; and he pointed through the windshield at two Police cars pulled into the entrance driveway. Turning large, moist, worried brown eyes atAaron Jastrow, he said, \"Of course the manuscript is precious, Pr\u0027ofessore. Still, all things considered, had you not better go to your embassy first? If the worst comes to the worst, I can get your manuscript for you.\" \"The embassy, the embassy,\" Natalie said. \"He\u0027s right. The embassy.\" Jastrow nodded sadly. But again, a couple of blocks from the embassy, Spanelli halted the car. A cordon of police and soldiers stood in front of the building. Across the street a small crowd of spectators stood waiting for some melodramatic occurrence. At the moment, from this distance, all looked quiet. \"Let us walk,\" said the priest. \"You should pass through that line with no trouble, but let us see.\" Natalie was sitting in back of the car. Jastrow turned to her and put a comforting hand over hers. His face was settling into a stony, weary, defiant expression. \"COme, my dear. There\u0027s not much choice now.\" they walked up the side of the street where the spectators were standing. On the edge of the crowd they encountered the Times man who had taken Natalie to the Japanese party. He was frightened and bitter; he urged them not to try to crash the cordon. The United Press correspondent had just attempted it, not five minutes earlier; he had been stopped at the gate, and after some argument a police car had appeared and had carried him off. \"But how can that be? That is not civilized, that is senseless,\" exclaimed Father Spanelli. \"We have many correspondents in the United States. It is idiotic behavior. It will be corrected.\" \"When?\" said the Times man. \u0027And what wig happen to Phil meantime? I\u0027ve heard disagreeable things about your secret service.\" Holding her baby close, fighting off a feeling of walking in black waters, a feeling like the worst of bad dreams, Natalie said, \"What now, Aaron?\" \"We must try to go through. What else is there?\" He turned to the priest. \"Or-Enrico, can we go to the Vatican now? Is there any point to that?\" The priest spread his hands. \"No, no, not now. Don\u0027t think of it. Nothing is arranged. It might be the worst of things to do. Given some time, something may be worked out. Surely not now.\" \u0027Jesus Christ, there you are,\" said a coarse American voice. \"We\u0027re all in big trouble, kids, and you\u0027d better come with me.\" Natalie looked around into the worried, handsome, very Jewish face of Herbert Rose. \n For a long while after that, the overpowering actuality was the smell of fish in the truck that was taking them to Naples, so strong that Natalie breathed in little gasps. The two drivers were Neapolitans whose busin was bringing fresh fish to Rome. Rabinovitz had hired the truck to transport a replacement part for the ship\u0027s old generator; a burnt-out armature had delayed the sailing. Gray-faced with migraine, the stocky Palestinian now crouched swaying on the floor of the truck beside the burlap-wrapped armature, eyes closed, knees hugged in his arms. He had spent two days and nights hunting for the armature in Naples and Salemo, and then had tracked down a used one in Rome. He had brought Herbert Rose along to help him bargain for it. When Rose had first brought Jastrow and Natalie to the truck, parked on a side street near the embassy, the Palestinian had talked volubly, though he had since lapsed into this stupor-, and the story he had then told had convinced Natalie to climb into the truck with her baby. After a few last agonized words with Father Spanelli about the manuscript, Aaron had followed her. This was the Palestinian\u0027s story. He had gone to the Excelsior at Herb Rose\u0027s urging, to offer Jastrow and Natalie a last chance to join them. There in Aaron Jastrow\u0027s suite he had found two Germans waiting. Well-dressed, well-spoken men, they had invited him inside and closed the door. When asked about Dr. Jastrow they had begun questioning him in a tough manner, without identifying themselves, Rabinovitz had backed out as soon as he could, and to his relief they had simply let him go. During the first hour or so of the bouncing, rattling ride. in this dark, malodorous truck, Jastrow vainly talked over all the possible benign explanations for the presence of Germans in his hotel suite. It was almost a monologue, for Natalie was still dumb with alarm, Rabinovitz appeared sunk in pain, and Herbert Rose was bored. Obviously the men were Gestapo agents, Rose said, come to pick up the \u0027%. lue chip,\" and there was nothing more to discuss. But Dr. Jastrow was having second thoughts about this precipitate decision to go with Rabinovitz, and he having them aloud. Finally, diffidently, he mentioned the diplomatic train a possibil(was) itythatstillexisted.ThisrousedNatalietosay,\"YoucangobacktoRome,Aaron,and(as) try to get on that train. I won\u0027t. Good luck.\" Then Jastrow gave up, curled himself in a corner in his thick cape, and went to sleep. The fish truck was not halted on the way to Naples. A familiar sight on the highway, it was a perfect cover for these enemy fugitives. When it reached the port city, night had fallen. As it slowly made. its way through blacked-out streets toward the waterfront, policemen repeatedly challenged the drivers, but a word or two brought laughter and permission to go on. \n Natalie heard all this through a fog of tension and fatigue. The sense of everyda\u0027 reality had quite left her. She was riding the whirlwind. The truck stopped. A sharp rapping scared her, and one of the drivers said in hoarse Neapolitan accents, \"Wake up, friends. We\u0027re here.\" They descended from the truck to a wharf, where the sea breeze was an intensely sweet relief. In the cloudy nigh the vessel alongside the wharf was a shadowy shape, where shadowy people walked back and forth. It appeared no larger to Natalie than a New York harbor sightseeing boat. Dr. Jastrow said to Rabinovitz, \"When will you sail? Immediately?\" With a grunt, Rabinovitz said, \"No such luck. We must install this unit and test it. That\u0027ll take time. Come. aboard, and we\u0027ll find a comfortable place, for you.\" He gestured at the narrow railed gangway. \"What\u0027s the name of this boat?\" Natalie asked. \"Oh, it has had many names. It\u0027s old. Now it\u0027s called the Redeemer. It\u0027s Turkish registry, and once you\u0027re aboard you will be secure. The harbor master and the Turkish consul here have an excellent understanding.\" Holding her baby close, Natalie said to Aaron Jastrow, \"I\u0027m beginning to feel like a jew.\" He smiled sourly. \"Oh? And I\u0027ve never stopped feeling like one. I thought I\u0027d gotten away from it. Obviously I haven\u0027t. Come along, this is the way now.\" Aaron set foot on the gangway first. She followed him, clutching her baby son in both arms, and Rabinovitz plodded up behind them. As Natalie set foot on the deck, the Palestinian touched her arm. in the gloom she could see him wearily smile. \"Well, relax now, Mrs. Henry. You\u0027re in Turkey. That\u0027s a start.\" AmcE was awakened by the sound of a shower starting full force. Her luminous bed clock read five minutes past five. She showered too, put on a housecoat, and combed her hair. In the living room Victor Henry sat buttoned up in white and gold, reading Navy correspondence by lamplight. His close-shaved face was ashen, which she more or less expected, after his dispatching a quart of brandy and passing sixteen hours in a stupor. Pencilling a note on a letter, he cleared his throat and said placidly, \"Good morning, Jan. Did I disturb you? Sorry.\" \u0027Morning, Dad. No, Vic often gets me up around now. Is it too early forsome bacon and eggs?\" \u0027Matter of fact, that sounds pretty good. Warren get back last night?\" \u0027Yes. He\u0027s in there.\" Janice wanted to tell him about the loss of the Devilfish, but he scared her, sitting there livid and cool in his starched uniform. He would find out, she thought, soon enough. She made coffee, fed the baby, and started breakfast. As usual, the smell of frying bacon brought Warren out, humming and brushing his hair, dressed in a khaki uniform. He grinned at his father, and Janice realized that he was putting on an act and would not disclose the Devilfish news. \"Hi, Dad. How\u0027re you doing?\" \u0027Not badly-all things considered.\" Brushing a fist against his forehead, Pug ed ruefully. \"I seem to have slept around the clock.\" \"Yes. Well, travel will do that to a fellow.\" \"Exactly. Funny effect travel has. Did I empty the bottle?\" Warren laughed. \"Bone dry.\" \"I only remember drinking the first half.\" \"Dad, it was just what the doctor ordered. How about a hair of the dog?\" Pug raised a hand. \u0027That\u0027s the road to perdition. This coffee\u0027s excellent.\" Pouring himself a cup, Warren said, \"You picked a good day to sleep through. Lots of news, none of it good.\" \"For instance?\" \"Hitler and Mussolini declared war on us.\" \"They did? Then the lineup\u0027s complete. They\u0027re fools, making it easier for the President. Is that the worst of it?\" \"Before you sacked out, had you heard about the Prince of Wales and the Repulse? The japs got them both off Singapore.\" \"What!\" \"Air attack. Battleships versus airplanes again, Dad, and they sank em both.\" \"God in heaven, Warren, they got the Prince of Wales? Did the British confirm that?\" \"And the Repulse. Churchill admitted it. The Limeys are through in this ocean, right at the start. Australia\u0027s naked. Looks like it\u0027s all up to us out here.\" Victor Henry half buried his face in a hand. That great ship in its splashy camouflage, he thought, that dark elegant wardroom, those tired, gallant officers and sailors, that deck where Winston Churchill and Franklin Roosevelt had sung hymns under the guns-gone, gone, sunk in the far Pacific! He said in a low mournful tone, \"The changing of the guard.\" \"That\u0027s about the size of it.\"\"Have they hit the Philippines yet?\" Warren took a moment to sip coffee. He knew little about Clark Field; the American command in Luzon was muffling information that might panic the people. Even the official account of the Cavite raid had been skimpy. He had picked up the DeAfish news from a secret dispatch, and he was booing the report might prove wrong; or if not, that a later dispatch would at least show Byron among the survivors. \"Well, they sort of plastered Cavite.\" \"Oh, they did?\" Staring at his son, Pug said, \"Any dope?\" \"Not much. They apparently went for the shore installations.\" The Devilfish was alongside.\" \u0027So you told me.\" Warren was relieved when Janice called them to the table. Pug picked at the food. It was embarrassing, with his son and daughter-in-law eating heartily, but his throat was almost shut, and he had to force down the mouthfuls he ate. What\u0027s the plan of the day, Dad?\" Warren said, as the lack of talk grew awkward. \"Huh? Oh, I thought I might scare up a tennis game at the club.\" \"Tennis? Are you serious?\" \"Why not? Start getting back in some kind of shape.\" \"What about going down to Cincpac Personnel?\" \"Well, I\u0027ll tell you, Warren, I\u0027ve been wondering about that. At this point a thousand officers are looking for new asignments. Every Tom, Dick, and Harry of the battleship force must be warming chairs down at Personnel. The Navy will find work for me in due course, and maybe at this point I\u0027d just better take what comes.\" \"You\u0027re dead wrong.\" In his life Warren had never heard his father talk this way, and he reacted immediately and forcibly. \"You\u0027ve had a bad break, but you\u0027re not Tom, Dick, or Harry. You\u0027re entitled to the best ship command they\u0027ve got left in this fleet. You\u0027ve already lost a day. The Navy\u0027s not going to come looking for you, Dad. You play tennis for a few days and you\u0027ll end up back in War Plans. Is that what you want?\" Warren\u0027s energetic tone and thinking, so much like his own younger self, drew a smile from Pug. \"Jan, hand me the Cincpac roster. It\u0027s there on top of that pile of mail.\" She passed him the mimeographed sheets and he leafed through them. \u0027Hell. Interesting. \u0027Personnel Section-Captain Theodore Prentice Larkin, Il.\" \"Know him?\" Warren asked. \n \"Jocko Larkin? Biggest boozer in my Academy class. I pulled him out of the Sevem once when he fell off a sailboat dead drunk. Quite a wingding-Thanksgiving, I think-and I was the only sober one aboard. I didn\u0027t drink then.\" \"Dad, our squadron\u0027s got an officers\u0027 meeting at 0700- I\u0027ll drop you off at Cincpac. Let\u0027s go.\" \"Well, okay. jocko sure won\u0027t throw me out.\" At the overlook point where Janice had watched the Japanese onslaught, Warren halted the car. The sun had not yet risen. In the grayish-pink morning light far down in the harbor, there lay the incredible picture: seven United States battleships in a double row, canted, sunk, or turned turtle. Smoke rising from the wrecks still drifted heavily over the black Hat oily water. Bitterly Victor Henry muttered, looking out through the mindshield, \"The game board after the game.\" \u0027After the first move,\" Warren retorted. \"Have you heard what Halsey said when they told him aboard the Enterprise about the attack? \u0027Before we\u0027re through with them, the Japanese language will be spoken only in hellf\" With a cynical grunt, Pug asked, \"Did that impress you?\" \"It gave the crew a big charge. Everyone was quoting it.\" \"Yes. Good talk for sailors. Beating the Japanese now is a tough battle problem. Especially with a bigger war on our hands in Europe.\" \"Dad, we ought to do it handily, with the stuff we\u0027ve got building.\" Pug said, \u0027Maybe. Meantime we\u0027re in for a rugged couple of years. How much stomach do the people back home have for defeat? Because they\u0027re going to take plenty in this ocean. Maybe they\u0027ll pressure the President to quit and make a deal. They don\u0027t really give a damn about Asia, they never have.\" Warren started the car. His father\u0027s low mood disturbed him. \"They won\u0027t quit. Not now. Not after this. Let\u0027s get you down to Cincpac.\" He drove in his usual breakneck fashion. His father appeared to take no notice. Neither spoke. In this lame silence they arrived at the Cincpac building and pulled into a parking space. \"Well!\" Pug Henry roused himself from a listless abstraction. \"Here we are. Now, what about you? Will I be seeing you again?\" \"Why, I hope so. Sometime during this war.\" \"I mean tonight.\" \u0027It\u0027s hard to say. We were supposed to sortie yesterday. Maybe we will today. There\u0027s a rather headless feeling in this fleet.\"\"I completely understand. I feel sort of headless myself.\" \"It\u0027s still there on your shoulders, Dad.\" \"Well, I wouldn\u0027t want to give an emphatic nod.\" This made Warren laugh. It was more like his father. \u0027Don\u0027t take no from Captain Larkin, now. Better keep these car keys, in case I \u0026 leave.\" \"Right. And in case you do-good luck and good hunting, Warren.\" The father and son looked each other in the face, and parted without more words. Victor Henry went straight to the Cincpac communications office and looked through the dispatches. In the long garbled battle report of the evening before about Cavite, he saw the Devilfish listed as sunk. He went to Jocko Larkins office to wait. It was a quarter to seven, and nobody was there yet, not even the yeoman. Pug unceremoniously took a lounge chair in the inner office; Larkin would have done the in office of his. The large wide-windowed had a panoramicview-thesunnys(same) ugarcan(an) eslopes,theblueoceanbeyondtheanchorage,a(room) nd the hideous black-coated harbor, with its grotesque fringe of defeat and damage. Victor Henry felt ill: nauseous, chilly, yet greasily perspiring. Consuming a bottle of brandy in a few hours had done this, of course; but after the letters from Rhoda and Madeline, the only safe immediate recourse had been oblivion. The news that the Devilfish was lost had struck an almost numb man, scarcely surprising him. As soon as he had heard of the Cavite attack, he had half expected evil tidings about his son. when things went bad, his long experience told him, they went very bad; and he seemed to be falling into a gulf of bad luck without a bottom. But there was always a bottom to hit; meantime, he groggily thought, the main thing was to hold himself together. He did not know, after all, that Byron was really dead or injured. The Devilfish might not even be sunk. An excited first report was unreliable. The idea was to brace himself and hang on to hope until the straight word came. On his wife and his daughter, however, the straight word was in. Rhoda wanted to divorce him and marry Fred Kirby; and his daughter had entangled herself with her employer, had probably been committing adultery, and it all might be in the newspapers any day. These were unchangeable facts, however hard to grasp. He had to absorb them and somehow act on them. Far from harboring any relieved notion that he might be free for Pamela Tudsbury, Pug now first understood how hopeless his romance with the English girl had been, and what a strong bond tied him to his wife. That Rhoda did not feel this tie too-that she could write and mail such a letter with her usual breezy exclamation marks and underlinings, cheerily blaming herself and her long dislike of aNavy wife\u0027s stence, praising Pug up almost as a saint, yet telling him that after more than twenty-five years she wanted out, to go to another man-this was a stab from which it would be difficult to recover. He felt it in his gut, a throbbing, weakening wound. Rhoda\u0027s letter was coy about the big question: exactly what had been going on between her and Fred Kirby? Here Victor Henry was torn two ways: by his hard good judgment, which told him that of course his wife had been opening naked thighs to the other man, probably for a long time; and by his love for his wife and his own self-love, which protested that such a thing was impossible. He clung to the dim fact-it was a fact-that Rhoda hadn\u0027t said it in so many words. Because what Victor Henry now wanted was to get her back. He felt himself desperately in love with Rhoda. Much of this was injured ego-he well understood that-but not all. She was half of him, for better or worse; the weld was a quarter of a century old; she was irreplaceable in his life, with her arms, her mouth, her eyes, her sweet particular graces and ways; she was beautiful, desirable, and above all capable of surprising him. It had taken a nasty shock to drive these blunt truths home. He would have to court this woman again! He could not greatly blame her for the affair; he had already decided that in a brandy-soaked fog before passing out. How close had he not come to writing exactly the same kind of letter? Nor, strangely, did he have strong feelings about Fred Kirby. The thing had happened to those two people, much as it had to him and Pamela; only Rhoda had gone over the edge. The pictures in his mind made him sick with revulsion; but in cold honesty he had to look at the event in this rational way. Rage at Madeline\u0027s boss\u0027perhaps did him some good. One reason for surmounting this crisis was to seek out and confront Hugh Cleveland. Regret cut at Pug for his softness in letting her stay in New York. At least he could have tried to order her back to Washington; she might have gone. Now this celebrated swine\u0027s wife was threatening to sue him for divorce, naming his twenty-one-year-old assistant-unjustly, Madeline swore in a long vehement paragraph, but that was hard to swallow. Unlike Rhoda\u0027s letter, Madeline\u0027s was no bombshell. What could have been more predictable for a girl adrift alone in New York; if not with Cleveland, then with some other man? Madeline had been shot down like a dove flying over a rifle range. \u0027Tug! I tried all yesterday afternoon to find you. Where the hell were you hiding!\" Jocko Larkin came striding in, a scarlet-faced freckled fat four-striper indistinguishable from twenty others. He closed his door, tossed his cap on a book, and said into his squawk box, \"No calls, Amory.\" \"Aye aye, sir.\"\"Well!\" Larkin sat back in his swivel chair, fat hands locked behind his head, survpying his classmate with a penetrating eye. \"Good to see you. That\u0027s hell about the California. She\u0027d have had a great skipper.\" \"Well, jocko, I\u0027d say my misfortune\u0027s lost in the shuffle.\" \"Pug, who gave you my message? I left it at half a dozen places.\" \"What message? Nobody. I came here to see you.\" \"What about?\" \"Orders.\" That\u0027s what I wanted to see you about.\" Larkin looked over his shoulder, though nobody else was in the room, and turned off his intercom box. \"Pug, Admiral Kimmel is going to be relieved. At his own request.\" jocko almost whispered this, adding with a sarcastic little grin, \u0027Like Louis the Sixteenth had himself shortened by a head, at his own request. His successor will be Admiral Pye-for how long, we don\u0027t know, but Pye wants to start shaking up the staff. Let\u0027s face it, something smells here. Luckily, the personnel section has nothing to do with war alerts. It didn\u0027t happen on my watch but it happened. Admiral Pye wants you for Operations-now hold it, Pug!\" jocko Lukin held up a hand as Victor Henry violently shook his head. \"Let me give you my judgment. This is as great a break as a man in our class can have. just remember there are six Iowa class battleships building now, due for commissioning in twelve to twenty months. The greatest warships in the world. You\u0027ll probably get one after this.\" \"Jocko, give me a ship.\" \"I\u0027m telling you, you\u0027ll undoubtedly get one. \"Now. Not in 1943-\" \"No can do, Pug. listen to me. You don\u0027t say no to Cincpacl Operations is a Marvelous opening for you.\" \"Where\u0027s Admiral Pyes office?\" Henry got to his feet. \"Sit down, Pug.\" Larkin rose too, and they stood glaring at each other. Larkin said, \"You son of a bitch, you never could play football or tennis, and you can\u0027t think straight, either.\" \u0027I can and am pretty good.\" Larkin looked nonplussed, then he burst out laughing. \"Oh, sit down, Pug.\" \"Do I get a ship?\" \"Sit down.\" Pug sat. \n \u0027What\u0027s the matter, Pug? You look green around the gills, and you don\u0027t act right. Is everything okay?\" \"I drank too much brandy last night.\" \"You did? You?\" \"I didn\u0027t like losing the California.\" \"I see. How\u0027s Rhoda?\" \"Just fine.\" Victor Henry thought he brought the words out calmly, but Larldn raised his eyebrows. Folding fat fingers over his white-clad paunch, Larkin stared thoughtfully at Henry. \"Let\u0027s see. You have a boy on the Enterprise, don\u0027t you? Is he all right?\" submariner, too. \"He\u0027s fine. I have a es on the Devilfish. Or w \u0027The Devilfish, eh?\" Larkins calm tone was very forced. \"Yes.\" Opening a folder on his desk, Larkin studied several sheets clipped inside. \"The Northampton might conceivably be available. I say might. Most likely not.\" \"The Northampton? God love you, jocko, that\u0027s about the heaviest thing we\u0027ve got left here.\" \"Pug, I don\u0027t care. A cruiser command doesn\u0027t compare to Cincpac\u0027s Deputy Chief for Operations. You know that! Tim Saunders came out of that job last year with two stars, junior as hell. Even if I could get you the Northampton, you\u0027d be making the mistake of your life.\" You don\u0027t know the mistakes I\u0027ve made. Now you listen to me, jocko. \"I\u0027ve shuffled all the high-strategy paper I ever want to in this Navy. Four years in War Plans, nearly three years in Europe. I\u0027m not bucking for two stars, not any more. I\u0027m a sailor and a gunner, and there\u0027s a war on.\" Victor Henry swept an arm at the window and the shattered battle fleet. \"If you can\u0027t find me anything else, I\u0027ll take a squadron of minesweepers. Okay?\" I want to go to sea.\" \"I hear You, loud and clear.\" Heaving a sigh that turned into a groan, Jocko Larkin said, \"One more Hap I\u0027ll have with the admiral, that\u0027s all.\" \u0027The hell with that. I want him to know this is my doing. Where is he?\" \"Listen, Pug, if you talk to the admiral the way you\u0027ve been talking to me, you\u0027ll get sent to the States on a medical. You look like death warmed over, and you\u0027re acting shell-shocked. I\u0027ll see what I can do here. Get some sleep, lay off the brandy, and whatever\u0027s bothering you, put it on ice. I\u0027ll try to find something.\" \"Thanks, jocko. If you want to call me, I\u0027ll be at my son\u0027s house.\" He gave Larkin the number. \n As they shook hands over the table, Captain Larkin said with odd softness, \"When you write Rhoda, give her my love.\") Naval Officers Club Pearl Harbor Dear Rhoda: 12 December, 1941 I\u0027m somewhat stymied by the problem of answering your astounding letter, but putting it off won\u0027t give me any inspiration. I don\u0027t think I should waste your time setting down my feelings on paper. Anyway, I\u0027m not sure I can do it, not being very good at that sort of thing, at best, If I really believed this move would make you happy, maybe I could endure it better. However, it strikes me as a calamity for you as well as for me; and I am expressing this opinion though it hasn\u0027t been asked for. I know I\u0027m no Don Juan, and in fact have been pretty much of a pickle-face around you a good part of the time. The reasons for this are complicated, and it might not be too helpful to go into them now. The basic point is that, taking the rough with the smooth, you and I have made it this far. I still love you-a lot more than I\u0027ve showed, perhaps-and in your letter you\u0027ve managed to say a few kind things about me. I\u0027m compelled to believe that at the moment you\u0027re lovesick as a schoolgirl,\" and that you can\u0027t help it, and all that part. I guess these things will happen, though one\u0027s always caught unawares when the roof falls in. Still, you\u0027re not really a schoolgirl, are you? Getting used to anybody new at our age is a very hard job. If you\u0027re a widow, that\u0027s different. Then you have no choice. But here I am still. The life we\u0027ve been leading in recent years has put a strain on our marriage. I recognize that, and I\u0027ve certainly felt the strain myself. In Manila I said to Byron that we\u0027ve become a family of tumbleweeds. That\u0027s the truth, and lately the winds of war have been blowing us all around the world. Right now it strikes me that those same winds are starting to flatten civilization. All the more reason for us to hang on to what we have-namely each other, and our family-and to love each other to the end. That\u0027s the way I\u0027ve worked it out. I hope that on, further thought you will, too. I\u0027ll probably be at sea most of the time for the next year or two; so I can\u0027t make the immediate effort to mend matters that seems urgently called for. Here\u0027s how I\u0027m compelled to leave it. I\u0027m ready to forget-or try to-that you ever wrote the letter; or to talk it over with you on my next Stateside leave; or, if you\u0027re absolutely certain you want to go ahead with it, to sign the papers and do what you wish. But I\u0027ll put up a helluva fight first about that. I have no intention of simply letting you go. In plain words I want two things, Rhoda: first, your happiness; second, if at all possible, that we go on together. I\u0027ve seen a bit of Warren. He\u0027s turned into a splendid officer. \n He has everything. His future is limitless. He has the brains, drive, acuteness, toughness, and sheer ability to become Chief of Naval Operations. Byron has come along too. We\u0027ve been fortunate in our sons. I know they\u0027re facing hazards, but the whole world\u0027s in hazard, and at least my boys are serving. I don\u0027t know what went wrong with Madeline. I\u0027m kind of sick about that, and don\u0027t propose to dwell on it. If the fellow wants to marry her, that may clean the mess up as much as anything can. If not, he\u0027ll be hearing from me. You were right to say that your news would hurt less because of my orders to the California. In a peculiar fashion it\u0027s working out that way. Ever since I flew into Pearl Harbor on the Clipper, after seeing Wake and Midway in flames, I\u0027ve been living on a straight diet of disaster. Your letter almost fitted in as something nominal. Almost. I\u0027m a family man, and a one-woman man, Rhoda. You know all that. Maybe I\u0027m a kind of fossil, a form that\u0027s outlived its time. Even so, I can only act by my lights while I last. My impression was, and remains, that Fred Kirby-despite what\u0027s happened-is much the same sort of fellow. If I\u0027m right about that, this thing will not work out for you in the long run, and you had better extricate yourself now, That\u0027s as honest a judgment as I can give you. Victor is a handsome baby, and Janice is a good mother, and very pretty. Our other grandson looks unbelievably like Briny as an infant. I\u0027m enclosing a snapshot I picked up in Moscow from Natalie\u0027s old friend Slote. I hate to part with it, but you\u0027ll want to see it, I know. Let\u0027s hope to God she got herself and that kid safely out of Italy before Mussolini declared war. jocko Larkin sends his love. He\u0027s fat and sleek. That\u0027s about it. No, I\u0027m going to start earning my salary-I trust-by fighting a war. Love, Pug It was nearly lunchtime when Victor Henry finished writing this letter, and the officers\u0027 club lounge was becoming crowded and noisy. He read the letter twice, thinking how meager and stiff it was, but he decided against rewriting it. The substance was there. One could revise some letters a hundred times without improving them. The letter he had posted to Pamela Tudsbury (how long ago that seemed!) had been more clumsy and barren than most of the discarded ones. He sealed the envelope. \"Say, Pug!\" jocko Larkin, walking past with three younger officers, halted, and told them to go ahead and secure a table. \"I\u0027ve been trying to call you. Do you know about theDevilfish?\"No.\" Pug\u0027s heart thumped heavily. \"What about it?\" \"Well, it was the Sealion that was sunk at Cavite. The follow-up report came in a little while ago. The Devilfish was undamaged.\" \"Really?\" Pug had to clear his throat twice. \u0027That\u0027s definite, now?\" \"Couldn\u0027t be more definite. The dispatch says the DeHlfish report was erroneous\u0027.\" it I see. I\u0027m sorry about the Sealion, but you\u0027re a bearer of good news. \"My other news isn\u0027t so hot, Pug. The thing we talked about-I\u0027m trying but that looks like a pipe dream.\"Well, you warned me. That\u0027s all right.\" \"I\u0027m Still scratching around for something, though. join us for lunch.\" \"Another time, jocko.\" Dropping the letter in the club mailbox, Pug went out into the sunshine. A stone had rolled off his heart; Byron was all right! And one way or another, Jocko would get him out to sea. Strolling aimlessly through the Navy Yard, digesting these sharp turns of fortune, he arrived at the waterfront. there alongside the fuel dock, with thick oil hoses pulsing, was the Northampton. On leaving Larkin\u0027s office, Pug had fought off a temptation to visit the cruiser, deciding that it might be a jinx to set foot on board before knowing his orders. Now it didn\u0027t matter. He thought of mounting the gangway and having a look around. But what for? He had served a year and a half in a sister ship, the Chester. These were handsome vessels, he thought, strolling along the dock beside the bustling Northampton, which was loading ammunition and frozen food stores as well as fuel for battle patrol-handsome vessels, but half-breed bastards, spawned by a sickly cross of politics and warship-building. The Washington Treaty, which Pug considered a preposterous folly, had bound the United States back in 1922 to limit its cruisers to less than ten thousand tons, and to guns of eight-inch caliber. There had been limit length-These hybrids were the result-overblown destroyers,withthelengthofb(no) attleships(on) but a quarter the weight of metal, with slender beams, light armor, and medium punch. Their mission was to act as scouts and merchant raiders, and to fight enemy cruisers. Any one of japan\u0027s out of the water; nor could ten battleships could blow the Northampton t with perfect damage control. After the she survive torpedoing, excep California, the Northampton a relatively shrunkenaffairStill,pugt(a) hought,hewouldhavebeengladenoughtogether.It(was) was exciting to see the cruiser taking on beans, bullets, and oil for a combat mission. jocko was right, Operations was the inside track. But, for the good of his soul right now, Pug felt he needed to be loading beans, bullets, and oil on his own ship. \n He drove back to the house. On the desk in his bedroom, a handwritten note was clipped to a wrinkled Western union cable: From: Janice. To: Dad-in-law. Sub: Nhscellaneclus-am at the Gillettes with Vic. Home for dinner in case anything comes UP, back. They sortie at dawn. 2. Warren phoned. Won\u0027t be 3. Yeoman from California delivered the attached. says it\u0027s been kicking around the base for days, and just came to their office on the beach. 4. Love. He opened the cable. lo OF JAP DEAREST JUST TMS iNsTANT HEARD ON no RAD ANESE ATTACK AM UTTERLY KOF-RIFIED FRIGHTFULLY WORT-MD Tg ABOUT YOU DESPERA LY ASHAMED OF THAT RIDirULOUS MIOTIC LETTER WORST POSSIBLE TimicNG FORGET rr PLEASE PLEASE ANd FORGIVE HOPE YOURE SAF]3 WELL CABLIR ME LOVE RHO He sat nodding grimly as he read it. Rhoda to the life! He could hear FPJGrMULLY worried about her telephoning it: \u0027Am urmy horrified, IDIOTIC letter. Worst you, DESPERATELY ashamed of that MICIJLOUSI POSSIBLE timing Pug suspected it was a bone to the dog. He kneA, Rhoda\u0027s bursts of contrition. She was never so sweet as immediately after some disgusting behavior- This saving grace had gotten her over many rough spots; and her impulse in sending the cable might well have been sincere. But the process of repair would be long, if indeed it was even beginning. Their marriage now was a salvage job like the California. He did not know what to reply, so he tossed the cable into the desk drawer, beside the letter for which it apologized. That night at dinner Pug drank a lot of wine, and a lot of brandy afterward; Janice kept pouring, and he gratefully accepted. He knew he would not sleep otherwise. The alcohol worked; he scarcely remembered turning in. At four in the morning, he snapped wide awake, and it occurred to him that he might as well watch the sortie of the Enterprise. He dressed quietly, closed the outside door without a sound, and drove to the overlook point. The darkness was merciful to Pearl Harbor. The smashed battleships were invisible. Overhead a clear starry black sky arched, with Orion setting in the west, and Venus sparkling in the east, high above a narrow streak of red. Only the faintest smell of smoke on the sea breeze hinted at the gigantic scene of disaster below. But the dawn brightened, light stole over the harbor, and soon the destruction and the shame were unveiled once more. At first the battleships were merely vague shapes; but even before all the stars were gone, one could see the Pacific Battle Force, a crazy dim donble line of sunken hulks along Ford Island-and first in the line, the U.S.S. California. Victor Henry turned his face from the hideous sight to the indigo arch of the sky, where Venusand the brightest stars still burned: Sirius, Capella, Procyon, the old navigation aids. The familiar religious awe came over him, the sense of a Presence above this pitiful little earth. He could almost picture God the Father looking down with sad wonder at this mischief. In a world so rich and lovely, could his children find nothing better to do than to dig iron from the ground and work it into vast grotesque engines for blowing each other up? Yet this madness was the way of the world. He had given all his working years to it. Now he was about to ri-,k his very life at it. y? Because the others did it, he thought. Because Abel\u0027s next-door neighbor was Cain. Because with all its rotten spots, the United States of America was not only his homeland but the hope of the world. Because if America\u0027s enemies dug up iron and made deadly engines of it, America had to do the same, and do it better, or die. Maybe the vicious circle would end with this first real world war. Maybe it would end with Christ\u0027s second coming. Maybe it would never end. But he was living in 1941. Below in the brightening dawn lay his own sunken ship and his own destroyed fleet. The professional sailors and fliers who had done this thing, and done a damned smart job of it, had obeyed orders of politicians working with Hitler. Until the life was beaten out of that monster, the world could not move an inch toward a more sane existence. There was nothing to do now but win the war. So Victor Henry meditated as the Enterprise moved down channel in the sunrise and out to sea under the escort of destroyers and cruisers, taking his firstborn son into battle. Back at the house, he found Janice all dressed. \"Hi. Going somewhere?\" he said. \u0027I thought you\u0027d still be asleep.\" \"Oh, it\u0027s Vic\u0027s cough. It bangs on and on. I\u0027m taking him to the clinic down at the base for a checkup. You just missed a call from Captain Larkin.\" \"Jocko? This early?\" \"Yes. He left a message for you. He said, \u0027She\u0027s all yours 12 Victor Henry dropped in a chair, with a blankly startled look. \u0027Good news, I hope?\" Janice asked, \"He said you\u0027d understand.\" \"She\u0027s all yours\u0027? That\u0027s the whole message?\" \"That\u0027s it. He said he wouldn\u0027t be in his office till noon, but he thought you\u0027d want to know right away.\" \"I see. Well, it\u0027s pretty fair news. Is the coffee on?\" \"Yes. Anna May will make you breakfast.\" \u0027No, no, coffee\u0027s all I want, thanks. Look, Janice, you\u0027ll be passing by Western union. Can you send Rhoda a cable for me?\"\u0027Sure. Victor Henry reached for the memo pad by the telephone, and scrawled: LE\u003dROOMING AM F HAV]3 JUST BEGUN TO FIGHT. GlanCing at the little sheet he handed her, Janice curved her mouth in an indulgent female grin. \"What\u0027s the matter with that?\" Pug said. \"How about \u0027Love\u0027?\" \"By all means. Thanks, Jan. You add that.\" When she left with the baby, he was on the telephone, trying to reach Commander, Cruisers Pacific. He responded to her farewell wave with a bleak preoccupied smile. Janice thought, closing the door on him, that nothing could be more like her austere, remote father-in-law than the little business of the cable. You had to remind this man that he loved his wife. \n \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1587/47215.html","bookId":1254,"book":{"id":1254,"title":"The Winds of War ","description":" ...","cover":"http://novel.tingroom.com/file/upload/201606/24/13-38-35-70-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1587","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
