{"id":73959,"no":12,"title":"Page 12","content":"“Fuck,” Jason groaned as he sank inside me slowly. He ran the tip of his nose up my neck and then pressed an open-mouthed kiss on the tender skin behind my ear. “This feels too good,” he said, lifting himself up and pulling back out of me, then rocking back inside of me, harder this time. I watched in fascination as his eyes focused on my breasts. His mouth lowered until he could pull a nipple into it. The hard sucking coupled with him filling me inside had me panting, on the edge of an orgasm entirely too quickly. “Go ahead and come for me. I’ll make sure you do one more time before I’m done,” he said, then gave my other breast the same attention. I trusted him, or else just hearing him tell me to come was what did it, but I grabbed ahold of his arms and screamed his name as the waves of release washed over me. Jason lifted his head and began pumping his hips faster as his eyes held mine. “You’re like a damn glove,” he said through clenched teeth. The second orgasm hit me out of nowhere, and the surprised cry of pleasure came pouring out of me before I could control it. Jason’s hands grabbed my head. “Look at me,” he demanded. I opened my eyes to see his eyes locked on mine. The uncontrolled desire in his eyes only made my orgasm continue pumping through me. My body trembled violently just as Jason’s mouth fell open and he jerked against me. The ecstasy on his face as we held each other’s gaze owned me. When his head dropped to my neck and his unsteady breathing warmed my skin, I shivered and clung to him tightly. Never had sex been like that. My body was still feeling aftershocks, and each shudder that went through me made Jason’s arms tighten around my waist as he held me against him. Neither of us said anything while we both struggled to breathe again. Jason pulled me up against his chest before shifting and rolling over on his side, moving me on top of him as our legs tangled. He wasn’t getting up, or even pulling out, and making an excuse to go clean up. He just held me. His hand began to play with my hair as I lay in the security of his arms. As the music played over the speakers and the waterfall in the pool filled the silence around us, I knew that, without a doubt, I had just been ruined. JASON Tonight wasn’t supposed to be about sex. My plan had been to spend time with Jess. Then she’d gone and stripped. My brain had stopped working at that moment. But damn, was I glad. Sex with girls who were just in it for the fun or to say they had fucked Jax Stone’s brother was the norm for me. It was what I was used to. Amanda was the first girl I’d pursued who I had considered having an actual relationship with. I didn’t do relationships. Jess was supposed to be like the others. But this hadn’t been the same. Something was different. The way she had clung to me and fallen apart in my arms wasn’t what I was used to. At some point she’d become my sole reason for breathing. I ran my hands through her wet locks of hair and enjoyed the feel of her sated body curled up against me. I was still buried inside her, and I knew if I didn’t move soon I was going to be ready to go again. Now I knew it wasn’t just Jess’s smart mouth and killer body that were hard to turn down. The sex was phenomenal. Jess shivered against me, reminding me that we were still naked and wet. “Come on, let’s go inside,” I told her as I shifted her so that she could stand up. Watching Jess’s body in the moonlight ranked right up there with the Seven Wonders of the World. Hank had to be the stupidest man on the face of the earth. Jess stood up and wrapped her arms around her stomach and turned to look back at me. The nervous smile on her lips reminded me that underneath all that bravado was an insecure girl. One who had allowed herself to be mistreated by guys. I stood up and reached for my shirt, which I’d thrown off earlier. “Lift your arms,” I said, stepping in front of her. She did as I asked, and I slipped my shirt over her head. “Thank you.” I grabbed a towel that had been left folded on the table beside us and wrapped it around my waist. “Time to go warm up,” I replied, reaching for her hand and leading her inside the house. I took Jess to the bathroom closest to the pool and left her to go back and get her clothing. When I came back the door was unlocked, so I knocked once before opening it. Jess stood in front of the shower, looking at it. “This is the biggest shower I’ve ever seen,” she said with a smile, glancing back at me. It wasn’t even the biggest one in the house, but I guess it was a nice size. I walked over and reached inside to turn on the hot water. “Take a shower and warm up,” I told her. “If you take one with me,” she replied. The image of Jess soaped up in a shower was exactly what I was imagining at the moment. Climbing in with her would lead to more tonight. Would it be the same the second time? Was that first time inside her because I’d wanted her so bad? Getting attached to Jess was out of the question. I would be leaving soon, and Jess wouldn’t be a part of that life. Jess pulled my shirt over her head and dropped it, then reached out for my towel. “Please,” she said as she tugged, letting my towel fall. Maybe a second time would be a good idea. Getting her out of my system was the only way to deal with this. Reaching for her waist, I pulled her against me and enjoyed the sweet taste of her lips and the soft, plump feel of them against mine. Telling this woman no was fucking impossible. Chapter Nine JESS I lay in Jason Stone’s bed, watching him sleep. I should have gone home. But he’d asked me to stay and I’d said yes. A dark curl had fallen over his eyes, and I wanted to reach over and brush it away, but I was afraid to wake him. Sleeping wasn’t going to happen for me tonight. I had too many thoughts in my head. Then, of course, there was fear. This was too good to be true. Jason was sweet, kind, smart, wealthy, and beautiful. He had shown me that sex could be soul shattering. Nothing with him was cheap. Especially not that. But I wasn’t the kind of girl who caught and held someone like Jason’s attention. I wasn’t a Sadie White. She was pure and sweet. Everyone loved her—even Marcus Hardy had. It was no wonder Jax Stone fell madly in love with her when he’d come to Sea Breeze. I had never lived in a fairy tale, and there was no sense in starting to now. I eased out of Jason’s arms and slipped quietly from the bed. Finding the bathroom we had used to take our shower was a little more difficult, but I eventually found it. Once I located my clothes, I put them on and then headed for the front door. “If you open it, the silent alarm will go off,” Jason’s sleepy voice said from the dark staircase behind me. I turned around just as his foot hit the bottom step. He was wearing a pair of shorts that hung off his lean hips, making it hard to concentrate on why it was I needed to leave. “You don’t have a car here,” he pointed out. I nodded. He was right. I hadn’t really thought that through yet. “If you wanted to go, all you had to do was tell me,” Jason said. “I didn’t want to wake you,” I lied. That hadn’t really been it at all. Jason smirked as if he knew I was lying. “I’ve called my driver, or the driver I use while I’m in residence here when needed. He’s bringing the car around now. He can take you home.” I didn’t respond. Jason walked toward me and stopped just a foot away from me. “Can I call you?” Could he call me? Telling him I needed to think or that I needed time was probably best. Reminding myself just where I stood in this situation was important. “Yes,” I replied before I could stop myself. I wanted him to call me. This thing, whatever it was, would mark me for life. Yet I couldn’t seem to let it go. Jason cupped my face and pressed a simple kiss to my lips. “Later, then,” he whispered against my lips before stepping around me and opening the front door. I fought to control my breathing. Just feeling him touch me was now making my heart do crazy things. “Okay,” I managed to reply. He didn’t say anything else as I walked outside and toward the waiting car. The driver stood beside the car door and opened it for me as I approached. One more thing to remind me just how out of my depth I was. Once I was inside the car, I looked up at the door to the house, but it was closed and Jason was gone. The porch light was off, which meant my mother wasn’t home yet to notice I was missing. Every light in the house would be on if she had been here. The driver opened my door and I stepped out. I thanked him for the ride, and he nodded but didn’t speak. With a smile I walked toward the house. There was no telling what the guy was thinking, about where he had dropped me off. No doubt this would be the gossip of the Stone employees’ mealtime. Jason Stone slumming it in Sea Breeze. “Jess.” A hoarse whisper startled me and I jumped, searching the dark porch for the voice. Movement caught my eye, and I found Hank sitting on the floor, leaning up against the side of the house. “What’re you doing here?” I snapped. I was so sick of this. Why couldn’t he just go away? He shuffled his feet but couldn’t manage to get up, which meant he was trashed. Again. “I came to see you. You were with him, weren’t you?” he slurred before slamming his hand down on the porch. “Where I was isn’t your business. I’m not your business anymore. Please stop coming here. Just leave.” I reached for the hidden key over the door and unlocked the door before he could figure out how to stand up. “What happened to us, Jess? Used to be me and you against the world. We had each other. Didn’t need anyone else. You were my reason for laughing. For smiling. I can’t smile without you, Jess.” I squeezed the door handle tightly and fought back the need to scream. Once this had worked with me. Once I had wanted nothing but Hank. Now his words were too late. Years too late. “You happened to us. You used me one too many times. I’m done with that. And I’m done with us. Go home,” I said with no emotion. Not because I was dead inside, but because he no longer touched my heart. He’d cut himself out. Or maybe I had finally cut him out. “I won’t let you go. I’ll fight for you. He can’t have you. He doesn’t understand you.” This was about Jason. He hadn’t liked seeing me with someone else. That was always the way I had gotten Hank back in the past. I’d made sure he saw me with another guy, and he came running back to my door. I’d trained him well. Now I needed to break that habit. “He isn’t the reason this is over. I just don’t love you anymore. You made sure of that.” “Fuck YOU, Jess! Fuck you!” he roared, pushing himself up but staggering forward until he caught the rail of the porch. At least he had drunk enough that he couldn’t hurt me. I could shove him and he’d fall over. “You already did that, Hank,” I replied, and slammed the door in his face. It was over an hour later when the banging finally stopped. He had either passed out or given up. I wasn’t brave enough to open the door and check, so I got in bed and closed my eyes, knowing that Momma would be home soon and that if he was passed out on our porch he’d pay for it.","sourceLink":"https://allnovel.net/misbehaving-sea-breeze-6/page-12.html","bookId":1990,"book":{"id":1990,"title":"Misbehaving (Sea Breeze #6)","description":"Storyline: Misbehaving (Sea Breeze #6) An unexpected affair leads to mind-blowing harmony in this Sea Breeze novel from New York Times bestselling author Abbi Glines. Jason is sick of living in his rock star brother’s shadow. So when he ships off to Sea Breeze, Alabama, he’s looking for a much deserved escape and a chance to blow off some envious steam. Falling for the local bad girl was definitely not the plan. But as the new duo enjoys some naughty fun in the Alabama sun, Jason learns that even though Jax is the musician in the family, he’s not the only brother who can rock someone’s world.","cover":"https://allnovel.net/images/misbehaving-sea-breeze-6.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/misbehaving-sea-breeze-6.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:29:13 AM"}}
