{"id":73960,"no":13,"title":"Page 13","content":"JASON\n I gave it three days before I called her. When I had opened my eyes the next morning, a part of me had decided to let it go. Not to call her. She had left, and it was the best thing for me.\n After three very long days of reading and spending my time in solitude, I hadn’t come to grips with anything in my life. All I had done was think about Jess. The only thing to do now was get her out of my system.\n Jess had picked up on the second ring. The fact that she hadn’t even been annoyed about me not calling her for three damn days made me more pissed off. Not at her but at me. I had just treated her the way she expected. The surprise in her voice had made my chest tighten. Why the hell was I wanting to protect her now? It wasn’t my job to change the way this girl thought about herself.\n Maybe it was the way she’d said hello or the smile I could hear in her voice. I didn’t know what possessed, me but before I could stop myself I was asking her if she wanted to go to a party in Manhattan with me tonight. One of my friends from Harvard was turning twenty-one, and his girlfriend was throwing a huge bash at her parents’ place. I had been planning on going for over a week now, but the sudden urge to take Jess with me had hit. I wanted to see her in that part of my life.\n After a few moments of silence, she said yes.\n And I wondered if I had just lost my mind.\n Taking her into my world was a bad idea. But then, facing those people who all wanted something from me without one person there who accepted me for who I was sounded so damn unappealing. I needed Jess there. Even if it was a terrible idea.\n Chapter Ten\n JESS\n I set my suitcase down beside the door and looked over at Momma. She was sitting on the sofa with her legs crossed, studying me with a frown. The cigarette in her hand was forgotten, as was the coffee in her other hand. She was not happy that I was about to leave with Jason Stone on a plane.\n “What? Just say it and get it over with. You’re going to anyway,” I said, wishing she would be done with it already. I knew what she was going to say. I just wish she didn’t feel like she had to say it.\n Momma took a long pull from her cigarette and then put it out in the plate beside her. She was running out of time, because I wasn’t about to let Jason come to the door. I didn’t trust Momma. She would test him and I wasn’t sure he could pass the test.\n “He’s your Logan. Girls don’t marry their Logans.”\n She was back to talking about him being my Logan again. That made absolutely no sense. I didn’t even know a Logan. I crossed my arms over my chest and glared at her. “What are you talking about?”\n Momma cocked an eyebrow at me. “Jason Stone is your Logan. He’s wealthy and impressive and handsome. He’s a fairy tale. But don’t get serious. Guard your heart.”\n I let out a frustrated sigh and dropped my arms. “Why are you calling him my Logan?” I asked.\n “Gilmore Girls, sweetheart. Gilmore Girls. If you had bothered to watch it with me like I asked you several times, you would know what I mean. Hank is your Dean. He wasn’t meant for you either. He was just the first heartbreak you keep going back to. Now you’ve met your Logan. It’s a shame, though. I wish you’d met your Jess next.”\n My head was starting to hurt. My mother could be insane at times. This was one of those times. She was obsessed with several old television shows. Gilmore Girls was one of them. Apparently, she thought it had all the answers to my love life.\n “I am Jess, Momma. Why do I need to meet myself?” I asked, rolling my eyes.\n She waved her hand at me like I was being ridiculous. “Not you. Rory’s Jess. You haven’t met your Jess yet.”\n I was done with this conversation. I didn’t even know who the heck Rory was, and who names their kid Rory? How was that show even popular? I turned to open the door.\n “Logan isn’t Rory’s soul mate. He’s the wealthy rich boy who she does love, but when it comes down to it he isn’t the one. The show ended, but we all knew it was Jess she would go back to. He was her soul mate. He broke her heart once, but he had to grow up too, and he changed. I just don’t want you to get wrapped up in this boy. I want you to reach higher and get out of this life, but a rock star’s brother isn’t the way to do it. Enjoy it and have fun, but remember he’s just your Logan.”\n He’s just my Logan. Words of wisdom from my momma. Shaking my head, I opened the door and picked up my suitcase just as the limo pulled into the driveway. I glanced back at her sitting there with her cup of coffee, staring out the window at my ride. She was right. Maybe not about the Gilmore Girls philosophy, but about enjoying myself and guarding my heart. I had been hurt when Jason hadn’t called the next day, but I had chalked it up to the inevitable. He was a fairy tale. And I didn’t live in a storybook.\n The truck that pulled in right after the limo caused me to halt in my steps. This was not happening to me. Not right now. I didn’t want to deal with crazy. I just wanted to leave and get on a private jet and have a once-in-a-lifetime experience.\n “Shit,” I muttered as I dropped my suitcase on the porch.\n “What is it?” Momma asked, standing up and walking to the door. “Well, hell. I just ran his ass off the other night. He was passed out on the porch. Told him not to come back here.”\n “Got any Gilmore Girls wisdom for this dilemma?” I asked.\n Mom just snorted.\n Jason stepped out of the limo just as Hank jerked open his truck door. Jason glanced over at Hank, then back at me. I had to step in and fix this before Hank scared Jason off.\n I picked my suitcase back up and started down the steps.\n “Rory would send Dean home,” Momma called out behind me.\n I just rolled my eyes and kept walking. I wasn’t an idiot.\n “She’s taking him from me,” Hank said in a panicked tone as he stalked toward me, completely ignoring Jason’s presence. “She can’t take my boy from me, Jess. She can’t. He’s mine, too. I need you to talk to her. Tell her she can’t do this.”\n I stopped walking and looked at Hank. His face looked stricken. The drunken asshole wasn’t present right now. He was the boy who needed me. I couldn’t just ignore him. This wasn’t the first time Carrie had threatened to take their son from him. She did it for leverage.\n “What did you do this time?” I asked him, knowing that was what it all boiled down to. I turned to Jason and frowned. “I’m sorry. I’ll make this fast.”\n He nodded and stood where he was, watching us with a bored expression. I wanted to hurl my suitcase across the yard at the unfairness of this.\n “She knows I come over here when I’ve had too much to drink. She knows I love you, that I’ll always just love you. I can’t love her, Jess. She’s not you. But he’s my boy. She can’t do that, can she? Go tell her not to. She won’t listen to me.” He was begging me. I wanted to ignore all this.\n “I’m leaving. I’ll be back tomorrow late, and I’ll talk to her then,” I told him.\n “Don’t leave me,” Hank said, walking over to me and grabbing the suitcase I was holding. I saw Jason take a step forward and stop. He was waiting on me to decide what to do. I was thankful that he wasn’t getting involved in this just yet.\n “Marry me, Jess. I love you and I just want you. I’ll stop fucking around. I swear it.”\n I shook my head. We had been here before. Same argument. “No. I’m not marrying you. Now go home, and I’ll go see Carrie when I get back.”\n “Please, baby?”\n “She said she’d help when she got back.” Jason walked forward and took my suitcase from my hand, then handed it to the driver, who was behind him.\n Hank shot an angry glare at Jason, and I watched as his hand curled into a fist. I took a step toward Hank and grabbed his arm. “Don’t do this. You’ve got to let me go,” I told him.\n “He’s using you. When he’s done with you, I’ll still be here. He won’t be,” Hank snarled, still looking at Jason.\n “Go, Hank,” I said, letting go of his arm and moving toward Jason.\n It happened fast. Hank reached out to grab Jason, but the large driver was there instantly. The man had grabbed Hank’s arm, towering over him.\n “What the hell!” Hank roared, trying to get free of the driver, who held Hank still with what looked like little effort. The driver glanced to Jason for instruction.\n “Let him go once I get her safely in the limo,” Jason said in a matter-of-fact tone. His body was strung tight. I could feel the tension rolling off him, but he didn’t act like he was tense.\n Jason placed a hand on my lower back and led me over to the limo. I fought the urge to look back at the driver and Hank before climbing inside. Jason turned back to look at them.\n “Make sure he moves his truck,” Jason said before following me inside the limo and closing the door.\n I just stared at him. I should have said something to Hank to make him leave before I’d gotten in the limo. I’d just left Jason’s driver to deal with it like this was something he was used to.\n “You did still want to go, didn’t you?” Jason asked.\n “Yeah, of course, but I didn’t . . . I mean, your driver shouldn’t have to deal with my crazy ex. I could’ve made him leave.”\n Jason leaned back and stretched his legs out in front of him. “Your crazy ex is nothing compared to the insane fans that Kane is used to fending off for my brother. That’s his job.”\n Frowning, I turned to look outside, as Hank’s truck was actually moving and Kane was walking back to the limo. “I thought his job was to drive.”\n Jason chuckled. “He is also a bodyguard. He’s the one Jax uses when he’s here or traveling south. You thirsty?”\n Was I thirsty? I stared at him as he lounged there comfortably like he didn’t have a care in the world. Had Hank really not bothered him?\n “What’s causing the frown?” Jason asked with a grin on his lips.\n “Did that not even bother you? I mean, you still want to take me with you after seeing that part of my life?”\n Jason reached over to pick up one of my hands and threaded his fingers through mine. “I’ve helped you escape after you bashed your ex’s truck with a bat, I’ve broken into a pool and watched you flirt your way out of trouble with the police, and I’ve seen your ex lose his shit right in front of his kid because you were with another guy. Do you really think at this point something like that is going to surprise me?”\n I didn’t reply. He was right.\n “You’re a nice change. You make life interesting. I came here to take a break from things, and you’re helping me. When it’s time for me to return to the pressures of reality, I’ll have these moments with you to think of and smile.” He said this with a grin before reaching over to an ice-filled silver bucket inside a glass bar. “Water?” he asked.\n I nodded and accepted the bottle of water while his words sank in. I was his distraction for right now. He didn’t see a future with me. I knew that already, but hearing him say it stung. The fact that it hurt reminded me that I was caring about him more than I should. This was supposed to be fun for me, too. I had to remember that. If I wasn’t careful, he would break my heart. \n","sourceLink":"https://allnovel.net/misbehaving-sea-breeze-6/page-13.html","bookId":1990,"book":{"id":1990,"title":"Misbehaving (Sea Breeze #6)","description":"Storyline: \n Misbehaving (Sea Breeze #6) \n An unexpected affair leads to mind-blowing harmony in this Sea Breeze novel from New York Times bestselling author Abbi Glines. \n Jason is sick of living in his rock star brother’s shadow. So when he ships off to Sea Breeze, Alabama, he’s looking for a much deserved escape and a chance to blow off some envious steam. Falling for the local bad girl was definitely not the plan. But as the new duo enjoys some naughty fun in the Alabama sun, Jason learns that even though Jax is the musician in the family, he’s not the only brother who can rock someone’s world.\n \n","cover":"https://allnovel.net/images/misbehaving-sea-breeze-6.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/misbehaving-sea-breeze-6.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:29:13 AM"}}
