{"id":101730,"no":16,"title":"Page 16","content":"The intercom clicked on, the initial buzz startling me in the dead silence. Sergeant Dasher’s voice filled the room, but I couldn’t take my eyes off Blake’s lifeless form. “Perfect,” he said. “You’ve passed this stress test.”\n It was too much—ending up here, so far away from my mom and Daemon and everything that I knew, then the exam and the subsequent showdowns with the hybrids. And now this? It was too much.\n Letting my head fall back, I opened my mouth to scream, but there was no sound. Nothing as Archer entered and gently placed his hand on my shoulder, steering me out of the room. Dasher said something, sounding very much like an approving father, and then I was taken out of the training room and into an office, where Dr. Roth waited to take more blood. They brought in a female Luxen to heal me. Minutes turned into hours, and still, I said nothing and felt nothing.\n Daemon\n Being handcuffed with metal coated in onyx, blindfolded for five hours, and then put on some flight wasn’t my idea of a fun time. I guess they were afraid that I’d bring the plane down, which was stupid. It was getting me to where I wanted to go. I didn’t know the location, but I knew it had to be where they were keeping Kat.\n And if she wasn’t there, I was going to go postal.\n Once the plane landed, I was hustled to a waiting car. From underneath the blindfold, I could make out bright light, and the smell was really dry and acidic, vaguely familiar. The desert? It hit me during the two-hour drive that I was going back to the place I’d last been to damn near thirteen years ago.\n Area 51.\n I smirked. Keeping me blindfolded was pointless. I knew where we were. All Luxen, once discovered, were processed through the remote detachment of Edwards Air Force Base. I’d been young, but I’d never forget the dryness to the air or the remote, barren landscape of Groom Lake.\n When the vehicle rolled to a stop, I sighed and waited for the door beside me to be opened. Hands landed on my shoulders, and I was dragged out of the car, thinking whoever had their hands on me was real lucky that mine were handcuffed behind my back, or someone was going to be leaving work today with a broken jaw.\n The dry heat of the Nevada desert beat down as I was led several yards, and then a wave of cool air hit me, raising the strands of hair off my forehead. We were in an elevator before the blindfold was removed.\n Nancy Husher smiled up at me. “Sorry for that, but we must take precaution.”\n I met her eyes. “I know where we are. I’ve been here before.”\n A single thin brow went up. “Many things have changed since you were a child, Daemon.”\n “Can I get these off yet?” I wiggled my fingers.\n She glanced at one of the soldiers in camouflage. He was young from what I could tell, but the khaki-colored beret hid most of his upper face. “Unlock the handcuffs. He’s not going to give us any trouble.” She looked back at me. “I do believe Daemon knows this place is outfitted with an onyx defense system.”\n The guard stepped forward, fishing out a key. The set of his jaw said he wasn’t too sure if he should believe her, but he unlocked the cuffs. They scraped along the raw skin of my wrists as they slipped off. I shook my shoulders out, relieving the cramped muscles. Red marks circled my wrists, but it wasn’t too bad.\n “I’ll behave,” I said, cracking my neck. “But I want to see Kat now.”\n The elevator slid to a stop and the doors opened. Nancy stepped out, and the soldier motioned me forward. “There’s something you need to see first.”\n I ground to a halt. “That’s not a part of the deal, Nancy. You want me to go along with this, I want to see Kat now.”\n She glanced over her shoulder. “What I’m about to show you has to do with Katy. Then you will see her.”\n “I want—” I whipped around, eyeballing the guard breathing down my neck. “Seriously, dude, you need to back the hell up.”\n The guy was half a head shorter than me and nowhere in my league of extraordinary ass-kicking abilities, but he didn’t back down. “Keep. Walking.”\n I stiffened. “And if I don’t?”\n “Daemon,” Nancy called, her voice laced with impatience. “All you’re doing is delaying what you want.”\n As much as I hated to admit it, she had a point. Sending the punk one last promising look, I turned and followed the woman down the hall. Everything was white with the exception of the black dots in the wall and ceilings.\n I didn’t recall much about the inside of the buildings from when I’d been here as a kid, but I did remember there were very few places we’d been able to go. Most of the time we’d been kept to a community floor until we had assimilated and been set free.\n Being back here didn’t sit well with me for a multitude of reasons.\n Nancy stepped in front of a door and leaned down. A red light clicked on and shone in her right eye. The light on the panel turned green and the door unlocked. That was going to prove tricky, and I wondered whether, if I took on Nancy’s form, the systems had been prepped to recognize that. Then again, I felt as drained as the desert floor from whatever this building was outfitted with, so I wasn’t sure what I could actually pull off.\n Inside the small circular room, there were several monitors manned by men in uniform. Each of the screens showed a different room, hall, or floor.\n “Leave us,” she announced.\n The men stood up from their stations and hastily exited the room, leaving Nancy and me with the tool who had come in with us.\n “What did you want to show me?” I asked. “EuroCup?”\n Her lips pursed. “This is one of many security control rooms stationed throughout the buildings. From here, we can monitor everything in Paradise Ranch.”\n “Paradise Ranch?” I laughed bitterly. “Is that what you’re calling it now?”\n She shrugged and then turned to one of the stations, her fingers flying over the keyboard. “All of the rooms are recorded. That helps us monitor activity for various reasons.”\n I ran a hand over the scruff growing on my cheek. “Okay.”\n “One of our concerns whenever we bring in new hybrids is to make sure they are not a danger to themselves or others,” she began, folding her arms. “It’s a process we take very seriously, and we go through several rounds of testing to ensure that they are viable.”\n I really did not like where this was heading if it had anything to do with Kat.\n “Katy has proven to have some issues and can become very dangerous.”\n I ground down on my teeth so hard I was surprised they didn’t crack. “If she’s done anything, it’s because she was provoked.”\n “Really?” Nancy punched a button on the keyboard, and the screen above her to the left flickered on.\n Kat.\n All the air went out of my lungs. My heart stopped and then sped up.\n Kat was on the screen, sitting down with her back pressed against a wall. The image was grainy, but it was her—it was her. She was in the clothes she’d worn the night she was captured at Mount Weather, and that had to be weeks ago. Confusion rose swiftly. When was this taken? It couldn’t be a live feed.\n Her hair hung down on the sides, shielding her beautiful face. I started to tell her to look up but realized at the last minute that would make me look like an imbecile.\n “As you can see, no one is near her,” Nancy said. “That is Sergeant Dasher in the room with her. He is doing the initial interview.”\n Suddenly, Kat’s chin jerked up, and she sprang to her feet, racing around a tall man in a military uniform. The next second, she hit the floor. I stared in open horror as Kat withered, and then one of the men unhooked a water hose from the wall.\n Nancy flicked a button, and there was a different image. It took me a second to recover from the last scene and get what was going on now, but when I did, pure, red-hot rage lit me up.\n On the screen were Kat and freaking Blake, squaring off. She whirled, grabbing for a lamp, but he darted in front, blocking her. When she swung on him, pride swelled in me. That was my Kitten, claws and all.\n But the next thing had me searching for a way out of the room. Blake had intercepted her punch, twisted her arm, and swung her around. Pain registered on Kat’s face, and then he had her down on her back, pinned to the bed.\n I saw red.\n “This isn’t happening now,” Nancy said calmly. “This was a while ago, when she first arrived. It’s muted.”\n Breathing heavily, I turned back to the TV. They were struggling, and Blake had obviously overpowered her. She was still fighting, though, her back bowing and her body twisting under his. Violence rose in me, powered by potent rage and a level of helplessness I’d never felt before, and it tasted like Blake’s blood. My hands formed fists, and I wanted to smash them in the monitor, since his face wasn’t in front of me.\n When he had pulled her off the bed, and I saw him dragging her across the floor and off the screen, I spun toward Nancy. “What happened? Where did he take her?”\n “Into the bathroom, where there are no cameras. We do believe in some sort of privacy.” She clicked something and the video fast-forwarded a couple of minutes, and Blake entered from the right. He sat on the bed—her bed—and Kat appeared a few seconds later, absolutely soaked.\n I stepped forward, exhaling out of my nose. Words were exchanged between them, and then Kat whirled, opened a dresser, and grabbed clothes. She disappeared back into the bathroom.\n Blake dropped his head into his hands.\n “I’m going to fucking kill him,” I promised to no one in particular, but it was one I was going to keep. He would pay for this—all of this—one way or another.\n The soldier cleared his throat. “Blake isn’t an issue anymore.”\n I faced him, breathing raggedly. “Care to tell me why?”\n He pressed his lips together. “Blake’s dead.”\n “What?”\n “He’s dead,” the guy repeated. “Katy killed him two days ago.”\n The floor felt like it dropped out from underneath me. My first response was to deny it, because I didn’t want to believe that Kat would have had to do something like that—that she had to go through it.\n The monitor was turned off, and Nancy watched me. “The reason I’m showing you this isn’t to upset you or to make you mad. You need to see with your own eyes that Katy has proven to be dangerous.”\n “I have no doubt in my mind that if Kat really did do that, she had a reason.” My heart thudded in my chest. I needed to see her. If she had done this… I couldn’t bear to think about what she had to be going through. “And I would’ve done it, too, if I were in her shoes.”\n Nancy tsked softly, and I added her to my Going to Die Painfully list. “I hate to think of you as being unstable, too,” she said.\n “Kat isn’t unstable. All these videos show is her defending herself, or that she was scared.”\n Nancy made a sound of disagreement. “Hybrids can be so unpredictable.”\n I met her gaze and held it. “So can Luxen.” \n","sourceLink":"https://allnovel.net/origin-lux-4/page-16.html","bookId":1664,"book":{"id":1664,"title":"Origin (Lux #4)","description":"Storyline: \n Origin (Lux #4) \n Daemon will do anything to get Katy back. \n After the successful but disastrous raid on Mount Weather, he’s facing the impossible. Katy is gone. Taken. Everything becomes about finding her. Taking out anyone who stands in his way? Done. Burning down the whole world to save her? Gladly. Exposing his alien race to the world? With pleasure. \n All Katy can do is survive. \n Surrounded by enemies, the only way she can come out of this is to adapt. After all, there are sides of Daedalus that don’t seem entirely crazy, but the group’s goals are frightening and the truths they speak even more disturbing. Who are the real bad guys? Daedalus? Mankind? Or the Luxen? \n Together, they can face anything. \n But the most dangerous foe has been there all along, and when the truths are exposed and the lies come crumbling down, which side will Daemon and Katy be standing on? \n And will they even be together?\n \n","cover":"https://allnovel.net/images/origin-lux-4.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/origin-lux-4.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:05:39 PM"}}
