{"id":48649,"no":10,"title":"Book 1 Chapter 3.1","content":"Book 1 Chapter 3.1 - Era of Turmoil\\n\\n “Genes determine everything.” This was the Doctor Maxim Rosheda’ famous saying.\\n\\n Around the end of previous era roughly sixty years ago, Dr. Rosheda specialized in the field of biology and genetics. He had a mad passion and fanaticism for science, as well as his own body. Due to a lack of volunteers, or maybe the right term was experimental subjects, to test the fruits of his genetic research on, he turned to himself.\\n\\n In just ten years, countless genetic segments had been inserted into his body. These genes acted simultaneously and blended together, eventually even undergoing mutations. In the later stages, Dr. Rosheda’s body had become a genetic battlefield. Countless genes fought with each other and underwent variations in an effort to control or extinguish other genes. As a medium for these genes, several hundred fatal viral genomes could be found within the doctor’s body at any time.\\n\\n It was precisely like what Dr. Rosheda’s daughter Kacey said: from a genetic perspective, towards his later years, Dr. Rosheda was already no longer human.\\n\\n Dr. Rosheda in his later years no longer considered himself human either, instead claiming to be the apostle of deities. His belief was affirmed with even greater faith when his genes underwent a series of reorganizations and ultimately formed a mysterious, yet stable new genome.\\n\\n Back then, the doctor’s left hand could tolerate an abnormally high temperature, one that could set alcohol aflame. This was a temperature that that the human body definitely should not be able to tolerate, yet the doctor’s left hand was not injured in the slightest afterwards.\\n\\n “This is god’s left hand!” Rosheda looked at his own left hand and spoke his second most famous saying.\\n\\n After this year, the doctor’s ability to control high temperature gradually stabilized, and the temperature he was able to tolerate continuously increased. The doctor recorded the first stable genome, as well as the highest temperature he could tolerate. Furthermore, he divided his data into three portions. The first two portions he kept for himself, the final part he published, releasing his own results.\\n\\n The day that the doctor was going to hold his press conference, the war erupted without any signs.\\n\\n Scorching flames and shockwaves destroyed everything, including the doctor who possessed the ‘body of a god’. However, the doctor’s short yet shocking speech reached every corner of this world.\\n\\n The abruptly started war ended just as suddently as it began.\\n\\n The survivors began to emerge from the various refuges and ruins, discovering with shock that the world before them had changed beyond recognition. There were a few who still remembered Dr. Rosheda’s speech, and eventually they discovered the safe the doctor left behind. The safe created with the science and technology from before the war was safe and sound, and the data stored within was also perfectly intact.\\n\\n These resources were the abilities of the magic domain: the prototype for fire magic.\\n\\n All of humanity’s abilities originated from this.\\n\\n Ten years later, all types of abilities began to emerge in this era of turmoil ike insects. Some of these abilities were stable, some only had a short duration, and there were some that brought about fatal results. Moreover, those that lived in the ruins and rural areas, under constant exposure to radiation, began to show all types of abilities even without any artificial recombination.\\n\\n Through classifying, summarizing, as well a series of disputes, the various abilities were clearly defined. The abilities that were stable were categorized into the five domains of power: Magic Class, Combat Domain, Perception Domain, Mental Domain, and Mysterious Fields.\\n\\n Magic Class is a collective term for the various abilities that manipulate energy. As a way to commemorate the doctor that had been obsessed with magic, the earliest discovered domain of ability was coined Magic Class. Combat Domain included all types of offensive, defensive, as well as movement abilities. Perception Domain, as the name implied, included the abilities that could sense and read both things known and unknown to this world. The mental domain is made up of all types of control abilities, with the most popular and often seen types being weapon operation. This included the basic operation of regular weapons, ordinary firearms, sniping, all the way to the manipulation of complex weapon systems.\\n\\n Finally, there was the Mysterious Fields. This is a domain that includes all types of abilities of little value or interest. Any vague abilities that could not be classified could be thrown in. Within the Mysterious Fields, the most representative ability was luck, all types of it. However, those that have invested large amounts of evolution points into the Mysterious Fields often times never received the fortune that they imagined. They did not discover any rare and precious resources, nor did they receive any great wealth or any type of exceptional ability. Those that died by violence were not any less than those that selected the other domains of abilities. In the past, there really was someone that discovered a precious deposit of ore, but in the end, he was chopped into minced meat by a greedy mob. Over time, those that decided to invest in the Mysterious Fields grew fewer and fewer.\\n\\n Of course, the differentiation between the various domain was no longer that clear cut now. As time flowed on, more and more abilities continuously emerged. There were many newly emerged abilities that were not so easily categorized into a certain ability domain. There were even some abilities that had to be matched with another ability domain before they would emerge.\\n\\n At this moment, the once ‘mad doctor’ Rosheda became the father of abilities domains. The doctor had opened up a great gate, a bargaining chip for survival in this bitter world. However, even now, no one knew whether this ‘gate’ of his lead to the paradise of heaven or the depths of the underworld.\\n\\n When the people living within the various bases gradually woke up from the awe of their abilities, they were shocked to find that nothing in this world was forever stable, including the genes of all creatures.\\n\\n All creatures, including humans, were quickly changing. The evolution and mutation process that had taken seemingly endless years to complete was compressed into a few short years in the new age. The knowledge humans had accumulated over thousands of years was deteriorating at an astonishing speed.\\n\\n For example, look at the figure that had just scuttered across outside the wire netting. That was a red-eyed, long-eared, docile-natured rabbit that was depending on its speed to avoid its natural predators. However, no one could be sure what this creature whose current speed was already faster than that of a leopard would be like next year.\\n\\n It was because this brand new era had become an era of turmoil.\\n\\n Su cautiously made his way through the dark and quiet cave. His steps were light and soft like a agile cat as he moved soundlessly. The thick cloak around him as well as the bandages covering his body made it so that not a bit of his scent would leak out, so much so that not even those dangerous creatures that depended on their sense of smell or infrared vision would be able to notice his existence.\\n\\n He carried a thick steel pole with three sharp edges and a tip that was extremely sharp. It allowed him to strike and pierce at any moment; this was an extremely terrifying weapon. The modified rifle and pistol were carried on his back and under his cloak respectively. The power of his pistol was extremely great, but it lacked accuracy. However, in a place like this cave tunnel, the power of this pistol naturally increased tremendously.\\n\\n The problem was that since he was in this dark and quiet tunnel, the sound of a gunshot would travel extremely far. This was the same as telling all the monsters within several kilometers that he was coming.\\n\\n Su’s eye emitted a weak green light. This radiance would constantly adjust based on the darkness of the surroundings, allowing him to have a clear observation of his location at any particular time. This was the ability of the third level in the Perception Domain: Glimmer Sight.\\n\\n Within this cave, base N11 had arranged a few small lamps that illuminated a hundred meters around the base. This project was done the last time the base decided to explore this area. Even after the lamps further out were destroyed, the base sensibly decided not to send anyone to repair them. For Su who was equipped with Glimmer Sight, he only needed a minute amount of light to clearly see everything in his surroundings.\\n\\n Su was currently walking through the dark tunnel. From time to time, there would be glowing moss, as well as sewage that emitted weak lights. This was already enough for his Glimmer Sight to display its effect.\\n\\n At a certain corner, Su suddenly stopped his steps. His entire body retracted into his cloak, slowly merging himself with the darkness.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/dh-book-1-chapter-3-01","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
