{"id":49641,"no":1002,"title":"Book 6 Chapter 37.4","content":"Book 6 Chapter 37.4 - Eruption Evolution should be extremely difficult, but for Su, evolution seemed to be something that couldn’t be easier. This was especially the case after he was destroyed once by Serendela, and then reborn in the sea. His sealed right eye was opened up once again, the Bisindle divine language that was difficult to reach becoming an inseparable part of him. Meanwhile, every single Bisindle symbol carried an unimaginably great amount of power, making even Su tremble inwardly. For example, right now, as long as Su truly felt a need, a new Bisindle divine language symbol would most likely appear, within it recorded all types of energy acquiring methods. Meanwhile, when one had energy, one would obtain goods, which meant that soon afterwards, Su could also produce a great mechanical army. Right when Su was moved by this thought, a new Bisindle divine language symbol appeared in the depths of his right eye. This was a symbol that contained all types of lower level energy applications, within it already the initial application of spatial furnaces. Under Su’s helpless smile, the symbol began to break apart, a sea of information released again. Meanwhile, Su’s body also began to evolve on its own, producing miniature cavity nodes to replace the chest cavity his body originally used to burn food. The newly produced cavity node continuously squirmed about, using this method to counteract and absorb the crazy energy produced by the unstable space within his body. After absorbing the new Bisindle divine language character, Su finally understood the source of human evolution and abilities. When abilities exceeded ten levels, humans began to possess the ability to use spatial energy. The genes for new abilities were actually just nodes that derived all types of energy, and this was what provided high level ability users with what they needed to use their terrifying abilities. Meanwhile, evolutionary points were energy crystals that stored energy through a certain method. If one wished to create a stable genome, they were indispensable materials. Evolutionary points were already a rather perfect evolution method, its assessment not low even in the Bisindle evaluation system, reaching the middle level standard. One had to understand that olden era humans couldn’t even end this evaluation system. It almost appeared out of thin air, quietly appearing after the nuclear explosions. This was what was extremely unreasonable. Su suddenly understood that for Dr. Rochester, no matter what kind of method he used, there was no way he could discover abilities! It was because this wasn’t a superpower that the human race formed after unleashing their inner potential, but rather an energy system founded on evolutionary points. The difference between the two was not something that could be skipped, but was rather something that needed the accumulation of hundreds of thousands to millions of years of civilization. In the Bisindle divine language, the complete ability advancement systems, the entire evolutionary processes all had a clear and complete course of events. The gap in between was extremely great, definitely not something a genius’s inspiration could make up for. Concentrated poundings sounds began to sound from outside the sealed cabin. Large amounts of miniature mechanical spiders already swarmed over, starting to tear down the obstacles with their limbs. The maintenance mechanical bugs in the energy mothership were also frantically working, trying to cut through this intelligence center and other parts of the ship. However, Su’s consciousness already formed energy data light bands, linking up together with all of the energy motherships’ intelligence centers, moreover instantly seizing ownership authority. The intelligence center he still gripped in his hand was nothing more than an outer appearance. Most of Su’s thought centers were idle. Right now, they were started up one after another, starting to analyze all information pertaining to Dr. Rochester. Right at this time, the amount of data flowing through the energy mothership suddenly increased more than a hundred times, two incomparably powerful consciousnesses arriving through the energy-converted data, smashing fiercely into Su’s consciousness! This was a collision that was completely unexpected for both parties. Endless electrical flames suddenly erupted in the sky. The energy mothership, even the entire bug swarm’s mechanical units’ bodies began to release miniature explosions. All of the intelligence centers were burned down due to an instantaneous surge of data, their engines thus immediately losing control, the energy reserves completely activated, the surging energy creating fierce explosions. The mechanical units in the sky exploded one after another, fiery light lightning up several kilometers of the sky, the thick clouds of radiation even having a huge hole blown open by the surging airflow. In the roiling flames, Su’s body was faintly discernible. He stared north, his expression complicated. In this short clash, Su, Serendela, and Fitzdurks’ consciousness were completely tangled with each other, within you me, within me you, and then everything completely exploded. Even the three parties’ spiritual worlds were momentarily linked up, almost engaging in a spiritual battle. However, for all three, this collision was unexpected, so before any of them could react, the explosions of the mechanical bug swarm already destroyed the data stream, separating their consciousnesses. All three sides suffered damage, but comparatively speaking, Su suffered much greater than the two apostles. However, they all retained a bit of information about the others, so even though Su’s losses were greater, his analysis abilities were greater than the two apostles’. The explosions gradually came to a halt, the burning mechanical remains falling onto the great earth one after another. Su was still floating in the air, hesitating. Energy was continuously extracted from space, gathering towards his brain. The tissues there crazily squirmed about, countless thought centers budding and brewing, as long as Su released his control, they would completely take form after just an hour. Meanwhile, at that time, Su’s analysis ability would directly triple. This was a crazy evolution speed. Before the seemingly limitless Bisindle symbols, evolution was completely without end. However, before this alluring prospect, Su’s fear already became unprecedentedly powerful. However this time, he didn’t seem to have a choice but to strengthen himself. Su had to understand what the apostles were, what their objective was, as well as what kind of relationship they had with him. Su already sensed that there was some kind of inseparably close connection between the apostles and himself. Meanwhile, as for the connecting links, aside from Madeline, there was also the Bisindle divine language. Su liked this world, liked this planet, moreover always viewed himself as a person. However, what the two apostles wished to do was already extremely clear: they wanted to purge this world. The so-called purge, was annihilating all life forms that were greater than a certain limit. This was, without a doubt, equivalent to destroying this planet. Even if it wasn’t for the human race, the apostle’s purge would still naturally make Su treat them as his enemies, unless Su turned himself into the size of a finger. Su slowly descended onto the ground. He looked at the burning mechanical remains around him, released a sigh, and then walked south. His speed became faster and faster, figure gradually slinking into the darkness, heading towards the great sea. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-37-4","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
