{"id":48868,"no":229,"title":"Book 3 Chapter 1.3","content":"Book 3 Chapter 1.3 - Back To the Beginning\\n\\n Lieutenant Colonel Julio stared angrily at Su, but this naturally didn’t produce any results either. He lit a cigarette and forcefully took a few breaths. He grabbed back the documents in front of Su’s face, and while shaking them, he said, “Youngster, listen well. The dragonrider mission system isn’t as easy as you think! The issue and completion of every mission contributes to the overall mission of the Black Dragonriders! Many missions are connected to the success or failure of others. If the distributor of the missions is intelligent enough, one like myself, they could even carry out a true battle campaign through a series of missions! Kafen and Maria were two individuals who completed missions with high efficiency, so these missions are all extremely important, even affecting the battle strategies of many different Black Dragonrider regions! You have brought me quite a bit of trouble!”\\n\\n “Because of the efficiency in which they complete missions, your distinguished self can ignore the fact that they are worse than scum?” Su asked in return, making Julio’s face immediately swell up until it became completely red. \\n\\n Julio’s eyeballs seemed like they were going to completely pop out. He deeply breathed in and out. It looked like he really wanted to throw himself over and teach this arrogant, egotistical, and handsome youngster a lesson. However, his reasoning continuously reminded him that the current Julio was no longer the Iron Hammer Julio that often carried out great slaughter on the battlefield. The Su in front of the office table was handsome and delicate like a piece of porcelain that would be shattered with a light tap. However, all of his past military successes proved that this was nothing but a facade. \\n\\n “Youngster, it seems like the reason you were able to crawl into Persephone’s bed wasn’t just because of a pretty face. It seems like you have quite some skill with your mouth too!” Julio who was bursting with rage couldn’t care about the various taboos anymore. The words he spoke carried quite a bit of malice and sarcasm. \\n\\n Su instead became more calm. If those that understood him were here, they would know that this was a sign that he was about to take action. \\n\\n At this moment, the tactical intelligent system Su carried on him vibrated. Su put on the earpiece and enabled the communication mode. Ricardo’s powerful laughter immediately sounded in the earpiece. “Hey, brother, I’ll be discharged from the hospital tomorrow… Wait, what is going on, you seem to be in quite the troublesome situation? That fellow Julio can’t be considered the bad sort, but he really is a bit too excitable and troublesome.”\\n\\n Su ignored the lieutenant colonel’s face that was becoming more and more unpleasant, and with a few sentences, he spoke about what had just happened. \\n\\n Ricardo was more than proficient at dealing with people like Julio. After all, Su hadn’t joined the dragonriders for that long, so he didn’t know anything about general headquarters’ complicated ways. \\n\\n Julio patiently waited for Su to finish speaking before coldly saying, “Since you don’t plan on taking any responsibility, then I am left with no choice. I am getting on in my years, and my memory is starting to worsen. In the future, when you apply for missions, perhaps it might take some time before they can be passed. If you want to ask me how long, only heaven knows! Maybe three years, maybe five years. Ah, I almost forgot. I recall that you account only has 3400 or so yuan left. Better use that more carefully so that you can support yourself for a year.”\\n\\n When he saw Su’s calm face, Julio immediately felt a bit lacking in confidence. As such, he laughed nervously a few times before saying, “You want to take action? Fine, go ahead. However, don’t forget that your fist will be against the entire dragonrider bureaucratic system!”\\n\\n Su suddenly laughed. His body that had originally tightened like a leopard suddenly loosened. He comfortably leaned back into his chair and said, “Lieutenant Colonel Julio, please do not forget that I came out from Curtis’s training camp.”\\n\\n “I remember.” The flesh on Julio’s face jumped. \\n\\n “From second lieutenant to captain, I used less than half a year’s worth of time.” Su began to relax even more.”\\n\\n “I am aware.”\\n\\n “Perhaps in just a few years, I’ll be a colonel.” Su said. \\n\\n Julio became silent. \\n\\n “I hold grudges, and I don’t mind making the scope of vengeance a bit wider, for example, extending towards the enemy’s women or even children. In addition, those who use their heads should be quite clear on how I carry out my revenge. Perhaps in under a few years, my enemies would have to consider what to do after they retire.” Su’s smile was pure and beautiful, as if he was a fiend trying to convince humans to sell their soul. \\n\\n Smoke curled up around the inside of the office, making it hot and suffocating. Julio suddenly felt as if the heater was turned up a bit too high today and subconsciously unfastened his collar button. \\n\\n Su’s smile became more and more beautiful, but in Julio’s eyes, it looked more and more harsh. “Look, I am also someone who hates trouble. Perhaps working together today isn’t too bad of a choice. If we look at it from a broader point of view, the deaths of two people isn’t that big of a deal, am I wrong?”\\n\\n Julio released a snort and collected the documents in his hand before saying. “Perhaps. However, that depends on whether your path of advance really is as fast as you claim. The military rank of the Black Dragonriders isn’t like beef that you can stab with a fork and eat at any any time.”\\n\\n Su smiled, but he didn’t reply. He instead got up, concluding this model example of a Black Dragonrider conversation. \\n\\n Only when the office door was properly closed did Julio’s strained face loosen up a bit. He felt as if his neck became a bit sticky. When he felt it with his hands, only then did he notice that his entire body was covered in sweat. Even though the words Su spoke just now were simple, every single sentence hit the nail on the head, words that completely sounded like the ones barbarians from the wilderness would speak. Even if there was someone guiding Su from the background, that was still someone who was greatly familiar with the inner workings of the Black Dragonriders. When someone like this was paired up with Su who was used to cruel and vicious methods, he truly wasn\u0027t someone Julio wanted to offend or provoke. \\n\\n Inside Black Dragonrider general headquarters, Julio was undoubtedly one of the most important individuals. However, what was rather regretful was that in this era where abilities prevailed over all else, the Lieutenant Colonel Julio without any backing and whose combat abilities gradually declined after his many years behind the desk, actually had even less status than before. \\n\\n Julio released a heavy breath of air. Right when he was about to light another cigarette, he suddenly saw the old-fashioned screen beside him light up. This was a public announcement from Black Dragonrider general headquarters. \\n\\n Julio’s eyelids jumped a few times, and for some reason, he felt a bit uneasy. When he opened up the informations tab, he saw that it was just a rank promotion report with extremely simple contents. “Due to Captain Su’s outstanding contributions, he will be promoted to lieutenant commander.”\\n\\n When he walked through the main entrance of general headquarters, Su still didn’t know that he had already become a lieutenant commander. Ricardo’s laughter continuously sounded from his earpiece. “Look, Su, it’s still my method that’s more useful, right? Everything was settled with just a few words. Why is there a need for action? My dear Su, you have to remember that wisdom is the power that decides everything! This is why I am a lieutenant commander while you are just a captain. Wait, I received some news…”\\n\\n The earpiece became momentarily quiet. Then, Ricardo’s angry voice sounded. “Damn it! Su, you are a lieutenant commander now too!”\\n\\n Su laughed without replying to this comment. In reality, he was rather surprised at this information as well. Ricardo’s voice from his earpiece became more serious. “Alright, let’s talk business. Kafen and Maria brought both of us heavy losses. Even though they died, things won’t end just like that. The dragonriders has the saying that internal conflicts won’t bring about any rewards, but that is just the principle on the surface. In reality, the rewards have to be collected ourselves. I already received the intelligence I need, so when I get discharged, let’s go collect our reward.”\\n\\n “Alright.” Su’s reply was extremely direct. He truly needed this sum of reward as well. Many of the soldiers that died had loved ones, and their financial support wasn’t a small amount either. \\n\\n “When the time comes, please don’t act out of place.” Ricardo meaningfully added.\\n\\n Not long after Su left, an unusual visitor appeared at the the main entrance to Black Dragonrider headquarters. It was an extremely young male whose steps were somewhat unsteady and his uniform in tatters. One could vaguely make out the style of a Black Dragonrider uniform, and through the holes on the uniform, one could even see criss-crossed injuries that had yet to heal. His short hair was in a mess, and there were large patches of burn marks. It was impossible to tell what color it was originally. \\n\\n Even though his body was extremely weak, carrying injuries that weren’t light, this young man’s body was still as straight as a sword as he directly headed for the majestic and imposing Black Dragonrider general headquarters’ main entrance.\\n\\n The dragonriders guarding the entrance had yet to encounter outsiders that dared to break into dragonrider general headquarters, but this youngster’s body carried a strange type of aura that they dared not treat too rudely. One of the guards moved his rifle and stopped the youngster before saying, “This is Black Dragonrider general headquarters. Apart from formal dragonriders and staff members, only those with permits may enter.”\\n\\n The young man raised his head and gave the guard a look. In a somewhat displeased manner, he said, “What, could it be that before you two took on the position of guards, you didn’t memorize the faces of every single official dragonrider?”\\n\\n The guard carefully looked over the youngster and suddenly cried out in alarm. He immediately carried out the most proper military salute and said, “It turns out to be your distinguished self, O’Brien! We deeply apologize!”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-3-chapter-1-3","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
