{"id":49008,"no":369,"title":"Book 4 Chapter 5.1","content":"Book 4 Chapter 5.1 - Hunting to Eat\\n\\n Faced with the four chosen who threw themselves over, Su quickly shifted backwards, but the distance between the chosen and himself was still continuously being pulled closer. Perhaps out of fear towards the electromagnetic rifle’s power, they didn’t dare rush over at their highest speed and instead borrowed the cover of the nearby terrain from time to time to protect themselves. \\n\\n Meanwhile, the other three chosen made much more progress. When the distance was cut down to less than a hundred meters, concentrated gunshots suddenly began to continuously sound from two different directions. The interweaving hail of bullets completely sealed off their path of advance.\\n\\n He was injured as soon as he entered the battle, moreover injured by some small fry that he didn’t attach any importance to. This made this chosen go crazy! He was just about to face the stream of bullets head on and charge towards the firing location to tear that man apart, and then he suddenly felt a chill crawl up his back!\\n\\n Extreme fear immediately robbed him of his hearing. It was as if the entire world became silent. However, his animal instincts still urged him to turn around as fast as he could. When he turned his head around, he saw his companions’ faces from the corner of his eyes, faces that were overwhelmed with horror. Their mouths continuously opened and fell, as if they were trying to say something to him, but he couldn’t hear a word. \\n\\n Then, he saw that an alloy bullet wrapped in blue radiance had already entered his chest!\\n\\n Unlike an ordinary rifle, even though the area that was struck was his chest, the energy bullet wouldn’t even give him the time to produce any final thoughts. It was because the tremendous power would similarly burn through his brain!\\n\\n Another cloud of flames exploded on the battlefield. The flying flesh and bones were thoroughly burned up in an instant. The only thing thing his six levels of defense did for him was that everything below his crotch was still there. \\n\\n The other two chosen stared blankly at the remaining half of their companion, stunned for close to half a second!\\n\\n They already witnessed the power of the electromagnetic rifle together, but what they saw were two successive shots. One of them even directly hit its target, yet it was unable to make Claudia remain behind. However, only when it was their own bodies’ turn did they completely understand the terrifying power of the electromagnetic bullet. \\n\\n The chosen’s actual combat experience was a bit more lacking. In their moment of stupor, Li and Li Gaolei had long re-aimed their gun’s muzzles and rained down bullets on their bodies. With great tacit understanding, they immediately let the Combat Domain chosen go and instead concentrated their firepower on the Magic Domain chosen’s body. \\n\\n When the rookies that dared to stare blankly on the battlefield realized their mistake, the stream of bullets already arrived! The Magic Domain ability user cried out in alarm and immediately produced his defensive force field. As a result, these bullets began to visibly reduce speed, distort, and continuously change shape. The defensive force field continuously rippled about under these attacks. Bullets that had all of their kinetic energy exhausted fell onto the ground, but even more bullets slammed over, one after another. Dragon model assault rifles could fire a shocking 80 rounds without reloading, so normally speaking, its magazine wouldn’t even be emptied. In addition, what left the chosen who was struggling to support the defensive field shocked was that the bullets the male fired seemed to be travelling in a straight line, the deviation not exceeding ten centimeters in this distance of more than a hundred meters! This brought the defensive force field tremendous damage. \\n\\n “Number nine! Hurry and help me!” He couldn’t help but scream out!\\n\\n However, the fella that excelled in combat abilities only gave him a cold look. He laughed treacherously and said, “Number three, you can handle this alone, or else why would we call you number three?”\\n\\n Number three was momentarily stunned, and then he roared with fury! He knew that because he was favored by Pandora and had his number directly increased to three from fourteen, he already drew the jealousy of all of the other chosen. During the process of pursuit, the other chosen could still barely listen to his commands, but on the battlefield of life and death, these individuals’ innate natures were starting to show. \\n\\n Even though if there was a chance, number three wouldn’t mind sending these fellas to their deaths, right now, he was the one that was framed first, which was why number three was absolutely furious. \\n\\n Number nine looked at the camp, and then he ran towards the off-road vehicles with large steps. He already saw that there was a young girl sitting in the off-road vehicle. Even though he could barely make out an outline in the darkness, this was already enough to make him excited from head to toe!\\n\\n “Even Lord Pandora might not be comparable to this girl!” Number nine licked his lips that were so dry they were about to crack, and then charged towards the off-road vehicles with even greater speed. \\n\\n The girl’s senses were extremely sharp, immediately seeing him. She leapt off the vehicle, moving extremely nimbly. If she understood how to hide herself, perhaps she might bring number nine a bit more trouble in this darkness. Correct, just a bit more trouble, because number nine could already clearly sense that she only had two levels of ability at most. If he had a bit more time, then this small amount of trouble would bring number nine several times more pleasure. After all, violence and resistance were the true sources of pleasure!\\n\\n When number nine saw her entire body, even the depths of his throat started to feel dry! This was especially the case when he saw her long, thin, and powerful legs that could make all the male chosen go crazy. The long brim of her hat continued to cover most of her face, but what did this matter? Regardless of what her face looked like, number nine felt that the only things controlling him right now were desire and instincts!\\n\\n The girl wasn’t in a rush to escape. She instead dragged a shockingly large enormous sword from the back of the off-road vehicle, and then she unexpectedly dragged it with her into the distance! Her clearly stupid decision ignited a flame at the bottom of number nine’s heart. She wasn’t all that fast to begin with, and now that she had this cumbersome thing, how could she escape from the palm of number nine’s hands? Number nine even purposely slowed his own speed down so that she could run a bit further as to prevent him from being disturbed by the others before he had his fun. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-5-1","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
