{"id":49017,"no":378,"title":"Book 4 Chapter 6.6","content":"Book 4 Chapter 6.6 - Why Does it Have to Be Like This? First floor. In the olden era, it should already be early summer, but in the northern mountains, the temperature of night was still below freezing. From time to time, the cold weather would even approach negative twenty degrees. However, after undergoing mutation, the survival ability of plants also increased substantially, and as such, even under the unpredictable coldness, trees, shrubbery, and even weeds often tenaciously produced sprouts. However, these buds were of every color, no longer being overwhelmingly green, granting the desolate and cold mountains a hint of beauty, yet at the same time a sense of strangeness. Within a sparse mountain forest, Persephone was walking by herself towards the seemingly not too far distant mountain peak. That was her next destination, as well as the next battlefield she selected. Inside of that rather ordinary looking mountain peak was a supply point she set up some time ago with essential medications, food, and ammunition. When fighting in the northern front, Persephone would often fight without subordinates at her side, and in the later half when she fought against the Holy Crusaders’ great knights, this was even more so the case. Ever since she first arrived in the north, Persephone would set up various supply points where there were no signs of people. Even though these supply points’ goods were only good for about three years’ time, and their amounts were only enough for one or two people to use, for a ninth level ability user like her, if she just received a single instance of resupply after fighting a long time, it would give her a huge advantage. The forest Persephone traveled through was extremely strange. There were enormous trees several tens of meters tall around her, their trunks perfectly straight as they pierced towards the sky. There were only a few branches near the very top, and those branches produced sharp brown-colored leaves. These enormous needle-like trees were quite far from each other, with several dozen meters before another one could be seen. The forests between were full of half meter tall shrubbery. It was clearly not the season of growth, yet these bushes were full of tender green fresh leaves. In reality, those enormous trees didn’t have the ability to carry out photosynthesis for survival. Below the visible surface, their roots were actually incredibly developed, almost covering the entire forest. As for those short shrubs, they grew precisely on top of those roots, with a portion of their nutrients seized by the enormous needle trees. The shrubs were just like slaves of the needle trees. Persephone chose this forest for a reason. This forest looked like it was thinly spread, but in reality, it was all interconnected. As long as someone entered this forest, all of the needle trees in this forest would produce some type of reaction. Those that were familiar with this place could naturally tell from the needle trees’ reactions whether or not some human or animal entered this forest. It was to the extent where they could even get information on how many people and which direction they came from. When Persephone hunted down a great knight, she had previously entered this forest. The Holy Crusaders’ great knight was originally in an extremely disadvantageous situation. If not for Persephone’s vile interests, there was no way he could have escaped this far. However, in this forest, he suddenly seemed to know Persephone’s whereabouts like the back of his hand, and after clashing several times, it almost made Persephone who was caught off guard suffer greatly. However, due to the disparity in ability levels being too great between the two, in the end, the great knight who had home field advantage still died under the hands of the crafty Persephone. After the battle ended, Persephone carefully inspected this forest and finally discovered the secrets of the needle trees. As a result, she set up a supply point at the border of the several hundred square kilometer forest to make this her home field for fighting an ultimate decisive battle during a time of crisis. However, back then, this was only done just in case. Within the depths of her heart, she even thought that she would never have to use this battlefield. She never thought that the day would come so quickly. Right now, Persephone was entirely different from before. First, her long gray hair had already been cut short, and the uniform on her body was extremely tattered, practically torn apart into strips, covering her important areas and wrapping around the combat inner clothes lining. As for her lower body, her short dress was simply modified into suitable combat shorts, the dark stocking nowhere to be seen. Those things were simply decorations; in an actual battle, they would only be a burden. Meanwhile, her black frame glasses, even though they were equipped with many probing abilities, due to their electronic installations, would expose her whereabouts, so they were abandoned. The current Persephone was just a like a brilliant and cold barbarian warrior, no longer the formal and enticing olden-era office woman. She was dragging a corpse in her arms. This was an extremely robust male, his bare body covered in tens of cuts of various sizes, the deepest directly opening up his chest. Even though from the corpse’s skin color, it seemed like he had already been dead for some time, his widened eyes that had long lost expression were filled with disbelief and shock. Persephone only knew this fella was called number three. As for whether or not he had another name, that was none of her concern. While walking in the depths of the forest, Persephone stamped her foot. Shrubs immediately flew everywhere, and earth rolled about. A two meter perimeter shallow ditched appeared, and within the hole were interweaving needle tree roots. Her arm moved, flinging number three’s corpse into the hole. The needle trees’ roots immediately seemed to have become alive, growing at terrifying speeds, and in just a few minutes, number three’s corpse was covered in tree roots! Hollow needles emerged from the roots one after another, piercing into number three’s body, continuously absorbing his flesh’s nutrients. Number three’s corpse quickly shriveled up. The needle tree roots began to bind tighter and tighter, squeezing until the bones released crack crack sounds. They then began to quickly crack apart. In less than ten minutes of time, number three’s corpse already disappeared, without even half a piece of bone remaining! The needle tree roots continuously rummaged about, pulling the mud and earth back into its original position, and then many small shrub seeds were released. These small shrubs’ vitalities were activated to their limit. In just a day’s worth of time, they could complete their growth. Tomorrow, around this time, the forest would be completely restored to its original state. Persephone reached out her hands to stroke a needle tree at her side, able to clearly feel a light trembling representing joy. She revealed a faint smile, and then she continued towards the supply point. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-6-6","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
