{"id":49073,"no":434,"title":"Book 4 Chapter 15.3","content":"Book 4 Chapter 15.3 - Treading on Ice\\n\\n Within the smoke, a high powered grenade was flung out. It traveled more than 150 meters, directly smashing into the shield of the mobile armor at the very front. A fiery red ball of flames immediately surrounded this mobile armor! However, after the explosion’s heat and flames passed, that mobile armor unexpectedly still stood tall!\\n\\n Li, who was the one that threw out this grenade, couldn’t help but curse upon seeing this scene. “Fuck! At least six levels of defense, so damn hard!”\\n\\n Following a tong sound, Kane’s large caliber sniper rifle opened fire as well. The bullet was similarly blocked by the alloy heavy shield, only leaving behind a shallow dent on its surface. He similarly had combat abilities, only, his combat potential couldn’t keep up with the others on Su’s side. His sniping skill couldn’t be considered bad, but hitting the mobile armor’s nimble head in this smoke covered battlefield was still beyond his abilities. \\n\\n \"Ignore the mobile armors and focus on the soldiers behind them!\" Li roared. She fiercely jumped out from the fort, the assault rifle in her hands immediately emptying a small case of bullets on a first generation mobile armor’s head. The Black Dragonriders’ standard assault rifle’s tremendous force blasted the mobile armor’s helmet full of holes, destroying all of its sensory devices. Under the powerful force, the neck bone of the pilot also released strange sounds. If not for his defenses reaching four levels, his neckbone wouldn’t have been able to endure this ferocious assault at all. \\n\\n Li’s body moved backwards, and in that instant, she assumed a stance that was packed with power and tension. Then, she flung out the three highly explosive grenades in her hands at the speed of artillery shells! The three grenades flew out over three hundred meters, landing in the army of soldiers that were attacking in a scattered manner and exploding with loud sounds. The blast waves of these grenades were ten times that of olden era grenades, and they also contained high frequency pulses that could greatly harm the brains of living beings, as well as as heavy metal shrapnel. Everything within ten meters of them was immediately razed to the ground!\\n\\n As soon as Li landed on the ground, she leapt towards the side like a leopard. Several streaks of flames converged from different directions, ferociously intersecting at the position her feet had just made contact with. The concentrated explosions and impact made even the most sturdy bunker made of rock and metal alloy break apart, and those unfortunate enough to be within ten meters of the shooting range all had their flesh torn to pieces from the shrapnel and blast wave. Only a single lucky individual managed to survive, but when he saw that everything below his knees had disappeared, a miserable scream rang through the air. However, it was already impossible for him to find his own legs. The flesh and blood of over ten soldiers covered everything in his surroundings, practically impossible to distinguish which was whose. \\n\\n On the battlefield, the mobile armor’s multi-barreled rapid-fire machine cannon was without a doubt the emissary of death.\\n\\n When Li landed on the ground, she immediately flipped over and stood up. She grabbed two grenades along the way before tossing them out with all her strength. When she brandished her arm, she felt a wave of pain from her lower back. She couldn’t help but tremble, and as a result, the grenades travelled less than 200 meters, only able to kill three or four enemies. \\n\\n Cannon sounds rang out unendingly, sending an unending barrage of artillery shells on the battlefield. Blasts of flame continuously rose into the air from the high ground, but artillery shells continuously exploded within Steel Gate’s assault army as well, moreover exceptionally accurately, to the extent where the destructive force made the corners of Schneider’s eyes, who was watching from the distance, continuously twitch. He was long aware that there was an exceptionally formidable gunner on the high ground, and he had already ordered the three cannons on his side to prioritize getting rid of the other side’s gunner position. However, those artillery shells either had their trajectories diverted or exploded in midair. The battle already continued for twenty minutes, but the other party’s cannon continued to tenaciously roar, continuously sending Steel Gate’s elites out from this world. \\n\\n Li Gaolei’s movements were steady and swift. With the assistance of a few temporary artillery soldiers, this old-fashioned cannon displayed terrifying power. The assault rifle in his hands would release concentrated blasts of bullets from time to time, eliminating all artillery shells that threatened this position. Only with the high precision, rapid-fire, and large magazine Black Dragonrider advanced assault rifle could he complete this seemingly impossible mission. In addition, this artillery position was completely within the range of his area control ability, so all of the enemy’s artillery shells would be affected upon entering this domain, but more importantly, it gave Li Gaolei a precious cushion of time to take aim. However, despite having all of this supporting him, he was still under great pressure, sweat continuously pouring down from his forehead, turning into a muddled stream after mixing with the dust and smoke in the air. However, no matter how tired Li Gaolei was, his movements never deviated in the slightest, and his stamina that was close to drying up still continuously poured out energy to support the area control ability, moreover with stable output. \\n\\n One had to admit that in a traditional battle, individuals with weapon mastery paired with suitable Combat Domain abilities were the true kings of the battlefield. \\n\\n “Stop hitting the mobile armors and get rid of the infantry behind them!” Li continuously shouted, putting a stop to the soldiers’ wasteful shots on the mobile armors. Even though she had never dealt with mobile armors head on in the battlefield, she was quite clear on the weaknesses of these large, steel wrapped fellas. They had many overlooked areas on their bodies, so once they lost the infantry’s cover, they would become quite easy to destroy. Of course, the passive mobile armors did not have these glaring weaknesses. That fella with the heavy alloy shield was even more like a warrior donned in heavy armor, the mobile armor simply like a bulletproof vest equipped with power. If it was just a normal fight, this fella would still be extremely difficult for her and Li Gaolei to defeat even if they worked together, but right now, they were on the battlefield, and Li still had powerful weapons from the Black Dragonriders. Forget about the others, just the battlefield infantry guided missile alone was enough to destroy this mobile armor. \\n\\n When Schneider saw that only a single mobile armor was destroyed, yet almost half of the foot soldiers were wiped out, his face became ashen, finally acknowledging that the enemy wasn’t a force easy to deal with. Most of these soldiers even had two levels of abilities, with the officers and commanders being elites with three levels, so the loss of more than ten of them would always make him feel deep pain. Schneider gave the order for retreat with a steady voice, preparing to reorganize their assault troop. In the next wave of attacks, he was going to personally join the battle, as well as move out all of the mobile armors to level this small high ground with overwhelming power. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-15-3","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
