{"id":49085,"no":446,"title":"Book 4 Chapter 17.3","content":"Book 4 Chapter 17.3 - Country\n “Should we take a look?” Su was a bit hesitant. \n Madeline who was still immersed in her examination of the vicious wolf’s body immediately said, “Of course we have to! It’s not that far from Frozen Throne, and it has a chance of being related to Frozen Throne. This region has already been sealed for several decades, so no one knows what exactly what has happened, nor does anyone know what exactly Frozen Throne is researching. That’s why we cannot let any clues go, nor can we hastily enter their central region.”\n Su nodded. At this moment, he suddenly felt that Madeline was in fact no longer the pure and beautiful little girl he worried endlessly about, nor was she the quiet and exquisite young girl she appeared to be now. She was stern, logical, and extremely decisive. \n This was the true appearance of a Dark Saint. \n In the two years she monopolized the Trials Division, Madeline’s two main duties were one, to suppress the hidden resistance of the three greatest giants, and two, to track down and deal with rebelling Black Dragonriders. Regardless of whether it was the former or latter, the enemies she dealt with were much more powerful and crafty than normal. From the very first day, Madeline’s feet were nailed firmly down on the center of the Town of Trials. With the passing of time, her status only became more stable, and her great power more apparent, leaving all enemies hidden in the shadows in despair. \n If it wasn’t because she went into Sunset Castle alone, using her own strength to kill unwavering sunset Piccolo in his own home field, it wouldn’t be any different right now; Madeline’s influence would have only grown greater. Her original plan was to use five years of time to completely eliminate Piccolo and Mitchels. She was always someone with patience, because time would forever be on her side. \n The ruler of the Town of Trials must possess absolute strength, but wisdom and decisiveness were conclusive elements. Madeline not only understood slaughter, she was, in fact, one hundred percent a war machine. \n Su knew about the matters that took place in Sunset Castle, but he didn’t know why Madeline would suddenly decide to attack Piccolo. If she was willing to wait just another year, her, who would have underwent another incomplete transformation, would have had the power to flatten Sunset Castle. However, Madeline never spoke about why she made this decision, taking such a great risk that almost ended her life. \n Su also squatted down, placing his hand on the vicious beast’s head. Through Transparent Surveillance, he could sense that it had a rather developed visual system; this was an essential characteristic of all carnivores, but its sight, smell, as well as other sensory systems were all extremely developed as well. What this signified was a high energy consumption. Su, who had already had systematic knowledge towards biological science and technology was quite clear on the implications of this issue. \n “Should be a biological weapon equipped with scouting and offensive characteristics.” Su said. \n Madeline stood up, and washed her hands with the snow around them while saying, “That is the case. Perhaps it is due to the creator’s technological level being rather ordinary that a synthetic pure biological weapon like this would be created. In the Blood Parliament’s biological system, all weaponry are already developed based on specialized application. Apart from unusual situations, no synthetic biological weapons would appear. In addition, our biological weapons are all integrated with tiny microchips and a low power comprehensive system, not pure biological weapons.”\n What Madeline spoke was the truth. For example, the weapons the Blood Parliament used for scouting purposes were all insect types that wouldn’t exceed the size of a housefly. It could continue activity for several days, its radius of activity close to a hundred kilometers, moreover, everything it saw could be recorded within the microchip, extractable following its return back to the base. The effectiveness and efficiency of this type of creature’s scouting was far from what this strengthened wolf-like creature could compare to. \n Meanwhile, the Spider Empress’ Dark Red Castle was precisely the pinnacle symbol of biochemical science and technology within the Blood Parliament. \n However, when Su looked at the corpse on the ground, there was an uncomfortable feeling that did not disappear from within his mind, a feeling similar to danger, but also containing clear disgust, mixed within an urge to destroy it as well. \n “It might not be as simple as we believe it to be.” Su said with a frown. \n “En, there is a possibility. If the ones that created it have the ability to directly communicate with it, then it will be extremely troublesome.” Madeline also stared at this vicious beast’s corpse. \n After taking some time to search around, a day later, a strange looking village appeared in Su’s field of view. \n This village’s terrain was strategically situated and easy to defend. Three meter tall concrete walls surrounded it, and every set distance, there would be a sturdy sentry tower situated in between the walls. The most eye-catching thing at the center of the village was an enormous building covered by a half spherical metal roof, visible even behind the perimeter wall. This kind of style looked similar to an olden era radar station or communications station. Even though quite some time had passed since that era, filling the cover with stains, it was still more or less in good shape. From the size of the surrounding walls, the building\u0027s style, as well as the somewhat peeling signs on the walls, this place looked to be an olden-era military base. \n Despite there being as many as ten sentry positions, only three of them had individuals stationed within them, the gate only having two men with guns on their backs standing guard. At their sides were five or six vicious wolves similar to the one Su saw before, either crouching or hiding, guarding the entrance like police dogs. From time to time, vicious wolves could be seen walking over from the distance, returning to the village, and there were vicious wolves that emerged from the village as well, running into the distant mountain region. It looked like there were much more vicious wolves here than humans, and they indeed were tamed. \n Su observed the village, and then he looked into the sky. “Let’s wait for the dusk.”\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-17-3","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\n The left leads to hell, the right, also leads to hell.\n \"The human race, for the sake of their dreams, they would end up creating demons\"\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
