{"id":49139,"no":500,"title":"Book 4 Chapter 25.6","content":"Book 4 Chapter 25.6 - To Pay\n The transparent death flames immediately flew in all directions after colliding with the icy blue mist. It wrapped around O’Brien’s upper body, and then it continued to spread over his entire body. The icy mist immediately turned into a large amount of steam, moreover melting at lightning speed. \n This was a direct clash. Both of them were magic domain ability users, but O’Brien’s seven levels of power were definitely not something that could match Eileen’s rare eighth level ability. When the flames wrapped around him, what O’Brien felt wasn’t scorching heat, but rather bone chilling coldness! \n This was an omen of death. When the flames truly reached his body, that was when death would descend. Without the protection of a force field, no matter how powerful one’s flesh was, there was still no way it could endure flames over 2000 degrees in temperature. This was a temperature that could melt steel. \n O’Brien’s reasoning told him that he was undoubtedly dead. However, his mind was extremely calm. At this moment, an unforgettable scene filled his mind, a memory from within that dreamland where he personally killed Persephone. Once something happened, the only thing that would remain is a memory, and from a memory standpoint, that scene where one couldn’t distinguish illusion from reality, was the truth. \n Those several years within the dreamland, for O’Brien, felt as long as a century. \n That was why now, he could calmly block in front of Persephone without thinking about his astonishing talent, his far-reaching prospects, or the authority that would allow him to stand at the very peak of mountains. This matter, for him, was simple and natural, to the extent where it was like drinking a cup of coffee after a morning meal. \n However, there were always exceptions in this world. Even if he only wanted to drink a cup of coffee, there were still times when the cup would spill. \n A streak of gentle power suddenly transmitted from the nape of his neck, dragging him backwards. Meanwhile, a snow-white and fine hand reached out from the side, and then a hand blade severed the flames of death. With an opening and closing of the five fingers, the fatal transparent flames were gathered into a small sphere and grabbed in the palm. \n From within the gaps of his arms,O’Brien saw that the one standing in his original position was Persephone. \n With a wave of Persephone’s right hand, the fireball made from the flames of death flew outwards, shooting towards Eileen. Only, the moment the ball of fire left her hand, the intense pain made Persephone’s hand tremble slightly. The fireball’s trajectory deviated slightly, leaning a bit towards Eileen’s left side. \n Right now, Eileen only needed to dodge slightly to the side to avoid it, and she would even have the extra energy to deal with Persephone’s follow-up attack. \n However, as soon as Eileen shifted to the right, her expression suddenly changed! \n A low rumble that sounded like autumn thunder sounded, and the ground trembled intensely as well. Alan appeared from several dozen meters away, supporting the alloy heavy shield that was covered with scars, and like a tank moving at full speed, he smashed towards Eileen! At this moment, Eileen who was controlled from both the flame of death and Persephone already had no way of avoiding this attack!\n A muffled bang sounded. The alloy heavy shield in Alan’s hands released another ear-piercing groan of metal distorting. He staggered back more than ten steps before finally stabilizing himself with difficulty, each step leaving behind footprints that were several tens of centimeters deep. After standing firmly, Alan fiercely spat out a mouthful of blood, the bloody mist immediately dyeing a larger half of the shield red. When this powerful collision force landed on Eileen whose body looked so soft that it seemed like she didn’t have bones, it felt as if he smashed into a mountain. \n However, Eileen wasn’t much better off. In the end, she was still smashed flying, moreover landing in an extremely sorry state. For someone who paid close attention to her outer appearance like her, this signified that her energy consumption was severe, and her injuries were not light. \n Even though Eileen immediately bounced up from the ground, her body was still swaying slightly. When she looked at Persephone, O’Brien, and Alan, she laughed charmingly and said to Persephone, “I truly never expected that you already have a child. However, is there a need to pay such a great price for him?” \n Persephone smiled slightly, but didn’t reply. O’Brien, however, looked towards Persephone with shock. Alan was the only one who emotionlessly stared at Eileen, the heavy shield that had been ravaged with attacks ready to slam into her body at any time.\n After speaking this sentence, Eileen didn’t waste too much time, directly turning around to leave, putting an end to this short and intense battle. \n In the past three months, this type of battle would happen every day, with each battle so intense it seemed as if it wouldn’t end until the death of one side. The scales of victory seemed to be continuously swaying between both parties, yet it would always miraculously return to the center. Each battle was a struggle of life and death, with the slightest mistake resulting in the price of their lives. However, regardless of whether it was Eileen, Persephone, O’Brien, or Alan, none of them made any mistakes, nor did they give their opponents any opportunities. Thus, the battle continued for three months, a seemingly never-ending struggle. \n However, this time, the scale of victory finally inclined towards Eileen. \n Even though it was already the end of summer and the start of autumn, nights in the mountains were still freezing cold. When darkness fell, Persephone, O’Brien, and Alan sat around a bonfire, watching as Alan skillfully roasted the mutated creatures hunted within these mountains. The fiery light was undoubtedly a bright lamp that would lead others right to them in this dark night, with anyone who bore hostility able to discover their whereabouts from several tens of kilometers away. However, none of these three cared about this. \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-4-chapter-25-6","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\n The left leads to hell, the right, also leads to hell.\n \"The human race, for the sake of their dreams, they would end up creating demons\"\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
