{"id":49195,"no":556,"title":"Book 5 Chapter 5.1","content":"Book 5 Chapter 5.1 - The Light Before Dusk\n Just as Dr. Connor was submerged in his own world, the middle-aged male who was still working hard in the laboratory was sitting on his chair, carefully lowering the phone. He carefully looked at it, and only after making sure that he had hung up did he release a breath and slowly adjust his posture. \n His head didn’t have much hair to begin with, so he decided he might as well not leave behind those few hairs. His bald head was glossy, his face that was somewhat swollen filled with abnormal redness, large bags hanging below his bloodshot eyes. As he stared at the phone, a somewhat stupid smile appeared on his face. With a voice so low only he could hear, he muttered, “My name is Gardner, Gardner Lanbiger. You forgot my name again, but forgetting my name on average once a year isn’t that often, really not that often…” \n He wiped his glasses, put them back on, and then stared at the continuously flickering light screen, his face once again flushing with an abnormal redness. The light screen had a glaring progress bar, currently frozen at 58% without moving. As he stared at this progress bar, Gardner’s breathing became heavier and heavier, and while muttering, he continuously laughed like of a chicken. “When I unravel this layer of the gene lock, even if there’s no materials, I can still produce true half apostles! When that time comes, what will the others say? Connor? Who is Connor? Haha, hehe…”\n He suddenly stood up, shouting with a loud voice, “Gardner, the father of apostles! Only this name will be forever left behind! Forever!!” \n Garner sat down heavily, put the headband filled with sensors on his head, joining his brain and the intelligence system. Then, with a feverish passion, began to work at the countless data. Then, hypotheses were tested one after another, data computed and examined. The progress bar then began to nudge forward at an extremely slow pace. \n The road ahead was both distant and difficult, the amount of time it would take before the progress bar reached its end impossible to calculate. A single small pitfall would trap Gardner for several days, or even several months. However, Gardner firmly believed that no matter how long it would take, there will be a day when he would take the progress bar to its end. The world of mathematics was incomparably vast, while thinking was the key into this world. Gardner already grasped the key to breaking the gene lock, so what followed was some tough work. Since there was already a path, no matter how long it was, the time when the end was reached would eventually come. \n After cracking this layer of the genes, Gardner could create chosen at the same quality as the final three specimen, and in terms of abilities, these chosen with eight levels of ability and the potential to develop nine levels could be considered half apostles. Even though they were still extremely far from becoming true apostles, Gardner still believed that Dr. Connor couldn’t even produce half apostles!\n After the apostle project obtained great success, Dr. Connor was surrounded by attention, his days spent immersed in banquets, luxurious living and women. The amount of time he spent on research became less and less. \n Gardner understood clearly that the initial success of the chosen project was mostly a gift bestowed from the heavens. That night, under the influence of some type of element they still didn’t know to this date, the sealed gene lock suddenly changed, the bits of genetic fragments that were released just so happening to solve the initial difficult problems with the chosen project, and as a result, they obtained the mass assembly line of chosen. It could be said that the gods granted these chosen to the world, and not Dr. Connor who made a discovery. \n They needed ‘materials’ to activate the chosen. As for the chosen’s core domains, Dr. Connor still didn’t know a thing, and there was no way he would obtain any new breakthroughs. \n In the realm of science, no matter which field it was from both the past and present era, success often needed enough talent, but sometimes, what was needed was to bite down and do the hard work. Dr. Connor wasn’t going to wrong himself and study tedious and difficult basic research.\n The restless night passed. Helen who had only slept two hours walked out from her bedroom with a bit of fatigue. When she arrived in the dining room, she discovered two men with polar opposite characteristics eating breakfast from the two sides of the long table. Their eyes were constantly glaring at each other, countless sparks clashing between them in midair. As for what exactly rested in their plate of breakfast, regardless of whether it was Lafite or Curtis, neither of them paid it any attention. Even if a few chunks of steel were placed on their plates, they might still eat them. Apart from their black eyes and swollen lips, the other thing these two had in common was that they both ate a lot. Even though their bodies were different, the plates piled high up beside them were nearly identical. The amount they ate for breakfast was the same as a month’s worth for an ordinary person, and it still didn’t seem like they were full. \n Most high level ability users ate an astonishing amount of food, requiring large amounts of food to maintain high level combat and prevent exhaustion. For freaks like Curtis and Lafite, the amount they ate could even be considered endless. However, from the amount they ate for breakfast, it meant that the battle that happened last night was definitely not simple. Neither of them could bother with dignity as they ate a large amount of food to recover their consumption. Curtis never cared about his external appearance, but Lafite was different. He was someone who almost had an obsession with cleanliness, but now, he didn’t even bother eliminating the bruises from his face either. \n Helen produced a plate of breakfast from the multi-functional wall cabinets, sat down on the other end of the dining table, and then began to silently eat. Her movements couldn’t be considered graceful, but they were simple and efficient. When she saw the two men who were staring at each other like fighting chickens, Helen couldn’t help but feel a bit of a headache. Forget about anything else, just their way of eating meant that the hospital’s reserves would only be enough for a week at most. During this period of chaos and disorder, food was always the most precious thing. Helen’s irregular brain began to quickly operate, thinking over how she was going to make back these costs from their bodies, of course, it would be better if there was some interest to collect as well. In the blink of an eye, she already thought of hundreds of methods, and through derivation and simulation, she decided on a dozen or so courses of action that were most optimal. \n When something involved the private hospital and laboratory’s operations, it could no longer be considered a small matter. Using a bit more of her brain’s leftover calculating ability on this was something Helen felt was worthwhile. \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-5-1","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\n The left leads to hell, the right, also leads to hell.\n \"The human race, for the sake of their dreams, they would end up creating demons\"\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
