{"id":49204,"no":565,"title":"Book 5 Chapter 6.3","content":"Book 5 Chapter 6.3 - New Life\\n\\n When the blood beast opened its enormous mouth, Su already entered a crouching stance. His upper body leaned forward, arms crossed to protect his head and chest. However, the energy pillar arrived just too quickly, forcing Su to defend instead of dodge. The energy pillar silently engulfed Su’s body. If time was slowed down at this moment, one would see that the other end of the pillar of light separated from the blood beast’s mouth, gradually diminish in size, and then eventually, a blazing fireball condensed before Su’s arms. The fireball immediately turned into a sphere of raging flames, passing by Su’s body!\\n\\n When he resisted the fireball somewhat, Su’s legs exerted force, rising into the air, his entire body flying backwards with the momentum of the flame. Only after flying out a dozen or so meters did he spin in the air, freeing himself from the blazing stream of heat. \\n\\n Su stood steadily on the ground, on his face and exposed skin a faint layer of glistening light. This was the result of countless fragmented crystals being released and gathering on his body surface. Even though the stream of heat was extremely vicious, Su didn’t remain inside of it that long, so there weren’t any clear injuries. However, the front end of his military boots already began to melt, the edges of his eye-patch beginning to curl, scorched black, almost completely burnt. As a result, one could see the terrifying power of the fiery stream. \\n\\n After releasing this strike, the blood beast suddenly released raging flames, turning into ashes in the blink of an eye. That energy cannon already exhausted all of its vitality. \\n\\n Everything happened too quickly, with not even Madeline able to react in time. Cirvanas even more so stood there with a stupefied expression, not understanding what exactly happened. \\n\\n Su tore off everything on him that couldn’t endure the temperature of the flames and flung it to the side. He walked to the blood beast’s embers and reached out his hand to inspect the remains. The enormous blood beast only left behind a thin pile of ashes, scattered and fragmented droplets of blood and hair on the surrounding ground. It was hard to imagine that these were the remains of an enormous beast. \\n\\n Su carefully picked up some of the warm droplets of blood, pinching them between his fingers. His exceptional perception ability not only analyzed the blood bead’s cellular composition, but also traced the chaotic flow of the remaining energy. Inside the blood bead, Su vaguely sensed a strand of unique energy, but as soon as he wanted to further analyze it, this strand of energy suddenly disappeared with a flash, unexpectedly completely vanishing. \\n\\n This completely defied normal reasoning. Energy could scatter, be consumed, or changed, but it wouldn’t disappear for no reason. Even though it was extremely weak, since it was sensed by Su, then it shouldn’t have slipped away. \\n\\n “What do you think?” Madeline asked. This type of strange and vicious attack method was something not even she had heard of before. She didn’t excel in perception, so she could only rely on Su with his powerful perception abilities. \\n\\n “Not poison, nor is it a disguised biochemical beast. It does seem to have been incited by some type of energy, and after all of the cells in its body were directly ignited, they were gathered to form the final energy cannon.” Su’s brows were tightly locked together, making a speculation even he himself found hard to believe. \\n\\n If what Su said was real, then it meant that the one who ambushed them already reached an inconceivable level of energy control, already exceeding the limits of modern era’s abilities, science, or technology. This was a remodeling through energy resonance, crossing space to turn an ordinary creature into a powerful battle weapon. In addition, what was used was the energy stored within the creature itself. An ordinary snow beast, in a short moment, was altered into an energy cannon, releasing an attack that was not inferior to seven levels of magic ability!\\n\\n “This matter… does it have some type of connection with me?” Madeline asked with a serious expression. Regardless of whether it was she herself or the Spider Empress, there didn’t seem to be an enemy as terrifying as this one. \\n\\n Su stood up. He released a heavy sigh, and then said, “No, this is my matter, unrelated to you. Be careful, it is quite likely that the ambush hasn’t ended…”\\n\\n Before Su finished his sentence, the snowy ground beneath Cirvanas’ feet suddenly exploded, from within scuttling out a rabbit-like mutated creature! As soon as he saw its forehead expand, Su already had a bad premonition. His body flashed over to Cirvanas’ side, and then with a push from his shoulder, the young man already flew out. He then moved his body together, curling into a ball, protecting his head, chest, and other vital areas under his arms and knees. \\n\\n The snow rabbit’s body already swelled to ten times it original size, and through its skin that had expanded to the extreme, one could see that its body was full of a roiling fiery paste! \\n\\n With a light hong sound, a scorching ball of flame appeared above the snowy plains, the stream of flames engulfing an area several dozen meters in diameter. Then, it gathered together and shot upwards, forming a miniature mushroom cloud that slowly rose. \\n\\n The power of the explosion didn’t seem to be much weaker than that of the blood beast. Even though Cirvanas already flew out more than ten meters, he was still swept through by the fiery stream and blast wave. With a groan, his body smashed into the ground. As for Su who was at the very center of the explosion, he was directly blasted several dozen meters out, his sturdy combat suit also having many gaps now opened. Madeline immediately dropped to the ground, holding the heavy sword in a slanted manner to protect herself. \\n\\n “There’s still more!” Su roared out. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-6-3","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
