{"id":49234,"no":595,"title":"Book 5 Chapter 11.5","content":"Book 5 Chapter 11.5 - Bandit Su hesitated, his brain even more so operating at its highest output, trying to find clues in the fishman gene data that he had already acquired to break through this mysterious quiet region. This region was definitely hiding something, an order, a function like self destruction at a critical moment, or perhaps potential to be aroused. It might even be there just to erase certain traces. Just as Su was searching for a way to decipher this mystery, an especially vicious blood speck finally couldn’t suppress its instincts, taking a ‘nibble’ at the nerve. When it bit down, the nerve bundle immediately reacted. It trembled, sent out a signal, and then became still like a piece of dead flesh. This signal was seized by the blood specks and flesh feelers, and it was amplified before being transmitted back to Su’s body. Upon receiving this signal, before Su displayed any reaction, his body already instinctively responded. All of the blood specks shook at the same time, producing hundreds of different frequency type sound waves and force fields. These wave fields continuously changed from one frequency to the other. Finally, one wave touched upon a certain mysterious frequency, and then this entire region came alive! In that instant, Su’s mind made contact with a brand new world. That was an ocean world, ice cold, dark, and lonely. There was only a single lord in that world, and there was only a single life. That was an inconceivably enormous existence. At the very least, the consciousness it projected was already as vast as a sea! A world-shaking voice suddenly sounded within Su’s consciousness! The moment Su made contact with the other party’s spiritual world, the other party also saw Su. In that instant, the two spiritual worlds were virtually connected. “Who is prying into my secrets?!” In that instant, the world seemed to only contain this voice! The frozen ocean world’s calm sea erupted in that instant. No not only did it erupt, the entire great sea was rising into the sky! This world, every inch and space was filled with ocean water. The cold, dark, and heavy pressure made up the entire world. Human consciousness and mind had a limit, while this sensation was tremendous, far surpassing what a human could contain! On the earth in front of this furious frozen sea that seemed to reach into the heavens towered an insignificant speck: Su. Su’s spiritual world was similarly vast. There were night skies, the world enveloped in a curtain of darkness. There were stars hanging in the sky, and there were continuous mountain ranges that extended for thousands of miles, vast like a true universe. However, though this world was as vast as a universe, beneath Su’s feet was an extremely desolate and large star, his consciousness itself was about the size of a human’s. As these two spiritual worlds joined up, endless ocean water was currently flooding over. What Su faced was an angry sea that could drown out an entire solar system! At this moment, Su didn’t think anything else, nor did he hesitate. He simply and directly faced this sea that seemed to stretch for no end, rushing up against the tide. Su, who had maintained the same posture for more than half an hour, suddenly trembled. The fishman’s hindbrain ruptured, releasing a several meter long blood arrow. Meanwhile, Su’s body suddenly went rigid, and a few seconds later, suddenly released fine wisps of blood from his mouth, nose, ears, and even the corners of his eyes! Madeline’s face suddenly became deathly pale, her lips opening slightly, wishing to scream out, yet nothing came out. Her hand was already raised, wishing to hug Su, but it froze in midair, unable to reach out even a bit further. She suddenly felt cold, a suffocating bone-penetrating coldness! “Master!” Cirvanas, who was more than ten meters out, lagged behind an entire second before realizing something was wrong. He suddenly turned around, throwing himself towards Su with flying speed. Madeline suddenly appeared in front of the young man. Her right arm moved, and then with a bang sound, the young man flew out a dozen meters, falling back to his original location. The sudden impact left Cirvanas feeling a wave of dizziness, not understanding what exactly happened. However, he knew that Su’s vitality was quickly flowing away, already closed to withering up, yet showed no sign of stopping! Through the nucleus’ connection with Su, he could clearly sense this point! Was Su going to die? This thought was like a rock, one that smashed down again and again on the young man’s consciousness. If Su died, then the spiritual world would also vanish. Then Ansuna, would she also disappear? The strike Madeline released just now was extremely heavy. Her casual strike contained six levels of power, so seven or eight of the young man’s ribs were broken. However, the young man ignored the intense pain, continuing to crawl over, frantically rushing at Su. When he made it halfway there, Cirvanas suddenly stopped. Madeline’s heavy sword was already pressed against his neck! The rough sword edge was full of knicks, already no sharpness to speak of. However, the coldness the the blade released reminded the youth that Madeline’s killing intent was real, not imaginary. “Get lost! If you come here again, I’ll kill you!” Madeline said calmly. Cirvanas knew that she definitely wasn’t joking this time. However, he wanted to know why something would suddenly happen to Su. He was even more confused why Madeline would behave so strangely. However, after considering the special relationship between Madeline and Su, Cirvanas still ultimately decided to slowly back up. However, he only withdrew a set distance, and then he was no longer willing to travel any further. Madeline didn’t pay him any attention, only watching Su. Cirvanas could only see Madeline’s rear figure, unable to see her expression. She still stood tall like a statue, the hand holding the sword gentle and steady without any trace of strangeness. Only when wind blew over, bringing her silver gray long hair upwards, was there a bit of disorder. In reality, Madeline herself didn’t even know why she was so calm. Perhaps after experiencing it once, she no longer behaved as indecisive and helpless as back then, right? She continued to stand there like that, watching as Su’s head slowly fell. The frozen sea and the snowy shore finally became peaceful again. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-11-5","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
