{"id":49249,"no":610,"title":"Book 5 Chapter 14.2","content":"Book 5 Chapter 14.2 - Plan\\n\\n The young man who was working hard at cutting up the whale shark suddenly trembled, and then fell forward, landing on a pile of whale fat pieces that had just been properly chopped up. The ice blade in his hand fell onto the ice surface, the blade, now incredibly fragile after losing the support of the ability, shattering into countless pieces with a pa sound. The body of the young man who fell twitched, losing the ability to get up. Madeline was surprised, walked over to Cirvanas’ side, and after carefully examining him, said with shock, “Why did he evolve an ability at this time?”\\n\\n “This…” Su scratched his light blonde hair, somewhat unsure as he said, “...should be an order that I inadvertently gave him, forcing him to produce a new ability, I think?”\\n\\n Madeline’s eyebrows raised, feeling even more shock. “You can directly control him?”\\n\\n There weren’t too many secrets and misgivings between Su and Madeline. “I can, through the nucleus. The nucleus’ relationship with myself previously was only to sense his condition, and only now did I notice that I can directly control his body. Perhaps only a certain area.” \\n\\n “A certain area?” Madeline looked at Su and said, “Advancing an ability is something on a genetic level, so controlling genes is much more thorough than controlling his actions! I truly never expected the nucleus would even have this type of use. Right, don’t I have a nucleus here too?”\\n\\n Madeline stuck out her body, pointing at her chest, her blue eyes not blinking as she looked at Su. \\n\\n “Cirvanas’ nucleus was created from a part of myself, so the connection is a bit stronger. As for your nucleus, it originally belonged to General, something that already existed, so the connection is extremely weak…” When he spoke up to here, Su’s voice suddenly stopped, his eyes that landed on Madeline’s chest instantly beginning to burn!\\n\\n The young lady’s chest was naturally tall and straight, not possessing curves that were too shocking, but it definity didn’t lack the necessary elements of a beauty. In reality, Madeline displayed a shocking beauty ever since she was little, ever since Su first saw her. The area she was pointing towards was currently rising and falling slowly, silently reminding that this area was extremely full and soft, not hard like steel as displayed during battle.\\n\\n Su’s throat suddenly became extremely dry, bitter and pained as if he had spent a week in a desert. The young lady’s jacket materials were extremely sturdy, able to stop close range shot from a long range pistol. However, even if she wore a bulletproof vest, it couldn’t stop Su’s strength. Su’s eyes gradually became sharp.\\n\\n Just by using five levels of power, the amount of force Su’s hands could immediately display exceeded a thousand kilograms, able to tear apart the young lady’s combat jacket and everything beneath. Meanwhile, Madeline’s defensive strength was outstanding, not being injured by any attack carrying less than three thousand kilograms of force, so her body shouldn’t be damaged. With slightly adjusted methods, he would then tear apart the pants that carried slightly inferior defensive prowess, and after that, came reproduction. \\n\\n The amount of time it would take to eliminate all obstruction took less than a second. The amount of time it would take to carry out the reproduction sequence, wouldn’t exceed a second. The amount of time needed to complete the reproduction procedure… ranged from three seconds to ten hours. If needed, he could continue until his stamina was completely exhausted before stopping. The chances of Madeline resisting didn’t exceed 30%, and the probability of completing coitus under a situation of resistance, didn’t exceed 10%.\\n\\n A series of data immediately appeared, and then it was even accompanied by a series of actions that were detailed to a truly ridiculous state, to the extent where whether his fingers should either reach in or pull out at particular times, the angle and intensity, was already predetermined. Even if Su closed his eyes and didn’t think about anything, his body would still be able to carry out all of these actions based on this plan. \\n\\n “What is this…” Su laughed bitterly. Only with great difficulty did he cool-headedly find the underlying meaning behind the word ‘reproduction’. Reproduction had a meaning, but the process was not as simple as the goal, and the entire process’ implications...\\n\\n When his thoughts reached this point, a rumbling sound rang out beside Su’s ears. The over a thousand processing cores that had already formed in his brain started up two hundred to think about the reproduction procedure, but now, due to some unknown stimulus, the remaining eight hundred processing cores suddenly simultaneously operated, the sea of data quickly broken up and distributed, almost instantly sending feedback, forming a clear consciousness!\\n\\n “Reproduction process revised, additional objective: reduce target resistance probability; additional objective: raise target acceptance degree; additional objective: increase chances of follow-up reproduction procedure… time to enter reproduction procedure, less than a second. Reproduction process adjusting, revised action number one: …”\\n\\n Data erupted like a volcano, the completely erupted instincts catching Su unprepared. His own consciousness was extremely fast as well, at the very least able to deal with the flood of data his instincts erupted with, so he understood clearly the meaning behind this series of plans.\\n\\n Reproduction, this was his instinct’s ultimate objective. \\n\\n No matter how the plan was adjusted, to the extent where even if Madeline’s willingness and acceptance degree were raised to the highest level of priority, removing all hindrance and entering the reproduction procedure’s time didn’t change, always remaining at the shortest time possible. \\n\\n Meanwhile, the amount of time needed to complete the first reproduction procedure… was also set to be the shortest three seconds. \\n\\n At the very least, the as many as a hundred and sixty types of reproduction procedures that were adjusted, as well as the countless changes that were developed by changing the fundamental plan, were all things that came after the first reproductive procedure was completed. The goal was only to obtain more follow-up reproduction procedure chances, and to ensure the success of the reproduction. His instincts already calculated that if he immediately started the second procedure after the first ended, it wouldn’t affect the final goal of the procedure, moreover, the success rate of the second reproduction starting was 100%. \\n\\n “This shit even needs to be calculated?!” Su cursed inwardly with great resentment. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-14-2","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
