{"id":49288,"no":649,"title":"Book 5 Chapter 19.7","content":"Book 5 Chapter 19.7 - Love and Forgiveness\\n\\n The woman nodded with great difficulty, this small movement causing a few injuries to open up between Su’s fingertips. The breeding tank descended, and with a thunk sound returned to its original position. She could no longer lift this heavy breeding tank. \\n\\n Su didn’t reply, instead activating his perception, pouring it over the woman’s body like a stream, and then seeping inside. The woman’s entire body trembled, instinctively gathering energy to resist Su’s perception, but she released a sigh, forcing her body to completely relax, exposing all of her mental and physical secrets before Su. \\n\\n If one only looked at her from her exterior, she was completely a beautiful human female, her exposed body full of sex appeal and energy, her long and powerful legs making others lose themselves in their wild and fanciful thoughts. She preserved all human female characteristics, but the inside of her body, its composition and organization, was already entirely different. Not only was there the greatest extent of optimization on her human female characteristics, her internal organs were even completely different. From this composition, there were many similarities between her and Su. \\n\\n This was also the reason why Su had never loosened his right hand that gripped her neck. In Su’s eyes, this woman was an extremely dangerous combat creature, a ranked life form that possessed similar characteristics as himself, as well as a great enemy that he had to deal with using his full attention, the degree of danger even exceeding Pandora, only a bit lower than the apostle in Su’s order of priority.\\n\\n Su’s left hand stroked her chest. Through the once again strengthened perception ability of contact, he began to explore all of her body’s deepest secrets. He never expected to see a familiar organ emerge from her body, moreover taking the initiative to open up before Su. \\n\\n Su’s heart immediately sped up a beat!\\n\\n Nucleus!\\n\\n Even though he already anticipated it a bit, when he truly sensed the nucleus, Su still found it a bit hard to suppress his emotions. \\n\\n Su stared at this woman, and then slowly said, “You are ‘General’.”\\n\\n “I am not only ‘General’, I am also ‘Key’.” The woman replied.\\n\\n General and Key, both of these words were spoken using the Bisindle language. \\n\\n The nucleus in the woman’s body slowly opened. Under Su’s perception, several hundred gene fragments appeared. After a brief analysis, Su already knew that these gene fragments were precisely the crucial pieces that completed the swamp beasts, military engineers, and dragonborn’s fragmented genome. What was even more important was that the woman’s body similarly lacked over a hundred crucial fragments, and they also existed in the depths of the nucleus! Moreover, as more and more genetic fragments surged, the species of biological weapons that appeared before Su increased more and more, many of which Su had never seen before. There were quite a few biological weapons who were stronger than the dragonborn. \\n\\n This was the ‘Key’ this woman was speaking about. When one obtained the ‘Key’, it was equivalent to obtaining a complete biological arsenal. As long as there was suitable equipment and ample resources, Su could immediately establish a biological army of his own!\\n\\n “Release him, and all of this is yours.” The woman wasn’t negotiating, but rather begging.\\n\\n Let him go? Su understood the woman’s intentions, this matter wasn’t as simple as it looked on the surface. These several hundred pieces of extremely precious gene fragments were like the treasure in in a treasure chest, currently only revealing a corner through a crack. All of the gene jigsaw puzzles were missing the most crucial part; that was the nucleus. \\n\\n Only when the nucleus was completely broken down would one be able to obtain the true ‘Key’.\\n\\n Let him go, and she’d stay behind. This was her proposal.\\n\\n The ‘General’ in Bisindle language represented the most powerful biological weapon. It didn’t always have the greatest combat strength, but it could adapt to almost any environment, as well as possess endless growth potential, on the premise that there was ample energy. General was simultaneously equipped with high level intelligence, the natural commander of a biological army. \\n\\n General was nucleus, two sides of the same body. After losing the nucleus, General would also thereupon disappear. \\n\\n Madeline wasn’t a General, her body forcefully suppressing the nucleus’ authority, turning it purely into an energy supply organ in place of a heart. Cirvanas was close to a General, the nucleus in his body his life core, and also possessed low level intelligence. In certain situations, for example, when it threatened Su, the nucleus would seize control as the body’s highest level of authority. \\n\\n Meanwhile, this woman before Su seemed to be a complete General, the degree of similarity reaching 99%. The nucleus was her everything, and the nucleus in her body possessed the highest level of intelligence on its own. Normally speaking, General didn’t need a brain, it only had a dozen or over a hundred intelligence cores scattered throughout its entire body as its body needed. \\n\\n From a General’s perspective, this woman’s performance was extremely strange. Under circumstances where there wasn’t any special significance, for example protecting the master, the nucleus wouldn’t carry out a self-destruct order. \\n\\n “You should understand what this signifies.” Su spoke with an indifferent tone. \\n\\n “I do.” The woman replied. \\n\\n Su still didn’t let her go, his eyes instead becoming even colder. “Then release your memories.”\\n\\n The woman stared blankly for a moment. However, she knew that she had no choice. She slowly closed her eyes, two light purple tears sliding down her cheeks. Her body relaxed once again, her tentacles that were originally tense from nervousness now falling one after another as well.\\n\\n Unknowingly when, Madeline and Cirvanas entered the lounge, standing behind Su. When they saw this place, perhaps because they both had a nucleus, Cirvanas took a step forward, wanting to say something. However, Madeline’s hand was already placed on his shoulder, stopping him. \\n\\n New nerve cells were released from the flesh needles inserted into the woman’s body, forming a temporary neural network, linking Su and the woman together. In that instant, a rumbling sound suddenly erupted in Su’s brain, countless scenes flooding into his memories like a sea!\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-19-7","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
