{"id":49289,"no":650,"title":"Book 5 Chapter 19.8","content":"Book 5 Chapter 19.8 - Love and Forgiveness\\n\\n The initial memories were all dark, only some occasional scenes with the primary color base being a deep green, the inside full of all types of instruments and busy researchers, almost identical to Su’s dreams. Then, what followed were large chunks of darkness and blankness, all the way until her world lit up again. In her memories, a single person appeared. To be more precise, a creature whose exterior form was similar to a man appeared. In the woman’s memories, it was only a black moving silhouette, appearance impossible to make out. However, the powerful feeling of acknowledging allegiance from the depths of her body still gave Su a deep impression. If everything was as he expected, then it should be this woman’s master. \\n\\n The only scene where it appeared was one where flames raged behind it. It was currently walking towards the raging flames, only leaving behind a gradually disappearing rear figure. From the following memories, he knew that it had never returned.\\n\\n Only after it left did the woman’s memories increase, gradually developing its own consciousness. She similarly had intelligence cores, the level seemingly even a bit higher than Su’s. However, she only had ten of them, an entire order of magnitude of difference when compared to Su’s hundreds of intelligence cores. Because of the intelligence cores, her memories also looked mixed up and chaotic, often times producing seven or eight scenes at the same time, signifying seven or eight simultaneous thoughts. Without a highest level of will, this would only bring her confusion in her actions. \\n\\n Su discovered that as she gradually developed independent consciousness, one consciousness became increasingly clear, and gradually assumed the leading position. It was a gentle and soft woman, and she was constantly in fear. She had memories that had been covered in dust for a long time, memories belonging to a young lady that had existed before the dark period. Before the dark period, she only left behind a piece of simple fear. The fear’s contents had already disappeared, but due to the fear being too strong, it was thus engraved in the innermost depths of her memories. After developing independent consciousness, she also felt fear, fearing her previous companion, fearing it, fearing that they would return and find her. At that time, the female consciousness she had would disappear, once again becoming a weapon that only knew how to obey orders. \\n\\n From this piece of her memories, Su deduced that she was originally a human young girl, but because she was extremely compatible with the nucleus, she was turned into General. When her master left, the consciousness that belonged to the young lady occupied the body’s main command. In addition, when she woke up, it was clear that the war had already broken out, because there wasn’t a single person in this base. \\n\\n What followed was an endless wait, but she didn’t end up encountering those like her, but instead first greeted the Holy Crusaders’ exploration squad. The exploration squad brought her considerable fear at first, but her General instincts still displayed its use. As a result, she quickly catalyzed a group of biological weapons, and then hid by the base’s entrance. \\n\\n What followed were scenes of intense battle, every scene filled with a tall, big man, he nearly single-handedly resisted a third of the biological weapons’ attacks. Wherever it was most dangerous, that was where he would appear. At the moment of crisis, he would even use his own body to block the claws of biological beasts,protect his companions!\\n\\n At this time, an extremely clear and large scene appeared before Su. It seemed to occupy his entire field of view, so one could see just how deep this impression was! There were biological soldier remains, as well as the corpses of the Holy Crusaders’ great knights. As a General it was done by her personally. Several meter long flexible stingers already extended from her ten fingers, piercing through the man’s body, as well as a female knight’s body, stringing them up together. In reality, she only attacked that female knight after impaling two great knights to death. That man suddenly released a great roar, throwing himself over, using his own body to protect that female knight!\\n\\n She wasn’t a biological beast. At that moment, his body was weary and strength exhausted, so her ten fingers easily passed through his body, and then entered that female knight’s body, erasing all life from these two.\\n\\n He used the last of his strength to turn around, borrowing General’s fingertips to do so, hugging that female knight. Then, his head dung down, unexpectedly smiling, smiling as he died. Only, before his death, he couldn’t even leave behind a single sentence. \\n\\n In that instant, the part of her that was a human woman was deeply shocked!\\n\\n She didn’t know how the remaining knights were let go, to the extent where she even permitted them to bring out a lot of precious information, all to keep this man’s body here. \\n\\n In the years that followed, she concentrated all of her resources and energy on restoring this man’s body, not worrying about herself at all, only wishing to revive him. After many years had passed, as a woman, she knew that she already fell in love, loving this man she had never gotten to know. However, the current her was a combination of a General and woman, this was true even for her consciousness. For the sake of saving him, she even began to extract her own life energy! However, General was the most powerful combat weapon, but wasn’t a biochemistry engineer, nor was she a human researcher. She was completely groping around in darkness. Even with all of her hard work, she could only help him restore the most basic characteristics of life. \\n\\n What followed was Su’s arrival.\\n\\n Su gave the male in the breeding tank another look. In reality, from the very first moment, he already saw that only this man’s body was alive, his brain long withered away and died, to the extent where not even his memories could be extracted. From a certain perspective, this man was already completely dead. Even if he was revived with biological weapon technology, he wouldn’t be himself anymore. Su believed that there was no way this woman who was also General couldn’t see this point, yet she still decided to spare no resources and energy on him, to the extent where she would even give up her last chance to retaliate to protect his body. \\n\\n “What number experimental subject are you?” Su suddenly asked.\\n\\n “I… I don’t know either.” The woman said. Towards her time as a breeding tank experiment, she truly only had a bit of damaged memories, unable to recall which experimental subject she was exactly. However, regardless of whether she was experiment number one, two, or three, there wasn’t much of a difference.\\n\\n The green radiance in Su’s gaze began to recede. His right hand loosened, and then the woman’s body in the air landed on the ground. The blades on Su’s right hand gradually retracted into his body, a faint charming smile appearing on his face again. \\n\\n The woman was both startled and happy, crying out, “You… you agreed? I’ll give you the key right now!”\\n\\n While speaking, it was almost as if she was scared of Su going back on his decision. Her fingertips produced sharp blades, and then they suddenly shot towards her own chest! She was going to pull out the nucleus and hand it to Su.\\n\\n However, when the blades barely made it through the skin covering her chest, it could no longer enter further. Su held her wrist, his powerful strength preventing her hand from moving even a bit further. \\n\\n “You… are you going back on your promise?!” The woman said with a trembling voice, as if she wasn’t a General on the same level as Su at all.\\n\\n “No, he is still yours.” Su said. He then tapped her chest with his finger and said, “Keep that with you too, it’s useless to me.” \\n\\n The woman was clearly stupefied. As a general, she understood clearly the value of genes and a complete nucleus, so she couldn’t believe that Su would actually give up on the ‘Key’. \\n\\n However, Su already turned around, gently tapping Madeline on the back and saying, “Let’s go.” \\n\\n Madeline’s azure eyes looked at Su, saying seriously, “That is really good stuff. Do you really not want it?”\\n\\n Su smiled and said, “Of course I know that’s good stuff! However, it’s not like I want to rule the world, so even if I have it, what’s the use?”\\n\\n After speaking, Su brought Madeline and Cirvanas out from the lounge. After walking out a few steps, he suddenly turned around, gave the woman who was still standing there in a stupor a look, and then waved his hand in goodbye. \\n\\n The woman stood there with a blank expression on her face, watching as Su’s body gradually disappeared into the distance. If this was what the man from back then used his life to teach her, what the meaning of bravery and responsibility was, then today, she saw on Su’s body a sunshine that didn’t exist in the underground world. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-19-8","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
