{"id":49295,"no":656,"title":"Book 5 Chapter 20.6","content":"Book 5 Chapter 20.6 - Called the Most Powerful\n The instant the tactical missile came into view, Curtis grabbed the rapid-fire machine cannon beside him with movements that couldn’t be captured by the naked eye. The cannon’s barrels naturally aimed upwards, and then a concentrated barrage of bullets erupted outwards!\n A dazzling sphere of flame suddenly erupted in the sky, burning up all of the clouds of radiation within a hundred meter radius, exposing the azure sky behind the clouds! Only then did the sphere of fire turn into a burning cloud that interweaved between red and black, slowly rising, finally merging into one with the clouds of radiation that gathered again. Shrapnel fell from the skies while carrying flames, dropping like rain, an explosion that was even more resounding than a clap of thunder sounding at this moment from high up in the skies. With a crash sound, the few glass windows that remained were completely shattered, the glass fragments rushing into the rooms and scattering themselves all over the ground. \n Scorching streams of air that could ignite an entire city rushed down from the skies, viciously blasting the captain’s completely exposed upper body. However, aside from the captain’s hair that curled slightly, it only made that shining black skin appear even more brilliant. \n Only at this moment did Curtis who stood tall in this rain of fire display a bit of his past imposingness, the overwhelming might that made enemies on the battlefield flee for their lives upon hearing his name. \n After striking down the tactical missile, the machine cannon remained silent for a second. Curtis had one foot on the roof edge’s protective railing, the cannon’s end held horizontally. His forceful gaze stared a thousand meters out. The place where his eyes landed was part of the ruins, but the captain’s smile became even clearer, his mouth of teeth white to the point of making others tremble in fear!\n “Finally released the guided missile you all were hoarding, you little mice are useless now!” Curtis squeezed out this sentence from clenched teeth. The machine cannon’s barrel spun about again, a 40mm artillery shell roared out. Like an unstoppable whip of burning metal, it ruthlessly hacked apart the distant ruins. In the current circumstances where satellite navigation systems didn’t exist at all, for the tactical missile to be this precise meant that there was definitely someone nearby who used a laser to provide the position. \n The few soldiers that were hiding in the ruins immediately turned pale with fright upon seeing Curtis turn the machine cannon over, immediately fleeing in all directions. Their movements were quick, their exploitation of the terrain almost perfect. Unfortunately, Curtis wasn’t someone who followed textbook tactics. The 40mm caliber, fully loaded rotating barrel machine cannon wasn’t a weapon that existed in the olden era. Under the artillery shell’s terrifying power, even reinforced concrete was as brittle as glass. The streams of heat directly tore through the wall remains, turning the people behind them into blasts of blood!\n These mice immediately became history. The rotating machine cannon barrels slowly reduced speed, finally stopping.\n Curtis stood just like that on the private hospital’s roof, his large mouth cracking open a grin, scanning the surroundings with his small eyes in an incredibly arrogant manner. The private hospital was already the highest point in this region, making Curtis who stood at the very peak of the hospital the most eye-grabbing target within a range of a thousand meters. This was the best sniping target, yet not a single sniper dared to aim their crosshairs at Curtis. The captain believed that there weren’t any snipers who dared take aim at him left, because dumb fellas like these had already been wiped out a few days ago. \n At this time, a figure suddenly appeared in the distant ruins. This was a middle-aged male. His well-fitted dark formal attire, refined bearing, and even his meticulously trimmed small beard made him completely incompatible with the surrounding ruins that were covered in smoke. When he smiled, the middle-aged man displayed all of his charm and charisma. He didn’t approach any closer, instead maintaining a distance of a thousand meters. He pointed towards Curtis, and then his thumb slowly turned downwards, forcefully completing this motion!\n When faced with this challenge, Curtis’ lips cracked open. He raised the terrifyingly large machine cannon in his right hand, gave the still burning hot barrel a few taps with his left hand, and then spat a thick clump of spittle onto the ground in front of him. Those who participated in the ‘Blood Colored Dusk’ back then all knew the meaning of this typical gesture from Curtis: You still don’t have the qualifications to make me lower my toys!\n The middle-aged male’s face fell. However, after giving the private hospital a look, in the end, he didn’t say anything, turning around to leave.\n “Another spineless piece of shit who only looks pretty!” Curtis spat out again, but who knew who he was really cursing at. \n “Already used up a minute and forty-seven seconds… still need nine minutes and three point seven two seconds.” In the laboratory, Lafite’s brain operated at extreme speed, the only bit of brainpower he could free up used to calculate the amount of time needed. Before this rare opportunity, he definitely put on quite the performance, the calculations that originally needed seventeen minutes already compressed to a bit over ten. Lafite, whose entire body was surging with silver flames, was currently comparable to an outstanding large-scale intelligence center. \n However, just like how an olden era computer would break down, new era intelligence centers would also jam. Lafite’s brain that was operating at full speed suddenly crashed. When he looked at Helen, it was as if he was looking at a ghost.\n Helen finally returned from her thoughts. She gave the light screens in front of her a glance, and then she closed her eyes. Her blonde hair suddenly floated upwards, and then they gently fell! Five seconds, after just five seconds, she opened her eyes again, starting to input the calculation results on the virtual keyboard.\n As if she sensed Lafite’s expression, Helen didn’t even glance sideways as she spoke in her typical mechanical pitch, “More than one have tried to challenge my intelligence. However, none of them were smart enough.”\n As he observed Helen, Lafite’s heart turned a deathly gray. He finally understood that due to certain reasons, only now did Helen start to become serious, starting to display her brilliance in this chaotic and crazy world.\n Damn it! Which bastard poked the hornet nest?! Lafite roared inwardly. He had never wanted to kill as badly as right now. \n Through the reflections of one of the light screens, Lafite saw himself. \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-20-6","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\n The left leads to hell, the right, also leads to hell.\n \"The human race, for the sake of their dreams, they would end up creating demons\"\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
