{"id":49308,"no":669,"title":"Book 5 Chapter 22.5","content":"Book 5 Chapter 22.5 - Rest\\n\\n The young man was completely shocked, involuntarily crying out, “Impossible! That is the Holy Mother’s place of rest, only…”\\n\\n “Sir Machard!” The elder’s stern voice cut the young man off, and only then did the young man realize that he had unintentionally leaked out an enormous secret. His face couldn’t help but turn pale.\\n\\n Su’s eyes narrowed slightly, and then said, “Then I’ll have to apologize.”\\n\\n Su’s words were compressed to the extreme. Ordinary people would only hear a short and sharp screech. The soundwaves were condensed like needles, piercing towards the space between the young man’s brows!\\n\\n “You dare!” The old man roared out. His head of white hair stood on end, and then he threw himself over like a raging lion! His roar shattering Su’s sound needle, and then his left hand even more so releasing a simple fist strike towards his chest! Only, the instant the fist was released, crackling electrical arcs were unexpectedly produced. This was was already terrifying power as high as ten levels, and when force was exerted, it was accompanied by some type of magic ability, adding to its power! If this fist landed, half of Su’s body would be blown to pieces. \\n\\n However, Su still showed no signs of evading, directly pouncing towards the young man. The right hand that held a pistol raised upwards, the target the young man’s left eye! The young man’s face became pale white, backing up in alarm, yet almost falling onto the ground. \\n\\n This young man named Machard whose body possessed incomparable power, able to guide the birth of a great knight didn’t even possess the basics of combat techniques! Moreover, his intelligence was still that of a youth’s, immediately sinking into inescapable fear upon seeing the dark black muzzle aimed at his eye. His movements freed up, completely forgetting that he possessed great power. Apart from enlightenment, he didn’t seem to know to use his own energy at all. \\n\\n When he saw Su’s muzzle aim at the young man’s left eye, the elder’s face finally changed, now overwhelmed with shock! He didn’t understand why Su was able to find the young man’s only weak point. In a moment of desperation, he forcefully retracted his half released fist, instead moving his body between Su and the young man to serve as a protective screen.\\n\\n Su’s left hand shot out like lightning, tapping the elder’s armor in a deemphasized manner. In that instant, Su felt as if he had touched a burning flame, his hand immediately producing smoke from being burnt, the heat even more so rushing along his arm into his body, causing quite a bit of Su’s blood to vaporize. Just the energy recoil alone inflicted a serious injury on Su. However, the elder wasn’t much better off, his face suddenly surging with bright-colored blood, and two streaks of blood even more so shooting out from his ears. With a hoarse throat, he roared towards the young man who was still staring blankly in place, “Hurry and run! Run to the place of rest!”\\n\\n “No! I want to go down with you!” The young man shouted out loud. He was leaning against the corner, a secret door already opened by his side, revealing a flight of stairs that led underground. However, he wasn’t willing to leave no matter what. \\n\\n “Hurry and leave! Your distinguished self is the only Light-bringing Knight! I will kill the intruder!” The elder’s expression and voice stern. \\n\\n The young man’s body trembled, clenched his teeth, and then finally rushed into the secret passage after releasing a loud cry, quickly disappearing into the darkness below. The secret passage didn’t close behind the young man, left open just like that, deep, quiet, and bottomless, unknown as to where it leads to. \\n\\n At this time, Su had already tangled around the old man, a crazy energy vortex immediately filling this place. This was a storm that could warp steel, yet it couldn’t damage a single item in this prayer room. Every single item in this prayer room that wasn’t decorated all that impressively was supplemented with tremendous amounts of holy energy, easily counteracting the energy attacks. \\n\\n The battle already exceeded any battle Su experienced in the past. In this narrow space, energy scattered endlessly, becoming more and more concentrated. Every move these two made brought about a powerful energy storm, every collision triggering a small-scale energy explosion. \\n\\n The elder’s power and abilities were far above Su’s, but the longer they fought, the more frightened he became. He discovered that nearly every single attack, every single defense, and even the energy flow within his body was controlled by the other side. Su was like the rocky cliff in a crazy storm, clearly ready to explode at any time, yet still towering majestically without moving. In addition, the retaliation was incomparably sharp, able to hit the old man’s vitals again and again, firmly and ruthlessly striping away the elder’s advantage bit by bit. The elder had experienced hundreds of battles, but in front of Su, he was like a hatchling that had just stepped foot onto the battlefield. \\n\\n “I will kill you!” The elder gathered the last of his power and said in an awe-inspiring manner. \\n\\n “That is also what I wish to say.” Su replied indifferently.\\n\\n A vicious battle!\\n\\n The final energy explosion scattered. Su’s body was soaked in blood, every single injury spraying out burning hot bloody mist. He walked towards the underground secret passage. Behind him, the elder stood straight like a javelin, the corners of his mouth twitching, finally swallowing down the blood that surged to his lips. \\n\\n As he looked at Su’s rear view, the elder said, “You don’t belong to the darkness.”\\n\\n “Yes, that’s right.”\\n\\n “You… cannot kill Machard! The Light-bringing Knight is all of our hope! Without new great knights, this place… all five hundred thousand people living here will fall into darkness, unknown as to when they will die, or if they will even live to see tomorrow. The sleeping Holy Mother and… Light-bringing Knight, is all of their hope, the hope… to continue… living…” The elder’s voice quickly became hoarse, unable to finish the last part of what he wanted to say. \\n\\n This time, Su finally stopped, but he didn’t turn around. He remained silent for a moment, and then said, “Between a single person and five hundred thousand, I am unable to weigh which is heavier.”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-22-5","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
