{"id":49315,"no":676,"title":"Book 5 Chapter 24.1","content":"Book 5 Chapter 24.1 - Hurt Madeline was woken up from the bitterness and pain in her mouth. She slowly opened her eyes, eyelids feeling heavier than ten tons, rising in an extremely unwilling manner. Her train of thought was still extremely slow, body also weak and powerless, every part filled with a somewhat numb sensation. Even though it was currently fading, it made her more sluggish than even a normal person. The moment she opened her eyes, what occupied her view was a creature that wasn’t that large and was extremely ugly. It looked just like piece of skinless flesh, the surface covered in fine web-like blood vessels, all of these vessels squirming about. There was also a layer of interweaving red and yellow mucus covering its surface, seemingly a mixture of blood and tissues. The mucus was extremely viscous, tightly sticking to its surface, forming a layer of protection. This mucus looked like a life form with its own consciousness, continuously squirming about, from time to time producing small protrusions. At a sharp end opened a single eye, observing the world around it. Six long jointed limbs extended from both sides of its body, tightly wrapped around Madeline’s body, some of the sharp ends piercing into her skin. The jointed limbs each had a small hole, injecting some type of fluid into her body. It didn’t have sensory organs, the two jointed limbs in front of its body flat like shovels. Right now, it was using these two forelimbs to pry open Madeline’s mouth, and then an elephant trunk-like mouthpart inserted itself deeply into Madeline’s mouth, continuously releasing some type of fluid inside. The bitter taste Madeline felt was precisely caused by this fluid. From the fluid’s weight, it seemed like this little creature was releasing everything its small body could release. The moment Madeline woke up, the little creature had just finished spitting out a small lump of flesh from its mouth. The flesh piece quickly moved with the fluid, following Madeline’s throat down. The fluid was quite special, the mucus membranes in Madeline’s bodies all subsequently softening, becoming a half liquid state wherever this fluid passed, absorbing it. Meanwhile, that small piece of flesh also gradually entered Madeline’s body. What was strange was that even though it was absorbed by her body, the flesh piece was still completely preserved. Madeline suddenly began to choke, instinctively sitting up, hands holding her chests as she coughed violently. However, no matter how intense the coughing was, she still couldn’t cough out the slightest bit of this fluid that filled her mouth and throat. The fluid seemed to have its own will and life, continuously moving into Madeline’s body, moreover quickly permeating into her body’s tissues. Her sudden movement flung the small creature that was originally clinging to her face, causing it to fly out. Only, six fine and smooth cuts remained on her face and neck. When it was swung out, its jointed limbs moved, as a result leaving behind a three centimeter long scratch on Madeline’s ivory-like cheek. A fine red line appeared on that soft and spotlessly white skin, and blood slowly trickled out from one end. Madeline’s train of thought was currently speeding up, but it was still much slower than normal. She understood that she had been poisoned, moreover an extremely formidable creature’s poison, to the extent where her constitution couldn’t resist it. However, the poison’s effects were only to keep her asleep, moreover naturally fading after a set amount of time. At this moment, Madeline could feel several dozen streaks of icy strands quickly spreading within her, the target the nucleus in her thoracic cavity. These icy strands were precisely what that little creature injected into her body. She could clearly feel this fluid breaking into two different substances, but their common trait was that they were equipped with great mobility, and they both had their independent will. What was strange was that the small piece of flesh also quickly moved about in Madeline’s body, around it a small formless force field. All tissues within the range of this force field would dissolve into a half liquid state, allowing it to quickly move about. Meanwhile, after freeing themselves from the force field, the half liquefied body tissues would recover their original forms, some parts of the tissues even undergoing fine tuning, bringing a small degree of optimization. The tissues that the flesh piece had passed through and changed were already extremely perfect. After Madeline’s body underwent the third complete transformation, her body was already hardly any different from the perfect body. Only, with Madeline’s domineering nature, how could she allow this small flesh piece to control her body? The icy strands quickly converged on the nucleus, and then they entered one after another. They continuously released matter that she didn’t recognize, repairing the gaps hidden in the nucleus’ depths. Meanwhile, the flesh piece also reached the nucleus’ surface, yet didn’t continue advancing, nor did the nucleus dissolve under its force field. The flesh piece stuck to the nucleus, releasing several flesh wisps from within, inserting them into the nucleus and linking the two together. The flesh piece carried an aura Madeline was extremely familiar with. The moment it entered her body, she instinctively knew that this was a leftover fragment of the Heart of Darkness, or to be more precise, the core part of the Heart of Darkness. Meanwhile, those several dozen icy strands came from some unknown existence, the effects miraculous, unexpectedly able to repair the defects in her nucleus! The icy strands, Heart of Darkness, nucleus, the three of them were entirely different, yet they had a mysterious connection. The secrets they possessed long exceeded the realm of what genetics could explain, and even from a sensory perspective, those icy strands should have also come from an existence similar to the Heart of Darkness. However, Madeline didn\u0027t pay too much attention to the violent changes that were taking place in her body, her azure eyes only staring blankly at the little creature she flung onto the ground. The ugly and terrifying little creature was laying weakly on the ground, its body dried-up and shriveled like an emptied water sack. Its six jointed limbs and two forelimbs all lost power, laying around it in a disarrayed manner. Its vitality was quickly disappearing, its body’s tissues also gradually liquefying, many parts already becoming a pool of viscous liquid. With a light pa sound, a jointed limb came off from its body, landing on another jointed limb’s hard shell. Just this bit of insignificant power made the jointed limb that it knocked into separate from its body. A white-colored viscous matter continuously seeped out from the areas where the jointed limbs were attached to the body, the originally sturdy shell matter also gradually softening and dissolving. As if sensing Madeline’s gaze, the little creature struggled to raise its elephant trunk like mouthpart, gently brandishing it about, and then completely went limp, starting to melt... Pa! Another almost inaudible light sound could be heard. This time, it was the final sound released by the shattering of a scorching hot crystal droplet. Madeline forcefully wiped at her eyes, stopping the other teardrop that was still was making its way out. However, her throat choked with even more emotion, as if she was trying to release some type of sound. She covered her own mouth almost subconsciously, moreover with great force, all the way until the jointed limbs all became a deathly white. She staggered out from the bed, throwing herself onto the ground, staring at the already completely dissolved little creature, desperately holding her breath! However, her field of view suddenly became blurry, rolling hot tears sliding down from the back of her hand, and then landing on the ground. Madeline’s knees fell onto the ground with a muffled sound, her left hand pushed against the ground, yet was unable to support her staggering body. Her right hand was still rigidly covering her mouth, not willing to let go no matter what. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-5-chapter-24-1","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
