{"id":49346,"no":707,"title":"Book 6 Chapter 4.5","content":"Book 6 Chapter 4.5 - Consciousness\n Only when the chairman’s vehicle fleet disappeared into the horizon did Martin straighten his body, slowly turn around, and look towards the research institute’s grand building complex. His gaze seemed to pierce through the heavy walls and land on Dr. Connor’s body. Connor who was previously absent-minded suddenly felt his entire body tremble, as if he was being stared at by an invisible viper. His eyes widened, looking all around him, yet was only able to see the hurriedly moving researchers, as well as the janitors who cleaned up the corpse. From time to time, strange looks would be cast over, landing momentarily on his body before hurriedly shifting away. \n Connor was still suspended ten meters in the air. Even though Haydn had already left, the Void Prison’s effects still remained, unknown as to when exactly it would disappear.\n A moment later, Martin appeared in the presentation room. Right now, his face was so red from overexcitement it was like a tomato that was about to rot. He raised his head to look towards Connor who was floating in the sky, and then suddenly said, “What are you all staring around for? Do I have to tell you to bring some cushions?! Place them a bit thicker, if Dr. Connor ends up injuring himself from a fall, I’m going to chop open all of your brains! An assistant as good as this one, it’s hard to find a single one even after a few decades!”\n Not only did the workers move, even the researchers were yelled at to bring over cushions. Only when he saw that the cushion buffer below Connor reached two meters high did Martin reveal a satisfied smile. He raised his head to look at Connor, waiting rather patiently for the effects of ‘Void Prison’ to end. When he left, Haydn didn’t sit in the armored off-road vehicles following behind, but instead entered Bevulas’ car, sitting across from the chairman. Even though they were moving through areas without roads, this luxurious carriage was still extremely smooth, water not even spilling out from a glass. The new era’s technology was quite thoroughly displayed in this railway limousine.\n Bevulas finally lowered the information in his hands, removing the pince-nez spectacles and revealing a fatigued expression. He rubbed off his head while asking, “How is that Martin?”\n “Definitely a small person, selfish and holds grudges, without half a bit of refinement. His accomplishment should just be hard work together with a bit of luck. As for talent, he is definitely inferior to Connor. I don’t like him, he is a mad dog, right now frantically wagging its tail. When the time comes, he will definitely throw himself over and release a vicious bite. Connor is actually much better than him, at the very least his tastes not bad.” Haydn didn’t hide his own disgust.\n Bevulas laughed, and then said, “Connor is a lion, but after living a handsome lifestyle, he already lost most of his fighting spirit and creativity. Martin is indeed a mad dog, but sometimes, crazy nobodies can display tremendous power, so they cannot be looked down on either. Hard work, in most situations, can replace talent. As for Connor, if he could survive under Martin’s hands, then he might have some qualities that would be worth seeing in the future.”\n Bevulas gave Haydn a look, and then said, “You are indeed a rare genius in terms of talent, but there are all types of geniuses. No matter how powerful someone becomes, it will still be impossible for them to become geniuses in all aspects. That is why we need all types of people, regardless of whether they are ability users or not. Taking a step back, if there really was this type of person, an omniscient and omnipotent genius, above all others in every aspect, what would happen then? If you were that person, what kind of conclusion do you think there would be then?”\n Haydn closed his eyes, starting to carefully think. A drop of cold sweat began to slowly seep out from his forehead. His entire body trembled all over, his golden pupils frantically moving about under his eyelids, starting to release powerful radiance. Even with the eyelids blocking them, the light still shone through, releasing two small light beams.\n A moment later, Haydn’s entire body began to pour out sweat, his pale-white face revealing endless suffering. He suddenly released a great cry, abruptly opening his eyes! At this moment, his golden pupils were shining like two small suns, the golden light rays even releasing several thousand degrees of high temperature ability. Meanwhile, when his body bounced up from the seat, the golden gaze just happened to land on Bevulas’ body. When the destructive golden rays reached half a meter before Bevulas’ body, they suddenly disappeared into thin air. There seemed to be an invisible boundary in the air that separated the two sides, dividing different worlds. When the light rays reached the border, they would then shoot towards who knew where. \n Haydn dropped back onto the chair. In just a few short minutes, he became incredibly weak, the energy within his body not even a tenth of the norm, as if he had just experienced an extremely intense battle. He leaned into the chair, extremely dispirited and weak as he said, “I killed all those who dared resist me, and then ultimately ruled the entire world. Then, I continued to evolve. I was… this celestial body’s god! Then, what I discovered was that regardless of what it was, including ordinary people, mutated creatures, even high level ability users, they were all useless to me. I… and all living things in this world became different, I… I don’t know what happened in the end, I can’t recall it, but… I was the only one left! The entire world became quiet, and then a century later, or was it a millennium? I don’t know how much time passed, I wasn’t able to calculate the time. Everything became still… only after using all of my strength was I able to escape…”\n Haydn couldn’t continue further. His entire body fell weakly into the chair, only able to breathe in and out heavily, large amounts of white foam coming out from his mouth, within it a bit of bright-colored blood.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-4-5","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\n The left leads to hell, the right, also leads to hell.\n \"The human race, for the sake of their dreams, they would end up creating demons\"\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
