{"id":49399,"no":760,"title":"Book 6 Chapter 11.6","content":"Book 6 Chapter 11.6 - Patience\\n\\n While sleeping, Su began to create to new thought centers. The fifty thought centers he currently had weren’t enough to deal with complex situations, but after adding ten new thought centers, Su would be able to deal with everything easily. Su laid on his back, the remaining thought centers currently operating at full strength, formulating a new biological weapon plan. As the plan gradually became completed, the space between Su’s chest and abdomen swelled slightly. Densely packed blood vessels could be seen under his skin, currently squirming about, wrapping around a spherical flesh substance, unknown just what was being produced within.\\n\\n Apart from the very few creatures who had extremely low material requirements and could be created from breeding tanks, Su could also create some small biological weapons through his own body’s tissues, this method of production comparatively less restricted in terms of materials.\\n\\n The curtain of night quietly descended. Maca City was extremely peaceful tonight, all those who dared rebel already turned into corpses. The suzerains and assistants under Su definitely wouldn’t show any softness when dealing with enemies. Su accepted Kebile’s suggestion, to follow this place’s traditional way of doing things, completely wiping out all armed rebels, only taking those with at least three levels of abilities as captives. This would maximize the intimidation towards rebels, and at the same time restrict the battle to only ability users, as well as avoid the waste of resources and supervising manpower needed for too many captives. According to Sun Empire’s definition, only those with at least three levels of ability could be considered ability users.\\n\\n It was now time for dinner. Su woke up from his slumber, feeling his mind becoming sharper. The new thought centers could already be used, and after a few more days, they would reach their optimal efficiency. He got off the bed, put on an upper garment, covering the abnormality by his belly, and then walked towards the dining room.\\n\\n Su invited the elder to eat with him in tonight’s evening meal, as well as asked for intelligence regarding Sun Empire’s northern border suppression army for the first time.\\n\\n The elder was shocked at Su’s pace of doing things. Su let the garrison officer go, and then only asked about Sun Empire’s expeditionary force after two or three days. However, he carefully hid his own thoughts. From a certain perspective, perhaps Su truly didn’t care much about this expeditionary army. Murray was one of the empire’s few powerful individuals, yet he died under Su’s hands. Moreover, Su’s power didn’t seem to have declined, at the very least, the elder personally witnessed many inconceivable things from Su’s body.\\n\\n The empire’s territory was extensive. The closest strategic town from Maca City was Xilur City, which was more than three hundred kilometers out. Xilur City was considered a plateau region, so it wasn’t that easy to communicate or travel in between, only two ruined and decrepit roads connecting the two areas. One of Sun Empire’s three great temples towered in Xilur City, these shrines managed by red-robed archbishops. Above these temples was the Sun God Temple, located at the peak of Sacred Mountain near the imperial capital. This was the highest level of the religious system, the leader the Sun Pontiff. Even the ones who succeeded the position of great emperor needed to accept the Sun Pontiff’s blessing as their beliefs, and it was rumored that all formulations nine levels or higher were produced in Sun God Temple. As such, Sun God Temple occupied the supreme position in the empire.\\n\\n It was rumored that buried in the depths of Sacred Mountain were the Sun God’s blood vessels, just waiting for a suitable moment to resurrect and return into the sun. When the Sun God awakened, the clouds of radiation surrounding the entire celestial body would thus disappear.\\n\\n This was just a legend spread by the religion without any proof. Meanwhile, the Blood Parliament’s research had long proved that after another fifty years at most, the clouds of radiation would naturally dissipate. However, at that time, for humans who had already adapted to the present situation, this might be a new type of disaster. After all, the atmosphere’s composition had already been changed, the filtering and shielding it provided against the sun and other celestial bodies becoming weak, the various cosmic rays not even olden era humans completely understood would also bring new era humans considerable harm. When those clouds that were the source of radiation, yet also isolated the various cosmic rays disappeared, humans would have no choice but to evolve again to adapt to the new challenge.\\n\\n Xilur’s population exceeded a hundred thousand, most of them slaves, but free residents still approached ten thousand. Every single free resident in the empire were outstanding soldiers, which was to say, an elite, thousand member great army of ability users could be selected from among the ten thousand free residents! If there was a sufficiently powerful ability user leading them, then this type of army would be unstoppable. Even if all of the northern border’s ability users gathered together, they would still be easily crushed!\\n\\n Meanwhile, there was no lack of sufficiently powerful leaders either, for example, Xilur City’s Imperial Red Duke Kanos, Imperial Marshal Debayor, and even sending out the red-robed archbishop himself wasn’t completely impossible. Even though in all of history, this Sun God Temple’s red-robed archbishop had never fought against another, not even the Red Duke known for his domineeringness and oppressiveness was willing to disobey this archbishop’s will.\\n\\n Su stopped eating, asking for the these three enemies’ abilities in detail, the old man replying to the best of his knowledge. The Red Duke was a Combat Domain ability user, his abilities widely praised throughout the empire’s higher levels. The most powerful ability were the ninth level Transcending Offense Defense, as well a rare tenth level ability Triad Assault. Meanwhile, Debayor’s reputation came from his powerful magic abilities, this resourceful marshal had abilities similar to his own nature, his rare tenth level ability Energy Extraction not an ability that relied on direct attacks to defeat the enemy, but instead able to shut down many enemies at once, especially magic abilities users. This ability made Debayor a death god for all magic ability users below ten levels. As for the red-robed archbishop, there was no public information on him.\\n\\n After thinking for ten whole minutes, Su then continued to work at his food. He ate quickly, the several tons of food wiped out in a short amount of time. He then walked towards the breeding center.\\n\\n The Herkula were approaching completion.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-11-6","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
