{"id":49409,"no":770,"title":"Book 6 Chapter 13.3","content":"Book 6 Chapter 13.3 - War The moment the rectangular bone blade appeared, Danuo’s body suddenly went taut. He wanted to roar ‘careful’, but was already too late. That bone blade moved past like a vanishing light, in that instant already passing by the three patrolling soldiers’ necks. The patrolling soldiers were completely unaware, taking another step forward, and only then did the three heads suddenly become crooked, tumbling onto the ground. Blood sprayed out like fountains, frantically spurting out from the clean cuts. Danuo’s expression immediately changed. The enemy’s concealing and assassination methods were horrifyingly proficient. Even now, he only saw a faint outline in the darkness, completely unable to discern the other party’s appearance or clothing. Against assassins at this level, forget about three ordinary patrolling soldiers, even if it was Danuo himself, he might very well suffer a significant injury right from the first strike. However, why did this outstanding assassin decide to take out three negligible patrolling soldiers before Danuo’s face? This question immediately flashed past Danuo’s mind, and then a realization hacked through the haze like a streak of lightning. This assassin was only trying to divert his attention, the true target was Danuo himself! His instincts made Danuo move before his mind did. He quickly took a step forward to avoid the hidden dangers behind him. However, when he rushed out, Danuo heard a clear, light pu sound, as if a table knife was moving through smooth cheese. A slight stinging sensation was immediately transmitted from below his ribs. The pain was extremely slight, yet it left one in despair. Danuo saw from the corners of his eyes that a short rectangular blade was currently inserted below his ribs, the blade moving through his body cavity accurately between the gap between his ribs, the wide blade almost cleaving his liver in half. The blade itself wasn’t that long, but it was extremely wide, not suitable for assassination at all. However, it was precisely this blade that was inserted in Danuo’s body! The hand that gripped the blade wasn’t particularly remarkable, but it was steady and powerful. Danuo roared like a wounded beast, brandishing his elbows towards the darkness behind him. The power of his dying attack was definitely not ordinary! Pa pa sounds rang out. Two thick and solid palms reached out from the darkness, striking against Danuo’s arms, and then the palms clenched, tightly gripping down. Two new assassins appeared, their arms exposed, the thick and rough muscles were like steel wire, full of power. The dying attack of Danuo who had eight levels of power was actually forcefully stopped by these two. Danuo released a low roar, but as soon as he wanted to release a full power attack, a slight pain could be felt below his ribs. That blade actually withdrew, returning into the darkness. Following the wide blade’s withdrawal, power continuously flowed out from that injury. The two hands that gripped Danuo’s right hand clamped down like metal clamps, restricting his movements. Another stocky arm reached out from the darkness, grabbing Danuo’s left arm that had just been raised. Three legs reached out from the darkness, and with pa pa sounds, they continuously kicked at Danuo’s legs. The areas that were kicked were carefully chosen, if it wasn’t the weak joint areas, then it was where the muscles and tendons were joined, continuously crumbling the power that was being accumulated. The three assassins finally appeared. Their expressions were blank, bald heads glossy. Their movements didn’t match their stupid expressions at all, extremely agile and nimble. Their upper bodies were bare, but the wide scarlet trousers were extremely striking. “Red-robed warriors?!” When he saw the assassins’ true identities, Danuo became extremely shocked! Based on what he knew, as the Sun God Temple’s greatest sect defending warriors, Xilur City’s Sun God Temple only had twelve red-robed warriors. Yet now, there were three of them before him, no, four red robed warriors. The assassin who eliminated the three patrolling soldiers as bait was definitely another red-robed warrior! Four whole red-robed soldiers! Forget about ambush, even if it was a frontal assault, not a single individual on this hill would be able to run. At this moment the other hands of the three red-robed warriors who grabbed Danuo also appeared, every single individual’s hands gripping a thin and sharp curved dagger. The blade was light and sharp, and when the curved blade was brandished, it would still be full of power. Meanwhile, the handles polished from bull horns gave off a simple and wild feeling. These were short blades used specially by red-robed warriors, and as the three weapons rose and fell, several dozen cuts would be made in Danuo’s body every second! Danuo who was rather strong even among the suzerains under Su was like a small boat in a tempest, powerlessly rocking and swaying about. His life force was scattered and smashed, and then diced up into fine pieces. Finally, the three red-robed warriors stopped their attacks and also loosened their hands, letting Danuo fall onto the ground like a beaten sack. Danuo’s eyes were widened as he stared at the three red-robed warriors, his brain quickly becoming vacant. The red-robed warriors normally all had around eight levels of ability, but the abilities that were produced were carefully matched. Due to the year round training in close quarter combat and joint assault techniques, their true fighting strength was far greater than that of any ordinary eighth level ability users. Even if it was one on one, Danuo didn’t really have much chance of success, let alone an assassination carried out by three of them at the same time. Danuo immediately recalled the first cut he received, which was also the most deadly attack. The hand that gripped the blade, at this moment before death, was incomparably clear. That person’s strength was far above the red-robed warriors! This was the conclusion Danuo reached the moment before his death. “You all can forget about having it easy! My lord… will wipe all of you out…” Danuo thought fiercely. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-13-3","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
