{"id":49426,"no":787,"title":"Book 6 Chapter 15.5","content":"Book 6 Chapter 15.5 - In Full Bloom\\n\\n Su looked at the black clad male who was nailed to the tree, revealing a smile, as if extremely satisfied with his own work. Right now, he revealed more and more human emotions, to the extent where he displayed even more than when he was in the wilderness and in the dragonriders.\\n\\n Yelicie finally summoned the courage to walk over to Su’s side. She quietly asked, “Why is he shouting so loudly?”\\n\\n Powerful ability users could normally endure pain far greater than what normal people could tolerate, because they had more control over their body than others, at crucial moments even able to directly cut off their sensation of pain. They could even forcibly secrete large amounts of substances that could relieve pain and paralyze nerves. This was common knowledge, which was why the young lady was so alarmed when she saw how unbearable the pain was for the black clad male.\\n\\n “It is because his heart is currently rotting.” Su said with a smile. He then patted the young lady’s head before saying, “Against these types of creatures, as long as there is a suitable tree, when its tree trunk is carved into stakes and impaled into their heart, they can be completely killed. It is quite a simple method, something even ordinary people can do.”\\n\\n In Su’s green pupils, the male’s body composition was analyzed layer by layer, quickly reaching the genetic level. In his field of view, the male’s heart was already impaled by the wooden stake. It was as if this seemingly randomly created wooden stake possessed a type of magical power, the flesh that came into contact with it would quickly decay, turning into pools of liquid. Meanwhile, the male’s heart was currently frantically squirming, frantically growing with a great vitality that didn’t belong to humans, trying to restore the damaged areas. The wooden stake’s surface was already covered by large amounts of fine bubbles, the tissues that were touching the wooden stake seemingly boiling, continuously rotting. Meanwhile, the new tissues that were produced wouldn’t be able to hold on for more than a few minutes, quickly reaching a similar fate.\\n\\n This wasn’t only the case with his heart, the stakes impaled into the male’s arms and legs produced similar results. However, the exhaustion of life force of these four spots added together wasn’t even a tenth of his heart’s.\\n\\n The male’s eyes were still full of hatred, but now, there was already a bit more fear and pleading. The pain the wooden stakes inflicted exceeded the limits of his imagination, but his powerful vitality still preserved his mind, thus allowing him to experience every bit of the pain, moreover a suffering he couldn’t free himself from.\\n\\n Seven days, according to the speed of his vitality’s exhaustion, he could only hold on for seven days. After reaching this conclusion, the male developed an irresistible fear towards Su. He didn’t know just how much this individual knew about the Temple of Darkness, but it was definitely much greater than what he had thought. Otherwise, there was no way he would understand so much about their bodies.\\n\\n “Tell me your name.” Su asked,\\n\\n “I am…”\\n\\n Su immediately cut him off. “Forget it, you name is meaningless. Better off calling you mister twenty evolutionary points, a more fitting name, at least as far as I’m concerned.”\\n\\n “Twenty evolutionary points?” The male became stunned, and then he realized the meaning of this, his face thus becoming extremely unpleasant. It wasn’t that he felt that twenty evolutionary points were too few, but rather that it was too many. Just what kind of existence did one have to be to obtain twenty whole evolutionary points from a single kill?! The other meaning was that even if the other party could obtain twenty evolutionary points, then there was definitely no reason to let anyone else from the Temple of Darkness go, as those were simply moving evolutionary points treasuries! This was, unless Su had already reached a point where he didn’t need these evolutionary points anymore, but if this was true, then it was definitely the worst possible scenario.\\n\\n Su captured all of the male’s expressions in his eyes, and as such, he revealed a faint smile and said, “You are quite smart, it seems like you already figured out the entire meaning behind this name. What a pity, you are still going to die. However, if your luck is good enough, you might even see a few of your companions who also came from dark, damp, and filthy places in these next seven days. If that happens, it is best if you give them a word of advice, advise them not to leave this world in the same way as yourself. The conclusion of leaving this realm is quite bad, and right now, you are only experiencing one of the most relaxed methods. Remember my words, because I never joke around.”\\n\\n Su brought the elder and young lady away, only the male’s miserable screams occasionally resounding through the rainforest.\\n\\n Three days later, the young man who massacred everyone in the viceroy manor appeared here. After hearing the male’s words, he pulled out the wooden stake stabbed into his heart.\\n\\n “Thank you…” The male carried an expression of relief and happiness, and then his head slowly drooped, life force completely severed.\\n\\n The young man was no longer acting as arrogant, instead looking at the wooden stake in his hands, expression complicated.\\n\\n Meanwhile, on the other side of the rainforest, the thousand man troop already traveled quite far. After experiencing the tempering of several battles, the killing intent this army released was already unordinary, simply no vicious beasts daring to approach them. Meanwhile, those powerful snakes or lizards whose perception were a bit more sluggish, yet still quite powerful were already eliminated a step before they approached the army.\\n\\n There were no lack of powerful individuals in the army, for example, Kebile, who, after consolidating the eighth level Offense Defense Mastery, after continuous bloody battles, accumulated another new seventh level Combat Domain ability, his overall combat strength rising by more than half. However, right now, these dozen or so ability users who were at or close to eight levels of ability shivered inwardly, from time to time looking towards the dense rainforest at both sides as if there was some undefiable danger currently lurking within. Their instincts continuously released stabbing pain, reminding them that this was a danger that could completely wipe them out.\\n\\n Kebile already reported his own feeling towards Su, but Su only nodded his head, expressing that he was aware. Thus, not even a powerful ability user at the suzerain level dared question him further.\\n\\n Roughly a dozen or so kilometers from the troops’ two wings, wolf-like Herkula were currently silently moving, maintaining a similar pace as the army as they moved forward. They weren’t alone, but instead in packs. Even though it didn’t reach the level of covering the rainforest like a black sea, the fact that each individual pack had numbers in the hundreds really made one shiver with fear.\\n\\n Meanwhile, at a location even further away, large amounts of wasps were currently moving out from the forest. They didn’t fly, only crawling, every place they passed over becoming completely vacant. Not only were the grass, leaves, and tree bark chewed clean, even the creatures hidden more than ten meters underground were eaten. In three days of time, the fourth batch of Leigna were already born. Their tremendous numbers represented a similarly tremendous need for food, a single Leigna’s daily consumption equivalent to ten times its own body’s size, and all of it was completely exhausted, transformed into energy that could support its own movements. That was why it could secrete poison, had dual propulsion units, and could even carry out a burst assault, and its length of activity was as long as several dozen hours. They didn’t need rest, able to continuously fight until their lives ended.\\n\\n In Su’s consciousness, there was some type of reaction from every biological weapon within fifty kilometers. The Herkula were light specks, while the Leigna were light zones. Meanwhile, within the Panoramic View, Su could even directly issue these biological weapons orders. Of course, there was a limit to what his thought centers could process, currently at most only able to control seven hundred Herkula or seventy thousand miniature Leigna. Meanwhile, while fighting, there was obviously no way his thought centers could control all of the biological weapons, so the amount he could directly control was only around a fifth.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-15-5","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
