{"id":49435,"no":796,"title":"Book 6 Chapter 16.8","content":"Book 6 Chapter 16.8 - Battle Invitation Kanos’ face immediately fell, angrily shouting, “Nonsense!” Su’s completely unrestrained words touched his bottom line. The strength at which he brandished his arms and legs abruptly increased, no longer holding anything back. Both sides’ attacks became faster and faster, as well as heavier and heavier. The two individuals’ figures seemed to be winding around each other, only thunderous rumbling sounds continuously sounding, loud and resounding as they transmitted in all directions. “Still haven’t heard your name.” Kanos’ voice was calm. If it was just from his voice, one would be completely unaware that he was currently raining down a barrage of attacks. “Su.” “Good, Su, do you really wish to kill me?” “Why not? It is but sixty evolutionary points.” “Sixty!” Kanos’ face immediately became full of shock, his movements becoming sluggish, barely avoiding Su’s attack. However, Kanos who currently had a huge advantage over the other party didn’t care about such a small mistake, instead saying seriously, “If others killed me through a bitter struggle, they would obtain ten evolutionary points at most, yet you can obtain sixty?! I believe you aren’t lying, which means that you definitely have a mysterious ability similar to ‘Rich Resource’, moreover the efficiency even greater than Rich Resource! If you also have such shocking talent, that means your growth speed is several times or even ten times greater than the norm. I must apologize, as a member of the empire, I cannot leave behind an enemy like you for the empire. You can die now!” Before his words finished sounding, the Red Duke suddenly released an almost berserk roar! His attack speed suddenly increased, Triad Assault no longer restricted to his arms, but was also released from his shoulders, knees, elbows, all parts of his body! Meanwhile, Su’s speed correspondingly increased, explosive noises of the sound barrier being broken continuously sounded. Su continuously moved about while using Extreme Assault, as if this ability could be used endlessly. Meanwhile, when his speed was increased to this level, even an ordinary punch would possess terrifying destructive power. Even when Su was in a critical situation, he would actually still activate Extreme Assault, charging straight at the Red Duke, from this leaving Kanos no choice but to move out of the way. Under this type of situation, even if Kanos could kill Su, he would still receive a serious injury from Su’s dying attack that he would never be able to recover from. Meanwhile, a duke who lost his strength, in the empire’s eyes, was no different from a dead person. The two figures were completely interweaving about each other, impossible to distinguish one’s attacks from the other’s. Explosions, wind sounds, crushed rock moved together, turning the battlefield into a land of death. A battle of this intensity was something not even the red-robed warrior leader dared interfere with, and it was also precisely at this time that he understood why someone as powerful as the two black robes would die one after the other under Su’s hands, moreover dying without the slightest bit of dignity. Whirlwinds wreaked havoc above the pyramid. Suddenly, a rumbling sounded, the great pyramid that was over a hundred meters in height finally couldn’t endure the two experts’ boundless power, a corner loudly collapsing! Giant chunks of rock several square meters in size tumbled down the ruins, unstoppable as they fell into the living area, smashing open a wide path in the densely packed homes. Battles at this intensity wouldn’t last a long time. With a thunk sound, Su fell on his back, the Red Duke’s wide palm already pressed over the location where his heart was, his other hand clawing towards the power crystal in Su’s chest. Regardless of what kind of situation it was, as long as the energy crystal was dug out, it would deliver an injury that could never be recovered from. Kanos was similarly covered in injuries, but his gaze was still steady, his hands even more so steady like boulders. Meanwhile, Su’s surroundings were blood-soaked, his right hand and legs all completely twisted, losing all mobility, only the left hand he could still move decently releasing a fist strike at the duke’s chest. This fist’s strength was clearly not enough, and the landing point was even the duke’s right chest, so Kanos wasn’t concerned at all. With a cold laugh, he said, “Goodbye, Su!” After speaking, his right hand lowered, five fingers stabbing into Su’s chest, grabbing the energy crystal that was hot like burning steel. Only, Su’s left hand suddenly increased speed, accelerating to more than ten times its original speed! This abrupt fist that broke the sound barrier tore open the chest’s skin and ribs, smashing directly into his thoracic cavity! Kanos lowered his head to look at this injury, saying with disbelief, “You can actually… still use Extreme Assault like this! You really are a genius, unfortunately, you still won’t be able to live.” With a pu sound, Kanos’ left hand already tore into Su’s chest, deeply entering his thoracic cavity, gripping towards his heart. However, his hands didn’t grab anything; only now did Kanos discover that Su’s chest didn’t have a heart, or even any internal organs! In that moment of stupor, a powerful burning pain transmitted from his left hand, and it immediately became numb. Kanos’ expression changed greatly, hurriedly pulling back his left hand. However, his wrist seemed to be clamped down on by countless gears, only successfully removed after he tried several times. When he saw his own left hand again, horror appeared for the first time on Kanos’ face! Only bones remained on his left hand, all of the flesh and blood completely eroded, as if these were bone specimen that had undergone laboratory treatment. In addition, the hand bones were scorched black, as if they had been burned by a raging inferno. Kanos didn’t know that Su’s thoracic cavity was completely a digestive organ, moreover digesting food through a combustion method. That was why when he inserted his hand inside, it was the same as reaching into Su’s stomach, immediately burned by the high temperature until only the bones remained. During Kanos’ moment of horror, pain was transmitted once again from his chest. Su’s left hand actually made a turn from his forearm, extending out like a mollusk’s tentacle, and then even grabbing the duke’s heart. Then, the five fingers closed, ruthlessly crushing this heart that was currently beating powerfully. Kanos had always thought of Su as human, moreover fighting him with the method he would when fighting against one, never expecting to encounter this type of final moments. Meanwhile, Su had fought with the style of the human mechanism this entire time as well, thus giving the Red Duke a misconception. However, if he had a choice, Su would rather not have the battle end like this, but it was even harder for him to accept a conclusion of defeat or death. Su stood up, and then Kanos forever collapsed. As the epilogue of this battle, Su obtained sixty one evolutionary points, slightly different from what he had predicted. The error was due to an insufficiency in the number of thought centers. Su gave Kanos whose eyes were still widened a look, and then quietly said ‘sorry’, and then the expression on his face gradually faded, the frantically burning passion and fervor thus returned to a calmness and coldness. Within the depths of his heart, there was already an expanse of death-like bleakness. In Su’s consciousness, a row of digits continuously jumped about, and then it finally stopped. A voice sounded in the innermost depths of his consciousness. Instincts assimilation progress: 10% Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-16-8","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
