{"id":49478,"no":839,"title":"Book 6 Chapter 20.10","content":"Book 6 Chapter 20.10 - Foresight\\n\\n Rumbling engine sounds could be heard one after the next, a few more helicopters appearing above the meteorite crater site.\\n\\n Inside the cockpit of the first helicopter that arrived, an officer was currently holding a communications device, contacting those who came afterwards. “... there are some small problems, a few outdoor enthusiasts already discovered the meteorite site, and also took a few pictures… no, only half of a picture was uploaded, Little Blackhawk already interfered with this entire region’s local electrical signals… yes, that’s right, understood! Repeating your order, it is to eliminate all unexpected targets!”\\n\\n After lowering the communications device, the officer reached out his head from cockpit, and then made a few gestures towards the special soldiers in the cabin behind him. An extremely valiant looking soldier nodded, indicating that he understood. Then, he lightly tapped the few soldiers in the cabin, pointed below with his hands, divided up the targets, and then forcefully clenched his fist!\\n\\n The heavy machine gun and several automatic rifles immediately released tongues of flame, the roaring gunshots were a bit different than those from standard military equipment, but their power and precision were far greater. A hail of bullets poured down, tearing apart their weak and frail bodies, blood immediately flowing towards the heart of the meteoric crater!\\n\\n Several fast drop ropes fell from the helicopter, more than ten special soldiers sliding down extremely nimbly, a few of them even having special equipment. There was an officer that dropped with the first batch of people, and as soon as his legs touched the ground, he immediately commanded the special soldiers to drag away the adventurers’ corpses and load the crystallized rock fragments dyed with blood into special chests. As more soldiers dropped down, a cordon was established around the entire meteorite site. Soldiers began to cut down trees, clearing out a vacant land. Soon afterwards, a large scale transport helicopter landed in this temporary landing zone.\\n\\n Behind the special forces appeared large amounts of soldiers with anti-radiation and biochemical equipment, as well as even more scientists. They carefully approached the damaged metal vessel, starting up all types of detection and experiments.\\n\\n Large portions of the forest were cut down, giant transport helicopters flying over and then leaving, leaving behind large amounts of equipment. Soon afterwards, just the technical staff working around the giant crash site exceeded a hundred, these individuals like hard-working ants around a giant beast’s corpse. Strange looking pieces of equipment were removed from the metal vessel one after another, some of these technical staff removing a small piece of metal from the outer wall, just that this process was extremely difficult.\\n\\n Time quickly passed. The metal vessel was brought away by several transport helicopters, the meteorite crater also having ten meters dug into it, all of the meteorites and soil that were scooped out carefully stored in special metal chests and brought away.\\n\\n At this time, the scene changed, shifting to construction sites for different bases. The construction projects were extremely grand, every single base built inside of a mountain or several dozen meters underground, their walls also undergoing special reinforcements, making these buildings whose expenditures were already ridiculously high directly increase a few more folds. However, from the construction sites’ mountain of materials, one could see that all of the bases definitely didn’t lack funding, to the extent where it looked like all of the materials had been bought ahead of time. From the Black Dragonriders, Su systematically learned about the olden era’s politics, economics, and sociology, fully understanding how complex and difficult of a task it was to complete a project on this grand of a scale in the federation’s era. Meanwhile, from the various base scenes, Su saw at least two that he was familiar with, the first the northern base, the other Frozen Throne.\\n\\n The scene quickly changed to a base that already had its main part completed. The enormous metal vessel was placed in a hall, more than ten layers of adjustable platforms built in its surroundings, the researchers able to walk to the areas they wanted to go to through these platforms.\\n\\n Dr. Rochester’s voice sounded at this time. “This, is the spaceship that brought ‘one’ to earth.”\\n\\n When the spaceship from outer space crashed, the olden era federation immediately treated this matter with the country’s greatest level of secrecy. Meanwhile, researching the foreign spacecraft’s corresponding technology also became the highest priority among all of the federation’s projects, the budget of hundreds of billions flowed into these projects through various channels, the best talents secretly transferred.\\n\\n From the initial analysis of the spacecraft, they learned that this spaceship didn’t seem to have too many advanced systems. Apart from the materials used to make the spaceship itself, the researchers weren’t able to find any life preservation, weapons, or any other advanced systems. High efficiency lasers, pulse weapons, small scale fusion energy supply equipment, magnetic weapon, space systems, interstellar leap systems, interplanar navigation, deep-freeze life preservation and others were things that only existed in fiction, and now, they still only existed in fiction books. Forget about not being able to find any technology more advanced than these fantasy systems, there wasn’t even anything at an introductory level! This spaceship that came from outer space was shockingly simple and crude, apart from the wall dividing the outer shell and the inner cabin, there was pretty much no other significant design to it. In other words, this was completely just a box. As for science and technology, only the superalloy that formed this spacecraft could be considered something they gained from a more advanced era. From the entire spaceship, the preliminary analysis already detected more than a hundred different materials, the deciphering of any one of these able to bring significant advancements to materials science.\\n\\n The inside of the spaceship was packed with liquid biological solvent similar to culture fluid, but it also seemed to be a part of some type of biological body. Most of the biological solvent had already lost its activity, only a small amount seemingly still maintaining a bit of vital force. Perhaps this biological solvent was what was truly valuable. Because of this, Dr. Rochester, who was the authoritative scholar on a few biology and genetic fields, was half coerced into leaving his college lecturing position into this project. From then on, his life, and even the trajectory of mankind, changed forever.\\n\\n However, at that time, no one realized this point. Many years later, when Rochester himself became a great Mysterious Fields master, he then understood that if it wasn’t him back then that did all of this, there would still be someone else to propel history towards a similar fate.\\n\\n Fate couldn’t be changed, because the power that propelled fate was too great. \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-20-10","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
