{"id":49497,"no":858,"title":"Book 6 Chapter 22.5","content":"Book 6 Chapter 22.5 - Inescapable Silence Westwood reached out a foot. The ground began to vibrate again. Su’s incoming body became sluggish, the force fields he ran into visible with the naked eye. All of the muscles covering Su’s body swelled, and then with an angry roar, he abruptly exerted force, using his body’s power to directly shatter all of the force fields, instantly charging up before Westwood’s face. Westwood immediately understood Su’s intentions, raging flames finally surging in his eyes. Ever since Blood Colored Dusk, when had he ever been challenged head-on by someone like this before? His surging anger already couldn’t be suppressed. He threw Snow who was now only a hindrance into the distance. His body leaned down, arms covering his chest, and then released a low roar like a vicious beast, body suddenly swelling a size, the muscles in front of his chest even more so bursting! Westwood walked forward with large steps, unexpectedly running straight at Su head-on! The intense collision was in no way artificial, the sound of muscles smashing into each other rumbling like metal, within it sounds of bones fracturing and blood flying in all directions! Su was directly flung backwards, while Westwood took steps backwards while staggering, almost falling. The individuals’ faces were covered in blood, the bridge of their nose even more so completely broken. With the two individuals’ bodies’ rigidity, both of their injuries were not light. One could see just how intense that instant of collision at full speed was. However, both sides were just this unyielding! Only by being unyielding could they vent out their anger! Su fell onto the ground, the tremendous power making his body continuously slide backwards, drawing out a deep groove in the ground. Ka ka sounds rang out, several bone blades reaching out from his back, inserting themselves into the earth, and only through this did he stop his momentum. Su bounced up from the ground, but when his feet stepped on the ground, they buckled, almost falling onto the ground. When he saw this scene, only then did the mountainous Westwood who looked completely unaffected reveal a faint smile, a strand of blood flowing out from the corners of his lips. He walked towards Su again, every step still making the ground vibrate. Powerful force fields smashed down on Su again and again like steel hammers and giant hatchets! Su didn’t dodge them at all, facing Westwood head-on, brandishing his fists to smash apart all of the force fields, all the way until the two faced each other once more! The battle that followed was already a pure competition of physical strength and energy intensity. Each strike from either side carried several dozen tons of tremendous energy, while the clash of chaotic energy streams was even more so above this. Attack, attack, and even more attacks! Defense and evasion were already no longer options, only attacks able to deliver serious damage to the other party, using the simplest and most crude method to vent the anger surging within them! The battle only continued for a few seconds, yet everything within a range of several hundred meters around the battlefield already became ruins, almost every object slightly larger directly crushed and destroyed by the berserk energy. Snow who had now readjusted itself threw itself towards Helen, biting down on her back collar, finally managing to bring her to a safe area before the energy storm arrived. Meanwhile, when the battle had just reached its climax, it also reached its end. Westwood suddenly took a step back from the fierce close combat. Su was about to pursue and attack again, but his expression changed, similarly taking a step back. Westwood’s rage had already disappeared, in his eyes only killing intent. He said coldly, “You are quite something, actually successfully angering me, making me fight your way of battle! However, it will all stop here!” The elder’s body suddenly became indistinct. This was not the illusion produced by moving at high speed, but rather directly disappearing from space! Su’s right eye suddenly released a radiance that couldn’t be looked straight at. He suddenly took a step forward, his right hand grabbing towards the empty air in front of him. As soon as this hand reached out, his entire arm already disappeared into the void! The void suddenly distorted, a crack tore open in space. Westwood fell out from within, everything below his waist unexpectedly completely disappearing, the broken surface as smooth as a mirror, more smooth than a cut made by the sharpest blade! Su’s right arm disappeared at the base, the cut similarly clean. An indistinct void figure appeared in the void, and it was as if one could see a hand currently grabbing an ankle. The scene disappeared soon afterwards, space also returning to normal. Westwood who only had his upper body left was full of shock. He couldn’t help but ask, “My body was moving through spatial faults! How were you able to discover me, moreover attack me?” Su smiled, but his eyes were definitely not smiling. “Eleventh level Perception Domain ability, Multivariate Calculation. With this ability, finding you was extremely easy.” As long as Westwood’s movements were interfered with, it was already enough. As for everything else, the spatial energy storms would fill in. No matter how powerful Westwood’s body was, he couldn’t endure the cut of space itself. There was no ferocity or anger visible in Westwood’s eyes, instead only fear and respect. He slowly said, “Turns out to be like this. With an eleventh level ability, it is equivalent to having power of deities, you indeed have the qualifications to fight against me. Su, properly cherish this moment. Next time, there is no way you will be able to win through cleverness.” After speaking, the elder’s body became indistinct once more, completely disappearing. Su stood there quietly without moving, in fact, he already no longer had the strength to pursue him. His green eyes swept over the battlefield. He first walked over to the dying Haydn, and then placed his foot on his head, and after exerting a bit of force, a genius that exceeded Persephone and O’Brien in the Blood Parliament thus died. Only then did he turn around and walk towards Persephone. Persephone propped up her chin with her hand, leaning against the bar counter, already deep asleep. The intense and vicious battle didn’t disturb her at all. It was to the extent where even after Su gave her a light kiss on the forehead, she still didn’t wake up. Su stooped down, carefully removing the barrel of gasoline from below her feet. Then, after sprinting a few steps, his left arm exerted force, dumping the gasoline barrel far into the distance, as if he was getting rid of bad luck. The gasoline barrel turned in the air, scattering out large amounts of gasoline that was as brilliant as a curtain of beads. Light flashed past Su’s eyes, and then the gasoline in the air was suddenly ignited, producing a gorgeous ribbon in the night sky. The fiery light continued for a long time. Su removed the Magnum, using his single arm to carry Persephone. However, this fella who was fast asleep still didn’t wake up. Perhaps due to a feeling of safety and warmth, she instead slept even better. However, even while fast asleep, she still involuntarily embraced Su’s neck, found the most comfortable stance, and then buried herself into his shoulder. Perhaps because she felt like this was still not enough, she bit down on Su’s body, and only then did she continue sleeping. Where the pure white teeth landed was originally skin that was as hard as steel, but it immediately softened. Su buried his face in Persephone’s long gray hair, smelling the familiar warm and soft fragrance, and then gently rubbed against her face. The blood on his face accidentally touched her long hair, but Su didn’t dare wipe at it, only fearing that he would wake her up. This time, I shouldn’t have to leave you again, right? This was what Su thought. Raging flames continued to burn over the inhabited area. Su, with Persephone in his arm, slowly walked out under the raging flames’ illumination. The fair light illuminated the wilderness, also making Helen’s face flicker between light and dark. Snow withdrew by her feet, shivering all over, almost unable to move. From the moment it saw Su, the insuppressible fear immediately told it that this was its paternal body. Helen noticed how Snow was acting, and then with a light gesture, Snow immediately crawled up to her body, moreover curled up into her clothes. “Paternal body’s perception is extremely strong, he will definitely notice me. Am I going to die?” Snow whimpered. “With mama here, nothing will happen. He won’t notice you.” Helen said. “But…” Snow didn’t know what to say. It felt like it should believe Helen, but it was still scared. Helen said indifferently, “There is a shadow over his heart when facing me, he won’t dare look too much.” In the distance, Su’s eyes looked over, stopping temporarily over Helen’s face, slightly nodding in greeting, and then as expected, he turned towards a different direction. In his eyes, Helen’s temperament and expression had never changed, forever just this cold and machine-like. Su was correct, Helen indeed never changed, at the very least, her face was the exact same as the one Su had previously seen, without any difference. However, when the precision reached a certain extreme, it would also become a type of fear. Helen waved her hand towards Lafite and Curtis in the darkness, indicating ‘I am leaving’, and then walked into the darkness alone while carrying Snow. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-22-5","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
