{"id":49563,"no":924,"title":"Book 6 Chapter 29.8","content":"Book 6 Chapter 29.8 - Ordinary Persephone was still busying about in front of the kitchen counter, not giving the entrance a single look. However, just this rear figure alone was enough to make this robust male stand in place. In the several decades of his life, as one of the lowest nobodies of society, when had he ever seen such a beautiful figure? Meanwhile, Su, who was standing beside Persephone, was instead overlooked. “Hey! What did you see that made you stop moving? Hurry up and move out of the way, let this old one take a look as well!” Another tall and thin male covered in tattoos pushed the other person out of the way, and then walked inside the the garage. He immediately became stupefied, his throat gurgling a few times, and then with a gulp sound, he swallowed a large mouthful of saliva, saying blankly to himself, “What a fucking beauty!” When they heard this, the scattered soldiers immediately pushed and shoved, rushing into the modified garage. Their bodies were covered in blood and mud, immediately leaving behind a large amount of dirty footprints on the floor. When they saw Su, their brows all furrowed slightly. The garage had already been completely remodeled, and it had been repainted as well. In the corner was a bed, on the bedside cabinet a vase filled with newly picked daisies, making this place feel extremely comfortable and clean. This was the home Su and Persephone cleaned and organized together, the floor personally cleaned by Persephone. When he saw these scattered soldiers step on the results of Persephone’s hard work, Su couldn’t help but throw aside all of his original plans. He stood up and stopped in front of the scattered soldiers, cutting off the dozen or so pairs of eyes that were staring greedily at Persephone. Only then did the scattered soldiers notice Su’s existence, an uproar immediately erupting. “Who is this fella?” “Who knows? However, he really isn’t that bad looking!” “Right? If I didn’t look carefully, I would have thought that he was even a bit prettier than the chick on the side!” The one who was speaking didn’t hide the drooling expression on his face at all, his sexual orientation clear. They spoke one after the next, their voices getting louder and louder, the mysterious feeling of uneasiness at the bottom of their hearts thus also quietly disappearing. Noise and following the crowd have always been good methods of subduing fear, while the weapons in their hands couldn’t offer them even the lowest level of security. Amidst the noise, Persephone still patiently focused on frying the egg pancake, while Su stood at her side, quietly staring at these uninvited guests. Finally, someone sensed that the situation and atmosphere were a bit strange. However, the shotgun in his hands still gave him a very real sensation, and thus he read the script that he was already extremely familiar with. “What are you all still standing around all stupid for? Regardless of whether you all are male or female, take off all of your clothes and lay over there! If this old one is pleased enough, then I might just leave you with your lives!” Su suddenly laughed. However, he didn’t take off his clothes like how these ruffian soldiers ordered, properly preparing his bottom, instead walking towards them and saying, “You all finally gave me a reason.” Reason? What was the meaning of this? The scattered soldiers stared at him with shock. They still didn’t figure out what was going on, but they felt like something wasn’t quite right. However, Su didn’t give them the time to think. With a flash, his body already appeared in front of the sturdiest looking enemy, sending a fist viciously into his abdomen! This fist not only instantly blasted his abdominal muscles rotten, it also snapped his vertebra, producing a fist imprint on the robust male’s back. This fist already removed all of this robust male’s vitality, yet he wouldn’t immediately die. It was unknown just how many lives fell under these defeated troops’ hands, so killing them with a single strike wasn’t punishment, but a rare act of mercifulness. Su raised his left hand, stopping the robust male’s forehead that involuntarily leaned forward, not letting him touch his own face. One side was clean and beautiful, while the other was filthy and sinister, the two faces forming a stark contrast, as if they were worlds of polar opposites. With movements that looked like he was merely going for a walk, Su already made his way around this robust male, passing by two soldiers. Before they even realized what was happening, they heard large amounts of bone fracturing sounds, and then an unendurable intense pain was transmitted from every corner of their body, immediately making their wills collapse. Meanwhile, they lost control over their bodies at this very moment, falling weakly onto the ground. During this process, fragmented bone pieces continuously tore through their body tissues, bringing them even more suffering. In the blink of an eye, Su already made a trip around them. Then, he returned to his original location, quietly staring at them like a sculpture, his eyes only carrying indifference and icy coldness. A moment later, the garage door opened, Su walking out. He dragged two bodies that were still twitching and wriggling about, arriving at a garbage heap several hundred meters out, and then flung the corpses inside. He leisurely walked back to the garage, dragged out two more people, and after repeating this a few times, all of the ruffian soldiers were flung into the garbage heap. When Su returned inside the garage again, he didn’t come back out. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-29-8","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"--- Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle. Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right. The left leads to hell, the right, also leads to hell. \"The human race, for the sake of their dreams, they would end up creating demons\"","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
