{"id":49621,"no":982,"title":"Book 6 Chapter 35.6","content":"Book 6 Chapter 35.6 - Covered In Dust\\n\\n “Angelina, now that I think about it, it has been many years since I’ve last seen her. After all these years, I truly wonder what she has become in Dark Red Castle.” Morgan said to himself while adjusting his helmet.\\n\\n This armor was made with his measurements more than ten years ago, so now, it was already a bit too tight on his body, he had to take a breath, then tuck in his belly to put it on. Noticing this fact, the general couldn’t help but sigh towards the events of the past once more. In reality, it was just his belly that protruded slightly, when the general uniform was worn, it couldn’t be seen at all.\\n\\n After putting on everything, Josh Morgan pressed open the light screen by his hand again. There were only a few markings on the screen, after tapping them, several windows opened, clearly monitoring videos. One of them drew his attention, and as a result, it was enlarged to fill the screen. This was a comprehensive weapon factory, more than ten technical staff members currently bringing out equipment one after another, separately arming two men, equipping them like two gun turrets jammed with cannon barrels. These were the two people General Morgan was extremely familiar with, the silver Lafite and black steel-like Curtis. The equipment the technical staff brought out was clearly custom-made to the two individuals’ measurements, every part joined seamlessly, couldn’t fit any better. Only, the equipment style was a bit strange, the firepower truly a bit too fierce, the weapons and ammunition, if placed on a heavy tank, it still wouldn’t be a small amount. Now that it was all piled up on these two people’s bodies, it was a bit strange no matter how he looked at it.\\n\\n “Hurry up! Move faster! You all only have a minute of time, do you hear me, a minute!” Lafite roared out loudly, making the technical staff who were already drenched with sweat move a bit faster. Right now, it really was a race against time, the amount of time they had left before engaging the bug swarm’s front line already counted in minutes. If the equipment could be installed a minute earlier, then for powerful individuals like Lafite and Curtis, it would allow them to find a better battle position within several kilometers of space.\\n\\n In the intervals between the technical staff crazily busying about, Lafite still had time to say to Curtis, “Hey! Black Steel, say, you think these things’ll be of any use? Why do I feel like the two of us are about to become human-shaped forts?”\\n\\n “Helen never does anything useless!” Curtis’ single sentence immediately stopped Lafite’s potential follow up complaints. Lafite shrugged his shoulders, he actually only wanted to chat a bit, it wasn’t important what it was they talked about. If they remained silent the entire time, then the crushing pressure would really make one go crazy.\\n\\n The three minutes of equipping felt as long as three hours. After the last piece of high energy fuel cell entered the armor, everything finally came to an end. Before leaving the weapons factory, Lafite suddenly approached Curtis, with a sigh, saying, “Still never did Helen even once, this really is hard to accept!”\\n\\n Curtis shrugged his shoulders, the miniature guided missiles on his shoulder armor touching each other. The faces of the technical staff on the side immediately turned deathly pale, the captain also found that this movement of habit was now an extremely dangerous one, and as such, his large mouth cracked open, releasing a few laughs, trying to muddle his way through this situation. Lafite’s voice wasn’t quiet, not only did he speak it out loud for Curtis to hear, the technical staff here all heard it too, perhaps the old man hiding behind the surveillance camera was also included.\\n\\n “This brat really is still the same as before.” Morgan said to himself, but he didn’t get angry like before. Lafite’s intention was for these technical staff in the backlines whose chances of survival were a bit higher to pass on his words to Helen one day. Perhaps, the one who he originally wanted to pass these words onto was Morgan, just that this general who cared a lot about face naturally wouldn’t admit that his peeping was seen through by another.\\n\\n There was one more minute before the war began.\\n\\n Borrowing this last bit of time, Morgan hurriedly changed to another screen. Many of the scenes were of the inside of Persephone’s private hospital, to the extent where even a corner of Helen’s central laboratory could be seen. This was a secretly placed surveillance camera, one that already had more than ten years of history. They were all one time use type, the amount of electricity stored was only enough to support them for ten minutes. However, in all of these scenes, including the central laboratory where she should be in, there was no sign of Helen. It was as if she disappeared into thin air, making General Morgan tremble slightly from the bottom of his heart. He couldn’t help but feel a bit of worry, even though he knew that there was no way anything would happen to her. However, this was under normal circumstances, while now, the situation was dire. Within a scene that flashed past, there was a detail that drew General Morgan’s attention again. He immediately replayed that scene. The scene was a bit blurry, shot by the central laboratory’s camera lens, due to an emphasis on concealment, some sacrifices naturally had to be made on the image quality.\\n\\n Morgan zoomed in on the picture, and only then did he see that it was a piece of paper that had been placed on the laboratory counter. The direction of the paper was perfectly aimed at the lens, which was why even the poor resolution could clearly see its contents. This was a fountain pen sketch, yet the sketch was extremely lifelike, just a few strokes drawing out the image of a young girl. She was extremely sweet looking, had large eyes, long hair curly like waves. The little girl’s face was blank, lacking all expression, but her small hands that made a peace sign displayed a cuteness and charm matching her age.\\n\\n It was completely the appearance of Helen when she was five years old.\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/demon-hunter/book-6-chapter-35-6","bookId":1500,"book":{"id":1500,"title":"Demon Hunter","description":"---\\n Following the nuclear warfare, massacre extended towards the entire world. The order of mankind completely collapsed, and survival of the fittest became the ultimate principle.\\n Once natural desires were unchained, advancing forward no longer became an option. This world could only turn left or right.\\n The left leads to hell, the right, also leads to hell.\\n \"The human race, for the sake of their dreams, they would end up creating demons\"\\n","cover":"http://cunovel.com/img/DH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/demon-hunter","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:12 AM"}}
