{"id":64980,"no":3,"title":"Page 3","content":"I couldn’t keep the surprise from my face. “What? Which?” “Rosaline, I hear. The plain one.” She dismissed Rosaline with an impatient flick of her fingers; I did not. I’d met the girl that dark-drowned night months back. She was someone to be taken quite seriously. “If he’s fevered with love, his fever may well infect and sicken this entire house. I charge you to deliver him from this—you and the Ordelaffi boy, Mercutio. He’s sensible enough, and ever eager for a fight should it come to blades. One thing is certain: If there have been verses exchanged, you must get them back. It won’t do to have the heir of Montague made into a street joke.” She speared me with a significant, evil look. “I know of your nighttime ventures, boy, and I have allowed it because it suited me. Now you may run on my leash for a time. Get his letters from the girl. Quietly.” Somehow, I found I was not surprised Grandmother knew of my secret career as the Prince of Shadows. “And if I don’t wish to be leashed?” In the silence, I listened to logs sizzle and pop. The servants had all gone still and silent, their gazes fixed on me with avid interest. No one stood up to the old witch. I had no idea what had prompted me to, save the reference to my mother. “Then, Benvolio Montague,” she said quietly, “you may yet come to the attention of Prince Escalus’s men. I hear they urgently seek a certain sneak thief.” “You wouldn’t. It would humiliate our house, and my uncle.” She shrugged. “Perhaps your uncle could use bringing to heel as well. But only do this for me, boy, and I’ll keep your secret. Your cousin protected, your own reputation unsullied—surely you can stretch yourself to the task.” “Surely,” I said. She had me in a trap, and short of gnawing off my own limb I couldn’t hope for escape. She took that as agreement, for which I was thankful. “And remember, from now on, you will be responsible for Romeo and any lapses in judgment. It’s been agreed.” I did not want to be made responsible for Romeo’s misadventures. This week it was forbidden love for a cousin of our greatest enemies. The next fortnight might bring something wholly new and even more addled. I had no wish to be hovering at his shoulder like Grandmother’s notion of a guardian angel . . . but from the implacable look in her eyes, I had very little choice. Again. I hoped that somewhere in the sweating shadows of this room lurked powerful angels of my very own, because disappointing La Signora di Ferro was a very dangerous game, even for a Montague of the blood. I was not the most favored child of the house—Romeo held that honor, as principal heir. I was the older one, the sane one, the stable one. The one born of a doubtful foreign mother. The one to whom it fell to clear up Montague’s messes. Small wonder I took out my frustrations at night, in the dark, by stealing from those I hated. What other outlet could I have? My grandmother sat back now on her throne of broken doors, and gave me what she must have fancied would be a reassuring smile. It would have made a demon shudder. “Then that’s done, and I’ll hear of no more nonsense about your cousin. Now, tell me, child, what gossip bring you today? What’s the talk of the square?” My grandmother still lived for gossip, and we were all charged with providing it upon command. As a cousin, even a minor one, I had little to do but haunt the public spaces of Verona, seeing and being seen. Even though I had scant interest in market whispers, I could not help hearing them. “I’m told that the prince has a new mistress,” I said, and her eyes turned avid. “She’s said to be quite sophisticated. From Venezia, they say.” “Pah, Venezia! The moral cesspit of Italy,” she said, but I knew she enjoyed that tidbit. “A woman no better than a whore, and he dares parade her before decent women! Have you met the baggage?” I’d seen the fabled mistress at a distance; she had been carried through the streets in a sedan chair to mass, where no doubt she’d confessed all her sins and been forgiven. A pity that such forgiveness never extended beyond church walls. “No, Grandmother, I have not met her.” “Good! It isn’t healthy for a strapping young man to be introduced to whores at your age, before you’ve even settled on a wife. Speaking of that, has your useless mother seen no progress on making you a match?” My mother ignored insults aimed at her and shrugged them off, and I tried to as well, though on some very deep and quiet level I still felt the sting. I think La Signora thrust in the needle once more to see whether I would react. I had not in years. Outwardly. “She continues to review the candidates presented,” I said. She’d paraded several girls in front of me over the past few months, none of whom I wished to see again; the interesting ones, it seemed, were all tainted by virtue of being interesting. “I expect I’ll be married off and thoroughly bored within the year.” “Good, good. All men’s blood runs too hot, and the apostle said that it is better to marry than to burn.” Faith, I wished she wouldn’t talk of burning; the heat was killing me faster than a sword in the guts. When I bowed this time, sweat ran in a drip from my nose to the carpets underfoot. I half imagined I could hear the stone sizzling underneath as it soaked up the moisture. “I’m expected elsewhere, Grandmother. If I may have your leave?” “Off to carouse with your useless friends, are you? Go, then. Go keep an eye on your bibbling cousin before he does something dramatic concerning the Capulet wench. Do you think she’s stupid enough to respond to him? I’ve heard she’s odd.” I shrugged. “I hear she’s bound for the convent—overschooled. Belike she thinks it very flattering.” “Until her father beats the nonsense out of her,” said my grandmother. “Of course, if he finds the letters, he may well dispense with the beating and just wall her up in the cellars, the way old Pietro Capulet did her great-aunt Sophia.” It was a favorite bedtime story of hers . . . the gruesome horror of being bricked up in a lavishly appointed room, with only a pitcher of water and a dagger for company. Once the water had gone, Sophia most likely would have sought the dagger’s point for her final comfort, but as a boy I had imagined her wasting to skin and bones as she clawed at the ice-cold walls of her prison. The dreams still haunted me. I should not have cared if it happened to any Capulet; most of Montague would jeer and rejoice. But I remembered the brave, quiet girl Rosaline, bathed in candlelight, facing down the Prince of Shadows, and I found, to my shame, that I did care. My grandmother was waiting for some response, but I gave none. She finally flicked her fingers at me in weary contempt. “Go on, then. Be off with you.” “Yes, Grandmother.” I knew better than to ignore an invitation to flee, and so I did, bowing deeply on my way out. I escaped through the thick, ancient doors, which boomed shut behind me as servants muscled them into place. Freedom. I leaned against the stone wall to suck in the clean, cool air. I imagined I could see steam curling up from my sweat-soaked clothes, as if I’d escaped like Shadrach from the fire. “Hsst!” I looked in the direction of the low sound, and saw a shadow lurking near the conjunction of the walls. A stray bit of sunlight from a high, barred window picked out skirts too rich for a servant’s, and a gleam of a jewel on a headpiece. It seemed my fair younger sister wanted speech with me. The day wasn’t yet trying enough. “Honest women don’t hide in shadows, Veronica.” I let my head drop back hard against the stone. The ache of the impact temporarily drove away my sweaty discomfort, but not my sister . . . almost fifteen, vaguely pretty, and as deadly as a snake. “I’m hiding from her, of course. She wishes to instruct me on the nature of wifely duties.” Veronica grabbed me by the collar of my doublet and pulled me around the corner, into the shadows. She let go with a sound of disgust. “Ugh, are you poxed? You’re as sweaty as a laborer!” “Shall I go tell her that you need no instruction on wifely duties? I imagine you could write a philosopher’s pamphlet on the subject already.” “Pig!” She tried to slap me, but I caught her hand an inch from my face. “I won’t pretend you are pure as the Virgin if you won’t pretend to care. If you are set on avoiding Grandmother, why come here at all?” “Mother was concerned. She sent for you an hour ago, and bade me find you.” “As did Grandmother. Which would you obey first?” Ronnie snapped open a feather fan and batted it with great energy. “Did the old witch talk about me?” “Why would she? She’s made you a fine match. You’re no longer of interest.” “She’s marrying me off to an old man!” “A wealthy old man,” I said. “In ill health. You’ll be a fortune-heavy widow before twenty, with a long future of dalliance before you.” “Easy for you to say. You’ll not be the one he’ll paw in the marriage bed.” She eyed me over the fan with wicked intensity. “Or perhaps you’d prefer that, Ben. Given the company you keep—” I pushed her against the wall in a flash, and she hardly had time for a startled squawk before I sealed her mouth with my palm. I put my lips very close to her ear and said, “Before you run your clever tongue about my friends, remember the boy they hanged last winter. Claiming someone a sodomite is no joking matter, Ronnie. Say it again, and I’ll swear to teach you better manners.” She shoved me back with sudden, furious strength. There were spots of red high in her cheeks, and her eyes glittered, but she lowered her voice just the same. “It’s the same penalty for me if they hear you jesting about how expert I am in wifely duties! Or perhaps they’ll take pity on me and put me in a convent’s cell, where I shall never see the sun again. Or did you forget?” “No,” I said. “Neither should you.”","sourceLink":"https://allnovel.net/prince-of-shadows/page-3.html","bookId":2662,"book":{"id":2662,"title":"Prince of Shadows","description":"Storyline: In the Houses of Montague and Capulet, there is only one goal: power. The boys are born to fight and die for honor and—if they survive—marry for influence and money, not love. The girls are assets, to be spent wisely. Their wishes are of no import. Their fates are written on the day they are born. Benvolio Montague, cousin to Romeo, knows all this. He expects to die for his cousin, for his house, but a spark of rebellion still lives inside him. At night, he is the Prince of Shadows, the greatest thief in Verona—and he risks all as he steals from House Capulet. In doing so, he sets eyes on convent-bound Rosaline, and a terrible curse begins that will claim the lives of many in Verona… …And will rewrite all their fates, forever.","cover":"https://allnovel.net/images/prince-of-shadows.jpg","author":"Rachel Caine","type":"Historical","source":"allnovel","link":"https://allnovel.net/prince-of-shadows.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:40 AM"}}
