{"id":65010,"no":33,"title":"Page 33","content":"\\n\\n I sensed a barb under the honey, and was instantly wary. “Happily espoused. I see him little now. He has new responsibilities.”\\n\\n “Espoused,” she agreed. “But happily? It stretches the word’s meaning to say so.” She leaned closer, and dropped her voice to a low whisper. “I hear that he saw a witch. Perhaps to cure himself of his . . . appetites?”\\n\\n I shoved her away. “Peddle your gossip somewhere else,” I said. “Witches! What next, then? Furies and dragons? Will the old Roman gods come down from Olympus?”\\n\\n She shuddered and crossed herself. “I pray not. But you should not mock, brother. Witches exist; all the churchmen say it. It takes a dire cause to drive him to one.”\\n\\n “Then go be pious and pray for Mercutio’s immortal soul,” I said, and stood up. “Pray for mine, while you’re at it. I’m sure I have sins to be forgiven.”\\n\\n “Many,” she agreed with false sweetness, and snapped open a fan. “I should leave this dreadful sunshine. It won’t do to go to my wedding with spots!”\\n\\n I wished her a plague of them, as disfiguring as possible, but I said nothing, only stepped aside as she swept past me, heading indoors. Her servant followed with a handful of soiled kerchiefs she’d have to wash and iron and have ready for the next ill-tempered tempest, which might come any moment. She, at least, had my genuine sympathy.\\n\\n Two more days passed, each another twist of the strangling cord of tension that gripped our household; I kept within the precincts of the palazzo, and so did most of us. Veronica threw more fits, but I observed them only at a hearty distance. My grandmother demanded my attendance once, to interrogate me on Romeo’s behavior and express her pleasure at what had occurred at the Capulet feast; it seemed rumor had run riot in the streets that we had trespassed with impunity, and that one of the minor Capulet girls had been sent, in haste, from the city. Mercutio’s doing, but the old witch was eager to take the credit for Montague.\\n\\n As to Romeo, he seemed quiet. Subdued, in fact. I saw no more poesies from his pen lauding Rosaline’s beauty, at least, so perhaps the visit to the Capulet feast had yielded some positive result after all.\\n\\n By the end of that time, the tension and suppressed violence of the household drove me out into the dark once more. I crawled rooftops, dropped silent into bedchambers, and took away the adornments and prizes and secrets our enemies cherished. It was a busy few nights, seeking out Capulet allies and discovering their vices; some were expensive but not sinful, like the man who had an entire room filled with brocades and silks—not for his wife or daughters, apparently, since there were also finished (and never worn) doublets and cloaks made to his measure. I took the richest selection of fabrics and had them sent to my mother and aunt as a gift from a friendly merchant willing to conceal the silk’s origins in order to draw their business toward him.\\n\\n But there were far darker secrets, and less cheerful prizes. I found a heavy, locked chest in the home of a count, and instead of gems discovered inside the body of a young servant girl; this I left in place, as it was too unwieldy to move, but posted an accusing letter on the church door, along with the bloody silk banner in which she’d been wrapped. I doubted he would ever pay for the crime, but the girl’s pitiful, huddled end had deserved that much effort.\\n\\n On a moonless night, carefully chosen for cover, I crept into Capulet’s feasting hall, removed the banner, and stole the most doleful-seeming donkey I could find; it bore the indignity of being tarted up with the florid silk banner, and the all-too-drunken Capulet adherent I’d paid to ride it through the streets as a tribute. Unfortunately for the fool, he ran afoul of a nest of his own. It did not end well for him.\\n\\n I missed having Mercutio at my back. I was taking risks, I knew—ones that might destroy me. But it was as hard to stop stealing as others found it to give up drinking. Perhaps I’ll give it up for Lent, I thought as I crouched in the shadows atop a roof, watching the moon rise. It was only a quarter full, and was the color of rich cream. So many stars above, and as I stared upward, I spotted a vivid shooting star that burned as red as Lucifer’s horns. It was gone in a few seconds.\\n\\n I heard someone passing below on the street, and flattened myself; in the dark, I would be just another decorative corner to the roof, but the moon illuminated the passerby clearly. He was alone, and anonymous in a worn cloak too big for him, but when a stray gust of wind caught the edges and sent them flying, I spotted the familiar, deadly line of a rapier. No commoner, though he had left off his finery save for the sword.\\n\\n I was curious. The hour was very late, and I was very bored, waiting for my latest target to douse lights; I made a decision, lowered myself to the iron of a balcony, and then from there to the cobbles, where I quickly stepped to the shadows as he turned. I’d made no noise; this was a man on business just as illicit as mine, clearly.\\n\\n I followed him down the winding streets. He turned in the shadow of the cathedral, and from there we were in less friendly territory—for me, at any rate, since it was Capulet controlled, and patrolled by their men. I took to higher ground again—rooftops—and watched the brave (or foolish) wanderer. He had sense enough to hide when Capulet guards ambled by, arrogant and loud, spoiling for a fight; as soon as they’d sauntered on, he hurried around the corner.\\n\\n I dropped down to the street, following in the shadows, and was on the point of avoiding a man asleep in a doorway, cradling a wineskin, when my dark-adapted eyes picked out the familiar sigil of the Ordelaffi on the drunkard’s doublet, and the changeable, cloud-draped moonlight limned the sharp lines of his face.\\n\\n Mercutio. He was drunk and asleep—muddy and filthy in a doorway that, unless my nose had numbed itself, had been used as a privy more than once.\\n\\n My casual curiosity about the wayward traveler I’d been tracking vanished, and I glanced about to be sure no one was watching. I still held doubts about Mercutio—we’d avoided his company since the last ordeal of the Capulet feast—but for the love I had once borne him, I could not leave him lying dirty in the street, an object of mockery and a target for thieves and murderers.\\n\\n I tossed the wine aside, which woke a sleepy murmur from him, and pulled him up to a sitting position. He was as boneless as a corpse, if considerably more mobile, since he shoved at me with ineffective, drunken fury and then flopped back flat on the dirty cobbles.\\n\\n “I should leave you here, fool,” I said to him in a low, fierce voice, but in truth, my guts ached for him; this was no simple indulgence, coming here into enemy territory. He’d made himself a true foe of the Capulets at the feast by bringing us under his invitation, and for him to be lingering here, helpless . . . it smelled of a desperate desire to meet his God.\\n\\n I got him on his feet, with great effort, and held him there with his arm around my shoulders. We had stumbled on for several steps before he seemed to realize that he was upright, and several more before he said, tentatively, “Benvolio?”\\n\\n “Aye,” I said. “Hush, fool; know you not where we are?”\\n\\n “In the lion’s den, my Daniel,” Mercutio said, and laughed, raw with wine and a barely suppressed wildness. “Hear them roar? Raaaaaar!” He swiped at me with a claw-crooked hand, which I slapped aside. He giggled and nearly slipped to the ground again, but I bolstered him up. “Have you any shiny trinkets tonight? No? What good are you, then, for a thief?”\\n\\n “Quiet!” This, I realized, had been a mistake, however good-hearted my intentions. Whatever demon drove my friend to drink himself senseless within the easy grasp of his foes would also push him to betray us both. “For the love of God, man, even if you court your own death, don’t court mine!”\\n\\n He giggled again and shushed himself—noisily—as we stumbled along. If we ran into a Capulet watch, all would be lost; I was anonymously dressed, but Mercutio wore Ordelaffi colors. I stripped off my long cloak and threw it over his shoulders, shrouding the betraying crest.\\n\\n As we turned the corner, I spotted the single, stealthy traveler I’d started out to follow. He was staring up at a wall, and as I watched, he sprang up and began to climb it. I knew that clumsy scramble, especially when his hood fell back and moonlight exposed his face, angelic and determined beneath a riot of black curls.\\n\\n My cousin Romeo.\\n\\n I bit back the impulse to call to him, warn him; the wall, I well remembered, was trapped at the top, and he was ill prepared to deal with such things . . . but I had underestimated him, and as he scrambled up, he balanced carefully above the sharp points, and vaulted over with more grace than I’d have credited. Perhaps my cousin had learned something from me after all.\\n\\n “Romeo!” Mercutio suddenly brayed, and I almost dropped him in my surprise.\\n\\n “Hush, man; he’s leaped the orchard wall—”\\n\\n “Nay, he’s stolen off to bed, but whose bed?” Mercutio thumped me painfully in the chest with an outstretched finger. “I’ll conjure him, like that mad old witch—no, hush; we speak not of witches. . . . Romeo! Humors! Madman! Passion! Lover!”\\n\\n He was too loud, far too loud, and I shoved him onward, desperate to get him away. He dragged his heels, and would not quieten, rambling nonsense that I only half heard. “The ape is dead, and I must conjure him. . . . I conjure you by Rosaline’s bright eyes, by her high forehead and her scarlet lips, by her fine foot, straight leg, and quivering thigh, and the domains that there adjacent lie—”\\n\\n “Be still!” I whispered furiously, and shoved him to the wall hard enough to bang his head on stone. “For the love of God—”\\n\\n “That in your likeness you appear to us! Romeo!” Mercutio’s eyes were acid-bright, his face almost exalted with feverish intensity, as if he believed his childish nonsense was real spellcraft, as if he believed in witches and curses, devils and furies. “I conjure thee appear!”\\n\\n I had no choice, because I could hear the fast-approaching footsteps of Capulet guards. I hit him hard, twice, to daze him into silence broken only with incoherent moans. As the guards turned the corner, swords drawn, I drove a fist hard into Mercutio’s stomach, and he bent over and promptly vomited up most of the wine he’d downed, all over my boots. \\n\\n","sourceLink":"https://allnovel.net/prince-of-shadows/page-33.html","bookId":2662,"book":{"id":2662,"title":"Prince of Shadows","description":"Storyline: In the Houses of Montague and Capulet, there is only one goal: power. The boys are born to fight and die for honor and—if they survive—marry for influence and money, not love. The girls are assets, to be spent wisely. Their wishes are of no import. Their fates are written on the day they are born. \\n Benvolio Montague, cousin to Romeo, knows all this. He expects to die for his cousin, for his house, but a spark of rebellion still lives inside him. At night, he is the Prince of Shadows, the greatest thief in Verona—and he risks all as he steals from House Capulet. In doing so, he sets eyes on convent-bound Rosaline, and a terrible curse begins that will claim the lives of many in Verona… \\n …And will rewrite all their fates, forever.\\n","cover":"https://allnovel.net/images/prince-of-shadows.jpg","author":"Rachel Caine","type":"Historical","source":"allnovel","link":"https://allnovel.net/prince-of-shadows.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:40 AM"}}
