{"id":65030,"no":53,"title":"Page 53","content":"\\n\\n But the friar was not yet finished. He cleared his throat and said, “It may well be impetuous of me to speak so, but fair Rosaline has also bid me carry notes and arrange assignations, my clever young man. I would well beware that if there is a curse of love, it may seek to fall upon you.”\\n\\n I laughed aloud. I could not help it; the absurdity of it was too great. “I am no Romeo, to be pushed into the arms of a chance-met girl. . . .” But even as I said it, I thought that was exactly what I was. I had chanced into Rosaline’s rooms that first evening, when the Prince of Shadows sought his quiet revenge upon Tybalt . . . but no. What there was between me and Rosaline was no curse, and further, it had grown slowly, carefully, and even now, I knew that however it would pain me, I could walk from her, and pretend as if my heart had not turned to ash.\\n\\n Surely a curse would not allow me to walk away.\\n\\n Friar Lawrence bowed just a little, having well made his point, and said, “All will be well, young Montague. Only two days more will see the lovers reunited and safely away, and all’s well that ends well.”\\n\\n I felt a deep, terrible disquiet, but I bowed in return, taking a polite leave of him. I cared not about the witch; I knew she had told me all she could, and from the fright in her eyes, she would be off before the morning light. We would, I thought, be well rid of her.\\n\\n But if there was a curse, as Mercutio had believed . . . if there was, then there were two things I would need to find to end it: a rosary, and something in which he’d written his curse, in secret.\\n\\n I allowed myself to be speeded home for the gloomy evening, where my mother grieved quietly for her lost daughter, and my uncle for his lost dowry, and I . . . I only grieved, and paced, and slept fitfully until the morning.\\n\\n • • •\\n\\n All Verona woke to the lamentations of House Capulet, for Juliet was dead.\\n\\n The morbid details of it came as no shock, and mirrored what Friar Lawrence had predicted . . . the girl had been safely to bed in the night, and in the dawn her fat old nurse had discovered her stiff and cold in her bed, with a bottle of poison close by her side. It was difficult to learn more, since I was about my uncle’s business of the day, which meant making funeral rites for my sister in a suddenly crowded church calendar, as well as dispensing payments to all the necessary guards, bravos, and allies who faithfully served us. Mercutio had been quickly buried, without so much ceremony as might have been honorable; his widow left Verona that morning, sent back to her family with a significant portion of the Ordelaffi fortune packed in her bags.\\n\\n In the twilight of the evening, as the Capulets mimicked us and hastily changed their day’s preparations from wedding to funeral, I walked with the family’s procession down the narrow streets and out to where the Montague family tomb was kept, in the care of the monastery. As Veronica’s brother, I held pride of place at the front of the bier, shouldering a portion of the weight of her silk-wrapped body; I felt suffocated beneath the traditional black robe and mask that all those who bore her on their shoulders wore, while the men around us carried torches to light our way. Even the prince of Verona was masked and garbed, carrying one side of her slight weight, by which he showed his sorrow for the needless waste of her life.\\n\\n It was a political gesture, and one that my uncle would have celebrated, had the occasion not been as solemn.\\n\\n The women of Montague were not allowed to follow, not even at a distance; they stayed within the walls of the palazzo, and grieved in privacy. That, I thought, was a good thing, as well as custom, as we were wary of Capulet anger still.\\n\\n We settled my sister to rest upon her stone bed within the tomb. In a month or two, once the corruption of her body had finished, servants would enter and inter her bones beneath the carved stone lid of her sepulchre, where she would rest until called to the resurrection. Though the interior of the tomb was decorated with fine paintings, I tried to notice little of it; the oppressive sense of death here seemed suffocating, for all its gold leaf and gentle angels. Veronica had been wrapped close in grave windings of the finest silk, leaving only the square of her eyes, nose, and mouth exposed, and the flesh seen there was as pale as the grave clothes.\\n\\n “We all go to our God stripped of our vanities,” said the prince, standing at my shoulder and looking at Veronica with me. “Come, Benvolio; she is in the hands of angels now.”\\n\\n She seemed very small to me. Death had robbed her of the vigor and energy with which she had attacked her future, and however malicious that energy had been, I still missed its fire. There had been little enough love between us, but blood knows blood, even so.\\n\\n And hers was now, forever, cold.\\n\\n I crossed myself and left the tomb. Outside, I took in a deep, convulsive breath of the cooling night air, and stripped away the domino mask as if it burned me. The smell of the tomb—old, dusty death—clung to me in the folds of the robe, and I took it off as well, though custom said I should wear it hence. I began to hand it absently off to Balthasar, only to remember that I’d sent him to Mantua, with Romeo. I wondered whether anyone had told Romeo of the melee, and Veronica’s death. I wondered whether he would even care, so fixed was he on his love of Juliet.\\n\\n The prince clapped me on the back. “That was well-done, and a credit to your sister’s memory,” he said. “She died innocent, and God will welcome her soul into paradise.” He moved off quickly, to glad-hand my uncle and other upright, rich town leaders. Capulet was, of course, not among them.\\n\\n Lord Ordelaffi was.\\n\\n I made my way to his side. He looked older than I remembered, and more tired, in this unguarded moment; he forced a smile and offered a firm handshake to me. “Benvolio,” he said. “My sorrow for your sister.”\\n\\n “And mine, for your son,” I said. His eyes slid away as he nodded. “I regret I did not know of his burial before it was done, or I would have gladly borne him to his rest.”\\n\\n “You had grief enough, with Romeo’s exile and your sister’s untimely end,” he said, which sounded well enough, but there was falseness behind it. He had not wished to see Mercutio’s friends, nor to be reminded of the love that we had borne him. “It is in God’s hands now.”\\n\\n “I know it is not an auspicious time, sir, but I left with Mercutio a few things that I would like to retrieve,” I said. “May I come and find them?”\\n\\n “What, tonight?” he asked, and frowned. “I suppose there is no reason to wait. I have already given over some of his things to the poor, and to the Church. If what you seek is among them, you must deal with the monsignor.”\\n\\n I thanked him and drifted to my uncle’s side to tell him that I would accompany Lord Ordelaffi home, and thence be escorted by his men to the palazzo; he nodded, much distracted by the hot, whispered argument that was again being offered by Veronica’s aged bridegroom over the return of the proffered dowry. Five thousand florins was at stake. My uncle would not care what I did.\\n\\n The Ordelaffi palace was smaller than the Montague, but built along similar lines—what windows existed toward the street were high above, and blocked with stout shutters. They were more defensive than decorative; not so long ago, the great houses of Verona had repelled one another’s assaults with arrows, spears, and boiling oil. Today we were more gracious, but no less guarded.\\n\\n The difference truly came inside the Ordelaffi palace. I had been here but rarely, and always with Mercutio. The last time had been more than two years before, and I was surprised to note the barren walls where rich tapestries had once been draped to keep out the night’s chills. Portraits still adorned them, but the gold-illuminated icons I remembered were gone, as were the richer candlesticks and plate.\\n\\n It seemed smaller, and poorer, than ever.\\n\\n I followed Lord Ordelaffi down a bare hallway to a room set well off from its fellows; it was locked, and he fetched the key from a servant to open it to my gaze.\\n\\n Mercutio’s room had changed, too. It was stripped of its furnishings—gone to the poor, or to the Church, or (more likely) to be sold to cover the cost of his widow’s departure. A sad heap of his things lay on a threadbare carpet. My eyes darted to the niche where he had stored away the things I stole on my nighttime adventures as the Prince of Shadows. It was still shut tight.\\n\\n Lord Ordelaffi shut the door behind him, sealing the two of us within. I turned slowly to look at him, and saw a dark glint in his sullen face. “You knew of his crimes,” he said. “His dalliances. You lied for him, Benvolio, and you are as guilty as anyone in sealing his fate. You and that cursed thief friend of his, his Prince of Shadows.” Ordelaffi’s voice was rich with disgust. “My son consorted with thieves, as well as carried on his . . . his sinful relations with that apostate. Do not try to tell me you were ignorant of all of it. I found the gold, hidden away in a trunk, that my son kept for that criminal!”\\n\\n That had not been my gold, but Mercutio’s; I said nothing in response, preferring to wait. Lord Ordelaffi’s eyes were small and reddened with emotion—grief or anger, I could not tell.\\n\\n “You knew him well,” he said. “Why did he drive me to such extremes? I beat the boy, as I should have, to drive the folly out of him, but he only became more sullen, and more secretive in his transgressions. Why could he not be . . . be . . .” His hands grasped at a meaning he could not name.\\n\\n I did it for him. “Be the son you wished?”\\n\\n “Yes.”\\n\\n “Because he was as he was formed, as God made him,” I said. “All your beating and pushing would not force him into another shape. He loved you, my lord, but you broke his heart with the murder of the one he loved. What he was, after . . . he was neither the boy you wanted, nor the man he wished to be. And much grief has come of his shattering.” I was angry, but in a cold, remote way; Ordelaffi was not the roaring giant he’d been when he’d ordered the execution of Mercutio’s lover and set in motion all that followed. “But rest assured on one account: Your son was no thief.”\\n\\n “He was friend and accomplice to one—a coward, a dog who led my son astray.” \\n\\n","sourceLink":"https://allnovel.net/prince-of-shadows/page-53.html","bookId":2662,"book":{"id":2662,"title":"Prince of Shadows","description":"Storyline: In the Houses of Montague and Capulet, there is only one goal: power. The boys are born to fight and die for honor and—if they survive—marry for influence and money, not love. The girls are assets, to be spent wisely. Their wishes are of no import. Their fates are written on the day they are born. \\n Benvolio Montague, cousin to Romeo, knows all this. He expects to die for his cousin, for his house, but a spark of rebellion still lives inside him. At night, he is the Prince of Shadows, the greatest thief in Verona—and he risks all as he steals from House Capulet. In doing so, he sets eyes on convent-bound Rosaline, and a terrible curse begins that will claim the lives of many in Verona… \\n …And will rewrite all their fates, forever.\\n","cover":"https://allnovel.net/images/prince-of-shadows.jpg","author":"Rachel Caine","type":"Historical","source":"allnovel","link":"https://allnovel.net/prince-of-shadows.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:40 AM"}}
