{"id":75102,"no":146,"title":"Page 146","content":"“And I told you what I’d do if you went anywhere near her.” “Oh...so first I couldn’t ask her out, but now I can’t even go near her, huh? Pretty soon you’re going to kick my ass if I even think about her.” “Maybe you shouldn’t think about her, then,” he suggested, grinding his teeth. “Maybe you should stop being such a dick,” I snarled back. “Or maybe we should eat now,” Aspen broke in too brightly, wringing her hands as she glanced between us. “Did you hear that, everyone?” She lifted her voice to gain the crowd’s attention. “The food’s ready, so just…dive in.” Gamble and I shared one last glare before backing away from each other to let his brothers get to the table and start piling their plates. I wasn’t hungry, but I didn’t exactly move away from the food line. Caroline was approaching with the women, so I wasn’t going anywhere. I’m not sure where Lowe and Hart came from, but I found them flanking me as they started a conversation with each other about fuck knows what. I didn’t listen to a word they said. I didn’t look at Caroline directly either. I stared at the ground in front the food table, and settled for focusing on her from the corner of my eye. When she had to walk right past me after filling her plate, she didn’t look at me, though. I lifted my eyes in that split second she moved by and she completely fucking ignored me. I drew in a long breath, but I don’t think I got any air. I felt like I inhaled only a lungful of agony. “Ouch,” Hart murmured quietly beside me. I ignored him and turned to Lowe. “A week?” I said, lifting my eyebrows. “Two weeks,” he revised, glancing after Caroline and wincing. “Definitely two weeks.” “Fuck.” I wasn’t going to survive this. “Oh crap,” I heard Caroline’s voice. “I forgot my fork.” Darting to the table, I snatched the first plastic fork I saw and extended it her way. She jerked to a surprised halt when she turned and found me there. “Oh!” She sucked in a breath and pulled back. “Here you go,” I offered quietly. She immediately lowered her gaze. “Thank you.” When she went to reach for it, I refused to immediately let it go. Her face veered up, flaring with panic. “Oren. What’re you doing?” She tugged the fork free. As she started to turn away, I asked, “Are you not even going to say hello to me?” She froze before slowly glancing back. “You can’t do this here,” she whispered the warning. But I couldn’t not do it...anywhere. I needed to talk to her; I needed my woman back. I needed to know she was going to forgive me...if not today, then someday. “It’s been eight days,” was all I could think to say. I couldn’t help the way my gaze pleaded. I’d get down on my knees and beg if that’s what it took. Understanding filled her expression. “I...” But she didn’t say anything else. I was on the brink of losing my shit. “Does this mean you’re done then?” I asked. She shook her head, confused. “Done?” I jabbed a finger into my chest. “With me?” “Hey, what’re you two talking about over here by yourselves?” Gamble asked as he strolled toward us. His voice sounded casual and curious enough, but I could still detect the censure. Caroline jumped at his voice and immediately turned his way, but I couldn’t take my gaze off her, not until she answered me. Still ignoring Gamble, I hissed, “Caroline?” Nervous and jumpy, her eyes darted my way. “No,” she breathed out so quietly, only I could hear. “Of course, I’m not done with you.” Then she returned her attention to her brother and flashed him a big smile. “Maybe we’re telling secrets about you,” she teased. “Secrets?” he repeated. When his gaze slid my way, I just stared back, daring him to even start. The fucker must’ve accepted my challenge because he wrapped an arm around Caroline’s shoulder and smiled. “Oh, I could give you all kinds of secrets...about Ten here.” “Gam,” I said under my breath. The warning clear. I wouldn’t just stand here and take this shit. Caroline’s face had already drained of color and she looked stiff and upset. “Don’t.” He shrugged. “Don’t what?” I glanced around at everyone who’d paused what they were doing to watch us, all of them extra alert. “Don’t tell her about any of your secrets? Not even about Tianna?” After a low whistle, he spoke directly to Caroline. “I don’t know what he did to that poor girl, but I’ve never seen anyone hate a guy as much as she hates him, and Tianna loves all the guys.”","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-146.html","bookId":2714,"book":{"id":2714,"title":"A Perfect Ten (Forbidden Men #5)","description":"Storyline: Let your hair down, Caroline, they said. It\u0027ll be fun, they said. I know I\u0027ve closed myself off in a major way over the past year, ever since “the incident” where I messed up my life completely. It\u0027s past time I try to live again or just give up altogether. But this is quite possibly the craziest thing I\u0027ve ever done. In a last ditch effort to invigorate myself, I\u0027m standing outside Oren Tenning\u0027s bedroom, I just peeled off the sexiest pair of underwear I own, and my hand is already raised to knock. My brother would disown me for doing anything with his best friend, and he\u0027d probably kill Oren. But if I play my cards right, no one will ever know about this. Not even Ten. Maybe after tonight, I’ll finally get over this stupid, irrational crush I hate having on the biggest jerk I’ve ever met. Or maybe I’ll just end up falling for him even harder. Maybe I’ll discover there’s so much more to my crude, carefree hunk than meets the eye.","cover":"https://allnovel.net/images/a-perfect-ten-forbidden-men-5.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/a-perfect-ten-forbidden-men-5.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:31:49 AM"}}
