{"id":74979,"no":23,"title":"Page 23","content":"He cleared his throat, glanced at Gam, and then nodded. “Yeah.” Gamble had been the star QB of our team until he’d broken his collarbone on the second to last game this last year. So Hamilton had needed to step in and bring us the rest of the way to the national championships. We all knew it bothered Gamble because he hadn’t been able to play that last game, and he’d lost his shot to try out for the pros. Even though he said he was happy settling down here with his woman and taking care of his three younger siblings—whom he’d taken away from his mother after she practically abandoned them—we knew it bugged him. “Aspen find a job yet?” Ham asked him, hopefully. When Gam looked up, we knew she hadn’t from the tightening in his jaw. “No,” he muttered. She’d been unemployed for going on a year now, ever since she’d been fired for starting a relationship with him. Which brought up another sore issue with Gamble. He felt like a personal failure every time she applied for a new job and wasn’t hired. But then he wouldn’t even let her apply for jobs that he found “beneath” her. If their money was as tight as I knew it had to be, you’d think he’d just suck it up and let her be...well, whatever, for a while. But nope. He stayed stubborn. And she knew how much it would bother him if she “lowered” herself, as he called it, so she stayed unemployed and they just kept scrimping along. And I kept pretending it was my turn to pay for all our Saturday morning drinks at the coffee shop. And Gamble just kept letting me. I knew Caroline offered him money on a regular basis. She’d gotten a little nest egg last year—though I never learned just how many eggs—after she’d gotten involved with that rich prick from her hometown and his parents had paid her off. But Gamble adamantly refused to touch a cent of that money. I think each and every one of his rejections tore off a piece of her soul and left her bleeding a little more each time. She’d gone through a lot of bad shit to get that money; she should get to spend it however the fuck she wanted to. And if she wanted to help her family with it, her big brother should let her. That was one of the reasons she’d taken it in the first place...because of Gamble and their two younger brothers. Gamble forcing her to spend it on no one but herself killed a part of her, and sometimes, I just wanted to wrap my hands around his throat and shake some sense into him, force him to accept some of her money already. It would’ve made her happier. But I had no business in their family affairs, and I knew better than to butt in, no matter how many times I watched Caroline stiffen her spine, lift her chin and try to keep the pain from her eyes whenever he refused her help. The too-proud, stubborn ass. “I think I’m going to change my major,” Gamble spoke up suddenly. “What?” Hamilton and I glanced at him in unison. He nodded. “Aspen and I have been talking, and...business administration isn’t my thing. I know I won’t ever go pro, but I miss the football field. That’s where I belong. So, I’m thinking...I’m going to enroll again next year and get a teaching certificate, maybe become a coach.” While Hamilton nodded, letting him know what a great idea that was, my jaw dropped. “What?” I couldn’t be the only one of us three graduating and moving off to find a real job. I was the least mature of our group, the perpetual college party boy. I didn’t want to be the first to grow up. Gam shrugged and sent me a solemn glance. “Since Pick’s raised my wages at the bar, we’re doing...okay. We can make it for another two years until I graduate, and Caroline already has money for college taken care of, so I don’t have to worry about her. I seriously think it’s for the best if I did this.” “Well, fuck.” Now I really felt crappy. Not only had I had the best sex of my life and had just realized I’d never have it again, but now I was hearing that I’d be moving off while all my friends would remain here together...without me. That shit just wasn’t right. The second semester of my freshman year at ESU was drawing to a close in a month. A month. I would turn nineteen a week after the last day of class, I had a minimum-wage job cleaning an insurance office downtown after hours, and I’d just tricked the asshole of my dreams into having sex with me. Yeah, I was a complete mess. The soreness between my legs was the first thing I felt when I opened my eyes the next morning. Which flooded my head with flashbacks of the night before. Oren’s hand running up my thigh. Oren’s teeth digging into the back of my shoulder. Oren’s cock making me come all over his room. I shuddered and clamped my legs together as I hugged one arm over my tingling breasts.","sourceLink":"https://allnovel.net/a-perfect-ten-forbidden-men-5/page-23.html","bookId":2714,"book":{"id":2714,"title":"A Perfect Ten (Forbidden Men #5)","description":"Storyline: Let your hair down, Caroline, they said. It\u0027ll be fun, they said. I know I\u0027ve closed myself off in a major way over the past year, ever since “the incident” where I messed up my life completely. It\u0027s past time I try to live again or just give up altogether. But this is quite possibly the craziest thing I\u0027ve ever done. In a last ditch effort to invigorate myself, I\u0027m standing outside Oren Tenning\u0027s bedroom, I just peeled off the sexiest pair of underwear I own, and my hand is already raised to knock. My brother would disown me for doing anything with his best friend, and he\u0027d probably kill Oren. But if I play my cards right, no one will ever know about this. Not even Ten. Maybe after tonight, I’ll finally get over this stupid, irrational crush I hate having on the biggest jerk I’ve ever met. Or maybe I’ll just end up falling for him even harder. Maybe I’ll discover there’s so much more to my crude, carefree hunk than meets the eye.","cover":"https://allnovel.net/images/a-perfect-ten-forbidden-men-5.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/a-perfect-ten-forbidden-men-5.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:31:49 AM"}}
