{"id":99703,"no":10,"title":"Page 10","content":"In Sharmila\u0027s personal jet, streaking through the skies. I\u0027d think that was cool any other time, but I\u0027m hard to impress right now. Versatile Sharmila is the pilot. There are six other seats. Beranabus has taken up the rear pair and is making a series of phone calls-we could have used a window to get to Carcery Vale and saved some time, but he wanted to talk with the Disciples first and manoeuvre them into position. Kernel is on the middle left, staring down at the clouds. I\u0027m on the front right, flicking through newspapers.\\n\\n Tales of mayhem and terror. Splash photos of demons and their victims. An array of monsters never dreamt of by most people until now. Long, sprawling lists of victims. First-hand accounts from survivors. Speculation and theories-where are the Demonata from? What are their motives? How can we kill them?\\n\\n That\u0027s the most burning question-how to destroy the invaders. Mankind\u0027s never had to face an unstoppable enemy before. There have been countless movies and books about such encounters, and the aliens or monsters have always had a weak spot, an Achilles\u0027 heel which some clean-cut champion has discovered and exploited in the nick of time. But that\u0027s not the case here. The reports are from the early days of the invasion and there\u0027s a hint of optimism in them. But even in these columns I can sense desperation as the realisation seeps in-we can\u0027t kill them!\\n\\n There are a few reports about the Disciples, but they\u0027re vague and patchy. Rumours of a group of experts with knowledge and experience of demons, but no mention of magic or names.\\n\\n Some of the older papers still have ordinary sections, sports coverage and gossip columns, the usual padding. An attempt to maintain normality. But the later editions focus solely on the Demonata. Nothing else, just page after page of horror and catastrophe.\\n\\n I stop reading after half an hour. I\u0027ve had enough. Humanity has hit a brick wall. We\u0027re facing our end, like the dinosaurs millions of years before us. The only difference is we\u0027ve got journalists on hand to document every blow and setback, cataloguing our rapid, painful downfall in vibrant, vicious detail. Personally, I think the dinosaurs had the better deal. When it comes to impending, unavoidable extinction, ignorance is bliss.\\n\\n We set down hours later on a private landing strip outside a small town close to the border where humans and demons are locked in battle. There are several other planes and helicopters parked at the sides of the strip. A large, grey, square building occupies one corner. We head for it once we\u0027ve disembarked, Beranabus leading the way with the stride of a confident, commanding general.\\n\\n Inside the building are eleven men and women, a mix of races. A couple aren\u0027t much older than me, a few look to be in their seventies or eighties, while the others fall into the thirty-to-sixty bracket. Most are neatly dressed, though one or two could compete with Beranabus in the scruffiness stakes. They all look tired and drained.\\n\\n \"Hail to the chief!\" a large man in military fatigues shouts ironically, saluting Beranabus as he enters. There are letters tattooed on his knuckles and a shark\u0027s head covers the flesh between knuckles and thumb. Like when Sharmila turned up at the cave, I know his face and name, even though we\u0027ve never really met.\\n\\n \"Shark?\" Beranabus scowls. \"Sharmila thought you were dead.\"\\n\\n \"When you broke contact, I feared the worst,\" Sharmila says, shuffling around Beranabus.\\n\\n \"Couldn\u0027t wait for the Messiah forever,\" Shark grunts. \"There was fighting to be done. I was going to summon you back, but I knew you wouldn\u0027t return without our regal leader.\"\\n\\n \"I had to wait,\" Sharmila says stiffly. \"Beranabus is our best hope.\"\\n\\n Shark snorts. \"Hope? What\u0027s that? I heard about it once, in a fairy tale.\"\\n\\n \"Be quiet,\" Beranabus says softly and the larger man obeys, though he eyes Beranabus accusingly, as though he blames the magician for our dire predicament. \"Any more to join us?\" Beranabus asks, addressing the question to the room in general.\\n\\n \"Two, maybe three,\" a small, dark-skinned woman answers.\\n\\n \"Then I\u0027ll start.\" Beranabus looks around, meeting everybody\u0027s gaze in turn. \"I won\u0027t offer false hope. We\u0027re in deep trouble and I doubt we\u0027ll be able to wade out. But the war isn\u0027t lost yet. If we can destroy the tunnel linking the two universes, the demons will be sucked back to their own realm.\"\\n\\n There are excited mutterings. \"Are you sure?\" Shark asks suspiciously. \"You\u0027re not just saying that to rally our spirits?\"\\n\\n \"Have I ever lied to any of you?\" Beranabus retorts sharply. He waits a moment. When nobody responds, he continues. \"One of Lord Loss\u0027s human allies killed a person in the cave, to prime the tunnel opening. The killer later joined with the rock where the mouth of the tunnel was originally situated-he or she has become a living part of the opening. If we dismantle the tunnel walls, the killer dies, the demons get sucked back to their own universe and all will be well with the world.\"\\n\\n \"How do we close the tunnel?\" Sharmila asks.\\n\\n \"There\u0027s a lodestone set deep within the cave,\" Beranabus says. \"The demons are using its power. If I can reach it, I know the spells to disable it and rid us of our unwelcome guests. I\u0027ll need somebody to help me inside the cave-Kernel or Grubbs. The rest of you only have to concern yourselves with getting us there.\"\\n\\n \"You want us to clear the way for you, even if it costs us our lives,\" Shark growls.\\n\\n \"Aye,\" Beranabus says. \"This is a suicide mission. We\u0027re going to drop into a nest of demons. They\u0027ll be waiting for us, expecting an attack. They\u0027ll outnumber us and many are probably more powerful than we are. Our chances of making it to the lodestone are slim. Even if the boys and I get through, the rest of you are doomed-you\u0027ll need to continue fighting while I cast the spells, to guard our backs. I doubt any of you will survive.\"\\n\\n \"That\u0027s a lot to ask,\" Shark says icily.\\n\\n \"It\u0027s no more than I ask of myself. Sacrifice opened this tunnel and only sacrifice can close it.\" He glances at Kernel and me, hesitates, then pushes on. \"For the spell to work, I must kill Kernel or Grubbs. If they both perish along the way, I\u0027ll offer my own life. I think I can make that work. Whatever happens, it\u0027s a death trip for me. I have to get deep inside the tunnel to work the spell. Once it\u0027s finished, I won\u0027t be able to fight my way out. I\u0027m too old and weary.\"\\n\\n Beranabus looks straight at Shark and awaits his response. The big man shrugs thoughtfully and Beranabus addresses the room again. \"I don\u0027t think any of us will make it through this day. But if we succeed, humanity will go on.\"\\n\\n \"Until another tunnel is opened,\" Sharmila notes. \"If we all perish, who will protect mankind the next time?\"\\n\\n \"That\u0027s not our problem,\" Beranabus says. \"I believe the universe will spit out more heroes to lead the good fight. But whatever happens, it\u0027s out of our hands. This is what we must do to counter the present threat. Are you with me? If any of you aren\u0027t, say so now and leave the rest of us to get on with it.\"\\n\\n Nobody backs down from the challenge. Most don\u0027t look very happy-who the hell would!-but they accept the magician\u0027s verdict. Seeing this, Beranabus smiles approvingly, then circulates, chatting with the Disciples individually, making sure they\u0027re prepared for the fight, offering advice and strategic tips, raising morale.\\n\\n Kernel and I are in the middle of the room, looking at each other uncertainly. Beranabus\u0027s announcement that one of us must be sacrificed came out of the blue. Neither of us knows what to say. It\u0027s one thing to go into a fight knowing you\u0027ll probably lose. Quite another to be told that to win, you must offer up your throat to be slit.\\n\\n Sharmila approaches, smiling thinly. \"He did not tell you that you were to be killed?\"\\n\\n \"He\u0027s a busy man,\" Kernel snaps. \"He doesn\u0027t have time to tell us everything.\"\\n\\n Sharmila sighs. \"You are loyal. That is good. But are you loyal to the point of death? Will you allow yourself to be slaughtered?\" She looks at me. \"Will you?\"\\n\\n \"We\u0027ll do what we must,\" Kernel says fiercely. \"We\u0027re not ignorant children. We know our duty. If we have to die, so be it. We\u0027d rather not, but we\u0027ll be killed by the demons anyway if we lose, and probably more painfully and slowly.\"\\n\\n Sharmila tilts her head towards us. \"I apologise if I seemed critical. But I had to know the nature of the boys I am to fight and die for. Now I am confident that you will not fail if the opportunity presents itself. Thank you for reassuring me.\"\\n\\n She wanders off to talk with Beranabus. Kernel looks sideways at me. \"I normally wouldn\u0027t give another person\u0027s word for them, especially when I\u0027m not sure of it, but it seemed like the right thing to say.\"\\n\\n \"You don\u0027t have to worry about me,\" I reply stiffly. \"I won\u0027t let us down.\"\\n\\n \"I wish I could believe that.\" He doesn\u0027t say it to hurt me. Just speaking the truth as he sees it.\\n\\n \"I chickened out in the Demonata\u0027s universe,\" I whisper, blushing. \"But this is different. I\u0027ll fight. And I\u0027ll die if I have to. I\u0027m not afraid of dying, no more than anybody else in this room.\"\\n\\n \"Really?\" Kernel\u0027s unconvinced. \"If I fall, and you and Beranabus make it to the lodestone, you\u0027ll let him drive a knife through your heart or chop off your head?\"\\n\\n \"Without a moment\u0027s hesitation. Not because I\u0027m incredibly brave, but because I\u0027m terribly afraid.\" I give a sickly laugh. \"If I don\u0027t let him kill me, it would mean fighting to survive in a world overrun by demons. The thought of that scares me more than death.\"\\n\\n Kernel chuckles. \"Know something crazy? I believe you.\" He offers his hand and I take it. \"Good luck, Grubbs.\"\\n\\n \"Good luck.\"\\n\\n \"May we both die honourably,\" he says.\\n\\n \"And take every damn demon down with us,\" I add with a twisted grin.\\n\\n Tooling up. Everybody arms themselves with guns, knives, axes-pretty much anything we can carry.\\n\\n Demons can\u0027t be killed by regular weapons, but we can invest the blades and bullets with magical powers.\\n\\n \"How many of the Disciples are capable of killing demons?\" I ask Kernel, testing short swords for feel and weight.\\n\\n \"In this universe?\" He pulls a face. \"If it was a normal crossing... Sharmila, Shark, one or two others. But there\u0027s more energy in the air because it\u0027s a tunnel, not a window. Others should be able to tap into that and find the ability to kill. If we\u0027re lucky.\"\\n\\n One more Disciple arrives while we\u0027re readying ourselves. An ancient, tiny woman who walks with the aid of a cane. The sight of her picking up a mace and swinging it over her head makes me smile. A few of the others grin too. But then she mutters a quick spell and a crop of seven-centimetre long blades grow out of the mace head, which glows with magical energy. Nobody doubts her after that.\\n\\n Then it\u0027s to the helicopters which Shark has arranged through his contacts in various armies. We\u0027re going to fly in and set down as close to the cave entrance as we can. Three helicopters, five of us to each. I\u0027m with Beranabus, Kernel, Shark and Sharmila-the core of the force. The pilot\u0027s an ordinary human, as are the other two. Soldiers on loan from the forces currently engaged in hopeless warfare with the Demonata. Shark has told a few commanders of our plan. They\u0027ve handed him control of their troops and will do whatever else they can to assist.\\n\\n The helicopter rises smoothly, as if the ground is dropping away. I haven\u0027t been in a helicopter before. It\u0027s a curious sensation. Not as much of a blast as flying through the sky with Beranabus, but way more interesting than a plane.\\n\\n \"I never thought I\u0027d be doing this,\" Shark bellows over the noise of the whirring blades. He\u0027s smiling. \"How often does the chance come along to end a war? You see it all the time in films, but in real life wars are decided over a variety of fronts and battles. It\u0027s possible to play an important role in victory, but only a limited part. To actually be charged with the task of going in and saving the world...\" He whoops with joy.\\n\\n \"I\u0027m glad you\u0027re having fun,\" Kernel remarks sarcastically.\\n\\n \"Damn straight I am,\" he hollers. \"Might as well-we\u0027re going to die regardless.\"\\n\\n I turn my attention away from the battle-hungry Shark. He\u0027s probably got the right attitude for a fight like this, but I find his gung-ho approach tasteless and disturbing. This isn\u0027t a game. We\u0027re not competing for a trophy. If we lose, we take humanity down with us. I don\u0027t see how you can be anything but stone cold miserable when lumbered with a responsibility like that.\\n\\n Looking down as we whizz along, closing in on Carcery Vale. We\u0027re deep into Demonata territory now. This used to be my home. Not anymore. It\u0027s theirs now. Abandoned cars. Burning buildings. Pools of blood smear the roads and fields. Slaughtered animals and humans everywhere, some cut up into bits and strewn about the place, others arranged in obscene patterns by the demons, either for their own amusement or to scare anyone who ventures into their realm.\\n\\n I spot a few of the monsters messing with bodies on the ground. I don\u0027t look closely enough to determine whether their victims are alive or dead. I turn my gaze away and pray for their sakes that they\u0027re corpses.\\n\\n Others are lounging in trees or in patches of shade, sheltering from the sun. Although stronger demons can move about during the day, they don\u0027t like sunlight and aren\u0027t as powerful as they are at night. The land would be teeming with lots more of the beasts if we were a few hours later in the day.\\n\\n The outskirts of Carcery Vale. More of a visible demonic presence. Most of the buildings are ripped to pieces. Bodies scattered everywhere. We fly over my old school-dozens of children and teachers are impaled on spikes, grey and red, covered in feasting flies, slowly rotting.\\n\\n For the first time I think about my friends. Until now I\u0027ve been fixed on Dervish and Bill-E. But all the others will have fallen to the Demonata too. Frank, Mary, Leon, Shannon... Reni. I rip my gaze away from the bodies in case I spot the face of someone I know. Tears come, but I fight them back. I can\u0027t think about my friends, not even my uncle and brother. The best-only-way I can avenge them is by focusing on the demons and the battle. No room for pity, doubt or fear. Mustn\u0027t imagine them suffering, the pain they must have gone through, whether any escaped. The demons. The cave. Dying. These should be my only concerns.\\n\\n The air above the Vale is thick with planes and helicopters. Shark ordered the regular troops in ahead of us. They\u0027ve been blanket-bombing the area for the past twenty minutes, most of their force aimed at the demons around the entrance to the cave, disrupting them, blowing up the bodies of the lesser demons. The effects are temporary-the demons will piece themselves back together once the shelling stops-but any minor advantage is a bonus.\\n\\n Zoning in on the cave. I don\u0027t recognise the area anymore. There used to be a forest here at the back of our house, stretching all the way to Carcery Vale and for many kilometres in other directions. Now it\u0027s been firebombed into oblivion. The land is ash and tree stumps. Bare, scarred, dead. It resembles the face of an asteroid. Doesn\u0027t belong to this world. Something from outer space or a bad dream.\\n\\n We fly over the rubbly ruins of a large building. We\u0027re several seconds past it before I realise- that wreck used to be my home! The wonderful three storey mansion has been reduced to a skeletal shell. I\u0027m almost glad Dervish isn\u0027t here to see it. He loved that house. The sight of it in this sorry state would bring tears to his eyes.\\n\\n The pilot\u0027s in constant contact with the other aircraft, snapping orders and directions, carefully manoeuvring his way through the fleet. If he\u0027s scared, he doesn\u0027t show it. I wish the fighting could be left to the professionals like him. But I guess ordinary people always get sucked into battles. It\u0027s the nature of warfare.\\n\\n \"Like a scene out of hell, isn\u0027t it?\" Shark notes with relish, stroking the long, gleaming barrel of a machine gun hanging from his neck.\\n\\n \"Let us hope it is hell for the demons when we finish,\" Sharmila says.\\n\\n The helicopter stops advancing. Hovers in the air, the pilot waiting for the other two copters to join us. I stare at the ground. Hard to spot the cave entrance.\\n\\n Bombs are going off all around, throwing up dirt, stones, bits of flesh and bones. I see stronger demons moving about freely, protected from the explosions by magic. They form a large circle, several demons deep. Pinpointing the centre of that circle, I finally locate the mouth of the cave. Just a small hole in the ground. Doesn\u0027t look like anything special. Not the sort of place where you expect the future of the planet to be decided.\\n\\n The second helicopter moves up alongside us, then the third. The Disciples are on their feet or knees by the open sides of the copters, clinging to straps, ready to jump as soon as they\u0027re within safe distance of the ground. The elderly woman with the cane is sitting, legs dangling over the side, stroking the blades sticking out of her mace.\\n\\n Our pilot looks back at Shark for confirmation. The ex-soldier pauses and casts an unusually sad eye around, swallowing hard, looking doubtful for the first time. For a moment I think he\u0027s lost his thirst for battle. Beranabus thinks it too and opens his mouth to yell an order at the pilot. Then Shark raises his head, grins grimly and nods savagely. The pilot speaks rapidly into his mouthpiece, issuing urgent orders. The sky clears of planes. Helicopters packed with ground troops cluster around us. I can see the faces of some of the soldiers-underlying terror, overlaid by determination, much like the faces of those closer to me.\\n\\n The rain of bombs lessens, then stops. Dust swirls below, momentarily masking the hordes of demons. Shark roars commandingly at the pilot. We drop. \\n\\n","sourceLink":"https://allnovel.net/demon-apocalypse-the-demonata-6/page-10.html","bookId":2180,"book":{"id":2180,"title":"Demon Apocalypse (The Demonata #6)","description":"Storyline: Demon Apocalypse (The Demonata #6) \\n One boy\u0027s life ripped to shreds before his eyes... One wrathful demon master hell-bent on revenge... An army of grisly Demonata on the rampage... It\u0027s the end of the world as we know it. The sixth novel in the chilling Demonata series by Darren Shan, author of the \"New York Times \"bestselling Cirque Du Freak series, will terrify readers long after the last page.\\n","cover":"https://allnovel.net/images/demon-apocalypse-the-demonata-6.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/demon-apocalypse-the-demonata-6.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:46:23 PM"}}
