{"id":33968,"no":39,"title":"CHAPTER XXXVIII THE DEFENSE OF LOVE","content":"(Discusses passionate love, its sanction, its place in life, and its preservation in marriage.) I have before me as I write a newspaper article by Robert Blatchford, a great writer and great man. He is dealing with the subject of \"Love and Marriage,\" and his doctrine is summed up in the following sentences: \"There is a difference between loving a woman and falling in love with her. The love one falls into is a sweet illusion. But that fragrant dream does not last. In marriage there are no fairies.\" This expresses one of the commonest ideas in the world. Passionate love is one thing, and marriage is another and different thing, and it is no more possible to reconcile them than to mix oil and water. Our notions of \"romantic\" love took their rise in the Middle Ages, from the songs and narratives of the troubadours, and this whole tradition was based upon the glorification of illegitimate and extra-marital love. That tradition has ruled the world of art ever since, and rules it today. I do not exaggerate when I say that it is the conventional view of grand opera and the drama, of moving pictures and novels, that impassioned and thrilling love is found before marriage, and is found in adultery and in temptations to adultery, but is never found in marriage. I have a pretty varied acquaintance with the literature of the world, and I have sat and thought for quite a while, without being able to recall a single portrait of life which contradicts this thesis; and certainly anyone familiar with literature could name ten thousand novels and dramas and grand operas which support the thesis. English and American Puritanism have beaten the tradition down to this extent: the novelist portrays the glories and thrills of young love, and carries it as far as the altar and the orange blossoms and white ribbons and showers of rice—and stops. He leaves you to assume that this delightful rapture continues forever after; but he does not attempt to show it to you—he would not dare attempt to show it, because the general experience of men and women in marriage would make him ridiculous. So he runs away from the issue; if he tells you a story of married life, it is a story of a \"triangle\"—the thrills of love imperiling marriage, and either crushed out, or else wrecking the lives of the victims. Such is the unanimous testimony of all our arts today, and I submit it as evidence of the fact that there must be something vitally wrong with our marriage system. Personally, I am prepared to go as far as the extreme sex-radical in the defense of love and the right to love. I believe that love is the most precious of all the gifts of life. I accept its sanctions and its authority. I believe that it is to be cherished and obeyed, and not to be run away from or strangled in the heart. I believe that it is the voice of nature speaking in the depths of us, and speaking from a wisdom deeper than we have yet attained, or may attain for many centuries to come. And when I say love, I do not mean merely affection. I do not mean merely the habit of living in the same home, which is the basis of marriage as Blatchford describes it. What I mean is the love of the poets and the dreamers, the \"young love\" which is thrill and ecstasy, a glorification and a transfiguration of the whole of life. I say that, far from giving up this love for marriage, it is the true purpose of marriage to preserve this love and perpetuate it. To save repetition and waste of words, let us agree that from now on when I use the word love, I mean the passionate love of those who are \"in love.\" I believe that it is the right of men and women to be \"in love,\" and that there is no true marriage unless they are \"in love,\" and stay \"in love.\" I believe that it is possible to apply reason to love, to learn to understand love and the ways of love, to protect it and keep it alive in marriage. Blatchford writes the sentence, \"Matrimony cannot be all honeymoon.\" I answer that assuredly it can be, and if you ask me how I know, I tell you that I know in the only way we really know anything—because I have proven it in my own life. I say that if men and women would recognize the perpetuation of the honeymoon as the purpose of marriage, and would devote to that end one-hundredth part of the intelligence and energy they now devote to the killing of their fellow human beings in war, we might have an end to the wretched \"romantic tradition\" which makes the most sacred emotion of the human heart into a sneak-thief skulking in the darkness, entering our lives by back alleys and secret stairways—while greed and worldly pomp, dullness and boredom, parade in by the front entrance. In the first place, what is love—young love, passionate love, the love of those who \"fall in\"? I know a certain lady, well versed in worldly affairs, who says that it is at once the greatest nonsense and the deadliest snare in the world. This lady was trained as a \"coquette\"; she, and all the young ladies she knew, made it their business to cause men to fall in love with them, and their prestige was based upon their skill in that art. So to them \"love\" was a joke, and men \"in love\" were victims, whether ridiculous or pitiable. To this I answer that I know nothing in life that cannot be \"faked\"; but an imitation has value only as it resembles something that is real, and that has real value. I am aware that it is possible for a society to be so corrupted, so given up to the admiration of imitations, of the paint and powder and silk-stocking-clad-ankle kind of love, that true and genuine love interest, with its impulse to self-sacrifice and self-consecration, is no longer felt or understood. I am aware that in such a society it is possible for even the very young to be so sophisticated that what they take to be love is merely vanity, the worship of money, and the grace and charm which the possession of money confers. I have known girls who were \"head over heels\" in love, and thought it was with a man, when quite clearly they were in love with a dress suit or a social position. In such a society it is hard to talk about natural emotions, and deep and abiding and disinterested affections. Nevertheless, amid all the false conventions, the sham glories and cowardices of our civilization, there abides in the heart the craving for true love, and the idea of it leaps continually into flame in the young. In spite of the ridicule of the elders, in spite of blunders and tragic failures, in spite of dishonesties and deceptions—nevertheless, it continues to happen that out of a thousand maidens the youth finds one whose presence thrills him with a new and terrible emotion, whose lightest touch makes him shiver, almost makes his knees give way. If you will recall what I have written about instinct and reason, you will know that I am not a blind worshipper of our ancient mother nature. I am not humble in my attitude toward her, but perfectly willing to say when I know more than she does. On the other hand, when I know nothing or next to nothing, I am shy of contradicting my ancient mother, and disposed to give respectful heed to her promptings. One of the things about which we know almost nothing at present is the subject of eugenics. We are only at the beginning of trying to find out what matings produce the best offspring. Meantime, we ought to consider those indications which nature gives us, just as we consider her advice about what food to eat and what rest to take. It is not my idea that science will ever take men and women and marry them in cold blood, as today we breed our cattle. What I think will happen is that young men and women will meet one another, as they do at present, and will find the love impulse awakening; they will then submit their love to investigation, as to whether they should follow that impulse, or should wait. In other words, I do not believe that science will ever do away with the raptures of love, but will make itself the servant of these raptures, finding out what they mean, and how their precious essence may be preserved. I perfectly understand that the begetting of children is not the only purpose of love. The children have to be reared and trained, which means that a home has to be founded, and the parents have to learn to co-operate. They have to have common aims in life, and temperaments sufficiently harmonious so that they can live in the house together without tearing each other\u0027s eyes out. This means that in any civilized society all impulses of love have to be subjected to severe criticism. I intend, before long, to show just how I think parents and guardians should co-operate with young people in love; to help them to understand in advance what they are doing, and how it may be possible for them to make their love permanent and successful. For the moment I merely state, to avoid any possible misunderstanding, that I am the last person in the world to favor what is called \"blind\" love, the unthinking abandonment to an impulse of sex passion. What I am trying to show is that the passionate impulse, the passionate excitement of the young couple, is the material out of which love and marriage are made. Passion is a part of us, and a fundamental part. If we do not find a place for it in marriage, it will seek satisfaction outside of marriage, and that means lying, or the wrecking of the marriage, or both. Passion is what gives to love and marriage its vitality, its energy, its drive; in fact, it gives these qualities to the whole character. It is a vivifying force, transfiguring the personality, and if it is crushed and repressed, the whole life of that person is distorted. Yet it is a fact which every physician knows, that millions of women marry and live their whole lives without ever knowing what passionate gratification is. As a consequence of this, millions of men take it for granted that there are \"good\" women and \"bad\" women, and that only the latter are interesting. This, of course, is simply one of the abnormalities caused by the supplanting of love by money as a motive in marriage. Love becomes a superfluity and a danger, and all the forces of society, including institutionalized religion, combine to outlaw it and drive it underground. Or we might say that they lock it in a dungeon—and that the supreme delight of all the painters, poets, musicians, dramatists and novelists of all climes and all periods of history, is to portray the escape of the \"young god\" from these imprisonments. The story is told in six words of an old English ballad: \"Love will find out the way!\" Is it not obvious that there must be something vitally wrong with our institutions and conventions in matters of sex, when here exists this eternal war between our moralists and our artists? Why not make up our minds what we really believe; whether it is true that poets are, as Shelley said, \"the unacknowledged legislators of mankind,\" or whether they are, as Plato declared, false teachers and seducers of the young. If they are the latter, let us have done with them, let us drive them from the state, together with lovers and all other impassioned persons. But if, on the other hand, it is truth the poets tell about life, then let us take the young god out of his dungeon, and bring him into our homes by the front door, and cast out the false gods of vanity and greed and worldly prestige which now sit in his place. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3232/88423.html","bookId":685,"book":{"id":685,"title":"The Book of Life","description":"简介： The writer of this book has been in this world some forty-two years. That may not seem long to some, but it is long enough to have made many painful mistakes, and to have learned much from them. Looking about him, he sees others making these same mis...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3232","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
