{"id":33976,"no":47,"title":"CHAPTER XLVI THE PROBLEM OF DIVORCE","content":"(Defends divorce as a protection to monogamous love, and one of the means of preventing infidelity and prostitution.) You will hear sermons and read newspaper editorials about the \"divorce evil,\" and you will find that to the preacher or editor this \"evil\" consists of the fact that more and more people are refusing to stay unhappily married. It does not interest these moralizers if the statistics show that it is women who are getting most of the divorces, and that the meaning of the phenomenon is that women are refusing to continue living with drunken and dissolute men. To the clergy, the breaking of a marriage is an evil per se, and regardless of circumstances. They know this because God has told them so, and in the name of God they seek to keep people tied in sex unions which have come to mean loathing instead of love. Now, I will assert it as a mathematical certainty that a considerable percentage of marriages must fail. It is essential to progress that human beings should grow, both mentally and spiritually, and manifestly they cannot all grow in the same way. If they grow differently, must they not sometimes lose the power to make each other happy in the marital bonds? Who does not know the man who masters life and becomes a vital force, while his wife remains dull and empty? If such a man changes wives, the world in general denounces him as a selfish beast; but the world does not know nor does it care about those thousands of men who, not caring to be branded as selfish beasts, fulfill the needs of their lives by keeping mistresses in secret. I knew a certain country school teacher, one of the most narrowly conventional young women imaginable, who was engaged to a middle-aged business man. He went to New York on a business trip, and stayed a couple of months, and wrote her that he had met some Anarchists, and had discovered that all he had read about them in the newspapers was false, and that they were the true and pure idealists to whom the rest of his life must be devoted. The young lady was horrified; nor was she any happier when she came to New York and met her fiancé\u0027s new friends. She ought in common sense to have broken the engagement; but she was in love, and she married, as many another fool woman does, with the idea of \"reforming\" the man. She failed, and was utterly and unspeakably wretched. I know another man, a conservative capitalist of narrow and aggressive temper, whose wife turned into an ardent Bolshevik. The man thinks that all Bolsheviks should be shut up in jail for life, while the wife is equally certain that all jails should be razed to the ground and all Bolsheviks placed in control of the government. These two people have got to a point where they cannot sit down to the breakfast table without flying into a quarrel. I know another case of a modern scientist, an agnostic, whose wife, a half-educated, sentimental woman, took to dabbling in mysticism, and drove him wild by setting up an image of Buddha in her bedroom, and consorting with \"swamis\" in long yellow robes. I know another whose wife turned into an ultra-pious Catholic, and turned over the care of his domestic life to a priest. Is it not obvious that the only possible solution of such problems lies in divorce? Unless, indeed, we are all of us going to turn over the care of our domestic lives to the priests! Our grandfathers and grandmothers believed one thing, and believed the same thing when they were seventy as when they were twenty; so it was possible for them to dwell in domestic security and permanence till death did them part. But we are learning to change our minds; and whether what we believe is better or worse than what our ancestors believed, at least it is different. Also we are coming to take what we believe with more seriousness; the intellectual life means more and more to us, and it becomes harder and harder for us to find sexual and domestic happiness with a partner who does not share our convictions, but, on the contrary, may be contributing to the campaign funds of the opposition party. I do not mean by this that people should get a divorce as soon as they find they differ about some intellectual idea; on the contrary, I have advocated that they should do everything possible to understand and to tolerate each other. But it is a fact that intellectual convictions are the raw material out of which characters and lives are made, and it is inevitable that some characters and lives that fit quite well at twenty should fit very badly at thirty or forty. When we refuse divorce under such circumstances we are not fostering marriage, as we fondly imagine; we are really fostering adultery. It is a fact that not one person in ten who is held by legal or social force in an unhappy sex union will refrain from seeking satisfaction outside; and because these outside satisfactions are disgraceful, and in some cases criminal, they seldom have any permanence. Therefore it follows that \"strict\" divorce laws, such as the clerical propaganda urges upon us, are in reality laws for the promotion of fornication and prostitution. There is a short story by Edith Wharton, in which the \"divorce evil\" is exhibited to us in its naked horror; the story called \"The Other Two,\" in the volume \"The Descent of Man.\" A society woman has been divorced twice and married three times, and by an ingenious set of circumstances the woman and all three of the men are brought into the same drawing-room at the same time. Just imagine, if you can, such an excruciating situation: a woman, her husband, and two men who used to be her husbands, all compelled to meet together and think of something to say! I cite this story because it is a perfect illustration of the extent to which the \"divorce problem\" is a problem of our lack of sense. Mrs. Wharton will, I fear, consider me a very vulgar person if I assert that there is absolutely no reason whatever why any of those four people in her story should have had a moment\u0027s discomfort of mind, except that they thought there was. There is absolutely nothing to prevent a man and woman who used to be married from meeting socially and being decent to each other, or to prevent two men from being decent to each other under such circumstances. I would not say that they should choose to be intimate friends—though even that may be possible occasionally. I know, because I have seen it happen. In Holland I met a certain eminent novelist and poet, a great and lovable man. I visited his home, and met his wife and two little children, and saw a man and woman living in domestic happiness. The man had also two grown sons, and after a few days he remarked that he would like me to meet the mother of these young men. We went for a walk of a mile or so, and met a lady who lived in a small house by herself, and who received us with a friendly welcome and talked with us for a couple of hours about music and books and art. This lady had been the writer\u0027s wife for ten years or so, and there had been a terrible uproar when they voluntarily parted. But they had refused to pay attention to this uproar; they understood why they did not wish to remain husband and wife any longer, but they did not consider it necessary to quarrel about it, nor even to break off the friendship which their common interests made possible. The two women in the case were not intimate, I gathered, but they frequently met at the homes of others, and found no difficulty in being friendly. I suggest to Mrs. Wharton that this story is at least as interesting as the one she has told; but I fear she will not care to write it, because apparently she considers it necessary that people who are well bred and refined should be the helpless victims of destructive manias. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3232/88431.html","bookId":685,"book":{"id":685,"title":"The Book of Life","description":"简介： The writer of this book has been in this world some forty-two years. That may not seem long to some, but it is long enough to have made many painful mistakes, and to have learned much from them. Looking about him, he sees others making these same mis...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3232","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
