{"id":79033,"no":16,"title":"Page 16","content":"He knew where to touch, where to stroke, when to push, when to retreat. And yet, when he finally reached his own release, he realized his gentle little bride had taken him far beyond the stars.\\n\\n She\u0027d taken him to heaven.\\n\\n She slept like the dead. Morning sun was full upon the meadow when she stretched herself awake. Jamie let out a low groan as soon as she moved. She was horribly tender. Her eyes flew open. The memory of what had happened last night made her cheeks burn with embarrassment.\\n\\n God help her, she was never going to be able to look him in the eye again. She had behaved like a complete wanton. She did tel him to stop, she reminded herself, but the man was bent on having his way.\\n\\n She was going to stay under his plaid for the rest of the day, she decided, when she admitted she\u0027d also insisted, rather vehemently, that he not stop.\\n\\n Stil , he did seem to like what they were doing. Jamie pushed the blanket away from her face then. She saw Alec immediately. He was standing on the other side of the clearing, between their mounts. The horses, she noticed, had already been saddled in readiness for the day\u0027s ride.\\n\\n Wildfire was acting like a lovesick female. She kept nudging Alec\u0027s hand for another pat of affection.\\n\\n Jamie suddenly wanted a pat of affection, too. She thought she might have pleased him last night.\\n\\n Unfortunately, she\u0027d fal en asleep before he had a chance to tel her so.\\n\\n She was going to have to bluster through her embarrassment. Since he wasn\u0027t paying her any attention, she stood up, unwrapped his plaid, and quickly put her chemise back on. She knew her attire was immodest, but she was determined not to show any shyness in front of him. He would take it as weakness, she guessed.\\n\\n Alec didn\u0027t even glance her way. She gathered her clothes and walked to the pond with as much dignity as her sore thighs would all ow. She washed and dressed in a pale blue gown, then braided her hair. Her mood was vastly improved when she walked back to camp. It was a new day, after all , and certainly a new beginning.\\n\\n Besides, she\u0027d done her duty as his wife. She had let him bed her.\\n\\n Did she think he was made of iron? Alec asked himself that question as soon as his wife walked away from him.\\n\\n No other woman had ever enticed him this way. He\u0027d never known such fierce desire before. Bed them and forget them, that had always been his attitude in the past. She was different, though. God help him, she was beginning to matter to him. She wasn\u0027t the forgetting kind, either. White-hot desire had claimed him the minute she stood up and faced him. Her hair was in wild, curly disarray. He remembered the silky feel of it when he\u0027d held the strands up for the wind to dry. Jamie had slept through his ministrations. He hadn\u0027t been able to quit stroking her skin after he\u0027d made love to her. She\u0027d slept through that, too.\\n\\n He hadn\u0027t slept at all . Her h*ps had cushioned his hardness. Every time she moved, he wanted to take her again. The only reason he held back was that she wouldn\u0027t be able to walk for a week if he did all the things he wanted to do to her. It was too soon for her. She needed time for the soreness to ease. He\u0027d made the decision not to touch her again until they reached his home. And he was already regretting it.\\n\\n He wasn\u0027t made of iron. His innocent little wife didn\u0027t understand that yet. She wouldn\u0027t have stood there so scantily clad if she\u0027d had any idea of what was going on inside his mind. Perhaps she did know, he considered.\\n\\n Could she be trying to get him to make love to her again without actually asking him outright? Alec debated that possibility a long minute, then decided she was simply too naive to realize how easily she could arouse him.\\n\\n He would, of course, enlighten her as soon as they reached his home.\\n\\n \"Alec? Thank you for loaning me your plaid.\"\\n\\n He turned at the sound of her voice and found her staring at his boots.\\n\\n \"It\u0027s yours to keep, Jamie.\"\\n\\n \"A wedding present?\"\\n\\n She wouldn\u0027t look at him. Though her head was bent, he could stil see how red her cheeks were. Her embarrassment was terribly obvious. And vastly amusing. Hel , the woman had been a wildcat in his arms. He had the marks to prove it. Now she acted as if the wrong word might send her into a swoon.\\n\\n \"You may cal it such,\" he announced with a shrug. He took her satchel and turned to secure it on Wildfire\u0027s back.\\n\\n \"I\u0027ve eleven shil ings, Alec.\"\\n\\n She waited for him to turn back to her. He didn\u0027t respond to her announcement. Jamie wasn\u0027t deterred.\\n\\n \"Do you have a priest in your Highlands?\"\\n\\n That question did get his notice. He half turned to look at her. She immediately lowered her gaze. She was getting a bit more courage back, for she now stared at his chest instead of his boots. \"We do have a priest,\" he answered. \"Why do you ask?\"\\n\\n \"I want to use one of my shil ings to buy you an indulgence,\" Jamie announced. She tucked the plaid under her arm and folded her hands together.\\n\\n \"A what?\"\\n\\n \"An indulgence,\" Jamie explained. \"It\u0027s my wedding gift to you.\"\\n\\n \"I see,\" he replied, trying not to laugh. He wanted to ask her if she thought his soul was in need of aid, but the seriousness in her tone made him once again consider her tender feelings.\\n\\n He was going to have to get over this ridiculous affliction, he told himself. Her feelings shouldn\u0027t matter to him at all .\\n\\n \"Does that please you?\" she asked, hoping for a kind word in reply.\\n\\n He shrugged his answer.\\n\\n \"I thought it would be an appropriate gift because you accidental y kil ed a man yesterday. The indulgence will halve your time in purgatory. That\u0027s what Father Charles says.\"\\n\\n \"It wasn\u0027t accidental, Jamie, and you kil ed one man yourself.\"\\n\\n \"I didn\u0027t.\"\\n\\n \"Aye, you did.\"\\n\\n \"You needn\u0027t sound so cheerful about it,\" Jamie muttered. \"And if I did kil the man, well , he needed kil ing, so I don\u0027t have to buy an indulgence for myself.\"\\n\\n \"So it\u0027s only my soul that concerns you?\"\\n\\n Jamie nodded. He didn\u0027t know whether to be insulted or amused. He had to shake his head when he thought about all the coins Father Murdock was going to be col ecting in future if his wife continued to buy him an indulgence every time he kil ed a man. The priest would end up richer than England\u0027s king by year\u0027s end.\\n\\n Alec certainly wasn\u0027t the appreciative sort, Jamie decided. He stil hadn\u0027t offered her a word of gratitude.\\n\\n \"Do you have a blacksmith as well ?\"\\n\\n He nodded, then waited for her next remark. God only knew what was going on inside her mind now.\\n\\n Odd, but he found himself eager to hear what she was thinking. Another affliction, he told himself. He\u0027d have to work on that flaw as well .\\n\\n \"Then I\u0027l use my remaining shil ings to buy you a second wedding gift,\" she said.\\n\\n She saw she\u0027d captured his full attention when she glanced up to see his reaction. \"I\u0027ve thought of just the gift for you. I know you\u0027l be pleased.\"\\n\\n \"And what might that be?\" he asked, finding her enthusiasm as captivating as her smile. He didn\u0027t have the heart to tel her no one used shil ings as payment for anything in the Highlands. He knew she\u0027d find out soon enough.\\n\\n \"A sword.\"\\n\\n She thought he looked quite stunned by her gift. She nodded to let him know she meant what she promised, then turned her gaze to the ground again.\\n\\n He couldn\u0027t believe he\u0027d heard her correctly. \"A what?\"\\n\\n \"A sword, Alec. It\u0027s a good gift, isn\u0027t it? Every warrior should carry one at his side. I noticed you were lacking in such equipment when the outcasts attacked us. I considered that highly unusual, for it did seem to me that all warriors would have need of such a handy weapon. Then I considered the fact that you\u0027re a Scotsman, after all , and mayhap your training didn\u0027t include… Alec, why are you looking at me like that?\"\\n\\n He couldn\u0027t answer her.\\n\\n \"Does my gift please you?\" she asked.\\n\\n She sounded worried now. Alec managed a brisk nod. It was the best he could do.\\n\\n Jamie smiled with relief. \"I knew you\u0027d be pleased,\" she told him.\\n\\n He nodded again, then had to turn away from her.\\n\\n For the first time in his life, Alec Kincaid was speechless.\\n\\n Jamie didn\u0027t seem to notice. \"Daniel carries a sword. I noticed that right away. Perhaps, since the two of you are such good friends, he might take time to instruct you in the proper use of the weapon. I\u0027m told it can be most effective in battle.\"\\n\\n Alec\u0027s forehead dropped to the saddle. Jamie couldn\u0027t see his face because he was turned away from her, but his shoulders were shaking.\\n\\n He was obviously overcome with gratitude.\\n\\n Jamie was feeling proud of herself. She had just offered him a branch of friendship and he had accepted it. Their situation would certainly improve now.\\n\\n In time he just might forget she was English and begin to like her.\\n\\n She walked away from her husband, for she wished to spend a few minutes with Mary before they started out on their journey again. Now that she had figured out how to get along with her husband, she thought she\u0027d share her expertise with her sister. She certainly wasn\u0027t going to mention last night, though.\\n\\n No, Mary would have to find out all about that part of marriage from her own husband. Perhaps, Jamie considered, Mary had already found out.\\n\\n Jamie felt as if she\u0027d just discovered the secrets of the world. Kindness begat kindness. One didn\u0027t bite the hand that was patting one, now, did one?\\n\\n \"Jamie? Come here.\"\\n\\n His command was a little too brisk for her liking, but she held her smile and walked back to Alec\u0027s side.\\n\\n She stared at his chest, waiting to hear what he had to say.\\n\\n Alec tilted her chin up. \"Are you all right, wife? will you be able to ride today?\"\\n\\n She didn\u0027t understand what he was asking. \"I\u0027m fine, Alec, really.\"\\n\\n \"You\u0027re not too sore?\" Alec persisted.\\n\\n The immediate blush told him she now understood what he was asking. \"You aren\u0027t supposed to mention that,\" she whispered.\\n\\n He couldn\u0027t resist. \"Mention what?\"\\n\\n Though it didn\u0027t seem possible to him, her blush intensified. \"My—my being sore,\" she stammered out.\\n\\n \"Jamie, I know I hurt you last night.\"\\n\\n He didn\u0027t sound overly contrite to her. God\u0027s truth, he sounded downright arrogant. \"Yes, you did hurt me,\" she muttered. \"And, yes, I am sore. Are there any other intimate questions you wish to put to me?\"\\n\\n He squeezed her jaw, forcing her to look up at him again. And then he lowered his head and brushed his mouth against hers. It was such a tender kiss that Jamie was all but undone. Her eyes fil ed with tears.\\n\\n Now he\u0027d give her the praise she so desperately needed to hear.\\n\\n \"If I think of any I\u0027l let you know,\" he announced before he let go of her.\\n\\n \"Think of any what?\"\\n\\n A rock could hold fleas longer than she could hold on to a thought. \"Any other intimate questions,\" he said.\\n\\n She stood where she was while Alec swung up into his saddle. \"Come now, Jamie. \u0027Tis time to ride.\"\\n\\n \"But what about Daniel and Mary? Shouldn\u0027t we wait for them?\"\\n\\n \"They left over two hours ago,\" Alec answered.\\n\\n \"They left without us?\" she asked, her voice incredulous.\\n\\n \"They did.\"\\n\\n \"Why didn\u0027t you wake me?\"\\n\\n Alec held his grin. His wife looked thoroughly disgruntled. Wisps of curly hair had already separated from her braid. The strands floated around her face and down the nape of her slender neck.\\n\\n She looked lovely.\\n\\n \"You needed your sleep,\" Alec told her, his voice suddenly gruff.\\n\\n \"They didn\u0027t even say good-bye,\" Jamie said. \"It was a rudeness, don\u0027t you suppose, Alec?\" She walked over to Wildfire\u0027s side, paused to give her horse a whispered word of praise and a good pat, then gained the saddle. She grimaced against the ache that motion caused. \"Are we going to try to catch up with them?\"\\n\\n Alec shook his head. \"They\u0027ve left the north road by now.\"\\n\\n Jamie couldn\u0027t hide her disappointment. \"How long must we travel before we reach your home?\"\\n\\n \"Three more days.\"\\n\\n \"Three?\"\\n\\n She looked disgruntled again. \"Three if we set a brisk pace, wife.\"\\n\\n \"In the opposite direction from my sister?\"\\n\\n Before he could answer her, she whispered, \"I\u0027m never going to see my sister again, am I?\"\\n\\n \"Don\u0027t look so upset, Jamie. Mary\u0027s home is just an hour\u0027s ride from us. You may see her as often as you like.\"\\n\\n His explanation didn\u0027t make sense to her. \"We go for three days in the opposite direction, you tel me, yet Mary will end up only an hour\u0027s ride away when we finally reach your home? I don\u0027t understand, Alec.\\n\\n You do remember where you live, don\u0027t you?\"\\n\\n \"There are clans friendly to Daniel and he must therefore pass through their lands, just as there are clans friendly to me, Jamie. I must also stop to give greeting as laird over the clan Kincaid.\"\\n\\n \"Why couldn\u0027t the four of us—\"\\n\\n \"There are also clans who would give their col ective hide to see me dead.\"\\n\\n She could certainly understand that, she decided. If Alec acted as impatient with the clans as he was now acting with her, he would certainly col ect a lot of enemies. \"And Daniel is friend to some of your enemies?\" she asked.\\n\\n Alec nodded. \"Then why do you cal Daniel your friend? Your enemies should also be his if he\u0027s loyal to you.\"\\n\\n He gave up. He knew she stil didn\u0027t understand. \"Do we have many enemies, Alec?\"\\n\\n \"We?\"\\n\\n \"I\u0027m your wife now, I would remind you,\" she answered. \"For that reason, your enemies are now mine, aren\u0027t they?\"\\n\\n \"Aye, they are,\" he announced.\\n\\n \"Why are you smiling? Do you like having so many enemies?\"\\n\\n \"I\u0027m smiling because I\u0027ve just realized you have the makings of a true Scot,\" he answered. \"This pleases me.\"\\n\\n She gave him a magnificent smile. Alec immediately guessed she was up to mischief. He\u0027d already noticed that when her eyes sparkled the way they were now, she was about to give him a clever retort.\\n\\n He wasn\u0027t disappointed. \"I\u0027l never be a Scot, Alec. But you, sir, well you have the makings of a true English baron. This pleases me.\"\\n\\n He didn\u0027t know why he laughed, for she\u0027d just insulted him mightily, but he did laugh all the same. He shook his head over her comment and his reaction. \"Remember this conversation, Jamie. One day soon, you\u0027l see the error in all your opinions.\"\\n\\n \"Al my opinions, Alec?\" She frowned at him, then added, \"I think I\u0027m beginning to understand why we have so many enemies.\" \\n\\n","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-16.html","bookId":1852,"book":{"id":1852,"title":"The Bride (Lairds\u0027 Fiancees #1)","description":"Storyline: By edict of the king, the mighty Scottish laird Alec Kincaid must take an English bride. His choice was Jamie, youngest daughter of Baron Jamison...a feisty, violet-eyed beauty. Alec ached to touch her, to tame her, to possess her...forever. But Jamie vowed never to surrender to this highland barbarian. \\n He was everything her heart warned against—an arrogant scoundrel whose rough good looks spoke of savage pleasures. And thought Kincaid\u0027s scorching kisses fired her blood, she brazenly resisted him...until one rapturous moment quelled their clash of wills, and something far more dangerous than desire threatened to conquer her senses...\\n","cover":"https://allnovel.net/images/the-bride-lairds-fiancees-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bride-lairds-fiancees-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:12:13 PM"}}
