{"id":79019,"no":2,"title":"Page 2","content":"\"A bit of the way of it, my angel,\" the baron hedged.\\n\\n \"Oh, my God. He spent the coins,\" Alice said with a groan.\\n\\n Jamie raised her hand for silence. \"Mary, finish this explanation before I start shouting.\"\\n\\n \"You must understand, Jamie, how difficult it is for us to be reasonable in the face of this atrocity. I shal , however, endeavor to be strong, and explain it in full to you, for I can see how puzzled you are.\"\\n\\n Mary took her time straightening her shoulders. Jamie felt like shaking her, so thin had her patience worn.\\n\\n She knew it wouldn\u0027t do her cause any good, though, for Mary liked to drag out her comments, no matter what the circumstances. \"And?\" Jamie prodded.\\n\\n \"As I understand this, a barbarian from the Highlands is coming here next week. He\u0027s going to choose one of the three of us—Agnes, Alice, or me—to be his second wife. He kil ed his first wife, you see. You aren\u0027t included in this, Jamie. Papa said we were the only ones named in the king\u0027s letter.\"\\n\\n \"I\u0027m certain he didn\u0027t kil his first wife,\" Alice said. \"Cook says the woman kil ed herself.\" Alice crossed herself.\\n\\n Agnes shook her head. \"No. I believe the woman was murdered. Surely she wouldn\u0027t kil herself and spend eternity in hel , no matter how terrible her husband was to her.\"\\n\\n \"Could she have died by accident, do you suppose?\" Alice suggested.\\n\\n \"The Scots are known to be clumsy,\" Mary said with a shrug of her shoulders.\\n\\n \"And you\u0027re known to believe every bit of gossip you hear,\" Jamie interjected in a hard voice \"Explain what you mean by \u0027choosing,\u0027 Mary,\" she added, trying to keep her expression from showing how horrified she was.\\n\\n \"Choose for his bride, of course. Haven\u0027t you been listening, Jamie? We have no say in the matter, and our own contracts for marriages are all set aside until the selection has been made.\"\\n\\n \"We\u0027re to be paraded in front of the monster like horses,\" Agnes whimpered.\\n\\n \"Oh, I almost forgot,\" Mary rushed out. \"The Scottish king, Edgar, is also in favor of this marriage, Jamie.\\n\\n Papa said so.\"\\n\\n \"So the lord might only be doing the bidding of his king and might not want the marriage either,\" Alice said.\\n\\n \"Oh, Lord, I hadn\u0027t thought of that,\" Agnes blurted out. \"If he doesn\u0027t want to be wed, he\u0027l probably kil his bride before he even reaches his home, wherever in God\u0027s name that is.\"\\n\\n \"Agnes, will you calm yourself? You\u0027re screaming again,\" Jamie muttered. \"You\u0027re going to pul your hair out of your scalp if you keep tugging on it so. Besides, you cannot know if you speak truth or fancy about the circumstances of his first wife\u0027s death.\"\\n\\n \"His name is Kincaid, Jamie, and he is a murderer. Papa said he beat his first wife to death,\" Agnes advised.\\n\\n \"I said no such thing,\" the baron shouted. \"I merely suggested—\"\\n\\n \"Emmett told us he threw his bride over a cliff,\" Mary interjected. She drummed her fingertips on the tabletop while she waited for Jamie\u0027s reaction.\\n\\n \"Emmett\u0027s only a groom and a lazy one at that,\" Jamie returned. \"Why would you be listening to his stories?\"\\n\\n Jamie took a deep breath, hoping to calm her queasy stomach. Although she fought against it, her sisters\u0027\\n\\n fear was becoming contagious. She could feel a shiver pass down her spine. She knew better than to voice her concern, though. Bedlam would erupt again.\\n\\n Her trusting sisters were all staring at her with such hopeful, expectant looks on their faces. They\u0027d just put the problem in her lap and now waited for her to come up with a solution.\\n\\n Jamie didn\u0027t want to fail them. \"Papa? Is there some way you can placate our king? Can you stil send the taxes to him, perhaps adding a bit more to soothe his temper?\"\\n\\n Baron Jamison shook his head. \"I\u0027d have to col ect the whole tax all over again. You know as well as I that the serfs\u0027 backs are near to broken with their own troubles. The barley crop wasn\u0027t good, either. Nay, Jamie, I cannot demand again.\"\\n\\n Jamie nodded. She tried to hide her disappointment. She\u0027d hoped there was stil a little of the col ection left, but her father\u0027s answer confirmed her fear that it was all gone.\\n\\n \"Emmett said Papa used up all the coins,\" Mary whispered.\\n\\n \"Emmett is just like an old woman carrying tales,\" Jamie countered.\\n\\n \"Aye,\" their father agreed. \"He\u0027s always been one to taint the truth. Pay no attention to his rantings,\" he added.\\n\\n \"Papa? Why was I excluded?\" Jamie asked. \"Did the king forget you had four daughters?\"\\n\\n \"No, no,\" the baron rushed out. He hastily turned his gaze from his daughter to his goblet, for he feared his youngest would see the truth in his eyes.\\n\\n King Henry hadn\u0027t excluded Jamie. He\u0027d used the word \"daughters\" in his message. Baron Jamison, knowing he\u0027d never be able to get along without his youngest taking care of him, had made the decision himself to exclude her. He thought his plan was most cunning.\\n\\n \"The king named only Maudie\u0027s daughters,\" . he announced.\\n\\n \"Well, that certainly doesn\u0027t make any sense to me,\" Agnes remarked between sniffles.\\n\\n \"Perhaps it\u0027s because Jamie\u0027s the youngest,\" Mary suggested. She shrugged, then added, \"Who can know what\u0027s in our king\u0027s mind? Just be thankful, Jamie, that you weren\u0027t included in his order. Why, if you were chosen you couldn\u0027t marry your Andrew.\"\\n\\n \"That\u0027s the reason,\" Agnes interjected. \"Baron Andrew is so powerful and well liked. He told us so. He must have swayed our king\u0027s mind. Everyone knows how smitten Andrew is with you, Jamie.\"\\n\\n \"That could be the reason,\" Jamie whispered. \"If Andrew is as powerful as he says he is.\"\\n\\n \"I don\u0027t think Jamie really wants to marry Andrew,\" Mary told the twins. \"You needn\u0027t frown at me, Jamie. I don\u0027t think you even like him very much.\"\\n\\n \"Papa likes him,\" Agnes said. She gave her father another glare before adding, \"I wager it\u0027s because Andrew has promised to live here so Jamie can continue to slave for—\"\\n\\n \"Now, Agnes, please don\u0027t start that again,\" Jamie begged.\\n\\n \"Why you think it\u0027s sinful of me to want to keep Jamie here after her marriage is beyond me,\" the baron muttered.\\n\\n \"Everything seems to be beyond you,\" Mary murmured.\\n\\n \"Watch what you say, young lady,\" he returned. \"I\u0027l not all ow you to speak so disrespectful like in front of me.\"\\n\\n \"I know the true reason,\" Alice said, \"and I\u0027m going to tel Jamie. Andrew paid Papa your dowry, sister, and he—\"\\n\\n \"What say you?\" Jamie shouted. She nearly leapt out of her chair. \"Alice, you\u0027re mistaken. Knights do not give a dowry. Papa, you didn\u0027t take any coins from Andrew, did you?\"\\n\\n Baron Jamison didn\u0027t answer his daughter. He seemed quite taken by the task of swirling his ale in his cup.\\n\\n His silence was damning.\\n\\n \"Oh, God,\" Mary whispered. \"Alice, do you realize what you\u0027re suggesting? If what you\u0027re tel ing us is true, then our father has all but sold Jamie to Baron Andrew.\"\\n\\n \"Now, Mary, don\u0027t be getting Jamie riled up,\" their papa advised.\\n\\n \"I didn\u0027t say he sold Jamie to Andrew,\" Alice said.\\n\\n \"You did so,\" Mary countered.\\n\\n \"I saw Andrew give Papa a cloth bag full of gold coins.\"\\n\\n Jamie\u0027s head was pounding. She was determined to get to the bottom of this coin exchange, no matter how long it took or how much her head hurt.\\n\\n Sold indeed! The very idea made her stomach turn. \"Papa, you didn\u0027t really take coins for me, did you?\" she asked. She couldn\u0027t keep the fear out of her tone.\\n\\n \"No, of course not, my angel.\"\\n\\n \"Papa? Do you know you cal us your angels only when you\u0027ve done something shameful?\" Agnes wailed. \"God\u0027s truth, I\u0027m beginning to hate that endearment.\"\\n\\n \"I saw Andrew give Papa the coins, I tel you,\" Alice shouted.\\n\\n \"I\u0027m just wondering how you could have known what was inside the cloth bag,\" Mary argued. \"Do you have the sight, do you suppose?\"\\n\\n \"He dropped the bag,\" Alice snapped. \"Some of the coins fel out.\"\\n\\n \"It was just a little loan,\" their father bel owed to get their attention. \"Now hush this talk about sel ing my baby.\"\\n\\n Jamie\u0027s shoulders slumped with relief. \"There, you see, Alice? It was just a loan Andrew was giving Papa. You had me worrying for naught. Can we return to our original problem now?\"\\n\\n \"Papa\u0027s back to looking guilty again,\" Mary advised.\\n\\n \"Of course Papa looks guilty,\" Jamie said. \"You needn\u0027t rub salt in his wound. I\u0027m sure he\u0027s sorry enough as it is.\"\\n\\n Baron Jamison smiled at his daughter for defending him. \"That\u0027s my good little angel,\" he praised. \"Now, then, Jamie, I want you to stay hidden when the Scotsmen arrive. No sense tempting them with what they can\u0027t be having.\"\\n\\n The baron didn\u0027t realize his blunder until Alice seized on his remark. \"Scotsmen, Papa? You speak of more than one. Do you mean to tel us this demon named Kincaid is bringing others with him?\"\\n\\n \"He\u0027s probably just bringing his family to witness the marriage,\" Agnes suggested to her twin.\\n\\n \"Is that the full of it?\" Jamie asked her father. She tried to concentrate on the problem at hand, but her thoughts kept returning to the gold coins. Why would her father accept a loan from Andrew?\\n\\n The baron took his time answering.\\n\\n \"Papa, I have the feeling there\u0027s more you\u0027d like to tel us,\" Jamie coaxed.\\n\\n \"Good God, you mean there\u0027s more?\" Mary bel owed.\\n\\n \"Papa, what else are you keeping from us?\" Alice shouted.\\n\\n \"Spit it out, Papa,\" Agnes demanded.\\n\\n Jamie motioned for silence again. The urge to grab hold of her father\u0027s gray tunic and shake him into speaking nearly overwhelmed her. She could feel her temper boiling. \"May I read this missive from our king?\" she asked.\\n\\n \"We really should have learned how to read and scribble when Jamie\u0027s mama began her instructions,\" Agnes remarked with a weary sigh.\\n\\n \"Nonsense,\" Agnes scoffed. \"No gentle lady needs such instruction. What we really should have done was learn how to speak that God-awful Gaelic language like Jamie,\" she announced. \"You know I mean no offense, Jamie,\" she hastened to add when she caught her sister\u0027s frown. \" \u0027Tis the truth I wish I\u0027d learned it with you. Beak did offer to teach all of us,\" she ended.\\n\\n \"It gave our stable master pleasure to teach me,\" Jamie said. \"And Mama was amused. She was bedridden for such a long while before she died.\"\\n\\n \"Do you mean to tel me this monster from the Highlands cannot speak our language?\" Agnes whimpered before bursting into tears.\\n\\n Jamie might have been able to control her anger if Agnes hadn\u0027t started weeping. \"What difference will it make, Agnes?\" she blurted out. \"The man\u0027s going to kil his bride, not talk to her.\"\\n\\n \"So you believe the rumor is true?\" Mary gasped.\\n\\n \"No,\" Jamie answered, immediately contrite. \"I was just jesting.\" She closed her eyes, said a quick prayer for patience, then turned to Agnes. \"It was most unkind of me to get you upset, sister, and I do apologize.\"\\n\\n \"I would certainly hope so,\" Agnes cried.\\n\\n \"Papa, let Jamie look at this missive,\" Mary suddenly demanded.\\n\\n \"No,\" the baron blurted out. He immediately softened his tone, lest his angels become suspicious of his true motives. \"You needn\u0027t bother, Jamie.\\n\\n \u0027Tis simple to tel . There be two Scots coming week next, and two brides going home with them.\"\\n\\n Needless to say, the baron\u0027s daughters didn\u0027t take this added news well . The twins started howling with as much indignation as sleeping babies who\u0027d been pinched awake.\\n\\n \"I\u0027m going to run away,\" Mary shouted.\\n\\n \"It would seem to me,\" Jamie began in a voice meant to penetrate the noise, \"that we must immediately form a plan to dissuade your suitors.\"\\n\\n Agnes stopped bel owing in mid-scream. \"Plan? What are you thinking?\"\\n\\n \"I have thought of a deceitful plan and I\u0027m almost afraid to mention it, but your welfare is at issue and so I\u0027l tel you that if I were the one doing the selecting, I\u0027d certainly stay away from any contender who was… afflicted in some way.\"\\n\\n A slow grin transformed Mary\u0027s face. She was always the quickest to catch Jamie\u0027s thoughts, especial y when they were of a devious nature. \"Or so ugly as to be painful to look upon,\" she said with a nod. Her brown eyes sparkled with mischief. \"Agnes, you and Alice may be afflicted. I\u0027m going to be fat and ugly.\"\\n\\n \"Afflicted?\" Alice asked, clearly puzzled. \"Do you understand what she means, Agnes?\"\\n\\n Agnes started to laugh. Her nose was red from rubbing and her cheeks were raw from her tears, yet when she smiled, she looked very pretty. \"A dread disease, I do believe. We must eat berries, sister. The rash will only last a few hours, so we must time this well .\"\\n\\n \"Now I see,\" Alice said. \"We\u0027l make the dul -witted Scots think we always have terrible lumps on our faces.\"\\n\\n \"I shal drool,\" Agnes announced with a haughty nod, \"and scratch until they think I\u0027m infested with vile creatures.\"\\n\\n The four sisters laughed over that picture. Papa took heart. He smiled at his angels. \"There. Do you see, now? I told you it would work out.\" He hadn\u0027t said any such thing, of course, but that fact didn\u0027t bother him at all . \"I shal go and have my morning lie-down while you continue with your plans.\" Baron Jamison couldn\u0027t leave the hall fast enough.\\n\\n \"These Scots might not care what you look like,\" Jamie advised, worrying now that she might have given her sisters false hope.\\n\\n \"We can only pray they\u0027re shal ow,\" Mary returned.\\n\\n \"Is deceiving them a sin?\" Alice asked.\\n\\n \"Of course,\" Mary answered.\\n\\n \"We\u0027d best not confess to Father Charles,\" Agnes whispered. \"He\u0027l give us another month of penance.\\n\\n Besides, we\u0027re deceiving Scots, if you\u0027l remember. God will certainly understand.\"\\n\\n Jamie left her sisters and went to talk to the stable master. Beak, as he was affectionately called by his friends because of his large hawklike nose, was an elderly man who had long ago become Jamie\u0027s confidant. She trusted him completely. He never carried her thoughts to others. He was wise in his years, too. He\u0027d taught her all the skil s he thought she\u0027d need. In truth, she was more of a son than daughter to him. \\n\\n","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-2.html","bookId":1852,"book":{"id":1852,"title":"The Bride (Lairds\u0027 Fiancees #1)","description":"Storyline: By edict of the king, the mighty Scottish laird Alec Kincaid must take an English bride. His choice was Jamie, youngest daughter of Baron Jamison...a feisty, violet-eyed beauty. Alec ached to touch her, to tame her, to possess her...forever. But Jamie vowed never to surrender to this highland barbarian. \\n He was everything her heart warned against—an arrogant scoundrel whose rough good looks spoke of savage pleasures. And thought Kincaid\u0027s scorching kisses fired her blood, she brazenly resisted him...until one rapturous moment quelled their clash of wills, and something far more dangerous than desire threatened to conquer her senses...\\n","cover":"https://allnovel.net/images/the-bride-lairds-fiancees-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bride-lairds-fiancees-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:12:13 PM"}}
