{"id":79021,"no":4,"title":"Page 4","content":"\"My name\u0027s Beak and I\u0027m stable master here,\" he finally blurted out, hoping to give the impression there were other stablemen about so they\u0027d think him important enough to converse with. \"You\u0027re early,\" he added with a nervous nod. \"Else the family would be lined up outside in their finery waiting to give you a proper greeting.\" Beak paused for air, then waited for a reply to his remarks. His wait proved to be in vain and his eagerness quickly evaporated. He soon began to feel as important as a flea about to be swatted. It was unnerving, the way the two giants continued to stare down at him. The stable master decided to try again. \"I\u0027l see to your mounts, milords, while you make your presence known to the household.\" \"We take care of our horses, old man.\" It was the disciple who\u0027d made that statement. His voice wasn\u0027t particularly pleasant, either. Beak nodded, then backed up several spaces to get out of their way. He watched the lords remove their saddles, listened as each spoke a word of praise in Gaelic to his mount. Their animals were handsome stal ions, one brown, the other black, and Beak took notice that neither animal had a flaw… or a strap mark on its hind flanks. A glimmer of hope was rekindled inside Beak\u0027s mind. He\u0027d learned a long time ago that a man\u0027s true character could be discovered by the way he treated his mama and his horse. Baron Andrew\u0027s mount was riddled with deep lashings and if that wasn\u0027t proof enough that his theory was true, Beak didn\u0027t know what was. \"Have you left your soldiers waiting outside the wall s, then?\" Beak asked, speaking in Gaelic so they\u0027d know he was friend, not foe. The disciple looked pleased with his effort, for he actually smiled at the stable master. \"We ride alone.\" \"Al the way from London?\" Beak asked, unable to keep the surprise out of his voice. \"Aye,\" the lord answered. \"With no one seeing to your backsides?\" \"We don\u0027t need anyone else seeing to our protection,\" the lord answered. \"That\u0027s an English inclination, not ours. Isn\u0027t that right, Kincaid?\" The devil didn\u0027t bother to answer. \"By what names are you cal ed, milords?\" Beak asked. It was a bold question he dared to ask, but the warriors weren\u0027t scowling at him any longer and that fact had given him courage. The disciple turned the topic instead of answering. \"You speak our language well , Beak. Are you Scottish, then?\" Beak\u0027s shoulders straightened with pride. \"I am, with red hair afore it turned gray on me head.\" \"My name\u0027s Daniel, of the clan Ferguson. He\u0027s called Alec by those who know him well enough,\" he added with a nod toward the other warrior. \"Alec is chieftain over the clan Kincaid.\" Beak made a formal bow. \"It\u0027s my humble pleasure to make your acquaintance,\" he announced. \"I haven\u0027t spoken to a full -blooded Scotsman in so many years I\u0027ve forgotten how to act,\" he added with a grin. \"Forgot how big the Highlanders are, too. You gave me quite a start when I first spotted you, you did.\" He opened the doors to two clean stal s adjacent to the entrance, saw to the feeding buckets, the water as well , and then tried to engage the two men in further conversation. \"\u0027Tis the truth you\u0027re three days early,\" he said. \"I\u0027m thinking to myself the household will be in an uproar.\" Neither lord commented on that remark, but Beak could tel by the way they glanced at each other that they did not particularly care if they caused any disruption. \"Who were you expecting if not us?\" Lord Daniel asked, frowning over his question. Beak was puzzled by the question. \"Expecting? No one, leastwise not for three more days.\" \"The drawbridge was down, man, and not a single watch in sight. Surely—\" \"Ah, that,\" Beak said with a long-drawn-out sigh. \"Wel , it\u0027s true the bridge is down most of the time and there never is a watch posted. You see now, Baron Jamison is a mite forgetful.\" When he saw the incredulous looks on the warriors\u0027 faces, Beak thought he really should try to give his master some defense. \"Being out here in the middle of nowheres like we are, we\u0027re never bothered. The baron says he doesn\u0027t have much of value to be snatched away,\" he said with a shrug. \"And no one\u0027s ever come inside without a proper invite.\" \"Nothing of value?\" Alec Kincaid had finally spoken. His voice had been soft, yet surprisingly forceful at the same time. And when he turned to give Beak his full attention, the old man\u0027s knees started shaking again. \"He does have daughters, doesn\u0027t he?\" His scowl could set a fire blazing, Beak decided. He couldn\u0027t meet that gaze for long and had to stare at the tips of his boots in order to concentrate on the conversation. \"He has daughters all right, more in number than he\u0027l be wanting to admit to having, too.\" \"Yet he doesn\u0027t protect them?\" Daniel asked. He shook his head in disbelief, then turned to Alec and said, \"Have you ever heard the like?\" \"Nay, I haven\u0027t.\" \"What kind of man is this Baron Jamison?\" Daniel asked Beak. The Kincaid answered his question. \"An Englishman, Daniel.\" \"Ah, that does explain it, doesn\u0027t it?\" Daniel remarked dryly. \"Tel me this, Beak. Are the baron\u0027s daughters so unsightly there be no need for protection? Are they without virtue?\" \"They\u0027re all pretty,\" Beak answered. \"And every single one of them as pure as the day she was born. Strike me dead if that ain\u0027t the truth. \u0027Tis their father who shirks his duty,\" Beak added with a scowl. \"How many daughters are there?\" Daniel asked. \"We never bothered to ask your king.\" \"You\u0027l be seeing three,\" Beak muttered. He was about to expound on his remark when both warriors turned and started for the door. It was now or never, Beak determined. He took a deep, settling breath, then called out, \"Are you both mighty lairds over your clans or is one more powerful than the other?\" Alec caught the fear in the stable master\u0027s voice. It puzzled him enough to turn back to the man. \"What is the reason for such an impertinent question?\" \"I mean no disrespect,\" Beak rushed out, \"and I\u0027ve good honest reasons for my question. I know I\u0027m stepping above meself; I\u0027m meaning to interfere. You see, someone has to look after her interests and I\u0027m the only one who would be caring enough.\" Daniel frowned over the odd explanation. It made little sense to him. \"I\u0027l become laird over my clan by right of tanistry in another year or two\u0027s time,\" he answered. \"The Kincaid is already chieftain over his own clan. There, does that answer your question, Beak?\" \"Will he have first choice in this bride-choosing then?\" Beak asked Daniel. \"He will .\" \"And he\u0027s more powerful than you?\" the stable master asked. Daniel nodded. \"For the moment,\" he announced with a grin. \"Beak, have you never heard of the Kincaid warriors?\" \"Aye, I\u0027ve heard all sorts of stories.\" The grimness in his tone made Daniel smile. The old man was obviously frightened of Alec. \"I take it some of the stories you\u0027ve heard include descriptions of Alec\u0027s methods in battle?\" \"They have. I shouldn\u0027t be believing them,\" Beak added with a hasty glance in Alec\u0027s direction. \"They were told by Englishmen, you see, and I\u0027m sure they exaggerated the laird\u0027s… ruthlessness.\" Daniel grinned at Alec before responding to that remark. \"Oh, I doubt the stories were exaggerated in the least, Beak. Did they say he never showed mercy? Compassion?\" \"Aye.\" \"Best believe the stories then, Beak, for they\u0027re true. Aren\u0027t they, Alec?\" \"Aye, they are,\" Alec agreed, his tone hard. \"Beak,\" Daniel continued, \"your questions amuse me, though I\u0027ve no idea what it is you\u0027re really wanting to find out. Is there another question you\u0027d like to put to us?\" Beak timidly nodded. He turned to stare up at Alec now. A long, silent moment passed while he tried to think of a fitting way to explain about his Jamie without being downright disloyal. Alec could see the fear in the old man\u0027s eyes. He walked back over to stand directly in front of the stable master. \"What is it you wish to say to me?\" Beak decided the Kincaid\u0027s intuition was as unsettling as his size and voice. His own voice trembled when he blurted out his question. \"Have you ever mistreated a woman in all your days, Alec Kincaid?\" It was obvious the laird didn\u0027t care for that question. His expression turned as fierce as a bolt of lightning. Beak took an instinctive step back and had to steady himself by bracing his hand against the wall . \"I\u0027ve been patient with you because you\u0027re Scots, old man, but if you ever put such a foul question to me again, I swear it will be your last.\" Beak nodded. \"I need to know, inside my heart, because I\u0027m set on giving you a great gift and I have to know you\u0027l recognize its value, my lord.\" \"He speaks in riddles,\" Daniel stated. He walked over to stand next to Alec. His frown, Beak noted, was almost as fierce as the Kincaid\u0027s. \"You\u0027ve been in England too long, old man, asking such obscene questions.\" \"I know I ain\u0027t making a spit of sense,\" Beak admitted in a forlorn tone. \"Yet if I blurt out the full of it, then it would make me disloyal in my mistress\u0027s eyes. I can\u0027t have that,\" he added. \"She\u0027d have my hide, she would.\" \"You admit to being afraid of a woman?\" Daniel asked. Beak ignored the astonished look on the man\u0027s face, ignored the laughter in his voice, too. \"I\u0027m afeared of no woman. I just don\u0027t want to break my word,\" he explained. \"The lass means the world to me. I ain\u0027t ashamed to admit I love her like a daughter.\" Beak valiantly tried to meet Alec\u0027s hard stare. It was a pitiful effort, though. Oh, how he wished the other warrior were the more powerful of the two. At least the one called Daniel smiled on occasion. \"Are you strong enough to protect what belongs to you?\" he asked the Kincaid, wanting to get to the heart of the matter as soon as possible. \"I am.\" \"Baron Andrew will cal forth many soldiers. He\u0027l come after the gift I\u0027m giving you. He\u0027s also called friend by England\u0027s King Henry,\" Beak added, wobbling his eyebrows to emphasize that fact. The Kincaid didn\u0027t seem impressed with that statement. He shrugged with indifference. \"It would matter not to me.\" \"Who is this Baron Andrew?\" Daniel asked. \"An Englishman,\" Beak answered. \"Al the better,\" Alec said. \"If I decide to take this gift you\u0027re offering, I\u0027l welcome a chal enge from an Englishman. He\u0027l be no threat to me.\" Beak visibly relaxed. \"No it\u0027s about it,\" he boasted. \"Is your gift a horse perchance?\" Daniel asked, shaking his head in confusion. He stil didn\u0027t understand what the stable master was trying to tel Alec. The Kincaid understood. \"It isn\u0027t a horse, Daniel.\" Beak grinned. The man was proving to be as astute as the best of them. \"Once you see my gift, Laird Kincaid, you\u0027l be set on having it, all right,\" he boasted. \"Are you partial to blue eyes, milord?\" \"Many have blue eyes in the Highlands, Beak,\" Daniel interjected. \"Well, now,\" Beak drawled out, \"there\u0027s blue and then there\u0027s blue.\" He let out a loud chuckle, then cleared his throat and continued, \"Now to me riddle, Laird Kincaid. Baron Jamison treats his daughters just like his horses and that\u0027s a fact. Only have a look around you and you\u0027l get my meaning soon enough. The pretty little ladies in these three stal s are for the baron\u0027s daughters, right there for anyone to see. But if you\u0027l walk down this long corridor and turn the bend, you\u0027l see another stal hidden away in the far corner by the side door. It\u0027s separated from the others. That\u0027s where the baron keeps his beauty, a magnificent white pretty just waiting for a proper mating. Humor this daft old man, for I\u0027m Scots if you\u0027ll remember, and take a good look at the horse,\" Beak urged, motioning the warriors forward. \"It\u0027s worth your time especial y, Laird Kincaid.\" \"He\u0027s caught my curiosity,\" Daniel told Alec. Both men followed the stable master. Beak\u0027s manner changed considerably when they reached the stal . He poked a piece of straw between his front teeth, leaned against the wall with one foot casual y crossed over the other, and proceeded to watch the high-strung fil y put up a grand fuss when Alec reached out to stroke her. The side door was cracked open, letting the sun filter inside to cast a soft banner of light on the horse\u0027s silver mane. The proud beauty wouldn\u0027t settle down for a good long while, but in the end, the warrior wooed her into showing a hint of her gentle nature. Beak only hoped the laird would gentle Jamie with just as much patience. \"She\u0027s a beauty, all right,\" Daniel remarked. \"Stil half wild,\" Alec interjected. He actually smiled then, and Beak concluded being half wild wasn\u0027t a flaw in his mind. \"Her name\u0027s Wildfire and she\u0027s deserving of that name to be sure. The baron can\u0027t get near her. He gave her to his youngest daughter when it became evident she was the only one who could seat the horse.\" Alec smiled again—a miracle, that—when the mare tried to bite his hand. \"She\u0027s feisty. With a good stal ion, the offspring will be sound—spirited, too.\" Beak gave Alec another thorough inspection. When he met the warrior\u0027s gaze again, he was grinning. \"That\u0027s exactly what I\u0027m thinking about my gift to you.\" Beak pul ed away from the wall , affected an important air, then said, \"As I was tel ing you, Laird Kincaid, the baron treats his daughters just like his horses. Three right up front for anyone to see…\" He vowed he wasn\u0027t going to say another word. It was up to the Scotsman to figure the rest of the riddle. \"Beak? Are you inside?\" The interruption came from Lady Jamie. Beak was so startled he almost swal owed the piece of straw he was chewing on. \"That be the youngest of the baron\u0027s daughters,\" he told the two warriors. \"And there\u0027s the side door,\" he added in a soft whisper. \"If you\u0027re wanting to leave now, that\u0027s the quickest way to the main house. I\u0027d best see what my Jamie is wanting.\"","sourceLink":"https://allnovel.net/the-bride-lairds-fiancees-1/page-4.html","bookId":1852,"book":{"id":1852,"title":"The Bride (Lairds\u0027 Fiancees #1)","description":"Storyline: By edict of the king, the mighty Scottish laird Alec Kincaid must take an English bride. His choice was Jamie, youngest daughter of Baron Jamison...a feisty, violet-eyed beauty. Alec ached to touch her, to tame her, to possess her...forever. But Jamie vowed never to surrender to this highland barbarian. He was everything her heart warned against—an arrogant scoundrel whose rough good looks spoke of savage pleasures. And thought Kincaid\u0027s scorching kisses fired her blood, she brazenly resisted him...until one rapturous moment quelled their clash of wills, and something far more dangerous than desire threatened to conquer her senses...","cover":"https://allnovel.net/images/the-bride-lairds-fiancees-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-bride-lairds-fiancees-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:12:13 PM"}}
