{"id":101651,"no":2,"title":"Page 2","content":"\"But we must insist upon working together.” Mercy crossed her arms as if to say she was making her stand. \"Remember what a great job we did last year? You can’t let a golden opportunity like this slip through your fingers.”\\n\\n \"Yes, I can.” Gabriel didn’t feel he could mince words. Weeks after their last venture to earth, he had been left to answer for their tomfoolery.\\n\\n Goodness and Mercy bounced a shocked look off each other, then glared at him. \"You can?”\\n\\n \"Karen Woods?” The softly spoken question came from Shirley, who was leaning over the Book of Prayer, her finger poised at Gabriel’s most recent entry.\\n\\n \"She’s a troubled young girl,” Gabriel supplied, his heart heavy over the twelve-year-old’s situation. It would take a prayer ambassador with far more experience than Shirley to work on this request.\\n\\n \"Her parents are divorced, right?”\\n\\n Gabriel nodded.\\n\\n \"Karen loves them both very much,” Shirley said under her breath. \"Sometimes the girl feels like she’s caught in a vicious tug-of-war between the two. From what I understand, she hasn’t seen her father in over a year.”\\n\\n \"That’s true.” Gabriel was beginning to understand. Shirley intuitively knew this information because an Authority much higher than his own had deemed it so. It seemed he was being overruled.\\n\\n \"Her father feels it’s easier on everyone if he doesn’t see Karen as often. He loves her, too, but he hates his ex-wife, and every time he picks up his daughter she finds an excuse to fight with him. Or a reason to report him to her attorney. Maureen Woods has worked overtime to make his life hell.”\\n\\n \"Yes.”\\n\\n \"I want to help,” Shirley insisted. \"Please let me.”\\n\\n \"This isn’t an easy request,” Gabriel felt obliged to remind the prayer ambassador.\\n\\n \"I’m aware of that.”\\n\\n \"We’ll all help,” Goodness and Mercy chimed in.\\n\\n Gabriel was worried about the three of them doing exactly that and feared it wasn’t help they’d be lending. \"No, you won’t,” he said more heatedly than he intended.\\n\\n The two leaped back a step at his sharp tone.\\n\\n Gabriel could feel himself weakening. He was well aware that the oldest of the three angles was by far the most emotionally mature. Yet she had the least experience. But Goodness and Mercy? Again?\\n\\n \"I do wish you’d reconsider,” Shirley pleaded softly.\\n\\n \"Oh, please do.” Two pairs of blue eyes fluttered beguilingly at him. Goodness and Mercy folded their hands with a look as unsullied as grace itself.\\n\\n Gabriel didn’t know what it was about this trio that they wove such tight tentacles around his heart. He was an archangel and generally not given to flagrant displays of favoritism.\\n\\n \"Before either of us makes a decision, why don’t we meet Karen’s mother?”\\n\\n \"Excellent idea,” Goodness said, hurrying to his side.\\n\\n \"I should have thought of that myself.” Faster than a heartbeat, Mercy was there as well.\\n\\n \"I was referring to Shirley and me.” Gabriel stared at the two, although in reality their enthusiasm amused him greatly.\\n\\n \"Of course we meant to include Shirley,” Goodness said with a weak laugh.\\n\\n \"That was understood,” Mercy added.\\n\\n Gabriel freed himself of the two. \"Shirley and me alone,” he clarified, coughing in an effort to disguise a smile.\\n\\n \"Oh.” Goodness’s shoulders sagged with disappointment.\\n\\n \"Oh.” Mercy slowly lowered herself onto a vacant chair.\\n\\n \"Go on without us,” Goodness said as though Shirley were about to step into the last available place in a lifeboat leaving a sinking ship. \"We’ll wait here.”\\n\\n \"Stay out of trouble,” Gabriel advised.\\n\\n \"What could we possibly do to cause trouble?” Mercy questioned.\\n\\n Gabriel didn’t want to know the answer to that.\\n\\n Maureen Woods lugged the heavy suitcase from the trunk of her car to the sidewalk. She stopped on her way into the small rental house to pick up the mail. After tucking a few bills and fliers under her arm, she pulled the newspaper free from its box and made her way to the front steps.\\n\\n The door opened before she could fit the key into the lock, and Maureen brightened when she saw her daughter. \"Hi, pumpkin face.”\\n\\n \"Hi. How was the trip?” Karen held open the screen door for her mother.\\n\\n \"All right.” Maureen stepped inside. She slipped out of her business suit jacket and laid it over the back of the couch before removing her shoes. It felt heavenly to be out of her pumps, which were still new enough to pinch her toes.\\n\\n \"I’ll get your suitcase for you,” Karen said eagerly.\\n\\n Maureen appreciated the thought but knew it was too much for her daughter. \"Thanks, honey, but it’s too heavy.”\\n\\n \"No, it isn’t,” Karen insisted. \"See?” With both hands and all her might, the twelve-year-old managed to lift it a scant inch off the worn carpet.\\n\\n \"Karen, put it down, or you’ll hurt yourself,” Maureen insisted as she absently sorted through the mail. She paused when she saw the bill for her attorney, cringed, then tossed the mail on the counter without opening any of it. \"How was your night with Grandma and Grandpa?”\\n\\n \"Fine.”\\n\\n \"What did you have for dinner?”\\n\\n Karen brightened a bit. \"Swedish meatballs. My favorite.”\\n\\n \"Grandma’s going to spoil you,” Maureen warned, grateful to her parents for keeping Karen for her when she traveled.\\n\\n Karen laughed. \"With apple strudel for dessert, and I ate three whole pieces.”\\n\\n Maureen gasped. \"You’ll get fat.”\\n\\n \"I won’t because I ran it off on Grandpa’s treadmill. I can go faster than he can.”\\n\\n \"Yes, but then you haven’t had two open-heart surgeries, either.”\\n\\n \"If you’re worried about me not getting enough exercise, I have a solution.”\\n\\n Maureen knew from the sound of her daughter’s voice that she wasn’t going to like this. \"Oh, what’s that?”\\n\\n \"I could always take up horseback riding.”\\n\\n \"Karen,” Maureen groaned. It seemed her daughter brought the subject into every conversation. \"We’ve been through this a hundred times. We can’t afford a horse.”\\n\\n \"That’s where you’re wrong.” It was as though Karen had been waiting impatiently for this very argument. She disappeared into her bedroom and returned breathless a moment later. \"This is the address I got from the library. Did you know you can get a horse free from the United States government?”\\n\\n \"Karen—”\\n\\n \"Mom, it’s true. All you need to do is read this brochure. I wrote away to Utah for all the information. It should come any day now, but I had the lady at the library make me a copy of this pamphlet so you’d see I wasn’t making this all up.”\\n\\n \"Honey, think this through. Where would we possibly put a horse?”\\n\\n \"In a stable,” Karen answered as if that much were obvious, or should have been.\\n\\n \"Where in the name of heaven would we find a stable?”\\n\\n Karen elevated her hands until they were level with her shoulders. \"Don’t sweat the small stuff, Mom.”\\n\\n \"The small stuff? I can barely feed the two of us on what I make. In addition to everything else, I can’t afford to feed a horse.”\\n\\n \"But I’d find a job, Mom. I’d do anything I could to earn money. I bet even Dad would be willing to help pay for my horse.”\\n\\n Maureen’s face hardened at the mention of Brain. \"No,” she said sternly. \"I won’t allow you to bring your father into this. As for getting extra money from him, sweetheart, you’re a dreamer. I’ve had to fight for every penny he’s ever given us. He forgot about you the minute he walked out that door.”\\n\\n \"That’s not true.”\\n\\n \"I don’t want to argue with you about your father, Karen. If anyone should know how worthless that man is, it’s me. Now enough about this stupid horse. I’m tired, and I don’t want to argue.”\\n\\n Karen looked at her mother as if she’d been struck. \"Will you read the pamphlet?” she asked in a tiny, hurt voice. \"Please?”\\n\\n \"All right,” Maureen agreed, already regretting her outburst. \"I’m sorry, sweetheart. I didn’t mean to blow up like that. It’s just not a good idea to hit me with a bunch of stuff when I first get home.”\\n\\n \"I’m sorry.”\\n\\n Maureen felt worse than ever. \"It was my fault,” she said, and hugged Karen. Then, deciding not to leave it sitting in the middle of the living room, she carried her suitcase into her bedroom. One of these days, when the lawyer was paid off, she was going to get herself a fancy suitcase with wheels so she could roll it from room to room.\\n\\n Brian used to carry it for her. It had been about the only thing her son-of-a-bitch ex-husband had been good for.\\n\\n \"Do you see what I mean?” Gabriel asked, standing next to Shirley.\\n\\n \"Oh, poor Karen,” the smaller angel said, and sighed deeply. \"She loves both her parents. It’s hurting her terribly to have her mother feel this way about her father.”\\n\\n \"This is a complicated situation, involving many lives. Bitterness has eaten away at Maureen’s heart until her life has become clouded with it.”\\n\\n \"It’s as if she were buried to her waist in sand and trying to walk,” Shirley suggested.\\n\\n \"Exactly,” Gabriel said, surprised by the prayer ambassador’s insight. \"She can’t move forward in her life, weighted down as she is with hate.”\\n\\n \"Emotionally, Maureen Woods is crippled.”\\n\\n \"It doesn’t help matters any that her ex-husband has remarried and seems happy.”\\n\\n \"Is he? Happy, I mean?”\\n\\n \"He appears to be to Maureen, and it’s like rubbing salt in her wounds. Karen’s mother finds it grossly unfair that Brain should be living a new life with a wife and second family.”\\n\\n \"But why?”\\n\\n \"Brian hurt her deeply. He mangled her self-esteem with his affairs. Maureen has a strong sense of justice, and it doesn’t feel right to her that the man who broke his wedding vows should go merrily about his life, while she’s left to raise their daughter alone.”\\n\\n \"Does Maureen date?”\\n\\n Gabriel gave a short, sharp laugh. \"Hardly. A couple of men from the office asked her out, and she all but bit their heads off. She isn’t interested in a new relationship. I believe I heard her tell a friend recently that all men are scum.”\\n\\n Shirley’s eyebrows shot toward her hairline. \"I see.”\\n\\n \"According to Maureen, men are never to be trusted.”\\n\\n Shirley folded her wings and started to pace, apparently deep in thought. Pausing once, she turned to Gabriel and was about to ask something, then seemed to change her mind. Shortly afterward she resumed pacing.\\n\\n \"Can I help Karen?” she asked abruptly.\\n\\n \"That’s not for me to know,” Gabriel answered.\\n\\n \"The key is her mother.” \\n\\n","sourceLink":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2/page-2.html","bookId":2626,"book":{"id":2626,"title":"The Trouble with Angels (Angels Everywhere #2)","description":"Storyline: The Trouble with Angels (Angels Everywhere #2) \\n Macomber follows her nationally bestselling A Season of Angels with a delightful sequel featuring three heavenly but feather-brained angelic messengers. Inspired by their success last Christmas, Shirley, Goodness, and Mercy return to answer the prayers of three troubled mortals and ensure a holiday season filled with love and joy.\\n","cover":"https://allnovel.net/images/the-trouble-with-angels-angels-everywhere-2.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:05:00 PM"}}
