{"id":101670,"no":22,"title":"Page 22","content":"\"All right,” Ted agreed, \"I won’t.”\n Joy expelled her breath forcefully, regretting her outburst. \"I was more touchy than I should have been. I apologize.”\n \"No problem.”\n She led him into the kitchen, which bustled with activity. The scent of fresh bread baking mingled with roast beef and vegetables. She handed Ted a cream-colored ceramic mug and led him to the huge coffee machine. When they’d both filled their mugs, she returned to her office and sat behind at her desk.\n \"Okay,” she said, forcing herself to relax, \"what is it you want to know?”\n Ted settled onto the chair as if it had been custom made for him. He crossed his long legs, propping his ankle against his knee, and held the mug with one hand. \"Have you ever been in love?”\n Hot coffee spilled out of the cup and burned Joy’s chin. \"What’s that got to do with anything?”\n \"Quite a lot, as it happens.”\n In an effort to disguise her uneasiness, she sipped her coffee. \"I fell in love three times when I was in high school. Unfortunately not a one of the boys knew my name.” Now that she thought about it, it was clear that her pattern of worshiping from afar had began early in life.\n \"I mean really in love?” he pressed.\n She set the coffee on her desk with a deliberate show of impatience. \"If these are the kinds of questions you’re going to ask, then the deal’s off.”\n He grinned as if to suggest she’d have a much harder time getting rid of him than she suspected. \"All right, there are a few other questions I can ask.”\n She relaxed and reached for her coffee once more. All this was for naught, and she knew it. It irritated her that she was forced into this silliness.\n For now she was the brightest, most appealing woman he’d ever met. All that, of course, would change as soon as he got over the becoming-engaged jitters. Billy, one of her brothers, had shown identical symptoms. Her parents had been ready to pull their hair out.\n \"Did I tell you about my brother Billy?” she asked instead.\n He frowned. \"No.”\n \"He dated Diana for two years. He bought her an engagement ring, and then the night before he was set to propose he met this cute girl in a bar. Overnight he was convinced he was in love. My mother didn’t know what to think. My father took him out for a father/son talk, which ended up in a shouting match. To make a long story short, Bill and Diana are married and have three beautiful children.”\n \"What happened to the girl he met in the bar?”\n \"I don’t know,” Joy cried. \"No one does. That’s my point. Are you or are you not going to marry Blythe?”\n It took him two lifetimes to answer. \"I sincerely doubt it.”\n \"But you’ve considered marrying her?”\n Another lifetime, then: \"Yes.”\n Ted Griffin was both honest and fair, that much she’d say for him. \"I’m sure when Billy kissed—I think her name was Donna—he was convinced she was the best thing that had ever happened to him, that he’d found someone special.”\n \"I’m not Billy.”\n \"True, you’re older and more sophisticated than my brother, but it holds true, don’t you see? When a man is about to willingly surrender his freedom, something inside him resists. Something inside him fights against it. I’ve got two older brothers, and a dozen male cousins, and I’ve seen this phenomenon happen over and over again. So why don’t we both save each other a lot of grief and just drop it now?”\n \"Sorry, no.”\n Joy should have known that would have been too easy. She threw her hands into the air. \"All right, ask away. But kindly limit your questions to those less personal.”\n Ted smiled that devilish handsome smile of his and nodded. \"You’re a virgin, aren’t you?”\n 10\n Leta Johnson looked up from her desk when Paul walked into the church office. \"Good morning,” she said with her usual cheerfulness.\n \"Morning.” He picked up the two pink message slips on the corner of her desk. One was from Steve Tenny and the other from Bernard Bartelli.\n \"How was your evening with Bethany and Joe?” Leta asked, and he was sure she was making idle conversation. It wasn’t like her to beat around the bush. When she had something to say, she generally said it. He had often admired this trait in her. He didn’t always like it, but he found himself in her debt enough to appreciate the woman she was.\n \"Our dinner was great,” he answered absently. He was worried about the Bartellis. Madge remained hospitalized, and from what he understood, their children had been notified of her accident. It seemed heartless and unnecessary to make Madge suffer this way. Paul had been to visit her only once since she’d broken her hip. He would go again soon, he promised himself.\n \"I talked to Joe the other day and learned he’s engaged.”\n \"Yes,” Paul said, looking up from the phone messages. \"He brought Annie home for me to meet.”\n \"He said the two of them would be heading to Oregon for Christmas so Annie’s family could meet Joe.”\n \"Yes.” Again his answer came abstractedly. His thoughts centered on Madge and Bernard and their call and what he could possibly say to them.\n \"I was wondering,” Leta continued, sounding unlike her confident self, \"if you’d care to join me for dinner on Christmas?”\n The invitation took Paul by surprise. He’d worked with Leta for years, and although she was a vital member of his congregation, they’d avoided, by mutual consent, any contact outside the office.\n \"It’ll be just me this year as well,” Leta explained quickly. \"And seeing that you’re going to be alone, too, well, I thought we might keep each other company.”\n \"I appreciate the invitation,” Paul said, unsure of how to respond, \"but…”\n \"I understand, Paul,” she said, saving him from having to invent an excuse, if that was his intent. \"Don’t worry. It was just a thought.” She returned to her typing, her nimble fingers bouncing over the keys.\n To the best of his memory, it was the first time she’d ever called him by his given name.\n Not having an answer for her, Paul walked into his office and gently closed the door. He needed to work on his sermon for Sunday. He’d put it off far too long already.\n Sermon notes were tucked inside his study Bible. He stared at the text and experienced nothing. None of the passion. None of the energy. None of the urgency to spread the good news.\n At last he closed the Bible and reached for the first pink slip. Steve Tenny answered the phone himself.\n \"Paul,” Steve said enthusiastically, \"it’s good to hear from you.”\n One would think Paul had initiated the contact, when in reality he couldn’t remember the last time he’d purposely telephoned Steve. He hadn’t meant for it to have been so long. \"I got the message you’d phoned.”\n \"Yes,” Steve said cheerily. \"Are you sure I can’t talk you into taking a few days off and going hiking with me?”\n The offer was more tempting than ever, especially with Joe leaving soon with Annie. Then Paul thought about Madge Bartelli and knew he couldn’t leave her now. \"I can’t,” he said with real regret.\n \"Myrna and I understand Joe’s going to be away Christmas Day,” Steve began again. \"It’s hard for me to believe he’s engaged. Time sure does fly, doesn’t it?”\n \"It does,” Paul agreed flatly.\n \"Anyway, Myrna and I were talking, and we want to invite you to spend Christmas Day with us. Myrna puts on quite a spread, and there’s always plenty. We won’t take no for an answer, Paul. Not this time.”\n Paul wasn’t entirely sure what his plans were for the holiday. The idea of being alone, without responsibilities, without commitments, strongly appealed to him. He didn’t want his friend to think he didn’t appreciate the invitation, but at the moment he simply didn’t know what he was going to do.\n \"Would it be all right if I got back to you?” he asked.\n \"Of course,” Steve said.\n Paul grinned. What he’d enjoyed most about his friend was his unabashed enthusiasm for life. Even a solid \"no” wouldn’t have discouraged Steve. \"I want you to know how much I appreciate you and Myrna thinking of me,” Paul said.\n If he could have his own way, Paul mused, he’d go camping. Alone. He’d leave directly after the Christmas Eve services and head for the hills to a campsite he’d taken the family to many times over the years. Then he’d lie under the stars. Away from Barbara’s red stocking over the fireplace. Away from the tattered cotton snowmen his son had made a dozen or so years earlier. Away from Christmas and church and friends, however good their intentions.\n He’d stumble over the memories of Barbara while he was camping, too—Paul was wise enough to recognize that—but at least it wouldn’t feel as if the heaviness of his grief were smothering him.\n The phone rang, and line one lit up on his telephone. His line. Leta answered it for him, then buzzed him.\n \"Bernard Bartelli,” she said through the intercom.\n Paul ran a hand down his face. He had nothing to offer the old man. Resting his face in his hands, he tried to reason what he could possibly say to the grieving husband.\n \"Line one,” Leta’s voice said through the intercom.\n The line continued to flash like a bright red beacon, and still Paul couldn’t make himself reach for the receiver.\n He couldn’t listen to the other man’s pain and not relive his own. He couldn’t hear Bernard’s frustration and anger without feeling it bubble up inside him all over again. Just when everything seemed to be getting better, he had to bear it all again, and he hadn’t the strength. He hadn’t the courage.\n His hand trembled as he pushed the button to the intercom and steeled himself. \"Please take a message.”\n Leta hesitated, then said, \"I already told Mr. Bartelli you were in the office.”\n \"I realize that,” he answered, the words thick with regret. \"Just take a message. I’ll get back to him later.” Although he released the intercom, it seemed an eternity before Leta picked up the receiver and the light on line one stopped flashing.\n Paul covered his face with both hands and discovered he was trembling. His breath came fast and hard.\n A knock sounded against his door, and with a guilty jerk of his shoulders he straightened. \"Yes,” he said, making his voice as unemotional and businesslike as he could.\n Leta stepped just inside his office. \"Mr. Bartelli wanted you to know that Madge is much worse. He’s contacted the children, and they’re coming. It doesn’t look as though Madge will last until Christmas.”\n Paul’s heart sank like a concrete block. \"I see,” he said.\n \"Bernard’s spending most of his time at the hospital. You probably won’t be able to catch him by phone there.”\n \"You’re right, of course. I’ll stop in at the hospital soon.” But he didn’t say when. Didn’t know when he’d work up the courage to lend comfort when he’d found none himself. \n","sourceLink":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2/page-22.html","bookId":2626,"book":{"id":2626,"title":"The Trouble with Angels (Angels Everywhere #2)","description":"Storyline: \n The Trouble with Angels (Angels Everywhere #2) \n Macomber follows her nationally bestselling A Season of Angels with a delightful sequel featuring three heavenly but feather-brained angelic messengers. Inspired by their success last Christmas, Shirley, Goodness, and Mercy return to answer the prayers of three troubled mortals and ensure a holiday season filled with love and joy.\n \n","cover":"https://allnovel.net/images/the-trouble-with-angels-angels-everywhere-2.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:05:00 PM"}}
