{"id":101673,"no":25,"title":"Page 25","content":"Just as Joy turned on the television and plopped down in front of it, the doorbell chimed. This was not the time for company. Joy had never felt less sociable in her life. She walked over to the door and checked the peephole. Ted Griffin. Groaning, she twisted away from the door and closed her eyes. It would take a better woman than she was to deal with him just then. She held her breath. He rang the bell again. Joy didn’t dare move, or blink, or give any indication she was home. When she was calm and in control of her emotions, then and only then would she talk to the man who didn’t seem to know his own mind. Eventually he left, but Joy knew she hadn’t fooled him. He’d been as aware of her on the other side of the door as she was of him. Her reprieve didn’t last long. The following morning when she arrived at the office, a dozen red roses awaited her. The card read simply \"Ted.” She kept them on the corner of her desk for the first hour, then decided she couldn’t look at them and not think of him. Of course, she couldn’t look at her pencil holder and not think of Ted, but that was beside the point. She would have liked to make an excuse and disappear for the afternoon, but that was the coward’s way out. The sooner she told him what had to be said, the better. Joy was in the business office when he arrived. Through the plate-glass window, she saw him walk into the foyer. It would only be a matter of minutes before he tracked her down. Instead she followed him. \"Hello,” she said evenly, in the long hallway leading to her office. \"Were you looking for me?” Ted whirled around, and it looked as if he were hard-pressed not to reach for her right then and there. Not that she would have allowed it. Not this time. \"I see you got my flowers,” he said. He moved into her office and sat down as if this were his second home. For her part, Joy preferred to stand. \"I thought they looked very nice in the welcoming area,” she said. \"They weren’t necessary.” \"I wanted to explain about last night.” \"No,” she said firmly, and crossed her arms over her chest, \"I’d rather you didn’t.” He seemed to want to object, but she stopped him by raising her index finger. \"Please, it doesn’t matter.” \"It matters to me.” She ignored that, because what was important to her at that moment was breaking off a potentially devastating relationship. \"Actually I’m pleased you stopped by. I wanted to talk to you.” \"I want to talk to you, too. About our date, I was thinking—” \"There isn’t going to be any date.” \"That’s not what you said earlier.” Joy smiled, but it was a rather sad smile. \"A woman can change her mind. Please, Ted, just leave it at that.” He shook his head. \"You keep forgetting. I don’t take ‘no’ for an answer.” \"This time you’ll have to, because I won’t be seeing you again.” She met his gaze, her eyes cool, her voice calm and controlled. \"I mean it, Ted. Kindly stay out of my life.” Maureen couldn’t believe she slept so late. Ten o’clock on a Saturday morning. It had been years. Aeons. Longer than she could remember since she’d rested this well. She might have lazed in bed even longer if the phone hadn’t rung. \"Hello,” she answered on the tail end of a heady yawn. \"Mom? Is that you? You don’t sound right. Are you sick or something?” \"No, my darling daughter, what you’re hearing is the sound of your mother being exquisitely lazy.” \"Lazy?” \"I’m still in bed.” A shocked silence followed. \"Bed! Mom, you never stay in bed this long.” \"I know,” Maureen said dreamily, and yawned again. \"I feel wonderful.” \"Good,” Karen said excitedly, \"because we’ve got a surprise for you.” \"A surprise?” The \"we’ve” part of the conversation didn’t escape her notice. \"A really fabulous surprise. You’re coming to get me, aren’t you?” \"Of course.” \"Don’t come until after four, understand? That’s really important.” \"After four. Why?” \"That’s the surprise part. I don’t want to ruin it so don’t ask me a lot of questions because I really want to tell you and if I do Paula will be real disappointed and Thom too.” She lowered her voice substantially. \"But don’t eat a big lunch, okay?” \"All right, all right.” Maureen struggled to a sitting position. \"Now before we hang up, tell me, did you have a good time last night?” \"Oh, Mom, the Christmas lights were so pretty and some people were serving hot apple cider and singing Christmas carols. One neighborhood was even collecting canned goods for food baskets. Thom brought bags and bags of things, and this stuff wasn’t from the back of his cupboard, either. Thom let Paula and me go to the grocery store and shop with a cart and everything.” Her voice dropped once again. \"We were real careful and chose nutritious food, too. No candy or junk food.” Maureen heard a whisper in the background before Karen came back on the line. \"There was one small bag of candy canes, but those were mainly for decorations.” \"It sounds like you had a wonderful time.” Meeting Paula and Thom had changed both their lives for the better. \"Paula and I decided to be friends for life.” \"That’s great.” \"How’s your hair with olive oil in it?” \"Olive oil?” \"I heard you tell Thom you were going to put oil in your hair. It sounded weird to me and Paula, but when she asked Thom he said it was a woman thing.” \"That’s hot oil, sweetheart, and we’ll do it on your hair someday.” \"Paula’s, too?” she wanted to know right away. \"Paula’s, too,” Maureen promised. \"Okay, Mom, I’d better go because we’ve got a whole lot more to do before you get here. Don’t be late, okay? And oh—no, I’d better not say anything more.” Smiling, Maureen replaced the receiver. A few moments later she climbed out of bed and dressed. She stood in the middle of her bedroom and wondered what those three had managed to cook up this time. A surprise. She could just imagine. Saturdays were generally reserved for errands, and Maureen left the house shortly after talking to her daughter. She stopped off at the cleaners and the drugstore and did a quick bit of Christmas shopping before heading for Thom’s ranch. She arrived precisely at four. No sooner had she parked the car than Karen burst out of the house and raced toward her, her arms open wide as if it had been six months since they’d last seen each other. Maureen caught her in her arms. Thom and Paula followed Karen outside. Maureen’s gaze met Thom’s, and his eyes sparkled. \"I understand you’ve got a surprise for me,” she said, smiling at Thom. Keeping a cool facade with him had become much too difficult. It required more energy and effort than she could muster. Like Karen, she was happy, truly happy. Perhaps for the first time in years. \"Oh, Mom, it’s so beautiful.” \"What is?” Both girls were looking at her as if they were about to burst wide open. Karen grabbed hold of her hand and led her toward the house. Maureen looked over her shoulder at Thom, who was grinning broadly. \"This is only part of the surprise,” Karen explained as she opened the screen door and led Maureen into the formal living room. Maureen had been in Thom’s home a number of times before, but she’d always gone in through the kitchen. The living room was sunken, with a huge stone fireplace that dominated one entire wall. The naturally bright room was cheered by the extensive display of Christmas decorations. A massive flocked white Christmas tree, six feet tall or more, took up one corner where the ceiling slanted upward toward a skylight. In all her life Maureen had never seen a more beautifully decorated Christmas tree. The limbs drooped downward, heavy with layers of white flocking. Blue glass bulbs of varying sizes glistened like the moon against a crystal-clear lake. Ribbons of gold delicately embraced the tree, woven between the branches. \"It’s beautiful,” Maureen whispered. \"We decorated the tree,” Karen said, so excited she could barely speak. \"First of all we went out and bought it. Thom let us pick it out and everything.” It seemed unbelievable to Maureen what an incredibly good job they’d done. The entire house looked as if it had been decorated by a professional. The contrast between her house and this one said a great deal about the two of them. It was as if all the joy had been taken out of Maureen’s life by the divorce. \"A friend of Thom’s put the snow on it for us.” \"You couldn’t have timed your arrival any better,” Thom told her. \"We just put the finishing touches on it about five minutes ago.” \"This is only part of your surprise, though,” Karen said, taking Maureen’s hand once more and leading her into the dining room. The polished mahogany table in the formal dining room was set with china dishes and linen napkins. A pair of sterling-silver candlesticks decorated with bayberry-scented candles and a bowl of fresh flowers sat proudly in the center. \"This is lovely,” Maureen told them. \"Did you girls do this as well?” \"No,” Karen said quickly, \"Thom bought that, for atmosphere.” Maureen leveled her gaze on the rancher, who looked entirely too pleased with himself. She was tempted to ask him exactly what he had up his sleeve, but she didn’t. \"There’re only two place settings,” Maureen pointed out to her daughter. \"Mom,” Karen said in that way of hers that made Maureen feel as if she’d suddenly lost a hundred points off her intelligence quotient. \"Take her into the kitchen, girls,” Thom advised. The party of four traipsed into the kitchen, and Maureen swore she’d seldom seen a bigger mess. It looked as if whoever was cooking had required every pot and kettle in the house. Tomato sauce was splattered across the stove top and the wall. Lettuce leaves trailed from the table to the refrigerator. \"What happened in here?” Maureen cried. Her instincts were to push up her sleeves and clean the mess before it got worse. \"I don’t think this was such a good idea, Dad,” Paula muttered. \"Take her back into the living room,” Karen advised Thom, \"and leave the rest to us.” Maureen felt as if she were trapped in a London fog. \"What’s going on here?” \"I believe what you just saw was our dinner,” Thom explained. He led her into the living room and sat her down. A bottle of wine was cooling in a bucket of ice, something Maureen had missed seeing earlier. Thom went to work removing the stubborn cork and pouring them each a generous glass. \"I hate to appear so dense,” Maureen whispered, \"but exactly what’s happening?”","sourceLink":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2/page-25.html","bookId":2626,"book":{"id":2626,"title":"The Trouble with Angels (Angels Everywhere #2)","description":"Storyline: The Trouble with Angels (Angels Everywhere #2) Macomber follows her nationally bestselling A Season of Angels with a delightful sequel featuring three heavenly but feather-brained angelic messengers. Inspired by their success last Christmas, Shirley, Goodness, and Mercy return to answer the prayers of three troubled mortals and ensure a holiday season filled with love and joy.","cover":"https://allnovel.net/images/the-trouble-with-angels-angels-everywhere-2.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/the-trouble-with-angels-angels-everywhere-2.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:05:00 PM"}}
