{"id":65856,"no":32,"title":"Page 32","content":"“When I spoke to Ellen, she also told me something about Twenty Wishes. What’s that?” “Ah…oh, it’s nothing.” “Not according to Ellen. She has a book she drags to and from school in her backpack.” Anne Marie didn’t realize Ellen brought it with her. “She does?” “From what I understand, half the class is making lists as well.” “Oh…” Anne Marie took a sip of her tea. “A group of my friends and I decided it would be fun, that’s all.” She didn’t want to explain anything beyond that; it was too complicated and too private. “I love it,” Evelyn said, her enthusiasm unmistakable. Anne Marie’s gaze shot toward the other woman. “You do?” “Why, yes. In fact, I immediately started thinking about what I’d put on my own list.” Anne Marie relaxed a little. “When I spoke to Ms. Peterski, she said there’s been a marked improvement in Ellen in the last three weeks. Her grades have always been good but she had problems in other areas. Her social skills have vastly improved and she’s making new friends and reaching out to others.” Anne Marie nodded. Although she had no personal reason to feel such overwhelming pride, it was difficult not to. “Ellen is happy, too. This arrangement has obviously worked out well,” the social worker said. “She’s an easy child,” Anne Marie told her. True, it had taken them a few days to find their footing, but they’d adjusted to living together with surprisingly few problems. “Yes, she’s done very well,” Evelyn murmured. “Did Ellen tell you she taught Baxter—my dog—to roll over?” Anne Marie asked. Ellen had worked with the dog for weeks and had only recently accomplished that goal. “As a matter of fact, she did,” Evelyn said with a glance at Baxter, who snored softly in the corner. “I believe I mentioned that I spoke to the staff at the nursing facility where Dolores Falk is currently residing, didn’t I?” Evelyn continued. In her nervousness, Anne Marie didn’t recall. “I’m not sure. Dolores tells me she’s recovering nicely. She said she’d be released sometime next week. Wednesday, she thought.” Ms. Boyle hesitated before responding. “I understand Mrs. Falk is making excellent progress. She confirmed that you and Ellen visit frequently. And she waits every day for that brief telephone chat with her granddaughter.” “We see Dolores as often as we can.” “I’m aware of that, and I applaud your conscientiousness.” “Three to four times a week,” she added. She made the effort to fit those visits into her schedule because she appreciated how important it was for Ellen—and, of course, Dolores. “Very good.” “Thank you. I’m doing my best.” Evelyn sipped her tea. “I can see that, and the proof is in Ellen. Her teacher’s delighted. Ms. Mayer, the school counselor, sang your praises, too.” This conversation wasn’t nearly as difficult as Anne Marie had feared it would be. She was beginning to relax. “Getting back to Mrs. Falk…” The words hung in the air like an unanswered question. “Yes?” Anne Marie put down her cup. “Did I hear you say she’s going to be released next week?” “Yes. Ellen and I were by on Wednesday after school and Dolores said she’d talked to one of the nurses about it.” “I’m afraid that’s wishful thinking on Mrs. Falk’s part,” Evelyn Boyle said. “What? How do you mean?” “I spoke with the doctor’s office as well as the head nurse.” A chill raced down Anne Marie’s spine. “She’s going to be all right, isn’t she?” “Oh, yes,” Evelyn assured her. “The healing process is coming along well. But don’t forget she had major heart surgery.” “Yes, of course.” Fortunately there didn’t seem to be any significant complications. “However…” “Are there problems with her recovery?” “Not exactly problems.” “What is it, then?” Mrs. Boyle’s hand lingered on her cup and she ran her index finger along the rim. “Unfortunately it will be some weeks before she’ll be able to return to her own home.” “Weeks?” Anne Marie repeated. This was a shock and she knew Ellen would be terribly disappointed. “I’m sorry.” “How…many weeks?” Anne Marie asked, wondering how she’d explain this to Ellen. “Can you tell me how much longer it’ll be before Dolores can go home?” “I’m not a physician.” “What did the doctor say?” “Two weeks.” “That’s what I was told,” she said. “But you mean an additional two weeks, right?” Anne Marie exhaled slowly. “Yes. Are you okay with that?” “Definitely. I’m just afraid this is going to be upsetting for Ellen. The child loves her grandmother very much.” “I know.” “Ellen’s been marking off the days until she can move back in with Dolores.” “I understand this will be a setback for the child. I also understand that it’s far and above what you agreed to when Ellen came to stay with you,” Evelyn said. “If you feel it’s too much, I could probably find a temporary home for Ellen.” “That would upset her even more,” Anne Marie said, dismissing the offer out of hand. “It was difficult enough for Ellen to be separated from her grandmother. Placing her in another completely foreign environment would be doubly traumatic.” “I couldn’t agree with you more.” At least they saw eye to eye on that, Anne Marie thought with relief. “Then you won’t mind keeping Ellen for another two weeks?” “Of course I don’t mind.” Any other option wasn’t worth considering. “In that case, I’d like to leave some forms for you to complete.” “What kind of forms?” Anne Marie didn’t like the sound of this. Evelyn Boyle took a sheaf of papers out of her briefcase. “Since Ellen’s been with you for more than two weeks already and is likely to remain for an additional two, I’d like you to apply for your license.” “My license for what?” “To be Ellen’s foster parent,” she said as if this was perfectly logical. An automatic objection rose in her throat, but Anne Marie bit down on her tongue rather than argue. The best thing to do was to appear compliant. However, she had no intention of becoming a foster parent. What was the point? By the time she finished applying, Ellen would be back with her grandmother and it would be irrelevant. “Thank you,” Anne Marie said, accepting the papers. She stood and took the teapot and cups to the sink. “I appreciate your coming by,” she said, since the interview was clearly over. “My pleasure.” Baxter got up from his dog bed and walked them to the stairs, as though that was one of his prescribed duties. He stood silently at the top while the two women climbed down. Anne Marie was saying goodbye to the social worker when she noticed a lone figure in the overstuffed chair, her head drooping, hair half-covering her face. The woman appeared to be asleep. Anne Marie glanced at her again, and suddenly realized who she was. Her stepdaughter, Melissa Roche. Chapter 21 As if aware of Anne Marie’s scrutiny, Melissa opened her eyes and sat up, looking self-consciously around. Anne Marie wished now that she’d returned her phone call. Even from a distance, she could see that Melissa was in distress. For the moment she ignored her and accompanied Evelyn Boyle to the door. She thanked her for the visit and agreed to read over the paperwork—and read it was all Anne Marie intended to do. Evelyn obviously didn’t want to remove Ellen from her temporary custody any more than Anne Marie wanted to let the child go. She had to admit she felt ambivalent about this latest information concerning Dolores. On the one hand, she knew Ellen would be disappointed; on the other hand, she herself wasn’t unhappy about the girl’s extended stay. By the time Evelyn Boyle had gone and Anne Marie turned back to the shop, Melissa was standing uncertainly beside the chair. She seemed to be waiting for Anne Marie. Anne Marie spoke with Theresa for a few minutes about some special orders, then walked toward her stepdaughter. “Hello, Melissa.” “You didn’t return my phone call. I left a message.” “I was out last night. I didn’t get in until late.” Melissa seemed confused. “You’re not dating anyone, are you?” Why would she ask that question again? Anne Marie couldn’t even think about another relationship so soon after losing Robert. “No. I was with a group of women friends, although that isn’t really any of your concern,” she said brusquely. “I intended to call back this evening.” Actually, Melissa had phoned more than once. Caller ID had shown three calls, all from her stepdaughter, although she’d left only the one message. “Could I buy you lunch?” Melissa asked in a surprisingly tentative voice. “Thank you, but I’ve already eaten.” Melissa blinked as if she hadn’t expected that despite the fact that it was nearly two in the afternoon. “The truth is, I’m not eager to visit another restaurant with you.” Melissa blanched. “I said I was sorry about that.” Anne Marie nodded. “Yes, you did.” “And I am, I really am! Sometimes I do stupid stuff. I don’t know why I thought I should tell you what I saw. Brandon about bit my head off. He said—well, never mind.” Anne Marie could see this wasn’t going to be a quick visit, so she motioned for Melissa to sit down again, then took the chair next to hers. The shop wasn’t busy and Theresa was handling what business there was without a problem. The two women sat silently for several seconds. Anne Marie was determined not to speak first. After all, Melissa had sought her out. She was the one with the agenda and frankly, Anne Marie was curious as to what it might be. “Brandon said he came by a little while ago.” “Yes.” She didn’t elaborate. “He said there’s a child living with you.” “It’s a temporary situation.” Melissa acknowledged the comment with a slight nod. “He said that, too, and that—Allie, is it?” “Ellen.” “He said that Ellen’s a real sweetheart.” “She is.” Anne Marie wished Melissa would get to the point. “But I’m sure you aren’t here to discuss my child-care activities.” “No,” her stepdaughter agreed, fidgeting nervously with her hands. “Did Brandon tell you Mom and I aren’t getting along?” “He mentioned it.”","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-32.html","bookId":1937,"book":{"id":1937,"title":"Twenty Wishes (Blossom Street #5)","description":"Storyline: Twenty Wishes (Blossom Street #5) What do you want most in the world? What Anne Marie Roche wants is to find happiness again. At thirty-eight, she\u0027s childless, a recent widow, alone. She owns a successful bookstore on Seattle\u0027s Blossom Street, but despite her accomplishments, there\u0027s a feeling of emptiness. On Valentine\u0027s Day, Anne Marie and several other widows get together to celebrate…hope. They each begin a list of twenty wishes—things they always wanted to do but never did. Anne Marie\u0027s list includes learning to knit, falling in love again, doing good for someone else. When she volunteers at a local school, an eight-year-old girl named Ellen enters her life. It\u0027s a relationship that becomes far more involving—and far more important—than Anne Marie had ever imagined. As Ellen helps Anne Marie complete her list of twenty wishes, they both learn that wishes can come true…but not necessarily in the way you expect.","cover":"https://allnovel.net/images/twenty-wishes-blossom-street-5.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/twenty-wishes-blossom-street-5.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:58:26 AM"}}
