{"id":65858,"no":34,"title":"Page 34","content":"Mark Bassett.\\n\\n Coincidence? Fate? Barbie wasn’t about to question it. Her heart felt as if it had shot all the way up into her throat. Without conscious thought she did an about-face and headed back, toward the shop. Within five minutes, she’d purchased a swimsuit and towel. Gaining entrance to the pool was a bit more difficult; before she was allowed to swim, she had to buy a six-month fitness membership. She slapped her credit card down on the counter, impatient to get into the water before Mark.\\n\\n He had to believe this meeting wasn’t staged—which, in truth, it wasn’t. Okay, so her showing up at the pool might be a bit manipulative, but when life presented you with an advantage, you had to grab it with both hands.\\n\\n Barbie changed into the swimsuit, a sleek blue one-piece, in the women’s dressing room and walked out as though she was strolling along a Caribbean shore. The suit, thankfully, was a perfect fit. She squared her shoulders and silently thanked her mother for every lesson she’d taken at that expensive charm school.\\n\\n Using the railing, she lowered herself into the water and cringed at the temperature. Her own swimming pool was kept at a comfortable eighty-five degrees. This was eighty, eighty-one maximum, and in her opinion downright cold.\\n\\n When she’d entered the pool area, the attendant had explained that this was the adult lap swim. As soon as she got into the water, Barbie realized these noontime swimmers were serious about their workout. They wore goggles and bathing caps, and to her they resembled nothing so much as a bunch of insects with their smooth shiny heads and large round eyes.\\n\\n Barbie refused to allow her hair to get wet. She needed to go back to work right afterward, and she couldn’t arrive with dripping hair.\\n\\n The minute she broke away from the side of the pool, another swimmer streaked past her, quickly followed by a second. It was quite apparent that no one appreciated her rather lazy form of breaststroke.\\n\\n A third swimmer went by, kicking wildly, splashing her face and hair. Barbie swallowed a mouthful of chlorinated water and choked violently. She felt like she was about to cough up her tonsils. So much for making a sophisticated appearance.\\n\\n She muttered a curse, treading water for a moment while she caught her breath. When she could breathe normally again, she wiped the water from her eyes. She’d given up even trying to keep her hair dry.\\n\\n As she finally reached the other end of the pool, she saw Mark hanging on to the side, watching her. Clearly her antics were a source of amusement to him. His gaze found hers and he actually smiled.\\n\\n Mark had smiled at her!\\n\\n Since her hair was already ruined, Barbie stopped worrying about it and started swimming for all she was worth, face fully in the water. Her mascara was probably running, too, but she no longer cared.\\n\\n Mark was waiting for her.\\n\\n “Fancy meeting you here,” she said, hoisting herself up on the side of the pool. She gave him what she hoped was a dazzling smile.\\n\\n “Yeah, some coincidence.”\\n\\n “Come here often?” she asked.\\n\\n “Every day.”\\n\\n “Me, too,” she lied. “I can’t believe we’ve never run into each other before.”\\n\\n “Every day?” He arched his eyebrows in disbelief. “Since when?”\\n\\n She wasn’t fooling him, so she might as well own up to the truth.\\n\\n “Since today.”\\n\\n He not only smiled at that, he laughed. The sound was deep, pleasant to the ear. She had the impression that he hadn’t done a lot of laughing in the last few years.\\n\\n “I come here to swim,” Mark told her. “Keep up if you can.”\\n\\n “Hey, you’re going to have to catch me,” she shouted after him.\\n\\n That was a joke if there ever was one.\\n\\n Mark took off and with impressive upper body strength sliced through the water. His ease and grace were mesmerizing. Barbie didn’t make the slightest effort to catch up with him. When he’d passed her twice, he stopped, waiting for her in the deep end. By then, Barbie had swum two laps and was too exhausted to swim anymore. Her breath came in shallow gasps. She grabbed the edge of the pool and felt her heart pounding hard against her ribs.\\n\\n “Are you going to tell me why you’re really here?” he asked.\\n\\n “Belly dancing.”\\n\\n “I beg your pardon?” He sounded incredulous, and she wondered if he thought she was making fun of him.\\n\\n “I signed up for a belly dancing class.”\\n\\n “At the Fitness Center?”\\n\\n Propping her elbow on the ledge, Barbie pushed the hair away from her face. “Just as I was leaving, I saw you and had the overwhelming urge to take a dip.”\\n\\n “You’re a member?”\\n\\n “I am now.”\\n\\n Almost everyone had left the water. Barbie looked around, astonished to discover that only the two of them were still in the pool. When she glanced back at Mark, she saw him frowning.\\n\\n “Why?” he asked.\\n\\n Barbie didn’t know how to answer him. “Don’t you feel it?” she asked him instead. Judging by his puzzled expression, he either didn’t understand or didn’t want to, so she continued. “That first night in the theater…I’ve never experienced anything like it.”\\n\\n “You’re imagining things,” he snapped.\\n\\n “No, I’m not.” She wasn’t going to let him lie to her, let alone himself. The attraction between them was too intense to ignore.\\n\\n “I realize you’re not happy about this,” she whispered. “You’ve made that pretty obvious.”\\n\\n “Then leave me alone.”\\n\\n “I wish I could,” she said, “but I just…can’t.” She hadn’t meant to reveal so much, but the words slipped out before she could stop herself. Their eyes met, and she could see the warring emotions inside him.\\n\\n Using his free arm, he reached for her and slid his hand behind her neck and then slowly, as if fighting her every inch of the way, he brought his mouth to hers. He gave her ample opportunity to pull back.\\n\\n She didn’t.\\n\\n Barbie wanted his kiss, hungered for it. She opened her mouth to welcome him, and then she was crushed in his embrace, arms and legs entwined, mouths joined.\\n\\n Their kiss was better than she ever would have dreamed. They abandoned the effort to stay afloat and started to sink. Clinging to each other they sank far below the surface, their mouths straining, searching, devouring.\\n\\n By the time they broke the surface again, Barbie was gasping for air. Because his legs were paralyzed, Mark needed to move his arms to remain afloat. All Barbie needed to do was kick her feet.\\n\\n The sheer exhilaration of his kiss overwhelmed her. But he didn’t seem to share her enthusiasm. His look was fierce, angry…afraid. He glared at her in much the same way he had the evening they’d first met.\\n\\n “That was wonderful,” she said reverently. It was very different from any sensual experience she’d shared with Gary, and she felt no guilt, no regret. Only gratitude.\\n\\n He didn’t respond.\\n\\n “Mark?” His name was a soft plea on her lips. She couldn’t bear it if he said or did something to destroy what she’d found to be an intensely moving experience.\\n\\n Without speaking he kissed her a second time, and they sank into the clear blue water, wrapped in each other’s arms. After a moment, they bobbed to the surface again.\\n\\n Mark released her and Barbie sagged breathlessly against him, her head on his shoulder. It’d been so long since a man had held her or kissed her….\\n\\n “I don’t think this is a good idea,” he whispered, but even as he spoke the words, he caressed her wet hair. He was braced against the side of the pool and she held on to him.\\n\\n “It’s a brilliant idea! Stop arguing with me.” The sheer joy of being in his arms rang in her voice.\\n\\n “Barbie—”\\n\\n She shushed him with a kiss. “I mean it. Stop arguing.”\\n\\n He laughed again, the sound echoing in the cavernous room.\\n\\n “I’m turning into a prune,” she said, “and I love every second of it and all because I’m with you.”\\n\\n “You’re very beautiful,” he murmured.\\n\\n “Even with wrinkled skin and mascara running down my face?”\\n\\n “If you only knew…” Then, seeming to reach some kind of decision, he slowly exhaled. “Listen, Barbie, this is all very flattering, but—”\\n\\n She interrupted him again, kissing him full on the mouth, using her lips and tongue to steal his very words. After coming this far, she didn’t plan to let him get cold feet and a cold heart now.\\n\\n His eyes were still closed when she broke off the kiss.\\n\\n “You don’t know what you’re letting yourself in for. You—”\\n\\n “I won’t tolerate a man making decisions for me. If you think I’m going to allow you to decide what I do and don’t know, then you’re sadly mistaken.”\\n\\n The edges of his mouth quivered with the effort of suppressing a smile. “So you know everything there is to know about my disability.”\\n\\n “Of course I don’t.”\\n\\n He ignored her response. “You read a few things on the Internet and you think you know it all.”\\n\\n “Well…okay, I read a few things.”\\n\\n His eyes narrowed. “Like what?”\\n\\n A flush rose in her cheeks. “Mainly, I was interested in how we’ll make love.”\\n\\n Mark gasped—or perhaps it was a groan, she couldn’t tell which. “You’re getting way ahead of yourself.”\\n\\n “Probably,” she admitted. “But that’s what I was most curious about.”\\n\\n His face somber and apprehensive, he smoothed a wet tendril from her cheek. “I should tell you…I haven’t…since the accident.”\\n\\n “Then it’s about time.” Barbie couldn’t believe they were having this conversation. Even more unbelievable was the fact that she could speak so openly and boldly about lovemaking with a man she barely knew.\\n\\n Mark held her gaze a long moment. “Where do we go from here?”\\n\\n “Where do you want to go?”\\n\\n A smile twitched his lips. “Now, that’s a leading question if I ever heard one.”\\n\\n She slapped his shoulder. “What I mean is we should probably get to know each other a little better.”\\n\\n “Must we?” he asked with pretended chagrin.\\n\\n “Yes!”\\n\\n “We can’t go to bed first and ask questions later?”\\n\\n “I’m not that kind of woman.” Although considering the way he kissed, she might think about converting.\\n\\n “I was afraid of that.”\\n\\n “You swim every day?”\\n\\n “Every day,” he assured her. “You too, right?”\\n\\n “Right.” This schedule change was going to take some adjustment. “Except Monday and Wednesday, when I’ll be in my belly dancing class. Okay, I’ll swim two or three times a week.”\\n\\n “Right.”\\n\\n “I could meet you afterward.” Her staff was going to be putting in a lot of extra hours. That wasn’t a problem; Barbie had been planning to give them more hours, anyway.\\n\\n “You’re sure about this?” Mark didn’t seem convinced.\\n\\n “I’m positive and if you ask me once more, I’ll—” \\n\\n","sourceLink":"https://allnovel.net/twenty-wishes-blossom-street-5/page-34.html","bookId":1937,"book":{"id":1937,"title":"Twenty Wishes (Blossom Street #5)","description":"Storyline: Twenty Wishes (Blossom Street #5) \\n What do you want most in the world? \\n What Anne Marie Roche wants is to find happiness again. At thirty-eight, she\u0027s childless, a recent widow, alone. She owns a successful bookstore on Seattle\u0027s Blossom Street, but despite her accomplishments, there\u0027s a feeling of emptiness. \\n On Valentine\u0027s Day, Anne Marie and several other widows get together to celebrate…hope. They each begin a list of twenty wishes—things they always wanted to do but never did. \\n Anne Marie\u0027s list includes learning to knit, falling in love again, doing good for someone else. When she volunteers at a local school, an eight-year-old girl named Ellen enters her life. It\u0027s a relationship that becomes far more involving—and far more important—than Anne Marie had ever imagined. \\n As Ellen helps Anne Marie complete her list of twenty wishes, they both learn that wishes can come true…but not necessarily in the way you expect.\\n","cover":"https://allnovel.net/images/twenty-wishes-blossom-street-5.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/twenty-wishes-blossom-street-5.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:58:26 AM"}}
