{"id":109752,"no":5,"title":"Page 5","content":"10 AUGUSTUS BRINE Augustus Brine sat in one of his high-backed leather chairs massaging his temples, trying to formulate a plan of action. Rather than answers, the question, Why me? repeated in his mind like a perplexing mantra. Despite his size, strength, and a lifetime of learning, Augustus Brine felt small, weak, and stupid. Why me? A few minutes before, Gian Hen Gian had rushed into the house babbling in Arabic like a madman. When Brine finally calmed him down, the genie had told him he had found the demon. \"You must find the dark one. He must have the Seal of Solomon. You must find him!\" Now the genie was sitting in the chair across from Brine, munching potato chips and watching a videotape of a Marx Brothers movie. The genie insisted that Brine take some sort of action, but he had no suggestions on how to proceed. Brine examined the options and found them wanting. He could call the police, tell them that a genie had told him that an invisible man-eating demon had invaded Pine Cove, and spend the rest of his life under sedation: not good. Or, he could find the dark one, insist that he send the demon back to hell, and be eaten by the demon: not good. Or he could find the dark one, sneak around hoping that he wasn\u0027t noticed by an invisible demon that could be anywhere, steal the seal, and send the demon back to hell himself, but probably get eaten in the process: also, not good. Of course he could deny that he believed the story, deny that he had seen Gian Hen Gian drink enough saltwater to kill a battalion, deny the existence of the supernatural altogether, open an impudent little bottle of merlot, and sit by his fireplace drinking wine while a demon from hell ate his neighbors. But he did believe it, and that option, too, was not good. For now he decided to rub his temples and think, Why me? The genie would be no help at all. Without a master he was as powerless as Brine himself. Without the seal and invocation, he could have no master. Brine had run through the more obvious courses of action with Gian Hen Gian to have each doomed in succession. No, he could not kill the demon: he was immortal. No, he could not kill the dark one: he was under the protection of the demon, and killing him, if it were possible, might release the demon to his own will. To attempt an exorcism would be silly, the genie reasoned; would some mingy prelate be able to override the power of Solomon? Perhaps they could separate the demon from his keeper - somehow force the dark one to send the demon back. Brine started to ask Gian Hen Gian if it was feasible but stopped himself. Tears were coursing down the genie\u0027s face. \"What\u0027s the matter?\" Brine asked. Gian Hen Gian kept his eyes trained on the television screen, where Harpo Marx was pulling a collection of objects from his coat, objects obviously too large to be stored there. \"It has been so long since I have seen one of my own kind. This one who does not speak, I do not recognize him, but he is Djinn. What magic!\" Brine considered for a moment the possibility that Harpo Marx might have been one of the Djinn, then berated himself for even thinking about it. Too much had happened today that was outside the frame of his experience and it had opened him up to thinking that anything was possible. If he weren\u0027t careful, he would lose his sense of judgment completely. \"You\u0027ve been here a thousand years and you\u0027ve never seen a movie before?\" Brine asked. \"What is a movie?\" Slowly and gently, Augustus Brine explained to the king of the Djinn about the illusion created by motion pictures. When he finished, he felt like he had just raped the tooth fairy in front of a class of kindergartners. \"Then I am alone still?\" the genie said. \"Not completely.\" \"Yes,\" the genie said, eager to leave the moment behind, \"but what are you going to do about Catch, Augustus Brine?\" 11 EFFROM Effrom Elliot awoke that morning eagerly anticipating his nap. He\u0027d been dreaming about women, about a time when he had hair and choices. He hadn\u0027t slept well. Some barking dogs had awakened him during the night, and he wished he could sleep in, but as soon as the sun broke through his bedroom window, he was wide awake, without a hope of getting back to sleep and recapturing his dream until nap time. It had been that way since he had retired, twenty-five years ago. As soon as his life had eased so that he might sleep in, his body would not let him. He crept from bed and dressed in the half-light of the bedroom, putting on corduroys and a wool flannel shirt the wife had laid out for him. He put on his slippers and tiptoed out of the bedroom, palming the door shut so as not to wake the wife. Then he remembered that the wife was gone to Monterey, or was it Santa Barbara? Anyway, she wasn\u0027t home. Still, he continued his morning routine with the usual stealth. In the kitchen he put on the water for his morning cup of decaf. Outside the kitchen window the hummingbirds were already hovering up to the feeder, stopping for drinks of red sugar water on their route through the wife\u0027s fuchias and honeysuckle. He thought of the hummingbirds as the wife\u0027s pets. They moved too fast for his tastes. He had seen a nature show on television that said that their metabolism was so fast that they might not even be able to see humans. The whole world had gone the way of the hummingbirds as far as Effrom was concerned. Everything and everybody was too fast, and sometimes he felt invisible. He couldn\u0027t drive anymore. The last time he had tried, the police had stopped him for obstructing traffic. He had told the cop to stop and smell the flowers. He told the cop that he had been driving since before the cop was a glimmer in his daddy\u0027s eye. It had been the wrong approach. The policeman took his license. The wife did all the driving now. Imagine it - when he had taught her to drive, he had to keep grabbing the wheel to keep her from putting the Model T into the ditch. What would the snot-nosed cop say about that? The water was beginning to boil on the stove. Effrom rummaged through the old tin bread box and found the package of chocolate-covered graham crackers the wife had left for him. In the cupboard the jar of Sanka sat next to the real coffee. Why not? The wife was gone, why not live a little? He took the regular coffee from the shelf and set about finding the filters and filter holder. He hadn\u0027t the slightest idea where they were kept. The wife took care of that sort of thing. He finally found the filters, the holder, and the serving carafe on the shelf below. He poured some coffee into the filter, eyeballed it, and poured in some more. Then he poured the water over the grounds. The coffee came through strong and black as the kaiser\u0027s heart. He poured himself a cup and there was still a little left in the carafe. No sense wasting it. He opened the kitchen window, and after fumbling with the lid for a moment, poured the remaining coffee into the hummingbird feeder. \"Live a little, boys.\" He wondered if the coffee might not speed them up to the point where they just burnt up in the atmosphere. He toyed with the idea of watching for a while, then he remembered that his exercise show was about to start. He picked up his graham crackers and coffee and headed for the living room and his big easy chair in front of the RCA. He made sure the sound was turned down, then turned on the old console set. When the picture came on, a young blond woman in iridescent tights was leading three other young women through a series of stretches. Effrom guessed that there was music playing from the way they moved, but he always watched with the sound turned off so as not to wake the wife. Since he had discovered his exercise program, the women in his dreams all wore iridescent tights. The girls were all on their backs now, waving their legs in the air. Effrom munched his graham crackers and watched in fascination. Time was when a man had to spend the better part of a week\u0027s pay to see a show like that. Now you could get it on cable for only.... Well, the wife took care of the cable bill, but he guessed that it was pretty cheap. Life was grand. Effrom considered going out to his workshop and getting his cigarettes. A smoke would go good right now. After all, the wife was gone. Why should he sneak around in his own house? No, the wife would know. And when she confronted him, she wouldn\u0027t yell, she would just look at him. She would get that sad look in her blue eyes and she would say, \"Oh, Effrom.\" That\u0027s all, \"Oh, Effrom.\" And he would feel as if he had betrayed her. Nope, he could wait until his show was over and go smoke in his workshop, where the wife would never dare to set foot. Suddenly the house felt very empty. It was like a great vacant warehouse where the slightest noise rattles in the rafters. A presence was missing. He never saw the wife until she knocked on his workshop door at noon to call him to lunch, but somehow he felt her absence, as if the insulation had been ripped from around him, leaving him raw to the elements. For the first time in a long time Effrom felt afraid. The wife was coming back, but maybe someday she would be gone forever. Someday he would really be alone. He wished for a moment that he would die first, then thinking of the wife alone, knocking on the workshop door from which he would never emerge, made him feel selfish and ashamed. He tried to concentrate on the exercise show but found no solace in spandex tights. He rose and turned off the TV. He went to the kitchen and put his coffee in the sink. Outside the window the hummingbirds went about their business, shimmering in the morning sun. A sense of urgency came over him. It became suddenly very important to get to his workshop and finish his latest carving. Time seemed as fleeting and fragile as the little birds. In his younger days he might have met the feeling with a naive denial of his own mortality. Age had given him a different defense, and his thoughts returned to the image of he and the wife going to bed together and never waking, their lives and memories going out all at once. This too, he knew, was a naive fantasy. When the wife got home he was going to give her hell for going away, he knew that for sure. Before unlocking his workshop he set the alarm on his watch to go off at lunchtime. If he worked through lunch he might miss his nap. There was no sense in wasting the day just because the wife was out of town. When the knock came on his workshop door, Effrom thought at first that the wife had come home early to surprise him with lunch. He ground out his cigarette in an empty toolbox that he kept for that purpose. He blew the last lungful of smoke into the exhaust fan he had installed \"to take out the sawdust.\" \"Coming. Just a minute,\" he said. He revved up one of his high-speed polishing tools for effect. The knocking continued and Effrom realized that it was not coming from the inside door that the wife usually knocked on, but from the one leading out into the front yard. Probably Jehovah\u0027s Witnesses. He climbed down from his stool, checked the pockets of his corduroys for quarters, and found one. If you bought a Watchtower from them, they would go away, but if they caught you without spare change, they would be on you like soul-saving terriers. Effrom threw the door open and the young man outside jumped back. He was dressed in a black sweatshirt and jeans - rather casual, Effrom thought, for someone carrying the formal invitation to the end of the world. \"Are you Effrom Elliot?\" he asked. \"I am.\" Effrom said. He held out his quarter. \"Thanks for stopping by, but I\u0027m busy, so you can just give me my Watchtower and I\u0027ll read it later.\" \"Mr. Elliot, I\u0027m not a Jehovah\u0027s Witness.\" \"Well, I have all the insurance I can afford, but if you leave me your card, I\u0027ll give it to the wife.\" \"Is your wife still alive, Mr. Elliot?\" \"Of course she\u0027s alive. What did you think? I was going to tape your business card to her tombstone? Son, you\u0027re not cut out to be a salesman. You should get an honest job.\" \"I\u0027m not a salesman, Mr. Elliot. I\u0027m an old friend of your wife\u0027s. I need to talk to her. It\u0027s very important.\" \"She ain\u0027t home.\" \"Your wife\u0027s name is Amanda, right?\" \"That\u0027s right. But don\u0027t you try any of your sneaky tricks. You ain\u0027t no friend of the wife or I\u0027d know you. And we got a vacuum cleaner that\u0027d suck the hide off a bear, so go away.\" Effrom started to close the door. \"No, please, Mr. Elliot. I really need to speak to your wife.\" \"She ain\u0027t home.\" \"When will she be home?\" \"She\u0027s coming home tomorrow. But I\u0027m warning you, son, she\u0027s even tougher than I am on flimflam men. Mean as a snake. You\u0027d be best to just pack up your carpetbag and go look for honest work.\" \"You were a World War One veteran, weren\u0027t you?\" \"I was. What of it?\" \"Thank you, Mr. Elliot. I\u0027ll be back tomorrow.\" \"Don\u0027t bother.\" \"Thank you, Mr. Elliot.\" Effrom slammed the door. His angina wrenched his chest like a scaly talon. He tried to breathe deeply while he fingered a nitroglycerin pill from his shirt pocket. He popped it into his mouth, and it dissolved on his tongue immediately. In a few seconds the pain in his chest subsided. Maybe he would skip lunch today, go right to his nap. Why the wife kept sending in those cards about insurance was beyond him. Didn\u0027t she know that \"no salesman will call\" was one of the three great lies? He resolved again to give her hell when she got home. When Travis got back into the car, he tried to hide his excitement from the demon. He fought the urge to shout \"Eureka!\" to pound on the steering wheel, to sing hallelujah at the top of his lungs. It might finally be coming to an end. He wouldn\u0027t let himself think about it. It was only a long shot, but he felt closer than he ever had to being free of the demon. \"So, how\u0027s your old friend?\" Catch said sarcastically. They had played this scene literally thousands of times. Travis tried to assume the same attitude he always had when faced with those failures. \"He\u0027s fine,\" Travis said. \"He asked about you.\" He started the car and pulled away from the curb slowly. The old Chevy\u0027s engine sputtered and tried to die, then caught. \"He did?\" \"Yeah, he couldn\u0027t understand why your mother didn\u0027t eat her young.\" \"I didn\u0027t have a mother.\" \"Do you think she\u0027d claim you?\" Catch grinned. \"Your mother wet herself before I finished her.\" The anger came sliding back over the years. Travis shut off the engine. \"Get out and push,\" he said. Then he waited. Sometimes the demon would do exactly what he said, and other times Catch laughed at him. Travis had never been able to figure out the inconsistency. \"No,\" Catch said. \"Do it.\" The demon opened the car door. \"Lovely girl you\u0027re going out with tonight, Travis.\" \"Don\u0027t even think about it.\" The demon licked his chops. \"Think what?\" \"Get out.\" Catch got out. Travis left the Chevy in drive. When the car started moving, Travis could hear the demon\u0027s clawed feet cutting furrows in the asphalt. Just one more day. Maybe. He tried to think of the girl, Jenny, and it occurred to him that he was the only man he had ever heard of who had waited until he was in his nineties before going on his first date. He didn\u0027t have the slightest idea why he had asked her out. Something about her eyes. There was something there that reminded him of happiness, his own happiness. Travis smiled.","sourceLink":"https://allnovel.net/practical-demonkeeping/page-5.html","bookId":2045,"book":{"id":2045,"title":"Practical Demonkeeping","description":"Storyline: Travis was born in 1900, yet he has not aged since 1919, because he accidentally called up a demon from hell named Catch as his servant, presumably forever. Ever since then, Travis has been trying to get rid of Catch, but is unable to do so because he has lost the repository of the necessary incantations. He traces their whereabouts to a fictional town called Pine Cove, along Big Sur coast, where he thinks the woman he gave them to may be residing. Interactions with the townspeople and with a djinn, who is pursuing Catch, create considerable complications.","cover":"https://allnovel.net/images/practical-demonkeeping.jpg","author":"Christopher Moore","type":"Humorous","source":"allnovel","link":"https://allnovel.net/practical-demonkeeping.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:42:06 PM"}}
