{"id":87043,"no":10,"title":"Page 10","content":"‘Here, hold this for a moment, will, you?’ I asked Ella, with one hand starting to open the belt which held Uncle Bufford’s old trousers in place, and handing her my favourite armour against suitors with the other. You aren’t likely to need it to fend off many suitors, though, are you? said a nasty little voice in the back of my head. Not as long as you look so unlike a girl that the most masculine of men doesn\u0027t even recognize you as female. ‘Help me put this on, will you?’ I said to Ella, to drown out the annoying voice in my head. I would not think of Mr Ambrose again. I had done more than enough of that in prison. ‘Of course,’ she responded with a sweet smile and was just about to unbutton the dress when a knock from the door froze her in place. That knock managed to drive all thoughts of Mr Ambrose out of my head far more successfully than any attempts on my part. ‘Ella? Ella, are you still in there? Who are you talking to?’ The high tones of my aunt’s voice penetrated the door. I would have said her voice sounded something like a piece of chalk being dragged across a blackboard, but that would be an insult to chalk all over the world. Before I could stop her, Ella smiled and cried, elated: ‘It’s Lilly, Aunt! She has come back!’ There was a pause. It was filled with the threat of sudden and violent doom. ‘Lillian? Is it true? Are you in there?’ For a moment I considered shouting back, ‘No, not really’ - but then I gave up. There was no sense in pretending anymore. ‘Yes, Aunt, I am here.’ ‘Come out at once! I wish to speak with you. You have a lot to explain, young lady!’ On tiptoes, I went to the door and bolted it. ‘What are you doing?’ Ella mouthed at me, her eyes wide. ‘Protecting our necks,’ I mouthed back at her. ‘I’m sorry, Aunt, but that will have to wait a while,’ I called out. ‘I’m dressing at the moment.’ ‘So what? I am your Aunt. I have seen you dress since you were a little girl.’ She turned the doorknob and pushed - but the door wouldn’t budge. ‘Lillian? Lillian, don\u0027t tell me this door is bolted!’ ‘That’s fine,’ I answered in as light a tone as I could manage while frantically unbuttoning Uncle Bufford’s waistcoat. ‘I won’t tell you, I promise.’ ‘Don’t get smart with me, young lady! Is this door bolted?’ ‘You just asked me not to tell you that. So I can’t, even though technically it actually might be true.’ ‘Lillian!’ Oh-oh… maybe I shouldn’t push her too far. ‘Yes, Aunt, it is bolted.’ ‘Then unbolt and open it at once.’ ‘Sorry, I can’t do that.’ Quickly, I ripped the waistcoat off and stuffed it under my pillow. Now I was standing half-naked in my room, dressed only in striped trousers, a corset and a top hat which for some reason hadn’t fallen off my head yet. ‘I, err… I am preparing a special look for myself today. You always say how I don\u0027t look ladylike enough, don\u0027t you? Well, I’m giving it a special effort today, and I want to surprise you.’ ‘Is that really true?’ ‘Yes.’ I glanced down at my corset and striped trousers. ‘You wouldn’t believe how I look right now - it’s so different from the usual. Trust me.’ ‘I want to know where you were last night.’ ‘I’ll tell you as soon as I’m finished dressing.’ That would give me a little more time to prepare a convincing variation of the lie I had told Ella. ‘Were you with a man?’ I rolled my eyes. Of course that would be the first conclusion my aunt would come to. ‘Will he make an honest woman of you?’ she demanded. ‘No,’ I hissed. All this talk was distracting. Angrily, I fumbled at a waistcoat button which wouldn’t do what I wanted. I needed to get these clothes off fast. ‘What? What kind of rake have you gotten yourself mixed up with?’ ‘I didn’t mean no as in “no he won’t make an honest woman of me”. I meant no as in “no, I wasn’t with a man”.’ ‘Oh.’ She pondered that for a moment, and then demanded: ‘Well, where were you, then?’ Quickly I looked around for a place to hide the top hat. There wasn’t any place I could see, so I just chucked it out of the open window. I would get it later when all the hubbub was over. ‘Like I said, Aunt, I’ll tell you when I’m finished preparing my special look.’ ‘What kind of special look? What exactly is it that you are doing in there?’ ‘Um… Ella will tell you. I’m too busy with dressing.’ I climbed out of the trousers and stuffed them inside my second dress in the wardrobe. When I turned to her, Ella was gaping at me in horror. ‘What am I supposed to tell her?’ she mouthed. ‘Think of something,’ I mouthed back and then transferred my attention to the dress I would have to worm myself into. Handing it to me, Ella hurried to the door. ‘Err… Aunt, well, Lilly is… Lilly is…’ Furiously I tried to struggle into the crinoline while Ella stood at the door and with a quivering voice told my aunt some nonsense story about how I was doing my hair in a special new style. God, couldn’t she think of a good lie for once? It would be a special day when I decided to style my hair at all, let alone in some special way. My brown locks always looked as if a hurricane had just gone through them in any case, so why bother? But amazingly, my aunt seemed to swallow the story. She stopped trying to come in, and, after a time, went off grumbling. Five minutes later I was completely dressed, styled and mentally prepared. Ella had even lavished her skills on me and provided me with a hasty yet luscious hairdo, to give at least a little bit of credence to her story. She squeezed my hand in silent encouragement. Finally, I took a deep breath, unbolted the door, plastered a bright smile on my face and stepped out into enemy territory. My aunt was waiting for me on the landing, her thin arms folded in front of her chest, the glower of her narrow eyes directed at me like that of the ancient Roman god Jupiter at some poor wrongdoer he was just about to smite with a thunderbolt. All she was missing was the toga and the long white beard.","sourceLink":"https://allnovel.net/storm-and-silence/page-10.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
