{"id":87169,"no":138,"title":"Page 138","content":"His eyes narrowed infinitesimally. ‘Or at least while you’re drunk you can’t be, apparently.’\\n\\n ‘Yes, Sir! Exactly, Sir!’\\n\\n He gave me his coldest glare yet this evening. But then, suddenly, his eyes shifted upward, looking over my shoulder. Turning my head, I followed his gaze and saw the grimy landlord watching us with suspicious little eyes.\\n\\n ‘Over here,’ Mr Ambrose commanded in a low voice and, without waiting for an answer, grabbed me by the arm and dragged me into a quiet corner.\\n\\n ‘I can’t believe it!’ There really was disbelief in his voice, mingled with exasperation and wonder and… well probably a lot of other things I was too intoxiwhatsicated to notice. ‘I can simply not believe it. You have been drinking. And not just drinking any drinks, but drinks containing alcohol!’\\n\\n ‘What’s so strange about it?’ I mumbled. ‘People do it every day.’\\n\\n ‘Men do it every day! But you are… you are…’\\n\\n ‘Yes?’ I smiled up at him. I felt like smiling. I felt like it was a happy world. ‘I am what?’\\n\\n ‘A girl!’\\n\\n ‘Really? Gosh. I hadn’t noticed.’\\n\\n He drew a deep breath.\\n\\n ‘When men gather after dinner to consume alcoholic beverages, Mr Linton,’ he pointed out in a very tight, controlled voice, ‘it is the custom of civilized society that women leave the room, because women have no interest in alcohol and no business drinking it. It is not within their nature.’\\n\\n ‘Very interesting, I’m sure.’ My grin grew wider. It was getting a bit easier to talk without stumbling over my syllables. ‘But since, as you’re so often kind enough to point out, I am Mister Victor Linton while in your employ, what do those poor, alcohol-deprived females have to do with me?’\\n\\n ‘Why in heaven’s name did you drink?’\\n\\n ‘You ordered me to.’\\n\\n ‘I never…’\\n\\n ‘You said to behave like everybody else. Everybody else was drinking. You were.’ I nudged him playfully in the ribs, something that I vaguely knew I normally wouldn’t have done with a ten foot pole. ‘Don’t you remember? Another one, me good fellow, hm?’\\n\\n From the look Mr Ambrose gave me, he didn’t appreciate being nudged playfully in the ribs very much. Nor did he apparently appreciate vocal impersonations.\\n\\n ‘You,’ he told me in a tone that could have frozen the Sahara, ‘are a disgrace to your sex.’\\n\\n ‘Which one would that be?’\\n\\n From freezing the Sahara, his eyes went right on to the Kalahari.\\n\\n ‘That is a discussion we will have at a later time. Right now, Mr Linton, I have to go interview the man we came to look for, before he decides to leave.’\\n\\n ‘How may I be of assi… assissi… assistance, Sir?’\\n\\n ‘You may go into that room there,’ he said, pointing to the door which led to the pub’s back room, ‘sit quietly in a corner and not touch another drop of alcohol until I come to get you. Understood?’\\n\\n ‘Y-yes, Sir… I understand.’ Damn! I was stumbling over syllables again. ‘But how will that help you f-find the file?’\\n\\n ‘By having you out of my way. Now go!’\\n\\n With that, he turned and strode towards the tables.\\n\\n I scowled after him. That hadn’t been very nice. And I didn’t like it when people weren’t nice to me, particularly not him! Still scowling, I moved towards the door he had indicated. It took me a few moments to get through it, because it was rather difficult to determine which of the three doors that kept dancing around in front of my eyes was the one I wanted, but eventually I managed it. In the back room, there were more tables, and a maid was running around, taking orders.\\n\\n Most of the men here were drinking from mugs or glasses that were a lot smaller than the ones out front. I slumped down at one of the tables, where another man was already sitting, and waved the maid towards me.\\n\\n ‘I’ll have what he’s having,’ I’ll ordered. ‘And there\u0027ll better be no donkey’s hoofs or bull’s horns or other animal parts in there!’\\n\\n The maid blinked at me in confusion. ‘Sorry, Sir?’\\n\\n ‘Oh, forget it! Just get me a drink!’\\n\\n ‘Aye, Sir.’\\n\\n I watched her bustle away and gave a derisive snort. Blast Mr Ambrose! Don’t drink any more my foot! I would show him!\\n\\n ‘Here, Sir.’\\n\\n Ah, my mug had arrived. I took the tiny little thing, sniffed - and broke out into a coughing fit. By George, that smelled sharp! But I had already ordered it now, so I might as well drink it. And anyhow, it wasn’t as if it could do much harm. The mugs were much smaller here, after all…\\n\\n I had to confess, after a while I got rather fond of the stuff that came in small mugs. Admittedly, at first it made your throat burn and your eyes water, but in the long run, it had the most interesting effects. For instance, not so long ago, a troop of jolly little yellow pigs had come out of the chimney and started to dance on the back wall. They were performing quite excellently, all thanks to this amazing liquid that had opened my eyes to a new world.\\n\\n I pounded the table with my fist.\\n\\n ‘Another one! Another cow’s ear… or was it pig’s tail… Darn it! Another cup of this stuff!’\\n\\n The maid hurried to my table and deposited another cup in front of me with an anxious expression. Was she afraid of me? Maybe it was this miraculous substance that I was consuming, making my voice all rough and manly, that made me more intimidating. I grinned. I liked the idea.\\n\\n Swiftly, I grasped the metal cup and gulped down its contents. Yes, I could really grow to like this drink. It made you feel pleasantly woozy.\\n\\n ‘Ey there, little fellow! Are ye planning to drink the whole River Thames in one night? Leave something for the rest of us.’\\n\\n Somebody laughed. I looked up from my empty cup and saw that the words had come from the other chap sitting at the table. He hadn’t said a word before, but now he was grinning at me.\\n\\n I gave his question a few moments of serious contemplation.\\n\\n ‘No,’ I finally decided. ‘I don\u0027t want to drink the Thames. There’s too much crap swimming in it.’\\n\\n That got another laugh from him and a few of the other people around us.\\n\\n ‘Blast it,’ my table partner told me, raising his cup to me, ‘I’m impressed. Ye \u0027old your licker well, considering.’ \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-138.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
