{"id":87048,"no":15,"title":"Page 15","content":"‘How could you not catch them?’ Patsy gave me a strange, sideways look. ‘It was in all the papers.’\\n\\n Well, I was sitting in prison all day, you know. We don\u0027t get papers there.\\n\\n That’s what I would like to have said, just to see the look on her face. But I didn’t. My friends didn’t know anything about my little adventure on Friday, and if I could, I wanted to keep it that way. They didn’t need to know what a fool I had made of myself. It had been a crazy idea from the beginning, this whole dressing-up-as-a-man thing, and I just wanted to forget it as quickly as possible. So instead, I said:\\n\\n ‘I… was busy. Very busy.’\\n\\n ‘Well, you didn’t miss anything worth hearing.’ Patsy stabbed at the air with her parasol, as if it were a conservative politician. ‘You want the result? A landslide victory for the Tories, of course! The Whigs were flattened. So no reforms on women’s suffrage, nor on any other sensible subject by the way!’\\n\\n A depressive silence fell over our little group for a while, and the morning, which had seemed cheerful right up until then, suddenly wasn’t quite as enjoyable any more.\\n\\n Without warning, Eve clapped her hands together and woke us from mourning over our lost freedom. ‘Time for a little cheering-up! Look what a treat I’ve brought!’ She fished something out of her pocket and held it out: four brown, rectangular objects. They didn’t look very appetizing.\\n\\n ‘What are those?’ I asked, suspiciously.\\n\\n ‘It’s a new invention, just come on the market,’ Eve trilled excitedly. ‘It’s chocolate.’\\n\\n ‘Don’t be silly. Chocolate is a drink,’ Patsy objected. ‘It’s not solid.’\\n\\n ‘Not usually no. But,’ she lowered her voice conspiratorially, ‘this fellow - Fly or High, I think he’s called - developed a method to make it solid.’[9]\\n\\n I carefully tapped against one of the brown objects. It was quite hard. ‘And it stays that way? A bit hard to swallow, wouldn’t it be?’\\n\\n ‘No, no. It dissolves in your mouth.’\\n\\n ‘Really?’\\n\\n ‘Yes, yes. Well, that’s what it said in the advert, anyway.’\\n\\n That didn’t inspire much confidence in me.\\n\\n ‘Why would anyone want to make chocolate solid?’ Patsy demanded. ‘If it only dissolves again afterwards, what’s the point?’\\n\\n ‘Oh, don\u0027t be such a stick-in-the-mud!’ Eve was almost bouncing with excitement now. ‘It’s something new, something exciting. People call it a chocolate bar, and they say they’re fantastic! So try them out already, will you? I spent all my pocket money on them!’\\n\\n That final argument persuaded me. I knew enough about what it was like not to have much money to understand the sacrifice. Slowly, I took one of the ‘bars’ of chocolate and carefully deposited it in my mouth. The others followed my example. A tense silence settled over our group as we waited. The bars didn’t explode or attack our teeth, which was a good sign to begin with. On the other hand, they didn’t taste much like anything.\\n\\n At least at first.\\n\\n Then, the brown stuff suddenly started growing softer and softer, and the taste began to flood my mouth. I started licking and chewing faster and faster.\\n\\n ‘Goodness!’ Flora fanned herself. ‘That really isn’t fair! To have something that looks so plain and unappetizing, and then have it attack you like that… Dear me. Dear, dear me.’\\n\\n ‘Is it good?’ asked Eve, who still hadn’t put her piece into her mouth, but seemed to be anxiously awaiting our judgement.\\n\\n I sighed contentedly. Finally something that made me forget my troubles for a minute or two. I opened my mouth long enough to say: ‘More than good. It’s… yummy! The best thing I’ve ever tasted. The fellow who invented it, has he been knighted yet?’\\n\\n ‘I don\u0027t believe so.’\\n\\n ‘Just one more sign that there’s no justice in this country,’ I groaned, and Patsy as well as Flora nodded their consent, chewing energetically.\\n\\n ‘So we have one more thing on our to-do list,’ laughed Patsy, in her deep, throaty horse-laugh. ‘Achieve women’s suffrage and get the inventor of solid chocolate bars knighted for his achievements.’ Suddenly despondent, she shook her head. ‘Sometimes I just despair and think that women will never have equal rights with men in this lousy excuse for a country,’ she sighed. ‘We might as well forget about campaigning for women’s suffrage and just start dressing up in men’s clothes for the next election.’\\n\\n I coughed, and almost choked on my chocolate bar. Luckily, the others were too busy with eating to notice, and I quickly forced it down.\\n\\n Eve cleared her throat and winked at her large friend. ‘Not to put too fine a point on it, Patsy… That might work for you, but I doubt the rest of us could pull it off.’\\n\\n Patsy pounded the ground with her parasol. ‘And why I and not the rest of you, Eve?’\\n\\n ‘Because, my dear Patsy, you have a nose like a lumpy potato and enough bone in your chin for three good men. If we put you in a suit, everybody would bow to you and call you Sir.’\\n\\n ‘Do you want a parasol hammered on your head, Eve?’\\n\\n ‘Not particularly, no.’\\n\\n ‘Then I suggest you quickly take yourself out of my reach.’\\n\\n Eve sprang up laughing, snatched up a bird and racket I hadn’t seen before and gaily ran off into the Park, dancing around, hitting the bird, catching it with the racket and hitting it skywards again. She missed as often as she hit, but that didn’t seem to bother her.\\n\\n ‘I don\u0027t think I could do it,’ Flora offered shyly. ‘Dressing up as a man, I mean. You could, Patsy, but not I.’\\n\\n ‘Of course you could, Flora!’ Patsy gave her a hearty slap on the back that almost catapulted the little girl off the bench. ‘Come, Lilly, back me up! Everybody could do it, couldn’t they?’\\n\\n I contemplated the question carefully for a moment. ‘No,’ I said, finally, shaking my head. ‘I think I would end up getting thrown in prison and landing myself in all sorts of troubles I hadn’t counted on.’\\n\\n My friends and I continued to sit long after that on the little bench under the oak and discussed politics, fashion, and the folly of men. But I had to admit that once the soothing effects of the wondrous solid chocolate waned, Mr Ambrose intruded more and more often on my thoughts. \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-15.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
