{"id":87205,"no":174,"title":"Page 174","content":"I’m not an expert on romance, but I suppose something like that dampens the ardour of even the most determined Casanova.\\n\\n ‘Tell me, Mr Conway,’ Wilkins, who was completely oblivious to the icy silence in the coach, asked with a bright smile. ‘Where are your family’s estates?’\\n\\n If he had wanted to pick a question to make the other young man despise him even more, he could not have chosen better.\\n\\n ‘My family does not have any estates,’ he said stiffly. ‘My father practices a trade.’\\n\\n ‘A trade? How interesting.’ Wilkins’ smile didn’t waver. ‘What kind of trade, exactly?’\\n\\n ‘My father is a piano tuner.’\\n\\n A snort could be heard from the corner in which Maria sat. And for the first time in my life, I saw my sweet little sister Ella throw somebody a murderous look. Wilkins, for his part, continued his babbling, completely unaware of the icy stares he received. He seemed to be fascinated by the whole subject of piano tuning. Apparently, before tonight he had thought pianos just sounded the same all the time by themselves.\\n\\n ‘One never ceases to learn,’ he remarked. ‘Pianos seem to be like flowers, in a way. Flowers have to be taken care of regularly, too, or they shrivel.’\\n\\n ‘But, unlike pianos,’ Edmund pointed out, ‘flowers cannot make music.’\\n\\n ‘True, very true. A pity that is. If they could, they would be perfect.’\\n\\n Ella sneaked a quick glance at Edmund, who was looking out of the window. ‘Nothing in this world is perfect,’ she said in a sad, quiet voice.\\n\\n I thought she had hit the nail on the head with that. But Wilkins, the blasted son of a bachelor, leant forward, took her hand and pressed a light kiss on the back of it.\\n\\n ‘Apart from your beauty, fair lady,’ he said with a wink.\\n\\n From the corner where Edmund sat, I heard a gagging noise. I was beginning to ask myself whether bringing him along had really been such an ingenious idea.\\n\\n But when we drew up in front of Lady Metcalf’s house and climbed out of the carriage, and I saw Ella looking at him as if there was no other man in the world, I knew I couldn’t not have brought him along. From inside the house, I could hear the musicians try the first notes of music. On Ella’s face, I could read her emotions as plainly as if they were written in a book: she was at a ball, and Edmund was with her. If only he could come to her, take her in his arms and dance till the night turned into morning…\\n\\n Setting his jaw, Edmund took a determined step towards her.\\n\\n ‘Ah, there you are, Miss Ella!’ Smiling broadly, Wilkins appeared at Ella’s right elbow, offering her his arm. ‘Shall we go in?’\\n\\n Edmund stopped in his tracks.\\n\\n Ella looked at her lover for a moment longer, then she wrenched her gaze away from his and faced the house again.\\n\\n ‘Yes,’ she said. ‘Let’s go.’\\n\\n At the door to the ballroom, Lady Metcalf awaited us.\\n\\n ‘Sir Phillip,’ she trilled, clapping her pudgy hands together. ‘How wonderful to see you again!’ She didn’t mention that it was wonderful to see the rest of us. But then, considering that none of us was titled or rich, it probably wasn’t, for her.\\n\\n Suddenly, I realized that Wilkins, busy with greeting Lady Metcalf, had had to let go of Ella’s arm. Quickly, I slipped in between them and took Ella’s hand with a firm grip. She looked up at me, a world of thanks shining in her eyes.\\n\\n ‘Please, come in.’ With a false smile directed at all of us, the lady of the house waved us towards the open door. ‘The first dance will start very soon, I believe.’\\n\\n Sir Philip nodded and reached for Ella’s hand - only to find that it had, by instant-sister-transfer, been moved to a safe distance, along with the rest of her. Confused, he blinked up at us, standing three paces away, then smiled his guffin smile again and started towards us.\\n\\n ‘Please, Lilly,’ a hurried whisper shot out of Ella’s mouth. ‘Please don\u0027t leave me alone with him. I can’t explain why, right now, but I don\u0027t want to be alone with him. Please…’\\n\\n She didn’t have to say another word. I was already dragging her through the door and into the ballroom.\\n\\n Bright light exploded in a magnificent spectacle before us. After the dim light of the street lamps outside, we both had to pause and blink for a moment, until our eyes got used to the sparkling scene in front of us: crystal chandeliers shining in the candlelight, women in brightly coloured dresses, men in glossy black evening wear, and large windows which, with the black night outside, worked like mirrors and made the room seem twice as large, the guests twice as multifarious.\\n\\n ‘…quite the society event,’ we heard Lady Metcalf’s voice from behind us. ‘Important people from all over England have come, gentry, military, knights of the Order of the Garter… even one of the Peers of the Realm has been kind enough to accept my invitation.’\\n\\n ‘Yes, Lady Metcalf,’ came Wilkins\u0027 reply. ‘I’m sure it’s magnificent. Now if you will excuse me, I have to go after Miss…’\\n\\n ‘Quick!’ I hissed, and pulled Ella to the left, into a throng of people gathered around some painting, a recent addition to Lady Metcalf’s collection. There wasn’t a single flower on the painting, so I was inclined to think that Sir Philip wouldn’t be likely to join the crowd of admirers.\\n\\n Ella slid behind a column left of the painting and sank against it, not being able to support her weight anymore on her legs alone.\\n\\n ‘Dear God, Lilly,’ she sighed. ‘Thank you! I… I don\u0027t know what I would do if he caught me alone. I…’\\n\\n She watched me with wide, fearful eyes, unable to find the words to explain.\\n\\n ‘It’s quite all right,’ I said, patting her shoulder with a reassuring smile on my face. ‘I wouldn’t like to spend all night in the company of such a nincompoop, either.’\\n\\n She gave me a grateful smile.\\n\\n ‘Yes, that’s all. I just feel… uncomfortable with him.’\\n\\n ‘Don’t you worry. I’ll keep you safe.’\\n\\n Taking my hand, she pressed it, just for a moment, then let it go again.\\n\\n ‘I know,’ she whispered.\\n\\n There was a moment of companionable, or should I say sisterly, silence. Around us, people discussed Dürer’s particular style. I, for my part, had no idea what his style was, if he had one at all, and if he had, what he did with it. But I really didn’t care. All I cared about was that Ella was with me, and for the moment, she was safe. \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-174.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
