{"id":87217,"no":186,"title":"Page 186","content":"There were a few minutes of silence. Then, Edmund spoke again, and his voice was a little unsteady. ‘Ella, I… I have to ask your forgiveness.’ ‘Forgiveness, Edmund? For what?’ He swallowed. ‘For this… for my devious plans. For how I tried to lure you away from your home, your family, and trap you in a disgraceful union. Now that the weight of Wilkins is lifted off my mind, I can hardly comprehend what I was thinking, what I was doing. And I’m not just talking about my plans to run away with you. The way I’ve been acting, presuming to touch you where I shouldn’t touch you, presuming to hold you like no gentleman should… I must have been mad! I… I only ever want to behave to you as a gentleman should behave, Ella. You are the sweetest, most gentle lady that ever walked the earth. You deserve nothing less, in fact, you deserve a lot more.’ Again, he took a breath. ‘So, I wanted to apologize for all I did. I wish you to know that, had there been any other way, had I been master of myself and my heart, I would never have suggested an elopement. If you can, forgive me, and forget all about it. We will go back to the way things were. I will behave with propriety towards you, and never again step out of line.’ ‘Of course I forgive you, Edmund.’ Was something wrong with my ears or did she sound a tiny bit disappointed. ‘And of course you are right. We should behave properly. We have been acting… foolishly, lately.’ He nodded. She nodded. Yet he didn’t loosen his grip on her, still holding her in a manner that I, at least, would not have termed proper for a gentleman. ‘Before we return to propriety and forget foolishness, though…’ he muttered, his voice rough. ‘Yes?’ Her voice was tinged with hope. ‘Could I hold you for just one minute longer?’ Tears sparkled in her eyes as she pulled him even closer. Unlike so often in the last few weeks, I knew that this time, they were tears of happiness. ‘Yes!’ It was only next morning I realized that, during the latter half of the romantic interlude in the garden, I hadn’t once got bored and reached for The Further Adventures of Robinson Crusoe. Did this mean I was actually developing an interest in romance? If that were the case, I thought I’d better find a lake to drown in! But no! It had to be that I was simply happy to see Ella happy. Yes, that was a perfectly legitimate reason to stare at her from behind a bush. My reasons had nothing whatsoever to do with the fact that I was beginning to wonder what it might be like to have somebody care for me the way Edmund cared for her. Nothing at all like that. And Ella was happy, incandescently happy. It was as though she was a flower that had been squashed by a heavy stone. Now that the stone had been lifted and the sun could reach her again, she stretched towards the sky, unfurling her petals and blooming like never before. She even had her own bee fluttering around in the form of Edmund, though I would biff him if he should try to pollinate her. Even metaphors should have their limits. Apart from the happy time I spent in the garden each evening, listening to Ella’s profusions of happiness, I tried to avoid home as much as possible over the next few days. My aunt was still in a china-chucking mood, and even though Uncle Bufford, by a message sent via the trusty Leadfield, had strictly forbidden her to indulge in such wanton waste of perfectly good crockery, she might still succumb, and my head was too precious to me to serve as a target. Moreover, Patsy and the others frequently appeared at home to try and capture me for the purpose of questioning. I had no wish to be subjected to their inquisition on the why and how of my spectacular speech at the anti-suffragist rally, at least not until I had thought of satisfactory lies to give as answers. So, you can see, I had all the reasons in the world to avoid home for now and seek refuge in another place that afforded me more peace and quiet. And the only other place available to me was number 322 Leadenhall Street. Did I mention something about finding peace and quiet? Well, it didn’t quite work out that way. Mr Linton Bring me file 38XI201. Rikkard Ambrose Springing up from my chair, I ran towards the shelves containing the file boxes. I needed about two seconds to reach my goal, three seconds to grab the books, and another three seconds to return. By the time I reached my desk with the correct file in hand, another message had already landed beside the first one. I didn’t need to open it to know it said Hurry! or Faster! Mr Rikkard Ambrose was a tiny bit impatient and acrimonious these days. I could guess why. A deadline was looming over us like the shadow of an evil giant - a giant with a hawk-beak nose, a golden mane of lion’s hair, and piercing steel-blue eyes. Soon it would be time. Soon, Mr Ambrose would try to get back what was his, by force. And I would not join him in the venture. That fact gnawed at me like a pesky rat, not willing to let go of its dinner. After all, I had found out where this precious file, the contents of which he still hadn’t deigned to share with me, was being kept. And I wouldn’t be part of the retrieval! If only he had, at least, kept his mouth shut about the file’s contents. His vague, sinister statement was driving me to distraction. The centre of the world. Whose world? Surely, he didn’t mean it geographically, as in the earth’s core? Something like that couldn’t be contained in a piece of paper. But then, what? Not knowing was making me imagine all sorts of terrible things. What did Mr Ambrose consider the centre of the world? Money? Was the file, in fact, a deed signing his entire fortune over to another? All of a sudden, I thought of Edmund and Ella. He was the centre of her world, and she of his. Could it be…? Could the file contain illicit notes revealing a romantic relationship with somebody who was the centre of Mr Ambrose’s world? Maybe… said a nasty little voice in my mind, Maybe the writer of the pink letters? No. Mr Ambrose wouldn’t go berserk over a woman. The possibility of losing all his money, yes, that would make him bite off heads. But I couldn’t see him fretting over a lady’s reputation. Not even that mysterious femme fatal who continued her pink missives with infuriating regularity. The pile of letters in my bottom drawer was growing larger. And Mr Ambrose was growing more persistent in keeping up my working morale every day.","sourceLink":"https://allnovel.net/storm-and-silence/page-186.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
