{"id":87219,"no":188,"title":"Page 188","content":"My inner feminist slammed shut the door on that voice. ‘You can’t make me do anything,’ I whispered. Why the heck did I whisper? My voice should be strong and independent! It’s those darn eyes of his! They’re sapping the strength out of you, making you feel all gooey and weak-kneed. No man should be allowed to have eyes like that! ‘I can,’ he bit out. ‘Stay away from him. That is an order, Mr Linton!’ I opened my mouth to argue - not because I really wanted to go near Dalgliesh; I mean, I’m not completely nuts - but because I refuse on principle to be ordered around by a man after working hours. But when Mr Ambrose’s head moved forward, the words caught in my throat. What was he doing? Why was he moving so close to me? He was just inches away! He couldn’t possibly… Could he? For just one moment, it looked as though he was going to kiss me. Then the moment passed, and he halted, his perfect granite face only a fraction of an inch away from mine. His hard body pressed into mine, a living threat, ready to deliver. His eyes narrowed infinitesimally, challenging me to dare and speak the words that were on my tongue. I swallowed. Memories flooded my mind. Memories of him pressed against me, just like that - only back then, he had taken the plunge, and closed the last bit of distance that separated us. Today, he was in control - of himself and me. The hand that still gripped my shoulder, pressing me into the wall, was steady as rock. But how long would he hold out? How long would he be able to refrain from reliving our memories? They’re not memories! I told myself, fiercely. You imagined it! You imagined it all! You did not let yourself be kissed by Mr Ambrose! And you most certainly did not enjoy it more than you ever enjoyed anything else in your life, understood? ‘Will you stay away from him?’ Mr Ambrose demanded. His breath tickled my skin as he spoke, momentarily robbing me of the strength to answer. ‘Y-yes,’ I managed. He gave a curt nod. ‘Adequate.’ ‘But,’ I hurriedly tacked on, ‘not because you said so. I’ll stay away because I, as an independent, strong woman independently decided, on my own, to stay away from him!’ He cocked his head as if to say, ‘As long as you do what I say, why do you think I care about the why?’ I glowered at him. He ignored me. ‘Let me go!’ I demanded. He still ignored me. Taking a deep breath, he leant forward just a little more. The sensation that hit me was shocking! Not his lips, no - they were much softer than this. It was his forehead, resting against mine. I could feel a few wild strands of my hair tickling his forehead, and… my God! He really was hard-headed! In the literal sense of the word. And bloody heavy! It was downright uncomfortable. Really? If it’s so uncomfortable, why don’t you want him to pull away? His eyes bored into mine. ‘Swear!’ He demanded. ‘Swear to me you’ll stay away from him!’ Swear. Not promise, not pledge, swear. And I had a feeling that an oath sworn to Mr Rikkard Ambrose had better not be broken. So I quickly crossed my fingers behind my back, just in case. ‘I swear.’ And suddenly he was gone. I swayed for a moment, used to the press of his body into mine. He was standing three feet away, standing tall and forbidding, as if we hadn’t just been pressed more tightly together than two flounders in a printing press. ‘Quite sensible of you, Mr Linton.’ Sensible? Sensible? I didn’t feel very sensible right now! Or reasonable, or cautious, or prudent, for that matter. I sucked in a deep breath, my eyes still fixed on Mr Ambrose, fumbling for something to say. Something that wasn’t Come back here! I wasn’t finished with you! ‘But it doesn’t make any sense!’ Finally, some words had managed to find their way out of my mouth. And they sounded angry, not breathless. Good. ‘Indeed?’ Mr Ambrose regarded me coolly. ‘What are you referring to, exactly, Mr Linton?’ ‘Lord Dalgliesh! Why would I have to try and stay away from him? What does he want from me? For some reason, at the ball he was determined to find out your reason for dancing with me. But it was just one dance! Why would he be interested in that? I mean… what’s one dance?’ ‘He has been trying to find a weak spot in my armour for years now, Mr Linton. If he had reason to believe that I had formed a romantic attachment to someone, this would give him the hold over me he has always desired.’ ‘But… why would he think that, after just one dance?’ There was a pause. Then he said, in voice so low I hardly caught it: ‘I don’t dance, Mr Linton.’ My heart made a jump. ‘Not ever?’ ‘No. It’s a waste of time.’ ‘But you danced with me.’ ‘Yes.’ A muscle in his jaw twitched. ‘Apparently, that one dance was enough to convince Dalgliesh that I might have formed a romantic attachment to you.’ Abruptly, he turned and strode back to his desk. ‘Ridiculous, of course, but there you are.’ Unconsciously, my hands closed into fists. Ridiculous, is it? ‘Oh,’ I said pointedly, ‘So he thought I was the centre of your world?’ He froze halfway to his desk. Slowly turning back towards me, he met my eyes with his own. Their dark force took my breath away. ‘Probably.’ ‘What is it?’ Why was my voice so low and breathy all of a sudden? ‘What is the centre of the world for you?’ ‘I’ll tell you what it is not, Mr Linton. It most certainly not a girl.’ Why this odd tugging sensation in my chest? Had I ever expected the centre of Mr Ambrose’s world to be anything emotional? ‘I asked what it is,’ I told him, forcing my voice to be firm. ‘Not what it is not.’ ‘I know.’ ‘So are you going to tell me?’ ‘No.’ ‘But-’ He cut me off with a jerk of his hand. ‘You,’ he said, ‘are not in here to question me. You were in here to answer my questions. You have done so. You can leave. Now.’ ‘But-’ ‘That is an order, Mr Linton!’ Slowly, I got to my feet and walked away. At the door, I turned to look over my shoulder a last time. He was sitting there at the desk, with that unfathomable lack of expression on his face that belonged solely to him.","sourceLink":"https://allnovel.net/storm-and-silence/page-188.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
