{"id":87227,"no":196,"title":"Page 196","content":"‘You,’ he said in a tone imported straight from Iceland, ‘are an insufferable nuisance.’ His arms tightened even more for a second or two, holding me closer than iron fetters ever could. Besides, iron fetters could never make my heart rate pick up like it did just then. ‘You also,’ he continued grudgingly, ‘have some courage and loyalty. More than I would have expected from a-’ He cut off. Yet I knew what he had been going to say. All of a sudden, he released me, and I stumbled away from him, turning as I did so. He was staring at me with his totally unreadable, sea-coloured eyes, the gloom of the alley making them appear even more dark than usual. ‘You can accompany us,’ he said. ‘But if you get us caught, you are dismissed, no discussion! Understood?’ ‘Um… I thought if we were caught, we would be shot.’ ‘I will dismiss you before we are shot, Mr Linton.’ ‘Yes, Sir! I understand, Sir!’ Turning away, he motioned to Karim. Suddenly he was all business again. ‘Show Mr Linton the plans, Karim.’ Karim’s beard bristled in outrage. ‘But Sahib…!’ ‘If he does not know where we are going, he is likely to get us caught. Show him the plans of the building, Karim. Now!’ Karim clenched his teeth. His master’s tone brooked no discussion. Reluctantly, he unslung the bag from over his shoulder and pulled out of it a large roll of paper, which he unrolled and held against the side of the coach in a spot where the moonlight shone into the alley and illuminated all in its path. By the cold, blueish light I was just able to make out thin lines on the paper, forming what looked like the intricate plan of a large complex. ‘We got these out of the city records,’ Mr Ambrose explained curtly. ‘They’re decades old, and probably not up-to-date anymore, but Dalgliesh has made sure that any more recent versions have disappeared from the face of the earth.’ He pointed to a spot at the eastern side of the complex. ‘We will enter the building here-’ ‘Why on the east side?’ I asked. ‘That’s between the building and the docks, Lord Dalgliesh’s centre of power. Isn’t it likely that there will be many of his men, there?’ Mr Ambrose threw me a look. ‘Which is exactly why we will come from this direction. He will not expect it. Do not interrupt me, Mr Linton. I don\u0027t wish to have to repeat myself.’ He tapped the point on the plan. ‘As I said, we will enter here-’ ‘How exactly?’ I demanded. ‘In case you hadn’t noticed, there’s a wall in the way.’ His finger stopped tapping. ‘What did I say about not interrupting, Mr Linton?’ ‘Excuse me, Sir. Carry on, Sir.’ ‘The guards will be drawn off by a distraction on the western side of the building. We will have to climb over the wall, and thus penetrate into the inner courtyard.’ I still couldn’t see how we would be able to climb over a wall that was at least 24 feet high, but I held my tongue. From the way Mr Ambrose’s left little finger was twitching, I surmised this was not a time to rile him. ‘There will be guards on and in the inner building, too.’ His finger moved across the courtyard to a central, U-shaped building consisting of a large central part flanked by two wings. ‘They might not see us against the dark brick wall, but the courtyard is brightly lit. As soon as we attempt to cross it, we will be spotted. ‘So what do we do?’ Instead of my receiving another rebuke for having interrupted His Mightiness, it was Karim who answered this time. ‘Disguise ourselves,’ he grumbled, opening a bag and pulling out something bright red. It took me a few seconds to recognize uniforms of the Presidency Armies. Suddenly, Mr Ambrose whirled around to face me. ‘But that’s it! Karim, you only brought two uniforms! So sh- he can’t come with us. Mr Linton, you…’ His voice trailed off as he saw Karim’s embarrassed expression. Then, his gaze wandered to the uniforms, of which, there was no doubt, there were three. ‘I thought,’ Karim growled, throwing a venomous look at Warren, who retreated a step or two, ‘that he would be coming with us.’ Mr Ambrose’s little finger twitched again, overcome by uncontrollable rage. ‘Fine,’ he said coolly, and turned back to the plans. ‘We will descend from the wall and hide behind this shed here, where brooms and tools are being kept, according to my information. There, we will change into guard uniforms, so we can cross the courtyard unmolested.’ With his forefinger, he tapped a spot marked with a longish rectangle and a question mark. ‘The door to the main compound may or may not be locked. My sources have not been able to determine that. But from what I know of Dalgliesh, it will be locked thrice and bound with chains. That, however, is no insurmountable problem.’ It seemed to be, to me, all right. I was just about to open my mouth when Mr Ambrose looked up from the map to throw me a cold glare. I closed my mouth again. ‘Once inside, things will become more difficult,’ he continued. Oh, so they’ve been easy up until now? ‘We do not know exactly where the file is. We believe it to be somewhere in this area.’ His finger moved to a red circle that centred on the upper left corner of the building. ‘This is where the office of the overseer was, back in the days when this was still a factory. It is, in all probability, where Dalgliesh’s office is situated now, and where the file is kept.’ He traced a route from the front door to the red circle. I could see faint lines on the old paper, marking a narrow hallway. ‘We will follow this corridor here, and hopefully will not encounter any guards. Yet, even if we do, they should take us for comrades and let us pass. The corridor will lead us straight to where we suspect Dalgliesh’s office to be. When we are there, we will take the file and leave the same way we came.’ ‘But… won’t the file be behind locked doors?’ Mr Ambrose patted one of his mysterious bags. ‘Doors are not impenetrable, Mr Linton. What did I say about interruptions?’ ‘So sorry, Sir.’ ‘Karim?’ The Mohammedan stepped forward. ‘Sahib?’","sourceLink":"https://allnovel.net/storm-and-silence/page-196.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
