{"id":87247,"no":216,"title":"Page 216","content":"Silent. You must keep silent.\\n\\n And I did. Somehow, though, Mr Ambrose managed to be twice as silent as I was. He seemed to radiate negative noise. It was a trick I decided I had to learn, if I survived this.\\n\\n In the distance, I heard another faint cry. I couldn’t suppress the image of a dark dungeon creeping up on me. But both times, the cries had sounded like children. What kind of monster was this Lord Dalgliesh?\\n\\n What few noises there were soon receded into the distance. We were venturing away from the coast, towards the centre of the island, of that much I was sure. But other than that, I knew nothing of where we were heading. There was only the rocking of the crate and the steady marching sound of the soldiers to indicate that we were moving at all.\\n\\n Finally, the soldiers slowed down.\\n\\n ‘Halt!’\\n\\n At the command, the soldiers stopped. I heard the jingling of keys and a creaking noise that was probably a door. It didn’t sound nearly creaky and sinister enough to satisfy my idea of the rusty hinges of a dungeon door, so maybe there was still hope.\\n\\n ‘All right, fellows. Put it down ‘ere.’\\n\\n The soldiers were only too happy to comply. The crate smashed to the ground, and Mr Ambrose nearly squashed me beneath him, pressing all the air out of my lungs.\\n\\n ‘Mpf!’\\n\\n ‘Gently! Gently! The dickens knows what’s in there. ‘e will ‘ave our ‘eads on a platter if anything gets broke!’\\n\\n There was no need to mention who ‘he’ was. I understood it as well as the soldiers did. They mumbled hurried apologies, and their footsteps moved away. Not long after, we heard a door lock click shut, and then there was only silence.\\n\\n They hadn’t opened the crate.\\n\\n ‘What now?’ I demanded in a whisper. ‘Are we just supposed to wait here until they come back for us?’\\n\\n ‘By no means.’ Mr Ambrose’s tone was back to cool efficiency. The hint of defeat that had been there earlier was nowhere to be found. He grabbed hold of something lying beside me, and I saw a thin object sliding past my face. His cane?\\n\\n ‘What are you doing?’\\n\\n ‘If I am not mistaken, the soldiers’ rough handling of the crate has loosened one of the boards. I may just be able to slide the blade of my sword into the crack and use it as a lever. Don’t move an inch. The blade is sharp.’\\n\\n I froze as above me I heard the slither of steel on steel. There was a creak and, for a moment, a small beam of light fell in through a crack in the wood. Then, the light was blocked by the figure of Mr Ambrose. He raised himself up as far as he could, sliding his sword into the crack he had discovered. Then, I felt his muscles bunch. There was a crunching sound, and suddenly light flooded into the crate - not the weak, blueish light of the moon, but bright, golden sunlight.\\n\\n ‘It is morning!’ I exclaimed.\\n\\n ‘Of course, Mr Linton. We have been at sea for…’ He pulled his watch out of his pocket and let it snap open. The coat of arms on the lid flashed in the bright morning light. ‘… exactly seven hours, thirty-eight minutes and four seconds. Dalgliesh must have taken a roundabout route to avoid being spotted.’\\n\\n ‘Seven hours!’ I clapped my hands to my face. ‘Blast! That means that by now, my aunt must have noticed I am gone! What am I going to tell her?’\\n\\n Mr Ambrose gave me a look. Oh, how I had missed that icy, spine-chilling gaze! ‘That, I would say, is the least of our worries, Mr Linton.’\\n\\n ‘Then you don\u0027t know my aunt.’\\n\\n Instead of replying, he sheathed his sword again, and shoved the cane through the hole that he had created in the wall of the crate. With a sharp pull, he twisted the cane, and another board flew away, clattering to the ground. He repeated the procedure again, and again. Then he nodded, satisfied.\\n\\n ‘The hole should now be broad enough for an average person to climb through. I will go first. Wait here.’\\n\\n And before I could utter a single word of complaint, he was already out of my sight, sliding out of the crate like some sleek, dark spectre. I listened intently, praying that there was no guard posted outside. Not a single sound came from outside the crate. I waited. One minute went by. Two minutes.\\n\\n What the heck is he doing out there?\\n\\n Three minutes.\\n\\n He can’t take this long, can he?\\n\\n Four minutes.\\n\\n Something has to have gone wrong! What if there is more than one guard out there? What if Mr Ambrose…\\n\\n Five minutes.\\n\\n What are you waiting for? Go and look for him! Maybe something has happened. Maybe-\\n\\n ‘All clear.’ Suddenly, his perfect granite face appeared above me, and I breathed a sigh of relief.\\n\\n ‘Where were you?’ I hissed.\\n\\n ‘Checking.’\\n\\n ‘Checking for what?’\\n\\n ‘Soldiers, Mr Linton. There are none present, either in here, or out there.’\\n\\n ‘How do you know?’\\n\\n ‘I climbed to one of the windows and looked out. All I saw was the sea, over the tops of trees, and a path leading downhill.’\\n\\n ‘Not even one guard?’\\n\\n ‘I do not like to repeat myself, Mr Linton. No. There were no soldiers.’\\n\\n ‘But that’s strange, don\u0027t you think so?’\\n\\n ‘Exceedingly. Which is why I would suggest we leave this place before things change from strange to normal. Come!’\\n\\n He disappeared from my view, and I gathered that now it was my turn. Slowly, I sat up. Every muscle in my body ached from lying down this long, and with so much weight on top of me. I tried very hard not to think about who that hard, muscled weight had belonged to, and gripped the edges of the hole in the lid above me to pull myself farther up.\\n\\n With a groan at my protesting muscles, I stuck my head through the opening. Looking around me, I saw a large, bare room, with lots of crates piled in every corner and sacks lying on the floor. Light filtered in through a few unglazed but barred windows high up on the wall. Dust motes danced in the light, and somewhere I heard the little footsteps of a mouse, or some other small animal, hurrying across the stone floor.\\n\\n ‘What is this place?’ I whispered.\\n\\n ‘I do not know, Mr Linton. But at a guess, I would say, a warehouse.’\\n\\n ‘It looks like nobody ever comes here.’\\n\\n ‘Let us hope so, or they will find you still half in the crate when they do come. Now get a move on!’\\n\\n ‘Yes, Sir. Immediately, Sir.’\\n\\n Pushing my arms through the hole, I hoisted myself further up and, bit by bit, emerged into the outside world. This went fine until my waist had slid outside. Suddenly, I encountered resistance. Gripping the boards to either side of me, I pushed harder. \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-216.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
