{"id":87263,"no":233,"title":"Page 233","content":"‘I did roll! I did nothing but roll and jump and bump! I feel like a flipping football!’\n ‘I mean actively. To break your fall.’ A firm hand gripped mine and pulled me up so quickly I couldn’t even try to protest. In a moment, I was standing beside Mr Ambrose, whose red uniform - curse him! - somehow still looked immaculate. He hadn’t even gotten one twig in his smooth, shiny black hair.\n For a moment, we stood like this, each close enough to hear the other’s heart beating, our hands intertwined. Then he let go and abruptly turned.\n ‘Let’s go!’\n ‘There they are!’ The gruff voice from the tunnel entrance was much too familiar. ‘Get them!’\n Behind us, a shot rang out. It was the starting signal for our race. We dove into the brushes, and now I blessed the thick foliage I had cursed a moment ago. Bullets whipped through the forest to my right and left, but none hit Mr Ambrose or me. We were too well hidden among the green leaves. As quickly as possible, we slid between the trees, farther away from the tunnel.\n Suddenly, Mr Ambrose stopped.\n ‘Be quiet!’\n ‘Oh really?’ I hissed. ‘This isn’t the right time for your obsession with silence! We’ve got to run, and I don\u0027t care how loudly we do it! We-’\n ‘No. I mean, I heard something. Be quiet and listen, just for a second.’\n Grudgingly, I did as he told me. Over the hammering of my own heart I couldn’t hear anything, at first. Then, slowly, I began to hear a low chatter, far off on the other side of the undergrowth.\n ‘Voices!’ I exclaimed.\n Mr Ambrose nodded. ‘Yes. Probably the crowd at the harbour. If we can reach it in time, we’ll be safe!”\n Without another word, he dove between two bushes and disappeared.\n Muttering a low curse, I followed. The farther I got, the louder the voices became. I redoubled my effort, almost running headlong, raising my arms to shield my face from the sharp branches that attacked me from all sides. It was with a shocking suddenness that I stumbled out of the trees and into the open, onto a square paved with cobblestones.\n The harbour. We had really managed to reach the harbour. In front of me stretched a wide, seaside promenade, with dozens of people strolling up and down, enjoying the view. Some of them glanced towards the forest when I burst out from between the trees, and looked more than a little surprised by the sight of a soldier with leaves and twigs in his bird’s nest of hair, but most were too busy watching the ships arrive and leave.\n Or, to be more precise - two ships arriving, one ship leaving. The ones that were arriving looked older, but the one that was about to embark was a brand-new steamship. Passengers were just getting on board the shiny, new vessel, all looking like wealthy tourists returning to England after a wonderful holiday. For a moment, my eyes fixed on the cursive word emblazoned on the ship’s hull: Urania.\n Quickly, I threw a sideways glance at Mr Ambrose and saw in his eyes the mirror of my own thought: our only chance. We rushed forward, slipping into the line at the gangway of the luxurious ship, and ignoring the protest of a thick-set French gentleman right behind us.\n ‘Two tickets to England, please,’ I gasped, slamming my hands on the counter of the official at the gangway to steady myself.\n ‘I beg your pardon, Monsieur?’ the man asked, looking at me with his nostrils instead of his eyes. But I worked for Mr Rikkard Ambrose! This little Frenchman’s derisive glances were nothing in comparison to the ones I had learned to withstand.\n ‘Tickets. To England. You do sell tickets to England, don\u0027t you?’\n ‘Naturalement, Monsieur - since this is our vessel’s only destination.’\n ‘Well, then, you heard my companion.’ Mr Ambrose stepped up beside me and fixed the official with an icy glare. ‘Two tickets to England, third class.’\n The official didn’t back down. If anything, his look became even more disgusted. ‘Third class, Monsieur? I am afraid you have the wrong vessel. This is a ship of a respectable line, offering its services only to the better classes of society. We have no cabins of third class on board.’\n Behind the granite mask on Mr Ambrose’s face, a momentous struggle seemed to be going on. A muscle in his jaw twitched. His left little finger jerked erratically. Finally, he managed to say: ‘Fine! Second class, then! How much does it cost?’\n The official seemed to decide that looking at us with his nostrils was too great an honour for us, and he switched to regarding us with his wobbly chin instead.\n ‘There is no second class, either, Monsieur. Please remove yourself. You are holding up the line.’\n I saw Mr Ambrose’s little finger twitch again, violently.\n ‘Two tickets, first class, to England,’ I said, before he could do anything he would later regret.\n His head whipped around to stare at me. ‘What are you doing?’ he demanded, his tone low and hard.\n ‘Saving our skins from your miserly ways,’ I shot back amiably. ‘I hope you have enough money on you.’\n He opened his mouth to reply, but was cut short by the official.\n ‘First class? As you could pay half the sum required! I have no time for your silly jokes, Messieurs. Remove yourselves immediately, or I will be forced to call security.’\n Slowly, Mr Ambrose turned back towards the man. When the Frenchman caught sight of his eyes, he flinched back.\n Mr Ambrose reached into his jacket and drew out a wallet. Opening it with deliberation, he pulled out two one hundred pound notes and slammed them down on the counter.\n ‘You can give me my change when we arrive in England,’ he said, his voice cold enough to freeze sunlight in mid-air. ‘I wish to be shown to my cabin. Now.’\n ‘W-why, certainly, Monsieur. At once, Monsieur.’\n Staring incredulously at the banknotes, the official waved one of his underlings over. ‘Quick! Pierre! Take these two gentlemen to the best cabins on the ship. Now!’\n ‘But Monsieur, the best cabins on the ship are occupied by…’\n ‘Do it!’\n As we were led off by the bewildered young man, who kept sneaking glances back at his superior, Mr Ambrose leant over to me and whispered:\n ‘The money for the tickets shall be deducted from your wages, Mr Linton.’\n And for some reason, this didn’t make me want to snarl back at him. It made me smile. \n","sourceLink":"https://allnovel.net/storm-and-silence/page-233.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: \n Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\n \n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
