{"id":87268,"no":238,"title":"Page 238","content":"‘Hm.’\n He lowered his eyes, and started glaring at the table again. It was a wonder that the piece of furniture hadn’t fled from him yet.\n Soon after, the waiter appeared with our bill, which didn’t exactly improve Mr Ambrose’s mood. He paid, but not without giving me a look twice as icy as that he had directed at the poor table. I really hoped my wages would be high enough to cover this bill, otherwise I would be in big trouble.\n The waiter bowed and left. For a moment I considered asking Mr Ambrose what was the matter. I hesitated briefly, looking at his chiselled granite face. I hesitated for an instant too long. Pushing back his chair, he rose.\n ‘I’m tired, Mr Linton. I’m going back to my cabin. You should, too. When we arrive in England, we still have a long coach journey ahead of us.’ His dark eyes met mine, holding them for a moment. ‘And we’ll have a lot to discuss.’\n Before I could say anything, he was gone. I shrugged. It wasn’t as if this was the last chance we would ever get to talk. I’d have to get to the bottom of what was the matter with him sooner or later. But it could just as well be later as sooner.\n Besides, I had to admit, a few more hours of rest would probably do me good. My muscles still ached from pushing the draisine up those hills, and all I wanted to do was lie down and relax.\n When I stepped out onto the deck, Mr Ambrose was nowhere to be seen. Strange. Why was he in such a hurry to disappear? Was he avoiding me? But why would he do that?\n The question kept nagging at me, even when I had entered my cabin and lain down. No matter how much I tossed from side to side, or how many blankets I pulled over myself, I couldn’t find sleep. The sun started to sink and disappeared behind the horizon, and still my eyes hadn’t closed. Mr Ambrose’s strange behaviour continued to gnaw at me. Besides, the roar of the steam engine was doing its best to keep me awake. It felt like trying to go to sleep with a raging rhinoceros next door.\n In the end, help came from unexpected quarter: the sea. As time passed, its motion became more turbulent, its rush became louder, until it tuned out the drone of the steam engine. The repetitive up and down of the waves, instead of making me sick, turned out to be comforting, like the movement of the cradle, lulling a child into sleep.\n Don’t worry so much about Mr Ambrose… Whatever his problem is, he’ll calm down… Everything will be all right…\n With that comforting thought, I drifted off into sleep.\n I awoke, startled into consciousness by the ring of a bell. A bell? But why would I hear a bell? There was no church in the vicinity, was there? No, of course there wasn’t. I was on a ship! The Urania. Did ships have bells? And when did they ring? Surely not for a wedding?\n It was then that I noticed that the motion of the waves had once again changed. Before, it had been like a mother, rocking a child to sleep. Now, it rather resembled a mother bent on infanticide! Over the roar of the sea I could hear thunder rumble in the distance. And were those running feet outside my cabin? Yes, they were! And they were coming closer.\n With an almighty crash, my door burst inward, slamming against the wall - and there, framed in the doorway stood Mr Rikkard Ambrose, his silhouette only visible for a moment as lightning arced across the sky. Then he disappeared into darkness, and I only heard his voice, cold and controlled:\n ‘Get up! A storm is coming!’\n Man and Woman\n For a moment, I was frozen. Which was ironic, in a way. I had always thought of Mr Ambrose as cold and immobile, but now I was the one who couldn’t move. He marched over to me and grabbed me by the arm.\n ‘Get up, I said, Mr Linton! Now!’\n Half running, half dragged by Mr Ambrose, I stumbled out of the cabin and onto the deck. The deck? No. This didn’t look like the deck I remembered. This looked more like pandemonium. All I saw, before a wall of water hit me in the face, was a strange still life in black and white, with men, women and children arranged around the ship like living corpses, waiting to die again, their faces thrown into stark contrast by the flash of a lightning bolt.\n Then, the wave was on me, and the light was gone. My lungs filled with saltwater, and I was thrown back against the outer cabin wall. Only the hand that still clasped mine held me upright. The hand of Mr Ambrose.\n ‘Steady. It’s all right. I’ve got you.’\n Spluttering and coughing, I emptied a mouthful of saltwater onto the deck, and a goodly piece of half-digested goose liver, too. I hardly noticed the stench over the strange and unfamiliar scents wafting over the Urania. Dark scents. Cold scents. Scents of the deep sea rising.\n ‘Please, ladies and gentlemen! Please, there is no need for concern! Calm down, please!’ An officer was striding towards us, down from the bridge, his hands raised in an attempt to calm the frightened crowd. Even if he had ten arms, I doubt it would have worked. ‘We are doing everything we can to get the situation under control. Please, ladies and gentle-’\n ‘And how,’ Mr Ambrose cut him off, cold steel in his voice, ‘do you plan to get a storm under control? Are you St Peter? Can you close the sluice gates of heaven and stop lightning from striking us down?’\n The officer opened his mouth, but no sound came out. His frightened eyes flickered from Mr Ambrose, to the rest of the terrified crowd gathered on the deck, to the roiling sea around us.\n ‘How many lifeboats are on this miserable wreck?’ Mr Ambrose’s voice was still deadly cold.\n ‘Please, Sir, you have to stay calm. The captain-’\n ‘The captain obviously isn’t worthy of scrubbing the deck of a ship, because it was he who got us into this situation in the first place. Now - how many lifeboats are on this vessel?’\n The officer hung his head. ‘Not enough for everybody.’ His voice was mere whisper. It didn’t matter. Everybody heard him. And a moment later, he could have yelled himself hoarse, and nobody would have understood a word. The crowd exploded into panic, everyone demanding that they would get on a lifeboat first, screeching insults, pressing to see the captain. As if that would help.\n Mr Ambrose didn’t yell. The moment he heard the officer’s words he squeezed my hand even tighter, and began to drag me along the slippery deck, away from my cabin. I didn’t protest, or try to stop him. I felt numb. Somewhere, deep inside, the realization had already settled: I was going to die tonight. I had fulfilled my dream, gotten my own job, lived through all those adventures and dangers, and now I would die tonight, on this measly little boat, far, far away from home. \n","sourceLink":"https://allnovel.net/storm-and-silence/page-238.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: \n Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\n \n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
