{"id":87080,"no":47,"title":"Page 47","content":"Led by this strange feeling, my reply to Mr Ambrose was considerably more conciliatory than it ordinarily would have been.\\n\\n Dear Mr Ambrose,\\n\\n Whatever you may think of my intelligence, it is not so slight as to risk my future merely to get a look at your profile. You are not that nice-looking. The box in question is really not here.\\n\\n Miss Lilly Linton\\n\\n My heart rate picked up as I pushed the message container into the tube. Would he believe me or just fire me? Did the box he wanted even exist, or was it just an excuse to get rid of me?\\n\\n I looked around the bare room and felt a lump rising in my throat. Although I didn’t want to admit it, I had already become accustomed to the stark surroundings, accustomed to the idea that this place was mine, my own way to freedom. What would I do if I lost it?\\n\\n Slowly I pulled the lever, and my message disappeared into the tube.\\n\\n The answer came not long after. I opened and unrolled it - and my eyes widened. If the situation hadn’t been so serious, the reply would have made me laugh!\\n\\n Mr Linton,\\n\\n Do you give me your word of honour as a gentlema- as a lad- as an honourable person that you are speaking the truth?\\n\\n Rikkard Ambrose.\\n\\n Somehow I couldn’t keep a slight grin from my face as I wrote the reply.\\n\\n Dear Mr Ambrose,\\n\\n I give you my word of honour as a lady who wears trousers that there is indeed no box of the aforementioned number/name in your safe.\\n\\n Miss Lilly Linton\\n\\n There was no reply. Nothing. For two entire minutes I sat there and waited, but nothing came. I had almost given up waiting and was chastising myself for my silly fancies. The box probably wasn’t important at all. It was probably some old box he had mistakenly thrown away. That had to be all.\\n\\n I had almost convinced myself of that explanation.\\n\\n Then I heard the rustle of keys from the other side of the room. My head snapped up just in time to see the connecting door to Mr Ambrose’s office swing open.\\n\\n The moment I saw him I knew I had been wrong. Wrong about two things, to be exact:\\n\\n Firstly, the missing file box was important.\\n\\n And secondly, seeing his profile might actually be worth losing your job over.\\n\\n There he stood: a lean figure, his arms crossed tightly in front of his chest, revealing taut muscles in his upper arms. In his black tailcoat, trousers and shirt he looked like some menacing manifestation of the night, come to banish the day before it was time. The fact that he had a face that seemed to have been cut from a mountain by some ancient master didn’t hurt either. I was paralysed in my chair - not with fear exactly. No, certainly not! I would never be afraid! Rather with… oh, I didn’t know! Whatever it was, I had to get a grip, and fast!\\n\\n ‘Mr Linton.’ His voice was just as I remembered it. Cold and clipped. He nodded at me, but before I could even open my mouth or think of a reply, he had marched past me. I stared after him until he vanished between the shelves at the other end of my office.\\n\\n Mister Linton? Mister Linton? So he was still going to keep that up, even now that he was forced to talk to me again?\\n\\n My paralysis suddenly lifted, and I jumped to my feet. I’d show him! I’d show that son of a bachelor!\\n\\n With three quick steps I was between the shelves. There was no sign of him there, but the door to the safe still stood open. He was in there.\\n\\n For one moment I was tempted to shove the door closed and lock it - but no. If I ever did choke him, I wanted my hands around his throat. Letting him suffocate in an airtight safe was much too impersonal.\\n\\n Taking a deep, relaxing breath, I stepped in after him - and stopped in my tracks.\\n\\n The inside of the safe room was a mess. Files were scattered everywhere on the floor. Standing before the shelves containing the boxes, Mr Ambrose was thoroughly busy dismantling and examining every part of every file box he could find, and once he was done with them, throwing them over his shoulder onto the floor. He was like a ravenous animal burrowing through the carcass of a deer. The only difference was: while a ravenous animal might have found what it needed to still its hunger in a carcass, he appeared to come up blank.\\n\\n ‘It must be here,’ he muttered. ‘It must be!’\\n\\n ‘What must be here?’ I asked. He completely ignored me. By Jove,[22] what a surprise!\\n\\n Why did I even bother to ask? I knew what he was looking for, didn’t I? File S39XX300. But what was so bloody important about that file?\\n\\n ‘It must be here. It must be.’ He didn’t say it angrily as such - but the determination in his words was like iron. Hundreds of files, which before had been in impeccable order, now lay scattered all over the metal floor of the safe, and still he continued his wild hunt.\\n\\n I stood mute at the door and watched him. Even had I known how to help, I wouldn’t have dared get in his way. It took him about half an hour to turn the orderly file boxes into a monumental mess. Finally, the very last file was in his hand. He looked at the number and let it drop to the floor with a clatter.\\n\\n He stood like that for a moment, rock-still.\\n\\n Then he whirled around. The look in his dark eyes made me retreat a step.\\n\\n ‘You!’ he hissed, coldly. He didn’t say anything more. He didn’t need to. I knew it was an accusation. My breathing sped up.\\n\\n Dear God! He suspected me of stealing the file! Me! Sweet little me!\\n\\n What was he going to do? Call the police? Looking into his eyes, somehow I doubted that. I remembered Karim and the huge sabre, and my heart sped up some more.\\n\\n ‘Where is it?’ he asked.\\n\\n ‘Th-the file? I d-don\u0027t know.’\\n\\n In two steps, he was in front of me. Hell’s whiskers! I hadn’t noticed how tall he was before. He was towering over me.\\n\\n Why the hell was I so nervous? What could he do to me, anyway?\\n\\n Well… looked pretty sharp the last time you saw it, don’t you think?\\n\\n He wouldn’t harm me, would he?\\n\\n ‘Tell me what you have done with the file,’ he said in his usual cold, hard voice, ‘or you will learn how to swim face down in the Thames tonight.’\\n\\n All right… that answered my question pretty succinctly. My whole body felt cold all of a sudden. Darn! Was he being serious?\\n\\n I looked into his eyes.\\n\\n Yes, he was. Absolutely serious.\\n\\n ‘You… you wouldn’t dare!’ I managed to whisper.\\n\\n ‘Really?’ Raising his hand, he counted dispassionately: ‘Firstly, nobody knows you are really here. You do not exist, Mr Victor Linton.’ \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-47.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
