{"id":87101,"no":69,"title":"Page 69","content":"‘And his name?’ Ella continued eagerly. ‘Tell me, who is he?’ Oops… What to Do with Pink? And his name? Tell me, who is he? For just a moment, Ella’s question hung in the air between us like a big, wet elephant on a washing line. ‘Please, don\u0027t ask,’ I blurted out. ‘I, um… promised him to tell nobody. Yes, I promised!’ This was such a lousy excuse that no little sister in England would have accepted it. Other little sisters would have dug and bored and drilled until they had uncovered every last bit of the truth. But all those little sisters probably didn’t have a secret lover. Moisture sparkled in Ella’s eyes, and the words ‘just like me and Edmund’ practically blinked on her forehead for all the world to see. ‘Of course.’ Nodding eagerly, she enfolding me in her arms. ‘I understand. Of course you have to keep your love’s secret. I understand more than you can ever know.’ Somehow I doubted that. I knew perfectly well why she was feeling so deeply for my supposed plight, and it didn’t have anything to do with her general compassionate nature but rather, I suspected, with a certain young man who would soon be waiting for her at the garden fence. ‘I really hope you two will find a way to be together,’ she breathed into my ear, her voice sounding tearful. Well I sure as hell didn’t. I had to work hard to keep myself from laughing at the idea of my marrying Mr Rikkard Ambrose. It would perhaps make an interesting tragedy for the theatre, with all the participants ending up strangled within the first five minutes, but in reality? No, thank you! However, I didn’t think that was what Ella wanted to hear. ‘I’m sure we will. I think he’s getting really attached to me, and it’s quite likely that we will spend more time together in the future.’ That last part at least was true. ‘But enough of my problems,’ I continued, holding Ella away from me with both hands. ‘Let us talk about you and the man prowling around you. What about Sir Philip?’ Ella’s face paled. ‘He was here earlier today,’ she muttered. ‘To visit you?’ ‘Yes.’ ‘Did he bring flowers?’ ‘Quite a lot of them, yes.’ ‘And what do you think of him?’ ‘He… is a very pleasant gentleman,’ Ella replied, doing her best to sound enthusiastic and failing miserably. ‘That is wonderful! Simply wonderful!’ I was testing my newfound acting skills. Of course I knew Ella’s interests lay in another direction, but I couldn’t tell her that I had overheard her and Edmund pledging their eternal, epic and everlasting love. She would vaporise from embarrassment. And I wouldn’t get another chance to eavesdrop on her and her lover, which was essential both for my plans of furthering the happiness of my little sister and as my favourite evening entertainment. ‘So you want to marry him, do you?’ I asked with a fake, bright smile. What little colour had remained in Ella’s cheeks vanished. ‘Um… maybe not as such.’ ‘Why not?’ I pressed. ‘If he likes you and you like him, why wait?’ ‘Well, we’re both so young. Too young, I think, to really think of marriage.’ ‘There are girls who get married at fifteen. That is two years younger than you.’ ‘True, but still… there’s no need to rush things and… and I…’ She was desperately groping around for another explanation. I had to say I was impressed with her. Of course her flimsy little lies wouldn’t even fool a cocker spaniel with severe concussion, but I was amazed that she even made the attempt. For Ella to lie to anybody, let alone me, was an impressive achievement. She really had to like this fellow Edmund. The confirmation of this very theory I received not three hours later. After my nap and an oh-so-delicious meal of porridge and cold potatoes, which I consumed with more relish than usual, I took up my usual post behind the bushes in the garden and waited for the two lovebirds to arrive. Just in case, I had taken the masterpiece of my favourite author with me: Mary Astell’s A Serious Proposal to the Ladies for the Advancement of their True and Greatest Interest, by a Lover of Her Sex. Hey, I said she’s a great author. I didn’t say she was great at coming up with snappy titles. Secretly, I thought that How to Squash Chauvinists would have been a much better title, since that was what this fabulous book was all about - but I never dared to voice that opinion. If I had a heroine, Mary Astell was it. She had lived over a hundred years ago and already tried to grind the oppressive patriarchy of Great Britain into dust. Today though, I didn’t get any new tips on man-to-dust-grinding. I had just opened my battered copy of A Serious Proposal to the Ladies when the lovebirds made their appearance. One fluttered in from the direction of the neighbours’ house, and it was not long after that Ella flew out of the back door and towards the fence. ‘Oh Edmund!’ ‘Oh Ella!’ They both clutched the fence in their hands. Their eyes were drawn to the other’s as if by some magnetic force. ‘My love,’ Ella breathed, moisture in her eyes - and she didn’t need any onions for it. ‘How I have longed to see you again.’ ‘And I you, my love. I have longed to see you again even more than you have longed to see me! Your sweet voice is to my ears as honey to my tongue.’ ‘Impossible!’ ‘I assure you, it is. The cadence of your speech…’ ‘No, no, I don’t mean the bit about the honey! I mean the bit about you longing for me more than I longed for you! I have definitely longed more for you than you for me. How could I not? You are my pillar of strength in the midst of my woe, Edmund. My sole reason to continue living.’ That was laying it on a bit thick, wasn’t it? Nice walks in the park, reading, fighting for women’s rights… I could come up with half a dozen good reasons to continue living off the top of my head. And they most certainly were better reasons than some stupid man! ‘I assure you, my dearest Ella, that I have longed for you more than you for me. That is the only way it could be. For who am I? Nobody but a simple merchant’s son. You are the light of my life, queen of my heart, infinitely more important than me.’","sourceLink":"https://allnovel.net/storm-and-silence/page-69.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
