{"id":87105,"no":73,"title":"Page 73","content":"Another message landed on my desk with a plink.\n Mr Linton,\n Bring me file 29IV229.\n Rikkard Ambrose\n I stood up - and suddenly knew that file 29IV229 would have to wait a little longer. I hurried out of the room into the hallway. Mr Stone looked up from his paperwork as I approached.\n ‘Excuse me, Mr Stone?’ I squeaked. Quickly, I cleared my throat. ‘Excuse me?’ That was better, though my voice was still slightly higher than befitted my role as a gentleman. ‘Do you know where the bathroom is?’\n ‘Certainly, Mr Linton.’ He pointed down the hall. ‘Two floors down, then take the first door on the left.’\n Ugh! Stairs. Would I survive that? I could only hope.\n ‘Thank you!’ I squeaked, and hurried off.\n Shortly afterwards, I returned, my steps a lot more measured and careful. My voice was still unnaturally high when I inquired:\n ‘Err… Mr Stone?’\n ‘Yes, Mr Linton?’\n ‘Are there any other toilets in the building? Maybe some that actually have cubicles?’\n He frowned. ‘No, I don\u0027t think so. Why?’\n ‘Never mind!’\n Back in my office, I saw two messages on my desk. Just as I closed the door behind me, a third landed beside the other two.\n Mr Linton,\n I refer back to my previous message. Bring me the aforementioned file.\n Rikkard Ambrose\n And the second one:\n Mr Linton,\n I’m waiting.\n Rikkard Ambrose.\n And the third one.\n Mr Linton,\n I am becoming impatient. Do not try me. Bring me file 29IV229. Now.\n Rikkard Ambrose.\n Bugger! What was I going to do? I couldn’t fetch the file! I probably wouldn’t get to the shelves without… well, I might not be a very polite lady, but even I wouldn’t mention that. Quickly, I considered the roads which were open to me. Could I get through the entire day like this? No, definitely not. That left two options:\n A) Do it in the waste paper basket\n B) Talk to Mr Ambrose\n It said a lot about the personality of my dear master that option A actually sounded like the better alternative to me. However, checking the waste paper basket I discovered that, although once made of solid cast iron, it was now so old that it had rusted through at the bottom, making it unsuitable for containing fluids of any kind. There was nothing for it. I had to gather up my courage and confront the monster in its lair.\n I knocked.\n ‘May I come in?’\n ‘Do you have the file?’ asked a voice from inside - that terse, cool voice which I already knew so well.\n ‘No, but there’s something else.’\n ‘Important?’\n ‘Yeees!’\n ‘Then come in.’\n Slowly, I entered. The office hadn’t altered much from the last time I’d seen it. The big map had disappeared off the desk and, instead, heaps of paper were lying on it. I was a bit surprised that I recognized most of them: they were the files Mr Ambrose had told me to bring him, and he was working through them diligently. So he wasn’t just ordering me around to annoy me. Good to know, if slightly unexpected.\n I stepped in front of my employer’s desk and cleared my throat.\n No reaction. He didn’t even look up. Instead, he picked up his fountain pen and began writing on a piece of paper.\n I cleared my throat again. And again.\n ‘Do you have a cough, Mr Linton?’ he asked without looking up. He continued writing.\n ‘No, Sir. I have a question.’\n ‘Then put it and leave. I have work to do.’\n ‘Well, err… it’s a bit delicate.’\n ‘Then put it delicately and leave.’\n Ordinarily, his ice-cold manner would have gotten my dander up. But at the moment, my thoughts were fully occupied by a certain pressing matter.\n ‘Err… yes, Sir. You see, I have to do some urgent… business.’\n He tapped the stacks of paper with his free hand. ‘So have I.’\n ‘I’m sure, Sir. It’s just that my business is somewhat more personal than yours. I, um, need to powder my nose.’\n That was the first time he looked up. With his dark, sea-coloured eyes, he stared at my face intently.\n ‘Why? Your nose looks fine to me.’\n ‘Um… thanks for the compliment, but…’\n ‘If you absolutely must,’ he continued, bending his head again and continuing his writing, ‘you can do it here. I don\u0027t mind.’\n I nearly choked.\n ‘Err… Mr Ambrose?’\n ‘Are you still here, Mr Linton?’\n ‘Yes, Sir. I wanted to ask - have you been out in society much?’\n He didn’t look up again. His fountain pen flew over the paper. Blue lines of ink spread over it with graceful ease. ‘No. I detest society. Ever since I’ve returned to England I’ve been far too busy with my business, anyway. Why?’\n ‘Because you seem a bit behind on social idioms. You see… to “powder your nose” is a phrase that ladies use when they want to indicate to gentlemen that they need to pee.’\n There was a loud snap. When I looked, I saw that Mr Ambrose’s fountain pen had snapped in half under the sudden pressure of his fingers. Ink dripped out of the half he still held.\n ‘Then,’ he said in a very measured, calm voice, ‘please do not do it here.’\n I nodded. ‘That’s what I thought.’\n ‘Why don\u0027t you just do it somewhere else, then?’ Mr Ambrose’s voice wasn’t quite as calm and collected as usual anymore. My, my. Was the great businessman at a loss? I had to hide my smirk.\n ‘Well, Sir, I checked, and there’s a bathroom downstairs. But it’s only a pissoir, with no separate cubicles. And well, I know you think of me as a gentleman, Mr Ambrose, but I think some of the other staff members might disagree once I let my trousers down.’\n ‘I see your point.’\n Still not looking up, Mr Rikkard Ambrose, one of the country’s richest and most powerful businessmen, pondered the question of where I might pee this afternoon. If I hadn’t been so literally filled with anticipation, I might have burst out laughing. As it was, I preferred standing still.\n Finally, he said:\n ‘You can use mine. It’s in there.’\n And he pointed toward a small door at the back of the office that I hadn’t noticed before. \n","sourceLink":"https://allnovel.net/storm-and-silence/page-73.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: \n Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\n \n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
