{"id":87119,"no":87,"title":"Page 87","content":"I had to go! I had to protect her from Wilkins\u0027 attentions as best I could.\\n\\n So, feeling as though I were walking towards my doom, I began to set one foot in front of the other, finally reaching the doorway.\\n\\n ‘Ah, there you are, Lilly!’ My aunt smiled a smile so devious it belonged exclusively to aunts and serial killers. ‘Do you know what? I absolutely forgot to tell you that we received an invitation to Lady Metcalf’s ball.’\\n\\n I closed my eyes. My fate was worse than I had imagined.\\n\\n ‘Lady Metcalf?’ I whispered, my voice resembling the last desperate vocal attempts of a victim of pertussis[34] before the grave claimed them.\\n\\n ‘Indeed. And Sir Philip is so nice as to take us all there in his coach. Isn’t that just wonderful, Lillian?’\\n\\n ‘I can hardly find words to express my feelings on the subject.’\\n\\n ‘Probably.’ She eyed me sharply. Suddenly, her voice became a lot less sweet and a lot more like that of a general. ‘Go upstairs and dress! I’ve laid your ball gown out for you and will expect you down here in five minutes.’\\n\\n ‘We\u0027ll be leaving that quickly?’\\n\\n ‘No. But I’ll need to keep an eye on you. And I have a few words to say to you before we leave.’\\n\\n Oh-oh… This can’t be good.\\n\\n I hurried upstairs to change, determined to do it in under five minutes. Unfortunately, Ella wasn’t there to help me, so it took me over a quarter of an hour to squeeze into my ball gown. When I came down again, my aunt didn’t look at all pleased. I could hear Maria’s high laugh from the drawing room, and a door opening.\\n\\n ‘They are coming.’ Grabbing me by the arm, my aunt dragged me outside and shooed the servants away. She pulled me behind the coach and drew herself up to her full height.\\n\\n ‘Listen, girl! I don\u0027t know how you managed to scare off Lieutenant Ellingham…’\\n\\n I started to protest, to tell her that I had nothing to do with his disappearance, but she silenced me with one of those scary-aunt looks that made you want to put your head under a blanket.\\n\\n ‘I don\u0027t know how you scared him off,’ she continued in a low tone, ‘but I’ll wager it was by exhibiting the same appalling behaviour as the other night at Sir Philip’s Ball. Refusing to dance, indeed! There will be none of that tonight, little lady, none of your incivilities, none of your foolishness, nothing! You will behave yourself like a true gentleman’s daughter, or you will have to answer to me.’\\n\\n ‘But I don\u0027t misbehave on purpose,’ I said with rising desperation. ‘It just… happens. I’m not very good at judging what is ladylike behaviour and what isn’t. What should I do?’\\n\\n ‘Oh that’s easy.’ My aunt let her fan snap open and waved it experimentally. ‘Just do the exact opposite of what you’d like to do, and you’ll be fine.’\\n\\n Can I just say that remark miffed me more than a little bit? I wasn’t that badly behaved, was I?\\n\\n Was I?\\n\\n Well, maybe sometimes. When I felt like it. Which was, admittedly, most of the time. Oh, blast it! Very well. I would do as my aunt wished. Fixing a fake smile on my face, I curtsied as deeply as I could without keeling over.\\n\\n ‘Certainly, Madam. May I be permitted to withdraw from your presence? I wish to seek out my sister.’\\n\\n My aunt blinked as if she were seeing and hearing a mirage and not her own niece.\\n\\n ‘Um… very well. Go ahead. That was not bad, just now. Not bad at all.’\\n\\n I curtsied again. ‘Thank you very much, Madam. You are too kind, Madam. Your obedient servant, Madam.’ Curtsying twice more just to make the point, I withdrew.\\n\\n On the other side of the coach, I met my sister. Unfortunately, it was the wrong one. I smiled at Maria as brightly as the sunshine and did another curtsy.\\n\\n ‘Dear Sister! How glad I am to see you. Might I enquire where I can find my dear, dear, dear sister Ella? I wish to speak to her, my dear.’\\n\\n Maria stared at my bright smile with open eyes, her mouth forming a little \u0027o\u0027.\\n\\n ‘Have you been drinking from uncle’s port wine?’ she demanded.\\n\\n I wish I had. I had never tried alcohol myself, but I’d heard it was pretty good for numbing the brain and lessening the pain of torturous experiences - like the one I was going through right now.\\n\\n ‘Good heavens, no, dearest sister. Whatever can have given you that impression? I would never be so presumptuous! Moreover, why would a lady even think of drinking spirits? What an outlandish idea, my dearest sister.’\\n\\n I smiled again, and curtsied again. And again. Maria was dumbstruck. Blimey, my acting skills were fantastic. I should really consider going on the stage.\\n\\n ‘I shall depart now and go looking for dear Ella, my dear Maria.’\\n\\n I was hardly around the corner when my smile flickered and went out. Blast! This would be difficult to keep up.\\n\\n I met Ella as she was leaving our house on Wilkins\u0027 arm. Immediately, I switched my smile back on and positioned myself on her other side. From the still-open door of our house, I caught a whiff of exotic flowers.\\n\\n ‘New bouquets?’ I asked her in an undertone.\\n\\n Ella turned her wide, pleading eyes on me.\\n\\n ‘Half a dozen of them! He has told me that my lips look like rose petals, and my hair like sunflowers, and my skin like lilies, and he apparently thinks it necessary to bring me copious quantities of all that vegetation every time he makes a comparison. Please don\u0027t leave me, Lill!’\\n\\n I patted her arm. ‘Don’t you worry. I’m right here.’\\n\\n For a moment she closed her eyes in silent gratitude. She looked about ready to faint. And this time, I was ready to bet her anxiety had nothing to do with the fact that the man next to her wished to marry her against her will. A knight of the British Empire was leading her by the arm! That was enough to make Ella faint any day.\\n\\n I, personally, didn’t have such a high opinion of Britain’s aristocracy. They didn’t seem to have anything better to do than to roam their lands shooting pheasants and foxes. Not that I missed those - I had met a pheasant in Green Park once, and it had squawked at me in a most unpleasant manner, enough for anybody to want to shoot it - but still, they didn’t seem to be a very productive sort of bird[35]. The aristocracy, I mean, not the pheasants.\\n\\n We all walked to the coach, Wilkins taking the place on one side of her while I squeezed myself in on the other side, in easy slapping distance of his face. With his long nose and over-large ears, he didn’t seem like the sort of chap who would suddenly start ravishing a young lady, but then, you could never be sure. I wanted to be close so he wouldn’t get any quick ravishing done while I wasn’t looking. \\n\\n","sourceLink":"https://allnovel.net/storm-and-silence/page-87.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \\n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \\n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\\n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
