{"id":87123,"no":91,"title":"Page 91","content":"His voice, too, was nothing like Mr Ambrose\u0027s. It sounded smooth and eloquent, like a public speaker who could move whole crowds, or maybe a young, dashing general who by his voice alone could persuade men to follow him into battle. For some reason I felt a blush creep up my cheeks.\n ‘Of course, where are my manners?’ Wilkins let go of my hand so he could point us out in turn. ‘Lord Dalgliesh, may I present Mrs Brank, Miss Linton, Miss Linton, Miss Linton, Miss Linton, Miss Linton and Miss Linton. Ladies, this is Lord Daniel Eugene Dalgliesh.’\n He bowed to each of us in turn, slowly and elegantly.\n ‘I am charmed. Who knew that such bewitching company would await me at this ball.’\n It hadn’t escaped my notice that Wilkins had introduced us to him and not the other way around. Normally, men were introduced to women. For it to be done in reverse, the man must be presumed to be ten times more important than any woman.\n With any ordinary man, this would have sent me into a fit of rage. Yet as Lord Dalgliesh bowed to me and for a moment I met his steel-blue gaze, I knew without doubt that this was no ordinary man.\n There was an aura about him, a presence that bespoke greatness. I felt as though those steel-blue eyes could analyse every bone in my body and gaze into the darkest recesses of my soul. Which was complete bilge, of course. My soul didn’t have any dark recesses! Did it?\n I was ripped from the contemplation of my soul by my loving sister Maria, who shoved me out of the way to be closer to her target.\n ‘It is I who am charmed to meet you, My Lord. Tell me how it is that, though I have been a frequent visitor to many balls in the city, I have never yet had the pleasure of making your acquaintance? Such a great lord as yourself should surely be the life and soul of every ball.’\n Bravo, Maria, bravo! I really had to admire her. She had flattered him, depicted herself as a worthy object of his undying love, fished for information, and flattered him again, and that all in one sentence. She really knew how to catch her fish. Only I had a suspicion this one would prove to be a little bit too big for her nets.\n Lord Dalgliesh gave a light, pleasant laugh. ‘The matter is susceptible of a ready explanation, Miss Linton. I assure you that I am no recluse or social outcast. In fact, I have been away from the metropolis, even from Britain, for a long time now, looking after various matters in the colonies.’ He shrugged apologetically and smiled a smile so charming, it could maybe even have charmed a fairy queen. ‘It was very unfortunate, considering what I was missing here.’\n My sister wasn’t a fairy queen. She didn’t have a hope.\n ‘Oh, Lord Dalgliesh,’ was all she managed to whisper.\n ‘What brought you back?’ Sir Philip wanted to know. ‘I would have thought you had enough out there to keep you busy for a lifetime.’\n Seeing our questioning looks, he added with a smile, ‘Lord Dalgliesh is the main shareholder of the East India Company.’\n Maria’s eyes lit up. If she hadn’t been determined to grab this man for herself before, she was now. Anne seemed to experience similar feelings. I must say, I was pretty floored myself.\n The East India Company… Did such a conglomerate even deserve to be referred to as only a \u0027company\u0027, when it owned and ruled most of the Indian subcontinent, along with its own army and state apparatus? If this man truly was in charge of the East India Company, he was as close to a king as you could get without actually wearing a crown.\n ‘What brought you back?’ Sir Philip repeated the question.\n For a moment, just a moment, the smile on Lord Dalgliesh’s face flickered. It looked almost like what had happened to me not too long ago. But that was hardly likely, was it? What reason could Lord Dalgliesh have for only pretending to smile?\n ‘Oh, no great matter,’ he said, smoothly. ‘Just a little unfinished business with an old friend. There’s a game of chess we need to finish.’\n I frowned.\n ‘You came to England, travelled thousands of miles… just to finish a game of chess?’\n Turning his head towards me, he cranked his smile up a notch. But his steel-blue eyes didn’t lose their cool, assessing look. Blimey, he was faking! A darn sight more convincingly than I, but he was faking.\n ‘In a manner of speaking,’ he said, nodding. ‘Though we may use no actual board or figures made from wood.’\n My frown deepened. ‘You’ve lost me, Your Lordship.’\n ‘Do not worry. I can always find you again.’\n He turned his head and started a light, flirtatious conversation with Anne, who leapt at the chance of overtaking her sister. I just stood there, shaking my head. This man was… disturbing. As soon as I could manage without seeming offensive, I excused myself. I wanted to get away from him. He was a darn sight too fascinating for me to want to be anywhere near him. I wanted to be alone - maybe find a quiet refreshment table and a chocolate bar. Gripping Ella by the hand, I started to tug her away with me.\n ‘Come!’ I whispered. ‘It’s time we made ourselves scarce!’\n She threw me a grateful look and let herself be dragged away. On her own, she would never have had the nerve to run from that bloody Wilkins. But being forcibly carried off by her sister, that she could manage all right.\n ‘Can you see where the refreshment tables are?’\n Standing on my toes, I tried to determine a safe route through the jungle of people in evening wear barring our way. But it was no good. As soon as we detached ourselves from one group, we were swallowed up by another and welcomed with friendly voices.\n Blast! It had all been so much easier when I had been impolite to everybody and scowled instead of smiled. Back then, nobody had given me a second glance.\n Oh well, the good old days…\n ‘Miss Linton! And another Miss Linton,’ a gentleman with a huge waxed moustache greeted us. I couldn’t for the life of me remember his name. ‘Hello and welcome. Join our little group.’\n ‘Oh no,’ said another gentleman. ‘I’m sure ladies wouldn’t like to listen to our topic of conversation.’\n ‘Nonsense,’ Gentleman A overrode him. ‘These are no modern, unladylike females. I danced with this young lady,’ he inclined his head towards me, ‘myself, and she was a model of charm and modesty.’\n How nice of you. And you were the model of arrogance and idiocy.\n ‘Why, thank you, Sir,’ I said, curtsying. ‘If I may ask, what is it that you were talking of before we came?’ \n","sourceLink":"https://allnovel.net/storm-and-silence/page-91.html","bookId":1822,"book":{"id":1822,"title":"Storm and Silence","description":"Storyline: \n Freedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! \n But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... \n Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!\n \n","cover":"https://allnovel.net/images/storm-and-silence.jpg","author":"Robert Thier","type":"Historical","source":"allnovel","link":"https://allnovel.net/storm-and-silence.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:13:12 PM"}}
