{"id":105611,"no":19,"title":"Page 19","content":"“But you remember being in this school,” Rhys says. “You don’t remember getting in, but you remember being in here after you got in.” “Just pieces. Price,” Baxter says. “I remember seeing Ms. Price…” They all look at me when he says this and I feel sick when I remember his hand on my face as I slept. I want to ask him why he did that, but I don’t think I really want to know. “But it all feels like—the same day.” He licks his lips. They’re so raw, cracked. “Every day feels the same.” “You could’ve shown yourself,” Rhys tells him. “You had a gun.” “You outnumber me and I didn’t know what you’d been through. How long you were here … what you were capable of…” “We’re not infected,” Harrison says. “We wouldn’t have hurt you.” Mr. Baxter looks at Harrison in total wonderment and then he laughs. It’s a bad sound, wrong. It makes me shiver. “Does the water still work?” he asks. “The tank still has water in it?” Trace nods. “Do you know how full it was before this started?” Baxter shakes his head. “Mr. Baxter?” Grace steps forward, nervous. “What’s it like out there? Is it—is it much worse than it was? Or is it getting better at all?” “Sometimes … it seems safer than it is,” he says. “They wait, now. If they can’t find life, they seem to wait for it. That’s why it’s quieter. It’s quiet but it’s not safer.” I glance at Rhys. Quiet. “What do they eat?” I ask. “When there are no people?” “I’ve seen them eat animals. Anything … living.” “You seriously can’t remember how you got in?” Cary asks. “Cary,” Grace snaps. “Just give him a minute—” “Grace, a minute could be the difference between us being ripped apart—” “The gun,” Baxter interrupts. “If something happens, it should help. Where is it?” “You know what? Mr. Baxter needs a minute, you’re right,” Cary says abruptly. “We can talk about this after. Rhys, Sloane, I want to search the first floor for his way in. I don’t imagine he scaled the wall and got in through the roof, right, Mr. B?” “I don’t imagine,” Baxter echoes. “So we’ll find it and we’ll seal it.” Cary turns to the others. Trace and Grace stare at him contemptuously. Cary’s directive to them has to be something they can’t argue with. Something simple. “Make sure Mr. Baxter has everything he needs. Mr. Baxter, I want you to work as hard as you can to remember in the meantime.” “Amazing,” Baxter says at our backs as Cary, Rhys, and I make our way out of the room. “If only you’d shown that kind of initiative in my class, Mr. Chen.” “You’re sounding better by the second, sir,” Cary replies without turning. When we hit the hall, Cary mouths library. Rhys and I head one way and Cary heads the other. I don’t know why we can’t go there together. Cary gets there before us. He’s checking the room for Baxter’s way in. We wait until he’s finished. “It’s not here,” he says, frustrated. “Rhys, you hid the gun?” “Yeah. It’s—” Rhys stops himself. “It’s someplace safe. I’ll show you later.” Cary glances at Rhys and then me but he doesn’t pursue it. “I don’t trust him,” he says. “Cary, you don’t like him,” I say. “You never did. He never liked you.” “Yeah, and that has nothing to do with this. This is fucked. We have to timeline it. He hasn’t been here since we got here, right?” “I don’t think so,” I say. “I think he got in before Rhys and I went out … I mean, not by days or anything. I’m talking minutes, maybe a half an hour to an hour, I don’t know.” “Why do you think that?” “The man outside.” I glance at Rhys. “He called for Nick over and over … and Mr. Baxter’s first name is Nick.” We’re quiet for a moment, and then Rhys speaks. “So if he got here with that guy, he left him out there to die. Something bad must have happened between them.” “But that man was unconscious when we found him,” I say. “We thought he was dead. Maybe Mr. Baxter did too and went on without him…” “Or maybe Baxter hurt him,” Cary suggests. I shake my head. “He wouldn’t do that.” “Why not? He hasn’t said anything about the guy outside yet. If it was innocent, why wouldn’t he just get it out of the way and say so?” “He’s hardly said anything. He’s out of it. Shell-shocked.” “Is he, though?” Rhys asks. “Wait.” I can’t keep up with this. “You think he’s faking it?” “You really think he can’t remember how he got in this school?” Rhys looks at me like he can’t believe I haven’t come to all the conclusions they have in the hour Baxter has been here. “How do you forget something like that?” I cross my arms. “Why would he do that?” “Who knows why anyone does anything now?” Cary looks past me and Rhys, to the door, and we both turn. There’s no one there but Cary lowers his voice anyway. “If he’s had some bad experiences with other survivors, he could be looking at his way in as leverage. He needs to make sure we trust him.” “Right … we keep him around no matter what, hoping that it will eventually come to him because we can’t find it ourselves,” Rhys says. “When he’s sure he’s safe here, he tells us or … he holds it over our heads for the entire time we’re here.” “He thinks he can just come in and take over,” Cary mutters. “We’ve been in this room, what, ten minutes and we’re already saddling the guy with a bunch of sinister motivations,” I say. “This is our English teacher. Someone we know.” “We all know each other and we don’t trust each other,” Cary says. “The only people I trust in this building are you and Rhys. The rest are dead weight to me.” “But maybe…” I grope desperately for some kind of explanation for Baxter’s behavior that seems more human. “Maybe Baxter was going to come to the school with the guy outside but they got separated or he really did think the guy was dead. Maybe he’s so traumatized he can’t remember how he got in. Why isn’t that possible?” They both stare at me and I can tell I’ve disappointed them. I don’t know why I don’t just believe what they believe. I don’t know why I’m defending Baxter. I think of his hand on my face. Maybe I should tell them but I can’t. It makes me feel too weird. It would just make things worse. “Whatever,” Cary finally says. “None of that matters yet. The only thing that matters right now is how he got in.” We can’t find it. We look everywhere, scour classrooms, the custodian’s office. We go into the basement and it’s so dark in there, the weak light from our flashlights turn the sinks and the shelves against the far wall into terrifying shadows. I wonder if Baxter is some sort of group hallucination but I know he’s not. I also know the other barricades are holding, undisturbed, and there is absolutely no way he got past them. How did he get in? I check the closet we found him in halfheartedly, like it might hold a secret passageway but it doesn’t. Of course it doesn’t. The building is officially one less place we can trust. Cary heads back to the auditorium wringing his hands, trying to figure out a good way to break bad news. Rhys wanders off and I can tell he’s taking this hard. We survived outside once and then again despite my better efforts, and then we got back inside and we thought we were safe but we’re not safe. Everything is up in the air. He doesn’t want to die. I seek him out and find him in the gym, opening a pack of cigarettes. He places one between his lips and brings a lighter to it. The flame flickers, illuminating his face briefly, before the smoke drifts lazily around him. He shoves the half-crumpled pack in his pocket. He doesn’t say anything to me, but he knows I’m here. I don’t say anything to him, just watch him inhale like a pro. I close the distance between us. When he exhales, he takes care to turn his head from me and I’m struck by how attractive and easy he makes it look but he always made it look that way. “I just had this vision of you out front, smoking,” I say. “That was my thing.” He ashes the cigarette. “What do you want, Sloane?” I stare out at the bleachers. It used to give me hives, imagining myself on any kind of team, people looking at me. “If Baxter got in here two days ago, that means however he got in here has been open since we got here. None of the infected found their way in.” “Are you trying to make me feel better?” “Where did you hide the gun?” “I’m not telling you.” “Promise I’m not going to shoot myself in the face.” “Why should I take you at your word? You threw yourself into a bunch of infected. Blowing a bullet through your skull seems way less hardcore so why wouldn’t you go for it? It’s that much easier for you.” “What do you think you’d do with my body?” I ask, and he twitches, steps away from me. I’ve crossed some invisible line. “Oh, what? It’s okay for you to be so candid with me?” I stare at the ceiling and think about it. “You couldn’t just leave it here to decompose. That would probably be unsafe. Taking it outside would be even more dangerous…” “It must thrill you that there’s a secret way in here,” Rhys shoots back. “That one day we could wake up and be totally surrounded—”","sourceLink":"https://allnovel.net/this-is-not-a-test/page-19.html","bookId":2495,"book":{"id":2495,"title":"This is Not a Test","description":"Storyline: It’s the end of the world. Six students have taken cover in Cortege High but shelter is little comfort when the dead outside won’t stop pounding on the doors. One bite is all it takes to kill a person and bring them back as a monstrous version of their former self. To Sloane Price, that doesn’t sound so bad. Six months ago, her world collapsed and since then, she’s failed to find a reason to keep going. Now seems like the perfect time to give up. As Sloane eagerly waits for the barricades to fall, she’s forced to witness the apocalypse through the eyes of five people who actually want to live. But as the days crawl by, the motivations for survival change in startling ways and soon the group’s fate is determined less and less by what’s happening outside and more and more by the unpredictable and violent bids for life—and death—inside. When everything is gone, what do you hold on to?","cover":"https://allnovel.net/images/this-is-not-a-test.jpg","author":"Courtney Summers","type":"Horror","source":"allnovel","link":"https://allnovel.net/this-is-not-a-test.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:49:29 PM"}}
