{"id":105617,"no":25,"title":"Page 25","content":"\n “Moreno can give Chen his breakfast,” Trace says. “Why are you doing this?”\n “As student government president, I had to deal with people I didn’t like all the time,” she snaps. “I had to listen to them and then I had to advocate for them if they needed it—”\n “News flash: you’re not student government president anymore.”\n “And you’re not the boss of me!” Trace laughs at how childish she sounds and that makes her angrier. When he sees the look on her face, he stops laughing.\n “Grace.” He’s full-on patronizing now. “Don’t be like this—”\n “I told you we had to let it go.” She raises her trembling chin. “This is me letting it go.”\n Something in her face tells him he’s not going to win this. He steps aside and Grace hurries out of the room and Trace glares after her and then transfers that glare to me, to Rhys.\n “I put the gun down,” he says. “That’s as much as I’m letting it go.”\n “You’re a great man, Trace,” Rhys says.\n Trace shoots Rhys a dirty look and then heads out of the auditorium. A second later, he pokes his head back in and calls for Harrison. Harrison actually goes running to him.\n I stare after them. “How did that even happen?”\n “Trace has the gun,” Rhys says. “Harrison has joined his army.”\n “This isn’t war.”\n “Maybe we can convince Grace to become a double agent or something,” Rhys says thoughtfully. He catches my eye and laughs a little at the ridiculousness of what he’s just said and then he looks away. “She’s got the right idea, though. Grace.”\n “What’s that?”\n “That this isn’t a good time or place to hold on to things.”\n I think I know what he’s going to say next and I don’t think I want to hear it, so I get to my feet, searching for some excuse to leave the room.\n But Rhys says, “Sloane,” before I can find one.\n “What?”\n “I don’t want…” he trails off, and tries to figure out a way to put it. “I don’t want how I feel about you to get in the way.” I don’t say anything, just leave him hanging, which is cruel. “I mean I don’t want to hate you so much that—I’m like how Trace is with Cary because that’s going to fuck him over in the end. I want to forget about what happened outside.”\n He keeps waiting for me to say something.\n “I forgive you,” he says.\n “Okay.”\n “That’s all you have to say?”\n “What do you want me to say?”\n “Thank you?”\n “I didn’t ask you to forgive me.”\n Rhys stares at the ceiling for a second and then he leaves the auditorium and since I have the room to myself, I go back to sleep until a slow roll of thunder wakes me up. By the time my eyes are open, a loud clap of it sounds overhead.\n And then the rain, tapping against the skylights.\n I am so sad.\n I am so sad it makes me heavier than the sum of my parts. I shift, restless, but it doesn’t help. It’s like—time. All this time in here is on me, has its hooks in me. Maybe if I sleep more, I’ll wake up and I’ll feel different, but I can’t. The storm is really happening now and it makes the room feel emptier. Makes me feel emptier.\n I get up. I want to see Cary. I want to talk to him about Lily again. I need him to make everything he told me about her hurt less somehow. The walk to him takes forever. It’s hard to breathe around how badly I feel right now. I round the corner and when the nurse’s office comes into sight, I’m grateful.\n And then I remember I don’t have the key.\n And then I want to break things.\n But—the door is open. A little.\n It stops me cold. Not right. That’s not right. I back up, think about finding Rhys, but there might not be time. I tiptoe over cautiously.\n Grace’s voice.\n “Stop talking, stop talking,” she’s saying over Cary, who is mumbling something at her. “Just stop talking. Shut up. Stop. Stop. Talking—”\n Their voices cut off abruptly. I step into the room and peer around the door, past the desk and supply cabinets and posters about knowing your body.\n The cot is empty and they’re beside it.\n Cary has Grace up against the wall.\n Cary has Grace pressed against the wall.\n I process this like a two-year-old with no life beyond Disney movies: he’s hurting her. Then I realize, no—not hurting.\n Kissing.\n Cary and Grace.\n I feel a little Norman Bates standing there, watching it happen between them. The way their hands fumble and grope all over each other, the way he kisses her mouth and her throat and how when he kisses her throat she leans her head back, all the way back, like nothing feels better than his lips against her skin. And then she lowers her head. She puts her palms against his face and makes him look at her and my throat tightens for what’s in her eyes. I don’t think she forgives him but it’s like her heart is a little more open than it was.\n It would be so easy for them to catch me spying, but they can only see each other. Grace kisses Cary and suddenly everything is just slow and tender in a way it wasn’t before. The energy in the room shifts. They’re kissing still, but now they’re really kissing. It’s so open and so honest and so end-of-the-world and I can feel it from where I’m standing. I feel the absence of it from where I’m standing. I don’t know how much longer I can go on like this.\n Still here. Still here. Still here.\n Cary and Grace.\n I hear them breathing.\n I move away from the scene slowly and then I’m in the hall, tears in my eyes. I run past LaVallee’s office, past the auditorium where Trace and Harrison’s voices now float out. I push through the doors to the gym and Rhys is there, smoking. The first thing I want to say is Cary and Grace have paired off but I can’t because it will make the thing I’m about to do worse, wrong. I calm down. Walk across the gym slowly.\n “What’s wrong?” he asks.\n I bite my lip and turn my head in the direction of the hall. He grinds the cigarette out and follows me out. I don’t look back at him.\n I pick the locker rooms because they’re closest.\n Once we’re inside he says, “Is it Cary?”\n I shake my head.\n “What is it?”\n “Thank you,” I tell him.\n “Whatever,” he says.\n I should ask permission first, but I can’t. I move to him and then—I press him against the wall. My hands fumble and grope all over him and he lets it happen. His mouth is just as hungry against mine. He tastes lonely. I feel it all through him. It’s what’s making him not stop this, not ask questions, it makes him kiss me back. He was with girls all the time. They were always around him. I bet he hasn’t been used to not having anyone to touch like this and I’ve never—I’ve never had that.\n And that makes me so angry I don’t know if I want to hurt him for it, for having it. Hurt Lily for having it. I kiss his throat hard, clumsily. I want him to feel it. I want to feel this. I need it to hurt for me to feel it, I think.\n I run my hands all over him, dig my nails into his skin, and he says, “Sloane—”\n And I look him in the eyes and he has the most incredible eyes. They’re unremarkable—a muddy brown—but they show me he’s as empty as I am.\n He kisses me and his lips are soft. I don’t want soft lips. I want to feel it. He puts his hands on my waist and turns me around so I’m the one against the wall. In that brief moment, I take in the room around us. There’s barely any light in here. The storm is still outside. The rain, I hear it. I imagine it. Fat drops of water splashing onto roofs, tracing slick wet trails down before turning back into smaller droplets that hit the pavement and splash, making puddles.\n “Your shirt,” Rhys mumbles.\n My fingers unbutton my buttons. Nine buttons until my shirt is open. He slides it off my shoulders and it hangs from my elbows. He steps back a little, looks at me. I’m not wearing a bra, but then I remember he’s seen this before. He brings his palm against my skin, against my collarbone. He’s shaking and I’m dizzy. He kisses me again, hard. Finally.\n The sky cracks open, thunder, and then all I can think about is the rain, the smell of the pavement after it rains. That musty beautiful smell that coats your lungs. A mild spring day, two girls in blue raincoats with yellow buttons shaped like flowers. Lily taking off her boots, grabbing my hands, and trying to drag me through all the puddles she could. I was always too scared and—she always let go of my hand.\n “Sloane?”\n Rhys’s voice brings me back, pulls me out of the memory. My hand disappears from Lily’s hand, the puddles disappear under my feet and it’s just me and him, but it’s not really me and him. It’s just this emptiness between us, the stupid idea I could kiss it away, and I’m crying before I can stop myself and then we’re on the floor and his arms are all around me and I keep saying I can’t because I don’t know what else to say. He tries to calm me, quiet me. Brings his hand to my face, tells me it’s okay. It’s not okay. I’m dying. I am dying. I have finally achieved what I set out to do. My heart is splitting open and I breathe in but no air gets into my lungs. I push against Rhys but he won’t let me go, so I lean into him, curl my fingers into his shirt and sob and the only thing that makes me feel okay about it is the fact that Cary broke down before me, Grace, she broke down before me, Harrison. But still, every second like this hurts, it hurts so bad I can’t stand it. I want it to stop, that’s all I’ve wanted. I let go of Rhys’s shirt when my fingers start to ache. I let him go, but his hold on me never wavers and it is so quiet.\n And then he asks, “Why can’t you?”\n The floor in the locker rooms is cold.\n The floor is cold and Rhys is warm. \n","sourceLink":"https://allnovel.net/this-is-not-a-test/page-25.html","bookId":2495,"book":{"id":2495,"title":"This is Not a Test","description":"Storyline: \n It’s the end of the world. Six students have taken cover in Cortege High but shelter is little comfort when the dead outside won’t stop pounding on the doors. One bite is all it takes to kill a person and bring them back as a monstrous version of their former self. To Sloane Price, that doesn’t sound so bad. Six months ago, her world collapsed and since then, she’s failed to find a reason to keep going. Now seems like the perfect time to give up. As Sloane eagerly waits for the barricades to fall, she’s forced to witness the apocalypse through the eyes of five people who actually want to live. But as the days crawl by, the motivations for survival change in startling ways and soon the group’s fate is determined less and less by what’s happening outside and more and more by the unpredictable and violent bids for life—and death—inside. When everything is gone, what do you hold on to?\n \n","cover":"https://allnovel.net/images/this-is-not-a-test.jpg","author":"Courtney Summers","type":"Horror","source":"allnovel","link":"https://allnovel.net/this-is-not-a-test.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:49:29 PM"}}
