{"id":105630,"no":38,"title":"Page 38","content":"\\n\\n I drive the crowbar into her face.\\n\\n I disappear into a dark, empty place.\\n\\n There is nothing to see, nothing to feel. It’s a relief to be in something so endless and undemanding because everything has been too much and I’ve been so tired. I hear my heartbeat in this place, steady at first, but eventually it slows and then it stops.\\n\\n I wait.\\n\\n Sloane.\\n\\n I open my eyes. My arms are wrapped around my dead sister’s body and my head is resting against her chest and the voice that has pulled me from the darkness, without my permission, belongs to Rhys. He’s above me and she is beneath me and she’s not moving anymore. I uncurl my fingers from her and he helps me to my feet and I stare down at my sister’s dead body and its stillness wraps itself around my heart and it fills my lungs until I want to bury myself inside her. I want to bury myself inside her.\\n\\n “Sloane, we should—”\\n\\n The gritty sound of air cutting through dead lungs sounds from the other side of the room and pulls my gaze from Lily. My chest tightens. More dead. Close.\\n\\n I don’t know how there could be more.\\n\\n I point to her and then I hold my hand out. Rhys takes the crowbar out of her face, a sick, awful sound that becomes a part of me as soon as I hear it. We cross the room slowly and a familiar scent floods my head with images, puts a bitter taste in my mouth, makes me want to tear my skin off …\\n\\n I find my father on the floor, wedged between his desk and the wall. His eyes are cloudy, his skin is gray, his veins vivid, so visible. He’s on his back and his abdomen is wide open, but it’s been so feasted on, it’s hardly there anymore. What’s left of his insides are dried out, have cemented him to the carpet. He flails his arms uselessly but he can’t get up.\\n\\n Lily did this.\\n\\n I raise the crowbar over my head. I’ll finish this. Everything. But his teeth—they catch my eye. They’re perfectly white, clean. They’ve never sunk themselves into anything. He’s weak and his expression is sick with want. He moans at us. I lower the crowbar.\\n\\n “Just leave him,” I whisper.\\n\\n We go back upstairs. Rhys packs clothes and searches the house for supplies. I take the car keys and shove them in my pocket and my fingers brush over a crinkled piece of paper. I take it out and unfold it. My note to Lily. I stare at it. It’s been through as much as I have and the letters have smeared together, have mixed with dirt and blood.\\n\\n Only a few words are readable now.\\n\\n Rhys steps into the room. “Are you ready?” I stare at the letter. Can’t stop staring at the letter. He moves in front of me and brings his hand to my face. “Sloane, are you ready?”\\n\\n I open my mouth but nothing comes out. He tells me he should drive. I give him the keys. The car starts on the first try and the gas tank is half full. He lets the car idle while I open the garage door and then I run back, jump into the passenger’s side. He eases out of the driveway and then we’re moving and we go by empty, broken houses, abandoned cars, and then eventually, the YOU ARE NOW LEAVING CORTEGE sign. We pass more dead along the way and they reach for us before they know we’re gone.\\n\\n “Tell me what happens next,” Rhys says after miles of silence because he knows. He knows the brief moment where everything was certain—her, me, him—is over now and I don’t know what’s left anymore. I turn my gaze away from him, back to the window. I catch sight of something.\\n\\n I tell him to stop and he stops.\\n\\n A young dead girl limps across an otherwise empty road. She’s so little. She can’t be more than seven. Her ankle is badly broken but she drags her foot along determinedly until she finds herself at my window. She puts her hand to the glass and I do the same. Her palm is so much smaller than mine. She’s too young, too frail to break through what separates us but she stares at me with pure longing. Her eyes are so desperate.\\n\\n I see them in her.\\n\\n Lily. Grace. Every death I’ve ever known is in her eyes and they are looking out at me, all of them, reaching for me with more than just this animal need to consume. It’s more than that. I don’t know what it is, though. But I need to know.\\n\\n “Sloane,” Rhys says.\\n\\n “Wait,” I whisper.\\n\\n I move closer to the glass, as close as I can get to it, begging her, begging Lily, begging Grace, begging all of them to tell me what’s left, to just tell me, while the girl pushes against the window, turns her tiny hands into tiny fists, begging me for a taste of—life.\\n\\n My life.\\n\\n Lily disappears. Grace. They all leave, they’re gone, they will never be here again. But the weight of what they’ve shown me is settling into my bones. I don’t know if I will keep it, but just in this moment, however brief, I feel closer to it than I ever have before …\\n\\n The dead girl presses her face against the glass. She waits for me to tell her what’s next. \\n\\n","sourceLink":"https://allnovel.net/this-is-not-a-test/page-38.html","bookId":2495,"book":{"id":2495,"title":"This is Not a Test","description":"Storyline: It’s the end of the world. Six students have taken cover in Cortege High but shelter is little comfort when the dead outside won’t stop pounding on the doors. One bite is all it takes to kill a person and bring them back as a monstrous version of their former self. To Sloane Price, that doesn’t sound so bad. Six months ago, her world collapsed and since then, she’s failed to find a reason to keep going. Now seems like the perfect time to give up. As Sloane eagerly waits for the barricades to fall, she’s forced to witness the apocalypse through the eyes of five people who actually want to live. But as the days crawl by, the motivations for survival change in startling ways and soon the group’s fate is determined less and less by what’s happening outside and more and more by the unpredictable and violent bids for life—and death—inside. When everything is gone, what do you hold on to?\\n","cover":"https://allnovel.net/images/this-is-not-a-test.jpg","author":"Courtney Summers","type":"Horror","source":"allnovel","link":"https://allnovel.net/this-is-not-a-test.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:49:29 PM"}}
