{"id":105415,"no":18,"title":"Page 18","content":"\n The huge male of the Band pulled out the biggest sword I\u0027d ever seen in my life and I restrained my zombie while its teeth snapped above Clara\u0027s vulnerable neck. He swung it smoothly and split the top of the zombie Queen\u0027s skull open like an egg balanced atop a pestle.\n The brains slid out and littered the floor around us.\n That kinda worked out.\n I watched every zombie follow the distraction of the brains laying on the floor and rolled my eyes.\n A little brains and they lose their attention span.\n Need. More. Training.\n \"Oh shit!\" Jonesy yelled, clearly seeing things getting way-the-hell-out of hand.\n John jogged over to me. \"Okay, I\u0027m thinking right now is a great time to close the Pathway!\" he said, looking around frantically at the tense zombies, the people from another sphere swarming around and the dumbass scientists whose fault it was we were here in the first place.\n I watched Matthew scoop Clara up in his arms, a welt growing on her forehead like a purplish-red plum as I looked.\n Matthew had saved Queen Clara. Now it was time for me and my friends to save the day. Our job wasn\u0027t done. Not by a long shot.\n No problemo.\n Jade looked up at me from the crook of my arm, her expression dubious. Thanks for the faith, I thought, a little insulted. I guess it had gotten sorta sloppy around the edges.\n Maybe more than a little.\n I turned to Jonesy and said, \"Time to cork the Pathway, pal.\"\n \"Now we\u0027re talkin\u0027!\" Jonesy said, giving a fist-pump, staggering a little under the influence of residual sedative.\n \"Hey!\" Gary Zondorae yelled.\n I turned toward him, the people of the other sphere were running down the tunnel in the opposite direction. Many cast worried glances at the dead that tracked their movements with unnerving intensity.\n \"You disrupt that Pathway and we can\u0027t return. You can\u0027t return,\" he said in his all-knowing voice.\n \"Nah, we got a one way ticket back to our world, dipshit,\" Tiff said in her subtle way, smacking gum.\n I shook my head. Tiff so nailed crap.\n Randi walked up and the Zondorae brothers blanched. \"You\u0027re the Dimensional, Merranda Chen.\"\n She nodded, raising her hand. \"Yeah. Bad for you dudes, great for us.\"\n \"You wouldn\u0027t leave us... we can\u0027t... be here. It would upset the order of things.\"\n I scowled, my anger instantly coming online. \"You don\u0027t give two shits and a fuck about order. You were just fine playing God with this world until you were caught.\"\n The brothers stared at me. So did the zombies.\n But for different reasons, oh yeah.\n John came to stand beside me, Matthew and Clara and the rest of the Band behind us. \"You loosed the fragment on these people, many of which were from our world. I think they can absorb you two just fine. As a matter of fact, on the Outside, you\u0027ll fit right in,\" John said, the Medieval speech slipping underneath the weight of his righteous anger at the scientists.\n \"What says he?\" Clara asked Daniel.\n Daniel frowned. \"They will leave the two Travelers here... to their own devices in the Outside. Without their modern accouterments they will be as the fragment.\"\n Clara smiled. \"It is a just end for such as them.\"\n \"Aye,\" the female that had been thrown by the dead Prince agreed, the leader of the Band\u0027s arm encircling her shoulders.\n I met the eyes of the zombies that held the pair. \"Take them outside... to where you lay at rest.\"\n The brothers fought and bucked, their arms punching flesh that didn\u0027t bruise or bleed.\n My zombies tore them out into the cold of Outside, the bitterness of their choices stealing inside their consciousness with insidious progression. I watched it happen, pleased beyond what I should\u0027ve been.\n It felt right, their punishment.\n Joe Zondorae spoke frantically, rapidly, \"You can\u0027t leave us, they\u0027ll kill Parker, they\u0027ll build another Pathway.\"\n I shifted cold and hard eyes to Joe, nailing him with their singular intensity, leveled only at him. \"Parker can take care of himself. These incursions will stop. And we\u0027re the future of the world. Not you... not the ones that started all this for control and power. Nothing good could\u0027ve come of this.\"\n \"That you don\u0027t see it is all the more reason for leaving you here,\" John said.\n \"You\u0027re gettin\u0027 flushed like turds!\" Jonesy said with glee.\n Sophie gave a giggle and I looked at Jonesy. \"Ya think you can rein it in long enough to disable the Pathway?\"\n Jonesy dipped his head sheepishly and walked over to the spot in the tunnel where the scientists had been spewed out. The invisible portal was practically above our heads.\n \"Hell yeah, Hart. Just give me the go, I\u0027m your man.\"\n \"Wait, young Traveler,\" Clara said, her small hand inside Matthew\u0027s.\n I turned.\n \"It is a Pathway of distance.\"\n I nodded, then said, \"And time, Queen Clara.\"\n I let that sink in as I watched her hand cover her mouth. \"If it exists, they may tamper with our history, altering things while we remain unaware.\"\n I didn\u0027t get it totally but I didn\u0027t live through my mom\u0027s Nazi verbiage for nothing. I got it enough. Their shortcut would be gone, but so would the access route of others bent on exploitation. It was the only protection we could offer them.\n \"It is our recompense for the transgressions of the people of our world against yours,\" John said, climbing on board the speech train again.\n \"Let them, Clara. For it is the only way to guarantee a future without Guardians... Travelers...\" Daniel said and Matthew finished for him, \"Evil Ones.\"\n My eyes shifted to Matthew\u0027s. \"Evil Ones?\"\n Matthew and the rest of the Band nodded gravely.\n I agreed, liking that name the best. I turned my attention to Jonesy again.\n \"Come on, Jones, let\u0027s bust this thing.\"\n Jonesy smiled and was met by Alex, who hefted him up on top of his shoulders. He looked down at John.\n \"It\u0027s Pulse, right?\"\n \"Yes, you should be able to disable it by overloading its function on this end.\"\n \"What about our end? What if other guys try to get through?\" Bry asked.\n Tiff shrugged. \"I\u0027m thinking I like the Jewelry Solution.\"\n Archer raised a brow.\n She popped a bubble and made a fluttering motion with both her hands like dandelion seed floating away on the breeze. \"It just went away when we traveled.\"\n We got quiet.\n I palmed my chin even as the scientists were wailing in the graveyard outside.\n Decision made, I looked into Jonesy\u0027s eyes, determined. \"Not our problem. Do it.\"\n Jonesy nodded and slammed a fist into the air.\n The lights of the sphere tunnel sputtered.\n Then died.\n The blackness of the tunnel was absolute.\n Chaos erupted and engulfed the people within.\n Clara was scooped up by Matthew and carried to somewhere she could not see, the utter inky blackness unhindered by light pollution of any kind.\n She heard a young female Traveler scream, \"Jonesy!\"\n I shut my eyes, the dark a comfort, and called the dead to me.\n Surround me.\n They came, all but the ones who held the corrupters of others.\n I wrapped my arms around Jade, folding her into the protection of my body, and the greater protection of the dead that surrounded me and my friends.\n The Band felt and saw the dead encircle the boy, their senses acute enough to intuit the intentions of the damned.\n The Band had not heard the command but had felt the summons of it.\n Alex searched around in a blind panic for Randi. He heard her scream for Jonesy, who he held on his shoulders.\n \"Jones!\" he growled out from underneath him.\n \"I know, muscle-head, calm your tits, I got this!\"\n \"Get it faster!\" he yelled, the thrum of his words vibrating into Jonesy\u0027s body.\n The tunnel lights sputtered back to life, finally catching, the steam escaping in a burst of moist heat at the base.\n Jonesy looked around, a circle of fifty zombies with their backs to Caleb and the gang standing sentinel around them.\n John stood head and shoulders above everyone inside the circle. His eyes locked with Jonesy. \"Did you do it?\"\n \"Hell yeah, Terran. Did you think I was having a party up here on beefy boy or what?\"\n John sighed and Jonesy frowned as Alex set him down onto the ground none too gently.\n Bracus came forward to engage the young Traveler and the zombies\u0027 eyes glittered like dark crystals in faces that were slack with death.\n Under orders of protection.\n Bracus paused, remembering the strength of the dead Prince.\n I watched him come and felt my intent slip into the zombies consciousness. They parted like water behind a dam and Bracus strode into the midst of the dead.\n He had the biggest brass balls I\u0027d ever seen.\n I took an instant liking to the guy.\n \"We need to seal this sphere from its neighbor.\"\n Huh. \"Why?\"\n Bracus explained. After ten minutes or so of listening I said, \"Their sphere is going to continue to erode. We can\u0027t fix anything else. We have to return... to our world.\"\n Bracus frowned while Daniel translated.\n Jonesy came forward, his clothes filthy and torn, a grin of pure accomplishment permanently etched there. \"I can fix that up too.\"\n John cocked a brow. It wasn\u0027t often that Jonesy surprised Terran.\n Or any of us.\n Jonesy outlined the plan while the Band and Clara listened to John\u0027s translation, Daniel filling in where John\u0027s words were lost in the gaps of language and our accent.\n The Band straightened as Clara, the other sphere-dwellers and us made our way to the mouth of the sphere, the sentry long-dead.\n Clara\u0027s body clenched in a tight knot when she saw what had occurred in her sphere when it sat unprotected, assaulted by their ally.\n She was livid, her body shaking with it.\n Jade came forward. \"I can help.\"\n \"How?\" Daniel asked the small girl with hair the color of raven\u0027s wings, eyes like the brightest leaves of a summer tree.\n She told him.\n Clara escorted Jade as she touched every dwelling while the zombies clogged the entrance to the sphere.\n No one would dare exit through the wall of dead flesh, the smell of their decomposition filling the air like collective mucus gone bad.\n When each person who was not rightfully in the Kingdom of Ohio was identified, the Band escorted them to the zombie guard.\n Many of whom had guarded this very sphere in life, I was told.\n Some resisted, and were summarily dealt with. Their pleas for mercy went unheeded as the blood and destruction of their deeds lay claim to every surface of the sphere.\n I watched as Queen Clara steeled her heart against their justifications.\n They had killed her subjects. It made sense to me. I don\u0027t think I had as much trouble ignoring them as she did.\n I knew that she took responsibility for those that relied on her, I could see it on her. She didn\u0027t need a crown on her head for me to see her royalty.\n I watched as a new resolve took shape on her expressive face.\n She would protect them again, regardless what the price was.\n I knew that sometimes, when it came to protection, the price could be steep.\n The zombies dragged the people of the Kingdom of Kentucky behind them without expression, the heel of their shoes making grooves in the dirt as they flailed to escape.\n Without my contrary directive, my zombies would take no prisoners.\n When they passed the portal of the great door that led Outside and walked underneath the defunct Pathway, the Queen turned to me, her gaze briefly touching on the two Travelers who lay at the feet of my zombies Outside, their screams devolved into exhaustion.\n \"Let it be here,\" she said.\n Bracus came forward and asked, \"The barrier, Queen Clara?\"\n She nodded, once.\n Jonesy stepped forward and with a quick look at me said, \"This experimental crap\u0027s getting old.\"\n \"Stop complaining, ya whiner. You\u0027re the one that offered,\" Tiff said, shrugging.\n \"In theory...\" John began.\n \"Can it, Terran, ya chump.\" Jonesy pushed his hand into the soft side of the sphere tunnel. Sweat sprang out in droplets on his forehead, beading on his upper lip. And like drawing a curtain, he pulled his hand away... and the material of the sphere came with it.\n Clara gasped as she saw the fabric of the sphere wall clutched like so much warm taffy in the dark hand of the Traveler who could manipulate all things electromagnetic, she had been informed.\n She turned to the Band, gulping hard when she caught sight of the zombie horde behind them.\n Clara nodded and the Band parted as the zombies came through with the scum of the Kingdom of Kentucky.\n They were heaved through the hole which remained of the new closure. \n","sourceLink":"https://allnovel.net/death-weeps-death-5/page-18.html","bookId":2493,"book":{"id":2493,"title":"Death Weeps (Death #5)","description":"Storyline: \n Death Weeps (Death #5) \n Caleb faces possible jail time for using Clyde as a undeadly weapon. When he\u0027s exonerated with probation lasting a year, Caleb has to watch his every action. Tensions run high when after the death of Jade\u0027s only relatives, she must live with an undesirable foster family who are anything but what they seem.... \n Life gets complicated for everyone when the scientists responsible for the paranormal manifestation threaten a parellel world to Caleb\u0027s own. In a bid to stop the destruction of their world, while saving his own, Caleb must defend two peoples against the long arm of the Graysheets. \n Time begins to run against him when he discovers through an unlikely source that his friends have been given a drug that causes progressive insanity. Can he find the antidote in time to save them? To save Jade?\n \n","cover":"https://allnovel.net/images/death-weeps-death-5.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/death-weeps-death-5.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:46:06 PM"}}
