{"id":95786,"no":4,"title":"Page 4","content":"With a growl that seemed more anger than passion, Tsinka Shinriil rolled Obould over and scrambled atop him.\\n\\n \"You have put them in their dark hole!\" the female shaman cried, her eyes wide - so wide that the yellow-white of her eyes showed clearly all around her dark pupils, giving her an expression that seemed more a caricature of insanity than anything else. \"Now we dig into that hole!\"\\n\\n King Obould Many-Arrows easily held the excited shaman at bay as she tried to engulf him with her trembling body, his thick, muscular arms lifting her from the straw bed.\\n\\n \"Mithral Hall will fall to the might of Obould-who-is-Gruumsh,\" Tsinka went on. \"And Citadel Felbarr will be yours once more, soon after. We will have them all! We will slay the minions of Bruenor and Emerus! We will bathe in their blood!\"\\n\\n Obould gave a slight shrug and moved the shaman off to the side, off the cot itself. She hit the floor nimbly, and came right back, drool showing at the edges of her tusky mouth.\\n\\n \"Is there anything Obould-who-is-Gruumsh cannot conquer?\" she asked, squirming atop him again. \"Mithral Hall, Felbarr . . . Adbar! Yes, Adbar! They will all fall before us. Every dwarven stronghold in the North! We will send them fleeing, those few who we do not devour. We will rid the North of the dwarven curse.\"\\n\\n Obould managed a smile, but it was more to mock the priestess than to agree with her. He\u0027d heard her litany before - over and over again, actually. Ever since the western door of Mithral Hall had banged closed, sealing Clan Battlehammer into their hole, Tsinka and the other shamans had been spouting preposterous hopes for massive conquests all throughout the Silver Marches and beyond.\\n\\n And Obould shared that hope. He wanted nothing more than to reclaim the Citadel of Many Arrows, which the dwarves had named Citadel Felbarr once more. But Obould saw the folly in that course. The entire region had been alerted to them. Crossing the Surbrin would mean engaging the armies of Silverymoon and Everlund, certainly, along with the elves of the Moonwood and the combined forces of the Delzoun dwarves east of the deep, cold river.\\n\\n \"You are Gruumsh!\" Tsinka said. She grabbed Obould\u0027s face and kissed him roughly. \"You are a god among orcs!\" She kissed him again. \"Gerti Orelsdottr fears you!\" Tsinka shrieked and kissed him yet again.\\n\\n Obould grinned, rekindling the memory of his last encounter with the frost giant princess. Gerti did indeed fear him, or she certainly should, for Obould had bested her in their short battle, had tossed her to the ground and sent her slinking away. It was a feat previously unheard of, and only served to illustrate to all who had seen it, and to all who heard about it, that King Obould was much more than a mere orc. He was in the favor of Gruumsh One-Eye, the god of orcs. He had been blessed with strength and speed, with uncanny agility, and he believed, with more insight than ever before.\\n\\n Or perhaps that new insight wasn\u0027t new at all. Perhaps Obould, in his current position, unexpectedly gaining all the ground between the Spine of the World, the Fell Pass, the River Surbrin, and the Trollmoors with such ease and overwhelming power, was simply viewing the world from a different, and much superior, position.\\n\\n \".. . into Mithral Hall...\" Tsinka was saying when Obould turned his attention back to the babbling shaman. Apparently noting his sudden attention, she paused and rewound the thought. \"We must go into Mithral Hall before the winter. We must rout Clan Battlehammer so the word of their defeat and humiliation will spread before the snows block the passes. We will work the dwarven forges throughout the winter to strengthen our armor and weapons. We will emerge in the spring an unstoppable force, rolling across the northland and laying waste to all who foolishly stand before us!\"\\n\\n \"We lost many orcs driving the dwarves underground,\" Obould said, trying to steal some of her momentum. \"The stones are colored with orc blood.\"\\n\\n \"Blood well spilled!\" Tsinka shrieked. \"And more will die! More must die! Our first great victory is at hand!\"\\n\\n \"Our first great victory is achieved,\" Obould corrected.\\n\\n \"Then our second is before us!\" Tsinka shouted right back at him. \"And the victory worthy of He-who-is-Gruumsh. We have taken stones and empty ground. The prize is yet to be had.\"\\n\\n Obould pushed her back out to arms\u0027 length and turned his head a bit to better regard her. She was shaking again, though be it from passion or anger, he could not tell. Her naked body shone in the torchlight with layers of sweat. Her muscles stood on edge, corded and trembling, like a spring too tightly twisted.\\n\\n \"Mithral Hall must fall before the winter,\" Tsinka said, more calmly than before. \"Gruumsh has shown this to me. It was Bruenor Battlehammer who stood upon that stone, breaking the tide of orcs and denying us a greater victory.\"\\n\\n Obould growled at the name.\\n\\n \"Word has spread throughout the land that he lives. The King of Mithral Hall has risen from the dead, it would seem. That is Moradin\u0027s challenge to Gruumsh, do you not see? You are Gruumsh\u0027s champion, of that there is no doubt, and King Bruenor Battlehammer champions Moradin. Settle this and settle it quickly, you must, before the dwarves rally to Moradin\u0027s call as the orcs have rallied to Obould!\"\\n\\n The words hit Obould hard, for they made more sense than he wanted to admit. He wasn\u0027t keen on going into Mithral Hall. He knew that his army would suffer difficult obstacles every inch of the way. Could he sustain such horrific losses and still hope to secure the land he meant to be his kingdom?\\n\\n But indeed, word had spread through the deep orc ranks like a windswept fire across dry grass. There was no denying the identity of the dwarf who had centered the defensive line in the retreat to the hall. It was Bruenor, thought dead at Shallows. It was Bruenor, returned from the grave.\\n\\n Obould was not so stupid as to underestimate the importance of that development. He understood how greatly his presence spurred on his own warriors - could Bruenor be any less inspiring to the dwarves? Obould hated dwarves above all other races, even elves, but his bitter experiences at Citadel Felbarr had given him a grudging respect for the stout bearded folk. He had taken Felbarr at an opportune moment, and with a great deal of the element of surprise on his side, but now, if Tsinka had her way, he would be taking his forces into a defended and prepared dwarven fortress.\\n\\n Was any race in all of Toril better at defending their homes than the dwarves?\\n\\n The drow, perhaps, he thought, and the notion sent his contemplations flowing to events in the south, where two dark elves were supposedly helping ugly Proffit and his trolls press Mithral Hall from the south. Obould realized that that would be the key to victory if he decided to crash into Mithral Hall. If Proffit and his smelly beasts could siphon off a fair number of Bruenor\u0027s warriors, and any amount of Bruenor\u0027s attention, a bold strike straight though Mithral Hall\u0027s closed western door might gain Obould a foothold within.\\n\\n The orc king looked back at Tsinka and realized that he was wearing his thoughts on his face, so to speak. For she was grinning in her toothy way, her dark eyes roiling with eagerness - for conquest, and for Obould. The great orc king lowered his arms, bringing Tsinka down atop him, and let his plans slip from his thoughts. He held onto the image of dead dwarves and crumbling dwarven doors, though, for Obould found those sights perfectly intoxicating.\\n\\n The cold wind made every jolt hurt just a little bit more, but Obould gritted his teeth and clamped his legs more tightly against the bucking pegasus. The white equine creature had its wings strapped tightly back. Obould wasn\u0027t about to let it get him up off the ground, for the pegasus was not broken at all as far as the orcs were concerned. Obould had seen the elf riding the creature, so easily, but every orc who\u0027d climbed atop the pegasus had been thrown far away, and more than one had subsequently been trampled by the beast before the handlers could get the creature under control.\\n\\n Every orc thus far had been thrown, except for Obould, whose legs clamped so powerfully at the pegasus\u0027s sides that the creature had not yet dislodged him.\\n\\n Up came the horse\u0027s rump, and Obould\u0027s body rolled back, his neck painfully whipping and his head turning so far over that he actually saw, upside down, the pegasus\u0027s rear hooves snap up in the air at the end of the buck! His hand grabbed tighter at the thick rope and he growled and clamped his legs against the mount\u0027s flanks, so tightly that he figured he would crush the creature\u0027s ribs.\\n\\n But the pegasus kept on bucking; leaping, twisting, and kicking wildly. Obould found a rhythm in the frenzy, though, and gradually began to snap and jerk just a little less fiercely.\\n\\n The pegasus began to slow in its gyrations and the orc king grinned at his realization that the beast was finally tiring. He took that moment to relax, just a bit, and smiled even more widely as he compared the pegasus\u0027s wild gyrations to those of Tsinka the night before. A fitting comparison, he lewdly thought.\\n\\n Then he was flying, free of the pegasus\u0027s back, as the creature went into a sudden and violent frenzy. Obould hit the ground hard, face down and twisted, but he grunted it away and forced himself into a roll that allowed him to quickly regain some of his dignity, if not his feet. He looked around in alarm for just a moment, thinking that his grand exit might have lessened his image in the eyes of those nearby orcs. Indeed, they all stared at him incredulously - or stupidly, he could not tell the difference - and with such surprise that the handlers didn\u0027t even move for the pegasus.\\n\\n And the equine beast came for the fallen orc king.\\n\\n Obould put a wide grin on his face and leaped to his feet, arms wide, and gave a great roar, inviting the pegasus to battle.\\n\\n The steed stopped short, and snorted and pawed the ground.\\n\\n Obould began to laugh, shattering the tension, and he stalked right at the pegasus as if daring it to strike at him. The pegasus put its ears back and tensed up.\\n\\n \"Perhaps I should eat you,\" Obould said calmly, walking right up to the beast and staring it directly in the eye, which of course only set the pegasus even more on edge. \"Yes, your flesh will taste tender, I am sure.\"\\n\\n The orc king stared down the pegasus for a few moments longer, then swung around and gave a great laugh, and all the orcs nearby took up the cheer.\\n\\n As soon as he was confident that he had restored any lost dignity, Obould turned back to the pegasus and thought again of Tsinka. He laughed all the louder as he mentally superimposed the equine face over that of the fierce and eager shaman, but while the snout and larger features greatly changed, it seemed to him that, other than the white about the edges of Tsinka\u0027s iris, their eyes were very much the same. Same intensity, same tension. Same wild and uncontrollable emotions.\\n\\n No, not the same, Obould came to recognize, for while Tsinka\u0027s gyrations and sparkling eyes were wrought of passion and ecstasy, the winged horse\u0027s frenzy came from fear.\\n\\n No, not fear - the notion hit Obould suddenly - not fear. It was no wild animal, just captured and in need of breaking. The mount had been ridden for years, and by elves, riders whose legs were too spindly to begin to hold if the pegasus didn\u0027t want them to stay on.\\n\\n The pegasus\u0027s intensity came not from fear, but from sheer hatred.\\n\\n \"O, smart beast,\" Obould said softly, and the pegasus\u0027s ears came up and flattened again, as if it understood every word. \"You hold loyalty to your master and hatred for me, who killed him. You will fight me forever if I try to climb onto your back, will you not?\"\\n\\n The orc king nodded and narrowed his eyes to closely scrutinize the pegasus.\\n\\n \"Or will you?\" he asked, and his mind went in a different direction, as if he was seeing things from the pegasus\u0027s point of view.\\n\\n The creature had purposefully lulled him into complacency up there on its back. It had seemingly calmed, and just when Obould had relaxed, it had gone wild again.\\n\\n \"You are not as clever as you believe,\" Obould said to the pegasus. \"You should have waited until you had me up into the clouds before throwing me from your back. You should have made me believe that I was your master.\" The orc snorted, and wondered what pegasus flesh would taste like.\\n\\n The handlers got the winged horse into complete control soon after, and the leader of the group turned to Obould and asked, \"Will you be riding again this day, my god?\"\\n\\n Obould snickered at the ridiculous title, though he wouldn\u0027t openly discourage its use, and shook his head. \"Much I have to do,\" he said.\\n\\n He noted one of the orcs roughly tying the pegasus\u0027s back legs together.\\n\\n \"Enough!\" he ordered, and the orc gang froze in place. \"Treat the beast gently now, with due respect.\"\\n\\n That brought a few incredulous expressions.\\n\\n \"Find new handlers!\" Obould barked at the gang leader. \"A soft touch for the mount now. No beatings!\"\\n\\n Even as he spoke the words, Obould saw the error of distracting the crew, for the pegasus lurched suddenly, shrugging a pair of orcs aside, then kicked out hard, scoring a solid hit on the forehead of the unfortunate orc who had been tying its hind legs. That orc flew away and began squirming on the ground and wailing piteously.\\n\\n The other orcs instinctively moved to punish the beast, but Obould overruled that with a great shout of, \"Enough!\"\\n\\n He stared directly at the pegasus, then again at the orc leader. \"Any mark I find on this beast will be replicated on your own hide,\" he promised.\\n\\n When the gang leader shrank down, visibly trembling, Obould knew his work was done. With a sidelong look of contempt at the badly injured fool still squirming on the ground, Obould walked away.\\n\\n The surprise on the face of the frost giant sentries - fifteen feet tall, handsome, shapely behemoths - was no less than Obould had left behind with his orc companions when he\u0027d informed them, to the shrill protests of Tsinka Shinriil among others, that he would visit Gerti Orelsdottr alone. There was no doubt about the bad blood between Gerti and Obould. In their last encounter, Obould had knocked the giantess to the ground, embarrassing and outraging her.\\n\\n Obould kept his head high and his eyes straight ahead - and he wasn\u0027t even wearing the marvelously protective helmet that the shamans had somehow fashioned for him. Giants loomed all around him, many carrying swords that were taller than the orc king. As he neared the entrance to the huge cave Gerti had taken as temporary residence far south of her mountain home, the giant guards shifted to form a gauntlet before him. Two lines of sneering, imposing brutes glared down at him from every angle. As he passed them, the giants behind him turned in and followed, closing any possible escape route.\\n\\n Obould let his greatsword rest easily on his back, kept his chin high, and even managed a grin to convey his confidence. He knew that he was surrendering the high ground, physically, but he knew, too, that he had to do just that to gain the high ground emotionally.\\n\\n He noted a flurry of commotion just inside the cave, with huge shapes moving this way and that. And when he entered, his eyes adjusting to the sudden change of light as daylight diminished to the glow of just a few torches, he found that he didn\u0027t have to search far to gain his intended audience. Gerti Orelsdottr, beautiful and terrible by frost giant standards, stood at the back, eyeing him with something that seemed a cross of suspicion and contempt.\\n\\n \"It would seem that you have forgotten your entourage, King Obould,\" she said, and it seemed to Obould that she had weighted her voice with a hint of a threat.\\n\\n He remained confident that she wouldn\u0027t act against him, though. He had defeated her in single combat, had, in effect, shamed her, and greater would her shame be among her people if she set others upon him in retribution. Obould didn\u0027t completely understand the frost giants, of course - his experiences with them were fairly limited - but he knew them to be legitimate warriors, and warriors almost always shared certain codes of honor.\\n\\n Gerti\u0027s words had many of the giants in the room chuckling and whispering.\\n\\n \"I speak for all the thousands,\" the orc king replied. \"As Dame Orelsdottr speaks for the frost giants of the Spine of the World.\"\\n\\n Gerti straightened and narrowed her huge blue eyes - orbs that seemed all the richer in hue because of the bluish tint to the giantess\u0027s skin. \"Then speak, King Obould. I have many preparations before me and little time to waste.\"\\n\\n Obould let his posture relax, wanting to seem perfectly at ease. From the murmurs around him, he took satisfaction that he had hit just the right physical timbre. \"We have achieved a great victory here, Dame Orelsdottr. We have taken the northland in as great a sweep as has ever been known.\"\\n\\n \"Our enemies have barely begun to rise against us,\" Gerti pointed out.\\n\\n Obould conceded the point with a nod. \"Do not deny our progress, I pray you,\" he said. \"We have closed both doors of Mithral Hall. Nesme is likely destroyed and the Surbrin secured. This is not the time for us to allow our alliance to ...\" He paused and slowly swiveled his head so that he spent a moment looking every giant in the room directly in the eye.\\n\\n \"Dame Orelsdottr, I speak for the orcs. Tens of thousands of orcs.\" He put added weight into that last, impressive, estimate. \"You speak for the giants. Let us go to parlay in private.\"\\n\\n Gerti assumed a pose that Obould had seen many times before, one both obstinate and pensive. She put one hand on her hip and turned, just enough to let her shapely legs escape the slit in her white dress, and she let her lips form into a pucker that might have been a pout and might have been that last moment of teasing before she reached out and throttled an enemy.\\n\\n Obould answered that with a bow of respect.\\n\\n \"Come along,\" Gerti bade him, and when the giant nearest her started to protest, she silenced him with one of the fiercest scowls Obould had ever seen.\\n\\n Yes, it was going splendidly, the orc king thought.\\n\\n At Gerti\u0027s bidding, Obould followed her down a short corridor. The orc took a moment to study the walls that had been widened by the giants, obviously, with new cuts in the stone clearly showing. The ceiling, too, was much more than a natural formation, with all the low points chipped out so that the tallest of Gerti\u0027s minions could walk the length of the corridor without stooping. Impressive work, Obould thought, especially given the efficiency and speed with which it had been accomplished. He hadn\u0027t realized that the giants were so good at shaping the stone quickly, a revelation that he figured might be useful if he did indeed crash the gates into Mithral Hall.\\n\\n The chamber at the end of the hall was obviously Gerti\u0027s own, for it was blocked by a heavy wooden door and appointed with many thick and lush bearskins. Gerti pointedly kicked several aside, leaving a spot of bare stone floor, and indicated that to be Obould\u0027s seat.\\n\\n The orc king didn\u0027t question or complain, and was smiling still when he melted down to sit cross-legged, drawing out his greatsword as he descended. Its impressive length would not allow him to sit in that position with it still on his back. He lay the blade across his crossed legs, in easy reach, but he relaxed back and kept his hands far from it, offering not the slightest bit of a threat.\\n\\n Gerti watched his every move closely, he recognized, though she was trying to feign indifference as she moved to close the door. She strode across the room to the thickest pile of furs and demurely sat herself down, which still had her towering over the lower-seated and much smaller orc king.\\n\\n \"What do you want of me, Obould?\" Gerti bluntly asked, her tone short and crisp, her eyes unblinking.\\n\\n \"We were angered, both of us, at the return of King Bruenor and the loss of a great opportunity,\" Obould replied.\\n\\n \"At the loss of frost giants.\"\\n\\n \"And orcs for me - more than a thousand of my kin, my own son among them.\"\\n\\n \"Are not worth a single of my kin to me,\" Gerti replied.\\n\\n Obould accepted the insult quietly, reminding himself to think long-term and not jump up and slaughter the witch.\\n\\n \"The dwarves value their kin no less than do we, Dame Orelsdottr,\" he said. \"They claim no victory here.\"\\n\\n \"Many escaped.\"\\n\\n \"To a hole that has become a prison. To tunnels that perhaps already reek with the stench of troll.\"\\n\\n \"If Donnia Soldou and Ad\u0027non Kareese were not dead, perhaps we could better sort out information concerning Proffit and his wretches,\" said Gerti, referring to two of the four drow elves who had been serving as advisors and scouts to her and to Obould, both of whom had been found dead north of their current position.\\n\\n \"Do you lament their deaths?\"\\n\\n The question gave Gerti pause, and she even betrayed her surprise with a temporary lift of her evenly trimmed eyebrows.\\n\\n \"They were using us for their own enjoyment and nothing more, you know that of course,\" Obould remarked.\\n\\n Again, Gerti cocked her eyebrow, but held it there longer.\\n\\n \"Surprised?\" the orc king added.\\n\\n \"They are drow,\" Gerti said. \"They serve only themselves and their own desires. Of course I knew. Only a fool would have ever suspected differently.\"\\n\\n But you are surprised that I knew, Obould thought, but did not say.\\n\\n \"And if the other two die with Proffit in the south, then so much the better,\" said Gerti.\\n\\n \"After we are done with them,\" said Obould. \"The remaining drow will prove important if we intend to break through the defenses of Mithral Hall.\"\\n\\n \"Break through the defenses?\"\\n\\n Obould could hardly miss the incredulity in her voice, or the obvious doubt.\\n\\n \"I would take the hall.\"\\n\\n \"Your orcs will be slaughtered by the thousands.\"\\n\\n \"Whatever price we must pay will be worth the gain,\" Obould said, and he had to work hard to keep the very real doubts out of his voice. \"We must continue to press our enemies before they can organize and coordinate their attacks. We have them on their heels, and I do not mean to allow them firm footing. And I will have Bruenor Battlehammer\u0027s head, at long last.\"\\n\\n \"You will crawl over the bodies of orcs to get to him, then, but not the bodies of frost giants.\"\\n\\n Obould accepted that with a nod, confident that if he managed to take the upper tunnels of Mithral Hall, Gerti would fall into line.\\n\\n \"I need your kin only to break through the outer shell,\" he said.\\n\\n \"There are ways to dislodge the greatest of doors,\" an obviously and suddenly intrigued Gerti remarked.\\n\\n \"The sooner you crack the shell, the sooner I will have King Bruenor\u0027s head.\"\\n\\n Gerti chuckled and nodded her agreement. Obould realized, of course, that she was likely more intrigued by the prospect of ten thousand dead orcs than of any defeat to the dwarves.\\n\\n Obould used the great strength in his legs to lift him up from his seated position, to stand straight, as he swept his sword back over his shoulder and into its sheath. He returned Gerti\u0027s nod and walked out, holding fast to his cocky swagger as he passed through the waiting lines of giant guards.\\n\\n Despite that calm and confident demeanor, though, Obould\u0027s insides churned. Gerti would swing into swift action, of course, and Obould had little doubt that she would deliver him and his army into the hall, but even as he pondered the execution of his request, the thought of it gnawed at him. Once again, Obould envisioned orc fortresses dotting every hilltop of the region, with defensible walls forcing any attackers to scramble for every inch of ground. How many dwarves and elves and humans would have to lie dead among those hilltops before the wretched triumvirate gave up their thoughts of dislodging him and accepted his conquest as final? How many dwarves and elves and humans would Obould have to kill before his orcs were allowed their kingdom and their share of the bounty of the wider world?\\n\\n Many, he hoped, for he so enjoyed killing dwarves, elves, and humans.\\n\\n As he exited the cave and was afforded a fairly wide view of the northern expanses, Obould let his gaze meander over each stony mountain and windblown slope. His mind\u0027s eye built those castles, all flying the pennants of the One-Eyed God and of King Many-Arrows. In the shadows below them, in the sheltered dells, he envisioned towns - towns like Shallows, sturdy and secure, only inhabited by orcs and not smelly humans. He began to draw connections, trade routes and responsibilities, riches and power, respect and influence.\\n\\n It would work, Obould believed. He could carve out his kingdom and secure it beyond any hopes the dwarves, elves, and humans might ever hold of dislodging him.\\n\\n The orc king glanced back at Gerti\u0027s cave, and considered for a fleeting moment the possibility of going in and telling her. He even half-turned and started to take a step that way.\\n\\n He stopped, though, thinking that Gerti would not appreciate the weight of his vision, nor care much for the end result. And even if she did, Obould realized, how might Tsinka and the shamans react? Tsinka was calling for conquest and not settlement, and she claimed to hold in her ears the voice of Gruumsh himself.\\n\\n Obould\u0027s upper lip curled in frustration, and he let his clenched fist rise up beside him. He hadn\u0027t lied to Gerti. He wanted nothing more than to hold Bruenor Battlehammer\u0027s heart in his hands.\\n\\n But was it possible, and was the prize, as he had claimed, really worth the no-doubt horrific cost? \\n\\n","sourceLink":"https://allnovel.net/the-two-swords-hunter-s-blades-3/page-4.html","bookId":2142,"book":{"id":2142,"title":"The Two Swords (Hunter\u0027s Blades #3)","description":"Storyline: The Two Swords (Hunter\u0027s Blades #3) \\n In The Two Swords, Obould\u0027s horde has pressed the Companions to the very gates of Mithral Hall, where Bruenor and his clan launch a desperate, last-ditch effort to push the orcs back. A desperate rescue attempt succeeds, with Drizzt and Innovindil rescuing the latter\u0027s pegasus, which Obould had captured and chained as a trophy, and Drizzt is unexpectedly reunited with the Companions that he long thought dead. The only major plot line to be tied up in this novel is the question of what Drizzt will do about his relationship with Catti-brie. Other than that, The Two Swords resolves a few minor plot threads. Drizzt and the surface elf Innovindil bring their quest for the captured pegasus to a conclusion. A few more characters meet their demise in this novel.\\n","cover":"https://allnovel.net/images/the-two-swords-hunter-s-blades-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-two-swords-hunter-s-blades-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:16:52 PM"}}
