{"id":28244,"no":9,"title":"THE ESCAPE FROM THE CASTLE","content":"\"Tell the baron that I, Conrad von Waldensturm, have carried off my sister, and give him my [Pg 157]defiance;\" and then with Henrick he hurried along and soon rejoined the women. Already there was a tumult in the castle; the sentry had blown his horn, and then run down from the wall and entered the castle to arouse the baron. Conrad sounded the note that his followers knew, and they then hurried along until they arrived at the spot where the men were standing with the horses. \"Now,\" he said to Minna, \"you must mount behind me, two of my men will take your maids.\" The din in the castle was now prodigious; a horn continued sounding and the alarm-bell of the castle ringing, orders were being shouted, and it was evident that the garrison were fully roused, and that in a few minutes the pursuit would begin. Conrad and two of the men sprang into their saddles. Henrick lifted Minna to her place behind Conrad, and the two girls behind the men. \"Hold tight, girls, we have not far to go,\" Conrad said. Henrick mounted, and all started at a gallop. Conrad was glad to hear the watchman on the tower over the gate shout at the top of his voice: \"I hear the tramp of horses; they have just started.\" There was no need for haste; it would be another five minutes at least before the baron could start. Still, as Conrad wished to see that everything was ready, he maintained his pace until he reached the [Pg 158]wood where his party were assembled. Then they dismounted. The men led the horses to the spot where the others were tied up, near the farther edge of the wood. Conrad led his sister and the maids to a distance from the road; he had already told her what was going to take place. \"Wait here till I come to fetch you,\" he said; \"I must see that all is in readiness.\" He joined the men, who were gathered thickly by the road, and took his place by the ropes which would bring the head of the column to a halt. Here his own vassals were chiefly gathered, while his men-at-arms were stationed, under Johann, at the point where their pursuers would enter the wood. This he considered to be the most important post, as many of the troopers would certainly try to escape when they found that they were caught in an ambush. Two minutes after his arrival he heard the sound of a party of galloping horsemen. \"I think,\" he said to Grun, who was standing next to him, \"there are from thirty to forty of them. The baron would probably ride off as soon as a score or two of his men had mounted.\" In a minute the troop came along at a furious gallop, led by Von Goldstein and his son. Suddenly the head of the column seemed to collapse; men and horses rolled over; those behind, unable to check their horses, crashed into a confused heap on the [Pg 159]ground, and before they could check themselves well-nigh half the party were heaped upon each other. As the baron and his son fell, Conrad\u0027s bugle rang out, and a flight of arrows and of cross-bow bolts poured into the rearmost files of the troop, and at the same moment a crowd of men sprang out from the trees and assailed them with pike and sword, scythe and flail. Taken utterly by surprise, appalled by the suddenness of the attack, and by the catastrophe in which their leaders and half their comrades were involved, the remainder of the troop offered but a feeble resistance. Johann, with his men, came rushing up from the rear, for not one of the troopers had time to turn his horse before being surrounded by his foes. Conrad took no part in the fight, but, on seeing how complete was the success of the ambush, sheathed his sword, and returned to the spot where he had left Minna, leaving it to the infuriated peasants and troopers to complete the work. \"The first blow has been struck, Minna. Von Goldstein and his son have paid with their lives for their crimes and for the ruin that they have brought upon us. I shall send you off to the castle under the guard of four of the vassals, and you will remain there until you hear from me.\" \"But why should you not come yourself?\" \"Because I have only begun my work. I hope[Pg 160] before morning to finish it. I am going to take Goldstein by surprise, and I have little doubt that I shall succeed. I have nearly two hundred men, and as some thirty of the garrison have fallen, we shall outnumber them considerably.\" The four men had already been told off to escort the young countess and her maids, and horses having been brought up, the party at once started, and Conrad returned to the scene of conflict, where all was now quiet. Not a man of the baron\u0027s party had escaped; he himself and his son had been found dead when the horses had either recovered their feet or been dragged off. Whether they had broken their necks or been smothered by the mass piled over them none cared to enquire, but many a vengeful stab showed that the peasants were determined to make sure of their deaths. Some torches had been brought for the purpose, and these having been lit, the peasants had carefully examined the fallen troopers to make sure that the work of vengeance was complete. Conrad, on his arrival, called them all together. \"So far the work has been well begun,\" he said; \"your tyrant is dead. Now for the next blow. Herr Grun tells me that he has, as I requested him, chosen fifty of the most active for special work. Let these form in a body.\" When the young men had obeyed his order he continued: \"Now, Johann, you[Pg 161] and Henrick and the four men I have already told off will go with this party, Johann in command, and do the work with which I charged you. You will proceed along the foot of the castle wall till you get to the spot where I descended. There you will remain quiet until you hear the attack at the gate; then you will climb the rope, and, as soon as you are all assembled on the wall, will rush down and seize the inner gate, cut down all who are guarding it, and then, leaving Henrick and ten of the men there, will run into the outer court and take the baron\u0027s men in rear. Henrick, as soon as the others have gone, will close the gate behind them. There is little fear that you will be disturbed, for all the defenders of the castle will rush down when they hear the fighting in the outer court.\" \"I understand, my lord,\" Johann said; \"never fear but that we will do our part in the business.\" \"Remember,\" Conrad went on, \"everything depends on your carrying this out silently. Do not go in a solid body; steal along as quietly as possible. There is little fear of their seeing you, but beware of striking a foot or weapon against a stone.\" As soon as Johann and his party had moved off, he continued: \"Now, strip the armour and steel caps from the dead troopers. How many are there of them?\" [Pg 162] \"Thirty-four, count,\" Grun said, \"and there are twenty-five of their horses uninjured, and the five of Johann and his party.\" \"Then choose thirty-nine men,\" Conrad said, \"and let them divide the armour among them, and let each take a horse and mount at once. We shall, with my fifteen, be a stronger party than rode out, but in the darkness they will not notice that. All the rest will follow us on foot, keeping a hundred yards in rear. When we enter the courtyard, ride, in the first place, and cut down any of the troopers who may be there; it is probable that the greater part of them will be gathered on the wall to await the baron\u0027s return. When you have cleared the courtyard you will, at the sound of my bugle, dismount. By that time we shall be joined by those on foot, and we shall then see what steps we had best take against the men on the walls.\" In a quarter of an hour all was ready, and at the head of over fifty mounted men Conrad rode off at a foot-pace, the unmounted men following close behind. When within a quarter of a mile of the castle, Conrad gave the order, and at a canter they rode towards the gate. As they approached, the men broke into a cheer, and the garrison, taking this as a proof that success had attended them, and that the fugitives had been captured, answered with[Pg 163] shouts of welcome. As Conrad had expected, the drawbridge was down and the gate open. As he rode in with his men Conrad raised a shout: \"A Waldensturm! a Waldensturm! kill! kill!\" and instantly attacked the men who were gathered inside the gate to welcome the baron\u0027s return. Taken wholly by surprise, their resistance was feeble, and the thirty or forty men in the courtyard were speedily despatched; but by this time those on the walls were pouring down to the assistance of their comrades. Conrad blew his horn; his followers dismounted and rushed for the new-comers, and just as they did so the unmounted men ran in through the gate with loud shouts. A panic seized the baron\u0027s retainers, and these again ran up the steps to the top of the wall. Many of the assailants would have followed them, but Conrad called them off. He knew that the stairs could not be carried without great loss, as a dozen men at the top of each of the flights of steps could hold them against hundreds. The fight had not been conducted in darkness, for there were many torches burning in the courtyard. \"We will wait till morning,\" he said; \"they are like rats in a trap.\" At this moment a sudden uproar was heard in the inner courtyard, and shouts of \"Waldensturm! Waldensturm!\" and a couple of minutes later Johann and his party rushed in through the[Pg 164] upper gate, where they stopped, astonished at the quietness that prevailed. \"They are all on the wall, Johann; there is nothing more to do at present,\" Conrad said. \"I will go back with you, and we will take possession of the castle itself. There is not likely to be any resistance; few men will have remained there, and these, when they see that both courtyards are in our hands, will hardly resist. If they surrender, we will kill no one, and no damage must be done to anything; the castle is mine now. Herr Grun, will you remain in command here; I do not think the men on the wall will make an attack, but keep a close watch on them.\" The castle gate was closed when they reached it, and five or six men with cross-bows were at the windows commanding it. \"What ho there!\" Conrad said. \"It is useless for you to resist. I, Conrad von Waldensturm, call upon you to surrender. The baron and his son are killed, and half the garrison; the rest are in our power. If you surrender peacefully your lives shall be spared; if not, every man will be put to the sword.\" There was a short pause, and then a voice said: \"We surrender, relying upon your knightly word.\" A minute later the sound of bars being withdrawn was heard, and the door opened. Conrad, with his[Pg 165] own followers, entered, letting the others remain without. The men were first disarmed and placed in the guard chamber at the gate, and a sentry posted outside. Then, taking torches from the walls, Conrad made a hasty survey of the interior, telling the frightened scullions and other servants that no harm would come to them. \"\u0027Tis indeed a stately castle,\" he said to Johann, \"and I have made a good exchange. Now, do you remain here in charge; I will go down and see how matters are proceeding. Day is breaking already.\" Then with those who had remained outside the castle gate he joined the main body in the outer courtyard. \"Now, Grun,\" he said to the farmer, \"we will summon the men on the walls to surrender. They must see that their case is desperate. There are but sixty or seventy of them, and they are hopelessly outnumbered. If they refuse, I shall not attack them; hunger and thirst will soon tame them. We have not lost a life, and I would not that any of your good fellows or mine should be killed, and were we to storm the walls we should assuredly lose many. I should be sorry indeed were any wives left widows, or children fatherless, by this night\u0027s work.\" Accordingly, as soon as it became light, Conrad summoned the men on the walls to surrender on[Pg 166] promise of their lives being spared. The answer was a yell of defiance. When this subsided he said: \"Well, if it pleases you to starve like rats in a trap you can do so; there is no hope of your escape or of aid arriving. The baron, his son, and all the party who rode with him are dead, the castle is in my possession, and you are as much prisoners as if you were in a dungeon.\" He now ordered his own men and a dozen of his vassals to leave the courtyard and form a line across the narrow neck by which the castle was approached, and to see that no one passed; for he deemed it possible that a man might be lowered from the wall to entreat aid from some of the baron\u0027s neighbours. Food was brought out from the castle and distributed. The men were divided into four parties, each of which was to take up its station near the foot of the four flights of steps up to the wall. Two mounted men were sent off to Waldensturm to fetch the young countess back, and the courtyards were cleared of the bodies that had fallen. Three hours later Minna arrived. On the way she had heard the details of the capture of the castle, and was delighted to hear that it had been taken without the loss of a single man. \"I am proud of you, indeed,\" Minna said. \"I always was so, but after capturing in this way a castle that the baron considered impregnable, I shall always regard you as a hero indeed.\" [Pg 167] \"The credit is chiefly due to Grun and his daughter,\" Conrad said. \"Without them we could have done nothing; with their aid the matter was simple enough.\" The brother and sister sat for a long time talking together in the great hall of the castle. They had much to tell each other of what had happened since they had parted two years before. \"And you are really to be lord of this castle?\" she said. \"But can you keep it, Conrad? the elector may bring an army against it.\" \"I think I can hold it if he does; but I do not think that he will. I have an order from the emperor to the elector to declare the baron\u0027s estates forfeited, and to install me in his place, and it contains a threat that he would himself send a force to carry this out if he failed to do so, and that I should hold it direct from him. Had I not captured the castle, the parchment would have been of little good; the elector would know that the threat was a vain one, since the emperor has no force that he could send on such a long expedition, needing every man in his struggle with the Turks. Moreover, the elector regarded the baron as a great friend of his, and even did he feel constrained by the command of the emperor to aid me, he would know that he would need all the force that he could raise to capture the castle. But[Pg 168] now that it has been done, and I am its master, the matter has changed altogether, and he would rather have me as his friend than his enemy, especially as most of the vassals that he could call upon to aid in recapturing the castle must have viewed with displeasure the baron\u0027s attack on my hold in my absence, after having taken the oath of peace. No, I have no fear whatever of that. A large portion of the vassals of the estate have aided me, and all would take refuge here if a force marched against me, and would fight till the last, knowing that no mercy would be shown to them. No, Minna, I think that we need have no fear for the future.\" At four o\u0027clock in the afternoon Conrad was summoned to the courtyard, as the men on the wall had shouted that they were ready to surrender. \"I thought that they would soon be tired of being cooped up there without food or drink,\" Conrad said as he went out; \"I have been expecting it for the last two or three hours.\" Thirst rather than hunger had done its work, and the certainty that sooner or later they must give in had broken their spirit. As the count appeared in the courtyard, there was a general shout of: \"We surrender, on the promise of our lives.\" [Pg 169] \"I promise you that. Now let every man take off his armour, and lay it and his arms on the wall, and then come down four at a time. You shall have food and water given to you, and you will then leave the castle, and anyone found within the limits of the estate by nightfall will receive no mercy.\" In an hour the last of the garrison had left the castle. The tenants on the estate at once dispersed to their homes, all receiving a present from the count, and a promise of remission of half that year\u0027s dues. His own vassals he kept there, to form, with his retainers, the garrison until he could hire a sufficient force for that purpose. At the end of that time they could return to their ruined homes, Conrad promising them aid to rebuild their houses, and an entire remission of all dues for the next two years. Conrad then drew up a document, addressed to the elector, stating what he had done, and enclosing a copy of the emperor\u0027s order, saying that he would himself present the original when he visited the court of Treves. As he had anticipated, the elector\u0027s reply was favourable. \"He had been,\" he said, \"shocked at the conduct of the baron in attacking and ravaging the castle and estates of Waldensturm, and the punishment inflicted upon him was a just one. He would, therefore, willingly accept Conrad as his vassal for[Pg 170] the feoff of Goldstein, and begged him to speedily repair to his court to take the oaths.\" Thus Conrad von Waldensturm revenged his wrongs, and obtained the finest estate and the strongest castle in the Electorate of Treves. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3177/87091.html","bookId":857,"book":{"id":857,"title":"A Soldier\u0027s Daughter","description":"简介： On the North-West frontier of India stood the little fort of Darlinger. It had been erected two years previous to the opening of this story, and was occupied by three companies of a Punjaubi regiment under the command of Major Ackworth. It was intend...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3177","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
