{"id":42312,"no":5,"title":"CHAPTER IV.","content":"Dyeing the Hair—Of Hair-dyes generally—Powder Dyes—Liquid Dyes—Iron Dyes—Lead Dyes—Various opinions concerning the use of Lead Dyes—Silver Dyes—Dyeing False and Faded Hair—Bleaching and Blanching Hair. yeing the hair upon, as well as off, the head, is a very important subject, and should be dealt with in as complete a manner as possible. A selected number of recipes will prove, doubtless, interesting as well as useful. In the days of my apprenticeship—(it is not necessary to say how many years ago)—there were packets of “Pompeian Hair Dye” in the shop window of my master, which bore the name of the famous chemist Orfila, and the recipe for making this dye was found, at least so the label stated, “among the ruins of Herculaneum.” “What a wonderful discovery,” I used to think; and “how I should like to know the secret of its manufacture.” It was a powder dye, and had to be mixed with water, to the consistency of paste, before application, the hair being thoroughly washed and dried first. It was generally applied at night time, and the head had to be well covered with oiled-silk, a 43bladder, or some other non-porous substance, for hours, to confine the “mixture” to the hair. When the “bandages” were removed in the morning the head appeared as though it had been dipped in a flour-barrel; and, oh! what a task it was to get it clean. These powder-dyes are seldom used now; but, nevertheless, it is as well to give two or three recipes for making them. (1) Orfila’s hair dye: Take three parts of litharge (oxide of lead) and two of quicklime, both in an impalpable powder, and mix them carefully. When used, a portion of the powder is mixed with hot water or milk, and applied to the hair, the part being afterwards enveloped in oil-skin or a cabbage-leaf for four or five hours. (2) Litharge two parts, slaked lime one part, chalk two parts, all finely powdered and accurately mixed. When required for use mix the powder with warm water, dip a brush into the mixture, and rub the hair well with it. After two hours let the hair be washed. (3) Litharge 4? ozs., quicklime ? oz.; reduce to an impalpable powder, and pass it through a sieve. Keep it in a dry, close bottle. Wash the hair first with soap and water, then with tepid water; wipe it dry, and comb with a clean comb. Mix the dye in a saucer with hot water to the consistence of cream, and apply to the hair, beginning at the roots. Place over it four folds of brown paper, saturated with hot water, and drained till cool, and over this an oil-skin 44cap and a nightcap. Let it remain from four to eight hours, according to the shade required. When removed, oil the hair, but do not wet it for three or four days. There always was an objection to these powder-dyes through the time consumed in the operation, but the following act more quickly. (4) Take of lime (slaked by exposure to damp air) two parts; carbonate of lead (pure white lead) one part. Mix thoroughly, pass the mixture through a gauze sieve, and at once bottle it and keep the air from getting to it. Used as the preceding, but acts in one-third or one-fourth the time. The shade depends chiefly on the length of its application. (5) Chevallier: Take of fresh slaked lime 5 drachms; water, 1? oz. Mix, strain through gauze, and pour the milky solution into a 4–oz. bottle. Next take of sugar of lead 5 drachms, water 3 ozs.; dissolve. Add to this solution dry slaked lime 1 drachm, and agitate them well together for a few minutes. Wash the resulting precipitate with a little distilled or soft water, drain, and add it to the “milk of lime” in the 4–oz. bottle. Lastly, shake the whole well together, and again before use, if it be not at once applied. It must be kept well corked, as the last, but acts more quickly. I can imagine the reader expressing surprise after reading the foregoing; and to young men in the trade it would appear marvellous that people should submit to such an ordeal. That 45writers should condemn the use of “lead dyes” (if the last recipe given be the kind alluded to), I can very well understand; but liquid (lead) preparations I do not consider open to such disapprobation. One reason can be given why lead solutions are preferable, that is, they do not darken the skin; and, indeed, with liquid dyes in the hands of a careful manipulator, there is little occasion to touch the skin; but when such an accident occurs, it ought to be wiped off directly. Liquid dyes are easily applied, more certain in their effect, and, undoubtedly, less unpleasant to those who have occasion to use them. Liquid dyes may be divided into two classes, namely, those which gradually darken the hair, and those which produce an instantaneous change. Before proceeding farther, it is advisable to note the chemical constituents of hair, because a successful result depends, to a certain extent, at least, upon this being taken into consideration and acted upon accordingly. It is known to scientific men that the chemical constituents of hair, according to the analysis of Vauquelin, are—animal matter in considerable proportion; a greenish black oil; a white concrete oil, in small quantity; phosphate of lime; carbonate of lime, a trace; oxide of manganese; iron, sulphur, and silex. Red hair contains a reddish oil, a large proportion of sulphur, and a small quantity of iron. White hair exhibits a white oil, with 46phosphate of magnesia. The white hair of old persons contains a maximum proportion of phosphate of lime. In preparing a dye for the hair, where the required element is absent it has to be supplied by art. For illustration, in red hair sulphur largely predominates, and as a consequence the hair readily darkens; in white hair—the white hair of aged persons—it is not to be found; hence the necessity of supplying a mordant to produce the desired effect. To gradually darken the hair, then (assuming that sulphur is still developed in the course of its formation), a wash composed of a weak solution of the salts of iron, such as the sulphate, acetate, lactate, or protoiodide will be sufficient. A very small quantity of glycerine can be added at pleasure, but to the latter it is necessary. Here are two or three recipes:—(6) Sulphate of iron (green; crushed), 1 drachm; rectified spirit, 1 fluid oz.; oil of rosemary, 10 or 12 drops; pure soft water, ? pint; agitate them together until solution and mixture are complete. Many persons substitute the strongest old ale for the “water” in the above. Another formula is, (7) take of rust of iron, 1 drachm; old ale (strongest), 1 pint; oil of rosemary, 12 or fifteen drops; put them into a bottle, very loosely corked, agitate daily for ten or twelve days, and then, after repose, decant the clear portion for use. The following is said to be a favourite among fashionable Parisians. (8) 47“Parisian.” Take of sulphate of iron (green), 15 to 20 grains; distilled verdigris, 5 or 6 grains; white wine (good), ? pint; eau de Cologne (to scent), q.s.; mix. It should be mentioned that all these washes will “iron-mould” linen if they are brought in contact. Should the foregoing not answer satisfactorily, the cause will probably arise through the absence of the normal sulphur of the hair, and in that case, water containing a little sulphuret of potassium, or hydrosulphuret of ammonia should be used once or twice a week. Much has been said concerning lead dyes, and the injurious effects produced upon individuals who have used them for any length of time. Dr. Benjamin Godfrey, a gentleman with whom I had the honour of being acquainted, devoted considerable attention to this question, and in his treatise on “Diseases of Hair,” published in 1872, says: “The common hair cosmetics of the present day contain lead. The following is a rough analysis of the more noted:— “Mrs. S. A. Allen’s World’s Hair Restorer, acetate of lead, sulphur and glycerine. “Rossetter’s Hair Restorer, ditto. “Simeon’s American Hair Restorer, ditto. “Hall’s Vegetable Sicilian Hair Renewer, ditto. “Aqua Amarella, ditto. “Helmsley’s Celebrated Hair Restorer, ditto. “Melmoth’s Oxford Hair Restorer, ditto. 48“Alex. Ross’s Great Hair Restorer, oxide of lead, carbonate of lead, and potash. “The quantity of lead in any of these could not possibly do harm. The strongest contained but ninety grains to the half-pint of water, the weakest but three grains to a like bulk. Water was the chief ingredient of them all. Sulphur, sometimes in the form of milk of sulphur, was used; in another, the common flower of sulphur; sometimes acetate of lead, at other times oxide of that metal. In all the chemical change is the same, namely, the solution of the metal entering into the filament by absorption, there unites with sulphur, forming a sulphuret of the material used. Hair is porous; sulphur exists in hair of all colours, but is in excess in red and blonde hair. This is why these hues become blackened by the chemicals used more perfectly than any other shades. “Now, the question has been asked oftentimes, whether the use of lead solutions as hair-dyes be prejudicial to health or no? “As this is a question of much importance, we will look carefully into the matter. “The absorbent power of the skin is not great without we remove its outer covering. If we desire to get remedies absorbed into the system, we first blister the surface, remove the outer covering, then sprinkle our drugs upon the derma, and the material then goes into the body. In the endermic method of giving medicines, we 49must perforate the skin to produce any effect. The cuticle is the protecting agent—one of Dame Nature’s waterproof coverings to keep out external poisons.” And again—“Now, the skin of the head is additionally protected by an oily solution—the sebaceous secretion—which forbids entirely the absorption of any watery hair-dye. So, protected with nature’s waterproof cape and oiled epidermis, it is impossible for an aqueous solution to enter the body and destroy life. I have carefully analysed the cases recorded in which lead cosmetics are said to have caused death. Almost all the cases occurred in France, and lead, in an ointment, had been used. Now, an unguent could easily be absorbed by an oily skin; therefore these accidents are at least probable. The watery solutions of lead for the last ten years have been used largely by thousands and tens of thousands of beings in our land, yet not one single case has been recorded of poisoning from their use.... I have seen patients who have used lead dyes for twenty years, but not a single sign of lead poisoning has been revealed.... In the strongest hair-dye that I have examined there has been but one quarter of an ounce in a half-pint bottle of water, which would last the patient at least a month. Putting all these things together, one can state that the hair-dyes, as used in England at the present day, cannot prove injurious to the users.” 50Another writer, Dr. Southwood Smith, in his “Philosophy of Health,” stated that, “Over the external surface of the body, or the skin, there is spread a thin layer of solid, inorganic, insensible matter, like a varnish of india-rubber. The obvious effect of such a barrier placed between the external surface of the body and external objects is to moderate the entrance of substances from without. Hence the impunity with which the most deadly poisons may remain in contact with the skin, with which prussic acid, arsenic, corrosive sublimate, may be touched and handled.” And Sir Erasmus Wilson, F.R.S., writes: “The epidermis acts as an impediment to absorption, and as such is an important safeguard against the admission of injurious and poisonous substances into the blood. Thus we find that it is only after long soaking, or by continued friction, that we are enabled to overcome this natural defence, and then only to a very partial extent.” Of lead dyes the following recipes may be found acceptable—(9) Brown hair dye: Acetate of lead, 2 drachms; hyposulphite of soda, 1 drachm; rose-water, 14 ozs.; glycerine, 2 ozs.; dissolve the acetate of lead and hyposulphite in separate portions of the rose-water; filter separately, mix the solutions, and add the glycerine. The two following are from Dr. C. H. Leonard’s work on “The Hair”: (10) Sugar of lead, 40 grains; distilled water, 2 ozs.; apply this to the hair thoroughly, and when about dry 51apply a solution of the sulphide of ammonium, about one-fourth the strength of the British Pharmacop?ia solution. The objection to this is its unpleasant odour. It gives, though, an excellent brown or black colour to the hair, according to the strength of the solutions employed, and does not stain the scalp. (11) Brown hair-dye: Acetate of lead, ? drachm; flowers of sulphur, 1 drachm; water, 4 ozs.; shake well and apply night and morning for a week or so, then decrease the frequency of the application, gradually, to once a week, or once in two weeks. This is a slow dye, yet one that answers fairly when there is not much greyness in the hair. It also is a very mild preparation. The deposit left upon the skin can be easily brushed off when it becomes dry. Like all of the lead dyes, it acts best upon hair of a reddish tinge, though grey hair is turned to a brownish colour by it. Its effect upon light hair is to give more of a dark brown tint to it. I now offer some remarks on silver dyes, for probably they are more in use than any of the other kinds. One reason is, they are quicker in their action, and, with careful manipulation, more decided in effect. Before application, however (indeed, before any dye can be effective), it is important to thoroughly wash the hair with soda or soap and water, which must be well rinsed out with plenty of tepid or cold water, and the hair dried. It is then ready for the dye. It should 52be borne in mind that silver dyes will stain linen, the skin, and finger nails, and almost any thing the dye is brought in contact with. Under these circumstances, then, carefulness must be observed. Sunlight, and the open air will produce a permanent change in a few minutes; with diffused daylight it takes much longer, perhaps two or three hours. But science has stepped in, and, with the employment of a good mordant, the desired alteration of colour is effected almost instantaneously. Should the skin, however, be wetted with any of the dye, wipe it off directly, for if left untouched, a dark mark will be the result. A cloth damped with a solution of hydrosulphuret of ammonia, or sulphuret of potassium, and rubbed on the spots, will remove recent marks. So will a solution of iodide or cyanide of potassium, but these, on account of their poisonous qualities, are best avoided. Proper caution in using the dye, a pair of old gloves to cover the hands, and some little practical experience will prevent any unpleasant results. (12) One solution, crystallised nitrate of silver, 1 drachm; gum arabic, 1 drachm; distilled water, 2 ozs.; mix. (13) Another: one solution, nitrate of silver, 192 grains; distilled water, 8 ozs. Dissolve and add gradually sufficient of the strongest solution of ammonia to precipitate the silver. Then, afterwards, just as much as is necessary to redissolve the precipitate. 53The following dyes require two solutions, and produce a rapid change: (14) No. 1. Hydrosulphate of ammonia, 1 oz.; solution of potash, 3 drachms; distilled water, 1 oz.; mix. Apply this with a tooth-brush, and in about a quarter of an hour use.—No. 2. Nitrate of silver, 1 drachm; distilled water, 2 ozs. In all cases when two liquids are employed, the vessels into which they are poured, the brushes used for applying them, combs, etc., must be kept separate, otherwise the action of the dye upon the hair will be destroyed. Generally, the mordant is used first and the dye afterwards, but this order is reversed in the following “Instantaneous Hair Dye,” the recipe for making which is taken from the work by Mr. A. J. Cooley. (15) The white liquid, or “dye,” is a solution of nitrate of silver (1 to 8, 12 to 16). This is applied first. It is followed by the “mordant” (diluted). The latter is usually a mixture of hydrosulphuret of ammonia and distilled water, in nearly equal proportions. The colour of the hair, unaltered by the silver solution, instantly turns “brown” or “black,” according to the strength of the dye, when moistened with the hydrosulphuret. Then there are “vegetable dyes,” “vegeto-mineral dyes,” “animal dyes,” “pommade dyes,” and washes for producing red, auburn, golden, golden brown, and other shades of colour in the hair, but to go fully into this subject at the present moment, would be a little beside the object I have in view. 54I might dismiss the subject of dyeing “false hair,” as it is called, with a few brief remarks, seeing that hairdressers rarely think it worth their while to perform the experiment; but, as it sometimes happens, new hair has to be added to that which is old and faded, to meet the requirements of economical customers, then “how to restore it” becomes a question. Of course, if the hair be impoverished, and assumes a “foxy” hue, it cannot be restored; but—what answers the purpose just as well—it can be dyed. There is only one other reason to be adduced, so far as I can tell, for dyeing “false hair,” and that is, when a tradesman has a quantity of red hair by him which is unsaleable, and, consequently, thinks proper to make it a more common colour. Whether red-haired people have generally “good crops,” or whether they darken their hair by the use of suitable preparations, I will not pretend to say; but certainly red hair is not very often in request. White, grey, auburn, flaxen, and several choice pale colours are too valuable to be interfered with, and ordinary colours are sufficiently plentiful without resorting to the use of dye. To dye “false hair,” then, one of the lead and sulphur dyes mentioned in the preceding pages will answer every purpose, and its action may, in some instances, be promoted by boiling. Or any of the methods used in dyeing wool may be employed with good effect, for, in this connection, there is not much dissimilarity in hair and wool, and what 55will dye one will dye the other. In dyeing blacks, and dark colours, logwood forms one of the principal ingredients, and in conjunction with gallnuts it imparts a lustrous appearance. It should be used either hot or boiling, according to the depth of colour required. The accompanying formula is very effective. (16) Logwood, ? lb.; copperas (sulphate of iron), 1 oz.; nut galls, 1 oz.; and about 2 quarts of water. Boil for an hour, or longer according to the shade required. It is necessary to observe that the hair should be taken out of the dye-bath several times, and freely exposed to the air. This is called “airing,” and is done to allow the oxygen of the atmosphere to act upon the ingredients of the dye, and especially on the iron; as without this action of the air a good colour cannot be produced. To possess a head of hair of the “golden” blonde, flaxen, or auburn hue, has been the desire of many ladies from time immemorial, and various expedients have been resorted to to produce the desired effect. At the present moment I do not intend to dilate upon this subject, but of all substances used for the purpose of bleaching or blanching hair, whether it be upon or off the head, nothing surpasses peroxide of hydrogen, respecting which Mr. Alfred H. Mason says:—“The best known application for peroxide of hydrogen is probably in its employment as an auricome for bleaching dark coloured hair, producing the yellow tint: for this purpose a 10-volume 56solution is used, the hair is saturated with it, and then exposed for two or three days, when the oxygen is liberated and the hair partly decolourised; if wanted in a shorter time, after immersion the hair is dried in a water-bath for a few hours, but the ultimate result is not so satisfactory. A London hairdresser produces white hair, and it is conjectured that he employs a 20–volume solution, with the addition of strong solution of ammonia, and so completely decolourises and bleaches the hair, at the same time rendering it practically destroyed excepting so long as it holds together.” I think enough has been said upon dyeing, to enable the intelligent reader to overcome many of the difficulties that are sure to arise in the course of his business pursuits. The operation, whether it be performed upon the growing hair, or upon that which is faded and dead, must be carried out with carefulness and patience to ensure a satisfactory result. Men in all branches of science, have to perform one experiment after another before they can achieve success, and hairdressers, if they wish to be clever in their profession, must be content to do the same. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2787/77189.html","bookId":1305,"book":{"id":1305,"title":"Board-Work","description":"简介： The following work, which is the result of much anxious study and labour, is designed to meet a long-felt want. It is intended chiefly for the use of apprentices, improvers, and others in the trade whose knowledge of board-work is deficient. The Auth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2787","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
