{"id":42315,"no":8,"title":"CHAPTER VII.","content":"Scalpettes and Fringes; general remarks thereon—Curled and Waved Fringes—“Water Waves”—Mounting and Making Scalpettes. aldness is not by any means confined to the male sex, for females, through illness, accouchements, neuralgic pains in the head, constitutional weakness, frequent head-aches, tying the hair improperly, overmuch crimping, and other causes—frequently experience a loss of hair. True, this can easily be concealed by means of headdresses, bows, ribbons, flowers, lace, and so forth, but young and middle-aged ladies do not find it convenient to have recourse to such artifices at all times. Formerly, bandeaux and “fronts” were employed to conceal this defective condition of the hair, and they are still in request by elderly people and those whose means are limited. But now, thanks to the ingenuity of ladies’ hairdressers, the “scalpette” has been invented, and it may truly be regarded as a veritable work of art. What is a scalpette? As this is comparatively a new word, it will be advisable to dwell for a moment upon its meaning. I therefore consider it to signify an artificial covering for concealing a deficiency of hair, or to cover a bald place upon the female head—but not a wig. Just the 98same as a “scalp” is an artificial covering for the bald head of a man—but it is not a wig. Assuming, then, that my definition is correct, those of my readers who have much to do with board-work will readily perceive the variable nature of the invention. A scalpette can be made to cover a small space, or the entire top of the head; it can be formed with or without a “fringe;” with or without a parting or partings. It can be manufactured with long straight hair, or short curly hair, or both. It can be “knotted” upon gauze or a “human hair foundation,” and made, figuratively speaking, “as light as a feather,” or it can be woven, and mounted with net and galloon, which is, doubtless, more durable and less expensive. In short, a scalpette can be adapted to any possible requirement, and that there is a demand for such manufactures at good prices in certain localities, both in town and country, will not, probably, be contradicted. Speaking of sundry ingenious contrivances for concealing bald patches, and helping thin partings to an improved appearance, the Queen newspaper observes that the modes of covering thin partings are various. “First, if the head is very bald at the top, a scalpette of straight hair is added; this comes to a point in front, so that any hairs that may remain on the forehead are seen; the partings of this scalpette are made of hair, and are quite invisible; secondly a scalpette of small curls is laid over the parting; it rests quite flat on the 99head, and is dressy and becoming; and thirdly, a scalpette of short straight hair, which forms a fringe in front, and mingles with the wearer’s own hair at the sides. The mode of concealing a thinness of the hair at the sides is to insert a piece of long hair, mounted on the most invisible of hair partings. This thinness at the sides is generally accompanied by the same at the top of the head; the addition is then made to conceal all together. The wearer’s own hair is parted at the side, the addition added and kept in its place by a few hairs brought over, and then the whole dressed together, the added piece being quite imperceptible. Another mode is the scalpette which curls at the top, and has straight hair coming from it on either side. When an entire covering is necessary, there is the invisible topee. These cover the parting with short hair, and are on the principle of a front without either springs or strings.” It will appear, as my work advances, how scalpettes can be manufactured, but a knowledge of mounting and knotting must first be acquired, and the other will follow in due course. Fringes are of a less difficult character, at least the majority of them, but some of the more elaborate ones must, for the reasons given above, stand over for the present. Here is one[9], however, of simple construction, which is made on a wire foundation. Take half an ounce of six-inch hair in tight Sevigny curls. Adjust the weaving-frame, with a wire (instead of silk) in the centre, as has been before described. Make about fifteen inches of close or “once-in” weft. Comb out the hair carefully, curl up, and securely finish off the weft. Cut down. Fold the weft in three equal portions, and neatly, yet firmly, sew the ends together. Take a piece of watch-spring, one-and-a-half or two inches long, and adapt it to fit the bend of the head. Round off the ends, which is to be done with a small, fine file, or by rubbing the corners on a stone. Protect the ends with a piece of waxed kid, thin leather, or parchment, and then cover the spring with galloon. The galloon should be as narrow as possible, with the ends carefully turned in and stitched; it must also be sewn “over and over” at the sides. Gently hammer to make it as flat as possible; and I need scarcely observe that the stitches in this, and all other work should be small and almost invisible. Having thus prepared the spring, put it in position, namely, in the centre of the mount, the lower end being inside the weft, to which it is to be sewn. Sew the top row to 101the top of the spring, while the centre row of weft is, of course, to be attached to the middle of the spring. Tack the “fringe” on to a block, and dress in a number of small curls, as shown in the illustration. Another way is to take three-quarters of an ounce of short, tight curled hair, and make twenty inches of weft or more. Sew up into four rows and put two springs, each one to be full an inch from the ends. In this case, the springs must not be quite so long as the previous one. Dress out as before. Waved Fringes[10] are made of curled hair, perhaps twelve or fourteen inches in length, or more, as occasion may require. The hair is closely woven upon silks, and sewn up in diamond fashion; the width and depth of the same being left to the maker’s judgment. This scalpette is very light and lies flat upon the front of the head and forehead. The curl is “broken” by means of damping and a warm iron, and sometimes by a “touch,” but only experts can do it properly. Of course, 102fringes can be made of all sizes and shapes; that matter is generally regulated by the parties concerned, and the price which is to be paid for the article. Some cover the whole front—in that case they would be nine or ten inches long, or even longer, while others are somewhat narrow, extending from front to back; others again have long hair at the sides (only a small portion it is true); but “circumstances alter cases,” and the requirements of customers have to be considered. But the most elegant, vapoury, and artistic “fringes” are, par excellence, those which come under the designation of “water waves,” so-called, I presume, because water plays an important part in their manufacture. M. Eugene Ménard delivered a very instructive lecture on this subject at the Académie Internationale de Coiffure, in 1884, and perhaps I cannot do better than quote a portion of it. He said, “Any quality of hair, curled or straight, fine or coarse, can be made into water waves, with more or less trouble; but it is certain that fine natural curly hair is the best for that purpose. In default of this hair, which is now very scarce, I should suggest what we call, in French, ‘Croquignoles.’ This will be found a capital substitute. The next after this, is what is termed in this country, ‘tight curl,’ and so on, but taking coarse and straight hair for the last, as they never will keep waved. In every instance the hair to be used for water waves, must be well tapered, and as much as possible of a 103pliable nature. As to blocks, those of porcelain or cardboard, covered with prepared calf’s skin or vellum, will be found the most handy and useful for the purpose. Some, I am aware, make use of plain sheet-iron or glass, and yet, after having spent much time over it, they are disappointed at not getting a better result. Why? Because it stands to reason that water waves made in that way, when placed on the head, will not fit any better than the sheet-glass itself, the waves being bound to take the exact shape of that upon which they are made. Therefore, this method will never do, and the idea must be rejected. Others make use of wooden blocks; certainly, when these are new they are quite as good as porcelain, but after they have been put into the oven two or three times—for water waves require to be thoroughly well dried—these blocks become rough and cracked, and consequently, quite useless for that kind of work. Some might, perhaps, object to have the water waves dried in the oven, and would prefer the front of the fire only; if so, my answer would be this: The wood block merely put to the front of the fire might bear the heat once or twice more before being spoilt, but the water waves dried in like manner, would assuredly never last half the time they would if dried in the oven. Experience shows that the oven is the only recipient in which damp hair can be thoroughly well dried, i.e., that the water waves will last with a natural waving appearance. 104“Taking for granted that porcelain and cardboard blocks never crack nor become rough by a temperate heat, I will now demonstrate the second great advantage of these two blocks. “Firstly, I shall deal with the porcelain block, which will be found very suitable for making smooth and perfect water waves, any kind of mounted postiche, such as fringes, partings, fronts, scalpettes, etc. Here, I dare say, an apparent difficulty will be found, as neither pins nor points can be driven into porcelain. Therefore, in order to avoid it, I should advise that the block be perforated in four or six different parts, according to the shape of the mounted postiche to be dressed, and then to fill the holes with a piece of best quality cork, into which to drive pins and to fix therewith any piece of mounted postiche. By so doing the apparent difficulty will be very easily and simply overcome. For instance, place first on the block the scalpette, front, parting, or fringe, in the same way as it is to be placed on the lady’s head by whom it is to be worn, and fix it with four or six pins; next, wet the hair right through, and then when thoroughly saturated with water or spirits of wine, brush or comb it down quite flat on the block, and proceed thus: Maintain the mounting or the last wave made, with the medium finger, lift up gently the hair with the thumb of the same hand, and with the comb in the other hand, wet again to the utmost and make the wave, between the two said fingers, according to your 105wish of the way required. When two or more waves are made, keep the annular finger on the penultimate made wave and support the mounting with the little finger, till you get to the end. Then wet with moderation in upholding the waves, and lift them up again. If necessary, cover the dressed piece of postiche with fine muslin or net, so as to see whether the waves are in or out of order; put it into the oven, which must be as hot as the hair can bear without being injured; take it off when thoroughly dried; let it get quite cold; pass the comb through the waves, flatten them with the hand, and then you will get waves as smooth and as natural as can be imagined. I dare say these water waves would cause many an experienced eye to be perplexed in the event of being called upon to make a distinction between them and natural ones. Never divide the hair when the divided parts are intended to make but one wave; at least, do not let it dry in that state, or else the hair will never join together, and the waves—if not entirely disfigured—will be, at least, awry or crooked. On the contrary, wave the whole of the hair at once, even if it is a scalpette—I mean if it is only one wave all round, it is not more difficult, and the waves will be regular. When the hair, however, is over ten or twelve inches long, the first two or three rows of waves might be made separately, but then they must be joined together before proceeding any farther. Another thing to be observed in making water 106waves is, that they be perfect before drying. When the porcelain block becomes dirty, wash it with soap or soda. “I shall now proceed with covered cardboard blocks. Vellum or prepared calf’s skin, as suggested, is, for the subject I am treating, best adapted to cover cardboard blocks with. These blocks will be found useful for almost any kind of postiche to be dressed in fantaisie water waves, more especially for light pieces, such as curls on pins, marteaux for crown chignons, flat twists, false nuques relevées, transformations, loose or unmounted hair, as used by M. Auguste Petit, of Paris, for his well-known “Universal Postiche,” etc. The way of proceeding for this kind of water waves is quite different to the former. It will take more time to get the waves made, as it necessitates two distinct preparations. On the first one—although it is very easy to make—will depend the success of the second; and on this second preparation, which requires some little taste to make properly, will depend the success of the waves, whose beauty is to get them methodically hollow. To proceed: Take the marteau or any other mounted or unmounted piece of hair—if mounted, the mounting must be straight and not exceeding two inches wide, so as to get the waves perfect from beginning to end—saturate it well, and pin it on the block, then comb it straight, hold it flat between the index and the medium fingers of both hands, and start, either side, by 107making a kind of zigzag in the same way as you would make waves with curls, varying from one to two inches and a-half wide, according to thickness and size of waves wanted. These zigzags must be very regularly made, and great care taken in order to always have the hair perfectly straight, or in other words, to prevent the underneath hair coming over, and vice versa. Starting from the right side, pull the whole of the piece of hair with the two above-mentioned fingers of the hand; keep the piece of hair loose, and close to the block, between the two same fingers of the left hand, just in the middle of the zigzag; leave off, first, the medium finger of the right hand, elevate it a little, weigh gently on the hair with the index, take this finger off, fix the part made of the zigzag with a pin; proceed in the same manner with the left hand, and go on alternately till you get at the end of the piece of hair to be waved. Curl the extreme point of the hair if thought necessary. Then put it into the oven and let it well dry. Here ends the first preparation. “Now for the second. When the zigzag piece of hair is quite cold, take off the pins that served to fix it on the block, pass the comb through, friz it underneath, if necessary, place and fix it again on the block, but dry this time, tap slightly over it, fix another pin at each extremity of the intended waves, attach a thin thread or cotton to the first pin, pass that cotton or thread pretty tightly over the zigzag—which will now soon be 108a wave,—widen this in forming the hollow by the help of the fine teeth of a dressing comb, tighten the thread, stop it at the pin opposite the one from which the thread comes, and so on till the last wave is made. Then damp the dressed piece of postiche, put it once more into the oven; let it thoroughly well dry; and when quite cold, take off pins and filament, and you will get some splendid water waves ready to wear. When pins driven into the skin-covering of the block leave a kind of rough bump caused by the heat, pass over it the pressing iron, and it will become flat and smooth again. Now, concerning the liquid to be used—I am of opinion that warm water, previously boiled with a very little soda in it, is the very best component to wet the hair with for water waves; boiling water and soda, or potash if preferred, having both the property of softening the hair; but, of course, this is only recommended for dark colours. For light ones, suppress the soda, and for grey or white hair, let the boiling water get quite cold, and add to it a very little of Reckitt’s blue, so as to prevent the hair from turning of a yellowish tint. To dry this hair it will be also very prudent to cover it with light blue tissue paper. Spirits of wine is also a very good liquid to make use of for water waves; it does not soften the hair so much as the above-stated, but on the other hand, it causes the waves made with it to last much longer. To make use of it, like water, a great quantity is required, more especially when waves 109are to be made on a porcelain block; therefore, unless a great number of waves are made with it, it would cost very often more than the piece of postiche itself. It is more adapted for hair merchants or coiffeurs posticheurs. Great care must be taken in using spirits of wine, chiefly when postiche dressed with it is drying at the front of the fire. The slightest spark would be enough to spoil it. Scalpettes and fringes, as I have before indicated, admit of great variety. Indeed, both in make and style of dressing, there is ample scope for the coiffeur to exhibit his skill, and those scalpettes of a fanciful and gossamer-like character are remarkable for taste and ingenuity. To make one as indicated above, with which long straight hair is associated, take ten, twelve or more inches of galloon (according to the size decided upon), double it together, and sew firmly at the ends, leaving, say, a quarter of an inch free. Find the centre of the galloon, tack it by means of “points” to the forehead portion of a clean 110wig-block, and affix the ends in a similar way; your object being to make a “mount” about three inches deep in the centre, four, five, or six inches long, and tapering off at the sides. The galloon ends, of which I spoke just now, must be at the top, so that when taken off the block only a fine seam is noticeable. Having attended to this, the mount has to be “basted” and formed. The one I am describing is of a diamond shape, and the basting stitches are to be at the bottom, top, and sides. Drive a point into the centre of the block an inch and a half below where you purpose the lower part of the mount to be. Use stout cotton, single, tie a knot at the end of it, and attach to the “point”; take a firm stitch through the galloon and draw it gently down into position. Twist the cotton round and round the “point,” finishing with a loop made with the finger; then take one or more similar stitches upon each side terminating in a like way. Give the “point” a tap or two with the hammer, bend it down, and knock the head of it into the block. Proceed with the top in a like fashion, and then the ends, or sides. You have now made a step towards “mounting,” and that which I have described is not by any means difficult of execution. It must be borne in mind that I am not addressing myself to novices, but to young men who, at all events, have some knowledge 111of the trade, and I presume they will not experience much trouble in getting a practical illustration from a friend should they require it. To proceed; take the block in your lap, and commence sewing on the net. Begin on the right-hand side of the inside edge of the bottom galloon, the stitches being moderately close together. Having reached the left-hand corner, turn the block round, and commence sewing in the same manner to the inside edge of the top piece of galloon. While all this is being done pull the net tight, keep it smooth and avoid “puckering,” cut away the superfluous net, but—and this is important—the edge of the net which is stitched to the mount ought to well cover two-thirds of the galloon. Now you have both galloon and net upon the block, and the work ought to be strong and secure. A spring, rubbed or filed down, and covered as before described, is to be placed in the centre; but it must not overlap the mount, either at top or bottom. About half an ounce of short, curled hair (or less, according to the size of the mount) and an equal quantity of sixteen or eighteen inch straight hair will, perhaps, be sufficient; but more can be added if desired. The hair has to be made up into rather fine front-weft or “twice-in.” The straight hair weft should also be fine, and equally divided; but the curled hair can be left all in one piece. Sew the straight hair on to the 112sides first; begin at the point (or end of the mount), and let the rows of weft be firm, regular, and at equal distances from each other. I need scarcely say that the straight hair has to be incorporated with the wearer’s own hair when it is dressed, and then two or three hair-pins will keep the “fringe” in place. That portion of the mount to be covered with straight hair will depend upon circumstances, of which you must be the judge. The curled hair has now to be sewn to the mount. “Fasten on securely,” as seamstresses would say, and sew along the bottom of the galloon, from right to left, taking about one stitch to every weft. Turn the block, and sew another row along the upper part of the galloon, being careful to cover the free edge of the net, which thus becomes stitched a second time by this operation. The rows of weft are sewn in a like manner until the mount is covered. When turning the weft see that it is done neatly where it joins the straight hair, so that no irregularity or ugly spaces are visible. The weft has now to be pressed (for which a special tool called a “pressing-iron” is used), and the hair properly arranged. Cut the basting stitches, pull them out from the mount, and examine your work. If the stitches are very small, the weft even, the mount a good shape, and the work unmistakably firm and secure, I should pronounce it to be satisfactory; but if there be imperfections in any of these respects, 113then follow the best advice it is possible to give, and, “Try, try, try again.” This design shows a scalpette, intended to cover the top of the head, and, when it is worn, the straight hair should be tied, or twisted in with the natural hair at the back. A covering of this description is very useful when a bald place exists, or there is a thinness of the natural growth of the hair. In making it, the following instructions should be observed: Upon a clean block, mark with a black lead pencil (in its proper position) the form and size of the mount wanted. Take a piece of galloon and commence by driving a point or two through it, somewhere about the temple. Keep it firm by means of points, as you proceed along the pencilled lines, until both ends of the galloon meet. Cut off, but leave sufficient length to take hold of 114with the thumb and finger. Pinch together, and with needle and silk sew tight and close, leaving short ends as before. I will suppose that you intend to put on a mount four inches deep, and five inches wide, in shape nearly square, the front (or lower galloon) being drawn down a little. You will have to put basting stitches at the four corners, and also in the centre to make it the desired form. Sew on a piece of galloon extending from left to right, an inch and a-half from the top, one spring in the middle, and others if necessary to keep the corners out. Cover with net, and the mount is complete. You now have an inch and a-half space for the back hair and two and a-half inches space for the front, the joinings taking place upon the piece of galloon affixed for the purpose. Sew on the straight hair first, and then the curled, observing the directions before given. About half an ounce of short curled hair will be sufficient for the one part, and three-quarters of an ounce of sixteen or eighteen-inch hair for the other. Fine weft; press, finish off, and a reference to the illustration[11] will show its arrangement. A great many articles of this description are “knotted” instead of being woven, and it is simply mentioned here to enable me to say that I shall deal with that part of the subject by-and-bye. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2787/77192.html","bookId":1305,"book":{"id":1305,"title":"Board-Work","description":"简介： The following work, which is the result of much anxious study and labour, is designed to meet a long-felt want. It is intended chiefly for the use of apprentices, improvers, and others in the trade whose knowledge of board-work is deficient. The Auth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2787","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
