{"id":84529,"no":15,"title":"Page 15","content":"And those plump red lips are moving against Drew’s mouth. Good kissers, really good kissers, don’t just use their lips. They utilize their entire body—their tongue, their hands, their hips. Drew is a good kisser. But I’ve never had the chance to observe him in action. I’ve never seen him kiss anyone. Because I’ve always been on the receiving end. The kissee. But that’s not the case now. I stand there—stunned. Watching. And though it’s only for a few seconds, it feels like forever. Like an eternity. In hell. Then Drew pulls back. And almost as if he knew I was here all along, his eyes find mine immediately. They’re hard. Merciless. And his voice is as cold as the steel of an outdoor gate in a snowstorm. “Look who’s home.” Lots of women imagine how they would react if they caught their boyfriend or husband cheating. What they would say. how strong they’d be. Righteous and indignant. But when it’s for real? When it’s not just pretend predictions? Those emotions are peculiarly absent. I’m numb inside. Dead. And my voice is nothing more than a whispered stutter. “What . . . what are you doing?” Drew shrugs. “Just having a little fun. I figured, why should you be the only one who gets to?” I hear the words, but I don’t understand them. My eyes squint and my head tilts, like a bewildered dog. Drew steps away from the redhead and takes a swig from the bottle. he flinches as he swallows. “You look confused, Kate. I’ll explain. The first rule of lying is always get the alibi straight. See—right now, Matthew and Dolores are on a plane to Vegas. Matthew’s been planning the trip for weeks—a surprise second honeymoon. So I knew you were full of shit this afternoon. I just needed to see if you’d actually go through with it. So I followed you. Gotta love the GPS.” Last year, a woman named Kasey Dunkin disappeared after a night out with friends in the city. It was all over the news. The police were able to trace her cell to an abandoned warehouse in Brooklyn, and even though she’d been stabbed multiple times, she survived. Drew and I had the same kind of program installed on our phones the next day. “You followed me?” he followed me to Bob’s office. he knows where I went. Does that mean . . . “Yep. I know where you were. I know everything. I f**king saw you.” he knows. . . . Drew knows I’m pregnant. And obviously he’s not pleased. My voice rises as I speak, gaining momentum. “You know?” I point at the woman who’s watching us like we’re her own personal soap opera. “And this is how you react?” Drew looks confused. “Do you frigging even know me at all? how the f**k did you think I’d react?” I’ve seen Drew annoyed before. Thoughtless. Frustrated. But this is different. This is . . . cruel. he asks me, “You’re not even gonna try and deny it? Make me think I’m delusional?” For a moment his face crumples. And he looks . . . anguished—like a torture victim about to break his silence. “Aren’t you going to tell me I’m wrong, Kate?” he blinks and the anguished look is gone. And I’m pretty sure I just imagined it. Wishful thinking. I fold my arms across my chest. “I won’t discuss this with you in front of an audience.” Drew’s jaw locks stubbornly. “Are you going to end it?” My feet move back away from him, all on their own. And my hand drops protectively to my abdomen. “What?” he repeats himself, impatient with my shock. “I said—are you going to f**king end it?” Politically, Drew is pro-choice. Despite his Catholic upbringing, he respects and loves the women in his family far too much to let some old man on Capitol hill dictate what they can or can’t do with their bodies. But emotionally—morally—I’ve always thought he was prolife. So the fact that he’s standing here telling me to abort a child, our child, is just . . . incomprehensible. “I haven’t . . . I haven’t had time to think about it.” he laughs bitterly. “Well, you better start thinking, because until your little indiscretion is out of the picture? I don’t even want to f**king look at you—let alone discuss anything.” his words hit me like a gust of wind on a cold day. The kind that leaves you breathless. Drew isn’t Joey Martino. he’s worse. Because he wants me to choose. An ultimatum. Like he did with Billy. And what the hell is he talking about— my indiscretion? Like I made it happen all by myself? And then it sinks in—his anger. his vindictiveness. It starts to make sense. “Do you think I planned this? That I did it on purpose?” he smirks, and even a deaf person would be able to hear the sarcasm. “No—of course not. These things just happen sometimes, right? Even when you don’t mean them to.” I open my mouth to argue, to explain, but the stripper’s giggle cuts me off. I glare at her. “Get out of my house before I put you out with the rest of the trash.” In situations like this? Women can cut each other down faster than a tree dealer on Christmas Eve. But it’s not because we’re petty. Or catty. It’s because it’s easier to go after a nameless woman than to admit that the true fault lies with the man who was supposed to love you. Who was supposed to be committed. Faithful. And wasn’t. She says, “Sorry, honey, you’re not paying for this show. I go where the money man tells me.” Drew loops an arm around her waist and smiles proudly. “She’s not going anywhere. We’re just getting started.” I find the strength to raise a brow. And try to land a shot of my own. “Paying for it now, Drew? Isn’t that pathetic.” he smirks. “Don’t kid yourself, sweetheart—I’ve been paying for it for the last two years too. You’ve just been slightly more expensive than the average whore.” I should have known better. Arguing with Drew is like dealing with a terrorist. he has no boundaries; nothing’s off limits. There are no depths he won’t sink to to win. Then he looks thoughtful. “Although I must say, despite how everything’s turned out, you were money well spent. Especially that night, against the kitchen sink”—he winks—“worth every penny.”","sourceLink":"https://allnovel.net/twisted-tangled-2/page-15.html","bookId":1814,"book":{"id":1814,"title":"Twisted (Tangled #2)","description":"Storyline: There are two kinds of people in the world. The ones who look first, and the ones who leap. I’ve always been more of a looker. Cautious. A planner. That changed after I met Drew Evans. He was so persistent. So sure of himself – and of me. But not all love stories end happily ever after. Did you think Drew and I were going to ride off into the sunset? Join the club. Now I have to make a choice, the most important of my life. Drew already made his –in fact, he tried to decide for the both of us. But you know that’s just not my style. So I came back to Greenville. Alone. Well, sort of alone.... What I\u0027ve come to realize is that old habits die hard and sometimes you have to go back to where you began, before you can move ahead. TWISTED picks up two years after Tangled’s end, and is told from Kate’s POV.","cover":"https://allnovel.net/images/twisted-tangled-2.jpg","author":"Emma Chase","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-tangled-2.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 4:59:30 PM"}}
