{"id":84562,"no":48,"title":"Page 48","content":"I can’t take my eyes off her. She’s adorably round. Like one of those Weeble Wobbles I played with as a kid. She plops down on the couch next to me and puts her swollen Fred Flintstone–like feet on the coffee table. “I’m so huge.” I smile and put my hand on her firm mound, rubbing it like a bald head for good luck. Knowing there’s a real live baby in there, seeing him or her move beneath Kate’s skin, is pretty frigging amazing. When there’s a Yankee game on, I talk to it—give him a playby-play, like a seeing-eye sportscaster. And at night, when Kate is asleep, I balance the TV remote on her stomach just to watch the baby kick it off from the inside. Cool, right? In a weird Aliens kind of way, but still cool. “You really are huge,” I say. “I think you’ve doubled in size since breakfast.” The whole room goes eerily silent. And Kate stares at my hand a second too long. “Excuse me . . . I have to . . . go . . .” She stands up and shuffles as quickly as she can down the hall. Probably going to piss—she does that a lot lately. Then Delores slaps me. Smack. In the f**king ear. “Ow!” I rub my stinging lobe. Shamu lets out an exasperated sigh. “Could you give him one from me, Delores? I don’t think I can get up.” Smack. “Jesus! What the f**k?” Alexandra’s all over me. “What are you thinking? You don’t tell a woman who’s three days from her due date that she’s huge!” “I didn’t. She said it. I just agreed with her.” “Delores.” Smack. “Christ Almighty!” If the ear-ringing is any indication, there’s an excellent chance I’ve just gone deaf. “Kate knows I didn’t mean it like that.” Delores crosses her arms smugly. “Sure she does, Dipshit. That’s why she’s in the bathroom crying her eyes out right now.” I swallow hard and look down the hall. It’s possible that Delores is just screwing with me. It’s her favorite pastime these days, making me feel guilty for all the shit that Kate has already forgiven me for. Delores Warren is the Mickey Mantle of grudge holding. Alexandra pulls herself from the couch. “And on that note— roll me home, Steven. As fun as it is to watch my little brother grovel, I’m too tired to really enjoy it at the moment.” Delores and Matthew get up to go too, so the four of them can share a cab. Though I really don’t know how that’s going to work— Alexandra’s gonna need the entire backseat for herself. I’ll keep that little observation to myself, however. Besides, I have more important matters to deal with. Like finding my girlfriend. I knock softly at the bathroom door. “Kate?” There’s shuffling behind the door. “I’ll be right out.” Shit. her voice is stuffy. Wet. Delores wasn’t screwing with me. I reach up and grab the key from its spot on top of the molding. I unlock the door and open it slowly, and there she is. Standing in front of the mirror, with tear tracks staining her cheeks. Kate turns to look at me and hiccups. her tone is pitiful. Sad. “I don’t want to be fat.” She covers her face with her hands and sobs into them. I try to hold in the laugh. Really. But she looks so cute and miserable, I don’t quite pull it off. I wrap my arms around her from behind. “You’re not fat, Kate.” her voice is muffled by her hands. “Yes, I am. I couldn’t put my shoes on yesterday. Dee Dee had to help me because I couldn’t reach.” This time I can’t help laughing out loud. I rest my chin on her shoulder and pull her hands down from her face. Our eyes meet in the mirror. “You’re pregnant—not fat.” I think for a moment and then add matter-of-factly, “Alexandra’s fat.” her damp eyes squint. “She’s pregnant.” “Not in her thighs.” Kate shakes her head. “You’re so mean.” “I’m not trying to be. I’m just trying to point out the fact that you’re gorgeous.” I rub my hands up and down her narrow hips. “Sexy as hell.” And I’m not bullshitting her. The midsection might be at maximum capacity, but her legs are slim. Toned. And she’s still sporting the sweetest, tightest ass this side of the hudson River. Sure, she’s hormonal and irrational half the time—but the other half of the time, she’s horny. hornier then I’ve ever seen her. Plus—there’s the boobs. Can’t forget them. They’re almost as big as her head. So much fun. Not that there’s anything wrong with Kate’s everyday br**sts— but pregnancy tits are like India. You don’t have to stay forever, but it sure is exciting to visit. Kate doubts my sincerity. “Sexy? Please. Don’t blow smoke up my ass, Drew.” I smirk. “Trust me sweetheart—if I’m thinking about slipping something up your ass? It’s not gonna be smoke.” She turns in my arms, unconvinced. “how could you ever think this”—she points to her body—“is sexy?” I hesitate. And rub the back of my neck. “It might make you mad.” “Risk it.” I shrug. “Well . . . I did this to you.” A fact I’m sure she won’t let me forget, once we’re in the delivery room. “I made you like this—left my mark. That’s my kid you’re incubating. It’s like a big neon sign that says PROPERTY OF DREW EVANS. Call me a caveman, but that’s a major frigging turn on for me.” She’s quiet for a minute, then looks down at our joined hands. “What if I can’t lose the weight after the baby’s born?” “You will.” “But what if I don’t?” I shrug again. “Then I’ll become a chubby chaser. A little extra cushion for the pushin’ isn’t a bad thing.” She rolls her eyes, but then she laughs. I cup her face with both hands and bring her lips to mine. The kiss starts off sweet and tender. And then it’s . . . not. her teeth nip at my lips. hard and urgent. Begging for more. And my legs tremble with the need to please her. It still amazes me—the power she has. This tiny woman can bring me to my knees with a look . . . a sigh. But I wouldn’t have it any other way. I’ve been to the other side. I’ve seen what freedom has to offer.","sourceLink":"https://allnovel.net/twisted-tangled-2/page-48.html","bookId":1814,"book":{"id":1814,"title":"Twisted (Tangled #2)","description":"Storyline: There are two kinds of people in the world. The ones who look first, and the ones who leap. I’ve always been more of a looker. Cautious. A planner. That changed after I met Drew Evans. He was so persistent. So sure of himself – and of me. But not all love stories end happily ever after. Did you think Drew and I were going to ride off into the sunset? Join the club. Now I have to make a choice, the most important of my life. Drew already made his –in fact, he tried to decide for the both of us. But you know that’s just not my style. So I came back to Greenville. Alone. Well, sort of alone.... What I\u0027ve come to realize is that old habits die hard and sometimes you have to go back to where you began, before you can move ahead. TWISTED picks up two years after Tangled’s end, and is told from Kate’s POV.","cover":"https://allnovel.net/images/twisted-tangled-2.jpg","author":"Emma Chase","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-tangled-2.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 4:59:30 PM"}}
