{"id":62833,"no":28,"title":"Page 28","content":"Ilysa\u0027s heart lifted when she saw Connor at the head of the line of men climbing the steps hewn into the side of the cliff from the beach.\n \"Praise God, he is alive and well!\" she said and turned to smile at Lachlan, who had come with her to the gate to meet the returning warriors.\n \"Two of the men are missing,\" Lachlan said, \"but that\u0027s better than I feared.\"\n Connor walked through the gate, his gaze straight ahead, as if in a daze. He ignored all the people who ran up to him asking questions.\n \"See to the injured,\" he said, the only sign that he saw Ilysa as he passed her.\n Her stomach tightened. Whatever had happened must have been bad indeed.\n Lachlan helped her herd the injured into the hall. As she checked wounds and applied fresh bandages, she heard snatches of conversation about the confrontation with Hugh\u0027s men.\n We were surrounded...The chieftain must have killed half a dozen himself...No, it was eight, I\u0027m sure...I was injured and wouldn\u0027t have made it to the boat, but he carried me across his shoulders...He came back for me as well.\n Ilysa\u0027s heart swelled at hearing the men speak with such pride about their chieftain. Although Connor had not succeeded in capturing Hugh, he had won the undying loyalty of these men. Yet a skirmish with Hugh\u0027s men did not explain the look on Connor\u0027s face as he walked past her. He was a hardened warrior.\n \"What else happened?\" she asked.\n The men went silent, and none would meet her eyes. Whatever it was, they did not wish to speak of it, at least not with her.\n That evening, Cook worked his magic to make a feast from their meager stores to welcome the returning warriors. When Connor came down for supper, he acted more himself, but Ilysa sensed the anguish behind his mask. He glanced down the table to where she sat next to Lachlan once and did not look again. After the meal, he stood with the men while they again recounted tales of his bravery, but she could tell he was not listening to a word.\n Connor took another long drink of his whiskey, then rested his head in his hands. The evening had been interminable. Finally, he was alone in his chamber where he did not have to pretend that the chieftain had the situation well in hand and that the clan would overcome this last round of trouble and triumph over their enemies.\n He cringed when he heard the knock on the door. He could not face one more person congratulating him on his exploits after he had failed so utterly and miserably to protect his people.\n The knocking persisted. Finally, he dragged himself to his feet and went to the door. When he opened it, he leaned against the door frame to block his visitor from entering. If that was not sufficient discouragement, he\u0027d repel whoever it was down the stairs.\n The one person he could be happy to see stood in his doorway like a gift.\n \"Ilysa.\"\n \"Let me come in,\" she said.\n Without waiting for an answer, she ducked under his outstretched arm. She sat at the table and folded her hands in her lap, looking prim and determined. There was no use attempting to kick her out, and he did not want to anyway.\n When he sat in his chair beside her, she pinched her brows together and swept her gaze over him, the jug of whiskey, and the empty cup. That served to remind him that he wanted another, so he poured it and drank it down.\n \"Tell me about it,\" she said, and when he glanced sideways at her, she was looking at him with her big, doe eyes.\n \"No.\" He could not burden her with this.\n Ilysa ignored the rebuff and touched his face, a gesture of kindness all the more compelling after the vileness of the last two days.\n \"I\u0027m worried.\" She pushed her chair back and stood next to him. Before he knew what she meant to do, she pulled his head against her chest and wrapped her arms around him. Ilysa had seen his despair. It touched his wounded soul.\n He could not trust himself with her. He needed her arms around him too badly.\n \"You should go now,\" he said and firmly pushed her away.\n She kept a hand on his shoulder and gave him a soft smile that pierced his heart. When she brushed his hair back with her fingers, his eyes closed. He felt her breath and then her soft lips on his forehead.\n \"I want to comfort you,\" she said.\n \"I want a hell of a lot more than comfort from ye.\" He gave her the truth in a hard voice to frighten her off.\n He wanted to lose himself in her arms, to make love to her until he stopped seeing the horrors of the last days in his mind\u0027s eye - the dead girl draped in her father\u0027s arms, the smell of burned cottages, the vacant stares of the children he had been powerless to protect.\n \"I know,\" she said. \"That\u0027s why I\u0027m here.\"\n He wanted her so much it hurt. Nay, he needed her tonight. There were a dozen reasons not to take her to bed, but he didn\u0027t give a damn about any of them. Ilysa wanted him, and that was all the reason he needed.\n Ilysa swallowed at the naked hunger in Connor\u0027s eyes. She had started this, and she was not going to lose her courage now. When she reached back to untie her breid, the cloth tied over her hair, he stopped her.\n \"Let me.\"\n When he stood, he towered over her. She fixed her gaze on the vee of his shirt as he untied the knot at the back of her neck, lifted the breid off her head, and drew her braid over her shoulder.\n \"Ye look so pretty,\" he said as he cupped her face between his hands. \"This time, we\u0027ll go slowly - and we will most definitely be naked.\"\n Naked? Ilysa\u0027s breathing grew shallow as he kissed her cheeks, her nose, the point of her chin, and the sensitive spot beneath her ear.\n Connor released her and said, \"I\u0027ll bar the door.\"\n He pulled his shirt over his head and tossed it into a chair as he walked across the room, at ease in his body and unconscious of his beauty. And Connor MacDonald was beautiful. Ilysa\u0027s head felt light as her gaze traveled the lines of his broad, muscular back and down to his narrow waist. The muscles of his buttocks and long legs flexed beneath his trews as he moved with the sure grace of a warrior.\n When he came back toward her, Ilysa\u0027s body prickled with awareness and her chest felt too tight. Without taking his gaze from her face, Connor stripped off his trews - and Ilysa stopped breathing altogether. Her brief look at him naked when she had barged in on him that first day after his bath had been wholly inadequate.\n When she dropped her gaze lower, her mouth fell open. His staff was standing straight up, and it was far bigger than she expected. She had not seen it the first time. Though she had not ever gotten much of a look at her husband\u0027s, either, she was certain it had never been like this.\n After realizing she was gaping, she dragged her gaze to his face. O shluagh! The heat in his eyes singed her skin and made her pulse leap wildly. Everything about the intimidating warrior before her was overpowering - his nakedness, his wolf-hungry eyes, his erect shaft. She had to remind herself that this was Connor, and she could trust him.\n She did trust him. More than that, she loved him.\n When he pulled into her arms and kissed her, she soon forgot her nervousness. For such a hard-muscled man, his lips were soft and pliable. While he deepened the kiss, he ran his hand from her hip up to the side of her breast. Her head spun as their tongues entwined. All the while, she was excruciatingly aware of his shaft pressing against her stomach through the layers of her skirts.\n She felt the tension of his taut muscles beneath her fingers as his kisses grew more urgent. Connor groaned into her mouth as his hand covered her breast. When he rubbed his thumb across her nipple through her gown, sharp sparks of pleasure shot through her, and she had to break the kiss to gasp for air.\n Connor moved to her neck, giving her a sucking kiss that pulled sensations all the way from her toes. Then he grew gentle again, and she sighed as he ran his tongue along the skin above her bodice.\n When he pulled back, his black hair fell over his eyes, making him look dangerously handsome. \"Let\u0027s take your gown off and get into bed.\"\n A squeak of assent was all she could manage.\n Connor\u0027s hand shook as he slowly pulled at the loose end of the bow at the top of her bodice. She watched the rise and fall of his chest as he unfastened the laces that held the front of her gown together, revealing her chemise beneath it. Then he pulled her against him and kissed her until she could not think at all. One hand supported her back, while the other was inside her bodice kneading her breast. When he found her nipple again, he sent shivers of pleasure spiraling through her body until she was breathless. And far too warm.\n Once he took his hand from her breast, he was remarkably quick at removing her gown. Ilysa was uneasy, but at least she still had her chemise on. She crawled into the bed and pulled the bedclothes up to her chin. When Connor got in, the mattress sank under his weight. She had to brace herself to keep from rolling into him as he stretched out beside her.\n The tension between them jangled her nerves as they lay face-to-face across the pillow. Connor\u0027s eyes, which sometimes looked gray, were steely-blue now, and his jaw was dark with the day\u0027s beard. He lay still as a wildcat watching its prey.\n \"What\u0027s wrong?\" she asked when he made no move to touch her.\n \"I\u0027m waiting for ye to stop being afraid of me.\"\n \"I\u0027m a bit nervous is all.\" It was ridiculous since they had done this before. But as he said, this time was different.\n \"Have ye changed your mind?\"\n \"No!\" she said quickly, and his white teeth gleamed in a sudden smile.\n \"I can understand if you\u0027re frightened after last time,\" he said. \"I hadn\u0027t had a woman in a very long time, and I didn\u0027t know that...Well, I regret I was too rough and rushed.\"\n \"No, ye weren\u0027t.\" She shook her head against the pillow, wanting to reassure him. \"It was...quite exciting.\"\n \"Ahh, Ilysa,\" he said on an exhale, and his eyes held that darkness again that robbed her of air.\n She dropped her gaze to his chest, taking in the well-defined muscles, the dark curly hair, the arrow wound that had finally healed, and the white lines of old injuries. Of its own accord, her hand went to the long gash that ran across his ribs on his left side.\n \"You have so many scars,\" she said as she traced it with her finger. \"I remember this one from the MacKinnon attack.\"\n \"I don\u0027t notice them.\" He enfolded her hand and brought it to his mouth. His breath was warm on her fingers. \"Do they bother ye?\"\n \"It pains me to know how many times people have tried to kill ye.\" She withdrew her hand from his to brush her fingers through the hair at his temple. \"But each scar reminds me of how very precious your life is.\"\n \"The last two days have reminded me how quickly life can be cut short,\" he said, and his eyes clouded.\n Ilysa feared she was losing him to the darkness that had engulfed him earlier and rested her hand against his cheek to draw his attention. The scratch of his whiskers felt good against her palm.\n \"Save your worries for tomorrow. Tonight, it\u0027s just you and me.\" She leaned across the pillow. \"Forget everything else and kiss me.\"\n Connor gathered her into his arms and gave her a long, melting kiss that made her toes curl. His hands roamed her body, slowly and deliberately, sending waves of heat everywhere he touched. She wanted to touch him, too, but she did not know where or how she ought to do it. Last time, she was caught in a maelstrom before she had time to fret about being so ignorant. But now, she did not know what she was supposed to do.\n As his kisses grew more fervent, she forgot her worries and let her hands go where they would. She ran them through his hair, letting the dark strands slide through her fingers, then traced the muscles of his shoulders and back.\n Connor\u0027s breathing grew harsher, and he rolled her onto her back. He was all heat and passion, and she lost herself in the feel of his body pressed against hers. How had she lived without his touch? He kissed her throat, and then she felt his breath through her chemise as he moved down her breastbone.\n It startled her when she felt the moist heat of his mouth on her breast through the cloth. Needles of pleasure shot to her womb as he suckled her breast. Unexpected little moans came from her mouth, and she had a fleeting concern that he would wonder what was wrong with her.\n \"I love the sounds ye make,\" he said, looking up at her with such heat in his eyes that she knew he was not just saying it.\n After a time, she felt cold air on her thigh. She was in such a daze that it took her a moment to realize Connor was pulling her chemise up.\n \"What are ye doing?\" She tried to sit up, but he was in her way.\n \"I\u0027m desperate to feel your skin against mine,\" he said. \"I sorely regret leaving your clothes on ye last time.\"\n Ilysa swallowed. She had never been completely naked in front of a man before. Was this necessary? From the determined way Connor was tugging at her chemise, it appeared he thought it was.\n \"Lift up for me,\" he said.\n \"I fear you\u0027ll be disappointed,\" she said.\n \"I won\u0027t.\"\n He said it so firmly that she gave in to the inevitable and lifted her hips. Leaving her chemise gathered around her middle, he pulled her up to a sitting position and kissed her long and hard until she forgot her awkwardness. As he kissed the side of her neck, his hand moved up her back under her chemise. The scratch of the calluses and the strength of his hand felt good.\n She was beginning to understand why he wanted to be skin-to-skin with nothing between them. When he broke the kiss to lift her chemise over her head, she raised her arms for him. He immediately enfolded her in an embrace again, and she squeezed her eyes shut against the rush of desire that radiated through her as his chest pressed against her sensitive breasts.\n She kept her eyes closed as he laid her down. When she finally opened them, it was to find him staring down at her. She instinctively brought her hands up to cover her breasts, but he caught her wrists and pressed them against the mattress.\n \"Don\u0027t. I want to see you.\"\n She held her breath as his gaze burned over her.\n \"You\u0027re more beautiful than I imagined,\" he said, then lifted his gaze to her face. \"And I\u0027ve spent a good deal of time imagining having ye naked in my bed.\"\n She did not know which surprised her more - that he had imagined her naked or that he had called her beautiful. After yearning to have Connor want her like this for so long, it was hard to believe it was truly happening.\n \"I imagined this, too,\" she confessed, which earned her a long, heated kiss. She did not tell him that when she imagined it, she had her chemise on. She had a strong suspicion that was only one of many surprises in store for her tonight. Not that the first time hadn\u0027t been surprising. That had been like being swept into a sudden thunder and lightning storm.\n She swallowed as Connor moved down her body. When he reached her breast, bare to his touch this time, she was aware of nothing else but his tongue as he slowly circled her nipple. Then he flicked it, setting off jolts of desire, before drawing her breast into his mouth. She clenched her fingers in his hair to anchor her against the wild tumult cascading through her.\n When he moved up to take her mouth again, she was acutely aware of his shaft pressing against her hip. Would it fit? It had before, but barely. His hand slid up the inside of her thigh, and her unease gradually melted away. She followed the course of his fingers as they moved in languid loops ever higher up her thigh. Her body was taut with anticipation long before his fingers reached their destination. When he finally did touch the sensitive place between her legs, she nearly rose off the bed.\n Then his tongue was exploring her ear, and she felt as if she were floating. She never would have expected that to feel good. Another surprise.\n \"Ye feel like heaven,\" he said, his breath warm against her ear.\n She thought she should say something back, but for long moments, she could not form words, even in her head. His fingers circled round and round, creating an unbearable tension until she thought she might snap in two. Yet she did not want him to stop.\n \"You have magic in your fingers,\" she finally managed to say.\n When he leaned over her to kiss her, his chest rubbed against her nipples and she drew in a sharp breath. She wrapped her arms around his neck and held him close as their tongues entwined in deep, mindless kisses. All the while, his fingers drove her to near madness.\n \"Closer,\" she said, digging her fingers into his shoulder. Though his body was touching the full length of hers, it wasn\u0027t enough. She wanted to meld into him.\n \"I want ye so much,\" he said in a ragged voice. \"Tell me ye want me, too.\"\n \"I do.\" Always.\n Bracing his weight on his arms, he moved to lie between her legs. She bit her lip when the tip of his shaft touched her center. Connor paused above her, his black hair hanging down, framing his perfect face. Their gazes locked, and she saw the tumult raging inside her reflected in the storm in his eyes.\n The air pushed out of her lungs in an \"ooh\" as he slowly slid inside her. Every part of her body was alert with awareness of his shaft inside her, stretching and filling her.\n \"I don\u0027t know how long a lass might be sore from her first time,\" he said, his breathing hard. \"Am I hurting ye?\"\n \"No.\"\n \"Ye must tell me the truth,\" he said, his eyes searching hers. \"I couldn\u0027t bear to hurt ye again.\"\n \"Ye feel wonderful inside me,\" she said and ran her hands up his chest.\n Connor sucked in his breath when she lifted her hips, drawing him deeper. Then, with slow, deliberate movements, he pulled out nearly all the way and thrust deep inside her, again and again. Ilysa\u0027s skin felt too sensitive, her body too tight. Connor continued moving inside her, slowly and relentlessly, until she vibrated with need. She felt on the verge of something, but she did not know what.\n \"Faster, harder,\" she pleaded.\n Connor made a growling sound deep in his throat. She wrapped her legs around him like a vise and held on as he drove inside her. Through the blood pounding in her ears, she heard him call her name. He was hers. Waves of pleasure swelled and crested, washing over her in a storm of wonder. \n","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-28.html","bookId":2647,"book":{"id":2647,"title":"The Chieftain (Return of the Highlanders #4)","description":"Storyline: \n The Chieftain (Return of the Highlanders #4) \n Four fearless warriors return to the Highlands to claim their lands and legacies. But all their trials on the battlefield can\u0027t prepare them for their greatest challenge yet: winning the hearts of four willful Scottish beauties. \n A Warrior\u0027s Heart \n Connor, chieftain of the MacDonalds of Sleat, holds the fate of his people in his hands. Rival clans are plotting to take over his lands, and duty determines whom he will fight, trust . . . even marry. Seeking guidance, Connor turns to Ilysa, a young lass with the gift of foresight, who reveals an approaching danger-and a passion that burns only for him. But the warrior must make a powerful marriage alliance, and Ilysa\u0027s bloodline is far too humble. \n With her powers to heal and see evil where others cannot, beautiful Ilysa dresses plainly, speaks softly, and loves her chieftain from afar. Yet when Connor finally stokes the embers of desire that have so long burned within her, Ilysa feels bliss unlike any she\u0027s ever known. Now as he is forced to place duty before happiness, Ilysa senses Connor is in grave peril. Can she find a way to prove she is the woman he needs by his side?\n \n","cover":"https://allnovel.net/images/the-chieftain-return-of-the-highlanders-4.jpg","author":"Margaret Mallory","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:48:22 AM"}}
