{"id":62842,"no":37,"title":"Page 37","content":"Greetings and God\u0027s blessing upon you,\" Ilysa formally addressed the MacLeod chieftain. Now that she knew who he was, she was far more curious than fearful. \"What brings ye to the faery glen this night?\" Or any night.\\n\\n \"I remembered that ye collected healing herbs in the glen when the moon was full.\" He lifted his hand toward the moon that shone through the night clouds. \"I took a chance that ye would be here.\"\\n\\n \"But why?\" Ilysa asked. \"Our clans are on the verge of spilling each other\u0027s blood. \u0027Tis dangerous for ye to come to Trotternish alone.\"\\n\\n \"I have fifty warriors within calling distance,\" he said. \"I needed to speak with ye.\"\\n\\n \"Me?\" Ilysa could think of nothing that would bring the great MacLeod chieftain into a faery glen just to see her.\\n\\n \"I believe I know who your father was,\" he said.\\n\\n \"My father?\" This was the last thing she expected to hear. As exhausted as she was, it was one surprise too many. The MacLeod chieftain took her arm to steady her as tiny sparks crossed her vision.\\n\\n \"Come sit with me,\" he said. \"I\u0027ll tell ye a story.\"\\n\\n Ilysa had given up expecting to find out who her father was years ago, yet Alastair MacLeod did not seem the sort of man to make a joke of this. Blindly, she let him lead her to a log, then she sat with a thump as her legs gave way. He sat beside her and put a hand on her shoulder, an unexpectedly kind gesture.\\n\\n \"Do ye know about your mother being stolen away by one of my warriors?\" he asked. \"This would have been a long time before ye were born.\"\\n\\n \"Aye, though I only learned about it a short time ago,\" Ilysa said. \"She returned to our clan with my brother when he was a babe.\"\\n\\n \"I was at our fortress on the isle of Harris and knew nothing of what happened at the time,\" he said. \"In my absence, your mother\u0027s MacCrimmon relations complained to my son Ruari. He commanded her release and escorted her to the MacCrimmons himself.\"\\n\\n \"I thought your children were all younger than that,\" she said.\\n\\n \"I married late, but I had a natural son many years before my marriage,\" he said, staring off into the darkness. \"Ruari was sixteen at the time, same as your mother.\"\\n\\n \"I am grateful to your son for coming to her aid.\"\\n\\n \"Ruari was kindhearted and gentle like his mother, not at all like the warrior he should have been.\" The MacLeod\u0027s silver hair shone in the moonlight as he shook his head. \"From the time he was a bairn, he cared for three-legged dogs and birds with broken wings.\"\\n\\n \"Was he a disappointment to ye?\" Ilysa asked, her thoughts on Connor. Although Connor was a gifted warrior, his father had never been able to see his other strengths because the two were so different.\\n\\n \"I tried my best to make a warrior out of him, but he was never more than passable with a sword.\" The MacLeod chieftain gave a deep sigh. \"I could not name such a son my tanaiste, successor, but I did love him. I grieve for him still.\"\\n\\n The sorrow in his voice made Ilysa\u0027s eyes sting, but she kept silent. Pity would only offend such a proud man.\\n\\n \"I recognized the brooch ye wore at the gathering,\" he said. \"I had given it to Ruari\u0027s mother upon his birth, and it became his when she died.\"\\n\\n Though she was not wearing it now, Ilysa\u0027s hand went to her throat where the brooch had rested. How did her mother come to possess a brooch belonging to the MacLeod chieftain\u0027s family?\\n\\n \"After seeing ye wear the brooch, I returned to Dunvegan and spoke with those who knew my son best. Eventually, I pieced it all together.\" He paused. \"I believe Ruari was your father.\"\\n\\n Ilysa sat up straight and blinked at him. She had been so caught up in the tale that she had forgotten where it was leading.\\n\\n \"\u0027Tis easy to imagine how it happened. Your mother was a fragile creature who had been hurt - my son was bound to think himself in love with her. As for your mother, my son would not have frightened her as other men did. Ruari was the one who rescued her, and he had a gentle nature.\"\\n\\n \"He could not be my father,\" Ilysa said after she had gathered her thoughts. \"What ye speak of happened near the time of my brother\u0027s birth, which was many years before mine.\"\\n\\n \"Nothing happened then, but they met again nine years later when your mother accompanied your chieftain\u0027s family to a large gathering of the clans,\" he said. \"When they both disappeared soon after, no one guessed it was with each other.\"\\n\\n \"How do ye know it was?\" she asked.\\n\\n \"My son confided in his best friend, who I recently persuaded to tell me all about it,\" he said. \"Ruari knew, of course, that I could not approve a marriage to your mother, as she was not close kin to a chieftain.\"\\n\\n \"Of course,\" Ilysa said, unable to keep a touch of bitterness from her voice.\\n\\n \"They became lovers, and he begged her to come live with him at Dunvegan and bring her son,\" he continued. \"But she refused. She told him she had made a promise to care for your chieftain\u0027s children, and she would not break it.\"\\n\\n \"I can\u0027t imagine my brother Duncan raised as a MacLeod,\" she said. \"His first chance, he would have run away.\" Then it struck her that if her mother had gone, she would have grown up as a MacLeod herself. As much as the prospect of being parted from Connor grieved her, the thought of never knowing him was worse.\\n\\n \"When your mother chose to return to her own clan, it broke my son\u0027s heart. Ruari died in a battle not long after.\" He paused. \"I don\u0027t believe he knew she carried his child.\"\\n\\n \"I\u0027m sorry ye lost your son.\" Ilysa could not yet think of the young man in the story as her father. \"Do ye want his brooch back? Is that why ye came to tell me this?\"\\n\\n \"I didn\u0027t come for the brooch.\" The MacLeod chieftain\u0027s gaze was intent on her face. \"I came for my dead son\u0027s only child. I came for my granddaughter.\" \\n\\n","sourceLink":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4/page-37.html","bookId":2647,"book":{"id":2647,"title":"The Chieftain (Return of the Highlanders #4)","description":"Storyline: The Chieftain (Return of the Highlanders #4) \\n Four fearless warriors return to the Highlands to claim their lands and legacies. But all their trials on the battlefield can\u0027t prepare them for their greatest challenge yet: winning the hearts of four willful Scottish beauties. \\n A Warrior\u0027s Heart \\n Connor, chieftain of the MacDonalds of Sleat, holds the fate of his people in his hands. Rival clans are plotting to take over his lands, and duty determines whom he will fight, trust . . . even marry. Seeking guidance, Connor turns to Ilysa, a young lass with the gift of foresight, who reveals an approaching danger-and a passion that burns only for him. But the warrior must make a powerful marriage alliance, and Ilysa\u0027s bloodline is far too humble. \\n With her powers to heal and see evil where others cannot, beautiful Ilysa dresses plainly, speaks softly, and loves her chieftain from afar. Yet when Connor finally stokes the embers of desire that have so long burned within her, Ilysa feels bliss unlike any she\u0027s ever known. Now as he is forced to place duty before happiness, Ilysa senses Connor is in grave peril. Can she find a way to prove she is the woman he needs by his side?\\n","cover":"https://allnovel.net/images/the-chieftain-return-of-the-highlanders-4.jpg","author":"Margaret Mallory","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-chieftain-return-of-the-highlanders-4.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:48:22 AM"}}
