{"id":90829,"no":16,"title":"Page 16","content":"\\n\\n Granted, the one in the study had been executed by a Dandridge. Did that mean anything? Naturally, the Dandridges hated the man who’d caused the death of Lucy Tarleton, Sophia Dandridge’s sister. And Bradley had probably brought so much misery to Angus Tarleton that he’d died years earlier than he should have.\\n\\n So what exactly was the truth about Beast Bradley? Did his infatuation with Lucy turn him into a monster or had history been written by the victors—the patriots in this case? Maybe he’d been nothing more than human, having virtues along with his faults.\\n\\n Then again, how did anyone forgive a man who’d cut the throat of a young woman in her own parlor?\\n\\n The house seemed silent. Nothing even seemed to shift. He yawned, exhausted, then went back out to the parlor.\\n\\n Allison Leigh was still sleeping soundly.\\n\\n “Allison?”\\n\\n He touched her shoulder. She didn’t awaken.\\n\\n She looked young and vulnerable lying there, and angelically beautiful. Her dark hair was sleek and lustrous against the crimson velvet of the sofa; her long lashes swept ivory cheeks.\\n\\n “Allison?” He shook her slightly but she still didn’t wake.\\n\\n Perplexed, Tyler straightened, studying her for a minute or two.\\n\\n It probably wouldn’t look proper to leave her sleeping there. But…they were living in the modern world. He was going upstairs, she was downstairs, and he really didn’t give a damn what people said. She lived alone, and he was pretty sure she didn’t have to answer to anyone.\\n\\n “Sleep tight,” he murmured.\\n\\n He walked the stairs up to the second floor, heading for the master bedroom.\\n\\n He paused to glance at the other painting of Beast Bradley. Here, there was strength in the eyes, but not that expression of brutal cunning and cruelty.\\n\\n “Talk to me?” he offered.\\n\\n But the house was silent.\\n\\n He went on to bed, open to the spirits who might roam the house.\\n\\n That night, none of them chose to appear.\\n\\n Allison woke with a start.\\n\\n She sat up, feeling lost. Then she noticed the blanket around her and turned to see the pillow she’d slept on. She looked around, realizing she was in the foyer of the Tarleton-Dandridge House. She remembered seeing Julian and she remembered passing out.\\n\\n She didn’t want to be here. She’d imagined Julian last night; he was on her mind. She was near the place where he’d died. She had been an idiot to come here.\\n\\n Now she had to go.\\n\\n She rose just as Tyler Montague came walking through from the salon doorway, a cup of coffee in his hand.\\n\\n “It’s black. Hope that’s okay. I don’t use cream or sugar so I hadn’t bought any yet. I didn’t disturb anything historical. I made it in the pot you keep in your docents’ room. You all might have cream and sugar in there somewhere? I didn’t prowl through anyone’s things,” he said, offering her the cup.\\n\\n She nodded and accepted the cup numbly.\\n\\n “I, uh, slept here all night?” she asked him.\\n\\n “Unless you woke up and went tearing around the historic district while I was sleeping,” he said. “Enjoying the wild nightlife.”\\n\\n She ignored his attempt at levity. “You didn’t see or hear anything…odd?”\\n\\n “No,” he said. “Did you?”\\n\\n “Ah, no, no. I must’ve been so tired… I’m sorry. I need to leave now. I have—I’m going to have a doctor’s appointment.”\\n\\n She gulped down a huge sip of the coffee, which was hot. She coughed but didn’t scald her mouth, thank God.\\n\\n “Hey!” Tyler took the cup from her while she caught her breath. “Are you all right?”\\n\\n “I’m fine. Embarrassed. I was just so tired. Thanks for the pillow and the blanket. You should have woken me.”\\n\\n “I tried.”\\n\\n “Oh, I’m sorry.”\\n\\n “Don’t be. You were out like a light,” he told her.\\n\\n You’ll never know how much! she thought.\\n\\n “I’ll call you later.” She took the coffee cup from him and drank more carefully, then pushed it back in his hands. “I’ll call you later!” she repeated.\\n\\n Allison tried not to run to the door. When she reached it, she remembered that an alarm was set. She keyed in the numbers to let herself out.\\n\\n At the gate, she did the same thing. She didn’t look back. She ran down the street, not sure at first what she was doing or even what time it was, just desperate to get away from the Tarleton-Dandridge House.\\n\\n Eventually, she slowed her gait. She finally checked her watch and saw that it was still early—not yet seven. She’d go home and shower, then show up at the university’s medical buildings and hope that a professor friend, a psychiatrist, would be able to see her.\\n\\n At her house, she paused, fumbling in her handbag for her keys. She didn’t want to go into the house alone.\\n\\n But she couldn’t go anywhere in the clothes she’d been wearing all day and all night. Determined, she slipped her key into the lock and went inside. Still, it took her a minute to go farther than the doorway.\\n\\n She started talking out loud. “Julian, I’m taking a shower. There will be no crazy stuff going on now, okay? I do not see you and I will not see you. You are a product of my imagination.”\\n\\n She ran through the front of the house and up the stairs to her bedroom, looking straight ahead all the while. She showered as quickly as she could, dropping the soap several times when it fell through her trembling fingers.\\n\\n She wasn’t sure if her shirt matched her jeans and she didn’t care. Besides, did it matter what shirt was worn with a pair of jeans? She was so terrified she just about fell down the stairs, but she was almost there, almost out of the house.\\n\\n She had to try twice to get the door open. When she did, she turned back. She could see the top of a head above the upholstered wingback chair.\\n\\n A hand rose.\\n\\n She clearly heard Julian say, “I’ll be here when you get back.”\\n\\n 6\\n\\n Allison drove directly to the university. Once she’d parked, she headed for the medical compound and found Dr. Marty Hanson, who was a practicing psychiatrist.\\n\\n Marty said it probably wasn’t the best thing to work together, since they were friends. But she was able to send Allison to a colleague she admired, Dr. Rudy Blount, who was a short, friendly man in his early fifties with wire-rimmed spectacles and a balding head. He asked Allison to make herself comfortable. No, she didn’t have to lie down on the sofa but she was welcome to do so. She could also just sit and talk to him from an armchair.\\n\\n Allison opted for the armchair and a conversational approach. Dr. Blount was personable. They talked about their mutual love of the city and discussed issues in the news. He asked about her daily life; he knew that, like Marty, she taught at the university. He assured her that anything she said was completely and totally confidential.\\n\\n Finally, Allison released a deep breath and explained her problem.\\n\\n She told him about finding Julian—and then seeing him in her house.\\n\\n “Is it stress?” she asked him.\\n\\n “What do you think?” he asked her.\\n\\n “I think it’s stress,” she said.\\n\\n “Then it’s most likely stress.”\\n\\n “I’ve never believed in ghosts,” she told him.\\n\\n He folded his hands and set them in his lap. “Ghosts. Well, what are ghosts, Ms. Leigh? Maybe they’re memories. Maybe they’re images we create in our minds. Maybe they’re reminders that we should have done something, but didn’t. Tell me, were you feeling any guilt about your friend Julian?”\\n\\n “No, I wasn’t feeling guilty about Julian. He was always showing up late and we—the group of us—were always covering his ass!”\\n\\n “Do you feel you need to defend yourself in any way over his death? Do you think you could have saved him somehow?”\\n\\n “No, I’m not feeling defensive. I would’ve done anything to save him, but the second I saw him, I knew he was dead.”\\n\\n “Did you check for a pulse?”\\n\\n “I never touched him. I called the police.”\\n\\n “As you waited were you frightened that something would happen to you?”\\n\\n Allison shook her head. She hadn’t felt that at all. “No, no…it looked as if he’d just sat down…wrong. You know how people rest their elbows on a table and their chins on their hands? Well, it’s as if he thought he had a table and the bayonet was his hand.”\\n\\n “Very sad, and terrible for Julian, and for you. At this point, it has to be difficult to understand what you’re feeling. Guilt is an interesting emotion. It was fine to be angry with him while he was alive, but now that he’s dead, you may feel guilty about that anger without being aware of it.”\\n\\n “I really don’t think I feel guilty. Whenever he left us in the lurch, we were always honest about it. He’d know we were angry because we’d tell him, and he’d apologize and promise not to do it again. He also said that when he made it big, he’d never forget us or leave us behind.”\\n\\n “Did you like the young man?”\\n\\n “As a friend, definitely. When we were away from work.”\\n\\n “Have you ever had a feeling like this before?”\\n\\n “A feeling like what?”\\n\\n “That someone’s still with you. Someone dead. A spirit—a ghost.”\\n\\n “Never.” Allison shook her head. “But now…I’m afraid to be in my own house. I slept on a sofa at the Tarleton-Dandridge last night because I was afraid to go home. No, that’s a lie. I didn’t start out sleeping. I passed out. Because I saw Julian. I was with one of the FBI men—Agent Montague, who wants my help with the history and the people there—and when he went to check on the windows, doors, alarm system, all that, Julian suddenly appeared. And the next thing I knew I was sinking, the world went black, and then I woke up this morning feeling like an idiot.”\\n\\n “The agent didn’t come to help you?” Dr. Blount asked in obvious surprise.\\n\\n “He thought I’d fallen asleep. He gave me a pillow and a blanket,” she said dryly. \\n\\n","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-16.html","bookId":2282,"book":{"id":2282,"title":"The Uninvited (Krewe of Hunters #8)","description":"Storyline: The Uninvited (Krewe of Hunters #8) \\n 1777: In the throes of the Revolutionary War, Landon Mansion is commandeered by British Lord \"Butcher\" Bedford. \\n He stabs Lucy Tarleton - who spurned his king and his love - leaving her to die in her father\u0027s arms. \\n NOW: After the day\u0027s final tour, docent Allison Leigh makes her rounds while locking up... and finds a colleague slumped over Bedford\u0027s desk, impaled on his own replica bayonet. \\n Resident ghosts may be the stock-in-trade of stately Philadelphia homes, but Allison - a noted historian - is indignant at the prospect of \"ghost hunters\" investigating this apparent murder. \\n Agent Tyler Montague knows his hauntings and his history. But while Allison is skeptical of the newcomer, a second mysterious murder occurs. \\n Has \"Butcher\" Bedford resurfaced? Or is there another malevolent force at work in Landon Mansion? Wary, yet deeply attracted, Allison has to trust in Tyler and work with him to discover just what uninvited guest — dead or alive — has taken over the house. \\n Or their lives could become history!\\n","cover":"https://allnovel.net/images/the-uninvited-krewe-of-hunters-8.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-uninvited-krewe-of-hunters-8.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:44:18 PM"}}
