{"id":90845,"no":32,"title":"Page 32","content":"“Yes,” Allison said. “Give me a minute. I want to rinse my face.” She drew in a deep breath. “We’ll hear from the rest of the board soon, I imagine. They’ll want to arrange something for Sarah.” Tyler nodded. He watched her rise stiffly and walk toward the pantry. She hadn’t been as close to Sarah as she had to Julian. But she’d lost someone, and everyone deserved a few tears. “I’ll be right back,” she promised. Allison was true to her word. She just needed cold water on her face and a moment alone to breathe. Now Sarah was dead, too. But these people, the Krewe, were here to help. So she was going to help them by doing whatever she could. She met Tyler back in the salon and motioned for him to follow her. The narrow hallway in the foyer led straight to the back door; the Tarleton-Dandridge was, despite its grandiose styling, still a shotgun house. The hall had allowed the breeze to sweep right through on hot days. “The back can be accessed through the pantry and the music room,” Tyler noted. “It’s the same door, but the music room and the pantry lead toward it from either side of the house.” “No other doors? Nothing we might have missed?” She shook her head. “There’s a fire escape out of Lucy Tarleton’s room. If you look out the right-hand window, you’ll see it. It’s a legal requirement,” she said. Tyler stopped at the twenty-foot expanse between the house and the stables. “What?” she asked him. “I saw the horse,” he said. He looked at her. “And the dog.” “Firewalker and Robert?” Had he seen them or had he imagined them? “The horse was beautiful, a huge black stallion, about seventeen hands tall,” he told her. “And the dog?” “Big old hound or maybe some kind of hound mix. Huge and tawny.” “He was a wolfhound mix,” Allison said. “Nice dog,” Tyler said. “I wouldn’t mind a dog like that. Of course, I guess back then, he had lots of room to run. He wouldn’t really make an apartment dog.” “You live in an apartment?” “For the moment.” He scanned the property as they spoke and then his eyes settled on her. “I lived most of my life in San Antonio, but as you know, our main office is in Arlington, Virginia. Our permanent homes are there now. I want to get a house, and there’s still plenty of land around us. The closer you get to the Capitol, of course, the harder it becomes to have much of a property. But I’d like to have a horse again, and a dog—something like the ghost dog, an enormous old hound, loyal to the core.” “Also furry, muddy and dirty,” Allison said. “Ah, you’re not a dog girl.” “I love dogs! I’ll have you know that my little mutt lived to the ripe old age of nineteen. I got him when he was six weeks old and I was four, and we didn’t lose him until I’d graduated after my first stint at college.” She hesitated. “I wasn’t ready for another dog after him, I guess.” He looked out over the property, glad that she seemed to be speaking calmly, that she wasn’t in shock the way she’d been after Julian’s death. “Robert must have been a great dog,” Tyler said. “I suspect he went everywhere with Lucy Tarleton and that she had to convince him to stay—maybe with her sister, maybe she got a servant to lock him up—every time she made one of her rides down to Valley Forge.” He pointed across the stables. “How do you suppose she pulled it off? The family groom must have been loyal to her, and she had to be an excellent rider to slip through the British military that surrounded the city at the time.” “She was passionate about her cause. She’d grown up here and knew the area well, while the British were on foreign soil. I think you’re right—the groom knew what she was doing and helped her. If she was caught, she could act the part of a stricken woman, just trying to reach a wounded cousin or friend. She probably played the ‘I’m just a woman’ card many times. We can’t know the details.” Allison paused, shrugging lightly. “We get history in one big package, all tied up with the outcome known.” “That’s true—and it’s human nature to invent or embroider some of those details. We do know she died, but no one was there when it happened—except her father, according to what I’ve read. There could be no torture worse for a father than seeing his daughter killed.” Allison nodded. “That was the outcome. I like to think about her before the end. Lucy Tarleton didn’t know she’d get caught when she was riding through the night. But so many people took huge risks, even though they knew the punishment for what they were doing could be death. It’s strange, you make me think of the colonists’ day-to-day life in a way I haven’t for a while. And about Lucy. She was like any other woman of any other time. She loved her dog, and her dog was fiercely loyal and loving to her.” Allison shivered. “I can only imagine the day Beast Bradley caught her. She was returning from one of her spy missions, but I don’t believe he ever proved she was spying. I think he found out about Stewart Douglas—that’s how the story came down to us, anyway.” “A girl with a dog and a horse,” Tyler murmured. “The dog was killed, you know. According to the legend. I’m hoping he ripped his attacker to shreds before he went down.” “I’m sure he fought tooth and nail,” Tyler said. “Maybe he stays around because he’s looking for Lucy.” “But the horse wasn’t killed,” Allison told him. “Actually, the fate of the horse is a curious one. The British took him when they evacuated Philadelphia. But he wound up back here—he’s buried in the graveyard, too. So is the dog. There’s an area toward the rear for family pets.” “Let’s go see it, shall we?” “Okay.” Allison smiled at him. There’d been something about their conversation here that was wistful and poignant. Allison wasn’t sure what she’d thought about him before, other than that unmistakable attraction, but they seemed to be drawing closer. Maybe she needed to back away. She’d lost friends. She was learning all about the world beneath what was seen, and she was coming in contact with entities that were uninvited. But it felt as if Tyler had now been part of her life forever, although it had just been a few days. She was becoming dependent on him. He could be harsh, but only to make her see. He was definitely an imposing person. Maybe any time a tall man with a gun came from Texas, the rest of the world automatically assumed cowboy. He was tall, extremely well-built, and now that they’d shared a quiet moment thinking about the lives of others rather than their deaths, she knew she liked his mind and the way he thought. She suddenly knew that he wasn’t just attractive, he was…sexually appealing. For the past few months, she’d refused to even consider a relationship with anyone, not after her last fiasco.... Another person had died. And here she was, thinking about this man. “Yes!” she said, turning away from him. “The graveyard! The family plot. Well, let me get into tour guide mode here.” She moved past him. Allison wondered if, when this mystery was solved, he would go back to Virginia, or on to another city to solve another problem. She would always remember this moment, standing in the yard, reflecting on the life of a long-dead woman and the simple human fact that she had loved her dog.This moment, because it was when Allison discovered she was intrigued and excited by being near him. She wondered what it would be like to really touch him.... She launched into her talk. “The stables, as you see, are to your right. There’s actually work space in the old servants’ quarters over the stables. There are stalls for eight horses, a tack room and a little office. The watering trough is still there—it’s the original stone trough. The stalls themselves are wood and have been repaired over the years, but the circular carving on the gates to the individual stalls is original. As we pass the stables, we come to the family graveyard. It was a huge property back then, so it was natural that household members were buried here. During the yellow fever epidemic, the family moved out of the city and came back afterward. They were blessed. None of the Dandridge family died.” She paused. “You probably know that a yellow fever epidemic swept through Philadelphia in the summer of 1793.” “I’ve been reading up.” He smiled at her. “I don’t know as much as you do, but yes, the then-capital city had a population of about fifty-five thousand. Dolley Madison lost her first husband and two of her children during the epidemic.” “Well, the Dandridge family was smart—they got out. They weren’t here when the criers went through the town saying, ‘Bring out your dead, bring out your dead!’” She looked at the stables; she went through them so often. Cleaned out now, as they’d been since the turn of the twentieth century, they still smelled of leather, horses, cigars and polish. The upstairs had been converted to caretaker apartments long ago, before the house was bequeathed to Old Philly History. “Graveyard now?” Tyler asked. “Or are you stalling?” She laughed. “Why worry about a graveyard? A ghost appeared to me in my living room. What else is there to fear?” “From the dead, usually nothing. Although…” “What, the dead can be evil?” “I wasn’t involved with the cases, but a few times, when someone really evil died somewhere—that somewhere being a place where they’d killed and tortured others—there was a remnant of evil that lingered. But the ghosts didn’t kill. Sometimes, maybe evil attracts evil.” “I don’t believe the Tarleton-Dandridge family was evil in any way, so the family graveyard should be safe,” she said. “And thankfully, it is broad daylight.”","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-32.html","bookId":2282,"book":{"id":2282,"title":"The Uninvited (Krewe of Hunters #8)","description":"Storyline: The Uninvited (Krewe of Hunters #8) 1777: In the throes of the Revolutionary War, Landon Mansion is commandeered by British Lord \"Butcher\" Bedford. He stabs Lucy Tarleton - who spurned his king and his love - leaving her to die in her father\u0027s arms. NOW: After the day\u0027s final tour, docent Allison Leigh makes her rounds while locking up... and finds a colleague slumped over Bedford\u0027s desk, impaled on his own replica bayonet. Resident ghosts may be the stock-in-trade of stately Philadelphia homes, but Allison - a noted historian - is indignant at the prospect of \"ghost hunters\" investigating this apparent murder. Agent Tyler Montague knows his hauntings and his history. But while Allison is skeptical of the newcomer, a second mysterious murder occurs. Has \"Butcher\" Bedford resurfaced? Or is there another malevolent force at work in Landon Mansion? Wary, yet deeply attracted, Allison has to trust in Tyler and work with him to discover just what uninvited guest — dead or alive — has taken over the house. Or their lives could become history!","cover":"https://allnovel.net/images/the-uninvited-krewe-of-hunters-8.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-uninvited-krewe-of-hunters-8.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:44:18 PM"}}
