{"id":90865,"no":52,"title":"Page 52","content":"\n “You can’t take a shot,” Nathan told him. “You could shoot Allison. Shoot her and kill her, and her death would be your fault.”\n “Lucy isn’t going to let that happen,” he said.\n “Lucy! There is no damned ghost! What the hell is the matter with you people? Ghost busters, it’s a joke.”\n “Not true. Lucy is here—and Julian is, too. I’m sure he hates you even more than Lucy does.”\n “There are no ghosts!” Pierson shouted. “Now you…you back up and let me leave with her or I swear I’ll plunge this needle straight into her heart. It’s filled with a Norcuron mix—I stole it from the hospital. In her heart? It’ll kill her in a flash.”\n Allison reminded herself that courage was about being terrified—and going forth anyway!\n She managed to open her mouth.\n She had one chance and she knew it. She prayed that her drugged muscles would work.\n She bit Nathan Pierson. Bit him as hard as she could.\n He screamed. She was nearly dead weight.\n He didn’t drop her, but it was enough. Tyler used those split seconds to speed across the room, leaping over the trunks in his way, and tackle Nathan Pierson, bringing the three of them down to the ground. Pierson fought him desperately, reaching for the needle. But Tyler smashed his arm and grabbed the syringe and the two of them rolled, crashing into the wardrobe against the far wall.\n Allison couldn’t see what was happening. She willed herself to turn. Inch by inch…\n By half inch.\n She made it just in time to see the needle rise into the air.\n And she saw Tyler lift his arm, slam Pierson’s arm against Angus’s old wardrobe—and send the needle flying.\n With a right swing he caught Nathan Pierson in the jaw.\n That was when Pierson gave up the fight. Tyler scrambled to his feet, racing over to Allison.\n For a moment, as Tyler took her in his arms, she saw Pierson lying on the floor, Lucy Tarleton standing above him.\n Her ghostly form kicked him. She saw then that Julian had come forward to do the same thing, kicking him and kicking him. Whether Nathan felt it or not, she couldn’t say. But he must have sensed their hatred.\n Lucy Tarleton set a hand on Julian’s arm. He turned to her, and their eyes met, and Lucy smiled at him, taking his hand.\n Tyler picked Allison up and wordlessly began to walk down the stairs that brought them to the first level of the stables, where the horse stalls remained.\n Logan burst through with Sean, and they dragged Nathan Pierson to his feet and read him his rights.\n Cherry was standing outside the stall. “The bastard!” she cried. “He doesn’t deserve any rights.”\n “He does,” he said to Cherry, holding Allison in his arms. “They might figure out what it means to be a patriot—an American. Those men fought and died for our rights. So did Lucy Tarleton. But he forgot all about freedom of speech and freedom of the press—and our freedom to know the truth and learn from the truth.”\n Tyler walked with Allison, taking her outside beneath the moonlight shimmering over the property. She wished she could put her arms around him. She knew she was headed for a waiting ambulance, but she wanted to say something to him.\n She didn’t know what. Thank you…thank you for my life. Thank you for being you, for believing…for finding me.\n He carried her into the ambulance and laid her down on the stretcher.\n He smiled, then took her hand and kissed it. “True courage, my dear patriot!” he told her.\n “I think I love you,” she said.\n “A true patriot, a remarkable woman, the woman I love—and a ball-breaker with wicked teeth! I could never, ever want anything more.”\n Once arrested, Nathan Pierson wasn’t going down alone. He talked; he bargained. He played crazy and tried to pretend he’d been seduced and coerced into his actions.\n When Allison was released from the hospital the next morning, Tyler told her the sad truth and they went to Annette’s room together. She was still being dramatic, still pushing the nurses around.\n Tyler let Jenson cuff her to the hospital bed. “Annette Fanning, you are under arrest…”\n He went on to chronicle her crimes. Nathan Pierson had done the most damage, but Annette had put the copperhead in Sarah Vining’s car and she’d been the one to steal the Norcuron mix from the hospital, where her cousin had really had a baby. She’d also allowed herself to be bitten by the small copperhead she’d smuggled into the bathroom, in order to give Nathan a chance to get Allison out of the house. They’d taken a lot of risks, but they’d almost pulled it off.\n Annette could also solve one of the biggest mysteries in the case—Artie Dixon’s coma. They would have known eventually when all the blood tests had been completed. Dixon had been a victim of argot poisoning; Annette had gotten it into his food when he and his family had gone to the Colonial tavern for dinner. She sometimes worked there, and it had been easy to mill around with her fellow workers in the kitchen. She’d never seen the Dixon family, and they had never seen her. But Pierson had described them to Annette, asking her to do something that would get the family talking about the ghosts in the house, specifically Brian Bradley. If others talked about the ghosts, it would only make Julian Mitchell’s suicide—or accidental death—appear to be the work of the evil Beast Bradley’s spirit, ever residing there.\n They hadn’t expected the coma. That had been an added benefit.\n Annette was proud of her own brilliance. Her reward?\n “Money. Lots of it,” she said, and turned away with one word. “Attorney!”\n Allison was deeply depressed and hurt by her friend’s betrayal, but while Annette screamed that every person couldn’t be her—with degrees, able to work anywhere, do anything—she walked quietly out of the room. She looked as if she’d break down, except that Logan was waiting for them outside.\n “Artie Dixon has come out of his coma. He wants to thank you. He says you’ve spent hours and hours with him, trying to convince him that everything would be all right.”\n So she didn’t break down. They visited with the Dixon family, and Todd kept taking Allison’s hands and telling her she was the best, the coolest, the most wonderful.\n She looked at Tyler and smiled. She’d been there with Artie, yes. But not for hours and hours as he’d claimed. She and Tyler both had a feeling that Lucy Tarleton had found Dixon and stayed by him, eager to help a man who needed help—a family man.\n She promised Todd they’d stay in touch. Haley Dixon hugged Allison and kissed Tyler on the cheek, and they left behind a very happy family.\n A search of Nathan Pierson’s house produced the trick painting he’d exchanged for the historical image of Beast Bradley in the study. It was fitted with empty eye sockets that could be lit up with blinding lasers, and tiny speakers that could be wirelessly attached to a small, voice-altering mechanism Pierson had used to terrify his victims or lure them into danger—Julian to his doom with his own bayonet, and Martin Standish out to the woods and the stream beyond.\n That night, Allison ordered flowers and had them brought to the Tarleton tomb. Tyler joined her there. When she’d set them all around the family mausoleum, they walked back to the house.\n The spirit of Lucy Tarleton was just coming from the stables. She led Firewalker, and the dog, Robert, pranced joyously at her side.\n Lucy paused, staring at Tyler and Allison, and then she smiled. She lifted her fingers to her lips and blew them a kiss.\n Tyler hadn’t realized that Julian was with them. He saw Lucy beckon, and Julian walked over to her.\n She leaped up on Firewalker, and then reached down a hand to Julian.\n He looked back at Tyler and Allison.\n Allison said, “Julian, go. A beautiful woman is trying to take you with her.”\n “But…”\n “Surely, they need rock stars wherever she’s going,” Tyler said.\n Julian grinned. He took Lucy’s hand and jumped up on the massive steed behind her.\n The sun was setting. They rode toward the burst of gold in the west.\n Robert barked with excitement as he followed the riders, who disappeared into the light.\n “They’re at peace.” Tyler spoke in a quiet voice.\n “Thank God!” Allison said fervently.\n “And we’re free.”\n “And out of here—for the night, at least. I know this glorious, modern, five-star hotel in D.C. where docents get special rates. They have these wonderful Jacuzzis in every room, and a lovely old bar with cushioned seats in front of a charming fireplace.”\n He shrugged. “That’ll do—for tonight.”\n She studied his eyes. “For tonight?”\n “I was thinking about a warm beach with white sand. All the huts have every modern amenity. It’s my turn for a vacation. Of course, when you want to work and write, they have Wi-Fi. When you don’t…they have pristine private coves, snorkeling, diving—and no ghosts. Nope, no ghosts. The place I’m thinking of is in Jamaica, and it’s brand-new. I don’t want to stay there forever, but I was thinking of a week.”\n She kept staring at him.\n “Are you in?” he asked.\n “I am.”\n “And then…well, it’s not that hard to get to Philly, not really. Unless the Krewe’s across the country, I can get here easily.”\n “You won’t have to,” she said.\n His heart thundered. He tried not to show it, and held his head at a stoic Texas angle.\n “I won’t?”\n She smiled, stood on her toes and kissed his lips with a very seductive and insinuating passion.\n “We’re not going to make it to that hotel,” he murmured huskily. He gently pushed her away. “Back to the question. Why won’t I have to come to Philly?”\n “Because Virginia and the D.C. area are full of colleges…and I’ll be just fine in Arlington,” she said.\n He kissed her. It was a wet, steamy kiss that made her tremble against him. “I told you I thought I loved you,” she teased. \n","sourceLink":"https://allnovel.net/the-uninvited-krewe-of-hunters-8/page-52.html","bookId":2282,"book":{"id":2282,"title":"The Uninvited (Krewe of Hunters #8)","description":"Storyline: \n The Uninvited (Krewe of Hunters #8) \n 1777: In the throes of the Revolutionary War, Landon Mansion is commandeered by British Lord \"Butcher\" Bedford. \n He stabs Lucy Tarleton - who spurned his king and his love - leaving her to die in her father\u0027s arms. \n NOW: After the day\u0027s final tour, docent Allison Leigh makes her rounds while locking up... and finds a colleague slumped over Bedford\u0027s desk, impaled on his own replica bayonet. \n Resident ghosts may be the stock-in-trade of stately Philadelphia homes, but Allison - a noted historian - is indignant at the prospect of \"ghost hunters\" investigating this apparent murder. \n Agent Tyler Montague knows his hauntings and his history. But while Allison is skeptical of the newcomer, a second mysterious murder occurs. \n Has \"Butcher\" Bedford resurfaced? Or is there another malevolent force at work in Landon Mansion? Wary, yet deeply attracted, Allison has to trust in Tyler and work with him to discover just what uninvited guest — dead or alive — has taken over the house. \n Or their lives could become history!\n \n","cover":"https://allnovel.net/images/the-uninvited-krewe-of-hunters-8.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-uninvited-krewe-of-hunters-8.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:44:18 PM"}}
