{"id":71929,"no":13,"title":"Page 13","content":"\n Trevor nodded, not at all shocked she’d hit his worry right on the head. “So maybe it is best to keep them all here until they’ve developed the skills to deal with them type of people.”\n “It’s easy for me to say fight it because I don’t have the same life experiences you three have in living the way you do. I don’t know how I’d handle looking into Westin’s sweet face every day and telling him to suck it up.”\n “When I think about dropping him off at the bus stop and leaving him to face that shit alone? At age six? I almost break out in hives.”\n “What about changing schools? Hulett or Sundance? It’d be extra driving, but if Westin was in a happier learning environment, it’d be worth it.”\n Trevor had suggested it, but Chassie refused to consider it. He’d been frustrated to the point that he’d reminded her that her years going to school in Moorcroft had been shitty too.\n “Trevor, have you guys talked about this to anyone?”\n “Not yet. We’re sort of in that state of denial or whatever.” And again, he didn’t want anyone in their personal business.\n But Ramona did not feel the same. She dialed a number on her cell phone and waited for the person on the other end to pick up. “Colby? It’s Ramona. I’m good.” She laughed. “I did behave while I was here. One night out with Keely. One. That’s it, I swear! No, Cam did not have to break up a bar fight—Keely and I handled it. Anyway, I stopped by to chat with Chassie before I leave and I heard something really distressing. Westin was suspended from school for standing up to a bully.”\n “Jesus, Ramona.”\n She shushed him. “The Glanzer clan is having a hard time with this. Do you have time to swing by and offer your old friends and your cousin some support? Because they sure could use it. Uh-huh. No problem. Bye.” She hung up and said, “He’ll be here in half an hour. And he’s calling Colt.”\n Trevor wanted to ask what Colby and Colt could do, but the truth was, outside advice might help them. “Thanks for meddling, Ramona.”\n She laughed. “It’s what I do.”\n “You and Keely went out and whooped it up?”\n “Just one night. Jack frowns on her getting too wild.”\n He grinned. “So that’s exactly what she did, huh?”\n “Yep. I swear those two fight just so they can make up.” She shook her head. “I’ll never understand love. Which is why I’m still single, by the way.”\n “As long as I’ve got you here, you wanna come clean about why you just ‘happened’ to be in Wyoming the weekend we need you?”\n “Didn’t buy that coincidence, huh?”\n Trevor shook his head. “I wasn’t about to look a gift horse in the mouth either. So what’s goin’ on?”\n “That whole I don’t understand love thing I was complaining about? It’s because I swear I have the worst taste in men.” Ramona twirled a section of her hair. “The last guy I dated seemed normal, right? He’s rich, he’s good-looking, he took an interest in me and my life on a level I’ve never had. Which should’ve been a warning sign. Anyway, I broke it off. He wasn’t ready for that. He refused to accept it, actually.”\n “Christ, Ramona, is he stalking you?”\n “Sort of.” She blew out a breath. “Okay, yeah, he’s stalking me. Everyone thinks I’m being stupid, that I just don’t understand how a real love relationship works, because I’m more the one- or two-night stand kinda chick. But this? This is creepy as hell.\n “He follows me everywhere and he doesn’t bother with stealth. He sends me gifts—ridiculously expensive gifts.” Ramona shot him a look. “Every girl’s dream, right? Wrong. I have no way of returning them to the store or the courier service that delivered them. And that’s exactly what he wants; me to come to him. That’ll add to his delusion I can’t keep away from him because we’re soul mates.”\n “How long has this been goin’ on?”\n “Months. We dated for about three months before I broke it off. He’s spent the last six months doing this shit. I went to market in China for two weeks and when I came home? He’d had my bedroom redecorated to match his.”\n Trevor’s jaw dropped. “Are you fuckin’ kidding me?”\n “No. He’s so...smooth and charming he convinced the building manager to give him access to my apartment so he could surprise me.” She shuddered. “I put all the bedding in the trash—I made sure he knew I did it. Then I called the Salvation Army to haul away the furniture. That’s when I leapt at the chance to come here. I’ve been traveling on business the last month and I’m actually a little afraid to go home.”\n “Ramona. Sweetheart. You have to call the cops.”\n She shook her head. “And tell them what? This man who looks perfect on paper is a psychopath? He’s a respected businessman, Trevor.”\n “Did you talk to your folks? Or your brothers? Or your cousins about this?”\n She groaned. “Yes, I told Keely and she tattled to Cam. He freaked out. My God he is one scary-ass dude when he’s upset. I shudder to think what he’ll be like when Liesl starts dating. Anyway, he’s got an old Army buddy who lives in Seattle and he’s picking me up at the airport tomorrow. Part of me is pissed because I don’t want a damn babysitter. But another part of me is really relieved.”\n “I’m relieved too. Keep in touch with us, okay?”\n “I will. Now tell me about this addition Chet and Remy are putting on.”\n When Edgard and Westin returned home, three vehicles, belonging to Colby, Colt and Ramona were parked in the drive.\n “Papai, why are there people here?”\n “No idea. Let’s go find out.”\n Westin hesitated to get out of the truck.\n “Something wrong?” He’d been his same helpful self during the cattle check, hopping out to open gates. He’d been quiet, but that was to be expected, given the day he’d had. So far they hadn’t addressed the “hitting is always wrong” issue—mostly because they weren’t sure it was wrong in this case. It’d forced everyone to deal with the issue—not just poor Westin alone.\n “Do you think I should do pages in my workbook tonight since I’m kicked out of school?”\n “Afraid you’ll fall behind?” he teased. “Of course you should do it. I’ll check it. That means I’ll expect the answers in English and Portuguese.”\n Westin grinned and rattled off “I’ll show you” in Portuguese before he jumped out.\n Inside the house Colby and Colt sat at the dining room table with Trevor.\n “Hey, we’ve been waiting on you,” Trevor said.\n “Where’s Chass?”\n “She and Ramona are havin’ a tea party with Max and Sophia. Westin is supposed to go up and Chassie will come down so we can chat a bit.”\n Westin groaned. “A tea party? Dad, do I have to?”\n “Yep. Aunt Ramona mentioned playing Legos afterward.”\n He tore off.\n Colt chuckled. “The L word works every time, doesn’t it?”\n Trevor kicked out the chair next to him. “Have a seat.”\n Edgard noticed no one was drinking beer. Much as he could use one, he’d wait. Colt had been sober for years, but he respected the man too much to make him uncomfortable.\n “Word of warning? Don’t ask what the powwow is about—that’ll get Chass’s back up.”\n “Christ, Trev, did you really say that to her?”\n “Once. She told me if I ever said it again she’d whap me upside the head with a cast iron skillet and then fill my ass with buckshot.”\n Colt and Colby laughed.\n Chassie sauntered in. “What’s so funny?”\n “Nothin’, sweetheart, have a seat.”\n She sat next to Trevor and blurted, “So Ramona called you?”\n Colby nodded. “I’m glad she did ’cause I know you wouldn’t have.” His gaze encompassed all of them. “None of you would have. And that’s bullshit. We’re family.”\n “I know what it’s like to want to fight your own battles,” Colt said, “but I also know when you need to ask for help.”\n “How can you help us?”\n Edgard reached for Chassie’s hand. “They’re helpin’ us just by bein’ here.”\n She relaxed.\n “So Sassy Chassie,” Colt started and grinned, “why in the hell would you send your kid to school in Moorcroft anyway? Because that’s where you went? As I recall, your school years were awful.”\n “But I thought my experience might’ve just been me. My issue bein’ ethnic and poor. And Westin had a wonderful kindergarten teacher. The parents in his class seemed to like us and accept us.” Her nose wrinkled. “Well, most of them.”\n Edgard looked at Colt. “You’re in the Moorcroft school district too. Doesn’t Hudson start kindergarten next year?”\n “Yeah, but he’s goin’ to school in Sundance. That’s always been the plan.”\n “Really?” Trevor asked. “Why?”\n “Two reasons. The bus picks the kids up so damn early. There’s no reason for them to have to wait an hour to get to school and an hour to get home.”\n Chassie gave Edgard a sheepish smile. “That’s what Ed said.”\n “Smart man. The other reason is all Hudson’s cousins go to school in Sundance. There’s no mornin’ bus service, but Indy or I have to go to town anyway. And I know the kids; they watch out for each other.” Colt leaned over and poked Chassie’s arm. “Just like they would if Westin went to school with them.”\n “Before you got here, Ramona was telling me how much she hated that you, she and Keely all went to different schools,” Trevor said. \n","sourceLink":"https://allnovel.net/short-rides-rough-riders-14-5/page-13.html","bookId":2696,"book":{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"Storyline: \n Short Rides (Rough Riders #14.5) \n Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... \n The stories included in the Short Rides anthology are: \n King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. \n Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. \n All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?\n \n","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/short-rides-rough-riders-14-5.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:21:58 AM"}}
