{"id":71934,"no":18,"title":"Page 18","content":"\n “I won’t mind.” Jack pulled the covers over them.\n “About the flowerpot...”\n “No need to apologize. It’s over and done with.”\n “I wasn’t gonna apologize. I was gonna remind you to buy me a replacement tomorrow. Since the destruction of the poor pot of impatiens was your fault.”\n He didn’t think she’d appreciate the irony that’d she’d angrily hurled a container of impatiens at him so he didn’t mention it.\n All Knocked Up: Chapter Two\n Keely—eight months pregnant...\n “Look at all this cute stuff.” Keely eyed the baby gifts stacked on the dining room table. “I can’t believe how many people showed up.”\n “Your Aunt Kimi certainly outdid herself on this baby shower. I swear she would’ve invited everyone in three counties if I hadn’t culled her guest list. Were you disappointed that Ramona couldn’t be here?”\n “No. I’m happy that she’s finally got a decent man in her life. Chassie felt bad about missing it too, but both she and baby Isabel have a nasty cold and she didn’t want to infect me.”\n “I know Vi was disappointed Chase and Ava weren’t here this weekend with their darling little boy Cooper.”\n “I understand it’s hell taking a baby with an ear infection on a plane—even a private plane.”\n Keely’s mother picked up a plate with remnants of blue and pink frosting on the plastic fork and tossed it in the garbage. “It was sweet of Vi and Rielle to bake the cake.”\n “I’m a sucker for cake.”\n “I know you are, sweetie. You crashing from the sugar buzz yet?”\n “Maybe. I am tired. I hate bein’ so freakin’ tired all the time.” The ladies who’d attended the shower smirked and said the tired aspect wouldn’t go away after the birth—that was the universe’s way of preparing her for sleepless nights and the demands of parenting.\n A bunch of horseshit, if you asked her. Her tiredness stemmed from carrying around fifty extra pounds.\n Keely’s mom put an arm around her shoulders, directing her to a recliner in the den. “Put your feet up. Sweetie, you sure you’re okay? You look a little...off.”\n “I am. This is all a lot to process.”\n “True, but I know that’s not what put that wrinkle in your brow. So what’s really bothering you?”\n Keely knew her mom would see through flippancy or badger her if she hedged, so she admitted, “I’m scared.”\n “Of?”\n “Of everything having to do with having a baby. I’ve been hearing childbirth horror stories and—”\n “Keely West McKay.” Her mother sat on the ottoman and set her hand on Keely’s knee. “You have to stop listening to them.”\n “But it seemed everyone wanted to share theirs with me today. I’ve heard about back labor, and all the different tears, rips and fissures that can happen to and around my va-jay-jay. Not to mention the discussions of cracked and bleeding nipples, sleep deprivation, months of postpartum depression and the death knell of my sex life.”\n “Oh pooh. Scare tactics. Those women only wanted to prove their expertise, for lack of a better term, in something they’ve experienced. Plus, there is competition about who has the most horrifying childbirth story. I swear I heard that friend of yours from high school, Mary what’s-her-name, talking about her episiotomy. There’s not that much skin down there to sustain the two hundred stitches it took to sew her up.” Her mom sighed. “Okay, she didn’t actually say two hundred stitches, but she made it sound that bad to scare you.”\n “Were you worried when you were pregnant with Cord?”\n “Terrified. I was twenty years old and my mother had died the year before so I had no one to talk to who’d been through it. Then again, in those days, the details of childbirth weren’t discussed. So it is good that attitude has changed and women are comfortable sharing their stories. And back then, men weren’t expected to be in the delivery room.”\n Keely frowned. “Daddy cooled his boots in the waiting room while you labored alone?”\n She shook her head. “They tried to keep him out, but your father”—she smiled—“defines stubborn. He told the hospital staff he didn’t abandon his heifers when they were birthing their first calves and he damn well wasn’t going to abandon his wife.”\n “Omigod. A cattle analogy when you were in labor? Really?”\n “Yes, which just proves he is a cattleman to the core,” she said dryly. “But Carson was such a rock through all the deliveries. He never left my side.” She laughed. “But I swear, the man looked ready to faint when the doctor lifted you up and said, it’s a girl.”\n “Daddy didn’t always know what to do with me, huh?”\n “Then or now.” Keely’s mom squeezed her hand. “We’ve been blessed with twenty-six grandchildren. Most days I can’t wrap my head around that number. Your father never worried when any of his daughters-in-law were expecting. Although we were both devastated for Cord and Channing when she lost the baby. But he’s worried about you.”\n Surprised, Keely blurted, “But why?”\n “He was the same way with me, with every pregnancy. Mentioning that women still died in childbirth—even in modern times.”\n “Daddy said that to you?”\n “No. He said it to Cal and Kimi told me. So I cut the man some slack when he wanted to fuss over me when I was pregnant. And he’s mentioned that same concern about you to me a time or two. Parental worry never goes away. Even when you’re a grown woman with a family of your own. Your father loves all you kids. But sweetheart, you are something special in his world.”\n “Ma. You’re gonna make me cry.”\n She leaned over and kissed Keely’s forehead. “We love you, sweetheart. And we couldn’t be happier for you and Jack.”\n “I’m still scared.”\n “I know. Just count yourself lucky that Jack will be involved in all aspects of raising your child. Your dad never changed a diaper. Not one.”\n Keely could not wrap her head around that. All of her brothers and male cousins had no issue with diaper duty. “Didn’t you tell Daddy tough shit and suck it up?”\n “We fought about it, trust me. I argued that he had no issue sticking his entire arm up a cow’s rectum and being covered—and I mean covered—in cow shit on a daily basis, but he gagged at the thought of one poopy baby diaper.” She rolled her eyes. “That was his generation. Be thankful Jack is of another generation.”\n The front door opened and Jack and his mother entered the dining room, deep in conversation. Keely’s eyes narrowed. Correction. It appeared sweet Doro Donohue was ripping her son a new one.\n “You’re back just in time, daddy-to-be,” Carolyn trilled. “There’s a ton of stuff to be hauled upstairs to the nursery.”\n Jack flashed Carolyn a smile. “I’m sure Keely will want to show me everything before I become her pack mule.” He crossed the room and swept his hand over her belly as he kissed her. “You okay?”\n “My ankles are swollen. And I’m tired.”\n “Probably from a sugar buzz. How many pieces of cake did you eat?”\n “One.”\n “And how many pieces did you sneak in the kitchen?”\n She swatted at him. “None of your business. Why?”\n “Because you have a dab of frosting right here.” He licked the corner of her mouth. “Mmm. Sugary-sweet and tastes like guilt.”\n “Hey, the baby likes cake.”\n “I think my baby likes cake.” He murmured, “You know, we haven’t used frosting as body paint in a while.”\n A throat cleared behind them and they both turned.\n “Since you’ve had people in your house all day, I’m sure you two would like alone time.” Keely’s mom had moved to stand by Doro. “We’ll get out of your hair.”\n “Ready to go whenever you are,” Doro said.\n Jack frowned. “Where are you going?”\n “Out to celebrate with Carolyn, Kimi and Vi.”\n “Since Joan came to the shower she’s going out with us too,” Carolyn added. “Don’t worry. We’ve lined up designated drivers to pick us up at the Golden Boot if things get out of hand.”\n “What?” Keely and Jack said simultaneously. Then Jack demanded, “Carolyn, are you seriously taking my mother out drinking?”\n “Oh, pooh. Don’t look so shocked. This is a rite of passage for your mom; a woman becoming a grandmother for the first time. Who better to initiate Doro into that world than the McKays?”\n “She has a point, Jack,” Keely said with a laugh.\n “Don’t encourage her, Keely.”\n “I don’t need your permission to not act my age, Jack Donohue.” Doro straightened her shoulders. “And I say don’t wait up for me either.”\n The last thing Keely heard was Jack’s mom asking if Carolyn knew any single men.\n “Now I need a damn drink,” Jack grumbled, walking to the bar to pour himself a Scotch.\n Keely followed and hoisted herself onto a bar stool. “Looked like you and your mom were having an argument when you walked in.”\n “We were.” Jack uncapped the crystal decanter and poured. “Seemed her sudden need for a trip to the store to buy antacids was a trick to have a private conversation with me about my business trip tomorrow.”\n Keely glanced down at her hands.\n Then Jack’s fingers were beneath her chin, forcing her to look at him. “You told me you were okay with this trip, buttercup.”\n “I am. Or I’m not, depending on the hour.”\n He waited, those mesmerizing green eyes both patient and concerned.\n “I know it’s an important job. I know you’re only going now so you won’t have to go in the next three months. I know it’s only a week. I know I’m still three weeks from my due date.” \n","sourceLink":"https://allnovel.net/short-rides-rough-riders-14-5/page-18.html","bookId":2696,"book":{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"Storyline: \n Short Rides (Rough Riders #14.5) \n Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... \n The stories included in the Short Rides anthology are: \n King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. \n Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. \n All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?\n \n","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/short-rides-rough-riders-14-5.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:21:58 AM"}}
