{"id":71935,"no":19,"title":"Page 19","content":"\n “You know all that, but...?”\n “But there’s part of me that doesn’t want you to go. And no, I wasn’t complaining to your mother about it. I didn’t even mention it. What did she say?”\n “That I’d better not be putting work ahead of my family. My dad did that and landed himself in an early grave because of it.” His jaw tightened. “Like I needed that fucking reminder, along with all the other things that are running around in my brain.”\n “What kinds of things?”\n He drained his drink. “Too much guilt and bullshit male stuff that’d make you roll your eyes and wonder if you married a man or a whiny pussy.”\n Keely slid off the stool and cut around the end of the bar to hug him—as much as she could with beach ball baby between them. “I know you’re a man. All man. So since we’re alone, maybe you oughta prove that to me a couple of times before you leave.”\n Jack smoothed her hair away from her cheek. “You really up for this, cowgirl? It’s been a long day. You said your ankles are swollen.”\n “Then how’s about if you make my pussy swollen, so I really have something interesting to bitch about at the breakfast table tomorrow morning.”\n “God, I love you.”\n “Well, I am unbelievably charming and sexy as hell.” Keely kissed him and tugged his bottom lip between her teeth, just to see that spark of desire flare in his eyes. “We better do it all we can in the next three weeks, because it’ll be at least six weeks after baby D’s birth before we can have sex again.”\n “Does that ban on sex include anal?” he asked.\n “You are such a guy.”\n He shrugged. “Just being practical.”\n “Come on. Let’s do it on the recliner. I’ll even bring a piece of cake so you can lick frosting off my nipples.”\n One week later...\n Keely prided herself on providing a full twenty minutes of random conversation before grilling her cousin Dalton about his love life. “So what’s this I hear about you and Addie Voorhees dating?”\n Dalton shrugged. “We’re spending time together. I’ve known her forever. She’s sweet.”\n “That she is. But isn’t she—”\n “Please don’t say that you’re surprised because she’s a nice girl and totally not my type.”\n “Wow. Defensive much? That wasn’t what I was gonna say.”\n “Shit. Sorry. I’ve just heard that a lot. From everyone in town. Including several members of our family.” Dalton cocked his head and offered the dimpled grin that’d been causing him problems his entire life. “So what were you gonna ask?”\n Now that Keely thought about it...this question would probably get his back up even more. “Just that Addie and Rory Wetzler are best friends, right?”\n “They were inseparable during high school. But Rory’s been living in Laramie for the past six years. Why?”\n Keely shrugged and swigged her soda.\n “You oughta just spit out whatever’s put that cat-stealing-cream look on your face, Keely,” he drawled.\n “Fine. I just find it...odd, that you and Addie started seeing each other a couple months after Rory went to study in South America.”\n Dalton’s eyes narrowed. “Why’s that odd?”\n Because I don’t think Rory would be okay with Addie dating you. Although Keely prided herself on honesty, this was one time where she’d hedge. “Didn’t you and Rory have a thing?”\n He squirmed. Her big, bad, brawling baby cousin blushed beet red. “We’re friends. Or we were friends.”\n “What happened? Because Rory caught the bouquet at our wedding and everyone said you two were all kinds of cozied up on the dance floor after that.”\n “That was almost four years ago,” he pointed out. “A lot can change.”\n “I guess. Sierra told me Rory took a swing at you in the bar last fall before Christmas. She didn’t say why.”\n “There’s a first,” he grumbled. “Look, it’s complicated, okay? And why do you care? It’s not like Rory is even around now. Addie said Rory didn’t take issue with it when she told Rory that me’n her were dating.”\n Bullshit. “You’re probably right. Pay no attention to me. I dated Jack’s brother before we got married. Jessie was married to your brother Luke before she and Brandt got hitched, so I guess it’s not that odd.”\n “And...there it is. Another McKay family member hearing wedding bells in the distance for me long before I hear them,” Dalton said dryly.\n Keely laughed. “Guilty. Let’s change the subject. So how’d you get roped into Keely duty?”\n Dalton lifted a brow and repeated, “Keely duty?”\n “Your poker face is for shit, Dalton McKay. For the past week since Jack has been gone, everyone in the McKay family and their dog—literally—has stopped by to check on me. Like I’ll have a nervous fucking breakdown if I have to spend time alone. I have two weeks left until my due date. If this baby takes after its father, it’ll be late anyway.”\n “Well, I musta missed the McKay family memo about my rotation on babysitting bratty you. I stopped by to talk to Jack. Had no idea he was gone.”\n “Oh.” Since when was he buddy-buddy with Jack?\n He grinned. “No retort on the bratty you comment?”\n “I was practicing bein’ mature and ignoring it.”\n “With that...” Dalton stood. “Need me to do anything before I go?”\n Keely shook her head. “I’m fine.” She heaved herself out of the chair. “My butt’s asleep so I’ll walk you out.”\n A blast of heat hit her as soon as she stepped onto the front porch. The temp had hit one hundred degrees the last three days. Being nine months pregnant was miserable. Add in the August heat and, well, she had no idea how pregnant women survived before air conditioning. “Should I tell Jack you stopped by?”\n “Nope. I’ll catch him some other time.”\n Which meant Dalton had been tasked to keep her company for a few hours. Her youngest cousin had a better poker face than she’d given him credit for.\n When Keely got up at three a.m. to go to the bathroom for the two hundredth time, she had heartburn so bad she decided to try and sleep upright in the recliner in the den. But the fabric made her sweat. Even the crotch of her pajamas were wet. She shifted her hips and a trickle of water further dampened her panties.\n Great. Now I’m peeing my pants?\n The tears she’d held in all day poured out. She blubbered as she changed clothes—but her sweat pants wouldn’t stay up. She’d stretched the drawstring to the limit around her gigantic belly. So she sat on the edge of her bed, in her underwear, and cried.\n Suck it up, buttercup. Won’t be much longer and you’ll forget all this as you’re holding our baby.\n Jack’s voice in her head snapped her out of it.\n She rubbed her belly. “I’m missing your daddy something fierce. I lied when I said I’d be okay if he took this business trip. But he promised it’s the last one until you make your appearance. Which I’m hoping is soon.”\n When Keely stood, liquid trickled down her leg. A lot of liquid.\n She froze.\n She wasn’t peeing herself; her water had broken.\n “No.” This couldn’t be happening. She hadn’t meant she wanted the baby out this soon! Jack wasn’t here. She couldn’t have the baby without him. He wasn’t supposed to be here until late tomorrow night. Or wait. Was that tonight? She glanced at the clock. Four-thirty a.m.\n Jack’s last big meeting was in four hours.\n She mostly stayed out of his business, but he might throw a shit fit if she interrupted him, so she wouldn’t call him. He’d call her after he closed the deal anyway.\n Okay. She’d just...kill time for a few hours. Watch TV. No big deal. First babies took forever. At least twenty-four to thirty hours, according to all the childbirth books she’d read.\n To take her mind off everything, she stripped the bedding and tossed it in the washer.\n Good. That’d killed ten minutes.\n She ate a few bowls of chocolate-frosted flakes.\n Then she stretched out in the recliner with the TV on. She dozed off only to be awakened by a god-awful tightening in her mid-section.\n Holy fuck. Was that a labor pain?\n Nah. She probably shouldn’t have eaten half a box of cereal. And four pieces of toast. And a couple frozen waffles.\n Since the sun was up, Keely ventured outside and watered the flowers on the back deck. And the ones on the front deck. By the time she finished, the cramping in her abdomen was getting worse. Motherfucking hell, that motherfucking hurt. Then more liquid gushed out.\n She needed to go to the hospital now.\n She walked inside, grabbed her keys, walked back out and climbed in her car.\n Jack’s phone buzzed at nine-thirty, right after he’d finished his meeting. He looked at the caller ID and his entire body stilled. “AJ? What’s going on?”\n “Keely’s water broke.”\n His heart rate spiked. “When? Why didn’t she call me?”\n “Ah, that’s the thing. Hang on.” He couldn’t make out any words from the muffled voices in the background. “Sorry about that. Look, no one knows what’s goin’ on with her. She drove herself to the hospital this morning without her purse, without her hospital bag, without anything except her keys.”\n “Jesus. Is she okay?”\n “No. She also showed up barefoot, in her pajamas. So, we, ah, think she’s in some kind of shock, denial thing since you’re not here. Doc Monroe did get her admitted into a private room, but she’s refusing to see anyone.”\n “Even you?”\n “Even me.”\n Christ. He’d felt somewhat justified leaving her because she had so many family members willing to step in. Now when she needed them she was shutting them out? \n","sourceLink":"https://allnovel.net/short-rides-rough-riders-14-5/page-19.html","bookId":2696,"book":{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"Storyline: \n Short Rides (Rough Riders #14.5) \n Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... \n The stories included in the Short Rides anthology are: \n King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. \n Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. \n All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?\n \n","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/short-rides-rough-riders-14-5.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:21:58 AM"}}
