{"id":71941,"no":25,"title":"Page 25","content":"Grandpa laughed and grabbed her, throwing her over his shoulder amidst her happy shrieks. “You are gonna be some trouble little miss.” He walked over and deposited Piper on the floor. “Sit with your mama for a minute while I see what Gran-gran is doin’.” Piper scrambled onto the end of the recliner between Keely’s knees and laid her head on Keely’s enormous belly. “Hi babies.” Keely smoothed the damp ringlets from Piper’s forehead. It was doubtful almost two-year old Piper understood the concept of babies inside the gigantic bump, but she said hi to the babies at least ten times a day anyway. It’d come as a shock to learn she carried twins, especially so soon after Katie’s birth. High blood pressure complications with this pregnancy meant she’d been on bed rest since the fifth month, which wasn’t too bad since she wanted to be home with Piper and Katie anyway. Her family had pitched in to keep her company after Jack insisted someone be with her at all times. He’d cut back on his work schedule, so he was home at least part of every day. But today he’d had to drive into Rapid City for a meeting that couldn’t be handled over the phone or via email. Piper looked up at her. Those big green eyes—eyes just like Jack’s—were serious and a little devilish. “What’s that?” She smiled. “My tummy is making some loud noises. Think the babies might be hungry.” “I hungry too.” “Go ask Gran-gran for a snack. But no cookies.” “K.” Piper shot her mother a smug look before she leapt off the recliner and tore off into the kitchen. Keely wiggled in the seat, trying to get comfortable. She felt heavier today like something had shifted down low in her abdomen. Movement made her nauseous so she hadn’t done anything but sit for the last hour. Still, her heart raced like mad. Her fingers and toes tingled. Her shallow breathing increased the sensation of dizziness. This was not normal. She put down the foot rest and set her feet on the floor. Had her toes fallen asleep? She couldn’t feel the rug beneath her, just more of those sharp tingles. Her mom came around the corner carrying Katie, who immediately started saying, “Mama, Mama, Mama.” “Hey, sweet pea.” Katie shrieked and pushed away from Gran-gran, reaching for Keely desperately as if she hadn’t seen in her days, not minutes. Her mom set her down. Katie toddled over, her brown eyes teeming with tears, her blond hair sticking up in every direction. She clutched the side of the recliner. “Mama, Mama, Mama.” “I know it’s naptime and you want a story, huh?” Katie tried to crawl in her lap and Keely’s heart about broke. Katie was such a sweet, snuggly baby, but Keely didn’t have the strength to pick her up right now. “Sweetheart? Are you okay? Your face is bright red.” “No. I’d better call Jack and have him get me to the doctor.” A spike of pain hit her, like she was being ripped apart from the inside out. Then she felt a rush of wetness between her legs. Alarmed, Keely looked down expecting to see water, but blood stained her shorts. Blood. A lot of blood. Oh God. Panicked, she stood abruptly. Too abruptly. All the blood rushed from her head and she lost her balance. Black spots obscured her vision. Her mom screamed, “Keely!” Everything switched into slow motion. She knew she was going down but she couldn’t make her arms work to break the fall. Two strong arms caught her. “Whoa, girlie. I gotcha.” But she and her dad both ended up on the floor anyway. Keely couldn’t breathe. Her belly started to cramp like she’d never felt. She groaned with pain. What was happening? “Caro, call an ambulance.” Keely whispered, “No. Call Jack. Call him now.” “We will. But we’ve gotta get you to a hospital.” Her entire body shuddered with cold. Those swirling black and white spots were back. Her head felt like it was beneath a waterfall. Yet she heard Katie crying. Hysterical I-want-my-Mama shrieks. Then Piper joined in. Keely needed to get to her children to calm them down, but she couldn’t even move. Rough-skinned hands stroked her face. “Stay still. Stay with me baby girl.” She opened her mouth but nothing came out. “Caro, get the girls out of here,” her dad said sharply. The distressed cries of her daughters vanished. Keely fell into a state of nothingness until the pain came again and her entire body convulsed from the power of it. Voices rose and fell around her. She tried to concentrate on just one to pull her out of the void. Her dad’s was the loudest. “You are stayin’ here,” he snapped. “I’m ridin’ in the ambulance with her.” “But Carson that doesn’t make sense. She needs me—” “Right now those little girls need you more. And sugar, you’re close to hysterical. That ain’t gonna help her. Jack’s gonna need someone to calm him down and you’re in no shape to do it.” “And you are?” she demanded. “I have to be.” Loud noises, activity and more voices surrounded her. Then the world went black as Keely slipped into unconsciousness. All Knocked Up: Chapter Five After the phone call from Carson, Jack kept the speedometer at one hundred miles per hour as he drove from Rapid City to Spearfish. And Cam must’ve pulled some strings because no one stopped him. He’d contacted Doc Monroe but she’d already gone to the hospital in Spearfish to consult on Keely’s behalf. Then he’d talked to Keely’s mom to make sure Piper and Katie were taken care of. Keely’s sisters-in-law were on their way to take over so Carolyn could go to the hospital. He glared at the dashboard clock. It’d been forty-five minutes since he’d received the call and he was still ten miles from Spearfish. If anything happened to Keely he’d... No. Don’t go there. Just drive. Everything became a blur until he arrived at the hospital. He ran through the emergency room doors. The nurse said, “Can I help you?” “Keely Donohue. Arrived via ambulance from Sundance?” She pointed to the door marked Stairs. “They can help you on the third floor.” He scaled the stairs two at a time. Before he reached the receptionist’s desk, Carson approached him. “How is she? Where is she?” “They’re prepping her for emergency surgery.” Jack had to brace his hand against the wall to keep his knees from buckling. “I want to be with her. I need to be with her.” “You can’t be. Believe me, I asked.” Bullshit. The next medical person he saw would be taking him to Keely. “What happened?” “She stood up, blood rushed out and she passed out. The EMTs didn’t say much on the ride here.” Carson cleared his throat. “Let’s go to the surgical waiting area. Maybe they’ll have more news.” The waiting room was empty, giving Jack room to pace. He went through a checklist of a dozen things he should’ve done. And two dozen things he shouldn’t have done. Like get her pregnant again. It’d seemed funny and surreal, three pregnancies in three years. But he wasn’t laughing about it now. If she dies, it’s your fault. “God.” He wanted to punch the fucking wall. “Jack. Take it easy. You look like you’re gonna pass out.” “That’s because I can’t fucking breathe until I know if she’s all right.” A nurse in scrubs came into the room and Jack immediately loomed over her. “I want to see my goddamned wife. Take me to her now.” “Sir. Calm down.” “I will. Just as soon as someone tells me what’s going on.” “The doctor will be out here to talk to you at some point.” At some point? Why were they being so vague about where Keely was? “Not good enough. I want answers now.” “Hold it together, son,” Carson warned. Jack set his hands on the nurse’s shoulders. “I swear to Christ if something’s happened to her and you people are—” “Sir. Let me go or I’ll have security remove you from the premises.” Shit. He hadn’t even realized he’d grabbed her. He stepped back, embarrassed as well as angry. “Sorry.” But she’d already stormed off. Then Carson was in his face. “This ain’t helpin’ anyone, least of all you. So sit the hell down and shut the fuck up.” Harsh words. Jack’s response was just as harsh. “And you’d sit in the corner like a fucking lap dog if Carolyn was behind those goddamned doors?” “No. I’d’ve already ripped the doors off the hinges. But I’m askin’ you to be the better man than me, Donohue. Keely is gonna need you there by her side when she comes out of this.” If she comes out of it. If she’s all right. Carson poked him in the chest. “Get that look off your face. I will not allow myself to imagine anything but good goddamned news coming through those doors and you’d better not either.” He paused. “Because I’m havin’ a hard time breathing myself.” They stared at one another. “Fine. I’ll sit.” That lasted for about five minutes. Jack got up and paced. His brain tossed out all sorts of fucked-up theories that he wished would just stop. Carson stayed close by his side. When he wasn’t staring aimlessly out the window. Jack felt every single tick of the clock in a slow drip of time eating away at his patience. It was the most excruciating sixty-seven minutes of his life. The doors opened and he was on his feet before they closed. Doc Monroe, in blue scrubs, stood next to another woman in blue scrubs. “How is Keely?” The other doctor said, “She had a placental abruption.” Then she launched into an explanation of what it was and added that she suspected Keely had suffered from preeclampsia, which had Jack seeing red because he wanted to know how the fuck his wife was doing, not be subjected to a lesson on medical terminology.","sourceLink":"https://allnovel.net/short-rides-rough-riders-14-5/page-25.html","bookId":2696,"book":{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"Storyline: Short Rides (Rough Riders #14.5) Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... The stories included in the Short Rides anthology are: King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/short-rides-rough-riders-14-5.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:21:58 AM"}}
