{"id":71923,"no":7,"title":"Page 7","content":"So Edgard was really looking forward to the next three days and nights. Trevor tucked his body behind Chassie’s. He reached for Edgard, threading their fingers together and resting their joined hands on the pillow above Chassie’s head. All was right with his world and he let sleep overtake him. Rough Road: Chapter Two The next morning Chassie had finished packing Westin’s lunch when Edgard wandered into the kitchen. He gave her the brilliant, sexy grin that still weakened her knees. “Mornin’, beautiful.” “Mornin’ yourself, sleepyhead. Why aren’t you helping Trev with the feeding?” “He said he had it handled.” Edgard poured himself a cup of coffee. Chassie glanced at the clock. “Why aren’t the kids up? Westin is gonna miss the bus if we don’t leave in ten minutes.” “He says he’s got a stomachache and he’s not goin’ to school today.” Her gut clenched. “Because of what was said to him at school yesterday?” “No.” Edgard curled his hand around her face and pressed a gentle kiss on her lips. “He did have a pained look, so I tucked him back in bed. Didn’t see a reason to wake the other kids up.” “I should go check on him.” “Chass. Baby, I just did.” He kissed her again and stepped back to sip his coffee. “Did you deal with the goats this morning?” “Yep.” She refilled her coffee cup and looked around the kitchen. Seemed weird the kids weren’t up. Mornings were chaotic, but also her favorite part of the day. “I think...” She heard a noise and leaned over to look out the window. A car she didn’t recognize had started up the driveway. “Who on earth is dropping by at seven-thirty in the morning?” The car parked next to the mini-van and a beautiful brunette stepped out. Her hair and makeup perfect; her clothing stylish and unwrinkled. “Omigod. What is my cousin Ramona West doin’ here?” Without waiting for Edgard to respond, Chassie raced out of the house. Ravishing Ramona paused at the edge of the walkway leading to the front door. She grinned and threw open her arms. “Look at what the cat dragged in all the way from Seattle!” Chassie hugged her. “You look fantastic, as usual.” “So do you. I see your men are taking great care of you.” “Always. So you could’ve warned me you were comin’ for a visit.” “Nope, that would’ve ruined the surprise.” “What surprise?” The front door to the house opened, disgorging all three of their kids, who were jumping on Ramona like eager puppies. Chassie’s eyes narrowed at Westin. “Someone wanna tell me what’s goin’ on?” Max was running around yelling, “Surprise, Mama, surprise!” “What surprise?” she repeated. Trevor’s hands were on her shoulders and Edgard flanked her. “The surprise that Ramona is here to stay with the kids for the weekend while we whisk you off to celebrate our anniversary.” Westin grinned. “Had you fooled, huh Mama? You thought I was really sick.” She ruffled his hair, happy to see him smiling after last night’s conversation. “Yes. So you were all in on this?” “Uh-huh.” Sophie giggled. “I’m a good secret keeper.” “That you are.” Chassie looked over and saw Edgard’s truck backed up to the side door and luggage piled in the back. “How long have you two had this planned?” “About a month,” Edgard said. “We asked Keely if she’d take the kids for a weekend, and she mentioned it to Ramona, who had planned to be in Wyoming next week anyway. So she volunteered to come early.” Ramona leaned over and whispered, “Three days of nonstop loud sex with these two hotties who worship you? I’m more than a little jealous, cuz.” She scooped Max up and perched him on her hip. “I see the ‘why would a single woman volunteer’ question in your eyes and the truth is, I fear my brothers will never get married and give me nephews and nieces, so I’m co-opting the Glanzer kids as mine.” Trevor grinned. “Works for us since my family has disowned me and Ed’s family is in Brazil. Oh, right, they disowned him too.” “People are stupid. Family is family. I hardly ever get to see Nick and Holly’s kids, or Blake and Willow’s boys. Boone is all grown up now—I can’t believe he’s a senior in high school. And our McKay cousins...they’ve already got ten million aunts and uncles. So the price of my child care duties is this: I expect to be called Aunt Ramona from here on out.” “Yes, Aunt Ramona,” Westin said. “But we already call Keely Aunt Keely,” Sophia added. “And India Aunt India—” “Forget I asked to be special.” “You are special,” Westin insisted. “And you are the sweetest boy in the world.” Ramona kissed his cheek. “We are gonna have some fun this weekend.” “So are we.” Edgard aimed Chassie a hot look that made her belly swoop. “You’ve got five minutes to get your toiletries packed and say goodbye to the kids before we hit the road.” He shook his head when Chassie opened her mouth. “And don’t ask where we’re goin’.” “Just be ready,” Trevor added and lightly smacked her ass. “But who’s taking care of the livestock?” “Colt,” Edgard and Trevor said simultaneously. “We’ve got it handled. You’re wasting time, woman.” “Fine.” Chassie raced inside and tossed her bathroom stuff in a bag. What had the guys packed for her? Should she check to see they’d packed enough? Don’t worry about it. Chances are high you’ll be nekkid most the weekend anyway. And she couldn’t wait. Six hours later they’d reached their destination—a remote cabin in Montana. Trevor hoisted the last cooler out of the pickup bed. He and Edgard had decided it’d be easiest to haul food with them, rather than trying to find a grocery store in the middle of nowhere. The last thing he wanted to do on this rare getaway was spend time buying groceries. Inside the cabin, Edgard was putting the food away. He glanced over his shoulder at Trevor and grinned. “This is a great place. Where’d you find it?” “A couple guys I knew came up here huntin’ every fall. Lucky for us this is this weekend before the season opens. Where’s Chass?” “In the bedroom, checking to see what we packed for her.” “That oughta take her all of two minutes.” Trevor cut through the large living area to the hallway leading to the bedrooms. The master suite had a king-sized bed and a sitting area. He gave the windows that overlooked a small meadow a cursory glance before tracking Chassie to the master bath. The walk-in slate shower was enormous—perfect for three. Trevor leaned in the doorframe, watching Chassie paw through the toy bag. Without looking up, she said, “Will we really need three vibrators this weekend?” “Guess we’ll have to wait and see. Better to have too many than too few. And you, my sweet, darlin’ wife, have too many clothes on. Strip.” Chassie rolled her eyes and then she brushed past him, setting the bag of sex toys on the floor. Trevor followed her, stopping at the end of the bed. Edgard moved in behind him, resting his chin on Trevor’s shoulder. “You heard him. Ditch the clothes.” She whirled around. “But we’ve only been here fifteen minutes.” “Then we’ve already wasted five of those minutes.” Trevor’s heart thumped when Edgard’s hand splayed across his lower belly. “This retreat is to celebrate ten years of marriage and eight years of our commitment to Ed. Now we’re a family, but I wanted us to reaffirm to each other what we are to each other.” “There’s more to what the three of us are to each other than awesome sex partners,” Chassie shot back. “But sex is part of who we are, and sometimes that connection gets lost in ranch chores, raising kids and other day-to-day stuff,” Edgard said. “And I, for one, am very curious as to what our Trevor has planned for us.” Chassie smirked. “Me too. No doubt Mr. Bossy will tell us in explicit detail.” Trevor raised an eyebrow. “I believe Mr. Bossy already told you to strip.” “Maybe you oughta disobey him,” Edgard drawled, “’cause I surely would like to see some red marks across your ass. Been a while, hasn’t it?” “That’s a great idea, Ed. Did you pack a crop?” “Yep.” “That’s a terrible idea,” Cassie grumbled. “I’m stripping, see?” She whipped her sweatshirt off, then her tank top. Trevor loved that she hadn’t worn a bra. She pushed her jeans and plain white panties down her legs, kicking them aside. Naked, she propped her hand on her hip. “Now what?” “Watch.” Edgard’s hand moved and unbuttoned Trevor’s jeans. His deft fingers slid the zipper down. One tug and Trevor’s jeans and underwear fell to his knees. Trevor shifted impatiently and kicked them off completely. Chassie’s demeanor changed as she watched them. Something had changed with Trevor too; his cock was fully erect. Edgard’s hand gripped the base of Trevor’s cock and stroked up, adding that twist at the end that had Trevor clenching his butt cheeks together. “I thought I was in charge,” Trevor said. “You are,” Edgard breathed in his ear sending a wave of want through him. “Tell me to stop.” Right. Like that’d happen. “Didn’t think so,” Edgard breathed again. “Tell us what you want.” Trevor crooked his finger at Chassie. “On your knees.” She was in front of him in an instant.","sourceLink":"https://allnovel.net/short-rides-rough-riders-14-5/page-7.html","bookId":2696,"book":{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"Storyline: Short Rides (Rough Riders #14.5) Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... The stories included in the Short Rides anthology are: King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/short-rides-rough-riders-14-5.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:21:58 AM"}}
