{"id":94149,"no":43,"title":"Page 43","content":"\\n\\n Her words made that heart beat a little faster. She still looked like Susie, but she was a Vampire now. I needed to remember that.\\n\\n “You don\u0027t have to be afraid of me,” Susie said, and I heard the hurt in her voice, the disappointment.\\n\\n “I\u0027m sorry.”\\n\\n “It\u0027s all right. I guess I can\u0027t blame you.”\\n\\n “What was it like, hunting with Rafe?” Even as I asked the question, I couldn\u0027t stifle a twinge of jealousy because Susie had shared a part of Rafe\u0027s life that I never would.\\n\\n “So much different than I thought it would be. I didn\u0027t think I could do it, drink blood, but he made it easy.”\\n\\n “Wasn\u0027t it disgusting?”\\n\\n Her gaze slid away from mine. “It should have been, but it wasn\u0027t. It was…pleasant.”\\n\\n Pleasant? Pleasant! I didn\u0027t know what to say to that. A day at the beach was pleasant. Spending time with your loved ones was pleasant. Getting a full-body massage was pleasant. But drinking blood? No way!\\n\\n Silence fell between us. It wouldn\u0027t have bothered me before, but it bothered me now. I wondered what Susie was thinking, couldn\u0027t help being somewhat amazed that she had adjusted so quickly to being a Vampire when she\u0027d had so much trouble being a Werewolf. The absurdity of it all made me want to laugh and cry at the same time. Susie\u0027s life would never be the same again; but then, neither would mine now that I had pledged my life and my love to Rafe.\\n\\n “At least the four of us can still be friends,” I said, thinking aloud. After all, I didn\u0027t really have any other friends in town, certainly none Rafe and I could share an evening with.\\n\\n “That\u0027s true, isn\u0027t it?” Susie remarked with a win-some smile. “I won\u0027t have to pretend with you, or make excuses about why we can\u0027t go to lunch.”\\n\\n I grinned at her. “Right.” I suddenly felt a lot better. Maybe everything would work out after all.\\n\\n But later that night, curled up on the sofa, hovering on the brink of sleep, I wondered if I had made the right choice in deciding to stay with Rafe. I loved him, loved everything about him, but now tiny doubts insinuated themselves into my thoughts. In choosing to stay with Rafe, I had distanced myself from my family. I would never have children or grandchildren, never cook a big Christmas dinner for my husband and kids, and while I didn\u0027t want kids right now, I had hoped to have one or two in the future. After all, I was only twenty-three years old. I still had a few good years left in me….\\n\\n I shook off my doubts. I had made my choice, and I would make the same one again.\\n\\n Yawning, I checked the time. It was almost two. “The guys will be here any minute,” I said, switching off the TV.\\n\\n “I can\u0027t decide if I\u0027m relieved or disappointed that nothing happened,” Susie said. “I sort of expected Edna and company to show up any minute.”\\n\\n “I know what you mean. Maybe we should just leave town, now, tonight.”\\n\\n “Don\u0027t you think they\u0027d come after us?”\\n\\n “I don\u0027t know. Actually, I\u0027m surprised they didn\u0027t leave town. We should have gone to the police and pressed charges.” Funny, none of us had thought of it earlier.\\n\\n “Do you think they would have believed us?”\\n\\n I shrugged. The police weren\u0027t known for being sympathetic to the Supernatural community, or to those who associated with them. “It doesn\u0027t matter now.”\\n\\n “Edna and Pearl must have some powerful friends somewhere,” Susie said thoughtfully. “I mean, how else did they get our pictures on the news? For that matter, how did they get our pictures, period?”\\n\\n “Beats me. They must have taken them while we were drugged.” Now that I thought about it, we\u0027d all looked sort of spaced-out in the photos. Hopefully, the national news media wouldn\u0027t pick up the story. “I\u0027ve been wondering about something else, too.”\\n\\n “What\u0027s that?”\\n\\n “How did two elderly women who aren\u0027t doctors convince the Oak Hollow police chief that we were infected with some mysterious virus?”\\n\\n “Maybe the police are in on it, too.”\\n\\n Now there was a scary thought. “You might be right,” I said, warming to idea. “Being a police officer would be the perfect cover for a hunter. The cops can come and go pretty much as they please, poke into other people\u0027s business, snoop around at any hour of the day or night without arousing suspicion, lock up anyone they want for twenty-four hours without a warrant.”\\n\\n Susie nodded in agreement and then, for no reason that I could see, she sat up straighter, her body tensing as she stared at the front door.\\n\\n “What is it?” I asked. “Are the guys here?”\\n\\n “No.” She stood up, and I saw her eyes begin to change.\\n\\n I felt a whisper of power flow through the room as Susie\u0027s eyes took on a reddish glow.\\n\\n “It\u0027s Travis Jackson,” she said, “and he\u0027s not alone.”\\n\\n Chapter Twenty-Eight\\n\\n A sudden rush of adrenaline had me jumping to my feet. This was the visit we had been waiting for, but now that it was here, I suddenly found myself wishing I was anywhere else. I had no Supernatural powers at my command, no weapons with which to protect myself. Why hadn\u0027t I bought a gun? But then, I had never thought I would need to defend myself against my own kind. I remembered telling Rafe earlier that I had Susie to protect me, but looking at her now, even with her eyes red and glowing, she didn\u0027t seem like she would be much help. She was shorter than I was and slender as a willow. And she had been a Vampire only a couple of days. Maybe that didn\u0027t make any difference; maybe Vampires came equipped with all their powers immediately on being turned. And maybe they didn\u0027t. Why hadn\u0027t I asked Rafe about that sooner?\\n\\n I froze as someone knocked on the door. There was no point in pretending we weren\u0027t home. The lights were on, smoke would be visible rising from the chimney.\\n\\n “I\u0027ll get it.” Susie was moving toward the door as she spoke.\\n\\n My gaze darted around the room as I searched for a weapon. When this was over, if I survived, I was buying a gun! Since I didn\u0027t have one now, I grabbed the fireplace poker and held it behind my back just as Susie opened the door.\\n\\n “Susie.” Jackson\u0027s voice was filled with wry amusement. “I didn\u0027t expect to find you here, but it saves us a trip, doesn\u0027t it?”\\n\\n “What do you want, Travis?” Susie asked.\\n\\n “I think you know.” He looked at her a moment, his eyes narrowing. “Vampire?” he murmured, looking momentarily confused.\\n\\n “We\u0027re not going back,” she said. “Your serum doesn\u0027t work.”\\n\\n “That\u0027s why we need to try again.” His hand delved into his jacket pocket and reappeared with a small glass vial. “I don\u0027t want to hurt you.”\\n\\n “Really? Is that why you kidnapped me, locked me in a cage, and stuck a needle in my arm?”\\n\\n From where I stood, I could see his jaw tighten. “Let\u0027s do this the easy way, shall we?” he asked, and threw the contents of the bottle into her face.\\n\\n Susie reeled backward, an inhuman shriek of agony hissing from her throat. I watched in horror as the skin on her face and neck began to blister. Holy water, I thought.\\n\\n The two men behind Travis lunged forward. Grabbing Susie by the arms, they wrestled her to the ground, flipped her onto her stomach, and cuffed her hands behind her back.\\n\\n Shouting, “Leave her alone!” I lifted the poker and slammed it across the back of the nearest man as hard as I could.\\n\\n He let out a roar of pain as he rolled away from Susie.\\n\\n I was lifting the poker to hit the other man when Travis came up behind me. He jerked the poker from my grasp, then backhanded me across the face. I reeled backward, my cheek burning from the force of his blow, my eyes watering.\\n\\n I heard someone let out a shriek filled with pain and terror. I blinked to clear my vision, and when I looked again, I saw one of the men who had been holding Susie sprawled on his back on the floor, a bloody hole where his throat had been. The man I had hit was frantically trying to crawl toward the front door, but the angry Were-tiger biting his leg wouldn\u0027t let go.\\n\\n Travis Jackson stood with his back against the far wall, his eyes wide with fear as he stared at Rafe.\\n\\n I stared at him, too. This was Rafe, my Rafe, I told myself, but it was hard to believe. Clad in black from head to foot, his eyes blazing like the fires of hell, he looked like the angel of death come to call.\\n\\n Travis shook his head as Rafe\u0027s hand closed around his throat. “No,” he gasped. “Please, no.”\\n\\n “Only brave when you\u0027re on the winning side?” Rafe\u0027s voice was as cold and unforgiving as the grave. “You\u0027ll never hurt me or mine again.”\\n\\n All the color drained from Travis Jackson\u0027s face. “Please.” His voice was little more than a hoarse whimper. A dark stain spread over the front of his trousers, filling the air with the strong scent of urine as he begged for his life. “Please.”\\n\\n I must have made a noise of some kind, because Rafe turned his head to look at me, his eyes glittering. He was every inch a Vampire now, more powerful and frightening than I had ever seen him.\\n\\n I looked at him, my heart pounding. Don\u0027t do this. The words rose in my mind. Please don\u0027t do this. I couldn\u0027t bear the thought of watching Rafe kill Travis Jackson. I knew Rafe wanted the man dead, and maybe Jackson deserved to die for what he\u0027d done, but not like this.\\n\\n Rafe\u0027s hand tightened around Travis Jackson\u0027s throat. I could feel Rafe\u0027s struggle as he fought down the urge to kill Jackson. Because of the blood bond between us, I knew what Rafe was thinking, feeling. The desire for vengeance, the lust for blood, and the urge to surrender to what he was burned strong within him.\\n\\n And yet, for my sake, he fought it back. I saw it in the fading red glow in his eyes and in the gradual relaxing of his grip on Jackson\u0027s throat, though he didn\u0027t release him completely.\\n\\n “Jackson, look at me.”\\n\\n Travis lifted his fearful gaze to meet Rafe\u0027s.\\n\\n “You don\u0027t deserve it, but I\u0027m going to let you live.” Rafe\u0027s gaze locked with Jackson\u0027s. “You\u0027re going to go back to Texas. You\u0027re going to forget everything you ever knew about hunting, about Supernatural creatures, and about the formula your grandmother concocted. No matter what anyone says to you, you will never remember any of this. To try to do so will cause you unbearable pain. You will forget everyone in this room, everyone that was in the lab. When you leave here, you will forget this place. You will go home and destroy any and all records and photographs that have anything to do with the Supernatural community, and then you will destroy any and all records, correspondence, and photos held by Edna or your grandmother or the school in Texas. Do you understand?” \\n\\n","sourceLink":"https://allnovel.net/night-s-master-children-of-the-night-3/page-43.html","bookId":2301,"book":{"id":2301,"title":"Night\u0027s Master (Children of The Night #3)","description":"Storyline: Night\u0027s Master (Children of The Night #3) \\n Passion Has a Darker Side... \\n Kathy McKenna was sure that the little Midwestern town of Oak Hollow would be isolated enough for safety, but the moment the black-clad stranger walked into her bookstore, she knew she was wrong. Raphael Cordova exudes smouldering power, and his sensual touch draws Kathy into a world of limitless pleasure and unimaginable dangers. \\n Oak Hollow was supposed to be neutral territory for supernatural beings. Instead it has become home to an evil force determined to destroy them—and kill any mortal who gets in the way. As leader of the North American vampires, Raphael has always put duty first, but then, no women ever enthralled him the way Kathy does. And as the enemy\u0027s terrifying plan is revealed, Raphael\u0027s desire could be a fatal distraction for all his kind, and for the women he has sworn to love forever.\\n","cover":"https://allnovel.net/images/night-s-master-children-of-the-night-3.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-master-children-of-the-night-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:05:53 PM"}}
