{"id":68974,"no":22,"title":"Page 22","content":"\"The Mitchell is leaving in the morning?\"\n Once more Steve’s question was directed to Rush as he chose to ignore Lindy.\n Rush nodded.\n The two men stood not more than ten feet apart and glared heatedly at each other, issuing silent challenges. Steve broke away first, picked up his seabag and headed toward the door.\n \"I’ll leave you two alone.\"\n \"It would be appreciated,\" Rush answered.\n Steve turned back to face his friend and Lindy couldn’t remember when his dark eyes had been more intense. \"You hurt her, Callaghan, and you’ll answer to me personally.\"\n The tension in the room was so electric it was a miracle lightning didn’t flash from the ceiling. It seemed to arc and flow between the two men, ready to ignite at any moment.\n \"I thought you knew me better than that,\" Rush answered through clenched teeth.\n \"I don’t trust anyone. Not anymore. Just remember what I said. If Lindy’s ever unhappy, I’m going to hold you responsible.\"\n A throbbing, wounded silence filled the room after the front door slammed. Lindy sat on the davenport and forcefully expelled her breath. \"What is his problem?\"\n \"When was the last time you saw your brother?\" Rush wanted to know, taking the seat beside her and reaching for her hand.\n \"About a year and a half ago. Steve and Carol drove to Minneapolis when Steve was on shore leave. They were so much in love and so happy, we were all stunned when a few months later we got a letter that said he’d filed for divorce. We never knew why. I think he would have told me had I asked, but I never did. What happened between him and Carol is their business.\"\n \"The divorce changed him,\" Rush explained softly.\n \"You’re telling me. But his letters were never like this. He was always so encouraging, so upbeat. When he heard what happened with Paul, his letter helped me so much. He understood so well what I was going through, but now I feel like I hardly know him.\"\n \"He’s upset,\" Rush answered after a moment. \"He’ll come around once he has time to think things through. He knows us both, probably better than anyone else.\"\n Lindy nodded. \"I’m not fickle and my brother knows that. I didn’t marry you on the rebound. I swear that, Rush. I love you.\"\n Rush’s face broke into a slow, relaxed grin and he draped his arm over her shoulders. \"And I love you, wife.\"\n Lindy tucked her head beneath his chin and snuggled into his warm embrace, cherishing the closeness they shared. She didn’t expect anyone else to understand something she couldn’t explain herself. Finding Rush was like stumbling upon her other half. With him she was whole.\n \"What went wrong with Steve and Carol?\" Lindy asked quietly as her thoughts drifted back to her brother. She was concerned about the changes she saw in him.\n Rush was silent for a long moment. \"I’m not sure. Like you, I felt it was his and Carol’s business, but I’m almost certain she was unfaithful.\"\n \"No way.\" If Lindy knew anything about her ex-sister-in-law it was that gentle, sweet Carol would never cheat on Steve. \"She just isn’t the type.\"\n \"Then I haven’t any idea what went wrong.\"\n \"How sad,\" Lindy murmured. It was obvious to her that Steve had changed drastically since his divorce. Although she couldn’t believe Carol had been unfaithful to her brother, that would explain Steve’s statement about not trusting anyone anymore.\n \"I think we could both learn a valuable lesson from what happened with your brother’s marriage,\" Rush said, his voice tightening.\n \"What?\" Lindy asked, and raised her head to study her husband’s face. His eyes had darkened slightly and she wasn’t able to read his thoughts, but she had a good idea what he was thinking. And she didn’t like it. Not one damn bit. \"Are you going to start lecturing me, Rush Callaghan?\"\n \"Lecturing you?\"\n \"Yes. I have a fair idea of what you’re going to say.\"\n The muscles of his face relaxed into a half smile as he leaned against the back of the davenport and crossed his arms. His knowing eyes came alive with mischief. \"Oh, you do, do you?\"\n \"You were about to give me some dopey line about what we’re experiencing now being some kind of euphoric stage all lovers go through.\"\n \"I was?\"\n \"Yes, you were. You were going to say we’re experiencing a time when everything and everyone is perfect. There’s no one else on the planet but us and nothing else but our newly discovered love.\"\n Rush’s brows arched, but if he was portraying anything other than amusement, Lindy couldn’t tell.\n \"And…\"\n \"There’s more?\" he asked, and laughed, his rich baritone sounding relaxed and amused.\n \"Oh, I’m just getting to the good part.\" She stood and rubbed the palms of her hands together, sorting through her thoughts.\n \"Well?\" he pressed, having trouble disguising his amusement.\n \"You’re about to tell me that the tension is gone. We’ve stepped over the line, entered the bedroom and now that territory has been charted.\"\n \"Not as much as I’d like, but we’ll make up for lost time later.\" Rush’s words were more promise than comment.\n \"Don’t interrupt me.\"\n \"Sorry.\" He didn’t look the least bit repentant.\n \"You’re going to tell me we’re about to step off cloud nine and should expect to be hit with a healthy dose of reality. We could be headed for trouble now. If we aren’t careful, what happened to Steve and Carol could happen to us.\"\n All traces of amusement faded from Rush’s eyes and his face tightened. Lindy knew she was right. \"By this time tomorrow, you’ll be gone.\" She forced herself to offer him a brave smile. \"And I’m going to be alone.\"\n Rush stood. His eyebrows were pulled down into a heavy ledge of concern. \"That’s right, Lindy. Up until this point everything’s gone smoothly for us. Our whole world has been telescoped into a two-part universe. After tomorrow everything will change, and I doubt that it’ll ever be exactly the same again. In two weeks you could be wondering how you ever imagined yourself in love with me.\"\n \"That will never happen.\" She shook her head hard for emphasis.\n \"In two months, you’ll have forgotten what I look like.\"\n From his narrowed, tight expression, Lindy knew he wouldn’t listen to any denials. She hadn’t started this conversation to argue with him. The last thing she wanted was for them to spend their remaining hours fighting.\n \"You’re married to a man you hardly know who’s going to be leaving you for half a year. The next time I see you, it’ll be close to Christmas.\"\n She crossed her arms and cleared her throat loudly. \"Have you finished?\"\n \"Finished what?\"\n \"Your lecture.\"\n \"Lindy, I’m serious. I – \"\n \"You’re not saying anything I haven’t already thought about a hundred times. I love you, Rush, and I’ve never been more sure of anything in my life. My feelings aren’t going to change in ten days or ten years.\"\n Tenderly he wrapped her in his arms then, and held her close. If there was anything more he wanted to tell her, he left it unsaid.\n Hours later Rush lay on his back in bed with Lindy nestled, sleeping, in his arms. He hadn\u0027t been able to sleep, dreading the thought of leaving her. Getting married the way they had was possibly the most irresponsible thing he’d done in his life. But he didn’t care. Given the same set of circumstances he’d marry Lindy again. Gladly.\n She astonished him. She was so sure, so absolutely confident they’d done the right thing. Her unwavering trust had been contagious. God knew, he’d wanted her badly enough. Steve seemed to think he’d taken advantage of her, and perhaps he had, but that couldn’t be changed now. Lindy was his wife, and by all that he considered holy, he planned to be a good husband to her.\n He closed his eyes and inhaled the fresh scent of jasmine and perfume that was Lindy’s alone, knowing full well that within a few hours he would be walking away from her.\n Rush thought his heart would burst with the love he felt for his wife. He softly kissed the crown of her head, cradled in the crook between his neck and shoulder.\n Lindy Callaghan was some kind of woman. They’d made love together, their bodies moving in perfect synchronization, as though they’d been married for years. All afternoon and evening, they’d teased and played lovers’ games, pretending they had forever. But it wasn’t enough. Not nearly enough. Rush wanted her again. Now. But he had the feeling making love to her a thousand times wouldn’t be enough to satisfy him.\n Lindy woke from a sound sleep when Rush pushed the thin fabric of her nightgown aside, his fingers light and quick. She hardly felt his movements until his mouth closed greedily over her nipple. She sucked on her bottom lip to keep from whimpering as the hot stab of pleasure pierced her. Her head ground into the pillow with every moist stroke of his tongue. And when his teeth gently tugged at the raised peaks of her breasts, it felt as if he were pulling at a thread that was linked to the heart and heat of her womanhood. She moaned anew at a pleasure so intense it was akin to pain, and still Rush sucked at the pebbled hardness. Again and again, like a butterfly flitting from flower to flower, he sampled the sweetness of the nectar from her breasts until he was pleasurably sated.\n When she was sure she was about to melt with liquifying, pulsating need, Rush lifted his head. He lay on his side and slid his hand down the smooth length of her stomach until his caressing fingers tangled in the nest of wispy hair. He paused.\n Lindy stopped breathing as his fingers slowly delved deeper, charting fresh territory as they sought the opening to the moist warmth. With his probing finger inside her, Lindy lifted her bottom and rotated her hips, saying without words what she wanted. Rush’s mouth returned to her nipple and the hot cord of pleasure joining her breasts and the core of her womanhood was drawn even tighter as he connected the two ends.\n When he had nearly driven her to the limits of sanity, Rush moved his body over hers. In one unbroken action, he entered her.\n They both gasped at the strength of the undiluted pleasure.\n Their eyes met and locked in the darkness. He was buried as deeply inside her as he could go, and still he didn’t move. Lindy felt his limbs tremble as he struggled to gain control of his raging desire. She moaned in protest and squirmed beneath him, grinding her hips against him until he cried out her name in an agonized plea.\n \"Honey… please… don’t do that.\"\n \"I can’t help it.\" Once more she raised her bottom enough to experience the intimate friction she craved so desperately.\n \"Lindy.\" He hissed her name again through clenched teeth. \"For pity’s sake, don’t…. Every time you do that… oh, Lindy---\"\n She gazed up at his tortured face and lifted her head to kiss him. He responded by thrusting his tongue in her mouth while all ten fingers tunneled through her hair. \n","sourceLink":"https://allnovel.net/navy-wife-navy-1/page-22.html","bookId":1956,"book":{"id":1956,"title":"Navy Wife (Navy #1)","description":"Storyline: \n Navy Wife (Navy Series #1) \n Impulsive, wounded, vulnerable, Lindy Kyle was unprepared for a roommate like Rush Callaghan. Strong, sensitive and sexy, the temporarily dry-docked naval officer was everything she\u0027d ever dreamed of in a man…in a husband. \n But Rush placed duty to his country above all else. Though he and Lindy were swept away on a tide of passion, he was called back to sea. They say absence makes the heart grow fonder—but will their marriage survive their partings?\n \n","cover":"https://allnovel.net/images/navy-wife-navy-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-wife-navy-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:11:32 AM"}}
