{"id":68977,"no":25,"title":"Page 25","content":"Now all he had to worry about was if she was pregnant. Not using any protection had been a conscious decision on his part. They hadn’t even talked about it the way couples should – hadn’t discussed the possibility of starting a family so soon. It wasn’t that Rush had been so eager for Lindy to get pregnant, he realized with a flash of insight. But he hadn’t wanted a repeat of what had happened with Cheryl. If Lindy’s stomach was swollen with a baby when he returned, he didn’t want any question in his mind about who was the father.\\n\\n Rush refused to believe he’d actually done anything so stupid as to play that sort of silly mind game. Lindy wasn’t going to cheat on him – he refused to even consider the possibility. But then he’d honestly assumed she loved him, too – the same way he loved her. It hadn’t even taken her a month to forget him.\\n\\n Lindy let herself into the apartment and stopped when she found her brother sitting in front of the television, watching a late afternoon talk show. Steve’s behavior was really beginning to concern her. He’d been assigned shore duty, and when he wasn’t working he sat around the apartment with a lost, tormented look that reminded her of how she’d felt when she’d first arrived in Seattle. His behavior wasn’t the only thing that was getting on her nerves. He’d become so cynical and so sarcastic about life. His thinking seemed so negative that she didn’t like to talk to him anymore. There’d been a time when she’d admired him for the way he’d handled the emotional trauma of the divorce, but his letters had been a convenient front. It became clearer every day that the healing process hadn’t even started in Steve. He still loved Carol, and he needed to either patch things up between them or accept the divorce as final. Otherwise it was going to ruin his life.\\n\\n \"Hi,\" she said, and walked into the kitchen, setting down the grocery bag on the counter. \"What’s Donahue got to say today?\"\\n\\n \"Who?\"\\n\\n \"The guy whose program you’re watching.\"\\n\\n \"Hell, I don’t know. Something about nursing mothers.\"\\n\\n \"And that interests you?\"\\n\\n \"It’s better than staring at some stupid game show.\"\\n\\n \"It’s a beautiful day. You should be outside.\"\\n\\n \"Doing what?\"\\n\\n Lindy sighed. \"I don’t know. Something. Anything.\"\\n\\n Steve stood and came into the kitchen. \"Do you want me to do something for dinner? Peel potatoes, that sort of thing?\"\\n\\n She thanked him for his offer with a smile. \"I’ve got everything under control.\" Opening the refrigerator, she set the milk inside and decided now was as good a time as any to wade into shark-infested waters. \"Is Carol still living in Seattle?\" Lindy asked the question and then turned to face her brother.\\n\\n \"Carol who?\"\\n\\n His words may have been flippant, but he couldn’t disguise the instant flash of pain in his eyes.\\n\\n \"Carol Kyle, your wife.\"\\n\\n \"Ex-wife,\" he corrected bitterly. \"As far as I know she is.\"\\n\\n \"I think I’ll give her a call.\"\\n\\n A year seemed to pass before Steve answered. \"Before you start meddling in someone else’s troubles, you’d better take care of your own, little sister.\"\\n\\n Lindy’s heart flew upward and lodged in her throat. \"What do you mean by that?\"\\n\\n Steve pointed toward the mail that was stacked on the kitchen table. \"You must have put the wrong address on that long letter you’ve been writing all month to Rush, because it’s been returned.\"\\n\\n \"Oh, no.\" A sickening feeling invaded her limbs and her eyes widened with dread. \"Returned? But why?\" She reached for the thick manila envelope and checked the address. \"Oh, Steve, what will Rush think if he doesn’t get any mail from me?\"\\n\\n \"The only thing he can assume under these circumstances. That you married him on the rebound and regret it.\"\\n\\n She raised her hands in a gesture of abject defeat. \"But I don’t feel that way, not at all.\"\\n\\n \"Lindy, sit down. You look like you’re about to faint.\" Her brother pulled out a chair and carefully lowered her into it. He walked a couple of times around her, as though gathering his thoughts on how to handle the situation.\\n\\n Tears of frustration were hovering just beneath the surface. She’d faithfully written Rush each night, pouring out her heart to her husband, reassuring him each day how much she loved him and how proud she was to be his wife. She’d written about meeting the other wives and told him about the social get-together they were planning to celebrate the halfway mark of the six-month cruise. She’d drawn a picture of the lacy silk nightie the girls had given her as a wedding gift and told him how eager she was to model it for him.\\n\\n There were weeks when she’d scribbled long epistles as many as six and seven times. Since the mail was only going to reach him once a month, Lindy had written it in journal form, marking the days.\\n\\n To her surprise, this long separation wasn’t anything like he’d suggested it would be. Rush had warned her that two weeks after he was gone she’d start to wonder how she ever imagined herself in love with him. Two weeks from the day he left, Lindy had made a giant card to tell him exactly the opposite had happened. If anything she loved him more than ever.\\n\\n Over and over she had read the thick letter she’d received from him, until she had set each precious line in her memory. Rush’s letters had been her lifeline to sanity.\\n\\n The realization that he had received only a short one from her early after he sailed out of Bremerton, if that, was almost more than she could bear thinking about.\\n\\n \"What are you doing?\" Steve asked, when Lindy reached for the phone.\\n\\n \"Calling Susan.\"\\n\\n \"What good is that going to do?\"\\n\\n \"I…I don’t know.\" But Lindy had to talk to someone before she went loony. Susan would know what to do.\\n\\n \"Hello?\" Susan answered on the third ring, and Lindy could hear the twins crying in the background.\\n\\n \"Susan, it’s Lindy. Something terrible has happened, and I don’t know what to do.\" She was speaking as fast as she could, her voice raised and shaky.\\n\\n \"Lindy? Slow down. I can’t understand a word you’re saying.\"\\n\\n \"My letter to Rush came back,\" Lindy explained, doing her best to keep her voice as even as possible, although it wobbled like a toy top winding down after a long spin.\\n\\n \"Did you have the right address?\"\\n\\n Lindy reached for the envelope and read off Joanna’s street numbers.\\n\\n \"Lindy,\" Susan muttered, interrupting her. \"That’s not the mailing address for the Mitchell.\"\\n\\n \"I know…. It’s Joanna’s. She said we were supposed to get all the mail to her by the fifteenth. Remember?\"\\n\\n \"You weren’t supposed to mail it to her,\" Susan cried. \"It was supposed to be mailed, period.\"\\n\\n \"But I thought she was in charge of that.\"\\n\\n \"No, Lindy, Joanna doesn’t have anything to do with the mail.\"\\n\\n \"Oh God, Susan, what will Rush think?\"\\n\\n Susan hesitated, then sighed. \"It isn’t that bad. I wouldn’t worry about it, since it’s only the one letter. He’ll receive the others.\"\\n\\n Lindy felt like weeping all the more. \"But there was only the one letter. A long, long one – Oh Susan, Rush must believe… I hate to even think about it. He’ll assume I don’t love him.\"\\n\\n The line was silent. \"The important thing is not to panic.\"\\n\\n \"I think it’s too late for that.\"\\n\\n \"Now calm down,\" Susan muttered, and Lindy could picture her friend chewing on her lower lip, trying to come up with something. \"Jeff will tell him.\"\\n\\n \"Tell him what?\"\\n\\n \"Everything. How you’ve gotten involved in the wives’ association and that we’re seeing each other regularly. Rush is a smart man, Lindy. Give him credit for some intelligence.\"\\n\\n \"Right,\" Lindy said, nodding her head once. \"He’ll figure it out---He knows I love him.\" Lindy gnawed on her lip, remembering how the women’s group had told her if she had any problems, she should contact Joanna.\\n\\n A long silence stretched over the wire before Susan spoke. \"Should I call Joanna or do you want to?\"\\n\\n The phone rang just after midnight. Lindy rolled onto her stomach and checked the time. She hadn’t been sleeping well and had only turned off the light fifteen minutes before. The call was probably some prankster and she wasn’t eager to answer it, figuring Steve would. By the third ring, Lindy gave up on her brother and reached for the telephone receiver.\\n\\n \"Hello.\" She tried to make her voice sound as gruff and unfriendly as possible.\\n\\n \"This is a ham-radio operator in Anchorage, Alaska,\" the male voice explained. \"A call is about to be transmitted to you from aboard the USS Mitchell. Talk as you would normally, but each time you’re finished speaking you must say over. Do you understand?\"\\n\\n \"Yes….\"\\n\\n \"Okay. Go ahead and hang up and I’ll connect you in about fifteen minutes.\"\\n\\n Lindy’s hand was shaking so badly she could barely replace the receiver. Rush. Somehow, someway, Rush had found a means of contacting her. She scooted off the bed and paced barefoot across the carpet, waiting. Fifteen minutes had never seemed to drag by more slowly.\\n\\n When the phone rang, she nearly tore it off the nightstand.\\n\\n \"Lindy? Over.\"\\n\\n The line sounded as if it were coming from the moon. Static filled the air. Popping and hissing.\\n\\n \"Yes, this is Lindy. Over.\"\\n\\n \"I only want to know one thing. Are you pregnant? Over.\"\\n\\n Chapter Twelve\\n\\n \"You want to know what? Over,\" Lindy asked incredulously.\\n\\n \"Are you pregnant or not? Over.\" Rush demanded a second time. The long distance wire popped and hissed, making it almost impossible to hear him clearly.\\n\\n \"Not. Stop yelling at me and let me explain.\"\\n\\n Silence followed.\\n\\n A third voice interrupted. \"Over?\"\\n\\n \"Over,\" Lindy repeated.\\n\\n \"I’m listening. Over.\" Some of the bitter anger was gone from Rush’s voice, but his frustration and anxiety were evident even through the poor quality of the connection.\\n\\n \"There was a screwup with the letters. I’ll explain it later. Over.\"\\n\\n \"Explain it now. Over.\"\\n\\n \"I mailed the letter to Joanna instead of the address you gave me. Over.\"\\n\\n \"Joanna who? Over.\"\\n\\n \"Joanna Boston. She’s an ombudsman for the Mitchell. I thought she was handling all the correspondence. I didn’t realize it would go through the normal channels. Over.\"\\n\\n \"In an entire month you only wrote me one letter? Over.\" The words were shouted into her ear.\\n\\n \"It was sixty-two pages long. Over.\" Lindy returned at equal volume.\\n\\n Silence crackled like a morning breakfast cereal, and when Rush spoke again, his voice was more subdued, but still tense. \"Do you regret the fact that we’re married. Over.\"\\n\\n \"No. Do you? Over.\"\\n\\n Rush seemed to take his own sweet time answering, and when he did his voice was almost a whisper. \"Not now. Over.\" \\n\\n","sourceLink":"https://allnovel.net/navy-wife-navy-1/page-25.html","bookId":1956,"book":{"id":1956,"title":"Navy Wife (Navy #1)","description":"Storyline: Navy Wife (Navy Series #1) \\n Impulsive, wounded, vulnerable, Lindy Kyle was unprepared for a roommate like Rush Callaghan. Strong, sensitive and sexy, the temporarily dry-docked naval officer was everything she\u0027d ever dreamed of in a man…in a husband. \\n But Rush placed duty to his country above all else. Though he and Lindy were swept away on a tide of passion, he was called back to sea. They say absence makes the heart grow fonder—but will their marriage survive their partings?\\n","cover":"https://allnovel.net/images/navy-wife-navy-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/navy-wife-navy-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:11:32 AM"}}
