{"id":19496,"no":22,"title":"CHAPTER XXI A MISSING DOCUMENT OF VALUE","content":"As soon as Nat returned to the office he sought out Mr. Garwell, and handed him the document in the envelope. \"Did you have any trouble getting Mrs. Parloe\u0027s signature?\" asked the real estate broker. \"I had no trouble getting the signature, but I had trouble getting away from the house,\" answered Nat. \"Trouble getting away? What do you mean?\" \"I was stopped by her nephew, a man named Rufus Cameron. He handled me rather roughly.\" \"Did he try to get the document away from you?\" And now John Garwell was all attention. \"He hauled me in the parlor, and demanded that I let him look at the paper. I refused, and then he threatened me.\" \"And what happened after that?\" \"He put his hand in my pocket and brought out a diamond ring. He said I had stolen it.\" \"Of course you hadn\u0027t, Nat?\" \"I had never seen the ring before. But that wasn\u0027t the worst of it. He picked up a sea shell and hit me with it and knocked me senseless.\" After that our hero told his story in detail, relating also what Rufus Cameron had said on assisting him to the street car. The real estate broker listened with keen interest. \"That man is a scoundrel!\" he exclaimed, when Nat had concluded his story. \"I pity Mrs. Parloe. He is doing his best to get all her money from her.\" \"It was a mean trick to say I took the ring,\" declared Nat. \"He did that thinking to get you in his power, my boy. Are you sure he didn\u0027t look at the document?\" \"I can\u0027t say what he did while I was senseless, Mr. Garwell.\" \"I\u0027ll take a look at the paper and see if he made any alterations in the text.\" John Garwell looked at the document and began to read it. \"Why, this is not the paper I gave you, Nat,\" he ejaculated. \"Not the same?\" \"No. It\u0027s some old thing that I know nothing about.\" \"If that\u0027s the case, Mr. Cameron substituted this paper for the real one!\" exclaimed our hero. \"He could easily have done that during the time I was knocked out.\" \"I\u0027ll see about this without delay,\" said John Garwell, decisively. \"I will show that fellow that he can\u0027t carry matters with quite such a high hand.\" \"What can he do with that paper, Mr. Garwell?\" \"He can cause me a great deal of trouble. The paper refers to a piece of property in which Mrs. Parloe held an interest. I have been trying to get a free and clear title to the land for a client of mine, and another real estate dealer named Andrew Shanley has been trying to get the land for another party. It is a mixed-up affair, but I hoped the signing of that paper would help to straighten out matters.\" The real estate broker was as good as his word, but he was exceedingly busy, and it was not until two in the afternoon that he could get away. Then he went to Brooklyn, taking Nat with him. \"I would like to see Mr. Cameron,\" said he to the girl at Mrs. Parloe\u0027s home. \"Mr. Cameron has gone away, sir,\" was the unexpected answer. \"Do you know when he will be back?\" \"I\u0027ll ask Mrs. Parloe,\" said the girl. She went upstairs, leaving them in the parlor below. Soon she came back. \"He has gone out west, Mrs. Parloe says, and she doesn\u0027t expect him back for two or three months.\" \"Gone west,\" cried Nat. \"When did he go?\" \"He went away about noon.\" \"Did he take any baggage?\" asked John Garwell. \"Yes, sir, a dress-suit case, and he sent an expressman around for his trunk, too.\" \"Then I won\u0027t bother you any more,\" said the real estate broker, and left the house, followed by Nat. \"Don\u0027t you want to ask Mrs. Parloe about this?\" queried our hero. \"It would be useless to do so, Nat. It would only upset the old lady.\" \"She might be able to tell us just where her nephew had gone to?\" \"It is not likely. He intends to keep out of the way, that is certain.\" \"Maybe he didn\u0027t go west at all!\" said our hero, suddenly. \"Such a thing is possible.\" \"Did you say he was in league with this other real estate broker?\" \"I don\u0027t know about that, although I know he and this Shanley are friends.\" \"I wonder if it wouldn\u0027t be a good idea for me to watch around this Shanley\u0027s office for him?\" \"Ha! That is an idea.\" John Garwell smiled broadly. \"Nat, you are growing clever.\" \"Even if I couldn\u0027t get the paper, I could prove that he had not gone west, as he told his aunt, and I could follow him, and find out where he was stopping.\" \"Well, you can do the watching if you wish. I will give you Andrew V. Shanley\u0027s address. His place of business is between here and the Bridge.\" \"Shall I go there at once?\" \"If you wish.\" The address was written on a slip of paper, and a little later Nat and his employer separated. John Garwell gazed after our hero curiously. \"He is improving wonderfully,\" he mused. \"He isn\u0027t half as green as when I first met him.\" Nat had been told what car to take, and ten minutes sufficed to bring him to the block upon which Andrew Shanley\u0027s office was located, on the third floor of a large office building. He went upstairs, and managed to get a peep into the office, and found Rufus Cameron was not there. \"Of course he may have been here already,\" he told himself. \"But I\u0027ve got to take my chances about that. I\u0027ll stay here until the place shuts up.\" Going below again, he took a station across the street and began to wait patiently for the appearance of Rufus Cameron. As luck would have it, he had waited less than half an hour when he saw Mrs. Parloe\u0027s nephew step from a car at the corner, and approach the office building. \"Mr. Cameron, I want to see you!\" he exclaimed, coming forward, and confronting the man. Rufus Cameron had not expected to meet Nat again so soon, and for the moment he was dumfounded. \"Wha—what do you want?\" he stammered, halting. \"You know well enough what I want,\" answered our hero, sharply. \"I want that document you stole from me.\" \"Stole from you!\" \"That is what I said, Rufus Cameron.\" \"I—I don\u0027t know what you are talking about.\" \"You do know, and unless you give up the paper I am going to have you arrested right now.\" At these words Rufus Cameron turned pale. As said before, he was a good deal of a coward, and being caught so unexpectedly threw him somewhat from his mental balance. \"You—you can\u0027t have me arrested!\" \"Yes, I can.\" \"How did you come to look for me here?\" \"Mr. Garwell sent me here. He is up to your tricks.\" \"Did he tell you to—to have me arrested?\" \"Never mind what he told me. I want that paper, and I want it right now.\" \"I—I haven\u0027t got any paper. I—I don\u0027t know what you are talking about.\" \"Yes, you have got that paper. You took it from me after you knocked me down in your aunt\u0027s parlor. Isn\u0027t that so?\" As Nat finished he nodded, as if talking to somebody behind Rufus Cameron. At once the guilty fellow turned his head to learn who was listening to the conversation. As he did this, Nat thrust his hand in the rascal\u0027s breast pocket, and brought forth the document which had caused all the trouble. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2971/81833.html","bookId":373,"book":{"id":373,"title":"From Farm to Fortune or Nat Nason\u0027s Strange Experience","description":"简介： Nat Nason was a poor country boy with a strong desire to better his condition. Life on the farm was unusually hard for him, and after a quarrel with his miserly uncle, with whom he resided, he resolved to strike out for himself....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2971","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
