{"id":17039,"no":18,"title":"Chapter 17","content":"Jimmy O\u0027Hearn was still snuffling when the police unbound him and led him off to be booked. Inspector Harries went back into the yard with Yamamura and Guido. \"All right, Trig,\" he said, \"now tell me just what did happen.\" \"Dr. Kintyre, Mr. Lombardi\u0027s sister, and I went to see Mr. Lombardi at the night club where he works,\" answered Yamamura. \"He was pretty worried. O\u0027Hearn and another chap named Larkin had hired him to do a certain out-of-town job over the very weekend his brother was killed. He wondered if it was a coincidence.\" \"O\u0027Hearn babbled something about a package of dope,\" said Inspector Harries grimly. Guido became busy lighting a cigarette. \"Sure,\" said Yamamura. \"Why not try to drag down the witnesses against him? Where is this package?\" \"Suppose you tell me yourself what the job was, Mr. Lombardi,\" said Harries without warmth. \"Well, they did want me to go to Tijuana and get some pod,\" said Guido. Yamamura had briefed him in a moment\u0027s stolen privacy. \"I admit I went down—is uncompleted intent a crime? I changed my mind and didn\u0027t actually get the stuff.\" Impudence danced over his lips. \"It\u0027d have been illegal. And also, thinking it over, I saw that the errand didn\u0027t make sense. There are enough places right here that carry the same line.\" \"Hm. Any witnesses?\" Guido shrugged. \"No. How could there be? I suppose you can prove I was in Tijuana and ate a few meals there.\" \"I would think you\u0027d have more important things to do than asking out the details of something which is contradicted only by the unsupported word of a gangster,\" said Yamamura. Harries considered him angrily. \"You were my friend, Trig,\" he said. \"Don\u0027t add insult to injury.\" \"I had no choice,\" said Yamamura, very low. \"The night before last,\" said Guido, \"Larkin showed up and got violent with Professor Kintyre, who was talking to me. Quite a brawl. Larkin got away, and Kintyre left too when I begged him. I admit I lied to the officers afterward, claiming I didn\u0027t know either one of them, but by then I was scared.\" \"Go on,\" grunted Harries. \"So we had a conference of friends-and-relations last night,\" said Yamamura. \"We decided it was best to make a clean breast with the police. Ahem, that was my advice. But O\u0027Hearn stopped us at gun point as we came out the back way. He was going to kidnap Mr. Lombardi. We got the upper hand, though. Yes, we took him over here, instead of turning him in to the San Francisco authorities as we should have. Why? First, Larkin might well be hanging around, and why should he be helped by seeing a lot of uniforms and realizing what had happened to his buddy? Second, we were afraid for our lives on that side and wanted to get the hell away from there.\" Harries gave him a thin look. \"I know you. I don\u0027t believe that.\" \"A jury would,\" said Yamamura. \"Let me go on. Dr. Kintyre took Miss Lombardi home—she\u0027s entirely innocent in all of this. When he finally arrived here, we were so bushed that none of us thought we could face all the questions without a little sleep. Sure, sure, Inspector, everything we did was foolish and mildly illegal, but consider how exhausted we were. Much too tired to think straight. We tied O\u0027Hearn to the table—\" \"Why the blindfold, for Pete\u0027s sake?\" \"It just seemed like a good idea. When we woke up, we found O\u0027Hearn had the screaming meemies. Naturally we wouldn\u0027t lose such a chance, it might not come again. We asked him some things. We talked it over. All of a sudden the significance dawned on Dr. Kintyre. You know the rest.\" \"What I don\u0027t yet know is what you\u0027ll be charged with,\" said Harries. \"Among other things, some of the coldest-blooded lying I\u0027ve heard all week.\" \"Isn\u0027t that a problem for the district attorney?\" asked Yamamura, unruffled. \"Yes. And of course nothing will be done. You\u0027re comic book heroes—for violating the Fifth Amendment!\" Harries shook his head. \"If it hadn\u0027t been for all your shilly-shallying, Miss Towne might be alive this morning.\" \"When was she killed?\" asked Yamamura. \"The doctor thinks around midnight or one o\u0027clock.\" \"Nobody could have known,\" said Yamamura. \"Suppose we had turned O\u0027Hearn in directly. He had no idea who was slated to die: not even what kind of job his associates were doing. He\u0027s just a goon.\" \"I suppose so.\" As he watched, Yamamura saw the anger go out of Harries. \"We\u0027d still be interrogating him and getting no place. Whereas now, maybe the San Francisco force can take the others in that house.\" The inspector hesitated. \"Officially, I can only condemn your actions, including your concealment of facts. And you know I know fairly well what those facts are. I\u0027ll have to report all this and—and hell, there\u0027s no material evidence, and the D.A. has to consider public opinion, and why waste funds on petty charges which would never get past a jury? You\u0027ll get away with it this time. And strictly unofficially, I\u0027ve no right to say it, but I guess I\u0027m not too damn mad at you.\" Yamamura did not smile. \"I wish Bob could see it that way,\" he answered. \"What\u0027s the matter with him, anyhow?\" \"A bad nervous spell. He gets them once in a while.\" \"Just like that?\" asked Guido. \"No,\" said Yamamura. \"It looks like a sudden collapse, but it isn\u0027t. He worked hard through the academic year. It brought him close to the edge, he needed a vacation badly. Instead, all this strain and—He feels morbidly responsible. There are reasons for it. They lie in his past and don\u0027t concern us.\" \"How about a psychiatrist?\" inquired Harries. \"He hasn\u0027t got that kind of money. And we all have some such curse—don\u0027t we now? Some people have dizzy spells. Some people are hypochondriacs. Once every couple of years, Kintyre spends a few days in hell.\" \"But what made him realize Miss Towne was—?\" \"He answered the riddle, of course. He knew who had hired the killers, and why. From that, it followed she was next.\" Harries caught his arm so tightly he winced. \"What?\" \"Uh-huh,\" said Yamamura. \"Wait, though. He didn\u0027t tell me.\" \"But he\u0027s in there now and—come on!\" Yamamura caught Harries by the shoulder and spun him around. \"No,\" he said. \"It isn\u0027t right. Leave him alone.\" \"Leave the murderers alone, too!\" snapped Harries. Yamamura rubbed his chin. They could see how he slumped. \"There is that,\" he agreed. \"Let me go in by myself, then, and talk to him.\" Kintyre thought he had carried it off very well. He had spoken coherently with Moffat. The policeman told him in a sick voice that blood had soaked through her mattress until the floor was clotted beneath her bed. Guido swayed on his feet. Kintyre\u0027s face had remained like carved bone. \"Was jewelry lifted this time?\" he asked. \"Oh, yes, it was a professional job, all the earmarks,\" said Moffat. \"But did you see two long gray cardboard boxes with files of papers? They\u0027d be in plain sight in the living room if they\u0027re there at all,\" said Kintyre. \"No, no such thing, the burglars must have taken them in the hope of finding stowed cash,\" said Moffat. \"The jewelry was only to make you think that. Had she simply been murdered, or was she tied down first?\" asked Kintyre. \"Yes, tied down, blindfolded, mouth full of towel,\" said Moffat. \"The burglars came in and grabbed her while she slept, secured her so there would be no chance she could identify them,\" said Kintyre. \"That\u0027s not unheard of, but then why did they kill her afterward?\" asked Moffat. \"Because the letter boxes were still open on the coffee table,\" said Kintyre. \"What?\" said Moffat. \"It proved she had been reading Bruce Lombardi\u0027s mail; the burglars\u0027 orders were to get rid of her if that was the case,\" said Kintyre. \"Hey, how do you know all this?\" asked Moffat. But then Kintyre felt his control begin to crack, so he turned about and went back to his car with Guido. He lay on his couch, pillowing his head with an arm, a cigarette in the free hand. Now and then he noticed himself smoking it. The morning streamed in through the window behind him and splashed light, and the delicate shadows of leaves, on the wall before his eyes. Once he remembered how a sunbeam, spearing through a sky roiled and black with oncoming rain, had flamed from crest to crest along the ocean; he watched the sun\u0027s shining feet stride past him. But there followed an M which staggered among hideous winds, it spoke of Morna and Margery and the Moon. He spent a long time wondering why M stood for the Moon until he remembered Hecate, in whose jaws he lived. M was also for Machiavelli, a Moldering skull which knew somewhat of Murder. But all this was not important, it was Morbid and he only played with it on the surface, as if it were spindrift driven by that wind he knew. In the ocean of his damnation there were green Miles, which became black as you went downward, drank all sunlight and ate drowned folk. This, however, was natural and right, life unto life and he could wish no better ending for himself than to breathe the sea. It must be remembered, though, that Morna was only thirteen years old. She reached for him through a shattering burst of water. He could not hear if she screamed, the wind made such a haro, but a wave picked her up and threw her backward and growled. He saw her long hair flutter in its white, blowing mane. Then dark violence rolled over him. He stirred, and felt that his cigarette had gone so short it would burn his fingers. A part of him suggested he let it, but he ground the butt out in an ashtray on the floor. What he was would not be lessened by a few blisters, he thought. It was not that he accepted guilt (he told the morning gulls on the reef, among sharded timbers). It was that he was damned, without a God or a Devil to judge him: it was merely in the nature of things that he did nothing well. Morna should drown and Margery should drown—the human body held that much blood—because—no, said the seed of survival within him, not because it was his fault. And was there anything more irrelevant than the question of his guilt or innocence? The sole fact that mattered was: Morna, thirteen years old, hauled down under the sea and rolled across a barnacled reef. He had found her washed up the next morning, before the boat came out to rescue him. A strand of hair still clung in place, darkened by water but more bright than the coral. He saw some of the bones; a tiny crab ran out of her eye socket. Kintyre hung onto the couch through a whiteness that hummed. Ages afterward he remembered Margery. She had never spoken of it, but he had an impression that she feared death. It ended future and past alike, nothing would be, nothing had ever been. She must have told herself often enough that maybe science would find a way to make her immortal, before she died. But death was a long way off, fifty years or more were a distance which dwindled the shape, only a small black blot on the edge of her world. She lay blind and bound, a towel choking her mouth. She could hear her heart, how it leaped, she feared it would crack itself open. And then the hand under her jaw, the nearly painless bite of the knife, and the minutes it took for her blood to run out, while she lay there and felt it! \"No,\" said Kintyre. \"No, no, no. Please.\" He reached hazily for another cigarette. He couldn\u0027t find the pack. Suddenly he was afraid to look for it. He lay back on the couch. The sunlight on the wall seemed unreal. He didn\u0027t hear Yamamura come in. He needed a while to understand that the detective was looking at him. \"What is it?\" he got out somehow. \"Let\u0027s work some of that stiffness out,\" said Yamamura. Kintyre didn\u0027t move. He wasn\u0027t sure he could. At least it didn\u0027t seem worth while. Yamamura swore, hauled him to a sitting position, peeled off his tee shirt and dumped him on the rug. The Japanese massage, thumbs, elbows, and bare feet, was hard, cracking muscles loose from their tension. Kintyre heard joints pop when Yamamura straightened his arms. Once anguish got an oath from him. \"Sorry,\" said Yamamura. \"I gauged wrong.\" \"Like hell! You did that on purpose!\" \"Trade secrets. Now, over on your side.\" In half an hour Kintyre was sitting on the couch, drawing ragged gulps of smoke down his lungs. \"All right,\" he said. \"So you relaxed me physically.\" \"Helps, doesn\u0027t it?\" Yamamura leaned against the wall and mopped his sweating face. \"Some. But no cure.\" Kintyre looked bleakly toward the afternoon and the night. \"Didn\u0027t claim it was. Got any tranquilizers on hand?\" \"Uh-huh. Only helps a little bit. I might as well ride these things out.\" \"Same symptoms?\" \"Yes. Futility. Loss. Destruction. Grief? No, that\u0027s too healthy a word. I\u0027m only talking to you with the top of my brain now, you realize. It feels the same as ever, down below.\" \"Basically, you feel guilt,\" said Yamamura. \"Perhaps. I saw my sister drown. I was hanging onto a spar when the ship broke up. She was swept past me. I reached out, our fingers touched, then she was gone again. I didn\u0027t let go of the spar.\" \"If you had, both of you would have drowned. I know the Pacific surf. With a typhoon behind it—You\u0027re guilty of nothing except better luck than she had.\" \"Sure,\" said Kintyre. \"I\u0027ve told myself the same thing for twenty years.\" \"You\u0027ve told me this story three times so far,\" said Yamamura. \"I don\u0027t like parlor Freudianism, but it would seem obvious that something deeper is involved than the mere fact that you survived and she didn\u0027t.\" Kintyre half rose. He felt the lift of rage within himself. \"Be careful!\" he shouted. Yamamura\u0027s face went totally blank. \"Ah-ha. Sit back, son. I\u0027m still the black belt man here. You\u0027d only succeed in tearing up this nice room.\" Kintyre spat: \"There was nothing!\" \"I never said that. Of course there was nothing improper. I am not implying you had any conscious thoughts whatsoever that you can\u0027t safely remember. Or if you did now and then—and as for your subconscious wishes—were they really so evil? She was the only girl of your generation whom you\u0027d see for weeks and months at a time. So you loved her. Is love ever a sin?\" Kintyre slumped. Yamamura laid a hand on his shoulder. \"There\u0027s a story about two Zen Buddhist monks who were walking somewhere,\" he said. \"They came to a river. A woman stood by the bank, afraid to cross. One of them carried her over. Then the two monks continued on their way. The gallant one was singing cheerfully, the other got gloomier and gloomier. Finally the second one exclaimed: \u0027How could you, a monk, take up a woman in your arms?\u0027 The first one answered: \u0027Oh, are you still carrying her? I set her down back at the ford.\u0027\" Kintyre didn\u0027t move. \"Forgive my amateur psychoanalysis,\" said Yamamura. \"It\u0027s none of my business.\" He paused. \"I would only suggest that it\u0027s no service to anyone we\u0027ve cared for, not to let them rest.\" He sat down beside Kintyre and took out his pipe. They smoked together for a wordless while. \"Well,\" said Kintyre at last. \"Have you figured out who\u0027s behind the murders?\" \"No. Think you can tell us? Feel free to wait.\" \"Oh, I can. M-m-m-m-margery—\" Yamamura worked powerful fingers along Kintyre\u0027s shoulders and the base of his neck. \"Go on,\" he said. \"Margery\u0027s death—brought back Morna\u0027s, I suppose—I failed them both. I didn\u0027t need O\u0027Hearn\u0027s story to determine who instigated all this. I could have told you yesterday afternoon, if I\u0027d used my head—Ouch!\" \"That,\" said Yamamura, \"was to halt an incipient tailspin. I felt it coming. You are not to blame for one damn item except being human and therefore limited, fallible, and unable to do everything simultaneously on roller skates. If you forget that again, I shall punch you in a more sensitive spot. Now why don\u0027t you go swallow one of those chemical consolations?\" \"I told you they don\u0027t help much.\" \"I\u0027ve no high opinion of \u0027em myself, but do so anyway.\" When Kintyre had returned and sat down again, Yamamura said: \"Okay, carry on. Who is our man?\"","sourceLink":"http://novel.tingroom.com/duanpian/3083/85104.html","bookId":961,"book":{"id":961,"title":"Murder in Black Letter","description":"简介： Steel talked between roses. Kintyre parried Yamamura\u0027s slash; his riposte thumped on the other man\u0027s arm....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3083","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
