{"id":94523,"no":24,"title":"Page 24","content":"Hanging on the Old Barbed Wire Too exhausted to stay awake, too hurt to sleep, Winthrop hung on the wall like the Sunday joint. The pain in his shoulders, neck and knee was still sharp, but otherwise he was numb. His mind drifted, his senses slurred. He and Ball were not immediately to be cut up and eaten. The troglodytes sat on their coffins and talked among themselves. Each retold his history as if blessing a class of children with a favourite fairy tale. Jules, an Austrian, recounted the story of his original separation from his unit. He had braved many perils before joining up with the tribe. Jim, the Frenchman, chipped in with his own variation on the theme, of desertion to escape the stake after ringleading a mutiny against General Mireau. Jim bitterly recalled the erosion of his patriotic fervour with each fresh injustice, inequity and corruption. Winthrop shifted on his hook. Shards of pain speared through his shoulders. He bit back his impulse to yelp. He could not pay attention to the deserters. Stories of privation, desolation and horror became scrambled and monotonous. Perhaps the narratives were embroidered with each retelling, incorporating favoured incidents from the stories of those who had passed on. Though savage and socialist, there was order in this vampire community. Mellors said there were no ranks, but others deferred to him. He was called to arbitrate in disputes, to decide courses of action, to pass judgement on the likeliness of a particular anecdote. Had it not been for his counsel, the troglodytes would have torn Winthrop to scraps on the spot rather than husbanded him against future need. Mellors was chieftain and the snouted Svejk his Holy Fool. After the story-telling, Svejk got up and acted out a story his audience already knew, the saga of the capture of the burned men from the sky, eliciting harsh laughter by aping the crooked Ball and the upright Winthrop. The creature had Ball\u0027s mangled voice exactly, and provoked howls of humour with his imitation. Ball\u0027s eyes were red and awake in the blackened mask of his face. When Svejk had finished his performance, Mellors stood up and walked over to the prisoners. He looked at Winthrop\u0027s swollen knee. \u0027Nasty twist,\u0027 he said, not cruelly. \u0027But nothing broken.\u0027 He unlaced Winthrop\u0027s remaining flying boot and wriggled it off, then stripped away the thick, stiff socks. After being hung, Winthrop could not feel his feet but he saw them as purple and bulging. \u0027The blood has rushed to your feet,\u0027 Mellors said, prodding an engorged toe. \u0027Perfect.\u0027 Mellors sprouted a barb from his thumb and pricked Winthrop\u0027s foot. There was a tingling and a dribbling gout of blood. \u0027There\u0027s a taste for everyone, lads. Queue up for your char.\u0027 Svejk was first, lifting his gas mask for a quick guzzle. Winthrop felt a warm wetness on his foot. And sharp little prickles. By turns, the troglodytes came forward to lap his blood. He had known vampires, of course. But he\u0027d never before given blood. This was not what he had imagined. This was not pleasure or sharing. He had thought he might catch the eye of an elder and offer her his neck. Kate Reed seemed an interesting prospect. Or perhaps he and Catriona would turn simultaneously, tasting each other in a red communion. There would be fluttering curtains and moonlight, and tiny points of pain in a pool of pleasant submission. Mouths battened on his feet, teeth tore, and his blood leaked. As he lost blood, there was less pain. His arms were ice-cold, his hands nerveless stone appendages. Mellors looked up at him as the troglodytes fed. \u0027It\u0027s just nature,\u0027 the vampire explained. \u0027You can\u0027t complain of nature.\u0027 If one of the creatures was in danger of supping too deeply, Mellors detached him and shoved him back to the pack. \u0027Hold steady, Raleigh. Not too greedy, now. Leave something for Voerman.\u0027 A mad-eyed English subaltern made way for a young German with a long tongue. There was a doggy malleability to the tribe. They were probably a good fighting force. Winthrop felt as if his foot had been laid open to the bone by razors of ice. Finally, it was over. Winthrop hung, drained and cold. One of the troglodytes produced a medical kit and expertly bandaged Winthrop\u0027s feet. As an afterthought, he took a poke at the knee, digging out fragments of grit, and bound it up tightly. When the medicine man had finished, he and Mellors were the only creatures out of their coffins. The others, fed if not satisfied, lay insensible under blankets or planks. Mellors dismissed the doctor and checked Winthrop\u0027s wrists. With his full weight on the hook, he was not able to lift himself up and free. Ball hung like dried meat, twisted back and arms giving him a crucified appearance. His exposed eyes were unmoving. Satisfied, Mellors retreated to his coffin, hauling his camouflage cloak around him. In an instant, he was sleeping like a dead man. Winthrop fought exhaustion. His body weighed several tons. It dragged his mind down into the depths. A stab of pain cut through his drowsiness. A barb gouged his wrist. The fires had burned to embers, lending the troglodytes\u0027 cavern a red-lit, infernal glow. The creatures lay unmoving in their coffins. Winthrop had no way of knowing what time, or what day, it was. Something was moving. Unable to turn his neck, he swivelled his eyes, looking as far as possible to his left and right. Rats could not climb up to where he hung. Ball was contorted on his hook. Winthrop realised the pilot\u0027s eyes were open and his mouth red. He had hauled himself up, further bending his already bent arms, turning on his side to press his hip to the wall. He had got his teeth to the twine around his wrists. No, he had got his teeth to his wrists. Ball saw Winthrop was awake and gave a deliberate, silent nod. His mouth scraped at his left wrist, peeling back cooked skin to show red flesh. He chewed white tendons and exposed bone. As Ball bit deeper into himself, vampire blood dripped to the floor. Svejk snorted in his sleep. Ball was still for a moment, awaiting an attack, but renewed his efforts. Winthrop felt useless. There was nothing he could do. The meat was gnawed away from Ball\u0027s wrist. His skeleton hand, gloved in flesh, flexed into a fist. The twine loop was loose but unbroken. Silver wire glinted inside the string. Only in this war would chandlers manufacture rope specifically for binding the nosferatu. Ball hung on to the hook with his right hand. Setting his red teeth together in a jagged grin, cheek-muscles clenching with determination, the pilot pulled sharply, lodging twine between the bones of his left wrist, and swallowed a groan. The fist opened like a starfish, sticking out dead fingers. An artery gushed. Ball tugged again and the hand came off, falling with a wet smack to the ground. Blood welled from the stump. Ball, free, hung from the hook, twisting his legs in agony. Even Winthrop smelled the rich vampire blood. Troglodytes stirred in their slumbers, nostrils twitching, mouths watering, claws scratching lids. When he let go of the hook, Ball did not so much fall as slide down the wall. For an instant, Winthrop was afraid his comrade had exerted himself so much that the shock of clumping against the earth had knocked him unconscious. Ball held his stump with his unhurt hand. Blood oozed between his fingers. Shamefully, he dipped his head and licked his wound, sucking his own juice like Isolde at the Theatre Raoul Privache. It was a perverse act among vampires, but clearly brought relief. A troglodyte sat up stiff as a board, fencepost fangs sprouting from his mouth. It was Plumpick, a mad Scot with gentle eyes. With a loose-limbed, liquid movement, Ball stabbed Plumpick\u0027s chest with his stump. The jagged edge of bone sank through the ribs and pierced the heart. Life died in the deserter\u0027s eyes and teeth crumbled like humbugs in his mouth. The weight of the dead vampire dragged Ball over and he was fixed in place over Plumpick\u0027s coffin. With a quick fist-clench, Ball snapped his arm at the elbow and pulled free, leaving the spars of his forearm bones stuck through Plumpick\u0027s heart. He was coming apart fast. Winthrop writhed on his hook, trying to edge up the wall with his shoulders and back. He knew he could not hope to duplicate Ball\u0027s stunt. Ball silently and swiftly crossed the cavern, weaving between coffins, and stood before Winthrop. A man of his undead strength could easily take Winthrop by the hips and lift him bodily off the hook. A man of Ball\u0027s undead strength with two arms, that was. It was awkward. Ball slipped his remaining arm between Winthrop\u0027s legs and made his hand into a seat which he jammed upwards. The slight, bent man stood up as straight as he could, making of his spine and arm a column which hoisted. His bound wrists unhooked from their perch. His arms flopped down behind him and his whole weight fell on Ball, who staggered forward and bent at the waist. In a tumble, Winthrop landed on dirt. His hands were on fire and his bandaged feet stung. Other troglodytes stirred. Ball, with no regard for injury, scooped up a fistful of red embers from a fire drum and tossed it into Svejk\u0027s coffin. A nest of straw caught fire in an instant. The Bohemian hopped and yelped in the smoke. Winthrop wriggled like a worm. He twisted his wrists round to free himself from the barbed wire. The damned stuff came off in a curl, leaving scabby stigmata on his wrists. He found his boots and hauled one on, ignoring the pain in his knee, then hopped upright and thrust his foot into the other. Ball had a firebrand and was waving it from side to side, keeping the troglodytes back. Mellors was up, furious but amused. Winthrop and Ball had their backs to the tunnel through which they had come. If they turned and ran, the troglodytes would bear down on them and rend them a part. But if they stayed where they were, Ball\u0027s torch would soon go out. Mellors hissed curses in Derbyshire dialect. Surprisingly, Ball returned the favour in kind. Svejk rolled in the dust, stifling the flames that licked around his bulk. His coffin still burned. Winthrop saw the opportunity. Shoving the surprised Ball from behind with his shoulder, he pushed vampire and torch into the faces of the troglodytes, who cringed backwards. Winthrop advanced and took hold of the casket of burning straw, which he pitched upwards, scattering fiery matter across the cavern. Ball got the idea and touched the torch to the nearest troglodyte, Raleigh. A dirt-starched uniform caught light in an instant, fire swarming up to a bird\u0027s-nest beard and long straggle of hair. A high-pitched screech burst from the vampire. In torment, he ran back to his fellows, colliding with them, tripping over coffins, spreading fire. The netting hanging from the cavern roof caught. Flames swarmed over the mural. The paper elements of the collage burned in flashes. A heated case in a corner exploded, stored bullets popping. Winthrop took to his heels, dragging Ball away from the cavern. They ran upwards.","sourceLink":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2/page-24.html","bookId":1619,"book":{"id":1619,"title":"The Bloody Red Baron (Anno Dracula #2)","description":"Storyline: The Bloody Red Baron (Anno Dracula #2) Continuing the series begun with his novel Anno Dracula, Newman recounts the bizarre events of yet another alternative vampire history and introduces a terrifying new anti-hero--the feared flying monster of the Great War, Baron Manfred von Richtofen.","cover":"https://allnovel.net/images/the-bloody-red-baron-anno-dracula-2.jpg","author":"Kim Newman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:08:13 PM"}}
