{"id":94529,"no":30,"title":"Page 30","content":"Returned to Life\n Over the protests of the nurse, Kate walked with Edwin in the hospital grounds. Shortly after dawn, the moon was not yet down. Her glasses were sensibly tinted. Daylight hurt her only at the height of a cloudless summer day. The gauzy blue dawn light of French winter was as cool as a night of the crescent moon.\n Edwin held her hand. His grip was firm, hers weak. He was changing. So, she supposed, was she.\n He had not told her much of his mission to Malinbois, just that he had been in an aeroplane brought down by enemy action and had made his way back across the lines. Some of his reluctance to give detail was imposed by the Diogenes Club, who wished to keep their secrets. But there was in him some spark of strangeness. He now had his own secrets. This Edwin Winthrop who returned was not quite the man who had gone out.\n \u0027I\u0027m in flying school. Diogenes is lending me to the new show. They\u0027ll need trained intelligence people.\u0027\n The Royal Flying Corps was being divorced from the army and reformed as a new service, the Royal Air Force. Edwin no longer wore his staff officer\u0027s pips.\n \u0027I\u0027d have thought that after the last jaunt, you\u0027d wish never to go near an aeroplane again.\u0027\n His face was set, his mind closed to her. \u0027Unfinished business in the air, Kate. I have to get back up there.\u0027\n The sun came out and Edwin flinched. His eyes closed to slits. She knew, at once, why.\n There\u0027s a demon in the sky and I must kill him.\u0027\n They stepped into the tangled shadow of a bare tree.\n \u0027You\u0027ve vampire blood in you,\u0027 she said.\n He nodded. \u0027A pilot I was shot down with. Albert Ball.\u0027\n She had heard of Ball, a decorated ace.\n \u0027Have you also given blood?\u0027\n He shook his head. \u0027Ball died before I could help him. It was his last wish I taste his blood. I think he believed he\u0027d live on through me.\u0027\n \u0027Now you\u0027re becoming a pilot?\u0027\n There was a strength in his eyes. Still warm, he had the beginnings of the power of fascination.\n in the air, I know what to do. I don\u0027t know if it\u0027s natural ability or something Ball passed on, but I\u0027m jumping through the hoops faster than the instructors can credit. It must be Ball. Or maybe fear has been burned out of me.\u0027\n Kate was unsure about this new Edwin.\n By mid-morning, they had taken refuge in Edwin\u0027s billet in a small hotel entirely occupied by the British. His small room was on the fourth floor, directly under the roof. Its ceiling sloped like a tent. Thick blackout curtains hung over a gabled window. Daylight seeped around the edges.\n Kate sat on the narrow bed, pillows propped behind her. Edwin stood, head bowed by the ceiling.\n She was weaker than she had thought. Walking in the sunrise had tired her. She could hardly move. By contrast, Edwin was accelerated, gestures and thoughts faster than hers. It was as if she were the sluggish, docile, warm fool, and he the predatory vampire, darting round her defences. Perhaps it was Albert Ball in him. And the despairing, ruined Blighty cases in her.\n Edwin knelt and took her hand. A little of his vitality seeped into her. An attribute of her line was a minor facility for psychic vampirism, the ability to drain energy without tasting blood. Those who knew Frank Harris, even before his turning, said he was an exhausting experience.\n Edwin, to state the obvious, you\u0027re alone in your room with a woman.\u0027\n He avoided her glance.\n \u0027Aren\u0027t you supposed to be engaged?\u0027\n Face down on the tiny bedside table was a photograph frame. A watch sat on it.\n \u0027I\u0027m dead to Catriona. The war has made living dead of us all. Until it\u0027s done, there can be nothing else.\u0027\n He rose and sat beside her, still holding her hands. She heard his strong heartbeat. Her mind swam and she recalled falling under the spell of her father-in-darkness. Frank Harris\u0027s kisses were sour-sweet. Memory was blotted by a new taste.\n Edwin kissed her deferentially and took her glasses off. She took them from him and placed them next to his watch, nails brushing the hardboard backing of the unseen photograph. His huge eye was up close, a blur of liquid gleam. His lips fixed to hers.\n Without drawing blood, they drank from each other\u0027s mouth. His strength of purpose was a blast of wind against her face, streaming through her hair.\n Something of her flowed back into him. She sensed his electric tingling. With a smear of guilt, she had an impression from his memory of a girl she took to be Catriona. A tall, delicate, grey-eyed willow in a white dress and a straw hat. The impression faded. Kate was overwhelmed by a heat in her heart. She hugged Edwin, vampire strength coming back to her arms, squeezing breath out of him.\n They broke apart and went through the business of dispensing with clothes. Thirty years had brought merciful changes in fashion. In her warmth, undressing - even under circumstances which allowed full attention to be devoted to the chore - had been as complex a business as disassembling a rifle.\n Under his clothes, Edwin\u0027s body was a map: seas of pale skin, continents of blue-black bruise, islands of red weal, archipelagos of stitching, national boundaries of scar. An empire of injury. As she touched his wound-marks with fingers and tongue, he thrilled.\n He stroked her shoulders and breasts and belly, covering her with moustache-tickle kisses. The tiny scars of her warmth, from childhood play or spills off her bicycle, had vanished shortly after turning, but she was still freckled like an egg.\n With awkward shifting, they managed to get themselves side by side on the bed. Kate\u0027s back pressed up against the wall and Edwin\u0027s hip perched on the edge of the mattress. The space between them vanished. She felt his warmth against her from shins to neck. Her heart ached for his blood.\n She touched him intimately, forcing herself against instinct to be gentle. Through her palm, she felt the heat of his gathering blood. He shifted her under him and entered her suddenly. She reached above her head and gripped the bedstead. Her eyes were shut, but she saw clearly. Images leaked from Edwin\u0027s mind. Faces and fears.\n The heat built. Her fingernails were claws, hooked around the brass rails. Her fangs sprouted, forcing her mouth open. All her teeth were sharpened to points. She was dangerous to kiss. , \u0027Careful,\u0027she said.\n His tongue flicked lightly against hers. Her arms seemed to become wings, cool air currents streaming over and under them. There was a great chasm of empty air beneath them, but they were sustained in flight. One drop of his blood now would explode in her mind. She would go down in flames. She tried to shut her mouth and swallow a scream.\n Edwin took her right wrist and tugged, detaching her hand from the headstead. Her claws screeched against the brass.\n \u0027Be very careful.\u0027\n He kissed her fingers, touching his tongue to her barb-like claws. He took hold of her forefinger as gently as she had taken hold of his penis, and touched its tip to the hollow of her throat. She spent, violently. Her free hand made a fist, crushing flat a brass tube.\n Edwin pricked her with her own fingernail. He punctured one of the tracery of blue veins in her chest. Scarlet blood welled and he pressed his mouth around the wound, suckling like a child.\n Waves of warmth and pain washed about her. She was helpless, feeling him in every inch of her. She wanted to warn him about her blood. He drank without regard. There was a disturbing purposefulness in his tapping of her. She had been seduced. This was not what she would have willed.\n Edwin gulped down swallows of her blood, then the urgency of his body overtook him. He held her close and spent inside her. The spreading warmth did not kill her red thirst.\n As a dead thing, Kate could not conceive a child this way. She could only have progeny through passing on her bloodline. She might still become mother to her lover.\n They lay together, one flesh, trickling into each other. A black dot of panic grew in Kate\u0027s mind. Edwin grew heavier on her. Sleep was overtaking him.\n She struggled out from beneath his pressing weight. The hole in her chest closed, leaving only a smear of blood on her freckled bosom. There was no scar. Edwin\u0027s lips were red with her vampire juice.\n She shook him.\n \u0027Edwin, if you mean to turn, I must drink from you to complete the communion.\u0027\n He moaned and his arms crossed over his throat, protective. Her blood matted his chest hair.\n \u0027It\u0027s dangerous unless we go through it completely.\u0027\n She had no children-in-darkness. She\u0027d thought herself not old enough in undeath to be responsible. There were still too many things about her condition she didn\u0027t understand. Yet here she was, like a foolish warm girl overcome by passion, having to make a decision about motherhood in an inconvenient instant.\n Edwin\u0027s eyes opened.\n She wanted to drain him completely, to drink from him until his heart stilled, to watch over his corpse and coax him newborn into the moonlight.\n \u0027Edwin, I\u0027m sorry, but you leave me no choice.\u0027\n The bones of her jaw unlocked as her mouth distended like a snake\u0027s. Extra fangs sprouted around the spurs of her incisors. She tasted her own blood-salted spittle.\n Edwin put out a hand, pressing his palm against her chest, fingers splaying.\n \u0027No,\u0027 he said, weakly, \u0027no. Miss Mouse.\u0027\n She was torn by duty and desire, which told her she must feed, and Edwin\u0027s own gathering strength.\n \u0027You won\u0027t turn,\u0027 she said, words slurred by her fangs.\n He shook his head. \u0027You mustn\u0027t make me. I must be my own father. Kate, please.\u0027\n He fell unconscious. His blood still raced, his heart beat strong and steady. She wanted to howl. He had unpenned the wolf in her, but would not let it feed. The room rippled, like a reflection in a disturbed pond. She was still troubled by sensations of flight and fire that spilled from his mind. She put on her spectacles and shut her eyes, trying to flush the wolf from her heart.\n She got off the narrow bed. Edwin stretched out, smiling. She shook, as cold and weak as after giving her blood to one of the patients. But this was a more complex transaction.\n If she were to ravish him as he slept, it would be understandable. Once turned, he would probably thank her. But there had been a force in his \u0027no\u0027, a determination.\n Her knees were unsteady. She sank into a corner, bony legs to her chest, and pulled her clothes around. Making a nest, she willed herself into lassitude. Iron bands tightened about her craving heart. \n","sourceLink":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2/page-30.html","bookId":1619,"book":{"id":1619,"title":"The Bloody Red Baron (Anno Dracula #2)","description":"Storyline: \n The Bloody Red Baron (Anno Dracula #2) \n Continuing the series begun with his novel Anno Dracula, Newman recounts the bizarre events of yet another alternative vampire history and introduces a terrifying new anti-hero--the feared flying monster of the Great War, Baron Manfred von Richtofen.\n \n","cover":"https://allnovel.net/images/the-bloody-red-baron-anno-dracula-2.jpg","author":"Kim Newman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:08:13 PM"}}
