{"id":94544,"no":45,"title":"Page 45","content":"To End that Spree The wreck of the Attila burned so brightly Winthrop might have been flying by day. Beyond the forest, the landscape was covered with the straggling shadows of Allied troops falling back to Amiens. Lorries clogged roads and men waded through fields. His face stung from the immense heat of the dirigible\u0027s death. He scanned the sky, above and below the Camel, for the enemy. Howling frustration gnawed his gut. He might be the sole survivor of the dog-fight, the last of both Condor Squadron and JG1. And he would never know what exactly had happened to Baron von Richthofen. That would be worse than going down in flames. No. Nothing was worse than going down in flames. Nothing was worse than Allard\u0027s sacrifice, Brandberg\u0027s crack-up or the deaths of the dozens of men in the Attila. It occurred to him that he was, or had been, quite mad. The Albert Ball in him urged him on to hunt out and destroy his enemy. But there were doubts. It wasn\u0027t so much the Kate Reed in him. She was not his conscience. He missed his old self, the boy he\u0027d been before war made a man of him. The man he\u0027d been before war made a monster of him. He owed explanations to Catriona. To Beauregard. In concentrating on evening things with the Baron, he\u0027d made himself a freak. This strange Edwin Winthrop was as repulsive as Isolde, pulling out her veins on stage, or the bat-staffel of JG1, demon monsters for the Kaiser. The rush of air on his face awakened him, purging him. He opened his mouth and let the wind blow in. Pulling back the stick, he made the Camel climb. The higher he went, the more distance he got from the brutish business. He could burst through the Earth\u0027s bubble of atmosphere and be free of the war and its eternities of killing and waste. Then he saw the flying creature, hugging burned-out treetops, moving with purpose, as alone as a hunting shark. A flight commander\u0027s streamers flew from his ankle. It was Richthofen. In the firelight, the Baron was truly red. Winthrop hoped this was the last of the shape-shifters. He\u0027d seen enough of them destroyed. The charm was off. They were creatures who bled and died like any others. His doubts drowned in a red tide. Icy calm, he took the Camel down, fast. The miracle was that he still had ammunition left. The shape-shifter couldn\u0027t fire backwards. From behind, the Baron was easy meat. Richthofen was alerted. The bat-ears must be enormously sensitive. The German tried to climb and turn, bringing guns to bear on the Camel, but Winthrop harried him with a burst - short, for he must conserve his bullets for the kill - and forced him to dip down into the forest. Winthrop pulled up and skimmed across the treetops, watching the Baron weave through the canopy of branches. He was unbelievably agile, but the forest slowed him. He seemed to be swimming through the dense trees. Fire spread from the Attila. Thick wood-smoke churned upwards, stinging Winthrop\u0027s eyes, swirling around his propeller. If the Baron chose to land, he\u0027d survive the night. He could wait for advancing German troops and be carried back to Schloss Adler a hero. But Manfred von Richthofen would not duck out of a fight. The forested patch was small. Winthrop overshot the trees and flew over plain ground, rising towards low hills in the near distance. There were Allied positions in the hills. Men streamed back to them. This was where the German offensive would break. Or where the war would be lost. Winthrop turned back towards the forest just as Richthofen flew out of the trees and soared upwards, a prehistoric monster with twentieth-century guns. The Baron fired and Winthrop returned fire. Bullets sparked all around. There was a hideous pranging noise. Winthrop thought he had taken a hit on the prop. They rushed at each other, and missed colliding in the air. Winthrop felt the wind of the Baron\u0027s wings. What must it be like to be such a monster? He turned the Camel tightly. The Baron was far more manoeuvrable, so Winthrop had to push his machine to its limits. Richthofen must have nothing. A warrior-monk, thoughtlessly dedicated to his country. That must be a weakness. He had nothing to fight for. Nothing but the empty achievement of an ever-increasing score. Winthrop didn\u0027t want to be the Baron\u0027s victory. But he no longer needed to kill. He no longer wanted to kill. Nevertheless, he fired his Lewis guns at the bat-shape swooping at him. The Baron evaded the stream of bullets. He passed by close enough for Winthrop to see his shape-shifted face. With blue human eyes and fixed bat-snarl, it was a tragic mask, leaking blood at the mouth. There was another aeroplane in the sky, hugging the trees, moving slowly. A two-man spotter. At a glance, Winthrop took in the kite\u0027s colours. A Hun. The Camel was above and behind the Baron. Winthrop fired single shots, conserving ammunition for the killing burst. He crowded and drove Richthofen onwards. The bat-creature darted from side to side, but could not break free of the funnel in which Winthrop had him penned. His ammunition was nearly out. If the Baron stayed beyond range of accurate fire for a few more moments ... They were beyond the forest, half-way towards the hills, low enough to startle trudging troops. Men turned to whoop and cheer as Richthofen and Winthrop zoomed over them. Caps were whipped off by the windwash. Rifles were aimed at the sky and shots fired. Bloody idiots. Both parties were moving so fast that a shot aimed at the leading flier could well strike the pursuer. The spotter would be on the Camel\u0027s tail but Winthrop needn\u0027t worry about it yet. The fighter could outrace the pusher any night of the year and have juice left over to smash it into the ground. A mortar barrage burst up into the sky ahead, startling Richthofen. The Baron soared up, flapping his wings. Winthrop gained on him fast, pulling back the stick. The moon broke through the cloud like an eye opening. Holding steady at speed, Winthrop realised the Baron was in his sights. If he depressed the firing buttons ... His thumbs were frozen iron. There was Archie ahead. Gun positions in the hills laid a carpet of shellbursts. Richthofen winged towards heavy fire. Late, startled by explosions all around, Winthrop pressed the buttons. A stream of silver squirted forth. Red wounds exploded in the Baron\u0027s hide. He had tagged Richthofen. He was still pressing the buttons, but his ammunition was out. Richthofen\u0027s wings seemed to spread like an enormous curtain, filling his sky. Winthrop knew he was caught without defence between the Baron and the Boche spotter. If they came at him together, he would be truly dead. Maybe that was for the best: to die, rather than live on and risk becoming even more of a monster. In the creature\u0027s eyes, Winthrop saw killing frenzy. The Baron was about to add Edwin Winthrop to his score. He reflexively thumbed the buttons. His Lewis guns clicked, empty ... But the Baron was struck again and again, as if Winthrop were hitting him with ghost bullets. Richthofen twisted in the air, wings struggling, riddled with bloody holes. Winthrop was astonished. It was ground fire, of course. Shocked out of his frenzy, he realised he was as likely as a Hun to be riddled by Archie and climbed above the dying flier. As he spiralled up, Winthrop saw Richthofen jittering in the air, as if kept up by the multiple impacts of shots fired from below. The outspread wings were ripped ragged. The body dwindled, guns become anchors, limbs twisting. The dead thing fell towards the ground, disappearing into fire and darkness. Shocked to his senses, Winthrop wondered what he was doing in alien air.","sourceLink":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2/page-45.html","bookId":1619,"book":{"id":1619,"title":"The Bloody Red Baron (Anno Dracula #2)","description":"Storyline: The Bloody Red Baron (Anno Dracula #2) Continuing the series begun with his novel Anno Dracula, Newman recounts the bizarre events of yet another alternative vampire history and introduces a terrifying new anti-hero--the feared flying monster of the Great War, Baron Manfred von Richtofen.","cover":"https://allnovel.net/images/the-bloody-red-baron-anno-dracula-2.jpg","author":"Kim Newman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-bloody-red-baron-anno-dracula-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:08:13 PM"}}
