{"id":70715,"no":24,"title":"Page 24","content":"IT WAS STRANGE how the dramatic last deed of Andrew\u0027s long life caught at the imagination of the world. Nothing that Andrew had done before had managed to sway people from their denial of his humanity. But Andrew had finally embraced even death for the sake of being fully human, now, and that sacrifice was too great to be rejected. The story swept across the world like a hurricane. People spoke of nothing else. The bill granting Andrew what he had sought so long went through the World Legislature without opposition. No one would have dared to vote against it. There was scarcely even any debate. There was no need for it. The measure was unprecedented, yes-of course it was-but for once everyone was willing to put precedent aside. The final ceremony was timed, quite deliberately, for the day of the two hundredth anniversary of Andrew\u0027s construction. The World Coordinator was to put his signature to the act publicly, making it law, and the ceremony would be visible on a global network and would be beamed to the lunar settlements and to the other colonies farther out in space. Andrew was in a wheelchair. He still was capable of walking, but only shakily, now, and it would embarrass him to be seen looking so feeble when so many billions of people would be watching. And billions were watching-watching everywhere. The ceremony was simple and quite brief. The World Coordinator-or his electronic simulacrum, rather, for Andrew was at his home in California and the World Coordinator was in New York-began by saying, \"This is a very special day, Andrew Martin, not only for you but for the entire human race. There has never been a day like it before. But then there has never been anyone like you before, either. \"Fifty years ago, Andrew, a ceremony in your honor was held at the headquarters of the United States Robots and Mechanical Men Corporation to celebrate the hundred-fiftieth anniversary of your inception. I understand that at that ceremony one of the speakers proclaimed you to be a Sesquicentennial Robot. The statement was correct-as far as it went. But it did not go quite far enough, we realize now. And so the world has taken steps to make amends, and those amends will be made today.\" The World Coordinator glanced toward Andrew and smiled. There was a document before him on a little podium. The World Coordinator leaned over it and, with a grand flourish, signed his name. Then, looking up after a moment and speaking in his most formal, solemn tone, the Coordinator said, \"There you are. The decree is official and irrevocable. Your sesquicentennial anniversary is fifty years behind you, today. And so is the status of robot with which you came into the world, and for which you were cited on that day. We take that status from you now. You are a robot no longer. The document that I have just signed changes all that. Today, Mr. Martin, we declare you-a Bicentennial Man.\" And Andrew, smiling in return, held out his hand as though to shake that of the World Coordinator-despite the distance of a continent\u0027s width that actually lay between them. The gesture had been carefully rehearsed, everything measured down to the millimeter. And to the billions of onlookers it seemed that the two hands did in fact meet-a warm human gesture linking, for a moment, one man with the other.","sourceLink":"https://allnovel.net/the-positronic-man-robot-0-6/page-24.html","bookId":1745,"book":{"id":1745,"title":"The Positronic Man (Robot #0.6)","description":"Storyline: The Positronic Man (Robot 0.6) by Isaac Asimov, Robert Silverberg In a twenty-first century Earth where the development of the positronic brain has revolutionized the way of life, beloved household robot \"\"Andrew\"\" struggles with his unusual capacity for emotion and dreams of becoming human. Reprint.","cover":"https://allnovel.net/images/the-positronic-man-robot-0-6.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-positronic-man-robot-0-6.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:17:26 AM"}}
