{"id":62559,"no":16,"title":"Page 16","content":"ZHENGYI\u0027S ALTERNATE WORLD\n So complete was the castle construction that by the time the nine companions approached the front gates the next morning, they found a fanciful and well-designed flagstone walkway leading to them. On the walls to either side of the closed portcullis, half-formed gargoyles leered at the approaching troupe, and in the few moments it took them to reach the portcullis, those statues grew into an even more defined form.\n \"They will be ready to launch into the sky again this night,\" Mariabronne noted. \"Wingham would do well to force Palishchuk into a strong defensive posture.\"\n \"For all the good that\u0027ll do \u0027em,\" Athrogate grumbled.\n \"Then let us be quick about our task,\" Ellery replied.\n \"We heroes,\" Entreri muttered under his breath, so that only Jarlaxle, standing right beside him at the back of the line, could hear.\n The drow was about to respond, but he felt a sudden tug at his sensibilities. Not sure what that might mean, Jarlaxle put a hand over the magical button on his waistcoat, wherein he had stored the skull gem. A look of concern flashed over his angular face. Could it be that the magical gems could call to each other? Had he erred in bringing his skull gem near to the new construct?\n Mariabronne was first to the portcullis, its iron spikes as thick as his arms. He peered through the bars at the castle\u0027s lower bailey.\n \"It appears empty,\" he reported as the others came up beside him.\n \"I can get a grapnel over the wall, perhaps, and locate the hoist.\"\n \"No need,\" Canthan said, and the thin wizard nodded at Athrogate.\n \"Bah!\" the dwarf snorted and he moved up and gently nudged Mariabronne aside. \"Gonna pop out me guts, ye stupid mage.\"\n \"We all have our uses,\" Canthan replied to him. \"Some of us attend to them without so much blather, however.\"\n \"Some of ye sit back and wiggle yer fingers while some of us stop clubs with our faces.\"\n \"Good that there\u0027s not much beauty to steal then.\"\n \"Bah!\"\n The other seven listened with some amusement, but the banter struck Entreri and Jarlaxle more poignantly.\n \"Those two sound a bit familiar,\" Entreri lamented.\n \"Though not as witty, of course, and therein lies the rub,\" said the drow.\n Athrogate spat in his hands and grabbed at the portcullis, knees bent. He grunted and tried to straighten, to no effect, so he gave another roar, spat in his hands again, and reset his grip.\n \"A little help, if ye might,\" he said.\n Mariabronne grabbed the portcullis on one side of the dwarf, while both Pratcus and Olgerkhan positioned themselves on the other side.\n \"Not yerselves, ye bunch o\u0027 dolts,\" the dwarf grumbled.\n Behind them, Canthan completed the words of a spell and a wave of energy rolled out from the wizard\u0027s hands to encompass the dwarf. Muscles bulged and bones crackled as they grew, and Athrogate swelled to the size of a large man, and continued to grow.\n \"And again!\" the dwarf demanded, his voice even more resonant.\n Canthan uttered a second enchantment, and soon Athrogate was the size of an ogre, his already muscular arms as thick as old trees.\n \"Bah!\" he growled in his booming bass voice, and with a roar of defiance, he began to straighten his legs.\n The portcullis groaned in protest, but the dwarf pressed on, bringing it up from the ground.\n \"Get ye going!\" he howled, but even as he said it, even as Entreri and Ellery both made to dive under, Athrogate growled and began to bend, and the other three couldn\u0027t begin to slow the descent of the huge barrier.\n Entreri, the quicker by far to the ground, was also the quicker to halt his movement and spin back, and he managed to grab the diving Ellery as he went and deflect her enough so that she did not get pinned under the heavy spiked gate as it crashed back to earth. The commander cried out, as did Arrayan and Pratcus, but Canthan merely chuckled and Jarlaxle, caught up in the curious sensations of the skull gem, hadn\u0027t even heard the call or noticed the lifting of the portcullis, let alone the near loss of one of their companions. When he looked at Athrogate, suddenly so much larger than before, his eyes widened and he fell back several steps.\n \"Oh, ye son of a bar whore!\" Athrogate cursed, and it did not miss Jarlaxle\u0027s notice that Entreri shot the dwarf a quick glance that would have curdled milk. Because of the gate\u0027s swift descent, the drow wondered? Or was it those few words? Very rarely did Jarlaxle glimpse into the depths of the puzzle that was Artemis Entreri, for the disciplined assassin rarely wore his emotions in his expression.\n Every now and then, though....\n Athrogate stormed about, rubbing his calloused hands together and repeatedly tightening his belt, a great and decorated girdle with a silver buckle set with crossed lightning bolts.\n \"By the gods, dwarf,\" Mariabronne said to Athrogate. \"I do believe that you were lifting that practically by yourself, and that our helping hands were of little or no consequence. When you bent, I felt as if a mountain was descending upon me.\"\n \"Wizard\u0027s spell,\" Athrogate grumbled, though he hardly sounded convinced.\n \"Then I pray you cast the enchantment on us others,\" Mariabronne bade Canthan. \"This gate will rise with ease in that case.\"\n \"My spells are exhausted,\" the wizard said, as unconvincingly as the dwarf.\n Jarlaxle looked from Canthan to Athrogate, sizing them up. No doubt the spell of enlargement had played some role, but that was not the source of the dwarf\u0027s incredible strength. Again Athrogate went to his belt, tightening it yet another notch, and the drow smiled. There were girdles said to imbue their wearer with the strength of a giant, the greatest of which were the storm giants that threw lightning bolts across mountain peaks. Jarlaxle focused on Athrogate\u0027s belt buckle and the lightning bolts it displayed.\n Athrogate went back to stand in front of the portcullis, hands on hips and staring at it as if it were a betraying wife. Once or twice he started to reach out and touch the thick bars, but always he retracted his hands and grumbled.\n \"I ain\u0027t about to lift it,\" he finally admitted.\n The dwarf grumbled again and nodded as the first of Canthan\u0027s enlargement dweomers wore off, reducing him to the size of a large man. By the time Athrogate sighed and turned about, he was a dwarf again. Intimidating, to be sure, but still a dwarf.\n \"Over the wall, then,\" said Mariabronne.\n \"Nah,\" the dwarf corrected.\n He pulled his twin morning stars off of his back and set them to twirling, glassteel gleaming dully in the soft morning light. He brought the handle of the one in his left hand up before his face and whispered something. A reddish-gray liquid began to ooze from the small nubs on the striking ball, coating the whole of the business end of the weapon. Then he brought up the right-hand weapon and similarly whispered, and the liquid oozed forth on that one too, only the gooey stuff was blue-gray instead of red.\n \"Get back, ye dolt,\" he said when Ellery moved near to investigate. \"Ye\u0027re not for wanting to get any o\u0027 this on that splendid silver armor o\u0027 yers. Haha!\"\n His laugh became a growl and he put his morning stars up in whistling spins above his head. Then he turned a complete circuit, gathering momentum, and launched the red-covered weapon head in a mighty swing against one of the portcullis\u0027s vertical bars. He followed with a smash from the other weapon, one that created an explosion that shook the ground beneath the feet of all the stunned onlookers. Another spin became a second thunderous retort, the dwarf striking - one, two, and always with the red-colored morning star leading - a perpendicular bar.\n Another hit took that crossing, horizontal bar again. To the amazement of all save Canthan, who stood watching with a sour expression, the thick cross bar broke in half, midway between two vertical spikes. Athrogate back went to work on his initial target, one of those spikes.\n The red-colored weapon head clanged against it, about eye level with the furious, wildly-dancing dwarf, followed by a strike with the bluish one a bit lower down.\n The spike bent outward. Athrogate hit it again in the same place, once, twice, and the spike fell away, leaving enough room for the companions to squeeze through and into the castle bailey.\n Athrogate came to a sudden stop, his morning star heads bouncing around him. He planted his hands on his hips and inspected his handiwork then gave a nod of acceptance.\n \"For a bit of a kick is why ye got me hired. Anything else ye\u0027re wantin\u0027 blasting while I got \u0027em fired?\"\n Seven stunned expressions and the look of one bored wizard came back at him, eliciting a roaring, \"Bwahaha!\"\n \"Would that he slips with both and hits himself repeatedly in the face,\" Entreri muttered to Jarlaxle.\n \"So then when he\u0027s gone, my friend Entreri can take his place?\" the drow quipped back.\n \"Shut up.\"\n \"He is a powerful ally.\"\n \"And a mighty enemy.\"\n \"Watch him closely, then.\"\n \"From behind,\" Entreri agreed.\n Entreri did just that, staring hard at the dwarf, who stood with hands on hips, gazing through the gap he had hammered in the portcullis. The power of those swings, magic and muscle, were noteworthy, the assassin knew, as was the ease with which Athrogate handled his weapons. Entreri didn\u0027t particularly like the dwarf and wanted to throttle him with every stupid rhyme, but the assassin respected the dwarf\u0027s martial prowess. He suspected that he would soon come to blows with Athrogate, and he was not looking forward to the appointment.\n Before the group, beyond the corridor cutting between the two small gatehouses, the castle\u0027s lower bailey opened wide. To either side of the gatehouse corridor they could see openings: stairwells leading to the wall top, with perhaps inner tunnels snaking through the wide walls.\n \"Left, right, or center?\" Athrogate asked. \"Best we quickly enter.\"\n \"Will you stop that?\" Entreri demanded, and he got a typical, \"Bwahaha!\" in reply.\n \"The book is straight back, yes?\" Mariabronne asked Arrayan, who was standing at his side.\n The woman paused for a moment and tried to get her bearings. Her eyes fixed upon the central keep, the largest structure in the castle, which loomed beyond the inner bailey wall.\n \"Yes,\" she said, \"straight back. I think.\"\n \"Do better than that,\" Canthan bade her, but Arrayan had only a weak and apologetic expression in response.\n \"Then straight ahead,\" Ellery told the dwarf.\n Entreri noticed that Jarlaxle moved as if to say something in protest. The drow stayed silent, though, and noted the look the assassin was offering his way.\n \"Be ready,\" Jarlaxle quietly warned.\n \"What do you know?\"\n Jarlaxle only shrugged, but Entreri had been around the drow long enough to understand that he would not have said anything if he wasn\u0027t quite sure that trouble was looming. In looking at the castle, the dark stones and hard iron, Entreri had the same feeling.\n They moved through the gates and halted on the muddy courtyard, Athrogate at the lead, Pratcus and Ellery close behind. Jarlaxle paused as soon as he slipped through the portcullis, and swayed with a sudden weakness. An overwhelming feeling of power seemed to focus its sentient attention on him. He looked at Arrayan and knew immediately that it was not her. The castle had progressed far beyond her.\n The drow\u0027s eyes went to the ground ahead, and in his mind he looked down, down, past the skeletons buried in the old graveyard, for that is what the place once had been. He visualized tunnels and a great chamber. He knew that something down there was waiting for him.\n The others took no note of Jarlaxle\u0027s delay, for they were more concerned with what lay ahead. A few stone buildings dotted the open bailey: a stable against the left-hand wall immediately inside, a blacksmith\u0027s workshop situated in the same place on the right, and a pair of long, low-ceilinged barracks stretching back from both side walls to the base of the taller wall that blocked the inner bailey. The only freestanding structure was a round, two-story, squat tower, set two-thirds of the way across the courtyard before the gates of the inner wall.\n Mariabronne moved up beside Ellery and motioned to the tower. The commander nodded her agreement and waved for Athrogate to lead the way.\n \"I would not...\" Jarlaxle started to say, but his words were buried by Athrogate\u0027s sudden shout.\n All eyes turned to the dwarf as he leaped back - or tried to, for a skeletal hand had thrust up through the soft summer tundra dirt to hold fast his ankle. Athrogate twisted, yelped, and went tumbling to the ground. He was back to his feet almost as soon as he landed, though, leaping up and shouting out again, but in rage, not surprise.\n The skeletal hand clawed higher into the air, a bony arm coming out to the elbow.\n Athrogate\u0027s morning star smashed it to dust.\n But the skeleton\u0027s other hand prodded through the soil to the side, and as the dwarf moved to smash that one he cried,\n \"Hunnerds!\"\n Perhaps it was an exaggeration borne of shock, or perhaps it was an accurate assessment, for all across soft ground of the outer bailey, the skeletal hands of long-dead humanoids clawed up through the hard soil.\n Athrogate finished the skeleton\u0027s second hand and charged ahead, roaring, \"Skinny bones to grind to dust!\"\n And Pratcus leaped up right beside him. Presenting his anvil-shaped holy symbol, the priest swore, \"By the wisdom of Moradin, the grace of Dumathoin and the strength of Clangeddin, I damn thee foul beasts to dust!\"\n One skeleton, half out of its hole, vibrated under waves of unseen energy, its bony frame rattling loudly. But the others, all across the way, continued to claw their way free of the turf.\n Black spots danced before Jarlaxle\u0027s eyes, and his head thrummed with a rhythmic chanting, an arcane and evil-sounding cant, calling to the skeletons. The skull-shaped gem in his button seemed to gain weight and substance then, and he felt it vibrating on his chest. Through its power the drow keenly sensed the awakening around him, and understood the depth of the undead parade. From the sheer strength of the call, he expected that the place had served as a burial ground for the Palishchuk half-orcs, or their orc ancestors, for centuries.\n Hundreds of skeletal teeth rattled in the drow\u0027s thoughts. Hundreds of long-dead voices awakened once more in a communal chanted song. And there remained that one, deeper, larger force, overwhelming with its strength.\n He felt a squeeze on his biceps and cried out, then spun and used the magic of his bracer to drop a dagger into his hand. He started to strike but felt his wrist grabbed suddenly, brutally. Jarlaxle opened his eyes as if awakening from a bad dream, and there stood a confused and none-too-happy Artemis Entreri, holding him arm and wrist, and staring at him dumbfounded.\n \"No, it is all right,\" the dark elf assured him as he shook his head and pulled away.\n \"What are you seeing?\" Entreri asked. \"What do you know?\"\n \"That we are in trouble,\" the drow answered, and together, the pair turned to face the rising onslaught.\n \"Cleave with your sword, don\u0027t stab,\" the drow informed Entreri.\n \"Good to have you looking out for me,\" Entreri sarcastically replied before he leaped forward and slashed across at an approaching skeleton.\n Charon\u0027s Claw cut through the reaching monster\u0027s ribs to slam hard against its backbone. Entreri expected the blow to cut the skinny undead monstrosity in half, but the skeleton staggered a couple of steps to the side and came on again.\n And again Entreri hit it, even harder.\n Then again as the stubborn creature relentlessly moved in.\n The assassin fell back a step, then dived sidelong as a brilliant bolt of lightning flashed before him, blasting through the skeleton.\n The bony monster staggered several steps with that hit, and a pair of ribs fell away, along with one arm. But still it came on, heading toward the disbelieving Jarlaxle and the slender wand the drow held.\n Entreri waded in and cracked the skeleton\u0027s skull with a two-handed downward chop.\n Finally, the undead creature fell to the ground, its bony frame folding up into a neat pile.\n \"Not your ordinary animations,\" Jarlaxle remarked.\n \"We are in trouble,\" Entreri agreed.\n Pratcus stared at his anvil-shaped silver holy symbol as if it had deceived him. The dwarf\u0027s lip quivered and he whispered the name of his gods, one after another, the trembling in his voice begging them for an explanation.\n \"Blunt weapons!\" he heard Mariabronne cry. \"Shatter their bones!\"\n But the dwarf priest stood there, shaking his head in disbelief.\n A bony hand came out of the ground and grabbed him by the ankle, but Pratcus, still muttering, easily managed to yank his foot away. A second hand clawed forth from the ground and in the torn turf between them, the top of a skull appeared.\n Pratcus howled, and he held the screaming note, leaped into the air, and dropped straight down, his metal-shod fist leading in a pile-driving punch atop the skull. He felt the bone crackle beneath him, but the angry dwarf, far from satisfied, put his feet under him again. He leaped up and bashed the skull again, smashing his hand right through it.\n The reaching fingers on the skeletal hands shivered and bent over, becoming very still.\n \"Good enough for ye, ye devils,\" the confused and angry dwarf remarked then he slugged the skull yet again.\n Mariabronne didn\u0027t draw his long sword but instead brought forth a small mace. Relying more on speed and skill than on brute force, the ranger whirled, slapping repeatedly at a pair of skeletons coming in at him. None of the blows was heavy in nature, but chip after chip fell away as Mariabronne, seeming almost like a king\u0027s drummer, rattled off dozens of strikes.\n Beside him, Ellery didn\u0027t bother changing weapons, as her heavy-bladed axe was equally devastating to bone as to flesh. Fragments of rib or arm or leg splintered under her devastating chops. But still the skeletons came on, undeterred and unafraid, and for every one that Ellery or Mariabronne broke apart, two more took its place.\n Behind them Olgerkhan worked his club frantically and Arrayan fired off a series of minor magic spells, glowing missiles of pure energy, mostly. But neither were overly effective, and both half-orcs were obviously tiring quickly again.\n Olgerkhan shielded Arrayan with his sizeable bulk and grunted more in pain than battle rage as bony fingers raked at his flesh. Then he howled in terror as one skeleton slipped past him. It had an open path to Arrayan.\n The large half-orc tried to turn and catch up but was surprised to learn that he didn\u0027t have to, for the animated undead monster did not approach the woman.\n Olgerkhan believed he knew why. He closed on the skeleton and smashed it with all his strength anyway, not wanting the others to take note of its aversion to Arrayan.\n Of all the companions, none was better equipped to deal with such creatures than was Athrogate. His spinning morning stars, though he hadn\u0027t placed any of the enchantments upon them, devastated the skeletal ranks, each strike reducing bone to dust or launching a skull from its perch atop a bony spine. The dwarf truly seemed to be enjoying himself as he leaped ahead of the others into the midst of the skeletal swarm. His weapons worked in a devastating blur, and white powder filled the air around him, every explosive hit accompanied by his howling laughter.\n Canthan stayed close to his diminutive companion the whole time. The wizard enacted only one more spell, summoning a huge, disembodied, semi-translucent hand that floated in mid-air before him.\n A skeleton rushed in at him and the five-fingered guardian grasped it, wrapping huge digits around its bony frame. With a grin and a thought, Canthan commanded the hand to squeeze, and the skeleton shattered beneath the power of its grip.\n The hand, closed into a fist, darted across as a second skeleton approached the wizard. The spell effect slugged the creature hard and sent it flying away.\n \"Press on,\" Mariabronne ordered. \"The keep is our goal - our only goal!\"\n But the ranger\u0027s words were lost to the wind a moment later, when Olgerkhan faltered and cried out. Mariabronne turned to see the large half-orc slump to one knee, his half-hearted swings barely fending the clawing skeletons.\n \"Dwarves, to him!\" the ranger cried.\n Pratcus took up the charge, throwing himself at the skeletons crushing in around Olgerkhan, but Athrogate was too far away and too wildly engaged to begin to extract himself.\n Similarly, Jarlaxle had lagged behind back by the wall. The drow showed no eagerness to wade out into the mounting throng of undead, despite the fact that his companion, though his weapons were ill-suited for battling skeletons, had moved toward the half-orcs before the ranger had even cried out.\n Canthan, too, did not go for Olgerkhan and Arrayan, but instead slipped to one side as the ranger and Ellery turned and went for the half-orcs. Canthan retreated to the position held clear by Jarlaxle. With a thought, the wizard sent his enchanted hand back out behind him, gigantic fingers flicking aside skeletons. It reached Athrogate, who looked at it with some curiosity. Then it grabbed the dwarf and lifted him from his feet. The hand sped him in fast pursuit of its wizard master.\n Mariabronne, Ellery, and Pratcus formed a defensive triangle around Olgerkhan, beating back the skeletons\u0027 assault. Entreri, meanwhile, grabbed Arrayan by the arm and started to pull her away, slashing aside any undead interference.\n \"Come along,\" he ordered the woman, but he felt her lagging behind, and when he glanced at her, he understood why.\n Arrayan collapsed to the ground.\n Entreri sheathed his weapons, slipped his arm around her shoulders, then slid his other arm under her knees and hoisted her. Slipping in and out of consciousness, Arrayan still managed to put her arms around Entreri\u0027s neck to help secure the hold.\n The assassin ran off, zigzagging past the skeletons.\n Behind Entreri, when a break finally presented itself, Mariabronne grabbed Olgerkhan and ushered him to his feet. Still, when the ranger let him go, the half-orc nearly fell over again.\n \"I do so enjoy baby-sitting,\" Canthan muttered as Entreri carried the nearly unconscious Arrayan beside him.\n Entreri scowled, and for a moment both Jarlaxle and Canthan thought he might lash out at the insulting wizard.\n \"Is she wounded?\" the drow asked.\n Entreri shrugged as he considered the shaky woman, for he saw no obvious signs of injury.\n \"Yes, pray tell us why our friend Arrayan needs to be carried around when there is not a drop of her blood spilled on the field,\" Canthan put in.\n Again Entreri scowled at him. \"Tend to your friend, wizard,\" he said, a clear warning, as the disembodied hand floated in and deposited a very angry Athrogate on the ground before them.\n \"Join up and battle to the keep!\" Mariabronne called to the group.\n \"Too many,\" Jarlaxle shouted back. \"We cannot fight them on the open field. Our only hope is through the wall tunnels.\"\n Mariabronne didn\u0027t immediately answer, but one look across the field showed him and the three with him that the drow\u0027s observations were on target. For dozens of skeletons were up and approaching and more clawing skeletal hands were tearing through practically every inch of turf across the outer bailey.\n \"Clear a path for them,\" Canthan ordered Athrogate.\n The dwarf gave a great snort and set his morning stars to spinning again. Canthan\u0027s huge magical hand worked beside him, and soon the pair had cleared the way for Mariabronne and the other three to rejoin those at the wall.\n Jarlaxle disappeared into the left-hand gatehouse, then came back out a few moments later and motioned for them all to follow. Shielded by Canthan\u0027s magical hand, holding back the undead horde, all nine slipped into the gatehouse and into the tunnel beyond. A heavy door was set at the end of that tunnel, which Mariabronne closed and secured not a moment too soon, for before the ranger had even turned around to regard the other eight, the clawing of skeletal fingers sounded on the portal.\n \"An auspicious beginning, I would say,\" said Canthan.\n \"The castle protects itself,\" Jarlaxle agreed.\n \"It protects many things, so it would seem,\" Canthan replied, and he managed a sly glance Arrayan\u0027s way.\n \"We cannot continue like this,\" Mariabronne scolded. \"We are fighting in pockets, protective of our immediate companions and not of the group as a whole.\"\n \"Might be that we didn\u0027t think some\u0027d be needin\u0027 so much damn protecting,\" Athrogate muttered, his steely-eyed gaze locked on the two half-orcs.\n \"It is what it is, good dwarf,\" said the ranger. \"This group must find harmony and unity if we are to reach the keep and find our answers. We are here together, nine as one.\"\n \"Bah!\"\n \"Therein lies our only hope,\" said Mariabronne.\n To the apparent surprise of Athrogate, Canthan agreed. \"True enough,\" the wizard said, cutting the dwarf\u0027s next grunt short. \"Nine as one and working toward a single goal.\"\n The timbre of his voice was less than convincing, and it didn\u0027t pass the notice of both Entreri and Jarlaxle that Canthan had cast a glance Arrayan\u0027s way as he spoke. \n","sourceLink":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2/page-16.html","bookId":1520,"book":{"id":1520,"title":"Promise of the Witch King (The Sellswords #2)","description":"Storyline: \n The Sellswords #2: The Promise of the Witch King \n The book was hidden well. It\u0027s pages promised the power of the Witch-King himself. And now that it\u0027s been found, even the fact that it kills anyone foolish enough to crack its cover won\u0027t stop people from fighting over it. Welcome to the Bloodstone Lands! Human assassin Artemis Entreri and his dark elf companion Jarlaxle have come to the demon-haunted wastelands of the frozen north at the request of their dragon patron. It doesn\u0027t take long for them to find themselves caught in the middle of a struggle between powerful forces that would like nothing more than to see them both dead... or worse. But Entreri and Jarlaxle aren\u0027t just any wandering sellswords, and the ancient evils and bitter blood-feuds of the wild Bloodstone Lands may have finally met their match.\n \n","cover":"https://allnovel.net/images/promise-of-the-witch-king-the-sellswords-2.jpg","author":"R.A. Salvatore","type":"Adventure","source":"allnovel","link":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:42:23 AM"}}
