{"id":62549,"no":6,"title":"Page 6","content":"NOT SO MUCH AN ORC Arrayan Faylin pulled herself out of her straw bed, dragging her single blanket along with her and wrapping it around her surprisingly delicate shoulders. That distinctly feminine softness was reflective of the many surprises people found when looking upon Arrayan and learning of her heritage. She was a half-orc, like the vast majority of residents in the cold and windswept city of Palishchuk in the northeastern corner of Vaasa, a settlement in clear view of the towering ice river known as the Great Glacier. Arrayan had human blood in her as well - and some elf, so her mother had told her - and certainly her features had combined the most attractive qualities of all her racial aspects. Her reddish-brown hair was long and so soft and flowing that it often seemed as if her face was framed by a soft red halo. She was short, like many orcs, but perhaps as a result of that reputed elf blood, she was anything but stocky. While her face was wide, like that of an orc, her other features - large emerald green eyes, thick lips, narrow angled eyebrows, and a button nose - were distinctly unorclike, and that curious blend, in Arrayan\u0027s case, had a way of accenting the positives of the attributes from every viewing angle. She stretched, yawned, shook her hair back from her face, and rubbed her eyes. As the mental cobwebs of sleep melted away, Arrayan\u0027s excitement began to mount. She moved quickly across the room to her desk, her bare feet slapping the hard earth floor. Eagerly she grabbed her spellbook from a nearby shelf, used her other hand to brush clear the center area of the desk then slid into her chair, hooking her finger into the correct tab of the organized tome and flipping it open to the section entitled \"Divination Magic.\" As she considered the task ahead of her, her fingers began trembling so badly that she could hardly turn the page. Arrayan fell back in her seat and forced herself to take a long, deep breath. She went over the mental disciplines she had learned several years before in a wizard\u0027s tower in distant Damara. If she could master control as a teenager, certainly in her mid-twenties she could calm her eagerness. A moment later, she went back to her book. With a steady hand, the wizard examined her list of potential spells, discerned those she believed would be the most useful, including a battery of magical defenses and spells to dispel offensive wards before they were activated, and began the arduous task of committing them to memory. A knock on her door interrupted her a few minutes later. The gentle nature of it, but with a sturdiness behind it to show that the light tap was deliberate, told her who it might be. She turned in her chair as the door pushed open, and a huge, grinning, tusky face poked in. The half-orc\u0027s wide eyes clued Arrayan in to the fact that she had let her blanket wrap slip a bit too far, and she quickly tightened it around her shoulders. \"Olgerkhan, well met,\" she said. It didn\u0027t surprise her how bright her voice became whenever that particular half-orc appeared. Physically, the two seemed polar opposites, with Olgerkhan\u0027s features most definitely favoring his orc side. His lip was perpetually twisted due to his huge, uneven canines, and his thick forehead and singular bushy brow brought a dark shadow over his bloodshot, jaundiced eyes. His nose was flat and crooked, his face marked by small and uneven patches of hair, and his forehead sloped out to peak at that imposing brow. He wasn\u0027t overly tall, caught somewhere between five-and-a-half and six feet, but he appeared much larger, for his limbs were thick and strong and his chest would have fit appropriately on a man a foot taller than he. The large half-orc licked his lips and started to move his mouth as if he meant to say something. Arrayan pulled her blanket just a bit tighter around her. She really wasn\u0027t overly embarrassed; she just didn\u0027t give much thought to such things, though Olgerkhan obviously did. \"Are they here?\" Arrayan asked. Olgerkhan glanced around the room, seeming puzzled. \"The wagons,\" Arrayan clarified, and that brought a grin to the burly half-orc\u0027s face. \"Wingham,\" he said. \"Outside the south gate. Twenty colored wagons.\" Arrayan returned his smile and nodded, but the news did cause her a bit of trepidation. Wingham was her uncle, though she had never really seen him for long enough stretches to consider herself to be close to him and his traveling merchant band. In Palishchuk, they were known simply as \"Wingham\u0027s Rascals,\" but to the wider region of the Bloodstone Lands, the band was called \"Weird Wingham\u0027s Wacky Weapon Wielders.\" \"The show is everything,\" Wingham had once said to Arrayan, explaining the ridiculous name. \"All the world loves the show.\" Arrayan smiled even wider as she considered his further advice that day when she was but a child, even before she had gone to Damara to train in arcane magic. Wingham had explained to her that the name, admittedly stupid, was a purposeful calling card, a way to confirm the prejudices of the humans, elves, dwarves, and other races. \"Let them think us stupid,\" Wingham had told her with a great flourish, though Wingham always spoke with a great flourish. \"Then let them come and bargain with us for our wares!\" Arrayan realized with a start that she had paused for a long while. She glanced back at Olgerkhan, who seemed not to have noticed. \"Any word?\" she asked, barely able to get the question out. Olgerkhan shook his thick head. \"They dance and sing but little so far,\" he explained. \"Those who have gone out to enjoy the circus have not yet returned.\" Arrayan nodded and jumped up from her seat, moving swiftly across the room to her wardrobe. Hardly considering the action, she let her blanket fall - then caught it at the last moment and glanced back sheepishly to Olgerkhan. He averted his eyes to the floor and crept back out of the room, pulling the door closed. He was a good one, Arrayan realized, as she always tried to remind herself. She dressed quickly, pulling on leather breeches and a vest, and a thin belt that held several pouches for spell components, as well as a set of writing materials. She started for the door but paused and pulled a blue robe of light material from the wardrobe, quickly removing the belt then donning the robe over her outfit. She rarely wore her wizard robes among her half-orc brethren, for they considered the flowing garment with its voluminous sleeves of little use, and the only fashion the males of Palishchuk seemed to appreciate came from her wearing less clothing, not more. The robe was for Wingham, Arrayan told herself as she refitted the belt and rushed to the door. Olgerkhan was waiting patiently for her, and she offered him her arm and hurried him along to the southern gate. A crowd had gathered there, flowing out of the city of nearly a thousand residents. Filtering her way through, pulling Olgerkhan along, Arrayan finally managed to get a glimpse of the source of the commotion, and like so many of her fellow Palishchukians, she grinned widely at the site of Weird Wingham\u0027s Wacky Weapon Wielders. Their wagon caravan had been circled, the bright colors of the canopies and awnings shining brilliantly in the glow of the late-summer sun. Music drifted along the breeze, carrying the rough-edged voice of one of Wingham\u0027s bards, singing a tale of the Galena Mountains and Hillsafar Hall. Like all the rest swept up in the excitement, Arrayan and Olgerkhan found themselves walking more swiftly then even jogging across the ground, their steps buoyed by eagerness. Wingham\u0027s troupe came to Palishchuk only a few times each year, sometimes only once or twice, and they always brought with them exotic goods bartered in faraway lands, and wondrous tales of distant heroes and mighty villains. They entertained the children and adults alike with song and dance, and though they were known throughout the lands as difficult negotiators, any of the folk of Palishchuk who purchased an item from Weird Wingham knew that he was getting a fine bargain. For Wingham had never forgotten his roots, had never looked back with anything but love on the community that had worked so hard to allow him and all the other half-orcs of his troupe to shake off the bonds of their heritage. A pair of jugglers anchored the main opening into the wagon circle, tossing strange triple-bladed knives in an unbroken line back and forth to each other, the weapons spinning over the heads of nervous and delighted Palishchukians as they entered or departed. Just inside the ring, a pair of bards performed, one playing a curved, flutelike instrument while the other sang of the Galenas. Small kiosks and racks of weapons and clothing filled the area, and the aroma of a myriad of exotic perfumes and scented candles aptly blanketed the common smell of rot in the late summer tundra, where plants grew fast and died faster through the short mild period, and the frozen grip on the topsoil relinquished, releasing the fragrance of seasons past. For a moment, a different and rarely felt aspect of Arrayan\u0027s character filtered through, and she had to pause in her step to bask in the vision of a grand ball in a distant city, full of dancing, finely dressed women and men. That small part of her composite didn\u0027t hold, though, when she noticed an old half-orc, bent by age, bald, limping, but with a sparkle in his bright eyes that could not help but catch the eye, however briefly, of any young woman locking stares with him. \"Mistress Maggotsweeper!\" the old half-orc cried upon seeing her. Arrayan winced at the correct recital of her surname, one she had long ago abandoned, preferring her Elvish middle name, Faylin. That didn\u0027t turn her look sour, though, for she knew that her Uncle Wingham had cried out with deep affection. He seemed to grow taller and straighter as she closed on him, and he wrapped her in a tight and powerful hug. \"Truly the most anticipated, enjoyable, lovely, wonderful, amazing, and most welcome sight in all of Palishchuk!\" Wingham said, using the lyrical barker\u0027s voice he had so mastered in his decades with his traveling troupe. He pushed his niece back to arms\u0027 length. \"Every time I near Palishchuk, I fear that I will arrive only to discover that you are off to Damara or somewhere other than here.\" \"But you know that I would return in a hurry if I learned that you were riding back into town,\" she assured him, and his eyes sparkled and his crooked smile widened. \"I have ridden back with some marvelous finds again, as always,\" Wingham promised her with an exaggerated wink. \"As always,\" she agreed, her tone leading. \"Playing coy?\" At Arrayan\u0027s side, Olgerkhan grunted disapprovingly, even threateningly, for \"coy\" - koi in the Orcish tongue - was the name of a very lewd game. Wingham caught the hint in the overprotective warning and backed off a step, eyeing the brutish Olgerkhan without blinking. Wingham hadn\u0027t survived the harshness of Vaasa for so many years by being blind to any and every potential threat. \"Not koi,\" Arrayan quickly explained to her bristling companion. \"He means sly, sneaky. My uncle is implying that I might know something more than I am telling him.\" \"Ah, the book,\" said Olgerkhan. Arrayan sighed and Wingham laughed. \"Alas, I am discovered,\" said Arrayan. \"And I thought that your joy was merely at the sight of me,\" Wingham replied with feigned disappointment. \"It is!\" Arrayan assured him. \"Or would be. I mean... there is no..., Uncle, you know...\" Though he was obviously enjoying the sputtering spectacle, Wingham mercifully held up a hand to calm the woman. \"You never come out to find me on the morning of the first day, dear niece. You know that I will be quite busy greeting the crowd. But I am not surprised to see you out here this day, this early. Word has preceded me concerning Zhengyi\u0027s writing.\" \"Is it truly?\" Arrayan asked, hardly able to get the words out of her mouth. She practically leaped forward as she spoke them, grabbing at her uncle\u0027s shoulders. Wingham cast a nervous glance around them. \"Not here, girl. Not now,\" he quietly warned. \"Come tonight when the wagons\u0027 ring is closed and we shall speak.\" \"I cannot wait for - \" Arrayan started to say, but Wingham put a finger over her lips to silence her. \"Not here. Not now. \"Now, dear lady and gentleman,\" Wingham said with his showman\u0027s flourish. \"Do examine our exotic aromas, some created as far away as Calimshan, where the wind oft carries mountains of sand so thick that you cannot see your hand if you put it but an inch from your face!\" Several other Palishchukian half-orcs walked by as Wingham spoke, and Arrayan understood the diversion. She nodded at her uncle, though she was truly reluctant to leave, and pulled the confused Olgerkhan away. The couple browsed at the carnival for another hour or so then Arrayan took her leave and returned to her small house. She spent the entirety of the afternoon pacing and wringing her hands. Wingham had confirmed it: the book in question was Zhengyi\u0027s. Zhengyi the Witch-King\u0027s own words! Zhengyi, who had dominated dragons and spread his darkness across all the Bloodstone Lands. Zhengyi, who had mastered magic and death itself. Mighty beings such as the Witch-King did not pen tomes idly or carelessly. Arrayan knew that Wingham understood such things. The old barker was no stranger to items of magical power. The fact that Wingham wouldn\u0027t even discuss the book publicly told Arrayan much; he knew that it was a special item. She had to wait, and the sunset couldn\u0027t come fast enough for her. When it arrived, when finally the bells began to signal the end of the day\u0027s market activity, Arrayan grabbed a wrap and rushed out her door. She wasn\u0027t surprised to find Olgerkhan waiting for her, and together they moved swiftly through the city, out the southern gate, and back to Wingham\u0027s circled wagons. The guards were ushering out the last of the shoppers, but they greeted Arrayan with a nod and allowed her passage into the ring. She found Wingham sitting at the small table set in his personal wagon, and at that moment he seemed very different from the carnival barker. Somber and quiet, he barely looked up from the table to acknowledge the arrival of his niece, and when she circled him and regarded what lay on the table before him, Arrayan understood why. There sat a large, ancient tome, its rich black cover made of leather but of a type smoother and thicker than anything Arrayan had ever seen. It invited touching for its edges dipped softly over the pages they protected. Arrayan didn\u0027t dare, but she did lean in a bit closer, taking note of the various designs quietly and unobtrusively etched onto the spine and cover. She made out the forms of dragons, some curled in sleep, some rearing and others in graceful flight, and it occurred to her that the book\u0027s soft covering might be dragon hide. She licked her dry lips and found that she was suddenly unsure of her course. Slowly and deliberately, the shaken woman took the seat opposite her uncle and motioned for Olgerkhan to stay back by the door. A long while passed, and Wingham showed no signs of breaking the silence. \"Zhengyi\u0027s book?\" Arrayan mustered the courage to ask, and she thought the question incredibly inane, given the weight of the tome. Finally, Wingham looked up at her and gave a slight nod. \"A spellbook?\" \"No.\" Arrayan waited as patiently as she could for her uncle to elaborate, but again, he just sat there. The uncustomary behavior from the normally extroverted half-orc had her on the edge of her seat. \"Then what - ?\" she started to ask. She was cut short by a sharp, \"I don\u0027t know.\" After yet another interminable pause, Arrayan dared to reach out for the tome. Wingham caught her hand and held it firmly, just an inch from the black cover. \"You have equipped yourself with spells of divination this day?\" he asked. \"Of course,\" she answered. \"Then seek out the magical properties of the tome before you proceed.\" Arrayan sat back as far as she could go, eyeing her uncle curiously. She had never seen him like this, and though the sight made her even more excited about the potential of the tome, it was more than a little unsettling. \"And,\" Wingham continued, holding fast her hand, \"you have prepared spells of magical warding as well?\" \"What is it, uncle?\" The old half-orc stared at her long and hard, his gray eyes flashing with intrigue and honest fear. Finally he said, \"A summoning.\" Arrayan had to consciously remember to breathe. \"Or a sending,\" Wingham went on. \"And no demon is involved, nor any other extra-planar creatures that I can discern.\" \"You have studied it closely?\" \"As closely as I dared. I am not nearly proficient enough in the Art to be attempting such a tome as this. But I know how to recognize a demon\u0027s name, or a planar\u0027s, and there is nothing like that in this tome.\" \"A spell of divination told you as much?\" \"Hundreds of such spells,\" Wingham replied. He reached down and produced a thin black metal wand from his belt, holding it up before him. \"I have burned this empty - thrice - and still my clues are few. I am certain that Zhengyi used his magic to conceal something... something magnificent. And certain I am, too, that this tome is a key to unlocking that concealed item, whatever it might be.\" Arrayan pulled her hand free of his grasp, started to reach for the book, but changed her mind and crossed both of her hands in her lap. She sat alternately staring at the tome and at her uncle. \"It will certainly be trapped,\" Wingham said. \"Though I have been able to find none - and not for lack of trying!\" \"I was told that you only recently found it,\" said Arrayan. \"Months ago,\" replied Wingham. \"I spoke of it to no one until I had exhausted all of my personal resources on it. Also, I did not want the word of it to spread too wide. You know that many would be interested in such a tome as this, including more than a few powerful wizards of less than sterling reputation.\" Arrayan let it all sink in for a moment, and she began to grin. Wingham had waited until he was nearing Palishchuk to let the word slip out of Zhengyi\u0027s tome because he had planned all along to give it to Arrayan, his powerful magic-using niece. His gift to her would be her own private time with the fascinating and valuable book. \"King Gareth will send investigators,\" Wingham explained, further confirming Arrayan\u0027s suspicions. \"Or a group, perhaps, whose sole purpose will be to confiscate the tome and return it to Bloodstone Village or Heliogabalus, where more powerful wizards ply their craft. Few know of its existence - those who have heard the whispers here in Palishchuk and Mariabronne the Rover.\" Arrayan perked up at the mention of Mariabronne, a tracker whose title was nearing legendary status in the wild land. Mariabronne had grown quite wealthy on the monster-ear bounty offered at the Vaasan Gate, so it was rumored. He knew almost everyone, and everyone knew him. Friendly and plain-spoken, cunning and clever, but disarmingly simple, the ranger had a way of putting people - even those well aware of his reputation - into a position of underestimating him. Arrayan had met him only twice, both times in Palishchuk, and had found herself laughing at his many tales, or sitting wide-eyed at his recounting of amazing adventures. He was a tracker by trade, a ranger in service to the ways of the wilderness, but by Arrayan\u0027s estimation, he was possessed of a bard\u0027s character. There was mischief behind his bright and curious eyes to be sure. \"Mariabronne will ferry word to Gareth\u0027s commanders at the Vaasan Gate,\" Wingham went on, and the sound of his voice broke Arrayan from her contemplations. His smile as she looked up to regard him told the woman that she had betrayed quite a few of her feelings with her expressions, and she felt her cheeks grow warm. \"Why did you tell anyone?\" she asked. \"This is too powerful a tome. Its powers are beyond me.\" \"And yet you will allow me to inspect it?\" \"Your powers with such magic are beyond mine.\" Arrayan considered the daunting task before her in light of the deadline Wingham\u0027s revelations to Mariabronne had no doubt put upon her. \"Fear not, dear niece, my words to Mariabronne were properly cryptic - more so even than the whispers I allowed to drift north to Palishchuk, where I knew they would find your ears. He likely remains in the region and nowhere near the Gate, and I fully expect to see him again before he goes to Gareth\u0027s commanders. You will have all the time you need with the tome.\" He offered Arrayan a wink then motioned to the black-bound book. The woman stared at it but did not move to turn over its cover. \"You have not prepared any magical wards,\" Wingham reasoned after a few long moments. \"I did not expect... it is too...\" Wingham held up his hand to stop her. Then he reached back behind his chair and pulled out a leather bag, handing it across to Arrayan. \"Shielded,\" he assured her as she took it. \"No one watching you, even with a magical eye, will understand the power of the item contained within this protected satchel.\" Arrayan could hardly believe the offer. Wingham meant to allow her to take the book with her! She could not hide her surprise as she continued to consider her uncle, as she replayed their long and intermittent history. Wingham didn\u0027t know her all that well, and yet he would willingly hand over what might prove to be the most precious item he had ever uncovered in his long history of unearthing precious artifacts? How could she ever prove herself worthy of that kind of trust? \"Go on, niece,\" Wingham bade her. \"I am not so young and am in need of a good night\u0027s sleep. I trust you will keep your ever-curious uncle informed of your progress?\" Hardly even thinking of the movement, Arrayan lifted out of her chair and leaned forward, wrapping Wingham with her slender arms and planting a huge kiss on his cheek.","sourceLink":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2/page-6.html","bookId":1520,"book":{"id":1520,"title":"Promise of the Witch King (The Sellswords #2)","description":"Storyline: The Sellswords #2: The Promise of the Witch King The book was hidden well. It\u0027s pages promised the power of the Witch-King himself. And now that it\u0027s been found, even the fact that it kills anyone foolish enough to crack its cover won\u0027t stop people from fighting over it. Welcome to the Bloodstone Lands! Human assassin Artemis Entreri and his dark elf companion Jarlaxle have come to the demon-haunted wastelands of the frozen north at the request of their dragon patron. It doesn\u0027t take long for them to find themselves caught in the middle of a struggle between powerful forces that would like nothing more than to see them both dead... or worse. But Entreri and Jarlaxle aren\u0027t just any wandering sellswords, and the ancient evils and bitter blood-feuds of the wild Bloodstone Lands may have finally met their match.","cover":"https://allnovel.net/images/promise-of-the-witch-king-the-sellswords-2.jpg","author":"R.A. Salvatore","type":"Adventure","source":"allnovel","link":"https://allnovel.net/promise-of-the-witch-king-the-sellswords-2.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:42:23 AM"}}
