{"id":92634,"no":20,"title":"Page 20","content":"\\n\\n We creep down the hill closer to them. I lick a finger and put it into the air. The wind is slight. I pull an arrow and pull it back. I glance at Anna and wink. She sights her rifle in.\\n\\n I take a breath and wait for her first shot. I see the red mist and release. The arrow takes down the man next to the one she shot. The last person pulls their gun and slaps the truck, \"ATTACK!\"\\n\\n She downs him as I take the driver down. Will and Jake are already dragging the first guys into the grass when we get down there. Jake grabs guns and tosses them into the back of the pickup and Will jumps in the driver\u0027s seat.\\n\\n \"The bandanas.\" I say and pull them off a person next to me. Jake makes a face when I toss him one.\\n\\n We tie them on and climb in fast. Jake sits up front with Will. Anna and I ride in the back with the weapons and Leo.\\n\\n I don’t pay attention to where Will\u0027s going. I watch the countryside go by quickly.\\n\\n Anna smirks, \"You and the boys are in a real pickle.\"\\n\\n I shake my head and shout back at her, \"No. I am friends with them. I can\u0027t be more. You heard the doc.\"\\n\\n She shrugs and looks at me. I see how much she\u0027s aged, \"If I loved someone, Em, I would just love them. The world is so friggin’ screwed up; that if you find something good and you don’t grab onto it, it\u0027s like you\u0027re laughing in the faces of the people who have all died. My dad loved my mom. He would want all three of us to try to be the kind of people other people would love and cherish. He would be pissed, if even one of us were unhappy in this life. It\u0027s so short and the guarantees are gone. There is nothing left but what we make.\"\\n\\n I raise my eyebrows and stroke Leo\u0027s fur, \"Who got old and philosophical?\"\\n\\n She laughs, \"I don’t know what that means.\"\\n\\n \"It means you\u0027re looking at the meaning of life and contemplating the essence of happiness and the things we need to find that happiness. At least that’s what I think it is. I don’t really know either. I just know whenever my Gramps got like that, my Granny would call him that.\"\\n\\n She grins, \"It’s a good way to be, I think,\" and points back where we came from, \"We just shot four people—people who had loved ones and family probably. I don’t feel bad. They chose the wrong side. They would have killed us in a heartbeat.\"\\n\\n I look where her hand is pointing, \"I don\u0027t feel bad either. We probably should though.\"\\n\\n She nods, \"We should, but that world is gone. The world we live in sucks. It sucks ass, like Marshall would say. There is nothing but bitter sadness. If I find a boy who makes me happy and makes me forget about the other shit, I’m latching on with both hands. I\u0027m going to make him love me and I’m never leaving wherever we end up. Shit, I\u0027ll build a cabin next to yours.\"\\n\\n I laugh, \"We\u0027ll need a few of them. Mary seemed pretty attached to that one and so did Meg.\"\\n\\n Her eyes burn the way Will\u0027s do, \"Yeah well, I told you the first day I was there, I would do anything I could to stay there. I still mean that.\"\\n\\n I frown, \"You\u0027d still sacrifice me?\"\\n\\n She nods and plays with Leo\u0027s huge paw, \"You suck. Of course not. But I would sacrifice Mary and her kid. I feel nothing for them. Meg, me, you, Sarah and my brothers, that’s my family. Mary is not my problem.\"\\n\\n I leave it at that. I don’t want to admit, I still sort of feel the same way. I hate that. Or, maybe, I hate that it bothers me.\\n\\n She hands me a piece of jerky. I chew it and wish we were back at the cabin. I tear some off and give it Leo. He licks my fingers gently. He seems to be settling again.\\n\\n Will drives until the truck runs out of gas. It\u0027s dark again when it sputters. The warm air has cooled off and I\u0027m frozen.\\n\\n He parks, \"It\u0027s not far from here.\"\\n\\n I look at Anna, \"You remember the way?\"\\n\\n She looks around, \"Yup. This isn’t it.\"\\n\\n I give Will a shitty look. He laughs and offers me his hand, \"Trust me.\" I pass him a gun, instead of my hand and slide off the truck.\\n\\n Leo jumps down and looks around. Will grabs another gun and starts walking. I look at Jake but he shrugs. We don’t speak, the dark isn’t safe to talk in.\\n\\n We walk until we reach gravel. I stop and look down at the gravel road, \"Is this a driveway?\" I\u0027ve only ever felt this in driveways or crappy old roads.\\n\\n \"Yup.\" He doesn’t look back, he just walks. He pushes something, \"Through this small gap, it\u0027s a gate.\"\\n\\n I don’t like it. Leo stays near me, nudging me. I have an arrow pulled and ready. I wish I had those handguns. We crunch along, not quietly at all, following Will\u0027s silhouette down the driveway. I see something dark against the sky, it\u0027s huge. I stumble at the same time as Anna. The gravel ends and we\u0027re on concrete. The massive black thing grows, as we get nearer. My fingers itch to pull the arrow back. Bad thoughts filter in my brain, thoughts like shooting Will in the leg and running, dragging Jake out of there, knowing Anna and Leo would follow.\\n\\n Lights flick on blinding me. I pull the arrow back further and squint, trying to see anything.\\n\\n \"What the fuck, man?\" Jake asks squinting.\\n\\n Anna has the gun up and ready. Will puts his hands in the air, \"Bernard, it\u0027s me!\" he shouts.\\n\\n \"Me who?\" a voice calls back.\\n\\n \"Will, asshole.\"\\n\\n The lights dim. I still have the spots in my eyes, but my vision clears. I see a massive mansion with the door open and a man inside of the doorframe.\\n\\n Will walks up and greets him with a weird handshake of sorts. They one-arm hug. Will points, \"You are going to want to meet her.\"\\n\\n My stomach drops. I pull the arrow that I\u0027ve relaxed when they shook hands, back again and point it at him.\\n\\n Will shakes his head, \"This is Star\u0027s brother. He\u0027s ex-CIA. He knows your dad for sure.\" He ignores the fact I have an arrow on them and looks back at the Bernard guy, \"Her dad is one of the seed Gen guys. She\u0027s one of the first seed babies.\"\\n\\n The Bernard guys grins, \"You are not Michael\u0027s kid? Oh my God—I have always wondered what became of you. They did studies, early on, with your DNA but then your uncle ran.\" His voice is deep and calm. He points at the house, \"Please come in.\" Jake steps forward but Leo growls making him stop.\\n\\n Anna holds the gun to Bernard, \"Will, what the friggin’ hell is going on?\"\\n\\n Will crosses his arms and tilts his head like we\u0027re being annoying, \"This guy knows everything there is to know about the new city. All the ways in and out and where her dad is. I\u0027m tired, can we please go inside?\"\\n\\n I am about to lower the weapon, when I hear it. My skin shivers and my stomach drops again. It\u0027s Star.\\n\\n \"Will!\" she shrieks and leaps into his arms. She kisses him on the cheek and then jumps out of his arms and attacks Jake, \"Jakey.\"\\n\\n I have had about all I can take. I lower the arrow and wave, \"See you in the city, Will. Thanks for being honest from the start.\" I turn and walk down the pavement. I hear his long strides following me but Leo\u0027s growl stops them.\\n\\n \"Em, don’t do this, please. Call Leo off. Anna, come on.\" I walk and listen as Anna follows. Jake isn’t far behind us when Star calls out, \"He\u0027s not kidding, Emma. My brother knows everything. He can help you.\"\\n\\n My skin is covered in goose pimples. I don’t even know why I hate her. I stop and look at Anna, \"What do you think?\"\\n\\n She shakes her head, \"I\u0027m with you. I\u0027m beat but I\u0027m with you. If we\u0027re sleeping in the woods then so be it.\"\\n\\n Jake grabs my arms, \"But sleeping in a bed in a mansion would be nice.\"\\n\\n I look back at the huge house and Will\u0027s face. I sneer, \"He\u0027s a jerk.\"\\n\\n He sees the exhaustion and comes running over. Anna grabs Leo and strokes him. Will jogs up, \"Guys, this is a good idea.\"\\n\\n I narrow my eyes, \"If it was such a great idea, why didn’t we discuss it?\"\\n\\n He points back, \"Because you think things about her and would never take help from her brother, even if it\u0027s a good idea.\"\\n\\n I scratch my head and think about it for a second. I sigh, \"One night and he doesn’t do experiments on me.\"\\n\\n He grabs my hand and pulls me along, \"I love it when you compromise. Guys, this is a nice house and has full power. Showers—hot showers.\"\\n\\n I look at Anna. She mutters something about her weak spot and we follow him back.\\n\\n When I walk to the front door, Will grips my hand. I think it\u0027s so I won\u0027t slap or attack Star. He drags me inside and I am instantly transported back in time. It looks like a hotel lobby. There are lamps lit and fineries we just don’t see anymore. Leo strolls in next to me, nudging. I run my fingers into his fur and hold a chunk.\\n\\n \"Will, you never said a huge wolf was part of the group.\"\\n\\n Will chuckles, \"He\u0027s part of it.\"\\n\\n I scowl, \"How long have you known we were coming?\"\\n\\n He glances at Will, \"Well, Star mentioned something.\"\\n\\n I give Will my death stare and look around.\\n\\n Jake whistles when he walks in and Anna grins, \"Shower is which way?\"\\n\\n Bernard, who doesn\u0027t look a day over twenty, smiles and points, \"Top of the stairs to the right.\"\\n\\n I jerk my hand free of Will and turn to the stairs. Leo stays at my side. He does it when he\u0027s nervous. Houses make us both nervous. I stomp on the stairs. They\u0027re sound. The whole house is. That\u0027s rare. I thought I had found the only stairs that were intact. The only houses not destroyed in the blasts.\\n\\n I realize I\u0027m excited about a hot shower. I follow Anna up, and when we open the door, we fill the space with gasps. The bedroom is massive. The bed is lush and gorgeous, like in a picture. The dust is minimal and the whole thing looks kept up.\\n\\n \"I think he cleans,\" I mutter and look around. Leo walks to the bed, sniffing and checking for surprises.\\n\\n Anna ignores us and rushes to the door to the right. She turns on the light and looks back at me with a grin, \"Can I go first?\"\\n\\n I laugh, \"Yeah, but save me water.\" \\n\\n","sourceLink":"https://allnovel.net/born-to-fight-born-2/page-20.html","bookId":1605,"book":{"id":1605,"title":"Born to Fight (Born #2)","description":"Storyline: Born to Fight (Born #2) \\n When Emma wakes strapped to a cold metal table she has only one name on her lips, \"Marshall!\" What she doesn\u0027t expect is discovering that he is only one of the disturbing people in her small world who deserves to die in a fiery death. \\n Twenty years ago scientists made some remarkable discoveries with genetics and the ability to perfect the babies we gave birth to. \\n Ten years ago the governments of the world made a hard choice, earth or people. \\n Nine weeks ago the choices they made came full circle. \\n Fourteen days ago the truth of their mutations leaked out into the borderlands and other areas. \\n Yesterday the worst thing they ever made learned about what she was. \\n Today she\u0027s coming for them and she knows about the strengths they gave her. \\n Tomorrow she plans on destroying everything. \\n She plans on starting with her her own creator. Her own father. \\n Mature Content Warning\\n","cover":"https://allnovel.net/images/born-to-fight-born-2.jpg","author":"Tara Brown","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/born-to-fight-born-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:56:04 PM"}}
