{"id":92637,"no":23,"title":"Page 23","content":"\n I lift my eyes from my plate, \"Can you stop him?\"\n He nods, \"Yup. We have to kill him. I\u0027m sorry, there is no other way.\"\n I shake my head, \"Why have you waited until now? Why haven’t you killed him before this?\"\n His eyes glisten, \"He\u0027s a genius and very good at talking. I used to believe.\"\n I frown, \"What made you stop?\"\n He laughs and glances at his sister. I don’t need any further explanation. She is oblivious to the fact, he has looked at her. Only Will and I caught it. He clears his throat, \"I just stopped. I had heard about the originals—the first generation of babies. It was the early stages of it so very few women were impregnated. They weren’t certain what they were doing, what the results would be. You mom and a handful of women were impregnated under the guise of it being hormone therapy. I know Michael was outraged, his brother took you. He searched high and low for you. Lenny, was apparently a master of living off grid. Michael\u0027s parents hated the fact he had betrayed his own brother.\"\n Anna chimes in, \"How did Lenny know?\"\n Words form in my mind. Words I\u0027d heard for years, that only now are making sense. They flash into my mind. \"He was sterile,\" I mutter.\n Bernie nods, \"He was. He was sterile from a job he had done, when he was a young man in the army.\"\n The words he ranted when he screamed at her, start to make sense, \"They went for tests because she wanted a baby. He never told her, he was sterile. She thought it must have been her, but when she found out she was pregnant, he knew she\u0027d had an affair with my uncle.\" I was under the kitchen table with my ponies and Disney princesses. I was little. I heard him yelling at her. I heard her crying.\n He laughs, \"She didn’t remember the many times she\u0027d come for treatments and whatnot. She would have thought it was hormone injections and regular doctor appointments. They all thought that.\"\n My heart nearly stops. I look up at him, \"They?\"\n He nods, \"They. The other moms. They were all his kids.\"\n The gleam in his eye disturbs me. I think it\u0027s respect, but I\u0027m not sure. I feel horror and rage building inside of me.\n I get up from the table. I wish I had brought the plate, but I don’t. I just leave. I need to get away.\n I run for the room and then the bathroom. I lock the door and sit on the toilet with the lid down.\n \"They?\" I whisper into the darkness of the bathroom. \"They?\" I\u0027ve had brothers and sisters all along. How many? I shake my head and try to block it all out. She had believed she\u0027d had an affair, hadn’t she? I remember that. She loved my uncle.\n I drop to my knees and lift the lid. My stomach empties. I wipe my mouth and collapse onto the floor. What was happening to me? How had I become so soft and weak? I crawl to the door and open it. He comes in and I close it again. He curls around me. I don\u0027t cry. I don\u0027t have any tears left. I don’t want to be that girl anymore, anyway. I dig my fingers into his fur and wait for the end of the world to come again. If I close my eyes I\u0027m back home and we\u0027re in bed. It\u0027s soft and warm and the only thing I have to do tomorrow is laundry for one, find food for one and boil water for one. Leo can get his own.\n But I open my eyes, and the world where everything I did for one is over. In its place is a world where I can\u0027t see all the faces of the people who need me. They\u0027ve become a sea of faces, and in the dream that starts to form in my exhausted mind, they all look like me.\n Chapter Ten\n The hard floor leaves me feeling bruised, when I push myself up. Leo yawns and stretches. I get a whiff of his dog breath and shudder. He doesn’t seem offended by it. He continues to pant in my face. I pull back, shaking my head, \"Oh that\u0027s bad, Leo. Wow. You need some mint leaves.\"\n I always made him eat them, especially after eating the infected.\n The bathroom is quiet. I listen beyond the door but nothing moves. I catch a glimpse of my face. It brings back the haunting dream. My greenish-blue eyes and light brown hair stand out in my mind. I\u0027m not an original—I\u0027m a copy. My mom and uncle never loved each other. He used her, the way he now uses the world around us. She imagined it was love somehow. She was an idiot.\n The hate in my eyes is cold and meaner than anything I\u0027ve ever seen before. Leo scratching at the door, brings me out of the bad thoughts filling my head. My stomach grumbles and I swear I\u0027ll finish the meal before getting upset and running off again. God knows what else they have to tell me.\n When I open the door, I have to jump back as Will falls inside on the floor. He sits up fast, like he\u0027s dizzy.\n \"What are you doing?\" I ask.\n He looks back, his eyes are tired and puffy. He shakes his head and rubs them, \"Sleeping,\" he says it like I should have known he would be there.\n He takes up the entire doorway, waking up and getting his bearings.\n \"You slept here all night?\"\n He nods and yawns, \"I was going to crawl into the bed, but Anna was there, passed out with Bernie\u0027s cat. I tried waking her but the cat hissed at me.\" He pushes himself up and looks down on me, \"You alright?\"\n I shake my head, \"I don’t know. Where\u0027s the cat now?\" I look past him, hoping it\u0027s gone. Leo loves cats in a bad way. A couple times they\u0027ve come to me for a pet and a snuggle, which always ended badly.\n \"He ran off,\" he laughs and leans on the door, blocking me in, \"You okay?\"\n Looking up into his blue eyes is like getting lost watching the water on a lake. I smile my fake pleasant one that I have used on people, who I was about to either rob or trick.\n He doesn’t buy what I\u0027m selling, \"It\u0027s okay if you\u0027re upset and want to talk about it.\"\n I laugh, \"Okay, you first. Let\u0027s share our feelings.\" It\u0027s cheeky and something I might have said a decade ago, when my dad was being a jerk.\n Will laughs with me, \"Breakfast?\"\n I nod and shove him through the doorway, \"That sounds about right.\" Leo walks past us and through the door to leave the room. He makes sure he gives me one extra crappy wolf look, like he\u0027s telling me he\u0027s watching and I better behave. It\u0027s the same look Granny gave me, when I was a kid. Lord knows, Leo is probably Granny reincarnated.\n We walk down the hall to the stairs, where I catch a glimpse of Anna walking next to Bernie and leaving through the front door. I glance at Will.\n He laughs, \"Not every guy is a piece of shit looking to get laid, Em.\"\n Leo is at the bottom of the stairs near the door. I run down them and open the front door, calling out to them as they cross the front grass that now resembles a field, \"Take Leo! He wants out!\"\n She looks back at me and grins, patting her legs, \"Come on, boy.\"\n He looks up at me and then Will. I tilt my head and raise my eyebrow. He gives me the same look he did upstairs and saunters out the door after Anna. I watch them for a minute, before Jake comes walking over with Star. She\u0027s in long pants and a long-sleeve shirt. I have never seen her so covered before. I want to comment about the fact she even owns them, but I have a feeling it might be rude.\n \"What\u0027s crawled up your ass?\" Jake asks as he peers out the door after his sister. Star giggles.\n I shake my head, frowning and walking back inside. \"Good to see you own pants, Star,\" I mutter and walk down the hall. If they can be rude to me for no reason, then I guess it doesn’t matter, if I am too.\n Will chuckles and walks after me, \"You know sometimes you are a real bitch.\"\n I look back at him with daggers in my eyes, \"No one asked you to come. In fact, I recall not even telling you I was leaving.\"\n The table had food spread across it again. I grab a plate and load up with sandwiches, cheese, meat and apples—real apples. Not applesauce or apple butter or canned fruit. I sit on a very high stool, like the ones that were in the café Granny liked.\n Will goes around the counter and piles a plate up extra high, \"I know you think you can do everything alone and you don’t need help, but you aren’t alone. Maybe you don’t need us but we\u0027re here.\"\n I frown and shove meat into my mouth. I block him out as he rambles. I know if Bernard tries anything on Anna, Leo will eat his ass. I hope that if Star tries anything on Jake, he won\u0027t have any issues telling her to take a hike.\n \"Did you hear me?\" he asks.\n I shake my head, \"I\u0027m hungry and tired and not really in the mood for a lecture. I got plenty when I was a kid.\"\n He takes a bite of a sandwich and shakes his head, \"You need to listen to me—we need a plan for the city. If we show up, they\u0027re going to grab us and put me in a work camp and you in a breeder farm.\"\n I pick at the meat on my plate and narrow my gaze, \"The doctor/nurse angle doesn’t work?\"\n He shakes his head, \"I don’t know.\"\n \"Why are you helping me with this?\"\n He snorts and finishes the bite, \"Because I want you, Emma. I want you and me, and that god damned wolf, to go and live and be together. If I have to endure getting bit and shoved to the ground every day for the rest of his life, I will. If I have to walk into the lion\u0027s den and help you kill your dad so you can go back to being a hermit, I will.\"\n I don’t trust him, or his words. \"That’s a lot of work for some sex. You could probably get yourself a nice girl, who won\u0027t make you jump through hoops every time you try to get near her.\"\n He grins wide, like he\u0027s about to boast, but he doesn’t say anything. He winks at me and opens a can of something. He takes a drink and makes a face. I can\u0027t fight the laugh.\n He puts it down and shivers like he\u0027s gotta pee. \"Oh my—wow. Oh God. That’s shit. Don\u0027t drink that.\" he shudders again.\n I snicker and finish my plate of food. I haven’t felt full and relaxed in a long time. It\u0027s making me tired.\n I get up and leave him in the kitchen. I need a nap in a bed, not on the bathroom floor.\n Climbing the stairs, I notice the strangest feeling I have ever felt overwhelming me. I don’t care. I\u0027m tired and beaten down and I don’t care. Anna is going to have to take care of herself. Leo will protect her, but I\u0027m too tired to run out there and monitor her with a thirty-year-old man. Something is wrong with me, but I\u0027m too tired to figure it out or go over the feelings I have. \n","sourceLink":"https://allnovel.net/born-to-fight-born-2/page-23.html","bookId":1605,"book":{"id":1605,"title":"Born to Fight (Born #2)","description":"Storyline: \n Born to Fight (Born #2) \n When Emma wakes strapped to a cold metal table she has only one name on her lips, \"Marshall!\" What she doesn\u0027t expect is discovering that he is only one of the disturbing people in her small world who deserves to die in a fiery death. \n Twenty years ago scientists made some remarkable discoveries with genetics and the ability to perfect the babies we gave birth to. \n Ten years ago the governments of the world made a hard choice, earth or people. \n Nine weeks ago the choices they made came full circle. \n Fourteen days ago the truth of their mutations leaked out into the borderlands and other areas. \n Yesterday the worst thing they ever made learned about what she was. \n Today she\u0027s coming for them and she knows about the strengths they gave her. \n Tomorrow she plans on destroying everything. \n She plans on starting with her her own creator. Her own father. \n Mature Content Warning\n \n","cover":"https://allnovel.net/images/born-to-fight-born-2.jpg","author":"Tara Brown","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/born-to-fight-born-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:56:04 PM"}}
