{"id":92643,"no":29,"title":"Page 29","content":"Guilt creeps across his face, \"When I found out what they had done to you and it was my fault, I never have felt that kind of rage.\" I look down at his clenched fist and do something I don’t do—ever. I take it in my hands, surrounding it with mine. It feels like his hand is throbbing with anger still. I have to fight to stay focused on why we\u0027re here and not think about the feelings his hands make me have. Bernie glances back at us, as he makes a turn under a streetlight. He winks. I frown. It takes us a few moments to get to the spot he went in. It\u0027s an alley and he\u0027s standing at the end of it in the dark. \"Medical research building,\" he whispers as we get there. It\u0027s tall and shiny, like everything else. \"There\u0027s a back entrance. I always take it. My card will get me in. You want to come too or wait out here?\" I struggle to see his face in the dark, \"We come.\" He turns and walks closer to the building. He moves and the door opens. I see the card slider as we walk in. The lights turn on as we walk inside. They do the motion thing. I don’t want to hurt his feelings, but it\u0027s annoying. It looks like the breeder farm hallways when we get inside. The lights exasperate the hell out of me, the entire way to the stairs. \"We don’t do elevators, only stairs in the city. It\u0027s seven flights.\" I raise an eyebrow, \"You sure like it here.\" He sighs, \"I did. I loved it. It was like almost being back to normal, only without the fashion and luxuries. But the basics are here. I just can\u0027t risk Star. When she\u0027s older we will come and live here, but she needs to get past the breeder age. If they find out what she is… well you know.\" I nod. I do. \"Is it weird, she\u0027s your sister?\" he asks as we climb the second set of stairs. Will coughs nervously, \"What?\" I see the look on his face and wrinkle my nose, \"Oh my God—you had sex with her, didn’t you?\" His eyes widen. Bernie turns and looks at him, \"Not cool.\" Will sputters, \"No. I swear. It\u0027s not like that. It wasn’t like that.\" I\u0027m disgusted, because I friggin’ knew it and because I\u0027m a notch on his god-dammed belt, like my sister. I blow past them both and continue to climb. \"Bern, I never slept with her. I swear to the Gods. I never. You know me. She tried a few times, but I didn’t. I couldn’t. Not after… just not after.\" I ignore his words. Their footsteps start again behind me. \"I trust you,\" Bernie mumbles. I don’t. I look back to see the guilty, red face and fight the sneer on my lips. I am almost running the stairs, ignoring them and the wind I\u0027m sucking by the time I reach the door with the seven on it. I fling it open and walk into a hallway like the farms. The whole place is like a replica. Bernie opens the door, almost wheezing. I look back, \"Did they only let one building designer live through it all? Why do all these look the same?\" He laughs, \"Cost and ease. Whew. I haven’t done those stairs in a while.\" Will is huffing next to him. He gives me a pleading look. I give him a look. He gives it back. Bernie grabs my hand, \"Come on, scowly. You\u0027ve been grumpy all day. It\u0027s not that bad here.\" I look around, it\u0027s dark inside and no one is here, just like he said. We walk down a hall into an open lab. It\u0027s huge. He walks to a room with a huge, red sign on it that says BIOHAZARD. He winks at me and opens the door. \"You\u0027re immune aren\u0027t you?\" He nods, \"Will stay out here. You\u0027re not.\" He pulls me inside of the room. It\u0027s dark until we are inside, then the lights flash dimly and slowly grow in brightness. The lab is white and big. The wall where the door is, is all windows. I can see Will through it. He still looks pissed. \"Can he hear us?\" Bernie looks at Will and then me, \"No.\" \"Do you really believe he didn’t sleep with Star?\" He shakes his head, \"No. She has been in love with him since he saved her. She was raped in the back of a truck at the farms.\" He shudders, \"She doesn\u0027t really remember much, blocking it out, I guess. Anyway, she remembers Will. He came and saved her. He beat them to death with his bare hands. He broke several fingers and knuckles. It was horrid. He was covered in blood. I don’t know what happened to him in the farm, but he was a savage when he left.\" I look at the intensity in his blue eyes, \"It\u0027s weird. He\u0027s the most gentle person in the world one minute and a total psycho the next.\" He snorts, \"Who isn’t nowadays?\" He sounds distracted. I look at the huge glass canisters he\u0027s touching. \"What\u0027s that?\" He looks back at me, \"The vaccine. We need to give it to Will. You go do that and I\u0027ll get the cure.\" I frown, \"It\u0027s a real cure?\" He nods, \"As long as it hasn’t mutated again. It should work fine. The research is done in Spokane.\" His eyes flash when he says it. I grimace and take the needle he passes me. It\u0027s huge and filled with a pale, yellow syrup-looking liquid. \"Shoot it into his arm. He\u0027s gonna get crazy sick for a couple hours and then be fine.\" I give him a look as he passes me a packet. He shakes his head, \"I know. Not ideal, but it\u0027s our best hope.\" \"He\u0027s going to be sick as we flee the city with the stolen cure?\" He laughs, \"You really are a true skeptic, aren\u0027t you?\" His flippant behavior drives me insane. I take a deep breath and walk to the door. \"Wipe him with the cloth in the packet and then stick him.\" I nod and close the door. Will looks down on me, \"You think I\u0027m lying don’t you?\" I hold up the packet, \"I need to wipe your arm. This is the vaccine.\" I tear the packet with my teeth and tug the wet wipe out. I always get excited when I find these. I wipe his arm in the thick spot and try not to think about anything but the wipe. My hand shakes with the huge needle in it. When I lift it, his eyes widen, \"Really?\" I nod and look in his dark-blue eyes. I smile bitterly and slide the needle in slowly. He winces as I press the liquid in slowly. I pull the needle out and toss it and the wipe in the garbage can, next to the desk beside us. He grasps my hand, but I stop his kiss with my evil grin, \"You\u0027re going to be horribly sick for a day or so.\" He cocks an eyebrow, \"What?\" \"It makes you really sick.\" I can\u0027t help but smile when I say it. He rolls his eyes, \"Why, because Bernie said so? He gets a sliver and feels sick. I\u0027ll be fine.\" I shrug, \"Ok. He has the cure, I think.\" Bernie walks out holding a small cylinder. He looks sweaty and off, \"We need to go now. This can only stay active for a short amount of time.\" We follow him out of the lab and down the hall. I can\u0027t help but feel like it\u0027s all too easy. \"Doesn’t anyone guard the lab?\" I ask. He nods, \"They do, but they rarely come up the stairs. It\u0027s too bloody far to check every floor.\" Will laughs, \"That sounds dumb. They don’t put in elevators, so then the guards don’t want to climb the stairs?\" Bernie chuckles and starts down the stairs, \"I\u0027m not one of the engineers who decided this. I told them it was stupid, but they never listened to me.\" \"Have you stolen the cure before?\" I ask, starting to feel weird. He shakes his head, \"Nope. I haven’t ever used it either. I heard it only works if the person taking it hasn’t got the fever bad yet. That takes five days to set in and get so high the brain damage happens.\" We reach the bottom of the stairs and enter the hallway with the lights that turn off as we walk. As we leave the building he hands the cylinder to me, \"I\u0027ll go get the truck. You wait here, okay?\" I want to say no. I don’t trust him. It\u0027s sudden. I don’t like that we\u0027ve put so much faith in him. But I don\u0027t. I take it and wait for him to betray us. I don’t have a choice. We can\u0027t walk down the street with a cylinder, not without people giving us a look. I look at Will, \"Starting to feel sick so soon?\" He nods and I fight the grin that wants to take over. He grabs my arm, \"What if he poisoned me?\" I sigh and point down the alley, \"You are the one who said to trust him. You are the one who said he was going to help us. Is that possible?\" He takes deep breaths and then nods, \"Yeah. It might be possible.\" I growl, \"For fuck\u0027s sake.\" I grab his arm and drag him down the alley. We cross the silent street and enter an alley across the way. I drag him behind another building and up another alley. We walk for a few minutes and then I hear it. I pass him the cylinder, \"Don’t drop this, I don’t care if you\u0027re dying.\" He scowls, \"She\u0027s my sister too.\" I like that he said too. I scoff and walk up to the corner of the building in front of us. A group of the weird breeder kids are standing in front of something. In the dark, I can barely make them out. I squint and manage to count five or six. \"Shit,\" I whisper and turn back around to grab his empty hand, \"We gotta go.\" I see a window on the ground level and try to open it, but it doesn’t move. I pull him down the alley further. We reach a building with stairs. We climb a few flights until we can see the road we were on. I sit. He sits beside me. I can feel him starting to shake. I take the cylinder and put it beside me. I wipe away the sweat forming on his brow. He lifts one corner of his lip, \"I\u0027m sorry.\" I scowl, \"For what?\" I have a bad feeling he\u0027s about to confess to sleeping with Star, who is my sister. He shakes his head slowly, \"For trusting him.\" I watch the road for the truck, \"he might be on our side. He might truly be good.\"","sourceLink":"https://allnovel.net/born-to-fight-born-2/page-29.html","bookId":1605,"book":{"id":1605,"title":"Born to Fight (Born #2)","description":"Storyline: Born to Fight (Born #2) When Emma wakes strapped to a cold metal table she has only one name on her lips, \"Marshall!\" What she doesn\u0027t expect is discovering that he is only one of the disturbing people in her small world who deserves to die in a fiery death. Twenty years ago scientists made some remarkable discoveries with genetics and the ability to perfect the babies we gave birth to. Ten years ago the governments of the world made a hard choice, earth or people. Nine weeks ago the choices they made came full circle. Fourteen days ago the truth of their mutations leaked out into the borderlands and other areas. Yesterday the worst thing they ever made learned about what she was. Today she\u0027s coming for them and she knows about the strengths they gave her. Tomorrow she plans on destroying everything. She plans on starting with her her own creator. Her own father. Mature Content Warning","cover":"https://allnovel.net/images/born-to-fight-born-2.jpg","author":"Tara Brown","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/born-to-fight-born-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:56:04 PM"}}
