{"id":92621,"no":7,"title":"Page 7","content":"\n Not for him. For me. He\u0027s a bitter old man with a guilty conscience. I\u0027m screwed.\n I sigh and look at Anna. She looks lost too. I lean against the wall and think about it all, \"So I was pregnant for like a minute? My wolf is being held because he\u0027s immune? I\u0027m a mutant breeder-farm baby? My dad is my uncle and my uncle is my dad?\" I glance at him, \"And you\u0027re mad because the world is filled with crappy racist people who lie and hurt others?\"\n He shakes his head chuckling, \"That’s about it.\"\n Anna leans next to me and crosses her arms, \"So her dad made the breeder babies?\" She glances at me.\n I feel a new sickness. My own flesh and blood is the reason it\u0027s all happening.\n I frown at Vincent, \"How do we stop him?\"\n He licks his lips, \"Impossible. But I\u0027m glad he won\u0027t have you. God knows what he\u0027d try.\"\n I look at him and study his face. He\u0027s weak. He won\u0027t be of any real use.\n \"You know what you should do? Give up on the other people and just eke a life out somewhere quiet,\" I say and look down at my aching feet. I miss my boots. I wonder how long it\u0027s going to take me to find nice new ones.\n Anna laughs, \"We know a nice place you could go to. But seriously, you should probably not tell anyone that boring seed-baby story.\"\n He laughs, but it sounds exhausted.\n \"You married?\" I ask.\n He shakes his head, \"No. She left. She ran to live in the hills.\" He grins at us bitterly, \"To eke out a life.\"\n Anna grins back at him, \"Smart woman. Can\u0027t say I blame her. You seem long winded and fairly down about a lot of shit.\"\n He laughs again and it makes me think of Jake. I give Anna a sideways glance, \"You said you got separated from the others? Where did they go? Who was there?\"\n She maintains her grin, \"Jake and Will. I made Meg stay behind, she was all mad. She said she was almost sixteen so she should be allowed to say. I told her no. Jake and Will went to find food and some infected came, so I ran. I couldn’t get back to them, so I kept looking for you. Then I met him.\"\n Will and Jake are in the same city as I am. They\u0027re nearby. That makes my heart skip a couple beats.\n I freeze when I hear a noise that\u0027s not coming from us. Vincent looks at me with panic in his eyes.\n I press my back into a wall and wait. They do the same.\n Voices echo off the broken walls. I don’t know which direction they\u0027re coming from.\n I don’t breathe. I listen. Men talking, laughing. Not infected obviously.\n \"How many weapons you got?\" I whisper.\n He shakes his head, \"Not enough.\"\n I sigh, \"Great. Do I have any magical powers like the superheroes?\" I mutter and glance past the wall. Three men are leaning on the cement wall in the area we were walking to.\n Vincent shakes his head, \"No. Your kind heals faster. You have incredible strength and speed. That, combined with your lack of control over your temper, is obviously dangerous. You learn faster and remember things better. You process things quicker and feel things stronger. Nothing that’s going to get us out of this mess.\"\n I glare at him, \"How are you scientist types this stupid? I thought the scientists were the geniuses, but you aren’t. You\u0027re crazy. This is why Lenny hated you all. Why would you make something like that? Just stupid.\" I glance around the corner at the men. One of them is suddenly missing from the three. My heartbeat picks up slightly. Where did he go?\n \"Gun, knife, anything?\" I whisper.\n He pulls a long blade from behind him. I still feel like death, but taking the blade makes me feel a tiny bit better.\n I grip it and look back at Anna, \"You stay here with him.\"\n She scowls, \"I can help you.\"\n I roll my eyes, \"Not this time, okay?\"\n She looks angry, but I flicker my eyes on him. She nods. She knows she has to stay with him and make sure he\u0027s legit. Really I just don\u0027t want her near anything. She could get infected. I\u0027d rather it be me.\n I look back at the men and see the third man is back and zipping his thick pants back up. The warmth of summer is upon us. I wish I could close my eyes and be back at the swimming hole at the retreat. Instead, I\u0027m in the middle of the broken city, surrounded by bad possibilities. I wish I had those handguns. I watch the men for a second and give up on the mini plan I had. I abandon it and point the opposite way, \"Let\u0027s go the other way. They have guns.\"\n \"We can get out on the other side of the parkade, but there are more infected that way. I saw them earlier.\" He gives me a sideways glance.\n I feel the annoyance and fear coming off me. At least it will fuel the fire inside of me.\n He puts his hands up, \"Hey, I\u0027m just telling you. It\u0027s not going to be easy that way. When I brought you here, I came this way.\" He points towards the men.\n I shake my head, \"We won\u0027t stand a chance with them.\" I wish we could happen upon Jake and Will. I don’t like not knowing where they are. It feels like they\u0027re on my to-do list.\n We walk around another corner and down another level, into more darkness. The broken concrete and thick vines make it hard to see. The levels above us collapsed, at some point, and made a huge mess in the dark where we are walking. I climb over a large, broken pillar and try to make my animal eyes work. The dark moves, even when nothing is there. I hate this place. I miss the forest. I miss the birds. Here in the dark, nothing warns you. It waits for you to die so it can eat you too.\n My feet crunch and kick things I can\u0027t see. Anna walks beside me, silently. She is still the best hunting partner a girl could ask for. His feet behind us are loud. He reminds me of Jake—maybe not the best at survival.\n I push away my thoughts of them and listen. If the infected, the others, or the military catches me, I\u0027m dead. My best chance is staying quiet.\n We walk along a wall in the dark where cars are parked, looking like rotted out skeletons. Some of them are crushed by debris. I can see from the bits of light filtering in through the vines on the far side of the parkade.\n I give Anna a look. She nods and slowly walks across the broken-up concrete to the edge, where the vines are the thickest. She pulls them aside and peeks through as I watch Vincent. They almost eat her up; they\u0027re so dense, like a real forest.\n She looks back at me and points. I walk ahead, looking through the creepy vines and bushes, and see we are almost at ground level. We are only one story up. The alley below us is crawling with the infected. She pulls back and looks at me.\n I look around us. We can\u0027t drive out. The cars are rotted, and besides, the roads are almost virtually impassable. I take a second look, noticing the far-left side of the alley is empty. The infected move slowly, in comparison to us. They will smell us, unless we can get some kind of bait.\n My brain flashes back to the men. They are already close to the left side of the parkade.\n I swallow and look at Anna, \"I\u0027ll be right back. Don\u0027t move unless you have to. I\u0027m going to make bait.\"\n She grimaces and nods, \"Okay. I\u0027ll stay with him.\" Thank god, I don’t want to have a fight with her. I don’t want to tell her I value my life less than hers and refuse to chance her getting the fever.\n Vincent looks confused. I turn and run, as silently as I can, back across the parkade and up the ramp to where I hear them. I slide against a gutted car and wait.\n \"A U2 concert. I went with my girlfriend. I was eighteen and she was seventeen. We smoked a ton of pot and went. Everything started about two weeks later. Best memory.\" A man to the right with a rifle is talking.\n The other man nods, \"Nice, man. Yeah, mine is a barbecue. We figured it was the last one of the season. My whole unit came over and we got trashed and talked about sports and shit. My wife, her name was Trish. She made the best burger patties on earth. I ate like four. I thought I was going to die.\"\n I bite my lip and wait. I can feel my stomach tighten when I think about it. Regular people sharing regular memories and I\u0027m about to kill them both. Unless they kill me first. I should have died yesterday and didn’t. I\u0027m on borrowed time and the bad feeling hasn’t left me yet.\n Their feet make scuff sounds, they aren’t even careful. They must not be on high alert. They must not be looking for me.\n I slide along the car and sit at the back of it, waiting for them to pass. The third guy must be off doing something again. He\u0027s the one I\u0027m going for.\n They walk further away, strolling and sharing. I watch them, waiting for the moment. Both are in good shape, but they slump and hold their guns wrong. They aren’t taking it seriously.\n They turn their backs and lean casually. I crawl to the next car. It\u0027s the last car before the corner. I look back at them. They\u0027re still talking and laughing. I frown. The infected are one level away from them, and they\u0027re talking about shit they miss. I break into a silent sprint. It\u0027s nowhere as fast as it needs to be, but it\u0027s got to do.\n I get around the corner and feel it. The cold mean is settling in. The cold calculations start figuring in my brain. The third man has to die. I need bait.\n I look back around the corner, but the men are still talking.\n I swallow and walk to the edge where the man was. He\u0027s still there. He too, looks like he\u0027s not taking the job very seriously. He\u0027s leaning on his gun and picking his nails. Who trains these people? Maybe my real dad is over confident. He doesn’t feel threatened.\n I feel sick thinking about it. My own family participated somehow. My dad must have been a scientist too. My mom must have been a complete idiot.\n I slide against the wall and creep, pushing away all the thoughts I\u0027m having. My stomach is a ball of nerves and butterflies, but I want that gun. This side of the parkade has been destroyed completely. It\u0027s an avalanche of gravel and broken concrete. It really would the be the easy way to come. I sigh walk down the debris, onto the ground where he is.\n I feign a limp and hold my stomach. The knife is in the back of my pants, waiting.\n I moan slightly. There is no way I can sneak up on him from here. I climb over the edge of the broken concrete and stumble down the crumbled debris. \n","sourceLink":"https://allnovel.net/born-to-fight-born-2/page-7.html","bookId":1605,"book":{"id":1605,"title":"Born to Fight (Born #2)","description":"Storyline: \n Born to Fight (Born #2) \n When Emma wakes strapped to a cold metal table she has only one name on her lips, \"Marshall!\" What she doesn\u0027t expect is discovering that he is only one of the disturbing people in her small world who deserves to die in a fiery death. \n Twenty years ago scientists made some remarkable discoveries with genetics and the ability to perfect the babies we gave birth to. \n Ten years ago the governments of the world made a hard choice, earth or people. \n Nine weeks ago the choices they made came full circle. \n Fourteen days ago the truth of their mutations leaked out into the borderlands and other areas. \n Yesterday the worst thing they ever made learned about what she was. \n Today she\u0027s coming for them and she knows about the strengths they gave her. \n Tomorrow she plans on destroying everything. \n She plans on starting with her her own creator. Her own father. \n Mature Content Warning\n \n","cover":"https://allnovel.net/images/born-to-fight-born-2.jpg","author":"Tara Brown","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/born-to-fight-born-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:56:04 PM"}}
