{"id":62938,"no":12,"title":"Page 12","content":"I do not know how you can do that with the carriage bouncing about as it is.\"\n Christiana glanced up from her embroidery at Richard\u0027s words and smiled wryly.\n The truth was she was poking her fingers more than the cloth and the stitches she had managed would have to be ripped out and done over again anyway, they were such a mess, but it helped pass the time and distracted her from the fact that she was shut up al alone in a carriage with Richard. In the end, the men had agreed to take three carriages for this trip to Gretna Green. Each man had contributed one. The maids rode in Langley\u0027s carriage at the back of their little procession, she and Richard rode in the Radnor carriage at the front and Suzette, Lisa, Langley and Daniel al rode in the Woodrow carriage in the middle. It seemed an unfair distribution of their party to Christiana and she would have preferred at least one more person in the carriage with her and Richard to act as a buffer, but when Daniel had suggested he and Suzette needed a chaperone in their own carriage for the journey, Langley had volunteered and Lisa had insisted on joining them. Apparently, none of them considered that Christiana and Richard were not yet properly wed and should also have a chaperone.\n Of course, her sisters stil had no idea Richard was Richard and Dicky had actual y been George and she wasn\u0027t legal y either man\u0027s wife. But the men knew it.\n Obviously, they weren\u0027t as concerned for her reputation as she was. But then Christiana supposed she had little reputation to save after the night she had spent with Richard when she\u0027d stil thought him her husband. Despite that, she was determined to behave as she\u0027d been raised to and not make the mistake of sleeping with Richard again until they were legal y wed. The problem was, she real y wanted to. Temptation was an awful thing, she decided.\n \"It helps me pass the time,\" she said final y in answer to his comment.\n \"Hmm.\" Richard peered out the window at the passing scenery. \"It is a long journey.\"\n \"Made longer by our insistence on three carriages and stopping at night,\" she suggested gently. \"I am sorry about that.\"\n \"No.\" He smiled wryly. \"Now that we are on the road I am grateful you ladies insisted on it. I am already looking forward to getting out and stretching my legs. And sleeping tonight in something that isn\u0027t bouncing up and down wil be nice.\"\n Christiana murmured agreement and struggled on with her efforts at embroidery.\n \"Have you been to Radnor?\" he asked suddenly. \"Has George taken you there since you married?\"\n Christiana lowered her embroidery to her lap and smiled wryly. \"We stopped there for a night on the way to London after the wedding, but it was only a brief stop.\n We arrived after dark and left at first light so I didn\u0027t get to see much.\"\n \"The wedding was at your father\u0027s home?\" he asked.\n Christiana nodded.\n Richard peered at her silently for a moment and then said, \"I was surprised neither yourself nor your sisters suggested col ecting your father on the way. I would have thought you\u0027d want him to attend your weddings.\"\n Christiana sighed and stabbed her needle into the cloth, set it down and admitted, \"I considered it, but Suzette was so angry at Father for gambling again and forcing her to marry so abruptly that . . .\" She shook her head unhappily. \"I just thought it better not to even bring up the subject.\"\n \"And you? Are you angry too? If not for the first round of gambling you would never have had to marry George.\"\n \"I didn\u0027t have to marry him,\" Christiana said quietly. \"Had I seen through him and refused his troth Father would have supported me in my decision. Marrying Dicky was my choice. He wooed me, I believed his lies sincere and made the wrong choice.\"\n \"What other choice was there?\" he asked.\n \"What Suzette is doing now, I suppose,\" she said with a shrug. \"Find myself a man in need of money and strike a deal with him.\"\n He frowned slightly and then commented, \"Christiana, you have a tendency to take responsibility in every situation . . . even when it is not yours to take.\"\n When she started to protest, he pointed out, \"You understand why Suzette is angry, but don\u0027t claim that anger for yourself for being forced to marry Dicky when if the gambling hadn\u0027t happened the first time you never would have been forced to make the decision at al .\"\n \"But - \"\n \"And then while talking to Grace, you tried to take responsibility for our night together when it was whol y my fault.\"\n \"I was a party to it,\" she said blushing and lowering her head with embarrassment. It was the first time they\u0027d spoken of that passionate night. \"I am the one who started stripping you and set the whole thing in motion.\"\n \"And you thought I was your legal husband while I knew we weren\u0027t legal y wed,\"\n he pointed out quietly. \"That night was my fault. As a gentleman I should have brought a halt to things.\"\n \"Yes, wel . . .\" She sighed, terribly uncomfortable with the conversation and not sure what to say.\n \"I bet you have spent a good deal of this last year trying to figure out what was wrong with you or what you had done to make George treat you the way he did,\"\n Richard murmured.\n Christiana turned to peer unhappily out the window. She had spent the last year trying to work that out and trying to figure a way to fix things and bring back the sweet, complimentary man who had courted her.\n \"I hope you realize now it wasn\u0027t you,\" he said gently. \"George would have treated you poorly no matter who you were. He treated everyone that way.\"\n \"I suppose,\" she murmured, peering down at her embroidery again.\n Richard sighed, a sound that struck her as slightly exasperated, but he let that subject go and instead said, \"While I understand why you and Suzette would be angry with your father, I think it may be undeserved.\"\n She raised her eyebrows in question. \"Oh?\"\n \"Do you know how the first losses happened?\" he asked.\n Christiana shook her head. \"Al I know is Father went to town to meet with his solicitor about estate business and came back several days late, terribly upset. It took some effort to get him to tel us what was wrong, and then he final y confessed he\u0027d somehow wound up at a gaming hel and gambled us into debt and that the owner of the gaming hel was demanding payment and while he\u0027d managed to pay some of it, he just didn\u0027t have the money to pay the rest. We were al upset and trying to work out a way to get the money when Dicky showed up to save the day.\"\n \"How did he know to save the day?\"\n Christiana blinked at the question. \"What?\"\n \"You said Dicky showed up to save the day,\" Richard pointed out. \"How did he know the day needed saving?\"\n \"Oh.\" She frowned. \"Wel , I didn\u0027t mean that he knew about it when he arrived. It was just a grand coincidence, or at least I think it was. I\u0027m not sure about anything now, but at the time it seemed coincidence, and I just assumed that Father told him of his troubles while they talked and Dicky offered to pay his remaining debt to sweeten his offer of marriage.\"\n \"Hmm,\" Richard\u0027s mouth thinned out, and then he said, \"Wel , Daniel and I suspect Dicky had something to do with getting your father to the gaming hel in the first place that time too.\"\n \"You do?\" she asked with surprise. \"Why?\"\n \"Because there are rumors in town that the Earl of Radnor has become friendly with a certain owner of a gaming hel where it\u0027s suspected the players are drugged and fleeced. I believe it\u0027s the same gaming hel where your father lost his money. And it wouldn\u0027t surprise me to learn that George had taken your father there both times.\"\n He frowned and added, \"I shal ask your father about that on our return. If I\u0027d been thinking clearly I would have done it yesterday.\"\n Christiana stared at Richard blankly, and then blurted, \"But why? Why would he do such a thing?\"\n \"Wel , if he did it the first time, it was probably to force an opportunity to marry you and get his hands on your dower,\" he said apologetical y.\n \"But no one knows about it.\"\n \"Langley does,\" he pointed out.\n \"He\u0027s like family. Robert wouldn\u0027t tel anyone,\" she assured him firmly.\n \"While I knew him as a child, I don\u0027t know him as a man yet, so I wil trust your judgment on that,\" he said and then asked, \"Who else knows?\"\n She frowned. \"No one. Robert only knows because we were playing in the attic when the lawyers visited and there is a spot where you can hear what is said in Father\u0027s office.\"\n Richard was silent for a moment and then asked, \"Who is your father\u0027s lawyer?\"\n \"An older gentleman with a funny moustache . . . I believe his name is Buttersworth,\" she said after a moment\u0027s thought.\n \"Ah.\" Richard, said with understanding and sat back in his seat. \"John Buttersworth Junior has been a friend of George\u0027s since school.\"\n \"You think his father told him about my grandfather\u0027s wil ?\"\n \"He wouldn\u0027t have to. John Junior works with his father now. The plan is for him to take over his father\u0027s clients when the time comes.\"\n Christiana scowled at this news. \"So you think that John Junior told Dicky about our dowers and that he deliberately took Father to the gaming hel both times to be drugged so that he\u0027d gamble when he wouldn\u0027t normal y?\"\n \"Your father isn\u0027t a gambler?\" Richard asked.\n She shook her head. \"He\u0027d never gambled before in his life until that one time last year. And then he didn\u0027t gamble again until now. Father is more a stayat-home type. He works the estate and spends the evenings dining with friends in the area or reading by the fire. Even when he had to travel into the city to see his lawyer or manage other business, he was more likely to stay in than go out, and then it was only to stop at the club for a drink and catch up with to see his lawyer or manage other business, he was more likely to stay in than go out, and then it was only to stop at the club for a drink and catch up with old friends. That\u0027s why it was so shocking and upsetting when we learned he\u0027d gambled and so deeply.\"\n \"And this time? Was it as much?\" Richard asked.\n Christiana shook her head. \"No. I gather it\u0027s about half what it was the first time.\n But Father drained the estate to pay his debt the first time. Dicky only paid off what was stil outstanding after he\u0027d squeezed al the money out that he could. The estate would recover slowly, but there is little actual money to hand, so even the smal er amount this time would force the sale of the estate.\"\n \"Unless Suzette married,\" Richard said thoughtful y.\n \"Yes.\" Christiana frowned. \"I suppose it makes sense that Dicky took Father to the gaming hel the first time to force my marrying him, but why would he do it this second time?\" That had been troubling her even before she\u0027d heard Richard\u0027s suspicions that Dicky had been the one to take her father to the gaming hel the first time. Why had Dicky taken him there when he\u0027d known what had happened the first time?\n \"I don\u0027t know,\" Richard admitted on a sigh. \"He wouldn\u0027t have profited from it this time.\"\n Christian clucked impatiently and stabbed her needle into the cloth, wishing it was Dicky. She wished the stupid man would come back to life long enough to answer these questions, and then kindly drop dead again. However, that simply wasn\u0027t going to happen. She\u0027d seen Dicky when the men had taken him from the bed and folded him into the chest presently resting on top of the carriage she and Richard rode in. The man was definitely dead, and they were removing him from the house none too soon. It was time he was buried. And good riddance to him, she thought unhappily. Of course, it just meant she would be married to the real Richard Fairgrave, Earl of Radnor instead, but even after the last two short days it was becoming obvious that he was nothing like his brother. He hadn\u0027t once tried to control her, not even raising an argument against having to sleep in the guest bedroom though she\u0027d expected he would. He also hadn\u0027t criticized her even once yet, but instead had given her a handful of compliments, which was a handful more than she\u0027d received from Dicky during their marriage. Many of those compliments had been during their night of passion, which might not be that reliable. But one had been at the bal the night they\u0027d met, and he\u0027d greeted her that morning with another, saying she looked lovely with her hair in the much softer style Grace had arranged it in. More importantly though, he seemed to respect her opinion, trusting Langley on her say-so twice now, and that was very important to her. She had always considered herself a relatively intel igent and sensible young woman, but George had made her feel stupid and clumsy. Richard didn\u0027t make her feel that way.\n \"I am surprised you do embroidery,\" Richard said suddenly. \"From al Langley has told me it sounded as if you were more into horseback riding and other physical pursuits while growing up.\"\n \"Yes.\" She smiled faintly at the thought of her childhood, and explained, \"Robert was often at our home while we were growing up, and we were always running, jumping, riding and whatnot. I fear my sisters and I were never real y interested in the more ladylike pursuits such as\" - she glanced down at the cloth in her hand and grimaced - \"needlework.\"\n \"And yet you do it now,\" he pointed out.\n \"Dicky - I mean George - \"\n \"You can cal him Dicky if you like,\" he interrupted gently. \"I don\u0027t mind so long as you never cal me Dicky again. That was George\u0027s nickname for me and I always hated it.\"\n Christiana nodded, but simply said, \"He insisted I learn embroidery and other more ladylike pursuits. He said I was far too unruly and needed to learn discipline and needlework would teach it to me.\"\n \"Control ing idiot,\" Richard snorted with disgust, and suddenly leaned across the smal space and snatched the cloth from her.\n \"Richard!\" she cried with surprise, and then half rose from her seat to try grab it back. \"Give me that back.\"\n He merely held the cloth behind his head and asked, \"Do you enjoy it or do you only do it because he said you should and it has become a habit?\"\n \"I - wel . . .\" She frowned and muttered, \"It would not hurt me to learn to be a proper lady. Mother died shortly after Lisa was born and I fear Father let us run a bit wild. We didn\u0027t learn what most girls do.\"\n \"That does not answer my question. Do you enjoy it?\" he repeated, grabbing her arm to steady her as they hit a rut in the road.\n \"No,\" she admitted on a sigh. \"I do not like it at al .\"\n \"Just as I thought,\" he said dryly. Richard opened the window and tossed the embroidery out. Christiana gaped after the fluttering bit of cloth, and then turned to peer at him in amazement. \"I cannot believe you just did that.\"\n \"Believe it,\" Richard said solemnly. \"You do not need to do embroidery if you do not like it. I wil not try to change you. You can be yourself with me.\"\n She stared into his face for a moment and then swal owed a sudden lump in her throat and shook her head. \"You do not know me. What if you do not like me once you do? Dicky said I was - \"\n \"My brother was an idiot,\" he assured her solemnly. \"He was selfish and self-absorbed and lacked the capacity to care about anyone but himself. In truth, I suspect al those efforts to try to control and change you were based in envy.\"\n \"Envy?\" Christiana asked with surprise.\n Richard nodded. \"You have something he never possessed and never could.\n You appear to have a basic optimism and joy in life. I\u0027ve seen it. Oh, I\u0027m sure you worry when trouble strikes and can have a sad day like anyone else, but you can also just as quickly shed your fears and worries and smile and enjoy life once those worries pass. I do not think George enjoyed a single day in his life. I do not think he ever felt hope, or happiness. Perhaps he was afraid that if he did find happiness it would be snatched away, but whatever the case, he just did not have it in him. I suspect that is why he liked to take it from others.\" Richard peered at her solemnly.\n \"From what I can tel he spent the last year trying to browbeat that happiness out of you.\"\n \"And he tried to steal it from you by having you kil ed and taking your name and position in society,\" she said quietly. \"And yet as you say, he wasn\u0027t happy.\"\n \"No, he wasn\u0027t,\" Richard agreed, but his voice was distracted this time, his gaze suddenly fixed. Christiana raised her eyebrows at the change in both his expression and the sudden tightening of his fingers on her arm, and then glanced down and saw what had caught his attention. She stil stood in the half-bent position she\u0027d taken when she\u0027d tried to grab back her embroidery. It left her slightly bent at the waist, and her chest directly before his eyes with the neckline gaping to reveal a good deal of her bosom. Blushing furiously she forgot she was in a carriage and started to straighten, managing to bang her head on the roof, and then they hit a rut in the road and she stumbled forward. Richard reached to steady her even as she caught at his shoulders and between the two of them she came to a halt with her bosom just a hair\u0027s breadth from his mouth.\n \"I should real y sit down before I fal down,\" she said breathlessly, the moment she could find her voice.\n \"Yes,\" Richard agreed, but rather than release her, his hands shifted to the back of her legs and with a little pressure and guidance she was suddenly straddling him on the bench seat.\n \"Oh, I don\u0027t think - \"\n The rest of her very lame protest was lost when his mouth suddenly covered hers. Christiana didn\u0027t even try to pretend she wanted to protest further, but opened to him at once and let her arms creep around his neck with a little sigh. She did so like his kisses. Christiana had been able to think of little else since their night of passion, the memories of what they\u0027d done and how he\u0027d made her feel had interfered with her every thought since then. When he deepened the kiss, driving his tongue into her mouth, she gave a little moan and tilted her head for him, her fingers tightening on the strands of his hair and then scraping across his scalp as the familiar heat began to build in her lower bel y. His hands had settled on her hips once he had her on his lap, but began to move now, riding up her sides and then around until he could cup her breasts in his hands through the cloth of her gown. Christiana arched into the caress, groaning as he began to knead the eager flesh through the soft material. As nice as it was, she found herself wishing her gown away so she could feel his flesh against her own.\n She knew from experience how much nicer it was when his hands, work roughened from his time on the farm, were unimpeded by material. Christiana had barely had the thought when Richard gave up caressing her and began to tug at her gown, trying to pul it off her shoulders. Releasing her hold on his head, she reached to help and then gave a little sigh and shiver as the cloth slid down her arms, freeing her bosom. Richard broke their kiss then to al ow her to lean back and remove her arms from the sleeves. The material soon dropped away, leaving her completely, brazenly bare from the waist up.\n Christiana would have pressed herself shyly against him then and kissed him once more to help ease the embarrassment suddenly claiming her, but Richard held her back, determined to look his fil . His eyes traveled hungrily over what she\u0027d revealed, and then he said, \"You\u0027re beautiful. Absolutely perfect.\"\n His voice was rough with a need that cal ed out to the hunger she was experiencing and then his hands rose to cover both naked globes and she sighed with a combination of relief and pleasure as he began to caress her. Covering his hands with her own, Christiana squeezed as wel , urging him on and then moaned and tipped her head back, eyes closing as he caught her nipples between thumbs and forefingers and toyed with them. The heat in her bel y was now a wildfire, spreading outward and making her very core ache in a way she\u0027d never experienced before Richard. Gasping with want, she squeezed his hands harder and then raised her head and kissed him with al the hunger he was causing in her. It wasn\u0027t enough. Even when he drove his tongue between her lips, and she writhed into his hands, her hips pressing down into his lap, it stil wasn\u0027t enough. She wanted more. When he slid one hand out from under hers, it left her own covering the abandoned orb and Christiana instinctively squeezed it herself and then stiffened with a gasp as she felt the roughened fingers of his hand touch her knee beneath her skirt and begin to glide up her inner thigh. When it reached the apex of her thighs and brushed over the damp, swol en flesh there, her hips rose up with a jolt, but his caress fol owed and she broke their kiss to groan his name desperately. And then to squeal it with shock as the carriage suddenly shuddered to a halt and she went flying backward. Fortunately, Christiana landed on the bench seat across from Richard, though she arrived there in something of a muddle, her skirts flying up to cover her face and chest.\n \"Are you al right?\" Richard was there at once trying to right her and brushing her skirts down so that he could see her face.\n \"Yes,\" Christiana assured him, pul ing her gown up to cover her chest and peering about uncertainly. \"What happened? Why have we stopped?\"\n \"I\u0027m not sure,\" Richard admitted and turned to peer out the window. While he was distracted, Christiana quickly slid her arms back into her sleeves and pul ed the top of her gown back into place. She was feeling her hair, trying to tel if it was al right or needed fixing when he muttered, \"It would appear we\u0027ve reached Stevanage. I told them to stop there for lunch.\"\n \"Oh,\" she murmured and let her hands drop as he turned back to her. His eyebrows rose when he saw what she\u0027d done.\n \"That was fast, and you look as perfect as you did this morning. Wel done,\" he praised and then pressed a quick kiss to the tip of her nose before turning back to open the carriage door.\n Christiana stared after him with amazement as he got out of the carriage. The compliment was nice, but the kiss on the nose had seemed . . . wel , it had been the affectionate sort of thing her father would have done when she was younger. Not that she thought Richard\u0027s feelings toward her were in any way fatherly, but the action seemed to speak of affection.\n \"Are you coming, Christiana?\"\n \"Are you coming, Christiana?\"\n She blinked and stared at the hand Richard was holding out to her, but then took it and descended from the carriage, noting that there appeared to be something in his expression that could have been affection as wel . Or perhaps she was just imagining that because she wanted to believe it was there, Christiana acknowledged on a smal sigh.\n \"Is something wrong?\" Richard asked, apparently having heard the sigh.\n Christiana shook her head at once. \"No, no. Everything is fine,\" she assured him glancing around to see the other two carriages had drawn to a halt behind them and everyone was disembarking.\n \"Come, let\u0027s get you inside and find you something to eat,\" Richard said, taking her arm to lead her toward the inn.\n \"What about the others?\" she asked, glancing over her shoulder.\n \"They\u0027l fol ow. I\u0027m more concerned with you. You skipped breakfast this morning in favor of packing and I suspect you didn\u0027t eat much of the tray I had sent up to your room last night when you didn\u0027t join us at the table.\"\n \"I was helping Grace pick out what we should bring,\" she explained.\n \"I know, and I understand, but you\u0027re looking a bit pale now and a good meal wil probably set you to rights.\"\n Christiana fel silent and merely al owed him to lead her inside, but her thoughts were not silent. George had always been nagging at her about eating, using it as an opportunity to force her to eat unpleasant things she didn\u0027t care for when he was annoyed with her. She didn\u0027t deliberately skip eating. The problem was she\u0027d been so miserable this last year she hadn\u0027t real y felt like doing anything, even eating. That wasn\u0027t what had happened last night and this morning, though. Her forgetting to eat then had just been because she was so busy. But Richard wasn\u0027t nagging at her and using it as an opportunity to berate and insult her as George had always done. Instead he was being sweet and understanding and even concerned. It made her feel . . . cared for.\n \"Here we are.\" He settled her at a large table where everyone could join them and then glanced toward the innkeeper and back before asking, \"Is there anything you don\u0027t like?\"\n Christiana felt her eyes narrow. \"Why?\"\n \"So I don\u0027t accidental y order you something you don\u0027t care for,\" he said with a laugh as if that should be obvious, and she supposed it should have been. Richard was not George.\n Smiling, she said, \"As long as it is not kippers, kidney, or liver, I should like it.\"\n Richard nodded and headed off to speak with the innkeeper. Christiana watched him go, thinking that her life had definitely changed for the better. If he continued to treat her as he had since their meeting at the bal , she thought she could have a nice life, perhaps even a very nice, happy life. Or not, Christiana thought on a sigh, because between the pleasure he gave her, the respect he showed her, and the kindness with which he dealt with her, she could easily fal in love with this man, truly in love, not the infatuation she\u0027d decided she\u0027d had for George. And that would be awful if he didn\u0027t love her back.\n \"Men!\"\n Christiana glanced around with surprise as Lisa suddenly dropped into the seat beside her, her face disgruntled and eyes glaring as she watched Langley walk over to join Richard by the innkeeper.\n \"Don\u0027t mind her,\" Suzette said, taking up the seat on Christiana\u0027s other side as Daniel went to join the men. \"She\u0027s just annoyed with Robert.\"\n \"Why?\" Christiana asked, glancing from one to the other.\n \"Because if he is not ignoring me, he is treating me like a child and I am heartily sick of it.\" Lisa said grimly. \"I think I shal ride with you and Dicky for the rest of the journey.\"\n \"Richard,\" Christiana corrected, and felt a moment\u0027s regret that she would not be alone with him again. It was quickly fol owed by the more sensible side of her mind deciding that might be a good thing. She had no doubt that had the carriage not stopped, by now she and Richard would be doing things a girl wasn\u0027t supposed to do until she was married. And while she\u0027d thought she was married this last year, she wasn\u0027t, so shouldn\u0027t be doing them . . . which was real y a shame because she liked it very much. But in a couple days they would reach Gretna Green and be married and could do it al they liked, Christiana reminded herself . . . unless Richard was like George and suddenly changed the moment the \"I dos\" were said. That thought had her frowning and glancing to the man worriedly.\n \"You can\u0027t leave me alone with the men, Lisa,\" Suzette protested. \"Who wil I talk to?\"\n \"The men?\" Christiana suggested, forcing her attention back to the conversation.\n Suzette snorted at the idea. \"They don\u0027t talk. Not when they\u0027re together. Daniel talks to me when we\u0027re alone, but with Langley in the carriage I couldn\u0027t get him to talk about anything.\"\n \"When have you been alone with Daniel?\" Christiana asked with a frown.\n \"Oh . . . erm . . .\" Suzette shrugged. \"Just for a minute or two here and there the last day or so.\"\n \"Hmm.\" Christiana eyed her suspiciously, able to tel when Suzette was lying, but not sure she wanted to know the truth in this instance.\n \"Wel , you can come ride with Chrissy and Dicky and me too,\" Lisa said unrepentantly.\n \"Richard,\" Christiana corrected again. Dicky was the hateful imposter she\u0027d been married to. Richard was the true man she wasn\u0027t married to . . . yet. Unfortunately, what with the rush to pack and set out, she hadn\u0027t got the chance to explain things to her sisters yet.\n \"Here we are.\"\n Christiana glanced up and murmured a thank-you as a glass of some beverage was set before her. It smel ed like cider and she smiled appreciatively at Richard as he settled across the table from her.\n \"The innkeeper\u0027s wife has a pot of beef stew bubbling in the back. It smel s delicious so I ordered us both that. But I didn\u0027t think to ask you what you\u0027d like to drink, so I asked Langley what you like and he said cider. Fortunately, they had some.\"\n \"Thank you,\" Christiana murmured again. \"Beef stew sounds delicious and I do like cider.\"\n \"Married a year and you had to ask Langley what she likes,\" Suzette muttered with disgust.\n Christiana kicked her under the table and glared when Suzette glanced to her in surprise.\n \"Wel , at least he asked,\" she said grimly. \"Dicky wouldn\u0027t have bothered.\"\n It was only when Suzette peered at her with confusion that Christiana realized what she\u0027d said. Before she could explain, Lisa, who apparently hadn\u0027t caught the slip, said, \"Dicky, it\u0027s al right if Suzette and I ride with you and Christiana the rest of the way, isn\u0027t it?\"\n \"Richard,\" Christiana and Richard corrected as one, and then shared a wry smile.\n \"If the girls are going to ride in your carriage, you\u0027re welcome to join Robert and me in mine,\" Daniel offered, setting a glass of lemonade in front of Suzette as he sat down next to Richard.\n \"Oh.\" Richard glanced her way, but then sighed in defeat and nodded. \"Yes. Fine.\n Thanks.\"\n Christiana picked up her glass and took a sip to hide her expression. She could tel he wasn\u0027t pleased with this turn of events and had probably hoped to continue what they\u0027d started before the carriage had stopped, but events were conspiring against him. \n","sourceLink":"https://allnovel.net/the-countess-madison-sisters-1/page-12.html","bookId":2648,"book":{"id":2648,"title":"The Countess (Madison Sisters #1)","description":"Storyline: \n The Countess (Madison Sisters #1) \n Not until her husband dropped dead, that is. He had been horrible enough to Christiana during their short marriage, and she was not going to allow the traditional period of mourning to ruin her sisters\u0027 debuts as well. So she decides to put him on ice and go on as if nothing\u0027s happened ... \n Until the real earl appears. Richard Fairgrave had every intention of confronting his villainous twin who had robbed him of his name and title ... only to discover that he had died. Quietly assuming his identity, Richard must now deal with a maddening desire for his ravishing inherited wife --- certainly a gold digger and possibly a murderess. And Christiana must deal with an unwanted new husband ... and they both must figure out what to do before the ice melts.\n \n","cover":"https://allnovel.net/images/the-countess-madison-sisters-1.jpg","author":"Lynsay Sands","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-countess-madison-sisters-1.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:49:09 AM"}}
