{"id":108897,"no":15,"title":"Page 15","content":"Hurrying behind Damon, Elena tried not to look either to the left or the right. She could see too much of what to Meredith and Bonnie must have appeared to be featureless darkness.\\n\\n There were depots on either side, places where slaves were obviously brought to be bought or sold or transported later. Elena could hear the whimpers of children in the darkness and if she hadn\u0027t been so frightened herself, she would have rushed off looking for the crying kids.\\n\\n But I can\u0027t do that, because I\u0027m a slave now, she thought, with a sense of shock that ran up from her fingertips. I\u0027m not a real human being anymore. I\u0027m a piece of property.\\n\\n She found herself once again staring at the back of Damon\u0027s head and wondering how on earth she had talked herself into this. She understood what being a slave meant - in fact she seemed to have an intuitive understanding of it that surprised her - and it was Not a Good Thing to Be.\\n\\n It meant that she could be...well, that anything could be done to her and it was no one\u0027s business but that of her owner. And her owner (how had he talked her into this again?) was Damon, of all people.\\n\\n He could sell all three girls - Elena, Meredith, and Bonnie - and be out of here in an hour with the profits.\\n\\n They hurried through this area of the docks, the girls with their eyes on their feet to prevent themselves from stumbling.\\n\\n And then they crested a hill. Below them, in a sort of crater-shaped formation, was a city.\\n\\n The slums were on the edges, and crowded almost up to where they were standing. But there was a chicken-wire fence in front of them, which kept them isolated even while allowing them a bird\u0027s-eye view of the city. If they had still been in the cave they had entered, this would have been the greatest underground cavern imaginable - but they weren\u0027t underground anymore.\\n\\n \"It happened sometime during the ferry ride,\" Damon said. \"We made - well - a twist in space, say.\" He tried to explain and Elena tried to understand. \"You went in through the Demon Gate, and when you came out you were no longer in Earth\u0027s Dimension, but in another one entirely.\" Elena only had to look up at the sky to believe him. The constellations were different; there was no Little or Big Dipper, no North Star.\\n\\n Then there was the sun. It was much larger, but much dimmer than Earth\u0027s, and it never left the horizon. At any moment about half of it showed, day and night - terms which, as Meredith pointed out, had lost their rational meaning here.\\n\\n As they approached a gate made of chicken wire that would finally let them out of the slave-holding area, they were stopped by what Elena would later learn was a Guardian.\\n\\n She would learn that in a way, the Guardians were the rulers of the Dark Dimension, although they themselves came from another place far away and it was almost as if they had permanently occupied this little slice of Hell, trying to impose order on the slum king and feudal lords who divided the city among themselves.\\n\\n This Guardian was a tall woman with hair the color of Elena\u0027s own - true gold - cut square at shoulder length, and she paid no attention at all to Damon but immediately asked Elena, who was first in line behind him, \"Why are you here?\"\\n\\n Elena was glad, very glad, that Damon had taught her to control her aura. She concentrated on that while her brain hummed at supersonic speed, wondering what the right response to this question was. The response that would leave them free and not get them sent home.\\n\\n Damon didn\u0027t train us for this, was her first thought. And her second was, no, because he\u0027s never been here before. He doesn\u0027t know how everything works here, only some things.\\n\\n And if it looked as if this woman was going to try to interfere with him, he might just go crazy and attack her, a helpful little voice added from somewhere in Elena\u0027s subconscious. Elena doubled the speed of her scheming. Creative lying had once been a sort of specialty of hers, and now she said the first thing that popped into her head and got a thumbs-up: \"I gambled with him and lost.\"\\n\\n Well, it sounded good. People lost all sorts of things when they gambled: plantations, talismans, horses, castles, bottles of genii. And if it turned out not to be enough of a reason, she could always say that that was just the start of her sad story. Best of all, it was in a way, true. Long ago she\u0027d given her life for Damon as well as for Stefan, and Damon had not exactly turned over a new leaf as she\u0027d requested. Half a leaf, maybe. A leaflet.\\n\\n The Guardian was staring at her with a puzzled look in her true blue eyes. People had stared at Elena all her life - being young and very beautiful meant that you fretted only when people didn\u0027t stare. But the puzzlement was a bit of a worry. Was the tall woman reading her mind? Elena tried to add another layer of white noise at the top. What came out was a few lines of a Britney Spears song. She turned the psychic volume up.\\n\\n The tall woman put two fingers to her head like someone with a sudden headache. Then she looked at Meredith.\\n\\n \"Why...are you here?\"\\n\\n Usually Meredith didn\u0027t lie at all, but when she did she treated it as an intellectual art. Fortunately, she also never tried to fix something that wasn\u0027t broken. \"The same for me,\" she said sadly.\\n\\n \"And you?\" The woman was looking at Bonnie, who was looking as if she were going to be sick again.\\n\\n Meredith gave Bonnie a little nudge. Then she stared at her hard. Elena stared at her harder, knowing that all Bonnie had to do was mumble \"Me, too.\" And Bonnie was a good \"me, too-er\" after Meredith had staked out a position.\\n\\n The problem was that Bonnie was also either in trance, or so close to it that it didn\u0027t matter.\\n\\n \"Shadow Souls,\" Bonnie said.\\n\\n The woman blinked, but not the way you blink when someone says something totally unresponsive. She blinked in astonishment.\\n\\n Oh, God, Elena thought. Bonnie\u0027s got their password or something. She\u0027s making predictions or prophesying or whatever.\\n\\n \"Shadow...souls?\" the Guardian said, watching Bonnie closely.\\n\\n \"The city is full of them,\" Bonnie said miserably.\\n\\n The Guardian\u0027s fingers danced over what looked like a palmtop computer. \"We know that. This is the place they come.\"\\n\\n \"Then you should stop it.\"\\n\\n \"We have only limited jurisdiction. The Dark Dimension is ruled by a dozen factions of overlords, who have slumlords to carry out their orders.\"\\n\\n Bonnie, Elena thought, trying to cut through Bonnie\u0027s mental haze even at the cost of the Guardian hearing her. These are the police.\\n\\n At the same moment, Damon took over. \"She\u0027s the same as the others,\" he said. \"Except that she\u0027s psychic.\"\\n\\n \"No one asked your opinion,\" the Guardian snapped at him, without even glancing in Damon\u0027s direction. \"I don\u0027t care what kind of bigwig you are down there\" - she jerked her head contemptuously at the city of lights - \"you\u0027re on my turf behind this fence. And I\u0027m asking the little red-haired girl: is what he is saying the truth?\"\\n\\n Elena had a moment of panic. After all they\u0027d been through, if Bonnie blew it now...\\n\\n This time Bonnie blinked. Whatever else she was trying to communicate, it was true that she was the same as Meredith and Elena. And it was true that she was psychic. Bonnie was a terrible liar when she had too much time to think about things, but to this she could say without hesitation, \"Yes, that\u0027s true.\"\\n\\n The Guardian stared at Damon.\\n\\n Damon stared back as if he could do it all night. He was a champion out-starer.\\n\\n And the Guardian waved them away.\\n\\n \"I suppose even a psychic can have a bad day,\" she said, then added to Damon, \"Take care of them. You realize that all psychics have to be licensed?\"\\n\\n Damon, with his best grand seigneur manner, said, \"Madam, these are not professional psychics. They are my private assistants.\"\\n\\n \"And I\u0027m not a \u0027Madam\u0027 I\u0027m addressed as \u0027Your Judgment.\u0027 By the way, people addicted to gambling usually come to horrible ends here.\"\\n\\n Ha, ha, Elena thought. If she only knew what kind of gamble we all are taking...well, we\u0027d probably be worse off than Stefan is right now.\\n\\n Outside the fence was a courtyard. There were litters here, as well as rickshaws and small goatcarts. No carriages, no horses. Damon got two litters, one for himself and Elena and one for Meredith and Bonnie.\\n\\n Bonnie, still looking confused, was staring at the sun. \"You mean it never finishes rising?\"\\n\\n \"No,\" Damon said patiently. \"And it\u0027s setting here, not rising. Perpetual twilight in the City of Darkness itself. You\u0027ll see more as we move along. Don\u0027t touch that,\" he added, as Meredith moved to untie the rope around Bonnie\u0027s wrists before either of them got on the litter. \"You two can take the ropes off in the litter if you draw the curtains, but don\u0027t lose them. You\u0027re still slaves, and you have to wear something symbolic around your arms to show it - even if it\u0027s just matching bracelets. Otherwise I get in trouble. Oh, and you\u0027ll have to go veiled in the city.\"\\n\\n \"We - what?\" Elena flashed a look of disbelief at him.\\n\\n Damon just flashed back a 250-kilowatt smile and before Elena could say another word, he was drawing gauzy sheer fabrics from his black bag and handing them out. The veils were of a size to cover an entire body.\\n\\n \"But you only have to put it on your head or tie it on your hair or something,\" Damon said dismissively.\\n\\n \"What\u0027s it made of?\" Meredith asked, feeling the light silky material, which was transparent and so thin that the wind threatened to whip it from her fingers.\\n\\n \"How should I know?\"\\n\\n \"It\u0027s different colors on the other side!\" Bonnie discovered, letting the wind transform her pale green veil into a shimmering silver. Meredith was shaking out a dramatic deep violet silk into a mysterious dark blue dotted with a myriad of stars. Elena, who had been expecting her own veil to be blue, found herself looking up at Damon. He was holding a tiny square of cloth in a clenched fist.\\n\\n \"Let\u0027s see how good you\u0027ve gotten,\" he murmured, nodding her closer to him. \"Guess what color.\"\\n\\n Another girl might only have noticed the sloe black eyes and the pure, carven lines of Damon\u0027s face, or maybe the wild, wicked smile - somehow wilder and sweeter than ever here, like a rainbow in the middle of a hurricane. But Elena also made note of the stiffness in his neck and shoulders - places where tension built up. The Dark Dimension was already taking its toll on him, psychically, even as he mocked it.\\n\\n She wondered how many soundings of Power by the merely curious he was having to block each second. She was about to offer to help by opening herself up to the eldritch world, when he snapped, \"Guess!\" in a tone that didn\u0027t make it a suggestion.\\n\\n \"Gold,\" Elena said instantly, surprising herself. When she reached to take the golden square from his hand a powerful, pleasurable feeling of electric current shot from her palm up her arm and seemed to skewer her straight through the heart. Damon clung to her fingers briefly as she took the square and Elena found she could still feel electricity pulsing from his fingertips.\\n\\n The underside of her veil blew out white and sparkling as if set with diamonds. God, maybe they were diamonds, she thought. How could you tell with Damon?\\n\\n \"Your wedding veil, perhaps?\" Damon murmured, lips close to her ear. The rope around Elena\u0027s wrists had come very loose and she stroked the diaphanous fabric helplessly, feeling the tiny jewels on the white side cool to the touch of her fingers.\\n\\n \"How did you know you\u0027d need all this stuff?\" Elena asked, with bruising practicality. \"You didn\u0027t know everything, but you seemed to know enough.\"\\n\\n \"Oh, I did research in bars and other places. I found a few people who\u0027d been here and had managed to get out again - or who had gotten kicked out.\" Damon\u0027s wild grin grew even wilder. \"At night while you were asleep. At a little hidden store, I got those.\" He nodded at her veil, and added, \"You don\u0027t have to wear that over your face or anything. Press it to your hair and it will cling to it.\"\\n\\n Elena did so, wearing the gold side out. It fell to her heels. She fingered her veil, already able to see the flirtatious possibilities in it, as well as the dismissive ones. If only she could get this damned rope off her wrists...\\n\\n After a moment, Damon retreated back into the persona of the imperturbable master and said, \"For all our sakes, we ought to be strict about these things. The slum lords and nobility who run this abominable mess they call the Dark Dimension know that it\u0027s only two days away from revolution at any time, and if we add anything to the balance they\u0027re going to Make a Public Example of Us.\"\\n\\n \"All right,\" Elena said. \"Here, hold my string and I\u0027ll get on the litter.\"\\n\\n But there wasn\u0027t much point in the rope, not once they were both sitting in the same litter. It was carried by four men - not big men, but wiry ones, and all of the same height, which made for a smooth ride.\\n\\n If Elena had been a free citizen, she would never have allowed herself to be carried by four people whom (she assumed) were slaves. In fact, she would have made a big noisy fuss over it. But that talk she\u0027d had with herself at the docks had sunk in. She was a slave, even if Damon hadn\u0027t paid anyone to buy her. She didn\u0027t have the right to make a big noisy fuss about anything. In this crimson, evil-smelling place she could imagine that her fuss might even make problems for the litter bearers themselves - make their owner or whoever ran the litter-bearing business punish them, as if it were their fault.\\n\\n Best Plan A for now: Keep Mouth Shut.\\n\\n There was plenty to see anyway, now that they had passed on a bridge over bad-smelling slums and alleys full of tumbledown houses. Shops began to appear, at first heavily barred and made of unpainted stone, then more respectable buildings, and then suddenly they were winding their way through a bazaar. But even here the stamp of poverty and weariness appeared on too many faces. Elena had expected, if anything, a cold, black, antiseptic city with emotionless vampires and fire-eyed demons walking the streets. Instead, everyone she saw looked human, and they were selling things - from medicines to food and drink - that vampires didn\u0027t need.\\n\\n Well, maybe the kitsune and the demons need them, Elena reasoned, shuddering at the idea of what a demon might want to eat. On the street corners were hard-faced, scantily clad girls and boys, and tattered, haggard people holding pathetic signs: A MEMORY FOR A MEAL.\\n\\n \"What do they mean?\" Elena asked Damon, but he didn\u0027t answer her immediately.\\n\\n \"This is how the free humans of the city spend most of their time,\" he said. \"So remember that, before you start going on one of your crusades - \"\\n\\n Elena wasn\u0027t listening. She was staring at one of the holders of such a sign. The man was horribly thin, with a straggly beard and bad teeth, but worse was his look of vacant despair. Every so often he would hold out a trembling hand on which there was a small, clear ball, which he balanced on his palm, muttering, \"A summer\u0027s day when I was young. A summer\u0027s day for a ten-geld piece.\" As often as not there was no one near when he said this.\\n\\n Elena slipped off a lapis ring Stefan had given her and held it toward him. She didn\u0027t want to annoy Damon by getting out of the litter, and she had to say, \"Come here, please,\" while holding the ring toward the bearded man.\\n\\n He heard, and came to the litter quickly enough. Elena saw something move in his beard - lice, perhaps - and she forced herself to stare at the ring as she said, \"Take it. Quickly, please.\"\\n\\n The old man stared at the ring as if it were a banquet. \"I don\u0027t have change,\" he moaned, bringing up his hand and wiping his mouth with his sleeve. He seemed about to drop to the ground unconscious. \"I don\u0027t have change!\"\\n\\n \"I don\u0027t want change!\" Elena said through the huge swelling that had formed in her throat. \"Take the ring. Hurry or I\u0027ll drop it.\"\\n\\n He snatched it from her fingers as the litter bearers started forward again. \"May the Guardians bless you, lady,\" he said, trying to keep up with the litter bearer\u0027s trot. \"Hear me who may! May They bless you!\"\\n\\n \"You really shouldn\u0027t,\" Damon said to Elena when the voice had died away behind them. \"He\u0027s not going to get a meal with that, you know.\"\\n\\n \"He was hungry,\" Elena said softly. She couldn\u0027t explain that he reminded her of Stefan, not just now. \"It was my ring,\" she added defensively. \"I suppose you\u0027re going to say he\u0027ll spend it on alcohol or drugs.\"\\n\\n \"No, but he won\u0027t get a meal with it, either. He\u0027ll get a banquet.\"\\n\\n \"Well, so much the - \"\\n\\n \"In his imagination. He\u0027ll get a dusty orb with some old vampire\u0027s memory of a Roman feast, or someone from the city\u0027s memory of a modern one. Then he\u0027ll play it over and over as he slowly starves to death.\"\\n\\n Elena was appalled. \"Damon! Quick! I have to go back and find him - \"\\n\\n \"You can\u0027t, I\u0027m afraid.\" Lazily, Damon held up a hand. He had a firm grip on her rope. \"Besides, he\u0027s long gone.\"\\n\\n \"How can he do that? How could anyone do that?\"\\n\\n \"How can a lung cancer patient refuse to quit smoking? But I agree that those orbs can be the most addictive substances of all. Blame the kitsune for bringing their star balls here and making them the most popular form of obsession.\"\\n\\n \"Star balls? Hoshi no tama?\" Elena gasped.\\n\\n Damon stared at her, looking equally surprised. \"You know about them?\"\\n\\n \"All I know is what Meredith researched. She said that kitsune were often portrayed with either keys\" - she raised her eyebrows at him - \"or with star balls. And that myths say they can put some or all of their power in the ball, so that if you find it, you can control the kitsune. She and Bonnie want to find Misao\u0027s or Shinichi\u0027s star balls and have control over them.\"\\n\\n \"Be still, my unbeating heart,\" Damon said dramatically, but the next second he was all business. \"Remember what that old guy said? A summer\u0027s day for a meal? He was talking about this.\" Damon picked up the little marble that the old man had dropped on the litter and held it to Elena\u0027s temple.\\n\\n The world disappeared.\\n\\n Damon was gone. The sights and sounds - yes, and the smells - of the bazaar were gone. She was sitting on green grass which rippled in a slight breeze and she was looking at a weeping willow that bent down to a stream that was copper and deep, deep green at once. There was some sweet scent in the air - honeysuckle, freesia? Something delicious that stirred Elena as she leaned back to gaze at picture-perfect white clouds rolling in a cerulean sky.\\n\\n She felt - she didn\u0027t know how to say it. She felt young, but somewhere in her mind she knew that she was actually younger than this alien personality that had taken hold of her. Still, she felt excited that it was springtime and every golden-green leaf, every springy little reed, every weightless white cloud seemed to be rejoicing with her.\\n\\n Then suddenly her heart was pounding. She had just caught the sound of a footfall behind her. In one, springing joyous moment she was on her feet, arms held out in the extremity of her love, the wild devotion she felt for this...\\n\\n ...this young girl? Something inside the sphere user\u0027s brain seemed to fall back in bewilderment. Most of it, though, was taken up with cataloguing the perfections of the girl who had crept up so lightly in the waving grass: the clustering dark curls at her neck, the flashing green eyes below arching brows, the smooth glowing skin of her cheeks as she laughed with her lover, pretending to run away on feet as light as any elf\u0027s...!\\n\\n Pursued and pursuer both fell down together on the soft carpet of long grass...and then things quickly got so steamy that Elena, the distant mind in the background, began wondering how on earth you made one of these things stop. Every time she put her hand to her temple, groping, she was caught and kissed breathless by...Allegra...that was the girl, Allegra. And Allegra was certainly beautiful, especially through this particular viewer\u0027s eyes. The creamy soft skin of her...\\n\\n And then, with a shock just as great as she\u0027d felt when the bazaar disappeared, it appeared again. She was Elena; she was riding on the litter with Damon; there was a cacophony of sounds around her - and a thousand different smells, too. But she was breathing hard and part of her was still resounding with John - that had been his name - with John\u0027s love for Allegra.\\n\\n \"But I still don\u0027t understand,\" she almost keened.\\n\\n \"It\u0027s simple,\" Damon said. \"You put a blank star ball of the size you like to your temple and you think back to the time you want to record. The star ball does the rest.\" He waved off her attempted interruption and leaned forward with mischief in those fathomless black eyes of his. \"Perhaps you got an especially warm summer day?\" he said, adding suggestively, \"These litters do have curtains you can draw closed.\"\\n\\n \"Don\u0027t be silly, Damon,\" Elena said, but John\u0027s feelings had sparked her own, like flint and tinder. She didn\u0027t want to kiss Damon, she told herself sternly. She wanted to kiss Stefan. But since a moment ago she had been kissing Allegra, it didn\u0027t seem as strong an argument as it could be.\\n\\n \"I don\u0027t think,\" she began, still breathless, as Damon reached for her, \"that this is a very good...\"\\n\\n With a smooth flick of the rope, Damon untied her hands completely. He would have pulled it off both wrists, but Elena immediately half-turned, supporting herself with that hand. She needed the support.\\n\\n In the circumstances, though, there was nothing more meaningful - or more...exciting...than what Damon had done.\\n\\n He hadn\u0027t drawn the curtains, but Bonnie and Meredith were behind them on their own litter, out of sight. Certainly out of Elena\u0027s mind. She felt warm arms around her, and instinctively nestled into them. She felt a surge of pure love and appreciation for Damon, for his understanding that she could never do this as a slave with a master.\\n\\n We\u0027re both of us unmastered, she heard in her head, and she remembered that when cooling down most of her psychic abilities she had forgotten to set the volume on low for this one. Oh, well, it might just come in handy....\\n\\n But we both enjoy worship, she replied telepathically, and felt his laughter on her lips as he admitted the truth of it. There was nothing sweeter in her life these days than Damon\u0027s kisses. She could drift like this forever, forgetting the outside world. And that was a good thing, because she had the feeling that there was much depression in the outside and not too much happiness. But if she could always come back to this, this welcome, this sweetness, this ecstasy...\\n\\n Elena jerked in the litter, throwing her weight back so fast that the men carrying it almost fell in a heap.\\n\\n \"You bastard,\" she whispered venomously. They were still psychically entangled, and she was glad to see that through Damon\u0027s eyes she was like a vengeful Aphrodite: her golden hair lifting and whipping behind her like a thunderstorm, her eyes shining violet in her elemental fury.\\n\\n And now, worst of all, this goddess turned her face away from him. \"Not one day,\" she said. \"You couldn\u0027t even keep your promise for a single day!\"\\n\\n \"I didn\u0027t! I didn\u0027t Influence you, Elena!\"\\n\\n \"Don\u0027t call me that. We have a professional relationship now. I call you \u0027Master.\u0027 You can call me \u0027Slave\u0027 or \u0027Dog\u0027 or whatever you want.\"\\n\\n \"If we have the professional relationship of master and slave,\" Damon said, his eyes dangerous, \"then I can just order you to - \"\\n\\n \"Try it!\" Elena lifted her lips in what really wasn\u0027t a smile. \"Why don\u0027t you do that, and see just what happens?\"\\n\\n \\n\\n","sourceLink":"https://allnovel.net/the-return-shadow-souls-the-vampire-diaries-2/page-15.html","bookId":2036,"book":{"id":2036,"title":"The Return: Shadow Souls (The Vampire Diaries #2)","description":"Storyline: Shadow Souls (The Vampire Diaries: The Return, #2) \\n Elena Gilbert\u0027s love, the vampire Stefan Salvatore, has been captured and imprisoned by demonic spirits who are wreaking havoc in Fell\u0027s Church. While her friends Bonnie and Meredith explore the evil that has taken over their town, Elena goes in search of Stefan. In order to find him, she entrusts her life to Stefan\u0027s brother, Damon Salvatore, the handsome but deadly vampire who wants Elena, body and soul. Along with her childhood friend Matt, they set out for the slums of the Dark Dimension, where Stefan is being held captive. It is rumored to be a world where vampires and demons roam free, but humans must live enslaved to their supernatural masters...\\n","cover":"https://allnovel.net/images/the-return-shadow-souls-the-vampire-diaries-2.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-return-shadow-souls-the-vampire-diaries-2.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:28:15 PM"}}
