{"id":108922,"no":40,"title":"Page 40","content":"Matt and Mrs. Flowers were in the bunker - the addition to the house that Mrs. Flowers\u0027s uncle had put onto the back for woodwork and other hobbies. It had fallen into even more neglect than the rest of the house, being used as a storage space for things Mrs. Flowers didn\u0027t know where else to put - such as Cousin Joe\u0027s folding cot and that old sagging couch that didn\u0027t match a stick of furniture inside anymore.\n Now, at night, it was their haven. No child or adult from Fell\u0027s Church had ever been invited inside. In fact, except for Mrs. Flowers, Stefan - who\u0027d helped move large furniture into it - and now Matt, no one had even been in for as long as Mrs. Flowers could remember.\n Matt clung to this. He had been, slowly but surely, reading through the material Meredith had researched and one precious excerpt had meant a lot to him and Mrs. Flowers. It was the reason they were able to sleep at night, when the voices came.\n The kitsune is often thought to be a sort of cousin to Western vampires, seducing chosen men (as most fox spirits take on a female form) and feeding directly on their chi, or life spirit, without the intermediary of blood. Thus one may make a case that they are bound by similar rules to the vampire. For example, they cannot enter human dwellings without invitation...\n And oh, the voices...\n He was profoundly glad now that he\u0027d taken Meredith and Bonnie\u0027s advice and gone to Mrs. Flowers\u0027s first before going home. The girls had convinced him he\u0027d only be putting his parents in danger by facing up to the lynch mob that awaited him, ready to kill him for allegedly assaulting Caroline. Caroline seemed to have found him at the boardinghouse immediately, anyway, but she never brought any kind of mob with her. Matt thought that perhaps it was because that would have been useless.\n He had no idea what might have happened if the voices had belonged to ex-friends long ago invited to his house while he was at home.\n Tonight...\n \"Come on, Matt,\" Caroline\u0027s voice, lazy, slow, and seductive purred. It sounded as if she were lying down, speaking into the crack under the door. \"Don\u0027t be such a spoilsport. You know you have to come out sometime.\"\n \"Let me talk to my mom.\"\n \"I can\u0027t, Matt. I told you before, she\u0027s undergoing training.\"\n \"To be like you?\"\n \"It takes a lot of work to get to be like me, Matt.\" Suddenly Caroline\u0027s tone was not flirtatious any longer.\n \"I bet,\" Matt muttered, and added, \"You hurt my family and you\u0027re going to be sorrier than you can imagine.\"\n \"Oh, Matt! Come on, get real. Nobody is going to hurt anybody.\"\n Matt slowly opened his hands to look at what he had clenched between them. Meredith\u0027s old revolver, filled with the bullets blessed by Obaasan.\n \"What is Elena\u0027s middle name?\" he asked - not loudly, even though there were the sounds of music and dancing in Mrs. Flowers\u0027s backyard.\n \"Matt, what are you talking about? What are you doing in there, making a family tree?\"\n \"I asked you a simple question, Care. You and Elena played since you were practically babies, right? So what is her middle name?\"\n A flurry of activity. When Caroline finally answered he could clearly hear the whispered coaching, as Stefan had heard so long ago, just a beat before her words.\n \"If all you\u0027re interested in is playing games, Matthew Honeycutt, I\u0027ll go find someone else to talk to.\"\n He could practically hear her flounce away.\n But he felt like celebrating. He allowed himself a whole graham cracker and half a cup of Mrs. Flowers\u0027s homemade apple juice. They never knew when they might be locked in here for good, with only the supplies they had, so whenever Matt went out of the bunker he brought back as many things as he could find that might be useful. A barbeque lighter and hairspray equaled a flame thrower. Jar after jar of Mrs. Flowers\u0027s delicious preserves. Lapis rings in case the worst happened and they ended up with pointy teeth.\n Mrs. Flowers turned in her sleep on the couch. \"Who was that, Matt dear?\" she asked.\n \"Nobody at all, Mrs. Flowers. You just go back to sleep.\"\n \"I see,\" Mrs. Flowers said in her sweet-old-lady voice. \"Well, if nobody at all comes back you might ask her her own mother\u0027s first name.\"\n \"I see,\" Matt said in his best imitation of her voice and then they both laughed. But underneath his laughter there was a lump in his throat. He had known Mrs. Forbes a long time, too. And he was scared, scared of the time that it would be Shinichi\u0027s voice calling.\n Then they were going to be in trouble for good.\n \"There it is,\" shouted Sage.\n \"Elena!\" screamed Meredith.\n \"Oh, God!\" screamed Bonnie.\n The next instant, Elena was thrown, and something landed on top of her. Dully, she heard a cry. But it was different from the others. It was a choking sound of pure pain as Bloddeuwedd\u0027s beak thunked into something made of flesh. Me, Elena thought. But there was no pain.\n Not...me?\n There was a coughing sound above her.\n \"Elena - go - my shields - won\u0027t hold - \"\n \"Damon! We\u0027ll go together!\"\n Hurts...\n It was just the shadow of a telepathic whisper and Elena knew Damon didn\u0027t think she\u0027d heard it. But she was circling her Power faster and faster, done with deception, caring only about getting those she loved out of danger.\n I\u0027ll find a way, she told Damon. I\u0027ll carry you. Fireman\u0027s lift.\n He laughed at that, giving Elena some hope that he wasn\u0027t dying. Now Elena wished she\u0027d taken Dr. Meggar in the carriage with them so he could use his healing powers on the injured -\n - and then what? Leave him to the mercies of Bloddeuwedd? He wants to build a hospital here, in this world. He wants to help the children, who surely don\u0027t deserve all the evils that I\u0027ve seen visited on them -\n She shunted the thoughts aside. This was no time for a philosophical debate about doctors and their obligations.\n It was time to run.\n Reaching behind her, she found two hands. One was slick with blood so she reached farther, thanking her late mother for all the ballet lessons, all the children\u0027s yoga, and she grabbed the sleeve above it. And then she put her back into it and pulled.\n To her surprise she hauled Damon up with her. She tried to heft him farther up on her back, but that didn\u0027t work. And then she even managed a wobbly step forward, and another -\n And then Sage was there picking both of them up and they were going into the lobby of the building of the Shi no Shi.\n \"Everyone, get out! Get out! Bloddeuwedd\u0027s after us and she\u0027ll kill anything in her way!\" Elena shouted. It was the strangest thing. She hadn\u0027t meant to shout. Hadn\u0027t formulated the words, except perhaps in the deepest parts of her subconscious. But she did shout them into the already frenzied lobby and she heard the cry taken up by others.\n What she didn\u0027t expect was that they would run, not out into the street, but down toward the cells. She ought to have, of course, but she hadn\u0027t. And then she felt herself and Sage and Damon going down, down the way they had last night...\n But was it really the right way? Elena clamped one hand over the other and saw, judging by foxlight, that they needed to head off to the right.\n \"WHAT ARE THOSE CELLS TO THE RIGHT OF US? HOW DO WE GET THERE?\" she shouted to the young vampire gentleman next to her.\n \"That\u0027s Isolation and Mentally Disturbed,\" the vampire gentleman shouted back. \"Don\u0027t go that way.\"\n \"I have to! Do I need a key?\"\n \"Yes, but - \"\n \"Do you have a key?\"\n \"Yes, but - \"\n \"Give it to me now!\"\n \"I can\u0027t do that,\" he wailed in a way that reminded her of Bonnie at her most difficult.\n \"All right. Sage!\"\n \"Madame?\"\n \"Send Talon back to peck this man\u0027s eyes out. He won\u0027t give me the key to Stefan\u0027s ward!\"\n \"As good as done, Madame!\"\n \"W-wait! I cha-changed my mind. Here\u0027s the key!\" The vampire fished through a ring of keys and handed one to her.\n It looked like the other keys on his ring. Too much alike, Elena\u0027s suspicious mind said.\n \"Sage!\"\n \"Madame !\"\n \"Can you wait till I pass with Saber? I want him to tear the you-know-what off this guy if he\u0027s lied to me.\"\n \"Of course, Madame!\"\n \"W-w-w-wait,\" gasped the vampire. It was clear that he was completely terrified. \"I may - may have given you the wrong key - in this - this light - \"\n \"Give me the right key and tell me anything I need to know or I\u0027ll have the dog backtrack you and kill you,\" Elena said, and at that moment, she meant it.\n \"H-here.\" This time the key didn\u0027t look like a key. It was round, slightly convex, with a hole in the middle. Like a donut that\u0027s been sat on by a police officer, part of Elena\u0027s mind said, and began laughing hysterically.\n Shut up, she told her mind sharply.\n \"Sage!\"\n \"Madame?\"\n \"Can Talon see the man I\u0027m holding by the hair?\" She had to go on tiptoe to grasp him.\n \"But of course, Madame!\"\n \"Can she remember him? If I can\u0027t find Stefan I want her to show him to Saber so he can track him.\"\n \"Uh...ah...got it, Madame!\"\n A hand, dripping blood from the wrist, lifted a falcon high, at the same time as there was a serendipitous crash from the top of the building.\n The vampire was almost sobbing. \"Turn r-right at the n-next right. Use the k-key in the slot at h-head height to g-get into the corridor. There m-may be guards there. But...if - if you don\u0027t have a key to the individual cell you want - I\u0027m sorry, but - \"\n \"I do! I have the cell key and I know what to do after that! Thank you, you\u0027ve been very kind and helpful.\"\n Elena let go of the vampire\u0027s hair.\n \"Sage! Damon! Bonnie! Look for a corridor, locked, going right. Then don\u0027t get swept away. Sage, hold Bonnie and have Saber bark like crazy. Bonnie, hold on to Meredith in front of the guys. The corridor leads to Stefan!\"\n Elena never knew how much any one of her allies heard of this message, sent by voice and telepathy. But ahead she heard a sound that to her was like choirs of angels singing.\n Saber was barking madly.\n Elena would never have been able to stop by herself. She was in a raging river of people and the raging river was taking her right around the barrier made by four people, a falcon, and a mad-seeming dog.\n But eight hands reached out to her as she was swept by - and a snarling, snapping muzzle leaped ahead of her to divide the crowd. Somehow she was being run into, bruised, cradled, shoved, and, grasped and grasping, forced all the way to the right wall.\n But Sage was looking at that same wall in despair. \"Madame, he tricked you! There is no keyhole here!\"\n Elena\u0027s throat went raw. She prepared to shout, \"Saber, heel,\" and go after the vampire.\n But then, just below her, Bonnie\u0027s voice said, \"Of course there is. It\u0027s shaped like a circle.\"\n And Elena remembered.\n Smaller guards. Like imps or monkeys. Bonnie\u0027s size.\n \"Bonnie, take this! Shove it into the hole. Be careful! It\u0027s the only one we\u0027ve got.\"\n Sage immediately directed Saber to stand and snarl just ahead of Bonnie in the tunnel, to keep the stream of panicked demons and vampires from jostling her.\n Carefully, solemnly, Bonnie took the large key, examined it, cocked her head, turned it in her hands - and placed it in the wall.\n \"Nothing\u0027s happening!\"\n \"Try turning or pushing - \"\n Click.\n The door slid open.\n Elena and her group more or less fell into the corridor, while Saber stood between them and the herd pounding by, barking and snapping and leaping.\n Elena, lying on the ground, legs entwined with who-knew-who-else\u0027s, cupped a hand around her ring.\n The fox eyes shone straight ahead and a bit to the right.\n They were shining into a cell ahead. \n","sourceLink":"https://allnovel.net/the-return-shadow-souls-the-vampire-diaries-2/page-40.html","bookId":2036,"book":{"id":2036,"title":"The Return: Shadow Souls (The Vampire Diaries #2)","description":"Storyline: \n Shadow Souls (The Vampire Diaries: The Return, #2) \n Elena Gilbert\u0027s love, the vampire Stefan Salvatore, has been captured and imprisoned by demonic spirits who are wreaking havoc in Fell\u0027s Church. While her friends Bonnie and Meredith explore the evil that has taken over their town, Elena goes in search of Stefan. In order to find him, she entrusts her life to Stefan\u0027s brother, Damon Salvatore, the handsome but deadly vampire who wants Elena, body and soul. Along with her childhood friend Matt, they set out for the slums of the Dark Dimension, where Stefan is being held captive. It is rumored to be a world where vampires and demons roam free, but humans must live enslaved to their supernatural masters...\n \n","cover":"https://allnovel.net/images/the-return-shadow-souls-the-vampire-diaries-2.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-return-shadow-souls-the-vampire-diaries-2.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:28:15 PM"}}
