{"id":30866,"no":25,"title":"Chapter 26","content":"In the brief interval allotted him, Pic rested and prepared himself for the impending struggle. He had one thing to encourage him; his position was admirably chosen. His assailants must meet him face to face and climb up to him. None could strike him from behind. He took his place at the edge of the rock-platform and hurled defiance at those who were advancing to destroy him. To the men of Castillo, the powerful figure and distorted features appeared as those of some unearthly being. The thought that his new-found cup of happiness might soon be snatched from his lips, had nigh driven Pic to frenzy. He was in truth a lion-man at bay, defending his cub. Hiss! something whistled past. One of the on-rushing horde reeled and fell. Pic turned and saw the boy standing toe to the ledge-coping beside him. Already the sling was reloaded and whirling for a second cast. Hiss, again! Another man dropped back, holding his arm and screaming like a hurt beast. The stones flew fast, with few misses, for there was little need of accurate shooting at such a mass of men. Almost every shot left an enemy accounted for. The cave-men wavered as they witnessed the havoc wrought among them by the deadly sling. They might have fled, but Totan was there to drive on the laggards and strike down any man who attempted to run away. Kutnar strove to single him out, but one man was hard to distinguish in the ruck and the hetman escaped unscathed. [203] “Hiss! Something Whistled Past” [204] To Pic, his son’s prowess was a revelation. Never was known such stone-throwing. “It is one thing to hit a rabbit and another to hit a man coming at you with a club,” he thought. “The boy is a prodigy; may he live through this day.” The men of Castillo were now closing in. Pic’s powerful arm reached out and swept the lad behind him, for the time was near at hand for closer work with the flint-ax. “Well done,” he muttered. “My turn now. Stand well back and give me plenty of arm room to fight these wolves. Be ready with your ax, for if I break or lose mine, I will need another.” Kutnar fell back obediently. His jaws were clenched tightly together and the grip on his ax-handle was even tighter as he awaited his chance to help when most needed. From his rock-roost, Gonch was an awed witness of the boy’s deadly marksmanship. The sling suddenly ceased its work, for now the cave-men were coming to grips with those hidden from his sight. He saw Totan detach himself from the man-pack and fall back, permitting the yelling horde to sweep past him. To the hetman’s credit be it said that he who feared no man, now disdained[205] casting the balance of his great strength into such a one-sided contest. He stood with arms folded, watching and shouting commands, but offering to take no more active part where he considered himself so little needed. Gonch observed Totan’s inaction. The time had come when he might rid himself of his two worst enemies at one fell stroke. He leaned far out from the rock-wall and howled furiously: “He has come as I promised. Up and strike before another wins the glory. It is Pic, the Lion Man himself.” The giant hetman bristled as he heard. The blood of the pit-fighter surged through his veins like molten steel. In an instant his calm was transformed into a tempest. “The Lion Man?” he roared, tearing through the crowd to the foot of the ledge. “And so he has come to me at last. He is mine, I say, and my hand alone shall do the butchering. Stand back, every one of you. The man who raises a club to strike him, dies.” The cave-men stopped short, falling over one another in their anxiety to keep out of the hetman’s way. Totan turned from them to him who stood upon the ledge. Pic had seen and heard all. He shook his ax-blade defiantly in the other’s face. “Butcher me?” he screamed. “You; ugly beast? Come and try, here where there is room for both of us.” Totan answered with a thunderous roar. He clambered up the ledge. Pic fell back several paces,[206] permitting his rival a foothold upon the rock-platform. This gave the hetman a moment to prepare himself—a bit of chivalry he failed to appreciate. Men who gave ground or hesitated were afraid of him—that was all. “Ar-r-r death!” he snarled like a mad tiger and flung himself upon the Mousterian champion. “Death, so be it,” and Pic sprang forward to meet him. So fierce was the onslaught that the two giants came breast to breast before either had a chance to strike. Quick as a cat, Pic dropped his ax and grappled with his burly opponent, throwing both arms about him, bear-fashion. Finding himself at a disadvantage, Totan too let fall his weapon, roaring with rage and pain and fighting like a demon to break the other’s crushing grip. But Pic had the under hold. With arms clamped around his rival’s midriff, and face beneath the hetman’s chin beyond the reach of tearing fingers and snapping bull-teeth, he held him as in an iron vise, from which there was no escape. The Mousterian made not a sound. He did not seem to even move, but slowly the Castillan giant’s head with nose and mouth gushing blood, fell back. A dull crunch, and before the cave-men realized what had happened, their chieftain was borne to the edge of the rock-platform and cast down among them, a bloody, lifeless thing. In a flash, Pic recovered his ax and was again upon the defensive. The rabble recoiled in terror from the fierce Lion Man. Gonch gazed down into the face of the dead Totan. “Good,” he croaked. “Now for the other,” and from his safe perch he gave frantic commands for his minions to renew the attack. “Kill the man!” he screeched. “Capture the boy alive. He is our last chance for flints and food. At them, wolves. A whole tribe will come down upon you if they escape.” [207] The Battle of the Giants [208] Thus urged, the cave-men rallied and rushed again to the assault. The giant Mousterian’s ax cut them down like straws, but the living climbed over the dead and carried the ledge by sheer weight of numbers. Pic was forced back against the wall, still fighting furiously, although bleeding from a dozen wounds. His ax was shattered, but the boy was ready with another. Pic seized and wielded it with deadly effect until it too was gone. Then grappling with the man nearest him, he fastened his teeth in his throat. The mob surged over him. Kutnar struggled desperately, but was soon overpowered. At that moment, a loud snorting and thumping of heavy feet sounded from below, followed by squeals of rage, and two monstrous beasts came charging up the slope. “The Mammoth! the Woolly Rhinoceros!” yelled the cave-men nearest them and away they scampered, howling with fear. The alarm spread like wildfire to their companions upon the ledge and they too scattered in all directions, the rearmost barely escaping with their lives. Even Gonch shared their panic, for he made all[209] haste to climb higher, forgetting that he was quite safe and that no beast could reach him. Hairi and Wulli halted at the foot of the ledge and looked about them. The Castillans had fled and in all of that gore and slaughter, only one semblance of life remained. Kutnar the boy was kneeling over a prostrate form and wiping the blood from its face. The form was that of the Mousterian weapon maker, lying where it had fallen. The Castillan jackals had borne down Pic the Lion by their overwhelming numbers, but were now in their turn fleeing in disorder along the mountain side. It had devolved upon the Mammoth and Rhinoceros to rush to their friends’ assistance and strike the decisive blow, thereby terminating this most desperate of unequal conflicts—the bloody battle of the Scarp.","sourceLink":"http://novel.tingroom.com/duanpian/3076/84974.html","bookId":978,"book":{"id":978,"title":"Kutnar, Son of Pic","description":"简介： Totan, hetman of the northern Spanish cave-folk, sat upon the threshold of Castillo, watching a party of men coming toward him up the mountainside. His people, to the number of eighty or more, were behind him gathered about a roaring fire. All were c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3076","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
