{"id":63202,"no":32,"title":"Page 32","content":"She pulls herself shakily to her feet, using the walls on either side for support. She is steadying herself to face whoever walks through the door. The fear in her eyes tells me only bad things happen when the door opens. I remain invisible long enough to drag the unconscious soldier from the hall inside the room. Leaving him just invites others to investigate, and I don’t need any company. I shove him into a corner, hoping that he’s out of sight if there are cameras in here. I close the door.\\n\\n ‘Sarah?’ I say quietly.\\n\\n She spins around, looking towards my voice but visibly confused. ‘Who is that? Where are you?’\\n\\n ‘It’s Six,’ I whisper. She gasps quietly.\\n\\n ‘Number Six? Where are you? Where’s John?’ she asks, her voice shaking.\\n\\n I’m still speaking softly, not sure if we’re alone. ‘I’m invisible. Just sit back down like you were and pretend I’m not here. Put your head down so we can talk. I’m betting they have you on camera.’\\n\\n Sarah’s sinks back down into the corner, pulling her knees to her chest. She lowers her head, her hair falling forward and blocking her face entirely. I walk over and sit down next to her on the floor.\\n\\n ‘Where’s John?’ she whispers.\\n\\n ‘ Where’s John?’ I can’t keep the anger out of my voice. ‘Right now, you can forget about John, Sarah. You should know where John is; after all, you set him up, right? Because of you, he went to jail. And then, I got him out. What I want to know is, what are you doing here?’\\n\\n ‘They brought me here,’ her voice trembling.\\n\\n ‘Who brought you here?’\\n\\n Sarah’s shoulders shake as she cries softly into her knees. ‘The FBI . They keep asking me where John is and I keep telling them I don’t know. You need to tell me where he is. I have to tell them or they’re going to kill everyone I know!’ She sounds desperate.\\n\\n I can’t say I’m very sympathetic. ‘That’s what happens when you switch sides, Sarah. You knew how John felt about you; you knew he trusted you. And you used that to help these people. And now, they’re using you. Now, quickly, tell me what you told them about John!’\\n\\n ‘I don’t know what you’re talking about,’ Sarah says, and she starts to sob even harder. I can’t help it; it kind of breaks my heart seeing her like this. What have they done to her? Her long hair covers her face and arms and she looks so small and young. I feel my anger melt away and I rest my hand on her back.\\n\\n ‘I’m sorry,’ I whisper.\\n\\n She catches her breath at my touch and turns her head to look in the direction of my voice. I can just make out her blue eyes; they’re red and bloodshot. To give her the strength to do what we need to I make myself visible for a split second, show her the Mog cannon in my hands, and disappear again. I see a tiny smile cross Sarah’s face before she turns her face back to her knees. She sighs, takes a deep breath and in a much firmer voice says, ‘It’s good to see you. Do you know where we are?’\\n\\n ‘I think we’re in New Mexico in an underground base. How long have you been here?’\\n\\n ‘I have no idea,’ she says, wiping away a tear that has fallen on her leg.\\n\\n I stand up and go over to listen at the door. I don’t hear anything. I know I’m wasting precious minutes, but I have to ask. ‘I don’t get it, Sarah. Why did you turn John in? He’s in love with you. I thought you cared about him.’\\n\\n She flinches as if I’ve slapped her. Her voice is wobbly, but she looks me right in the eye when she responds. ‘Really, I have no idea what you’re talking about, Six.’\\n\\n I have to close my eyes and breathe a few times to keep my voice from rising, to keep my anger from returning. ‘I’m talking about the night he came over to profess his undying love for you. Remember? Your phone buzzed at two a.m., and the police arrived a minute later? That’s what I’m talking about. You broke John’s heart when you turned him in.’ She starts to raise her head to respond, but I make a noise to remind her to keep her head down.\\n\\n She resettles her head on her knees and speaks in a flat voice. ‘That’s not what I was trying to do. I didn’t have a choice. Please. Where is John? I need to talk to him.’\\n\\n ‘I’d like to talk to him too. I’d like to talk to all of them! First, though, we have to figure out a way out of here.’ My voice is urgent.\\n\\n She sounds defeated when she speaks again. ‘There is no way out of here. Not unless you want to fight a thousand Mogadorians.’\\n\\n ‘What?’ I circle back to her. What is she talking about? This is a U.S. government facility, not a Mog base. ‘You’ve seen them? The Mogs? They’re here?’\\n\\n A glazed look washes over Sarah’s face. She no longer looks like the girl I met in Paradise, the human girl who John fell in love with and was willing to do anything for. I don’t even want to think about what the FBI and the Mogs have done to her. ‘Yes. I see them every day.’\\n\\n I feel as if the wind has been knocked out of me. It was one thing to suspect this was the case – another to have it confirmed. ‘Well, I’m here now,’ I announce, trying to make one of us feel more confident. ‘I promise, the next Mog you see will have my foot up his ass.’\\n\\n Sarah laughs quietly into her legs. Her shoulders relax a bit for the first time since I walked in. ‘Sounds good to me. Six, please, can you tell me where John is. Is he okay? Will I be able to see him?’\\n\\n I know she’s worried about Four, but her constant questions about him are beginning to really annoy me. ‘To be perfectly honest, I haven’t seen him recently, Sarah. We split up. He went with Sam and Bernie Kosar to get his Chest back, and I went to Spain to find another one of us. We were supposed to meet up in three days, but I don’t see that happening right now.’\\n\\n ‘Where? Where are you supposed to meet? I need to know. It’s killing me, not knowing where he is.’\\n\\n ‘Right now, it doesn’t matter where we were supposed to meet because I won’t be there,’ I explode. ‘We need to focus on how we’re going to get out of here.’\\n\\n Sarah flinches at the anger in my voice. She tries again. ‘Where are the others? Where’s Number Five?’ Sarah asks.\\n\\n I ignore her – she is clearly not listening to me. I walk back to the door and put my ear to it again. I hear footsteps – definitely more than one person – coming down the hallway. I consider my options. I can either lure them into the cell or I can take them down where they are. Either way, I know I need to deal with them, turn Sarah invisible, and pick a direction for us to get out of here.\\n\\n Sarah stands up. ‘What about Numbers Seven, Eight and Nine? Where are they? Are they together?’\\n\\n If she doesn’t quiet down, she’s going to get us captured, or worse. I hiss at her, ‘Sarah! Enough! Stop!’ I put my ear against the door again and instantly know something is wrong. It sounds like the hallway is packed with men. We’re trapped. I spin around to tell Sarah, but she looks like she’s in the middle of a seizure. I am frozen seeing her body convulse and flop around the floor of the cell.\\n\\n ‘Sarah!’ I let myself become visible and run over to try and keep her head from slamming down on the cement floor. Has she been drugged?\\n\\n Sarah’s body starts to shake so fast she becomes a blur. I can only watch helplessly as a white outline appears around her body. I reach out to touch it but before my fingers reach it, the line turns black. I focus on Sarah with my mind to try and stop her convulsions with my telekinesis, but as soon as I try my brain feels like it’s burning, like an enormous amount of dark energy is invading my skull. The next thing I know, I am falling backwards, holding my throbbing head, my eyes squeezed shut. When I open them again, I can’t believe what I’m seeing. Sarah Hart is growing taller, and darker, until she’s at least seven feet tall. Her blond hair shortens until it’s a short black buzz cut. Her face morphs into a demonic monster’s. A purple scar appears on one side of her now thick neck; then it slowly elongates until it reaches the throat. When the scar finally stops growing, it begins to glow.\\n\\n Did I just watch Sarah turn into Setrákus Ra? I’ve never seen him, but I’ve heard enough to have a pretty good idea of what, or who, I’m looking at.\\n\\n The door bursts open and I am momentarily blinded by a flash of blue light. The next thing I know, a dozen Mog soldiers rush in, cannons up and ready.\\n\\n I try to turn myself invisible, but nothing happens. I don’t have time to figure out why. I grab the cannon I had set down to help Sarah, jump up, and fire it at one of the Mogs. He falls to my feet in a cloud of ash. I keep shooting, killing two more, but as I turn to find my next victim, I’m yanked backwards and choked by my pendant. I can turn my head enough to see I’m being held by the beast who was once Sarah. He spins me around, swats the cannon out of my hands with his other massive paw and yanks me towards his face. Up this close, I can see his dark skin is a sea of small scars, like he’s been raked by razor blades.\\n\\n I focus my mind on lifting my weapon off the ground but it just sits there. None of my Legacies are working! Without my Legacies, I’m vulnerable. I’m worse than vulnerable. I’ve got nothing to fight with. But I am not giving up.\\n\\n ‘Tell me where they are!’ Setrákus Ra roars. He pulls my chain tighter around my throat. I watch his purple scar brighten as he asks, ‘Where are they, Number Six?’\\n\\n ‘It’s too late,’ I whisper as bravely as I can. ‘We’re too strong now and we’re coming for you. Lorien will live again and we will stop you.’\\n\\n The slap is so hard that I can’t feel the side of my face and my ears are ringing. I force myself to keep staring at him. He curls his cracked lips to reveal two rows of sharp, crooked teeth. He’s so close that my vision is slightly blurred, so I look for something I can concentrate on. I pick a tooth that’s broken in half and leaking a thick black liquid. I’m not sure why, but this has the strange effect of making him less scary. It’s just so gross.\\n\\n ‘Tell me where you’re supposed to meet Number Four in three days.’\\n\\n ‘On the moon,’ I say.\\n\\n ‘You will die in front of them. I will kill you myself.’\\n\\n I don’t respond. I don’t acknowledge he’s even spoken as he tightens his grip. The pendant John and I found in the well in Ohio, the one that was on the massive skeleton, cuts into the back of my neck as it is pulled tighter and tighter. As he pulls the chain even more, I think of John’s face as we trained together, I see the Garde sitting around the white table on the ship and I smile. I’m proud to have been chosen by the Elders. Out of respect to them, I will not beg for my life.\\n\\n ‘So, there you are, Number Six.’ I know the voice immediately. Agent Purdy. I open my eyes to see an old man. He has a cast on one arm and his face is covered in bruises. When he walks towards me, I see he’s limping.\\n\\n When he gets close enough, I spit at his leather shoes. Setrákus Ra laughs right into my ear. \\n\\n","sourceLink":"https://allnovel.net/the-rise-of-nine-lorien-legacies-3/page-32.html","bookId":1677,"book":{"id":1677,"title":"The Rise of Nine (Lorien Legacies #3)","description":"Storyline: The Rise of Nine (Lorien Legacies #3) \\n In Pittacus Lore’s The Rise of Nine, third in the New York Times bestselling I Am Number Four series, the stakes are higher than ever as John, Six, and Seven try desperately to find the rest of the Garde before it’s too late. \\n The Mogadorians who destroyed the planet Lorien continue to hunt down the Garde, the small group of Loric survivors who have taken refuge on Earth. The Garde must come together. They are Lorien and Earth’s only hope. \\n During the dangerous mission at the Mogadorian base in West Virginia, John found and rescued Nine. But even with their combined powers, special abilities known as Legacies, the pair barely escaped with their lives—and they lost Sam in the process. \\n In order to save our world and their own, John and Nine must join forces with Six and Seven who have been battling the Mogadorians in Spain, and who are now trying to locate Number Eight in India. \\n Power in numbers will save us all.\\n","cover":"https://allnovel.net/images/the-rise-of-nine-lorien-legacies-3.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-rise-of-nine-lorien-legacies-3.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:49:55 AM"}}
