{"id":63206,"no":36,"title":"Page 36","content":"‘Ella?’ I call out.\n ‘I’m right here, Marina,’ she calls over. ‘Look where we are! New Mexico!’\n ‘Finally. Can you try communicating with Six again?’\n ‘I already have. No luck yet.’\n I slowly stand up. Eight is on his hands and knees at the bottom of the sand dune, dry heaving. The teleporting seems to have affected him more severely than it did the last couple of times. Ella has her hand on the back of his neck. The two Chests sit nearby. I rotate 360 degrees and all I see in every direction is sand, sand and more sand. And the occasional cactus. ‘Which way should we go?’\n Ella and Eight climb up the dune and stand next to me. After a minute, Ella points north and says, ‘Look! Six said something earlier about dying in a desert with mountains.’\n Squinting, I see where she’s pointing. The faint outlines of mountains ripple in the afternoon haze.\n ‘That’s where we’re going, then,’ Eight says. ‘We can cover the distance in short hops once my teleporting comes back. For now, we walk.’\n We pick up the Chests and head north. ‘Ella,’ I say, ‘you need to keep trying Six. If you can’t reach her, maybe you can try Four, or even try one of the others, Five or Nine.’ We’ve lost so much time just getting here. Maybe Ella can find something out that will save us some time now.\n Nine examines the map he’s brought up on the screen in the middle of the steering wheel. He looks around at the endless desert surrounding us. The car’s GPS has picked up an underground tunnel nearby; now we just need to find the entrance. When I press the green triangle on the tablet, it shows we’re only a mile or two from the ship. I push the blue circle and shout, ‘Nine! They’re here!’\n ‘Who’s here?’ Nine asks, scanning the horizon. ‘The other three blue dots. They’re here in New Mexico!’ Nine rips the tablet out of my hands and lets out a loud hoot. ‘Holy shit, bro. This is really all about to go down.’ He looks at me, his eyes shining.\n ‘I think this is it. The beginning of the end.’ As much as I’m looking forward to finally getting a chance to do what we need to do, it’s dawning on me that this is going to be the fight of our lives.\n ‘This right here, this is when we rise to the occasion,’ Nine says. ‘You will fight harder than you ever have, Four. You’re going to be a beast. And me? I’m going to rip Setrákus Ra’s head off, wrap it up and send it back to Mogadore with a giant red bow on it. And then Lorien is going to rise from the ashes.’ His voice is shaking with emotion, with all the pent-up anger and fight he has been carrying around with him.\n Bernie Kosar barks from the backseat and Nine turns around to look at him with a smile. ‘You, too, BK . You, my friend, are going to kick some major ass.’\n I imagine what it will feel like to meet up with all the Garde members, something I haven’t let myself do for so long. I look out over the horizon. My mind is clear and open to all possibilities. It feels good. And that’s when I hear a girl’s faint voice echo in my head. It’s soft and broken like a bad radio signal at first, but it becomes clearer.\n Four? Number Four? Can you hear me?\n ‘Yes, yes! I can hear you!’ I yell out loud, whipping my head back and forth. ‘Who is that? Where are you?’\n Nine looks at me, confused. ‘Um, dude. I hope you can hear me. I’m right here.’\n ‘Not you. I heard a girl. Did you hear her? A girl was just talking to me.’\n Number Four? It’s Number Ten. Can you hear me? This may be hopeless, I don’t know if I’m talking to anyone. Maybe I’ll never figure this out without Crayton.\n ‘There it is again,’ I say excitedly. Nine is looking at me like I’ve completely lost my mind. ‘Nine! She just said something else! Did you hear her? She said she’s Number Ten! I think she’s in my head somehow.’\n ‘Number Ten! The baby from the second ship! Well, don’t just sit there staring at me! Talk back to her, dumbass!’\n That’s easy for him to say. She didn’t know if it was working. I’m guessing it’s a new Legacy kicking in – for both of us! – it takes training to know how to make a Legacy work when, and how, you want it to. I know I don’t have much time to waste figuring it out. I take a deep breath and block out the noise in my head and around me, and focus. I try to re-create the feeling I had right before I heard the voice a few minutes before. I feel calm, open, and somehow . . . connected.\n I can hear you, I try saying in my head. Nothing. I wait a moment and try again. Number Ten?\n Number Four! You can hear me?\n ‘She heard me!’ I laugh out loud and look at Nine, victorious.\n ‘Tell her we’re about to ride into town and save the day,’ Nine says. ‘Tell her we’ll swing by and pick her up on our way to Lorien, wherever she is.’\n Where are you? I hear her ask. I’m with Seven and Eight in the desert, in New Mexico. We’re trying to find and rescue Number Six.\n ‘What’s she saying?’ Nine yells. I know it’s making him crazy not being able to hear our conversation, but I can’t talk to him now. I need to concentrate on hearing Ten’s voice, on responding to her.\n What do you mean? Where is Six? We’re in New Mexico too. I’m with Nine and we’re in the desert looking for an underground base.\n I look out at the mountains. ‘We have to find that tunnel, fast,’ I say to Nine.\n ‘Did she say where they are?’\n ‘She just said she’s here, in the desert, with Seven and Eight and they’re trying to rescue Six. That must be who we saw show up on the map earlier. I know I shouldn’t worry – if anyone can take care of herself, it’s Six. But still – I’m worried.’\n ‘She’s got to be inside Dulce. Let’s go find her.’ Nine’s fingers speed over the screen. The map changes color and looks to be scanning the area, finally zooming in on the trunk of a five-pronged cactus about a quarter mile away from where we are. Below it, I can see the outline of an underground tunnel. ‘Ha! Nice try, you sneaky government bastards. Tell Number Ten to get her butt over here!’\n Can you tell me where you are, Ten? We found a tunnel to get inside the base where we think Six is being held. We’re in a brown car, pulling off on a side road.\n After a pause, she says, We can teleport to you. How do I find you?\n ‘They don’t know how to find us,’ I report to Nine.\n ‘Maybe we can send up a signal somehow? Damn it! We should have brought that rocket launcher!’ He hits the steering wheel with the palm of his hand and stares out the window, shaking his head.\n ‘We don’t need a rocket launcher,’ I realize, jumping out of the car. I aim my palms into the blue sky and light my Lumen, swaying the beams back and forth.\n Look for the beams of light in the sky, I instruct Ten. I don’t hear anything for a minute. I hope we haven’t lost our connection.\n We see them! Ten finally says.\n ‘They’re on their way,’ I yell into the car, keeping my Lumen in the air. I want to give them as much time as possible to see exactly where we are. ‘We just need to sit tight.’\n ‘I’ll try,’ Nine says, studying the screen on the steering wheel again, but already starting to twitch. ‘Man, I can’t believe we found them!’\n I finally turn off my Lumen and climb back in the car. I almost can’t believe this moment has come, that we’re about to fulfill the destiny the Elders laid out for us. We’re coming together to defeat the Mogadorians and resurrect Lorien from its hibernation.\n Suddenly, we hear the unmistakable noise of a helicopter.\n ‘Um, Johnny?’ Nine says. ‘They’re not getting here by helicopter by any chance, are they?’\n ‘Shit,’ I say. Bernie Kosar jumps into my lap, putting his front paws on the door to look out the window. The three of us watch several helicopters climb into the sky from the hazy horizon. The cluster of choppers moves together and stops to hover directly above us. I use my mind to focus on the one out front and send it spiraling off back where it came from. Then I bring it down, hard enough that it won’t go up again anytime soon.\n ‘It must be the Feds. They’re getting on my nerves almost as much as the Mogadorians. They must have been looking for us and saw your lights!’ Nine yells. The gun turret in the hood of the car pops up. Nine aims, then shoots warning shots to the right of the remaining choppers, then the left. As soon as he stops shooting they lower down, hovering just above us. I’m about to get rid of another one with my telekinesis when Nine lets out a yelp.\n ‘Check out the road,’ he says. I look to my left and see an enormous dust cloud rising from a long line of black vehicles. Bernie Kosar barks and scratches at the door. I open it and he changes into an enormous hawk and ascends into the sky. I run around to the trunk of our car and open it with a pound of my fist. I unzip one of the duffels and pull out four automatic rifles, dropping two next to Nine’s door. Gunshots are already firing from the faraway vehicles, and I scramble on top of the car and take aim while Nine continues to unleash a barrage at the incoming helicopters. Out of the corner of my eye, I see Bernie Kosar swoop into the side of a helicopter. He’s got one of the pilots with his talons. He yanks and pulls at him, using his powerful beak to rip out the safety belt holding him in the seat. When the pilot is free BK drops him onto the sand below. His helicopter falls and bursts into flames on impact. The caravan of black cars swerves around the wreckage and I hold down the triggers of my two guns, taking out the front tires of the first two cars. It doesn’t stop the convoy, but at least it slows them down.\n The remaining helicopters spread apart in the sky and come at us from different angles. Pockets of sand explode all around us. One helicopter flies directly overhead, and I roll out of the way of its line of fire.\n I struggle to clear my mind. It isn’t easy, but I’m getting the hang of what it takes for me to go inside my head to communicate. I take a few deep breaths and quiet my mind. Number Ten? Where are you? We’re under attack.\n We can hear it, she says. We’re coming. Her thoughts are calm, with an edge of worry. It feels good just to hear it, though, to know others are on their way.\n I shift around and see two black helicopters bank left and head in the opposite direction, firing missile after missile at a new target. That has to be them! I can only redirect three of the rockets, but someone else deflects the rest.\n ‘Ten and the rest are almost here!’ I yell down to Nine through the driver’s window. Next thing I know the gun turret on the front hood has exploded, sending hot metal flying over my head. I roll off the roof of the car just as it’s split in half by a new hail of bullets.\n Nine jumps out of the car and grabs the two rifles I set in the sand by his door. ‘Looks like we’ve got a real fight on our hands. I’ve been waiting for this my whole life.’\n The helicopters circle back and line up over the faraway vehicles, forming a united front. Nine lifts his palm and the lead black truck is suddenly ripped straight up in the air like a shuttle rocketing into outer space. Nine flips his hand and the car falls back down again. We can hear the men screaming from where we are. The car comes to a stop right before it hits the ground, then smashes down hard. We watch the men scramble out on shaky legs and look for somewhere to run. At the sound of the impact, Bernie Kosar, still in the form of a hawk, dives and lands behind the twisted car on the road, and transforms into a beast. The trailing vehicles swerve into the desert to avoid him, some spinning completely around. Bernie Kosar roars. \n","sourceLink":"https://allnovel.net/the-rise-of-nine-lorien-legacies-3/page-36.html","bookId":1677,"book":{"id":1677,"title":"The Rise of Nine (Lorien Legacies #3)","description":"Storyline: \n The Rise of Nine (Lorien Legacies #3) \n In Pittacus Lore’s The Rise of Nine, third in the New York Times bestselling I Am Number Four series, the stakes are higher than ever as John, Six, and Seven try desperately to find the rest of the Garde before it’s too late. \n The Mogadorians who destroyed the planet Lorien continue to hunt down the Garde, the small group of Loric survivors who have taken refuge on Earth. The Garde must come together. They are Lorien and Earth’s only hope. \n During the dangerous mission at the Mogadorian base in West Virginia, John found and rescued Nine. But even with their combined powers, special abilities known as Legacies, the pair barely escaped with their lives—and they lost Sam in the process. \n In order to save our world and their own, John and Nine must join forces with Six and Seven who have been battling the Mogadorians in Spain, and who are now trying to locate Number Eight in India. \n Power in numbers will save us all.\n \n","cover":"https://allnovel.net/images/the-rise-of-nine-lorien-legacies-3.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-rise-of-nine-lorien-legacies-3.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:49:55 AM"}}
