{"id":99999,"no":10,"title":"Page 10","content":"It takes a while to settle down. \"Thanks,\" I say when I\u0027ve stopped chuckling. \"You saved my life.\"\\n\\n \"That\u0027s my job,\" Art says wryly.\\n\\n \"I thought I was done for. There were so many of them...\" I frown. \"That wasn\u0027t the demon universe, was it?\"\\n\\n \"No,\" Art says. \"I told you we would not be crossing to their realm.\"\\n\\n \"Then what were the Sligstata doing there?\"\\n\\n \"That world was demon-free a few months ago,\" Art says. \"They must have broken through recently. I wouldn\u0027t have come this way if I\u0027d known.\"\\n\\n \"Even so, how could so many...\" I stop as the answer pops into my head. \"They opened a tunnel between their universe and that world.\"\\n\\n \"Yes,\" Art says.\\n\\n \"The sky demon,\" I say slowly. \"Did you see it?\"\\n\\n \"Yes. There were more, a convoy of them in the sky.\"\\n\\n \"Where were they going?\"\\n\\n \"Other worlds.\" Art sighs. \"There were stones of magic hanging beneath it. You call them lodestones. We set such markers in place on all the worlds we visit. They help us hold the Demonata at bay and give the inhabitants of the planets a chance to evolve.\\n\\n \"The defensive power of the stones fades when we move on. As the safety net crumbles, demons seek to open windows and tunnels. If they succeed, they wipe the world clean. Then, in most cases, they return to their own universe. But sometimes on a world where lodestones are plentiful, they use it as a base to launch more attacks.\\n\\n \"The sky demon and its passengers are heading for neighboring worlds, using the stolen, corrupted magic of the lodestones to sustain them. It will take millennia, but they are patient. The power will drain from the stones eventually and they\u0027ll have to return home, but that might not be for millions of years.\"\\n\\n \"And as long as the stones hold, they can stay in this universe?\" I ask, feeling sick.\\n\\n \"Yes.\"\\n\\n \"How far is that sky demon from Earth?\"\\n\\n \"Billions of miles. It will never trouble your people.\"\\n\\n \"But if it was setting off from a nearer world, like Atlantis, it could descend on us one day, carrying hordes of demons?\"\\n\\n \"Yes,\" Art says.\\n\\n \"Is our universe full of sky demons, slowly making their way from one world to the next?\"\\n\\n \"Hardly full of,\" Art mutters. \"But there are many of them.\"\\n\\n \"Then we can\u0027t beat them,\" I croak. \"We thought if we stopped them crossing, we were safe. But if armies are already here, making their way towards us...\"\\n\\n \"All worlds will fall eventually,\" Art says glumly. \"All beings will die. That is the nature of the universe. Nothing is forever. Death claims all things in the end.\"\\n\\n \"Sure,\" I grunt bitterly. \"But I didn\u0027t know there were scores of demons cruising the skies, working hard to wipe us out.\"\\n\\n \"It is not an issue,\" Art says. \"Your world will have fallen long before any sky demon reaches it.\"\\n\\n My eyes narrow. \"What are you talking about?\"\\n\\n \"The lodestones are a temporary form of protection,\" he says. \"Demons always cross. The only hope any beings have is to master the skies. If a species learns to move on to other worlds, they can stay ahead of the Demonata. Your people haven\u0027t made that crucial step to the stars. Your planet will fall within the next year. It is inescapable.\"\\n\\n My jaw drops, then firmly closes. I breathe in and out through my nostrils, waiting until I\u0027m calm. When I\u0027m in control, I say very clearly, \"I want to go home.\"\\n\\n \"It would be pointless,\" Art says. \"You could do nothing to stop it.\"\\n\\n \"I have to try. Even if I fail, I want to be there at the end. If Earth\u0027s going to fall, I\u0027ll fall with it.\"\\n\\n \"No,\" Art says. \"You have a greater destiny.\"\\n\\n \"I don\u0027t care about-\" I begin to snarl.\\n\\n \"Life must continue,\" Art interrupts. \"We realized, billions of years ago, that this universe was doomed. The Demonata are stronger than those who populate our worlds. In time they\u0027ll conquer all. We devoted ourselves to denying them that victory. We vowed to find a way to ensure life continued.\"\\n\\n \"I thought you said all things perish.\"\\n\\n \"Ultimately,\" he replies. \"This universe is a living thing, and it will die of old age eventually. But we can make sure that the end comes in its own time, not at the hands of the Demonata. If you help us.\"\\n\\n I\u0027m silent a long time. I can\u0027t understand everything Art is talking about, but if he\u0027s right... if there\u0027s some way to thwart the plans of the Demonata...\\n\\n \"How much farther do we have to go?\" I ask.\\n\\n \"Not far,\" Art says. \"Another day, perhaps, and we will reach the Crux.\"\\n\\n \"And you\u0027ll tell me everything?\" I press. \"No more riddles or half-answers?\"\\n\\n \"Everything will be revealed,\" Art promises. \"After that you can stay or go as you please.\"\\n\\n \"Then I\u0027ll come,\" I sigh, and although my intentions are good, it feels like I\u0027ve just sold my soul to the devil-or worse. \\n\\n","sourceLink":"https://allnovel.net/dark-calling-the-demonata-9/page-10.html","bookId":2183,"book":{"id":2183,"title":"Dark Calling (The Demonata #9)","description":"Storyline: Dark Calling (The Demonata #9) \\n I know it\u0027s ridiculous. Lights can\u0027t whisper. But I swear I heard a voice calling to me. It sounded like static to begin with, but then it came into focus, a single word repeated over and over. Softly, slyly, seductively, insistently. \\n \"Come...\" \\n The Disciples are being manipulated by beings older than time. Only Kernel Fleck knows that something is wrong. But he is in the grip of a creature who cares nothing for the fate of humanity. Voices are calling to him from the darkness and he\u0027s powerless to resist. \\n Kernel has already been to hell and back. Now he\u0027s about to go further.\\n","cover":"https://allnovel.net/images/dark-calling-the-demonata-9.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/dark-calling-the-demonata-9.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:48:34 PM"}}
