{"id":72348,"no":18,"title":"Page 18","content":"“Why can’t you use yours?”\\n\\n “I’m going to have to use that, too… it’s going to take a lot of power—power that you don’t even know how to use yet.”\\n\\n My lips bow downward into a disappointed frown. “If I don’t know how to use it yet, then how the hell are you going to get into The Underworld?”\\n\\n “First off, we’re going to go there. It’s going to take both of us,” he explains. “And second, I’m going to train you.”\\n\\n I pull a disgusted face. “Are you being serious?”\\n\\n He places his hand to his heart.” My dear Gemma, I’m always serious.”\\n\\n “No, you’re a pervert who pretty much raped me back in the vision,” I ball my hands into my fist as shame and disgust nauseously resurface in my body, remembering how he put his hands and mouth on me without my permission. “And the only reason you’re still sitting here is because I need you to help me get into The Underworld, otherwise I would have told Alex to kick your ass.”\\n\\n He laughs and rolls his golden eyes. “Like he could.”\\n\\n I straighten back in the seat. “I think you know he could. That’s why you won’t try it again.”\\n\\n He doesn’t argue, but he doesn’t appear happy about it, either. “You know, I doubt you’d be so confident if you knew where he really was right now.” He shakes his head and I detect a slight flash of light under his skin as his body vibrates. I think he’s trying to change into the mirage, but luckily it’s not working. “Would it help if I looked like him? You could kiss me and pretend I was him.”\\n\\n I roll my eyes and slump back in the sofa. “If you’re trying to do the tricky mirage thing it’s not working.”\\n\\n He glances down at his arms, rotating his hands over. “What did you do,” he growls.\\n\\n I smirk at him, but deep down my heart and mind are entering a painful state, as if they miss the electricity—miss Alex. “Wouldn’t you like to know?”\\n\\n We exchange defiant grins as we stare each other down and he drops his hands to his lap.\\n\\n “You know that confidence is going to come in real handy when I train you. It’ll channel your inner energy,” he says.\\n\\n If only he knew just how much energy was inside me. It’s a good thing he doesn’t, though, because I have the feeling he’s the kind of person that would do anything to get his hands on it.\\n\\n I’m quickly learning that Nicholas has the attention span of a child. After our little argument, we sit down on the living room floor amongst the table and the sofa, as if we’re doing a séance. Our legs are crisscrossed as we face each other with an ordinary violet ribbon crystal ball between us. It’s the teaching ball, he told me. He said that once I’d been trained properly he’d bring out the Ira, that it was too powerful to train on\\n\\n He also told me that it would only be him and I going into The Underworld and that it wasn’t possible to bring anyone with us besides Foreseers because they’d need their own Seer energy. I asked if I could go alone and he said no. I honestly have no idea whether the words that come out of his mouth are true, but there’s no real way to find out.\\n\\n “Why do you need to go to The Underworld?” he asks as he rotates the crystal ball in his hand.\\n\\n I hesitate, not sure what to say. Lie. Probably not since he is going to end up finding out when he goes down to The Underworld with me. “To get my mom.”\\n\\n He glances up at me with inquisitiveness. “I met her once. She disappeared quite a few years ago, didn’t she?”\\n\\n “Fourteen years ago,” I say, my voice uneven.\\n\\n “And that’s where she ended up?” Nicholas sets the ball down on the tile floor and it wobbles a little, rolling back and forth.\\n\\n I nod and wait for him to ask how she got there, but he never does and I wonder if he already knows, if maybe he saw it through a vision.\\n\\n He spins the crystal ball on the floor. “So who’s your father?”\\n\\n Good question. “I’m not sure exactly.”\\n\\n He quizzically raises his eyebrows as he slams his palm down on the crystal ball, stilling it. “You’re not sure? How’s that possible?”\\n\\n “When your mother refuses to tell anyone before she gets trapped in The Underworld,” I reply dryly.\\n\\n “So, for all you know, your father could have been some almighty and great Foreseer.” He pauses and a mocking grin plays at his lips. “Your father could be Dyvinius.”\\n\\n I roll my eyes. “That’s disturbing. He’s like sixty.”\\n\\n Nicholas shrugs. “You never know. Some girls have a thing for older guys. Like you and Alex.”\\n\\n “He’s only a few years older than me.” I move my feet out of the way as the crystal rolls toward them. “And how can you touch that thing without being sucked into it.”\\n\\n He presses two fingers to his temple, his lips curving upward. “Mental talent.”\\n\\n I let out a slow breath, tired of playing games. “Can we just get on with this? The longer I’m up here, the longer my mother’s stuck down there.”\\n\\n He stares at me blankly, cupping the crystal in his hand. “I want you to ask nicely first.”\\n\\n I bite down on my tongue. “Pretty please.”\\n\\n He drops the crystal onto the floor so hard I’m surprised it doesn’t break. “So, until we can get you going into and out of visions that you’re intentionally trying to go into,” he starts in a bored tone as if he’s done this many times. “There’s really no point in us trying to travel into The Underworld… One false move and we could end up in the bottom of the lake, where we’d either drown or get taken to The Underworld by the Water Faeries which means we’d be prisoners there—we have to go in a specific way or we’re in trouble. Got it?”\\n\\n I nod. “So how does it work, exactly? We enter The Underworld through that ball. Then what?” I lean back on my hands. “How do we get the Queen to let my mom go? And how do we get her to let us go? Wouldn’t we just end up prisoners anyways?”\\n\\n He shakes his head. “The Queen can’t keep us there—it’s the law that comes with using the Ira.”\\n\\n “It sounds kind of difficult.”\\n\\n “It will be,” he says matter-of-factly. “It’ll take a lot of power and control to pull it off, and I have no idea how you’re going to get the Queen to let your mother go.”\\n\\n “Neither do I,” I mumble. “But I’ll find a way.”\\n\\n He stretches his legs out in front of him. “Sure you will.”\\n\\n “I will.” I stare down at the crystal ball only inches away from my feet. “So what do I do first?”\\n\\n “The first thing that’s going to happen is I’m going to go into a vision with you,” Nicholas explains, sitting up straight. He holds out his hand toward me as he carries the crystal ball in the other. “Give me your hand so we can go into one together,” he says. With reluctance, I take his hand, his skin clammy and cold against mine. “Good, now we need a simple vision to go into. I think it would probably be best if you just thought of a memory. Maybe something from your childhood.”\\n\\n That’s not simple at all. “Does it have to be from my childhood?”\\n\\n “As long as it’s simple, it doesn’t really matter,” he says.\\n\\n “Okay….” I search for something simple to picture, but all I can see are broken images and darkness.\\n\\n “Gemma, place your hand on the crystal ball,” he instructs, growing impatient. “And channel your energy.”\\n\\n A brief glimpse of my mother and me in a field flashes through my head and I reach out to touch the crystal ball in Nicholas’s hand, but I pause. “Wait, how do I channel my energy?”\\n\\n “The best way is to use your emotions, despite what Dyvinius says,” he tells me. “It’s quicker and easier, so whatever you’re feeling right now, channel it.”\\n\\n I’m a little surprised at his answer, and suddenly, I begin to wonder if the appearance of my Foreseer ability came from the fact that I’d started to experience so much emotion.\\n\\n I do what he says and channel what I’m feeling, which is a combination of irritation, fear, and longing. As soon as my skin brushes the glass, I’m yanked forward into a tunnel of light. Nicholas clutches my hand and we sink and spin while it feels like I’m being ripped apart. Finally, we reach the bottom and I immediately let go of Nicholas’s hand.\\n\\n I sigh in relief until I take in my surroundings. I’m not in my past, but I think in the future, standing on the main street of Vegas beside a massive pirate ship. The busy city is no longer busy, instead it’s dead quiet. A layer of glistening ice covers everything as if a million Death Walkers had marched through and breathed their Chill of Death on everything.\\n\\n Just like they would if the portal opened up.\\n\\n Chapter 12\\n\\n I stand in the empty streets as shock seeps into my bones. This can’t be right. It can’t be. Because, if it’s true, then the portal opens up. We don’t save the world or the star and everything ends.\\n\\n “Gemma.” Nicholas’s voice carries caution as if he can sense something’s up.\\n\\n I tear my eyes off the frozen streets and look over at him. “What?”\\n\\n “Are you okay?” he asks, stuffing his hands into his pockets, examining me intently. “You’ve been standing there staring at whatever it is you’re seeing for over five minutes.”\\n\\n I swallow hard. “I…um…” I don’t know what to say to him.\\n\\n “What is it?” Nicholas glances around, even though he can’t see anything. It’s a rule of seeing visions: only the seer can see what’s actually taking place.\\n\\n To Nicholas everything looks blank and I envy him in a way. I want to erase the image from my mind so I can have my hope back; hope that the world can be saved.\\n\\n The sky is gray and a frost-bitten wind gusts across streets, blowing snow all over the ground. The buildings still stand tall, though they’re glazed with ice and some structures are cracking from the pressure.\\n\\n “Gemma?” Nicholas says, waving his hand in front of my face. “What’s going on?”\\n\\n I shake my head and blink. “It’s nothing.”\\n\\n He raises his eyebrows at me. “If it’s nothing, then why do you look like you just saw someone die?”\\n\\n I’m about to answer when a loud shriek cuts the air. The sound echoes, vibrating the ice, and my body goes rigid as the fog creeps out from the buildings.\\n\\n “I think we should go,” I say, slipping backwards as I move away from the fog. “I think something really bad is about to happen.”\\n\\n Seconds later, a herd of Death Walkers emerge from behind and inside the buildings. Their black cloaks are pulled over their heads, their skin rotting and mapped with bits of muscle as well as veins. Their eyes are like fireflies and their breaths are made of death as they march toward me.\\n\\n Stay calm. Stay calm. “Can we just go back to the house? Please.”\\n\\n Nicholas watches me as I walk backwards, trembling, remembering what the monsters can do. “You know whatever’s out there can’t harm you, right?” he reminds me. \\n\\n","sourceLink":"https://allnovel.net/fractured-souls-shattered-promises-2/page-18.html","bookId":1977,"book":{"id":1977,"title":"Fractured Souls (Shattered Promises #2)","description":"Storyline: Fractured Souls (Shattered Promises #2) \\n Gemma thought she had said her good-byes and had felt every possible emotion she could before her soul was detached again. Deep down inside, she hoped she’d never wake up from it because, in her eyes, life without emotion and memories isn’t worth living. \\n But she does wake up and discovers she can still feel and remember everything she experienced over the last few months. Alex is also telling her that everything’s okay, that he didn’t betray her, and that what she thought happened really didn’t. \\n Gemma isn’t sure if she can trust Alex, so she tries to keep her distance from him, even though the electric connection and her desire make it nearly impossible. The only person she can trust is Laylen, but even that becomes complicated when the lines of their friendship begin to blur. \\n While Gemma struggles with her emotions and relationships, she searches for her mother, entering a dangerous world of secrets, seduction, and evil. The further she digs into her mother’s secrets and past, the more she wonders what waits for her at the end of her search and if maybe some things are better left in the dark.\\n","cover":"https://allnovel.net/images/fractured-souls-shattered-promises-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fractured-souls-shattered-promises-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:23:10 AM"}}
