{"id":72378,"no":39,"title":"Page 39","content":"“So there was another fallen star once?” I ask, glancing at Alex. He meets my eyes and the electricity ignites between us before we can even take our next breath. There’s so much power in it—in us—and it frightens me how much I hate it and like it at the same time. “ My mother yanks her attention off the moon and forces it back onto us. “No. The star’s energy you and Alex carry is the same one as the Keepers used those hundreds of years ago. After they sealed the portal, they hid it because no one knew how to destroy it… The star was also never supposed to be put in any Keepers.” She pauses, considering something. “That’s one of the things that I’ve never have been able to figure out. Why Stephan split the star and put its energy in you two.” She lets out a heavy sigh. “But what I do know, is that in order for Stephan to be able to open the portal, he needs his Vampire, his Witch, and his Faerie that also have Keeper blood in them, so he created them—created you two.” She looks from Aislin to Laylen. “Then he got his hands on the star, and for some reason he put it in you and Alex.” I feel like I’ve been run over by a truck, my guts splattered all over the pavement, my body mangled. I’d never realized how easy it was to bear the burden of carrying the star in me, but now Alex, Aislin, and Laylen are carrying their own burdens and I realize that things just got a hell of a lot more complicated. “So if he opens the portal, then what happens?” I ask, sounding strangled. “Malefiscus is freed, along with a shit load of Death Walkers and the whole damn world turns to ice?” My mother unenthusiastically nods. “He’ll be able to enter our world again. Every Death Walker will come out of hiding and even more will come out of the portal. He controls them because the mark binds them together in blood, which is the same reason why Stephan has control over them.” She pauses. “And every Witch, Faerie, and Vampire who are the descendants of his first followers will be under his control, so what you saw in the vision, Gemma—the world ending in ice—is probably at the very end of what’s going to happen to the world, after the massacre.” “Massacre,” I breathe and then shove the bloody images away from my head. “But there’s one thing I’m still confused on and that’s how does Stephan knows how to do all of this?” “Because he was told what to do by a Foreseer,” she says with a hint of anger in her tone. “Is my father that Foreseer?” I ask, shocking her and everyone else, although it’s not that ridiculous of a question. She mentioned him back in The Underworld and I could hear the loathing in her tone. My mother leaps from her chair and it topples to the ground. “No, it’s not your father!” she screams, crouching over and savagely moving toward me. “Shut your mouth this instant!” I hover back in the chair, realizing how temperamental she really is. “I’m sorry.” She glances at all of us and the rage in her eyes diminishes as she tips the chair back up and lowers down in it. “I’m so sorry, Gemma. I have no idea why I yelled at you like that.” She smoothes her hands over her hair, trying to comb it back into place, however the braid is slipping loose and strands of her brown hair are sticking up. “I’m so sorry.” “It’s fine,” I say numbly, shutting myself down by choice because I don’t want to feel the pain from knowing that the mother I have now is not the mother I had—she’ll probably never be the same. None of us will. There are things in life that happen that change who we are, things that are hard to come back from, and in the end we never really are the same. Aislin jumps to her feet. “I think I need to go lie down. This is a lot to take in.” She’s on the verge of crying as she hurries into the house before anyone can say anything. Laylen sighs and gets to his feet. “I’ll go check on her.” He follows after her, leaving the door open. A moment of silence passes between us and all I can hear are the waves and Aislin’s sobs from inside the house. My mother’s blue irises drift back and forth between Alex and me. “I really want to understand, why he separated the star and why he detached Gemma’s soul and raised you to be unemotional. I know what he told all the other Keepers, but I want to find out the real reason.” “Maybe it’s the opposite reason of when we thought he was protecting the world,” I suggest with a shrug. “Maybe he needs to preserve the power inside me… and Alex so it would be useful for the portal. Maybe if we… if we felt too much the star’s power would die.” “You might be right,” my mom says, her forehead creasing as she deliberates. “But we need to find out for sure.” She slumps back in her chair. “We need to find out a lot of things.” “Like why he created Aislin and Laylen,” I say, biting my lip as I gaze out at the waves. “Why not just find a Vampire and Witch who are also Keepers?” “Because their kind are not easy to find,” my mother answers. “I think it was also so he could keep an eye on them and make sure everything turned out the way that he wanted.” Unexpectedly, the electricity surges to a nearly unbearable temperature, putting more power in me than it ever has, to the point that it’s suffocating. “Alex, are you okay?” I lean over in the chair and put a hand on his knee, hoping to calm him down. He looks at me and I mean really looks at me, with fire in his eyes. Then he stands to his feet, throws the chair over the deck, and storms inside the house, slamming the door behind him. The glass shatters and scatters all over the cracks in the deck. I start to get up, but then sit back down, not wanting to leave my mom alone just yet. “I’ll be fine,” she assures me, motioning at me to go after him. “Now go check on him.” “Are you sure?” I ask hesitantly. She nods, cracking a smile. “Gemma, I’ve been surrounded by screams and torture for the last fourteen years. I’d love a little break from the noise and drama. Maybe just a few minutes of peace and quiet.” I nod and leave her alone on the deck, wondering what I’m leaving behind and what I’m about to walk into. As well as whether or not I can handle any of it. Chapter 32 I find Alex out on the front steps, the porch light shining down on his back. He doesn’t look up at me when I walk out the door, but I know that he knows I’m behind him, thanks to the electricity. The connection feels different now that I know why it’s there. It’s almost painful, the sparks now feeling more like prickly needles, yet somehow it still feels so damn good. The salty sea air kisses my cheeks and my hair as I shut the screen door. I sit down on the cement step beside Alex, pull my legs up, and rest my arms on my knees. He rolls his tongue in his mouth as he taps his foot against the step with his arms on his knees. His hair is disheveled, a sign that he’s been raking his fingers through it, a stressful habit of his. “How are you feeling?” I ask and then shake my head at the absurdity of my ridiculous question. “Sorry, dumb question.” His expression softens, his muscles slightly unraveling. “No, it’s not a dumb question. I just…” He blows out a breath. “I don’t know how to answer it because I don’t know how I feel. I really don’t.” He kicks a rock on the step and it shoots across the grass. “I feel like I don’t know anything anymore—I never really knew anything.” “It’s insane, isn’t it?” I say. “How all of us fit into this—how we were all created.” “Gemma.” His voice holds uncertainty as he angles his face toward me, staring at me remorsefully. “I’m sorry for everything. I really am.” “It’s fine,” I tell him, shrugging it off the best that I can. “It’s not your fault. Besides,” I stare down at my hands. “I think we’re past needing to say we’re sorry.” He turns to the side to face me, takes my hands, and pulls them to him. “No, we’re not,” he says in a low, meaningful tone and I look up at him. “I think you’re letting me off a little because of the electricity—or the star anyway.” “It’s fine,” I repeat, thinking about how he was beaten by his father. I may have been abused by neglect and demeaning words, but Alex had been physically abused. “I’m not the only one who’s suffered.” I pause as he grazes the scar on my palm. “Can I ask you something?” “Yeah, go ahead.” There’s an edge in his voice. “What does Forem mean?” He sighs heavy heartedly and looks up from my hand. “I had a feeling you were going to ask that.” He pauses, deliberating as he searches my eyes. “You remember how Nicholas told you about the Blood Promise the Fey made to Malefiscus?” he asks, sketching his finger along the scar on my palm. I nod, shivering from his touch as my skin tingles. “Yeah, I remember, though he never did explain to me what it was.” He slips his hand over mine, presses our palms together and his hand nearly swallows mine. “Remember in the vision how I cut our hands?” It clicks like a lock unlatching. “Did we make a Blood Promise?” He nods. “We did.” Forem. “What kind of promise exactly?” “Forem or...” His exhale is shaky, conveying his insecurity. “Forever.” I’m a little lost still. “So Forem means Forever, but I still don’t get what exactly a Blood Promises is.” “It’s an unbreakable promise,” he says quietly. “And it means we’re bonded together… forever.” Forever. Forever. What the hell? How is that even possible? We were…were so… “But we were so young,” I finally manage to say through my racing thoughts and heart. “Why the hell would we do that?” He closes his hand around mine, brings my hand to his mouth, and grazes my knuckles with his lips. “Because we were really weird kids,” he states amusedly. “And honestly, I didn’t really know what I was getting into when I did it. I think I said it more as a lets-be-best friends-forever kind of thing.” I explore his face for what’s hidden inside him. Did he mean what he said in The Underworld? Does he really love me? “And what does it mean now to you?” “I’m not sure yet,” he says, staring out at the road. “Me, neither,” I utter softly and then the silence drowns us. I want to ask him so many things. Like what he’s thinking and feeling. Does he think it’s the electricity that’s pulling us toward each other? Does he really love me? In the end I keep my lips sealed because I’m afraid to find out the truth. Then I’ll have to admit what I’m really feeling and I’m not sure I’m ready for that. “Gemma, I…” he starts, struggling to keep his voice balanced.","sourceLink":"https://allnovel.net/fractured-souls-shattered-promises-2/page-39.html","bookId":1977,"book":{"id":1977,"title":"Fractured Souls (Shattered Promises #2)","description":"Storyline: Fractured Souls (Shattered Promises #2) Gemma thought she had said her good-byes and had felt every possible emotion she could before her soul was detached again. Deep down inside, she hoped she’d never wake up from it because, in her eyes, life without emotion and memories isn’t worth living. But she does wake up and discovers she can still feel and remember everything she experienced over the last few months. Alex is also telling her that everything’s okay, that he didn’t betray her, and that what she thought happened really didn’t. Gemma isn’t sure if she can trust Alex, so she tries to keep her distance from him, even though the electric connection and her desire make it nearly impossible. The only person she can trust is Laylen, but even that becomes complicated when the lines of their friendship begin to blur. While Gemma struggles with her emotions and relationships, she searches for her mother, entering a dangerous world of secrets, seduction, and evil. The further she digs into her mother’s secrets and past, the more she wonders what waits for her at the end of her search and if maybe some things are better left in the dark.","cover":"https://allnovel.net/images/fractured-souls-shattered-promises-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fractured-souls-shattered-promises-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:23:10 AM"}}
