{"id":72322,"no":5,"title":"Page 5","content":"“Gemma, I don’t want to fight with you,” he says gently, changing his attitude in the snap of a finger. I’m beginning to understand that he’s good at doing that. “I didn’t… I didn’t work to save you only so we could sit here and argue with each other.”\n His sincerity is puzzling since he’s not much of a sincere type of guy. My eyes drift to his head at the dissolving black spot, the brand of his supposed good deed.\n “Did it hurt?” I ask. “When it bounced back on you?”\n He rolls his tongue in his mouth, like he’s restraining a laugh. “Not too bad, but I’m good at handling pain, much more than other things.”\n “What about the non-pain part of it?” With each ravening breath I take, my chest brushes against his.\n He shakes his head and his forehead brushes against mine. We’re almost pressing against each other, but there’s still a sliver of space between our bodies, a boundary we need at the moment, until some sort of trust can be established.\n “There was no non-pain part of it.” His voice is strained as he starts to twist the ribbon on my shirt around his finger. “It didn’t do anything other than give me a really, really bad fucking headache.”\n I hate this drive toward him. The invisible pull that I still don’t understand. The overwhelming need to touch him, rip his clothes off, bite his lip, scratch his skin and feel his rock-hard body. I should be angry with him, yet I can’t seem to get to that place.\n My fingertips dare to go to the place my mind is heading, drifting to the top of his jeans, then skimming underneath the fabric. I feel him tense and I tense, too. I’m about to go there and what really surprises me is how bad I want to do it, want to touch him. I can tell he wants to touch me also, his lips are dipping closer to mine as we breathe frantically. My back arches and my chest presses against his, my body and mind wanting more—needing more. I feel starved from something, but I’m having a hard time placing what.\n “Jesus… Gemma...” He lets out a throaty groan and his eyes start to shut as my hand travels lower. I start rubbing him through his boxers until he becomes hard and tugs on the ribbon of my shirt to unlace the front. The curves of my breasts become more exposed along with my bra. My other hand wanders up the front of him, resting on the top of his heart, crushed between our bodies. I can feel it pounding in his chest, racing almost as fast as mine. Our lips brush, the connection sparking, and he lets out another groan, this time louder. Suddenly, I remember that there’s a six-foot four, blue-eyed, blond haired, sexy Vampire hiding under my bed. Shit. I lean back, pulling my hands out of the top of his jeans.\n “Where’s Aislin and Laylen?” I ask, breathless.\n He blinks and the emotion drains from his expression. Holding my gaze, he unwinds the loosened ribbon from his finger and pushes back from the door. “Downstairs I think.”\n Just like that the tension and desire melt into a puddle below our feet.\n “Can I talk to Aislin?” I ask, refastening the ribbon.\n He shrugs, pretending to be unbothered, but he seems uneasy. “You can do whatever you want.”\n “Okay, I’ll be down in a second.” I step to the side and hold the door wide open so he’ll leave, even though I don’t want him to at all. I want to put my hands back down the front of his jeans and let him completely untie my shirt.\n “Fine.” He turns his back on me and walks out. “Goddammit, why do you have to be so frustrating?” he mutters to himself, although it’s loud enough that I can hear it.\n “I have no idea,” I mumble back, then quickly shut the door and whirl around to the bed. “Laylen?”\n He army crawls from underneath the bed, his soft laughter making me uneasy. He stands up straight, brushing some dust off his clothes. “Fuck. That was really awkward.”\n I fidget with the ribbon on my shirt. “Nothing happened.”\n He laughs, rearranging his hair into place. “If you say so.”\n “It didn’t,” I argue, but my cheeks heat. “I swear nothing did.”\n He presses back a smile and strides for the window. “All I know is that those noises are going to haunt me for life.”\n “I’m sorry,” I apologize. “I don’t even know why I did it… why I’m like that towards him.”\n He smiles sadly at me from over his shoulder “Because you two have history together and a connection nothing can compete with.”\n I tilt my head to the side. “We do?”\n His shoulders rise and fall as he shrugs. “Kind of… you’ll have to ask him about it, though.”\n I sift through my memories, knowing I’m probably not going to see anything, but trying anyway. As usual, I see blankness, then a few fading clips, however nothing important appears in my mind’s eye.\n “So now what.” I change the subject.\n He hesitates, staring out the window. “Well, here’s where things get tricky.”\n “Get tricky?” I step up beside him and peer down at the three-story drop to a mostly vacant asphalt parking lot. “Things have been tricky for a very, very long time.”\n “True, but they’re about to get trickier.” He unlatches the window, pushes it open, and sticks his head out, looking down below. “We’re not going to be able to just walk out the front door. Adessa set up these charms so if someone tries to come in or go out, she’ll know. It’s her version of a security system.”\n My jaw drops as he ducks back into the window. “Oh my God. You want us to climb out the window. Are you crazy?”\n “It’s the only way,” he says simply, gripping the windowsill. “All the downstairs windows have charms on them, and although I’m not sure exactly what Adessa’s charms do if they get set off, I’d really rather not find out.”\n I stare at the window with uncertainty. It’s getting late, the sky is getting grey as the sun plummets below the tips of the towering buildings. “Can’t we just tell Adessa what we’re doing?”\n “Walking downstairs means facing Alex,” he remarks, slanting his head to the side to meet my eyes. “Are you ready to deal with that? Tell him what you want and then fight him until he lets you go?”\n “No.”\n “Well, then... ”\n I sigh, shuffle my way to the window, and sit down on the windowsill. “I really do hate heights.”\n He playfully pinches my leg. “I won’t let anything happen to you. I promise.”\n “I believe you,” I say truthfully. “But how are we even supposed to get down there? Do you have some kind of like climbing-down-the-wall superpower or something?” My voice turns mocking. “Or are we just going to scale it with some sheets we’ve tied together.”\n “Sheets would tear.” He shakes his head, seeming entertained. “And I’m a Vampire, not Spiderman, so no. I don’t have any climbing down superpowers.” He pauses, blowing out an uneven breath. “You’re going to get on my back, and I’m going to jump out.”\n I start to laugh, but the sound quickly dissolves. “Tell me you’re joking. Please.” I stand up from the windowsill, shaking my head as I back away. “No way.”\n “We won’t get hurt.” He sits down and swings his long legs out the window. “That far of a fall won’t hurt me at all. It’s a Vampire thing.”\n “Yeah, but I’m not a Vampire,” I say. “The fall will hurt me.”\n “That’s why you’ll be on my back, so I can break the fall for you.” He winks at me. Even though he’s adorably sexy, I’m still not hopping on board his death plan.\n “I hate heights.”\n “And I hate biting people, yet I’ve still done it a few times.”\n “Laylen…” I’m torn between wanting the truth and dying to get it.\n He sighs disappointedly. “Do you want me to go alone? Because I can. I just thought, since you’ve been in the dark for so long, you’d like to be a part of it, however it’s up to you.”\n He’s giving me a choice. No one has ever given me a choice. I could seriously kiss him right now because I want to be part of this and help save my mother. “Alright…I’m in.”\n He gives me a lopsided smile. “Good. Now hop on.”\n I summon a deep breath and do what he says. I slip a leg on each side of his waist, so I have my legs wrapped around his midsection, my chest pressed up to his back, and my ass against the windowsill.\n “You good?” Laylen asks as I move around, trying to get situated.\n I tighten my arms and legs around him. “I think so.”\n “And Gemma?”\n “Yeah.”\n “I promise to try and not drop you,” he says.\n Before I can respond, he dismounts from the windowsill and, the next thing I know, I’m falling.\n Chapter 3\n It’s over by the time I actually acknowledge we’r falling. Laylen lands with the gracefulness of a cat, his feet delicately touching the asphalt, and I barely feel the impact.\n For a moment, neither of us moves nor breathes. Even the air seems to pause, as if we fell so fast we’re waiting for the rest of the world to catch up.\n “You alive back there?” Laylen asks from over his shoulder. His arms are wound around my legs, supporting my weight as I clutch onto his shoulders.\n I peek open my eyes, crane my neck, and glance up at the window above us. “Yeah, a little bit more of a warning would have been nice, though.”\n “Then you would have just anticipated it and psyched yourself out,” he says. “Unexpected is always the best when there’s fear involved.”\n I’m not sure if I get his logic, but fear is also very new to my vocabulary. I nod and climb off his back then stretch out my legs and pop my neck, alleviating some of the tension in me.\n We walk across the parking lot beneath the shimmering stars dusting the desert sky. The sound of rushing traffic and flashing lights surround us, along with rustic buildings. The entire area is decorated with graffiti, the ground is littered with garbage, and the lack of people around makes the scenario uneasy, yet at the same time calm.\n “You said that we are going to a place worse than the Black Dungeon,” I remark as we make a right down a narrower, more secluded street. “So does that mean there’s going to be a bunch of strange creatures with lizard tongues and weird eyes or whatever?”\n He glances at me from the corner of his eye as he stuffs his hands into his pockets. “Actually, no. The only things you’re going to find in this place are either human or simply have really sharp, pointy teeth.” He traces his tongue along his teeth. “No weird eyes or lizards tongues.”\n “It’s a club for Vampires,” I state the obvious. I scoot in closer to him as a sketchy looking man wearing a black hoodie walks by us. “How high are my chances of being bit, then?”\n Smiling, he drapes his arm around my shoulders. “I wouldn’t let anyone bite you, sweetheart. Seriously.” \n","sourceLink":"https://allnovel.net/fractured-souls-shattered-promises-2/page-5.html","bookId":1977,"book":{"id":1977,"title":"Fractured Souls (Shattered Promises #2)","description":"Storyline: \n Fractured Souls (Shattered Promises #2) \n Gemma thought she had said her good-byes and had felt every possible emotion she could before her soul was detached again. Deep down inside, she hoped she’d never wake up from it because, in her eyes, life without emotion and memories isn’t worth living. \n But she does wake up and discovers she can still feel and remember everything she experienced over the last few months. Alex is also telling her that everything’s okay, that he didn’t betray her, and that what she thought happened really didn’t. \n Gemma isn’t sure if she can trust Alex, so she tries to keep her distance from him, even though the electric connection and her desire make it nearly impossible. The only person she can trust is Laylen, but even that becomes complicated when the lines of their friendship begin to blur. \n While Gemma struggles with her emotions and relationships, she searches for her mother, entering a dangerous world of secrets, seduction, and evil. The further she digs into her mother’s secrets and past, the more she wonders what waits for her at the end of her search and if maybe some things are better left in the dark.\n \n","cover":"https://allnovel.net/images/fractured-souls-shattered-promises-2.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fractured-souls-shattered-promises-2.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:23:10 AM"}}
