{"id":37766,"no":28,"title":"CHAPTER XXVI. ONE DISAPPOINTMENT FOLLOWS ANOTHER.","content":"At the close of the last chapter we left John floating at his ease in a row-boat, while his pursuer was compelled, by the sudden departure of his horse, to give up his immediate purpose, and chase the flying animal. It was very much against his will that he left John; but the horse, as he knew, was the best in the stable, and valued at not less than three hundred dollars,—a sum which he would be unable to make up. Besides this, the chaise might be injured. \"Curse my luck!\" exclaimed Mr. Huxter, as he glanced back at John, with a baffled look. \"Every thing turns against me. But I\u0027ll come back after the young rascal as soon as I catch the horse.\" But, unfortunately for Mr. Huxter, it proved that two legs were no match for four. When he got to the road, the horse was half a mile ahead. In spite of his haste, he was obliged to pause a moment and recover his breath, which the unusual exercise of running had exhausted. [265] Mr. Huxter was nearly two miles distant from the tavern where he had stopped. His only hope was that the horse would stop or be stopped there. As soon as he recovered his breath, he started for the tavern, therefore. Partly running, partly walking, he at length arrived, tired, heated, and in ill-humor. Entering the yard, he saw a group of men and boys surrounding the horse and chaise, which had already arrived. Among them was Mr. Jones, the landlord. \"Why, here\u0027s the man himself!\" exclaimed the landlord, advancing to meet him. \"How came your horse to run away? Were you spilled out?\" \"No; I tied him to a tree, and he broke loose and ran away. Has he done any harm?\" asked Mr. Huxter, nervously. \"He\u0027s smashed one of the wheels in running against a post,\" said a bystander. \"Let me see,\" said Mr. Huxter, dolefully. He found that it was as bad as had been told him. The horse made a short turn into the inn-yard, and managed to bring the chaise into collision with a post. The wheel was pretty well shattered. \"Looks bad,\" said the bystander. \"It\u0027ll cost something to mend it.\" [266] \"It can\u0027t be mended,\" said Mr. Jones. \"You\u0027ll have to get a new wheel.\" \"What\u0027ll it cost?\" said Mr. Huxter, with something very like a groan. \"I can\u0027t say exactly. Maybe twenty-five dollars will do it.\" \"It might have been worse,\" said the bystander, in what was meant to be an encouraging tone. \"It\u0027s bad enough,\" said Mr. Huxter, fiercely. \"It\u0027s just my cursed luck.\" \"Was the carriage yours?\" asked the landlord. \"No, I got it from a stable. They\u0027ll charge me about double price.\" \"Oh, by the way, did you catch the boy?\" asked the landlord, in a tone of interest. \"No,\" said Mr. Huxter, with an oath which I will omit. \"I had just overtaken him when the cursed horse ran away.\" \"Well, you are unlucky,\" said Jones. \"What are you going to do about it?\" \"I suppose I must get the carriage home somehow.\" \"You might get a new wheel put on here. There\u0027s an excellent wheelwright in the village. It will cost you less.\" Mr. Huxter finally made an arrangement to this[267] effect, the wheelwright agreeing for twenty-five dollars to put the chaise in repair. This, with the stable charge, made thirty dollars as the expense of Mr. Huxter\u0027s little excursion, which, as we have seen, ended in disappointment. He decided not to continue the pursuit of John, having good reason to doubt whether he would catch him. There was one question which troubled Mr. Huxter: Would his sister be willing to pay this thirty dollars? If not, it would indeed be a bad morning\u0027s work for him. He lost no time, on getting home, in writing to Mrs. Oakley. His letter is subjoined. \"Dear Sister:—I hope these few lines will find you in good health. This comes to inform you that the young rascal that I took to board to accommodate you has run away, after treating me most shameful. I hired a team to go after him this morning; but the horse ran away and broke the carriage, which will cost me forty dollars to mend. (Mr. Huxter thought if Mrs. Oakley was to pay the bill he might as well add something to it.) As I was on your business, you will expect to pay this, of course. You can send the money in a letter. I will get back John Oakley if I can. He is a young scamp, and I don\u0027t wonder you had trouble with him. When I get him back, I will make him toe the mark, you may be sure of that. Please write to me by return mail, and don\u0027t forget the money. Your brother,\" \"Ephraim Huxter.\" [268] Mr. Huxter did not have to wait long for an answer; but it proved to be less satisfactory than prompt. It ran as follows:— \"My dear Brother:—Your letter has just reached me. I am surprised that you could not manage to control a boy of fifteen. It seems that he has got the best of you. You need not trouble yourself to get him back. If he chooses to run away and earn his own living, he may, for all I care. He is a young rascal, as you say. \"As to the carriage which you say was damaged to the extent of forty dollars, I do not see how it could have happened, with ordinary care. How did it happen? You ought to have told me in your letter. Nor do I see how you can expect me to pay for the result of your carelessness. But even if I were to do it, you seem to forget that I advanced you seventy-five dollars on John\u0027s board. As he has remained only one week, that being deducted will leave a balance of sixty-nine dollars, or perhaps sixty, after taking out travelling expenses. I could rightfully require this back; but I will not be hard on you. You may pay for the damage done to the carriage (I am surprised that it should amount to forty dollars), and keep the balance as a gift from me. But it will be useless for you to make any further claim on me for a year, at least, as I have large expenses, and charity begins at home. Remember me to your wife.\" \"Jane Oakley.\" \"Well, if that isn\u0027t a cold-blooded letter!\" said Mr. Huxter, bitterly. \"Jane is rich now, and don\u0027t[269] care for the privations of her poor brother. She blames me because the chaise got broken,—just as if I could help it.\" Still Mr. Huxter had no real reason to complain. His sister had agreed to pay for the damage done, and there would be something left out of the money she had paid in advance. But Mr. Huxter, as soon as he had received it, had at once looked upon it as his own, though not yet earned, and to use it seemed as if he were paying the bill out of his own pocket. Then, again, the very decided intimation that he need not look for any more assistance at present was discouraging. Deducting expenses, it would leave him but a small amount to pay him for his journey to Hampton. He resolved not to pay the wheelwright, if he could possibly avoid it, not being very conscientious about paying his debts. But, as Mr. Huxter\u0027s reputation in that way was well known, the wheelwright refused to surrender the chaise till his bill was paid; and the stable-keeper made such a fuss that Mr. Huxter was compelled to pay the bill, though very much against his inclination. The result of his disappointment was, that he began to drink worse than ever, and poor Mrs. Huxter, for some weeks, had a hard time of it. She was certainly very much to be pitied, as is every poor woman who[270] finds herself yoked for life to a husband wedded to a habit so fatal to all domestic comfort and happiness.","sourceLink":"http://novel.tingroom.com/ertong/2986/82332.html","bookId":326,"book":{"id":326,"title":"Luck and Pluck or John Oakley\u0027s Inheritance","description":"简介： What are you going to do with that horse, Ben Brayton?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2986","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
