{"id":37770,"no":32,"title":"CHAPTER XXX. A DANGEROUS ACQUAINTANCE.","content":"While John was attending to his aunt\u0027s interests at Wilton, important events were occurring at Hampton. It has already been stated that Ben Brayton was accustomed to spend most of his time in lounging at the tavern, or in a billiard saloon close by. It was at the latter place that he had the privilege of forming an acquaintance with Arthur Winchester, a young man from the city of New York (or so he represented). He was dressed in the extreme of the fashion, sported a heavy gold chain, wore a diamond ring, and carried a jaunty cane. I cannot guarantee the genuineness of the gold or the diamond; but there was no one in Hampton who could distinguish them from the real articles. The appearance of Mr. Arthur Winchester created something of a sensation among the young men of Hampton, or at least that portion who aspired to[300] wear fashionable clothes. Mr. Winchester\u0027s attire was generally regarded as \"nobby\" in the extreme. They exhibited an elegance which the highest efforts of the village tailor had never succeeded in reaching. Forthwith the smart young men in Hampton became possessed with the desire to have their clothes made in the same faultless style, and Mr. Winchester was accommodating enough to permit the village tailor to take a pattern from his garments. Among those who gazed with admiration at the new-comer was Ben Brayton. He was the first, indeed, to order a suit like Mr. Winchester\u0027s, in which, when obtained, he strutted about proudly, arm in arm with the young man himself. Various circumstances served to strengthen the intimacy between the two. In the first place neither had any weighty occupations to prevent their drinking or playing billiards together, and it chanced after a time that this became a regular business with them. Ben Brayton was an average player, and appeared nearly equal to his new friend. At all events, in the friendly trials of skill that took place between them, Ben came off victorious perhaps a third of the time. \"Come, Ben,\" said Winchester, one morning, \"this is slow. Suppose we make the games a little more exciting by staking a little on the game.\" [301] \"You\u0027re a better player than I am, Winchester,\" said Ben. \"Not much. You beat me pretty often. However, I\u0027ll give you twenty points, and stake a dollar on the game.\" \"I don\u0027t mind,\" said Ben. \"A dollar isn\u0027t much.\" \"Agreed.\" The game was played, and, counting the twenty points conceded, Ben came off victorious by five points. He pocketed the dollar with a sense of elation. \"Will you have another?\" he asked. \"Of course I will. I\u0027m bound to have my revenge.\" The second game was played, and likewise terminated in Ben\u0027s favor. He pocketed the second dollar with satisfaction. He had never found billiards so interesting. \"Come, Brayton, this won\u0027t do. I didn\u0027t think you were so good a player. You\u0027ll clean me out at this rate.\" \"Oh, I only happened to be lucky,\" said Ben, in high good humor. \"Shall we try it again?\" Of course they tried it again, and spent nearly the entire day in the same way. Fortune veered about a little, and Ben came out minus three dollars. [302] \"Never mind, Brayton, you\u0027ll get it back to-morrow,\" said Winchester, as they parted. So Ben thought, and the furor of gaming had already taken such possession of him that he got up unusually early, anxious to get at the fascinating game. So matters went on for a week. They never exceeded one dollar as stakes, and played so even that Ben was only ten dollars behindhand. This he paid from his allowance, and so far from being satiated with the game could hardly restrain his impatience till Monday morning should give him a chance of playing again. It is perhaps needless to say that Ben had fallen into dangerous company. Mr. Arthur Winchester was really a far superior player, and eventually meant to fleece Ben out of his last dollar. But he did not wish to arouse suspicion of his intentions, and \"played off,\" as the saying is, and thus had no difficulty in luring Ben on to the point at which he aimed. At the end of the second week Ben was only five dollars behind. \"You\u0027re gaining upon me,\" said Winchester. \"You\u0027re improving in your play.\" \"Am I?\" said Ben, flattered. \"Not a doubt of it. I don\u0027t like to boast, but I[303] am considered a first-class player in the city, and, by Jove, you\u0027re almost even with me.\" Ben listened with gratification to this praise. He didn\u0027t doubt that Winchester was the first-class player he represented, and in fact he was a superior player, but he had never yet put forth his utmost skill. He had only played with Ben, suiting himself to his inferior style of playing. Gradually Winchester suggested higher play. \"A dollar is nothing,\" he said. \"Let us make it five.\" Ben hesitated. \"That\u0027s a good deal to lose,\" he said. \"That\u0027s true, but isn\u0027t it as much to win? Come, it will make our games more interesting, and you\u0027re as likely to come out ahead as I am.\" \"That is true,\" thought Ben. \"I\u0027ll tell you what,\" he said; \"give me twenty-five points, and I\u0027ll do it.\" \"Anything for excitement,\" said Winchester; \"but we\u0027re so nearly matched that you\u0027ll beat me twice out of three times on those odds.\" Ben did beat the first game, and the exultation with which he pocketed the stakes revealed to his experienced opponent that he had the game in his hands. [304] Towards the middle of the afternoon Ben stood one game ahead. He was flushed and excited by his success. \"I\u0027ll tell you what,\" said Winchester; \"let\u0027s give up child\u0027s play and have the real thing.\" \"What do you mean?\" asked Ben. \"Let us stake fifty dollars, and done with it. That\u0027ll be something worth playing for.\" Ben started in surprise. The magnitude of the stake took his breath away. \"I haven\u0027t got the money,\" he said. \"Oh, well, you can give me your note. I\u0027ll wait, that is, of course if I win; but I am not so sure of that as I was. You\u0027re a pretty smart player.\" Ben did not hesitate long. He was dazzled by the idea of winning fifty dollars, and his success thus far encouraged him to think that he would. \"Give me thirty points, then,\" he said. \"I ought not to; but anything for excitement.\" The game was commenced. Ben led till towards the close of the game, when his opponent improved his play, and came out three points ahead. \"It was a close shave,\" he said. Ben looked uneasy. It was all very agreeable to win a large sum; but to lose was not so comfortable. \"I haven\u0027t got the money,\" he said. [305] \"Oh, give me your note, and pay when it\u0027s convenient! In fact, perhaps you need not pay at all. You may win the next game.\" \"I don\u0027t know if I had better play,\" said Ben, doubtfully. \"Oh, you mustn\u0027t leave off a loser. You must have your revenge. In fact, I\u0027ll make you a good offer. We\u0027ll play for a hundred dollars, and I\u0027ll give you thirty-five points. That\u0027ll square us up, and make me your debtor.\" \"Say forty, and I\u0027ll agree.\" \"Forty let it be then; but you\u0027ll win.\" Again Winchester permitted Ben to gain in the commencement of the game, but towards the last he took care to make up for lost time by a brilliant play that brought him out victor. \"I was lucky,\" he said. \"I began to think, the first part of the game, that all was over with me.\" Ben, silly dupe that he was, did not fathom the rascality of his companion. \"I don\u0027t think I played as well as usual,\" he said, ruefully. \"No, you didn\u0027t. Perhaps your hand has got a little out, you have played so many hours on a stretch.\" Ben gave Winchester another due-bill for one hundred[306] dollars, wondering how he should be able to meet it. He was rather frightened, and resolved not to play the next day. But when the next day came his resolution evaporated. I need not describe the wiles used by Arthur Winchester. It is enough that at the close of the coming day he held notes signed by Ben for three hundred dollars. He assured the disturbed Ben that he needn\u0027t trouble himself about the matter; that he didn\u0027t need the money just yet. He would give him time to pay it in, and other things to the same effect. But having come to the conclusion that Ben had been bled as much as he could stand, he called him aside the next morning, and said:— \"I\u0027m sorry to trouble you, my dear Brayton, but I\u0027ve just had a letter recalling me to the city. Could you let me have that money as well as not, say this afternoon?\" \"This afternoon!\" exclaimed Ben, in dismay. \"I don\u0027t see how I can get it at all.\" \"Do you mean to repudiate your debts of honor?\" said Winchester, sternly. \"No,\" said Ben, faltering; \"but I\u0027ve got no money.\" \"You ought to have made sure of that,\" said[307] Winchester, shortly, \"before playing with a gentleman. Go to your mother. She is rich.\" \"She won\u0027t give me the money.\" \"Look here, Brayton,\" said Winchester, \"I must have that money. I don\u0027t care how you get it. But some way or other it must be got. I hope you understand.\" A bright idea came to Ben. \"You can\u0027t collect my notes,\" he said; \"I\u0027m under age.\" \"Then,\" said Winchester, his face darkening with a frown that made Ben shiver, \"I demand satisfaction. To-morrow morning, at five o\u0027clock, I will meet you with swords or pistols, as you prefer.\" \"What do you mean?\" asked Ben, his teeth chattering, for he was an arrant coward. \"What I say! If the law will not give me satisfaction, I will demand the satisfaction of a gentleman. Fight or pay, take your choice; but one or the other you must do.\" The sentence closed with an oath. \"I\u0027ll do my best,\" said Ben, terrified. \"Of course I mean to pay you.\" \"Then you\u0027ll let me have the money to-morrow?\" \"I\u0027ll try.\" The two parted, and Ben, thoroughly miserable,[308] went home, trying to devise some means to appease his inexorable creditor, whom he began to wish he had never met. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2986/82336.html","bookId":326,"book":{"id":326,"title":"Luck and Pluck or John Oakley\u0027s Inheritance","description":"简介： What are you going to do with that horse, Ben Brayton?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2986","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
