{"id":37744,"no":6,"title":"CHAPTER V. BEN IS COMFORTED.","content":"\"What have you been doing to my son, you young reprobate?\" demanded Mrs. Oakley of John. Her hands trembled convulsively with passion, as if she would like to get hold of our hero, and avenge Ben\u0027s wrongs by inflicting punishment on the spot. John was silent. \"Why don\u0027t you speak, you young rascal?\" demanded Mrs. Oakley, furiously. \"I am neither a reprobate nor a rascal, Mrs. Oakley,\" said John, calmly, \"and I do not choose to answer when addressed in that way.\" \"Ben,\" said Mrs. Oakley, turning to her son, \"what has he done to you? How happens it that you come home in such a plight?\" \"I was thrown over the horse\u0027s head into a mud-puddle,\" said Ben. \"Didn\u0027t he have anything to do with it?\" asked Mrs. Oakley, determined to connect John with Ben\u0027s misfortune, if possible. [63] \"He spoke to the horse,\" said Ben. \"And then he threw you?\" \"Yes.\" Ben answered thus, being perfectly willing that his mother should charge his fall upon John, as this would create additional prejudice between them. It was contemptible meanness on his part, but meanness was characteristic of him, and he had no hesitation in stooping to falsehood, direct or indirect, if by so doing he could compass his object. \"It is as I thought,\" said Mrs. Oakley, thinking it unnecessary to inquire further. \"Of course, as soon as you were thrown, he jumped on the horse and rode home. You\u0027re carrying matters with a high hand, young man; but you\u0027ll find that I\u0027m your match. Get off that horse, directly.\" \"That was my intention,\" said John. \"I am sorry, Mrs. Oakley,\" he continued, \"that Ben has not seen fit to give you a correct account of what has happened. If he had, it would have been unnecessary for me to speak.\" \"It is unnecessary for you to speak now, John Oakley,\" said his stepmother, sharply. \"Do you mean to charge my son with telling a falsehood? If that is the case, take care what you say.\" [64] \"Ben has not told a falsehood, but he is trying to make you believe that I caused his fall.\" \"I have no doubt you did.\" \"Then you are mistaken. Why didn\u0027t he tell you that when I first saw the horse he was running at great speed, in consequence of Ben\u0027s having imprudently struck him severely with the whip? He is a spirited horse, and won\u0027t stand the whip.\" \"He is like you in that, I suppose,\" said Mrs. Oakley, sneering. \"He is like me in that,\" said John, quietly. \"You would both be better if you had to stand it,\" said his stepmother, angrily. John did not see fit to reply to this. \"Is this true, Ben?\" she asked. \"Yes,\" said Ben, reluctantly. \"I struck the horse; but it was not till John spoke to him that he threw me off.\" \"So I supposed,\" said Mrs. Oakley, significantly. \"I see, Mrs. Oakley,\" said John, \"you are determined to find me guilty of causing Ben\u0027s fall. If I could be mean enough to do such a thing, and so risk his life, I should despise myself. Prince was rushing up the street with tremendous speed, and I was frightened at Ben\u0027s danger; I called out to Prince,[65] but he stopped so suddenly that Ben was thrown into the puddle, or he might have been seriously hurt.\" There was so much sincerity in what John said, that Mrs. Oakley, though very much against her will, could hardly help believing him. Determined, however, to make out a case against him, she said:— \"As soon as you saw him off, you jumped on the horse and rode home, leaving him to get home as he could. That was a very generous and noble thing to do!\" \"Ask Ben if I did not ask him to ride home,\" said John. Ben, in answer to his mother\u0027s glance, said, rather unwillingly:— \"Yes, he asked me to ride home, but he knew I wouldn\u0027t after being thrown once. I won\u0027t get on the brute\u0027s back again, I promise you.\" Mrs. Oakley was disappointed to find that the case she was trying to make out against John had failed at all points, and that he was cleared even by the testimony of her principal witness. \"You had better come in and change your clothes, Ben,\" she said. \"I am afraid you will take cold. And do you\"—turning to John—\"take the horse round to the stable. He\u0027s an ugly brute, and I\u0027ll take care that he doesn\u0027t endanger your life any more.\" [66] John led Prince round to the stable, and delivered him into the hands of Mike. \"Where\u0027s Master Ben?\" inquired Mike. \"He got thrown off.\" \"I thought how it would be,\" said Mike. \"He can\u0027t ride no more\u0027n a stick. I told him not to take the whip, but he wouldn\u0027t heed a word I said.\" \"That\u0027s how he got thrown. He struck the horse violently, and he was running away with him when he heard my voice and stopped.\" \"Did Master Ben get hurt?\" \"Not much. He fell into a puddle, and dirtied his clothes.\" \"Maybe he\u0027ll be wiser next time.\" \"He says he won\u0027t ride Prince again.\" \"All the better for you, Master John.\" \"I don\u0027t know, Mike,\" said John, soberly. \"I\u0027m afraid Mrs. Oakley will sell him. She says he is an ugly brute, and she won\u0027t have any more lives endangered.\" \"Ugly brute!\" repeated Mike, indignantly. \"There\u0027s not a bit of ugliness about him. He wants to be treated well, and I\u0027d like to know who don\u0027t. And he\u0027s so attached to you, Master John!\" \"Yes, Mike, it\u0027ll be hard to part with him.\" And John\u0027s lips quivered as he looked with affection at the[67] noble horse, to which he had become much attached. Besides, it was his father\u0027s gift, and as such had an additional value for him, as, owing to his disinheritance, he had nothing else of value by which he could remember the parent whose loss he was made to feel more and more, as his stepmother\u0027s injustice and harsh treatment, and Ben\u0027s meanness and hostility served daily to increase. It almost seemed to him as if Prince was the only friend he had left, and that he must be parted even from him. Meanwhile Ben was changing his clothes in his room. The adventure which had just happened to him did not make him feel very pleasant. In the first place, it is rather disagreeable to be thrown violently into a puddle of dirty water, and Ben might be excused for not liking that. Ben\u0027s pride was touched, since it had been demonstrated in the most public manner that he could not manage Prince, while it was well known that John could. Ben knew boys well enough to feel sure that he would be reminded from time to time of his adventure, and he did not like to be laughed at. Why was it that John always seemed to get the better of him? He went out expressly to triumph over John in presence of his schoolmates, and this had been the humiliating result. \"Why was I such a fool as to use the whip?\"[68] thought Ben, vexed with himself. \"If it had not been for that, it would have been all right.\" But he had used the whip, and it was all wrong. As to using the horse any more, he did not care to do it. To tell the truth, Ben, who, as we know, was not very courageous, was afraid of Prince. He suspected that the horse would remember the blow he had given him, and would be likely to serve him the same trick the next time he mounted him. So he resolved that he would never ride out on Prince again; but he was equally anxious that John should also be prevented from using him. The words that his mother had last used led him to hope that she would agree to sell him, and, what was still more important in his eyes, give him the money resulting from the sale. Under these circumstances the triumph would still be his, and he would enjoy John\u0027s grief for the loss of his horse. When Ben descended from his chamber, in a clean suit, he found that his mother had taken measures to console him for his mortifying adventure. The tea-table was spread, and two or three delicacies such as he particularly liked were set before his plate. Ben surveyed this with satisfaction, for he was something of a gourmand. \"I thought you might be hungry, Ben,\" said his[69] mother; \"so I got some of that marmalade that you like so well, and here is some hot mince-pie.\" \"That\u0027s just what I like, mother.\" \"We will sit down at once. John can come when he gets ready.\" \"What are you going to do about that horse, mother?\" asked Ben, rather indistinctly, for his mouth was full. \"I did intend to keep him for your use; but if he is likely to play such tricks as he has to-day, I suppose I had better sell him.\" \"Yes, mother, sell him. I\u0027ll never mount such a vicious brute again, and I suppose you won\u0027t keep him just for John\u0027s use.\" \"Of course not. It costs considerable to keep a horse. Besides, he\u0027d be flinging out that he could manage the horse, and you couldn\u0027t.\" \"Of course he would. But the horse is used to him, you know, and that is why he doesn\u0027t find any trouble with him. But you gave me the horse, you know, mother.\" \"But you don\u0027t want him.\" \"No, I don\u0027t; but I suppose you\u0027ll give me the money you sell him for.\" \"I don\u0027t know about that,\" said Mrs. Oakley, hesitatingly.[70] \"He cost a hundred and fifty dollars. That is too much money for you to have.\" \"Why is it?\" said Ben. \"I give you ten dollars a week now.\" \"Yes; but that goes for small expenses. If I wanted now to buy anything expensive, I couldn\u0027t do it.\" \"What is there you want?\" \"I don\u0027t know yet,\" said Ben; \"I haven\u0027t thought, but I should like to have the money.\" Mrs. Oakley still hesitated. \"I know it would make John awful mad,\" said Ben, cunningly appealing to his mother\u0027s hatred of our hero, \"to think that Prince was sold, and that I had the money. Perhaps it\u0027s that you\u0027re thinking of. But I didn\u0027t suppose you\u0027d be influenced by anything he could say or do.\" \"John may be angry or not; it is entirely indifferent to me,\" said Mrs. Oakley, falling into the trap laid for her. \"I was only thinking whether it would be well for you. I don\u0027t know but I will let you have the money,—that is, I will put it in the savings-bank in your name, and you can let me know when you want to use it, and what for.\" \"All right,\" said Ben, who determined that when he once got hold of the money he would not consult[71] anybody as to its disposal. \"When will you sell it, mother?\" \"To-morrow, perhaps. I hear that Mr. Barnes, the livery stable-keeper, has just lost a valuable horse. Perhaps he may like to buy it.\" \"He\u0027ll buy it fast enough,\" said Ben. \"I heard him say the other day that he should like to have Prince. He likes fast horses. How surprised John will be when he comes home, and finds Prince is missing!\" Ben laughed as he fancied John\u0027s anger, and this thought, together with the money which would so soon be placed to his account, quite restored his spirits, somewhat to John\u0027s surprise, who did not understand the reasons which he had for being cheerful. So Prince\u0027s fate was decided, and a new trial awaited John. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2986/82310.html","bookId":326,"book":{"id":326,"title":"Luck and Pluck or John Oakley\u0027s Inheritance","description":"简介： What are you going to do with that horse, Ben Brayton?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2986","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
