{"id":9735,"no":6,"title":"CHAPTER VI. — A NIGHT INCIDENT.","content":"The path of a gold-seeker in Australia was beset with difficulties. The country about Melbourne, and far inland, was boggy, the soil being volcanic, and abounding in mud which appears to have no bottom. The road to the mines was all the worse for having been ploughed up by bullock teams, and worked into a slough which proved the discouragement of mining parties. Some were even months in traversing the comparatively small distance across the country to the goal they sought. But the attraction of money, which is said to make the mare go, enabled them to triumph at last over the obstacles that intervened. It was not long before our party began to understand the nature of the task they had undertaken. The cart sank up to the hubs in a bog, and the oxen stood still in patient despair. \"Well, if this don\u0027t beat all creation!\" ejaculated Obed. \"I\u0027ve been in the Western States, and I thought I knew something about mud, but Australy\u0027s ahead. I say, Fletcher, is there much of this that we\u0027ve got to go through?\" \"Mud\u0027s the rule, and dry land the exception,\" answered Fletcher coolly. \"Well, that\u0027s comfortin\u0027!\" remarked Stackpole, drawing a deep breath. \"I s\u0027pose people do get through after a while.\" \"Yes, generally. I was six weeks getting to the Ovens once.\" \"I wish we had some ovens to bake this mud,\" said Obed, with a grim smile at his joke. \"It would take a powerful large one.\" There was nothing for it but dogged perseverance. It took an hour to get the oxen and cart through a bog a hundred feet across, and the appearance of the party, when they finally reached the other side, was more picturesque than attractive. \"How would Clinton get along here?\" suggested Harry. \"I can imagine the poor fellow\u0027s despair.\" \"His trousers would suffer some,\" said Jack. \"I think it would break his heart. The sea is much nicer. If we could only go by water,\" and the young sailor looked down at his mud-bedraggled clothes, and his shoes caked thickly over with the tenacious mud. \"Yes, the sea would be cleaner at any rate. I agree with you there, Jack.\" Arrived on the other side of the bog, they were obliged to give the tired cattle a rest. Indeed, they needed rest themselves. At the end of the day they made an encampment. As well as they could judge, they were about eight miles from Melbourne. \"Eight miles; and how far is the whole distance?\" asked Harry. \"About a hundred miles,\" answered Fletcher. \"At this rate, we can go through in twelve or thirteen days, then.\" \"You mustn\u0027t expect this rate of speed,\" said Fletcher. \"We shan\u0027t average over five miles.\" \"Well, I hope we\u0027ll get paid for it,\" said Obed. \"If we don\u0027t I\u0027d better have stayed in Californy. We haven\u0027t any such mines as this in that country.\" \"You\u0027d better have stayed there,\" said Fletcher dryly, and he evidently wished that his companion had done so. \"\u0027Variety\u0027s the spice of life,\u0027 as my old schoolmaster used to say,\" responded Obed. \"I kinder want to see what Australy is like. All the same I don\u0027t want to stump through to the other side of the globe.\" The travellers encamped for the night in a dry spot among a group of gum-trees, and it may readily be believed that all slept well. The boys felt dead tired, and it was with difficulty they were awakened in the morning. About five o\u0027clock Fletcher opened his eyes. He was one who slept fast, so to speak, and obtained as much refreshment from an hour\u0027s sleep as most people do from a period twice as long. He had been lying on the ground wrapped in a blanket, as was the case with the other members of the party. Raising himself, and leaning on his elbow, he saw that they were all fast asleep. He nodded with satisfaction, and getting on his feet he approached Obed Stackpole with noiseless tread. The Yankee was sleeping with his mouth wide open, occasionally emitting a sonorous snore through his aquiline nose. He was not beautiful to look upon, as Fletcher evidently thought. \"Ill-favored brute!\" he ejaculated. \"I\u0027d like to choke him!\" If any special advantage had been likely to accrue to him, Fletcher\u0027s conscience would not have been likely to stand in the way of violence; but his purpose now was different. \"The fellow must have gold about him,\" muttered Fletcher. \"I wonder whether I can get at it without waking him up.\" Obed seemed to be in a profound slumber, but it was a peculiarity of our Yankee friend to wake at the least touch. This, of course, was not known to Dick Fletcher, who felt that there would be no risk in a careful exploration of Obed\u0027s pockets. He thrust his hand into one of the Yankee\u0027s pockets with the practiced skill of a pickpocket, when an entirely unexpected result followed. \"Why, you skunk, what in creation are you about?\" exclaimed Obed, suddenly seizing Fletcher by the throat. \"Let me go!\" said Fletcher, struggling violently, but ineffectually, to free himself. \"Not till you\u0027ve told me what you are after.\" \"Let go, and I\u0027ll tell you.\" Obed loosened his grip, saying sternly, \"Are you a pickpocket, my enterprising friend, or what is the meaning of all this business?\" \"You had better not insult me!\" said Fletcher angrily. \"I\u0027m no more a pickpocket than you are.\" \"Then what is the meaning of your little game? Maybe you got up in your sleep.\" \"No, I didn\u0027t. I just waked up, and thought I\u0027d like to have a smoke, but had no matches. I thought you might have some in your pocket.\" \"Why didn\u0027t you wake me up and ask me?\" \"You looked so comfortable, and I thought you needed rest after a hard day\u0027s work, so I decided to help myself.\" \"It looks like it,\" responded Obed dryly. \"So that\u0027s all you were after, was it?\" \"Of course,\" said Fletcher, regaining confidence. \"What else could it be?\" \"Well, it strikes me it\u0027s rather takin\u0027 a liberty with a gentleman to search his pockets while he\u0027s asleep, that\u0027s all! In Californy, Fletcher, if you had been caught doin\u0027 it, ten chances to one you\u0027d have been lynched, and lynchin\u0027 isn\u0027t usually regarded as comfortable or desirable. Where\u0027s your cigar?\" \"I haven\u0027t any, but I\u0027ve got a pipe.\" \"Well, I do happen to have a few matches in my other pocket, but I\u0027d rather you\u0027d ask for \u0027em next time.\" \"I will. The fact is, I ought to have brought some with me. It\u0027s very strange, old traveller as I am.\" \"It would have been a little better than borrowin\u0027 them of a sleepin\u0027 man without leave. Don\u0027t do it again, Fletcher.\" \"I\u0027m not very likely to borrow them of you again, except when you\u0027re awake,\" said Fetcher with a short laugh. \"Do you always wake up so easy?\" he asked, in some curiosity. \"Always. I sleep mighty sound, but the least touch wakes me up.\" \"I shall remember that,\" thought Fletcher. \"This Yankee is rather a dangerous man to tackle. I won\u0027t attempt it again unless I have the decided advantage.\" \"I hope you\u0027ll excuse me, Mr. Stackpole,\" he said aloud in a smooth tone. \"I used to travel with a friend—a great chum of mine—and we never stood on ceremony with each other. I ought to have remembered that you and I are comparatively new acquaintances.\" \"Perhaps it will be best,\" said Obed dryly. \"You see when I wake up I don\u0027t always have my wits about me, and I might cut up rough before I had time to think.\" \"Oh, no apologies, I beg,\" said Fletcher, waving his hand. \"Who\u0027s apologizin\u0027?\" demanded Obed, in surprise. \"Never mind, it\u0027s all right! I thought you were apologizing for seizing me by the throat. As you say, you waked up suddenly, and didn\u0027t have your wits about you.\" \"Well, I know!\" ejaculated Obed half to himself. \"I didn\u0027t think of that way of puttin\u0027 it. You\u0027re a cute fellow, Fletcher.\" \"Thank you, Mr. Stackpole. Now I will have my smoke;\" and Fletcher, though he did not care for it, by way of removing any lingering suspicion, lit his pipe and puffed away with apparent pleasure. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2978/82082.html","bookId":345,"book":{"id":345,"title":"In A New World or, Among The Gold Fields Of Australia","description":"简介： A stout gentleman of middle age and two boys were sitting in the public room of a modest inn in Melbourne. The gentleman was known to the public as Professor Hemmenway, who announced himself on the programme of his entertainment as The Magician of Ma...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2978","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
