{"id":72088,"no":26,"title":"Page 26","content":"\"Yes, maybe some people in high office were capable of looking at the diagrams and really did believe that there was going to be an eclipse. And a period of Darkness as a result. But how could they anticipate the Stars? The Stars were simply the fantasy of the Apostles of Flame, remember? Even if the government knew that something like the Stars was going to happen, no one could predict the impact the Stars would have.\" \"Sheerin could,\" Theremon said. \"Not even Sheerin. He didn\u0027t have an inkling. It was Darkness that was Sheerin\u0027s specialty-not sudden unthinkable light filling the whole sky.\" \"Still,\" Theremon said. \"To look around at all this devastation, all this chaos-you want to think that it was unnecessary, that it could have been avoided, somehow.\" \"It wasn\u0027t avoided, though.\" \"It better be, the next time.\" Siferra laughed. \"Next time is two thousand and forty-nine years away. Let\u0027s hope we can leave our descendants some kind of warning that seems more plausible to them than the Book of Revelations seemed to most of us.\" Turning, she stared back over her shoulder, peering apprehensively at the long span of highway they had covered in the past few days of hard marching. Theremon said, \"Afraid you\u0027ll see the Apostles thundering down the road behind us?\" \"Aren\u0027t you? We\u0027re still hundreds of miles from Amgando, even at the pace we\u0027ve been going lately. What if they catch up with us, Theremon?\" \"They won\u0027t. A whole army can\u0027t possibly move as quickly as two healthy and determined people. Their transport isn\u0027t any better than ours-one pair of feet per soldier, period. And there are all sorts of logistic considerations that are bound to slow them down.\" \"I suppose.\" \"Besides, that message said that the Apostles are planning to stop at each new province along the way to establish their authority. It\u0027s going to take them plenty of time to obliterate all those stubborn little petty kingdoms. If we don\u0027t run into any unexpected complications ourselves, we\u0027ll be at Amgando weeks ahead of them.\" \"What do you think will happen to Beenay and Raissta?\" Siferra asked, after a time. \"Beenay\u0027s a pretty clever boy. I suspect he\u0027ll work out some way of making himself useful to Mondior.\" \"And if he can\u0027t?\" \"Siferra, do we really need to burn up our energies worrying ourselves over horrible possibilities that we can\u0027t do a damned thing about?\" \"Sorry,\" she said sharply. \"I didn\u0027t realize you\u0027d be so touchy.\" \"Siferra-\" \"Forget it,\" she said. \"Maybe I\u0027m the touchy one.\" \"It\u0027ll all work out,\" said Theremon. \"Beenay and Raissta aren\u0027t going to be harmed. We\u0027ll get down to Amgando in plenty of time to give the warning. The Apostles of Flame won\u0027t conquer the world.\" \"And all the dead people will rise up and walk again, too. Oh, Theremon, Theremon-\" Her voice broke. \"I know.\" \"What will we do?\" \"We\u0027ll walk fast, is what we\u0027ll do. And we won\u0027t look back. Looking back doesn\u0027t do any good at all.\" \"No. None at all,\" said Siferra. And smiled, and took his hand. And they walked quickly onward in silence. It was amazing, Theremon thought, how swiftly they were going, now that they had hit their stride. The first few days, when they were coming down out of Saro City and picking their way through the wreckage-strewn upper end of the highway, progress had been slow and their bodies had protested bitterly against the strains that they were imposing on them. But now they were moving like two machines, perfectly attuned to their task. Siferra\u0027s legs were nearly as long as his own, and they walked along side by side, muscles working efficiently, hearts pumping steadily, lungs expanding and contracting in flawless rhythm. Stride stride stride. Stride stride stride. Stride stride stride- Hundreds of miles yet to go, sure. But it wouldn\u0027t take long, not at this pace Another month, perhaps. Perhaps even less The road was almost completely clear, down here in the rural regions beyond the farthest edge of the city. There hadn\u0027t been nearly as much traffic here in the first place as there had been to the north, and it looked as though many of the drivers had been able to get off the highway safely even while the Stars were shining, since they were in less danger of being struck by the cars of other drivers who had lost control. There were fewer checkpoints, too. The new provinces in these sparsely populated areas covered much greater areas than those up north, and their people seemed less concerned with such things as Search. Theremon and Siferra underwent serious interrogation only twice in the next five days. At the other border points they were simply waved on through without even having to show the papers Beenay had provided for them. Even the weather was on their side. It was fair and mild almost every day: a few little rain-showers now and then but nothing that caused serious inconvenience. They would walk for four hours, pause for a light meal, walk another four, eat again, walk, stop for six hours or so of sleep-taking turns, one sitting up and watching for a few hours, then the other-and then get up and march onward. Like machines. The suns came and went in the sky in their age-old rhythm, now Patru and Trey and Dovim up above, now Onos and Sitha and Tano, now Onos and Dovim, now Trey and Patru, now four suns at once -the unending succession, the great pageant of the skies. Theremon had no idea how many days had passed since they had left the Sanctuary The whole idea of dates, calendars, days, weeks, months-it all seemed quaint and archaic and cumbersome to him, something out of a former world. Siferra, after her spell of brooding and apprehensiveness, became cheerful again This was going to be a breeze They would make it down to Amgando with no trouble at all They were passing through a district known as Spring Glen now-or perhaps it was called Garden Grove, they had heard several different names from the people they encountered along the road. It was farm country, open and rolling, and there was little sign here of the hellish devastation that had blighted the urbanized regions: an occasional fire-damaged barn, or a herd of farm animals that seemed to be roaming unattended, and that was about the worst of it. The air was sweet and fresh, the light of the suns was bright and strong. But for the eerie absence of vehicular traffic on the highway, it was possible here to think that nothing extraordinary had happened at all. \"Are we halfway to Amgando yet?\" Siferra asked. \"Not quite. I haven\u0027t seen a road-sign for a while, but my guess is that-\" He stopped abruptly. \"What is it, Theremon?\" \"Look. Look there, to the right. Along that secondary road coming in from the west.\" They peered over the edge of the highway. Down below, a few hundred yards away, a long row of trucks was drawn up at the side of the secondary road, where it fed into an approach to the main one. There was a large, bustling camp there: tents, a big campfire burning, some men chopping logs. Two or three hundred people, perhaps. All of them in black hooded robes. Theremon and Siferra exchanged astounded glances. \"Apostles!\" she whispered. \"Yes. Get down. Hands and knees. Hide yourself against the railing here.\" \"But how did they manage to get this far south so fast? The highway\u0027s upper end is completely blocked!\" Theremon shook his head. \"They didn\u0027t take the highway at all. Look there-they\u0027ve got trucks that work. Here\u0027s another one, coming right now. Gods, that looks strange, doesn\u0027t it, an actual moving vehicle! And hearing the sound of an engine again after all this time.\" He felt himself beginning to shiver. \"They were able to keep a fleet of trucks undamaged, and a supply of fuel. And obviously they\u0027ve come down from Saro around through the west, on little country roads. Now they\u0027re joining up with the main highway, which I suppose is open from here to Amgando. They could be there by this evening.\" \"This evening! Theremon, what are we going to do?\" \"I\u0027m not sure. There\u0027s only one wild chance, I guess. -What if we went down there and tried to seize one of those trucks? And drove it to Amgando ourselves Even if we got there only two hours ahead of the Apostles, there\u0027d be time for most of the Amgando people to escape. Right?\" Siferra said, \"Perhaps. It sounds crazy, though. How could we steal a truck? The moment they see us, they\u0027ll know we aren\u0027t Apostles, and they\u0027ll grab us.\" \"I know. I know. Let me think.\" After a moment he said, \"If we could catch a couple of them at a distance from the others, and take their robes away from them-shoot them with our needlers, if we have to-and then, when we\u0027re robed, just walk up to one of the trucks as though we have every right to be doing that, and jump on board and drive off toward the highway-\" \"They\u0027d follow after us in two minutes.\" \"Maybe. Or maybe if we were calm and cool about it they\u0027d think it was something perfectly ordinary, part of their plan- and by the time they realized it wasn\u0027t, we\u0027d be fifty miles down the road.\" He looked at her eagerly. \"What do you say, Siferra? What other hope do we have? Continue toward Amgando on foot, when for us it\u0027ll be a journey of weeks and weeks, and they can drive past us in a couple of hours?\" She was staring at him as though he had lost his mind. \"Overpower a couple of Apostles-hijack one of their trucks-go zooming off toward Amgando-oh, Theremon, it\u0027ll never work. You know that.\" \"All right,\" he said abruptly. \"You stay here. I\u0027ll try to do it alone. It\u0027s the only hope there is, Siferra.\" He rose to a half-crouch, and began to scuttle along the side of the highway toward the exit ramp a few hundred yards ahead. \"No-wait, Theremon-\" He looked back at her and grinned. \"Coming?\" \"Yes. Oh, this is crazy!\" \"Yes,\" he said. \"I know. But what else can we do?\" She was right, of course. The scheme was crazy. Yet he saw no alternative. Evidently the report Beenay had received had been garbled: the Apostles had never intended to move down the Great Southern Highway province by province, but instead had set out directly for Amgando in a huge armed convoy, taking minor roads which, though not very direct, were at least still open to vehicular transport. Amgando was doomed. The world would fall by default to Mondior\u0027s people. Unless-unless- He had never imagined himself as a hero. Heroes were people he wrote about in his column-people who functioned at the top of their form under extreme circumstances, performing strange and miraculous deeds that the ordinary individual would never dream of even attempting, let alone of carrying off. And now here he was in this strangely transformed world, blithely talking of overpowering hooded cultists with his needle-gun, commandeering a military truck, speeding off to Amgando Park to sound the warning of the oncoming attack- Crazy. Utterly crazy. But perhaps it might just work, simply because it was so crazy. Nobody would be expecting two people to appear out of thin air down here in this peaceful bucolic setting and simply run off with a truck. They edged their way down the highway ramp, Theremon a short distance in the lead. A thickly overgrown field lay between them and the camp of the Apostles. \"Maybe,\" he whispered, \"if we get down and wriggle through the tall grass here, and a couple of the Apostles come wandering out this way for some reason, we can rise up and jump them before they know what\u0027s happening.\" He got down. He wriggled. Siferra went right after him, keeping pace. Ten yards. Twenty. Just keep going, head down and wriggle, over to that little knoll, and then wait-wait- A voice said suddenly, just behind him, \"What do we have here? A couple of peculiar serpents, is it?\" Theremon turned, looked, gasped. Gods! Apostles, seven or eight of them! Where had they come from? A private picnic in the field? Which he and Siferra had crawled right past, all unknowing? \"Run for it!\" he barked to her. \"You go this way-I\u0027ll go that-\" He began to sprint to his left, toward the towers that supported the highway. Maybe he could outrun them-disappear into the wooded country on the other side of the road- No. No. He was strong and fast, but they were stronger, faster. He saw them coming up alongside him. \"Siferra!\" he yelled. \"Keep going! Keep-going!\" Perhaps she had actually made it to safety. He couldn\u0027t see her now. The Apostles were all around him. He reached for his needle-gun, but one of them caught his arm immediately, and another got him by the throat. The gun was yanked from his hand. Legs poked between his, entangling him, tripping him. He fell heavily, rolled over, looked up. Five hooded faces, unsmiling, rigid, looked back. One of the Apostles had his own needle-gun aimed at his chest. \"Get up,\" the Apostle said. \"Slowly. With your hands in the air.\" Awkwardly Theremon stumbled to his feet. \"Who are you? What are you doing here?\" the Apostle demanded. \"I live around here. My wife and I were just taking a shortcut through these fields, back to our house-\" \"The nearest farm is five miles away. A very long shortcut.\" The Apostle gestured with a nod of his head toward the camp. \"Come with us. Folimun will want to talk to you.\" Folimun! So he had survived the night of the eclipse after all. And was in charge of the expedition against Amgando! Theremon glanced around. No sign of Siferra at all. He hoped she was back on the highway by now, heading for Amgando as fast as she could go. A slim hope, but the only one left. The Apostles marched him toward the camp. It was a weird sensation to be among so many hooded figures. Scarcely any of them paid attention to him, though, as his captors nudged him along, into the largest of the tents. Folimun was seated at a bench near the back of the tent, looking through a sheaf of papers. He turned his chilly blue eyes on Theremon and his thin, sharp face softened for an instant as a smile of surprise crossed it. \"Theremon? You here? What are you doing-covering us for the Chronicle?\" \"I\u0027m traveling south, Folimun. Taking a little holiday, since things are a little unsettled back in the city. Would you mind asking these thugs of yours to let go of me?\" \"Release him,\" Folimun said. -\"Where are you heading, exactly, eh?\" \"That\u0027s of no importance to you.\" \"Let me be the judge of that. Going to Amgando, are you, Theremon?\" Theremon offered the cultist a cold level stare. \"I don\u0027t see any reason why I should tell you anything.\" \"After all that I told you, when you interviewed me?\" \"Very funny.\" \"I want to know where you\u0027re heading, Theremon.\" Stall, Theremon thought. Stall him as long as you can. \"I decline to answer that question, or any other you might happen to have for me. I\u0027ll discuss my intentions only with Mondior himself,\" he said in a steady, determined tone. Folimun made no reply for a moment. Then he smiled again, a quick on-off. And then, suddenly, unexpectedly, he broke into actual laughter. Theremon wondered if he had ever seen Folimun laugh before. \"Mondior?\" Folimun said, his eyes glinting with amusement. \"There is no Mondior, my friend. There never was.\" It was hard for Siferra to believe that she had actually managed to escape. But that was indeed what appeared to have happened. Most of the Apostles who had surprised them in the field had gone after Theremon. Looking back once, she had seen them surrounding him like hunters\u0027 hounds surrounding their prey. They had knocked him down; he would certainly be captured. Only two of the Apostles had split off to pursue her. Siferra had jabbed one in the face, hard, with the flat of her hand at the end of her stiff outstretched arm, and at the speed she was traveling the impact had sent him reeling to the ground. The remaining one was fat and ungainly and slow; in moments Siferra left him far behind. She doubled back the way she and Theremon had come, toward the elevated highway. But it seemed unwise to go up onto it. The highway was too easily blocked, and there was no safe way down from it except at the exit ramps. She would only be putting herself at risk of running into a trap if she went up there. And even if no roadblocks lay ahead, it would be a simple thing for the Apostles to come after her in their trucks and pick her up, a mile or two down the way. No, the thing to do was to run into the woods on the far side of the road. The Apostles\u0027 trucks wouldn\u0027t be able to follow her there. She could lose herself easily enough in those low shrubby trees, and hide there until she had figured out her next move. And what could that be? she wondered. She had to admit that Theremon\u0027s idea, wild as it was, still was their only hope: steal a truck somehow, drive down to Amgando and sound the alarm before the Apostles could get their army on the move again. But Siferra knew there wasn\u0027t the remotest chance that she could simply tiptoe up to an empty truck, jump in, and drive it away. The Apostles weren\u0027t that stupid. She\u0027d have to order one of them at gunpoint to switch the truck on for her and surrender its controls to her. And that involved carrying out the whole bizarre maneuver of trying to overpower a stray Apostle, getting his robe, slipping into the camp, locating someone who could open up one of the trucks for her- Her heart sank. It was all too implausible. She might just as well consider trying to rescue Theremon while she was at it- go marching in with her needle-gun blazing, take hostages, demand his immediate release-oh, it was absolute foolishness, a silly melodramatic dream, a gaudy maneuver out of some cheap children\u0027s adventure book- But what will I do? What will I do? She huddled down in a copse of tightly woven little trees with long feathery leaves and waited for time to pass. The Apostles gave no sign of breaking camp: she could still see the smoke of their bonfire against the twilight sky, and their trucks were still parked where they had been along the road. Evening was coming on. Onos was gone from the sky. Dovim hovered on the horizon. The only suns overhead were her two least favorite ones, bleak and cheerless Tano and Sitha, casting their cold light from their distant location at the edge of the universe. Or what people had thought was the edge of the universe, rather, in those far-off innocent days before the Stars appeared and revealed to them just how immense the universe really was. The hours ticked interminably by. No solution to the situation made sense to her. Amgando seemed lost, unless someone else had managed to get a warning to them-certainly there was no way she was going to get down there ahead of the Apostles. Rescuing Theremon was an absurd idea. Her chances of stealing a truck and getting to Amgando by herself was only slightly less preposterous. What then? Simply sit back and watch while the Apostles took command of everything? There seemed to be no alternative. At one point during the evening she thought that the only path open to her was to walk into the Apostles\u0027 camp, surrender, and ask to be imprisoned with Theremon. At least they would be together then. It astonished her how much she missed him. They had not been out of each other\u0027s company in weeks, she who had never lived with a man in her life. And all during the long journey from Saro City, though they had bickered now and then, even quarreled a little, she had never tired of being with him. Not once. It had seemed the most natural thing in the world for them to be together. And now she was alone again. Go on, she told herself. Give yourself up. Everything\u0027s lost anyway, isn\u0027t it? It grew darker. Clouds veiled Sitha and Tano\u0027s frosty light, and the sky turned so dusky that she half expected the Stars to reappear. Go ahead, she thought bitterly. Come out and shine. Drive everyone crazy all over again. What harm can it do? The world can only be smashed once, and that\u0027s been done already. But the Stars, of course, did not appear. Veiled as they were, Tano and Sitha nevertheless afforded enough light to mask the glow of those distant points of mysterious brilliance. And as the hours went by, Siferra found herself swinging completely around from her mood of total defeatism to a new sense of almost reckless hope. When all is lost, she told herself, there\u0027s nothing left to lose. Under cover of this evening gloom she would slip into the Apostles\u0027 camp and-somehow, somehow-take one of their trucks. And rescue Theremon, too, if she could manage it. And then off to Amgando! By the time Onos was in the sky tomorrow morning, she\u0027d be down there, among her university friends, in plenty of time to let them know that they had to scatter before the enemy army arrived. All right, she thought. Let\u0027s go. Slowly-slowly-more cautiously than before, just in case they have sentries hidden in the grass- Out of the woods. A moment of uncertainty, there: she felt tremendously vulnerable, now that she had left the safety of that tangle of shrubbery behind. But the dimness still protected her. Across the cleared place, now, that led from the woods to the elevated highway. Under the great metal legs of the roadbed and into the unkempt field where she and Theremon had been surprised that afternoon. Get down and wriggle, now, the way they had before. Once again across the field-looking this way and that, scanning for sentries who might be on duty at the perimeter of the Apostles\u0027 camp- Her needle-gun was in her hand, set for minimum aperture, the sharpest, most highly focused, deadliest beam the gun could produce. If anyone came upon her now, so much the worse for him. There was too much at stake to worry about the niceties of civilized morality. While still half out of her mind she had killed Balik in the Archaeology lab, not meaning to, but he was dead all the same; and, a little to her surprise, she found herself quite ready to kill again, this time intentionally, if circumstances required it of her. The important thing was to get a vehicle and get out of here and carry the news of the Apostles\u0027 army\u0027s approach to Amgando. Everything else, including considerations of morality, was secondary. Everything. This was war. Onward. Head down, eyes raised, body hunched. She was only a few dozen yards from the camp now. It was very silent over there. Probably most of them were asleep. In the murky grayness Siferra thought she could see a couple of figures on the far side of the main bonfire, though the smoke rising from the fire made it difficult to be sure. The thing to do, she thought, was to slip into the deep shadows behind one of the trucks and toss a rock against a tree some distance away. The sentries would probably investigate; and if they fanned out separately, she could slip up behind one of them, jab the needler into his back, warn him to keep quiet, make him strip off his robe- No, she thought. Don\u0027t warn him of anything. Just shoot him, quickly, and take his robe, before he can call out an alarm. These are Apostles, after all. Fanatics. Her own newfound cold-bloodedness amazed her. Onward. Onward. She was almost at the nearest truck now. Into the darkness on the side opposite the campfire. Where\u0027s a rock? Here. Here, this is a good one. Shift the needler to the left hand for a moment. Now, toss the rock at that big tree over there- She raised her arm to make the throw. And in that moment she felt a hand seize her left wrist from behind and a powerful arm clamp across her throat. Caught! Shock and outrage and a jolt of maddening frustration went coursing through her. Furiously Siferra lashed out with her foot, kicking backward with all her strength, and connecting. She heard a grunt of pain. Not enough to break the man\u0027s strong grip, though. Twisting halfway around, she kicked again, and attempted at the same time to pass the needle-gun from her left hand to her right. But her assailant pulled her left arm upward in a short, sharp, agonizing gesture that numbed her and sent the needler spilling out of her hand. The other arm, the one that was pressing against her throat, tightened to choking intensity. She coughed and gasped. Darkness! Of all the stupidity, to let someone sneak up on her while she was sneaking up on them! Tears of rage burned her cheeks. In fury she kicked backward again, and then again. \"Easy,\" a deep voice whispered. \"You could hurt me that way, Siferra.\" \"Theremon?\" she said, astounded. \"Who do you think it is? Mondior?\" The pressure at her throat eased. The hand that clutched her wrist released its grasp. She took a couple of tottering steps forward, fighting for breath. Then, numb with confusion, she swung around to stare at him. \"How did you get free?\" she asked. He grinned. \"A holy miracle, it was. An absolute holy miracle. -I watched you the whole time, coming from the woods. You were very good, really. But you were concentrating so hard on getting here unnoticed that you didn\u0027t notice me circling around behind you.\" \"Thank all the gods it was you, Theremon. Even if you did give me the shock of my life when you grabbed me. -But why are we standing here? Quick, let\u0027s grab one of those trucks and clear out of here before they see us.\" \"No,\" he said. \"That isn\u0027t the plan any more.\" She gave him a blank look. \"I don\u0027t understand.\" \"You will.\" To her amazement he clapped his hands and called loudly, \"Over here, fellows! Here she is!\" \"Theremon! Are you out of your-\" The beam of a flashlight struck her in the face with an impact nearly as devastating as the one the Stars had had. She stood blinded, shaking her head in bewilderment and consternation. There were figures moving all around her, but it was another moment before her eyes adapted sufficiently to the sudden brightness for her to make them out. Apostles. Half a dozen of them. She glared accusingly at Theremon. He seemed calm, and very pleased with himself. Her dazed mind could barely begin to accept the awareness that he had betrayed her. When she tried to speak, nothing but blurted monosyllables would emerge. \"But-why?-what?-\" Theremon smiled. \"Come on, Siferra. There\u0027s someone I want you to meet.\" Folimun said, \"There\u0027s not really any need to glower at me like that, Dr. Siferra. You may have trouble believing it, but you are among friends here.\" \"Friends? You must think I\u0027m a very gullible woman.\" \"Not at all. Quite the contrary.\" \"You invade my laboratory and steal priceless research materials. You order your horde of berserk superstitious followers to invade the Observatory and wreck the equipment with which the university astronomers are trying to perform unique, essential research. Now you hypnotize Theremon into doing your bidding, and send him out to capture me and turn me over to you as a prisoner. And then you tell me that I\u0027m among friends?\" Theremon said quietly, \"I haven\u0027t been hypnotized, Siferra. And you aren\u0027t a prisoner.\" \"Of course not. And this is all just a very bad dream, too: Nightfall, the fires, the collapse of civilization, the whole thing. An hour from now I\u0027ll wake up in my apartment in Saro City and everything will be just the way it was when I went to sleep.\"","sourceLink":"https://allnovel.net/nightfall/page-26.html","bookId":1760,"book":{"id":1760,"title":"Nightfall","description":"Storyline: Nightfall by Isaac Asimov, Robert Silverberg Imagine living on a planet with six suns that never experiences Darkness. Imagine never having seen the Stars. Then, one by one your suns start to set, gradually leading you into Darkness for the first time ever. Image the terror of such a Nightfall. Scientists on the planet Kalgash discover that an eclipse - an event that occurs only every 2049 years - is imminent, and that a society unfamiliar with Darkness will be plunged into madness and chaos. They realize that their civilization will end, for the people of Kalgash have a proven fear of Darkness, but they are unable to predict the insanity and destruction that will accompany the awesome splendor of Nightfall. Based on the classic short story by Asimov, \"Nightfall\" is unabridged Bookcassette Audio at its best - a spellbinding tale of an alien civilization not unlike our own.","cover":"https://allnovel.net/images/nightfall.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/nightfall.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:22:36 AM"}}
