{"id":79815,"no":2,"title":"Page 2","content":"Pat shoots me a dirty look and then goes back to the engine. He’s got the hood popped open and he’s pitched forward between the headlights. A few of Pat’s friends are gathered around, watching him while pounding our dad’s beers. Their favorite way to spend a Monday afternoon. Pat asks Skeeter for a wrench, and then starts tapping it on something metallic. I come around behind my brother. “Maybe it’s the battery,” I say. “I think the radio turned off before it crapped out on me.” It happened this afternoon. I decided to skip eighth period and drive to Mary’s house. I wanted to check in on her, because I hadn’t seen her in the hallways. I bet she was still too shaken up after what happened at the dance to come to school. She was scared out of her mind that Reeve might be hurt. Poor thing. But I didn’t get far. The car died, right there in the school parking lot. My first thought was Is this karma? For all the pranks we pulled the last few weeks? I sure as shit hope not. Pat turns to reach for another tool and he nearly knocks me on my ass. “God, would you relax? Go smoke a cigarette or something.” I have been a little, um, skittish the last few days. I mean, who wouldn’t be, after what went down at homecoming? Never in a million years did I expect to see Reeve wheeled out on an ambulance stretcher. We wanted him kicked off the football team for getting caught high on drugs. We didn’t want him put in the hospital. I keep reminding myself that what happened at the dance wasn’t our fault. It was an electrical fire. The newspapers even said so. The explosions were what caused Reeve to freak out and fall off the stage. Not the drugs Lillia slipped in his drink. I’m sure it makes me sound like a terrible person, but facts are facts. And to be honest, the electrical fire was actually a blessing in disguise. Obviously, it sucks that people got hurt. A bunch of kids had to get stitches from the falling broken glass, a freshman boy had a burn on his arm from the sparks, and one of the older teachers got treated for smoke inhalation. But the electrical fire took the heat off us—pun intended. Reeve’s injury was just another casualty of the chaos. There’s no way he’d remember Lillia giving him the spiked drink, with all that was going on. At least that’s what I keep telling Lillia. Pat holds up the silver dipstick to his buddies and they shake their heads, like it’s some kind of travesty. “Geez, Kat! When’s the last time you checked the oil?” I roll my eyes. “Hey, Pat. Did you take my cigarettes?” “Maybe one or two,” he says sheepishly. Pat points over at his workbench. I go grab them, and of course my brand-new pack is empty. “You want a ride to the gas station?” Ricky asks me, helmet in his hand. “I need to fill up my bike anyway.” “Yeah. Thanks, Ricky.” As we walk out of the garage, Ricky puts his hand on the small of my back. Immediately I think of Alex Lind, and how he gallantly led Lillia out of the pandemonium to safety. I wish I hadn’t had to see that go down. Not that I’m jealous or anything. More like the corniness made my stomach hurt. I wonder if he was being nice, or if he actually is into her. Not that I care. As I climb on the back of Ricky’s bike, I inch up as close as I can to him, so we’re practically spooning. He turns his head around and says, in a low voice, “You’re killing me. You know that, right?” before flicking his helmet visor down. I can see my reflection in it, and I look pretty hot. I give him a wink and an innocent look. “Drive,” I order him. And he makes his engine growl for me. The truth is, if I want a guy, I can get him. Alex Lind included. The sun is setting on a gray sky, and the roads are mostly empty. This is what it’s like here on Jar Island come fall. More than half the population in summertime vanishes. There’ll be a few tourists that come in to geek out over foliage and stuff, but mostly it’s dead. A bunch of restaurants and shops are already closed down for the season. Depressing. I can’t wait until next year, when I’m living someplace else. Hopefully Ohio, hopefully in a sweet dorm at Oberlin. But I’ll live anywhere, so long as it’s not Jar Island. While Ricky gasses up his bike, I buy a fresh pack from the convenience store. Smokes are expensive. I should quit, save this money for college. When I turn back to the bike, I see the big hill that leads up to Middlebury. To Mary’s house. “Hey, Ricky, are you in a rush to get back?” He grins at me. “Where are we going?” I point the way to Mary’s house. No one answers the front door, not even her freaky aunt. There’s a ton of mail bursting out of the mailbox, and the lawn is mangier than Shep. I walk around the side and find a rock to toss up to the second floor. The lights are out in Mary’s bedroom, her curtains pulled shut. I check the other windows for signs of life. Every one is dark. The house looks . . . well, creepy. I let the rock fall out of my hand. I wish I could talk to Mary for just one second so I could ease her mind. She has nothing to feel sorry for. She shouldn’t feel bad for what happened. That a-hole got what he deserved, plain and simple. Hopefully now that our revenge stuff is all over and done with, Mary can move on with her life and not waste another second on Reeve Tabatsky. I’ve been crying for two straight days. I can’t eat; I can’t sleep. I can’t do anything. I hear Aunt Bette in the bathroom, washing her face and brushing her teeth. Her nightly routine. On her way to bed, she stops in my room. She has her robe cinched tight around her waist and a newspaper under her arm. I’m lying in a heap on my bed, staring at the ceiling. I can’t even bring myself to say good-night. Aunt Bette stands there, watching me for a second or two. Then she says, “There’s an article in the paper today.” She holds it up for me. The story above the fold is about the dance, the fire. There’s a picture of the gym, black smoke trickling out the windows, a stream of students pouring out the door. “They think it was electrical.” I roll away from her, toward the wall, because I don’t want to talk about homecoming. I don’t even want to think about it. I’ve already gone over it a million and one times in my head. How everything went so wrong. I was finally ready for him to see me that night, in my beautiful dress, proud and strong and changed. I had this idea of how it would go. Reeve, completely spaced out on the drugs we’d slipped him, would keep noticing me in the crowd. Something about me would seem familiar. He’d be drawn to me. He’d think I was beautiful.","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-2.html","bookId":2727,"book":{"id":2727,"title":"Fire with Fire (Burn for Burn #2)","description":"Storyline: When sweet revenge turns sour… Book two of a trilogy from New York Times bestselling author Jenny Han and Siobhan Vivian. Lillia, Kat, and Mary had the perfect plan. Work together in secret to take down the people who wronged them. But things didn’t exactly go the way they’d hoped at the Homecoming Dance. Not even close. For now, it looks like they got away with it. All they have to do is move on and pick up the pieces, forget there ever was a pact. But it’s not easy, not when Reeve is still a total jerk and Rennie’s meaner than she ever was before. And then there’s sweet little Mary…she knows there’s something seriously wrong with her. If she can’t control her anger, she’s sure that someone will get hurt even worse than Reeve was. Mary understands now that it’s not just that Reeve bullied her—it’s that he made her love him. Eye for an eye, tooth for a tooth, burn for a burn. A broken heart for a broken heart. The girls are up to the task. They’ll make Reeve fall in love with Lillia and then they will crush him. It’s the only way he’ll learn. It seems once a fire is lit, the only thing you can do is let it burn...","cover":"https://allnovel.net/images/fire-with-fire-burn-for-burn-2.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fire-with-fire-burn-for-burn-2.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:18:25 PM"}}
