{"id":79861,"no":49,"title":"Page 49","content":"“Kat! I need you!” It was my mom. A side effect none of us had expected was that Mom was now cranky as hell. She’d never been like that before. Everything seemed to bother her. How messy the house was getting, what Dad would make her to eat, the smells coming from Pat’s bedroom. I had always been Mom’s girl, her baby, but even I wasn’t immune. She flipped out when I put some special sweater of hers through the laundry.\\n\\n Honestly, I was a little afraid of her.\\n\\n “One sec!” I shouted upstairs. And then to Rennie I said, “Can you come over?” I hoped it was obvious in my voice. I didn’t want to be alone with my mom. I needed her.\\n\\n “Um . . .” I could hear her switching the phone from one ear to the other. “Actually, my mom needs my help with taking down some wallpaper. Sorry. I’ll call you later!”\\n\\n I was mad. I was so mad. But not at Rennie. At my mom. I blamed her for making my friend not want to come over, not Rennie for being a sucky friend. I trudged upstairs.\\n\\n Mom was in bed. Her eyes were slits. She’d kicked off all her blankets; she was sweating in the bed. “Can you please turn off the heat. I’m dying!”\\n\\n “Anything else?” I said it so bitchy. So incredibly bitchy.\\n\\n “No,” she said. “Sorry to bother you.” She said it sadly, which I knew was my opening to apologize. Instead I walked out and closed her door, hard.\\n\\n I blamed the wrong person. Not my mom. She was sick. She needed me. It was Rennie. And maybe if Rennie had been a better friend, maybe I would have had more patience. Taken better care of my mom that day. It’s unforgivable, really.\\n\\n I take the daisy, the one Rennie put in my locker, and I throw it into the garbage can. I don’t know if she’s still watching, but I hope to God she is.\\n\\n CHAPTER THIRTY-THREE\\n\\n Tuesday, I’m late leaving last period because our test goes long. I run straight to the pool, expecting to see Reeve in the water doing laps. But the pool’s empty; he’s not there. I wait for a few more minutes; then I go sit on the bleachers and text him.\\n\\n No pool today? :(\\n\\n Nah. I’m done with that.\\n\\n ??? Can’t talk now. I’m working at my dad’s office. Huh. What does that mean, he’s done? With what? With working out or with me? If we don’t swim today, I won’t get to spend any alone time with him before Thanksgiving break, because tomorrow’s a half day.\\n\\n I think fast. The only thing for me to do is go to him right now and ask him what he meant. Make a show of how much I care.\\n\\n I hightail it out of the gym and drive over to his dad’s office. It’s not far from school. It’s in a small building that looks like a colonial house. There’s a white-and-black sign that reads tabatsky property management out front.\\n\\n Reeve’s truck is parked out front, no other cars. I flip down my vanity mirror and dab on some lip gloss and fluff up my hair. Then I grab my purse, hop out of the car, and walk up to the building.\\n\\n Reeve’s sitting at a desk; there are keys all lined up in front of him, and he’s sorting through them. He looks up and starts to say, “Hi, can I help—” His eyes widen when he realizes it’s me. “What are you doing here?”\\n\\n “I was worried when you didn’t show,” I say. I scooch closer to him and perch on the edge of the desk, which is when I notice he’s not wearing his walking cast. “Oh my gosh! No more boot!”\\n\\n “Yeah. Earlier this afternoon.” Reeve keeps sorting keys, making piles, and not looking at me. And he doesn’t sound that happy about it.\\n\\n “So why the face? We should be celebrating! Pancakes on me.” I poke him in the side so he’ll finally look at me. “I knew all your hard work would pay off.”\\n\\n Flatly he says, “It didn’t.”\\n\\n “What? What do you mean?”\\n\\n Reeve stares straight ahead and says, “I asked Coach if he would time my sprints today. I was pumped to show him how much progress I was making in the pool, and I figured if I could win him over, he’d help me train and maybe make some phone calls for me to the scouts. Tell them I’m back on track, that I’ll be in fighting shape by the time spring workouts begin, and to save me a roster spot.” He clears his throat, like the words are getting stuck, and I feel my heart sink for him. “Well, it was a complete joke. I’m nowhere near where I used to be. I’m slower than the defensive line, and those guys weigh like three hundred–plus pounds. It’s over. I need to face facts, figure out what I’m going to do now. “\\n\\n “Wait. Maybe you won’t get the top programs, but I thought there were still a few D-three schools,” I begin. “Like what about Williams?”\\n\\n He shakes his head. “I’m not even good enough for a practice squad, Lillia. I’m done. My ass isn’t going to college. No football scholarship. I’m staying right here on the island.”\\n\\n I stay still and quiet as he tries to yank open a file drawer. It’s stuck, and he pulls on it so hard that the keys he’s organized slide together into a heap. Reeve’s face goes red; he looks like he’s going to cry or maybe punch a wall. “Fuck!” he yells.\\n\\n I jump in my seat and he shakes his head. “I’m sorry,” he says, and he lets out a choked sound. He’s crying. Reeve Tabatsky is crying.\\n\\n I’m not sure what to do. Rennie’s so good at comforting him, at saying all the right things. I’ve never been great at comforting people.\\n\\n “Don’t apologize,” I tell him. “You have nothing to be sorry for.”\\n\\n I’m the one who should be sorry. Next fall, Reeve should be a football god at a division one school, doing keg stands and hooking up with random girls. That’s his destiny. The thought of Reeve stuck here on the island, going to community college and living at home . . . it’s too sad to even think about.\\n\\n Reeve sinks back into his chair; he hangs his head in his hands, and his shoulders start to shake. He’s sobbing like a little boy. Meanwhile I keep my eyes on the floor.\\n\\n He gets quiet all of a sudden and he says, “Remember what you said to me on Halloween night?”\\n\\n You deserve everything you’re getting, because you’re a bad person.\\n\\n My stomach lurches. “Reeve, I was—”\\n\\n “No, you were right. I’m not a good guy, Lillia.” He wipes his eyes with the backs of his hands. “I did something to someone a long time ago. I hurt someone bad.”\\n\\n “Who?” I breathe. Mary. He has to be talking about Mary. \\n\\n","sourceLink":"https://allnovel.net/fire-with-fire-burn-for-burn-2/page-49.html","bookId":2727,"book":{"id":2727,"title":"Fire with Fire (Burn for Burn #2)","description":"Storyline: When sweet revenge turns sour… Book two of a trilogy from New York Times bestselling author Jenny Han and Siobhan Vivian. \\n Lillia, Kat, and Mary had the perfect plan. Work together in secret to take down the people who wronged them. But things didn’t exactly go the way they’d hoped at the Homecoming Dance. \\n Not even close. \\n For now, it looks like they got away with it. All they have to do is move on and pick up the pieces, forget there ever was a pact. But it’s not easy, not when Reeve is still a total jerk and Rennie’s meaner than she ever was before. \\n And then there’s sweet little Mary…she knows there’s something seriously wrong with her. If she can’t control her anger, she’s sure that someone will get hurt even worse than Reeve was. Mary understands now that it’s not just that Reeve bullied her—it’s that he made her love him. \\n Eye for an eye, tooth for a tooth, burn for a burn. A broken heart for a broken heart. The girls are up to the task. They’ll make Reeve fall in love with Lillia and then they will crush him. It’s the only way he’ll learn. \\n It seems once a fire is lit, the only thing you can do is let it burn...\\n","cover":"https://allnovel.net/images/fire-with-fire-burn-for-burn-2.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/fire-with-fire-burn-for-burn-2.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:18:25 PM"}}
