{"id":95167,"no":21,"title":"Page 21","content":"\"Sam, I want to see the kids more often.\"\n \"Why?\"\n \"Because I love them.\"\n \"Why?\"\n \"Because they\u0027re my kids, goddamn it.\"\n \"Sorry, but I\u0027m going to need more than that.\"\n \"Sam, I\u0027m warning you.\"\n \"Or what?\"\n \"Jesus, Sam. All I\u0027m asking is for you to let me see my kids - our kids - a little more. I only see them, what, every other week for a few hours. Supervised.\"\n \"You also happen to own a sleazy strip club and date even sleazier strippers.\"\n \"Hey,\" said Allison, looking up from her smart phone. \"I used to be a stripper.\"\n I covered the mouthpiece and lowered my voice. \"Were you sleazy?\"\n \"Sleazy, no. Good, yes.\"\n I rolled my eyes and uncovered the phone. \"So, you see my point, then,\" I said to Danny.\n \"I see that you\u0027re a controlling bitch.\"\n \"As always, nice talking to you, Danny.\"\n \"Wait, wait!\" he screeched as I made a move to hang up. \"Don\u0027t hang up. I\u0027m sorry.\"\n I didn\u0027t hang up, but I didn\u0027t say anything either. I looked out across the outdoor deck. So beautiful. This could have been a resort.\n \"You there, Sam?\"\n \"I\u0027m here.\"\n \"Sorry, I didn\u0027t mean that.\"\n \"Yes, you did.\"\n \"Okay, I did, but it\u0027s only because you\u0027re being a little unreasonable.\"\n \"Danny, I\u0027m going to say this with all the sincerity I can. I really don\u0027t give a shit what you think about me, but I do know one thing, and one thing only: until you sell that sleazebag of a strip club you own and quit bringing your skank-whores home, you will never, ever be alone with my kids.\"\n Someone from a nearby table looked over at me. Oops. I might have raised my voice a little.\n \"You can\u0027t tell me when I can or cannot see my kids.\"\n \"I can and I did.\"\n \"I\u0027m giving up the law firm, Sam.\"\n I snorted. \"To run the strip club full time?\"\n \"It\u0027s a lot of money, Sam. Easy money.\"\n \"You are choosing easy money over your kids. Strippers over your kids.\"\n \"You have it wrong, Sam. I don\u0027t date the girls.\"\n Just hearing the word \"girls\" made my skin crawl. \"No,\" I said, \"you just fuck them.\"\n \"You can\u0027t tell me what to do, Sam.\n Who to see and who not to see. How to live my life. How to make money.\"\n \"No, but I can tell you this.\"\n He sighed. \"What?\"\n \"You will never, ever be alone with my kids.\"\n And I clicked off the phone.\n Emphatically. \n","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-21.html","bookId":2136,"book":{"id":2136,"title":"Moon Island (Vampire for Hire #7)","description":"Storyline: \n Moon Island \n (Vampire for Hire #7) \n Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now in Moon Island, Samantha Moon is hired to look into the mysterious drowning of a super-rich hotel tycoon. The death occurred exactly one year ago, at the family\u0027s annual retreat on a private island in the Pacific Northwest. Now, as the family gathers again, Samantha Moon is asked to find a ruthless killer - all while a massive storm bears down upon the small island. But there\u0027s another storm brewing upon Skull Island, a storm of the supernatural kind. Sam is about to come face-to-face with evil incarnate...a monster who will stop at nothing to possess her completely - mind, body and soul - and destroy all that she loves.\n \n","cover":"https://allnovel.net/images/moon-island-vampire-for-hire-7.jpg","author":"J.R. Rain","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/moon-island-vampire-for-hire-7.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:12:13 PM"}}
