{"id":95172,"no":26,"title":"Page 26","content":"We were back at the bungalow. Allison had poured us two glasses of wine and now, once we had dried off and were in some warm clothing, we sat around the small dinette table that also afforded a view of both the back yard and the brick mansion beyond. Rain slanted nearly sideways across the window, like so many silver daggers. We both kept our eyes mostly on the big house. Allison was wearing a sweater and jeans and the thickest socks I\u0027d ever seen. \"What did you see, Sam?\" she asked me. Good question. I\u0027d been asking myself the same thing since we\u0027d left the house and dashed through the rain like two schoolgirls at recess. \"How good are you at seeing auras?\" I asked her. \"Pretty good, but not as good as you. You see details that I can\u0027t - heck, that I don\u0027t think even the best psychics can see. You know, you could make a lot of money as a psychic, Sammie. Just saying.\" \"I\u0027ll pass. So you didn\u0027t see anything unusual about any of the Thurmans\u0027 auras?\" \"Nothing that stood out, why?\" So, I told her about the shadowy ribbons, or ropes, that wove through all the Thurmans\u0027 auras like so many lassos. \"Through all of them?\" \"All,\" I said, and she must have caught my next thought. \"You mean all the blood relatives,\" \"Exactly.\" I gave her a glimpse of my own memory, so that she could see the shadows for herself. \"What is it?\" she said after a moment, her mouth hanging open. \"I don\u0027t honestly know.\" \"The black ropes appear to be...binding them,\" said Allison. \"Good point,\" I said. \"Like it\u0027s holding them hostage.\" I shuddered. Outside, a magnificent bolt of lightning appeared, rending the gray sky in two. The bolt could have come straight from Asgard, hurled from the mighty Thor himself. Or, if I was lucky, from Chris Hemsworth. The bolt was followed immediately by a clap of thunder so loud that Allison jumped. After a moment, she said, \"What the hell is going on, Sam?\" \"I don\u0027t know, kiddo. But there\u0027s more.\" Next, I told her about the change I\u0027d seen in Tara, and, subsequently, the change I\u0027d seen in Edwin. And not just changes of the physical kind, but within their auras. I showed her mental images as I spoke. Allison nodded along, even as she was looking a little pale. When I was finished, she said, \"Yeah, I thought our hostess was looking a little odd. All that freaky smiling. Thought maybe she\u0027d hit the mimosas a little early.\" \"I don\u0027t think so,\" I said. \"There\u0027s something else going on here.\" \"What? I\u0027ll admit, I\u0027m lost.\" I drummed my fingers on the table and watched as the back door to the big house opened and a woman emerged, a woman I wasn\u0027t surprised to see at all. She popped open an umbrella - which was promptly blown free from her hands, to tumble endlessly across the backyard. She seemed confused at first, then threw on her hood, and dashed across the big back yard. \"I think,\" I said, watching the sprinting figure, \"that the entity is body-hopping.\" \"Body-hopping?\" \"Or body-jumping, or whatever it\u0027s called.\" \"Do you have any idea how crazy that sounds, Sam?\" \"No more crazy than everything else.\" \"Good point. And this entity isn\u0027t just any entity, is it?\" she asked me. \"No,\" I said. \"It might just be the strongest of them all.\" \"And you know that how?\" \"Call it a hunch,\" I said. \"And there\u0027s something else?\" \"What?\" I nodded toward the window. \"We have company.\"","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-26.html","bookId":2136,"book":{"id":2136,"title":"Moon Island (Vampire for Hire #7)","description":"Storyline: Moon Island (Vampire for Hire #7) Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now in Moon Island, Samantha Moon is hired to look into the mysterious drowning of a super-rich hotel tycoon. The death occurred exactly one year ago, at the family\u0027s annual retreat on a private island in the Pacific Northwest. Now, as the family gathers again, Samantha Moon is asked to find a ruthless killer - all while a massive storm bears down upon the small island. But there\u0027s another storm brewing upon Skull Island, a storm of the supernatural kind. Sam is about to come face-to-face with evil incarnate...a monster who will stop at nothing to possess her completely - mind, body and soul - and destroy all that she loves.","cover":"https://allnovel.net/images/moon-island-vampire-for-hire-7.jpg","author":"J.R. Rain","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/moon-island-vampire-for-hire-7.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:12:13 PM"}}
