{"id":95153,"no":7,"title":"Page 7","content":"Two and half hours later, we landed at Sea-Tac Airport which, apparently, was right dab smack in the middle between Seattle and Tacoma.\\n\\n \"Get it?\" said Allison. \"Sea-Tac. As in Seattle and Tacoma.\"\\n\\n \"I get it,\" I said.\\n\\n \"Am I being annoying?\" she asked.\\n\\n \"Not yet,\" I said sweetly, as we stepped out into the chilled Pacific Northwest air. \"But you\u0027re getting there.\"\\n\\n \"Most of my friends say I can be annoying.\"\\n\\n \"You have honest friends,\" I said, keeping a straight face.\\n\\n \"That was rude, Samantha Moon.\" But she laughed anyway.\\n\\n Almost immediately, a shiny Lexus SUV whipped out of the pack of circling cars and pulled up next to us. I recognized the driver. My client, Tara Thurman.\\n\\n \"Wow,\" said Allison, peeking through the passenger side window. \"She looks just like her mom.\"\\n\\n \"You know her mom?\" I asked as Tara stepped out. I had researched the family and knew that Tara\u0027s mother had once been a fairly well-known model, and her father was currently the vice president of the family business. A business which just so happened to be one of the biggest hotel brands in the world. A business started by the great-grandfather nearly a hundred years ago.\\n\\n \"Of course,\" said Allison. \"Everyone knows of her mom. At least, everyone down at the shop.\"\\n\\n I wasn\u0027t sure which \"shop\" she was referring to, and before I could ask, Tara was already coming toward us. She certainly did not inherit her mother\u0027s stature nor build. Like I said, she was shaped more like me. Short and a little curvy.\\n\\n Earlier, Tara had agreed to allow Allison to join me as my assistant. I was certain she wouldn\u0027t agree, but Allison had seemed confident that Tara would. To my surprise, my client had indeed agreed, telling me that, although these yearly reunions were generally for family, sometimes friends or significant others did join in.\\n\\n I introduced the two, and we all climbed in. I took the front seat and Allison the back, and as the SUV pulled away, Allison leaned forward through the seats and said, \"So, is the Space Needle really a needle?\"\\n\\n \"Okay,\" I said. \"Now you\u0027re being annoying.\"\\n\\n * * *\\n\\n As the 5 Freeway wended and twisted its way through the tree-lined suburbs outside of Seattle, Tara, Allison and I had a crash course in friendship.\\n\\n According to Tara, no one was to know that I was a private eye, or that Allison was my assistant. This wasn\u0027t a murder investigation. Not officially. This was a family reunion, on a remote island, during which I would pretend to be a friend, although I would be secretly snooping my ass off.\\n\\n Luckily, I\u0027m damn good at snooping my ass off.\\n\\n We decided to give me a fake name, too. After all, it wouldn\u0027t do having a nosy family member Googling my name and finding my agency\u0027s website. So, we decided that being old college chums was best, chums who\u0027d recently met again in Seattle and were only now catching up.\\n\\n Allison was my visiting friend, who got invited along for the weekend getaway.\\n\\n So, we spent the remainder of the time in the SUV boning up on Tara\u0027s college. It turned out she\u0027d gone to UCLA, and graduated with a degree in psychology. I was going to pretend to be a college dropout. Allison pointed out that someone with enough snooping skills could verify that I, in fact, never went to UCLA. So, we decided to give me a very generic name.\\n\\n Samantha Smith.\\n\\n In fact, being Samantha Smith for a three-day weekend might just be a welcome relief.\\n\\n And maybe a little fun.\\n\\n Especially as we approached the glittering emerald city, whose skyline matched the beauty of any skyline anywhere, and as we did, I received a text message from my son.\\n\\n Tammy\u0027s reading my mind again, Mom.\\n\\n I sighed and dashed off a quick text to my daughter: Quit reading your brother\u0027s mind, booger butt. And make sure you do your homework. \\n\\n","sourceLink":"https://allnovel.net/moon-island-vampire-for-hire-7/page-7.html","bookId":2136,"book":{"id":2136,"title":"Moon Island (Vampire for Hire #7)","description":"Storyline: Moon Island \\n (Vampire for Hire #7) \\n Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now in Moon Island, Samantha Moon is hired to look into the mysterious drowning of a super-rich hotel tycoon. The death occurred exactly one year ago, at the family\u0027s annual retreat on a private island in the Pacific Northwest. Now, as the family gathers again, Samantha Moon is asked to find a ruthless killer - all while a massive storm bears down upon the small island. But there\u0027s another storm brewing upon Skull Island, a storm of the supernatural kind. Sam is about to come face-to-face with evil incarnate...a monster who will stop at nothing to possess her completely - mind, body and soul - and destroy all that she loves.\\n","cover":"https://allnovel.net/images/moon-island-vampire-for-hire-7.jpg","author":"J.R. Rain","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/moon-island-vampire-for-hire-7.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:12:13 PM"}}
