{"id":872,"no":9,"title":"Chapter VII","content":"Crossing of the Indus. When Buddhism First Crossed the River for the East \n \n The travellers went on to the south-west for fifteen days (at the foot of the mountains, and) following the course of their range. The way was difficult and rugged, (running along) a bank exceedingly precipitous, which rose up there, a hill-like wall of rock, 10,000 cubits from the base. When one approaches the edge of it, his eyes become unsteady; and if he wished to go forward in the same direction, there was no place on which he could place his foot; and beneath where the waters of the river called the Indus.1 In former times men had chiselled paths along the rocks, and distributed ladders on the face of them, to the number altogether of 700, at the bottom of which there was a suspension bridge of ropes, by which the river was crossed, its banks being there eighty paces apart.2 The (place and arrangements) are to be found in the Records of the Nine Interpreters,3 but neither Chang K’een4 nor Kan Ying5 had reached the spot. \n \n The monks6 asked Fa-hien if it could be known when the Law of Buddha first went to the east. He replied, “When I asked the people of those countries about it, they all said that it had been handed down by their fathers from of old that, after the setting up of the image of Maitreya Bodhisattva, there were Sramans of India who crossed this river, carrying with them Sutras and Books of Discipline. Now the image was set up rather more than 300 years after the nirvana7 of Buddha, which may be referred to the reign of king P’ing of the Chow dynasty.8 According to this account we may say that the diffusion of our great doctrines (in the east) began from (the setting up of) this image. If it had not been through that Maitreya,9 the great spiritual master10 (who is to be) the successor of the Sakya, who could have caused the ‘Three Precious Ones’11 to be proclaimed so far, and the people of those border lands to know our Law? We know of a truth that the opening of (the way for such) a mysterious propagation is not the work of man; and so the dream of the emperor Ming of Han12 had its proper cause.” \n \n \n","sourceLink":"http://novel.tingroom.com/zongjiao/1277/38620.html","bookId":32,"book":{"id":32,"title":"A Record of Buddhistic Kingdoms 佛都记录","description":"简介： A recording of the Chinese Buddhist monk\u0027s travels to bring Buddhist scriptures to India and Sri Lanka between 399 and 412AD....","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/1277","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
