{"id":38857,"no":9,"title":"VIII. THE HAPPENINGS OF A NIGHT.","content":"When Aaron and those who were with him reached the lot fence, which had been made high and strong to keep old Jule, the jumping mule, within bounds, not a sound was heard on the other side. \"You er takin\u0027 yo\u0027 life in yo\u0027 han\u0027, mon,\" said Randall in a warning tone, as Aaron placed one foot on the third rail and vaulted over. The warning would have come too late in any event, for by the time the words were off Randall\u0027s tongue Aaron was over the fence. Those who were left behind waited in breathless suspense for some sound—some movement—from Timoleon, or some word from the Arab, to guide them. But for a little while (and it seemed to be a long, long while to Little Crotchet) nothing could be heard. Then suddenly there fell on their strained ears the noise that is made by a rushing horse, followed by a sharp exclamation from Aaron. [149] \"What a pity if he is hurt!\" exclaimed the Teacher. Before anything else could be said, there came a whinnying sound from Timoleon, such as horses make when they greet those they are fond of, or when they are hungry and see some one bringing their food. But Timoleon\u0027s whinnying was more prolonged, and in the midst of it they could hear Aaron talking. \"Ef horses could talk,\" remarked Randall, \"I\u0027d up \u0027n\u0027 say dey wuz ca\u0027n on a big confab in dar.\" Little Crotchet said nothing. He had often heard Aaron say that he knew the language of animals, but the matter had never been pressed on the lad\u0027s attention as it was years afterwards on the attention of Buster John and Sweetest Susan. Finally Aaron came to the fence, closely followed by the Black Stallion. \"Man, what you think?\" said the Son of Ben Ali to Randall; \"no water, no corn, no fodder since night before last.\" \"De Lord \u0027a\u0027 mercy!\" exclaimed Randall. \"Is anybody ever hear de beat er dat? No wonder[150] he kotch dat ar nigger an\u0027 bit \u0027im! When de rascal git well I\u0027m gwine ter ax Marster ter le\u0027 me take \u0027im out an\u0027 gi\u0027 \u0027im a paddlin\u0027—an\u0027 I\u0027ll do it right, mon.\" Mr. Hudspeth made a mental note of this speech, and resolved to find out if Randall meant what he said, or was merely joking. \"Man, give me the Little Master,\" said Aaron from the top of the fence, \"and run and fetch two buckets of water from the spring.\" \"Dey\u0027s water in de lot dar,\" Randall explained. \"It is dirty,\" replied Aaron. \"The grandson of Abdallah would die before he would drink it.\" He leaned down and took Little Crotchet in his arms. The muzzle of Timoleon was so near that the lad could feel the hot breath from his nostrils. Involuntarily the Little Master shuddered and shrank closer to Aaron. \"He\u0027ll not hurt you,\" said Aaron. He made a queer sound with his lips, and the horse whinnied. \"Now you may put your hand on him—so.\" The Arab took the Little Master\u0027s hand and placed it gently on the smooth, sensitive[151] muzzle of the horse. The lad could feel the nervous working of Timoleon\u0027s strong upper lip. Then he stroked the horse\u0027s head and rubbed the velvety ears, and in less time than it takes to write it down he felt very much at home with the Black Stallion, and had no fear of him then or afterwards. Randall soon returned with cool, fresh water from the spring. The Black Stallion drank all that was brought and wanted more, but Aaron said no. He had placed the Little Master on Randall\u0027s shoulder, and Timoleon, when he finished drinking, was taken to his stable and fed, and the broken door propped in such a manner that it could not be forced open from the inside. This done, Aaron returned to the others, relieved Randall of Little Crotchet, though the frail body was not much of a burden, and the three started back to the big house. \"You are still anxious to punish the poor man who was hurt by the horse?\" asked the Teacher, as Randall bade them good-night. \"I is dat, suh. I\u0027m des ez sho ter raise welks on his hide ez de sun is ter shine—leas\u0027ways ef breff stay in his body. Ef I\u0027d \u0027a\u0027 been dat ar[152] hoss an\u0027 he\u0027d done me dat away, I\u0027d \u0027a\u0027 trompled de gizzard out \u0027n \u0027im. Ef dey\u0027s anything dat I do \u0027spise, suh, it\u0027s a low-down, triflin\u0027, good-fer-nothin\u0027 nigger.\" Mr. Hudspeth knew enough about human nature to be able to catch the tone of downright sincerity in the negro\u0027s voice, and the fact not only amazed him at the time, but worried him no little when he recalled it afterward; for his memory seized upon it and made it more important than it really was. And he saw and noted other things on that plantation that puzzled him no little, and destroyed in his own mind the efficiency of some of his strongest anti-slavery arguments; but it did not, for it could not, reach the essence of the matter as he had conceived it, that human slavery, let it be national or sectional, or paternal and patriarchal, was an infliction on the master as well as an injustice to the negro. So far so good. But Mr. Hudspeth could not see then what he saw and acknowledged when American slavery was happily a thing of the past, namely: That in the beginning, the slaves who were brought here were redeemed from a slavery in their own country worse than the bondage of[153] death; that though they came here as savages, they were brought in close and stimulating contact with Christian civilization, and so lifted up that in two centuries they were able to bear the promotion to citizenship which awaited them; and that, although this end was reached in the midst of confusion and doubt, tumult and bloodshed, it was given to human intelligence to perceive in slavery, as well as in the freedom of the slaves, the hand of an All-wise Providence, and to behold in their bondage here the scheme of a vast university in which they were prepared to enjoy the full benefits of all the blessings which have been conferred on them, and which, though they seem to have been long delayed, have come to them earlier than to any other branch of the human race. The Teacher who played his little part in the adventures of Aaron played a large part in national affairs at a later day. He saw slavery pass away, and he lived long enough after that event to put on record this declaration: \"Looking back on the history of the human race, let us hasten to acknowledge, while the acknowledgment may be worth making, that two hundred and odd[154] years of slavery, as it existed in the American republic, is a small price to pay for participation in the inestimable blessings and benefits of American freedom and American citizenship.\" And as he spoke, the great audience he was addressing seemed to fade before his eyes, and he found himself wandering again on the old plantation with Little Crotchet, or walking under the starlit skies talking to Aaron. And he heard again the genial voice of the gentleman whose guest he was, and lived again through the pleasures and perils of that wonderful year on the Abercrombie place. But all this was twenty-five years in the future, and Mr. Hudspeth had not even a dream of what that future was to bring forth. Indeed, as he followed Aaron and Little Crotchet from the horse lot to the house he was less interested in what the years might hold for him than he was in one incident that occurred while Aaron was preparing to take the Black Stallion back to his stall. He was puzzled and wanted information. How did Aaron know that the horse had gone without water and food? He observed that neither Little Crotchet nor Randall questioned the[155] statement when it was made, but treated it as a declaration beyond dispute. And yet the runaway had been in the woods, and a part of the time was pursued by hounds. He had no means of knowing whether or not the Black Stallion had been attended to. The matter weighed on the Teacher\u0027s mind to such an extent that when he and his companions were safe in Little Crotchet\u0027s room he put a question to Aaron. \"By what means did you know that the horse had been left without food and water?\" Aaron glanced at Little Crotchet and smiled. \"Well, sir, to tell you would be not to tell you. You wouldn\u0027t believe me.\" \"Oh, you go too far,—indeed you do. Why should I doubt your word?\" \"It don\u0027t fit in with things you know.\" \"Try me.\" \"The grandson of Abdallah told me,\" replied Aaron simply. The Teacher looked from Aaron to Little Crotchet. \"You must be joking,\" he remarked. \"Oh, no, he isn\u0027t,\" protested Little Crotchet. \"I know he can talk with the animals. He has[156] promised to teach me, but I always forget it when I go to the Swamp; there are so many other things to think about.\" \"Would you teach me?\" Mr. Hudspeth asked. His face was solemn, and yet there was doubt in the tone of his voice. Aaron shook his head. \"Too old,\" he explained. \"Too old, and know too much.\" \"It\u0027s another case of having a child\u0027s faith,\" suggested the Teacher. \"Most, but not quite,\" answered Aaron. \"It is like this: The why must be very big, or you must be touched.\" The Teacher pondered over this reply for some moments, and then said: \"There must be some real reason why I should desire to learn the language of animals. Is that it?\" \"Most, but not quite,\" Aaron responded. \"You must have the sure-enough feeling.\" \"I see. But what is it to be touched? What does that mean?\" \"You must be touched by the people who live next door to the world.\" The Teacher shook his head slowly and stroked his beard thoughtfully. He tried to treat the[157] whole matter with due solemnity, so as to keep his footing, and he succeeded. \"Where is this country that is next door to the world?\" he asked, turning to Little Crotchet. \"Under the spring,\" the lad replied promptly. \"Have you ever visited that country?\" the Teacher asked. His tone was serious enough now. \"No,\" replied Little Crotchet, with a wistful sigh. \"I\u0027m crippled, you know, and walk only on my crutches. It is far to go, and I can\u0027t take my pony. But Aaron has told me about it, and I have seen Little Mr. Thimblefinger—once—and he told me about Mrs. Meadows and the rest and brought me a message from old Mr. Rabbit. They all live in the country next door to the world.\" For several minutes the Teacher sat and gazed into the pale flame of the candle. The wax or tallow had run down on one side, and formed a figure in the semblance of a wee man hanging to the brass mouth of the candlestick with both hands. Glazing thus, queer thoughts came to the Teacher\u0027s mind. He tugged at his beard to see whether he was awake or dreaming. Could it be[158] that by some noiseless shifting of the scenery he was even now in the country next door to the world? He rose suddenly, shook hands with Aaron, and, swayed by some sudden impulse, stooped and pressed his lips to the pale brow of the patient lad. Then he went to his room, threw open the window, and sat for an hour, wondering what influence his strange experiences would have on his life. And his reflections were not amiss, for years afterwards his experiences of this night were responsible for his intimacy with the greatest American of our time,—Abraham Lincoln. It was in the early part of the war that Mr. Hudspeth, one of a group of congressmen in consultation with the President, let fall some chance remarks about the country next door to the world. Mr. Lincoln had been telling a humorous story, and was on the point of telling another, when Mr. Hudspeth\u0027s chance remark struck his ear. \"Whereabouts is that country?\" he asked. \"Not far from Georgia,\" replied Mr. Hudspeth. \"Who lives there?\" \"Little Crotchet, Aaron the Arab, Little Mr.[159] Thimblefinger, Mrs. Meadows, and old Mr. Rabbit.\" Mr. Hudspeth counted them off on his fingers in a humorous manner. Mr. Lincoln, who had been laughing before, suddenly grew serious—melancholy, indeed. He talked with the congressmen awhile longer, but they knew by his manner that they were dismissed. As they were leaving, the President remarked:— \"Wait till your hurry\u0027s over, Hudspeth; I want to talk to you.\" And sitting before the fire in his private office, Mr. Lincoln recalled Mr. Hudspeth\u0027s chance remark, and questioned him with great particularity about Aaron and Little Crotchet and all the rest. \"Of course you believed in the country next door to the world?\" Mr. Lincoln suggested. \"To tell you the truth, Mr. President, I felt queerly that night. It seemed as real to me as anything I ever heard of and never saw.\" \"Get the feeling back, Hudspeth; get it back. I can believe everything you told me about it.\" And after that, when Mr. Hudspeth called on the President, and found him in a mood between extreme mirth and downright melancholy, he[160] would say: \"I was with Aaron last night,\" or \"I\u0027m just from the country next door to the world,\" or \"I hope Sherman won\u0027t get lost in the country that is next door to the world.\" But all this was in the future, and, as we all know, Mr. Hudspeth, sitting at his window and gazing at the stars that hung sparkling over the Abercrombie place, could not read the future. If it was too late for him to learn the language of the animals, how could he hope to interpret the prophecies of the constellations? Aaron sat with Little Crotchet until there was no danger that the red goblin, Pain, would put in an appearance, and then he slipped through the window, and was soon at the foot of the oak, where Rambler was taking a nap. He gave the dog some of the food that Little Crotchet had put by for him, ate heartily himself, and then went toward the Swamp. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2801/77475.html","bookId":550,"book":{"id":550,"title":"Aaron in the Wildwoods","description":"简介： Once upon a time there lived on a large plantation in Middle Georgia a boy who was known as Little Crotchet. It was a very queer name, to be sure, but it seemed to fit the lad to a T. When he was a wee bit of a chap he fell seriously ill, and when, m...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2801","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
