{"id":18498,"no":35,"title":"CHAPTER XXXIV THE END","content":"SIX years after, on the terrace of the Casino at Biarritz, Quentin was listlessly smoking a cigar. They were playing La Fille de Madame Angot, and the seducing music and the warm autumn air, made him sleepy. Upon the table before him was the liste rose of an hotel; and among the names of dukes and marquises could be seen: “Quentin García Roelas, Deputy, Madrid.” This made Quentin smile as at the memory of a childish vanity. Quentin’s face had changed, especially as to expression; he was no longer a boy; a few wrinkles furrowed his forehead, and crows’ feet were beginning to appear at the corners of his eyes. For six years the quondam dare-devil had displayed a tireless activity. He went from triumph to triumph. During Amadeo’s reign, he had made his father a marquis; he had amassed a considerable fortune by his operations in the Bourse; and if his political position was not greater, it was because he was keeping quiet, waiting for an Alphonsist or Carlist situation. And yet, in spite of his successes and his triumphs, his heart was empty. He was thirty-two years old. He could continue the brilliant career he had won for himself, could become a minister, and enter aristocratic[344] society; but all this held no enchantment for him. In the bottom of his heart he realized that he was growing ill-natured. Biarritz bored him frightfully. “Perhaps the best thing for me to do would be to take an extended voyage,” he thought. With this idea in mind he got up from his chair, left the Casino, and went for a walk along the beach. He was standing near the Place Bellevue watching the sea, when he heard a voice that made him tremble. It was Rafaela, Rafaela herself, with two children clinging to her hands, and another carried by a nurse and protected by a parasol. Quentin went over to her. They greeted each other emotionally. Rafaela was scarcely recognizable; she had taken on flesh and looked extremely healthy; she dressed very elegantly. The only thing that she retained of her former appearance was her sweet, gentle eyes, clear and blue. Her smile was now motherly. Rafaela and Quentin talked for a long time. She told him of her great grief over the illness of her children. One had died; fortunately the other two children had become stronger, thanks to the open air; and the little girl, the baby at breast, promised to be very strong. “And Remedios?” asked Quentin. “Remedios!” exclaimed Rafaela. “You don’t know how provoked I am with her.” “Why?” “Because she has an impossible nature. She will not yield to anything.” “Yes, even as a child one could see that she had a will of her own.” “Well, she has a much greater one now. She has[345] hated my husband and my mother-in-law from the very first; and they have done all in their power to please her and spoil her ... but no.” “She is terrible,” said Quentin with a smile. “We wanted to bring her here, and then to Paris; but at the last minute she refused to come. Then, you see, she is twenty-two years of age, and most attractive; she could marry very easily, for she has suitors,—rich boys with titles; but she will have none of them. She has too much heart. I tell her that one cannot be like that in life; one must conceal one’s antipathies, and moderate one’s affections, somewhat.... Doing as Remedios does exposes one to much suffering.” “And yet, isn’t it almost better to deceive one’s self than to find out the truth, at the cost of withering one’s heart little by little?” “I think it is better to know the truth, Quentin.” “I don’t know about that. You are as discreet as ever, Rafaela.” “No, I am much more practical than I was. But you, too, have lost something.” “It’s true,” said Quentin with a sigh. At this moment an elegantly dressed gentleman, with a white waistcoat and grey gloves, presented himself. “Don’t you know each other? My husband ... Quentin, our relative.” The two men shook hands, and they and Rafaela sat down upon a rock while the children played in the sand. Quentin was astonished at the change in Juan de Dios. The rude, coarse lad had been metamorphosed into a correct and polished gentleman with Parisian manners. There was no reminder of the Cordovese gawk.[346] Juan de Dios spoke pleasantly; Quentin could see that he was dominated by his wife, because every minute or two he glanced at her as if begging her approval of what he was saying. She encouraged him with a gesture, with a look, and he continued. He spoke of the situation into which the Republicans had led Spain, of the factious parties that were organizing on the frontier.... Quentin did not listen to him, as he was thinking about Remedios; that little wilful child, so big-hearted, who despised her suitors. In the midst of their chat, he asked Rafaela: “Where is Remedios now?” “On one of our farms, near Montoro.” “I’m going to write to her.” “Yes, do,” said Rafaela; “you don’t know how happy she would be. She attaches great importance to those matters. She thinks of you very often. She has read every one of the speeches you made in the Cortes.” “Really?” asked Quentin with a laugh. “Yes, really,” replied Juan de Dios. “What address shall I put on the letter?” “Just Maillo Farm, Montoro.” Quentin waited a moment while he formulated a plan; then he exchanged a few phrases of farewell with Rafaela and her husband, and went to his hotel. He had decided to take the train and go in search of Remedios. Why not attempt it? Perhaps she had thought about him since childhood. Perhaps that was why she rejected her suitors. Yes, he must try it. He ordered his baggage packed, boarded the train, and in a few moments got off at San Juan de Luz.[347] “There’s no sure way of crossing to Burgos without getting into trouble,” they told him at the station. “What can I do?” “Take ship to Santander, and go from there to Madrid by rail.” He did this, and the next day, without stopping, he took the train for Andalusia. He descended at Montoro in the morning, hired a horse, asked the direction of the Maillo farm, and immediately left town. It was a foggy October day. It began to sprinkle. Eight years before Quentin had come to that country on his return from school, on a morning that was also drizzly and sad. What a wealth of energy and life he had spent since then! True, he had conquered, and was on the road to being a somebody, but—what a difference between the triumph as he had looked forward to it, and the same triumph as he looked back upon it! It was best not to remember, nor to think—but just to hope. Ahead of him, along the misty horizon, he could see a line of low convex hills. Quentin had been told that he must go toward them, and in that direction he went at the slow pace of his horse. The road wound in and out, tracing curves in the level country between fields of stubble. Here and there yokes of huge oxen tilled the dark soil; magpies skimmed along the ground; and overhead, flocks of birds like triangles of black dots, flew screeching by. At this point a man mounted on a horse appeared in the road. He carried a long pike, with the point up and the butt supported by his stirrup, like a lance. He[348] signalled Quentin to get to one side of the road. As he did so, several bulls and bell-oxen rushed past. Behind them rode two garrochistas or bull-stickers on horseback, each with a pike held in the middle and balanced horizontally. “The peace of God be with you, Se?ores,” said Quentin. “Good morning, caballero.” “Am I taking the right direction for the Maillo farm?” “Sí, Se?or; you are right.” “Thanks very much.” Quentin continued his way. Just before he reached the somewhat hilly country, a farmhouse appeared before his eyes. He went up to it, riding his horse across a red field which had been converted into a mud-hole by the rain. “Hey!” he shouted. An old man appeared in the doorway; he wore a pair of black leather overalls adorned with white bands, and fastened at the knee by clasps. “Is this the Maillo farm?” asked Quentin. “No, Se?or. This is the Las Palomas farm, which is owned by the same man. Do you see that hill with the trees on it? When you pass that you can see the farm.” Quentin thanked him and urged on his horse. A drizzly rain was falling. Among the distant trees, which were yellow and nearly bare of leaves, flowed a bluish mist. From the top of the hill he could see an enormous valley divided into rectangular fields; some still covered with stubble, others black with recently tilled soil,[349] and some that were beginning to turn green. In the middle of it all, like dark and barren islands, were small hills covered with olive orchards; in the distance horses were grazing in huge pastures. Quentin had stopped for a moment on the top of the hill, hesitating, not knowing which road to take, when he heard behind him a tinkling of bells, and then a voice shouting: “Arre, Liviano! Arre, Remendao!” It was a youth mounted on the haunches of a donkey, with his feet nearly touching the ground, and leading an ass laden with a pannier by the halter. “The Maillo farm?” asked Quentin. “Are you going there? So am I.” The boy began to talk, and chatting like old friends, they reached the farm. It was a huge place, with a very large fence that enclosed all the departments and apparatus of the house. Inside was a chapel with a cross and weather-vane. “Who can tell me where Se?orita Remedios is?” asked Quentin. “Call the manager.” The manager was not in, and he had to wait. At last a man of some forty years came toward him; he was powerfully built, and round-faced. Learning Quentin’s wishes, he pointed to a garden with a little gate at one end of it. Quentin knocked, the gate was opened to him, and an old woman appeared on the threshold. “Is Se?orita Remedios in?” “It’s you!” exclaimed the old woman. “How glad the child will be! Come in, come in!” “You are Rafaela’s nurse, are you not?” asked Quentin.[350] “Sí, Se?or.” They crossed a patio and entered an immense kitchen with a cooking-stove in one corner. Near the fire was a little old man with white hair. “Don’t you know him?” said she who had opened the door. “It is Juan, the gardener of the other house. Juan!” she cried, “Se?orito Quentin has come!” The old man arose and seizing Quentin’s hand, held it between his for some time. “I cannot see well. I’m getting blind and deaf.” And Juan burst out laughing. “You must be getting on in years, eh?” “Seventy-five. Ha! ha! Sit down here and dry yourself a bit. The little girl will be here soon. It’s a long time since you have seen her, isn’t it?” “Six years.” “Well, she’s a beauty!... A lily! And then, so affectionate! If you could see her! She is teaching the children of all the farm hands to read and to sew.” “So you are here with her, Juan?” “Sí, Se?or, always with her. All my children are on the place. That’s what you ought to do. Se?orito: come and live here.” “If I only could,” sighed Quentin. As they were conversing, the door opened, and Remedios came running in. Quentin rose to his feet and stared at her in surprise. “It’s Quentin!” she cried. “That’s who it is!” “At last you have come,” she added, and held out her hand. “What are you looking at me like that for? Have I changed so very much?” “Yes, very much.[351]” She was charming in her white dress, which clung to her graceful figure and well-rounded hips. There was a gracious smile on her lips, and her black eyes were shining. “You are just the same,” she said. “Yes, the same—but older. I saw Rafaela and Juan de Dios in Biarritz. They told me you were here.” “And you came here immediately?” “Yes.” “Very well done. Let’s go to the dining-room. I am now the mistress of the house.” They went into the dining-room. It was a large whitewashed room, with blue rafters in the ceiling, and a large, unpolished cabinet for the table-service. In the centre was a heavy table of oak, with a white oil-cloth cover, in the middle of which was a glass vase full of flowers. Near the window was an embroidery frame, and a small wicker basket full of balls of coloured yarn. “Come, sit down,” said she. “They’ll set the table presently. Why do you look at me so much?” “You are changed, child; but changed for the better.” “Really?” “Yes, really; you no longer have that restless look.” A young girl set the table, and Remedios and Quentin sat down. Remedios talked of her life, a most simple one. “I’ve already heard that you are giving lessons to the children,” said Quentin. “Does that entertain you?” “Very much. They are all such clever little creatures!” After dinner, the old servant showed Quentin to a large room with an alcove. He sat down in an armchair,[352] preoccupied. The presence of Remedios had produced a most unusual effect upon him. He felt attracted to her as he had never felt attracted to any other woman. At the same time he was restrained by a feeling of humility; not because she was an aristocrat and he wasn’t, nor because she was young and pretty, and he was already growing old; but because he realized that she was good. “If this visit turns out well,” he thought, “how glad I shall be that I came! But if it does not turn out well, my life will be ruined.” Quentin arose and paced the room for over an hour. He gazed at the Carmen Virgin, with her bead-work shawl, that stood upon the walnut dressing-table; he looked absent-mindedly at the coloured lithographs on the wall, of which some represented scenes from the novel “Matilde, o las Cruzadas,” and others, scenes from “Paul et Virginie.” “I must speak to Remedios immediately,” he thought. Having made up his mind, with beating heart he went to look for her. She was sewing in the dining-room. Quentin seated himself and began to talk on different subjects. “When are you going to marry?” Quentin suddenly asked her. “How do I know?” replied Remedios. “Rafaela told me that you have refused many suitors.” “You see, they want me to marry a man,” she replied, “because he has money or a title. But I don’t wish to. It makes no difference to me whether he is rich or poor; what I want is for him to be good, for him to have a blind trust in me, as I shall have in him.” “And what do you call being good?” asked Quentin.[353] “Being worthy, sincere, incapable of treachery, incapable of deceit....” Quentin fell silent, got up, and returned to his room. There he spent the entire afternoon pacing up and down like a wild beast in a cage. At supper he said nothing; nor could he eat, no matter how hard he tried. As he rose from the table, he said in a voice choked with emotion: “Listen, Remedios.” “What is it?” she asked, perceiving his emotion without knowing the cause for it. “I am going away.” “You are going, Quentin? Why?” “Because I am not sincere, nor am I capable of self-sacrifice and abnegation.” “Aren’t you?” “No. I am a deceiver, Remedios. I have lied so many times that now I do not know when I am lying, and when I am telling the truth.” “And I believed in you, Quentin,” she said sadly. “Now you know me. I have confessed this to no one but you. I cannot deceive you. No; I would deceive most any one—I’m so used to it!—but not you. Believe me, this is a great sacrifice on my part.” “Aren’t you honest, Quentin?” “Just enough so to keep out of jail.” “And no more?” “No more. I have been interested in no one but myself. I have been an ingrate.” “Ungrateful too, Quentin?” “Yes, that too. I am self-centred, a liar, a deceiver.... But even so, Remedios, there are men who have filthier souls than I.[354]” “You hurt me, Quentin.” “What would you? I wished to be rich; and my heart, along with what few good qualities there were in it—if there were any—has gone on withering and being lacerated by the brambles along the road.” “How sad it must be to live like that!” “Pst!—Not sad.... No. It is like a magic lantern, understand?—Things happen; just happen, and that’s all.” “Without love or hate?” “Without anything.” “Before—when you first met us, were you a deceiver then?” “That is when I first began.” “Adiós, Remedios. Believe that I have made, with this confession, a very great sacrifice.—Good-bye!” And Quentin held out his hand to her. She drew back. “Do I frighten you still?” “No.” “But won’t you give me your hand?” “No. Not until you are good.” “And then?” “Then—perhaps.” Quentin left the room with lowered head. He sat at his window for many hours, smoking. The night was clear, cool, and soft. The moon silvered the distant hills; a nightingale sang softly in the darkness. A flood of thoughts crowded Quentin’s brain. “Conscience,” he said to himself, “conscience is a weakness. What is honesty? Something mechanical. For a woman it is the certainty of living with the mate[355] provided by the Church; for a man, the proof that the money he owns was won by methods not included in books. But another, a higher honesty, such as that girl wants; is it not madness in a world where no one concerns himself with it? This girl has completely upset me.” Quentin felt a strong desire to weep at the thought of having been so near happiness. He might have deceived Remedios.... No, he could not have deceived her.... Then he would not have been happy. As he thought, the full moon was climbing the heavens; its light, filtering through the leaves of a grape-vine, made beautiful little lace patterns on the ground. He could hear the continuous tinkling of the bells on the goats and cows; now and then there came to him the distant sound of footsteps and voices, the whispering of the wind in the foliage, the lowing of oxen, the neighing of horses and the knocking of the cows’ horns against the corral fence. Suddenly Quentin made up his mind. He must go. It was necessary. He left his room, descended the stairs noiselessly, and made his way to the stable. He lit a lantern, saddled his horse, put on the bridle, and taking the animal by the bit, led him into the patio. He opened the wooden gate and followed the fence until he came to the road. Quentin mounted and remained for a long time contemplating the front of the farmhouse, which was bathed in the moonlight. “Ah, poor Quentin,” he murmured. “Your sophistry and cunning have been of no avail, here. Are you not good? Then you cannot enter paradise. You are not fighting brokers here, nor politicians, nor insincere folk. But a mere slip of a girl who knows not the world[356] other than what her heart tells her. She has conquered you, you cannot enter paradise.” The horse walked slowly along; Quentin looked back. A great cloud covered the moon; the whole country lay in darkness. Quentin’s heart was heavy within him, and he sighed deeply. Then he had a surprise. He was weeping. He continued on his way. And the nightingales went on singing in the shadows, while the moon, high in the heavens, bathed the country in its silver light. El Paular, June, 1905. THE END","sourceLink":"http://novel.tingroom.com/jingdian/1953/56009.html","bookId":751,"book":{"id":751,"title":"The city of the discreet","description":"简介： IN San Sebastin, a beautiful watering place on the northern coast of Guipzcoa, Spain, Don Po Baroja y Nessi was born on the 28th day of December, 1872. There, wandering among the foothills of the Pyrenees, listening to the talk of the hardy Basque pe...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1953","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
