{"id":38843,"no":4,"title":"A FRAGMENT OF THE THIRTY-FOURTH BOOK OF DIODORUS SICULUS.","content":"\"King Antiochus besieged Jerusalem; but the Jews resisted him for some time. When, however, all their provision was spent, they were forced to send ambassadors to him to treat on terms. Many of his friends persuaded him to storm the city, and [49] to root out the whole nation of the Jews; because they only, of all people, hated to converse with any of another nation, and treated all of them as enemies. They likewise suggested to him, that the ancestors of the Jews were driven out of Egypt as impious and hateful to the Gods. For their bodies being overspread and infected with the itch and leprosy, they brought them together into one place by way of expiation, and as profane and wicked wretches expelled them from their coasts. Those too that were thus expelled seated themselves about Jerusalem, and being afterwards embodied into one nation, called the nation of the Jews, their hatred of all other men descended with their blood to posterity. Hence they made strange laws, entirely different from those of other nations. In consequence of this, they will neither eat nor drink with any one of a different nation, nor wish him any prosperity. For, say they, Antiochus, surnamed Epiphanes, having subdued the Jews, entered into the temple of God, into which by their law no one was permitted to enter but the priest. Here, when he found the image of a man with a long beard carved in stone sitting on an ass, he conceived it to be Moses who built Jerusalem, established the nation, and made all their impious customs and practises legal: for these abound in hatred and enmity to all other men. Antiochus, therefore, abhorring this [50] their contrariety to all other nations, used his utmost endeavour to abrogate their laws. In order to effect this, he sacrificed a large hog at the image of Moses and at the altar of God that stood in the outward court, and sprinkled them with the blood of the sacrifice. He commanded likewise that the sacred books, whereby they were taught to hate all other nations, should be sprinkled with the broth made of the hog\u0027s flesh. And he extinguished the lamp called by them immortal, which was continually burning in the temple. Lastly, he compelled the high priest and the other Jews to eat swine\u0027s flesh. Afterwards, when Antiochus and his friends had deliberately considered these things, they urged him to root out the whole nation, or at least to abrogate their laws and compel them to change their former mode of conducting themselves in common life. But the king being generous and of a mild disposition, received hostages and pardoned the Jews. He demolished, however, the walls of Jerusalem, and took the tribute that was due.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3261/89321.html","bookId":564,"book":{"id":564,"title":"Arguments Of Celsus, Porphyry, And The Emperor Julian, Against The Christians","description":"简介： I HAVE often wished, says Warburton in a letter to Dr. Forster, October 15, 1749, for a hand capable of collecting all the fragments remaining of Porphyry, Celsus, Hierocles, and Julian, and giving them to us with a just, critical and theological com...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3261","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
