{"id":76290,"no":29,"title":"Page 29","content":"“Calum,” he shouted. “Aye, MacBain?” “No,” Johanna blurted out. Gabriel turned to her. “No?” Tears gathered in her eyes. “We can’t kill them.” “Yes, we can.” She shook her head. “It would make us no better than they if we let our anger control our actions. Make them go away. They turn my stomach.” The strength was back in her voice. Gabriel nodded, satisfied. “Give me your bow and arrow first.” She slowly lowered her arms. What happened next so surprised her, she didn’t even have time to react. Gabriel snatched her weapon out of her hands, half-turned, took aim, and dispatched the arrow with incredible speed and accuracy. A howl of pain followed. The arrow found its target in the shoulder of the same Maclnnes soldier she’d injured. Robert, the laird’s son, had slipped his dagger from his belt and was just about to hurl the weapon when Gabriel spotted the movement. Neither Calum nor Keith had even had time to shout a warning. Laird Maclnnes went into a rage on his son’s behalf. Gabriel’s fury was far worse. He shoved Johanna behind his back, tossed the bow to the ground, and reached for his sword. “Get the hell off my land, MacInnes, or I’ll kill you now.” The MacInnes soldiers didn’t waste time leaving. Gabriel wouldn’t let Johanna move until the courtyard was clear. “Keith, send ten Maclaurin soldiers to follow them to our border,” he ordered. “As you wish, MacBain,” Keith shouted back. The minute her husband moved, Johanna skirted her way around him and ran down the steps. She crossed the clearing, untying her belt as she ran. She had her plaid off before she knelt down next to the battered woman and used the material to cover her. She placed her hand on the side of the woman’s neck, felt the pulse beating there, and almost wept with relief. Father MacKechnie put his hand on Johanna’s shoulder. “We’d best get her inside,” he whispered. Calum bent down on one knee and leaned forward to lift the woman. Johanna screamed at the soldier. “Don’t touch her!” “She can’t stay here, m’lady,” Calum argued, trying to reason with his distraught mistress. “Let me carry her inside.” “Gabriel will carry her,” Johanna decided. She took a deep breath in an attempt to calm herself. “I didn’t mean to shout at you, Calum. Please forgive me. You shouldn’t be lifting her anyway. You’ll tear your stitches.” Calum nodded. He was surprised and pleased his mistress had offered him an apology. “Is she dead?” Keith asked. Johanna shook her head. Gabriel pulled her to her feet then and bent down to lift the MacKay woman into his arms. “Be careful with her,” Johanna whispered. “Where do you want me to put her?” Gabriel asked. He stood up, cradling the sleeping woman in his arms. “Give her my room,” Father MacKechnie suggested. “I’ll find another bed tonight.” “Do you think she’ll live?” Calum asked as he followed his laird across the courtyard. “How the hell do I know?” Gabriel asked. “She’ll survive,” Johanna announced, praying she was right. Calum ran ahead to open the doors. Johanna followed her husband through the entrance. Hilda was just coming down the hallway from the back door. She spotted her mistress and called out to her. “Might I have a word with you about our menu for tonight’s dinner guests?” “We aren’t having guests,” Johanna said. “I would rather eat my supper with the devil or King John himself than suffer the MacInnes’ company.” Hilda’s eyes widened. Johanna started up the steps after her husband, then stopped. “I seem to be snapping at everyone, Hilda. Please forgive me. I’m not myself today.” She didn’t wait for Hilda to accept her apology but hurried on up the steps. A few minutes later, their guest was settled in bed. Gabriel stood by his wife’s side while she checked for broken bones. “She appears to be intact,” Johanna whispered. “The blows to her head worry me. Look at the swelling above her temple, Gabriel. I don’t know how severe the damage is. She might not ever wake up.” Johanna didn’t realize she’d started crying until her husband ordered her to stop. “It won’t do her any good if you fall apart. She needs your help, not your tears.” He was right, of course. Johanna mopped the wetness away from her cheeks with the backs of her hands. “Why did they cut her hair like that?” She reached down and touched the side of the woman’s head. Clare MacKay had thick, dark brown hair. It hung straight down but barely covered her ears. The MacInnes men hadn’t used scissors. The edges were too jagged. They’d used a knife instead. Humiliation, Johanna decided. Aye, that was their reason behind the foul deed. “It’s a miracle she’s still breathing,” Gabriel said. “Do what you can, Johanna. I’m going to let Father MacKechnie come inside now. He’ll want to give her the last rites.” Johanna wanted to shout a denial. The sacrament of extreme unction was given only to those poor souls hovering at death’s door. Reason told Johanna it was the logical thing to do. Yet the woman was breathing, damn it all. and Johanna didn’t want to consider the possibility she wouldn’t recover. “Just as a precaution.” Gabriel insisted to gain her cooperation. “Yes,” she whispered, “just as a precaution.” She straightened up. “I’m going to make her more comfortable.” she announced then. She crossed the room to fetch the pitcher of water and the bowl from the chest and carried them back to the bed. She was going to put them on the floor near her feet, but Gabriel thoughtfully moved the chest close to her. He started for the door as she hurried across the room again to collect a stack of linen cloths. Gabriel reached for the latch, then suddenly stopped. He turned around to look at his wife. She wasn’t paying him any attention now. She hurried back to the bed, sat down on the side, and dipped one of the cloths into the bowl of water she’d just poured. “Answer a question for me,” he ordered. “Yes?” “Were you ever beaten like this?” Johanna didn’t look up at her husband when she gave her answer. “No.” He hadn’t realized he’d been holding his breath. He let it out after she gave him her reply. Then she qualified her answer. “He rarely struck my face or my head. Once, though, he was less careful.” “And the rest of your body?” “Clothing hid those bruises,” she answered. She didn’t have any idea how her explanation affected him. Gabriel was shaken. It was a wonder to him she’d ever agreed to marry again. Hell, he’d demanded she trust him. He felt like a complete fool now. If he were in her position, he sure as certain wouldn’t have trusted anyone ever again. “She won’t have scars,” Johanna whispered. “Most of the blood on her face is from her nosebleed. It’s a wonder they didn’t break it. She’s a pretty woman, isn’t she, Gabriel?” “Her face is too swollen to tell what she looks like,” he answered. “They shouldn’t have cut her hair.” She seemed obsessed over that minor punishment. “Cutting her hair was the least of their offenses, Johanna. They shouldn’t have beaten her. Dogs receive better treatment.” Johanna nodded. And oxen, she thought to herself. “Gabriel?” “Yes?” “I’m glad I married you.” She was too embarrassed to look at her husband when she told him how she felt, and so she pretended great interest in wringing every drop of water out of her cloth. He smiled. “I know you are, Johanna.” His arrogance was really getting out of hand. It warmed her heart, though. She shook her head, then went back to her task and began to clean the blood away from Clare MacKay’s face. She whispered words of comfort while she worked. She doubted Clare could hear her, but it made Johanna feel better to tell her over and over again that she was safe now. She added the promise that no one would ever hurt her again. Gabriel pulled the door open and found the hallway crowded with women. They all wore the MacBain plaid. Hilda stood in front of the group. “We would like to offer to help with the care of the woman.” she said. “Father MacKechnie must give her the last rites before you go inside,” Gabriel ordered. The priest was waiting at the back of the crowd. He heard his laird’s announcement and immediately pushed his way through the women, begging their indulgence. He went inside the chamber, hurried to the foot of the bed where he’d left his satchel, and pulled out a long, narrow purple stole. He kissed each fringed end, whispered his prayers, and draped the material over his neck. Gabriel pulled the door closed. He went downstairs. Calum and Keith were waiting for him at the bottom of the steps. They followed their laird into the great hall. Gabriel spotted the plaid on the floor in front of the hearth. His dog was missing. “Where the hell is Dumfries?” “Out prowling,” Calum suggested. “He took off early this morning,” Keith added. Gabriel shook his head. Johanna would pitch a fit if she noticed the dog was gone. She’d fret about his stitches. He forced his mind back to more important matters. “Calum, call all the MacBain soldiers together,” he commanded then. “I want each man to tell me he didn’t touch Clare MacKay.” “And you will believe . . .” Keith quit his question when his laird scowled at him. “None of my warriors will lie to me, Keith,” Gabriel snapped. “But if one admits he did in fact spend the night with the woman? What will you do then?” “That isn’t your concern, Keith. I want you to ride to Laird MacKay and tell him what took place here today.” “Do I tell him his daughter is dying or do I soften the truth?” “Tell him she’s been given the last rites.” “And do I tell him a MacBain ...” “Tell them exactly what Laird MacInnes charged,” Gabriel commanded, his impatience evident. “Damn, I wish I’d killed the bastards when I had the chance.” “You’d have a war on your hands if you did, MacBain,” Keith pointed out. “War has already been declared,” he snapped. “Think I will so easily forget the fact that the laird’s son tried to kill my wife?” He was shouting by the time he finished his question. The Maclaurin warrior shook his head. “Nay, Laird,” he rushed out. “You will not forget, and I stand beside you on this issue.” “Damned right you do,” Gabriel countered. Calum took a step forward then. “The MacKays might also wage war if they believe a MacBain did in fact compromise Clare MacKay.” “None of my men would act so dishonorably,” Gabriel snapped. Calum nodded agreement. Keith wasn’t convinced. “MacInnes said your plaid was spotted,” he reminded his laird. “He was lying to us,” Calum argued. “Laird MacInnes also said Clare MacKay admitted she spent the night with a MacBain,” Keith said. “Then she’s lying,” Calum replied. Gabriel turned his back on his soldiers. “I have given both of you your duties. See them completed.” The soldiers immediately left the hall. Gabriel stood by the hearth a long while. He had one hell of a problem on his hands. He knew, without a doubt, that none of his men was responsible for disgracing Clare MacKay. Yet the MacBain plaid had been spotted . . . three months ago. “Hell,” Gabriel muttered to himself. If Laird MacInnes was telling the truth, there could only be one answer, only one man responsible for the damnable mess. Nicholas. CHAPTER 12 Clare MacKay didn’t wake up until the following morning. Johanna stayed with the woman most of the night until Gabriel came into the chamber and literally dragged her away. Hilda was happy to take over the watch for her mistress. Johanna had only just returned to the room and settled herself in a chair by the side of Clare’s bed when the woman opened her eyes and spoke to her. “I heard you whispering to me.” Johanna was given quite a start. She jumped up and went over to Clare. “You’re awake,” she whispered, her relief almost overwhelming. Clare nodded. “How do you feel?” Johanna asked. “I ache from my head to my toes.” Johanna nodded. “You have bruises from your head to your toes,” she replied. “Does your throat hurt, too? You sound hoarse.” “ ’Tis the truth I did a lot of screaming,” Clare said. “May I have a drink of water?” Johanna hurried to fetch the goblet. She helped Clare sit up. She tried to be as gentle as possible, but the woman still grimaced in pain. Her hand shook when she reached for the goblet. “Was there a priest here? I thought I heard someone praying.” “Father MacKechnie gave you the last rites,” Johanna explained. She put the goblet on the chest and sat down in her chair again. “We didn’t know if you would survive or not. It was just a precaution,” she added in a rush. Clare smiled. She had beautiful white teeth and dark brown eyes. Her face was still terribly swollen, of course, and Johanna could tell from the way she tried not to move she was still in terrible pain. “Who did this to you?” Clare closed her eyes. She avoided answering the question by asking one of her own. “Last night . . . you said I was safe. I remember hearing you whisper those words to me. Were you telling the truth? Am I safe here?” “Yes, of course you are.” “Where is here?” Johanna hurried to introduce herself and then explained what had happened. She deliberately left out the mention about the arrow she’d put in Robert MacInnes’s thigh and the arrow her husband put in his shoulder. By the time she was finished with her explanation, Clare was falling asleep again. “We’ll talk later,” she promised. “Sleep now, Clare. You may stay with us for as long as you wish. Hilda will bring you something to eat in just a little while. You’ll . . .”","sourceLink":"https://allnovel.net/saving-grace/page-29.html","bookId":1839,"book":{"id":1839,"title":"Saving Grace","description":"Storyline: When Lady Johanna learned that she was a widow, she vowed she would never marry again. Only sixteen, already she possessed a strength of will that impressed all who looked past her golden-haired beauty. Yet when King John demanded that she remarry and selected a bridegroom for her—it seemed she must acquiesce, until her beloved foster brother suggested she wed his friend, the handsome Scottish warrior Gabriel MacBain. At first Johanna was shy, but as Gabriel tenderly revealed the splendid pleasures they would share, she came to suspect that she was falling in love with her gruff new husband. And it was soon apparent to the entire Highlands clan that their brusque, gallant laird had surrendered his heart completely. But now a desperate royal intrigue threatened to tear her from his side—and to destroy the man whose love meant more to her than she had ever dreamed!","cover":"https://allnovel.net/images/saving-grace.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/saving-grace.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:37:15 AM"}}
