{"id":76269,"no":8,"title":"Page 8","content":"“Then the man I’m marrying is also illegitimate?” “Yes.” “Yet the Maclaurins made him their laird?” Nicholas nodded. “It’s complicated,” he admitted. “They needed his strength. He does carry his father’s blood, and they’ve conveniently forgotten he was born a bastard. The boy, however . . .” He didn’t say another word. He would leave the conclusions to her. Johanna shook her head. “Do you suppose the little one’s upset about the wedding?” “It would appear he’s upset about something.” Father MacKechnie drew their attention by waving to them. Nicholas took hold of Johanna’s elbow and started forward. She couldn’t take her gaze away from the child. Lord, he looked pitiful and lost. “They’re ready,” Nicholas announced. “Here comes MacBain.” The laird walked across the courtyard and took his place in front of the altar. His hands were at his sides. The priest moved to stand next to him. He again motioned Johanna forward. “I can’t do this, not without . . .” “It’s going to be all right.” “You don’t understand,” she whispered, smiling. “Wait here, Nicholas. I’ll be right back.” The priest waved to Johanna. She waved back, smiling. Then she turned around and walked away. “Johanna, for the love of God . . .” Nicholas was muttering to the air. He watched as his sister made her way around the crowd. When she headed for the steps, he finally understood what her errand was. Nicholas turned his gaze to MacBain. His expression revealed nothing of his thoughts. The priest craned his neck to watch Johanna, then turned to MacBain and nudged him with his elbow. Johanna slowed her pace when she neared the steps, for she didn’t want the little one to run away before she got to him. The news that MacBain had a son had filled her with joy and relief. Finally she had her answer to the question that plagued her. MacBain obviously didn’t care she was barren because he already had an heir, illegitimate or not. The guilt she’d been carrying dropped away like a heavy cloak from her shoulders. MacBain couldn’t contain his frown. Damn, he hadn’t wanted her to find out about the boy until they were married and she couldn’t change her mind. Women were peculiar in their attitudes, he knew, and he was certain he was never going to understand exactly how their minds worked. They seemed to take exception to such odd things. Most, he’d heard, didn’t accept mistresses, and some of the wives of the other warriors he knew didn’t acknowledge bastards. MacBain had every intention of forcing Johanna to acknowledge his son, but he’d hoped to get her settled in first. Alex spotted her coming his way and immediately buried his face in his hands. He had skinny knees. They were caked with dirt. When he peeked up to look at her, she saw his eyes. They weren’t gray like his father’s, but blue. Johanna paused on the bottom step and spoke to the child. MacBain started to go after his bride, then changed his mind. He folded his arms across his chest and simply waited to see what would happen. He wasn’t the only one watching. Silence filled the courtyard as every MacBain and every Maclaurin turned to look. “Does the boy understand English?” Father MacKechnie asked. “Some,” MacBain answered. “She told me you were instructing her in Gaelic. Has she learned enough to converse a bit with Alex?” The priest shrugged. “Probably,” he allowed. Johanna talked to the child for several minutes. Then she reached out her hand to him. Alex jumped to his feet, tripped down the stairs, and put his hand in hers. She leaned down, brushed the hair out of his eyes, adjusted his plaid from drooping over his shoulders, and then pulled him along by her side. “He understands that,” MacKechnie whispered. “What does he understand?” Calum asked. The priest smiled. “Acceptance.” MacBain nodded. Johanna reached Nicholas’s side and took hold of his arm again. “I’m ready now,” she announced. “Alex, go and stand beside your father,” she instructed. “It is my duty to come to the two of you.” The little boy nodded. He ran down the length of the path and took his place on his father’s left. MacBain glanced down at his son. His expression was contained, and Johanna couldn’t tell if he was pleased or annoyed. His gaze stayed on her, but once she started to walk toward him, he unfolded his arms and reached down to touch the top of his son’s head. Nicholas gave her away in marriage. She didn’t resist when he placed her hand in MacBain’s. He was damned proud of his sister. He knew she was nervous, but she didn’t try to cling to his side. She was positioned between the two warriors, with her future husband on her right and her brother on her left. Johanna stood straight, held her head high, and looked straight ahead. She was dressed in a white ankle-length chainse and matching knee-length bliaut. The square neckline of her wedding attire was embroidered with pale pink and green threads fashioned into the design of dainty rosebuds. She smelled like roses, too. The scent was faint, yet vastly appealing to MacBain. Father MacKechnie took a small bouquet of flowers from the corner of the altar and handed it to her before hurrying around to the other side to begin the mass. MacBain kept his gaze on his bride. She was an utterly feminine creature, and God’s truth, he didn’t know what he was going to do with her. His main worry was that she wouldn’t be strong enough to survive such a harsh life. He forced the concern aside. It had become his duty to make certain she survived. He would protect her from danger, and if she needed to be pampered, then by God he would see she was pampered. He didn’t have the faintest idea how, but he was an intelligent man. He would find out. He wouldn’t let her dirty her hands either or do any backbreaking work, and he would demand she rest each and every day. Taking care of her was the very least he could do in appreciation for the land she’d given him, and surely that was the only reason he was worrying about her comforts now. The wind blew a strand of hair in her face. She let go of his hand to brush the strand of hair back over her shoulder. It was a dainty, feminine action. The curly mass of gold seemed to float down her back. Her hand shook so hard that the nosegay she held against her waist was rapidly dropping petals. When she didn’t take hold of his hand again, he was so bothered that he grabbed her hand and hauled her up close to his side. Nicholas saw the possessive action and smiled. The ceremony was going along quite nicely until Father MacKechnie asked her to promise to love, honor, and obey her husband. She considered his request a long minute. Then she shook her head and turned to the groom. She motioned for him to lean down and stretched up on tiptoe so that she could whisper in his ear. “I will try to love you, m’lord, and I’ll certainly honor you because you’ll be my husband, but I don’t believe I’ll obey you much. I’ve found that total submissiveness doesn’t agree with me.” She was wringing the petals off the stems of her flowers while she explained her position. She couldn’t look him in the eye either but stared at his chin while she waited for his reaction. MacBain was too astonished by what she’d just said to him to notice how worried she was. He had to force himself not to laugh. “Are you jesting with me?” He hadn’t whispered his question. Since he wasn’t overly concerned about their audience overhearing their discussion, she wasn’t going to be concerned either. Her voice was every bit as forceful as his had been when she gave him her answer. “Jest with you during the middle of our wedding vows? I think not, m’lord. I’m very serious. Those are my conditions. Do you accept them?” He did laugh then. He simply couldn’t help himself. Her burst of courage was short-lived. She felt embarrassed and humiliated, but the issue was too important to let pass. There was only one course of action left. She straightened her shoulders, jerked her hand away from his, and shoved the bouquet of flowers at him. Then she made a curtsy to the priest, turned around, and walked away. The message was clear. Still, there were a few Maclaurin soldiers who were slow to catch on. “Is the lass leaving?” Keith, the commander over the Maclaurin soldiers, whispered his question in a voice loud enough for everyone to hear. “She’s getting away, MacBain,” another called out. “It appears she is leaving,” Father MacKechnie interjected. “Did I say something to displease her?” Nicholas started to go after his sister. MacBain grabbed him by his arm and shook his head at him. He shoved the bouquet at the baron, muttered something under his breath, and then went after his bride. She’d almost made it to the edge of the clearing before MacBain caught up with her. He grabbed her by her shoulders and turned her around. She wouldn’t look up at him. He forced her chin up with his hand. She braced herself for his anger. He would surely lash out at her. She was a strong woman, she reminded herself. She would withstand his wrath. “Will you try to obey?” He sounded exasperated. She was so astonished by his attitude she smiled. She wasn’t such a weakling after all, she thought to herself. She had just stood up to the laird and forced him to negotiate. She wasn’t certain she’d won much. but she definitely hadn’t lost anything. “Yes, I will try,” she promised. “Upon occasion,” she hastily added. He rolled his eyes heavenward. He’d allowed quite enough time on the topic, he decided. He grabbed hold of her hand and dragged her back to the altar. She had to run to keep up with him. Nicholas quit frowning when he spotted his sister’s smile. He was highly curious to find out what the argument had been about, of course, but he thought he’d have to wait until the wedding ceremony was over before he could find out what happened. He didn’t have to wait after all. Johanna accepted the bouquet from her brother and turned back to the priest. “Please forgive the interruption, Father,” she whispered. The priest nodded. He again asked her to love, honor, and obey her husband. He added the word please this time. “I will love, honor, and try to obey my husband upon occasion,” she answered. Nicholas started laughing. He now understood what the argument had been about. The Maclaurins and the MacBains let out a collective gasp. They were horrified. Their laird scanned his audience and glared them into silence. Then he turned his scowl on his bride. “Obedience and submissiveness aren’t necessarily the same thing,” he snapped. “I was taught that they were,” she defended. “You were taught wrong.” His frown was frightening enough to start her fretting again. Dear God. she really couldn’t go through with this. She didn’t have the strength. She shoved the bouquet of flowers at MacBain again and turned to leave. The laird slammed the flowers into Nicholas’s outstretched hand and grabbed hold of Johanna before she could get away. “Oh, no, you don’t,” he muttered. “We aren’t going through this again.” To prove he meant what he’d just said, he threw his arm around her shoulders and anchored her into his side. “We’re going to get this done before nightfall, Johanna.” She felt like a fool. The priest was staring at her with a look on his face that suggested he thought she’d lost her mind. She took a breath, accepted her flowers from her brother again, and then said, “Pray forgive me for interrupting you again, Father. Please continue.” The priest mopped his brow with his linen square, then turned his attention to the groom. Johanna barely paid attention to the priest’s lecture on the merits of being a good husband. She was too busy trying to get past her embarrassment. She decided she was sick of worrying. Her decision was made, and that was that. She said a quick prayer and made up her mind to put her fears in God’s hands. Let Him do the worrying. It was a sound plan, she decided. Still, she wished He would give her a sign that everything really would turn out all right. That notion made her smile. She was being terribly fanciful. She was a woman, and, therefore, last in God’s love, or so she’d been told over and over again by Bishop Hallwick. God certainly didn’t have time to listen to her paltry concerns, and she was probably committing a sin of vanity just by hoping for any kind of sign. She let out a little sigh. MacBain heard the sound and turned to look down at her. She smiled weakly up at him. It was MacBain’s turn to answer the priest’s questions. He started with his name and title. He was called Gabriel. God had given her a sign. Johanna’s eyes widened, and she thought her mouth might have dropped open. She was quick to regain control of her emotions. Her thoughts weren’t controlled, though. They raced with questions. Had his mother deliberately named him after the highest of angels, the most esteemed in God’s love? Johanna remembered her religion lessons well about the archangel. He was known as the protector of women and children. She remembered the wonderful stories passed down through the generations from mother to child about the most magnificent of all the angels. Her own mother had told her Gabriel would always watch out for her. He was her own special archangel and was to be called upon for aid in the dead of night when nightmares came creeping into her dreams. The archangel was the champion of the innocents and the avenger of evil. She shook her head. She was being overly romantic, that was all. There wasn’t anything symbolic about her husband’s name. His mother had probably been in a fanciful mood when he was born. There was also the possibility he was named after a relative, too. She couldn’t convince herself. Lack of sleep made her easy prey for such foolish thoughts, she supposed. Still, she had prayed for a miracle last night, and just minutes before she’d wished for a sign of some sort to let her know everything was going to be all right. Johanna had seen a drawing a holy man had made in charcoal of Gabriel. She still remembered every detail of the rendering. The archangel had been depicted as a giant warrior with a gleaming sword in his hand. He had wings. The man standing beside her didn’t have wings, but he was certainly a giant warrior with his sword at his side. And his name was Gabriel. Had God answered her prayer after all? CHAPTER 5 His mama should have named him Lucifer. Johanna came to that conclusion by the end of the day. Barbarian or Savage would have been suitable alternative names, she thought to herself. Her husband had the devil inside him with his arrogant, high-handed orders. The man was also completely devoid of all civilized manners.","sourceLink":"https://allnovel.net/saving-grace/page-8.html","bookId":1839,"book":{"id":1839,"title":"Saving Grace","description":"Storyline: When Lady Johanna learned that she was a widow, she vowed she would never marry again. Only sixteen, already she possessed a strength of will that impressed all who looked past her golden-haired beauty. Yet when King John demanded that she remarry and selected a bridegroom for her—it seemed she must acquiesce, until her beloved foster brother suggested she wed his friend, the handsome Scottish warrior Gabriel MacBain. At first Johanna was shy, but as Gabriel tenderly revealed the splendid pleasures they would share, she came to suspect that she was falling in love with her gruff new husband. And it was soon apparent to the entire Highlands clan that their brusque, gallant laird had surrendered his heart completely. But now a desperate royal intrigue threatened to tear her from his side—and to destroy the man whose love meant more to her than she had ever dreamed!","cover":"https://allnovel.net/images/saving-grace.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/saving-grace.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:37:15 AM"}}
