{"id":39489,"no":6,"title":"SCENERY OF THE FINDHORN.","content":"Clifford.—In justice to your story, I must say that it is much more interesting than the scene where it was enacted, if we may judge from the specimen at this moment before us. Grant.—Nay, but take the trouble to carry your eyes entirely over the foreground, and behold the sun gleaming afar off yonder on the broad sheet of the Moray Firth, with those bold dark headlands called the Sutors defending the entrance of the Bay of Cromarty beyond, backed by the blue mountains of Ross-shire and Sutherland in the distance. Clifford.—These are indeed features that would give dignity to any scene; but you must admit that this unmeaning flat which stretches everywhere from under our feet is sufficiently tiresome, notwithstanding the laudable efforts that are making to cover it with plantations. Author.—It is monotonous enough, to be sure; but how often do we find inestimable worth concealed under an unpretending exterior. The apparently dull stretch of country before you is a pregnant example of this; for the charms of the river Findhorn that bisects it from west to east are so buried in its bosom as to be quite overlooked from hence. Grant will tell you, that if you were to follow the river upwards through all the mazes of its deep and shadowy glen, you would find that it exhibits scenery of the wildest and most magnificent character. Grant.—Nay, it is hardly fair to refer him to me; for although I have a full impression of its grandeur upon my mind which will not easily be effaced, I can give him no very accurate account of its pools or its streams, as regards their excellence for salmon angling. Clifford.—Pho! none of your jokes, Mr. Grant. Although I like fishing and shooting, you know very well that I enjoy wild nature as much as either of you. Grant.—Ha! ha! ha! I know you do, my dear fellow. Clifford.—And, moreover, I have so much admired the scenery, as well as the fishing-pools of the river lower down, [67]that if what you now speak of equals that with which I am already so familiar, it must be magnificent indeed. Author.—I think that it in many respects surpasses all that you have hitherto seen. In truth, I know no river scenery in Great Britain at all to be compared in sublimity to that of the Findhorn about Ferness. Indeed, it rises more into that great scale of grandeur exhibited by some of the Swiss gorges than anything I have ever met with at home. But you must take the first opportunity of visiting it, Clifford. And then, in addition to the treat that nature will yield you during your ramble, and the good fishing which you will certainly have, I think you will be much gratified by the inspection of that interesting relic of antiquity, The Cairn and Pillar of the Lovers, which you will find there. Clifford.—What! ha! ha! ha! some Pyramus and Thisbe,—some Petrarch and Laura,—among your heroes and heroines of the pemmican, I suppose! Author.—No, no. The lonely obelisk, and the cairn from which it rises, may indeed have stood on the green holm of Ferness, with the rapid Findhorn sweeping around them, for ages. They may have been there whilst the great forests still spread themselves thickly over the country, but you would judge wrong if you supposed them to have co-existed with my savages of the pemmican; for there must have been some considerable approach to civilisation amongst a people who could have cut and transported that great mass of rough-grained sandstone, of which the obelisk is formed, from the nearest quarries of the same rock, some fifteen or twenty miles off, to the spot where it has ever since stood, not to mention the beautiful hieroglyphical carvings with which it has been ornamented. Clifford.—Is there no legend attached to the monument? Grant.—There is; and our friend has woven it into a little poem, which he once repeated to me. Clifford.—Poem! come, let’s have it! You need not fear to give it to me now, you know; for there is no birch at hand to punish you for your false quantities. Author.—To tell you the truth, I am quite tired of repeating the story in prose; so, lame though my stanzas may be, I shall prefer risking your criticism. But you must remember, that it is one thing to climb a rugged heathery hill like this, and another thing to mount Parnassus.","sourceLink":"http://novel.tingroom.com/duanpian/2815/77817.html","bookId":1262,"book":{"id":1262,"title":"Highland Legends","description":"简介： The scenery of the less cultivated parts of our native Scotland may, generally speaking, be said to be checkered, as human life is with its events; for as, during our pilgrimage here on earth, evil continually succeeds good, and good evil, so are bea...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2815","creation":"Aug 1, 2019 12:24:44 AM","modification":"Aug 1, 2019 12:24:44 AM"}}
