{"id":65441,"no":17,"title":"Page 17","content":"He shakes his head. “Dad always wanted me to come here. I mean, they said they wanted me to stay in Candor, but that’s only because that’s what they’re supposed to say. They’ve always admired the Dauntless, both of them. They wouldn’t understand if I tried to explain it to them.”\\n\\n “Oh.” I tap my fingers against my knee. Then I look at him. “Is that why you chose Dauntless? Because of your parents?”\\n\\n Al shakes his head. “No. I guess it was because…I think it’s important to protect people. To stand up for people. Like you did for me.” He smiles at me. “That’s what the Dauntless are supposed to do, right? That’s what courage is. Not…hurting people for no reason.”\\n\\n I remember what Four told me, that teamwork used to be a Dauntless priority. What were the Dauntless like when it was? What would I have learned if I had been here when my mother was Dauntless? Maybe I wouldn’t have broken Molly’s nose. Or threatened Will’s sister.\\n\\n I feel a pang of guilt. “Maybe it will be better once initiation is over.”\\n\\n “Too bad I might come in last,” Al says. “I guess we’ll see tonight.”\\n\\n We sit side-by-side for a while. It’s better to be here, in silence, than in the Pit, watching everyone laugh with their families.\\n\\n My father used to say that sometimes, the best way to help someone is just to be near them. I feel good when I do something I know he would be proud of, like it makes up for all the things I’ve done that he wouldn’t be proud of.\\n\\n “I feel braver when I’m around you, you know,” he says. “Like I could actually fit in here, the same way you do.”\\n\\n I am about to respond when he slides his arm across my shoulders. Suddenly I freeze, my cheeks hot.\\n\\n I didn’t want to be right about Al’s feelings for me. But I was.\\n\\n I do not lean into him. Instead I sit forward so his arm falls away. Then I squeeze my hands together in my lap.\\n\\n “Tris, I…,” he says. His voice sounds strained. I glance at him. His face is as red as mine feels, but he’s not crying—he just looks embarrassed.\\n\\n “Um…sorry,” he says. “I wasn’t trying to…um. Sorry.”\\n\\n I wish I could tell him not to take it personally. I could tell him that my parents rarely held hands even in our own home, so I have trained myself to pull away from all gestures of affection, because they raised me to take them seriously. Maybe if I told him that, there wouldn’t be a layer of hurt beneath his flush of embarrassment.\\n\\n But of course, it is personal. He is my friend—and that is all. What is more personal than that?\\n\\n I breathe in, and when I breathe out, I make myself smile. “Sorry about what?” I ask, trying to sound casual. I brush off my jeans, though there isn’t anything on them, and stand up.\\n\\n “I should go,” I say.\\n\\n He nods and doesn’t look at me.\\n\\n “You going to be okay?” I say. “I mean…because of your parents. Not because…” I let my voice trail off. I don’t know what I would say if I didn’t.\\n\\n “Oh. Yeah.” He nods again, a little too vigorously. “I’ll see you later, Tris.”\\n\\n I try not to walk out of the room too fast. When the dormitory door closes behind me, I touch a hand to my forehead and grin a little. Awkwardness aside, it is nice to be liked.\\n\\n Discussing our family visits would be too painful, so our final rankings for stage one are all anyone can talk about that night. Every time someone near me brings it up, I stare at some point across the room and ignore them.\\n\\n My rank can’t be as bad as it used to be, especially after I beat Molly, but it might not be good enough to get me in the top ten at the end of initiation, especially when the Dauntless-born initiates are factored in.\\n\\n At dinner I sit with Christina, Will, and Al at a table in the corner. We are uncomfortably close to Peter, Drew, and Molly, who are at the next table over. When conversation at our table reaches a lull, I hear every word they say. They are speculating about the ranks. What a surprise.\\n\\n “You weren’t allowed to have pets?” Christina demands, smacking the table with her palm. “Why not?”\\n\\n “Because they’re illogical,” Will says matter-of-factly. “What is the point in providing food and shelter for an animal that just soils your furniture, makes your home smell bad, and ultimately dies?”\\n\\n Al and I meet eyes, like we usually do when Will and Christina start to fight. But this time, the second our eyes meet, we both look away. I hope this awkwardness between us doesn’t last long. I want my friend back.\\n\\n “The point is…” Christina’s voice trails off, and she tilts her head. “Well, they’re fun to have. I had a bulldog named Chunker. One time we left a whole roasted chicken on the counter to cool, and while my mother went to the bathroom, he pulled it down off the counter and ate it, bones and skin and all. We laughed so hard.”\\n\\n “Yes, that certainly changes my mind. Of course I want to live with an animal that eats all my food and destroys my kitchen.” Will shakes his head. “Why don’t you just get a dog after initiation if you’re feeling that nostalgic?”\\n\\n “Because.” Christina’s smile falls, and she pokes at her potato with her fork. “Dogs are sort of ruined for me. After…you know, after the aptitude test.”\\n\\n We exchange looks. We all know that we aren’t supposed to talk about the test, not even now that we have chosen, but for them that rule must not be as serious as it is for me. My heart jumps unsteadily in my chest. For me that rule is protection. It keeps me from having to lie to my friends about my results. Every time I think the word “Divergent,” I hear Tori’s warning—and now my mother’s warning too. Don’t tell anyone. Dangerous.\\n\\n “You mean…killing the dog, right?” asks Will.\\n\\n I almost forgot. Those with an aptitude for Dauntless picked up the knife in the simulation and stabbed the dog when it attacked. No wonder Christina doesn’t want a pet dog anymore. I tug my sleeves over my wrists and twist my fingers together.\\n\\n “Yeah,” she says. “I mean, you guys all had to do that too, right?”\\n\\n She looks first at Al, and then at me. Her dark eyes narrow, and she says, “You didn’t.”\\n\\n “Hmm?”\\n\\n “You’re hiding something,” she says. “You’re fidgeting.”\\n\\n “What?”\\n\\n “In Candor,” says Al, nudging me with his shoulder. There. That feels normal. “We learn to read body language so we know when someone is lying or keeping something from us.”\\n\\n “Oh.” I scratch the back of my neck. “Well…”\\n\\n “See, there it is again!” she says, pointing at my hand.\\n\\n I feel like I’m swallowing my heartbeat. How can I lie about my results if they can tell when I’m lying? I’ll have to control my body language. I drop my hand and clasp my hands in my lap. Is that what an honest person does?\\n\\n I don’t have to lie about the dog, at least. “No, I didn’t kill the dog.”\\n\\n “How did you get Dauntless without using the knife?” says Will, narrowing his eyes at me.\\n\\n I look him in the eye and say evenly, “I didn’t. I got Abnegation.”\\n\\n It is half-true. Tori reported my result as Abnegation, so that is what is in the system. Anyone who has access to the scores would be able to see it. I keep my eyes on his for a few seconds. Shifting them away might be suspicious. Then I shrug and stab a piece of meat with my fork. I hope they believe me. They have to believe me.\\n\\n “But you chose Dauntless anyway?” Christina says. “Why?”\\n\\n “I told you,” I say, smirking. “It was the food.”\\n\\n She laughs. “Did you guys know that Tris had never seen a hamburger before she came here?”\\n\\n She launches into the story of our first day, and my body relaxes, but I still feel heavy. I should not lie to my friends. It creates barriers between us, and we already have more than I want. Christina taking the flag. Me rejecting Al.\\n\\n After dinner we go back to the dormitory, and it’s hard for me not to sprint, knowing that the rankings will be up when I get there. I want to get it over with. At the door to the dormitory, Drew shoves me into the wall to get past me. My shoulder scrapes on the stone, but I keep walking.\\n\\n I’m too short to see over the crowd of initiates standing near the back of the room, but when I find a space between heads to look through, I see that the blackboard is on the ground, leaning against Four’s legs, facing away from us. He stands with a piece of chalk in one hand.\\n\\n “For those of you who just came in, I’m explaining how the ranks are determined,” he says. “After the first round of fights, we ranked you according to your skill level. The number of points you earn depends on your skill level and the skill level of the person you beat. You earn more points for improving and more points for beating someone of a high skill level. I don’t reward preying on the weak. That is cowardice.”\\n\\n I think his eyes linger on Peter at that last line, but they move on quickly enough that I’m not sure.\\n\\n “If you have a high rank, you lose points for losing to a low-ranked opponent.”\\n\\n Molly lets out an unpleasant noise, like a snort or a grumble.\\n\\n “Stage two of training is weighted more heavily than stage one, because it is more closely tied to overcoming cowardice,” he says. “That said, it is extremely difficult to rank high at the end of initiation if you rank low in stage one.”\\n\\n I shift from one foot to the other, trying to get a good look at him. When I finally do, I look away. His eyes are already on me, probably drawn by my nervous movement.\\n\\n “We will announce the cuts tomorrow,” Four says. “The fact that you are transfers and the Dauntless-born initiates are not will not be taken into consideration. Four of you could be factionless and none of them. Or four of them could be factionless and none of you. Or any combination thereof. That said, here are your ranks.”\\n\\n He hangs the board on the hook and steps back so we can see the rankings:\\n\\n 1. Edward\\n\\n 2. Peter\\n\\n 3. Will\\n\\n 4. Christina\\n\\n 5. Molly\\n\\n 6. Tris\\n\\n Sixth? I can’t be sixth. Beating Molly must have boosted my rank more than I thought it would. And losing to me seems to have lowered hers. I skip to the bottom of the list.\\n\\n 7. Drew\\n\\n 8. Al\\n\\n 9. Myra\\n\\n Al isn’t dead last, but unless the Dauntless-born initiates completely failed their version of stage one of initiation, he is factionless.\\n\\n I glance at Christina. She tilts her head and frowns at the board. She isn’t the only one. The quiet in the room is uneasy, like it is rocking back and forth on a ledge.\\n\\n Then it falls.\\n\\n “What?” demands Molly. She points at Christina. “I beat her! I beat her in minutes, and she’s ranked above me?”\\n\\n “Yeah,” says Christina, crossing her arms. She wears a smug smile. “And?”\\n\\n “If you intend to secure yourself a high rank, I suggest you don’t make a habit of losing to low-ranked opponents,” says Four, his voice cutting through the mutters and grumbles of the other initiates. He pockets the chalk and walks past me without glancing in my direction. The words sting a little, reminding me that I am the low-ranked opponent he’s referring to.\\n\\n Apparently they remind Molly, too.\\n\\n “You,” she says, focusing her narrowed eyes on me. “You are going to pay for this.”\\n\\n I expect her to lunge at me, or hit me, but she just turns on her heel and stalks out of the dormitory, and that is worse. If she had exploded, her anger would have been spent quickly, after a punch or two. Leaving means she wants to plan something. Leaving means I have to be on my guard.\\n\\n Peter didn’t say anything when the rankings went up, which, given his tendency to complain about anything that doesn’t go his way, is surprising. He just walks to his bunk and sits down, untying his shoelaces. That makes me feel even more uneasy. He can’t possibly be satisfied with second place. Not Peter.\\n\\n Will and Christina slap hands, and then Will claps me on the back with a hand bigger than my shoulder blade.\\n\\n “Look at you. Number six,” he says, grinning.\\n\\n “Still might not have been good enough,” I remind him.\\n\\n “It will be, don’t worry,” he says. “We should celebrate.”\\n\\n “Well, let’s go, then,” says Christina, grabbing my arm with one hand and Al’s arm with the other. “Come on, Al. You don’t know how the Dauntless-borns did. You don’t know anything for sure.”\\n\\n “I’m just going to go to bed,” he mumbles, pulling his arm free.\\n\\n In the hallway, it is easy to forget about Al and Molly’s revenge and Peter’s suspicious calm, and easy to pretend that what separates us as friends does not exist. But lingering at the back of my mind is the fact that Christina and Will are my competitors. If I want to fight my way to the top ten, I will have to beat them first.\\n\\n I just hope I don’t have to betray them in the process.\\n\\n That night I have trouble falling asleep. The dormitory used to seem loud to me, with all the breathing, but now it is too quiet. When it’s quiet, I think about my family. Thank God the Dauntless compound is usually loud.\\n\\n If my mother was Dauntless, why did she choose Abnegation? Did she love its peace, its routine, its goodness—all the things I miss, when I let myself think about it?\\n\\n I wonder if someone here knew her when she was young and could tell me what she was like then. Even if they did, they probably wouldn’t want to discuss her. Faction transfers are not really supposed to discuss their old factions once they become members. It’s supposed to make it easier for them to change their allegiance from family to faction—to embrace the principle “faction before blood.”\\n\\n I bury my face in the pillow. She asked me to tell Caleb to research the simulation serum—why? Does it have something to do with me being Divergent, with me being in danger, or is it something else? I sigh. I have a thousand questions, and she left before I could ask any of them. Now they swirl in my head, and I doubt I’ll be able to sleep until I can answer them. \\n\\n","sourceLink":"https://allnovel.net/divergent-divergent-1/page-17.html","bookId":1698,"book":{"id":1698,"title":"Divergent (Divergent #1)","description":"Storyline: Divergent (Divergent #1) \\n In Beatrice Prior\u0027s dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue--Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is--she can\u0027t have both. So she makes a choice that surprises everyone, including herself. \\n During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are--and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she\u0027s chosen. But Tris also has a secret, one she\u0027s kept hidden from everyone because she\u0027s been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, Tris also learns that her secret might help her save the ones she loves . . . or it might destroy her.\\n","cover":"https://allnovel.net/images/divergent-divergent-1.jpg","author":"Veronica Roth","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/divergent-divergent-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:57:12 AM"}}
