{"id":65458,"no":34,"title":"Page 34","content":"They are here to take me, like Peter and Drew and Al; to kill me. I know it. Simulation. This is a simulation. My heart hammering in my chest, I press my palm to the glass behind me and slide it to the left. It is not a mirror but a closet door. I tell myself where the weapon will be. It will be hanging against the right wall, just inches away from my hand. I don’t shift my eyes from the scarred man, but I find the gun with my fingertips and wrap my hand around the handle. I bite my lip and fire at the scarred man. I don’t wait to see if the bullet hits him—I aim at each featureless man in turn, as fast as I can. My lip aches from biting it so hard. The pounding on the window stops, but a screeching sound replaces it, and the fists turn into hands with bent fingers, scratching at the glass, fighting to get in. The glass creaks under the pressure of their hands, and then cracks, and then shatters. I scream. I don’t have enough bullets in my gun. Pale bodies—human bodies, but mangled, arms bent at odd angles, too-wide mouths with needle teeth, empty eye sockets—topple into my bedroom, one after the other, and scramble to their feet, scramble toward me. I pull back into the closet and shut the door in front of me. A solution. I need a solution. I sink into a crouch and press the side of the gun to my head. I can’t fight them off. I can’t fight them off, so I have to calm down. The fear landscape will register my slowing heartbeat and my even breath and it will move on to the next obstacle. I sit down on the floor of the closet. The wall behind me creaks. I hear pounding—the fists are at it again, hitting the closet door—but I turn and peer through the dark at the panel behind me. It is not a wall but another door. I fumble to push it aside and reveal the upstairs hallway. Smiling, I crawl through the hole and stand. I smell something baking. I am at home. Taking a deep breath, I watch my house fade. I forgot, for a second, that I was in Dauntless headquarters. And then Tobias is standing in front of me. But I’m not afraid of Tobias. I look over my shoulder. Maybe there’s something behind me that I’m supposed to focus on. But no—behind me is just a four-poster bed. A bed? Tobias walks toward me, slowly. What’s going on? I stare up at him, paralyzed. He smiles down at me. That smile looks kind. Familiar. He presses his mouth to mine, and my lips part. I thought it would be impossible to forget I was in a simulation. I was wrong; he makes everything else disintegrate. His fingers find my jacket zipper and pull it down in one slow swipe until the zipper detaches. He tugs the jacket from my shoulders. Oh, is all I can think, as he kisses me again. Oh. My fear is being with him. I have been wary of affection all my life, but I didn’t know how deep that wariness went. But this obstacle doesn’t feel the same as the others. It is a different kind of fear—nervous panic rather than blind terror. He slides his hands down my arms and then squeezes my hips, his fingers sliding over the skin just above my belt, and I shiver. I gently push him back and press my hands to my forehead. I have been attacked by crows and men with grotesque faces; I have been set on fire by the boy who almost threw me off a ledge; I have almost drowned—twice—and this is what I can’t cope with? This is the fear I have no solutions for—a boy I like, who wants to…have sex with me? Simulation Tobias kisses my neck. I try to think. I have to face the fear. I have to take control of the situation and find a way to make it less frightening. I look Simulation Tobias in the eye and say sternly, “I am not going to sleep with you in a hallucination. Okay?” Then I grab him by his shoulders and turn us around, pushing him against the bedpost. I feel something other than fear—a prickle in my stomach, a bubble of laughter. I press against him and kiss him, my hands wrapping around his arms. He feels strong. He feels…good. And he’s gone. I laugh into my hand until my face gets hot. I must be the only initiate with this fear. A trigger clicks in my ear. I almost forgot about this one. I feel the heft of a gun in my hand and curl my fingers around it, slipping my index finger over the trigger. A spotlight shines from the ceiling, its source unknown, and standing in the center of its circle of light are my mother, my father, and my brother. “Do it,” hisses a voice next to me. It is female, but harsh, like it’s cluttered with rocks and broken glass. It sounds like Jeanine. The barrel of a gun presses to my temple, a cold circle against my skin. The cold travels across my body, making the hair on the back of my neck stand on end. I wipe my sweaty palm on my pants and look at the woman through the corner of my eye. It is Jeanine. Her glasses are askew, and her eyes are empty of feeling. My worst fear: that my family will die, and that I will be responsible. “Do it,” she says again, more insistent this time. “Do it or I’ll kill you.” I stare at Caleb. He nods, his eyebrows tugged in, sympathetic. “Go ahead, Tris,” he says softly. “I understand. It’s okay.” My eyes burn. “No,” I say, my throat so tight it aches. I shake my head. “I’ll give you ten seconds!” the woman shouts. “Ten! Nine!” My eyes skip from my brother to my father. The last time I saw him, he gave me a look of contempt, but now his eyes are wide and soft. I have never seen him wear that expression in real life. “Tris,” he says. “You have no other option.” “Eight!” “Tris,” my mother says. She smiles. She has a sweet smile. “We love you.” “Seven!” “Shut up!” I shout, holding up the gun. I can do it. I can shoot them. They understand. They’re asking me to. They wouldn’t want me to sacrifice myself for them. They aren’t even real. This is all a simulation. “Six!” It isn’t real. It doesn’t mean anything. My brother’s kind eyes feel like two drills boring a hole in my head. My sweat makes the gun slippery. “Five!” I have no other option. I close my eyes. Think. I have to think. The urgency making my heart race depends on one thing, and one thing only: the threat to my life. “Four! Three!” What did Tobias tell me? Selflessness and bravery aren’t that different. “Two!” I release the trigger of my gun and drop it. Before I can lose my nerve, I turn and press my forehead to the barrel of the gun behind me. Shoot me instead. “One!” I hear a click, and a bang. CHAPTER THIRTY-ONE THE LIGHTS COME on. I stand alone in the empty room with the concrete walls, shaking. I sink to my knees, wrapping my arms around my chest. It wasn’t cold when I walked in, but it feels cold now. I rub my arms to get rid of the goose bumps. I have never felt relief like this before. Every muscle in my body relaxes at once and I breathe freely again. I can’t imagine going through my fear landscape in my spare time, like Tobias does. It seemed like bravery to me before, but now it seems more like masochism. The door opens, and I stand. Max, Eric, Tobias, and a few people I don’t know walk into the room in a line, standing in a small crowd in front of me. Tobias smiles at me. “Congratulations, Tris,” says Eric. “You have successfully completed your final evaluation.” I try to smile. It doesn’t work. I can’t shake the memory of the gun against my head. I can still feel the barrel between my eyebrows. “Thanks,” I say. “There is one more thing before you can go and get ready for the welcoming banquet,” he says. He beckons to one of the unfamiliar people behind him. A woman with blue hair hands him a small black case. He opens it and takes out a syringe and a long needle. I tense up at the sight of it. The orange-brown liquid in the syringe reminds me of what they inject us with before simulations. And I am supposed to be finished with those. “At least you aren’t afraid of needles,” he says. “This will inject you with a tracking device that will be activated only if you are reported missing. Just a precaution.” “How often do people go missing?” I ask, frowning. “Not often.” Eric smirks. “This is a new development, courtesy of the Erudite. We have been injecting every Dauntless throughout the day, and I assume all other factions will comply as soon as possible.” My stomach twists. I can’t let him inject me with anything, especially not anything developed by Erudite—maybe even by Jeanine. But I also can’t refuse. I can’t refuse or he will doubt my loyalty again. “All right,” I say, my throat tight. Eric approaches me with the needle and syringe in hand. I pull my hair away from my neck and tilt my head to the side. I look away as Eric wipes my neck with an antiseptic wipe and eases the needle into my skin. The deep ache spreads through my neck, painful but brief. He puts the needle back in its case and sticks an adhesive bandage on the injection site. “The banquet is in two hours,” he says. “Your ranking among the other initiates, Dauntless-born included, will be announced then. Good luck.” The small crowd files out of the room, but Tobias lingers. He pauses by the door and beckons for me to follow him, so I do. The glass room above the Pit is full of Dauntless, some of them walking the ropes above our heads, some talking and laughing in groups. He smiles at me. He must not have been watching. “I heard a rumor that you only had seven obstacles to face,” he says. “Practically unheard of.” “You…you weren’t watching the simulation?” “Only on the screens. The Dauntless leaders are the only ones who see the whole thing,” he says. “They seemed impressed.” “Well, seven fears isn’t as impressive as four,” I reply, “but it will suffice.” “I would be surprised if you weren’t ranked first,” he says. We walk into the glass room. The crowd is still there, but it is thinner now that the last person—me—has gone. People notice me after a few seconds. I stay close to Tobias’s side as they point, but I can’t walk fast enough to avoid some cheers, some claps on the shoulder, some congratulations. As I look at the people around me, I realize how strange they would look to my father and brother, and how normal they seem to me, despite all the metal rings in their faces and the tattoos on their arms and throats and chests. I smile back at them. We descend the steps into the Pit and I say, “I have a question.” I bite my lip. “How much did they tell you about my fear landscape?” “Nothing, really. Why?” he says. “No reason.” I kick a pebble to the side of the path. “Do you have to go back to the dormitory?” he asks. “Because if you want peace and quiet, you can stay with me until the banquet.” My stomach twists. “What is it?” he asks. I don’t want to go back to the dormitory, and I don’t want to be afraid of him. “Let’s go,” I say. He closes the door behind us and slips off his shoes. “Want some water?” he says. “No thanks.” I hold my hands in front of me. “You okay?” he says, touching my cheek. His hand cradles the side of my head, his long fingers slipping through my hair. He smiles and holds my head in place as he kisses me. Heat spreads through me slowly. And fear, buzzing like an alarm in my chest. His lips still on mine, he pushes the jacket from my shoulders. I flinch when I hear it drop, and push him back, my eyes burning. I don’t know why I feel this way. I didn’t feel like this when he kissed me on the train. I press my palms to my face, covering my eyes. “What? What’s wrong?” I shake my head. “Don’t tell me it’s nothing.” His voice is cold. He grabs my arm. “Hey. Look at me.” I take my hands from my face and lift my eyes to his. The hurt in his eyes and the anger in his clenched jaw surprise me. “Sometimes I wonder,” I say, as calmly as I can, “what’s in it for you. This…whatever it is.” “What’s in it for me,” he repeats. He steps back, shaking his head. “You’re an idiot, Tris.” “I am not an idiot,” I say. “Which is why I know that it’s a little weird that, of all the girls you could have chosen, you chose me. So if you’re just looking for…um, you know…that…” “What? Sex?” He scowls at me. “You know, if that was all I wanted, you probably wouldn’t be the first person I would go to.” I feel like he just punched me in the stomach. Of course I’m not the first person he would go to—not the first, not the prettiest, not desirable. I press my hands to my abdomen and look away, fighting off tears. I am not the crying type. Nor am I the yelling type. I blink a few times, lower my hands, and stare up at him. “I’m going to leave now,” I say quietly. And I turn toward the door. “No, Tris.” He grabs my wrist and wrenches me back. I push him away, hard, but he grabs my other wrist, holding our crossed arms between us. “I’m sorry I said that,” he says. “What I meant was that you aren’t like that. Which I knew when I met you.” “You were an obstacle in my fear landscape.” My lower lip wobbles. “Did you know that?” “What?” He releases my wrists, and the hurt look is back. “You’re afraid of me?” “Not you,” I say. I bite my lip to keep it still. “Being with you…with anyone. I’ve never been involved with someone before, and…you’re older, and I don’t know what your expectations are, and…” “Tris,” he says sternly, “I don’t know what delusion you’re operating under, but this is all new to me, too.”","sourceLink":"https://allnovel.net/divergent-divergent-1/page-34.html","bookId":1698,"book":{"id":1698,"title":"Divergent (Divergent #1)","description":"Storyline: Divergent (Divergent #1) In Beatrice Prior\u0027s dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue--Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is--she can\u0027t have both. So she makes a choice that surprises everyone, including herself. During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are--and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she\u0027s chosen. But Tris also has a secret, one she\u0027s kept hidden from everyone because she\u0027s been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, Tris also learns that her secret might help her save the ones she loves . . . or it might destroy her.","cover":"https://allnovel.net/images/divergent-divergent-1.jpg","author":"Veronica Roth","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/divergent-divergent-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:57:12 AM"}}
