{"id":71658,"no":28,"title":"Page 28","content":"A little chime went off inside her backpack. Emily swiveled around, reaching for her phone. Maybe it was Isaac, writing to apologize. And maybe she should apologize too. He and his mom were close, and she certainly didn’t want to hate his family. Maybe she should’ve found another way to break the news instead of blindsiding him with it. Emily opened the new text, swallowing a sniffle. It wasn’t from Isaac. Too distracted to decipher my clues? Go to your first love’s old house and maybe it’ll all make sense.—A Emily glowered at the screen. She’d had it with these vague clues. What did A want? She slowly pulled out of the Wawa parking lot, braking to let a Jeep full of high school boys cut in front of her. Go to your first love’s old house. A obviously meant Ali. She’d take the bait; Ali’s old neighborhood was only a few blocks away. What else did she have to do right now? It wasn’t like she could bang on Isaac’s door, begging for him to come back. She turned onto a quiet road with acres of rolling farmland, tears still stinging her eyes. The stop sign to Ali’s street came up fast. There was a WATCH CHILDREN sign at the entrance to the neighborhood. Years ago on a warm, sticky summer night, Ali and Emily had decorated the sign with smiley-face stickers they’d bought at a party store. They were all gone now. Ali’s old house loomed at the end of the street, the Ali shrine a dark, shadowy lump at the curb. Maya’s family lived in the house now. A few of the lights were on, including the one in Ali’s old bedroom—Maya’s new bedroom. As Emily stared up at it, Maya appeared, almost as though she’d known Emily was going to be there. Emily gasped, shrank away from the window, gripped the steering wheel, and peeled around the cul-de-sac. Once she was in front of Spencer’s driveway, she pulled over, too overcome to go on. Then she saw a flicker of something to her right. Someone in a white T-shirt was standing in the front window of the Cavanaughs’ house. Emily turned off the headlights. Whoever was in the window was tall and somewhat broad, probably a guy. His face was obscured by a large, square-shaped floor lamp. Suddenly, Jenna appeared next to him. Emily sucked in her breath. Jenna’s dark hair cascaded down her shoulders. She wore a black T-shirt and plaid pajama pants. Her dog sat next to her, scratching his neck with his hind leg. Jenna turned and spoke to the guy. She spoke for a long time, and then he said something back. Jenna nodded, listening. The guy waved his arms, as if Jenna could see his gestures. His face was still hidden. Jenna’s posture got defensive. The guy spoke again, and Jenna lowered her head, as if ashamed. She brushed a few strands of hair away from her big Gucci sunglasses. She said something else, her face contorted with an expression Emily couldn’t rightly determine. Sorrow? Worry? Fear? Then Jenna walked away, her dog following. The guy rubbed his hands through his hair, obviously flustered. Then the living room lamp snapped off. Emily leaned forward, squinting hard, but she couldn’t see anything. She looked around at Jenna’s yard. There were still wood blocks fastened to the tree trunk, makeshift steps to get into Toby’s old tree house. Mr. Cavanaugh had taken the tree house down shortly after the firework blinded Jenna. It was amazing that after all this time, the Cavanaughs still blamed Toby for blinding his sister. In truth, it had been Ali who had done it. And it had been Jenna who had wanted to set up the prank to get rid of Toby for good. The Cavanaughs’ front door opened, and Emily ducked again. The guy from the living room stomped down the front steps to the dark front path. When the motion-sensor light above the garage doors snapped on, he froze, startled. Emily saw him head-on, flooded with light. He wore running sneakers and a heavy down parka. Both hands were curled into tight, angry fists. When Emily’s eyes got to his face, her stomach dropped to the bottom of her boots. He was glaring right at her. She instantly realized who it was. “Oh my God,” she whispered. That shaggy blond hair, those bow-shaped lips, those stark blue eyes, still locked with hers. It was Jason DiLaurentis. Emily shifted into drive and gunned down the street. Only at the corner did she turn her lights on again. And then she heard her cell phone beep. She rifled through her purse, grabbed it, and looked at the screen. One new text message. What do you think HE’S so angry about?—A 22 NOTHING LIKE AN ULTIMATUM TO KICK OFF THE WEEKEND There it was. The big Victorian house at the corner of the cul-de-sac, the one with the rose trellises along the fence and the wraparound teak deck in the back. Yellow Do Not Cross police tape was supposed to be around the half-dug hole in the backyard…only there was no tape anywhere. As a matter of fact, there wasn’t a hole anywhere. The yard was a wide, flat expanse of freshly mown grass, untouched by backhoes or bulldozers. Hanna looked down. She was on her old mountain bike, the one she hadn’t touched since she got a driver’s license. And her hands looked swollen. Her jeans strained across her butt. Her thighs bulged. A strand of poop-brown hair fell over her eyes. She ran her tongue over her teeth and felt rough, metal braces. When she gazed into Ali’s backyard, she saw Spencer crouched behind the raspberry bushes that bordered Ali’s house and hers. Spencer’s hair was shorter and a little lighter, the way it looked in sixth grade. There was skinny, baby-faced Emily behind the tomato vines, her eyes darting nervously back and forth. Aria, with big pink streaks in her hair and wearing a freaky German tunic, ducked next to a big oak. Hanna shuddered. She knew why they were here—they wanted to steal Ali’s flag. This was the Saturday after Time Capsule had begun. The four girls marched to one another, annoyed. Then they heard a thud, and the back door opened. Hanna and the others crouched behind the trees while Jason stormed across the yard. The patio door slammed again. Ali stood on the porch, her hands on her hips, her blond hair spilling down her shoulders, her lips pink and shiny. “You can come out,” she called. Sighing, Ali marched across the yard, her wedge heels sinking into the wet grass. When she approached Hanna and the others, she reached into her pocket and pulled out a shiny piece of blue cloth. It looked exactly like the piece of the Time Capsule flag Hanna had found at Steam a few days ago. But hadn’t Ali lost her flag? Hanna looked at the others, confused, but her old friends didn’t seem to notice that anything was amiss. “So this is how I’ve decorated it,” Ali explained, pointing at the different drawings on the flag. “Here’s the Chanel logo. And this is the manga frog, and here’s the field hockey girl. And don’t you love this Louis Vuitton pattern?” “The flag looks like a purse,” Spencer oohed. Hanna regarded them uneasily. Something felt scrambled. This wasn’t happening like it was supposed to. And then, Ali snapped her fingers, and Hanna’s old friends froze. Aria’s hand hung motionless, almost touching Ali’s flag. A few strands of Emily’s hair were suspended in air, caught by a breeze. Spencer had an odd expression on her face, something between a fake smile and a grimace. Hanna wiggled her fingers. She was the only one not frozen. She stared at Ali, her heart pounding hard. Ali smiled sweetly. “You’re looking much better, Hanna. Completely recovered, huh?” Hanna gazed down at her too-tight jeans and ran her hands through her limp hair. Recovered wasn’t the word she’d have chosen. Her recovery from loser to diva wouldn’t happen for another few years. Ali shook her head, noting Hanna’s confusion. “From the accident, silly. Don’t you remember me from the hospital?” “H-hospital?” Ali brought her face close to Hanna’s. “They say people should always talk to coma patients. They can hear. Did you hear me?” Hanna felt dizzy. Suddenly, she was back in her hospital room at Rosewood Memorial, where the EMTs had taken her after her car accident. There was a round, bright fluorescent light above her head. She could hear the hiss of the various machines that monitored her vital signs and fed her intravenously. In the hazy space between coma and consciousness, Hanna thought she saw someone looming over her bed. Someone who looked startlingly like Ali. “It’s okay,” the girl lilted, her voice exactly the same as Ali’s. “I’m okay.” Hanna glowered at Ali. “That was a dream.” Ali raised a flirtatious eyebrow as if to say, was it? Hanna glanced at her old friends. They were still immobile. She wished they’d unfreeze—she felt way too alone with Ali, as if they were the only two people left in the whole world. Ali waved her Time Capsule flag in Hanna’s face. “See this? You need to find it, Hanna.” Hanna shook her head. “Ali, your piece is lost forever. Remember?” “Uh-uh,” Ali protested. “It’s still here. And if you find it, I’ll tell you all about it.” Hanna widened her eyes. “All about…what?” Ali put a finger to her lips. “The two of them.” She cackled eerily. “Two of them…what?” “They know everything.” Hanna blinked. “Huh? Who?” Ali rolled her eyes. “Hanna, you are so slow.” She stared right at her. “Sometimes, I don’t notice I’m singing. Remember that?” “What do you mean?” Hanna asked, desperate. “Singing…what?” “Come on, Hanna.” Ali looked bored. She tipped her head to the sky, thinking for a moment. “Okay, how about…go fish?” “Go…fish?” Hanna repeated. “The card game?” Ali grunted, frustrated. “No. Go fish.” She waved her arms, trying to make Hanna get it. “Go fish!” “What are you talking about?” Hanna cried desperately. “GO FISH!” Ali screamed. “Go fish! Go fish!” She repeated it over and over, like it was the only thing she could say. When she grazed Hanna’s cheek with her fingers, Hanna’s skin felt sticky and wet. Hanna touched her face, alarmed. When she pulled her hands away, they were covered in blood. Hanna shot up, her eyes popping open. She was in her bedroom. Pale morning light streamed through the windows. It was Saturday morning—but a Saturday morning in eleventh grade, not sixth. Dot was standing on Hanna’s pillow, licking Hanna’s face. She touched her cheek. There wasn’t blood there, just doggie drool. You need to find it, Hanna. If you find it, I’ll tell you all about it. Hanna groaned, rubbed her eyes, and reached for her Time Capsule flag, which was smoothed out on her nightstand. It was a stupid dream, end of story. She heard voices in the hallway, first her father’s joking tone, then Kate’s shrill laugh. Hanna grabbed a handful of sheets and squeezed. That was it. Kate might have stolen Hanna’s father, but she wasn’t stealing Mike too. Abruptly, the urgent images from her dream faded away. Hanna bolted out of bed and pulled on her snug-fitting cashmere sweaterdress. In English class yesterday, she’d overheard Noel Kahn tell Mason Byers that the lacrosse team was meeting for a weekend workout at Philly Sports Club. She had a feeling wherever Noel went, Mike would go too. She hadn’t yet gotten back to Mike about bringing Kate to the Radley party because she hadn’t known what to say. Now she did.","sourceLink":"https://allnovel.net/killer-pretty-little-liars-6/page-28.html","bookId":2383,"book":{"id":2383,"title":"Killer (Pretty Little Liars #6)","description":"Storyline: Killer (Pretty Little Liars #6) In picture-perfect Rosewood, Pennsylvania, ash-blond highlights gleam in the winter sun and frozen lakes sparkle like Swarovski crystals. But pictures often lie— and so do Rosewood\u0027s four prettiest girls. Hanna, Aria, Spencer, and Emily have been lying ever since they became friends with beautiful Alison DiLaurentis. Ali made them do terrible things—things they had to keep secret for years. And even though Ali was killed at the end of seventh grade, their bad-girl ways didn\u0027t die with her. Hanna\u0027s on a mission to corrupt Rosewood\u0027s youth, starting with a very attractive sophomore. Aria\u0027s snooping into her boyfriend\u0027s past. Spencer\u0027s stealing— from her family. And pure little Emily\u0027s abstaining from abstinence. The girls should be careful, though. They thought they were safe when Ali\u0027s killer was arrested and A\u0027s true identity was finally revealed. But now there\u0027s a new A in town turning up the heat. And this time Rosewood is going to burn.","cover":"https://allnovel.net/images/killer-pretty-little-liars-6.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/killer-pretty-little-liars-6.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:20:39 AM"}}
