{"id":37164,"no":10,"title":"CHAPTER X","content":"“Our acts our angels are, or good or ill, Our fatal shadows that walk by us still.” Naturally there was considerable agitation in the Roberts family on account of Helen\u0027s strange behavior; early the next morning Mrs. Roberts was at her niece\u0027s door, trying to gain admittance. This time she did not have to knock but once, and when she entered she was surprised to see that Helen was already up and dressing. She had been expecting to find the girl more prostrated than ever, and so the discovery was a great relief to her; she stood gazing at her anxiously. “Helen, dear,” she said, “I scarcely know how to begin to talk to you about your extraordinary—” “I wish,” interrupted Helen, “that you would not begin to talk to me about it at all.” “But you must explain to me what in the world is the matter,” protested the other. “I cannot possibly explain to you,” was the abrupt reply. Helen\u0027s voice was firm, and there was a determined look upon her face, a look which quite took her aunt by surprise. “But, my dear girl!” she began once more. “Aunt Polly!” said the other, interrupting her again, “I wish instead of talking about it you would listen to what I have to say for a few moments. For I have made up my mind just what I am going to do, and I am going to take the reins in my own hands and not do any arguing or explaining to anyone. And there is no use of asking me a word about what has happened, for I could not hope to make you understand me, and I do not mean to try.” As Helen uttered those words she fixed her eyes upon her aunt with an unflinching gaze, with the result that Mrs. Roberts was quite too much taken aback to find a word to say. Without waiting for anything more Helen turned to the table. “Here is a letter,” she said, “which I have written to Mr. Harrison; you know his address in New York, I suppose?” “His address?” stammered the other; “why,—yes, of course. But what in the world—” “I wish this letter delivered to him at once, Aunt Polly,” Helen continued. “It is of the utmost importance, and I want you to do me the favor to send someone into the city with it by the next train.” “But, Helen, dear—” “Now please do not ask me anything about it,” went on the girl, impatiently. “I have told you that you must let me manage this affair myself. If you will not send it I shall simply have to get someone to take it. He must have it, and have it at once.” “Will it not do to mail it, Helen?” “No, because I wish him to get it this morning.” And Helen put the letter into her aunt\u0027s hands, while the latter gazed helplessly, first at it, and then at the girl. There is an essay of Bacon\u0027s in which is set forth the truth that you can bewilder and master anyone if you are only sufficiently bold and rapid; Mrs. Roberts was so used to managing everything and being looked up to by everyone that Helen\u0027s present mood left her quite dazed. Nor did the girl give her any time to recover her presence of mind. “There is only one thing more,” she said, “I want you to have breakfast as soon as you can, and then to let me have a carriage at once.” “A carriage?” echoed the other. “Yes, Aunt Polly, I wish to drive over to Hilltown immediately.” “To Hilltown!” gasped Aunt Polly with yet greater consternation, and showing signs of resistance at last; “pray what—” But Helen only came again to the attack, with yet more audacity and confidence. “Yes,” she said, “to Hilltown; I mean to go to see Arthur.” For answer to that last statement, poor Mrs. Roberts had simply no words whatever; she could only gaze, and in the meantime, Helen was going calmly on with her dressing, as if the matter were settled. “Will Mr. Howard be down to breakfast?” she asked. “As he is going away to-day, I presume he will be down,” was the reply, after which Helen quickly completed her toilet, her aunt standing by and watching her in the meantime. “Helen, dear,” she asked at last, after having recovered her faculties a trifle, “do you really mean that you will not explain to me a thing of what has happened, or of what you are doing?” “There is so much, Aunt Polly, that I cannot possibly explain it now; I have too much else to think of. You must simply let me go my way, and I will tell you afterwards.” “But, Helen, is that the right way to treat me? Is it nothing to you, all the interest that I have taken in this and all that I have done for you, that you should think so little of my advice?” “I do not need any advice now,” was the answer. “Aunt Polly, I see exactly what I should do, and I do not mean to stop a minute for anything else until I have done it. If it seems unkind, I am very sorry, but in the meantime it must be done.” And while she was saying the words, Helen was putting on her hat; then taking up her parasol and gloves she turned towards her aunt. “I am ready now,” she said, “and please let me have breakfast just as soon as you can.” The girl was so much preoccupied with her own thoughts and purposes that she scarcely even heard what her aunt said; she went down into the garden where she could be alone, and paced up and down impatiently until she heard the bell. Then she went up into the dining room, where she found her aunt and uncle in conversation with Mr. Howard. Helen had long been preparing herself to meet him, but she could not keep her cheeks from flushing or keep from lowering her eyes; she bit her lips together, however, and forced herself to look at him, saying very resolutely, “Mr. Howard, I have to drive over to Hilltown after breakfast, and I wish very much to talk to you about something; would you like to drive with me?” “Very much indeed,” said he, quietly, after which Helen said not a word more. She saw that her aunt and uncle were gazing at her and at each other in silent wonder, but she paid no attention to it. After eating a few hurried mouthfuls she excused herself, and rose and went outside, where she saw the driving-cart which had been bought for her use, waiting for her. It was not much longer before Mr. Howard was ready, for he saw her agitation. “It is rather a strange hour to start upon a drive,” she said to him, “but I have real cause for hurrying; I will explain about it.” And then she stopped, as her aunt came out to join them. It was only a moment more before Mr. Howard had excused himself, and the two were in the wagon, Helen taking the reins. She waved a farewell to her aunt and then started the horse, and they were whirled swiftly away down the road. All the morning Helen\u0027s mind had been filled with things that she wished to say to Mr. Howard. But now all her resolution seemed to have left her, and she was trembling very much, and staring straight ahead, busying herself with guiding the horse. When they were out upon the main road where they might go as fast as they pleased without that necessity, she swallowed the lump in her throat and made one or two nervous attempts to speak. Mr. Howard in the meantime had been gazing in front of him thoughtfully. “Miss Davis,” he said suddenly, turning his eyes upon her, “may I ask you a question?” “Yes,” said Helen faintly. “You heard all that I said about you last night?” And Helen turned very red and looked away. “Yes, I heard it all,” she said; and then there was a long silence. It was broken by the man, who began in a low voice: “I scarcely know how, Miss Davis, I can apologize to you—” And then he stopped short, for the girl had turned her glance upon him, wonderingly. “Apologize?” she said; she had never once thought of that view of it, and the word took her by surprise. “Yes,” said Mr. Howard; “I said so many hard and cruel things that I cannot bear to think of them.” Helen still kept her eyes fixed upon him, as she said, “Did you say anything that was not true, Mr. Howard?” The man hesitated a moment, and then he answered: “I said many things that I had no right to say to you.” “That is not it,” said Helen simply. “Did you say anything that was not true?” Again Mr. Howard paused. “I am quite sure that I did,” he said at last. “Most of what I said I feel to have been untrue since I have seen how it affected you.” “Because it made me so ashamed?” said Helen. And then some of the thoughts that possessed her forced their way out, and she hurried on impetuously: “That was the first thing I wanted to tell you. It is really true that you were wrong, for I am not hard-hearted at all. It was something that my—that people were making me do, and all the time I was wretched. It was dreadful, I know, but I was tempted, because I do love beautiful things. And it was all so sudden, and I could not realize it, and I had nobody to advise me, for none of the people I meet would think it was wrong. You must talk to me and help me, because I\u0027ve got to be very strong; my aunt will be angry, and when I get back perhaps Mr. Harrison will be there, and I shall have to tell him.” Then the girl stopped, out of breath and trembling with excitement; Mr. Howard turned abruptly and fixed his dark eyes upon her. “Tell him,” he said. “Tell him what?” “That I shall not marry him, of course,” answered Helen; the other gave a start, but she was so eager that she did not even notice it. “I could not lose a minute,” she said. “For it was so very dreadful, you know.” “And you really mean not to marry him?” asked the other. “Mean it!” echoed the girl, opening her eyes very wide. “Why, how in the world could you suppose—” And then she stopped short, and laughed nervously. “Of course,” she said, “I forgot; you might suppose anything. But, oh, if I could tell you how I have suffered, Mr. Howard, you would understand that I could never have such a thought again in the world. Please do understand me, for if I had really been so base I should not come to you as I do after what I heard. I cannot tell you how dreadfully I suffered while I was listening, but after I had cried so much about it, I felt better, and it seemed to me that it was the best thing that could have happened to me, just to see my actions as they seemed to someone else,—to someone who was good. I saw all at once the truth of what I was doing, and it was agony to me to know that you thought so of me. That was why I could not rest last night until I had told you that I was really unhappy; for it was something that I was unhappy, wasn\u0027t it, Mr. Howard?” “Yes,” said the other, “it was very much indeed.” “And oh, I want you to know the truth,” Helen went on swiftly. “Perhaps it is just egotism on my part, and I have really no right to tell you all about myself in this way; and perhaps you will scorn me when you come to know the whole truth. But I cannot help telling you about it, so that you may advise me what to do; I was all helpless and lost, and what you said came last night like a wonderful light. And I don\u0027t care what you think about me if you will only tell me the real truth, in just the same way that you did; for I realized afterwards that it was that which had helped me so. It was the first time in my life that it had ever happened to me; when you meet people in the world, they only say things that they know will please you, and that does you no good. I never realized before how a person might go through the world and really never meet with another heart in all his life; and that one can be fearfully lonely, even in a parlor full of people. Did you ever think of that, Mr. Howard?” Mr. Howard had fixed his keen eyes upon the girl as she went breathlessly on; she was very pale, and the sorrow through which she had passed had left, “I have been so cold and wicked, that you will soon scorn me altogether.” “I do not think that is possible,” said her companion, gently, as he saw the girl choking back a sob. “Well, listen then,” Helen began; but then she stopped again. “Do you wish me to tell you?” she asked. “Do you care anything about it at all, or does it seem—” “I care very much about it, indeed,” the other answered. “However dreadful it may seem,” said Helen. “Oh, please know that while I have been doing it, it has made me utterly wretched, and that I am so frightened now that I can scarcely talk to you; and that if there is anything that I can do—oh, absolutely anything—I will do it!” Then the girl bit her lips together and went on with desperate haste, “It\u0027s what you said about what would happen if there were someone else to love me, and to see how very bad I was!” “There is some such person?” asked the man, in a low voice. “Yes,” said she. “It is someone I have known as long as I can remember. And he loves me very much indeed, I think; and while I was letting myself be tempted in this way he was very sick, and because I knew I was so bad I did not dare go near him; and yesterday when he heard I was going to marry this man, it almost killed him, and I do not know what to fear now.” Then, punishing herself very bravely and swallowing all her bitter shame, Helen went on to tell Mr. Howard of Arthur, and of her friendship with him, and of how long he had waited for her; she narrated in a few words how he had left her, and then how she had seen him upon the road. Afterwards she stopped and sat very still, trembling, and with her eyes lowered, quite forgetting that she was driving. “Miss Davis,” said the other, gently, seeing how she was suffering, “if you wish my advice about this, I should not worry myself too much; it is better, I find in my own soul\u0027s life, to save most of the time that one spends upon remorse, and devote it to action.” “To action?” asked Helen. “Yes,” said the other. “You have been very thoughtless, but you may hope that nothing irrevocable has happened; and when you have seen your friend and told him the truth just as you have told it to me, I fancy it will bring him joy enough to compensate him for what he has suffered.” “That was what I meant to do,” the girl went on. “But I have been terrified by all sorts of fancies, and when I remember how much pain I caused him, I scarcely dare think of speaking to him. When I saw him by the roadside, Mr. Howard, he seemed to me to look exactly like you, there was such dreadful suffering written in his face.” “A man who lives as you have told me your friend has lived,” said the other, “has usually a very great power of suffering; such a man builds for himself an ideal which gives him all his joy and his power, and makes his life a very glorious thing; but when anything happens to destroy his vision or to keep him from seeking it, he suffers with the same intensity that he rejoiced before. The great hunger that was once the source of his power only tears him to pieces then, as steam wrecks a broken engine.” “It\u0027s very dreadful,” Helen said, “how thoughtless I was all along. I only knew that he loved me very much, and that it was a vexation to me.” Mr. Howard glanced at her. “You do not love him?” he asked. “No,” said Helen, quickly. “If I had loved him, I could never have had a thought of all these other things. But I had no wish to love anybody; it was more of my selfishness.” “Perhaps not,” the other replied gently. “Some day you may come to love him, Miss Davis.” “I do not know,” Helen said. “Arthur was very impatient.” “When a man is swift and eager in all his life,” said Mr. Howard, smiling, “he cannot well be otherwise in his love. Such devotion ought to be very precious to a woman, for such hearts are not easy to find in the world.” Helen had turned and was gazing anxiously at Mr. Howard as he spoke to her thus. “You really think,” she said, “that I should learn to appreciate Arthur\u0027s love?” “I cannot know much about him from the little you have told me,” was the other\u0027s answer. “But it seems to me that it is there you might find the best chance to become the unselfish woman that you wish to be.” “It is very strange,” the girl responded, wonderingly, “how differently you think about it. I should have supposed I was acting very unwisely indeed if I loved Arthur; everyone would have told me of his poverty and obscurity, and of how I must give up my social career.” “I think differently, perhaps,” Mr. Howard said, “because I have lived so much alone. I have come to know that happiness is a thing of one\u0027s own heart, and not of externals; the questions I should ask about a marriage would not be of wealth and position. If you really wish to seek the precious things of the soul, I should think you would be very glad to prove it by some sacrifice; and I know that two hearts are brought closer, and all the memories of life made dearer, by some such trial in the early days. People sneer at love in a cottage, but I am sure that love that could wish to live anywhere else is not love. And as to the social career, a person who has once come to know the life of the heart soon ceases to care for any kind of life that is heartless; a social career is certainly that, and in comparison very vulgar indeed.” Helen looked a little puzzled, and repeated the word “vulgar” inquiringly. Mr Howard smiled. “That is the word I always use when I am talking about high life,” he said, laughing. “You may hurl the words \u0027selfish\u0027 and \u0027worldly\u0027 at it all you please, and never reach a vital spot; but the word \u0027vulgar\u0027 goes straight to the heart.” “You must explain to me why it is that,” said Helen, with so much seriousness that the other could not help smiling again. “Perhaps I cannot make anyone else see the thing as I do,” was his reply. “And yet it seems rery simple. When a man lives a while in his own soul, he becomes aware of the existence of a certain spiritual fact which gives life all its dignity and meaning; he learns that this sacred thing demands to be sought for, and worshiped; and that the man who honors it and seeks it is only hailed as gentleman, and aristocrat, and that he who does not honor it and seek it is vulgar, tho he be heir of a hundred earls, and leader of all society, and lord of millions. Every day that one lives in this presence that I speak of, he discovers a little more how sacred a thing is true nobility, and how impertinent is the standard that values men for the wealth they win, or for the ribbons they wear, or for anything else in the world. I fancy that you, if you came once to love your friend, would find it very easy to do without the admiration of those who go to make up society; they would come to seem to you very trivial and empty people, and afterwards, perhaps, even very cruel and base.” Mr. Howard stopped; but then seeing that Helen was gazing at him inquiringly once more he added, gravely, “One could be well content to let vain people strut their little hour and be as wonderful as they chose, if it were not for the painful fact that they are eating the bread of honest men, and that millions are toiling and starving in order that they may have ease and luxury. That is such a very dreadful thing to know that sometimes one can think of nothing else, and it drives him quite mad.” The girl sat very still after that, trembling a little in her heart; finally she asked, her voice shaking slightly, “Mr. Howard, what can one do about such things?” “Very little,” was the reply, “for they must always be; but at least one can keep his own life earnest and true. A woman who felt such things very keenly might be an inspiration to a man who was called upon to battle with selfishness and evil.” “You are thinking of Arthur once more?” asked the girl. “Yes,” answered the other, with a slight smile. “It would be a happy memory for me, to know that I have been able to give you such an ideal. Some of these days, you see, I am hoping that we shall again have a poet with a conviction and a voice, so that men may know that sympathy and love are things as real as money. I am quite sure there never was a nation so ridiculously sodden as our own just at present; all of our maxims and ways of life are as if we were the queer little Niebelung creatures that dig for treasure in the bowels of the earth, and see no farther than the ends of their shovels; we live in the City of God, and spend all our time scraping the gold of the pavements. Your uncle told me this morning that he did not see why a boy should go to college when he can get a higher salary if he spends the four years in business. I find that there is nothing to do but to run away and live alone, if one wants really to believe that man is a spiritual nature, with an infinite possibility of wonder and love; and that the one business of his life is to develop that nature by contact with things about him; and that every act of narrow selfishness he commits is a veil which he ties about his own eyes, and that when he has tied enough of them, not all the pearl and gold of the gorgeous East can make him less a pitiable wretch.” Mr. Howard stopped again, and smiled slightly; Helen sat gazing thoughtfully ahead, thinking about his way of looking at life, and how very strange her own actions seemed in the light of it. Suddenly, however, because throughout all the conversation there had been another thought in her consciousness, she glanced ahead and urged the horse even faster. She saw far in the distance the houses of the place to which she was bound, and she said nothing more, her companion also becoming silent as he perceived her agitation. Helen had been constantly growing more anxious, so that now the carriage could not travel fast enough; it seemed to her that everything depended upon what she might find at Hilltown. It was only the thought of Arthur that kept her from feeling completely free from her wretchedness; she felt that she might remedy all the wrong that she had done, and win once more the prize of a good conscience, provided only that nothing irretrievable had happened to him. Now as she came nearer she found herself imagining more and more what might have happened, and becoming more and more impatient. There was a balance dangling before her eyes, with utter happiness on one side and utter misery on the other; the issue depended upon what she discovered at Hilltown. The two sat in silence, both thinking of the same thing, as they whirled past the place where Helen had seen Arthur before. The girl trembled as she glanced at it, for all of the previous day\u0027s suffering rose before her again, and made her fears still more real and importunate. She forced herself to look, however, half thinking that she might see Arthur again; but that did not happen, and in a minute or two more the carriage had come to the house where he lived. She gave the reins to Mr. Howard, and sprang quickly out; she rang the bell, and then stood for a minute, twitching her fingers, and waiting. The woman who kept the house, and whom Helen knew personally, opened the door; the visitor stepped in and gasped out breathlessly, “Where is Arthur?” Her hands shook visibly as she waited for the reply. “He is not in, Miss Davis,” the woman answered. “Where is he?” Helen cried. “I do not know,” was the response. “He has gone.” “Gone!” And the girl started back, catching at her heart. “Gone where?” “I do not know, Miss Davis.” “But what—” began the other. “This will tell you all I know,” said the woman, as she fumbled in her apron, and put a scrap of crumpled paper into Helen\u0027s trembling hands. The girl seized it and glanced at it; then she staggered back against the wall, ghastly pale and almost sinking. The note, in Arthur\u0027s hand, but so unsteady as to be almost illegible, ran thus: “You will find in this my board for the past week; I am compelled to leave Hilltown, and I shall not ever return.” And that was all. Helen stared at it and stared again, and then let it fall and gazed about her, echoing, in a hollow voice, “And I shall not ever return!” “That is all I can tell you about it,” went on the woman. “I have not seen him since Elizabeth was here yesterday morning; he came back late last night and packed his bag and went away.” Helen sank down upon a chair and buried her face in her hands, quite overwhelmed by the suddenness of that discovery. She remained thus for a long time, without either sound or motion, and the woman stood watching her, knowing full well what was the matter. When Helen looked up again there was agony written upon her countenance. “Oh, are you sure you have no idea where I can find him?” she moaned. “No, Miss Davis,” said the woman. “I was asounded when I got this note.” “But someone must know, oh, surely they must! Someone must have seen him,—or he must have told someone!” “I think it likely that he took care not to,” was the reply. The thought was a death-knell to Helen\u0027s last hope, and she sank down, quite overcome; she knew that Arthur could have had but one motive in acting as he had,—that he meant to cut himself off entirely from all his old life and surroundings. He had no friends in Hilltown, and having lived all alone, it would be possible for him to do it. Helen remembered Mr. Howard\u0027s saying of the night before, how the sight of her baseness might wreck a man\u0027s life forever, and the more she thought of that, the more it made her tremble. It seemed almost more than she could bear to see this fearful consequence of her sin, and to know that it had become a fact of the outer world, and gone beyond her power. It seemed quite too cruel that she should have such a thing on her conscience, and have it there forever; most maddening of all was the thought that it had depended upon a few hours of time. “Oh, how can I have waited!” she moaned. “I should have come last night, I should have stopped the carriage when I saw him! Oh, it is not possible!” Perhaps there are no more tragic words in human speech than “Too late.” Helen felt just then as if the right even to repentance were taken from her life. It was her first introduction to that fearful thing of which Mr. Howard had told her upon their first meeting; in the deep loneliness of her own heart Helen was face to face just then with FATE. She shrank back in terror, and she struggled frantically, but she felt its grip of steel about her wrist; and while she sat there with her face hidden, she was learning to gaze into its eyes, and front their fiery terror. When she looked up again her face was very white and pitiful to see, and she rose from her chair and went toward the door so unsteadily that the woman put her arm about her. “You will tell me,” she gasped faintly—“you will tell me if you hear anything?” “Yes,” said the other gently, “I will.” So Helen crept into the carriage again, looking so full of wretchedness that her companion knew that the worst must have happened, and took the reins and silently drove towards home, while the girl sat perfectly still. They were fully half way home before she could find a word in which to tell him of her misery. “I shall never be happy in my life again!” she whispered. “Oh, Mr. Howard, never in my life!” When the man gazed at her, he was frightened to see how grief and fear had taken possession of her face; and yet there was no word that he could say to soothe her, and no hope that he could give her. When the drive was ended, she stole silently up to her room, to be alone with her misery once more.","sourceLink":"http://novel.tingroom.com/duanpian/3239/88814.html","bookId":648,"book":{"id":648,"title":"King Midas","description":"简介： It was that time of year when all the world belongs to poets, for their harvest of joy; when those who seek the country not for beauty, but for coolness, have as yet thought nothing about it, and when those who dwell in it all the time are too busy p...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3239","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
