{"id":78751,"no":27,"title":"Page 27","content":"She had been drinking that night; of course she’d been drinking. Her breath was hot on my cheek when she said, “Two left feet, just like your daddy. You really are a Wilcox, Shug.” My eyes burned, and I snatched my hands away. I said, “I don’t want to dance with you anyway.”\\n\\n Celia had been reading a book in the tatty old armchair, and when Mama said, “Celie baby, come dance with your mama!” she leaped up and danced like the Cavane she was. They did the Lindy Hop, and both of their feet moved just the way they were supposed to.\\n\\n My feet don’t move the way they’re supposed to. How in sam hill am I supposed to go to a dance?\\n\\n As Elaine and I walk to the bus loop, I say, “A dance sounds dumb.”\\n\\n “Are you kidding me? A dance will be the funnest thing that’s ever happened in this town!”\\n\\n Geez. I thought we’d had some pretty fun times too. “I don’t know. It’ll probably be lame. I doubt I’ll even go.”\\n\\n “Don’t be crazy. Of course you’re going. You could ask Mark. It’ll be fantastic,” she says. Her eyes are glazed over, and I know she’s picturing herself in some strapless dress with a corsage on her wrist. “Your big chance for him to finally notice you.”\\n\\n “Uh … I don’t know.” I don’t know if having Mark notice me is worth having to go to a dance. “Might not work.”\\n\\n “Oh, it’ll work all right.” She puts her arm around me. “We’re gonna make you hot. He’ll fall all over himself when he sees you.”\\n\\n Well, that doesn’t sound so bad. Sounds pretty good, actually.\\n\\n Elaine volunteers to chair the decorations committee, and like a shot, Hugh says he’ll cochair it with her. Hadley’s in charge of refreshments with Mark, and Mairi’s heading up music with Kyle Montgomery. The dance committees read like a who’s who of Clementon Junior High. Guess who I am. Nobody. I’m not on any of the committees.\\n\\n When I can’t fall asleep at night, I close my eyes and picture how I want the dance to go. We’re in the gym, and a slow song comes on. Maybe “Crazy Love” or “Unchained Melody” or “I Only Have Eyes for You.” Yeah, definitely “I Only Have Eyes for You.” He pushes his way through the crowd, and there I am, swaying to the music by myself. He says, “Annemarie, will you dance with me?” I say okay, and he takes my hand and leads me to the dance floor. And I put my arms around his neck, and then we’re swaying together. He’s holding me tight, and he keeps looking at me like he can’t believe what he’s seeing, what’s been right in front of him all along. Me, Annemarie Wilcox.\\n\\n Chapter 30\\n\\n Mama’s missing.\\n\\n Before I left the house this morning, I told Mama that I needed a ride home from school today because of French club elections. Normally I’d ask Celia to swing by and get me in Margaret’s car, but Celia’d gone away on a camping trip for the weekend. Anyway, Mama said no problem, she’d be there. She wasn’t there. Everyone else’s parents came to pick them up at 4:00. I stood at the bus circle, waiting for her, knowing she wasn’t coming, but waiting all the same.\\n\\n When it started to get dark, I gave up and walked home. It’s a long walk when it’s just you and your thoughts. I was really steaming by the time I finally got home, planning out how I was gonna yell at her, how I was gonna make her sorry. But then I saw that Mama’s car wasn’t in the driveway.\\n\\n For two hours I paced the living room floor, watching the clock. Ever since I was little, I had a fear that Mama might get into a car accident and never come back home. An irrational fear, Mama calls it. Doesn’t seem so irrational to me. There’ve been times when she had a little too much to drink and she still drove anyway. Nothing stops her when she gets it in her mind to do something.\\n\\n It’s late now, and I’m not mad anymore. I’m just scared.\\n\\n With Celia on a camping trip, the only person I can call is Mrs. Findley. She’d help me. She’d know exactly what to do. But Mama would hate her knowing our business, and to be honest, I’m not too keen on the idea either. Maybe before, it would’ve been okay, but not anymore. It’s not that I don’t trust Mrs. Findley, because I do, maybe more than any other adult I know, but I don’t want her thinking badly of Mama. Or of me.\\n\\n There’s only one thing I can do. I’ve gotta call Daddy. Mama could be hurt somewhere. And if she’s not hurt, if she’s off having fun, then maybe she deserves to get in trouble. I could’ve been kidnapped or run over or worse. It would’ve been all Mama’s fault. I almost wish I was kidnapped or run over or worse; that way she’d feel awful. Like the worst mother in the world.\\n\\n I dial the numbers slowly, giving myself one last chance to back out. I tell myself maybe she’s called him already, and everything’s fine.\\n\\n He picks up on the third ring. “Bill Wilcox,” he says.\\n\\n “Hi, Daddy. It’s me, Annemarie.” Your daughter.\\n\\n “What’s going on, Shug?” He sounds busy, distracted.\\n\\n So Mama hasn’t called him. This could be good or it could be really, really bad.\\n\\n “Nothing …”\\n\\n “Good, good. Listen, I’m on another call, so I can’t talk just now. We’ll talk when I come home next week, okay?”\\n\\n “You were supposed to come home today.”\\n\\n “Change of plans. There was a meeting I couldn’t get out of. Didn’t your mother tell you?”\\n\\n “She must have forgotten.”\\n\\n “Ah, well. We’ll have us a good visit when I come home next week. I’ll bring you something extra special. Listen, I’ve really got to get back to work, Shug. Give Celia and your mama kisses for me. And one for you, too.”\\n\\n “Okay … Daddy?”\\n\\n “Yeah?”\\n\\n “Daddy, Mama hasn’t come home yet.”\\n\\n Silence. “What do you mean, she hasn’t come home yet? Is she still at work?”\\n\\n “No … She was supposed to pick me up after school, but she never came. I’m worried, Daddy.”\\n\\n He sighs and says, “Annemarie, I’m sure she’s fine. She probably just got caught up somewhere. You know how your mother is.”\\n\\n “Daddy, she could be hurt. She was supposed to pick me up hours ago.” I am waiting, waiting for him to say sit tight, I’m on my way.\\n\\n He doesn’t say it. He says, “Where’s your sister?” \\n\\n","sourceLink":"https://allnovel.net/shug/page-27.html","bookId":2722,"book":{"id":2722,"title":"Shug","description":"Storyline: SHUG is clever and brave and true (on the inside, anyway). And she\u0027s about to become your new best friend. \\n Annemarie Wilcox, or Shug as her family calls her, is beginning to think there\u0027s nothing worse than being twelve. She\u0027s too tall, too freckled, and way too flat-chested. Shug is sure that there\u0027s not one good or amazing thing about her. And now she has to start junior high, where the friends she counts most dear aren\u0027t acting so dear anymore -- especially Mark, the boy she\u0027s known her whole life through. Life is growing up all around her, and all Shug wants is for things to be like they used to be. How is a person supposed to prepare for what happens tomorrow when there\u0027s just no figuring out today?\\n","cover":"https://allnovel.net/images/shug.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shug.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:09:41 PM"}}
