{"id":78727,"no":3,"title":"Page 3","content":"Mark heads for home, and I watch him go, feeling the lump in my throat grow. I never knew love felt like cancer of the throat. Before he turns the corner, he waves and I wave back.\n It’s not like I’ve never liked a boy before. There was Sherwood Brown, who I met at camp last June. He was staying with his grandma all summer, and we smiled at each other every day at camp. He and his friends would splash me and my friends in the pool, and sometimes he even sat next to me on the bus when we went on day trips. When I told him I liked him, he said he kind of liked me too, but his grandma would whup him good if he ever brought home a white girl. I went home and told Mama, and she laughed until tears ran down her face. She said Sherwood Brown had better learn to stand up to his grandma, or he’d be a little girl his whole life. I decided then and there that I wouldn’t be talking to Mama about boys, not ever.\n And of course there was Kyle Montgomery, the best-looking boy in our grade. All the girls like Kyle Montgomery. Even the teachers like Kyle. Us girls pretend-swoon when we see him in the hallways. The one time he caught my best friend Elaine Kim and me doing it, he winked at us, and then he turned bright red. We like Kyle because he’s out of our league; he’s out of everybody’s league. Plus he’s fun to giggle about. I don’t know of any girl who wouldn’t die for a chance to walk down the hallway with Kyle Montgomery.\n Kyle Montgomery is tall, and he has nice eyes. You know the kind of eyes that always look like they’re smiling? Well, Kyle has them, and he really does smile an awful lot. His jeans always fit just right, and he is the best basketball player our school has ever seen. So like I said, everyone likes Kyle, and I did my fair share of liking him too a few years back.\n But this is different; this is Mark. This is Mark Findley who knows my favorite ice cream flavor (Rocky Road) and how I like my pizza (extra cheese, pineapple, and mushroom); Mark who pulls splinters out of my feet when I go barefoot in the summer; Mark who helped me bury my gerbil, Benny, when he died. This is Mark who was sitting next to me on the bus that time I threw up in third grade. He didn’t even say a word when some splashed on him; he just wiped it off and asked me if I was okay.\n One of the things I like best about Mark is his family. The Findleys are the kind of family you only see on black-and-white reruns late at night. At Christmastime, Mrs. Findley makes cinnamon cookies out of piecrust and real whipped cream to put on top, and Mr. Findley used to take Mark and Celia and me sledding at Clementon Park. (This was before Celia decided she was too grown up to have fun.) Mrs. Findley always says that she wishes she had a daughter just like me, and that my mother is the luckiest woman alive for having two lovely daughters. Mrs. Findley thinks I am lovely. When we were little, I secretly wanted the Findleys to adopt me, but now that I’m older, I suppose I would settle for being their cherished daughter-in-law.\n Chapter 2\n When I get home, I go straight to my bedroom and call Elaine. Elaine Kim moved to our neighborhood last December. Everyone wanted to be her best friend because she was new and from New York City, but she chose me.\n I say, “Elaine, I have some news.”\n “What?” she says, and I can hear the TV in the background.\n I pause. “I think I’m in love … with Mark.”\n “Yeah, I know,” Elaine says. I can tell she is watching TV and not paying attention to me, and I am annoyed.\n “I said, I think I’m in love with Mark,” I snap.\n “I said, I know!” Elaine snaps right back. I love that about her.\n “How did you know? You couldn’t have known. I didn’t even know.”\n “Come on, Annemarie. I’m your best friend. I know stuff about you that nobody knows, not even you.”\n “But how did you know?”\n “Because it’s a total cliché; of course you like Mark. He’s the boy next door, the boy you’ll measure every other boy against. It was only a matter of time.” Just because Elaine’s father is a psychiatrist, she thinks she knows everything.\n “Mark doesn’t live next door,” I mutter.\n “Down the street, whatever. Same thing.”\n “Okay fine, if you know so much, what am I going to do about it?”\n “What are you going to do?” she repeats. “I don’t know. What do you want to do?”\n “I want him to like me back. I want him to look at me the way he looks at Celia,” I say, lying back on my pillow and staring at the ceiling. There is a massive spiderweb in one corner.\n “Hmm, that could be hard. Celia has, like, actual br**sts, remember?”\n “No, I forgot, but thank you for reminding me.”\n Elaine decides that I should talk to my mother. According to her, while other mothers are clueless, mine understands these sorts of things. Elaine idolizes my mother, maybe because hers is so unlike mine. She is the only one of my friends Mama can stand, because she is from New York and because Mama thinks she has “moxie.” But I think it’s because Elaine acts like Mama is a movie star, and Mama loves it when people are smart enough to know she is something special.\n I know better than to ask Mama about Mark because I know exactly what she will say. She will say that Mark is sweet in a prosaic sort of way, but I can do better because I am extraordinary. And then I’ll start to think that maybe Mark really is sort of prosaic, and I’ll never be able to see him in the same way ever again.\n I don’t tell Elaine this though. I like the way Elaine looks at Mama. I wish I still looked at Mama that way. Sometimes I do, but it’s getting harder and harder.\n Even though Mama messed up that one time I told her about Sherwood Brown, that doesn’t mean she won’t come through this time. You never know. People can surprise you. And I mean, life is all about second chances, right?\n After Elaine and I hang up, I go to Mama’s room.\n My mother is reading in bed, with her feet propped up on a silk pillow. It is turquoise with little orange tassels. “Shug, don’t slouch,” she says, not lifting her eyes from the page.\n I roll my eyes and sit on the edge of the bed, at her feet. “Mama, when’s dinner?” I ask. I know full well she hasn’t cooked any.\n She looks up, surprised. “You know your daddy’s away on business, and your sister’s at Margaret’s, so I didn’t bother with dinner. You fix something up for yourself; I’m not hungry.”\n “Mama!”\n “What?” she says absentmindedly. She reaches for the wineglass on her nightstand and turns the page of her book. \n","sourceLink":"https://allnovel.net/shug/page-3.html","bookId":2722,"book":{"id":2722,"title":"Shug","description":"Storyline: \n SHUG is clever and brave and true (on the inside, anyway). And she\u0027s about to become your new best friend. \n Annemarie Wilcox, or Shug as her family calls her, is beginning to think there\u0027s nothing worse than being twelve. She\u0027s too tall, too freckled, and way too flat-chested. Shug is sure that there\u0027s not one good or amazing thing about her. And now she has to start junior high, where the friends she counts most dear aren\u0027t acting so dear anymore -- especially Mark, the boy she\u0027s known her whole life through. Life is growing up all around her, and all Shug wants is for things to be like they used to be. How is a person supposed to prepare for what happens tomorrow when there\u0027s just no figuring out today?\n \n","cover":"https://allnovel.net/images/shug.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shug.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:09:41 PM"}}
