{"id":78755,"no":31,"title":"Page 31","content":"Hadley looks at me like I’m the village idiot. “We’re not staying for breakfast.”\\n\\n Chapter 34\\n\\n During lunch Jack got into a fight with an eighth grader. There was chocolate pudding everywhere. He got out-of-school suspension, and his mother had to come pick him up from school. I watched from the window in science class. I saw them walking to their car. Mrs. Connelly was wiping tears from her eyes, and Jack looked miserable. I felt sorry for him.\\n\\n It’s Jack’s third fight this school year, and we’re barely even halfway through. I really don’t understand him. If he’d quit getting into fights and talking back to teachers, maybe he’d actually learn something.\\n\\n After school I ride my bike over to Jack’s with his assignments for the week. I only volunteered to do it because no one else came forward. And also, I feel sort of guilty for not sticking up for him at Mairi’s sleepover. Not that he would ever find out about it, and not that I have any reason to stick up for him, but it was wrong of me not to say something. On behalf of his mama, at least. I could’ve told them that she doesn’t work at a diner; she works at a steakhouse. And his daddy’s in AA, which means he’s not even a drunk anymore. I could’ve and should’ve said both those things, but instead I kept my mouth shut like a yellow-bellied coward.\\n\\n When I pass Mark’s house, he’s shooting hoops in the driveway. I wave. It’s the first time I’ve seen him at home in a long while. I’m really not planning on stopping, but he comes over to me. He’s wearing a black T-shirt with the sleeves cut off even though it’s pretty cold out. “What are you up to?” Mark asks, dribbling the ball with his left hand.\\n\\n “Going over to Jack’s house.”\\n\\n He pushes his hair out of his eyes and squints at me. “Oh yeah? You guys have tutoring today?”\\n\\n “No, I’m just bringing his homework to him.”\\n\\n “I can’t believe he was stupid enough to get into another fight. Sometimes he’s a real idiot.” He dribbles the basketball between his legs. “You wanna play Horse?”\\n\\n “Nah, I gotta drop this off at Jack’s.”\\n\\n “Aw, come on, just one game.”\\n\\n We end up playing four games, and by the time we’re done, it’s getting dark. I’m regretting volunteering to bring Jack his work for the week. Things feel so normal between Mark and me, and the last thing I feel like doing is trekking all the way over to Jack’s house. Still, I gave my word.\\n\\n Then I think of that sad look on Trish’s face, and I pedal extra hard.\\n\\n Jack answers the door. When I see his black eye, I don’t even feel sorry for him. I just feel mad. I’d like to blacken his other eye.\\n\\n “Here.” I shove the stack of papers at him, hard.\\n\\n “Thanks.” He looks at me, and with his eyes he says it again, thanks.\\n\\n Shaking my head, I say, “You know, you can’t keep getting into fights over stupid stuff.”\\n\\n “Are you here to give me my homework or to nag me?”\\n\\n “I’m just trying to help. You’re gonna get really behind if you keep this up, Jack.”\\n\\n “That’s my problem.”\\n\\n “It’s my problem too, when I’m the one tutoring you! Sometimes you act like an idiot!”\\n\\n Redness is creeping up his neck, and he says, “I’m really not in the mood for this today, okay? I feel bad enough already, I don’t need you reminding me of what an idiot I am.” His voice breaks.\\n\\n I look away. I wish I was still playing Horse in Mark’s driveway. “I said you act like an idiot, I didn’t say you were one.”\\n\\n “My mom says that if I get into another fight, I’m gonna have to go and live with my dad.” Baby tears are forming in the corners of his eyes, and he scratches at them like they itch. I look away again. Never thought I’d see Jack Connelly cry. I want to say the right thing, but what is the right thing?\\n\\n I say, “Shoulda thought of that before you went and got into another fight.”\\n\\n Jack doesn’t say anything, and it’s so unlike him that I feel sorry, really sorry. I say, “Hey, let’s study for that quiz, okay?”\\n\\n “I don’t really feel like it today,” he says, his hand on the door. “But thanks for bringing my work.”\\n\\n “Aw, come on, Jack.”\\n\\n He shakes his head and shuts the door. And I’m left standing there, feeling like a real crumb.\\n\\n Chapter 35\\n\\n The call comes that night, and as usual, I’m the one to pick up the phone. I swear, you’d think I was the only one in the family with hands.\\n\\n “Hello?”\\n\\n “Is that you, Annemarie honey?”\\n\\n “Uh, yeah.”\\n\\n “It’s Mrs. Findley, sweetheart. Is your mother home?”\\n\\n “My mother?”\\n\\n “Yes, dear. Is she at home?”\\n\\n “Uh.” What in the world could Mrs. Findley have to say to my mother? And furthermore, what would Mama say to Mrs. Findley? I am tempted to say no, Mrs. Findley, Mama’s left the state and has no plans of returning. Ever. “Yes, ma’am, just a moment.”\\n\\n Phone in hand, I sprint to the living room where Mama’s lying down. “Phone for you, Mama.” Her eyes remain closed.\\n\\n “It’s Mrs. Findley,” I hiss.\\n\\n Mama holds her hand out for the phone, and she doesn’t open her eyes. “Hi, Helen,” she says. “What can I do for you? I’m fine, thank you. Mmmhmm. Oh, I see. Well, yes, Billy probably will be away on business. But I’m sure I can make it. I’m always happy to help. … Yes, you too, Helen.” Mama clicks the phone off.\\n\\n “What’s going on?” I demand. “What did Mrs. Findley want?”\\n\\n Mama opens her eyes and says, “I’m going to help chaperone your dance.”\\n\\n WHAT? This time my heart really does stop beating.\\n\\n She smiles tiredly. “There, aren’t you pleased? Your mama’s joinin’ in and doin’ mamalike things. Next thing you know, I’ll be headin’ up the PTA.”\\n\\n “I’m not even going to that dance,” I say. “So thanks but no thanks.”\\n\\n Her smile fades. “What are you talking about? Of course you’re going to the dance.”\\n\\n “No, I’m not. Dances are stupid. I’m not going.”\\n\\n Flatly she says, “You’re going, Annemarie.”\\n\\n In my head I think, Not if I can help it. But I’m smart enough not to say it out loud.\\n\\n Chapter 36 \\n\\n","sourceLink":"https://allnovel.net/shug/page-31.html","bookId":2722,"book":{"id":2722,"title":"Shug","description":"Storyline: SHUG is clever and brave and true (on the inside, anyway). And she\u0027s about to become your new best friend. \\n Annemarie Wilcox, or Shug as her family calls her, is beginning to think there\u0027s nothing worse than being twelve. She\u0027s too tall, too freckled, and way too flat-chested. Shug is sure that there\u0027s not one good or amazing thing about her. And now she has to start junior high, where the friends she counts most dear aren\u0027t acting so dear anymore -- especially Mark, the boy she\u0027s known her whole life through. Life is growing up all around her, and all Shug wants is for things to be like they used to be. How is a person supposed to prepare for what happens tomorrow when there\u0027s just no figuring out today?\\n","cover":"https://allnovel.net/images/shug.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shug.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:09:41 PM"}}
