{"id":78728,"no":4,"title":"Page 4","content":"“Mama, I need to talk to you. I need some advice.”\n Mama takes a long sip of wine. “Okay, Shug,” she says. “You have my complete and undivided attention. What’s going on?”\n “Well, the thing is, I like someone. A boy,” I say. “But I don’t think he likes me.”\n Mama nods. “Who is this boy?”\n I hesitate. “Mama, you can’t tell anyone.”\n “All right.”\n “You have to promise, Mama.”\n “I promise. I shan’t tell a soul.” She crosses her heart.\n “Well, okay. It’s Mark.” I watch her hopefully.\n Mama finishes her wine, and says, “Mark Findley … Hmm … yes, he is a charming boy.”\n Hope begins to flutter in my chest like a little bird. See, all she needed was that second chance. Mama knows all about men, maybe she really could help me decide what to do.\n “But, Shug, I sure hope your babies take after our side of the family and not his. His mama is just as common as coal.” She winks at me and goes back to her book.\n Sometimes I hate my mother so much I can’t breathe.\n “At least Mrs. Findley makes dinner,” I spit out.\n “Why, Miss Annemarie, are you mad at me?” She’s mocking me, and it only makes me madder.\n “You’re just jealous of Mrs. Findley; that’s why you say ugly things about her. And coal isn’t common. It’s a precious resource.”\n “Shug, I was only joking. You know I’ve always been fond of Mark, and I think his mama is really very sweet,” Mama says. “If you want Mark, you go and get him. I didn’t raise my daughters to be pacifists. Make love or make war, Shug, but make somethin’ happen. And you’ve got hands; you can fix your own dinner.”\n “Fine!” I leap off the bed and storm out.\n As I stomp down the stairs, as loudly as bare feet on carpet will allow, I hear my mother call, “Love you too, baby mine.”\n My mother has never forgiven Mrs. Findley for being the kind of mother I have always wished for.\n Chapter 3\n Elaine once asked me why Mama calls me Shug. I said, “Have you ever read The Color Purple?” She said no, and I said, “Well there’s this character named Shug, Shug Avery …” I tried to explain, but I guess I didn’t do a very good job because she looked at me like I was crazy.\n So I said, “Never mind. It’s just Shug, Shug like sugar.”\n The Color Purple is one of Mama’s favorite books. Mine too. It’s all about living free, on the inside. The main character’s name is Celie (like Celia, see) and she’s had a real beat-down kind of life. She thinks she’s nothing. Then Celie meets Shug Avery, and boy, is Shug Avery a force of nature. That’s what Mama calls her, anyway. Shug Avery doesn’t take crap from nothin’ and nobody. She’s a singer and a temptress, too. When Shug Avery blows through town, she shakes the whole town up. Everyone’s enchanted by her: Celie, Celie’s husband, Mr._____; everyone. My mama, too.\n That’s why she calls me Shug—well, that, and it’s short for sugar. Plenty of mamas call their babies Shug, but for Mama, I know it’s more than a sweet way of talking. She wants me to be like Shug Avery, to squeeze every last drop out of life and be special, the way she and Shug are. And to be beautiful, the way she and Shug are. I think Mama’s still waiting for that part, for me to grow up and be beautiful. I think she might be waiting for that part forever.\n It’s ironic, because Celia’s already beautiful, and she was the one named for Celie, the plainest girl alive. I think maybe I should’ve been named Celie. Instead I am Annemarie, named for Mama’s sister who died when she was little. Mama says she was somethin’ special, wild and freer than anybody Mama knew. That must be pretty darn free.\n I think that first Annemarie would’ve been worthy of a name like Shug. Not me, though. I’m like Miss Celie on the inside, scared of everything. But in the end, even that old scaredycat Celie finds out how to live, how to be. She shows everybody what she can do; she shows them all. I want that too.\n Chapter 4\n Celia comes home early the next morning and goes straight to bed. She is always cranky after a sleepover with Margaret, and then she sleeps till noon. When she finally emerges, I am sitting at the kitchen table, reading.\n Our kitchen is one of my favorite places in the whole house. There are lots of windows, and the sun shines through all day. Mama has Marc Chagall prints on the wall. They used to scare me, but I have come to admire them.\n “Hey, Shug. Where’s Mama?” Celia asks, pouring herself a glass of orange juice. She rumples my hair and sits across from me.\n “She went to the art museum with Gail,” I say, taking her juice before she can have the first sip. Gail is Mama’s friend from work. Mama is the part-time activities director at the Rosemont Retirement Community, and Gail is one of the nurses.\n Celia snatches it right back. She drinks some, and hands it back to me.\n “What did you and Margaret do?” I ask, finishing the glass.\n “We just hung out with some of the guys,” Celia says vaguely. “You want lunch?”\n I say yes, and Celia cooks us cheddar omelets and bacon. As we eat, I watch her and think about how much she looks like Daddy. She has Mama’s green eyes, but the rest of her is all Daddy. Her hair is soft and brown like a puppy’s, and she has Daddy’s smile. Her hair hangs down her back in soft curls, and she is wearing her old Snoopy T-shirt. I’m so busy thinking how pretty she is that I almost forget to tell her my big news.\n My mouth full of bacon, I say, “Celia, guess what.”\n “What? And don’t talk with your mouth full; it’s gross.”\n I open my mouth wider and stick my tongue out, bacon bits and all. Celia shakes her head in disgust. “I like someone,” I say.\n “Who?”\n And then, in that moment, I know I can’t tell Celia. Not this time. Not before I get him, and not until he’s mine.\n The lie comes out before I even have time to think it through. “Kyle Montgomery.”\n “Kyle? Didn’t you have a crush on him in fourth grade? I thought you were over Kyle.”\n “Yeah, but that was kid stuff. I didn’t really know what love was back then. This is the real thing,” I say. It is the real thing too. It’s as real as anything I’ve ever felt, and when I am old, people might try and tell me different, I might even tell myself different, but I know that at this moment, I love Mark Findley. \n","sourceLink":"https://allnovel.net/shug/page-4.html","bookId":2722,"book":{"id":2722,"title":"Shug","description":"Storyline: \n SHUG is clever and brave and true (on the inside, anyway). And she\u0027s about to become your new best friend. \n Annemarie Wilcox, or Shug as her family calls her, is beginning to think there\u0027s nothing worse than being twelve. She\u0027s too tall, too freckled, and way too flat-chested. Shug is sure that there\u0027s not one good or amazing thing about her. And now she has to start junior high, where the friends she counts most dear aren\u0027t acting so dear anymore -- especially Mark, the boy she\u0027s known her whole life through. Life is growing up all around her, and all Shug wants is for things to be like they used to be. How is a person supposed to prepare for what happens tomorrow when there\u0027s just no figuring out today?\n \n","cover":"https://allnovel.net/images/shug.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shug.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:09:41 PM"}}
