{"id":81852,"no":11,"title":"Page 11","content":"The absence of shadows against the wall told him he had slept late, his body trying vainly to regain some of the energy spent on spell-casting the night before. His tongue felt thick, his skin tight, and his bones as though they had been rough cast in lead. Soon, a slave will wait at my bedside, a glass of chilled juice ready upon my awakening. But soon, unfortunately, did him no good at the moment. He looked over at the clock-eleven fifty-six, oh three, oh four, oh five-and then tore his glance away before it could trap him further in the progression of time. Only half the day remained for him to feed and find the ka that burned so brightly. Moving stiffly, he swung out of bed and made his way to the shower. The late Dr. Rax, who over the course of a varied career had been familiar with the sanitary facilities, or lack thereof, along the banks of the Nile, had considered North American plumbing to be the eighth wonder of the world. As gallons of hot water pounded the knots from his shoulders, he was inclined to agree. By the time he finished a large breakfast and was lingering over a cup of coffee-an addiction every adult ka he had absorbed seemed to share-he no longer felt the weight of his age and was ready to face the day. For a change, a cloudless blue sky arced up over the city, and, although the pale November sun appeared to shed little warmth, it was still a welcome sight. He took his cup to the wall of windows that prevented the other, more solid walls from closing in around him and looked down at the street. In spite of laws that forced most businesses to remain closed on the day known as Sunday, a number of people were taking advantage of the weather and spending time outside. A number of those people had small children in hand. The series of individually tailored spells he had worked last night, each with its own complicated layering of controls, had drained him and the power he had remaining would barely be enough to keep him warm as he chose the child whose ka would replenish his. He was using power in a way he would never have dared when unsworn souls were few and even slaves had basic protections but, with nothing to stand in the way of his feeding, he saw no reason to hold back. Not one of the deaths could be traced to him- necessity had taught him millennia ago to take the mundane into account-and very shortly even that would cease to be a consideration. When the police and their political masters gave themselves to Akhekh, he, as High Priest, would be inviolate. He had no idea how many sworn acolytes his lord needed in order to gain the strength to create another such as he. Forty-three had been the greatest number he had ever been able to gather in the past but, as that had been just before Thoth\u0027s priests had been instructed to intervene, he suspected that forty-four or forty-five would be enough. That the thirty ka to be gathered up in this time had been coerced would make only a minimal difference. He had used the smallest pieces of their ka necessary to convince them-in two cases those had been very small pieces indeed-and enough truth had been spoken during the spellbinding that their pledges would hold. The thirty coerced would be equivalent to no less than twenty free; a respectable beginning. After the ceremony, he would not need to be as magically involved and would, therefore, need to feed less often. \u0027And when I find you, my bright and shining one?\" He placed his empty cup down with the rest of the breakfast dishes and scooped up the opera cloak the Solicitor General had found outside the library door. \"?1 may never need to feed again.\" As the satin folds slid across his fingers, he basked in the remembered glow. This ka would stand out like a blaze of glory against the others in this city; now that he had touched it, it would not be able to hide from him. He was mildly curious about what kind of a man-for it had been only a man, there had been no mark of god or wizard about the presence-would carry such a ka, but curiosity paled beside his desire. The opera cloak pooled about his feet. Perhaps he would return the young man\u0027s forgotten garment, and as their fingers touched he would look into his eyes and? With such power at his command there would be nothing he could not do. Tony wasn\u0027t sure what had driven him from his basement room this morning, but something had nagged him up out of sleep and onto the street. Two coffees and a double chocolate chip muffin in Druxy\u0027s had brought him no closer to an answer. Hands shoved deep into the pockets of his jacket, he stood on the corner of Yonge and Bloor and waited for the light, effortlessly eavesdropping on the conversations around him, filtering out the yuppie concerns, paying close attention to a cluster of street kids complaining about the cold. At this time of the year, those who lived in parks and bus shelters worried first about surviving the coming winter and then about their next meal, their next smoke, their next bit of cash. They talked about the best places to panhandle, to turn tricks, what doorways were safe, what cop would cut a little slack, who\u0027d been picked up, who\u0027d died. Tony had survived on the street for almost five years and knew what talk had substance behind it and what talk was just wind. No one seemed to be saying anything that would clue him into whatever it was that had him so jumpy. He walked west on Bloor, thin shoulders hunched high. The new jacket he wore, bought with money from a real honest-to-God steady job, kept him plenty warm enough, but old habits took time to break. Even after two months, he was still a little unsure about the job, afraid that it would vanish as suddenly as it had appeared and with it the room, the warmth, the regular meals? and Henry. Henry trusted him, believed in him. Tony didn\u0027t know why, didn\u0027t really care why. The trust and the belief were enough. Henry had become his anchor. He didn\u0027t think it had anything to do with Henry being a vampire-although he had to admit that was pretty fucking awesome and it certainly didn\u0027t hurt that the sex was the best he\u0027d ever had and just remembering it made him hot-he thought it had more to do with Henry just being a? well, being Henry. The feeling that had driven him out and onto the street had nothing to do with Henry, not specifically at least. Henry feelings, he could always recognize. Dropping down onto the low wall in front of the Manulife Center, Tony rubbed at his temples and wished the feeling would go away. He had better things to do with his Sunday afternoon than wander about trying to find where the ants between his ears came from. He kicked his heels against the concrete and watched the parade of people pass by. A baby in a backpack, barely visible under a hat and mittens and a scarf and a snowsuit, caught his attention and he grinned up at it, wondering if it could even move. Jeez, the kid\u0027s gonna spend the first few years of its life only seeing where it\u0027s been. Probably grow up to be a politician. The baby appeared to be gazing in happy fascination at the man who walked along behind its parents although, as far as Tony could tell, he wasn\u0027t doing anything to attract its attention. He wasn\u0027t a bad looking man either; quite a bit of gray in the hair and a nose that hooked out into tomorrow but with a certain something that Tony found attractive. Guess he likes kids. Sure is staring at that? that? Jesus, no. Under the pale blue hat with its row of square-headed yellow ducks, the baby\u0027s face had gone suddenly slack. The bulk of its clothing held it upright, arms reaching out over the carrier but Tony knew, without the shadow of a doubt, that the baby was dead. Cold fingers closed around his heart and squeezed. There was now no gray in the hair of the man who followed. He killed it. Tony was more certain of that than he\u0027d ever been of anything in his life. He didn\u0027t know how it had been done, nor did he care. Jesus God, he killed it. And then the man turned, looked right at him, and smiled. Tony ran, instinct guiding his feet. Horns sounded. A voice yelled protest after a soft collision. He ignored it all and ran on. When even terror could no longer keep him moving, he collapsed in a shadowed doorway and forced great lungfuls of air past the taste of iron in the back of his throat. His whole body trembled and every breath drove a knife blade, barbed and razor sharp, up under his ribs. Exhaustion wrapped itself shroudlike around what he\u0027d seen, dulling the immediacy, allowing him the distance to look at it again. That man, or whatever he was, had killed the baby just by looking at it. And then he turned and looked at me. But I\u0027m safe. He can\u0027t find me here. I\u0027m safe. No footsteps sounded in the alley, nothing threatened, but his scalp prickled and the flesh between his shoulder blades twisted into knots. He didn\u0027t need to follow. He\u0027s waiting for me. Oh, God. Oh, Jesus. I don\u0027t want to die. The baby was dead. They\u0027ll think the baby\u0027s asleep. They\u0027ll laugh about the way babies sleep through anything. Then they\u0027ll get home and they\u0027ll take it out and it won\u0027t be sleeping. Their baby will be dead and they won\u0027t know when or how or why it happened. He scrubbed his palms across his cheeks. But I know. And he knows I know. Henry. Henry\u0027ll protect me. Except that sunset wouldn\u0027t be for hours and he couldn\u0027t stop thinking of the baby\u0027s parents arriving home and finding? He couldn\u0027t just let that happen. He had to tell someone. The card he pulled from his pocket had seen better days. Limp and stained, the name and number on it barely legible, it had been for years his link to another world. Clutching it tightly in a sweaty hand, Tony moved cautiously from his hidey-hole and went looking for a pay phone. Victory would know what to do. Victory always knew what to do. \u0027Nelson Investigations. No one is available to take your call, but if you leave your name and number, as well as a brief reason for your call, after the tone, I\u0027ll get back to you as soon as possible. Thank you.\" \u0027Shit.\" Tony slammed the receiver down and laid his forehead against the cool plastic of the phone. \"Now what?\" There was always the number scrawled on the back of the card, but somehow Tony doubted that Detective-Sergeant Michael Celluci would appreciate having this kind of thing dumped in his lap. \"Whatever kind of thing it is. Jesus, Victory, where are you when I need you?\" He shoved the card back in his pocket and, after a cautious examination of the passing crowds, slipped out of the phone booth. Squinting at the sky, he began making his way back to Yonge and Bloor. He knew where Henry was and the hours between now and sunset would only seem like they were taking up the rest of his life. With any luck. The boy had seen him feed; or been aware, at least, that he had fed. Apparently, there were a few in this age who had not built barriers of disbelief around their lives. The incident was of interest but placed him in no danger. Who would the boy tell? Who would believe him? Perhaps later he would search him out and, if he could not be used, he was young enough still that his life would be an adequate source of power. At the moment, he had all the power he needed. He felt wonderful. An infant\u0027s life, so very nearly entirely unrealized potential, was a pleasure to absorb. Occasionally, in the past, when his fortunes were high, he would buy a female slave, have her impregnated by an acolyte, and devour the life of the child at the moment of its birth. The slave\u0027s birth pains and then the despair at the loss of her child became a sacrifice to Akhekh. Such nourishment took careful purchasing and then constant monitoring, however, as the children of some women could be claimed by the gods while still in the womb. Perhaps, with so few gods active, when Akhekh\u0027s temple had been built anew, he would be able to feed in such a way as a matter of course. He raised his personal temperature another two degrees just because he had the power to spare. It was too lovely a day to return to the enclosure of his hotel room. He would walk to the park, ward a small area, and soak up a few rays while he searched for the ka that blazed so brightly. \u0027Mike, it\u0027s Vicki. It\u0027s about two-ten, Sunday afternoon. Call me when you\u0027ve got time to talk.\" She hung up the phone and reached for her jacket. Now that they knew high-ranking police officers were involved and, given those same officers had already pulled him off the case, a tap on Celluci\u0027s phone line was a possibility; a slim one, granted, but Vicki saw no reason to discount it just because the odds were ridiculously high. After all, they were hunting down an ancient Egyptian mummy and who\u0027d want to figure the odds on that. \u0027An ancient Egyptian mummy named Anwar Tawfik.\" She hoisted her shoulder bag up into position. \"How much do you want to bet that\u0027s not its real name.\" Still, it was the only name they had, so she planned on spending the afternoon checking the hotels clustered around the Royal Ontario Museum. Everything pointed to it having remained in that area and, from what Henry had to say, Mr. Tawfik apparently preferred to travel first class. She wondered briefly how it paid for such a lifestyle and muttered, \"Maybe it has a platinum Egyptian Express card. Don\u0027t be entombed without it.\" Henry. Henry wanted to get as far away from this creature and its visions of the sun as was humanly possible. He didn\u0027t have to say it, it was painfully obvious. She doubted he\u0027d be willing, or even able, to face the mummy again. \u0027So I guess that means it\u0027s up to me.\" Her glasses slid forward and she settled them firmly back on the bridge of her nose. \"Just the way I like it best.\" The vague, empty feeling, she ignored. His ka swept over the city and found no trace of the life he had touched so briefly the night before. A ka with such potential should shine like a beacon and searching for it should only be a matter of following the blaze of light. He knew it existed. He had seen it, felt it. It should not be able to hide from him! Where was it? The connection between them had lasted less than a searing, glorious instant before the young man threw himself backward through the library window and away but even such a slight touch would enable him to gain access into the young man\u0027s ka. If he could find it. Had the young man died in the night? Had he taken one of the miraculous traveling devices of this age and flown far away? His frustration grew as he brushed over a thousand kas that together burned less brightly than the one he desired. And then he felt his own ka gripped by a greater power and, for a moment knew a sudden, all-encompassing fear. Recognition lessened the fear only slightly. Why have you not given me the suffering of the one I claimed? Lord, I? He had walked through the woman\u0027s ka and gathered all the information he needed for his lord\u0027s pleasure. He had intended to set it in motion the night before. Had he done so, the suffering would have begun. The touch of the intruder\u0027s ka had driven it right out of his mind. No excuses. It made no difference that the pain existed on the spiritual level only. His ka screamed. \u0027Are you all right?\" He felt strong hands around his arm, lifting him back into a sitting position, and knew the wards had broken. Slowly, because it hurt, he opened his eyes. At first, while he fought his way free of the webs of pain, he thought the young man standing so solicitously by resembled the young man who had escaped him; who had been responsible for the delay in the working of his god\u0027s desire. Who had been responsible for the agony his god had seen fit to twist around him. A moment later, he saw the hair was lighter, the skin darker, the eyes gray rather than pale brown, but by then it didn\u0027t matter. \u0027You tipped over.\" The young man smiled tentatively. \"Is there anything I can do?\" \u0027Yes.\" He forced his throbbing head up enough to meet the other\u0027s gaze. \"You can throw yourself in front of a subway.\" Eyes widened and face muscles spasmed. \u0027Your last word must be Akhekh.\" \u0027Yes.\" Legs moved jerkily away. Body language screamed no. He felt better. There had been nothing subtle about the coercion, but there had been no need. The young man would live such a short time that laying on an appearance of normalcy would be a waste. He could feel his lord following close behind, drinking in the despair and panic. The young man knew what he was about to do, he just couldn\u0027t stop himself from doing it. Hopefully, his lord would be appeased until the chosen one could be delivered. Vicki paused outside the Park Plaza Hotel and looked down at what she was wearing. Sensible shoes, gray cords, and a navy blue duffle coat were fine for most places in this city, but she had a feeling that when she walked through the door and into the lobby she was going to feel underdressed. The hotels she usually searched for suspects did not have a doorman; if someone was stationed out front, he was there as a lookout in case the police arrived. Adjoining shops sold cigarettes and condoms, not seven thousand dollar diamond and emerald necklaces. The windows would be opaque because of plywood, not because the glass had been impregnated with gold. And I am not being intimidated by a building. The Park Plaza was directly across Bloor Street from the museum and therefore the logical place to begin a search for Anwar Tawfik. She strode past the doorman, swung through the revolving door at a speed that would have swept any other occupants off their feet, and paused again in the echoing quiet of the green marble lobby. Some things, however, were universal to hotels. The registration desk had two harried clerks behind it and eleven people-eleven very well-dressed people, Vicki noted- attempting to check in. She sighed silently and got into line, mourning the loss of the badge that would have made waiting unnecessary. His stride had nearly steadied by the time he reached the hotel. The vast amount of power he had absorbed from the infant\u0027s ka had acted as a buffer between the anger of his lord and any lasting damage. There had been times in the past when he had crawled away from such an encounter on his belly and it had taken days of pain and fear to recover his strength. Thankfully, the new acolytes would soon be sworn and his lord\u0027s attention would not then be directed so exclusively at him. Akhekh, while not one of the more powerful gods, was still very conscious of services owed in return for immortality. The liveried doorman scurried to open the door and he swept past the tinted glass and into the lobby, stopping abruptly at the touch of a familiar ka. She looked much as she perceived herself although in truth was a little less tall, a little less blonde, and rather more determined of jaw. What was his lord\u0027s chosen doing here, however? He reached out and gently stroked the surface of her thoughts. After the nights he had spent mapping it, her ka could hold no secrets from him. He frowned as he uncovered the reason for her presence. She searched for him? She was no wizard to be aware of his wandering in her? ah, she searched at the request of another. Apparently, he had not been as thorough at the museum as he had thought. No matter. He smiled. His lord would have twice the pleasure for the plans he had made for the suffering of Ms. Nelson could be adapted to include Detective-Sergeant Michael Celluci as well, without even the need to search the detective\u0027s ka. But, in the meantime, it would not do for the chosen one to disrupt his sanctuary. Without so much as touching her awareness, he laid a false memory over the parameters of her search. What am I doing back in line? Vicki wondered, shaking her head and turning for the door. They\u0027re not going to have any more information now than they did a moment ago. Computer listings could be changed, Anwar Tawfik might not be the name he was registered under, and if the manager had never heard of him, there wasn\u0027t much else she could do but check the rest of the hotels in the area. Maybe she\u0027d think of another angle to hit later. \u0027Yes, it was a very pleasant evening, Mrs. Zottie. Thank you. Now, if I could speak with your husband?\" He looked out over the city as he waited for the Solicitor General to pick up the phone. When he stood close to the wall of windows, the rest of the suite seemed less enclosing. \u0027You wished to speak with me, Master?\" \u0027I assume you are alone?\" \u0027Yes, Master. I took the call in my study.\" \u0027Good.\" It had become necessary to ask for the effect of the control spell had Zottie\u0027s mental abilities deteriorating at an unanticipated pace. Fortunately, his assistance would be necessary only until the others were pledged. \u0027Pay attention, there\u0027s something important I want you to arrange?\" Henry had faced enemies before, faced them and conquered them, but his nature denied him the ability to face the sun. Vicki had offered him a chance to leave-she\u0027d understand if he ran from this creature he had no chance of defeating. She\u0027d understand. But would I? Forcing his muscles to respond, he swung his legs off the bed and sat up, golden afterimages of the sun still dancing across the periphery of his vision. When I face this wizard-priest, I face the sun. When I face the sun, I face death. So when I face him, I face death. I\u0027ve faced death before. Except he hadn\u0027t. Not when he truly thought he was going to die. Deep in his heart he had always known he was stronger and faster. He was the hunter. He was Vampire. He was immortal. This time, for the first time in over four hundred and fifty years, he faced a death he believed in. \u0027And the question becomes, what am I going to do about it?\" It was one thing to endure the dreams when he had no knowledge of how or why they came, it was another to let them continue knowing they were sent. He must have become aware of me from the moment he woke at the museum. But even knowing who, the question of why still haunted him. Perhaps the dream of the blazing sun was a warning, a shot fired across his bow saying, \"This is what I can do to you if I choose. Do not interfere in what I plan.\" \u0027So it all returns to running. Do I let him have his way or do I face him again?\" He leapt to his feet and strode across the room, head high, eyes blazing. \"I am the son of a King! I am Vampire! I do not run!\" With a loud crack, the closet door ripped off in his hands. Henry stared at it for a moment, then slowly let the pieces fall. In the end, the anger and the fine words meant nothing. He didn\u0027t think he could face Tawfik again, not knowing he had to face the sun as well. The sudden ringing of the phone slammed his heart against his chest in a very mortal reaction. \u0027All right, Mr. Fitzroy says you can go up.\" Tony nodded, brushed his hair back off his face with a hand that still trembled, and hurried for the inner door. The old security guard disapproved of him, could see the street kid lurking just below the surface; thought thief, and addict, and bum. Tony didn\u0027t give a rat\u0027s ass what the old guy thought, especially not tonight. All he wanted was to get to Henry. Henry would make it better. Greg watched the boy run for the elevator and frowned. He\u0027d fought in two wars and he knew bone-deep terror when he saw it. He didn\u0027t approve of the boy-part of his job as security guard included keeping that type out of the building-nor did he approve of his relationship, whatever it was, with Mr. Fitzroy, but he wouldn\u0027t wish that kind of fear on anyone. Henry could smell the fear stink from across the apartment and when Tony launched himself into his arms it became almost overwhelming. Keeping a tight grip on the Hunger that had risen with a body so vulnerably presented, he set his own fears aside and held the younger man silently until he felt muscles relax and the trembling stop. When he thought he\u0027d get an answer, he pushed Tony gently an arm\u0027s length away and asked, \"What is it?\" Tony rubbed his palm across lashes spiked with moisture, too frightened to deny there had been tears. The skin around his eyes looked bruised and he had to swallow, once, twice, before he could speak. \u0027I saw, this afternoon, a baby? he just?\" The shudder ran the length of his body, Henry\u0027s presence finally allowing him release. \"And now, he\u0027ll? I mean I saw him kill the baby!\" Henry\u0027s mouth tightened at the suggestion that someone would threaten one of his. He pulled Tony, unresisting, over to the couch and sat him down. \"I will not allow you to be harmed,\" he said in such a tone Tony had no choice but to believe it. \"Tell me what happened. From the beginning.\" As Tony spoke, slowly at first, then faster as though he were racing his fear to the end of the story, Henry had to turn away. He walked to the window, spread one hand against the glass, and looked out over the city. He knew the dark-haired, dark-eyed man. \u0027He\u0027s killing children, \" Vicki told him. \u0027He\u0027ll come for me, \" cried Tony. \u0027Because we\u0027re all there is.\" Even Mike Celluci had a voice in his head. I feel the sun. It\u0027s hours to dawn and I feel the sun. \u0027Henry?\" Slowly, he turned. \"I\u0027ll go to where you saw him last, and try to track him.\" He had no doubt he would recognize the scent, pick it out of a hundred scents laid across concrete on a November afternoon. And if he found the creature\u0027s lair, what then? He didn\u0027t know. He didn\u0027t want to know. Tony sighed. He knew Henry wouldn\u0027t let him down. \"Can I stay here? Until you come back?\" Henry nodded and repeated, \"Until I come back,\" as if it were some sort of mantra that would ensure his return. \u0027Do you, do you need to eat before you go?\" He didn\u0027t think he could; not eat, not? \"No. But thank you.\" Brushing his hair back off his face, Tony managed a shaky grin and the shadow of a shrug. \"Hey, it\u0027s not like I mind or anything.\" Because he could do no less than this mortal boy, Henry drew up a smile in return. \"Good.\" The shrilling of the phone snapped both heads around wearing almost identical expressions of panic. Henry quickly slid a mask in place so that when Tony glanced over at him and asked, \"You want me to get it?\" he appeared under control and could calmly answer, \"No. I\u0027ll take care of it.\" He lifted the receiver before the second ring had quite finished sounding, having moved from the window to the phone in the space between one heartbeat and the next. It took him almost as long to find his voice. \u0027Hello? Henry?\" Vicki. No mistaking the tone split equally between worry and annoyance. He didn\u0027t know what he\u0027d expected. No, that wasn\u0027t true; he knew exactly what he\u0027d expected, he just didn\u0027t know why. If Anwar Tawfik decided to contact him, he would not be using the phone. \u0027Henry?\" \u0027Vicki. Hello.\" \u0027Is something wrong?\" The words had been given a professional shading that told him she knew something was wrong and he might as well tell her what. \u0027Nothing\u0027s wrong. Tony\u0027s here.\" Behind him, he heard Tony shift his weight on the couch. \u0027What\u0027s wrong with Tony?\" The obvious conclusion; he should\u0027ve known she\u0027d jump to it. \"He has a problem. But I\u0027m going to take care of it for him. Tonight.\" \u0027What kind of problem?\" \u0027Just a minute.\" He covered the mouthpiece, half turned, and raised a questioning eyebrow. Tony emphatically shook his head, fingers digging deep into a cushion. \"Don\u0027t tell her, man. You know what Victory\u0027s like; she\u0027ll forget she\u0027s only human, just charge out there and challenge the guy and the next thing we\u0027ll know, she\u0027s history.\" Henry nodded. And I am not only human. I am the night. I am Vampire. I want her with me. I don\u0027t want to face this creature alone. \"Vicki? He doesn\u0027t want me to tell you. It\u0027s uh, trouble with a man.\" \u0027Oh.\" He didn\u0027t dare read anything into the pause that followed. \"Well, I want to spend some time with Mike this evening; fill him in on what we know is happening. Warn him.\" Again the pause. \"If you don\u0027t need me?\" What did she sense? The half lie? His fear? \"Will you be here for the dawn?\" Regardless of what happened tonight, if he was to have another dawn, he wanted her there for it. \u0027I will.\" It had the sound of a pledge. \u0027Then give my regards to the detective.\" Vicki snorted. \"Not likely.\" Her voice softened. \"Henry? Be careful.\" And she was gone. A little of the horror lost its effect. It was amazing how much \"be careful\" could sound like \"I love you.\" Holding her words-her tone-like a talisman, he went over the location with Tony one more time, shrugged into his coat, and went out into the night. He took dubious comfort in the knowledge that now, at least, he could be sure he wasn\u0027t going crazy. Many of the spells he had spent long years learning would have to be adapted to this new time and place. Unfortunately, as he now found himself in a culture that held few things sacred, finding substitutions would not be easy. The ibex had been revered to the extent that sacred had become a pan of its name and that made beak and blood and bone very powerful agents for magic. Somehow he doubted that rendering up a Canada goose would have the same effect. Suddenly he sat bolt upright in the chair and twisted to face the windows. It was out there. And it was close. He scrambled to his feet and began to throw on street clothes. His ka would not need to search again, simple awareness of the young man would be enough to find him. He didn\u0027t know how that glorious light had been hidden during the day, although he expected he\u0027d soon find out. One way or another. Henry had traced the scent to the southeast corner of Bloor and Queen\u0027s Park Road where it split, one track going north, the other south. Slowly he stood, brushed off the knee that had been resting on the concrete, and considered what he should do next. He knew what he wanted to do, he wanted to go back to Tony, say he couldn\u0027t find the creature, and deal with the younger man\u0027s fear instead of his own. Except that wasn\u0027t the way it worked. He had made Tony his responsibility. Honor had driven him out onto the streets and honor would not let him return. Night had followed day, cold and clear, the kind of weather where the scent clung to the ground and the hunt rode out behind the hounds. His best friend, the brother of his heart, Henry Howard, the Earl of Surrey, rode beside him, their geldings tearing across the frozen turf neck and neck. Ahead, the staghounds bayed and just barely ahead of the pack the quarry raced in a desperate attempt to outrun the death that closed upon its heels. Henry didn\u0027t see the exact moment the dogs closed in, but there was a scream of almost human pain and terror and then the stag thrashed on the ground. He pulled up well back from the seething mass of snarling dogs who darted past striking hooves and tossing antlers to worry at the great beast, but Surrey took his horse as close as it would go, leaning forward in the stirrups, eyes on the knife and the throat and the hot spurt of blood that steamed in the bitter November air. \"Why?\" he asked Surrey later, when the hall was filled with the smell of roasting venison and they were sitting bootless, warm before the fire. Surrey frowned, the elegant line of his black brows dipping in toward the bridge of his nose. \"I didn\u0027t want the death of such a splendid animal to be wasted. I thought I might find a poem?\" His voice trailed off so Henry prodded, \"Did you?\" \"Yes. \" The frown grew thoughtful. \"But a poem too red for me I think. I will write the hunt and keep the stag alive. \" Four hundred and fifty odd years later, Henry answered as he had then. \"But there is always death at the end of a hunt.\" The track to the south had almost been buried beneath the other footsteps of the day. The track to the north seemed better defined, as though it had been taken more than once; to and from a hotel room perhaps. Henry crossed Bloor, drew even with the church on the corner, and froze so completely motionless that the stream of Sunday night pedestrians flowed seamlessly around him. He knew the dark-haired, dark-eyed man approaching.","sourceLink":"https://allnovel.net/blood-lines-vicki-nelson-3/page-11.html","bookId":2466,"book":{"id":2466,"title":"Blood Lines (Vicki Nelson #3)","description":"Storyline: Blood Lines (Vicki Nelson #3) Sealed away through unending centuries in a sarcophagus never meant to be opened, he had patiently waited for the opportunity to live again, for the chance to feed on the unwary and grow strong. Now, at last, the waiting had come to an end. Brought to the Egyptology Department of Toronto\u0027s Royal Ontario Museum, the seals and spells that imprisoned him chipped away by his discoverers, he reached forth to claim the minds and souls of the unsuspecting city dwellers, to begin building an empire for himself and his god. And only three people had even a hint that anything was wrong. For Henry Fitzroy, 450-year-old vampire, it began with a haunting, inescapable image of the sun, a terrifying symbol of death to one such as he. Fearing for his sanity, he called upon his sometime-lover and comrade in supernatural investigations, ex-cop Vicki Nelson, for help. And even as the two struggled to cope with Henry\u0027s obsession, Vicki\u0027s closest friend and former partner, Police Detective Mike Celluci was following up on two mysterious deaths at the museum, certain he was looking at murders not accidents - and equally convinced that the killer was a mummy brought back from the dead!","cover":"https://allnovel.net/images/blood-lines-vicki-nelson-3.jpg","author":"Tanya Huff","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-lines-vicki-nelson-3.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:38:01 PM"}}
