{"id":68515,"no":7,"title":"Page 7","content":"Night settles in time on all habitable planets. Not always, perhaps, at respectable intervals, since recorded periods of rotation vary from fifteen to fifty-two hours. That fact requires the most strenuous psychological adjustment from those traveling from planet to planet. On many planets such adjustments are made, and the waking-sleeping periods are tailored to fit. On many more the almost universal use of conditioned atmospheres and artificial lighting make the day-night question secondary except in so far as it modifies agriculture. On a few planets (those of the extremes) arbitrary divisions are made which ignore the trivial facts of light and dark. But always, whatever the social conventions, the coming of night has a deep and abiding psychological significance, dating back to man\u0027s pre-human arboreal existence. Night will always be a time of fear and insecurity, and the heart will sink with the sun. Inside Palace Central there was no sensory mechanism by which one could tell the coming of night, yet Biron felt that coming through some indefinite instinct hidden in the unknown corridors of the human brain. He knew that outdoors the night\u0027s blackness was scarcely relieved by the futile sparks of the stars. He knew that, if it were the right time of year, the jagged \"hole in space\" known as the Horsehead Nebula (so familiar to all the Trans-Nebular Kingdoms) inked out half the stars that might otherwise have been visible. And he was depressed again. He had not seen Artemisia since the little talk with the Director, and he found himself resenting that. He had looked forward to dinner; he might have spoken to her. Instead, he had eaten alone, with two guards lounging discontentedly just outside the door. Even Gillbret had left him, presumably to eat a less lonely meal in the company one would expect in a palace of the Hinriads. So that when Gillbret returned and said, \"Artemisia and I have been discussing you,\" he obtained a prompt and interested reaction. It merely amused him and he said so. \"First I want to show you my laboratory,\" he had said then. He gestured and the two guards moved off. \"What kind of a laboratory?\" asked Biron with a definite loss of interest. \"I build gadgets,\" was the vague response. It was not a laboratory to the eye. It was more nearly a library, with an ornate desk in the corner. Biron looked it over slowly. \"And you build gadgets here? What kind of gadgets?\" \"Well, special sounding devices to spy out the Tyrannian spy beams in a brand-new way. Nothing they can detect. That\u0027s how I found out about you, when the first word came through from Aratap. And I have other amusing trinkets. My visisonor, for instance. Do you like music?\" \"Some kinds.\" \"Good. I invented an instrument, only I don\u0027t know if you can properly call it music.\" A shelf of book films slid out and aside at a touch. \"This is not really much of a hiding place, but nobody takes me seriously, so they don\u0027t look. Amusing, don\u0027t you think? But I forget, you\u0027re the unamused one.\" It was a clumsy, boxlike affair, with that singular lack of gloss and polish that marks the homemade object. One side of it was studded with little gleaming knobs. He put it down with that side upward. \"It isn\u0027t pretty,\" Gillbret said, \"but who in Time cares? Put the lights out. No, no! No switches or contacts. Just wish the lights were out. Wish hard! Decide you want them out.\" And the lights dimmed, with the exception of the faint pearly luster of the ceiling that made them two ghostly faces in the dark. Gillbret laughed lightly at Biron\u0027s exclamation. \"Just one of the tricks of my visisonor. It\u0027s keyed to the mind like personal capsules are. Do you know what I mean?\" \"No, I don\u0027t, if you want a plain answer.\" \"Well,\" he said, \"look at it this way. The electric field of your brain cells sets up an induced one in the instrument. Mathematically, it\u0027s fairly simple, but as far as I know, no one has ever jammed all the necessary circuits into a box this size before. Usually, it takes a five-story generating plant to do it. It works the other way too. I can close circuits here and impress them directly upon your brain, so that you\u0027ll see and hear without any intervention of eyes and ears. Watch!\" There was nothing to watch, at first. And then something fuzzy scratched faintly at the corner of Biron\u0027s eyes. It became a faint blue-violet ball hovering in mid-air. It followed him as he turned away, remained unchanged when he closed his eyes. And a clear, musical tone accompanied it, was part of it, was it. It was growing and expanding and Biron became disturbingly aware that it existed inside his skull. It wasn\u0027t really a color, but rather a colored sound, though without noise. It was tactile, yet without feeling. It spun and took on an iridescence while the musical tone rose in pitch till it hovered above him like falling silk. Then it exploded so that gouts of color splattered at him in touches that burned momentarily and left no pain. Bubbles of rain-drenched green rose again with a quiet, soft moaning. Biron thrust at them in confusion and became aware that he could not see his hands nor feel them move. There was nothing, only the little bubbles filling his mind to the exclusion of all else. He cried out soundlessly and the fantasy ceased. Gillbret was standing before him once again in a lighted room, laughing. Biron felt an acute dizziness and wiped shakily at a chilled, moist forehead. He sat down abruptly. \"What happened?\" he demanded, in as stiff a tone as he could manage. Gillbret said, \"I don\u0027t know. I stayed out of it. You don\u0027t understand? It was something your brain had lacked previous experience with. Your brain was sensing directly and it had no method of interpretation for such a phenomenon. So as long as you concentrated Qn the sensation, your brain could only attempt, futilely, to force the effect into the old, familiar pathways. It attempts separately and simultaneously to interpret it as sight and sound and touch. Were you conscious of an odor, by the way? Sometimes it seemed to me that I smelled the stuff. With dogs I imagine the sensation would be forced almost entirely into odor. I\u0027d like to try it on animals someday. \"On the other hand, if you ignore it, make no attack upon it, it fades away. It\u0027s what I do, when I want to observe its effects on others, and it isn\u0027t difficult.\" He placed a little veined hand upon the instrument, fingering the knobs aimlessly. \"Sometimes I think that if one could really study this thing, one could compose symphonies in a new medium; do things one could never do with simple sound or sight. I lack the capacit,y for it, I\u0027m afraid.\" Biron said abruptly, \"I\u0027d like to ask you a question.\" \"By all means.\" \"Why don\u0027t you put your scientific ability to worth-while use instead of-\" \"Wasting it on useless toys? I don\u0027t know. It may not be entirely useless. This is against the law, you know.\" \"What is?\" \"The visisonor. Also my spy devices. If the Tyranni knew, it could easily mean a death sentence.\" \"Surely, you\u0027re joking.\" \"Not at all. It is obvious that you were brought up on a cattle ranch. The young people cannot remember what it was like in the old days, I see.\" Suddenly his head was to one side and his eyes were narrowed to slits. He asked, \"Are you opposed to Tyrannian rule? Speak freely. I tell you frankly that I am. I tell you also that your father was.\" Biron said calmly, \"Yes, I am.\" \"Why?\" \"They are strangers, outlanders. What right have they to rule in Nephelos or in Rhodia?\" \"Have you always thought that?\" Biron did not answer. Gillbret sniffed. \"In other words, you decided they were strangers and outlanders only after they executed your father, which, after all, was their simple right. Oh, look, don\u0027t fire up. Consider it reasonably. Believe me, I\u0027m on your side. But think! Your father was Rancher. What rights did his herdsmen have? If one of them had stolen cattle for his own use or to sell to others, what would have been his punishment? Imprisonment as a thief. If he had plotted the death of your father, for whatever reason, for perhaps a worthy reason in his own eyes, what would have been the result? Execution, undoubtedly. And what right has your father to make laws and visit punishment upon his fellow human beings? H e was their Tyranni. \"Your father, in his own eyes and in mine, was a patriot. But what of that? To the Tyranni, he was a traitor, and they removed him. Can you ignore the necessity of self-defense? The Hinriads have been a bloody lot in their time. Read your history, young man. All governments kill as part of the nature of things., \"So find a better reason to hate the Tyranni. Don\u0027t think it is enough to replace one set of rulers by another; that the simple change brings freedom.\" Biron pounded a fist into his cupped palm. \"All this objective philosophy is fine. It is very soothing to the man who lives apart. But what if it had been your father who was murdered?\" \"Well, wasn\u0027t it? My father was Director before Hinrik, and he was killed. Oh, not outright, but subtly. They broke his spirit, as they are breaking Hinrik\u0027s now. They wouldn\u0027t have me as Director when my father died; I was just a little too unpredictable. Hinrik was tall, handsome, and, above all, pliant. Yet not pliant enough, apparently. They hound him continuously, grind him into a pitiful puppet, make sure he cannot even itch without permission. You\u0027ve seen him. He\u0027s deteriorating by the month now. His continual state of fear is pathetically psychopathic. But that-all that-is not why I want to destroy Tyrannian rule.\" \"No?\" said Biron. \"You have invented an entirely new reason?\" \"An entirely old one, rather. The Tyranni are destroying the right of twenty billion human beings to take part in the development of the race. You\u0027ve been to school. You\u0027ve learned the economic cycle. A new planet is settled\"-he was ticking the points off on his fingers-\"and its first care is to feed itself. It becomes an agricultural world, a herding world. It begins to dig in the ground for crude ore to export, and sends its agricultural surplus abroad to buy luxuries and machinery. That is the second step. Then, as population increases and foreign investments grow, an industrial civilization begins to bud, which is the third step. Eventually, the world becomes mechanized, importing food, exporting machinery, investing in the development of more primitive worlds, and so on. The fourth step. \"Always the mechanized worlds are the most thickly populated, the most powerful, militarily-since war is a function of machines-and they are usually surrounded by a fringe of agricultural, dependent worlds. \"But what has happened to us? We were at the third step, with a growing industry. And now? That growth has been stopped, frozen, forced to recede. It would interfere with Tyrannian control of our industrial necessities. It is a short-term investment on their part, because eventually we\u0027ll become unprofitable as we become impoverished. But meanwhile, they skim the cream. \"Besides, if we industrialized ourselves, we might develop weapons of war. So industrialization is stopped; scientific research is forbidden. And eventually the people become so used to that, they lack the realization even that anything is missing. So that you are surprised when 1 tell you that I could be executed for building a visisonor. \"Of course, someday we will beat the Tyranni. It is fairly inevitable. They can\u0027t rule forever. No one can. They\u0027ll grow soft and lazy. They will intermarry and lose much of their separate traditions. They will become corrupt. But it may take centuries, because history doesn\u0027t hurry. And when those centuries have passed, we will still all be agricultural worlds with no industrial or scientific heritage to speak of, while our neighbors on all sides, those not under Tyrannian control, will be strong and urbanized. The Kingdoms will be semicolonial areas forever. They will never catch up, and we will be merely observers in the great drama of human advance.\" Biron said, \"What you say is not completely unfamiliar.\" \"Naturally, if you were educated on Earth. Earth occupies a very peculiar position in social development.\" \"Indeed?\" \"Consider! All the Galaxy has been in a continuous state of expansion since the first discovery of interstellar travel. We have always been a growing society, therefore, an immature society. It is obvious that human society reached maturity in only one place and at only one time and that this was on Earth immediately prior to its catastrophe. There we had a society which had temporarily lost all possibility for geographical expansion and was therefore faced with such problems as over-population, depletion of resources, and so on; problems that have never faced any other portion of the Galaxy. \"They were forced to study the social sciences intensively. We have lost much or all of that and it is a pity. Now here\u0027s an amusing thing. When Hinrik was a young man, he was a great Primitivist. He had a library on things Earthly that was unparalleled in the Galaxy. Since he became Director, that\u0027s gone by the board along with everything else. But in a way, I\u0027ve inherited it. Their literature, such scraps as survive, is fascinating. It has a peculiarly introspective flavor to it that we don\u0027t have in our extraverted Galactic civilization. It is most amusing.\" Biron said, \"You relieve me. You have been serious for so long that I began to wonder if you had lost your sense of humor.\" Gillbret shrugged. \"I am relaxing and it is wonderful. First time in months, I think. Do you know what it is to playa part? To split your personality deliberately for twenty-four hours a day? Even when with friends? Even when alone, so that you will never forget inadvertently? To be a dilettante? To be eternally amused? To be of no account? To be so effete and faintly ridiculous that you have convinced all who know you of your own worthlessness? An so that your life may be safe even though it means it has become barely worth living. But, even so, once in a while I can fight them.\" He looked up, and his voice was earnest, almost pleading. \"You can pilot a ship. I cannot. Isn\u0027t that strange? You talk about my scientific ability, yet I cannot pilot a simple one-man space gig. But you can, and it follows then that you must leave Rhodia.\" There was no mistaking the pleading, but Biron frowned coldly. \"Why?\" Gillbret continued, speaking rapidly: \"As I said, Artemisia and I have discussed you and arranged this. When you leave here, proceed directly to her room, where she is waiting for you. I have drawn a diagram for you, so that you won\u0027t have to ask your way through the corridors.\" He was forcing a small sheet of metallene upon Biron. \"If anyone does stop you, say that you have been summoned by the Director, and proceed. There will be no trouble if you show no uncertainty-\" \"Hold on!\" said Biron. He was not going to do it again. Jonti had chevied him to Rhodia and, consequently, succeeded in bringing him before the Tyranni. The Tyrannian Commissioner had then chevied him to Palace Central before he could feel his own secret way there and, consequently, subjected him, nakedly unprepared, to the whims of an unsteady puppet. But that was all! His moves, henceforward, might be severely limited, but, by Space and Time, they would be his own. He felt very stubborn about it. He said, \"I\u0027m here on what is important business to me, sir. I\u0027m not leaving.\" \"What! Don\u0027t be a young idiot.\" For a moment the old Gillbret was showing through. \"Do you think you will accomplish anything here? Do you think you will get out of the Palace alive if you let the morning sun rise? Why, Hinrik will call in the Tyranni and you will be imprisoned within twenty-four hours. He is only waiting this while because it takes him so long to make up his mind to do anything. He is my cousin. I know him, I tell you.\" Biron said, \"And if so, what is that to you? Why should you be so concerned about me?\" He was not going to be chevied. He would never again be another man\u0027s fleeing marionette. But Gillbret was standing, staring at him. \"I want you to take me with you. I\u0027m concerned about myself. I cannot endure life under the Tyranni any longer. It is only that neither Artemisia nor I can handle a ship or we would have left long ago. It\u0027s our lives too.\" Biron felt a certain weakening of his resolve. \"The Director\u0027s daughter? What has she to do with this?\" \"I believe that she is the most desperate of us. There is a special death for women. What should be ahead of a Director\u0027s daughter who is young, personable, and unmarried, but to become young, personable, and married? And who, in these days, should be the delightful groom? Why, an old, lecherous Tyrannian court functionary who has buried three wives and wishes to revive the fires of his youth in the arms of a girl.\" \"Surely the Director would never allow such a thing!\" \"The Director will allow anything. Nobody waits upon his permission.\" Biron thought of Artemisia as he had last seen her. Her hair had been combed back from her forehead and allowed to fall in simple straightness, with a single inward wave at shoulder level. Clear, fair skin, black eyes, red lips! Tall, young, smiling! Probably the description of a hundred million girls throughout the Galaxy. It would be ridiculous to let that sway him. Yet he said, \"Is there a ship ready?\" Gillbret\u0027s face wrinkled under the impact of a sudden smile. But, before he could say a word, there came a pounding at the door. It was no gentle interruption of the photo.. beam, no tender of the weapon of authority. It was repeated, and Gillbret said, \"You\u0027d better open the door.\" Biron did so, and two uniforms were in the room. The foremost saluted Gillbret with abrupt efficiency, then turned to Biron. \"Biron Farrill, in the name of the Resident Commissioner of Tyrann and of the Director of Rhodia, I place you under arrest.\" \"On what charge?\" demanded Biron. \"On that of high treason.\" A look of infinite loss twisted Gillbret\u0027s face momentarily. He looked away. \"Hinrik was quick this once; quicker than I had ever expected. An amusing thought!\" He was the old Gillbret, smiling and indifferent, eyebrows a little raised, as though inspecting a distasteful fact with a faint tinge of regret. \"Please follow me,\" said the guard, and Biron was aware of the neuronic whip resting easily in the other\u0027s hand.","sourceLink":"https://allnovel.net/the-stars-like-dust-galactic-empire-1/page-7.html","bookId":1724,"book":{"id":1724,"title":"The Stars, Like Dust (Galactic Empire #1)","description":"Storyline: The Stars, Like Dust (Galactic Empire #1) Biron Farrell was young and naïve, but he was growing up fast. A radiation bomb planted in his dorm room changed him from an innocent student at the University of Earth to a marked man, fleeing desperately from an unknown assassin. He soon discovers that, many light-years away, his father, the highly respected Rancher of Widemos, has been murdered. Stunned, grief-stricken, and outraged, Biron is determined to uncover the reasons behind his father’s death, and becomes entangled in an intricate saga of rebellion, political intrigue, and espionage. The mystery takes him deep into space where he finds himself in a relentless struggle with the power-mad despots of Tyrann. Now it is not just a case of life or death for Biron, but a question of freedom for the galaxy.","cover":"https://allnovel.net/images/the-stars-like-dust-galactic-empire-1.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-stars-like-dust-galactic-empire-1.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:09:06 AM"}}
