{"id":89015,"no":11,"title":"Page 11","content":"The Dickey brothers were two of the most unattractive individuals Jordan had ever encountered. They were both built like used-up wrestlers who’d let their muscles go to flab. Their necks were thick, their shoulders round. J. D. was taller than his brother, but not much. Randy carried quite a paunch, and his face was elongated by a double chin. Both men had small eyes, but J. D.’s were set close like a ferret’s. The chief of police finally turned her attention to Jordan. “My name is Chief Haden,” she said. “And you are?” Since she was holding Jordan’s driver’s license in her hand, the chief knew exactly who she was, but if she wanted to go through the formalities, Jordan wouldn’t argue. She told her her name and gave her address. “I want some questions answered right here and now. Do you know who the man in the trunk of this car is?” she asked. “The deceased. Do you know his name?” “Yes,” Jordan answered. “His name is Professor Horace Athens MacKenna.” “How do you know him?” she asked. Jordan quickly explained where and how she’d met the professor and why she was in Serenity. Chief Haden didn’t look like she believed a word Jordan was saying. “You’ll be coming with me to the police station,” she said. “You’ve got a lot more explaining to do. We’ll wait here until the coroner arrives, so don’t give me any trouble or I’ll cuff you right now.” Without a word, Sheriff Randy and his brother walked back to their car. J. D. had a disgusting smirk on his face. “Chief Haden, may I ask you a question?” Jordan asked. She was still seething with anger, but she kept calm. Pleasant was too much to ask for. “Make it quick.” The chief’s tone was snippy. “How did the sheriff know there was a body in the trunk?” “He said his brother got a tip on his cell phone. I can’t say if he’s telling the truth or not.” Sheriff Randy ignored the comment. His brother didn’t. Whirling around, he shouted, “Did you just call me a liar?” When the chief didn’t answer, J. D. said, “Are you going to take the word of a murderer over a law-abiding citizen?” “The FBI can check the sheriff’s cell phone records and get a printout of all the calls both of the brothers received in the past twenty-four hours. That will be helpful, won’t it, Chief Haden?” Jordan asked. J. D. snorted. “Yeah, right. As if the FBI would go to that kind of trouble for a homicide in this nickel-ass town. They won’t give you the time of day.” “I already called them, and they’re on their way here,” Jordan responded. She’d certainly gotten everyone’s attention with that statement. “Why would you call the FBI?” the chief demanded. “My brother Nick is an FBI agent. I talked to his partner and he assured me that he and Nick would be here shortly, but in the meantime, he’s sending over a couple of agents from the area’s district field office.” Sheriff Randy didn’t seem to be fazed hearing the FBI was going to get involved. J. D., on the other hand, looked startled and angry. “She’s bluffing.” Sheriff Randy continued on to his car. “Hold on there,” J. D. called out. “My brother has the right to question her.” “No, he doesn’t,” Jordan said. J. D.’s eyes bored into her. She didn’t flinch. She knew he was trying to frighten her, but she wasn’t about to shrivel up or cower. Then he took a threatening step toward her. Bring it on, she thought. He’d caught her unaware with the first punch, but she wasn’t about to let that happen again. This time she would be ready for him. “Maggie, are you gonna let the FBI come in here and tell you what to do?” J. D. whined. “After all Randy and I have done for you? You wouldn’t be such a hot shot chief of police if it weren’t for—” Haden cut him off. “Listen here,” she said. “I’m not letting anyone tell me what to do. Randy?” The sheriff turned back. “What, Maggie?” “What are you doing all the way over here anyway? And how come you’re out of uniform?” “I was planning to take the day off,” he said. “Can’t you see the fishing poles in my car? I came over to go fishing with my brother.” “You always drive your pickup when you go fishing,” she pointed out. “I didn’t today, did I?” “No need to get snide with me. You ought to get on with fishing and let me do my job.” “But the FBI…” J. D. began. Jordan deliberately interrupted. “I hope your police station is large enough to accommodate my family. I’m certain by now all of my brothers have heard and are on their way. And I’ve got a lot of brothers. Funny thing is, most of them are in law enforcement. Theo, my oldest brother,” she said, her tone annoyingly cheerful, “he doesn’t like to boast, but he’s pretty high up in the Justice Department.” She stared at J. D.’s ugly face as she added, “The United States Justice Department. Alec is working undercover for the FBI now, but he’ll want to come here too. Oh, and then there’s Dylan. He’s a chief of police himself,” she continued. “I imagine he’ll want to have a little chat with Sheriff Randy and J. D. You see, none of them is going to believe that nonsense about a car chase, and like me, they’re going to wonder who’s lying and why.” “You bitch,” J. D. snarled. “Get in the car, J. D.,” his brother said. “Maggie, I want to talk to you in private.” “You stay right where you are,” the chief said to Jordan. “Boys, you keep a watch on her,” she called out to the paramedics as she hurried toward the sheriff. Jordan watched the two in conversation from where she stood. The chief got as close to the sheriff as she could and nodded several times, obviously agreeing to whatever he was telling her. Not good, Jordan thought. Not good at all. A couple of minutes passed and then finally the Dickey brothers got in their car and took off. Chief Haden looked disgusted. “I’m going to find out what’s going on here. What’d you do to provoke the sheriff?” “I didn’t do anything,” Jordan countered. As though Jordan hadn’t spoken, she continued, “You’re going to tell me why the sheriff wanted to take you with him for questioning. What is it he knows about you?” Before Jordan could tell her that she didn’t have the faintest idea what was in either of the Dickey brothers’ twisted minds and she wasn’t about to start guessing, the coroner, wearing sunglasses and a Dallas Cowboys cap, pulled into the lot in a powder pink convertible. Del took hold of Jordan’s arm. “Come on back to the ambulance and wait with us.” Jordan went with the paramedic, but she kept her eye on Chief Haden, who was next to the rental car conversing with the coroner. When she was ready to leave, she shoved Jordan into the backseat of her squad car but didn’t bother handcuffing her. They drove to the corner and stopped. Haden called her deputy and left a message with his wife to find him and tell him to report to the police station as soon as possible. “Tell Joe I’ve got a murder investigation.” Jordan inwardly cringed over the glee she heard in the woman’s voice. The chief gunned the engine and roared through town with her siren blasting away. Chapter Ten THE POLICE STATION WAS EXTREMELY SMALL. JORDAN THOUGHT it looked like an old western movie set. There were two desks with a waist-high wooden railing between them and a swinging gate to the inner sanctum with a tiny office the size of a toll booth at the back for the sheriff. A door on the left led to a hallway with a bathroom and a single jail cell. There was only one other person in the station, a young woman sitting in front of a computer, crying. When the chief and Jordan walked in, she dabbed at her eyes with the cuff of her shirt-sleeve and lowered her head. Jordan heard the chief curse under her breath. “Still having trouble, Carrie?” “You know I hate this.” “Of course I know. You’ve done nothing but complain since you took this job.” “I didn’t take this job,” she muttered. “It was forced on me. And I haven’t complained all that much.” “Don’t argue with me in front of a suspect.” “Am I a suspect?” Jordan asked. She expected the chief to tell her that of course she was a suspect. The body was in her car, after all. Then the chief would read her her rights, and she’d ask for an attorney. None of that happened. “Are you a suspect?” the chief repeated. She cocked her head and frowned as though she couldn’t make up her mind. “I’ll determine that after I question you.” Jordan thought she was kidding, but the look on her face indicated she was, in fact, serious. Did she think that Jordan would willingly answer all of her questions and incriminate herself so that she could be arrested? Surreal, she thought. This was simply surreal. The cell was real enough. It was tucked around the corner from the front office. The chief led Jordan into the tiny room and then stepped out and closed the door. “I’m locking you in here so I’ll know you won’t be running away while I go back to talk to the crime scene people. I’m taking the key too,” Haden added, “just in case someone comes along and wants to let you out.” Jordan didn’t say a word. She couldn’t. She was speechless. She needed to calm down and collect her thoughts, so she sat on the cot and placed her hands on her knees, palms up, her back straight, her focus on the stone wall across from her. After a few minutes she closed her eyes and tried to remember some of her yoga exercises to gain what her instructor had told her was inner peace. Okay, so inner peace was out of the question, but if she could get her heartbeat to stop racing and her breathing to slow down, then maybe she would be able to stop freaking out inside. Two full hours, and then some, passed before the chief came back to the station. She opened the cell and dragged a straight-back chair in with her. Jordan could hear the chief’s assistant muttering in the other room, but she couldn’t make out what she was saying. “Is your assistant crying?” Jordan asked. The chief stiffened. “Of course not. That wouldn’t be professional.” They both heard a sob. “My mistake,” Jordan said. “I’m going to be taping this interview,” Haden announced as she produced a small recorder and laid it on the cot. The chief of police was incredibly inept. Jordan wanted to ask her if she had ever investigated a homicide before, but that question would only make her angry, especially if Jordan pointed out that she hadn’t been read her rights. “I have questions to ask. Are you ready to give me some honest answers?” She didn’t wait for Jordan to respond. “You can start by telling me how you could be driving a car and not know there was a dead body in it.” Her accusatory tone didn’t sit well with Jordan. “I told you, I picked the car up at the garage and didn’t look in the trunk until I was at the grocery store.” “And this friend of yours, this Professor MacKenna, he meets with you one day and is found murdered two days later—and you have no idea how that happened, right?” “I think I should have an attorney present if you’re going to continue with these questions,” Jordan said politely. Chief Haden pretended she hadn’t heard her. Two can play this game, Jordan decided, and she pretended she didn’t understand a single question she was asked from that point on. Eventually the chief stopped in frustration. “I thought we could have a friendly conversation,” she said. Jordan tilted her head and studied the woman. “You’ve locked me in a cell and you’re taping every word I say. That doesn’t seem very friendly to me.” “You listen here. You aren’t going to be able to intimidate me like you did the Dickey brothers with your talk about the FBI and the Justice Department. You can get yourself an attorney when I say you can, and you might as well know that, because you aren’t cooperating, you are now making yourself a suspect in this murder investigation.” She turned off the tape machine and finally got around to reading Jordan her rights. Then she dragged the chair out and slammed the cell door shut. She poked her head around the corner an hour later and said, “Here’s a phone book. You can look through it and pick out your own attorney. You can even get one from back east if that’s what you want, but you’re going to sit in this cell until you answer my questions. I don’t care how long it takes.” She handed the book through the bars and said, “Let me know when you want to make your call.” Could she be railroaded and charged with murder? If only Jordan had the approximate time the professor was killed, she would be able to figure out where she was and if anyone had seen her. She hoped he hadn’t been murdered during the night because she couldn’t prove she had stayed in her motel room. They could say that she jogged over to the professor’s house, killed him, but then how did she get the professor’s body into the trunk of her car, which was locked inside of Lloyd’s Garage? What was her motive? Would they make one up? This was going nowhere. She didn’t have enough information to form any kind of a defense…or alibi. She didn’t even know how the professor had been murdered. She’d been too stunned to take a good look at him all wrapped up like leftovers. She was completely out of her element…or out of her comfort zone as Noah would say. This was really all his fault, she decided, because he’d pointed out to her how dull her life was. She’d been perfectly happy not knowing she was boring. Now she felt powerless. In order to survive, the body needed water and food, but Jordan needed a computer and a cell phone too. Without all of her tech gadgets she was lost. Jordan hated feeling out of control. When she got out of here…if she got out…she’d take a couple of years and go to law school. She wouldn’t feel so vulnerable if she knew the law, now, would she? The chief interrupted her pity party. “Are you going to make the call to an attorney or not?” “I’ve decided to wait for my brother.” The chief snorted. “Are you going to hold to that story? You’re just stalling is all. You’ll change your mind soon enough because you’re not going to get anything to drink or eat until you start cooperating. I don’t care how long it takes. I’ll starve you to death if I have to,” she threatened.","sourceLink":"https://allnovel.net/shadow-dance-buchanan-renard-6/page-11.html","bookId":1831,"book":{"id":1831,"title":"Shadow Dance (Buchanan-Renard #6)","description":"Storyline: Jordan Buchanan is thrilled that her brother and best friend are tying the knot. The wedding is a lavish affair–for the marriage of Dylan Buchanan and Kate MacKenna is no ordinary occasion. It represents the joining of two family dynasties. The ceremony and reception proceed without a hitch–until a crasher appears claiming to be a MacKenna guest. The disheveled and eccentric professor of medieval history warns that there’s “bad blood” between the couple’s clans, stemming from an ancient feud that originated in Scotland, and involving the Buchanan theft of a coveted MacKenna treasure. Jordan has always led a cautious life and has used her intelligence and reason to become a successful businesswoman. So she is intrigued but skeptical of the professor’s claims that the feud has been kept alive by the grave injustices the Buchanans have perpetrated over the centuries. But when Noah Clayborne, a close family friend and a man who has never let a good time or a pretty girl pass him by, accuses Jordan of being trapped in her comfort zone, she determines to prove him wrong and sets out on a spontaneous adventure to the small, dusty town of Serenity, Texas, to judge the professor’s research for herself. Maneuvering through a close-knit community in which everyone knows everyone else’s business, Jordan never anticipates the danger and intrigue that lie in her path, nor the threat that will shadow her back to Boston, where even in familiar surroundings, her life is at risk. A powerful thug who rules by fear, a man who harbors a simmering secret, and an unexpected romance that pierces all defenses–beloved author Julie Garwood weaves these dazzling elements into a brilliant novel of romantic suspense. Shadow Dance is a searing tango of passion and peril.","cover":"https://allnovel.net/images/shadow-dance-buchanan-renard-6.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/shadow-dance-buchanan-renard-6.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 5:32:03 PM"}}
