{"id":84979,"no":10,"title":"Page 10","content":"\\n\\n Frustrated, I shook my head. “You know what I mean.”\\n\\n I almost jumped at the warm whisper of his breath on my ear as he leaned down to murmur quietly into it, “I like the reaction I get out of you.”\\n\\n I pulled back. So I was a challenge? Right. I got it now. “Just stop. You’re Ellie’s brother and we’re probably going to have to see one another, so I’d prefer it if you wouldn’t try to make me uncomfortable around you.”\\n\\n A scowl formed between his eyes. “I don’t want you uncomfortable.” His gaze was searching again but this time I was giving nothing away. With a deep sigh, Braden nodded. “Fine. Look, I’m sorry. I want us to get along. I like you. Ellie likes you. And I’d like us to be friends. From now on I’ll stop flirting with you and I’ll try really hard to forget what you look like naked.”\\n\\n He put the drinks on the bar and held out his hand for me to shake. The look in his eyes was a new one. It was pleading, boyish and totally endearing. I didn’t trust that look at all, but I found myself shaking my head, smiling despite myself as I reached out to clasp his hand. As soon as my fingers slid along his palm, the hair on my arms rose.\\n\\n I’d thought that spark that people apparently felt when they touched someone they were attracted to was a myth reserved for chick-lit and Hollywood.\\n\\n But no.\\n\\n Our eyes collided as heat rushed up my arm. The tingling between my legs intensified, the need in my gut moaned with want. All I could see was Braden, all I could smell was Braden, and his body was so close I imagined I could almost feel all his hard strength pressing against me. Right then I wanted nothing more than to pull him into the ladies restroom and let him screw me hard against the wall.\\n\\n Braden’s hand tightened around mine, his pale eyes darkened, and I knew… he wanted me too. “Fine,” he muttered, a dangerous quality entering his expression as he leaned down, his words puffing against my mouth he was so close. “I can do this. If you can pretend, I can pretend.”\\n\\n I jerked my hand out of his, trying not to tremble as I reached to collect the rest of the drinks. Braden picked up the ones he’d laid down when he’d reached for that godforsaken handshake. I hated that he was right. Our attraction was nuclear. I had never known anything like it.\\n\\n It made Braden Carmichael extremely dangerous to me.\\n\\n And I had to dissemble. I shot him a careless smile. “I’m not pretending.” I walked away before he could say anything, glad for the wall that had obscured our table’s view from us. I’d have been mortified if anyone had borne witness to our interlude.\\n\\n Braden sat down next to Holly, handing her a drink and Adam his. Our eyes collided for a brief second and he gave me a mockingly polite smile before leaning back and sliding his arm around the back of Holly’s chair. His girlfriend smiled at him, a manicured hand moving to rest intimately on his thigh.\\n\\n “Babe, I was just telling Ellie about this Gucci dress I saw online. I was thinking you could take me to Glasgow to try it on. You’ll like it. It’ll be worth the money.” She fluttered her fake lashes at him.\\n\\n No one needed to tell me that she meant it would be worth Braden’s money.\\n\\n Disgusted, I threw back my drink and tried to ignore them. Holly wasn’t for it.\\n\\n “So, Josh, how can you afford that gorgeous flat with Ellie?”\\n\\n All eyes fell on me. “It’s Joss, actually.”\\n\\n She gave me a shrug and a narrowed-eyed smile and suddenly I wondered if maybe she’d caught the looks between me and Braden.\\n\\n Shit.\\n\\n “So?” she insisted, a little cattily.\\n\\n Yeah. She’d seen ‘em alright.\\n\\n “My parents.” I threw back another drink and turned to Jenna to ask about her part-time job with the Scottish tourist industry.\\n\\n Holly’s voice cut through my question. “What do you mean ‘your parents’?”\\n\\n Stick a sock in it, lady! I looked at her with veiled annoyance. “Their money.”\\n\\n “Oh.” She wrinkled her nose as though she suddenly smelled something very, very bad. “You’re living off your parent’s money? At your age?”\\n\\n Oh no she didn’t. I took another drink and then smiled at her in warning as if to say, ‘don’t play this game with me, sweetheart, you won’t win.’\\n\\n She didn’t heed the warning. “So they pay for everything? Doesn’t that make you feel guilty?”\\n\\n Every fucking day. “Was it your money that bought those Louboutin’s… or Braden’s?”\\n\\n Ellie choked on her laughter, smothering the sound quickly in a gulp of her drink. I patted her on the back, aiding her in her pretense. When I looked back at Holly she was glaring at me, her face flushed red to her hairline.\\n\\n Point made. Question deflected. Spoiled bitch put in her place.\\n\\n “So people can get married at Stirling Castle, huh?” I turned back to Jenna and our earlier conversation. “I’ve only visited it once, but it’s a beautiful venue…”\\n\\n ~5~\\n\\n Two nights later I was soaking in the tub after a strenuous workout at the gym when I heard Ellie’s whoop of joy. Raising an eyebrow at the door, I wasn’t surprised by the knock that sounded on it two seconds later.\\n\\n “Can I come in?” she asked with laughter in her voice.\\n\\n Clearly whatever news she’d received couldn’t wait. I glanced down to make sure I was sufficiently covered by bubbles. “Sure,” I replied.\\n\\n The door eased open and Ellie stepped inside with two glasses of wine in her hand and a smug expression on her face. I took the glass she offered and grinned at her infectious good humor. “What’s going on?”\\n\\n “Well,” Ellie beamed, “After six dire months, Braden has finally dumped Holly.”\\n\\n I snorted into my glass, ignoring the way my stomach flipped at the news. “That’s your exciting news?”\\n\\n Ellie stared at me like I’d said something crazy. “Of course. It’s the best news in God knows how long. Holly was the worst of the lot. You know, I think the other night at the bar was the final nail in her coffin. Braden seemed mortified by her. It’s about time he dumped that self-absorbed, two-faced, money-grabbing pain in the arse.”\\n\\n I nodded in agreement, thinking about his blatant flirtation with me. “Yeah. He’d probably have only ended up cheating on her or something anyway.”\\n\\n Ellie’s joy instantly fled and she scowled at me. I raised an eyebrow at her reaction. “Braden would never cheat.”\\n\\n She really did think he walked on water. I cocked my head with a cynical smirk, a look probably bordering on condescending and punch-worthy. “Please, Ellie, he’s a guy who flirts with anything that moves.”\\n\\n Considering me for a moment, Ellie leaned back against the tiled walls, seeming unaware of the steam clinging to them and now most probably dampening the back of her shirt. Her celebration was apparently forgotten in the face of my negativity. “There’s one thing you should know about Braden. He would never cheat. He’s not perfect, I know that. But let’s just say that he would never be that cruel or dishonest to anyone. Anytime he’s been in a relationship and his interest has waned and hopped onto someone new, he’s been honest with his girlfriend and broken it off before starting up anything with someone else. I’m not saying his attitude isn’t a little shitty, but at least he’s honest.”\\n\\n Curious about Ellie’s surety, I took a sip of wine before asking, “Did someone cheat on Braden?”\\n\\n She gave me a sad smile. “It’s not my story to tell.”\\n\\n Wow. If Ellie was being close-mouthed about it, Braden really must be sore over it.\\n\\n “Suffice to say, he’s a serial dater. Completely monogamous but jumping from one relationship to the next. Holly lasted longer than most. I think it was because she took frequent trips down south.” Ellie then threw me a teasing, almost knowing look. “I wonder what girl has caught his interest this time.”\\n\\n I eyed her carefully. Did she know? Had she witnessed the spark between us?\\n\\n “And I wonder if she’ll finally be the one to knock him on his arse. He needs a reality check.”\\n\\n I murmured an incoherent response, not wanting to encourage her thoughts in my direction.\\n\\n “Sorry for interrupting your bath.”\\n\\n “No, it’s fine.” I raised my wine glass at her. “You brought red wine. We’re all good.”\\n\\n “Have you ever cheated on someone?”\\n\\n Whoa. Where did that come from?\\n\\n “Well?”\\n\\n Was this an interview to date her brother?\\n\\n Staring her straight in the eye so she would know I was being deadly serious, I replied more honestly than ever, trusting Ellie not to push me too much on the subject, “I never get close enough to anyone for that to be an issue.” My answer seemed to deflate her, and that only reaffirmed my guess that she’d been holding onto some kind of romantic notion about me and Braden. “I don’t do relationships, Ellie. I haven’t got it in me.”\\n\\n She nodded, her expression a little lost. “I hope that changes for you.”\\n\\n It never will. “Maybe.”\\n\\n “Okay. I’m going to leave you to your bath. Oh.” She stopped, turning back to me. “My mum cooks a big roast dinner on Sundays for all the family. You’re invited this Sunday.”\\n\\n A sudden chill descended over my warm bath and I shivered. I hadn’t been to a family gathering since high school. “Oh, I don’t want to intrude.”\\n\\n “You’re not intruding. And I won’t take no for an answer.”\\n\\n I smiled weakly, gulping down the entire glass of wine as soon as she closed the door behind her. Feeling the wine churn in my gut, I sent up a prayer for a miracle that would get me out of the family get together.\\n\\n Friday night I was running late for work at the bar. Ellie had decided to cook us dinner and it had turned into an unsalvageable disaster. We’d ended up eating out and losing track of time as we fell into deep discussion about our work—Ellie’s research and my book. Ellie had gone home to bed because of an awful headache that had come on suddenly, and I hurried to the bar. I shot Jo an apologetic look as I passed through and into the staff room. I was just shoving my things in my locker when my cell rang. \\n\\n","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-10.html","bookId":1891,"book":{"id":1891,"title":"On Dublin Street (On Dublin Street #1)","description":"Storyline: On Dublin Street (On Dublin Street #1) \\n Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… \\n Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. \\n Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. \\n But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.\\n","cover":"https://allnovel.net/images/on-dublin-street-on-dublin-street-1.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-dublin-street-on-dublin-street-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:03:39 PM"}}
