{"id":84992,"no":23,"title":"Page 23","content":"She looked like a kid who’d had her favorite toy taken away. “But-” “Ellie.” “Fine.” She sighed. In an effort to take her mind off of it, I leaned back against the counter with a concerned quirk of my right eyebrow. “So what was up with you and Adam tonight?” “I’m like you. I don’t want to talk about it.” Yeah right. “Ellie…” Her pale eyes narrowed unhappily. “Okay, so I want to talk about it. Dammit, how can you be so good at the whole keeping things to yourself thing?” she pouted. “It’s really hard.” I grinned and shook my head. “Not for me.” She stuck her tongue out at me and slumped wearily into a kitchen chair. “I’m knackered. Tonight was exhausting.” “Hence the crabby?” “I’m not crabby.” “You’re a little crabby.” “Well you would be too if you’d had to put up with Adam tonight.” I slipped into the seat beside her, wondering if I should hit the gym harder this week in preparation for kicking Adam’s ass. “What happened, honey?” “He’s confusing me.” Ellie grimaced, eyeing me sadly. “He keeps saying that we’re just friends but he acts like we’re not. Braden’s so wrapped up in you he didn’t even notice Adam’s behavior tonight, and Adam used that to his advantage.” “I did notice him getting all possessive on your ass, pulling you down beside him and all that.” “Possessive? The harder I tried to be cool towards him, the more he got in my space. And then when Braden was with you, I called him on it. I asked about Nicholas and why he was acting so weird…” “And what did he say?” “That Nicholas wasn’t good enough for me and if I’d stop acting like a petulant child he’d stop being overbearing.” Guy was good. I laughed humorlessly. “Nice way of side-stepping the actual question, huh?” “Well you’d know all about that,” she grumped. I snorted. “Meow.” Ellie groaned. “Oh, God, Joss, I’m sorry. I’m acting like such a bitch.” “I find it charming. Really.” She giggled and shook her head, her eyes drooping tiredly. “You’re crazy.” She stood up. “But I love you.” She yawned as I froze in place at her words. “I need my bed. We’ll talk in the morning, try to make sense of Adam’s nonsense, yeah?” But I love you. “Uh… yeah,” I replied, dazed. “Night.” “Night.” But I love you… ... “Come on,” I begged Dru. “It’ll be fun. Kyle will be there.” Dru eyed me doubtfully. “I totally embarrassed myself at the last kegger, Joss, and that didn’t involve having to wear a bikini.” I rolled my eyes. “We all embarrassed ourselves at the last kegger. That’s kind of the point. Come on. Nate will be there and I really want to hang out with him tonight.” “You mean hook up with him?” I shrugged. “Joss, maybe we should sit this one out. We’ve been going to a lot of parties lately.” Grinning, I hooked an arm around her neck and drew her to my side. “We’re kids. We’re supposed to party.” I need to party. I need to forget. “And I don’t want to party without you. I’ll tell you what? I’ll even upchuck on a JV cheerleader for you. That way, no matter what you do, I’ll still have committed the most treasonous act of the evening.” Dru laughed, hugging me close. “You’re crazy… but I love you.” …The walls closed in on me as my chest squeezed tight. I wheezed trying to draw breath. I was dying. The panic attack lasted longer this time, those words refusing to allow me to focus. Eventually, I struggled through to reality, pushing the memories back and allowing my body to breathe. When it was over, I wanted to cry more than I had ever wanted to cry in a long time. But crying would only make me weak. Instead I stood up on shaky legs and tread the memories into the kitchen tiles. By the time I changed and slid into bed I pretended it was all forgotten. “You had another panic attack?” the good doctor asked softly. Why had I mentioned it? Nothing good could come of it. She’d never be able to put a spin on what happened. “Yeah, it doesn’t matter.” “It does matter, Joss. What triggered this one?” I stared at my feet. “My friend.” “Which one?” My best friend. “Dru.” “You haven’t mentioned Dru before.” “No.” “Why did Dru trigger a panic attack, Joss?” My eyes slowly lifted to her, raw pain burning through me. “Because she died.” I sucked in a deep breath. “And it’s my fault.” I woke up just before noon and was immediately blasted by memories of the night before. Memories of Braden and the taste of what was possible between us. In an effort to forget, I spent lunch talking around in circles about Adam with Ellie, and fighting off the nerves that kept zinging in my belly every time I thought about Braden’s promise to come see me that night. I was just getting ready to head in for a bath when Ellie’s phone beeped and she cursed as she scrolled through a message. “What?” I asked lazily, as I put away our lunch dishes. “Braden’s been pulled into the office again, he’s missing another family dinner. I’ll have to put up with twenty questions from my mum asking if he’s alright.” I ignored the disappointed pang in my chest. If Braden was working tonight he wouldn’t be coming over after all. I should be freaking rejoicing. “Your mom really looks out for him, huh?” “Well Braden’s mum is a selfish, vain, money-grabbing witch who flitted in and out of his life whenever it suited her. He hasn’t seen her in years. So… yes. My mum looks out for him because his own mum doesn’t.” How could his mother not care about him? He was Braden Carmichael for Christ sake. “That’s unbelievable. I can’t imagine doing that to my own kid.” Not that I’d be having any. Ellie gave me her sad eyes. “Braden looks a lot like our dad. Braden’s mum, Evelyn, really loved him. He ended things with her abruptly. Settled some money on her. When she told him she was pregnant, he said he’d look after Braden, but he didn’t want anything to do with her. When she looks at Braden, all she sees is the man who broke her heart and so she’s never been very loving. Ever. Braden spent the school years at home in Edinburgh with a distant but controlling father, and his summers flying around Europe watching his mum hook up with rich idiots who didn’t have time for kids.” My heart ached for little boy Braden. And I made the mistake of letting it show on my face. “Oh, Joss…” Ellie breathed. “He’s okay, you know.” I don’t care. I jerked back from her soft expression. “I don’t care.” Her lips pinched together but she didn’t say anything. Instead she stood up, and when she walked by me she squeezed my shoulder. I stared at the sink, wondering how I’d managed to do this to myself. Where had the mask gone that kept everyone at bay? Why did it keep slipping off whenever Ellie or Braden were around? Feeling out of sorts, I grabbed my phone and headed into the bathroom to soak in the tub and drown it all out with some tunes, but as I was getting undressed, my phone rang. Braden Calling. I stared open-mouthed at the screen, trying to decide whether or not to answer it. I let it ring out. It rang again. And I just stared at it again. Two minutes later as I sank into the tub, thinking I’d escaped, Ellie banged on the bathroom door. “Braden says pick up the phone!” My phone rang and I closed my eyes. “Fine!” I yelled back and reached over for it. “What?” I answered. His deep chuckle rolled over me seductively. “Hello to you too.” “What do you want, Braden? I’m in the middle of something.” “Ellie says you’re in the bath,” his voice was low. “Wish I was there, babe.” I could almost feel him there. “Braden. What. Do. You. Want?” He gave a huff of amusement. “Just thought I’d call to let you know I can’t make it tonight.” Thank you, Jesus! “I’m having a problem with a few suppliers on this development and it put us back a few weeks. I don’t know when I’ll be free this week, but I guarantee the moment I get some time, I’m coming to see you.” “Braden, don’t do that.” “After last night, there’s no denying the promise of what’s between us. I’m not backing off, so rather than coming up with a new defense – which I’m sure I’d find highly entertaining – just give in, babe. You know you’re going to eventually.” “Have I mentioned how annoying and arrogant you are?” “I can still smell and taste you, Jocelyn. And I’m still fucking hard.” My stomach flipped and I squeezed my legs together. “God, Braden…” I breathed without thinking. “I can’t wait to hear you say that while I’m inside you. See you, babe.” And after that parting line, he hung up. I groaned, my head falling back against the tub. I was so screwed. ~12~ You know on those nature shows when the cute little meerkat is strolling along on its four cute little meerkat legs to get back to her burrow where all her little meerkat politics, drama and family await her, and this big-ass eagle comes swooping overhead…? The smart little meerkat runs for cover and waits that big-ass eagle out.","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-23.html","bookId":1891,"book":{"id":1891,"title":"On Dublin Street (On Dublin Street #1)","description":"Storyline: On Dublin Street (On Dublin Street #1) Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.","cover":"https://allnovel.net/images/on-dublin-street-on-dublin-street-1.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-dublin-street-on-dublin-street-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:03:39 PM"}}
