{"id":84998,"no":29,"title":"Page 29","content":"\\n\\n “So, is it true you’re banging Braden Carmichael?” Jo asked loudly as I poured my customer a pint of Tenants.\\n\\n The customer caught my answering glower and grinned sympathetically as he took his drink. “Why don’t you say that a little louder, Jo? I don’t think the people in the back heard you.”\\n\\n “Alistair caught them.” Craig waggled his brows suggestively as he reached past me for a bottle of Bailey’s. “Said he was practically in your knickers.”\\n\\n Alistair had a big mouth.\\n\\n I shrugged indifferently at the two of them and took my next customer’s order.\\n\\n “Oh come on,” Jo complained. “I had my eye on him. I want to know if he’s off the market.”\\n\\n Ignoring the flash of anger I felt at that, I shot her a cold smile. “You can have him when I’m done.”\\n\\n Jo’s mouth fell open. “So it’s true? You’re sleeping with him?”\\n\\n Apparently so, although the sleeping thing hadn’t originally been part of the deal. The son-of-a-bitch had snuck that in. I raised an eyebrow at my colleague, refusing to get into the details.\\n\\n Her face fell. “You’re not going to dish the dirt?”\\n\\n I shook my head and leaned over the bar to take another order.\\n\\n “Kin ah hae a mahjito, Jack in Coke, a boatil eh Millers… aw aye in eh Stace wahnted a Cosmo. Dae ye dae Cosmos?”\\n\\n Luckily, working in a bar for four years in Scotland had given me plenty of practice in understanding not only the thicker accents, but the drunk, thicker accents.\\n\\n In translation: Can I have a mojito, Jack and Coke, a bottle of Millers… oh yes and uh Stace wanted a Cosmo. Do you do Cosmos?\\n\\n I nodded and reached down to the fridge for the Millers.\\n\\n “Is he good?” Jo was suddenly in my face again.\\n\\n I sighed wearily and brushed past her to start making the Cosmo.\\n\\n “Is it exclusive?” Craig called down the bar. “Or can we still shag?”\\n\\n “What do you mean still?” I scoffed.\\n\\n “Is that a no?”\\n\\n “That’s a hell no.”\\n\\n “Oh come on, Joss,” Jo begged. “I’ve heard he’s an ‘effin stallion in the sack, but that’s second hand gossip. Give me first hand.”\\n\\n “Tell you what,” I mused, “Why don’t I give you first finger?” I flipped her off. Yeah, I know, not the most eloquent or mature response but she was really starting to bug me.\\n\\n Jo scowled. “You’re no bloody fun.”\\n\\n “Guess I’m not.”\\n\\n The atmosphere at the bar was nowhere near as warm and electric as it had been last weekend. Jo was pouting, Craig didn’t seem to know how to act around moody me, and I was, well, moody, because I was stuck inside my own head.\\n\\n I couldn’t get the memories of last night and this morning out of my mind, and if I was honest with myself, I was irritated and uneasy at the fact that I was actually looking forward to seeing Braden tomorrow. I was trying to worry less about my decision to get into this arrangement with him. I wanted to just enjoy myself. It was just taking me time to relax into it.\\n\\n It helped that Ellie was cool about the whole thing. I guess I didn’t know what to expect from her, but I thought there would be more disapproval than there was.\\n\\n She’d walked into the apartment earlier that day to find me at my laptop. I’d discussed my idea to write a contemporary novel based loosely on my mom and dad with Dr. Pritchard and she thought it was a good idea. Therapeutic even. However, I’d yet to start it—fear gripping me tight every time I’d laid my fingers against the keys to begin. Writing it would mean opening up all the memories, and I didn’t know if I could handle the inevitable panic attacks. The good doctor said the idea was to get to a point where the memories no longer caused a panic attack, and she thought the writing might be a nice way to ease me into that.\\n\\n After Braden left, I’d managed to write the first page. I was staring at that incredulously, astonished that I’d actually put words down, when Ellie got home and immediately stopped by my bedroom.\\n\\n She grinned knowingly at me as I turned in my seat to greet her. “So… how are you?”\\n\\n I wasn’t one to get easily embarrassed, but I have to admit it was a little awkward to know Ellie knew I had had sex with her brother. I made a face. “Is this going to be too weird for you?”\\n\\n “You and Braden dating?” She shook her head, her eyes bright. “No way. I think it’s great.”\\n\\n Uh oh. I cleared my throat, remembering Braden didn’t want to lie to her. “Actually, Ellie, we’re not really dating. It’s more of a physical thing.”\\n\\n Ellie seemed surprised. “You mean like friends with benefits?”\\n\\n Actually, I prefer the term fuck buddies. Ellie would never say the word ‘fuck’ though. “Pretty much.”\\n\\n She crossed her arms over her chest, her expression curious. “Is that what you want?”\\n\\n I nodded. “You know I’m not looking for a relationship.”\\n\\n “And Braden?”\\n\\n “The whole arrangement was his idea.”\\n\\n Ellie rolled her eyes. “Braden and his damn arrangements.” She heaved a sigh of exasperation. “Well, if it’s what you both want then fine. Just as long as it doesn’t affect you and me, I’m cool with it. It’s completely unromantic, but whatever.”\\n\\n I smirked at her. “I promise we’ll be fine. So, we’re cool?”\\n\\n Her returning smile was adorably lopsided. “We’re cool.”\\n\\n To prove that we were cool, we spent the afternoon together, wandering Princes Street, and colliding with little bundles of tourists here and there who stopped repeatedly to take photographs of the majestic Edinburgh Castle. It loomed high on its rock, creating a surreal clash of modern meets medieval… and some chaos, since the tourists taking the photographs didn’t give a crap where they stopped and how many people stumbled into them in their abrupt need to capture the wonder of it. For a few hours, we were in and out of every clothes store in the city center, trying to find a dress for Ellie to wear on her date that night. That’s right. Date. She’d met some guy called Jason in Starbucks and he’d asked her out, and she’d said yes. She said he was cute, but I got the feeling this was more to do with sticking it to Adam.\\n\\n Still, I worried a little for her. This was her first date since the Adam fiasco and she seemed really nervous when she left. My anxiety over the whole Braden situation was splashed with a healthy dose of curiosity, wondering how Ellie’s date was going. No wonder I was such a killjoy at work. For the first time in a while, I was desperate for my shift to end so I could go home and overthink in the comfort and quiet of my own home.\\n\\n The bar closed at one in the morning. After clean up, I got home around two. When I stepped into the apartment, I saw light from under the sitting room door. It seemed Ellie was still awake. Wanting to make sure she was alright, I pushed the door open quietly and drew to a complete halt.\\n\\n The only light lit was the floor lamp at the back of the couch, and lying in the peaceful gloom, his body sprawled on the couch, his feet dangling over the edge because of his height, was Braden. His eyes were closed. He looked so young with his lashes fanned across his cheeks, his features slack with relaxation as he slept. It was weird seeing him like that. Usually, I felt the eight year age difference between us. He was more mature, together, responsible, and decisive. But lying there, he could be mistaken for my age. He was way less intimidating like this and I liked it. A lot.\\n\\n Open on the table was a black folder, a couple of documents loose from their plastic pockets. Braden’s suit jacket was draped across the armchair, his leather shoes on the floor next to the coffee table, and an empty mug sat near all the paperwork.\\n\\n He’d come here to work?\\n\\n More than a little bemused, I backed quietly out of the room and closed the door. I’d thought he and Adam would have been out on a Friday night?\\n\\n “Hullo.”\\n\\n I whirled around to find Ellie standing in the kitchen doorway, still wearing the pretty peach summer dress she’d bought for her date, although she was sans the high-heeled, gold sandals that made her legs go on forever. I followed her into the kitchen and closed the door behind us so our voices wouldn’t travel and wake up Braden. “How was your date?”\\n\\n Folding her arms over her chest, Ellie leaned back against the counter with a very displeased expression on her face. Uh oh. “Not good.”\\n\\n “Oh God, what happened?”\\n\\n “Adam happened.”\\n\\n My eyes widened. “Okay. Explain.”\\n\\n “Braden called me earlier to tell me he had to work late tonight again, but Adam was free and was wondering if I fancied grabbing something to eat, maybe catch a movie afterwards. I told Braden to tell Adam I had a date with Jason.”\\n\\n “Right…?”\\n\\n Ellie’s face flushed, her pale eyes sparking angrily. “He called me five times during the date.”\\n\\n I tried to choke down my laughter and only kind of succeeded. “Adam did?”\\n\\n “Whatever Jason got from the five one-sided conversations, he said clearly I had ‘stuff’ going on and he was looking for something uncomplicated. And then he left.”\\n\\n “Wait,” My look castigated, “You didn’t pick up every time Adam called?”\\n\\n She flushed again, this time from embarrassment. “It’s rude to ignore someone.”\\n\\n I huffed. “Ellie, be honest. You love that the idea of you being on a date with some other guy is driving Adam crazy.”\\n\\n “He deserves a little torture.”\\n\\n “Wow. You are so much more bloodthirsty than I thought.” I grinned. “It’s brilliant, Ellie, it is. But how long are you planning on keeping this up? It must be exhausting. Wouldn’t it just be easier for you both to sit Braden down and explain to him that you have feelings for each other? He’ll just have to accept that.”\\n\\n “It’s not that simple.” Ellie bit her lip, staring dazedly at the floor. “It could ruin Adam and Braden’s friendship. Adam would never take that risk for me.” She shook her head sadly, and I felt a pang in my chest for her. Adam needed a serious wake up call. “Speaking of,” she glanced up at me with a curious frown between her eyebrows, “I came home a few hours ago and found Braden here doing his work. Said he was waiting for you. Aren’t you going to wake him?” \\n\\n","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-29.html","bookId":1891,"book":{"id":1891,"title":"On Dublin Street (On Dublin Street #1)","description":"Storyline: On Dublin Street (On Dublin Street #1) \\n Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… \\n Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. \\n Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. \\n But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.\\n","cover":"https://allnovel.net/images/on-dublin-street-on-dublin-street-1.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-dublin-street-on-dublin-street-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:03:39 PM"}}
