{"id":84975,"no":6,"title":"Page 6","content":"“Oh come on, sweetheart, it’s my birthday, just one kiss.” My hand clamped down around the guy’s and I bit my nails into his skin. “Let go of her, asshole, before I tear the flesh from your hand and nail it to your balls.” He hissed in pain and jerked back from me, consequently letting go of Jo. “American bitch.” He groaned, cradling the hand that was now covered in deep crescent-shaped marks. “I’m complaining to management.” Why did my nationality always come into play in a negative situation? And what? Were we in some 80’s brat pack movie? I snorted at him, unimpressed. Brian, our huge security guy appeared behind him. He did not look amused. “Problem, Joss?” “Yeah. Can you please remove this guy and his friends from the bar?” He didn’t even ask why. There had only been a few occasions where we’d had people tossed out, so Brian trusted my assessment of the situation. “Come on fellas, move it,” he growled and like the cowards they were, pale-faced and drunk off their asses, the three of them lumbered out of the bar with Brian behind them. Feeling Jo tremble beside me, I placed a comforting hand on her shoulder. “You okay?” “Aye.” She gave me a weak smile. “Bad night all around. Steven dumped me earlier.” I winced knowing how much that had to hurt Jo and her little brother. They lived together in a small apartment on Leith Walk where they took turns taking care of their mom who had ME– Chronic Fatigue Syndrome. To make the rent, Jo – who was gorgeous – used her looks to get herself ‘sugar daddies’ to help take care of them financially. No matter how much people told her she was smart enough to do something more with her life, she was just full of insecurities. The only confidence she did have was in her good looks and their ability to snag a guy to take care of her and her family. But looking after her mom always trumped them and sooner or later they all eventually dumped her. “I’m sorry, Jo. You know if you need help with rent or anything, all you’ve got to do is ask.” I’d offered more times that I could count. She always said no. “Nah.” She shook her head and pressed a soft kiss to my cheek. “I’ll find someone new. I always do.” She wandered away with a slump to her shoulders and I found myself worrying about her when I really didn’t want to. Jo was one of the misunderstood. She could grate on your nerves with her materialism, but humble you with her loyalty to her family. She might love pretty shoes but they took a backburner when it came to making sure her kid brother and mom were okay. Unfortunately, that loyalty also meant she’d trample over anyone who got in her way, and be trampled over by anyone willing to use her situation against her. “I’m going on my break. I’ll send Craig out.” I nodded, even though she couldn’t see me, wondering who her next victim would be. Or was that whose victim she would next become? “It’s quiet tonight.” Craig ambled towards me two minutes later with a can of soda in hand. Tall, dark-haired and good-looking, Craig probably pulled in just as many tips as Jo and I did. He was a perennial flirt. And he was good at it. “It’s summer,” I mused, casting an eye around the quiet club before turning my back to lean on the bar. “It’ll pick up weekdays again when August comes around.” I didn’t have to explain I meant it would pick up because of the Edinburgh Festival. In August, the entire city was taken over by the famous festival. Tourists descended on the city, stealing all the best tables in all the best restaurants and there was always so many of them they made walking five steps into a five minute journey. Tips were great though. Craig groaned and leaned closer to me. “I’m bored.” He flicked his eyes over my body with lazy perusal. “Want to shag me in the men’s toilets?” He asked me this every shift. I always said no, and then told him to ‘shag’ Jo instead. His reply: ‘Been there, done that’. I was a friendly challenge and I think he honestly had deluded himself into thinking he’d one day conquer me. “Well? Do you?” A familiar soft voice asked from behind me. I whirled around, blinking in surprise to find Ellie on the other side of the bar. Behind her was a guy I didn’t recognize and… Braden. Blanching instantly, still mortified from yesterday, I barely noted the carefully blank expression in his eyes as he watched Craig. Wrenching my own gaze from him, I smiled weakly at Ellie. “Um… what are you doing here?” Ellie and I had, had dinner together the night before. I’d told her Braden had stopped by, but I hadn’t told her about the whole naked thing. She’d told me about her class, and I could understand why she’d make such a great tutor. Her passion for art history was infectious and I found myself listening to her with genuine interest. All and all, it had been a pleasant first dinner. Ellie had asked me a couple of personal questions that I had managed to deflect back onto her. I now knew that she was a big sister to half-siblings, Hannah (fourteen) and Declan (ten). Her mom, Elodie Nichols, lived in the Stockbridge area of Edinburgh with her husband Clark. Elodie was a part-time manager at the Sheraton Grand Hotel, and Clark, a professor of classical history at the university. It was clear from the way she talked that Ellie adored them all and I got the impression that Braden spent more time with this family than his own mother. At lunch today, Ellie and I had taken a break from our own work and met in the sitting room for food and a little bit of television. We’d sniggered our way through an episode of classic British comedy ‘Are you Being Served?’ and had bonded in comfortable silence. I’d felt as though I were gaining surprisingly fast but steady ground with my new roommate. However, turning up at my work with her brother? Well that was not cool. Not that she knew about my incident yesterday with her brother… “We’re meeting up with some friends for a drink in Tigerlily. We thought we’d stop by to say hi.” She grinned at me, her eyes dancing with mischief in a seventh grader kind of way before she slanted them questioningly in Craig’s direction. Tigerlily huh? That was a nice place. I noted Ellie’s pretty sequin dress. It looked like something from the 1920’s and screamed designer. It was the first time I’d seen her so put together and with Braden standing next to her wearing another dapper suit as well as their companion, Adam, I felt a little out of sorts. Despite all my money, I wasn’t used to the obviously stylish, ‘cocktails and crème brulee’ kind of lifestyle these guys were used to. Somehow disappointed, I realized I did not fit in with this crowd. “Oh,” I answered dumbly, ignoring her questioning eyebrows. “This is Adam.” Ellie turned to the guy behind her as soon as she realized I wasn’t going to answer her silent query. Ellie’s pale eyes turned dark with deep warmth as she looked up at Adam and I wondered if this guy was her boyfriend. Not that she’d mentioned a boyfriend. The dark-haired hottie was just a little shorter than Braden with broad shoulders that filled out his suit nicely. His warm dark eyes glittered at me under the bar lights as he smiled. “Hi. Nice to meet you.” “You too.” “Adam is Braden’s best friend,” Ellie explained and then turned to her brother. As soon as she looked at him she burst out laughing, her giggles filling the bar like fairy bubbles as she glanced back at me over her shoulder. “I would introduce you to Braden but I believe… you’ve already met.” I barely heard the word ‘met’ over her choked laughter. I stiffened. She knew. Eyes narrowed, I shot Braden a disgusted look. “You told her.” “Told her what?” Adam asked bemused, looking at the still chortling Ellie as though she’d gone mad. Braden’s mouth turned up in amusement as he answered Adam without taking his eyes off me, “That I walked in on Jocelyn when she was wandering around the flat naked.” Adam eyed me curiously. “No,” I retorted with a bite in my tone. “I was coming out of the bathroom looking for a towel.” “He saw you naked?” Craig interrupted, a scowl marring his forehead. “Braden Carmichael.” Braden stuck a hand across the bar for Craig to shake. “Nice to meet you.” Craig took it, seeming a little dazed by Braden. Great. Even men were charmed by him. While he smiled at Craig, that smile disappeared when his eyes fell on me again. I detected a slight chill in them and frowned. What had I done now? “I have a girlfriend,” Braden assured Craig. “I wasn’t putting the moves on yours.” “Oh, Joss isn’t my girlfriend.” Craig shook his head with a cocky grin down at me. “Not for my lack of trying.” “Customer.” I pointed to the girl at the other end of the bar, glad for an excuse to get rid of him. As soon as he was gone, Ellie was leaning against the bar. “Not your boyfriend? Really? Why not? He’s cute. And he certainly thinks you’re hot.” “He’s a walking sexually transmitted disease,” I answered grumpily, running a dishrag over an invisible spot on the bar, desperately trying to avoid Braden’s gaze. “Does he always talk to you like that?” Braden’s question brought my head up reluctantly and I immediately felt the need to reassure him and defend Craig when I saw his cool, lethal eyes narrowed in my colleague’s direction. “He doesn’t mean anything by it.” “Oh man, that break surely wasn’t ten minutes?” Jo complained as she wandered slowly behind the bar. She reeked of cigarette smoke. I couldn’t imagine why anyone would put up with any habit that made them stink so badly. I wrinkled my nose at her and Jo instantly understood. Not taking it to heart, she just shrugged and blew me a teasing kiss as she stopped to lean against the bar across from Braden. Her big green eyes drank him in as though he were a cigarette she was trying to quit. “And who do we have here?”","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-6.html","bookId":1891,"book":{"id":1891,"title":"On Dublin Street (On Dublin Street #1)","description":"Storyline: On Dublin Street (On Dublin Street #1) Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.","cover":"https://allnovel.net/images/on-dublin-street-on-dublin-street-1.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-dublin-street-on-dublin-street-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:03:39 PM"}}
