{"id":84976,"no":7,"title":"Page 7","content":"“I’m Ellie.” She waved at Jo as though she was a cute fifteen year old. I smiled at her. She was kind of adorable. “I’m Joss’ new flatmate.” “Hi.” Jo offered her a polite smile before looking back at Braden expectantly. I wasn’t at all annoyed by her blatant interest in him. “Braden.” He nodded at her, his eyes quickly returning to my face. Okay. Really? I was stunned. If I were honest with myself I would admit that I had been bracing myself to watch Braden turn the flirt up a notch for Jo. She was tall, model thin, and had thick, poker-straight, long strawberry blonde hair. If Braden Carmichael transformed into a smoldering flirt around me then I had totally been expecting him to melt Jo into the floor with his charm. Instead he’d been kind of cool towards her. That did not make me happy in any way. Hmm. I’d always been good at lying to myself. “Braden Carmichael?” Jo asked, oblivious to his disinterest. “Oh my God. You own Fire.” Damn my curiosity over this guy. “Fire?” “The club on Victoria Street. You know, just off the Grassmarket.” Jo’s eyelashes were batting a mile a minute at him now. He owns a nightclub. Of course he does. “I do,” he muttered and then checked his watch. I knew that move. I used that move whenever I was uncomfortable. In that moment I really wanted to slap Jo for gushing all over him. Braden was not replacing Steven. No way. “I love that place,” Jo continued, leaning further over the bar to give him an eagle-eye view of her small, inconsequential chest. Meow. Where did that come from? “Maybe we could go together some time? I’m Jo, by the way.” Ugh. She was giggling like a five-year-old. For some reason that giggle, which I heard every Thursday and Friday night, was suddenly very irritating. Braden nudged Ellie as if to say ‘let’s go’, his expression impatient now. But Ellie was too busy murmuring to Adam to notice her brother’s quiet desperation. “What do you say?” Jo persisted. Braden shot me a searching look I didn’t quite understand before shrugging at her. “I have a girlfriend.” Jo snorted, fluffing her hair over her shoulder. “So leave her at home.” Oh Jesus C… “Ellie, didn’t you say you guys were meeting someone?” I asked loudly enough to drag her away from Adam. She needed to rescue her brother pronto. “What?” I gave her a pointed look and repeated the question with gritted teeth. Finally recognizing the look on Jo’s face and the one on her brother’s, Ellie nodded wide-eyed with understanding. “Oh yes. We better leave.” Jo sulked. “Don’t you-” “Jo!” Craig called for assistance from the bottom end of the bar where more customers had started congregating. I sort of loved him in that moment. Grumbling, Jo shot Braden a childish pout and hurried over to Craig and the waiting customers. “Sorry.” Ellie bit her lip, casting Braden an apologetic look. He waved her apology off and stepped back, gesturing like a gentleman for her to take the lead out of the bar. “Bye, Joss.” She gave me a wide smile and a wave. “I’ll see you in the morning.” “Yeah. Have a good night.” I observed the proprietary hand Adam placed on Ellie’s lower back as he nodded a polite goodbye my way and led her out. Was there something going on there? Possibly. Not that I would ask her about it. She’d only turn my curiosity back on me with questions about my non-existent love life and then she’d want to know why my love-life was non-existent. That was not a conversation I wanted to have with anyone. My skin prickled and reluctantly I let my gaze travel back to Braden who’d taken a step towards the bar, the polite coolness from earlier replaced with a heat that was all too familiar. “Thanks for the rescue.” I swear his low, rumbling voice vibrated all the way into my panties. Squirming inwardly, I tried for nonchalance. “No problem. Jo’s a sweetheart and she doesn’t mean any harm… but she’s a blatant gold digger.” Braden just nodded, seeming uninterested in anything Jo-related. Silence quickly fell between us, our eyes catching, staying, locking. I didn’t even realize my mouth had fallen open until his eyes dipped to stare at it. What the hell was this? I snapped back from him, feeling my skin flush as I glanced around to see if anyone else had caught the moment between us. No one was watching. Why wasn’t he leaving? Looking back at him, I tried not to seem unnerved, when in actuality I was so out of my depth. I attempted unsuccessfully to ignore his slow, heated perusal of my body. He had to stop doing that! When his eyes eventually crawled their way back up to mine, I made a face at him. I couldn’t believe him. He’d pretty much ignored Jo, but for me he’d turn on ‘the sex’. Did he get some sick satisfaction out of tormenting me? Stepping back from the bar with a quick grin, Braden shook his head at me. “What?” I scowled. He smirked at me. I hated when guys smirked at me. Even sexy smirks like his. “I don’t know what I like better…” he mused, stroking his chin in teasing contemplation. “…the naked you, or you in that tank top. D’s right?” What? I frowned, totally confused. And then it hit me. Jerk! The asshole had just—correctly—guessed my bra cup size. He was never going to let me live down yesterday. I could see that now. I threw my dishrag at him and he laughed, dodging it. “I’ll take that as a yes.” Then he was gone before I could summon up an epic retort that would knock him on his ass. I swear to God, the next time we met, I’d get the last word in. ~4~ Lena, the heroine of my fantasy series, and a bad-ass assassin in the kingdom of Morvern, was supposed to be planning her attack on the Queen’s Lieutenant, Arvane—a mage who was secretly having an affair with the Queen’s nephew, and using his influence and magic to manipulate monarchical and political control. Instead, Lena had begun fantasizing about stripping, Ten, leader of the Queen’s guard, naked. Ten, who had been a blonde in the first five chapters, was now dark-haired with pale blue eyes. He was also not supposed to be the romantic hero. There wasn’t supposed to be a romantic hero at all. This was all about Lena! Frustrated, I pushed away from my laptop. Freaking Braden! He was even polluting my manuscript with his sexual toxicity. That’s it. I was giving up for today. Knowing Ellie was bringing Chinese takeout home for dinner after her research at the university, I decided to slot in some time at the gym just around the corner on Queen Street as a pre-emptive attack on the calories. I generally didn’t care about my food intake, but I had been into sports at school and liked to keep in shape. Good thing too, because I really liked chips, or crisps, as they were called here. Any chips, all chips, fattening, delicious, and crispy chips. My close relationship with chips was possibly the most real in my life. I drove out my frustration over my book into the treadmill, crosstrainer, bike and weights until I was a sweating, jellified mess. The workout relaxed me–enough that my brain started to work again. A character started forming in my head and she wouldn’t leave me alone. Mostly because she was a lot like me. She was alone in life, independent, driven. She’d grown up in foster care in Scotland and moved to the US on a work visa and ended up falling in love… The character was my mom. My mom’s story had been great until it ended tragically. Everyone loves a good tragedy. Everyone would love my mom. She’d been spunky and outspoken, but really kind and compassionate. My dad had adored her from the minute he met her but it had taken him six months to break down her defenses. Their romance had been epic. I’d never thought about writing a romance before, but I couldn’t get the idea of immortalizing my parents on paper out of my head. Flashes of memories I’d buried under a steel and cold will started passing across my eyes until the gym disappeared around me: my mom standing at the kitchen sink, washing the dishes because she didn’t trust the dishwasher. My dad quietly pressing up against her back, his arms sliding around her waist and hugging her close as he whispered in her ear. Whatever he’d said had made her melt back against him, her head tilting up for his kiss. Then it flashed to my dad chasing my mom inside the house at night, the door slamming, scaring the bejesus out of me and my babysitter. My mom yelling at him for being an alpha male douchebag. My dad growling about how he wasn’t going to stand by and watch some jerk from her work blatantly flirting with her in front of him. My mom screaming that he didn’t have to punch the guy. ‘He had his hand on your ass!’ my dad had snapped back, as I watched on in bewildered amazement. Someone had had his hand on my mom’s ass in front of my dad? Idiot. ‘I was taking care of it!’ my mom argued. ‘Not fast enough! You’re not working with him anymore!’ From there the argument had escalated until my babysitter was running out of there without waiting for her payment. But I wasn’t worried by the argument. My parents had always had a passionate relationship. The argument would resolve itself. And it did. My dad apologized for losing his cool but wouldn’t budge on the whole ‘not working with him’ thing. The issue became such a big deal that my mom eventually agreed, because the jerk from her work was, well, a jerk and I assumed there was more to the story than just what had happened that night. My mom actually moved to a different accountancy firm. Marriage was all about compromise she’d said, and dad would do it for her. The memories were so clear. I could see the gold in my mom’s hazel eyes, could smell my dad’s cologne, could feel his arms around me, my mom’s hand brushing through my hair… My chest squeezed tight and I stumbled on the treadmill, the world around me coming back, but in a pulsing of color and noise that didn’t make sense. My blood was pounding in my ears, my heart rate had escalated so fast I struggled to breathe. Pain flared up my knee, but I was barely aware of it, or the strong hands helping me to my feet and on to solid ground.","sourceLink":"https://allnovel.net/on-dublin-street-on-dublin-street-1/page-7.html","bookId":1891,"book":{"id":1891,"title":"On Dublin Street (On Dublin Street #1)","description":"Storyline: On Dublin Street (On Dublin Street #1) Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.","cover":"https://allnovel.net/images/on-dublin-street-on-dublin-street-1.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/on-dublin-street-on-dublin-street-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:03:39 PM"}}
