{"id":72649,"no":32,"title":"Page 32","content":"Without realizing it, I’ve downed my champagne. Vaughn refills my glass. “It’s a long flight,” he says.\n “You haven’t told me where we’re going,” I say. “Or is that also something that can only be seen?”\n “I can tell you, though you might have to see it before you believe me,” Vaughn says. “We’re going to Hawaii.”\n Chapter 20\n THE FLIGHT is eleven torturous hours long. Eleven hours spent face-to-face with my captor, and at first every moment brings a new question. Were you ever really planning on reuniting me with my brother? Did you cause Cecily’s miscarriage? How much of your story was true? What do Rowan and I have to do with any of it? What’s happened to Deirdre? Where is Gabriel?\n “It’s going to be all right,” Rowan says. He’s all softness now, coaxing me to take another sip of champagne, telling me to turn around and see what’s outside my window, see the clouds.\n Helplessly I look at him. He will never be just Rowan again. I will never be just Rhine. Everything has been tampered with. I can understand how the citizens in Vaughn’s story must have felt, to have their lives invaded by the president’s meddling. All of that happened long before I was born, and yet here is my life being invaded, broken into shards. I can catch glimpses and glimmers of what used to be, but the pieces will never be put back.\n “It’s not going to be all right,” I murmur, but Rowan is listening to Vaughn prattle on about the altitude, and he doesn’t hear me.\n All this time during which Vaughn didn’t tell Rowan and me about each other had nothing to do with me, I realize. I was just something to keep his son occupied, and another body to experiment with. Rowan had the brains Vaughn needed, and Rowan never would have cooperated if he’d thought I was alive; he would have been too busy worrying about me.\n By the time we’ve landed, my head is throbbing. My ears feel strange, and my hearing is muffled. Even though we’ve been flying for eleven hours, it’s still daylight where we are. Through the window I can only see water, green and blue and deeper blue. I’ve never seen water so clear as this.\n “Our appointment is in an hour,” Vaughn says. “I can see our Rhine needs a while to regroup. I’ll arrange for your meals to be brought to you now, and I’ll come and get you when it’s time. How does that sound?”\n “That would be best,” Rowan says, speaking for both of us like I’m an invalid in his charge. I am grateful when Vaughn exits the jet, leaving us alone, though.\n The attendant that brings our food is of Pacific Islander descent, which would only serve to verify that we’ve arrived in Hawaii, the supposedly annihilated branch of America, but I am so numbed to Vaughn’s tricks that I haven’t decided what to believe.\n I barely notice the meal she brings at all, except for the aroma of lobster and melted butter. It’s one of my favorite meals. Is it coincidence, or has Vaughn somehow stolen that knowledge from me as well?\n “Before we get off this plane, I think Dr. Ashby meant for me to prepare you for the things you might see,” Rowan says.\n I cannot imagine how anything in this place will frighten me after what I’ve already seen. Rowan is still seeing the sixteen-year-old sister who was too naïve to understand that she was nearly stolen away when that Gatherer broke into our basement, who was dumb enough to answer an ad that was clearly a trap. He does not see what this year apart has shown me.\n Or maybe he does. He tilts my chin so that I’m facing him, and he says, “But you’re capable of seeing it for yourself. Right now I’m worried about other things.”\n “Other things?” I say.\n He clears his throat, looks at his plate. “Sooner or later we’ll both have to deal with the fact that things have changed. But right now you’re alive, which is more than I thought when I woke up this morning. It’s just that you’re—you look older. This past year I’ve accepted that you were frozen in time, that I would grow older but you would always be sixteen. A child. We were both children when we saw each other last, weren’t we? But you’re somebody’s wife now.”\n And now, strangely, I feel sorry for him. He hasn’t forgotten what it felt like to mourn my death.\n “I want answers and yet I don’t. I don’t know what I’m prepared to have you say about what you’ve been through.”\n “Sooner or later,” I say softly. “You’re right.”\n “For now I have one question, and it’s—” His face has gone pale. He won’t meet my eyes. “Your husband . . . has he been—kind? To you?”\n I think of Linden. My sullen, elegant once-husband, who was so desperately in love with a woman who slipped through his fingers. Who came to my bed and held me when we both needed it. Who had been sheltered all his life, yet who ran away from the only parent and the only stability he’s ever known, because of me.\n I don’t know that Rowan can ever understand the whole truth of my marriage to Linden. I don’t even know if I can. So I say, “Yes.”\n And I can’t help adding, “He’s nothing like his father.”\n “You’re angry with Dr. Ashby,” Rowan says. “I can understand that. I want to be angry with him myself. He’s kept us apart for a year, and yet—” He squints, trying to think of a way to reconcile this glitch in his great mentor. “And yet what he’s giving us more than makes up for it.”\n “Why do you believe everything he says?” I ask. I hesitate to say much more. I finally have him back and I can’t risk losing him again.\n “Didn’t you notice anything unusual about the attendant who brought our dinner?” he says.\n I wasn’t paying attention. “You mean that she was Hawaiian?” I ask.\n “I mean,” Rowan says, “that she was older than new generations but younger than first generations. They don’t even have those terms. The people here are born without the virus.”\n “That’s impossible,” I say. “It’s a trick.”\n Rowan smiles at his plate. “You never used to be the cynical one. It bothered me that you were so trusting. Now I think I miss it.”\n I miss lots of things about him. But I don’t say that.\n “You should try to eat something,” he says. “For energy, to combat the jet lag. It’s ten p.m. back where we came from, but it’s around dinnertime here.”\n We’ve just finished eating when Vaughn comes to collect us. He’s brought a change of clean clothes for us: black T-shirts and olive-green shorts that fit perfectly. For a moment I’m foolish enough to hope Deirdre is somehow safe and that she made them for me, but then I feel the itch of the factory label against my hip.\n “Your hair was always a bit unruly,” Vaughn says, frowning as I exit the jet. I won’t give him the satisfaction of patting my hair to determine what’s wrong with it.\n Vaughn walks several paces ahead of Rowan and me, and I wonder if he means for us to talk. It’s been more than a year since I’ve been this close to my brother, and now that I’m free to tell him about what I’ve endured, I know that it would be unwise of me. Whatever bond that has formed between my brother and Vaughn has been built on proof and on trust; Vaughn has justified his arguments and done so in a way that Rowan responded to. I’ll have to be very careful about how I speak to my brother. As it is, he has decided that everything Vaughn has done will serve a greater good, that I am still incapable of understanding but that I’ll come around.\n Vaughn knows this, doesn’t he? He knows that I’ll have to bide my time with Rowan just as I had to bide my time with Linden. Vaughn is wise to my ways, and this time he isn’t going to let me get away so easily.\n “You don’t look well.” Rowan frowns.\n “It must be jet lag, like you said.”\n He bumps his shoulder gently against mine. It’s such a familiar gesture. It’s something he always used to do. And it makes me so homesick that I could cry, but I won’t, I refuse to. He has to see that I’m stronger now, that I’m not who I once was.\n But who am I?\n “Listen,” Rowan says when we enter the building. He’s leaning close to me, his voice a murmur. “You’re going to see some things that may frighten you. But I want you to know that I agreed to it. I want you to know that, however it may seem, I’m okay.”\n “I thought you said I didn’t need to be prepared,” I say.\n He bumps my shoulder again. “Just remember what I said.”\n We pass through several security checkpoints, and I pay attention to the armed guards, some of them male, some female. They all look as though they could be older than twenty or twenty-five, but I’m not convinced. I’m so tired and overwhelmed, and this entire day has been shrouded in unreal hues. It’s almost too much to trust that this is really my brother beside me, that I’m standing on a ground I was told no longer existed.\n And then we’ve stopped walking. Rowan is talking to a first-generation woman who is guiding him to a door that’s as white and sterile-looking as everything else around us. This place is all white walls and sharp edges, so pristine that I think we must be ruining it with our shoes.\n Rowan looks over his shoulder at me, and I see the thirteen-year-old boy who stood beside me when we felt the ground shake under our feet as our parents were killed. I see realization and fear. I see that we’re all the other has. And then his eyes are unreadable. “I’ll see you in a bit,” he tells me.\n “Wait,” I say. “Where are you going?”\n Vaughn puts his arm around me, steers me toward the opposite end of the hall. “Come with me,” he says.\n I look over my shoulder, but Rowan is already gone.\n We pass another security checkpoint, and then we’re in a dimly lit room that’s no bigger than my bedroom closet at the mansion. One wall is almost entirely made of glass, and it shows us a room with neon lights and a bed with its mattress at an incline.\n “I thought you and I might have a chance to chat,” Vaughn says. “You and I have never gotten along very well, but now that the circumstances have changed, I’d like for us to start over. I underestimated you before, perhaps. I wasn’t honest about the tests I conducted on you while you were married to my son. It’s just that you were so stubborn, and I was sure you’d object. But I’ve enjoyed getting to know your brother. I see now that you’re both bright children. Your parents would certainly be proud of how you’ve both turned out.”\n My arms are folded as I stare through the glass. “Don’t talk about my parents,” I say. \n","sourceLink":"https://allnovel.net/sever-the-chemical-garden-3/page-32.html","bookId":1763,"book":{"id":1763,"title":"Sever (The Chemical Garden #3)","description":"Storyline: \n Sever (The Chemical Garden #3) \n With the clock ticking until the virus takes its toll, Rhine is desperate for answers. After enduring Vaughn’s worst, Rhine finds an unlikely ally in his brother, an eccentric inventor named Reed. She takes refuge in his dilapidated house, though the people she left behind refuse to stay in the past. While Gabriel haunts Rhine’s memories, Cecily is determined to be at Rhine’s side, even if Linden’s feelings are still caught between them. \n Meanwhile, Rowan’s growing involvement in an underground resistance compels Rhine to reach him before he does something that cannot be undone. But what she discovers along the way has alarming implications for her future—and about the past her parents never had the chance to explain. \n In this breathtaking conclusion to Lauren DeStefano’s Chemical Garden trilogy, everything Rhine knows to be true will be irrevocably shattered.\n \n","cover":"https://allnovel.net/images/sever-the-chemical-garden-3.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/sever-the-chemical-garden-3.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:24:20 AM"}}
