{"id":102175,"no":1,"title":"Page 1","content":"Part I Lelio Rising 1 In the winter of my twenty-first year, I went out alone on horseback to kill a pack of wolves. This was on my father\u0027s land in the Auvergne in France, and these were the last decades before the French Revolution. It was the worst winter that I could remember, and the wolves were stealing the sheep from our peasants and even running at night through the streets of the village. These were bitter years for me. My father was the Marquis, and I was the seventh son and the youngest of the three who had lived to manhood. I had no claim to the title or the land, and no prospects. Even in a rich family, it might have been that way for a younger boy, but our wealth had been used up long ago. My eldest brother, Augustin, who was the rightful heir to all we possessed, had spent his wife\u0027s small dowry as soon as he married her. My father\u0027s castle, his estate, and the village nearby were my entire universe. And I\u0027d been born restless -- the dreamer, the angry one, the complainer. I wouldn\u0027t sit by the fire and talk of old wars and the days of the Sun King. History had no meaning for me. But in this dim and old-fashioned world, I had become the hunter. I brought in the pheasant, the venison, and the trout from the mountain streams -- whatever was needed and could be got -- to feed the family. It had become my life by this time -- and one I shared with no one else -- and it was a very good thing that I\u0027d taken it up, because there were years when we might have actually starved to death. Of course this was a noble occupation, hunting one\u0027s ancestral lands, and we alone had the right to do it. The richest of the bourgeois couldn\u0027t lift his gun in my forests. But then again he didn\u0027t have to lift his gun. He had money. Two times in my life I\u0027d tried to escape this life, only to be brought back with my wings broken. But I\u0027ll tell more on that later. Right now I\u0027m thinking about the snow all over those mountains and the wolves that were frightening the villagers and stealing my sheep. And I\u0027m thinking of the old saying in France in those days, that if you lived in the province of Auvergne you could get no farther from Paris. Understand that since I was the lord and the only lord anymore who could sit a horse and fire a gun, it was natural that the villagers should come to me, complaining about the wolves and expecting me to hunt them. It was my duty. I wasn\u0027t the least afraid of the wolves either. Never in my life had I seen or heard of a wolf attacking a man. And I would have poisoned them, if I could, but meat was simply too scarce to lace with poison. So early on a very cold morning in January, I armed myself to kill the wolves one by one. I had three flintlock guns and an excellent flintlock rifle, and these I took with me as well as my muskets and my father\u0027s sword. But just before leaving the castle, I added to this little arsenal one or two ancient weapons that I\u0027d never bothered with before. Our castle was full of old armor. My ancestors had fought in countless noble wars since the times of the Crusades with St. Louis. And hung on the walls above all this clattering junk were a good many lances, battleaxes, flails, and maces. It was a very large mace -- -that is, a spiked club -- that I took with me that morning, and also a good-sized flail: an iron ball attached to a chain that could be swung with immense force at an attacker. Now remember this was the eighteenth century, the time when white-wigged Parisians tiptoed around in high-heeled satin slippers, pinched snuff, and dabbed at their noses with embroidered handkerchiefs. And here I was going out to hunt in rawhide boots and buckskin coat, with these ancient weapons tied to the saddle, and my two biggest mastiffs beside me in their spiked collars. That was my life. And it might as well have been lived in the Middle Ages. And I knew enough of the fancy-dressed travelers on the post road to feel it rather keenly. The nobles in the capital called us country lords \"harecatchers.\" Of course we could sneer at them and call them lackeys to the king and queen. Our castle had stood for a thousand years, and not even the great Cardinal Richelieu in his war on our kind had managed to pull down our ancient towers. But as I said before, I didn\u0027t pay much attention to history. I was unhappy and ferocious as I rode up the mountain. I wanted a good battle with the wolves. There were five in the pack according to the villagers, and I had my guns and two dogs with jaws so strong they could snap a wolf\u0027s spine in an instant. Well, I rode for an hour up the slopes. Then I came into a small valley I knew well enough that no snowfall could disguise it. And as I started across the broad empty field towards the barren wood, I heard the first howling. Within seconds there had come another howling and then another, and now the chorus was in such harmony that I couldn\u0027t tell the number of the pack, only that they had seen me and were signaling to each other to come together, which was just what I had hoped they would do. I don\u0027t think I felt the slightest fear then. But I felt something, and it caused the hair to rise on the backs of my arms. The countryside for all its vastness seemed empty. I readied my guns. I ordered my dogs to stop their growling and follow me, and some vague thought came to me that I had better get out of the open field and into the woods and hurry. My dogs gave their deep baying alarm. I glanced over my shoulder and saw the wolves hundreds of yards behind me and streaking straight towards me over the snow. Three giant gray wolves they were, coming on in a line. I broke into a run for the forest. It seemed I would make it easily before the three reached me, but wolves are extremely clever animals, and as I rode hard for the trees I saw the rest of the pack, some five full-grown animals, coming out ahead of me to my left. It was an ambush, and I could never make the forest in time. And the pack was eight wolves, not five as the villagers had told me. Even then I didn\u0027t have sense enough to be afraid. I didn\u0027t ponder the obvious fact that these animals were starving or they\u0027d never come near the village. Their natural reticence with men was completely gone. I got ready for battle. I stuck the flail in my belt, and with the rifle I took aim. I brought down a big male yards away from me and had time to reload as my dogs and the pack attacked each other. They couldn\u0027t get my dogs by the neck on account of the spiked collars. And in this first skirmish my dogs brought down one of the wolves in their powerful jaws immediately. I fired and brought down a second. But the pack had surrounded the dogs. As I fired again and again, reloading as quickly as I could and trying to aim clear of the dogs, I saw the smaller dog go down with its hind legs broken. Blood streamed over the snow; the second dog stood off the pack as it tried to devour the dying animal, but within two minutes, the pack had torn open the second dog\u0027s belly and killed it. Now these were powerful beasts, as I said, these mastiffs. I\u0027d bred them and trained them myself. And each weighed upwards of two hundred pounds. I always hunted with them, and though I speak of them as dogs now, they were known only by their names to me then, and when I saw them die, I knew for the first time what I had taken on and what might happen. But all this had occurred in minutes. Four wolves lay dead. Another was crippled fatally. But that left three, one of whom had stopped in the savage feasting upon the dogs to fix its slanted eyes on me. I fired the rifle, missed, fired the musket, and my horse reared as the wolf shot towards me. As if pulled on strings, the other wolves turned, leaving the fresh kill. And jerking the reins hard, I let my horse run as she wanted, straight for the cover of the forest. I didn\u0027t look back even when I heard the growling and snapping. But then I felt the teeth graze my ankle. I drew the other musket, turned to the left, and fired. It seemed the wolf went up on his hind legs, but it was too quickly out of sight and my mare reared again. I almost fell. I felt her back legs give out under me. We were almost to the forest and I was off her before she went down. I had one more loaded gun. Turning and steadying it with both hands, I took dead aim at the wolf who bore down on me and blasted away the top of his skull. It was now two animals. The horse was giving off a deep rattling whinny that rose to a trumpeting shriek, the worst sound I have ever heard from any living thing. The two wolves had her. I bolted over the snow, feeling the hardness of the rocky land under me, and made it to the tree. If I could reload I could shoot them down from there. But there was not a single tree with limbs low enough for me to catch hold of. I leapt up trying to catch hold, my feet slipping on the icy bark, and fell back down as the wolves closed in. There was no time to load the one gun I had left to me. It was the flail and the sword because the mace I had lost a long way back. I think as I scrambled to my feet, I knew I was probably going to die. But it never even occurred to me to give up. I was maddened, wild. Almost snarling, I faced the animals and looked the closest of the two wolves straight in the eye. I spread my legs to anchor myself. With the flail in my left hand, I drew the sword. The wolves stopped. The first, after staring back, bowed its head and trotted several paces to the side. The other waited as if for some invisible signal. The first looked at me again in that uncannily calm fashion and then plunged forward. I started swinging the flail so that the spiked ball went round in a circle. I could hear my own growling breaths, and I know I was bending my knees as if I would spring forward, and I aimed the flail for the side of the animal\u0027s jaw, bashing it with all my strength and only grazing it. The wolf darted off and the second ran round me in a circle, dancing towards me and then back again. They both lunged in close enough to make me swing the flail and slash with the sword, then they ran off again. I don\u0027t know how long this went on, but I understood the strategy. They meant to wear me down and they had the strength to do it. It had become a game to them. I was pivoting, thrusting, struggling back, and almost falling to my knees. Probably it was no more than half an hour that this went on. But there is no measuring time like that. And with my legs giving out, I made one last desperate gamble. I stood stock-still, weapons at my sides. And they came in for the kill this time just as I hoped they would. At the last second I swung the flail, felt the ball crack the bone, saw the head jerked upwards to the right, and with the broadsword I slashed the wolf\u0027s neck open. The other wolf was at my side. I felt its teeth rip into my breeches. In one second it would have torn my leg out of the socket. But I slashed at the side of its face, gashing open its eye. The ball of the flail crashed down on it. The wolf let go. And springing back, I had enough room for the sword again and thrust it straight into the animal\u0027s chest to the hilt before I drew it out again. That was the end of it. The pack was dead. I was alive. And the only sound in the empty snow-covered valley was my own breathing and the rattling shriek of my dying mare who lay yards away from me. I\u0027m not sure I had my reason. I\u0027m not sure the things that went through my mind were thoughts. I wanted to drop down in the snow, and yet I was walking away from the dead wolves towards the dying horse. As I came close to her, she lifted her neck, straining to rise up on her front legs, and gave one of those shrill trumpeting pleas again. The sound bounced off the mountains. It seemed to reach heaven. And I stood staring at her, staring at her dark broken body against the whiteness of the snow, the dead hindquarters and the struggling forelegs, the nose lifted skyward, ears pressed back, and the huge innocent eyes rolling up into her head as the rattling cry came out of her. She was like an insect half mashed into a floor, but she was no insect. She was my struggling, suffering mare. She tried to lift herself again. I took my rifle from the saddle. I loaded it. And as she lay tossing her head, trying vainly to lift herself once more with that shrill trumpeting, I shot her through the heart. Now she looked all right. She lay still and dead and the blood ran out of her and the valley was quiet. I was shuddering. I heard an ugly choking noise come from myself, and I saw the vomit spewing out onto the snow before I realized it was mine. The smell of wolf was all over me, and the smell of blood. And I almost fell over when I tried to walk. But not even stopping for a moment, I went among the dead wolves, and back to the one who had almost killed me, the last one, and slung him up to carry over my shoulders, and started the trek homeward. It took me probably two hours. Again, I don\u0027t know. But whatever I had learned or felt when I was fighting those wolves went on in my mind even as I walked. Every time I stumbled and fell, something in me hardened, became worse. By the time I reached the castle gates; I think I was not Lestat. I was someone else altogether, staggering into the great hall, with that wolf over my shoulders, the heat of the carcass very much diminished now and the sudden blaze of the fire an irritant in my eyes. I was beyond exhaustion. And though I began to speak as I saw my brothers rising from the table and my mother patting my father, who was blind already then and wanted to know what was happening, I don\u0027t know what I said. I know my voice was very flat, and there was some sense in me of the simplicity of describing what had happened: \"And then ... and then. . .\" Sort of like that. But my brother Augustin suddenly brought me to myself. He came towards me, with the light of the fire behind him, and quite distinctly broke the low monotone of my words with his own: \"You little bastard,\" he said coldly. \"You didn\u0027t kill eight wolves!\" His face had an ugly disgusted look to it. But the remarkable thing was this: Almost as soon as he spoke these words, he realized for some reason that he had made a mistake. Maybe it was the look on my face. Maybe it was my mother\u0027s murmured outrage or my other brother not speaking at all. It was probably my face. Whatever it was, it was almost instantaneous, and the most curious look of embarrassment came over him. He started to babble something about how incredible, and I must have been almost killed, and would the servants heat some broth for me immediately, and all of that sort of thing, but it was no good. What had happened in that one single moment was irreparable, and the next thing I knew I was lying alone in my room. I didn\u0027t have the dogs in bed with me as always in winter because the dogs were dead, and though there was no fire lighted, I climbed, filthy and bloody, under the bed covers and went into deep sleep. For days I stayed in my room. I knew the villagers had gone up the mountain, found the wolves, and brought them back down to the castle, because Augustin came and told me these things, but I didn\u0027t answer. Maybe a week passed. When I could stand having other dogs near me, I went down to my kennel and brought up two pups, already big animals, and they kept me company. At night I slept between them. The servants came and went. But no one bothered me. And then my mother came quietly and almost stealthily into the room.","sourceLink":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2/page-1.html","bookId":2210,"book":{"id":2210,"title":"The Vampire Lestat (The Vampire Chronicles #2)","description":"Storyline: The Vampire Lestat (The Vampire Chronicles #2) Once an aristocrat in the heady days of pre-revolutionary France, now Lestat is a rockstar in the demonic, shimmering 1980s. He rushes through the centuries in search of others like him, seeking answers to the mystery of his terrifying exsitence. His story, the second volume in Anne Rice\u0027s best-selling Vampire Chronicles, is mesmerizing, passionate, and thrilling.","cover":"https://allnovel.net/images/the-vampire-lestat-the-vampire-chronicles-2.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:12:12 PM"}}
