{"id":102191,"no":17,"title":"Page 17","content":"10\n The following nights were a rampage. I began to drink up Paris as if the city were blood. In the early evening I raided the worst sections, tangling with thieves and killers, often giving them a playful chance to defend themselves, then snarling them in a fatal embrace and feasting to the point of gluttony.\n I savored different types of kills: big lumbering creatures, small wiry ones, the hirsute and the dark-skinned, but my favorite was the very young scoundrel who\u0027d kill you for the coins in your pocket.\n I loved their grunting and cursing. Sometimes I held them with one hand and laughed at them till they were in a positive fury, and I threw their knives over the rooftops and smashed their pistols to pieces against the walls. But in all this my full strength was like a cat never allowed to spring. And the one thing I loathed in them was fear. If a victim was really afraid I usually lost interest.\n As time went on, I learned to postpone the kill. I drank a little from one, and more from another, and then took the grand wallop of the death itself from the third or the fourth one. It was the chase and the struggle that I was multiplying for my own pleasure. And when I\u0027d had enough of all this hunting and drinking in an evening to content some six healthy vampires, I turned my eyes to the rest of Paris, all the glorious pastimes I couldn\u0027t afford before.\n But not before going to Roget\u0027s house for news off Nicolas or my mother.\n Her letters were brimming with happiness at my good fortune, and she promised to go to Italy in the spring if only she could get the strength to do it. Right now she wanted books from Paris, of course, and newspapers, and keyboard music for the harpsichord I\u0027d sent. And she had to know, Was I truly happy? Had I fulfilled my dreams? She was leery of wealth. I had been so happy at Renaud\u0027s. I must confide in her.\n It was agony to hear these words read to me. Time to become a liar in earnest, which I had never been. But for her I would do it.\n As for Nicki, I should have known he wouldn\u0027t settle for gifts and vague tales, that he would demand to see me and keep on demanding it. He was frightening Roget a little bit.\n But it didn\u0027t do any good. There was nothing the attorney could tell him except what I\u0027ve explained. And I was so wary of seeing Nicki that I didn\u0027t even ask for the location of the house into which he\u0027d moved. I told the lawyer to make certain he studied with his Italian maestro and that he had everything he could possibly desire.\n But I did manage somehow to hear quite against my will that Nicolas hadn\u0027t quit the theater. He was still playing at Renaud\u0027s House of Thesbians.\n Now this maddened me. Why the hell, I thought, should he do that?\n Because he loved it there, the same as I had, that was why. Did anybody really have to tell me this? We had all been kindred in that little rattrap playhouse. Don\u0027t think about the moment when the curtain goes up, when the audience begins to clap and shout...\n No. Send cases of wine and champagne to the theater. Send flowers for Jeannette and Luchina, the girls I had fought with the most and most loved, and more gifts of gold for Renaud. Pay off the debts he had.\n But as the nights passed and these gifts were dispatched, Renaud became embarrassed about all this. A fortnight later, Roget told me Renaud had made a proposal.\n He wanted me to buy the House of Thesbians and keep him on as manager with enough capital to stage larger and more wondrous spectacles than he\u0027d ever before attempted. With my money and his cleverness, we could make the house the talk of Paris.\n I didn\u0027t answer right away. It took me more than a moment to realize that I could own the theater just like that. Own it like the gems in the chest, or the clothes I wore, or the dollhouse I\u0027d sent to my nieces. I said no, and went out slamming the door.\n Then I came right back.\n \"All right, buy the theater,\" I said, \"and give him ten thousand crowns to do whatever he wants.\" This was a fortune. And I didn\u0027t even know why I had done this.\n This pain will pass, I thought, it has to. And I must gain some control over my thoughts, realize that these things cannot affect me.\n After all, where did I spend my time now? At the grandest theaters in Paris. I had the finest seats for the ballet and the opera, for the dramas of Moliere and Racine. I was hanging about before the footlights gazing up at the great actors and actresses. I had suits made in every color of the rainbow, jewels on my fingers, wigs in the latest fashion, shoes with diamond buckles as well as gold heels.\n And I had eternity to be drunk on the poetry I was hearing, drunk on the singing and the sweep of the dancer\u0027s arms, drunk on the organ throbbing in the great cavern of Notre Dame and drunk on the chimes that counted out the hours to me, drunk on the snow falling soundlessly on the empty gardens of the Tuileries.\n And each night I was becoming less wary among mortals, more at ease with them.\n Not even a month had passed before I got up the courage to plunge right into a crowded ball at the Palais Royal. I was warm and ruddy from the kill and at once I joined the dance. I didn\u0027t arouse the slightest suspicion. Rather the women seemed drawn to me, and I loved the touch of their hot fingers and the soft crush of their arms and their breasts.\n After that, I bore right into the early evening crowds in the boulevards. Rushing past Renaud\u0027s, I squeezed into the other houses to see the puppet shows, the mimes, and the acrobats. I didn\u0027t flee from street lamps anymore. I went into cafes and bought coffee just to feel the warmth of it against my fingers, and I spoke to men when I chose.\n I even argued with them about the state of the monarchy, and I went madly into mastering billiards and card games, and it seemed to me I might go right into the House of Thesbians if I wanted to, buy a ticket, and slip up into the balcony and see what was going on. See Nicolas!\n Well, I didn\u0027t do that. What was I dreaming of to go near to Nicki? It was one thing to fool strangers, men and women who\u0027d never known me, but what would Nicolas see if he looked into my eyes? What would he see when he looked at my skin? Besides I had too much to do, I told myself.\n I was learning more and more about my nature and my powers.\n My hair, for example, was lighter, yet thicker, and grew not at all. Nor did my fingernails and toenails, which had a greater luster, though if I filed them away, they would regenerate during the day to the length they had been when I died. And though people couldn\u0027t discern such secrets on inspection, they sensed other things, an unnatural gleam to my eyes, too many reflected colors in them, and a faint luminescence to my skin.\n When I was hungry this luminescence was very marked. All the more reason to feed.\n And I was learning that I could put people in thrall if I stared at them too hard, and my voice required very strict modulation. I might speak too low for mortal hearing, and were I to shout or laugh too loud, I could shatter another\u0027s ears. I could hurt my own ears.\n There were other difficulties: my movements. I tended to walk, to run, to dance, and to smile and gesture like a human being, but if surprised, horrified, grieved, my body could bend and contort like that of an acrobat.\n Even my facial expressions could be wildly exaggerated. Once forgetting myself as I walked in the boulevard du Temple, thinking of Nicolas naturally, I sat down beneath a tree, drew up my knees, and put my hands to the side of my head like a stricken elf in a fairy tale. Eighteenth-century gentlemen in brocade frock coats and white silk stockings didn\u0027t do things like that, at least not on the street.\n And another time, while deep in contemplation of the changing of the light on surfaces, I hopped up and sat with my legs crossed on the top of a carriage, with my elbows on my knees.\n Well, this startled people. It frightened them. But more often than not, even when frightened by the whiteness of my skin, they merely looked away. They deceived themselves, I quickly realized, that everything was explainable. It was the rational eighteenth-century habit of mind.\n After all there hadn\u0027t been a case of witchcraft in a hundred years, the last that I knew of being the trial of La Voisin, a fortune-teller, burnt alive in the time of Louis the Sun King.\n And this was Paris. So if I accidentally crashed crystal glasses when I lifted them, or slammed doors back into the walls when opening them, people assumed I was drunk.\n But now and then I answered questions before mortals had asked them of me. I fell into stuporous states just looking at candles or tree branches, and didn\u0027t move for so long that people asked if I was ill.\n And my worst problem was laughter. I would go into fits of laughter and I couldn\u0027t stop. Anything could set me off. The sheer madness of my own position might set me off.\n This can still happen to me fairly easily. No loss, no pain, no deepening understanding of my predicament changes it. Something strikes me as funny. I begin to laugh and I can\u0027t stop.\n It makes other vampires furious, by the way. But I jump ahead of the tale.\n As you have probably noticed, I have made no mention of other vampires. The fact was I could not find any.\n I could find no other supernatural being in all of Paris.\n Mortals to the left of me, mortals to the right of me, and now and then -- just when I\u0027d convinced myself it wasn\u0027t happening at all -- I\u0027d feel that vague and maddeningly elusive presence.\n It was never any more substantial than it had been the first night in the village churchyard. And invariably it was in the vicinity of a Paris cemetery.\n Always, I\u0027d stop, turn, and try to draw it out. But it was never any good, the thing was gone before I could be certain of it. I could never find it on my own, and the stench of city cemeteries was so revolting I wouldn\u0027t, couldn\u0027t, go into them.\n This was coming to seem more than fastidiousness or bad memories of my own dungeon beneath the tower. Revulsion at the sight or smell of death seemed part of my nature.\n I couldn\u0027t watch executions any more than when I was that trembling boy from the Auvergne, and corpses made me cover my face. I think I was offended by death unless I was the cause of it! And I had to get clean away from my dead victims almost immediately.\n But to return to the matter of the presence. I came to wonder if it wasn\u0027t some other species of haunt, something that couldn\u0027t commune with me. On the other hand, I had the distinct impression that the presence was watching me, maybe even deliberately revealing itself to me.\n Whatever the case, I saw no other vampires in Paris. And I was beginning to wonder if there could be more than one of us at any given time. Maybe Magnus destroyed the vampire from whom he stole the blood. Maybe he had to perish once he passed on his powers. And I too would die if I were to make another vampire.\n But no, that didn\u0027t make sense. Magnus had had great strength even after giving me his blood. And he had bound his vampire victim in chains when he stole his powers.\n An enormous mystery, and a maddening one. But for the moment, ignorance was truly bliss. And I was doing very well discovering things without the help of Magnus. And maybe this was what Magnus had intended. Maybe this had been his way of learning centuries ago.\n I remembered his words, that in the secret chamber of the tower I would find ail that I needed to prosper.\n The hours flew as I roamed the city. And only to conceal myself in the tower by day did I ever deliberately leave the company of human beings.\n Yet I was beginning to wonder: \"If you can dance with them, and play billiards with them and talk with them, then why can\u0027t you dwell among them, just the way you did when you were living? Why couldn\u0027t you pass for one of them? And enter again into the very fabric of life where there is ... what? Say it!\"\n And here it was nearly spring. And the nights were getting warmer, and the House of Thesbians was putting on a new drama with new acrobats between the acts. And the trees were in bloom again, and every waking moment I thought of Nicki.\n One night in march, I realized as Roget read my mother\u0027s letter to me that I could read as well as he could. I had learned from a thousand sources how to read without even trying. I took the letter home with me.\n Even the inner chamber was no longer really cold. And I sat by the window reading my mother\u0027s words for the first time in private. I could almost hear her voice speaking to me:\n \"Nicolas writes that you have purchased Renaud\u0027s. So you own the little theater on the boulevard where you were so happy. But do you possess the happiness still? When will you answer me?\"\n I folded up the letter and put it in my pocket. The blood tears were coming into my eyes. Why must she understand so much, yet so little? \n","sourceLink":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2/page-17.html","bookId":2210,"book":{"id":2210,"title":"The Vampire Lestat (The Vampire Chronicles #2)","description":"Storyline: \n The Vampire Lestat (The Vampire Chronicles #2) \n Once an aristocrat in the heady days of pre-revolutionary France, now Lestat is a rockstar in the demonic, shimmering 1980s. He rushes through the centuries in search of others like him, seeking answers to the mystery of his terrifying exsitence. His story, the second volume in Anne Rice\u0027s best-selling Vampire Chronicles, is mesmerizing, passionate, and thrilling.\n \n","cover":"https://allnovel.net/images/the-vampire-lestat-the-vampire-chronicles-2.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:12:12 PM"}}
