{"id":102180,"no":6,"title":"Page 6","content":"6 What caused it? Was it the late night drinking and talking, or did it have to do with my mother and her saying she was going to die? Did the wolves have something to do with it? Was it a spell cast upon the imagination by the witches\u0027 place? I don\u0027t know. It had come like something visited upon me from outside. One minute it was an idea, and the next it was real. I think you can invite that sort of thing, but you can\u0027t make it come. Of course it was to slacken. But the sky was never quite the same shade of blue again. I mean the world looked different forever after, and even in moments of exquisite happiness there was the darkness lurking, the sense of our frailty and our hopelessness. Maybe it was a presentiment. But I don\u0027t think so. It was more important than that, and frankly I don\u0027t believe in presentiments. But to return to the story, during all this misery I kept away from my mother. I wasn\u0027t going to say these monstrous things about death and chaos to her. But she heard from everyone else that I\u0027d lost my reason. And finally, on the first Sunday night of Lent, she came to me. I was alone in my room and the whole household had gone down to the village at twilight for the big bonfire that was the custom every year on this evening. I had always hated the celebration. It had a ghastly aspect to it -- the roaring flames, the dancing and singing, the peasants going afterwards through the orchards with their torches to the tune of their strange chanting. We had had a priest for a little while who called it pagan. But they got rid of him fast enough. The farmers of our mountains kept to their old rituals. It was to make the trees bear and the crops grow, all this. And on this occasion, more than any other, I felt I saw the kind of men and women who could burn witches. In my present frame of mind, it struck terror. I sat by my own little fire, trying to resist the urge to go to the window and look down on the big fire that drew me as strongly as it scared me. My mother came in, closed the door behind her, and told me that she must talk to me. Her whole manner was tenderness. \"Is it on account of my dying, what\u0027s come over you?\" she asked. \"Tell me if it is. And put your hands in mine.\" She even kissed me. She was frail in her faded dressing gown, and her hair was undone. I couldn\u0027t stand to see the streaks of gray in it. She looked starved. But I told her the truth. I didn\u0027t know, and then I explained some of what had happened in the inn. I tried not to convey the horror of it, the strange logic of it. I tried not to make it so absolute. She listened and then she said, \"You\u0027re such a fighter, my son. You never accept. Not even when it\u0027s the fate of all mankind, will you accept it.\" \"I can\u0027t!\" I said miserably. \"I love you for it,\" she said. \"It\u0027s all too like you that you should see this in a tiny bedroom in the inn late at night when you\u0027re drinking wine. And it\u0027s entirely like you to rage against it the way you rage against everything else.\" I started to cry again though I knew she wasn\u0027t condemning me. And then she took out a handkerchief and opened it to reveal several gold coins. \"You\u0027ll get over this,\" she said. \"For the moment, death is spoiling life for you, that\u0027s all. But life is more important than death. You\u0027ll realize it soon enough. Now listen to what I have to say. I\u0027ve had the doctor here and the old woman in the village who knows more about healing than he knows. Both agree with me I won\u0027t live too long.\" \"Stop, Mother,\" I said, aware of how selfish I was being, but unable to hold back. \"And this time there\u0027ll be no gifts. Put the money away.\" \"Sit down,\" she said. She pointed to the bench near the hearth. Reluctantly I did as I was told. She sat beside me. \"I know,\" she said, \"that you and Nicolas are talking of running away.\" \"I won\u0027t go, Mother. . .\" \"What, until I\u0027m dead?\" I didn\u0027t answer her. I can\u0027t convey to you the frame of mind. I was still raw, trembling, and we had to talk about the fact that this living, breathing woman was going to stop living and breathing and start to putrefy and rot away, that her soul would spin into an abyss, that everything she had suffered in life, including the end of it, would come to nothing at all. Her little face was like something painted on a veil. And from the distant village came the thinnest sound of the singing villagers. \"I want you to go to Paris, Lestat,\" she said. \"I want you to take this money, which is all I have left from my family. I want to know you\u0027re in Paris, Lestat, when my-time comes. I want to die knowing you are in Paris.\" I was startled. I remembered her stricken expression years ago when they\u0027d brought me back from the Italian troupe. I looked at her for a long moment. She sounded almost angry in her persuasiveness. \"I\u0027m terrified of dying,\" she said. Her voice went almost dry. \"And I swear I will go mad if I don\u0027t know you\u0027re in Paris and you\u0027re free when it finally comes.\" I questioned her with my eyes. I was asking her with my eyes, \"Do you really mean this?\" \"I have kept you here as surely as your father has,\" she said. \"Not on account of pride, but on account of selfishness. And now I\u0027m going to atone for it. I\u0027ll see you go. And I don\u0027t care what you do when you reach Paris, whether you sing while Nicolas plays the violin, or turn somersaults on the stage at the St. Germain Fair. But go, and do what you will do as best you can.\" I tried to take her in my arms. She stiffened at first but then I felt her weaken and she melted against me, and she gave herself over so completely to me in that moment that I think I understood why she had always been so restrained. She cried, which I\u0027d never heard her do. And I loved this moment for all its pain. I was ashamed of loving it, but I wouldn\u0027t let her go. I held her tightly, and maybe kissed her for all the times she\u0027d never let me do it. We seemed for the moment like two parts of the same thing. And then she grew calm. She seemed to settle into herself, and slowly but very firmly she released me and pushed me away. She talked for a long time. She said things I didn\u0027t understand then, about how when she would see me riding out to hunt, she felt some wondrous pleasure in it, and she felt that same pleasure when I angered everyone and thundered my questions at my father and brothers as to why we had to live the way we lived. She spoke in an almost eerie way of my being a secret part of her anatomy, of my being the organ for her which women do not really have. \"You are the man in me,\" she said. \"And so I\u0027ve kept you here, afraid of living without you, and maybe now in sending you away, I am only doing what I have done before.\" She shocked me a little. I never thought a woman could feel or articulate anything quite like this. \"Nicolas\u0027s father knows about your plans,\" she said. \"The innkeeper overheard you. It\u0027s important you leave right away. Take the diligence at dawn, and write to me as soon as you reach Paris. There are letter writers at the cemetery of les Innocents near the St. Germain Market. Find one who can write Italian for you. And then no one will be able to read the letter but me.\" When she left the room, I didn\u0027t quite believe what had happened. For a long moment I stood staring before me. I stared at my bed with its mattress of straw, at the two coats I owned and the red cloak, and my one pair of leather shoes by the hearth. I stared out the narrow slit of a window at the black hulk of the mountains I\u0027d known all my life. The darkness, the gloom, slid back from me for a precious moment. And then I was rushing down the stairs and down the mountain to the village to find Nicolas and to tell him we were going to Paris! We were going to do it. Nothing could stop us this time. He was with his family watching the bonfire. And as soon as he saw me, he threw his arm around my neck, and I hooked my arm around his waist and I dragged him away from the crowds and the blaze, and towards the end of the meadow. The air smelled fresh and green as it does only in spring. Even the villagers\u0027 singing didn\u0027t sound so horrible. I started dancing around in a circle. \"Get your violin!\" I said. \"Play a song about going to Paris, we\u0027re on our way. We\u0027re going in the morning!\" \"And how are we going to feed ourselves in Paris?\" he sang out as he made with his empty hands to play an invisible violin. \"Are you going to shoot rats for our supper?\" \"Don\u0027t ask what we\u0027ll do when we get there!\" I said. \"The important thing is just to get there.\"","sourceLink":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2/page-6.html","bookId":2210,"book":{"id":2210,"title":"The Vampire Lestat (The Vampire Chronicles #2)","description":"Storyline: The Vampire Lestat (The Vampire Chronicles #2) Once an aristocrat in the heady days of pre-revolutionary France, now Lestat is a rockstar in the demonic, shimmering 1980s. He rushes through the centuries in search of others like him, seeking answers to the mystery of his terrifying exsitence. His story, the second volume in Anne Rice\u0027s best-selling Vampire Chronicles, is mesmerizing, passionate, and thrilling.","cover":"https://allnovel.net/images/the-vampire-lestat-the-vampire-chronicles-2.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vampire-lestat-the-vampire-chronicles-2.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:12:12 PM"}}
