{"id":4337,"no":100,"title":"CHAPTER L.","content":"… “Now, unfold the mystery.” \n \n The trio of gentlemen proceeded to their task. The first epistle which was casually unfolded, exhibited but a few lines, wide asunder, and in their purport so unimportant, that Mr. Jackson flung the letter, spread open as it happened to be, on the top of the fire, and proceeded to take up a second. Lord L?, chancing to rest his eyes on the first while the heat was causing it to roll itself up, perceived, with some surprise, that the spaces between the lines, as well as all else that had appeared blank, was rapidly becoming, as by magic, covered with bright green characters. He snatched up the paper just as the devouring flame was about to[395] envelope it, and succeeded in saving all but a small part. The green writing was in the hand of Henry; and, to the utter astonishment of all the party, addressed to his father—so long supposed dead. The contents of the letter equally puzzled and confounded our secret committee, and decided them on comparing all the hitherto unexamined, because supposed to be unimportant, papers of Henry with those before them. \n \n They were accordingly sent for, and the letters on both sides found to present, in black ink, what appeared to be but the idle, careless correspondence of two young messmates, while, on being submitted to the ordeal of heat, they were all found to contain, in green writing, which, as it cooled, gradually disappeared again, the strange and mysterious communications, for many years, of father and son. From these letters the following wonderful discoveries were collected. The captain of the[396] privateer, the murderer of the younger St. Aubin, was shown to be the elder St. Aubin—the father of the unfortunate Henry, who was thus proved to have died by the hand of a parent! The silent, heart-broken being, who had so tenderly watched Julia, and who, there can be little doubt, met her death by the explosion of the smuggler, it appeared from all the circumstances, was the ill-fated Maria, Mrs. Montgomery’s sister. She, it seems, as well as her depraved husband, had escaped from the wreck of the vessel in which they had both so many years since been supposed to be lost. \n \n The vessel in question, it may be remembered, had specie on board. Some of the letters contained casual expressions, from which it might be gathered, that her foundering by night was not quite accidental. And one in particular, addressed by the elder St. Aubin to the younger, contained an account of his fortunate[397] escape, as he termed it, with his black, as much of the money as could conveniently be carried, and his wife; and their landing on the coast of France. The money obtained by this very suspicious adventure seems, from many after-allusions, to have been the first setting up of the desperate St. Aubin, in his triple calling of pirate, privateer, and smuggler, carried on for so many years after, with various degrees of success. \n \n The whole correspondence, from its commencement to its conclusion, proved that the St. Aubins, father and son, had, from Julia’s infancy, meditated, and ever since, step by step, proceeded with the plot for carrying her away, as soon as she should be of age. The spoils of her very large fortune, (rendered, by the death of Lady L? and her infant son, unalienable,) they were ultimately to have divided, while the income of the Craigs would have been the present[398] reward of their diabolical labours. Their victim, poor Julia, was to have been kept abroad, in strict concealment—the wife, by compulsion, of Henry, till cruel treatment and horrible threats should compel her to declare herself married to him by her own free choice. He was to have corresponded, meanwhile, in her name, with her family; having, it appeared, for this purpose, actually practised, for years, the imitation of her handwriting. It was also found that he had possessed himself of impressions of her seals, duplicates of her keys, \u0026c. On the subject of his being the intercepter of Fitz-Ullin’s proposals, and the writer of Julia’s supposed rejection, there was a letter of his, which exulted in the fact, and related his good fortune in having himself taken the precious epistle, as he termed it, from the postman, and having been inspired to suspect the truth on seeing it directed to Julia, in our hero’s hand. There could be no doubt[399] that Henry was also the author of all the other forged letters. \n \n Parts of the correspondence contained expressions and allusions which proved that the elder St. Aubin was the person who, under the name of Lauson, and assisted with keys and vouchers provided by Henry, had stripped the Craigs of all its valuables. By the produce of these it appeared the necessary funds had been raised for carrying on the desperate design on Julia herself, shortly after attempted. It further appeared that, by a curious combination of circumstances, the St. Aubins had, since a short time before the memorable attempt on our hero’s life at the masquerade at Arandale, been acquainted with the real birth of Fitz-Ullin, then known as the poor Edmund Montgomery. \n \n The circumstances were as follows. Jin of the Gins, (whose identity with the strolling beggar, who stole Edmund when a child, is[400] not, we trust, forgotten,) had, it seems, been so long in the employ of the elder St. Aubin as a confidential agent for the concealment and disposal of smuggled goods, and the conduct of various other transactions of a like nature, that she had, in her turn, confided to him the secret of our hero’s birth, for the purpose of consulting him as to whether the said secret was, or was not marketable. She had even offered to go shares with him, provided he would assist her in making something of the business. He had, of course, dissuaded her from taking any step that might risk discovery before the marriage of Julia to Henry should be effected, after which he promised to put her in the way of extorting a sum, either from the nurse and her son for keeping the secret, or from Lord Fitz-Ullin, the father, then living, and Edmund his rightful heir, for disclosing it. All this was explained in a letter from the outlaw to his[401] son, as an argument for redoubled vigilance in the watch the latter always kept over Julia and Edmund. In the elder St. Aubin’s next letter, his fears of the consequences of Julia’s attachment to our hero seem to have been much increased by some late accounts from Henry; for he even hints at how desirable it would be to rid themselves of all apprehension of danger from that quarter, and concludes by commanding his son to procure him a ticket to the Arandale masquerade, where, by approaching the parties in disguise, he should be enabled, he says, to judge himself of the urgency of the case. This epistle left no doubt that the elder St. Aubin had acted the part of the Indian juggler. Another letter contained allusions identifying him with the false pilot, who had attempted to run the Euphrasia aground at Leith. \n \n In an early part of the correspondence the fate of poor Betsy Park was spoken of as having[402] been untimely; but so darkly that whether the dreadful apprehensions which cost poor David his life, were well or ill founded must remain for ever involved in mystery. One of the letters of the elder St. Aubin, however, was of a very suspicious tendency, as it expressed the most unbridled rage towards Henry for having committed any folly which might ultimately interfere with the perfect legality of his projected marriage with Julia; adding, with savage ferocity, that whatever step his own imprudence had made necessary must be taken without flinching. Those letters may appear, considering the subjects of which they treat, to have been imprudently written: but the precaution of the invisible ink seems by the correspondents to have been thought all sufficient. It must also be observed that the information now obtained is collected from scattered hints darkly enough given, but elucidated on the present occasion by a comparison[403] of both sides of the correspondence, a contingency scarcely to have been anticipated. That such letters, however, were not all regularly destroyed is only one proof more, added to the many already extant, of the glaring imprudence with which vicious proceedings of every description are almost invariably carried on. \n \n Lord L? expressed himself greatly shocked at those proofs of Henry’s depravity. “We certainly have before us,” rejoined Mr. Jackson, “melancholy evidence that he has, from a boy, lived the base tool of his desperate father, the convenient link of the outlaw with civilized society, the slave of a tyrant whom he could not love, yet, from the spell of habit unbroken from childhood, dared not resist. How he at last died by the hand of that parent, we have seen: and, that the blow by which he fell may be invested with its full portion of horror, we must remember that it was struck with[404] the intent to murder, though not to murder Henry.” \n \n “To facilitate the retaking of his ship,” said Fitz-Ullin, “by the death of the only officer on board, was, I should think, all that the elder St. Aubin could have had in view by his wanton assassination, in cold blood, of a person he believed to be a stranger.” \n \n Henry’s having no knowledge to whom the privateer belonged, when he went on board her as prize-master, was accounted for by an attention to dates, which showed that she had been entirely fitted out and manned, since he, Henry, had last gone to sea in the Euphrasia. Each shocking discovery had been discussed, as the letter or letters throwing light on each, had been severally perused. The final decision of the gentlemen was, that none of the circumstances should ever be mentioned to Mrs. Montgomery; and that even to Julia and Frances, the disgusting scene of guilt and misery[405] should be but partially, and gradually laid open. \n \n Lord L? was the first to leave the library: the retrospect of past years always spread a shade over his brow, and occasioned him to seek the retirement of his own apartment. Fitz-Ullin was also hurrying away, when Mr. Jackson drew him back, and, with a countenance of the deepest melancholy, showed him a letter which he had, he said, succeeded in setting apart while examining the papers. \n \n This letter contained allusions to the death of Lady L?, worded in a style which made it appear but too probable, that there has been some foul play. \n \n The vengeance which the elder St. Aubin had long since sworn to accomplish, and, in its accomplishment, to render his wretched child his tool, is adverted to in evident connexion with other allusions to the immense fortune thus by the nature of certain settlements, secured[406] beyond contingency to a certain individual: expressions which, all circumstances considered, seemed scarcely to admit of other construction. \n \n When Fitz-Ullin had finished the perusal of the lines pointed out to him, both gentlemen looked at each other for some seconds in silence. Mr. Jackson then, taking the letter from the hand of our hero, said solemnly, “With your approval, my Lord, I shall commit this paper to the flames: the surmise it suggests, is too horrible to be suffered to poison the future reflections of a bereft husband. \n \n “If the crime which that surmise presents to the appalled imagination, has indeed been perpetrated, both the perpetrators already stand before a higher, and more unerring tribunal, than earth affords.” So saying, he flung the letter on the fire, and stood to see its last vestiges consumed. \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/795/59084.html","bookId":145,"book":{"id":145,"title":"First Love","description":"简介： 小说中21岁的季娜伊达是一个美丽美女，出生没落贵族，行动专横并动人。她的四周从来不缺一群崇拜者，她同这些人时常聚会并捉弄他们，但内心中深感厌恶，并渴望一个能够在精神上给于慰藉和依赖的男人。16岁的沃洛佳，故事中的我，对季娜伊达始终带有着纯真、热情的感情，...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/795","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
