{"id":4338,"no":101,"title":"CHAPTER LI.","content":"“Precious is the return of that lost look \n Of love.” \n … “Lighten’d glows each breast with rapture, \n Grateful now, too intense before!” \n \n Fitz-Ullin, at length released, sought our heroine from room to room. That unreserved communication of sentiment with her which had been looked forward to with such intoxicating delight, was now anticipated with a sobered feeling: it was now longed for as a balm to heal a sickened, and if, in his circumstances, that were possible, an almost saddened spirit. \n \n Julia was not to be found in the house; he therefore wandered into the shrubbery, where,[408] at the very paling gate at which they had parted on such miserable terms the evening before, he perceived her, and Frances with her. The latter, however, with a sportive air, disappeared at sight of our hero, who, the next moment, stood before Julia. Scarcely had one smile beamed on him, ere all that had almost forced the blissful explanation of the morning from its first place in his mind, was forgotten. This same smile, to Fitz-Ullin, who for so long had not had even a smile, seemed all sufficient; for the lovers now walked on in silence. By the time, however, that they had completed the round of the wood-walk, as it is called, and re-entered the shrubbery at the further end, they appeared not only to have recovered the use of speech, but to have become quite confidential, for they now held between them an open letter, which they seemed to be reading together. From an observation which our hero made as they finished the perusal of[409] the letter, it was probably the one which he had in the morning promised to show Julia, and which had cost both so much misery. \n \n “That letter,” he said, “I cannot view without shuddering. It has so long governed my fate, that I shall never learn to consider it what it really is, a mere unimportant scrap of paper, blotted and rendered foul by falsehood!” Every hour of their past lives was now reviewed; every word, every look, adverted to; and one little spellword found, which, now that it might be spoken, reconciled every contradiction, and solved every mystery. The light, in short, of First Love, that brightest sunshine of the heart, was now flung back on the long perspective of years gone by, shedding its beams on the distant scene, and displaying, decked in their natural and pleasing colours, all those greenest spots on memory’s waste, which hopelessness had hitherto overshadowed,[410] or treachery presented through its own false medium. \n \n Such recapitulations, however, to all but the parties interested, might seem tedious; we shall not therefore go through all; yet, were they most natural in those, whose every feeling had been for so long put to the torture, by the cruelest misrepresentations of all that most concerned their happiness. It was no wonder that they were not satisfied by merely telling their understandings, with a sweeping clause, that all was just the contrary of what it had been, or rather of what it had appeared to be; they felt that they owed to themselves, as it were, the delight of reversing each individual picture, and that hearts so long inured to suffering, required to be soothed into a confidence in their own felicity, by dwelling for a time on its details. \n \n The scene in the refreshment room was adverted[411] to. “When you kindly spoke,” he said, “of the consolation I ought to derive from friendship, and of my disappointed hopes never having been well founded, how bitter were my feelings! I understood you to mean, coolly to inform me that, if I had ever entertained a hope of being acceptable to you, it was false and presumptuous! I almost felt resentment; for, shall I say it, Julia, I thought,” and he hesitated, “that you had not always treated me as—as honour and good feeling should have dictated to a woman, whose affections were engaged to another.” \n \n “And I,” said Julia, colouring, “could not help thinking you very unkind and unfeeling, indeed, in rejecting, in the scornful and almost angry manner you did, my—all our friendship, and saying that the hope of being accepted by Lady Susan, (as I supposed,) was all that, in your eyes, had given value to existence!” \n \n “Yes, Julia,” he said, “the hope I spoke[412] of was, indeed, all that in my eyes gave value to existence!” \n \n When they had thus discussed points of tenderer interest, and at length seated themselves in an arbour particularly well calculated for the reception of lovers, Edmund, after a short silence, said, rather suddenly, “What must you have thought, Julia, of my interference about Lord Surrel?” \n \n “I was very much obliged,” she replied. \n \n “Why, nothing could have justified me,” he continued, “but the belief, not only of your attachment, but of your engagement, and of my being the sole person to whom that engagement had been confided. Why, what could you have supposed when I requested a private interview, and commenced questioning you on such a subject?” \n \n Julia did not reply; but she blushed, and looked away in so hurried a manner, that a sudden thought darted across the mind of Fitz-Ullin.[413] He caught her hand, and looking in her face with the most curiously amused expression of countenance, said, “No, Julia, did you give my request the common interpretation?” \n \n No reply from Julia; but the twisting away, or rather the trying to twist away of the hand, the deepening of the blush, the averting of the eyes, were confirmations all sufficient. Our hero could not help still smiling, while he tried to reconcile and to sooth. This, of course, offended more than it appeased, and the hand, though it had been kissed a thousand times, still manifested signs of being an unwilling captive. Fitz-Ullin was now obliged to apologize, so that all rational conversation was put an end to. Nay, he even knelt, and succeeded in making the other hand a prisoner; but notwithstanding all this humility of attitude, the countenance had, mixed with its absolute delight, a sort of triumph in the very fulness of[414] his felicity, with which Julia could not yet bring herself to be quite as well pleased, as with that expression which she had often remarked on former occasions, when, by giving Edmund the hundredth part of a smile, she had made him look humbly happy. After a short pause, however, employed in making his peace as well as he might, he renewed the conversation by saying, “And what could you have thought, Julia, of my reiterated declarations, that mine were but the claims of a brother?” This was another of the subjects on which she could not reply, and he went on. “I believed you justly shocked at the idea that you were about to be addressed as a lover, by one who knew your melancholy secret; and that, too, so soon after the terrible death of poor Henry. I hastened to do away such a suspicion; for, if I had a selfish hope, it was a distant one of course, and one which I did not, at the time, distinctly confess, even to myself. Under the[415] same false impressions I viewed, with utter amazement, the composure of countenance, voice, and manner, which you maintained, when things were said by others which I heard with terror, from the supposition that the very sounds must be shocking to your ears. When, for instance, Mr. Jackson read aloud the account of the trial, which, necessarily included the circumstances of the murder. The day of the funeral too; in short, I was thrown out of every calculation. I had expected to endure much from seeing you shed tears for one who, even in death, I could have envied any testimony of your affection; I had armed myself for this trial, severe as it must have proved, but I was altogether unprepared to find the being I had loved for the tenderness of her nature, the innocence of her heart, totally without feeling, or a consummate actress, or worse, a creature capable of having formed, from mere levity, without even the excuse of a sincere though[416] misplaced attachment, an engagement, unsanctioned by a father, and imprudent in itself. \n \n “That I should ever be able to win the love of one whose very friendship I had lost by declaring my attachment, one whom I now appeared to inspire with dread, was a thing quite hopeless. I saw, indeed, what were Lord L?’s flattering wishes. The very idea seemed to shake the powers of my mind, to darken my judgment, madden my passions, and harden my heart; for there were moments of bitterness, in which I asked myself, should I set your feelings at defiance, and avail myself of Lord L?’s authority to obtain you! The thought was of course rejected with disdain; but, its ever having crossed my imagination, was sufficient to prove, that I was no longer master of myself.” \n \n “I wish, Edmund,” said Julia, when in the evening the lovers again directed their steps towards the shrubbery walk, “you would tell[417] me what it was that caused your peculiar austerity of manner on board the Euphrasia.” \n \n “Why, that is a question which I cannot very well answer, Julia,” said Fitz-Ullin, smiling and taking her hand. She persisted, however. “You must remember,” he said at length, “that I believed you perfectly acquainted with my sentiments. In the innocent friendship of your manner, therefore, I saw—what appeared to me, seeing through a false medium, the weakness, if I must say it, of a woman who could not altogether resign the admiration of, even a rejected lover. And, in a woman who was herself engaged, it seemed doubly cruel, to foster with smiles (that, to one who already loved, and believed his love known to her who smiled, must bewilder every sense; and that for the mere idle gratification of vanity,) an unfortunate passion which she could not return, which, in fact, she had already cast from her!” \n \n [418] \n \n “My own Julia!” he exclaimed, suddenly stopping short and taking both her hands, “you really look as much condemned as if I had brought this horrible accusation against your pure innocent self in due form; but,” he added, “you must consider that when we are very miserable, we are never very just to those who cause our suffering! Weak too as I thought your conduct, its effects were too much for my strength of mind: I felt that it was dangerous to be near you. In how different a light would all that imagination thus misconstrued have appeared, could I have suspected that it was generous pity for my supposed disappointment about Lady Susan which gave that dangerous softness to your manner, unchecked by any idea that my feelings towards yourself had ever been other than those of an adopted brother. And now, Julia, it is your turn to make confessions: do tell me what crowning of all my presumption was it, of[419] which you suspected me when, no later than last evening, your gentle nature was, at length, provoked to say, ‘What can you mean? What can you dare to mean?’” She appeared very unwilling to reply; he entreated her to tell him, at least, to what feelings of hers it was she thought he meant to allude. At length she stammered out, “I suppose—I thought—I—must have thought—you meant—my—my—regard for—for yourself.” \n \n A delighted smile grew gradually over the features of Fitz-Ullin as he bent his head, trying to follow the downcast eyes, and catch the broken accents of the speaker. “But how then,” he whispered, “did you account for my not gladly, delightedly availing myself of—of—your—amiable condescension?” \n \n What words Julia found, or whether she found any, in her opinion, sufficiently delicate by which to express that she had understood him to have apologized more than once for[420] not being able to return the secret affection he had discovered her to entertain for him, we cannot exactly say, for here the scene closes. No very serious misunderstanding, however, appears to have ensued, for the lovers returned to tea with perfectly happy faces, and, during that cheerful ceremony, Edmund’s delight assumed almost an extravagant cast, while Julia actually began to prefer his looking quite happy to that more humble expression of dependance on her sovereign will and pleasure for the slightest portion of his felicity, which used to gratify her so much. \n \n The beginnings of love may be selfish, may be tyrannical, may require that vanity and thirst of power shall have due tribute paid them; but, when love is perfected, not only is vanity cast away, power and pride laid down, but self, that idol of the unoccupied heart, is forgotten, or valued only as contributing to the happiness of the being beloved! We speak,[421] of course, of that early sunbeam of life’s morning, First Love: the description here given can never be applicable to the mixed nature of the later awakened sentiment, with its thousand necessary alloys: the selfishness called into play by self-defence, the doubts of the future, taught by experience of the past; with all the calculating insinuations of interest hinting the wisdom of training the heart’s tendrils to cling to convenience. \n \n Let the plant be love, of course, says prudence; but why not place it in the comfortable south aspect of wealth and splendour? \n \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/795/59085.html","bookId":145,"book":{"id":145,"title":"First Love","description":"简介： 小说中21岁的季娜伊达是一个美丽美女，出生没落贵族，行动专横并动人。她的四周从来不缺一群崇拜者，她同这些人时常聚会并捉弄他们，但内心中深感厌恶，并渴望一个能够在精神上给于慰藉和依赖的男人。16岁的沃洛佳，故事中的我，对季娜伊达始终带有着纯真、热情的感情，...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/795","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
