{"id":4260,"no":23,"title":"Volume 2 CHAPTER I.","content":"“Then sweetly in seraphic strain returns, \n From ev’ry farthest arch, and highest cell.” \n \n During the day, Lord Borrowdale’s attentions to Julia were public and unremitting, while the infatuated, unhappy Edmund witnessed it all in growing sorrow of heart. Had he then, he asked himself, already yielded to a passion so irrational, so dishonourable?—No. He was not quite so mad—quite so base. Had he not always loved Julia? loved her when she[2] was a child—when there could be nothing questionable in the nature of his attachment?—Certainly he had, sincerely, fondly loved her. \n \n Julia, too, in the course of the day, felt a little uncomfortable; she thought that, notwithstanding the friendly conversation of the morning, Edmund, some how, did not seem satisfied. He was not cheerful, he was not frank and obliging as usual; he was not, in short, the least like himself! Could it be, that he fancied he had been but coolly received on his return? Frances and herself used always to make such rejoicing when he came home; but that was when they were children. And yesterday, there was such a hurry with company—yet, possibly, Edmund might have thought it proceeded from silly pride, because there were strangers by, or some such worthless feeling![3] She longed for an opportunity of speaking to him kindly on the subject, and doing away with such an idea, if indeed it existed. But he now rather seemed to avoid her, while Lady Susan always happened to be speaking to him just when she was intending to do so. \n \n At dinner, Lord Borrowdale handed in Julia; for Lord Morven appeared to think it necessary to resign in his favour. Not so Henry, who not only secured the place on the other side of our heroine, but contrived to engross much of her conversation. This was but poor consolation to Edmund; it argued indifference to Lord Borrowdale, certainly; but then Henry, though without title, was at least nearly her equal in birth, being her own cousin. And it was possible—barely possible, that she might be attached to him: he had been at home once or twice when it had not been in Edmund’s power to[4] return. His observations this morning might have been prompted by jealousy. \n \n After dinner preparations were made for a sail on the lake. Edmund observed Lord Borrowdale, from the moment they left the house, eagerly secure to himself the care of Julia. He, however, walked on the other side. But Lady Susan, passing them as they arrived at the place of embarkation, ran on the gang-board alone; then, stopping half way in alarm, and balancing herself with difficulty, yet refusing the aid of the bargemen, she called on Captain Montgomery for his assistance, declaring he was the only person who understood boats, and that she should not consider herself safe in any other hands. The gallant Captain could not disobey the summons, nor, having obeyed it, avoid continuing his especial protection to the lady; while Henry coming up[5] at the moment, drew Julia’s arm over his with all the freedom of cousinship. The boats, after crossing the lake, coasted along beneath the shade of trees, which hung from the steep rocks almost into the water, while the bare mountain tops, towering far above, were canopied by the heavens, and again reflected in the clear lake, where yet another sky appeared as far beneath. \n \n “This—this is the spot!” exclaimed Mr. Jackson, “to try the effect of the echoes.” They had arrived, as he spoke, opposite the opening to a little valley. A chain of stupendous mountains arose on either side, and one of a conical form, partly shrouded in a white mist which had rolled up from the lake, terminated the far perspective. \n \n The rowers lay on their oars, and the French-horns commenced an air. Immediately,[6] a gigantic voice from within the steep side of the nearest mountain took it up; the next joined in, and the next; but each less loud, till the receding echoes, in journeying round the lake, reached rugged Borrowdale: there they seemed broken off for some seconds; but soon a distant clamour arose, as proceeding from the thousand mountain tops of that desolate region: the sounds were flung further and nearer, then succeeded each other more rapidly, then became slower in their repeats. At length they came forth again, and continued travelling round the lake on the opposite side; but now, increasing in loudness as they once more approached the boats, and loudest when they reached the mountain which formed the second portal to the little valley already described, and in front of the opening to which the boats still lay. Then fainter, and fainter[7] notes proceeded up the vale, and, at length, at its furthest extremity, died away altogether. \n \n After a pause of perfect silence, to ascertain that no return of the echoes could be expected, Julia was eagerly called upon to sing. She asked Edmund to join her in the echo duet, and smiled as she spoke to him. Half his unhappiness vanished in a moment, and the song commenced. The tones of Edmund’s voice were full and firm. His singing, however, derived its principal charm from his manner, which had in it so much of truth and nature, that you could almost fancy him one addressing you with no object but to persuade by the purport of his words; while the mere inflexions of the voice, in sympathising with that purport, unconsciously formed themselves into varied and melodious harmonies. \n \n [8] \n \n As for Julia’s voice, it chanced to be one of those wonders, rare as the blow of the aloe! Cultivation had, of course, not been spared; but it was its native power and unexampled compass which were so remarkable. Its variety of capabilities too delighted, for in soft or playful passages, its tones had, as we have somewhere remarked, an almost infantine sweetness. On the present occasion, the scenery, the music, the effect of the echoes, all were inspirations; and the notes which escaped from her lips, gradually arose, till imagination could fancy them travelling on above the clouds, and the listeners felt an involuntary impulse to look upwards, as in pursuit of them. Then, as the air varied, the voice would suddenly fall full and plump on the truest and richest harmonies below, while the higher tones were repeated far above by now receding, now[9] approaching echoes. Soon did the whole wild region round about seem peopled by invisible beings; wandering voices called from every pointed crag of every mountain top; while the steep-sided rock, near which the boat still lay, appeared to contain some dark enchanter, who, all the time in hurried and mysterious accents, spoke from within. Even every little tufted island seemed to have its own, one, wild inhabitant; for each, from some projecting point or hidden bower, sent forth a voice, however faint in its tone or inarticulate in its utterance. Julia’s enthusiasm arose so high, that she not only exerted every power of her extraordinary voice, but, when she had concluded, forgetting how considerable a part she had borne in the general concert, she cried, “Beautiful! beautiful!” in absolute extacy at the echoes. \n \n “Beautiful! beautiful!” exclaimed Edmund[10] at the same moment, meaning, probably, Julia’s singing, but certainly not his own. \n \n “Beautiful! beautiful!” repeated the voice of thunder from within the adjacent perpendicular rock. \n \n “Beautiful! beautiful!” ran along the invisible orchestra above. Frances could keep her countenance no longer at the self-gratulations of the performers, visible and invisible; she laughed out, and a merry peal from all the echoes followed immediately. \n \n “This is too bad,” cried Mr. Jackson, starting, (to the great endangering of the boat,) from the attitude of delighted attention in which he had, since the commencement of the song, remained motionless, “this is too bad, to break up the delicious spell with such a farce as this!” \n \n The sun was now near setting: a homeward course was therefore proposed; and[11] the breeze being favourable, a sail was spread, which, not only greatly assisted the rowers, but added much to the picturesque appearance of the gay barge in which our party sat, as, quitting its coasting position, it dipped like a white winged sea-bird into the dark bosom of the lake, and crossed to the Keswick side. \n \n When they were about to land, Edmund paused a moment to consider whether he ought not to leave Julia to the care of Lord Borrowdale; but she happened at the moment, to point out a well remembered landing-place, beneath an overhanging bower of branches, reminding him how often he had rowed Frances and herself to the spot, and remarking further, a little path, sometimes discernible, among the trees in which they used to walk. Such are the important events which change the resolves of lovers! He gave up all thoughts of the[12] sacrifice he had meditated; hastened to assist her out of the boat; and, as she stepped on the beach, drew the hand he held over his arm, and walked on unconscious of an accident which followed immediately, and which we shall here describe. The hold of the boat-hook on the roots of a stump giving way, the boat was sent, for a few moments, a-drift; and not only was the bargeman, who stood with one foot on the edge of the boat and the other on a projecting piece of rock, precipitated into the water, but so also was Lord Borrowdale, who was, at the instant, in the very act of leaping ashore to join our heroine. This caused such immoderate laughing among the rest of the gentlemen, and so much pretty terror among the ladies, that Edmund and Julia were not missed till they became quite separated from the party. A most inviting path lay before them, which, after[13] ascending for a time, descended a steep and wooded slope, to an overarched opening through the trees, just where a single plank crossed a little stream, at a considerable height from the water. \n \n Arrived on this rustic bridge they stood, the beauty of the scene suspending the hand of Edmund, which he had laid on a little paling gate at its further extremity, with the purpose of opening it, as it formed the barrier between our wanderers and a fresh cut hay-field. \n \n The sun was so low in the horizon that the little mounds of grass which every hand was hastily throwing up for the night at the far end of the meadow, cast their lengthened shadows across half its extent, while the setting beam was still bronzing their tops, together with the faces, garments, and implements of the rustic groups employed around[14] them. At the same moment a full moon, just rising to view on the opposite verge of the heavens, was glittering through the branches of some dark firs that terminated the prospect in that direction. \n \n Julia, who had several appropriate speeches ready, had been all day only waiting for an opportunity to say them; for she had reasoned herself into a belief that it would be dreadful to let Edmund think himself neglected for newer or gayer objects; but, some how, all this preparation had made a thing so simple in itself, as joking Edmund for being affronted, seem quite awful; and in consequence, her heart was beating so fast, that she was waiting for it to stop before she could begin to speak. \n \n “Edmund,” she at length contrived to say, turning and offering her hand; but the foolish fluttering of her heart redoubled, and she[15] stopped short. Edmund started, caught the offered hand, and, puzzled and delighted, pressed it to his lips. She laughed, blushed, and drew her hand away, saying— \n \n “I see, Edmund, you are silly enough to be quite jealous.” \n \n This was rather an unfortunate choice of expression; for Edmund, colouring to excess, began to stammer out—“I—me—oh—a, I have a—I—” \n \n “I dare say you think,” continued Julia, who had no suspicion of the kind of jealousy, which on mention of the word, had presented itself to Edmund’s fancy—“I dare say you think we did not appear as glad to see you as usual, when you arrived so by surprise yesterday; but you came in in so hurried a manner—and—among so many strangers—that—that—” \n \n [16] \n \n “Indeed, Julia, I—you—” again stammered Edmund. \n \n “I am sure none of us intended to be unkind,” continued Julia, “—or less glad, I mean, of your safe return.” \n \n “You are too good to be unkind to any one, Julia,” said Edmund, with a sigh. Julia still fancying his manner seemed strangely dissatisfied, began to feel offended in her turn, and a rather awkward pause followed. At length, she compelled herself to make another effort, and said, with a reasoning tone— \n \n “You cannot suppose, Edmund, that any of your friends at Lodore regard you less, merely from your having been a few years from home! Indeed, if you could know how highly, both grandmamma and Mr. Jackson always speak of you, you would not think so!” He made no[17] reply; for it was neither grandmamma nor Mr. Jackson that he was thinking of. \n \n “I believe,” she added, trying to laugh, “it really was all I had heard about ‘Captain Montgomery, the gallant Captain Montgomery!’ which made me find it so difficult to imagine Edmund, who used to play with Frances and myself here in these woods, and the said terrible Captain fighting the French and destroying the Turks on the high seas, one and the same person!” \n \n “Ungentle employment, it must be confessed!” he replied, with a faint smile. \n \n “Oh—I don’t mean that,” said Julia, “I—But really, Edmund, I think,” she added, gravely, “I have made you apologies enough to restore any reasonable being to good humour.” \n \n “You make me apologies!” he commenced:[18] but Julia, as she turned from him, with something of indignation at his supposed obstinacy, forgetting the narrow plank on which she stood, slipped her foot, and would certainly have fallen into the water had he not caught her in his arms, and lifted her to sure footing. Julia, partly from alarm, and partly from the previous exertion of her spirits in saying so much, was a good deal overcome, and even shed tears. The sight of these threw Edmund off his guard. “Would to heaven, Julia!” he exclaimed, “that I were indeed your brother! entitled to the happy privilege of guarding one more precious than life from every danger! of sheltering one dearer than happiness itself—from every sorrow!” \n \n Thunderstruck at his own rashness, he ceased. A smile through her tears was Julia’s reply; for, as she was not expecting, or thinking[19] of a love speech, she understood from what had been said, only that friendship and good humour were restored, and Edmund become more like himself. A long silence, however, followed: when Julia at last said, in rather a hesitating manner, and at the same time with an effort at playfulness, “Frances and I have always called you brother, you know, can you not fancy yourself such, and take as good care of us as if you were really our brother?” \n \n This was a trying appeal; and the beating of Edmund’s heart, (closer to which he imperceptibly drew Julia’s arm as she spoke) shewed him that he must not trust himself with the use of language. Another silence, therefore, followed, and they walked slowly on. In a little time, Edmund, as if thinking aloud, gave, perhaps, unconscious utterance to what seemed to be the result of his meditations, saying:[20] “No, no!—it cannot be required of me, to root out the permitted affections of childhood from my heart!—It were too impossible!—too unnatural!” \n \n “And who wishes you to do so?” asked his companion, with a quickness that shewed how little she understood his feelings. \n \n At this moment, the rest of the party came in sight at some distance; and Edmund, as if fearful of interruption, turned suddenly round, and, in hurried and agitated accents, said, “Julia! you permit me to feel for you the affection of a brother! you permit me, you say, to evince that feeling by care of your welfare, your safety, your happiness. Should I ever be so unfortunate as to extend to what may seem presumption on your goodness, the dear, the sacred privilege—check—but do not, do not utterly condemn me!” \n \n [21] \n \n He paused a moment for breath, then, with effort, recommenced thus: “Your family is the home of all my affections! Could it be—should it be otherwise? Yet, in cherishing those affections, so natural, in my circumstances, so inextinguishable, there may occur moments when I may be tempted to forget that I myself stand alone, must ever stand alone, an unconnected, a nameless stranger!” \n \n Here the joining of the party as they came up, laughing and recounting Lord Borrowdale’s adventure, put an end to this dangerous conference. Its results, however, coloured the future destinies of both the young people. If Edmund had previously formed safer resolves, they were now lost in the belief that Julia was in no danger of discovering in him, or sharing herself any sentiments, exceeding the bounds of that friendship which it was, (under the circumstance,)[22] but right and natural should subsist between them; while any deficiency (he argued with himself) in the manifestation of brotherly regard on his part, would require the very explanation it was his duty not to make. He must, therefore, shew her every silent, unpretending, affectionate attention; every mark of brotherly regard; while his own imprudent passion must lie for ever buried in his own bosom! \n \n He must indeed correct its mad and wild intensity! The habit of being in her society, would, he hoped, assist him to do so! would moderate the extraordinary effect that society now had upon him! would enable him to sober down his feelings into those of a truly affectionate brother, really solicitous for the welfare of a sister he sincerely loves. \n \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/795/59007.html","bookId":145,"book":{"id":145,"title":"First Love","description":"简介： 小说中21岁的季娜伊达是一个美丽美女，出生没落贵族，行动专横并动人。她的四周从来不缺一群崇拜者，她同这些人时常聚会并捉弄他们，但内心中深感厌恶，并渴望一个能够在精神上给于慰藉和依赖的男人。16岁的沃洛佳，故事中的我，对季娜伊达始终带有着纯真、热情的感情，...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/795","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
