{"id":4269,"no":32,"title":"CHAPTER X.","content":"“And are ye gone indeed, ye happy hours, \\n\\n When our course in the chace was one; when we \\n\\n Changed the words of love beneath thy shadiest \\n\\n Woods, Oh Cromla?” \\n\\n \\n\\n Julia entered her room, arm and arm with Frances, pondering in what words she should ask a certain question, which she meant to put to her sister, as soon as Alice should retire; for Henry’s remarks had aroused again some of the painful suspicions, which Edmund’s soothing attentions had so lately laid asleep. \\n\\n \\n\\n Frances made many droll critiques in French[146] on Lady Morven, Mr. Graham, \u0026c. \u0026c. Forced, unmeaning smiles were Julia’s only replies. \\n\\n \\n\\n At length, both the sisters’ heads were laid on their downy pillows, and Alice had left the room. Still Julia had not determined in what precise words to put her important question; besides, though the candles had been extinguished, there happened to be an impertinent bit of trundling coal among the embers of the fire, which sent from its side a bright flickering blaze, and caused a most obtrusive light to enter the bed, by means of a small, neglected opening between the foot curtains; and, until it should be quite dark, Julia did not wish to speak. \\n\\n \\n\\n Frances put her arms about her sister’s neck, kissed her, and bade her good night. Julia returned the good night with equal kindness,[147] as was their custom. She was again silent. At last the blaze went out, and the room became nearly dark. \\n\\n \\n\\n “What—was that—you were saying—to me—when we were dressing for dinner, Frances—about—about Edmund, you know?” \\n\\n \\n\\n “What!—What?”—said Frances, with a start, for she had just dropped asleep. \\n\\n \\n\\n “What—was it you were saying—I say—before dinner, you know?” \\n\\n \\n\\n “Saying! About what?” \\n\\n \\n\\n “About—about Edmund, you know.” \\n\\n \\n\\n “What about Edmund?” \\n\\n \\n\\n “Oh, you know, about him and Lady Susan, you know.” \\n\\n \\n\\n “Oh, about their going to be married!” said Frances, rousing herself to enter fully, as it were, into the amusing subject; then, with animation, and a voice of confidence, she continued,[148] “I really think it will take place; and he is certainly very fortunate; for she has a cheerful, happy temper, and her affection for him is truly generous and disinterested!” The darkness covered Julia’s changing colour, and her starting tears, also, which she now gulped down, as she replied, “Her affection indeed! What can her affection be, in comparison of those who have loved him always!” \\n\\n \\n\\n “Do you mean any one in particular?” asked Frances. \\n\\n \\n\\n “No—” replied Julia, “that is—yes. I mean, you and I, you know.” “Certainly,” said Frances, “we have loved him always; but then, you know, we are not going to marry him.” \\n\\n \\n\\n “No, I suppose papa would not think it right, if we were,” said Julia. \\n\\n \\n\\n “You may be sure of that!” replied Frances.[149] “It is very plain, from his letters, and from what grandmamma and Mr. Jackson said the other day, about Henry’s nonsense, what sort of people papa intends us to marry.” \\n\\n \\n\\n “I shall never marry any one while I live!” said Julia, with great earnestness. \\n\\n \\n\\n “You can’t tell, you know, Julia,” replied Frances; “you may happen to fall in love; and if you do, it will be desperately! for you know how enthusiastic you always are, about any one you care for!” \\n\\n \\n\\n “Fall in love with a stranger, indeed!” exclaimed Julia. Then, after a momentary pause, she added, “do you think yourself, Frances, that Lady Susan can possibly love him as well as—as we do?” \\n\\n \\n\\n “Why, I dare say,” replied Frances, “if any thing should prevent their being married, that Lady Susan would forget him by and bye,[150] whereas you and I shall always have the same regard for Edmund, that we have had for him all our lives. But, on the other hand, there is Lady Susan going to waive all about his unknown birth, that some people, you know, are so ill natured about. She says, his own nobility is more to her, than any he could derive from all the ancestors that ever were in the world.” \\n\\n \\n\\n “Did she say so to you, Frances?” asked Julia. \\n\\n \\n\\n “Yes,” replied her sister, “and she is going, she says, to give him, most cheerfully, her hand, her heart, and her fifty thousand pounds, in preference to many of the first young noblemen in the kingdom, among whom she might choose; and you and I are not going to do all that for him, you know!” \\n\\n \\n\\n Julia sighed heavily, and made no immediate[151] reply.—In a little time she said, “Do you think, Frances, you could do so much for Edmund?” \\n\\n \\n\\n “Why, I don’t know,” replied Frances; “though I certainly love Edmund next to you and grandmamma, yet I have no particular wish to be married to him; for I can love him just as well, you know, when he is married to Lady Susan. But you, Julia, who were always so enthusiastic, would you like now to sacrifice so much for him?” \\n\\n \\n\\n “I could do any thing for those I love!” said Julia, in a scarcely audible whisper, and blushing, though none could see her. \\n\\n \\n\\n “Oh, that is, you mean, if it were absolutely necessary to their happiness!” rejoined her sister. “I should not like, either, to make poor Edmund unhappy! But then, you know, it is not necessary to his happiness; for he wishes himself to be married to Lady Susan.” \\n\\n \\n\\n [152] \\n\\n \\n\\n “But are you sure of that, Frances?” asked Julia, as recollections crowded in upon her mind, “are you sure of that? for I am certain it is impossible for him to love Lady Susan, or any one, as much as—as he loves—that is, seems to love—those he has always loved.” \\n\\n \\n\\n “I know,” said Frances, “that there cannot be a more amiable or affectionate disposition in the world than Edmund’s; yet, still he never showed me any such excessive sort of love, that he could not love another person as well, or better, I suppose, if he were going to be married to them! But, to be sure, you were always his favourite. I remember when we were children I used to be vexed at it sometimes, but since we have been grown up, I don’t mind people loving you best, because I know you deserve it.” \\n\\n \\n\\n [153] \\n\\n \\n\\n Julia wept on her sister’s breast, and persuaded herself that her tears were those of gratitude and tenderness, caused by Frances’ kind expressions. In a little time she said, “But how are you sure, Frances, that Edmund wishes to be married to Lady Susan?” \\n\\n \\n\\n “Because he asked her to marry him, when they were in the cottage this morning! She told me so herself, just before I came up to dress for dinner, you know.” Julia asked no more questions; nor did she utter another word that night. Frances went on explaining about Lord and Lady Arandale knowing nothing of the matter, as yet, and what Lady Susan meant to do to obtain their consent, \u0026c.; but having the conversation all to herself, she soon began to articulate slowly and with frequent unnecessary pauses, and, finally, fell asleep: upon which, Julia began to draw her hitherto[154] suppressed sighs audibly. She wept for a time with bitterness. She thought for hours. When she recollected looks or words of tenderness she wept afresh; but, when she called to mind such circumstances as Edmund’s having, at any time, taken her hand in his, or pressed it to his lips, she blushed till her cheeks seemed to burn, and wondered how she could ever have permitted any thing so very wrong: she had always called him brother Edmund, certainly; but she ought to have remembered that he was not really her brother. She then asked herself the following startling questions:—If her feelings for Edmund and her conduct towards him had hitherto been guided by the friendship of a sister, why should they not be still the same? what change had taken place in their relative situations? This candid mode of treating the subject puzzled her not a little. At length she[155] tried to persuade herself that friendship, or even sisterly regard for one who loved their friend or sister better than any one else in the world, was a very different thing from friendship for one who felt a stronger affection for some other object. “And does Edmund, then, really love Lady Susan better than he loves me?” Her tears now flowed again, and, wearied out, she fell asleep, without having come to any conclusion but that she was wretched, and that all the recollections which, hitherto, had given her pleasure, now gave her pain. \\n\\n \\n\\n As soon as reason had abdicated her seat, fancy ascended the throne. Confusion succeeded, and the busy turmoil of weary imaginings, and painful contrarieties, robbed sleep of her healing balm. Wanderings alone on starless nights—Dreary wildernesses in the blaze of noon, without one living object to be seen—Crowded[156] ball-rooms—Edmund leading Lady Susan past to join the dance, with a countenance so changed, so cold; and all interspersed with short glimpses of Lodore and happy childhood: till, at length, by the time she ought to have been awaking in the morning, her dream (not from “foregone conclusions,” but from outward causes,) took the following form. She thought she saw Edmund and Lady Susan coming towards her in one of the shrubbery walks at Arandale. She tried to avoid them, but could scarcely move an inch at a time. They overtook her. Edmund, she thought, to her utter astonishment, put one arm round her, and drew her towards him; while the other, she now perceived, was around Lady Susan. Amazed at this audacious freedom, and especially indignant at such partnership in love, she struggled to free herself, and, with almost a bound,[157] awoke. Arms really were around her, laughing eyes were close to her’s, and a soft voice named her. But it was that of Frances, who had, all this time, been trying every means, but hitherto in vain, to awake her sister; so heavy was the late sleep induced by the anxious thoughts of the night, and the busy dreams of the morning. Indeed it was not quite two hours since Julia had first closed her eyes. \\n\\n \\n\\n “Bless me,” cried Alice, as she entered the room, “can that be the bagpipes for breakfast, and it has only just gone ten! Well, I thought my Lady Arandale would have taken a sleep this morning, after being up a matter of half the night.” \\n\\n \\n\\n “Were we so much later than usual then?” asked Frances. \\n\\n \\n\\n “Much as common, my Lady,” replied Alice; “but when the men went in to take the supper[158] things away, my Lady and my Lord, both, were so busy with Mr. Edmund, Captain Montgomery, I should say, that they were sent away again, and not rung for, for two hours. I wish all may be true that was said in the hall,” she recommenced, after having assisted her young ladies to dress for some time in silence; “for Mr. Edmund is one that every body loves; and I, for one, should rejoice in his good luck—and think it nothing so strange, neither; though the old butler put himself in such a passion, and said that Lady Susan was a wife for the first duke in the land—and—” \\n\\n \\n\\n “I have told you before, Alice,” said Julia, making an effort to conceal her real feelings under the mask of pettishness, “that you are not to repeat the conversations of the hall-table in our room.” \\n\\n \\n\\n “I beg pardon, my Lady, but I only meant[159] to say as how my Lady Arandale came to be late. But I am sure I repeated nothing: neither what my Lady Susan’s maid said, nor what my Lady Arandale’s maid said, nor what my Lord’s man said, about the time they were at Lodore, nor all I said myself about the power of money that Mr. Edmund had won from the French, and about what a nice, handsome young gentleman he was;—but for just a kind wish for one that every one loves, I didn’t think it would have given offence.” \\n\\n \\n\\n “You can never give offence by wishing well to any one, Alice,” said Frances, “but it was not necessary to repeat what other servants said: that was all. I suppose,” she added, in an under tone to her sister, as they went down stairs together, “he was asking papa and[160] mamma’s consent, last night. And after his fine resolutions, too!” she added, laughing, “never to think of marriage till he had discovered all about his birth, name, and so forth.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/795/59016.html","bookId":145,"book":{"id":145,"title":"First Love","description":"简介： 小说中21岁的季娜伊达是一个美丽美女，出生没落贵族，行动专横并动人。她的四周从来不缺一群崇拜者，她同这些人时常聚会并捉弄他们，但内心中深感厌恶，并渴望一个能够在精神上给于慰藉和依赖的男人。16岁的沃洛佳，故事中的我，对季娜伊达始终带有着纯真、热情的感情，...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/795","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
