{"id":4287,"no":50,"title":"CHAPTER XXVIII.","content":"“To the lake with this; and, here, take some of these: \n And mingle some that grow upon the brink, \n And mar the sod. I’ll bear the body hence.” \n … “He is cold—Oh, he is dead!” \n \n For once the bagpipes were not played under the windows of Arandale Castle at ten; indeed it was nearer twelve when the well known sounds were heard. \n \n Yet late as was the hour, Edmund did not appear at the breakfast table. \n \n His adventure of the night before with the ruffian who had obtained admittance in the disguise of a juggler, having been mentioned by Lord Arandale to Lady Arandale; by her Ladyship to Mrs. Morven; by Mrs. Morven[355] to the General; by the people on the grounds, who had witnessed a part of the business, to all the servants; and by the servants to their respective masters and mistresses, it was now universally talked of. By those we mean, who could talk; some there were, who could not trust their lips with the utterance of a single syllable. Who could thus desire the amiable Edmund’s destruction, baffled all conjecture. \n \n There was but one rational supposition, the Earl said. The villain must have been employed by some one acquainted with those concealed facts, which had hitherto surrounded their young friend’s fate with mystery; some one whose interest would materially suffer by the development of that mystery; while at the same time there was most probably some event about to take place, which threatened to produce that development. \n \n “Then, Edmund must be still in danger!” exclaimed Frances, starting upright from her[356] seat, and clasping her hands. Julia sat trembling, and as pale as death; but neither moved nor spoke. The butler entered with rolls. He was asked if he could be certain that no one had been admitted without a ticket. He was quite certain! He had, himself, taken the ticket of each person who passed the first hall. Even the little pedlar had presented a card, which, happening to be of similar dimensions to the tickets, he, the butler, unfortunately, had not examined at the time; and which, when examined afterwards, proved to be one belonging to the man’s shop in Bath. This was the only ticket which was not correct, of the full number issued. It was strange! Tickets had not been given to any friends to give to friends of theirs; with the exception of a very few to Edmund himself, and to Henry, for naval officers of their acquaintance. \n \n When the subject had been thus discussed, in all its bearings, the Earl, who still looked[357] serious, and even melancholy, said, “I am not sorry that Captain Montgomery has taken Arthur with him; it would have been a sad scene for the poor little fellow! Our friend, Sir Archibald Oswald,” he added, after a solemn pause, and looking round the company, “is no more! The state of his mind will, I trust, acquit him in the eyes of heaven, as it undoubtedly must in the judgment of men; but, there is reason to fear that our unhappy friend has been accessary to his own death. His body was yesterday found in the lake by the work people who were preparing for the illuminations. Duncan very properly suppressed the circumstance, till he had communicated it privately to me; and I judged it best to permit the entertainment offered to our friends to proceed, without checking the pleasure of the company by the introduction of so melancholy a subject.” \n \n Miss Morven thought that Mr. St. Aubin[358] was certainly a very amiable young man: he showed so much feeling. He actually turned quite pale, when her uncle mentioned, Sir Archibald’s body being found in the lake. \n \n Many of course were the exclamations of pity and surprise. “It will be quite a change of scene,” continued the Earl, “I must send for the proper persons; and, if their verdict is, as I have no doubt it will be, insanity, I must give my poor friend a suitable funeral.” \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/795/59034.html","bookId":145,"book":{"id":145,"title":"First Love","description":"简介： 小说中21岁的季娜伊达是一个美丽美女，出生没落贵族，行动专横并动人。她的四周从来不缺一群崇拜者，她同这些人时常聚会并捉弄他们，但内心中深感厌恶，并渴望一个能够在精神上给于慰藉和依赖的男人。16岁的沃洛佳，故事中的我，对季娜伊达始终带有着纯真、热情的感情，...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/795","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
