{"id":81650,"no":14,"title":"Page 14","content":"My eyes follow them while my brain swims with thoughts of licking each of them up with my tongue, especially the ones that slide into his belly button, the ones that curl around his nipples. While I watch and mentally lick every beautiful inch of him, he watches me work on him, his gaze hot and tender and, somehow, grateful.\\n\\n “I love the way you work out,” I whisper.\\n\\n “I love the way you work me.”\\n\\n BY THE TIME we ride up in our hotel elevator, we’re both tired—and I’m especially so. I just haven’t recovered from the fucking Gift and I’m tired enough to skip dinner and head straight to bed.\\n\\n After eight hours of working out, Remy has punched most of his speedy energy off for now. He leans back against the elevator wall with an arm loosely draped around my hips, while I half stand, half sag against his side, resting part of my head against the side of his throat.\\n\\n “Cold shower, eat a cow, see you tomorrow,” Coach says as he exits on his floor.\\n\\n “I’m on it,” Remington answers in his low and powerful voice.\\n\\n “Good night, Coach,” I say.\\n\\n And as soon as we’re alone in the elevator, Remington ducks his head to scent me.\\n\\n The press of his frame against my back is all hard, hot muscle. He exhales warmly against my skin, then licks the back of my ear, and an electrical jolt surges through me. He then nuzzles his way across the back of my head, to the back of my other ear, and he scents me there too. My nipples bead painfully against my top, and at the first lick of his tongue across the back of my ear, need rips through me. He holds me snug against his big body, and whispers into my ear in a thick, appreciative tone, “I watched you stretching. Were you doing it for your muscles’ sake or for mine?”\\n\\n As his words run through me like a sexual caress, he slides one open hand down the front of my body, and I shudder as he cups me over my Lycra pants. “Brooke? Was it for your sake or mine?” He licks and sucks a bare spot of skin on the back of my neck, igniting a painful thrumming inside me.\\n\\n “Yours,” I moan.\\n\\n He chuckles softly as he slides that hand upward. “Did you enjoy watching me work out?” His husky question presses every sexy button inside me as he fills his palm with one breast over my tank top.\\n\\n “Me and the rest of the gym,” I say breathlessly.\\n\\n Here comes his chuckle again. Sexy. Deep.\\n\\n His fingers coast up and down my bare arm, wreaking all sorts of havoc in me. Lava percolates inside me when he adds teeth to my earlobe and gently tugs. Suddenly, I can’t bear it; I turn in his arms and, god, he smells so good I feel light-headed.\\n\\n He’s in a clean T-shirt, his body emanating heat like a roiling volcano, and I fist my hands in the soft material to brace myself as I kiss his neck, licking him hungrily and desperately. His taste sends dull pangs of want to places I didn’t even know I had.\\n\\n He growls softly in satisfaction and lowers his head to buzz my mouth with his. Then he cups my ass in his big hand and squeezes me as the elevator climbs the rest of the way. I rub my hands up his chest, over his T-shirt, and keep recklessly tasting him.\\n\\n “Remy,” I moan. I press my nipples into his chest and undulate coaxingly, and he chuckles softly in my ear as he clutches my ass harder in his hands.\\n\\n “Do you want me?” he prods, his breath hot and cajoling against my lips as he presses his mouth to mine.\\n\\n “Yes . . .”\\n\\n He slides his hand between my ass cheeks and, from behind, suddenly strokes his thumb over my clit through my Lycra pants. My knees nearly fail.\\n\\n “Are you wet?” he entices.\\n\\n “Remy . . .” I can only say, my sex aching painfully between my legs.\\n\\n “Are you wet in your pussy?” he asks in my ear, sinuously dipping his tongue into the crevice.\\n\\n “Yes. God, yes.”\\n\\n “Let me see.” He flips me around so that we’re both facing the doors, then eases his fingers into both my pants and panties and caresses me for a brief second, verifying my wetness, slipping his finger into my swollen entry, making me gasp, rock my hips, and moan, until he says, in a husky and satisfied whisper, “Hmmm.”\\n\\n Ping.\\n\\n Hmmm . . .\\n\\n It’s a sound between us, and when he says it, it means he wants to eat me.\\n\\n All of me.\\n\\n About a million cells in my body quiver with need, and my heart rate kicks up as the doors roll open. He swoops me up on his shoulder and grabs my butt on our way to our suite, and I laugh in surprise at the caveman move and kick in the air.\\n\\n “Diane’s going to be in our room already!” I squeak, but he squeezes my butt like it doesn’t matter and carries me inside, dipping his thumb, once again from behind, between my legs, so it’s swiping over my clit.\\n\\n My pussy swells with need, and I fall utterly still, letting him rub me.\\n\\n My eyes roll to the back of my head as he rubs and rubs, his shoulders hard and strong under my stomach as he carries me.\\n\\n “Hey guys,” Diane says as he carries me into the suite, and before I can answer, he heads directly to the master bedroom, saying over his shoulder, “We’re not hungry yet—we’ll be out in an hour.”\\n\\n And he slams the door shut behind us.\\n\\n SIX\\n\\n FLYING TO BOSTON\\n\\n On our way to Boston, I have the opportunity to get better acquainted with the jet’s toilet. Half the flight I spend puking in it.\\n\\n When I come out after my first round, Remington’s scowl greets me, while Diane ushers me to her seat up at the front where she has a plate of melon, papaya, nuts, and cottage cheese waiting. I love papaya. It’s got fiber and loads of vitamin A, and is great for the digestive system. There’s a lemon wedge on the side, which I usually love squeezing onto the papaya too. My body has a different idea, though, and the scent of papaya . . .\\n\\n About to barf in my mouth, I shove the plate aside and run to the bathroom, lift the toilet lid, and heave again. Diane immediately appears at the door, and I hear her speak to someone just outside. Of course I have a general idea of who that someone is.\\n\\n “Don’t let him come in here,” I plead to her between heaves.\\n\\n Remy has been speedy for over two weeks now.\\n\\n He called himself the “king of the world” a couple of days ago, followed by “king of the jungle” and then “king of the punching bags” and then, that evening, he asked me to be his queen, and I laughed. But at the same time, he looked so charming and adorable with his dimples that it almost felt like he was proposing.\\n\\n He’s so energetic. He’s been wearing us all down, but at least Pete—circles under his eyes and all—is happy that he hasn’t switched to depression. Manic Remington fights like a gladiator, and lately, he seems in a very good mood as long as he gets to kick the shit out of people and have a lot of sex—which I am more than happy to provide, since I’ve been about as hot and lusty for him as I always am or—strangely—maybe a little more.\\n\\n As I flush the toilet and try to breathe again, Diane shoots me a smile that tells me she thinks Remy is adorable for worrying, but her smile vanishes when she takes a good look at my complexion.\\n\\n I really feel like shit, so I must look like shit. Funny that no matter how old I get, when I feel this sick, I’m flashed back to my soup days and I miss my mom. She would never let us eat in bed, except when we were sick, and then we got a tray with warm soup.\\n\\n “Could it be a stomach bug?” Diane feels my forehead. “No fever. Would you like some mineral water? Or Alka-Seltzer?” she asks.\\n\\n “Maybe some sparkling water,” I admit, flushing in embarrassment when I think that the entire team will now know about me and my regurgitating. “Do you have any gum?”\\n\\n She nods and watches me as I quickly try to rearrange my ponytail. “You should stay in this afternoon,” she suggests.\\n\\n “Miss his training? Never!” I gasp.\\n\\n “You look so pale, Brooke.”\\n\\n I pinch both my cheeks and add a bright smile. “There.”\\n\\n Chiding me with a shake of her head, she leaves and then returns with a packet of gum, and a small hotel travel bag containing a plastic toothbrush and tube of Colgate. “I collect these from everywhere we go. Shampoos too,” she tells me proudly.\\n\\n “Oh, you’re a lifesaver, Diane.”\\n\\n As I brush my teeth at the small faucet, I start to seriously wonder what’s wrong with me, and when I come out, he’s on the edge of his seat, elbows on his knees, his black eyes fixed on the plane restroom door.\\n\\n Added to his, three other pairs of worried stares follow me as I make a straight line for my seat. I feel so weak and dehydrated, I fall into the cushions and sit right on top of my travel bag. Remington pulls it out from under me and sends it flying to the end of the bench, then he firmly cups the back of my head and tips my head up to his. “What’s wrong with you?”\\n\\n “I don’t know. I haven’t been myself since the stings.”\\n\\n I sense, more than see, Diane’s presence nearby, and she seems to be studying us, though that’s neither here nor there; I just want to be coddled. I want to crawl into Remington’s lap and stay there, with my arms around his neck, and my nose in his throat, sniffing the hell out of him, but I’m too tired to move from my seat, so I just tuck my face into one of his hands and close my eyes for a moment and smell his soap.\\n\\n “Brooke, are you certain it began with the stings?”\\n\\n Both he and I turn to Diane at the same time, and she wears this devious smile I have never seen before. Her merry brown eyes fix on Remington, rather than me, and when she speaks again, her voice trembles with something that sounds like excitement. “Have you asked Brooke whether you’re going to be a dad?”\\n\\n Excuse me? I think I just choked on, and then swallowed, a bowling ball. By the time I feel a certain pair of familiar black eyes staring at me, my lungs feel like they’re expanded to the limit.\\n\\n He waits until I slide my gaze over to his, his voice hardly audible through the plane’s engines. “Am I?”\\n\\n Holy shit . . . am I?\\n\\n Pregnant?\\n\\n The mere word makes the bowling ball in my stomach double in weight. Is he worried that I am? I stare into his face and . . . nothing. Pure handsomeness, and that’s all. I can’t read him with those dark eyes.\\n\\n “No,” I stress. All my inner walls shoot up in defense mode as the utter fear of what something like this would do to us takes hold. “I have birth control. I’ve had it for years. It’s been making my period fade so I don’t really know when it’s my time anymore. . . .” I pause when Diane wiggles her eyebrows at me. “I’m not,” I assure her grinning face, glowering now.\\n\\n She brings over a bottle of sparkling water, and Remington takes it from her outstretched hand.\\n\\n “I can’t be. I couldn’t be,” I say, addressing only him now.\\n\\n “I want someone to look at you.” He opens the bottle for me, then passes it over as he turns his head to the front of the plane. “Pete, I want someone to look at Brooke right fucking now!”\\n\\n “Right on, sir,” Pete answers. “I’ll make some calls as soon as we land.”\\n\\n “Make it a female, with a perfect record and experience, not some newbie!” he adds. \\n\\n","sourceLink":"https://allnovel.net/mine-real-2/page-14.html","bookId":2737,"book":{"id":2737,"title":"Mine (Real #2)","description":"Storyline: Mine (Real #2) \\n He\u0027s mine, and I\u0027m his. Our love is all-consuming, powerful, \\n imperfect, and real... \\n In the international bestseller REAL, the unstoppable bad boy of the Underground fighting circuit finally met his match. Hired to keep him in prime condition, Brooke Dumas unleashed a primal desire in Remington \"Riptide\" Tate as vital as the air he breathes... and now he can\u0027t live without her. \\n Brooke never imagined she would end up with the man who is every woman\u0027s dream, but not all dreams end happily ever after, and just when they need each other the most, she is torn away from his side. Now with distance and darkness between them, the only thing left is to fight for the love of the man she calls MINE.\\n","cover":"https://allnovel.net/images/mine-real-2.jpg","author":"Katy Evans","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mine-real-2.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:35:07 PM"}}
