{"id":110666,"no":39,"title":"Page 39","content":"\n “Gah!” I scream, hardly conscious that I\u0027m unlocking the safety switch.\n He yanks me toward him, has my leg pul ed up to his face, his mouth opening, fangs bared.\n I pul the trigger and the light beam hits me right in the foot.\n It\u0027s enough, though, for him to drop me. He cowers back momentarily, then fl ings himself at me.\n This time, I hit him square between the eyes. He fal s back as if sledgehammered in the face.\n Behind him, the others are sprinting toward me.\n Phys Ed, screaming in pain, leaps back on his feet.\n Creamy pus gushes out of his forehead. The FLUN needs to be turned up to its highest setting. But there\u0027s no time to fi dget with the settings now: the moment I do, they\u0027l be on me.\n Crimson Lips, screaming like a hyena, fl ies at me.\n I fi re off the last round, hitting her in the chest. She fal s back, clutching her chest, yelping in pain. But then she\u0027s back on her feet, her face twisted awful y in pain and lust.\n “Who wants more?!” I yel . “Who wants more?!”\n They stop in their tracks, their fangs connecting to the ground by a waterfal of drool. Uncertainty in their eyes, mixed with keen lust. Their heads fl ick sharply back and forth, their teeth snapping and grinding.\n “Who wants more?!” It\u0027s all empty bravado. I\u0027ve fi red off the third and last round already. all that is left is to bluff.\n “You?” I yel , pointing the FLUN at Gaunt Man inching toward me. “How ‘bout you?!” I shout as I swing the gun around to the other side at Fril y Dress. I\u0027m stepping backward, toward the front doors.\n For every foot I retreat, they advance a yard. Their chortling grows louder, more slippery, individual desire beginning to trump their col ective fear. Phys Ed in the front crouches low, readying to pounce. They\u0027re not going to let me retreat much farther.\n “You\u0027re the animals! You\u0027re the hepers!” I yel as I spin around, throwing the discharged FLUN at them.\n They scream as one, members of an insane choir.\n In the end, what saves me is the very thing that threatens to kil me: their insatiable lust for my blood. As Phys Ed in the front leaps up for me, he is pul ed down by the ones behind.\n They surge forward, tripping over him. It gives me a two- second head start, and that is all I need.\n I sprint toward the exit doors, and fi ve yards out— even as I feel their hands grasping my back, their nails brushing the back of my neck— I leap for the handlebars on the door. The feel of the cool metal in my hand is something I will never forget.\n My momentum pushes the handlebar down, the door fl ies open, and a blinding whiteness fi l s my vision. The sting in my eyes is a beautiful pain.\n Their screams, once charged with desire, are now suffused with pain and agony. I hear them beat a hasty retreat.\n But I\u0027m not done with them. Not by half. I reopen the door— I see a mad skittering away from the light like rats scampering— and prop it open with the attaché case.\n Enough light fl oods into the library, even to the far wings, to make the remainder of the day sleepless and painful for the hunters inside.\n “Sweet dreams, you animals!” I shout as I begin to walk away.\n But then I hear a voice, hoarse and brittle with rage, echoing down the foyer like rancid spit racing up a throat.\n Gaunt Man.\n “You think you\u0027re getting away?!” he yel s from the darkness inside.\n “You think you\u0027ve got us beat, you stupid heper? You think you\u0027re so smart? Hey, you sweaty, smel y, singing heper!\n We\u0027re only getting started! You better run! You hear me?\n Because come dusk, the Hunt starts. And we\u0027l be pouring out of here to hunt you down, to rip into you, to shred you to pieces. You hear me? You came here for a Hunt?! Wel , a Hunt is what you\u0027re going to get! You get me?\n You\u0027re going to get a Hunt! ”\n Everyone is still slumbering in the main building. My footsteps echo down the dark, empty hal ways. I pass by the banquet hal . It\u0027s like a bat cave inside. Scores of people hang asleep off the main chandelier, their dark, dangling silhouettes like a putrid clump of clogged hair. Off to the side, hanging off some air ducts, is a group of 228 to the side, hanging off some air ducts, is a group of 228 ANDREW FUKUDA reporters, their cameras still slung over their necks, almost touching the fl oor.\n Ashley June doesn\u0027t answer when I knock. I push her door open. Her room is empty.\n She\u0027s upstairs in the Control Center, as she said she\u0027d be, in front of the monitors, her head swiveling around.\n “Hey,” I say as I walk in, gently, not wanting to startle her.\n Sunshine pours inside in slanted beams, fl ooding the center with brightness. I walk to her.\n “Hey back. You\u0027re supposed to be sleeping.” She turns around.\n “I think I found the ideal place to hide—”\n “Ashley June.”\n “What\u0027s the matter?” She sees the look on my face.\n I shake my head.\n “Gene, what is it?!”\n “I\u0027m sorry.”\n She peers deeply into my eyes, studying me. “Tel me what\u0027s going on, Gene.”\n “Something really terrible.”\n She sits up, places a hand on my arm. “What happened?”\n “It\u0027s over for me.”\n “What do you mean?”\n I explain to her. The hunters in the library, the sunbeam, their discovery of what I am. Alarm ripples across her face.\n “It\u0027s over,” I say. “They\u0027re on to me. Once the sun goes down, they\u0027l hunt me down.”\n She stands up, walks a few paces away. Her arms stay rigid by her side, her head bent down, deep in thought.\n “We\u0027ve got the FLUNs.\n We can go back to the library, take them down.”\n “Ashley—”\n “No, listen, we can do this. Nobody else knows about you, it\u0027s only the hunters in the library.”\n “Ash—”\n “If we take them out, no one will be any the wiser, your secret\u0027s still safe.”\n “It\u0027s a suicide mission—”\n “We\u0027ve got the FLUNs—”\n “There\u0027s one FLUN left, I used the other up. And it\u0027s buried somewhere in the library, I don\u0027t know where it is. They outnumber us, they\u0027ve got speed, power, fangs, claws—”\n “We\u0027l fi nd it, then, put it at the highest setting, it\u0027s fatal—”\n “We won\u0027t fi nd it!”\n “We can—”\n “Ash—”\n “What!” she screams, her voice suddenly catching. “What do you expect me to say, what other choice do we have?”\n She starts to sob uncontrol ably.\n I reach for her, gather her in my arms. Her body is cold; she\u0027s shivering. “We\u0027ve got to try, we\u0027ve got to keep coming up with answers,” she urges.\n “It\u0027s over. We tried our best. But there\u0027s nothing more that can be done.”\n “No! I refuse to believe that!” She pul s away with a cry. Her hands whiten into tight fi sts. Then her breathing steadies, her body reaches perfect still ness. The still ness of a person who\u0027s reached a decision.\n “We can make a life for ourselves in the Dome,” she says softly, still facing the windows, her back to me.\n “What?”\n “The Dome. We\u0027l survive, just like the hepers have, for years.”\n “No way. I can\u0027t believe—”\n “It\u0027l work. The Dome runs on continuous autopi lot. It comes up at dusk, descends at dawn. It\u0027l always protect us.”\n I stare at her back. I can\u0027t take it anymore, seeing that back.\n I walk over, grab her arm, spin her around.\n Her face betrays the steadiness of her voice and gait.\n Tears run down her cheeks.\n “Ashley . . .”\n “It\u0027s the only option left for us.” She stares into my eyes.\n “And you know that, don\u0027t you?”\n Us. The word resonates in my ears.\n “I won\u0027t let you . . . it\u0027s just me they want right now,” I tel her.\n “You can go on with your life.”\n “I hate that life! More than you do.”\n “No, you\u0027re good at it. I\u0027ve seen you, you could go on—”\n “No! I hate it with every fi ber of my being. I could never go back to it alone. The fakery, the burying of desire.” Her eyes take on a fl ash of raw emotion that at fi rst I think is anger.\n But then her words: “You\u0027ve done this thing to me, Gene.\n And now I can\u0027t go back to that, not alone, not without you.”\n She sniffs. “The Dome.\n That\u0027s the only way we can be together now.”\n “The Dome\u0027s a prison. Out here, at least you\u0027l be free.”\n “Out here, I\u0027m a prisoner in my own skin. The restrained desires, the repressed smiles, the fake scratches, the fake fangs— these are the bars of a deeper prison.”\n My thoughts race in me, spiraling in a mad tailspin. But her eyes slow everything down, anchor me. And I move toward her, helpless to do otherwise, cupping her face. My hands on her cheeks, my fi ngers on her jawline, her cheekbones, wiping at her smal mole, wet with tears.\n “Okay,” I say, smiling despite the situation, “okay, let\u0027s do this.”\n She smiles back, squeezing her eyes shut; more tears fl ow out.\n She pul s my body against hers, holds me fi ercely.\n A loud, piercing scream suddenly screeches from outside.\n We look at each other. Then another, fi l ed with pain and agony. Silence. Then another hell acious scream. We rush over to the window.\n Somebody is making a break for it from the library. Phys Ed.\n He\u0027s holding above his head a SunCloak. But the SunCloak was never meant to be used in broad daylight, and the sun\u0027s impact is immediate and devastating. Phys Ed stumbles, then gets up on his feet, his legs pushing forward with a spongy propulsion. As he draws closer, I see his skin— shining with an almost radioactive paleness— start oozing under the strong sun, pus already leaking out of his eyebal s. He screams again, and again, even as his vocal cords start to disintegrate. But if the SunCloak is not perfect, it\u0027s good enough: he\u0027s going to make it to the main building. Where he can tel others about me, that I\u0027m a heper in disguise, that I\u0027m a heper in this building. \n","sourceLink":"https://allnovel.net/the-hunt-the-hunt-1/page-39.html","bookId":1579,"book":{"id":1579,"title":"The Hunt (The Hunt #1)","description":"Storyline: \n The Hunt (The Hunt #1) \n Don\u0027t Sweat. Don\u0027t Laugh. Don\u0027t draw attention to yourself. And most of all, whatever you do, do not fall in love with one of them. \n Gene is different from everyone else around him. He can\u0027t run with lightning speed, sunlight doesn\u0027t hurt him and he doesn\u0027t have an unquenchable lust for blood. Gene is a human, and he knows the rules. Keep the truth a secret. It\u0027s the only way to stay alive in a world of night--a world where humans are considered a delicacy and hunted for their blood. \n When he\u0027s chosen for a once in a lifetime opportunity to hunt the last remaining humans, Gene\u0027s carefully constructed life begins to crumble around him. He\u0027s thrust into the path of a girl who makes him feel things he never thought possible--and into a ruthless pack of hunters whose suspicions about his true nature are growing. Now that Gene has finally found something worth fighting for, his need to survive is stronger than ever--but is it worth the cost of his humanity?\n \n","cover":"https://allnovel.net/images/the-hunt-the-hunt-1.jpg","author":"Andrew Fukuda","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-hunt-the-hunt-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:01:18 AM"}}
