{"id":110668,"no":41,"title":"Page 41","content":"The three of them slide right across it; they circle around, their muscles bunched, fi ngers jamming around the edges, trying to pry open the cover. With horror, I see the cover start to rise. She hasn\u0027t been able to apply the locks yet. The steel door rises high enough for them to wrap their fi ngers around the bottom— —when a gal eon of bodies pummels into them, knocking them off. Naked bodies everywhere, elbows jockeying for position, arms striking randomly in the air. The cover fal s back down. And this time, even with a dozen hands grabbing for the edges, the cover stays down. She\u0027s applied the locks. Run! a voice in my head shouts. It\u0027s my own voice, barking at me. Run! But my feet are cemented to the ground, my eyes glued to the monitors. I need to be sure she\u0027s fi ne. She\u0027s fi ne, my voice tel s me again. She\u0027s locked in, there\u0027s no way they can break in. Everyone knows this. Or will , and very soon. will know there\u0027s no way to get to the virgin female heper. And they will remember, very soon, something else: the virgin male heper still in the Control Center. And that the male, unlike the female, is very accessible. Run, Gene! And this time the voice is not my own, but Ashley June\u0027s. Run! Now\u0027s your chance to get out! This is why she cut her palm. This is why she lured them al the way down to the Introduction. To give me the slimmest of windows through which to escape to the outside. Run, Gene! I run. For the moment, the corridors are eerily quiet. Even the stairwel harbors only a faint murmuring, a backwater of hisses. I need to go down four fl ights, toward them, to get to the ground fl oor and then out. I place my foot down on the fi rst step . . . and it\u0027s as if I\u0027ve inadvertently triggered a button. Instantly, a roar shrieks up the stairwel , a bel ow of anger, frustration, realization, lust. And then a grab bag of sounds: nails, teeth, hissing, clawing, bounding up the wal s and stairs. Toward me. So soon, and they\u0027re coming. I leap down to the next landing— toward them— and the impact sends a reverberation shooting up my legs and along my spine. Ashley June made it look easy. I grab for the railing with my left hand and— imitating her— swing my body around, leaping for the next landing, my body stil rattling. From below, the bel ow of shrieks intensifi es. It\u0027s my fear, oozing off me in waves, they smel . I fl ing my body down another landing, just one more to go, even as they race up toward me. The impact is a sucker punch to my intestines. I col apse to my legs, cradling my midsection, doubled over in pain. My vision goes yel ow, red, black. I get up, gritting my teeth against the pain, and heave my body to the landing on the ground fl oor. I glance down the well just before I land: long- nailed hands on the railing, a fl urry of bodies fl ashing by on the stairs, eyes glowing in the dark. Black oil gushing up at me, unleashed. I burst through the doors on my left, get my legs working under me. Turn right, right, left, then I\u0027l be in the foyer. Twenty seconds away. They are fi ve, ten seconds away. With my legs fi l ing with lactic acid, I push for the exit, ignoring the mathematical certainty of my own demise. That is the exact phrase as it enters my turbulent head: the mathematical certainty of my own demise. I turn right, knowing I have at most only two seconds of life left. Race down the corridor, my form all but forgotten, just a rag dol pul ed along by fear, arms fl ailing out. Five seconds later, as I turn down the last corridor into the foyer, I\u0027m still alive. I\u0027m almost blinking in surprise. They must have shot past the ground- fl oor landing, thinking I was still up in the Control Center. I\u0027m safe, I\u0027m going to make— An explosive bang. They\u0027ve burst through the doors on the ground fl oor, are already racing down the corridors toward me, fast and furious and desirous, panic now driving them, the panic that they might lose me to the sun outside. A dark sea, an incoming tide of black acid. My feet sink into the cool Turkish- knotted royal carpet in the foyer. I turn to my left. There. The double- paneled front doors, thinly rimmed by the daylight outside. Twenty yards to freedom. I take off for them, every last ounce of energy long gone, somehow fi nding speed. The deranged voices behind, the scrabble of nails on marble, skittering and slipping. Ten yards away. My arms stretch forward, reaching for the door handle. Something grabs my ankle. It is warm and moist and sticky. But with enough solidity and strength to keep its hold on me, to bring me to the ground. I crash with a thud, air pushed out like a bagpipe squashed. It\u0027s Phys Ed, the spongy stickiness of what remains of him, anyway, holding my ankle, pul ing himself toward me. Yel ow pus runs down his pizza face. His mouth, partial y toothless now (I see his fal en teeth scattered on his chest and the carpet), opens to hiss, but what comes out instead is a blubbering, sloppy mess of sounds. I kick at him with my foot, but his grip around my ankle tightens. “Gah!” I shout. “Gah!” I strike out with my other foot, missing his hand but fi nding his face instead. My foot sinks in through the gooey stickiness— for one stomach- churning moment, I feel his eyebal pressed against the sole of my foot— before fi nding bone. What used to be bone. The head not so much explodes as peels off his neck. No time to dwel . I\u0027m on my feet, hand on the handle, pushing through the front doors. The brightness is blinding, but I don\u0027t stop. Not with the cries of anger and frustration baying right behind me. I run with squinting eyes, barely seeing, my feet slapping at the sand beneath me, intent only on creating more distance, more distance between me and the doors; and I don\u0027t stop, even when I know I\u0027m far enough, but keep pounding the ground, and I\u0027m shouting, “Gah! Gah! Gah!” not sure if this is because of anger or victory or defeat or love or fear. But I just keep shouting it over and over until I\u0027m no longer shouting it but sobbing it, no longer running but facedown in the sand, bent over with fatigue, my hands clenching and unclenching sand, sand in my fi st, sand in my nostrils, sand in my mouth, throat, and the only sounds are my ragged breath and raspy sobs, my tears dripping down into the sand, bathed in the wonderful, painful, blinding light of day. I am emptied of energy, thought, emotion, as I pick myself up and walk to the Dome. My bones are still jangling from the pounding they took on the stairwel . I examine my ankles: no swel ing and, more important, no cuts or scratches on my left ankle where I was grabbed. It is quiet, not even the sound of wind blowing. I make a wide arc around the library; I\u0027m not overly worried that any other hunter will charge out, especial y with the SunCloak gone, but I\u0027m not taking any chances. I think I hear a hissing, wet and slushy, coming from inside. But that recedes as I draw closer to the Dome. And in the heper vil age, all is quiet. “Hey!” Silence. “Hey!” I walk into a mud hut. Empty, as expected. And the second mud hut is just as empty. Dust motes fl oat in a beam of sunlight. And everywhere I go, it\u0027s the same. Empty. Not a heper in And everywhere I go, it\u0027s the same. Empty. Not a heper in sight. Not in the vegetable patch, not under the apple trees, not on their training ground, not in any of the mud huts. They\u0027re gone. From what I can gather, they left in a hurry. Their breakfast sits half- eaten in the mess hal , slices of bread nibbled at, glasses half- ful with milk. I scan the plains, looking for a moving dot or a cloud of dust. But they\u0027re nowhere to be seen. The pond offers the reprieve I seek: water. And space and sunlight and silence. I take a long drink, then lie down next to the pond, dangling my right arm and leg into the cool water. In about four hours, the wal s of the Dome will rise up, emptied of its former occupants. A new occupant will have taken their place— no, not an occupant, a prisoner. For that is what it is going to feel to me, alone within its glass wal s. A prisoner as surely as Ashley June is a prisoner within the wal s of the pit, down in the dark recesses of the earth. How long can she last down there? The old male heper, they\u0027d said, had stored enough food and water to last a month. But how long, alone in the darkness and cold, before you lost all hope? How long before your mind snapped under the constant scratching and tapping and pounding of the door above? And why had she done it? I know the answer, it\u0027s obvious, but I don\u0027t understand it. She did it for me. She knew, as soon as she saw the SunCloaked man burst into the main building, that I\u0027d be dead within minutes. She did the only thing that would save me. I run my left hand along the gravel, letting the sharpness pierce my palm. I bite my lower lip, unable to shake a feeling that I\u0027m missing something crucial y important. An indelible sense that I\u0027m loaf-ing when I should be hustling. I should be doing something— but what? I slap at the pond in frustration, letting water splash onto my body, my face. I sit up. What am I missing? I replay in my mind the last images of Ashley June in reverse order: jumping into the pit, rushing into the Introduction, fl ying down the stairs, in the kitchen writing a letter, throwing it into the oven— I jolt up. That wasn\u0027t an oven. It was the Umbilical. I leap to my feet and run over to it. Even yards away, I see a blinking green light, right above the slot, a steady pulsing. I\u0027m there in seconds. I grab the slot, pul it open. There. In the corner, a smal folded piece of paper. It crinkles lightly in my fi ngers as I unfold it. A short letter, written hurriedly, if not frantical y. Gene, If you\u0027re reading this, you made it. Don\u0027t be mad at me. Or yourself. It was the only way. I\u0027ll be fi ne. You\u0027ve given me something to remember; no matter how dark or lonely it gets down here, I\u0027ll always have the memories we share. Those few hours when we There\u0027s still time. Bring the hepers back. When you return, as everyone\u0027s rushing out at them, use that as cover to come get me. I\u0027m @ Intro. Will wait 4 U. Be quick, stable Never forget And there the letter ends, seemingly in midsentence. She was rushed toward the end, her words screeching across the page, for-feiting grammar, scratches of her panic.","sourceLink":"https://allnovel.net/the-hunt-the-hunt-1/page-41.html","bookId":1579,"book":{"id":1579,"title":"The Hunt (The Hunt #1)","description":"Storyline: The Hunt (The Hunt #1) Don\u0027t Sweat. Don\u0027t Laugh. Don\u0027t draw attention to yourself. And most of all, whatever you do, do not fall in love with one of them. Gene is different from everyone else around him. He can\u0027t run with lightning speed, sunlight doesn\u0027t hurt him and he doesn\u0027t have an unquenchable lust for blood. Gene is a human, and he knows the rules. Keep the truth a secret. It\u0027s the only way to stay alive in a world of night--a world where humans are considered a delicacy and hunted for their blood. When he\u0027s chosen for a once in a lifetime opportunity to hunt the last remaining humans, Gene\u0027s carefully constructed life begins to crumble around him. He\u0027s thrust into the path of a girl who makes him feel things he never thought possible--and into a ruthless pack of hunters whose suspicions about his true nature are growing. Now that Gene has finally found something worth fighting for, his need to survive is stronger than ever--but is it worth the cost of his humanity?","cover":"https://allnovel.net/images/the-hunt-the-hunt-1.jpg","author":"Andrew Fukuda","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-hunt-the-hunt-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:01:18 AM"}}
