{"id":71241,"no":20,"title":"Page 20","content":"\n “I’d bet Jessie is late the mornings she’s gotta drive from Brandt’s to her job at Sky Blue.” Ben slid his menu to the edge of the table. “What’s the holdup on them getting one place together?”\n “Money, probably. And Dad hasn’t exactly been helpful.”\n Like that was news. His uncle was an asshole most days. “What’s Uncle Casper been doin’ in his retirement? My Dad never says much about him.”\n “He drinks until he passes out. We stop by to check on him.”\n “To make sure he ain’t dead,” Dalton said.\n The muscle in Tell’s jaw flexed. “Mom would have a conniption fit if she saw the state of the house. It’s nasty. Dad’s been livin’ like a drunken hermit since their divorce was finalized.”\n Dalton scowled. “Even after all the shit Dad did to Jessie over the years, she still tried to help him. Cleaned the place top to bottom. Washed his clothes. Cooked for him. He’s such an ungrateful bastard that Brandt won’t let Jess go over there anymore.”\n “Too bad you can’t just move your dad’s stuff to Brandt’s trailer and then he and Jessie could have the house. It’s at least fifteen minutes closer to her job.”\n Tell and Dalton exchanged a pained look. “We think that’s what they’re waitin’ for.”\n “Waiting for Uncle Casper to die?” Ben said sharply.\n “He’s killin’ himself, Ben. He won’t listen to any of us. Believe it or not, Mom had some influence over him, but that’s gone. They haven’t spoken since the day she left. There ain’t a lot we can do.”\n Ben hated the huge rift his uncle had caused in the family, but it seemed wrong to write him off and let him drink himself to death.\n A highly rude waitress took their order and as soon as she stomped away, Tell set his forehead on the table. “Fuck me.”\n “What the hell did you do to her, bro?”\n Tell raised his head. “This is why I don’t date women from around here. She’ll probably spit in my damn food.”\n “Who is she?” Ben asked.\n “Her name tag said Tara if you don’t remember,” Dalton offered.\n “Fuck off, Dalton. It ain’t like you don’t have sex amnesia every so often.”\n Ben lifted a brow at Tell. “Sex amnesia?”\n “You know. Where you have sex with a woman, good sex, memorable sex, but then you can’t seem to recall her name.”\n His cousins stared at him when he didn’t immediately respond. “What?”\n “Fuck you, gentleman Ben. You remember the name of every woman you’ve banged?”\n They had him there. “Not the ones from way back. But the ones from last month? Hell yeah.” His gaze momentarily strayed to the back of Ainsley’s head.\n Tell gloated. “See, Dalton, I told you he wasn’t a fuckin’ monk.”\n “But that don’t mean he’s a fuckin’ man-whore like you are,” Dalton shot back.\n “Boys. Play nice. So what’s so all-fired important you asked me to come to town?” He frowned. “Since it was your idea, I ain’t buying your lunch.”\n “Cheapskate.”\n “Is this about Uncle Casper?”\n “No.”\n “Then what?”\n “We heard you took Rielle to the bank yesterday.”\n “Yeah, so?” Then he remembered the conversation on Sunday about Rielle. “Christ. I’m not interested in her, okay? I was just bein’ neighborly.”\n “We don’t care about that,” Tell said. “We wanna know why she was at the new bank?”\n “Why does anyone go to the bank? She needs a loan.”\n “Bet they didn’t give it to her, did they?” Dalton said.\n “She didn’t say and I didn’t ask. Why?”\n “Well, we’ve heard she’s seriously financially fucked.”\n Ben’s gaze turned sharp. “From who?”\n Dalton shrugged. “Evidently she put up her land as collateral when she borrowed the money to build that bed and breakfast.”\n “It’s not uncommon to borrow against equity.”\n “She borrowed the maximum amount of the equity and hasn’t made a single payment on it for over a year.”\n That shocked him. “Are you fucking serious?”\n “Yeah. The bank has given her a lot of leeway, but unless she pays at least six months of the amount she’s in arrears, in the next forty-five days, Settler’s First will start foreclosure proceedings.”\n “Holy shit.” Ben wasn’t surprised Rielle hadn’t shared that information; the Wetzlers always had a serious distrust about “the man” and the McKay family. Plus, Rielle already felt guilty about not paying him for his handyman help. Or the new beds he’d handcrafted. “Her money troubles ain’t common knowledge?”\n Tell shook his head.\n “How’d you find this out?”\n An unspoken communication passed between them. Then Dalton said, “Rory.”\n “Rory just told you this?”\n Dalton pushed his hat up an inch. “Rory didn’t just blurt it out. I went to Laramie last weekend to hang out with my buddies and I saw Rory in the bar. She’d just finished her shift and was takin’ advantage of the employee discount by doin’ a shit ton of shots. Some assholes were bothering her so I kept ’em away.” He sighed. “Rory don’t drink, so the booze hit her like a cattle truck. Then she started cryin’ about how her mama used every penny they had to put her through college. And she’d wanted to get a job after she graduated, but Rielle told her it was more important she finish grad school since it was basically free.”\n “Christ.”\n “I don’t think Rory knew what the fuck she was even sayin’. I couldn’t leave her there, so her boss told me where Rory lived. I took her home.” He scowled. “She tossed her cookies in my truck and on me.”\n “Just like when you used to baby-sit her, huh?” Tell teased.\n “Go to hell. I never babysat her.”\n “I remember. You ran nekkid through the woods with her playing Tarzan and Jane. Or Adam and Eve. Or…doctor.”\n Dalton ignored him. “So when Rory called me the next day to apologize for barfing on me, I didn’t mention she’d been a freakin’ blabbermouth. And if she did remember, I doubt she’s gonna confess to Rielle that she told their financial sob story to a McKay.”\n “While I appreciate you tellin’ me this, I gotta ask…why?”\n Tell leaned forward. “The way we see it, Rielle would probably rather sell the land, or part of it, than lose it entirely when it gets foreclosed on. So we’re thinkin’ we should approach her with a business proposition. We’ll make the cash payments to catch her up on the bank loan to stave off the foreclosure—if she’ll divide up the back half of her land and sell it to us. That way it’d be McKay land, from your place to ours, as it should’ve been before my dad fucked it up all those years ago.”\n Ben gave them credit for quick thinking. “We’ve always wanted that creek front section. But they’ve always refused to sell.”\n “It don’t look like Rielle’s got an option now. The sale of that acreage will give her enough money to keep her bed and breakfast open if she wants.”\n “Who else have you talked to about this?”\n “No one,” Dalton said. “Not even Brandt.”\n “Why not?”\n “Because as much as we appreciate that Brandt’s a hard worker, he’s a damn do-gooder. He’ll see even talkin’ to Rielle as takin’ advantage of her. We don’t see it that way. We figured you wouldn’t either. So, we’d appreciate it if you didn’t mention this to Quinn.”\n It clicked. “Quinn would feel the same as Brandt.”\n Tell nodded. “You’re practical, Ben. And to some extent, unsentimental, like us. It’s just business.”\n “Good business,” Dalton inserted. “It has to be just the three of us, if we can swing it.”\n “Because you don’t want Uncle Carson or Uncle Cal to get wind of this either.”\n “And buy it right out from under us? Fuck no. But it ain’t like the purchase wouldn’t benefit the entire McKay ranching operation. It’d just give both our families a little more land, a little more pull, and maybe a little more respect. I mean, yeah, they’re treating us better than they ever have, askin’ for our input, increasing our shares, but sometimes we still feel like the poor relatives.”\n Again, Ben couldn’t argue with their logic. “Do you guys have the capital?” Not wanting to admit he fell into the poor relative category, he added sharply, “Because I sure as hell ain’t funding the whole thing.” He wasn’t sure he could fund even a portion of it. He’d have to hope like hell some of his furniture payments came through.\n A fierce look entered Dalton’s eyes. “I know you didn’t mean that to be insulting, cuz. Yeah, me’n Tell are the youngest, but that don’t make us the dumbest. We put up the lion’s share of the down payment for that section we bought, more than Brandt. Dad don’t even know that.”\n He whistled. “Impressive. You saved all that?”\n They exchanged another look. “Not exactly.”\n “What have you boys been up to?”\n “Poker.”\n “Excuse me?”\n Tell offered a shit-eating grin. “We’ve become damn good poker players. We hit Deadwood for weekend tournaments. Blackhawk, Colorado, has decent-sized pots once a month. We made a shit ton of money playin’ online before most them sites closed down.”\n “When I was in Vegas with you last December for the NFR?”\n “I rocked it at the poker tables. Played a little blackjack. I ended up fifteen grand ahead.” \n","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-20.html","bookId":2693,"book":{"id":2693,"title":"Cowboy Casanova (Rough Riders #12)","description":"Storyline: \n Cowboy Casanova (Rough Riders #12) \n His rough touch makes her lose control... \n In Sundance, Wyoming, you can\u0027t throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he\u0027s Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. \n As for the curvy brunette eying him from across the room? He\u0027ll eat his Stetson if she\u0027s the experienced Domme she claims to be. Bennett offers her a deal he\u0027ll let her call the shots for one night. But the next night he gets to prove to her how freeing it\u0027ll be when he takes the reins. \n Ainsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she\u0027s stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben\u0027s urging her to explore her submissive side outside the club, and there\u0027s something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. \n Can Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won\u0027t survive the light of day? \n Warning: This book contains a lot of kinky sex. No, seriously, there\u0027s A LOT of kinky cowboy sex in this Rough Riders installment. You\u0027ve been warned.\n \n","cover":"https://allnovel.net/images/cowboy-casanova-rough-riders-12.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowboy-casanova-rough-riders-12.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:19:08 AM"}}
