{"id":71242,"no":21,"title":"Page 21","content":"\n Seemed he wasn’t the only one with a secret life. “Does Brandt know about any of this?”\n “No. He thinks we’re man-whores, hittin’ strip clubs all over hell when we’re really playing poker.”\n “Except for the weekends I’m working as a rodeo judge,” Tell clarified. “So you see why we don’t want him to know about this. Alls we want is a bigger piece of the pie and not to have to borrow money from one of the uncles to make improvements on our land.”\n “Dad didn’t have a problem with that, but the rest of us did,” Dalton said sourly.\n “I don’t blame you. I would’ve had a problem with that too.”\n “But we can’t just show up on Rielle’s doorstep and ask if what Rory said was true. It’d be easier if someone Rielle knows and trusts, someone she owes neighborly favors to, would get the real scoop.”\n “Seriously? I’m supposed to pop over and say, ‘Hey, Ree, thanks for watching my dogs and for the zucchini bread and by the way, how much are you behind on your bank payments?’”\n “We hoped you’d use your no bullshit reputation to get the facts, and not act the part of an ass-kissing suck-up like the rest of our relatives.”\n Ben scrubbed his hand over his jaw. This had caught him off guard. “Look. I appreciate your trust in me. I ain’t gonna say nothin’ to nobody, but I need time to chew it over. Okay?”\n “Okay. But don’t forget the ticking clock.”\n Tara delivered the food. She dropped Tell’s hot beef sandwich almost from eye level. The cheeky bastard just grinned at her and said, “Thanks, darlin’.”\n Conversation ceased as they ate.\n Ben made a point not to stare at Ainsley, because his cousins would notice his distraction.\n Then again, Tell and Dalton shoveled food like they’d never seen it. “What’s the rush?”\n “No need to sit around and bullshit when there’s work to finish.” Dalton dropped a twenty on the table. “Let us know if you find anything out.”\n As his cousins exited the restaurant, Ainsley and the mayor headed toward him. Ainsley kept her expression blank.\n The mayor, Mark Gilbert, was effusive. “Ben McKay! I haven’t seen you in town for a while. Did we tick you off or something?” He thrust out his hand.\n Ben shook it. “No, sir, Mr. Mayor. Just keeping myself busy on the ranch. Snuck into town to have lunch with my cousins.”\n Mark leaned in. “What’s with this Mr. Mayor bullshit? We’ve known each other since elementary school.”\n Ben held Ainsley’s gaze. “Just wanted to show you the proper respect when you’re havin’ lunch with the president of Sundance’s newest bank.”\n He laughed. “Of course you’ve already met the lovely and capable Miz Hamilton. The McKays have a knack for knowing when a beautiful new woman arrives in town and mercilessly working her with those cowboy charms.”\n Slathering on the flattery for Ainsley while taking a small shot at him? Mayor Mark didn’t miss a trick.\n Ben offered Ainsley his hand. “Good to see you again, Miz Hamilton.”\n “You too, Mr. McKay.”\n “Ainsley and I were just discussing ideas for the next community event. We’re hoping to have something big to welcome National West Bank to our community. You have any thoughts?”\n Ainsley cocked her head. “I’d love to hear your input. I’ve heard your family is a big part of this community and has been for over one hundred years.”\n “At the risk of bein’ accused of nepotism, I’d suggest a community celebration to honor my brother Chase’s accomplishments this past year. He might not be headed to the PBR World Finals, but he’s done an outstanding job starting his own advocacy group for mandatory safety helmets in bull riding. The mayor knows any time Chase comes back to town there’s always people interested in hearing him talk. Now that he’s gone and married himself a genuine movie star?” Ben grinned. “This community event could have worldwide attention.”\n “That’s an excellent suggestion, Ben.” Mark said. “Would Chase be interested?”\n “I can ask him. If he is you’ll have to get in touch with his PR people to finalize the details. I only see one problem with this.”\n “What’s that?”\n “The McKays have always been customers at Settler’s First Bank. I reckon they won’t take too kindly to a celebration for Chase McKay bein’ sponsored by a competing bank.”\n Silence.\n Ainsley looked impressed…and a little peeved.\n “I’m sure we could work something out.” Mark glanced at his watch. “I’m afraid I’ve got a meeting. Could I drop you off at the bank, Ainsley?”\n “No. I’ll walk back. I’d like to talk a little more in depth with Mr. McKay about his ideas.” She winked at Mark. “Maybe try to sweet talk him into hearing my National West Bank pitch about all the services we offer our new customers.”\n “Excellent idea. Enjoy.” He hustled out the door.\n Ben gestured to the booth. “Could I interest you in a slice of pie or a cup of coffee while I hear how well you can service me?”\n Her stern look vanished into a reluctant smile. “My God. You are unbelievable.”\n “That’s what I’ve been tryin’ to tell you.”\n After receiving their coffee, Ben had his first doubt Ainsley would agree to his proposition. She spent a considerable amount of time stirring sweetener into her cup, avoiding his eyes.\n “Something wrong?” he finally asked.\n “No.” She glanced up. “Just trying to grasp how the man who groaned when I talked about community responsibility last night came up with a brilliant idea for my community event that cuts my part out of it entirely.”\n He shrugged. “I’m not worried. I’m sure you and Settler’s First can come to an agreement that benefits both of you equally.”\n “Will our agreement benefit us both equally?”\n So she didn’t intend to skirt the issue. “Yep.”\n “Care to elaborate?”\n “You wanna talk about this now?”\n Ainsley looked around the restaurant, almost comically, before she lowered her voice to a near whisper. “Actually, yes, I do.”\n “Why?”\n “Because I’ll be able to think clearly when you’re not touching me.”\n Ben smiled unrepentantly. “Words can be just as powerful as a touch.”\n She challenged him with an arch look.\n He also dropped his voice. “Did you imagine yourself havin’ sex with Mayor Mark? I’ll admit I imagined you in bed with him.”\n That threw her off. “Why on earth would you imagine that?”\n “Because I saw how he looked at you, and, angel, Mark was definitely imagining you in his bed.”\n Her response might’ve been, “Oh please,” but she really meant, Go on.\n “This is how I imagined it. He’d probably undress you slowly. Kiss you, run his hands down your chest. Keep all touches gentle and exploratory. When you give him the signal to move on, maybe by releasing a little moan, that’s when he’ll put his mouth on your skin. Starting with your nipples. He’ll spend way more time licking and sucking on them than even you’d like. He’ll kiss straight down your belly and you’ll feel that tingle of anticipation. Wondering if he’ll put his mouth on your pussy and get you off first. Or if he’ll just tease you. Push you to the edge and then slip on a condom to take you the rest of the way. I’d bet he’s more of a teaser, more an equal opportunity man. If you go down on him, he’ll go down on you.\n “When he deems you ready for his cock, he’ll gently ease inside you, looking in your eyes. He’ll keep up a steady pace, asking you the entire time if it’s okay. He’ll try to remember to kiss you as the momentum builds and he fucks you faster. You won’t demand he slow down and see to your needs before his. You decide you’ll let it slide this first time. After he comes, he’ll pant in your ear how good it was. You’ll tell yourself it was okay. Even if you don’t believe it. Even if you have a sense that something was missing.”\n Ainsley stared at him. “And there’s something wrong with that scenario?”\n “Yes, goddammit, there is, because that’s not what you want. That’s the type of sexual encounter you’ve had your whole life.”\n Her haughty look vanished.\n “Now imagine having sex with me.”\n She licked her lips.\n “You know it’s not that civilized with me. Sex with me is raw, dirty and demanding, but you’ll never feel there’s something missing because I will see to your needs above my own. Every. Single. Time.”\n “So you’re more of a giver than a taker?”\n “Don’t get me wrong, I take plenty. But never at your expense.”\n She softly said, “Then my answer is yes. One month.”\n Relief flowed through him.\n Ainsley scooted from the booth and Ben followed her outside. He admired how respectable she looked in a form-fitting gold-colored business suit, and he couldn’t wait to thoroughly muss her up. “Be at my place right after work.”\n “So this is strictly clandestine between us?” she asked. “No public outings in Sundance?”\n “Nope.”\n “Well, I don’t believe we’ll spend all of our time together naked.”\n “Don’t bet the bank on that.” Ben tipped his hat and strode away.\n Chapter Twelve\n Ben hated putting his dogs outside. But if he wanted to use all the rooms in his house with Ainsley, curious sniffing dogs would put a damper on that real fast.\n He wasn’t a pacing kind of guy, but he beat a path from his kitchen to the bar, through the game room, to his bedroom and back to the living room. He rarely had a case of nerves, but he definitely was feeling them tonight. \n","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-21.html","bookId":2693,"book":{"id":2693,"title":"Cowboy Casanova (Rough Riders #12)","description":"Storyline: \n Cowboy Casanova (Rough Riders #12) \n His rough touch makes her lose control... \n In Sundance, Wyoming, you can\u0027t throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he\u0027s Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. \n As for the curvy brunette eying him from across the room? He\u0027ll eat his Stetson if she\u0027s the experienced Domme she claims to be. Bennett offers her a deal he\u0027ll let her call the shots for one night. But the next night he gets to prove to her how freeing it\u0027ll be when he takes the reins. \n Ainsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she\u0027s stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben\u0027s urging her to explore her submissive side outside the club, and there\u0027s something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. \n Can Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won\u0027t survive the light of day? \n Warning: This book contains a lot of kinky sex. No, seriously, there\u0027s A LOT of kinky cowboy sex in this Rough Riders installment. You\u0027ve been warned.\n \n","cover":"https://allnovel.net/images/cowboy-casanova-rough-riders-12.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowboy-casanova-rough-riders-12.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:19:08 AM"}}
