{"id":71262,"no":41,"title":"Page 41","content":"\n So he chewed on it for a day and came up with a solution. Not ideal, but workable. Okay, it sucked ass, and it crossed another line, but he had no choice.\n Late Tuesday morning Ben ironed his plain white shirt, slipped on a bolo tie embellished with the McKay brand and donned his tan suit coat. He added a western belt, centering it between his jean-clad hips. He settled the black Stetson on his head, grabbed his duster and headed to town.\n He hadn’t set up an appointment with Ainsley at the bank, too many snoopy people would report back to his that family Ben McKay had applied for a loan. So he was planning to take her to lunch and spring his loan request over a good steak.\n Ben strode into National West Bank. He tipped his hat to the teller and made tracks straight for Ainsley’s office—only to get intercepted by Jenny.\n “Ben McKay. Fancy seeing you here again. Is there something I can help you with?”\n “Yes. I need to speak with Miz Hamilton.”\n Jenny sauntered to her desk and tapped her fingers on a large day planner. “She’s a busy woman. She’s on a conference call right now. She’s scheduled a meeting after lunch, followed by a staff meeting, so if you could come back tomorrow—”\n “Nah. I’ll wait until she’s off the phone since we’re having lunch today.”\n Jenny squinted at him skeptically. “It’s not on her calendar.”\n “Huh. I swore we set the lunch date when she was at my brother Chase’s event. Guess I’ll hang out until her call is done to make sure we didn’t get our wires crossed.” He leaned against pillar so he could watch Ainsley in action. Something about seeing that smart, sexy woman in her element got his juices going.\n “We have a sitting area—”\n “I’m good. I’m sure she won’t be long.”\n Jenny harrumphed at his dismissal.\n He waited for that moment when Ainsley realized he was there.\n Bingo. There it was. Her spine straightened and she swiveled in his direction. Their eyes met though the glass and Ben felt that hard punch of lust. Which increased tenfold when she offered him a sexy smirk and ended her phone call.\n The woman had a pull on him like he’d never experienced. He was just as fascinated with who she was out of the sub role, as he was when she trusted him with full control.\n Ben about choked on his tongue when Ainsley sashayed out of her office, wearing a form-fitting black pinstriped skirt and a matching suit jacket that skimmed her hips. The lacy red camisole peeking above the jacket’s lapels kept the outfit from looking too mannish—as if that were possible with her abundance of curves. When he noticed the red stilettos, his mind zipped to the fantasy of the sharp points of those heels digging into his ass as he fucked her on her desk. Or holding onto them as he fucked her over the desk.\n She raised an eyebrow as if reading his wicked thoughts. “Ben McKay. What brings you to town?”\n “He claims you have a lunch date,” Jenny inserted with a sneer.\n Ainsley didn’t miss a beat. She snapped her fingers. “That’s right. We were going to discuss some things that came up after Chase’s event. I believe you mentioned taking me to Fields.”\n Sneaky woman picked the newest, most expensive restaurant in town. Ben looked at Jenny and smiled. “Told ya.”\n “I’ll just grab my coat,” Ainsley said and ducked back into her office.\n “I still find it odd the woman who obsessively writes everything down forgot this date. Makes one wonder why she’s hiding that you two are…friends.”\n Ben wouldn’t let this smarmy little bitch take shots at her boss when Ainsley was out of earshot. He leaned closer to Jenny. “Or maybe Miz Hamilton and I are discussing personal bank business and she didn’t want it broadcast. I understand your job is to ensure her schedule runs smoothly, just as I’m sure she can count on you to maintain the discretion that comes along with your position.”\n Ainsley sailed out of her office, saying, “Jenny, would you make sure all the paperwork in my outbox is filed?”\n Jenny flashed her teeth. “I’m on it. But remember Turton becomes my lord and master after one.”\n “Excuse me?”\n “Oops. I meant to say taskmaster.” Jenny flitted off.\n Ben helped Ainsley with her coat. He opened doors but didn’t reach for her in any way that might be deemed intimate. It about killed him too. She’d worn her hair up and he wanted so badly to press his lips to her bared nape. To taste that fragrant section of skin and watch her body tremble.\n Fields was a new restaurant that utilized locally grown food. The owners only served organic beef, chicken, pork and game. Everything was homemade from ingredients found within sixty miles of Sundance, so the menu selection was limited. This place wouldn’t have been his first choice, but he admitted liking the privacy of the high-backed wooden booths and the fact there were hardly any customers to interrupt them.\n Ainsley set aside her menu. “So, Ben, why did you really show up at my office today?”\n “Were you worried I’d drag you back to your place for a naughty nooner?”\n “Worried? No. Disappointed? Yes.”\n He swallowed a primitive growl. “You get off taunting me in public, doncha, angel?”\n “Maybe a little.”\n “Maybe I’ll make you pay for that later.”\n “Bring it on.”\n The waitress wandered over to take their order. And as usual, Ben knew the woman. He hadn’t dated her, but it wasn’t for lack of trying on her part. He kept up a light banter but he was relieved when she disappeared into the back.\n “Does every woman in town have a thing for you?”\n Might make him a dick, but he was happy to see a spark of jealousy, even when it was unwarranted; he only had eyes for her. “I’m surprised by it too. Used to be the single ladies only talked to me in hopes I’d introduce them to Chase.”\n “I don’t believe that.”\n “It’s true. Which is another reason I’ve stayed away from dating those types of women. I was never sure if they were interested in me for me. I’m just a plain, boring rancher. I don’t have interest in bein’ anything else.”\n Something like sympathy spread across her face.\n “Besides. Aggressive women like that don’t take direction well.”\n “And you’re all about that.”\n He grinned. “Yep.”\n “Okay, Ben. What’s up? Why the surprise lunch date?”\n Ease into it? Or just say it. “I need a loan.”\n Any warmth in her eyes evaporated.\n “Look, it’s a…delicate situation so let me explain before your eyes slice me to ribbons.”\n “I’m listening.”\n Rather than admitting the truth—he had his eye on a piece of land about to be repossessed—Ben did something he rarely did: he flat-out lied. Not only had he promised Rielle discretion, he’d promised his cousins that same discretion. Ainsley wouldn’t question this reason for needing the money since it was personal. Given all he’d told her about McKay ranching practices, she’d know something was off that he wasn’t including his entire family on the possible land deal. “You know I dabble in carpentry. I’ve built custom furniture for different places. Some previous customers have contacted me, wanting other pieces. Seems I have a chance to expand and get the challenge of creating something new. To do that I’ll need more equipment and keep a wider variety of building materials on hand. And that is expensive.”\n “When did you decide this? Because didn’t you just tell me you’re happy being a simple rancher?”\n “Yes, I am. But my woodworking hobby has become something more. It’s personal.”\n Her eyes softened, no doubt thinking of the carved cat he’d given her, so he laid it on thick. “That’s why I don’t want to go to Settler’s First. Because I know Slim Jim Beal, who handles the loans, will tell Steve Talbot, who will contact my uncles or my cousins and give them a head’s up.”\n “That’s against the law.”\n “But that’s how it works here. Sucks, but it’s true. I can just imagine my cousins confronting me, worried I won’t be pullin’ my weight on the ranch because I’m too busy building furniture.”\n “I can see where that might bring up questions.”\n “Questions I’m not ready to answer. But I don’t want to lose out on a good opportunity. I’ve got equity in my house. A steady income. Ties to the area. I’d be a good bet.”\n “I imagine. And you came to me because…”\n Her hard expression said, Because you expect as your sub I’ll automatically say yes. “Christ, no. Don’t look at me like that. I came to you because I trust you’ll be discreet. I’m not askin’ for any special favors beyond discretion in the loan application process.”\n Ainsley had on her shrewd bank president face. “Say I agree to help you. Would there be a chance I’d get any of the other McKay banking business?”\n That question brought him up short. Was what Steve Talbot said true? She had her eye on his family’s coffers? “You’d have some of mine. Isn’t that a start?”\n “I suppose, but I am first, and foremost, a businesswoman so I’d really like the chance to pitch National West’s financial benefits to your entire family—”\n “Hey, Ben.”\n Startled at the interruption, he glanced up and bit back a groan. He hadn’t seen Michelle Littlefield, a woman he’d dated right out of high school, for several years. This was one of his least favorite things about living in Sundance—he always ran into someone he knew. “Michelle. How are you?”\n “Great. When Gloria came back into the kitchen to tell me you were in the dining room, I had to come out and say hello.”\n “It’s been a while.”\n “About eight years since I left to attend cooking school. I just recently returned to Sundance.” \n","sourceLink":"https://allnovel.net/cowboy-casanova-rough-riders-12/page-41.html","bookId":2693,"book":{"id":2693,"title":"Cowboy Casanova (Rough Riders #12)","description":"Storyline: \n Cowboy Casanova (Rough Riders #12) \n His rough touch makes her lose control... \n In Sundance, Wyoming, you can\u0027t throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he\u0027s Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. \n As for the curvy brunette eying him from across the room? He\u0027ll eat his Stetson if she\u0027s the experienced Domme she claims to be. Bennett offers her a deal he\u0027ll let her call the shots for one night. But the next night he gets to prove to her how freeing it\u0027ll be when he takes the reins. \n Ainsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she\u0027s stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben\u0027s urging her to explore her submissive side outside the club, and there\u0027s something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. \n Can Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won\u0027t survive the light of day? \n Warning: This book contains a lot of kinky sex. No, seriously, there\u0027s A LOT of kinky cowboy sex in this Rough Riders installment. You\u0027ve been warned.\n \n","cover":"https://allnovel.net/images/cowboy-casanova-rough-riders-12.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowboy-casanova-rough-riders-12.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:19:08 AM"}}
