{"id":23621,"no":1,"title":"Chapter 1","content":"In the ways of Providence, there is always fitness in the smallest as in the greatest things. It is on the Fourth of July, in midsummer, that we hold the anniversary festivals of American Independence. And it is a beautiful ordering of the Providence that rules the seasons and the nations, that the time of these anniversaries is so well suited to the occasion. For it is fitting, that in the midst of glorious summer days, when the earth lies richest in the sunlight; when the fields are golden with the harvests; when the air is fragrant with the scent of flowers and the new hay; when, in a word, the beauty and the bounty of nature, unite to fill the heart with gladness and with gratitude, we should meet in kindred joy and thankfulness to celebrate our nation’s natal day. For sunshine is the symbol of prosperity, and summer the symbol of peace; and the wondrous bounty of the season fitly typifies the fruits of that civil and religious liberty, to establish which our fathers pledged their lives, their fortunes and their sacred honour. Not that all these anniversaries have been, or will be days of jubilee. Not that the chill and sombreness of winter have not settled, will not settle, upon some. For many stormy years were passed, before the hope that dawned on that July morning in ’76 became a full and crowned reality. And then, you remember the day of the grand jubilee proper, the fiftieth anniversary of our Independence, when both Jefferson—the author, and Adams—the most eloquent supporter, of the declaration, died. And then, you remember to-day one year ago, when the American Congress met in a beleaguered city, within the sound of rebel cannon, with rebel ensigns flaunting almost in the face[6] of the Capitol, met in solemn and determined counsel to devise ways and means to save the nation from destruction at the hands of its own misguided children. And then, to-day; what shall I say of to-day? To-day, when sorrow sits brooding in a million homes, when the shadow of civil war still rests like a pall upon the nation, when in the beautiful Virginia that Washington loved, his children are grappling in the struggle of death. Still, it is true, that in the eighty odd years of our Independence that have passed, there have been few of these anniversary days that have not wholly been days of jubilee, and with the blessing of God a little longer on our union armies, there will be fewer yet in the eighty years that are to come; fewer yet, I trust, in all the vast and pregnant future upon which the summer will not smile in poetic fitness, and which a grateful people will not greet with shouts of gladness and with songs of praise. We have all learned to revere the memory of the men who framed and adopted the Declaration of Independence. All men and all nations have learned to regard with admiration the energy, the courage, the fortitude, the exhaustless patience with which our fathers fought the battles of freedom and inaugurated on this continent the “great experiment” of popular government. No one now dares to question the wisdom of their policy, the lofty purity of their lives and purposes, or the sublime quality of that heroic faith in the final triumph of their cause, which never failed them in the darkest hours of their long and bitter struggle to be free. There were tories then all around them, as there are tories now in the war we are waging, but there is no one now to vouchsafe a word of praise on behalf of the tories of the Revolution. They have sunk to that oblivion, or have earned that unenviable immortality, which belongs to the lot of all who fail their country in its hour of trial, and have neither voice nor sympathy but for its enemies. Only those who aided the Colonies in their struggle with Britain and remembered now with gratitude. And having been, for eighty years and more, a great and prosperous and happy[7] people, we feel increasingly, as the years go by, that we cannot venerate the men too highly, through whose blood and tears, and prayers and blessings, we were made and kept a nation. On a day like this, and in these hours of our history, facts like these have great significance. It is one of the uses of history to teach us what are the noblest uses of life; what deeds live longest in the memories of men; what motives give greatest strength and nobility to character; what fruition follows godlike sacrifices for truth and duty; what ideas and principles, embodied in life, lift men above the common level and crown them with immortal honours. It is one of the uses of a day like this to turn us back to higher sources of inspiration, that we may be the more manfully fitted for the duties of our time, that we may learn the cost of liberty, and the worth of patriotism, and the sacredness of principle, and the holiness of duty. It is one of the uses of a day like this to teach us that our selfish aims and interests and motives, our lives of luxury and frivolity, of leisure-loving and wealth-seeking, all sink to a level of lowest significance, when contrasted with great heroic virtues such as bore our fathers through the storm and struggle of the Revolution. And when these lessons have been learned by a people, and when in the Providence of God the darkest hours of their history have come; when they are compelled themselves to strike for liberty or see it perish; when they have risen to that height of patriotism that they exclaim with old John Adams in ’76, that all that they have, and all that they are, and all that they hope for in this life, they are ready to stake upon the altar of their country; when, filled with such inspiration, they go forth from homes of happiness and peace to fields of carnage and of death, then, above all, does it belong to the uses of a day like this to teach the mourning women of the land, and the children that are fatherless, that these dying and dead soldiers are one with the heroes of the Revolution; that our country’s history will embalm their names with equal honour and a common[8] love, and that a grateful people throughout all the long and coming years will “keep their memory green.” And this shall be my theme to-day; to consider whither the nation our fathers left us is drifting; to consider what we are fighting for; and to enquire whether the heroes of the struggle of to-day do not deserve equal honor with their illustrious sires. Nor have I any doubt of the fitness of this theme for the time and the occasion. For our fathers fought to create a nation. We fight to have that nation live, to keep it one and indivisible, and vain were the struggles of the Revolution, and vain the consecration of days like this to Revolutionary memories, if they failed to bring out into highest prominence such deeds as those of the past and passing year. Our fathers fought to create a nation. And for eighty years there was no sublimer sight beneath the stars than the nation they created. During these eighty years, this people grew from three to thirty millions, from thirteen to thirty-four States. They developed energies such as the world had seldom witnessed. With marvellous rapidity they levelled forests and builded cities; they tunnelled mountains, and cultivated valleys vast as empires; they made their mountain streams turn mills and factories and bear on their bosoms to the sea, and to all the world, the fruits of this industry and the products of the land. They dug out from the bosom of the rocky hills and from dark subterranean recesses a wealth greater than the Indies, and made the wilderness above them to “bud and blossom as the rose.” They grew to be a thinking, toiling, tireless people, and turning from their material successes, they began to manifest progress and proficiency in literature, in science and in art. And all along they conducted a system of government which had no parallel in history, the success of which was distrusted by many of our early statesmen and by all the world beside. And high above all the evidences of their wealth and power, above all the beauties and beneficence of their soil and clime, rose the crowning fact that these teeming, toiling millions were the freest people upon[9] earth; that they enjoyed, in larger measure than the world had ever known, the privileges and prerogatives that belong to manhood, and that they held inviolably sacred, as their fathers before them, their right to “life, liberty and the pursuit of happiness.” I know to what criticism these remarks are open. I know somewhat of the faults and follies of this age and nation. I know how prone we are upon days like this to forget our mistakes, our follies and our crimes, and to indulge in strains of national eulogy, and, I confess, these strains I have rarely relished. I know, too, how common is the autocratic talk that the equal rights, the enlarged liberties, which our institutions secure to the citizen, tend only to license in thought and speech, to fanaticism, to lawlessness, to disrespect of authority, to no-government. And yet I know that it has not been the bestowment of privileges upon the many, but the despotic domination of the irresponsible few that has always cursed humanity. And when I remember how seldom in all the world the fundamental rights of man have been ever recognized; how throughout all time the millions have been toiling, suffering, dying, to keep a few priests in power, or a few tyrants on their thrones; how the few, whom the accidents of birth or fortune have clothed with titles and dignities and powers, fill all the spaces of history, while the patient masses figure only as their suppliants and tools, then I am glad to turn to our eighty years of history, and through all its mistakes and blemishes and inconsistencies, to recognize the great central fact that has struggled upon this continent into endless life, that the rights of men are equal, that men have higher uses than to become appendages of nobility or parasites of royalty, that birth and blood are nothing, that names and titles are nothing, that all the outward emblems of wealth and greatness are nothing, compared with the rights which all men possess in common, compared with the qualities with which God may, and often does, endow the humblest born of earth. And this Nation which our Fathers founded, and which[10] thus expanded into eighty years of such vigorous life; how fares it now? It is racked and rent with civil war. In little more than a year, a hundred new battle-fields have been added to its history. Whole States are given up to desolation. The land is filled with mourners. Hearts are broken to-day, that a year ago beat high with hope, and love, and happiness. Childhood, and womanhood, and tottering age, its props all gone, are mingling their tears and prayers to-day, in the bitterness of a sorrow that will never end on earth. I believe that the war now waged by our Northern armies is eminently just and righteous, or the world has never seen one. I believe that there never has been a time when the Government could have avoided the conflict without unutterable dishonour, and that it will inherit and deserve the contempt of humanity if it fail to continue the struggle with the utmost vigor, until every atom of this rebellion is crushed into annihilation. Whether this be the proper view to take of the war, or not, is a question of momentous import. For, if not, how can we find comfort for the mourners, who have sent forth the idols of their households to die in its cause; or how can we fitly rebuke those who would deepen these sorrows and dampen all patriotic ardor, by their open sympathy with our enemies in arms? Therefore, does it become us to ask and answer the question, “What are we fighting for?” What we are not fighting for is apparent enough. We are not fighting for the abolition of slavery. We are not fighting, as Lord John Russell says, for empire. We are not fighting from love of power—from vindictiveness or hate. We are fighting simply for our own. We are fighting to establish, on foundations eternal as our mountains, one grand, stupendous, geographical fact, that the country and people lying between “the St. John’s and the Rio Grande, between the Tortugas Islands and Vancouver’s Land,” compose one Nation, and are called “The United States of America.” In a public address I delivered in this city, some years[11] ago, occurred these words, viz.: “All over the land, the politicians are echoing the cry of disunion, but the people do not hear it, or do not heed it; they are busy at their workshops, on their farms, doing daily duty, earning daily bread, and they do not hear it; but when they do—when the talk of politicians begins to shape itself to deeds—they will smother the life out of this disunion cry.” I believed then, as I believe now, and as events have proved, if rightly interpreted, that the common sense of the common people—of the American masses—had long ago settled the true value of the American union. The intuitions of a people are better than their logic. Their profoundest convictions make the least noise. Not by argument—not by the talk of politicians, nor the expositions of statesmen—but by the benefits and blessings that flow in upon them through the passing years, do men learn to measure best the value of their institutions. The greatest truths sink into the heart silently, like the dews of Heaven. As the influences of home and of Christian example mould and fix the character, so do the influences of good government and beneficent institutions settle the convictions of a people, unconsciously, noiselessly, but most profoundly. And it is often true, that nothing but some great world upheaval can arouse men to a consciousness of their slumbering powers, their sublime beliefs, and duties, and perils. So still, and strong, and deep was the faith of the American people in the perpetuity and inestimable worth of the American union, that they could not believe it was in danger. But when they saw the danger, when they knew that rebel cannon were bombarding Sumter, and that the United States flag had been shot from the walls of a United States fort, then they rose. And when Banks was retreating, a month ago, they rose again; and all that they have done, all the treasure they have poured out, all the men they have sent to battle, all the sacrifices they have made, all the evidences they have given of an undying love of country, are nothing, nothing, compared[12] with what they yet will do, before they will let this union perish. Before the bombardment of Sumter, party prejudice and strife were strong as ever. Men differed in opinion, and differed with great bitterness, about all the measures of Government. The cabinet of Buchanan became disintegrated with conflicting views of his policy. This policy was praised by many—blamed by more. Equal differences of opinion met the policy of the new President. Many thought his course too timid and temporizing; many thought it too aggressive and bold, and feared (to use their execrable language) that “it would exasperate the South.” But when the bombardment came, then all men saw at a glance that a Government that could not feed its own starving garrisons—that could not command its own forts—was no government at all. They saw at once that the struggle was one of life and death. And then the Nation rose, and then the war began. The latent patriotism of the people, that had been growing and intensifying for three-quarters of a century, burst forth, at last, like a flame; and from that day to this, the only question before us—the question to be decided by cannon, and bullets, and bayonets—has been one of the existence of the American union. And whenever men now talk about conciliation, and compromise, and peace, while five hundred thousand rebels are in arms, they are men of that doubtful patriotism, which would not shrink to see the great American union blotted from the list of Nations. I have my own opinions about the deep underlying causes that have produced this war, and you have yours. But we will not discuss them to-day. They would revive old party issues; they would jar upon the proprieties of this occasion; they would detract from that unanimity of thought and action which should characterize all true patriots in the hour of a nation’s agony. The two facts that need to be remembered are, that the South aims to destroy the union, we aim only to preserve it; and it is not a question of opinion, it is not a question of party, it is simply a question[13] of patriotism, upon which side you are. There is no middle ground to stand upon. A man must be in favor of one thing or the other, either the prosecution of the war, on our behalf, to a triumphant end, or the destruction of the government. This is so clear that it were folly to reiterate it, did not some men claim to be neutral. Judge Douglas spoke words of truth that will live as long as his memory when he said “there can be but two classes in this contest, patriots and traitors.” For the South is not fighting for concessions and compromises, and never has been; it is fighting to establish a new government and to break up the old. It wants no peace but upon this basis. And this basis is one which, by the help of God, the American people will never grant. And why? First, because they have learned to love their country as it is. Patriotism is among the grandest virtues. It belongs to the highest elements of character. It gives more lustre to historic names than almost any other single quality. It intensifies life and makes even death glorious and shadowless. But it implies objects. And a country to excite the loftiest patriotism is not made in a day, scarce in a century. It must have a history. In that history must be found the record of immortal names, immortal deeds and a career illustrating and exalting immortal principles. And such a country is ours, and it must include the whole country or patriotism, as we have learned it, is impossible. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3302/90297.html","bookId":424,"book":{"id":424,"title":"Our union and its Defenders","description":"简介： In the ways of Providence, there is always fitness in the smallest as in the greatest things. It is on the Fourth of July, in midsummer, that we hold the anniversary festivals of American Independence. And it is a beautiful ordering of the Providence...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3302","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
