{"id":31366,"no":118,"title":"CHAPTER XVI. VARIOUS OTHER KINDS OF PAINTING.","content":"We must now make some mention of those artists who acquired fame by the pencil in an inferior style of painting. Among these was Pir?icus, inferior to few of the painters in skill. I am not sure that he did not do injustice to himself by the choice of his subjects, seeing that, although he adopted an humble walk, he still attained in that walk the highest reputation. His subjects were barbers’ shops, cobblers’ stalls, jackasses, eatables, and the like. His paintings, however, 312 are exquisitely pleasing, and have sold at higher prices than the very largest works of many masters. It would not be right to pass in silence the painter of the Temple at Ardea, particularly as he was honored with the citizenship at that place, and with the following inscription in verse upon one of the paintings which he executed there: “These paintings, worthy of this worthy place, Temple of Juno, queen, and wife of Jove, Plautius Marcus, from Alalia, made. May Ardea now and ever praise him for his skill.” These lines are written in ancient Latin characters. Ludius too, who lived in the time of the late Emperor Augustus, must not be allowed to pass without some notice; for he was the first to introduce the fashion of covering the walls of our houses with most pleasing landscapes, representing villas, porticos, ornamental gardening, woods, groves, hills, fishponds, canals, rivers, seashores, and anything else one could desire; varied with figures of persons walking, sailing, or proceeding to their villas, on asses or in carriages, fishing, fowling, or gathering in the vintage. In some of his decorations are fine villas and roads to them across the marshes, with women making bargains, great burdens carried across on men’s shoulders, who move along slipping at every step and tottering beneath their load; with numberless other subjects of a similar nature, redolent of mirth and of the most amusing ingenuity. It was this artist, too, who first decorated our uncovered edifices or promenades with representations of maritime cities,—a subject which produces a very pleasing effect at a comparatively trifling cost. There have been some women painters also. Timarete, the daughter of Micon, painted a Diana at Ephesus, one of the very oldest panel-paintings known. Irene, daughter and pupil of the artist Cratinus, painted a figure of a girl, now at Eleusis, a Calypso, an Aged Man, the juggler Theodorus, 313 and Alcisthenes the dancer. Aristarete, daughter and pupil of Nearchus, painted an ?sculapius. Iaia of Cyzicus, who always remained single, painted at Rome, in the youth of Varro, both with the brush, and with the graver, upon ivory, her subjects being female portraits mostly. At Naples, there is a large picture by her, the portrait of an Old Woman; as also a portrait of herself taken by the aid of a mirror. There was no painter superior to her for expedition; while at the same time her artistic skill was such, that her works sold at much higher prices than those of the most celebrated portrait-painters of her day, Sopolis and Dionysius, with whose pictures our galleries are filled. But as for fame, that has been reserved solely for the artists who have painted pictures; which gives us all the more reason to venerate the prudence displayed by the men of ancient times. For with them, it was not the practice to decorate the walls of houses, for the gratification of the owners only; nor did they lavish all their resources upon a dwelling which must of necessity always remain a fixture in one spot, and admit of no removal in case of conflagration. Protogenes was content with a cottage in his little garden; Apelles had no paintings on the plaster of his walls; it not being the fashion in their day to color the party-walls of houses from top to bottom. With all those artists, art was ever watchful for the benefit of whole cities only, and in those times a painter was regarded as the common property of all. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76735.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
