{"id":31269,"no":21,"title":"CHAPTER VI. MEN OF REMARKABLE GENIUS AND WISDOM.","content":"Among so many different pursuits, and so great a variety of works and objects, who can select the palm of glory for transcendent genius? Unless perchance we should agree in opinion that no more brilliant genius ever existed than the Greek poet Homer, whether we look at the happy subject of his work, or the excellence of its execution. For this reason it was that Alexander the Great, when he found among the spoils of Darius, the King of Persia, a casket for perfumes, enriched with gold, precious stones, and pearls, covered as he was with the dust of battle, deemed it beneath a warrior to make use of unguents, and, when his friends were pointing out to him its various uses, exclaimed, “Nay, but by Hercules! let the casket be used for preserving the poems of Homer;” that so the most precious work of the human mind might be placed in the keeping of the richest work of art. It was the same conqueror, too, who gave directions that the descendants and house of the poet Pindar should be spared, at the taking of Thebes. He likewise rebuilt Stagira, the native city of Aristotle, uniting to the extraordinary brilliancy of his exploits this speaking testimony of his kindliness of disposition. Dionysius the tyrant, who otherwise manifested a natural propensity for cruelty and pride, sent a vessel crowned with garlands to meet Plato, that high-priest of wisdom; and on his disembarkation, received him on the shore, in a chariot drawn by four white horses. Isocrates was able to sell a single oration of his for twenty thousand dollars. When ?schines, the great Athenian orator, had read to the Rhodians the speech which he had made on the accusation of Demosthenes he then read the defence made by Demosthenes, 58 through which he had been driven into exile among them. When they expressed their admiration of it, he exclaimed:—“How much more would you have admired it, if you had heard him deliver it himself;” a striking testimony, indeed, given in adversity, to the merit of an enemy! The nobles of Rome have given their testimony in favor of foreigners, even. After Pompey had finished the war against Mithridates, he went to call at the house of Posidonius, the famous teacher of philosophy, but forbade the lictor to knock at the door, as was the usual custom; and he, to whom both the eastern and the western world had yielded submission, ordered the fasces to be lowered before the door of a learned man. The elder Africanus ordered that the statue of Ennius should be placed in his tomb, and that the illustrious surname which he had acquired, I may say, as his share of the spoil on the conquest of the third part of the world, should be read over his ashes, along with the name of the poet. The Emperor Augustus, now deified, forbade the works of Virgil to be burnt, in opposition to the modest directions to that effect, which the poet had left in his will: a prohibition which was a greater compliment paid to his merit, than if he himself had recommended his works. Marcus Varro is the only man, who, during his lifetime, saw his own statue erected. This was placed in the first public library that was ever built, and which was formed by Asinius Pollio with the spoils of our enemies. The fact of this distinction being conferred upon him by one who was in the first rank, both as an orator and a citizen, and at a time, too, when there was so great a number of men distinguished for their genius, was not less honorable to him, in my opinion, than the naval crown which Pompey bestowed upon him in the war against the pirates. The instances that follow among the Romans, if I were to attempt to reckon them, would be found to be innumerable; for it is the fact that this one 59 nation has furnished a greater number of distinguished men in every branch than all the countries of the world taken together.[77] But what atonement could I offer to thee, Marcus Tullius Cicero, were I to be silent respecting thy name? or on what ground am I to pronounce thee especially pre?minent? On what, indeed, that can be more convincing than the most abundant testimony that was offered in thy favor by the whole Roman people? Thou speakest, and the tribes surrender the Agrarian law, or, in other words, their very subsistence; thou advisest them to do so, and they pardon Roscius, the author of the law for the regulation of the theatres, and, without any feelings of resentment, allow a mark to be put upon themselves by allotting them an inferior seat; thou entreatest, and the sons of proscribed men blush at having canvassed for public honors: before thy genius Catiline took to flight, and it was thou who didst proscribe Marcus Antonius. Hail, then, to thee, who wast the first of all to receive the title of Father of thy country, who wast the first of all, while wearing the toga, to merit a triumph, and who didst obtain the laurel for oratory. Great father, thou, of eloquence and of Latin literature! as the Dictator C?sar, once thy enemy, wrote in testimony of thee,[78] thou didst require a laurel superior to every triumph! How far greater and more glorious to have enlarged so immeasurably the boundaries of the Roman genius, than those of its sway! \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76638.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
