{"id":31272,"no":24,"title":"CHAPTER III. THE WAY IN WHICH ELEPHANTS ARE CAUGHT.","content":"In India they are caught by the keeper guiding one of the tame elephants towards a wild one which he has found alone or has separated from the herd; upon which he beats it, and when it is fatigued mounts and manages it just the same way as the other. In Africa they take them in pit-falls; but as soon as an elephant gets into one, the others immediately collect boughs of trees and pile up heaps of earth, so as to form a mound, and then endeavor with all their might to drag him out. It was formerly the practice to tame them by driving the herds with horsemen into a narrow defile, artificially made in such a way as to deceive them by its length; and when thus enclosed by means of steep banks and trenches, they were rendered tame by the effects of hunger; as a proof of which, they would quietly take a branch that was extended to them by one of the men. At the present day, when we take them for the sake of their tusks, we throw darts at their feet, which are in general the most tender part of their body. The Troglodyt?, who inhabit the confines of ?thiopia, and who live entirely on the flesh of elephants procured by the chase, climb the trees which lie near the paths through which these animals usually pass. Here they keep a watch, and look out for the one which comes last in the train; leaping down upon its haunches, they seize its tail with the left hand, 69 and fix their feet firmly upon the left thigh. Hanging down in this manner, the man, with his right hand, hamstrings the animal on one side, with a very sharp hatchet. The elephant’s pace being retarded by the wound, he then cuts the tendons of the other ham, and makes his escape; all of which is done with the very greatest celerity. Elephants of furious temper are tamed by hunger and blows, while other elephants are placed near to keep them quiet, when the violent fit is upon them, by means of chains. Elephants, when tamed, are employed in war, and carry into the ranks of the enemy towers filled with armed men; and on them, in a very great measure, depends the ultimate result of the battles that are fought in the East. They tread under foot whole companies, and crush the men in their armor. The very least sound, however, of the grunting of the hog terrifies them: when wounded and panic-stricken, they invariably fall back, and become no less formidable for the destruction which they deal to their own side, than to their opponents. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76641.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
