{"id":31315,"no":67,"title":"CHAPTER XVIII. THE ECHENE?S AND THE TORPEDO.","content":"Following the proper order of things, we have now arrived at the culminating point of the wonders manifested to us by the operations of Nature. For what is there more unruly than the sea, with its winds, its tornadoes, and its tempests? And yet in what department of her works has Nature been more seconded by the ingenuity of man, than in this, by his inventions of sails and of oars? In addition to this, we are struck with the ineffable might displayed by the Ocean’s tides, as they constantly ebb and flow, and so regulate the currents of the sea as though they were the waters of one vast river. And yet all these forces, though acting in unison, and impelling in the same direction, a single fish, and that of a very diminutive size—the fish known as the “echene?s”—possesses the power of counteracting. Winds may blow and storms may rage, and yet the echene?s controls their fury, restrains their mighty force, and bids ships stand still in their career; a result which no cables, no anchors, from their ponderousness quite incapable of being weighed, could ever have produced! A fish bridles the impetuous violence of the deep, and subdues the frantic rage of the universe—and all this by no effort of its own, no act of resistance on its part, no act at all, in fact, but that of adhering to the bark! Trifling as this object would appear, it suffices to counteract all these forces combined, and to forbid the ship to pass onward in its way! Fleets, armed for war, pile up towers and bulwarks on their decks, in order that, upon the deep even, men may fight from behind ramparts as it were. But alas for human vanity!—when their prows, beaked as they are with bronze and with iron, and armed for the onset, can thus be arrested and riveted to the spot by a little fish, no more than half a foot in length! 173 At the battle of Actium, it is said, a fish of this kind stopped the pr?torian ship[149] of Antonius in its course, at the moment that he was hastening from ship to ship to encourage and exhort his men, and so compelled him to leave it and go on board another. So that the fleet of C?sar gained the advantage in the onset, and charged with a redoubled impetuosity. In our own time, too, one of these fish arrested the ship of the Emperor Caius Caligula in its course, when he was returning from Astura to Antium: and thus, as the result proved, did an insignificant fish give presage of great events; for no sooner had the emperor returned to Rome than he was pierced by the weapons of his own soldiers. Nor did this sudden stoppage of the ship long remain a mystery, the cause being perceived upon finding that, out of the whole fleet, the emperors five-banked galley was the only one that was making no way. The moment this was discovered, some of the sailors plunged into the sea, and, on making search about the ship’s sides, they found an echene?s adhering to the rudder. Upon its being shown to the emperor, he strongly expressed his indignation[150] that such an obstacle as this should have impeded his progress, and have rendered powerless the hearty endeavors of four hundred men, particularly as the fish had no such power when brought on board. According to the persons who examined it on that occasion, and who have seen it since, the echene?s bears a strong resemblance to a large slug. Some of our own authors have given this fish the Latin name of “mora.”[151] If we had not this illustration by the agency of the echene?s, would it not have been quite sufficient only to cite the instance 174 of the torpedo, another inhabitant also of the sea, as a manifestation of the mighty powers of Nature? From a considerable distance even, and if only touched with the end of a spear or a staff, this fish has the property of benumbing even the most vigorous arm, and of riveting the feet of the runner, however swift he may be in the race. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76684.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
