{"id":31336,"no":88,"title":"CHAPTER XVIII. PIGEONS.","content":"The pigeon will never desert its nest, unless it is either widower or widow. They manifest a great degree of affection for their offspring. When the female is sitting, the male renders her every attention that can in any way tend to her solace and comfort. The first thing that they do is to eject from the throat some saltish earth, which they have digested, into the mouths of the young ones, in order to prepare them in due time to receive their nutriment. It is a peculiarity of the pigeon and of the turtle-dove, not to throw back the neck when drinking, but to take in the water at a long draught, just as beasts of burden do. We read in some authors that the ring-dove lives as long as thirty years, and sometimes forty, without any other inconvenience than the extreme length of the claws, which with them is the chief mark of old age; they can be cut, however, without any danger. The voice of all these birds is similar, being composed of three notes, succeeded by a mournful noise at the end. In winter they are silent, recovering their voice with coming of the spring. Nigidius expresses the opinion that the ring-dove will abandon the place, if she hears her name mentioned under the roof where she is sitting on her eggs: they hatch their young at the summer solstice. Pigeons and turtle-doves live eight years. The sparrow, on the other hand, is short-lived in the extreme. Pigeons appear to have a certain appreciation of glory. They are well aware of the colors of their plumage, and the various shades which it presents, and even in their very mode of flying they court our applause, as they cleave the air in every direction. Through this spirit of ostentation they are handed over, fast bound as it were, to the hawk; for from the flapping of their 214 wings, their long feathers become twisted and disordered; while if they can fly without any impediment, they are far swifter in their movements than the hawk. The robber, lurking amid the dense foliage, keeps on the look-out for them, and seizes them at the very moment that they are indulging their vain-glorious self-complaisance. For this reason it is necessary to keep along with the pigeons the bird that is known as the “tinnunculus;” as it protects them, and by its natural superiority scares away the hawk. The hawk will vanish at the very sight of it, or the instant it hears its voice. Pigeons have a special regard for this bird; and, it is said, if one of these birds is buried at each of the four corners of the pigeon-house in pots that have been newly glazed, the pigeons will not change their abode—a result which has been obtained by some keepers of pigeons, by cutting a joint of their wings with an instrument of gold; for if any other were used, the wounds would be attended with danger.—The pigeon in general may be looked upon as a bird fond of change; they have the art, too, among themselves of gaining one another over, and so proselyting companions: we frequently find them returning to the cote attended by others which they have enticed away. Pigeons have frequently acted as messengers in affairs of importance. During the siege of Mutina, Decimus Brutus, who was in the town, sent despatches to the camp of the consuls fastened to pigeons’ feet. Of what use to Antony then were his intrenchments, and all the vigilance of the besieging army? or his nets, which he had spread in the river, while the messenger of the besieged was cleaving the air? Many persons have a mania for pigeons—building towns for them on the top of their roofs, and taking a pleasure in relating the pedigree and noble origin of each. Of this there is an ancient instance which is very remarkable; Lucius Axius, a Roman of the equestrian order, shortly before the Civil War of Pompey, sold a single pair for four hundred denarii, 215 so Marcus Varro tells us. Countries even have gained renown for their pigeons; it is thought that those of Campania attain the largest size. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76705.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
