{"id":31345,"no":97,"title":"CHAPTER V. THE MODE OF GOVERNMENT OF THE BEES.","content":"Let a man employ himself, forsooth, in the enquiry whether there has been only one Hercules, how many Bacchuses there have been, and all the other questions which are buried deep in the mould of antiquity! Here behold a tiny object, one to be met with at most of our country retreats, and numbers of which are always at hand, and yet, after all, it is not agreed among authors whether or not the king[194] is the only one among them that is provided with no sting, and is possessed of no other arms than those afforded him by his majestic office, or whether Nature has granted him a sting, and has only denied him the power of making use of it; it being a well-known fact, that the ruling bee never does use a sting. The obedience which his subjects manifest in his presence is quite surprising. When he goes forth, the whole swarm attends him, throngs about him, surrounds him, protects him, and will not allow him to be seen. At other times, when the swarm is at work within, the king is seen to visit the works, and appears 243 to be giving his encouragement, being himself the only one that is exempt from work: around him are certain other bees which act as body-guards and lictors, the careful guardians of his authority. The king never quits the hive except when the swarm is about to depart; a thing which may be known a long time beforehand, as for some days a peculiar buzzing noise is to be heard within, which denotes that the bees are waiting for a favorable day, and making all due preparations for their departure. On such an occasion, if care is taken to deprive the king of one of his wings, the swarm will not fly away. When they are on the wing, every one is anxious to be near him, and takes a pleasure in being seen in the performance of its duty. When he is weary, they support him on their shoulders; and when he is quite tired, they carry him outright. If one of them falls in the rear from weariness, or happens to go astray, it is able to follow the others by the aid of its acuteness of smell. Wherever the king bee happens to settle, that becomes the encampment of all. Happy omens are sometimes afforded by the swarming of bees, clustering, as they do, like a bunch of grapes, upon houses or temples; presages often of great events. Bees settled upon the lips of Plato when still an infant, announcing thereby the sweetness of that persuasive eloquence for which he was so noted. Bees settled in the camp of the chieftain Drusus when he gained the brilliant victory at Arbalo; a proof that the conjectures of soothsayers are not by any means infallible, for they consider this always of evil augury. When their leader is withheld from them, the swarm can always be detained; when lost, it will disperse and take its departure to find other kings. Without a king, they cannot exist. If food fail the inhabitants of any particular hive, the swarm makes a concerted attack upon a neighboring one, with the view of plundering it. The swarm attacked at once ranges itself in battle array, and if the bee-keeper should happen to 244 be present, that side which perceives itself favored by him will refrain from attacking him. They often fight, for other reasons, and the two generals are to be seen drawing up their ranks in battle array against their opponents. The battle is immediately ended by throwing dust among them, or raising a smoke; and if milk or honey mixed with water is placed before them, they speedily become reconciled. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2772/76714.html","bookId":1330,"book":{"id":1330,"title":"The Boys\u0027 and Girls\u0027 Pliny","description":"简介： In the little village of Como, in that province of Northern Italy called by the Romans Gaul-this-side-the-Alps, was born, twenty-three years after the coming of our Lord, Caius Plinius Secundus, known to us by the shorter name of Pliny. His boyhood w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2772","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
