{"id":22684,"no":6,"title":"Chapter 5: With Brigands.","content":"Stanley uttered an involuntary hurrah as the leopard expired; and at the sound the Burman, who had been lying motionless, leapt to his feet. He looked at the leopard, and then at his rescuer, and exclaimed in a tone of astonishment: \"You have slain the beast alone, and with no weapon but your knife!\" \"No,\" Stanley replied; \"I began the fight with my knife, only; but caught up one of those guns when I wounded him, and fired as he charged me. Then I finished him with the other.\" \"Comrade,\" the Burman said, \"you have done a great deed, with courage. I, who am esteemed no coward, would never even have thought of attacking that great leopard with but a knife, and that to save the life of a stranger.\" \"I saw the guns lying on the ground. Had it not been for that, I should not have dared to attack the leopard, for it would have been certain death.\" \"Certain death, indeed. But tell me, first, how you did it. It seems to me well nigh a miracle.\" \"I was passing along, not far distant, when I heard your cry,\" Stanley said. \"Thinking that it was some person in distress, I ran hither, and saw you both lying, with the leopard\u0027s forepaws upon you. The beast\u0027s back was turned to me and, as it was growling, it had not heard my approach. Seeing the guns lying there--and having no doubt that they were loaded--I stole up, sprang suddenly on the leopard, and drove my knife into it behind the shoulder. The blow rolled it over, and gave me time to pick up the gun. The rest was easy.\" The man, without a word, examined the body of the leopard. \"It is as you say,\" he said. \"It was well struck, and would probably have been fatal; but the animal would have torn you in pieces before he died, but for the guns. \"Well, comrade, you have saved my life; and I am your servant, so long as I live. I thought all was over with me. The leopard, as it sprang, threw its full weight on my comrade, here. We had just risen to our feet; and the blow struck me, also, to the ground. I raised that cry as I fell. I lay there, immovable. I felt the leopard\u0027s paw between my shoulders, and heard its angry growlings; and I held my breath, expecting every moment to feel its teeth in my neck. \"I had but one hope, namely, that the beast would carry off my comrade--who, I was well assured, was dead--to the jungle to devour him, and would then come back to fetch me. I managed to breathe once, very quietly, when I felt a movement of the leopard and, hearing a low sound, guessed that he was licking my comrade\u0027s blood; but slightly as I moved, the leopard noticed it, and stood straight up again over me. I dared not breathe again, but the time had come when I felt that I must do so, though I was sure that it would be the signal for my death. \"Then I knew not what had happened. There was a sharp pain as the leopard\u0027s claws contracted, and then there was a loud roar, and its weight was removed from me. Then I heard it snarl, as if about to spring. Then came the sound of a gun, a fall, and a struggle; and then the sound of another gun. Then I heard your shout, and knew the beast was dead. \"Now, sir, what can I do for you? Shall I first skin the leopard?\" \"I care not for the skin,\" Stanley said. \"It would be of no use to me.\" \"Then, with your permission, I will take it off, and keep it as long as I live, as a remembrance of the narrowest escape that I ever had.\" \"Is your comrade dead?\" \"Yes,\" the man replied. \"The leopard struck him between the shoulders as you see; and the force of the blow, and the weight of the spring, must have killed him instantaneously.\" \"Then I will take his sword, gun, and cartridges.\" So Stanley undid the sword belt, and buckled it round him; put the bandolier of cartridges over his shoulders; and took up the gun and reloaded it, while the man was at work skinning the leopard. This operation the man performed with great speed. It was evidently one that he had done before. As soon as the beast was flayed, he rolled up the skin and placed it on his shoulder. \"You are an officer, sir?\" he asked. \"No; I am a fugitive.\" While he had been watching the man, Stanley had debated over whether he should confide in him; and thought that, after the service he had rendered him, he could do so with safety. \"I am an Englishman--I was captured by Bandoola, at Ramoo, and sent a prisoner to Ava. I have escaped, and want to make my way down to Rangoon; but I heard that orders had been sent along the river to arrest me, and I do not, at present, know how to make my way down.\" \"Come with me,\" the man said. \"I have friends in the forest, some distance from here. They will receive you gladly, when I tell them what you have done for me; and you will be safe until you choose to go. We are outlaws but, at present, we are masters of the forest. The government has its hands full, and there is no fear of their disturbing us.\" Stanley thought over the matter, for a minute or two. Doubtless it was a robber band that he was asked to join, but the offer seemed to promise safety, for a time. \"I agree,\" he said, \"so that you do not ask me to take part in any deeds of violence.\" \"About that, you shall do as you like,\" the man said; \"but I can tell you that we make good hauls, sometimes. Our difficulty is not to capture booty, but to dispose of it. \"Have you a turban? For that helmet of yours is out of place, in the woods. The rest of your dress has nothing peculiar about it, and would attract no attention.\" \"I have a turban. I have been, lately, in the dress of a peasant. The cloth I wore lies fifty yards away; I dropped it as I ran. It will be useful to cover me at night, if for nothing else.\" Stanley exchanged the helmet for the turban that he had before worn, and fetched the cloth. \"Will you bury your companion?\" he said. \"It would be useless. He will sleep above ground, as well as below and, if we are to reach my comrades tonight, it is time for us to be moving.\" They at once set out. After five hours\u0027 walking, they came upon the river Myitnge, the tributary that falls into the Irrawaddy at Ava. It was some four hundred yards across. The Burman walked along its banks for a short distance, and then pulled from a clump of bushes a small boat, that was just capable of carrying two. He put it in the water. They took their seats, and paddled across to the other side; where he carefully concealed it, as before. \"That is our ferry boat,\" he said. \"It is not often used, for our headquarters are in the great forest we shall presently come to; but it is as well when, occasionally, parties are sent out to hunt us, to have the means of crossing to the other side.\" Another two hours\u0027 walking, through cultivated fields, brought them to the edge of the forest. \"Here you are as safe as if you were in Rangoon,\" the Burman said. \"In another hour we shall reach my comrades. As a rule, we change our headquarters frequently. At present there is no question of our being disturbed; so we have settled ourselves, for a time.\" \"Why were you and your comrade on the other side of the river? \"His village lies five miles beyond that forest,\" the man said. \"At ordinary times, he dared not venture there; but he thought that, at present, most of the able men would be away, and so he could pay a visit to his friends. He asked me to accompany him and, as I had nothing better to do, I agreed to go. A convoy of traders, too strong to be attacked, had passed down from the hill country the morning before we started. There was not much probability that anyone would come again, for a few days.\" \"They bring down rubies from there, do they not?\" \"The mines are the property of the emperor,\" the man said, \"and the gems are sent down, once every two months, under a strong guard; but for all that, many of the traders bring rubies down from there--of course, secretly. The men who work the mines often conceal stones that they come upon, and sell them for a small sum to the traders; besides, sometimes the peasants pick them up elsewhere--and these, too, make haste to sell them for anything that they can get. We do not care for them much, for it is a risky business going down to Ava to sell them; and the traders there, knowing that, at a word from them, we should be arrested and most likely executed, will give us next to nothing for them. We prefer silver and lead for money; and garments, arms, and set jewels. \"Each man takes his share of what is captured and, when we have enough, we go home to our villages. A pound of silver, or two or three pounds of lead, are generally quite enough to buy the goodwill of the head man of the village. We give out that we have been working on the river, or in Ava, since we left; and everyone knows better than to ask questions.\" In another hour, they reached the encampment. It was now dusk, and some five-and-twenty men were sitting round a great fire. A number of leafy arbours had been constructed in a circle beyond them. \"What, returned so soon!\" one of the men said, as Stanley\u0027s guide came near enough for the firelight to fall on his face; \"but where is Ranji, and whom have you brought here--a new recruit?\" \"Not exactly, Parnik, but one to whom I have promised shelter, for a while. Ranji is dead. I should have been dead, too, and eaten; had it not been for my comrade, here. Here is the skin of the beast who slew Ranji and, when I tell you that the leopard stood with one paw on me, you may guess that my escape was a narrow one.\" \"The brute was a large one,\" one of the other men said, as Meinik--for such was the name of Stanley\u0027s companion--unrolled and held the skin up. \"I see it had a bullet between the eyes, and another just behind the ear; and there is a knife cut behind the shoulder. It must have been hot work, when it came to knives, with a beast of that size.\" \"Give us some food, and cocoa; we have eaten nothing today, and have walked far. When we have fed, I will tell you my story.\" The Burman\u0027s recital of the adventure with the leopard excited great applause, and admiration, from his comrades. \"\u0027Tis wonderful,\" one said, \"not so much that our new comrade should have killed the leopard, though that was a great feat; but that, armed only with a knife, he should attack a beast like this, to save the life of a stranger. Truly I never heard of such a thing. Has he all his senses?\" Meinik nodded. He had received permission from Stanley to say who he was. Stanley had consented with some reluctance, but the man assured him that he could trust his companions, as well as himself; and that it was much better to tell the truth, as it would soon be seen that his features differed altogether from their own and that, therefore, he was some strange person in disguise. \"He is in his senses,\" he said, \"but he does not see things as we do. He is one of those English barbarians who have taken Rangoon, and against whom our armies are marching. He was captured at Ramoo; and sent by Bandoola, as a prisoner, to Ava. He has made his escape and will, in a short time, go down the river; but at present the search is too hot for him. So you see that he is, like ourselves, a fugitive.\" \"What is his age?\" one of the men asked, after a silence, during which they all gazed at the newcomer. \"He is but a lad, being as he tells me between sixteen and seventeen; but you see his skin is stained, and his face marked, so as to give him the appearance of age.\" \"If the men of his race are as brave as he is, Meinik, our troops will truly have harder work than they think to drive them into the sea. Does he speak our tongue?\" \"Yes,\" Stanley answered for himself. \"I have been more than two years in the province of Chittagong, and learned it from one who was in our service.\" \"And would many of your people risk their lives in the way you did, for a stranger?\" \"Certainly. Many men constantly run risks as great to save others.\" \"One life is all a man has,\" the Burman said. \"Why should he give it for a stranger?\" \"I don\u0027t think that we stop to think of that,\" Stanley said. \"It seems to us natural that if we see another in danger of his life, we should try to save it; whether it is a man or woman, whether it be from fire or from any other fate.\" \"You must be a strange people,\" the Burman said gravely, \"and I should scarce have credited it, had I not heard that you had done it, yourself. But it is wonderful; and you, too, a lad who has not yet come to his full strength. \"We should be glad to have such a man for our comrade, my friends. Whether he be Burman or English matters little. He has risked his life for one of us; and he is our brother as long as he likes to stay with us.\" There was a warm exclamation of assent, round the circle; and Stanley felt that he had no cause for uneasiness, as long as he remained with them. In the evening the men sang many songs and, at their request, Stanley sang some English ones, choosing some with lively airs. The Burmese were much pleased and surprised at these, and joined merrily in the chorus. Half a dozen of them then set to work with their knives, cut down some saplings and boughs, and constructed for Stanley an arbour similar to the others; and he lay down well satisfied with the results of his adventure, and feeling that he could remain with these merry fellows, criminals though they might be, until it would be safe to make his way down the river. In the morning the men started early, leaving him in charge of the fire. They went off in parties of four or five, to watch the various roads leading to the capital; two or three of them, dressed as peasants, going to towns where travellers would halt, so as to gain information as to any party coming down. When they gathered again, at dusk, one party only had had any success. They had met six merchants coming down with horses laden with spices, indigo, and cotton. These had offered no resistance, and they had taken as much as they could carry, and then allowed them to go on with the rest of their goods. There was a general feeling of regret that the party had not been more numerous; and some expressions of anger, at the spies on the road by which the traders had come, for not letting them know beforehand, so that they could have placed their whole force there and carried away all the goods. \"These are the things that suit us best,\" Meinik said to Stanley. \"You see, one can go down with a parcel of cinnamon or pepper, or a bag of dyes, or fifty pounds of cotton into the town; and sell it in the market, at a fair and proper price. Of course, one dresses one\u0027s self as a small cultivator; and there is no suspicion, whatever, that all is not right. \"We shall keep a sharp lookout for the men, as they come back again, and relieve them of the silver or goods they may have taken in exchange; that is, if they come by the same road--but it is more likely that, after their adventure today, they will choose some other, or take a guide and travel by village tracks. No doubt they think that they have got off easily, for they have not lost more than a quarter of their goods. It is war time now, and there is no fear of a force being sent against us; but usually we do not take so much as a quarter of the merchandise. Were they to lose everything, they would make complaints; and then we should have a force sent up against us, and be obliged to move away, for a time. But as it is, they are so pleased with getting the greater part of their goods safe to market that they do not care to make a fuss about it; for they might have to pay the court officials, and others, more than the value of the goods lost.\" \"They do not often resist, then?\" \"Not often. If a man loses his goods, he can gather more again; but when his life has gone, everything has gone. Besides, as a rule we take care that we are so strong that they see, at once, that resistance would be hopeless. Sometimes they bring armed guards with them. These are men who make it their business to convoy traders down, when the times are troubled. Sometimes we have fights with these but, as a rule, we seldom attack them unless we are so strong that they do not dare to oppose us. Still, we do have fights sometimes, for these Shan guards are brave fellows. Their convoys are generally rich ones, for it would not pay small traders to hire men to protect them. \"In times of peace, we seldom stop long in one neighbourhood for, when it once becomes known what road we are lying near, they come along in parties too strong to be attacked and, as it matters little to us where we live, we move away perhaps a hundred miles, and then settle on another line of traffic. We have not been here long; we were last down by Tannoo, and did well for a long time there; until at last the governor raised all the villagers, and hunted the woods, and we found that we had to leave. I expect we shall stay here some time, now. There is no fear of troops being sent out, and we can afford not to press too hardly on travellers; for we have done so well, of late, that we could separate and return to our homes, each with a good store of booty. Half our number did leave, when we came up from the south; and more of us would go, if it were not for this order that everyone shall join the army. It is much pleasanter to live here, free to do as we like, than to be driven down like a herd of beasts, to fight. Besides, we have no quarrel with your people. It was the officials at Aracan who began it; let them fight, if they like.\" Stanley remained a fortnight with the band. At the end of that time, they heard that a party of thirty traders were coming down together, and that they had with them ten armed guards. This, they no doubt supposed, was ample protection for, as the band generally worked in such small parties, it was believed that there were but a few outlaws in the forest. All the band went out, and returned in the evening, laden with spoil. Two or three of them were wounded, but not severely. \"So you had resistance today, Meinik.\" \"It lasted only for a minute,\" the man said. \"As soon as they saw how strong we were, the guard were glad enough to put up their swords and let us bind them hand and foot, while we searched the merchants. As you see, we have made a good capture, though we have not seized more than a fifth of what they brought down with them; but it will take them some time to pack their bales again, for we searched everything thoroughly, and made all the merchants strip, and searched their clothes and their hair.\" \"What did you do that for?\" \"Well, it was this way. I said to my comrades, as we went along this morning: \"\u0027The Englishman is going to leave us, in a day or two. I have not forgotten what I owe him, and should like to make him a present. I propose that we search all the party thoroughly, today. From what we heard, some of them come from the ruby country, and are pretty sure to have gems concealed about them, or in their baggage. I propose that all the stones we find we will give to our friend.\u0027 \"They all agreed at once for, as you know, they all like you; and rubies, as I told you, are of little use to us, for we cannot dispose of them without great risk. So they did as I proposed, and had good fortune. Twelve out of the number had gems hidden about them, and some of them a good lot. You need not hesitate to take them, for you may be sure that they bought them, for next to nothing, from poor fellows who had risked their lives to hide them. \"There they are. We have not looked at them, but just emptied the parcels into this bag, as we found them. Of course, they are all rough stones. You must take them as a present, from all of us; and as a proof that a Burman, even if he is but a robber, is grateful for such a service as that you rendered him.\" Stanley felt that he could not refuse a gift so offered, even though the goods were stolen. As Meinik said, the gems were of little use to the robbers, since they were afraid to try and dispose of them; and their owners had themselves broken the law in having purchased them, and had doubtless given sums bearing no proportion to their real value. Therefore he thanked Meinik very heartily; and also, after they had had their meal, the rest of the band, who made very light of the matter. The things were useless to them, they said. If it had been silver, or even lead, it would have been different; but to endeavour to sell rubies they had to risk their lives. The goods that they had got that day would fetch them far more money than the rubies, and could be sold without difficulty and, as soon as the war was over and they could go down to their villages, the band would break up. They had enough silver and lead hidden away to keep them for years, even if they never did any work, whatever. \"What do you do with it, when you get back?\" \"We hide it. It would never do to enter a village with ten or twelve pounds\u0027 weight of silver, and three or four times as much lead, for the headman might take it into his head to have us searched. So we generally dig a hole at the foot of a tree, in some quiet spot; and take, perhaps, a pound of silver and two or three of lead with us. A gift of half that silver is enough to convince the headman that we are honest fellows, who have been working hard since we went away; and from time to time we can go to our store and get what we want from it, and can build a house and marry, and take up a field or two, and perhaps become headmen ourselves, before very long.\" \"Well, I am sure I wish you all well,\" Stanley said. \"You have all been very kind to me, since I joined you; and I shall be glad to think of you all as settled quietly down in your villages, rather than as remaining here when, some day or other, you might all be captured and harm come to you.\" The next morning Stanley started with Meinik, who was a native of a small village on the river, some forty miles below Ava, and who had resolved to accompany him down to Rangoon. \"I shall be able to get a boat and some nets, for a pound or two of lead. If we are hailed, I can do the talking; and can land and buy provisions, if wanted. I have arranged with my comrades to take my share of the silver and lead we have stored up, at once; for it is likely that they will also have gone to their homes before I shall have returned, and we have changed everything into money, except what we took yesterday.\" Before starting Stanley was again dyed, and the tattoo marks imitated--far more carefully than before, three or four of the men operating upon him, at once. His face was almost entirely covered with these marks. Some liquid was applied that extracted the colour from his eyebrows, and left them snow white. Some of his hair was similarly treated and, looking at himself in a pool of water, Stanley did not in the slightest degree recognize himself; and felt certain that no one would suspect him of being the young English captive. Resuming his peasant\u0027s cloth, he took a hearty farewell of the band and started with Meinik. The latter carried a bundle, slung on his gun. It contained some clothes, and did not look heavy; but in the centre were two parcels that weighed some forty pounds. Stanley carried a bundle with his other clothes, and several pounds of rice. Two days\u0027 walking took them to Meinik\u0027s village. Once out of the forest they travelled at night, and reached the village just as the people were astir. The place consisted of ten or twelve huts, and Meinik created quite an excitement among the few people who inhabited it. These consisted of two or three old men, some women, and children. \"Where have you been for the last year and half, Meinik, if I may ask?\" \"Working near Ava,\" he said; \"but as I should have to go to war if I had remained there, I thought that I would come back, and see how you all were. I have saved a little money, and may settle down; but whether here or elsewhere I have not yet made up my mind.\" \"You will have to go to the war,\" one of the old men said. \"There is scarce a day that one of the war canoes does not stop here, to see if there are any able-bodied men. They have taken eight, and they will assuredly take you.\" \"Then I shall get a boat,\" he said, \"and take to fishing. The war cannot last long, and I shall do my best to keep out of the way of the war canoes, until it is over. If any of you have a boat to sell, I will buy it.\" \"I will sell you mine,\" the old man said. \"Both of my sons have been taken to the war, and I am too old to work it myself. It is a good one; my sons made it only last year. \"Whom have you with you?\" Stanley had remained a short distance off, while Meinik was talking to his friends. \"He is an old man I joined along the road,\" he said. \"He is a skilful fisherman; and he has agreed to go with me, if I can get a boat. \"Is there an empty hut?\" \"Yes, six of them. Of course, when the men were taken they carried off the wives and children, as usual, as hostages for their conduct.\" Meinik nodded. He felt no surprise, as it was the custom in Burma to hold the women and children of all the men going to the war, as guarantees that their husbands would not desert or show cowardice in battle. In either event their relatives would be, at once, put to death. \"My companion is tired,\" he said. \"We walked all night, so we will cook some food and he will sleep.\" They at once took possession of one of the empty huts, which was just as it was left by its proprietor. One of the women brought a brand or two from her hearth. An earthen cooking pot was filled with water and placed above it, and a few handfuls of rice dropped in. Two or three snakes, cut up into small pieces, and some pepper pods were added; and then Meinik went out, talked to his acquaintances, and arranged for the purchase of the boat. Stanley watched the fire. In an hour, Meinik returned. \"The boat is a good one,\" he said, \"and the nets in fair order. I have bought them for two pounds of lead; and have promised that, when the war is over and the man\u0027s sons return, it is to be free to them to buy it back, at the same price.\" After eating their meal, they both lay down and slept until late in the afternoon. Then Meinik bought an earthenware pot, and a flat slab of the same material for making a fire on; some peppers and capsicums, and a little cinnamon and nutmeg; a basket of mangoes, and some tobacco. As soon as it became dusk, they took their places in the boat, Meinik carrying down two or three faggots of wood. The boat was a canoe, hewn out of a pine log. It would have carried four people comfortably, and there was plenty of room for them both to lie down at full length. It was very light, the wood having been cut away until it was little thicker than cardboard. This was the almost universal method of construction: even the war canoes, that would carry sixty paddlers--sitting two by two on a bench--and thirty soldiers, being hewn from great single logs of teak. The nets were stowed one, at each end. In the middle was the fireplace, on which the brands of the fire had already been laid. Near it were the faggots and stores. Meinik and Stanley sat on the nets, each with a paddle. The former had hidden the greater portion of his store of money in the ground, before entering the village. As soon as they had fairly started, Stanley said: \"Had we not better get rid of the fire, Meinik? Its light would draw attention to us.\" \"That matters little,\" the Burman replied. \"There are not likely to be war canoes about at night, and I expect that most of them will have gone down the river. People fish either by night or by day and, even if a war canoe came along, they would not trouble about it for, of course, many men too old to go to the war remain here, and go on fishing. People cannot starve because there is fighting. The old men and women must cultivate the fields and fish, or both they and the people of the towns would starve. \"Many even of the young men do not go. They keep away from their villages during the day, and work in the fields; and the headmen shut their eyes, for they know that if the fields are not cultivated, the people cannot pay their share of the taxes. \"Still, it is as well to be on the safe side. When the fire has burnt low we will lay a cloth over the top of the boat, so that the glow of the embers will not be seen.\" They kept their course near the middle of the river; partly because the current there was stronger, partly because any war canoes that might be coming up would keep close to one bank or the other. They kept on their way until there was a faint gleam of light in the sky; and then paddled into the shore, chose a spot where some bushes drooped down into the water and, forcing the canoe in behind these, so as to be entirely concealed from the sight of any passing boat, cooked some food and, having eaten their breakfast, lay down and slept until evening. Illustration: They forced the canoe behind bushes, so as to be entirely concealed. Night after night the journey was continued. Their supply of food was ample to last them; and there was, therefore, no occasion to stop at any village to purchase more. The river, at the point where they started, was about two miles wide; but at some points it was double that width, while at others it contracted to little over a mile. Its level was much lower, now, than it had been when Stanley ascended it, two months before. Sometimes at night they towed one of their nets behind them, and obtained an ample supply of fish for their wants. Each night they made, as Stanley calculated, about forty miles and, after ten days\u0027 travel, they came to the point where the great river divided, one small arm running down to Rangoon; another descending to Bassein, and then falling into the sea at Cape Negrais; while a large proportion of the water found its way down by innumerable branches between the Rangoon and Bassein rivers. For the last two or three days they had been obliged to observe great caution for, below Prome, there were numbers of boats all going down the river laden with men and stores. These, however, only travelled by day; and the canoe was always, at that time, either floating in the shelter of bushes, or hauled up on the bank at spots where it could be concealed from view by thick growths of rushes. \"We shall never be able to get down to Rangoon by water,\" said Meinik. \"The river will be crowded with rowboats near the town; and there will be no chance, whatever, of making our way through them. At the next village we come to, I will go in and learn the news. Your countrymen may have been driven out by this time and, in that case, there will be nothing to do but to travel north on foot, until we reach Chittagong.\" \"I have no fear that we shall be driven out, Meinik.\" This conversation had occurred on the night when they had passed the point of division of the two arms of the river. They had caught a larger supply of fish than usual and, as soon as the boat was laid up, Meinik started along the bank, with a number of them, for the nearest village. He returned in two hours. \"It is well I landed,\" he said, \"for the point where the greater portion of our people are gathered is Henzawaddy, only some fifteen miles further on. \"You were right; your people have not been driven out. A large number of our troops are down near Rangoon but, in the fighting that has taken place, we have gained no advantage. Your people marched out at the end of May, carried a stockade; and advanced to Joazoang, and attacked some villages defended by stockades and carried them, after having killed a hundred of our men. Then a great stockade on a hill near the river, three miles from Rangoon--which our people thought could not be taken, so strongly was it protected--was attacked. The guns of your people made a great gap in a stockade a mile in front of it. Two hundred men were killed, and also the commander. \"Then your people marched on to the great stockade at Kemmendine. Your troops, when they got there, saw how strong it was and were afraid to attack it. They lay down all night, close to it; and we thought we should destroy them, all when they attacked in the morning; but their ships that had come up with them opened fire, at daybreak. As the stockades were hidden from the sight of those on the river, we had thought that the ships could do nothing; but they shot great balls up into the air, and they came down inside the stockade, where they burst with an explosion like the noise of a big gun; and killed so many that the troops could not remain under so terrible a fire, and went away, leaving it to your people to enter the stockade, without fighting.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3163/86803.html","bookId":871,"book":{"id":871,"title":"On the Irrawaddy","description":"简介： A party was assembled in a room of an hotel in Calcutta, at the end of the year 1822. It consisted of a gentleman, a lady in deep mourning, a boy of between fourteen and fifteen, and two girls of thirteen and twelve....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3163","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
