{"id":19232,"no":28,"title":"Chapter 27","content":"Nancy had big hands and big feet. He didn\u0027t like his name. He thought it was a girl\u0027s name. None of the other children in Mrs. Jewls\u0027s class thought that Nancy\u0027s name was odd. They didn\u0027t think of it as a girl\u0027s name or as a boy\u0027s name. Nancy was just the name of the quiet kid with the big hands and feet who sat over there in the corner next to John. Nancy was very quiet and shy. He was ashamed of his name. He had only one friend, a girl who went to class on the twenty-third story of Wayside School. They were friends for a good reason. He didn\u0027t knowher name, and she didn\u0027t know his. 108They just called each other \"Hey, you,\" or just plain \"You.\" Nancy was afraid to ask his friend what her name was because then he might have to tell her his name. He never could figure out why she never asked. But he was happy just to leave well enough alone. One morning, Nancy and his friend were late. When they got to the twenty-third story, his friend\u0027s teacher was waiting outside. \"Hurry up. You\u0027re late, Mac,\" said the teacher. Nancy\u0027s friend turned red. She didn\u0027t move. \"Come on, Mac, shake a leg. Get the lead out,\" said the teacher. \"Your name is Mac!\" said Nancy. Mac was very pretty. She had red hair and freckles. She covered her face and ran into the room. \"My name is Nancy!\" Nancy called after her. Mac stepped back outside. \"I was ashamed to tell you my name,\" she said. \"Me, too,\" said Nancy. \"Nancy\u0027s a girl\u0027s name.\" \"Oh, I think it\u0027s cute,\" said Mac. \"I like the name Mac,\" said Nancy. \"Mac is a boy\u0027s name,\" said Mac. \"My mother has a rich aunt named Nancy,\" said Nancy. \"That\u0027s why she gave me the name.\" \"My mother once had a dog named Mac,\" said Mac. \"Hey, do you want to trade?\" Nancy asked. \"Can we?\" asked Mac. \"I don\u0027t see why not,\" said Nancy. \"Okay,\" said Mac. They both spun around one hundred times in opposite directions until they were so dizzy that they fell over. 109When they stood up, Mac was Nancy and Nancy was Mac. They said good-bye. Then Mac raced up to Mrs. Jewls\u0027s room. He was no longer shy. \"Hi, everybody. My name\u0027s Mac,\" he announced. \"I traded names.\" He held out his big hand. Todd jumped up and shook it. \"Hi, Mac,\" he said. \"Glad to meet you.\" \"How you doin\u0027, Mac,\" said Ron. \"Howdy, Mac,\" said Terrence. \"Nice to see you, Mac,\" said Bebe. \"You traded names?\" asked Jason. Jason didn\u0027t like his name, either. \"That\u0027s right, Jason, old boy,\" said Mac. \"Is that allowed?\" asked Jason. \"Why not!\" said Mac. \"Hey, anybody want to trade?\" Jason called. \"I\u0027ll trade with you,\" said Terrence. He didn\u0027t like his name, either. \"Wait. I\u0027ll trade with you, Terrence,\" said Maurecia. Maurecia didn\u0027t like her name. \"No. He\u0027s trading with me,\" said Jason. \"I\u0027ll trade with you, Maurecia,\" said Dameon. \"No, thanks,\" said Maurecia. \"I\u0027ll trade with you, Dameon,\" said Mrs. Jewls. \"No, I want to be Mrs. Jewls,\" said Stephen. It turned out that nobody in Mrs. Jewls\u0027s class liked his name. The children all spun around in different directions until they got so dizzy that they fell over. And when they stood up again, nobody knew who anybody was. 110\"What are we going to do, Mrs. Jewls?\" asked Leslie, who was really Eric Bacon. \"My name is not Mrs. Jewls. It\u0027s Maurecia,\" answered Terrence, who was really Jason. \"It is not. I\u0027m Maurecia,\" said Deedee, who was really Joe. \"You\u0027re both wrong,\" said Maurecia. \"I\u0027m Mrs. Jewls.\" This went on for an hour. At last they figured out who the real Rondi was. She was missing her two front teeth. After they figured out Rondi, they were able to get Allison pretty easily. And then from there they got D.J., Dameon, and Mrs. Jewls. She was the oldest one. Eventually they figured out who everybody really was. They had some difficulty deciding which Eric was which, and actually they are still not absolutely sure. Everybody just decided to keep his own name. The children didn\u0027t like them, but it made things much easier. Mac and Nancy kept their new names. But when they were together they still called each other \"Hey, you,\" or just plain \"You.\"","sourceLink":"http://novel.tingroom.com/ertong/1988/56834.html","bookId":627,"book":{"id":627,"title":"歪歪小学的荒诞故事 Sideways Stories from Wayside School","description":"简介： 当路易斯．萨奇尔还是学生时，他的老师们总是念错他的名字。现在，他变成有名的童书作家，不同地方的老师还是念错他的名字。在他们家族，这个姓氏的发音是萨「克」尔，但事实上这个字正统的发音为萨「奇」尔，你说怪不怪。三十层楼的教室里，有个很坏的老师，你不乖，她...","cover":"http://novel.tingroom.com/file/upload/201802/28/11-07-35-80-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1988","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
