{"id":101146,"no":18,"title":"Page 18","content":"\\n\\n “Hold supper,” Markéta commanded. “I don’t know when I shall return.” When, or if, though she would never add fear to the maid’s scent by saying such a thing. The maid agreed, and Markéta was out the door to the coach before her manservant could lend a hand.\\n\\n The pair of matched bays before the carriage tossed their heads and whickered uncomfortably. Markéta quenched the urge, as she always did, to put her hand beneath their noses and drive their discomfort to madness. Animals knew; they always knew. Horses shied from her, and even the most aggressive dogs snarled and backed away. Cats stood wary, one paw lifted, then disappeared into darkness. Only humans saw nothing more than the girl she presented as; only humans were so blind.\\n\\n “Miss Alvarez.” The coachman opened the door, but it was the man within who offered his hand to help her up. Radcliffe, not Thomas, and his expression lit with sly pleasure at her surprise. “I was so crass as to insist I be allowed to escort you, Miss Alvarez. My town house is so much nearer your home than Master Thomas’s. It seemed unkind to make his man come all this way, when I was obliged to pass you regardless.”\\n\\n “I’m delighted. The journey will go so much more quickly with pleasant company.” Markéta drew her skirts in, childishly pleased she hadn’t frightened the horses after all. “Your horses are very fine.”\\n\\n “Thank you. My family breeds them on our country estate. It is, I’m afraid, the source of our income: gross commercial ventures in horseflesh. Are you shocked, Miss Alvarez?”\\n\\n “I should think a man able to persuade a thousand pounds of beast to his will would be a firm and fair hand with a household as well. What woman would find that anything but enticing? You must have a fair stretch of land, then, Master Radcliffe.” For a moment the city houses outside the window slipped away, turning in her mind’s eye to pastures and rolling green hills.\\n\\n “Enough,” Radcliffe admitted. “My favorite stretches are the woods. We have several, some of them very old and peaceful.”\\n\\n “And unriddled by wolves,” Markéta said softly. “How lonely for them.”\\n\\n “For the woods, or the wolves?” Radcliffe wondered, and when she glanced at him, lifted his eyebrows. “You disapprove of the hunt.”\\n\\n “I believe I said I had a peculiar interest in it, sir.”\\n\\n “You did, but it was my thought that the words said something entirely other than the heart felt. Forgive me my presumption. I did not mean to offend.”\\n\\n “No,” Markéta said, softly once again. “You have not.”\\n\\n He put a hand over his heart, and took the topic to the pleasant inconsequentiality of the season’s fine weather, but her gaze strayed to him time and again and she wondered what else he had heard, that she had not said.\\n\\n Alistair Thomas greeted them with her mother’s pelt in hand.\\n\\n Society had rules of engagement, meaningless twitter of words like so much hurried birdsong; Markéta knew she must be participating in that, because there would be a resounding, deadly silence if she were not. She did not admire the pelt; that much she was certain of, because Thomas’s pleasure in displaying it faltered. Radcliffe was reserved, allowing precisely what Thomas had insisted on: that it was a new fur, recently taken, and so there had indeed been wolves on England’s shores more recently than he’d known. Markéta had no idea what she herself said, nor how she could say it with any degree of calm.\\n\\n The fur’s scent was so long gone it might never have been, but even without scent, without life, it could be no one other than her mother. The darker grey streaks above once-yellow eyes had made her fierce, and stripes of white on her muzzle had given her canines extra length to threaten both prey and ill-behaved pups with. She had been mother to the pack, and to see her reduced to a flopping length of skin turned Markéta’s insides cold and hard.\\n\\n “Did you join this hunt?” She barely knew her own voice, dissonance ringing through it. Worse than dissonance: she could hear the wolf in her voice, even if the men couldn’t. It wanted to howl, and only stringent human decorum kept her from letting it loose.\\n\\n Disappointment flashed over Thomas’s face. “My father wouldn’t have it. I was a poorer shot than I might have been, and he wouldn’t risk me or the hunt on it. Three men died that day even so.”\\n\\n “And how many wolves?”\\n\\n “Nine.” Another man’s voice, deeper and richer than Alistair’s, broke in, and was accompanied by a clatter of footsteps on marbled stairs. Markéta startled, knowing it to be a violent reaction, but there had been nothing to her beyond her mother’s fur in Alistair’s hands. Only lately did she look upward, take in the echoing length of hall they’d been ushered into, its walls mounted with animal heads and its ceiling painted with scenes of the hunt. And this a town house, she thought; the country estates would be exhausting in their attention to murderous detail.\\n\\n The man on the stairs was as unlike his son in form as could be, an oak to a sapling. He carried no extra weight, just size, and his chiding was good-natured. “Al, you can’t intend to leave our guests in the foyer all afternoon. Forgive my son, madam, master. His enthusiasm at times overwhelms his sense. I’m Alan Thomas, Lord Thomas if you must, though too much ceremony is tedious. And you must be Miss Alvarez. Master Radcliffe. My home is yours, won’t you come in?”\\n\\n Radcliffe guided her forward when her own feet wouldn’t take her. Her breath was lodged in her throat, stuck there by tar and blackness as Alan Thomas’s scent rolled down the stairs with him. She had thought him a black devil, not fair and jovial, but the taste of blood and death clung to him without remorse. She managed a curtsy so stiff it hurt her knees, but Lord Thomas took no offense. Instead he looked her over, then threw a tobacco-stained smile toward his son.\\n\\n “This is the young lady with the interest in the hunt? You could hardly have found better, Alistair. Look at her coloring, those eyes, she could be a wolf herself. Oh, Lord forgive me, I’m as rude as he is. I’m a man who speaks my thoughts, Miss Alvarez. Perhaps you won’t hold it against me.”\\n\\n “Do you favor women who speak theirs, my lord?” Her voice was strangled in her throat, and Radcliffe, unexpectedly, put his hand at her spine, a show of—not lending strength, she thought. Of solidarity, as her mother had once stood by the pack leader.\\n\\n Lord Thomas’s eyes narrowed, making him suddenly wolfish himself. Not so convivial after all, for all that his gaze was the ice blue of a cub and not gold like an adult. “Would you think it fair, Miss Alvarez, if I said I’d met few women who voiced their thoughts? Whether they have none or whether society has trained restraint into them, I cannot say, but a woman of reason and consequence is a rare thing, in my view.”\\n\\n Her vision was not good: she saw few colors, and her focus was that of a hunter’s, honing in on a single individual. But it worsened now, until Thomas stood out against a blurred background, prey for the hunting. “Then I will endeavor to impress upon you that a few of us, at least, are as capable of matching wits as any man, my lord.”\\n\\n “I look forward to it. So you have an interest in the hunt. Do you ride, Miss Alvarez? Can you shoot?” Lord Thomas escorted them into sitting rooms so opulent Markéta might otherwise have laughed. Crystal turned sunlight to shards of light glittering across parquet floors, and overstuffed chairs were gathered to make different sitting areas. One was by the unlit fire, but they were guided to seats overlooking the gardens. A wolf’s pelt, older than her mother’s, lay across one of the sofas, and Alistair tossed her mother’s there with as little regard.\\n\\n Markéta sat there so she would at least not have to look at the furs. Alistair Thomas sat beside her, casting a subtle glance of victory toward Radcliffe, who gave no signs of noticing as he settled into a chair across from them. Lord Thomas dropped into another armchair, but leaned forward, gaze avid as he awaited Markéta’s answer.\\n\\n “I’m afraid I’m a poor rider, my lord. Horses do not like me. And the sound of a rifle hurts my ears.”\\n\\n Polite doubt crawled into his expression. “How then can you be enamored of the hunt?”\\n\\n “I can track.” Again, Markéta barely knew her own voice. She had spent so long training the snarls and yips out of it, so long working away the growl so all that was left was a pleasant alto. But she bit off the words as though her teeth were long and sharp, and no man who called himself a hunter could mistake the challenge behind them. “What I track, I can kill. What else is there to the hunt, my lord Thomas?”\\n\\n His lips peeled back from his teeth in what might have been a smile. “No one can always kill what they track, Miss Alvarez. Not even I, and I have many more years experience than you.”\\n\\n “Almost always,” Markéta whispered, “is often enough.”\\n\\n Alistair shifted uncomfortably on the seat beside her. “Surely this isn’t an appropriate discussion to hold with a young lady, Father.”\\n\\n “Oh, on the contrary.” Wicked delight gleamed in Radcliffe’s eyes. “I think it most fascinating. Perhaps a wager, if Miss Alvarez is willing. You have extensive gardens here, Lord Thomas. Dare you pit your tracking skills against the lady’s?” \\n\\n","sourceLink":"https://allnovel.net/running-with-the-pack/page-18.html","bookId":2622,"book":{"id":2622,"title":"Running with the Pack","description":"Storyline: Remember the werewolves of classic stories and films, those bloodthirsty monsters that transformed under the full moon, reminding us of the terrible nature that lives within all of us? Today\u0027s werewolves are much more suave - and even sexy - and they\u0027ve moved from British moors to New York City lofts, shaved, and got jobs. But as the tales of these writers will show you, they remain no less wild and passionate, and they still tug at the part of our being where a wild animal used to be. Running With the Pack includes stories from Carrie Vaughn, Laura Anne Gilman, and C.E. Murphy, and they will convince you that despite their gentrification, werewolves remain as fascinating and terrifying as ever.\\n","cover":"https://allnovel.net/images/running-with-the-pack.jpg","author":"Ekaterina Sedia","type":"Horror","source":"allnovel","link":"https://allnovel.net/running-with-the-pack.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 9:56:43 PM"}}
