{"id":101171,"no":43,"title":"Page 43","content":"\n Another day passed, lethargic and soggy. Yvette dreamed of being a mother, envisioning her children as a bouncing brood of vamplings or gobblekins. The consequences were so dire. Why did it have to be binary? She imagined how pussy willows wiggled in the wind so they wouldn’t break. Was the process like having a totem animal? Perhaps body modification would help with her transition. Whiskers implanted, stripes tattooed and teeth filed to little points. And, suddenly, her nightmares weren’t always about being a vampire or a goblin. She felt less weird, occasionally picturing her dream self as a wolf-creature. She would need surgery to make her outsides as freaky as her insides, but it struck her as a splendid compromise. She fell back asleep, briefly.\n When Yvette woke, she was licking her lips and horrified to be doing it. White roses had been delivered. And they were turned inside out, puckered by the rapid advance of her sorrowful condition.\n It was still called Willis \u0026 Rothgate, even though Dr. Rothgate’s presence was barely felt. New crops of bispecials meandered in and crept out. Yvette stood still while the world of sickness, wellness and horrible compromises scrolled past her. Over time, it felt less and less natural, more and more artificial.\n Even though they’d said they weren’t coming back until she’d made up her mind, Yvette’s parents did finally return. They spoke in harsh but hushed tones.\n “We heard you’re considering vampire,” her father said.\n “I’d rather die.”\n “Then perhaps you’ve decided on goblin,” her mother said.\n “Have I mentioned that it’s not like a costume party? I don’t know who I want to be. The whole thing’s permanent, you know. The last thing I want is to despise myself for choosing to be someone I shouldn’t be.”\n “Permanency’s better than trickery. You’re going to have to live your consequences,” her parents said in unison.\n Yvette called several candystripers and demanded that they show her mother and father out. Yvette pretended that her parents would’ve apologized if she’d given them enough time. But she knew it was pretense. She invented people inside her head because it was better than being let down, continuously, by everyone she’d ever met.\n The flat sterility of the halls and walls had greater echoes of life than Yvette did. Every breath was drudgery. She shambled to her room. The mood music played one of the Berlioz symphonies about getting hanged then some mopey darkwave ballad that Yvette kind of liked. She thought she’d smashed the machine. For now it was okay, but she’d imagine smashing the stupid thing again if she had to, in dreams or reality or somewhere in between, whatever it took to scrabble together a half-pretty sense of place . . .\n Yvette resolved to stay institutionalized, as long as it took. Anything to prevent herself from eating people.\n What was there to do?\n Tired, always sleepy, Yvette went back to bed. Dr. Rothgate came in the night and took her to his office again. He had trouble walking, his shuffling gait making double-footfall patters in the hallway. He’d lost the distinctive goggles of his last visit and seemed to be having problems with his vision.\n “I’m here to warn you.”\n “You sound like everyone else.”\n “You haven’t been out of the Institute’s walls for quite some time. Things have gotten eerie and ridiculous out there. Don’t fool yourself into thinking that days are still their normal lengths or that maps lead people where they’re going . . . ”\n A gooey dollop of blood was clinging to Dr. Rothgate’s forehead. She still couldn’t tell which way he’d gone. She wanted to clarify or crystallize her decision but wasn’t sure how knowing Dr. Rothgate’s choice would help. Yvette still hated both her options.\n “You’re summing it up perfectly. I want to be a person who rescues people when they’re lost in those dark nights you described. I want to bring them a warm blanket and a candle, maybe a backup snack if they’ve been foolish enough to get lost without one. When the world goes creepy, everyone needs comfort and snacks.”\n “Wait. What do you want?” Dr. Rothgate asked, his face gnashing and sliding sideways like he’d become a demon or something far worse than a vampire or goblin.\n Yvette didn’t see any pruning shears anywhere. She decided she was awake, not having another nightmare.\n “I want to be a giving and noble werewolf who wanders late nights when the walls between the worlds are thin. I’ll have a large framepack with lots of helpful supplies like: needle-nosed pliers, bandages, protein shakes, safety pins, extra batteries. You know, I could walk the night and have a ready array of supplies to give fellow travelers: new, accurate maps, clean, dry socks, small musical instruments, aspirin . . . ”\n Dr. Rothgate interrupted, talking into an indestructible tape recorder, “I’m afraid the patient is not responding to treatment. Her politics are the politics of madness.”\n Dr. Willis appeared from nowhere, head lolling from side-to-side like a weary jack-in-the-box. Dr. Willis shouted, “This isn’t about getting to do whatever you want. Life is a brutal, complicated, and messy adventure . . . ”\n “Right! And I want to a be a considerate and helpful werewolf . . . ”\n Now Yvette was of the opinion that she was dreaming after all. She used her hands to stop her chin from trembling.\n “It’s understandable that you identify with victims. It was very hard for us to turn our backs on the Hippocratic oath and learn to stalk the humans. We were forced to choose a side. There is no such thing as a werewolf . . . ” Dr. Rothgate began. He grabbed his partner’s hand and raised their arms in a victory salute.\n “But maybe there is! And maybe they don’t want darkness or souls. Maybe werewolves exist and they don’t eat people at all.”\n Saliva oozed from Dr. Willis’s bottom lip and his lips were swelling. Dr. Rothgate shouted how Yvette would be sorry if she let her malarkey continue, how the monsters of the world were going to cause her never-ending torment if she didn’t surrender her malarkey.\n With his green, liver-spotted forearms bulging and raised high in the air, Dr. Rothgate tore out into the hall so fast he could’ve been a punctured balloon and Dr. Willis snuck his pale, manicured fingers into the breast pocket of his pinstriped suit and, deftly, whipped out a syringe and poked Yvette’s arm.\n She hoped this meant she’d wake up.\n As she blacked out, she thought of how his pointy fangs were too big for his mouth. Dr. Willis had always enunciated well. Now he would be in trouble.\n It hurt for Yvette to come to. She was down in the basement, where the strangest experiments had occurred. This was the room with the sensory deprivation tank and the orgone box.\n “We have ways of making you talk,” Dr. Willis said.\n “I thought you didn’t believe in confrontation.”\n “No, our new tactics are all about confrontation. We’ve done a 180-degree turn. Now we hurt people for fun. It’s delightful and I’m willing to remove pieces of you to change your mind,” Dr. Willis said, picking up a scalpel.\n “I haven’t signed my permission slip,” Yvette said, realizing she was bound to the operating table by some sort of nylon harness.\n “It’s a symbolic technicality,” Dr. Willis said, waving the scalpel as if conducting an atonal overture.\n Yvette set her jaw, her every fiber wanting to flee. Instead, she remembered what she’d learned about granules of serenity and whispered, “We’ve known each other a long time. How’s about you untie me from this bed and give me twenty minutes alone with the form and I fill it out?”\n “I will find my partner and consult with him,” Dr. Willis said as he locked the door on his way out. Whatever he’d injected into her was having its effect. The room darkened and Larissa appeared in another visitation or dream.\n “Yvette, may I call you Evie? I’ve always contracted your name in my mind.”\n “No. Are you here to rescue me or are you just pretending to be nice?”\n “I’m your stupid hallucination. I can babble with you—but I don’t think I can interact with the material world, it’d spoil the illusion and I’d vanish.”\n “Okay. That’s not worth the risks. Tell me about your mom.”\n “Freud’s a joke. Remember that scene in Blade Runner? Scope out Jung if you want real insight into consciousness.”\n “No, I just want to understand you.”\n “And biography’s a good place to start? My mom turned into a goblin. Never met my dad. It sucked. I swore it’d never happen to me. End of story.”\n “Listen, please. I think you’re special, Larissa. And I believe in you, but you only got close. I think there’s another way out—one that’s tailored to me.”\n “I’m not here to mislead you, you know. Everyone else has lost it. You need to cling to something or the world mutates into nothing but mischief and swerving alleys. Make your call, Evie. Maybe I was wrong to bail . . . ”\n Yvette realized that the drugs were rearranging her thoughts so severely that she might be seeing things that weren’t there. \n","sourceLink":"https://allnovel.net/running-with-the-pack/page-43.html","bookId":2622,"book":{"id":2622,"title":"Running with the Pack","description":"Storyline: \n Remember the werewolves of classic stories and films, those bloodthirsty monsters that transformed under the full moon, reminding us of the terrible nature that lives within all of us? Today\u0027s werewolves are much more suave - and even sexy - and they\u0027ve moved from British moors to New York City lofts, shaved, and got jobs. But as the tales of these writers will show you, they remain no less wild and passionate, and they still tug at the part of our being where a wild animal used to be. Running With the Pack includes stories from Carrie Vaughn, Laura Anne Gilman, and C.E. Murphy, and they will convince you that despite their gentrification, werewolves remain as fascinating and terrifying as ever.\n \n","cover":"https://allnovel.net/images/running-with-the-pack.jpg","author":"Ekaterina Sedia","type":"Horror","source":"allnovel","link":"https://allnovel.net/running-with-the-pack.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 9:56:43 PM"}}
