{"id":8566,"no":15,"title":"CHAPTER XV. MR. BICKFORD GOES TO THE CIRCUS.","content":"When Aaron Bickford, balked of his prey, was compelled to get into his wagon and start for home, he felt uncommonly cross. To begin with, he was half famished, having harnessed up and set out on what turned out to be a wild goose chase without breaking his fast. Yet he could have borne this with comparative equanimity if he had effected the purpose which he had in view—the capture of his expected apprentice. But he had been signally defeated. Indeed he had been humiliated in presence of Kit and William Morris, by being unceremoniously picked up and tossed over the fence. As William was an Oakford boy, he foresaw that his discomfiture would soon be known to all his fellow townsmen, and that public ridicule would be his portion. There seemed no way to avoid this, unless by begging William to keep silent, and this he could not bring himself to do, even if the request was likely to be granted. \"Where\u0027s the boy?\" asked his wife, as, after unharnessing his horse, he went into the house. \"I don\u0027t know where he is,\" answered Bickford, in a surly tone. \"Didn\u0027t you find him?\" \"Yes, I found him.\" \"Wouldn\u0027t he come back?\" \"He didn\u0027t.\"[Pg 76] \"I\u0027d have made him if I were you.\" \"Perhaps you would, and then perhaps you wouldn\u0027t. Perhaps you couldn\u0027t.\" \"You don\u0027t mean to say, Aaron Bickford, that you let a whippersnapper like that defy you?\" \"What could I do against a man eight feet high?\" \"Goodness, Mr. Bickford, have you been drinking?\" ejaculated his wife. \"No, I haven\u0027t been drinking.\" \"Do you mean to tell me that boy is eight feet high?\" \"No, I don\u0027t mean to tell you the boy is eight feet high. But I won\u0027t answer any more foolish questions till you give me something to eat. I am fairly faint with hunger.\" \"Sit down, then, and I hope after you\u0027ve gratified your appetite you\u0027ll be a little less mysterious.\" Mrs. Bickford was privately of opinion that her husband had stopped at some drinking place—otherwise why should he prate of men eight feet tall? Aaron Bickford ate almost ravenously, though the food set before him was not calculated to gratify the taste of an epicure. But all things are acceptable to an empty stomach. When he seemed to be satisfied, his wife began anew. \"Who is it that is eight feet high?\" she asked. \"The giant at the circus.\" \"What did you have to do with him?\" \"Not much, but he had something to do with me,\" answered Bickford, grimly. \"How is that?\" \"I overhauled the boy, and was dragging him back to the wagon, when this fellow hove in sight. It seems he knew the young rascal, and took his[Pg 77] part. He seized me as easily as you would take up a cat, and flung me over the fence.\" \"I wish I\u0027d been there!\" exclaimed Mrs. Bickford, angrily. \"What could you have done. You would have been flung over too,\" said her husband, contemptuously. \"I would have got a good grip of his hair, and I guess that would have made him let go.\" \"You\u0027d have to stand on a ladder, then.\" \"So the boy got away?\" \"Of course he did.\" \"And where did he go?\" \"I expect he went to the circus along with William Morris.\" \"Was that boy with him?\" \"Yes.\" \"They were pretty well matched. What can they do at the circus?\" \"I don\u0027t know. Perhaps their long-legged friend will give them a ticket to the show.\" \"Aaron, suppose we go to the circus?\" \"What for?\" \"You may get hold of the boy, and bring him back. The giant won\u0027t be with him all the time.\" \"I\u0027d like to get the boy back,\" said Bickford, in a wavering tone. \"I\u0027d give him a lesson.\" \"And so would I. I guess between us we could subdue him. But of course he must be got back first.\" \"I\u0027ll think of it, Sarah.\" Later in the day Mr. Bickford told his wife he would go to the circus, but he tried to evade taking her in order to save the expense of another ticket. To this, however, she would not agree. The upshot was, that after supper the old horse was harnessed up, and the amiable pair, bent on vengeance, started for Grafton. \n \n","sourceLink":"http://novel.tingroom.com/ertong/3010/83130.html","bookId":281,"book":{"id":281,"title":"The Young Acrobat of the Great North American Circus","description":"简介： There was great excitement in Smyrna, especially among the boys. Barlow\u0027s Great American Circus in its triumphal progress from State to State was close at hand, and immense yellow posters announcing its arrival were liberally displayed on fences and...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3010","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
