{"id":62683,"no":38,"title":"Page 38","content":"\\n\\n “Sounds pretty far-fetched to me. How can you harness a onetime event at the bottom of the ocean?”\\n\\n “I’m not sure yet, but what would happen if some other foreign nation were to get hold of this power? Jeb is not the only scientist in the world. In the months to come, someone else might devise a similar map and go to investigate. Those are international waters out there. We couldn’t stop them.”\\n\\n Nafe swallowed. “What are you proposing?”\\n\\n “Currently, we are uniquely situated to explore this site without raising suspicion or outside interest. We’re just recovering our lost President’s ship. It’s the perfect cover. We’ve got men and ships on-site already. Commander Spangler has it cordoned off. Under this cover, we could send down a research team.”\\n\\n Nafe watched as Ruzickov’s eyes lit up. “So you’ve already thought about this?”\\n\\n “And I’ve developed a tentative plan,” he said with a grim smile. “Off the coast of Hawaii, a deep-sea project, jointly run by the National Science Foundation and a consortium of Canadian private industries, has been under way for the past decade. They have developed and constructed a self-contained deep-sea research lab…equipped with its own submersible and ROV robots. It could be on-site and manned in four days. The two missions—recovering the last pieces of Air Force One and our clandestine research—should merge together smoothly. No one would suspect.”\\n\\n “Then what’s the first step?”\\n\\n “I just need your okay.”\\n\\n Nafe nodded. “If there is something down there, we can’t risk it falling into foreign hands. You have the go-ahead to proceed.”\\n\\n Ruzickov collected the map and stood. “I’ll contact Commander Spangler immediately and begin the operation.”\\n\\n Nafe pushed to his feet. “But, Nick, after we set things in motion tomorrow, no one must know about this. No one.”\\n\\n “Don’t worry, Mr. President. Commander Spangler will lock everything down tight. He has never failed me.”\\n\\n Nafe swung around his desk and settled into the executive chair once again. “He had better not.”\\n\\n 8:12 P.M., Deep Fathom, Central Pacific\\n\\n Jack and the Deep Fathom’s crew sat around the table in the ship’s wet lab. The marine laboratory was one of the roomiest spaces on the small ship, a convenient meeting hall—if not the most homey. There were only hard metal stools on which to sit, and lining the cabin’s shelves were hundreds of clear jars of marine-life samples, preserved in brine or formaldehyde. The rows of dead animals seemed to stare down upon the assembled crew.\\n\\n “I’m still not buying this explanation,” George said heatedly. “I’ve wired into the news reports all day long, heard the so-called experts spouting on CNN, CNBC, and the BBC. I’m not believing a word of it.”\\n\\n Jack sighed. Earlier, he had related to his crew the findings announced at the briefing and their new orders: vacate the area. It took the entire afternoon to restow their gear, secure the Nautilus, and get under steam. By evening they had long cleared the crash zone, and only empty sea surrounded them.\\n\\n “The crash is no longer our concern,” Jack said, exasperated.\\n\\n The meeting was not going along as he’d expected. He had called this evening’s session to congratulate everyone for their help and to concoct a plan. With the treasure ship Kochi Maru sunk into a deep-sea volcano, the Fathom would need a new target. The two gold bars dredged up from the dive a week ago had been shipped to Wake Island, and from there to Kendall McMillan’s bank in San Diego. The small treasure barely covered their expenses in the year-long search for the Kochi Maru. The salvage fee for their assistance with the Navy would buy them a bit of latitude, but not much. They would still need to renegotiate a loan.\\n\\n McMillan, the bank’s accountant, sat at the far end of the table, still looking green around the gills from yesterday’s storms. Whatever was decided here, the bank would make the final decision, deciding whether or not to finance their next venture. McMillan sat with a pen in hand, doodling in the margins of his legal pad. The crew, still angry at being so rudely booted out, had yet to make any progress.\\n\\n Jack tried to refocus the discussion. “We need to put this matter behind us and consider what to do from here.”\\n\\n George scowled. “Listen, Jack, before the explosion last night, I wanted to show you something. I still want to get this off my chest.”\\n\\n Jack recalled the historian’s interrupted midnight talk with Admiral Houston. “Okay, but this is the last time we discuss this matter. Then on to real business.”\\n\\n “Agreed.” George reached down and retrieved a rolled map from beside his chair. With a flick of his wrists, he unrolled its length across the table. The map held a view of the entire Pacific basin. A large red triangle had been penciled on its surface, with tiny X’s marked within its boundaries.\\n\\n Lisa stood up to get a wider view. “What are you showing us?”\\n\\n George tapped the map. “The Dragon’s Triangle.”\\n\\n “The what?” she asked.\\n\\n George ran a finger along the boundaries of the penciled triangle. “It goes by other names. The Japanese call it, ‘Mano Umi,’ the Devil’s Sea. Disappearances in this region go back centuries.” He sat down and tapped each of the tiny X’s, describing the tragedy of a lost ship, submarine, or plane.\\n\\n Lisa whistled. “It’s like the Bermuda Triangle.”\\n\\n “Exactly,” George said, and continued his litany, ending at last with the story of a WWII Japanese pilot and the man’s final, fateful words before his plane disappeared. “ ‘The sky is opening up!’ That was his last radioed message. Now, I find that a remarkable coincidence. Air Force One crashes into the center of the Dragon’s Triangle, and the final words from its pilot are the same as the vanished Japanese pilot from half a century ago.”\\n\\n “Amazing,” Lisa agreed.\\n\\n Robert just stared, his boyish eyes wide.\\n\\n Charlie leaned in closer, running a finger along longitude and latitude numbers. His brows were deeply furrowed.\\n\\n George looked up at Jack. “How do you explain that?”\\n\\n “I saw the explosion site from the bomb,” Jack said. “That was no weird phenomenon. That was plain murder.”\\n\\n George made a scoffing noise. “But what of your own findings down below? The crystal spire, the strange hieroglyphics, the odd emanations. On top of all this, most of the wreckage of the President’s plane just happens to settle at this site. If a midair explosion had truly happened, the debris field would be much wider.”\\n\\n Jack sat silently. In George’s words, he heard his own argument with the admiral last night. He, too, had been convinced that something powerful lay down there. Something with the strength to knock a plane from the sky. He studied the map. The number of coincidences kept piling up, too high to ignore. “But the bomb in the jade bust, the electronic circuitry…?”\\n\\n “What if it was staged?” George asked. “A frame-up. Washington had already been implicating the Chinese before the explosion.”\\n\\n Jack frowned.\\n\\n Charlie spoke up, his Jamaican accent thick. “I don’t know, mon. I think ol’ George might be on to something.”\\n\\n “What do you mean?”\\n\\n “I, too, have heard of this Dragon’s Triangle. I just never made the connection until now.”\\n\\n “Great, another convert,” Kendall McMillan mumbled from the far side of the table.\\n\\n Jack ignored the accountant. He turned to the ship’s geologist. “What do you know of the region?”\\n\\n As answer, Charlie nudged Robert. “Would you please grab the globe from the library?”\\n\\n “Sure.” Robert took off.\\n\\n Charlie nodded to the map. “Do any of you know the term ‘agonic lines’?”\\n\\n Everyone shook their heads.\\n\\n “It is one of the many theories for explaining the disappearances here. Agonic lines are distinct regions where the Earth’s magnetic field is a bit off kilter. Compass readings are slightly out of sync with the rest of the world. The principal agonic line of the Eastern Hemisphere passes through the center of this Dragon’s Triangle.” Charlie looked around the table. “Do any of you know where the Western Hemisphere’s main agonic line passes through?”\\n\\n Again a general shaking of heads.\\n\\n “The Bermuda Triangle,” Charlie answered, letting the fact sink in.\\n\\n “But what causes these magnetic disturbances in the first place?” Lisa asked. “These agonal lines?”\\n\\n “Agonic,” Charlie corrected. “No one knows for sure. Some blame it on increased seismic activity in the regions. During earthquakes, strong magnetic fluxes are generated. But in general, magnetism, including the earth’s magnetic field, is still poorly understood. Its properties, energies, and dynamics are still being researched. Most scientists accept that the Earth’s magnetic field is generated by the flow of the planet’s molten core around its solid nickel-iron center. But many irregularities still remain. Like the fluidity of this field.”\\n\\n “Fluidity?” George interrupted. “What do you mean?”\\n\\n Charlie realized that in his excitement he’d spoken too fast. “From a geological standpoint,” he went on, speaking more slowly, “man has only been here for a flicker. During such a small scope in time, the Earth’s magnetic field seems fixed. The North Pole is up and the South Pole is down. But even over this short course, the poles have wobbled. The true position of magnetic north constantly bobbles around a bit. But this is only a minor fluctuation. Over the course of Earth’s entire geologic history, not only have these poles shifted dramatically, but they have reversed several times.”\\n\\n “Reversed?” Lisa asked.\\n\\n Charlie nodded. “North became south, and south became north. Such events are not fully understood yet.”\\n\\n Jack scratched his head. “What does this have to do with anything?”\\n\\n “Hell if I know. Like I said, I find it intriguing. Didn’t you say that Air Force One’s wreckage was magnetized? Doesn’t this fact add to the list of coincidences? And what about your own compass problems down there?” \\n\\n","sourceLink":"https://allnovel.net/deep-fathom/page-38.html","bookId":1524,"book":{"id":1524,"title":"Deep Fathom","description":"Storyline: Ex-Navy SEAL Jack Kirkland surfaces from an aborted underwater salvage mission to find the Earth burning. Solar flares have triggered a series of gargantuan natural disasters. Earthquakes and hellfire rock the globe. Air Force One has vanished from the skies with America\u0027s president on board. Now, with the U.S. on the narrow brink of a nuclear apocalypse, Kirkland must pilot his oceangoing exploration ship, Deep Fathom, on a desperate mission miles below the ocean\u0027s surface. There devastating secrets await him — and a power an ancient civilization could not contain has been cast out into modern day. And it will forever alter a world that\u0027s already racing toward its own destruction.\\n","cover":"https://allnovel.net/images/deep-fathom.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/deep-fathom.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:45:25 AM"}}
