{"id":62723,"no":78,"title":"Page 78","content":"“My God!” Shielding her eyes, she moved to one of the ports, trying to see outside. Nothing was visible. Not Jack, not the seabed beyond. The world was just light. “Jack…” 12:02 P.M., Deep Fathom Lisa continued to stand near the bow rail with George and Robert. The old historian sighed out a long stream of smoke, seemingly unperturbed by the missile aiming across the sky toward them. By now its fiery tail was easy to see. Lisa reached out and took George’s hand. He squeezed her fingers in his grip. “Don’t worry,” he whispered, suddenly fatherly, his eyes on the sky. As they watched together, the missile seemed to freeze in place, hanging as if caught in amber. Lisa stared, mouth hanging open. Surely it was an optical illusion. One second…then another and another passed. It still refused to move. Robert spoke up, drawing her attention away from the strange sky. He was bent over the steel rail, looking down. He turned to them, taking off his headphones. “Guys…where’s the ocean?” “What do you mean?” Lisa and George joined the young marine biologist. She stared past the rail and gasped. Beyond the keel there was no water. The ship was floating in midair, rocking gently on invisible waves. Lisa bent over the rail. Far below, a fierce light shone. She looked around, turning. Inside a hundred-yard perimeter of the ship the sea was gone. Beyond this circle, the ocean was as normal as any day. It was as if the Deep Fathom were floating over a deep well in the ocean. Only this well had a sun at the bottom of it. “Look at the sky!” George called out. Lisa tore her eyes from the wonders below to see something even more amazing overhead. In the sky, the small missile, once hanging in place, began to slide back down its smoke trail, as if it were retreating. “What is going on?” she asked. 12:02 P.M. Jack stood with his arms blocking his helmet ports. He huddled against the light, mouth open in a silent scream. The power surging inches from his back vibrated his armor shell. His skin was flushed, hairs tingling. He felt the energy down to his bones. God…! Before his sanity was burned away in the brightness, he sensed a change in the timbre of the energy. The light softened. He lowered his arm. Rather than blinding, the radiance from the pillar had become a silvery wash through the dark waters. The seamounts, the research station, the lava pillars, were all limned in stark relief, etched in silver, becoming mirrors themselves in the strange light. A voice whispered in his ear, hopeless, scared. “Jack…” As he stared, knowing death lay moments away, he spotted movement from the corner of his eye. He turned, searching out the helmet ports. Then he saw them! Reflected in the silvery surfaces of the nearby sea cliffs, he watched images of men and women kneeling, arms raised to the heavens. More gathered behind. Throngs of robed and cloaked figures, some with elaborate headdresses of feathers and jewels, others bearing platters laden with fruits, or leading sheep and pigs on leather tethers. “My God,” he whispered. Searching around, he saw similar images in all the mirrored surfaces: warped figures moving across the curved skin of the sea base, fractured images on the broken wall of lava pillars, even on a nearby boulder, the reflection of a tall man, kneeling with his face to the ground. It was as if the silvery surfaces had become a magical looking glass to another world. “Jack, if you’re out there, answer me!” It was Karen. Jack’s voice filled with wonder, his fear fading. “Can you see them?” The kneeling figure lifted his face. He was bearded, with piercing eyes, and strong limbs. He stood and stepped from the mirrored boulder. Jack gasped, backing and bumping into the pillar behind him. All around him the procession of people moved forward, leaving their reflected surfaces. He now heard distant voices, echoing songs, chanting. The figure from the boulder lifted his arms high, a shout of joy on his lips. Jack found his gaze drawn upward. There was no ocean, only sky. A bright sun hung above, eclipsed by the moon. Glancing back down, he saw hazy mountains in the distance and dense forests. Yet, strangely at the same time, he could still sense the ocean, the sea base, the cliffs…. He suddenly understood. These were the ancient ones, the people of the lost continent. He was glimpsing their world. Karen whispered in his ear, barely audible past the growing songs and chants. “I…I see people around you, Jack.” It wasn’t just him! Jack stepped forward to view the wonder better. As he did so, the tall bearded man crashed to his knees, a look of rapture on his face. He was staring right at Jack. “I think they can see me, too!” he said, astounded. “Who are they?” Jack stopped and raised an arm. All around the ghostly clearing, men and women fell in postures of worship and prostration. “They’re your ancients. The ones you’ve been looking for all these years. We’re seeing back into their world through some strange warp. And they’re in turn seeing into ours.” The kneeling man, some sort of leader or shaman, called loudly. Though the words were unintelligible, he was clearly pleading. Jack had an idea. “Karen, are we still patched through to the Fathom?” “Yes.” “Can you feed what this man is saying up to Gabriel? Can he translate?” “I’ll try.” There was a long pause. Jack gazed around in amazement. Finally, a familiarly tinny voice, scratchy with distance, spoke in his ear. “I will attempt to translate…but I have only begun to attach phonetics to the ancient language.” “Do your best, Gabriel.” Charlie spoke up. “You’ll have to hurry. We’re escalating to the peak pulse frequency in thirty-two seconds.” The man at Jack’s feet continued to speak. Gabriel’s translation overlapped. “Our need is great, spirit of the pillar, oh god of the sun. What message do you bring us that the land shakes and cracks with fire?” For the first time Jack noticed the ground was trembling underfoot. At that moment, he realized not only where he was, but when! He stood at the dawn of this continent’s devastation. Jack also grasped his own role here. He remembered the platinum diary’s story: The god of light stepped from his pillar…. Outfitted in his armored suit, basked by brilliance, he was that god. Knowing his duty, Jack stepped forward and raised both arms. “Flee!” he yelled as Gabriel translated, his words echoing out to those gathered. “A time of darkness is upon you! A time of hardship! The waters of the sea will claim your homelands and drown them away. You must be prepared!” Jack saw the shocked look on the other’s face. The man had understood. Charlie yelled through the speakers. “Get ready for the final pulse!” The view of the lost continent began to flicker. Hurrying, Jack stepped forward. “Build great ships!” he ordered. “Gather your flocks and fill the ships’ bellies with food from the fields! Save your people!” The shaman bowed his head. “Your humble servant, Horon-ko, hears and will obey.” A shocked gasp arose from the radio. “Horon-ko,” Karen said. “The one who wrote the diary…the bones in the coffin.” Jack nodded, staring down at the man. Their shared stories had come full circle. As he stood, the images sank back into the mirrored reflections. “Here it comes!” Charlie screamed. Jack braced, tense, waiting for the coming explosion. But it never arrived—instead, the brightness simply blinked away like a candle snuffed. Jack straightened. After the intense light, the midnight seas were especially dark. The glow from the base’s portholes appeared anemic and wan. Karen yelled, fear in her voice. “Jack!” “I’m still here.” She sighed with relief, then Charlie interrupted. “What about the pillar?” Jack spun with his thrusters, thumbing on his suit’s lamps. His lights spread far in the darkness. Nothing. The crystal pillar was gone. All that remained were bits and chunks scattered across the dark seabed floor, glowing in his beams like a sprinkle of stars. He moved forward, stepping among the shining constellations. “Jack?” Charlie whispered. “We did it. The pillar’s destroyed.” Charlie whooped with joy. Jack frowned. Charlie’s happiness was hard to share. The world was saved, but what about them? “The tactical nuclear strike?” Jack asked. “Spangler’s revenge. When’s it due to hit?” “I wouldn’t worry about that, mon.” Deep Fathom Charlie sat in the pilothouse, radio pressed to his lips. “Jack, you missed the eclipse the last time. You might want to get back up here so you don’t miss it a second time.” “What the hell are you talking about?” Charlie grinned at Jack’s consternation. He couldn’t resist stringing his captain along. His heart was too full of amazement and joy. He stood and stared out the wide window. The others were all gathered on deck, pointing up. In the clear sky, a black sun shone down, casting the ocean in platinum. Charlie checked his wristwatch. A little after twelve o’clock. He glanced back at the sun. It was low in the sky, too low. Shaking his head in wonder, Charlie glanced to the satellite navigation system. Its clock and date were constantly updated with a feed from a dozen satellites in geosynchronous orbit. He stared at the digital time and date stamp. He had confirmed the anomalous results with the local weather band, too. Tuesday, July 24 01:45 P.M. “Goddamn it, Charlie, what are you talking about?” Charlie sighed, letting Jack off the hook. “We ran into a little anomaly, Jack. Like I said before, I’m no expert on this new science of ‘dark energy.’ ”","sourceLink":"https://allnovel.net/deep-fathom/page-78.html","bookId":1524,"book":{"id":1524,"title":"Deep Fathom","description":"Storyline: Ex-Navy SEAL Jack Kirkland surfaces from an aborted underwater salvage mission to find the Earth burning. Solar flares have triggered a series of gargantuan natural disasters. Earthquakes and hellfire rock the globe. Air Force One has vanished from the skies with America\u0027s president on board. Now, with the U.S. on the narrow brink of a nuclear apocalypse, Kirkland must pilot his oceangoing exploration ship, Deep Fathom, on a desperate mission miles below the ocean\u0027s surface. There devastating secrets await him — and a power an ancient civilization could not contain has been cast out into modern day. And it will forever alter a world that\u0027s already racing toward its own destruction.","cover":"https://allnovel.net/images/deep-fathom.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/deep-fathom.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:45:25 AM"}}
