{"id":70860,"no":1,"title":"Page 1","content":"Andrew Harlan stepped into the kettle. Its sides were perfectly round and it fit snugly inside a vertical shaft composed of widely spaced rods that shimmered into an unseeable haze six feet above Harlan\u0027s head. Harlan set the controls and moved the smoothly working starting lever. The kettle did not move. Harlan did not expect it to. He expected no movement; neither up nor down, left nor right, forth nor back. Yet the spaces between the rods had melted into a gray blankness which was solid to the touch, though nonetheless immaterial for all that. And there was the little stir in his stomach, the faint (psychosomatic?) touch of dizziness, that told him that all the kettle contained, including himself, was rushing upwhen through Eternity. He had boarded the kettle in the 575th Century, the base of operations assigned him two years earlier. At the time the 575th had been the farthest upwhen he had ever traveled. Now he was moving upwhen to the 2456th Century. Under ordinary circumstances he might have felt a little lost at the prospect. His native Century was in the far downwhen, the 95th Century, to be exact. The 95th was a Century stiffly restrictive of atomic power, faintly rustic, fond of natural wood as a structural material, exporters of certain types of distilled potables to nearly everywhen and importers of clover seed. Although Harlan had not been in the 95th since he entered special training and became a Cub at the age of fifteen, there was always that feeling of loss when one moved outwhen from \"home.\" At the 2456th he would be nearly two hundred forty millennia from his birthwhen and that is a sizable distance even for a hardened Eternal. Under ordinary circumstances all this would be so. But right now Harlan was in poor mood to think of anything but the fact that his documents were heavy in his pocket and his plan heavy on his heart. He was a little frightened, a little tense, a little confused. It was his hands acting by themselves that brought the kettle to the proper halt at the proper Century. Strange that a Technician should feel tense or nervous about anything. What was it that Educator Yarrow had once said: \"Above all, a Technician must be dispassionate. The Reality Change he initiates may affect the lives of as many as fifty billion people. A million or more of these may be so drastically affected as to be considered new individuals. Under these conditions, an emotional make-up is a distinct handicap.\" Harlan put the memory of his teacher\u0027s dry voice out of his mind with an almost savage shake of his head. In those days he had never imagined that he himself would have the peculiar talent for that very position. But emotion had come upon him after all. Not for fifty billion people. What in Time did he care for fifty billion people? There was just one. One person. He became aware that the kettle was stationary and with the merest pause to pull his thoughts together, put himself into the cold, impersonal frame of mind a Technician must have, he stepped out. The kettle he left, of course, was not the same as the one he had boarded, in the sense that it was not composed of the same atoms. He did not worry about that any more than any Eternal would. To concern oneself with the mystique of Time-travel, rather than with the simple fact of it, was the mark of the Cub and newcomer to Eternity. He paused again at the infinitely thin curtain of non-Space and nonTime which separated him from Eternity in one way and from ordinary Time in another. This would be a completely new section of Eternity for him. He knew about it in a rough way, of course, having checked upon it in the _Temporal Handbook_. Still, there was no substitute for actual appearance and he steeled himself for the initial shock of adjustment. He adjusted the controls, a simple matter in passing into Eternity (and a very complicated one in passing into Time, a type of passage which was correspondingly less frequent). He stepped through the curtain and found himself squinting at the brilliance. Automatically he threw up his hand to shield his eyes. Only one man faced him. At first Harlan could see him only blurrily. The man said, \"I am Sociologist Kantor Voy. I imagine you are Technician Harlan.\" Harlan nodded and said, \"Father Time! Isn\u0027t this sort of ornamentation adjustable?\" Voy looked about and said tolerantly, \"You mean the molecular films?\" \"I certainly do,\" said Harlan. The Handbook had mentioned them, but had said nothing of such an insane riot of light reflection. Harlan felt his annoyance to be quite reasonable. The 2456th Century was matter-oriented, as most Centuries were, so he had a right to expect a basic compatibility from the very beginning. It would have none of the utter confusion (for anyone born matter-oriented) of the energy vortices of the 300\u0027s, or the field dynamics of the 600\u0027s. In the 2456th, to the average Eternal\u0027s comfort, matter was used for everything from walls to tacks. To be sure, there was matter and matter. A member of an energyoriented Century might not realize that. To him all matter might seem minor variations on a theme that was gross, heavy, and barbaric. To matter-oriented Harlan, however, there was wood, metal (subdivisions, heavy and light), plastic, silicates, concrete, leather, and so on. But matter consisting entirely of mirrors! That was his first impression of the 2456th. Every surface reflected and glinted light. Everywhere was the illusion of complete smoothness; the effect of a molecular film. And in the ever-repeated reflection of himself, of Sociologist Voy, of everything he could see, in scraps and wholes, in all angles, there was confusion. Garish confusion and nausea! \"I\u0027m sorry,\" said Voy, \"it\u0027s the custom of the Century, and the Section assigned to it finds it good practice to adopt the customs where practical. You get used to it after a time.\" Voy walked rapidly upon the moving feet of another Voy, upside down beneath the floor, who matched him stride for stride. He reached to move a hair-contact indicator down a spiral scale to point of origin. The reflections died; extraneous light faded. Harlan felt his world settle. \"If you\u0027ll come with me now,\" said Voy. Harlan followed through empty corridors that, Harlan knew, must moments ago have been a riot of made light and reflection, up a ramp, through an anteroom, into an office. In all the short journey no human being had been visible. Harlan was so used to that, took it so for granted, that he would have been surprised, almost shocked, if a glimpse of a human figure hurrying away had caught his eyes. No doubt the news had spread that a Technician was coming through. Even Voy kept his distance and when, accidentally, Harlan\u0027s hand had brushed Voy\u0027s sleeve, Voy shrank away with a visible start. Harlan was faintly surprised at the touch of bitterness he felt at all this. He had thought the shell he had grown about his soul was thicker, more efficiently insensitive than that. If he was wrong, if his shell had worn thinner, there could only be one reason for that. Noys! Sociologist Kantor Voy leaned forward toward the Technician in what seemed a friendly enough fashion, but Harlan noted automatically that they were seated on opposite sides of the long axis of a fairly large table. Voy said, \"I am pleased to have a Technician of your reputation interest himself in our little problem here.\" \"Yes,\" said Harlan with the cold impersonality people would expect of him. \"It has its points of interest.\" (Was he impersonal enough? Surely his real motives must be apparent, his guilt be spelled out in beads of sweat on his forehead.) He removed from an inner pocket the foiled summary of the projected Reality Change. It was the very copy which had been sent to the Allwhen Council a month earlier. Through his relationship with Senior Computer Twissell (the Twissell, himself) Harlan had had little trouble in getting his hands on it. Before unrolling the foil, letting it peel off onto the table top where it would be held by a soft paramagnetic field, Harlan paused a split moment. The molecular film that covered the table was subdued but was not zero. The motion of his arm fixed his eye and for an instant the reflection of his own face seemed to stare somberly up at him from the table top. He was thirty-two, but he looked older. He needed no one to tell him that. It might be partly his long face and dark eyebrows over darker eyes that gave him the lowering expression and cold glare associated with the caricature of the Technician in the minds of all Eternals. It might be just his own realization that he was a Technician. But then he flicked the foil out across the table and turned to the matter at hand. \"I am not a Sociologist, sir.\" Voy smiled. \"That sounds formidable. When one begins by expressing lack of competence in a given field, it usually implies that a flat opinion in that field will follow almost immediately.\" \"No,\" said Harlan, \"not an opinion. Just a request. I wonder if you won\u0027t look over this summary and see if you haven\u0027t made a small mistake somewhere here.\" Voy looked instantly grave. \"I hope not,\" he said. Harlan kept one arm across the back of his chair, the other in his lap. He must let neither hand drum restless fingers. He must not bite his lips. He must not show his feelings in any way. Ever since the whole orientation of his life had so changed itself, he had been watching the summaries of projected Reality Changes as they passed through the grinding administrative gears of the Allwhen Council. As Senior Computer Twissell\u0027s personally assigned Technician, he could arrange that by a slight bending of professional ethics. Particularly with Twissell\u0027s attention caught ever more tightly in his own overwhelming project. (Harlan\u0027s nostrils flared. He knew now a little of the nature of that project.) Harlan had had no assurance that he would ever find what he was looking for in a reasonable time. When he had first glanced over projected Reality Change 2456-2781, Serial Number V-5, he was half inclined to believe his reasoning powers were warped by wishing. For a full day he had checked and rechecked equations and relationships in a rattling uncertainty, mixed with growing excitement and a bitter gratitude that he had been taught at least elementary psycho-mathematics. Now Voy went over those same puncture patterns with a half-puzzled, half-worried eye. He said, \"It seems to me; I say, it seems to me that this is all perfectly in order.\" Harlan said, \"I refer you particularly to the matter of the courtship characteristics of the society of the current Reality of this Century. That\u0027s sociology and your responsibility, I believe. It\u0027s why I arranged to see you when I arrived, rather than someone else.\" Voy was now frowning. He was still polite, but with an icy touch now. He said, \"The Observers assigned to our Section are highly competent. I have every certainty that those assigned to this project have given accurate data. Have you evidence to the contrary?\" \"Not at all, Sociologist Voy. I accept their data. It is the development of the data I question. Do you not have an alternate tensorcomplex at this point, if the courtship data is taken properly into consideration?\" Voy stared, and then a look of relief washed over him visibly. \"Of course, Technician, of course, but it resolves itself into an identity. There is a loop of small dimensions with no tributaries on either side. I hope you\u0027ll forgive me for using picturesque language rather than precise mathematical expressions.\" \"I appreciate it,\" said Harlan dryly. \"I am no more a Computer than a Sociologist.\" \"Very good, then. The alternate tensor-complex you refer to, or the forking of the road, as we might say, is non-significant. The forks join up again and it is a single road. There was not even any need to mention it in our recommendations.\" \"If you say so, sir, I will defer to your better judgment. However, there is still the matter of the M.N.C.\" The Sociologist winced at the initials as Harlan knew he would. M.N.C.-Minitnum Necessary Change. There the Technician was master. A Sociologist might consider himself above criticism by lesser beings in anything involving the mathematical analysis of the infinite possible Realities in Time, but in matters of M.N.C. the Technician stood supreme. Mechanical computing would not do. The largest Computaplex ever built, manned by the cleverest and most experienced Senior Computer ever born, could do no better than to indicate the ranges in which the M.N.C. might be found. It was then the Technician, glancing over the data, who decided on an exact point within that range. A good Technician was rarely wrong. A top Technician was never wrong. Harlan was never wrong. \"Now the M.N.C. recommended,\" said Harlan (he spoke coolly, evenly, pronouncing the Standard Intertemporal Language in precise syllables), \"by your Section involves induction of an accident in space and the immediate death by fairly horrible means of a dozen or more men.\" \"Unavoidable,\" said Voy, shrugging. \"On the other hand,\" said Harlan, \"I suggest that the M.N.C. can be reduced to the mere displacement of a container from one shelf to another. Here!\" His long finger pointed. His white, well-cared-for index nail made the faintest mark along one set of perforations. Voy considered matters with a painful but silent intensity. Harlan said, \"Doesn\u0027t that alter the situation with regard to your unconsidered fork? Doesn\u0027t it take advantage of the fork of lesser probability, changing it to near-certainty, and does that not then lead to--\" \"-to virtually the M.D.R.\" whispered Voy. \"To exactly the Maximum Desired Response,\" said Harlan. Voy looked up, his dark face struggling somewhere between chagrin and anger. Harlan noted absently that there was a space between the man\u0027s large upper incisors which gave him a rabbity look quite at odds with the restrained force of his words. Voy said, \"I suppose I will be hearing from the Allwhen Council?\" \"I don\u0027t think so. As far as I know, the Allwhen Council does not know of this. At least, the projected Reality Change was passed over to me without comment.\" He did not explain the word \"passed,\" nor did Voy question it. \"You discovered this error, then?\" \"Yes.\" \"And you did not report it to the Allwhen Council?\" \"No, I did not.\" Relief first, then a hardening of countenance. \"Why not?\" \"Very few people could have avoided this error. I felt I could correct it before damage was done. I have done so. Why go any further?\" \"Well-thank you, Technician Harlan. You have been a friend. The Section\u0027s error which, as you say, was practically unavoidable, would have looked unjustifiably bad in the record.\" He went on after a moment\u0027s pause. \"Of course, in view of the alterations in personality to be induced by this Reality Change, the death of a few men as preliminary is of little importance.\" Harlan thought, detachedly: He doesn\u0027t sound really grateful. He probably resents it. If he stops to think, he\u0027ll resent it even more, this being saved a downstroke in rating by a Technician. If I were a Sociologist, he would shake my hand, but he won\u0027t shake the hand of a Technician. He defends condemning a dozen people to asphyxiation, but he won\u0027t touch a Technician. And because waiting to let resentment grow would be fatal, Harlan said without waiting, \"I hope your gratitude will extend to having your Section perform a slight chore for me.\" \"A chore?\" \"A matter of Life-Plotting. I have the data necessary here with me. I have also the data for a suggested Reality Change in the 482nd. I want to know the effect of the Change on the probability-pattern of a certain individual.\" \"I am not quite sure,\" said the Sociologist slowly, \"that I understand you. Surely you have the facilities for doing this in your own Section?\" \"I have. Nevertheless, what I am engaged in is a personal research which I don\u0027t wish to appear in the records just yet. It would be difficult to have this carried out in my own Section without--\" He gestured an uncertain conclusion to the unfinished sentence. Voy said, \"Then you want this done not through official channels.\" \"I want it done confidentially. I want a confidential answer.\" \"Well, now, that\u0027s very irregular. I can\u0027t agree to it.\" Harlan frowned. \"No more irregular than my failure to report your error to the Allwhen Council. You raised no objection to that. If we\u0027re going to be strictly regular in one case, we must be as strict and as regular in the other. You follow me, I think?\" The look on Voy\u0027s face was proof positive of that. He held out his hand. \"May I see the documents?\" Harlan relaxed a bit. The main hurdle had been passed. He watched eagerly as the Sociologist\u0027s head bent over the foils he had brought. Only once did the Sociologist speak. \"By Time, this is a small Reality Change.\" Harlan seized his opportunity and improvised. \"It is. Too small, I think. It\u0027s what the argument is about. It\u0027s below critical difference, and I\u0027ve picked an individual as a test case. Naturally, it would be undiplomatic to use our own Section\u0027s facilities until I was certain of being right.\" Voy was unresponsive and Harlan stopped. No use running this past the point of safety. Voy stood up. \"I\u0027ll pass this along to one of my Life-Plotters. We\u0027ll keep this private. You understand, though, that this is not to be taken as establishing a precedent.\" \"Of course not.\" \"And if you don\u0027t mind, I\u0027d like to watch the Reality Change take place. I trust you will honor us by conducting the M.N.C. personally.\" Harlan nodded. \"I will take full responsibility.\" Two of the screens in the viewing chamber were in operation when they entered. The engineers had focused them already to the exact co-ordinates in Space and Time and then had left. Harlan and Voy were alone in the glittering room. (The molecular film arrangement was perceptible and even a bit more than perceptible, but Harlan was looking at the screens.) Both views were motionless. They might have been scenes of the dead, since they pictured mathematical instants of Time. One view was in sharp, natural color; the engine room of what Harlan knew to be an experimental space-ship. A door was closing, and a glistening shoe of a red, semi-transparent material was just visible through the space that remained. It did not move. Nothing moved. If the picture could have been made sharp enough to picture the dust motes in the air, they would not have moved. Voy said, \"For two hours and thirty-six minutes after the viewed instant, that engine room will remain empty. In the current Reality, that is.\" \"I know,\" murmured Harlan. He was putting on his gloves and already his quick eyes were memorizing the position of the critical container on its shelf, measuring the steps to it, estimating the best position into which to transfer it. He cast one quick look at the other screen. If the engine-room, being in the range described as \"present\" with respect to that Section of Eternity in which they now stood, was clear and in natural color, the other scene, being some twenty-five Centuries in the \"future,\" carried the blue luster all views of the \"future\" must. It was a space-port. A deep blue sky, blue-tinged buildings of naked metal on blue-green ground. A blue cylinder of odd design, bulgebottomed, stood in the foreground. Two others like it were in the background. All three pointed cleft noses upward, the cleavage biting deeply into the vitals of the ship. Harlan frowned. \"They\u0027re queer ones.\" \"Electro-gravitic,\" said Voy. \"The 2481st is the only Century to develop electro-gravitic space-travel. No propellants, no nucleonics. It\u0027s an aesthetically pleasing device. It\u0027s a pity we must Change away from it. A pity.\" His eyes fixed themselves on Harlan with distinct disapproval. Harlan\u0027s lips compressed. Disapproval of course! Why not? He was the Technician. To be sure, it had been some Observer who had brought in the details of drug addiction. It had been some Statistician who had demonstrated that recent Changes had increased the addiction rate until now it was the highest in all the current Reality of man. Some Sociologist, probably Voy himself, had interpreted that into the psychiatric profile of a society. Finally, some Computer had worked out the Reality Change necessary to decrease addiction to a safe level and found that, as a side effect, electro-gravitic space-travel must suffer. A dozen, a hundred men of every rating in Eternity had had a hand in this. But then, at the end, a Technician such as himself must step in. Following the directions all the others had combined to give him, he must be the one to initiate the actual Reality Change. And then all the others would stare in haughty accusation at him. Their stares would say: You, not we, have destroyed this beautiful thing. And for that, they would condemn and avoid him. They would shift their own guilt to his shoulders and scorn him. Harlan said harshly, \"Ships aren\u0027t what count. We\u0027re concerned with those things.\" The \"things\" were people, dwarfed by the space-ship, as Earth and Earth\u0027s society is always dwarfed by the physical dimensions of spaceflight. They were little puppets in clusters, these people. Their tiny arms and legs were in raised, artificial-looking positions, caught in the frozen instant of Time. Voy shrugged. Harlan was adjusting the small field-generator about his left wrist. \"Let\u0027s get this job done.\" \"One minute. I want to get in touch with the Life-Plotter and find out how long his job for you will take. I want to get that job done, too.\" His hands worked cleverly at a little movable contact and his ear listened astutely to the pattern of clicks that came back. (Another characteristic of this Section of Eternity, thought Harlan-sound codes in clicks. Clever, but affected, like the molecular films.) \"He says it won\u0027t take more than three hours,\" said Voy at length. \"Also, by the way, he admires the name of the person involved. Noys Lambent. It is a female, isn\u0027t it?\" There was a dryness in Harlan\u0027s throat. \"Yes.\" Voy\u0027s lips curled into a slow smile. \"Sounds interesting. I\u0027d like to meet her, sight unseen. Haven\u0027t had any women in this Section for months.\" Harlan didn\u0027t trust himself to answer. He stared a moment at the Sociologist and turned abruptly. If there was a flaw in Eternity, it involved women. He had known the flaw for what it was from almost his first entrance into Eternity, but he felt it personally only that day he had first met Noys. From that moment it had been an easy path to this one, in which he stood false to his oath as an Eternal and to everything in which he had believed. For what? For Noys. And he was not ashamed. It was that which really rocked him. He was not ashamed. He felt no guilt for the crescendo of crimes he had committed, to which this latest addition of the unethical use of confidential Life-Plotting could rank only as a peccadillo. He would do worse than his worst if he had to. For the first time the specific and express thought came to him. And though he pushed it away in horror, he knew that, having once come, it would return. The thought was simply this: That he would ruin Eternity, if he had to. The worst of it was that he knew he had the power to do it.","sourceLink":"https://allnovel.net/the-end-of-eternity/page-1.html","bookId":1747,"book":{"id":1747,"title":"The End of Eternity","description":"Storyline: Andrew Harlan is an Eternal, a man whose job it is to range through past and present Centuries, monitoring and, where necessary, altering Time\u0027s myriad cause-and-effect relationships. But when Harlan meets and falls for a non-Eternal woman, he seeks to use the awesome powers and techniques of the Eternals to twist time for his own purposes, so that he and his love can survive together.","cover":"https://allnovel.net/images/the-end-of-eternity.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-end-of-eternity.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:18:09 AM"}}
