{"id":81792,"no":12,"title":"Page 12","content":"Failing Like Dimmesdale Did\n Maybe Puritans were simply dumber than modern people, but I cannot believe how long it took those seventeenth-century Bostonians to figure out that their spiritual leader knocked up the local hussy. I had the mystery solved in chapter eight, when Hester turns to Dimmesdale and says, \"Speak thou for me!\" I know we were assigned Hawthorne\u0027s The Scarlet Letter back in high school, and if I had known the book was filled with so much sex and espionage, I might have read it when I was sixteen. God, I can\u0027t wait to ask Nikki if she hypes up the racy stuff in her class, because I know teenagers would actually read the book if she did.\n I didn\u0027t care much for Dimmesdale, because he had such a great woman and he denied himself a life with her. Now, I understand that it would not have been easy for him to explain how he knocked up another man\u0027s teenage wife, especially since he was a man of the cloth, but if there\u0027s one theme Hawthorne hammers home, it\u0027s that time heals all wounds, which Dimmesdale learns, but too late. Plus, I\u0027m thinking God would have wanted Pearl to have had a father, and probably counted Dimmesdale\u0027s disregard for his daughter as a greater sin than having sex with another man\u0027s wife.\n Now, I sympathize with Chillingworth - a lot. I mean, he sends his young bride over to the New World, trying to give her a better life, and she ends up pregnant by another man, which is the ultimate slap in the face, right? But he was so old and nasty and really had no business marrying a young girl anyway. When he began to psychologically torture Dimmesdale, giving him all those strange roots and herbs, Chillingworth reminded me of Dr. Timbers and his staff. I realized then that Chillingworth was not ever going to practice being kind, so I gave up hope for him.\n But I absolutely loved Hester, because she believed in silver linings. Even when that nasty throng of bearded men in hats and fat women were against her, saying she should be branded on the forehead even, she stuck to her guns and sewed and helped people when she could and tried her best to raise her daughter - even when Pearl proved to be somewhat of a demonic child.\n Even though Hester did not get to be with Dimmesdale in the end - which is a flaw, if you ask me - I felt like she lived a fulfilled life and got to see her daughter grow up and marry well, which was kind of nice.\n But I did realize that no one really appreciated Hester for who she was until it was too late. When she needed help most, she was abandoned - and only when she offered help to others was she beloved. This sort of suggests that it is important to appreciate the good women in your life before it is too late, which is a pretty good message to give high school kids. I wish my high school teacher had taught me that lesson, because I certainly would have treated Nikki differently when we were first married. Then again, maybe this is the sort of thing you have to learn by living your life - failing like Dimmesdale did, and I guess like I did too.\n That scene when Dimmesdale and Hester finally stand together in town for the first time made me wish apart time was over already so I could stand with Nikki in some public place and apologize for being such a jerk in the past. Then I would tell her my thoughts about Hawthorne\u0027s classic, which would make her happy for sure. God, she is going to be so impressed that I actually read a book written in old-fashioned English. \n","sourceLink":"https://allnovel.net/the-silver-linings-playbook/page-12.html","bookId":1860,"book":{"id":1860,"title":"The Silver Linings Playbook","description":"Storyline: \n Meet Pat Peoples. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure him a happy ending - the return of his estranged wife, Nikki. (It might not come as a surprise to learn that Pat has spent several years in a mental health facility.) The problem is, Pat\u0027s now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he\u0027s being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he\u0027s being haunted by Kenny G!\n \n","cover":"https://allnovel.net/images/the-silver-linings-playbook.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-silver-linings-playbook.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:36:18 PM"}}
