{"id":81803,"no":23,"title":"Page 23","content":"The \"Pat\" Box\\n\\n By 11:00 p.m. my mother has not returned home, and I start to worry because every night at 10:45 p.m. I\u0027m supposed to take pills that help me sleep. It isn\u0027t like Mom to foul up my medication schedule.\\n\\n I knock on my parents\u0027 bedroom door. When no one answers, I push the door open. My father is sleeping with the small bedroom television on. The blue glow makes his skin look alien - he sort of looks like a big fish in a lit aquarium, only without gills, scales, and fins. I walk over to my dad and shake his shoulder lightly. \"Dad?\" I shake him a little harder. \"Dad?\"\\n\\n \"Whaddya want?\" he says without opening his eyes. He is lying on his side, and the left side of his mouth is smashed into the pillow.\\n\\n \"Mom\u0027s not home yet. I\u0027m worried.\"\\n\\n He doesn\u0027t say anything.\\n\\n \"Where is she?\"\\n\\n Still, he does not say anything.\\n\\n \"I\u0027m worried about Mom. Do you think we should call the police?\"\\n\\n I wait for a reply, but only hear my father snoring softly.\\n\\n After turning off the television, I leave my parents\u0027 bedroom and go downstairs to the kitchen.\\n\\n I tell myself if Dad isn\u0027t worried, I shouldn\u0027t be either. But I know it isn\u0027t like Mom to leave me alone without telling me where she will be, especially without talking to me about my medications.\\n\\n I open the kitchen cabinet and take out the eight bottles of pills that all have my name printed on the labels. So many long, depressing drug names are on the labels as well, but I only know the pills by their colors, so I open all the lids and look for what I need.\\n\\n Two white-and-reds for sleeping, and also a green one with a yellow stripe, but I do not know what the green one with a yellow stripe does. Maybe antianxiety? I take all three pills because I want to sleep, and also, I know that is what Mom would want me to do. Maybe Mom is testing me. Since my father talked down to her earlier today, I really want to please Mom even more than on regular days, although I am not sure why.\\n\\n I lie in bed wondering where Mom could be. I want to call her cell phone, but I don\u0027t know the number. Maybe she had a car accident? Maybe she had a stroke or a heart attack? But then I think a police officer or a hospital doctor would have called us by now if any of those things had happened, because she would certainly have her credit cards and license on her. Maybe she got lost while driving? But then she would have used her cell phone to call home and would have told us she was running late. Maybe she got sick of Dad and me and ran away? I think about this and realize that excluding the times when she teases me about Tiffany being \"my friend,\" I haven\u0027t seen my mother laugh or smile in a very long time - in fact, if I really think about it, I often see Mom crying or looking like she is about to cry. Maybe she got sick of keeping track of my pills? Maybe I forgot to flush one morning and Mom found some of my pills in the toilet and is now mad at me for hiding pills under my tongue? Maybe I have failed to appreciate Mom just like I failed to appreciate Nikki, and now God is taking Mom away from me too? Maybe Mom is never coming home again and -\\n\\n Just as I start to feel seriously anxious, as if I might need to bang the heel of my hand against my forehead, I hear a car pull into the driveway.\\n\\n When I look out the window, I see Mom\u0027s red sedan.\\n\\n I run down the stairs.\\n\\n I\u0027m out the door before she even reaches the back porch.\\n\\n \"Mom?\" I say.\\n\\n \"Is-jus-me,\" she says through the shadows in the driveway.\\n\\n \"Where were you?\"\\n\\n \"Out.\" When she enters into the white circle cast from the outside light, she looks like she might fall backward, so I run down the steps and give her a hand, bracing her shoulders with my arm. Her head is sort of wobbly, but she manages to look me in the eyes; she squints and says, \"Nikki-sa-fool t\u0027ave let you getta-way.\"\\n\\n Her mentioning Nikki makes me feel even more anxious, especially what she said about my getting away, because I have not gotten away and would be more than willing to go back to Nikki now or whenever, and it was me who was the fool, never appreciating Nikki for what she was - all of which Mother knows so well. But I can smell the alcohol on her breath; I hear her slurring her words, and I realize it\u0027s probably just the alcohol talking nonsense. Mom does not usually drink, but tonight she is obviously drunk, and this also makes me worry.\\n\\n I help her into the house and sit her down on the couch in the family room. Within minutes she\u0027s passed out cold.\\n\\n It would be a bad idea to put my drunk mother in bed with my sulking father, so I put an arm under her shoulders and another arm under her knees, lift her up, and carry her to my bedroom. Mom is small and light, so it is not hard for me to carry her up the stairs. I get her into my bed, take off her shoes, throw the comforter over her body, and then go to get a glass of water from the kitchen.\\n\\n Back upstairs, I find a bottle of Tylenol and tap out two white pills.\\n\\n I pick my mother\u0027s head up, get her into a seated position, shake her lightly until she opens her eyes, and tell her to take the pills along with the glass of water. At first she says, \"Jus lemme sleep,\" but I know from college days just how much this pre-bed water and headache medicine can reduce the morning hangover. Finally my mother takes the pills, drinks half a glass of water, and is back asleep in no time at all.\\n\\n I watch her rest for a few minutes, and I think she still looks pretty, that I really do love my mom. I wonder where she went to drink - with whom she drank and what she drank - but really I am only happy that she is home safe. I try not to think about her downing drinks at some depressing bar, with middle-aged men all around. I try not to think about Mom bad-mouthing my father to one of her girlfriends and then driving home drunk. But it\u0027s all I can think about: how my mother is being driven to drink - how I\u0027m driving my mother to drink, and my father isn\u0027t helping much either.\\n\\n After grabbing my framed picture of Nikki, I climb the stairs to the attic, set Nikki up next to my pillow, and get into my sleeping bag. I leave the lights on so I can fall asleep looking at Nikki\u0027s freckled nose, which is exactly what I do.\\n\\n When I open my eyes, Kenny G is standing over me, his legs bridging my body, a foot on either side of my chest; the sexy synthesizer chords are softly lighting the darkness.\\n\\n The last time Mr. G visited my parents\u0027 attic flashes through my head - my father kicking and punching me, my father threatening to send me back to the bad place - so I close my eyes, hum a single note, and silently count to ten, blanking my mind.\\n\\n But Kenny G is undaunted.\\n\\n The soprano sax enters Mr. G\u0027s lips once more and \"Songbird\" takes flight. I keep my eyes closed, hum a single note, and silently count to ten, blanking my mind, but he continues to blow his horn. The little white scar above my right eyebrow starts to burn and itch as the melody flutters toward climax. Desperately, I want to pound the heel of my hand against my forehead, but instead I keep my eyes closed, hum a single note, and silently count to ten, blanking my mind.\\n\\n Just when Kenny G\u0027s smooth jazz seems unconquerable -\\n\\n Seven, eight, nine, ten.\\n\\n Suddenly silence.\\n\\n When I open my eyes, I see Nikki\u0027s still face, her freckled nose - I kiss the glass, feeling so relieved that Kenny G has stopped playing. I exit my sleeping bag, look all around the attic - moving a few dusty boxes and other items, searching behind hanging rows of out-of-season clothes - and Mr. G is gone. \"I\u0027ve defeated him,\" I whisper. \"He didn\u0027t make me punch my forehead, and - \"\\n\\n I see a box marked \"Pat\" and begin to experience that bad feeling I sometimes get just before something unpleasant is about to happen. It feels as though I have to go to the bathroom very badly, even though I know I don\u0027t.\\n\\n The box is at the far end of the attic. It was hidden under a braided rug I moved when I was searching for Kenny G. I have to navigate my way back through the mess I made during my search, but soon I reach the box. I flip open the flaps at the top, and my Collingswood High School soccer jacket is on top. I take it out of the box and hold the dusty thing up. The jacket looks so small. I\u0027d rip the yellow leather sleeves off if I tried it on now, I think, and then set the relic down on another nearby box. When I next look into the \"Pat\" box, I am shocked and scared into rearranging the attic so it looks exactly how it was before I began searching for Mr. G.\\n\\n When the attic is restored, I lie in my sleeping bag, feeling as if I am in a dream. Several times during the night I get up, move the braided rug, and look in the \"Pat\" box again, just to make sure I had not hallucinated before. Every time, the contents condemn Mom and make me feel betrayed. \\n\\n","sourceLink":"https://allnovel.net/the-silver-linings-playbook/page-23.html","bookId":1860,"book":{"id":1860,"title":"The Silver Linings Playbook","description":"Storyline: Meet Pat Peoples. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure him a happy ending - the return of his estranged wife, Nikki. (It might not come as a surprise to learn that Pat has spent several years in a mental health facility.) The problem is, Pat\u0027s now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he\u0027s being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he\u0027s being haunted by Kenny G!\\n","cover":"https://allnovel.net/images/the-silver-linings-playbook.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-silver-linings-playbook.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:36:18 PM"}}
