{"id":81805,"no":25,"title":"Page 25","content":"The Asian Invasion After a relatively short workout and an even shorter - and silent - run with Tiffany, I hop a train to Philadelphia. Following Jake\u0027s directions, I walk down Market Street toward the river, turn right on Second Street, and follow the road to his building. When I reach the address, I am surprised to find that Jake lives in a high-rise that overlooks the Delaware River. I have to give my name to the doorman and tell him who I am visiting before he will let me in the building. He\u0027s just an old man in a funny costume, who says \"Go Eagles\" when he sees my Baskett jersey, but my brother having a doorman is sort of impressive, regardless of the man\u0027s uniform. Another old man wears a different sort of funny costume in the elevator - he even has on one of those brimless monkey hats - and this man takes me to the tenth floor after I tell him my brother\u0027s name. The elevator doors open, and I walk down a blue hallway on a thick red carpet. When I find number 1021, I knock three times. \"What\u0027s up, Baskett?\" my brother says after he opens the door. He\u0027s in his Jerome Brown memorial jersey because it\u0027s game day again. \"Come on in.\" There is a huge bay window in the living room, and I can see the Ben Franklin Bridge, the Camden Aquarium, and tiny boats floating on the Delaware. It\u0027s a beautiful view. I immediately notice that my brother has a flat-screen television thin enough to hang on the wall like a picture - and it is even bigger than Dad\u0027s television. But strangest of all, my brother has a baby grand piano in his living room. \"What\u0027s this?\" I ask. \"Check it out,\" Jake says. He sits down on the piano bench, lifts the cover off the keys, and then actually starts playing. I am amazed that he can play \"Fly, Eagles, Fly.\" His version isn\u0027t very fancy, just a simple chord progression, but it\u0027s definitely the Eagles\u0027 fight song. When he begins to sing, I sing along with him. When he finishes, we do the chant and then Jake tells me he has been taking lessons for the past three years. He even plays me another song, which is very unlike \"Fly, Eagles, Fly.\" This next song is familiar - surprisingly gentle, like a kitten walking through high grass - and it seems so unlike Jake to create something this beautiful. I actually feel my eyes moistening as my brother plays with his eyes shut, moving his torso back and forth with the sway of the piece, which also looks funny because he is wearing an Eagles jersey. He makes a couple of mistakes, but I don\u0027t even care, because he is trying very hard to play the piece correctly for me and that\u0027s what counts, right? When he finishes, I clap loudly and then ask him what he was playing. \"Pathetique. Piano Sonata number 8. Beethoven. That was part of the second movement. Adagio cantabile,\" Jake says. \"Did you like it?\" \"Very much.\" Truthfully, I am amazed. \"When did you learn to play?\" \"When Caitlin moved in with me, she brought her piano, and she\u0027s sort of been teaching me all about music ever since.\" I start to feel dizzy because I have never heard mention of this Caitlin, and I think my brother just told me she lives here with him, which would mean my brother is in a serious relationship I know nothing about. This does not seem right. Brothers should know about each other\u0027s lovers. Finally I manage to say, \"Caitlin?\" My brother takes me into his bedroom, and there\u0027s a big wooden poster bed with two matching armoires that look like guards facing each other. He picks up a framed black-and-white photo from the bed stand and hands it to me. In the photo, Jake\u0027s cheek is smashed against a beautiful woman\u0027s. She has short blond hair, cut almost like a man\u0027s, and she is very delicate-looking, but pretty. She is in a white dress; Jake is in a tuxedo. \"That\u0027s Caitlin,\" Jake says. \"She plays with the Philadelphia Orchestra sometimes and does a lot of recording in New York City too. She\u0027s a classical pianist.\" \"Why have I not heard about Caitlin before?\" Jake takes the portrait from my hands and stands it up on the dresser. We walk back into the living room and sit down on his leather couch. \"I knew you were upset about Nikki, so I didn\u0027t want to tell you that I was ... well ... happily married.\" Married? The word hits me like a giant wave, and suddenly I am slick with sweat. \"Mom actually tried to get you out of that place in Baltimore for the Mass, but it was when you were first admitted and they wouldn\u0027t let you out. Mom didn\u0027t want me to tell you about Caitlin yet, so I didn\u0027t at first, but you\u0027re my brother, and now that you\u0027re home, I wanted you to know about my life, and Caitlin\u0027s the best part. I\u0027ve told her all about you and - if you want - you can meet her today. I had her go out this morning while I broke the news to you. I can call her now, and we can have lunch before we go down to the Linc. So, do you want to meet my wife?\" The next thing I know, I\u0027m at a little swanky cafe off South Street, sitting across from a beautiful woman who holds my brother\u0027s hand under the table and smiles at me unceasingly. Jake and Caitlin carry the conversation, and it feels a lot like when I am with Veronica and Ronnie. Jake answers most of the questions Caitlin asks me, because I do not say much at all. No mention is made of Nikki or my time at the bad place or just how bizarre it is that Caitlin has been married to my brother for years, yet I had never met her. When the waiter comes, I say I\u0027m not hungry, because I don\u0027t have very much money on me - only the ten bucks my mother gave me for the subway, since I already spent five bucks on the PATCO ticket. But my brother orders for all of us and says he is treating, which is nice of him. We eat fancy ham sandwiches with some sort of sun-dried tomato paste, and when I finish, I ask Caitlin if the ceremony was a nice one. \"What ceremony?\" she says, and I catch her looking at the little white scar above my right eyebrow. \"Your wedding ceremony.\" \"Oh,\" she says, and then looks lovingly at my brother. \"Yes. It was really nice. We had the Mass at St. Patrick\u0027s Cathedral in New York City and then a small reception at the New York Palace.\" \"How long have you been married?\" My brother shoots his wife a look that I do not miss. \"A while now,\" she says, which makes me feel crazy because everyone present knows that I do not remember the last couple of years - and because she is a woman, Caitlin knows exactly how long she has been married to Jake. It is obvious she is trying to protect me by being vague. This makes me feel awful, even though I realize Caitlin is trying to be kind. My brother pays the bill, and we walk Caitlin back to their apartment building. Jake kisses his wife by the entrance door, and his love for her is so obvious. But then Caitlin kisses me right on the cheek, and with her face only a few inches from mine, she says, \"I\u0027m glad I finally got to meet you, Pat. I hope we\u0027ll become good friends.\" I nod because I don\u0027t know what else to say, and then Caitlin says, \"Go Baker!\" \"It\u0027s Baskett, dummy,\" Jake says, and Caitlin blushes before they kiss again. Jake hails a taxi and tells the driver, \"City Hall.\" In the taxi I tell my brother I don\u0027t have any money to pay for the taxi ride, but he says I never have to pay for anything when I am with him, which is a nice thing to say, but his saying it makes me feel sort of strange. Underneath City Hall, we buy subway tokens, spin a turnstile, and then wait for the southbound Orange Line. Even though it is only 1:30 p.m. and kickoff is not for seven hours yet, even though it is a Monday, a day when most people have to work, many men in Eagles jerseys are already waiting on the platform. This makes me realize that Jake is not working today - it makes me realize I do not even know what Jake does for a living, which really starts to freak me out. I think hard and remember that my brother was a business major in college, but I cannot remember where he works, so I ask him. \"I\u0027m an options trader,\" he says. \"What\u0027s that?\" \"I play the stock market.\" \"Oh,\" I say. \"So who do you work for?\" \"Myself.\" \"What do you mean?\" \"I work for myself and do all my business online. I\u0027m self-employed.\" \"Which is why you could take off early to hang out with me.\" \"That\u0027s the best part about being self-employed.\" I am very impressed with Jake\u0027s ability to support himself and his wife by playing the stock market, but he doesn\u0027t want to talk about his work. He thinks I\u0027m not smart enough to understand what he does; Jake doesn\u0027t even try to explain his work to me. \"So what did you think of Caitlin?\" he asks me. But the train comes, and we join the herd of boarding Eagles fans before I can answer. \"What did you think of Caitlin?\" he asks again after we find seats and the train starts moving. \"She\u0027s great,\" I say, avoiding eye contact with my brother. \"You\u0027re mad at me for not telling you about Caitlin right away.\" \"No, I\u0027m not.\" I want to tell him all about Tiffany following me when I run; finding the \"Pat\" box; how Mom is still on strike and dirty dishes are in the sink and Dad turned his white shirts pink when he did the wash; how my therapist Cliff says I need to stay neutral and not get involved in my parents\u0027 marital problems but only focus on improving my own mental health - but how can I do that when Dad and Mom are sleeping in separate rooms and Dad is always telling me to clean the house and Mom is telling me to leave it filthy - and I was having a hard time keeping it together before I found out my brother plays the piano and trades stocks and is living with a beautiful musician and I have missed his gala wedding and therefore will never see my brother marry, which is something I very much wanted to see, because I love my brother. But instead of saying any of this, I say, \"Jake, I\u0027m sort of worried about seeing that Giants fan again.\" \"Is that why you\u0027ve been so quiet today?\" my brother asks, as if he has forgotten all about what happened before the last home game. \"I doubt a Giants fan will show up at the Green Bay game, but we\u0027re going to set up in a different parking lot anyway, just in case any of the asshole\u0027s friends are looking for us. I got your back. Don\u0027t worry. The fat guys are setting up the tent in the lot behind the Wachovia Center. No worries at all.\" When we arrive at Broad and Pattison, we exit the subway car and climb back up into the afternoon. I follow my brother through the thin crowds of diehards who - like us - have begun tailgating seven hours before kickoff, on a Monday no less. We walk past the Wachovia Center, and when the fat men\u0027s green tent comes into view, I can\u0027t believe what I see. The fat men are outside of the tent with Scott, and they are yelling at someone hidden by their collective girth. A huge school bus painted green - it\u0027s running, and the driver is inching toward our tent. On the hood of the bus is a portrait of Brian Dawkins\u0027s bust, and the likeness is incredible. (Dawkins is a regular Pro Bowler who plays free safety for the Birds.) As we get closer, I make out the words the asian invasion along the side of the bus, which is full of brown-faced men. This early in the afternoon, parking spaces are plentiful, so I wonder what the argument is about. Soon I recognize the voice, which argues, \"The Asian Invasion has been parked in this very spot for every home game since the Linc was opened. It\u0027s good luck for the Eagles. We are Eagles fans, just like you. Superstition or not, our parking the Asian Invasion bus in this very spot is crucial if you want the Birds to win tonight.\" \"We\u0027re not moving our tent,\" Scott says. \"No fucking way. You should have gotten here earlier.\" The fat men reiterate Scott\u0027s sentiment, and things are getting heated. I see Cliff before he sees me. \"Move the tent,\" I say to our friends. Scott and the fat men turn to face me; they look surprised by my command, almost bewildered, as if I have betrayed them. My brother and Scott exchange a glance, and then Scott asks, \"Hank Baskett - destroyer of Giants fans - says, \u0027Move the tent\u0027?\" \"Hank Baskett says, \u0027Move the tent,\u0027\" I say. Scott turns and faces Cliff, who is shocked to see me. Scott says, \"Hank Baskett says, \u0027Move the tent.\u0027 So we move the tent.\" The fat guys groan, but they begin to break down our tailgate party, and soon it is moved three parking spaces over, along with Scott\u0027s van, at which time the Asian Invasion bus pulls forward and parks. Fifty or so Indian men exit - each one of them wearing a green number 20 Dawkins jersey. They are like a small army, and soon, several barbecues are going and the smell of curry is all around us. Cliff played it cool and did not say hello to me, which I realize was his way of saying, \"It\u0027s your call, Pat.\" He simply faded away into the other Dawkins jerseys, so I would not have to explain our relationship, which was kind of him. When we have our tent resituated, when the fat men are inside watching television, Scott says, \"Hey, Baskett. Why did you let the dot heads have our parking spot?\" \"None of them have a dot on their head,\" I say. \"Did you know that little guy?\" Jake asks me. \"Which little guy, me?\" We turn around, and Cliff is standing there with a sizzling platter of vegetables and meat cubes skewered on sticks of wood. \"Indian kabobs. Quite delicious. For allowing us to park the Asian Invasion bus in its usual spot.\" When Cliff lifts the platter up, we each grab an Indian kabob, and the meat is spicy, but delicious, as are the vegetables. \"And the men in the tent - would they also like one?\" \"Hey, fat-asses,\" Scott yells. \"Food.\" The fat men come out and partake. Soon everyone is nodding and complimenting Cliff on his delicious food. \"Sorry for the trouble,\" Cliff says so nicely. He\u0027s been so kind - even after hearing Scott call him a dot head - that I can\u0027t help claiming Cliff as a friend, so I say, \"Cliff, this is my brother, Jake, my friend Scott, and ...\" I forget the fat men\u0027s names, so I just say, \"Friends of Scott.\" \"Shit,\" Scott says. \"You should have just told us you were friends with Baskett here and we wouldn\u0027t have given you any trouble. You want a beer?\" \"Sure,\" Cliff says, putting the empty tray down on the concrete. Scott hands everyone a green plastic cup, we all pour bottles of Yuengling Lager, and then I am drinking beers with my therapist. I am afraid Cliff will yell at me for drinking when I am on medications, but he doesn\u0027t. \"How do you guys know each other?\" one of the fat guys says, and then I realize that by \"you guys,\" he means Cliff and me. I am so happy to be drinking beers with Cliff that I say, \"He\u0027s my therapist,\" before I can remind myself to lie. \"And we are friends too,\" Cliff quickly adds, which surprises me but makes me feel pretty good, especially since no one says anything about my needing a therapist. \"What are your boys doing?\" Jake asks Cliff. I turn around and see ten or so men rolling out huge sheets of Astroturf. \"They are rolling out the Kubb fields.\" \"What?\" everyone says. \"Come on, I\u0027ll show you.\" And this is how we came to play what Cliff calls the Swedish Viking game while tailgating before Monday Night Football. \"Why do a bunch of Indians play a Swedish Viking game?\" one of the fat men asks. \"Because it\u0027s fun,\" Cliff replies, so cool. The Indian men are quick to share their food and are also so knowledgeable regarding Eagles football. They explain Kubb, which is a game where you throw wooden batons to knock down your opponent\u0027s kubbs, which are wooden blocks set up on opposite baselines. The knocked-down kubbs get tossed to the opponents\u0027 field and set up where they land. To be truthful, I am still not exactly sure how it all works, but I know the game ends when you clean the opponents\u0027 field of kubbs and knock down the kubb king, which is the tallest block of wood, set up in the center of the Astroturf. Cliff surprises me by asking if he can be my partner. All afternoon he tells me which blocks to aim for, and we win many games in between bouts of eating Indian kabobs and drinking our Yuengling Lager and the Asian Invasion\u0027s India Pale Ale out of green plastic cups. Jake, Scott, and the fat men assimilate into the Asian Invasion tailgate party very nicely - we have Indians in our tent, they have white guys on their Kubb fields - and I think all it really takes for different people to get along is a common rooting interest and a few beers. Every so often one of the Indian men yells \"Ahhhhhhhh!\" and when we all do the chant, we are fifty or so men strong, and our \"E!-A!-G!-L!-E!-S! EAGLES!\" is deafening. Cliff is deadly with his wooden batons. He mostly carries our team as we play Kubb against various groupings of men, but we end up winning the money tournament, in which I did not even know we were playing until we won. One of Cliff\u0027s boys hands me fifty dollars. Cliff explains that Jake paid my entry fee, so I try to give my brother my winnings, but Jake will not let me. Finally, I decide to buy rounds of beer inside the Linc, and I stop arguing with my brother over money. After the sun sets, when it is just about time to go into Lincoln Financial Field, I ask Cliff if I can talk to him alone, and when we walk away from the Asian Invasion, I say, \"Is this okay?\" \"This?\" he replies, and the glassy look in his eyes suggests he is a little drunk. \"The two of us hanging out like boys. What my friend Danny would call \u0027representing.\u0027\" \"Why not?\" \"Well, because you are my therapist.\" Cliff smiles, holds up a little brown finger, and says, \"What did I tell you? When I am not in the leather recliner ...\" \"You\u0027re a fellow Eagles fan.\" \"Damn right,\" he says, and then claps me on the back. After the game I catch a ride back to Jersey on the Asian Invasion bus, and the Indian men and I sing \"Fly, Eagles, Fly\" over and over again because the Eagles have beaten the Packers 31 - 9 on national television. When Cliff\u0027s friends drop me off in front of my house, it\u0027s after midnight, but the funny driver, who is named Ashwini, hits the horn on the Asian Invasion bus - a special recording of all fifty members screaming \"E!-A!-G!-L!-E!-S! EAGLES!\" I worry that maybe they have woken up everyone in my neighborhood, but I can\u0027t help laughing as the green bus pulls away. My father is still awake, sitting on the family-room couch watching ESPN. When he sees me, he doesn\u0027t say hello, but loudly begins to sing, \"Fly, Eagles, fly. On the road to victory ...\" So I sing the song one more time with my father, and when we finish the chant at the end, my dad continues to hum the fight song as he marches off to bed without so much as asking me a single question about my day, which has been extraordinary to say the least, even if Hank Baskett only had two catches for twenty-seven yards and has yet to find the end zone. I think about cleaning up my father\u0027s empty beer bottles, but I remember what my mother told me about keeping the house filthy while she is on strike. Downstairs, I hit the weights and try not to think about missing Jake\u0027s wedding, which still has me down some, even if the Birds did win. I need to work off the beer and the Indian kabobs, so I lift for many hours.","sourceLink":"https://allnovel.net/the-silver-linings-playbook/page-25.html","bookId":1860,"book":{"id":1860,"title":"The Silver Linings Playbook","description":"Storyline: Meet Pat Peoples. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure him a happy ending - the return of his estranged wife, Nikki. (It might not come as a surprise to learn that Pat has spent several years in a mental health facility.) The problem is, Pat\u0027s now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he\u0027s being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he\u0027s being haunted by Kenny G!","cover":"https://allnovel.net/images/the-silver-linings-playbook.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-silver-linings-playbook.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:36:18 PM"}}
