{"id":81806,"no":26,"title":"Page 26","content":"Weathering the Relative Squalor\n When I ask to see Jake\u0027s wedding pictures, my mother plays dumb. \"What wedding pictures?\" she asks. But when I tell her I have met Caitlin - that we had lunch together and I have already accepted my sister-in-law\u0027s existence as fact - my mother looks relieved and says, \"Well then, I guess I can hang up the wedding photos again.\"\n She leaves me sitting in the living room by the fireplace. When she returns, she hands me a heavy photo album bound in white leather and begins to stand large frames up on the mantel - pictures of Jake and Caitlin previously hidden for my benefit. As I flip through the pages of my brother\u0027s wedding album, Mom also hangs up a few portraits of Jake and Caitlin on the walls. \"It was a beautiful day, Pat. We all wished you were there.\"\n The massive cathedral and the plush reception hall suggest that Caitlin\u0027s family must have what Danny calls \"mad cheddar,\" so I ask what Caitlin\u0027s father does for a living.\n \"For years he was a violinist for the New York Philharmonic, but now he teaches at Juilliard. Music theory. Whatever that means.\" Mom has finished hanging the framed pictures, and she sits next to me on the couch. \"Caitlin\u0027s parents are nice people, but they\u0027re not really our kind of people, which became painfully obvious during the reception. How do I look in the pictures?\"\n In the photos, my mother wears a chocolate brown dress and a bloodred sash over naked shoulders. Her lipstick matches the sash perfectly, but it looks as if she has on too much eye makeup, making her look sort of like a raccoon. On the plus side, her hair is in what Nikki used to call \"a classic updo\" and looks pretty good, so I tell Mom she photographs well, which makes her smile.\n Tension occupies my father\u0027s face; he does not look comfortable in any of the pictures, so I ask if he approves of Caitlin.\n \"She\u0027s from a different world as far as your father\u0027s concerned, and he did not enjoy interacting with her parents - at all - but he\u0027s happy for Jake, in his own non-expressive way,\" Mom says. \"He understands that Caitlin makes your brother happy.\"\n This gets me thinking about how strange my father was at my own wedding, refusing to speak to anyone unless he was spoken to first and then answering everyone with monosyllabic responses. I remember being mad at my father during the rehearsal dinner because he would not even look at Nikki, let alone interact with her family. I remember my mother and brother telling me that Dad did not deal well with change, but their explanation meant nothing to me until the next day.\n Halfway through the Mass, the priest asked the congregation if they would hold Nikki and me up in their prayers, and as instructed, we turned to face the response. I instinctively looked toward my parents, curious to see if my father would say the words \"we will\" like he was supposed to, chanting along with everyone else, and this is when I saw him wiping his eyes with a tissue and biting down on his lower lip. His whole body was trembling slightly, as if he were an old man. It was the strangest sight, my father crying during a wedding that had seemed to make him so annoyed. The very man who never showed any emotions other than anger was crying. I kept staring at my father, and when it became obvious that I was not going to turn back toward the priest, Jake - who was my best man - had to give me a little nudge to break the spell.\n Sitting on the couch with my mother, I ask her, \"When were Caitlin and Jake married?\"\n My mother looks at me strangely. She doesn\u0027t want to mention the date.\n \"I know it happened when I was in the bad place, and I also know that I was in the bad place for years. I\u0027ve accepted that much.\"\n \"Are you sure you really want to know the date?\"\n \"I can handle it, Mom.\"\n She looks at me for a second, trying to decide what to do, and then says, \"The summer of 2004. August seventh. They\u0027ve been married for just over two years now.\"\n \"Who paid for the wedding photos?\"\n My mother laughs. \"Are you kidding me? Your father and I never could have afforded that fancy sort of wedding album. Caitlin\u0027s parents were very generous, putting together the album for us and allowing us to blow up whatever photos we wanted and - \"\n \"Did they give you the negatives?\"\n \"Why would they give us - \"\n She must see the look on my face, because Mom stops speaking immediately.\n \"Then how did you replace the photos after that burglar came and stole all the framed photos in the house?\"\n Mother is thinking how best to answer as I wait for her response; she begins chewing on the inside of her cheek the way she sometimes does when she is anxious. After a second, she calmly says, \"I called up Caitlin\u0027s mother, told her about the burglary, and she had copies made that very week.\"\n \"Then how do you explain these?\" I say just before pulling framed wedding pictures of Nikki and me out from behind the pillow at the far end of the love seat. When my mother says nothing, I stand and return my wedding picture to its rightful place on the mantel. Then on the wall by the front window I rehang the picture of my immediate family gathered around Nikki in her wedding dress - her white train spilling out across the grass toward the camera. \"I found the \u0027Pat\u0027 box, Mom. If you really hate Nikki so much, just tell me, and I\u0027ll hang the pictures up in the attic, where I sleep.\"\n Mom doesn\u0027t say anything.\n \"Do you hate Nikki? And if so, why?\"\n My mother will not look at me. She\u0027s running her hands through her hair.\n \"Why did you lie to me? What else have you lied about?\"\n \"I\u0027m sorry, Pat. But I lied to ...\"\n Mom does not tell me why she lied; instead she starts to cry again.\n For a very long time, I look out the window and stare at the neighbors\u0027 house across the street. Part of me wants to comfort my mother - to sit down next to her and throw an arm over her shoulders, especially since I know my father has not talked to her in more than a week and is happily eating takeout three times a day, doing his own laundry, and weathering the relative squalor. I have caught Mom cleaning here and there, and I know she is a little upset about her plan not working out like she hoped it would. But I am also mad at my mother for lying to me, and even though I am practicing being kind rather than right, I can\u0027t find it in me to comfort her right now.\n Finally I leave Mom crying on the couch. I change, and when I go outside for a run, Tiffany is waiting. \n","sourceLink":"https://allnovel.net/the-silver-linings-playbook/page-26.html","bookId":1860,"book":{"id":1860,"title":"The Silver Linings Playbook","description":"Storyline: \n Meet Pat Peoples. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure him a happy ending - the return of his estranged wife, Nikki. (It might not come as a surprise to learn that Pat has spent several years in a mental health facility.) The problem is, Pat\u0027s now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he\u0027s being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he\u0027s being haunted by Kenny G!\n \n","cover":"https://allnovel.net/images/the-silver-linings-playbook.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-silver-linings-playbook.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:36:18 PM"}}
