{"id":72323,"no":16,"title":"Page 16","content":"Just then, Emily spied Jordan rounding the corner. She was wearing a pair of khaki Bermuda shorts and a sky-blue T-shirt Emily had loaned her. The same silk headband held back her long, dark hair.\\n\\n “Uh, I can’t,” she said.\\n\\n “Why not?” Aria sounded worried. “Is everything okay?”\\n\\n “Everything’s great,” Emily said in a lower voice. “Better than great, actually.” She peeked at Jordan as she strode toward her, a huge smile on her face. “I’ve made an amazing new friend.”\\n\\n “Oh!” Aria sounded pleased. “That’s nice. At least something good is happening on this trip. Do I get to meet her?”\\n\\n Emily chewed on the tip of her sunglasses. Aria might not approve of the fact that she was hiding someone in her room. They were in enough trouble as it was.\\n\\n “Um, I’ll get back to you on that,” she said abruptly, and then hung up.\\n\\n She dropped her phone in her bag and smiled at Jordan. “What are we up to today?” She nudged her playfully. “It had better be good. I’m skipping bird-watching for this.” Her bird-watching instructor had a beach expedition planned, though if it was anything like yesterday’s watch, Emily would be so bored that she’d almost fall asleep while staring through the binoculars. There was only so much excitement she could muster up for sea terns and pelicans.\\n\\n Jordan extended a hand to help Emily up. “We’re going ashore.”\\n\\n “Are you sure it’s a good idea to leave the boat?” Emily asked incredulously. “I don’t want you to get in trouble.”\\n\\n Jordan raised one shoulder. “Live a little! Now c’mon, cutie!”\\n\\n Cutie. Jordan had also called her hot stuff, honey, and hot cakes. Maya St. Germain used to call her names like that, and Emily had to admit she liked it. Since Emily had met Jordan, her fascination had morphed into a full-blown crush. They’d stay up each night, talking about their lives. Jordan didn’t make fun of Emily for any of the babble that spilled from her mouth, like Ali had. She just listened with an intrigued smile on her face, as though Emily were the most interesting person in the world.\\n\\n They walked down the ramp off the boat and stepped into the humid Puerto Rico air. The sun glimmered on the water. They passed a clump of kids wearing T-shirts from Ulster Prep, Jordan’s school. “Do you want to say hi?” Emily asked.\\n\\n Jordan looked at her blankly. “To whom?”\\n\\n “To …” Emily trailed off. They’d already passed the Ulster kids; the moment was gone.\\n\\n “So what are we going to do?” she asked instead. “Wander the streets? Sit at a café and listen to mariachi music?”\\n\\n “Patience, grasshopper.” Jordan bumped Emily’s hip, then took a sharp left and walked to a second dock full of tethered yachts and sailboats. She marched down the dock as though she knew it, stopping at a long, square, motorboat bobbing gently on the waves. “This’ll work,” Emily thought she heard her mumble.\\n\\n She stepped onto the boat. It rocked slightly under her weight, and she stretched out her arms for balance. She strolled to the cockpit and peered at the gauges. Then she opened a hatch next to the steering wheel. After a bit of fiddling, the motor started up.\\n\\n “Well?” she called to Emily over the growling sounds. “Are you coming aboard or not?”\\n\\n Emily blinked. “Is this your boat?”\\n\\n Jordan laughed. “No, silly!”\\n\\n “Then what are you doing?”\\n\\n Jordan leaned against the steering wheel. “Whoever it belongs to hasn’t tended to it for a long time.” She pointed to a sticker on the side. “See? The license is out of date. And there’s a ton of film on the side—it hasn’t been cleaned in years.” She patted one of the leather seats. “Poor old girl. You miss going out to sea, don’t you?”\\n\\n “But we could get in huge trouble! I thought you were trying to stay under the radar!”\\n\\n Jordan grabbed a captain’s hat that was hanging from a peg by the wheel and popped it on her head. “Life isn’t worth living if you’re scared all the time.”\\n\\n Emily glanced over her shoulder, half expecting to see A’s shadow slipping behind a Chris-Craft parked near them. But no one was there. It was just her and Jordan and a dockful of boats. Jordan was right: She was scared all the time. When had she last actually had fun?\\n\\n She tentatively put one foot onto the boat. “Just a little ride, okay?”\\n\\n “Yay!” Jordan whooped, rushing over to help Emily aboard. She gave Emily a huge hug, holding her for a few extra beats. Emily’s skin tingled. The promise of more hugs like that was reason alone for breaking the rules.\\n\\n Jordan untied the boat from the slip. Then, with a spin of the wheel, she backed the boat into the harbor. A salty-smelling breeze kicked up, blowing Emily’s hair around her face. In seconds, they were passing the cruise ship, then a bunch of sailboats. As they rounded the old fort on the outskirts of town, Emily looked down and noticed something. The bottom of the boat was glass. Fish swam gracefully just inches below her, visible in the bright sunlight.\\n\\n “Oh my God!” She placed her palms on the glass. “Jordan! Come see!”\\n\\n Jordan let the boat idle and walked into the hull, too. Tropical fish glided under her feet. Ocean plants waved gently. “Wow,” she said.\\n\\n “I’ve never seen anything like it,” Emily breathed. “We don’t even need a dive mask!”\\n\\n They watched the water in awe for a few minutes. But as Emily stared at the abyss, her happy mood began to shift. Not even a year ago, Tabitha had been washed away in this very same sea. Fish just like these had swum around her body impassively, witnessing it wasting away. Seaweed had lodged in her hair and ears. The salty water had eroded her slowly, meticulously, until only bones were left.\\n\\n A strange noise gurgled from the back of her throat. Jordan turned. “Are you okay?”\\n\\n “I’m fine,” Emily managed.\\n\\n Jordan inched closer, her green eyes wide. “No, you’re not. Are you freaked that we took this boat?”\\n\\n Emily wrapped her arms across her chest, suddenly cold. I’m freaked about everything, she wanted to say. But if she opened her mouth, she feared all her secrets would spill out in a matter of minutes. She couldn’t tell Jordan about Tabitha. It was too dangerous.\\n\\n “I’m glad we’re out here,” she finally managed. “I needed to do this. Get away from my life.”\\n\\n Jordan cocked her head. “Things at home are really that bad, huh?”\\n\\n Emily nodded, feeling a lump in her throat.\\n\\n “Your parents?” Jordan guessed. “You said they didn’t want you around.”\\n\\n Tears pricked Emily’s eyes, and she nodded again. “They hate me.”\\n\\n “What happened, exactly?”\\n\\n Emily eyed her, then took a deep breath. This was one secret she could share. “They found out I had a baby last summer. When I told them last week, they didn’t just freak—they shut down.”\\n\\n Jordan blinked slowly. “You had a baby?”\\n\\n Emily winced at Jordan’s shocked tone of voice. She was probably disgusted. But then she looked at Jordan’s face. It was kind and accepting. Go on, her expression seemed to say. I’m listening. I’ll like you anyway.\\n\\n It all spilled out of her. The part about Gayle. Even reneging on the offer and leaving the baby on the Bakers’ doorstep. “After Isaac found out, I just thought it was time for my parents to know,” she said. “But now it’s like I’m no longer part of the family. They’ve been pissed at me before, but this is in a totally different league. I know I should hate them, but I miss them so much.”\\n\\n She stared down at the fish floating by, tears in her eyes. Everything she said was painfully true. She’d been through a lot with her family, but she thought they were all beginning to understand one another. What she’d done had ruined things between them for good.\\n\\n Jordan moved closer and touched Emily’s hand. “You are so, so brave,” she said quietly. “I couldn’t do what you did. Not any of it.”\\n\\n Emily blinked away tears. “It was really, really hard.”\\n\\n “What was it like?” Jordan’s eyes were wide. “To be pregnant, I mean. To give birth. To go through something so … earth-shattering. I can’t imagine it.”\\n\\n “Scary,” Emily answered. “But also amazing. My favorite part was feeling her kick. I would lie down at night and put my hand on my belly and just stay that way for hours. At first, it’s like this little flutter inside of you. But then, as she got bigger, the kicks were stronger. It was kind of mind-blowing.”\\n\\n “Wow,” Jordan whispered.\\n\\n Tears welled in her eyes, and she glanced at Jordan gratefully. “No one ever asked me that, you know. It was always about what I’d done wrong or what a horrible person I was.”\\n\\n “You’re not horrible,” Jordan said. “You’re incredible.”\\n\\n Emily peeked at Jordan bashfully. “I think you’re incredible, too,” she whispered.\\n\\n Jordan placed one finger on Emily’s knee. Instead of pulling away a split second later, she let it remain there. Emily stared at Jordan’s pink, moon-shaped nail, then slid closer. Her heart started to pound. Before she knew it, their lips were touching. Emily’s nose filled with the heady aroma of jasmine perfume. She ran her fingers up and down Jordan’s bare arms. Her skin was as soft as petals.\\n\\n They pressed close together, inhaling each other, and when they broke away, they stared into each other’s eyes.\\n\\n “Yay,” Jordan whispered giddily. “I was hoping that would happen.”\\n\\n “Yay for me,” Emily insisted, curling in Jordan’s lap and staring at the clouds.\\n\\n “Yay for us,” Jordan corrected. And then she took off the captain’s hat, placed it on Emily’s head, and opened her arms again.\\n\\n 14\\n\\n SPENCER’S UNEXPECTED SWIM\\n\\n “Here you are!” A Latin waitress plopped down a large tray in front of Spencer and Reefer. “The six ceviche tasting menu! ¡Buen apetito!”\\n\\n As she strode away, shaking her ample hips, Spencer stared down at the six small bowls. “I can’t believe you talked me into this. I’ve been to the Caribbean seventeen times, and I’ve managed to avoid ceviche until now.”\\n\\n “Aw, a ceviche virgin!” Reefer pushed a fork at her. “C’mon. You have to try some. You’ll love it.”\\n\\n Spencer looked up, stalling. It was Thursday night, and they were at an outdoor Latin restaurant in Old San Juan. Palm trees surrounded them, and every table bore a flickering votive candle and a vase of tropical flowers. A band played upbeat, wild music, and several couples were salsa-dancing near the stage. To add to the sexy vibe, a blue infinity pool rippled off in the distance. Spencer had already seen two couples strip down to bathing suits and dive into the pool as an alternative to dessert.\\n\\n Before their dive that morning, the dive class had watched a film about Jacques Cousteau. For the rest of the afternoon, Spencer had prepared for their dinner out. Now her blond hair spilled down her back, her skin glowed from a body facial, and her nails had been painted a shade of red called Vixen. She’d pored through her and Kirsten’s cruise wear until she’d decided on a turquoise strapless linen dress that screamed I’m gorgeous, but I don’t try very hard. As soon as Reefer had seen the dress, he’d remarked that it was his favorite color. \\n\\n","sourceLink":"https://allnovel.net/burned-pretty-little-liars-12/page-16.html","bookId":2388,"book":{"id":2388,"title":"Burned (Pretty Little Liars #12)","description":"Storyline: Burned (Pretty Little Liars #12) \\n It\u0027s spring break, and the pretty little liars are trading in Rosewood for a cruise vacation. They want nothing more than to sail into the tropical sunset and leave their troubles behind for one blissful week. But where Emily, Aria, Spencer, and Hanna go, A goes, too. From scuba diving to tanning on the upper deck, A is there, soaking up all their new secrets. \\n Emily is smooching a stowaway. Aria\u0027s treasure-hunting partner is a little too interested in her booty. Spencer\u0027s going overboard trying to land a new boy. And a blast--or rather, a crash--from Hanna\u0027s past could mean rough waters ahead for everyone. \\n The liars better tighten their life jackets. A perfect storm is brewing, and if they aren\u0027t careful, A will bury them at sea. . . .\\n","cover":"https://allnovel.net/images/burned-pretty-little-liars-12.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/burned-pretty-little-liars-12.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:15 AM"}}
