{"id":72349,"no":29,"title":"Page 29","content":"She tried to breathe in again, but she couldn’t inhale. Suddenly desperate, she fiddled with her dive mask—perhaps it wasn’t lined up properly with her mouth. But it was, and yet she still couldn’t draw a breath. Her heart began to pound. She tried to swim to the surface, but her arms and legs felt like dead weights. She checked her pressure gauge again, but the tank was still full. That was impossible, though—she definitely wasn’t getting oxygen.\\n\\n She gasped for air, an idea forming in her mind. She’d heard about this kind of thing happening. People could mess with the gauges, make them appear at the right levels when in fact the tank was empty. She knew that was what had happened. And she knew who had done it, too. A.\\n\\n Spencer woozily glanced through the water, finding Naomi within the clump of divers in the distance. The baby oil and bed-breaking tricks were child’s play compared to cutting off her oxygen supply. Of course Naomi still hated her! And to think, Spencer thought she was safe just because she’d broken up with Reefer!\\n\\n “Mmm!” she cried, the sound getting swallowed up in the water. Spots were starting to form in front of her eyes. She flailed her arms and legs and weakly called out for help, but the divers were too far away to notice. She kicked closer. By now her lungs were burning, greedy for air.\\n\\n “Mmm!” she called out, waving her arms some more. But all the divers’ backs were to her. Spencer’s eyes started to close. Her neck lolled back, and her body suddenly felt heavy. Darkness crept in, obscuring her vision. Her leg bumped a piece of rock, but she couldn’t move. She had no energy to move. This was the end, and she couldn’t even fight.\\n\\n A warm feeling washed over her body, and she allowed herself to sink. She couldn’t hear breathing in her ears any longer. Her eyes fluttered closed. The last thing she saw was a light coming toward her, filling her field of vision …\\n\\n Then, air pushed into Spencer’s lungs, and she opened her eyes with a jolt. She coughed violently, and salt water spewed from her mouth and exploded from her nose, burning her nostrils. She was lying on the deck of the boat again. Reefer crouched over her, his lips wet, a relieved look on his face.\\n\\n “Oh my God,” he breathed. “Are you okay?”\\n\\n Spencer tried to speak, but another cough came out instead. She rolled over to her side and waited for the water to drain from her ears. For a split second, she thought Reefer had just been kissing her, that their break-up had been a dream. But then everything rushed back.\\n\\n “What … happened?” she croaked.\\n\\n “You just started sinking,” Reefer said. “I found you and pulled you to the surface, then gave you mouth-to-mouth. Tim checked your gauges—you had no oxygen left in your tank.”\\n\\n A chill snaked up her spine. She searched the crowd of kids that had gathered on the boat and found Naomi lurking at the back, her gaze bouncing from Spencer to Reefer. Her lips were pressed together so tightly they were almost transparent, and her eyes were round and wide. She looked shaken—maybe because Reefer was comforting Spencer.\\n\\n Or maybe because her plan to hurt Spencer had failed.\\n\\n 27\\n\\n SURPRISE INSIDE\\n\\n A few hours later, Aria glanced at herself in the full-length mirror near the auditorium. She was wearing the skimpy bikini she’d had on for her first swim lesson with Noel, the grass skirt, a bunch of beaded necklaces, and her lace-up sandals. As a final touch, she’d popped a flower behind her ear.\\n\\n She looked across the auditorium lobby. A girl passed carrying a portable easel under her arm. Several kids held instrument cases. Jeremy, still in his star-shaped sunglasses, ran past them with a clipboard in hand, looking frazzled. Two men in suits and a woman in a ball gown, presumably the other judges, followed behind him. Everyone was talking excitedly, and the room had a festive, free-for-all attitude about it. Hundreds of balloons floated along the ceiling and Hollywood Walk-of-Fame stars lined the ground.\\n\\n She spied Noel near one of the auditorium entrances and almost burst out laughing. He was wearing a baggy, shiny tracksuit and a bunch of gold chains around his neck. She ran over to him. “You look more like a gym teacher than a rapper!”\\n\\n Noel twisted the baseball cap he had on his head sideways and crossed his arms over his chest, gangsta-style. “You just wait until you hear my rhymes. Mike and I are so ready for this.”\\n\\n “When are you on?” Aria asked.\\n\\n “Seven-thirty. You?”\\n\\n Aria checked her phone; she and everyone else participating in the talent show had been sent a schedule of events. “Seven,” she said. “I think we’re one of the first acts.” It was six-thirty.\\n\\n Noel looped his arm in her elbow. “Let’s check out the food.”\\n\\n They walked into the auditorium and down the aisles to the stage area, where a bar and food tables had been set up. Several rows of chairs had been removed to make room for a makeshift dance floor. As they maneuvered past a group of girls practicing a series of cheerleading tumbling passes, Aria punched Emily’s number into her phone once more. Voicemail again. This was the third time she’d tried Emily in the last few hours. She thought about the news alert on the TV screen when she’d left her room. PREPPY THIEF JUMPS OFF CRUISE SHIP IN BERMUDA, it had said. FBI AGENTS COMBING HARBOR. It certainly explained all the FBI ships in the harbor the last time Aria had looked out the porthole. Apparently, the girl hadn’t gotten off the boat at the last port, as Emily had said.\\n\\n There was a beep, and then Aria said, “Em, I’m at the talent show. I hope everything’s okay and you’re still up to performing. Call me when you get this.” She dropped her phone back into her clutch, then scanned the masses of kids running in every direction. Spencer was missing, too, as was Hanna.\\n\\n Noel grabbed an empty plate and waited in line at a table filled with silver tureens full of food. “So where’s Graham?”\\n\\n Aria looked away, feeling a sharp pull in her stomach. “I don’t know.”\\n\\n Noel raised his eyebrows. “I thought you guys were best buds.”\\n\\n Aria fingered her grass skirt. “The hunt is over. I guess we didn’t have as much in common as we thought.”\\n\\n “Did you get him that girlfriend like you promised?”\\n\\n She kept her eyes fixed on the tray of shiny forks and spoons on the table. “Turns out she wasn’t his type.”\\n\\n She could feel Noel’s gaze on her, trying to figure out what she wasn’t telling him. She probably should tell him the truth—it was part of their pact, after all—but if he found out the guy had practically grabbed her boobs, he’d probably bust his door down and try to beat him up. It was better that he thought Graham had just lost interest. If only that really was what happened. The muscles in her neck ached from when Graham had yanked her forward. His furious expression flashed in her mind again and again, and her stomach clenched when she thought about how he’d chased her to the stairs.\\n\\n “Hey, party people!” Jeremy called from the stage. Shabby-looking guys in roadie T-shirts and ripped jeans scuttled behind him, setting up equipment. “I realize we’re still setting up, but to get you in the mood, I have a huge surprise for you. A special guest has joined us to perform a few songs as a pre-show event. Without further ado, put your hands together for … Vegan Sunrise!”\\n\\n Aria looked at Noel questioningly; she’d never heard of them. Kids clapped halfheartedly, looking just as confused. But when four band members took the stage and started playing a guitar-heavy cover of “When I Come Around,” everyone shrugged and started dancing.\\n\\n The food line moved, and Aria and Noel filled their plates. She checked her phone a few more times, but still no Emily or Spencer. The crowd got more raucous and excited, and a girl’s elbow flew out of nowhere, knocking Aria’s plate from her hands. She twisted to grab it, but her ankle turned awkwardly, and down she went, too. She felt herself falling but couldn’t do anything about it; in seconds, she was on the floor, vegetarian noodles in her hair. A ping sounded in her ear. At first, she thought it was the fork bouncing off the ground, but when she picked herself up, she realized that it was her locket. Its two halves had sprung open from the fall.\\n\\n “Are you okay?” Noel asked, extending his arm to help Aria up.\\n\\n “Sure,” Aria said, picking up her spilled food as best she could and tossing it into a nearby trash can. Then she turned back to the locket. Inside was a picture of two blond, smiling girls, their cheeks pressed together. As she squinted, she slowly realized that she knew the girls. The one on the right had a round face, big blue eyes, and faint burn scars on her neck. Tabitha.\\n\\n Then she looked at the girl on the left. Her eyes slowly scanned her familiar heart-shaped face, her big blue eyes. She drew back, startled. No. It couldn’t be.\\n\\n She held the locket away from her face, but the girl’s eyes seemed to follow her. She had a manipulative, winning smile that had entranced Aria for years. A scream froze in Aria’s throat. All of a sudden, she couldn’t breathe.\\n\\n Ali.\\n\\n “Aria?”\\n\\n Aria looked up and blinked. Noel was staring at her from a few feet away. She gave him a tight, nervous smile and shut the locket fast. The catch had broken, though, and the locket sprung right back open. She stared at the picture once more. It couldn’t be. Surely her brain was playing tricks on her. She tried to close it again, then peered carefully at the front of the pendant. In the strong overhead stage lights, the initial inscribed into the silver wasn’t an I or a J. It was a T.\\n\\n For Tabitha?\\n\\n Something suddenly clicked in her brain. Heart thudding, she grabbed her phone, pulled up the Tabitha Clark Memorial website, and stared hard at the picture of the girl on the home page. That was where she had seen this necklace before. On Tabitha, before she died.\\n\\n She held up the necklace. “W-where did you really find this?”\\n\\n Noel looked confused. “I told you. It was in the sand in St. Martin. Why?”\\n\\n Aria’s thoughts scattered in a million different directions. “That’s impossible,” she whispered. It couldn’t be a coincidence. Had A planted it for Noel to find? And then there was the picture—Tabitha and Ali had been friends.\\n\\n She took a step, but her legs felt wobbly. “Aria?” Noel touched her arm. “What is it?”\\n\\n “I just have to …,” she said faintly. She staggered toward the exit. Her phone beeped. It was Graham. Panicked, Aria hit IGNORE, then dialed Spencer’s number. But the call went to voicemail.\\n\\n “Where are you?” Aria demanded after the beep. “We need to talk.”\\n\\n But she was afraid to say anything over the phone, so she hung up and kept running. She called Emily next, but she didn’t answer either. Same with Hanna. She ran up the aisle and sprinted to the elevator, pressing the UP button repeatedly.\\n\\n “Aria?”\\n\\n Aria turned. Graham was standing by the window, staring at her. “You walked right past me,” he said, looking annoyed. “Why didn’t you answer my call? I need to talk to you.”\\n\\n “I …” Aria trailed off, her gaze dropping to the locket in her hands. Graham was looking at it, too. His eyebrows met. His mouth grew very small, and all of a sudden, he reached out and touched her wrist. She gasped and closed her fist around it, but it was too late. Of course Graham recognized his girlfriend’s old necklace. He’d probably recognized it from earlier. \\n\\n","sourceLink":"https://allnovel.net/burned-pretty-little-liars-12/page-29.html","bookId":2388,"book":{"id":2388,"title":"Burned (Pretty Little Liars #12)","description":"Storyline: Burned (Pretty Little Liars #12) \\n It\u0027s spring break, and the pretty little liars are trading in Rosewood for a cruise vacation. They want nothing more than to sail into the tropical sunset and leave their troubles behind for one blissful week. But where Emily, Aria, Spencer, and Hanna go, A goes, too. From scuba diving to tanning on the upper deck, A is there, soaking up all their new secrets. \\n Emily is smooching a stowaway. Aria\u0027s treasure-hunting partner is a little too interested in her booty. Spencer\u0027s going overboard trying to land a new boy. And a blast--or rather, a crash--from Hanna\u0027s past could mean rough waters ahead for everyone. \\n The liars better tighten their life jackets. A perfect storm is brewing, and if they aren\u0027t careful, A will bury them at sea. . . .\\n","cover":"https://allnovel.net/images/burned-pretty-little-liars-12.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/burned-pretty-little-liars-12.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:15 AM"}}
