{"id":72308,"no":6,"title":"Page 6","content":"“Drinks are half-off right now,” he said, pointing to the bar. “Come in for happy hour.” “Uh, I have a boyfriend,” Hanna said quickly. One corner of the guy’s mouth turned up. “I’m the bartender. I’m just on a break right now. I’m not trying to hit on you.” Hanna peered into the bar. It wasn’t really her type of place—there was an outdated Phillies schedule in the window, a naked girl–silhouette doormat at the front door, and the smell of stale beer and cigarettes. But there was an old-timey jukebox in the back playing a classic country song. No one knew, but old country songs were her weakness. She wanted to sit in the darkness and not think for a while. Besides, this didn’t seem like the kind of place anyone from her dad’s campaign would go, meaning they wouldn’t catch her. So she followed the guy in. A couple of downtrodden-looking men and women nursed beers at the bar, and two guys were halfheartedly playing darts in the back. The bartender who’d coaxed her inside had now taken his post behind the counter. “I’m Jackson, by the way,” he’d said. “What can I get you?” Hanna didn’t really want anything to drink, but she asked for a margarita anyway. As she inhaled the drink’s syrupy sweetness someone called out from the other end of the bar, “Watch out. Those things are super potent.” It was a slender girl a few years older than Hanna with wide blue eyes and high cheekbones. There was something sporty about her broad shoulders, freshly scrubbed skin, and high blond ponytail. She nudged her chin toward Hanna’s drink. “Seriously. Jackson should have warned you.” Hanna licked her fingers clean. “Thanks. I’ll remember that.” The girl grabbed her cocktail, got up, and slid into a seat next to her. “He’s kind of cute.” Hanna shrugged. “He looks like he rows crew. Not my thing.” The girl sipped her drink. “I dare you to ask him to do a shot with us.” “That’s okay,” Hanna said quickly. She wasn’t in the partying mood. The girl cocked her head. “Is someone scared?” Hanna flinched. Ali used to dare Hanna, Emily, Aria, and Spencer to do all kinds of things they didn’t want to do, teasing that they were scared when they refused. She always made them feel like such losers. “Fine.” Hanna flagged Jackson over and ordered three lemon drops—one for him, too. The bartender and the girl knocked theirs back, but Hanna dumped hers on the floor when they weren’t looking. The girl sloppily wiped her mouth and gave Hanna an approving grin. “What’s your name, anyway?” “Olivia.” Hanna blurted out the first name that came to mind. It was the name of her father and Isabel’s wedding planner, whom she’d spoken with earlier that day. “I’m Madison.” Madison raised her empty shot glass. “I’m having one last hurrah before I head back to Penn State. I’m on academic probation there, and if they catch you with even the teensiest bit of alcohol on your breath, they go ballistic. Where do you go to school?” “Temple.” It was another think-fast answer—Emily was starting a summer program at Temple next week. Madison asked Hanna more questions about herself, and Hanna made up more details. She said she was a cross-country runner, that she wanted to be a lawyer, and that she lived in Yarmouth, which was near Rosewood but not Rosewood. It felt good to slip into someone else’s identity for a few hours. This fictitious Olivia didn’t have two murderous BFFs and various stalkers. Her life seemed so enviously simple. The only real thing she shared was that she was going on a trip to Reykjavik, Iceland, soon with Aria, Noel, and Mike. “Is that the place where you can smoke pot in the streets?” Madison asked excitedly. Hanna shook her head. “No, that’s Amsterdam.” Madison looked disappointed. Madison told Hanna that she lived in the area, though she didn’t say where. At first, she put on a good face about going back to school next fall, but as she downed drink after drink, her enthusiasm seemed forced and manufactured. Within an hour, Madison became aggressively flirtatious with every guy at the bar—especially Jackson, who she said shopped at the store where she worked. Eventually, she slurred her words, dropped things, and spilled her sixth drink across the bar. As Hanna ran for napkins, Jackson scooped up the empty glass. Hanna wanted to tell him to cut Madison off—she could barely stand up. “We’re taking a quick break, but we’ll be right back!” the steel drum player boomed, jarring Hanna from her thoughts. She looked around. The plate of fries was now empty. James was gone, and Mike was fiddling with his cell phone. She gritted her teeth, annoyed she’d given Madison any thought. Hadn’t she just told herself not to think about all the crappy things in her past? “I still have no signal,” Mike grumbled, punching buttons. “What if it stays this way through the whole trip?” “The crew told us the service is spotty,” Hanna reminded him. “Besides, why do you need your phone so badly right now? Are you secretly texting with a Villa girl?” “Never,” Mike said, then stood. “I’m going to unpack. Wanna meet up later in your room?” His eyes danced playfully. “Yes, but only if my roommate isn’t a Villa girl,” Hanna said. “I’ll let you know.” Then she headed toward her cabin, which was two decks down and through a labyrinth of hallways. On her way there, she spied Zelda Millings, a cool girl from Doringbell Friends who was always at Noel Kahn’s parties. “Hey, Zelda!” she called out. Zelda looked at Hanna, then sniffed and pretended to talk on her cell phone. Hanna glanced around, horrified that someone might have seen. As she slipped the keycard into the lock and opened the door, the room looked different than when she’d left it. The lights Hanna had turned off were on again, and the TV was blaring. “Hello?” Hanna called tentatively, peering around. Someone had dumped their suitcase on the second bed. A pair of bright-yellow skinny jeans lay on the floor. A silky scarf, several T-shirts—in size extra-small—and a pair of espadrilles were spread across the mattress. Hanna’s gaze scanned the rest of the room. There wasn’t a plaid Catholic schoolgirl uniform in sight. Yes. “Hello?” she called again, more happily this time. A figure appeared in the balcony doorway. “Hanna?” Hanna’s eyes adjusted. Standing before her, in a cloud of her signature Kate Spade Twirl, was a girl with long, supple limbs, white-blond hair, and ice-blue eyes. It was someone Hanna hadn’t prepared for at all. “Oh,” Hanna said stupidly. It wasn’t a Villa girl. It was Naomi Zeigler. She braced herself, waiting for an insult to spew from Naomi’s mouth—probably something about her being a stalker. Or maybe Naomi would groan and march out of the room, disappointed that she’d gotten stuck with Hanna, the ship’s biggest dork. But the corners of Naomi’s lips edged up in a grin. “Oh thank God,” she blurted, slumping in relief. “I was so afraid they were going to stick me with someone like Chassey Bledsoe!” She strode up to Hanna and linked her arm through her elbow, which was stiff with caution. “I am so glad you’re here,” Naomi gushed. She squeezed Hanna’s arm. “I need someone to party with. What do you say?” Hanna licked her lips. She wanted to ask Naomi where her BFF, Riley Wolfe, was, but now that she thought about it, she hadn’t seen Riley anywhere. Maybe she hadn’t come. She glanced at her reflection in the mirror over the bureau. Her auburn hair hung glossily down her back, the zits on her forehead seemed to have suddenly cleared up, and her arms looked toned and trim, not bloated from stress eating. Even though Naomi was probably glomming on to Hanna because her other friends weren’t aboard, it had been a long time since a popular girl had begged her to hang. And with everyone still snickering about her little stalking episode, the offer felt even more tantalizing. With Naomi at her side, she’d become a queen bee again in no time. And isn’t that what she’d wanted, forever? I’m Hanna Marin, and I’m fabulous, she used to say when she was friends with Mona. And, okay, maybe she didn’t feel quite as fabulous these days, but surely she still had a little bit of sparkle left in her. She turned to Naomi and squeezed her arm back. “Let’s party.” 5 SPEAKING OF VILLA GIRLS … At 10 P.M. that same night, Emily stood on the Fiesta Deck next to Spencer, Aria, and Hanna at the Welcome to Paradise Luau. Fragrant leis hung in loops from the archways. Palms sprouted out of brightly painted pots. Pink and yellow strobe lights flashed from the ceiling. The place was so stuffed that Emily had had her toes stepped on a zillion times. The air had a sweaty, humid quality to it, and every few seconds a flash popped. “It’s great to see you all groovin’, people!” Jeremy called from the stage as the DJ launched into “I’m Sexy and I Know It.” A bunch of girls screamed. Emily watched them as they barreled toward the dance floor, keeping her eyes peeled for a tall girl with dark hair and haunting eyes—Ghost Girl, she’d begun to call her. She’d thought of little else since their interaction on the balcony. Had there been something magical between them, or was it just her imagination? And why had she let the girl go without asking who she was? Spencer, whose eyes kept wandering all over the crowd, too, pointed at a table across the room. “How about some ice cream?” She was looking at the make-your-own sundae bar in the corner. It was slightly less crowded than other parts of the party, so Emily and the others made a beeline for it. As they chose their glasses and long silver spoons, Aria nudged Emily, her gaze on someone across the room. “Hey, is that your roommate over there?” she asked. Emily looked through the dancing bodies. A tall girl with dip-dyed blond-to-brown hair in a tight black dress and black boots was holding court in a booth. Her chocolate-brown eyes were heavily lined and shadowed, and her lips were a vampy red, reminding Emily a little of Angelina Jolie. The silver cross around her neck made her seem both untouchable and irresistible. A few snooty-looking blond girls were sitting with her, and about eight guys flocked around them, flirting. Emily rolled her eyes. “Yes.” Hanna, who had just plopped a modest-sized scoop of vanilla into her bowl, gasped. “Your roommate is Erin Bang Bang?” Emily gave her a crazy look. “What?” “Erin Bang Bang. But just the guys call her that, not the girls. She’s from Villa Louisa, that Catholic school that’s obsessed with sex.” “I heard a rumor about that girl today,” Spencer said as she deliberated over chocolate or rainbow sprinkles. “She’s the one who dumped Justin Bieber because he was too boring, right?” “Noel told me she made out with the pastry chef minutes after the boat disembarked,” Aria piped up. “He created a dessert in her honor.”","sourceLink":"https://allnovel.net/burned-pretty-little-liars-12/page-6.html","bookId":2388,"book":{"id":2388,"title":"Burned (Pretty Little Liars #12)","description":"Storyline: Burned (Pretty Little Liars #12) It\u0027s spring break, and the pretty little liars are trading in Rosewood for a cruise vacation. They want nothing more than to sail into the tropical sunset and leave their troubles behind for one blissful week. But where Emily, Aria, Spencer, and Hanna go, A goes, too. From scuba diving to tanning on the upper deck, A is there, soaking up all their new secrets. Emily is smooching a stowaway. Aria\u0027s treasure-hunting partner is a little too interested in her booty. Spencer\u0027s going overboard trying to land a new boy. And a blast--or rather, a crash--from Hanna\u0027s past could mean rough waters ahead for everyone. The liars better tighten their life jackets. A perfect storm is brewing, and if they aren\u0027t careful, A will bury them at sea. . . .","cover":"https://allnovel.net/images/burned-pretty-little-liars-12.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/burned-pretty-little-liars-12.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:15 AM"}}
