{"id":14926,"no":13,"title":"CHAPTER XII — PRISONERS","content":"When they arrived at Cerro de Pasco they found that the division of Gamarra\u0027s army stationed in the district had mutinied and had declared for Vivancohidas, and were killing all those known as adherents of Gamarra. All traffic was at a stand-still. Numbers of the soldiers who did not choose to join in the mutiny had taken to the hills, and were pillaging convoys and peaceful travellers alike. \"I think, se?or,\" Dias said, \"that instead of crossing the Cordilleras to the west, as we had intended, it will be better for us to go south, skirt the lake of Junin, and make for Oroya. That is the route generally taken, for the passes west are terribly difficult. I have traversed this route many times, and when going with merchandise I always go through Oroya, though in returning from Cerro I take the shorter route.\" \"Very well, Dias, you are the best judge of that. It is a great nuisance that this rising should have taken place just as we want to traverse the country, but it can\u0027t be helped. I will go to the head-quarters of Quinda—he is established at the mayor\u0027s house here—and get a pass from him. \"It would be well, perhaps, if you were to go with me, Dias, to confirm my statement that we have been shooting and hunting. I hope he will give us a pass, so that we shall not be interfered with by his men gathered at different points on the road to Oroya. I hear that a considerable portion of his force have already marched forward.\" The Peruvian colonel questioned Harry closely as to his motives for travelling there. \"I suppose,\" he said, \"you have been searching for gold. We are sorely in need of funds, and I shall feel myself obliged to borrow any gold that you may have collected for the use of my army, giving you an order on the treasury at Lima, which will, of course, be honoured as soon as the authority of President Vivancohidas is established.\" \"I do not doubt the goodness of the security,\" Harry said quietly, \"although possibly I might have to wait some time before the order was cashed; but while hunting I have not come upon any treasure. We have occasionally, when halting at streams, amused ourselves by doing a little gold-washing, but when I tell you that during the eight months since we started from Cuzco we have only collected about twenty ounces of gold, you may well suppose that no good fortune has attended us.\" \"Is that all, se?or?\" \"I give you my word of honour that is all, se?or; and as I shall have to lay in a store of provisions and so on for my journey down to Lima, you may well imagine that it would be a serious inconvenience to me to part with it.\" \"Quite so, se?or; so small a sum as that would not go far among the four thousand men under my command. However, I shall have pleasure in giving you the pass that you ask. You have had good sport, I hope?\" \"As good as I expected. We kept ourselves in food, and have seen a splendid country, which I hope some time will again be cultivated, and add to the wealth of your country.\" After a further exchange of compliments Harry returned to the inn where they had put up. Next morning, after purchasing some coffee and other stores that were needed, they set out. \"Now we are all right, Dias,\" Harry said as they started. \"I hope so, se?or; but from what I heard yesterday evening several strong bands of disaffected soldiers are in the hills between this and Oroya. Quinda\u0027s troops have by no means all joined him, and several companies that broke off have stationed themselves in the hills along this road. They have stopped and robbed more than one mule train with silver from the mines there. They have not meddled, as far as I hear, with Quinda\u0027s troops, but have simply seized the opportunity of perpetrating brigandage on a large scale.\" \"Well, we must take our chance, Dias. Fortunately we have money enough at Lima to replace the animals. We have pretty well finished all our stores, and beyond the tents and the bedding, which would be a matter of a hundred dollars, there is nothing worth thinking of; still, certainly I do not want to lose it. I hope we sha\u0027n\u0027t fall in with any of those scoundrels.\" \"I hope not, se?or. Perhaps we had better put our gold dust and money in José\u0027s boots. They are less likely to examine him than they are us. \"You had better put half in his boots, and give the other half to my wife to hide about her clothes. We shall want some money, if we are robbed, to take us down to Lima. With the gold dust we could get a couple of mules and enough provisions to take us down there. We should be in a very awkward position if we found ourselves penniless.\" They stopped for the night at a little village close to the lake. There was but one small room at the inn, but at the other end of the straggling village there was a yard where the mules could stand, and a loft where Dias, Maria, and José could sleep. Harry and his brother had lain down but an hour on their blankets when there was a shouting in the street, and two or three shots were fired. They leapt up. \"We had better hide our rifles and pistols,\" Harry said, \"under that ragged bed that we did not care about sleeping on. We may possibly get them again even if we are robbed of everything else.\" A minute later four or five men with a lantern rushed into the room. They were all armed with muskets, and one carried a torch. \"Who are you?\" this man asked. \"We are English sportsmen,\" Harry said. \"We have been shooting for some months at the foot of the hills, and are now returning to Lima. There are our guns, you see.\" \"We will take you before the captain,\" the man said. \"Bring those guns along, Pedro and Juan.\" The village was in an uproar. Some fifty men were occupied in searching the houses and in appropriating everything they thought useful. One house had been set on fire, and near this a man in an officer\u0027s uniform was standing. He heard the report of Harry\u0027s and Bertie\u0027s capture. \"English sportsmen, eh! How long have you been shooting?\" he asked. \"Eight months.\" \"Eight months! Then guard them securely, Montes; they are doubtless rich Englishmen, and we shall get a good ransom for them. English se?ors who come out here to shoot must be men with plenty of money; but likely enough they are not sportsmen, but gold-seekers. However, it matters little.\" \"I protest against this,\" Harry said. \"Our consul at Lima will demand satisfaction from the government.\" The other laughed. \"Government!\" he said, \"there is no government; and if there were, they would have no power up in the hills.\" So saying he turned away. Plunder that had been collected was brought in and divided among the party, four of the men with muskets keeping guard over the prisoners. \"I don\u0027t see anything of Dias and the mules,\" Bertie said in English. \"No, I have been expecting to see them brought up every minute. Now I am beginning to hope that they have got safely off. I think the fellows began their attack at our end of the village. \"You know how watchful Dias is. Very likely he or José were up, and you may be sure that the moment they heard the uproar they would drive the mules out and be off. You see only two of them are laden, and they could have thrown the things on to their backs and been off at once. He would know that it was useless to wait for us. I expect he would turn them off the road at once and make down towards the lake. If these fellows had caught him and the mules they would certainly have brought them up here before this.\" \"I hope he got off—not so much because of the mules, as because I am sure that, if he gets fairly away, he will do what he can to help us.\" \"I am sure he will, Bertie. We must make the best of it. There is one thing, we have got a good month before us. It will take them all that time to go down to Lima about our ransom and return; and it is hard if we don\u0027t give them the slip before that.\" A quarter of an hour later the band started with their booty and prisoners for the hills. \"I don\u0027t suppose they will go far,\" Harry said. \"Quinda has got his hands full, and will be wanting to start as soon as he can to join Vivancohidas. He won\u0027t lose time in hunting the scoundrel who has caught us, so I expect the band make their head-quarters in some village at the foot of the hills.\" This turned out to be so. After a march of four hours the band halted in a village in a valley running up into the hills. The prisoners were thrust into an empty hut, and four men with muskets told off as their guard. Next morning the captain of the band came in. \"I shall require a hundred thousand dollars for your ransom,\" he said. \"We could never pay such a sum,\" Harry said. \"We are not rich men. I am a lieutenant on half-pay in the English navy, and, having nothing to do at home, came out with my brother for a year\u0027s sport. I could not pay a tenth of that sum.\" \"That we shall see,\" the man said. \"If you cannot pay, your government can. You will at once write to your consul at Lima, telling him that if this hundred thousand dollars are not handed over to my messenger within four days of his arrival there, you will both have your throats cut.\" \"I will write the letter if you wish,\" Harry replied quietly, \"but you won\u0027t get the money. If you like to say ten thousand dollars, I dare say the consul will do his best to raise that amount.\" \"One hundred thousand is the smallest sum,\" the man said angrily. \"He can get it out of the government there. They will not choose to risk having trouble with your country for the sake of such a sum.\" \"Gamarra is away,\" Harry said, \"and it is pretty certain that he will not have left a hundred thousand dollars in the treasury; and even if he has, you maybe sure that his people there would not give it up, for he wants every penny for his war expenses.\" The man shrugged his shoulders. \"So much the worse for you. Write as I told you; here is paper, pen, and ink. Do not write in English. I will come back in a quarter of an hour for it.\" \"This is awkward, Bertie. It is evident that I must write. As to their paying twenty thousand pounds, the thing is absurd; if he had mentioned two thousand they might have considered the matter. What I hope is that they will not send up anything. I feel certain that we shall be able to get away from here within a month; and if they were to send up one or two thousand pounds, we should probably miss the fellow on the way. In that case we should have to repay the money when we got to Lima, which I certainly should not see my way to do—anyhow, until I got to England, when I could, of course, sell out some of my stock. There is nothing here that we could use as invisible ink. If there were, I would risk writing a message with it; but even then it is fifty to one against their bringing it to light. Well, here goes!\" and he wrote in Spanish the required message. The robber on his return read it through, turned the paper over to see that nothing was written on the back, and held it up to the light. \"That will do,\" he said. \"Now let me warn you, don\u0027t attempt to escape. You won\u0027t succeed if you do, and the sentries have orders to shoot you down should you attempt it.\" The time passed slowly. The brigand was evidently determined to give them no chance of escaping, and four sentries remained round the hut, one at each corner. In the daytime the prisoners were allowed to sit at the door of the hut, but they were shut up at nightfall. The guards were not allowed to speak to them, and there was therefore no chance of offering them a bribe. On the evening of the fifth day they had, as usual, been shut up, and were chatting over the situation. \"If they continue to guard us like this, Bertie, I really don\u0027t see a shadow of a chance of getting away. We calculated on there being one, or perhaps two sentries at the door, and thought we could have cut a hole through that adobe wall at the back and crept out through it; but as there is a guard at each corner, I don\u0027t see a chance of it. The fellows are evidently afraid of their captain, and each keeps to his corner, and sits there and smokes and drones out songs, but they never move till they are relieved. Of course we must make the attempt if we see no other way of escaping. But I have still great hope that Dias will somehow or other try to get us out, though how he can do it I don\u0027t know.\" They observed that the sentries were not changed in any military way. Five minutes before sunset the four men who were to relieve those on guard came sauntering up. The former guard ordered the captives into the hut and bolted the door, and then after a short chat with the others went off, the new sentries having already taken their posts at the corners of the hut. On the fifth evening after their capture they saw approaching a peasant woman sitting on a mule. A man was walking beside her. Behind the woman was a small barrel, and two packs and two small wine-skins hung on each side. \"Harry,\" Bertie exclaimed, \"I believe that is Dias and Maria!\" \"It is,\" Harry said. \"Thank God they have found us! Twenty to one they will get us out. What have they got with them, I wonder?\" They stopped in the road opposite the house, which was the end one in the village. \"You are not to come nearer,\" one of the sentries shouted. \"I am sure I don\u0027t want to come nearer,\" the woman said pertly. \"You don\u0027t think you are so handsome that I want to get a better sight of your face?\" \"What have you got there?\" the man asked. \"We shall be coming off duty in ten minutes.\" \"Well, we have got a little of everything,\" she said. \"As pretty sashes as there are in the country, beautiful silk neckerchiefs, silver brooches for your sweethearts, and for those who purchase freely a glass of the best pisco spirit.\" \"Well, wait, and I dare say we shall lay out a dollar or two.\" A minute or two later four other men sauntered up, and began to talk to Maria, who slipped off her mule. The guards, fearful that the best bargains would be sold before they could get forward, hurried the prisoners into the hut and bolted the door. The brothers heard a great deal of talking and arguing, and ten minutes later the sentries came up to their usual post. \"I would not mind betting odds,\" Bertie said with delight, \"that Dias has drugged that spirit.\" \"I expect so, Bertie. He would be sure that they could not resist it, for it is the best spirit there is in Peru.\" For a time the sentries talked, saying that the pedlars\u0027 goods were cheap and the spirit as good as any they had ever tasted. \"We had great difficulty in getting her to sell us a second glass each; and she was right, for she had not much of it, and it must help her rarely to sell her goods. The husband seemed a surly sort of chap. I wonder such a pretty little woman would marry such a fellow.\" \"I suppose he was well-to-do and she was poor,\" another said; \"such is generally the case when you see a marriage like that. I dare say he makes a good thing of it; the goods are as cheap, though, as they would be in Lima.\" Gradually the talking ceased, and within an hour there was perfect quiet outside the hut. Half an hour later they heard footsteps coming quietly up to the door. They held their breath; but instead of, as they expected, hearing the bolt drawn, they heard the new-comers going round the hut, pausing a minute at each corner. Then they again stopped at the door; the two bolts were shot back, and the door opened. \"Come, se?ors,\" Dias said; \"it is quite safe. We have put them all to sleep. Here are their muskets and pistols. You had better take them, in case we are pursued, which is not likely. At any rate, should one of them wake the want of a gun will mean delay in raising the alarm. \"Don\u0027t speak, se?ors; it is as well to keep quiet till we are fairly off.\" He shut the door and rebolted it, and then led the way down into the road. Not a word was spoken till they had gone a hundred yards, and then Harry said: \"You have done us another good turn, Dias; we did not see any possible way of getting out; but we both agreed that if you could find us you would.\" \"Of course, se?ors, you could not suppose that Maria and I would go quietly off.\" \"How did you manage to get away, Dias?\" \"It was easy enough. After what we had heard of these brigands I made up my mind that I would not unsaddle the mules, nor take the packs off the two loaded ones. The burdens were not heavy, for we have little but our bedding and the tents left, and I thought they might as well stay where they were, and in the morning we could shift them on to the others. I told José to watch about half the night; but I was standing talking to him, and smoking my last cigarette, when he said suddenly, \u0027I can hear a noise at the other end of the village.\u0027 \"The evening was still, and I could also hear the sound of many footsteps, so I ran and pulled down the bar at the back of the yard, called Maria, and told her and José to take the mules straight down to the lake, and then to follow the bank. Then I ran to warn you; but before I got half-way I heard shouts and firing, and knew that I was too late, so I ran back to the lake, where I overtook the mules, and we mounted and went off at a trot. When I got a quarter of a mile away I told the others to go on to Junin, which we knew was twenty miles away, and put up there till I joined them. Then I ran back to the village, and, keeping myself well behind a house, watched them getting ready to start, and saw you. There was nothing to do but to follow you. I did so, and observed where they had shut you up, and I waited about for some hours, so as to see how you were guarded. \"I saw their captain go into your hut twice. When he came out the second time he had a paper in his hand. He went to the house he has taken possession of, and I kept a good watch over that. Presently two lieutenants came out, talking together. They entered another house, and ten minutes afterwards issued out again, dressed in ordinary clothes, such as a muleteer or a cultivator fairly well off would wear, and returned to the captain\u0027s house, and stayed there for a good half-hour before they came out again. Two horses had been brought round to the door. The captain came out with them, and was evidently giving them some last instructions. Then they rode off, saying good-bye to some of the men as they passed through the village. \"Knowing the ways of these bandits, I had no doubt the paper I saw their captain bring out of the hut where you were was a letter he had compelled you to write to request a large sum of money to be sent in exchange for you; and as I felt certain that we should rescue you somehow, I thought it was a pity that this letter should go down, so I started at once to follow them. They had not got more than a quarter of an hour\u0027s start of me, and by the line they had taken I saw that they intended to go to Junin. I did not think it likely that they would enter the place, because they would be sure to meet some of Quinda\u0027s men there; but would probably sleep at some small village near it, and then make a circuit to strike the road beyond the town. \"Fortunately I had some money in my pocket, and at the first farm I came to I bought a mule. You see, se?or, I had not lain down the night before, and had done a fair day\u0027s work before I started to follow your captors. I had walked twenty miles with them, and had been busy all the morning. I knew it could not be much less than thirty miles to Junin, and that if I could not find them there I should have to push on after them again the next morning, so I gave the farmer what he asked for his mule, and started at once on it barebacked. It turned out to be a good animal, and I rode hard, for I wanted to get down to Junin before the two men. I reckoned I should do that, because, as they were going a very long journey, they would not want to press their horses, and besides would prefer that it should be dark before they stopped for the night. \"When I got to Junin I found Maria and José, who had put up the mules at the only inn there. I set Maria to watch on the road leading into the town, and went out with José to a little village a mile back, where I made sure the fellows would stop. I was not long in finding out that they had arrived about half an hour after I had ridden through, and had put up at the priest\u0027s. That was good enough for me. We went back to the town. I had some supper, which I can tell you I wanted badly, for I had been afraid of going into the brigand\u0027s village to buy anything, as, being a stranger, I might have been asked questions, so I had had nothing since the night before. I had found that there was a road from the place where they had stopped, by which they could ride along by the lake without going into the town; so José and I ambushed there an hour before daylight, thinking that they would be off early. We were right; for in a quarter of an hour they came along. Day was just breaking, so we could make out their figures easily enough, and as they were not five yards away as they passed, we were not likely to miss them. Well, I found the paper you had written in the coat-pocket of one of them, together with two hundred dollars, no doubt for the expenses of his journey. We hid the two bodies under a heap of stones.\" \"Then you killed them, Dias?\" Harry said, in a tone of surprise. \"Of course! what else would one do with them? They were brigands, and they had attacked a peaceable village and killed several people. Even if I had not wanted to get your paper it would have been a very meritorious action.\" \"Oh, I am not blaming you, Dias, at all! There was no other way of getting the paper, and it may be regarded as an act of necessity. And what did you do with their horses?\" \"José went on with them, and I returned to the town again and started with Maria and the mules. We journeyed to a village half-way to Oroya. Of course we overtook José a mile or two after we had left Junin. There we put up at a quiet place and talked over the situation. We knew that there was no particular hurry, for we read your letter, and knew that no harm would come to you for a long time. It would be a month at least before they would expect the men back with the money. There was another letter, addressed to Don Mariano Carratala, whom I know to be a busy politician in Lima. The money was to be paid to him; at least he was to receive it from the two men immediately they left the British consul\u0027s house, and he was to hold it for Valdez, which is the name of the brigand.\" \"I thought he would not trust the men to bring up a sum like that.\" \"It would be enough to tempt the most incorruptible Peruvian, and certainly the men he sent down would have taken good care never to come to this part of the country again if they had got the money into their possession. I don\u0027t think either it would have been safe in the hands of Carratala, if he did not know that sooner or later he would get a knife between his shoulders if he kept it. Next morning Maria and I started back, bringing with us four mules, the fastest we had. We rode on two and led the others. I knew some people at Junin, for I have often passed through the town when I have been bringing down silver from Cerro, and one managed to get for us that little barrel of pisco. I was sure that no soldier would refuse a glass; but it was almost a sin to give such liquor to the dogs. Then we bought peasants\u0027 clothes, and a parcel of goods such as travelling hawkers carry. \"You know how we succeeded. Of course we had drugged the pisco heavily, and knew that two glasses would send any man off to sleep in half an hour. As soon as it was dark, Maria went on with the mule. We shall find her half a mile from here at a deserted hut where we left the other three mules.\" \"Well, Dias, you have assuredly saved our lives. Guarded as we were, there was not the slightest chance of our getting away by ourselves; and as the British consul certainly could not have raised the sum they demanded, we should have had our throats cut when the messengers returned empty-handed. Valdez is not the man to go back from his word in that respect.\" \"It is a pity you have lost your arms, se?or.\" \"Yes, we have certainly lost our double-barrelled guns, but our rifles and pistols are hidden in the straw of the bed in the room where we slept. We had just time to hide them before the brigands burst into the room.\" \"Then we can recover them, se?or. Of course I intended to ride straight to Junin, but it won\u0027t make very much difference. We will ride to the village, get the rifles and pistols, and then follow the road by the lake. It is now only nine o\u0027clock; we can be there by one easily, and reach Junin by morning. It will be perfectly safe to rest there. I suppose your guards will be relieved about twelve o\u0027clock?\" \"Yes, that was the time we heard them changed.\" \"They will most likely discover that you have gone then. When they find the four guards sound asleep, they are sure to unbolt the door and see if you are there, then of course they will give the alarm at once. But I hardly think they will even attempt to pursue. They are infantry, and none of them are mounted but the officers, which means that at present only Valdez himself has a horse. They would know that you had been assisted, and that probably horses were waiting for you somewhere. There is the hut, se?ors.\" Maria ran out as they came up. \"The saints be praised,\" she exclaimed, \"that you are with us again, se?ors!\" \"The saints are no doubt to be praised,\" Harry said, \"but we feel at present a good deal more indebted to Dias and yourself than to them. We are indeed grateful to you both, and you managed it splendidly. My brother and I felt so confident that you would do something to get us out, that we were not in the least surprised when we recognized you and Diaz got up as travelling hawkers.\" \"You did not tell them that we were with you?\" \"No. Fortunately they asked no questions at all, and took us for Englishmen travelling by ourselves. They may have thought of it afterwards, but in the hurry of carrying off their booty they apparently gave the matter no attention. If they had done so they would probably have sent a party out in pursuit of the mules. Even if they had not done so, they would have been sure to look with some suspicion at two hawkers arriving at such an out-of-the-way village at such a time.\" \"Well, we had better be moving at once,\" Dias said. \"We are going down to the village where they were captured, Maria. They hid their rifles and pistols there when they found the place was in the hands of the brigands.\" Three minutes later they started. There was a full moon, so they were able to ride fast, and it was just midnight when they arrived at the village. When they knocked at the house where their rifles had been left, the proprietor looked out from the upper window in great dismay, fearing that the brigands might have returned. However, as soon as he recognized the party he came down and opened the door. The arms were found where they had been hidden, and in five minutes they were again on their way, and arrived at Junin at five o\u0027clock. It was necessary to wait here twenty-four hours to rest the animals. The next morning they started as soon as it was light, and picked up José and the convoy. The brothers mounted the two horses, and Dias and Maria rode on one mule, and led three behind them. José rode another and led four. The horses and the mule Dias had bought were sold at Oroya, and after purchasing enough provisions for the rest of their journey they started for Lima, having concluded that it would be better, now that they were on the main track, to follow it instead of striking across the hills. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3136/86230.html","bookId":888,"book":{"id":888,"title":"The Treasure of the Incas","description":"简介： Two men were sitting in the smoking-room of a London club. The room was almost empty, and as they occupied arm-chairs in one corner of it, they were able to talk freely without fear of being overheard. One of them was a man of sixty, the other some f...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3136","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
