{"id":14921,"no":8,"title":"CHAPTER VII — AN INDIAN ATTACK","content":"One day when they returned from exploring a valley, Harry and his brother, taking their rifles, strolled down an open glade, while Dias and José unpacked the animals. They had gone but a hundred yards when they heard a sound that was new to them. It sounded like the grunting of a number of pigs. Dias was attending to the mules. Harry and Bertie caught up their guns. Presently a small pig made its appearance from among some trees. Harry was on the point of raising his gun to his shoulder when Dias shouted, \"Stop, do not shoot!\" \"What is the matter, Dias?\" he asked in surprise, as the latter ran up. \"That is a peccary.\" \"Well, it is a sort of pig, isn\u0027t it?\" \"Yes, se?or. But if you were to kill it, we might all be torn in pieces. They travel through the forests in great herds, and if one is injured or wounded, the rest will rush upon its assailants. You may shoot down dozens of them, but that only redoubles their fury. The only hope of escape is to climb a tree; but they will keep watch there, regardless of how many are shot, until hunger obliges them to retire. They are the bravest beasts of the forests, and will attack and kill even a lion or a tiger if it has seized one of their number. I beg you to stroll back quietly, and then sit down. I will go to the head of the mules. If the herd see that we pay no attention to them, they may go on without interfering with us. If we see them approaching us, and evidently intending to attack, we must take to the trees and try to keep them from attacking the mules; but there would be small chance of our succeeding in doing so.\" He and José at once went up to the mules, and stood perfectly quiet at their head. Harry and Bertie moved closely up, laid their double-barrelled guns beside them, and then sat down. By this time forty or fifty of the peccaries had issued from the trees; some were rooting among the herbage, others stood perfectly quiet, staring at the group on the rise above them. Seeing no movement among them nor any sign of hostility, they joined the others in their search for food, and in a quarter of an hour the whole herd had moved off along the edge of the forest. \"Praise be to the saints!\" Dias said, taking off his hat and crossing himself. \"We have escaped a great danger. A hunter would rather meet a couple of lions or tigers than a herd of peccaries. These little animals are always ready to give battle, and once they begin, fight till they die. The more that are killed the more furious do the others become. Even in a tree there is no safety. Many a hunter has been besieged in a tree until, overpowered by thirst, he fell to the ground and was torn to pieces.\" \"What do they eat?\" Harry asked. \"They will eat anything they kill, but their chief food is roots. They kill great numbers of snakes. Even the largest python is no match for a herd of peccaries if they catch him before he can take refuge in a tree.\" \"Well, then, it is very lucky that you stopped us before we fired.\" \"Fortunate indeed, se?or. By taking to the trees we might have saved our lives, but we should certainly have lost our mules. Both pumas and tigers kill the little beasts when they come across stragglers. And it is well that they do, for otherwise the woods would be full of them, though fortunately they do not multiply as fast as our pigs, having only two or three in a litter. They are good eating, but it is seldom that a hunter can shoot one, for if he only wounds it, its shrieks will call together all its companions within a mile round.\" \"Then we must give up the idea of having pork while we are among the mountains.\" \"Now, are you going to keep me here all day, Dias?\" Maria called suddenly. \"It seems to me that you have forgotten me altogether.\" Harry and Bertie could not help laughing. Dias had, on returning to the mules, taken his wife and seated her on a branch six feet from the ground, in order that, should the peccaries attack them, he might be ready at once to snatch up his rifle and join in the fight without having first to think of the safety of his wife. He now lifted her down. The action did even more than what Dias had said to convince Harry of the seriousness of the danger to which they had been exposed, for as a rule Donna Maria had scoffed at any offers of aid, even in the most difficult places, and with her light springy step had taxed the power of the others to keep up with her. These offers had not come from Dias, who showed his confidence in his wife\u0027s powers by paying no attention whatever, and a grim smile had often played on his lips when Harry or his brother had offered her a hand. That his first thought had been of her now showed that he considered the crisis a serious one. \"I thought Dias had gone mad,\" she said, as she regained her feet. \"I could not think what was the matter when he began to shout and ran towards you. I saw nothing but a little pig. Then, when he came slowly back with you and suddenly seized me and jerked me up on to that bough, I felt quite sure of it, especially when he told me to hold my tongue and not say a word. Was it that little pig? I saw lots more of them afterwards.\" \"Yes; and if they had taken it into their heads to come this way you would have seen a good deal more of them than would be pleasant,\" Dias said. \"With our rifles we could have faced four lions or tigers with a better hope of success than those little pigs you saw. They were peccaries, a sort of wild pig, and the most savage little beasts in the forest. They would have chased us all up into the trees and killed all the mules.\" \"Who would have thought it!\" she said. \"Why, when I was a girl I have often gone in among a herd of little pigs quite as big as those things, and never felt the least afraid of them. I must have been braver than I thought I was.\" \"You are a good deal sillier than you think you are, Maria,\" Dias said shortly. \"There is as much difference between our pig and a peccary as there is between a quiet Indian cultivator on the Sierra and one of those savage Indians of the woods.\" \"I suppose I can light a fire now, Dias. There is no fear of those creatures coming back again, is there?\" \"No, I should think not. Fortunately they are going in the opposite direction, otherwise I should have said that we had better stop here for a day or two in case they should attack us if we came upon them again.\" The next day, as they were journeying through the forest, at the foot of the slopes José gave a sudden exclamation. \"What is it?\" Dias asked. \"I saw a naked Indian standing in front of that tree; he has gone now.\" \"Are you sure, José?\" \"Quite sure. He was standing perfectly still, looking at us, but when I called to you he must have slipped round the tree. I only took my eyes off him for a moment; when I looked again he was gone.\" \"Then we are in for trouble,\" Dias said gravely. \"Of course it was one of the Chincas. No doubt he was alone, but you may be sure that he has made off to tell his companions he has seen us. He will know exactly how many we are, and how many animals we have. It may be twenty-four hours, it may be three or four days, before he makes his appearance again; but it is certain that, sooner or later, we shall hear of him. Hunters as they are, they can follow a track where I should see nothing; and so crafty are they, that they can traverse the country without leaving the slightest sign of their passage. The forest might be full of them, and yet the keenest white hunter would see no footprint or other mark that would indicate their presence.\" \"What had we better do, Dias?\" \"We shall probably come to another stream before nightfall, se?or. This we will follow up until we get to some ravine bare of trees. There we can fight them; in the forest we should have no chance. They would lie in ambush for us, climb into the trees and hide among the foliage, and the first we should know of their presence would be a shower of arrows; and as they are excellent marksmen, we should probably be all riddled at the first volley. There can be no sauntering now, we must push the animals forward at their best speed. I will lead the way. Do you, se?or, bring up the rear and urge the mules forward. I shall try and pick the ground where the trees are thinnest, and the mules can then go at a trot. They cannot do so here, for they would always be knocking their loads off.\" It was evening before they arrived at a stream. Here they made a short halt while they gave a double handful of grain to each of the animals, then they pushed on again until it was too dark to go farther. \"Will it be safe to light a fire, Dias?\" \"Yes, that will make no difference. They are not likely to attack us at night. Savages seldom travel after dark, partly because they are afraid of demons, partly because they would be liable to be pounced upon by wild beasts. But I do not think there is any chance of their overtaking us until tomorrow. The man José saw may have had companions close at hand, but they will know that we are well armed, and will do nothing until they have gathered a large number and feel sure that they can overpower us. They will probably take up the track to-morrow at daylight; but we have made a long march, and can calculate that we shall find some defensible position before they overtake us. José and I will keep watch to-night.\" \"We will take turns with you, Dias.\" \"No, se?or; my ears are accustomed to the sounds of the forests, yours are not. If you were watching I should still have no sleep.\" The night passed without an alarm. An hour before daylight Dias gave all the animals a good feed of corn, and as soon as it was light they again started. They were already some distance up the mountain, and after eight hours\u0027 travelling they arrived at a gorge that suited their purpose. For two hundred yards the rocks rose perpendicularly on each side of the stream, which was but some thirty feet wide. No rain had fallen for some days, and the water was shallow enough at the foot of the cliff for the mules to make their way among the fallen rocks, through which it rushed impetuously. At the upper end the cliffs widened out into a basin some fifty yards across. \"We cannot do better than halt here,\" Dias said. \"In two or three hours we can form a strong breast-work on the rocks nearly out to the middle of the stream, where the current is too swift for anyone to make his way up against it.\" \"Are they likely to besiege us long, Dias?\" \"That I cannot say; but I do not think they will give it up easily. Savages learn to be patient when roaming the forest in search of game. Their time is of no value to them; besides, they are sure to lose many if they attack, and will therefore try to get their revenge.\" \"They may have to give it up from want of food.\" Dias shook his head. \"There are sure to be plenty of fish in the river, and they will poison some pool and get an abundance. With their bows and arrows they can bring down monkeys from the trees, and can snare small animals. However, se?or, we can talk over these things to-morrow. We had best begin the breast-work at once while Maria is cooking dinner, which we need badly enough, for we have had nothing but the maize cakes we ate before starting.\" Working hard till it was dark, they piled up rocks and stones till they formed a breast-work four feet high on both sides. Some twelve feet in the centre were open. They had chosen a spot where so many fallen rocks lay in the stream that it needed comparatively little labour to fill up the gaps between them. \"I thought wood-chopping bad enough,\" Bertie said as they threw themselves down on the ground after completing their labour, \"but it is a joke to this. My back is fairly broken, my arms feel as if they were pulled out of the sockets, my hands are cut, I have nearly squeezed two nails off.\" \"It has been hard work,\" Harry agreed; \"still, we have made ourselves fairly safe, and we will get the walls a couple of feet higher in the morning. We shall only want to add to them on the lower face in order to form a sort of parapet that will shelter us as we lie down to fire, so it won\u0027t be anything like such hard work. Then we will fill in the rocks behind with small stones and sand to lie down upon.\" \"They will never be able to fight their way up to it,\" Dias said. \"We need have no fear on that score. The question is, can they get down into this valley behind us; the rocks look very steep and in most places almost perpendicular.\" \"They are steep, se?or; but trees grow on them in many places, and these savages are like monkeys. We shall have to examine them very carefully when we have finished the wall. If we find that it is possible for anyone to get down, we must go up the next gorge and see if we can find a better position.\" \"I suppose you think we are safe for to-night, Dias?\u0027 \"I don\u0027t think they will try to come up through the stream. They have keen eyes, but it would be so dark down there that even a cat could not see. They will guess that we have stopped here, and will certainly want to find out our position before they attack. One or two may come up as scouts, and in that case they may attack at daybreak. Of course two of us will keep watch; we can change every three hours. I will take the first watch with your brother, and you and José can take the next.\" \"José had better sleep,\" Maria put in; \"he watched all last night. My eyes are as good as his, and I will watch with Don Harry.\" Harry would have protested, but Dias said quietly: \"That will be well, Maria, but you will have to keep your tongue quiet. These savages have ears like those of wild animals, and if you were to raise your voice you might get an arrow in the brain.\" \"I can be silent when I like, Dias.\" \"It is possible,\" Dias said dryly; \"but I don\u0027t remember in all these years we have been married that I have known you like to do so.\" \"I take that as a compliment,\" she said quietly, \"for it shows at least that I am never sulky. Well, Don Harry, do you accept me as a fellow watcher?\" \"Certainly I shall be very glad to have you with me; and I don\u0027t think that you need be forbidden to talk in a low tone, for the roar of the water among the rocks would prevent the sound of voices from being heard two or three yards away.\" Accordingly, as soon as it became dark Dias went to the wall with Bertie. José, after a last look at the mules, wrapped himself in a blanket and lay down. \"I think I had better turn in to the tent,\" Harry said; \"we have had two days\u0027 hard work, and the building of that wall has pretty nearly finished me, so if I don\u0027t get two or three hours\u0027 sleep to-night I am afraid I shall not be a very useful sentinel.\" Five minutes later he was sound asleep, and when his brother roused him he could hardly believe that it was time for him to go on duty. \"Dias is waiting there. Will you come down?\" the latter said. \"You were sleeping like a top; I had to pull at your leg three times before you woke.\" \"I am coming,\" Harry said as he crawled out. \"I feel more sleepy than when I lay down, and will just run down to the stream and sluice my head, that will wake me up in earnest, for the water is almost as cold as ice.\" When he came back he was joined by Donna Maria, and, taking both his shot-gun and rifle, he went forward with her to the barricade. \"So you have neither seen nor heard anything, Dias?\" \"Nothing whatever, se?or.\" \"I have had a good sleep, Dias; we will watch for the next four hours. It is eleven o\u0027clock now, so you will be able at three to take it on till daylight.\" \"I will send and call you again an hour before that,\" Dias said. \"If they attack, as I expect they will as soon as the dawn breaks, we had better have our whole force ready to meet them.\" So saying Dias went off. \"This is scarcely woman\u0027s work, Donna Maria.\" \"It is woman\u0027s work to help defend her life, se?or, as long as she can. If I found that the savages were beating us I should stab myself. They would kill you, but they might carry me away with them, which would be a thousand times worse than death.\" \"I don\u0027t think there is any fear of their beating us,\" Harry said; \"certainly not here. We ought properly to be one on each side, but really I shirk the thought of wading through the river waist-deep at that shallow place we found a hundred yards up; it would be bad enough to go through it, worse still to lie for four hours in wet clothes.\" \"Besides, we could not talk then, se?or,\" Maria said with a little laugh, \"and that would be very dull.\" \"Very dull. Even now we must only talk occasionally; we shall have to keep our eyes and ears open.\" \"I don\u0027t think either of them will be much good,\" she said; \"I can see the white water but nothing else, and I am sure I could not hear a naked footstep on the rocks.\" \"It is a good thing the water is white, because we can make out the rocks that rise above the surface. When our eyes get quite accustomed to the dark we should certainly be able to see any figures stepping upon them or wading in the water.\" \"I could see that now, se?or. I think it will be of advantage to talk, for I am sure if I were to lie with my eyes straining, and thinking of nothing else, they would soon begin to close.\" Talking occasionally in low tones, but keeping up a vigilant watch, they were altogether hidden from the view of anyone coming up the stream, for they exposed only their eyes and the top of their heads above the rough parapet. No attempt had been made to fill up the spaces between the stones, so that, except for the rounded shape, it would be next to impossible to make them out between the rough rocks of the crest. Harry had laid his double-barrelled gun on the parapet in front of him. He had loaded both barrels with buck-shot, feeling that in the darkness he was far more likely to do execution with that weapon than with a rifle. They had been some two hours on watch when Donna Maria touched his arm significantly. He gazed earnestly but could see nothing. A minute later, however, a rock about fifteen yards away seemed to change its shape. Before, it had been pointed, but just on one side of the top there was now a bulge. \"Do you see them?\" Maria whispered. \"I can make out one above the rocks; the other is standing against the wall.\" [Image: AN INDIAN SPIES THE EXPEDITION.] There was no movement for two or three minutes, and Harry had no doubt that they were examining the two black lines of stones between which the water was rushing. \"There are two others on this side, se?or,\" Maria whispered. The pause was broken by the sharp tap of two arrows striking on the stones a few inches below their heads. \"Well, you have begun it,\" Harry muttered. He had already sighted his gun at the head half-hidden by the rock. He now pulled the trigger, and then, turning, he fired the other barrel, aiming along the side of the canyon where the two men seen by his companion must be standing. The head disappeared, and loud cries broke from the other side. The stillness that had reigned in the valley was broken by a chorus of shrieks and roars, and the air overhead thrilled with the sound of innumerable wings. Harry on firing had laid down the fowling-piece and snatched up his rifle. \"Do you see any others?\" \"Two have run away; the one against the rocks on the other side was wounded, for I saw him throw up his arms, and it was he who screamed. The man by him dropped where he stood; the one behind the rock is killed, I saw his body carried away in the white water.\" Half a minute later Dias and Bertie came up. \"So they have come, se?or?\" \"Yes, there were four of them. Your wife saw them, though I could only make out one. They shot two arrows at us, and I answered them. The man I saw was killed, and Donna Maria said that one on the other side also fell, and another was wounded.\" \"That was a good beginning,\" Dias said. \"After such a lesson they will attempt nothing more to-night, and I doubt whether they will come down in the morning. They can get sight of the barricades from that bend a hundred yards down, and I don\u0027t think they will dare come up when they see how ready we are for them.\" \"Well, we will work out our watch anyhow, Dias. Now that I see how sharp Donna Maria\u0027s eyes are I have not the least fear of being surprised.\" \"I will stop with you,\" Bertie said; \"I shall have no chance of going off to sleep again after being wakened up like that.\" \"If you are going to stop, Bertie, you had better go back and fetch a blanket, it is chilly here; then if you like you can doze off again till your watch comes.\" \"There is no fear of that, Harry. I have been eight-and-forty hours on deck more than once. I will warrant myself not to go to sleep.\" In spite of this, however, in less than ten minutes after his return Bertie\u0027s regular breathing showed that he was sound asleep. Harry and Maria continued their watch, but no longer with the same intentness as before. They were sure that Dias would not have lain down unless he felt perfectly certain that the Chincas would make no fresh move until the morning, and they chatted gaily until, at two o\u0027clock, Dias came up. \"Everything is quiet here, Dias. My brother is fast asleep, but I will wake him now that you have come up.\" \"Do not do so, se?or; he worked very hard building the walls today. If I see anything suspicious I will rouse him. We may have work tomorrow, and it is much better that he should sleep on.\" \"Thank you, Dias! the fatigue has told on him more than on us; his figure is not set yet, and he feels it more.\" He walked back to the tents with Maria. \"If you wake just as daylight breaks please rouse me,\" he said. \"I shall wake, se?or; I generally get up at daybreak. That is the best time for work down in the plain, and I generally contrive to get everything done before breakfast at seven.\" Harry slept soundly until he was called. \"The sky is just beginning to get light, se?or.\" He turned out at once. José was already feeding the mules. \"You had better come along with me, José, and bring that gun of yours with you. If the savages do attack, it will be well to make a forcible impression on them.\" Greatly pleased with the permission, José took up the old musket he carried and accompanied Harry. \"What have you got in that gun, José?\" \"The charge of buck-shot that you gave me the other day, se?or.\" \"All right! but don\u0027t fire unless they get close. The shot will not carry far like a bullet; but if fired when they are close it is better than any bullet, for you might hit half a dozen of them at once.\" José had been allowed to practise at their halting-places, and though he could not be called a good shot, he could shoot well enough to do good execution at thirty or forty yards. Bertie was still asleep. \"Everything quiet, Dias?\" \"I have seen nothing moving since I came out.\" \"Now, Bertie,\" Harry said, stirring his brother up with his foot. \"All hands on deck!\" Bertie sat up and opened his eyes. \"What is up now?\" he said. \"Ay, what, is it you, Harry, and José too? I must have been asleep!\" \"Been asleep! Why, you went off in the middle of my watch, and Dias has been on the look-out for over three hours.\" \"Oh, confound it! You don\u0027t mean to say that I have slept for over five hours? Why didn\u0027t you wake me, Dias?\" he asked angrily. \"Two eyes were quite enough to keep watch,\" Dias said. \"I should have waked you if I had seen anything of the savages. Besides, Don Harry said you might as well go on sleeping if nothing happened, and I thought so too.\" \"I feel beastly ashamed of myself,\" Bertie said. \"I don\u0027t want to be treated like a child, Harry.\" \"No, Bertie, and I should not think of treating you so; but you had had very hard work, and were completely knocked up, which was not wonderful; and you may want all your strength to-day. Besides, you know, you would have been of no use had you been awake, for you could have seen nothing. Donna Maria\u0027s eyes were a good deal sharper than mine, and I am quite sure that, tired as you were, Dias would have seen them coming long before you would. We had better lie down again, for it will be light enough soon for them to make us out. How far do their arrows fly, Dias?\" \"They can shoot very straight up to forty or fifty yards, but beyond that their arrows are of very little use.\" \"Well, then, we shall be able to stop them before they get to that ravine.\" Presently, as it became light, a figure showed itself at the turn of the ravine. \"Don\u0027t fire at him,\" Harry said; \"it is better that they should think that our guns won\u0027t reach them. Besides, if the beggars will leave us alone, I have no wish to harm them.\" In a minute or two the figure disappeared behind the bend and two or three others came out. \"They think that our guns won\u0027t carry so far, or we should have shot the first man.\" For a quarter of an hour there were frequent changes, until at least fifty men had taken a look at them. \"Now there will be a council,\" Harry said as the last disappeared. \"They see what they have got before them, and I have no doubt they don\u0027t like it.\" \"I don\u0027t think they will try it, se?or,\" Dias said. \"At any rate they will not do so until they have tried every other means of getting at us.\" Half an hour passed, and then Harry said. \"I will stop here with my brother, Dias, and you and José had better examine the hillsides and ascertain whether there is any place where they can come down. You know a great deal better than I where active naked-footed men could clamber down. They might be able to descend with ease at a place that would look quite impossible to me.\" Without a word Dias shouldered his rifle and walked away, followed by José. He returned in two hours. \"There are several places where I am sure the savages could come down. Now, se?ors, breakfast is ready; I will leave José here, and we will go and talk matters over while we eat. The tents are only a hundred yards away, so that if José shouts, we can be back here long before the savages get up, for they could not come fast through that torrent.\" \"It seems to me,\" Harry said after they had finished the meal, \"that if there are only one or two points by which they could climb down we could prevent their doing so by picking them off; but if there are more, and they really come on in earnest, we could not stop them.\" \"There are many more than that,\" Dias replied. \"I made out certainly four points on the right-hand side and three on the left where I could make my way down; there are probably twice as many where they could descend.\" \"Then I should say that the first thing to do is to go up through the gorge above and see whether there is any place that could be better defended than this. If we find such a spot, of course we could move to it; if not, we shall have to settle whether to go up the gorge till we get to some place where the mules can climb out of it, or stay here and fight it out. By camping on the stream at a point where it could not be forded, and making a breast-work with the bales, stones, and so on, I think we could certainly beat off any attack by daylight, but I admit that we should have no chance if they should make a rush during the night.\" \"I will go at once,\" said Dias, \"and examine the river higher up. If I can find no place where the mules can climb, I am sure to be able to find some spot where we could do so. But that would mean the failure of our expedition, for we certainly could not go up the mountains, purchase fresh animals, food, and tools, and get down to the place we are looking for until too late.\" \"That would be serious, Dias, but cannot be counted against our lives. If there is no other way of escape from these savages, we must certainly abandon the animals and make our way back as best we can. In that case we must give up all idea of finding this gold stream. The star would not be in the same place again for another year, and even then we might not find it; so we must make up our minds to do our best in some other direction. That point we must consider as settled. I should not feel justified in risking my brother\u0027s life, yours, your wife\u0027s, and your nephew\u0027s, by remaining here to fight we know not how many savages—for there may be many more than the fifty we saw this morning, and they may in a day or two be joined by many others of their tribe.\" \"I should not like to lose all the animals and go back empty-handed,\" Dias said after a silence of two or three minutes, \"unless it were a last resource.\" \"Nor should I, Dias; but you see, if we linger too long we may find it impossible to retire, we may be so hemmed in that there would be no chance of our getting through. For the day of course we are safe. The savages will have to decide among themselves whether to give the matter up, seeing that they are sure to lose many lives before they overpower us. Then, if they determine to attack us, they will have to settle how it is to be done. Numbers of them will go up to the top of the hills on both sides and try to find a point at which they can make their way down; others, perhaps—which would be still more serious—may go farther up into the hills to find a spot where they could come down and issue out by the upper gorge, and then our retreat would be altogether cut off. All this will take time, so we may feel sure that no attack will be made to-day.\" \"I will start up the river at once, se?or. Certainly the first point to be settled is whether we can find a more defensible spot than this, the second whether there is any way by which the animals can be taken up.\" \"There must surely be many points higher up where this can be done.\" \"Yes, se?or, if we could get to them. But you saw we had difficulty in making our way through this gorge; there may be others higher up where it would be impossible either for us or the animals to pass.\" \"I did not think of that. Yes, that must be so. Well, you had certainly better go at once. My brother will relieve José, and after the boy has breakfasted he can return to his post, and Bertie can join me. I think if I see the savages trying to find a path I will open fire upon them. I don\u0027t say I should be able to hit them, for the top of those hills must be eight or nine hundred yards\u0027 range, and it is not easy to hit an object very much above or very much below you; but it is important that they should know that our weapons carry as far as that; when they hear bullets strike close to them they will hesitate about coming lower down, and unless they do come within two or three hundred feet from the bottom they cannot be sure of getting down.\" Dias nodded. \"That is a very good idea. Another cause of delay will be that those at the top cannot see far down the rock on their own side, so they will have to start by guess-work. Each party must fix upon the easiest places on the opposite side, and then go back again and change sides. I don\u0027t suppose they know any more of this place than we do. They always keep down in the plains, and it is only because they met us down there that they have followed us so far. I believe they will follow on as long as they think there is a chance of destroying us, for they are so jealous of any white man coming into what they regard as their country that they would spare no pains to kill anyone who ventured there. Now I will go, se?or. You will keep near this end of the valley, in case there should be an alarm that they are coming up the stream.\" \"Certainly; and my brother shall remain with José. With his rifle and the two double-barrelled guns and José\u0027s musket they could hold the ravine against anything but a rush of the whole tribe.\" An hour later Harry saw a number of figures appear against the sky-line on both sides. As they were clustered together, and would afford a far better mark than a single Indian, he took a steady aim at the party on the southern hill and fired. He had aimed above rather than below them, as, had the ball struck much below, they might not hear it, whereas, if it went over their heads, they would certainly do so. A couple of seconds after firing he saw a sudden movement among the savages, and a moment later not one was to be seen. Donna Maria, who was standing close by him watching them, clapped her hands. \"Your ball must have gone close to them,\" she said, \"but I don\u0027t think you hit anyone.\" \"I did not try to do so,\" he said. \"I wanted the ball to go just over their heads, so that they should know that even at that distance they were not safe. I have no doubt that astonishment as much as fear made them bolt. They\u0027ll be very careful how far they come down the side of the hill after that. Now for the fellows on the other side.\" But these too had disappeared, having evidently noticed the effect produced upon the others. After a pause heads appeared here and there at the edge of the crests. Evidently the lesson had impressed them with the necessity for precaution, as they no longer kept together, and they had apparently crawled up to continue their investigations. Beyond keeping a watch to see that none had attempted to descend the slope Harry did not interfere with them. At times he strolled to the breast-work, but no movement had been seen in that direction. In two hours Dias returned. \"The gorge above is a quarter of a mile through, and very difficult to pass. It is half-blocked with great rocks in two or three places, and there would be immense difficulty in getting the mules over. Beyond that it widens again, but the extent is not more than half what it is here. The walls are almost perpendicular, and I do not think that it would be possible to climb them at any point. Farther up there is another ravine. It is very narrow—not half so wide as this—and the stream rushes with great velocity along it. Two hundred yards from the entrance the rocks close in completely, and there is a fall of water sixty or seventy feet high.\" \"Well, that settles the point, Dias. We cannot get the animals out except by the way they came in. As for ourselves, we might climb up at some point in this ravine, but not in the others.\" \"That is so, se?or,\" Dias said. \"The outlook is a bad one—that is to say, we may now be unable to reach the gold river in time—but so long as we stay here we may be safe. We have plenty of provisions, we can catch fish in the stream, and no doubt shall find birds in the bushes at the lower part of the slopes. I doubt whether the natives will dare come down those precipices at night. If they try to descend by day, we can very well defend ourselves.\" \"The only question is, How long will it take to tire them out?\" \"That I cannot tell. We know so little of the Chincas that we have nothing to go upon. Some savages have patience enough to wait for any time to carry out their revenge or slay an enemy; others are fickle, and though they may be fierce in attack, soon tire of waiting, and are eager to return to their homes again. I cannot think that they will speedily leave. They have assembled, many of them perhaps from considerable distances; they have had two days\u0027 march up here, and have lost at least two of their comrades. I think they will certainly not leave until absolutely convinced that they cannot get at us, but whether they may come to that decision in two days or a month I cannot say.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3136/86225.html","bookId":888,"book":{"id":888,"title":"The Treasure of the Incas","description":"简介： Two men were sitting in the smoking-room of a London club. The room was almost empty, and as they occupied arm-chairs in one corner of it, they were able to talk freely without fear of being overheard. One of them was a man of sixty, the other some f...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3136","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
