{"id":107061,"no":40,"title":"Page 40","content":"Room 301. Rocio Eva Granada stood naked in front of the bathroom mirror. This was the moment she\u0027d been dreading all day. The German was on the bed waiting for her. He was the biggest man she\u0027d ever been with. Reluctantly, she took an ice cube from the water bucket and rubbed it across her nipples. They quickly hardened. This was her gift-to make men feel wanted. It\u0027s what kept them coming back. She ran her hands across her supple, well-tanned body and hoped it would survive another four or five more years until she had enough to retire. Senor Roldan took most of her pay, but without him she knew she\u0027d be with the rest of the hookers picking up drunks in Triana. These men at least had money. They never beat her, and they were easy to satisfy. She slipped into her lingerie, took a deep breath, and opened the bathroom door. As Rocio stepped into the room, the German\u0027s eyes bulged. She was wearing a black negligee. Her chestnut skin radiated in the soft light, and her nipples stood at attention beneath the lacy fabric. \"Komm doch hierher,\" he said eagerly, shedding his robe and rolling onto his back. Rocio forced a smile and approached the bed. She gazed down at the enormous German. She chuckled in relief. The organ between his legs was tiny. He grabbed at her and impatiently ripped off her negligee. His fat fingers groped at every inch of her body. She fell on top of him and moaned and writhed in false ecstasy. As he rolled her over and climbed on top of her, she thought she would be crushed. She gasped and choked against his puttylike neck. She prayed he would be quick. \"Si! Si!\" she gasped in between thrusts. She dug her fingernails into his backside to encourage him. Random thoughts cascaded through her mind-faces of the countless men she\u0027d satisfied, ceilings she\u0027d stared at for hours in the dark, dreams of having children... Suddenly, without warning, the German\u0027s body arched, stiffened, and almost immediately collapsed on top of her. That\u0027s all? she thought, surprised and relieved. She tried to slide out from under him. \"Darling,\" she whispered huskily. \"Let me get on top.\" But the man did not move. She reached up and pushed at his massive shoulders. \"Darling, I... I can\u0027t breathe!\" She began feeling faint. She felt her ribs cracking. \"?Despiertate!\" Her fingers instinctively started pulling at his matted hair. Wake up! It was then that she felt the warm sticky liquid. It was matted in his hair-flowing onto her cheeks, into her mouth. It was salty. She twisted wildly beneath him. Above her, a strange shaft of light illuminated the German\u0027s contorted face. The bullet hole in his temple was gushing blood all over her. She tried to scream, but there was no air left in her lungs. He was crushing her. Delirious, she clawed toward the shaft of light coming from the doorway. She saw a hand. A gun with a silencer. A flash of light. And then nothing.","sourceLink":"https://allnovel.net/digital-fortress/page-40.html","bookId":2226,"book":{"id":2226,"title":"Digital Fortress","description":"Storyline: When the NSA\u0027s invincible code-breaking machine encounters a mysterious code it cannot break, the agency calls its head cryptographer, Susan Fletcher, a brilliant, beautiful mathematician. What she uncovers sends shock waves through the corridors of power. The NSA is being held hostage - not by guns or bombs - but by a code so complex that if released would cripple U.S. intelligence. Caught in an accelerating tempest of secrecy and lies, Fletcher battles to save the agency she believes in. Betrayed on all sides, she finds herself fighting not only for her country but for her life, and in the end, for the life of the man she loves.","cover":"https://allnovel.net/images/digital-fortress.jpg","author":"Dan Brown","type":"Thriller","source":"allnovel","link":"https://allnovel.net/digital-fortress.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:01:29 PM"}}
