{"id":91557,"no":8,"title":"Page 8","content":"Pragmatic Magic\\n\\n \"What have you learned?\" Tintagel asked Shayleigh when he found her atop Daoine Dun, the Hill of the Stars. Another day neared its end in Shilmista, another day of hit-and-run battles against the overwhelming force of invaders.\\n\\n \"Fifty goblins were killed in one fight,\" Shayleigh replied, but there was no smile on her face, fair and undeniably beautiful even though one side remained bright red from Tintagel\u0027s lightning bolt of a few days earlier. \"And a giant was brought down in another. We suffered a few wounded, but none too seriously.\"\\n\\n \"That is good news,\" the elf wizard said, his smile intentionally wide in an effort to cheer the young maiden. It was a meager attempt, though, for Tintagel knew as well as Shayleigh that victory or defeat could not be measured by counting dead bodies. The enemy forces had indeed, as Hammadeen had told them, taken to the march, and for all the devastation the elves were handing them, they slowly but steadily progressed through beautiful Shilmista, scarring the land as they passed.\\n\\n \"They have taken a hundred square miles,\" Shayleigh said grimly. \"They are burning the wood in the northwest.\"\\n\\n Tintagel, for all his strained optimism, understood that Shayleigh was not alone among the elves in despair. \"The night will be clear and dark, for the moon is new,\" the elf wizard offered hopefully, lifting his light blue eyes heavenward. \"Might King Galladel call for Daoine Teague Feer?\"\\n\\n \"The Star Enchantment?\" Shayleigh echoed softly in the Common tongue. Without even considering the motion, she ran her slender fingers through her hair and her face crinkled in obvious disgust, for her golden locks, were matted with blood and grime. Shayleigh felt dirty, as did many of Shilmista\u0027s elves. The woodland folk had a way of countering those negative thoughts, though, with a cleansing of body and soul, an ancient ritual of rejuvenation.\\n\\n Daoine Teague Feer.\\n\\n \"Let us go to Galladel,\" Shayleigh said, hope and excitement in her melodic voice for the first time in many days.\\n\\n They found the aged king in one of the caves along the side of the hill that had become the elves\u0027 sanctuary. From this cave, Galladel directed the scouting missions, coordinating patrol times and designating group members. It was a heroic task, surely, for the elf king had to keep in mind which of his people were experienced fighters and which were novices, and ensure a proper blend in each party. Even more complicated, many of the elves had been injured and required rest.\\n\\n As soon as they entered the torchlit cave, both Shayleigh and Tintagel recognized how heavy Galladel\u0027s burden had become. His once-straight shoulders sagged and circles lined his eyes.\\n\\n \"What do you want?\" the elf king snapped. He threw his hands out to the side, unintentionally knocking several parchments from the chamber\u0027s main table. Obviously embarrassed, Galladel\u0027s visage softened immediately and he reiterated his question in a quieter tone.\\n\\n \"The moon is new,\" Shayleigh said, hoping that the hint would be enough. Galladel just stared at her blankly, though, and he seemed to grow angry, as if the two were wasting his precious time.\\n\\n \"The sky is clear,\" added Tintagel. \"A million stars will show themselves to us, lend us their strength for the morrow\u0027s fight.\"\\n\\n \"Daoine Teague Feer?\" Galladel asked. \"You wish to dance and play?\"\\n\\n \"It is more than play,\" Shayleigh reminded him.\\n\\n \"The millions of stars will not complete my million tasks!\" cried the frustrated elf king.\\n\\n Shayleigh had to bite her lip to keep from responding. She and a dozen others had offered to assist the king in his planning when they were not out on patrol, but Galladel had taken it all on himself, called it his duty despite the obvious fact that he could not carry the burden alone.\\n\\n \"Forgive me,\" the king said quietly, seeing Shayleigh\u0027s wounded expression. \"I have not the time for Daoine Teague Feer. Perform the celebration in my absence,\" he offered graciously.\\n\\n Shayleigh was not ungrateful, but the king\u0027s request was impossible. \"Only one of the ruling line may perform Daoine Teague Feer,\" she reminded Galladel. The look on the elf king\u0027s face explained much to Shayleigh and Tintagel. Galladel was old and tired and made no secret of the fact that he no longer held much faith for Shilmista\u0027s ancient magic. Daoine Teague Feer was indeed just play to him, a dance with little value beyond its immediate enjoyment. If taken from the king\u0027s disbelieving perspective, then, what did it matter who led the celebration?\\n\\n Still, Shayleigh could not hide her frown. Her king had grown pragmatic, even humanlike, and she could not find the courage to blame him. When she was but a child, only a short two centuries before, a thousand elves had danced in Shilmista. The whole forest, from north to south, echoed with their unending song. Those days seemed far removed now. How many of Shilmista\u0027s children had passed to Evermeet, never to return?\\n\\n Tintagel tapped the maiden on the elbow and nodded to the exit. \"You are due on patrol,\" the elf wizard whispered to prompt the maiden along.\\n\\n Shayleigh had the presence of mind to dip a bow as she left, but Galladel, already back to poring over the many parchments, did not even notice.\\n\\n A mood of similar frustration gripped the invaders\u0027 camp as twilight descended over Shilmista. Ragnor\u0027s march was making gains, but they came painfully slow and at incredible expense. The elves were fighting better than the ogrillon had expected; he thought he would be more than halfway through Shilmista by this time, but his forces had put only ten to fifteen of the hundred-and-fifty-mile expanse behind them and they hadn\u0027t even secured those miles they had covered! Ragnor feared that his troops were looking more to the sides for fear of concealed archers than ahead to the trails of conquest.\\n\\n Better news came from the flanks, where resistance had been minimal. Orogs and orcs, running in the foothills of the Snowflake Mountains, had passed the forest\u0027s halfway point, and a tribe of goblins out on the plains to the west had nearly entered the southwestern pass around the forest, where they would set up camp and discourage any reinforcements from the city of Riatavin.\\n\\n But Ragnor knew he did not have the numbers to surround the forest, and if the elves continued to hold him off at the present rate, they would surely find allies before the ogrillon claimed Shilmista for Castle Trinity. And what of the coming winter? Even cocky Ragnor did not believe he could hold the goblinoid rabble at his side when the first snows fell on the forest. Time worked against him, and the brutal elves intended to fight him every step of the way.\\n\\n If the ogrillon had any doubts of the elves\u0027 intent, he had the proof right before him. Looking out across a steep valley and a rushing river, Ragnor watched the latest skirmish. A mixed group of goblins, orcs, and a few ogres had been surprised by a band of elves. Ragnor\u0027s troops had been crossing a field, approaching a thick grove, when a hail of arrows had sent them scrambling for cover. From this far back, the ogrillon had no idea how many enemies his forces faced, but he suspected that the elves were not numerous. Still, they were undeniably effective, for the orcs and goblins had not come out of hiding, and those few brave and stupid ogres who had rushed the tree line had gone crashing down with a score of arrows in their bodies.\\n\\n \"Have you sent the giant and a band of bugbears?\" the ogrillon snapped at his closest lieutenant, a weak but cunning goblin.\\n\\n \"Yesses, my general,\" the goblin replied, cowering, and with good reason. Ragnor\u0027s first few \"closest advisors\" now numbered among the dead, though none of them had gotten anywhere near any elves.\\n\\n Ragnor glared at the goblin, and it cowered even lower, nearly rubbing its belly on the turf. Fortunately for the pitiful creature, the ogrillon had other business on his mind. Ragnor looked back out to the distant battle scene, trying to figure how long it would take his giant to get across the river and within boulder-throwing range.\\n\\n Another anguished cry split the morning air as yet another monstrous soldier caught an elven arrow. Ragnor reflexively swung his hand out to the side, catching his advisor with a backhand slap that sent the goblin tumbling away.\\n\\n \"That should inspire loyalty,\" came a woman\u0027s voice from behind. The ogrillon spun about to see the wizard Dorigen, a bat-winged imp on her shoulder and a huge human at her flank.\\n\\n \"What are you doing here, wizard?\" the ogrillon spat. \"This is not your place, nor the place of your favored boy!\" He eyed Tiennek dangerously and Dorigen feared she might already have to intervene between the two.\\n\\n \"Well met, to you as well,\" the wizard replied. She hadn\u0027t expected a warm reception from Ragnor; he was smart enough to understand that Aballister had sent her to spy on his progress and his ambitions.\\n\\n Ragnor took a threatening step Tiennek\u0027s way, and Dorigen wondered honestly if she had anything in her magical repertoire that could stop the monstrous general. She fingered her magical onyx ring, considering the time it would take for her to loose its fiery fury, and the potential for that fury to stop the brutish ogrillon.\\n\\n \"I am here because I was commanded to be here,\" she said sternly, hiding her concerns. \"You have been out of Castle Trinity for many days, Ragnor, but you seem to be stumbling about the northern woods with few clear gains to show for our considerable expense.\" Ragnor backed off a bit and Dorigen hid her smile, amazed at how easily she had put the powerful beast on the defensive. Her conclusions had been no more than an educated guess she had no way of knowing how Ragnor\u0027s battle plan was progressing but the ogrillon\u0027s reaction had confirmed that she wasn\u0027t far from the mark.\\n\\n \"We are concerned,\" Dorigen continued, mellow and nonthreatening. \"The summer is nearly past, and Aballister wants to take Carradoon before the first snow.\"\\n\\n \"So he sent you,\" huffed Ragnor, \"thinking that you might help poor Ragnor.\"\\n\\n \"Perhaps,\" Dorigen purred noncommittally.\\n\\n \"You need the help,\" Druzil added, then he dropped back under his bat wings to escape the ogrillon\u0027s glare.\\n\\n \"I need no weakling wizards in my camp!\" Ragnor growled. \"Be gone, and take Aballister\u0027s bat and your boy with you.\" He turned back to the valley and the river and tried to look busy.\\n\\n \"Then all goes well?\" Dorigen asked, using the most innocent tones she could muster, cocking her head coyly.\\n\\n When Ragnor didn\u0027t react, Dorigen got more direct after selecting the components for a defensive spell from one of her deep pockets, in case Ragnor seriously objected. \"You are stopped, Ragnor,\" she declared. \"Admit it before you fall like Barjin did.\" The ogrillon spun on her, but she did not relent.\\n\\n Did you have to make that reference? Druzil asked telepathically, for the imp most certainly did not like the way Ragnor was now looking at him.\\n\\n \"And have you come to bring that about?\" Ragnor spat.\\n\\n \"I have come as an agent of Talona,\" Dorigen insisted, \"to aid an ally, even one too foolish to accept the help he needs!\"\\n\\n Dorigen looked past the ogrillon then, to the distant valley and the battle that was not going Ragnor\u0027s way. She waved her hand and chanted, and a block of shimmering, flickering blue light appeared before her.\\n\\n Ragnor took a tentative step backward. Dorigen handed Druzil over to Tiennek, took one step forward, into the light, and was gone.\\n\\n After a split second to consider his new position, Druzil dove into the portal behind her.\\n\\n Ragnor instinctively spun about and saw a similar field of blue flickering beyond the river. It diminished as soon as Dorigen stepped through, Druzil again on her shoulder.\\n\\n \"I do not like elves,\" Druzil whispered, and he faded into invisibility. \"Nasty creatures!\"\\n\\n Dorigen paid him no heed, except to offer a scowl to let him know that she had wanted him to remain with Tiennek. Dorigen had no time to worry about the bothersome imp, though. She studied the battle, trying to get a perspective on what was happening around her. She saw orcs and goblins far ahead of her, crouched behind fallen logs, small ridges, anything they could find to shelter them from the tree line. Other monsters lay dead or dying, some of the ogres covered with arrows. Dorigen followed Druzil\u0027s lead and became invisible, not trusting the range of fine elven bows.\\n\\n Even with the masking spell, Dorigen dared not approach the trees. Elves, being magically inclined, had a natural sense for such magic. Dorigen considered her options for a moment, then fumbled about in the many pockets of her robes.\\n\\n \"Damn!\" she growled, then, with sudden insight, she reached up, felt for Druzil, and tore a bit of fur from the joint at the base of the imp\u0027s wing. The movement, offensive in nature, forced the wizard back to visibility.\\n\\n \"What are you doing?\" Druzil demanded, shifting about and digging his claws into Dorigen\u0027s shoulder. He, too, became visible, only to fade away a moment later.\\n\\n \"Sit still!\" Dorigen commanded. She felt the tuft for a moment, hoping it would suffice. The spell called for bat fur, but the wizard couldn\u0027t seem to find any among her components at the moment, and she had no time to go hunting bats. Dorigen found some natural cover behind a tree and prepared herself.\\n\\n For several minutes, for this spell was not a quick and easy one to cast, the wizard went through the designated motions, chanting softly. Another goblin died in that time, but Dorigen considered it a minor loss in light of the coming gains.\\n\\n Then it was done and an eyeball hovered in the air a few feet ahead of Dorigen. It became translucent almost immediately and, following Dorigen\u0027s mental commands, floated off toward the tree line.\\n\\n Dorigen closed her own eyes and saw through the detached orb. It made the trees and flitted about, looking this way and that, floating the length of the elven line. Dorigen kept it moving swiftly, but even so, several elves stiffened and looked about nervously as it passed.\\n\\n Dorigen soon came to the conclusion that all of the elves not a substantial number were above the ground in the trees. The greatest factor working against the orcs and goblins was their own fear, for a bold charge would dislodge the few elves from their tenuous positions.\\n\\n \"I must begin the charge,\" the wizard whispered.\\n\\n She chose as her target a large elm in the center of the elven line. The detached eyeball floated in so that the wizard could make a count of her intended victims. One maiden, golden haired and with striking violet eyes, turned abruptly, following the floating orb\u0027s path.\\n\\n Dorigen released her thoughts from the eyeball, pulled a different component from her robe, and began another spell.\\n\\n \"Down! Down!\" she heard the distant elven maiden cry. \"Wizard! They have a wizard! Get down!\"\\n\\n Dorigen moved her next spell along with all the speed she could muster. She saw a slender form drop from the distant tree, then another, but she hardly cared, for her spell was done and the rest would not escape.\\n\\n A tiny ball of fire flew from Dorigen\u0027s fingers, making great speed for the tree. Dorigen had to stand partly in the open to direct its course, but she knew the elves would be too busy to bother with her.\\n\\n The ball disappeared into the elm\u0027s boughs. In the blink of a magical eye, the great tree became a fiery torch.\\n\\n The savage flames quickly consumed all the fuel that the elm, and the elves in its boughs, could offer. Branches crackled and tumbled down beside the charred bodies and blackened suits of fine mesh armor.\\n\\n Dorigen aimed her next spell at her own troops.\\n\\n Do not hesitate! she roared in a magically enhanced, thunderous voice. Charge them! Kill them!\\n\\n The sheer power of her command, a voice as great as a dragon\u0027s roar, sent the orcs and goblins scrambling toward the tree line. A few died from random bow shots, but most tore right into the brush. They found only one living elf to hack, a pitifully wounded creature at the base of the ruined elm. Near death even before the goblins arrived, he offered only minor resistance. With wicked glee, the goblins took him apart.\\n\\n Just as satisfying, the monsters recovered bodies, the first enemy bodies they had seen since the start of the campaign: charred and blackened elves.\\n\\n Gratified by their whoops of joy, Dorigen turned about, conjured another extradimensional door of shimmering light, and stepped through, back to the high ground beyond the river.\\n\\n \"I believe they killed one wounded elf,\" the wizard said calmly, walking by the stunned ogrillon. \"Foolish. He might have made a valuable prisoner. You should better control your bloodthirsty troops, General Ragnor.\"\\n\\n Ragnor\u0027s sudden burst of laughter turned her about.\\n\\n \"Have I welcomed you to Shilmista?\" the ogrillon offered, his tusk-adorned smile stretching from ear to ear.\\n\\n Dorigen was glad she had improved the surly monster\u0027s mood. \\n\\n","sourceLink":"https://allnovel.net/the-cleric-quintet-in-sylvan-shadows-the-cleric-quintet-2/page-8.html","bookId":2108,"book":{"id":2108,"title":"The Cleric Quintet: In Sylvan Shadows (The Cleric Quintet #2)","description":"Storyline: \"Cadderly must leave his home to combat the evil unleashed by the Chaos Curse. To counter Castle Trinity\u0027s plans for conquest, the cleric and his friends enter the beautiful forest of Shilmista. But among the trees and glades of the forest, Cadderly must battle a monstrous evil.\"\\n","cover":"https://allnovel.net/images/the-cleric-quintet-in-sylvan-shadows-the-cleric-quintet-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-cleric-quintet-in-sylvan-shadows-the-cleric-quintet-2.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:50:52 PM"}}
