{"id":37597,"no":30,"title":"CHAPTER XXX PEDRO","content":"Gaspard, leaning on the taffrail, watched Martinique dwindling in the sun-blaze and sea-dazzle. Dominica, to eastward, stood vague, and ghostly on the horizon; to westward the sea showed nothing but the purple of an infinite pansy, an ocean of St. Estèphe or Macon blazed upon by the fiercest light of the tropics. Sagesse was standing by the negro who was at the wheel, and La Belle Arlésienne was heading nor’ nor’-west on a course that would take her to westward of St. Kitts and past the Virgin Islands. Here Sagesse would steer a west-nor’-west course. It would be a quicker passage than in coming, for they had now with them the South Equatorial current. Gaspard, as he turned from the taffrail, heard Sagesse give an order for the hands to man the lee braces. They were beyond the shelter of the island now, and the steady blow of the trades was bending La Belle Arlésienne over gently, as though a great hand were playing with her. “Now I will capsize you,” would sigh the voice to which the hand belonged, speaking with a deep hum through the taut, twanging rigging, whilst La Belle would bend like an old coquette to the gentle pressure, till, with a groan of the rudder and a dash of sparkling spray, she would remember herself and come to a more even keel. Gaspard had noticed the number of the crew when he203 came on board; besides Sagesse and Jules there were ten hands, all negroes, large, well set-up men, well fitted for the arduous work before them, with the exception of one, an undersized, shifty-eyed and depressed-looking individual from Porto Rico. “Ten,” said Gaspard to himself, as he counted them. “With Sagesse and Jules that makes twelve, and with me thirteen. Thirteen, and we start on a Friday, and we expect luck!” “Regardez,” said Sagesse, ranging up beside him and indicating the crew. “They are not a bad lot; all but that Porto Rican—he is new to me and does not know our ways. We will make a better man of him before the voyage is over. Look how Jules handles them.” After Sagesse, Jules was the ruling spirit on board the barquentine. He had never to repeat an order, and he was a man much more after Gaspard’s heart than Sagesse; yet he was tainted by Sagesse and, most evidently his slave. There was only one other person beside Gaspard on board who did not bend entirely to the eye of the redoubtable Captain, and that was the Porto Rican. This individual obeyed orders in a surly manner, and Sagesse watched him with a brooding eye. “We will make a better man of him before the voyage is over,” said he again, as he turned from the hands who were being dismissed, and stood for a moment looking to windward at the blue ghost of Dominica. Gaspard said nothing. He did not even remark on the unlucky number of the crew. He had imbibed the teaching of M. Seguin with regard to Sagesse, and he felt that in this voyage, so filled as it was with the possibilities of wealth, things might happen of a disastrous nature, and that silence and watchfulness204 were essential. He did not in the least know that Sagesse, under the delusion that his plans had been betrayed to M. Seguin, had sworn to be even with him (Gaspard). He knew nothing of this, but something warned him to be silent, civil as possible to this extraordinary man, and on the look-out. On that day, in fact, began a duel of intelligence between these two men, the ending of which none could forecast from the nature of the men themselves. The expedition had been so rushed that Sagesse felt dissatisfied in his mind as to the stowage and condition of some of the most important gear. The diving-dresses, pumps, tubes and boring instruments were accordingly brought on deck after dinner from the lockers where they had been stowed. Sagesse, who knew a little of everything, and whose natural genius and commonsense supplied most deficiencies in his knowledge, had the pump taken to pieces and each piece greased thick and wrapped in canvas; the metal parts of the diving-dresses were treated with the same care, only in a different manner; the dresses themselves, the air tubes, the whole gear down to the least detail came bit by bit under his careful inspection and received as much attention as possible to protect it from the influence of the sea air and the tropical rot that touches all things from metal to morals. At eight bells (four o’clock) Gaspard, who had retired to his bunk for a doze, was awakened by a cry from the deck. He had left the door of his cabin wide open and the deck-house door being also open, he could see the white, sunlit deck, the figure of Sagesse, the figures of several of the crew and something lying on the deck before Sagesse. He tumbled out of his bunk and came through the deck-house into the sunlight. 205 Sagesse was holding a belaying-pin in his hand, and the thing on the deck before him was the Porto Rican, Pedro. The man was covered with blood from a wound in the forehead. He was just raising himself on one hand as Gaspard came on the scene, and he looked dazed, like a person awakening from sleep. Next moment, he was scrambling on to his feet, literally kicked on to them by Sagesse, and making for the fo’cs’le, where he disappeared, followed by a shout of laughter from the men on deck. “That will teach him,” said the Captain, flinging the belaying-pin in the weather scupper and wiping his brow with his coat-sleeve; then, as he turned, he saw Gaspard and started slightly. His face wore an expression of chill ferocity quite new to Gaspard; it was as though the devil in the man had taken possession of his features for a moment—a moment only, for the next he was laughing and himself again. “Bah!” said he. “I believe the scamp made me lose my temper.” He stepped to the weather rail, shaded his eyes and looked over the sea. Dominica had vanished, painted out by distance; a star of light on the far horizon indicated the topsails of a ship hull down beyond the sea-line; nothing else was to be seen. “We’ll see no more land till we touch the Virgins,” said Sagesse. “From there to your island, compère Gaspard, is, as near as I can make it, three hundred and sixty miles; from here to the Virgins is a matter of two hundred and ninety, so you can add the sums together, and you will know the length of your road.” “What are we doing?” “Eight knots.” “When will we get there?” “Bon Dieu, how you talk! We are in the hands of the wind.” 206 Gaspard filled his pipe and lit it, Sagesse, leaning against the bulwarks, lit a Martinique bout and with his hands in his pockets looked lazily over the sea. “See here,” said Gaspard, after a moment’s silence. “Suppose we reach that place all right, and suppose we find stuff there—” “Yes?” “Well, how are we to get rid of it?” Sagesse laughed. “You are one of those that look far ahead. So am I. Suppose we find stuff there, well, who does it belong to but us? We have located it, we have got an expedition together to find it, the island belongs to no government, the stuff belonged to people who were dead when you and I were born. The stuff belongs to us by all right. Is that not so?” “As you put it, yes.” “Well, my friend, there is no such thing as Right in this world. As soon as it is known that we have found the old money-box, broken her open and taken the contributions, some government will say, ‘That island is mine,’ some man will rise up with a lying charter, proving that he bought the island and the ship years ago, some rascal trick will be played by some rascal, and we will have law-suits; the stuff will be impounded, witnesses will be brought from the ends of the world to bear false witness, our characters will be enquired into—” Sagesse laughed as he spoke, crossed the deck to the lee rail, spat into the sea, and returned. “They will say, these lawyer-men, ‘who is this Monsieur Sagesse who finds old treasure-ships? Let’s hunt up all about him, and if we can’t find anything against him, let us make something against him.’ No, my friend, I wish to have nothing to do with the law; nothing to do with governments; nothing to do with enemies on this occasion. So,207 being a man who looks ahead, I have already made my plans for disposing of the stuff in America—” Sagesse came to a dead stop. His habit of talking had got possession of him and carried him further than he meant to go. “In America?” “There, or somewhere else.” At this moment Jules came out of the fo’cs’le, where only a few minutes before Pedro had disappeared, and came along the deck to Sagesse. He spoke a couple of words in an undertone, and Sagesse following him they both went forward. Gaspard watched them vanishing down the fo’cs’le hatch. The thought that Pedro had been seriously injured crossed his mind for a moment, but his mind, filled with the words of Sagesse, had no room for thoughts about Pedro. America! If they had to go to America to dispose of the stuff, the voyage might last months, and to Gaspard the few hours that had passed since losing sight of Martinique seemed months. He had found all he wanted in life, and he had left it behind him there in Martinique. As he stood waiting for Sagesse to return and finish the conversation, he saw Marie again just as he had seen her that day on the cliff at Grande Anse, the sea wind fluttering her robe and the sun clasping her little head between his two great golden hands. Then Sagesse appeared, returning from the fo’cs’le, but he did not seem in a humour to continue the conversation. He seemed disturbed in his mind about something.","sourceLink":"http://novel.tingroom.com/jingdian/1766/51557.html","bookId":1115,"book":{"id":1115,"title":"The Ship of Coral","description":"简介： The sea lay blue to the far horizon. BlueAh, blue is but a name till you have seen the sea that breaks around the Bahamas and gives anchorage to the tall ships at Port Royal; that great sheet of blue water stretching from Cape Catoche to the Windward...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1766","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
