{"id":37606,"no":39,"title":"CHAPTER XXXIX DISASTER","content":"A smoke-coloured band, curious, and like a thin curved cloud, cut the grey background of sky to eastward. It was in motion. Even as he looked it changed subtly in shape till now it became a comet of smoke, head pointing to the island. \n \n Far away to the northeast, another band of smoke, grey and also in motion, caught his eye. \n \n There was something sinister in these apparitions so strange to the eye, so perplexing to the mind, so dismal in colour against the dismal grey of the sky. \n \n What could they be? \n \n The coin he held in his hand was forgotten; unconsciously he put it in his pocket and, folding his arms, looked. \n \n Now the approaching comet of smoke altered again in form, becoming a line definite, distinct, and swiftly approaching like an apparition in a dream. \n \n Ah! what was that—that voice mournful and complaining? In a flash the meaning of the phenomenon was revealed. They were birds. A vast flock of gulls, thousands, beating the air as with one wing, crying aloud as with one voice; then silent, always advancing. \n \n And now the gulls of the island rose clamouring, like a burst of smoke; in a moment the air was filled with birds, in a moment the oncomers had joined the island250 birds, in a moment, all rising as if by common consent, the feathered thousands took definite form and encircled the island in a vast moving ring. \n \n The “hush” of their wings sounded like the continuous beating of the sea on the shore. \n \n Gaspard, with head upturned, gazing at the wonderful sight, saw the second flight approaching. It joined the others, circled with them, and then, just as if the moving ring had been bent by a wind, it broke and in two vast flocks the moving host passed away to westward, became clouds again, and slowly vanished, leaving the island to silence and desolation. \n \n There was something tragic in this great migration of birds and in the utter silence that followed their vanishing. There was something disturbing in the absolute peace which had taken the whole world into its keeping. \n \n Close to Gaspard, caught in the branches of the bay-cedar bushes, lay something white. As he turned his eyes from the western horizon, whence the great flock had vanished, his eyes caught this white thing, and he approached it. It was the skull of Serpente, thrown away by Sagesse, now grinning at the grey sky as though reading there some frightful joke, some diabolical secret of Nature. \n \n Gaspard turned his eyes from this thing to the distant vessel, caught in its flight, arrested and held in bondage by the calm. One might have fancied that the grinning skull drew its mirth from the predicament of Sagesse. To Gaspard it seemed that the skull was the centre from which all that silence and desolation of sea and sky radiated, the quid obscurum at the heart of that peace which was holding the world in its spell. \n \n He turned to the southern beach and sought the tent.251 As he entered it and lay down to rest his aching head, the sea again, moving uneasily, boomed on the reef to northward and sighed on the sand of the southern beach. The unrest, the unhappiness that lives in the heart of things, seemed to speak in that voice. \n \n He turned as he lay and cast himself face downwards with arms outstretched. Tricked, betrayed, marooned, robbed of the gold for which he had forgotten her, he remembered now Marie. Sagesse, the treasure, La Belle Arlésienne, all that trash vanished from his mind for a moment before the vision of the thing he loved. \n \n Had there been the slightest chance of outwitting Sagesse, of regaining his hold upon the treasure, the fever for revenge and gold would have held his mind from all else; but he recognized that the game was lost, and in his desolation he turned to his only thought of comfort. And here again the game was lost. Love had tricked him just as fortune had tricked him, and just as cruelly. \n \n To find Marie again he must first find Martinique. Suppose, even, that a ship were to rescue him; that ship might be bound for any port in the world but Martinique. He had no money, no trade. To gain enough to return to St. Pierre he would have to go back to the stokehold, he would have to work ships across and across the world before his wretched pay, saved and scraped together, would give him money sufficient to return with. He might write to M. Seguin, but where in his wandering life would he get the reply? \n \n It might be months before a ship rescued him; it might be months before that ship landed him at a port where he could get work; it might be years before he reached Martinique—and meanwhile, what of Marie? Ah! the want of money, just a little of that money which the rich find so252 burdensome, that want is the curse of the poor, that want is the essence of the true tragedy of life. \n \n The hunger which poverty imposes on man is nothing to the loneliness and the separation, the heart-break and the starvation for want of love. \n \n He loved Marie now, with the love that comes after marriage, the love that has nothing to do with passion. Across separation and disaster he saw her as she really was, beautiful, single-hearted, loving, and faithful—and he might never meet her again. To reach her he would have to journey to all parts of the world, working as a slave in a stokehold with that ache in his heart, earning sou by sou, the money that would bring him to her—and every moment of separation seemed a year. \n \n Stung suddenly to madness, with the tears upon his face, he left the tent and sought the beach outside, walking up and down it like a frenzied creature, cursing, calling out, wild with the petty things that had him in their grip, the little Fates that had bound him to this islet as the Lilliputians bound Gulliver. He saw nothing of his own handiwork in this fate which he cursed; he saw nothing of the grave faults of mind, the weaknesses, the impetuosities that had flawed his life, killing Yves, and binding him to the will of Sagesse; he only saw his Fate and that it was horrid—and he cursed it. \n \n After awhile he paused. A wind had risen and was blowing from the north across the islet. He recognised that the day had grown suddenly darker and as he stood wiping the sweat from his brow, confused, and exhausted with the conflict of thought through which he had passed, he heard a noise, faint, far away, and indeterminate. It came from the north with the wind that was now increasing in force. He glanced round at the sky. All the northern253 sky was dusky, like hot bronze; it had a solid look, and even as he gazed some wind of the higher atmosphere set to work compacting the upper part of this dark zone, ruling it level in one infinite line. Added to the darkness of the coming storm was the dusk of evening. The drug must have held him in its spell much longer than he had thought. \n \n Next moment Gaspard was making across the islet to the northern beach; when he reached it he stopped, shaded his eyes with both hands, and looked. \n \n La Belle Arlésienne had got the wind at last. She shewed as if sketched in grey chalk against the great black wall that the coming storm had built across the world. Heavens! what a sight was that wall! It seemed built by plumb-line and square, titanic, immeasurable. \n \n And from behind it came that sound, growing momently more definite, as though all the hosts of darkness were murmuring together, wild to break through some hidden door and burst upon the world. \n \n Against this prodigious menace La Belle Arlésienne was moving, steering N.N.East on the starboard tack. Sagesse had taken in sail, but in the face of what was coming, not enough, to a sailor’s eye. But no one knew better than Sagesse that all to southward of him the sea was full of death, in the form of rocks and shoals; to make an offing was imperative. \n \n Now the wind was coming in gusts, whipping the foam over the reef, and the spray in the face of Gaspard, and before the wind the league-long waves were racing shoreward. \n \n As he looked, as he listened, the great wall seemed gradually to bend from the top and over it came the rushing wind, and with the wind the first note of thunder, profound,254 funereal, and dreamy; less like thunder than the muffle of muffled drums. \n \n At this moment the setting sun, pale like an appalled spectator, glanced through the clouds, lit the sea, La Belle Arlésienne and the advancing wall of storm. It was no longer a wall; it had become concave, in the form of a breaking wave, and the wave became veiled with mist, and La Belle Arlésienne blotted out behind the roaring rain. \n \n Dominating the thunder, the wind, the howling of the storm, the voice of the rain tore the air as it washed over the sea and then over the islet, wave-like and solid almost as a wave. It cast Gaspard down like a great hand and held him half drowned; it released him for half a second and before he could struggle to his feet the wind hit him and drove him like a rag amidst the bushes, and the sand of the beach rushed over him, not as sand but slush, half choking him. He thought the waves of the sea were upon him, but there were now no waves on the sea, which was as smooth beneath the wind as a new planed board, and as white as driven snow. \n \n On his face, now, struggling to rise, he could not; it was as though a great sheet of iron held him down, and with the first real crash of thunder, prone on his face, he felt the earth splitting under him and shouted to the mud beneath him, “The world is gone—the world is gone!” But the world held fast though now, blow after blow, the gods seemed smashing at it with mighty hammers, sickening concussions, jets of light, deafness, blackness, misery, and the iron hand of the wind, all had fallen upon the world, rending thought to pieces. It could have lasted but a minute, this first desperate onslaught of the hurricane, yet to Gaspard it seemed that time had been torn away by the wind, that he had known eternity. \n \n 255 Now, released partly from the grip of that hateful hand which had pressed him nearly to death, he struggled to his knees and crawled further amidst the bushes where they were thickest; here there was shelter of a sort, the bushes low-growing and firm-rooted made a bulwark against the wind and the spindrift rushing across the island like blown white sheets. Again and again the yelling blackness would be lit by the lightning and the whirling spirals and blankets of spray above shown up only to vanish in the roaring darkness where the world seemed fighting for its life with chaos. \n \n Then came stupor; like a man half under the influence of chloroform the man amidst the bushes, deafened, and blinded and stupefied by the torment around him, saw visions, and dreamt dreams in which the blinding lightning flashes lit blue seas and the voice of the wind was the voices of people. \n \n How long he lay like this it would be impossible to say before raising himself on his elbow, he returned fully to consciousness. \n \n The great fury of the hurricane had passed; it was still blowing hard and strong, but the worst was over and the moon was lighting the world through the rushing clouds. He rose to his feet, but fell on his knees again immediately. He had eaten nothing during the past twenty-four hours, and the drug was still weakening him; but in the moment of rising he had seen a sight surpassing in terror even the fury of the hurricane, and now amidst the bushes, on hands and knees, motionless and petrified by the drama before him, he looked. \n \n La Belle Arlésienne was coming ashore, now uplifted on the crest of a wave, now vanishing in a hollow, dismasted all but for the stump of the foremast, from which a rag of256 canvas was wildly flying. La Belle Arlésienne was being driven to the lagoon by the merciless whip of the wind. \n \n The hag of the sea had found her master at last; stealth and cunning could not save her now, nor trickery, nor subterfuge. She had flung them all away. Like some witch who had worked evil long in silence, dragged at last shrieking to the gallows, the old barquentine seemed fighting against her fate. \n \n Her fluttering rags of canvas seemed clawing at the wind; she screamed, and Gaspard on his knees could hear her screams in the high-pitched wailing of her crew, the shrill pig-like screaming of negroes hurled and huddled together, animals waiting for inevitable death. \n \n A moment he saw her held up strong in the moonlight on the crest of a vast wave; then a cloud drew a skirt of shadow over her and when the moon broke through again she was gone, deep in the pocket of the lagoon, over which the thirty-foot waves were rushing shoreward. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1766/51566.html","bookId":1115,"book":{"id":1115,"title":"The Ship of Coral","description":"简介： The sea lay blue to the far horizon. BlueAh, blue is but a name till you have seen the sea that breaks around the Bahamas and gives anchorage to the tall ships at Port Royal; that great sheet of blue water stretching from Cape Catoche to the Windward...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1766","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
