{"id":37575,"no":8,"title":"CHAPTER VIII THE ESCAPE","content":"He stood for a moment balancing himself, his eyes sweeping the sky-line to southward, which shewed neither sail nor stain of smoke, and as he stood he heard the island calling to him. “Hi! Hi! Hi! you there in the boat! come back! come back! Hi! Think you to escape us? Ha! ha!—hi! Fishing, wheeling, calling, O the weariness, the blueness, the waves, the wind, the sun; they are ours and they are yours, forever—forever—forever. Hi!” Through the voices of the gulls came the monotonous tune of the beach across the bright morning sea. The tent flap had got loose again and was beckoning. Come what might, provisions and water must be taken on board and the clothes he had left on the reef spar recovered. He felt like a man who had just escaped from a haunted house, yet he had to go back. To land again on that terrible spot and leave the boat whilst he hunted for the things was an act requiring real courage, but it had to be done. He got the sculls out and, rowing towards the strand, beached the boat cleverly. There was no danger in leaving her, as the tide was ebbing; the only danger was in delay, for if the water receded too far, he would not be able to get her afloat again till high tide. Jumping out knee-deep, he hauled her nose a little higher on the sand, then, running like a man pursued, he50 made for the tent, seized the belt and the pouch of money, made for the heap of provisions, seized a bag of biscuits and some tinned stuff, and with his arms filled returned to the boat. It was a nightmare business, for the vague fears of yesterday had become more definite, as though the near chance of escape had given them life. He felt Yves behind him as he ran, sweating as he ran, from the boat to the store of provisions and back to the boat. An empty water-breaker from the Rhone lay near the tent. This had to be filled; the spring was amidst the bushes, yet he made his way there, crushing the brushwood under his naked feet, his breath coming in bursts, his lips dry as sandstone. Yves had not caught him yet, as, the breaker on his shoulder, he came running back to the boat. He flung it in; the clothes, now, had to be fetched, the worst part of the business, for it was fifty yards down the beach to the ridge of reef and the clothes were at the extremity of the reef. But it had to be done, and he ran, sweating yet shivering, worked up to the wildest pitch of excitement, by the sea edge to the shore end of the reef. He was without his boots,—he had forgotten that,—and the reef was sharp and rough; there were edges like knives that had to be avoided, drive Fear as she might. This was the place where Yves had first stood behind him in imagination, and it was here, now, that the pursuing terror was most acute. At last, bleeding, panting, with shaking hands, he reached the clothes. He put on the boots and with the coat, shirt, and trousers under his left arm, came back swiftly along the reef, sprang on to the sand, and, running, shouting, gesticulating with his free arm, made for the boat. 51 He was shouting at the boat; she was there safe enough and in full sight; yet viewless hands seemed preparing to push her off; she would be gone before he reached her, the island would never let him escape. When he reached her he brought his open hand bang down on the gunwale as if to make sure she was really there, flung in the clothes and then tried to push her off. The tide had ebbed more quickly than he had imagined. She was firm on the sand. It was a two men’s business to float her and he never would have done it, had he been alone; but he was not alone. Fear was with him. The boat gave to his efforts, shifting slightly, then more and more, till she moved stem and stern to the lifting waves and was afloat. He tumbled into her and she came broadside on to the strand; but the waves were less than two feet high and with one of the sculls he managed to pole her out, then, seizing both sculls, he rowed. He was free of the island at last; sculls and current were sweeping him from it into the wastes of the blue sea; the water, all merry with the breeze, smacked the boat cheerily and flashed away and away, in the level sunlight to where the palms were waving, and the foam was breaking, and the sea gulls calling. “Come back!—come back!—you are leaving us, but our voices are following you. Go far as you may, our voices will follow you, our weariness, the sunlight, the blueness shall be yours forever—you there in the boat alone, where is Yves—Yves—Yves?” Then, more far away, the last word, the last echo from the island, “Yves—Yves—Yves.” 52 Now, there was nothing but the passing of the wind, the sound of the sculls, and the warbling of the water. There were no waves here, the shallows and the reefs had made the sea choppy close to the island; here there was nothing but a heave of the sea, long lapses of swell, infinitely blue, breeze-strewn and sun-dazzled.","sourceLink":"http://novel.tingroom.com/jingdian/1766/51535.html","bookId":1115,"book":{"id":1115,"title":"The Ship of Coral","description":"简介： The sea lay blue to the far horizon. BlueAh, blue is but a name till you have seen the sea that breaks around the Bahamas and gives anchorage to the tall ships at Port Royal; that great sheet of blue water stretching from Cape Catoche to the Windward...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1766","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
