{"id":13186,"no":23,"title":"A Footnote","content":"I\u0027ve tried to be factually accurate in this story. Horse cars really ran where Si rode them; El stations actually were located where he got on and off trains; the things he saw in the lobby of the old Astor House were really there; quotations from newspapers he read are verbatim; and the arm of the Statue of Liberty did indeed stand in Madison Square, a truth that especially pleases me. Occasionally my efforts at accuracy became compulsive, as in my account of the World Building fire and events just preceding it, in which I became obsessed with getting times of day and exact details of changing weather during the fire, and names of tenants and even the room numbers of that unmemorable old wreck of a building correct or close to it. I even tell myself that my fictional solution to the mystery of that forgotten fire\u0027s origins blends so well with the known facts that it might have been accepted as truth at the time. This kind of research becomes time-wasting foolishness, but fun. I haven\u0027t let accuracy interfere with the story, though. If I needed a fine old Dakota apartment building in 1882, and found it wasn\u0027t finished till 1885, I just moved it back a little; sue me. So there are some deliberate inaccuracies, and maybe even an outright error or two; it\u0027s only a story, offered only as entertainment. But—with the enormous help of Warren Brown and Lenore Redstone, who did a great deal of knowledgeable, imaginative research—I doubt that I made too many. Si\u0027s photographs and sketches were not, of course, products of his own hand. Many of the best illustrations were searched out with endless patience, kindness, and intelligent judgment by Miss Charlotte La Rue of the Museum of the City of New York. Others were kindly lent to me by Brown Brothers ; by Culver Pictures, Inc. ; by the Home Insurance Company ; by the Museum of the City of New York ; and by The New-York Historical Society, New York City. The photographs and sketches represent the time pretty well, I think, even though they couldn\u0027t all be strictly of the eighteen-eighties. Before 1900 things didn\u0027t change so fast as now—one more reason why Si so wisely decided to stay back there. The End","sourceLink":"http://novel.tingroom.com/jingdian/1676/49420.html","bookId":1176,"book":{"id":1176,"title":"Time And Again","description":"简介： This book is a work of fiction. Names, characters, places, and incidents either are products of the author\u0027s imagination or are used fictitiously. Any resemblance to actual events or locales or persons, living or dead, is entirely coincidental....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1676","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
