{"id":91755,"no":7,"title":"Page 7","content":"\"You have found perversion!\" Thobicus declared, and he clutched the crossbow tightly, thinking that his remark would send the angry monster hurtling toward him.\\n\\n Rufo stopped his spin and faced the dean. \"Call it what you will! But you cannot deny my power - power gained in mere hours. You have spent all of your life in wasted study, I say, praying to Deneir.\"\\n\\n Thobicus inadvertently glanced at his holy symbol, lying on the floor by the wall.\\n\\n \"Deneir,\" Rufo said derisively. \"What has your god given you? You toil for endless years, then Cadderly...\"\\n\\n Thobicus winced, and Rufo did not miss it.\\n\\n \"Then Cadderly,\" the vampire went on, seeing the weakness for what it was, \"reaches out and grasps at levels of power that will forever be beyond you!\"\\n\\n \"You lie!\" Thobicus roared, coming forward in his chair. His words sounded empty, even in his own ears.\\n\\n The office door swung open then, and both Thobicus and Rufo turned to see Bron Turman stride in. The Ogh-man priest looked from the dean to Rufo, his eyes going wide as he, too, recognized the vampire for what it was.\\n\\n Rufo hissed, showing bloody fangs, and waved his hand, his magic compelling the door to slam shut behind Turman.\\n\\n Bron Turman had no intention of running back out, in any case. With a determined snarl, the Oghman grabbed at a pendant and tore the chain from his neck, presenting the silver scroll replica before him. It flashed and radiated a powerful light, and to the surprise of Dean Thobicus, the vampire backed away, ducking under his robes and hissing.\\n\\n Turman recited words very similar to the ones Thobicus had used, and the holy symbol flared even more, filled the room with a glow that Rufo could not bear. The vampire fell back against the wall, started for the window, then realized that he could not go out there, under the light of the infernal sun.\\n\\n Turman had him, Thobicus realized, and Rufo seemed very weak to him then, even pitiful. Without even realizing it, Thobicus had the crossbow atop the desk.\\n\\n Rufo began to fight back, was struggling to stand straight. A blackness rolled out from his form, filling that section of the room.\\n\\n Bron Turman growled and thrust his symbol forward, its flare attacking the vampire\u0027s darkness. Rufo hissed wickedly as he clenched his bony fists in the air.\\n\\n \"Shoot him!\" Bron Turman implored Thobicus.\\n\\n The struggle between the two was a standoff that a crossbow quarrel would break.\\n\\n Thobicus took up the weapon and leveled it. He meant to pull the trigger, but hesitated as a wall of doubts came up before him. Why hadn\u0027t his presented symbol so affected the vampire? he wondered. Had Deneir deserted him, or was Cadderly somehow continuing to block his efforts to bask in the light of his god?\\n\\n Mountains of doubt rolled across the dean\u0027s thoughts, black thoughts made blacker by the continuing subtle intrusions of the vampire\u0027s will. Rufo was still there, compelling, prompting doubts.\\n\\n Where was Deneir? The thought haunted the withered dean. In his moment of greatest need, his god had not been there. In the one instant of his life when he had consciously called on Deneir, when he had absolutely needed Deneir, the god had deserted him!\\n\\n And there stood Bron Turman, straight and confident, holding the vampire at bay with the power of Oghma in his strong hand.\\n\\n Thobicus snarled and hoisted the crossbow. Evil Rufo was standing tall in his new power, standing against a man who would have easily defeated him when he had been just a disciple of Deneir, though Rufo had spent years of study.\\n\\n Now, after three days of death, Rufo could match the Oghman.\\n\\n Thobicus shook his head, trying to clear the mounting confusion. He pushed through one web of lies, only to find another, and to find the one he had left closing fast behind him.\\n\\n Where was Deneir? Why was Cadderly so damned powerful? Where was justice, the rewards of his own long years of study? So many years ...\\n\\n Thobicus came back to the present situation, focusing his thoughts, steadying his trembling hands, and training his eye. His shot was perfect.\\n\\n Bron Turman jerked from the impact and looked over at the desk in disbelief. The Oghman\u0027s grip soon weakened, and Rufo stepped forward and casually slapped the holy symbol from Turman\u0027s hand, then fell over him.\\n\\n A minute later, the vampire, his face bright with fresh blood, turned to the desk. \"What has Deneir ever given you?\" he asked the stunned Thobicus, the old dean standing zombielike, his wrinkled face frozen with disbelief as he stared at the dead Oghman.\\n\\n \"He deserted you,\" Rufo crooned, playing on the man\u0027s obvious doubts. \"Deneir has deserted you, but I will not! There is so much I can give you.\"\\n\\n Thobicus, in his stupor, realized that the vampire was next to him. Rufo continued to whisper assurances, promising power beyond belief and eternal life, promising salvation before death. Thobicus could not resist him. The withered dean felt a pinch as the vampire\u0027s fangs jabbed into his neck.\\n\\n He realized only then how very far he had fallen. He realized that Rufo had been in his mind, inciting the doubts, quietly compelling him to fire the crossbow at the powerful Oghman.\\n\\n And he had complied. Doubts swirled in the air all about the dean, but no longer were they centered on the faults of Deneir. Had Deneir really deserted Thobicus when he had tried to present the holy symbol against Rufo, or had Thobicus long ago deserted Deneir? Cadderly had dominated him, and had claimed that power to be the will of Deneir.\\n\\n And now Rufo ...\\n\\n Thobicus let the thought go, let the guilt go. So be it, he decided. He denied the consequences and washed in the promises of the vampire.\\n\\n So be it.\\n\\n Fall From Grace\\n\\n Fester Rumpol watched suspiciously. He didn\u0027t understand the change that had come over Dean Thobicus. The last time he had spoken with the dean, the man was preoccupied - no, obsessed - with the notion that Cadderly was coming back to the library to tear the heart out of the Deneirian order.\\n\\n Now Thobicus seemed almost jovial. He had secretly called together the four leading Deneirians, three of them headmasters, for what he termed \"a most vital conference.\"\\n\\n They were gathered in a small dining room adjacent to the main hall and kitchen, around an oaken table, bare except for huge, empty goblets set in front of the five chairs.\\n\\n \"Dear Banner,\" Thobicus chirped lightly, \"do go to the cellars and fetch a particular vintage, a special red bottle on the third rack.\"\\n\\n \"A bottle of red?\" Banner asked, crinkling his features. Banner favored white wines.\\n\\n \"A red bottle,\" Thobicus corrected. He turned to Rumpol and gave a wink. \"Magically preserved, you know. The only way to keep Feywine.\"\\n\\n \"Feywine?\" Rumpol and all the others asked together. Feywine was an elven drink, a mixture of honey and flowers and moonbeams, it was said. It was rare, even among the elves, and getting a bottle from them was nearly impossible.\\n\\n \"A gift from King Galladel when he ruled Shilmista,\" Thobicus explained. \"Do go and retrieve it.\"\\n\\n Banner looked to Rumpol, worried that the man was near an explosion. Indeed Rumpol was boiling. He feared that Thobicus had somehow learned of Cad-derly\u0027s demise, and if that was the occasion of this celebration, the dean was surely out of line!\\n\\n Banner waited a moment longer, then tentatively started to leave.\\n\\n \"Wait!\" Rumpol blurted, and all the others turned to regard him.\\n\\n \"Your mood has brightened, Dean Thobicus,\" Rumpol said. \"Dramatically. Might we learn what has so affected you?\"\\n\\n \"I found communion with Deneir this morning,\" Thobicus lied.\\n\\n \"Cadderly is dead,\" Rumpol reasoned, and the other three Deneirians immediately turned sour looks on the dean. Even the priests who despised Cadderly and his unconventional climb through the ranks would not celebrate such a tragedy - at least not publicly.\\n\\n Thobicus put on an expression of horror. \"He is not,\" he replied vehemently. \"From all that I know, the fine young priest is even now on his way back to the library.\"\\n\\n Fine young priest? Coming from Dean Thobicus, those words rang hoDow indeed to Fester Rumpol.\\n\\n Then why are we celebrating?\" Banner asked bluntly.\\n\\n Thobicus gave a great sigh, \"I had hoped we might toast the occasion with the Feywine,\" he groaned. \"But very well, I sympathize with your impatience. Simply put, there will be no second Time of Troubles.\"\\n\\n That brought sighs of relief and private murmurs from the group.\\n\\n \"And I have learned much of Cadderly as well,\" Tfeobi-cus went on. \"The order will survive - indeed, it will be strengthened when he returns, when he and I work together to improve the ways of the library.\"\\n\\n \"You hate each other,\" Rumpol remarked, and looked around somewhat nervously. He hadn\u0027t meant to openly voice that opinion.\\n\\n Thobicus, however, merely chuckled and seemed to take no offense. \"With Deneir as moderator, our differences seem petty indeed,\" the dean replied.\\n\\n He looked around, his bright smile infectious. \"And so we have much to celebrate!\" he proclaimed, and nodded to Banner, who rushed off with sincere enthusiasm for the doorway to the wine cellar.\\n\\n The conversation continued, lighthearted and hopeful, with Thobicus paying particular attention to Rumpol, the man he deemed to be potentially the most troublesome. Twenty minutes later, Banner still had not returned.\\n\\n \"He cannot find the bottle,\" Thobicus remarked to quiet any trepidation. \"Dear Banner. He probably dropped his torch and is stumbling around in the dark.\"\\n\\n \"Banner has the power to summon light,\" Rumpol said, an edge of suspicion still in his voice.\\n\\n \"Then where is he?\" Thobicus asked. The bottle is colorful, and should be easy enough to find on the fifth rack.\"\\n\\n \"You said the third rack,\" one of the others quickly put in.\\n\\n Thobicus stared at him, then scratched his head. \"Did I?\" he whispered, then he dramatically dropped his face into his hand. \"Of course,\" he mused. The Feywine was in the third rack until the .. . incident.\" All the others knew that the dean was referring to the dark time of the chaos curse, the time when the evil priest Barjin had invaded the library and sought to destroy the place from within.\\n\\n \"There was quite a bit of trouble down in that cellar,\" Thobicus went on. \"If I remember correctly, several of the affected priests even went down there and drank to ... shall we say, excess.\"\\n\\n Rumpol turned away, for he had been one of those hearty drinkers.\\n\\n \"Fortunately, the Feywine survived, but I do recall that it was moved to the fifth rack, that being the most stable,\" Thobicus finished. He motioned to one of the others. \"Do go and help out dear Banner,\" he bade, \"before the man comes back here raising Cyric himself against me!\"\\n\\n The priest ran off for the door, and the conversation resumed, again without much concern. Fifteen minutes later, it was Rumpol who remarked that the two wine hunters were long overdue.\\n\\n \"If one of the lesser priests stole that bottle, my good mood will vanish,\" Thobicus warned.\\n\\n There was an inventory of the wine cellar,\" Rumpol said.\\n\\n \"A list I saw, though I do not recall any record of Feywine,\" added the other, and he gave a jovial laugh. \"And I would have noted the presence of such a treasure well, I assure you!\"\\n\\n \"Of course the bottle was mislabeled,\" Thobicus explained, then he nodded, as if something that should have been obvious had just come to him. \"If dear Banner decided to test the wine before he returned, then likely we will find our two missing brothers sitting in a stupor in the cellar!\" the dean roared. \"Feywine, in its own sub-tie way, bites harder than dwarven ale!\"\\n\\n He rose to leave, and the other two were quick to join him. Their mood was light, any fears or suspicions quenched by the logical assumption offered by the dean. They got to the wine cellar door, and Thobicus took up and Ut one of the small lamps set in a cabinet to one side, then led the way down the wooden staircase, into the darkness.\\n\\n They heard no chatter, no drunken conversation, and grew a bit concerned when they saw that their lantern was apparently the only source of light in the damp, shadowy cellar.\\n\\n \"Banner?\" Rumpol called softly. Thobicus stood by silently; the remaining priest began a quiet chant, thinking to bring a great magical light into the area.\\n\\n That priest jerked suddenly, drawing the attention of his two companions.\\n\\n \"I fear a spider has bitten me,\" he remarked to Rum-pol\u0027s questioning expression, and he began to jerk spasmodically, his eyes twitching, then rolling back into his head.\\n\\n He fell facedown to the floor before Rumpol could get to him.\\n\\n \"What is this?\" Rumpol cried, cradling the fallen priest\u0027s head. He began a frantic chant, beginning a spell that could counter any poison.\\n\\n \"Rumpol,\" Thobicus called, and though the priest did not interrupt his frantic spellcasting, he did look back to regard the dean.\\n\\n His words fell away as he looked upon Kierkan Rufo, the vampire\u0027s face bright with fresh blood.\\n\\n The vampire extended one pale hand toward Rumpol. \"Come to me,\" he bade.\\n\\n Rumpol felt the wave of compelling willpower roll over him. He rested the fallen priest\u0027s head back against the floor and rose without even being conscious of the movements,\\n\\n \"Come to me,\" the vampire said tan tali zingly. \"Join me, as has your dean. Come to me and see the truth.\"\\n\\n Rumpol was inadvertently sliding his feet along the smooth floor, drifting toward the darkness that was Kierkan Rufo. Somewhere in the back of his mind he caught the image of an open eye above a lit candle, the symbol of Deneirian light, and it shook him from his trance.\\n\\n \"No!\" he declared and pulled out his holy symbol, presenting it with all his heart against the undead monster. Rufo hissed and lifted his arm to shield himself from the spectacle. Dean Thobicus turned away in shame. The light from his lantern went with him as he walked around the next rack, but the light in the area near Rumpol did not diminish, bolstered by the power of his presented symbol, by the light that was in the sincere priest\u0027s heart.\\n\\n \"Fool!\" the vampire proclaimed. \"Do you think you can stand against me?\"\\n\\n Fester Rumpol wasn\u0027t shaken. He basked in the light of his god, used his sincere faith to blast away any horror-inspired doubts. \"I deny you!\" he proclaimed. \"And by the power of Deneir...\"\\n\\n He stopped suddenly and nearly swooned. He glanced around to his back to see the dog-faced imp staring at him, waving its barbed, poison-tipped tail - the same tail that had dropped the other priest, and that Druzil had just poked into Rumpol\u0027s kidney.\\n\\n Rumpol staggered for the stairway, stumbled to his knees as Druzil struck him a second time. Then he was up again, but the world was slipping away into blackness. The last image he saw was that of Kierkan Rufo, of Kierkan Rufo\u0027s fangs rushing for his throat.\\n\\n When he was finished, the vampire found Thobicus standing by the fifth rack. There lay the priest Thobicus had sent after Banner, his chest torn apart, his heart on the floor beside him. Banner, though, surprisingly, was sitting against the rack, his head down, but very much alive.\\n\\n \"He heeded my call,\" Rufo casually explained to the confused dean. \"And so I thought to keep him, for he is weak.\" Rufo presented a perfectly awful bloody smile to the dean. \"Uke you.\"\\n\\n Dean Thobicus had not the strength to argue. He looked to the torn priest, and to living Banner, and he pitied Banner the most\\n\\n A few hours later, Druzil hopped and skipped into short flights about the library\u0027s hot attic, clapping his hands happily at every turn. The air was warm, he was at work in desecrating a holy place, and beneath him, Rufo, with the help of Dean Thobicus, continued dividing the priests into small groups and was summarily destroying them.\\n\\n Life was suddenly very good for the malicious imp. Druzil flapped his wings and lifted himself up to one of the short peaks in the roof, so that he could survey his latest design. The imp knew all the runes of desecration and had just completed his favorite in the area directly over the library\u0027s main chapel (though that chapel was two floors down). Thobicus had provided a virtually unlimited supply of ink - reds, blues, blacks, and even a vial of a strange greenish-yellow (which Druzil favored) - and the imp knew that every stroke he ran across the floorboards put the foolish priests in the rooms below a bit farther from their respective gods.\\n\\n At one point, Druzil paused, then moved away from the spot with an angry hiss. Someone was singing in a room below him - that wretched Chaunticleer, Druzil realized. Chaunticleer was singing to Deneir and to Oghma, lifting his voice against the encroaching blackness in notes pure and sweet.\\n\\n It wounded Druzil\u0027s ears. He moved away from the spot, and the vibrations of Chaunticleer\u0027s voice were no more. With all that was happening in his favor, Druzil quickly forgot about the singing priest.\\n\\n Happy again, Druzil clapped his hands rapidly, his toothy smile nearly swallowing his ears. When Rufo had come for him in the mausoleum the previous night, he hadn\u0027t known what to expect, had even considered using all of his magical abilities and knowledge to try to open a gate, that he might retreat to the lower planes, abandoning Rufo and Tuanta Quiro Miancay altogether.\\n\\n Now, just half a day later, Druzil was thrilled that he had not chosen that course. Barjin had failed, but Rufo would not, the imp knew.\\n\\n The Edificant Library would fall. \\n\\n","sourceLink":"https://allnovel.net/the-cleric-quintet-the-chaos-curse-the-cleric-quintet-5/page-7.html","bookId":2111,"book":{"id":2111,"title":"The Cleric Quintet: The Chaos Curse (The Cleric Quintet #5)","description":"Storyline: The prequel series to The Ghost King comes to an explosive end! Cadderly journeys home to the Edificant Library, hoping to rebuild his shattered life - but the chaos curse has one last surprise in store for him. Failure means the loss of his beloved Danica, success might usher in a new era for the followers of Denier.\\n","cover":"https://allnovel.net/images/the-cleric-quintet-the-chaos-curse-the-cleric-quintet-5.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-cleric-quintet-the-chaos-curse-the-cleric-quintet-5.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:52:49 PM"}}
