{"id":71815,"no":21,"title":"Page 21","content":"Focus on the here and now. “I never doubted that Ellen loved our daughter. But from the time we brought Sierra home from the hospital, I saw Ellen had no desire to learn to be a parent. If she couldn’t deal with Sierra, she hired a babysitter or called my mom and went shopping. Then Ellen started screwing around on me. By the time Sierra was five, I’d had enough of the bullshit and lies and divorced her.” “So how was sex after you got married and after Sierra was born?” Gavin shrugged. “Ellen claimed exhaustion a lot, which I forgave because I was tired too, so we were having quick, no-frills sex about once a month. Then it tapered off to once every two months and then the last year, no sex at all.” Ben cocked his head. “Did it ever occur to you to cheat?” “No. Any sexual urges I satisfied with my hand. And it wasn’t like the ladies were propositioning me anyway.” “So you haven’t had sex since you were with your ex?” “I slept with a woman at a weekend conference a few years after the divorce. Then after my mom died, there was a friend I ended up with for a few months, but she stopped calling. Now I look back and I wonder if it was because the sex sucked.” Ben held up his hand. “First off, the past is the past. None of that matters. Is there someone specific you’re lookin’ at around here that you wanna impress with your sexpertise?” “Rielle.” “You’re with her? Or you want to get with her?” “We’ve been together.” That caught Ben by surprise. “How long’s it been goin’ on?” Gavin blushed and felt like an idiot for it. “After I moved here, things started out slow, us talking and hanging out. Then we found an excuse to touch each other. Then we were making out like crazy whenever we were alone. And the night before last…we had sex. It happened so damn fast. Too fast.” “Did Rielle complain?” He groaned. “No, but she’s been avoiding me, probably because it lasted like a minute.” “You afraid she was disappointed?” “Yeah.” “Were you disappointed?” “God no. It was intense and spontaneous. I’ve never acted that aggressive with a woman. I fucked her up against the damn wall. Outside. On the balcony.” “And Rielle gave you the go ahead?” Gavin’s eyes cut to Ben. “Completely consensual.” Ben chuckled. “Here’s the truth. Women love that shit. You getting her turned on and then fucking her hard and fast right where she stands. I’ll bet Rielle was just shocked because you acted that way and she hasn’t seen you in that role.” “It gets worse. I got put back into the ‘Dad’ role because Sierra came in right after the spectacularly fast finish.” Ben’s eyebrows rose. “Sierra caught you?” He shook his head. “We were on the balcony outside of my room and it was dark.” “Wait. Was this the night of the McKay party?” “Yep.” “So that’s where you were. I gotta say, bro. I’m impressed. Getting some with all the family around.” The horses were getting restless. Ben urged his horse into a walk and Duchess followed. Gavin tried to focus on the scenery; the crisp air and the shadows skittering across the ground as clouds clustered and broke apart overhead. Rielle would be outside, doing ten thousand things at once. “Thanks for bringing me out here, Ben. This is gorgeous country.” “Have you explored much of the land you bought from Rielle?” “No. Ree says the terrain is rugged and I needed a horse on the unbroken trails rather than an ATV.” “She has a point. But I’ll also remind you it’s your land. The Wetzlers were always weird about letting people onto that section. It’s yours now. You can do whatever the fuck you want with it. If you wanna clear all the damn trees and make a trail for four-wheelers, do it. If you’re nervous about setting off alone, just call me. I’d be happy for the chance to get a look around.” “I’ll think on it and let you know.” “Fair enough. Let’s head back.” They turned the horses around. “Bet you’re waiting for my advice,” Ben said after a bit. “Do you have some?” “Yep. Fake it ’til you make it. Next time you’re with Rielle…act like you’ve got the hot sex moves and she’ll believe you’ve got them. You will too.” “You think that’ll work?” He grinned. “It already did once, didn’t it? You have the woman so flustered about you going all caveman on her ass that she’s hiding from you. That ain’t the Rielle I know, trust me.” “I guess that makes sense.” Maybe. Hopefully. Fuck. How was he supposed to know? “That wasn’t very convincing.” Ben pushed up his hat a notch. “Tell me what your other option is?” Gavin blinked. “For the love of God, please don’t tell me you planned to confess your lack of sexual experience, hoping she’d understand and you could discuss what to do about it.” When Gavin didn’t respond, but must’ve looked guilty, Ben said, “Jesus, I can’t fuckin’ believe you were actually considering that! Screw that. You need to fuck it out, not talk it out.” “So I shouldn’t talk to her at all?” Gavin said skeptically. Ben muttered something. Then he sighed. “Talking is important, especially in the type of sexual activities I prefer. But in your case? Save the talking for after. First, act like you’re gonna rock her world in bed and then follow through with it. Besides, it’s not like women come with an instruction manual.” No way could Gavin confess he’d bought the book Amazing Sex for Dummies. And How To Go Down On A Woman. And Sex Secrets from Porn Stars. And Making Love 101. Ben would laugh his ass off. “Come on, bro, you’ve got a guilty damn look on your face. Tell me what you’re thinking.” “I’ve lived my life by honesty is the best policy, Ben. This feels dishonest.” “But it’s not like you’re lyin’ to her.” He brooded for a moment. “Lemme ask you this; how do you feel when you see Rielle?” “Like stripping her bare and taking her right that second. Christ. All she has to do is walk past me and I’m hard. I think about her constantly. Fantasize about all the things I wanna do to her.” “Make those thoughts reality. Let your lust for her be your guide. Women want spontaneity. They want the sole focus to be what the two of you are doin’ to each other right at that moment. The rest is just mechanics.” He held up a gloved hand. “With the exception of BDSM. That takes some skill if you wanna go that direction. Even if it’s not, it’s fun to dabble.” Dabble in tying Rielle up and spanking her ass? Yeah, that might be out of her comfort zone. Or…out of his. “And if you’re lookin’ for inspiration or ideas or whatever, watch porn.” “I can just see Sierra walking in when I’m taking notes on different positions.” He sighed. “Am I just kidding myself that this will work even if I do figure out how to rock Rielle’s world? Do I smuggle Rielle into my room? Or sneak into hers? And doesn’t it make me a hypocrite to tell Sierra to wait to have sex when I plan to fuck Rielle nine ways ’til Sunday?” “Maybe it makes me a dick, but I’ll point out that you deserve to have an adult relationship. You’re forty-three. Sierra is sixteen. Different expectations, bud. Should Sierra find you and Rielle fucking on the countertop? Nope. Does that mean you and Rielle shouldn’t fuck on the countertop? Nope. It’s all about timing. Including when you and Rielle decide to tell Sierra that the two of you are romantically involved.” “That’d be another first.” “I suspect it’d be a first for Ree too. But if you’re intimate with her, at least give her the courtesy of owning up to it. Don’t treat her or what the two of you are doin’ behind closed doors as a dirty secret.” Gavin considered that and nodded. “Anything else?” Ben asked. “No. Thanks. I really appreciate your advice.” “Happy to help.” He adjusted his seat on the saddle and his ornery horse decided to take advantage of the slack in the reins. Gavin pulled Duchess to a stop with a firm tug and a sharp warning. “That’s it,” Ben encouraged. “If she gets it in her head to lead, you show her who’s boss right quick.” Again, Gavin understood his brother wasn’t just referring to horses. Chapter Fifteen Needing fortification, courage, balls—whatever, Rielle tossed back half the lemon-drop martini. “I need some advice.” “I hope it’s not medical advice, because Doctor Monroe is not in tonight,” Joely said. “It’s personal. And slightly embarrassing.” “Embarrassing? Interesting.” Joely sipped from her martini glass, shrewd eyes focused completely on Rielle. “Spill it.” She blurted out, “I had sex with Gavin Daniels.” “Girlfriend, are you serious?” Joely grinned and lifted her glass for a toast. “That is awesome!” “Except it wasn’t.” “It wasn’t awesome? Explain that. In detail.” Her cheeks flamed. “Long story short. Thursday night Gavin had a party for the McKays. I freaked out and hid in my former bedroom. Gavin found me and tried to calm me down. So we’re out on the balcony and he’s touching me and the next thing I know, he hoisted me against the wall and fucked me.” “And this is bad…how?” Rielle angled across the table. “It was fast.” “For you? Or him?”","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-21.html","bookId":2695,"book":{"id":2695,"title":"Gone Country (Rough Riders #14)","description":"Storyline: Gone Country (Rough Riders #14) She’s a little bit country, and he’s…not. Arizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. Rielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B\u0026B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. Sharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. Warning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong","cover":"https://allnovel.net/images/gone-country-rough-riders-14.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/gone-country-rough-riders-14.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:20:55 AM"}}
