{"id":71835,"no":41,"title":"Page 41","content":"“Do I get your number? So I can check to see that you’re home safe?” That didn’t sound skanky and desperate, did it?\\n\\n “I don’t know…” He tapped his finger on his lips as if giving the matter great thought. “I don’t usually give it out. But I suppose I could make an exception to the person who saved my life.” He rattled off the number.\\n\\n She added him to her contact list. “Why don’t you give it out?”\\n\\n “Because I’m not interested in dating, remember? But I’m pretty sure you won’t be calling me up to ask me out.”\\n\\n “How do you know?”\\n\\n Boone’s face turned somber. He reached out and tucked a strand of hair behind her ear. “You don’t want to date me, beautiful girl. Trust me on that.”\\n\\n Sierra couldn’t move. She couldn’t speak. She barely breathed.\\n\\n “Besides. We’re friends. Now that we know each other’s secrets, maybe I’ll swing by some Friday night and we can do each other’s hair.”\\n\\n She found her voice. “With the hat hair you’re sporting? No way, dude.”\\n\\n “You crack me up.” He slipped on his hat and gloves.\\n\\n “Promise you’ll call me when you get home. Or text me. Something that lets me know you’re safe.”\\n\\n “I will. See ya around, McKay.”\\n\\n She wanted to stand on the porch and watch him take off, but remained inside by the door, listening for the sound of a motorcycle starting. She heard a high pitched whine and then the sound faded.\\n\\n Chapter Twenty-Three\\n\\n December…\\n\\n The week after Thanksgiving Sierra entered Gavin’s office, phone to her ear, stopping in front of his desk. “No, Mom. I don’t get to decide that. It’s between you and Dad. Hang on, he’s right here.” She handed him her phone. “You need to talk to her now.”\\n\\n Gavin’s entire body tensed. “Fine. But stick around.” Then he steeled himself for the conversation. “Hey, Ellen. What’s up?”\\n\\n “After speaking with our daughter? My blood pressure, merci.”\\n\\n Christ. Now she casually sprinkled French words into conversation? She was probably wearing a damn beret. “I don’t know what’s going on, so why don’t you fill me in?”\\n\\n “I asked Sierra to come to Paris for her Christmas break and she didn’t seem very excited. That hurts because I haven’t seen my only child since June. So have you spent the last few months turning my daughter against me, Gavin?”\\n\\n Stay calm. “Not at all. You have to admit the come to Paris for the holidays invitation is a little out of left field.”\\n\\n “But not out of line,” she retorted. “The court awarded you full custody, but I do have the legal right to request holidays.”\\n\\n “I realize that.”\\n\\n “Then you also realize you’ve had her for every holiday this year? And her birthday?”\\n\\n “You’ve had her for Christmas the last five years! I only get her for one day on Thanksgiving, and then you pick her up at the crack of dawn to go shopping the next day. This is the first year I haven’t had to share her on her birthday since she was five years old.” He felt Sierra staring at him and his face heated. Dammit. He’d sworn he wouldn’t do this in front of her.\\n\\n “Fine. Whatever. But consider this my unofficial request. I want Sierra to spend Christmas with me. In Paris.”\\n\\n “You really expect me to put our sixteen-year-old daughter on a ten-hour flight to France…by herself?”\\n\\n Sierra leapt up and leaned across the desk, her eyes beseeching. “No. Don’t let her guilt you into it, Dad.”\\n\\n “She’s not a baby. She’s flown more times than most kids her age. Don’t you remember she flew to New York by herself when she was twelve?”\\n\\n “She wasn’t by herself. That was a school-sponsored event with adult chaperones, so there’s no correlation to this situation.”\\n\\n “I suppose we could take this issue to our attorneys.” Ellen sighed. “Or we could save the legal fees and you could fly to Paris with her, and back to the U.S., since you’re so concerned about her safety.”\\n\\n “Really? What would I do in Paris for a week?”\\n\\n “It’s the most romantic city in the world, I’m sure you could come up with something.” She trilled that mean, annoying laugh. “Oh right, for a second I forgot who I was talking to. Gavin Daniels—the man without a romantic bone in his body.”\\n\\n Don’t take the bait.\\n\\n When he didn’t respond, she blithely continued on, “Besides, it’s not like you can’t afford it.”\\n\\n “Not the point, Ellen.”\\n\\n “And Sierra’s break is two weeks, not one week, so I’d expect her here for the entire time. Plus the travel days. I intend to show her more of Europe than just France.”\\n\\n “Ask her where her boyfriend will be,” Sierra demanded. “And if he knows I’m her daughter and not her sister.”\\n\\n What the fuck? When had that happened? Why hadn’t Sierra told him?\\n\\n “What’s Sierra saying?” Ellen demanded. “Has she changed her mind? Tell her we’ll have a wonderful time together.”\\n\\n Ellen spoke so loudly Sierra had heard every word.\\n\\n This back and forth bullshit hurt his ears and his head. Nothing would be resolved today anyway. “Look, Ellen, let me talk it over with Sierra and we’ll figure something out. I’ll get back to you as soon as I can, all right?”\\n\\n A long pause. “All right. She’s my daughter too, Gavin. And don’t think for a second I don’t miss her, because I do.” She hung up.\\n\\n Fuck. He wished he could just be pissed off at Ellen for being unreasonable, but she had a point. This was the longest she’d been away from Sierra. Granted, it’d been Ellen’s choice, but he felt he should at least try to find a way for them to spend time together.\\n\\n He handed Sierra’s phone back.\\n\\n “Please, Dad, don’t make me go.”\\n\\n “Sierra, sweetheart—”\\n\\n “I can’t believe you’re even considering this!”\\n\\n I can’t either.\\n\\n “You won’t let me drive into Sundance by myself but you’d send me halfway across the world by myself? That makes no sense.”\\n\\n “She’s your mother. She has a right to see you.” Gavin glanced up to see that I’ll argue this to death stubborn set to his daughter’s chin so he tried a different approach. “She misses you. And I know you miss her too. So think about that before you say or do something rash.”\\n\\n Sierra made an exasperated sound and stormed out.\\n\\n He turned to the window and opened the shade. The sunshine reflecting off the snow made everything blindingly white. From this distance the pristine view looked like an old-fashioned scene from a vintage postcard.\\n\\n Maybe it was silly and sentimental, but he’d been looking forward to their first Christmas in Wyoming. The snow covered pine trees and the chilly air made everything more festive. Add in all the upcoming McKay family parties and for once he wasn’t dreading the holidays.\\n\\n Sierra had spent the last five Christmases with Ellen, leaving him to face the day alone. After his mother died the pity invites for Christmas dinner tended to piss him off—to the point he morphed into Scrooge the week before to stave off said invites.\\n\\n He’d never been that big on holidays anyway, not even when his parents were alive, save for the few times he had Sierra all to himself on Christmas morning. Seeing her eyes light up when she saw her gift from Santa and the piles of presents from him. The two of them lazing around all morning in their pajamas, playing with her new toys and eating Christmas candy for breakfast.\\n\\n Eventually they’d get ready for Christmas dinner at his parents’ house. Sierra dolled up in a fancy holiday dress—the more taffeta, lace and velvet the better, with matching shoes and hair ribbons.\\n\\n Gavin remembered combing the tangles from her snarled hair and her explicit instructions on where to place the barrettes, headband or ponytail holder. Her instructions had amused him, because he’d been putting her hair in a ponytail or pigtails since she’d turned two.\\n\\n Now she was sixteen. Sometimes he wondered how that’d happened so fast, her change from a sleepy-eyed toddler dragging her favorite Tigger blanket, to the eye-rolling teen with her hand out for the car keys.\\n\\n Arms snaked around his waist. Body heat and his lover’s sweet honeysuckle scent surrounded him. Rielle placed a kiss between his shoulder blades.\\n\\n “You okay?” she asked. “I heard Sierra’s door slam.”\\n\\n “Yeah. Just lost in thought.”\\n\\n “I know. I called your name but you didn’t answer.”\\n\\n He turned around and held her face in his hands, kissing her deeply. When he eased back, she wore the secret smile that was an instant aphrodisiac. He seriously considered sweeping everything off his desk and taking her right there.\\n\\n “I recognize that look in your eye, tycoon. But I’m afraid I’ll have to take a raincheck, since there are four loaves of cranberry orange hazelnut bread and eggnog spiced pumpkin bread baking in the oven that will require my attention shortly.”\\n\\n “Mmm. Hot bread sounds almost as good as hot sex.” He kissed her again, with a little more zeal, letting his hands wander to fondle her breasts. When Rielle emitted that sexy squeak, he grinned at her. “Sorry. Just a self-reminder that nothing compares to sex with you.”\\n\\n “You are tempting me to just let the damn bread burn.”\\n\\n He had a brilliant idea. “Ree. What are you doing for Christmas?”\\n\\n Her eyes narrowed at the abrupt subject change. “Same thing we do every year. Put up a tree, bake and eat until my jeans are too tight and hang out by the fireplace with Rory, chugging hot chocolate or wine…depending on the day. Why?”\\n\\n “How would you like to go to Paris with me for Christmas?”\\n\\n Rielle’s jaw dropped. “What? Paris? As in Paris, France?” \\n\\n","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-41.html","bookId":2695,"book":{"id":2695,"title":"Gone Country (Rough Riders #14)","description":"Storyline: Gone Country (Rough Riders #14) \\n She’s a little bit country, and he’s…not. \\n Arizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. \\n Rielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B\u0026B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. \\n Sharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. \\n Warning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong\\n","cover":"https://allnovel.net/images/gone-country-rough-riders-14.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/gone-country-rough-riders-14.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:20:55 AM"}}
