{"id":71838,"no":44,"title":"Page 44","content":"“True.” Rielle looked at him thoughtfully. “What else?” “I want you to come to Arizona with me. Not for the full two weeks, but just a week. Rory will only be here for a few days over the holiday, so it’s not like you’d have to sacrifice time with her to be with me.” “I want to point out that this is me listening to you, not immediately saying no.” “She can be taught.” He grinned. “Ellen has made it clear that her time with Sierra does not include me. I need to go to Phoenix, not only to make sure Ellen actually shows up, but to handle year-end business. I own a piece of property we can stay in, meaning no hotel costs. I have a company car to use, meaning no rental car costs. So the only upfront, out-of-pocket expense is the airfare.” Rielle broke eye contact and sipped her drink. “I’d prefer to pay your way, since this is my idea, but I know how…independent you are, so I’d agree to you buying your own plane ticket.” “If I let you pay for everything else.” “Yes. But what’s left to pay for? Food? Gas? Sex toys?” She laughed. “Such a naughty side to you.” Gavin curled his hands around her face, forcing her to look at him. “Please. Say yes. I want this time with you.” Indecision warred on her face. She closed her eyes and inhaled a long, deep slow breath. Then she opened her eyes. “Okay. Yes. I’ll come to Arizona with you.” He kissed her, a little too enthusiastically because his dick immediately got onboard. But he couldn’t help it. He was as excited as a kid on Christmas morning. “I can’t believe I’m actually getting on an airplane.” “I’ll hold your hand the entire time. I promise.” Gavin brushed his mouth over hers. “Thank you, Ree. You have no idea what this means to me.” “I’m starting to understand that,” she murmured. Then she pulled on his wrists until he released her. “Do you smell something burning?” Gavin bailed off the stool and checked the pan. The potato pieces on the bottom had built a dark crust, but it wasn’t ruined, thank God, because he’d never hear the end of it. Sierra wandered in and wrinkled her nose. “Dad, are you burning supper?” “No.” Her gaze moved between him and Rielle. “So what’s going on?” “Ree and I were just discussing the Arizona trip.” “You’re not yelling at each other so I assume everything is worked out?” “Yes. Rielle is coming with us.” Sierra grinned. “That’s awesome. Two whole weeks in the desert?” He shook his head. “Just one week. You’ll fly back the following week. No way to get around you missing a couple of days of school.” “Darn.” She paused. “Wait. You’re letting me fly back from Phoenix by myself?” “It’s a direct flight.” She pumped her fist. “Now I can put that fake ID to good use and get snockered on the plane.” Rielle laughed. “Snockered? Since when do teens use that term for being drunk?” “Since my dad doesn’t like the term shitfaced.” “What word would he prefer?” Rielle asked. “Illegal underage drinking,” he and Sierra finished simultaneously. Sierra snagged the barstool next to Rielle and sifted through the pile of catalogues. “Cool. Are you choosing things for your Christmas wish list?” “I don’t have a Christmas wish list.” Sierra gasped dramatically. “Seriously? Why not?” Rielle shrugged. “It’s only been Rory and me, except for when my parents were alive but they didn’t celebrate Christmas, so there’s been no need for a list. I knew what Rory wanted and I was happy with whatever she gave me.” “Well, it’s different now, because we’re here. I’m giving you a gift so I’ll need ideas. And I know Dad will buy you something, so you’d better give him some guidelines or you’ll find a new pickup or something in the driveway on Christmas morning.” Rielle aimed a laser-sharp gaze at him. “You wouldn’t dare.” Gavin leaned across the counter and flashed his teeth at her. “Try me.” When her eyes widened he knew she’d remembered their earlier conversation. Oh, Little Miss I-Make-My-Own-Way wanted to argue. She’d point out that Christmas wasn’t about the presents, blah blah blah. Bull crap. This was the only time of year he could buy her anything he wanted and she’d have no choice but to suck it up and accept it with a smile. “Stop smirking at me, Gavin Daniels. I’ll make a damn list. But you get to pick one thing from it, understand?” “Of course. Sierra, sweetheart, why don’t you show Rielle how to make a wish list, since you’re an expert.” “You know it.” As he watched Rielle and Sierra laughing together, oohing and aahing over the catalogues Sierra had dragged over, he had a sense of rightness that he was exactly where he needed to be. Gavin finally understood why Christmas was referred to as the holiday season—parties, school and family events started at Thanksgiving and stretched through Christmas. Living in Arizona, with the temperatures in the seventies, wreaths, holiday decorations and twinkling lights hung from cacti, Santa sporting a pair of board shorts and fake Christmas trees, he’d never felt that holiday spirit for a day, let alone for an entire month. But in Wyoming, things were a lot different. First of all, every household in the McKay family had some type of holiday get together at their place. He didn’t feel like he’d missed out on longstanding family traditions when Quinn told him that most of these family holiday gatherings had just started in the last few years. So far he and Sierra had spent time with every one of his cousins and their wives and children. Cider and cookies at Cord and AJ’s, which was also a celebration of the birth of their daughter, Avery. All six of Cam and Domini’s kids put on a holiday play at their house, followed by a feast of Ukrainian treats, most of which were eaten by their rowdy brood. Since Carter and Macie lived out of town, they combined forces with Carolyn and Carson at their place for a cookie decorating party. Kade and Skylar opted to hold their shindig at the Sky Blue plant, along with Kane and Ginger, and Colt and India. While the adults gorged on appetizers, Keely spearheaded a Christmas ornament craft session for the kids. She’d enlisted Sierra’s help, and Gavin was delighted to see his daughter having fun with glitter, glue and pinecones and the ten billion McKay offspring. Brandt and Jessie, Tell and Georgia and Dalton hosted a Rocky Mountain oyster feed at the fire pit in Brandt and Jessie’s backyard. At Colby and Channing’s place, Colby hitched up the team of Morgans to a hay wagon. Carson, Cal and Charlie loaded up the kids for a redneck sleigh ride across snow covered pastures. Gavin wondered if Sierra would think it was lame and refuse to go, since she was the oldest kid by several years, but she’d surprised him once again. In fact, Charlie had told him that Sierra was the one who’d started the Christmas carol sing-along and handed out hot chocolate. Vi and Charlie assisted Quinn and Libby with their annual fruitcake throwing contest. Which was such a weird tradition Gavin had to ask Ben about it. Evidently the first year Quinn and Libby had Adam, Libby had tried out a new fruitcake recipe that was so bad Quinn wouldn’t eat it. They had a big fight and in a rare fit of anger, Libby had thrown the fruitcake at her husband. He’d taunted her, saying she had terrible aim, so she challenged him to see how far he could throw the dense fruitcake. The story spread through the McKay family and the following year everyone brought fruitcake and joined in the contest. Ben and Ainsley had an adults only cocktail party. No one was surprised that Keely volunteered her babysitting services for all the McKay offspring that night. But everyone was shocked when Jack announced her pregnancy. As much fun as Gavin had at the festivities the past few weeks, getting to know his family a little better, something was missing. Rielle. He’d invited her to the first McKay family event since everyone in the gossipy McKay family knew they were in a relationship. But Rielle had demurred. Her reasons were sound; she’d be an intrusion in Gavin and Sierra’s family time. It made sense, but he still missed her. Sometimes he felt theirs was a relationship borne out of their odd living arrangement. Rielle kept that dividing line in place, doing her own thing. She’d decorated her part of the house by herself. He and Sierra put up an enormous Christmas tree and added decorations from years past, plus new ones they’d found at the community bazaar. But other times, when he and Rielle were alone, there was no her space or his space, just their space. “Dad, come taste this,” Sierra yelled from the kitchen. Vi had come over to make candy with Sierra. His relationship with Vi had returned to how it’d been before their fight. But now Vi cleared every purchase and activity with him before she mentioned it to Sierra, which wasn’t a snarky way to poke at him, but it gave Vi an excuse to call him up and chat whenever she wanted. Strange that he didn’t mind. Upon entering the kitchen, he saw globs of brown on wax paper, a pan of peanut brittle and chocolate balls topped with fancy red and green icing. “What am I trying?” “Gram’s caramels. They’re the best thing ever.” Sierra held a square up to his lips. “Try it.” He opened his mouth. Buttery vanilla goodness melted on his tongue. “Okay. Wow. Those are incredible.” He shook his finger at Vi. “And you’re taking them all home because I will sit down in front of the game and eat the entire batch.” “I’ll save some for Christmas dinner.” She wiped a section of the counter. “You’re still planning on coming over?” “Of course. I wish you’d let us bring something.” Vi looked him in the eye. “Having you both there with us and the rest of our family is more than enough.”","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-44.html","bookId":2695,"book":{"id":2695,"title":"Gone Country (Rough Riders #14)","description":"Storyline: Gone Country (Rough Riders #14) She’s a little bit country, and he’s…not. Arizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. Rielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B\u0026B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. Sharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. Warning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong","cover":"https://allnovel.net/images/gone-country-rough-riders-14.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/gone-country-rough-riders-14.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:20:55 AM"}}
