{"id":71868,"no":74,"title":"Page 74","content":"\\n\\n “What am I supposed to do?”\\n\\n “Love her. But be ready to let her go. She’ll come back to you.”\\n\\n Gavin impulsively gave her a hug. “Thanks. You have no idea how much it means…how much I…” Just tell her. “You’ve been there for me every time I’ve needed you in the last year and you didn’t have to be.”\\n\\n Vi smiled. “I am a little persistent.”\\n\\n “I’m sorry I’ve been an ass to you. And I appreciate that you don’t let my shitty behavior slide. Christ, I’m a grown man who’s supposed to know better. Then I hear my mom’s voice in my head telling me to knock it off. I think the reason I’m so reserved with you is I’m constantly reminding myself that I can’t like you because it feels disloyal to my mother.”\\n\\n “I know you were close to her, Gavin, and I’m not looking to replace her. That’s never been my intent. She raised you to be a good man. That was all her doing. I’m grateful to her, because she loved you enough to send you back to us.”\\n\\n That choked him up a little.\\n\\n She sighed. “So where does this leave us now that we’ve had this overdue discussion?”\\n\\n “We can move on. The truth is I like you, Vi. A lot. I’m glad you’re in my life. Charlie too. So I’m, ah…working on the loving you part, okay?”\\n\\n “Okay. In the meantime I’ll love you enough for both of us.” She patted his cheek. “Let’s stop with this mushy stuff. Let’s go back to the house. I baked a pie in my new oven.”\\n\\n “Homemade crust?”\\n\\n She peered over the tops of her glasses. “Not on your life.”\\n\\n Gavin tracked Rielle to the garden. But she wasn’t on her hands and knees in the dirt. She rested her forearms across the top of the fence and stared at the recently planted alfalfa field across the road.\\n\\n He took a moment just to watch her, the beautiful, amazing woman he’d fallen in love with. He’d made his decision after talking to Vi, but being here, seeing her, just cemented it.\\n\\n Rielle finally noticed him. She smiled uncertainly. “Hey.”\\n\\n “Hey.” He walked to the fence. “I missed you.”\\n\\n “I’ve missed you too.”\\n\\n “Have you immersed yourself in dirt therapy?”\\n\\n “I’ve been trying to…but even that isn’t working. I’ve been wandering. Aimlessly.”\\n\\n “Is that why you seem lost in thought?”\\n\\n “Maybe I’m just feeling a little lost.”\\n\\n “Ree. Honey. I’ve always been a little lost…and then I found you.”\\n\\n Her gaze bored into his. “You’ve made a decision.”\\n\\n Gavin didn’t see a reason to drag it out. “Yes. I’m staying in Wyoming.”\\n\\n “Did you tell Sierra?”\\n\\n He shook his head. “I wanted you to know first. So you understand you’re my first choice. Not out of guilt or manipulation, but out of love. We have something I never thought I’d find and I’m not walking away from it. I’m not walking away from you.”\\n\\n She slapped her dusty gloves on his cheeks. “You’re serious? I…” She took a breath. “You should know I was out there wrestling with whether I could leave the only place I’ve ever known and move to Arizona. And the answer was yes.” She pressed her mouth to his so decisively he had to grin. “I would’ve gone to be with you. This chunk of dirt has mattered to me for so long, but it’s nothing compared to how much you matter to me.”\\n\\n “God, woman, you undo me.” He touched her dirt-smudged cheek. “However, since we’re agreed this is forever, you will marry me. You don’t have to take my name, you don’t have to be on my bank accounts, but I want you to be my wife. Mine. As soon as possible.”\\n\\n “Gavin.” She looked at him. “That was the shittiest proposal I’ve ever heard.”\\n\\n “Well, yeah, I’m not exactly Mr. Romance.” He looked at her shrewdly. “Is that what you want? Me on bended knee? Because I can—”\\n\\n “Stop. I’m good with that.”\\n\\n “Yeah?”\\n\\n “Oh yeah. And I have a demand as well.” She cocked her head. “I want my damn bedroom back. We can keep your big bed, but the rest of that ugly bachelor shit has got to go, since your bachelor days will be behind you.”\\n\\n “Consider it done.” He leaned closer to nuzzle her neck. “How about if we go inside and seal this marriage deal on that big bed.” He kissed behind her ear. “I missed you last night.”\\n\\n “Same here. As I laid alone in my room I kept thinking this would be my life if you weren’t in it. I never want that feeling again.”\\n\\n “Will you please put me out of my misery and leap over that fence so I can touch you?”\\n\\n Rielle climbed up the rails and threw her leg over.\\n\\n Gavin braced himself to catch her, but when she scaled over the top, she knocked him off balance and they both crashed to the ground with Rielle on top.\\n\\n She grinned at him and waggled her eyebrows. “Well, well, this is an interesting possibility.”\\n\\n “Wrong.” Gavin rolled, putting her beneath him. Just as he’d settled into a loving kiss, pounding footsteps came down the walkway.\\n\\n “Omigod. Seriously? You guys are doing it out here in the dirt practically on the front yard where anyone can drive by and see?”\\n\\n And…there was a verbal equivalent of a cold shower.\\n\\n He pushed up and helped Rielle to her feet.\\n\\n They faced Sierra together.\\n\\n Sierra’s eyes darted to Rielle and then back to him. “Dad, I know you said you didn’t want to talk to me and I should stay away from you until you made your decision, but can we ah…talk about some stuff? Alone?”\\n\\n “No. Whatever you want to talk about will affect Rielle.”\\n\\n “Okay.” Sierra shoved her hands in the front pockets of her shorts. “Sorry I’ve been a jerk.”\\n\\n He waited because that pseudo-apology wouldn’t fly and she knew it.\\n\\n “I was a total dick, okay? I said a bunch of horrible shit I didn’t mean. God, I’m so sorry and I don’t know why I keep doing that.”\\n\\n Because you’re sixteen.\\n\\n “I was hurt and mad and I took it out on you.”\\n\\n I keep hoping one of these days you’ll figure out that lashing out and hurting those you love doesn’t make you feel better. He’d done this over her teen years, not answering her questions out loud but in his head; it allowed him to speak his mind without saying a word.\\n\\n “I…some stuff happened that I didn’t know how to handle and I couldn’t think of anything besides I wanted to go home.” She kicked a rock. “I wanted my mom.”\\n\\n Gavin wondered why Sierra had such a hard time admitting it.\\n\\n Because sometimes you don’t curb your dislike of her mother and she picks up on that.\\n\\n She looked at Rielle. “I like you a lot, Ree. In fact, I love you more than a little. You’ve never tried to be my mom, but you’ve always been there for me. Even before you and my dad started being…whatever. So when I was hiding in my room, I wished I could talk to you, because you listen until I figure stuff out on my own. Then I realized how much I’d hurt you and that I wouldn’t blame you if you never wanted to talk to me again.” She sucked in a deep breath. “I’m sorry. Really, really sorry. I didn’t mean to make you cry.”\\n\\n “I know, sweetie.”\\n\\n Sierra was back to staring at the ground.\\n\\n “Sierra? Can you look at me please?”\\n\\n She shook her head.\\n\\n “Why not?”\\n\\n “Because I’m embarrassed,” came out softly.\\n\\n He wanted to go to her, and Rielle even relaxed her hold on him so he could, but he forced himself to let his daughter struggle a little. “Why?”\\n\\n “I was awful to you. Making demands. Being mouthy, hurting your feelings, not caring about anyone but myself. I’m sorry. So, so, sorry and I don’t know how I’ll ever…”\\n\\n When Sierra broke down completely, that’s when Gavin went to her. That’s when he pulled her into his arms and let her cry it out, holding her tightly. Listening to her babbling about acting stupid again.\\n\\n She calmed down but her arms were squeezed around him. “I love you, Dad. I’m sorry I was such a selfish, bratty kid.”\\n\\n He kissed the top of her head. “I love you too. Yes, you’re bratty and selfish sometimes, but not all the time, so I’ll keep you.” He felt Rielle’s hand on his arm, silently offering her support. He glanced at her, standing beside him, where she belonged.\\n\\n Sierra stepped back and wiped her face. “So, I’ve had time to think, and I still want to go to France.”\\n\\n Gavin’s heart broke, just a little. “All right. If that’s your choice, you should know—”\\n\\n “But just for part of the summer,” she said quickly. “Maybe six weeks. I do want to spend time with Mom.”\\n\\n “That’s a great idea. She’ll be thrilled to see you.”\\n\\n “But when I get back? Before school starts? I’d like to talk to you about some changes. See, Marin and I were talking about this stuff today after Rory chewed my butt—”\\n\\n “When did you talk to Rory?” Rielle asked.\\n\\n “This morning. We went to DQ and then up to Flat Top.”\\n\\n “Rory is here?”\\n\\n “Yeah. She’s in the kitchen. You didn’t know that?”\\n\\n Rielle shook her head. “What did she say?”\\n\\n “Basically she told me I was a whiny-ass spoiled baby and to knock it off and think of someone besides myself for a change.”\\n\\n Somehow Gavin kept his jaw from hitting the dirt.\\n\\n “When I talked to Marin she said the same thing; quit acting so childish and selfish.” Sierra snorted. “Which is kinda funny because she begged me not to move and that was selfish of her, but whatever.”\\n\\n Gavin had agonized over the decision for a solid day. He hadn’t slept or eaten…and all it’d taken to change Sierra’s mind were Rory and Marin telling her…to grow up and not act spoiled? \\n\\n","sourceLink":"https://allnovel.net/gone-country-rough-riders-14/page-74.html","bookId":2695,"book":{"id":2695,"title":"Gone Country (Rough Riders #14)","description":"Storyline: Gone Country (Rough Riders #14) \\n She’s a little bit country, and he’s…not. \\n Arizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. \\n Rielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B\u0026B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. \\n Sharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. \\n Warning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong\\n","cover":"https://allnovel.net/images/gone-country-rough-riders-14.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/gone-country-rough-riders-14.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:20:55 AM"}}
