{"id":41726,"no":15,"title":"CHAPTER XV. BRADLEY WENTWORTH’S MORNING MAIL.","content":"Bradley Wentworth lived in quite the most pretentious house in Seneca. It was within five minutes’ walk of the huge brick factory from which he drew his income. All that money could buy within reasonable limits was his. Handsome furniture, fine engravings, expensive paintings, a stately carriage and handsome horses, contributed to make life comfortable and desirable. But there is generally something to mar the happiness of the most favored. Mr. Wentworth had but one child—Victor—whom he looked upon as his successor and heir. He proposed to send him to college, partly to secure educational advantages, but partly also because he thought it would give him an opportunity to make friends in high social position. He had reached that age when a man begins to live for those who are to come after him. [117] But Victor unfortunately took different views of life from his father. He did not care much for a liberal education, and he selected his companions from among those who, like himself, enjoyed a good time. He was quite aware that his father was rich, and he thought himself justified in spending money freely. Victor was in attendance at the classical academy of Virgil McIntire, LL.D., an institute of high rank in the town of Ilium, about fifty miles from Seneca. He had been there about two years, having previously studied at home under a private tutor. Being a busy man his father had been able to visit the school but twice, and had but a vague idea as to the progress which his son was making. Five days after he returned home from Colorado he received a letter from Dr. McIntire, the material portion of which is subjoined: “I regret to say that your son Victor is not making as good use of his time and advantages as I could desire. I have hitherto given you some reason to hope that he would be prepared for admission to Yale College at the next summer examination, but I greatly fear now that he will not be ready. He is a boy of good parts, and with[118] moderate application he could satisfy you and myself in this respect; but he is idle and wastes his time, and seems more bent on enjoying himself than on making progress in his studies. I have spoken with him seriously, but I am afraid that my words have produced very little effect. It may be well for you to remonstrate with him, and try to induce him to take sensible views of life. At any rate, as I don’t want you to cherish hopes that are doomed to disappointment, I have deemed it my duty to lay before you the facts of the case. “Yours respectfully, “Virgil Mcintire.” Bradley Wentworth received and read this letter in bitterness of spirit. “Why will that boy thwart me?” he asked himself. “I have mapped out a useful and honorable career for him. I am ready to provide liberally for all his wants—to supply him with fine clothes as good, I dare say, as are worn by the Astors and Vanderbilts, and all I ask in return is, that he will study faithfully and prepare himself for admission to college next summer. I did not fare like him when I was a boy. I had no rich father to provide for my wants, but was compelled[119] to work for a living. How gladly would I have toiled had I been situated as he is! He is an ungrateful boy!” Bradley Wentworth was not altogether justified in his estimate of himself as a boy. He had been very much like Victor, except that he was harder and less amiable. He had worked, to be sure, but it was not altogether because he liked it, but principally because he knew that he must. He, like Victor, had exceeded his income, and it was in consequence of this that he had forged the check for which he had induced his fellow-clerk, Warren Lane, to own himself responsible. He forgot all this, however, and was disposed to judge his son harshly. By the same mail with Doctor McIntire’s letter came the following letter from Victor: “Dear Father:—I meant to write you last week but was too busy”—”Not with your studies, I’ll be bound,” interpolated his father—“besides there isn’t much to write about here. It is a fearfully slow place”—“You wouldn’t find it so if you spent your time in study,” reflected Mr. Wentworth—“I don’t enjoy Latin and Greek very much, I don’t see what good they are ever going to do a fellow. You never studied Latin[120] or Greek, and I am sure you have been very successful in life. I have an intimate friend here, Arthur Grigson, who is going to spend next year in traveling. He will go all over the United States to begin with, including the Pacific coast. I wish you would let me go with him. I am sure I would learn more in that way than I shall from the stuffy books I am studying here under that old mummy, Dr. McIntire. Arthur thinks he shall be ready to start in about six weeks. Please give your consent to my going with him by return of mail, so that I may begin to get ready. He thinks we can travel a year for two thousand dollars apiece. “Your affectionate son, “Victor.” Bradley Wentworth frowned ominously when he read this epistle. “What a cheerful sort of letter for a father to receive,” he said to himself, crushing the pages in his strong hands. “Victor has all the advantages that money can command, and a brilliant prospect for the future if he will only act in accordance with my wishes, and yet he is ready to start off at a tangent and roam round the world with some scapegrace companion. I wish he[121] were more like Lane’s boy—I don’t like him, for he is obstinate and headstrong, and utterly unreasonable in his demands upon me, but he is steady and correct in his habits, and if he were in Victor’s place would never give me any uneasiness.” Gerald would have been surprised if he had heard this tribute from the lips of his recent visitor, but he was not likely to know the real opinion of the man who had declared himself his enemy. Bradley Wentworth, continuing the examination of his letters, found another bearing the Ilium postmark. It was addressed in an almost illegible scrawl and appeared to be written by a person of defective education. It was to this effect: “Dear Sir:—Your son Victor, at least he says you are his father, and have plenty of money, has run up a bill of sixty-seven dollars for livery at my stable, and I think it is about time the bill was paid. I am a poor man and I can’t afford to lose so much money. I have already waited till I am tired, but your son’s promises ain’t worth much, and I am obliged to come to you for payment. “I shall take it as a favor if you will send me a check at once for the money, as I have some bills coming due next week. I don’t mind trusting your son if I am sure of my money in the end,[122] and if it isn’t convenient for you to pay right off, you can send me your note on thirty days, as I am sure a gentleman like you would pay it when due. “Yours respectfully, “Seth Kendall.” This letter made Mr. Wentworth very angry. It is hard to tell whether he was more angry with his son or with the proprietor of the livery stable. He answered the latter first. “Mr. Seth Kendall:—I have received your letter, and must express my surprise at your trusting my son, knowing well that he is a minor, and that I have not authorized his running up a bill with you. It would serve you right to withhold all payment, but I won’t go so far as that. Cut your demand in two, and send me a receipt in full for that sum, and I will forward you a check. I never give a note for so small an amount. Hereafter, if you are foolish enough to trust Victor, you must run your own risk, as I shall decline to pay any bill that may be presented. “Bradley Wentworth.” Mr. Wentworth next wrote to Victor a letter from which a paragraph is extracted: “I admire your audacity in asking me to let you[123] leave school and go around the world with some scapegrace companion. You say it will only cost two thousand dollars. That probably seems to you a very small sum of money. When I was several years older than yourself I was working for seventy-five dollars a month or nine hundred dollars a year. It is evident that you do not understand the value of money. You speak of me as a rich man, and I admit that you are correct in doing so, but I do not propose to have you make ducks and drakes of my money. “I may mention, by the way, that a livery stable keeper, who signs himself Seth Kendall, has sent me a bill run up by you for sixty-seven dollars. I have written him that I didn’t authorize your running up such a bill, and that he must be content with fifty per cent of it, or else go unpaid. Hereafter I forbid your running up bills in Illium of any description. Bear this in mind. “Your father, “Bradley Wentworth.” A week later Mr. Wentworth received this telegram from Illium. “Your son Victor has disappeared, leaving no traces of his destination. Particulars by mail. “Virgil Mcintire.” \n \n","sourceLink":"http://novel.tingroom.com/ertong/2947/80990.html","bookId":465,"book":{"id":465,"title":"A Debt of Honor","description":"简介： Our story opens in a cabin among the foothills of Colorado. It was built of logs, and was not over twelve feet in height. In the center was a door, with a small window on each side. Through the roof rose a section of funnel, from which issued a slend...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2947","creation":"Aug 1, 2019 12:18:49 AM","modification":"Aug 1, 2019 12:18:49 AM"}}
