{"id":20643,"no":41,"title":"LETTER XL. Rome.","content":"You are surprised that I have hitherto said nothing of the Capitol, and the Forum Romanum, which is by far the most interesting scene of antiquities in Rome. The objects worthy of attention are so numerous, and appear so confused, that it was a considerable time before I could form a tolerable distinct idea of their situation with respect to each other, though I have paid many more visits to this than any other spot since I have been in this city. Before we entered a church or palace, we ran thither with as much impatience as if the Capitol had been in danger of falling before our arrival. The approach to the modern Campidoglio is very noble, and worthy of the genius of Michael Angelo. The building itself is also the work of that great artist; it is raised on part of the ruins of the ancient Capitol, and fronts St. Peter’s church, with its back to the Forum and old Rome. Ascending this celebrated hill, the heart beats quick, and the mind warms with a thousand interesting ideas. You are carried back, at once, to the famous robber who first founded it. Without thinking of the waste of time which must have effaced what you are looking for, you cast about your eyes in search of the path by which the Gauls climbed up, and where they were opposed and overthrown by Manlius. You withdraw your eyes, with disdain, from every modern object, and are even displeased with the elegant structure you see before you, and contemplate, with more respect, the ruins on which it is founded; because they are more truly Roman. The two Sphynxes of basalte, at the bottom of the ascent, though excellent specimens of Egyptian sculpture, engage little of your attention. Warm with the glory of Rome, you cannot bestow a thought on the hieroglyphics of Egypt. At sight of the trophies erected in honour of C. Marius, all those bloody scenes acted by the fury of party and demon of revenge, during the most calamitous period of the republic, rush upon the memory; and you regret that Time, who has spared the monuments of this fierce soldier, has destroyed the numerous trophies raised to the Fabii, the Scipio’s, and other heroes, distinguished for the virtues of humanity, as well as the talents of Generals. You are struck with the colossal statues of Castor and Pollux, and, in the heat of enthusiasm, confounding the fictions of poetry with historical truth, your heart applauds their fraternal affection, and thanks them for the timely assistance they afforded the Romans in a battle with the Volsci. You rejoice at their good fortune, which, on earth, has procured them a place in the Capitol, and, in heaven, a seat by Hercules. Horace informs us, that Augustus drinks his[435] nectar, reclined between them and that demigod— Quos inter Augustus recumbens Purpureo bibit ore nectar. From them you move forward, and your admiration is fixed by the animated equestrian statue of Marcus Aurelius, which naturally brings to your memory that happy period, when the Roman empire was governed by a Prince who, during a long reign, made the good of his subjects the chief object of his government. You proceed to the upper end of the area; your eye is caught by a majestic female figure, in a sitting attitude; you are told it is a Roma Triumphans; you view her with all the warmth of fond enthusiasm, but you recollect that she is no longer Triumphans; you cast an indignant eye on St. Peter’s church, to which she also seems to look with indignation. Is there such another instance of the vicissitude of human things; the proud Mistress of the World under the[436] dominion of a priest? Horace was probably accused of vanity when he wrote these lines: ————Usque ego postera Crescam laude recens, dum Capitolium Scandet cum tacita virgine Pontifex. Yet the poet’s works have already outlived this period fourteen hundred years; and Virgil has transmitted the memory of the friendship and fame of Nisus and Euryalus, the same space of time beyond the period which he himself, in the ardour of poetic hope, had fixed for its limits. Fortunati ambo si quid mea carmina possunt, Nulla dies unquam memori vos eximet ?vo: Dum domus ?ne? Capitoli immobile saxum Accolet, imperiumque Pater Romanus habebit. In the two wings of the modern palace, called the Campidoglio, the Conservators of the city have apartments; their office is analogous to that of the ancient ?diles. In the main body an Italian nobleman, appointed by the Pope, has his residence,[437] with the title of Senator of Rome; the miserable representation of that Senate which gave laws to the world. The most defaced ruin, the most shapeless heap of antique rubbish in all Rome, cannot convey a feebler image of the building to which they belonged, than this deputy of the Pope does of that august assembly. The beautiful approach to this palace, and all the ornaments which decorate the area before it, cannot detain you long from the back view to which the ancient Capitol fronted. Here you behold the Forum Romanum, now exhibiting a melancholy but interesting view of the devastation wrought by the united force of time, avarice, and bigotry. The first objects which meet your eye, on looking from this side of the hill, are three fine pillars, two-thirds of them buried in the ruins of the old Capitol. They are said to be the remains of the temple of Jupiter Tonans, built by Augustus, in gratitude for having narrowly escaped death from a stroke of lightning. Near these are the remains[438] of Jupiter Stator, consisting of three very elegant small Corinthian pillars, with their entablature; the Temple of Concord, where Cicero assembled the Senate, on the discovery of Catiline’s conspiracy; the Temple of Romulus and Remus, and that of Antoninus and Faustina, just by it, both converted into modern churches; the ruins of the magnificent Temple of Peace, built immediately after the taking of Jerusalem, the Roman empire being then in profound peace. This is said to have been the finest temple in old Rome; part of the materials of Nero’s Golden House, which Vespasian pulled down, were used in erecting this grand edifice. The only entire pillar remaining of this temple, was placed by Paul V. before the church of Santa Maria Maggiore. It is a most beautiful fluted Corinthian column, and gives a very high idea of the temple to which it originally belonged. His Holiness has crowned it with an image of the Virgin Mary; and, in the inscription on the pedestal, he gives his reason for choosing a column belonging to the Temple of Peace, as an ornament to a church dedicated to the Virgin. Ex cujus visceribus Princeps ver? Pacis genitus est. Of many triumphal arches which stood formerly in Rome, there are only three now remaining, all of them near the Capitol, and forming entries to the Forum; those of Titus, Septimius Severus, and Constantine. The last is by much the finest of the three; but its chief beauties are not genuine, nor, properly speaking, its own; they consist of some admirable basso relievos, stolen from the Forum of Trajan, and representing that Emperor’s victories over the Dacians. This theft might, perhaps, not have been so notorious to posterity, if the artists of Constantine’s time had not added some figures, which make the fraud apparent, and, by their great inferiority, evince the degeneracy of the arts in the interval between the reigns of these two Emperors. The relievos of the arch of Titus represent the table of shew-bread, the trumpets, the golden candlesticks with seven branches, and other utensils, brought from the Temple of Jerusalem. The quarter which is allotted for the Jews is not at a great distance from this arch. There are about nine thousand of that unfortunate nation at present in Rome; the lineal descendants of those brought captive, by Titus, from Jerusalem. I have been assured that they always cautiously avoid passing through this arch, though it lies directly in their way to the Campo Vaccino, choosing rather to make a circuit, and enter the Forum at another place. I was affected at hearing this instance of sensibility in a people who, whatever other faults they may have, are certainly not deficient in patriotism, and attachment to the religion and customs of their forefathers. The same delicacy of sentiment is displayed by a poet of their own country, in the 137th psalm, as it is finely translated by Buchanan: Dum procul a Patria m?sti Babylonis in oris, Fluminis ad liquidas forte sedemus aquas; Illa animum subiit species miseranda Sionis, Et numquam Patrii tecta videnda soli. ... O Solym?, O adyta, et sacri penetralia templi Ullane vos animo deleat hora meo? \u0026c. You may read the whole; you will perhaps find some poetical beauties which escaped your observation when you heard it sung in churches; but the poet’s ardour seems to glow too violently towards the end of the psalm. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2910/80122.html","bookId":1098,"book":{"id":1098,"title":"A View of Society and Manners in Italy","description":"简介： Having left Vienna, we proceeded through the Duchies of Stiria, Carinthia, and Carniola, to Venice. Notwithstanding the mountainous nature of those countries, the roads are remarkably good. They were formed originally at a vast expence of labour to t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2910","creation":"Aug 1, 2019 12:24:21 AM","modification":"Aug 1, 2019 12:24:21 AM"}}
