{"id":20647,"no":45,"title":"LETTER XLIV. Rome.","content":"Thefts and crimes which are not capital are punished at Rome, and some other towns of Italy, by imprisonment, or by what is called the Cord. This last is performed in the street. The culprit’s hands are bound behind by a cord, which runs on a pully; he is then drawn up twenty or thirty feet from the ground, and, if lenity is intended, he is let down smoothly in the same manner he was drawn up. In this operation the whole weight of the criminal’s body is sustained by his hands, and a strong man can bear the punishment inflicted in this manner without future inconveniency; for the strength of the muscles of his arms enables him to keep his hands pressed on the middle of his back, and his body hangs in a kind of horizontal position. But when they intend[475] to be severe, the criminal is allowed to fall from the greatest height to which he had been raised, and the fall is abruptly checked in the middle; by which means the hands and arms are immediately pulled above the head, both shoulders are dislocated, and the body swings, powerless, in a perpendicular line. It is a cruel and injudicious punishment, and left too much in the power of those who superintend the execution, to make it severe or not, as they are inclined. Breaking on the wheel is never used in Rome for any crime; but they sometimes put in practice another mode of execution, which is much more shocking in appearance than cruel in reality. The criminal being seated on a scaffold, the executioner, who stands behind, strikes him on the head with a hammer of a particular construction, which deprives him, at once, of all sensation. When it is certain that he is completely dead, the executioner, with a large knife, cuts his throat from ear to ear. This[476] last part of the ceremony is thought to make a stronger impression on the minds of the spectators, than the bloodless blow which deprives the criminal of life. Whether the advantages resulting from this are sufficient to compensate for shocking the public eye with such abominable sights, I very much question. Executions are not frequent at Rome, for the reasons already given: there has been only one since our arrival; and those who are of the most forgiving disposition will acknowledge, that this criminal was not put to death till the measure of his iniquity was sufficiently full; he was condemned to be hanged for his fifth murder. I shall give you some account of his execution, and the ceremonies which accompanied it, because they throw some light on the sentiments and character of the people. First of all, there was a procession of priests, one of whom carried a crucifix on a pole hung with black; they were followed[477] by a number of people in long gowns which covered them from head to foot, with holes immediately before the face, through which those in this disguise could see every thing perfectly, while they could not be recognized by the spectators. They are of the Company della Misericordia, which is a society of persons who, from motives of piety, think it a duty to visit criminals under sentence of death, endeavour to bring them to a proper sense of their guilt, assist them in making the best use of the short time they have to live, and who never forsake them till the moment of their execution. People of the first rank are of this society, and devoutly perform the most laborious functions of it. All of them carried lighted torches, and a few shook tin boxes, into which the multitude put money to defray the expence of masses for the soul of the criminal. This is considered by many as the most meritorious kind of charity; and some, whose circumstances do not permit them to bestow much,[478] confine all the expence they can afford in charity, to the single article of purchasing masses to be said in behalf of those who have died without leaving a farthing to save their souls. The rich, say they, who have much superfluous wealth, may throw away part of it in acts of temporal charity; but it is, in a more particular manner, the duty of those who have little to give, to take care that this little shall be applied to the most beneficial purposes. What is the relieving a few poor families from the frivolous distresses of cold and hunger, in comparison of freeing them from many years burning in fire and brimstone? People are reminded of this essential kind of charity, not only by the preachers, but also by inscriptions upon the walls of particular churches and convents; and sometimes the aid of the pencil is called in to awaken the compunction of the unfeeling and hard-hearted. On the external walls of some convents, immediately above the box into which you are directed to put your money,[479] views of purgatory are painted in the most flaming colours, where people are seen in all the agonies of burning, raising their indignant eyes to those unmindful relations and acquaintances, who, rather than part with a little money, allow them to remain in those abodes of torment. One can hardly conceive how any mortal can pass such a picture without emptying his purse into the box, if, by so doing, he believed he could redeem, I will not say a human creature, but even a poor incorrigible dog, or vicious horse, from such a dreadful situation. As the Italians in general seem to have more sensibility than any people I am acquainted with, and as I see some, who cannot be supposed totally in want of money, pass by those pictures every day without putting a farthing into the box, I must impute this stinginess to a lack of faith rather than of sensibility. Such unmindful passengers are probably of the number of those who begin to suspect that the money of the living can be of little use[480] to the dead. Being absolutely certain that it gives themselves much pain to part with it in this world, and doubtful whether it will have any efficacy in abridging the pains of their friends in the other, they hesitate for some time between the two risks, that of losing their own money, and that of allowing their neighbour’s soul to continue in torture; and it would appear that those sceptics generally decide the dispute in favour of the money. But in such a case as that which I have been describing, where a poor wretch is just going to be thrust by violence out of one world, and solicits a little money to secure him a tolerable reception in another, the passions of the spectators are too much agitated for cold reasoning, and the most niggardly sceptic throws his mite into the boxes of the Compagnia della Misericordia. Immediately after them came the malefactor himself, seated in a cart, with a Capucin Friar on each side of him. The hangman,[481] with two assistants, dressed in scarlet jackets, walked by the cart. This procession having moved slowly round the gallows, which was erected in the Piazza del Populo, the culprit descended from the cart, and was led to a house in the neighbourhood, attended by the two Capucins. He remained there about half an hour, was confessed, and received absolution; after which he came out, exclaiming to the populace to join in prayers for his soul, and walked with a hurried pace to the gallows; the hangman and his assistants having hold of his arms, they supported him up the ladder, the unhappy man repeating prayers as fast as he could utter till he was turned off. He was not left a moment to himself. The executioner stepped from the ladder, and stood with a foot on each of his shoulders, supporting himself in that situation with his hands on the top of the gallows, the assistants at the same time pulling down the malefactor’s legs, so that he must have died in an instant. The executioner, in a[482] short time, slid to the ground along the dead body, as a sailor slides on a rope. They then removed the cloth which covered his face, and twirled the body round with great rapidity, as if their intention had been to divert the mob; who, however, did not shew any disposition to be amused in that manner. The multitude beheld the scene with silent awe and compassion. During the time appointed by law for the body to hang, all the members of the procession, with the whole apparatus of torches, crucifixes, and Capucins, went into a neighbouring church, at the corner of the Strada del Babbuino, and remained there till a mass was said for the soul of the deceased; and when that was concluded, they returned in procession to the gallows, with a coffin covered with black cloth. On their approach, the executioner, with his assistants, hastily retired among the crowd, and were no more allowed to come near the body. The condemned person having now paid the forfeit due to his crimes, was[483] no longer considered as an object of hatred; his dead body was therefore rescued from the contaminating touch of those who are held by the populace in the greatest abhorrence. Two persons in masks, and with black gowns, mounted the ladder and cut the rope, while others below, of the same society, received the body, and put it carefully into the coffin. An old woman then said, with an exalted voice, “Adesso spero che l’anima sua sia in paradiso;” “Now I hope his soul is in heaven;” and the multitude around seemed all inclined to hope the same. The serious and compassionate manner in which the Roman populace beheld this execution, forms a presumption of the gentleness of their dispositions. The crimes of which this man had been guilty must naturally have raised their indignation, and his profession had a tendency to increase and keep it up; for he was one of the Sbirri, all of whom are held in the most[484] perfect detestation by the common people; yet the moment they saw this object of their hatred in the character of a poor condemned man, about to suffer for his crimes, all their animosity ceased; no rancour was displayed, nor the least insult offered, which could disturb him in his last moments. They viewed him with the eyes of pity and forgiveness, and joined, with earnestness, in prayers for his future welfare. The manner in which this man was put to death was, no doubt, uncommonly mild, when compared with the atrocity of his guilt; yet I am convinced, that the solemn circumstances which accompanied his execution, made a greater impression on the minds of the populace, and would as effectually deter them from the crimes for which he was condemned, as if he had been broken alive on the wheel, and the execution performed in a less solemn manner. Convinced as I am that all horrid and refined cruelty in the execution of criminals[485] is, at best, unnecessary, I never heard of any thing of that nature without horror and indignation. Other methods, no way connected with the sufferings of the prisoner, equally deter from the crime, and, in all other respects, have a better influence on the minds of the multitude. The procession described above, I plainly perceived, made a very deep impression. I thought I saw more people affected by it than I have formerly observed among a much greater crowd, who were gathered to see a dozen or fourteen of their fellow-creatures dragged to the same death for house breaking and highway robbery, mere venial offences, in companion of what this Italian had perpetrated. The attendance of the Capucins, the crucifixes, the Society of Misericordia, the ceremony of confession, all have a tendency to strike the mind with awe, and keep up the belief of a future state; and when the multitude behold so many people employed, and so much pains taken, to save the soul of one[486] of the most worthless of mankind, they must think, that the saving of a soul is a matter of great importance, and therefore naturally infer, that the sooner they begin to take care of their own, the better. But when criminals are carried to execution with little or no solemnity, amidst the shouts of an unconcerned rabble, who applaud them in proportion to the degree of indifference and impenitence they display, and consider the whole scene as a source of amusement; how can such exhibitions make any useful impression, or terrify the thoughtless and desperate from any wicked propensity? If there is a country in which great numbers of young inconsiderate creatures are, six or eight times every year, carried to execution in this tumultuous, unaffecting manner, might not a stranger conclude, that the view of the legislature was to cut off guilty individuals in the least alarming way possible, that others might not be deterred from following their example? \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2910/80126.html","bookId":1098,"book":{"id":1098,"title":"A View of Society and Manners in Italy","description":"简介： Having left Vienna, we proceeded through the Duchies of Stiria, Carinthia, and Carniola, to Venice. Notwithstanding the mountainous nature of those countries, the roads are remarkably good. They were formed originally at a vast expence of labour to t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2910","creation":"Aug 1, 2019 12:24:21 AM","modification":"Aug 1, 2019 12:24:21 AM"}}
