{"id":20675,"no":73,"title":"LETTER LXXI. Florence.","content":"I have generally, since our arrival at Florence, passed two hours every forenoon in the famous gallery. Connoisseurs, and those who wish to be thought such, remain much longer. But I plainly feel this is enough for me; and I do not think it worth while to prolong my visit after I begin to be tired, merely to be thought what I am not. Do not imagine, however, that I am blind to the beauties of this celebrated collection; by far the most valuable now in the world. One of the most interesting parts of it, in the eyes of many, is the series of Roman Emperors, from Julius C?sar to Gallienus, with a considerable number of their Empresses, arranged opposite to them. This series is almost complete; but wherever the[360] bust of an Emperor is wanting, the place is filled up by that of some other distinguished Roman. Such an honour is bestowed with great propriety on Seneca, Cicero, or Agrippa, the son-in-law of Augustus. But, on perceiving a head of Antinous, the favourite of Adrian, among them, a gentleman whispered me,—that minion, pointing to the head, would not have been admitted into such company any where but in Florence. It ought, however, to be remembered, that the Gallery is not an ?gyptian court of judicature, where Princes are tried, after death, for crimes committed during their life. If the vices of originals had excluded their portraits, what would have become of the series of Roman Emperors, and particularly of the bust of the great Julius himself, who was husband to all the wives and —— —— —— The gallery is sacred to art, and every production which she avows, has a right to a place here. Amidst those noble specimens of ancient sculpture, some of the works of Michael Angelo are not thought undeserving a place. His Bacchus and Faunus, of which the well-known story is told, have been by some preferred to the two antique figures representing the same. The beautiful head of Alexander is universally admired by all the virtuosi; though they differ in opinion with regard to the circumstance in which the sculptor has intended to represent that hero. Some imagine he is dying; Mr. Addison imagines he sighs for new worlds to conquer; others that he faints with pain and loss of blood from the wounds he received at Oxydrace. Others think the features express not bodily pain or languor, but sorrow and remorse, for having murdered his faithful friend Clitus. You see how very uncertain a business this of a virtuoso is. I can hardly believe that the artist intended simply to represent him dying; there was nothing[362] very creditable in the manner he brought on his death. Nor do I think he would choose to represent him moaning, or languishing with pain or sickness; there is nothing heroic in that; nor do we sympathise so readily with the pains of the body, as with those of the mind. As for the story of his weeping for new worlds, he will excite still less sympathy, if that is the cause of his affliction. The last conjecture, therefore, that the artist intended to represent him in a violent fit of remorse, is the most probable. The unfinished bust of Marcus Brutus, by Michael Angelo, admirably expresses the determined firmness of character which belonged to that virtuous Roman. The artist, while he wrought at this, seems to have had in his mind Horace’s Ode Justum et tenacem propositi virum Non civium ardor prava jubentium, Non vultus instantis tyranni Mente quatit solida, \u0026c. [363] This would, in my opinion, be a more suitable inscription for the bust, than the concetto of Cardinal Bembo, which is at present under it[8]. Michael Angelo, in all probability was pleased with the expression he had already given the features, and chose to leave it as an unfinished sketch, rather than risk weakening it by an attempt to improve it. The virtuosi differ in opinion respecting the Arrotino, or Whetter, as much as about the head of Alexander. A young gentleman said to an antiquarian, while he contemplated the Arrotino, “I believe, Sir, it is imagined that this statue was intended for the slave, who, while he was whetting his knife, overheard Catiline’s conspiracy.”—“That is the vulgar opinion,” said the other; “but the statue was, in reality, done for a peasant, who discovered the plot into which[364] the two sons of Junius Brutus entered for the restoration of Tarquin.” “I ask pardon, Sir,” said the young man; “but although one may easily see that the figure listens with the most exquisite expression of attention, yet I should think it very difficult to delineate in the features, whether the listener heard a conspiracy, or any thing else which greatly interested him, and absolutely impossible to mark, by any expression of countenance, what particular conspiracy he is hearing.” “Your observation is just, young man,” said the antiquarian, “when applied to modern artists, but entirely the reverse when applied to the ancient. Now, for my own part, I plainly perceive in that man’s countenance, and after you have studied those matters as profoundly as I have done you will see the same, that it is the conspiracy for the restoration of Tarquin, and no other plot whatever,[365] which he listens to; as for Catiline’s conspiracy, it is not possible he could know any thing about it; for, good God! people ought to reflect, that the man must have been dead four hundred years before Catiline was born.” As we are now in the famous octogonal room, called Tribuna, I ought, if I had any thing new to say, to descant a little on the distinguishing excellencies of the Dancing Faun, the Wrestlers, the Venus Urania, the Venus Victrix; and I would most willingly pay the poor tribute of my praise to that charming figure known by the name of Venus de Medicis. Yet, in the midst of all my admiration, I confess I do not think her equal to her brother Apollo in the Vatican. In that sublime figure, to the most perfect features and proportions, is joined an air which seems more than human. The Medicean Venus is unquestionably a perfect model of female beauty; but while Apollo appears more than a[366] man, the Venus seems precisely a beautiful woman. In the same room are many valuable curiosities, besides a collection of admirable pictures by the best masters. I do not know whether any are more excellent of their kind, but I am convinced none are more attentively considered than the two Venuses of Titian; one is said to be a portrait of his wife, the other of his mistress. The first is the fined portrait I ever saw, except the second; of this you have seen many copies: though none of them equals the beauty of the original, yet they will give a juster idea of it than any description of mine could. On the back ground, two women seem searching for something in a trunk. This episode is found much fault with; for my part, I see no great harm the two poor women do: none but those critics who search more eagerly after deformity than beauty, will take any notice of them. [367] Besides the Gallery and Tribuna, the hundredth part of whose treasures I have not particularised, there are other rooms, whose contents are indicated by the names they bear; as, the Cabinet of Arts, of Astronomy, of Natural History, of Medals, of Porcelain, of Antiquities, and the Saloon of the Hermaphrodite, so called from a statue which divides the admiration of the Amateurs with that in the Borghese village at Rome. The excellence of the execution is disgraced by the vileness of the subject. We are surprised how the Greeks and Romans could take pleasure in such unnatural figures; in this particular their taste seems to have been as depraved, as in general it was elegant and refined. In this room there is a collection of drawings by some of the greatest masters, Michael Angelo, Raphael, Andrea del Sarto, and others. There is, in particular, a sketch of the Last Judgment by the first-named of these painters, different, and, in the opinion of some, designed[368] with more judgment, than his famous picture on the same subject in Sixtus the Fourth’s chapel in the Vatican. The large room, called the Gallery of Portraits, is not the least curious in this vast Mus?um. It contains the portraits, all executed by themselves, of the most eminent painters who have flourished in Europe during the three last centuries. They amount to above two hundred; those of Rubens, Vandyke, Rembrandt, and Guido, were formerly the most esteemed; two have been added lately, which vie with the finest in this collection—those of Meng’s and Sir Joshua Reynolds. The portrait of Raphael seems to have been done when he was young; it is not equal to any of the above. The Electress Dowager of Saxony has made a valuable addition to this collection, by sending her own portrait painted by herself; she is at full length, with the palette and pencils in her hands. Coreggio, after[369] hearing the picture of St. Cecilia at Bologna cried up as a prodigy, and the ne plus ultra of art, went to see it; and conscious that there was nothing in it that required the exertion of greater powers than he felt within himself, he was overheard to say, “Anch’ io sono pittore.” This illustrious princess was also conscious of her powers when she painted this portrait, which seems to pronounce to the spectators, Anch’ io sono pittrice. [8] Dum Bruti effigiem Michael de marmore fingit, In mentem sceleris venit, et abstinuit.","sourceLink":"http://novel.tingroom.com/duanpian/2910/80154.html","bookId":1098,"book":{"id":1098,"title":"A View of Society and Manners in Italy","description":"简介： Having left Vienna, we proceeded through the Duchies of Stiria, Carinthia, and Carniola, to Venice. Notwithstanding the mountainous nature of those countries, the roads are remarkably good. They were formed originally at a vast expence of labour to t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2910","creation":"Aug 1, 2019 12:24:21 AM","modification":"Aug 1, 2019 12:24:21 AM"}}
