{"id":20685,"no":83,"title":"LETTER LXXXI. Paris.","content":"I Made a longer stay at Besan?on than I intended, and am now about to inform you what detained me. The morning after the date of my last, as I returned to the inn from the parade, where I had been to see the troops, I met a servant of the Marquis de F——, who ran up to me the moment he knew me, and, in a breath, told me, that his master was at Besan?on; that he had been exceedingly ill, and thought, by the physicians, in great danger; but his complaint having terminated in an ague, they had now the strongest hopes of his recovery. I desired to be conducted immediately to him. I found the Marquis alone; pale, languid, and greatly emaciated. He expressed, however, equal pleasure and surprise at[473] this unexpected visit; said, he had been in danger of making a very long journey, and added, with a smile, that no man had ever set out with less inclination, for he hated travelling alone, and this was the only journey he could ever take, without wishing some of his friends to accompany him. He rejoiced, therefore, that he had been recalled in time to meet me before I should pass on to Paris. “But tell me,” continued he, “for I have ten thousand questions to ask—but let us take things in order; Eh bien, donnez nous donc des nouvélles du Pape? On nous a dit que vous aviez passé par la ceremonie de la Pantoufle. Ne pourroit on pas pendre au tragique une misère comme cela chez vous où le Saint Pere passe pour une Babylonienne de mauvaise vie?” Before I could make any answer I chanced to turn my eyes upon a person whom I had not before observed, who sat very gravely upon a chair in a corner of[474] the room, with a large periwig in full dress upon his head. The Marquis, seeing my surprise at the sight of this unknown person, after a very hearty fit of laughter, begged pardon for not having introduced me sooner to that gentleman (who was no other than a large monkey), and then told me, he had the honour of being attended by a physician, who had the reputation of possessing the greatest skill, and who certainly wore the largest periwigs of any doctor in the province. That one morning, while he was writing a prescription at his bed-side, this same monkey had catched hold of his periwig by one of the knots, and instantly made the best of his way out at the window to the roof of a neighbouring house, from which post he could not be dislodged, till the Doctor, having lost patience, had sent home for another wig, and never after could be prevailed on to accept of this, which had been so much disgraced. That,[475] enfin, his valet, to whom the monkey belonged, had, ever since that adventure, obliged the culprit, by way of punishment, to sit quietly for an hour every morning, with the periwig on his head.—Et pendant ces moments de tranquilité je suis honoré de la société du vénérable personage. Then addressing himself to the monkey, “Adieu, mon ami, pour aujourdhui—au plaisir de vous revoir;” and the servant immediately carried Monsieur le Medecin out of the room. Afraid that the Marquis might be the worse for talking so much, I attempted to withdraw, promising to return in the evening; but this I could not get him to comply with. He assured me, that nothing did him so much harm as holding his tongue; and that the most excessive headach he had ever had in his life, was owing to his having been two hours without speaking, when he made his addresses to Madam de ——; who could never forgive[476] those who broke in upon the thread of her discourse, and whom he lost after all, by uttering a few sentences before she could recover her breath after a fit of sneezing. In most people’s discourse, added he, a sneeze passes for a full stop. “Mais dans le Caquet eternel de cette femme ce n’est qu’un virgule.” I then enquired after my friends Dubois and Fanchon.—He told me, that his mother had settled them at her house in the country, where she herself chose, of late, to pass at least one half of the year; that Dubois was of great service to her, in the quality of steward, and she had taken a strong affection for Fanchon, and that both husband and wife were loved and esteemed by the whole neighbourhood. “I once,” continued the Marquis, “proposed to Fanchon, en badinant, to make a trip to Paris, for she must be tired of so much solitude.” “Have I not my husband?” said she, “Your husband is not company,” rejoined[477] I, “your husband, you know, is yourself. What do you think was her answer?” “Elle m’a répondu,” continued the Marquis, “Ah, Monsieur le Marquis, plus on sé loigne de soi-même, plus on s’écarte du bonheur.” In the progress of our conversation, I enquired about the lady to whom he was to have been married, when the match was so abruptly broken off by her father. He told me, the old gentleman’s behaviour was explained a short time after our departure from Paris, by his daughter’s marriage to a man of great fortune; but whose taste, character, and turn of mind were essentially different from those of the young lady. “I suppose then,” said I, “she appeared indifferent about him from the beginning.” “Pardonnez moi,” replied the Marquis, “au commencement elle joua la belle passion pour son mari, jusqu’à scandaliser le monde, peu à peu elle devint plus raisonable, et sur cet article les deux[478] epoux jouèrent bient?t à fortune égale, à présent ils s’amusent à se chicaner de petites contradictions qui jettent plus d’amertume dans le commerce que de torts décidés.” “Did you ever renew your acquaintance?” “Je ne pouvois faire autrement, elle a marqué quelques petits regrets de m’avoir traité si cruellement.” “And how did you like her,” said I, “on farther acquaintance?” “Je lui ai trouvé,” answered he, “tout ce qu’on pent souhaiter dans la femme d’un autre.” The Marquis, feeling himself a little cold, and rising from the sopha to ring for some wood, had a view of the street. “O ho,” cried he, looking earnestly through the window, “regardez, regardez cet homme”—“Quel homme?” said I. “Cet[479] homme à gros ventre,” said he; and while he spoke, his teeth began to chatter. “Ah, Diable, voilà mon chien d’accés—cet homme qui marche comme un Di—Di—Dindon, c’est l’aumonier du regiment.” I begged he would allow himself to be put to bed, for by this time he was all over shivering with the violence of the ague. “Non, non, ce n’est rien,” said he, “il faut absolument que je vous conte cette histoire. Cet homme qui s’engraisse en nettoy—nett—et—et—en nettoyant l’ame de mes soldats, faisoit les yeux doux à la femme d’un Ca—Ca—Caporal—Diantre je n’en peux plus. Adieu, mon ami, c’est la plus plaisante hist—sis—peste! demandez mes gens.” He was put to bed directly. I found the court below full of soldiers, who had come to enquire after their Colonel. Before I had reached the street, the Marquis’s Valet-de-Chambre overtook me, le ris sur la bouche,[480] et les larmes aux yeux, with a message from his master. The soldiers crowded about us, with anxiety on all their countenances. I assured them, there was no danger; that their Colonel would be well within a very few days. This was heard with every mark of joy, and they dispersed, to communicate the good news to their comrades. “Ah, Monsieur,” said the Valet, addressing himself to me, “il est tant aimé de ces braves Gar?ons! et il merite si bien de l’être!” Next day he looked better, and was in his usual spirits; the day following, he was still better; and having taken a proper quantity of the bark during the interval, he had no return of the fever. As he has promised to continue the use of the bark, in sufficient doses, for some time, and as relapses are not frequent at this season of the year, I am persuaded the affair is over,[481] and that he will gradually gain strength till he is perfectly recovered. He received me with less gaiety than usual, the day on which I took my leave, and used many obliging expressions, which, however you may smile, I am entirely disposed to believe were sincere; for Altho’ the candy’d tongue lick absurd pomp, And crook the pregnant hinges of the knee, Where thrift may follow fawning: ——Why should the poor be flatter’d? Just as I was returning, we heard the music of the troops marching off the parade.—“Apropos,” cried he, “How do your affairs go on with your Colonies?” I said, I hoped every thing would be arranged and settled very soon. “Ne croyez vous pas,” said he, “que ces Messieurs,” pointing to the troops which then passed below the window, “pourroient entrer pour quelque chose dans l’arrangement?” I said, I did not imagine the Americans were such fools as to break all connection with their friends, and then risk falling into the power of their enemies. “Il me semble,” answered he, “que ces Messieurs font assez peu de cas de votre amitié, et aussi, quand vous aurez prouvé qu’ils ont tort, il ne s’en suivra pas que vous ayiez toujours eu raison.” “Allons,” continued he, seeing that I looked a little grave, “point d’humeur;” then seizing my hand, “permettez moi, je vous prie, d’aimer les Anglois sans ha?r les Américains.” I soon after parted with this amiable Frenchman, whose gaiety, wit, and agreeable manners, if I may judge from my own experience, represent the character and disposition of great numbers of his countrymen. After a very agreeable journey by Gray, Langres, and Troyes, we arrived at this capital a few days ago. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2910/80164.html","bookId":1098,"book":{"id":1098,"title":"A View of Society and Manners in Italy","description":"简介： Having left Vienna, we proceeded through the Duchies of Stiria, Carinthia, and Carniola, to Venice. Notwithstanding the mountainous nature of those countries, the roads are remarkably good. They were formed originally at a vast expence of labour to t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2910","creation":"Aug 1, 2019 12:24:21 AM","modification":"Aug 1, 2019 12:24:21 AM"}}
