{"id":90358,"no":26,"title":"Page 26","content":"\\n\\n “How will this do, then?” I said, rather proud of myself.\\n\\n He chuckled. “Nice try, love, but that’s a bit much. Tone it down a bit.”\\n\\n “The rain in Spain lands mainly on the plain,” I said carefully.\\n\\n “The rain in Vane never touches the plain,” he said with a laugh. “Vane is mostly jungles. Do you have any other accents?”\\n\\n “Is annoyed an accent?” I said.\\n\\n “Let’s just pretend you’re a mute.”\\n\\n I stuck my tongue out at him, and he laughed that wild laugh of his. For just a second, I forgot the insurmountable odds we were up against and my worry for Nana. I laughed that way, too, and it felt good.\\n\\n By that time, the wide treads of the bus tanks had turned into a dirt road. The ground was starting to get muddy as the grasses dwindled, the few straggling tufts by the road stunted and brown. Bludbunnies were fewer and fewer.\\n\\n And then I learned why.\\n\\n 16\\n\\n I saw the thing in the road before I smelled it, but the smell was a close second. I couldn’t tell what it was. Just enough meat had been nibbled off the bones to remove hair and obscure the details. But it was definitely a carcass. And right on top of it was the biggest rat I’d ever seen, about the size of a house cat and covered with bristly, rust-colored hair.\\n\\n Criminy didn’t even slow down, but I crowded closer to his side as we approached. The rat didn’t seem concerned by us, either, not until we were about twenty feet away. Then it looked up, tubes and sinews dripping from its mouth, and hissed. The effect of its bloodred eyes in the maroon fur was disturbing.\\n\\n Criminy kept walking, dragging me along toward the nasty rat monster. The thing swallowed whatever it had been chewing and jumped off the carcass, hopping toward us with hackles raised. The fur stuck up in spines behind its neck, and it screamed at us. The scream sounded just like that of a human child.\\n\\n Without breaking his stride or letting go of my arm, Criminy pulled something out of his boot and threw it. I barely saw the dark blur shoot out of his left hand, and then the rat was twitching on its side, with a black knife sticking out of its forehead.\\n\\n We kept walking, and just as we reached the dead rat, Criminy withdrew his knife with a jerk. As he cleaned it on a handkerchief, I pondered the pile of meat.\\n\\n “It was a sheep, if you’re wondering,” he muttered.\\n\\n And I could see it now over my shoulder, the fuzzy white wool dangling from the general shape of a very chewed-up sheep.\\n\\n “How could it possibly get out of the wall?” I asked.\\n\\n “They have to bring the grazers out for the fresh grass. They can’t grow enough inside the wall to feed the animals. So they bring a team of shepherds bristling with weapons. But if the blud creatures swarm, they just leave one animal behind, a sacrifice for the rest of the herd. Fits in with their general philosophy.”\\n\\n The knife disappeared into his boot. We didn’t break our stride. I looked back at the giant rat and said, “So that’s a bludrat. And the city is full of those things?”\\n\\n “Oh, they try to kill them all. But they’re wily buggers. Bold and clever. No matter what the Coppers do, they always find a way back in. If I didn’t hate the things so much, I’d be impressed.”\\n\\n The city loomed bigger and bigger as we approached. The wall had seemed tall from far away, but standing in front of the gargantuan door made me feel helpless and tiny. I couldn’t begin to imagine how the two guards could open the two-story metal monstrosity. They each stood in a small building about the size of a closet, one on either side of the door. And they barely looked human, leather top hats laced down the neck, high collars digging into their chins, and bug-eyed goggles obscuring their eyes.\\n\\n “Papers,” barked the guard on the right through some sort of speaker, and Criminy led me to the glass wall of the booth. He slid our folded, faded traveling papers into a metal box and withdrew his hand before the guard jerked the box into his booth with a clang.\\n\\n Criminy smiled and did his best to look harmless and weak. I stuck my nose in the air and rolled my eyes.\\n\\n “State your business.”\\n\\n “We’re visiting relatives, sir,” Criminy said, his voice humble and obsequious. I knew he was an actor, but I was still floored that he sounded nothing like himself. “The wife and I. My cousin Anders and his family want to meet the new bride. He’s a clockmaker, sir, and—”\\n\\n “Toll!” the guard shouted. “Five coppers or one vial each.”\\n\\n The metal box popped violently back out of the booth, and Criminy snatched out our papers and dropped in a handful of coins. The box shot back into the booth.\\n\\n “Stand back,” the man said, and Criminy dragged me backward.\\n\\n The guard pulled a lever, and with a loud whirring and several clanks, one of the giant doors began to swing outward. I looked at the guard and quickly glanced away. Nothing but his nose and lips was visible under his uniform, but I could read his disgust for me in his sneer. I straightened my shoulders and snuggled my head into Criminy’s shoulder, giving the guard a look of disdainful rebellion. Criminy kissed me on the forehead and chuckled, and the guard spit on the floor and shook his head.\\n\\n “It’s only going to get worse,” Criminy muttered into my ear as we walked through the doorway. “Don’t worry, darling. Everyone’s going to hate us.”\\n\\n As the door clanged shut behind us, my throat constricted. I wasn’t sure what I had expected to find within the tall wall, but it was worse than I could have imagined. The cobblestone streets were narrow and dirty, rife with puddles. The buildings towered above, blocking the sky. The windows all had a dirty film on them, and the people rushed from place to place as if they were being chased. They all looked at me with disgust, just as the guard had done.\\n\\n Head down, Criminy quickly led me through the streets. We were on the main thoroughfare, a winding road lined with restaurants, inns, haberdashers, and milliners, all with painted signs swinging above their doors. Criminy didn’t know where he was, but he knew what he was looking for.\\n\\n We ducked down an alley. Red lights glittered from the shadows, and I heard a familiar hiss. All of the hairs on the back of my neck rose. It was darker there and more narrow, and I had to jog to keep up with him, my boots’ staccato tapping echoing in a way that made me think of bones in oubliettes. Finally, we stopped before a sign showing a vial of blood and a pair of scissors, with the words Arven Ariel, Barber and Letter calligraphed underneath.\\n\\n We stepped through the door and brushed past heavy, moldering curtains. I was expecting a cross between a morgue and a medieval barber, darkness and cobwebs and the smell of meat. But it looked more like a Mexican restaurant. Bright colors, fake palm trees, patterned fans and curtains. The walls were a vivid orange, and the floor was a sparkling, patterned mosaic of blue and lime green. Three plush chairs of maroon velvet waited in a row, each with a tasseled ottoman. A purple parrot on a stand squawked, “Master Arven, ye’ve custom!”\\n\\n Criminy was smirking at me. “Not what it seemed, eh?” he said. “It’s always like that in the city.”\\n\\n A very normal-looking man in a bowler hat brushed through a beaded curtain and approached us with a blank, professional smile.\\n\\n “Can I help you, sir? Letting, shave, or haircut?” he asked, rubbing his hands together in burgundy gloves.\\n\\n “A letting,” Criminy said cheerfully. “And information, if you please.”\\n\\n “Won’t madam have a seat?” the man asked, leading me to the middle chair. On a tray beside it sat a variety of scissors, straight razors, glass tubes, and antique-looking hypodermic needles. They didn’t look entirely clean.\\n\\n “Excuse me, what?” I said, planting my feet.\\n\\n “Your blood, darling,” Criminy said. “Three vials, I think.”\\n\\n The man tugged on my hand. I didn’t budge.\\n\\n “Darling,” I said sweetly through clenched teeth, “I wasn’t aware I’d be donating blood today.”\\n\\n “Darling,” Criminy answered me, “we bring different gifts to the marriage, and right now, we need your blood. So won’t you have a seat and relax? I’m told it doesn’t hurt a bit. Just a pinch.”\\n\\n I glowered at him. He smiled. I plunked into the chair and gripped the armrests. My gloved fingers tapped. I wasn’t scared of having blood drawn, and especially not of drawing it myself. But I didn’t trust those primitive instruments, even in a world without infection or disease.\\n\\n “Now what?” I growled.\\n\\n “If madam would unbutton her necklet? I assure you, my professionalism is unparalleled.” He smiled like a gynecologist.\\n\\n I reached up and struggled with the buttons, and the man gently rolled down the neck of my gown.\\n\\n “Just a pinch, if you’ll hold still, madam,” he murmured, and I turned my head and closed my eyes.\\n\\n Something cold and numbing swept over my skin, and then I did feel just a slight pinch. I heard Criminy’s footsteps move away to the other side of the room, and he pretended to be interested in a painting on the wall. I tried to sit very still and forget that a stranger was draining my blood out through my neck. I did the same thing every day for my patients, albeit from the arm. Was it all that different, just because someone was going to drink it instead of testing it?\\n\\n Mr. Ariel held a soft cloth to my skin, swiped something cold over it again, and applied something sticky. “We’re done, madam,” he said, and with my eyes still closed, I struggled to rebutton my dress.\\n\\n Criminy appeared at my side, his nimble fingers gentle on the buttons as he patted my hand.\\n\\n “I’m wondering, sir,” he asked, “where we might find Antonin Scabrous.”\\n\\n The man was fiddling with his instruments, and Criminy chose one of the three vials of blood on the tray and subtly nudged it toward him next to a silver coin. Both items disappeared into the man’s vest, and he didn’t turn to us as he murmured, “Tailor, West Darkside. Look for the Inn of the Old Black Dog. Watch out as you cross High Street. They won’t like the two of you. Coppers here are harder than elsewhere.” \\n\\n","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-26.html","bookId":1597,"book":{"id":1597,"title":"Wicked as They Come (Blud #1)","description":"Storyline: Wicked as They Come (Blud #1) \\n When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish…. \\n Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They\u0027re also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?\\n","cover":"https://allnovel.net/images/wicked-as-they-come-blud-1.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-they-come-blud-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:40:35 PM"}}
