{"id":90363,"no":31,"title":"Page 31","content":"\\n\\n Heads down, we sped toward the gates on the opposite side of the city from those we had entered through the day before. On the way, he bought me a wrappy brimming with buttery eggs and white cheese and lavender mushrooms. We stopped at a strange store called Apollinaire’s Everything Shoppe, which did indeed seem to have everything. It was like a five-and-dime crossed with my grandmother’s attic and a magic store. I marveled at the peculiar array of goods that Criminy stuffed into his pack. His leather satchel banged against his back on the way out with a metallic clang.\\n\\n As we neared the gate, Criminy yanked me into a dark alley and blew powder into my face, muttering a spell. I didn’t feel a thing, so I shrugged. He stood back and laughed, saying, “This one won’t hold up long, thank heavens. Let’s hurry.”\\n\\n The guards at the back gate were just as unfriendly as the ones at the front gate. As the guard looked at me, then down at my even newer set of fake papers, he sneered in disgust and, oddly, pity. But he waved us through, and the giant gate squealed open just enough for us to pass through.\\n\\n Once we were out of earshot, I reached to my face and asked, “What did you do to me?”\\n\\n Criminy pulled a small brass mirror from his waistcoat, saying, “It’s just a glamour, not something you can feel with your hands. I was trying to make you as different as possible from what you really are. It’s already fading.”\\n\\n In the mirror, I saw the most hideous woman I’d ever seen. Warts, chin whiskers, a vein-covered nose shaped like a squash.\\n\\n “Wow, it’s like being thirteen all over again,” I said. I had to laugh, too. It was awful, but it was a lot better than getting caught.\\n\\n Criminy took out his spyglass and scanned the moors. With an annoyed hmph, he pulled out a different compass, one I hadn’t seen before. Instead of having four arrows, this one had tiny pictures all around the outside of the circle. Criminy turned the dial and fiddled with the mechanism, then sighted along the arrow and started walking. I followed, nervous.\\n\\n We walked through the empty moors for some time before he put a hand out to stop me, right on the edge of an abandoned orchard. We were in the middle of nowhere and hadn’t seen a living thing other than bludbunnies since the city gate shut behind us.\\n\\n “It’s probably just over that hill. Now, unlace your gloves and neck, and stand right here, very still. You’re going to have to trust me.” He kissed my forehead and disappeared up a tree.\\n\\n I was alone. With a shaky breath, I began shyly unlacing things, releasing the scent of my flesh on purpose for the first time in this dangerous world. I stood there feeling the breeze on my skin but unable to enjoy it, imagining myself as Andromeda, chained to the rock and ignoring the sea. At least we were hunting something a good bit smaller than a kraken.\\n\\n The bludbunnies were the first to arrive, hopping innocently out of the cool morning and lolloping to my feet, where Criminy dispatched them one by one with a slingshot. I could barely see him through the leaves, perched on a branch with his neatly folded coat beside him.\\n\\n Soon the ground around my boots was littered with cute, fluffy corpses in white and soft brown and dappled gray. They reminded me of the fur jacket I’d received for Christmas when I was eight, except that my coat hadn’t wanted to eat me.\\n\\n Next came a fox, which was more than happy to snatch up some bludbunnies and run, not picky at all. Then a doe emerged from the bushes, its steps tentative. Criminy pinged it in the bum with a stone, and it hissed and bounded away.\\n\\n At last, we heard our quarry thundering over the hill, and my heart beat quick in my throat.\\n\\n It was so hard not to run away. As if that would have helped.\\n\\n She was a big one, and she was coming right at me.\\n\\n In my world, she would have been a Percheron, probably. But in this world, she was a bludmare and built to kill. Feet the size of dinner plates, long and flowing mane and tail, foamy mouth full of pointy teeth. Her huge red eyes were fixed on me. And she was drooling.\\n\\n She stopped to scent the air. Her glossy black sides quivered as she inhaled deeply. With a roar of triumph, the bludmare reared and galloped straight at me. I tensed. She weighed as much as a VW van, and she was going for the kill.\\n\\n The ground quaked beneath my boots as she pounded toward me. I steeled myself to hold still. It went against every instinct, just waiting for death to strike. But it’s not as if I could have outrun her, anyway. I had to trust Criminy.\\n\\n When the bludmare was so close that I could see the insides of her pink, huffing nostrils, something flew at her feet. She screamed and went down, thrashing on the ground with three of her legs caught in a bolus. The rope had wrapped several times around her thick ankles, and she wasn’t happy about it.\\n\\n I was frozen in place, in shock but fascinated. Criminy appeared in a blur of emerald green and a flash of silver. In his hands was the bridle cap he had bought from Apollinaire’s Everything Shoppe. He fit it over the bludmare’s nose and mouth, and her screams stopped, replaced by a furious whuffling. He ran the leather trappings behind her ears and buckled them under her jaw. She was effectively muzzled.\\n\\n He stood up to grin at the bludmare. Her eyes bulged with rage and reproach. I could almost hear her thinking, We’re creatures of blud, you and I. How can you abuse me so? and I had a moment of pity.\\n\\n But then I remembered the teeth and said, “Maybe you should tighten that a notch?”\\n\\n He did tighten it, and the bludmare sighed against the metal. He cut the bolus from her legs and stood back, holding the leather reins tightly as she heaved her great bulk off the ground and shook. He stepped closer, petting her thick, elegant neck.\\n\\n “She’s a beauty,” he said. “What should we call her?”\\n\\n I was scared, but I stepped forward nonetheless. As her eyes rolled down to stare at me, the prey turned captor, I tentatively put a still-ungloved hand out to stroke her neck. Her skin quivered against my touch, as if she was shaking off a fly.\\n\\n “Her name is Erris,” I said gently.\\n\\n Criminy looked at me, thoughtful. “Didn’t know it worked for animals.”\\n\\n “Me, neither,” I said.\\n\\n Such close scrutiny was making her nervous, and the giant black bludmare jigged in place, shaking her head and snorting. Just as I had seen on the Coppers’ mares, froth started to drip from the metal cap.\\n\\n “Have you ridden before?” Criminy asked me.\\n\\n “A little, at summer camp,” I said, looking into her intelligent red eye and finding myself uncomfortable with her own measurement of me. “I like horseback riding. In theory. She’s just so big. And wild.”\\n\\n “The journey that would take us two days on foot will take half a day on her back,” he answered. “But I imagine it’s going to be a bit hard on your fundament. Especially without a saddle. I’m sorry about that.”\\n\\n “If I remember my days on horseback,” I said with a wicked smile, “it’s going to be even harder on you.”\\n\\n “I think not,” Criminy said, patting her broad back. “She’s a wide lass. Well fed. And I like a nice, fat bum. I just need to break her to saddle first.”\\n\\n As I put on my gloves and relaced my dress, I watched the quick, handsome man work the horse. The mare tried to back away from him, pawing and snorting. He released the leather rein a little bit, giving her room. Rushing at her flank, he spun the leather strap, whipping her hip. She jumped away, trying to keep her hindquarters away from him. But he kept pushing into her, making her move. And she kept moving. I watched, transfixed by the give and take of man and beast, by his elegant balance of aggression and patience. He caught me staring and winked. I had to look down to hide my blush.\\n\\n After a few minutes, she lowered her head and blinked, sides heaving. I could hear her licking her lips inside the cap. Criminy smiled and reached out to stroke her neck.\\n\\n “I would never want her dead broke, a wild spirit like that,” he murmured. “Just obliging. She and I have a lot in common.”\\n\\n I smiled to myself, thinking about my own dead-broke years with Jeff. He probably would have put a shock collar on me if it had been legal. Even scared, it felt good to be free now.\\n\\n The horse followed him willingly to a fallen tree and stood as he helped me swing my heavy, rustling skirt over her back. She crow-hopped, and I grabbed her mane in my gloved hands. I managed to stay on, and Criminy swung up behind me gracefully. It was a shock to feel his body mold around mine, his thighs tense against me and his arms wrapped around me. I would not have guessed that riding a monster horse could feel so intimate and electrifying. Taking the reins in both hands, he murmured, “Hold on, sweetheart,” and kicked her in the ribs.\\n\\n Erris settled back on her haunches before leaping into the air. I squeezed with my knees and clung to the mane for dear life, and she hit the ground running. Since she was pointed in the right direction, this wasn’t such a bad thing, and Criminy just gathered me closer to him and let her gallop.\\n\\n She was big but nimble and very fast. Once I grew accustomed to the rhythm, staying on wasn’t hard at all. It reminded me of driving fast on a bridge on the highway, the car seeming to soar between the metal bumps. Ka-thunk, ka-thunk. For hours.\\n\\n We didn’t speak. The air would have sucked our words away. The heavy body beneath us was hot and sweaty, and I was more than aware of Criminy’s hard thighs behind mine, pressing into the horse’s flesh. His arms held the reins, trapping me within, and I could feel his eyes and thoughts hovering, close but miles away.\\n\\n My own thoughts wove in and out from the reality of galloping on a bloodthirsty horse across a strange world, to the fear of what would happen when we stopped galloping, to the constant ache in my heart for my other life. As refreshing as last night’s sleep had been, part of me was horrified not to wake up in my own world, slightly crazy and very sleepy. Just like when you’re having a nightmare and you keep expecting to wake up, but you don’t. I had taken the locket’s magic for granted.\\n\\n If my guess was correct, my body was unconscious and unresponsive. I was hooked up to monitors, and a nurse I’d never met was turning and bathing me, keeping me clean and without bedsores. The mental image made me shudder. Knowing what I did about Casper and my brief glance of Jonah Goodwill in my world, it seemed to be the only answer. If you were in a coma in my world, I was betting you were in Sang. \\n\\n","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-31.html","bookId":1597,"book":{"id":1597,"title":"Wicked as They Come (Blud #1)","description":"Storyline: Wicked as They Come (Blud #1) \\n When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish…. \\n Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They\u0027re also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?\\n","cover":"https://allnovel.net/images/wicked-as-they-come-blud-1.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-they-come-blud-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:40:35 PM"}}
