{"id":90377,"no":45,"title":"Page 45","content":"“I can tell you care for me,” he said. “Your smile, your touch, your trust. The way you rouse to me. But your feelings are incomplete. Like there’s some missing piece I can’t puzzle out.” “I do care for you,” I whispered. “In my own way.” He closed his eyes briefly, let that sink in. But then his jaw tightened. “And what way is that?” he shot back. “You’re not a little girl playing dress-up. You can’t just float along, letting things happen to you. You have to choose, Letitia. Once we find the locket, you have to choose.” “I’m not thinking that far ahead,” I said. “I need more time.” “Well, I’m thinking about it,” Criminy said. “And I want to know. Once you have the locket, will you go back to your world and leave me with a frail, insensible body that will wither and die here? Will you break the locket, will you take my blud? Or will you go back and forth, never sleeping, until you grow old or go mad?” “You’re forgetting that I could leave now if I wanted to,” I said. Here he was, trying to force me into making a choice.How could he know me so well and not understand what he was doing? “I have the potion. I could take you back, or him. It’s my choice.” “Yes, it is. And what will you choose?” I turned away. My eyes scanned the horizon, watching the never-ending grasses flow into hills and mountains, a world hazy around the edges where the sky always hung too low. There was an entire world here at my fingertips, and I’d only seen one small corner. Somewhere, far across these grasses, a beautiful man from my own world waited for me, filled with hope and playing familiar songs on a harpsichord and aching for the life he’d lost. And somewhere, even farther away, Nana waited, her time being stolen even more surely than mine. “I can’t tell you now,” I said. He had given me three choices, and I had added two more. I didn’t like a single one of them. But then again, I’d already seen the future, and it grew darker with every glance. 28 Something was wrong. Criminy had grown more and more agitated as we rumbled north, but now he was downright twitchy. And he wouldn’t put down the spyglass, even though he could barely control the jittering conveyance with one hand. “What is it?” I asked when I couldn’t stand the tense silence anymore. “The wagons are still circled. The caravan hasn’t moved,” he said. “My orders were to follow the schedule, and they should be on the way to Liverpool by now.” I could see it then, the far-off shadows against the cloudy sky. I had a feeling of homecoming that surprised me, and I thought of the comforts of my wagon. I actually missed the wallpaper. And the thought of my own little basin of water to wash in and a soft, silk-covered bed … oh, it was heaven on wheels. The conveyance, unfortunately, had only two speeds: stop and go. The traveling speed depended entirely on the tension in the winding key, and we were near the end of a round, so it was taking a painfully long time to climb the last hill. Finally, he jerked the conveyance off the road and pulled the brake. It shuddered to a halt, and we jumped out and ran through the thick, stringy grass. Not a single figure lurked outside the caravan. It was eerie. Something dark moved toward us across the moor, and I saw Criminy’s arm swing into motion. But he didn’t go for the bolus or the knife in his boot. He just held his arm out, palm open. With a coppery flash, Pemberly swung onto his shoulder by her tail. “Don’t just sit there, Pem. Assess!” he said peevishly, and she swung back down and hurtled toward the caravan. It was amazing to me how he always remembered to use her. I guess it was like me and the watch I wore to check a patient’s blood pressure or tell time. I was so accustomed to seeing her on his shoulder that he had seemed a little incomplete without her on the last leg of our journey. My little Uro had only come in handy once so far, and that was all Criminy’s doing. I had been too busy peeing myself in the locked lighthouse to think about my robot guardian’s door-unlocking capabilities. The bracelet bumped against my wrist, useless for now. The ground around the wagons was trampled. Big crowds had been there. But no one was practicing now, as they should have been. The clockworks were motionless between the wagons, their eyes open and unseeing. All was quiet. And that wasn’t good. Criminy veered left, and I followed him to Mrs. Cleavers’s wagon. He paused in front of the steps, panting, and regained his composure before knocking politely. I was in much worse shape, doubled over, huffing and puffing in my stained, torn men’s clothes. We waited by the door. Nothing happened. Not a sound came from within, and the lack of her customary shrill reception was ominous. Criminy tried the handle, and the door squeaked open. The room was always a jumble, but it had recently been the site of a struggle. Dress forms were toppled over, pools of fabric and pincushions sprawled in front of the broken mirror. Criminy closed his eyes and sniffed. “Pinkies,” he said. “Coppers.” At that moment, Pemberly skittered into the room, her tail high. Criminy swung her up onto his shoulder, and she opened her mouth. A thin white ribbon inched out and curled under her chin. Criminy ripped the paper and read, “Living: 19. Dead: 0. Blood: 0 ml. Caravan: Safe.” “Well, it doesn’t seem bloody safe, and we’re missing twelve and a half,” he muttered, tossing the paper to the ground. “Twelve and a half?” I asked. “Catarrh and Quincy are gone. Two heads, one body.” We poked around the wagon but couldn’t find any clues amid the destruction. Without speaking, we walked back outside and headed in the same direction, toward the dining car. As we passed Emerlie and Veruca’s wagon, there was a subtle scrape from within, and Criminy had his ear to the lime-green wall in an instant. “Someone’s inside,” he said softly, motioning me to the little wedge of space between two wagons next to Cadmus the cassowary. As I hid behind the still form of the giant brass bird, he knocked on the door and called, “Ladies?” “Who’s there?” came the harsh cawing from within. Emerlie, of course. “It’s Criminy Stain,” he said. “Open the door, Em.” The door flew open so quickly it almost smacked him in the face, and Emerlie came very close to throwing herself into his arms. At the last moment, her lifelong prejudice kept her from seeking shelter in the comforting embrace of her boss the bloodsucker. “Oh, sir, I’m that glad to see you!” she cried. “We don’t know what’s to be done.” “What’s happened?” he asked, but of course, she ignored that. “Oh, and that lady of yours, sir? Did the Coppers get her? Or is she dead? That poor lass, I told her, I told her to be careful. But she didn’t listen a bit.” “Letitia, come out,” he called. When I stepped out from my hiding place in my rumpled men’s clothes and waved sheepishly, Emerlie’s jaw dropped, but she ran to hug me just the same. Any port in a storm, I guessed. I patted her awkwardly. “It’s awful, what they did,” she said, sniffling. “And what did they do?” Criminy asked impatiently. “It’s the Coppers, sir. They showed up and demanded you and the papers, and they went to see Mrs. Cleavers, and they had a dreadful row. Said our papers wasn’t no good. There was an awful fight in her wagon, and she was howling and cursing like mad as they trussed her up and carried her away. And then all the other Bludmen ran off, afeared the Coppers would take them, too. So the show’s been closed down, and we’ve all been hiding in our wagons. Waiting.” “Waiting for what?” he asked with that peculiar ability of his to be furious and amused at the same time. “Anything,” she said, baffled. Then she spotted something over Criminy’s shoulder, and her face went from worried to relieved to excited to ashamed. Criminy and I both followed her glance and saw a slight man walking toward us through the grass. “Charlie Dregs!” Criminy called. “You old goat! Where have you been hiding?” The young Bludman I had seen below Emerlie’s tightrope on my first day had eyes only for her, but he clasped Criminy’s hand and nodded to me politely. “I was keeping watch,” he said. “In the next copse.” “Anybody else with you, lad?” “Naw,” Charlie said. “Just me. Had to make sure Em was safe. Nasty Coppers. Ain’t right, what they done.” “That’s kind of you, Charlie,” Emerlie said softly. “Thank you.” He just smiled, and nodded. Veruca appeared in the doorway and raised an eyebrow at the four of us in front of her wagon, saying with her odd accent, “What is this, springtime for odd couples? Go and make love on someone else’s porch. It is a troubled time.” Criminy sent Emerlie and Charlie to gather everyone left in the caravan for a meeting in the dining car. The Pinkies were worried, but the food helped to settle us. Criminy deposited me with Emerlie and her friends and went out to search for any other lurking Bludmen. We needed all the help we could get. As Emerlie chattered on about how upset she was that her new suit hadn’t been complete when Mrs. Cleavers disappeared, my wandering gaze fell on Casper, who was sitting alone at the other end of the car. He motioned me over, and, without making apologies, I went. Emerlie didn’t even halt in her prattle. “I’m glad you’re back safe,” he said with a devastating smile. The warm look in his eyes almost made me forget the misstep of our last conversation. “I was so worried about you. What happened?” “It was definitely an adventure,” I said, feeling my shoulders relax, the tension uncoiling. There was just something about him, like being in the presence of a movie star. Like the sun was shining only on me when he smiled. “We were chased out of Manchester, we saw a ghost, I got bitten by a sea monster, we rode in a submarine. You know, the usual.”","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-45.html","bookId":1597,"book":{"id":1597,"title":"Wicked as They Come (Blud #1)","description":"Storyline: Wicked as They Come (Blud #1) When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish…. Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They\u0027re also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?","cover":"https://allnovel.net/images/wicked-as-they-come-blud-1.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-they-come-blud-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:40:35 PM"}}
