{"id":90382,"no":50,"title":"Page 50","content":"Finally stopping under an awning, the Copper muttered, “Have fun in there,” and stood a little away, watching. Making sure that Rafael didn’t bolt. The sign had a stylized flame topped by the calligraphed House of Holofernes Inn. I shivered as Criminy grasped the knob. Something wasn’t right here. Before he could open the door, I put my hand on his shoulder. “Something smells funny around here,” Rafael said, sniffing the air. “Smells fishy.” Then he shrugged and went inside. I followed, glad that he had picked up on it, too. “Good evening, sir,” said a deep, sonorous voice. Behind the counter was a very tall, very thin old Bludman with a nose like an eagle’s beak. I doubted he had ever smiled in his entire life. I disliked him immediately. “Good evening, Master Holofernes,” said Rafael. “The guard at the gate told me I had to register, so here I am. I’ve never been in the city before. Do you have a room available?” “Sign here,” intoned the old man, and he slid a new-looking guest register across the counter. Rafael shrugged and picked up the quill, signing Rafael Fester, Nag’s Head in shaky cursive. Then he looked up expectantly. “Papers,” said Mr. Holofernes, and Rafael handed them over. Mr. Holofernes gave the aged, worn paper a thorough investigation and even tasted a corner with the tip of his tongue before silently returning them. Then he handed Rafael a little brass badge with an ornate B on it and pointed to one on his own lapels to indicate proper placement. After he rang a crystal bell, Mr. Holofernes glared at Rafael, and the men stood in mutual awkward silence. Right before Rafael got bored enough to say something that might have been foolhardy, a dark-haired Bludwoman rushed down the stairs and began chattering at him like a demented parakeet, filling the odd silence. Master Holofernes disappeared. “Well, hello there, now, sir. How do you do, sir? You’ll be wanting a room, won’t you, sir? And you’ve just missed the rain, isn’t that lucky? And what a loverly stag you’ve got there. Did you kill it yourself? That’ll fetch a pretty penny, that one, such a loverly rack on it. Now, where are your bags, sir?” Rafael looked completely flummoxed, and I almost tittered. “I’ve got no bags, miss, other than this little sack,” he finally said. “Didn’t plan on staying the night. Just wanted to bring this token to Master Jonah Goodwill from the good people of Nag’s Head, thank him for keeping our city safe. But the guard sent me here, so here I am.” “Well, now, a room’ll cost you ten coppers or three vials, sir, and that’s Pinky blood, if you don’t know. And that includes a half vial at dinner, which is quite the affair. Oh, everyone in the inn gathers together in the salon at elevenses for a loverly party, sir.” “That sounds awfully fancy,” Rafael said, digging in his waistcoat for coins. “Wasn’t expecting it to be so expensive, though. It’s my first night in a big city.” “Oh, now, sir, if that’s too dear for you, we’ve got a half room for five coppers, but it’s just got a cot and a ewer. The regular rooms have a nice, spacious bed, city views, and running water, you know. Ever so loverly, I assure you.” Rafael’s smile quirked in a familiar way, and he said, “That’s kind of you to mention, but I guess I’ll indulge and give myself room to spread out and enjoy it. You only live once, eh?” They laughed together. Must have been an inside joke for Bludmen. She handed him a key and gave him directions to his room, all but ordering him to freshen up before the mandatory party. I followed Rafael up two flights of stairs, careful to step at the same time he did, lest anyone wonder why an old man was making twice the normal amount of footsteps. He opened the door to the room and tossed the stag’s head onto the floor, where it landed with a splat. I followed him inside, and he kicked the door closed and caught me in his arms, whispering, “I can’t see you, but I can still smell you, my love.” I tried to wriggle away, but he held tight and nuzzled until he found my face. “There you are,” he breathed, and his lips found mine. I shifted my angle and startled when my eyes caught motion across the room. I glanced up at a floor-length oval mirror, in which an elderly man was passionately making out with the air. He pulled away as I shook with laughter and pointed at the mirror. Oh, wait. He couldn’t see me. “I was just watching you make love to nothing in that mirror,” I whispered. “It was quite a show.” Rafael chuckled, then sat on the bed and started unlacing his boots. “What are you doing?” I said. “I’m going to freshen up, like a good little Bludman,” he said. “Right after I do something that requires freshening. I seek to commune with the naughty little ghost of Viviel Fester.” He grinned at me, the wolfish grin. My insides melted a little. Giving myself a moment, I moved to the window and peeped through the curtains. A heavy, greasy rain was splattering across the cobblestones, coating them like slug slime in the orange gaslights. I shut the curtains. Things were much more interesting inside. “You can’t even see me,” I said coyly. “And we already did something freshening-worthy this afternoon. And you’re an old man. And you still have to go to a party.” “I don’t need to see you,” he reasoned. “It’ll be dark soon, and I can still feel you and taste you. This afternoon is the ancient past. And we’re both going to that party, because I need you to get information.” “Even if all that’s true, you’re still assuming I want to get unfreshened with a silly old man,” I countered. “In the dark, you won’t know the difference,” he said. “Maybe you’ll have old-man breath.” “Maybe not,” he said in his regular voice, low and husky. He stepped out of his boots and stood, shrugging out of his coat. He was looking right at me, even though he couldn’t see me. He walked to me and brought his arms in until they were right on my shoulders. Then he breathed on me, and I inhaled that wonderful scent of his and sighed. “Maybe not,” I echoed. “Besides,” he said, tracing down my shoulder to my hand and leading me to the bed, “I don’t think you’ve made your decision about the locket yet. This could be my last night with you. One of us could die tomorrow. Or you might leave me forever. I want every bit of happiness I can get.” He tried to keep his tone playful and light, but I could hear a farewell in his words, and I couldn’t have turned him down if I had wanted to. The curtains were already closed. He switched off the lights. We were both invisible in the darkness. It was Criminy’s face I felt, his soft, smooth hair running through my fingers. I traced his eyebrows and cheekbones, sharp features I would have recognized anywhere. “I just don’t know,” I whispered. “I don’t want to know, either, not tonight,” he answered, and then our lips met and our bodies melded together, neither of us what we seemed. Our first time together had been exploratory and playful. Our time in the woods had been fierce and raw. But this time, we were slow and pensive, every touch and kiss filled with longing and a strange, vulnerable finality. We took our time. It was fun, being invisible. 31 Afterward, we turned on a light, and I watched him stretch, fascinated by his darker, sagging skin. “Is that what you’ll look like one day?” I asked. “Or will you ever get old?” “It’ll be a long time until I’m old by your standards, love. You were right—this is what Antonin’s grandfather looked like. It’s just a simple glamour,” he said, his hand moving right through the curly white hair. “Only works on the eyes. I’ll have to dab on some cologne before we go down there, in case I see anyone I know. The other Bludmen will think I’m a simple country rube with no taste.” I stretched, enjoying the feeling of being completely naked and still utterly without shame, just like in my dreams. No sucking in the belly or worrying about stubble. It was so freeing. “Can’t we just stay like this for a while?” I asked. “It’s nice here.” “I gave you that choice, pet, but you want your locket. That’s why we’re here in the first place.” “Don’t be testy,” I said. “You know I have to do this. I’ve got a responsibility to my grandmother. She needs me. And it’s for the Bludmen, too. What happened in Brighton can’t happen here.” “I know, I know,” he growled. “Bugger the lot of them.” He rolled off the bed and ran water into the basin, then began scrubbing himself furiously with a wet towel. “You look like you’re trying to scrub me off of you,” I said archly. “Of course I am,” he said. “Dammit, woman! Your scent, your stupid bloody delicious scent lingering in every crevice of my body and my wardrobe, driving me nearly mad. Do you know what it’s like to want something so badly, to have it so close, and still feel that it’s out of your reach? Out of your control?” Ouch. Despite my invisibility, I was overcome with the need to cover up. To seek shelter. He was like a storm brewing, and I hadn’t seen him angry like this before. Not at me. Thunder rolled outside, and I felt it in my rib cage. “Why are you angry all of a sudden, Criminy? What did I do?” He began to dress, staring off into space with eyebrows drawn sharply down. “The powers I used to bring you here—they weren’t cheaply bought. You met the witch. I made my bargain with the devil; I paid my dues. And here you are, perfect in every way. Except that your heart’s all tied up in another world, another life, these other people. And I can’t even duel them for you, can’t trick them or glamour them. They’re like smoke and mirrors, like fighting a ghost.”","sourceLink":"https://allnovel.net/wicked-as-they-come-blud-1/page-50.html","bookId":1597,"book":{"id":1597,"title":"Wicked as They Come (Blud #1)","description":"Storyline: Wicked as They Come (Blud #1) When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish…. Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They\u0027re also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?","cover":"https://allnovel.net/images/wicked-as-they-come-blud-1.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-they-come-blud-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:40:35 PM"}}
