{"id":32490,"no":1,"title":"VOL I CHAPTER I. Mrs. Andinnian\u0027s Home.","content":"\\n\\n The house was ugly and old-fashioned, with some added modern improvements, and was surrounded by a really beautiful garden. Though situated close upon a large market town of Northamptonshire, it stood alone, excluded from the noise and bustle of the world. \\n\\n \\n\\n The occupant of this house was a widow lady, Mrs. Andinnian. Her husband, a post-captain in the Royal Navy, had been dead some years. She had two sons. The elder, Adam, was of no profession, and lived with her: the younger, Karl, was a lieutenant in one of Her Majesty\u0027s regiments. Adam was presumptive heir to his uncle, Sir Joseph Andinnian, a baronet of modern creation: Karl had his profession alone to look to, and a small private income of two hundred a year. \\n\\n \\n\\n They were not rich, these Andinnians: though the captain had deemed himself well-off, what with his private fortune, and what with his pay. The private fortune was just six hundred a year; the pay not great: but Captain Andinnian\u0027s tastes were simple, his wants few. At his death it was found that he had bequeathed his money in three equal parts: two hundred a year to his wife, and two hundred each to his sons. \"Adam and his mother will live together,\" he said in the will; \"she\u0027d not be parted from him: and four hundred pounds, with her bit of pension, will be enough for comfort. When Adam succeeds his uncle, they can make any fresh arrangement that pleases them. But I hope when that time shall come they will not forget Karl.\" \\n\\n \\n\\n Mrs. Andinnian resented the will, and resented these words in it. Her elder boy, Adam, had always been first and foremost with her: never a mother loved a son more ardently than she loved him. For Karl she cared not. Captain Andinnian was not blind to the injustice, and perhaps thence arose the motive that induced him not to leave his wife\u0027s two hundred pounds of income at her own disposal: when Mrs. Andinnian died, it would lapse to Karl. The captain had loved his sons equally: he would willingly have left them equally provided for in life, and divided the fortune that was to come sometime to Adam. Mrs. Andinnian, in spite of the expected rise for Adam, would have had him left better off from his father\u0027s means than Karl. \\n\\n \\n\\n There had been nearly a lifelong feud between the two family branches. Sir Joseph Andinnian and his brother the captain had not met for years and years: and it was a positive fact that the latter\u0027s sons had never seen their uncle. For this feud the brothers themselves were not in the first instance to blame. It did not arise with them, but with their wives. Both ladies were of a haughty, overbearing, and implacable temper: they had quarrelled very soon after their first introduction to each other; the quarrel grew, and grew, and finally involved the husbands as well in its vortex. \\n\\n \\n\\n Joseph Andinnian, who was the younger of the two brothers, had been a noted and very successful civil engineer. Some great work, that he had originated and completed, gained him his reward--a baronetcy. While he was in the very flush of his new honours, an accident, that he met with, laid him for many months upon a sick-bed. Not only that: it incapacitated him for future active service. So, when he was little more than a middle-aged man, he retired from his profession, and took up his abode for life at a pretty estate he had bought in Kent, called Foxwood Court, barely an hour\u0027s railway journey from London: by express train not much more than half one. Here, he and his wife had lived since: Sir Joseph growing more and more of an invalid as the years went on. They had no children; consequently his brother, Captain Andinnian, was heir to the baronetcy: and, following on Captain Andinnian, Adam, the captain\u0027s eldest son. \\n\\n \\n\\n Captain Andinnian did not live to succeed. In what seemed the pride of his health and strength, just after he had landed from a three years\u0027 voyage, and was indulging in ambitious visions of a flag, symptoms of a mortal disease manifested themselves. He begged of his physicians to let him know the truth; and they complied--he must expect but a very few weeks more of life. Captain Andinnian, after taking a day or two to look matters fully in the face, went up to London, and thence \\n\\n down to Sir Joseph\u0027s house in Kent. The brothers, once face to face, met as though no ill-blood had ever separated them: hands were \\n\\n locked in hands, gaze went out to gaze. Both were simple-minded, earnest-hearted, affectionate-natured men; and but for their wives--to whom, if the truth must be avowed, each lay in subjection--not a \\n\\n mis-word would ever have arisen between them. \\n\\n \\n\\n \"I am dying, Joseph,\" said the captain, when some of their mutual emotion had worn away. \"The doctors tell me so, and I feel it to be true. Naturally, it has set me on the thought of many things--that I am afraid I have been too carelessly putting off. What I have come down to you chiefly for, is to ask about my son--Adam. You\u0027ll tell me the truth, won\u0027t you, Joseph, as between brothers?\" \\n\\n \\n\\n \"I\u0027ll tell you anything, Harry,\" was Sir Joseph\u0027s answer. \"The truth about what?\" \\n\\n \\n\\n \"Whether he is to succeed you or not?\" \\n\\n \\n\\n \"Why, of course he must succeed: failing yourself. What are you thinking of, Harry, to ask it? I\u0027ve no son of my own: it\u0027s not likely I shall have one now. He will be Sir Adam after me.\" \\n\\n \\n\\n \"It\u0027s not the title I was thinking of, Joseph. Failing a direct heir, I know that must come to him. But the property?--will he have that? It is not entailed; and you could cut him out absolutely.\" \\n\\n \\n\\n \"D\u0027ye think I\u0027d be so unjust as that, Harry?\" was the half indignant reply. \"A baronet\u0027s title, and nothing to keep it up upon! I have never had an idea of leaving it away from you; or from him if you went first. When Adam succeeds to my name and rank, he will succeed to my property. Were my wife to survive me, she\u0027d have this place for life, and a good part of the income: but Adam would get it all at her death.\" \\n\\n \\n\\n \"This takes a weight off my mind,\" avowed Captain Andinnian. \"Adam was not brought up to any profession. Beyond the two hundred a year he\u0027ll inherit from me----\" \\n\\n \\n\\n \"A bad thing that--no profession,\" interrupted Sir Joseph. \"If I had ten sons, and they were all heirs to ten baronetcies, each one should be brought up to use his brains or his hands.\" \\n\\n \\n\\n \"It\u0027s what I have urged over and over again,\" avowed the captain. \"But the wife--you know what she is--set her face against it. \u0027He\u0027ll be Sir Adam Andinnian of Foxwood,\u0027 she\u0027d answer me with, \u0027and he shall not soil his hands with work.\u0027 I have been nearly, always afloat, too, Joseph: not on the spot to enforce things: something has lain in that.\" \\n\\n \\n\\n \"I wonder the young man should not have put himself forward to be of use in the world!\" \\n\\n \\n\\n \"Adam is idly inclined. I am sorry for it, but it is so. One thing has been against him, and that\u0027s his health. He\u0027s as tall and strong a young fellow to look at as you\u0027d meet in a summer\u0027s day, but he is, I fear, anything but sound in constitution. A nice fellow too, Joseph.\" \\n\\n \\n\\n \"Of good disposition?\" \\n\\n \\n\\n \"Very. We had used to be almost afraid of him as a boy; he would put himself into such unaccountable fits of passion. Just as--as--somebody else used to do, you know, Joseph,\" added the sailor with some hesitation. \\n\\n \\n\\n Sir Joseph nodded. The somebody else was the captain\u0027s wife, and Adam\u0027s mother. Sir Joseph\u0027s own wife was not exempt from the same kind of failing: but in a less wild degree than Mrs. Andinnian. With her the defects of temper partook more of the nature of sullenness. \\n\\n \\n\\n \"But Adam seems to have outgrown all that: I\u0027ve seen and heard nothing of it since he came to manhood,\" resumed the captain. \"I wish from my heart he had some profession to occupy him. His mother always filled him up with the notion that he would be your heir and not want it.\" \\n\\n \\n\\n \"He\u0027ll be my heir, in all senses, safe enough, Harry: though I\u0027d rather have heard he was given to industry than idleness. How does he get through his time? Young men naturally seek some pursuit as an outlet for their superfluous activity.\" \\n\\n \\n\\n \"Adam has a pursuit that he makes a hobby of; and that is his love of flowers; in fact his love of gardening in any shape. He\u0027ll be out amidst the plants and shrubs from sunrise to sunset. Trained to it, he\u0027d have made a second Sir Joseph Paxton. I should like you to see him: he is very handsome.\" \\n\\n \\n\\n \"And the young one--what is he like? What\u0027s his name by the way? Henry?\" \\n\\n \\n\\n \"No. Karl.\" \\n\\n \\n\\n \" Karl?\" repeated Sir Joseph in surprise, as if questioning whether he heard aright. \\n\\n \\n\\n \"Ay, Karl. His mother was in Germany when he was born, it being a cheap place to live in--I was only a poor lieutenant then, Joseph, and just gone off to be stationed before the West Indies. A great friend of hers, there, some German lady, had a little boy named Karl. My wife fell in love with the name, and called her own infant after it.\" \\n\\n \\n\\n \"Well, it sounds an outlandish name to me,\" cried the baronet, who was entirely unacquainted with every language but his own. \\n\\n \\n\\n \"So I thought, when she first wrote me word,\" assented Captain Andinnian. \"But after I came home and got used to call the lad by it, you don\u0027t know how I grew to like it. The name gains upon your favour in a wonderful manner, Joseph: and I have heard other people say the same. It is Charles in English, you know.\" \\n\\n \\n\\n \"Then why not call him Charles?\" \\n\\n \\n\\n \"Because the name is really Karl, and not Charles. He was baptized in Germany, but christened in England, and in both places it was done as \u0027Karl.\u0027 His mother has never cared very much for him.\" \\n\\n \\n\\n \"For him or his name, do you mean?\" \\n\\n \\n\\n \"Oh, for him.\" \\n\\n \\n\\n Sir Joseph opened his eyes. \"Why on earth not?\" \\n\\n \\n\\n \"Because all the love her nature\u0027s capable of--and in her it\u0027s tolerably strong--is given to Adam. She can\u0027t spare an atom from him: her love for him is as a kind of idolatry. For one thing, she was very ill when Karl was born, and neither nursed nor tended him: he was given over to the care of her sister who lived with her, and who had him wholly, so to say, for the first three years of his life.\" \\n\\n \\n\\n \"And what\u0027s Karl like?\" repeated Sir Joseph. \\n\\n \\n\\n \"You ought to see him,\" burst forth the Captain with animation. \"He\u0027s everything that\u0027s good and noble arid worthy. Joseph, there are not many young men of the present day so attractive as Karl.\" \\n\\n \\n\\n \"With a tendency to be passionate, like his brother?\" \\n\\n \\n\\n \"Not he. A tendency to patience, rather. They have put upon him at home--between ourselves; kept him down, you know; both mother and brother. He is several years younger than Adam; but they are attached \\n\\n to each other. A more gentle-natured, sweet-tempered lad than Karl \\n\\n never lived: all his instincts are those of a gentleman. He will make \\n\\n a brave soldier. He is ensign in the -- regiment.\" \\n\\n \\n\\n \"The -- regiment,\" repeated Sir Joseph. \"Rather a crack corps that, is it not?\" \\n\\n \\n\\n \"Yes: Karl has been lucky. He will have to make his own way in the world, for I can\u0027t give him much. But now that I am assured of your intentions as to Adam, things look a trifle brighter. Joseph, I thank you with all my heart.\" \\n\\n \\n\\n Once more the brothers clasped hands. This reunion was the pleasantest event of their later lives. The captain remained two days at Foxwood. Lady Andinnian was civilly courteous to him, but never cordial. She did not second her brother\u0027s pressing wish that he should prolong his stay: neither did she once ask after any of his family. \\n\\n \\n\\n Captain Andinnian\u0027s death took place, as anticipated. His will, when opened, proved to be what was mentioned above. Some years had gone by since. Mrs. Andinnian and her son Adam had continued to live together in their quiet home in Northamptonshire; Karl, lieutenant now, and generally with his regiment, paying them an occasional visit. No particular change had occurred, save the death of Lady Andinnian. The families had continued to be estranged as heretofore: for never a word of invitation had come out of Foxwood. Report ran that Sir Joseph was ailing much; very much indeed since the loss of his wife. And, now, that so much of introduction is over, we can go on with the story. \\n\\n \\n\\n \\n\\n A beautiful day in April. At a large window thrown open to the mid-day sun, just then very warm and bright, sat a lady of some five and fifty years. A tall, handsome, commanding woman, resolution written in every line of her haughty face. She wore a black silk gown with the slightest possible modicum of crape on it, and the guipure cap--or, rather, the guipure lappets, for of cap there was not much to be \\n\\n seen--had in it some black ribbon. Her purple-black hair was well preserved and abundant still; her black eyes were stern, and fearlessly honest. It was Mrs. Andinnian. \\n\\n \\n\\n She was knitting what is called a night-sock. Some poor sick pensioner of hers or her son\u0027s--for both had their charities--needed the comfort. Her thoughts were busy; her eyes went fondly out to the far end of the garden, where she could just discern her son against the shrubs: the fairest and dearest sight to Mrs. Andinnian that earth had ever contained for her, or ever would contain. \\n\\n \\n\\n \"It is strange Sir Joseph does not write for him,\" ran her \\n\\n thoughts--and they very often did run in the same groove. \"I cannot imagine why he does not. Adam ought to be on the spot and get acquainted with his inheritance: his uncle must know he ought. But that I have never stooped to ask a favour in my life, I would write to Sir Joseph, and proffer a visit for Adam, and--for--yes, for me. During that woman\u0027s lifetime Adam was not likely to be welcomed there: but the woman\u0027s gone: it is two months this very day since she died.\" \\n\\n \\n\\n The woman, thus unceremoniously alluded to, was Lady Andinnian: and the slight mourning, worn, was for her. Some intricacy in the knitting caused Mrs. Andinnian to bend her head: when she looked up again, her son was not to be seen. At the same moment, a faint sound of distant conversation smote her ear. The work dropped on her lap; with a look of annoyance she lifted her head to listen. \\n\\n \\n\\n \"He is talking to that girl again! I am sure of it.\" \\n\\n \\n\\n Lift her head and her ears as she would, she could not tell positively whose voices they were. Instinct, however, that instinct of suspicion we all feel within us on occasion, was enough. \\n\\n \\n\\n A very respectable manservant of middle age, thoughtful in face, fair in complexion, with a fringe of light hair round the sides of his otherwise bald head, entered the room and presented a note to his mistress. \"Who is it from?\" she asked as she took it off the silver waiter. An old waiter, bearing the Andinnian crest. \\n\\n \\n\\n \"Mrs. Pole\u0027s housemaid has brought it, ma\u0027am. She is waiting for an answer.\" \\n\\n \\n\\n It was but a friendly note of invitation from a neighbour, asking Mrs. Andinnian and her two sons to go in that evening. For Karl, the second son, had come home for a two days\u0027 visit, and was just then writing letters in another room. \\n\\n \\n\\n \"Yes, we will go--if Adam has no engagement,\" said Mrs. Andinnian to herself, but half aloud. \"Hewitt, go and tell Mr. Andinnian that I wish to speak with him.\" \\n\\n \\n\\n The man went across the garden and through the wilderness of shrubs. There stood his master at an open gate, talking to a very pretty girl with bright hair and rosy cheeks. \\n\\n \\n\\n \"My mistress wishes to see you, Mr. Adam.\" \\n\\n \\n\\n Adam Andinnian turned round, a defiant expression on his haughty face, as if he did not like the interruption. He was a very fine man of some three-and-thirty years, tall and broad-shouldered, with his mother\u0027s cast of proud, handsome features, her fresh complexion, and her black hair. His eyes were dark grey; deeply set in the head, and rarely beautiful. His teeth also were remarkably good; white, even, and prominent, and he showed them very much. \\n\\n \\n\\n \"Tell my mother I\u0027ll come directly, Hewitt.\" \\n\\n \\n\\n Hewitt went back with the message. The young lady who had turned to one of her own flower-beds, for the gardens joined, was bending over some budding tulips. \\n\\n \\n\\n \"I think they will be out next week, Mr. Andinnian,\" she looked round to say. \\n\\n \\n\\n \"Never mind the tulips,\" he answered after a pause, during which he had leaned on the iron railings, looking dark and haughty. \"I want to hear more about this.\" \\n\\n \\n\\n \"There\u0027s nothing more to hear,\" was the young lady\u0027s answer. \\n\\n \\n\\n \"That won\u0027t do, Rose. Come here.\" \\n\\n \\n\\n And she went obediently. \\n\\n \\n\\n The house to which this other garden belonged was a humble, unpretending dwelling, three parts cottage, one part villa. A Mr. Turner lived in it with his wife and niece. The former was in good retail business in the town: a grocer: and he and his wife were as humble and unpretending as their dwelling. The niece, Rose, was different. Her father had been a lawyer in small local practice: and at his death Rose--her mother also dead--was taken by her uncle and aunt, who loved both her and her childish beauty. Since then she had lived with them, and they educated her well. She was a good girl: and in the essential points of mind, manner, and appearance, a lady. But her position was of necessity a somewhat isolated one. With the tradespeople of the town Rose Turner did not care to mix: she felt that, however worthy, they were beneath her: quite of another order altogether: on the other hand, superior people would not associate with Miss Turner, or put so much as the soles of their shoes over the doorsill of the grocer\u0027s house. At sixteen she had been sent to a finishing school: at eighteen she came back as pretty and as nice a girl as one of fastidious taste would wish to see. \\n\\n \\n\\n Years before, Adam and Karl Andinnian had made friends with the little child: they continued to be intimate with her as brothers and sister. Latterly, it had dawned on Mrs. Andinnian\u0027s perception that Adam and Miss Turner were a good deal together; certainly more than they need be. Adam had even come to neglect his flowers, that he so much loved, and to waste his time talking to Rose. It cannot be said that Mrs. Andinnian feared any real complication--any undesirable result of any kind; the great difference in their ages might alone have served to dispel the notion: Adam was thirty-three; Miss Turner only just out of her teens. But she was vexed with her son for being so frivolous and foolish: and, although she did not acknowledge it to herself, a vague feeling of uneasiness in regard to it lay at the bottom of her heart. As to Adam, he kept his thoughts to himself. Whether this new propensity to waste his hours with Miss Turner arose out of mere pastime, or whether he entertained for her any warmer feeling, was, his own secret. \\n\\n \\n\\n Things--allowing for argument\u0027s sake that there was some love in the matter--were destined not to go on with uninterrupted smoothness. There is a proverb to the effect, you know. During the last few weeks a young medical student, named Martin Scott, had become enamoured of Miss Turner. At first, he had confined himself to silent admiration. Latterly he had taken to speaking of it. Very free-mannered, after the fashion of medical students of graceless nature, he had twice snatched a kiss from her: and the young lady, smarting under the infliction, indignant, angry, had this day whispered the tale to Adam Andinnian. And no sooner was it done, than she repented: for the hot fury that shone out of Mr. Andinnian\u0027s face, startled her greatly. \\n\\n \\n\\n They were standing together again at the small iron gate, ere the sound of Hewitt\u0027s footsteps had well died away. Rose Turner had the true golden hair that ladies have taken to covet and spend no end of money on pernicious dyes to try and obtain. Her garden hat was untied, and she was playing with its strings. \\n\\n \\n\\n \"Rose, I must know all; and I insist upon your telling me. Go on.\" \\n\\n \\n\\n \"But indeed I have told you all, Mr. Andinnian.\" \\n\\n \\n\\n Mr. Andinnian gazed steadfastly into Miss Rose\u0027s eyes, as if he would get the truth out of their very depths. It was evident that she now spoke unwillingly, and only in obedience to his strong will. \\n\\n \\n\\n \"It was last night, was it, that he came up, this brute of a Scott?\" \\n\\n \\n\\n \"Last night, about six,\" she answered. \"We were at tea, and my aunt asked him to take some--\" \\n\\n \\n\\n \"Which he did of course?\" savagely interrupted Mr. Andinnian. \\n\\n \\n\\n \"Yes; and eat two muffins all to himself,\" laughed Miss Turner, trying to turn the anger off. Mr. Andinnian did not like the merriment. \\n\\n \\n\\n \"Be serious if you please, child; this is a serious matter. Was it after tea that he--that he dared to insult you?\" and the speaker shut his right hand with a meaning gesture as he said it. \\n\\n \\n\\n \"Yes. Aunt went to the kitchen to see about something that was to be prepared for my uncle\u0027s supper--for she is fidgety over the cooking, and never will trust it to the servant. Martin Scott then began to tease as usual; saying how much he cared for me, and asking me to wait for him until he could get into practice.\" \\n\\n \\n\\n \"Well?\" questioned Adam impatiently as she stopped. \\n\\n \\n\\n \"I told him that he had already had his answer from me and that he had no right to bring the matter up again; it was foolish besides, as it only set me more against him. Then I sat down to the piano and played the Chatelaine--he only likes rattling music--and sang a song, thinking it would pass the time in peace until aunt returned. \\n\\n By-and-by I heard my uncle\u0027s latch-key in the front door, and I was crossing the room to go out and meet him, when Martin Scott laid hold of my arm, and--and kissed me.\" \\n\\n \\n\\n Mr. Andinnian bit his lips almost to bleeding. His face was frightful in its anger. Rose shivered a little. \\n\\n \\n\\n \"I am sorry I told you, Mr. Andinnian.\" \\n\\n \\n\\n \"Now listen, Rose. If ever this Martin Scott does the like again, I\u0027ll shoot him.\" \\n\\n \\n\\n \"Oh, Mr. Andinnian!\" \\n\\n \\n\\n \"I shall warn him. In the most unmistakable words; words that he cannot misconstrue; I will warn him of what I mean to do. Let him disregard it at his peril; if he does, I\u0027ll shoot him as I would shoot a dog.\" \\n\\n \\n\\n The very ferocity of the threat, its extreme nature, disarmed Miss Turner\u0027s belief in it. She smiled up in the speaker\u0027s face and shook her head, but was content to let the subject pass away in silence. Adam Andinnian, totally forgetting his mother\u0027s message, began talking of pleasanter things. \\n\\n \\n\\n Meanwhile, Mrs. Andinnian\u0027s patience was growing exhausted: she hated to keep other people\u0027s servants waiting her pleasure. Her fingers were on the bell to ring for Hewitt, when Karl entered the room, some sealed letters in his hand. A slender man of seven-and-twenty, slightly above the middle height, with pale, clearly-cut features and a remarkably nice expression of countenance. He had the deeply-set, beautiful grey eyes of his brother; but his hair, instead of being black and straight, was brown and wavy. An attractive looking man, this Karl Andinnian. \\n\\n \\n\\n \"I am going out to post these letters,\" said Karl. \"Can I do anything for you in the town, mother?\" \\n\\n \\n\\n The voice was attractive too. Low-toned, clear, melodious, full of truth: a voice to be trusted all over the world. Adam\u0027s voice was inclined to be harsh, and he had rather a loud way of speaking. \\n\\n \\n\\n \"Nothing in the town,\" replied Mrs. Andinnian: and, now that you notice it, her voice was harsh too. \"But you can go and ask your brother why he keeps me waiting. He is behind the shrubbery.\" \\n\\n \\n\\n Karl left his letters on the table, traversed the garden, and found Adam with Miss Turner. They turned to wait his approach. A half doubt, he knew not wherefore, dawned for the first time on his mind. \\n\\n \\n\\n \"How are you this morning, Rose?\" he asked, raising his hat with the ceremony one observes to an acquaintance, rather than to an intimate friend. \"Adam, the mother seems vexed: you are keeping her waiting, she says, and she wishes to know the reason of it.\" \\n\\n \\n\\n \"I forgot all about it,\" cried Adam. \"Deuce take the thorn!\" \\n\\n \\n\\n For just at that moment he had run a thorn into his finger. Karl began talking with Miss Turner: there was no obligation on him to return forthwith to the house. \\n\\n \\n\\n \"Go back, will you, Karl, and tell the mother I am sorry I forgot it. I shall be there as soon as you are.\" \\n\\n \\n\\n \"A genteel way of getting rid of me,\" thought Karl with a laugh, as he at once turned to plunge into the wide shrubbery. \"Good day to you, Rose.\" \\n\\n \\n\\n But when he was fairly beyond their sight Karl\u0027s face became grave as a judge\u0027s. \"Surely Adam is not drifting into anything serious in that quarter!\" ran his thoughts. \"It would never do.\" \\n\\n \\n\\n \"Well--have you seen Adam!\" began Mrs. Andinnian, when he entered. \\n\\n \\n\\n \"Yes. He is coming immediately.\" \\n\\n \\n\\n \" Coming!\"--and she curled her vexed lips. \"He ought to come. Who is he with, Karl?\" \\n\\n \\n\\n \"With Miss Turner.\" \\n\\n \\n\\n \"What nonsense! Idling about with a senseless child!\" \\n\\n \\n\\n \"I suppose it is nothing but nonsense?\" spoke Karl, incautiously. \"She--Miss Turner--would scarcely be the right woman in the right place.\" \\n\\n \\n\\n His mother glanced at him sharply. \"In what place?--what woman?\" \\n\\n \\n\\n \"As Lady Andinnian.\" \\n\\n \\n\\n Karl had angered his mother before in his lifetime, but scarcely ever as now. She turned livid as death, and took up the first thing that came to her hand--a silver inkstand, kept for show, not use--and held it as if she would hurl it at his head. \\n\\n \\n\\n \"How dare you, sir, even in supposition, so traduce your brother?\" \\n\\n \\n\\n \"I beg your pardon, mother. I spoke without thought.\" \\n\\n \\n\\n As she was putting down the inkstand, Adam came in. He saw that something was amiss. Mrs. Andinnian spoke abruptly about the invitation for the evening, and asked if he would go. Adam said he could go, and she left the room to give, herself, a verbal answer to the waiting servant. \\n\\n \\n\\n \"What was the matter, Karl?\" \\n\\n \\n\\n \"The mother was vexed at your staying with Rose Turner, instead of coming in. It was nonsense, she said, to be idling about with a senseless child. I--unfortunately, but quite unintentionally--added to her anger by remarking that I supposed it was nonsense, for she, Miss Turner, would scarcely be suitable for a Lady Andinnian.\" \\n\\n \\n\\n \"Just attend to your own affairs,\" growled Adam. \"Keep yourself in your place.\" \\n\\n \\n\\n Karl looked up with his sweet smile; answering with his frank and gentle voice. The smile and the voice acted like oil on the troubled waters. \\n\\n \\n\\n \"You know, Adam, that I should never think of interfering with you, or of opposing your inclinations. In the wide world, there\u0027s no one, I think, so anxious as I am for your happiness and welfare.\" \\n\\n \\n\\n Adam did know it, and their hands met in true affection. Few brothers loved each other as did Adam and Karl Andinnian. Seeing them together thus, they were undoubtedly two fine young men--as their sailor father had once observed to his brother. But Karl, with his nameless air of innate goodness and refinement, looked the greater gentleman. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2701/74227.html","bookId":1457,"book":{"id":1457,"title":"Within the Maze","description":"简介： The house was ugly and old-fashioned, with some added modern improvements, and was surrounded by a really beautiful garden. Though situated close upon a large market town of Northamptonshire, it stood alone, excluded from the noise and bustle of the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2701","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
