{"id":32505,"no":16,"title":"CHAPTER XVI. A Night at the Maze","content":"The Maze was an old-fashioned, curious house inside, full of angles and passages and nooks and corners. Its rooms were small, and not many in number, the principal ones being fitted up with dark mahogany wainscoting. The windows were all casement windows with the exception of two: into those, modern sashes of good size had been placed by the late owner and occupant, Mr. Throcton. At Mr. Throcton\u0027s death the property was put up for sale and was bought by Sir Joseph Andinnian, furniture and all, just as it stood. Or, it may rather be said, was bought by Lady Andinnian; for the whim to buy it was hers. Just after the purchase had been entirely completed Lady Andinnian sickened and died. Sir Joseph, ill at the time, did nothing whatever with the new place; so that on his death it came into the possession of his heirs in exactly the same state as when it was purchased. They let it be also, and it remained shut up. According to what Mr. Smith informed Miss Blake--and he was in the main correct, though not quite--Mrs. Grey had come to it and taken possession while Mrs. Andinnian lay ill at Foxwood and her son Karl was in attendance on her. But the little fable the agent had made use of--that he had gone over to the Maze to receive the premium from Mrs. Grey on taking possession--had no foundation in fact. He had certainly gone to the Maze and seen the lady called Mrs. Grey, but not to receive a premium, for she paid none. \n \n The two rooms into which sash windows had been placed were--the one that faced Miss Blake when she had penetrated to the confines of the Maze on that unlucky day, and within which she had seen the unconscious Mrs. Grey; and the one above it. They were at the end of the house, looking towards the entrance gates. Into this upper room the reader must pay a night visit. It was used as a sitting-room. The same dark mahogany wainscoting lined the walls as in the room below, the furniture was dark and heavy-looking; and, in spite of the sultry heat of the night, the shutters were closed before the window and dull crimson curtains of damask wool were drawn across them. There was nothing bright in the appendages of the room, save the lighted lamp on the table and a crystal vase of hothouse flowers. \n \n Seated at the table at work--the making of an infant\u0027s frock--was \n Mrs. Grey. Opposite to her, in the space between the table and the fire-place, sat Sir Karl; and by her side, facing him--Adam Andinnian. \n \n It is more than probable that this will be no surprise; that the reader has already divined the truth of the secret, and all the miserable complication it had brought and was bringing in its train. It was not Adam Andinnian who had died in that fatal scuffle off Portland Island--or more strictly speaking, off Weymouth--but one of the others who had been concerned in it. \n \n Yes, there he sat, in life and in health; his speech as free, his white and beautiful teeth not less conspicuous than of yore--Sir Adam Andinnian. Karl, sitting opposite with his grave, sad face, was not in reality Sir Karl and never had been. \n \n But Adam Andinnian was altered. The once fine black hair, which it had used to please him to wear long in the neck, was now short, scanty, and turned to grey; his once fine fresh colour had given place to pallor, and he was growing a beard that looked grey and stubbly. Decidedly old-looking now, as compared with the past, was Adam Andinnian. He wore evening dress: just as though he had been attired for a dinner party--say--at Foxwood Court. Mrs. Grey--as she was called, though she was in reality Lady Andinnian wore a summer dress of clear white muslin, through which might be seen her white neck and arms. It was the pleasure of her husband, Sir Adam, that in the evening, when only he dared to come out of his hiding-shell, they should keep up, in attire at least, some semblance of the state that ought to have been theirs. \n \n \"I can tell you, Karl, that I don\u0027t approve of it,\" Sir Adam was saying, with all his old haughty bearing and manner. \"It\u0027s a regular scandal. What business has any one to set up such a thing on my land?\" \n \n \"It\u0027s Truefit\u0027s land for the time being, you know, Adam. He gave the consent.\" \n \n \"A parcel of foolish people--be-vanitied boys of self-called priests, and be-fooled girls, running and racing to the place four or five times a day under pretence of worship!\" continued Sir Adam, getting up to pace the room in his excitement, as though he would have burst through its small confines. \"I won\u0027t permit it, Karl.\" \n \n He seemed to have got somewhat shorter, and his walk had a limp in it. But he was the same hasty, fiery, Adam Andinnian. A man cannot well change his nature. \n \n \"I do not see how it is to be prevented,\" was Karl\u0027s answer. \"It will not do in our position, to raise a stir over anything, or to make enemies. I daresay it will bring itself to an end some way or other.\" \n \n \"The whole parish is making fun of it, I find: Ann hears it talked of when she goes on errands. And it is a downright insult on Mr. Sumnor. What a curious-minded person that Miss Blake must be! Rose\"--Sir Adam halted close to his wife--\"if ever you put your foot inside this St. Jerome\u0027s I\u0027ll not forgive you.\" \n \n She lifted her eyes to his from the baby\u0027s frock. \"I am not likely to go to it, Adam.\" \n \n \"The empty-headed creatures that girls are, now-a-days! If \n bull-baiting came up, they\u0027d run off to it, just as readily as the good girls of former days would run from any approach of evil to take shelter under their mother\u0027s wing. Does your wife frequent St. Jerome\u0027s, Karl?\" \n \n \"Oh no.\" \n \n \"She shows her sense.\" \n \n Karl Andinnian smiled. \"You have not lost the old habit, Adam--the putting yourself into a heat for nothing. I came over this evening to have some serious talk with you. Do sit down.\" \n \n \"Yes do, Adam,\" added his wife, turning to him; \"you will get the pain in your hip again. Do you wish me to go away?\" she added to Karl, as she prepared to gather up her working materials. \n \n \"No, no, Rose: it\u0027s only the old story, I know--the wanting to get rid of me,\" interposed Sir Adam, sitting down himself. \"Stay where you are, wife. Now for it, Karl.--Wait a moment, though\" he added, ringing the bell. \n \n It was answered by the same staid, respectable-looking servant seen by Miss Blake; the same confidential woman who had lived with Mrs. Andinnian at Weymouth--Ann Hopley. \n \n \"Ann, I am as thirsty as a fish,\" said her master. \"Bring up a bottle of soda-water and a dash of brandy.\" \n \n \"Yes, sir,\" she replied--not daring now or at any other time to give him his title. \n \n He opened the soda-water himself when it was brought, put in the brandy, drank it, and sat down again. Karl Andinnian began to speak, feeling an innate certainty that his words would be wasted ones. \n \n But some explanation of the past is necessary, and it may as well be given here. \n \n When Karl Andinnian went down from London to Weymouth upon the news of his brother\u0027s attempted escape and death, he found his mother in a dreadful state of distress--as already related. This distress was not put on: indeed such distress it would not be possible to assume: for Mrs. Andinnian believed the public accounts--that Adam was dead. After she had despatched Karl to Foxwood to make arrangements for the interment, the truth was disclosed to her, Sir Adam had escaped with life, and was lying concealed in Weymouth; but he had been terribly knocked about in the scuffle, and in fact had been considered dead. By the careless stupidity of one of the warders, or else by his connivance, Mrs. Andinnian never entirely knew which, he was reported at the prison as being dead--and perhaps the prison thought itself well rid of so obstreperous an inmate. The warders had said one to another from the time he was first put there, that that Andinnian gentleman had \"mischief\" in him. Further explanation may be given later on in the story: at present it is enough to say that Adam Andinnian escaped. \n \n When Mrs. Andinnian arrived with the body (supposed to be her son\u0027s) at Foxwood, she then knew the truth. Adam was not dead. He was lying somewhere in great danger; they would not, from motives Of prudence, allow her to know where; but, dead he was not. Not a hint did she disclose of this to Karl; and he stood by her side over the grave, believing it was his brother that was placed in it. She called him Sir Karl; she never gave him a hint that his succession to the title and estates was but a pseudo one; she suffered him to depart in the false belief. Perhaps she did not dare to speak of it, even to him. Karl went abroad, re-met Lucy Cleeve, and became engaged to her. He caused the marriage settlements to be drawn up and signed, still never dreaming that he had no legal right to settle, that the revenues were not his. Only when he went down to Foxwood, a day or two before his marriage, did he become acquainted with the truth. \n \n That was the dread secret disclosed to him by his mother; that, in her fear, she had made him take an oath to keep--\"Adam is not dead.\" Just at the first moment Karl thought her intellects must be wandering: but as she proceeded in a few rapid words to tell of his escape, of his dangerous illness, of his lying even then, hidden away from the terrors of the law, all the dreadful position of his ill-fated brother rushed over Karl as in one long agony. He saw in vivid colours the hazard Adam was running--and must ever run, until either death or recapture should overtake him; he saw as if portrayed in a mirror the miserable future that lay before him, the lonely fugitive he must be. \n \n To Karl Andinnian\u0027s mind, no fate in this world could be so miserable. Even death on the scaffold would to himself have been preferable to this lifetime of living dread. He had loved his brother with a keen love; and he felt this almost as a death-blow: he could have died in his love and pity, if by that means his brother might be saved. Mingling with this regret had come the thought of his own changed position, and that he ought not to marry. \n \n This he said. But Mrs. Andinnian pointed out to him that his position would not be so very materially altered. Such was her conviction. That she herself, by connivance with one of the warders, had mainly contributed to the step Adam had taken, that she had been the first to put it into his head, and set him on to attempt it, she was all too remorsefully conscious of. Now that he had escaped, and was entered in the prison rolls as dead, and lay hidden away in some hole or corner, not daring to come out of it, or to let into it the light of day, she saw what she had done. Not even to her might his hiding-place be disclosed. She saw that his future life must be, at the very best, that of a nameless exile--if, by good fortune, he could make his escape from his own land. If? His person was rather a remarkable one, and well known to his enemies the police force. Not one, perhaps, but had his photograph. A fugitive in some barren desert, unfrequented by man, where he must drag on a solitary life of expatriation! Not much of his income would be needed for this. \n \n \"You will have to occupy Foxwood as its master; you must be Sir Karl to the world as you are now,\" spoke Mrs. Andinnian; \"and it is your children who will inherit after you. There is no reason whatever for breaking off your marriage, or for altering any of the arrangements. You will have to pay a certain sum yearly to Adam out of the estate. He will not need it long, poor fellow; a man\u0027s life, banned to the extent his will be, eats itself away soon.\" \n \n Hemmed in by perplexities of all kinds, Karl\u0027s interview with his mother ended, and he went forth with his care and trouble. His own trouble would have been enough, but it was as nothing to that felt for his brother. He dared not tell the truth to Colonel Cleeve or to Lucy, or impart the slightest hint that his brother was alive; he almost as little dared, for Lucy\u0027s sake, to break off the marriage. And so it took place. \n \n After that, he heard no more until he was again at Foxwood, summoned thither by his mother\u0027s illness. Mrs. Andinnian had fretted herself sick. Night and day, night and day was the fear of her son\u0027s discovery ever before her mind; she would see the recapture in her dreams: remorse wore her out, and fever supervened. She would have given all she possessed in the world could he be safely back at Portland Island without having attempted to quit it. Karl, on his arrival, found her in this sad state: and it was then she disclosed to him a further complication in the case, which she had but recently learnt herself. Sir Adam Andinnian was married. \n \n It may be remembered that he was for a few days absent from his home in Northamptonshire, returning to it only on the eve of the day that news came of Sir Joseph\u0027s death, the fatal day when he killed Martin Scott. He had left home for the purpose of marrying Rose Turner, who was staying in Birmingham, a measure which had previously been planned between them. But for his mother\u0027s prejudices--as he called them--he would have married the young lady in the face of day; but he knew she would never consent, and he did not care openly to set her at naught. \"We will be married in private, Rose,\" he decided, \"and I will feel my way afterwards to disclose it to my mother.\" And Miss Rose Turner cared for him too much to make any objection. Alas, the time never came for him to disclose it. On the very day after his return to his home, the young lady returning to hers, to her unsuspicious friends, he was thrown into prison on the charge of murder. It was not a time to speak; he wished to spare comment and annoyance to her; and she gave evidence at the trial--which she could \u0027not have done had she been his acknowledged wife. All this had been disclosed to Mrs. Andinnian the day after Karl left to celebrate his marriage. The stranger, Mr. Smith, spoken of by Hewitt as presenting himself again that day at Foxwood, and demanding an interview with its mistress, told her of it then. It was another bitter blow for Mrs. Andinnian, and the distress of mind it induced no doubt helped to bring on the fever. This, in her turn, she disclosed to Karl later from her \n sick-bed; and for him it made the complication ten times worse. Had he known his brother had a wife, nothing would have induced him to marry Lucy. Mrs. Andinnian told him more; that Adam had escaped safely to London, where he then lay hidden, and where his wife had joined him; and that they were coming to inhabit the Maze at Foxwood. The last bit of news nearly struck Karl dumb. \n \n \"Is Adam mad?\" he asked. \n \n \"No, very sane,\" replied Mrs. Andinnian. \"He wants to be at least on his own grounds: and we all think--he and I and--no matter--that he may be safer here than anywhere. Even were there a suspicion abroad that he is alive--which there is not, and I trust never will be,--his own place is the very last place that people would look into for him. Besides, there will be precautions used--and the Maze is favourable for concealment.\" \n \n \"It will be utter madness,\" spoke Karl. \"It will be putting himself into the lion\u0027s mouth.\u0027 \n \n \"It will be nothing of the sort--or Mr. Smith would not approve of it,\" retorted Mrs. Andinnian. \"I must see my son, Karl: and how else am I to see him? I may not go to him where he is: it might bring suspicion on him; but I can go over to the Maze.\" \n \n \"Who is Mr. Smith?--and what has he to do with Adam?--and how comes he in the secret?\" reiterated Karl. \n \n But to this he could get no answer. Whether Mrs. Andinnian knew, or whether she did not know, she would not say. The one fact--that Mr. Smith held the dangerous secret, and must be conciliated, was quite enough, she said, for Karl Mr. Smith had Adam\u0027s safety and interest at heart, she went on to state; he wished to be near the Maze to watch over him; and she had given him the pretty cottage opposite the Maze gates to live in, calling him Sir Karl\u0027s agent, and appointing him to collect a few rents, so as to give a colouring of ostensibility to the neighbourhood. In vain Karl remonstrated. It was useless. The ground seemed slipping from under all their feet, but he could do nothing. \n \n After all, poor Mrs. Andinnian did not live to see her most beloved son. Anxiety, torment, restlessness, proved too much for her, and brought on the crisis sooner than was expected. On the very day after she died, the tenants came to the Maze--at least, all the tenants who would be seen openly, or be suspected of inhabiting it. They arrived by the last evening train; Mrs. Grey and her attendants, the Hopleys; and took two flies, which were waiting in readiness, on to the Maze; the lady occupying one, Hopley and his wife the other. How Adam Andinnian reached the place, it is not convenient yet to state. \n \n In the course of the next evening, Karl Andinnian went over to the Maze and saw his brother. Adam was much altered. In the fever, which had supervened on his injuries received at the escape, he had lost his hair and become pale and thin. But his spirits were undaunted. He should soon \"pick up\" now he was in the free open country air and on his own grounds, he said. As to danger, he seemed not to see it, and declared there was less risk of discovery there than anywhere else. Karl could play the grand man and the baronet for him at Foxwood--but he meant, for all that, to have a voice in the ruling of his own estate. Poor Karl Andinnian, on the contrary, saw the very greatest danger in the position of affairs. He would have preferred to shut up Foxwood, leaving only Hewitt to take care of it, that no chance of discovery should arise from either servants or other inhabitants there. But Sir Adam ruled it otherwise; saying he\u0027d not have the Court left to stagnate. Hewitt was in the secret. It might have been neither expedient nor practicable to keep it from him: but the question was decided of itself. One evening just before Mrs. Andinnian\u0027s death, when Hewitt had gone to her sick-room on some errand at the dusk hour, she mistook him for Karl; and spoke words which betrayed all. Karl was glad of it: it seemed a protection to Adam, rather than not, that his tried old servant should be cognizant of the truth. So Karl went abroad again with his wife, and stayed until his keeping aloof from Foxwood began to excite comment in his wife\u0027s family; when he deemed it more expedient to return to it. \n \n And now does the reader perceive all the difficulties of Karl Andinnian? There he was, in a false position: making believe to be a baronet of the realm, and a wealthy man, and the owner of Foxwood: and obliged to make believe. A hint to the contrary, a word that he was not in his right place, might have set suspicion afloat--and Heaven alone knew what would then be the ending. For Adam\u0027s sake he must be wary and cunning; he must play, so to say, the knave\u0027s part and deceive the world. But the dread of his brother\u0027s discovery lay upon him night and day, with a very-present awful dread: it was as a burning brand eating away his heart. \n \n And again--you, my reader, can now understand the complication between Karl and his wife. He believed she had discovered the fact that Adam was alive and living concealed at the Maze; she, relying on Miss Blake\u0027s information, put down the Maze mystery to something of a very different nature. How could he suppose she meant anything but the dangerous truth? How could she imagine that the secret was any other than Miss Blake had so clearly and convincingly disclosed to her? In Lucy\u0027s still almost maidenly sensitiveness, she could not bring her lips to allude openly to the nature of her charge: and there was no necessity: she assumed that Karl knew it even better than she did. In his reluctance to pronounce his brother\u0027s name or hint at the secret, lest even the very air should be treacherous and carry it abroad, he was perhaps less open than he might have been. When he offered to relate to her the whole story, she stopped him and refused to listen: and so closed up the explanation that would have set the cruel doubt right and her heart at rest. \n \n Sitting there with Adam to-night, in that closely curtained room, Karl entered upon the matter he had come to urge--that his brother should get away from the Maze into some safer place. It was, as Sir Adam expressed it, but the old story--for Karl had never ceased to urge it from the first--and he wholly refused to listen. There was no risk, he said, no fear of discovery, and he should not go away from his own land. Either from this little particular spot of land which was individually his, or from the land of his birth. It was waste of words in Karl to speak further. Adam had always been of the most obstinate possible temperament. But the (supposed) discovery of his wife had frightened Karl worse than ever. He did not mention it to them, since he was not able to say how Lucy had made it. \n \n \"As sure as you are living, Adam, you will some day find the place entered by the officers of justice!\" he exclaimed in pain. \n \n \"Let them enter it,\" recklessly answered Sir Adam. \"They\u0027ll not find me.\" \n \n \"Oh, Adam, you don\u0027t know. They are lynx-eyed and crafty men.\" \n \n \"No doubt. I am all safe, Karl.\" \n \n Karl had been there longer than usual, and he rose to say good night. Mrs. Grey--for convenience sake we must continue to call her by that name, and Lucy Lady Andinnian--folded up her work and went downstairs with him. She was changed too; but for the better. The very pretty, blooming-faced Rose Turner had come in for her share of the world\u0027s bitter trouble, and it had spiritualized her. The once round face was oval now, the lovely features were refined, the damask cheeks were a shade more delicate, the soft blue eyes had a sad light in them. Miss Blake\u0027s words were not misapplied to her--\"beautiful as an angel.\" \n \n \"Karl,\" she whispered, \"the dread of discovery is wearing me out. If we could but get away from England!\" \n \n \"I am sure it will wear out me,\" was Karl\u0027s answer. \n \n \"Adam is afraid of Mr. Smith, I am sure. He thinks Smith would stop his going. Karl, I fully believe, as truly as I ever believed any great truth in my life, that Mr. Smith is keeping us here and will not let us go. Mr. Smith may appear to be a friend outwardly, but I fear he is an inward enemy. Oh, dear! it is altogether a dreadful situation.\" \n \n Karl went on home, his brain active, his heart sinking. The manner in which his wife had taken up the matter, distressed him greatly. He supposed she was resenting it chiefly on the score of her father and mother. The colonel had told him that they would rather have followed Lucy to the grave than see her his wife had Sir Adam lived. \n \n \"I wonder how she discovered it?\" ran his thoughts--but in truth the fact did not excite so much speculation in his mind, because he was hourly living in the apprehension that people must suspect it. When we hold a dangerous secret, this is sure to be the case. \"Perhaps Hewitt let drop an incautious word,\" he went on musing, \"and Lucy caught it up, and guessed the rest. Or--perhaps I dropped one in my sleep.\" \n \n Crossing the lawn of the Court, he entered by the little smoking-room, his hand pressed upon his aching brow. No wonder that people found fault with the looks of Sir Karl Andinnian! He was wearing to a skeleton. Just as his mother, when she was dying, used to see the \n recapture of Adam in her dreams, so did Karl see it in his. Night after night would he wake up from one of the dreadful visions. Adam, the retaken convict, held fast by a heap of scowling, threatening warders, and a frightful scaffold conspicuous in the distance. He would start up in bed in horror, believing it all real, his heart quivering, and once or twice he knew that he had cried out aloud. \n \n \"Yes, yes, that\u0027s how it must have been,\" he said, the mystery becoming apparently clear to his eyes as the light of day. \"Hewitt is too cautious and true. I have betrayed it in my sleep. Oh, my brother! May Heaven help and save him!\" \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2701/74242.html","bookId":1457,"book":{"id":1457,"title":"Within the Maze","description":"简介： The house was ugly and old-fashioned, with some added modern improvements, and was surrounded by a really beautiful garden. Though situated close upon a large market town of Northamptonshire, it stood alone, excluded from the noise and bustle of the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2701","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
