{"id":32531,"no":42,"title":"CHAPTER XX. At the Red Dawn.","content":"Foxwood was going on quietly with the approach of winter. Mrs. Cleeve had gone to London with her daughter; leaving Miss Blake to keep house at the Court. Some ladies, fearing the world\u0027s chatter, might have objected to remain with so young and attractive a man as Sir Karl Andinnian; Miss Blake was a vast deal too strong-minded for any thought of the kind. She was busy as ever with St. Jerome\u0027s and its offices; but she nevertheless kept a tolerably keen look-out on the Maze and on Sir Karl\u0027s movements as connected with it. He went there more than he used to do: by day now as well as by night: and she wondered how long the simple neighbourhood would keep its eyes closed to facts and figures, that, to her, were so offensively plain. \n \n There had been a sharpish frost in the night, but the glorious morning sun had chased its signs away. At midday it was shining hotly; and Karl was almost glad of the thin screen of leaves left in the labyrinth as he made his way through it. Some days had passed now since Adam had had any sharp amount of illness: he was wasting away rapidly, and that was the worst outward sign. But his will in these intervals of ease was indomitable, and it imparted to him a fictitious strength. \n \n As Karl came in view of the lawn, he saw Rose standing by one of the distant beds, talking to Hopley. The old man was digging; and had bent himself nearly double over his work. Karl crossed over, a reprimand on his lips. \n \n \"Adam, you should not. You promised me you would not again take a spade or other gardening implement in your hand. Your strength is not equal to it, and it must do you harm.\" \n \n \"Just hark at him, Rose. It would not be Karlo if he did not find fault with me. What shall you do for somebody to croak at, brother mine, when I am gone?\" \n \n Was it Hopley who spoke?--or was it Sir Adam? The falling-in mouth and the speech, the crooked back, the tottering and swelling knees, the smock-frock and the red comforter and the broad straw hat, all were Hopley\u0027s. But the manner of speech and the eyes too, now you came to see them as he looked up at Karl, were Sir Adam\u0027s. \n \n Yes. They were one and the same. Poor old Hopley the gardener was but Sir Adam in disguise. With the padded knees and the false hump he had managed to deceive the world, including Mr. Detective Tatton. He might not perhaps have so surely deceived Mr. Tatton had the latter been looking after Sir Adam Andinnian and been acquainted with his person. But the decrepid gardener bore no resemblance to Philip Salter: and, that fact ascertained, it was all that concerned Mr. Tatton. \n \n It may be remembered that when Mrs. Andinnian was staying at Weymouth, she and her servant, Ann Hopley, were in secret communication with one of the warders of Portland Prison: in point of fact, they were negotiating with him the possibilities of Sir Adam\u0027s escape. This man was James Hopley; a warder--as Karl had taken him to be, and also Ann\u0027s husband. In the scuffle that took place the night of the escape, the man really killed was the other prisoner, Cole: and it was he who was taken to Foxwood and lay buried in its churchyard. Hopley was drowned. \n \n At that period, and for some little time before it, Philip Smith was at Portland Prison. Not as a prisoner: the man had never in his life done aught to merit incarceration: but seeking employment there, through the interest of one of the chief warders who was a friend of his--a man named O\u0027Brian. From the date of the frauds of Philip Salter, Philip Smith had been--as he considered it--a ruined man: at any rate he was unable to obtain employment. A ruined man must not be fastidious, and Smith was willing and was anxious to become a warder if they would make him one. It was while he was waiting and hoping for the post, and employed sometimes as an assistant, and thoroughly trusted, that the attempted escape of the prisoners occurred. Smith was one of those who put off in the boat after the fugitives: the other two being Hopley and O\u0027Brian. In the scuffle on the Weymouth shore, Sir Adam was wounded and left for dead. O\u0027Brian saw him lying there apparently dead, and supposed him to be so. O\u0027Brian, however, afterwards received a blow that stunned him--for the night was dark, and friends and foes fought indiscriminately--and Smith contrived to get Adam away into a place of concealment. It is very probable that Smith foresaw in that moment how valuable a prize to him the living and escaped Sir Adam might become. O\u0027Brian really believed him to be dead, and so reported him to the authorities. A dead man is worthless: and Sir Adam was allowed to be retained by his friends for interment: the beaten and disfigured Cole, shot in the face, being looked upon as Sir Adam. \n \n After that, the path was easy. Sir Adam, very badly injured, lay for many weeks hidden away. Smith continued at Portland Prison keeping his own counsel, and unsuspected, visiting Sir Adam cautiously at intervals. As soon as it was practicable for him to be moved, the step was ventured on. He was got away in safety to London, and lay in retirement there, in a house that had been taken by Smith: his wife (formerly Rose Turner) coming up to join him; and Ann Hopley, faithful to Sir Adam\u0027s fortunes through all, waiting on them. She had no one else left to be faithful to now, poor woman. Smith managed everything. He had withdrawn himself from Portland Island, under the plea that he could no longer, in consequence of his disabled arm, aspire to a wardership--for his arm had been damaged that fatal night, and it was thought he would never have the full use of it again. The plea was unsuspiciously recognised by the prison authorities; Smith retained his friendship with O\u0027Brian, and occasionally corresponded with him, getting from him scraps of useful information now and then. From that time his services were devoted to Sir Adam. It was he who communicated between Sir Adam and his mother; for, letters they did not dare to transmit. It was he who first disclosed to Mrs. Andinnian the fact that Miss Rose Turner was her son\u0027s wife; it was he who made the arrangements for Sir Adam\u0027s taking up his abode at the Maze, and provided the disguise to arrive at Foxwood in, as the decrepid old husband of the servant, Ann Hopley. To do Mr. Smith justice, he had fought against the scheme of coming to the Maze; but Mrs. Andinnian and Adam were both bent upon it; and he yielded. Adam and his wife had stayed in London under the name of Mrs. Grey, and she retained it. \n \n Amidst the injuries Sir Adam received was one to the mouth and jaw. It destroyed those beautiful front teeth of his. After his recovery he sought the services of a clever but not much known dentist named Rennet, went to the pain of having the rest of his teeth extracted, and an entire set of false ones made. Two sets, in fact. The journey Rose took to London, when Miss Blake espied her with Karl, was for the purpose of getting one of these sets of teeth repaired, Sir Adam having broken the spring the night before. The teeth had to be conveyed personally to Mr. Rennet and brought away; for they were too cautious to entrust him with their address. \n \n And now it will be seen how Sir Adam had concealed himself at the Maze. In the daytime he was the toothless, hump-backed, infirm old Hopley, working at his garden with enlarged knees and tottering steps: as soon as dusk came on, his false padding was thrown of with his smock frock and coarse clothes, and he was the well-bred gentleman, Sir Adam Andinnian, in his evening attire and with his white and even teeth. His assumed role was maintained always during the day; his meals were taken in the kitchen to be safe in case of any possible surprise, Ann attending upon him with all respect. The delay in admitting Nurse Chaffen, kept waiting once on the wrong side of the kitchen door, was caused by \"Hopley\u0027s\" taking out his set of teeth and putting on his broad-brimmed hat: for it was convenient to assume the teeth during the short period devoted to dinner. The deafness was of course assumed as an additional precaution. Thus he had lived, in a state of semi-security, tending his flowers and occupied with the care of his garden generally, an employment that he loved so well. The day that General Lloyd\u0027s party went in, Karl was transfixed with apprehension and amazement to see Hopley showing himself. Adam enjoyed it: it was so like him to brave things; and he feared no danger from a pleasure party like that. \n \n Well, I think that is all that is needed in the way of explanation; and we can go on. Karl was looking at the digging with regretful eyes. \n \n \"You ought to be glad to see me at work again, Karl, instead of groaning over it,\" cried Sir Adam. \n \n \"And so I should be, Adam, only that I fear you will feel its effects unpleasantly by and by.\" \n \n \"I asked him not to do it, but he only laughed at me,\" said Rose. \n \n \"Somebody must do it. I can\u0027t see the garden quite neglected. Besides, if I am well enough to work there\u0027s no reason why I should not. I am not sure, Karl, but I shall cheat you now.\" \n \n \"Cheat me?\" \n \n \"By getting well. What should you say to that?\" \n \n \"Thank heaven for it: and do my best to get you away to a place of safety.\" \n \n \"By George, old fellow, I don\u0027t know that I shan\u0027t. I am feeling as blithe as a bee. Rose, take yourself a trifle further off; out of the mould.\" \n \n He was throwing about the spadefuls almost as well as he had ever thrown them in his strength. Rose was cheated into something like hope, and her face for the moment lost its sadness. \n \n \"I wish to goodness I had a draught of beer,\" cried Adam. \"Where\u0027s Ann, I wonder.\" \n \n Karl went to fetch it. Ann Hopley shook her head at the idea of hope, when Karl spoke of it as she gave him the beer. \n \n \"You never saw any person, who was to live on, have the look in his face that he has, sir.\" \n \n \"He looks fairly well to-day.\" \n \n \"And so he will at times to the last, as it strikes me. I have had a good deal of experience in illness, sir. As to his talking about getting well--why, sir, you know what he is: saying this and that without meaning it. There\u0027s no doubt he feels pretty sure himself how it will be.\" \n \n Karl sighed as he went back with the beer. Yes, there was no real hope. \n \n That same night--or rather on the following morning, for the dawn was more than glimmering--Karl in his bed began to dream that he was out in a shower of hail. It seemed to be falling with great violence: so much so that a sharper crash awoke him. Lying awake for a moment and questioning where he was, he found the noise to be reality. The hail was beating on the chamber windows. \n \n Was it hail? Scarcely. It was crashing but on one window, and only came at intervals. It sounded more like gravel. Karl rose and opened the window. Smith the agent stood underneath. A prevision of evil shook Karl as he leaned out. \n \n \"He is very ill indeed, sir,\" said Smith in the lowest whisper possible to be heard, and extending his finger to indicate the Maze. \"Mr. Moore\u0027s there and thinks it will be for death. I thought you would like to know it.\" \n \n \"How did you hear it?\" asked Karl. \n \n \"Ann Hopley ran over and knocked me up, that I might go for the doctor.\" \n \n \"Thank you,\" replied Karl. \"I\u0027ll be there directly.\" \n \n Now it so happened that for some purposes of cleaning--for the Court was not exempt from those periodical visitations any more than the humble dwelling of Mrs. Chaffen--Miss Blake\u0027s chamber had been temporarily changed to the one next to that recently occupied by Lady Andinnian. Miss Blake was in the habit of sleeping with her window open; and, not being asleep at the time, she had heard Mr. Smith\u0027s footsteps and the crashes at Sir Karl\u0027s window. Of course she was curious as to what could cause the noise, and at first thought of housebreakers. Had Mr. Smith chanced to turn his head in the right direction during the colloquy with Sir Karl, he might have seen an elaborately night-capped head peeping forth cautiously. \n \n \"Why, it is Mr. Smith!\" thought Miss Blake, as he walked away. \"What an extraordinary thing! He must have been calling up Sir Karl.\" \n \n Listening inside as well as out, Miss Blake heard the bell that was in Hewitt\u0027s chamber ring gently; and, after a minute or two, the latter proceeding to his master\u0027s room. Then they both went down together, and Hewitt let Sir Karl out at the hall door, and came upstairs again. Miss Blake, after a good deal of self-puzzling, arrived at the conclusion that the affair must be in some way connected with poachers--who had been busy on the land latterly--and returned to her bed. \n \n With death on his face, and a look of resignation than which nothing could be more peaceful, lay Sir Adam for the last time. His weary life, with all its bitter turmoil, was nearly at an end; night here was closing, morning there was opening. Karl\u0027s grey eyes were wet as he bent over him. \n \n \"Don\u0027t grieve too much,\" said Adam with a smile, as he put his cold hand into Karl\u0027s clasp. \"You know how much better off I shall be. Rose knows it.\" \n \n \"You were so full of hope yesterday, Adam.\" \n \n \"Was II It cheated the wife into a few hours of pleasantness, and did its mission. I did not think I took you in. Why, Karlo, I have just been waiting from day to day for what has now come: moreover, I have seen how much best it all is as it is than anything else would be. I would not accept life if you\u0027d give it to me, unless the whole time since that Midsummer Eve could be blotted out.\" \n \n Karl swallowed a sob. \n \n \"You don\u0027t know what it has been, Karl. No one can know what it is to live under a hanging sword, as I have, unless they experience it. And few in this world can do that. It was all a mistake together. The shooting of Scott when I ought to have horsewhipped him; the escape from Portland; the taking up my abode here; everything: and these mistakes, Karl, have to be worked out. I have paid for mine with life.\" \n \n Karl did not answer. He was only nervously pressing the wasted hand in his. \n \n \"It is all, I say, for the best. I see it now. It was best that the little lad should go; it is best that I should; it is best that you should be the true owner of Foxwood. It would have been too much of a complication otherwise. The boy could never have put forth a claim to it while I lived; and, after that, people might but have pointed their scornful finger at him as the son of a convict. I thank God for taking him.\" \n \n \"Should you talk so much, Adam?\" \n \n \"I don\u0027t know. A man in my condition, about to leave the world behind, prefers to talk while he can. You will take care of my wife, Karl. There was no settlement, you know, and----\" \n \n \"I will take care of her to the best of my power, Adam,\" came the earnest interruption. \"She shall have a proper and suitable jointure as the widowed Lady Andinnian.\" \n \n \"No, Karl; not that. She and I have talked over the future at odd moments, and we do not wish it. Rose does not mean to acknowledge her marriage with me, or to live in any kind of state in accordance with it. She will be Mrs. Grey to the end. Unless, indeed, any occasion were to arise, such as a tarnishing breath of scandal brought against this past period of her life. Then, of course, the truth must be declared, and you, Karl would have to come forward and testify to it. I leave that in your hands.\" \n \n \"With every surety,\" assented Karl. \n \n \"A few hundreds a year, say four or five, are all that she will want from you, or take. Her late uncle\u0027s money must come to her sometime, and that of itself would be almost enough. She purposes to live a retired life with her aunt; and I think it will be the happiest for her. In my desk, Karl, you will find a paper in my handwriting, setting forth all these wishes of hers and mine; it will serve as a direction for you.--No,\" he went on, after a pause, \"for her own peace, the world must never know her as Lady Andinnian. She dreads it too much. See you not the reason? She would have to stand before the public convicted of perjury. That past trial is rarely out of her mind, Karl--when she appeared falsely as Miss Rose Turner. The foolish things people do in their blindness! It was my fault. Her fault lay only in obeying me: but your charitable people would not accept that as an excuse. Be it as it may, Karl, Rose\u0027s life henceforth will be one of modest position and strict retirement. Ann Hopley goes with her.\" \n \n Looking at the matter from all points of view, it might be, as Sir Adam said, for the best. \n \n \"And you will be Sir Karl in reality as well as in seeming, brother mine; and Foxwood will be your true home and your children\u0027s after you. That is only justice. When you arranged to marry Lucy Cleeve, you deemed yourself to be the inheritor, and she deemed it. My death will set all right. And now about Smith, Karl. The man did me a great service, for I should have been retaken but for him; and he has been faithful to me since. I should like you to allow him something in the shape of an annuity--a hundred and fifty pounds a year, or so. Not the cottage: he will not stay in this neighbourhood when I am gone. It was through me that his arm got injured: which, of course, partly incapacitates him for work; and I think I am bound to provide for him.\" \n \n \"It shall be done,\" said Karl. \"Ungrudgingly.\" \n \n \"I have mentioned it in the paper, and the sum. He--he--he--\" \n \n Sir Adam\u0027s hesitation was caused by faintness. He broke down, and for the time said no more. Nor did he recur to the subject again. \n \n The day went on, Adam partially sleeping through it. At other times he lay in a kind of stupor. Mr. Moore attended at intervals; but nothing further could be done. At dusk Hewitt came over for a last sight of his old master; for a last farewell: and he sobbed bitterly as he said it. \n \n Karl did not go home--at which Miss Blake was in much private wonder. Discarding the poacher theory, she shrewdly suspected now that he must be at the Maze, taking the opportunity of his wife\u0027s absence to play the gay bachelor away from home. She asked Hewitt, she questioned Giles; Giles knew nothing, Hewitt fancied Sir Karl, might be \"detained at Basham\" on some business. \n \n And so, the night set in. When quite awake Adam had the full possession of his senses, and exchanged a few words, sometimes with his wife, sometimes with Karl. About three o\u0027clock he fell into a calm sleep. Karl watched on; Rose, weak and sick and weary, dropped into a doze in a distant chair. Ann Hopley was in the kitchen below. \n \n Save for the faint sighing of the wind as it swept round the house, stirring the branches of the trees, there was no sound to be heard. Stillness reigned unbroken in the dying chamber. How many of us have kept these watches! But who has kept them as this was being kept by Karl Andinnian! \n \n With that bitter aching of the heart known but to few, and which when felt in its greatest intensity is the saddest pain the troubles of the world can give, Karl sat gazing on his brother. In his love for him, every pang endured by Adam in the past was a sting for him, every hazard run had reflected on him its dread apprehension. He sat thinking of what might have been; looking on what was: and an awful regret, than which nothing like unto it could be ever again experienced, tore at his heart-strings for the wasted life, cut short ere it had reached its prime. More than willingly in that moment would Karl have given his own remaining days to undo what his brother had done, and to restore to him freedom and honour. It might not be. Adam\u0027s course was run: and he was passing away in obscurity from the world in which he had virtually no longer a place. Never for a moment did the immunity from perplexity it would bring to himself or the release from the false position he had been compelled to assume, occur to Karl; or, if it did, it was not dwelt upon: all of self and self-interest was lost in the regret and grief for his brother. He saw Adam living at Foxwood Court with his wife; its master; held in repute by men; he saw himself settled near with Lucy; his fortunes advanced by his brother\u0027s aid to a position not unacceptable to Colonel Cleeve; he saw his mother alive still and happy: a united family, enjoying comfort the one with the other. This might have been. His mother dead of a broken heart; Adam, dying before his eyes, an escaped fugitive; his own life blighted with pain and sorrow unutterable for Adam\u0027s sake, his wife estranged from him--this was what was. Be you very sure that no earthly pang could be keener than that despairing heart-ache felt by Karl Andinnian. \n \n How many a night at that still hour had Adam lain in his terror, listening to this moaning wind with supernaturally quick ear, lest it should be only covering other sounds--the approach of his deadly enemies! How many times in a night had he quitted his bed, his heart beating, and stolen a cautious peep beside the blind to see whether they might not be there, in battle array, waiting until the dawn should come and they might get in to take him! Ah, it was all at an end now; the fever, and the fear, and the wasting restlessness. Why! if the men were drawn up round his bed, they would not care to touch him. But the terror from force of habit stayed with him to the last. \n \n He started up. How long he had slept, and how the night was going, Karl in his abstraction hardly knew. Adam\u0027s eyes looked somewhat wild in the shade of the night-light, and he put up his feeble hand. \n \n \"What is it?\" asked Karl gently. \n \n \"I thought they were here, Karl; I saw them in the room,\"--he whispered--and his eyes went round it. \"They had muskets I think. Was it a dream?\" \n \n \"Nothing but a dream, Adam. I am with you. Rose is asleep in the arm-chair.\" \n \n \"Ay. I have not dreamt of them for a week past. Stay by me, Karlo.\" \n \n Karl would have risen to administer some cordial: but Adam was holding his hand in a tight grasp; had shut his eyes, and seemed to be dropping asleep again. \n \n He slept about half-an-hour, and Karl\u0027s imprisoned arm went from a state of pins and needles into the cramp. When Adam awoke, there was a smile on his face and a peaceful rest in his eyes. He was quite collected. \n \n \"Karl, I dreamt of them again: but they had turned to angels. They were here, all about my bed. Oh Karl, I wish you could see them as I saw them! you\u0027d never be afraid of anything more in this world. What\u0027s that?\" \n \n Karl turned round: for Adam\u0027s eyes were fixed on something or other behind him. He could see nothing save a streak of light, herald of the dawn, that came in at the side of the blind. \n \n \"Do you mean the light, Adam? It\u0027s the dawn breaking.\" \n \n \"Ay. My dawn. Draw up the blind. Karl.\" \n \n Softly, not to awake Rose, Karl drew it up. Rose-coloured clouds, heralds of a beauteous sunrise, flooded the East. Adam lay and gazed at it, the smile on his face changing to a rapt look that seemed to speak of heaven, more than of earth. \n \n \"It will be better there than here, Karl. For me.\" \n \n \"Better for all of us.\" \n \n \"I am very happy, Karl. The world is fading from me: heaven opening. Forgive me all that I have cost you.\" \n \n Karl\u0027s heart and eyes were alike full. \n \n \"Just as the men who had troubled me were changed into angels, so my fear has changed to rest. The angels are about the bed still, Karl; I know they are; waiting for me. The same lovely light shone on them that is shining yonder; and they told me without words that they were come to bear me up to God. I read it in their tender faces--so full of pitying love for me. It won\u0027t be so very long, Karl: you\u0027ll come later.\" \n \n Karl\u0027s tears were falling on the up-turned face. \n \n \"I should like to have seen your wife, Karl; just once. Tell her so, with my love. Ask her to forgive me the worry I know I have caused her.\" \n \n \"I will, I will.\" \n \n \"Oh, Karl, it has been a dreadful life for me; you know it has. I began to think that God had forgotten me--how foolish I was! He was full of mercy all the while, and kept me here in safety, and has now changed it all into peace. Listen, Karl! there\u0027s a sound of sweet music.\" \n \n Karl could hear nothing but the wind. \n \n \"It is the angels singing,\" whispered Adam, a smile of ineffable beauty on his face. \"They sing on the journey, you know. Goodbye, Karl, goodbye!\" \n \n Karl bent his face, his tears streaming, his heart aching. These partings are too bitter to be told of. This was most essentially so. \n \n \"Where\u0027s Rose, Karl?\" \n \n She was already by Karl\u0027s side. He yielded his place to her, and went down to Ann; and there sobbed over the kitchen fire as a woman might have done. \n \n But in the midst of it all, he could say as his brother had done, \"Thank God.\" If ever a poor sinful weary man had need to rejoice that he was removed to that better world, it was Adam Andinnian. \n \n Rose\u0027s bell called Karl up again. The last moment was at hand. Ann Hopley followed: and they all stood round the bed and saw him die. The red clouds had dispersed; the sun was just showing itself above the verge of the horizon. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2701/74268.html","bookId":1457,"book":{"id":1457,"title":"Within the Maze","description":"简介： The house was ugly and old-fashioned, with some added modern improvements, and was surrounded by a really beautiful garden. Though situated close upon a large market town of Northamptonshire, it stood alone, excluded from the noise and bustle of the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2701","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
