{"id":26489,"no":5,"title":"Chapter 5","content":"The rumour spread over all Ethiopia and the neighbouring kingdoms that King Balthasar had ceased to love Balkis. When the tidings reached the country of Sheba, Balkis was as indignant as if she had been betrayed. She ran to the King of Comagena who was employing his time in forgetting his country in the city of Sheba. “My friend,” she cried, “do you know what I have just heard? Balthasar loves me no longer!” “What does it matter,” said the King of Comagena, “since we love one another?” “But do you not feel how this blackamoor has insulted me?” “No,” said the King of Comagena, “I do not.” Whereupon she drove him ignominiously out of her presence, and ordered her grand vizier to prepare for a journey into Ethiopia. “We shall set out this very night. And I shall cut off your head if all is not ready by sundown.” But when she was alone she began to sob. “I love him! He loves me no longer, and I love him,” she sighed in the sincerity of her heart. And one night, when on his tower watching the miraculous star, Balthasar, casting his eyes towards earth, saw along black line sinuously curving over the distant sands of the desert like an army of ants. Little by little what seemed to be ants grew larger and sufficiently distinct for the king to be able to recognise horses, camels and elephants. The caravan having approached the city, Balthasar distinguished the glittering scimitars and the black horses of the guards of the Queen of Sheba. He even recognised the queen herself, and he was profoundly disturbed, for he felt that he would again love her. The star shone in the zenith with a marvellous brilliancy. Below, extended on a litter of purple and gold, Balkis looked small and brilliant like the star. Balthasar was conscious of being drawn towards her by some terrible power. Still he turned his head away with a desperate effort, and lifting his eyes he again saw the star. Thereupon the star spoke and said: “Glory to God in the Heavens and peace on earth to men of good will! “Take a measure of myrrh, gentle King Balthasar, and follow me. I will guide thee to the feet of a little child who is about to be born in a stable between an ass and an ox. “And this little child is the King of Kings. He will comfort all those who need comforting. “He calls thee to Him, O Balthasar, thou whose soul is as dark as thy face, but whose heart is as guileless as the heart of a child. “He has chosen thee because thou hast suffered, and He will give thee riches, happiness and love. “He will say to thee: ‘Be poor joyfully, for that is true riches.’ He will also say to thee: ‘True happiness is in the renunciation of happiness. Love Me and love none other but Me, because I alone am love.’” At these words a divine peace fell like a flood of light over the dark face of the king. Balthasar listened with rapture to the star. He felt himself becoming a new man. Prostrate beside him, Sembobitis and Menkera worshipped, their faces touching the stone. Queen Balkis watched Balthasar. She realised that never again would there be love for her in that heart filled with a love divine. She turned white with rage and gave orders for the caravan to return at once to the land of Sheba. As soon as the star had ceased to speak, Balthasar and his companions descended from the tower. Then, having prepared a measure of myrrh, they formed a caravan and departed in the direction towards which they were guided by the star. They journeyed a long time through unknown countries, the star always journeying in front of them. One day, finding themselves in a place where three roads met, they saw two kings advance accompanied by a numerous retinue; one was young and fair of face. He greeted Balthasar and said: “My name is Gaspar. I am a king, and I bear gold as a gift to the child that is about to be born in Bethlehem of Judea.” The second king advanced in turn. He was an old man, and his white beard covered his breast. “My name is Melchior,” he said, “and I am a king, and I bring frankincense to the holy child who is to teach Truth to mankind.” “I am bound whither you are,” said Balthasar. “I have conquered my lust, and for that reason the star has spoken to me.” “I,” said Melchior, “have conquered my pride, and that is why I have been called.” “I,” said Gaspar, “have conquered my cruelty, and for that reason I go with you.” And the three mages proceeded on their journey together. The star which they had seen in the East preceded them until, arriving above the place where the child lay, it stood still. And seeing the star standing still they rejoiced with a great joy. And, entering the house they found the child with Mary his mother, and prostrating themselves, they worshipped him. And opening their treasures they offered him gold, frankincense and myrrh, as it is written in the Gospel. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3031/83815.html","bookId":1063,"book":{"id":1063,"title":"Balthasar And Other Works - 1909","description":"简介： In those days Balthasar, whom the Greeks called Saracin, reigned in Ethiopia. He was black, but comely of countenance. He had a simple soul and a generous heart The third year of his reign, which was the twenty-second of his age, he left his dominion...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3031","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
