{"id":38074,"no":8,"title":"CHAPTER VII. THE RITUAL USES OF VESTMENTS.","content":"We have now described the form and ornamentation of the different vestments worn by the clergy of the principal sections of Christendom; but we have only incidentally touched upon another and equally important matter, namely, when and how these vestments were worn, and the liturgical practices connected with them. A more extended account of these matters will be the subject of the present chapter. \\n\\n \\n\\n The non-reformed Western and Eastern Churches alone need occupy our attention. The vestment uses of the various reformed churches are practically nil, and all available details concerning these Churches have already been given in the preceding chapter. \\n\\n \\n\\n Vestments were obtained by a church or a cathedral in many ways. They were often embroidered for presentation to the church by ladies, {212} who found in the work of embroidery an easy and pleasant way of passing the time; or else by the inmates of nunneries as a religious work. Some were presented as expiatory offerings by conscience-stricken laymen; others bequeathed as a perpetual memorial by incumbents or prelates. Others, again, were purchased with money mulcted as compensation for sins. \\n\\n \\n\\n The first sacred function in which any vestment took part was its own benediction. This was always spoken by a bishop, and was in form of prayers said over all the vestments of a suit together, and the individual vestments separately. The following may be taken as specimens of these dedicatory prayers; it is unnecessary to occupy space in giving all, as complete sets can be found in any Pontifical: \\n\\n \\n\\n Benedictio omnium vestimentorum simul.—Omnipotens Deus qui per Moisen famulum tuum pontificalia et sacerdotalia ac levitica vestimenta ad explendum ministerium eorum in conspectu tuo, et ad decorem tui nominis, per nostre humilitatis servitutem pontificare ✠ benedicere ✠ consecrare digneris ✠ ut divinis cultibus et sacris misteriis apta et benedicta existant; hiisque sacris vestibus pontifices, sacerdotes seu levite tui induti ab omnibus impulsionibus seu temptacionibus malignorum spirituum muniti et defensi esse mereantur, tuisque ministeriis apte et condigne servire et inherere, atque in hiis placide tibi et devote perseverare tribue. Per Christum. Oremus. \\n\\n \\n\\n Deus invicte virtutis auctor, et omnium rerum creator ac sanctificator, intende propicius ad preces nostras, et hec indumenta {213} levitice et sacerdotalis glorie ministris tuis sumenda tuo ore proprio benedicere ✠ sanctificare ✠ et consecrare digneris omnesque eis utentes, tuis misteriis aptos, et tibi in eis devote et amicabiliter servientes gratos effici concedas. Per Christum Dominum. \\n\\n \\n\\n Benedictio Amicti.—Oremus. Benedic Domine quesume omnipotens Deus amictum istum levitici seu sacerdotalis officii et concede propicius ut quicumque eum capiti suo imposuerit benedictionem tuam accipiat; sitque in fide solidus et sanctitatis gravedine fundatus. Per Christum. Etc. \\n\\n \\n\\n The vestment thus dedicated was sprinkled with holy water after each prayer. \\n\\n \\n\\n The ritual uses of vestments may be conveniently described in two parts; discussing in the first the persons by whom they were worn, and, in the second, the occasions upon which, and the manner in which, they were worn. \\n\\n \\n\\n The vestments were distributed among the different orders of clergy in a manner similar to that in which the early vestments of the second period were allotted (see p. 28), but on a more complex system, as befitted their greater elaboration. Some hints of this system have already been given in the preceding pages; it will be convenient here to amplify this information. \\n\\n \\n\\n The seven orders of the Western Church are the three minor orders (ostiarius, lector, acolytus), and the four major orders (subdeacons, deacons, priests, and bishops; we may divide the last into three subdivisions, bishops proper, archbishops, {214} and the Pope). All ranks wore the alb, and all the major orders the maniple. All those above the rank of subdeacon wore amice and stole, and all above the rank of deacon the chasuble. Subdeacons were distinguished by the tunicle, deacons by the dalmatic; both vestments were added to the outfit of bishops, the latter with a remarkable distinction already described (p. 79). The stockings, sandals, subcingulum (originally), mitre, gloves, ring, and staff were peculiar to bishops and to certain abbots to whom these pontificalia had been expressly granted by the Pope.[95] Archbishops added the pall to this lengthy catalogue, and the Pope (who dispensed with the pastoral staff) reserved the orale, and in later times the subcingulum, for his exclusive use. \\n\\n \\n\\n We now turn to the consideration of the occasions upon which, and the manner in which, these vestments were worn. \\n\\n \\n\\n The vestments worn at the mass by the celebrant and his assistants were those which we have described under the heading of \u0027Eucharistic Vestments,\u0027 and of these one, the chasuble, was worn exclusively at this service and at no other. \\n\\n \\n\\n In Advent, and between Septuagesima and Easter, the deacons and subdeacons were directed {215} to substitute chasubles for their dalmatics or tunicles; and these chasubles were ordered to be worn, not in the usual manner, but folded, and passed across the breast like the diaconal stole. That is to say, the chasuble, which must have been of a flexible[96] material, was folded into a strip as narrow as possible, and secured over the shoulder and under the girdle of the alb. These were not to be worn during the whole service, however; the subdeacon had to remove his folded chasuble at the Epistle; at the Gospel the deacon had to cross his over the left arm, and so keep it till after the post-communion. \\n\\n \\n\\n There is but one representation of a deacon so vested known to exist in England. It is one of a series of sculptured effigies of ecclesiastics on the north-west tower of Wells Cathedral. These have been described by Mr St John Hope in \u0027Archæologia,\u0027 vol. liv. We give here the figure to which special reference is at present being made. Besides the chasuble, the effigy is vested in cassock, amice, alb, and girdle; and a book, probably meant for the Gospels, is represented as carried in the hand. \\n\\n \\n\\n It should be observed that at the mass of a {216} feast falling within the limits of time prescribed, the ordinary dalmatic and tunicle were worn in the ordinary way. \\n\\n ill-p216 \\n\\n \\n\\n Fig. 30.—Deacon in Folded Chasuble, Wells Cathedral. \\n\\n \\n\\n This peculiar custom was unknown to the Franciscans. The deacons of this order put off {217} the dalmatic entirely upon fast-days, and did not substitute any other vestment for it; a similar practice, with respect to the tunicle, was observed by the subdeacons, so that the deacons wore alb and stole only, the subdeacons alb and maniple. This practice was not observed at the Vigils of Saints, or of the Nativity, and on a few other occasions. \\n\\n \\n\\n When a cleric of sacerdotal rank ministered (as opposed to celebrated) at the mass, his dress was the amice, the alb, the stole, and the cope. The same vestments are worn by the priest at the mass of the pre-sanctified[97] on Good Friday. \\n\\n \\n\\n Before the vestments are put on for the mass the priest must wash his hands, and prepare the chalice, placing over it the purificator or napkin used for wiping the sacred vessels. Above the purificator he places the paten, with an unbroken host, and covers it with a small linen cloth, over which he puts the burse. This done, he takes the vestments one by one; he first receives the amice, takes it by its ends and strings, and kisses the middle of it where there is a cross. A prelate, it should be noticed, always puts on a surplice before vesting. The amice being put in its place, the alb and girdle are then assumed, then the maniple and chasuble. Each vestment is kissed {218} before being put on, and a prayer said with the assumption of each; these prayers differ little in style from those said in the similar ceremony in the Eastern Church, and it has therefore been thought unnecessary to give them here. \\n\\n \\n\\n In an inventory of the Vestry of Westminster Abbey,[98] the following directions are given in a late fifteenth-century hand: \\n\\n \\n\\n The Revestyng of the abbot of Westmʳ att evensong.—Fyrst the westerer shall lay the abbots cope lowest opon the awter wᵗ in the sayd westre, nex opon hys gray Ames, then hys surples, after that hys Rochett and uppermost his Kerchure. \\n\\n \\n\\n Hys Myter \u0026 crose beyng Redy wᵗ hys glovys and pontyfycalls. \\n\\n \\n\\n The Revestyng of the sayd abbot att syngyng hy Masse.—Fyrst the westerer shall lay lowest the chesebell, above that the dalmatyke and the dalmatyk wᵗ yᵉ longest slevys uppermost \u0026 the other nethermost then hys stole \u0026 hys fanane and hys gyrdyll, opon that his albe theropon his gray Ames a bove that hys Rochett and uppermost hys kerchur wᵗ a vestry gyrdyll to tukk up his cole. \\n\\n \\n\\n Hys Miter \u0026 crose beyng Redy wᵗ hys glovys and pontyfycalls And a fore all thys you muste se that hys sabatyns \u0026 syndalls be Redy at hys first cūyng whan he settyth hym downe in the travys. \\n\\n \\n\\n This direction is important in one respect. It shows us the order in which the vestments were put on, it is true; that, however, one would naturally infer from the order in which they are {219} seen in the monuments. But it tells us also that a canon wore his canonical habit underneath his mass habit at high mass, but so arranged that it should be, as far as possible, out of sight; hence the direction to have \u0027a vestry girdle to tuck up his cowl.\u0027 At Wells, Hereford, and Norwich Cathedrals are to be seen figures of canons, the almuce or amess appearing at the neck, although they are vested in eucharistic habit. \\n\\n \\n\\n The duty of the minister, as far as the vestments of the celebrant are concerned, consists in seeing that the vestments are laid out in their proper order on a table in the vestry, or, should there be no vestry, on a side-table near the altar (never on the altar itself); the vestments for the assistant should be on the right-hand side of those for the celebrant, the vestments for the deacon and subdeacon on the left. He should also see that each is properly put on, especially that the alb is drawn through the girdle so as to overhang it and to be raised about a finger\u0027s breadth from the ground, and that the chasuble is straight. He must especially be careful that the assistant does not put on his cope before the priest puts on his chasuble. During the celebration he has to see that the chasuble is not disarranged by genuflexions, and to raise the chasuble so as to give complete freedom to the priest\u0027s arms at the elevation of the host. After the celebration the vestments are {220} taken off with similar ceremonies in the reverse order. \\n\\n \\n\\n On Ember days, Rogations, in processions, and when the Sunday or Saint\u0027s day mass is said in the chapter house, on Ash Wednesday, Good Friday, and Palm Sunday, albs and amices only are to be worn by the ministers. \\n\\n \\n\\n The dress at the ordinary offices (mattins, lauds, etc.) is amice, alb, stole, and cope; a brass at Horsham represents a priest so vested, and has the merit of showing the exact manner in which the stole should be crossed. This combination of vestments was also worn at benedictions, at absolution after a mass for the dead, and, as just remarked, by the assistant at mass if a priest, and by the celebrant at the mass of the pre-sanctified. \u0027The cope,\u0027 the rubric tells us, \u0027is not strictly a sacerdotal vestment, but it is worn by the rulers of the choir and others.\u0027 \\n\\n \\n\\n The clergy in choir wear black (choral) copes, except on principal doubles,[99] and on the doubles falling on Sunday, when silk copes of the colour of the day are worn. On the vigil of Easter, and {221} through and on the octave, they wore surplices only, as also on doubles occurring from Easter to Michaelmas. \\n\\n \\n\\n If a bishop celebrate, and if it be Maunday Thursday, or Whitsunday, he has seven deacons, seven subdeacons, and three acolytes—on other doubles only five. On feasts with Rulers, two at least; on Good Friday only one. The rulers of the choir were those whose duty it was to chant the office and Kyrie at mass, and to superintend the choristers. On doubles these were four in number, on simples two. Rulers wore silk copes of the colour of the day over a surplice, and had silver staves as emblems of office. \\n\\n \\n\\n The Roman Pontifical lays down succinct rules for the vesting of a bishop for the different duties of his position. These are as follows: \\n\\n \\n\\n Confirmation.—White cope and stole, amice, rochet, mitra aurifrigiata. \\n\\n \\n\\n Ordinations.—As for high mass: colour according to the day. \\n\\n \\n\\n Consecration of a Bishop.—The consecrator as for high mass: colour according to the day; each of the two assistant-bishops in rochet, cope, amice, stole, and mitra simplex. \\n\\n \\n\\n Profession of a Nun.—As for high mass. \\n\\n \\n\\n Coronation of a Sovereign.—As for high mass: colour according to day; each of the assistant-bishops in rochet, amice, white stole and cope, mitra simplex. In England all the bishops used to wear full pontificalia. \\n\\n \\n\\n Laying the Foundation of a Church.—Rochet, amice, white stole and cope, mitra simplex, pastoral staff. \\n\\n \\n\\n {222} Consecration of a Church.—The same till the mass, then full pontificalia (white). \\n\\n \\n\\n Reconciliation of a Church.—The same. \\n\\n \\n\\n Consecration of the Holy Oil on Maunday Thursday.—Full (white) pontificalia, mitra pretiosa. \\n\\n \\n\\n At a Synod held in a Cathedral Church.—Rochet, amice, red stole, red cope, mitra pretiosa. \\n\\n \\n\\n Procession of Palms.—Alb, amice, purple stole, purple cope, mitra simplex. \\n\\n \\n\\n Procession of Corpus Christi.—Alb, amice, stole, tunic, dalmatic, white cope; a mitra pretiosa borne behind. In England and in France red was the colour. \\n\\n \\n\\n Rogation Days.—Alb, amice, purple stole, purple cope, mitra simplex. \\n\\n \\n\\n In occasional services, such as baptism, a surplice and stole are worn. At baptisms two stoles are used, one of violet, which is worn at the first part of the service, and the other of white, which is substituted for the first in the course of the office. This observance has a symbolical meaning; violet being the colour which typifies sin and penitence, and white being associated with ideas of purity, the change in the stole is emblematic of the regenerating change which the rite of baptism is supposed to work. A reversible stole, violet on one side and white on the other, is sometimes used for this service. In processions and benedictions at the altar (i.e., blessings of wax, images, etc.) the cope must be worn. In other benedictions stole and surplice are sufficient. \\n\\n \\n\\n {223} The cope must also be worn at an absolution after a mass for the dead; the colour of the cope for such a service is black, the ministers lay aside their dalmatics, and when the celebrant assumes the cope he must lay aside his maniple. If for any reason a cope be not obtainable, these rites (benedictions, absolutions, etc.) must be performed in alb and crossed stole only, without chasuble or maniple. \\n\\n \\n\\n Should it be found necessary to celebrate high mass without the aid of a deacon or subdeacon, the Epistle is ordered to be sung by a lector vested in a surplice. \\n\\n \\n\\n We must now approach an important branch of this complex subject—the varieties in the colour of the vestments depending on the character of the day, in other words, the liturgical colours of the vestments. \\n\\n \\n\\n It does not appear that the definite assigning of particular colours to particular days is of older date than Innocent III\u0027s time; but before him, and even as far back as the time of the fathers of the church, we find that the early Christians had symbolical associations with colours, which have formed the foundation on which the elaborate structure of later times was built. \\n\\n \\n\\n It is a matter of common knowledge that there are associations of sentiment and colour which are practically indissoluble. Black and sorrowful, {224} white (or bright) and joyful, are synonymous terms, and similar expressions are universal. \\n\\n \\n\\n White, in the first ten centuries of Christianity, typified purity and truth. Saints, angels, and Our Lord are for that reason represented clothed in white. As we have seen, the earliest vestments were probably white; the newly-baptized wore white during the week after baptism, and the dead were shrouded in white; the latter, however, probably more for convenience than for any symbolic reason. \\n\\n \\n\\n Red, the colour of flame, was associated with ideas of warm, burning love. Our Lord is sometimes represented in red when performing works of mercy. \\n\\n \\n\\n Green, the colour of plants, was regarded as typifying life, and sacred or beatified persons are sometimes depicted as clothed in this colour in reference to their everlasting life. Lastly, \\n\\n \\n\\n Violet, which is formed by a mixture of red and black, was said to symbolize \u0027the union of love and pain in repentance.\u0027 It also typifies sorrow, without any reference to sin as its cause; thus the Mater Dolorosa is occasionally represented in a violet robe.[100] \\n\\n \\n\\n Further than this we cannot go, and perhaps we have said too much. It is quite possible that these {225} theories may have been put forward to account for phenomena which depended entirely on the taste and whim of the painters. It is well known that in the early ages of Christianity ideas of colour were vague, and yellow and green, dark blue and black, light blue and violet, were all regarded as being the same colour. Previous to the tenth century, it is quite true that coloured vestments are to be seen in mosaics and fresco-paintings; but the combinations of colours are such as to leave no doubt that they were simply adopted by the painter as convenient aids to distinguishing the various vestments from the surrounding background and from each other. \\n\\n \\n\\n Coming now to Innocent III, we find that he prescribes four liturgical colours, white, red, black and green. These were the principal or primary liturgical colours; but there are others, secondary to these, which were modifications in tint of the primaries. Thus, properly, red is the colour of martyrs, white the colour of virgins; but there is a secondary colour, saffron, for confessors, and the secondaries, rose and lily, are considered interchangeable with red and white. \\n\\n \\n\\n Hopelessly at variance are the practices throughout the Western Church, and we will not attempt to give more than a brief outline of the general principles. For those who desire fuller information reference is made to a paper by Dr Wickham {226} Legg in the first volume of the Transactions of the St Paul\u0027s Ecclesiological Society, in which no less than sixty-three different \u0027uses\u0027 are analyzed and tabulated, or compared. \\n\\n \\n\\n The rules to which we have just referred are almost the only regulations respecting which uniform use prevails. For obvious reasons, white is appropriated to feasts of St Mary and of the other virgin saints; black is appropriated to the office of the dead; and red to the feasts of martyrs. Usually white is used for Christmas and Easter, and red for Whitsuntide and Feasts of Apostles. As a general rule, however, the same sentimental associations are to be seen with colours in the middle ages as may possibly be traced in earlier times: violet being essentially penitential in its character, red being indicative of fire, blood or love, white of purity and joy, black of mourning, and green of life. Hence violet is the usual colour for Advent and Lent, red for feasts of martyrs, apostles and evangelists, and in some uses for Passion-tide and Easter; white for Christmas, feasts of virgins, Easter, and sometimes Michaelmas and All Saints; black for Good Friday and offices of the dead; green from the Octave of Epiphany to Candlemas, and from Trinity to Advent. The use of the last colour is, however, very arbitrary; it only occurs at one or two seasons {227} in the year in each diocese, and these are very diverse. \\n\\n \\n\\n The following is the Roman sequence of colours for the year, and it may be taken as an example of all: \\n\\n \\n\\n Advent to Christmas Eve: black or violet. \\n\\n Christmas Eve, if a Sunday: rose. \\n\\n Christmas Day: white. \\n\\n St Stephen: red. \\n\\n St John the Evangelist: white. \\n\\n Holy Innocents: violet; red if a Sunday. \\n\\n Circumcision: white. \\n\\n Epiphany: white. \\n\\n Candlemas: violet for the procession of candles before mass, then white. \\n\\n Septuagesima to Maunday Thursday: violet. \\n\\n Good Friday: black. \\n\\n Easter: white. \\n\\n Ascension: white. \\n\\n Rogation Days: violet. \\n\\n Pentecost: red. \\n\\n Trinity Sunday: white. \\n\\n Corpus Christi: white. \\n\\n Trinity to Advent: green. \\n\\n Feasts of the Virgin Mary: white. \\n\\n St John Baptist: white. \\n\\n St Michael: white. \\n\\n All Saints: white. \\n\\n Martyrs: red. \\n\\n Apostles: red. \\n\\n Evangelists: red. \\n\\n Confessors: white. \\n\\n {228} \\n\\n Virgins: white. \\n\\n Transfiguration: white. \\n\\n Holy Cross: red. \\n\\n Confirmation: white. \\n\\n Dedication of a Church: white. \\n\\n Harvest Festivals: white. \\n\\n Requiem: black. \\n\\n \\n\\n One or two miscellaneous points may be worth a passing notice before we bring our account of the vestments of the Western Church to a close. \\n\\n \\n\\n During Lent it was the practice to cover up the images in the church with a curtain called the velum quadrigesimale. In the Fabric Rolls of York, for instance, we read the following entry (Anno 1518, 1519): \\n\\n \\n\\n \u0027Pro coloribus ad pingendum caminos de novo factos et pro e fauthoms cordarum pro suspensione pannorum quadrigesimalium ante novum crucifixum ivs. \\n\\n \\n\\n \u0027Pro pictione unius panni pendentis coram novo crucifixo in tempore quadrigesimali, et pro les curtayn ringes et pro les laic ac pro suicione alterius panni xiis.\u0027 \\n\\n \\n\\n A point respecting the ring is worth mention. Doctors of Divinity and bishops only may wear a ring in the Western Church, and the former must take it off when celebrating mass. \\n\\n \\n\\n Besides the Episcopal and Diaconal dalmatic, there is a third kind, to which allusion must be made: the Imperial dalmatic, which from time immemorial has been placed on the sovereigns of Europe at their coronation. \\n\\n \\n\\n {229} The Imperial Dalmatic in the treasury of St Peter\u0027s at Rome is thus described: \\n\\n \\n\\n \u0027It is laid upon a foundation of deep blue silk, having four different subjects on the shoulders behind and in front, exhibiting—although taken from different actions—the glorification of the body of our Lord. The whole has been carefully wrought with gold tambour and silk, and the numerous figures (as many as fifty-four) surrounding our Redeemer, who sits enthroned on a rainbow in the centre, display simplicity and gracefulness of design. The field of the vestment is powdered with flowers and crosses of gold and silver, having the bottom enriched with a running floriated pattern. It has also a representation of paradise, wherein the flowers, carried by tigers of gold, are of emerald green, turquoise blue, and flame colour. Crosses of silver cantonned with tears of gold, and of gold cantonned with tears of silver alternately, are inserted in the flowing foliage at the edge. Other crosses within circles are also placed after the same rule, when of gold in medallions of silver, and when of silver in the reverse order. \\n\\n \\n\\n \u0027This vestment is assigned to the 12th century. It has been conjectured that this dalmatic was formerly used by the German emperors when they were consecrated and crowned, and when they assisted the pope at the office of mass. On such occasions the emperor discharged the functions of subdeacon or deacon, and, clothed with a dalmatic, chanted the Epistle and Gospel; in illustration of this custom it may be remarked that several of the German Emperors took part in the service, even so late as Charles V, who sung the Gospel at Boulogne in 1529. The dalmatic was, in fact, in those times, as it continues at the present day, both a regal and ecclesiastical habit, and it has constantly been the custom of European kingdoms for the sovereigns to wear it at their coronation.\u0027[101] \\n\\n \\n\\n {230} But the Ecclesiastical nature of the regal costume of the middle ages does not end with the dalmatic. Thus, the effigy of Richard I. at Fontevraud wears a cope-like mantle, a dalmatic, and a white sub-tunic, answering to the distinctive costumes of bishop or priest, deacon and subdeacon respectively. When the body of Edward I was exhumed at Westminster in 1774, he was found to wear among other garments a dalmatic and a stole, crossed on the breast in the priestly manner. The body of John, in Worcester, was found in 1797 to be habited in costume similar to that represented on his effigy, with the addition of a monk\u0027s cowl, no doubt adopted in order to safeguard his prospects of future happiness, as death in the monastic habit was regarded as ensuring a passport to heaven. \\n\\n \\n\\n The vestments of the Eastern Church are much simpler, and the rites connected with them have nothing like the complexity associated with those of the Western Church. They have but two colours, for instance—violet for fast-days (including Lent),[102] and white for the rest of the year—and ridicule the elaboration to which liturgical colours have been brought in the Western Church. This fact might be indicated, if any disproof of the existence of a primitive system of liturgical colours were needed. \\n\\n \\n\\n {231} The following are the rubrical directions and prayers used at vesting for the Eucharistic service in the Greek Church: \\n\\n \\n\\n Being then come within the altar [after the procession up the church] they [the priest and deacon] make three bows before the holy table, and kiss the holy gospel and the holy table: then each, taking his στοιχάριον in his hand, makes three bows and saith softly to himself: \\n\\n \\n\\n O God, purify me, a sinner, and have mercy upon me. \\n\\n \\n\\n The Deacon comes to the priest, holds his στοιχάριον and ὠράριον in his right hand, and bowing down his head to him, saith: \\n\\n \\n\\n Bless, sir, the στοιχάριον and the ὠράριον. \\n\\n \\n\\n The priest. Blessed be our God always, now and for ever, even unto ages of ages. \\n\\n \\n\\n The deacon then goes apart on one side of the altar and puts on his στοιχάριον, saying: \\n\\n \\n\\n My soul shall rejoice in the Lord, for He hath put on me the robe of salvation, and clothed me with the garment of gladness: as a bridegroom hath He put a crown on my head and decked me like a bride. \\n\\n \\n\\n Then, kissing the ὠράριον, he puts it upon his left shoulder. Then he puts on his ἐπιμανίκια: putting on that on his right hand, he saith: \\n\\n \\n\\n Thy right hand, O Lord, is glorified in strength; Thy right hand, O Lord, hath destroyed the enemies, and in the greatness of Thy glory hast Thou put down the adversaries. \\n\\n \\n\\n Then, putting the other on his left hand: \\n\\n \\n\\n Thy hands have made me and fashioned me. O give me understanding that I may learn Thy commandments. \\n\\n \\n\\n [He then prepares the sacred vessels.] \\n\\n \\n\\n The priest puts on his sacred vestments in the following manner. First, taking up his στοιχάριον in his left hand, and making three bows towards the east, he signs it with the sign of the cross, saying: \\n\\n \\n\\n {232} Blessed be our God always, etc. \\n\\n \\n\\n And then he puts it on, saying, My soul shall rejoice, etc., as the deacon said above. \\n\\n \\n\\n Next he takes up the ἐπιτραχήλιον, and, blessing it, he saith: \\n\\n \\n\\n Blessed be God who poureth out His grace on His priests, like the precious ointment upon the head that ran down unto the beard, even unto Aaron\u0027s beard, and went down to the skirts of his clothing. \\n\\n \\n\\n He then takes the ζώνη, and girding himself therewith, saith: \\n\\n \\n\\n Blessed be God who hath girded me with strength, and hath put me in the right way, making my feet like harts\u0027 feet, and hath set me up on high. \\n\\n \\n\\n He next puts on his ἐπιμανίκια, saying as was said above by the deacon. After which he takes up his ἐπιγονάτιον, if he be of such dignity as to wear one, and blessing it and kissing it, saith: \\n\\n \\n\\n Gird thee with thy sword upon thy thigh, O thou most mighty, according to thy worship and renown. Good luck have thou with thine honour, ride on because of the word of truth, of meekness, and righteousness, and thy right hand shall teach thee terrible things: always, now and for ever, even unto ages of ages. Amen. \\n\\n \\n\\n Then he takes his φελώνιον, and blesses and kisses it, saying: \\n\\n \\n\\n Let thy priests, O Lord, be clothed with righteousness, and let thy saints sing with joyfulness: always, now and for ever, even unto ages of ages. Amen.[103] \\n\\n \\n\\n When the vestments are put off after the communion, the priest says Nunc Dimittis, τρισάγιον, and Pater Noster. \\n\\n \\n\\n It does not appear that any complex rules hold good in the Greek Church respecting the vestments to be worn on certain days in the Church\u0027s year. {233} The following synopsis of the vestment uses in the ordination service will show most clearly the nature and distribution of Ecclesiastical vestments in the Eastern Church. \\n\\n \\n\\n Ordination of a Reader: A short φαινόλιον put on by the bishop, which is presently removed by the subdeacons; the στοιχάριον is then blessed and put on by the bishop. \\n\\n \\n\\n Ordination of a Subdeacon: The candidate comes dressed in the στοιχάριον; the subdeacons hand the ὠράριον to the bishop, who signs it on the cross; the new subdeacon kisses the cross and the bishop\u0027s hand, and girds himself with the ὠράριον. \\n\\n \\n\\n Ordination of a Deacon: The candidate kneels before the altar; the bishop, at the beginning of the service, puts the end of the ὠμοφόριον upon him. After the service the bishop takes the ὠράριον and puts it on the new deacon\u0027s left shoulder, saying ἄξιος, which is repeated thrice by the choir; then the bishop gives him the ἐπιμανίκια, and ἄξιος is repeated as before. The fan (for blowing flies from the table) is presented after this, with the same words. \\n\\n \\n\\n Ordination of a Priest: At the commencement the candidate kneels at the altar, and the bishop puts the ὠμοφόριον on his head. At the end the ὠμοφόριον is taken from him, and the ἐπιτραχήλιον is received by the bishop, who kisses it; the newly-ordained {234} priest kisses the vestment and the bishop\u0027s hand; the bishop puts it on the priest, saying ἄξιος, which is repeated as at the ordination of a deacon. The ζώνη and φαινόλιον is then conferred in a similar manner. \\n\\n \\n\\n Ordination of a Bishop: The new bishop comes to the service in all his sacred vestments. At the end the ὠμοφόριον is put upon the elect, except when the consecration takes place in the see of the bishop, in which case the σάκκος and the other episcopal garments are given first. The same ceremonial is repeated as at the other ordinations. \\n\\n \\n\\n The vestments worn at the administration of baptism are the φαινόλιον and ἐπιμανίκια. \\n\\n \\n\\n There are three orders of devotees in the Greek monasteries. The probationers wear a black cassock or vest called shaesa, and a hood (Russian kamelauch, χαμαλαύχη). The proficients wear, in addition, an upper cloak (μάνδυας). The perfect are distinguished by their hood or vail, which perpetually conceals their faces from sight. \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1972/56471.html","bookId":718,"book":{"id":718,"title":"Ecclesiastical Vestments","description":"简介： Within comparatively recent years the discovery has been made that it is possible to treat the Bible, for critical purposes, as though it were an ordinary item of national literature, while maintaining a fitting reverence for it as the inspired Word;...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1972","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
