{"id":77209,"no":18,"title":"Page 18","content":"Judith shrugged. Her attention had already moved on, for she\u0027d just spotted the birthing stool in the corner near the door. She immediately walked over to get a better look at the contraption. Winslow noticed her interest and was reminded of a duty he needed to complete. \"Iain, would you help me get this outside? It\u0027s upsetting to Isabelle,\" he said in a low whisper. \"I\u0027ll take it back down to Agnes\u0027s home in the morning.\" Judith was intrigued by both the design and the craftsmanship. The birthing stool was actually a horseshoe-shaped chair. The circular back was tall, sturdy-looking. The seat of the stool was only a narrow ledge fashioned to support the woman\u0027s thighs. Both the wooden handles and the sides were inlaid with gold, and the craftsman had used a clever hand to draw angels along the sides. She tried to hide her curiosity. \"Would you like to see what your mother sent to you, Isabelle?\" she asked. \"Yes, please.\" Judith carried the satchel over to the bed. She stood by the side, smiling over Isabelle\u0027s pleasure. \"Both your mother and your father are feeling well,\" she said. \"Margaret wanted me to tell you your cousin Rebecca is marrying a Stuart in the fall.\" Isabelle mopped at the corners of her eyes with a linen square. She made a grimace, clutched the covers with both hands and then let out a low sigh. Beads of perspiration appeared on her brow. Judith picked up the linen cloth she\u0027d dropped, leaned over the bed and mopped the sweat away. \"You aren\u0027t feeling well, are you?\" she whispered. Isabelle shook her head. \"I ate too much of Winslow\u0027s supper,\" she whispered back. \"It was terrible but I was very hungry. I wish he\u0027d let me out of bed. Why are you here?\" The question, asked so casually, caught Judith by surprise. \"To give you your mother\u0027s gifts and tell you the news from home.\" \"No, I mean to ask you why you\u0027re here in the Highlands,\" she explained. \"My friend, Frances Catherine, asked me to come,\" Judith replied. \"Why are you whispering?\" The pretty woman smiled. Then Winslow inadvertently ruined her budding good mood. Iain had opened the door, and Winslow was carrying the birthing chair outside. Isabelle immediately got teary-eyed again. She waited until Iain had pulled the door closed and then said, \"Frances Catherine\u0027s afraid, too, isn\u0027t she?\" \"Isabelle, every woman becomes a little frightened before the birthing. Does the chair upset you?\" Isabelle nodded. \"I won\u0027t use it.\" She was getting as worked up as Frances Catherine had been when she talked about the birthing. Judith barely knew Isabelle, but she still felt terribly sorry for her. Her fear was so apparent. \"The chair isn\u0027t used for torture,\" Judith said. \"Maude says the birthing mothers are happy to have such comfort. You\u0027re fortunate to have one here.\" \"Comfort?\" \"Yes,\" Judith replied. \"She says the chair is made in such a way that the woman\u0027s back and legs are nicely supported.\" \"Who is this Maude?\" \"A midwife I know,\" Judith answered. \"What else did she say?\" Isabelle asked. She quit twisting the top of the quilt. \"Maude stayed with me for a good six weeks,\" Judith explained. \"She gave me a great deal of advice for Frances Catherine.\" The clutter in the cottage was driving Judith to distraction, and while she repeated some of the midwife\u0027s suggestions, she folded the clothing and put the garments in a neat stack on the foot of the bed. \"You should be up and about,\" Judith said as she turned to tackle the mess on the table. \"Fresh air and long walks are just as important as a peaceful mind.\" \"Winslow worries I\u0027ll fall,\" Isabelle said. \"Then ask him to walk with you,\" Judith suggested. \"Being cooped up inside all day long would make me daft, Isabelle.\" The sound of Isabelle\u0027s laughter filled the cottage. \"It\u0027s making me daft too,\" she admitted. She pulled back the covers and swung her legs over the side. \"Are you a midwife in England?\" \"Good heavens, no,\" Judith answered. \"I\u0027m not even married. I just made it my purpose to get as much information as possible from experienced midwives so I could help Frances Catherine.\" \"Do you mean to say that in England an unmarried woman can openly discuss this intimate topic?\" Isabelle sounded stunned. Judith laughed. \"Nay, it isn\u0027t discussed at all, and my mother would be most unhappy if she knew what I was learning.\" \"Would she punish you?\" \"Yes.\" \u0027\u0027\u0027You took quite a risk for your friend.\" \"She would do the same for me,\" Judith answered. Isabelle stared at Judith a long minute, then slowly nodded. \"I don\u0027t understand such friendship between women, but I envy the trust you have in Frances Catherine. You put yourself at risk for her and tell me she would do the same for you. Yes, I do envy such loyalty.\" \"Didn\u0027t you have friends when you were growing up?\" \"Only relatives about,\" Isabelle answered. \"And my mother, of course. She was sometimes like a friend to me, when I was older and more of a help to her.\" Isabelle stood up and reached for her plaid. The top of her head only reached Judith\u0027s chin, and her middle seemed to be twice the size of Frances Catherine\u0027s. \"Do you have friends here?\" \"Winslow is my dearest friend,\" Isabelle answered. \"The women here are kind to me, but we\u0027re all kept busy with our chores and there really isn\u0027t time to socialize.\" Judith watched in amazement as the woman deftly wrapped the long narrow strip of material around and around herself. When she was finished, she was wearing a plaid from shoulders to ankles, with perfectly even pleats that widened over her swollen belly. \"You\u0027re very easy to talk to,\" Isabelle remarked in a shy whisper. \"Frances Catherine must be happy to have your company. She needs someone besides Patrick to talk to,\" she added. \"I think she\u0027s had a difficult time making her place here.\" \"Why do you suppose that is?\" Judith asked. \"Some of the older women think she\u0027s uppity,\" Isabelle said. \"Why?\" \"She keeps to herself,\" Isabelle explained. \"I think she\u0027s homesick for her family.\" \"Are you homesick for your family?\" \"At times I am,\" Isabelle admitted. \"But Winslow\u0027s aunts have been most kind to me. Would you tell me what other suggestions this midwife had? Does she believe in using the birthing hook?\" Isabelle turned to straighten the covers on the bed, but not before Judith saw the fear in her eyes. \"How would you know about such a thing?\" \"Agnes showed it to me.\" \"Good God,\" Judith whispered before she could stop herself. She took a deep breath to rid herself of her anger. She wasn\u0027t there to cause trouble, and knew it wouldn\u0027t be at all appropriate to criticize the methods the mid wives used here. \"Maude doesn\u0027t believe in using the birthing hook,\" she said. She kept her voice even, almost pleasant. \"She says it\u0027s barbaric.\" Isabelle didn\u0027t show any reaction to that explanation. She continued to ask Judith questions. Every now and again she\u0027d bite on her lower lip and sweat would break out on her brow. Judith thought the discussion was upsetting her. Winslow and Iain still hadn\u0027t come back inside. When Judith made that mention to Isabelle, she laughed again. \"My husband is probably enjoying the peace outside. I\u0027ve been difficult to get along with lately.\" Judith laughed. \"It must be a common affliction, Isabelle. Frances Catherine said the exact same thing to me not an hour ago.\" \"Is she afraid of Agnes?\" \"Are you?\" \"Yes.\" Judith let out a weary sigh. God\u0027s truth, she was beginning to be afraid of the woman, too. Agnes sounded like a monster. Did she have no compassion in her heart? \"How much time do you have before your laboring begins?\" She wouldn\u0027t look at Judith when she answered. \"A week or two.\" \"Tomorrow we will talk about this again. Would you come to Frances Catherine\u0027s home? Perhaps the three of us can find a way to solve this worry about Agnes. Isabelle, I\u0027m completely without experience. I\u0027ve never even seen a birthing, but I do know that the more information we have, the less chance fear has to catch hold. Isn\u0027t that true?\" \"You would help me?\" \"Of course,\" Judith answered. \"Why don\u0027t we go outside now? The fresh air will do you good.\" Isabelle was in full agreement. Judith was just reaching for the door when Winslow opened it. He nodded to Judith, then turned to frown at his wife. \"Why are you out of bed?\" \"I have need for some fresh air,\" she answered. \"Have you taken the birthing chair back to Agnes yet?\" He shook his head. \"I will in the morning.\" \"Please bring it back inside,\" she requested. \"It will be a comfort for me to have it near.\" She smiled at Judith when she gave her husband that explanation. Winslow looked confused. \"But you didn\u0027t want to look at it,\" he reminded her. \"You said—\" \"I\u0027ve changed my mind,\" Isabelle interrupted. \"I\u0027ve remembered my manners as well. Good evening, Laird Iain,\" she called out. Judith had already walked outside and now stood next to Iain. She refused to look at him. She bowed to Isabelle and Winslow and then started walking back to Frances Catherine\u0027s cottage. Iain caught up with her at the crest. \"Winslow and Isabelle both want you to know they\u0027re thankful for bringing Margaret\u0027s gifts. You cleaned their cottage, didn\u0027t you?\" \"Yes.\" \"Why?\" \"It needed cleaning.\" Her words were clipped, cold. Iain clasped his hands behind his back and continued to walk by her side. \"Judith, don\u0027t make this more difficult than it already is,\" he said in a harsh whisper. She was walking so fast she was almost running. \"I don\u0027t mean to make anything difficult,\" she replied. \"I\u0027ll stay away from you and you\u0027ll stay away from me. I\u0027m already over this insignificant, puny, inconsequential attraction. I don\u0027t even remember kissing you.\" They had reached the cluster of trees in front of the courtyard leading to Frances Catherine\u0027s cottage when she told him that outrageous lie. \"The hell you have forgotten,\" he muttered. He grabbed hold of her shoulders and forced her to turn around. Then he took hold of her chin and pushed her face up. \"What do you think you\u0027re doing?\" she demanded. \"Reminding you.\" His mouth came down on hers then, sealing off any protest she might have wanted to make. And Lord, how he kissed her. His mouth was hot, hungry, and his tongue thrust inside with gentle insistence. She went weak in her knees. She didn\u0027t fall down, though. She sagged against him; he wrapped his arms around her waist and pulled her up against him. His mouth slanted over hers again and again, and God help him, he couldn\u0027t seem to get enough of her. She returned his kiss with equal passion, perhaps even more, and the last coherent thought she had before his kiss completely robbed her of the ability to think at all was that Iain certainly knew how to rid her of her anger. Patrick opened the door and let out a snort of laughter at the sight before him. Iain ignored his brother, and Judith was oblivious to everything but the man holding her so tenderly in his arms. He finally pulled back and looked down with arrogant pleasure at the beautiful woman in his arms. Her mouth was swollen, rosy as well, and her eyes were still misty with passion. He suddenly wanted to kiss her again. \"Go inside now, Judith, while I still have enough discipline to let you.\" She didn\u0027t understand what he meant by that remark. She didn\u0027t understand his frown either. \"If you dislike kissing me so much, why do you continue to do so?\" She looked thoroughly disgruntled. He laughed. She took exception to that reaction. \"You may let go of me now,\" she ordered. \"I already have.\" Judith realized she was still clinging to him, and immediately pulled away. She patted her hair back over her shoulder and turned to walk inside. Spotting Patrick lounging against the open doorway, she felt her face heat to a full blush. \"You mustn\u0027t make anything out of what you\u0027ve just seen,\" she announced. \"Iain and I don\u0027t even like each other.\" \"You could have fooled me,\" Patrick drawled out. It would be impolite for her to kick her host, she supposed, and so she gave him a frown instead as she walked past him. Patrick wasn\u0027t finished teasing her yet. \"Aye, it seemed to me you two were liking each other a whole lot, Judith.\" Iain had turned to go back up the hill. He heard Patrick\u0027s remark and immediately turned back. \"Let it go, Patrick.\" \"Wait up,\" Patrick called out. \"I\u0027ve something to discuss with you,\" he added as he hurriedly pulled the door closed behind him. Judith was thankful for the privacy. Frances Catherine was already sound asleep. She was even more thankful for that blessing. Her friend would have plied her with questions if she\u0027d been awake and seen Iain kissing her, and Judith simply wasn\u0027t up to answering. Patrick had placed a tall screen at an angle in the corner of the room behind the table and chairs. There was a narrow bed with a pretty forest-green quilt on top. Her satchels were neatly stacked against one wall next to a narrow chest. A white porcelain pitcher and matching bowl were on top of the chest next to the wooden vase filled with fresh wildflowers. Frances Catherine had had a hand in arranging the make-do bedchamber. Patrick never would have thought to add flowers. He wouldn\u0027t have unpacked her brush and looking glass, either, and both were within easy reach on the corner of the stool on the other side of the bed. Judith smiled over her friend\u0027s thoughtfulness. She didn\u0027t realize her hands were still shaking until she tried to undo the latches at the top of her gown. Iain\u0027s kiss had done that, she realized, and dear God, what was she going to do about him? From what Frances Catherine had told her about the hatred between the Maitlands and the Macleans, Judith doubted Iain would have touched her if he\u0027d known she was his enemy\u0027s daughter. She remembered she\u0027d told her friend Iain would protect her. Now she felt a desperate need to protect herself from him. She didn\u0027t want to love him. Oh, it was all so impossible for her to sort out. She wanted to weep, but she knew crying wouldn\u0027t solve any of her problems.","sourceLink":"https://allnovel.net/the-secret-highlands-lairds-1/page-18.html","bookId":1844,"book":{"id":1844,"title":"The Secret (Highlands\u0027 Lairds #1)","description":"Storyline: Judith Hampton was as beautiful as she was proud, as purposeful as she was loyal. The dear Scottish friend of her childhood was about to give birth, and Judith had promised to be at her side. But there was another, private reason for the journey from her bleak English home to the Highlands to meet the father she had never known, the Laird Maclean. Nothing prepared her for the sight of the Scottish barbarian who was to escort her into his land...Iain Maitland, Laird of his clan, a man more powerfully compelling than any she had ever encountered. In a spirited clash of wills and customs, Judith revelled in the melting bliss of Iain\u0027s searching kisses, his passionate caresses. Perplexed by her sprightly defiance, bemused by her tender nature, Iain felt his soul growing into the light and warmth of her love. Surely nothing would wrench her from the affection and trust of Iain and his clan...not even the truth about her father, a devastating secret that could shatter the boldest alliance, and the most glorious of loves.","cover":"https://allnovel.net/images/the-secret-highlands-lairds-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-secret-highlands-lairds-1.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:33:38 PM"}}
