{"id":62856,"no":2,"title":"Page 2","content":"CHAPTER THREE\n WE PULL OFF FOR FOOD AND GAS AND NEW PHONES. We go to a truck stop, where we eat meat loaf and macaroni and cheese, which is one of the few things Henri acknowledges as being superior to anything we had on Lorien. As we eat, he creates new documents on his laptop, using our new names. He’ll print them when we arrive, and as far as anyone will know, we’ll be who we say we are.\n “You’re sure about John Smith?” he says.\n “Yeah.”\n “You were born in Tuscaloosa, Alabama.”\n I laugh. “How did you come up with that?”\n He smiles and motions towards two women sitting a few booths away. Both of them are extremely hot. One of them is wearing a T-shirt that reads WE DO IT BETTER IN TUSCALOOSA.\n “And that’s where we’re going next,” he says.\n “As weird as it may sound, I hope we stay in Ohio for a long time.”\n “Really. You like the idea of Ohio?”\n “I like the idea of making some friends, of going to the same school for more than a few months, of maybe actually having a life. I started to do it in Florida. It was sort of great, and for the first time since we’ve been on Earth, I felt almost normal. I want to find somewhere and stay somewhere.”\n Henri looks thoughtful. “Have you looked at your scars today?”\n “No, why?”\n “Because this isn’t about you. This is about the survival of our race, which was almost entirely obliterated, and about keeping you alive. Every time one of us dies—every time one of you, the Garde, dies—our chances diminish. You’re Number Four; you’re next in line. You have an entire race of vicious murderers hunting you. We’re leaving at the first sign of trouble, and I’m not going to debate it with you.”\n Henri drives the entire time. Between breaks and the creation of the new documents, it takes about thirty hours. I spend most of the time napping or playing video games. Because of my reflexes, I can master most of the games quickly. The longest it has taken me to beat any of them is about a day. I like the alien war and space games the best. I pretend I’m back on Lorien, fighting Mogadorians, cutting them down, turning them to ash. Henri thinks it’s weird and tries to discourage me from doing it. He says we need to live in the real world, where war and death are a reality, not pretend. As I finish my latest game, I look up. I’m tired of sitting in the truck. The clock on the dash reads 7:58. I yawn, wipe my eyes.\n “How much farther?”\n “We’re almost there,” Henri says.\n It is dark out, but there is a pale glow to the west. We pass by farms with horses and cattle, then barren fields, and beyond those, it’s trees as far as the eye can see. This is exactly what Henri wanted, a quiet place to go unnoticed. Once a week he scours the internet for six, seven, eight hours at a time to update a list of available homes around the country that fit his criteria: isolated, rural, immediate availability. He told me it took four tries—one call to South Dakota, one to New Mexico, one to Arkansas—until he had the rental where we’re going to live now.\n A few minutes later we see scattered lights that announce the town. We pass a sign that reads:\n WELCOME TO PARADISE, OHIO POPULATION 5,243\n “Wow,” I say. “This place is even smaller than where we stayed in Montana.”\n Henri is smiling. “Who do you think it’s paradise for?”\n “Cows, maybe? Scarecrows?”\n We pass by an old gas station, a car wash, a cemetery. Then the houses begin, clapboard houses spaced thirty or so feet apart. Halloween decorations hang in the windows of most of them. A sidewalk cuts through small yards leading to the front doors. A traffic circle sits in the center of town, and in the middle of it is a statue of a man on horseback holding a sword. Henri stops. We both look at it and laugh, though we’re laughing because we hope no one else with swords ever shows up here. He continues around the circle and once we’re through it, the dashboard GPS system tells us to make a turn. We begin heading west, out of town.\n We drive for four miles before turning left onto a gravel road, then pass open cut fields that are probably full of corn in the summer, then through a dense forest for about a mile. And then we find it, tucked away in overgrown vegetation, a rusted silver mailbox with black lettering painted on the side of it that reads 17 OLD MILL RD.\n “The closest house is two miles away,” he says, turning in. Weeds grow throughout the gravel drive, which is littered with potholes filled with tawny water. He comes to a stop and turns the truck off.\n “Whose car is that?” I ask, nodding to the black SUV Henri has just parked behind.\n “I’m assuming the real-estate agent’s.”\n The house stands silhouetted by trees. In the dark there is an eerie look to it, like whoever last lived in it was scared away, or was driven away, or ran away. I get out of the truck. The engine ticks and I can feel the heat coming off of it. I grab my bag from the bed and stand there holding it.\n “What do you think?” Henri asks.\n The house is one story. Wooden clapboard. Most of the white paint has been chipped away. One of the front windows is broken. The roof is covered with black shingles that look warped and brittle. Three wooden stairs lead to a small porch covered with rickety chairs. The yard itself is long and shaggy. It’s been a very long time since the grass was last mowed.\n “It looks like Paradise,” I say.\n We walk up together. As we do, a well-dressed blond woman around Henri’s age comes out of the doorway. She’s wearing a business suit and is holding a clipboard and folder; a BlackBerry is clipped to the waist of her skirt. She smiles.\n “Mr. Smith?”\n “Yes,” says Henri.\n “I’m Annie Hart, the agent from Paradise Realty. We spoke on the phone. I tried calling you earlier but your phone seemed to be turned off.”\n “Yes, of course. The battery unfortunately died on the way here.”\n “Ah, I just hate when that happens,” she says, and walks towards us and shakes Henri’s hand. She asks me my name and I tell her, though I am tempted, as I always am, to just say “Four.” As Henri signs the lease she asks me how old I am and tells me she has a daughter at the local high school about my age. She’s very warm, friendly, and clearly loves to chat. Henri hands the lease back and the three of us walk into the house.\n Inside most of the furniture is covered with white sheets. Those that aren’t covered are coated with a thick layer of dust and dead insects. The screens in the windows look brittle to the touch, and the walls are covered with cheap plywood paneling. There are two bedrooms, a modest-sized kitchen with lime green linoleum, one bathroom. The living room is large and rectangular, situated at the front of the house. There’s a fireplace in the far corner. I walk through and toss my bag on the bed of the smaller room. There is a huge faded poster of a football player wearing a bright orange uniform. He’s in the middle of throwing a pass, and it looks like he’s about to get crushed by a massive man in a black and gold uniform. It says BERNIE KOSAR, QUARTERBACK, CLEVELAND BROWNS.\n “Come say good-bye to Mrs. Hart,” Henri yells from the living room.\n Mrs. Hart is standing at the door with Henri. She tells me I should look for her daughter at school, that maybe we could be friends. I smile and say yes, that would be nice. After she leaves we immediately start unpacking the truck. Depending on how quickly we leave a place, we either travel very lightly—meaning the clothes on our back, Henri’s laptop and the intricately carved Loric Chest that goes everywhere with us—or we bring a few things—usually Henri’s extra computers and equipment, which he uses to set up a security perimeter and search the web for news and events that might be related to us. This time we have the Chest, the two high-powered computers, four TV monitors, and four cameras. We also have some clothes, though not many of the clothes we wore in Florida are appropriate for life in Ohio. Henri carries the Chest to his room, and we lug all of the equipment into the basement, where he’ll set it up so no visitors will see it. Once everything is inside, he starts placing the cameras and turning on the monitors.\n “We won’t have the internet here until the morning. But if you want to go to school tomorrow, I can print all of your new documents for you.”\n “If I stay will I have to help you clean this place and finish the setup?”\n “Yes.”\n “I’ll go to school,” I say.\n “Then you better get a good night’s sleep.”\n CHAPTER FOUR\n ANOTHER NEW IDENTITY, ANOTHER NEW SCHOOL. I’ve lost track of how many there have been over the years. Fifteen? Twenty? Always a small town, a small school, always the same routine. New students draw attention. Sometimes I question our strategy of sticking to the small towns because it’s hard, almost impossible, to go unnoticed. But I know Henri’s rationale: it is impossible for them to go unnoticed as well.\n The school is three miles away from our house. Henri drives me in the morning. It’s smaller than most of the others I’ve attended and is unimpressive looking, one story, long and low-slung. A mural of a pirate with a knife between his teeth covers the outside wall beside the front door.\n “So you’re a Pirate now?” Henri says beside me.\n “It looks like it,” I reply.\n “You know the drill,” he says.\n “This ain’t my first rodeo.”\n “Don’t show your intelligence. It’ll make them resent you.”\n “Wouldn’t dream of it.”\n “Don’t stand out or draw too much attention.”\n “Just a fly on the wall.”\n “And don’t hurt anybody. You’re far stronger than they are.”\n “I know.”\n “Most importantly, always be ready. Ready to leave at a moment’s notice. What’s in your backpack?”\n “Five days’ worth of dried fruit and nuts. Spare socks and thermal underwear. Rain jacket. A handheld GPS. A knife disguised as a pen.”\n “On you at all times.” He takes a deep breath. “And keep an eye out for signs. Your Legacies are going to appear any day now. Hide them at all costs and call me immediately.”\n “I know, Henri.”\n “Any day, John,” he reiterates. “If your fingers start to disappear, or if you start to float, or shake violently, if you lose muscular control or begin to hear voices even when nobody is talking. Anything at all, you call.”\n I pat my bag. “Got my phone right here.”\n “I’ll be waiting here after school. Good luck in there, kiddo,” he says.\n I smile at him. He is fifty years old, which means he was forty when we arrived. Being his age made for a harder transition. He still speaks with a strong Loric accent that is often mistaken for French. It was a good alibi in the beginning, so he named himself Henri, and he has stuck with it ever since, just changing his last name to match mine.\n “Off I go to rule the school,” I say.\n “Be good.”\n I walk towards the building. As is the case with most high schools, there are crowds of kids hanging around outside. They’re divided into their cliques, the jocks and the cheerleaders, the band kids carrying instruments, the brains in their glasses with their textbooks and BlackBerries, the stoners off to one side, oblivious to everyone else. One kid, gangly with thick glasses, stands alone. He’s wearing a black NASA T-shirt and jeans, and can’t weigh more than a hundred pounds. He has a handheld telescope and is scanning the sky, which is mostly obscured by clouds. I notice a girl taking pictures, moving easily from one group to the next. She’s shockingly beautiful with straight blond hair past her shoulders, ivory skin, high cheekbones, and soft blue eyes. Everyone seems to know her and says hello to her, and no one objects to her taking their picture. \n","sourceLink":"https://allnovel.net/i-am-number-four-lorien-legacies-1/page-2.html","bookId":1675,"book":{"id":1675,"title":"I Am Number Four (Lorien Legacies #1)","description":"Storyline: \n I Am Number Four (Lorien Legacies #1) \n In the beginning they were a group of nine. Nine aliens who left their home planet of Lorien when it fell under attack by the evil Mogadorian. Nine aliens who scattered on Earth. Nine aliens who look like ordinary teenagers living ordinary lives, but who have extraordinary, paranormal skills. Nine aliens who might be sitting next to you now. The Nine had to separate and go into hiding. \n The Mogadorian caught Number One in Malaysia, Number Two in England, and Number Three in Kenya. All of them were killed. John Smith, of Paradise, Ohio, is Number Four. He knows that he is next. \n I AM NUMBER FOUR is the thrilling launch of a series about an exceptional group of teens as they struggle to outrun their past, discover their future—and live a normal life on Earth.\n \n","cover":"https://allnovel.net/images/i-am-number-four-lorien-legacies-1.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/i-am-number-four-lorien-legacies-1.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:48:40 AM"}}
