{"id":62878,"no":24,"title":"Page 24","content":"“How long has it been since this tarp was removed?”\n “Not since Dad went missing.”\n I grab one corner, Sam takes the other, and together we peel it away and I set it in the corner. Sam stares at the truck, his eyes big, a smile on his face.\n The truck is small, dark blue, room inside for only two people, or maybe a third if they don’t mind an uncomfortable ride sitting in the center. It will be perfect for Bernie Kosar. None of the dust from the past eight years has made it onto the truck, so it sparkles as though it was recently waxed. I throw my bag into the bed.\n “My dad’s truck,” Sam says proudly. “All these years. It looks exactly the same.”\n “Our golden chariot,” I say. “Do you have the keys?”\n He walks to the side of the garage and lifts a set of keys from a hook on the wall. I unlock the garage door and open it.\n “Do you want to paper-rock-scissors to see who drives?” I ask.\n “Nope,” Sam says, and then he unlocks the driver’s side door and gets in behind the wheel. The engine cranks over and finally starts. He rolls down the window.\n “I think my dad would be proud to see me driving it,” he says.\n I smile. “I think so, too. Pull it out and I’ll close the door.”\n He takes a deep breath, and then puts the truck in drive and slowly, timidly, inches it out of the garage. He hits the brakes too hard too soon and the truck slams to a stop.\n “You aren’t all the way out yet,” I say.\n He eases his foot off the brake and then inches the rest of the way out. I close the garage door behind him. Bernie Kosar jumps up and in of his own volition and I slide in beside him. Sam’s hands are white knuckled at the ten and two positions of the wheel.\n “Nervous?” I ask.\n “Terrified.”\n “You’ll be fine,” I say. “We’ve both seen it done a thousand times before.”\n He nods. “Okay. Which way do I turn out of the driveway?”\n “We really going to do this?”\n “Yes,” he says.\n “We turn right, then,” I say, “and head in the direction away from town.”\n We both buckle our seat beats. I crack the window enough so that Bernie Kosar can fit his head out, which he does immediately, standing with his hind legs in my lap.\n “I’m scared shitless,” Sam says.\n “Me too.”\n He takes a deep breath, holds the air in his lungs, and then slowly exhales.\n “And…away…we…go,” he says, taking his foot off the brake when he says the last word. The truck goes bouncing down the driveway. He hits the brakes once and we skid to a stop. Then he starts again and inches down the drive more slowly this time until he stops at the end of it, looks both ways, and then turns out onto the road. Again, slow at first, then gaining speed. He is tense, leaning forward, and then after a mile a grin begins to form on his face and he leans back.\n “This isn’t so hard.”\n “You’re a natural.”\n He keeps the truck close to the painted line on the right side of the road. He tenses every time a car passes in the opposite direction, but after a while he relaxes and pays the other cars little attention. He makes one turn, then another, and in twenty-five minutes we pull onto the interstate.\n “I can’t believe we’re doing this,” Sam finally says. “This is the craziest shit I’ve ever done.”\n “Me too.”\n “Do you have any plan when we get there?”\n “None whatsoever. I’m hoping we’ll be able to scope the place out and go from there. I have no idea if it’s a house or an office building or what. I don’t even know if he is there.”\n He nods. “Do you think he’s okay?”\n “I have no idea,” I say.\n I take a deep breath. We have an hour and a half to go. Then we’ll reach Athens.\n Then we’ll find Henri.\n CHAPTER TWENTY\n WE DRIVE SOUTH UNTIL, NESTLED IN THE FOOTHILLS of the Appalachian Mountains, Athens comes into view: a small city sprouting through the trees. In the waning light I can see a river curling gently around that seems to cup the city, serving as the border to the east, south and west, and to the north lie hills and trees. The temperature is relatively warm for November. We pass the college football stadium. A white-domed arena stands a little beyond it.\n “Take this exit,” I say.\n Sam guides the truck off the interstate and turns right onto Richland Avenue. Both of us are elated we made it in one piece, and without being caught.\n “So this is what a college town looks like, huh?”\n “I guess so,” Sam says.\n Buildings and dorms are on each side of us. The grass is green, meticulously trimmed even though it is November. We drive up a steep hill.\n “At the top of this is Court Street. We want to turn left.”\n “How far are we?” Sam asks.\n “Less than a mile.”\n “Do you want to drive by it first?”\n “No. I think we should park the first opportunity we get and walk.”\n We drive down Court Street, which is the main artery in the center of town. Everything is closed for the holiday—bookstores, coffeehouses, bars. Then I see it, standing out like a jewel.\n “Stop!” I say.\n Sam slams on the brakes.\n “What?!”\n A car honks behind us.\n “Nothing, nothing. Keep driving. Let’s park.”\n We drive another block until we find a lot to park in. By my guess we are a five-minute walk at most from the address.\n “What was that? You scared the crap out of me.”\n “Henri’s truck is back there,” I say.\n Sam nods. “Why do you sometimes call him Henri?”\n “I don’t know, I just do. Sort of a joke between us,” I say, and look at Bernie Kosar. “Do you think we should take him?”\n Sam shrugs. “He might get in the way.”\n I give Bernie Kosar a few treats and leave him in the truck with the window cracked. He is not happy about it and begins whining and scratching at the window, but I don’t think we’ll be long. Sam and I walk back up Court Street, the straps of my bag pulled over my shoulders, Sam holding his in his hand. He has removed the Silly Putty and is squeezing it like people do with those foam balls when they’re stressed. We reach Henri’s truck. The doors are locked. There is nothing of importance on the seats or dash.\n “Well, this means two things,” I say. “Henri is still here, and whoever has him hasn’t discovered his truck yet, which means he hasn’t talked. Not that he ever would.”\n “What would he say if he talked?”\n For a brief moment I had forgotten that Sam knows nothing of Henri’s true reasons for being here. I’ve already slipped and called him Henri. I need to be careful not to reveal anything else.\n “I don’t know,” I say. “I mean, who knows what sorts of questions these weirdos are asking.”\n “Okay, now what?”\n I pull out the map to the address Henri had given me that morning. “We walk,” I say.\n We walk back the way we came. The buildings end and houses begin. Unkempt and dirty looking. In no time at all we reach the address and stop.\n I look at the slip of paper, then at the house. I take a deep breath.\n “This is us,” I say.\n We stand looking up at the two-story house with gray vinyl siding. The front walk leads to an unpainted front porch with a broken swing hanging unevenly to the side. The grass is long and untended. It looks uninhabited, but there is a car in the driveway at the rear. I don’t know what to do. I remove my phone. It is 11:12. I call Henri even though I know he won’t answer. It’s an attempt to establish my wits, to come up with a plan. I hadn’t thought this far ahead, and now that the reality is here my mind is blank. My call goes straight to voice mail.\n “Let me go knock on the door,” Sam says.\n “And say what?”\n “I don’t know, whatever comes to my mind.”\n But he doesn’t get a chance to because just then a man walks out of the front door. He is huge, at least six feet six, two hundred fifty pounds. He has a goatee and his head is shaved. He’s wearing work boots, blue jeans, and a black sweatshirt pulled up to his elbows. There is a tattoo on his right forearm, but I am too far away to see what it is. He spits into the yard, then turns around and locks the front door, walking off the porch and heading our way. I stiffen as he approaches. The tattoo is of an alien holding a bouquet of tulips in one hand as though offering them to some unseen entity. Then the man walks right past us without saying a word. Sam and I turn and watch him go.\n “Did you see his tattoo?” I ask.\n “Yeah. And so much for the stereotype of scrawny nerds being the only ones fascinated by aliens. That man is huge, and mean looking.”\n “Take my phone, Sam.”\n “What? Why?” he asks.\n “You have to follow him. Take my phone. I’ll go into the house. It’s obvious there is nobody there or he wouldn’t have locked the door. Henri might be in there. I’ll call you as soon as I can.”\n “How are you going to call me?”\n “I don’t know. I’ll find a way. Here.” He reluctantly takes it.\n “What if Henri isn’t in there?”\n “That’s why I want you to follow that guy. He might be going to Henri now.”\n “What if he comes back?”\n “We’ll figure it out. But you have to go now. I promise, I’ll call you the first chance I get.”\n Sam turns and looks at the man. He is fifty yards away from us now. Then he looks back at me.\n “Okay, I’ll do it. But be careful in there.”\n “You be careful, too. Don’t let him out of your sight. And don’t let him see you.”\n “Not a chance.”\n He turns and hurries after the man. I watch them go and, once they vanish from sight, I walk up to the house. The windows are dark, each one covered with a white shade. I can’t see in. I walk around to the back. There is a small concrete patio leading to a back door, which is locked. I walk the rest of the way around the house. Overgrown weeds and bushes left over from summer. I try a window. Locked. All of them are locked. Should I break one? I look for rocks among the brambles, and the second I see one and lift it from the ground with my mind an idea occurs to me, an idea so crazy that it just might work.\n I drop the rock and walk to the back door. It has a simple lock, no deadbolt. I take a deep breath, close my eyes in concentration, and grab hold of the doorknob. I give it a shake. My thoughts move from head to heart to stomach; everything is centered there. My grip tightens, my breath is held in anticipation as I try to envision the inner workings. Then I feel and hear a click in the hand holding the knob. A smile forms on my face. I turn the knob and the door swings open. I can’t believe I can unlock doors by imagining what is inside of them.\n The kitchen is surprisingly clean, the surfaces wiped down, the sink free of dirty dishes. A new loaf of bread sits on the counter. I walk through a narrow corridor into a living room with sports posters and banners on the walls, a big-screen TV sitting in a corner. The door to a bedroom is off to the left side. I poke my head in. It’s in a state of disarray, covers thrown aside on the bed, clutter atop the dresser. The foul stench of dirty laundry covered in sweat that has never dried. \n","sourceLink":"https://allnovel.net/i-am-number-four-lorien-legacies-1/page-24.html","bookId":1675,"book":{"id":1675,"title":"I Am Number Four (Lorien Legacies #1)","description":"Storyline: \n I Am Number Four (Lorien Legacies #1) \n In the beginning they were a group of nine. Nine aliens who left their home planet of Lorien when it fell under attack by the evil Mogadorian. Nine aliens who scattered on Earth. Nine aliens who look like ordinary teenagers living ordinary lives, but who have extraordinary, paranormal skills. Nine aliens who might be sitting next to you now. The Nine had to separate and go into hiding. \n The Mogadorian caught Number One in Malaysia, Number Two in England, and Number Three in Kenya. All of them were killed. John Smith, of Paradise, Ohio, is Number Four. He knows that he is next. \n I AM NUMBER FOUR is the thrilling launch of a series about an exceptional group of teens as they struggle to outrun their past, discover their future—and live a normal life on Earth.\n \n","cover":"https://allnovel.net/images/i-am-number-four-lorien-legacies-1.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/i-am-number-four-lorien-legacies-1.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:48:40 AM"}}
