{"id":111063,"no":25,"title":"Page 25","content":"“Patience, Muriel. It’s been less than three weeks.”\n She shook her head. “That is not what I mean. I am his wife. I knew the man who went into the wilderness. I do not know the man who came out of it.”\n At that moment Damien Gravois appeared at her side. “There you are,” he cried softly. “I thought I had lost you.”\n Muriel smiled down upon his glowing countenance; he was a good two inches shorter.\n “Monsieur Henry asked me for a dance,” she teased. “S’il vous plait, pardonnez-moi.”\n “Bien sûr, but if Monsieur Henry persists in these outrageous attempts to steal my date away, I shall challenge him to a duel.”\n He turned to the doctor. “Now, Pellinore, I am taking the wagers for this year.” He pulled a slip of paper from his waistcoat. “I still have nine twenty, ten fifteen, and eleven thirty open if you’d care to—”\n “Gravois, you know I do not gamble.”\n He shrugged. Muriel laughed lightly at my bewildered expression. “For the fight, Will. It happens every year.”\n “The later times book up quickly,” put in Gravois. “The alcohol.”\n “Who fights?” I asked.\n “Practically everyone. The Germans always start it,” Gravois said with a sniff.\n “It was the Swiss contingent last year,” Muriel said.\n “You realize how utterly absurd that is,” Gravois said. “The Swiss!”\n “There are few things more hopelessly ridiculous, Will Henry,” said the doctor, “than an all-out brawl among scientists.”\n The brawl began a little after ten o’clock—at ten twenty-three precisely, according to Gravois’s watch (he was the designated timekeeper for that year)—when an Italian monstrumologist named Giuseppe Giovanni accidentally (or so claimed Dr. Giovanni later) bumped into the date of a Greek colleague, causing her to spill her champagne down the front of her silk gown. The Greek rewarded the Italian’s clumsiness with a roundhouse blow to the side of Giovanni’s head, which sent his pince-nez flying across the room and into the back of the head of a Dutchman named Vander Zanden, who perceived that the man dancing behind him—a French colleague of Gravois’s—had reached out and flicked him with his forefinger. The ensuing melee cleared the dance floor. Chairs smashed. Glasses and bottles shattered. Men shuffled across the floor with their arms wrapped around each other, impotently pounding their new partners on the back. The band played a rather rollicking ditty for a few minutes until the musicians were forced to flee after two men jumped onto the little stage and grabbed the music stands to hurl at each other’s heads. The police were called to break it up—the duty falling, again, to Gravois, the self-designated master of ceremonies—but it was all but over by the time the police arrived.\n “Who won the pool?” asked the doctor afterward.\n “You will not believe this, Pellinore,” answered Gravois.\n “You did.”\n “It is a miracle, is it not?”\n “Pity John couldn’t be here,” Warthrop said, taking in the devastation. “This was always his favorite part of the colloquium.”\n He did not speak to me until we returned to the Plaza.\n “Don’t do it now, but when we get to the door, take a look behind us, Will Henry. I believe we are being followed.”\n I followed his instructions, turning at the entrance to the hotel, whereupon I saw hurrying across Fifth Avenue a tall, gangly man of around twenty, a bowler hat pulled low over his ears. He was dressed in a shabby black jacket and threadbare trousers, the knees of which were worn nearly clear through.\n “Who is it?” I asked the doctor.\n “My erstwhile New York shadow,” he answered, and said no more.\n SEVENTEEN\n “Ich Habe Dich Auch Vermisst ”\n In those days the Society for the Advancement of the Science of Monstrumology—or “the Society,” as it was informally known—was headquartered on the corner of Twenty-second and Broadway, in an imposing structure designed in the neo-Gothic tradition, with narrow arched windows and doorways, soaring turrets, and snarling gargoyles hunkered at the cornices. Originally it had been an opera house, but the company had gone bankrupt in 1842 and had sold the building to the Society, which had refurbished the structure to fit its own peculiar needs.\n The main auditorium had been converted to a lecture hall and general assembly, where monstrumologists from around the world gathered for their annual congress. The second and third stories contained meeting rooms and administrative offices. The entire fourth floor had been gutted and remodeled into an extensive library that housed more than sixteen thousand volumes, including original manuscripts rescued from the Royal Library of Alexandria after Julius Caesar accidentally torched it in 48 b.c.\n I did not know what to expect at my first congress. All I knew was that my mentor looked forward to the annual event the way a child anticipates Christmas morn. Once each year the crème de la crème of this odd and most esoteric of professions gathered to share their latest discoveries, to expound upon the cutting-edge research and methods, and to gather what comfort they could in a convivial gathering of like-minded souls who, for whatever reason, felt compelled to spend their lives studying creatures the majority of humankind would rather see extinct.\n If I shared, by means of that peculiar osmosis of a keeper with his child, any of my master’s enthusiasm, it was soon squelched at the commencement of the congress. I passed the hours of that first day in the main auditorium, with only a thirty-minute respite for lunch, in a stultifying atmosphere of interminable speeches delivered in dry monotones by men who possessed no oratorical gifts whatsoever (some with accents so thick as to render the mother tongue unrecognizable) on topics equally dull and arcane.\n The congress formally began with a kind of roll call. The president pro tempore, the same Dr. Giovanni whose clumsiness had started the brawl the night before—he was sporting an impressive shiner and a large patch over his nose—stood at the lectern lugubriously reading aloud names from a long piece of foolscap, to which some in the hall responded with an “Aye!” and to which others made no reply at all.\n I watched—or rather endured—the proceedings from a vantage point high above the stage. We were seated upon a dilapidated divan inside the doctor’s private box, bestowed upon the family Warthrop by the Society in recognition of three generations of familial dedication to the cause. By ten o’clock, we had finally reached the F ’s, and the doctor was nearly beside himself with boredom. I suggested this would be an excellent time to catch up on his sleep—he had tossed and turned the night before—but my gentle proposition was met with withering disdain.\n The sole bit of excitement came with the announcement that the president of the Society, Dr. Abram von Helrung, would not be in attendance until the following day, with no explanation given for his absence. Rumors had been rife that something earthshaking was on the horizon—that von Helrung intended to drop a scientific bombshell at week’s end, a proposition that would shake the world of natural history to its foundation. To those few colleagues who had the temerity to sound out Warthrop on the matter, the doctor gave a curt response, refusing to validate the other rumor that followed the first on eagle’s wings—that upon the conclusion of von Helrung’s presentation, his former pupil, the renowned Pellinore Warthrop, intended to rise in reply.\n We were back in our rooms by six, which gave us more than an hour to dress for our dinner date with Dr. von Helrung. In any other circumstance this would have been more than enough time to change (the doctor, as I have noted elsewhere, was heedless to the point of disdain about his appearance). On this evening, however, Warthrop became as punctilious as the fussiest quaintrelle. I, as his impromptu valet, bore the brunt of his anxiety. His waistcoat was wrinkled. His shoes were scuffed. His cravat was crooked. After my third unsuccessful attempt to tie a proper knot, he pushed my hands away roughly and cried, “Never mind. I’ll do it!”\n His lecture on proper etiquette—“Sit up straight, say ‘please’ and ‘thank you’ and ‘may I,’ speak only when spoken to.” “The purpose and function of a finger bowl . . . ,” et cetera, et cetera—was mercifully interrupted by the arrival of Skala promptly at a quarter past. He grunted a good evening to the doctor and swept out through the doors without a backward glance, one hand buried in the bulging pocket of his peacoat—perhaps, I thought, he was caressing the butt end of a truncheon.\n As we exited the building, the doctor moaned under his breath. I looked around for the source of his distress and spied the same ragamuffin character from the night before loitering near the Fifty-ninth Street entrance to the park.\n The rig bounced as the huge Bohemian took his seat; the whip snapped and cracked; and then we were off at breakneck speed, whipping south onto Fifth Avenue, while our driver yelled curses and epithets at anything that dared get in his way, including pedestrians for whom, but a moment before, the act of crossing the street had not seemed a life-threatening proposition.\n Our journey was mercifully short—von Helrung’s four-story brownstone occupied the corner of Fifth and Fifty-first Street. Still, by its end, I was battered and bruised and my pounding heart strained the buttons of my shirt.\n We were met at the door by a person of color, a burly man whose girth rivaled that of Augustin Skala. He introduced himself as Bartholomew Gray, placed himself entirely at the doctor’s service, and then, with dignified and deliberate ambulation, escorted us into the well-appointed parlor.\n Our host fairly bounded across the room upon our entrance. He was a stocky barrel-chested man with short thick legs and small quick feet. His enormous square-shaped head was topped by an explosion of cottony white hair, and he had sparkling sapphire-colored eyes set deep beneath his bushy brows. His ruddy cheeks glowed with veritable delight at seeing his old friend and former pupil, and I watched dumbfounded as he gathered my aloof and undemonstrative master into a bear hug, pressing his face into the doctor’s stiffly starched waistcoat. My astonishment was compounded when Warthrop returned the gesture, stooping a bit to wrap his leaner, longer arms around the shorter man’s back.\n With tears shining in his eyes, von Helrung cried softly, “Pellinore, Pellinore, mein lieber Freund. It has been too long, ich habe dich vermisst!”\n “Meister Abram,” murmured the monstrumologist with genuine affection. “Ich habe dich auch vermisst. Du siehst gut aus.”\n “Oh, no, no,” remonstrated the thickset Austrian. “Es ist nicht wahr—I am old, dear Pellinore, and near the end of my days, but danke, thank you!”\n His flashing eyes fell upon me, and his joyful grin returned.\n “And this must be the illustrious William Henry, conqueror of the wilderness, of whom I’ve heard so much!”\n I bowed, extended my hand to him, and carefully repeated the greeting the doctor had taught me: “It is a pleasure and honor to meet you, Herr Doctor von Helrung.” \n","sourceLink":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2/page-25.html","bookId":2547,"book":{"id":2547,"title":"The Curse of the Wendigo (The Monstrumologist #2)","description":"Storyline: \n The Curse of the Wendigo (The Monstrumologist #2) \n While attempting to disprove that Homo vampiris, the vampire, could exist, Dr. Warthrop is asked by his former fiancé to rescue her husband from the Wendigo, a creature that starves even as it gorges itself on human flesh, and which has snatched him in the Canadian wilderness. Although Warthrop also considers the Wendigo to be fictitious, he relents and rescues her husband from death and starvation, and then sees the man transform into a Wendigo. \n Can the doctor and Will Henry hunt down the ultimate predator, who, like the legendary vampire, is neither living nor dead, whose hunger for human flesh is never satisfied? \n This second book in The Monstrumologist series explores the line between myth and reality, love and hate, genius and madness.\n \n","cover":"https://allnovel.net/images/the-curse-of-the-wendigo-the-monstrumologist-2.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:14:18 AM"}}
