{"id":111047,"no":5,"title":"Page 5","content":"The words were upon my lips—“Yes, sir!”—and in the nick of time I bit them back. He took no notice, however. The monstrumologist was on a tear.\\n\\n “Have all my efforts been for naught?” he cried to the ceiling, striking a fist against his pillow. “The sacrifices of time and privacy, the patient instruction and guidance, the special consideration I showed in honor of your father’s service to me—all for nothing? Really, what dividends have my efforts earned, Will Henry? For almost two years you’ve been with me, and when put to the test, your reply is the obsequious echo I might expect from the lowliest liveryman. So I shall ask it again: Do you have a brain?”\\n\\n “Y-yes, sir,” I stammered.\\n\\n “Oh, for the love of God, there you say it again!” he roared.\\n\\n “Of course I do!” I hollered back. I had finally reached the end of my endurance. This was not the first time I had been summoned by the shrill cry of Will Henreeeeeee! to the bedside of a self-absorbed lunatic who barely seemed to tolerate my existence. What did he want from me? Was I merely his whipping boy, a convenient dog to kick when frustration and childish angst overwhelmed him? Dark demons possessed him, I would never deny that, but they were not my demons.\\n\\n “The thing I said about appetite,” he said deliberately, clearly taken aback by my reaction, “applies to the emotions as well, Will Henry. There is no need to lose your temper.”\\n\\n “You lost yours,” I pointed out.\\n\\n “I had cause,” he returned, implying that I’d had none. “And at any rate, I would not advise you to follow my example in all things. Well, in hardly anything.” He laughed dryly. “Take the study of monstrumology . . .”\\n\\n I would rather not, thought I, but held my tongue.\\n\\n “I believe I’ve told you, Will Henry, that there is no university that offers instruction in the science of monstrumology—not yet, at any rate. Instead we receive our instruction from an acknowledged master. Though my own studies began under my father, in his day a monstrumologist of extraordinary gifts, they were finished under Abram von Helrung, the president of our Society and the author of that unfortunate treatise that seems to have sent John Chanler to his doom. For nearly six years I studied under von Helrung, even lived with him for a time—we both did, John and I. And since my relations with my father were strained, to put it mildly, it was not long before von Helrung became as a father to me, filling that paternal void as I fully believe I fulfilled the filial one.”\\n\\n He sighed. Even in the warm glow of the lamp, his face appeared deathly pale. His cheeks were shadow-filled hollows, and his eyes receded far into their sockets and were lined in charcoal gray.\\n\\n “It is a grievous loss, Will Henry—and not just to monstrumology,” he went on. I assumed he was talking about John Chanler, his fellow monstrumologist, whom Muriel had claimed he loved. He was not.\\n\\n “In astronomy, botany, psychology, physics—if anyone might be called the Leonardo da Vinci of his time, his name would be von Helrung. His parlor on Fifth Avenue has been home to one of the preeminent scientific salons in North America, graced by the likes of Edison and Tesla, Kelvin and Pasteur. He was a special adviser to the court of Czar Alexander and an honorary fellow of the Royal Society in London. His oratorical gifts rivaled those of Cicero. Why, I remember his presentation on the anatomical variances of the six species of the genus Ingenus during the congress of ’79, holding the hall spellbound for three solid hours—one of the most intellectually exhilarating experiences of my life, Will Henry. And now . . . this. How a scientist of John Chanler’s acumen could fall under the spell of such palpable nonsense is beyond all comprehension. I daresay even a child of average intelligence could refute it. Even you could, Will Henry, which is not meant to cast aspersions upon your intellect, but to point out the obvious parallel to that classic tale of the naked king.”\\n\\n “Naked king, sir?”\\n\\n “Yes, yes, you know the one,” he said testily. “There’s no need to patronize me, you know. While the masses clapped and cheered for his fine regalia, a little child called out from the crowd, ‘But he’s wearing no clothes!’ Just so, Chanler was always in awe of von Helrung—though not the only one, by any means. There has been more than one congress in which his remarks have been received by grown men as Moses cowering before the burning bush. No doubt Chanler raced off to Rat Portage to provide his beloved mentor with proof of his dubious proposition—a specimen of Lepto lurconis.”\\n\\n “What is a Lepto lurconis, Dr. Warthrop?” I asked.\\n\\n “I have told you, a myth.”\\n\\n “Yes, sir. But what kind of creature is it exactly?”\\n\\n “You really must brush up on your classical languages, Will Henry,” he chided me. “Its formal name is Lepto lurconis semihominis americanus. ‘Lepto’ is from the Greek. It means ‘gaunt’ or ‘abnormally thin’—emaciated. ‘Lurconis’ is Latin for ‘glutton.’ Thus: ‘the starving glutton.’ The rest, ‘semihominis americanus,’ I trust you can decipher for yourself.”\\n\\n “Yes, sir,” I said. “But what is it exactly?”\\n\\n He said nothing for a moment. He sighed deeply. He ran a hand through his bedraggled hair.\\n\\n “The hunger,” he breathed.\\n\\n “Hunger?”\\n\\n “The hunger, Will Henry. The kind that is never satisfied.”\\n\\n “What kind of hunger is never satisfied?” I wondered.\\n\\n “It rides on the wind,” the monstrumologist said, a faraway look in his dark eyes. “In the absolute dark of the wilderness, a fell voice calls your name, the voice of damnation’s desire, from the desolation that destroys . . .”\\n\\n I shivered. He did not sound like himself at all. I watched as his eyes darted back and forth, his gaze flitting over the ceiling, seeing something there that was beyond my power to see.\\n\\n “It is called Atcen . . . Djenu . . . Outiko . . . Vindiko. It has a dozen names in a dozen lands, and it is older than the hills, Will Henry. It feeds, and the more it feeds, the hungrier it becomes. It starves even as it gorges. It is the hunger that cannot be satisfied. In the Algonquin tongue its name literally means ‘the one who devours all mankind.’\\n\\n “You are young,” the monstrumologist said. “You have yet to hear it call your name. But from the moment it knows you, you are doomed. Doomed, Will Henry! There is no escaping it. It is a patient hunter and will endure all hardship, waiting to strike when you least expect it, and once you are in its icy grip, there is no hope of rescue. It bears you to unimaginable heights and plunges you to unfathomable depths. It crushes your soul; it breaks your breath in half. And, even as it eats you, you share in the feast. Yes! As you rise to the very gates of heaven, as you fall to the innermost circle of hell, you rejoice in the misery it brings—you become the hunger. Flying, you fall. Gorging, you starve. . . .”\\n\\n The doctor breathed deeply. Hard though it might be to accept, it seemed Pellinore Warthrop had run out of words. I waited for him to go on, puzzling over his cryptic dissertation upon the nature of the beast. In one breath he’d called it a myth and in the next had spoken of it as if it were entirely real. You are young. You have yet to hear it call your name. What did this mean? What had yet to call my name?\\n\\n The room was stuffy and warm—the doctor refused, even on the hottest of nights, to sleep with the windows open, a habit that was most likely common among monstrumologists—and under my nightshirt I had begun to sweat. Though his eyes remained fixed upon the ceiling, I had the discomforting sensation of being watched. The hairs on the back of my neck rose, and my heart quickened. Something was there, just outside my range of vision, incorporeal and ravenously hungry.\\n\\n “She is right, you know,” he said softly. “I am vain and vindictive, and I have always been a little in love with death. Perhaps I lost her because it was the one thing she could not give me. I had not thought of that. It is hard, Will Henry, very hard, to think about those things that we do not think about. One day you will understand that.”\\n\\n He rolled over onto his side, turning his back to me.\\n\\n “Now put out the light and go to bed. We leave for Rat Portage in the morning.”\\n\\n I retired to my little loft, where I tossed and turned for another hour or more, unable to fall into anything deeper than a fitful, transient doze. I could not shake the feeling that something lurked just outside the periphery of my vision, that the shadows held something, and that something knew my name.\\n\\n I saw Muriel standing in the rain, a vision rising from fecund memory, her gray shawl glistening with water, the light skittering along her wet lashes, the parting of her lips when she saw me standing in the doorway, and I am filled with astonishment and dismay.\\n\\n Suddenly she is gone and I am at my mother’s bedside, where I sit at her feet and watch her comb her long hair, and somewhere in the room is my father, but I cannot see him, and the golden light shimmers in my mother’s auburn hair. Her feet are bare and her wrists are thin and delicate, and the hypnotic rhythm of the brush coaxes the light to recline in perfect rows. And the light is golden all around her.\\n\\n The doctor called out from his room below, and I jerked upright, gasping like a drowning man breaking the surface. I started down the ladder, for his cries were loud and desperate and not totally unexpected, but I stopped at the bottom rung, for he was not calling for me. It was someone’s name, though it was not my own.\\n\\n FOUR\\n\\n “He Was My Best Friend, and How I Hated Him!”\\n\\n We embarked upon our impromptu rescue mission the following morning—to a place that has now vanished from the earth.\\n\\n Seventeen years after our expedition to that rough-and-tumble outpost on Canada’s western frontier, the town of Rat Portage merged with two sister settlements named Keewatin and Norman, each lending the first two letters of its name to the new incorporation: Ke-No-Ra. The change was brought about by the refusal of the Maple Leaf Flour Company to build in Rat Portage, fearing that the word “rat” on its bags might depress sales.\\n\\n Situated on the north shore of Lake of the Woods near the border of Ontario and Manitoba, the area around modern-day Kenora was known in the native tongue as Wauzhushk Onigum—literally the “portage to the country of the muskrat,” from which Rat Portage derived its name. Today the town is a mecca for sportsmen; in 1888, the hunting was of a different sort entirely. Gold had been discovered ten years before, transforming the sleepy little village into a bustling boomtown of swindlers and speculators, starry-eyed fortune seekers, and desperadoes of every stripe, with the occasional bandit, cutthroat, and scallywag thrown into the mix. Even the ladies of the town, it was said, dared not venture onto the boardwalk unarmed.\\n\\n Thank goodness for the gold, though! If it had not been discovered, our journey to the edge of the vast Canadian wilderness would have taken weeks. As it was, by the time of our expedition, the gold had transformed Rat Portage into a major distribution and supply hub of the Canadian Pacific Railway. Our journey took only three days, and those were spent in luxury aboard a well-appointed Pullman sleeper. \\n\\n","sourceLink":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2/page-5.html","bookId":2547,"book":{"id":2547,"title":"The Curse of the Wendigo (The Monstrumologist #2)","description":"Storyline: The Curse of the Wendigo (The Monstrumologist #2) \\n While attempting to disprove that Homo vampiris, the vampire, could exist, Dr. Warthrop is asked by his former fiancé to rescue her husband from the Wendigo, a creature that starves even as it gorges itself on human flesh, and which has snatched him in the Canadian wilderness. Although Warthrop also considers the Wendigo to be fictitious, he relents and rescues her husband from death and starvation, and then sees the man transform into a Wendigo. \\n Can the doctor and Will Henry hunt down the ultimate predator, who, like the legendary vampire, is neither living nor dead, whose hunger for human flesh is never satisfied? \\n This second book in The Monstrumologist series explores the line between myth and reality, love and hate, genius and madness.\\n","cover":"https://allnovel.net/images/the-curse-of-the-wendigo-the-monstrumologist-2.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-curse-of-the-wendigo-the-monstrumologist-2.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:14:18 AM"}}
