{"id":67888,"no":6,"title":"Page 6","content":"A sigh escaped Teri’s lips. “Bobby made it impossible not to. I’ll never forget the night he brought me a dozen romantic greeting cards, flowers and about fifty pounds of expensive chocolate.”\n Bobby had been trying to romance Teri, and according to his “research,” that was the way to do it. Naturally, being Bobby, he’d gone completely overboard.\n “How could I turn him down when he asked if he could kiss me?” Teri said plaintively.\n “You couldn’t,” Rachel agreed.\n “What can I say? The man swept me off my feet.”\n “You feel about Bobby the way I feel about Nate,” Rachel said and hoped Teri would leave it at that. All this talk about her and Bruce had unsettled her. She didn’t want to think of Jolene’s father as anything more than a friend.\n “No, you don’t,” Teri said softly. “You forget I know you, Rachel, probably better than anyone else here. We’ve been friends for a long time.”\n Rachel grew even more uncomfortable. She opened the microwave and took out her lunch. Steam rose from the entrée as she gingerly lifted it onto a small plate and carried it to the two-person table.\n “I know Nate wants to marry you.”\n Rachel had shared that information with Teri and regretted it now. “Your point is?”\n “My point is if you truly loved him, you wouldn’t have hesitated. You would’ve accepted his proposal, packed up your life and followed him to San Diego. You didn’t.”\n “Oh, honestly, Teri, if you’re gauging my feelings on that, you’re completely off-base.”\n “Am I?”\n “Yes,” she snapped. Sitting down at the table, she reached for a napkin and smoothed it over her lap. “Would you mind if we discussed something else now?”\n “I guess.”\n “Good.” She picked up the fork and sampled her first bite.\n Jeannie stepped into the compact kitchen. “Listen, about Bruce Peyton—”\n Rachel set down her fork with a clang, interrupting Jeannie’s statement, whatever it was. She didn’t want to hear his name again. If it wasn’t Teri, it was some other friend or colleague. People just wouldn’t let the subject drop and frankly she was bored with it. “What about him?” she asked with exaggerated patience.\n Jeannie opened the small refrigerator and grabbed a bottle of cold water. “A couple of my clients are hot to trot with him.”\n “I beg your pardon?”\n “He’s not hard on the eyes,” Jeannie said, twisting off the cap and taking a deep swallow. “They’ve been noticing him….”\n “Good for them,” Rachel murmured, returning to her lunch. “I hope it works out for him and whoever he’s dating.”\n “I don’t think he’s dating anyone,” Jeannie told her.\n “I have no idea.” That wasn’t actually true. Jolene kept her informed, and while Bruce did go out on occasion, those dates had never amounted to anything.\n Jeannie left the lunchroom, but Teri stayed. After a moment, she gently pressed Rachel’s shoulder.\n “You’ll know,” she murmured. “When it’s the right man, everything will be clear and you’ll wonder why it took you so long to see what was already there in front of you.”\n “That’s how it was with you and Bobby?” she couldn’t keep from asking.\n A joyful smile softened Teri’s face. “I promised myself I wouldn’t marry him. He had James deliver this huge diamond but I wasn’t going to do it. I had absolutely no intention of marrying Bobby Polgar. Good grief, I hadn’t even been to bed with him and here he was insisting I marry him.”\n Rachel smiled at the memory of Teri’s misery the night she’d come to see her. Miserable and in love and so afraid she’d ruin Bobby’s life if she married him.\n But Rachel could see, even then, that they were meant to be together. Bobby knew it, too, because he refused to let her go. Teri had figured it out fast enough; Rachel could only take hope from that.\n Jane walked in just then, breaking into Rachel’s musing. The happiness that lit her face when she saw Teri was all Rachel needed to know. Teri would be back at the salon where she belonged.\n Five\n Linnette McAfee’s heart was broken. She’d been in love for the first time in her life and it was over. Just like that. Over. Cal had gone off to rescue wild horses and while he was away, he’d fallen in love with Vicki Newman, the local vet.\n Linnette still couldn’t understand how it had happened—and yet, she could. It was her. Something was wrong with her. NotCal. Not Vicki. Her. Fresh tears filled her eyes as she indulged in this bout of self-pity.\n The doorbell chimed and she jumped at the sound. The last thing she wanted now was company. It could only be one of two people—her mother or her sister, Gloria—and she wasn’t in the mood to deal with either of them.\n Everyone was angry with her because she’d decided to leave Cedar Cove. Her friends at work, especially Chad Timmons, had said that if anyone left, it should be Cal. Well, he wasn’t leaving, and Linnette didn’t have it in her to watch Cal and Vicki together and pretend her heart wasn’t broken. All right, she was overreacting. She was being overdramatic. But she didn’t care.\n The doorbell chimed again, longer this time. She couldn’t ignore it, so she wiped the tears from her cheeks and forced a smile. It crumpled the instant she saw her mother.\n “Hi, Mom.”\n Corrie McAfee opened the screen door and stepped into the second-floor apartment. With comforting, cooing sounds, she put her arms around Linnette. “Oh honey, I’m so sorry.”\n “I know, I know.” Despite her efforts to be strong, Linnette buried her face in her mother’s shoulder. Sometimes a girl needed her mother and Linnette wasn’t too proud to admit it.\n “Let me make some tea,” Corrie said, leading her into the kitchen.\n While Linnette sat at the small table and pulled one tissue after another from the box, her mother set a kettle of water on the stove.\n “I was hoping to leave before this,” Linnette blubbered between hiccuping sobs. She wanted her mother to understand that she wasn’t going to be talked out of moving. “But the clinic needs me until a replacement can be hired and trained.”\n “You are going to stay a bit longer, aren’t you?”\n Linnette didn’t have any other choice. She couldn’t let the clinic go short-staffed; she’d worked there since it opened and the place meant a lot to her. But her job wasn’t the only problem. She’d signed a lease for the apartment and it was either pay the rent or find someone to sublet. That very day, she’d posted an ad online and in the local paper. She’d also talked to a rental agent. Unless she managed to get someone to take over the lease, she’d have to stay much longer than she wanted to.\n “I can’t stand to see you hurting like this,” Corrie said, taking two mugs from the cupboard. “This is as hard on me as it is on you. I don’t know what Cal was thinking.”\n “Oh, Mom! Cal can love anyone he wants.” Even after he’d ended the relationship, she couldn’t stop defending him. That was another reason she had to leave. Linnette still loved Cal, and because of that, she wanted him to be happy. If it meant he was with another woman, then…then she’d simply leave.\n The kettle whistled and steam shot into the air. Her mother removed it from the burner and poured the boiling water into the waiting pot, then added tea leaves. When she’d finished, she carried the pot of steeping tea to the kitchen table.\n Years ago, when Linnette was a schoolgirl, her mother had made tea for her whenever she was sick. But it wasn’t the flu or a stomachache that bothered her now, and she seriously doubted a cup of tea would ease her aching heart.\n “I’ve decided to put my things in storage,” Linnette said. She’d been considering what to do with her furniture for some time. Not that she had much to store. At first she’d assumed she could keep her belongings in her parents’ basement, but then she realized it was her responsibility, not her parents’.\n “Dad and I can keep them for you,” her mother offered, exactly as Linnette had known she would.\n “No, Mom, this is what I’m doing.” It would be easy to let her mother talk her out of her plans. The whole process would start with something small, some favor like the one she’d just suggested, and then gradually, Corrie would wear her down. Next thing she knew, Linnette would be staying in Cedar Cove.\n Her mother seemed surprised by Linnette’s persistence and shrugged her shoulders. “If you’re sure.”\n “I am,” Linnette reiterated.\n Corrie reached for the teapot and filled both their cups, muttering, “It’s a waste of good money.”\n “Perhaps.”\n “So…” Corrie tensed. “Where do you plan to go?”\n “I don’t know yet,” Linnette said noncommittally.\n This news appeared to startle her mother. “You mean to say you’re just heading out the door with no destination in mind?”\n Linnette nodded. “I guess so.”\n “That’s so unlike you.” Corrie looked even more distressed.\n “I’m sorry, Mom, but…” Linnette didn’t know how to finish her response; she had nothing reassuring to say.\n Her mother was right. Acting this impulsively was unlike her. She craved structure, needed it. Once she’d decided to become a Physician Assistant, she’d listed all the required courses, and calculated how long it would take to obtain her degree. Then, with the full force of her determination, she’d set out to achieve it. Never before, not on a trip or in life, had she left without a road map. Until now.\n “In other words, you’re running away,” her mother said anxiously.\n Linnette had no intention of denying it. “You could say that.” She took a sip of tea and not surprisingly it burned her mouth. She set down the mug.\n “Do you think that’s wise?”\n “Probably not. I’ll admit it’s not a rational decision, Mom. I’m responding to pain. I’m fully aware that none of this makes sense to you or anyone else. All I can tell you is that leaving feels right.”\n “Cal should move,” Corrie said in a stubborn voice.\n “Mother!”\n “He doesn’t have family here and you do.”\n “No one has to move anywhere,” she said. “I’m the one who wants to get out of Cedar Cove.”\n “Then go,” her mother said. “But don’t do it like this,” she pleaded. “Request a leave of absence from work. Take however long you need. But to quit like this, pack up your belongings and move out of your apartment, it’s so…”\n “Drastic?” Linnette inserted.\n “Yes, drastic,” her mother agreed. “I can’t imagine why you feel the need to flee like this with…with your tail between your legs. You didn’t do anything wrong.” \n","sourceLink":"https://allnovel.net/74-seaside-avenue-cedar-cove-7/page-6.html","bookId":1948,"book":{"id":1948,"title":"74 Seaside Avenue (Cedar Cove #7)","description":"Storyline: \n 74 Seaside Avenue (Cedar Cove #7) \n Dear Reader, I\u0027m living a life I couldn\u0027t even have\" dreamed\" of a few years ago. I\u0027m married to Bobby Polgar now (you know, the famous chess champion who just happens to be the man I love!). And we\u0027ve got this beautiful house with a view of Puget Sound. \n Lately something\u0027s been worrying Bobby, though. When I asked, he said he was \u0027protecting his queen\u0027 and I got the oddest feeling he wasn\u0027t talking about chess but about \"me.\" He wouldn\u0027t say anything else. \n Do you remember Get Nailed, the beauty salon in Cedar Cove? I still work there. I\u0027ll tell you about my friend Rachel, who\u0027s got two men interested in her (count \u0027em, \"two\"). And I\u0027ll let you in on what I\u0027ve heard about Linnette McAfee, who left town when her love life fell apart. (\"That\" kind of trouble I know all about.) Come in soon for a manicure and a chat, okay? \n Teri ( Miller) Polgar\n \n","cover":"https://allnovel.net/images/74-seaside-avenue-cedar-cove-7.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/74-seaside-avenue-cedar-cove-7.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:06:36 AM"}}
