{"id":18640,"no":18,"title":"CHAPTER XVII A HUNTER OF BUTTERFLIES","content":"I love men, not because they are men, but because they are not women.—Queen Christina. \n \n There was at that time in Montreal a sort of news room and public exchange, which made a place of general meeting. It was supplied with newspapers and the like, and kept up by subscriptions of the town merchants—a spacious room made out of the old Methodist chapel on St. Joseph Street. I knew this for a place of town gossip, and hoped I might hit upon something to aid me in my errand, which was no more than begun, it seemed. Entering the place shortly before noon, I made pretense of reading, all the while with an eye and an ear out for anything that might happen. \n \n As I stared in pretense at the page before me, I fumbled idly in a pocket, with unthinking hand, and brought out to place before me on the table, an object of which at first I was unconscious—the little Indian blanket clasp. As it lay before me I felt seized of a sudden hatred for it, and let fall on it a heavy hand. As I did so, I heard a voice at my ear. \n \n \"Mein Gott, man, do not! You break it, surely.\" \n \n I started at this. I had not heard any one approach. I discovered now that the speaker had taken a seat near me at the table, and could not fail to see this object which lay before me. \n \n \"I beg pardon,\" he said, in a broken speech which showed his foreign birth; \"but it iss so beautiful; to break it iss wrong.\" \n \n Something in his appearance and speech fixed my attention. He was a tall, bent man, perhaps sixty years of age, of gray hair and beard, with the glasses and the unmistakable air of the student. His stooped shoulders, his weakened eye, his thin, blue-veined hand, the iron-gray hair standing like a ruff above his forehead, marked him not as one acquainted with a wild life, but better fitted for other days and scenes. \n \n I pushed the trinket along the table towards him. \n \n \"\u0027Tis of little value,\" I said, \"and is always in the way when I would find anything in my pocket.\" \n \n \"But once some one hass made it; once it hass had value. Tell me where you get it?\" \n \n \"North of the Platte, in our western territories,\" I said. \"I once traded in that country.\" \n \n \"You are American?\" \n \n \"Yes.\" \n \n \"So,\" he said thoughtfully. \"So. A great country, a very great country. Me, I also live in it.\" \n \n \"Indeed?\" I said. \"In what part?\" \n \n \"It iss five years since I cross the Rockies.\" \n \n \"You have crossed the Rockies? I envy you.\" \n \n \"You meesunderstand me. I live west of them for five years. I am now come east.\" \n \n \"All the more, then, I envy you! You have perhaps seen the Oregon country? That has always been my dream.\" \n \n My eye must have kindled at that, for he smiled at me. \n \n \"You are like all Americans. They leave their own homes and make new governments, yess? Those men in Oregon haf made a new government for themselfs, and they tax those English traders to pay for a government which iss American!\" \n \n I studied him now closely. If he had indeed lived so long in the Oregon settlements, he knew far more about certain things than I did. \n \n \"News travels slowly over so great a distance,\" said I. \"Of course I know nothing of these matters except that last year and the year before the missionaries have come east to ask us for more settlers to come out to Oregon. I presume they want their churches filled.\" \n \n \"But most their farms!\" said the old man. \n \n \"You have been at Fort Vancouver?\" \n \n He nodded. \"Also to Fort Colville, far north; also to what they call California, far south; and again to what they may yet call Fort Victoria. I haf seen many posts of the Hudson Bay Company.\" \n \n I was afraid my eyes showed my interest; but he went on. \n \n \"I haf been, in the Columbia country, and in the Willamette country, where most of your Americans are settled. I know somewhat of California. Mr. Howard, of the Hudson Bay Company, knows also of this country of California. He said to those English gentlemans at our meeting last night that England should haf someting to offset California on the west coast; because, though Mexico claims California, the Yankees really rule there, and will rule there yet more. He iss right; but they laughed at him.\" \n \n \"Oh, I think little will come of all this talk,\" I said carelessly. \"It is very far, out to Oregon.\" Yet all the time my heart was leaping. So he had been there, at that very meeting of which I could learn nothing! \n \n \"You know not what you say. A thousand men came into Oregon last year. It iss like one of the great migrations of the peoples of Asia, of Europe. I say to you, it iss a great epoch. There iss a folk-movement such as we haf not seen since the days of the Huns, the Goths, the Vandals, since the Cimri movement. It iss an epoch, my friend! It iss fate that iss in it.\" \n \n \"So, then, it is a great country?\" I asked. \n \n \"It iss so great, these traders do not wish it known. They wish only that it may be savage; also that their posts and their harems may be undisturbed. That iss what they wish. These Scots go wild again, in the wilderness. They trade and they travel, but it iss not homes they build. Sir George Simpson wants steel traps and not ploughs west of the Rockies. That iss all!\" \n \n \"They do not speak so of Doctor McLaughlin,\" I began tentatively. \n \n \"My friend, a great man, McLaughlin, believe me! But he iss not McKay; he iss not Simpson; he iss not Behrens; he iss not Colville; he iss not Douglas. And I say to you, as I learned last night—you see, they asked me also to tell what I knew of Oregon—I say to you that last night McLaughlin was deposed. He iss in charge no more—so soon as they can get word to him, he loses his place at Vancouver.\" \n \n \"After a lifetime in the service!\" I commented. \n \n \"Yess, after a lifetime; and McLaughlin had brain and heart, too. If England would listen to him, she would learn sometings. He plants, he plows, he bass gardens and mills and houses and herds. Yess, if they let McLaughlin alone, they would haf a civilization on the Columbia, and not a fur-trading post. Then they could oppose your civilization there. That iss what he preaches. Simpson preaches otherwise. Simpson loses Oregon to England, it may be.\" \n \n \"You know much about affairs out in Oregon,\" I ventured again. \"Now, I did not happen to be present at the little meeting last night.\" \n \n \"I heard it all,\" he remarked carelessly, \"until I went to sleep. I wass bored. I care not to hear of the splendor of England!\" \n \n \"Then you think there is a chance of trouble between our country and England, out there?\" \n \n He smiled. \"It iss not a chance, but a certainty,\" he said. \"Those settlers will not gif up. And England is planning to push them out!\" \n \n \"We had not heard that!\" I ventured. \n \n \"It wass only agreed last night. England will march this summer seven hundred men up the Peace River. In the fall they will be across the Rockies. So! They can take boats easily down the streams to Oregon. You ask if there will be troubles. I tell you, yess.\" \n \n \"And which wins, my friend?\" I feared he would hear my heart thumping at this news. \n \n \"If you stop where you are, England wins. If you keep on going over the mountains England shall lose.\" \n \n \"What time can England make with her brigades, west-bound, my friend?\" I asked him casually. He answered with gratifying scientific precision. \n \n \"From Edmonton to Fort Colville, west of the Rockies, it hass been done in six weeks and five days, by Sir George himself. From Fort Colville down it iss easy by boats. It takes the voyageur three months to cross, or four months. It would take troops twice that long, or more. For you in the States, you can go faster. And, ah! my friend, it iss worth the race, that Oregon. Believe me, it iss full of bugs—of new bugs; twelve new species I haf discovered and named. It iss sometings of honor, iss it not?\" \n \n \"What you say interests me very much, sir,\" I said. \"I am only an American trader, knocking around to see the world a little bit. You seem to have been engaged in some scientific pursuit in that country.\" \n \n \"Yess,\" he said. \"Mein own government and mein own university, they send me to this country to do what hass not been done. I am insectologer. Shall I show you my bugs of Oregon? You shall see them, yess? Come with me to my hotel. You shall see many bugs, such as science hass not yet known.\" \n \n I was willing enough to go with him; and true to his word he did show me such quantities of carefully prepared and classified insects as I had not dreamed our own country offered. \n \n \"Twelve new species!\" he said, with pride. \"Mein own country will gif me honor for this. Five years I spend. Now I go back home. \n \n \"I shall not tell you what nickname they gif me in Oregon,\" he added, smiling; \"but my real name iss Wolfram von Rittenhofen. Berlin, it wass last my home. Tell me, you go soon to Oregon?\" \n \n \"That is very possible,\" I answered; and this time at least I spoke the truth. \"We are bound in opposite directions, but if you are sailing for Europe this spring, you would save time and gain comfort by starting from New York. It would give us great pleasure if we could welcome so distinguished a scientist in Washington.\" \n \n \"No, I am not yet distinguished. Only shall I be distinguished when I have shown my twelve new species to mein own university.\" \n \n \"But it would give me pleasure also to show you Washington. You should see also the government of those backwoodsmen who are crowding out to Oregon. Would you not like to travel with me in America so far as that?\" \n \n He shook his head doubtfully. \"Perhaps I make mistake to come by the St. Lawrence? It would be shorter to go by New York? Well, I haf no hurry. I think it over, yess.\" \n \n \"But tell me, where did you get that leetle thing?\" he asked me again presently, taking up in his hand the Indian clasp. \n \n \"I traded for it among the Crow Indians.\" \n \n \"You know what it iss, eh?\" \n \n \"No, except that it is Indian made.\" \n \n He scanned the round disks carefully. \"Wait!\" he exclaimed. \"I show you sometings.\" \n \n He reached for my pencil, drew toward him a piece of paper, taking from his pocket meantime a bit of string. Using the latter for a radius, he drew a circle on the piece of paper. \n \n \"Now look what I do!\" he said, as I bent over curiously. \"See, I draw a straight line through the circle. I divide it in half, so. I divide it in half once more, and make a point. Now I shorten my string, one-half. On each side of my long line I make me a half circle—only half way round on the opposite sides. So, now, what I got, eh? You understand him?\" \n \n I shook my head. He pointed in turn to the rude ornamentation in the shell clasp. I declare that then I could see a resemblance between the two designs! \n \n \"It is curious,\" I said. \n \n \"Mein Gott! it iss more than curious. It iss vonderful! I haf two Amazonias collected by my own bands, and twelve species of my own discovery, yess, in butterflies alone. That iss much? Listen. It iss notings! Here iss the discovery!\" \n \n He took a pace or two excitedly, and came back to thump with his forefinger on the little desk. \n \n \"What you see before you iss the sign of the Great Monad! It iss known in China, in Burmah, in all Asia, in all Japan. It iss sign of the great One, of the great Two. In your hand iss the Tah Gook—the Oriental symbol for life, for sex. Myself, I haf seen that in Sitka on Chinese brasses; I haf seen it on Japanese signs, in one land and in another land. But here you show it to me made by the hand of some ignorant aborigine of this continent! On this continent, where it did not originate and does not belong! It iss a discovery! Science shall hear of it. It iss the link of Asia to America. It brings me fame!\" \n \n He put his hand into a pocket, and drew it out half filled with gold pieces and with raw gold in the form of nuggets, as though he would offer exchange. I waved him back. \"No,\" said I; \"you are welcome to one of these disks, if you please. If you wish, I will take one little bit of these. But tell me, where did you find these pieces of raw gold?\" \n \n \"Those? They are notings. I recollect me I found these one day up on the Rogue River, not far from my cabin. I am pursuing a most beautiful moth, such as I haf not in all my collection. So, I fall on a log; I skin me my leg. In the moss I find some bits of rock. I recollect me not where, but believe it wass somewhere there. But what I find now, here, by a stranger—it iss worth more than gold! My friend, I thank you, I embrace you! I am favored by fate to meet you. Go with you to Washington? Yess, yess, I go!\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1513/45134.html","bookId":1304,"book":{"id":1304,"title":"54-40 or Fight","description":"简介： There is scarcely a single cause in which a woman is not engaged in some way fomenting the suit.Juvenal....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1513","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
