{"id":18655,"no":33,"title":"CHAPTER XXXII PAKENHAM\u0027S PRICE","content":"The happiest women, like nations, have no history. \\n\\n —George Eliot. \\n\\n \\n\\n The apartment into which I hurriedly stepped I found to be a long and narrow hall, heavily draped. A door or so made off on the right-hand side, and a closed door also appeared at the farther end; but none invited me to enter, and I did not care to intrude. This situation did not please me, because I must perforce hear all that went on in the rooms which I had just left. I heard the thick voice of a man, apparently none the better for wine. \\n\\n \\n\\n \"My dear,\" it began, \"I—\" Some gesture must have warned him. \\n\\n \\n\\n \"God bless my soul!\" he began again. \"Who is here, then? What is wrong?\" \\n\\n \\n\\n \"My father is here to-day,\" I heard her clear voice answer, \"and, as you suggest, it might perhaps be better—\" \\n\\n \\n\\n \"God bless my soul!\" he repeated. \"But, my dear, then I must go! To-night, then! Where is that other key? It would never do, you know—\" \\n\\n \\n\\n \"No, Sir Richard, it would never do. Go, then!\" spoke a low and icy voice, hers, yet not hers. \"Hasten!\" I heard her half whisper. \"I think perhaps my father—\" \\n\\n \\n\\n But it was my own footsteps they heard. This was something to which I could not be party. Yet, rapidly as I walked, her visitor was before me. I caught sight only of his portly back, as the street door closed behind him. She stood, her back against the door, her hand spread out against the wall, as though to keep me from passing. \\n\\n \\n\\n I paused and looked at her, held by the horror in her eyes. She made no concealment, offered no apologies, and showed no shame. I repeat that it was only horror and sadness mingled which I saw upon her face. \\n\\n \\n\\n \"Madam,\" I began. And again, \"Madam!\" and then I turned away. \\n\\n \\n\\n \"You see,\" she said, sighing. \\n\\n \\n\\n \"Yes, I fear I see; but I wish I did not. Can I not—may I not be mistaken?\" \\n\\n \\n\\n \"No, it is true. There is no mistake.\" \\n\\n \\n\\n \"What have you done? Why? Why?\" \\n\\n \\n\\n \"Did you not always credit me with being the good friend of Mr. Pakenham years ago—did not all the city? Well, then I was not; but I am, now! I was England\u0027s agent only—until last night. Monsieur, you have come too soon, too late, too late. Ah, my God! my God! Last night I gave at last that consent. He comes now to claim, to exact, to take—possession—of me ... Ah, my God!\" \\n\\n \\n\\n \"I can not, of course, understand you, Madam. What is it? Tell me!\" \\n\\n \\n\\n \"For three years England\u0027s minister besought me to be his, not England\u0027s, property. It was not true, what the town thought. It was not true in the case either of Yturrio. Intrigue—yes—I loved it. I intrigued with England and Mexico both, because it was in my nature; but no more than that. No matter what I once was in Europe, I was not here—not, as I said, until last night. Ah, Monsieur! Ah, Monsieur!\" Now her hands were beating together. \\n\\n \\n\\n \"But why then? Why then? What do you mean?\" I demanded. \\n\\n \\n\\n \"Because no other way sufficed. All this winter, here, alone, I have planned and thought about other means. Nothing would do. There was but the one way. Now you see why I did not go to Mr. Calhoun, why I kept my presence here secret.\" \\n\\n \\n\\n \"But you saw Elisabeth?\" \\n\\n \\n\\n \"Yes, long ago. My friend, you have won! You both have won, and I have lost. She loves you, and is worthy of you. You are worthy of each other, yes. I saw I had lost; and I told you I would pay my wager. I told you I would give you her—and Oregon! Well, then, that last was—hard.\" She choked. \"That was—hard to do.\" She almost sobbed. \"But I have—paid! Heart and soul ... and body ... I have ... paid! Now, he comes ... for ... the price!\" \\n\\n \\n\\n \"But then—but then!\" I expostulated. \"What does this mean, that I see here? There was no need for this. Had you no friends among us? Why, though it meant war, I myself to-night would choke that beast Pakenham with my own hands!\" \\n\\n \\n\\n \"No, you will not.\" \\n\\n \\n\\n \"But did I not hear him say there was a key—his key—to-night?\" \\n\\n \\n\\n \"Yes, England once owned that key. Now, he does. Yes, it is true. Since yesterday. Now, he comes ...\" \\n\\n \\n\\n \"But, Madam—ah, how could you so disappoint my belief in you?\" \\n\\n \\n\\n \"Because\"—she smiled bitterly—\"in all great causes there are sacrifices.\" \\n\\n \\n\\n \"But no cause could warrant this.\" \\n\\n \\n\\n \"I was judge of that,\" was her response. \"I saw her—Elisabeth—that girl. Then I saw what the future years meant for me. I tell you, I vowed with her, that night when I thought you two were wedded. I did more. I vowed myself to a new and wider world that night. Now, I have lost it. After all, seeing I could not now be a woman and be happy, I—Monsieur—I pass on to others, after this, not that torture of life, but that torturing principle of which we so often spoke. Yes, I, even as I am; because by this—this act—this sacrifice—I can win you for her. And I can win that wider America which you have coveted; which I covet for you—which I covet with you!\" \\n\\n \\n\\n I could do no more than remain silent, and allow her to explain what was not in the least apparent to me. After a time she went on. \\n\\n \\n\\n \"Now—now, I say—Pakenham the minister is sunk in Pakenham the man. He does as I demand—because he is a man. He signs what I demand because I am a woman. I say, to-night—but, see!\" \\n\\n \\n\\n She hastened now to a little desk, and caught up a folded document which lay there. This she handed to me, unfolded, and I ran it over with a hasty glance. It was a matter of tremendous importance which lay in those few closely written lines. \\n\\n \\n\\n England\u0027s minister offered, over the signature of England, a compromise of the whole Oregon debate, provided this country would accept the line of the forty-ninth degree! That, then, was Pakenham\u0027s price for this key that lay here. \\n\\n \\n\\n \"This—this is all I have been able to do with him thus far,\" she faltered. \"It is not enough. But I did it for you!\" \\n\\n \\n\\n \"Madam, this is more than all America has been able to do before! This has not been made public?\" \\n\\n \\n\\n \"No, no! It is not enough. But to-night I shall make him surrender all—all north, to the very ice, for America, for the democracy! See, now, I was born to be devoted, immolated, after all, as my mother was before me. That is fate! But I shall make fate pay! Ah, Monsieur! Ah, Monsieur!\" \\n\\n \\n\\n She flung herself to her feet. \"I can get it all for you, you and yours!\" she reiterated, holding out her hands, the little pink fingers upturned, as was often her gesture. \"You shall go to your chief and tell him that Mr. Polk was right—that you yourself, who taught Helena von Ritz what life is, taught her that after all she was a woman—are able, because she was a woman, to bring in your own hands all that country, yes, to fifty-four forty, or even farther. I do not know what all can be done. I only know that a fool will part with everything for the sake of his body.\" \\n\\n \\n\\n I stood now looking at her, silent, trying to fathom the vastness of what she said, trying to understand at all their worth the motives which impelled her. The largeness of her plan, yes, that could be seen. The largeness of her heart and brain, yes, that also. Then, slowly, I saw yet more. At last I understood. What I saw was a horror to my soul. \\n\\n \\n\\n \"Madam,\" said I to her, at last, \"did you indeed think me so cheap as that? Come here!\" I led her to the central apartment, and motioned her to a seat. \\n\\n \\n\\n \"Now, then, Madam, much has been done here, as you say. It is all that ever can be done. You shall not see Pakenham to-night, nor ever again!\" \\n\\n \\n\\n \"But think what that will cost you!\" she broke out. \"This is only part. It should all be yours.\" \\n\\n \\n\\n I flung the document from me. \"This has already cost too much,\" I said. \"We do not buy states thus.\" \\n\\n \\n\\n \"But it will cost you your future! Polk is your enemy, now, as he is Calhoun\u0027s. He will not strike you now, but so soon as he dares, he will. Now, if you could do this—if you could take this to Mr. Calhoun, to America, it would mean for you personally all that America could give you in honors.\" \\n\\n \\n\\n \"Honors without honor, Madam, I do not covet,\" I replied. Then I would have bit my tongue through when I saw the great pallor cross her face at the cruelty of my speech. \\n\\n \\n\\n \"And myself?\" she said, spreading out her hands again. \"But no! I know you would not taunt me. I know, in spite of what you say, there must be a sacrifice. Well, then, I have made it. I have made my atonement. I say I can give you now, even thus, at least a part of Oregon. I can perhaps give you all of Oregon—to-morrow! The Pakenhams have always dared much to gain their ends. This one will dare even treachery to his country. To-morrow—if I do not kill him—if I do not die—I can perhaps give you all of Oregon—bought—bought and ... paid!\" Her voice trailed off into a whisper which seemed loud as a bugle call to me. \\n\\n \\n\\n \"No, you can not give us Oregon,\" I answered. \"We are men, not panders. We fight; we do not traffic thus. But you have given me Elisabeth!\" \\n\\n \\n\\n \"My rival!\" She smiled at me in spite of all. \"But no, not my rival. Yes, I have already given you her and given you to her. To do that—to atone, as I said, for my attempt to part you—well, I will give Mr. Pakenham the key that Sir Richard Pakenham of England lately held. I told you a woman pays, body and soul! In what coin fate gave me, I will pay it. You think my morals mixed. No, I tell you I am clean! I have only bought my own peace with my own conscience! Now, at last, Helena von Ritz knows why she was born, to what end! I have a work to do, and, yes, I see it now—my journey to America after all was part of the plan of fate. I have learned much—through you, Monsieur.\" \\n\\n \\n\\n Hurriedly she turned and left me, passing through the heavy draperies which cut off the room where stood the great satin couch. I saw her cast herself there, her arms outflung. Slow, deep and silent sobs shook all her body. \\n\\n \\n\\n \"Madam! Madam!\" I cried to her. \"Do not! Do not! What you have done here is worth a hundred millions of dollars, a hundred thousand of lives, perhaps. Yes, that is true. It means most of Oregon, with honor, and without war. That is true, and it is much. But the price paid—it is more than all this continent is worth, if it cost so much as that Nor shall it!\" \\n\\n \\n\\n Black, with a million pin-points of red, the world swam around me. Millions of dead souls or souls unborn seemed to gaze at me and my unhesitating rage. I caught up the scroll which bore England\u0027s signature, and with one clutch cast it in two pieces on the floor. As it lay, we gazed at it in silence. Slowly, I saw a great, soft radiance come upon her face. The red pin-points cleared away from my own vision. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1513/45164.html","bookId":1304,"book":{"id":1304,"title":"54-40 or Fight","description":"简介： There is scarcely a single cause in which a woman is not engaged in some way fomenting the suit.Juvenal....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1513","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
