{"id":9503,"no":16,"title":"NEW EVIDENCE","content":"Arsenic Sold to Maybrick by Druggist \\n\\n \\n\\n MR. EDWIN GARNETT HEATON, a retired chemist (druggist), formerly carried on business at 14 Exchange Street East, Liverpool, for seventeen years; he retired from business in 1888. He testified at the trial: \\n\\n \\n\\n “Mr. Maybrick called frequently at my shop for about ten years or more, off and on. He used to get the tonic called ‘pick-me-up.’ He would come to the shop, get it, and drink it up. He gave me a prescription which altered it, which I put up with liquor arsenicalis. He brought the prescription for the first few times; I used afterward to give it him at once, when he came into the shop and gave his order. I prepared the ‘pick-me-up’ and added the stuff. At the beginning of giving it to[385] him, a certain quantity of liquor arsenicalis was given, and as it continued it was gradually increased from first to last, so at the last it was 75 per cent. greater in quantity than it was originally. He used to get it from two to five times a day, and each containing 75 per cent. increase.” \\n\\n \\n\\n This testimony of Mr. Heaton’s was challenged by the prosecution, and considerably nullified by the fact that he did not know Mr. Maybrick, his customer, by name, but identified him by a photograph. To show how inexorably one fatality after another was woven into the web of my tragic case, it is in order to state that Mr. Heaton’s connection with Mr. Maybrick could and would undoubtedly have been perfectly established but for what in the circumstances can be characterized only as a criminal blunder on the part of the police. In the printed police list of the score or more medicine bottles found locked in the private desk of Mr. Maybrick at his office was one entered as follows: “Spirit of salvolatile,[386] Edwin G. Easton, Exchange Street East, Liverpool.” This misprint of Easton for Heaton escaped the attention of everybody at the trial, and thus prevented the defense from identifying most circumstantially Mr. Maybrick with Mr. Heaton’s customer who had the arsenic habit. \\n\\n Arsenic Supplied to Maybrick by Manufacturing Chemist \\n\\n \\n\\n About ten years ago Mr. Valentine Charles Blake, of Victoria Embankment, son of a well-known baronet and Member of Parliament, made a voluntary statutory declaration [corroborated on oath in every possible essential by William Bryer Nation, of No. 7 Lion Street, a manufacturing chemist and patentee], that Mr. Maybrick, about two months before his death, procured through him (Mr. Blake), from Mr. Nation’s supplies, as much as 150 grains of arsenic in various forms. Mr. Nation, assisted by Mr. Blake, had made certain[387] chemical experiments in preparing ramie, the fiber of rhea grass, to serve as a substitute for cotton. Among other ingredients used was arsenic, some in pure form (white arsenic), some mixed with soot, and some mixed with charcoal. In January, 1889, the process was perfected, and some time during the same month Mr. Nation sent Mr. Blake to see Mr. Maybrick, to get his assistance in placing the product on the market. Mr. Maybrick was interested in the proposition and inquired closely into the nature of the process, what ingredients were used, etc. The deponent told him that, among other materials, arsenic was employed. \\n\\n \\n\\n Then, to quote the exact words of the deposition, Mr. Blake went on to say: \\n\\n \\n\\n “14. The said Mr. Maybrick shortly afterward, during discussion at the same interview, asked me whether I had heard that many inhabitants of Styria, in Austria, habitually took arsenic internally and throve upon it. I said that I had heard so.[388] He then spoke to me of De Quincey, the author of ‘Confessions of an Opium-Eater,’ and asked me had I read the work. I said, ‘Yes,’ and that I wondered De Quincey could have taken such a quantity as 900 drops of laudanum in a day. The said James Maybrick said, ‘One man’s poison is another man’s meat, and there is a so-called poison which is like meat and liquor to me whenever I feel weak and depressed. It makes me stronger in mind and in body at once,’ or words to that effect. I ventured to ask him what it was. He answered, ‘I don’t tell everybody, and wouldn’t tell you, only you mentioned arsenic. It is arsenic. I take it when I can get it, but the doctors won’t put any into my medicine except now and then a trifle, that only tantalizes me,’ or words to that effect. After a pause, during which I said nothing, the said James Maybrick said: ‘Since you use arsenic, can you let me have some? I find a difficulty in getting it here.’ I answered that I had some by me, and that, since I had only used it for experiments which were now perfected, I had no further use for it, and he (Maybrick) was[389] welcome to all I had left. He then asked me what it was worth, and offered to pay for it in advance. I replied that I had no license to sell drugs, and suggested that we should make it a quid pro quo. Mr. Maybrick was to do his best with the ramie grass product, and I was to make him a present of the arsenic I had. \\n\\n \\n\\n “15. It was finally agreed that when I came to Liverpool again, as arranged I should bring with me and hand him the arsenic aforesaid. \\n\\n \\n\\n “16. In February, 1889, I again called at the office of the said James Maybrick, in Liverpool, and, as promised, I handed him all the arsenic I had at my command, amounting to about 150 grains, some of the ‘white’ and some of the two kinds of ‘black’ arsenic, in three separate paper packets. I told him to be careful, as he had ‘almost enough to poison a regiment.’ When we separated the said James Maybrick took away the said arsenic with him, saying he was going home to his house at Aigburth, to which he invited me. Having a train to catch, I declined the invitation, promising to accept it on my next[390] visit to Liverpool, but before that occurred I read of his death. \\n\\n \\n\\n “17. After the wife of the said James Maybrick had been accused of his alleged murder, I wrote to Mr. Cleaver, her then solicitor, of Liverpool, to the effect that I could give some evidence which might be of use to his client, and I posted such letter but received no reply. \\n\\n \\n\\n “18. At this time I was intensely anxious as to the fate of my only son, Valentine Blake, who had in the previous year sailed on board the ship Melanasia from South Shields for Valparaiso, which ship was then very long overdue and unheard of. I eventually learned, as a result of a Board of Trade inquiry, that the said ship must have foundered with all hands, my only son included. At the time I wrote as aforesaid to Mr. Cleaver, my entire attention was engrossed in endeavoring to get news as to the ship which never came home, and I felt little interest in any other subject. Receiving no reply to my said letter to Mr. Cleaver, I took no further steps in the matter until, seeing recently in a newspaper that Mr. Jonathan E. Harris, of 95[391] Leadenhall Street, in the city of London, was now acting for Mrs. James Maybrick and her mother, the Baroness de Roques, I called at the offices of the said Mr. Harris and made to him a statement.” \\n\\n Depositions as to Mr. Maybrick’s Arsenic Habit \\n\\n \\n\\n On August 10, Henry Bliss, former proprietor of Sefton Club and Chambers, Liverpool, made a sworn deposition, in which he said: \\n\\n \\n\\n “Mr. Maybrick lived in the chambers on and off several months, and was in the habit of dosing himself. On one occasion he asked me to leave a prescription at a well-known Liverpool chemist’s to be made up by the time he left ‘Change. The chemist remarked: ‘He ought to be very careful and not take an overdose of it.’” \\n\\n \\n\\n On March 31, 1891, Franklin George Bancroft, artist and writer, of Columbia,[392] S. C., made a sworn deposition, in which he said: \\n\\n \\n\\n “1. Between the years 1874 and 1876 I was personally acquainted with James Maybrick, late of Battlecrease House, Aigburth, near Liverpool, merchant, deceased, who was then living in Norfolk, Va. I was frequently in his company, and from time to time I have seen him take from his vest pocket a case resembling a cigarette case, which contained a packet of white powders, and place the contents of one such powder on several occasions into the glass of wine (usually Chablis, claret, or champagne) he was at the time drinking, and swallow the same. \\n\\n \\n\\n “2. Seeing him take this powder, I did, on one occasion, ask him what it was, and the said James Maybrick replied, ‘Longevity and fair complexion, my boy!’ and he subsequently informed me that the said white powders were composed of arsenic among other ingredients.” \\n\\n \\n\\n Justice Stephen’s Retirement \\n\\n \\n\\n There are also facts in relation to the judge who tried the case which, had they been anticipated at the time of the trial, could not have failed to have had some weight, directly or indirectly, on the minds of the jury; that is to say, his retirement from the Bench not long afterward, in April, 1891, when, to quote his own words in addressing the Bar, of whom he was taking leave, “he had been made acquainted with the fact that he was regarded by some as no longer physically capable of discharging his duties”; and it will be no matter of surprise, to those who have read critically the summing-up of Mr. Justice Stephen on this trial, to notice the entire change from a favorable bias between his address to the jury on the first days of the trial to the violent hostility shown at its conclusion. \\n\\n \\n\\n This change of front can be in a manner accounted for, as it had been suggested to the prisoner’s friends, by a conversation on[394] the case between Mr. Justice Stephen and another member of the Bench, Mr. Justice Grantham, at a social meeting of an entirely private character. \\n\\n \\n\\n A mental malady was developed in the judge so soon after the trial that it was properly said to have been caused by his brooding over it, and this condition increased so rapidly and markedly that his resignation was demanded. It is but reasonable to suppose that the judge’s mental incapacity reached farther back than its discovery, and that the illogical and unjust summing-up was connected with the mental overthrow of the otherwise able judge. And it may be here added that Justice Stephen himself, in the second edition of the “General Views of the Criminal Law of England, 1890,” says, at page 173, that out of 979 cases tried before him, from January, 1885, to September, 1889, “the case of Mrs. Maybrick was the only case in which there could be any doubt about the facts.” \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1901/54765.html","bookId":923,"book":{"id":923,"title":"My Fifteen Lost Years","description":"简介： The writing of this book has been to me no joyful task, as its making has been at the expense of much-needed rest and peace of mind. In returning to my dear native land after a long imprisonment, I cherished the hope that I might as quietly as possib...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1901","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
