{"id":15438,"no":15,"title":"CHAPTER XIV. THE REJECTED SUITOR.","content":"After the interview between Herbert and his mother, it became an understood thing at Castle Richmond that he was engaged to Lady Clara. Sir Thomas raised no further objection, although it was clear to all the immediate family that he was by no means gratified at his son\u0027s engagement. Very little more passed between Sir Thomas and Lady Fitzgerald on the subject. He merely said that he would consider the question of his son\u0027s income, and expressed a hope, or perhaps an opinion rather than a hope, that the marriage would not take place quite immediately. \\n\\n \\n\\n Under these circumstances, Herbert hardly spoke further to his father upon the matter. He certainly did feel sore that he should be so treated—that he should be made to understand that there was a difficulty, but that the difficulty could not be explained to him. No absolute opposition was however made, and he would not therefore complain. As to money, he would say nothing till something should be said to him. \\n\\n \\n\\n With his mother, however, the matter was different. She had said that she would welcome Clara; and she did so. Immediately after speaking to Sir Thomas she drove over to Desmond Court, and said soft, sweet things to Clara in her most winning way;—said soft things also to the countess, who received them very graciously; took Clara home to Castle Richmond for that night, somewhat to the surprise and much to the gratification of Herbert, who found her sitting slily with the other girls when he came in before dinner; and arranged for her to make a longer visit after the interval of a week or two. Herbert, therefore, was on thoroughly good terms with his mother, and did enjoy some of the delights which he had promised himself. \\n\\n \\n\\n With his sisters, also, and especially with Emmeline, he was once more in a good humour. To her he made ample apology for his former crossness, and received ample absolution. \"I was so harassed,\" he said, \"by my father\u0027s manner that I hardly knew what I was doing. And even now, when I think of his evident dislike to the marriage, it nearly drives me wild.\" The truth of all which Emmeline sadly acknowledged. How could any of them talk of their father except in a strain of sadness? \\n\\n \\n\\n All these things did not happen in the drawing-room at Castle Richmond without also being discussed in the kitchen. It was soon known over the house that Master Herbert was to marry Lady Clara, and, indeed, there was no great pretence of keeping it secret. The girls told the duchess, as they called Mrs. Jones—of course in confidence—but Mrs. Jones knew what such confidence meant, especially as the matter was more than once distinctly alluded to by her ladyship; and thus the story was told, in confidence, to everybody in the establishment, and then repeated by them, in confidence also, to nearly everybody out of it. \\n\\n \\n\\n Ill news, they say, flies fast; and this news, which, going in that direction, became ill, soon flew to Hap House. \\n\\n \\n\\n \"So young Fitzgerald and the divine Clara are to hit it off, are they?\" said Captain Donnellan, who had driven over from Buttevant barracks to breakfast at Hap House on a hunting-morning. \\n\\n \\n\\n There were other men present, more intimate friends of Owen than this captain, who had known of Owen\u0027s misfortune in that quarter; and a sign was made to Donnellan to bid him drop the subject; but it was too late. \\n\\n \\n\\n \"Who? my cousin Herbert,\" said Owen, sharply. \"Have you heard of this, Barry?\" \\n\\n \\n\\n \"Well,\" said Barry, \"those sort of things are always being said, you know. I did hear something of it somewhere. But I can\u0027t say I thought much about it.\" And then the subject was dropped during that morning\u0027s breakfast. They all went to the hunt, and in the course of the day Owen contrived to learn that the report was well founded. \\n\\n \\n\\n That evening, as the countess and her daughter were sitting together over the fire, the gray-headed old butler brought in a letter upon an old silver salver, saying, \"For Lady Clara, if you please, my lady.\" \\n\\n \\n\\n The countess not unnaturally thought that the despatch had come from Castle Richmond, and smiled graciously as Clara put out her hand for the missive. Lady Desmond again let her eyes drop upon the book which she was reading, as though to show that she was by far too confiding a mamma to interfere in any correspondence between her daughter and her daughter\u0027s lover. At the moment Lady Clara had been doing nothing. Her work was, indeed, on her lap, and her workbox was at her elbow; but her thoughts had been far away; far away as regards idea, though not so as to absolute locality; for in her mind she was walking beneath those elm-trees, and a man was near her, with a horse following at his heels. \\n\\n \\n\\n \"The messenger is to wait for an answer, my lady,\" said the old butler, with a second nod, which on this occasion was addressed to Clara; and then the man withdrew. \\n\\n \\n\\n Lady Clara blushed ruby red up to the roots of her hair when her eyes fell on the address of the letter, for she knew it to be in the handwriting of Owen Fitzgerald. Perhaps the countess from the corner of her eye may have observed some portion of her daughter\u0027s blushes; but if so, she said nothing, attributing them to Clara\u0027s natural bashfulness in her present position. \"She will get over it soon,\" the countess may probably have said to herself. \\n\\n \\n\\n Clara was indecisive, disturbed in her mind, and wretched. Owen had sent her other letters; but they had been brought to her surreptitiously, had been tendered to her in secret, and had always been returned by her unopened. She had not told her mother of these; at least, not purposely or at the moment: but she had been at no trouble to conceal the facts; and when the countess had once asked, she freely told her what had happened with an absence of any confusion which had quite put Lady Desmond at her ease. But this letter was brought to her in the most open manner, and an answer to it openly demanded. \\n\\n \\n\\n She turned it round slowly in her hand, and then looking up, said, \"Mamma, this is from Owen Fitzgerald; what had I better do with it?\" \\n\\n \\n\\n \"From Owen Fitzgerald! Are you sure?\" \\n\\n \\n\\n \"Yes, mamma.\" And then the countess had also to consider what steps under such circumstances had better be taken. In the mean time Clara held out her hand, tendering the letter to her mother. \\n\\n \\n\\n \"You had better open it, my dear, and read it. No doubt it must be answered.\" Lady Desmond felt that now there could be no danger from Owen Fitzgerald. Indeed she thought that there was not a remembrance of him left in her daughter\u0027s bosom; that the old love, such baby-love as there had been, had vanished, quite swept out of that little heart by this new love of a brighter sort. But then Lady Desmond knew nothing of her daughter. \\n\\n \\n\\n So instructed, Clara broke the seal, and read the letter, which ran thus:— \\n\\n \\n\\n \\n\\n Hap House, February, 184—. \\n\\n \\n\\n My promised Love, \\n\\n \\n\\n For let what will happen, such you are; I have this morning heard tidings which, if true, will go far to drive me to despair. But I will not believe them from any lips save your own. I have heard that you are engaged to marry Herbert Fitzgerald. At once, however, I declare that I do not believe the statement. I have known you too well to think that you can be false. \\n\\n \\n\\n But, at any rate, I beg the favour of an interview with you. After what has passed I think that under any circumstances I have a right to demand it. I have pledged myself to you; and as that pledge has been accepted, I am entitled to some consideration. \\n\\n \\n\\n I write this letter to you openly, being quite willing that you should show it to your mother if you think fit. My messenger will wait, and I do implore you to send me an answer. And remember, Lady Clara, that, having accepted my love, you cannot whistle me down the wind as though I were of no account. After what has passed between us, you cannot surely refuse to see me once more. \\n\\n \\n\\n Ever your own—if you will have it so, \\n\\n \\n\\n Owen Fitzgerald. \\n\\n \\n\\n \\n\\n She read the letter very slowly, ever and anon looking up at her mother\u0027s face, and seeing that her mother was—not reading her book, but pretending to read it. When she had finished it, she held it for a moment, and then said, \"Mamma, will you not look at it?\" \\n\\n \\n\\n \"Certainly, my dear, if you wish me to do so.\" And she took the letter from her daughter\u0027s hand, and read it. \\n\\n \\n\\n \"Just what one would expect from him, my dear; eager, impetuous, and thoughtless. One should not blame him much, for he does not mean to do harm. But if he had any sense, he would know that he was taking trouble for nothing.\" \\n\\n \\n\\n \"And what shall I do, mamma?\" \\n\\n \\n\\n \"Well, I really think that I should answer him.\" It was delightful to see the perfect confidence which the mother had in her daughter. \"And I think I should see him, if he will insist upon it. It is foolish in him to persist in remembering two words which you spoke to him as a child; but perhaps it will be well that you should tell him yourself that you were a child when you spoke those two words.\" \\n\\n \\n\\n And then Clara sent off the following reply, written under her mother\u0027s dictation; though the countess strove very hard to convince her daughter that she was wording it out of her own head:— \\n\\n \\n\\n \\n\\n Lady Clara Desmond presents her compliments to Mr. Owen Fitzgerald, and will see Mr. Owen Fitzgerald at Desmond Court at two o\u0027clock to-morrow, if Mr. Owen Fitzgerald persists in demanding such an interview. Lady Clara Desmond, however, wishes to express her opinion that it would be better avoided. \\n\\n \\n\\n Desmond Court, \\n\\n Thursday evening. \\n\\n \\n\\n \\n\\n The countess thought that this note was very cold and formal, and would be altogether conclusive; but, nevertheless, at about eleven o\u0027clock that night there came another messenger from Hap House with another letter, saying that Owen would be at Desmond Court at two o\u0027clock on the following day. \\n\\n \\n\\n \"He is very foolish; that is all I can say,\" said the countess. \\n\\n \\n\\n All that night and all the next morning poor Clara was very wretched. That she had been right to give up a suitor who lived such a life as Owen Fitzgerald lived she could not doubt. But, nevertheless, was she true in giving him up? Had she made any stipulation as to his life when she accepted his love? If he called her false, as doubtless he would call her, how would she defend herself? Had she any defence to offer? It was not only that she had rejected him, a poor lover; but she had accepted a rich lover! What could she say to him when he upbraided her for such sordid conduct? \\n\\n \\n\\n And then as to her whistling him down the wind. Did she wish to do that? In what state did her heart stand towards him? Might it not be that, let her be ever so much on her guard, she would show him some tenderness,—tenderness which would be treason to her present affianced suitor? Oh, why had her mother desired her to go through such an interview as this! \\n\\n \\n\\n When two o\u0027clock came Clara was in the drawing-room. She had said nothing to her mother as to the manner in which this meeting should take place. But then at first she had had an idea that Lady Desmond would be present. But as the time came near Clara was still alone. When her watch told her that it was already two, she was still by herself; and when the old servant, opening the door, announced that Mr. Fitzgerald was there, she was still unsupported by the presence of any companion. It was very surprising that on such an occasion her mother should have kept herself away. \\n\\n \\n\\n She had not seen Owen Fitzgerald since that day when they had walked together under the elm-trees, and it can hardly be said that she saw him now. She had a feeling that she had injured him—had deceived, and in a manner betrayed him; and that feeling became so powerful with her that she hardly dared to look him in the face. \\n\\n \\n\\n He, when he entered the room, walked straight up to her, and offered her his hand. He, too, looked round the room to see whether Lady Desmond was there, and not finding her, was surprised. He had hardly hoped that such an opportunity would be allowed to him for declaring the strength of his passion. \\n\\n \\n\\n She got up, and taking his hand, muttered something; it certainly did not matter what, for it was inaudible; but such as the words were, they were the first spoken between them. \\n\\n \\n\\n \"Lady Clara,\" he began; and then stopped himself; and, considering, recommenced—\"Clara, a report has reached my ears which I will believe from no lips but your own.\" \\n\\n \\n\\n She now sat down on a sofa, and pointed to a chair for him, but he remained standing, and did so during the whole interview; or rather, walking; for when he became energetic and impetuous, he moved about from place to place in the room, as though incapable of fixing himself in one position. \\n\\n \\n\\n Clara was ignorant whether or no it behoved her to rebuke him for calling her simply by her Christian name. She thought that she ought to do so, but she did not do it. \\n\\n \\n\\n \"I have been told,\" he continued, \"that you have engaged yourself to marry Herbert Fitzgerald; and I have now come to hear a contradiction of this from yourself.\" \\n\\n \\n\\n \"But, Mr. Fitzgerald, it is true.\" \\n\\n \\n\\n \"It is true that Herbert Fitzgerald is your accepted lover?\" \\n\\n \\n\\n \"Yes,\" she said, looking down upon the ground, and blushing deeply as she said it. \\n\\n \\n\\n There was a pause of a few moments, during which she felt that the full fire of his glance was fixed upon her, and then he spoke. \\n\\n \\n\\n \"You may well be ashamed to confess it,\" he said; \"you may well feel that you dare not look me in the face as you pronounce the words. I would have believed it, Clara, from no other mouth than your own.\" \\n\\n \\n\\n It appeared to Clara herself now as though she were greatly a culprit. She had not a word to say in her own defence. All those arguments as to Owen\u0027s ill course of life were forgotten; and she could only remember that she had acknowledged that she loved him, and that she was now acknowledging that she loved another. \\n\\n \\n\\n But now Owen had made his accusation; and as it was not answered, he hardly knew how to proceed. He walked about the room, endeavouring to think what he had better say next. \\n\\n \\n\\n \"I know this, Clara; it is your mother\u0027s doing, and not your own. You could not bring yourself to be false, unless by her instigation.\" \\n\\n \\n\\n \"No,\" said she; \"you are wrong there. It is not my mother\u0027s doing: what I have done, I have done myself.\" \\n\\n \\n\\n \"Is it not true,\" he asked, \"that your word was pledged to me? Had you not promised me that you would be my wife?\" \\n\\n \\n\\n \"I was very young,\" she said, falling back upon the only excuse which occurred to her at the moment as being possible to be used without incriminating him. \\n\\n \\n\\n \"Young! Is not that your mother\u0027s teaching? Why, those were her very words when she came to me at my house. I did not know that youth was any excuse for falsehood.\" \\n\\n \\n\\n \"But it may be an excuse for folly,\" said Clara. \\n\\n \\n\\n \"Folly! what folly? The folly of loving a poor suitor; the folly of being willing to marry a man who has not a large estate! Clara, I did not think that you could have learned so much in so short a time.\" \\n\\n \\n\\n All this was very hard upon her. She felt that it was hard, for she knew that he had done that which entitled her to regard her pledge to him as at an end; but the circumstances were such that she could not excuse herself. \\n\\n \\n\\n \"Am I to understand,\" said Owen Fitzgerald, \"that all that has passed between us is to go for nothing? that such promises as we have made to each other are to be of no account? To me they are sacred pledges, from which I would not escape even if I could.\" \\n\\n \\n\\n As he then paused for a reply, she was obliged to say something. \\n\\n \\n\\n \"I hope you have not come here to upbraid me, Mr. Fitzgerald.\" \\n\\n \\n\\n \"Clara,\" he continued, \"I have passed the last year with perfect reliance upon your faith. I need hardly tell you that it has not been passed happily, for it has been passed without seeing you. But though you have been absent from me, I have never doubted you. I have known that it was necessary that we should wait—wait perhaps till years should make you mistress of your own actions: but nevertheless I was not unhappy, for I was sure of your love.\" \\n\\n \\n\\n Now it was undoubtedly the case that Fitzgerald was treating her unfairly; and though she had not her wits enough about her to ascertain this by process of argument, nevertheless the idea did come home to her. It was true that she had promised her love to this man, as far as such promise could be conveyed by one word of assent; but it was true also that she had been almost a child when she pronounced that word, and that things which had since occurred had entitled her to annul any amount of contract to which she might have been supposed to bind herself by that one word. She bethought herself, therefore, that as she was so hard pressed she was forced to defend herself. \\n\\n \\n\\n \"I was very young then, Mr. Fitzgerald, and hardly knew what I was saying: afterwards, when mamma spoke to me, I felt that I was bound to obey her.\" \\n\\n \\n\\n \"What, to obey her by forgetting me?\" \\n\\n \\n\\n \"No; I have never forgotten you, and never shall. I remember too well your kindness to my brother; your kindness to us all.\" \\n\\n \\n\\n \"Psha! you know I do not speak of that. Are you bound to obey your mother by forgetting that you have loved me?\" \\n\\n \\n\\n She paused a moment before she answered him, looking now full before her,—hardly yet bold enough to look him in the face. \\n\\n \\n\\n \"No,\" she said; \"I have not forgotten that I loved you. I shall never forget it. Child as I was, it shall never be forgotten. But I cannot love you now—not in the manner you would have me.\" \\n\\n \\n\\n \"And why not, Lady Clara? Why is love to cease on your part—to be thrown aside so easily by you, while with me it remains so stern a fact, and so deep a necessity? Is that just? When the bargain has once been made, should it not be equally binding on us both?\" \\n\\n \\n\\n \"I do not think you are fair to me, Mr. Fitzgerald,\" she said; and some spirit was now rising in her bosom. \\n\\n \\n\\n \"Not fair to you? Do you say that I am unfair to you? Speak but one word to say that the troth which you pledged me a year since shall still remain unbroken, and I will at once leave you till you yourself shall name the time when my suit may be renewed.\" \\n\\n \\n\\n \"You know that I cannot do that.\" \\n\\n \\n\\n \"And why not? I know that you ought to do it.\" \\n\\n \\n\\n \"No, Mr. Fitzgerald, I ought not. I am now engaged to your cousin, with the consent of mamma and of his friends. I can say nothing to you now which I cannot repeat to him; nor can I say anything which shall oppose his wishes.\" \\n\\n \\n\\n \"He is then so much more to you now than I am?\" \\n\\n \\n\\n \"He is everything to me now.\" \\n\\n \\n\\n \"That is all the reply I am to get then! You acknowledge your falseness, and throw me off without vouchsafing me any answer beyond this.\" \\n\\n \\n\\n \"What would you have me say? I did do that which was wrong and foolish, when—when we were walking there on the avenue. I did give a promise which I cannot now keep. It was all so hurried that I hardly remember what I said. But of this I am sure, that if I have caused you unhappiness, I am very sorry to have done so. I cannot alter it all now; I cannot unsay what I said then; nor can I offer you that which I have now absolutely given to another.\" \\n\\n \\n\\n And then, as she finished speaking, she did pluck up courage to look him in the face. She was now standing as well as he; but she was so standing that the table, which was placed near the sofa, was still between him and her. As she finished speaking the door opened, and the Countess of Desmond walked slowly into the room. \\n\\n \\n\\n Owen Fitzgerald, when he saw her, bowed low before her, and then frankly offered her his hand. There was something in his manner to ladies devoid of all bashfulness, and yet never too bold. He seemed to be aware that in speaking to any lady, be she who she might, he was only exercising his undoubted privilege as a man. He never hummed and hawed and shook in his shoes as though the majesty of womanhood were too great for his encounter. There are such men, and many of them, who carry this dread to the last day of their long lives. I have often wondered what women think of men who regard women as too awful for the free exercise of open speech. \\n\\n \\n\\n \"Mr. Fitzgerald,\" she said, accepting the hand which he offered to her, but resuming her own very quickly, and then standing before him in all the dignity which she was able to assume, \"I quite concurred with my daughter that it was right that she should see you, as you insisted on such an interview; but you must excuse me if I interrupt it. I must protect her from the embarrassment which your—your vehemence may occasion her.\" \\n\\n \\n\\n \"Lady Desmond,\" he replied, \"you are quite at liberty, as far as I am concerned, to hear all that passes between us. Your daughter is betrothed to me, and I have come to claim from her the fulfilment of her promise.\" \\n\\n \\n\\n \"For shame, Mr. Fitzgerald, for shame! When she was a child you extracted from her one word of folly; and now you would take advantage of that foolish word; now, when you know that she is engaged to a man she loves with the full consent of all her friends. I thought I knew you well enough to feel sure that you were not so ungenerous.\" \\n\\n \\n\\n \"Ungenerous! no; I have not that generosity which would enable me to give up my very heart\u0027s blood, the only joy of my soul, to such a one as my cousin Herbert.\" \\n\\n \\n\\n \"You have nothing to give up, Mr. Fitzgerald: you must have known from the very first that my daughter could not marry you—\" \\n\\n \\n\\n \"Not marry me! And why not, Lady Desmond? Is not my blood as good as his?—unless, indeed, you are prepared to sell your child to the highest bidder!\" \\n\\n \\n\\n \"Clara, my dear, I think you had better leave the room,\" said the countess; \"no doubt you have assured Mr. Fitzgerald that you are engaged to his cousin Herbert.\" \\n\\n \\n\\n \"Yes, mamma.\" \\n\\n \\n\\n \"Then he can have no further claim on your attendance, and his vehemence will terrify you.\" \\n\\n \\n\\n \"Vehement! how can I help being vehement when, like a ruined gambler, I am throwing my last chance for such a stake?\" \\n\\n \\n\\n And then he intercepted Clara as she stepped towards the drawing-room door. She stopped in her course, and stood still, looking down upon the ground. \\n\\n \\n\\n \"Mr. Fitzgerald,\" said the countess, \"I will thank you to let Lady Clara leave the room. She has given you the answer for which you have asked, and it would not be right in me to permit her to be subjected to further embarrassment.\" \\n\\n \\n\\n \"I will only ask her to listen to one word. Clara—\" \\n\\n \\n\\n \"Mr. Fitzgerald, you have no right to address my daughter with that freedom,\" said the countess; but Owen hardly seemed to hear her. \\n\\n \\n\\n \"I here, in your hearing, protest against your marriage with Herbert Fitzgerald. I claim your love as my own. I bid you think of the promise which you gave me; and I tell you that as I loved you then with all my heart, so do I love you at this moment; so shall I love you always. Now I will not hinder you any longer.\" \\n\\n \\n\\n And then he opened the door for her, and she passed on, bowing to him, and muttering some word of farewell that was inaudible. \\n\\n \\n\\n He stood for a moment with the door in his hand, meditating whether he might not say good morning to the countess without returning into the room; but as he so stood she called him. \"Mr. Fitzgerald,\" she said; and so he therefore came back, and once more closed the door. \\n\\n \\n\\n And then he saw that the countenance of Lady Desmond was much changed. Hitherto she had been every inch the countess, stern and cold and haughty; but now she looked at him as she used to look in those old winter evenings when they were accustomed to talk together over the evening fire in close friendliness, while she, Lady Desmond, would speak to him in the intimacy of her heart of her children, Patrick and Clara. \\n\\n \\n\\n \"Mr. Fitzgerald,\" she said, and the tone of her voice also was changed. \"You are hardly fair to us; are you?\" \\n\\n \\n\\n \"Not fair, Lady Desmond?\" \\n\\n \\n\\n \"No, not fair. Sit down now, and listen to me for a moment. If you had a child, a penniless girl like Clara, would you be glad to see her married to such a one as you are yourself?\" \\n\\n \\n\\n \"In what way do you mean? Speak out, Lady Desmond.\" \\n\\n \\n\\n \"No; I will not speak out, for I would not hurt you. I myself am too fond of you—as an old friend, to wish to do so. That you may marry and live happily, live near us here, so that we may know you, I most heartily desire. But you cannot marry that child.\" \\n\\n \\n\\n \"And why not, if she loves me?\" \\n\\n \\n\\n \"Nay, not even if she did. Wealth and position are necessary to the station in which she has been born. She is an earl\u0027s daughter, penniless as she is. I will have no secrets from you. As a mother, I could not give her to one whose career is such as yours. As the widow of an earl, I could not give her to one whose means of maintaining her are so small. If you will think of this, you will hardly be angry with me.\" \\n\\n \\n\\n \"Love is nothing then?\" \\n\\n \\n\\n \"Is all to be sacrificed to your love? Think of it, Mr. Fitzgerald, and let me have the happiness of knowing that you consent to this match.\" \\n\\n \\n\\n \"Never!\" said he. \"Never!\" And so he left the room, without wishing her further farewell. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2728/75145.html","bookId":1403,"book":{"id":1403,"title":"Castle Richmond","description":"简介： Castle Richmond was written in 1861, long after Trollope had left Ireland. The characterization is weak, and the plot, although the author himself thought well of it, mechanical....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2728","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
