{"id":15446,"no":23,"title":"CHAPTER XXII. THE TELLING OF THE TALE.","content":"The dinner passed away as the former dinners had done; and as soon as Aunt Letty got up Mr. Prendergast also rose, and touching Herbert on his shoulder, whispered into his ear, \"You\u0027ll come to me at eight then.\" Herbert nodded his head; and when he was alone he looked at his watch. These slow dinners were not actually very long, and there still remained to him some three-quarters of an hour for anticipation. \n \n What was to be the nature of this history? That it would affect himself personally in the closest manner he could not but know. There seemed to be no doubt on the minds of any of them that the affair was one of money, and his father\u0027s money questions were his money questions. Mr. Prendergast would not have been sent for with reference to any trifle; nor would any pecuniary difficulty that was not very serious have thrown his father into such a state of misery. Could it be that the fair inheritance was absolutely in danger? \n \n Herbert Fitzgerald was by no means a selfish man. As regarded himself, he could have met ruin in the face with more equanimity than most young men so circumstanced. The gilt of the world had not eaten into his soul; his heart was not as yet wedded to the splendour of pinchbeck. This is saying much for him; for how seldom is it that the hearts and souls of the young are able to withstand pinchbeck and gilding? He was free from this pusillanimity; free as yet as regarded himself; but he was hardly free as regarded his betrothed. He had promised her, not in spoken words but in his thoughts, rank, wealth, and all the luxuries of his promised high position; and now on her behalf, it nearly broke his heart to think that they might be endangered. \n \n Of his mother\u0027s history, he can hardly be said to have known anything. That there had been something tragic in her early life; that something had occurred before his father\u0027s marriage; and that his mother had been married twice, he had learned,—he hardly knew when or from whom. But on such matters there had never been conversation between him and any of his own family; and it never occurred to him that all this sorrow arose in any way from this subject. That his father had taken some fatal step with regard to the property—had done some foolish thing for which he could not forgive himself, that was the idea with which his mind was filled. \n \n He waited, with his watch in his hand, till the dial showed him that it was exactly eight; and then, with a sinking heart, he walked slowly out of the dining-room along the passage, and into his father\u0027s study. For an instant he stood with the handle in his hand. He had been terribly anxious for the arrival of this moment, but now that it had come, he would almost fain have had it again postponed. His heart sank very low as he turned the lock, and entering, found himself in the presence of Mr. Prendergast. \n \n Mr. Prendergast was standing with his back to the fire. For him, too, the last hour had been full of bitterness; his heart also had sunk low within him; his blood had run cold within his veins: he too, had it been possible, would have put off this wretched hour. \n \n Mr. Prendergast, it may be, was not much given to poetry; but the feeling, if not the words, were there within him. The work which a friend has to perform for a friend is so much heavier than that which comes in the way of any profession! \n \n When Herbert entered the room, Mr. Prendergast came forward from where he was standing, and took him by the hand. \"This is a very sad affair,\" he said; \"very sad.\" \n \n \"At present I know nothing about it,\" said Herbert. \"As I see people about me so unhappy, I suppose it is sad. If there be anything that I hate, it is a mystery.\" \n \n \"Sit down, Mr. Fitzgerald,\" said the other; \"sit down.\" And Mr. Prendergast himself sat down in the chair that was ordinarily occupied by Sir Thomas. Although he had been thinking about it all the day, he had not even yet made up his mind how he was to begin his story. Even now he could not help thinking whether it might be possible for him to leave it untold. But it was not possible. \n \n \"Mr. Fitzgerald,\" said he, \"you must prepare yourself for tidings which are very grievous indeed—very grievous.\" \n \n \"Whatever it is I must bear it,\" said he. \n \n \"I hope you have that moral strength which enables a man to bear misfortune. I have not known you in happy days, and therefore perhaps can hardly judge; but it seems to me that you do possess such courage. Did I not think so, I could hardly go through the task that is before me.\" \n \n Here he paused as though he expected some reply, some assurance that his young friend did possess this strength of which he spoke; but Herbert said nothing—nothing out loud. \"If it were only for myself! if it were only for myself!\" It was thus that he spoke to his own heart. \n \n \"Mr. Fitzgerald,\" continued the lawyer, \"I do not know how far you may be acquainted with the history of your mother\u0027s first marriage.\" \n \n Herbert said that he was hardly acquainted with it in any degree; and explained that he merely knew the fact that his mother had been married before she met Sir Thomas. \n \n \"I do not know that I need recount all the circumstances to you now, though doubtless you will learn them. Your mother\u0027s conduct throughout was, I believe, admirable.\" \n \n \"I am quite sure of that. No amount of evidence could make me believe the contrary.\" \n \n \"And there is no tittle of evidence to make any one think so. But in her early youth, when she was quite a child, she was given in marriage to a man—to a man of whom it is impossible to speak in terms too black, or in language too strong. And now, this day—\" \n \n But here he paused. It had been his intention to say that that very man, the first husband of this loved mother now looked upon as dead for so many years, this miscreant of whom he had spoken—that this man had been in that room that very day. But he hardly knew how to frame the words. \n \n \"Well,\" said Herbert, \"well;\" and he spoke in a hoarse voice that was scarcely audible. \n \n Mr. Prendergast was afraid to bring out the very pith of his story in so abrupt a manner. He wished to have the work over, to feel, that as regarded Herbert it was done,—but his heart failed him when he came to it. \n \n \"Yes,\" he said, going back as it were to his former thoughts. \"A heartless, cruel, debauched, unscrupulous man; one in whose bosom no good thing seemed to have been implanted. Your father, when he first knew your mother, had every reason to believe that this man was dead.\" \n \n \"And he was not dead?\" Mr. Prendergast could see that the young man\u0027s face became perfectly pale as he uttered these words. He became pale, and clutched hold of the table with his hand, and there sat with mouth open and staring eyes. \n \n \"I am afraid not,\" said Mr. Prendergast; \"I am afraid not.\" \n \n \"And—\" \n \n \"I must go further than that, and tell you that he is still living.\" \n \n \"Mr. Prendergast, Mr. Prendergast!\" exclaimed the poor fellow, rising up from his chair and shouting out as though for mercy. Mr. Prendergast also rose from his seat, and coming up to him took him by the arm. \"My dear boy, my dear boy, I am obliged to tell you. It is necessary that you should know it. The fact is as I say, and it is now for you to show that you are a man.\" \n \n Who was ever called upon for a stronger proof of manhood than this? In nine cases out of ten it is not for oneself that one has to be brave. A man, we may almost say, is no man, whose own individual sufferings call for the exercise of much courage. But we are all so mixed up and conjoined with others—with others who are weaker and dearer than ourselves, that great sorrows do require great powers of endurance. \n \n By degrees, as he stood there in silence, the whole truth made its way into his mind,—as he stood there with his arm still tenderly pressed by that old man. No one now would have called the lawyer stern in looking at him, for the tears were coursing down his cheeks. But no tears came to the relief of young Fitzgerald as the truth slowly came upon him, fold by fold, black cloud upon cloud, till the whole horizon of his life\u0027s prospect was dark as death. He stood there silent for some few minutes hardly conscious that he was not alone, as he saw all his joys disappearing from before his mind\u0027s eye, one by one; his family pride, the pleasant high-toned duties of his station, his promised seat in Parliament and prosperous ambition, the full respect of all the world around him, his wealth and pride of place—for let no man be credited who boasts that he can part with these without regret. All these were gone. But there were losses more bitter than these. How could he think of his affianced bride? and how could he think of his mother? \n \n No tears came to his relief while the truth, with all its bearings, burnt itself into his very soul, but his face expressed such agony that it was terrible to be seen. Mr. Prendergast could stand that silence no longer, so at last he spoke. He spoke,—for the sake of words; for all his tale had been told. \n \n \"You saw the man that was here yesterday? That was he, who then called himself Talbot.\" \n \n \"What! the man that went away in the car? Mollett?\" \n \n \"Yes; that was the man.\" \n \n Herbert had said that no evidence could be sufficient to make him believe that his mother had been in any way culpable: and such probably was the case. He had that reliance on his mother—that assurance in his mind that everything coming from her must be good—that he could not believe her capable of ill. But, nevertheless, he could not prevent himself from asking within his own breast, how it had been possible that his mother should ever have been concerned with such a wretch as that. It was a question which could not fail to make itself audible. What being on earth was sweeter than his mother, more excellent, more noble, more fitted for the world\u0027s high places, more absolutely entitled to that universal respect which seemed to be given to her as her own by right? And what being could be more loathsome, more contemptible than he, who was, as he was now told, his mother\u0027s husband? There was in it a want of verisimilitude which almost gave him comfort,—which almost taught him to think that he might disbelieve the story that was told to him. Poor fellow! he had yet to learn the difference that years may make in men and women—for better as well as for worse. Circumstances had given to the poor half-educated village girl the simple dignity of high station; as circumstances had also brought to the lowest dregs of human existence the man, whose personal bearing, and apparent worldly standing had been held sufficient to give warrant that he was of gentle breeding and of honest standing; nay, her good fortune in such a marriage had once been almost begrudged her by all her maiden neighbours. \n \n But Herbert, as he thought of this, was almost encouraged to disbelieve the story. To him, with his knowledge of what his mother was, and such knowledge as he also had of that man, it did not seem possible. \"But how is all this known?\" he muttered forth at last. \n \n \"I fear there is no doubt of its truth,\" said Mr. Prendergast. \"Your father has no doubt whatever; has had none—I must tell you this plainly—for some months.\" \n \n \"For some months! And why have I not been told?\" \n \n \"Do not be hard upon your father.\" \n \n \"Hard! no; of course I would not be hard upon him.\" \n \n \"The burden he has had to bear has been very terrible. He has thought that by payments of money to this man the whole thing might be concealed. As is always the case when such payments are made, the insatiable love of money grew by what it fed on. He would have poured out every shilling into that man\u0027s hands, and would have died, himself a beggar—have died speedily too under such torments—and yet no good would have been done. The harpy would have come upon you; and you—after you had innocently assumed a title that was not your own and taken a property to which you have no right, you then would have had to own—that which your father must own now.\" \n \n \"If it be so,\" said Herbert, slowly, \"it must be acknowledged.\" \n \n \"Just so, Mr. Fitzgerald; just so. I know you will feel that—in such matters we can only sail safely by the truth. There is no other compass worth a man\u0027s while to look at.\" \n \n \"Of course not,\" said Herbert, with hoarse voice. \"One does not wish to be a robber and a thief. My cousin shall have what is his own.\" And then he involuntarily thought of the interview they had had on that very day. \"But why did he not tell me when I spoke to him of her?\" he said, with something approaching to bitterness in his voice and a slight struggle in his throat that was almost premonitory of a sob. \n \n \"Ah! it is there that I fear for you. I know what your feelings are; but think of his sorrows, and do not be hard on him.\" \n \n \"Ah me, ah me!\" exclaimed Herbert. \n \n \"I fear that he will not be with you long. He has already endured till he is now almost past the power of suffering more. And yet there is so much more that he must suffer!\" \n \n \"My poor father!\" \n \n \"Think what such as he must have gone through in bringing himself into contact with that man; and all this has been done that he might spare you and your mother. Think of the wound to his conscience before he would have lowered himself to an unworthy bargain with a swindler. But this has been done that you might have that which you have been taught to look on as your own. He has been wrong. No other verdict can be given. But you, at any rate, can be tender to such a fault; you and your mother.\" \n \n \"I will—I will,\" said Herbert. \"But if it had happened a month since I could have borne it.\" And then he thought of his mother, and hated himself for what he had said. How could he have borne that with patience? \"And there is no doubt, you say?\" \n \n \"I think none. The man carries his proofs with him. An old servant here in the house, too, knows him.\" \n \n \"What, Mrs. Jones?\" \n \n \"Yes; Mrs. Jones. And the burden of further proof must now, of course, be thrown on us,—not on him. Directly that we believe the statement, it is for us to ascertain its truth. You and your father must not be seen to hold a false position before the world.\" \n \n \"And what are we to do now?\" \n \n \"I fear that your mother must be told, and Mr. Owen Fitzgerald; and then we must together openly prove the facts, either in one way or in the other. It will be better that we should do this together;—that is, you and your cousin Owen conjointly. Do it openly, before the world,—so that the world may know that each of you desires only what is honestly his own. For myself I tell you fairly that I have no doubt of the truth of what I have told you; but further proof is certainly needed. Had I any doubt I would not propose to tell your mother. As it is I think it will be wrong to keep her longer in the dark.\" \n \n \"Does she suspect nothing?\" \n \n \"I do not know. She has more power of self-control than your father. She has not spoken to me ten words since I have been in the house, and in not doing so I have thought that she was right.\" \n \n \"My own mother; my dear mother!\" \n \n \"If you ask me my opinion, I think that she does suspect the truth,—very vaguely, with an indefinite feeling that the calamity which weighs so heavily on your father, has come from this source. She, dear lady, is greatly to be pitied. But God has made her of firmer material than your father, and I think that she will bear her sorrow with a higher courage.\" \n \n \"And she is to be told also?\" \n \n \"Yes, I think so. I do not see how we can avoid it. If we do not tell her we must attempt to conceal it, and that attempt must needs be futile when we are engaged in making open inquiry on the subject. Your cousin, when he hears of this, will of course be anxious to know what his real prospects are.\" \n \n \"Yes, yes. He will be anxious, and determined too.\" \n \n \"And then, when all the world will know it, how is your mother to be kept in the dark? And that which she fears and anticipates is as bad, probably, as the actual truth. If my advice be followed nothing will be kept from her.\" \n \n \"We are in your hands, I suppose, Mr. Prendergast?\" \n \n \"I can only act as my judgment directs me.\" \n \n \"And who is to tell her?\" This he asked with a shudder, and almost in a whisper. The very idea of undertaking such a duty seemed almost too much for him. And yet he must undertake a duty almost as terrible; he himself—no one but him—must endure the anguish of repeating this story to Clara Desmond and to the countess. But now the question had reference to his own mother. \"And who is to tell her?\" he asked. \n \n For a moment or two Mr. Prendergast stood silent. He had not hitherto, in so many words, undertaken this task—this that would be the most dreadful of all. But if he did not undertake it, who would? \"I suppose that I must do it,\" at last he said, very gently. \n \n \"And when?\" \n \n \"As soon as I have told your cousin. I will go down to him to-morrow after breakfast. Is it probable that I shall find him at home?\" \n \n \"Yes, if you are there before ten. The hounds meet to-morrow at Cecilstown, within three miles of him, and he will not leave home till near eleven. But it is possible that he may have a house full of men with him.\" \n \n \"At any rate I will try. On such an occasion as this he may surely let his friends go to the hunt without him.\" \n \n And then between nine and ten this interview came to an end. \"Mr. Fitzgerald,\" said Mr. Prendergast, as he pressed Herbert\u0027s hand, \"you have borne all this as a man should do. No loss of fortune can ruin one who is so well able to endure misfortune.\" But in this Mr. Prendergast was perhaps mistaken. His knowledge of human nature had not carried him sufficiently far. A man\u0027s courage under calamity is only tested when he is left in solitude. The meanest among us can bear up while strange eyes are looking at us. And then Mr. Prendergast went away, and he was alone. \n \n It had been his habit during the whole of this period of his father\u0027s illness to go to Sir Thomas at or before bedtime. These visits had usually been made to the study, the room in which he was now standing; but when his father had gone to his bedroom at an earlier hour, Herbert had always seen him there. Was he to go to him now—now that he had heard all this? And if so, how was he to bear himself there, in his father\u0027s presence? He stood still, thinking of this, till the hand of the clock showed him that it was past ten, and then it struck him that his father might be waiting for him. It would not do for him now, at such a moment, to appear wanting in that attention which he had always shown. He was still his father\u0027s son, though he had lost the right to bear his father\u0027s name. He was nameless now, a man utterly without respect or standing-place in the world, a being whom the law ignored except as the possessor of a mere life; such was he now, instead of one whose rights and privileges, whose property and rank all the statutes of the realm and customs of his country delighted to honour and protect. This he repeated to himself over and over again. It was to such a pass as this, to this bitter disappointment that his father had brought him. But yet it should not be said of him that he had begun to neglect his father as soon as he had heard the story. \n \n So with a weary step he walked up stairs, and found Sir Thomas in bed, with his mother sitting by the bedside. His mother held out her hand to him, and he took it, leaning against the bedside. \"Has Mr. Prendergast left you?\" she asked. \n \n He told her that Mr. Prendergast had left him, and gone to his own room for the night. \"And have you been with him all the evening?\" she asked. She had no special motive in so asking, but both the father and the son shuddered at the question. \"Yes,\" said Herbert; \"I have been with him, and now I have come to wish my father good night; and you too, mother, if you intend to remain here.\" But Lady Fitzgerald got up, telling Herbert that she would leave him with Sir Thomas; and before either of them could hinder her from departing, the father and the son were alone together. \n \n Sir Thomas, when the door closed, looked furtively up into his son\u0027s face. Might it be that he could read there how much had been already told, or how much still remained to be disclosed? That Herbert was to learn it all that evening, he knew; but it might be that Mr. Prendergast had failed to perform his task. Sir Thomas in his heart trusted that he had failed. He looked up furtively into Herbert\u0027s face, but at the moment there was nothing there that he could read. There was nothing there but black misery; and every face round him for many days past had worn that aspect. \n \n For a minute or two Herbert said nothing, for he had not made up his mind whether or no he would that night disturb his father\u0027s rest. But he could not speak in his ordinary voice, or bid his father good-night as though nothing special to him had happened. \"Father,\" said he, after a short pause, \"father, I know it all now.\" \n \n \"My boy, my poor boy, my unfortunate boy!\" \n \n \"Father,\" said Herbert, \"do not be unhappy about me, I can bear it.\" And then he thought again of his bride—his bride as she was to have been; but nevertheless he repeated his last words, \"I can bear it, father!\" \n \n \"I have meant it for the best, Herbert,\" said the poor man, pleading to his child. \n \n \"I know that; all of us well know that. But what Mr. Prendergast says is true; it is better that it should be known. That man would have killed you had you kept it longer to yourself.\" \n \n Sir Thomas hid his face upon the pillow as the remembrance of what he had endured in those meetings came upon him. The blow that had told heaviest was that visit from the son, and the threats which the man had made still rung in his ears—\"When that youngster was born Lady F. was Mrs. M., wasn\u0027t she? … My governor could take her away to-morrow, according to the law of the land, couldn\u0027t he now?\" These words, and more such as these, had nearly killed him at the time, and now, as they recurred to him, he burst out into childish tears. Poor man! the days of his manhood had gone, and nothing but the tears of a second bitter childhood remained to him. The hot iron had entered into his soul, and shrivelled up the very muscles of his mind\u0027s strength. \n \n Herbert, without much thought of what he was doing, knelt down by the bedside and put his hand upon that of his father which lay out upon the sheet. There he knelt for one or two minutes, watching and listening to his father\u0027s sobs. \"You will be better now, father,\" he said, \"for the great weight of this terrible secret will be off your mind.\" But Sir Thomas did not answer him. With him there could never be any better. All things belonging to him had gone to ruin. All those around him whom he had loved—and he had loved those around him very dearly—were brought to poverty, and sorrow, and disgrace. The power of feeling this was left to him, but the power of enduring this with manhood was gone. The blow had come upon him too late in life. \n \n And Herbert himself, as he knelt there, could hardly forbear from tears. Now, at such a moment as this, he could think of no one but his father, the author of his being, who lay there so grievously afflicted by sorrows which were in nowise selfish. \"Father,\" he said at last, \"will you pray with me?\" And then when the poor sufferer had turned his face towards him, he poured forth his prayer to his Saviour that they all in that family might be enabled to bear the heavy sorrows which God in his mercy and wisdom had now thought fit to lay upon them. I will not make his words profane by repeating them here, but one may say confidently that they were not uttered in vain. \n \n \"And now, dearest father, good night,\" he said as he rose from his knees; and stretching over the bed, he kissed his father\u0027s forehead. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2728/75153.html","bookId":1403,"book":{"id":1403,"title":"Castle Richmond","description":"简介： Castle Richmond was written in 1861, long after Trollope had left Ireland. The characterization is weak, and the plot, although the author himself thought well of it, mechanical....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2728","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
