{"id":15466,"no":43,"title":"CHAPTER XLII. ANOTHER JOURNEY.","content":"On the following day he did go back to Ireland, stopping a night in Dublin on the road, so that his mother might receive his letter, and that his cousin and Somers might receive those written by Mr. Prendergast. He spent one night in Dublin, and then went on, so that he might arrive at Castle Richmond after dark. In his present mood he dreaded to be seen returning, even by his own people about the place. At Buttevant he was met by his own car and by Richard, as he had desired; but he found that he was utterly frustrated as to that method of seating himself in his vehicle which he had promised to himself. He was still glum and gloomy enough when the coach stopped, for he had been all alone, thinking over many things—thinking of his father\u0027s death and his mother\u0027s early life—of all that he had suffered and might yet have to suffer, and above all things dreading the consciousness that men were talking of him and staring at him. In this mood he was preparing to leave the coach when he found himself approaching near to that Buttevant stage; but he had more to go through at present than he expected. \"There\u0027s his honour—Hurrah! God bless his sweet face that\u0027s come among us agin this day! Hurrah for Sir Herbert, boys! hurrah! The rail ould Fitzgerald \u0027ll be back agin among us, glory be to God and the Blessed Virgin! Hurrah for Sir Herbert!\" and then there was a shout that seemed to be repeated all down the street of Buttevant. But that was nothing to what was coming. Herbert, when he first heard this, retreated for a moment back into the coach. But there was little use in that. It was necessary that he should descend, and had he not done so he would have been dragged out. He put his foot on the steps, and then found himself seized in the arms of a man outside, and pressed and embraced as though he had been a baby. \"Ugh, ugh, ugh!\" exclaimed a voice, the owner of which intended to send forth notes of joy; but so overcome was he by the intensity of his own feelings that he was in nowise able to moderate his voice either for joy or sorrow. \"Ugh, ugh, ugh! Eh! Sir Herbert! but it\u0027s I that am proud to see yer honour this day,—wid yer ouwn name, wid yer ouwn name. Glory be to God; oh dear! oh dear! And I knew the Lord\u0027d niver forgit us that way, and let the warld go intirely wrong like that. For av you weren\u0027t the masther, Sir Herbert, as you are, the Lord presarve you to us, divil a masther\u0027d iver be able to hould a foot in Castle Richmond, and that\u0027s God\u0027s ouwn thruth.\" \"And that\u0027s thrue for you, Richard,\" said another, whom Herbert in the confusion could not recognize, though his voice was familiar to him. \"\u0027Deed and the boys had it all made out. But what matthers now Sir Herbert\u0027s back?\" \"And God bless the day and the hour that he came to us!\" And then leaving his master\u0027s arm and coat to which he had still stuck, he began to busy himself loudly about the travelling gear. \"Coachman, where\u0027s Sir Herbert\u0027s portmantel? Yes; that\u0027s Sir Herbert\u0027s hat-box. \u0027Deed, an\u0027 I ought to know it well. And the black bag; yes, that\u0027ll be Sir Herbert\u0027s, to be sure,\" and so on. Nor was this all. The name seemed to run like wildfire through all the Buttevantians there assembled; and no sound seemed to reach our hero\u0027s name but that of Sir Herbert, Sir Herbert. Everybody took hold of him, and kissed his hand, and pulled his skirts, and stroked his face. His hat was knocked off, and put on again amid thousands of blessings. It was nearly dark, and his eyes were dazed by the coach lanterns which were carried about, so that he could hardly see his friends; but the one sound which was dinned into his ears was that of Sir Herbert, Sir Herbert. Had he thought about it when starting from Dublin early that morning he would have said that it would have killed him to have heard himself so greeted in the public street, but as it was he found that he got over it very easily. Before he was well seated on his car it may be questioned whether he was not so used to his name, that he would have been startled to hear himself designated as Mr. Fitzgerald. For half a minute he had been wretched, and had felt a disgust at poor Richard which he thought at the moment would be insuperable; but when he was on the car, and the poor fellow came round to tuck the apron in under his feet, he could not help giving him his hand, and fraternizing with him. \"And how is my mother, Richard?\" \"\u0027Deed then, Sir Herbert, me lady is surprising—very quiet-like; but her leddyship was always that, and as sweet to them as comes nigh her as flowers in May; but sure that\u0027s nathural to her leddyship.\" \"And, Richard—\" \"Yes, Sir Herbert.\" \"Was Mr. Owen over at Castle Richmond since I left?\" \"Sorrow a foot, Sir Herbert. Nor no one ain\u0027t heard on him, nor seen him. And I will say this on him—\" \"Don\u0027t say anything against him, Richard.\" \"No, surely not, seeing he is yer honour\u0027s far-away cousin, Sir Herbert. But what I war going to say warn\u0027t agin Mr. Owen at all, at all. For they do say that cart-ropes wouldn\u0027t have dragged him to Castle Richmond; and that only yer honour has come back to yer own,—and why not?—there wouldn\u0027t have been any masther in Castle Richmond at all, at all. That\u0027s what they do say.\" \"There\u0027s no knowing how it will go yet, Richard.\" \"\u0027Deed, an\u0027 I know how it \u0027ll go very well, Sir Herbert, and so does Mr. Somers, God bless him! \u0027Twas only this morning he tould me. An\u0027, faix, it\u0027s he has the right to be glad.\" \"He is a very old friend.\" \"So is we all ould frinds, an\u0027 we\u0027re all glad—out of our skins wid gladness, Sir Herbert. \u0027Deed an\u0027 I thought the eend of the warld had come when I heerd it, for my head went round and round and round as I stood in the stable, and only for the fork I had a hould of, I\u0027d have been down among the crathur\u0027s legs.\" And then it struck Herbert that as they were going on he heard the footsteps of some one running after the car, always at an equal distance behind them. \"Who\u0027s that running, Richard?\" \"Sure an\u0027 that\u0027s just Larry Carson, yer honour\u0027s own boy, that minds yer honour\u0027s own nag, Sir Herbert. But, faix, I suppose ye\u0027ll be having a dozen of \u0027em now.\" \"Stop and take him up; you\u0027ve room there.\" \"Room enough, Sir Herbert, an\u0027 yer honour\u0027s so good. Here, Larry, yer born fool, Sir Herbert says ye\u0027re to get up. He would come over, Sir Herbert, just to say he\u0027d been the first to see yer honour.\" \"God—bless—yer honour—Sir Herbert,\" exclaimed the poor fellow, out of breath, as he took his seat. It was his voice that Sir Herbert had recognized among the crowd, angry enough at that moment. But in future days it was remembered in Larry Carson\u0027s favour, that he had come over to Castle Richmond to see his master, contented to run the whole road back to Castle Richmond behind the car. A better fate, however, was his, for he made one in the triumphal entry up the avenue. When they got to the lodge it was quite dark—so dark that even Richard, who was experienced in night-driving, declared that a cat could not see. However, they turned in at the great gates without any accident, the accustomed woman coming out to open them. \"An\u0027 is his honour there thin?\" said the woman; \"and may God bless you, Sir Herbert, and ye\u0027re welcome back to yer own; so ye are!\" And then a warm large hand was laid upon his leg, and a warm voice sounded greeting in his ear. \"Herbert, my boy, how are you? This is well, is it not?\" It was Mr. Somers who had been waiting there for him at the lodge gate. Upon the whole he could not but acknowledge to himself that it was well. Mr. Somers got up beside him on the car, so that by this time it was well laden. \"And how does my mother take it?\" Herbert asked. \"Very quietly. Your Aunt Letty told me that she had spent most of her time in prayer since she heard it. But Miss Letty seems to think that on your account she is very full of joy.\" \"And the girls?\" \"Oh! the girls—what girls? Well, they must answer for themselves; I left them about half an hour ago, and now you hear their voices in the porch.\" He did hear the voices in the porch plainly, though he could not distinguish them, as the horse\u0027s feet and the car wheels rattled over the gravel. But as the car stopped at the door with somewhat of a crash, he heard Emmeline say, \"There\u0027s Herbert,\" and then as he got down they all retreated in among the lights in the hall. \"God bless your honour, Sir Herbert. An\u0027 it\u0027s you that are welcome back this blessed night to Castle Richmond.\" Such and such like were the greetings which met him from twenty different voices as he essayed to enter the house. Every servant and groom about the place was there, and some few of the nearest tenants,—of those who had lived near enough to hear the glad tidings since the morning. A dozen, at any rate, took his hands as he strove to make his way through them, and though he was never quite sure about it, he believed that one or two had kissed him in the dark. At last he found himself in the hall, and even then the first person who got hold of him was Mrs. Jones. \"And so you\u0027ve come back to us after all, Mr. Herbert—Sir Herbert I should say, begging your pardon, sir; and it\u0027s all right about my lady. I never thought to be so happy again, never—never—never.\" And then she retreated with her apron up to her eyes, leaving him in the arms of Aunt Letty. \"The Lord giveth, and the Lord taketh away. Blessed be the name of the Lord. Oh! Herbert, my darling boy. I hope this may be a lesson and a warning to you, so that you may flee from the wrath to come.\" Aunt Letty, had time been allowed to her, would certainly have shown that the evil had all come from tampering with papistical abominations; and that the returning prosperity of the house of Castle Richmond was due to Protestant energy and truth. But much time was not allowed to Aunt Letty, as Herbert hurried on after his sisters. As he had advanced they had retreated, and now he heard them in the drawing-room. He began to be conscious that they were not alone,—that they had some visitor with them, and began to be conscious also who that visitor was. And when he got himself at last into the room, sure enough there were three girls there, two running forward to meet him from the fireplace to which they had retreated, and the other lingering a little in their rear. \"Oh, Herbert!\" and \"oh, Herbert!\" and then their arms were thrown about his neck, and their warm kisses were on his cheeks—kisses not unmixed with tears; for of course they began to cry immediately that he was with them, though their eyes had been dry enough for the two or three hours before. Their arms were about his neck, and their kisses on his cheeks, I have said,—meaning thereby the arms and kisses of his sisters, for the third young lady still lingered a little in the rear. \"Was it not lucky Clara was here when the news came to us this morning?\" said Mary. \"Such difficulty as we have had to get her,\" said Emmeline. \"It was to have been her farewell visit to us; but we will have no more farewells now; will we, Clara?\" And now at last he had his arm round her waist, or as near to that position as he was destined to get it on the present occasion. She gave him her hand, and let him hold that fast, and smiled on him through her soft tears, and was gracious to him with her sweet words and pleasant looks; but she would not come forward and kiss him boldly as she had done when last they had met at Desmond Court. He attempted it now; but he could get his lips no nearer to hers than her forehead; and when he tried to hold her she slipped away from him, and he continually found himself in the embraces of his sisters,—which was not the same thing at all. \"Never mind,\" he said to himself; \"his day would soon come round.\" \"You did not expect to find Clara here, did you?\" asked Emmeline. \"I hardly know what I have expected, or not expected, for the last two days. No, certainly, I had no hope of seeing her to-night.\" \"I trust I am not in the way,\" said Clara. Whereupon he made another attempt with his arm, but when he thought he had caught his prize, Emmeline was again within his grasp. \"And my mother?\" he then said. It must be remembered that he had only yet been in the room for three minutes, though his little efforts have taken longer than that in the telling. \"She is up stairs, and you are to go to her. But I told her that we should keep you for a quarter of an hour, and you have not been here half that time yet.\" \"And how has she borne all this?\" \"Why, well on the whole. When first she heard it this morning, which she did before any of us, you know—\" \"Oh, yes, I wrote to her.\" \"But your letter told her nothing. Mr. Somers came down almost as soon as your letter was here. He had heard also—from Mr. Prendergast, I think it was, and Mr. Prendergast said a great deal more than you did.\" \"Well?\" \"We thought she was going to be ill at first, for she became so very pale,—flushing up sometimes for half a minute or so; but after an hour or two she became quite calm. She has seen nobody since but us and Aunt Letty.\" \"She saw me,\" said Clara. \"Oh, yes, you; you are one of us now,—just the same as ourselves, isn\u0027t she, Herbert?\" Not exactly the same, Herbert thought. And then he went up stairs to his mother. This interview I will not attempt to describe. Lady Fitzgerald had become a stricken woman from the first moment that she had heard that that man had returned to life, who in her early girlhood had come to her as a suitor. Nay, this had been so from the first moment that she had expected his return. And these misfortunes had come upon her so quickly that, though they had not shattered her in body and mind as they had shattered her husband, nevertheless they had told terribly on her heart. The coming of those men, the agony of Sir Thomas, the telling of the story as it had been told to her by Mr. Prendergast, the resolve to abandon everything—even a name by which she might be called, as far as she herself was concerned, the death of her husband, and then the departure of her ruined son, had, one may say, been enough to destroy the spirit of any woman. Her spirit they had not utterly destroyed. Her powers of endurance were great,—and she had endured, still hoping. But as the uttermost malice of adversity had not been able altogether to depress her, so neither did returning prosperity exalt her,—as far as she herself was concerned. She rejoiced for her children greatly, thanking God that she had not entailed on them an existence without a name. But for herself, as she now told Herbert, outside life was all over. Her children and the poor she might still have with her, but beyond, nothing in this world;—to them would be confined all her wishes on this side the grave. But nevertheless she could be warm in her greetings to her son. She could understand that though she were dead to the world he need not be so,—nor indeed ought to be so. Things that were now all ending with her were but beginning with him. She had no feeling that taught her to think that it was bad for him to be a man of rank and fortune, the head of his family, and the privileged one of his race. It had been perhaps her greatest misery that she, by her doing, had placed him in the terrible position which he had lately been called upon to fill. \"Dearest mother, it did not make me unhappy,\" he said, caressing her. \"You bore it like a man, Herbert, as I shall ever remember. But it did make me unhappy,—more unhappy than it should have done, when we remember how very short is our time here below.\" He remained with his mother for more than an hour, and then returned to the drawing-room, where the girls were waiting for him with the tea-things arranged before them. \"I was very nearly coming up to fetch you,\" said Mary, \"only that we knew how much mamma must have to say to you.\" \"We dined early because we are all so upset,\" said Emmeline; \"and Clara must be dying for her tea.\" \"And why should Clara die for tea any more than any one else?\" asked Lady Clara herself. I will not venture to say what hour it was before they separated for bed. They sat there with their feet over the fender, talking about things gone and things coming,—and there were so many of such things for them to discuss! Even yet, as one of the girls remarked, Lady Desmond had not heard of the last change, or if she had so heard, had had no time to communicate with her daughter upon the subject. And then Owen was spoken of with the warmest praise by them all, and Clara explained openly what had been the full tenor of his intended conduct. \"That would have been impossible,\" said Herbert. \"But it was not the less noble in him, was it?\" said Clara, eagerly. But she did not tell how Owen Fitzgerald had prayed that her love might be given back to him, as his reward for what he wished to do on behalf of his cousin. Now, at least, at this moment it was not told; yet the day did come when all that was described,—a day when Owen in his absence was regarded by them both among the dearest of their friends. But even on that night Clara resolved that he should have some meed of praise. \"Has he not been noble?\" she said, appealing to him who was to be her husband; \"has he not been very noble?\" Herbert, too happy to be jealous, acknowledged that it was so.","sourceLink":"http://novel.tingroom.com/duanpian/2728/75173.html","bookId":1403,"book":{"id":1403,"title":"Castle Richmond","description":"简介： Castle Richmond was written in 1861, long after Trollope had left Ireland. The characterization is weak, and the plot, although the author himself thought well of it, mechanical....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2728","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
