{"id":15428,"no":5,"title":"CHAPTER IV. THE COUNTESS.","content":"The countess, as she walked back with her daughter towards the house, had to bethink herself for a minute or two as to how she should act, and what she would say. She knew, she felt that she knew, what had occurred. If her daughter\u0027s manner had not told her, the downcast eyes, the repressed sobs, the mingled look of shame and fear;—if she had not read the truth from these, she would have learned it from the tone of Fitzgerald\u0027s voice, and the look of triumph which sat upon his countenance. And then she wondered that this should be so, seeing that she had still regarded Clara as being in all things a child; and as she thought further, she wondered at her own fatuity, in that she had allowed herself to be so grossly deceived. \"Clara,\" said she, \"what is all this?\" \"Oh, mamma!\" \"You had better come on to the house, my dear, and speak to me there. In the mean time, collect your thoughts, and remember this, Clara, that you have the honour of a great family to maintain.\" Poor Clara! what had the great family done for her, or how had she been taught to maintain its honour? She knew that she was an earl\u0027s daughter, and that people called her Lady Clara; whereas other young ladies were only called Miss So-and-So. But she had not been taught to separate herself from the ordinary throng of young ladies by any other distinction. Her great family had done nothing special for her, nor placed before her for example any grandly noble deeds. At that old house at Desmond Court company was scarce, money was scarce, servants were scarce. She had been confided to the care of a very ordinary governess; and if there was about her anything that was great or good, it was intrinsically her own, and by no means due to intrinsic advantages derived from her grand family. Why should she not give what was so entirely her own to one whom she loved, to one by whom it so pleased her to be loved? And then they entered the house, and Clara followed her mother to the countess\u0027s own small up-stairs sitting-room. The daughter did not ordinarily share this room with her mother, and when she entered it, she seldom did so with pleasurable emotion. At the present moment she had hardly strength to close the door after her. \"And now, Clara, what is all this?\" said the countess, sitting down in her accustomed chair. \"All which, mamma?\" Can any one blame her in that she so far equivocated? \"Clara, you know very well what I mean. What has there been between you and Mr. Fitzgerald?\" The guilt-stricken wretch sat silent for a while, sustaining the scrutiny of her mother\u0027s gaze; and then falling from her chair on to her knees, she hid her face in her mother\u0027s lap, exclaiming, \"Oh, mamma, mamma, do not look at me like that!\" Lady Desmond\u0027s heart was somewhat softened by this appeal; nor would I have it thought that she was a cruel woman, or an unnatural mother. It had not been her lot to make an absolute, dearest, heartiest friend of her daughter, as some mothers do; a friend between whom and herself there should be, nay could be, no secrets. She could not become young again in sharing the romance of her daughter\u0027s love, in enjoying the gaieties of her daughter\u0027s balls, in planning dresses, amusements, and triumphs with her child. Some mothers can do this; and they, I think, are the mothers who enjoy most fully the delights of maternity. This was not the case with Lady Desmond; but yet she loved her child, and would have made any reasonable sacrifice for what she regarded as that child\u0027s welfare. \"But, my dear,\" she said, in a softened tone, \"you must tell me what has occurred. Do you not know that it is my duty to ask, and yours to tell me? It cannot be right that there should be any secret understanding between yourself and Mr. Fitzgerald. You know that, Clara, do you not?\" \"Yes, mamma,\" said Clara, remembering that her lover had bade her tell her mother everything. \"Well, my love?\" Clara\u0027s story was very simple, and did not, in fact, want any telling. It was merely the old well-worn tale, so common through all the world. \"He had laughed on the lass with his bonny black eye!\" and she,—she was ready to go \"to the mountain to hear a love-tale!\" One may say that an occurrence so very common could not want much telling. \"Mamma; he says—\" \"Well, my dear?\" \"He says—. Oh, mamma! I could not help it.\" \"No, Clara; you certainly could not help what he might say to you. You could not refuse to listen to him. A lady in such a case, when she is on terms of intimacy with a gentleman, as you were with Mr. Fitzgerald, is bound to listen to him, and to give him an answer. You could not help what he might say, Clara. The question now is, what answer did you give to what he said?\" Clara, who was still kneeling, looked up piteously into her mother\u0027s face, sighed bitterly, but said nothing. \"He told you that he loved you, I suppose?\" \"Yes, mamma.\" \"And I suppose you gave him some answer? Eh! my dear?\" The answer to this was another long sigh. \"But, Clara, you must tell me. It is absolutely necessary that I should know whether you have given him any hope, and if so, how much. Of course the whole thing must be stopped at once. Young as you are, you cannot think that a marriage with Mr. Owen Fitzgerald would be a proper match for you to make. Of course the whole thing must cease at once—at once.\" Here there was another piteous sigh. \"But before I take any steps, I must know what you have said to him. Surely you have not told him that you have any feeling for him warmer than ordinary regard?\" Lady Desmond knew what she was doing very well. She was perfectly sure that her daughter had pledged her troth to Owen Fitzgerald. Indeed, if she made any mistake in the matter, it was in thinking that Clara had given a more absolute assurance of love than had in truth been extracted from her. But she calculated, and calculated wisely, that the surest way of talking her daughter out of all hope, was to express herself as unable to believe that a child of hers would own to love for one so much beneath her, and to speak of such a marriage as a thing absolutely impossible. Her method of acting in this manner had the effect which she desired. The poor girl was utterly frightened, and began to fear that she had disgraced herself, though she knew that she dearly loved the man of whom her mother spoke so slightingly. \"Have you given him any promise, Clara?\" \"Not a promise, mamma.\" \"Not a promise! What then? Have you professed any regard for him?\" But upon this Clara was again silent. \"Then I suppose I must believe that you have professed a regard for him—that you have promised to love him?\" \"No, mamma; I have not promised anything. But when he asked me, I—I didn\u0027t—I didn\u0027t refuse him.\" It will be observed that Lady Desmond never once asked her daughter what were her feelings. It never occurred to her to inquire, even within her own heart, as to what might be most conducive to her child\u0027s happiness. She meant to do her duty by Clara, and therefore resolved at once to put a stop to the whole affair. She now desisted from her interrogatories, and sitting silent for a while, looked out into the extent of flat ground before the house. Poor Clara the while sat silent also, awaiting her doom. \"Clara,\" said the mother at last, \"all this must of course be made to cease. You are very young, very young indeed, and therefore I do not blame you. The fault is with him—with him entirely.\" \"No, mamma.\" \"But I say it is. He has behaved very badly, and has betrayed the trust which was placed in him when he was admitted here so intimately as Patrick\u0027s friend.\" \"I am sure he has not intended to betray any trust,\" said Clara, through her sobs. The conviction was beginning to come upon her that she would be forced to give up her lover; but she could not bring herself to hear so much evil spoken of him. \"He has not behaved like a gentleman,\" continued the countess, looking very stern. \"And his visits here must of course be altogether discontinued. I am sorry on your brother\u0027s account, for Patrick was very fond of him—\" \"Not half so fond as I am,\" thought Clara to herself. But she did not dare to speak her thoughts out loud. \"But I am quite sure that your brother, young as he is, will not continue to associate with a friend who has thought so slightly of his sister\u0027s honour. Of course I shall let Mr. Fitzgerald know that he can come here no more; and all I want from you is a promise that you will on no account see him again, or hold any correspondence with him.\" That was all she wanted. But Clara, timid as she was, hesitated before she could give a promise so totally at variance with the pledge which she felt that she had given, hardly an hour since, to Fitzgerald. She knew and acknowledged to herself that she had given him a pledge, although she had given it in silence. How then was she to give this other pledge to her mother? \"You do not mean to say that you hesitate?\" said Lady Desmond, looking as though she were thunderstruck at the existence of such hesitation. \"You do not wish me to suppose that you intend to persevere in such insanity? Clara, I must have from you a distinct promise,—or—\" What might be the dreadful alternative the countess did not at that minute say. She perhaps thought that her countenance might be more effective than her speech, and in thinking so she was probably right. It must be remembered that Clara Desmond was as yet only seventeen, and that she was young even for that age. It must be remembered also, that she knew nothing of the world\u0027s ways, of her own privileges as a creature with a soul and heart of her own, or of what might be the true extent of her mother\u0027s rights over her. She had not in her enough of matured thought to teach her to say that she would make no promise that should bind her for ever; but that for the present, in her present state, she would obey her mother\u0027s orders. And thus the promise was exacted and given. \"If I find you deceiving me, Clara,\" said the countess, \"I will never forgive you.\" Hitherto, Lady Desmond may probably have played her part well;—well, considering her object. But she played it very badly in showing that she thought it possible that her daughter should play her false. It was now Clara\u0027s turn to be proud and indignant. \"Mamma!\" she said, holding her head high, and looking at her mother boldly through her tears, \"I have never deceived you yet.\" \"Very well, my dear. I will take steps to prevent his intruding on you any further. There may be an end of the matter now. I have no doubt that he has endeavoured to use his influence with Patrick; but I will tell your brother not to speak of the matter further.\" And so saying, she dismissed her daughter. Shortly afterwards the earl came in, and there was a conference between him and his mother. Though they were both agreed on the subject, though both were decided that it would not do for Clara to throw herself away on a county Cork squire with eight hundred a year, a cadet in his family, and a man likely to rise to nothing, still the earl would not hear him abused. \"But, Patrick, he must not come here any more,\" said the countess. \"Well, I suppose not. But it will be very dull, I know that. I wish Clara hadn\u0027t made herself such an ass;\" and then the boy went away, and talked kindly over the matter to his poor sister. But the countess had another task still before her. She must make known the family resolution to Owen Fitzgerald. When her children had left her, one after the other, she sat at the window for an hour, looking at nothing, but turning over her own thoughts in her mind. Hitherto she had expressed herself as being very angry with her daughter\u0027s lover; so angry that she had said that he was faithless, a traitor, and no gentleman. She had called him a dissipated spendthrift, and had threatened his future wife, if ever he should have one, with every kind of misery that could fall to a woman\u0027s lot; but now she began to think of him perhaps more kindly. She had been very angry with him;—and the more so because she had such cause to be angry with herself;—with her own lack of judgment, her own ignorance of the man\u0027s character, her own folly with reference to her daughter. She had never asked herself whether she loved Fitzgerald—had never done so till now. But now she knew that the sharpest blow she had received that day was the assurance that he was indifferent to herself. She had never thought herself too old to be on an equality with him,—on such an equality in point of age as men and women feel when they learn to love each other; and therefore it had not occurred to her that he could regard her daughter as other than a child. To Lady Desmond, Clara was a child; how then could she be more to him? And yet now it was too plain that he had looked on Clara as a woman. In what light then must he have thought of that woman\u0027s mother? And so, with saddened heart, but subdued anger, she continued to gaze through the window till all without was dusk and dark. There can be to a woman no remembrance of age so strong as that of seeing a daughter go forth to the world a married woman. If that does not tell the mother that the time of her own youth has passed away, nothing will ever bring the tale home. It had not quite come to this with Lady Desmond;—Clara was not going forth to the world as a married woman. But here was one now who had judged her as fit to be so taken; and this one was the very man of all others in whose estimation Lady Desmond would have wished to drop a few of the years that encumbered her. She was not, however, a weak woman, and so she performed her task. She had candles brought to her, and sitting down, she wrote a note to Owen Fitzgerald, saying that she herself would call at Hap House at an hour named on the following day. She had written three or four letters before she had made up her mind exactly as to the one she would send. At first she had desired him to come to her there at Desmond Court; but then she thought of the danger there might be of Clara seeing him;—of the danger, also, of her own feelings towards him when he should be there with her, in her own house, in the accustomed way. And she tried to say by letter all that it behoved her to say, so that there need be no meeting. But in this she failed. One letter was stern and arrogant, and the next was soft-hearted, so that it might teach him to think that his love for Clara might yet be successful. At last she resolved to go herself to Hap House; and accordingly she wrote her letter and despatched it. Fitzgerald was of course aware of the subject of the threatened visit. When he determined to make his proposal to Clara, the matter did not seem to him to be one in which all chances of success were desperate. If, he thought, he could induce the girl to love him, other smaller difficulties might be made to vanish from his path. He had now induced the girl to own that she did love him; but not the less did he begin to see that the difficulties were far from vanishing. Lady Desmond would never have taken upon herself to make a journey to Hap House, had not a sentence of absolute banishment from Desmond Court been passed against him. \"Mr. Fitzgerald,\" she began, as soon as she found herself alone with him, \"you will understand what has induced me to seek you here. After your imprudence with Lady Clara Desmond, I could not of course ask you to come to Desmond Court.\" \"I may have been presumptuous, Lady Desmond, but I do not think that I have been imprudent. I love your daughter dearly, and I told her so. Immediately afterwards I told the same to her brother; and she, no doubt, has told the same to you.\" \"Yes, she has, Mr. Fitzgerald. Clara, as you are well aware, is a child, absolutely a child; much more so than is usual with girls of her age. The knowledge of this should, I think, have protected her from your advances.\" \"But I absolutely deny any such knowledge. And more than that, I think that you are greatly mistaken as to her character.\" \"Mistaken, sir, as to my own daughter?\" \"Yes, Lady Desmond; I think you are. I think—\" \"On such a matter, Mr. Fitzgerald, I need not trouble you for an expression of your thoughts. Nor need we argue that subject any further. You must of course be aware that all ideas of any such marriage as this must be laid aside.\" \"On what grounds, Lady Desmond?\" Now this appeared to the countess to be rather impudent on the part of the young squire. The reasons why he, Owen Fitzgerald of Hap House, should not marry a daughter of an Earl of Desmond, seemed to her to be so conspicuous and conclusive, that it could hardly be necessary to enumerate them. And such as they were, it might not be pleasant to announce them in his hearing. But though Owen Fitzgerald was so evidently an unfit suitor for an earl\u0027s daughter, it might still be possible that he should be acceptable to an earl\u0027s widow. Ah! if it might be possible to teach him the two lessons at the same time! \"On what grounds, Mr. Fitzgerald!\" she said, repeating his question; \"surely I need hardly tell you. Did not my son say the same thing to you yesterday, as he walked with you down the avenue?\" \"Yes; he told me candidly that he looked higher for his sister; and I liked him for his candour. But that is no reason that I should agree with him; or, which is much more important, that his sister should do so. If she thinks that she can be happy in such a home as I can give her, I do not know why he, or why you should object.\" \"You think, then, that I might give her to a blacksmith, if she herself were mad enough to wish it?\" \"I thank you for the compliment, Lady Desmond.\" \"You have driven me to it, sir.\" \"I believe it is considered in the world,\" said he,—\"that is, in our country, that the one great difference is between gentlemen and ladies, and those who are not gentlemen or ladies. A lady does not degrade herself if she marry a gentleman, even though that gentleman\u0027s rank be less high than her own.\" \"It is not a question of degradation, but of prudence;—of the ordinary caution which I, as a mother, am bound to use as regards my daughter. Oh, Mr. Fitzgerald!\" and she now altered her tone as she spoke to him; \"we have all been so pleased to know you, so happy to have you there; why have you destroyed all this by one half-hour\u0027s folly?\" \"The folly, as you call it, Lady Desmond, has been premeditated for the last twelve months.\" \"For twelve months!\" said she, taken absolutely by surprise, and in her surprise believing him. \"Yes, for twelve months. Ever since I began to know your daughter, I have loved her. You say that your daughter is a child. I also thought so this time last year, in our last winter holidays. I thought so then; and though I loved her as a child, I kept it to myself. Now she is a woman, and so thinking I have spoken to her as one. I have told her that I loved her, as I now tell you that come what may I must continue to do so. Had she made me believe that I was indifferent to her, absence, perhaps, and distance might have taught me to forget her. But such, I think, is not the case.\" \"And you must forget her now.\" \"Never, Lady Desmond.\" \"Nonsense, sir. A child that does not know her own mind, that thinks of a lover as she does of some new toy, whose first appearance in the world was only made the other night at your cousin\u0027s house! you ought to feel ashamed of such a passion, Mr. Fitzgerald.\" \"I am very far from being ashamed of it, Lady Desmond.\" \"At any rate, let me tell you this. My daughter has promised me most solemnly that she will neither see you again, nor have any correspondence with you. And this I know of her, that her word is sacred. I can excuse her on account of her youth; and, young as she is, she already sees her own folly in having allowed you so to address her. But for you, Mr. Fitzgerald, under all the circumstances I can make no excuse for you. Is yours, do you think, the sort of house to which a young girl should be brought as a bride? Is your life, are your companions of that kind which could most profit her? I am sorry that you drive me to remind you of these things.\" His face became very dark, and his brow stern as his sins were thus cast into his teeth. \"And from what you know of me, Lady Desmond,\" he said,—and as he spoke he assumed a dignity of demeanour which made her more inclined to love him than ever she had been before,—\"do you think that I should be the man to introduce a young wife to such companions as those to whom you allude? Do you not know, are you not sure in your own heart, that my marriage with your daughter would instantly put an end to all that?\" \"Whatever may be my own thoughts, and they are not likely to be unfavourable to you—for Patrick\u0027s sake, I mean; but whatever may be my own thoughts, I will not subject my daughter to such a risk. And, Mr. Fitzgerald, you must allow me to say, that your income is altogether insufficient for her wants and your own. She has no fortune—\" \"I want none with her.\" \"And—but I will not argue the matter with you. I did not come to argue it, but to tell you, with as little offence as may be possible, that such a marriage is absolutely impossible. My daughter herself has already abandoned all thoughts of it.\" \"Her thoughts then must be wonderfully under her own control. Much more so than mine are.\" \"Lord Desmond, you may be sure, will not hear of it.\" \"Lord Desmond cannot at present be less of a child than his sister.\" \"I don\u0027t know that, Mr. Fitzgerald.\" \"At any rate, Lady Desmond, I will not put my happiness, nor as far as I am concerned in it, his sister\u0027s happiness, at his disposal. When I told her that I loved her, I did not speak, as you seem to think, from an impulse of the moment. I spoke because I loved her; and as I love her, I shall of course try to win her. Nothing can absolve me from my engagement to her but her marriage with another person.\" The countess had once or twice made small efforts to come to terms of peace with him; or rather to a truce, under which there might still be some friendship between them,—accompanied, however, by a positive condition that Clara should be omitted from any participation in it. She would have been willing to say, \"Let all this be forgotten, only for some time to come you and Clara cannot meet each other.\" But Fitzgerald would by no means agree to such terms; and the countess was obliged to leave his house, having in effect only thrown down a gauntlet of battle; having in vain attempted to extend over it an olive-branch of peace. He helped her, however, into her little pony carriage, and at parting she gave him her hand. He just touched it, and then, taking off his hat, bowed courteously to her as she drove from his door.","sourceLink":"http://novel.tingroom.com/duanpian/2728/75135.html","bookId":1403,"book":{"id":1403,"title":"Castle Richmond","description":"简介： Castle Richmond was written in 1861, long after Trollope had left Ireland. The characterization is weak, and the plot, although the author himself thought well of it, mechanical....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2728","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
