{"id":98686,"no":11,"title":"Page 11","content":"Or both.\n “Hey,” I said, smiling. “What are you two up to?”\n “Nothing,” replied the überblonde. She bounced up the stairs, closely followed by her friend. It was then when I realized she was Susan, which meant the other had to be Sally. “I haven’t seen you in forever.”\n “Like for-ever,” Sally reiterated. “You haven’t been at any of the parties recently.”\n That much was true. It had been weeks, if not months, since I’d attended any of the parties being thrown at the frats. I started back up the stairs. “I’ve been busy.”\n Susan pouted as she flicked her hair over her shoulder. “That’s no fun. Everyone misses you.”\n I wondered who everyone was as I crossed the balcony and opened the blue-and-gold double doors, heading into the Den. “Have I been missing a lot of fun?”\n “A lot.” Susan somehow ended up in front of me, and we were stopped in front of the couches crowding the TV. She placed her hand on my chest as my gaze moved beyond her, flickering over the rows of tables. “I’m sure we could get you caught up, Sally and I.”\n “Is that so?” The top of a coppery head came into view, and I recognized the dark-skinned boy sitting across from her. The girls said something else, but I wasn’t paying attention. Stepping back, I smiled at the girls. “Look, I’ve got to run. See you guys later.”\n I didn’t wait for a response, slipping away and cutting in front of a group of people heading out into the autumn sun. A wide smile broke out across Jacob’s face as he spotted me. He said something to Shortcake, and her shoulders tensed. I wasn’t surprised. I expected this. Every time we got together, we had to start over. Even I was amazed by my patience when it came to her.\n “Hey, Cameron!” Jacob said, awfully cheerful. “How’s it going?”\n “Hey, Jacob. Brittany.” I took the seat next to Shortcake and nudged her arm. “Avery.”\n She murmured hello and then asked, “What are you up to?”\n “Oh, you know, mischief and mayhem.”\n “That so reminds me of Harry Potter,” Brit said, smiling faintly. “I need a reread.”\n All eyes turned on her.\n Red bloomed across her cheeks as she ran her hand through her hair. I didn’t know Brittany very well, but knew she had gone to my high school and seemed pretty cool. “What?” she said. “I’m not ashamed to admit that random things remind me of Harry Potter.”\n “That guy over there reminds me of Snape.” I tipped my chin at the table behind us. “So I understand.”\n A thankful smile crossed Brittany’s face.\n “Anyway, what are you guys doing?” I shifted so that my leg pressed against Shortcake’s. “Playing with M\u0026M’s and Skittles?”\n “Yes, that and we’re studying for our history midterm next week. We have to map out Europe,” Jacob explained.\n “Ouch.” I knocked my leg into hers.\n She returned the favor.\n “But Avery, wonderful, Avery . . .” Jacob’s grin spread as Shortcake’s glare increased. “She’s been helping us study.”\n “That she has.” Brittany exchanged a look with Jacob, and my interest peaked.\n Jacob leaned forward, resting his chin in his hand. “Before we started studying, I was telling Avery that she should wear the color green more often. It makes her sexy with that hair of hers.”\n “Do you like the color green on her, Cam?” Brit asked.\n I hadn’t noticed what she was wearing, but I turned to her, my gaze slipping over the green sweater. “The color looks great on her, but she looks beautiful every day.”\n Shortcake flushed as she exhaled.\n “Beautiful?” Brit sighed.\n “Beautiful,” I repeated, nudging her knee again. “So did you guys learn anything from studying?”\n Shortcake said, “I think we got it.”\n “Because of you.” Jacob shared another look with Brittany. “Avery came up with this song to help me remember where the countries were.”\n “Sing him your song.” Brittany elbowed her, causing her to bounce into me.\n “What song?” I asked.\n She shook her head. “I am not singing that song again.”\n Jacob smiled. “It’s the Croatia song.”\n The look on Avery’s face could kill.\n I laughed. “The Croatia song? What?”\n “No,” she said. “I am not singing again. That is so not my talent.”\n “What kind of talents do you have?” I asked, and she looked at me, her eyes impossibly large. “Avery?”\n “Do tell,” Jacob coaxed.\n Brit jumped. “Talents are fun.”\n “They can be.” I was thinking about all the talents I had that I was more than willing to share with her as I bent my head. There was only a mere inch or two between our mouths, and her soft sigh trilled through my blood. “Tell me what your talents are, sweetheart.”\n “Sweetheart,” Jacob murmured, sighing.\n “Dancing,” she said. “I danced. I used to dance.”\n Curiosity poured into me. What were the chances? “What kind of dancing?”\n “I don’t know.” She grabbed the package of Skittles, dumping them into her palm. “Ballet, jazz, tap, contemporary—that kind of stuff.”\n “No shit?” Jacob’s brows shot up. “I did tap when I was like six, for about a month, and then decided I wanted to be a fireman or something like that. That shit was hard.”\n Brit snickered. “I tried dance and discovered I had no coordination or grace beyond shaking my ass. Were you any good at it?”\n Shortcake shrugged, her gaze fastened to the pieces of candy. “I took classes for about ten years, did some competitions and a lot of recitals.”\n “Then you were good!” Brit exclaimed. “I bet you did all those crazy turns and tricks.”\n I couldn’t believe it as I stared at her. She was a dancer. I never would’ve thought it, because all the dancers I knew were overflowing with confidence, but it explained the lean muscle I had spied in her legs, the kind of tone that never really went away.\n “My sister did dance since she was around five,” I told her, somewhat amazed. “Still does. I think she’d cut someone if they made her stop.”\n She finished off the Skittles, nodding. “Dancing can be addictive if you like it.”\n “Or are good at it,” Brit interjected.\n I bumped her shoulder with mine, drawing her attention. For her to be dancing for that many years, I was surprised that she talked about it in the past tense. “Why’d you stop?”\n A far-off look appeared in her stare, and I knew that where she was at that moment, it wasn’t in the present. I’d seen that look creep over her a lot and I always wondered where she went in those moments.\n Finally, she shrugged again as she went for the M\u0026M’s. “I guess I got tired of it. Does your sister do competitions?”\n I didn’t believe her. Not one bit. Dancing was in the blood, but I didn’t press it. Not right now. “She’s traveled all over and spent the summer at the Joffrey Ballet School on a scholarship.”\n “Holy shit!” Her mouth dropped. “She must be damn good.”\n Full of pride, I smiled. “She is.”\n Avery smiled up at me, but as the minutes ticked by, that smile faded as her gaze drifted to the empty pack of candy. She really didn’t say anything after that, no matter how hard her friends and I tried to lull her into conversation. Something was up with her and I knew it had to do with where she went when she got quiet.\n When she got up to leave, I said good-bye and followed her out into the cool breeze and bright sun. I was quiet as we headed up the hill, unsure of how to approach her. Although there was a lot I had discovered about Avery, there was still so much I didn’t know. She kept her past and her thoughts close to her.\n Someone yelled my name over by the Byrd Center, and I waved absently as we crossed the street.\n We stopped by the empty benches in front of Knutti, and I took a deep breath. “Are you okay?”\n Tipping her chin up, she squinted. “Yeah, I’m fine. Are you?”\n Not feeling the smile on my face, I nodded. “We still on for tomorrow night?”\n “Tomorrow night? Oh! The astronomy assignment. Yeah, it works for me.”\n “Good.” I backed away, knowing I needed to get my ass to class. “See you then.”\n Shortcake turned and then pivoted back to me. “Cam?”\n The knot pulsed in my chest. “Yeah?”\n She fiddled with her bracelet as her gaze flicked away before settling back on me. “What were you doing in the Den? Don’t you normally have class, like right now?”\n I smiled as I held her gaze. “Yeah, I normally have class right now, but I wanted to see you.”\n Shock splashed over her face, and then I saw the smile light up her eyes before it even hit her lips. Feeling that knot do a funny, twisting thing, I pivoted around before I grabbed her and kissed her.\n Because I was really close to doing that.\n I made it across the street before a low whistle caught my attention. Looking toward the left, I saw Jase standing under a tree, cell phone in hand. Damn. He must’ve hightailed his ass from West Campus.\n “Skipping class without me?” he asked as I made my way over to him, his eyes obscured by the aviator shades he was wearing. Very few people could pull off those sunglasses without looking like a douche. I was not one of them.\n I shrugged as my attention drifted beyond Jase’s shoulder, across the street, catching one last glimpse of Shortcake disappearing through the doors of Knutti Hall.\n Jase sighed. “You’re obsessed.”\n “Huh?”\n He nodded toward Knutti. “I don’t think you’ve ever skipped a class to hang out with a girl before.”\n I frowned. “How do you know I skipped a class to hang out with Avery?”\n His brows rose above the sunglasses. “I’m not stupid.”\n “That’s up for debate.”\n Jase flipped me off. “Well, let’s see. Class let out early, so I came over here just in time to see you walking along like a good little boy. I called your name. You waved at me and kept going—or staring at her.”\n My brows lifted as I wheeled around, heading for the doors. “That was you yelling my name?”\n “Exactly,” he said, sighing. He looked at me, and all I saw was my face in his sunglasses. “Has she agreed to go out with you yet?”\n “Nope.”\n Jase shook his head. “Man, you are so fucked when it comes to this girl.”\n Nine\n “Apple pie for you.” I handed the small treat over to Avery and then dug the other one out of the McDonald’s bag. “And apple pie for me.”\n Shortcake peeled open the box. “Do you think they use real apples?”\n “God, I don’t really want to know.” I bit into the crust, groaning at the sweetness. “Ah, this shit is so good.” \n","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-11.html","bookId":2002,"book":{"id":2002,"title":"Trust in Me (Wait for You #0)","description":"Storyline: \n Trust in Me (Wait for You #1.5) \n by J. Lynn, Jennifer L. Armentrout \n It’s Wait for You as you’ve never seen it. Trust in Me lets you in on Cam’s side of the #1 New York Times Bestselling story. \n Cameron Hamilton is used to getting what he wants, especially when it comes to women. But when Avery Morgansten comes crashing into his life – literally – he finally meets the one person who can resist his soulful baby blues. But Cam’s not ready to give up. He can’t get the feisty and intriguing girl out of his head. \n Avery has secrets, secrets that keep her from admitting the feelings Cam knows she has for him. Will persistence (and some delicious homemade cookies) help him break down her barriers and gain her trust? Or will he be shut out of Avery\u0027s life, losing his first real shot at the kind of love that lasts forever?\n \n","cover":"https://allnovel.net/images/trust-in-me-wait-for-you-0.jpg","author":"Jennifer L. Armentrout","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/trust-in-me-wait-for-you-0.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:35:24 PM"}}
