{"id":98697,"no":22,"title":"Page 22","content":"Hey.\\n\\n The response was almost immediate. Hey you.\\n\\n My lips curled up. What u doing?\\n\\n Reading your text. There was a pause and another text came through. Also reading ahead in history.\\n\\n I laughed. Nerd.\\n\\n Jerk.\\n\\n Easing onto my back, I sent her another text. Admit it.\\n\\n Admit what?\\n\\n U r excited abt tmrow.\\n\\n About a minute passed, and I sat up, frowning. Finally a response came through. I am.\\n\\n Took u that long? I sent back. Fo shame.\\n\\n LOL. Sorry. Figured I’d make you sweat.\\n\\n Shaking my head, I swung my legs off the bed and went to the bedroom door, peeking outside. The living room was dark, but not empty. Two forms were entangled on a makeshift bed made out of pillows and blankets. Grimacing, I crept around them.\\n\\n I sent her one more text. Knock. Knock.\\n\\n Goosebumps spread across my bare chest as I slipped out into the hallway. My phone dinged and I glanced down. Sigh. Who’s there?\\n\\n Grinning like an idiot, I hurried to her door, rapping my knuckles.\\n\\n About ten seconds later, the door swung open. Avery stood there, her iPhone clutched in her right hand. Her mouth opened, then she snapped it shut and pursed her lips.\\n\\n I leaned through her doorway, smiling shamelessly as her gaze drifted over my abs and then my chest, getting hung up on the sun tattoo. “Hey, girl, hey . . .”\\n\\n She burst into laughter as she took a step back. “You are . . . oh my God.”\\n\\n “I’m a sexy beast, I know. Anyway, there’s something else I want you to admit.”\\n\\n Pulling her cardigan around her, she stared at me as she pressed her sock-covered feet together. “Aren’t you cold?”\\n\\n “I’m too hot to be cold.”\\n\\n She rolled her eyes. “What do you want me to admit?”\\n\\n I flashed a quick grin and then shot forward, moving quickly. Her chest rose sharply and her lips parted, as if she anticipated a kiss. As I neared, I saw her lashes flutter closed, and hunger surged through me.\\n\\n But I didn’t kiss her lips. Damn, I wanted to more than anything at that moment, but I knew I had to take things slow with my little Shortcake.\\n\\n So I kissed the tip of her nose.\\n\\n Avery jerked back as her eyes flew open and a wide smile broke out across her face. A soft, light giggle erupted from her, and I knew I’d do a ton of terrible things to hear that sound again.\\n\\n “Admit it,” I said, my voice husky. “You enjoyed that.”\\n\\n Eyes dancing and cheeks flushed, she tilted her head to the side. “I did.”\\n\\n It was only after I was back in my own bed that I realized that the bracelet she always wore around her left wrist had been absent.\\n\\n The giggling girl from last night was nowhere to be found today. For the last hour of our trip, she had been nibbling on her fingernail for so long I wondered how any of it was left.\\n\\n “Are you sure your parents are okay with this?” she asked for the hundredth time, and I nodded for the hundredth time. “And you did actually call them and ask, right?”\\n\\n Casting a sideways look at her, I couldn’t stop myself from teasing her. “No.”\\n\\n “Cam!” she shrieked.\\n\\n I laughed. “I’m kidding. Chill out, Avery. I told them the day after you said you’d go. They know you’re coming and they’re excited to meet you.”\\n\\n She glared at me as she started chewing on her thumbnail again. “That wasn’t funny.”\\n\\n “Yes, it was.”\\n\\n “Jerk,” she mumbled.\\n\\n “Nerd.”\\n\\n One side of her lips curved up. “Bitch-ass.”\\n\\n “Oh.” I whistled. “Them be fighting words. Keep it up and I’ll turn this truck around.”\\n\\n “Sounds like a good idea.”\\n\\n “You’d be distraught and in tears.” I reached over, pulling her hand away from her mouth. “Stop doing that.”\\n\\n “Sorry. It’s a bad habit.”\\n\\n “It is.” I threaded my fingers through hers and brought our joined hands down to my thigh, holding it there.\\n\\n To distract her, I started talking about the recital my sister was having tonight. Teresa wouldn’t be home until early tomorrow morning. The change of subject seemed to work. Truth be told, as we hit the narrow streets of my hometown, I was nervous.\\n\\n I hadn’t brought a girl home since high school, and honestly, those times before really didn’t count. Not in this way.\\n\\n I glanced over at Avery as we came to a red light. She was watching the WVU flag billowing in the wind, her hand still neatly tucked within mine.\\n\\n “You hanging in there?” I asked, squeezing her hand.\\n\\n “Yep.” She squeezed my hand back.\\n\\n My throat was dry as I hit the private road leading up to the house. Out of the corner of my eyes, I watched her reaction.\\n\\n Her eyes widened as she slipped her hand free and leaned forward. Mom had already broken out some of the Christmas decorations. Large green wreaths hung on the front door and on the windows on the second and third floor.\\n\\n I parked next to the garage and faced Shortcake, smiling slightly. “You ready?”\\n\\n A brief flash of panic across her face caused me to fear that she’d take off for the woods, but then she nodded and stepped out. When she reached back to grab her bag, I took it.\\n\\n “I can carry it,” she said.\\n\\n I glanced down at the bag I’d slung over my shoulder. “I’ll carry it. Besides I think the pink-and-blue flower print looks amazing on me.”\\n\\n She laughed nervously. “It’s very flattering on you.”\\n\\n “Thought so.” I waited for Shortcake to make her way over to me and then walked up the slate pathway. We headed under the covered patio, passing the wicker furniture that Dad hadn’t stowed away yet. One look at Avery, and I winced. “You look like you’re about to have a heart attack.”\\n\\n “That bad?”\\n\\n “Close.” Moving closer to her, I tucked a lonely strand of her hair back as I bent down, catching her stare. “You have no reason to be nervous, okay? I promise.”\\n\\n Her gaze flickered from my eyes to my mouth. “Okay.”\\n\\n The urge to capture her mouth and taste the sweetness that was unique to her was hard to resist, but I did. Turning, I opened the door and was met with the scent of apple. My stomach grumbled. That better be pie I was smelling.\\n\\n I led a wide-eyed Avery between the pool tables and the air-hockey table to the stairs. Her gaze darted everywhere, not missing a single thing. I found myself hoping that she liked what she saw, which was weird, because none of this was mine.\\n\\n “This is the man cave,” I told her, guiding her to the stairs. “Dad spends a lot of time down here. There’s the poker table he kicked my ass on.”\\n\\n A small smile pulled at her lips. “I like it down here.”\\n\\n “So do I.” I hesitated at the bottom of the steps. “Mom and Dad are probably upstairs. . . .”\\n\\n She nodded as she pulled away, silently following me up the stairs and through the living room. Magazines were scattered across the coffee table. Meaning that Teresa had had friends over at some point.\\n\\n “Living room,” I said, going through an archway. “And this is the second living room or some room that no one sits in. Maybe it’s a sitting room? Who knows? And this is the formal dining room that we never use but have—”\\n\\n “We do too use the dining room!” shouted Mom. “Maybe once or twice a year, when we have company.”\\n\\n “And break the ‘good dishes’ out,” I said, glancing down at Avery.\\n\\n She came to a complete stop at the end of the coffee table, her face paling. I turned, wanting to make this easier for her, but not sure how, and then Mom strolled into the room, smoothing a strand of hair back into her ponytail.\\n\\n Mom made a beeline for me, catching me in a hug before I could move. “I don’t even know where the ‘good dishes’ are, Cameron.”\\n\\n I laughed. “Wherever they are, they’re probably hiding from the paper plates.”\\n\\n Mom laughed as she pulled back, holding on to my shoulders. “Good to have you home. Your father is starting to get on my nerves with all his ‘going hunting’ talk.” Her gaze drifted to Avery and her smile widened. “And this must be Avery?”\\n\\n “Oh God no,” I said. “This is Candy, Mom.”\\n\\n Color spread across her cheeks as she stepped back, dropping her arms. “Uh, I’m . . .”\\n\\n “I’m Avery,” Shortcake said, shooting me a withering look that made me want to kiss her. “You had it right.”\\n\\n Mom spun, smacking me across the arm. My skin stung. “Cameron! Oh my God, I thought . . .” She smacked me again, and I laughed. “You’re terrible.” Shaking her head, she turned back to Avery. “You must be a patient young lady to have survived a trip here with this idiot.”\\n\\n Shortcake blinked and then a laugh burst from her. Of course, she laughed at that. “It wasn’t that bad.”\\n\\n “Oh.” Mom looked over her shoulder at me. “And she’s well mannered. It’s okay. I know my son is a . . . handful. By the way, you can call me Dani. Everyone does.”\\n\\n Mom hugged Shortcake before the poor girl could even see it coming, and I don’t know why, but seeing those two together did something weird to my chest. My heart started to pound when Avery seemed to unstiffen, wrapping her arms around my mom.\\n\\n “Thank you for letting me come up,” Shortcake said.\\n\\n “It’s no problem. We love having the company. Come on, let’s go meet the guy who thinks he’s my better half. And dear God, I apologize ahead of time if he starts talking to you about how many eight-point bucks he’s planning to hunt this weekend.”\\n\\n I watched as Mom took over, guiding Shortcake through the house, and my heart still hadn’t stopped pounding like a hammer to a stubborn nail.\\n\\n Shortcake looked over her shoulder, her gaze finding mine, and she smiled as our eyes met. I winked and . . .\\n\\n And her smile widened.\\n\\n Seventeen\\n\\n Watching Avery with my sister was painful at first. Shortcake was almost unbearably shy and my sister, God love her, had to lead her through almost every conversation, gently pulling her in. But eventually she relaxed, talking to Teresa about dance, and she even volunteered to help my sister get the sides ready for dinner.\\n\\n The moment Dad and I were alone, he turned to me in the recliner, smiling slightly. “She’s a good girl, Cameron.”\\n\\n “I know.”\\n\\n “I mean, she’s a really good girl.”\\n\\n I glanced at him, brows raised. “I know.”\\n\\n Dad watched me closely, that strange smile still playing over his lips. “Did she ever go out on a date with you?”\\n\\n My lips twitched. “What do you think?”\\n\\n “I think I know the answer.” Dad tipped his head back. “Are you two seeing each other?”\\n\\n “No. I told you and Mom the truth. She’s not my girlfriend.” I paused, thinking about the conversation I’d overheard this morning between Mom and Avery. I would be bringing her home for Christmas and she would be my girlfriend by then. “Yet.”\\n\\n Dad looked like he was about to laugh but didn’t. Opening his eyes, he turned his head and looked me dead-on. “Have you told her about what happened?” \\n\\n","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-22.html","bookId":2002,"book":{"id":2002,"title":"Trust in Me (Wait for You #0)","description":"Storyline: Trust in Me (Wait for You #1.5) \\n by J. Lynn, Jennifer L. Armentrout \\n It’s Wait for You as you’ve never seen it. Trust in Me lets you in on Cam’s side of the #1 New York Times Bestselling story. \\n Cameron Hamilton is used to getting what he wants, especially when it comes to women. But when Avery Morgansten comes crashing into his life – literally – he finally meets the one person who can resist his soulful baby blues. But Cam’s not ready to give up. He can’t get the feisty and intriguing girl out of his head. \\n Avery has secrets, secrets that keep her from admitting the feelings Cam knows she has for him. Will persistence (and some delicious homemade cookies) help him break down her barriers and gain her trust? Or will he be shut out of Avery\u0027s life, losing his first real shot at the kind of love that lasts forever?\\n","cover":"https://allnovel.net/images/trust-in-me-wait-for-you-0.jpg","author":"Jennifer L. Armentrout","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/trust-in-me-wait-for-you-0.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:35:24 PM"}}
