{"id":98684,"no":9,"title":"Page 9","content":"Suddenly unsure of what the hell I was doing, I offered a crooked smile and said to hell with it. “No, but it will be in about fifteen minutes.” “W-w-what?” She moved out of the way as I slipped past her. All the apartments were the same, so I knew where the kitchen was, but I did a quick scan of the living room. The furnishings looked new—the couch and dark end tables. A black moon chair sat beside a TV. No pictures hung on the walls. The moon chair was possibly the most personal thing in the room. “Cam, what are you doing? It’s eight in the morning.” “Thanks for the update on the time. It’s one thing I’ve never been able to master: the telling of time.” She trailed after me, and I could feel her staring daggers in my back. “Why are you here?” “Making breakfast.” “You can’t do that in your own kitchen?” “My kitchen isn’t as exciting as yours.” I placed the eggs and bread on the counter and faced her. Scrubbing her eyes, she looked so damn cute, and I wished I was wearing something more decent than sweats and a shirt I wasn’t even sure was clean. “And Ollie is passed out on the living-room floor.” “On the floor?” “Yep. Facedown, snoring and drooling a little. It’s not an appetizing atmosphere.” Her lips twitched into a quick smile and then quickly disappeared. “Well, neither is my apartment.” I folded my arms as I leaned against the counter. “Oh, I don’t know about that . . .” I let my gaze wander the exquisite length of hers. Her nipples were hard, pressing against her shirt, begging to be touched, licked, and kissed and God knows what else I would do to them. Lust slammed into my gut and I almost took a step toward her. “Your kitchen, right this second, is very appetizing.” She flushed. “I’m not going out with you, Cam.” “I didn’t ask you at this moment, now did I?” I grinned. “But you will eventually.” “You’re delusional.” “I’m determined.” “More like annoying,” she retorted, brown eyes twinkling. “Most would say amazing.” She rolled her eyes. “Only in your head.” “In many heads is what you meant.” I turned to the stove. “I also brought banana-nut bread baked in my very own oven.” There was a pause. “I’m allergic to bananas.” I wheeled around. “Are you shitting me?” “No. I’m not. I’m allergic to bananas.” “Man, that’s a damn shame. You have no idea what you’re missing out on. Bananas make the world a better place.” “I wouldn’t know.” Well damn. Apparently she could resist my banana-nut bread. “Anything else you’re allergic to?” “Besides penicillin and guys who bust up into my apartment? No.” “Hardy-har-har.” I turned and bent, opening the nearest cabinets. “How many weaker, less-assured guys have you slayed with that tongue of yours?” “Apparently not enough.” Her gasp was audible. “I’ll be right back.” I had no idea what she was up to, but I doubted she’d leave the apartment. Humming under my breath, I found a pot to boil eggs in and filled it with water. Plopping it on the stove, I cranked up the heat. I could hear her back in her bedroom, her soft footfalls, heavier than I thought they’d be. A couple of moments went by and I turned to the doorway. It was quite possible that she would lock herself in her room. Dammit. “Hey! Are you hiding back there?” I yelled. “Because I will come back there and drag you out.” “Don’t you dare come in here!” she shouted. I laughed softly. As appealing as seeing firsthand what she was doing was, I didn’t want to end up in the hospital for doing so. “Then hurry up. My eggs wait for no one.” By the time she returned, I found shredded cheese and had decided she was going to eat hers sunny side up. I didn’t say anything even though I knew she was there, staring at me. “Cam, why are you over here?” she finally asked. “I already told you.” I eased the eggs onto a plate and walked it over to the small table pressed up against the wall. “Do you want toast? Wait. Do you have bread? If not, I can—” “No. I don’t need toast.” She watched me, eyes wide. “Don’t you have anyone else to bother?” “There are a shit ton of people that I could reward with my presence, but I chose you.” Her mouth moved, but there was no sound and then she spun around, hopping up on the chair, pulling her knees to her chest as she picked up a fork. “Thanks,” she muttered. I raised my brows. “I choose to believe that you mean that.” “I do!” I turned back to the stove. “I doubt that for some reason.” There were several seconds of silence and then. “I do appreciate the eggs. I’m just surprised to see you here . . . at eight in the morning.” Waiting for my eggs to finish boiling, I found myself watching her. “Well, to be honest, I was planning to woo you with my banana-nut bread, but that shit ain’t happening now. So all I have left are my delicious eggs.” “It is really good, but you’re not wooing me.” “Oh, I’m wooing.” I went to her fridge and found some OJ. Grabbing two glasses, I poured some sweetness and sat one in front of her. “It’s just all about the stealth. You don’t realize it yet.” She ducked her gaze to her plate. “Aren’t you eating?” “I am. I like boiled eggs.” Sitting across from her, I rested my chin in my palm. Her hair fell forward, nearing hitting the plate. She kept batting the strands away. She was so fucking cute. “So, Avery Morgansten, I’m all yours.” Her lashes swept up. “I don’t want you.” “Too bad. Tell me about yourself.” Shortcake pressed her lips into a thin line. “Do you do this often? Just walk into random girls’ apartments and make eggs?” “Well, you’re not random, so technically no.” Pushing up, I checked the eggs. “And I might be known to surprise lucky ladies every now and then.” Which wasn’t exactly true. I mean, if I somehow found myself in someone else’s place and I was up, I’d make breakfast, but this? This was a first. But she didn’t need to know that. “Seriously? I mean, you do this normally?” I glanced over my shoulder. “With friends, yes, and we’re friends, aren’t we, Avery?” She studied me for a few moments and then placed her fork down. “Yeah, we’re friends.” “Finally!” I shouted. “You’ve finally admitted that we are friends. It’s only taken a week.” “We’ve only known each other for a week.” “Still took a week.” As I started devouring my eggs, she questioned me on how long it took for me to declare best-friend status. Sitting back at the table, I met her curious stare. “It usually takes me about five minutes before we’ve moved on to best-friend status.” A tiny smile appeared on her lips. “Then I guess I’m just the odd one.” “Maybe.” “I guess it’s different for you.” “Hmm?” I peeled the last piece of shell off the egg. “I bet you have girls hanging all over you. Dozens would probably kill to be in my spot and here I am, allergic to your bread.” I looked up. “Why? Because of my near godlike perfection?” She laughed outright, and that goddamn knot was back in my chest. “I wouldn’t go that far.” Shrugging, I chuckled. “I don’t know. Don’t really think about it.” “You don’t think about it at all?” “Nope.” I popped the egg in my mouth and then wiped my hands on a napkin. “I only think about it when it matters.” Her gaze bounced off of mine as she toyed with her glass. “So you’re a reformed player?” “What makes you think that?” “I heard you were quite the player in high school.” “Really? Who did you hear that from?” “None of your business.” I took a deep breath. Her tongue was sharp as a blade. “With that mouth of yours, you don’t have a lot of friends, do you?” Shortcake flinched. “No. I wasn’t really popular in high school.” Aw fuck, now I felt like a dick. I dropped my egg onto the plate. “Shit. I’m sorry. That was an asshole thing for me to say.” She shook her head. I watched her as I picked up the egg and peeled it, unable to figure her out. “Hard to believe though that you weren’t. You can be funny and nice when you’re not insulting me and you’re a pretty girl. Actually, you’re really hot.” “Ah . . . thanks.” She wiggled in her seat. “I’m serious. You said your parents were strict. They didn’t let you hang out in high school?” I popped the other egg in. Needed my protein. “I still can’t imagine you not being popular in high school. You rock the trifecta—smart, funny, and hot.” “I wasn’t. Okay?” Sitting the glass down, she started fiddling with the hem on her shorts. “I was like the very opposite of popular.” Unsure of what to think about that comment, I peeled the third egg. I’d seen her around campus with a girl I went to high school with and Jacob Massey. It wasn’t like she was incapable of making friends. “I am sorry, Avery. That . . . that sucks. High school is a big deal.” “Yeah, it is. You had a lot of friends?” I nodded. I had a busload of friends. “Still talk to them?” “Some of them. Ollie and I went to high school together, but he spent his first two years at WVU and transferred down here and I see a few around campus and back home.” She huddled in on herself, looking incredibly small. “Have any brothers or sisters?” “A sister.” I went for the final egg, smiling. “She’s younger than me. Just turned eighteen. She graduates this year.” “You guys close?” “Yeah, we’re close.” I liked that she was asking me questions, but talking about my sister made me think of other things. “She means a lot to me. How about you? A big brother I have to worry about visiting and kicking my ass for being here?” One side of her lips curved up. “No. I’m an only child. Have a cousin who’s older, but I doubt he’d do that.” “Ah, good.” I finished off the last egg, leaned back and patted my stomach. “Where you from?” When she didn’t answer, I decided I was so not letting this go. I wanted to know her. Exchange of information was necessary. “Okay. You obviously know where I’m from if you’ve heard of my extracurricular activities in high school, but I’ll just confirm it. I’m from the Fort Hill area. Never heard of that? Well, most people haven’t. It’s near Morgantown. Why didn’t I go to WVU? Everyone wants to know that. Just wanted to get away, but be somewhat close to my family. And yes, I was . . . very busy in high school.”","sourceLink":"https://allnovel.net/trust-in-me-wait-for-you-0/page-9.html","bookId":2002,"book":{"id":2002,"title":"Trust in Me (Wait for You #0)","description":"Storyline: Trust in Me (Wait for You #1.5) by J. Lynn, Jennifer L. Armentrout It’s Wait for You as you’ve never seen it. Trust in Me lets you in on Cam’s side of the #1 New York Times Bestselling story. Cameron Hamilton is used to getting what he wants, especially when it comes to women. But when Avery Morgansten comes crashing into his life – literally – he finally meets the one person who can resist his soulful baby blues. But Cam’s not ready to give up. He can’t get the feisty and intriguing girl out of his head. Avery has secrets, secrets that keep her from admitting the feelings Cam knows she has for him. Will persistence (and some delicious homemade cookies) help him break down her barriers and gain her trust? Or will he be shut out of Avery\u0027s life, losing his first real shot at the kind of love that lasts forever?","cover":"https://allnovel.net/images/trust-in-me-wait-for-you-0.jpg","author":"Jennifer L. Armentrout","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/trust-in-me-wait-for-you-0.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:35:24 PM"}}
