{"id":4928,"no":108,"title":"Chapter 3","content":"It was a week after the assassination of Cleon-and a horrible week it shad been. All of Trantor was in chaos. Hari Seldon still kept his office as First Minister, but it was clear he had no power. He called in Manella Dubanqua. \"I want to thank you for saving Raych\u0027s life and my own. I haven\u0027t I a chance to do so yet.\" Then with a sigh, \"I have scarcely had a chance to do anything this past week.\" Manella asked, \"What happened to the mad gardener?\" \"Executed! At once! No trial! I tried to save him by pointing out that was insane. But there was no question about it. If he had done anything else, committed any other crime, his madness would have been recognized and he would have been spared. Committed-locked up and treated-but spared, nonetheless. But to kill the Emperor-\" Seldon shook his head sadly. Manella said, \"What\u0027s going to happen now, First Minister?\" \"I\u0027ll tell you what I think. The Entun Dynasty is finished. Cleon\u0027s son will not succeed. I don\u0027t think he wants to. He fears assassination in his turn and I don\u0027t blame him one bit. It would be much better for him to retire to one of the family estates on some Outer World and live a quiet Because he is a member of the Imperial House, he will untie allowed to do this. You and I may be less fortunate.\" Manella frowned. \"In what way, sir?\" Seldon cleared his throat. \"It is possible to argue that because you killed Gleb Andorin, he dropped his blaster, which became available to Mandell Gruber, who used it to kill Cleon. Therefore you bear a strong share of the responsibility of the crime and it may even be said that it was all prearranged.? 揃ut that抯 ridiculous. I am a member of the security establishment, fulfilling my duties-doing what I was ordered to do.\" Seldon smiled sadly. \"You\u0027re arguing rationally and rationality is not going to be in fashion for a while. What\u0027s going to happen now, in the absence of a legitimate successor to the Imperial throne, is that we are bound to have a military government.\" (In later years, when Manella came to understand the workings of psychohistory, she wondered if Seldon had used the technique to work out what was going to happen, for the military rule certainly came to pass. At the time, however, he made no mention of his fledgling theory.) \"If we do have a military government,\" he went on, \"then it will be necessary for them to establish a firm rule at once, crush any signs of disaffection, act vigorously and cruelly, even in defiance of rationality and justice. If they accuse you, Miss Dubanqua, of being part of a plot to kill the Emperor, you will be slaughtered, not as an act of justice but as a way of cowing the people of Trantor. \"For that matter, they might say that I was part of the plot, too. After all, I went out to greet the new gardeners when it was not my place to do so. Had I not done so, there would have been no attempt to kill me, you would not have struck back, and the Emperor would have lived. -Do you see how it all fits?\" \"I can\u0027t believe they will do this.\" \"Perhaps they won\u0027t. I\u0027ll make them an offer that, just perhaps, they may not wish to refuse.\" \"What would that be?\" \"I will offer to resign as First Minister. They don\u0027t want me, they won\u0027t have me. But the fact is that I do have supporters at the Imperial Court and, even more important, people in the Outer Worlds who find me acceptable. That means that if the members of the Imperial Guard force me out, then even if they don\u0027t execute me, they will have some trouble. If, on the other hand, I resign, stating that I believe the military government is what Trantor and the Empire needs, then I actually help them, you see?\" He mused a little and said, \"Besides, there is the little matter of psychohistory.\" (That was the first time Manella had ever heard the word.) \"What\u0027s that?\" \"Something I\u0027m working on. Cleon believed in its powers very strongly-more strongly than I did at the time-and there\u0027s a considerable feeling in the court that psychohistory is, or might be, a powerful tool that could be made to work on the side of the government-whatever the government might be. \"Nor does it matter if they know nothing about the details of the science. I\u0027d rather they didn\u0027t. Lack of knowledge can increase what we might call the superstitious aspect of the situation. In which case, they will let me continue working on my research as a private citizen. At least, I hope so. -And that brings me to you.\" \"What about me?\" \"I\u0027m going to ask as part of the deal that you be allowed to resign h the security establishment and that no action be taken against you ~ the events in connection with the assassination. I ought to be able to \u0027But you\u0027re talking about ending my career.\" \"Your career is, in any case, over. Even if the Imperial Guard doesn\u0027t up an order of execution against you, can you imagine that you will Be allowed to continue working as a security officer?\" \"But what do I do? How do I make a living?\" \"I\u0027ll take care of that, Miss Dubanqua. In all likelihood, I\u0027ll go back to Streeling University, with a large grant for my psychohistorical research, I\u0027m sure that I can find a place for you.\" Manella, round-eyed, said, \"Why should you-\" Seldon said, \"I can\u0027t believe you\u0027re asking. You saved Raych\u0027s life and own. Is it conceivable that I don\u0027t owe you anything?\" And it was as he said. Seldon resigned gracefully from the post he had held for ten years. He was given a fulsome letter of appreciation for His services by the just-formed military government, a junta led by certain members of the Imperial Guard and the armed forces. He returned to Streeling University and Manella Dubanqua, relieved of her own post as security officer, went with Seldon and his family.","sourceLink":"http://novel.tingroom.com/kehuan/1569/46723.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
