{"id":4975,"no":155,"title":"第二十六章","content":"　　在主楼的小会议室内，泰姆外尔·林恩听着铎丝的叙述，脸上逐渐浮现困惑与愤怒的表情。最后，他终于冒出一句：“不可能！” \n 他摸了摸下巴，谨慎地说道：“我无意冒犯，凡纳比里博士，但你的说法简直是荒……不可能是真的。心理史学计划中，不可能有什么了不得的深仇大恨能证明你的怀疑。有的话我一定会知道，但我向你保证绝对没有。你千万别这么想。” \n “我就是这么想，”铎丝倔强地说，“我还找到了证据。”林恩说：“我无意冒犯，凡纳比里博士，但一个人如果一心想证明某件事，只要他够聪明，绝对能找到他想要的任何东西，或至少是他自以为是证据的东西。” \n “你在暗示我有妄想症吗？” \n “你对大师非常关心——这点我始终和你是一样的——但你的关心似乎有点过头了。”铎丝顿了顿，琢磨着林恩的话。“至少你说对一件事，一个聪明人能找出他要的任何证据。比如说，我就能指控你一项罪名。”林恩一阵错愕，瞪大眼睛看着铎丝。“指控我？指控我什么？”“好，我就说清楚。生日宴会是你的主意，对不对？”林恩说：“没错，是我的主意，但别人一定也想到了。大师最近经常感慨上了年纪，宴会似乎是逗他开心的好办法。”“我相信别人一定也想到了，但实际上鼓吹这件事的却是你。你让玛妮拉一头栽进去，筹备一切细节，而且使她相信可以举办一个联合的大型庆生会。是不是这样？” “我不知道她有没有受到我的影响，就算有，这有什么不对吗？” \n “庆生会本身是没有错，但举办一场规模这么大、历时这么长的庆生会，不就等于向那些地位不稳、疑心病又重的执政团大肆宣传哈里受欢迎的程度，让他们觉得哈里也许是个威胁？” \n “谁会相信我有这种居心。” 铎丝说：“我只是指出这个可能性。在筹备过程中，你坚持把几间核心研究室搬空——” “那只是暂时的，理由很明显。” “而且你坚持那些研究室在筹备期间要停止使用。所以在那段期间，除了雨果·阿马瑞 尔，没有人在那里工作。” \n “我认为事先休息一下，对大师绝不会有什么害处，你不会是因为这件事怪我吧？” “但这样你就能乘机在搬空的研究室里，跟某人商量事情。研究室有良好的屏蔽，隐秘性绝对足够。” \n “我的确在那里商量事情——跟玛妮拉，跟宴会承办商、食品供货商，以及其他的生意人。你认为这些事不必要吗？”“如果其中有一个是执政团成员呢？” 林恩像是挨了一拳。“太过分了，凡纳比里博士，你把我当成什么了？”铎丝并未直接回答。“接着，你又去找谢顿博士，讨论他即将和将军会晤的事，并且力荐自己代替他去，好承担可能发生的危险。当然，谢顿博士坚持自己去见将军。而我们可以说，那正是你希望确定的事。”林恩神经质地笑了笑。“博士，我没有不敬之意，但这听来的确像是妄想。”铎丝继续进逼。“还有，在宴会结束后，提议我们一大群人前往穹缘旅馆的也是你，对吧？” \n “是的，我记得你还说那是个好主意。”“难道这不可能是炫耀哈里声望的另一次机会，好让执政团不安？难道这不是诱我侵入御苑的一种安排？” \n “我有能力阻止你吗？”林恩的困惑已被愤怒取代，“你早已决心那么做。”铎丝完全没理会他说些什么。“而且，毫无疑问地，你希望我闯进御苑后惹出更多麻烦， 好让执政团更加敌视哈里。” \n “这一切是为什么，凡纳比里博士？我为什么要这样做？”“或许你想除掉谢顿博士，好继他之后出任计划主持人。”“你怎么会认为我有这种企图？你不可能是认真的吧，你只是在向我证明——就像你一开始说的——一个热衷于找出证据的聪明人能做到什么程度。”“我们来讨论另一件事。我说过，你当时乘机利用那些空房间进行密谈，对象也许是一名执政团成员。” \n “这种指控不值得我否认。” “但有人听到你们的谈话。一个小女孩无意间走进那房间，窝在一张椅子里，你们看不到她，她却听到了你们的谈话。” 林恩维起眉头。“她听到些什么？”“她说听到有两个男的谈到死亡。她只是个孩子，无法转述细节，但有几个字令她印象深刻，那就是‘柠檬水之死’。” “现在你似乎从幻想转变成——请原谅我这么说——疯狂。柠檬水之死’能有什么意思？ 跟我又有什么关系？” \n “我的第一个反应是照字面解释。那个小女孩非常喜爱柠檬水，而宴会准备了大量柠檬水，不过并没有人在里面下毒。” “感谢你至少没把我当成疯子。” “后来我才醒悟，那女孩听到的是别的字眼。由于她对语言的理解力还不够，又特别偏爱那种饮料，才将那几个字曲解成‘柠檬水’。”“你想出她曲解的是什么吗？”林恩冷笑一下。 “曾经有一阵子，我认为她听到的可能是‘零墨水致死？’。”“那又是什么意思？” \n “由零墨水，也就是非数学家策动的暗杀——” 铎丝突然打住。她皱起眉头，一只手紧抓胸口。 林恩立刻关切地问：“你怎么了，凡纳比里博士？” \n “没事。”铎丝似乎摇晃了一下。 有好一会儿，她没有再开口。林恩清了清喉咙，正色说道：“凡纳比里博士，你的推论越来越荒谬了。而且……好吧，我不在乎是否会冒犯你，但我已经不想再谈这些话了。谈话是不是该结束了？” \n “就快了，林恩博士——正如你所说，零墨水的确有点荒谬，我自己也已经这么判定。不过，电子阐析器的发展，你负责了其中一部分，对不对？” “全部是我一个人负责的。”林恩似乎挺起胸膛，语气有点骄傲。 “是吗？据我了解，它是欣妲·蒙内设计的。”“她只是设计者，一切遵循我的指导。”“她是个零墨水，电子阐析器是零墨水设计的装置。”林恩压抑着怒气，粗声说道：“够了！我不想再听到这几个字。我再说一次，谈话是不是该结束了？” \n 铎丝继续说下去，仿佛没听到他的要求。“现在你否认欣妲的功劳，但你在她面前可不是这么说的——我猜是为了让她继续替你卖命吧。她非常感激说你承认她有功劳，还说你甚至用你们两人的名字称呼这个装置，虽然那并非正式的名称。”“当然不是，它叫做电子阐析器。”“欣妲还提到，她正在改良这个装置，加强它的功能。而你已经拿到这个改良型式的原型，准备进行测试。” \n “这一切又代表什么呢？” \n “自从谢顿博士和阿马瑞尔博士利用电子阐析器工作后，两人在某些方面都变得比较衰弱。雨果使用的时间长，受的伤害也比较大。” “电子阐析器绝不会对人体造成伤害。”铎丝伸手按着额头，怔了片刻才说：“现在你有了更强力的电子阐析器，杀伤力可能更大，或许可以立刻将人杀死，而不必慢性谋杀。”“真是胡说八道。” \n “现在我们从这个装置的名称来推论看看。根据设计者欣妲告诉我，你个人对这装置有个专用的名称，我猜它叫林恩-蒙内阐析器。” \n “我不记得用过这名称。”林恩不安地说。 “你当然用过。而这个经过强化的新林恩-蒙内阐析器，可以杀人于无形，没有人需要 负责。任何意外都可以推说是一个未经试验的新装置所造成的悲剧。那就是‘林恩-蒙内之 死’，而那小女孩把它听成了‘柠檬水之死’。”铎丝伸手抚着自己的侧腹。 \n 林恩轻声道：“你不舒服吗，凡纳比里博士？” “我好得很。我说的不对吗？”“听好，你把什么字眼扭曲成柠檬水并不重要。谁知道那小女孩究竟听到什么？如果一切都归咎于电子阐析器，那就把我送上法庭，或是交给科学调查委员会，然后随你爱找多少专家就找多少，让他们检査电子阐析器对人体会造成什么效应，甚至那个新的增强型也可以一并检查。他们将会发现，根本测不出来任何效应。”“我不相信……”铎丝喃喃道，现在她双手扶着额头，双眼紧闭，身子微微摇晃起来。“你身体显然很不舒服，凡纳比里博士，”林恩说，“或许这表示，现在该轮到我说话了，如何？” \n 铎丝睁开双眼，定定地望着前方。 “我把你的沉默当成同意，博士。我若想当主持人，试图除掉谢顿博士和阿马瑞尔博士有什么用？你会阻止我的任何暗杀计划，就像此刻你自以为正在做的事一样。即使我的计划侥幸成功，除掉了那两位大人物，你也会在事后将我撕成碎片。你是个不寻常的女人，强壮、 迅速得令人难以置信，只要你活着，谁也别想动大师一根汗毛。” “没错。”铎丝凶狠地瞪着林恩。 “我把这点告诉了执政团的人——他们为何不该向我询问谢顿计划的进展？他们对心 理史学极有兴趣，这是很自然的事。在你侵入御苑前，他们原本不相信我对你的描述，是你自己的行动说服了他们。于是他们决定采用我的计划。” “啊哈，现在说到正题了。”铎丝虚弱地说。“我告诉过你电子阐析器不会伤害人类，这是事实。阿马瑞尔和你亲爱的哈里只不过是老了，虽然你拒绝承认。所以说呢，他们没事，全都好端端的，那种电磁场对有机物质没有重大影响。但是敏感的电磁机械可能就另当别论了——譬如一个金属与电子零件构成的人类， 可能就会受到损害。传说这种人造人曾一度存在，是麦曲生人的信仰基础。他们将这些人造人称为‘机仆’。如果真有机仆这种东西，那么不难想像，它一定会比任何人类更强壮、更迅速。事实上，凡纳比里博士，它可能具有某些和你很像的特质。而强化型电子阐析器的确能阻止、伤害，甚至摧毁机仆。现在我手边就有个这样的装置，从我们交谈开始，它就一直以低功率运作，这就是造成你不舒服的原因，凡纳比里博士。我敢说，这种感觉是你存在以来，第一次感受到的。” \n 铎丝没有回答，只是瞪着面前这个人，然后缓缓倒在椅子里。 林恩微微一笑，继续说：“当然，把你解决后，大师和阿马瑞尔便不成问题。事实上，大师一失去你，可能会立刻万念俱灰，在悲痛中辞职下台。而在大师心目中，阿马瑞尔只是个孩子，根本不足担当大任。十之八九，我两个人都不必杀，一切就会手到擒来。凡纳比里博士，经过了这么多年，你的真面目终于被揭穿，感觉如何啊？我必须承认你隐藏得非常好， 难怪在我之前从来没人能发现真相。而我，我是个优秀的数学家，善于观察、思考和推理，但若非你对大师那份狂热的奉献，还有他一受威胁，你便立刻爆发的超人能力，可能连我也看不出真相。 \n “说再见吧，凡纳比里博士。现在，我只要将这个装置调到全额功率，你便会成为历史。”铎丝似乎振作起精神，从椅子上慢慢起身，喃喃道：“我的屏蔽功能也许比你想像中的好。”她轻哼一声，突然扑向林恩。林恩睁大眼睛惊叫，踉跄向后猛退。但铎丝已来到面前，右手闪电般击中林恩的颈部，震断了他的脊椎和神经索。林恩当场毙命。 \n 铎丝勉力站直身子，朝门口蹒跚走去。她必须找到谢顿，必须让他知道发生了什么事。 \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46812.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
