{"id":4976,"no":156,"title":"Chapter 27","content":"Hari Seldon rose from his seat in horror. He had never seen Dors look so, her face twisted, her body canted, staggering as though she were drunk. \"Dors! What happened! What\u0027s wrong!\" He ran to her and grasped her around the waist, even as her body gave way and collapsed in his arms. He lifted her (she weighed more than :m ordinary woman her size would have, but Seldon was unaware of that ;it the moment) and placed her on the couch. \"What happened?\" he said. She told him, gasping, her voice breaking now and then, while he cradled her head and tried to force himself to believe what was happening. \"Elar is dead,\" she said. \"I finally killed a human being. -First time. Makes it worse.\" \"How badly are you damaged, Dors?\" \"Badly. Elar turned on his device-full-when I rushed him.\" \"You can be readjusted.\" \"How? There\u0027s no one-on Trantor-who knows how. I need I Daneel.\" Daneel. Demerzel. Somehow, deep inside, Hari had always known. His friend-a robot-had provided him with a protector-a robot-to ensure that psychohistory and the seeds of the Foundations were given a chance to take root. The only problem was, Hari had fallen in love with his protector-a robot. It all made sense now. All the nagging doubts and the questions could be answered. And somehow, it didn\u0027t matter one bit. All that mattered was Dors. \"We can\u0027t let this happen.\" \"It must.\" Dors\u0027s eyes fluttered open and looked at Seldon. \"Must. Tried to save you, but missed-vital point-who will protect you now?\" Seldon couldn\u0027t see her clearly. There was something wrong with his eyes. \"Don\u0027t worry about me, Dors. It\u0027s you- It\u0027s you-\" \"No. You, Hari. Tell Manella-Manella-I forgive her now. She did better than I. Explain to Wanda. You and Raych-take care of each other.\" \"No no no,\" said Seldon, rocking back and forth. \"You can\u0027t do this. Hang on, Dors. Please. Please, my love.\" Dors\u0027s head shook feebly and she smiled even more feebly. \"Goodbye, Hari, my love. Remember always-all you did for me.\" \"I did nothing for you.\" \"You loved me and your love made me-human.\" Her eyes remained open, but Dors had ceased functioning. Yugo Amaryl came storming into Seldon\u0027s office. \"Hari, the riots are beginning, sooner and harder even than exp-\" And then he stared at Seldon and Dors and whispered, \"What happened?\" Seldon looked up at him in agony. \"Riots! What do I care about riots now? -What do I care about anything now?\"","sourceLink":"http://novel.tingroom.com/kehuan/1569/46813.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
