{"id":4983,"no":163,"title":"第二章","content":"　　贴地滑车一辆辆整齐地排在一间大型凹室里，谢顿叹了口气，钻进其中一辆。几年前，他还为了自己能轻快走过图书馆无际的面廊而沾沾自喜，并且对自己说，尽管年过六十，他的脚劲依旧健朗。 \\n\\n 可是现在，他七十岁的双腿迫不及待地老朽，使他不得不乘坐贴地滑车。其实年纪较轻的人也常利用这种交通工具，因为贴地滑车能省时又省力，但谢顿没有选择余地，其中的感觉自然大不相同。 \\n\\n 谢顿键入目的地，再按下开关，滑车便从地板稍微浮起。它不急不徐地向前驶去，平稳而安静。谢顿靠在座椅上，望着两旁的回廊墙壁、其他贴地滑车，以及偶尔出现的步行者。他超过了好些图书馆员。即使过了这么多年，他看到他们时仍不禁莞尔一笑。他们属于帝国最古老的公会，拥有最虔敬的传统，谨守的行事方式似乎更适合数世纪前，甚或数千年前的时代。 \\n\\n 他们穿着白灰色的丝质服装，宽松有如长袍，整件衣服只在颈部束紧，颈部以下则宽松飘逸。 \\n\\n 川陀与所有世界一样，男性的容貌在胡须的剃与留两极摆荡。现在的川陀男性（至少大多数区的男性）脸上都刮得干干净净，而且据他所知向来如此，只有一些例外，譬如达尔男性——像芮奇——便全留着八字胡。然而，这些图书馆员却留着过时已久的络腮胡，除了嘴唇上方，两耳之间尽是修剪得整整齐齐的短须。光是络腮胡这点，就足以显示他们的身份，并使面部光洁的谢顿感到有点不自在。 \\n\\n 其实，图书馆员最大的特征是他们天天戴的帽子（说不定连睡觉都不脱，谢顿想）。这种方型帽的质料类似天鹅绒，四面聚合于顶端，由一个扣子固定；颜色则五花八门，而且显然各有不同意义。假如你熟悉图书馆员的圈内文化，就能根据帽子的颜色，判断出他们的服务年资、专长领域、成就等等。如此有助于建立一个阶级秩序，每位图书馆员只要瞥一眼别人的帽子，便可判断是否该尊敬对方（以及要做到什么程度），或是否该受对方的尊敬（以及到什么程度）。 \\n\\n 帝国图书馆是川陀（说不定是全银河）上最大的单一建筑，甚至远比皇宫巨大。它曾一度金碧辉煌，仿佛夸耀着自身的堂皇与壮伟。然而，正如帝国的衰退一样，图书馆已开始凋零，就像一名年华已去的贵妇，尽管仍戴着年轻时的珠宝，全身却已满是皱纹与赘肉。贴地滑车停在图书馆长办公室华丽的门口。 拉斯·齐诺面带笑容地迎接谢顿。“欢迎，我的朋友。”他的声音非常尖锐，谢顿一直怀疑他年轻时是否唱过男高音，但从来不敢问。图书馆长是个威严的人，这问题可能会显得无礼。 \\n\\n “你好。”谢顿说。 \\n\\n 齐诺灰色的络腮胡已经白了七八分，他的帽子是纯白色的。谢顿完全了解这一顶帽子的意义，根本无需任何解释。这是一种倒置的表饰系统，完全素朴的颜色反倒代表位居顶峰。齐诺搓了搓手，似乎非常兴奋。“我把你请来，哈里，是因为有个好消息告诉你。我们找到它了！” \\n\\n “找到什么？” \\n\\n “一个合适的世界。你要一个遥远的世界，我想我们已经找到个最理想的。”他的笑容变得更灿烂，“有问题尽管交给本馆，哈里，我们保证找出答案。”“我绝对相信，拉斯。谈谈这个世界吧。” “好，我先让你看看它的位置。”部分墙面向旁边滑开，室内的光线暗了下来，然后他们眼前出现一个缓缓旋转的三维影像银河，并且缓缓旋转。安纳克瑞昂星省再度被红光标示出来，谢顿几乎可以发誓，刚才那段插曲正是现在的一场预演。然后，安纳克瑞昂星省的远程出现了一个明亮的蓝色光点。“就在那里。”齐诺说，“一 个理想的世界，大小适中，水量充沛，富氧的大气层，丰富的植物群，此外，上面还有许多海中生物。简直就是为我们预备好的，不需要任何行星塑造或地表改造——就算有什么需要改造的地方，也可以等到实际住人后再进行。” 谢顿问：“它是个未住人的行星吗，拉斯？”“没错，上面一个人都没有。”“可是如果它这么合适，为什么没住人呢？既然图书馆有它的详细资料，我猜一定有人做过探勘。为什么没人殖民呢？” “是做过探勘，但是由无人探测器执行的。没有人殖民，想必是因为它的位置太偏远了。 这颗行星所环绕的恒星，比任何住人行星与中心黑洞的距离都远得多。我猜，对于任何准备殖民的人而言，它都嫌太远了。但我想你不会这么认为，你说过：‘越远越好。’” “没错，”谢顿点点头，“我的要求没变。它有名字吗？或是只有编号？” “信不信由你，它还真有个名字。送出探测器的那些人将它命名为‘端点’，那是个古老的词汇，意思是‘线的尽头’，和它似乎正好相称。” 谢顿说：“这个世界在安纳克瑞昂星省的版图中吗？”“并不尽然，”齐诺说，“如果你仔细研究红线和红色阴影，会发现端点星的蓝点位于界 外少许。事实上，是在五十光年外。端点星不属于任何世界。严格说起来，它甚至不是帝国的一部分。” \\n\\n “那么你说对了，拉斯，它的确是我正在寻找的理想世界。” “当然啦，”齐诺若有所思地说，“一旦你登上端点星，我想安纳克瑞昂的总督就会声称 那里是他的管辖范围。” \\n\\n “也许。”谢顿说，“但等问题出现了再说。” 齐诺又搓了搓手：“多壮阔的构想啊。在一个崭新的、遥远、全然隔绝的世界上，创设一个庞大的计划，花上数十年甚至上百年的时间，把人类全体知识汇集起来编成一套百科全书，那将是本图书馆所有藏书内容的缩影。要是我再年轻些，我会很希望加入这场远征。”谢顿悲伤地说：“你几乎比我年轻二十岁。”（他更悲伤地想道，几乎人人都比我年轻。）齐诺说：“啊，对了，我听说你刚过完七十岁生日。你们―定好好庆祝了一番，玩得开心吗？” \\n\\n 谢顿突然动容：“我不庆祝生日。”“哦，是吗？我还记得你六十大寿那场盛大的庆生会。” 谢顿感到一阵锥心痛苦，仿佛那个世上最沉痛的失落才发生在昨天。“请不要谈这件事。”。 “噢，对不起。”齐诺有点尴尬，“我们谈点别的吧。如果说，端点星确是你要找的那个 世界，那么我建议，你那百科全书计划的准备工作得加紧进行了。你放心，本馆在各方面都乐意帮助你。” \\n\\n “我了解，拉斯，感激不尽。我们一定会继续努力。”谢顿说毕站了起来。齐诺刚才提到的那场庆生会仍使他心如刀割，他没法露出微笑。“我 必须告辞了，”他说，“我得回去工作。” 谢顿离去时，又和往常一样，为了自己的欺骗行为而感到良心不安。事实上，拉斯·齐 诺根本不明白谢顿的真正意图。 \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46820.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
