{"id":4984,"no":164,"title":"Chapter 3","content":"Hari Seldon surveyed the comfortable suite that had been his personal office at the Galactic Library these past few years. It, like the rest of the Library, had a vague air of decay about it, a kind of weariness-something that had been too long in one place. And yet Seldon knew it might remain here, in the same place, for centuries more-with judicious rebuildings-for millennia even. \\n\\n How did he come to be here? \\n\\n Over and over again, he felt the past in his mind, ran his mental tendrils along the line of development of his life. It was part of growing older, no doubt. There was so much more in the past, so much less in the future, that the mind turned away from the looming shadow ahead to contemplate the safety of what had gone before. \\n\\n In his case, though, there was that change. For over thirty years psychohistory had developed in what might almost be considered a straight line-progress creepingly slow but moving straight ahead. Then six years ago there had been a right-angled turn-totally unexpected. \\n\\n And Seldon know exactly how it had happened, how a concatenation of events came together to make it possible. \\n\\n It was Wanda, of course, Seldon\u0027s granddaughter. Hari closed his eyes and settled into his chair to review the events of six years before. \\n\\n Twelve-year-old Wanda was bereft. Her mother, Manella, had had another child, another little girl, Bellis, and for a time the new baby was a total preoccupation. \\n\\n Her father, Raych, having finished his book on his home sector of Dahl, found it to be a minor success and himself a minor celebrity. He was called upon to talk on the subject, something he accepted with alacrity, for he was fiercely absorbed in the subject and, as he said to Hari with a grin, \"When I talk about Dahl, I don\u0027t have to hide my Dahlite accent. In fact, the public expects it of me.\" \\n\\n The net result, though, was that he was away from home a considerable amount of time and when he wasn\u0027t, it was the baby he wanted to see. \\n\\n As for Dors-Dors was gone-and to Hari Seldon that wound was ever-fresh, ever-painful. And he had reacted to it in an unfortunate manner. It had been Wanda\u0027s dream that had set in motion the current of events that had ended with the loss of Dors. \\n\\n Wanda had had nothing to do with it-Seldon knew that very well. And yet he found himself shrinking from her, so that he also failed her in the crisis brought about by the birth of the new baby. \\n\\n And Wanda wandered disconsolately to the one person who always seemed glad to see her, the one person she could always count on. That WAS Yugo Amaryl, second only to Hari Seldon in the development of psychohistory and first in his absolute round-the-clock devotion to it. Hari had had Dors and Raych, but psychohistory was Yugo\u0027s life; he had no wife and children. Yet whenever Wanda came into his presence, something within him recognized her as a child and he dimly felt-for just that moment-a sense of loss that seemed to be assuaged only by showing the child affection. To be sure, he tended to treat her as a rather undersized adult, but Wanda seemed to like that. \\n\\n It was six years ago that she had wandered into Yugo\u0027s office. Yugo looked up at her with his owlish reconstituted eyes and, as usual, took a moment or two to recognize her. \\n\\n Then he said, \"Why, it\u0027s my dear friend Wanda. -But why do you look so sad? Surely an attractive young woman like you should never feel sad.\" \\n\\n And Wanda, her lower lip trembling, said, \"Nobody loves me.\" \\n\\n \"Oh come, that\u0027s not true.\" \\n\\n \"They just love that new baby. They don\u0027t care about me anymore.\" \\n\\n \"I love you, Wanda.\" \\n\\n \"Well, you\u0027re the only one then, Uncle Yugo.\" And even though she could no longer crawl onto his lap as she had when she was younger, she cradled her head on his shoulder and wept. \\n\\n Amaryl, totally unaware of what he should do, could only hug the girl and say, \"Don\u0027t cry. Don\u0027t cry.\" And out of sheer sympathy and because he had so little in his own life to weep about, he found that tears were trickling down his own cheeks as well. \\n\\n And then he said with sudden energy, \"Wanda, would you like to see something pretty?\" \\n\\n \"What?\" sniffled Wanda. \\n\\n Amaryl knew only one thing in life and the Universe that was pretty. He said, \"Did you ever see the Prime Radiant?\" \\n\\n \"No. What is it?\" \\n\\n \"It\u0027s what your grandfather and I use to do our work. See? It\u0027s right here.\" \\n\\n He pointed to the black cube on his desk and Wanda looked at it woefully. \"That\u0027s not pretty,\" she said. \\n\\n \"Not now,\" agreed Amaryl. \"But watch when I turn it on.\" \\n\\n He did so. The room darkened and filled with dots of light and flashes of different colors. \"See? Now we can magnify it so all the dots become mathematical symbols.\" \\n\\n And so they did. There seemed a rush of material toward them and there, in the air, were signs of all sorts, letters, numbers, arrows, and shapes that Wanda had never seen before. \\n\\n \"Isn\u0027t it pretty?\" asked Amaryl. \\n\\n \"Yes, it is,\" said Wanda, staring carefully at the equations that (she didn\u0027t know) represented possible futures. \"I don\u0027t like that part, though. I think it\u0027s wrong.\" She pointed at a colorful equation to her left. \\n\\n \"Wrong? Why do you say it\u0027s wrong\" said Amaryl, frowning. \\n\\n \"Because it\u0027s not . pretty. I\u0027d do it a different way.\" \\n\\n Amaryl cleared his throat. \"Well, I\u0027ll try to fix it up.\" And he moved closer to the equation in question, staring at it in his owlish fashion. \\n\\n Wanda said, \"Thank you very much, Uncle Yugo, for showing me your pretty lights. Maybe someday I\u0027ll understand what they mean.\" \\n\\n \"That\u0027s all right,\" said Amaryl. \"I hope you feel better.\" \\n\\n \"A little, thanks,\" and, after flashing the briefest of smiles, she left the room. \\n\\n Amaryl stood there, feeling a trifle hurt. He didn\u0027t like having the Prime Radiant\u0027s product criticized-not even by a twelve-year-old girl who knew no better. \\n\\n And as he stood there, he had no idea whatsoever that the psychohistorical revolution had begun. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46821.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
