{"id":5021,"no":201,"title":"第二十一章","content":"　　见皇上并不困难。艾吉思迎接谢顿时，他的双眼闪烁着光芒。“嗨，老友，”他说，“你 来是要带给我坏运吗？” \\n\\n “我希望不是。”谢顿说。 \\n\\n 艾吉思疲倦地叹了口气，解开身上精致的披风，边丢向房间角落边说：“给我躺在那里！”他望向谢顿，摇了摇头。“我恨那玩意，它像原罪一样沉重、像地狱之火一样灼人。当我接受胡言乱语的疲劳轰炸，像座雕像笔直站着时，我总是得穿着这件该死的披风，简直可恶透顶。克里昂生来就有帝王风范，我却完全不是这块料。只因不幸生为他的三表弟，我就被拱出来当皇帝。我很乐意贱价出售这个皇位，你要不要啊，哈里？” “不，不，我想都没想过，您别抱太大希望。”说完谢顿哈哈大笑。“告诉我，今天跟你同来的这位小美人是谁？” 婉达面红耳赤，皇上则和蔼地说：“千万别脸红，亲爱的。皇上拥有的少数津贴之一，就是口无遮拦的权利。没有人能反对或提出异议，他们只能说‘是的，陛下’。但我不要听到你说‘陛下’，我痛恨这两个字。叫我艾吉思，虽然那也不是我真正的名字，但它是我的帝号，我不得不习惯它。所以……告诉我，哈里，近况如何？自我们上次见面后，你经历了些什么事？” \\n\\n 谢顿简单地说：“我受到两次攻击。” “两次？真的？”皇上似乎不确定这是不是一句玩笑话。 谢顿开始叙述遇袭经过，皇上的脸沉了下来。“我想，那八个人胁迫你的时候，附近没有任何保安官吧。” \\n\\n “一个也没有。” \\n\\n 皇上从座椅中站起，同时做了个手势，示意两人继续坐着。他来回踱步，仿佛试图驱除心中的怒气。最后他转身面对谢顿。“几千年来，”他开口道，“只要发生类似的事，人们都会说：‘我们直接告到皇上那儿 去！’或是‘皇上为何不做点什么？’最后皇上都会做些处置，尽管不是每项处置都很明智。 可是我……哈里，我没有权力，我什么也无法做。“哼，没错，是有个所谓的公共安全委员会，但他们关心我的安全程度似乎远胜于公共安全。今天我们能见面算是个奇迹，因为委员会可不喜欢你。 “我对一切都无能为力。你可知道，自从执政团垮台，皇室——哈！皇室复辟之后，皇帝的地位发生了什么变化？” “我想我知道。” \\n\\n “我敢打赌你不知道，至少不完全知道。现在我们有民主了，你晓得什么是民主吗？”“当然。” \\n\\n 艾吉思皱起眉头。他说：“我敢打赌你认为民主是件好事。” “我认为它可以是件好事。” “你错了，不是那么回事，它把整个帝国都颠覆了。 “假设我要增派更多保安官到川陀街头，在过去，我只要抽出一张御用秘书准备的公文纸，在上面随便签个名，街头便会出现更多的保安官。“现在我却不能这么办，我得把它送交立法院。我每次提出一项建议，七千五百位委员就会变成一大群咯咯乱叫的鹅群。首先要解决的问题便是，经费从哪来？比如说，多找一万名保安官，就得多付一万份薪水。此外，即使委员同意，新的保安官要由谁挑选？由谁管理？ “立法委员彼此叫嚣，争论，怒喝，而最后——一事无成。哈里，你提到穹顶灯光故障， 我甚至连修理灯泡这点小事都办不到。那要花费多少？由谁负责？喔，灯泡总会修好的，只不过会拖上几个月。这，就是民主。” 谢顿说：“我还记得，克里昂大帝也总是抱怨不能做自己想做的事。” “克里昂大帝，”艾吉思不耐烦地说，“拥有两位一流的首相——丹莫茨尔和你，你们两 人努力不使克里昂做傻事。而我有七千五百位首相，全都从头傻到尾。不过，哈里，你来不会只是向我抱怨受到攻击这种事吧。” \\n\\n “没错，我是为更糟的事来的，陛下——艾吉思，我需要信用点。”皇上瞪着他。“哈里，我讲了那么多，你还提出这种要求？我没有信用点——喔，当然， 我还有信用点维持现在的局面，但是为了得到这笔钱，我得面对七千五百位立法委员。如果你认为我能去找他们说，我要些信用点给我的朋友哈里·谢顿；如果你认为我能在两年内， 得到我所要的四分之一，那你就是疯了。不可能。” 皇上耸了耸肩，口气变得比较温和：“别误会，哈里，如果办得到，我一定会帮你，特别是看在你孙女的分上。看着她我就有一种感觉，仿佛你要多少信用点我都该给你，可是我实在办不到。” \\n\\n 谢顿说：“艾吉思，要是没有经费，心理史学就将功亏一篑——我们已经努力了近四十年。” \\n\\n “已经努力了近四十年，什么成果也没有，你何必再操心呢？”“艾吉思，”谢顿说，“现在我什么也做不了。心理史学家的身份使我受到袭击，人们将 我视为毁灭的预言者。” \\n\\n 皇上点了点头。“你就是厄运，乌鸦嘴谢顿，我早告诉过你。”“好吧，”谢顿怅然起身，“那么，我没别的话。” 琬达也起身站在谢顿旁边，定睛望着皇上，她的身高刚好到祖父的肩膀。 \\n\\n 谢顿正想转身离开，皇上突然说：“慢着——我记得有一首古诗是这么说的：‘时难年荒兮，大地萧条；朱门肉臭兮，路有饿殍。’” \\n\\n “那是什么意思？”谢顿沮丧地问。“它让我想到，帝国虽然在逐步衰落、分裂，但仍然有人越来越有钱。何不找那些富有的企业家试试呢？他们不用管什么立法委员，只要愿意，他们随手就能签一张信用点券给你。”谢顿望着皇上说：“我会试试看。” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46929.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
