{"id":5033,"no":213,"title":"第二十七章","content":"　　这是个可爱的一天，气温适中，天色怡人。纵使维修街道的预算在几年前便已告罄，帝国图书馆门前台阶旁的几棵木本植物，仍为这个早晨增添了几许愉悦的气氛。（帝国图书馆是一栋风格古典的建筑，入口阶梯的雄伟气势，在整个帝国中仅次于皇宫正门的阶梯。然而， 大多数前往图书馆的人，却喜欢经由滑轨进入。）对于这一天，谢顿抱着很高的期望。 \\n\\n 自从他与史铁亭·帕佛被控蓄意伤害的案件撤销后，谢顿觉得一切像是重新来过。虽然 那段日子并不好过，然而轰动一时的案件却为谢顿的主张做了最佳宣传。帖贞·帕普坚·李赫法官在川陀非常具有分量，在莱耳·纳瓦斯做出情绪化证词的次日，她发表了一份有力声 明。 \\n\\n “川陀现已来到‘文明社会’的十字路口，”法官在席位上慷慨陈词，“像哈里·谢顿教授这样德高望重的人，仅仅因为他的身份和主张，就得忍受自己同胞的羞辱、谩骂和谎言，这真是帝国历史上最黑暗的一天。我承认，最初，我自己也没有看清真相。我在心中推想：‘为了证明心理史学的预测，谢顿教授当然有可能使用这种诡计。’可是，在我恍然大悟之 后，我发觉自己错得不可饶恕。”说到这里，法官皱起眉头，颈部与双颊开始泛起暗青色，“因为我用我们‘新社会’的标准扭曲了谢顿教授的动机，在现今这个社会中，诚实、高尚 与善意很可能会招致杀身之祸；在这个社会中，一个人仅仅为了生存，似乎就必须诉诸欺诈与奸计。 \\n\\n “看看我们今日安身立命的原则已经偏差到什么地步？这次我们很幸运，川陀的同胞们， 我们都该深深感谢哈里·谢顿教授，他让我们看到了我们真正的自我。让我们把这事件谨记 在心，并且痛下决心，时时警戒潜藏在人性中的卑劣力量。” 那场听证会结束后，皇上送给谢顿一个表达祝贺的全息光盘。他在里面表达了自己衷心的祝福：希望谢顿现在能找到经费支持他的计划。谢顿沿着入口滑轨滑升，内心思量着心理史学计划目前的状况。他的好友——前任图书馆长拉斯·齐诺——如今已经退休，他在任内一向极支持谢顿与他的工作。只是大部分的时 候，他都受到图书馆评议会的束缚。但齐诺曾对谢顿保证，新任图书馆长垂玛·阿卡尼欧， 是个与他自己一样思想进步的人，而且跟评议会各个派别的关系都很好。“哈里，我的好友，”齐诺在返回故乡世界温柯瑞之前曾对谢顿说，“阿卡尼欧是个好人，有深厚的智能与开放的心胸。我确定，他会尽他所能来帮助你和你的计划。我将手边有关你和百科全书的数据文件留给了他，对于谢顿计划将为人类带来的贡献，我知道他会跟我一样兴奋。保重，我的好友，我不会忘记你的。”今天谢顿就将与新任馆长首度正式会晤。齐诺的保证令他精神振奋，他期待着与新馆长分享他对谢顿计划与百科全书的未来规划。 谢顿走进图书馆长办公室，垂玛·阿卡尼欧立刻起身迎接。由房间陈设的改变，可以看 出他已经正式入主了这间办公室。齐诺任职时，房间各角落塞满了全息光碟和来自川陀各区的三维期刊。而代表帝国各个世界的幻影星球，则在半空中不停旋转，令人眼花缭乱。现在， 阿卡尼欧已将整个房间清理干净。取而代之的是占了大半面墙的大型全息屏幕，谢顿推测那是阿卡尼欧用来观览出版品或广播视讯的。 阿卡尼欧身材矮小而结实，眼神显得有些心不在焉，那是幼时接受角膜矫正失败的结果。 这掩藏了他可畏的智能，以及对周遭一切动静的警觉。“稀客，稀客，谢顿教授。请坐，请坐。”阿卡尼欧指了指办公桌前的一张直背座椅， \\n\\n “您要求这次会面，真是让人意外，我原本打算一安顿好，就立刻跟您联络。” \\n\\n 谢顿点了点头，感到很髙兴。可见这位新馆长很重视自己，才刚上任、还忙得不可开交时，就打算要找自己谈了。 \\n\\n “可是，首先，教授，请让我知道您为何要见我。然后，我们再来讨论我那个可能较无趣的问题。” \\n\\n 谢顿清清喉咙，倾身向前说道：“馆长，拉斯·齐诺想必已把我在这里的工作，以及我筹划一套《银河百科全书》的构想告诉您了。拉斯相当热心，他想办法提供我一间个人研究室，以及随意使用图书馆庞大资源的权利。事实上，是他为百科全书计划找到了最终的归宿——一个叫做端点星的遥远外围世界。 “然而，有一件事拉斯一直争取不到。为了使计划如期执行，我的一批同事也同样需要研究室，以及自由使用图书馆设备的权利。在开始百科全书的实际编纂工作之前，光是搜集、 复制并转送端点星的资料，就是一项庞大的工程。“拉斯在图书馆评议会的人缘不好，这点您一定知道，但您就不同了。所以，馆长，我想请求您，看在心理史学计划的重要性上，能否设法让我的同事获得我刚说的那些权利？”谢顿一口气说到这里，差点喘不过来。这番话他昨晚在心中已反复演练多次，他确信能达到预期效果。现在，他满怀信心地等待阿卡尼欧的响应。“谢顿教授，”阿卡尼欧一开口，谢顿满怀期望的笑容顿时消失。新任馆长的声音中透着谢顿未曾料到的冷峻，我敬重的前任馆长曾非常详细对我说明你在馆内的工作性质。他对你的研究相当热衷，不断叮咛要让你的同事加入你的行列。至于我自己——”听到阿卡尼欧顿了顿，谢顿猛然抬起头来，“原先，我是准备找评议委员开一次特别会议，提议给你以及你的百科全书编者一间大型办公室。不过，谢顿教授，现在我改变心意了。”“改变心意！为什么？” \\n\\n “谢顿教授，最近有件轰动的蓄意伤害案，你是主要的被告——” “但我被无罪开释，”谢顿插嘴道，“这件案子甚至没有正式起诉。” “纵然如此，教授，你最近曝光率太高，名声也因此——我该怎么说呢——大幅跌落。呃，没错，你受到的指控全被撤销，可是为了无罪开释，你的名字、过去、信仰，以及你的工作，全都一览无遗地摊在各世界的眼前。即使一位思想进步而公正的法官宣称你人格无瑕， 可是上百万，甚至上百亿帝国普通公民看到的，并不是为了保存文明而奋战的心理史学先锋， 而是高喊伟大帝国即将面临洗劫与厄运的疯子。 “你和你从事的这项工作，正威胁着帝国的根本——我指的不是那个无边无际、庞大抽象的帝国，我指的是帝国的心脏与灵魂——人民。当你告诉他们帝国正在衰亡，你等于是在宣判他们的死刑。这一点，我亲爱的教授，不是每个人都能面对的。 \\n\\n “谢顿，不论你愿不愿意，你都已经成为一个嘲弄的对象，一个嘲讽的主题，众人的笑柄。” \\n\\n “对不起，图书馆长，但是多年来，在某些圈子里，我早就是个笑柄。”“没错，但那只是在某些圈子里。可是由于这次事件的轰动，你的恶名已流传到川陀以外的每个世界。所以，教授，如果帝国图书馆允许你使用研究室，就等于默认你的研究工作， 那么，这座图书馆也会成为所有世界的笑柄。因此，不论我个人多么相信你的理论和你的百科全书，身为川陀帝国图书馆的馆长，我必须先考虑图书馆的利益。“所以说，谢顿教授，我必须拒绝你引进其他同事的要求。” 谢顿仿佛被打了一拳，在座椅上猛地向后一仰。 “此外，”阿卡尼欧继续说，“我必须通知你，你在本馆的特权将被暂时取消两周，并且 立即生效。评议会已准备召开特别会议，决定是否终止与你的合作关系，教授，两周后我们会将结果通知你。” \\n\\n 说到这里，阿卡尼欧终于停下来。他将双手按在光洁无瑕的办公桌上，站了起来。“目前为止，就是这样了，谢顿教授。”谢顿也站了起来，不过起身的动作不像垂玛·阿卡尼欧那么利落、迅速。 “可否准许我向评议会陈情？”谢顿问道。“如果我能对他们解释心理史学和百科全书的重要性，说不定……” \\n\\n “只怕不行，教授。”阿卡尼欧柔声道。这时谢顿才隐约瞥见拉斯·齐诺口中的那个好 人，可是，也只有这么一瞬间。阿卡尼欧送谢顿到门口时，那位冰冷的官僚又回来了。当正门滑开时，阿卡尼欧说：“两个星期，谢顿教授，到时再见。”谢顿钻进等在外面的 贴地滑车，那组门便重新关上。现在我要怎么办？谢顿绝望地自问，我的工作就此结束了吗？ \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46941.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
