{"id":5040,"no":220,"title":"Chapter 31","content":"\"Do you mean to say I have been searching Trantor-wide for someone with your powers, Wanda, and he\u0027s been here with us for the past few months and we never knew it?\" Hari Seldon was incredulous. He had been dozing in the solarium when Wanda and Palver shook him awake to give him their amazing news. \\n\\n \"Yes, Grandpa. Think about it. I\u0027ve never had occasion to meet Stettin. Your time with him has primarily been away from the Project and I spend the majority of my time closeted in my office, working with the Prime Radiant. When would we have met? In fact, the one time our paths did cross, the results were most significant.\" \\n\\n \"When was that?\" asked Seldon, searching his memory. \\n\\n \"Your last hearing-before Judge Lih,\" Wanda replied immediately. \"Remember the eyewitness who swore that you and Stettin had attacked those three muggers? Remember how he broke down and told the truth -and even he didn\u0027t seem to know why. But Stettin and I have pieced it together. We were both pushing Rial Nevas to come clean. He had been very steadfast in his original claim; I doubt that either one of us would have been able to push him alone. But together\"-she stole a shy glance at Palver, who was standing off to the side-\"our power is awesome!\" \\n\\n Hari Seldon took all this in and then made as if to speak. But Wanda continued. \"In fact, we plan to spend the afternoon testing our mentalic abilities, separately and together. From the little we\u0027ve discovered so far, it seems as if Stettin\u0027s power is slightly lower than mine-perhaps a five on my rating scale. But his five, combined with my seven, gives us a twelve! Think of it, Grandpa. Awesome!\" \\n\\n \"Don\u0027t you see, Professor?\" Palver spoke up. \"Wanda and I are that breakthrough you\u0027re looking for. We can help you convince the worlds of the validity of psychohistory, we can help find others like us, we can help put psychohistory back on track.\" \\n\\n Hari Seldon gazed up at the two young people standing in front of him. Their faces were aglow with youth and vigor and enthusiasm and he realized it did his old heart good. Perhaps all was not lost, after all. He had not thought he would survive this latest tragedy, the death of his son and the disappearance of his son\u0027s wife and child, but now he could see that Raych lived on in Wanda. And in Wanda and Stettin, he now knew, lived the future of the Foundation. \\n\\n \"Yes, yes,\" agreed Seldon nodding forcefully. \"Come you two, help me up. I must get back to my office to plan our next step.\" \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46948.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
