{"id":4826,"no":6,"title":"Chapter 3","content":"She wasn\u0027t. \n Dors was waiting for him at the door of their apartment in an easy stance, hand on one hip, looking very much as she had when he had first met her at this very University eight years before: slim, shapely, with curly reddish-gold hair-very beautiful in his eyes but not very beautiful in any objective sense, though he had never been able to assess her objectively after the first few days of their friendship. \n Dors Venabili! That\u0027s what he thought when he saw her calm face. There were many worlds, even many sectors on Trantor where it would have been common to call her Dors Seldon, but that, he always thought, would put the mark of ownership on her and he did not wish it, even though the custom was sanctioned by existence back into the vague mists of the pre-Imperial past. \n Dors said, softly and with a sad shake of her head that barely disturbed her loose curls, \"I\u0027ve heard, Hari. Just what am I going to do with you?\" \n \"A kiss would not be amiss.\" \n \"Well, perhaps, but only after we probe this a little. Come in.\" The door closed behind them. \"You know, dear, I have my course and my research. I\u0027m still doing that dreadful history of the Kingdom of Trantor, which you tell me is essential to your own work. Shall I drop it all and take to wandering around with you, protecting you? It\u0027s still my job, you know. It\u0027s more than ever my job, now that you\u0027re making progress with psychohistory.\" \n \"Making progress? I wish I were. But you needn\u0027t protect me.\" \n \"Needn\u0027t I? I sent Raych out looking for you. After all, you were late and I was concerned. You usually tell me when you\u0027re going to be late. I\u0027m sorry if that makes me sound as though I\u0027m your keeper, Hari, but I am your keeper.\" \n \"Does it occur to you, Keeper Dors, that every once in a while I like to slip my leash?\" \n \"And if something happens to you, what do I tell Demerzel?\" \n \"Am I too late for dinner? Have we clicked for kitchen service?\" \n \"No. I was waiting for you. And as long as you\u0027re here, you click it. You\u0027re a great deal pickier than I am when it comes to food. And don\u0027t change the subject.\" \n \"Didn\u0027t Raych tell you that I was all right? So what\u0027s there to talk about?\" \n \"When he found you, you were in control of the situation and he got back here first, but not by much. I didn\u0027t hear any details. Tell me-What-were-you-doing?\" \n Seldon shrugged. \"There was an illegal gathering, Dors, and I broke it up. The University could have gotten a good deal of trouble it didn\u0027t need if I hadn\u0027t.\" \n \"And it was up to you to prevent it? Hari. you\u0027re not a Twister anymore. You\u0027re an-\" \n He put in hastily, \"An old man?\" \n \"For a Twister, yes. You\u0027re forty. How do you feel?\" \n \"Well- A little stiff.\" \n \"I can well imagine. And one of these days, when you try to pretend you\u0027re a young Heliconian athlete, you\u0027ll break a rib. -Now tell me about it.\" \n \"Well, I told you how Amaryl warned me that Demerzel was in trouble because of the demagoguery of Jo-Jo Joranum.\" \n \"Jo-Jo. Yes, I know that much. What don\u0027t I know? What happened today?\" \n \"There was a rally at the Field. A Jo-Jo partisan named Namarti was addressing the crowd-\" \n \"Namarti is Gambol Deen Namarti, Joranum\u0027s right-hand man.\" \n \"Well, you know more about it than I do. In any case, he was addressing a large crowd and he had no permit and I think he was hoping there would be some sort of riot. They feed on these disorders and if he could close down the University even temporarily, he would charge Demerzel with the destruction of academic freedom. I gather they blame him for everything. So I stopped them. -Sent them off without a riot.\" \n \"You sound proud.\" \n \"Why not? Not bad for a man of forty.\" \n \"Is that why you did it? To test your status at forty?\" \n Seldon thoughtfully clicked the dinner menu. Then he said, \"No. I really was concerned that the University would get into needless trouble. And I was concerned about Demerzel. I\u0027m afraid that Yugo\u0027s tales of danger had impressed me more than I realized. That was stupid, Dors, because I know that Demerzel can take care of himself. I couldn\u0027t explain that to Yugo or to anyone but you.\" \n He drew in a deep breath. \"It\u0027s amazing what a pleasure it is that I can at least talk to you about it. You know and I know and Demerzel knows and no one else knows-at least, that I know of-that Demerzel is untouchable.\" \n Dors touched a contact on a recessed wall panel and the dining section of their living quarters lit up with a soft peach-colored glow. Together, she and Hari walked to the table, which was already set with linen, crystal, and utensils. As they sat, the dinner began to arrive-there was never any long delay at this time of evening-and Seldon accepted it quite casually. He had long since grown accustomed to the social position that made it unnecessary for them to patronize the faculty dinners. \n Seldon savored the seasonings they had learned to enjoy during their stay at Mycogen-the only thing about that strange, male-dominated, religion-permeated, living-in-the-past sector they had not detested. \n Dors said softly, \"How do you mean, `untouchable\u0027?\" \n \"Come, dear, he can alter emotions. You haven\u0027t forgotten that. If Joranum really became dangerous, he could be\"-he made a vague gesture with his hands- `altered: made to change his mind.\" \n Dors looked uncomfortable and the meal proceeded in an unusual silence. It wasn\u0027t until it was over and the remains-dishes, cutlery, and all-swirled down the disposal chute in the center of the table (which then smoothly covered itself over) that she said, \"I\u0027m not sure I want to talk about this, Hari, but I can\u0027t let you be fooled by your own innocence.\" \n \"Innocence?\" He frowned. \n \"Yes. We\u0027ve never talked about this. I never thought it would come up, but Demerzel has shortcomings. He is not untouchable, he may be harmed, and Joranum is indeed a danger to him.\" \n \"Are you serious?\" \n \"Of course I am. You don\u0027t understand robots-certainly not one as complex as Demerzel. And I do.\" \n \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46512.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
