{"id":4882,"no":62,"title":"Chapter 6","content":"The weather was holding up over the undomed area of the Imperial Palace grounds-warm and sunny. It didn\u0027t often happen. Hari remembered Dors telling him once how this particular area with its cold winters and frequent rains had been chosen as the site. \"It wasn\u0027t actually chosen, \" she said. \"It was a family estate of the Morovian family in the early days of the Kingdom of Trantor. When the Kingdom became an Empire, there were numerous sites where the Emperor could live-summer resorts, winter places, sports lodges, beach properties. And, as the planet was slowly domed, one reigning Emperor, living here, liked it so much that it remained undomed. And, just because it was the only area left undomed, it became special-a place apart-and that uniqueness appealed to the next Emperor . and the next . and the next. . And so, a tradition was born.\" And as always, when hearing something like that, Seldon would think: And how would psychohistory handle this? Would it predict that one area would remain undomed but be absolutely unable to say which area? Could it go even so far? Could it predict that several areas would remain undomed or none-and be wrong? How could it account for the personal likes and dislikes of an Emperor who happened to be on the throne at the crucial time and who made a decision in a moment of whimsy and nothing more. That way lay chaos-and madness. Cleon I was clearly enjoying the good weather. \"I\u0027m getting old, Seldon,\" he said. \"I don\u0027t have to tell you that. We\u0027re the same age, you and I. Surely it\u0027s a sign of age when I don\u0027t have the impulse to play tennis or go fishing, even though they\u0027ve newly restocked the lake, but am willing to walk gently over the pathways.\" He was eating nuts as he spoke, which resembled what on Seldon\u0027s native world of Helicon would have been called pumpkin seeds, but which were larger and a little less delicate in taste. Cleon cracked them gently between his teeth, peeled the thin shells and popped the kernels into his mouth. Seldon did not like the taste particularly but, of course, when he was offered some by the Emperor, he accepted them and ate a few. The Emperor had a number of shells in his hand and looked vaguely around for a receptacle of some sort that he could use for disposal. He saw none, but he did notice a gardener standing not far away, his body at attention (as it should be in the Imperial presence) and his head respectfully bowed. Cleon said, \"Gardener!\" The gardener approached quickly. \"Sire!\" \"Get rid of these for me,\" he said, tapping the shells into the gardener\u0027s hand. \"Yes, Sire.\" Seldon said, \"I have a few, too, Gruber.\" Gruber held out his hand and said, almost shyly, \"Yes, First Minister.\" He hurried away and the Emperor looked after him curiously. \"Do you know the fellow, Seldon?\" \"Yes, indeed, Sire. An old friend.\" \"The gardener is an old friend? What is he? A mathematical colleague fallen on hard times?\" \"No, Sire. Perhaps you remember the story. It was the time when\"-he cleared his throat, searching for the most tactful way to recall the incident-\"the sergeant threatened my life shortly after I was appointed to my present post through your kindness.\" \"The assassination attempt.\" Cleon looked up to heaven, as though seeking patience. \"I don\u0027t know why everyone is so afraid of that word.\" \"Perhaps,\" said Seldon smoothly, slightly despising himself for the ease with which he had become able to flatter, \"the rest of us are more perturbed at the possibility of something untoward happening to our Emperor than you yourself are.\" Cleon smiled ironically. \"I dare say. And what has this to do with Gruber? Is that his name?\" \"Yes, Sire. Mandell Gruber. I\u0027m sure you will recall, if you cast your mind back, that there was a gardener who came rushing up with a rake to defend me against the armed sergeant.\" \"Ah yes. Was that fellow the gardener who did that?\" \"He was the man, Sire. I\u0027ve considered him a friend ever since and I meet him almost every time I am on the grounds. I think he watches for me, feels proprietary toward me. And, of course, I feel kindly toward him.\" \"I don\u0027t blame you. -And while we\u0027re on the subject, how is your formidable lady, Dr. Venabili? I don\u0027t see her often.\" \"She\u0027s a historian, Sire. Lost in the past.\" \"She doesn\u0027t frighten you? She\u0027d frighten me. I\u0027ve been told how she treated that sergeant. One could almost be sorry for him.\" \"She grows savage on my behalf, Sire, but has not had occasion to do so lately. It\u0027s been very quiet.\" The Emperor looked after the disappearing gardener. \"Have we ever rewarded that man?\" \"I have done so, Sire. He has a wife and two daughters and I have arranged that each daughter will have a sum of money put aside for the education of any children she may have.\" \"Very good. But he needs a promotion, I think. -Is he a good gardener?\" \"Excellent, Sire.\" \"The Chief Gardener, Malcomber-I\u0027m not quite sure I remember his name-is getting on and is, perhaps, not up to the job anymore. He is well into his late seventies. Do you think this Gruber might be able to take over?\" \"I\u0027m certain he can, Sire, but he likes his present job. It keeps him out in the open in all kinds of weather.\" \"A peculiar recommendation for a job. I\u0027m sure he can get used to administration and I do need someone for some sort of renewal of the grounds. Hmmm. I must think upon this. Your friend Gruber may be just the man I need. -By the way, Seldon, what did you mean by saying it\u0027s been very quiet?\" \"I merely meant, Sire, that there has been no sign of discord at the Imperial Court. The unavoidable tendency to intrigue seems to be as near a minimum as it is ever likely to get.\" \"You wouldn\u0027t say that if you were Emperor, Seldon, and had to contend with all these officials and their complaints. How can you tell me things are quiet when reports seem to reach me every other week of some serious breakdown here and there on Trantor?\" \"These things are bound to happen.\" \"I don\u0027t recall such things happening so frequently in previous years.\" \"Perhaps that was because they didn\u0027t, Sire. The infrastructure grows older with time. To make the necessary repairs properly would take time, labor, and enormous expense. This is not a time when a rise in taxes will be looked on favorably.\" \"There\u0027s never any such time. I gather that the people are experiencing serious dissatisfaction over these breakdowns. It must stop and you must see to it, Seldon. What does psychohistory say?\" \"It says what common sense says, that everything is growing older.\" \"Well, all this is quite spoiling the pleasant day for me. I leave it in your hands, Seldon.\" \"Yes, Sire,\" said Seldon quietly. The Emperor strode off and Seldon thought that it was all spoiling the pleasant day for him, too. This breakdown at the center was the alternative he didn\u0027t want. But how was he to prevent it and switch the crisis to the Periphery? Psychohistory didn\u0027t say.","sourceLink":"http://novel.tingroom.com/kehuan/1569/46643.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
