{"id":4909,"no":89,"title":"第十九章","content":"　　谢顿这一天很不好过。芮奇发了一封电汛之后便毫无音讯，他完全不清楚发生了什么事。 除了对芮奇的安危自然而然的关切（若发生什么不幸，他一定会听到消息），令他坐立不安的还有潜存的阴谋。 \n 对方的阴谋一定十分狡猾，直接攻击皇宫是绝不可能的，那里的安全防范极为严密。但除此之外，还有更具破坏性的方法吗？ 整件事使他夜里辗转难眠，白天则心神不宁。讯号灯闪了一下。 \n “首相，您两点钟的约会……”“是要见谁？” \n “曼德尔·葛鲁柏，那名园丁，他有求见证明。” 谢顿记起来了。“好，让他进来。”现在不是见葛鲁柏的时候，但当时葛鲁柏似乎心乱如麻，他一时心软便答应见他。首相不该有心软的时候，但谢顿早在当上首相前便已是谢顿。 “进来，葛鲁柏。”他和颜悦色地说。 葛鲁柏站在他面前，机械性地点着头，两眼忍不住东张西望。谢顿相当确定，这名园丁从未置身过如此富丽堂皇的房间。他突然有股恶毒的冲动，想说：你喜欢吗？请拿去吧，我根本不想要。 \n 但他只是说：“什么事，葛鲁柏？你为何这么沮丧？”葛鲁柏并未立即回答，只恍惚地笑了一下。 “坐吧，老兄，就坐那张椅子。”谢顿说。 “噢，不，首相。那可不合适，我会把它弄脏。”“没关系的，这椅子没这么难清理，你就照我的话做。先坐一会儿，整理整理思绪。等你准备好了，再告诉我是怎么回事。” 葛鲁柏静静坐了一会儿，然后突然喘着气说：“首相，我就要当园丁长了，皇上亲自告诉我的。” \n “嗯，我听说了，但你不是在烦恼这件事吧？你升官是件值得恭喜的事，我还没恭喜你呢。这事的功劳说不定我也能算一份，葛鲁柏。我从来没忘记当年我险些遇害时，你英勇的表现我也对皇帝陛下提过。这次晋升是个适当的奖赏，葛鲁柏，而且你当之无愧，因为你的记录明白显示你绝对胜任。好，既然这点说清楚了，现在告诉我是什么事让你这么烦恼吧。” “首相，我烦恼的正是这次晋升。这工作我应付不来，我根本无法胜任。” “我们相信你能胜任。” \n 葛鲁柏变得焦躁不安。我是不是得坐在办公室里？我不能坐在办公室里，那样我就不能走到露天的空气中，不能在植物和动物的陪伴下工作。那简直就像要我坐牢，首相。”谢顿睁大眼睛。“没这回事，葛鲁柏，你不需要成天待在办公室里。你随时可以到户外走动，亲自在御苑里巡视监督，还不用整日辛苦工作。” “我就是要做辛苦的工作，首相。他们根本不会让我走出办公室，我观察过现任的园丁长，他就离不开办公室，虽然他也想，想得不得了，但有太多的行政工作，太多的簿记资料要他处理。当然啦，如果他想知道发生了什么事，我们得去他的办公室向他报告。他从全息电视上观看外界——”他以极度轻蔑的口吻说：“好像从画面中能看出动植物生长的一切。我可不要这样，首相。” \n “好了，葛鲁柏，像个男子汉。事情没有那么糟，你会习惯的，你会慢慢克服的。” 葛鲁柏摇了摇头。“头一件事我就得面对所有的新园丁，我会吃不消的。”接着他突然一 鼓作气说道：“我不想要也绝不能要这份工作，首相。” “呃，葛鲁柏，你说你不想要这份工作，但有这种想法的并不只你一个人。我可以告诉你，我也希望我现在不是首相，这份工作超出我的能力范围。我甚至有种想法，有些时候连皇上自己也想脱下身上的皇袍。在这银河中，每个人都有自己的工作，而工作不会总是愉快的。” \n “这点我懂，首相。可是皇上必须当皇上，因为他生来注定当皇上。而您必须当首相，因为再也没有别人能胜任这份工作。可是我的情形不同，我们讨论的只是当个园丁长。御苑里有五十名园丁，他们都能做得跟我一样好，却不在乎关在办公室里。您说您曾经告诉皇上我如何试图救您。您就不能再跟他解释一下，如果他要为那件事奖赏我，大可让我继续当个园丁？” \n 谢顿靠回椅背，严肃地说：“葛鲁柏，假使我有办法，我会这么做。但我希望你能了解一件事，理论上，皇上是帝国的绝对统治者，但实际上，他能做的事非常少；我治理帝国事务的程度远超过他，而我能做的也非常有限。政府各阶层中有百千万亿的人，大家都在做决定，都在犯错误，有些行事睿智、光明磊落，有些行事愚蠢、偷偷摸摸，根本没法控制。你懂我的意思吗，葛鲁柏？” \n “我懂，但这跟我有什么关系？” “因为只有在一个地方，皇上才是真正的绝对统治者，那就是皇宫御苑。在这里，他的话就是法律，而且底下的官员层级少，他足以应付得来。既然他已对御苑中的事做出决定，若请求他撤回，就等于侵犯他唯一的堡垒。假使我对他说：‘皇上，请收回您对葛鲁柏的决定。’他非但不会接受，甚至很可能解除我的职务。那对我而言未必不是好事，但对你毫无帮助。” \n 葛鲁柏说：“你的意思是说，不可能改变了？” “是的。不过别担心，葛鲁柏，我会尽全力帮你。我很抱歉，我时间不多，没法再跟你多谈了。” \n 葛鲁柏站了起来，双手扭着他那顶绿色园丁帽，泪水差点就要掉下来。“谢谢您，首相。 我知道您很想帮我，您——您是个大好人，首相。” 他转身离去，一副悲伤不已的样子。 \n 谢顿若有所思地望着他的背影，摇了摇头。将葛鲁柏的悲伤乘上万兆倍，便等于帝国中二千五百万个世界上所有人民的悲伤。而他，谢顿，连对一个向他求助的人都爱莫能助，又怎能救万兆人脱离苦海？ \n ——心理史学救不了一个人，能拯救万兆人吗？ 他摇了摇头，开始查阅下个约会的性质与时间，却突然愣住。接着一反平日严谨的言行， 对着通话线大吼道：“把那园丁找回来！马上找回来！” \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46704.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
