{"id":4915,"no":95,"title":"第二十二章","content":"　　芮奇不难看出自己受到特别照顾。现在，整组园丁候选者都住在皇区一家旅馆内，不过， 当然不是什么一流旅馆。 \\n\\n 这群园丁是个古怪的组合，分别来自五十个不同的世界。芮奇很少有机会与其他人说话， 因为安多闰一直很技巧地将他与其他人隔开。芮奇十分纳闷，也很沮丧。事实上，自从离开卫荷，他就一直有些沮丧。这干扰了他的思绪，他虽然力图振作，却不成功。安多闰穿着一套粗布衣，试图打扮得像个工人。在他导演的这出“戏”中，他将扮演一个园丁的角色。 \\n\\n 芮奇感到惭愧，因为他始终没能摸清这出“戏”的脚本。他们一直严密监视他，他没法做任何形式的通讯，甚至没机会警告父亲。据他所知，同行的每个川陀人可能都受到这样的监控，这只是非常的防范措施。芮奇估计这群园丁中可能有十二个川陀人，男女都有，而且毫无疑问都是纳马提的手下。 令芮奇不解的是，安多闰对待他的态度可谓关爱备至。他一个人霸占了自己所有的时间， 坚持要跟自己共进每一餐。换句话说，他对待自己的方式与其他人完全不同。会不会是因为他们曾经共享玛妮拉？芮奇对卫荷区的风俗知道得不多，无法判断他们是否有一妻多夫的倾向。假如两个男人共享一个女人，是否会使他们产生某种兄弟之情？这会形成一种情谊吗？ \\n\\n 芮奇从未听过这种事，但他至少明白，在银河各个社会，甚至川陀各个社会中，存在着无数不可思议的习俗，他知道自己了解的不多。 他的心思一回到玛妮拉身上，便不禁思念起她来。他非常想念玛妮拉，芮奇突然想到，这可能就是使他沮丧的主因。但现在，与安多闰共进的午餐即将结束，他的感觉却近乎绝望， 他不知道是为什么。 \\n\\n 玛妮拉！ \\n\\n 她曾说她想造访皇区，安多闰说不定会被她的甜言蜜语说动。绝望的情绪越来越浓，芮奇脱口问了一个蠢问题：安多闰先生，我一直在想，不知道你有没有带杜邦夸小姐同行。我是说到皇区这里。” \\n\\n 安多闰看来大吃一惊，然后轻声笑了笑。“玛妮拉？你看她种过花吗？还是你以为她会？ 不，不，玛妮拉那种女人生来是给男人解闷的。除此之外，她没有任何功用。”接着他又说： “你问这做什么，普朗什？” \\n\\n 芮奇耸了耸肩。“我不知道。这里有点无聊，我有点儿想……”他的声音逐渐消失。 安多闰审视着他，最后终于开口：“不用说，你不会在意是哪个女人陪你吧？我向你保证，玛妮拉可不在意是哪个男人陪她。这件事一旦办完，你自然会有别的女人，很多的女人。”“这件事什么时候能办完？” “快了，而你将扮演一个重要的角色。”安多闰仔细盯着芮奇。“有多重要？我不是只要当个——园丁吗？”芮奇的声音空洞无力，而他发觉自己一点也提不起劲。 \\n\\n “你要做的不只这样，普朗什，你要带一柄手铳进去。” “带什么？” \\n\\n “一柄手铳。” \\n\\n “我从来没拿过手铳，这辈子从没碰过。” “没什么大不了的。你举起来，瞄准，按一下开关，然后某人就死了。”“我不能杀人。” \\n\\n “我以为你是我们的一分子，愿意为政治信仰做任何事。”“我不是指……杀人。”芮奇似乎很难集中思绪。为何要他杀人？他们真正的目的是什么？而在他被迫杀人之前，要如何才能及时警告禁卫军……安多闰的脸孔突然绷紧，友善的关怀瞬间转变成断然的坚决。他说：“你必须杀人。”芮奇使尽全力说：“不，我啥人也不杀，没啥好讲的。” 安多闰说：“普朗什，你会照着我们的话去做。”“不包括谋杀。” \\n\\n “当然包括谋杀。” \\n\\n “你要怎样让我做到？” \\n\\n “我只要叫你做就行。” \\n\\n 芮奇觉得一阵昏眩。安多闰为何如此自信？ \\n\\n 他摇了摇头。“不。” \\n\\n 安多闰说：“我们一直在喂你，普朗什。离开卫荷后，我坚持和你一起进餐，监督你的饮食——尤其是刚刚那一顿。”一阵恐惧感瞬间贯穿芮奇全身，他突然明白了。“是‘丧气’！” “完全正确。”安多闰说，“你是个精明的小鬼，普朗什。” “那是非法的。” \\n\\n “是的，当然，谋杀也是。” 芮奇知道“丧气”是什么。它原来是一种完全无害的镇静剂，然而经过改造后，它产生的就不再是镇静作用，而是绝望的感觉。由于它能用来控制心灵，因此早已列为法定禁药，不过一直有谣言传说禁卫军在使用这种药物。安多闰仿佛看穿芮奇的心思。“它叫做‘丧气’，因为那是代表‘绝望’的古老词汇，我 想你现在就有这种感觉。” \\n\\n “才没有。”芮奇细声道。 \\n\\n “嗯，非常坚决，但你无法和化学药剂对抗。你越感到绝望，药效就越强。”“休想。” \\n\\n “想想看吧，普朗什。虽然你剃掉了八字胡，纳马提还是一眼就认出你来，他知道你是芮奇·谢顿。而在我的指示下，你将杀掉你的父亲。” 芮奇喃喃道：“我先杀了你。”芮奇说着站起身来。解决对方应该毫无问题，安多闰或许比较髙，但身材细瘦，而且动作显然并不灵活。芮奇单手就能将他撕成两半——但他起身时却摇摇晃晃站不稳脚。他甩了甩头，却无法清醒。 \\n\\n 安多闰也站起来，向后退了几步，右手从左手袖口中抽出一柄武器。他得意地说：“我可是有备而来。我早就有情报，知道你有赫利肯角力士的功夫，我不会跟你徒手搏斗。” \\n\\n 他看了一眼手中的武器。这不是手铳，”他说，在你完成任务之前，我可不敢杀掉你。这是神经鞭，就某方面而言，它远比手铳可怕。我要瞄准你的左肩，相信我，那种锥心刺骨的疼痛，世界上最伟大的苦行僧也无法忍受。” \\n\\n 原本缓慢凶狠地向前进逼的芮奇，此时突然停下脚步。他十二岁时曾经尝过神经鞭的滋味。虽然那次只是受到轻轻—击，但只要受过一击，不论活到多大年纪，不论人生经历多丰富，没有人忘得了那种痛楚。 安多闰说：“非但如此，我还会使用最大强度，让你的上臂神经受到无法忍受的痛苦，你的左手将从此动弹不得。我会放过你的右臂，好让你使用手铳。现在，如果你坐下来，乖乖认输——这也是你唯一的选择——你就能保住两只手臂。当然，你必须继续服药，好让你的沮丧程度增加。你的情况只会越来越糟。”芮奇觉得药物导致的绝望深入骨髓，而绝望本身又加深了药物的作用。眼前的一切变得涣散，他说不出一句话。 \\n\\n 芮奇只知道，自己从此必须听从安多闰的每一句话。在这场游戏中，他已彻底惨败。 \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1569/46710.html","bookId":169,"book":{"id":169,"title":"基地系列 Forward the Foundation 迈向基地","description":"简介： 《迈向基地》（Forward the Foundation），是美国科幻作家艾萨克阿西莫夫出版于1993年的科幻小说短篇集，基地系列的第七部作品，归于基地前传，阿西莫夫继续以心理史学宗师兼基地之父哈里谢顿为主角的长篇小说。...","cover":"http://novel.tingroom.com/file/upload/201605/30/10-50-01-69-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1569","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
