{"id":88607,"no":32,"title":"Page 32","content":"Tarullo looked at him warily, raising his eyebrows. “I hear your Carmine is friends with my Remy.”\\n\\n “Ah, but that doesn’t mean they’re bad kids,” Vincent said. “Maybe just a little misguided. I was the same way, and you wouldn’t call me bad, would you?”\\n\\n “No,” he said at once, but Vincent could see the truth in the man’s eyes. Yes, yes, an unadulterated hell yes.\\n\\n Vincent let out a laugh as he walked away.\\n\\n Carmine sipped his drink, lounging in the white wicker chair as he listened to his friends and family chatter on. He relaxed, almost enjoying himself for once, until a gruff throat cleared right behind him.\\n\\n He stiffened at the sound.\\n\\n “This is for you two,” Corrado said as he reached across the table, holding a box wrapped in shiny green paper. Carmine turned to face his uncle, who looked exhausted but otherwise fine. “I apologize I missed the ceremony, but I had unexpected business.”\\n\\n “Thanks, Unk,” Dominic said as he took the gift. “It’s understandable.”\\n\\n Corrado walked away without even looking at Carmine. Carmine watched as he approached Celia, motioning for her to follow him. Corrado’s eyes darted around nervously and Carmine’s heart pounded rapidly when Dominic’s voice rang out. “Twinkle Toes.”\\n\\n Carmine turned to him so quickly he nearly knocked over a glass of champagne, wondering why he had said that name, and saw he had pulled the card from the top of the gift.\\n\\n “Read it to us,” Tess demanded.\\n\\n Dominic sighed. “Dom and Tess, I wish I could give you this in person, but I’m tied up with things here. I bet Tess looked beautiful in her dress. Maybe someday I’ll get to see pictures of it.” He paused, glancing at Tess. “She’s right, babe. You’re always beautiful but especially today.”\\n\\n Smiling, Tess waved for him to continue.\\n\\n “It’s hard to believe it’s been so long since we’ve talked. I’m doing okay and have been busy, but I won’t bore you with details. Please tell everyone hello for me the next time you talk to them, and tell them I miss them. I hope college is going well for all of you.”\\n\\n He looked up. “Twinkle Toes says hi and said she misses you motherfuckers. She hopes you aren’t fucking up in school.”\\n\\n Carmine cracked a smile as his brother glanced back at the note. “I don’t know what you’re supposed to give for weddings. Someone told me people register at stores for household things, but I didn’t think Tess would want a blender. So I got something both of you can enjoy. I’d suggest opening it in private, but I don’t think she’ll be embarrassed either way.”\\n\\n Tess snatched the box from Dominic, tearing the paper off and opening it. She glanced inside, shifting some tissue paper around, and laughed. “I knew it.”\\n\\n “Holy shit, Twinkle Toes is kinky!” Dominic reached for the box and pulled out some lingerie, drawing attention as he waved it around. Tess grabbed it, her cheeks tinged red as more people looked, and threw it back in the box.\\n\\n “You’re such a douchebag sometimes,” she said, storming away. Dia smiled and excused herself, following her sister.\\n\\n “Looks like she was wrong,” Dominic said. “Tess was embarrassed.”\\n\\n “Didn’t realize it was possible,” Carmine said.\\n\\n “Me, either. I’d send her a thank-you note for that, but she didn’t say where she was living.”\\n\\n She didn’t, Carmine realized. No indication at all of where she was.\\n\\n Dominic got up to go after his wife and Carmine sat there for a moment, finishing his drink alone as reality crept back in, ruining his brief moment of contentment. He left the wedding hall, not bothering to say good-bye to anyone, and took the long way home. He strolled down the street to his house, slowing as he spotted his father sitting on the bottom step. His brow furrowed as he drew near, seeing the lit cigarette between his fingers. “When the fuck did you start smoking?”\\n\\n Vincent shrugged, flicking his ashes on the concrete. “When did you?” he countered, pointing at some old cigarette butts littering the yard.\\n\\n “They’re not mine,” he replied. “Most of them, anyway. Remy smokes.”\\n\\n “Ah.” Vincent pulled out a pack of cigarettes and handed one to Carmine along with a lighter.\\n\\n He lit it, taking a drag as he stared at his father. “It’s kinda fucked up to be smoking with you, a doctor.”\\n\\n “I’m not a doctor anymore.” He let out a bitter laugh. “Can’t have a suspected member of La Cosa Nostra wielding scalpels.”\\n\\n Carmine felt guilty for bringing it up. “Sorry.”\\n\\n Vincent raised his eyebrows. “Did you just apologize to me?”\\n\\n “Maybe.”\\n\\n Vincent smiled. “Yeah, I’m sorry, too. It doesn’t really matter, though—not anymore. It is what it is.”\\n\\n “Can you get reinstated after the trial? Go back to practicing medicine?”\\n\\n He cut his eyes at Carmine incredulously, not bothering to entertain the question. “I actually started smoking after your mother died. I drank, too. A lot. That’s the biggest reason I couldn’t face you kids for almost a year. I know you blamed yourself, and it was difficult to see you, but I didn’t want you to see me, either.”\\n\\n “What changed?” Carmine asked curiously. It was something he had always wanted to know, but a question he had been too damn self-absorbed to ask. “What made you pull yourself together?”\\n\\n Vincent took a long drag. “I tried to murder Haven.”\\n\\n That response made Carmine choke on a puff of smoke. “What?”\\n\\n “The night I killed the Antonellis, I tried to kill her, too. My gun jammed and she slept right through it. But I realized that night your mother would have been disgusted. I wasn’t doing her memory any justice. So I pulled myself together before anyone else got hurt.”\\n\\n Carmine tossed his cigarette on the ground and stomped it out. He wasn’t sure whether it was the smoke or his father’s admission, but his chest suddenly ached. Reaching into his pocket, he pulled out the flask and took a drink, trying to dull the pain. Vincent watched him curiously so he held it out to him, offering his father some. He hesitated but threw his cigarette down and took it. He grimaced from the hot liquid, but it didn’t stop him from taking a second swig.\\n\\n “I’ve failed you a lot, withheld when I should’ve been honest, and it’s to the point where all I have left to give is the truth,” Vincent said quietly. He looked like a broken man, utterly defeated. “I remember the face of every person I’ve killed. I see them everywhere I go, and I know they aren’t there, but the memory of what they looked like in their final moment lingers. The fear, the anger, the heartbreak—it follows me everywhere. I remember the way your mother looked, too. The way she looked when I saw her that night in the alley.”\\n\\n “So do I,” Carmine said. “I remember the sound of her screams.”\\n\\n Vincent looked at Carmine curiously, apprehension in his eyes. He had never talked to him about that night, the memory too painful to verbalize. The only person he had told was Haven, but standing there with his father and taking in his broken expression, it felt necessary.\\n\\n Sighing, Carmine closed his eyes as he sat beside him on the step, running his hand through his hair nervously as he recalled detail by detail what happened that fateful night. From the moment they stepped out of the piano recital to waking up in the hospital, every ounce of pain came out through his words.\\n\\n “I can’t remember what they looked like, though,” Carmine said. “I’ve tried to imagine the killers hundreds of times, but it’s a blur. The man with the gun, I don’t think he ever looked at me, and the other, his face is always fucking distorted.”\\n\\n “Did they say anything?”\\n\\n “Shut her up! Do it quick! That’s it.”\\n\\n Vincent sat quietly and took it all in, his head bowed. “You almost bled to death. I was so angry at her that night, and the whole time she was dead and you were lying behind a Dumpster.”\\n\\n “It wasn’t your fault,” Carmine said. “The only people to blame are the motherfuckers with the guns in the alley that night.”\\n\\n Vincent cleared his throat. “I suppose you’re right. I sometimes wonder if I could’ve stopped it, though.”\\n\\n “Yeah, well, Mom would tell you that’s fucking bullshit,” Carmine said, earning an amused look from his father. “Well, not in those words, but you know what I mean. Like you said a bit ago, it is what it is. I mean, often this past year I’ve wondered if we could’ve saved Haven a different way, so I could be with her wherever she is . . .”\\n\\n “New York,” Vincent said as he trailed off.\\n\\n Carmine eyed him curiously. “New York?”\\n\\n “I don’t know exactly where, but she’s in New York somewhere.”\\n\\n A smile tugged the corner of his lips. She went to New York like they had talked about. “The point is, I’ve learned it’s senseless to wonder. I did what I did, you did what you did, and we are where we are. We just gotta do what we gotta do.”\\n\\n “You know, you mask it with the alcohol and profanity, but you’ve grown up quite a bit this past year.”\\n\\n “Yeah, well, I don’t think Corrado would agree with you,” Carmine said. “He threatens me at least once a week. I’m just waiting for the day he catches laryngitis and can’t say, ‘I’ll kill you,’ so he just does it instead.”\\n\\n Vincent laughed, shaking his head. “He’s threatened to kill me before. I’ve threatened to kill plenty of people, too, like Haven. It’s how we’re taught to control people, so it becomes second nature. Most of the men we deal with fear nothing except death.”\\n\\n “You know, it’s fucked up how nonchalant you are talking about killing the girl I love.”\\n\\n “You still love her?” he asked curiously.\\n\\n Carmine nodded. “I think I always will. Regardless of all this bullshit, she’ll always be my hummingbird.”\\n\\n “Hummingbird,” Vincent echoed. “Why do you call her that?”\\n\\n “Uh, I don’t know. Kinda just came out one day and stuck.”\\n\\n “Your mother would’ve loved that nickname.” Vincent smiled to himself. “I haven’t seen any in ages, but in the summertime hummingbirds used to swarm the tree in the backyard. Maura loved them; the way they could hover and fly backward and never tire. She was convinced the souls of the pure and innocent lived inside of them, and that’s why they defied nature.”\\n\\n Before Carmine could respond, his phone chimed. He tensed when he saw the familiar message:\\n\\n The docks, Third and Wilson.\\n\\n Carmine slipped the phone back away. “Guess I gotta go.”\\n\\n Vincent nodded as he lit another cigarette, not appearing surprised, and made no move to get up.\\n\\n “You wanna go inside?” Carmine offered. “It’s still your house.”\\n\\n “No, I’m just going to sit here for a few minutes and then be on my way.” \\n\\n","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-32.html","bookId":2785,"book":{"id":2785,"title":"Sempre: Redemption (Forever #2)","description":"Storyline: Sempre: Redemption (Forever #2) \\n In this thrilling and sexy follow-up to Sempre, two young lovers struggle to keep their relationship intact after they become deeply enmeshed in the dangerous mafia-run crime ring they once tried to overthrow. \\n Haven Antonelli and Carmine DeMarco have been through a lot. Haven was taken in by Carmine’s father, and with his family’s help, she escaped a gruesome fate. However, saving Haven from the dark intentions of a mafia family cost Carmine a steep price: he was forced to swear loyalty to them. \\n Now, still passionately in love, Carmine and Haven must face the fall-out of Carmine’s forced service, as Haven discovers terrifying secrets about the family that enslaved both her and her mother—and why she matters so much in this intricate web of lies.\\n","cover":"https://allnovel.net/images/sempre-redemption-forever-2.jpg","author":"J.M. Darhower","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sempre-redemption-forever-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:27:54 PM"}}
