{"id":88629,"no":54,"title":"Page 54","content":"He felt like he was going to throw up as that sunk in. “Carlo, Carmine,” Sal said, looking between the two of them. “Outside now.” Sal walked out but Carmine remained rooted to his spot for a moment, his eyes following Carlo as he sauntered from the room behind the boss. Carmine hesitantly followed them, knowing he had no choice, and the three took seats on some tan chairs on the outside patio beside the inground pool. Sal called for Abby to bring them drinks before dismissing her with a wave of the hand, ordering her to remain in her room for the rest of the evening. It didn’t escape Carmine’s notice that Carlo’s eyes followed the girl as she scampered away, his gaze that of a predator stalking its prey. Fucking sick. When she was gone, Salvatore raised his eyebrows curiously. “How are things, Principe?” The question rubbed Carmine the wrong way. Just fucking peachy, thanks for asking. “Fine.” “Fine,” Salvatore echoed, glancing between the men briefly before settling back on Carmine. “And what’s going on between the two of you?” “Nothing.” “Nothing? I can feel the tension rolling off of you. You’re hiding something. What happened earlier to cause the argument in my parlor?” Carmine said nothing. Regardless if he remained silent or told his side of it, he knew he would be on the losing end. Salvatore realized he wasn’t going to get an answer from him and turned to Carlo. “Maybe you’ll be more forthcoming.” “I was just put off by young DeMarco’s attitude,” Carlo said. “I’ve never heard someone speak so vulgar and disrespectfully.” Salvatore turned back to Carmine curiously, but before he could speak, unexpected laughter rang out beside them. The sound of it nearly made Carmine’s heart stop. He quickly looked in the direction it had come from, in utter disbelief as his eyes fell upon his father. Vincent DeMarco stood about twenty feet away at the corner of the house, dressed from head to toe in all black. He wore a new Italian suit, which was covered by a long trench coat, sweeping at his ankles and exposing a pair of black dress shoes that shone under the moonlight. His dark hair was slicked back, his face freshly shaved. “Now Carlo, you know that’s not true,” Vincent said, taking a few steps toward them. “You act like this organization is filled with saints. My son’s hardly the first to have a smart mouth.” “Ah, Vincent,” Salvatore said, confusion evident in his voice. His shoulders were tense, his expression hard as if chiseled in stone. It didn’t happen often, but the Boss had been caught off guard. “I was wondering if I’d ever see you again.” None of them knew how to react. Carmine just stared at his father as Carlo placed his hand on his gun under the table. “You had to have known we’d see each other again, Sal. It would be rude of me to take permanent leave and not say good-bye to you.” “True.” Salvatore eyed him cautiously, desperate for the upper hand. “Come, have a seat. We’ll chat.” Vincent lingered, slowly shaking his head. “I’m fine where I am.” Sal subtly shifted in his seat to get a better view. “You know, you’ve been gone for a while now. I was worried something happened to you.” “I’m sure you were.” “I was, honestly,” Sal said. “Especially when you skipped out on the trial. I was deeply concerned what that meant for your future.” “Ah, yes, that. I figured there was no use going through the charade.” “Can’t say I’m surprised, Vincent. Disappointed, yes, but not surprised.” “Well, you always did know me well,” he said. “It’s a pity I never really knew you, though. I thought I did, but I was wrong.” Sal laughed, a tinge of nervousness to his forced chuckle. “What you see is what you get with me.” “I wish that were true,” Vincent said. “I always thought you were a man of your word, a man who saw the world as black and white. I never realized how much you skirted in the gray area to suit your needs.” “What makes you think such a ridiculous thing?” “Haven Antonelli.” A gasp involuntarily flew from Carmine’s lips at the sound of her name. Salvatore’s gaze flickered to him, anger in his eyes, before his attention shifted right back to Vincent. “What does that girl have to do with this?” “Everything,” Vincent said. “Don’t act like you don’t know what I’m talking about.” Salvatore stared at Vincent with disbelief, but whether he was truly dumbfounded or just shocked at being called out wasn’t clear. Carmine’s heart beat rapidly as his eyes darted between the silent men. All of them were on edge, shoulders squared, poised for a fight. “Go inside, son,” Vincent said. “I’d like to speak to your godfather alone.” Pushing his chair back, Carmine started to stand when Salvatore slammed his fists down on the table in front of them. “Stay where you are!” Carmine knew he couldn’t disregard a direct order from the Boss. Glancing at his father, he shot him an apologetic look as he forced himself back into the chair. Panic flared in Vincent’s expression, and Carmine knew it then. Whatever was about to happen was not going to be good. “I still fail to see what the Antonelli child has to do with anything,” Salvatore said, turning his attention back to Vincent. “Enlighten me.” “Are you aware she’s an artist?” “I couldn’t care less what she is,” Sal said. “She’s nothing to me.” “Of course you know she’s an artist,” Vincent continued, ignoring his hostility. “In fact, you know a lot about her, more than you’d ever admit, including the fact that she’s not nothing to you.” “You don’t know what you’re talking about,” Sal said. “She’ll never be anything more than a slave in my eyes, a worthless piece of flesh you idiots waste your life on. She’s irrelevant in my world. She shouldn’t even exist!” Carmine flinched as irritation flashed across his father’s face. “You know, it didn’t make sense at the time,” Vincent said. “I never understood why Frankie refused to give her up, why he wouldn’t let her go when he wanted nothing to do with the girl. She was a burden, another mouth to feed, so why not take the cash to be rid of her?” “She was his granddaughter,” Salvatore said pointedly. “You know that.” “That didn’t matter to him,” Vincent retorted. “His son getting a slave pregnant would’ve been a disgrace in his eyes, tainting his bloodline—he would’ve wanted to be rid of the child. So why did he not only keep her but kill over her, too?” “He didn’t want anyone to find out.” “Yeah, that’s what you told me.” Vincent shook his head. “I believed it for years because I didn’t think you’d lie to me and you told me you were sure. I slaughtered him and his wife, and then I put my gun to that girl’s head as she slept and pulled the trigger, because you swore she was the reason my wife died. And that’s exactly what you wanted, wasn’t it? You used my grief to solve your problem, and it almost worked. If my gun hadn’t jammed, I would’ve killed everything there that breathed.” “I didn’t tell you to kill any of them.” “You didn’t have to! You knew exactly what I would do with the information you fed me, and you gave me just enough time to do it before calling me in.” “I would’ve never ordered a hit on a child!” “Because you can’t! The men wouldn’t have trusted you anymore if they even suspected you had anything to do with it. There would’ve been a mutiny! But you knew how to push my buttons, how to get me to react. You wanted them all dead and you used me so you could keep your hands clean.” “That’s ridiculous,” Salvatore said. “Why would I want them dead?” “Evidence,” Vincent said. “Never leave anything behind if it can be linked to you. It’s simple, something all of us know. The moment you realized your mistake, you wanted it disposed of.” “What evidence?” “The girl’s bloodline.” Panic swept across Salvatore’s face. Carmine stared at him in shock, realizing he wasn’t surprised . . . he did know. Confusion rocked Carmine’s brain, the knowledge nearly crippling him. The entire time, through it all, Salvatore knew they were related. “You’re crazy.” “Maybe so, but I’m still right,” Vincent said. “All it took was a simple prick of a finger and a lifetime of secrets came spilling out in the blood.” “I don’t know what you’re talking about.” “I once believed that. I thought you were as much a victim as her, but that changed when she was kidnapped. You wouldn’t get involved because you knew why they took her and you wanted nothing to do with it! You were afraid they’d expose you and you thought . . . you hoped . . . they’d get rid of her. But they didn’t. “You were power hungry and had your own family murdered. You used to talk about how much family meant, and I actually pitied you because you didn’t have anyone left! And the whole time it was your own fault!” “How dare you accuse me of that!” Salvatore spat. “I’ll kill you for this!” The moment he spoke those words, Vincent reached into his coat and pulled out a gun, aiming it at Salvatore. Carmine jumped up, as did Carlo, knocking chairs over in haste, one flying into the shallow end of the pool. Salvatore sat still, unmoving, barely blinking. Carmine was frozen with fear as Carlo pulled his gun, aiming at Vincent. “You had no idea thirty years later DNA testing would exist,” he continued, keeping his eyes and gun trained on Salvatore. “That’s the real reason he wouldn’t sell me the girl . . . he was trying to protect you, and maybe even protect her in the process. When it got back to you that Maura was asking questions, you panicked, and that’s when you set the plan in motion. You put the hit out on my wife to cover your tracks, and I never wanted to believe it. Never did I want to believe you’d do that to me, that you’d do that to my children. “Haven drew pictures after her kidnapping—like I said, she’s an artist—and she drew one of Carlo. I denied it to myself, I denied it to my son, but there came a point where I couldn’t deny it anymore. Your man—your best friend—had been there for it all!” Tears slid down Vincent’s cheeks. Carlo yelled, denying it all, while Salvatore glanced around with fear. Carmine stared at his godfather with disgust. “Carmine,” Sal said firmly, and he knew instantly what he wanted. He expected Carmine to follow his orders, to do what he had told him to do. “Don’t talk to my son!” Vincent snapped. “You’ve hurt him enough! Tell me, when you had my wife killed, did you want him dead, too?”","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-54.html","bookId":2785,"book":{"id":2785,"title":"Sempre: Redemption (Forever #2)","description":"Storyline: Sempre: Redemption (Forever #2) In this thrilling and sexy follow-up to Sempre, two young lovers struggle to keep their relationship intact after they become deeply enmeshed in the dangerous mafia-run crime ring they once tried to overthrow. Haven Antonelli and Carmine DeMarco have been through a lot. Haven was taken in by Carmine’s father, and with his family’s help, she escaped a gruesome fate. However, saving Haven from the dark intentions of a mafia family cost Carmine a steep price: he was forced to swear loyalty to them. Now, still passionately in love, Carmine and Haven must face the fall-out of Carmine’s forced service, as Haven discovers terrifying secrets about the family that enslaved both her and her mother—and why she matters so much in this intricate web of lies.","cover":"https://allnovel.net/images/sempre-redemption-forever-2.jpg","author":"J.M. Darhower","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sempre-redemption-forever-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:27:54 PM"}}
