{"id":88642,"no":67,"title":"Page 67","content":"“I don’t need a candle, Haven. I can handle an onion.” She smiled but didn’t respond. Carmine took his knife, cutting the ends off of the onion before slicing it down the center. The moment it came apart, the gases hit Carmine and he blinked rapidly as his eyes started to burn. Every cut seemed to intensify the sting. He squinted, his eyes welling with tears. It got so bad after a few minutes that his vision blurred, and he blinked to clear it, only succeeding in pushing the tears over the edge. He groaned and cut faster, turning his head to the side to brush the tears away with his arm. He lost focus, cutting blindly, and cursed as pain shot through his finger. He dropped the knife and pulled his hand away in shock, seeing the spot of blood form. It was a small cut, barely anything at all, but the juices from the onion made it burn. He stuck his finger in his mouth as a natural reaction and cringed at the rusty onion taste. Haven pulled his hands away from his face, frowning. “Are you okay?” He nodded and she pulled him to the sink, placing his hands under a stream of cold water, washing his cut. “Look at you, fixing me up,” he said. “When did we change places?” “When you decided to try to cook.” Carmine splashed some water on his face before turning off the faucet and grabbed a towel as he leaned back against the counter. He watched Haven as she finished cutting the onion, feeling inadequate when it didn’t seem to affect her. She preheated the oven and worked quickly, throwing together their food with ease. Once she had it all in the pan, she turned to Carmine with a smile. “When the oven’s ready, can you put the chicken in? I need to go change.” “Sure.” He stood there for a minute after she left until a string of beeps sounded through the kitchen. Carmine grabbed the pan and stepped toward the stove, oblivious to the puddle of water on the floor. His foot skidded in it as he slipped, absentmindedly letting go of the pan as he caught himself. He managed to stay on his feet but the pan hit the floor, the chicken and vegetables scattering around the kitchen. He scrambled, grabbing the ingredients and shoving them back in the pan, as footsteps quickly descended the stairs. Cursing under his breath, he grabbed the chicken just as Haven walked back in. She gasped, freezing in the doorway as she surveyed the mess. “Five-second rule?” he suggested, holding the chicken up by its leg. “When’s the last time the floor was washed?” “Does this count?” he asked, motioning toward the puddles. “No.” “Then, uh . . .” He paused, calculating. “. . . Eleven years ago when my mother lived here.” She just stared at him, blinking. He dropped the chicken, letting it hit the floor with a splat, and reached into his pocket for his phone. He dialed Celia’s number and waited as it rang. “Yeah, uh, can we reschedule dinner for tomorrow night? Great. Thanks.” He hung up with a sigh and looked over at Haven. “How do you feel about Chinese?” “Chinese is great,” she said, sliding her eyes to the chicken on the floor. “Salmonella? Not so much.” The church pew felt like steel beneath Carmine, his entire bottom half numb and tingling. Restless, he tapped his foot, trying to pay attention to the service, but it all sounded like blah, blah, blah to him. “Why’s he fidgeting?” Gia asked, her voice a mock whisper that seemed to echo through the church. Worshipers in the surrounding rows turned to look, scowling. “He looks like he’s possessed! There’s a demon in that boy!” Celia quietly scolded her mother while Corrado let out a low, bitter laugh. “It’s called addiction. He hasn’t had a drink today.” Gia sneered. “Don’t let him take communion then. He’ll steal all the wine.” Carmine rolled his eyes, relaxing back into the seat, but his leg steadily bounced as Haven grabbed his hand. What made him decide to tag along for Sunday Mass, he wasn’t sure, but he certainly regretted it now. Sweat formed along his brow as anxiety crept through his veins, bubbling up under the surface of his flushed skin. The rest of the service dragged by slowly. He sat in the pew during communion, ignoring the snide comments that slipped from his grandmother’s lips as she moved past to join the procession to the altar. Haven remained right beside him, silently absorbing everything, her eyes wide with innocent fascination. She had never been inside a church before. After Mass ended, Carmine pulled Haven into the main aisle. He made it only a few steps before stopping, hesitating as he glanced at her. “Can you ride home with Celia and Corrado?” Her brow furrowed with confusion, but she nodded, not questioning him. He gave her a quick kiss, making sure they would get her home safely, before he headed toward the front of the church. Father Alberto stood at the altar, talking to a few parishioners. He noticed Carmine’s presence and excused himself, making his way over to him. “Ah, Mr. DeMarco, do you need to use my telephone again?” Carmine chuckled, pulling out his cell phone. “No, I’m covered today.” “A ride?” He pulled out his keys. “All set there, too.” “So what can I do for you?” “I was hoping we could talk.” Father Alberto smiled. “Absolutely.” The priest led Carmine into the back office, the same one the two of them had sat in before, and motioned for him to take a seat. Carmine nervously ran his hand through his hair as he sat down, remaining quiet as the priest settled into his chair. “It’s good to see you,” Father Alberto said. “I wanted to catch you at the cemetery after Vincenzo’s funeral, but you were preoccupied with the young woman. I didn’t want to interrupt.” “Yeah, that’s Haven. She, uh . . . she’s . . .” “I know who she is,” Father Alberto said. “I’ve heard quite a bit about her.” “From my father?” “Oh, that I cannot say.” The priest smirked, a twinkle in his eye. Definitely his father. “Confessions are confidential.” “Even after the person’s dead?” “Definitely. Your relationship with God doesn’t end with death, son.” “I’m not surprised,” Carmine muttered, gazing across the desk at the priest. “That’s sorta why I wanted to talk to you. When they read my father’s will, he asked me to do him a favor. He wanted me to come here . . . said he left something.” The priest nodded, not an ounce of surprise registering in his expression. He had been expecting him. “That he did. But before I give it to you, tell me something.” “What?” “How do you feel?” Sighing, Carmine shook his head. “How does it look like I feel?” “You seem to be holding it together pretty well.” “Yeah, well, looks are deceiving.” “Nonsense. Maybe you’re the one who can’t see.” Carmine paused, hesitating for a fraction of a second, but the weight of his grief became too heavy to hold back. The dam broke, the words gushing out in a furious unyielding wave of emotion. It flooded the office, nearly drowning Carmine as he choked on the confession of his sins. Father Alberto gazed at him, silently taking in his rant, and didn’t speak until Carmine finished. There was nothing formal about it, no asking for forgiveness from God or man. It was just Carmine and his truth, and the one person who could hear it without looking at him differently. The one person who could hear it and never tell a living soul. “How do you feel now?” the priest asked when the office grew silent again. “I feel like I need a drink,” he muttered. The priest laughed lightly. “I’ll tell you what you can do instead.” “I don’t need Catholic penitence,” Carmine said. “I’m not fasting or repeating Hail Mary a dozen times. That’s bullshit.” “Ah, I wasn’t going to tell you to,” he said. “I was merely going to suggest you make a list. Write down the names of everyone you feel you’ve wronged and find a way to make it right again someday.” “That would take the rest of my life.” Father Alberto shrugged. “You have something better to do? I once knew a man who tried to drink his pain away. He drank to forget his family, he drank to dull the loss of a life, and when he finally sobered up, he had to make up for it somehow. He was righting his wrongs until the day he died.” Carmine gaped at him. His father? “Speaking of which, this was left here.” Father Alberto reached into his desk, pulling out a long gold chain and holding it up. A simple gold band swung from it, Carmine’s chest aching at the sight. He recognized it, had seen it thousands of times, on the finger of the first woman he ever loved and later around the neck of the first man he revered. His mother’s wedding band. “I’m sure you know what to do with it,” the priest said, handing it to him. Carmine carefully put the chain around his neck and concealed it in his shirt. The metal felt cold against his bare chest. “Thanks.” “You’re welcome. I also noticed you didn’t take communion. Would you like to do it now?” Carmine shook his head as he stood. “Maybe next time.” “Next time,” the priest mused as Carmine headed for the door. “I’ll take that. It means you might be back some day.” Twenty-four hours later, the six of them met at the Moretti home—Haven and Carmine, Celia and Corrado, Tess and Dominic—for a family dinner to honor Vincent’s life. It had been moved from Carmine’s house, since he didn’t even have a dining room table, and Haven and Celia went in together on cooking the meal. They gathered around, plates piled high with food, and shared laughs as they ate to their hearts content. Dia was the only one missing, having returned to her life in Charlotte. That weighed heavily on Haven’s mind during dinner as she thought about the life waiting for her back in New York. Kelsey had called her dozens of times, but Haven had been too conflicted to return any of those calls. “This is nice, having us all here,” Celia said. “I tried to get Mom to join us, but she wouldn’t.” “Meno male,” Corrado muttered. “Hey, she’s not that horrible.” Celia paused as everyone cast her skeptical looks. “Okay, so she’s a handful. But she’s relied on Vincent a lot the past few years, so the rest of us are going to have to step up now that he’s gone.” “I hardly know her,” Dominic said. “Same here,” Carmine replied. “And what little I do know says she doesn’t want shit to do with any of us.” “Not true,” Celia interjected. “She’s just stubborn.” Corrado scoffed. “I mean no disrespect, bellissima, but your mother’s issues reach far beyond sheer tenacity. We both know she has a deliberate cruel streak.”","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-67.html","bookId":2785,"book":{"id":2785,"title":"Sempre: Redemption (Forever #2)","description":"Storyline: Sempre: Redemption (Forever #2) In this thrilling and sexy follow-up to Sempre, two young lovers struggle to keep their relationship intact after they become deeply enmeshed in the dangerous mafia-run crime ring they once tried to overthrow. Haven Antonelli and Carmine DeMarco have been through a lot. Haven was taken in by Carmine’s father, and with his family’s help, she escaped a gruesome fate. However, saving Haven from the dark intentions of a mafia family cost Carmine a steep price: he was forced to swear loyalty to them. Now, still passionately in love, Carmine and Haven must face the fall-out of Carmine’s forced service, as Haven discovers terrifying secrets about the family that enslaved both her and her mother—and why she matters so much in this intricate web of lies.","cover":"https://allnovel.net/images/sempre-redemption-forever-2.jpg","author":"J.M. Darhower","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sempre-redemption-forever-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:27:54 PM"}}
