{"id":88585,"no":9,"title":"Page 9","content":"“Are you okay?” he asked, pulling back as her body shuddered. Haven nodded, her eyes starting to well up with tears as she avoided his gaze, once again terrified of seeing that look in his eyes, the look of regret. “Do you want to go inside?” he asked when she didn’t speak. She nodded again. He grabbed her hand, leading her to the back door instead of the tree. He pressed the code in the keypad, unlocking it, and ushered her inside. Haven took her coat off as soon as she made it upstairs to the bedroom, kicking her shoes off right inside the door. Her pants were damp and she stripped them off, pulling her shirt off next and tossing all of her clothes on the floor in a pile. She turned to Carmine, watching as he took his coat off and carefully hung it on the back of his desk chair. “Carmine,” she said, her voice shaking. He turned his head and froze when he saw her standing there in her bra and underwear, his eyes scanning the length of her like it was pure instinct. His gaze reached her face and their eyes connected, goose bumps dancing across her skin at the intensity of the green shining back at her. He stared at her curiously, the sadness still there, but more than anything she could see the love he had for her. Thank God, she silently pleaded in relief. “Make love to me, Carmine.” It came out a strangled whisper, the words catching in her throat. She needed him in that moment. She wasn’t entirely sure why, but she could feel it deep down to the bone. She didn’t want to just see his love—she wanted to feel it. It had been months since they had been intimate, since before the devastation had taken hold, and she desperately needed to be consumed by Carmine DeMarco once again. He appeared torn as he stared at her, but the agonized expression on his face faded away. He slowly took a few steps toward her but didn’t say anything, no words necessary. They both knew they would give in to the need, unable to resist the pull between them that had been there since the moment they first touched. He paused in front of her, his hand running the length of her arm as he leaned down to kiss her. Reaching around and unclasping her bra, he pulled it off slowly and allowed it to drop to the floor. A moan escaped Haven’s throat as he gently caressed her breasts, her nipples pebbling under his gentle touch. His hands drifted down to her hips as he slowly backed her up to the bed. She scooted back onto it and he hovered over her, not once breaking their kiss. Haven closed her eyes as his mouth moved to her neck, his shaky breath hitting the wet spots left behind. Shivers ripped down her spine as he trailed kisses down her stomach, and she inhaled deeply as his tongue dipped inside her belly button. It tickled, her body tingling from head to toe. Carmine took his time, kissing and caressing every inch of exposed skin, before slowly pulling off her panties. She clutched the sheets tightly as he kissed along her inner thighs, gripping her hips, holding her in place as his tongue gently caressed her flesh. Haven’s noises grew louder and her legs trembled as the pressure built inside her. Writhing, she let go of the sheets, reaching out for him. She ran her hands through his hair and moaned his name, a groan vibrating in his chest at the sound of it. He pulled away from Haven quickly and she opened her eyes as he sat up, watching as he grabbed the bottom of his shirt to pull it off. Reaching out, Haven ran her fingers over the ridges of his stomach, tracing the lines of the tattoo on his chest as he unbuckled his pants. He pulled them off and Haven’s breath hitched at the sight of him already erect. She ran her fingers down the light trail of hair on his stomach before grasping him and stroking a few times. “Are you sure?” he asked, placing his hand on top of hers. “Now who’s second guessing?” she asked. “Don’t you trust me?” He smiled, amused she would turn his words around on him, and pulled her hand away. She held her breath as he pushed inside of her, filling her completely with one deep stroke. “Of course I trust you,” he whispered. “I’m just giving you a chance to change your mind.” “I’ll never change my mind,” she said. “Not when it comes to you.” His thrusts were slow and gentle at first as he kissed her softly, whimpers escaping her throat. She wrapped her arms around him, clinging to him as her hands roamed the sculpted muscles of his back. The pleasure was intense as it swept through her, and it didn’t take long before the pressure built again, her body quivering. Carmine’s movements grew more frantic after a while, his thrusts harder and deeper. His breathing grew labored, his body trembling in her arms as he slid in and out of her body with fervor. She could feel the desire seeping from his pores as he gave himself to her. The love, the need, the yearning . . . the raw passion between them was enough to take her breath away. Skin soaked with sweat, Haven felt as if she were on fire, every inch of her aching for all of him. She could hear his pants and gasps, his hands gripping her firmly as he challenged logic by pulling her closer than she had ever been before. It was as if they had melted into one, where he ended and she began nothing but a blur. Bodies pressed together, she could feel his pulse, blood furiously rushing through his veins. “Your heart,” she whispered. “It’s racing.” “You feel it?” he asked. “You hear it?” “Yes.” “What’s it saying?” She smiled, her eyes fluttering closed. “It’s saying you love me.” “I do,” he said. “No matter what. Sempre.” That word washed through her. “Sempre.” Carmine’s body shook as his climax hit. He smashed his lips to hers as he thrust a few more times, holding Haven so tightly it was as if his life depended on it. He stilled his movements, nuzzling into her neck, and let out a shaky breath as a shudder ran through his body. “Good night, my hummingbird,” Carmine whispered. “I’ll keep you in my dreams.” 7 Sitting at the bottom of the stairs, Carmine dropped his head low as his hand gripped his unruly hair, his eyes fixed on the black duffel bag full of clothes near his feet. His old acoustic guitar was carefully balanced against it—half teetering on the bag, half on the foyer floor. A chime echoed through the downstairs from a clock in the family room, an eternity seeming to pass with each tick of its hand. Time was a merciless bitch, taunting him as it slipped away. One second; two seconds; twenty minutes; an hour. A century could have gone by, or no time at all. Carmine’s chest ached. He wished it would just fucking stop. Footsteps on the stairs behind him made him feel like he was going to be sick. He was afraid Haven would wake up and catch him sitting there alone—part of him treacherously hoping she would find him and stop him, even though he knew it was too late. “I’m surprised you’re still here,” Vincent said, stepping past. “I thought you’d be gone by now.” “So did I,” he said, his voice shaking as he continued to stare at the bag on the floor. “She’s gonna hate me. She’s gonna regret ever letting me into her life.” “She’ll understand someday.” Carmine clenched his hands into fists as his eyes burned with unshed tears. “This is gonna fucking devastate her.” “Yeah, it probably will.” “Great,” he spat, glaring at his father. “Thanks for making me feel better.” “Do you want me to lie to you?” Vincent asked, raising his eyebrows. “Of course it’s going to hurt her, Carmine. There’s no getting around that.” “This is fucked up,” he said, shaking his head. “This isn’t how it’s supposed to be. It wasn’t supposed to end up like this. We’re supposed to be together, get away from all of this bullshit and just be. For once in our fucking lives, we were going to just be, and now look at everything.” “Are you rethinking this?” he asked. “It isn’t too late.” “It is too late,” he said. “The moment I went to Sal, it became too late. She’s better than the life I can offer her.” “Then what do you want me to say, son?” “I want you to say she’s better off without me, that we’re better off apart.” “Fine,” Vincent said, “but who’s going to convince you of that?” His question caught Carmine off guard. He stared at his father pointedly, awaiting some answer to ease his concern, but the mere thought of stepping out of that front door without Haven hurt worse than Carmine ever imagined it would. Before he could come up with something to say, the front door opened and Dominic stepped inside. He froze when he caught sight of Carmine and narrowed his eyes as he slammed the door. Dominic rarely lost his temper, but when he did another side of him came out that was unpredictable, his words often hurting just as much as Carmine vaguely recalled his fists did. “I see you haven’t walked out on her yet,” he said, his words cutting deep. “Leave him alone, Dom,” Vincent said. “You’re just making it worse.” “I’m making it worse?” he asked with disbelief. “Someone has to try to talk him out of this before he makes the biggest mistake of his life. She’s the best thing that ever happened to him!” “You think I don’t know that?” Carmine snapped. “She deserves to be free to do what she wants!” “Then why are you taking that from her?” Dominic asked. “You’re doing this so she’ll be free to do what she wants, but you’re making the choice for her!” “I can’t let her first decision be whether she follows her dreams or me. What kinda bullshit is that to ask of her? She always worries about everyone else because assholes have beat her down, and I’d be no better than them if I asked her to put me first! She deserves to find out what’s out there for her, whether she realizes it or not.” “That’s the stupidest thing I’ve ever heard,” Dominic said. “Do you even hear yourself? What gives you the right to decide for her—because you know better than she does? Could you be more condescending?” “Fuck you! I may be what she wants, but I’m not what she needs!” “According to you,” Dominic spat, stalking forward and getting in Carmine’s face. “But like I said, you didn’t even ask her. You just assumed. Who cares what Haven wants, right? We’ll all just claim to know better than her and make her decisions and pretend it’s what she needs when only she knows.” “She wants a future, Dominic. She wants to be free.” “But she isn’t,” he said. “Not as long as people like you are making decisions for her. I thought you were better than that, Carmine, but maybe I was wrong. Maybe you don’t love her, after all.” The moment the words came from his mouth, rage ran through Carmine. He jumped up, drawing his arm back, and hit his brother with as much force as he could. Carmine’s fist connected with Dominic’s jaw, which made him stagger a few steps, but he lunged for Carmine the moment he gained his balance. Carmine tripped over the duffel bag, his foot tramping on the guitar and smashing through it as Dominic shoved him into the nearest wall. Vincent tried to come between them, but Dominic was too strong. He pinned Carmine there with his left hand as he drew his fist back. Carmine waited for the blow, blindly striking back at his brother, but before Dominic could follow through, a firm voice echoed through the downstairs.","sourceLink":"https://allnovel.net/sempre-redemption-forever-2/page-9.html","bookId":2785,"book":{"id":2785,"title":"Sempre: Redemption (Forever #2)","description":"Storyline: Sempre: Redemption (Forever #2) In this thrilling and sexy follow-up to Sempre, two young lovers struggle to keep their relationship intact after they become deeply enmeshed in the dangerous mafia-run crime ring they once tried to overthrow. Haven Antonelli and Carmine DeMarco have been through a lot. Haven was taken in by Carmine’s father, and with his family’s help, she escaped a gruesome fate. However, saving Haven from the dark intentions of a mafia family cost Carmine a steep price: he was forced to swear loyalty to them. Now, still passionately in love, Carmine and Haven must face the fall-out of Carmine’s forced service, as Haven discovers terrifying secrets about the family that enslaved both her and her mother—and why she matters so much in this intricate web of lies.","cover":"https://allnovel.net/images/sempre-redemption-forever-2.jpg","author":"J.M. Darhower","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sempre-redemption-forever-2.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:27:54 PM"}}
