{"id":108664,"no":2,"title":"Page 2","content":"\\n\\n Sunrise wouldn\u0027t be for another nine or ten hours; and though he had to stay here until then, it would certainly be impossible to sleep. The prospect of the long wait sickened him.\\n\\n He remembered the bocor\u0027s statement: \"I hope it was worth it.\"\\n\\n He looked up at the stars and sneered a challenge at them. Try to stop me now, he thought, though it may take me years. I know it\u0027s true now. It can be done. Yes - even if I\u0027d had to have a dozen Indians killed to learn it, a dozen white men, a dozen friends ... it would still have been worth it.\\n\\n BOOK ONE\\n\\n The seas and the weathers are what is; your vessels adapt to them or sink.\\n\\n - Jack Shandy\\n\\n Chapter One\\n\\n Gripping one of the taut vertical ropes and leaning far out over the rail, John Chandagnac waited a moment until the swell lifted the huge, creaking structure of the stern and the poop deck on which he stood, and then he flung the biscuit as hard as he could. It looked like quite a long throw at first, but as it dropped by quick degrees toward the water, and kept on falling instead of splashing in, he saw that he hadn\u0027t really flung it very far out; but the gull had seen it, and came skimming in above the green water, and at the last moment, as if showing off, snatched it out of the air. The biscuit broke as the gull flapped back up to a comfortable altitude, but he seemed to have got a good beakful.\\n\\n Chandagnac had another biscuit in his coat pocket, but for a while he just watched the bird glide, absently admiring the way it seemed to need only the slightest hitch and flap now and then to maintain its position just above the Vociferous Carmichael\u0027s starboard stern lamp, and he sniffed the elusive land smell that had been in the breeze since dawn. Captain Chaworth had said that they\u0027d see Jamaica\u0027s purple and green mountains by early afternoon, then round Morant Point before supper and dock in Kingston before dark; but while the unloading of the Carmichael\u0027s cargo would mean the end of the worrying that had visibly slimmed the captain during this last week of the voyage, disembarking would be the beginning of Chandagnac\u0027s task.\\n\\n And do remember too, he told himself coldly as he pulled the biscuit out of his pocket, that both Chaworth and yourself are each at least half to blame for your own problems. He flung the thing harder this time, and the sea gull caught it without having to dip more than a couple of yards.\\n\\n When he turned back toward the little breakfast table that the captain let the passengers eat at when the morning\u0027s shiphandling jobs were routine, he was surprised to see the young woman standing up, her brown eyes alight with interest.\\n\\n \"Did he catch them?\" she asked.\\n\\n \"Certainly did,\" said Chandagnac as he walked back toward the table. He wished now that he had shaved. \"Shall I throw him yours too?\"\\n\\n She pushed her chair away and surprised Chandagnac still further by saying, \"I\u0027ll throw it to him myself ... if you\u0027re sure he doesn\u0027t object to maggots?\"\\n\\n Chandagnac glanced at the gliding bird. \"He hasn\u0027t fled, at least.\"\\n\\n With only the slightest tremor of hesitation she picked up the inhabited biscuit and strode to the rail. Chandagnac noticed that even her balance was better this morning. She drew back a little when she got to the rail and looked down, for the poop deck was a good dozen feet above the rushing sea. With her left hand she took hold of the rail and pulled at it, as if testing to see if it was loose. \"Hate to fall in,\" she said, a little nervously.\\n\\n Chandagnac stepped up next to her and gripped her left forearm. \"Don\u0027t worry,\" he said. His heart was suddenly beating more strongly, and he was annoyed with himself for the response.\\n\\n She cocked her arm back and pitched the biscuit, and the white-and-gray bird obligingly dived for it, once again catching it before it hit the water. Her laugh, which Chandagnac heard now for the first time, was bright and cheerful. \"I\u0027ll wager he follows every Jamaica-bound ship in, knowing the people aboard will be ready to throw the old provisions overboard.\"\\n\\n Chandagnac nodded as they returned to the little table. \"I\u0027m not on a lavish budget, but I keep thinking about dinner tonight in Kingston. Rare beef, and fresh vegetables, and beer that doesn\u0027t smell like hot pitch.\"\\n\\n The young woman frowned. \"I wish I was permitted meat.\"\\n\\n Chandagnac shifted his stool a foot or two to the left so that the tall, taut arch of the spanker sail shaded his face from the morning sun. He wanted to be able to see the expressions on the face of this suddenly interesting person. \"I\u0027ve noticed that you only seem to eat vegetables,\" he said, idly picking up his napkin.\\n\\n She nodded. \"Nutriments and medicaments - that\u0027s what my physician calls them. He says I have an incipient brain fever as a result of the bad airs at a sort of convent I was going to school at in Scotland. He\u0027s the expert, so I suppose he\u0027s right - though as a matter of fact I felt better, more energetic, before I started following his diet regimen.\"\\n\\n Chandagnac had snagged up a loop of thread from his napkin and began working on another. \"Your physician?\" he asked casually, not wanting to say anything to break her cheery mood and change her back into the clumsy, taciturn fellow passenger she\u0027d been during the past month. \"Is he the ... portly fellow?\"\\n\\n She laughed. \"Poor Leo. Say fat. Say corpulent. Yes, that\u0027s him. Dr. Leo Friend. An awkward man personally, but my father swears there\u0027s no better medical man in the world.\"\\n\\n Chandagnac looked up from his napkin work. \"Have you been avoiding your ... medicaments? You seem cheerier today.\" Her napkin lay on the table, and he picked it up and began picking at it too.\\n\\n \"Well, yes. Last night I just threw the whole plateful out of my cabin window. I hope that poor sea gull didn\u0027t sample any - it\u0027s nothing but a nasty lot of herbs and weeds Leo grows in a box in his cabin. Then I sneaked across to the galley and had the cook give me some sharp cheese and pickled onions and rum.\" She smiled sheepishly. \"I was desperate for something with some taste to it.\"\\n\\n Chandagnac shrugged. \"Doesn\u0027t sound bad to me.\" He\u0027d drawn three loops of thread out of each of the napkins, puckering the squares of cloth into bell shapes, and now he slipped three fingers of either hand into the loops and made the napkins stand upright and approach each other with a realistic simulation of walking. Then he had one of them bow while the other curtsied, and the two little cloth figures - one of which he\u0027d somehow made to look subtly feminine - danced around the tabletop in complicated whirls and leaps and pirouettes.\\n\\n The young woman clapped her hands delightedly, and Chandagnac had the napkins approach her and perform another curtsy and a sweeping Gascon bow before he let them fall from his fingertips.\\n\\n \"Thank you, Miss Hurwood,\" he said in a master-of-ceremonies voice.\\n\\n \"Thank you, Mr. Chandagnac,\" she said, \"and your energetic napkins, too. But don\u0027t be formal - call me Beth.\"\\n\\n \"Very well,\" said Chandagnac, \"and I\u0027m John.\" Already he was regretting the impulse that had prompted him to draw her out - he had no time, nor any real wish, to get involved with a woman again. He thought of dogs he\u0027d seen in city streets, and called to, just to see if they\u0027d wag their tails and come over, and then too often they had been eager to follow him for hours.\\n\\n He stood up and gave her a polite smile. \"Well,\" he said, \"I\u0027d better be wandering off now. There are a couple of things I\u0027ve got to be discussing with Captain Chaworth.\"\\n\\n Actually, now that he thought of it, he might go look for the captain. The Carmichael was toiling along smoothly before the wind right now and couldn\u0027t be needing too much supervision, and it would be nice to sit down and have one last beery chat with the captain before disembarking. Chandagnac wanted to congratulate Chaworth on the apparent success of his insurance-evasion gambit - though unless they were absolutely alone he would have to deliver the congratulations in very veiled terms - and then to warn the man sternly against ever trying such a foolhardy trick again. Chandagnac was, after all, or had been, a successful businessman, and knew the difference between taking carefully calculated risks and letting one\u0027s whole career and reputation depend on the toss of a coin. Of course Chandagnac would be careful to deliver the reproof in a bantering tone, so as not to make the old man regret the drunken confidence.\\n\\n \"Oh,\" said Beth, clearly disappointed that he couldn\u0027t stay and talk. \"Well, maybe I\u0027ll move my chair over by the railing and watch the ocean.\"\\n\\n \"Here, I\u0027ll carry it for you.\" She stood up, and Chandagnac picked up her chair and walked to the starboard rail, where he set it down on the deck a few yards from one of the post-mounted miniature cannons that he\u0027d heard the sailors call swivel guns. \"The shade\u0027s only intermittent here,\" he said doubtfully, \"and you\u0027d be catching the full breeze. Are you sure you wouldn\u0027t be better off below?\"\\n\\n \"Leo would certainly think so,\" she said, sitting down with a smile of thanks, \"but I\u0027d like to continue my experiment of last night, and see what sort of malady it is that one gets from normal food and sunlight and fresh air. Besides, my father\u0027s busy with his researches, and he always winds up covering the whole cabin floor with papers and pendulums and tuning forks and I don\u0027t know what all. Once he\u0027s got it all arranged, there\u0027s no way in or out.\"\\n\\n Chandagnac hesitated, curious in spite of himself. \"Researches? What\u0027s he researching?\"\\n\\n \"Well ... I\u0027m not sure. He was involved pretty deeply in mathematics and natural philosophy at one time, but since he retired from his chair at Oxford six years ago ... \"\\n\\n Chandagnac had seen her father only a few times during the month\u0027s voyage - the dignified, one-armed old man had not seemed to desire shipboard sociability, and Chandagnac had not paid much attention to him, but now he snapped his fingers excitedly. \"Oxford? Benjamin Hurwood?\"\\n\\n \"That\u0027s right.\"\\n\\n \"Your father is the - \"\\n\\n \"A sail!\" came a shout from high among the complicated spider webs of the mainmast shrouds. \"Fine ahead port!\"\\n\\n Beth stood up and the two of them hurried across the deck to the port rail and leaned out and craned their necks to see past the three clusters of standing rigging, which they were viewing end on. Chandagnac thought, it\u0027s worse than trying to see the stage from above during a crowded scene in a marionette show. The thought reminded him too clearly of his father, though, and he forced it away and concentrated on squinting ahead.\\n\\n At last he made out the white fleck on the slowly bobbing horizon, and he pointed it out to Beth Hurwood. They watched it for several minutes, but it didn\u0027t seem to be getting any closer, and the sea wind was chillier on this side in spite of the unobstructed sun, so they went back to her chair by the starboard rail.\\n\\n \"Your father\u0027s the author of ... I forget the title. That refutation of Hobbes.\"\\n\\n \"The Vindication of Free Will.\" She leaned against the rail and faced astern to let the breeze sweep back her long dark hair. \"That\u0027s right. Though Hobbes and my father were friends, I understand. Have you read it?\"\\n\\n Again Chandagnac was wishing he\u0027d kept his mouth shut, for the Hurwood book had been a part of the vast reading program his father had led him through. All that poetry, history, philosophy, art! But a cloddish Roman soldier had shoved a sword through Archimedes, and a bird had dropped a fatal turtle onto the bald head of Aeschylus, mistaking it for a stone useful for breaking turtles open upon.\\n\\n \"Yes. I did think he effectively dismissed Hobbes\u0027 idea of a machine-cosmos.\" Before she could agree or argue, he went on, \"But how do pendulums and tuning forks apply?\"\\n\\n Beth frowned. \"I don\u0027t know. I don\u0027t even know what ... field ... he\u0027s working in now. He\u0027s withdrawn terribly during the years since my mother died. I sometimes think he died then too, at least the part of him that ... I don\u0027t know, laughed. He\u0027s been more active this last year, though ... since his disastrous first visi to the West Indies.\" She shook her head with a puzzled frow: \"Odd that losing an arm should vitalize him so.\"\\n\\n Chandagnac raised his eyebrows. \"What happened?\"\\n\\n \"I\u0027m sorry, I thought you\u0027d have heard. The ship he was on was taken by the pirate Blackbeard, and a pistol ball shattered his arm. I\u0027m a little surprised he chose to come back here - though he does have a dozen loaded pistols with him this time, and always carries at least a couple.\"\\n\\n Chandagnac grinned inwardly at the idea of the old Oxford don fingering his pistols and waiting to come across a pirate to shoot at.\\n\\n From out across the blue water rolled a loud, hollow knock, like a large stone dropped onto pavement. Curious, Chandagnac started to cross the poop deck to look again at the approaching vessel, but before he\u0027d taken two steps he was distracted by the abrupt white plume of a splash on the face of the sea, a hundred yards ahead to starboard.\\n\\n His first thought was that the other vessel was a fishing boat, and that the splash marked the jump of some big fish; then he heard the man at the mast-top shout, more shrilly this time, \"Pirates! A single sloop, the mad fools!\"\\n\\n Beth was on her feet now. \"God in heaven,\" she said quietly. \"Is it true?\"\\n\\n Chandagnac felt light-headed rather than scared, though his heart was pounding. \"I don\u0027t know,\" he said, hurrying with her across the deck to the port rail, \"but if it is, he\u0027s right, they\u0027re mad - a sloop\u0027s hardly more than a sailboat, and on the Carmichael we\u0027ve got three masts and eighteen heavy guns.\"\\n\\n He had to raise his voice to be heard, for the morning, which had been quiet except for the eternal creak-and-splash-and-slurry, had instantly become clamorous with shouted orders and the slap of bare feet on the lower decks and the buzz of line racing through the block spools; and there was another sound too, distant but far more disquieting - a frenzied metallic clatter and banging underscored by the harsh discord of brass trumpets blown for noise instead of music. \\n\\n","sourceLink":"https://allnovel.net/on-stranger-tides/page-2.html","bookId":1558,"book":{"id":1558,"title":"On Stranger Tides","description":"Storyline: Aboard the Vociferous Carmichael, puppeteer John Chandagnac is sailing toward Jamaica to claim his stolen birthright from an unscrupulous uncle, when the vessel is captured . . . by pirates! Offered a choice by Captain Phil Davies to join their seafaring band or die, Chandagnac assumes the name John Shandy and a new life as a brigand. But more than swashbuckling sea battles and fabulous plunder await the novice buccaneer on the roiling Caribbean waters–for treachery and powerful vodun sorcery are coins of the realm in this dark new world. And for the love of beautiful, magically imperiled Beth Hurwood, Shandy will set sail on even stranger tides, following the savage, ghost-infested pirate king, Blackbeard, and a motley crew of the living and the dead to the cursed nightmare banks of the fabled Fountain of Youth.\\n","cover":"https://allnovel.net/images/on-stranger-tides.jpg","author":"Tim Powers","type":"Adventure","source":"allnovel","link":"https://allnovel.net/on-stranger-tides.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:21:58 PM"}}
