{"id":108668,"no":7,"title":"Page 7","content":"\\n\\n Davies laughed as he uncorked a fresh bottle. \"They got me with candy. I was fifteen, and walking home from the woodcarving shop where I was \u0027prenticed.\" He tipped the bottle up and took a long sip.\\n\\n \"They can\u0027t!\" another man spoke up. \"It\u0027s illegal! Apprentices younger than eighteen is exempt. You should have told the captain, Phil, he\u0027d have put you back ashore with an apology.\"\\n\\n \"Queen Anne made that law in 1703, but I was pressed four years before that.\" Davies grinned and tilted the bottle up again, then wiped his moustache and said, \"And they didn\u0027t make it retroactive.\" He looked up at Chandagnac. \"Yeah, have her lead him to a press gang.\"\\n\\n \"Uh ... all right.\" Chandagnac had seen press gangs in action in several countries, though his age, or citizenship, or possibly an occasional discreet bribe from his father, had kept him from ever becoming their prey.\\n\\n \"Step right this way, sir,\" the female puppet said alluringly, slinking back inside the barrel. \"We can have a drink before proceeding to other matters.\"\\n\\n The other puppet\u0027s head bobbed idiotically. \"I beg your pardon?\"\\n\\n \"I say I know this place. We can get a drink.\"\\n\\n \"Stink? I\u0027ll say. My word, no wonder, look at these rough lads, I\u0027m not certain I - \" The male puppet followed her inside, and then Chandagnac shook the puppets and rattled the toe of his boot against the back of the barrel. \"Ow!\" he had a rough voice yell, \"Look out! Get him! That\u0027s it! Hold him down! And there you go, sir! May I be the first to congratulate you on having took up a life on the high seas.\"\\n\\n Chandagnac had some hope of getting his story back into its accustomed channel, but his audience now demanded that he follow his unfortunate protagonist onto a Navy ship, and so he had to tip the barrel over onto its side to serve as the ship, and quickly snip-and-tack the woman\u0027s skirt into a pair of trousers so that various male roles could be taken by that puppet.\\n\\n Prompted by his reminiscent audience, Chandagnac had the poor protagonist puppet - whose upper-class accent had by now disappeared - suffer all sorts of punishments at the hands of the feared and despised officers. He had an ear cut off for replying to an order in tones an officer chose to consider sarcastic, his teeth were knocked in with a belaying pin for some other offense, and then he was \"flogged around the fleet,\" which apparently meant that he was ceremoniously boated to each of a number of ships in order to be flogged aboard each one. Finally the audience permitted him to jump ship at a tropical port and wade ashore. Several members of the audience seemed to lose interest at this point, and began singing, and a couple were fencing with sticks out beyond the circle.\\n\\n Chandagnac continued despite the distractions, and had the runaway hiding in the jungle to await the arrival of some pirate boat that could use another sailor, but then the very old man leaped to his feet. \"The spring!\" the old man yelled. \"The water that is foul even as it wells from the earth!\"\\n\\n \"\u0027At\u0027s right, governor,\" Skank said, \"but you\u0027re interrupting the show.\"\\n\\n \"The faces in the spray! Almas de los perditos!\"\\n\\n \"Pipe down, Sawney!\" yelled someone else.\\n\\n \"Ah!\" The old man looked around wide-eyed, then winked. \"Vinegar,\" he said then, as portentously as if he was telling them the password to the Heavenly Kingdom, \"will drive lice away from your body.\"\\n\\n \"I am not a dog!\" yelled the black man who had helped intimidate Chandagnac into giving this performance. It looked to Chandagnac as though the whole thing was degenerating into chaos.\\n\\n \"That\u0027s news Charlie Vane\u0027s crew needs more than we do, governor,\" said Davies. The pirate chief handed the old man the bottle he\u0027d been working on, which was still more than half-full. \"Why don\u0027t you go tell him?\"\\n\\n Governor Sawney took a long sip and then ambled away, back into the darkness, pausing twice to call out admonitory-sounding bits of Old Testament scripture.\\n\\n At this point, to Chandagnac\u0027s relief, someone yelled that the food was ready. He left the puppets in the barrel and joined the rush to the cooking pot, where he was handed a board with a hot, wet, bloated-looking chicken on it. It smelled fairly good, though, for the bucket he\u0027d seen emptied into the pot earlier had contained a curry that some other crew had found too spicy to be eaten, so he shucked his chicken out of its loosened skin and then impaled the bird on a stick and held it over the flames. Several of the pirates who also were less than enthusiastic about half-boiled chicken did the same, and after they\u0027d all eaten, and chased the still-dubious food with more brandy, someone called out a proposal that the puppeteer should be made the official cook.\\n\\n The idea drew assenting shouts, and Davies, who\u0027d been among the number who had followed Chandagnac\u0027s cooking example, got drunkenly to his feet. \"Get up, pup,\" he said to Chandagnac.\\n\\n Choosing to regard the term of address as a diminutive of the word puppeteer, Chandagnac stood up - though not smiling.\\n\\n \"What\u0027s your name, pup?\"\\n\\n \"John Chandagnac.\"\\n\\n \"Shandy-what?\"\\n\\n \"Chandagnac.\" A board in the fire popped loudly, throwing sparks into the sky.\\n\\n \"Hell, boy, life\u0027s too short for names like that. Shandy\u0027s your name. And plenty of name it is, too, for a cook.\" He turned to the rest of the pirates, sprawled like battle casualties across the sand. \"This here\u0027s Jack Shandy,\" he said, loudly enough to be heard over the perpetual babble. \"He\u0027s the cook.\"\\n\\n Everyone who comprehended it seemed pleased, and Skank perched one of the unclaimed boiled chickens on a three-cornered hat and made Chandagnac wear it while draining a mug of rum.\\n\\n After that the evening became, for the new cook, a long foggy blur punctuated by occasional clear impressions: he was splashing in the surf at one point, taking part in some complicated dance, and the music was a drumming that took in as counterpoint the surf roll and the warm wind rattling in the palms and even Chandagnac\u0027s own heartbeat; later he had broken free of it and had run ashore and then wandered for a long time between the water and the jungle, skirting the fires and whispering \"John Chandagnac\" over and over to himself, for with a new name assigned to him he could imagine forgetting the old one, out here in this world of murder and rum and small, vivid islands; and some time after that he saw a gang of naked children who had found his puppets and were making them dance, but weren\u0027t touching the wooden figures in any way, only cupping their hands near them, and each tack-head in the jigging puppets was glowing dull red; and then finally he found himself sitting in soft sand that would be even more comfortable to lie down in. He lay back, realized he still had the hat on, fumbled it off, accidentally thrust his hand into the cold chicken\u0027s abdomen, jackknifed up to vomit a couple of yards down the slope, then sank back again and slept.\\n\\n Chapter Three\\n\\n The summer of 1718 was not a typical one for the outlaw republic on New Providence Island. Traditionally the Caribbean pirates careened their larger vessels in the spring, and when the hulls were cleaned of weed and barnacles, and all rotten planks and cordage were replaced, they stocked the holds with food, water and the best of the winter\u0027s loot and then sailed off to the northwest, skating around the Berry Islands and the Biminis and then letting the eternal Gulf Stream assist them as they worked their way up the North American coastline. The governors of the English colonies generally welcomed the pirates, grateful for the prosperity their cut-rate goods brought, and the Caribbean in summer was a steamy breeding ground for malaria and yellow fever and every sort of flux, to say nothing of the hurricanes that chose that season, more often than not, to come slanting up westward from the open Atlantic beyond Barbados, ripping around Cuba and up into the Gulf of Mexico like spinning drill bits across a pane of glass, creating and splitting and even totally obliterating islands in their paths.\\n\\n But it was July now, and the New Providence harbor was still crowded with sloops and schooners and brigantines, and even a couple of three-masted ships, and cooking fires still smudged the air above the huts and shacks and sailcloth tents along the beach, and the whores and black market wholesale buyers still sauntered among the crews and watched eagerly for incoming craft; for word had it that Woodes Rogers had been appointed governor of the island by King George, and was due to arrive with a Royal Navy escort any day now, bringing the King\u0027s Pardon for any pirates that wanted to renounce piracy, and the punishments prescribed by law for any that didn\u0027t.\\n\\n The philosophy commonest among the New Providence residents in the early weeks of July was most frequently summed up in the phrase \"Wait and see.\" A few, such as Philip Davies, were determined to be gone by the time Rogers arrived, and a few others, chiefly Charlie Vane and his crew, had resolved to stay and forcibly resist this incursion from the authorities across the Atlantic; but most of the pirates were inclined to accept the offer of amnesty, and eliminate from their futures the specter of the ceremonial silver oar carried by the executioner when he escorted a condemned pirate to the gibbet and the clergyman and the crowd and the last knot the pirate would ever have dealings with. And after all, if they didn\u0027t find life under the new regime an improvement, they could always steal a boat and follow the wind to some other island. Two hundred years ago the Spanish had made a point of stocking all their islands with pigs and cattle, and a man could do a lot worse than to live on some unmonitored shore, subsisting on fruit and fish and meat dried over the buccan fires; the buccaneer way of life had effectively ended a century ago when the Spaniards drove all such harmless beach-gypsies off their islands and onto the sea - and the Spaniards had soon regretted it, for the evicted buccaneers quickly became seagoing predators - but the islands were still there.\\n\\n Oranges stippled the jungle now like bright gold coins on green satin and crushed velvet, and even the people who\u0027d been raised in England followed the examples of the other races and graced their plain fare with tamarinds, papayas and mangoes; avocados by the hundreds hung fat and darkly green in the trees, often falling and thudding heavily to the sand and startling pirates who weren\u0027t accustomed to seeing the things in the season when they were ripe.\\n\\n Cookery, in fact, had become a bigger part of daily life in the New Providence settlement, both because the imminent arrival of Woodes Rogers meant at least the postponement of piratical ventures, leaving people the time to pay more attention to what they ate, and because the ship\u0027s cook of the Vociferous Carmichael had not only proven to be competent, but had undertaken to prepare batches big enough to feed several crews in exchange for help in procuring the cooking supplies. In the three weeks since the Carmichael had arrived, for example, there had been seven \"bouillabaisse endeavors,\" in which just about everyone, pirates and whores and black marketeers and children, waded out into the harbor at low tide, armed with nets and buckets, and dragged out of the sea enough animals of one sort and another for the cook to make a vast fish stew, and when the stuff was bubbling in the several huge pots over the fire on the beach, pungently aromatic with garlic and onion and saffron, they said incoming ships would smell the stew long before they\u0027d see the island.\\n\\n And as the month wore on and the days grew to their longest, at dinnertime more and more people had been drifting over to where Davies\u0027 crews clustered around the moored sloop Jenny, for the Jenny and the Carmichael were supposed to leave New Providence Island, taking the cook along, on Saturday the twenty-third.\\n\\n On Friday afternoon the cook was rowing a boat up the harbor from the deep inlet where the Carmichael sat; the ship was restored to her normal upright position now, and had been pulled almost all the way back down into the water, and as Jack Shandy watched her recede, his muscled brown arms hauling on the oars and propelling the boat forward, he saw section after section of scaffolding, axed and pried loose from the hull, spin down and splash into the sea.\\n\\n Before the end of the month, he told himself, I should be able to get to Kingston and get my credit situation established, and then get a boat to Port-au-Prince and pay a visit to the ... family estate.\\n\\n Now that he\u0027d seen the colors of these western skies and seas and islands, he didn\u0027t feel nearly as disoriented by the drawing he\u0027d seen in the letter his lawyer had found; the wide porches and windows of the Chandagnac house in Port-au-Prince, with the waving palms and giant tree ferns in the background and the parrots sketched flying overhead, now seemed much more attainable, much less like a drawing of imagined dwellings on the moon.\\n\\n After the death of old Francois Chandagnac, his father, John\u0027s lawyer had located a hitherto unknown Chandagnac cousin in Bayonne, and this cousin had let them have a file of letters from an aunt in Haiti, where John had always vaguely understood he had a grandfather and an uncle. These letters, and then a lot of expensive research in obscure labyrinths of deeds, quitclaims, probate and birth and death records, had finally turned up the information which caused John Chandagnac to terminate his engagement to the daughter of a successful coal merchant, resign from his position with the textile firm and book passage aboard the Vociferous Carmichael to the far side of the globe: John learned that his grandfather in Haiti had, in his will, left his house, sugarcane plantation and considerable fortune to his eldest son Francois, John\u0027s father, and had then died in 1703; and that Francois\u0027 younger half-brother Sebastian, also a resident of Haiti, had produced forged documents to indicate that Francois was dead.\\n\\n On the basis of this fraud, Sebastian had inherited the estate ... and John Chandagnac\u0027s father, not even aware of the inheritance, had gone on giving his marionette performances, in ever-increasing poverty and ill health, until that last lonely night in Brussels in the winter of 1714. His uncle had, in effect, killed his father as well as robbed him. \\n\\n","sourceLink":"https://allnovel.net/on-stranger-tides/page-7.html","bookId":1558,"book":{"id":1558,"title":"On Stranger Tides","description":"Storyline: Aboard the Vociferous Carmichael, puppeteer John Chandagnac is sailing toward Jamaica to claim his stolen birthright from an unscrupulous uncle, when the vessel is captured . . . by pirates! Offered a choice by Captain Phil Davies to join their seafaring band or die, Chandagnac assumes the name John Shandy and a new life as a brigand. But more than swashbuckling sea battles and fabulous plunder await the novice buccaneer on the roiling Caribbean waters–for treachery and powerful vodun sorcery are coins of the realm in this dark new world. And for the love of beautiful, magically imperiled Beth Hurwood, Shandy will set sail on even stranger tides, following the savage, ghost-infested pirate king, Blackbeard, and a motley crew of the living and the dead to the cursed nightmare banks of the fabled Fountain of Youth.\\n","cover":"https://allnovel.net/images/on-stranger-tides.jpg","author":"Tim Powers","type":"Adventure","source":"allnovel","link":"https://allnovel.net/on-stranger-tides.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:21:58 PM"}}
