{"id":67984,"no":13,"title":"Page 13","content":"BOOK TWO Kate and David 1906-1914 Chapter 12 On a hot summer night in 1914, Kate McGregor was working alone in her office at the new Kruger-Brent, Ltd., headquarters building in Johannesburg when she heard the sound of approaching automobiles. She put down the papers she had been studying, walked over to the window and looked out. Two cars of police and a paddy wagon had come to a stop in front of the building. Kate watched, frowning, as half a dozen uniformed policemen leaped from the cars and hurried to cover the two entrances and exits to the building. It was late, and the streets were deserted. Kate caught a wavy reflection of herself in the window. She was a beautiful woman, with her father\u0027s light-gray eyes and her mother\u0027s full figure. There was a knock at the office door and Kate called, \"Come in.\" The door opened and two uniformed men entered. One wore the bars of a superintendent of police. \"What on earth is going on?\" Kate demanded. \"I apologize for disturbing you at this late hour, Miss McGregor. I\u0027m Superintendent Cominsky.\" \"What\u0027s the problem, Superintendent?\" \"We\u0027ve had a report that an escaped killer was seen entering this building a short time ago.\" There was a shocked look on Kate\u0027s face. \"Entering this building?\" \"Yes, ma\u0027am. He\u0027s armed and dangerous.\" Kate said nervously, \"Then I would very much appreciate it, Superintendent, if you would find him and get him out of here.\" \"That\u0027s exactly what we intend to do, Miss McGregor. You haven\u0027t seen or heard anything suspicious, have you?\" \"No. But I\u0027m alone here, and there are a lot of places a person could hide. I\u0027d like you to have your men search this place thoroughly.\" \"We\u0027ll get started immediately, ma\u0027am.\" The superintendent turned and called to the men in the hallway, \"Spread out. Start at the basement and work your way up to the roof.\" He turned to Kate. \"Are any of the offices locked?\" \"I don\u0027t believe so,\" Kate said, \"but if they are, I\u0027ll open them for you.\" Superintendent Cominsky could see how nervous she was, and he did not blame her. She would be even more nervous if she knew how desperate the man was for whom they were looking. \"We\u0027ll find him,\" the superintendent assured Kate. Kate picked up the report she had been working on, but she was unable to concentrate. She could hear the police moving through the building, going from office to office. Would they find him? She shivered. The policemen moved slowly, methodically searching every possible hiding place from the basement to the roof. Forty-five minutes later, Superintendent Cominsky returned to Kate\u0027s office. She looked at his face. \"You didn\u0027t find him.\" \"Not yet, ma\u0027am, but don\u0027t worry - \" \"I am worried, Superintendent. If there is an escaped killer in this building, I want you to find him.\" \"We will, Miss McGregor. We have tracking dogs.\" From the corridor came the sound of barking and a moment later a handler came into the office with two large German shepherds on leashes. \"The dogs have been all over the building, sir. They\u0027ve searched everyplace but this office.\" The superintendent turned to Kate. \"Have you been out of this office anytime in the past hour or so?\" \"Yes. I went to look up some records in the file room. Do you think he could have - ?\" She shuddered. \"I\u0027d like you to check this office, please.\" The superintendent gave a signal and the handler slipped the leashes off the dogs and gave the command, \"Track.\" The dogs went crazy. They raced to a closed door and began barking wildly. \"Oh, my God!\" Kate cried. \"He\u0027s in there!\" The superintendent pulled out his gun. \"Open it,\" he ordered. The two policemen moved to the closet door with drawn guns and pulled the door open. The closet was empty. One of the dogs raced to another door and pawed excitedly at it. \"Where does that door lead?\" Superintendent Cominsky asked. \"To a washroom.\" The two policemen took up places on either side of the door and yanked it open. There was no one inside. The handler was baffled. \"They\u0027ve never behaved this way before.\" The dogs were racing around the room frantically. \"They\u0027ve got the scent,\" the handler said. \"But where is he?\" Both dogs ran to the drawer of Kate\u0027s desk and continued their barking. \"There\u0027s your answer,\" Kate tried to laugh. \"He\u0027s in the drawer.\" Superintendent Cominsky was embarrassed. \"I\u0027m sorry to have troubled you, Miss McGregor.\" He turned to the handler and snapped, \"Take these dogs out of here.\" \"You\u0027re not leaving?\" There was concern in Kate\u0027s voice. \"Miss McGregor, I can assure you you\u0027re perfectly safe. My men have covered every inch of this building. You have my personal guarantee that he\u0027s not here. I\u0027m afraid it was a false alarm. My apologies.\" Kate swallowed. \"You certainly know how to bring excitement to a woman\u0027s evening.\" Kate stood looking out the window, watching the last of the police vehicles drive away. When they were out of sight, she opened her desk drawer and pulled out a blood-stained pair of canvas shoes. She carried them down the corridor to a door marked Private, Authorized Personnel Only, and entered. The room was bare except for a large, locked, walk-in safe built into the wall, the vault where Kruger-Brent, Ltd., stored its diamonds before shipping. Quickly, Kate dialed the combination on the safe and pulled open the giant door. Dozens of metal safe-deposit boxes were built into the sides of the vault, all crammed with diamonds. In the center of the room, lying on the floor half-conscious, was Banda. Kate knelt beside him. \"They\u0027ve gone.\" Banda slowly opened his eyes and managed a weak grin. \"If I had a way out of this vault, do you know how rich I\u0027d be, Kate?\" Kate carefully helped him to his feet. He winced with pain as she touched his arm. She had wrapped a bandage around it, but blood was seeping through. \"Can you put your shoes on?\" She had taken them from him earlier, and, to confuse the tracking dogs she knew would be brought in, she had walked around her office in them and then hidden them in her drawer. Now Kate said, \"Come on. We have to get you out of here.\" Banda shook his head. \"I\u0027ll make it on my own. If they catch you helping me, you\u0027ll be in more trouble than you can handle.\" \"Let me worry about that.\" Banda took a last look around the vault. \"Do you want any samples?\" Kate asked. \"You can help yourself.\" Banda looked at her and saw that she was serious. \"Your daddy made me that offer once, a long time ago.\" Kate smiled wryly. \"I know.\" \"I don\u0027t need money. I just have to leave town for a while.\" \"How do you think you\u0027re going to get out of Johannesburg?\" \"I\u0027ll find a way.\" \"Listen to me. The police have roadblocks out by now. Every exit from the city will be watched. You won\u0027t have a chance by yourself.\" He said stubbornly, \"You\u0027ve done enough.\" He had managed to put his shoes on. He was a forlorn-looking figure, standing there in a torn, bloodied shirt and jacket. His face was seamed and his hair was gray, but when Kate looked at him she saw the tall, handsome figure she had first met as a child. \"Banda, if they catch you, they\u0027ll kill you,\" Kate said quietly. \"You\u0027re coming with me.\" She knew she was right about the roadblocks. Every exit from Johannesburg would be guarded by police patrols. Banda\u0027s capture was a top priority and the authorities had orders to bring him in dead or alive. The railroad stations and roads would be watched. \"I hope you have a better plan than your daddy had,\" Banda said. His voice was weak. Kate wondered how much blood he had lost. \"Don\u0027t talk. Save your strength. Just leave everything to me.\" Kate sounded more confident than she felt. Banda\u0027s life was in her hands, and she could not bear it if anything happened to him. She wished again, for the hundredth time, that David was not away. Well, she would simply have to manage without him. \"I\u0027m going to bring my automobile around to the alley,\" Kate said. \"Give me ten minutes, then come outside. I\u0027ll have the back door of the car open. Get in and lie on the floor. There will be a blanket to cover yourself with.\" \"Kate, they\u0027re going to search every automobile leaving the city. If - \" \"We\u0027re not going by automobile. There\u0027s a train leaving for Cape Town at eight A.M. I ordered my private car connected to it.\" \"You\u0027re getting me out of here in your private railroad car?\" \"That\u0027s right.\" Banda managed a grin. \"You McGregors really like excitement.\" Thirty minutes later, Kate drove into the railroad yards. Banda was on the floor of the backseat, concealed by a blanket. They had had no trouble passing the roadblocks in the city, but now as Kate\u0027s car turned into the train yards, a light suddenly flashed on, and Kate saw that her way was blocked by several policemen. A familiar figure walked toward Kate\u0027s car. \"Superintendent Cominsky!\" He registered surprise. \"Miss McGregor, what are you doing here?\" Kate gave him a quick, apprehensive smile. \"You\u0027ll think I\u0027m just a silly, weak female, Superintendent, but to tell you the truth, what happened back at the office scared the wits out of me. I decided to leave town until you catch this killer you\u0027re looking for. Or have you found him?\" \"Not yet, ma\u0027am, but we will. I have a feeling he\u0027ll make for these railroad yards. Wherever he runs, we\u0027ll catch him.\" \"I certainly hope so!\" \"Where are you headed?\" \"My railway car is on a siding up ahead. I\u0027m taking it to Cape Town.\" \"Would you like one of my men to escort you?\" \"Oh, thank you, Superintendent, but that won\u0027t be necessary. Now that I know where you and your men are, I\u0027ll breathe a lot easier, believe me.\" Five minutes later, Kate and Banda were safely inside the private railway car. It was pitch black. \"Sorry about the dark,\" Kate said. \"I don\u0027t want to light any lamps.\" She helped Banda onto a bed. \"You\u0027ll be fine here until morning. When we start to pull out, you\u0027ll hide out in the washroom.\" Banda nodded. \"Thank you.\" Kate drew the shades. \"Have you a doctor who will take care of you when we get to Cape Town?\" He looked up into her eyes. \"We?\" \"You didn\u0027t think I was going to let you travel alone while I missed all the fun?\" Banda threw back his head and laughed. She\u0027s her father\u0027s daughter, all right. As dawn was breaking, an engine pulled up to the private railroad car and shunted it onto the main track in back of the train that was leaving for Cape Town. The car rocked back and forth as the connection was made. At exactly eight o\u0027clock, the train pulled out of the station. Kate had left word that she did not wish to be disturbed. Banda\u0027s wound was bleeding again, and Kate attended to it. She had not had a chance to talk to Banda since earlier that evening, when he had stumbled half-dead into her office. Now she said, \"Tell me what happened, Banda.\" Banda looked at her and thought, Where can I begin? How could he explain to her the trekboers who pushed the Bantus from their ancestral land? Had it started with them? Or had it started with the giant Oom Paul Kruger, President of the Transvaal, who said in a speech to the South African Parliament, \"We must be the lords over the blacks and let them be a subject race...\" Or had it begun with the great empire-builder Cecil Rhodes, whose motto was, \"Africa for the whites?\" How could he sum up the history of his people in a sentence? He thought of a way. \"The police murdered my son,\" Banda said. The story came pouring out. Banda\u0027s older son, Ntombenthle, was attending a political rally when the police charged in to break it up. Some shots were fired, and a riot began. Ntombenthle was arrested, and the next morning he was found hanged in his cell. \"They said it was suicide,\" Banda told Kate. \"But I know my son. It was murder.\" \"My God, he was so young,\" Kate breathed. She thought of all the times they had played together, laughed together. Ntombenthle had been such a handsome boy. \"I\u0027m sorry, Banda. I\u0027m so sorry. But why are they after you?\" \"After they killed him I began to rally the blacks. I had to fight back, Kate. I couldn\u0027t just sit and do nothing. The police called me an enemy of the state. They arrested me for a robbery I did not commit and sentenced me to prison for twenty years. Four of us made a break. A guard was shot and killed, and they\u0027re blaming me. I\u0027ve never carried a gun in my life.\" \"I believe you,\" Kate said. \"The first thing we have to do is get you somewhere where you\u0027ll be safe.\" \"I\u0027m sorry to involve you in all this.\" \"You didn\u0027t involve me in anything. You\u0027re my friend.\" He smiled. \"You know the first white man I ever heard call me friend? Your daddy.\" He sighed. \"How do you think you\u0027re going to sneak me off the train at Cape Town?\" \"We\u0027re not going to Cape Town.\" \"But you said - \" \"I\u0027m a woman. I have a right to change my mind.\" In the middle of the night when the train stopped at the station at Worcester, Kate arranged to have her private railroad car disconnected and shunted to a siding. When Kate woke up in the morning, she went over to Banda\u0027s cot. It was empty. Banda was gone. He had refused to compromise her any further. Kate was sorry, but she was sure he would be safe. He had many friends to take care of him. David will be proud of me, Kate thought. \"I can\u0027t believe you could be so stupid!\" David roared, when Kate returned to Johannesburg and told him the news. \"You not only jeopardized your own safety, but you put the company in danger. If the police had found Banda here, do you know what they would have done?\" Kate said defiantly, \"Yes. They would have killed him.\" David rubbed his forehead in frustration. \"Don\u0027t you understand anything?\" \"You\u0027re bloody right, I do! I understand that you\u0027re cold and unfeeling.\" Her eyes were ablaze with fury. \"You\u0027re still a child.\" She raised her hand to strike him, and David grabbed her arms. \"Kate, you\u0027ve got to control your temper.\" The words reverberated in Kate\u0027s head. Kate, you\u0027ve got to learn to control your temper... It was so long ago. She was four years old, in the middle of a fistfight with a boy who had dared tease her. When David appeared, the boy ran away. Kate started to chase him, and David grabbed her. \"Hold it, Kate. You\u0027ve got to learn to control your temper. Young ladies don\u0027t get into fistfights.\" \"I\u0027m not a young lady,\" Kate snapped. \"Let go of me.\" David released her. The pink frock she was wearing was muddied and torn, and her cheek was bruised. \"We\u0027d better get you cleaned up before your mother sees you,\" David told her. Kate looked after the retreating boy with regret. \"I could have licked him if you had left me alone.\" David looked down into the passionate little face and laughed. \"You probably could have.\" Mollified, Kate allowed him to pick her up and carry her into her house. She liked being in David\u0027s arms. She liked everything about David. He was the only grown-up who understood her. Whenever he was in town, he spent time with her. In relaxed moments, Jamie had told young David about his adventures with Banda, and now David told the stories to Kate. She could not get enough of them. \"Tell me again about the raft they built.\" And David would tell her. \"Tell me about the sharks...Tell me about the sea mis...Tell me about the day...\" Kate did not see very much of her mother. Margaret was too involved in running the affairs of Kruger-Brent, Ltd. She did it for Jamie. Margaret talked to Jamie every night, just as she had during the year before he died. \"David is such a great help, Jamie, and he\u0027ll be around when Kate\u0027s running the company. I don\u0027t want to worry you, but I don\u0027t know what to do with that child...\" Kate was stubborn and willful and impossible. She refused to obey her mother or Mrs. Talley. If they chose a dress for her to wear, Kate would discard it for another. She would not eat properly. She ate what she wanted to, when she wanted to, and no threat or bribe could sway her. When Kate was forced to go to a birthday party, she found ways to disrupt it. She had no girl friends. She refused to go to dancing class and instead spent her time playing rugby with teen-age boys. When Kate finally started school, she set a record for mischief. Margaret found herself going to see the headmistress at least once a month to persuade her to forgive Kate and let her remain in school. \"I don\u0027t understand her, Mrs. McGregor,\" the headmistress sighed. \"She\u0027s extremely bright, but she rebels against simply everything. I don\u0027t know what to do with her.\" Neither did Margaret. The only one who could handle Kate was David. \"I understand you\u0027re invited to a birthday party this afternoon,\" David said. \"I hate birthday parties.\" David stooped down until he was at her eye level. \"I know you do, Kate. But the father of the little girl who\u0027s having the birthday party is a friend of mine. It will make me look bad if you don\u0027t attend and behave like a lady.\" Kate stared at him. \"Is he a good friend of yours?\" \"Yes.\" \"I\u0027ll go.\" Her manners that afternoon were impeccable. \"I don\u0027t know how you do it,\" Margaret told David. \"It\u0027s magic.\" \"She\u0027s just high-spirited,\" David laughed. \"She\u0027ll grow out of it. The important thing is to be careful not to break that spirit.\" \"I\u0027ll tell you a secret,\" Margaret said grimly, \"half the time I\u0027d like to break her neck.\" When Kate was ten, she said to David, \"I want to meet Banda.\" David looked at her in surprise. \"I\u0027m afraid that\u0027s not possible, Kate. Banda\u0027s farm is a long way from here.\" \"Are you going to take me there, David, or do you want me to go by myself?\" The following week David took Kate to Banda\u0027s farm. It was a good-sized piece of land, two morgens, and on it Banda raised wheat, sheep and ostriches. The living accommodations were circular huts with walls made of dried mud. Poles supported a cone-shaped roof covered with thatches. Banda stood in front, watching as Kate and David drove up and got out of the carriage. Banda looked at the gangling, serious-faced girl at David\u0027s side and said, \"I\u0027d have known you were Jamie McGregor\u0027s daughter.\" \"And I\u0027d have known you were Banda,\" Kate said gravely. \"I came to thank you for saving my father\u0027s life.\" Banda laughed. \"Someone\u0027s been telling you stories. Come in and meet my family.\" Banda\u0027s wife was a beautiful Bantu woman named Ntame. Banda had two sons, Ntombenthle, seven years older than Kate, and Magena, six years older. Ntombenthle was a miniature of his father. He had the same handsome features and proud bearing and an inner dignity. Kate spent the entire afternoon playing with the two boys. They had dinner in the kitchen of the small, neat farmhouse. David felt uncomfortable eating with a black family. He respected Banda, but it was traditional that there was no socializing between the two races. In addition to that, David was concerned about Banda\u0027s political activities. There were reports that he was a disciple of John Tengo Javabu, who was fighting for drastic social changes. Because mine owners could not get enough natives to work for them, the government had imposed a tax of ten shillings on all natives who did not work as mine laborers, and there were riots all over South Africa. In the late afternoon, David said, \"We\u0027d better get started home, Kate. We have a long ride.\" \"Not yet.\" Kate turned to Banda. \"Tell me about the sharks...\" From that time on, whenever David was in town, Kate made him take her to visit Banda and his family. David\u0027s assurance that Kate would grow out of her high-spiritedness showed no signs of coming to pass. If anything, she grew more willful every day. She flatly refused to take part in any of the activities that other girls her age participated in. She insisted on going into the mines with David, and he took her hunting and fishing and camping. Kate adored it. One day when Kate and David were fishing the Vaal, and Kate gleefully pulled in a trout larger than anything David had caught, he said, \"You should have been born a boy.\" She turned to him in annoyance. \"Don\u0027t be silly, David. Then I couldn\u0027t marry you.\" David laughed. \"We are going to be married, you know.\" \"I\u0027m afraid not, Kate. I\u0027m twenty-two years older than you. Old enough to be your father. You\u0027ll meet a boy one day, a nice young man - \" \"I don\u0027t want a nice young man,\" she said wickedly. \"I want you.\" \"If you\u0027re really serious,\" David said, \"then I\u0027ll tell you the secret to a man\u0027s heart.\" \"Tell me!\" Kate said eagerly. \"Through his stomach. Clean that trout and let\u0027s have lunch.\" There was not the slightest doubt in Kate\u0027s mind that she was going to marry David Blackwell. He was the only man in the world for her. Once a week Margaret invited David to dinner at the big house. As a rule, Kate preferred to eat dinner in the kitchen with the servants, where she did not have to mind her manners. But on Friday nights when David came, Kate sat in the big dining room. David usually came alone, but occasionally he would bring a female guest and Kate would hate her instantly. Kate would get David alone for a moment and say, with sweet innocence, \"I\u0027ve never seen hair that shade of blond,\" or, \"She certainly has peculiar taste in dresses, hasn\u0027t she?\" or, \"Did she use to be one of Madam Agnes\u0027s girls?\" When Kate was fourteen, her headmistress sent for Margaret. \"I run a respectable school, Mrs. McGregor. I\u0027m afraid your Kate is a bad influence.\" Margaret sighed. \"What\u0027s she done now?\" \"She\u0027s teaching the other children words they\u0027ve never heard before.\" Her face was grim. \"I might add, Mrs. McGregor, that I\u0027ve never heard some of the words before. I can\u0027t imagine where the child picked them up.\" Margaret could. Kate picked them up from her street friends. Well, Margaret decided, it is time to end all that. The headmistress was saying, \"I do wish you would speak to her. We\u0027ll give her another chance, but - \" \"No. I have a better idea. I\u0027m going to send Kate away to school.\" When Margaret told David her idea, he grinned. \"She\u0027s not going to like that.\" \"I can\u0027t help it. Now the headmistress is complaining about the language Kate uses. She gets it from those prospectors she\u0027s always following around. My daughter\u0027s starting to sound like them, look like them and smell like them. Frankly, David, I don\u0027t understand her at all. I don\u0027t know why she behaves as she does. She\u0027s pretty, she\u0027s bright, she\u0027s - \" \"Maybe she\u0027s too bright.\" \"Well, too bright or not, she\u0027s going away to school.\" When Kate arrived home that afternoon, Margaret broke the news to her. Kate was furious. \"You\u0027re trying to get rid of me!\" \"Of course I\u0027m not, darling. I just think you\u0027d be better off - \" \"I\u0027m better off here. All my friends are here. You\u0027re trying to separate me from my friends.\" \"If you\u0027re talking about that riffraff you - \" \"They\u0027re not riffraff. They\u0027re as good as anybody.\" \"Kate, I\u0027m not going to argue with you. You\u0027re going away to a boarding school for young ladies, and that\u0027s that.\" \"I\u0027ll kill myself,\" Kate promised. \"All right, darling. There\u0027s a razor upstairs, and if you look around, I\u0027m sure you\u0027ll find various poisons in the house.\" Kate burst into tears. \"Please don\u0027t do this to me, Mother.\" Margaret took her in her arms. \"It\u0027s for your own good, Kate. You\u0027ll be a young woman soon. You\u0027ll be ready for marriage. No man is going to marry a girl who talks and dresses and behaves the way you do.\" \"That\u0027s not true,\" Kate sniffled. \"David doesn\u0027t mind.\" \"What does David have to do with this?\" \"We\u0027re going to be married.\" Margaret sighed. \"I\u0027ll have Mrs. Talley pack your things.\" There were half a dozen good English boarding schools for young girls. Margaret decided that Cheltenham, in Gloucestershire, was best suited for Kate. It was a school noted for its rigid discipline. It was set on acres of land surrounded by high battlements and, according to its charter, was founded for the daughters of noblemen and gentlemen. David did business with the husband of the headmistress, Mrs. Keaton, and he had no trouble arranging for Kate to be enrolled there. When Kate heard where she was going, she exploded anew. \"I\u0027ve heard about that school! It\u0027s awful. I\u0027ll come back like one of those stuffed English dolls. Is that what you\u0027d like?\" \"What I would like is for you to learn some manners,\" Margaret told her. \"I don\u0027t need manners. I\u0027ve got brains.\" \"That\u0027s not the first thing a man looks for in a woman,\" Margaret said dryly, \"and you\u0027re becoming a woman.\" \"I don\u0027t want to become a woman,\" Kate screamed. \"Why the bloody hell can\u0027t you just leave me alone?\" \"I will not have you using that language.\" And so it went until the morning arrived when Kate was to leave. Since David was going to London on a business trip, Margaret asked, \"Would you mind seeing that Kate gets to school safely? The Lord only knows where she\u0027ll end up if she goes on her own.\" \"I\u0027ll be happy to,\" David said. \"You! You\u0027re as bad as my mother! You can\u0027t wait to get rid of me.\" David grinned. \"You\u0027re wrong. I can wait.\" They traveled by private railway car from Klipdrift to Cape Town and from there by ship to Southampton. The journey took four weeks. Kate\u0027s pride would not let her admit it, but she was thrilled to be traveling with David. It\u0027s like a honeymoon, she thought, except that we\u0027re not married. Not yet. Aboard ship, David spent a great deal of time working in his stateroom. Kate curled up on the couch, silently watching him, content to be near him. Once she asked, \"Don\u0027t you get bored working on all those figures, David?\" He put down his pen and looked at her. \"They\u0027re not just figures, Kate. They\u0027re stories.\" \"What kind of stories?\" \"If you know how to read them, they\u0027re stories about companies we\u0027re buying or selling, people who work for us. Thousands of people all over the world earn a living because of the company your father founded.\" \"Am I anything like my father?\" \"In many ways, yes. He was a stubborn, independent man.\" \"Am I a stubborn, independent woman?\" \"You\u0027re a spoiled brat. The man who marries you is going to have one hell of a life.\" Kate smiled dreamily. Poor David. In the dining room, on their last night at sea, David asked, \"Why are you so difficult, Kate?\" \"Am I?\" \"You know you are. You drive your poor mother crazy.\" Kate put her hand over his. \"Do I drive you crazy?\" David\u0027s face reddened. \"Stop that. I don\u0027t understand you.\" \"Yes, you do.\" \"Why can\u0027t you be like other girls your age?\" \"I\u0027d rather die first. I don\u0027t want to be like anybody else.\" \"God knows you\u0027re not!\" \"You won\u0027t marry anyone else until I\u0027m grown up enough for you, will you, David? I\u0027ll get older as fast as I can. I promise. Just don\u0027t meet anybody you love, please.\" He was touched by her earnestness. He took her hand in his and said, \"Kate, when I get married, I\u0027d like my daughter to be exactly like you.\" Kate rose to her feet and said in a voice that rang through the dining salon, \"You can bloody well go to hell, David Blackwell!\" And she stormed out of the room, as everyone stared. They had three days together in London, and Kate loved every minute of it. \"I have a treat for you,\" David told her. \"I got two tickets for Mrs. Wiggs of the Cabbage Patch.\" \"Thank you, David. I want to go to the Gaiety.\" \"You can\u0027t. That\u0027s a - a music-hall revue. That\u0027s not for you.\" \"I won\u0027t know until I see it, will I?\" she said stubbornly. They went to the Gaiety. Kate loved the look of London. The mixture of motorcars and carriages, the ladies beautifully dressed in lace and tulle and light satins and glittering jewelry, and the men in dinner clothes with pique waistcoats and white shirtfronts. They had dinner at the Ritz, and a late supper at the Savoy. And when it was time to leave, Kate thought, We\u0027ll come back here. David and I will come back here. When they arrived at Cheltenham, they were ushered into the office of Mrs. Keaton. \"I want to thank you for enrolling Kate,\" David said. \"I\u0027m sure we\u0027ll enjoy having her. And it\u0027s a pleasure to accommodate a friend of my husband.\" At that moment, Kate knew she had been deceived. It was David who had wanted her sent away and had arranged for her to come here. She was so furious and hurt she refused to say good-bye to him.","sourceLink":"https://allnovel.net/master-of-the-game/page-13.html","bookId":2358,"book":{"id":2358,"title":"Master of the Game","description":"Storyline: WHO IS KATE BLACKWELL? She is the symbol of success, the beautiful woman who parlayed her inheritance into an international conglomerate. Winner of a unique position among the wealthy and world-renowned. And she\u0027s a survivor, indomitable as her father, the man who returned from the edge of death to wrench a fortune in diamonds from the bleak South African earth. Now, celebrating her ninetieth birthday, Kate surveys the family she has manipulated, dominated, and loved: the fair and the grotesque, the mad and the mild, the good and the evil -- her winnings in life. Is she the... MASTER OF THE GAME?","cover":"https://allnovel.net/images/master-of-the-game.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/master-of-the-game.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
