{"id":68002,"no":31,"title":"Page 31","content":"Eve had planned the honeymoon. It was expensive, but she told George, \"You mustn\u0027t stint on anything.\"\n She sold three pieces of jewelry she had acquired from an ardent admirer and gave the money to George.\n \"I appreciate this, Eve,\" he said. \"I - \"\n \"I\u0027ll get it back.\"\n The honeymoon was perfection. George and Alexandra stayed at Round Hill on Montego Bay, in the northern part of Jamaica. The lobby of the hotel was a small, white building set in the center of approximately two dozen beautiful, privately owned bungalows that sprawled down a hill toward the clear, blue sea. The Mellises had the Noel Coward bungalow, with its own swimming pool and a maid to prepare their breakfast, which they ate in the open-air dining room. George rented a small boat and they went sailing and fishing. They swam and read and played backgammon and made love. Alexandra did everything she could think of to please George in bed, and when she heard him moaning at the climax of their lovemaking, she was thrilled that she was able to bring him such pleasure.\n On the fifth day, George said, \"Alex, I have to drive into Kingston on business. The firm has a branch office there and they asked me to look in on it.\"\n \"Fine,\" Alexandra said. \"I\u0027ll go with you.\"\n He frowned. \"I\u0027d love you to, darling, but I\u0027m expecting an overseas call. You\u0027ll have to stay and take the message.\"\n Alexandra was disappointed. \"Can\u0027t the desk take it?\"\n \"It\u0027s too important. I can\u0027t trust them.\"\n \"All right, then. Of course I\u0027ll stay.\"\n George rented a car and drove to Kingston. It was late afternoon when he arrived. The streets of the capital city were swarming with colorfully dressed tourists from the cruise ships, shopping at the straw market and in small bazaars. Kingston is a city of commerce, with refineries, warehouses and fisheries, but with its landlocked harbor it is also a city of beautiful old buildings and museums and libraries.\n George was interested in none of these things. He was filled with a desperate need that had been building up in him for weeks and had to be satisfied. He walked into the first bar he saw and spoke to the bartender. Five minutes later George was accompanying a fifteen-year-old black prostitute up the stairs of a cheap hotel. He was with her for two hours. When George left the room, he left alone, got into the car and drove back to Montego Bay, where Alexandra told him the urgent telephone call he was expecting had not come through.\n The following morning the Kingston newspapers reported that a tourist had beaten up and mutilated a prostitute, and that she was near death.\n At Hanson and Hanson, the senior partners were discussing George Mellis. There had been complaints from a number of clients about the way he handled their securities accounts. A decision had been reached to fire him. Now, however, there were second thoughts.\n \"He\u0027s married to one of Kate Blackwell\u0027s granddaughters,\" a senior partner said. \"That puts things in a new light.\"\n A second partner added, \"It certainly does. If we could acquire the Blackwell account...\"\n The greed in the air was almost palpable. They decided George Mellis deserved another chance.\n When Alexandra and George returned from their honeymoon, Kate told them, \"I\u0027d like you to move in here with me. This is an enormous house, and we wouldn\u0027t be in one another\u0027s way. You - \"\n George interrupted. \"That\u0027s very kind of you,\" he said. \"But I think it would be best if Alex and I had our own place.\"\n He had no intention of living under the same roof with the old woman hovering over him, spying on his every move.\n \"I understand,\" Kate replied. \"In that case, please let me buy a house for you. That will be my wedding present.\"\n George put his arms around Kate and hugged her. \"That\u0027s very generous of you.\" His voice was hoarse with emotion. \"Alex and I accept with gratitude.\"\n \"Thank you, Gran,\" Alexandra said. \"We\u0027ll look for a place not too far away.\"\n \"Right,\" George agreed. \"We want to be close enough to keep an eye on you. You\u0027re a damned attractive woman, you know!\"\n Within a week they found a beautiful old brownstone near the park, a dozen blocks away from the Blackwell mansion. It was a charming three-story house, with a master bedroom, two guest bedrooms, servants\u0027 quarters, a huge old kitchen, a paneled dining room, an elegant living room and a library.\n \"You\u0027re going to have to do the decorating by yourself, darling,\" George told Alexandra. \"I\u0027m all tied up with clients.\"\n The truth was that he spent almost no time at the office, and very little time with clients. His days were occupied with more interesting matters. The police were receiving a string of assault reports from male and female prostitutes and lonely women who visited singles\u0027 bars. The victims described their attacker as handsome and cultured, and coming from a foreign background, possibly Latin. Those who were willing to look at police mug shots were unable to come up with an identification.\n Eve and George were having lunch in a small downtown restaurant where there was no chance of their being recognized.\n \"You\u0027ve got to get Alex to make a new will without Kate knowing about it.\"\n \"How the hell do I do that?\"\n \"I\u0027m going to tell you, darling...\"\n The following evening George met Alexandra for dinner at Le Plaisir, one of New York\u0027s finest French restaurants. He was almost thirty minutes late.\n Pierre Jourdan, the owner, escorted him to the table where Alexandra was waiting. \"Forgive me, angel,\" George said breathlessly. \"I was at my attorneys\u0027, and you know how they are. They make everything so complicated.\"\n Alexandra asked, \"Is anything wrong, George?\"\n \"No. I just changed my will.\" He took her hands in his. \"If anything should happen to me now, everything I have will belong to you.\"\n \"Darling, I don\u0027t want - \"\n \"Oh, it\u0027s not much compared to the Blackwell fortune, but it would keep you very comfortably.\"\n \"Nothing\u0027s going to happen to you. Not ever.\"\n \"Of course not, Alex. But sometimes life plays funny tricks. These things aren\u0027t pleasant to face, but it\u0027s better to plan ahead and be prepared, don\u0027t you think?\"\n She sat there thoughtfully for a moment. \"I should change my will, too, shouldn\u0027t I?\"\n \"What for?\" He sounded surprised.\n \"You\u0027re my husband. Everything I have is yours.\"\n He withdrew his hand. \"Alex, I don\u0027t give a damn about your money.\"\n \"I know that, George, but you\u0027re right. It is better to look ahead and be prepared.\" Her eyes filled with tears. \"I know I\u0027m an idiot, but I\u0027m so happy that I can\u0027t bear to think of anything happening to either of us. I want us to go on forever.\"\n \"We will,\" George murmured.\n \"I\u0027ll talk to Brad Rogers tomorrow about changing my will.\"\n He shrugged. \"If that\u0027s what you wish, darling.\" Then, as an afterthought, \"Come to think of it, it might be better if my lawyer made the change. He\u0027s familiar with my estate. He can coordinate everything.\"\n \"Whatever you like. Gran thinks - \"\n He caressed her cheek. \"Let\u0027s keep your grandmother out of this. I adore her, but don\u0027t you think we should keep our personal affairs personal?\"\n \"You\u0027re right, darling. I won\u0027t say anything to Gran. Could you make an appointment for me to see your attorney tomorrow?\"\n \"Remind me to call him. Now, I\u0027m starved. Why don\u0027t we start with the crab...?\"\n One week later George met Eve at her apartment.\n \"Did Alex sign the new will?\" Eve asked.\n \"This morning. She inherits her share of the company next week on her birthday.\"\n The following week, 49 percent of the shares of Kruger-Brent, Ltd., were transferred to Alexandra. George called to tell Eve the news. She said, \"Wonderful! Come over tonight. We\u0027ll celebrate.\"\n \"I can\u0027t. Kate\u0027s giving a birthday party for Alex.\"\n There was a silence. \"What are they serving?\"\n \"How the hell do I know?\"\n \"Find out.\" The line went dead.\n Forty-five minutes later George called Eve back. \"I don\u0027t know why you\u0027re so interested in the menu,\" he said nastily, \"since you aren\u0027t invited to the party, but it\u0027s Coquille Saint-Jacques, Chateaubriand, a bibb lettuce salad, Brie, cappuccino and a birthday cake with Alex\u0027s favorite ice cream, Neapolitan. Satisfied?\"\n \"Yes, George. I\u0027ll see you tonight.\"\n \"No, Eve. There\u0027s no way I can walk out in the middle of Alex\u0027s - \"\n \"You\u0027ll think of something.\"\n God damn the bitch! George hung up the phone and looked at his watch. God damn everything! He had an appointment with an important client he had stood up twice already. Now he was late. He knew the partners were keeping him on only because he had married into the Blackwell family. He could not afford to do anything to jeopardize his position. He had created an image for Alexandra and Kate, and it was imperative that nothing destroy that. Soon he would not need any of them.\n He had sent his father a wedding invitation, and the old man had not even bothered to reply. Not one word of congratulations. I never want to see you again, his father had told him. You\u0027re dead, you understand? Dead Well, his father was in for a surprise. The prodigal son was going to come to life again.\n Alexandra\u0027s twenty-third birthday party was a great success. There were forty guests. She had asked George to invite some of his friends, but he had demurred. \"It\u0027s your party, Alex,\" he said. \"Let\u0027s just have your friends.\"\n The truth was that George had no friends. He was a loner, he told himself proudly. People who were dependent on other people were weaklings. He watched as Alexandra blew out the candles on her cake and made a silent wish. He knew the wish involved him, and he thought, You should have wished for a longer life, darling. He had to admit that Alexandra was exquisite looking. She was wearing a long white chiffon dress with delicate silver slippers and a diamond necklace, a present from Kate. The large, pear-shaped stones were strung together on a platinum chain, and they sparkled in the candlelight.\n Kate looked at them and thought, I remember our first anniversary, when David put that necklace on me and told me how much he loved me.\n And George thought, That necklace must be worth a hundred and fifty thousand dollars.\n George had been aware all evening that several of Alexandra\u0027s female guests were eyeing him, smiling at him invitingly, touching him as they talked to him. Horny bitches, he thought contemptuously. Under other circumstances, he might have been tempted to risk it, but not with Alexandra\u0027s friends. They might not dare complain to Alexandra, but there was a chance they could go to the police. No, things were moving along too smoothly to take any unnecessary chances.\n At one minute before ten o\u0027clock, George positioned himself near the telephone. When it rang a minute later, he picked it up. \"Hello.\"\n \"Mr. Mellis?\"\n \"Yes.\"\n \"This is your answering service. You asked me to call you at ten o\u0027clock.\"\n Alexandra was standing near him. He looked over at her and frowned. \"What time did he call?\"\n \"Is this Mr. Mellis?\"\n \"Yes.\"\n \"You left a ten o\u0027clock call, sir.\"\n Alexandra was at his side.\n \"Very well,\" he said into the phone. \"Tell him I\u0027m on my way. I\u0027ll meet him at the Pan Am Clipper Club.\"\n George slammed the phone down.\n \"What\u0027s the matter, darling?\"\n He turned to Alexandra. \"One of the idiot partners is on his way to Singapore and he left some contracts at the office that he needs to take with him. I\u0027ve got to pick them up and get them to him before his plane leaves.\"\n \"Now?\" Alexandra\u0027s voice was filled with dismay. \"Can\u0027t someone else do it?\"\n \"I\u0027m the only one they trust,\" George sighed. \"You\u0027d think I was the only capable one in the whole office.\" He put his arms around her. \"I\u0027m sorry, darling. Don\u0027t let me spoil your party. You go on and I\u0027ll get back as soon as I can.\"\n She managed a smile. \"I\u0027ll miss you.\"\n Alexandra watched him go, then looked around the room to make sure all her guests were enjoying themselves. She wondered what Eve was doing on their birthday.\n Eve opened the door to let George in. \"You managed,\" she said. \"You\u0027re such a clever man.\"\n \"I can\u0027t stay, Eve. Alex is - \"\n She took his hand. \"Come, darling. I have a surprise for you.\" She led him into the small dining room. The table was set for two, with beautiful silver and white napery and lighted candles in the center of the table.\n \"What\u0027s this for?\"\n \"It\u0027s my birthday, George.\"\n \"Of course,\" he said lamely. \"I - I\u0027m afraid I didn\u0027t bring you a present.\"\n She stroked his cheek. \"Yes you did, love. You\u0027ll give it to me later. Sit down.\"\n \"Thanks,\" George said. \"I couldn\u0027t eat anything. I just had a big dinner.\"\n \"Sit down.\" There was no inflection to her voice.\n George looked into her eyes, and sat down.\n Dinner consisted of Coquille Saint-Jacques, Chateaubriand, a bibb lettuce salad, Brie, cappuccino and a birthday cake with Neapolitan ice cream.\n Eve sat across from him, watching George force the food down. \"Alex and I have always shared everything,\" Eve told him. \"Tonight I\u0027m sharing her birthday dinner. But next year there will be just one of us having a birthday party. The time has come, darling, for my sister to have an accident. And after that, poor old Gran is going to die of grief. It\u0027s going to be all ours, George. Now, come into the bedroom and give me my birthday present.\"\n He had been dreading this moment. He was a man, strong and vigorous, and Eve dominated him and made him feel impotent. She had him undress her slowly, and then she undressed him and skillfully excited him to an erection.\n \"There you are, darling.\" She got astride him and began slowly moving her hips. \"Ah, that feels so good... You can\u0027t have an orgasm, can you, poor baby? Do you know why? Because you\u0027re a freak. You don\u0027t like women, do you, George? You only enjoy hurting them. You\u0027d like to hurt me, wouldn\u0027t you? Tell me you\u0027d like to hurt me.\"\n \"I\u0027d like to kill you.\"\n Eve laughed. \"But you won\u0027t, because you want to own the company as much as I do... You\u0027ll never hurt me, George, be cause if anything ever happens to me, a friend of mine is holding a letter that will be delivered to the police.\"\n He did not believe her. \"You\u0027re bluffing.\"\n Eve raked a long, sharp nail down his naked chest. \"There\u0027s only one way you can find out, isn\u0027t there?\" she taunted.\n And he suddenly knew she was telling the truth. He was never going to be able to get rid of her! She was always going to be there to taunt him, to enslave him. He could not bear the idea of being at this bitch\u0027s mercy for the rest of his life. And something inside him exploded. A red film descended over his eyes, and from that moment on he had no idea what he was doing. It was as though someone outside himself was controlling him. Everything happened in slow motion. He remembered shoving Eve off him, pulling her legs apart and her cries of pain. He was battering at something over and over, and it was indescribably wonderful. The whole center of his being was racked with a long spasm of unbearable bliss, and then another, and another, and he thought, Oh, God! I\u0027ve waited so long for this. From somewhere in the far distance, someone was screaming. The red film slowly started to clear, and he looked down. Eve was lying on the bed, covered with blood. Her nose was smashed in, her body was covered with bruises and cigarette burns and her eyes were swollen shut. Her jaw was broken, and she was whimpering out of the side of her mouth. \"Stop it, stop it, stop it...\"\n George shook his head to clear it. As the reality of the situation hit him, he was filled with sudden panic. There was no way he could ever explain what he had done. He had thrown everything away. Everything!\n He leaned over her. \"Eve?\"\n She opened one swollen eye. \"Doctor...Get...a...doc tor... \"Each word was a drop of pain. \"Harley...John Harley.\"\n All George Mellis said on the phone was, \"Can you come right away? Eve Blackwell has had an accident.\"\n When Dr. John Harley walked into the room, he took one look at Eve and the blood-spattered bed and walls and said, \"Oh, my God!\" He felt Eve\u0027s fluttering pulse, and turned to George. \"Call the police. Tell them we need an ambulance.\"\n Through the mist of pain, Eve whispered, \"John...\"\n John Harley leaned over the bed. \"You\u0027re going to be all right. We\u0027ll get you to the hospital.\"\n She reached out and found his hand. \"No police...\"\n \"I have to report this. I - \"\n Her grip tightened. \"No...police...\"\n He looked at her shattered cheekbone, her broken jaw and the cigarette burns on her body. \"Don\u0027t try to talk.\"\n The pain was excruciating, but Eve was fighting for her life. \"Please...\" It took a long time to get the words out. \"Private...Gran would never...forgive me... No...police... Hit...run...accident...\"\n There was no time to argue. Dr. Harley walked over to the telephone and dialed. \"This is Dr. Harley.\" He gave Eve\u0027s address. \"I want an ambulance sent here immediately. Find Dr. Keith Webster and ask him to meet me at the hospital. Tell him it\u0027s an emergency. Have a room prepared for surgery.\" He listened a moment, then said, \"A hit-and-run accident.\" He slammed down the receiver.\n \"Thank you, Doctor,\" George breathed.\n Dr. Harley turned to look at Alexandra\u0027s husband, his eyes filled with loathing. George\u0027s clothes had been hastily donned, but his knuckles were raw, and his hands and face were still spattered with blood. \"Don\u0027t thank me. I\u0027m doing this for the Blackwells. But on one condition. That you agree to see a psychiatrist.\"\n \"I don\u0027t need a - \"\n \"Then I\u0027m calling the police, you sonofabitch. You\u0027re not fit to be running around loose.\" Dr. Harley reached for the telephone again.\n \"Wait a minute!\" George stood there, thinking. He had almost thrown everything away, but now, miraculously, he was being given a second chance. \"All right. I\u0027ll see a psychiatrist.\"\n In the far distance they heard the wail of a siren.\n She was being rushed down a long tunnel, and colored lights were flashing on and off. Her body felt light and airy, and she thought, I can fly if I want to, and she tried to move her arms, but something was holding them down. She opened her eyes, and she was speeding down a white corridor on a gurney being wheeled by two men in green gowns and caps. I\u0027m starring in a play, Eve thought. I can\u0027t remember my lines. What are my lines? When she opened her eyes again, she was in a large white room on an operating table.\n A small, thin man in a green surgical gown was leaning over her. \"My name is Keith Webster. I\u0027m going to operate on you.\"\n \"I don\u0027t want to be ugly,\" Eve whispered. It was difficult to talk. \"Don\u0027t let me be...ugly.\"\n \"Not a chance,\" Dr. Webster promised. \"I\u0027m going to put you to sleep now. Just relax.\"\n He gave a signal to the anesthesiologist.\n George managed to wash the blood off himself and clean up in Eve\u0027s bathroom, but he cursed as he glanced at his wrist-watch. It was three o\u0027clock in the morning. He hoped Alexandra was asleep, but when he walked into their living room, she was waiting for him.\n \"Darling! I\u0027ve been frantic! Are you all right?\"\n \"I\u0027m fine, Alex.\"\n She went up to him and hugged him. \"I was getting ready to call the police. I thought something terrible had happened.\"\n How right you are, George thought.\n \"Did you bring him the contracts?\"\n \"Contracts?\" He suddenly remembered. \"Oh, those. Yes. I did.\" That seemed like years ago, a lie from the distant past.\n \"What on earth kept you so late?\"\n \"His plane was delayed,\" George said glibly. \"He wanted me to stay with him. I kept thinking he\u0027d take off at any minute, and then finally it got too late for me to telephone you. I\u0027m sorry.\"\n \"It\u0027s all right, now that you\u0027re here.\"\n George thought of Eve as she was being carried out on the stretcher. Out of her broken, twisted mouth, she had gasped,\n \"Go...home...nothing...happened\". But what if Eve\n died? He would be arrested for murder. If Eve lived, everything would be all right; it would be just as it was before. Eve would forgive him because she needed him.\n George lay awake the rest of the night. He was thinking about Eve and the way she had screamed and begged for mercy. He felt her bones crunch again beneath his fists, and he smelled her burning flesh, and at that moment he was very close to loving her.\n It was a stroke of great luck that John Harley was able to obtain the services of Keith Webster for Eve. Dr. Webster was one of the foremost plastic surgeons in the world. He had a private practice on Park Avenue and his own clinic in lower Manhattan, where he specialized in taking care of those who had been born with disfigurements. The people who came to the clinic paid only what they could afford. Dr. Webster was used to treating accident cases, but his first sight of Eve Blackwell\u0027s battered face had shocked him. He had seen photographs of her in magazines, and to see that much beauty deliberately disfigured filled him with a deep anger.\n \"Who\u0027s responsible for this, John?\"\n \"It was a hit-and-run accident, Keith.\"\n Keith Webster snorted. \"And then the driver stopped to strip her and snuff out his cigarette on her behind? What\u0027s the real story?\"\n \"I\u0027m afraid I can\u0027t discuss it. Can you put her back together again?\"\n \"That\u0027s what I do, John, put them back together again.\"\n It was almost noon when Dr. Webster finally said to his assistants, \"We\u0027re finished. Get her into intensive care. Call me at the slightest sign of anything going wrong.\"\n The operation had taken nine hours.\n Eve was moved out of intensive care forty-eight hours later. George went to the hospital. He had to see Eve, to talk to her, to make sure she was not plotting some terrible vengeance against him.\n \"I\u0027m Miss Blackwell\u0027s attorney,\" George told the duty nurse. \"She asked to see me. I\u0027ll only stay a moment.\"\n The nurse took one look at this handsome man and said, \"She\u0027s not supposed to have visitors, but I\u0027m sure it\u0027s all right if you go in.\"\n Eve was in a private room, lying in bed, flat on her back, swathed in bandages, tubes connected to her body like obscene appendages. The only parts of her face visible were her eyes and her lips.\n \"Hello, Eve...\"\n \"George...\" Her voice was a scratchy whisper. He had to lean close to hear what she said.\n \"You didn\u0027t...tell Alex?\"\n \"No, of course not.\" He sat down on the edge of the bed. \"I came because - \"\n \"I know why you came... We\u0027re...going ahead with it...\"\n He had a feeling of indescribable relief. \"I\u0027m sorry about this, Eve. I really am. I - \"\n \"Have someone call Alex...and tell her I\u0027ve gone away...on a trip...back in a few...weeks...\"\n \"All right.\"\n Two bloodshot eyes looked up at him. \"George...do me a favor.\"\n \"Yes?\"\n \"Die painfully...\"\n She slept. When she awakened, Dr. Keith Webster was at her bedside.\n \"How are you feeling?\" His voice was gentle and soothing.\n \"Very tired...What was the...matter with me?\"\n Dr. Webster hesitated. The X rays had shown a fractured zygoma and a blowout fracture. There was a depressed zygomatic arch impinging on the temporal muscle, so that she was unable to open or close her mouth without pain. Her nose was broken. There were two broken ribs and deep cigarette burns on her posterior and on the soles of her feet.\n \"What?\" Eve repeated.\n Dr. Webster said, as gently as possible, \"You had a fractured cheekbone. Your nose was broken. The bony floor where your eye sits had been shifted. There was pressure on the muscle that opens and closes your mouth. There were cigarette burns. Everything has been taken care of.\"\n \"I want to see a mirror,\" Eve whispered.\n That was the last thing he would allow. \"I\u0027m sorry,\" he smiled. \"We\u0027re fresh out.\"\n She was afraid to ask the next question. \"How am I - how am I going to look when these bandages come off?\"\n \"You\u0027re going to look terrific. Exactly the way you did before your accident.\"\n \"I don\u0027t believe you.\"\n \"You\u0027ll see. Now, do you want to tell me what happened? I have to write up a police report.\"\n There was a long silence. \"I was hit by a truck.\"\n Dr. Keith Webster wondered again how anyone could have tried to destroy this fragile beauty, but he had long since given up pondering the vagaries of the human race and its capacity for cruelty. \"I\u0027ll need a name,\" he said gently. \"Who did it?\"\n \"Mack.\"\n \"And the last name?\"\n \"Truck.\"\n Dr. Webster was puzzled by the conspiracy of silence. First John Harley, now Eve Blackwell.\n \"In cases of criminal assault,\" Keith Webster told Eve, \"I\u0027m required by law to file a police report.\"\n Eve reached out for his hand and grasped it and held it tightly. \"Please, if my grandmother or sister knew, it would kill them. If you tell the police...the newspapers will know. You mustn\u0027t...please...\"\n \"I can\u0027t report it as a hit-and-run accident. Ladies don\u0027t usually run out in the street without any clothes on.\"\n \"Please!\"\n He looked down at her, and was filled with pity. \"I suppose you could have tripped and fallen down the stairs of your home.\"\n She squeezed his hand tighter. \"That\u0027s exactly what happened...\"\n Dr. Webster sighed. \"That\u0027s what I thought.\"\n Dr. Keith Webster visited Eve every day after that, sometimes stopping by two or three times a day. He brought her flowers and small presents from the hospital gift shop. Each day Eve would ask him anxiously, \"I just lie here all day. Why isn\u0027t anyone doing anything?\"\n \"My partner\u0027s working on you,\" Dr. Webster told her.\n \"Your partner?\"\n \"Mother Nature. Under all those frightening-looking bandages, you\u0027re healing beautifully.\"\n Every few days he would remove the bandages and examine her.\n \"Let me have a mirror,\" Eve pleaded.\n But his answer was always the same: \"Not yet.\"\n He was the only company Eve had, and she began to look forward to his visits. He was an unprepossessing man, small and thin, with sandy, sparse hair and myopic brown eyes that constantly blinked. He was shy in Eve\u0027s presence, and it amused her.\n \"Have you ever been married?\" she asked.\n \"No.\"\n \"Why not?\"\n \"I - I don\u0027t know. I guess I wouldn\u0027t make a very good husband. I\u0027m on emergency call a lot.\"\n \"But you must have a girl friend.\"\n He was actually blushing. \"Well, you know...\"\n \"Tell me,\" Eve teased him.\n \"I don\u0027t have a regular girl friend.\"\n \"I\u0027ll bet all the nurses are crazy about you.\"\n \"No. I\u0027m afraid I\u0027m not a very romantic kind of person.\"\n To say the least, Eve thought. And yet, when she discussed Keith Webster with the nurses and interns who came in to perform various indignities on her body, they spoke of him as though he were some kind of god.\n \"The man is a miracle worker,\" one intern said. \"There\u0027s nothing he can\u0027t do with a human face.\"\n They told her about his work with deformed children and criminals, but when Eve asked Keith Webster about it, he dismissed the subject with, \"Unfortunately, the world judges people by their looks. I try to help those who were born with physical deficiencies. It can make a big difference in their lives.\"\n Eve was puzzled by him. He was not doing it for the money or the glory. He was totally selfless. She had never met anyone like him, and she wondered what motivated him. But it was an idle curiosity. She had no interest in Keith Webster, except for what he could do for her.\n Fifteen days after Eve checked into the hospital, she was moved to a private clinic in upstate New York.\n \"You\u0027ll be more comfortable here,\" Dr. Webster assured her.\n Eve knew it was much farther for him to travel to see her, and yet he still appeared every day.\n \"Don\u0027t you have any other patients?\" Eve asked.\n \"Not like you.\"\n Five weeks after Eve entered the clinic, Keith Webster removed the bandages. He turned her head from side to side. \"Do you feel any pain?\" he asked.\n \"No.\"\n \"Any tightness?\"\n \"No.\"\n Dr. Webster looked up at the nurse. \"Bring Miss Blackwell a mirror.\"\n Eve was filled with a sudden fear. For weeks she had been longing to look at herself in a mirror. Now that the moment was here, she was terrified. She wanted her own face, not the face of some stranger.\n When Dr. Webster handed her the mirror, she said faintly, \"I\u0027m afraid - \"\n \"Look at yourself,\" he said gently.\n She raised the mirror slowly. It was a miracle! There was no change at all; it was her face. She searched for the signs of scars. There were none. Her eyes filled with tears.\n She looked up and said, \"Thank you,\" and reached out to give Keith Webster a kiss. It was meant to be a brief thank-you kiss, but she could feel his lips hungry on hers.\n He pulled away, suddenly embarrassed. \"I\u0027m - I\u0027m glad you\u0027re pleased,\" he said.\n Pleased! \"Everyone was right. You are a miracle worker.\"\n He said shyly, \"Look what I had to work with.\" \n","sourceLink":"https://allnovel.net/master-of-the-game/page-31.html","bookId":2358,"book":{"id":2358,"title":"Master of the Game","description":"Storyline: \n WHO IS KATE BLACKWELL? \n She is the symbol of success, the beautiful woman who parlayed her inheritance into an international conglomerate. Winner of a unique position among the wealthy and world-renowned. And she\u0027s a survivor, indomitable as her father, the man who returned from the edge of death to wrench a fortune in diamonds from the bleak South African earth. Now, celebrating her ninetieth birthday, Kate surveys the family she has manipulated, dominated, and loved: the fair and the grotesque, the mad and the mild, the good and the evil -- her winnings in life. Is she the... \n MASTER OF THE GAME?\n \n","cover":"https://allnovel.net/images/master-of-the-game.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/master-of-the-game.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
