{"id":67977,"no":6,"title":"Page 6","content":"Behind them was the raging ocean. Ahead was unbroken desert from the sea to the foothills of the distant, rugged, purple mountains of the Richterveld escarpment, a world of kloofs and canyons and twisted peaks, lit by the pale moon. At the foot of the mountains was the Hexenkessel Valley - \"the witch\u0027s cauldron\" - a bleak wind trap. It was a primeval, desolate landscape that went back to the beginning of time itself. The only clue that man had ever set foot in this place was a crudely printed sign pounded into the sand. By the light of the moon, they read: VERBODE GEBIED SPERRGEBIET Forbidden. There was no escape toward the sea. The only direction left open to them was the Namib Desert. \"We\u0027ll have to try to cross it and take our chances,\" Jamie said. Banda shook his head. \"The guards will shoot us on sight or hang us. Even if we were lucky enough to slip by the guards and dogs, there\u0027s no way to get by the land mines. We\u0027re dead men.\" There was no fear in him, only a resigned acceptance of his fate. Jamie looked at Banda and felt a sense of deep regret. He had brought the black man into this, and not once had Banda complained. Even now, knowing there was no escape for them, he did not utter one word of reproach. Jamie turned to look at the wall of angry waves smashing at the shore, and he thought it was a miracle that they had gotten as far as they had. It was two A.M., four hours before dawn and discovery, and they were both still in one piece. I\u0027ll be damned if I\u0027m ready to give up, Jamie thought. \"Let\u0027s go to work, Banda.\" Banda blinked. \"Doing what?\" \"We came here to get diamonds, didn\u0027t we? Let\u0027s get them.\" Banda stared at the wild-eyed man with his white hair plastered to his skull and his sopping trousers hanging in shreds around his legs. \"What are you talking about?\" \"You said they\u0027re going to kill us on sight, right? Well, they might as well kill us rich as poor. A miracle got us in here. Maybe a miracle will get us out. And if we do get out, I damned well don\u0027t plan to leave empty-handed.\" \"You\u0027re crazy,\" Banda said softly. \"Or we wouldn\u0027t be here,\" Jamie reminded him. Banda shrugged. \"What the hell. I have nothing else to do until they find us.\" Jamie stripped off his tattered shirt, and Banda understood and did the same. \"Now. Where are all these big diamonds that you\u0027ve been talking about?\" \"They\u0027re everywhere,\" Banda promised. And he added, \"Like the guards and the dogs.\" \"We\u0027ll worry about them later. When do they come down to the beach?\" \"When it gets light.\" Jamie thought for a moment. \"Is there a part of the beach where they don\u0027t come? Someplace we could hide?\" \"There\u0027s no part of this beach they don\u0027t come to, and there\u0027s no place you could hide a fly.\" Jamie slapped Banda on the shoulder. \"Right, then. Let\u0027s go.\" Jamie watched as Banda got down on his hands and knees and began slowly crawling along the beach, his fingers sifting sand as he moved. In less than two minutes, he stopped and held up a stone. \"I found one!\" Jamie lowered himself to the sand and began moving. The first two stones he found were small. The third must have weighed over fifteen carats. He sat there looking at it for a long moment. It was incredible to him that such a fortune could be picked up so easily. And it all belonged to Salomon van der Merwe and his partners. Jamie kept moving. In the next three hours, the two men collected more than forty diamonds ranging from two carats to thirty carats. The sky in the east was beginning to lighten. It was the time Jamie had planned to leave, to jump back on the raft, sail over the reefs and make their escape. It was useless to think about that now. \"It will be dawn soon,\" Jamie said. \"Let\u0027s see how many more diamonds we can find.\" \"We\u0027re not going to live to spend any of this. You want to die very rich, don\u0027t you?\" \"I don\u0027t want to die at all.\" They resumed their search, mindlessly scooping up diamond after diamond, and it was as though a madness had taken possession of them. Their piles of diamonds increased, until sixty diamonds worth a king\u0027s ransom lay in their torn shirts. \"Do you want me to carry these?\" Banda asked. \"No. We can both - \" And then Jamie realized what was on Banda\u0027s mind. The one caught in actual possession of the diamonds would die more slowly and painfully. \"I\u0027ll take them,\" Jamie said. He dumped the diamonds into the rag that was left of his shirt, and carefully tied it in a knot. The horizon was light gray now, and the east was becoming stained with the colors of the rising sun. What next? That was the question! What was the answer? They could stand there and die, or they could move inland toward the desert and die. \"Let\u0027s move.\" Jamie and Banda slowly began walking away from the sea, side by side. \"Where do the land mines start?\" \"About a hundred yards up ahead.\" In the far distance, they heard a dog bark. \"I don\u0027t think we\u0027re going to have to worry about the land mines. The dogs are heading this way. The morning shift is coming to work.\" \"How soon before they reach us?\" \"Fifteen minutes. Maybe ten.\" It was almost full dawn now. What had been vague, shimmering patterns turned into small sand dunes and distant mountains. There was no place to hide. \"How many guards are on a shift?\" Banda thought for a moment. \"About ten.\" \"Ten guards aren\u0027t many for a beach this big.\" \"One guard is plenty. They\u0027ve got guns and dogs. The guards aren\u0027t blind, and we\u0027re not invisible.\" The sound of the barking was closer now. Jamie said, \"Banda, I\u0027m sorry. I should never have gotten you into this.\" \"You didn\u0027t.\" And Jamie understood what he meant. They could hear voices calling in the distance. Jamie and Banda reached a small dune. \"What if we buried ourselves in the sand?\" \"That has been tried. The dogs would find us and rip our throats out. I want my death to be quick. I\u0027m going to let them see me, then start running. That way they\u0027ll shoot me. I - I don\u0027t want the dogs to get me.\" Jamie gripped Banda\u0027s arm. \"We may die, but I\u0027ll be damned if we\u0027re going to run to our deaths. Let\u0027s make them work for it.\" They could begin to distinguish words in the distance. \"Keep moving, you lazy bastards,\" a voice was yelling. \"Follow me...stay in line...You\u0027ve all had a good night\u0027s sleep...Now let\u0027s get some work done...\" In spite of his brave words, Jamie found he was retreating from the voice. He turned to look at the sea again. Was drowning an easier way to die? He watched the reefs tearing viciously at the demon waves breaking over them and he suddenly saw something else, something beyond the waves. He could not understand what it was. \"Banda, look...\" Far out at sea an impenetrable gray wall was moving toward them, blown by the powerful westerly winds. \"It\u0027s the sea mis!\" Banda exclaimed. \"It comes in two or three times a week.\" While they were talking, the mis moved closer, like a gigantic gray curtain sweeping across the horizon, blotting out the sky. The voices had moved closer, too. \"Den dousant! Damn this mis! Another slowdown. The bosses ain\u0027t gonna like this...\" \"We\u0027ve got a chance!\" Jamie said. He was whispering now. \"What chance?\" \"The mis! They won\u0027t be able to see us.\" \"That\u0027s no help. It\u0027s going to lift sometime, and when it does we\u0027re still going to be right here. If the guards can\u0027t move through the land mines, neither can we. You try to cross this desert in the mis and you won\u0027t go ten yards before you\u0027re blown to pieces. You\u0027re looking for one of your miracles.\" \"You\u0027re damned right I am,\" Jamie said. The sky was darkening overhead. The mis was closer, covering the sea, ready to swallow up the shore. It had an eerie, menacing look about it as it rolled toward them, but Jamie thought exultantly, It\u0027s going to save us! A voice suddenly called out, \"Hey! You two! What the hell are you doin\u0027 there?\" Jamie and Banda turned. At the top of a dune about a hundred yards away was a uniformed guard carrying a rifle. Jamie looked back at the shore. The mis was closing in fast. \"You! You two! Come here,\" the guard yelled. He lifted his rifle. Jamie raised his hands. \"I twisted my foot,\" he called out. \"I can\u0027t walk.\" \"Stay where you are,\" the guard ordered. \"I\u0027m comin\u0027 to get you.\" He lowered his rifle and started moving toward them. A quick look back showed that the mis had reached the edge of the shore, and was coming in swiftly. \"Run!\" Jamie whispered. He turned and raced toward the beach, Banda running close behind him. \"Stop!\" A second later they heard the sharp crack of a rifle, and the sand ahead of them exploded. They kept running, racing to meet the great dark wall of the fog. There was another rifle shot, closer this time, and another, and the next moment the two men were in total darkness. The sea mis licked at them, chilling them, smothering them. It was like being buried in cotton. It was impossible to see anything. The voices were muffled now and distant, bouncing off the mis and coming from all directions. They could hear other voices calling to one another. \"Kruger!...It\u0027s Brent...Can you hear me?\" \"I hear you, Kruger...\" \"There\u0027re two of them,\" the first voice yelled. \"A white man and a black. They\u0027re on the beach. Spread your men out. Skiet hom! Shoot to kill.\" \"Hang on to me,\" Jamie whispered. Banda gripped his arm. \"Where are you going?\" \"We\u0027re getting out of here.\" Jamie brought his compass up to his face. He could barely see it. He turned until the compass was pointing east. \"This way...\" \"Wait! We can\u0027t walk. Even if we don\u0027t bump into a guard or a dog, we\u0027re going to set off a land mine.\" \"You said there are a hundred yards before the mines start. Let\u0027s get away from the beach.\" They started moving toward the desert, slowly and unsteadily, blind men in an unknown land. Jamie paced off the yards. Whenever they stumbled in the soft sand, they picked themselves up and kept moving. Jamie stopped to check the compass every few feet. When he estimated they had traveled almost a hundred yards, he stopped. \"This should be about where the land mines start. Is there any pattern to the way they\u0027re placed? Anything you can think of that could help us?\" \"Prayer,\" Banda answered. \"Nobody\u0027s ever gotten past those land mines, Jamie. They\u0027re scattered all over the field, buried about six inches down. We\u0027re going to have to stay here until the mis lifts and give ourselves up.\" Jamie listened to the cotton-wrapped voices ricocheting around them. \"Kruger! Keep in voice contact...\" \"Right, Brent...\" \"Kruger...\" \"Brent...\" Disembodied voices calling to each other in the blinding fog. Jamie\u0027s mind was racing, desperately exploring every possible avenue of escape. If they stayed where they were, they would be killed the instant the mis lifted. If they tried moving through the field of mines, they would be blown to bits. \"Have you ever seen the land mines?\" Jamie whispered. \"I helped bury some of them.\" \"What sets them off?\" \"A man\u0027s weight. Anything over eighty pounds will explode them. That way they don\u0027t kill the dogs.\" Jamie took a deep breath. \"Banda, I may have a way for us to get out of here. It might not work. Do you want to gamble with me?\" \"What have you got in mind?\" \"We\u0027re going to cross the mine fields on our bellies. That way we\u0027ll distribute our weight across the sand.\" \"Oh, Jesus!\" \"What do you think?\" \"I think I was crazy for ever leaving Cape Town.\" \"Are you with me?\" He could barely make out Banda\u0027s face next to him. \"You don\u0027t leave a man a lot of choice, do you?\" \"Come on then.\" Jamie carefully stretched himself out flat on the sand. Banda looked at him a moment, took a deep breath and joined him. Slowly the two men began crawling across the sand, toward the mine field. \"When you move,\" Jamie whispered, \"don\u0027t press down with your hands or your legs. Use your whole body.\" There was no reply. Banda was busy concentrating on staying alive. They were in a smothering, gray vacuum that made it impossible to see anything. At any instant they could bump into a guard, a dog or one of the land mines. Jamie forced all this out of his mind. Their progress was painfully slow. Both men were shirtless, and the sand scraped against their stomachs as they inched forward. Jamie was aware of how overwhelming the odds were against them. Even if by some chance they did succeed in crossing the desert without getting shot or blown up, they would be confronted by the barbed-wire fence and the armed guards at the watchtower at the entrance. And there was no telling how long the mis would last. It could lift at any second, exposing them. They kept crawling, mindlessly sliding forward until they lost all track of time. The inches became feet, and the feet became yards, and the yards became miles. They had no idea how long they had been traveling. They were forced to keep their heads close to the ground, and their eyes and ears and noses became filled with sand. Breathing was an effort. In the distance was the constant echo of the guards\u0027 voices. \"Kruger...Brent...Kruger...Brent...\" The two men stopped to rest and check the compass every few minutes, then moved on, beginning their endless crawl again. There was an almost overwhelming temptation to move faster, but that would mean pressing down harder, and Jamie could visualize the metal fragments exploding under him and ripping into his belly. He kept the pace slow. From time to time they could hear other voices around them, but the words were muffled by the fog and it was impossible to tell where they were coming from. It\u0027s a big desert, Jamie thought hopefully. We\u0027re not going to stumble into anyone. Out of nowhere, a large, furry shape leaped at him. It happened so swiftly that Jamie was caught off guard. He felt the huge Alsatian\u0027s teeth sinking into his arm. He dropped the bundle of diamonds and tried to pry open the dog\u0027s jaw, but he had only one free hand and it was impossible. He felt the warm blood running down his arm. The dog was sinking its teeth in harder now, silent and deadly. Jamie felt himself begin to faint. He heard a dull thud, and then another, and the dog\u0027s jaw loosened and its eyes glazed over. Through the mist of pain, Jamie saw Banda smashing the sack of diamonds against the dog\u0027s skull. The dog whimpered once and lay still. \"You all right?\" Banda breathed anxiously. Jamie could not speak. He lay there, waiting for the waves of pain to recede. Banda ripped off a piece of his trousers and tied a strip tightly around Jamie\u0027s arm to stop the bleeding. \"We\u0027ve got to keep moving,\" Banda warned. \"If there\u0027s one of them around, there are more.\" Jamie nodded. Slowly he slid his body forward, fighting against the terrible throbbing in his arm. He remembered nothing of the rest of the trek. He was semiconscious, an automaton. Something outside him directed his movements. Arms forward, pull...Arms forward, pull...Arms forward, pull...It was endless, an odyssey of agony. It was Banda who followed the compass now, and when Jamie started to crawl in the wrong direction Banda gently turned him around. They were surrounded by guards and dogs and land mines and only the mis kept them safe. They kept moving, crawling for their lives, until the time came when neither man had the strength to move another inch. They slept. When Jamie opened his eyes, something had changed. He lay there on the sand, his body stiff and aching, trying to remember where he was. He could see Banda asleep six feet away, and it all came flooding in. The raft crashing on the reefs...the sea mis ...But something was wrong. Jamie sat up, trying to figure out what it was. And his stomach lurched. He could see Banda! That was what was wrong. The mis was lifting. Jamie heard voices nearby. He peered through the thin mists of the dissipating fog. They had crawled near the entrance to the diamond field. There was the high guard tower and the barbed-wire fence Banda had described. A crowd of about sixty black workers was moving away from the diamond field toward the gate. They had finished their shift and the next shift was coming in. Jamie got on his knees and crawled over to Banda and shook him. Banda sat up, instantly awake. His eyes turned to the watchtower and the gate. \"Damn!\" he said incredulously. \"We almost made it.\" \"We did make it! Give me those diamonds!\" Banda handed him the folded shirt. \"What do you - ?\" \"Follow me.\" \"Those guards with the guns at the gate,\" Banda said in a low voice, \"they\u0027ll know we don\u0027t belong here.\" \"That\u0027s what I\u0027m counting on,\" Jamie told him. The two men moved toward the guards, drifting between the line of departing workers and the line of arriving workers who were yelling at one another, exchanging good-natured catcalls. \"You fellas gonna work your asses off, man. We got a nice sleep in the mis...\" \"How did you arrange for the mis, you lucky bastards...?\" \"God listens to me. He ain\u0027t gonna listen to you. You\u0027re bad...\" Jamie and Banda reached the gate. Two huge armed guards stood inside, herding the departing workers over to a small tin hut where they would be thoroughly searched. They strip them down mother-naked and then they look up and down every hole they\u0027ve got. Jamie clutched the tattered shirt in his hand more tightly. He pushed through the line of workers and walked up to a guard. \"Excuse me, sir,\" Jamie said. \"Who do we see about a job here?\" Banda was staring at him, petrified. The guard turned to face Jamie. \"What the hell are you doin\u0027 inside the fence?\" \"We came in to look for work. I heard there was an opening for a guard, and my servant can dig. I thought - \" The guard eyed the two ragged, disreputable-looking figures. \"Get the hell back outside!\" \"We don\u0027t want to go outside,\" Jamie protested. \"We need jobs, and I was told - \" \"This is a restricted area, mister. Didn\u0027t you see the signs? Now get the hell out. Both of you!\" He pointed to a large bullock wagon outside the fence, filling with the workers who had finished their shift. \"That wagon\u0027ll take you to Port Nolloth. If you want a job, you have to apply at the company office there.\" \"Oh. Thank you, sir,\" Jamie said. He beckoned to Banda, and the two men moved out through the gate to freedom. The guard glared after them. \"Stupid idiots.\" Ten minutes later, Jamie and Banda were on their way to Port Nolloth. They were carrying with them diamonds worth half a million pounds.","sourceLink":"https://allnovel.net/master-of-the-game/page-6.html","bookId":2358,"book":{"id":2358,"title":"Master of the Game","description":"Storyline: WHO IS KATE BLACKWELL? She is the symbol of success, the beautiful woman who parlayed her inheritance into an international conglomerate. Winner of a unique position among the wealthy and world-renowned. And she\u0027s a survivor, indomitable as her father, the man who returned from the edge of death to wrench a fortune in diamonds from the bleak South African earth. Now, celebrating her ninetieth birthday, Kate surveys the family she has manipulated, dominated, and loved: the fair and the grotesque, the mad and the mild, the good and the evil -- her winnings in life. Is she the... MASTER OF THE GAME?","cover":"https://allnovel.net/images/master-of-the-game.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/master-of-the-game.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
