{"id":67979,"no":8,"title":"Page 8","content":"Jamie was getting dressed when he heard a tentative knock at the door. He listened, and it was repeated. He walked over to the door and opened it. Margaret stood there. \"Come in, Maggie,\" Jamie said. \"Is something wrong?\" It was the first time she had come to his hotel room. She stepped inside, but now that she was face to face with him, she found it difficult to speak. She had lain awake all night, wondering how to tell him the news. She was afraid he might never want to see her again. She looked into his eyes. \"Ian, I\u0027m going to have your baby.\" His face was so still that Margaret was terrified that she had lost him. And suddenly his expression changed to such joy that all her doubts were instantly wiped out. He grabbed her arms and said, \"That\u0027s wonderful, Maggie! Wonderful! Have you told your father?\" Margaret pulled back in alarm. \"Oh, no! He - \" She walked over to the Victorian green-plush sofa and sat down. \"You don\u0027t know Father. He - he would never understand.\" Jamie was hurriedly putting on his shirt. \"Come on, we\u0027re going to tell him together.\" \"Are you sure everything will be all right, Ian?\" \"I\u0027ve never been surer of anything in my life.\" Salomon van der Merwe was measuring out strips of biltong for a prospector when Jamie and Margaret strode into the shop. \"Ah, Ian! I\u0027ll be with you in a moment.\" He hurriedly finished with the customer and walked over to Jamie. \"And how is everything this fine day?\" Van der Merwe asked. \"It couldn\u0027t be better,\" Jamie said happily. \"Your Maggie\u0027s going to have a baby.\" There was a sudden stillness in the air. \"I - I don\u0027t understand,\" Van der Merwe stuttered. \"It\u0027s very simple. I\u0027ve gotten her pregnant.\" The color drained from Van der Merwe\u0027s face. He turned wildly from one to the other. \"This - this isn\u0027t true?\" A maelstrom of conflicting emotions whirled through Salomon van der Merwe\u0027s head. The terrible shock of his precious daughter losing her virginity...getting pregnant...He would be the laughing stock of the town. But Ian Travis was a very wealthy man. And if they got married quickly... Van der Merwe turned to Jamie. \"You\u0027ll get married immediately, of course.\" Jamie looked at him in surprise. \"Married? You\u0027d allow Maggie to marry a stupid bairn who let you cheat him out of what belonged to him?\" Van der Merwe\u0027s head was spinning. \"What are you talking about, Ian? I never - \" \"My name\u0027s not Ian,\" Jamie said harshly. \"I\u0027m Jamie McGregor. Dinna you recognize me?\" He saw the bewildered expression on Van der Merwe\u0027s face. \"Nae, a course you don\u0027t. That boy is dead. You killed him. But I\u0027m not a man to hold a grudge, Van der Merwe. So I\u0027m giving you a gift. My seed in your daughter\u0027s belly.\" And Jamie turned and walked out, leaving the two of them staring after him, stunned. Margaret had listened in shocked disbelief. He could not mean what he had just said. He loved her! He - Salomon van der Merwe turned on his daughter, in the throes of a terrible rage. \"You whore!\" he screamed. \"Whore! Get out! Get out of here!\" Margaret stood stock-still, unable to grasp the meaning of the awful thing that was happening. Ian blamed her for something her father had done. Ian thought she was part of something bad. Who was Jamie McGregor? Who - ? \"Go!\" Van der Merwe hit her hard across the face. \"I never want to see you again as long as I live.\" Margaret stood there, rooted, her heart pounding, gasping for breath. Her father\u0027s face was that of a madman. She turned and fled from the store, not looking back. Salomon van der Merwe stood there watching her go, gripped by despair. He had seen what happened to other men\u0027s daughters who had disgraced themselves. They had been forced to stand up in church and be publicly pilloried and then exiled from the community. It was proper and fitting punishment, exactly what they deserved. But his Margaret had been given a decent, God-fearing upbringing. How could she have betrayed him like this? Van der Merwe visualized his daughter\u0027s naked body, coupling with that man, writhing in heat like animals, and he began to have an erection. He put a Closed sign on the front door of the store and lay on his bed without the strength or the will to move. When word got around town, he would become an object of derision. He would be either pitied or blamed for his daughter\u0027s depravity. Either way, it would be unbearable. He had to make certain no one learned about it. He would send the whore out of his sight forever. He knelt and prayed: O, God! How could you do this to me, your loyal servant? Why have you forsaken me? Let her die, O Lord Let them both die.... The Sundowner Saloon was crowded with noon trade when Jamie entered. He walked over to the bar and turned to face the room. \"Your attention, please!\" The conversation tapered off into silence. \"Drinks on the house for everybody.\" \"What is it?\" Smit asked. \"A new strike?\" Jamie laughed. \"In a way, my friend. Salomon van der Merwe\u0027s unmarried daughter is pregnant. Mr. van der Merwe wants everybody to help him celebrate.\" Smit whispered, \"Oh, Jesus!\" \"Jesus had nothing to do with it. Just Jamie McGregor.\" Within an hour, everyone in Klipdrift had heard the news. How Ian Travis was really Jamie McGregor, and how he had gotten Van der Merwe\u0027s daughter pregnant. Margaret van der Merwe had fooled the whole town. \"She doesn\u0027t look like the kind, does she?\" \"Still waters run deep, they say.\" \"I wonder how many other men in this town have dipped their wick in that well?\" \"She\u0027s a shapely girl. I could use a piece of that myself.\" \"Why don\u0027t you ask her? She\u0027s givin\u0027 it away.\" And the men laughed. When Salomon van der Merwe left his store that afternoon, he had come to terms with the dreadful catastrophe that had befallen him. He would send Margaret to Cape Town on the next coach. She could have her bastard there, and there was no need for anyone in Klipdrift to know his shame. Van der Merwe stepped out into the street, hugging his secret, a smile pasted on his lips. \"Afternoon, Mr. van der Merwe. I hear you might be stockin\u0027 some extra baby clothes.\" \"Good day, Salomon. Hear you\u0027re gonna get a little helper for your store soon.\" \"Hello there, Salomon. I hear a bird watcher just spotted a new species out near the Vaal River. Yes, sir, a stork!\" Salomon van der Merwe turned and blindly stumbled back into his shop, bolting the door behind him. At the Sundowner Saloon, Jamie was having a whiskey, listening to the flood of gossip around him. It was the biggest scandal Klipdrift had ever had, and the pleasure the townspeople took in it was intense. I wish, Jamie thought, that Banda were here with me to enjoy this. This was payment for what Salomon van der Merwe had done to Banda\u0027s sister, what he had done to Jamie and to - how many others? But this was only part payment for all the things Salomon van der Merwe had done, just the beginning. Jamie\u0027s vengeance would not be complete until Van der Merwe had been totally destroyed. As for Margaret, he had no sympathy for her. She was in on it. What had she said the first day they met? My father might be the one to help you. He knows everything. She was a Van der Merwe too, and Jamie would destroy both of them. Smit walked over to where Jamie was sitting. \"Kin I talk to you a minute, Mr. McGregor?\" \"What is it?\" Smit cleared his throat self-consciously. \"I know a couple of prospectors who have ten claims up near Pniel. They\u0027re producin\u0027 diamonds, but these fellas don\u0027t have the money to get the proper equipment to work their claim. They\u0027re lookin\u0027 for a partner. I thought you might be interested.\" Jamie studied him. \"These are the men you talked to Van der Merwe about, right?\" Smit nodded, surprised. \"Yes, sir. But I been thinkin\u0027 over your proposition. I\u0027d rather do business with you.\" Jamie pulled out a long, thin cigar, and Smit hastened to light it. \"Keep talking.\" Smit did. In the beginning, prostitution in Klipdrift was on a haphazard basis. The prostitutes were mostly black women, working in sleazy, back-street brothels. The first white prostitutes to arrive in town were part-time barmaids. But as diamond strikes increased and the town prospered, more white prostitutes appeared. There were now half a dozen sporting houses on the outskirts of Klipdrift, wooden railway huts with tin roofs. The one exception was Madam Agnes\u0027s, a respectable-looking two-story frame structure on Bree Street, off Loop Street, the main thoroughfare, where the wives of the townspeople would not be offended by having to pass in front of it. It was patronized by the husbands of those wives, and by any strangers in town who could afford it. It was expensive, but the women were young and uninhibited, and gave good value for the money. Drinks were served in a reasonably well-decorated drawing room, and it was a rule of Madam Agnes\u0027s that no customer was ever rushed or shortchanged. Madam Agnes herself was a cheerful, robust redhead in her mid-thirties. She had worked at a brothel in London and been attracted to South Africa by the tales of easy money to be picked up in a mining town like Klipdrift. She had saved enough to open her own establishment, and business had flourished from the beginning. Madam Agnes prided herself on her understanding of men, but Jamie McGregor was a puzzle to her. He visited often, spent money freely and was always pleasant to the women, but he seemed withdrawn, remote and untouchable. His eyes were what fascinated Agnes. They were pale, bottomless pools, cold. Unlike the other patrons of her house, he never spoke about himself or his past. Madam Agnes had heard hours earlier that Jamie McGregor had deliberately gotten Salomon van der Merwe\u0027s daughter pregnant and then refused to marry her. The bastard! Madam Agnes thought. But she had to admit that he was an attractive bastard. She watched Jamie now as he walked down the red-carpeted stairs, politely said good night and left. When Jamie arrived back at his hotel, Margaret was in his room, staring out the window. She turned as Jamie walked in. \"Hello, Jamie.\" Her voice was atremble. \"What are you doing here?\" \"I had to talk to you.\" \"We have nothing to talk about.\" \"I know why you\u0027re doing this. You hate my father.\" Margaret moved closer to him. \"But you have to know that whatever it was he did to you, I knew nothing about. Please - I beg of you - believe that. Don\u0027t hate me. I love you too much.\" Jamie looked at her coldly. \"That\u0027s your problem, isn\u0027t it?\" \"Please don\u0027t look at me like that. You love me, too...\" He was not listening. He was again taking the terrible journey to Paardspan where he had almost died...and moving the boulders on the riverbanks until he was ready to drop...and finally, miraculously, finding the diamonds... Handing them to Van der Merwe and hearing Van der Merwe\u0027s voice saying, You misunderstood me, boy. I don\u0027t need any partners. You\u0027re working for me... I\u0027m giving you twenty-four hours to get out of town. And then the savage beating...He was smelling the vultures again, feeling their sharp beaks tear into his flesh... As though from a distance, he heard Margaret\u0027s voice. \"Don\u0027t you remember? I - belong - to - you... I love you.\" He shook himself out of his reverie and looked at her. Love. He no longer had any idea what the word meant. Van der Merwe had burned every emotion out of him except hate. He lived on that. It was his elixir, his lifeblood. It was what had kept him alive when he fought the sharks and crossed the reef, and crawled over the mines at the diamond fields of the Namib Desert. Poets wrote about love, and singers sang about it, and perhaps it was real, perhaps it existed. But love was for other men. Not for Jamie McGregor. \"You\u0027re Salomon van der Merwe\u0027s daughter. You\u0027re carrying his grandchild in your belly. Get out.\" There was nowhere for Margaret to go. She loved her father, and she needed his forgiveness, but she knew he would never - could never - forgive her. He would make her life a living hell. But she had no choice. She had to go to someone. Margaret left the hotel and walked toward her father\u0027s store. She felt that everyone she passed was staring at her. Some of the men smiled insinuatingly, and she held her head high and walked on. When she reached the store, she hesitated, then stepped inside. The store was deserted. Her father came out from the back. \"Father...\" \"You!\" The contempt in his voice was a physical slap. He moved closer, and she could smell the whiskey on his breath. \"I want you to get out of this town. Now. Tonight. You\u0027re never to come near here again. Do you hear me? Never!\" He pulled some bills from his pocket and threw them on the floor. \"Take them and get out.\" \"I\u0027m carrying your grandchild.\" \"You\u0027re carrying the devil\u0027s child!\" He moved closer to her, and his hands were knotted into fists. \"Every time people see you strutting around like a whore, they\u0027ll think of my shame. When you\u0027re gone, they\u0027ll forget it.\" She looked at him for a long, lost moment, then turned and blindly stumbled out the door. \"The money, whore!\" he yelled. \"You forgot the money!\" There was a cheap boardinghouse at the outskirts of town, and Margaret made her way to it, her mind in a turmoil. When she reached it, she went looking for Mrs. Owens, the landlady. Mrs. Owens was a plump, pleasant-faced woman in her fifties, whose husband had brought her to Klipdrift and abandoned her. A lesser woman would have crumbled, but Mrs. Owens was a survivor. She had seen a good many people in trouble in this town, but never anyone in more trouble than the seventeen-year-old girl who stood before her now. \"You wanted to see me?\" \"Yes. I was wondering if - if perhaps you had a job for me here.\" \"A job? Doing what?\" \"Anything. I\u0027m a good cook. I can wait on tables. I\u0027ll make the beds. I - I\u0027ll - \" There was desperation in her voice. \"Oh, please,\" she begged. \"Anything!\" Mrs. Owens looked at the trembling girl standing there in front of her, and it broke her heart. \"I suppose I could use an extra hand. How soon can you start?\" She could see the relief that lighted Margaret\u0027s face. \"Now.\" \"I can pay you only - \" She thought of a figure and added to it. \"One pound two shillings eleven pence a month, with board and lodging.\" \"That will be fine,\" Margaret said gratefully. Salomon van der Merwe seldom appeared now on the streets of Klipdrift. More and more often, his customers found a Closed sign on the front door of his store at all hours of the day. After a while, they took their business elsewhere. But Salomon van der Merwe still went to church every Sunday. He went not to pray, but to demand of God that He right this terrible iniquity that had been heaped upon the shoulders of his obedient servant. The other parishioners had always looked up to Salomon van der Merwe with the respect due a wealthy and powerful man, but now he could feel the stares and whispers behind his back. The family that occupied the pew next to him moved to another pew. He was a pariah. What broke his spirit completely was the minister\u0027s thundering sermon artfully combining Exodus and Ezekiel and Leviticus. \"I, the Lord thy God, am a jealous God, visiting the iniquity of the fathers upon the children. Wherefor, O harlot, hear the word of the Lord. Because thy filthiness was poured out, and thy nakedness discovered through thy whoredoms with thy lovers... And the Lord spake unto Moses, saying, \u0027Do not prostitute thy daughter, to cause her to be a whore; lest the land fall to whoredom and the land become full of wickedness....\u0027\" Van der Merwe never set foot in church again after that Sunday. As Salomon van der Merwe\u0027s business deteriorated, Jamie McGregor\u0027s prospered. The expense of mining for diamonds increased as the digging got deeper, and miners with working claims found they were unable to afford the elaborate equipment needed. The word quickly spread that Jamie McGregor would provide financing in exchange for a share in the mines, and in time Jamie bought out his partners. He invested in real estate and businesses and gold. He was meticulously honest in his dealings, and as his reputation spread, more people came to him to do business. There were two banks in town, and when one of them failed because of inept management, Jamie bought it, putting in his own people and keeping his name out of the transaction. Everything Jamie touched seemed to prosper. He was successful and wealthy beyond his boyhood dreams, but it meant little to him. He measured his successes only by Salomon van der Merwe\u0027s failures. His revenge had still only begun. From time to time, Jamie passed Margaret on the street. He took no notice of her. Jamie had no idea what those chance encounters did to Margaret. The sight of him took her breath away, and she had to stop until she regained control of herself. She still loved him, completely and utterly. Nothing could ever change that. He had used her body to punish her father, but Margaret knew that that could be a double-edged sword. Soon she would have Jamie\u0027s baby, and when he saw that baby, his own flesh and blood, he would marry her and give his child a name. Margaret would become Mrs. Jamie McGregor, and she asked nothing more from life. At night before Margaret went to sleep, she would touch her swollen belly and whisper, \"Our son.\" It was probably foolish to think she could influence its sex, but she did not want to overlook any possibility. Every man wanted a son. As her womb swelled, Margaret became more frightened. She wished she had someone to talk to. But the women of the town did not speak to her. Their religion taught them punishment, not forgiveness. She was alone, surrounded by strangers, and she wept in the night for herself and for her unborn baby. Jamie McGregor had bought a two-story building in the heart of Klipdrift, and he used it as headquarters for his growing enterprises. One day, Harry McMillan, Jamie\u0027s chief accountant, had a talk with him. \"We\u0027re combining your companies,\" he told Jamie, \"and we need a corporate name. Do you have any suggestions?\" \"I\u0027ll think about it.\" Jamie thought about it. In his mind he kept hearing the sound of long-ago echoes piercing the sea mis on the diamond field in the Namib Desert, and he knew there was only one name he wanted. He summoned the accountant. \"We\u0027re going to call the new company Kruger-Brent. Kruger-Brent Limited.\" Alvin Cory, Jamie\u0027s bank manager, stopped in to visit him. \"It\u0027s about Mr. van der Merwe\u0027s loans,\" he said. \"He\u0027s fallen very far behind. In the past he\u0027s been a good risk, but his situation has drastically changed, Mr. McGregor. I think we should call in his loans.\" \"No.\" Cory looked at Jamie in surprise. \"He came in this morning trying to borrow more money to - \" \"Give it to him. Give him everything he wants.\" The manager got to his feet. \"Whatever you say, Mr. McGregor. I\u0027ll tell him that you - \" \"Tell him nothing. Just give him the money.\" Every morning Margaret arose at five o\u0027clock to bake large loaves of wonderful-smelling bread and sourdough biscuits, and when the boarders trooped into the dining room for breakfast, she served them porridge and ham and eggs, buckwheat cakes, sweet rolls and pots of steaming coffee and naartje. The majority of the guests at the boardinghouse were prospectors on their way to and from their claims. They would stop off in Klipdrift long enough to have their diamonds appraised, have a bath, get drunk and visit one of the town\u0027s brothels - usually in that order. They were for the most part rough, illiterate adventurers. There was an unwritten law in Klipdrift that nice women were not to be molested. If a man wanted sex, he went to a whore. Margaret van der Merwe, however, was a challenge, for she fit into neither category. Nice girls who were single did not get pregnant, and the theory went that since Margaret had fallen once, she was probably eager to bed everyone else. All they had to do was ask. They did. Some of the prospectors were open and blatant; others were leering and furtive. Margaret handled them all with quiet dignity. But one night as Mrs. Owens was preparing for bed, she heard screams coming from Margaret\u0027s room at the back of the house. The landlady flung the door open and rushed in. One of the guests, a drunken prospector, had ripped off Margaret\u0027s nightgown and had her pinned down on the bed. Mrs. Owens was on him like a tiger. She picked up a flatiron and began hitting him with it. She was half the size of the prospector, but it made no difference. Filled with an overpowering rage, she knocked the prospector unconscious and dragged him into the hallway and out to the street. Then she turned and hurried back to Margaret\u0027s room. Margaret was wiping the blood off her lips from where the man had bitten her. Her hands were trembling. \"Are you all right, Maggie?\" \"Yes. I - thank you, Mrs. Owens.\" Unbidden tears sprang into Margaret\u0027s eyes. In a town where few people even spoke to her, here was someone who had shown kindness. Mrs. Owens studied Margaret\u0027s swollen belly and thought, The poor dreamer. Jamie McGregor will never marry her. The time of confinement was drawing close. Margaret tired easily now, and bending down and getting up again was an effort. Her only joy was when she felt her baby stir inside her. She and her son were completely alone in the world, and she talked to him hour after hour, telling him all the wonderful things that life had in store for him. Late one evening, shortly after supper, a young black boy appeared at the boardinghouse and handed Margaret a sealed letter. \"I\u0027m to wait for an answer,\" the boy told her. Margaret read the letter, then read it again, very slowly. \"Yes,\" she said. \"The answer is yes.\" The following Friday, promptly at noon, Margaret arrived in front of Madam Agnes\u0027s bordello. A sign on the front door read Closed. Margaret rapped tentatively on the door, ignoring the startled glances of the passers-by. She wondered if she had made a mistake by coming here. It had been a difficult decision, and she had accepted only out of a terrible loneliness. The letter had read: Dear Miss van der Merwe: It\u0027s none of my business, but my girls and me have been discussing your unfortunate and unfair situation, and we think it\u0027s a damned shame. We would like to help you and your baby. If it would not embarrass you, we would be honored to have you come to lunch. Would Friday at noon be convenient? Respectfully yours, Madam Agnes P.S . We would be very discreet. Margaret was debating whether to leave, when the door was opened by Madam Agnes. She took Margaret\u0027s arm and said, \"Come in, dearie. Let\u0027s get you out of this damned heat.\" She led her into the parlor, furnished with Victorian red-plush couches and chairs and tables. The room had been decorated with ribbons and streamers and - from God knows where - brightly colored balloons. Crudely lettered cardboard signs hanging from the ceiling read: WELCOME BABY...IT\u0027S GOING TO BE A BOY...HAPPY BIRTHDAY. In the parlor were eight of Madam Agnes\u0027s girls, in a variety of sizes, ages and colors. They had all dressed for the occasion under Madam Agnes\u0027s tutelage. They wore conservative afternoon gowns and no makeup. They look, Margaret thought in wonder, more respectable than most of the wives in this town. Margaret stared at the roomful of prostitutes, not quite knowing what to do. Some of the faces were familiar. Margaret had waited on them when she worked in her father\u0027s store. Some of the girls were young and quite beautiful. A few were older and fleshy, with obviously dyed hair. But they all had one thing in common - they cared. They were friendly and warm and kind, and they wanted to make her happy. They hovered around Margaret self-consciously, afraid of saying or doing the wrong thing. No matter what the townspeople said, they knew this was a lady, and they were aware of the difference between Margaret and themselves. They were honored that she had come to them, and they were determined not to let anything spoil this party for her. \"We fixed you a nice lunch, honey,\" Madam Agnes said. \"I hope you\u0027re hungry.\" They led her into the dining room, where a table had been festively set, with a bottle of champagne at Margaret\u0027s place. As they walked through the hallway, Margaret glanced toward the stairs that led to the bedrooms on the second floor. She knew Jamie visited here, and she wondered which of the girls he chose. All of them, perhaps. And she studied them again and wondered what it was they had for Jamie that she did not. The luncheon turned out to be a banquet. It began with a delicious cold soup and salad, followed by fresh carp. After that came mutton and duck with potatoes and vegetables. There was a tipsy cake and cheese and fruit and coffee. Margaret found herself eating heartily and enjoying herself immensely. She was seated at the head of the table, Madam Agnes on her right, and Maggie, a lovely blond girl who could have been no more than sixteen, on her left. In the beginning the conversation was stilted. The girls had dozens of amusing, bawdy stories to tell, but they were not the kind they felt Margaret should hear. And so they talked about the weather and about how Klipdrift was growing, and about the future of South Africa. They were knowledgeable about politics and the economy and diamonds because they got their information firsthand from experts. Once, the pretty blonde, Maggie, said, \"Jamie\u0027s just found a new diamond field at - \" And as the room went suddenly silent and she realized her gaffe, she added nervously, \"That\u0027s my Uncle Jamie. He\u0027s - he\u0027s married to my aunt.\" Margaret was surprised by the sudden wave of jealousy that swept through her. Madam Agnes hastily changed the subject. When the luncheon was finished, Madam Agnes rose and said, \"This way, honey.\" Margaret and the girls followed her into a second parlor which Margaret had not seen before. It was filled with dozens of gifts, all of them beautifully wrapped. Margaret could not believe her eyes. \"I - I don\u0027t know what to say.\" \"Open them,\" Madam Agnes told Margaret. There was a rocking cradle, handmade bootees, sacques, embroidered bonnets, a long, embroidered cashmere cloak. There were French-kid button shoes, a child\u0027s silver cup, gold-lined, and a comb and brush with solid sterling-silver handles. There were solid-gold baby bib pins with beaded edges, a celluloid baby rattle and rubber teething ring and a rocking horse painted dapple gray. There were toy soldiers, brightly colored wooden blocks and the most beautiful thing of all: a long, white christening dress. It was like Christmas. It was beyond anything Margaret had ever expected. All the bottled-up loneliness and unhappiness of the past months exploded in her, and she burst into sobs. Madam Agnes put her arms around her and said to the other girls, \"Get out.\" They quietly left the room. Madam Agnes led Margaret to a couch and sat there holding her until the sobs subsided. \"I - I\u0027m so sorry,\" Margaret stammered. \"I - I don\u0027t know what came over me.\" \"It\u0027s all right, honey. This room has seen a lot of problems come and go. And you know what I\u0027ve learned? Somehow, in the end everything always gets sorted out. You and your baby are gonna be just fine.\" \"Thank you,\" Margaret whispered. She gestured toward the piles of presents. \"I can never thank you and your friends enough for - \" Madam Agnes squeezed Margaret\u0027s hand. \"Don\u0027t. You don\u0027t have no idea how much fun the girls and me had gettin\u0027 all this together. We don\u0027t get a chance to do this kind of thing very often. When one of us gets pregnant, it\u0027s a fuckin\u0027 tragedy.\" Her hands flew to her mouth and she said, \"Oh! Excuse me!\" Margaret smiled. \"I just want you to know that this has been one of the nicest days of my life.\" \"We\u0027re real honored that you came to visit us, honey. As far as I\u0027m concerned, you\u0027re worth all the women in this town put together. Those damned bitches! I could kill them for the way they\u0027re behavin\u0027 to you. And if you don\u0027t mind my sayin\u0027 so, Jamie McGregor is a damned fool.\" She rose to her feet. \"Men! It would be a wonderful world if we could live without the bastards. Or maybe it wouldn\u0027t. Who knows?\" Margaret had recovered her composure. She rose to her feet and took Madam Agnes\u0027s hand in hers. \"I\u0027ll never forget this. Not as long as I live. Someday, when my son is old enough, I\u0027ll tell him about this day.\" Madam Agnes frowned. \"You really think you should?\" Margaret smiled. \"I really think I should.\" Madam Agnes saw Margaret to the door. \"I\u0027ll have a wagon deliver all the gifts to your boardinghouse, and - good luck to you.\" \"Thank you. Oh, thank you.\" And she was gone. Madam Agnes stood there a moment watching Margaret walk clumsily down the street. Then she turned inside and called loudly, \"All right, ladies. Let\u0027s go to work.\" One hour later, Madam Agnes\u0027s was open for business as usual.","sourceLink":"https://allnovel.net/master-of-the-game/page-8.html","bookId":2358,"book":{"id":2358,"title":"Master of the Game","description":"Storyline: WHO IS KATE BLACKWELL? She is the symbol of success, the beautiful woman who parlayed her inheritance into an international conglomerate. Winner of a unique position among the wealthy and world-renowned. And she\u0027s a survivor, indomitable as her father, the man who returned from the edge of death to wrench a fortune in diamonds from the bleak South African earth. Now, celebrating her ninetieth birthday, Kate surveys the family she has manipulated, dominated, and loved: the fair and the grotesque, the mad and the mild, the good and the evil -- her winnings in life. Is she the... MASTER OF THE GAME?","cover":"https://allnovel.net/images/master-of-the-game.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/master-of-the-game.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
