{"id":97201,"no":2,"title":"Page 2","content":"PART ONE CHAPTER ONE See The CreechurIt was hot as hell, and flies the size of Jake Cutter\u0027s little fingernails had been committing suicide on the vehicle\u0027s windscreen for more than a hundred and fifty miles now, ever since they\u0027d left Wiluna and \u0027civilization\u0027 behind.\u0027Phew!\u0027 Jake said, sluicing sweat from his brow and out of the open window of their specially adapted Land Rover. The top was back and the windows wound down, yet the hot wind of passage that pushed their wide-brimmed Aussie hats back from their foreheads, tightened their chinstraps around their throats and ruffled their shirts still made it feel like they were driving headlong into a bonfire. And the \u0027road\u0027 ahead - which in fact was scarcely better than a track - wavered like a smoke-ghost in the heat haze of what appeared to be an empty, ever-expanding distance.Behind the vehicle, a mile-long plume of dust and blue-grey exhaust fumes drifted low over the scrub and the wilderness.\u0027That\u0027s your fifth \"phew\",\u0027 Liz Merrick told him. \u0027Feeling talkative today?\u0027 \u0027So what am I supposed to say?\u0027 He didn\u0027t even glance at her, though most men wouldn\u0027t have been able to resist it. \u0027Oh dear, isn\u0027t it hot? Christ, it must be ninety! \"Phew\" is about all I\u0027m up to, because if I do more than open my mouth a crack - ugh!\u0027 And he spat out yet another wet fly. Liz squirmed and grimaced. \u0027What the hell do they live on, I wonder? Way out here, I mean?\u0027 She swatted and missed as something small, black and nasty went zipping by.\u0027Things die out here/ Jake answered grimly. \u0027Maybe that\u0027s what they live on.\u0027 And just when she thought that was it, that he was all done for now: \u0027Anyway, the sun\u0027s going down over the hills there. Another half-hour or so, it\u0027ll be cooler. It won\u0027t get cold - not in this freaky weather - but at least you\u0027ll be able to breathe without frying your lungs.\u0027 Then he was done.She turned her head to look at him more fully: his angular face in profile, his hard hands on the wheel, his lean outline. But if Jake noticed her frowning, curiously intent glance, well, it scarcely registered. That was how he was: hands off. And she thought: We make a damned odd couple!She was right, they did. Jake hard yet supple, like whip-cord, and Liz soft and curvy. Him with his dark background and current ... condition, and Liz with her - - Which was when they hit a pothole, which simultaneously brought Liz\u0027s mind back to earth while lifting her backside eight inches off her seat. \u0027Jake, take it easy!\u0027 she gasped.He nodded, in no way apologetically, almost absent-mindedly. He had turned his head to look at her - no, Liz corrected herself - to look beyond her, westward where the rounded domes of gaunt, yellow- and red-ochre hills marched parallel with the road. They were pitted, those hills, pockmarked even from here. The same could be said of the desert all around, including the so-called road. \u0027These old mine workings,\u0027 Jake growled. \u0027Gold mines. That was subsidence back there, where the road is sinking into some old mine. I didn\u0027t see it because of this bloody heat haze.\u0027\u0027Gold?\u0027 Squirming down into her seat, Liz tried to get comfortable again. Hah! she thought. As if I\u0027d been comfortable in the first place! \u0027They found a few nuggets here/ he told her. \u0027There was a bit of a gold rush that didn\u0027t pan out. There may be gold here - there probably is - but first you have to survive to bring it up out of the ground. It just wasn\u0027t worth it ...\u0027\u0027Because even without this awful El Nino weather, this was one hell of an inhospitable place to survive in/ she nodded.\u0027Right/ Finally Jake glanced at her - at her this time. And while he was still looking she grinned nervously and said:\u0027What a place to spend your honeymoon! I should never have let you talk me into it/ A witticism, of course.\u0027Huh!\u0027 was his reply. Shielding his eyes, he switched his attention back to the rounded hills with the sun\u0027s rim sitting on them like a golden, pus-filled blister on the slumping hip of some gigantic, reclining, decomposing woman.\u0027Fuel gauge is low/ Liz tapped on the gauge with a fingernail. \u0027Are we sure there\u0027s a gas station out here?\u0027 In fact she knew there was; it was right there on the map. It was just the awful heat, the condition of the road, evening setting in, and a perfectly normal case of nerves. Liz\u0027s tended to fray a little from time to time. As for Jake\u0027s ... well, she wasn\u0027t entirely sure about his, didn\u0027t even know if he had any.\u0027Gas station?\u0027 He glanced at her again. \u0027Sure there is. To service the local \"community\". Heck, around these parts there\u0027s point nine persons per hundred square miles!\u0027 While Jake\u0027s sarcasm dripped, it wasn\u0027t directed entirely at Liz but rather at their situation. Moreover, she thought she detected an unfamiliar edge to his voice. So perhaps he did have nerves after all. But still his completely humourless attitude irritated her. \u0027That many people? Really?\u0027 For a moment she\u0027d felt goaded into playing this insufferable man at his own game ... but only for a moment. Then, shrugging, she let it go. \u0027So what\u0027s it doing here? The gas station, I mean/ \u0027It\u0027s a relic of the gold rush he answered. \u0027The Australian Government keeps such places going with subsidies, or they simply couldn\u0027t exist. They\u0027re watering holes in the middle of nowhere, way stations for the occasional wanderer. Don\u0027t expect too much, though. Maybe a bottle of warm beer - make sure you knock the cap off yourself... yes, I know you know that - no food, and if you need the loo you\u0027d better do it before we get there.\u0027 Good advice, around these parts.The road vanished about a mile ahead: an optical illusion, just like the heat haze. As the hills got higher, so the road began to climb, making everything seem on a level, horizontal. Only the throb of the motor told the truth: that the Land Rover was in fact labouring, however slightly. And in another minute they crested the rise.Then Jake brought the vehicle to a halt and they both went off into the scrub fifty yards in different directions. He got back first, was leaning on his open door, peering through binoculars and checking the way ahead when Liz returned.\u0027See anything?\u0027 she asked, secretly admiring Jake where he stood unselfconsciously posed, with one booted foot on the door sill, his jeans outlining a small backside and narrow hips. But the rest of him wasn\u0027t small. He was tall, maybe six-two, leggy and with long arms to match. His hair was a deep brown like his eyes, and his face was lean, hollow-cheeked. He looked as if a good meal wouldn\u0027t hurt... but, on the other hand, extra weight would certainly slow him down. His lips were thin, even cruel. And when he smiled you could never be sure there was any humour in it. Jake\u0027s hair was long as a lion\u0027s; he kept it swept back, braided into a pigtail. His jaw was angular, thinly scarred on the left side, and his nose had been broken high on the bridge so that it hung like a sheer cliff (like a native American Indian\u0027s nose, Liz thought) instead of projecting. But despite his leanness, Jake\u0027s shoulders were broad, and the sun-bronzed flesh of his upper arms was corded with muscle. His thighs, too, she imagined ... \u0027The gas station,\u0027 he answered. \u0027Sign at the roadside says \"Old Mine Gas\". There\u0027s a track off to the right from the road to the pumps ... or rather the pump. What a dump.\u0027 Another sign this side of the shack says ... what?\u0027 He frowned. \u0027Well, what?\u0027 Liz asked.\u0027Says \"See the Creature!\u0027\" Jake told her. \u0027But it\u0027s spelled C-r-e-e-c-h-u-r. Huh! Creechur ...\u0027 He shook his head.\u0027Not much schooling around here,\u0027 she said. Then, putting a hand to the left side of her face to shut out the last spears of sunlight from the west, \u0027That\u0027s some kind of eyesight you\u0027ve got. Even with binoculars the letters on those signs have to be tiny.\u0027\u0027First requirement of a sniper,\u0027 he grunted. \u0027That his eyesight is one hundred per cent.\u0027\u0027But you\u0027re not a sniper, or indeed any kind of killer, any longer,\u0027 she told him - then caught her breath as she realized how wrong she might be. Except it was different now, surely.Jake passed the binoculars, looked at her but made no comment. Peering through the glasses, she focused them to her own vision, picked up the gas station\u0027s single forlorn pump and the shack standing - or leaning - behind it, apparently built right into the rocky base of a knoll, which itself bulged at the foot of a massive outcrop or butte. The road wound around the ridgy, shelved base of the outcrop and disappeared north.And while she looked at the place, Jake looked at her. That was okay because she didn\u0027t know he was looking. She was a girl - no, a woman - and a sight for sore eyes. But Jake Cutter couldn\u0027t look at her that way. There had \\\u003eem a woman, and after her there couldn\u0027t be anything else. Not ever. But if there could have been ... maybe it would have been someone like Liz Merrick. She was maybe five-seven, willow-waisted, and fully curved where it would matter to someone who mattered. And to whom she mattered. Well, and she did, but not like that. Her hair, black as night, cut in a boyish bob, wasn\u0027t Natasha\u0027s hair, and her long legs weren\u0027t Natasha\u0027s legs. But Liz\u0027s smile ... he had to admit there was something in her smile. Something like a ray of bright light, but one that Jake wished he\u0027d never known - because he knew now how quickly a light can be switched off. Like Natasha\u0027s light ... \u0027Not very appetizing,\u0027 Liz commented, breathing with difficulty through her mouth. \u0027Eh?\u0027 He came back to earth.\u0027The dump, as you called it.\u0027\u0027The name says it all.\u0027 Jake was equally adenoidal. \u0027Probably the entrance to an old mine. Hence \"Old Mine Gas\".\u0027A great talent for the obvious, she wanted to tell him but didn\u0027t. Sarcasm again, covering for something else.\u0027So what do you think?\u0027 she finally said, as they got back into the \u0027Rover.\u0027Good time not to think/ he answered, and Liz could only agree. At least he\u0027d remembered what little he\u0027d been told. So they tried not to think, and continued not thinking as he started up the vehicle and let her coast the downhill quarter-mile to the Old Mine Gas station ...Lights of a sort came on as they turned off the road to climb a hard-packed ramp to the elevated shelf that fronted the shack. The illuminated sign flickered and buzzed, finally lit up in a desultory, half-hearted neon glare; grimy windows in the shack itself burned a dusty, uncertain electrical yellow. In an ancient river valley like this, dry since prehistory, it got dark very quickly, even suddenly, when the sun went down.It also got cooler; not cold by any means - not in this freakish El Nino weather - but cooler. After they pulled up at the lone pump, Jake helped Liz shrug herself into a thin safari jacket, took his own from the back of the \u0027Rover and put it on. In the west, one shallow trough in the crest of the domed hills still held a golden glow. But the light was rapidly fading, and the amethyst draining from the sky, squeezed out by the descending sepia of space. To the east, the first stars were already winking into being over blackly silhouetted mountains. Maybe twenty-five paces to the right of the main shack a lesser structure burrowed into the side of the steep knoll. The \u0027See the Creechur\u0027 sign pointed in that direction. Liz wondered out loud, \u0027What sort of creature, do you reckon?\u0027 But now there was a figure standing in the shadow of the16shack\u0027s suddenly open screen door. And it was that figure that answered her. \u0027Well, it\u0027s a bloody/wnnjy one, I guarantee that much, miss!\u0027 And then a chuckle as the owner of the deep, gravelly voice stepped out into full view. \u0027It\u0027s a bit late in the day, though, so if ver want ter see \u0027im, best take a torch with yer. Bloomin\u0027 bulb\u0027s blown again ... or maybe \u0027e did it \u0027imself. Don\u0027t much care for the light, that creechur feller. Now then, what can I do fer you folks? Gas, is it?\u0027Jake nodded and tilted his hat back. \u0027Gas. Fill her up.\u0027\u0027Ah!\u0027 The other\u0027s gasp seemed genuine enough. \u0027Eh? What\u0027s this, then? Brits, are yer? A pair of whingein\u0027 pommies way out \u0027ere? Now I asks yer, what next!?\u0027 He grinned, shook his head. \u0027Just kiddin\u0027. Don\u0027t yer be takin\u0027 no note o\u0027 me, folks.\u0027To all appearances he was just a friendly old lad and entirely unaccustomed to company. His rheumy little pinprick eyes, long since abandoned to the wrinkles of a weathered face, gazed at his customers over a bristly beard like that of some garrulous stagecoach driver in an ancient Western. As he took the cap off the Land Rover\u0027s tank, his wobbly spindle legs seemed about ready to collapse under him. And as if to make doubly sure he\u0027d said nothing out of turn: \u0027Er, no offence meant,\u0027 he continued to mumble his apologies.\u0027No offence taken,\u0027 Liz gave a little laugh. And Jake had to admire her: her steady, give-away-nothing voice. She quickly went on, \u0027Can we get a drink or something, while you\u0027re filling her up? It\u0027s been a long and thirsty road, and a way to go yet. Maybe a beer? You do have beer, right?\u0027 \u0027Did yer ever meet up with an Australian\u0027 (but in fact he said Orstrylian) \u0027who didn\u0027t have a beer close ter hand?\u0027 The old man grinned again, started the pump and handed the nozzle to Jake, then hobbled back and \u0027elp open the inner door to the shack for Liz. \u0027Just you help yerself, miss. They\u0027re all lined up on the shelves back o\u0027 the bar there. Not a lot ter choose from, though - Fosters every one! It\u0027s my favourite. And since I\u0027m the one who drinks most of it, it\u0027s my choice too.\u0027 \u0027Well, good/ said Liz. \u0027It\u0027s my favourite, too.\u0027 Jake watched them go inside, frowned at the nozzle in his hand. Just like that, he\u0027d accepted the bloody thing. Damn!After that ... but it seemed it was going to take forever to satisfy the \u0027Rover\u0027s greedy guzzling. So Jake quit when the tank was only three-quarters full, slammed the nozzle into the pump\u0027s housing, tried not to look too concerned as he followed Liz and the old boy into the shack. But he\u0027d hated to lose contact with her, lose sight of her like that, even for a few seconds. And she\u0027d looked back at him just before she passed from view, her green eyes a fraction too narrow, too anxious.Inside, however, it wasn\u0027t as bad as he\u0027d thought it would be. Or as it might have been.It was the grime, the blown dust of the desert, clinging to the outside of the windows, that had shut the light in and made the place seem so dim from outside. But within - this might be typical of any outback filling station a million miles from nowhere. That was Jake\u0027s first impression. The bar was a plank on two barrels, with a bead curtain hanging from the plank to the floor in front, and smaller barrels for seats. Liz was perched on one of them, and the old man had passed her a beer that she held unopened in her hand.She must have asked him if he was all alone out here, and he was in the process of answering: \u0027Alone? Me? Naw, not much. And anyway I enjoys bein\u0027 on me ownsome. Oh, I got a couple o\u0027 boys to \u0027elp out. They ain\u0027t \u0027ere right now, is all. It ain\u0027t so bad, actu\u0027ly. \u0027Ad a truck through just a day or so ago.\u0027\u0027A truck?\u0027 Liz said, all innocence and light. \u0027Out here?\u0027 And the old man nodded. \u0027Gawd knows where they\u0027d be goin\u0027! But for that matter, where be you goin\u0027, eh? What\u0027re yer doin\u0027 out \u0027ere anyway?\u0027 Having taken in much of the single room at a glance, Jake strode to the bar and asked for a beer. Without waiting for an answer from Liz, the old man reached for a bottle and turned to Jake. \u0027Well now, you was a mite quick!\u0027 he said. \u0027Yer just topped \u0027er up, am I right? I mean, yer\u0027d never fill a big tank as quick as that/ \u0027Right/ said Jake, accepting the beer. He gave the bottle a quick shake, forced the top off with a practised thumb. Then, changing the subject as the warm beer foamed, \u0027No cans?\u0027 he inquired. He passed the bottle to Liz, took hers and repeated his trick, with the same result. The beer wasn\u0027t flat; these bottles were old stock, but they hadn\u0027t been opened previously.And meanwhile: \u0027Cans? I don\u0027t hold with \u0027em/ the oldster told him. \u0027All this newfangled shite! But yer can trust a bottle/ And turning to Liz again, \u0027You were sayin\u0027?\u0027\u0027No/ she answered, \u0027you were saying. You asked what we\u0027re doing out here/\u0027Well then?\u0027 he pressed.She smiled. \u0027Can you keep a secret?\u0027He shrugged his hunched shoulders, sat down on a barrel on his side of the plank and chuckled. \u0027And who do yer reckon I\u0027d be tellin\u0027?\u0027Liz nodded. \u0027We were visiting kin in Wiluna, decided to get married sort of quick. So here we are, run off where no one can find us/\u0027Eh? Honeymooners, yer say? Run off on yer ownsome and left no forwardin\u0027 address? All out o\u0027 touch, secret an\u0027 private in the Gibson Desert? Huh! Hell o\u0027 a place fer a honeymoon .. /\u0027I told him the very same thing/ Liz nodded her agreement, shaking an I-told-you-so finger at Jake.And Jake said, \u0027Anyway, we\u0027re headed north. We thought we\u0027d take a look at the lakes, and - \u0027 \u0027Lakes?\u0027 the old fellow cut in, frowning. \u0027Yer visitin\u0027 the lakes?\u0027 Then, with a knowing nod of his head, he muttered, \u0027Big disappointment, that/ \u0027Oh?\u0027 Jake lifted an eyebrow. But the oldster only laughed out loud and slapped his thigh. \u0027Lake Disappointment!\u0027 he guffawed. \u0027Way up north o\u0027 here. Damn me, they falls fer it every time!\u0027 He sobered up, said, \u0027Lakes, eh? Somethin\u0027 ter see, is it? Huh! Plenty o\u0027 mud and salt, but that\u0027s about all/ \u0027And wildlife!\u0027 Liz protested.\u0027Oh, aye, that too,\u0027 he said. \u0027Anyway, what would I know or care? I \u0027ave me own wildlife, after all.\u0027\u0027The creature?\u0027 Jake swigged on his beer.\"Im\u0027s the one,\u0027 the old boy nodded. \u0027Yer wanna see \u0027im?\u0027Jake had done with studying the oldster. But he would certainly like to take a closer look at this shack - or what lay behind it or maybe beneath it. Liz could feel his curiosity, no matter how hard he tried to keep it from the old boy. Moreover, she knew that between them they must check this place out, and so decided to do her bit, create a diversion as best she could. And anyway (she told herself), the old man didn\u0027t seem much of a threat.I\u0027d like to see him,\u0027 she said. \u0027I mean, what\u0027s the mystery? What kind of creature is it, anyway? Or is it just a con - some mangy, diseased dingo crawled in out of the desert - to pull in a few more travellers?\u0027 And to her partner, though she knew he wouldn\u0027t take her up on it: \u0027What about you, Jake? You want to come and see this thing?\u0027Jake shook his head, took another pull at his bottle. \u0027Not me, Liz. I\u0027ve a thirst to slake. But if you want to have a look at some mangy dog, well, go right ahead.\u0027 Almost choking on the words, he got them out somehow. Damn it to hell - the idea was supposed to be that they didn\u0027t get split up.\u0027 He hoped she knew what she was doing. There again, she\u0027d been in this game longer than he had. And that pissed Jake more than a little, too: the fact that Liz was in effect the boss here.\u0027Torch,\u0027 said the old boy, taking a heavy rubber-jacketed flashlight from the shelf and handing it to Liz. \u0027Yer\u002711 need it. I keeps \u0027im in out o\u0027 the sun, which would surely fry \u0027is eyes. But it\u0027s dark in the back o\u0027 the shack there. And this time o\u0027 evenin\u0027 even darker in \u0027is cage.\u0027 When she looked uncertain, didn\u0027t move, he cocked his head on one side and said, \u0027Er, yer just follers the signs, is all.\u0027 Liz looked at him, hefted the torch, said, \u0027You want me to go alone?\u0027 \u0027Can\u0027t very well get lost!\u0027 he said. But then, grumblingly, he hobbled out from behind the makeshift bar. \u0027It\u0027s these old pins o\u0027 mine,\u0027 he said. \u0027See, they don\u0027t much like ter go. But yer right - can\u0027t let a little lady go wanderin\u0027 about in the dark on \u0027er own. So just you foller me, miss. Just you foller old Bruce.\u0027 And then they were gone.Jake took a small pager out of his pocket and switched it on. Now if Liz got in trouble she only had to press the button on her own beeper and he would know it... and vice versa. For in this game it was just as likely that he would be the one to make a wrong move.Those were his thoughts as he stepped silently behind the bar, and passed through a second bead curtain hanging from the timbered ceiling to the floor. And as easily and as quickly as that he was into a horizontal mineshaft, and almost as quickly into something far less mundane ...Liz had followed the old man (Bruce? Hell of a lot of Australians called Bruce, she thought. There had to \\\u003ee at least as many as there were Johns in London) along the foot of the knoll to the lesser shack that leaned into an almost sheer cliff face. It was quite dark now, and the torch he\u0027d given her wasn\u0027t nearly working on full charge. The batteries must be just about dead. Of course, knowing the place as he did, that wouldn\u0027t much concern the old boy, but it concerned Liz. And despite that she followed slowly and carefully in old Bruce\u0027s footsteps - mainly to give Jake the time he needed to look the place over - still she stumbled once or twice over large rocks or into this, that, or the other pothole. But, in truth, much of her stumbling was a ploy, too, so that it was perhaps a good thing after all that the torch was almost spent. She thought so at the outset, anyway. Until eventually: \u0027Here we are,\u0027 the old man said, turning a key in a squealing lock and opening an exterior screen door. Beyond that a second door stood ajar; and as old Bruce, if that really was his name, reached out an incredibly long arm to one side of Liz to push it fully open - at the same time managing to bundle her inside - so she recognized the smell of a lair.It was a primal thing, something that lies deep in the ancestral memories of every human being: to be able to recognize the habitat of a dangerous animal or animals. The musty, feral smell of a cavern where something dwells - or perhaps an attic where bats have hibernated for untold years - or maybe the reptile house in a zoo.But there are smells and smells, and this wasn\u0027t like anything Liz had ever come across before; or perhaps it was simply the tainted, composite smell of all of them. Until suddenly she realized that it wasn\u0027t just a smell - wasn\u0027t simply a smell - but her talent coming into play, and that the stench wasn\u0027t in her nostrils alone but also in her mind.\u0027And then she had to wonder about its origin, the focus or point of emanation of this alien taint. Was it the shack - or the steel-barred, wall-to-wall cell it contained - or perhaps the night-black tunnel beyond the bars, with its as yet unseen, unknown \u0027creechur\u0027 ... or could it possibly be old \u0027Brace\u0027 himself?There came a sound from the darker depths of the horizontal mine shaft. And just as there are smells and smells, so are there sounds and sounds. Liz gasped, aimed her torch-beam into the darkness back there, and saw movement. A flowing, gathering, approaching darkness in the lesser dark around; an inkblot of a figure, taking on shape as it came, bobbing, wafting on a draft of poisonous air from wherever and whatever lay beyond. And it had luminous yellow eyes - slanted as a beast\u0027s, and yet intelligent, not-quite-feral - that held her fixed like a rabbit in a headlight\u0027s beam!But only for a moment. Then - \u0027You.\" Liz transferred the torch to her left hand, dipped her right hand into a pocket and came out with a modified Baby Browning, used her thumb to release the safety and aimed it at the old man ... or at the empty space where he had been. While from outside in the night, she heard the grating of his booted feet, his now obscene chuckle, and the squeal of a key turning in the exterior screen door\u0027s lock as he shut her in.Hell! But this could quite literally be hell! Along with her talent - held back far too long by her desire not to alert anyone or anything to her real purpose here - Liz\u0027s worst fears were now fully mobilized, realized. She knew what the creechur in the mineshaft was, knew what it could do. But even now she wasn\u0027t entirely helpless.Tucking the torch under her arm, she found her beeper and pressed its alarm button ... at the precise moment that it commenced transmitting Jake\u0027s own cry for help!The shock of hearing that rapid beep! beep! beeping from her pocket almost made Liz drop the torch; she somehow managed to hold on to it, held her hands together, pointed the gun and the torch both through the inch-thick bars of the cage. But as the weak beam swept the bars, it picked out something that she hadn\u0027t previously noticed; there had been little enough time to notice anything. The cage had a door fastened with a chain and stout padlock - but the padlock hung on the inside, the other side, where it dangled from the hoop of its loose shackle!She knew what she must do: reach through the bars, drive home the shackle to close the padlock. A two-handed job. Again she put the torch under her arm, fumbled the gun back into her pocket. Then, in the crawling, tingling, living semi-darkness, Liz thrust her trembling hands between the bars ... and all of the time she was aware of the thing advancing towards her, its slanted, sulphurous eyes alive on her ... and the beeper issuing its urgent, staccato mayday like a small, terrified animal... and on top of all this the sudden, nightmarish notion: But what if this thing has the key to the padlock!? At that moment it was Liz Merrick who felt like some small, terrified, trapped animal - but a human animal. While the thing striding silently, ever closer to her along the shaft was anything but human, though it might have been not so long ago. It was almost upon her; she smelled the hot stench of its breath!","sourceLink":"https://allnovel.net/necroscope-invaders-necroscope-11/page-2.html","bookId":2597,"book":{"id":2597,"title":"Necroscope: Invaders (Necroscope #11)","description":"Storyline: Necroscope: Invaders (Necroscope #11) Three great vampires--two Lords and a Lady--arrive on an unsuspecting Earth that teems with defenseless humans, easy prey for the marauding vampires. But humanity has defenders. Though the necroscope is gone, the psychically gifted men and women of E-Branch move swiftly against the vampire infestation. Jake Cutter is running for his life through the streets of Turin when he vanishes, appearing moments later inside the triply locked \"Harry\u0027s room\" in E-Branch\u0027s London HQ. Jake\u0027s dreams are very strange, filled with the voices of the dead--the Great majority, the Necroscope, Harry Keogh, even a dead vampire. He hears them all, but he doesn\u0027t truly understand. If Jake is the new Necroscope, he has to learn--fast!--how to control his powers and speak to the dead. E-Branch, with the reluctant Jake along for the ride, is about to go head-to-head with Malinari the Mind, a vampire Lord who psychic abilities are second to none. But the dead don\u0027t trust Jake, not like they trusted Harry. Jake\u0027s got personal revenge on his mind, and he\u0027s spending too much time talking that dead vampire. He\u0027s got to start thinking about the future--or he won\u0027t have one!","cover":"https://allnovel.net/images/necroscope-invaders-necroscope-11.jpg","author":"Brian Lumley","type":"Horror","source":"allnovel","link":"https://allnovel.net/necroscope-invaders-necroscope-11.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:24:57 PM"}}
