{"id":97208,"no":9,"title":"Page 9","content":"Miller, And The Trouble With DreamsIn the helicopter park, voices were raised in anger. One was a rasp: Ben Trask\u0027s. And the other was high-pitched, shrill, and threatening. In short, blustering; but the mind behind it held threatening knowledge, certainly.\u0027Try to see sense, man!\u0027 Trask was growling, as Jake and Lardis approached the well-lit area where a handful of Branch agents and chopper ground staff stood in a clearing and watched the show. \u0027Sense? Sense?\u0027 Miller was in one of the two helicopters, belted into a passenger seat near the section of aluminium frame that formed both cabin wall-panelling and steps. At present the steps were \u0027down\u0027 and Miller was seated opposite the open door, from where he looked down on Trask outside the aircraft. \u0027What? Are you telling me my attitude is nonsensical? But I know what I saw tonight, and it wasn\u0027t of this Earth. It was intelligent, and alien ... oh, and it was ugly, yes. But I also saw the devastating force that your thugs used against it, which was even more inhuman! So who the hell are you, Mr Trask? Some kind of monster yourself? You and your people: you\u0027re not the military, not even Australian. It\u0027s obvious to me that you\u0027ve duped somebody somewhere. As for those poor aliens: whoever they are and wherever they\u0027re from, they deserved a lot better welcome than you gave them. This is Earth Year - dedicated to the ecological survival of the planet - and you might well have condemned our world to interplanetary isolation. Worse, we may even find ourselves at war.\"The precog lan Goodly stepped out of the shadows and spoke to Jake and Lardis. \u0027This idiot obviously has some kind of bee in his bonnet. \"The flying saucers have landed,\" and all that rot. He seems to think we\u0027ve been murdering aliens - visitors from another world, that is - out of hand!\u0027\u0027Haven\u0027t we?\u0027 Jake looked at him.\u0027No/ Goodly answered. \u0027We killed invaders. Visitors don\u0027t arrive uninvited, stay, and kill off or enslave the occupiers. But invaders frequently do ... and the Wamphyri always do! Not knowing everything, Miller sees our action tonight as an unprovoked assault, a pre-emptive strike, against \"beings\" whose intentions hadn\u0027t been fully determined. We, on the other hand - knowing the entire story, having been here, or there, before - see it differently. We see tonight\u0027s action for what it really was: the only cure for a nightmarish plague that submits to no other antidote.\u0027 And meanwhile:\u0027Miller, come down out of there/ Trask was insistent. \u0027The airplane you\u0027re sitting in has been serviced and fuelled for an important mission. You\u0027re cutting into a tight schedule/\u0027That\u0027s Mr Miller to you!\u0027 the other snapped. \u0027And I\u0027m delighted to be disrupting your vile schedule! What, am I preventing another massacre like the one you organized tonight? Good! My God! How many of these poor people have landed, then?\u0027\u0027You see?\u0027 Goodly muttered. \u0027They\u0027re \"poor people\" now. I mean ... is Miller unbalanced or what? He had a ringside seat for tonight\u0027s show, yet he\u0027s still not convinced!\u0027Lardis had seen and heard more than enough. Freeing himself from Jake\u0027s helping hand, he moved up alongside Trask and, in a lowered tone, said, \u0027Why don\u0027t you just drag his arse out of there?\u0027 \u0027I was trying to be diplomatic/ Trask answered under his breath. \u0027It didn\u0027t work/ said Lardis. Trask nodded and said, \u0027That\u0027s why I sent for you.\u0027 Then, turning away, he said, \u0027Get him out of there. And bring him to the big Ops truck. Maybe his own authorities can convince him, for I certainly can\u0027t. Jake, help Lardis after he\u0027s got Miller down from there.\u0027 \u0027Why don\u0027t I just do it for him?\u0027 Jake was surprised. \u0027The old boy, well... he\u0027s old.\u0027 Trask agreed. \u0027He\u0027s full of old ways, too. So don\u0027t worry, he\u0027ll manage okay, and probably scare Miller half to death into the bargain. Serve the bastard right!\u0027 And without another word he went on his way, and lan Goodly went with him. Meanwhile Lardis had climbed the steps, leaned inside the chopper\u0027s open door, and was showing Miller his machete. \u0027Sharp as a razor/ he said. \u0027You could shave with this - except you\u0027d get tired holding it up to your face. See these notches in the grip? Twenty-seven of \u0027em. Twenty-seven exec - er, excecu - er, killings, yes. And all of them were these \"people\" you seem so fond of. D\u0027you know why I killed \u0027em?\u0027 \u0027Bloodthirsty old lunatic!\u0027 Miller hissed. \u0027Well, I don\u0027t know where you come from - what reservation? - but where I\u0027m from we\u0027re educated and civilized. Don\u0027t try to threaten me. I don\u0027t give a.fuck for your big knife!\u0027 Which was more bluster, for anyone in his right mind would certainly give a fuck about Lardis\u0027s machete. And Miller\u0027s language was slipping, too. In any case it was as if Lardis hadn\u0027t even heard him. \u0027I killed \u0027em \u0027cause they eat fat little girls like you/ he said. \"Cause they\u0027re a contain - er, a contamin - er .. /\u0027Contamination/ said Jake from the foot of the steps. \u0027Damn right!\u0027 Lardis nodded. He put the point of his machete up to Miller\u0027s neck inside the nylon seat belt, and continued, \u0027Now Ben Trask wants you to come down out of there. He was asking you nicely, because he believes in being diplomatic. But me, I don\u0027t.\u0027 Miller tried to cringe away from the glittering blade, but his seat belt trapped him in position. \u0027Are you ... do you dare to threaten me?\u0027 he gasped.\u0027Dare to threaten you?\u0027 said Lardis, his dark eyes narrowing to slits. \u0027Hell, no, \"Mr\" Miller! This isn\u0027t a threat but a promise. If you don\u0027t move your arse out of there, I\u0027m going to cut your fucking ears off!\u0027 And he made a sudden slicing motion with his machete.Miller screamed aloud, and for a moment Jake thought that Lardis really had cut him. But no, he\u0027d sliced upwards and outwards, and his fine-honed blade had passed with scarcely a hiss through Miller\u0027s seat belt above the shoulder. Miller had been straining away from the Old Lidesci; freed from the safety harness, he jerked from his seat in that direction and fell to his hands and knees on the helicopter\u0027s floor. Lardis stepped over him, and while the little fat man was still off-balance grabbed him by the scruff of the neck and the seat of his pants to send him bouncing down the steps. It didn\u0027t take too much effort.Miller\u0027s blubber saved him from any real hurt, but still he yelped as he hit the dirt; yelped yet again as Jake hoisted him to his feet - only to put him in an arm lock. \u0027Mr Trask is waiting for you/ Jake told the babbling fat man, as he frogmarched him in the direction of the Operations truck ... In Ops, Trask stood inside the oval control desk, speaking earnestly into a telephone. \u0027Yes, I appreciate the lateness of the hour... I understand perfectly, sir, and I agree entirely. But in this case I\u0027m sure that only the highest authority will suffice ... You may believe me when I tell you that this really is as important as your Minister for Internal Security has reported, a matter of the gravest security. I certainly wouldn\u0027t have had you brought from your bed for anything less ... He\u0027s called Peter Miller, sir - that\u0027s \"Mr\" Miller - our so-called \"local liaison\". Not very helpful, sir, no. Indeed, completely hysterical, as I\u0027ve said ... That\u0027s what I would suggest, yes, absolutely ... Until we\u0027re finished here, yes. That is, of course, if you\u0027re in agreement... ? Confinement. I\u0027m afraid so, yes. Oh, we have the means. But Miller - Mr Miller - is an Australian citizen, sir, and we\u0027re not. Which is why I need your ... ?\u0027 Trask looked up, saw Miller\u0027s face throbbing with rage and \u0027righteous\u0027 indignation where Jake\u0027s hand was clamped over his mouth. The sight of the man, in no way pacified, seemed to convince Trask of the course he must take. And:\u0027Perhaps you\u0027d like to have a word with him in person?\u0027 he continued into the phone. \u0027See for yourself, as it were?\u0027 With a nod and a grimace he passed the phone to Miller, at the same time indicating that Jake should release him.Miller shook himself, reeled, and said, \u0027Eh? What?\u0027 Intent on freeing himself from Jake\u0027s grasp, he\u0027d taken in very little of Trask\u0027s conversation with the unknown other.But now Trask said, It\u0027s for you ... someone who wants to know how you\u0027re keeping?\u0027\u0027Bloody crazy Pommy bastards!\u0027 Miller raved. \u0027And who the hell is this, the Prime-bloody-Minister?\u0027 He snatched the telephone from Trask\u0027s hand, yelled, \u0027Whoever you are, the man you were speaking to is not a reasonable human being. He\u0027s fucking British, a fucking murderer, and I\u0027m a God-fearing, completely innocent fucking Australian! This is my goddamned country, for Christ\u0027s sake, and I demand to speak to the police, to the military, to someone in authority, to ...\u0027\u0027... To the Prime-bloody-Minister, perhaps?\u0027 said Ben Trask, coolly examining his fingernails. And under his breath, to the others in the trailer: \u0027Lance Blackmore, whose platform slogan, if I remember correctly, was \"Sanity, sobriety, and common decency in speech and spirit.\" Oh, and something else: he\u0027s decidedly pro-British!\u0027Miller\u0027s round face was suddenly wobbling, its colour visibly changing, paling. \u0027Eh?\u0027 he gulped. \u0027Do I what? Your voice? Do I recognize it?\u0027 Well, maybe he did ... and maybe not. With his pig-eyes narrowing, he stared suspiciously at the phone - then at Trask - and spat, \u0027Some lousy fucking Pommy con man you are! And this is supposed to be Lance bloody Blackmore, right? Oh really? What, at two o\u0027clock in the morning? After what I\u0027ve seen and been through tonight, you expect me to believe that my own Prime Minister, the Australian Prime-bloody-Minister, would condone ... ?\u0027But the telephone was making loud noises in Miller\u0027s ear, and suddenly his face was floppily mobile again. For this time the owner of the now angry voice was fully awake and the voice itself unmistakable. As Miller\u0027s flabby mouth fell open, Trask took back the telephone and spoke into it. \u0027There you have it, Prime Minister. Now you know what we\u0027re up against.\u0027 And a moment later: \u0027Yes, certainly, I shall see to it myself. Physical restraint - house arrest, shall we say? - until we\u0027re through here? Thank you. And there will be a copy of my report on this phase of the operations on your desk by noon, yes. So far it\u0027s -looking good. My pleasure, sir. Thank you once again. And goodnight.\u0027 He put the \u0027phone down.\u0027It was him.\" Miller gasped, his mouth opening and closing like a stranded fish. \u0027It really was Lance Blackmoref Clenching his pudgy fists, he glowered at Trask: \u0027You duped him.\u0027 You even duped the Prime Minister.\u0027 Who the fuck are you people?\u0027Trask shook his head in disgust. \u0027Once your mind\u0027s made up it really is made up, isn\u0027t it, Miller?\u0027 \u0027That\u0027s Mr Miller - \u0027\u0027Oh, shut the fuck up!\u0027 Trask was mad now. He reached over the desk, grabbed the fat man by the front of his sweaty shirt, bunched a fist and drew it back ... then thought better of it. Instead he gave him a shove, sent him reeling back into Jake\u0027s arms. And before Miller could start up again: \u0027You\u0027re under arrest. If you protest too loudly I\u0027ll have you gagged. If you come on all physical I\u0027ll have you bound. If you attempt any interference with the work going on around you, I\u0027ll put you under constant surveillance by Lardis Lidesci. And if you\u0027re stupid enough to make another run for it, then you\u0027d better be aware I\u0027ll deal with you ... far more severely. Have I made myself clear?\u0027 \u0027Why, you ... you!\u0027 Miller mouthed, his furious expression speaking volumes more than all of his frothing bluster. And so:\u0027When I turn you over to your Internal Security people in Perth tomorrow,\u0027 Trask went on, \u0027they\u0027ll read you the riot act, demand that you sign an Oath of Silence, give you to understand how very much in error you are, and generally threaten you with all sorts of dire things if you so much as mention anything you witnessed as our regional liaison person during this operation. And believe me, Miller, even if they can\u0027t make it stick I can. Don\u0027t for a moment think I\u0027m going to forget the trouble you\u0027ve put me to. And something else you should remember: in this modern world of ours distance isn\u0027t a problem. I\u0027ll be back in the UK shortly - I hope - but I have the longest arms in the world. And if I ever suspect that you\u0027re out there somewhere flapping those soft self-righteous lips of yours - \u0027Trask paused for breath, and Lardis Lidesci said, \u0027 - Then he\u0027ll send me to stop you flapping them - perhaps permanently!\u0027 The Old Lidesci stood in the narrow doorway, holding his machete to his chest, thumbing its blade and turning it in his hand to make it reflect the Ops Room\u0027s lights into the fat man\u0027s eyes. \u0027Twenty-seven notches, remember, Miller? But in your case, I\u0027d just love to make it twenty-eight.\u0027Miller flinched a little but his expression didn\u0027t change. And again he blurted, \u0027You ... you ... you!\u0027 \u0027Obviously I haven\u0027t made myself clear,\u0027 Trask sighed. And to Jake: \u0027See if there\u0027s a spare bunk room back there, will you? And lock this fuckhead safely inside it!\u0027 And that was that, for the moment.Finally, they could all get some sleep. To some, a jplessing...But Jake Cutter didn\u0027t much care for sleep. For some time now, in fact since his weird escape almost a week ago, sleeping had been a problem. Oh, he could do it, and he could do with it - indeed, his eyes felt heavy from the lack of it - but he didn\u0027t want to do it. Because when he went to sleep, that was when the Other woke up. That bloody Other, that one who was there in the back of his mind. And when Jake slept... why, then he couldn\u0027t be sure that his dreams were his at all.He hadn\u0027t told Ben Trask about it, mainly because he suspected that Trask would be interested. It was the relationship that was developing between them: just as the Head of E-Branch continued to hold things back, so did Jake Cutter. In his book trust was something that could only work if it was mutual.And so he was left to face it on his own, and sleep was a necessity he avoided as best he could while yet recognizing, of course, that it was a necessity. It wouldn\u0027t be so bad - or so he told himself - if only he could remember what these troubled dreams of his were about afterwards, when he was awake; or, then again, maybe it would. And maybe that was why he couldn\u0027t remember them: because he didn\u0027t want to ...Lardis Lidesci sat with Jake a while, heaped a little wood on the dying fire, opened a can of sausages and beans in tomato sauce and ate them cold. The Old Lidesci smacked his lips appreciatively. \u0027Some of the things in this world ...\u0027 he said, then started again, \u0027 - hell no, most of \u0027em.\u0027 - I could do without. But a can-opener and a can of beans ...\u0027 he grinned, smacked his lips again, and shook his head. \u0027Well, these beans and the meat in these sausage things, they\u0027re a sight easier on these gnarly old tusks of mine than roasted shad, I can tell you!\u0027 \u0027Shad\u0027s a fish,\u0027 Jake said, tiredly. \u0027In this world, sure,\u0027 Lardis nodded. \u0027But the first time I see a fish pull a caravan ... I\u0027ll quit drinking plum brandy, and that\u0027s a vow/\u0027 He held the empty can in one hand, the can-opener in the other, looked at each in turn admiringly, burped and uttered a sigh. \u0027But since my people don\u0027t have cans, what good\u0027s a can-opener?\u0027 \u0027You and Trask could drive a man mad,\u0027 Jake told him without looking up. \u0027You come up with this weird stuff right out of the blue, as if I\u0027m supposed to know what the hell you\u0027re talking about! I mean, I\u0027ve seen enough now to know this isn\u0027t some gigantic leg-pull, so what the hell is it?\u0027 \u0027Hell\u0027s just about right,\u0027 Lardis grunted, creaking to his feet. He laid a hand on Jake\u0027s shoulder. \u0027But, son, take my word for it: Ben\u0027s not trying to drive you mad, and neither am I. It could be we say these things hoping you\u0027ll recognize something, hoping you\u0027ll perhaps remember.\u0027There was something in Lardis\u0027s gruff old voice that caused Jake finally to look at him. \u0027But remember what?\u0027 he said.And it was as if they stared deep into each other\u0027s souls. So that for a moment - just for a moment - it seemed that they had known each other, oh, for quite some time. Then Lardis nodded, and as though he had read Jake\u0027s mind said:\u0027Other times, maybe? Other places?\u0027\u0027Times and places?\u0027 Though Jake tried hard to understand, still it was beyond him. \u0027Make sense, can\u0027t you?\u0027 There was no anger now, just a need to know.\u0027A time on Starside, perhaps,\u0027 Lardis said, still staring hard at Jake, \u0027when a man and his changeling son laid waste to the aeries of the Wamphyri? Or a time when the same man lay in the arms of a wonderful woman, whose name was Nana Kiklu. Or a time when we met - met for the last time, that man and I - in the ruins of The Dweller\u0027s garden, when it was already far too late for him ...\u0027Lardis\u0027s words conjured pictures that came and went. They meant something - Jake knew that much at least - but they were monochrome things; they flickered like the frames of some ancient silent movie ... jerky scenes and twitching puppet figures. And despite that Jake thought he recognized some of them, still it was as if he saw them through someone else\u0027s eyes:He looked down on a plain of boulders, lit silver-grey beneath a tumbling moon, where distant spires climbed to a sky of ice-chip stars. And that alien sky was alive with flying beasts whose weird shapes ...! God, those shapes! Designs not of Nature but of Nightmare!As quickly as it had come the scene was gone, disappeared, and another took its place. A garden - The garden? - where a younger Lardis stood by a wall and gazed upon a scene of desolation. A windmill\u0027s crumpled vanes slumped all lopsided atop a skeletal, tottering timber tower; some of the roofs of low stone dwellings hadfalien in; the trout pools were green with algae., and the greenhouses were tangles of shattered frames, leaning or fallen flat, with clumps of bolted vegetation sprouting through their torn plastic sheeting.The pictures continued to flicker and blur, and the oddly young Lardis turned jerkily to stare at Jake ... or at the one gazing back at him through Jake\u0027s eyes. But in this not-so-Old Lidesci\u0027s eyes there was fear, and in his hands a shotgun that came swinging,frame byjlickeringframe - click, clickety-click - in Jake\u0027s direction. And the look in Lardis\u0027s eyes was no longer fear, or not entirely, but fear combined with deadly intent! Abruptly, the scene changed:To the straining face of a handsome woman. Handsome, yes, but by no means beautiful - yet beautiful, too, in her way. Her body was beautiful, certainly. And hands (Jake\u0027s handsP) on her breasts where they lolled in his face. And her breath.like Jire in his (or some other\u0027s?) flared, nostrils, and. the sweat of her passion as slippery and hot on his hands as the wet core of her womanhood where it sheathed his jerking flesh. Nana?\u0027Nana!\u0027 Jake exclaimed, as the scene slipped from memory - but his memory? - and he found himself seated by the campfire, his hands before his face, perhaps to fondle (whose? What was her name?) the handsome woman\u0027s breasts, anyway, or perhaps to ward off Lardis Lidesci\u0027s shotgun. Well, there was the old man, sure enough, but now more surely the \u0027Old\u0027 Lidesci as Jake knew him; and he had no shotgun but a strange satisfied look on his face.\u0027And it\u0027s Nana, is it?\u0027 Lardis said, with a knowing nod, as Jake\u0027s mind swam back into focus and he slowly lowered his trembling hands. \u0027Took you back a ways, didn\u0027t I, my young friend?\u0027\u0027What... what did you do to me?\u0027 Jake whispered, the words sighing out of him. \u0027I have an ancestor\u0027s seer\u0027s blood in me,\u0027 Lardis answered. \u0027It smells things out. And I think that it has smelled you out, too, Jake Cutter. For just as this art of my forebears has been passed down to me, so something has been passed to you. It\u0027s in you, man.\u0027 Not in your blood, as it was in Nestor\u0027s and Nathan\u0027s blood, but buried in your mind and your soul for sure!\u0027 And now the look on the Gypsy\u0027s face was one of awe as much as anything else. \u0027It\u0027s in me, yes,\u0027 Jake agreed, knowing it was so. And then, coming very close to desperation, \u0027But what is it, Lardis? What is it?\u0027The other shook his head. \u0027No, no. Ben wouldn\u0027t want me to say any more. Indeed, he\u0027d nag that I\u0027ve already said too much! It will have to take its own good time, that\u0027s all. But what\u0027s in will out, of that you can be sure. And now, goodnight to you, Jake Cutter.\u0027 With which he backed off, and like the wild thing he was faded into the night...Maybe Jake had been too tired to dream, or perhaps he had managed to fight it off this time. Whichever, he had slept deeply, soundly and dreamlessly, and remembered coming awake only once, when he\u0027d thought he\u0027d heard a vehicle\u0027s engine starting up. Then he\u0027d eased his cramped body off the chair, zipped himself into a sleeping bag, and curled up right at the edge of the fire\u0027s cooling embers - - And now came starting awake as the toe of a boot nudged him and Trask\u0027s voice rasped, \u0027Jake, get up. Have you seen anything of Miller? Obviously not. Well, the fat bastard\u0027s run out on us, and in your bloody vehicle! Damn, I thought for a moment you\u0027d gone with him!\u0027Throwing back the mosquito net from his face, Jake unzipped the bag and struggled out of it. Now he remembered the engine starting up, dipped headlamps swinging faint beams out onto the road, and the cautious crunch of tyres on dirt and pebbles. He had thought at the time that someone was being very careful not to awaken the camp ... and he\u0027d been only too right!\u0027My vehicle?\u0027 he mumbled, but Trask had already moved on.The entire camp was coming awake, and overhead the shrill, pulsing whistle of a jet-copter cutting its thrusters; the whup - whup - whup of its vanes lowering it down from a sky in which the stars119were only just beginning to fade. And the first faint nimbus of dawn silhouetting the treetops and shining on rising, writhing wisps of mist.\u0027Hell\u0027s teeth.\" Lardis Lidesci groaned where he came stumbling from the direction of the big articulated Ops vehicle. As he came, his trembling right hand gingerly explored a blackened patch of bloodied, matted hair on the left side of his head. It looked ugly, and was made to look worse by a flow of blood that had run down and congealed around his ear. \u0027Damn the bloody man to hell.\" he said.Meeting him halfway, Trask grunted: \u0027Miller?\u0027 \u0027Wouldn\u0027t you just know it?\u0027 Lardis nodded, then groaned and held his head again. \u0027I bedded down under the steps at the back of Ops. And I heard something in the dead of night, something breaking. But these damned short nights of yours ... my system\u0027s all out of kilter with them ... I\u0027m used to sleeping, not these forty winks that you people take.\"\u0027You didn\u0027t wake up till too late,\u0027 Trask grunted. I\u0027m not a damned watchdog!\u0027 Lardis snapped. Trask shook his head. Tm not blaming you, Lardis. Hell, I didn\u0027t think the crazy bastard had enough guts to make a run for it! So if it\u0027s anyone\u0027s fault it\u0027s mine. I should have posted a guard on him.\u0027lan Goodly came loping, looking more than a little angry with himself. \u0027The camp\u0027s awake,\u0027 he said, sourly.Trask looked at him and growled, \u0027You too? It seems we\u0027re each and every one of us blaming himself.\u0027\u0027But I\u0027m the precog,\u0027 Goodly chewed on his top lip.\u0027Right,\u0027 Trask agreed, \u0027but one man can\u0027t foresee it all. And let\u0027s face it, if you could anticipate everything that was coming...\u0027\u0027... Then I would probably have killed myself a long time ago, yes,\u0027 Goodly nodded. \u0027But damn it, I did see this one!\u0027 \u0027You what?\u0027 Jake was wide awake now. \u0027So why didn\u0027t you do something?\u0027 \u0027I saw it in my sleep,\u0027 the precog answered. \u0027Saw it as a dream. Hub! When is a dream not a dream? When it\u0027s a glimpse of the future! But even if I\u0027d known what it was, how would I have woken myself up? When you\u0027re asleep you\u0027re asleep. And the future guards its secrets well.\u0027 \u0027And I thought I was the only one who was having problems with his dreams!\u0027 Jake said. At which Trask looked at him very curiously ... but only for a moment. There was too much to do.\u0027Okay,\u0027 Trask said, let\u0027s forget it. I\u0027m to blame, Lardis is to blame, lan is to blame, and so is Jake - \u0027\u0027Me?\u0027 Jake raised an eyebrow.\u0027For leaving the keys in your \u0027Rover,\u0027 Trask nodded. \u0027Anyway, no one is really to blame. The problem is we\u0027ve grown too used to dealing with the weird, the abnormal, the monstrous. I mean, if it\u0027s mundane we tend to let it slide. And you couldn\u0027t ask for anything more mundane than Mr bloody Miller!\u0027\u0027I beg to differ,\u0027 said Goodly.\u0027Eh?\u0027 Trask looked at him.\u0027Can I put you fully in the picture now?\u0027 the precog said. And when Trask nodded: \u0027Miller\u0027s a strange one,\u0027 Goodly continued. \u0027When finally I woke up I was worried about my dream. So I went to see if everything was okay. I missed Lardis where Miller must have pushed him back out of sight behind the trailer\u0027s steps, but I found the Duty Officer. He\u0027s going to be okay, but he, too, had been bashed on the head. He was lying in the corridor outside Miller\u0027s bunk with the door on top of him. They\u0027re pretty flimsy, those doors. The hinges had been worked loose.\u0027I wasn\u0027t sure how long the D.O.\u0027d lain there, so I checked that he was okay then went to see if the Ops Room was safe. The place was working as normal ... incoming, that is. Several messages, waiting for answers, and situation reports coiling up on the floor. There was some Cosmic Secret stuff that the D.O. must have been processing when Miller attracted his attention. Quite a bit of it had been decoded. Then I remembered how you\u0027d asked for background information on Miller. That was there, too, coming out of the printer even as I got there. But there was stuff that should have been there and wasn\u0027t ... like a lot of Cosmic Secret stuff from HQ? The printouts had been ripped through and some of the serials were missing. We\u0027ll need to get them duplicated, find out what was on them.\u0027Anyway, I grabbed the stuff on Miller, then began to wake people up. Now they\u0027re all awake, though I don\u0027t see what they can do to help. Oh yes, and here\u0027s all the background information on Miller...\u0027 He thrust some sheets of printout at Trask.But before Trask could even begin reading, Goodly went on: \u0027Miller isn\u0027t as mundane as you think, Ben. But he is an obsessive nut, and the black sheep of the family. His uncle was big in Western Australian politics, got him work as a minor official in a job where he didn\u0027t have a lot to do but could indulge his thirst for power - in however small a way. Why else do you suppose he\u0027s the guardian of a million square miles of nothing? To keep him out of the way, that\u0027s why. Good grief, and we had to get lumbered with him.\u0027 Come to think of it, it\u0027s likely that that, too, came about as a result of his uncle\u0027s influence.\u0027Okay, his obsessions. Anything...! I mean it: this fellow can get hooked on literally anything! An obsessive personality, it\u0027s as simple - or not as simple - as that. But guess what? Back in the late 1970s, early \u002780s, he saw Close Encounters and E.T. - well, who didn\u0027t? But this is Peter Miller we\u0027re talking about.\u0027 He joined a whacky UFO group, of which he\u0027s still a member, and wrote two \"Friendly Aliens Are Here\" books that didn\u0027t get published. Need I say more? No way you could have convinced this bloke that we were in the right last night, Ben. No way at all...\u0027\u0027I see,\u0027 said Trask. And, after he had given it a moment\u0027s thought, \u0027Do we have any idea how long he\u0027s been gone?\u0027\u0027Judging by the D.O.\u0027s signatures in the message log, maybe three, three and a half hours,\u0027 Goodly answered. Trask nodded. \u0027Then he could be anywhere by now. Two hundred and more miles away, for all we know.\u0027 So no good our trying to chase him. Very well, here are the priorities. I want Lardis and the D.O. taken care of as best possible. And I want a man - you, lan - in the Ops chair sending out wanted notices to all the police authorities in a two hundred miles radius ... better make it three hundred miles ... or better still, all of Western Australia!\u0027 But on second thought: \u0027No, wait, send out just one, to the Internal Security people in Perth. He\u0027s their man, after all, so let them go after him. Oh, and check that they have his profile, too, which ought to scotch any \"wild stories\" that Miller may be circulating. And finally, I want to know what was on those missing printouts ...\u0027 Trask paused, shrugged, and eventually continued, \u0027Anyway, there\u0027s one good thing come out of all this: I won\u0027t be wasting half a. day handing Miller over to the IS people in Perth. And as for right now ... I\u0027m hungry.\u0027 He headed for the trench with the back-burner, which someone had fired up. Tm going to have breakfast.\u0027By which time an agent was tending to Lardis, and all over the camp sleepy-looking people were on the move. The jet-copter had landed, and Phillips the pilot was leading a tall, grizzled stranger - strange to Jake, anyway - through the grey predawn light between the trees into the camp\u0027s clearing. Trask spotted them as they came striding through thinning ground mist; waving to attract their attention, he diverted his steps in their direction. Jake followed on behind him.\u0027Grahame,\u0027 Trask smiled a greeting. \u0027If it\u0027s no the laird himself. It\u0027s been quite a few years now.\u0027 But while Jake might wonder at Trask\u0027s assumed accent, the stranger\u0027s seemed perfectly in keeping and went well with the swing of his kilt:\u0027Aye, that it has,\u0027 he rumbled through the full grey beard that gave him his grizzled aspect, grinning to display a bar of strong square teeth. \u0027What, twelve years? How goes it with you, Benjamin? You and yere bleddy gadgets!\u0027They shook hands ... but in the next moment the stranger\u0027s searching eyes, those oh so dark eyes of his, transferred their gaze to Jake. \u0027And this\u0027ll be the subject, is it no?\u0027","sourceLink":"https://allnovel.net/necroscope-invaders-necroscope-11/page-9.html","bookId":2597,"book":{"id":2597,"title":"Necroscope: Invaders (Necroscope #11)","description":"Storyline: Necroscope: Invaders (Necroscope #11) Three great vampires--two Lords and a Lady--arrive on an unsuspecting Earth that teems with defenseless humans, easy prey for the marauding vampires. But humanity has defenders. Though the necroscope is gone, the psychically gifted men and women of E-Branch move swiftly against the vampire infestation. Jake Cutter is running for his life through the streets of Turin when he vanishes, appearing moments later inside the triply locked \"Harry\u0027s room\" in E-Branch\u0027s London HQ. Jake\u0027s dreams are very strange, filled with the voices of the dead--the Great majority, the Necroscope, Harry Keogh, even a dead vampire. He hears them all, but he doesn\u0027t truly understand. If Jake is the new Necroscope, he has to learn--fast!--how to control his powers and speak to the dead. E-Branch, with the reluctant Jake along for the ride, is about to go head-to-head with Malinari the Mind, a vampire Lord who psychic abilities are second to none. But the dead don\u0027t trust Jake, not like they trusted Harry. Jake\u0027s got personal revenge on his mind, and he\u0027s spending too much time talking that dead vampire. He\u0027s got to start thinking about the future--or he won\u0027t have one!","cover":"https://allnovel.net/images/necroscope-invaders-necroscope-11.jpg","author":"Brian Lumley","type":"Horror","source":"allnovel","link":"https://allnovel.net/necroscope-invaders-necroscope-11.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:24:57 PM"}}
