{"id":93841,"no":34,"title":"Page 34","content":"\n Thinking of Anthony Loken brought Jimmy Dugan to mind. She was certain that the young vampire had died in Loken\u0027s pursuit of eternal life. Thinking of Jimmy Dugan brought tears to her eyes. Though she had known very little about him, it was sad to think that he had died so young.\n Sniffling, she closed her eyes, only to open them again a moment later, certain that she was no longer alone in the room. \"Roshan?\"\n He materialized beside the bed, his black clothing blending into the darkness of the room. \"I thought you would be asleep by now.\"\n She shook her head. \"I was thinking of Mr. Dugan.\"\n Roshan grunted softly. \"I\u0027m afraid Loken has another victim.\"\n \"Oh, no! Who?\"\n \"A young man he met at the Nocturne tonight.\"\n She stared up at him, her green eyes filled with concern. \"Is there nothing you can do?\"\n \"I called the police, for all the good it did. They searched his house but didn\u0027t find anything. I should have known they wouldn\u0027t.\"\n \"At least you tried. That is all you can do.\"\n He nodded, thoughts of the unknown young man\u0027s fate receding as Brenna\u0027s nearness filled his senses. She was here, in his house, in his bed, and he wanted her. Sitting on the edge of the mattress, he murmured her name.\n Brenna shivered as his voice moved over her. She heard the question he didn\u0027t ask. Sitting up, she drew him closer, her kiss the unspoken answer to his unspoken question.\n Roshan drew back a little. \"Are you sure?\"\n \"I doubt if I have ever been more sure of anything in my life.\"\n \"Sweetheart!\"\n He dragged her onto his lap, his mouth covering hers, his arms so tight around her she thought her ribs might be in danger of breaking, but then she was kissing him back, pain and pleasure mingling together, until there was nothing in all the world but his mouth on hers. Excitement fluttered in her stomach. Anticipation made her pulses race. His tongue was warm against her throat, his hands gentle as he caressed her.\n Closing her eyes, she surrendered to the wealth of sensations that he aroused in her. Somehow, his clever hands managed to undress both of them, and then he was stretched out on the bed beside her. She had not intended for this to happen again and yet she had known, in her heart of hearts, that it was as inevitable as the sunrise.\n Colors and images flooded her mind, shattering into rainbows of shimmering crystal as his body merged with hers. Her body arched to receive him more fully. Her nails raked his back. She felt his teeth graze her neck and she turned her head to the side, giving him better access to her throat. She moaned softly, her senses overwhelmed with sensation. How could something that should have filled her with revulsion feel so wonderful? In a distant part of her mind, she realized that she was feeling everything that he did, his yearning, not only for their physical joining, but for the sense of belonging that he found in her arms, as she found it in his. Pleasure engulfed her until she felt as though she were drowning in pure bliss, a pleasure so intense it was almost painful, and then she plunged over the edge into ecstasy, and at last fulfillment unlike anything she had ever experienced.\n Rolling onto his back, Roshan drew Brenna up against his side, his arm holding her close. He had no reason to ask if she was all right, not when she was looking at him through heavy-lidded eyes, her expression that of a woman who had been well and truly loved.\n \"Is it this way for everyone?\" she asked.\n \"No.\"\n \"How do you know? Have you taken many women to bed?\" It was a foolish question. He had lived for hundreds of years. No doubt he\u0027d had hundreds of women.\n \"Not so many, all things considered,\" he replied. \"Certainly none like you.\" He brushed his knuckles over her cheek. \"None so beautiful, or so tempting. None that I loved.\"\n Her eyes widened. \"You love me?\"\n \"More than you can imagine.\"\n \"I do not know what to say.\"\n \"Say that you love me.\"\n \"Oh, I do,\" she murmured fervently. \"I do love you.\" A soft smile played over her lips. \"More than you can imagine.\"\n \"Then you\u0027ll stay with me?\"\n \"Where would I go?\"\n \"Anywhere you wish,\" he replied soberly. \"Anytime you\u0027re not happy here, you have only to say the word I\u0027ll buy you a house of your own, if you wish, anywhere you want to live.\"\n \"Truly?\"\n He nodded. \"Truly.\"\n \"That is most generous of you.\"\n \"It\u0027s little enough to give you in return for what you\u0027ve given me.\"\n Her eyes widened in surprise. \"I have given you nothing.\"\n \"Oh, but you\u0027re wrong, my sweet Brenna. You gave me hope and a reason to go on living.\" He brushed a kiss across her lips. \"You\u0027ve given me the most precious gifts any woman can give to a man. Your innocence, your love, and your trust.\"\n Turning onto her side, she wrapped her arms around him. \"I do love you. So very, very much.\"\n He kissed her gently. \"Can you accept me as I am, Brenna? All of me?\"\n \"Yes. I want to share your life, as much of it as I can.\"\n He crushed her close, his heart overflowing as he rained kisses on her cheeks, her eyelids, the curve of her throat, the tip of her nose. \"Promise me you\u0027ll never leave me.\"\n \"I promise.\"\n It was a weighty promise, one he didn\u0027t expect her to keep but, for now, it was enough.\n They made love again, more slowly this time, and then Roshan carried her into the shower and washed her from head to foot. They might have gotten out of the shower before the water grew cold if she hadn\u0027t taken the soap from his hand and returned the favor. Her soapy hands moving over his body was an erotic sensation he had never known before, one that had the expected results.\n It was the cold water that finally drove them out of the shower and down the stairs. Roshan lit a fire in the hearth, then drew her down on the rug, his arm around her shoulders.\n Brenna leaned against him, sleepy-eyed and content as she watched the flames. No doubt Granny O\u0027Connell would be turning in her grave if she could see her granddaughter now, sitting naked on the floor in the arms of a vampire, her virginity well and truly lost.\n Glancing up, she met Roshan\u0027s gaze. \"Are you going to marry me?\" She hadn\u0027t meant to ask the question but, once spoken, there was no taking it back.\n \"Is that what you want, Brenna?\"\n \"Only if you do.\"\n \"And if I said no?\"\n Her heart seemed to drop to the floor. If he didn\u0027t want to marry her, what then? Could she stay here, in his house, as his mistress? Would it be so different from what she was doing now? She knew it would be, though she was reluctant to admit it. It was one thing to succumb to a night of passion in a man\u0027s arms, quite another to make a conscious decision to live with him without benefit of marriage even though, in this time and place, no one seemed to think there was anything wrong with it.\n \"You said you loved me,\" she reminded him, her voice barely audible.\n \"I do.\"\n \"But you do not wish to marry me?\"\n \"I never thought to marry again,\" he replied slowly. \"I never thought any woman would want me, or be able to accept me as I am now.\" He gazed deep into her eyes. \"Have you thought it through, Brenna? Are you sure this is what you want?\"\n \"Only if you do,\" she said again.\n \"I would be honored to have you as my wife,\" he said quietly. \"I will love you as long as you live.\"\n As long as she lived. The words hit her like a blast of cold air. In time, she would grow old and feeble. Her skin would wrinkle, her hair would turn gray, her hearing and eyesight would grow dim. But time had no claim on Roshan. In twenty years or a hundred, he would be as he was now— strong and healthy and vigorous, a man forever in his prime.\n Roshan watched the play of emotions on her face, the doubts that rose in her eyes. He didn\u0027t have to use his preternatural senses to know what she was thinking. A moment later, her words confirmed his suspicions.\n \"Will you still love me when I am no longer young?\" she asked, her gaze searching his. \"How will you feel when I am old and you are not? When that time comes, will you leave me for someone else? Someone younger?\"\n \"I will never leave you, Brenna, I swear it. Young or old, I will love you as much as I do tonight.\"\n Easy words for him to say, she thought. How would she feel when her youth was behind her? Would she resent all that she had given up to spend her life with him? Would she look back and be sorry that she had given up the chance to be a mother? Would her arms forever ache for the children and grandchildren she had never had? When she was an old woman and the fires of youth and passion no longer burned within her, would she grieve for the life she had given up, for the posterity that had never been born? Would she hate him then because he did not age? Would her hatred destroy the love she felt for him now?\n You do not have to grow old. The seductive words crawled through her mind. You have only to become as he is. If she became a vampire, she would stay as she was. They could be together forever. But did she want to be a vampire? To exist only at night, to survive on the blood of others?\n Unbidden, Anthony Loken came to mind. Perhaps there was another way…\n \"Brenna?\"\n \"Yes, Roshan DeLongpre, I will marry you.\"\n \"Name the day, my sweet.\"\n \"Can we have a big wedding?\"\n \"As big as you wish, though I fear the guests will be few.\"\n She had not considered that. Strange, she hadn\u0027t really missed having friends in this place, she thought. And then she smiled. What need had she for friends when she had Roshan? He filled her every thought, waking or sleeping.\n \"I have no need for guests as long as you are there.\"\n \"Only name the day and the place.\"\n \"Oh!\" The smile faded from her face and she bit down on her lower lip.\n \"What is it? Have you changed your mind already?\"\n \"No, but… that is… I should like to be married in a church and… can you… you won\u0027t…?\" \n","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-34.html","bookId":2299,"book":{"id":2299,"title":"Night\u0027s Kiss (Children of The Night #1)","description":"Storyline: \n Night\u0027s Kiss (Children of The Night #1) \n HE HAS FOUND HIS SOUL\u0027S DESIRE... \n The Dark Gift has brought Roshan DeLongpre a lifetime of bitter loneliness-until, by chance, he comes across a picture of Brenna Flanagan. There is something hauntingly familiar about Brenna, something that compels him to travel into the past, save the beautiful witch from the stake, and bring her safely to his own time. Now, in the modern world, it is Brenna\u0027s seductive innocence and sense of wonder that are utterly bewitching the once-weary vampire, blinding him to a growing danger. For there is one whose dark magick is strong...one who knows who they both are and won\u0027t stop till their powers are his...and they are nothing more than SHADOWS THROUGH TIME...\n \n","cover":"https://allnovel.net/images/night-s-kiss-children-of-the-night-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-kiss-children-of-the-night-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:03:26 PM"}}
