{"id":93811,"no":4,"title":"Page 4","content":"The eighteenth century saw the creation of the piano, the steamboat, and the cotton gin, the fire extinguisher and sextant, submarines and parachutes, and the French Revolution. The seventeenth century gave the world the air pump, the telescope, pocket watches and pressure cookers, Dom Perignon champagne, and the Salem Witch Trials. He closed his eyes as he felt an abrupt cessation of movement, followed by a rush of dizziness. When he opened his eyes again, his house and yard were gone and he was standing outside a circle of gnarled oak trees. In the distance, he saw a small house with a thatched roof. A plume of gray smoke spiraled from the chimney. Yellow candlelight flickered in the window. But it was the woman dancing in the moonlight who caught and held his gaze. A woman with fiery red hair and knowing green eyes. A woman who was naked save for the shimmering veil of her hair and a necklace of amber and jet. He stared at her for stretched seconds, unable to believe his eyes. She was more beautiful than any artist could paint. Her skin was unblemished by mole or scar, her slender figure perfectly formed. Dancing within a circle of white candles, she moved with a lithe grace that carried an air of unconscious sensuality combined with the innocence of a woman who had not known a man\u0027s touch. Moonlight combined with candlelight to bathe her in a halo of silver. Her hair fell over her shoulders and down her back like a river of molten red silk. Captivated, he could only stand there, watching as she lifted her arms toward the heavens, then spun in a graceful circle, chanting, \"Light of night, hear my song, bring to me my love, ere long.\" Her voice wrapped around him, warm and mesmerizing with the same low husky quality he had heard in his mind while he slept, a sound that reminded him of firelight playing over velvet on a winter night. \"Brenna.\" Her name whispered past his lips, and with it a rush of desire the likes of which he had never known. At the sound of her name, Brenna stopped dancing. In an instant, she whirled in his direction, her gaze searching the deep shadows of the night. \"Who is it?\" She took a step forward, unconcerned by her nudity. \"John Linder, is that you? Show yourself if you dare.\" She waited a moment, but heard nothing. Deciding she must have imagined it, she was about to turn away when she saw a bit of movement between one tree and the next. A chill ran down her spine as a dark shape separated itself from the shadows. Her first thought was that she had somehow summoned the devil himself, for the creature walking toward her seemed to be a part of the very night that surrounded her. He was tall and lean with powerful shoulders and long limbs. His hair was as black as the inside of her kettle. Even in the dark she could see that his eyes were a bold midnight blue set beneath straight black brows. His skin was pale, though not sickly looking. More like that of a healthy man who spent little time in the sun. She shivered as his bold gaze met hers. \"Who are you?\" she demanded. \"What are you doing lurking in the shadows in the wee hours of the night?\" \"I\u0027ve come to see you, Brenna Flanagan.\" His voice was soft yet compelling. The sound of it sent another shiver through her. \"How do you know who I am?\" \"I know all about you.\" She lifted one delicate brow in disbelief. \"How can that be, sir, since we have never met?\" He smiled faintly. She noticed that his teeth were very white. \"Perhaps it was your magick that summoned me.\" His voice, what was there about his voice that turned her thoughts down paths no unwed woman should even contemplate? \"Indeed?\" She took a wary step toward him, her eyes narrowing, then widening in shocked recognition. Exclaiming, \"\u0027Tis you!\" She took a hasty step backward, one hand covering her heart. Roshan nodded. Perhaps it had not been his own powers that had brought him to this time and place. Perhaps it had been a bit of witchcraft wrought in the light of a full moon. CHAPTER 3 She looked at him a moment more, then whirled around and ran, quick as a startled doe, into her house and slammed the heavy wooden door behind her. Roshan stared after her a moment before following her. After traveling back five centuries to get here, he wasn\u0027t ready to let Brenna Flanagan out of his sight quite so soon. Her cottage was set in a clearing not far from the grove. It was a small square structure built of weathered wood and stone. Smoke curled from a squat chimney. A single window was covered by a white curtain. There was a well to the left of the house. Reaching her door, he knocked softly and waited. There was no answer. He knocked again, quietly cursing the supernatural restraint that kept him from entering a house without being invited by one who lived there, and prevented him from staying if he was asked to leave. He knocked a third time, louder this time. \"I know you\u0027re in there, Brenna Flanagan. I\u0027m not leaving, so you might as well answer me.\" \"What do you want?\" she asked, her voice muffled by the heavy wooden door between them. \"I just want to talk to you.\" \"About what? Who sent you here?\" \"No one sent me.\" \"Then what are you doing here?\" \"I came to save your life.\" She laughed derisively. \"Then you are wasting your time, sir. As you can surely see, I am in no danger here.\" \"You\u0027re in more danger than you know. Why don\u0027t you let me in and I\u0027ll tell you all about it.\" She was silent for a moment, thinking it over, no doubt. A full minute later, the door opened and Brenna Flanagan stood in the doorway wearing a white apron over a long gray dress. Her feet were bare. \"Come in.\" She took a step back, allowing him entrance to her home. He felt a whisper of energy as he crossed the threshold into her dwelling. It was indeed a small place. The parlor in which he stood was furnished with little more than a couple of chairs and a small wooden table. A black cat was curled up in one of the chairs. Ears flattened, the cat hissed at him, its tail twitching. There were candles everywhere, most of them unlit. A fire blazed cheerfully in the small stone hearth. A black cauldron hung from an iron tripod. Herbs grew in narrow boxes on the windowsill. A broom rested beside the fireplace. Several colorful rugs covered the raw plank floor. He could see the corner of a bed through the partly open door across the room. He looked at the fireplace again. According to what he\u0027d read, witches who wished to keep their craft a secret often used the mantel as an altar. There were a number of baskets and jars on Brenna Flanagan\u0027s mantel, along with a cup, a bell, a pair of white candles, a censer, and a black-handled knife. She studied him a moment before waving her hand in the direction of a ladder-back chair. \"Sit down, then, and tell me how you know who I am and why you think my life is in danger.\" \"I am Roshan DeLongpre,\" he said, pulling one of the chairs from the table. \"I saw your portrait in a book… \" \"Such a thing is not possible.\" Knowing he would never be able to explain it to her, he didn\u0027t try. How could he tell her he had seen her picture in a book he had read on the Internet? How did you explain a computer to someone who lived in an age of horse-drawn carriages? \"It was a portrait painted by John Linder.\" Her eyes widened. \"Who told you about that?\" \"No one. It\u0027s as I said. I saw the painting in a book.\" \"I do not believe you. \u0027Tis impossible.\" \"Is it? You were wearing a white dress and\"— he glanced at the cat sleeping in the chair— \"you were holding a black cat on your lap.\" \"How could you know that?\" She paced the length of the room then stopped in front of him, her eyes narrowed. \"No one knows of that painting. And even if they did, why would anyone put it into a book? A book.\" She shook her head. \"Nay, \u0027tis impossible. I will not believe it unless I see it for myself.\" Reaching into his pocket, Roshan withdrew the picture he had printed off the Web and handed it to her. She stared at the paper for a long moment. It was a replica of the portrait John Linder had painted, though it was much smaller in size. \"What manner of wizardry is this?\" she asked, her voice low and edged with fear. He laughed. \"You\u0027re the witch, not I.\" Her eyes narrowed. \"Who told you I was a witch?\" \"No one told me. I read it in a book.\" \"A book? What book? Show it to me.\" \"I don\u0027t have it with me.\" Wary of leaving any trace of his visit behind, he took the picture from her hand, folded it, and returned it to his coat pocket. \"What day is it?\" She frowned, obviously confused by the sudden change of topic. \"\u0027Tis the thirtieth day of October.\" Roshan grunted softly. \"We haven\u0027t much time then,\" he said, drumming his fingertips on the arm of the chair. \"What do you mean, we\u0027ve not much time? Time for what?\" \"To get you away from here before it\u0027s too late.\" \"You talk in riddles, Mr. DeLongpre. Please, speak plainly, or be gone.\" \"You\u0027re going to die tomorrow night, on All Hallow\u0027s Eve,\" he said bluntly. \"Burned at the stake as a witch.\" She stared at him, the blood draining from her face, and then she shook her head. \"Nay, I do not believe you.\" \"You had better believe me,\" he said. \"Your life depends on it.\" Lifting the cat from the chair across from his, she sat down. The cat immediately curled up in her lap, starring at Roshan through unblinking yellow eyes. \"Did you ever make it rain toads?\" Roshan asked. \"Who told you such nonsense?\" \"Did you complain about one of your neighbor\u0027s pigs rooting in your garden?\" \"You know about that, too?\" she asked, her voice hardly more than a whisper. \"The man died a few days later, did he not?\" \"He had a weak heart. Everyone in the village knew he was ailing.\" \"If I asked you to make me a potion, could you do it?\"","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-4.html","bookId":2299,"book":{"id":2299,"title":"Night\u0027s Kiss (Children of The Night #1)","description":"Storyline: Night\u0027s Kiss (Children of The Night #1) HE HAS FOUND HIS SOUL\u0027S DESIRE... The Dark Gift has brought Roshan DeLongpre a lifetime of bitter loneliness-until, by chance, he comes across a picture of Brenna Flanagan. There is something hauntingly familiar about Brenna, something that compels him to travel into the past, save the beautiful witch from the stake, and bring her safely to his own time. Now, in the modern world, it is Brenna\u0027s seductive innocence and sense of wonder that are utterly bewitching the once-weary vampire, blinding him to a growing danger. For there is one whose dark magick is strong...one who knows who they both are and won\u0027t stop till their powers are his...and they are nothing more than SHADOWS THROUGH TIME...","cover":"https://allnovel.net/images/night-s-kiss-children-of-the-night-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-kiss-children-of-the-night-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:03:26 PM"}}
