{"id":93851,"no":44,"title":"Page 44","content":"\n Brenna woke slowly. Eyes still closed, she thought about the dream she\u0027d had. A strange dream, filled with violence and death. She had been frightened, more frightened than she had ever been in her life, as she watched her life\u0027s blood drain away. And then she had heard Roshan\u0027s voice calling to her, drawing her up out of the darkness.\n With a sigh, she turned over on her side. And realized, abruptly, that she wasn\u0027t alone in bed, and that she was wearing her nightgown. In that same instant, she realized the bed beneath her felt strange.\n Her eyelids flew open and she found herself staring into Roshan\u0027s face.\n \"Oh!\" she exclaimed. \"You startled me.\" She frowned as she noticed several things all at once. She wasn\u0027t in her bedroom. There were no lights on, and yet, even in the dark, she could see his face clearly, the fine lines at his eyes, the apprehension in his expression. She glanced around. \"What am I doing here?\"\n \"Brenna… \"\n She ran her hand over her wounded arm. There was no bandage, no scab, no scar. She touched her side. There was no pain.\n \"It works,\" she murmured. She looked up at Roshan. \"Loken\u0027s elixir, it does work,\" she said, and then she frowned. She had seen the warlock die a horrible death, but that had been nothing but a bad dream. Hadn\u0027t it?\n \"No, Brenna,\" Roshan said quietly. \"It doesn\u0027t work.\"\n \"But my arm, my side… the wounds are gone.\"\n \"Yes.\"\n She was confused by the pain in his voice. Sitting up, she took a deep breath, her senses filling with a myriad of sounds and smells— a car backfiring on the street outside, the hum of the refrigerator upstairs, the scent of Roshan\u0027s skin, the faintly musty smell of the bricks.\n She squinted as light suddenly filled the room, gasped as a sudden sharp pain knifed through her stomach. She moaned as the pain grew worse.\n \"What is wrong with me?\" she asked. \"Does it have something to do with the blood he made me drink?\" The thought of dying the same way as Anthony Loken filled her with mind-numbing fear. \"Am I going to die the way he did?\"\n Sitting up, Roshan drew her into his arms. \"No, my love.\"\n \"Why not? He drank your blood and it killed him, and he… he made me drink your blood.\" She looked at him in wonder. \"Why did it not make me sick?\"\n \"Because you\u0027d already tasted my blood,\" Roshan said, stroking her hair. \"Only you got it directly from me. That\u0027s the only way it works. That\u0027s why your body was able to accept the blood he forced on you.\"\n \"Then what\u0027s wrong with me?\" She looked at him, her heart pounding with fear. \"Am I dying?\"\n \"You\u0027re not dying, my love.\" He took a deep breath, his arm tightening around her. \"You\u0027re just hungry.\"\n \"Hungry!\" She moaned again. \"What kind of hunger hurts like this?\" she demanded.\n She stared at him, waiting for an answer.\n His silence told her everything she needed to know.\n CHAPTER 27\n Brenna stared at him, not wanting to believe what she knew to be true. Pushing him away, she held up her hands, turning them this way and that, seeing them as if for the first time. Sliding out of bed, she walked a few steps away and turned her back to Roshan. Standing there, she ran her hands over her face and her body. She felt the same and yet different.\n And all the while a fierce hunger burned deep inside her. With one arm wrapped around her stomach, she turned to face him.\n \"What have you done to me?\" she demanded. \"Tell me you did not make me what you are.\"\n \"I couldn\u0027t let you die. I couldn\u0027t let you go, not when I had the power to save you— \"\n \"Save me! You have condemned me to a lonely hell on earth!\"\n \"What the devil are you talking about?\"\n \"You said it yourself. Vampires are territorial predators, not social creatures. You have condemned me to a life alone!\"\n \"It doesn\u0027t have to be that way, not for us. You\u0027re not my enemy. I\u0027m willing to share my house, my territory, and my life with you.\" He ran his hand through his hair, then lowered his arm to his side, his hand curling into a tight fist. \"Call me a selfish bastard if you will, but I\u0027ve been alone too long, love you too much, to lose you now.\"\n \"No! I cannot be what you are! I will not be what you are!\" She stormed across the room, rage churning inside her. \"Let me out of here!\"\n Rising, he unlocked the door and followed her as she ran up the stairs. He unlocked the second door, followed her down the hallway into the living room, stood in the archway while she stomped through the room, her anger growing with every breath. Grabbing a lamp, she hurled it against the wall. A second lamp followed. She smashed everything breakable in the room, including a chair and a small table. She overturned the sofa and then, chest heaving with exertion, she thundered into the kitchen.\n She opened the cupboards and began tossing out the contents— bowls and cups and saucers, plates and glassware. She opened a drawer and tossed it and the silverware it contained through the window, hurled pots and pans against the wall.\n And still her rage grew stronger.\n She opened the refrigerator, her nostrils filling with the scent of butter and eggs and milk, apples and oranges, mustard and ketchup. And chocolate pie. Placing the container on the counter, she picked up a plate that lay miraculously unbroken in the pile of crockery, grabbed a knife, and cut herself a huge slice of pie.\n \"Brenna, don\u0027t… \"\n She whirled around, daring him to stop her as she took one bite, and then another.\n She looked at him defiantly, and then, with a cry, she dropped the plate and ran to the sink as her stomach rebelled.\n She stood over the sink, her eyes closed, her hands gripping the edge of the counter. \"How could you do this to me?\"\n He drew her into his arms, held her tenderly as he wet a dish towel and wiped her face, then handed her a glass of water so she could rinse her mouth.\n \"It\u0027s not a bad way to live, Brenna.\"\n \"It is not living at all,\" she retorted, but there was no heat in her words now, only resignation and defeat. \"I want you to free me,\" she said, \"the way you did Lilly Anna.\"\n \"No! Dammit, don\u0027t ask that of me!\"\n \"Yes. Please, Roshan, if you care for me at all, then you must do this for me. I haven\u0027t the courage to walk out into the sun. I cannot face the flames again.\"\n He crushed her to him, holding her so tightly she could scarcely move. \"Listen to me, my love. I know you\u0027re frightened. I know you\u0027re in pain. But give it time before you ask me to set you free. A few weeks, at least. Trust me, my love.\"\n Burying her face in his chest, she groaned. \"I cannot. It hurts too much.\"\n \"Then it\u0027s time to hunt.\"\n It was her worst nightmare come true. Holding her hand in his, he took her out into the night. A short time later, she watched Roshan call a young man to him, watched as he held the young man in thrall. He drank briefly, then turned toward her.\n \"Drink, Brenna.\"\n She shook her head. \"I cannot.\"\n \"You are no longer human. Do not think like one. Listen to the beat of his heart. Let it call to you, and take what you need.\"\n She thought to feel revulsion, horror, but the hunger within her was too strong to resist. The young man offered no resistance as she took him in her arms. His flesh was remarkably fragile; the blood welling from Roshan\u0027s bite was remarkably sweet to the taste, infusing her with heat and warmth.\n She looked up, her gaze meeting Roshan\u0027s, and in her husband\u0027s eyes she saw love and approval and understanding.\n And then she bent her head and drank again, until an image of what she was doing rose in her mind. With a wordless cry, she pushed the young man into Roshan\u0027s arms and fled down the street.\n Roshan watched her go. His first instinct was to go after her, catch her, take her home.\n But he didn\u0027t move, only stood there and let her go. In bringing her across, he had made the only choice he could. Even knowing she might hate him, even knowing she might never forgive him, it had been the only decision he could make. He stared down the deserted street. He knew only too well what she was thinking, knew the confusion she was feeling as her vampire powers expanded and everything she was seeing and hearing was filtered through her preternatural senses.\n He knew how frightening it could be, the sense of disorientation when your body no longer felt like the one you were used to, when every sensation was magnified a thousand times. If she needed time alone, he would give it to her. But if she wasn\u0027t back long before dawn, he was going after her. They were linked by an exchange of blood now. There was no way she could hide from him. For as long as she lived, he would be able to find her. Whether she agreed or not, she would be back in his lair before dawn. He only hoped that, in saving her life, he hadn\u0027t lost her love forever.\n Brenna ran aimlessly though the night, frightened and fascinated by what she saw and heard. Though the skies were dark, she saw everything clearly, as if the sun was high in the sky. There were no shades of gray, no shadows her eyes couldn\u0027t penetrate. Even at night, colors were bright and clear. Noise assailed her from every side— a baby\u0027s cry from four streets over, a car\u0027s engine backfiring, the creak of a house settling, water trickling from a drainpipe, and over all of it the beating of thousands of hearts. Smells she did not recognize filled her nostrils.\n She ran tirelessly, amazed at her stamina. No wonder Anthony Loken had wanted the power of a vampire for himself! She felt as though she could run forever and never stop, never grow weary. Her body felt strong, yet lighter than air. Was that because she had shed her mortality, or because she had shed her soul?\n The thought gave her pause and she slowed to a walk. Had she lost her soul? She considered that as she made her way across a bridge into a park. Why should she have lost her soul? She had done nothing wrong. She hadn\u0027t asked to be made a vampire, that decision had been made for her. She hadn\u0027t killed anyone. True, she had stolen a little blood, but surely she could be forgiven for that, if forgiveness was necessary… \n","sourceLink":"https://allnovel.net/night-s-kiss-children-of-the-night-1/page-44.html","bookId":2299,"book":{"id":2299,"title":"Night\u0027s Kiss (Children of The Night #1)","description":"Storyline: \n Night\u0027s Kiss (Children of The Night #1) \n HE HAS FOUND HIS SOUL\u0027S DESIRE... \n The Dark Gift has brought Roshan DeLongpre a lifetime of bitter loneliness-until, by chance, he comes across a picture of Brenna Flanagan. There is something hauntingly familiar about Brenna, something that compels him to travel into the past, save the beautiful witch from the stake, and bring her safely to his own time. Now, in the modern world, it is Brenna\u0027s seductive innocence and sense of wonder that are utterly bewitching the once-weary vampire, blinding him to a growing danger. For there is one whose dark magick is strong...one who knows who they both are and won\u0027t stop till their powers are his...and they are nothing more than SHADOWS THROUGH TIME...\n \n","cover":"https://allnovel.net/images/night-s-kiss-children-of-the-night-1.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-kiss-children-of-the-night-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:03:26 PM"}}
