{"id":36478,"no":12,"title":"CHAPTER XI MAGERSFONTEIN","content":"AS soon as it was quite dark, Yorke and his companion were again on their way. It was toilsome work. They kept, as well as they could judge, a mile from the road, but[Pg 191] it was a very rough piece of country. There were steep hills to climb and descend, tracts of boulder and rock to be crossed, and had it not been for the keen-eyed native, Yorke would have found it impossible to make his way. Fortunately the night was starlit, and this enabled them to keep their direction without having recourse to the dangerous expedient of striking a match. Presently the country became less rough and hilly. \"I think we have passed the range, Peter, and Wesselton cannot be very far off. Keep a sharp eye on the look-out for lights. Directly we see them, we shall know exactly what our position is. We have taken a very long time to cross the hills, and I want to sight the river before daylight. We are sure to find bushes or willows growing by the bank where we can hide.\" Half an hour\u0027s walking, and Peter said in a low voice, \"There are lights, baas,\" pointing somewhat to the left of the track they were taking. For a time Yorke could not discern anything. Then a light shone out and disappeared almost instantly. \"That is somebody carrying a candle or lamp across a room,\" he said. \"I am much obliged to him, whoever it is. The road cannot be far to the right, so bear more the other way. If there are any Boers about they would probably feel sure that we should strike off to the right.\" Making a detour, they presently left the town behind them, and kept on due south. They had no fear whatever of anyone being on watch beyond Wesselton, and therefore stepped out boldly over the slightly undulating ground. Once or twice Yorke struck a match and looked at his compass, to be sure that they were keeping their course. \"I think we are near the river now, baas,\" Peter said at last. \"What makes you think that, Peter?\" \"Smell the water.\" \"Do you, Peter? I did not know that it had any smell.\" [Pg 192] \"Yes, baas. Oxen and deer and sheep all can smell it. Oxen always quicken their pace when they get near a pool.\" \"That would seem to show that you are right, but still I don\u0027t think there can be any smell; but there may be more damp in the air near water, and their senses in that way are more delicate than that of a white man. As you say you think we are near water I have no doubt you are right. Anyhow, I hope you are, for I have knocked the skin off my shins in half a dozen places among these rocks, and I have pretty nearly twisted my ankle as often, so I shall be glad enough to lie down. I certainly had several hours\u0027 sleep yesterday, but that did not make up for the loss of sleep the night before; besides, my feet are getting very tender. I have not walked, in all the months I have been out here, as much as during these two nights.\" \"Baas walks very well. No Dutchman ever walked half as far as you do.\" \"Perhaps not, Peter; they never use their legs. A Boer would get on a horse if he only wanted to go fifty yards to fetch anything. I used to be a good walker, but on the farm I got to be almost as lazy as the Dutchmen.\" A quarter of an hour later a line of bushes rose in front of them. \"That looks as if the river were near.\" \"Just on other side of the bushes, baas.\" So it turned out, and after climbing down to it, taking a long drink, for they had emptied their water-bottles before starting, they took a mouthful of food and lay down among the bushes. \"There is not the least occasion to keep watch,\" Yorke said. \"It will be morning soon, and if either of us wake, we can peep out from the edge of the bushes and see if there are any Dutchmen in sight. If there are not, we can sleep on as long as we like.\" Yorke did not wake till the sun was almost overhead. The native was crouching down near the bushes. [Pg 193] \"Well, Peter, do you see anything?\" he asked. \"I have seen Boers at that house there going in and out. They just rode in, waited half an hour, and rode away again. They did not look about at all; just paying a visit.\" \"We did not see the house last night, though we must have passed very close to it.\" \"We did not look for houses, baas, we looked for river.\" \"But as there are horses and cattle grazing about, I wonder we did not startle some of them. They must have been farther away from the house. They would have been sure to move if we had passed near them.\" \"Some came near here this morning, baas. Grass longer here. When river high, spread over country near.\" \"Well, as long as they don\u0027t enter the bushes, it does not matter, Peter. If they did, and came upon us, they would be startled, and gallop away, and if any Boer happened to be looking from that house, he might saunter down here to see what caused their fright.\" The day passed quietly, and as soon as it was dark they were in motion again. \"Our course is a very little to the south of west,\" Yorke said. \"Now we are quite safe till we approach the road from Kimberley to Jacobsdal. Once past that, it is only about ten miles to the railway, and by following the latter we shall reach the camp. But we can\u0027t go in till morning, for we have not got the countersign, and so should run the risk of being shot by one of our tramp pickets.\" Four hours\u0027 tramp took them to the road. They could hear, as they approached it, a murmur of voices, and moved away to the right and walked for some distance before attempting to cross it. \"The Boers evidently have parties thrown out to give notice of any force approaching from our camp,\" Yorke said, in low tones. \"We shall have to be very careful, for there is no saying where they are posted, and they may extend almost up to the railway.\" [Pg 194] \"Yes, we must take care, baas. If only two or three, we shoot them; if more of them, they shoot us. I go first, you come a little after me, baas. If there are Boers, they are sure to be talking, keeping themselves awake; if not talk, sure to be asleep, then we pass them safe.\" \"Yes, if you don\u0027t happen to tread on them.\" \"No fear of that, baas. I can see little shrub twenty yards away. I see body of big Boer farther than that.\" Trusting implicitly to the sight and hearing of the Kaffir, Yorke followed some ten paces behind him, having his rifle now in his hand ready for use. They bad gone a quarter of a mile, when suddenly on their left there was a movement, and a voice said, \"Wake up, Philip! there is something moving.\" \"It is only a deer or a hare,\" the other said sleepily. \"No, it isn\u0027t,\" the man replied angrily. \"If it had been a wild animal it would have dashed away when I spoke; instead of that, the noise stopped. It was footsteps, I could almost swear; most likely one of the rascally Kaffirs going to the Rooinek camp with news. We will soon see. Come along this way; that is where the sound came from.\" Yorke had crouched down as soon as he stopped, and saw that the native had done the same. In a minute he saw the outlines of two dark figures. \"I can see you!\" the Boer who had first spoken shouted. \"Who are you, and where are you going? Answer, or I put a bullet through your head.\" Yorke did not believe that he was seen, but he knew that if the Boers advanced two paces farther they would make him out, and the first intimation he would have that they did so would be given by a rifle bullet. It was a question of life or death, and accordingly he took a steady aim and fired. The man he aimed at fell without a cry. As he pulled the trigger Yorke threw himself flat upon the ground, and it was as well that he did so, for the other Boer fired where[Pg 195] he had seen the flash of his rifle. Almost at the same moment another rifle was discharged, and the Boer dropped his gun, and with an oath ran off at full speed. Peter was by Yorke\u0027s side before the latter could get on to his feet. figures IN A MINUTE HE SAW THE OUTLINES OF TWO DARK FIGURES. \"Are you wounded, baas?\" \"No; by the sound the shot went through my water-bottle. Two inches lower and I should have had it in the hip.\" \"I was aiming at the same man as you,\" the native said, \"till you fired and I saw him fall, and before I could change my aim the other man had fired. I was just too late to stop him.\" \"It was a good thing that you hit him, Peter, for if you had not done so he would have fired again. No doubt his magazine was full, and the next shot might have done its business. I had not time to think when I threw myself down; if I had done so I should have dropped with my head towards him, and then I could have fired again, but I went down sideways, and so for the moment could not use my rifle. You hit the other man in the arm, I think, for his rifle dropped, he did not throw it down. Now, we must run our hardest, Peter. Do you hear them shouting? We may as well go straight on as any other way. By the row they are making they seem to be all over the place, so it is no use trying to avoid them.\" Keeping close together now, they ran at the top of their speed, changing their course occasionally when they heard voices ahead of them. The noise was all in their favour, for it completely drowned the slight sound made by their footsteps, and served as a warning to them of the position of the various outposts. They maintained their pace for nearly a mile. The sounds were all behind them now, so they broke into a walk, which they maintained until they came upon the line of railway. \"We will walk along on the other side of this. Keep your[Pg 196] ears open, Peter, and listen for the slightest movement. I don\u0027t know how far our outposts are thrown out, and I want to stop before we get near them.\" They had walked some three miles, when Peter said: \"Stop, baas. I heard a noise; I think a soldier is stamping his feet to warm himself.\" \"All right, Peter. I am sure we cannot be very far off now, so we will wait till morning. We can sleep till broad daylight.\" Three hours later the native touched Yorke. \"Sun is just up. Shall we go on now?\" \"Certainly. We will sling our rifles again. If we have them in our hands the sentry might think it wiser to fire at once, without asking questions. However, now that he can see my uniform, I have little fear of that, but it is as well to be on the safe side.\" As they approached they could see that the sentry called to a comrade close by, for another at once joined him. When they came within a hundred yards the sentry challenged. \"An officer with despatches from Kimberley,\" Yorke replied. \"You can come on for a bit,\" the soldier said, \"but I shall not let you pass farther until an officer comes.\" \"I have a permit from General Colville to enter and pass the lines.\" \"Then you can come on, but don\u0027t touch those guns of yours till I have seen your permit.\" The sentry was justified in being doubtful, for many of the Boers had adopted khaki-coloured clothes, and at a very short distance Yorke might well have been mistaken for one of these. \"That is all right, sir,\" the soldier said, when he had read the permit. \"We are obliged to be careful, you know; and if you had come before it got light I could not have let you pass without the countersign.\" [Pg 197] \"You were quite right to stop me,\" Yorke said. \"It is because I knew that I could not get in without the countersign that I have been sleeping for the last three or four hours a quarter of a mile away. Did you hear any firing in the night?\" \"I did not, sir; but the man I relieved told me that he had heard three shots over to the right, and we were charged to be extra vigilant.\" \"You need not be so any longer. One shot was fired at me as I came through some Boer outposts a couple of miles this side of the road from Jacobsdal. The others are the two shots we fired. There are a good many of the Boers about, but we got through safely.\" \"Is Kimberley all right, sir? You said you came from there.\" \"Yes, they can hold out for some time.\" \"They won\u0027t have to hold out long, sir. We shall be there before another week is over, I hope.\" \"I hope so too,\" Yorke agreed, and then he and Peter walked on. He followed the line of railway. There were two or three strong posts upon it, but seeing that he had been allowed to pass by the most advanced sentries, no questions were asked him. Nearing the river, he turned off and proceeded at once to head-quarters. On arriving there he was told that General Colville was dressing, and would be out in a few minutes. \"Shall I take your name in, sir?\" the orderly asked. \"No, I will wait till the general is ready.\" In ten minutes General Colville came out with General Pole-Carew, and on seeing Yorke, said heartily: \"So you are back, Mr. Harberton. We got our searchlights to work last night for the first time, and got into communication with Kimberley. They have been flashing signals for some days, but we have not been able to answer[Pg 198] them until now. Last night we asked, \u0027Has messenger arrived?\u0027 and we got an answer, \u0027Yes, and left two days ago.\u0027\" \"Then I am afraid my report will be of little use to you, sir.\" \"On the contrary, we are most anxious to hear it. There are fellows in their ranks who have served with us, and one or more of these can doubtless read our signals. We have only asked them if they could hold out until we arrive, and they said \u0027yes.\u0027 We abstained from asking any further questions, for from prisoners we hear that the Boers feel sure that Kimberley cannot hold out much longer. Now, in the first place, what is your report?\" \"This is all I have brought, sir. Colonel Kekewich was afraid that I might be caught on my way out, consequently I only put down, as you see on this slip of paper, his estimate of the amount of stores. It will not take me five minutes to write out the names of the various articles to which the figures refer.\" \"And were you caught?\" \"Yes, and this paper was examined; but they could make neither head nor tail of it, and threw it on the ground and I recovered it.\" \"Well, just complete that list, then, and I will take it in to Lord Methuen, who is, I am happy to say, going on well. But first, you can answer me generally, how long can they hold out?\" \"I should think, sir, for three months. Some items may run short, but in general Colonel Kekewich was of opinion that the stores available were considerably greater than those indicated by the figures, as most of the residents had laid in private stores before the town was altogether cut off.\" \"That is most satisfactory. We may be sure that they won\u0027t have to wait so long as that. If you will write out the list at once I will take it in to Lord Methuen, and after[Pg 199] that you can give me an account of how you got in, and how you got away after once being caught by the Boers.\" Yorke wrote out the list. \"Very good indeed, much better than I had expected. I see you have put a query behind the number of shell. What does that mean? There can be no private store of shell.\" \"No, sir; but the De Beers people have set to to manufacture them, and have begun to turn them out rapidly. They have already been tried, and the gunners can make as good practice as with our own.\" \"Good indeed. I see that there is a mark after the number of the guns.\" \"Yes, sir; the De Beers people have begun making a long gun. They heard that the Boers are bringing up a hundred-pounder, and they hope that the one they are making will have a longer range than that piece, although I believe it is not to carry so heavy a shot.\" The two officers left the room with the list; General Colville returned in a few minutes. \"Lord Methuen will see you,\" he said. \"He would like to question you himself.\" Yorke followed him into another room. Lord Methuen was lying on a couch. \"I congratulate you upon your safe return, Mr. Harberton,\" he said. \"It has been a most hazardous service, but the news you have obtained has been invaluable. We dared not question Kimberley about their store of provisions, for if their answers were understood by the Boers they would see that their chance of reducing the place by hunger was so slight that they might decide to abandon the siege and to march away into the Colony, which is the thing of all others we wish to prevent.\" \"Colonel Kekewich saw that, sir,\" Yorke said; \"and that is why he would not give me any written details.\" Lord Methuen asked many particulars as to the defences of Kimberley, the effect of the Boer bombardment, and the temper of the population. \"Did you see Mr. Rhodes?\" [Pg 200] \"Yes, sir.\" \"How does he get on with the commandant?\" \"I think, sir, from what I heard, that there is some friction between him and the military authorities, but nothing serious at all. All the resources of the mines have been placed by him in the hands of the authorities. He is employing a large number of Kaffirs in making roads, and these he pays and feeds, which is a great relief to the authorities; for they have twice tried to send the Kaffirs out of the town, but both times the Boers have compelled them to return, no doubt because they think that the more mouths there are to feed, the sooner the provisions will be exhausted.\" \"And now, Mr. Harberton, tell us how you managed to get into the town and to return here.\" Yorke related his adventures. \"You have been fortunate indeed,\" the general said, \"and have had three very narrow escapes—in the first place, at that hut which you defended so stoutly; in the next place, when you were first taken prisoner; and lastly, in getting through the Boer lines this side of Jacobsdal, to say nothing of your escape at Boshof. Your Kaffir must be a stout fellow.\" \"He is, sir. Without his assistance I should by this time be a long way on my road to Pretoria.\" \"Well, your services have been most valuable, and I shall have great pleasure in recommending you for a commission if you would like to take one.\" \"I thank you very much, sir. I should feel it a great honour. And even if I resigned at the end of the war it would be all my life a gratification to have received the Queen\u0027s commission.\" \"I suppose you would prefer the cavalry?\" \"Yes sir.\" \"Well, then, I will recommend that you be gazetted to the 9th Lancers. The colonel will be glad to have you; what with casualties and illness he is short of subalterns. You have been very favourably reported before for your expedi[Pg 201]tion from De Aar across the Orange River, and there can be no doubt that my recommendation will be acceded to at once.\" \"May I ask what I am to do with the twenty Kaffir scouts who have been working under me?\" \"You had better hand them over to Major Rimington. He will know how to employ them.\" \"Will you see, general, that Mr. Harberton is put in orders as provisionally appointed second lieutenant in the 9th Lancers, but detailed for special duty as extra aide-de-camp to General Pole-Carew?\" \"Thank you,\" that officer said. \"I shall be very glad to have him, for I am one short already. Mr. Lucas is down with fever of some sort, and the doctor says that if he does not get better he must send him off to the base hospital. I think Mr. Harberton would be much more useful with me than he could be with his regiment. I will ride over with him to the Lancer Camp and introduce him to the colonel.\" \"Thank you; that would be best. When telegraphing home to-day, will you say that Mr. Harberton, second lieutenant in the Cape Town Riflemen, has been provisionally appointed second lieutenant 9th Lancers for very distinguished services in carrying despatches into and out of Kimberley and upon other occasions? That will settle the matter at once, and we shall have an answer in two or three days?\" \"Have you a horse, Mr. Harberton?\" General Pole-Carew asked as they left the house. \"Yes, a very good one; but it is at Rimington\u0027s camp.\" The general turned to the orderly who was holding his horse and his own. \"Hand your horse to this gentleman; he will return it to you in half an hour. Wait here till he does so.\" The Lancers were encamped a mile away to the north. Some of the tents had now come up. From one of these the colonel came out, and the sentry at the door told him that the general was approaching. [Pg 202] \"Good-morning, colonel!\" the latter said as he dismounted. \"I have come to introduce to you Lieutenant Harberton. Lord Methuen has telegraphed home recommending him for a commission in your regiment. The provisional appointment will be in orders this morning. He has won the commission by carrying a despatch into Kimberley and returning with a message from Kekewich at, I need not say, immense risk. He has performed other meritorious services. He has been hitherto a lieutenant in the Cape Town Rifles, and has been attached to Rimington\u0027s Corps. I am afraid, however, that at present you will derive no benefit from his services, as I have commandeered him as one of my aides in place of Lucas, who is ill. He speaks Taal like a native.\" \"I should have been very glad to have him, sir, for I am short of officers. But no doubt, speaking Dutch as he does, he will be still more useful to you.\" \"Yes, none of my staff speak the language well. I should think that it would be a good thing for you to ask Rimington to let you have one or two of his men. You might find them of great advantage with scouting parties, when we once move again. If you like, I will ask him myself; I am going to his camp now.\" \"Thank you! It would certainly be of great use, and of course such a request coming from you would be complied with at once.\" \"I will leave you here, Mr. Harberton. I shall not want you to-day, and you may as well get acquainted with the officers of your regiment. Lucas may rejoin again soon, and then you may join them. At any rate, when you ride over here with a message it would be more pleasant for you to be acquainted with them. \"I shall feel obliged, colonel, if you will send one of your men to head-quarters to hand over the horse Mr. Harberton is riding to the trooper he will find waiting there. His own horse is at Rimington\u0027s camp; it is only a quarter of a mile[Pg 203] away. No doubt he will be going over there presently, as he has been attached to them for some little time. \"You will come in this evening, Mr. Harberton, and take up your quarters with my staff. I believe there is still an empty room; if not, they will find one for you close by.\" \"We are just going to sit down to breakfast, Mr. Harberton,\" the colonel said. \"It will be a good opportunity for introducing you to the officers, and we shall all be glad to hear how you got into Kimberley, and what you found there.\" Five minutes later Yorke was sitting down to breakfast at a long table formed of packing cases and a rough board. He had been introduced to the officers, and at the colonel\u0027s request had taken his seat next to him. After the meal was over he gave an account of his adventures in entering and leaving Kimberley. \"Well managed indeed!\" the colonel said. \"That Kaffir of yours must be a capital fellow.\" \"He is, sir, and I should be very sorry to part with him; I have a Dutch trooper with me as my servant, but I can take him in to look after my horse.\" \"I will take him, if you don\u0027t want him, and he will come,\" one of the captains said. \"I have a boy I took on at Orange River, but he is of no use at all. Of course you can have him again if you join us.\" \"Thank you; but I would not part with him on any account, after what he has done for me; I shall certainly keep him with me as long as I remain out here, and shall see that he is completely settled before I go home. Besides, I should need him again if I ever am sent on another expedition.\" After breakfast the Lancers went out to make a reconnaissance towards Magersfontein, and Yorke walked over to Rimington\u0027s camp. Hans ran out to meet him. \"So you have returned, Master Yorke! I have not slept for the last two nights, I have been so anxious about you.\" \"Yes, I got through all right, Hans. I was held prisoner[Pg 204] for twenty-four hours, but Long Peter got me out. I will tell you all about it later.\" \"You are going to stay here now, I hope?\" \"No. General Pole-Carew has put me on his staff. You are to come with me as an orderly.\" \"I am glad,\" Hans said. \"I don\u0027t care what I do so long as I am with you.\" \"You have been getting on all right, I trust, while I was away. I hope the Kaffirs have behaved well?\" \"Yes; they have been out twice in the direction of Jacobsdal, but they could not get near the place. The Boer outposts are a long way out.\" \"Yes, they nearly shot me last night. We ran right into the middle of them.\" They were by this time close to the camp, and some of the officers joined Yorke. \"Have you been into Kimberley?\" they asked at once. \"Yes. I met with no difficulty until I was nearly there, but managed to get in after a skirmish. I had worse luck getting out, for I was caught. However, my Kaffir came to the rescue, and I got back without much trouble.\" \"And how are they getting on there?\" \"They can hold out for a long time, and are, I think, quite strong enough to beat off any attack that can be made upon them. I think the Boers know it too, for they have made no serious assault, though they keep on firing.\" \"I suppose you are coming back to us now?\" \"No, Lord Methuen has recommended me for a commission in the Lancers, and General Pole-Carew has put me on to his staff, as one of his aides has fever.\" The others congratulated him warmly. \"I thought you would get a commission,\" one of them said, \"when I heard that you had undertaken to get through to Kimberley. I am sure you deserve it, for it must have been beastly dangerous work.\" Yorke remained in the camp an hour, and had to tell his[Pg 205] story over again. He arranged with the colonel that the Kaffir scouts should remain with him until he had spoken to the head of the Intelligence Department, who might wish to employ them himself, and then he and Hans mounted and rode into the camp on the Modder. Long Peter was sitting quietly where Yorke had left him. The latter told him of the changes that had taken place. \"Of course I shall take you with me, Peter, and the horses will be in your special charge. Hans will look after other matters. After what we have gone through together, I shall always keep you with me as long as I remain out here, unless, of course, you yourself wish to leave me.\" \"I shall never want to do that, baas. You have treated us all well, as if we had been your children, and now we have fought the Boers together, I hope always to be with you. I have got some money, and I will buy a pony, so as to be able always to keep up with you. I can buy one for a pound after the next battle.\" \"Do not do so till I tell you, Peter. I know that Kaffir boys always do ride when they go with their masters, but I do not know whether it would be the proper thing for officers on the staff. At any rate, do nothing till I tell you. When it is necessary you should have a horse, I will buy one for you.\" Having arranged this matter, Yorke remained with his regiment until the evening. There was nothing for him to change in his uniform, except to fasten metal badges showing the number and name of the regiment to his shoulder-strap. He could not obtain the red tabs which were the badge of the staff for the collar of his jacket. After dinner he rode back to head-quarters, where he found that a room had been got ready for him. Troops were now arriving. The 12th Lancers had come up, and a battery of Horse Artillery. The Highland Brigade, consisting of the 2nd Black Watch, 1st Gordons, 2nd Seaforths, and the 1st Highland Light Infantry, next day came[Pg 206] into camp, and the artillery were further reinforced by four howitzers. The line of communications had been strengthened by the Canadians, Australians, and several line regiments being posted along the railway from De Aar to Belmont. On the 9th the Horse Artillery, 9th Lancers, and the heavy naval guns moved forward and opened fire on the stony hills that constituted the Boer positions. All day the guns thundered, searching out every rock behind which it was thought the Boers might be lurking. The naval guns distributed their heavy shell broadcast, the great clouds of yellow smoke showing where the lyddite charges had burst. But the Boers made no reply. Not a gun spoke out in return, not a Boer was visible on the face of the hills—nothing showed where their artillery was, or where their trenches stretched. All in the camp were filled with excitement. It was certain that the time was at hand when they would meet the foe in strength face to face, and, formidable as was the position, no one doubted the result. At the same time the silence of the enemy, the uncertainty as to their strength and position, could not but inspire a certain feeling of uneasiness. On the afternoon of the 10th the Black Watch, Seaforths, Argyle and Sutherlands, and Highland Light Infantry moved out. The Gordons had only come in that morning, and remained in camp. The 9th Lancers, mounted infantry, and all the artillery accompanied the force. When within three miles of the enemy\u0027s position the force halted. It was raining heavily, but there was nothing for it but to lie down upon the wet ground, with one blanket for every two men. At one o\u0027clock in the morning they were on their feet again. The position held by the Boers was of great strength. The centre, Scholtz Kop, was very steep and lofty; it was close to the line of railway, and Spytfontein station lay at its foot. So strong did it appear, and furnished, as it doubt[Pg 207]less was, with artillery, it could only have been carried with immense loss. Some distance to the left were the Magersfontein kopjes, less forbidding and rough than those of Spytfontein, and from these to the river stretched a low hill, covered with bush from eight to ten feet high. Magersfontein once taken would render this hill untenable, and would enable Scholtz Kop to be taken in flank or rear. It was therefore against this point that the attack by the Highland Brigade, under General Wauchope, was to be made. It was pitch dark when the column started—so dark that it was considered impossible for the men to keep touch with each other marching in line, and accordingly they moved in mass of quarter columns. Strangely enough, not a single scout was thrown out ahead, probably because the general thought that it would be impossible to follow them in the dark, and moreover, that, should they come upon the Boers suddenly and fire be opened, the attack by surprise would be altogether spoiled, and the Boers be fully prepared before the main body could arrive. It is certain, however, that had the usual precautions been adopted the catastrophe that followed would have been avoided. Slowly feeling their way along, the great column, four thousand strong, moved on silently. The men were drenched to the skin, hungry, in doubt as to the nature of the position they had to attack, and oppressed by the darkness and strangeness of the situation. They were still some distance from the hill when orders were given for the column to open out into line; but instead of being, as their commander believed, a good half mile from the enemy\u0027s lines, they were within two hundred yards of them, for the Boers had, with great craft and ability, dug a great trench along the whole face of their position a quarter of a mile out on the plain. No suspicion had been entertained in our camp of the existence of this defence, and the Highlanders had marched unsuspectingly into the trap. As they were in the act of opening out, with the Black[Pg 208] Watch in the centre, the Seaforths to the left, the Argyle and Sutherlands to the right, and the Highland Light Infantry in reserve, a light was flashed on their left by one of the Boers, who had probably kept near the column as it advanced. In an instant a blaze of fire ran along the whole front, and a storm of bullets smote the column. It told most heavily upon the Black Watch. For half a minute the roar of musketry was unceasing, then for a moment it ceased. The Boers had emptied the magazines of their rifles. It was but a temporary pause, for in a few seconds the fire again burst out. The loss among the Black Watch had already been frightful. General Wauchope had fallen, together with a large number of the officers, and although at first the men had prepared to charge, it was impossible to withstand the fire, and they ran back, spreading confusion in the ranks of the Seaforths, who were still behind them. The latter, however, remained steady. They had naturally suffered less heavily than the corps in front of them, and they stood their ground, lying down and returning the fire of their hidden foes. The Black Watch halted and lay down behind them. As time went on the troops managed gradually to extend, two companies of the Seaforths moving out to the right, while the Argyle and Sutherlands, and the Highland Light Infantry crept farther still to the right in hopes of being able to open a flanking fire on the enemy. But these movements were not executed without heavy loss. Twice the Seaforths sprang to their feet and advanced by rushes at the trenches. Some even made their way to within a few yards of them. But it was light now. The officers were shot down and the men decimated, and each time the survivors sullenly fell back. For three hours they lay upon the ground near the spot where they had been attacked. No help came to them, for incomprehensibly this brigade had been sent forward alone, and without reserves, to attack the whole force of the Boers in an immensely strong position. Some of the artillery had, however, ad[Pg 209]vanced with great boldness, and their fire to some extent relieved the pressure. The Boers had now pushed along the low bush-covered hill between Magersfontein and the river, and had opened a flanking fire on the Highlanders. At seven o\u0027clock Lord Airlie brought up the 12th Lancers, dismounted two squadrons, and, aided by a battery of horse artillery, who pressed forward to within two hundred yards of the fighting line, and took up their position on the right of the Highland Brigade, to some extent checked the fire from that quarter. Two hours later the brigade of Guards came up. Two battalions of the Coldstreams occupied the ground next to the dismounted men. The Grenadiers prolonged the line until they were in touch with the Yorkshires, who were guarding the drift across the Modder River. The other half battalion took up a post by the three batteries, which had stationed themselves in rear of the Highland Brigade. Still farther to the left was the naval gun near the railway, which was protected from an attack in that direction by the Northamptons, while a Howitzer battery further in advance joined it in maintaining a heavy cannonade. At mid—day the Gordons arrived to support the Highlanders, who all these hours were lying within two or three hundred yards of the Boer trenches unable to move, while their foes were unwilling to risk taking the offensive. They had several times threatened to do so, but the fire of the Horse Artillery guns had each time caused them to abandon their intention. At two in the afternoon the Boer fire, which had somewhat slackened, again broke out fiercely to the left. It appeared that an attacking force was at hand, and the men of the Highland Brigade, parched with thirst, unnerved by the fearful ordeal they had gone through, burned and blistered by the sun, staggered back, losing heavily, and little by little retired until they reached the line of the guns, three-quarters of a mile in their rear. They straggled in in[Pg 210] groups, regiments mixed up together. Here they halted, and the few officers who remained alive did their utmost to restore order and cohesion. Not until five o\u0027clock in the afternoon was this accomplished, when, just as they were about to advance again, the Boer batteries, which had strangely enough been silent all day, opened fire. A shell exploded a short distance away from the brigade, and at once they broke down again. The officers in vain endeavoured to restrain them; the men could not be rallied until they reached the field hospital camp. For once nature had overcome the dauntless spirit of some of the finest soldiers in the world. For thirteen hours they had been under a tremendous fire; during that time they had been practically without orders. Their beloved general had fallen, together with many of the senior officers; but even if these had lived it would have been impossible to send orders from point to point, or to arrange for any general action, since the slightest movement of position was certain to attract a rain of bullets. They were, in fact, bewildered and dazed by the roar of musketry so terrible and unexpected, the heavy losses, the impossibility of movement, still more of getting at their foes. Their inability to do aught but suffer had broken them down. It speaks highly indeed for the discipline and courage of these soldiers that at Paardeberg they should have entirely recovered their morale, and have shown their old conspicuous bravery, unsurpassed by that of any other regiment. The brigade of Guards maintained their position all night. They had covered the retreat of the Highlanders, and now prevented the Boers from taking the offensive, and held their post until they were next morning recalled to camp. They then drew off, suffering somewhat severely as they did so, under a heavy artillery fire. The losses in the Highland Brigade were fifteen officers and one hundred and twenty-two men killed, thirty-one officers, four hundred and twenty-one men wounded, two officers[Pg 211] and one hundred and ten men missing. The Boer loss was caused almost entirely by our artillery fire, as some of the guns had been able to sweep portions of their trenches. Their official account gave it as seventy killed and two hundred and three wounded, but an intercepted letter placed it very much higher, and reported their loss at from twelve hundred to fifteen hundred. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3126/85969.html","bookId":898,"book":{"id":898,"title":"With Roberts to Pretoria","description":"简介： The war in South Africa may be roughly divided into three parts. First, The desperate fighting in Natal, which culminated in the relief of Ladysmith. Second, The advance towards Kimberley begun by Lord Methuen but arrested at Magersfontein, and renew...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3126","creation":"Aug 1, 2019 12:23:50 AM","modification":"Aug 1, 2019 12:23:50 AM"}}
