{"id":36475,"no":9,"title":"CHAPTER VIII A DANGEROUS MISSION","content":"THE next morning a portion of the troops crossed the Modder; the rest moved down and encamped on the south side of the river. The first task to be performed was[Pg 133] the sad one of collecting and burying the dead; that of carrying off the wounded had begun as soon as the slackening of the Boer fire permitted the stretcher-bearers to move about on the plain, and many of the soldiers, as soon as they had quenched their thirst, had, in spite of their fatigue, assisted in the work, and by midnight all had received the first aid from the medical officers. For these there was no sleep, for all night they were engaged in attending to the more serious cases; and by twelve o\u0027clock next day the greater part of the wounded were ready to be despatched by train. As soon as Yorke had seen his horse picketed with those of the rest of the corps, and had eaten a few mouthfuls of preserved meat and biscuit, he had gone down with Major Lindley, the surgeon of the Guides, and many of the men and officers, and aided in carrying in the wounded. On arriving with the first batch at the hospital he said to the surgeon, who was busy at work: \"Can I be of any assistance, sir?\" \"Yes, you can help if you will. We are very short of hands, as so many of the men have to go down with the wounded from Belmont and Graspan. If you will keep me supplied with the water, sponges, lint, and bandages, you will be of great service.\" It was trying work to Yorke, unaccustomed as he was to such scenes, and several times he felt that he must go out for a few minutes to breathe the fresh air; but he stuck to it, and felt well rewarded when, in the morning, the surgeon he had been attending said heartily, \"I thank you warmly, sir; you have saved me a great deal of time, and have been of much assistance to me. I am surprised that you have been able to go through with it, for even to us, accustomed to hospital work, it has been very exhausting.\" On leaving the hospital marquee he went away to a quiet spot, dropped on the ground, and slept for some hours. Then he went to the camp of the Guides. Most of these[Pg 134] were already away scouting, and having no duties to perform, he walked down to the river and crossed by the dam by which the men of the Ninth Brigade had effected their passage on the previous afternoon. The men not engaged in the duty of burying the dead, or of preparing for the all-important work of throwing a pontoon bridge across the river by which the guns and waggons could pass, were cleaning their accoutrements, cooking, or bathing in the river, while many of the Argyle and Sutherland Highlanders were seated at the edge of the stream dipping their legs in the water. They had suffered more severely than the other regiments of the brigade, and the advantage of trousers over kilts had been abundantly proved on the preceding day. From the fact that their dark kilts had shown them up, while their companions in khaki were almost invisible, their casualties were heavier than those of other regiments, and their legs had been so blistered by the sun\u0027s rays that many were almost unable to walk. On passing through the street of the village Yorke met the head of the Intelligence Department. The latter stopped. \"Ah! Mr. Harberton,\" he said, \"your Kaffirs failed us when most wanted. Had one of them brought us news that the whole Boer strength was here it would have saved us a number of valuable lives.\" \"I am sorry indeed, sir,\" Yorke replied; \"but you know the one who came in before the battle did bring news that no Kaffir teamsters or others were allowed to go near the Modder village, but had to make a detour on their way to Spytfontein.\" \"Yes, I know he did, and it is a pity now that we did not take his news more seriously. But it is always difficult to rely upon Kaffir evidence; the man might never have gone that way at all, and might have got up his story as an excuse for not bringing in news. And when Lord Methuen rode down himself close to the river he saw no signs of life in the[Pg 135] place. Now as to yourself. I understood from Colonel Pinkerton that you had specially joined with the intention of scouting and carrying despatches.\" \"I did sir. I have a very good horse, and can ride. I am a light-weight. I speak Dutch well enough to pass, and can get on in the Kaffir tongue. I should be happy to undertake any duty with which you might entrust me.\" \"We want a message carried into Kimberley. There will probably be a delay of a fortnight before we can receive reinforcements that will enable us to attack the enemy with any hope of success in the strong position they are said to occupy. Will you undertake to attempt to get round?\" \"I shall consider it an honour to do so, sir. Should I go in uniform or as a Dutch farmer?\" \"I think in uniform; you would have more risk of being taken, but if captured, you would have a right to be treated as a prisoner of war; while if you go in disguise, they would, I have no doubt, shoot you as a spy. It is not as if you wished to gather news; it is a question entirely of speed and of evading observation. Very well, Mr. Harberton. Where is your horse?\" \"It is over at Major Rimington\u0027s camp, sir.\" \"Well, I will send a mounted orderly for it. In the meantime you can examine our map. It is by no means perfect, but at least it will afford you some indications, especially when you approach Kimberley. A runner brought us three days since a sketch map showing the position of the Boers round the town, and this, when you get there, will certainly be of value to you. One of the sergeants will make a tracing for you. You shall see the despatch you are to carry, and had better get it by heart, so that if you are pursued, and find yourself likely to be taken, you can destroy it, for you would doubtless be searched so thoroughly, that however well you might conceal it, they would be likely to discover it. Now, let us look at the map;\" and, entering the house where he had established his office, he passed through the room in[Pg 136] which the non-commissioned officers were at work, and entered the one behind it. \"Here is the map,\" he said. \"You see the Boer positions round Kimberley are much closer together than those on this side, for, until we crossed the Modder, it would be naturally considered that it was from that side relief was expected, or that messengers might come and go. But on this side there are also a great many of them; they are thick round Wimbledon, and thicker still between Scholtz Kop and Spytfontein. But these would, of course, be intended rather for resistance against a force advancing this way than for offence against the town. There are two here, however, standing to the right of the road between this place and the town. There may be some patrols thrown out on the road; it is probable that there are some, and here is the principal danger. Between that road and the railway and the town of Wimbledon there are no entrenchments marked. Of course they may exist, but the Kimberley people are only able to send us the posts which they can make out with their glasses, or by their fire. As you see, the ground is very rough and broken, and would probably be very difficult to ride across in the dark if you were to leave the road. I may say that a small party of cavalry have been out this morning seven or eight miles along the road, and encountered no opposition, but were fired at several times by parties on the hills. But it is certainly likely enough that they come down on to the road after dark. I will send a dozen troopers as an escort with you for the first four or five miles.\" \"I should say, sir, that it would be best for me only to ride for a few miles, then to dismount and make my way on foot. If you will allow me, I will send a note by the orderly who fetches my horse to two of my Kaffirs bidding them accompany it here—one of them especially is a very shrewd fellow—their eyes and ears are much better than mine. I should send one of them back with my horse, and take the other[Pg 137] with me. I have a compass, but it would be of no use in the dark; and I might lose my bearings altogether if by myself, for I could not venture to strike a match.\" \"It would be a very good plan, Mr. Harberton. Please write your note at once, I have already sent for a mounted orderly.\" Yorke at once wrote a note to Major Rimington, or the officer commanding in his absence, begging him to send the two Kaffirs, Ugly Jack and Long Peter, with the orderly, who would bring back his horse. While the orderly was away he studied the map, and when the officer returned from head-quarters with the despatch, which was written in small characters on a strip of thin paper, he learned it by heart. It stated that the army had, after its engagement, crossed the Modder, but that it could not advance until joined by reinforcements now on their way. It asked for any intelligence that might be gathered by the besieged as to the Boers\u0027 position and force, and enquired as to the state of provisions in the town, and how long, in case the army failed to arrive, they could maintain themselves. It stated that large reinforcements were on their way out, and that Buller had, so far, failed to relieve Ladysmith, but hoped that he would soon do so, and that the Boers were making but little way in the invasion of Cape Colony. It added: \"The bearer will give you further details as to the state of affairs.\" It was directed to Colonel Kekewich. After the business was concluded, Yorke was invited to join the staff at lunch, which he was not sorry to do. When this was finished, he was asked to dine with them also, as he would not be able to start till after dark. Many of the Boer rifles had been picked up, and great quantities of ammunition, which had been left in the trenches, collected. The arms were to be destroyed, and Yorke, at luncheon, asked the officer to give him an order for the Kaffir who was going with him to take one of them. \"It is quite certain,\" he said, \"that if we are caught, they[Pg 138] will shoot the native, whether he is armed or not, and I think the man ought to have a chance of at least trying to defend his life.\" \"I will give you an order for him to take one, but it had better be put in my office till you start, or he would have trouble with every officer he met. I think that, as you say, it is only fair to give the man a chance, though I don\u0027t suppose it will be of much use to him, for he is not likely to be a good shot even with an ordinary rifle, and he would know nothing of the working of a Mauser.\" \"I could show him how to work it in five minutes,\" Yorke said; \"and if he cannot shoot himself, he could load as fast as I could fire.\" The officer smiled. \"I fancy if you get cut off, Mr. Harberton, your best plan would be to tie a handkerchief to your rifle in token of surrender. Possibly they might then content themselves with taking you as a prisoner of war, while if you were to shoot some of them, the others would not be very likely to respect your uniform.\" \"I don\u0027t want to fight, certainly,\" Yorke said; \"and I should not think of resisting unless I saw a chance of doing so successfully, as, for instance, if I were seen and chased by two or three mounted Boers when I was getting near our own lines.\" \"Yes, in that case the rifle might be useful. The Boers have considerable respect for a single man with a good rifle in the open. However, I hope you will get through unobserved. You certainly will have more chance to-night than you would otherwise have, for they will be even more tired than our men, as they probably marched all night to Spytfontein. Moreover, they have their wounded to attend to, and will, no doubt, be very much down in the mouth at being turned out here, where they felt absolutely certain of holding their own. Still, Cronje could not have had anything like all his force here, and some of the men who stopped in[Pg 139] their lines will be sent out to watch the roads to-night, lest we should push forward a brigade to relieve Kimberley.\" On going out, Yorke found that the Kaffirs had arrived with his horse. \"Peter,\" he said in Dutch, \"I am going to try to get into Kimberley. I want you to go with me. I have chosen you for two reasons; in the first place, because I know that you are a good man; and in the second, because you are the only one of the party who has been in the town, for you told me that you had worked there for two years. Are you willing to go? It is a very dangerous business, for if we are caught, the Boers are not likely to show us any mercy.\" \"I will go, baas,\" the man said, speaking as usual in Dutch. \"If you can go I can; if you are killed I will be killed.\" \"Your danger is greater than mine, Peter. I shall be in uniform; and they may take me prisoner, but they would be certain to shoot you.\" The Kaffir nodded. \"Shoot me, sure enough, baas; but I will go with you. You will go in the dark, I suppose? How could you find your way if you were alone? You could not keep on the road. The Boers are sure to keep watch there.\" \"I feel that, Peter. If it were not for that I would not risk anyone else\u0027s life. I mean to ride the first part of the way. Jack, you will go with us so far and bring my horse back, and take it to Major Rimington\u0027s lines. I shall give you a letter to Hans to tell him to look after you all till I come back.\" \"Cannot I go with you too, baas?\" the man asked. \"No, that would be of no use, Jack. The more there are of us, the more chance there is of being seen. Now, here is an order on the supply-stores for two days\u0027 rations. Draw them at once. Go back to camp and fetch the spare water-bottles we got at De Aar, bring four of them, two for each[Pg 140] of us. We may not be able to get through to-night, and may have to lie up at some hiding-place till it is dark again. I will get hold of some biscuits and a tin of meat.\" Having now finished his arrangements Yorke went down and made an inspection of the deserted trenches of the Boers. These were generally some four feet deep, and, like those at Graspan, had evidently been tenanted for some days. They were for the most part some seven feet long and four feet wide. They had been untouched since their occupiers had fled, for there was nothing in them to tempt the soldiers to search them. He had no difficulty in finding a couple of tins of meat and as much bread as he required. All were littered with empty cartridge cases, showing how large was the provision that had been made, and how steadily the Boers had for hours maintained their fire. There were, too, piles of still unused cartridges. His own bandolier was full, but he put as many as he could carry into his pocket. In the afternoon he went to the office where he had placed the Mauser rifle, when it had, by the officer\u0027s orders, been handed to him, put his own rifle in its place, and slinging the Mauser on his shoulder, went out again. Presently he found the two Kaffirs squatted near his horse, which they were feeding with bread they had picked up. Calling Peter to follow him he went into a quiet spot among the trees. \"You are going to carry a rifle, Peter,\" he said, \"the one that I have got on my shoulder. Can you shoot?\" \"I can shoot with a common gun, baas, but I don\u0027t know that thing; it doesn\u0027t seem to have any hammer.\" \"No, it is a Mauser. That is the gun the Boers use. I will show you how it works, for if we should get into trouble, and there are only a few Boers, we might fight. You see this slip, holding five cartridges. The breech opens like this; you push the five cartridges into the magazine, close it with this bolt, and the gun is ready for firing five shots without removing it from the shoulder. When the last shot is fired, you reload as before. You see how I do it. Now, let[Pg 141] me see you try; but don\u0027t pull the trigger. If you were to fire, we should alarm the camp.\" After a dozen attempts, the Kaffir learnt the knack of loading and firing the gun. \"I have plenty of cartridges here. You had better go and look in the Boer trenches, and you will find scores of bandoliers lying about. Pick two out, one for yourself and one for me, and fill them with cartridges. When we start I will divide those I have with you. That will amount to something like two hundred shots apiece. I am going to leave my rifle here and take another Mauser, as these cartridges won\u0027t fit my gun. Here are two tins of meat and enough bread to last us for a day, in case we cannot get straight through and have to hide up. Get hold of a piece of stuff to tie them all up in a bundle, which you can sling on your rifle. Fill these four water-bottles with the best water you can find. Don\u0027t take it out of the river, it is likely enough that there are a good many dead Boers in it. Now, there is nothing more for you to do before we start. You had better watch the horse by turns. Take it down to the river and give it a good drink an hour before sunset. \"You will find plenty of blankets in the Boer trenches. Take a couple of these and cut them up into strips, and before it gets dark fasten these thickly to the horse\u0027s hoofs, so that they will make no noise on the road. Fasten a roll of it on to my saddle; I shall twist it round my boots when I dismount, then I shall be less likely to slip in climbing over the rocks. And now I have one more word to say to you. If we should be surprised by the Boers, and I find that I must be taken, you are to escape if possible. Your death could be of no benefit to me, and if you were killed I should not forgive myself for having brought you with me. Now, you quite understand that this is an absolute order. But at the same time, when you have escaped you may be of immense service, you are to remember that. Of course, if I am kept a prisoner at Spytfontein you would find it alto[Pg 142]gether impossible to get near me; but if I am sent to Pretoria, you might follow at some distance, and possibly aid me to make my escape. So you see it would be to my interest, as well as your own, that you should get clear away.\" The Kaffir, who had looked sullen at the first part of the instructions, brightened up. \"I understand, baas. As long as baas fights, Peter will fight; when baas says \u0027Go,\u0027 Peter will run off, and do what he can to help afterwards.\" Yorke now returned to the office, and asked one of the sergeants there to look after his own rifle till he returned, and then went to the heap of Boer weapons and picked out a Mauser. All being now ready, he lay down and slept until sunset, and then went in to dinner. After the meal was over, the colonel took him in to the general\u0027s quarters, and said, \"This is Mr. Harberton, sir; he is going to start in an hour or so with your despatch for Kimberley.\" \"Do you know the country, Mr. Harberton?\" the general asked. \"No, sir, but I am taking with me one of the Kaffirs who has been there for two years. He worked at Dutoitspan, which is, he says on this side of the town, and not far from Beaconsfield, so that he knows the country all round perfectly; and I have every confidence that he will be able to guide me in, especially as the ground for the last few miles is flat. Of course I shall leave the road when I have gone a few miles, and make my way across the hills.\" \"It will be a hazardous journey, Mr. Harberton, and I admire your spirit in undertaking such a mission. I understand that you speak Taal well, but as you are going in uniform that will be no great advantage to you. If you succeed, I need not say that you will have rendered us a very great service, which will not be forgotten.\" \"It is just the service that I had hoped I should find an opportunity of performing, sir, when I volunteered to under[Pg 143]take the work of scouting and obtaining information, instead of enlisting in one of the regiments at Cape Town.\" \"Yes, I hear you rendered valuable service to the officer in command at De Aar by going in disguise to Fauresmith, and discovering that the Boers had no intention of attacking our base, for it was thus unnecessary to draw bodies of men from other points to aid in the defence of the place. I should not advise you to endeavour to return by the road by which you came, although you will be the best judge as to that; but it seems to me that it would be easier to get out by the other side and make a detour across the river somewhere near Douglas, and then make for Honeynest Kloof, and so here. Above all, tell Colonel Kekewich privately that it is by no means certain that we shall be able to force our way past Spytfontein. Lord Methuen will try to do so, but after what we have seen of the Boer style of fighting here there is no assurance that he will succeed, for the position by all accounts is a very strong one. \"Of course it will be impossible for you now to travel far by the road from here; the Boer position extends across it. Your best chance is to strike across the country and come on the road from Jacobsdal. Whether they are posted on that line or not I cannot say. It certainly lies beyond their main position, but they will hardly have neglected it altogether.\" \"Yes, sir, that is the route I propose taking.\" \"Well, I wish you good fortune and a safe return;\" and he shook hands with Yorke. At eight o\u0027clock Yorke started. The horse\u0027s hoofs had been effectually muffled and he had been provided with the countersign, and, passing through the pickets, he rode off, the Kaffirs trotting by his side. He had told the officer in command of the pickets that one of them would return with the horse in the course of an hour. After proceeding about four miles a glow of light could be seen here and there on Scholtz[Pg 144] Kop, a short distance to the left of the road they were following, and also away farther over on the same side on the hill of Spytfontein. These were but the reflection of the fires in the trenches where the Boers were cooking their suppers and smoking their pipes. No flame betrayed the positions held by them, but the hills seemed lit up by a faint glow. \"It is time to turn off, Peter,\" Yorke said, reining in his horse. \"They may have outposts on the road, and as they would be keeping quiet, we might get in among them before we noticed them.\" Although they were still nearly two miles from the Boer position they could distinctly hear in the stillness of the night a faint continuous murmur, such as might be made by a waterfall or a stream running among rocks. This they knew to be the talk of thousands of the enemy. They had been conscious of it even before they reached the turn in the road whence they saw the lights, for their own advance had been almost noiseless. The Kaffirs were running barefoot, and the horse\u0027s hoofs had been so well muffled that its footstep was no more audible than those of the natives. It was now time to dismount and send the horse back, and Yorke handed the animal over to the native who was to return to camp. \"When you get half-way back, Jack,\" Yorke said, \"take off those blankets from the horse\u0027s feet, so that our sentries can hear your approach. If you were to come up quite silently, and they did not hear you till you were close to them, they might fire hastily. Therefore, lead the horse, and when you get near the lines strike up a song—not too loud, but so that they can hear you a hundred yards away. When they challenge, that is to say, when they call, \u0027Who comes there?\u0027 you answer as I told you, then they will let you pass, though they may keep you until their officer comes. As I spoke to him on the way out, he will pass you through.[Pg 145] Don\u0027t go right into the lines near the Modder; half a mile outside lead the horse off the road and wait with him till it is daylight. You would be challenged by every sentry in camp if you were to enter in the dark.\" \"Good fortune to you, baas! I wish I were going with you,\" Jack said, and then led the horse away. \"Now, Peter,\" continued Yorke, \"our work begins. The first thing is to put the strips of blankets round our feet. You had better put on your own shoes and muffle them, otherwise you might lame yourself among the rocks, and that would be fatal to us both.\" The native did as he was told, then he said, \"Let us stop a little, baas, and listen. There may be Boers on that hill we have to cross.\" He stood for a minute or two listening intently. \"There are men up there,\" he said. \"Did you hear voices?\" \"No, but I heard a click as if a kettle had hit against a stone. I am certain that there are some of them up there—not many, perhaps, but certainly there are men there. We had better go back a little between that hill and the next. I will walk first, you follow quite close to me; I can see in the dark much better than you can. If there are rocks in the way I will stop, then you put your hand on my shoulder and I will lead you between them or show you where to climb across them.\" \"All right, Peter! I trust in you entirely, for I could not see a stone the size of my head on the ground.\" It took them four hours of severe work before they came down on the Jacobsdal road. The ground had in many places been covered with rocks and boulders, through which it would have been hard work to pick a way in the daylight, and quite impossible in the darkness for Yorke, had it not been for the guidance and assistance of Peter. Sometimes they had to climb rough and precipitous hills, and more difficult still, to descend the boulder-strewn slopes. In spite[Pg 146] of the care of his guide Yorke had had several heavy falls, had cut his hands and knees, and seriously damaged his garments. \"Now, shall we follow the road, baas?\" \"No, we had better not. There may be parties moving between Jacobsdal and the Boer lines round Kimberley, or reinforcements coming down to Jacobsdal from the north.\" \"They would not travel at night,\" Peter said positively. \"Boers can ride all day, but nothing would make them go out at night if they could help it. Boers sleep like a pig.\" \"Well, we will keep to the road for a bit then. I should like to push on as fast as we can, for we have some sixteen miles to go yet and we have lost a lot of time in getting across here, and if we were to take to the rocks again there would be very little chance of our getting through the Boer lines before daylight.\" They had gone about a mile when the native stopped. \"Men on the road, baas.\" \"Are you sure?\" \"Quite sure, baas. I heard one strike a match.\" Walking very carefully, they could presently make out a dark mass ahead of them. \"Waggons, baas,\" Peter whispered, and they at once left the road, moved a couple of hundred yards to the right, and then, stepping with the greatest care, continued their way parallel with the road. They could hear the sound of voices as two or three Boers talked together, and occasionally a movement among the oxen. They could not make out the outline of the waggons, nor see in which direction they had been moving, but guessed that it was a party of Boers from the north, moving down to strengthen Jacobsdal, or it might be a convoy of stores from that town for the use of the force beleaguering Kimberley. For the next hour their progress was very slow, for they had to make their way through thick bush,[Pg 147] and it needed the greatest caution to avoid being heard by the party on the road. It was not that they feared being hit by their fire, but the sound of rifle shots would put all the Boers within sound of them on the watch, and greatly diminish their chance of getting through. As soon as they were a quarter of a mile beyond the waggons they came down nearer to the road again. Here there were no bushes, but the ground was thickly covered with boulders of all sizes. At times the hills approached so close to the road that they were obliged to take to it for a while. Whenever this was the case they went at a trot, but as they were now abreast of the line of the Boer forts, they took to the rocks again as soon as possible. Twice they heard parties of horsemen coming along the road, and hid up until these had passed. \"They do not mean to be caught napping, Peter,\" Yorke said. \"They are evidently uneasy. I have no doubt they are well prepared along the Spytfontein line, but they cannot be sure that we shall try to break through that way, and may believe that we shall attack Jacobsdal, and, making a wide circuit, enter Kimberley from the north. In some respects that might be the better plan, and I have no doubt the general has well considered it; but although he might get into Kimberley that way without any fighting, he would be worse off when he got there than he is on the Modder. He has not sufficient stores collected yet to provision Kimberley for any length of time, and the fighting the other day showed that he has not enough men to defeat the whole Boer force stationed among the kopjes, so that he would be completely cut off, with the enemy between him and any force coming up to his assistance.\" Steadily they plodded on, keeping for the most part along the road, and stopping frequently to listen. Several times Peter declared that there were Boers among the hills on either side of them, and once or twice even Yorke could[Pg 148] faintly hear what he judged to be snoring in the stillness of the night air. At length even the keen ears of the native were unable to detect any warning sound, and he declared that they must now have passed the outside line. \"We have done with them now Peter, till we get near those round the town.\" They went fast now, for the night was nearly over, and the sky was beginning to lighten in the east when, leaving the road, they ascended the hill and saw a level plain stretching before them. \"It is too late to get through,\" Yorke said, \"another quarter of an hour and it will be light, and that dark mass of houses we see there must be nearly three miles away.\" \"Yes, baas, that is Beaconsfield; Kimberley is more away to the left, I can just make it out. What will you do now, baas? Go back a bit and hide, or go on to that little house half a mile away close to the road?\" \"I think we had best go on. We should have to go a good bit back to a place where the boulders are thick enough to give us a good hiding-place; it will certainly be light before we get there, indeed I am afraid it will be light enough before we can gain that hut, if there are any Boers on the look-out on that kopje to the right.\" They started at once, and had gone but half-way when they found that the distance had been deceiving, and that it was nearer a mile than half a mile to the hut, which, being white-washed, had seemed much nearer than it was. The light was broadening out rapidly and they ran at the top of their speed, but just before they reached the place a shot rang out from a low hill some four hundred yards away. For a moment Yorke hesitated, but he knew that where there were Boers there were ponies, and that they would be overtaken long before they could reach the British camp. \"We had better fight it out here, Peter. The firing may bring up help; we can certainly keep the Boers off for some time.\" race A RACE FOR LIFE. [Pg 149] The hut was some twelve feet square, a rough building of loose stone with a light roof. It apparently had been made for the occupation of men working on the road. It had no windows, and the door stood open. \"Now, Peter, get to work and get a stone or two out on that side so that we can fire on the enemy; the hole must be as small as possible. If we can make one or two on each side so much the better. I will bring some stones from outside to block the door up, then I will help you.\" He rolled in blocks, closed the door, and placed them against it. Then he set to work to make loopholes. The walls were loosely built, so that in two or three minutes he had made a satisfactory hole in the front of the hut, while Peter had already made one at the back. \"It is lucky that we did not run on,\" Yorke said, as he looked out. \"There are a dozen mounted Boers coming along from behind the hill. Work away, Peter, we had better have two holes, one on each side of the door; I will show these fellows that we mean fighting when they come a little nearer. They are sure to draw off and talk, and that will give us plenty of time to get ready for them.\" When the mounted Boers were within four hundred yards he took a steady aim and fired, one of them fell headlong from his horse; the others reined in sharply, but before they could turn, the rifle spoke out twice, another man fell, and a third swerved in his saddle evidently hard hit; the others galloped off, but the fourth cartridge in the magazine did its work, and another man fell. Yorke recharged his rifle, stood it in a corner, and then aided Peter. \"You hit them, baas?\" \"I have killed three and wounded one,\" he said quietly. \"That will make them careful; anyhow, they have learned that we can shoot.\" \"There are some men coming down the hill, baas.\" \"Very well, then, do you go on with your work, I will check them a bit too.\" [Pg 150] He went to a loophole the native had completed. Some twenty or thirty men were coming down the hill; the lesson given to the horsemen had not been without its effect on them also, for they were taking to what cover boulders and bush afforded. He waited till he got a good view of a man making his way from one shelter to another, and as he fired the Boer fell headlong. A dozen rifles flashed in reply; two or three bullets went through the roof, which was only of felt spread over a light framework, the others pattered harmlessly against the wall. \"Look out occasionally to see what the mounted men are doing, Peter. There is little chance of these fellows on the hill making up their minds to try a rush across the open ground, and though they may be good shots, their chance of getting a ball through a hole two inches wide and three high is not very great; it would be as well to make two more, so that we can move from one point to another.\" Peter soon finished his work. \"May I fire now, baas?\" he asked eagerly. \"Yes, but make sure of your aim. I have fired about twenty shots and at least eighteen have told. Certainly eight, counting those at the horsemen, have been fatal, that is what keeps them so quiet. A number of misses would encourage them. Always rest the muzzle of your rifle on bottom of the loophole. You had best fix upon your man, and watch the shelter where he is lying, then you won\u0027t be hurried, and can fire directly he moves or changes his position.\" \"Well done!\" he exclaimed two or three minutes later, when, as Peter fired, he saw a Boer pitch forward, while the native raised a triumphant shout. For hours the exchange of rifle-fire continued. \"They won\u0027t move till it is dark,\" Yorke said at one o\u0027clock; \"then will be the dangerous time.\" \"They will be able to creep up to the door and blow it in when it gets dark, baas. The best plan will be for you to[Pg 151] slip out and run; I will keep on firing, and they will think that we are both here; and when you have got a good start I will run too. The Boers on foot would never catch me; and as to the mounted men, they would not find me in the dark, I could hear them and they would not hear me, and I could always find some bush or boulder where I could hide if they came my way.\" \"I will not do that, Peter, unless you give me your solemn oath that you will not stay more than five minutes after I have gone. I am a good runner too.\" \"I will promise that, baas. I don\u0027t want the Boers to catch me, but if we were to stop firing they would guess at once that we had gone. I will fire very quick, sometimes out of one hole sometimes out of the other, so that they will think there are two of us. They would stop a minute or two after I had done firing, and then come up very slowly and cautiously. The only fear is from the mounted men, who will be out on the plain as soon as it is dark.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3126/85966.html","bookId":898,"book":{"id":898,"title":"With Roberts to Pretoria","description":"简介： The war in South Africa may be roughly divided into three parts. First, The desperate fighting in Natal, which culminated in the relief of Ladysmith. Second, The advance towards Kimberley begun by Lord Methuen but arrested at Magersfontein, and renew...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3126","creation":"Aug 1, 2019 12:23:50 AM","modification":"Aug 1, 2019 12:23:50 AM"}}
