{"id":109179,"no":12,"title":"Page 12","content":"I finally worked up the courage to see my mom and Roland a few days later. Tim had left for the day, but he\u0027d apparently baked this morning. A plate of almond poppy seed muffins sat on the kitchen table, and I grabbed two for the road.\n My ability to think clearly had improved with some rest, but my anger and pain hadn\u0027t really faded. I still felt betrayed and not just by Wil. If anything, I could forgive him more easily than anyone else. He had not fostered a years-long secret. His actions had been open and desperate. They had not been so insidious as Kiyo\u0027s, my mom\u0027s, and Roland\u0027s.\n When I arrived at the house, I didn\u0027t bother knocking. The front door was open, and I pushed inside, slamming it loudly behind me.\n \"Genie?\" I heard my mom call. \"Is that you?\"\n I walked across the wood floor, my shoes echoing in the foyer. Mom and Roland sat at the kitchen table, eating lunch. Bread and cold cuts were laid out, along with assorted condiments. It looked so normal. So peaceful and innocent. My mom half-rose when she saw me.\n \"Thank God you\u0027re back safe. I\u0027ve been so - what\u0027s the matter?\"\n I loved these people so much, but seeing them increased my fury, maybe because I did love them so much. For a moment, I couldn\u0027t get the words out. I just stared at them, looking from face to face.\n \"Eugenie?\" she asked tentatively.\n \"Who\u0027s my father?\" I demanded of her. \"Was I born in the Otherworld?\"\n I saw her go pale, her dark eyes widening in fear. In an instant, Roland was up beside her.\n \"Eugenie, listen - \" The look on his face spoke legions.\n \"Jesus. It really is true.\"\n I saw him open his mouth to protest, but then he thought better of it. \"How did you find out?\"\n Honesty, at least. \"It\u0027s all over the Otherworld. Everyone knows. I\u0027m apparently next in line for world domination.\"\n \"That\u0027s not true,\" he said. \"Forget about it. You aren\u0027t like them.\"\n \"But I am one of them, right? At least half?\"\n \"By blood only. Everything else...well, for all intents and purposes, you\u0027re human. You have nothing to do with them.\"\n \"Except killing and banishing them. How could you set me up for that...if I\u0027m...?\" One of them, I wanted to finish. But I couldn\u0027t get the words out.\n \"Because you have a talent for it. One we need. You know what they can do.\"\n \"Yes. And you\u0027ve made sure I do, telling me all the horror stories growing up. But there\u0027s a hell of a lot more than that. They\u0027re weird, yes, but not all evil.\"\n My mother suddenly joined the conversation, eyes wild and frantic. \"Yes! They are! You don\u0027t know what you\u0027re talking about. When did you have this revelation? A day ago? A week ago? I lived with them for three years, Eugenie. Three years.\" Her voice dropped to a whisper. \"Three years, and I never once encountered a decent one. No one who would help me. No one who would keep me from Tirigan.\"\n \"Who?\"\n \"Storm King,\" said Roland. \"That\u0027s his name. Was his name.\"\n \"They say you saved her from him.\"\n He nodded. \"I was there chasing down a kelpie when I heard rumors of a captured human woman. I went to investigate and found her and you. You were a baby. I slipped you both out of there and hid you.\"\n \"But Dorian...someone I met...said Storm King came looking for us.\"\n \"He did. And he found you.\"\n I frowned. From what Dorian had said, I should have been a young teenager then. \"I don\u0027t remember that.\"\n Roland nodded again. \"Once close enough, he could reach out and call to you. He summoned you to him. By the time I tracked you down, you were out in the desert, very near a crossroads. You\u0027d walked miles to get to him.\"\n \"I don\u0027t remember that,\" I repeated. In some ways, what Roland told me now was crazier than what I\u0027d learned at Aeson\u0027s.\n \"His magic spoke to yours. He wanted to take you back with him, and you fought against him. You were struck by lightning in the process.\"\n \"Wait, I know I\u0027d remember that.\"\n \"No. I hypnotized you and repressed it. I killed him, but your magic had still been awakened. After seeing what I\u0027d seen, I was afraid you couldn\u0027t control it - that it would control you instead.\"\n \"I don\u0027t have any magic. Not gentry magic anyway.\"\n \"Not that you know of. It\u0027s hidden away. I made you forget. After that, I started teaching you the craft in the hope of protecting you. I didn\u0027t know if others would follow him or if someone else could reawaken you or summon you. I needed to give you the tools you\u0027d need for defense.\" He suddenly looked tired. \"I never realized how well you\u0027d take to them.\"\n I felt as tired as he looked, despite all the sleep. I pulled up one of the chairs and sat; they continued to stand. So I had met Storm King. I had answered his summons. And I had been struck by lightning? That was interesting, because in a lot of cultures, shamans are called to their art through some traumatic event. Lightning strikes are actually common ones. Many of the local Indian shamans - already skeptical of the plethora of New Age white shamans - did not consider me authentic since I\u0027d had no such profound initiation. Turns out I had. Score one for me.\n \"You made me forget. You got inside my head, and you made me forget. All this time...both of you have known and never told me.\"\n \"We wanted to protect you,\" he said.\n \"And what then? Did you think I\u0027d never find out?\" The heat rose in my voice again. \"I had to hear it from gentry. I would have rather heard it from you.\"\n My mother closed her eyes, and one tear trailed down her cheek. Roland regarded me calmly.\n \"In hindsight, yes, that would have been better. But we never thought it would actually come out.\"\n \"It\u0027s out,\" I said bitterly. \"Everyone knows it. And now everyone wants a piece of this prophecy - and of me.\"\n \"What prophecy?\"\n I told them. When I finished, my mother sat down and buried her face in her hands, crying softly. I could hear her murmuring, \"It\u0027ll happen to her. It\u0027ll happen to her too.\"\n Roland rested a hand on her shoulder. \"Don\u0027t put much stock in gentry prophecies. They come out with a new one every day.\"\n \"Doesn\u0027t matter, if they believe it. They\u0027re still going to come after me.\"\n \"You should stay with us. I\u0027ll help protect you.\"\n I stood up, glancing at my mother. No way would I expose her to more gentry. \"No. This is my problem. Besides, don\u0027t take this too badly\" - I felt myself start to choke up - \"but I don\u0027t really want to see you guys for a while. I guess you meant well, but...I need to...I don\u0027t know. I need to think.\"\n \"Eugenie - \" I saw raw pain on his face. My mom\u0027s sobs grew louder.\n I stood up, averting my eyes from both of them. Suddenly, I couldn\u0027t stay here anymore. \"I\u0027ve got to go.\"\n Roland was still calling after me when I practically ran out of the house. But I needed to get away, or I\u0027d say something stupid. I didn\u0027t want to hurt them, even though I probably had. But they\u0027d hurt me too, and we all needed to deal with that.\n While opening my car door, I looked up and saw a red fox watching me from the same spot as last time.\n I strode toward him, close but not too close.\n \"Go away!\" I shouted.\n He stared at me, unmoving.\n \"I mean it. I\u0027m not speaking to you. You\u0027re as bad as the rest of them.\"\n He lay down, resting his chin on crossed paws while he continued to regard me solemnly.\n \"I don\u0027t care how cute you are, okay? I\u0027m through with you.\"\n A woman working in her yard next door gave me an uneasy look. I turned my back on the fox, got in the car, and drove home. Yet, as I did, I couldn\u0027t help but feel relieved Kiyo had survived. I honestly hadn\u0027t known if he would. Strong and vicious he might be, but Aeson had been slinging fire at him. The question was, had Kiyo merely escaped? Or had he managed to kill the king? What had happened to Jasmine?\n Tim still wasn\u0027t back when I got home. I decided then I didn\u0027t want to leave my house that day or make any pretense of productivity. I wanted to hit the sauna, put on pajamas, and then watch bad TV while eating Milky Ways. It seemed like a pretty solid plan, and I set out to make it happen.\n Twenty minutes later, I sat immersed in hot steam, draped in humidity. Heat was great for loosening muscles, although that only made me realize how much I\u0027d hurt them. At least I\u0027d made it out alive. That was the real miracle, considering what a disaster last night had turned into.\n I didn\u0027t want to think much about it or about Mom and Roland, but it was hard not to. Part of me still believed - still hoped - that all of this was a mistake. After all, wasn\u0027t it just everyone\u0027s say-so? Of course, somehow I doubted my parents would make all that up. But really. Where was the DNA test? The photographic evidence? I had nothing tangible. Nothing I could see and believe.\n Except my own memories. The memories Roland had covered up for me. Hypnotism wasn\u0027t uncommon in our line of work. It was just another state of unconsciousness. Shamans who served as religious leaders and healers used similar techniques on their followers and patients to heal the body and mind. Roland and I, as \"freelance shamans,\" didn\u0027t really have much need for it. Our contact with the spirit world often became more physical and direct. But I had done some healings and soul retrievals, so I knew the basics.\n Leaning my head against the wall, I closed my eyes and thought about the tattoo of Selene on my back. She was my earthly connection, the grounding of my body and soul and mind in this world. I focused on her image and what she represented and then slowly altered my state of mind. Rather than slipping out to another plane, I crossed inward, back into the far reaches of myself and the parts of me buried in my unconscious.\n It probably didn\u0027t take long, but in that state, it was painstakingly slow. I browsed through pieces of me, both memories and hidden truths alike. All the things that made me Eugenie Markham. I concentrated on lightning, hoping it would snag my attention. Surely a lightning strike couldn\u0027t be buried forever.\n There. A faint tug. I dove in after it, trying to grasp it and the memory it linked to. It was difficult. The image was slippery, like trying to hold on to a fish. Each time I thought I had it, it wriggled away. Roland had done a good job. Steeling myself, I fought against the layers, clawing and fighting until -\n I woke up in bed.\n But it wasn\u0027t the bed in my house. It was a different bed, a smaller bed covered in a pink comforter. The bed of my childhood. I lay in it, staring up at a ceiling covered in plastic stars just like the one I had as an adult. It was the middle of the night, and I couldn\u0027t sleep. I\u0027d been an insomniac then, just as now. This time, however, it was different. Something other than my churning mind was keeping me awake. Somewhere, outside, I could hear a voice calling me. No, not a voice exactly, but it was a pull. A pull I couldn\u0027t shut out.\n Climbing out of bed, I slipped my feet into dirty sneakers and put a light jacket on over my pajamas. In the hallway, the door to Mom and Roland\u0027s room was closed. I moved past as quietly as possible, down the stairs and then out the door.\n Outside, the air was still warm. It was high summer. Earlier temperatures had been in the 100s; even now, they had dropped only to the 80s. I walked down the quiet street of our neighborhood, past all the familiar cars and houses. With each step, the call grew louder. I followed, my feet moving on their own. The call led me away from our street, our subdivision, and even the small suburb we lived in. I traveled off of main roads, moving onto trails I\u0027d never known existed.\n Then, after almost two hours, I stopped. I didn\u0027t know where I was. The desert, obviously, because that and the mountains were all that surrounded Tucson. The foothills were larger than at home, so I must have gone north. Otherwise, there were no distinguishing features. Prickly pears and saguaros spread out around me in quiet watchfulness.\n Suddenly, I felt the air around me charge. There was a presence with me. A person. I turned and saw a man standing and watching me, far taller than my twelve-year-old self. His features were indistinct; I could not make them out no matter how hard I tried. He was only a dark shape, crackling with power.\n \"Eugenie...\"\n I took three steps back, but he held his hand out to me.\n \"Eugenie...\"\n I shook off the thrall that had brought me out here. Desperately, I realized I had to get away as quickly as I could. But I no longer knew the way back. The trails I\u0027d followed were a blur. So, I backed up farther, but he kept coming, beckoning to me. My feet stumbled, and I fell. Still facing him, I tried to get up, but he stood over me now. In his indistinct features, I could make out a crown on his head, glittering silver and purple.\n \"Come,\" he said, extending his arm to help me up. \"It\u0027s time to go.\"\n I was trapped. Helpless and trapped and out of options. I had never felt so desperate in my young life. It terrified me. I decided then and there that if I survived this, I would make sure I could never be helpless again. His hand touched my shoulder, and I screamed. As I did, some part of me reached out beyond my body and grasped the power lying around us -\n I blinked.\n Steam swirled around me in the sauna, and I felt lightheaded. I\u0027d been in there too long; it was a wonder I hadn\u0027t passed out. Standing up, I had to grip the wall for support and close my eyes. My heart raced from the vision, the vision that finally convinced me all of this was true. I knew - knew with absolute certainty - that the dark man had been Storm King, my father. I could feel it within me. In my soul.\n Overcome, I sat back down, needing a few more moments to consider all this and get my bearings.\n Yet, the longer I sat there, the more I began to despair. Storm King really was my father. And as for the rest of my life...well, things were bad. And they were only going to get worse. Every horny gentry wanted to knock me up; the rest probably still wanted to kill me. I\u0027d never have a moment of peace again.\n Minutes passed as I ruminated on all this, falling deeper and deeper into depression - as well as exhaustion. I felt fatigued, too apathetic to care about any of it now. What was the point? I had snubbed my parents today. I\u0027d let Jasmine Delaney down. I had nothing to look forward to ever again except a life of fighting and running. And really, why should I even bother fighting anymore? Nothing mattered. It was hopeless. I should just cross over to the Otherworld and give myself up. At least it\u0027d stop the agony of -\n I opened my eyes and sat bolt upright. What was wrong with me? Things were grim, but this...this wasn\u0027t natural.\n I blinked rapidly, trying to gain focus as I took deep breaths. There it was. I could feel it. A thick, unseen darkness wrapping itself around me. It touched me, crawling along my skin. It was trying to drag me down, to suck away all of my energy. All of my hope.\n Standing up, no longer dizzy, I pulled my robe off its hook and put it on. Slowly, I opened the door of the sauna and stuck my head out. I saw nothing too disconcerting, but that bleak feeling continued to swirl around me. The light almost seemed dimmer, darker than it should be for late afternoon. I squinted, trying to break the illusion, for that\u0027s what it was.\n Stepping completely out of the sauna, I tried to assess the source. The sauna was in the center of my house. Turn left to go to the kitchen and living room, right toward the bathroom and bedrooms. My weapons were in my bedroom; that was where I wanted to be. But if the thing was in the front of the house, I didn\u0027t want to turn my back on it. At last, I compromised by putting my back up to the hall\u0027s wall and sliding down it toward my bedroom. The distance wasn\u0027t far, but when you had to inch your way there, it felt like miles. Creeping, I passed Tim\u0027s closed bedroom door, grateful he wasn\u0027t here. He knew about my shamanic adventures, but that didn\u0027t mean I wanted him exposed to them.\n Next came the bathroom. Yeah, the only bathroom. The thing about cute little houses was the \"little\" part. I loved everything else about this place, but next time, I\u0027d make sure my house had at least as many bathrooms as occupants. Tim and I had gotten into some nasty rumbles when -\n A hand reached out for me from within the dark bathroom, but I saw it coming out of my periphery. I ducked and slid across the hall as he lumbered out. A Gray Man. That had been one of my top three culprits for the negativity zone my house had become. Gray Men cast an aura of despair around them, feeding off physical energy and positive feelings.\n This one was, well, gray, of course. Other than that, he looked more or less human-shaped, with dark eyes and scraggly white hair. He was even dressed, which I took as a plus since other monsters and sometimes elemental gentry often came over in loincloths or nothing at all, depending on their strength. Considering what everyone wanted to do to me, I was pretty happy about keeping genitalia covered up.\n I tried to scramble toward my bedroom, but his long arm reached out and grabbed me by the hair. I yelled out as he dragged me toward him, pressing me to his body. At least he didn\u0027t say anything suggestive; Gray Men were apparently strong, silent types. But the way he grappled with my robe left little to the imagination about what he wanted to do. Struggling in his strong grasp, I tried to break free but mostly managed to loosen my robe more. Swearing, I decided if I couldn\u0027t get away, then I\u0027d at least delay his amorous actions. My knee jutted up in one hard motion, hitting him in the groin.\n His hold on me loosened, and he groaned as one hand instinctively reached down between his legs. I broke away from him, still trying to make for my bedroom. Deciding he could ignore the pain, he lunged toward me, just stopping me from getting to my bedroom doorway. Gripping me by both shoulders, he shoved me up against the wall so that I faced it. Using that hard surface as a constraint, he held me with one arm against it while his other finished pulling off the robe.\n I felt his tongue lick my neck, but the truly disgusting nature of that couldn\u0027t really permeate me. I was in survival mode now. I struggled against him, hoping to make it difficult for him to get his own pants off. Being pinned liked this gave me fewer options for escape. Moving my hands against the wall, I groped around for something - anything - I could use as a weapon.\n Then my fingers brushed over a small decorative mirror that had been my grandmother\u0027s. It wasn\u0027t very big, but its frame was shaped like a sun - with sharp, pointed metal rays. Not only that, they were silver rays. Grabbing it from the wall, I held it in my left hand, not my dominant hand, but the hand I wore my amethyst ring on. The amethyst could cut through magic and glamour and also focus my own intentions. It wasn\u0027t as good as a wand, but it had to do. Concentrating on the stone, I let my will pour into it. The stone amplified my energy and then sent it into the silver frame. In as fluid a motion as I could manage in my confined state, I swung the mirror back, driving it into any flesh I could find.\n The Gray Man screamed, and I smelled something burning. He released me, and I turned around, not wasting any time, though I uneasily realized I\u0027d dumped more energy into that silver than I should have been capable of. The mirror had stuck in his side and was smoking. It wouldn\u0027t kill him, but having it lodged in there was pretty serious. He reached out toward it with hesitant fingers, knowing he had to touch it to pull it out. I sprinted to my bedroom.\n He was only seconds behind me, but it was all I needed to arm myself in my bedroom. He came running in after me, but this time I was on the offensive. I used the silver athame to draw the death symbol on his chest, eliciting a tortured scream from him. Iron was the bane of gentry, but for whatever other reasons, silver hurt anything else Otherworldly. I didn\u0027t know why, but I didn\u0027t question it either. Especially when it had just proven so handy.\n Hurt or no, he pushed me backward. I landed on my bed, head hitting with a crack against the wall. It slowed me, but I had already started connecting beyond this world. I reached out, touched the world of death, and sent that connection through the wand. It leapt out at the Gray Man, sucking him in. He fought it, thrashing as though physical action might fight the pull. It couldn\u0027t. A moment later, he vanished.\n Almost immediately, the spell of despair in my house disappeared. It was like emerging from underwater. I could breathe again. I let my body slump and relax. I wanted to lean my head against the wall but knew that wouldn\u0027t feel too good after the hard blow I\u0027d just sustained.\n A loud sound cracked out from the front of my house, like the door being kicked open. I jerked up, adrenaline going a second round as I heard footsteps pounding down the hall. I was reaching for the gun when a familiar voice yelled, \"Eugenie?\"\n Relaxing - only slightly - I watched as Kiyo burst into my room. \n","sourceLink":"https://allnovel.net/storm-born-dark-swan-1/page-12.html","bookId":2038,"book":{"id":2038,"title":"Storm Born (Dark Swan #1)","description":"Storyline: \n Dark Swan Series Book 1: Storm Born \n Storm Born is a supernatural, romance and fantasy novel written by American author Richelle Mead. It is the first in the Dark Swan series, followed by Thorn Queen and Iron Crowned. The fourth in the series Shadow Heir is set for publication January 2012. The series follows the main character Eugenie Markham, a \"shaman-for-hire\" and her encounters in the \"Otherworld\", a parallel world occupied by the \"shining ones\" and her adjustment to a prophecy stating her first-born son would be a powerful conqueror of both worlds.\n \n","cover":"https://allnovel.net/images/storm-born-dark-swan-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/storm-born-dark-swan-1.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:32:34 PM"}}
