{"id":109176,"no":9,"title":"Page 9","content":"\"What\u0027s the point of a bedroom? I mean, you guys seem to be more into public sex anyway.\"\\n\\n Dorian gestured me around a corner to his suite or wing or whatever. \"What we do is natural. We don\u0027t hide it. Besides, it\u0027s actually quite titillating to know others are watching. Haven\u0027t you ever done it?\"\\n\\n \"Sorry. I\u0027m not an exhibitionist.\"\\n\\n And yet, as soon as I said the words, I thought about Kiyo. We\u0027d been all over each other at the bar, and then we\u0027d had sex out on the balcony. We hadn\u0027t drawn that much attention, but we could have. Just thinking about it made me shudder - in a good way.\\n\\n We passed through another set of double doors with two guards standing outside. They had weapons, but I knew their magic posed the true threat.\\n\\n Once Dorian had closed the doors behind us, I turned and took in the room. \"My God. Why would you have sex in the dining room when you could do it in here?\"\\n\\n \"I do do it in here. I do it in there. Honestly, it doesn\u0027t matter. I like variety.\"\\n\\n The room spread out for what seemed like miles, the far wall composed almost entirely of windows. It probably had a stellar view in the daytime. Everything from the paint to the enormous satin-covered bed was painted in shades of gold and wine. The torches on the wall added a charming, almost kinky touch. To one side I saw a room that must have served as a bathroom, judging from the giant marble tub. Opposite that, a parlor of sorts extended off on the other side of the room. He beckoned me there to an ornate chair with velvet cushions.\\n\\n \"Wine?\" he asked, picking up a crystal decanter from a little table.\\n\\n \"You know the answer to that.\"\\n\\n \"I\u0027m sure a small taste won\u0027t hurt.\"\\n\\n \"Yeah, and Persephone thought a few pomegranate seeds wouldn\u0027t hurt either. Now she rules the Underworld.\"\\n\\n He poured himself a glass and sat down in a chair facing mine at an angle. \"Would it be so bad to rule here?\"\\n\\n \"I\u0027m going to ignore that question. Now look, I need to talk to you about a guy named Aeson. He kidnapped a human girl - \"\\n\\n Dorian waved a hand to stop me. \"No business yet.\"\\n\\n \"But I need to get her back soon - \"\\n\\n \"And I will help you, I swear it. Now. One more hour won\u0027t matter. Sit with me, and I\u0027ll tell you a story.\"\\n\\n \"A story? You\u0027re serious?\"\\n\\n \"My dear Odile, I assure you I am always serious - well, no, actually that\u0027s a lie. Most of the time I\u0027m not. But this time I happen to be. So make yourself comfortable.\"\\n\\n I sighed, slouched back in the chair, and took out the other Milky Way. Seeing his eyes on it, I broke it in half and handed him a piece. Nodding his thanks, he ate it with the wine, something that looked ridiculous and nearly made me smile.\\n\\n \"Now. Tell me something. Have you ever heard the story of Storm King?\"\\n\\n \"No. Is or was he a real guy?\"\\n\\n \"Very real.\"\\n\\n \"So what, is there, like, a Storm Land or something?\"\\n\\n \"Not exactly. He did rule a vast area, but the title was more honorary due to his ability to control storms and the weather.\"\\n\\n \"Sounds reasonable.\"\\n\\n He quirked me a half-smile. \"I\u0027m guessing you don\u0027t realize just how important that is.\"\\n\\n \"Not really. I mean, all of you have some kind of magic, right? Why not storms?\"\\n\\n \"Ah, but to control storms and the weather is to literally control the elements. Water. Air. The fire of lightning. To see him in his fury was a terrible and amazing thing. He could call down the very heavens to smite his enemies. Few of us have such strength. I\u0027ve never seen his equal, and I\u0027ve lived almost two centuries. Even when crossing into your world, his powers didn\u0027t dim.\"\\n\\n \"What do your own powers do?\" That was probably something I should have known before being alone with him.\\n\\n \"I can summon and control materials that come from within the earth. Dirt. Rocks. Magma on occasion.\"\\n\\n \"The magma sounds cool, but the rest...well, sorry. Not so impressive.\"\\n\\n Those golden eyes sparkled. \"I could call down the stones that have built this keep and reduce the entire building to a pile of rubble within minutes.\"\\n\\n I glanced around us. \"Yeah. Okay. That\u0027s impressive.\"\\n\\n \"Thank you. Anyway. With power like that, he inevitably drew followers. In those days, we were more fractured...split into smaller kingdoms. Our political and geographic divisions are always changing. Storm King sought to remedy this. He conquered and united a number of the smaller rulers, attempting to unite all of the shining ones under his rule. He made astounding progress.\"\\n\\n \"Was he a good king?\" I was getting sucked in despite my best resistance.\\n\\n \"Depends on how you define \u0027good.\u0027 He was a good war leader, certainly. And he was ruthless - which is an ugly but sometimes necessary part of ruling. But, with such power, he had no qualms about taking what he wanted - no matter the inconvenience to others. Those who angered him died without question. If he wanted land, he took it. If he wanted a woman, he took her. Some of those women thought it was an honor, some were taken forcibly.\" Dorian paused, giving me a look both studious and sympathetic. \"Some were human.\"\\n\\n I stiffened. \"Like Aeson.\"\\n\\n \"Unfortunately, yes.\"\\n\\n \"\u0027Unfortunately\u0027? You\u0027re one of them. You must have a thing for humans.\"\\n\\n \"Of course I do. We all do - men and women alike. You all smell like musk and sex. It screams fertility. It calls to our most basic, primal instincts to reproduce. For a people whose children are dwindling, that means something. So, yes, I understand men like Storm King and Aeson, but\" - he shrugged - \"I\u0027ve never been with a woman who didn\u0027t want me, never taken one by force. Not even a human.\"\\n\\n \"You seem to be in the minority.\"\\n\\n \"No, as I told you earlier, it\u0027s only a small number of us who infringe on humans. You have your own rapists. They too are only a small number.\"\\n\\n I shifted and leaned my head against the chair\u0027s back. \"Fair enough. Get on with the story.\"\\n\\n He paused a moment, looking surprised, like he couldn\u0027t believe I\u0027d conceded a point to him. I could hardly believe it myself.\\n\\n \"Very well. Storm King\u0027s ambitions extended beyond conquering this world. He wanted to conquer yours as well.\"\\n\\n \"That\u0027s impossible.\"\\n\\n \"Not so. The desire to return to our homeland burns in all of us; it would push many to extreme actions. He drew a lot of support, armies willing to cross over for this dream. He had the power to make it happen. He planned a massive Samhain invasion, consisting of shining ones and spirits alike.\"\\n\\n \"What happened? Obviously it didn\u0027t work.\"\\n\\n Dorian had propped up his elbow again, resting his hand in his chin as he had on his throne. That gorgeous hair hung off to one side, a stream of molten copper. \"I\u0027ll tell you in a moment. First I\u0027d like your opinion on all of this. What do you think about this plan of his in light of your earlier noble words about conquerors and how the conquered must simply accept their fate? If our forces took yours in fair warfare, would you accept that so easily?\"\\n\\n \"I hate hypothetical questions.\"\\n\\n He simply smiled.\\n\\n \"Okay, then. \u0027Accept\u0027 is a funny thing. I mean, I guess if our armies and infrastructure were destroyed, I\u0027d have to accept that on a certain level. Would I like it? Would I just let it go? Probably not. I\u0027d probably always keep fighting. Looking for some way to change things.\"\\n\\n \"Then perhaps you understand our attitudes toward you and the world you live in.\"\\n\\n \"Yeah, but...why not let it go? You have a perfectly nice world here.\"\\n\\n \"You\u0027re contradicting yourself.\"\\n\\n \"Well, in the scenario you described, we don\u0027t have a new world. We\u0027re subjugated in your new one.\"\\n\\n \"Would it make a difference?\"\\n\\n I stared off at one of the flickering torches. \"No. Probably not. I don\u0027t know.\" He was making me empathize with the gentry, and I didn\u0027t like it. I turned back to him. \"What happened, then? Is this Storm King someone I should go hunt down?\"\\n\\n \"No, alas. He\u0027s already dead.\" Dorian watched me for a moment, weighing me for some purpose I couldn\u0027t understand. \"Roland Markham killed him.\"\\n\\n I straightened up. \"What?\"\\n\\n \"You didn\u0027t know that.\"\\n\\n \"No. Of course not. I\u0027ve never even heard of this Storm King guy until tonight.\"\\n\\n This answer turned Dorian pensive, momentarily halting his normal jocosity. \"That rather astonishes me. Storm King must have been the greatest conquest of Roland Markham\u0027s career. How can you not know? Isn\u0027t he your father?\"\\n\\n \"My stepfather. But he trained me.\" I turned the information over in my mind. \"I don\u0027t know why he never told me. When did it happen?\"\\n\\n \"Oh, about...thirteen years ago. Maybe fourteen.\"\\n\\n That was around the time Roland had started training me. Coincidence? Had the threat of Otherworldly invasion frightened him into defying my mother\u0027s wishes?\\n\\n When I didn\u0027t say anything, Dorian continued: \"Not surprisingly, Roland Markham has his own reputation around here. But some say with your kills, you have surpassed him.\"\\n\\n \"I wish you guys wouldn\u0027t paint me like some bloodthirsty avenger.\"\\n\\n \"Prejudice works both ways.\"\\n\\n \"Yeah, but come on. Half the time, I just send them back here.\"\\n\\n \"You kill enough to scare most of the people out in the main hall.\"\\n\\n \"But that\u0027s not why you\u0027re telling me this story.\"\\n\\n \"True enough.\" He poured another glass of wine. \"You are brave, Eugenie Markham. You are brave and strong and beautiful. But your perspective and view of the world - worlds - are flawed. You don\u0027t understand us. We don\u0027t behave as we do out of an evil nature. We have reasons for our actions.\"\\n\\n \"Just as I do for mine. I don\u0027t kill because I enjoy it.\"\\n\\n \"Well, I wonder about that, but yes, I get your point. You do what you do out of loyalty to your own kind. You want to protect them and see that they have the best lives they can.\"\\n\\n \"This is where you say you\u0027re doing exactly the same thing.\"\\n\\n He laughed out loud, the sound rich and melodious. \"Why, Eugenie, did we just have a moment of rapport?\"\\n\\n \"You\u0027ve stopped calling me Odile,\" I noted, deflecting the question.\\n\\n \"We aren\u0027t in public. It doesn\u0027t matter.\"\\n\\n \"Whatever. So...when Storm King was gathering his armies and followers...were you one of them?\"\\n\\n Dorian\u0027s levity faded. \"Yes. I was. One of his biggest supporters, actually.\"\\n\\n \"Would you do it again? If you got the chance?\"\\n\\n \"In a heartbeat. I would give anything to see his vision realized. Since his death, prophecies and omens have abounded, whispering of other opportunities that might come in the future. I pay attention to them all.\"\\n\\n I didn\u0027t respond.\\n\\n \"What are you thinking about?\"\\n\\n \"I\u0027m trying to decide if I should break my hospitality vow and kill you.\"\\n\\n His good humor returned. \"Do you know how glad I am that you stopped by tonight? I haven\u0027t had this much fun in years. But you won\u0027t kill me. Not tonight, at least, and not even because of the promise.\"\\n\\n I looked up at him again, a smile suddenly playing on my own lips. \"Oh? And why are you so sure of that?\"\\n\\n \"Because I told you exactly how I feel. If I\u0027d lied and said I had no interest in the human world or following Storm King\u0027s vision, you wouldn\u0027t have believed me. In telling you the truth, I shall live another night. You may not like me, but I think honesty might have bought me your respect.\"\\n\\n \"It might have.\" Again, I lapsed into silence. Dorian seemed incapable of handling that.\\n\\n \"Now what are you thinking?\"\\n\\n \"That you almost seem human.\"\\n\\n He leaned toward me, a bit closer than I felt comfortable with. \"Should I be flattered or insulted?\"\\n\\n I gave a small, rueful laugh. \"I don\u0027t know.\"\\n\\n \"You have a lovely smile.\"\\n\\n \"Hey, don\u0027t start with that. I don\u0027t care how honest you are or how musky I smell.\"\\n\\n He leaned back in his chair. \"As you say.\"\\n\\n I still couldn\u0027t get over the idea of a massive invasion. \"So, is your attitude toward Storm King pretty common? Do others feel the same way?\"\\n\\n \"Some do, some don\u0027t. Maiwenn, queen of the Willow Land, believes he was evil incarnate. She wouldn\u0027t join up with him and thought his plan would lead us to ruin. Others gave up after Storm King\u0027s defeat. If he couldn\u0027t do it, no one could. But others...well, many others still carry the dream. Including your King Aeson.\"\\n\\n I sighed. \"At last we get down to business.\"\\n\\n \"If we must. So. I gather you want to remove this girl from him.\"\\n\\n \"Yes.\"\\n\\n \"And how are you doing this? With your servants and that human?\"\\n\\n \"Yes.\"\\n\\n Now Dorian didn\u0027t say anything.\\n\\n \"Hey, I know it\u0027s crazy, but I don\u0027t have any choice.\"\\n\\n \"Which is why you come to me.\"\\n\\n I nodded, and at long last, I saw the wisdom of Volusian\u0027s plan. If Dorian really could destroy this castle, he\u0027d be a pretty good asset on a rescue mission.\\n\\n \"Despite my compelling story about protecting my own kind, you actually think I would go against Aeson.\"\\n\\n \"Volusian - my servant - told me you two don\u0027t get along.\"\\n\\n \"He\u0027s right. Aeson is one of our strongest leaders, but I don\u0027t like the way he rules or deals with his so-called allies. Yet, that doesn\u0027t mean I can walk over there with you and openly oppose him.\"\\n\\n \"But you said earlier - \"\\n\\n \"That I would help. I still will. I\u0027m just not going to do so in person.\"\\n\\n Whatever kindly feelings I\u0027d been building toward him disappeared. My voice turned icy. \"Okay, so what are you going to do?\"\\n\\n \"I have a servant here who used to be one of Aeson\u0027s men. I\u0027ll send him with you as a guide.\"\\n\\n \"What good is that? My spirits already know the way.\"\\n\\n \"They don\u0027t know the back ways. My servant knows the place intimately. He is far more likely to get you in unseen. I don\u0027t know much about human tactics, but I imagine even in your world, subtle and stealthy is safer than marching in openly. Especially when you\u0027re outnumbered.\"\\n\\n I slouched back in the chair. \"I suppose.\"\\n\\n \"Now you\u0027re pouting,\" he teased.\\n\\n \"No, I\u0027m not.\"\\n\\n \"I don\u0027t mind. It\u0027s charming.\"\\n\\n \"No, it\u0027s not.\"\\n\\n He touched my chin to turn my face toward his. \"It is. But it\u0027s still unwarranted. Would you have helped me even a little if I\u0027d come to you in a similar way?\"\\n\\n \"No.\" I didn\u0027t even try to make a pretense otherwise.\\n\\n He withdrew his hand, still smiling. \"We are all honest tonight. Well, then. I suppose I should introduce you to Gawyn.\"\\n\\n \"Wait,\" I said. I stood up uncertainly. All of this honesty talk had put me in mind of Kiyo. So had the sex talk. Okay, everything made me think about Kiyo lately.\\n\\n \"You have another question?\"\\n\\n I studied Dorian carefully. He was one of the gentry, but something about this brief encounter made him...well, if not exactly trustworthy, then less untrustworthy. And really, he was the closest thing I might have to a true gentry resource.\\n\\n \"Yes. I do.\"\\n\\n I took off my jacket and then turned around, facing away from him. I wore no backless tank top today and had to completely pull off the long-sleeved shirt I had on. After a moment\u0027s consideration, I took off my bra too.\\n\\n \"Oh,\" said Dorian. \"I think I\u0027m going to like this question.\"\\n\\n I wrapped my arms around my breasts, still keeping my back to him. \"Do you see the scratches?\"\\n\\n \"Of course.\"\\n\\n \"Do you know what they are? I think something Otherworldly made them.\"\\n\\n I heard him stand up and approach me. Moments later, his fingertips lightly grazed the marks, following their tracks. His touch was slow and considering, one that truly sought to feel me. It shouldn\u0027t have been erotic - for a lot of reasons - but it was anyway. His fingers trailed all the way down the scratches and then back up.\\n\\n \"I can\u0027t tell you what made them,\" he said at last, \"but I can tell you they were magically inflicted. If I had to guess...I\u0027d say you\u0027ve been marked.\"\\n\\n \"Marked how?\"\\n\\n \"I think whoever - or whatever - made these did so to track you. As long as these are on you, the maker can find you.\"\\n\\n I shivered, and it had nothing to do with being topless or the fact that his fingers were still on me. \"Can you get rid of them?\"\\n\\n \"No. They might eventually go away on their own, but I can\u0027t tell you when. Who made them?\"\\n\\n I hesitated. \"A man.\"\\n\\n Dorian spread his fingers out so that his palms were facedown on my back. \"I\u0027d be hard-pressed to scratch you like that standing here. I\u0027d need to have my arms around you.\"\\n\\n I didn\u0027t answer.\\n\\n I could feel his soft laughter against my skin, and somehow, he now stood closer. \"Why, Eugenie Markham, slayer of gentry, what have you done?\"\\n\\n \"I don\u0027t know.\"\\n\\n He ran his hands down my back until they rested on my hips. \"And that\u0027s killing you, isn\u0027t it? That you might have let something you despise touch you like that. Did you enjoy it?\"\\n\\n \"None of your business. And you\u0027re standing too close.\" I turned around, still wrapping my arms around me as I stepped away. \"The inspection\u0027s over.\"\\n\\n \"If you wish. I\u0027m not sure you really want it to be over.\"\\n\\n \"I don\u0027t do...\" I stopped.\\n\\n \"Gentry?\" He stepped forward again, resting his hands on my arms, holding more tightly than he needed to - not that he needed to be touching me at all anymore. I should have decked him, but I didn\u0027t. He had considerable height on me but had to lean down to close the distance between our faces. He smelled like cinnamon. \"You know, in spite of your deadly reputation, any man in this keep would bring you the world to be your lover. Come to my bed tonight, and I\u0027ll take you to Aeson myself. I\u0027ll fight by your side.\"\\n\\n I stared up at him, half tempted. I needed the help. And he wasn\u0027t too hard on the eyes. But I couldn\u0027t do it, no matter how reasonable he\u0027d seemed tonight. I had gone to Kiyo unwittingly. I couldn\u0027t have sex with another of the gentry, knowing exactly what he was. That instinct wouldn\u0027t budge.\\n\\n \"No. You have plenty of women out there,\" I said lightly. \"You don\u0027t need me.\"\\n\\n \"None of them will conceive like you. Your body promises many children.\"\\n\\n \"Not likely. I\u0027m on the pill.\"\\n\\n \"The what?\"\\n\\n I explained it to him, and while he didn\u0027t back away from me, his eyes looked like he wanted to. He sighed. \"I don\u0027t understand humans. You\u0027re gifted with fecundity, yet you stifle it.\"\\n\\n \"The world\u0027s overpopulated. And I\u0027m not ready for a baby.\"\\n\\n \"I don\u0027t understand humans,\" he repeated.\\n\\n \"And here I thought we\u0027d made such progress. I guess you can let go of me now.\"\\n\\n \"My offer still stands.\"\\n\\n I felt my eyebrows rise. \"Even with no chance of pregnancy?\"\\n\\n \"Don\u0027t discount your many charms. I\u0027d still sleep with you for other reasons.\"\\n\\n \"Like what? I mean, aside from the fact you\u0027d probably sleep with anything female.\"\\n\\n He looked down at me and then back up to my face, giving me the feeling I wasn\u0027t covering my breasts very well. \"I won\u0027t bother with the obvious things,\" he said. \"Honestly the main reason...well, in one night, I think I might have convinced you that not all gentry are monsters. Might. You still have a long way to go. But you\u0027ve already been intimate with one - or something else from this world - and you can\u0027t stop thinking about it. And not because you hated it. You\u0027ll mix that with what you\u0027ve seen tonight, and then you really won\u0027t know what to think.\\n\\n \"I want to make love to you while that indecision still torments you, while you\u0027re still not sure if I\u0027m a god or a monster or simply a human like you. I want to be with you in that ultimate moment of vulnerability, when your desire wars with your instincts and every touch of my body triggers both fear and pleasure in you.\"\\n\\n \"Fear? Are you threatening to rape me like every other gentry lately?\"\\n\\n \"No. I told you, I don\u0027t take women by force. But it doesn\u0027t matter. You\u0027ll come to me by choice.\"\\n\\n \"Not likely.\"\\n\\n \"Oh, very likely. Your own nature is conflicted, Eugenie. You\u0027re attracted to things you know you shouldn\u0027t be, even if you don\u0027t realize it consciously. You like playing with danger - it arouses you. That\u0027s why you fight the creatures of this world so aggressively. That\u0027s why you\u0027ve come for this girl - despite how foolhardy you know it is. And that\u0027s why you\u0027ll return to me. You won\u0027t be able to help yourself. You want to walk that line, put yourself at risk, see how far you can let yourself go. You protect yourself so fiercely from the things you fear that the thought of letting down your defenses and submitting excites you. Now, you won\u0027t let someone you hate - like Rurik - touch you, but me? You don\u0027t hate me. Not quite. I\u0027m the perfect mix. The perfect way - the safe way - to give in to what you want.\"\\n\\n \"You\u0027re crazy.\" I broke away, pushing with my hands, not caring if he saw my chest or not. \"And you get off on some pretty crazy shit.\"\\n\\n \"No crazier than your own desires.\"\\n\\n \"You\u0027re wrong. Besides, if I were going to fuck one of you, it wouldn\u0027t be one who harbors plans to take over my world.\"\\n\\n He shrugged, watching me put my clothes back on. \"If you say so. Do you still want my earlier offer of help?\"\\n\\n I hesitated. His little sexual tirade had unnerved me - only I couldn\u0027t exactly articulate why. I still needed his help, regardless of my mixed feelings about him. That was becoming increasingly clear.\\n\\n \"Yeah, I\u0027ll still take your servant.\"\\n\\n \"Then let\u0027s introduce you.\" \\n\\n","sourceLink":"https://allnovel.net/storm-born-dark-swan-1/page-9.html","bookId":2038,"book":{"id":2038,"title":"Storm Born (Dark Swan #1)","description":"Storyline: Dark Swan Series Book 1: Storm Born \\n Storm Born is a supernatural, romance and fantasy novel written by American author Richelle Mead. It is the first in the Dark Swan series, followed by Thorn Queen and Iron Crowned. The fourth in the series Shadow Heir is set for publication January 2012. The series follows the main character Eugenie Markham, a \"shaman-for-hire\" and her encounters in the \"Otherworld\", a parallel world occupied by the \"shining ones\" and her adjustment to a prophecy stating her first-born son would be a powerful conqueror of both worlds.\\n","cover":"https://allnovel.net/images/storm-born-dark-swan-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/storm-born-dark-swan-1.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:32:34 PM"}}
