{"id":27020,"no":13,"title":"Chapter V","content":"Dick was pale, but the Marquis was livid. So they appeared to Natividad; as to Uncle Francis, he had not his glasses on, and noticed nothing disquieting in their appearance. “Those scoundrels have both my children now,” groaned Don Christobal in answer to Natividad’s eager questions, and told what had happened. Badly mounted for mountain roads, the Marquis had found great difficulty in following. Several times he had been on the point of abandoning his horse, but, thinking it might be valuable later on, had kept to it. Once or twice he had been obliged to dismount and drag the unwilling beast behind him. At dawn, he reached the Indians’ camp, which he searched in vain for some personal sign of his daughter. She was evidently too well guarded. Finally he found the llama’s body, but being convinced that Dick was with little Christobal, had not worried overmuch. Then, a little further on, he found Dick, but alone. Dick, powerless to interfere, had seen little Christobal carried off by the same Indians who already held Maria-Teresa. When they started on their wild ride, and as soon as the road became steeper, the llama had rapidly outpaced Dick’s horse. Little Christobal, riding it hard, would not stop, and soon vanished ahead. Two hours later, Dick had lost his horse in a ravine, throwing himself from the saddle only just in time, and narrowly saving his own life by clinging to a projecting rock. He continued his pursuit on foot, and finally came in sight of the boy, just as the llama, exhausted, burst a blood-vessel and fell. He had called to little Christobal, but the boy, unheeding, had run on, crying, “Maria-Teresa! Maria-Teresa!” They were right on the Indians then, and Dick could see them far above him on the zig-zagging mountain-path. They had checked their horses, waiting for the boy to catch up to them. Then one of the Red Ponchos bent down, lifted him up to his saddle-bow, and hurried on with his new captive. Dick was too far away to open fire, and the Indians had at once spurred on, soon leaving him far behind. The Marquis had come up a short time after. “You must not despair, Don Christobal,” urged Natividad. “Your news is not all bad. They are only just ahead, and cannot escape us. They must pass through Huancavelica, and there we have troops to help us.” Natividad ordered one of the soldiers to dismount and give his mule to Dick. The man was indignant, and continued protesting in a weird jargon as he trotted afoot behind the cavalcade. In this manner they reached a point where the road forked, one branch going on up into the hills, the other stretching down toward the coast. They had all turned up the former when the dismounted soldier turned—he would go no further, but would descend to the coast; and once there he would report to the powers the manner in which he had been treated by a mere civilian. Natividad wished him an ironical good-by, and he started, but only to reappear a moment later, waving a soft felt hat in his hand. “That belongs to Christobal!” exclaimed the Marquis. They turned their mounts, grateful for the chance-found sign which had saved them from a grievous mistake. Natividad alone hesitated, wondering whether this was not an Indian ruse. They advanced slowly therefore, until the mud and sand on the banks of a torrent just below showed beyond doubt that a large number of mounted men had passed that way and restored Natividad’s serene belief in the ultimate success of their search. “So they’re doubling back to the costa. They must have been warned that the passes were guarded... all they have gained by the detour is avoiding Chorillos.... Perhaps they are making for Canete.... Well, they must stop somewhere, and then we have them!” After an hour’s rest, they hurried on again at top speed, one of the soldiers giving his dismounted comrade a lift behind. “Did you, then, ever think that we might not catch them?” asked Uncle Francis of Natividad, with an enigmatical smile. “Why not, se?or?... Between you and me, it is about time we did catch them.... I for one shall not feel happy if se?orita de la Torre and the boy are still in their hands on the last day of the Interaymi.” “Do you mean that the boy is in danger?” “Speak lower, se?or, speak lower.... Nothing is too young, too beautiful or too innocent for the Sun. Do you understand?” “More or less. More or less.” “You people do not know what horrors they are capable of.... They still have their priests.... You might blink at facts if it were only the ordinary Red Ponchos, but there are also those three monsters.... You always find them together in the old burial-grounds.... When one dies, the other two are put to death.... Or when a king died, they sacrificed themselves on his tomb.... They still exist, those monsters, those high-priests of the sacred slaughters.... They exist, se?or.” “Do they?” “You, se?or, are a savant, and know about the Temple of Death. But do you know how many dead were found buried with the mummy of Huayna Capac? Four thousand, se?or! Four thousand human lives sacrificed to honor the dead—some by suicide, others strangled, knifed or suffocated.... And the House of the Serpent.... But I prefer not to tell you what happened there.” “Tell me some other day.... You make an admirable guide. When we return, I will tell the supremo gobierno how grateful I am to them for having made the most erudite of police officers my cicerone.” “I beg your pardon, se?or?” Natividad, completely taken aback, could only stare at his interlocutor. “Nothing, nothing! I am only joking!” Scandalized at such levity, Natividad turned away with an indignant snort, while Uncle Francis chuckled. That worthy gentleman had now quite made up his mind that there was a plot afoot against him, and sternly refused to be “taken in.” The joke was rather tiring physically, but he would not cry for mercy. As to all these hair-raising stories, he would take them for what they were worth. Let them play their pranks till they tired of them. The more he thought of it, the more he became convinced of the truth of his deductions. His antiquarian’s eye rested lovingly on the traces of that long-dead Inca civilization which they met. Here, aqueducts that would have made the Romans wonder; there, remains of the great road which ran from end to end of South America. They were all dead, those Incas. Yet these people wished to make him believe that those vanished warriors and priests had carried off a boy and girl of to-day to offer them as a sacrifice to equally-forgotten gods! They had now left the arid ranges and dusty wind behind them, and reached a little village nestling in green fields at the foot of the mountain. A babbling stream, tumbling down from the Cordilleras, had transformed this corner into an oasis of verdure, in which Uncle Francis would willingly have passed a few hours. But now that they were in flat country again, Dick, the Marquis and Natividad increased the pace feverishly. Uncle Francis, still determined not to show that he had fathomed their plot, was careful not to protest. Once or twice, they stopped to ask questions, but it was difficult to obtain information. Hamlets were rare, and the Interaymi festivals had drawn away nearly the whole population. The few Indians they met received their questions with evident suspicion, and even hostility. Nor would money loosen their tongues. Fortunately, there were half-breeds more ready to talk, and they learned that Huascar and his companions were riding hard. Nobody had seen Red Ponchos; presumably the priests had concealed the ceremonial raiment imposed by their ritual for the reception of the Bride of the Sun. They were traveling so fast that nobody had had time to notice whether they had a captive boy or young woman with them. At the questions on this score all their informants began to grow uneasy, and turned away with evasive sentences. Huascar and his men had about two hours’ start, but it soon became evident that they were gating ground steadily. Natividad could not fathom the meaning of the Indians sudden turn toward the sea, this riding into a town where, normally, everything must be against them if the alarm was given. They reached Canete at nightfall, Dick still leading. There was a big fête on, with torchlight processions and the deafening noise of fireworks set off by delirious roisterers. Half the native population was under the influence of drink, and Natividad, trained to understand the populace, at once saw that the town was in a state of dangerous effervescence. Of all the towns in Peru, Canete is perhaps the one which shows most markedly that strange admixture of the new and old. Factory chimneys tower to the sky side by side with Inca aqueducts which to this day bring the water of the Rio Canete to the surrounding plantations. Just above the town are still the remains of the huge native fortress demolished some two hundred years ago by the then viceroy of Ma?delova when he needed materials for the defenses of Callao. Natividad’s first visit was to the corregidor, who told him that the town was celebrating Garcia’s victories. It was now certain that the rebels had captured Cuzco, and routed the Federal forces. Natividad then told him of the plight of the Marquis de la Torre’s children. The Mayor was skeptical, and showed it. Indians committing such a crime, he said, would never have dared pass through a town. “They could not stop in the Sierra,” said Natividad, “and had to make for somewhere. Perhaps they intend taking boat, and reaching Are-quipa by sea. They could get up into the Cuzco that way.” “That is more than possible,” replied the corregidor, anxious to rid himself of the troublesome visitor. “A troop of strange Indians has, in fact, passed through the town. They bought provisions, and then hurried on to Pisco. They might have a boat ready there.... Personally, I can do nothing for you. I haven’t a single soldier or policeman to dispose of. They have all gone to fight Garcia.” At this moment, an extraordinary procession passed under the corregidor’s windows. A dancing, singing procession, at the head of which Natividad recognized his four troopers. He opened the window and shouted menaces, but they passed unheeding. In a sad mood Natividad rejoined his companions. Without any explanation, he told them they must follow to Pisco, and they started again. Natividad, in a brown study meanwhile, would answer no questions. Don Christobal, hearing that the Indians were making for Pisco, grew hopeful. He was known in the town, having a branch business there, with big guano dép?ts, stores in the harbor, and a considerable coolie station on the Chincha Islands, which are just off the town. There he could speak with authority, and make the corregidor listen. They reached Pisco dog-tired, on mounts that could hardly stand. Uncle Francis alone displayed a calm and unconcern which would haye convinced the others he was mad, had they had time to notice him. The news of Garcia’s victory had just reached Pisco, and the mob was even more delirious than that of Canete. The Marquis, taking the leadership, led the way to his dép?t and stores, only to find them completely deserted. There was not a single employee there to answer his questions. “To the corregidor’s, then,” he ordered. The four travelers had entered the main and only street of the town, and were riding toward the sandy central square when a thundering feu de joie made them pull up. The Indians were burning the sacred maize-leaf in honor of Garcia, to the grave danger of the little blue-and-white houses around. The inhabitants of these, well-to-do half-breeds, had locked themselves in, or taken to flight. The madness of alcohol and the madness of fire crackers had taken firm hold of all that was visible of the population. The mob had pillaged a pisco distillery, and was enjoying itself thoroughly with that virulent spirit, which is made from a kind of Malaga grape, and takes its name from the town. Natividad, casting round for a guide, found a half-breed sadly huddled under a doorway. He doubtless was one of those who had something to lose by the rioting; a house to be burned, or a cellar to be plundered. “Follow me,” he said, when asked where the corregidor could be found. He led them along a plank pavement which was just beginning to burn, until they reached the corner of the arena, opposite the church. Four skinny palms adorned the center of the square, and at the foot of one of these a mob was dancing round a fire. Above, something was hanging from a branch. The half-breed pointed to that thing. “There is the corregidor,” he said. Natividad, Dick and the Marquis stopped short, mute with horror. The half-breed whispered a few rapid words to Natividad, who turned to run. “Come on! Come on!” he almost screamed. “Why this hurry?” demanded Uncle Francis, phlegmatically. “Why? Why?... Because they are going to eat him!” “Not really?” drawled the scientist with mediocre interest. “Right away?” But Natividad did not notice his tone. He was really running away, for he had not forgotten a scene in Lima, when the Guttierg brothers were torn from the presidency they had usurped by the same mob which had placed them there. Massacred, then hanged over the cathedral gates, they were finally roasted and devoured by the populace. So fast did Natividad flee, that Dick and the Marquis could hardly keep up with him. Uncle Francis, bringing up the rear, was muttering to himself: “Damn nonsense, sir, damn nonsense. They’re not going to frighten me.”","sourceLink":"http://novel.tingroom.com/jingdian/1721/50561.html","bookId":1134,"book":{"id":1134,"title":"The Bride of the Sun","description":"简介： 1915. Written by the author of Phantom of the Opera, this tale takes us to Peru where Dick Montgomery hopes to marry his fiance, Maria-Teresa de la Torre, the daughter of a Spanish marquis. Because of their disrespectful manner, Maria-Teresa discharg...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1721","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
