{"id":64314,"no":17,"title":"Page 17","content":"“Where is she?” “On the way to Essex, my lord.” Marcus froze. Ravensend. Seat of her late godfather, the Duke of Ravensend. Elizabeth was running. Damn her. He grabbed his packed valise, and turned to Paul who stood in the doorway of the study. “I will be in Essex.” “Is everything all right?” Paul asked. “It will be shortly.” Within moments, Marcus was on the road. The wheels of the Westfield travel coach crunched through the gravel on the final approach to Ravensend Manor before reaching the cobblestones that lined the circular driveway. The moon was high, its soft glow lighting the large manse and the small cottage beyond. Marcus stepped down wearily and ordered his men to the livery. Turning away from the main house, he took rapid strides toward the cliff edge where the guesthouse and Elizabeth waited. He’d make his presence known to the duke in the morning. The small residence was dark when he entered through the kitchen. He closed the door quietly, shutting out the rhythmic roar of the waves that battered the coast just a few yards away. Making his way through the house in darkness, Marcus checked every bedroom until he found Elizabeth. Leaving his valise on the floor by the door, Marcus undressed silently and crawled into the bed next to her. She stirred at the feel of his cold skin beside hers. “Marcus,” she murmured, still fast asleep. She spooned into his chest, unconsciously sharing her warmth. Despite his anger and frustration, he snuggled against her. Her trust while sleeping was telling. She had become accustomed to spending the nights next to him during the short duration of their affair. He was still furious with her for running away, but his relief in finding her well and out of danger was foremost on his mind. Never again would he go through this torment. There could be no doubt that she was his. Not in Eldridge’s mind, or hers. Exhausted by worry, he buried his face in the sweetly scented curve of her shoulder and fell asleep. Elizabeth woke and burrowed deeper into the warmth of the bed. Slowly rising to consciousness, she stretched out fully, her legs brushing along Marcus’s hair-dusted calf. With a sudden flare of awareness, she sat upright and shot a startled glance at the pillow beside her. Marcus slept peacefully on his stomach, the sheet and counterpane straddling his hips, leaving his muscular back exposed. She jumped out of the bed as if it were on fire. His eyes opened sleepily, his lips curving in a languid smile, and then he fell back asleep, obviously finding her angered surprise to be of no danger. Grabbing her clothes, Elizabeth retreated to the next room to dress, wondering how he’d found her so quickly. She’d deliberately avoided any of her own family holdings so that it would be difficult, if not impossible to locate her. But Marcus had found her before even a day had passed. Furious and flustered at finding him in her bed, Elizabeth left the house and made her way to the roped path on the cliffs that led to the beach below. She picked her way carefully down the somewhat steep and rocky decline. The cliff rose some distance above the shore and Elizabeth ignored the stunning view in favor of studying the ground at her feet. She didn’t mind the concentration it took. Instead she relished the temporary distraction from her confusion. Finally reaching the beach, she dropped onto the damp sand and hugged her knees to her chest. She prayed for the sound of the waves lapping on the beach to soothe her. She vividly recalled the first moment she’d laid eyes on Marcus Ashford, then the Viscount Sefton. She remembered how her breath had caught in her throat and how hot her skin had suddenly become, how her breathing and heart rate had quickened until she thought she might swoon. Those had not been singular reactions. She had felt them many times since then and even just that morning when he had smiled at her, all sleep-tousled masculine beauty. She couldn’t live like that, couldn’t see how anyone could live consumed by a lust that seemed insatiable. Unschooled as she was, she hadn’t known a body could crave the touch of another the way it did food or air. Now, finally, she understood an inkling of the hunger her father must feel every day. Without her mother he would always be ravenous, always searching for something that could appease the emptiness left by her loss. Tilting her head, Elizabeth closed her eyes and rested her cheek against her knees. Why couldn’t Marcus simply stay away? Marcus paused on the small porch and took in his surroundings. The bite of the salty morning air was sharp. He wondered if Elizabeth had collected a wrap before venturing out. To say she’d looked horrified to discover him in her bed would be an understatement. Knowing her as he did, he suspected she’d run out without forethought. Where the devil had she gone? “She’s gone down to the beach, Westfield,” came a dry tone to his left. Marcus turned his head to greet the Duke of Ravensend. “Your Grace.” He dipped his head in a bow. “It was my intent to present myself this morn and explain my presence. I trust you don’t find my stay an imposition.” The duke led a black stallion by the reins and came to a halt directly before him. They were of an age, His Grace being the youngest after four older sisters, but Marcus was nearly a head taller. “Of course not. It’s been too long since we last exchanged words. Walk with me.” Unable to refuse, Marcus reluctantly left the shadow of the guesthouse. “Watch the horse,” the duke cautioned. “He’s a biter.” Heeding the warning, Marcus took the opposite side. “How fares Lady Ravensend?” he asked as they fell into step. He cast a longing glace over his shoulder at the roped path that led to the beach. “Better than you. I thought you wiser than to chase more abuse. But I concede the appeal. Lady Hawthorne remains one of the most beautiful women I’ve ever had the fortune to cross paths with. I fancied her myself. As did most peers.” Nodding grimly, Marcus kicked a pebble out of his path. “I wonder who she’ll take up with once she’s finished with you? Hodgeham, perhaps? Or Stanton again? A young one, I’m certain. She’s as wild as this brute.” The duke gestured to his horse. Marcus grit his teeth. “Stanton is a friend in the chastest sense of the word and Hodgeham …” He snorted in disgust. “Hodgeham couldn’t manage her.” “And you can?” “Better than any other man.” “You should marry her then. Or perhaps that’s your intent. Either you or some other poor chap. You leapt into that cage once before.” “She has no wish to marry again.” “She will,” Ravensend said with a confident nod. “She has no children. When she’s of the mind, she’ll pick someone.” Marcus came to an abrupt stop. Eldridge, William, and now Ravensend. He’d be damned if another individual meddled in his affairs. “Pardon me, Your Grace.” He spun on the heel of his boot and made rapid strides toward the roped walk. He would put a stop to all their intrusions once and for all. Elizabeth prowled the coastline restlessly, picking up small pebbles and stones along the way. She tossed them over the water, trying to skip them and failing miserably. William had once spent an entire afternoon attempting to teach her how to skip rocks. Although she’d never acquired the skill, the repetitive swing of her arm was calming. The music of the English coastline—the lapping waves and the cries of seagulls—brought her a measure of peace from her fevered thoughts. “A calm surface is required, love,” came the deeply luxurious voice behind her. With shoulders squared, she turned to face her tormenter. Dressed casually in a worn sweater and wool breeches, Marcus had never looked more virile, the roughness of his edges unblunted by any social veneer. His hair was tied back at his nape, but the salty breeze tugged the silken strands free and blew them softly across his handsome face. Just looking at him made her feel like crying. “You shouldn’t have come,” she told him. “I had no choice.” “Yes, you did. If you had any sense you would allow this …” She gestured wildly. “… thing between us to die out gracefully, instead of dragging it out to its inevitable bad end.” “Damn you.” A muscle in his jaw ticked as he took a step toward her. “Damn you to hell for throwing away what exists between us as if it does not signify. Risking your life—” Her hands clenched into fists at his wounded tone. “I took the outriders with me.” “The only bit of sense you’ve shown since I met you.” “You are a bully! You have been from the first. Seducing, scheming, and manipulating me however you wish. Go back to London, Lord Westfield, and find another woman’s life to ruin.” Turning from him, Elizabeth stalked toward the cliffs. Marcus caught her arm as she attempted to pass, pulling her to a stop. She struggled with a frightened cry, alarmed by the possessiveness of his gaze. “I was content before you came along. My life was simple and orderly. I want that back. I don’t want you.” He thrust her away with such force she stumbled. “Regardless, you have me.” She hurried toward the rope-lined path. “As you wish. I shall leave.” “Craven,” he drawled after her. Eyes wide, Elizabeth turned to face him again. Like the time he’d asked her to dance at the Morelands’, his emerald eyes sparkled with challenge. This time though, she would not be goaded into acting foolishly. “Perhaps,” she admitted, lifting her chin. “You frighten me. Your determination, your recklessness, your passion. Everything about you scares the wits from me. It’s not how I wish to live my life.” His chest expanded on a deep breath. Behind him the waves continued to beat upon the shore, the relentless driving rhythm no longer soothing. It urged her to flee. Run. Run far away. She took a backward step. “Give me a fortnight,” he said quickly. “You and I alone, here in the guesthouse. Live with me, as my partner.” “Why?” she asked, startled. His arms crossed his chest. “I intend to wed you.” “What?” Suddenly dizzy, Elizabeth backed away with hand to throat. Tripping on her skirts, she fell to her knees. “You’ve gone mad,” she cried. His mouth curved in a bitter smile. “It seems so, yes.” Her breath coming in unsteady pants, Elizabeth leaned forward, her fingers sinking into the damp sand. She didn’t look at him. She couldn’t. “Whatever made you conceive of such a ridiculous notion? You’ve no wish to marry, nor do I.” “Not true. I must wed. And you and I suit.” She swallowed hard, her stomach roiling. “Physically, perhaps. But lust fades. In no time at all you’ll grow weary of a wife and seek your pleasures elsewhere.” “If you are equally bored, you won’t be disturbed.” Furious, she grabbed handfuls of sand and threw them at his chest. “Go to hell!” He laughed, shaking out his sweater with maddening nonchalance. “Jealousy is a possessive emotion, love. You’ll have to wed me if you want the right to feel that way.” Elizabeth searched his face, looking for deceit and found nothing but cool impassivity. His face, so breathtaking, revealed nothing of his thoughts. The determined line of his jaw, however, was achingly familiar. “I don’t wish to marry again.” “Consider the benefits.” Marcus held out his hand and ticked off with his fingers. “Elevated rank. Great wealth. I will afford you the same independence you enjoyed with Hawthorne. And you’ll have me in your bed, a prospect you should find vastly appealing.” “Conceited rogue. Allow us to discuss the negatives as well. You thrive on danger. You are eager to die. And you’re too bloody damn arrogant.” Grinning, he held out his hand and helped her to her feet. “I ask for a fortnight to change your mind. If I cannot, I’ll leave you in peace and never bother you again. I’ll resign from this mission and another agent will protect you.” She shook her head. “The situation here is far different than our life would be under normal circumstances. There is little danger for you around here.” “True,” he admitted. “But perhaps I can make the rest of your life so pleasant that my work with Eldridge will be of less consequence.” “Impossible!” “A fortnight,” he urged. “It’s all I ask. You owe me that much, at least.” “No.” The gleam in his eye could not be mistaken. “I know what you want.” Marcus met her gaze squarely. “I won’t touch you. I swear it.” “You lie.” His brow rose. “You doubt I can restrain myself? I shared a bed with you last night and didn’t make love to you. I assure you, I have control over my baser needs.” Elizabeth chewed her lower lip, weighing her options. To be free of him forever … “You will find another room?” she asked. “Yes.” “You promise not to make any advances?” “I promise.” His mouth curved wickedly. “When you want me, you’ll have to ask me.” She bristled at his arrogance. “What do you hope to accomplish by this?” He came toward her and when he spoke, his voice was tender. “We already know you enjoy me in your bed. I intend to prove you will enjoy having me in the rest of your life as well. I’m not always so tiresome. In fact, some would say I’m quite pleasant.” “Why me?” she asked plaintively, her hand sheltering her racing heart. “Why marriage?” Marcus shrugged. “‘The time is right’ would be the simplest answer. I enjoy your company, despite how often you are obstinate and disagreeable.”","sourceLink":"https://allnovel.net/ask-for-it-georgian-1/page-17.html","bookId":2658,"book":{"id":2658,"title":"Ask For It (Georgian #1)","description":"Storyline: Ask For It (Georgian #1) Fearless Surrender Nothing incites Marcus more than the primal hunger roused by his former fiancée, Elizabeth. It\u0027s been years since she jilted him for another man, but that only means there\u0027s a lot to catch up on, a lot to make up for, and that he\u0027s going to enjoy every sweet moment... The same drive and passion that sent her into another man\u0027s arms is what brings Elizabeth back to Marcus. Her attraction to him is the one thing she fears, but she\u0027s run out of options. Resisting is impossible. But does she have the courage to surrender everything?","cover":"https://allnovel.net/images/ask-for-it-georgian-1.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/ask-for-it-georgian-1.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:53:43 AM"}}
