{"id":64315,"no":18,"title":"Page 18","content":"When she shook her head, he frowned. “You said yes once before.” “That was before I knew about the agency.” His tone deepened, became cajoling. “Don’t you wish to manage your own household again? Wouldn’t you like to have children? Build a family? Surely you don’t wish to be alone forever.” Startled, she stared at him with wide eyes. Marcus Ashford discussing children? The longing that washed over her so unexpectedly scared her to death. “You want an heir.” She looked away to hide her reaction. “I want you. The heir and other progeny would be added delights.” Her eyes flew to meet his again. Flustered by his nearness and his determination, Elizabeth turned toward the path in the cliffs. “Do we have an agreement?” he called after her, remaining behind. “Yes,” she threw over her shoulder, her voice carried by the wind. “A fortnight, then you are out of my life.” His satisfaction was a palpable thing and she ran from it. Elizabeth reached the top of the cliff and fell to her knees. Marriage. The word choked her throat and made her dizzy, leaving her panting for air like a swimmer too long under water. Marcus’s will was a force to be reckoned with. What the devil was she to do now that he’d set his mind on marriage again? Lifting her head, she looked toward the livery with aching longing. It would be such a relief to go, to leave the turmoil behind. But she discarded the idea. Marcus would come for her, he would track her down as long as she still wanted him. And no matter how hard she tried, she was unable to hide the depth and breadth of her attraction. Therefore, the only way to be rid of his attentions was to accept the bargain he offered. Marcus would have to end his pursuit of his own accord. There was no other way the obstinate man would quit. Wearily resolved, Elizabeth stood and made her way toward the guesthouse. She would have to move carefully. He knew her too well. The slightest intimation that she was uneasy and he would pounce, pressing his advantage with his customary ruthlessness. She would have to be relaxed and indifferent. It was the only solution. Satisfied she had a reasonable plan of action, she quickened her pace. Meanwhile, Marcus lingered on the beach and wondered at his sanity. God help him, he wanted her still. Wanted her more than before. He’d once hoped to satisfy his need and finally be done with her. Now he prayed his aching need would never end, the pleasure was too great to forfeit. If only he’d known the trap that awaited him in her arms. But there had been no way to know. With all his experience, he still could never have imagined the searing rapture of Elizabeth’s bed or the ever-growing need he had to tame her and pin her beneath him, as lost to his desire as he was. Picking up a rock from the pile Elizabeth left behind, he tossed it into the water. He’d created quite a challenge for himself. Her one vulnerability had always been their desire for each other. Naked and sated, Elizabeth was soft and open to discussion. Now he was denied seduction to achieve his ends. He would have to woo her like a gentleman, something he’d never managed even the first time. But should he succeed, he would thwart Eldridge’s plan to replace him and prove to one and all that Elizabeth was his. There would be no doubt. Marriage. He shuddered. It had finally happened. The woman had driven him insane. “I want to see where you’re taking me.” “No,” Marcus whispered in her ear, steadying her with his hands on her shoulders. “It would not be a surprise if you knew.” “I’m not fond of surprises,” Elizabeth complained. “Well, you will have to become accustomed, sweet, because I am full of them.” She snorted and he laughed, his heart as light as the afternoon breeze. “Ah, love. Much as you wish it weren’t so, you adore me.” Her lush mouth curved in a smile, the ends of her lips touching the underside of the blindfold that blocked her vision. “Your conceit knows no bounds.” She shrieked as he hefted her into the air, and then sank to his knees. He set her down on the blanket he’d spread earlier and removed her blindfold, watching expectantly as she blinked against the sudden bright light. With the help of the duke’s staff, he’d arranged a picnic, selecting a field of wild grass just over the rise from the main manor. She’d been unnaturally tense since their talk on the beach that morning and he knew something unexpected was warranted if he wished to make headway. “This is lovely,” she exclaimed, her eyes wide and filled with pleasure. Sans the assistance of an abigail and unwilling to let him help her dress, Elizabeth was forced to attire herself in a startlingly simple gown. With her hair uncoiffed and tied back from her face, there was nothing to compete with the singular beauty of her features. Basking in the glow of her surprise, Marcus silently agreed with her sentiment. Elizabeth was breathtaking, her fine features lovingly shielded by the wide brim of her straw hat. Smiling, he reached into the basket and withdrew a bottle of wine. He filled a glass and handed it to her, the touch of her fingers against his sending a frisson of awareness up his spine. “I’m pleased you approve,” he murmured. “It’s only my second attempt at formal courtship.” His gaze lifted to hers. “I’m a bit nervous, truth be told.” “You?” She arched a brow. “Yes, love.” Marcus lay on his back and stared up at the summer sky. “It’s distressing to think I may be refused. I was more confident the first time around.” Elizabeth laughed, a soft joyful sound that brought a smile to his face. “You shall find another, far more suitable candidate. A young woman who will worship your remarkable handsomeness and charm, and be far more biddable.” “I would never marry a woman such as you describe. I much prefer passionate, uneven-tempered seductresses like yourself.” “I am not a seductress!” she protested, and he laughed with delight. “You certainly were the other evening. The way you arched your brow and bit your lip before fucking me senseless. I vow, I’ve never seen anything as seductive. And the way you look when you—” “Tell me about your family,” she interrupted, her cheeks flushing. “How are Paul and Robert?” He glanced sidelong at her, relishing the view of her against the natural backdrop, freed from the constraints of society. The tall grass around them flowed like waves of water in the gentle breeze, filling the air with the scent of warm earth and salty sea. “They are well. They inquire about you, as does my mother.” “Do they? I am surprised, but pleased they don’t resent me overmuch. They should venture out more. It has been almost a fortnight since they arrived, and yet they’ve not attended one social function.” “Robert still has no interest whatsoever in social pursuits. Paul prefers his club. He spends most of his time there. And my mother has to order new gowns every Season, and refuses to be seen until they are finished.” His grin was fond. “Heaven forbid that she be seen in a gown from last year.” She smiled. “Is Robert still the spitting image of you?” “So I’ve been told.” “You don’t think so?” “No. The resemblance is there, but no more than one would expect. And Paul remains as different from me as you are from your brother.” He reached for her hand and linked his fingers with hers, needing the physical connection. She tugged, but he held fast. “You will see for yourself soon enough.” She wrinkled her nose. “You seem quite confident in your ability to win my hand.” “I cannot think otherwise. Now tell me you wrote Barclay about your location.” “Yes, of course. He would be frantic, and unbearable company for Margaret if I had not.” They lapsed into silence and Marcus enjoyed their rare accord, content to experience the daylight hours with her. “What are you contemplating so seriously?” he asked after a time. “My mother.” She sighed. “William says she loved the coast. We used to visit here often and play in the sand. He tells stories of her lifting the hem of her skirts and dancing across the beach with our father.” “You don’t remember?” Her fingers tightened fractionally on his and lifting her glass, she took a large swallow of wine. Her gaze moved to the distant cliffs and her voice, when it came, was soft and faraway. “Sometimes I think I recall her scent or the tone of her voice, but I cannot be certain.” “I’m sorry,” he soothed, rubbing his thumb across the back of her hand. She sighed. “Perhaps it’s for the best that she’s only a fleeting impression. William remembers her, and it saddens him. It’s why he’s so protective, I think. Her illness progressed so quickly, it took us all by surprise. My father especially.” There was an unusual edge to Elizabeth’s voice when she referred to her father. Marcus rolled to his side and rested his head in his hand, maintaining his casual pose while studying her intently. “Your father never remarried.” She returned his gaze, a small frown marring the space between her brows. “He loved my mother too much to ever take another wife. He still loves her.” Marcus considered the Earl of Langston’s libidinous reputation. This in turn led him to consider his own dislike of romantic entanglements. “Tell me about your father,” he urged, curious. “As often as I’ve spoken with him, I still know precious little about him.” “You are probably better acquainted with him than I. My resemblance to my mother is painful, so he avoids me. I often think he would have been best served by never falling in love. Lord knows the sentiment brought him precious little happiness and a lifetime of regret.” There was a sadness in her eyes and a firmness to her lips that betrayed her distress. He wanted to pull her into his arms and comfort her, so he did just that, rising to a seated position and pulling her against his chest. Tossing aside the obtrusive hat, he pressed a kiss to her neck and breathed in her scent. Together, they faced the ocean. “I worried about my mother when my father passed on,” Marcus murmured, his hands caressing the length of her arms. “I was not certain she could live without him. Like your parents, mine also had a love match. But she is a strong woman and she recovered. While she most likely won’t marry again, my mother has found contentment without a spouse.” “So have I,” Elizabeth said softly. Reminders of how she didn’t need him would not benefit his cause. He had to win her before she learned of Eldridge’s decision. Reluctantly pulling away, Marcus removed her glass from stiff fingers and topped it up. “Are you hungry?” Elizabeth nodded, obviously relieved. Then she gave him a dazzling smile that made his breath catch and his blood heat. At that moment, he knew. She was his, and he would protect her. Whatever the cost. A cold tingle crawled up his spine as he remembered the sight of her ransacked room. What would have happened if she’d been home? Clenching his jaw, he vowed to never find out. Marriage seemed a small price to pay to keep her safe. Chapter 12 “The servants from the main house brought supper.” Elizabeth looked up from Hawthorne’s journal to see Marcus lounging in the doorway. With a sigh, she snapped the book closed and pushed aside the blanket she had wrapped around her legs. Rising from the chaise, she took the arm he offered her. Once they were seated in the small formal dining room, he tucked into his veal with his usual fervor. She watched him with a soft smile. Marcus’s appetite for life amazed her. He did nothing in half measure. “I suppose the outriders told you my destination,” she said dryly. “Which is another reason we should wed,” he replied around a bite. “You are a troublesome baggage. You require a great deal of watching over.” “I am perfectly capable of taking care of myself.” He frowned, his gaze piercing beneath his drawn brows. “Your room was ransacked after your departure, Elizabeth.” “Beg your pardon?” The color drained from her face. His mouth twisted grimly. “You look as I felt when I saw it. I thought you had been kidnapped.” He lifted his knife and shook it at her. “Don’t ever scare me like that again.” Elizabeth barely registered his words. Her room. Ransacked. “Was anything missing?” she whispered. “I’m not certain.” Marcus set aside his utensils. “If anything is amiss, I’ll replace it.” Bristling at the offer, which was entirely too proprietary, Elizabeth was struck with a terrifying thought. “William? Margaret?” “Everyone is well,” he soothed, his features softening. “William must know about the journal, then?” “Your brother assumed it was your doing, that I had driven you into a rage. He knows nothing more.” Her hand to her chest, Elizabeth tried to imagine what the scene must have looked like. “All of my things sorted through.” She shuddered. “Why did you not tell me earlier?” “You were already distressed, love.” “Of course I’m distressed, it’s too dreadful.” “You’ve every right to feel violated. I thank God you weren’t home at the time. Although that’s not encouragement for you to run off whenever the urge strikes you.” “Sometimes a respite is a necessity,” she retorted, her palms damp with her unease and disquiet. “How well I know it,” he murmured, reminding her of how he’d left England after her marriage. “But I need to know where you are, every minute of every hour.” Flustered by his news and stung by guilt she snapped, “You are why I need respite!”","sourceLink":"https://allnovel.net/ask-for-it-georgian-1/page-18.html","bookId":2658,"book":{"id":2658,"title":"Ask For It (Georgian #1)","description":"Storyline: Ask For It (Georgian #1) Fearless Surrender Nothing incites Marcus more than the primal hunger roused by his former fiancée, Elizabeth. It\u0027s been years since she jilted him for another man, but that only means there\u0027s a lot to catch up on, a lot to make up for, and that he\u0027s going to enjoy every sweet moment... The same drive and passion that sent her into another man\u0027s arms is what brings Elizabeth back to Marcus. Her attraction to him is the one thing she fears, but she\u0027s run out of options. Resisting is impossible. But does she have the courage to surrender everything?","cover":"https://allnovel.net/images/ask-for-it-georgian-1.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/ask-for-it-georgian-1.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:53:43 AM"}}
