{"id":64302,"no":5,"title":"Page 5","content":"Finally he tore his mouth away with a tortured groan and buried his face in her perfumed hair. “Elizabeth.” His voice was thick and unsteady. “We must find a bed. Now.”\n She gasped out a laugh. “This is madness.”\n “It has always been madness.”\n “You must stay away.”\n “I have. Four bloody years. I’ve paid the price for my imagined sins.” He pulled back and stared down at her with eyes so hot they burned. “I’ve waited long enough to have you. I refuse to wait any longer.”\n The reminder of their past was sobering for both of them. “There is far too much between us to ever enjoy a liaison.”\n “I damn well intend to enjoy one regardless.”\n Shaking, she pulled back and, to her surprise, was released immediately. She pressed her fingers to her kiss-swollen lips. “I do not want the pain you bring. I do not want you.”\n “You lie,” he said harshly. His finger traced the edge of her bodice. “You have wanted me since the moment we met. You want me still, I can taste it.”\n Elizabeth cursed her traitorous body, still so enamored of him it refused to listen to the dictates of her mind. Hot and aching all over, she was no better than any of the other besotted women who fell so easily into his bed. She backed away, but was stopped by the cold marble railing. Reaching behind her, she wrapped her hands around the baluster, gripping it so tightly the blood left her hands.\n “If you had any care for me at all you would leave me be.”\n Flashing a smile that stopped her heart, Marcus stepped toward her. “I will show you the same care you once showed to me.” His gaze smoldered with seductive challenge. “Give in to your desire for me, sweet. I assure you, doing so will not be something you regret.”\n “How can you say that? Have you not already wounded me once? Knowing how I feel about my father, you still acted as you did. I loathe men of your ilk. It’s despicable to promise love and devotion to bed a woman only to cast her aside when you weary of the sport.”\n Marcus stopped abruptly. “It was I who was cast aside.”\n Elizabeth backed up tighter against the railing. “For good reason.”\n His lips twisted in a cynical smile. “You will receive me when I come to call, Elizabeth. You will drive out with me in the afternoons and accompany me to events such as these. I will not be turned away again.”\n The cold marble baluster froze her hands through her gloves and sent shivers up her arms. Despite the chill she felt hot, flushed. “Are you not satisfied with the numbers of women who fawn over you?”\n “No,” he replied with his habitual arrogance. “Satisfaction will come when you burn for me, when I invade your every thought and every dream. One day your infatuation will be so consuming that every breath you take apart from me will sear your lungs. You will give me whatever I desire, whenever and however I desire it.”\n “I will give you nothing!”\n “You will give me everything.” He closed the small gap between them. “You will yield all to me.”\n “Have you no shame?” Tears welled and clung to her lashes. He was implacable and the direness of her situation struck home with cruel effect. “After what you did to me, must you seduce me as well? Is my utter destruction the only thing that will appease you?”\n “Damn you.” His head dropped down to hers, his mouth brushing across her lips in a feather-light kiss. “I never thought to have you,” he breathed. “I never expected that you would ever be free of your marriage, but you are. And I will have what was promised to me long ago.”\n Releasing the baluster, Elizabeth placed her hands against his waist to ward him off. The firm ridges of his stomach beneath her palms brought a raw, sweet ache to her body. “I will fight you with everything I have. I urge you to desist.”\n “Not until I have what I want.”\n “Leave her alone, Westfield.”\n Sagging with relief at the sound of the familiar voice, Elizabeth glanced up and saw William descending the staircase.\n Marcus backed away with a vicious curse. Straightening, he shot his old friend a fulminating glare. Elizabeth exploited his distraction, taking the opportunity to slip past him. Running into the garden, she disappeared around a corner of yew hedges. He stepped forward, determined to go after her.\n “I wouldn’t,” William said with soft menace, “If I were you.”\n “Your timing is unfortunate, Barclay.” Marcus swallowed a growl of frustration, knowing his old friend would relish any opportunity to fight with him. The situation worsened as spectators, alerted by the carrying tone of angry voices and the rigid set of William’s body, lined the edge of the balcony anticipating noteworthy gossip.\n “When you desire Lady Hawthorne’s company in the future, Westfield, be aware that she is indisposed to you indefinitely.”\n A statuesque redhead pushed her way through the throng of curious onlookers and ran down the steps toward them.\n “Lord Westfield. Barclay. Please!” She clutched William’s arm. “This is not the venue for such private discourse.”\n William broke off eye contact with Marcus and glanced at his lovely wife with a grim smile. “No need to fret. All is well.” Lifting his gaze, he gestured to George Stanton who left the balcony and moved quickly to join them. “Please find Lady Hawthorne and escort her home.”\n “I would be honored.” Stanton inched his way carefully between the two angry men before picking up speed and melding into the garden shadows.\n Marcus sighed and rubbed the back of his neck. “You intercede based on a false assumption, Barclay.”\n “I will not debate the matter with you,” William countered, all trace of civility gone. “Elizabeth has refused to see you and you will respect her wishes.” He gently removed Margaret’s hand from his sleeve and stepped closer, his shoulders taut with repressed anger. “This will be your only warning. Keep your distance from my sister or I will call you out.” The crowd above erupted in a series of muted gasps.\n Marcus steadied his breathing with effort. Level-headedness had seen him through many volatile situations, but this time he made no effort to defuse the tension. He had a mission, as well as his own agenda. Both would require a great deal of time spent in Elizabeth’s company. Nothing could be allowed to stand in his way.\n Meeting William’s challenge head-on, he stepped the last few paces until they were only inches apart. His voice softened ominously. “Interfering in my association with Elizabeth would not be wise. There is much left to be resolved between us and I will not have you intruding. I would never deliberately harm her. If you doubt my word, name your second now. My position is firm and worth whatever risk you present to me.”\n “You would risk your life to proceed?”\n “Without question.”\n A weighted pause fell between them as they each measured the other carefully. Marcus made his resolve clear. He would not be deterred, threats of death or otherwise.\n In return, William’s gaze penetrated with its intensity. Over the years they had managed an icy public association. With William’s marriage a stark contrast to his own bachelor’s life, they’d rarely had the occasion to exchange words. Marcus lamented that lack. He often missed the companionship of his friend, who was a good man. But William had passed judgment too easily and Marcus would not bruise his pride by pleading a case to deaf ears.\n “Shall we return to the festivities, Lady Barclay?” William said finally, the set of his shoulders relaxing a tiny fraction.\n “I believe the night has grown chilly,” Marcus murmured.\n “Yes, my lord,” Lady Barclay agreed. “I was about to say the same.”\n Hiding his regret, Marcus nodded, and then turned on his heel and left.\n Elizabeth crossed into the foyer of Chesterfield Hall with a silent sigh. Her lips still throbbed and tasted of Marcus, a heady flavor that was dangerous to a woman’s sanity. Although her heart rate had slowed, she was left feeling as though she’d just run a great race. She was grateful when her butler removed her heavy cloak and, tugging off her gloves, she headed directly toward the stairs. There was so much to consider, too much. She hadn’t expected Marcus to be so damned determined to have his way. How she would handle a man such as he would take careful planning.\n “My lady?”\n “Yes?” She paused and turned to face the servant.\n In his hand he held a silver salver which supported a cream-colored missive. Innocuous though it appeared, Elizabeth shivered at the sight of it. The handwriting and parchment were the same as the letter demanding Hawthorne’s journal.\n She shook her head and released a deep breath. Marcus would call on her tomorrow, of that she was certain. Whatever demand the note contained could wait until then. Reading it alone held no appeal. She knew how dangerous the agency’s missions were and she didn’t take her new involvement lightly. Therefore, if Marcus was so determined to plague her, she would at least make use of him in some small way.\n Dismissing the servant with a wave, Elizabeth lifted her skirts and ascended the stairs.\n What a sad twist of fate it was that the man assigned to protect her was the very one who’d proven he was not to be trusted.\n Chapter 4\n Unlike Marcus’s own townhouse in Grosvenor Square, Chesterfield Hall was a sprawling estate located a good distance from the nearest house. Standing in the visitor’s foyer, Marcus handed over his hat and gloves to the waiting liveried footman, then followed the butler down the hall to the formal parlor.\n The location of his reception was a slight not lost on him. At one time he would have been shown upstairs and received as a near family member. Now he was not considered worthy of such a privilege.\n “The Earl of Westfield,” the servant announced.\n Entering, Marcus paused on the threshold and glanced around the room, noting with interest the portrait that graced the space above the fireplace. The late Countess of Langston stared back at him with a winsome smile and violet eyes like her daughter’s. Unlike Elizabeth’s, however, Lady Langston’s eyes held no wariness, only the soft glow of a woman content with her lot. Elizabeth had witnessed only briefly the kind of happiness his own parents had fostered over a lifetime. For a moment, regret rose like bile in his throat.\n Once he’d sworn to dedicate his life to making Elizabeth look that happy. Now he wanted only to be done with his craving and free of her curse.\n Clenching his jaw, he looked away from the painful reminder and found the curvaceous form that afflicted his waking and sleeping thoughts. As the butler shut the door with a soft click behind him, Marcus reached around his back and turned the lock.\n Elizabeth stood by the arched window that overlooked the side garden. Dressed in a simple muslin day gown and bathed in indirect sunlight, she looked as young as when they’d first met. As always, every nerve ending in his body prickled with the sharp current of awareness that arced between them. In all of his many encounters, he’d yet to meet a woman who appealed to him as deeply or as hotly as Elizabeth did.\n “Good afternoon, Lord Westfield,” she said in the low throaty voice which brought to mind tumbled silk sheets. She shot a pointed glance at his hand, which remained curved around the knob. “My brother is at home.”\n “Good for him.” He crossed the broad expanse of Aubusson rug in a few strides and lifted her bare fingertips to his lips. Her skin felt exquisite, the scent of her arousing. His tongue darted out to lick between her fingers and he watched as her pupils widened and the irises darkened. Marcus brought her hand to his heart and held it there. “Now that your mourning is over, do you intend to return to your own residence?”\n Her gaze narrowed. “That would ease matters for you, wouldn’t it?”\n “Certainly breakfast in bed and afternoon trysts would be facilitated by a more private arrangement,” he replied easily.\n Yanking her hand from his grip, Elizabeth turned her back to him. Marcus bit back his smile.\n “Considering your obvious distaste for me,” she muttered, “I cannot understand why you desire to become intimate.”\n “Physical proximity does not necessitate intimacy.”\n Her shoulders stiffened beneath the fall of her dark hair. “Ah yes,” she sneered. “You have proven that fact again and again, have you not?”\n Flicking an imaginary piece of lint from his ruffled cuffs, Marcus walked to the settee and adjusted his coat before sitting. He refused to show his irritation at the censure he heard in her tone. Guilt was something he didn’t require, he felt it often enough on his own. “I became what you once accused me of being. What would you have had me do, love? Go mad thinking of you? Longing for you?”\n He sighed dramatically, hoping to goad her into facing him. It was a simple pleasure, gazing upon her features, but after four years it was a delight he needed as much as air. “I am truly not surprised to learn that, given the choice, you would have denied me what little solace I could find, cruel-hearted creature that you are.”\n Elizabeth spun about, revealing cheeks stained bright with color. “You blame me?”\n “Who else is there to blame?” He opened his snuff box and took a small pinch. “It should have been you in my arms all these years. Instead, every time I bedded another woman I hoped she would be the one to make me forget you. But they never did. Not one.” He snapped the lid shut.\n Her nostrils flared on a swiftly indrawn breath.\n “Often I would turn down the lamps and close my eyes. I would pretend it was you beneath me, you with whom I shared sexual congress.”\n “Damn you.” Her hands clenched into tiny fists. “Why did you have to become just like my father?”\n “You would have me be a monk?”\n “Better that than a libertine!” \n","sourceLink":"https://allnovel.net/ask-for-it-georgian-1/page-5.html","bookId":2658,"book":{"id":2658,"title":"Ask For It (Georgian #1)","description":"Storyline: \n Ask For It (Georgian #1) \n Fearless Surrender \n Nothing incites Marcus more than the primal hunger roused by his former fiancée, Elizabeth. It\u0027s been years since she jilted him for another man, but that only means there\u0027s a lot to catch up on, a lot to make up for, and that he\u0027s going to enjoy every sweet moment... \n The same drive and passion that sent her into another man\u0027s arms is what brings Elizabeth back to Marcus. Her attraction to him is the one thing she fears, but she\u0027s run out of options. Resisting is impossible. But does she have the courage to surrender everything?\n \n","cover":"https://allnovel.net/images/ask-for-it-georgian-1.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/ask-for-it-georgian-1.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:53:43 AM"}}
