{"id":76841,"no":23,"title":"Page 23","content":"This was getting creepy now. Whatever Julia had been reaching for, this was not it.\n “I’m . . . sorry.” Julia tried to put herself into mentor mode. It was the only kind of training she could fall back on. Get him to talk. Put him at ease. A lot of kids . . . people . . . came from really bad homes.\n “I got a sister,” he continued. “Thirteen. Looks just like my mom. Doesn’t even remember her, though. Not even a fucking memory.”\n “I’m sure your sister . . . really loves you, Frankie.”\n He stared at his hands, corpse-pale in the moonlight. Julia could see the anger draining out of his shoulders. She thought the dangerous moment had passed.\n “She hates me,” Frankie muttered. “Get me arrested if she could. Sometimes I wish I could bring her here. Show her . . .”\n His voice trailed off.\n Julia didn’t know what he was talking about. She just wanted out.\n “Look . . .” She tried to sound upbeat, not at all afraid. “I told my friends I’d call them, you know? Would you mind—”\n “You told them you’d call.”\n “Yeah. Kind of silly, but, ah . . . we had a bet.”\n He stared at her as if there were an insect crawling over her face, something poisonous. “A bet. About me?”\n She tried to keep her mind on good things—next semester, the children she tutored, getting her own apartment and a part-time job, moving to the East Coast. All that was waiting for her, just a few miles back down the road.\n “It was just a joke,” she managed.\n “You bet your friends I wouldn’t be able to perform?”\n “No! Nothing like that.”\n He slapped her. It surprised her more than it hurt, but she saw a flash of yellow. Her mouth stung.\n “Stop it!” She used the same tone she’d used on her boyfriend whenever he got out of hand. “Take me back—right now.”\n “You don’t give orders,” he said. “You don’t even look at me.”\n He grabbed her by her hair and opened his car door.\n The next thing she knew, she was being dragged outside, the grass scratching her legs. She kicked helplessly at the gravel. Her scream sounded thin in the night air—no one around to hear it. He threw her down, straddled her. His hands closed around her throat.\n “Shut up,” he warned.\n She couldn’t breathe. He was a black shadow above her, moonlight glinting on blond hair. Her throat turned to cement, a fire building up inside her chest.\n If I just don’t fight, she decided. He will let me go.\n He kept one hand around her throat as he ripped open her blouse, then began tugging at her skirt.\n He will let me go.\n She prayed those words, over and over, but her hands still clawed weakly at his face. The gravel and barbed wire dug into her back.\n His hand tightened on her throat, and she wanted to tell him she would behave herself. She needed to breathe. If she could just get his attention, he would surely remember that.\n She felt herself catching fire, as if her whole being were made of tissue paper. Her eyesight turned red, and the world faded into one small ember, slowly being smothered under Frankie’s hand.\n Chapter 11\n ETCH ARRIVED AT THE CRIME SCENE HOPING TO FIND MAIA Lee dead.\n Dispatch hadn’t told him much over the radio. A shoot-out in King William between a man and a woman. Lucia’s old address. Etch prayed Titus Roe had done his work.\n Inside the yellow perimeter tape, the tow crew was loading a shot-to-hell Volvo sedan onto a flatbed trailer. The media vultures had cameras rolling. Neighbors wrapped in blankets shivered on their front lawns.\n No ambulance or ME van.\n Maybe the body was en route to the morgue.\n Kelsey waited at the curb, his slacks splattered with what looked like coffee. He was holding his jacket over his crotch, as if that would hide the problem.\n Etch gritted his teeth. Kelsey had been enough of an embarrassment for one day. Cops all over the city were already talking about his debacle of a car chase.\n “So,” Etch said. “The old lady you pulled over must’ve looked pretty dangerous.”\n Kelsey’s ears turned purple. “We were baited. It was Arguello.”\n “You sure?”\n “The old lady described the guys who switched cars with her. Arguello and a white guy.”\n “Navarre?”\n “Maybe.” Kelsey didn’t sound convinced. “Whoever he was, he gave the old lady a hundred bucks and told her to keep the van. No VIN. Engine block numbers erased. Completely untraceable.”\n “Christ.”\n “And then we got this.” Kelsey waved toward the shot-up Volvo.\n Etch scanned the scene, trying to read what had happened. The Volvo had been hit at least four times by a large-caliber gun. No sign of Lee’s black BMW.\n The shooting had started in the driveway of Lucia’s old house. Forensics had circled a spent casing on the concrete. Skid marks in front of the house indicated where the Volvo had peeled out.\n Perhaps Lee had parked the BMW somewhere else—around the block so it’d be out of sight. She commandeered the Volvo, and Titus Roe had taken her down as she attempted to flee.\n Etch tried to like that scenario.\n He forced himself to look at Lucia’s house.\n The old fry cook who rented the place had trashed the front porch with beer cans and lawn furniture. He’d desecrated the yard with his goddamn whirly bird decorations.\n The idea of Mike Flume living here, sleeping in Lucia’s bedroom, always made Etch’s blood steam. Flume must’ve invited Maia Lee here to poke around for scraps of the past. God knew what else he’d told her. Etch should’ve taken care of him years ago, along with Jaime Santos. And as for Maia Lee . . .\n “Hell of a shooter.” Kelsey pulled his trench coat tighter. “Lee sure knew how to stop a Volvo.”\n Etch blinked. “Lee shot up the car?”\n “Sorry, sir, I thought you knew. Witnesses up and down the block. Nice-looking Asian lady in a black BMW.”\n “You mean—”\n “The guy in the Volvo tried to kill her and she turned the tables. Chased after him, blew his car to hell.”\n “She killed the guy?”\n “No, sir. Took him out of the Volvo at gunpoint.” Kelsey shook his head in disgust. “They drove off together in her car. Neighbors thought she was a cop, taking the guy into custody.”\n Etch’s mouth felt like sand.\n Maia Lee, goddamn her, had taken Titus alive. And with a screwup like Titus—it wouldn’t be long before he gave up Etch’s name. What the hell had Etch been thinking, going to Roe?\n “Lieutenant?” Kelsey asked.\n “I’m all right,” he managed. “Been a long day.”\n Kelsey’s eyes were as impersonal as microscope lenses. “You just come from the Santos case?”\n Etch willed his hands not to clench.\n The bastard was fishing, looking for a reaction.\n “Yeah,” Etch said. “Alamo Heights PD is cooperating. Ballistics is still working the scene.”\n “Tied to Ana’s shooting?”\n “Doubtful. Couple of weeks ago, Santos reported some kids down in the basin—”\n “I heard.” Kelsey’s tone made it clear he didn’t think much of the teenage sniper theory.\n There was a loud, dull clunk. The tow crew lowered the Volvo onto their trailer.\n “I got to sign for that.” Kelsey studied Etch, as if the lieutenant was a much more interesting wreck-in-progress. “If you’ll excuse me, sir.”\n ETCH STEADIED HIMSELF AGAINST THE SIDE of his car.\n His knees felt weak.\n He stared up the sidewalk at Lucia’s porch.\n The night of Frankie White’s murder, Lucia and he had sat on that porch after their shift, as they’d done so many times before. Three in the morning. Out of uniform. Etch insisted on making margaritas. They sat together on the porch swing and drank in silence like mourners at a wake.\n “We need to talk about it,” Lucia said.\n “No,” he told her. “We don’t.”\n “Etch, I don’t want a lie between us.”\n She wore nothing special—jeans, her Houston Rockets T-shirt. Her feet were bare. Her short curly hair retained the faint impression of her patrol hat. She looked more beautiful than ever—the way people look when they’re slipping away from you.\n Etch set down his margarita. He slid off the porch swing and knelt in front of her, his arms circling her chest, his head resting between her breasts. She ran her fingers through his hair. He could hear her heartbeat. Her skin smelled of clove.\n “It was an accident,” he told her.\n “It was murder. The nightstick—”\n “Lucia, don’t. Please.”\n He couldn’t make himself say what he’d planned. He couldn’t explain why he’d been late to the Pig Stand that evening. All he had wanted to do was help her, save her. He had planned everything so perfectly, gotten up his nerve for weeks, and now his best intentions were shredded.\n She allowed him to kiss her.\n Later they went inside, shed their clothes. Their lovemaking was clumsy and desperate.\n She told him she loved him, but the hollowness had begun.\n A hole had been bored in Lucia’s soul. The more Etch strove to patch it, the bigger it became, the further she slipped from his grasp.\n In the years that followed, she kept up the facade of model officer. She pushed herself to confront the most dangerous situations. She got repeated commendations for bravery, but Etch began to see these incidents for what they were—suicide attempts, like the alcohol. Displays of contempt for her own life. He began to wonder if the shoot-out at the Pig Stand, years before, had really been about saving him, or if it had merely been her first flirtation with self-destruction.\n He covered for her more reckless moments on the job, her drunk driving episodes. Her reputation on the force remained untarnished. They named a scholarship after her at the academy—a program for female recruits.\n Seven years after Frankie died, Etch was at her bedside. He wouldn’t allow himself to believe she was dying. She refused to let him call the doctors.\n I’ll be fine, she murmured. Just need some rest.\n She convinced him to go home for the night, let her sleep off the alcohol.\n Her last words, muttered half asleep as he closed her bedroom door: Ana, is that you?\n Ana, the daughter who hadn’t visited her in over a year.\n “LIEUTENANT?”\n Etch forced himself back to the present.\n Kelsey was folding up his cell phone, slipping it into his pocket. “Another report on Navarre and Arguello. Assault and battery, four-twenty this afternoon. Arguello, Navarre, some woman—they approached this guy at the Poco Mas, got him outside and beat the shit out of him. Seems they were looking for Johnny Shoes.”\n Etch pondered that. “Who was the woman?”\n “Anglo. Blonde.”\n “Not Lee, then. Who?”\n Kelsey shook his head. “We’re working on it.”\n “Work harder. They’ve already made fools of us enough this weekend.”\n Etch said us. He knew Kelsey heard it as you. \n","sourceLink":"https://allnovel.net/mission-road-tres-navarre-6/page-23.html","bookId":2421,"book":{"id":2421,"title":"Mission Road (Tres Navarre #6)","description":"Storyline: \n Mission Road (Tres Navarre #6) \n The triple-crown winner of mystery\u0027s most prestigious awards-the Edgar, the Anthony, and the Shamus-Rick Riordan blasted onto the crime scene with one of its freshest and most intriguing protagonists, Tres Navarre. In Mission Road, Navarre returns in a wrenching crime drama in which he must revisit the sins of the past to catch a killer about to get away with murder...again. \n San Antonio private investigator Tres Navarre is used to working on the edge-that razor-sharp line between legal and life sentence. But this time he\u0027s stepped straight into a no-man\u0027s-land. When an old friend appears at his door spattered with blood and wanted for attempted homicide, Tres doesn\u0027t have to think twice about where his loyalty lies-or the consequences. \n Ralph Arguello is a criminal who put the street life behind him when he married SAPD detective Ana DeLeon. Now Ana\u0027s been gunned down and her fellow cops don\u0027t need to look far to find a prime suspect. For Ana recently reopened the most infamous cold case in SAPD history-the unsolved murder on notorious Mission Road eighteen years before that threw the San Antonio underworld into bloody chaos. Ana was about to bring charges against the suspected killer: her husband, Ralph Arguello.Tres is sure that Ralph didn\u0027t do it-and that he didn\u0027t shoot his wife. But with the police and the Mafia both out for revenge, there\u0027s no one to turn to for help. \n Now, armed and dangerous, the targets of a citywide manhunt, Tres and Ralph have just hours to discover what really happened on Mission Road almost two decades ago. To find the truth, they must set a collision course with the past-and with a secret that will tear their lives apart.\n \n","cover":"https://allnovel.net/images/mission-road-tres-navarre-6.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/mission-road-tres-navarre-6.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:32:20 PM"}}
