{"id":76849,"no":31,"title":"Page 31","content":"But Frankie White had ruined everything. As usual, the Whites got in the way.\\n\\n Etch picked up the black velvet box from the windowsill.\\n\\n He opened it and stared at the white gold engagement ring, the small stone that was all he could afford, eighteen years ago.\\n\\n He hadn’t had the courage to propose that night—not after the murder. And in the following weeks, Lucia started drifting away. He never found the right moment. He feared that she would say no.\\n\\n Lucia never saw the ring.\\n\\n Like so many of Etch’s dreams, the velvet box got tucked away, a secret what if he never showed to anyone. It was all Frankie White’s fault. The bastard had deserved every hit with the nightstick.\\n\\n Lucia spoke to him: It isn’t the Whites you’re mad at, Etch, any more than you’re mad at Ralph Arguello.\\n\\n “You’re wrong,” Etch said.\\n\\n You’re mad at me. Because I couldn’t be there for you, not one hundred percent.\\n\\n “That wasn’t your fault.”\\n\\n It’s still true, love. You meant to kill Ana. As soon as she looked into the case, you stole that poison from the evidence room. You were already thinking about how to stop her.\\n\\n “No.”\\n\\n Don’t kill her, Etch.\\n\\n “She betrayed you. She left you. She doesn’t deserve anything from me.”\\n\\n Ana’s words mixed with her mother’s: Everybody is so goddamn busy protecting her reputation, they’re not helping her.\\n\\n Etch had no choice. He hadn’t chosen any of this.\\n\\n He made Lucia a silent deal: If you want it stopped, you’ll have to stop me. Otherwise . . .\\n\\n He slipped the syringe in his coat pocket.\\n\\n He closed up his empty house. As he walked toward his car, he imagined that his steps were erasing themselves behind him, leaving no trace of the path he’d walked for the last eighteen years.\\n\\n Chapter 16\\n\\n SO MUCH FOR BIOLOGICAL CLOCKS.\\n\\n When I woke up, it was already light outside. I was upside-down in Frankie White’s much-too-comfortable bed. The clock read 9:02.\\n\\n I cursed and ripped off the covers. My head felt like it had been used as a guacamole pestle. I was still wearing the silk pajamas.\\n\\n I grabbed the baseball bat, started to go for the door, but the tiled floor was like ice. I tiptoed my way to the closet and searched for shoes.\\n\\n Frankie’s too-small football cleats? Wouldn’t fit.\\n\\n My only other choice: the teddy bear slippers. I swallowed my pride. At least they were warm, and I figured they’d be quieter than cleats.\\n\\n I went to the door and tried it—still open. Virgil was still standing outside, bleary-eyed, reading a NASCAR magazine.\\n\\n He turned, stared at me in surprise.\\n\\n I gave him my most disarming smile. “’Morning, Virgil.”\\n\\n Then I rammed the baseball bat in his gut. He doubled over, allowing me to clonk him on the head and roll him into the room. He curled into fetal position on the tiles and moaned. Not quite unconscious, but he wasn’t going to be running relay races anytime soon.\\n\\n I took his gun and his keys, apologized, and was about to leave when I thought, Shoes.\\n\\n I checked him out. No good. Feet way too small. For the time being, I was stuck with the teddy bears.\\n\\n I locked Virgil in Frankie’s room and trotted next door to Ralph’s. No guard outside. The hallway was clear in both directions.\\n\\n I suppose I should’ve felt honored Virgil chose my door to stand outside. He’d obviously concluded that I was the more lethal threat, or maybe he simply didn’t want to listen to Ralph snore. And Ralph does snore.\\n\\n I rapped lightly on the door—Para bailar La Bamba.\\n\\n A muffled grunt, then silence.\\n\\n I rapped again. Ralph doesn’t sleep much, but when he finally gets to deep REM, he tends to stay there.\\n\\n Finally his voice: “You better have breakfast.”\\n\\n “A .38 or a baseball bat,” I murmured. “Take your pick.”\\n\\n “Thirty-eights give me indigestion.”\\n\\n I found the right key and unlocked his door. He was wearing black sweatpants and a T-shirt. His hair was frizzy, tied in a haphazard ponytail like the Wicked Witch of the West.\\n\\n He looked down at my animal slippers. “Nice.”\\n\\n “There’s a story behind those.”\\n\\n “When the mother bear catches up with you, it’s your problem.” He grabbed the bat. “Which way?”\\n\\n We headed for the main staircase.\\n\\n I was hoping several things: First, that I could find my way back to the service entrance in the kitchen. I mean, why mess with a classic strategy? It had worked for Titus Roe. Second, I was hoping the White household was mostly asleep, this being the morning after the big party. Finally, I was hoping we could find a car and get off the property alive.\\n\\n All those hopes pretty much fell apart when we ran into Madeleine.\\n\\n WE WERE CROSSING THE BALCONY OF the main entry hall, heading for the final flight of stairs, when she emerged from a door right next to us.\\n\\n I’m not sure who was more surprised, but her hangover must’ve still been slowing her wits. I had time to raise my gun.\\n\\n Her jeans and oversized button-down were spattered with acrylic paint. She smelled of turpentine. She had three green freckles on her cheek and a slash of sky blue in her hair.\\n\\n She stared at the .38 like it was a dead rat. “What are you doing?”\\n\\n “Leaving,” I said.\\n\\n “The hell you are.”\\n\\n “Come on, Madeleine. Just . . . go take a shower or something. We’ll be out of your way.”\\n\\n “You son-of-a-bitch. Where’s Virgil?”\\n\\n “Upstairs with a stomachache and a headache. Look, you never wanted us here. It didn’t work out. We’re going to keep looking on our own.”\\n\\n The scary thing was, I almost thought I’d convinced her.\\n\\n She gazed down into the entry hall, as if thinking hard. Then I realized she was looking at the front door. Our favorite mafia boy Alex Cole had just come inside, carrying a Sunday paper, his car keys and a box of Krispy Kremes.\\n\\n He was moving fast. Red-faced and scowling, he marched toward the stairs like he absolutely had to get his doughnuts somewhere important. He froze when he saw us.\\n\\n “You bitch,” he said to Madeleine. “What are they doing out?”\\n\\n Madeleine blinked. “What did you just—”\\n\\n “It was on the car radio.” Alex pointed at Ralph. “It was him. The police have DNA. Arguello killed Frankie. That’s why he shot his wife. She was about to bust him.”\\n\\n Madeleine looked like she’d taken an uppercut to the face. She turned toward me.\\n\\n “It’s a frame,” I said. “Madeleine, we wouldn’t be here—”\\n\\n “Hey, wake up!” Alex shouted at the house. “Security! Wake the fuck up!”\\n\\n Madeleine’s fists clenched, but her eyes were brittle, the way they’d looked when she was ten, running under the high school bleachers to get away from her brother. “How. How could you—”\\n\\n “It wasn’t me, chiquita,” Ralph told her. “I tried to help Frankie. You know that.”\\n\\n “Wake up, somebody!” Alex yelled. “Aw, the hell with it.”\\n\\n He dropped his keys and doughnuts on an end table and started up the stairs toward us. Footsteps behind us—at least two guys, running from the upstairs hall.\\n\\n “Vato,” Ralph yelled, “vámanos!”\\n\\n We pushed past Madeleine, who didn’t try to stop us. We ran toward the bottom of the stairs and Alex.\\n\\n Two guards were coming behind us. Both were armed, but looked half asleep, baffled by what they saw.\\n\\n “What are you waiting for?” Alex yelled. “Shoot them!”\\n\\n One of the guards: “But—”\\n\\n Alex started to say, “Shoot, godda—” when Ralph and I crashed into him. Not the most graceful takedown, but it worked. Alex crumpled backward in an unintended somersault.\\n\\n Ralph and I burst through the kitchen doorway just as the guards opened fire.\\n\\n RALPH RAN STRAIGHT FOR THE SERVICE exit. A bullet came through the window and shattered a bottle of brandy on the counter.\\n\\n He hit the floor, put his back against the door.\\n\\n “One more guy outside.” He reached up, threw the deadbolt.\\n\\n The interior door had no lock, but it was right next to the refrigerator. I dragged the fridge in front of it. With all the adrenaline coursing through my body, I probably could’ve stacked a stove and a couple of cars, too.\\n\\n Alex was cursing in the living room. He told one of the guards to wake up Mr. White. Madeleine said something and he yelled at her to shut up. Somebody battered on the interior door. The beer bottles rattled in the fridge.\\n\\n The wall phone was right next to me. I thought about calling the police, but I decided it wouldn’t do any good. We already had enough people on the premises who wanted to kill us.\\n\\n Maia was my only other option, but I hesitated. As much as we needed her, as much as I wanted to hear her voice, I didn’t want to put her in danger. I had a bad feeling that if I called her, it might be our last conversation.\\n\\n A guard’s face appeared in the back window. I shot at the pane just above his head, then scrambled over to where Ralph was sitting.\\n\\n “We need a third exit,” Ralph said. “Maybe a distraction.”\\n\\n WHUMP.\\n\\n The interior door shuddered. The fridge moved a couple of inches.\\n\\n Brandy from the broken bottle was dripping off the counter. There were maybe a dozen more bottles left over from the party. Right by the gas stove—and the window above the sink.\\n\\n An insane idea started to form in my head, but Ralph was way ahead of me.\\n\\n “Check that drawer by the oven,” he said. “Find me some matches.”\\n\\n As Ralph was lighting what might be our funeral pyre, I gave in to desperation. I picked up the phone.\\n\\n Chapter 17\\n\\n SUNDAY MORNING THE STREETS WERE DESERTED, which was not good for Maia’s safety. When she was angry and nervous, she drove as fast as traffic would allow. This morning, that was very fast indeed.\\n\\n As so often happened for her, the answers had woven together in her mind at 3:00 A.M. Unable to sleep, dreading the onset of morning sickness, she had followed Ana DeLeon’s thought process through to the end. Maia knew who had shot Ana. An 8:00 A.M. call to the hospital front desk, a few questions about the police security detail had confirmed Maia’s fears about what he would do next.\\n\\n Etch Hernandez.\\n\\n Two things had decided her. First, the look on Kelsey’s face last night had not been the look of a guilty man. Stubborn, angry, defensive, yes. But guilty men don’t look quite so lost. They tend to have a smug calmness somewhere inside—a certainty that they are right and will be vindicated. Kelsey didn’t know what the hell was happening to him. He looked like a hopelessly outmatched boxer who’d decided to tuck in his chin, squeeze his eyes shut, and throw as many blind punches as possible before he got KO’d.\\n\\n The second factor was the photograph of Hernandez and Lucia from Ana’s bulletin board. Maia had studied it a hundred times. She kept trying to read the strange uneasiness, the tense body language between the two partners. The way they stood together, the way Etch seemed entirely conscious of Lucia . . . Timing is wrong.\\n\\n Maia wondered if Ana realized how ironic her notation was. \\n\\n","sourceLink":"https://allnovel.net/mission-road-tres-navarre-6/page-31.html","bookId":2421,"book":{"id":2421,"title":"Mission Road (Tres Navarre #6)","description":"Storyline: Mission Road (Tres Navarre #6) \\n The triple-crown winner of mystery\u0027s most prestigious awards-the Edgar, the Anthony, and the Shamus-Rick Riordan blasted onto the crime scene with one of its freshest and most intriguing protagonists, Tres Navarre. In Mission Road, Navarre returns in a wrenching crime drama in which he must revisit the sins of the past to catch a killer about to get away with murder...again. \\n San Antonio private investigator Tres Navarre is used to working on the edge-that razor-sharp line between legal and life sentence. But this time he\u0027s stepped straight into a no-man\u0027s-land. When an old friend appears at his door spattered with blood and wanted for attempted homicide, Tres doesn\u0027t have to think twice about where his loyalty lies-or the consequences. \\n Ralph Arguello is a criminal who put the street life behind him when he married SAPD detective Ana DeLeon. Now Ana\u0027s been gunned down and her fellow cops don\u0027t need to look far to find a prime suspect. For Ana recently reopened the most infamous cold case in SAPD history-the unsolved murder on notorious Mission Road eighteen years before that threw the San Antonio underworld into bloody chaos. Ana was about to bring charges against the suspected killer: her husband, Ralph Arguello.Tres is sure that Ralph didn\u0027t do it-and that he didn\u0027t shoot his wife. But with the police and the Mafia both out for revenge, there\u0027s no one to turn to for help. \\n Now, armed and dangerous, the targets of a citywide manhunt, Tres and Ralph have just hours to discover what really happened on Mission Road almost two decades ago. To find the truth, they must set a collision course with the past-and with a secret that will tear their lives apart.\\n","cover":"https://allnovel.net/images/mission-road-tres-navarre-6.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/mission-road-tres-navarre-6.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 3:32:20 PM"}}
