{"id":20366,"no":31,"title":"Chapter the Thirtieth.","content":"Cassio. That thrust had been my enemy indeed, \n \n But that my coat is better than thou know’st. \n \n OTHELLO. \n \n On the dark October night succeeding the evening on which Tomkins was slain, Colonel Everard, besides his constant attendant Roger Wildrake, had Master Nehemiah Holdenough with him as a guest at supper. The devotions of the evening having been performed according to the Presbyterian fashion, a light entertainment, and a double quart of burnt claret, were placed before his friends at nine o’clock, an hour unusually late. Master Holdenough soon engaged himself in a polemical discourse against Sectaries and Independents, without being aware that his eloquence was not very interesting to his principal hearer, whose ideas in the meanwhile wandered to Woodstock and all which it contained — the Prince, who lay concealed there — his uncle — above all, Alice Lee. As for Wildrake, after bestowing a mental curse both on Sectaries and Presbyterians, as being, in his opinion, never a barrel the better herring, he stretched out his limbs, and would probably have composed himself to rest, but that he as well as his patron had thoughts which murdered sleep. \n \n The party were waited upon by a little gipsy-looking boy, in an orange-tawny doublet, much decayed, and garnished with blue worsted lace. The rogue looked somewhat stinted in size, but active both in intelligence and in limb, as his black eyes seemed to promise by their vivacity. He was an attendant of Wildrake’s choice, who had conferred on him the nom de guerre of Spitfire, and had promised him promotion so soon as his young protegé, Breakfast, was fit to succeed him in his present office. It need scarce be said that the manege was maintained entirely at the expense of Colonel Everard, who allowed Wildrake to arrange the household very much according to his pleasure. The page did not omit, in offering the company wine from time to time, to accommodate Wildrake with about twice the number of opportunities of refreshing himself which he considered it necessary to afford to the Colonel or his reverend guest. \n \n While they were thus engaged, the good divine lost in his own argument, and the hearers in their private thoughts, their attention was about half-past ten arrested by a knocking at the door of the house. To those who have anxious hearts, trifles give cause of alarm. \n \n Even a thing so simple as a knock at the door may have a character which excites apprehension. This was no quiet gentle tap, intimating a modest intruder; no redoubled rattle, as the pompous annunciation of some vain person; neither did it resemble the formal summons to formal business, nor the cheerful visit of some welcome friend. It was a single blow, solemn and stern, if not actually menacing in the sound. The door was opened by some of the persons of the house; a heavy foot ascended the stair, a stout man entered the room, and drawing the cloak from his face, said, “Markham Everard, I greet thee in God’s name.” \n \n It was General Cromwell. \n \n Everard, surprised and taken at unawares, endeavoured in vain to find words to express his astonishment. A bustle occurred in receiving the General, assisting him to uncloak himself, and offering in dumb show the civilities of reception. The General cast his keen eye around the apartment, and fixing it first on the divine, addressed Everard as follows: “A reverend man I see is with thee. Thou art not one of those, good Markham, who let the time unnoted and unimproved pass away. Casting aside the things of this world — pressing forward to those of the next — it is by thus using our time in this poor seat of terrestrial sin and care, that we may, as it were — But how is this?” he continued, suddenly changing his tone, and speaking briefly, sharply, and anxiously; “one hath left the room since I entered?” \n \n Wildrake had, indeed, been absent for a minute or two, but had now returned, and stepped forward from a bay window, as if he had been out of sight only, not out of the apartment. “Not so, sir; I stood but in the background out of respect. Noble General, I hope all is well with the Estate, that your Excellency makes us so late a visit? Would not your Excellency choose some”— \n \n “Ah!” said Oliver, looking sternly and fixedly at him —“Our trusty Go-between — our faithful confidant. — No, sir; at present I desire nothing more than a kind reception, which, methinks, my friend Markham Everard is in no hurry to give me.” \n \n “You bring your own welcome, my lord,” said Everard, compelling himself to speak. “I can only trust it was no bad news that made your Excellency a late traveller, and ask, like my follower, what refreshment I shall command for your accommodation.” \n \n “The state is sound and healthy, Colonel Everard,” said the General; “and yet the less so, that many of its members, who have been hitherto workers together, and propounders of good counsel, and advancers of the public weal, have now waxed cold in their love and in their affection for the Good Cause, for which we should be ready, in our various degrees, to act and do so soon as we are called to act that whereunto we are appointed, neither rashly nor over-slothfully, neither lukewarmly nor over-violently, but with such a frame and disposition, in which zeal and charity may, as it were, meet and kiss each other in our streets. Howbeit, because we look back after we have put our hand to the plough, therefore is our force waxed dim.” \n \n “Pardon me, sir,” said Nehemiah Holdenough, who, listening with some impatience, began to guess in whose company he stood —“Pardon me, for unto this I have a warrant to speak.” \n \n “Ah! ah!” said Cromwell. “Surely, most worthy sir, we grieve the Spirit when we restrain those pourings forth, which, like water from a rock”— \n \n “Nay, therein I differ from you, sir,” said Holdenough; “for as there is the mouth to transmit the food, and the profit to digest what Heaven hath sent; so is the preacher ordained to teach and the people to hear; the shepherd to gather the flock into the sheepfold, the sheep to profit by the care of the shepherd.” \n \n “Ah! my worthy sir,” said Cromwell, with much unction, “methinks you verge upon the great mistake, which supposes that churches are tall large houses built by masons, and hearers are men — wealthy men, who pay tithes, the larger as well as the less; and that the priests, men in black gowns or grey cloaks, who receive the same, are in guerdon the only distributors of Christian blessings; whereas, in my apprehension, there is more of Christian liberty in leaving it to the discretion of the hungry soul to seek his edification where it can be found, whether from the mouth of a lay teacher, who claimeth his warrant from Heaven alone, or at the dispensation of those who take ordinations and degrees from synods and universities, at best but associations of poor sinful creatures like themselves.” \n \n “You speak you know not what, sir,” replied Holdenough, impatiently. “Can light come out of darkness, sense out of ignorance, or knowledge of the mysteries of religion from such ignorant mediciners as give poisons instead of wholesome medicaments, and cram with filth the stomachs of such as seek to them for food?” This, which the Presbyterian divine uttered rather warmly, the General answered with the utmost mildness. \n \n “Lack-a-day, lack-a-day! a learned man, but intemperate; over-zeal hath eaten him up. — A well-a-day, sir, you may talk of your regular gospel-meals, but a word spoken in season by one whose heart is with your heart, just perhaps when you are riding on to encounter an enemy, or are about to mount a breach, is to the poor spirit like a rasher on the coals, which the hungry shall find preferable to a great banquet, at such times when the full soul loatheth the honey-comb. Nevertheless, although I speak thus in my poor judgment, I would not put force on the conscience of any man, leaving to the learned to follow the learned, and the wise to be instructed by the wise, while poor simple wretched souls are not to be denied a drink from the stream which runneth by the way. — Ay, verily, it will be a comely sight in England when men shall go on as in a better world, bearing with each other’s infirmities, joining in each other’s comforts. — Ay, truly, the rich drink out of silver flagons, and goblets of silver, the poor out of paltry bowls of wood — and even so let it be, since they both drink the same element.” \n \n Here an officer opened the door and looked in, to whom Cromwell, exchanging the canting drawl, in which it seemed he might have gone on interminably, for the short brief tone of action, called out, “Pearson, is he come?” \n \n “No, sir,” replied Pearson; “we have enquired for him at the place you noted, and also at other haunts of his about the town.” \n \n “The knave!” said Cromwell, with bitter emphasis; “can he have proved false? — No, no, his interest is too deeply engaged. We shall find him by and by. Hark thee hither.” \n \n While this conversation was going forward, the reader must imagine the alarm of Everard. He was certain that the personal attendance of Cromwell must be on some most important account, and he could not but strongly suspect that the General had some information respecting Charles’s lurking place. If taken, a renewal of the tragedy of the 30th of January was instantly to be apprehended, and the ruin of the whole family of Lee, with himself probably included, must be the necessary consequence. \n \n He looked eagerly for consolation at Wildrake, whose countenance expressed much alarm, which he endeavoured to bear out with his usual look of confidence. But the weight within was too great; he shuffled with his feet, rolled his eyes, and twisted his hands, like an unassured witness before an acute and not to be deceived judge. \n \n Oliver, meanwhile, left his company not a minute’s leisure to take counsel together. Even while his perplexed eloquence flowed on in a stream so mazy that no one could discover which way its course was tending, his sharp watchful eye rendered all attempts of Everard to hold communication with Wildrake, even by signs, altogether vain. Everard, indeed, looked for an instant at the window, then glanced at Wildrake, as if to hint there might be a possibility to escape that way. But the cavalier had replied with a disconsolate shake of the head, so slight as to be almost imperceptible. Everard, therefore, lost all hope, and the melancholy feeling of approaching and inevitable evil, was only varied by anxiety concerning the shape and manner in which it was about to make its approach. \n \n But Wildrake had a spark of hope left. The very instant Cromwell entered he had got out of the room, and down to the door of the house. “Back — back!” repeated by two armed sentinels, convinced him that, as his fears had anticipated, the General had come neither unattended nor unprepared. He turned on his heel, ran up stairs, and meeting on the landing-place the boy whom he called Spitfire, hurried him into the small apartment which he occupied as his own. Wildrake had been shooting that morning, and game lay on the table. He pulled a feather from a woodcock’s wing, and saying hastily, “For thy life, Spitfire, mind my orders — I will put thee safe out at the window into the court — the yard wall is not high — and there will be no sentry there — Fly to the Lodge, as thou wouldst win Heaven, and give this feather to Mistress Alice Lee, if possible — if not, to Joceline Joliffe — say I have won the wages of the young lady. Dost mark me, boy?” \n \n The sharp-witted youth clapped his hand in his master’s, and only replied, “Done, and done.” \n \n Wildrake opened the window, and, though the height was considerable, he contrived to let the boy down safely by holding his cloak. A heap of straw on which Spitfire lighted rendered the descent perfectly safe, and Wildrake saw him scramble over the wall of the court-yard, at the angle which bore on a back lane; and so rapidly was this accomplished, that the cavalier had just re-entered the room, when, the bustle attending Cromwell’s arrival subsiding, his own absence began to be noticed. \n \n He remained during Cromwell’s lecture on the vanity of creeds, anxious in mind whether he might not have done better to send an explicit verbal message, since there was no time to write. But the chance of the boy being stopped, or becoming confused with feeling himself the messenger of a hurried and important communication, made him, on the whole, glad that he had preferred a more enigmatical way of conveying the intelligence. He had, therefore, the advantage of his patron, for he was conscious still of a spark of hope. \n \n Pearson had scarce shut the door, when Holdenough, as ready in arms against the future Dictator as he had been prompt to encounter the supposed phantoms and fiends of Woodstock, resumed his attack upon the schismatics, whom he undertook to prove to be at once soul-slayers, false brethren, and false messengers; and was proceeding to allege texts in behalf of his proposition, when Cromwell, apparently tired of the discussion, and desirous to introduce a discourse more accordant with his real feelings, interrupted him, though very civilly, and took the discourse into his own hands. \n \n “Lack-a-day,” he said, “the good man speaks truth, according to his knowledge and to his lights — ay, bitter truths, and hard to be digested, while we see as men see, and not with the eyes of angels. — False messengers, said the reverend man? — ay, truly, the world is full of such. You shall see them who will carry your secret message to the house of your mortal foe, and will say to him, ‘Lo! my master is going forth with a small train, by such and such desolate places; be you speedy, therefore, that you may arise and slay him.’ And another, who knoweth where the foe of your house, and enemy of your person, lies hidden, shall, instead of telling his master thereof, carry tidings to the enemy even where he lurketh, saying, ‘Lo! my master knoweth of your secret abode — up now, and fly, lest he come on thee like a lion on his prey.’— But shall this go without punishment?” looking at Wildrake with a withering glance. “Now, as my soul liveth, and as He liveth who hath made me a ruler in Israel, such false messengers shall be knitted to gibbets on the wayside, and their right hands shall be nailed above their heads, in an extended position, as if pointing out to others the road from which they themselves have strayed!” \n \n “Surely,” said Master Holdenough, “it is right to cut off such offenders.” \n \n “Thank ye, Mass-John,” muttered Wildrake; “when did the Presbyterian fail to lend the devil a shove?” \n \n “But, I say,” continued Holdenough, “that the matter is estranged from our present purpose, for the false brethren of whom I spoke are”— \n \n “Right, excellent sir, they be those of our own house,” answered Cromwell; “the good man is right once more. Ay, of whom can we now say that he is a true brother, although he has lain in the same womb with us? Although we have struggled in the same cause, eat at the same table, fought in the same battle, worshipped at the same throne, there shall be no truth in him. — Ah, Markham Everard, Markham Everard!” \n \n He paused at this ejaculation; and Everard, desirous at once of knowing how far he stood committed, replied, “Your Excellency seems to have something in your mind in which I am concerned. May I request you will speak it out, that I may know what I am accused of?” \n \n “Ah, Mark, Mark,” replied the General, “there needeth no accuser speak when the still small voice speaks within us. Is there not moisture on thy brow, Mark Everard? Is there not trouble in thine eye? Is there not a failure in thy frame? And who ever saw such things in noble and stout Markham Everard, whose brow was only moist after having worn the helmet for a summer’s day; whose hand only shook when it had wielded for hours the weighty falchion? — But go to, man! thou doubtest over much. Hast thou not been to me as a brother, and shall I not forgive thee even the seventy-seventh time? The knave hath tarried somewhere, who should have done by this time an office of much import. Take advantage of his absence, Mark; it is a grace that God gives thee beyond expectance. I do not say, fall at my feet; but speak to me as a friend to his friend.” \n \n “I have never said any thing to your Excellency that was in the least undeserving the title you have assigned to me,” said Colonel Everard, proudly. \n \n “Nay, nay, Markham,” answered Cromwell; “I say not you have. But — but you ought to have remembered the message I sent you by that person” (pointing to Wildrake;) “and you must reconcile it with your conscience, how, having such a message, guarded with such reasons, you could think yourself at liberty to expel my friends from Woodstock, being determined to disappoint my object, whilst you availed yourself of the boon, on condition of which my warrant was issued.” \n \n Everard was about to reply, when, to his astonishment, Wildrake stepped forward; and with a voice and look very different from his ordinary manner, and approaching a good deal to real dignity of mind, said, boldly and calmly, “You are mistaken, Master Cromwell; and address yourself to the wrong party here.” \n \n The speech was so sudden and intrepid that Cromwell stepped a pace back, and motioned with his right hand towards his weapon, as if he had expected that an address of a nature so unusually bold was to be followed by some act of violence. He instantly resumed his indifferent posture; and, irritated at a smile which he observed on Wildrake’s countenance, he said, with the dignity of one long accustomed to see all tremble before him, “This to me, fellow! Know you to whom you speak?” \n \n “Fellow!” echoed Wildrake, whose reckless humour was now completely set afloat —“No fellow of yours, Master Oliver. I have known the day when Roger Wildrake of Squattlesea-mere, Lincoln, a handsome young gallant, with a good estate, would have been thought no fellow of the bankrupt brewer of Huntingdon.” \n \n “Be silent!” said Everard; “be silent, Wildrake, if you love your life!” \n \n “I care not a maravedi for my life,” said Wildrake. “Zounds, if he dislikes what I say, let him take to his tools! I know, after all, he hath good blood in his veins! and I will indulge him with a turn in the court yonder, had he been ten times a brewer.” \n \n “Such ribaldry, friend,” said Oliver, “I treat with the contempt it deserves. But if thou hast any thing to say touching the matter in question speak out like a man, though thou look’st more like a beast.” \n \n “All I have to say is,” replied Wildrake, “that whereas you blame Everard for acting on your warrant, as you call it, I can tell you he knew not a word of the rascally conditions you talk of. I took care of that; and you may take the vengeance on me, if you list.” \n \n “Slave! dare you tell this to me?” said Cromwell, still heedfully restraining his passion, which he felt was about to discharge itself upon an unworthy object. \n \n “Ay, you will make every Englishman a slave, if you have your own way,” said Wildrake, not a whit abashed; — for the awe which had formerly overcome him when alone with this remarkable man, had vanished, now that they were engaged in an altercation before witnesses. —“But do your worst, Master Oliver; I tell you beforehand, the bird has escaped you.” \n \n “You dare not say so! — Escaped? — So ho! Pearson! tell the soldiers to mount instantly. — Thou art a lying fool! — Escaped? — Where, or from whence?” \n \n “Ay, that is the question,” said Wildrake; “for look you, sir — that men do go from hence is certain — but how they go, or to what quarter”— \n \n Cromwell stood attentive, expecting some useful hint from the careless impetuosity of the cavalier, upon the route which the King might have taken. \n \n —“Or to what quarter, as I said before, why, your Excellency, Master Oliver, may e’en find that out yourself.” \n \n As he uttered the last words he unsheathed his rapier, and made a full pass at the General’s body. Had his sword met no other impediment than the buff jerkin, Cromwell’s course had ended on the spot. But, fearful of such attempts, the General wore under his military dress a shirt of the finest mail, made of rings of the best steel, and so light and flexible that it was little or no encumbrance to the motions of the wearer. It proved his safety on this occasion, for the rapier sprung in shivers; while the owner, now held back by Everard and Holdenough, flung the hilt with passion on the ground, exclaiming, “Be damned the hand that forged thee! — To serve me so long, and fail me when thy true service would have honoured us both for ever! But no good could come of thee, since thou wert pointed, even in jest, at a learned divine of the Church of England.” \n \n In the first instant of alarm — and perhaps suspecting Wildrake might be supported by others, Cromwell half drew from his bosom a concealed pistol, which he hastily returned, observing that both Everard and the clergyman were withholding the cavalier from another attempt. \n \n Pearson and a soldier or two rushed in-“Secure that fellow,” said the General, in the indifferent tone of one to whom imminent danger was too familiar to cause irritation —“Bind him — but not so hard, Pearson;\"— for the men, to show their zeal, were drawing their belts, which they used for want of cords, brutally tight round Wildrake’s limbs. “He would have assassinated me, but I would reserve him for his fit doom.” \n \n “Assassinated! — I scorn your words, Master Oliver,” said Wildrake; “I proffered you a fair duello.” \n \n “Shall we shoot him in the street, for an example?” said Pearson to Cromwell; while Everard endeavoured to stop Wildrake from giving further offence. \n \n “On your life harm him not; but let him be kept in safe ward, and well looked after,” said Cromwell; while the prisoner exclaimed to Everard, “I prithee let me alone — I am now neither thy follower, nor any man’s, and I am as willing to die as ever I was to take a cup of liquor. — And hark ye, speaking of that, Master Oliver, you were once a jolly fellow, prithee let one of thy lobsters here advance yonder tankard to my lips, and your Excellency shall hear a toast, a song, and a — secret.” \n \n “Unloose his head, and hand the debauched beast the tankard,” said Oliver; “while yet he exists, it were shame to refuse him the element he lives in.” \n \n “Blessings on your head for once,” said Wildrake, whose object in continuing this wild discourse was, if possible, to gain a little delay, when every moment was precious. “Thou hast brewed good ale, and that’s warrant for a blessing. For my toast and my song, here they go together — \n \n Son of a witch, \n \n Mayst thou die in a ditch, \n \n With the hutchers who back thy quarrels; \n \n And rot above ground, \n \n While the world shall resound \n \n A welcome to Royal King Charles. \n \n And now for my secret, that you may not say I had your liquor for nothing — I fancy my song will scarce pass current for much — My secret is, Master Cromwell — that the bird is flown — and your red nose will be as white as your winding-sheet before you can smell out which way.” \n \n “Pshaw, rascal,” answered Cromwell, contemptuously, “keep your scurrile jests for the gibbet foot.” \n \n “I shall look on the gibbet more boldly,” replied Wildrake, “than I have seen you look on the Royal Martyr’s picture.” \n \n This reproach touched Cromwell to the very quick. —“Villain!” he exclaimed; “drag him hence, draw out a party, and — But hold, not now — to prison with him — let him be close watched, and gagged, if he attempts to speak to the sentinels — Nay, hold — I mean, put a bottle of brandy into his cell, and he will gag himself in his own way, I warrant you — When day comes, that men can see the example, he shall be gagged after my fashion.” \n \n During the various breaks in his orders, the General was evidently getting command of his temper; and though he began in fury, he ended with the contemptuous sneer of one who overlooks the abusive language of an inferior. Something remained on his mind notwithstanding, for he continued standing, as if fixed to the same spot in the apartment, his eyes bent on the ground, and with closed hand pressed against his lips, like a man who is musing deeply. Pearson, who was about to speak to him, drew back, and made a sign to those in the room to be silent. \n \n Master Holdenough did not mark, or, at least, did not obey it. Approaching the General, he said, in a respectful but firm tone, “Did I understand it to be your Excellency’s purpose that this poor man shall die next morning?” \n \n “Hah!” exclaimed Cromwell, starting from his reverie, “what say’st thou?” \n \n “I took leave to ask, if it was your will that this unhappy man should die tomorrow?” \n \n “Whom saidst thou?” demanded Cromwell: “Markham Everard — shall he die, saidst thou?” \n \n “God forbid!” replied Holdenough, stepping back —“I asked whether this blinded creature, Wildrake, was to be so suddenly cut off?” \n \n “Ay, marry is he,” said Cromwell, “were the whole General Assembly of Divines at Westminster — the whole Sanhedrim of Presbytery — to offer bail for him.” \n \n “If you will not think better of it, sir,” said Holdenough, “at least give not the poor man the means of destroying his senses — Let me go to him as a divine, to watch with him, in case he may yet be admitted into the vineyard at the latest hour — yet brought into the sheepfold, though he has neglected the call of the pastor till time is wellnigh closed upon him.” \n \n “For God’s sake,” said Everard, who had hitherto kept silence, because he knew Cromwell’s temper on such occasions, “think better of what you do!” \n \n “Is it for thee to teach me?” replied Cromwell; “think thou of thine own matters, and believe me it will require all thy wit. — And for you, reverend sir, I will have no father-confessors attend my prisoners — no tales out of school. If the fellow thirsts after ghostly comfort, as he is much more like to thirst after a quartern of brandy, there is Corporal Humgudgeon, who commands the corps de garde, will preach and pray as well as the best of ye. — But this delay is intolerable — Comes not this fellow yet?” \n \n “No, sir,” replied Pearson. “Had we not better go down to the Lodge? The news of our coming hither may else get there before us.” \n \n “True,” said Cromwell, speaking aside to his officer, “but you know Tomkins warned us against doing so, alleging there were so many postern-doors, and sallyports, and concealed entrances in the old house, that it was like a rabbit-warren, and that an escape might be easily made under our very noses, unless he were with us, to point out all the ports which should be guarded. He hinted, too, that he might be delayed a few minutes after his time of appointment — but we have now waited half-an-hour.” \n \n “Does your Excellency think Tomkins is certainly to be depended upon?” said Pearson. \n \n “As far as his interest goes, unquestionably,” replied the General. “He has ever been the pump by which I have sucked the marrow out of many a plot, in special those of the conceited fool Rochecliffe, who is goose enough to believe that such a fellow as Tomkins would value any thing beyond the offer of the best bidder. And yet it groweth late — I fear we must to the Lodge without him — Yet, all things well considered, I will tarry here till midnight. — Ah! Everard, thou mightest put this gear to rights if thou wilt! Shall some foolish principle of fantastic punctilio have more weight with thee, man, than have the pacification and welfare of England; the keeping of faith to thy friend and benefactor, and who will be yet more so, and the fortune and security of thy relations? Are these, I say, lighter in the balance than the cause of a worthless boy, who, with his father and his father’s house, have troubled Israel for fifty years?” \n \n “I do not understand your Excellency, nor at what service you point, which I can honestly render,” replied Everard. “That which is dishonest I should be loth that you proposed.” \n \n “Then this at least might suit your honesty, or scrupulous humour, call it which thou wilt,” said Cromwell. “Thou knowest, surely, all the passages about Jezebel’s palace down yonder? — Let me know how they may be guarded against the escape of any from within.” \n \n “I cannot pretend to aid you in this matter,” said Everard; “I know not all the entrances and posterns about Woodstock, and if I did, I am not free in conscience to communicate with you on this occasion.” \n \n “We shall do without you, sir,” replied Cromwell, haughtily; “and if aught is found which may criminate you, remember you have lost right to my protection.” \n \n “I shall be sorry,” said Everard, “to have lost your friendship, General; but I trust my quality as an Englishman may dispense with the necessity of protection from any man. I know no law which obliges me to be spy or informer, even if I were in the way of having opportunity to do service in either honourable capacity.” \n \n “Well, sir,” said Cromwell, “for all your privileges and qualities, I will make bold to take you down to the Lodge at Woodstock to-night, to enquire into affairs in which the State is concerned. — Come hither, Pearson.” He took a paper from his pocket, containing a rough sketch or ground-plan of Woodstock Lodge, with the avenues leading to it. —“Look here,” he said, “we must move in two bodies on foot, and with all possible silence — thou must march to the rear of the old house of iniquity with twenty file of men, and dispose them around it the wisest thou canst. Take the reverend man there along with you. He must be secured at any rate, and may serve as a guide. I myself will occupy the front of the Lodge, and thus having stopt all the earths, thou wilt come to me for farther orders — silence and dispatch is all. — But for the dog Tomkins, who broke appointment with me, he had need render a good excuse, or woe to his father’s son! — Reverend sir, be pleased to accompany that officer. — Colonel Everard, you are to follow me; but first give your sword to Captain Pearson, and consider yourself as under arrest.” \n \n Everard gave his sword to Pearson without any comment, and with the most anxious presage of evil followed the Republican General, in obedience to commands which it would have been useless to dispute. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1461/43917.html","bookId":1363,"book":{"id":1363,"title":"Woodstock","description":"简介： It is not my purpose to inform my readers how the manuscripts of that eminent antiquary, the Rev. J. A. ROCHECLIFFE, D.D., came into my possession. There are many ways in which such things happen, and it is enough to say they were rescued from an unw...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1461","creation":"Aug 1, 2019 12:24:55 AM","modification":"Aug 1, 2019 12:24:55 AM"}}
