{"id":95550,"no":14,"title":"Page 14","content":"He didn\u0027t join her at supper the next night. Rhianna couldn\u0027t help feeling relieved. She wasn\u0027t ready to face him again, not until she understood what had happened between them, until she could make sense of the strange vision she had seen while Rayven was kissing her. After spending a few minutes toying with her food, she pushed her plate aside and left the dining room, wandering through the downstairs until she came to the library. With a sigh, she ran her gaze over the books lining the walls, but none appealed to her. And then, as if it were inevitable, she found herself in his study. She had never gone there without him before, and she couldn\u0027t help feeling she was trespassing as she wandered around the room. And then she saw it, a small book sitting on his desk. Curious, she picked it up and thumbed through the pages. Most were blank, but a few had writing on them. Mesmerized by the words, she sat down, hardly aware that Bevins entered the room a short time later and laid a fire in the hearth. The book was written in a bold hand and she knew, without knowing how she knew, that Rayven had written the words, dark words, troubling words... During the night, I am the creature before you, pale and tall and straight dark eyes firing toward you gliding, lifting, steering, directing I am the silent and the powerful a moonlit field of smooth, untouched snow But he Yes, him, the other me Oh, he would tremble in your grasp his lily hand would crumble to your touch he would twist to press your lips to his he would stroke your silken cheek and slide his corroded lips along your dovelike neck. Not I, you understand, the other me he who squints and hesitates and weakens in the daylight. Her heart was pounding erratically as she turned the page to the next poem. I can feel it coming through the tears in the darkness quickly approaching as I conceal myself quaking underneath the shadows in the light. Shivers ripple my moist skin The urgent itching on the surface tormenting me keeping me locked in. I run my tongue over my lips And I am found, as always. Then it begins My resistance bleeds away and I am filled with the emptiness of my being. Awareness is replete. The trial is ended Sated by the shattering my knowing and left alive for the next visit The darkness has taken a piece of my soul. She closed the book and stared into the flames dancing merrily in the hearth as she tried to understand what she had read. Lord Rayven is a man compelled by dark appetites, miss.She heard Bevins\u0027s voice in the back of her mind. He is driven by forces you cannot comprehend. You would be wise to leave this place and never come back. Last night, she had decided Bevins was right. She had tried to leave the castle early that morning, only to find that all the doors were locked. She had gone looking for Bevins, but, for once, he was nowhere to be found. Now, sitting in front of the fire, her whole body tensed as a chill skittered down her spine. He was here. She had heard no sound to betray his presence, no footsteps as he entered the room, but suddenly he was there before her, a tall figure clad all in black. He stood before the hearth, the fire crackling behind him. Like a demon rising from the bowels of hell. He lifted one black brow in amusement. \"A demon, Rhianna?\" She heard the rueful smile in his voice. \"You are more right than you know.\" She tried to think of something clever to say, but nothing came to mind. Like a bird trapped by a hungry cat, she could only stare at him, waiting for him to strike her down even as she wondered how he had known what she was thinking. He glanced at the book in her hands, wondering how much she had read, if she understood the connection between his dark words and the blackness in his soul. \"You\u0027re afraid of me now, aren\u0027t you?\" he asked, knowing her fear had nothing to do with what she had read and everything to do with what had passed between them the night before. She couldn\u0027t speak past the lump in her throat. \"Aren\u0027t you?\" His voice was sharp, demanding an answer. \"Yes, my lord.\" She crossed her arms over her chest. \"I should like very much to go home now.\" \"Would you?\" She nodded vigorously. \"Yes, please. Please...\" Tears filled her eyes and spilled down her cheeks. \"Please let me go home.\" The sight of her tears smothered his anger. Murmuring her name, he reached for her, drawing her out of the chair and into his arms. The book fell, unnoticed, to the floor. \"I will not hurt you, Rhianna,\" he said quietly. \"Please believe me.\" \"No. I just want to go home. Please, my lord, please let me go home.\" \"Rhianna... sweet Rhianna.\" Gently, he caressed her cheek. She flinched at his touch, as though fearing he would strike her. Once, he had wanted her to be afraid of him, to be wary for her own sake. Now, the knowledge that she was afraid of him burned into his soul, as painful as the touch of the sun on his preternatural flesh. \"Rhianna, I warned you once to go while you could. Now I fear it is too late.\" He shook his head with regret. \"I find I cannot let you go.\" She gazed up at him, his face blurred by her tears. Even so, she could see the loneliness that haunted his eyes, the sadness that she had once yearned to wipe away. Slowly, he lowered his head, and she felt the touch of his lips on hers, cool, gentle. His arms held her lightly, with warm affection. Would he let her go if she stepped away? Heart pounding, she drew away and took a step backward. And he let her go, his arms falling to his sides, his eyes dark with an inner torment she could not fathom. \"You once begged me to let you stay,\" he said, his voice moving over her like a dark wind. \"Now I am begging you.\" She felt the tears dry on her cheeks. \"I\u0027ve changed my mind.\" \"Too late, Rhianna. Shall I go down on my knees and plead with you, my sweet?\" \"No!\" She could not bear to think of him kneeling at her feet, his arrogance humbled, his pride broken. \"Won\u0027t you take pity on me, my sweet Rhianna? A year is not so long, after all.\" \"And if I stay, will you let me go when the year is up?\" \"You have no choice, Rhianna. You will stay.\" \"Then why are you asking me? I don\u0027t understand.\" \"I want you to stay with me of your own free will. I want your company to see me through the long lonely nights. I want to see your smile, hear your voice, your laughter.\" He smiled ruefully, as if he had discovered a truth about himself, one he did not like. \"I need you.\" He needs you, miss. He needs you, and he doesn\u0027t like it.She heard the echo of Bevins\u0027s voice in her mind again. \"Will you stay with me, Rhianna?\" She wanted to say no. She wanted to go home. But she found she could not refuse him. \"Yes.\" \"Because you want to?\" She nodded again, surprised by the discovery that she did, indeed, want to stay. Stepping into the inner chamber of the east tower, Bevins laid out a change of clothing for Rayven, then gathered up his master\u0027s dirty laundry and linen. \"Thank you, Bevins. That will be all.\" Bevins turned to go, then hesitated in the doorway. Taking a deep breath, he turned around. \"I\u0027ve never known you to be deliberately cruel before.\" \"I\u0027ve never known you to care before.\" \"She\u0027s a fine lass. I\u0027d not see her destroyed.\" \"Is that what you think I\u0027m going to do?\" \"Isn\u0027t it?\" \"Have I destroyed any of the others?\" \"She\u0027s not like the others, and you know it. You\u0027ll not be able to hide what you are from her forever, my lord. She cares for you too much to be deceived for long.\" \"Yes, she does.\" Rayven turned away from the accusation in the other man\u0027s eyes. Even after he had pleaded with her to stay, he hadn\u0027t expected her to agree. Last night, she had been terrified of him, of the dark images that had flooded her mind when they kissed, a vision conjured up by his touch, and by the wine she had sipped from his glass. He could end all her fears, bind her to him so that she would want only him. He had only to initiate her, and she would do anything he asked, stay with him for as long as she lived, be miserable when they were apart. \"Let me take her home, my lord.\" \"No.\" \"It\u0027s wrong to keep her here.\" Slowly, Rayven turned around, his gaze locking on that of his servant. Fear took hold of Tom Bevins, the same cold, paralyzing fear that had engulfed him the first time he had looked into the vampyre\u0027s eyes some fifty years before. How clearly he remembered that night. He had been knifed in a street fight and left for dead behind one of the gambling hells, his life slipping away drop by crimson drop when a dark cloud overshadowed him. He had felt a sharp stabbing pain in his neck, and then a voice, low, seductive, had offered to save him. Desperate to live, Tom had watched, uncomprehending, as the stranger hovering over him had made a slit in his own wrist, then pressed his bleeding flesh to Tom\u0027s lips. A few drops of the stranger\u0027s thick dark blood had miraculously revived him. In exchange for his life, Tom had sworn to serve Rayven as long as he drew breath. It had been, for the most part, a good life. He had never wanted for food or shelter or been denied anything else he had desired. But Rayven owned him, body and soul. It was a fact he forgot on occasion. But there was no forgetting now. \"Do not interfere,\" Rayven warned. And in the back of his mind, Bevins heard the unspoken threat: I gave you your life. I can take it back again. \"Will that be all, my lord?\" Bevins asked. At his master\u0027s curt nod, he started toward the door. \"Bevins.\" \"Yes, my lord?\" \"I will not harm her.\" Bevins nodded. It was a promise, and an apology, all in one. \"I don\u0027t understand you,\" Ada said. She didn\u0027t look up from the dough she was kneading. \"I cannot believe you decided to stay with that dreadful man?\" \"He asked me to stay,\" Rhianna replied, bending the truth only a little. \"He\u0027s been kind to me, to us. How could I refuse?\" She glanced past her mother to where Bevins was standing in the doorway, his arms crossed over his chest. He had insisted on accompanying her. To protect her, he had said, but she knew better. He was there to make sure she returned to the castle by nightfall. Ada stared at the lump of dough in the bowl. \"I just thought that when you returned from Paris, you would stay here, with us, with your family.\" \"I\u0027ll come to see you often,\" Rhianna promised. \"It\u0027s only for a year, after all.\" Only a year, she thought, and already a month was gone. \"Will he let you come to your sister\u0027s wedding?\" \"Of course,\" Rhianna replied brightly, though inwardly, she wasn\u0027t sure. Ada looked up and met her daughter\u0027s gaze, wondering what Rhianna was holding back. \"I\u0027ve got to go,\" Rhianna said. Rising, she rounded the table and bent over to give her mother a hug. \"Tell the girls I\u0027m sorry I missed them. I\u0027ll see you at the wedding.\" Ada placed her hand over her daughter\u0027s, marveling at how soft and smooth Rhianna\u0027s hands were. Once, they had been rough and calloused, the nails broken and uneven from hard work. Now, Rhianna had hands like those of a fine lady. Perhaps she was wrong to worry so. \"Good-bye, Mama.\" Rhianna gave her mother one last hug, then left the cottage. Outside, Bevins handed her into the carriage. Taking his place on the seat, he took up the reins and clucked to the horse. \"Your mother is quite lovely,\" Bevins remarked. Rhianna slid a glance in his direction, surprised by his observation, and more surprised that he had voiced it aloud. \"Do you think so?\" Bevins nodded as he turned the horse onto the road. \"You look much like her.\" \"Thank you.\" Rhianna folded her hands in her lap and sat back, enjoying the beauty of the countryside as they passed by. \"Have you ever been married?\" \"No, miss.\" \"How long have you been with Lord Rayven?\" Bevins hesitated. \"A very long time.\" \"Surely he wouldn\u0027t object if you had a family of your own.\" \"I\u0027m afraid it\u0027s not possible.\" Not possible,she mused. What an odd way to phrase it. \"Why do I never see him during the day?\" \"I couldn\u0027t say, miss.\" \"But you know, don\u0027t you?\" \"Would you like to stop in the village for anything?\" Bevins asked, blatantly changing the subject. \"Yes,\" Rhianna answered. \"I\u0027d like to stop at the confectioner\u0027s.\" They traveled in silence until they reached the village. Rhianna bought a small bag of peppermint candy for herself, and another, larger bag, to take to her mother and sisters on her next visit. As she stepped out of the store, she saw a little girl of perhaps seven sitting near the door. The child\u0027s hair was dirty and stringy, her dress faded and tattered along the hem. \"Are you lost, child?\" Rhianna asked. The girl looked up at her through wide brown eyes, then, shyly, held up a fistful of primroses. \"Buy a flower, my lady?\" \"Of course,\" Rhianna said, and then realized she had no money. \"Bevins?\" \"Come along, miss.\" \"I want to give her something.\" Bevins shook his head. \"Lord Rayven won\u0027t like it.\" \"Then don\u0027t tell him.\" Rhianna smiled down at the girl. \"I\u0027ll take them all.\" A muscle clenched in Bevins\u0027s jaw as he reached into his coat pocket and withdrew a handful of coins. He wouldn\u0027t have to tell Rayven anything. The vampyre would know. The child\u0027s face lit up as she handed Rhianna the bouquet, then took the coins from Bevins. \"Thank you, lady,\" she exclaimed, clutching the money to her chest. \"Oh, thank you!\" Rhianna grinned as she watched the little girl run down the street. \"Shall we go?\" They had almost reached the carriage when she heard Montroy calling her name. Turning, she saw him striding toward her. \"Let\u0027s go, miss,\" Bevins urged. \"In a minute.\" She smiled up at Montroy as he took her hands in his. \"Hello, Dallon.\" \"Rhianna.\" He lifted one of her hands and kissed it. \"How pretty you look.\" \"So do you.\" Montroy grinned, pleased by her reply, and by her welcoming smile. \"Come along,\" he said. \"I\u0027ll buy you a cup of tea.\" \"All right.\" Bevins cleared his throat. \"Miss Rhianna, we need to go.\" \"Later,\" she said, placing her hand on Montroy\u0027s arm. \"I would remind you of your promise, miss,\" Bevins said sternly. \"What promise is that?\" Montroy asked. He glanced from Rhianna\u0027s face to Bevins\u0027s and back again. \"Nothing.\" She lifted her hand from his arm and took a step back. \"I promised to be home by... by...\" Her voice trailed off. She had no idea what time it was. \"By three, miss,\" Bevins interjected smoothly. \"We\u0027re late already.\" \"Yes, we are. I\u0027m sorry, my lord, but I really must go.\" \"Surely you have time for a cup of tea,\" Montroy urged. \"I can\u0027t, really. I\u0027m sorry.\" \"Very well, I shan\u0027t try to keep you.\" Montroy bowed over her hand, certain that Rayven had extracted her promise not to see him again. \"If you should ever tire of him, if he ever harms you in any way, come to me.\" \"Thank you, my lord. You\u0027re most kind.\" \"Be careful, Rhianna,\" Montroy said earnestly. \"Rayven is... Just be careful.\" \"I will. I really must go.\" He helped her into the carriage, stood watching as Bevins clucked to the horse. What hold did Rayven have over her, he wondered. Somehow, he would find out. \"Lord Rayven is very rich, isn\u0027t he?\" Rhianna remarked. She had sat in silence for some time, watching the countryside pass by. The fields were green and gold. Sheep grazed on the hillsides. Bevins nodded. Rich did not begin to describe his master\u0027s wealth. \"He should do more with his money,\" Rhianna mused. \"He could ease the suffering of so many.\" Bevins smiled in spite of himself as he imagined Lord Rayven walking among the town\u0027s peasants, his black cloak billowing around him as he scattered gold coins like confetti. \"Don\u0027t you think so?\" Rhianna asked. \"It isn\u0027t my place to tell Lord Rayven what to do, Miss Rhianna.\" Bevins turned to face her. \"Nor yours.\" With a little humph of pique, Rhianna sat back, her arms folded over her breasts. Somehow, she would find a way to convince Rayven to ease the poverty in the village. Later that night, Rhianna sat at the table, staring, unseeing, into the bowl of mutton stew growing cold in front of her. All thoughts of helping the poor in the village had fled her mind as she contemplated seeing Rayven again. How strange life was! When she wanted to stay, he wanted her to go. When she wanted to go, he urged her to stay. Had she imagined it all, she wondered, the disconcerting vision of that man being pursued by darkness, the sense of evil? Her fear had been real enough, but it seemed foolish now. Rayven would not harm her. Now you know what I need. What had he meant by those cryptic words? And then he was there, filling the room with his presence. Clad in a loose-fitting white shirt, snug black breeches, and soft leather boots, he crossed the room on silent feet to take the chair opposite hers. \"Good evening, sweet Rhianna.\" She inclined her head in his direction. \"My lord.\" \"No appetite this evening?\" he asked, gesturing at the untouched bowl of stew in front of her. Rhianna sighed. \"I\u0027m not very hungry.\" A shadow of concern passed over his face and then was gone. \"Are you well?\" \"Well enough. Might I ask you something?\" \"You may ask me anything.\" \"But you won\u0027t answer.\" \"What do you want, Rhianna?\" \"A favor.\" He lifted one black brow. \"Another boon?\" \"I want to help the people in the village. Many of them have had a bad year.\" \"And you intend to help? How?\" \"There\u0027s a deserted storehouse near the end of town. I\u0027d like to turn it into a shelter to house the poor.\" \"Indeed?\" Rhianna nodded, warming to the subject. \"It wouldn\u0027t have to be anything elaborate. Just some beds, really.\" \"You don\u0027t want me to feed them, too?\" \"Of course. I thought we could ask John Duns-more if he\u0027d send food over at night. And milk for the wee ones.\" \"And you want me to fund this endeavor?\" \"Yes.\" He smiled faintly, amused by the idea of feeding those who had, on occasion, nourished his own hunger. \"Let Bevins take care of it,\" he said. \"I don\u0027t want you directly involved.\" \"Why not?\" \"I want you here.\" \"But there\u0027s nothing for me to do all day.\" \"I thought you were going to replant the gar-dens.\" She had forgotten that for the moment, but she couldn\u0027t spend all her time among the flowers, and said so. \"I want you here,\" he repeated firmly. \"You take care of the gardens, Rhianna, and I\u0027ll have Bevins procure the warehouse and stock it with beds and whatever else you think necessary.\" \"You\u0027re most kind, my lord.\" \"You\u0027re to tell no one about this,\" Rayven said. \"I\u0027ll have your promise.\" \"You have it.\" \"Are you going to finish your supper?\" Rhianna shook her head. \"No.\" \"Come then,\" he said, rising. \"I wish to go for a walk.\" Bevins was waiting for them at the door. He handed Rayven his cloak, then draped a light cot-ton shawl around Rhianna\u0027s shoulders. She frowned as she stepped outside. How had Bevins known they were going outside? The night was cool, but not cold. A bright yellow moon hung low in the sky. Millions of stars twinkled above, sparkling like tiny diamonds against a bed of indigo velvet. Side by side, they walked down one of the narrow paths. She knew somehow that they would end up at the maze, and she wondered what there was about that one place that drew Rayven to it. \"How is your mother?\" Rayven asked after a lengthy silence. \"She\u0027s fine. She wants me to come home. I\u0027m afraid she doesn\u0027t understand why I\u0027ve decided to stay here.\" He said nothing. \"My sister\u0027s getting married soon. Will you come to the wedding?\" \"I\u0027ve not been invited.\" \"I\u0027m inviting you.\" \"When is the happy occasion to take place?\" \"This Sunday evening, after Mass.\" \"I doubt I should be welcome.\" \"I should very much like you to be my escort.\" She smiled up at him. \"I\u0027m sure Bevins would like a night off.\" \"I\u0027ll think about it.\" \"All right.\" They were in the maze now. As always, the place filled her with apprehension, though she could not say why. There was nothing to fear. When they reached the heart of the labyrinth, Rayven sat down on one of the wrought-iron benches and indicated she should sit beside him. Suddenly nervous, Rhianna sat down beside him, smoothing her skirts in place. Rayven sat back, his arms crossed over his chest. \"You saw Montroy today.\" Rhianna licked lips suddenly dry. \"Yes, my lord.\" \"Tell me what happened.\" \"Why don\u0027t you tell me? You seem to know everything I say and do.\" She regarded him through narrowed eyes. \"I\u0027d like to know how you manage that.\" \"I can read your mind, my sweet.\" \"That\u0027s impossible.\" \"Is it?\" \"Isn\u0027t it?\" She stared at him, wondering if he was telling the truth. \"You promised not to meet him while you lived here, with me.\" \"We didn\u0027t \u0027meet.\u0027 I saw him on the street and he said hello.\" \"And invited you to tea.\" \"Bevins told you, didn\u0027t he?\" Rayven shook his head. \"I can smell Montroy on you,\" he said quietly. \"Montroy smells of expensive tobacco and horse and a rather strong cologne.\" Rhianna felt her heart skip a beat as Rayven studied her, his nostrils flaring as he took a deep breath. \"You carry the scent of the tea and toast you had for breakfast, the lavender soap you bathed with,\" he said, his voice moving over her like a caress. \"You had mutton and potatoes for lunch. Your hands smell of primroses and peppermint. There\u0027s a faint scent of powder and perfume. And overall,\" he went on, his voice low and intimate, \"the unique fragrance that is yours, and yours alone.\" Rhianna could only stare at him, stunned by his words. How could he know such things? He didn\u0027t tell her that he could hear the sound of the blood flowing in her veins, or that, if he opened his mind, he could hear the voices of the people in the village - their laughter, their tears, the harsh breathing of those who were ill, the prayers of the hopeful, the desperate, the dying. He could hear their thoughts, sense their presence. He knew their fears. And yet he was ever on the outside of life, looking in. He closed his eyes, and his senses filled with the woman at his side. She reminded him of sunshine and roses on a warm summer day. Her hair, her skin, carried myriad scents that called to him, arousing the beast in him as well as the man. Rhianna. With a low groan, he reached for her, wishing he could bridge the vast gulf between them, wishing that, for one day, he could be a part of her life. He whispered her name as he dragged her into his arms and crushed her close. His kiss was tinged with desperation. Rhianna, Rhianna. She struggled against him, frightened by the rush of need that leaped from his lips to hers. A sense of hopelessness, of desolation, washed over her. Abruptly, he let her go. Rising, he turned his back to her and drew his cloak more closely around him. The heavy velvet molded itself to him. \"I didn\u0027t mean to frighten you.\" \"I begged you to make love to me not long ago,\" she reminded him. \"I offered myself to you freely. You needn\u0027t take me by force.\" \"Forgive me, Rhianna. Sometimes I forget who I am. What I am.\" \"What are you?\" \"Your worst dream come true.\" \"You\u0027re talking in riddles again.\" \"Shall I tell you the answers?\" he wondered aloud. \"Shall I tell you truths you will not believe and watch your eyes fill with revulsion? Shall I lower the mask I wear and watch you run screaming from my presence?\" He turned around to face her. His eyes gleamed, even in the darkness. His cloak shifted and rippled, as though trying to pull him away. \"I need you, Rhianna.\" In a single, fluid movement, he knelt in front of her and took her hand in his. His skin was firm, cool, belying the fire that blazed in his eyes. \"I need you,\" he said again, more fervently this time. \"Be patient with me, Rhianna.\" His dark gaze held hers, silent, imploring. \"I swear by all that I hold dear that I will not hurt you.\" \"You worry me, my lord,\" she murmured. \"Can you not explain what it is that troubles you so?\" \"I wish I could.\" The burden of the secret he had carried for over four hundred years weighed heavily upon him. What a relief it would be to tell her everything. As a man, he had once shed his sins by confessing them to a priest; he wondered now if he could ease the sadness, the loneliness, of centuries by confiding in Rhianna. Would she be able to understand? Would she be able to forgive him for the lives he had taken when first he\u0027d been made, when the hunger had been excruciating, when he\u0027d been afraid and confused? \"Look at me,\" he said. \"What do you see?\" She gazed into his eyes, felt an ache in her heart, an ache that spread to her soul and brought tears to her eyes. \"Darkness. Sadness. Loneliness.\" His gaze burned into hers. \"What else do you see?\" \"Don\u0027t ask me,\" she begged. \"I cannot bear it.\" \"Rhianna...\" \"I see death wrapped in darkness. And blood. So much blood. On your hands...\" She lowered her head to stare at their joined hands, then slowly met his gaze again. \"Who are you? What are you?\" \"Swear to me on the life of your mother that you will not leave me if I tell you.\" \"I have already promised to stay a year.\" He shook his head, his fingers tightening around hers. \"Swear it.\" \"I swear on the life of my mother that I will not leave you.\" \"Then look deep into my eyes, Rhianna, and see the truth for yourself.\" His eyes were deep and black and filled with the mysteries of the universe. They drew her in, until she saw nothing else, and then, rising up out of a black mist, she saw Rayven. He looked as he did now, save there was no scar on his cheek. His eyes, though black, seemed more alive; his face and arms were browned by the sun. And then she saw a woman. She felt Rayven\u0027s hand squeeze hers and knew, in a distant part of her mind, that she was seeing his past. But how was that possible? \"Her name is Lysandra.\" She heard Rayven\u0027s voice, speaking softly in her mind. He had seen her first at court. He had been a knight in those days, a warrior renowned for his pride, his bravery in battle. He was the boldest, the bravest, and proud of it. He had never been defeated in battle, nor unseated in tournament. Lysandra had been married to an earl - Rayven could no longer recall the man\u0027s name. He had seen Lysandra and been smitten at first glance. Clad in a gown of unrelieved white silk, her black hair arranged in curls atop her head, she had been the most beautiful woman he had ever seen. He had been unprepared for the heat that passed between them when her gaze met his. Her eyes were deep and black, like pools of liquid ebony. Her skin was pale, almost translucent, ever cool to the touch. Like a besotted fool, he had attended every gathering in hopes of seeing her again. He remembered the night he had first spoken with her, danced with her. Kissed her. Her lips had been as smooth and cool as iced satin. He had been charmed by her beauty, fascinated by the mystery that lurked in the depths of her eyes. He had never thought himself in love with her, but his lust had run hot, fueled by her come-hither smiles. Her kisses, stolen in dark corners and moonlit gardens, had left him feeling drugged and desperate for more. She had teased and tempted him for months, playing a game he\u0027d never had a chance of winning. Too late, he had learned it wasn\u0027t an affair she wanted, but his life. \"And so I was made Vampyre...\" His voice was still low. She heard it in her mind, but refused to accept what he was telling her. There was no such thing. It was not possible. \"She left me the night she made me,\" Rayven went on, his voice devoid of emotion. \"When I woke the next night, I was ravenous.\" \"Stop!\" Rhianna clapped her hands over her ears. \"I don\u0027t want to hear any more.\" He went on as though she hadn\u0027t spoken. His words rang clearly in her mind. Unable to shut them out, she clasped her hands in her lap. \"I had no one to tell me what was happening to me, no one to teach me how to be a vampyre. I shall never forgive her for that,\" he said, his voice laced with anger. \"I did not realize the awesome powers I possessed. I was driven by a hunger that was excruciating. \"In the beginning, I thought it would drive me mad. All I knew was that blood eased the pain, and that the sunlight that I had once loved now meant death. Even then, I didn\u0027t want to believe. And then, one night, I looked in a mirror...\" He had never forgotten the slow horror that had spread through him when he stared into that glass, expecting to see his image reflected back at him, and saw only the room behind him. \"I ran away from my home, from all who knew me. I had hoped that I would be able to live some semblance of a normal life in another place, that I would be able to marry and have children. I know now how foolish those hopes were, but in the beginning I didn\u0027t realize that I had lost all hope of living as a man. In time, I learned that I was not a man at all.\" Restless now, he stood up, his gaze fixed on something only he could see. \"I was in Italy when I met another vampyre. Salvatore was one of the ancient ones. He taught me what it meant to be a Vampyre, told me that I could be a monster, striking terror in the hearts of mortals, or I could hide myself away and live off the blood of beasts, or I could dwell somewhere in the middle, neither man nor monster. \"And that is what I have done. I never stay longer than fifteen or twenty years in any one place. I have already stayed here too long. Soon I shall go to one of my other dwellings and stay there until people began to talk about my strange way of living, until they begin to notice that I do not age, and then I shall move again.\" \"You\u0027re telling me the truth, aren\u0027t you? You\u0027re not making this up just to scare me?\" Rayven nodded. \"What about Bevins? Does he know what you are?\" \"Of course. We are more than master and servant. My blood runs in his veins.\" There had been times when taking blood from Bevins had meant the difference between life and death. Yet he had never taken enough to bequeath the Dark Gift to his servant. In over four hundred years, he had never made another Vampyre. \"You fed on him?\" He didn\u0027t miss the quick look of revulsion in her eyes. He nodded curtly, wondering if she would ask the question he dreaded. \"When you bought me from my father, were you going to feed on me, too?\" So, he thought, there it was. He took a deep breath and then, very slowly, he nodded. \"But you didn\u0027t?\" She lifted her hands to her neck, her fingers exploring. There were no marks. Relief whooshed from her lungs in a deep sigh. And then she frowned. There had been marks once, soon after she came to the castle the first time. She had asked Bevins to look at them for her, and he had assured her there was nothing to worry about. \"I rarely drank from your neck,\" Rayven said quietly, \"and when I did, I had only to run my tongue over the wounds to heal them.\" But he had forgotten that one night. \"You drank my blood?\" She stared at him, wondering why the idea didn\u0027t repulse her. She should be fainting or screaming hysterically. She should be horrified. Instead, she felt remarkably calm, as if she were listening to a story that had nothing to do with her. \"No more than a thimbleful at a time.\" He took a step back. His cloak wrapped around him, enfolding him. \"Had I given you my blood in return, we would be bonded.\" \"What does that mean, bonded?\" \"It means you would be able to read my thoughts as I can read yours.\" \"That\u0027s what you\u0027ve done to Bevins, isn\u0027t it? He\u0027s your slave?\" \"No. We share only a bond.\" A bond born of blood and a vow. That didn\u0027t seem so bad, Rhianna mused. She wished she could read his thoughts now. Perhaps then she would be better able to understand him. \"There\u0027s another bond,\" Rayven said. \"A deeper bond, one more binding.\" \"Oh?\" She wasn\u0027t sure she wanted to hear it. \"It\u0027s a bond that cannot be broken except by death. Mine, or yours. You don\u0027t know how I\u0027ve longed to make you mine, Rhianna, to bind you to me. And yet I could not, for to do so would be to take away your freedom, and I found I could not do that to you.\" \"Why have you told me all this?\" Rayven took a deep breath. \"I needed to tell someone. After four hundred years, I wanted someone to understand.\" Slowly, he shook his head. \"I know now that is impossible.\" \"You\u0027ve been alive for over four hundred years?\" He shook his head, a rueful grin on his lips. \"I was alive for twenty-seven years. I have been Vampyre for four hundred and three.\" \"But that would mean you were born in...\" \"Fourteen hundred and twelve, my sweet.\" \"It\u0027s not possible.\" He said nothing, simply watched her through fathomless black eyes. \"And you drink human blood to survive?\" \"Rarely, and only a little at a time.\" \"How can you?\" she asked, repelled. How to explain it to her, to make her understand that it wasn\u0027t awful? He shook his head and then sighed, knowing she deserved an answer, abhorrent as it might be. \"I don\u0027t know how to describe it to you, Rhianna. There\u0027s nothing in your experience I can compare it to. When I drink, it\u0027s like becoming a part of that person. I can feel the beat of their heart; I know their thoughts, their fears. You cannot imagine what it\u0027s like - the power, the hunger. Before I learned to control it, when I thought I had to take a life to survive...\"He shook his head again. \"I can\u0027t explain it.\" \"If you no longer drink human blood, what do you drink? What is it that Bevins brings you in the evening?\" \"It\u0027s wine mixed with blood. From sheep, usually, although any kind of blood will do.\" But he needed human blood, as well, though he didn\u0027t tell her that. It was why he had bought Rhianna in the first place. There was a freshness, a strength, in the pure, sweet blood of a virgin that could be found nowhere else. \"You drink the blood of sheep?\" \"I keep a small flock on the north side of the castle beyond the gate.\" \"Oh?\" She was staring at him, her expression dazed. \"I\u0027ve sickened you, haven\u0027t I?\" \"A little,\" she admitted. But, mostly, she felt sorry for him. Four hundred years of living alone, never able to trust another living soul. Four hundred years since he had seen the sun, felt its warmth on his face. Four hundred years since he had tasted food, drunk a glass of cool, clear water. Four hundred years without a friend to confide in, a woman to love. She envisioned him bending over her, his teeth piercing her flesh, drinking her blood. Tried to imagine herself living as he lived, forever cursed to dwell in darkness, to forego the simple pleasures of life. Wanting to comfort him somehow, she gazed deep into his eyes and there, in the inky black depths, she caught an image of Rayven as he had been four hundred years ago. The pain and fear and rage he had experienced when he first became Vampyre, the centuries of loneliness that had followed, and overall the never-ending scent of blood and death. He was a vampyre. Child of Darkness. Undead... Darkness engulfed her, deeper than hell, darker than black. With a strangled sob, she felt herself slipping into a swirling vortex that had no beginning and no end.","sourceLink":"https://allnovel.net/a-darker-dream/page-14.html","bookId":2309,"book":{"id":2309,"title":"A Darker Dream","description":"Storyline: In four hundred years, Rayven has never met a woman like Rhianna McLeod. She is a vision of light, of warmth, of everything he is not—nor can ever be. Doomed to live forever in darkness and solitude, he knows all too well the risk of getting close to her, yet he hungers for her with a fierce passion he\u0027s sworn he\u0027ll never allow himself to feel. Rhianna\u0027s father sells her to Rayven to put food on the table—so she has no choice but to go with the dark stranger. To her surprise, he gives her everything she wants—the finest clothes, education, and the run of the castle—everything, that is, except his touch. For although she senses danger beneath his soft-spoken manner, although even Rayven himself warns her away, she is drawn to this creature of the night, and loves him as she can no other.","cover":"https://allnovel.net/images/a-darker-dream.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-darker-dream.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:15:06 PM"}}
