{"id":95552,"no":16,"title":"Page 16","content":"She didn\u0027t leave. She spent a sleepless night, remembering everything he had said, everything that had passed between them since that fateful night at Cotyer\u0027s, and when dawn came, she knew she couldn\u0027t leave him.\\n\\n She had expected him to be glad, to spend his every waking moment in her company. Instead, she had the feeling he was avoiding her. Though he joined her each night at supper, he seemed withdrawn. She had thought, after what he\u0027d told her, after the day she had spent sleeping beside him, that he would take her to his bed. Instead, he held her at arm\u0027s length, his gaze warning her to keep her distance. It was most confusing.\\n\\n Tonight, he was late. She picked at her food, wondering if she had dreamed the whole thing. In the cold light of day, all he had told her seemed like a fable - reading minds and magical cloaks, living on the blood of sheep mixed with wine, being forced to live forever in the darkness. It was inconceivable.\\n\\n She sensed his presence even before he entered the dining room. Looking up, her gaze met his, and she knew that it was all true. He was a vampyre. Alive and yet dead. It explained so much: the despair she sometimes saw in his eyes, why she had never seen him during the light of day, why she never saw him eat, why his skin was ever cool to the touch.\\n\\n She felt a burst of hysterical laughter bubble in her throat. She had been afraid he had bought her to shame her, to defile her, when all he had wanted was to drink her blood.\\n\\n \"Hungry, my lord?\" she asked bitterly. Leaning back in her chair, she slowly and deliberately bared her throat to his gaze as all her dreams of a future with Rayven dissolved in a crimson sea of impossibility. He would not marry her. She would never bear his children.\\n\\n \"Rhianna, don\u0027t.\" He turned away from the revulsion in her eyes, from the sight of her bared throat, the pulse beating wildly. The scent of her despair, her blood, flooded his senses.\\n\\n \"I\u0027m sorry. Forgive me,\" she murmured, and burst into tears. She would leave this place in a few months.\\n\\n Someday she would marry. She would have children and grandchildren, but Rayven would still be here, locked in chains of eternal darkness, forever alone and lonely.\\n\\n \"Rhianna!\" Muttering an oath, he knelt in front of her and took her hands in his. \"Rhianna, don\u0027t cry.\\n\\n Please don\u0027t cry. I cannot abide your tears. You needn\u0027t stay here any longer. I\u0027ll send you home tomorrow. Tonight, if you wish. Only please don\u0027t cry.\"\\n\\n \"I\u0027m not crying for me,\" she said.\\n\\n He stared up at her, stunned by the realization that she was weeping for him.\\n\\n \"Is there nothing that can be done for you?\" she asked, sniffing back her tears.\\n\\n \"Done for me?\" he asked, frowning.\\n\\n \"Can you never be mortal again?\"\\n\\n Slowly, he shook his head. \"No.\"\\n\\n \"I\u0027ll stay with you,\" she promised. \"I\u0027ll stay as long as you want me.\"\\n\\n \"Ah, Rhianna, you have no idea how that tempts me.\" Never to be alone again. To have someone to share his life. He would show her the world, shower her with diamonds and emeralds, grant her anything she desired. She would never want for anything. She could sleep days at his side. Her face would send him to sleep and welcome him when he awoke...\\n\\n Slowly, he shook his head. He could not condemn her to the kind of life he led, expect her to shun the daylight, to spend her life with a man who was not a man at all, simply to ease his loneliness. He might be a monster, but even he could not be that cruel.\\n\\n His loneliness, the complete and utter sadness in the depths of his eyes, caught at her heart and made her soul weep. \"Don\u0027t send me away,\" she begged softly. Leaning forward, she pressed a kiss to his brow.\\n\\n He slipped his arms around her waist, his face pressed against her breasts. Her warmth engulfed him, dispelling the cold that was his constant companion as sunlight chased away the chill of night.\\n\\n \"I won\u0027t.\" He drew in a shaky breath. \"God forgive me, I won\u0027t.\"\\n\\n A sense of peace, of coming home, filled her soul as she stroked his hair.\\n\\n \"My sister is to wed on the morrow,\" she reminded him. \"Say you\u0027ll come with me to the wedding.\"\\n\\n \"If you wish.\" He no longer seemed to have any will of his own, he thought with wry amusement. She spoke, and he yearned only to obey.\\n\\n \"I do.\" He looked up to see her smiling down at him. \"You are most agreeable, my lord.\"\\n\\n \"It seems I can deny you nothing.\"\\n\\n \"Nothing, my lord Rayven?\"\\n\\n \"What would you have now, Rhianna? A chest filled with sapphires to rival the color of your eyes? Gold to match the color of your hair?\"\\n\\n \"What I want is of infinitely more worth, my lord.\"\\n\\n \"I cannot imagine what it might be.\"\\n\\n \"Can\u0027t you?\"\\n\\n She was flirting with him, he mused. And quite brazenly, too. \"Tell me, my sweet, and it\u0027s yours.\"\\n\\n \"A kiss,\" Rhianna said, drawing out the word until it was a caress. \"One kiss.\"\\n\\n \"Only one?\"\\n\\n \"Or two.\"\\n\\n \"Or twenty?\" Rayven murmured, covering her mouth with his.\\n\\n Rhianna made a low sound of assent deep in her throat as she wrapped her arms around his neck. This was what she wanted, she thought as his touch drugged her senses. To be here, in his arms, for the rest of her life.\\n\\n Time ceased to have meaning as his tongue stroked her lower lip, as his hands slid up her rib cage, his thumbs lightly stroking her breasts.\\n\\n \"Rayven... please...\"\\n\\n He drew back to look at her. His breathing was ragged, his eyes alight with a fierce inner glow.\\n\\n \"Don\u0027t turn me away again,\" she pleaded softly.\\n\\n \"Rhianna, I want you more than you can imagine...\"\\n\\n \"But?\"\\n\\n \"I\u0027m afraid I\u0027ll hurt you, that...\"\\n\\n \"What?\"\\n\\n \"Rhianna, I can\u0027t always separate my desire from the hunger that plagues me. I\u0027m afraid that, in the heat of passion, the lust for blood will overcome my self-control.\"\\n\\n \"Does it always happen that way?\"\\n\\n \"I don\u0027t know. I\u0027ve only taken one woman to my bed since I was made Vampyre.\"\\n\\n \"Only one? In four hundred years?\"\\n\\n \"The lust for blood has ever been more powerful than the lust of the flesh.\" Until Rhianna, he thought.\\n\\n Until she came and threaded hope into the lonely tapestry of his life.\\n\\n \"What happened to that girl?\"\\n\\n \"She died in my arms.\"\\n\\n Rhianna sat back in the chair, unable to suppress the shudder of fear that skittered down her spine.\\n\\n \"Rhianna, I could not live with the guilt if anything I did should cause you harm.\"\\n\\n \"Have you... taken nourishment this evening?\"\\n\\n \"Yes.\" Knowing he would see her, remembering what it had been like to hold her while he slept, he had fed, and fed well.\\n\\n \"Are you hungry now?\"\\n\\n He shook his head, the certainty of what was coming next exciting him even as it filled him with a sense of dread.\\n\\n He needed her, needed her as surely as she needed him. Knowing that gave her the courage to shake off her fear. Rising to her feet, she took his hand and drew him up beside her. \"I\u0027ve waited for you long enough, my lord.\"\\n\\n The words were spoken so softly, he doubted a mere mortal could have heard them.\\n\\n Rayven shook his head. \"I cannot, Rhianna. Please do not ask this of me.\"\\n\\n \"I\u0027m not afraid.\"\\n\\n His fingers curled over her shoulders. \"But I am.\"\\n\\n \"Did you love that other girl?\"\\n\\n \"No.\"\\n\\n \"Do you love me?\"\\n\\n He nodded, unable to deny it.\\n\\n Her smile was as bright as the sunlight he would never see again, as warm as a mother\u0027s love.\\n\\n \"You\u0027re sure this is what you want, Rhianna?\"\\n\\n For answer, she took his hand in hers and turned toward the door.\\n\\n Helpless to resist, he followed her up the winding staircase to her room.\\n\\n Inside, her courage seemed to desert her, and she stared up at him, her eyes wide and uncertain.\\n\\n \"We don\u0027t have to do this,\" Rayven said.\\n\\n \"No, I want to. I just don\u0027t know what\u0027s expected of me.\"\\n\\n \"We could start with a kiss,\" Rayven suggested, hoping it would put them both at ease.\\n\\n He drew her into his arms, felt the nervous tremors that shook her from head to foot.\\n\\n \"Rhianna.\" He murmured her name as he claimed her lips.\\n\\n She was sweeter than honey, warmer than a summer day. It was like standing next to a ray of sunshine, he thought. Holding her in his arms chased away the chill that seemed ever to hold him in its grasp, and he drew her closer, absorbing the heat of her, the softness. Her breasts were crushed against his chest; he could feel the rapid beat of her heart, sense the passion blossoming within her.\\n\\n She responded to his kiss ardently, pressing herself against him, her arms sliding around his neck. She moaned softly as his lips slid over her throat, along her shoulder.\\n\\n \"Rhianna, Rhianna, do you know how often I have dreamed of this moment?\"\\n\\n She made a wordless sound of assent, drawing back a little so she could see his face. The heat in his eyes threatened to scorch her very soul, and she thought how wonderful it was that an innocent such as she could arouse such a man.\\n\\n He released her long enough to remove his cloak. She watched as he tossed it over a chair, felt her breath catch in her throat as she caught sight of herself in the mirror.\\n\\n For a moment, it was as if the world came to a stop and she saw everything in frozen moments of time: her reflection, her hair slightly mussed, her cheeks rosy, her lips slightly swollen from his kisses. She saw his cloak, spread like a river of velvet blackness over the chair. She saw the bed behind her. But Rayven, who stood beside her, cast no reflection in the glass.\\n\\n Startled, she glanced at him, assuring herself that he was there. She looked in the mirror again, felt the blood drain from her face.\\n\\n \"What is it?\" Rayven looked at her askance and then, slowly, he followed her gaze. Her image stared back at him from the mirror, her blue eyes wide, her face ashen. \"Rhianna?\"\\n\\n \"I... You...\" She drew in a deep breath, let it out in a long, shaky sigh. \"The mirror... You don\u0027t... Why can\u0027t I see you?\"\\n\\n He went suddenly still. \"I\u0027m not sure,\" he replied stiffly. \"There are many theories, the foremost being that vampyres cast no reflection because they are composed of unnatural flesh.\"\\n\\n Vampyre... She knew that was what he was, but she had refused to dwell on it, had tried to pretend that it didn\u0027t matter, that it was some sort of rare disease rather than a state of being. She knew now why there had been no mirrors in the castle, knew the heavy draperies over the windows weren\u0027t there simply to shut out the light.\\n\\n Taking a step back, she gazed up at him. In an unconscious gesture of self-protection, she crossed her arms over her breasts.\\n\\n Rayven did not miss the significance of her action. Drawing himself up to his full height, he moved to the far side of the room. \"I told you what I am,\" he said, his voice cold and slightly defensive.\\n\\n \"I know, but I guess I never really realized what it meant. It doesn\u0027t matter. Truly, it doesn\u0027t. It just startled me for a moment.\"\\n\\n \"Startled?\" He lifted one black brow in bitter amusement.\\n\\n \"You look ready to faint.\"\\n\\n \"Do I?\" She smiled wanly. \"Can you blame me?\"\\n\\n \"No. This isn\u0027t going to work, Rhianna. I\u0027ll have Bevins take you home in the morning.\"\\n\\n \"No!\" She hurried across the floor and placed her hands on his shoulders. \"It doesn\u0027t matter.\" She gestured at the mirror. \"I just didn\u0027t know about this. You never said...\" She crossed her arms over her breasts again, suddenly remembering that he had imparted this knowledge to her when he told her about Lysandra and how he had become a vampyre. \"I\u0027m sorry, I forgot.\"\\n\\n She thought of all the other things he had told her about vampyres. It had all sounded so unreal, so improbable. She knew now that, in spite of his ability to open and close doors and start fires with the power of his thoughts, in spite of his need for blood, deep down, she hadn\u0027t really believed he was a vampyre. \"Is there anything else I should know? I mean, I\u0027ve heard stories about vampyres, of course, but...\"\\n\\n She bit down on her lower lip to stop her inane babbling. Even after all she had seen, after all he had said, she didn\u0027t want to believe it was true. Tears stung her eyes as she looked up at him, hoping he would tell her it had all been some horrid mistake.\\n\\n \"Ah, Rhianna, you are so young, and I feel so very old.\"\\n\\n \"Tell me.\"\\n\\n \"I believe I\u0027ve told you everything you need to know.\" His gaze moved to the slender column of her neck, to the pulse that throbbed so invitingly. The scent of her blood teased his nostrils.\\n\\n Overcome with tenderness, he took her hands in his and kissed each one, his lips cool against her flesh.\\n\\n \"I think I\u0027d better go.\"\\n\\n \"But... I thought that...\"\\n\\n \"Another time, Rhianna.\"\\n\\n He was both relieved and disappointed when she didn\u0027t argue.\\n\\n \"Will I see you tomorrow night, my lord?\"\\n\\n \"If you wish.\"\\n\\n \"Will you accompany me to my sister\u0027s wedding?\"\\n\\n \"Do you think that would be wise?\"\\n\\n \"I don\u0027t know. Perhaps it would be good for you to spend more time with people and less time locked away in this castle.\"\\n\\n He looked skeptical. \"What time is the wedding?\"\\n\\n \"Seven, my lord, at Millbrae Chapel.\" Rhianna bit down on her lower lip. \"Can you... I mean, you won\u0027t... ?\"\\n\\n He laughed softly. \"I assure you, the church will not collapse if I enter, my sweet. Nor will I disintegrate into a smoldering pile of ash.\" Bending, he pressed his lips to the top of her head. \"Until tomorrow night.\" \\n\\n","sourceLink":"https://allnovel.net/a-darker-dream/page-16.html","bookId":2309,"book":{"id":2309,"title":"A Darker Dream","description":"Storyline: In four hundred years, Rayven has never met a woman like Rhianna McLeod. She is a vision of light, of warmth, of everything he is not—nor can ever be. Doomed to live forever in darkness and solitude, he knows all too well the risk of getting close to her, yet he hungers for her with a fierce passion he\u0027s sworn he\u0027ll never allow himself to feel. \\n Rhianna\u0027s father sells her to Rayven to put food on the table—so she has no choice but to go with the dark stranger. To her surprise, he gives her everything she wants—the finest clothes, education, and the run of the castle—everything, that is, except his touch. For although she senses danger beneath his soft-spoken manner, although even Rayven himself warns her away, she is drawn to this creature of the night, and loves him as she can no other.\\n","cover":"https://allnovel.net/images/a-darker-dream.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-darker-dream.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:15:06 PM"}}
