{"id":95538,"no":2,"title":"Page 2","content":"I hide in the shadows\n and lust for the light\n For I am Vampyre\n forever imprisoned by the night.\n Millbrae Valley, 1843\n Rayven sat back in his chair, trying unsuccessfully to mask his disgust as he watched Vincent McLeod attempt to auction off the eldest of his five daughters.\n Head down, hands limp at her sides, the girl stood mute, like a beast bound for slaughter. Her hair, a dull dirty blond, tumbled over her shoulders, hiding her face as effectively as the shapeless gray dress hid the body beneath.\n \"See here, Rayven,\" Montroy complained. \"Can\u0027t we have a little more light?\"\n Rayven shook his head. The room was dark, and he liked it that way - dark wood paneled the walls, a dark green carpet covered the floor, matching draperies hung at the windows, the lamps were turned low, as always. Anyone who shared the back room of Cotyer\u0027s Tavern with him knew he avoided bright light. It was one of his many quirks, one the rich young men of the town endured for the sake of being in his rather questionable company.\n \"Well, if we can\u0027t turn up the lamps, then have the girl disrobe,\" Lord Tewksbury called from the back of the room. \"I refuse to bid on a pig in a poke.\"\n \"Aye,\" Nevel Jackson agreed. \"Tell the girl to peel off those rags so we can see what we\u0027re buying.\"\n The call was taken up around the room. Vincent McLeod hesitated, then whispered something to the girl. Head still bowed, she began to unlace the bodice of her dress.\n Rayven watched through narrowed eyes, noticing the way the girl\u0027s hands trembled as she unfastened the shabby frock. Though he could not see her face, he knew her cheeks were flushed with embarrassment, knew her heart was pounding like that of a fawn caught in the jaws of a wolf.\n \"Enough.\" Just one word, softly spoken, but it carried throughout the room.\n \"See here, Rayven,\" Tewksbury protested. \"I think...\"\n Rayven silenced him with a quelling glance. \"The girl is mine,\" he declared, having decided, in that moment, to buy her, though he still had not seen her face.\n \"Seeking a new mistress?\" Lord Montroy inquired.\n \"No.\"\n \"A housemaid, perhaps?\"\n Rayven met Montroy\u0027s gaze. Dallon Montroy was a tall, good-looking man, almost as wealthy as Rayven himself. Of all the men Rayven gambled with, Montroy came closest to being a friend.\n Ignoring the viscount\u0027s question, Rayven waved to the old man. \"Bring her here.\"\n \"Aye, milord.\" Hastily, Vincent McLeod grabbed his daughter by the arm and dragged her across the room. \"You won\u0027t be disappointed, milord. She\u0027ll serve you well.\"\n \"Yes,\" Rayven murmured. \"She will, indeed.\"\n Reaching into his pocket, Rayven brought out a handful of bank notes and thrust them at the other man.\n \"Has she a name?\"\n \"Of course, milord. It\u0027s Rhianna, but she\u0027ll answer to anything you wish to call her.\"\n \"You know where I live?\"\n \"Aye, sir.\" Everyone knew of Rayven\u0027s castle. Located at the top of Devil Tree Mountain, it stood like a sentinel over the town, tall, dark, and mysterious, like its master.\n \"Take her there. My man will look after her.\"\n \"Aye, milord.\"\n Rayven waved his hand in a gesture of dismissal. Turning back to the game, he picked up his cards.\n \"You lose again, Montroy,\" he drawled softly, and spread his hand on the table.\n Dallon Montroy tossed his cards into the pot. \"Seems to be your lucky night,\" he remarked good-naturedly.\n Rayven grunted softly. \"Perhaps you\u0027re right,\" he mused as he watched the girl follow old man McLeod out the door. \"Perhaps you\u0027re right.\"\n Rhianna huddled on the narrow wagon seat beside her father, unable to control her body\u0027s trembling, or to accept the fact that her father had sold her to a man like Lord Rayven, a man who was rumored to have many strange and unusual habits.\n The spires of Castle Rayven loomed in the distance, a dark shape rising out of the smoky gray mist that shrouded Devil Tree Mountain both summer and winter.\n With each passing mile, her trepidation increased. She thought briefly of jumping out of the wagon and taking her chances with the wild animals that lurked in the woods.\n She was gathering her courage, deciding death would be preferable to a life of servitude to the mysterious Lord Rayven, when she felt her father\u0027s hand close around her arm.\n \"Rayven paid me a handsome sum for ye,\" McLeod said, his mild tone at odds with his vice-like grip.\n \"Ye\u0027ll stay with him so long as he wants ye, and do whatever he asks without question. Do ye ken my meaning?\"\n \"Aye, father.\"\n McLeod nodded. A short time later, he parked the wagon in front of the castle. \"Go on, girl.\"\n Rhianna slid a glance at her father, trying not to hate him for what he was doing, trying to feel some sense of satisfaction in knowing that the money her father had received would buy food for her mother and younger sisters.\n \"There was no other way, lass,\" Vincent McLeod said in gruff apology.\n Rhianna nodded. Most likely, she would never see her father again. She had lived in Millbrae Valley all her life. She was not ignorant of the tales told of Castle Rayven\u0027s dark lord.\n \"Good-bye, Da.\"\n \"Good-bye, lass.\" McLeod met her gaze briefly, then looked away. He knew some would condemn him for selling his own flesh and blood, but she would be better off with Rayven. At least she would have enough to eat. \"Ye\u0027ve always made me proud, Rhianna,\" he said brusquely. \"Go on with ye now.\"\n Blinking back tears, Rhianna alighted from the wagon. Squaring her shoulders, she walked up the narrow stone steps to the wide double doors, took a deep breath, and lifted the heavy brass knocker.\n Moments later, the door creaked open, and Rhianna found herself staring into a pair of hooded brown eyes.\n \"Miss McLeod, I presume.\"\n \"Y... yes,\" she stammered, startled that the stranger knew her name, that he had been expecting her.\n How had he known she was coming?\n \"I am Bevins.\"\n The man stepped back, gesturing for her to enter. He was a tall man, with wavy gray hair, a rather sharp nose, and thin lips. He wore a pair of tan trousers, a white shirt, and a dark tweed jacket. He looked as if he was at least as old as her father.\n Feeling abandoned and very much alone, Rhianna stepped over the threshold. The entry way was cold and dark. She shivered as Bevins closed the heavy door behind her.\n \"I have a bath prepared for you, miss.\"\n \"Thank you.\"\n \"This way.\"\n Pulse racing with apprehension, she followed him down a long narrow hallway, up a steep flight of stairs, into a large room that was lit by a single fat white candle.\n \"You will find the tub in there,\" Bevins said, pointing to a door across the room. \"Please leave your clothes out here, on the floor. I have been instructed to burn them.\"\n \"Burn them! But they\u0027re all I have.\"\n \"No doubt Lord Rayven will provide you with suitable attire, miss. There are clean sheets on the bed.\n The bellpull is there, should you have need of me during the night.\"\n Too stunned to speak, Rhianna nodded.\n \"Good night, miss. Sleep well.\"\n She waited until he left the room, then went to the door and closed it. Undressing, she dropped her clothes on the floor, then went into the other room. The light from a dozen candles revealed a large tub of hot water, a bar of scented soap, and a length of heavy toweling.\n She stared at the steaming water. Never in all her life had she had a bath drawn for her and her alone. At home, baths were infrequent. In the summer, she bathed in the river. Only in the winter did they bathe indoors, and then she had to wait her turn. Usually, by the time she got in, the water was cool. And dirty.\n She stepped carefully into the tub and sat down, a contented sigh escaping her lips as the blissfully hot water closed around her. Perhaps living here would not be so bad. The two rooms she had been given were larger than the hut she shared with her parents and sisters.\n She washed her hair three times, her body twice, and still she sat in the water, basking in its warmth, until the water grew cool.\n Stepping out of the tub, she dried off, then wrapped herself in the towel and went into the bedroom. The first thing she noticed was that her clothes were gone. And then she saw the nightgown. It lay on the bed like a splash of white paint against the blue coverlet. Unable to resist, she ran her hand over the material.\n Dropping the towel, she lifted the gown over her head, sighing with pleasure as the garment slithered over her bare skin.\n She glanced around the room, hoping to find a mirror, curious to see how she looked in such a costly gown, but to no avail.\n Crossing the floor, she drew the heavy draperies away from the window and peered at her reflection in the glass. The material clung to her like a second skin, outlining her breasts, the curve of her hip.\n \"Silk,\" she murmured, running one hand over the gown in disbelief. \"It feels like silk.\"\n \"And so it is.\"\n Releasing the curtains, Rhianna whirled around, her arms crossed over her breasts in an age-old feminine gesture. \"My lord, I didn\u0027t hear you come in.\"\n \"Do you like the gown?\"\n \"Y... yes,\" she stammered. \"V... very much.\"\n Rayven regarded her through narrowed eyes.\n Cleaned up, with her hair falling in damp waves down her back, she was quite the loveliest thing he had ever seen.\n He took a step forward, his hand reaching to touch a smooth, peach-colored cheek.\n With a little cry, she backed against the wall.\n Immediately, Rayven lowered his hand. \"I will not hurt you,\" he said quietly.\n Rhianna swallowed hard, mesmerized by his voice. It was deep and soft, yet strangely compelling, as were his eyes. Fathomless black eyes that looked old beyond their years. Eyes that seemed able to look into her and through her at the same time.\n Moving slowly, he closed the distance between them, stopping when he was only a breath away. She had not realized how tall he was. He loomed over her, his long black hair framing his face like a dark cloud. He was dressed all in black save for his shirt and a blood-red cravat loosely knotted at his throat.\n A thin white scar bisected his left cheek. His nose was straight and aristocratic, his lips full and sensual.\n She guessed him to be in his early thirties.\n Like a mouse mesmerized by a snake, she watched his hand move toward her, felt his fingertips stroke her cheek. His skin was smooth and cool.\n \"How old are you, girl?\"\n \"Fifteen, my lord.\"\n Rayven swore under his breath. He knew many girls her age were already married and had borne children. Still, he had not thought her quite so young. Not that it mattered. He had no designs upon her flesh, soft and smooth though it might be.\n \"Shall I... shall I get into bed, my lord?\"\n \"If you wish.\"\n He watched a blush stain her cheeks as she slid a glance at the bed.\n \"Should I...\" She gulped, the blush in her cheeks spreading down her neck. \"Should I disrobe?\"\n Rayven raised one brow, then shook his head. \"I\u0027ve no intention of bedding you, girl.\"\n \"No?\"\n The relief in her voice caused a sharp pain in the nether regions of a heart he had thought long past feeling. \"No.\"\n \"Then why...\" Her cheeks grew redder. \"I thought...\"\n \"I bought you for reasons of my own, sweet Rhianna,\" he replied, his voice as silky as the gown she wore.\n \"Might I ask what those reasons are?\"\n \"No.\" He turned away from her, his hands clenching at his sides. \"You may have the run of the castle, save for the rooms in the east tower. You are never to go there.\"\n \"Yes, my lord.\"\n \"Bevins will supply anything you wish. You have only to ask him.\"\n \"Anything?\" she asked.\n \"Anything. If you desire to paint, he will provide canvas and brushes. If you wish to play the pianoforte, he will instruct you. If you wish to pass your days reading, I have a rather extensive library.\"\n \"I don\u0027t know how to paint or play the pianoforte or read, my lord.\" She lowered her gaze. \"I don\u0027t know how to do anything.\"\n He swung around to face her, a curious light in his eyes. \"Would you like to learn?\"\n \"Yes, my lord,\" she said eagerly, \"very much.\"\n \"Bevins will teach you whatever you wish.\"\n \"Thank you, my lord.\"\n Rayven stared down at the girl. Her eyes were blue, like a summer sky, like the lake in the village where he had spent his youth. Deep blue eyes, filled with excitement. And fear.\n She was afraid of him. The thought cut deep, though he could not fault her for it.\n \"Bevins will take you shopping tomorrow. Buy whatever you need.\"\n \"You are most generous, my lord.\"\n \"Not at all, sweet Rhianna, for the price will be dear.\"\n Her eyes widened at the veiled threat in his voice. She clasped her hands together, hands that trembled violently.\n \"You have nothing to fear from me,\" he said. \"After tonight, you will not see me again.\"\n The fear in her eyes turned to bewilderment. \"My lord?\"\n \"Go to bed, girl.\"\n Rhianna scrambled into bed, her heart pounding wildly as he drew the covers up to her chin. She stared up at him, frightened and confused, yet fascinated by him at the same time. What a strange man he was.\n She had the oddest feeling that he had bought her simply to save her the embarrassment of disrobing before a roomful of half-drunken men. He was soft spoken and well mannered, yet she sensed a hint of carefully controlled violence lurking beneath the smooth facade, and beneath that smoldered an emotion more dangerous, more deadly, something she could not define. It was that which frightened her the most.\n \"Rest well, sweet Rhianna,\" Rayven murmured.\n He blew out the candle, and then he was gone. \n","sourceLink":"https://allnovel.net/a-darker-dream/page-2.html","bookId":2309,"book":{"id":2309,"title":"A Darker Dream","description":"Storyline: \n In four hundred years, Rayven has never met a woman like Rhianna McLeod. She is a vision of light, of warmth, of everything he is not—nor can ever be. Doomed to live forever in darkness and solitude, he knows all too well the risk of getting close to her, yet he hungers for her with a fierce passion he\u0027s sworn he\u0027ll never allow himself to feel. \n Rhianna\u0027s father sells her to Rayven to put food on the table—so she has no choice but to go with the dark stranger. To her surprise, he gives her everything she wants—the finest clothes, education, and the run of the castle—everything, that is, except his touch. For although she senses danger beneath his soft-spoken manner, although even Rayven himself warns her away, she is drawn to this creature of the night, and loves him as she can no other.\n \n","cover":"https://allnovel.net/images/a-darker-dream.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-darker-dream.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:15:06 PM"}}
