{"id":32307,"no":6,"title":"CHAPTER VI. — RECRUITING.","content":"On the Monday following the meeting at Durbelli猫re, Larochejaquelin, Denot, the Cur茅 of St. Laud, Foret and Cathelineau joined M. de Lescure at Clisson, and on the day afterwards, the soldiers of the Republic, when attempting to collect the conscripts at a small town near Clisson, were resisted and treated as they had been at St. Florent. There was not quite so much of a battle, for the officer in command knew what was likely to occur, and not having received any reinforcement of troops, thought it advisable to give in early in the day, and capitulate with the honours of war. He was allowed to march his men out of the town, each man having stipulated that he would not again serve in any detachment sent into La Vend茅e for the collection of conscripts; but they were not allowed to take their arms with them, muskets, bayonets, and gunpowder being too valuable to the insurgents to be disregarded. So the soldiers marched unarmed to Nantes, and from thence returned, before two months were over, in spite of the promises they had given, and requited the mercy of the Vendeans with the most horrid cruelties. \n \n The people were equally triumphant in many other towns. In Beauprieu, Coron, Ch芒tillon, and other places, the collection of conscripts was opposed successfully, and generally speaking, without much bloodshed. In Coron, the military fired on the people, and killed three or four of them, but were ultimately driven out, In Beauprieu, they gave up their arms at once, and marched out of the place. In Ch芒tillon, they attempted to defend the barracks, but they found, when too late, that they had not a single day’s provisions; and as the townspeople also knew this, they were at no pains to besiege the stronghold of the soldiers. They knew that twenty-four hours would starve them out. As it was, the lieutenant in command gave up, half an hour after his usual dinner time. \n \n These things all occurred within a week of the revolt at St. Florent. Beauprieu and Ch芒tillon were carried on the Wednesday. Coron was victorious on the Thursday; and on the Friday following, a strong detachment of soldiers marched out of Cholet, of their own accord, without attempting to collect their portion of the levy, and crossed the river Loire, at the Pont de C茅, thus retreating from La Vend茅e. \n \n These triumphs inspired the insurgents with high hopes of future victories; they gave them the prestige of success, made them confident in the hour of battle, and taught them by degrees to bear, undaunted, the fire of their enemies. The officers of the Republic were most injudicious in allowing their enemies to gather head as they did; had they brought a really formidable force of men, in one body, into the province of Anjou, immediately upon the revolt of St. Florent, they might doubtless have driven the Vendeans, who were then unarmed and undisciplined, back to their farms; but they affected to despise them, they neglected to take vigorous measures, till the whole country was in arms; and they then found that all the available force which they were enabled to collect, was insufficient to quell the spirit, or daunt the patriotism of the revolted provinces. \n \n Towards the end of April, the first attempt was made by the Vendean chiefs to collect a body of men under arms, and to put them into motion, for the purpose of performing service at a distance from their own homes; and though considerable difficulty was felt in inducing them to follow the standards, their first attempts were successful. In the early part of May, they altogether succeeded in driving the soldiers out of Thouars. A few days later, they did the same at Fontenay, though here they met with a violent opposition, and much blood was shed. At these two latter places, the cannon which Cathelineau had taken in so gallant a manner at St. Florent, was brought into action, and quite supported its character as a staunch royalist. At Fontenay, with its aid, they took three or four other pieces of cannon, but none which they prized as they did Marie Jeanne. It was universally credited among the peasantry, that at Cathelineau’s touch, this remarkable piece of artillery had positively refused to discharge itself against the Vendeans; and their leaders certainly were at no pains to disabuse them of a belief which contributed so strongly to their enthusiasm. \n \n Some of the more astute among the people had certainly thought for a while that the cannon was a humbug, that it was useless either to royalist or to republican, in fact, that it would never go off at all. But these sceptics were cured of their infidelity at Thouars, when they saw the soldiers as well as the republicans of the town fall in heaps beneath the thunders of Marie Jeanne. \n \n During April and the three weeks of May, Larochejaquelin and de Lescure, together with Cathelineau, Denot, and M. Bonchamps, were actively engaged in collecting and exhorting the people, planning what they should do, and preparing themselves to bear that burst of republican fury which they knew would, sooner or later, fall upon them. \n \n Much of this time was spent at Clisson, as that place was centrically situated for their different manoeuvres; and there certainly appeared reason to suppose that Madame de Lescure was not altogether wrong in her surmises respecting Marie. Here also, at Clisson, Cathelinean frequently joined the party, and though he shewed by his language and demeanour that he had not forgotten that he was a postillion, he gradually acquired a confidence and ease of manner among his new associates, and displayed a mixture of intelligence and enthusiasm, which induced his confederates generally to acknowledge his voice as the first in their councils. \n \n They were occasionally at Durbelli猫re; but there Cathelineau was again abashed and confused. He could not calmly endure the quiet loveliness of Agatha’s face, or the sweet music of her voice. He himself felt that his brain was not cool when there; that his mind was gradually teaching itself to dwell on subjects, which in his position would be awfully dangerous to him. He never owned to himself that he was in love with the fair angel, whom he considered as much above him as the skies are above the earth; but he would walk for hours through those eternal paths in the ch芒teau garden, regardless of the figures, regardless of the various turns and twists he took, dreaming of the bliss of being beloved by such a woman as Agatha Larochejaquelin. He built for himself splendid castles in the air, in which he revelled day after day; and in these dreams he always endowed himself with that one gift which no talents, no courage, no success could give him—high birth and noble blood, for he strongly felt that without these, no one might look up to the goddess of his idolatry; it was his delight to imagine to himself with what ecstasy he would receive from her lips the only adequate reward of his patriotism; he would quicken his pace with joy as he dreamt that he heard her sweet voice bidding him to persevere, and then he would return to her after hard fighting, long doubtful but victorious battles, and lay at her feet honours worthy of her acceptance. \n \n It can hardly be said that he himself was the hero of his own reveries; he was assured beyond the shadow of a doubt, that the proud happiness which he pictured to his imagination was as much beyond his own reach, as though his thoughts were turned on some celestial being. No, it was a creation of his brain, in which he dwelt awhile, till his own strong good sense reminded him that he had other work before him than the indulgence in such dreams, and he determined that he would be at Durbelli猫re as little as was possible. \n \n It was singular though, that he contrived, while his imagination was thus rambling, to mingle in his thoughts the actual and the ideal. The revolt of La Vend茅e, the struggle of his brother royalists for the restoration of their King; the annihilation of republicanism, and re-establishment of the old clergy, were still the subjects of his meditations; and the bold plans which his mind then suggested to him, were those which were afterwards put into effect. \n \n He still insisted on attacking the strongly fortified citadel of Saumur, and after their success at Fontenay, the chiefs agreed at once to make arrangements for that great undertaking. The tenth of June was settled on as the day on which the attack should be commenced, and their utmost efforts in the mean time were to be employed in raising recruits, arming and drilling them, and collecting ammunition and stores of war sufficient for so serious an operation. \n \n For this purpose Cathelineau returned for a while to St. Florent. M. Charette was requested to bring up all the men he could collect from the Marais, a part of La Vend茅e which lies close upon the sea. M. Bonchamps was invited to join them from Angers. De Lescure returned to Fontenay, to ask the assistance of those who had been so successful there against the republicans; while Henri Larochejaquelin, was left at home in the Bocage, to secure the services of every available man from every village. \n \n He had two comrades with him in his recruiting party; and though they were of very different characters, they were almost equally serviceable. One was his friend and priest, the Cur茅 of St. Laud, and the other was his servant, Jacques Chapeau. The Cur茅 had no scrupulous compunction in using his sacerdotal authority as a priest, when the temporal influence of Larochejaquelin, as landlord, was insufficient to induce a countryman to leave his wife and home to seek honour under the walls of Saumur. The peasants were all willing to oppose the republican troops, should they come into their own neighbourhood to collect conscripts; they were ready to attack any town where republican soldiers were quartered, providing they were not required to go above a day’s march from their own homes; but many objected to enrol themselves for any length of time, to bind themselves as it were to a soldier’s trade, and to march under arms to perform service at a distance from their farms, which to them seemed considerable. With such men as these, and with their wives and sisters, Henri argued, and used his blandest eloquence, and was usually successful; but when he failed, the Cur茅 was not slow in having recourse to the irresistable thunders of the church. \n \n No one could have been fitter for the duties of a recruiting-sergeant than Jacques Chapeau; and to his great natural talents in that line, he added a patriotic zeal, which he copied from his master. No one could be more zealous in the service of the King, and for the glory of La Vend茅e, than was Jacques Chapeau. Jacques had been in Paris with his master, and finding that all his fellow-servants in the metropolis were admirers of the revolution, he had himself acquired a strong revolutionary tendency. His party in Paris had been the extreme Ultra-Democrats: he had been five or six times at the Jacobins, three or four times at the Cordeliers; he had learnt to look on a lamp-rope as the proper destination of an aristocrat, and considered himself equal to anybody, bu his master, and his master’s friends. On Henri’s return to La Vend茅e, he had imbued himself with a high tone of loyalty, without any difficulty or constraint on his feelings; indeed, he was probably unaware that he had changed his party: he had an appetite for strong politics, was devotedly attached to his master, and had no prudential misgivings whatsoever. He had already been present at one or two affairs in which his party had been victorious, and war seemed to him twice more exciting, twice more delightful than the French Opera, or even the Jacobin Clubs. \n \n Jacques Chapeau was about five years older than his master, and was as active and well made a little Frenchman, as ever danced all night at a ball outside the barriers of Paris. He was a light-hearted and kind-hearted creature, although he always considered it necessary to have mortal enemies—horrid, blasphemous, blood-thirsty fellows, men devoid of feeling, without faith, hope, or charity, who would willingly slaughter women and children for the mere pleasure of doing so. Such, in Chapeau’s imagination, were all his enemies—such had been the aristocrats during the time of his revolutionary fervour—such now were the republicans. Chapeau loved his own side truly and faithfully, without any admixture of self in his calculations, but I certainly cannot say for him that he was a good Christian, for all the clergymen in Anjou could not have taught him to love his enemies. \n \n On a beautiful summer’s morning, on the 2nd of June, this remarkable recruiting party rode from Durbelli猫re to the little village of Echanbroignes; the distance was about four leagues, and their road lay, the whole way, through the sweet green leafy lanes of the Bocage. The aspect of this province is very singular, and in summer most refreshing. The country is divided into small farms, which are almost entirely occupied with pasture; the farms are again divided into small fields, and each field is surrounded by a belt of trees, growing out of high, green, flowering hedges. The face of the country is like a thickly wooded demesne, divided and subdivided into an infinity of little paddocks. The narrow lanes of the country, which are barely broad enough for the wheels of a carriage, and are seldom visited by such a vehicle, lie between thick, high hedges, which completely overshadow them; the wayfarer, therefore, never has before him that long, straight, tedious, unsightly line of road, which adds so greatly to the fatigue of travelling in an open country, and is so painful to the eye. \n \n Through such a lane as this our party rode quickly and cheerily; quickly, for they had much work before them for that day; and cheerily, for they knew that the people among whom they were going would join them with enthusiasm. They were all well mounted, for they rode the best horses from the stables of Durbelli猫re: the old Marquis would have blushed to have given less than the best to the service of his King. \n \n Chapeau was peculiarly elated at the prospect of his day’s work; but his joy was not wholly professional; for Jacques now accounted himself a soldier by profession. He had another reason for the more than ordinary gaiety with which he trotted on towards Echanbroignes. There was there a certain smith, named Michael Stein, who had two stalwart sons, whom Jacques burnt to enrol in his loyal band of warriors; this smith had also one daughter, Annot Stein, who, in the eyes of Jacques Chapeau, combined every female charm; she was young and rosy; she had soft hair and bright eyes; she could dance all night, and was known to possess in her on right some mysterious little fortune, left to her by nobody knew what grandfather or grandmother, and amounting, so said report, to the comfortable sum of five hundred francs. When Chapeau had risen to some high military position, a field-marshal’s baton, or the gold-laced cap of a serjeant-major, with whom could he share his honours better than with his dear little friend, Annot Stein? Jacques wanted her advice upon this subject, and he therefore rejoiced greatly that the path of duty was leading him this morning to Echanbroignes. \n \n “We may be sure, Father Jerome,” said Henri, “of those men from St. Michael?” \n \n “Of every man. You will find there will not be a defaulter.” \n \n “God send it; one traitor makes many, as sheep follow each other through a hedge row.” \n \n “Do not fear them, my son. Father Francois has the list of them; he will have every man collected by daylight on the 7th, and he will come on with them himself as far as the cross-roads; they will there meet my own children from St. Laud.” \n \n “There were to be one hundred and seventy-five from St. Michael.” \n \n “Yes; and one hundred and forty from St. Laud; and thirty will have joined us from Petit Ange de Poitou before we reach the turn from St. Michael.” \n \n “And have you positively determined you will start with them from St. Laud’s yourself, Father Jerome.” \n \n “With God’s will, my son, I most assuredly shall do so; and from that to the walls of Saumur, they shall see before them my tattered Cur茅’s frock, and the blessed symbol of their hope. I will carry the cross before them from the porch of the little church which shall once more be my own, till I plant it on the citadel of Saumur beside the standard of the King.” \n \n “Oh! if we had a few more Father Jeromes!” said Henri. \n \n “There might perhaps be more soldiers in La Vend茅e than at present; but perhaps also there would be fewer Christians,” said the priest. “May God forgive me if, in my zeal for my King, I am too remiss in His service.” \n \n They rode on a little way in silence, for Father Jerome felt a slight qualm of conscience at his warlike proceedings, and Henri did not like to interrupt his meditations; but the Cur茅 soon recovered himself. \n \n “I shall have a goodly assemblage of followers,” said he, “before I reach Coron. Those from Echanbroignes will join us half-a-mile from the town. There will be above two hundred from Echanbroignes.” \n \n “Will there? So many as that, think you?” \n \n “They will muster certainly not short of two hundred. Near seven hundred men will follow me into Coron on the evening of the 7th.” \n \n “They will find provisions there in plenty—meat, bread, and wine. They are not used to lie soft; they will not grumble at having clean straw to sleep on.” \n \n “They shall grumble at nothing, my friend; if your care can supply them with food, well; if not, we will find bread enough among the townsfolk. There is not a housewife in Coron, who would refuse me the contents of her larder.” \n \n “The bullocks are ready for the butcher’s axe in the stalls at Durbelli猫re, please your reverence,” said Chapeau, who rode near enough to his master to take a part in the conversation as occasion offered. “And the stone wine-jars are ready corked. Momont saw to the latter part himself. May the saints direct that the drinking have not the same effect upon our friends that the corking had on Momont, or there will be many sick head-aches in Coron on the next morning.” \n \n “There will be too many of us for that, Jacques. Five hundred throats will dispose of much good wine, so as to do but little injury.” \n \n “That would be true, your reverence, were not some throats so much wider than others. You will always see that one porker half empties the trough before others have moistened their snouts in the mess.” \n \n “We will see to that, Jacques. We will appoint some temperate fellow butler, or rather some strong-fisted fellow, whose thick head much wine will not hurt; though he may swill himself he will not let others do so.” \n \n “If it were not displeasing to yourself and to M. Henri, I would undertake all that myself. Each man of the five hundred should have his own share of meat and drink at Coron, and the same again at Dou茅.” \n \n “Will not Jacques be with you?” said the priest, turning round to Henri. “What should bring him to Coron among my men?” \n \n “He says he has friends here in Echanbroignes, and he has begged that he may be here with them on the evening of the 6th, so as to accompany them into Coron on the 7th. We shall all meet at Dou茅 on the 8th.” \n \n “I was thinking, your reverence, if any here were loiterers, as there may be some, I fear; or if there should be any ill inclined to leave their homes, my example might encourage them. I have a liking for the village, and I should feel disgraced were a single able-bodied man to be found near it after the morning of the 7th.” \n \n “I trust they will not need any one to remind them of their promise, when they have once pledged themselves to the service of their King,” said the priest. “However, you will be, doubtless, useful to me at Coron. But, Henri, what will you do without him?” \n \n “Adolphe and I will be together, and will do well. We shall have an absolute barrack at Durbelli猫re. We shall have above one hundred men in the house. Agatha and the women are at work night and day.” \n \n “You have the worst part of the whole affair—the ammunition.” \n \n “It is all packed and ready for the carts; a few days since the cellars were half-full of the lead and iron, which we have been casting; they are now, I trust, half-way to Saumur, under Foret’s care.” \n \n “How many men has he with him?” asked the priest. \n \n “He has all the men from Clisson, from St. Paul’s and St. Briulph’s— except a few of Charles’ own tenants, who went on forward to join him at Dou茅, and who have our supply of flags with them, made in the ch芒teau at Clisson. Madame de Lescure and poor Marie have worked their fingers to the bone.” \n \n “God bless them! God will bless them, for they are working in the spirit which he loves.” \n \n “Agatha and Annette, between them, have packed nearly every ounce of gunpowder,” said Henri, who could not help boasting of his sister. “Night and day they have been handling it without regarding for a moment the destruction which the slightest accident might bring upon them.” \n \n “It is that spirit, my son, which will enable us to beat twice our own strength in numbers, and ten times our own strength in arms and discipline How many men has Foret with him?” \n \n “Above six hundred. I do not know his exact numbers,” said Henri. \n \n “And you, yourself?” \n \n “I shall muster a thousand strong, that is for a certainty; I believe I shall be nearer twelve thousand.” \n \n “Let me see—that will be, say two thousand five hundred from the Bocage.” \n \n “Oh! more than that your reverence,” said Chapeau, “you are not counting M. de Lescure’s men, who have gone on with the flags—or the men from Beauprieu who will follow M. d’Elb茅e, or the men from St. Florent, who will come down with Cathelineau.” \n \n “I don’t count Beauprieu, or Cholet or St. Florent; there will be two thousand five hundred from our own country, out of three thousand three hundred male adults, that is three men, Henry, out of every four—they cannot at any rate say that the spirit of the people is not with us.” \n \n As the priest spoke, they rode into the street of the little village of Echanbroignes, and having stopped at the door of the Mayor’s house, Henri and the Cur茅 dismounted, and giving their horses up to Jacques, warmly greeted that worthy civic authority, who came out to meet them. \n \n The appointment of a mayor in every village in France, had been enjoined at an early time in the revolution, and after the death of the King, these functionaries were, generally speaking, strong republicans; but the Vendeans in opposition to the spirit of the revolution, had persisted in electing the Seigneurs, wherever they could get a Seigneur to act as mayor; and, where this was not the case, some person in the immediate employment of the landlord was chosen. This was the case at Echanbroignes, where the agent or intendant of the proprietor was mayor. He expected the visit which was now paid to him, and having twenty times expressed his delight at the honour which was done him, he got his hat and accompanied his visitors to the door of the church, where with his own hands he commenced a violent assault on the bell-rope, which hung down in the middle of the porch. \n \n He was ringing the tocsin, which was to call together the people of the village. They also very generally knew who was coming among them on that day, and the purpose for which they were corning; and at the first sound of the bell, all such as intended to shew themselves, came crowding on to the little space before the church; it was but few who remained at home, and they were mostly those to whom home at the present moment was peculiarly sweet; one or two swains newly married, or just about to be married; one or two fathers, who could hardly bring themselves in these dangerous times to leave their little prattling children, and one or two who were averse to lose the profits of their trade. \n \n In spite of the speedy appearance of his townspeople, the Mayor persisted in his operations on the bell-rope until the perspiration ran down his face. He was sounding the tocsin, and he felt the importance of what he was doing. Every one knew that a tocsin bell to be duly rung, should be rung long and loud—not with a little merry jingle, such as befitted the announcement of a wedding, but in a manner to strike astonishment, if not alarm, into its hearers; and on this occasion great justice was done to the tocsin. \n \n “That will do, M. Mayor; that will do, I think!” said the Cur茅, “it looks to me as though our friends were all here.” \n \n The Mayor gave an awful pull, the bell leapt wildly up, gave one loud concluding flourish, and then was quiet. \n \n “Now, M. Mayor,” said the Cur茅, “you have by heart the few words I gave you, have you not?” \n \n “Indeed, Father Jerome, I have,” said the Mayor, “and am not likely to forget them. Let me see—let me see. Now, my friends, will you be quiet a moment while I speak to you. Ambrose Corvelin, will you hold your noisy tongue awhile—perhaps M. de Larochejaquelin, I had better get up on the wall, they will hear me better?” \n \n “Do, M. Mayor, do,” said Henri; and the Mayor was lifted on to the low wall which ran round the churchyard, and roared out the following words, at the top of his voice: \n \n “In the holy name of God, and by command of the King, this parish of Echanbroignes is invited to send as many men as possible to Saumur, to be there, or at any other such place in the neighbourhood as may be appointed, at three o’clock on the afternoon of the 9th of June. And may God defend the right. Amen!” And having said this, the Mayor jumped off the wall, and the crowd commenced shouting and cheering. \n \n “Wait one moment, and hear me say a few words, my friends,” said Henri, springing to the place which the Mayor had just left. “Most of you, I believe, know who I am.” \n \n “We do, M Henri,” said they. “We do, M. Larochejaquelin. We all know who you are. We know that you are our friend.” \n \n “I am very glad you think so,” continued he; “for you will know, that if I am your friend, I shall not deceive you. I have come here to ask you to share with me the honour and the danger of restoring his father’s kingdom and his father’s throne to the son of your murdered King. I have come here to ask you also to assist me and others, who are your friends, in protecting yourselves, your pastors, your houses, your wives and daughters, from the tyranny and cruelty of the republicans.” \n \n “We will!” shouted the crowd. “We will go at once. We will be at Saumur on Wednesday. We will follow M. Larochejaquelin wherever he would lead us.” \n \n “You all know Cathelineau,” continued Henri; “you all know the good postillion of St. Florent?” \n \n “We do, God bless him! we do. We all know the Saint of Anjou.” \n \n “Come and meet him, my friends, under the walls of Saumur; or rather, I should say, come and meet him within the walls of Saumur. Come and greet the noble fellows of St. Florent, who have set us so loyal an example. Come and meet the brave men of Fontenay, who trampled on the dirty tricolour, and drove out General Coustard from his covert, like a hunted fox. He is now at Saumur; we will turn him out from thence.” \n \n “We will! we will! We will hang up Coustard by the heels.” \n \n “We will strip him rather of his spurs and his epaulettes, of his sword and blue coat, and send him back to the Convention, that they may see what will become of the heroes, whom they send to seek for glory in La Vend茅e. Thanks, my friends; thanks for your kindness. I will lead you to no dangers which I will not share with you. You shall suffer no hardship of which I will not partake. I will look for no glory in which you shall not be my partners.” \n \n During the time that the Mayor had been giving his invitation to the people, and Henri had been speaking to them, Father Jerome had been busily employed with Jacques Chapeau over six or seven little lists which he held in his hand. These were lists of the names of able-bodied men, which had been drawn out by the Cur茅 of the parish, and Jacques had already marked those of one or two whom he had found to be absent, and among them the names of Michael Stems’ two stalwart sons. Father Jerome again handed the lists to Jacques, and as Henri descended from the wall, amid the greeting of the populace, he ascended it, and gave them a little clerical admonition. \n \n “My children,” said he, “it delights my heart to find that so few of you are absent from us this morning—from the whole parish there are but five, I believe, who have not readily come forward to proclaim their zeal for their God, their King, and their Church: those five, I doubt not, will be here when we proceed to check the names. Let it not be said that there was one recreant in Echanbroignes—one man afraid to answer when called for by his country. Is there danger in the bloody battle we have before us?—let us all share it, and it will be lighter. Is it a grievous thing for you to leave your wives and your children?—let no man presume to think that he will be happier than his neighbours, for that man shall assuredly be the most miserable. It is possible that some of you may leave your bodies beneath the walls of Saumur, be it so; will you complain because the Creator may require from some of you the life which he has given? Is it not enough for you to know, that he who falls fighting with this blessed symbol before his eyes, shall that night rest among the angels of Heaven?” and the Cur茅 held up on high, above the people, a huge cross, which he had had brought to him out of the church. “God has blessed you, my children, in giving you the sacred privilege of fighting in His cause. You would indeed be weak—senseless as the brutes—unfeeling as the rocks—aye, impious as the republicans, had you not replied to the summons as you have done; but you have shown that you know your duty. I see, my children, that you are true Vendeans. I bless you now, and on tomorrow week, I will be among you before the walls of Saumur.” \n \n Having finished speaking, the priest also jumped off the wall, and again the people shouted and cheered. And now they went to work with the lists: Henri, the Mayor, and the Cur茅 each took a pencil, and called the names of the different men, as they were written down. There was of course much delay in getting the men as they were called; but Chapeau had sworn in three or four assistants, and he and they dived in among the crowd, hurried this way and that, and shouted, screamed, and screeched with great effect. The lists were made out with some regard to the localities; the men from the lower end of the village were to go to Henri’s side; those from the northern part to Father Jerome’s table; and the inhabitants of the intermediate village were checked off by the Mayor. Chapeau and his friends were most diligent in marshalling them; to be sure, Jacques knew the names of but few of them; but he made them tell him whether they were villagers, northerns, or lower-end men; and though the men in many instances couldn’t answer this themselves, the divisions were effected, the names of all were called over, those who were there were checked off and informed what was expected of them, and where and by whom arms would be supplied to them: and those who were not there became the unhappy victims of a black list. \n \n Father Jerome, when he said that there were only five absent, was something but not much out in his reckoning: his object, however, had been to make the people think that he knew exactly who was there, and who was not there; and in this he was successful. During the calling of the lists, one or two stragglers dropped in who hoped to escape detection: respecting a few others, some good ground of excuse was alleged; but on this head the Cur茅 was most severe: he would accept no plea but that of absolute downright sickness, and of this he required to have most ample testimony—even Henri sometimes pleaded for the people, but unsuccessfully. The Republic by their proscription would have decimated the men; the Cur茅 of St. Laud insisted on taking them all. \n \n The houses of those who had not presented themselves were to be visited, and the two first on the list were Jean and Peter Stein. \n \n “Jean and Peter Stein,” said Henri. “Why, Jacques, are they not friends of yours? are they not sons of Michael Stein, the smith?” \n \n “Quiet, M. Henri; pray be quiet for a moment, and I will explain.” \n \n “Are they not strong, active lads,” said the Cur茅, turning somewhat angrily on Chapeau, as though he were responsible for the principles of his friends. \n \n “They are, they are, your reverence, fine strong active lads as you ever laid your eyes on.” \n \n “And they are afraid to carry a musket for their king?” \n \n “Not a bit, Father Jerome, not a bit afraid; nor yet unwilling, M. Henri. I will explain it all; only let us be a little by ourselves.” \n \n “There is a mystery, Father Jerome,” said Henri, “and Chapeau must have his own way in explaining it.” \n \n “Exactly, M. Henri; I will explain all.” By this time he had got the priest and his master somewhat out of the crowd. “You see, M. Henri, there are not two young men in the Bocage more determined to fight for the good cause this moment, than Jean and Peter Stein.” \n \n “Why, Jacques, I do not see it yet, certainly.” \n \n “Oh! Sir, it’s a fact; they are dying to have a musket in their hands. I pledge for them my word of honour,” and Jacques laid his hand upon his heart. “You will find they are with me, your reverence, when I meet you at the cross-roads, within half a mile of Coron, on Monday morning. But, M. Henri, they have a father.” \n \n “Have a father!” said the Cur茅, “of course they have.” \n \n “You don’t mean to tell me that Michael Stein, the smith, is a republican?” \n \n “A republican!” said Jaques. “Oh! no, the heavens preserve us, he’s nothing so bad as that, or his own son wouldn’t remain under his roof another night, or his daughter either. No; Annot wouldn’t remain with him another hour, were he twenty times her father, if he turned republican.” \n \n “Why does he prevent his sons joining the muster, then?” said Henri. \n \n “He is very fond of money, M. Henri. Old Michael Stein is very fond of money; and every one in the country who owns a franc at all, is buying an old sword or a gun, or turning a reaping-hook into a sabre, or getting a long pike made with an axe at the end of it; so Michael Stein’s smithy is turned into a perfect armoury, and he and his two sons are at work at the anvil morning, noon, and night: they made Annot blow the bellows this morning, till she looks for all the world like a tinker’s wife.” \n \n “That alters the case,” said Father Jerome; “they are doing good service, if they are making arms for our men; they are better employed than though they joined us themselves.” \n \n “Don’t say so, Father Jerome,” said Jacques, “pray don’t say so, Jean and Peter would die were they not to be of the party at Saumur; but Michael is so passionate and so headstrong, and he swears they shall not go. Now go they will, and therefore I supplicate that my word may be taken, and that I may be saved the dishonour of hearing the names of my friends read out aloud with those of men who will disgrace their parish and their country.” \n \n The request of Jacques was granted, and the names of Jean and Peter Stein were erased from the top of the black list. \n \n It was eight in the evening before the recruiting party had finished their work, and it was not yet noon when they rode into the little village. Henri and the Cur茅 got their supper and slept at the Mayor’s house, and even there they were not allowed to be quiet; some of those who were to be at Saumur, were continually calling for new instructions; one wanted to know what arms he was to carry, another what provisions he was to bring, a third was anxious to be a corporal, and a fourth and fifth begged that they might not be separated, as one was going to marry the sister of the other. None of these were turned away unanswered; the door of the Mayor’s house was not closed for a moment, and Henri, to be enabled to eat his supper at all, was obliged to give his last military orders with a crust of bread in his hand, and his mouth full of meat. \n \n As might be supposed, Jacques spent the evening with Annot Stein, at least it was his intention to have done so; but he had been so leading a person in the day’s transactions that he also was besieged by the villagers, and was hardly able to whisper a word into his sweetheart’s ear. There he sat, however, very busy and supremely happy in the smith’s kitchen, with a pipe in his mouth and a bottle of wine before him. The old smith sat opposite to him, while the two young men stood among a lot of others round the little table, and Annot bustled in and out of the room, now going close enough up to her lover to enable him to pinch her elbow unseen by her father, and then leaning against the dresser, and listening to his military eloquence. \n \n “And so, my friend,” said Chapeau, “Jean and Peter are not to go to Saumur?” \n \n “Not a foot, Chapeau,” said the old man, “not a foot, Chapeau; let ye fight, we will make swords for you: is not that fair, neighbour?” \n \n “I have nothing to say against it, M. Stein, not a word; only such fellows as they, they would surely get promoted.” \n \n “Oh, ay; you will all be sergeants, no doubt. I have nothing to say against that; only none of mine shall go waging wars in distant lands.” \n \n “Distant lands, say you! is not Saumur in Anjou? and is not Anjou within three miles of you, here where you are sitting?” \n \n “May be so, M. Chapeau; but still, with your leave, I say Saumur is distant. Can you get there in one day from here?” \n \n “Why no, not in one day.” \n \n “Nor in two?” \n \n “Why, no again; though they might do it in two. They’ll start from here Monday morning with light, and they’ll reach Saumur on Wednesday in time to look about them, and learn what they have to do the next morning.” \n \n “That’s three day’s going, and three coming, and heaven only knows how many days there; and you don’t call that distant! Who’s to feed them all I’d like to know?” \n \n “Feed them!” said Chapeau. “I wish you could see all the bullocks and the wine at Durbelli猫re; they’ll have rations like fighting-cocks. I only pray that too much good living make them not lazy.” \n \n “Were I a man,” said Annot, as she put on the table a fresh bottle of wine, which she had just brought in from the little inn, “were I a man, as I would I were, I would go, whether or no.” \n \n “Would you, minx,” said the father; “it’s well for you that your petticoats keep you at home.” \n \n “Don’t be too sure of her, Michael Stein,” said Paul Rouel, the keeper of the inn; “she’ll marry a soldier yet before the wars are over.” \n \n “Let her do as her mother did before her, and marry an honest tradesman; that is, if she can find one to take her.” \n \n “Find one!” said Annot, “if I can’t get a husband without finding one, indeed, I’m sure I’ll not fash myself with seeking: let him find me that wants me.” \n \n “And it won’t be the first that finds you either, that’ll be allowed to take to you, will it Annot?” said the innkeeper. \n \n “That’s as may be, Master Rouel,” said Annot. “Those who ask no questions are seldom told many lies.” \n \n “I know Annot Stein loves a soldier in her heart,” said another old man, who was sitting inside the large open chimney. “The girls think there is no trade like soldiering. I went for a soldier when I was young, and it was all to oblige Lolotte Gobelin; and what think ye, when I was gone, she got married to Jean Geldert, down at Petit Ange. There’s nothing for the girls like soldiering.” \n \n “You give us great encouragement truly,” said Jacques. “I hope our sweethearts will not all do as Lolotte did. You would not serve your lover so, when he was fighting for his King and country—would you, Annot?” \n \n “I might, then, if I didn’t like him,” said she. \n \n “She’s no better than her neighbours, M. Chapeau,” said one of her brothers. “There was young Boullin, the baker, at St. Paul’s. Till we heard of these wars, Annot was as fond of him as could be. It was none but he then; but now, she will not as much as turn her head if she sees his white jacket.” \n \n “Hold thine unmannerly, loutish, stupid tongue, wilt thou, thou dolt,” said Annot, deeply offended. “Boullin indeed! I danced with him last harvest-home; I know not why, unless for sheer good-nature; and now, forsooth, I am to have Boullin for ever thrust in my teeth. Bah! I hate a baker. I would as lieve take a butcher at once.” \n \n Jacques Chapean also was offended. \n \n “I wonder, Jean Stein,” said he, “that you know not better than to liken your sister to such as young Boullin—a very good young man in his way, I have no doubt. You should remember there is a difference in these things.” \n \n “I don’t know,” said Jean, “why a smith’s daughter should not marry a baker’s son; but I did not mean to vex Annot, and will say no more about him; only good bread is a very good thing to have in one’s house.” \n \n “And a butcher is a good trade too,” said the old man inside the chimney. “Jean Geldert, he that Lolotte Gobelin ran off with, he was a butcher.” \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2759/76129.html","bookId":1343,"book":{"id":1343,"title":"La Vendée An Historical Romance","description":"简介： The history of France in 1792 has been too fully written, and too generally read to leave the novelist any excuse for describing the state of Paris at the close of the summer of that year. It is known to every one that the palace of Louis XVI was sac...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2759","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
