{"id":29381,"no":46,"title":"EPILOGUE.","content":"“I pray God our zeal in these times may be so kindled with pure fire from God’s altar that it may rather warm than burn, enliven rather than inflame, and that the spirits of good men may truly be qualified with Gospel principles, true fruits of the Divine Spirit. And truly I believe that the members of the Church, if not the leaders—notwithstanding all the perfections of times before us, so much pictured or applauded—have very much yet to learn. For I am persuaded that Christian love and affection is a point of such importance that it is not to be prejudiced by supposals of difference in points of religion in any ways disputable, though thought weighty as determined by the parties on either side; or by particular determinations beyond Scripture, which, as some have observed, have enlarged divinity, but have lessened charity and multiplied divisions. For the maintenance of truth is rather God’s charge, and the continuance of charity ours.”—Letters of Benjamin Whichcote, 1651. \n \n And were they married here in this very porch where we’re sitting, grandfather?” said little Bobbie Coke, looking up into the Vicar’s kindly face, which the forty-five years had made only somewhat thinner and paler. \n \n “Here in this very porch, Bobbie,” he replied, his arm about the lad, while on his knee sat little Mollie Harford, the orphan daughter of Gabriel’s brother, Bridstock, who had died seven years before. \n \n “Never was there such a happy wedding before or since, for it is not often that the bridegroom is rescued at the last moment from the jaws of death. The villagers were ready to cry for joy, and the soldiers—brave fellows!—why, they were only too glad to be let off the horrid piece of work their Colonel had set them to do.” \n \n “And when did my grandfather come?” asked Mollie. \n \n “He came that evening, and Mrs. Harford with him, and they all stayed at the Vicarage a couple of days, rejoicing. Then the bride and bridegroom went to say farewell to the Bishop at Whitbourne, and thence to London, where Madam Harford gave them a right loving welcome, and took good care of Hilary, while her husband joined Cromwell, and began his career as mate to the surgeon of his regiment. It was in that fashion that he again saw Colonel Norton. For after the great battle at Naseby, when he was going about the field succouring the wounded, he came upon the Colonel lying there half dead, and was able to bind up his wounds, and bring him the water he cried out for. When the Colonel had drunk it, he looked up with startled eyes at his helper. \n \n “‘Why, God bless my soul! Is it you?’ he cried. ‘What are you doing?’ \n \n “‘Helping the sick and wounded,’ said Gabriel. \n \n “‘Confounded queer work for a gentleman,’ said Norton. \n \n “‘It was good enough for Christ,’ said the other. \n \n “Then up came the surgeon, said ’twas no use spending time over one that couldn’t live an hour, and bade his mate come and rest. But Gabriel, saying that he knew the wounded officer, asked to remain with him. \n \n “‘Why should I lie shivering here for an hour?’ said Norton, in his devil-may-care tone. ‘It will be quicker work if I die on my feet, and I’ll be bound you think I shall be hot enough in the next world.’ \n \n “‘Lie still,’ said Gabriel. ‘Here’s the cloak Lord Falkland gave me at Marlborough. We’ll wrap it about you.’ \n \n “Now at the word Marlborough, the face of the dying man changed, and he fell a-thinking. \n \n “‘Say the words you said that night,’ he gasped. \n \n “Gabriel, unable to think what he meant, said the first words that came to his mind: \n \n “‘Forgive us our trespasses as we forgive them that trespass against us, and lead us not into temptation, but deliver us from evil, for thine is the kingdom, and the power and the glory, for ever.’ \n \n “And after that the dying man lay in his arms fighting hard for breath, but never speaking, only once he gripped Gabriel’s hand and looked in his eyes, as though he would have thanked him. Then, as darkness fell on the blood-stained field, he passed away.” \n \n “And what happened to my uncle Gabriel?” asked Mollie. \n \n “The war ended not long after that, and he went to London, and studied for two years under Sir Theodore Mayerne, and then for two years more at Paris. In 1650 he settled finally in London, and there became a celebrated physician, and all went well with him. He had twenty years of happy wedded life, marred only by some trouble at the time of the Restoration for the part he had played in the Civil War. However, that was no very serious matter, and there were few happier homes in the country till the year of the Great Plague. \n \n “Knowing that his duty lay with the poor sick folk in London, he parted from his wife and four children, sending them, as he hoped, out of all risk to Katterham, a country place some eighteen miles off. But it fell about that, as they halted at Croydon to bait the horses, some that were also flying from the plague, sat with them at the common table in the inn, and even as they dined one of these fellow-travellers was seized with illness. Spite of all precautions, my dear niece herself sickened the next day, and ere twenty-four hours had passed she and her children were dead. \n \n “An old comrade, Sir Joscelyn Hey worth, travelled to London to break the news to his friend, who seemed for the time wholly crushed. But as they sat together talking very sadly, there came in Sir William Denham, who for many years had known them both. \n \n “‘Doctor,’ he said. ‘I scarce like to break in upon your sorrow, but my friend Judge Wharncliffe and his wife have just died of the plague, and their two sons are at death’s door, with no one but an old man-servant to care for them, and the doctor who had attended them hath now died in the very house.” \n \n “At that Gabriel put aside his own trouble, and went forth to see what he could do. He found the elder lad, a fine fellow of one and twenty, beginning to rally, but the younger, a tiny, delicate child of but two or three years, lay at the point of death. He fought for its life, and never left it till it had passed the crisis, and by that time, as he afterwards told me, life had again become bearable to him, and he found what the joy of battle meant; it was not the brutal love of bloodshed, it was the God-like desire to overcome evil with good, disease with health, and death with life.” \n \n “And did the little boy get quite strong?” asked Mollie, eagerly. \n \n “Ay, to be sure, he’s alive to this day, and has lived a right noble life. Few men have suffered with a better courage than Hugo Wharncliffe, and one day I’ll tell you his story.” \n \n “And now tell me the rest about Uncle Gabriel,” said Mollie. “Did he live much longer?” \n \n “Only five years more, but they were five years full of good Work. It was in 1670, I remember, that he wrote to say he was advised to take a few weeks’ rest and hoped to pay us a visit at Bosbury on his way home to his father. Now Dr. Harford was attending some sick folk at the Grange, and chanced to be here the very day he arrived. As we all dined together Gabriel told us with much interest of certain people called Quakers that he had lately come to know. Their way of thought had great attraction for him, especially the effort they made to obey literally the teaching of Christ as to using no oath, and avoiding all war and violence.” \n \n “‘Seeing the quiet way in which they laid down their lives for their peace principles,’ he said, ‘set me wondering whether Christ must not be grieved to find the war spirit so strong still among His followers, and that 1670 years after his birth the bulk of us still demand an eye for an eye and a tooth for a tooth.’ \n \n “We found that in addition to all his usual work he had been visiting many of these Quakers, who, under the persecuting laws of those times, were imprisoned in Newgate, Bishopsgate Gaol and the New Prison. It was in this fashion that he had taken a fever, for gaol fever raged among these prisoners for conscience’ sake; but he said he grudged not having taken the infection from them, for he hoped that he had caught from them, also, some of their noble and true thoughts. He spoke, too, of Lord Falkland’s craving for peace, and thought that, like him, the Quakers were in advance of the times, and were to lead the nation to truer and nobler ways of thought, particularly on this point about peace, which one day all men would see to be the only true Christ-following. \n \n “We were still talking of the Society of Friends when Dr Harford said he must go out again to visit two more patients. I remember we all three stood for a minute at the garden-gate, and can almost hear your uncle’s voice still as he said, ‘When they spoke of the duty of Christians to take no part in war, I used to feel as on the day when Waghorn would have pulled down the cross, and you spoke of love which is the bond of peace, and then coming hither we found Hilary standing beneath the yew tree holding open the gate for us.’ \n \n “His eyes grew wistful, and I noticed that his hand rested for a minute on the gate, as though anything she had touched was sacred to him. Then, his cheerfulness returning, he said he must pay a visit to the Tower of Refuge, and so we parted, for I knew that the place was full of memories to him and that he would fain be alone. \n \n “In about an hour your grandfather returned, and we went across the churchyard to find your uncle, talking as we went of the way in which the fever and the overwork had changed him. \n \n “‘He will need a long rest,’ said Dr. Harford. ‘He hath worn himself out with the woes of others and with the noisome air of those pestilent gaols.’ \n \n “I said it was after all natural enough, for he had ever had a special feeling for prisoners since his time in Oxford Castle, and Herefordshire was the very best place he could have come to for a rest and change. \n \n “Well, by that we had drawn near to the porch, and saw that he was sitting on this western bench and must have fallen asleep, for he had taken off the long curled wig that all gentlemen wore then much as they do now, and with his short hair he looked curiously like the Captain Harford who had saved Bosbury Cross. \n \n “But something in his perfect stillness struck Dr. Harford with sudden anxiety. We bent close down to him—he had ceased to breathe, and from his face death had smoothed away all the lines of sorrow, so that he looked once more young. I wish I could describe to you the wonderful serene dignity of his expression—but that is not to be put into words. Here in this porch where five-and-twenty years before I had wedded him to my dear niece, God had once more united the husband and wife.” \n \n \n \n \n \n “It is such a pity people have to die,” said Bobbie, kicking the flagstones with energy, because he saw tears in Mollie’s eyes and wished to keep them from his own. \n \n “You think so?” said his grandfather, with a smile. “And quite right too at your age. But when like me you are an old man of four-score years and ten, there’ll be so many waiting for you on the other side of the river that you’ll be glad when you are told to cross over. I hear your grandfather’s step on the path, Mollie, and when we two old friends chat over old times together, ’tis hard for you young ones to get in a word, so you had best go in and see the Harford monuments, and Bishop Swinfield’s head which was rescued from Hereford Cathedral.” \n \n “There’s no monument to Uncle Gabriel,” said Mollie, wiping away her tears. \n \n “My child, his body lies in the chancel, but Bosbury Cross is his monument, and he could not have a better,” said the Vicar. \n \n As the two children entered the church he took from the pocket of his doublet a small note-book, and added a line to an epitaph he had been trying to write, smiling to himself over Bobbie’s notion that it was a pity anybody died. \n \n \n I lay me down at expectation’s door; \n \n Weary and worn with age I crave no more. But \n \n Christus Jesus meus est omnia. \n \n —Will. Coke, 1690. \n \n As he finished the verse, Dr. Harford, marvellously erect and active for his eighty-five years, crossed the churchyard and sat down beside him in the porch. \n \n “I have come across a curious link with the past,” he said. “Chancing to be at Farmer Chadd’s just now where Meg is laid up, as you know, she gave me this ring which her husband had found yesterday when digging in the orchard. I fancy it must have dropped from Colonel Norton’s finger on the day of the duel, and have lain there unnoticed these five-and-forty years. The initials as you see are L. and N.” \n \n “Ay,” said the antiquary, putting up his glass and scrutinising the letters carefully; “two L’s for Lionel and Lucy. It must have been his wife’s wedding-ring. And here is the posy \n \n \n ‘Till death us departe— \n \n Nay not so deare harte— \n \n Death shall us more truly unite.’” \n \n \n “Poor Norton!” said the Vicar. “He was a man who might have lived such a different life! Well, who knows but that on Naseby Field God’s grace may, indeed, have delivered him from evil?” \n \n “I am always glad to think that he was one of Gabriel’s first patients,” said Dr. Harford, “and that those poor imprisoned Quakers, suffering so bravely in the cause of peace, were his last. We may say truly that in helping them he gave up his own life.” \n \n “And God be thanked that since our peaceful Revolution there are no more persecutions for opinion,” observed the Vicar. “We have passed through rough waters, doctor, yet have each of us been blessed with a loving wife, and have lived to see our children and our children’s children blessed in their career. But to my mind the noblest race was run by your son, Gabriel, who, indeed, died a hero of peace.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1855/53761.html","bookId":835,"book":{"id":835,"title":"In Spite of All：A Novel","description":"简介： Many loved Truth, and lavished lifes best oilAmid the dusk of books to find her....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1855","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
