{"id":33925,"no":31,"title":"CHAPTER XXXI. NED\u0027S ESCAPE.","content":"At length the confusion and uproar in the hold of Captain Briggs\u0027 schooner died away. The work of unloading the craft was completed. \\n\\n \\n\\n Ned glanced at his watch. It was close on midnight. He wondered if now that the schooner had been emptied of her secret cargo, his hour of release had come. \\n\\n \\n\\n But apparently it was no part of Captain Briggs\u0027s plan to set his prisoner at liberty just then. At any rate, nobody came near Ned. \\n\\n \\n\\n He felt strangely lonely now that the tumult had died out, to be succeeded by a death-like stillness. But after a time, during which he sought in vain for a lamp to light up the cabin, Ned was able to distinguish some sounds that broke the silence. \\n\\n \\n\\n [Pg 247] \\n\\n \\n\\n The sounds were nasal and were in three keys. In fact, it did not take Ned long to distinguish in his own mind the loud snoring of Captain Briggs from the gruntings and snortings of his crew. \\n\\n \\n\\n The night was warm and they were plainly enough taking their rest on deck after the arduous labors of the night. Inasmuch as the schooner lay in a lonely cove out of the path of navigation, it was also evident that Captain Briggs had not bothered to set a bright watch. \\n\\n \\n\\n \"Now is my chance,\" thought Ned, \"if only I could figure on some way of getting out of this coop.\" \\n\\n \\n\\n He sat on the transom a while, buried in thought. He was revolving in his mind the strange events of the last twenty-four hours and the possible effect they would have upon his future. \\n\\n \\n\\n Well did Ned know that his absence from his ship must have been noticed by this time. He[Pg 248] wondered what Commander Dunham was thinking. He speculated, and the thought was not a pleasant one, on the chances of his being deemed derelict to his duty, and being supplanted by someone else. \\n\\n \\n\\n The Dreadnought Boy knew the iron rules of the navy, laws as inflexible as those of the Medes and Persians. He might be deprived of his temporary commission without even a chance to explain all that had happened. One thought cheered him. Come what might, he at least had safe within his pocket the book of plans by which Kenworth and Saki set such store. \\n\\n \\n\\n He hoped that if the worst came to the worst, the signal service he had rendered his country in redeeming these from the desperate hands of the spy and the renegade would at least plead some extenuation for him. \\n\\n \\n\\n \"Confound that old shell-back of a Briggs,\" growled Ned to himself; \"if it hadn\u0027t been for[Pg 249] him I might have been back with my ship by this time. As it is——\" \\n\\n \\n\\n Captain Briggs\u0027 stentorian snore filled in the pause eloquently. \"At any rate,\" muttered Ned, \"he\u0027s safe off in the land of Nod; so, to judge by the sounds, are his crew. What\u0027s the matter with—Jove! I\u0027ll try it.\" \\n\\n \\n\\n He ascended the cabin stairway and began cautiously to fumble with the fastenings of the companionway scuttle. He did not dare make much noise, as, although he was fairly sure that Captain Briggs was beyond an easy awakening, yet the risk of rousing him was an imminent one. \\n\\n \\n\\n Like everything else about Captain Briggs\u0027 schooner, the scuttle, now that Ned came to prove it, did not appear to be over and above secure. \\n\\n \\n\\n \"I believe that with good luck I can force it clean off its hinges,\" murmured Ned as he investigated. \\n\\n \\n\\n Indeed it seemed so. The door worked about on its hinges so freely, it showed that those attachments[Pg 250] were not securely fastened or else, as was more likely, the wood had rotted about the screws. \\n\\n \\n\\n Ned possessed a good stock of patience and he took plenty of time, working the door about till it moved easily. Then he placed his shoulder to it and gave a gentle but strong heave. The screws drew out of the rotten wood as if they had been fastened into cheese. \\n\\n \\n\\n Five minutes after he had first applied his strength, Ned, feeling like a modern Samson, lifted off the door of his place of captivity and was ready to step out on deck. \\n\\n \\n\\n But first he took a cautious look about him. There was a bright moon. By its beams Ned saw that, as he had suspected, Captain Briggs and his crew, worn out by their night\u0027s work, were sleeping the sleep of the just. They had turned in \"all standing\" and lay sprawled on the deck in any but picturesque attitudes. \\n\\n \\n\\n \"So far, so good,\" murmured Ned to himself,[Pg 251] \"and the dinghy\u0027s out astern, too. Better and better. I believe that this is going to go through without a hitch.\" \\n\\n \\n\\n He cautiously replaced the hatchway and stepped boldly out on the deck. Captain Briggs stirred in his slumbers and growled out some orders that came to him in his dreams. \\n\\n \\n\\n \"Stand by to go about! Mind sheets and braces!\" he muttered. \\n\\n \\n\\n \"My! but he\u0027s going to be a surprised man when he wakes up!\" grinned Ned to himself. \"I\u0027m sorry for his crew; he\u0027ll take it out on them, for I verily believe that the old shell-back thought I was some boy millionaire and worth at least a thousand in reward money to him.\" \\n\\n \\n\\n But as chance would have it, it was Ned who was destined to be surprised first. \\n\\n \\n\\n Hardly had he stepped on deck, when from forward a squat shape came bounding across the moonlit decks. Simultaneously a low, angry growl greeted the Dreadnought Boy\u0027s ears. \\n\\n \\n\\n [Pg 252] \\n\\n \\n\\n \"Great guns! The skipper\u0027s dog! I\u0027d clean forgotten him,\" exclaimed Ned in dismay. \\n\\n \\n\\n The dog hesitated a minute, sniffed and then, with an angry snarl, came bounding on again. \\n\\n \\n\\n \"If I can\u0027t silence him, he\u0027ll have them all awake in a minute, and then I\u0027ll have a fine hornet\u0027s nest about my ears,\" muttered Ned. \\n\\n \\n\\n Ur-r-r-r-r-r-r-r! The dog sprang straight for Ned\u0027s throat. Luckily, the creature was not one of the barking kind. He plainly preferred action to noise. \\n\\n \\n\\n Ned saw him coming. Saw the white flash of his teeth in the moonlight. Swift as thought he stooped and picked up a barrel stave which happened to be lying near his feet. \\n\\n \\n\\n As the dog was in mid-spring, Ned let fly with his improvised weapon. Crack! It struck the dog right across the nose and sent him hurtling back in a coiled-up ball. \\n\\n \\n\\n \"Jove! I hated to do that, old fellow,\" cried[Pg 253] Ned in a low tone; \"but it had to be, and you\u0027ll soon get over it.\" \\n\\n \\n\\n The dog lay crouched in a whimpering heap not far from Captain Briggs\u0027 side. Ned dared not delay longer. With swift, silent strides he made for the stern, dropped overboard and landed deftly in the dinghy. \\n\\n \\n\\n The oars were in it, and to cast off was the work of an instant only. Then with strong, noiseless strokes, he pulled toward the shore. There was not a sound of pursuit from the schooner and Ned\u0027s heart leaped exultingly as he threw his strength into the oars. \\n\\n \\n\\n Ten minutes later the dinghy\u0027s nose scraped the beach. At precisely the same instant the bow of Ned\u0027s craft was grasped by a pair of strong hands, and a gruff voice demanded to know his business. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1775/51767.html","bookId":1110,"book":{"id":1110,"title":"The Dreadnought Boys in Home Waters","description":"简介： The interruption to the stolid apathy that had crept over the passengers, for the dust and heat had made them drowsy, came in the form of voices raised in anger and indignant protest....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1775","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
