{"id":33899,"no":5,"title":"CHAPTER V. OFF TO THEIR FIRST COMMAND.","content":"Herc felt a strong hand on his collar. The next second he was yanked to his feet \"all standing.\" Flushed, dust-covered and indignant he began a fusillade of irritated speech. \\n\\n \\n\\n But Ned cut short the flow with a peremptory gesture. \\n\\n \\n\\n \"That\u0027s quite enough. Come inside at once.\" \\n\\n \\n\\n \"But I——\" \\n\\n \\n\\n \"At once, I said; march!\" \\n\\n \\n\\n Herc knew it was no use to disobey, and with a backward look at Rankin, he sulkily climbed up the steps. Rankin picked himself up out of the dust. He appeared to be about to say something, but before he could find words, the two Dreadnought Boys were through the door of the hotel and inside the small office. \\n\\n \\n\\n [Pg 40] \\n\\n \\n\\n The drooping man, who had watched the battle without a shadow of interest or excitement, betrayed no great change in manner as he came forward. \\n\\n \\n\\n \"\u0027Kin I do fer yer?\" he inquired. \\n\\n \\n\\n \"We want to get a room here. Not for very long; just for sufficient time in which to change into our uniforms,\" explained Ned. \"We are expecting a Mr. Summerville of the United States Navy to meet us here.\" \\n\\n \\n\\n \"Be you in the navy?\" inquired the drooping man, allowing himself to betray momentarily a slight, very slight accession of interest. \\n\\n \\n\\n \"We are. We can get a room, I suppose?\" \\n\\n \\n\\n \"You kin, an\u0027 if you\u0027ll pardon my saying so, yer pardner sure needs a change.\" \\n\\n \\n\\n Herc colored hotly. The hotel man must have noticed this, for he went on. \\n\\n \\n\\n \"You don\u0027t know that feller Rankin, then?\" \\n\\n \\n\\n \"We do not,\" replied Ned shortly. \\n\\n \\n\\n \"\u0027Cause if you did, you\u0027d know he\u0027s always[Pg 41] picking quarrels. He\u0027s an \u0027sistant \u0027gineer on the Senecy, which I reckon is the boat yer goin\u0027 ter jine.\" \\n\\n \\n\\n \"Yes, I believe she is anchored off here. But will you show us to our room right away, please? We don\u0027t wish to keep Mr. Summerville waiting.\" \\n\\n \\n\\n The drooping and dejected landlord looked more dismal than ever as he showed the boys to a small room. It did not take them long to don the natty uniforms of junior officers in the United States Navy. While they changed their attire, Herc was roundly lectured by Ned for taking part in the scene in front of the hotel. \\n\\n \\n\\n \"I\u0027m sorry it happened,\" declared Ned; \"Rankin being a petty officer of the Seneca, too, doesn\u0027t make it any the easier.\" \\n\\n \\n\\n \"I ought to have lambasted him with my new sword,\" muttered Herc truculently. \\n\\n \\n\\n \"And made a bad matter worse.\" \\n\\n \\n\\n [Pg 42] \\n\\n \\n\\n \"I don\u0027t see how it would. That fellow needs a good lesson.\" \\n\\n \\n\\n \"You\u0027ll never teach him one in that way. Besides, naval officers don\u0027t behave in such a fashion. You must have dignity and self-control.\" \\n\\n \\n\\n \"Huh! If I\u0027d had foot control instead of self-control, I wouldn\u0027t have tumbled down those steps, and then nothing would have happened,\" grumbled Herc, tenderly patting a bump on the top of his head. \\n\\n \\n\\n \"You look like an officer, Ned,\" he went on a few moments later, as, pausing in his own preparations, he gazed at the trim, natty figure of Ned Strong. \\n\\n \\n\\n Herc was right. The slender, yet strongly built lad did indeed look every inch fitted for the quarter-deck of a naval vessel when, having finished his other sartorial duties, he buckled on his sword and adjusted his cap. \\n\\n \\n\\n \"Well, so do you, don\u0027t you?\" laughed Ned, watching Herc as, with a face fiery red with his[Pg 43] exertions, his comrade buckled himself into his tightly fitting uniform. \\n\\n \\n\\n \"Don\u0027t know,\" responded Herc briefly, \"I feel rather more like a tailor\u0027s dummy. How do I look?\" \\n\\n \\n\\n \"All right. But cool your face off in that water. It looks as if you\u0027d been taking a turn in the fire room.\" \\n\\n \\n\\n \"Well, so long as I don\u0027t do a flop over my sword, I don\u0027t care,\" rejoined Herc, as he carefully removed the scabbard of that weapon from between his knees where it threatened at any moment to cause disaster. \\n\\n \\n\\n Not many minutes later they descended from the room, just in time to be greeted by a stalwart coxswain. \\n\\n \\n\\n \"Lieutenant Strong, sir?\" asked the man, coming to attention just as Ned and Herc had done so often. \\n\\n \\n\\n It certainly felt strange to acknowledge the salute in an official way, not to mention being[Pg 44] addressed as Lieutenant. Herc was, in fact, compelled to hide a grin behind his pocket handkerchief. Luckily, Ned did not see this, or Herc might have had another lecture. \\n\\n \\n\\n \"Yes,\" rejoined Ned, returning the man\u0027s salute. \"You are from the Seneca?\" \\n\\n \\n\\n \"Aye, aye, sir. The gig is waiting to take you aboard, sir. Ensign Summerville sent his regrets, sir, and he is too busy attending to matters wirelessed from the flagship to come ashore himself.\" \\n\\n \\n\\n \"Very well, we may as well get aboard, then,\" said Ned. \\n\\n \\n\\n At this moment Rankin emerged from the hotel. He had evidently been busy removing traces of battle from his face, for his sallow countenance shone with soap. To say that he looked surprised when he saw Ned and Herc transformed into naval officers of rank much above his own, would be to put it mildly. That[Pg 45] expressive word \"flabbergasted\" better describes the look on Rankin\u0027s well-soaped visage. \\n\\n \\n\\n He was far too well trained in naval usage to put his astonishment into words, however. Returning from a furlough, he knew nothing, of course, of the change in the commanding officers of the Seneca; but he recognized that Ned, as his uniform showed, outranked Ensign Summerville, and from this fact deduced that he must have come to take command of the little gunboat. \\n\\n \\n\\n He drew himself up and saluted with naval conciseness. The boys returned the salute with perfect gravity. To judge by the countenances of all three, no bystander would ever have guessed how it had been with them not so very long before. \\n\\n \\n\\n Herc, however, noted, perhaps not without a certain malicious satisfaction, that over Rankin\u0027s right eye was a plum-colored discoloration which appeared to be swelling. Once, too, when on the[Pg 46] way to the boat he happened to glance in Rankin\u0027s direction, he surprised a glowering look on the assistant engineer\u0027s face which was instantly wiped off when Rankin saw that he was being observed. \\n\\n \\n\\n \"Huh, that was a quick change, like sponging something off a slate,\" thought Herc to himself. \"However, Mr. Rankin, I\u0027ve no idea that you love your second in command any better than you ought to. I guess I\u0027ll keep my weather eye on you, for at times you certainly do look most uncommonly like a rattlesnake.\" \\n\\n \\n\\n The coxswain had taken charge of the boys\u0027 suit and sword cases. Rankin carried his own valise. It did not take them long to reach the little wharf, alongside which lay the Seneca\u0027s gig, the four men of her crew smoking and lolling at their ease at her oarlocks. \\n\\n \\n\\n Like a flash all inertia vanished as Ned and Herc hove in sight. The coxswain saluted once more. The men saluted. Ned and Herc saluted. \\n\\n \\n\\n [Pg 47] \\n\\n \\n\\n As the two lads sank into the stern thwart seat, Herc found opportunity to whisper to Ned, \"Give me a teeny jab with that sword if you can.\" \\n\\n \\n\\n \"Why on earth do you want me to do that?\" demanded Ned, in astonishment at Herc\u0027s seemingly perfectly serious request. \\n\\n \\n\\n With his hand over his mouth Herc gave a veiled rejoinder. \\n\\n \\n\\n \"Because if it doesn\u0027t hurt, I\u0027ll know I\u0027m tucked in my little hammock and dreaming!\" \\n\\n \\n\\n \"All ready, sir,\" suggested the coxswain, taking his seat. \\n\\n \\n\\n \"Give way,\" ordered Ned calmly, and the four oars struck the water like one. \\n\\n \\n\\n The boys were fairly off on their way to their first command. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1775/51741.html","bookId":1110,"book":{"id":1110,"title":"The Dreadnought Boys in Home Waters","description":"简介： The interruption to the stolid apathy that had crept over the passengers, for the dust and heat had made them drowsy, came in the form of voices raised in anger and indignant protest....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1775","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
