{"id":92352,"no":30,"title":"Page 30","content":"\"I see you\u0027re abusing my hospitality and my office furniture,\" a cool, deep voice said from the doorway. \"So where\u0027s the party?\"\\n\\n Snow, still dressed from his stage show, stood in his office doorway looking like an alabaster statue in his white leather catsuit. His ever-present sunglasses seemed to be taking in my midnight-blue velvet gown, not my desperate all-business face. At least they inspected me from top to bottom.\\n\\n \"I\u0027ll abuse more than that before I leave,\" I warned him. \"Listen. I\u0027ve uncovered an unthinkable scenario for Vegas and the world. I need back-up. I need...Grizelle as a six-hundred-pound tiger. I need Genghis Khan and his hordes. The Egyptian vampires at the Karnak have a zombie army and they\u0027re holding Ric captive!\"\\n\\n \"Egyptian vampires? You must be drunk on Albino Vampires.\" Snow\u0027s sunglasses nodded at the half-full glass on the desk. \"\u0027Grizelle said you stormed my office in a mad fury, but you\u0027re dressed for a waltz, not a rescue mission.\"\\n\\n I was sweating bullets in my frail vintage velvet gown, melting from the agony of every single second of delay, but I didn\u0027t care. I realized there was another reason the CinSims had called me to the Inferno. Who but CinSims would know what the hotel must harbor on its many secret underground levels? If it was indeed modeled on Dante\u0027s Inferno, it could house an army of horrors below.\\n\\n \"Look, Snow. You\u0027ve finally got what you want: me begging you for something. I need your help to save Ric. I don\u0027t care what you are, I don\u0027t care what you do, I just know you\u0027re the only...whatever... in Vegas that can bring any force up against those demented demigods at the Karnak.\"\\n\\n \"And how do you know demented demigods run the Karnak?\"\\n\\n \"They sent their hell-raising sacred hyenas after me, so I got curious and paid them a visit two days ago. I found a hall of mummies, warriors who step out from walls and a sick pair of siblings who think they\u0027re a pharaoh in duplicate.\"\\n\\n \"Sounds like the usual spectacular Vegas theme hotel.\"\\n\\n \"This was under the hotel.\"\\n\\n \"Why would these escapees from a Cecil B. DeMille spectacular want Ricardo Montoya?\"\\n\\n \"Are you brainless? He\u0027s the Cadaver Kid! They want him to find dead bodies. Hidden, undead vampire bodies, lost for centuries. You said yourself the vamps were driven out of Vegas during the founding days seventy years ago and wanted back in.\"\\n\\n \"I had more modern vampires in mind.\"\\n\\n \"Well, they didn\u0027t! There\u0027s no time to debate this. They\u0027ve got an army down there. You happy with that in the neighborhood?\"\\n\\n He said nothing.\\n\\n \"Those monsters have had Ric for almost eighteen hours, for God\u0027s sake!\"\\n\\n \"God is not in Vegas.\"\\n\\n \"For pity\u0027s sake.\"\\n\\n \"Pity is not a commodity in Vegas.\"\\n\\n \"For humanity\u0027s sake.\"\\n\\n \"Humanity is not worth much to many these days.\"\\n\\n Didn\u0027t I know that from my orphanage rearing?\\n\\n \"Why are you so sure you need me?\" he asked.\\n\\n \"You fight dirty, Snow. That\u0027s why I need you.\"\\n\\n His smile was slow. \"That\u0027s not why you need me, Delilah. You need me because you need Ricardo Montoya.\"\\n\\n \"Bastard! Loveless, soulless monster! You have Grizelle. You have your whole Inferno hotel security force. You have whatever evil creatures inhabit the Lower Circles of your Hotel Hell. I can tell you now who the vampire was who died with Loretta Cicereau.\"\\n\\n \"That\u0027s a very small matter in the fate of Las Vegas and its hidden founders and masters and mistresses and ignorant human occupants, including you. Why should I get involved?\"\\n\\n \"I don\u0027t have time to haggle with you. You want me to beg? All right. You said I would someday and I will. I\u0027ll take your damned Brimstone Kiss now.\"\\n\\n \"An army of support for one kiss? You expect me to attack a neighboring hotel-casino on the basis of that?\"\\n\\n \"Yes! The groupies are too easy for your ego. If you\u0027re a vampire, you\u0027ll want to destroy the upstart vampires who are trying to take over your territory anyway. If you\u0027re a fallen angel, you\u0027ll want to look better in my eyes and redeem your own shoddy soul. If you\u0027re a demon, you\u0027ll want to soil my soul. If you\u0027re just a very bad man, you\u0027ll want to humiliate and conquer me.\"\\n\\n \"And why would I want that?\"\\n\\n \"Because you need to bring someone else down to your damned, lost level and I\u0027m finally willing to go. For a price.\"\\n\\n He licked his dead-white lips. Honest to God. Or Gehenna.\\n\\n He was nervous, or hungry.\\n\\n Whichever, it was all about me and the desperate spot I was in.\\n\\n Not because I\u0027m Lilith\u0027s double. Not because I\u0027m a woman and supposed to be conquered. It\u0027s because I have nothing but true love in my heart and desperation in my soul. I\u0027m awash with frantic, selfless fear and devotion. If I could trade my life for Ric\u0027s, I would. But I can only try to rescue him, at any cost. I\u0027m a tasty treat for anything evil under the sun.\\n\\n He was infuriatingly slow to respond. \"I told you that one day you\u0027d beg for it.\"\\n\\n \"It?\" Even now, I wanted to be certain of the price.\\n\\n \"The Brimstone Kiss. You are the temptress, Delilah, who never wanted to be tempted.\"\\n\\n \"I\u0027m not tempted. I\u0027m desperate, like any other soul in Hell.\"\\n\\n \"They\u0027re desperate to get out. You\u0027re desperate to get in.\"\\n\\n \"There\u0027s no time. Do it.\"\\n\\n \"There is a price,\" he warned.\\n\\n \"With the Devil, isn\u0027t there always?\" I knew this was the most desperate negotiation of my life or my death.\\n\\n \"Perhaps. Perhaps you just think so. Bad press, you know.\"\\n\\n \"Get to it, Snow.\"\\n\\n He tilted his head to consider me, the dead-dark sunglasses winking with the overhead light reflections, adding false life to his hidden eyes.\\n\\n His long white locks, that\u0027s how I always thought of them-as locks, bondage-swooped into a silver shimmer as his head tilted. His hair was seductive, gleaming like his slightly opalescent skin and lips. And fingertips. If this wasn\u0027t the base material of my marauding metal ball and chain, I might actually like to feel it feathering against my bare skin. Just where, I wasn\u0027t prepared to imagine.\\n\\n \"A kiss,\" he said. Or hissed.\\n\\n That disconcertingly white eyebrow lifted above the top rim of one black sunglass lens. What were his eyes like? Pink like the Easter Bunny? Or crimson like a sated vamp\u0027s? I\u0027d celebrated his rumored reputation as an Albino Vampire myself with the cocktail I\u0027d created in his dishonor.\\n\\n Right. Irma was being mum. I could still imagine her comment. Drugged slavery while you wait, with one perverted loving gesture. I\u0027d seen the results on the groupies. Of what use would I be then to save anyone else, much less myself?\\n\\n \"I\u0027ve seen your groupies sleep-walking around goo-goo eyed, wraiths, automatons, like Stepford wives. You seem to need a pretty big harem. No thanks. I\u0027m into one-on-ones.\"\\n\\n \"Old-fashioned.\"\\n\\n \"Alive and well.\"\\n\\n \"And independent.\"\\n\\n I didn\u0027t answer that. I wasn\u0027t very independent now, and knew it.\\n\\n \"Except you have obligations. One kiss. Then you can have anything you ask.\"\\n\\n \"Does it come with an apple?\"\\n\\n \"It\u0027s just one kiss, after all,\" he said.\\n\\n \"Addicted zombiedom is my only option?\"\\n\\n He put a pale, elegant hand to his pale, elegant, sculpted chest. Warm, living Carrara marble? Maybe living. \"Are you sure that\u0027s the only outcome?\"\\n\\n \"I know what happens to your kissees.\"\\n\\n \"But not what happens to you.\"\\n\\n \"I\u0027d be different?\"\\n\\n \"You are different already.\"\\n\\n \"Just another trophy for your ego, anyway.\"\\n\\n \"Just your only opportunity to save Montoya. He wouldn\u0027t want you to sacrifice yourself in the process, you know.\"\\n\\n I took a deep breath. \"I know.\"\\n\\n \"All this drama over one kiss. Surely even you have done that before.\"\\n\\n \"Yeah, you\u0027re Mr. Eternal Experience. Have you ever considered you might really just be... shopworn?\"\\n\\n \"You\u0027re taunting me because you\u0027re afraid.\"\\n\\n \"You bet.\" What the hell! Well, his hell. He was the only option I had. \"All right. Sentimental fleas do it. Let\u0027s do it.\"\\n\\n He seemed truly taken aback. \"You have to actually say \u0027yes\u0027.\"\\n\\n Was this like having to invite in a vampire for your own destruction?\\n\\n \"Yes!\" I sounded exasperated even to myself. It wasn\u0027t the dazzled wimpy \u0027yes\u0027 he\u0027d expected maybe.\\n\\n \"A kiss can\u0027t be rushed,\" he warned.\\n\\n \"Not a Judas kiss, no. It has to sink in slowly, like slime.\"\\n\\n \"It will take what time it takes. Do you agree?\"\\n\\n \"Anything. Just... get started.\"\\n\\n \"How is that to happen?\"\\n\\n I shrugged in helpless fury, picturing Ric in the hands of the ancient undead, the unhuman, those determined to extract the secret of his cursed gift of giving animation to the lifeless. To force him to raise the dead he\u0027d sworn never to violate again with his power.\\n\\n Then Grizelle was suddenly at Snow\u0027s back, wearing a heavy metal leather wetsuit from hooded head to booted feet.\\n\\n He handed her a device like an iPod on which he\u0027d hit several buttons in succession. \"Contact the first tier to bring their best fighters. Roust the second tier of our own forces and contact the enemies I highlighted.\"\\n\\n \"How will you move such a force openly through Las Vegas?\" she asked.\\n\\n \"I won\u0027t. Miss Street and I will need vampire-fighting gear. I think you can guess her size.\"\\n\\n Grizelle\u0027s gaze nearly fried me on my bones. \"She\u0027s coming with us?\"\\n\\n \"She\u0027s our Joan of Arc,\" Snow said with a tight smile. \"Now leave us. We have some business to finish while you\u0027re mustering the forces.\"\\n\\n Grizelle hesitated. For only a second, but she did hesitate.\\n\\n Snow\u0027s frown lines above the glass frames set her in rapid retreat, already beating out a tom-tom rhythm on the device.\\n\\n Snow turned back to me.\\n\\n The sunglasses studied me from head to foot.\\n\\n \"You must forget everything else but this, for the duration,\" he said. \"You must accept it totally. Any worry or withholding will have dire consequences. Furthermore, I won\u0027t accept the deal as done if you falter. It will all be for nothing.\"\\n\\n \"Fine. I have one condition,\" I said.\\n\\n \"You\u0027re in no position to bargain, but what is it?\"\\n\\n \"You ditch the sunglasses. I won\u0027t sell my soul to anyone who can\u0027t look me in the eyes.\"\\n\\n His silence seemed endless, but he finally peeled off and tossed the sunglasses aside.\\n\\n I didn\u0027t even glance to see where the hateful \"shades\" fell.\\n\\n His eyes-!\\n\\n The pupils weren\u0027t just albino pink, like I\u0027d imagined, but deep magenta, faceted like jewels, blinding to look into. The sunglasses weren\u0027t worn to protect an albino\u0027s weak unpigmented eyes and eyesight, as I\u0027d assumed, but to protect others from his searing glance.\\n\\n I stood there blinking, my eyes watering.\\n\\n \"It begins then,\" Snow said. \"You can\u0027t go back.\"\\n\\n Shit! Who ever could?\\n\\n I stopped trying to talk him into anything, just let out a long deep breath, buttressed by the taste of the Albino Vampire still on my tongue, and awaited my fate.\\n\\n Not that I wasn\u0027t worried. I hoped that even a trio of orgasms in triplicate couldn\u0027t enslave me body, mind and soul forever, or even half an hour. Yet, what if there was some other addictive element to the Brimstone Kiss?\\n\\n And, worst of all, by submitting to another man\u0027s intimacy, I was compromising my love for Ric. To save him, I\u0027d have to betray him.\\n\\n I just wanted us to be together again, the same as we were. Ric the same. Me the same. Surely a mere day couldn\u0027t destroy that? Who was I kidding? An hour, the wrong hour, had destroyed love time and time again in lives immemorial.\\n\\n So my knees and soul were shaking just as hard as I stood there, waiting to be sold down river.\\n\\n Snow tilted his head the other way. Damn, he had good hair! A girl would kill for that hair. Then his hands reached up... crimped into my blue velvet gown at the gathered vintage shoulders and pulled it open to my waist.\\n\\n I was naked beneath. The brutal stripping action made the ebbing velvet feel as raw as duct tape searing my skin as it was torn away. Already it was more than a kiss. It was complete surrender.\\n\\n His hands cupped to capture my naked breasts.\\n\\n Something icy flowed over my heart.\\n\\n Not fear, nothing inner. I looked down where Snow\u0027s half-lidded magenta eyes were focused.\\n\\n Whoa. Major exposure, sans bra. I felt a chill silver flood rising. Instant silver bustier, courtesy of his own initial manufacture.\\n\\n The pale lips smiled. \"You have a way of winning allies,\" he murmured.\\n\\n His flesh-seeking hands had captured the cool silver expanse of a metal mesh bustier that had sped to cover my bared breasts.\\n\\n \"You\u0027ve formally surrendered, Delilah. Release your familiar.\"\\n\\n \"But it\u0027s yours! It\u0027s your unwanted, leeching familiar made of hair-turned-metal. I\u0027ve never been able to take it off or make it release me. It simply wanders my body, as your hands do now, taking on whatever whimsical form suits it, tormenting me with bad memories and ugly questions.\"\\n\\n His head with its long white strands shook slowly. \"Mine the lock of hair, yes. Yours what it became, what it made of you and you of it. I\u0027ve never commanded this snake of white hair turned goad and guardian. And you must know that.\"\\n\\n \"No!\" I didn\u0027t. \"Not for an instant.\"\\n\\n \"I can\u0027t give you the Brimstone Kiss while you wear it in any form.\"\\n\\n \"I can\u0027t get it off!\"\\n\\n \"But you can let it leave.\"\\n\\n Let it leave? That simple? Not fight it? Just let water flow downhill, silver melt into hot metal, worry wilt into wishes. Just... let it go. Just click my heels and go home? Then what was all this for! I stopped questioning, rebelling, and sighed.\\n\\n My metal bustier turned warm and pliant, flowing up Snow\u0027s wrists and arms, where it formed matching metal gauntlets that warded his forearms.\\n\\n My talisman was cozying up to my bitter enemy. He was armed while I stood half-naked before him. I felt an absence so intense that it took my breath away. I\u0027d loathed the daily reminder of his meddling, yet felt as if another defensive curtain had been ripped away.\\n\\n Then... I felt free.\\n\\n Again.\\n\\n It was like getting a rotten tooth pulled. I\u0027d gotten used to the daily ache and now glimpsed utter liberty. Yes! I had only to pull away from his fingertips and I\u0027d be free of Snow and his possessive toys. I was moving...shaking him off like a bad dream, of which I\u0027d had plenty.\\n\\n \"Montoya,\" he reminded me.\\n\\n We both stood frozen as statues. Some classical subject, a Greek god in human form pursuing unwilling nymph. Me starting to twist away. He starting to tighten his grip on my naked forearms so the pale marble would seem as pliable as bread dough, flesh sinking into flesh, only everything was stone inside.\\n\\n I shivered from cold or fear or fury, or all three. I felt all three states, holding still to submit when every muscle was poised to twitch with revulsion at being here, doing this.\\n\\n Ric would say no to my deal with the Devil, with his last breath. I knew he would never submit to the vampires who held him. not the boy who had resisted the human coyotes who had abused him unimaginably time and again. He might be already dead, lost, and this sacrifice was futile.\\n\\n To save Ric and our love at the price of being mauled and put in thrall to another man\u0027s kiss, no matter how supernatural... I knew I was forsaking what I cared for most for the mere chance to save the person I cared for most.\\n\\n But this was my deal.\\n\\n I shut my eyes, feeling Snow\u0027s cool hands finally closing on my undefended breasts, and shuddered. His thumbs touched my nipples to harden them.\\n\\n \"C-c-cold,\" I stuttered, an explanation for my apparent arousal.\\n\\n \"You\u0027ll be warm soon. Very warm.\" He pulled me closer. \"Open your eyes. You wanted to see.\"\\n\\n I batted them open. Looking into his eyes no longer made me blink. The pupils had expanded into black bottomless pools, the gemstone facets a mere ring of glitter around them.\\n\\n Snow desired this. Snow desired me, my surrender.\\n\\n Remaining still defied every screaming nerve in my body.\\n\\n I kept my emotions battened down, dead. I made myself into what I thought a zombie was: a mindless, will-less shell that felt nothing, cared nothing, only shuffled dutifully to do others\u0027 bidding...\\n\\n Snow\u0027s hands continued to caress my breasts; harshly would have been deliverance, but his gestures were as delicate as a surgeon\u0027s. I felt like Lilith on the autopsy table, mock-dead, or dead, what did it matter in the face of a fatal violation of the flesh?\\n\\n His face bent towards mine. I kept my eyes open, staring straight ahead, dead ahead. I should have known I wouldn\u0027t get by with the sudden, deep, passing Brimstone Kiss of the mosh pit.\\n\\n \"Just one kiss,\" the pale lips moved.\\n\\n My freedom! My heart\u0027s willing slavery.\\n\\n I shrugged, but his hands never lost their custodial grip. I lifted my chin and, by default my face, my lips.\\n\\n He pulled me toward him, bent his head to touch his ivory-cold lips to mine. Kiss Death, while you\u0027re at it, Delilah. Embrace a statue, snuggle up to stainless steel, become a body on an autopsy table, motionless, unfeeling, a sex object for the lifeless at heart.\\n\\n His lips met mine, then his tongue.\\n\\n It was unexpectedly, shockingly warm. Hot. Feverish. His fingertips on my naked shoulders almost sizzled.\\n\\n As I\u0027d feared, his kiss was not the hit-and-run lip lock he doled out from the stage, which he\u0027d end like a revivalist minister with a palm to the forehead that pushed the recipient down and away to be borne away on a litter of mosh pit bodies.\\n\\n It was more like a 132-car pileup on a misty mountain road, a series of domino-falling shocks that just kept on coming. It was a dozen, then a hundred, yet his lips never left mine, just nibbled, teased, probed, stroked, sucked. When his tongue took control it moved like a silver snake, fast, sleek and deep into me, into my very heart and soul, which I felt as a molten drop of forgotten memory, silver mercury, at my center, behind my navel, spiraling out to my every extremity.\\n\\n I hardly felt it when he pressed my bare chest against his and moved his hands to my throat and the nape of my neck, on shoulders and cheeks, all to position me for endless variations on a kiss.\\n\\n His breath smelled of frost and he tasted of Albino Vampire. Or maybe that was me.\\n\\n I could feel the overpowering and inevitable response like a slowly building volcanic eruption from deep within the landscape of my soul.\\n\\n The tremors made my hands shake so much that I curled them into the edges of the white leather that lay open against his pale chest, hairless, scarred by silver lightning bolts.\\n\\n My knees were shaking, but his hands were holding me up by the face alone. And still he continued the slow, sensual exploration of my mouth, and now my throat felt the irresistible pull...my throat aching as if it was between my legs, tightening, tautening, so much so that a hoarse moan sought escape.\\n\\n In a moment all my muscles inward and outward would erupt in spasms of orgasmic abandon.\\n\\n I would be lost and the deal sealed.\\n\\n Except... I remained clenched on the brink and did not plunge over.\\n\\n Did not climax, not in triplicate. Not once.\\n\\n I screamed anyway and swooned like a damn Snowaholic, then fell into black velvet darkness illuminated by heat lighting strikes and the thunder beat of my overstressed heart. It felt like red-hot death. \\n\\n","sourceLink":"https://allnovel.net/brimstone-kiss-delilah-street-2/page-30.html","bookId":2114,"book":{"id":2114,"title":"Brimstone Kiss (Delilah Street #2)","description":"Storyline: Brimstone Kiss (Delilah Street #2) \\n This book read like a first draft - maybe they just printed the wrong version? There were numerous times where you could see how the writer was figuring out how to develop her story. For example, Del and Ric go to the morgue. They have a little conversation about now that the werewolves know that they dug up the boss\u0027s daughter, they need to ID the other corpse pronto. Once the police announce both ID\u0027s, they\u0027ll be a lot safer. Then Ric makes a cute suggestive comment and they enter the morgue.\\n","cover":"https://allnovel.net/images/brimstone-kiss-delilah-street-2.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/brimstone-kiss-delilah-street-2.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:54:50 PM"}}
