{"id":107177,"no":8,"title":"Page 8","content":"Bail Channis sat in the small white-tiled room and allowed his mind to relax. He was content to live in the present. There were the walls and the window and the grass outside. They had no names. They were just things. There was a bed and a chair an books that developed themselves idly on the screen at the foot of his bed. There was the nurse who brought him his food.\\n\\n At first he had made efforts to piece together the scraps of things he had heard. Such as those two men talking together.\\n\\n One had said: \"Complete aphasia now. It\u0027s cleaned out, and I think without damage. It will only be necessary to return the recording of his original brain-wave makeup.\"\\n\\n He remembered the sounds by rote, and for some reason they seemed peculiar sounds - as if they meant something. But why bother.\\n\\n Better to watch the pretty changing colors on the screen at the foot of the thing he lay on.\\n\\n And then someone entered and did things to him and for a long time, he slept.\\n\\n And when that had passed, the bed was suddenly a bed and he knew he was in a hospital, and the words he remembered made sense.\\n\\n He sat up: \"What\u0027s happening?\"\\n\\n The First Speaker was beside him, \"You\u0027re on the Second Foundation, and you have your mind back - your original mind.\"\\n\\n \"Yes! Yes!\" Channis came to the realization that he was himself, and there was incredible triumph and joy in that.\\n\\n \"And now tell me,\" said the First Speaker, \"do you know where the Second Foundation is now?\"\\n\\n And the truth came flooding down in one enormous wave and Channis did not answer. Like Ebling Mis before him, he was conscious of only one vast, numbing surprise.\\n\\n Until he finally nodded, and said: \"By the Stars of the Galaxy - now, I know.\" \\n\\n","sourceLink":"https://allnovel.net/second-foundation-foundation-3/page-8.html","bookId":2017,"book":{"id":2017,"title":"Second Foundation (Foundation #3)","description":"Storyline: As unsurpassed blend of nonstop action, daring ideas, and extensive world-building, they chronicle the struggle of a courageous group of men and women dedicated to preserving humanity\u0027s light in a galaxy plunged into a nightmare of ignorance and violence thirty thousand years long. After years of struggle, the Foundation lies in ruins - destroyed by the mutant mind power of the Mule. But it is rumored that there is a Second Foundation hidden somewhere at the end of the Galaxy, established to preserve the knowledge of mankind through the long centuries of barbarism. The Mule failed to find it the first time - but now he is certain he knows where it lies. The fate of the Foundation rests on young Arcadia Darell, only fourteen years old and burdened with a terrible secret. As its scientists gird for a final showdown with the Mule, the survivors of the First Foundation begin their desperate search. They too want the Second Foundation destroyed...before it destroys them.\\n","cover":"https://allnovel.net/images/second-foundation-foundation-3.jpg","author":"Isaac Asimov","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/second-foundation-foundation-3.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 11:04:30 PM"}}
