{"id":5670,"no":121,"title":"Chapter 122","content":"122:1 [hgb] （ 大 卫 上 行 之 诗 。 ） 人 对 我 说 ， 我 们 往 耶 和 华 的 殿 去 ， 我 就 欢 喜 。 \\n\\n [kjv] I was glad when they said unto me, Let us go into the house of the LORD. \\n\\n [bbe] \u003cA Song of the going up. Of David.\u003e I was glad because they said to me, We will go into the house of the Lord. \\n\\n 122:2 [hgb] 耶 路 撒 冷 阿 ， 我 们 的 脚 站 在 你 的 门 内 。 \\n\\n [kjv] Our feet shall stand within thy gates, O Jerusalem. \\n\\n [bbe] At last our feet were inside your doors, O Jerusalem. \\n\\n 122:3 [hgb] 耶 路 撒 冷 被 建 造 ， 如 同 连 络 整 齐 的 一 座 城 。 \\n\\n [kjv] Jerusalem is builded as a city that is compact together: \\n\\n [bbe] O Jerusalem, you are like a town which is well joined together; \\n\\n 122:4 [hgb] 众 支 派 ， 就 是 耶 和 华 的 支 派 ， 上 那 里 去 ， 按 以 色 列 的 常 例 （ 或 作 作 以 色 列 的 证 据 ） 称 赞 耶 和 华 的 名 。 \\n\\n [kjv] Whither the tribes go up, the tribes of the LORD, unto the testimony of Israel, to give thanks unto the name of the LORD. \\n\\n [bbe] To which the tribes went up, even the tribes of the Lord, for a witness to Israel, to give praise to the name of the Lord. \\n\\n 122:5 [hgb] 因 为 在 那 里 设 立 审 判 的 宝 座 ， 就 是 大 卫 家 的 宝 座 。 \\n\\n [kjv] For there are set thrones of judgment, the thrones of the house of David. \\n\\n [bbe] For there seats for the judges were placed, even the rulers\u0027 seats of the line of David. \\n\\n 122:6 [hgb] 你 们 要 为 耶 路 撒 冷 求 平 安 。 耶 路 撒 冷 阿 ， 爱 你 的 人 必 然 兴 旺 。 \\n\\n [kjv] Pray for the peace of Jerusalem: they shall prosper that love thee. \\n\\n [bbe] O make prayers for the peace of Jerusalem; may they whose love is given to you do well. \\n\\n 122:7 [hgb] 愿 你 城 中 平 安 ， 愿 你 宫 内 兴 旺 。 \\n\\n [kjv] Peace be within thy walls, and prosperity within thy palaces. \\n\\n [bbe] May peace be inside your walls, and wealth in your noble houses. \\n\\n 122:8 [hgb] 因 我 弟 兄 和 同 伴 的 缘 故 ， 我 要 说 ， 愿 平 安 在 你 中 间 。 \\n\\n [kjv] For my brethren and companions\u0027 sakes, I will now say, Peace be within thee. \\n\\n [bbe] Because of my brothers and friends, I will now say, Let peace be with you. \\n\\n 122:9 [hgb] 因 耶 和 华 我 们 神 殿 的 缘 故 ， 我 要 为 你 求 福 。 \\n\\n [kjv] Because of the house of the LORD our God I will seek thy good. \\n\\n [bbe] Because of the house of the Lord our God, I will be working for your good. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/116/1766.html","bookId":182,"book":{"id":182,"title":"诗篇 Psalms","description":"简介： 1:1 [hgb] 不 从 恶 人 的 计 谋 ， 不 站 罪 人 的 道 路 ， 不 坐 亵 慢 人 的 座 位 。 [kjv] Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/116","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:44 AM"}}
