{"id":5575,"no":26,"title":"Chapter 26","content":"26:1 [hgb] （ 大 卫 的 诗 。 ） 耶 和 华 阿 ， 求 你 为 我 伸 冤 ， 因 我 向 来 行 事 纯 全 ， 我 又 倚 靠 耶 和 华 并 不 摇 动 。 \\n\\n [kjv] Judge me, O LORD; for I have walked in mine integrity: I have trusted also in the LORD; therefore I shall not slide. \\n\\n [bbe] \u003cOf David.\u003e O Lord, be my judge, for my behaviour has been upright: I have put my faith in the Lord, I am not in danger of slipping. \\n\\n 26:2 [hgb] 耶 和 华 阿 ， 求 你 察 看 我 ， 试 验 我 ， 熬 炼 我 的 肺 腑 心 肠 。 \\n\\n [kjv] Examine me, O LORD, and prove me; try my reins and my heart. \\n\\n [bbe] Put me in the scales, O Lord, so that I may be tested; let the fire make clean my thoughts and my heart. \\n\\n 26:3 [hgb] 因 为 你 的 慈 爱 常 在 我 眼 前 。 我 也 按 你 的 真 理 而 行 。 \\n\\n [kjv] For thy lovingkindness is before mine eyes: and I have walked in thy truth. \\n\\n [bbe] For your mercy is before my eyes; and I have gone in the way of your good faith. \\n\\n 26:4 [hgb] 我 没 有 和 虚 谎 人 同 坐 。 也 不 与 瞒 哄 人 的 同 群 。 \\n\\n [kjv] I have not sat with vain persons, neither will I go in with dissemblers. \\n\\n [bbe] I have not taken my seat with foolish persons, and I do not go with false men. \\n\\n 26:5 [hgb] 我 恨 恶 恶 人 的 会 ， 必 不 与 恶 人 同 坐 。 \\n\\n [kjv] I have hated the congregation of evil doers; and will not sit with the wicked. \\n\\n [bbe] I have been a hater of the band of wrongdoers, and I will not be seated among sinners. \\n\\n 26:6 [hgb] 耶 和 华 阿 ， 我 要 洗 手 表 明 无 辜 ， 才 环 绕 你 的 祭 坛 。 \\n\\n [kjv] I will wash mine hands in innocency: so will I compass thine altar, O LORD: \\n\\n [bbe] I will make my hands clean from sin; so will I go round your altar, O Lord; \\n\\n 26:7 [hgb] 我 好 发 称 谢 的 声 音 。 也 要 述 说 你 一 切 奇 妙 的 作 为 。 \\n\\n [kjv] That I may publish with the voice of thanksgiving, and tell of all thy wondrous works. \\n\\n [bbe] That I may give out the voice of praise, and make public all the wonders which you have done. \\n\\n 26:8 [hgb] 耶 和 华 阿 ， 我 喜 爱 你 所 住 的 殿 ， 和 你 显 荣 耀 的 居 所 。 \\n\\n [kjv] LORD, I have loved the habitation of thy house, and the place where thine honour dwelleth. \\n\\n [bbe] Lord, your house has been dear to me, and the resting-place of your glory. \\n\\n 26:9 [hgb] 不 要 把 我 的 灵 魂 和 罪 人 一 同 除 掉 ， 不 要 把 我 的 性 命 和 流 人 血 的 一 同 除 掉 。 \\n\\n [kjv] Gather not my soul with sinners, nor my life with bloody men: \\n\\n [bbe] Let not my soul be numbered among sinners, or my life among men of blood; \\n\\n 26:10 [hgb] 他 们 的 手 中 有 奸 恶 ， 右 手 满 有 贿 赂 。 \\n\\n [kjv] In whose hands is mischief, and their right hand is full of bribes. \\n\\n [bbe] In whose hands are evil designs, and whose right hands take money for judging falsely. \\n\\n 26:11 [hgb] 至 于 我 ， 却 要 行 事 纯 全 。 求 你 救 赎 我 ， 怜 恤 我 。 \\n\\n [kjv] But as for me, I will walk in mine integrity: redeem me, and be merciful unto me. \\n\\n [bbe] But as for me, I will go on in my upright ways: be my saviour, and have mercy on me. \\n\\n 26:12 [hgb] 我 的 脚 站 在 平 坦 地 方 。 在 众 会 中 我 要 称 颂 耶 和 华 。 \\n\\n [kjv] My foot standeth in an even place: in the congregations will I bless the LORD. \\n\\n [bbe] I have a safe resting-place for my feet; I will give praise to the Lord in the meetings of the people. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/116/1671.html","bookId":182,"book":{"id":182,"title":"诗篇 Psalms","description":"简介： 1:1 [hgb] 不 从 恶 人 的 计 谋 ， 不 站 罪 人 的 道 路 ， 不 坐 亵 慢 人 的 座 位 。 [kjv] Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/116","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:44 AM"}}
