{"id":5637,"no":88,"title":"Chapter 89","content":"89:1 [hgb] （ 以 斯 拉 人 以 探 的 训 诲 诗 。 ） 我 要 歌 唱 耶 和 华 的 慈 爱 ， 直 到 永 远 。 我 要 用 口 将 你 的 信 实 传 与 万 代 。 \n [kjv] I will sing of the mercies of the LORD for ever: with my mouth will I make known thy faithfulness to all generations. \n [bbe] \u003cMaschil. Of Ethan the Ezrahite.\u003e My song will be of the mercies of the Lord for ever: with my mouth will I make his faith clear to all generations. \n 89:2 [hgb] 因 我 曾 说 ， 你 的 慈 悲 ， 必 建 立 到 永 远 。 你 的 信 实 ， 必 坚 立 在 天 上 。 \n [kjv] For I have said, Mercy shall be built up for ever: thy faithfulness shalt thou establish in the very heavens. \n [bbe] For you have said, Mercy will be made strong for ever; my faith will be unchanging in the heavens. \n 89:3 [hgb] 我 与 我 所 拣 选 的 人 立 了 约 ， 向 我 的 仆 人 大 卫 起 了 誓 。 \n [kjv] I have made a covenant with my chosen, I have sworn unto David my servant, \n [bbe] I have made an agreement with the man of my selection, I have made an oath to David my servant; \n 89:4 [hgb] 我 要 建 立 你 的 后 裔 ， 直 到 永 远 ， 要 建 立 你 的 宝 座 ， 直 到 万 代 。 \n [kjv] Thy seed will I establish for ever, and build up thy throne to all generations. Selah. \n [bbe] I will make your seed go on for ever, your kingdom will be strong through all generations. (Selah.) \n 89:5 [hgb] 耶 和 华 阿 ， 诸 天 要 称 赞 你 的 奇 事 。 在 圣 者 的 会 中 ， 要 称 赞 你 的 信 实 。 \n [kjv] And the heavens shall praise thy wonders, O LORD: thy faithfulness also in the congregation of the saints. \n [bbe] In heaven let them give praise for your wonders, O Lord; and your unchanging faith among the saints. \n 89:6 [hgb] 在 天 空 谁 能 比 耶 和 华 呢 ？ 神 的 众 子 中 ， 谁 能 像 耶 和 华 呢 ？ \n [kjv] For who in the heaven can be compared unto the LORD? who among the sons of the mighty can be likened unto the LORD? \n [bbe] For who is there in the heavens in comparison with the Lord? who is like the Lord among the sons of the gods? \n 89:7 [hgb] 他 在 圣 者 的 会 中 ， 是 大 有 威 严 的 神 ， 比 一 切 在 他 四 围 的 更 可 畏 惧 。 \n [kjv] God is greatly to be feared in the assembly of the saints, and to be had in reverence of all them that are about him. \n [bbe] God is greatly to be feared among the saints, and to be honoured over all those who are about him. \n 89:8 [hgb] 耶 和 华 万 军 之 神 阿 ， 哪 一 个 大 能 者 象 你 耶 和 华 ？ 你 的 信 实 ， 是 在 你 的 四 围 。 \n [kjv] O LORD God of hosts, who is a strong LORD like unto thee? or to thy faithfulness round about thee? \n [bbe] O Lord God of armies, who is strong like you, O Jah? and your unchanging faith is round about you. \n 89:9 [hgb] 你 管 辖 海 的 狂 傲 。 波 浪 翻 腾 ， 你 就 使 他 平 静 了 。 \n [kjv] Thou rulest the raging of the sea: when the waves thereof arise, thou stillest them. \n [bbe] You have rule over the sea in storm; when its waves are troubled, you make them calm. \n 89:10 [hgb] 你 打 碎 了 拉 哈 伯 似 乎 是 已 杀 的 人 。 你 用 有 能 的 膀 臂 打 散 了 你 的 仇 敌 。 \n [kjv] Thou hast broken Rahab in pieces, as one that is slain; thou hast scattered thine enemies with thy strong arm. \n [bbe] Rahab was crushed by you like one wounded to death; with your strong arm you put to flight all your haters. \n 89:11 [hgb] 天 属 你 ， 地 也 属 你 。 世 界 和 其 中 所 充 满 的 ， 都 为 你 所 建 立 。 \n [kjv] The heavens are thine, the earth also is thine: as for the world and the fulness thereof, thou hast founded them. \n [bbe] Yours are the heavens, and the earth is yours; you have made the world, and everything which is in it. \n 89:12 [hgb] 南 北 为 你 所 创 造 。 他 泊 和 黑 门 都 因 你 的 名 欢 呼 。 \n [kjv] The north and the south thou hast created them: Tabor and Hermon shall rejoice in thy name. \n [bbe] You have made the north and the south; Tabor and Hermon are sounding with joy at your name. \n 89:13 [hgb] 你 有 大 能 的 膀 臂 。 你 的 手 有 力 ， 你 的 右 手 也 高 举 。 \n [kjv] Thou hast a mighty arm: strong is thy hand, and high is thy right hand. \n [bbe] Yours is an arm of power; strong is your hand and high your right hand. \n 89:14 [hgb] 公 义 和 公 平 ， 是 你 宝 座 的 根 基 。 慈 爱 和 诚 实 ， 行 在 你 前 面 。 \n [kjv] Justice and judgment are the habitation of thy throne: mercy and truth shall go before thy face. \n [bbe] The seat of your kingdom is resting on righteousness and right judging: mercy and good faith come before your face. \n 89:15 [hgb] 知 道 向 你 欢 呼 的 ， 那 民 是 有 福 的 。 耶 和 华 阿 ， 他 们 在 你 脸 上 的 光 里 行 走 。 \n [kjv] Blessed is the people that know the joyful sound: they shall walk, O LORD, in the light of thy countenance. \n [bbe] Happy are the people who have knowledge of the holy cry: the light of your face, O Lord, will be shining on their way. \n 89:16 [hgb] 他 们 因 你 的 名 终 日 欢 乐 ， 因 你 的 公 义 得 以 高 举 。 \n [kjv] In thy name shall they rejoice all the day: and in thy righteousness shall they be exalted. \n [bbe] In your name will they have joy all the day: in your righteousness will they be lifted up. \n 89:17 [hgb] 你 是 他 们 力 量 的 荣 耀 。 因 为 你 喜 悦 我 们 ， 我 们 的 角 必 被 高 举 。 \n [kjv] For thou art the glory of their strength: and in thy favour our horn shall be exalted. \n [bbe] For you are the glory of their strength; in your pleasure will our horn be lifted up. \n 89:18 [hgb] 我 们 的 盾 牌 属 耶 和 华 。 我 们 的 王 属 以 色 列 的 圣 者 。 \n [kjv] For the LORD is our defence; and the Holy One of Israel is our king. \n [bbe] For our breastplate is the Lord; and our king is the Holy One of Israel\u0027s. \n 89:19 [hgb] 当 时 你 在 异 象 中 晓 谕 你 的 圣 民 ， 说 ， 我 已 把 救 助 之 力 ， 加 在 那 有 能 者 的 身 上 。 我 高 举 那 从 民 中 所 拣 选 的 。 \n [kjv] Then thou spakest in vision to thy holy one, and saidst, I have laid help upon one that is mighty; I have exalted one chosen out of the people. \n [bbe] Then your voice came to your holy one in a vision, saying, I have put the crown on a strong one, lifting up one taken from among the people. \n 89:20 [hgb] 我 寻 得 我 的 仆 人 大 卫 ， 用 我 的 圣 膏 膏 他 。 \n [kjv] I have found David my servant; with my holy oil have I anointed him: \n [bbe] I have made discovery of David my servant; I have put my holy oil on his head. \n 89:21 [hgb] 我 的 手 必 使 他 坚 立 。 我 的 膀 臂 也 必 坚 固 他 。 \n [kjv] With whom my hand shall be established: mine arm also shall strengthen him. \n [bbe] My hand will be his support; my arm will give him strength. \n 89:22 [hgb] 仇 敌 必 不 勒 索 他 ， 凶 恶 之 子 ， 也 不 苦 害 他 。 \n [kjv] The enemy shall not exact upon him; nor the son of wickedness afflict him. \n [bbe] The deceit of those who are against him will not overcome him; he will not be troubled by the sons of evil. \n 89:23 [hgb] 我 要 在 他 面 前 打 碎 他 的 敌 人 ， 击 杀 那 恨 他 的 人 。 \n [kjv] And I will beat down his foes before his face, and plague them that hate him. \n [bbe] I will have those who are against him broken before his face, and his haters will be crushed under my blows. \n 89:24 [hgb] 只 是 我 的 信 实 ， 和 我 的 慈 爱 ， 要 与 他 同 在 。 因 我 的 名 ， 他 的 角 必 被 高 举 。 \n [kjv] But my faithfulness and my mercy shall be with him: and in my name shall his horn be exalted. \n [bbe] But my faith and my mercy will be with him; and in my name will his horn be lifted up. \n 89:25 [hgb] 我 要 使 他 的 左 手 伸 到 海 上 ， 右 手 伸 到 河 上 。 \n [kjv] I will set his hand also in the sea, and his right hand in the rivers. \n [bbe] I will put his hand in the sea, and his right hand in the rivers. \n 89:26 [hgb] 他 要 称 呼 我 说 ， 你 是 我 的 父 是 我 的 神 ， 是 拯 救 我 的 磐 石 。 \n [kjv] He shall cry unto me, Thou art my father, my God, and the rock of my salvation. \n [bbe] He will say to me, You are my father, my God, and the Rock of my salvation. \n 89:27 [hgb] 我 也 要 立 他 为 长 子 ， 为 世 上 最 高 的 君 王 。 \n [kjv] Also I will make him my firstborn, higher than the kings of the earth. \n [bbe] And I will make him the first of my sons, most high over the kings of the earth. \n 89:28 [hgb] 我 要 为 他 存 留 我 的 慈 爱 ， 直 到 永 远 。 我 与 他 立 的 约 ， 必 要 坚 定 。 \n [kjv] My mercy will I keep for him for evermore, and my covenant shall stand fast with him. \n [bbe] I will keep my mercy for him for ever; my agreement with him will not be changed. \n 89:29 [hgb] 我 也 要 使 他 的 后 裔 ， 存 到 永 远 ， 使 他 的 宝 座 ， 如 天 之 久 。 \n [kjv] His seed also will I make to endure for ever, and his throne as the days of heaven. \n [bbe] His seed will keep their place for ever; his kingdom will be eternal, like the heavens. \n 89:30 [hgb] 倘 若 他 的 子 孙 离 弃 我 的 律 法 ， 不 照 我 的 典 章 行 。 \n [kjv] If his children forsake my law, and walk not in my judgments; \n [bbe] If his children give up my law, and are not ruled by my decisions; \n 89:31 [hgb] 背 弃 我 的 律 例 ， 不 遵 守 我 的 诫 命 。 \n [kjv] If they break my statutes, and keep not my commandments; \n [bbe] If my rules are broken, and my orders are not kept; \n 89:32 [hgb] 我 就 要 用 杖 责 罚 他 们 的 过 犯 ， 用 鞭 责 罚 他 们 的 罪 孽 。 \n [kjv] Then will I visit their transgression with the rod, and their iniquity with stripes. \n [bbe] Then I will send punishment on them for their sin; my rod will be the reward of their evil-doing. \n 89:33 [hgb] 只 是 我 必 不 将 我 的 慈 爱 ， 全 然 收 回 ， 也 必 不 叫 我 的 信 实 废 弃 。 \n [kjv] Nevertheless my lovingkindness will I not utterly take from him, nor suffer my faithfulness to fail. \n [bbe] But I will not take away my mercy from him, and will not be false to my faith. \n 89:34 [hgb] 我 必 不 背 弃 我 的 约 ， 也 不 改 变 我 口 中 所 出 的 。 \n [kjv] My covenant will I not break, nor alter the thing that is gone out of my lips. \n [bbe] I will be true to my agreement; the things which have gone out of my lips will not be changed. \n 89:35 [hgb] 我 一 次 指 着 自 己 的 圣 洁 起 誓 。 我 决 不 向 大 卫 说 谎 。 \n [kjv] Once have I sworn by my holiness that I will not lie unto David. \n [bbe] I have made an oath once by my holy name, that I will not be false to David. \n 89:36 [hgb] 他 的 后 裔 要 存 到 永 远 ， 他 的 宝 座 在 我 面 前 ， 如 日 之 恒 一 般 。 \n [kjv] His seed shall endure for ever, and his throne as the sun before me. \n [bbe] His seed will not come to an end for ever; the seat of his kingdom will be like the sun before me. \n 89:37 [hgb] 又 如 月 亮 永 远 坚 立 ， 如 天 上 确 实 的 见 证 。 （ 细 拉 ） \n [kjv] It shall be established for ever as the moon, and as a faithful witness in heaven. Selah. \n [bbe] It will be fixed for ever like the moon; and the witness in heaven is true. (Selah.) \n 89:38 [hgb] 但 你 恼 怒 你 的 受 膏 者 ， 就 丢 掉 弃 绝 他 。 \n [kjv] But thou hast cast off and abhorred, thou hast been wroth with thine anointed. \n [bbe] But you have put him away in disgust; you have been angry with the king of your selection. \n 89:39 [hgb] 你 厌 恶 了 与 仆 人 所 立 的 约 ， 将 他 的 冠 冕 践 踏 于 地 。 \n [kjv] Thou hast made void the covenant of thy servant: thou hast profaned his crown by casting it to the ground. \n [bbe] You have made your agreement with your servant of no effect: you have had no respect for his crown, it has come down even to the earth. \n 89:40 [hgb] 你 拆 毁 了 他 一 切 的 篱 笆 。 使 他 的 保 障 ， 变 为 荒 场 。 \n [kjv] Thou hast broken down all his hedges; thou hast brought his strong holds to ruin. \n [bbe] All his walls are broken down; you have given his strong towers to destruction. \n 89:41 [hgb] 凡 过 路 的 人 ， 都 抢 夺 他 。 他 成 为 邻 邦 的 羞 辱 。 \n [kjv] All that pass by the way spoil him: he is a reproach to his neighbours. \n [bbe] All those who come by take away his goods; he is laughed at by his neighbours. \n 89:42 [hgb] 你 高 举 了 他 敌 人 的 右 手 。 你 叫 他 一 切 的 仇 敌 欢 喜 。 \n [kjv] Thou hast set up the right hand of his adversaries; thou hast made all his enemies to rejoice. \n [bbe] You have given power to the right hand of his haters; you have made glad all those who are against him. \n 89:43 [hgb] 你 叫 他 的 刀 剑 卷 刃 ， 叫 他 在 争 战 之 中 站 立 不 住 。 \n [kjv] Thou hast also turned the edge of his sword, and hast not made him to stand in the battle. \n [bbe] His sword is turned back; you have not been his support in the fight. \n 89:44 [hgb] 你 使 他 的 光 辉 止 息 ， 将 他 的 宝 座 推 倒 于 地 。 \n [kjv] Thou hast made his glory to cease, and cast his throne down to the ground. \n [bbe] You have put an end to his glory: the seat of his kingdom has been levelled to the earth. \n 89:45 [hgb] 你 减 少 他 青 年 的 日 子 。 又 使 他 蒙 羞 。 （ 细 拉 ） \n [kjv] The days of his youth hast thou shortened: thou hast covered him with shame. Selah. \n [bbe] You have made him old before his time; he is covered with shame. (Selah.) \n 89:46 [hgb] 耶 和 华 阿 ， 这 要 到 几 时 呢 ？ 你 要 将 自 己 隐 藏 到 永 远 吗 ？ 你 的 忿 怒 如 火 焚 烧 ， 要 到 几 时 呢 ？ \n [kjv] How long, LORD? wilt thou hide thyself for ever? shall thy wrath burn like fire? \n [bbe] How long, O Lord, will you Keep yourself for ever from our eyes? how long will your wrath be burning like fire? \n 89:47 [hgb] 求 你 想 念 我 的 时 候 是 何 等 的 短 少 。 你 创 造 世 人 ， 要 使 他 们 归 何 等 的 虚 空 呢 ？ （ 细 拉 ） \n [kjv] Remember how short my time is: wherefore hast thou made all men in vain? \n [bbe] See how short my time is; why have you made all men for no purpose? \n 89:48 [hgb] 谁 能 常 活 免 死 ， 救 他 的 灵 魂 脱 离 阴 间 的 权 柄 呢 ？ （ 细 拉 ） \n [kjv] What man is he that liveth, and shall not see death? shall he deliver his soul from the hand of the grave? Selah. \n [bbe] What man now living will not see death? will he be able to keep back his soul from the underworld? (Selah.) \n 89:49 [hgb] 主 阿 ， 你 从 前 凭 你 的 信 实 向 大 卫 立 誓 ， 要 施 行 的 慈 爱 在 哪 里 呢 ？ \n [kjv] Lord, where are thy former lovingkindnesses, which thou swarest unto David in thy truth? \n [bbe] Lord, where are your earlier mercies? where is the oath which you made to David in unchanging faith? \n 89:50 [hgb] 主 阿 ， 求 你 记 念 仆 人 们 所 受 的 羞 辱 ， 记 念 我 怎 样 将 一 切 强 盛 民 的 羞 辱 存 在 我 怀 里 。 \n [kjv] Remember, Lord, the reproach of thy servants; how I do bear in my bosom the reproach of all the mighty people; \n [bbe] Keep in mind, O Lord, the shame of your servants, and how the bitter words of all the people have come into my heart; \n 89:51 [hgb] 耶 和 华 阿 ， 你 的 仇 敌 ， 用 这 羞 辱 ， 羞 辱 了 你 的 仆 人 ， 羞 辱 了 你 受 膏 者 的 脚 踪 。 \n [kjv] Wherewith thine enemies have reproached, O LORD; wherewith they have reproached the footsteps of thine anointed. \n [bbe] The bitter words of your haters, O Lord, shaming the footsteps of your king. \n 89:52 [hgb] 耶 和 华 是 应 当 称 颂 的 ， 直 到 永 远 。 阿 们 ， 阿 们 。 \n [kjv] Blessed be the LORD for evermore. Amen, and Amen. \n [bbe] Let the Lord be praised for ever. So be it, So be it. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/116/1733.html","bookId":182,"book":{"id":182,"title":"诗篇 Psalms","description":"简介： 1:1 [hgb] 不 从 恶 人 的 计 谋 ， 不 站 罪 人 的 道 路 ， 不 坐 亵 慢 人 的 座 位 。 [kjv] Blessed is the man that walketh not in the counsel of the ungodly, nor standeth in the way of sinners, nor sitteth in ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/116","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:44 AM"}}
