{"id":105303,"no":14,"title":"Page 14","content":"He poured another vodka while I gave him the briefest possible explanation of my trip to Latvia. Tadeusz, as it happened, was just the right sort of person for this story. It made perfect sense to him that someone would go to all this trouble just to reunite two lovers. Politics was politics, and a good cigar was a smoke, but love, after all, made the world go round. His words, not mine.\\n\\n He drank his vodka down, lit a fresh cigarette from the butt of the old, flipped the old into the fireplace, poured himself more vodka, and sighed the languid sigh of the tubercular pianist he wasn’t.\\n\\n “I understand and sympathize,” he assured me. “But.”\\n\\n “But what?”\\n\\n “But it would suit my avowedly selfish purposes more if you were going directly to the West.”\\n\\n “It is difficult to enter Lithuania?”\\n\\n “No, that I can readily arrange. And in return, if you please, you will do me a favor. A great favor.”\\n\\n “What?”\\n\\n He dug his hands into his jacket pockets. He drew them out again, and in each hand he held a flat black cylinder about half an inch thick and three inches in diameter.\\n\\n “Two of them,” he said. “One for New York, one for Chicago. Microfilm. Vital that it gets there. You know the people and you know how to get around. I’ll get you to Lithuania, you’ll get this crud back to the States. Fair enough?”\\n\\n At which point Milan emerged from the bathroom, nattily dressed, neatly shaved, with his wig on backward.\\n\\n I sat down and started to cry.\\n\\n Chapter 11\\n\\n “If nothing else,” Tadeusz had said, “this government of ours makes the trains run on time.” The same left-handed compliment had been paid to Mussolini’s regime in Italy, where it may or may not have been true. It was indisputably true in Poland. After a little more than twenty-four hours in Krakow, during which time we toured Wawel Castle, walked the banks of the Vistula, and roamed extensively through the old quarter, during which time Milan caught up on his sleep and I sidestepped Tadeusz’s constant offers of feminine companionship, and during which time identity cards were carefully prepared for us and routes arranged – after this fruitful and pleasant twenty-four hours of rest and relaxation we boarded a night train for Warsaw. The conductor looked in on us, examined our tickets, mutilated them professionally with a ticket-punch, examined our identity cards, returned them unmutilated, and then left us happily alone in our compartment. Milan went immediately to sleep. I had acquired a handful of paperbound books from Tadeusz, all of them safely apolitical, and I settled myself in my seat and set about reading them.\\n\\n My name, according to the folding leatherette-bound card I carried, was Casimir Miodowa. Milan had been rechristened Jozef Slowacki. The cards would pass all but the most rigorous sort of inspection and, Tadeusz assured me, ought to get us over the border into the Lithuanian S.S.R. with no difficulty whatsoever.\\n\\n We looked less like peasants now and more like minor business or government functionaries of one sort or another. We wore suits, crudely tailored but new and clean, with neatly knotted neckties. We carried small suitcases containing only clothing and personal articles, suitcases that could be opened for inspection without the slightest risk of their disclosing anything compromising, suitcases that I intended to discard forever once we were across the frontier. In the meantime they helped establish our role as middle-class members of the Polish classless society.\\n\\n I read, Milan slept. Our train reached Warsaw on schedule. I roused Milan, and we changed for another train to Bialystok in the northeast. There we changed trains a second time, cutting north and west to Gizycko near the border. It was morning when we left the train, and Gizycko, at the edge of the Masurian lake district, was glorious in the sunshine. Sailboats swept gracefully across Lake Mamry. The water was startlingly blue, the dense woods surrounding the lake a deep and abiding green. We boarded a bus for the frontier. There armed Border Guards had us dismount from the bus, pawed through our luggage, examined our identity cards, noted our names and other particulars, asked us where we were going, how long we would be staying, the nature of our business – in short, made perfect nuisances of themselves by doing their jobs quite properly. I supplied all the appropriate answers, Milan pointed to his mouth and conveyed to them the notion that he was a mute, and we, like all the other Lithuania-bound passengers, were permitted to return to the bus and cross into Lithuania.\\n\\n I had thus brilliantly smuggled into the Soviet Union a subversive manuscript, its subversive Yugoslav author, an array of undecipherable Chinese documents, and two spools of microfilm containing plans and information for Polish exile groups in the United States. The microfilm currently reposed in two hollowed-out heels that a friend of Tadeusz’s had fastened onto my shoes. Tadeusz had been very enthusiastic about this maneuver, as though he were the first person ever to hit upon the notion of smuggling contraband in a bootheel. I couldn’t share his delight; from what I knew of smuggling and customs searches, the bootheel is one of the first places checked.\\n\\n But it didn’t matter. Once they picked me up, the game was over. There was no part of me they could search without finding something incriminating. And here I was, with all of this extremely dangerous contraband, not sneaking out of Russia, which would have made a certain amount of sense, but smuggling everything in.\\n\\n It wasn’t quite like carrying coals to Newcastle. More, I thought, like leading Christians carefully through the catacombs and emerging on center stage at the Coliseum, just in time for the lion number.\\n\\n The bus went to Vilna, capital city of the Lithuanian Soviet Socialist Republic. Milan and I went, in another bus, to Kaunas, the old capital city of independent Lithuania from 1919 to 1938, during which time Vilna was a part of Poland. Borders and boundaries change and shift even more rapidly than nations form new teams for new wars. As far as I was concerned, Kaunas, with a population of a quarter of a million, was still the true capital of Lithuania. And the people I knew in Lithuania were the sort who felt the same, and who lived there.\\n\\n I would have wanted to stop in Kaunas anyway, if only to meet in person some comrades from the Crusade for a Free Lithuania. But there were practical reasons as well. Within a day or so someone processing border records would discover that Casimir Miodowa and Jozef Slowacki did not in fact exist, and at that point it would not be wise for us to be a pair of petit bourgeois Poles. We would need another change of clothing, a transformation from Polish to Soviet citizenship.\\n\\n Kaunas was mostly postwar construction, a great deal of concrete block houses and shops and factories. All three of the Baltic States had been devastated in World War I, built themselves up slowly but surely in the period between the wars, then served once again as a Russo-German battleground during the second war. Kaunas had been pretty thoroughly demolished in the course of all this warfare. It had been built up again, larger than ever, but there wasn’t much of the old city left underneath it all.\\n\\n I blundered around, asking directions in rusty Lithuanian until we found our way to the right house. I had only one real contact in Lithuania, an old woman named Hescha Uldansa. I had no contacts at all inside Latvia. The Baltic exile groups are forced to operate almost entirely in exile, as the Russian government has an unhappy habit of resettling native sympathizers in Azerbaijan and Kazakhstan, where they aren’t likely to function effectively as activists.\\n\\n So we called on Hescha, a gnarled woman with wens under her eyes and liver spots on her hands and a cracked voice that sounded as though someone had poured a tablespoon of Drano down her larynx.\\n\\n “So good to see you,” she said. “Come in, come in. Tanir, eh? Come inside, shut the door. When we are free again, then we will not have this cold Russian weather, eh?”\\n\\n We chatted amiably about mutual friends in New York. While she went off to make tea Milan asked in an undertone if we could really understand one another. “Is it really a language? It doesn’t sound like anything.”\\n\\n “It sounds a good deal like Lettish.”\\n\\n “Then Lettish doesn’t sound like anything, either.”\\n\\n “They both sound quite a bit like Sanskrit.”\\n\\n “Oh, please!”\\n\\n “It’s true,” I told him. “They’re probably the two oldest Indo-European languages. Don’t even try to follow conversations. They’ll only give you a headache.”\\n\\n “They already have.”\\n\\n Hescha returned with glasses of tea and little cakes frosted with orange icing. The tea was very good, the cakes were not.\\n\\n “You speak well,” she told me. “But if you will excuse me, I must say that you have lost some of your Lithuanian way of speaking in America.” She evidently assumed I had been born in Lithuania, and there was no point in reorienting her. “You speak,” she said, “with a distinct Lettish accent.”\\n\\n “I do?”\\n\\n “It is noticeable, yes.”\\n\\n “I have been associating with Letts in America.”\\n\\n “Well, they are good people, of course. It is unfortunate, though, that their language is a corruption of the pure Lithuanian.”\\n\\n The Letts feel that Lithuanian is a corruption of the pure Lettish. We talked some more, and I told her we would require a change of clothing. I didn’t bother saying anything about identity cards. Hescha was a sympathizer, not a conspirator, and a bit senile in the bargain. The less she knew about our destination, the better off we were. And it was highly unlikely she would have the sort of connections able to provide false papers or passports.\\n\\n She brought us clothing, good farmers’ clothing, including a fine pair of boots for me that I couldn’t possibly wear. They matched the rest of my clothes far better than the Polish business shoes, but to give up my Polish shoes would be to abandon the damned spools of microfilm in the heels. I scuffed up the shoes so that they didn’t jar too obviously with the rest of my costume. They would have to do.\\n\\n “Tanir,” she said. “I have a thing to show you, you will be most excited. No one in America knows, I have told no one. Your friend, he is not Lithuanian, no?”\\n\\n I agreed that Milan was not Lithuanian.\\n\\n “Then, he can wait here. We will not be long, he would not be interested. But you I show. It is all right?”\\n\\n I translated the gist of this for Milan. He did not at all mind the thought of being abandoned to silence for a time. The unfamiliar Lithuanian was ringing in his ears.\\n\\n We walked several blocks. Hescha’s carefree manner changed markedly on the way; the little old woman, her shawl pulled tightly around her, looked over her shoulder and peered around corners so busily that I was afraid her excess of precautions would inevitably draw attention to us. Fortunately we reached our destination before this happened. She led me into a doorway, then down a long flight of unlit stairs, then pushed a metal barrel aside to reveal a hidden door. She opened the door with a small key, stepped quickly through, and drew me in behind her. Then, swiftly, she closed and bolted the door.\\n\\n Inside the windowless room, illuminated by a solitary kerosene lantern, sitting up straight in a tiny narrow bed, was as beautiful a child as I had ever seen in my life.\\n\\n The little girl regarded us solemnly. Hescha said, “Minna, this is Mr. Evanis Tanir from America. Tanir, this is Minna.” \\n\\n","sourceLink":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3/page-14.html","bookId":1532,"book":{"id":1532,"title":"Tanner\u0027s Twelve Swingers (Evan Tanner #3)","description":"Storyline: Tanner\u0027s Twelve Swingers (Evan Tanner #3) \\n Out of print for fifteen years, Lawrence Block\u0027s third book in his hilarious Tanner series is back...And this time the intrepid spy is up to his neck in a dozen leggy beauties and a life-and-death smuggling assignment out of the cold corners of Russia.\\n","cover":"https://allnovel.net/images/tanner-s-twelve-swingers-evan-tanner-3.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:44:29 PM"}}
