{"id":105305,"no":16,"title":"Page 16","content":"A directory inside the door of her building informed me that Lazdinja was apartment 4. I climbed a flight of stairs and found a door with a 4 on it at the end of the corridor. I knocked, and the door opened, and I looked at a face I had heretofore seen only in photographs, and I realized instantly why Karlis had fallen so irretrievably in love with her. The form of a goddess, the face of an angel, sparkling eyes, flashing teeth, red lips… I said, “You are Sofija Lazdinja?” She said, “No.” I don’t think I said anything; if I did, I’m sure it didn’t make any sense. I was too busy being astonished. But what she said next was, “I am Zenta Lazdinja. Sofija is my sister. My older sister.” “One year older!” This from a voice from within. “That is quite true,” Zenta said mischievously. “Sofija is only a year older than I. You will find this hard to believe when you see her, but it is true. Only a single year older.” Karlis had not said that there were two of them. Perhaps he had not known. It was almost impossible to believe in the existence of one of them, let alone a matched pair. “But you have the advantage of us,” said Zenta. “You know that I am Zenta and that my older sister Sofija is within, but we do not know your name or who you are.” “My name is Evan Tanner. I have come at the request of a good friend of your sister.” “His name?” “Karlis Mielovicius.” A shriek from within. “Karlis!” Another goddess rushed into view, pushed Zenta aside, gripped me furiously by the arms. She was an inch or so taller, a shade more voluptuous in physique, and, as I had been repeatedly advised, one year older. “Karlis!” she cried again. “You come from Karlis?” “Yes.” “He is well?” “Yes.” “He still loves me?” “More than ever.” “But he has found another?” “No.” The pressure increased on my arms. “You are very certain of this?” “Yes.” “Ahhh!” She released my arms, enveloped me in her own, hugged me to her extraordinary bosom, and very nearly crushed the life out of me. I considered reminding her that I was not Karlis myself, that I was merely his emissary, but for the moment I was unable to say anything at all. She released me eventually and led me inside. We sat down on a long, low couch, with me in the middle and Sofija and Zenta on either side. And I explained, in a great flow of words, that Karlis wanted her to come to America to be his bride, and that, if this was also her wish, I would do whatever was in my power to take her there. Evidently it was not something she had to think about for any great length of time. She didn’t exactly say that she would like to come. What she said was, “How soon can we leave?” And Zenta said, “I am coming with you, of course.” “It will be some days before we can leave. Perhaps a week, perhaps longer.” “We can wait. And you may stay here with us, it is safe here.” “There are others with me. An old man and a young girl.” “They will stay with us also.” “And you must not speak a word of this to anyone. It is very dangerous.” “I understand.” “And I too.” “Not a word.” “No. The old man and the girl, where are they?” “A few doors away,” I said. “I will fetch them now.” I hurried back to the cafe. Minna and Milan were at a table where I had left them. The soup bowls were gone – they had shared mine between them, Minna told me – and she was finishing a meal of roast pork while Milan dealt with a meat pie. I had just enough rubles to cover the check. “We can go now,” I told Minna in Lettish. “We can go now,” I told Milan in Serbo-Croat. And that, I thought, was going to be a nuisance. Giving everyone directions in a different language and having persons in the party who were unable to communicate with one another could only prove to be a mammoth headache. I’ve always disliked the notion of Esperanto, feeling that a variety of languages makes the world infinitely more interesting, and to me the myth of the Tower of Babel has always had a happy ending. But now I could somewhat appreciate the desirability of a universal language, if only to be dragged out on special occasions. This, certainly, was one such occasion. But as we left the cafe and proceeded to Sofija’s apartment house Milan said that the food tasted good to him. I nodded. And then did a monumental double-take because what he had said, word for word, was “Man garsho bariba.” I looked at Milan, who was smiling shyly, and at Minna, who was simply beaming. Esperanto would be unnecessary from now on, as would Serbo-Croat. In a few days the little minx would have him speaking Lettish. Chapter 13 We were about as cozy as a group of five can reasonably expect to be in an apartment designed to accommodate two. I explained that I had no need of a bed, that I could more easily sleep during the day, when the others were up and about, and that most of my planning for the exodus would have to be done at night anyway. Sofija and Zenta, who shared a large bed in the one small bedroom, decided that there was certainly room in that big bed for Minna as well. Milan declared that he would sleep most comfortably on the couch. So the sleeping arrangements were not particularly inconvenient. It was when we were all present and all awake that the apartment was overly crowded. We would sit balancing plates of food on our laps, or stumble about bumping into one another, or merely demonstrate through general discomfort and malaise that the apartment did not fulfill our territorial imperative. I coped with this situation by carefully being absent at times when everyone else was present. The girls were away most of the day, and it was easy enough for me to invent mysterious missions that would take me out of the apartment during the evenings. It was easy, in fact, to invent almost anything but an escape route out of Latvia. There were too many of us, and we were too heavily loaded down for us to get out as easily as Milan and I had gotten in. If I had come alone, and if Sofija herself had been alone, a routine of border-hopping and disguises might have worked. Now, with our party of two transformed into a party of five, that was out of the question. And Minna, delight though she was, constituted another problem. She couldn’t be expected to walk long distances or endure much in the way of hardship. She was only six years old. All of which meant that our departure would have to be swift, bold, abrupt. And therefore dangerous. We would need a car for a start. That wouldn’t be too difficult, I decided; one of the girls could simply borrow one from a friend (girls who look like that invariably have friends who are anxious to lend them cars), and we could abandon the car when the time came. That, after all, is what friends are for. With a halfway decent car we could drive from Riga to Tallinn in four hours at the outside. The Estonian capital is on the Gulf of Finland just fifty miles south of Helsinki. The Russians patrol those waters carefully, but no marine patrol can be that perfect, and it seemed reasonable to assume that a fast ship in the hands of an alert and cooperative (and greedy) boatman could get us through. I was unsure how wide-armed a reception we could expect in Helsinki. The Finns have the good sense to remain on good terms with the Russians. Still, a plea for political asylum had to carry some weight. Of course a plea for political asylum generally entails publicity, and Finland is honeycombed with Russian operatives, so Finland might not be the safest place on earth. But if we could reach an American embassy in Finland, then perhaps… I spent four fairly rotten days and nights playing with this dilemma. I don’t think I would have gotten much sleep during those days even if I had been capable of it. What it came down to, finally, was that Finland was better than any other possibility, but that any serious thought about what to do in Finland had to wait until it was established whether or not we could expect to get there. None of which could be properly assessed in Riga. So one night, after dinner, I shook hands with Milan, embraced the Lazdinja sisters warmly, kissed Minna, and went to Tallinn. The waterfront bars in Tallinn are much like waterfront bars at any seaport. Talk of women and ships, heavy drinking, conversations in a dozen languages at once, and underneath it all a healthy disrespect for law and order. Every seaman is, at heart, a smuggler and an anarchist. When a man spends so much of his time sailing on open waters with sailors from all over the world, he learns not to care much about the prevailing governments on that one-fourth of the globe that God, for some mysterious reason, saw fit to spoil by covering it with land. Waterfront bars are good places. Men drink, men get drunk, men fight, men occasionally kill one another, but a waterfront bar remains a generally good place to be. I was in just about every damned one in Tallinn. I lived in them until I found my man, and then I spent a long time scouting him and another long time conversing with him. It took a couple of days and nights until I was virtually certain he was right. He had a fast ship, he had no love for any government and liked the Soviet government least of all, and, most important of all, he hungered for money. I had $1,000 U.S. in a money belt around my waist. The farther one gets from America, the more desirable the U.S. dollar becomes. I felt it ought to be enough to carry the deal. A man with a fast ship of his own in a port like Tallinn is almost certain to be a full-time smuggler, working contraband back and forth between Helsinki and Tallinn. A smuggler is accustomed to heavy profits, but a thousand U.S. dollars for one night’s work still added up to a substantial sum. So I waited until we were alone in the night, halfway between one saloon and the next on down the line, and then I made my pitch. “Ander,” I said, “you are an intelligent man. You know this port and these waters. I have a question for you.” He waited. “Let us suppose, Ander, that there was a family of five, a man and two women and a child and a grandfather, and all of them without papers. Let us suppose that they wanted to go from Estonia to Finland, and to leave Estonia without anyone knowing of it, and then to enter Finland without anyone knowing it. Let us suppose-” “They would have to go by boat,” he said. “That would no doubt be the best way.” “It would be dangerous. Very few men would have the courage to transport them. And very few families would have the resources to afford such a trip.” Ah, good. We were getting closer to brass tacks. “Do you think a man with the necessary amount of courage could be found? And with the skill and daring to make the trip in safety?” “It is possible.” “And what resources would the family require?” “A great deal.” He was a Dutchman or a Lascar or a German or a Spaniard, depending upon his audience and his mood. He was somewhere between thirty and fifty. He was not going to name a price, nor was he going to settle for a sum until he knew it was as much as he could possibly get. So I said, “Ander, this family would give its entire resources. Everything. Its entire resources amount to exactly one thousand dollars, American. In American bills. Twenty fifty-dollar bills.”","sourceLink":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3/page-16.html","bookId":1532,"book":{"id":1532,"title":"Tanner\u0027s Twelve Swingers (Evan Tanner #3)","description":"Storyline: Tanner\u0027s Twelve Swingers (Evan Tanner #3) Out of print for fifteen years, Lawrence Block\u0027s third book in his hilarious Tanner series is back...And this time the intrepid spy is up to his neck in a dozen leggy beauties and a life-and-death smuggling assignment out of the cold corners of Russia.","cover":"https://allnovel.net/images/tanner-s-twelve-swingers-evan-tanner-3.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:44:29 PM"}}
