{"id":105296,"no":7,"title":"Page 7","content":"“A book?”\\n\\n “A manuscript for a book.”\\n\\n “Yours?”\\n\\n “No.” He smiled briefly. “I have a book coming out soon on the dialects of the Ukraine, but I would not press such a weighty tome upon you.”\\n\\n “I’d be most interested-”\\n\\n “You are kind to say so, and rest assured that I will send you a copy upon publication. But the manuscript I have for you is most important, believe me. Are you too tired to read it now?”\\n\\n “Not at all.”\\n\\n He opened the desk’s center drawer and drew out a large manila envelope. From the envelope he brought forth a sheaf of typescript. “The text is in Serbo-Croat,” he said. “But if you read as fluently as you speak, that should present no problem.”\\n\\n “I read Serbo-Croat.”\\n\\n “Then you’ll finish this in an hour or so if you’re a fast reader. Don’t read for detail. Merely read carefully enough to form an opinion of the merit of the work.”\\n\\n I took the manuscript from him. There was no title page. I asked the author’s name.\\n\\n “I will tell you when you finish.”\\n\\n “And the title?”\\n\\n “The work is yet untitled. Perhaps you will be more comfortable at my desk. Please sit here, I’ll leave you alone while you read. And would you care for a cup of coffee?”\\n\\n “Fine.”\\n\\n I sat down expecting the usual sort of Serb propaganda, perhaps a bit better than the general run if Janos was so impressed. But within the first few pages I saw that the book was a far cry from the normal class of partisan literature. It was, in fact, an astonishing document. With an impartial viewpoint almost without precedent in Balkan political literature, the author made a rational yet impassioned plea for the dissolution of the state of Yugoslavia and the establishment of wholly independent republics of Croatia, Slovenia, Serbia, Macedonia, and Montenegro.\\n\\n It could have been mere polemic, but the man who wrote it had avoided this pitfall. Every charge leveled at the People’s Republic of Yugoslavia was carefully thought out and as carefully documented. Every argument for the Yugoslav federation was meticulously examined and meticulously demolished. The successes of Tito’s revisionist policies paled to the point of insignificance under the weight of the author’s charges.\\n\\n And all of this was done, not from the point of view of a diehard Croat or Serb or Slovene, but with genuine scholarly detachment.\\n\\n I found Janos working chess puzzles in the living room. “The book is a masterpiece,” I told him.\\n\\n “I thought you would be impressed. You feel it deserves publication?”\\n\\n “Of course.”\\n\\n “But,” he said, “I find it unlikely that it would be published in Yugoslavia. If Djilas can earn imprisonment for his writings-”\\n\\n “This author would hang.”\\n\\n “Precisely.”\\n\\n “The book could be published in America.”\\n\\n “Ah. And then what would happen to its author?”\\n\\n “The book could be published anonymously. Or under some convenient pen name.”\\n\\n “Perhaps. But I have a feeling that this author’s name might carry weight.”\\n\\n “Who is he?”\\n\\n “You approve wholeheartedly of the book? Of its style? Of its message?”\\n\\n “Yes. Without reservation.”\\n\\n “You would even, perhaps, be willing to translate it into English?”\\n\\n “I would be honored.”\\n\\n “Ah. The author, as it happens, is a gentleman by the name of Milan Butec.”\\n\\n “You don’t mean-”\\n\\n “Deputy Minister of Internal Affairs of the People’s Republic of Yugoslavia. Precisely. A resistance leader during the war. An important organizer of Tito’s government after the war. A respected man, a leader, a scholar, a thinker-”\\n\\n “The book must be published,” I said. “And of course you are right, it ought to be issued under Butec’s name. Someone must find a way to get the man out of Yugoslavia to safety in the West. This is imperative.”\\n\\n “I agree.”\\n\\n “And if this is done, I would be honored to translate the work.”\\n\\n Janos Papilov sighed. “You will do more than that, Evan,” he said. “Do you not recall that I said your visit was providentially timed? Early today I received word that you were en route to Belgrade. Perhaps it is presumptuous of me, but I took it for granted that you would visit me upon your arrival. And so I immediately got word to Mr. Butec, whose manuscript has been in that drawer of my desk for over a month. He came to my house this afternoon; he has been waiting in an upstairs room since your arrival.”\\n\\n “May I meet him?”\\n\\n Another sigh. “You may do much more than meet him, Evan. It will be your task to take Mr. Butec and his most valuable manuscript to America.”\\n\\n For a few moments I said nothing. Extreme shock often has that effect upon me. Then I said, “Janos, you honor me. But what you ask is impossible. I’m not on my way home now. I have to go north, I have to travel through Hungary and Czechoslovakia and Poland -”\\n\\n “Mr. Butec will travel with you.”\\n\\n “Janos, I have to enter Russia!”\\n\\n “That is very dangerous. But it would be still more dangerous for Mr. Butec to remain in this country. He has been cautious not to make his view publicly known. He has been most discreet. Still, word of his writings has somehow leaked to the government. Three days ago he was placed under unofficial house arrest. This afternoon he left his house by climbing down the drainpipe and running through backyards like a petty burglar. He must leave Yugoslavia at once.”\\n\\n “Then let him leave by himself. Or let someone else take him.”\\n\\n “It is impossible, Evan.”\\n\\n “But-”\\n\\n “Milan Butec has no experience in these matters. He could not go alone. Nor is there anyone whom we trust, anyone with the ability to escort Mr. Butec. But you, Evan, you slip in and out of countries with ease. Are you permitted in Yugoslavia? You are not. Yet how often have you come in and out of this country illegally?”\\n\\n “But I travel light,” I protested. “I didn’t even bring a suitcase this time, just a flat portfolio that I can slip inside my jacket. I’d be hampered if I had to take the manuscript with me, let alone its author. And I’m not going west, Janos. I’m going north and east.”\\n\\n “They will not expect that,” he said, undaunted.\\n\\n “Of course they won’t. They’ll expect him to do the sensible thing and sneak out through Austria or Greece.”\\n\\n “Exactly. And those are the frontiers they will guard, while you-”\\n\\n “I can’t do it, Janos.”\\n\\n “You must. Would you want this book suppressed? Would you want the author hanged?”\\n\\n “Janos…”\\n\\n We went around and around, Janos and I. I thought of countless alternatives and he explained at length why each one was unthinkable, why no one else could possibly take Butec to freedom, why Butec could not possibly go himself. We went around and around, and so did my head. The whole mission to rescue Sofija for Karlis had been impossible to begin with, but if I traveled light, I had the chance, say, of a snowball in hell. With Butec and his book in tow, even that much chance was denied me. He would be wanting to sleep all the time. He wouldn’t know the languages. He would get in the way, he would do something wrong.\\n\\n Damn…\\n\\n “You will come with me, Evan,” Janos said at last. “We will meet Mr. Butec.”\\n\\n “Janos-”\\n\\n “Come!”\\n\\n Mr. Butec, Mr. Milan Butec, Deputy Minister of Internal Affairs for the People’s Republic of Yugoslavia, was a short and stout man with a neatly trimmed goatee, huge bushy eyebrows, and a hairless head. My heart sank when I saw him; he would be about as inconspicuous as a Negro in the D.A.R.\\n\\n “This is Evan Michael Tanner,” Janos said. “This is the young man, Milan, who has agreed to lead you to freedom and to give the world the gift of your most precious book.”\\n\\n This was a lie; I had agreed to nothing. But Butec – and what a fine book he had written, what a masterful book – scurried over to pump my hand. He tried to express his gratitude in English. His accent was thicker than Macedonian bean soup.\\n\\n “It will be difficult,” I heard myself say.\\n\\n “I am prepared for difficulty.”\\n\\n “And dangerous.”\\n\\n “I am prepared for dangerous.”\\n\\n Prepared for dangerous? I swung us back to Serbo-Croat. “And you would have to disguise yourself, Mr. Butec.” I studied him, trying to think of a way to make him look a little less obviously himself. “A wig of some sort, I should think. And you would have to shave your beard. Perhaps the eyebrows as well, and then we would paint in less obtrusive eyebrows.”\\n\\n “This shall be done as you say.”\\n\\n He stroked his beard as he said this, and I knew he was vain about it. I only wished he was vain enough to offer an objection and leave me with a way out, but evidently his vanity placed second to his desire to see the last of Yugoslavia.\\n\\n I said, with the heavy heart of one who goes on playing even after he knows he has lost, “It will be a hard trip, Mr. Butec. We will have to be on the move constantly. There won’t be much time for sleep and-”\\n\\n Butec managed a smile. “Do not worry,” he said. And, drawing himself up to what there was of his full height: “Put your mind at ease in that department, Mr. Tanner. I can put up with such hardship. I have trained myself to make do with almost no sleep at all.”\\n\\n Well, I thought, that was a help.\\n\\n “There are times,” he added, “when I get by with as little as six hours sleep a night.”\\n\\n “That’s marvelous,” I said.\\n\\n Chapter 6\\n\\n When Milan Butec emerged from the lavatory, a straight razor clasped defensively in one hand and a valiant smile on his round white face, he had been all too literally shorn of the last vestiges of human dignity. The bald head gleamed as before, but now the beard was gone as well, revealing a weak chin. The missing eyebrows gave the whole head the uncanny appearance of a round ball of soft white cheese, indented here and there for eyes and a mouth, protruding a bit for a nose, but otherwise scarcely identifiable as a human head at all. The poor man evidently had a mad passion for escape; only that or abject masochism would permit a man to make such a profound mess of himself.\\n\\n “I am not looking myself,” he said.\\n\\n Janos maintained a tactful silence. His wife said something about coffee and retreated to the kitchen. Milan Butec and I regarded each other thoughtfully. With some sort of wig, I thought, and with rudimentary eyebrows drawn in to interrupt some of the awesome expanse of white skin, he would still look rather absurd. But he would look not at all like Milan Butec.\\n\\n “We will need a wig,” I told Janos.\\n\\n “This can be arranged. Black, do you think?”\\n\\n “Perhaps a dark brown.”\\n\\n “I shall see to it. What else?”\\n\\n “An eyebrow pencil. If there’s nothing of the sort available, perhaps some charcoal or a burnt match-”\\n\\n “Cosmetics are a petit bourgeois artifice not in keeping with the goals and ideals of a socialist nation,” Janos said solemnly. “My wife has several eyebrow pencils. You will want to take one with you, of course. It shall be provided.” \\n\\n","sourceLink":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3/page-7.html","bookId":1532,"book":{"id":1532,"title":"Tanner\u0027s Twelve Swingers (Evan Tanner #3)","description":"Storyline: Tanner\u0027s Twelve Swingers (Evan Tanner #3) \\n Out of print for fifteen years, Lawrence Block\u0027s third book in his hilarious Tanner series is back...And this time the intrepid spy is up to his neck in a dozen leggy beauties and a life-and-death smuggling assignment out of the cold corners of Russia.\\n","cover":"https://allnovel.net/images/tanner-s-twelve-swingers-evan-tanner-3.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/tanner-s-twelve-swingers-evan-tanner-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:44:29 PM"}}
