{"id":73701,"no":36,"title":"Page 36","content":"\n “Move on me.”\n She flattened her palms on his chest, felt the erratic pound of his heartbeat. A mimic of hers. Again using her knees as leverage, she rose all the way to the tip, then slid back down.\n Another round of curses from him. “I want your fingers in my mouth.”\n “Yes.” Except when she reached up to obey, he shook his head violently.\n “Not those. The ones you had inside you.”\n Oh. He wanted her taste in his mouth. God, that aroused her to the point of pleasure/pain. He licked and sucked her wetness from each, moaning and groaning. And all the while, she rode him, slow, so slowly.\n When there was nothing left on her hand, he popped the fingers out. “Faster,” he snarled. “Harder.”\n Not yet, darling. Still moving with tortuous slowness, she worked him. Until he was babbling incoherently. Until he was grinding his hips against her, trying to force her into a swifter rhythm. Until she was practically sobbing from desperation.\n He’d wanted her enough to push past his fears. He’d waited so long for this moment. She planned to make him come so hard he’d never regret what they’d done—whatever happened afterward.\n “You feel so good. I’m so close. Can’t wait to feel you come inside me. Never had that. Want that. Need that. Need you. Only you. You’re so—”\n A roar of satisfaction parted his lips, and he slapped his hands against the tiled walls at his sides, arching his hips so high he completely cleared the bench. Her, too. Her knees lost their anchor, and she balanced only on Hector, his cock so deep inside her she’d feel him for weeks.\n As he jetted, a hot stream she could actually feel, she propelled over the edge of satisfaction herself. “Hector!” Her nails sank past skin and into muscle, beads of blood trickling down his chest.\n White lights sparked behind her eyelids, and she nearly collapsed against him. Even in the furious haze of a pleasure so intense she’d never known its like, she remembered. Dangerous. Have to be careful.\n Good thing, too, because as she floated down from the high, she smelled the smoke, and knew. He’d set her bathroom on fire.\n Thirty-two\n HECTOR SAT AT THE end of Noelle’s bed, a towel wrapped around his waist. She paced in front of him, but he couldn’t look at her. Not yet. He’d destroyed her bathroom. Would have burned her house down if the fire had started anywhere but the shower. A twist of the nozzle and they’d managed to douse the flames before they could spread.\n By then, the tiles were already charred and black. His first time was probably going to be his last time, he thought darkly. A fact that utterly slayed him.\n What Noelle had made him feel…\n His body had existed for her, and her alone. He’d become her slave—more so than any time before. Whatever she’d wanted, he would have given her. Anything to sink inside that warm, wet sheath. And when he had… god damn. He’d almost come that very second. It had taken every bit of his will power to hold back.\n He wanted that again. Every day, every night. Now he knew. There was nothing better than discovering your woman was drenched with arousal. Because of you. Feeling her pulse with satisfaction. Because of you. Hearing her cry your name. Knowing she was as swept up by the moment as you were.\n How was he supposed to resist her now?\n And he had to resist her. Until he learned to control his ability, he couldn’t let anything like this happen again.\n You’re a goddamn broken record, you know that?\n Yes. Proof: Would she wait for him? he wondered.\n Hell, no, he decided a heartbeat later. She wouldn’t wait for him. One, he couldn’t give her a guarantee that he’d ever learn to control himself. Two, she was a beautiful woman with needs. Three, she did not handle any type of rejection well and she would consider his backtracking another rejection.\n Fucking hate myself.\n “You’re about to tell me we’re going back to being friends and partners and nothing more, aren’t you?” she demanded.\n His stomach churned with sickness. “Noelle—”\n “Don’t you Noelle me. Ten minutes ago I was baby.”\n And he would have chopped off his arms to be there again. “Your bathroom is toast. I could have hurt you irreparably.”\n “Argh! This shit again? Really? The bathroom’s no big deal. I can have another stall in place within the hour.”\n No big deal. Right. “That’s not the point, and you know it.” And he’d known better. Had known sex was too hazardous for him.\n Gotta stay strong this time. Can’t cave.\n “You said coming inside me might calm your arms down, and guess what? It did. You aren’t glowing, and you aren’t radiating any heat.”\n “Doesn’t mean the process won’t start over again if you touch me.” Or if I touch you. Just the thought had his cock twitching. Down boy.\n “So okay. Fine. What happens next?” She stopped in front of him, her hands on her hips. The scent of soap and orchids wafted from her. She, too, wore a towel. The fluffy material was anchored just above her breasts and fell to just below her ass.\n Gorgeous female. Even then, after the damage he’d caused, as tortured as he was, his body continued to respond to her, craving her. “What do you want to happen?” he asked, finally looking up and meeting her gaze.\n Noelle’s heart lurched in her chest. Hector’s expression was one of pain, regret, and soul-wrenching sorrow. Not about the sex. That, she knew he’d enjoyed. But about the danger he’d put her in.\n “I want you to follow me around like a puppy, doing everything I tell you to do,” she said.\n “What else?”\n Her lips pursed. “Tell me what you like about me.”\n He blinked, clearly surprised by the topic switch. “Everything.”\n There was so much conviction in his tone that he left no room for doubt. “Even if I told you that twice in my life I’ve hacked off Ava’s hair, just because I was mad at her?”\n His brow furrowed. “What does that have to do with anything?”\n “I’m confessing my sins so you can reevaluate what you like about me.”\n “I won’t ever—”\n “I’ve also done every drug out there except Onadyn,” she interjected. “And the only reason I’ve never done Onadyn is because it turns your skin blue for several hours, and blue isn’t my color. Also, I went through a pyre phase and torched a school, as well as my parents’ summer home. Oh, and I once stole a twenty from a homeless man. ’Course, he deserved it for kicking a robo-dog. Machines have feelings too, you know, but I still kept him from eating for God knows how many days.”\n Hector’s golden gaze no longer crackled with tension, had softened with wariness. “Interesting, but why do you think any of that would make me reevaluate what I like about you?”\n “It doesn’t?”\n “No.”\n Her heart fluttered, a thousand tiny butterfly wings in flight. “All right, then. What would you change about me?”\n Another round of confused blinking. “Not a damn thing.”\n More conviction. Much more. He meant that, liked her just the way she was. Wasn’t judging her. Further proof: he’d never tried to change her. He’d only ever tried to protect her.\n She would have him. Fight for him.\n In her mind, they’d just proven they could be together intimately successfully, but okay. He required more evidence. Problem was, he planned to push her away. Again. For her own good. Well, not this time.\n She would do the pushing. Not away from her, but toward a commitment. She would have him, and that was that.\n “Just so you know,” she said. “Nothing happened with Corban. I refused to let him inside my house, so he took me to a restaurant. We talked for an hour before I left his ass there. I went to my mother’s, went to a cocktail party with her, thought briefly about committing a murder/suicide, then stayed the night with her. The reason I was still in a dress was because I refuse to keep clothes at her house and had to buy something for the party. That was all I had to wear home.”\n He listened, his shoulders sagging with relief. “Thank you for telling me.”\n “That’s what people in a relationship do.” There. She’d said it, and he could deal.\n He flinched. “Well, now I have to tell you something.”\n Annnd, here it comes. The “it’s not you, it’s me” speech again.\n “You know one of the reasons I pushed you away before. My arms. Here’s another. Dallas had a vision of the two of us sleeping together, as well as a vision of the two of you sleeping together.”\n A searing flood of confusion. “A vision?”\n “Yeah. He’s psychic.”\n Psychic. “Okay.” Once she might have snorted at such a claim. Having worked with otherworlders, having dated one, and seeing their abilities firsthand, she’d pretty much believe anything. “I guess he got it right because I just slept with you.”\n Hector’s nostrils flared. A return of his arousal? “The problem is, Dallas will either be destroyed or saved.”\n “Destroyed or saved, because I slept with you?”\n “Yes.”\n “How will Dallas be destroyed? Or saved?” she added before he could correct her. Just like that, she understood why Dallas and Devyn, Dally’s best friend forever, had acted so strangely around her yesterday.\n A muscle ticked in Hector’s jaw. “We don’t know.” “You just know it’ll happen.”\n A stiff, grim nod.\n “Because I slept with you,” she reiterated. “Don’t worry. Dallas gave his permission for us to be together.”\n “Oh, well, if Dallas gave his permission, then by all means,” she said dryly. “Let’s get married and have a thousand babies.”\n His teeth flashed in a scowl. “Look, I just wanted you to know where my head was at.”\n So she’d back off and give him some space? Not gonna happen, darling. I’m coming at you guns blazing.\n On her nightstand, her phone beeped, signaling a text had just come in. “Get dressed, and we’ll head to work,” she said, walking over and palming the device.\n “We don’t have to decide anything about our definitely committed relationship right now.”\n “Noelle—”\n “Don’t even think about denying we are involved in a committed relationship, Hector. We are. Well, you are at least. I’m allowed to fool around with other people if I so choose.”\n Silence. Good. Maybe he’d learn he would live a much fuller, richer life if he just sucked it up and gave her what she wanted, when she wanted it.\n “You are not fooling around with anyone else,” he finally growled. “Not even Don Carlos.”\n “Fine. But it’s on you if he kills himself over the sorrow of losing me.”\n “Word on the street is, he’s already moved on and is dating someone else.”\n “He is not. He loves me!” When she reminded herself they were talking about her imaginary lover, she forced herself to utter a put-upon sigh. “Well, I hope you’re proud of yourself. You just got exactly what you wanted. You and I are only seeing each other.”\n As he strode into the bathroom, muttering under his breath about naughty girls who fought dirty, she read what Tits McGee had to say. Guess what? Fangs R in!\n Ava and McKell forever, she thought, a sudden pang in her chest. She replied: Told U! She was happy for the lovebirds, she really was. And she wouldn’t feel sorry for herself, that Hector was intent on resisting her. She was better than that. Sometimes.\n I bet U look hot! U doing well? she typed next.\n Do look hot, but tired w/ a raging thirst.\n Take it out on McKell.\n Already on it!\n Of course she was. Ava liked dishing revenge as much as Noelle did.\n Tits McGee: So… U think anymore bout turning?\n Took her a moment to decide on the proper response. Not yet, got case, miss you tho.\n Miss you 2. BTW, case would B solved already if I were there.\n Brat.\n Slacker.\n “Why are you grinning?” Hector asked as he exited the bathroom. His pants were in place, and he was tugging his shirt over his head. A shame to cover all that muscled perfection.\n Better question: why wasn’t she jumping all over Ava’s offer? But then, she already knew the answer. Because of him, that’s why. A man who was determined to knock her burgeoning faith in romance down a peg. But he wouldn’t. Not this time.\n “Ava just called me a slacker,” she said.\n “And that amuses you? If I called you a name like that, you’d knee me in the balls.”\n “Twice.”\n His phone rang and he whipped the thing from his pocket. “Agent Dean.” A moment of quiet. His cheeks quickly paled, his gaze swinging to Noelle. “Margarete? Calm down. I can’t understand you.” Pause. “Stay there. I’m on my way.”\n Thirty-three\n HECTOR WALKED THROUGH THE Markses’ residence for the second time in two days. Once pristine, the home was now a wreck. Knickknacks were shattered on the floor. Furniture was overturned. There was a splatter of something wet and golden in the living room. Rakan blood, most likely.\n There was no sign of Margarete, but he knew she was here.\n On his way over, he’d had Noelle call the agents guarding the outside. She’d told them Margarete claimed someone had broken in, someone she’d managed to fight off to lock herself in the hidden safe-room Bobby had built for her.\n They hadn’t seen anyone enter. So either the Arcadian had teleported in despite the wall shields or the guy who’d gotten in was very good at remaining in the shadows. Either way was bad news for the investigation. \n","sourceLink":"https://allnovel.net/dark-taste-of-rapture-alien-huntress-6/page-36.html","bookId":1770,"book":{"id":1770,"title":"Dark Taste of Rapture (Alien Huntress #6)","description":"Storyline: \n Dark Taste of Rapture (Alien Huntress #6) \n With one caress, he can give unforgettable pleasure . . . or unending pain. . . . \n Hector Dean is shaved, tattooed, and totally ripped—and he has a deadly secret. He is a walking weapon, capable of killing with a single brush of his fingertips. Little wonder he’s determined to remain on his own. But Noelle Tremain is a temptation like no other. She is beautiful and rich, with a party girl smile that hides a shocking vulnerability, and from the beginning his sizzling attraction to her is undeniable. For the first time, his stone-cold resistance is tested. But to be with her, he risks destroying her. \n When a wealthy businessman is murdered in New Chicago’s seediest district, the two are partnered, and there’s no escaping what they both want: each other. Yet neither Hector nor Noelle knows what to fear more—the killer case, or their own lethal desires. . . .\n \n","cover":"https://allnovel.net/images/dark-taste-of-rapture-alien-huntress-6.jpg","author":"Kerrelyn Sparks","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/dark-taste-of-rapture-alien-huntress-6.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:28:07 AM"}}
