{"id":4371,"no":5,"title":"Chapter 4 The Quenching of the Light","content":"i. Repercussions in Britain THE AWAKENING of the Tibetans caused a stir throughout the world. For a while it seemed that at last the light would win. Bold young Tibetans, ‘itinerant servants of the light’, left their frugal and crag-bound ‘incipient Utopia’ to spread the gospel across the high passes of the Karakorum Range into Sinkiang and far into the Russian plain. Others, still more daring, penetrated eastward to the upper reaches of the Hwang Ho. Evading the efficient Chinese police, they carried the word even to Shanghai, and thence to Japan. Yet others, crossing the more difficult and neglected of the Himalayan passes, percolated like an invisible ferment into the peoples of India; while others again crept along the gorges of Kashmir, seeking Europe. Thousands were caught, and tortured with all the cunning of medical and psychological science. In China these tortures were often carried out in public to entertain the people and warn those who had any leanings towards the light. But few of the missionaries were extirpated before they had infected with their message many who were ripe to receive it. Meanwhile in Lhasa and the other great centres of the new-old truth swarms of young men and women were being trained to carry on the great task. In every land the servants of the light were heartened. The servants of darkness were bewildered and anxious. Here and there throughout the two great empires brave attempts were made to copy the Tibetan experiment. Here and there, notably in Britain, the party of the light organized an armed rebellion. This little episode on the fringe of the Russian Empire was of no general significance. The focus of interest was always Tibet itself. The two imperial powers had, of course tried to frustrate the Tibetan revolution, but at first each had regarded the strange commotion on ‘the Roof of the World’ as a comic side-show. Each had been concerned to gain a diplomatic victory over its rival in the Tibetan no-man’s-land rather than to preserve the old Tibetan régime. But when the revolution was actually accomplished, the Russian and Chinese oligarchs began to be alarmed. And when it became evident that the insignificant Tibetan state was fomenting the subversive forces beyond its frontiers and planning a world-wide revolution, both the imperial governments began to take serious action. The campaign of terrorism which each undertook within its own frontiers was not as successful as had been hoped. The progressive minority, disciplined by Tibetan leaders, showed fanatical courage. Moreover each imperial government at first made the mistake of fostering the subversive movement in its rival’s territory. Not till matters had become very grave was this policy abandoned by a tacit agreement between the two great powers to postpone all action against one another till the epidemic of sedition had been crushed. Even so, neither could trust the other not to use the crushing of the Tibetan experiment as a pretext for annexing the country. Whenever one of the two powers threatened invasion if Tibetan propaganda did not cease, the government at Lhasa was able to count on diplomatic or even military intervention by the other. There came a time, however, when fear of Tibetan ideas overcame imperial rivalry. Both oligarchies were finding it impossible to cope with the rising tide of religious fanaticism within their own frontiers. Though every city had now its own congested concentration camp, though time after time these camps were emptied to provide a public holocaust in which, before the eyes of a howling and ecstatic mob, thousands were roasted alive or vivisected by machinery devised to produce maximal pain, the movement continued to spread. It even infected the troops. In these circumstances the two oligarchies were forced to put aside their rivalry. Their leaders met in conference in the newest and wealthiest suburb of Irkutsk, on the forest-clad shores of Lake Baikal. There they worked out a common policy. The conference was dominated by a young Chinese official psychologist who claimed to have an infallible cure for the world’s madness. To appreciate his contentions it is necessary to understand the mentality of the oligarchs. They were in the main sincere believers in their respective empires, and in imperialism itself. Their conscious minds were those of devoted, meticulously accurate civil servants who felt that their society was in danger of disintegration through an enthusiasm beyond their comprehension. On the whole they disliked the orgy of torture with which it was hoped to break the movement, but they believed it necessary. Moreover most of them unwittingly derived satisfaction from it, for most were frustrated spirits, teased by an unrecognized itch of resentment against those who had maintained spiritual liberty and integrity by rebelling against the established barbarism. Moreover in the Russian and the Chinese cultures there were elements which favoured cruelty. The Russians were a kindly not a cruel people, but in the pseudo-mysticism of degenerate Russia there was in some respects a return to prerevolutionary ideas. Suffering was conceived of as the supreme purifier and the supreme source of illumination. Consequently the infliction of suffering on others might sometimes be laudable. The Chinese, on the other hand, though so fastidious and so friendly, had always been liable both to cold cruelty and to passionate vindictiveness. The Chinaman who had ‘run amok’ did but manifest an impulse which was latent in all his race, and indeed in all mankind, though with less dramatic expression. The argument of the young psychologist was briefly this. Tibet had become obsessed with an idea, and was infecting every people. To resist such an emotional and dynamic idea it was necessary to have another idea, contrary and even more potent. It was necessary to give the people something to live for, die for, and kill for. The Tibetan idea was the incredible ideal of a world in which men would fulfil their powers in joyful service of the common weal. To counter this insidious doctrine it was necessary to preach sacrifice, self-immolation, enlightenment in suffering, obedience to the divine and ruthless Will, embodied, of course, in the fiat of the state. Two ideas, the psychologist insisted, must be reiterated on all possible occasions and given some kind of concrete symbolization. In the first place it must be constantly pointed out that though the Tibetans themselves insisted on submission to the divine will, their conception of that will was effeminate. Moreover the Tibetan emphasis on submission was incompatible with the contrary exhortation to strive for revolutionary change. Submission must be absolute, fervent, ecstatic. Only at the command of the state must it give place to struggle, and then struggle itself must spring from utter submission to the divine state. Of course if the state was palpably not divine, if it was, for instance, the utterly perverted Tibetan state, struggle must be constant and resolute until the true state was founded. But under the divine state the supreme virtue was obedience. For the state in its wisdom would decide what was the right function of everyone. As for the right to education, there was no such thing. In its place must be set the right and duty of ignorance. Let each man know merely whatever was needed for the fulfilling of his function. To know more was wicked, and to the truly spiritual mind repugnant. Obedience involved also the pious acceptance of suffering, one’s own and one’s neighbour’s. But indeed suffering was not only to be reluctantly accepted; it must be welcomed. For the second great idea which the psychologist stressed was the excellence both of suffering and of cruelty. In praising kindliness and mutual respect the Tibetans had overlooked another important value. No doubt there was a place for kindliness. Between members of one family, and between loyal members of the divine state, kindliness was necessary so long as it did not infringe against loyalty, But from the spiritual point of view there was a virtue more important and more illuminating than kindliness, namely cruelty. For cruelty, he said, was complementary to suffering. In torture, both victim and agent should experience an ineffable illumination. Like the union of love, and in a far more vivid manner, the union of victim and torturer was a creative synthesis in which a new and splendid reality was brought into being. The proof of this was in the experience itself. The torturer knew well that ecstasy. The victim, if he was spiritually disciplined beforehand, should experience an even more exquisite, excruciating joy. The psychologist urged that the two governments should secretly select and train the future prophets of this faith, and launch them out as spontaneous religious enthusiasts throughout the two empires. It would be well that these agitators should be critical of the existing imperial governments, condemning them as but feeble embodiments of the truth. Indeed these state-aided revolutionaries should be encouraged to demand a new regime. Let them go so far as to incur persecution by the existing governments. Some of them would then have to be sacrificed, but the survivors must be heavily financed to rouse a revolutionary fervour among the populace, the object of which would be not the milk-sop liberal-socialist Utopia achieved by Tibet but the fulfilment of the potentialities of the existing order. Only when the true divine state had been established would the virtue of absolute acquiescence be possible. Such a movement, the psychologist prophesied, would sweep the world. It would appeal both to the universal impulse to ‘pass by on the other side’ when help was demanded and to the no less ‘widespread need for destruction and cruelty’. He suggested that, in consonance with the two national temperaments, acquiescence should be stressed in Russia, cruelty in China. This difference, he added, could be used as a basis on which to build Russo–Chinese national hatred when the time came (as it surely would) for the world-wide ruling class to tighten its grip on the people by means of a world war. It was never clear whether the young man believed in the faith that he was preaching or whether he advocated it merely as a piece of necessary statecraft. It was as statecraft that the conference accepted the policy. It was obvious that the Tibetans, few, relatively poor, and unequipped for war, could not resist the combined forces of the two empires that covered the world. There was only one hope, namely that the servants of the light in all countries would be able to carry out so great a campaign of passive resistance and active sabotage that the attack would never be launched. The Tibetan renaissance had been strongly pacifist in temper, though never pledged to absolute non-violence. The Indian influence had been complicated by the influence of China. In the new crisis a vociferous party urged that, since resistance was anyhow hopeless, the time had come for heroic non-resistance to invasion; and that sabotage in the two empires must not be encouraged. Against this view it was pointed out that non-resistance was doomed to fail against invaders schooled to despise gentleness, and that no policy could succeed but one which combined total revolutionary action in the imperial territories, desperate resistance to invasion, and absolute loyalty to the spirit. This became the official policy, but as the war proceeded the pure pacifists became strong enough to blunt the edge of resolution. In relation to Russian and Chinese propaganda in Tibet the strength of pure pacifism in the country had an unfortunate influence. Large numbers of the less intelligent Tibetans, seeing clearly enough that pure pacifism would not work against the ruthless enemy, conceived suspicion and disgust against all those who were in any way sympathetic to pacifism. They thus laid themselves open to the propaganda of the servants of darkness, who soon discovered that their efforts to undermine Tibetan faith were not wholly unsuccessful. But the battle was not yet lost. The servants of light throughout the empires did succeed in rousing many peoples to organize strikes and rebellions in defence of Tibet. In parts of Western China, in Sinkiang, and in Kashmir, all of which had been greatly influenced by the new Tibet, the imperial governments were defeated, and governments of the light were created. Even in far Europe and in farther America the Russian power was seriously threatened. Everywhere the rebels knew that they were fighting in a desperate cause, and that if they were defeated the vengeance of the tyrants would be diabolic. But Tibet had become for millions throughout the world a holy land, and its people the chosen people who must be preserved at all costs. For Tibet was thought of as the germ from which a new world-organism would in due season develop. If the germ was destroyed, all hope would be for ever lost. While these rebellions were in progress, and while throughout Asia munition factories were mysteriously blowing up and aeroplanes showing a strange inability to leave the ground, the Tibetans were hastily organizing a forlorn defence. Rebellions beyond their northern frontiers made it possible to work unhindered to turn the Karakorum and Dangla Ranges into a continuous fortress. To the south the Himalayas were a natural barrier. To the west the successful Kashmiri rebels would defend them to the death. Eastward the Chwanben gorges were still being held. But the main defence against invasion, though not against attack from the air, was a device recently invented by geneticists and biochemists in one of the great reformed Lamasseries. The character of this invention shows how strangely science was developing under the influence of will for the light. Some miles in front of the fortifications the new defences formed a belt about two miles wide and completely surrounding Tibetan territory, save for the exits and entrances of rivers. Throughout this belt the ground was impregnated to a depth of several feet with a micro-organism which had been artificially bred from a natural virus. It had a strange property. Though in one stage of’ its life-cycle this ultra-microscopic object remained deep underground in chemical reaction with certain products of vegetable decomposition, in another stage it gradually percolated towards the surface and finally drifted off into the air, to reproduce and take part in other chemical reactions before settling once more on the ground and sinking into the subsoil. In the air this virus formed an ultra-microscopic dust which would inevitably be inhaled by all animals in the infected area. From the respiratory organs it travelled to the brain. It had a startling effect on the higher brain centres. It produced a complete but temporary loss of memory and of nearly all acquired skills. Even those habits that were most long-established and familiar were seriously disturbed. Speech and walking became infantile, perception largely meaningless. Intelligence remained; but, shorn of all its acquired experience, it was like the intelligence of a bright and ignorant child. But the most striking aspect of the virus was that its influence could be almost completely resisted by minds of high intelligence and integrity that had undergone a thorough spiritual discipline. Many Tibetans, therefore, could cross the defence belt in safety so long as they kept their minds occupied with meditation, while on the journey and resisted the oppressive drowsiness which was the first symptom of disintegration. When at last the dull-witted armies of Russia and China with their irresistible war machines attempted to cross the belt, their personnel was mysteriously reduced to infantilism. Many accidentally killed themselves with their own machinery. The army became a stumbling, helpless mob. They were shepherded back into their own territory by Tibetan police. Many were then slaughtered by their Russian or Chinese compatriots as worthless goods. Some were preserved for observation, and after a few weeks they completely recovered. Fresh attempts at invasion met with the same fate. Respirators were of no avail, for the ultra-microscopic spores could pass through any filter, and nothing would poison them that was not also poisonous to human beings. But though on the ground the frontier was inviolate, the virus provided no defence against attack by air. The Tibetans had a small but brilliant air force. It had been assumed that in any attack by one of the two empires the other would be eager to check aggression by its rival. In such circumstances such an air force as Tibet possessed might prove invaluable. But against the combined air forces of Russia and China, it must surely (thought the leaders of those empires) prove impotent. This calculation omitted the spiritual factor. Not only had the Tibetan airmen been trained to the highest technical proficiency. They were also, one and all, conscious servants of the light. Boys though they were, and therefore as yet incapable of the deeper spiritual insight, they had been brought up to experience without perversion the fundamental values for which Tibet was standing. Full well they knew that the Tibetan community was the one sane and joyful community in a crazy world, and indeed the first terrestrial society to be consciously planned for the full expression of the spirit. They also knew that if they allowed Tibet to be conquered they would doom the human race to servitude under the will for darkness. They knew that henceforth all human loveliness would wither and vanish. And they were convinced that for themselves fulfilment must lie in perfect service in the air. With a calm and absolute courage more formidable than any fanaticism these young men soared against the invading bombers, and brought them down in thousands. In passing I record one unusual qualification which the Tibetan government exacted of its young airmen. They must be married men. Further, none might go into action against the enemy unless he had a child, or his wife was pregnant. It even became a point of honour with these strange ‘aces’ not to take extreme risks until they had at least three children to their credit. So effective was the defence put up by the Tibetan air force that the repeated waves of attack became more and more infrequent and finally ceased for several years. During this period the Tibetans maintained themselves in complete isolation from the rest of the world, save by radio and occasional daring excursions by planes to foment revolution or seize some much needed commodity. Meanwhile the imperialists were preparing so great an air-fleet and so numerous a population of pilots that effective resistance by the shrunken Tibetan air force would be impossible. When the great attack was launched, the sky over Tibet was darkened by the invading bombers. Every town and village and all the great isolated monasteries were very soon destroyed. Lhasa, the spiritual heart of the country, was completely obliterated. Watching these events from my look-out in the remote future, with superhuman intelligences as my fellow spectators, I might surely have been immune from human pity. But in fact compassion and admiration overwhelmed me. For here was a people most sensitive, most aware, the heirs and upholders of a most rare and glorious social fabric, a people rightly believing themselves to be the sole effective champions of the light in a darkened world. And all that they had built was being destroyed. Not only the loved temples of their faith, not only their precious houses of learning and all their instruments of economic production, were now being sacrificed, but also, and far more precious, their young people, the perfect fruit of all their past endeavour. Homes were broken up for ever, parents bereft, children orphaned, and lovers, seizing delight even under the wings of death, were suddenly mingled in a hideous and undesired union. By night the high clouds were lit up continuously by the flashes of guns and bombs and the sinister but lovely glow of the great fires. By night and by day the bombs still screamed and crashed, while men searched the wreckage for their companions. The Tibetans did not give way to self-pity. The prevailing temper was a devoted patriotism, which, like so many earlier patriotisms, but this time with justice, regarded the preservation of this nation and its culture as urgent for the well-being of humanity. At this stage of the war the population went about its work in a state of exaltation tempered by humour; with a sense that this was the supreme moment of mankind and a battle infinitely worth fighting, yet with surprisingly detached relish of the irony of Tibet’s plight. The people now set about adapting themselves to their new conditions. For long the Tibetans remained in good heart, sending constant radio encouragement to the tormented servants of the light throughout the world. But the bombing increased. The whole strength of the two empires was concentrated on the destruction of the heroic nomads. According to a current jest Tibet had bombs instead of raindrops. The enemy air forces succeeded in infecting the reservoirs with disease-germs. Disease spread like fire through the population. Prolonged freedom from infection had deprived it of the normal powers of resistance. Meanwhile the pure pacifists, and also the secret believers in the synthetic faith which was propagated from the empires, were urging the government to surrender. From the point of view of the ‘fifth-columnists’ peace was indeed earnestly to be desired; for the gradual impregnation of the whole land with the virus of defence was already reducing them to imbeciles. Many whose faith in the light had been strong were now so physically enfeebled by the strains of war that even they could no longer resist the virus. It soon became evident that in time the great mass of the population would succumb. The obliteration of Lhasa had destroyed the educational and spiritual nerve-centre of the state. For a while the great provincial religious institutions successfully carried on the task of maintaining the spiritual discipline of the population. But one by one these were destroyed. The older generation were still fortified by their past schooling, but the education of the young, formerly the state’s most urgent task, had now perforce to be neglected in favour of the insistent demands of defence. Consequently it became increasingly difficult for adolescents to resist the virus. Even at the height of Tibet’s prosperity the population had been small. Warfare had now greatly reduced it. Under the progressive regime the Tibetans had been the world’s healthiest people. Native toughness had co-operated with a magnificent health service. Those days were gone, for war had not only introduced disease germs but destroyed the health service. Moreover there had been heavy casualties among the herds of yak. Famine was still further weakening the stamina of the people. Worst of all, the water supply, always meagre, had been greatly reduced by the constant bombing of the dams. Already the weaker brethren were openly demanding surrender and even plotting betrayal. But betrayal turned out to be impossible because it involved spiritual disintegration, and therefore surrender to the all-pervading virus. Beyond the frontiers the rebellions organized by the servants of the light had long since been crushed. Tibet now faced the world alone. The only hope was that, since the victory of the imperial powers seemed now certain, they would begin to quarrel with one another and use their armaments for mutual destruction. But the Russian and Chinese ruling classes now regarded Tibet with unreasoning, obsessive terror and hate. Consciously believing in their own righteousness and their social usefulness, they were at the same time unconsciously tormented by a guilt which they dared not confess to themselves, a guilt which was both social and spiritual. Against a community which had purged itself of that guilt, and demanded a world-wide purge, they felt bitter resentment and loathing. Moreover the Tibetan community had manifested strange powers which the imperialists in their own hearts knew to be the powers of light, but which consciously they condemned as diabolical. Thus their action against Tibet showed all the persistence of one who, discovering on his body the first minute pustule of some frightful disease, believes it to be the fruit of his own sin, and resolves to cut out the infected part. For the Tibetans the crisis came when a party within the government itself declared that further resistance was not only futile but wrong, since it involved the useless sacrifice of lives. The advocates of surrender were clearly not guilty of treason against the spirit, for they showed no signs of succumbing to the virus. The disagreement was between persons of equal integrity. In the end the peace party triumphed. Those who were still determined to maintain their freedom at all costs withdrew into the wild country on the northern slopes of the Himalayas. Tibet surrendered; and, under the shock of this recognition of defeat, practically the whole population succumbed to the virus.. Those who retained their sanity strove in vain to protect the hosts of their childish compatriots from coming to hurt; but these, unable to cope with ordinary situations, were killed off in thousands. Their decaying bodies littered the plains and added to the pestilence. The sane were helpless, and their numbers constantly decreased. Meanwhile surrender had not brought peace. The victors dared not enter the conquered country, lest they should succumb to the virus. They therefore continued their efforts to exterminate the Tibetan people from the air. In this policy in due season they succeeded. For a few years the Himalayan remnant miserably survived, but in the end these last servants of the spirit were discovered by the Russian airmen. Henceforth their high valleys and gorges were systematically bombed until all trace of habitation had vanished. The imperialists still dared not enter the country, for fear of the virus. They first undertook what must have been the greatest of all decontamination operations. Aeroplanes systematically sprayed the whole vast area with a strong disinfectant which destroyed not only the virus but every trace of animal and vegetable life. The home of the world’s most developed community was thus turned into a desert.","sourceLink":"http://novel.tingroom.com/mingren/711/546.html","bookId":147,"book":{"id":147,"title":"Darkness and the Light","description":"简介： A REVIEWER OF an earlier book of mine said that it was difficult to see why such a book should ever have been written. From his point of view the remark was reasonable enough, for the aim of the book happened to fall outside the spot-light...","cover":"http://novel.tingroom.com/uploads/121218/1-12121P9314C13.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/711","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
