{"id":23517,"no":5,"title":"Chapter 4","content":"My hero had gone abroad with a congenial friend a little older than himself, and the two stayed considerably over their time and enjoyed themselves immensely. They were plentifully provided with money, and Robbie had been told that he might do anything he liked, except get married. Therefore they wandered through all the cities of Europe, and saw all the beautiful things of the past, and all the gay things of the present. They stopped at the best hotels, and everywhere they went men bowed before them, and fled to do their bidding. Also there were many beautiful women who did their best to make Robbie happy. Robert was always a favorite with the girls, being a generous-hearted boy; he always paid for what he got, and paid the very highest prices in the market. He hired a pretty little yacht and took his[16] friend and some congenial ladies for a beautiful trip upon the Mediterranean; and the sky was blue and the air warm, and Robbie stretched himself upon the deck, and basked in the sunlight and imbibed the soft fragrance of cigars and perfumes, and opened his heart and was happy as never in his life before. After which the two travellers turned homeward again. There was some thought of Robbie\u0027s going to college; in fact, he hired chambers and started, at some expense. But it was only for a year, for Robbie had seen too much of the world to go back into a college chrysalis, and when it was evident that he could not get through his exams, he quit and came back to New York to stay.","sourceLink":"http://novel.tingroom.com/duanpian/3229/88275.html","bookId":688,"book":{"id":688,"title":"A Captain of Industry","description":"简介： I purpose in this chronicle to tell the story of A Civilized Man: casting aside all Dreams and Airy Imaginations, and dealing with that humble Reality which lies at our doorsteps....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3229","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
