{"id":99422,"no":15,"title":"Page 15","content":"Jael stands beside me, quietly watchful. I’m glad he doesn’t feel the need to talk all the time. For a few moments, I just rest and try to relax. Surely we can leave soon without giving offense. I have to wonder how long it will take, how many of these functions I’ll be required to attend before the alliance is put to the council for official approval. The wall behind me is soft with yellow blossoms. When I lean against them, crushing the fragile-veined petals against my gold robe, a delicate perfume surrounds me. It’s so soothing I fancy that’s what this room is for—rest and rejuvenation, aromatherapy.\n Footsteps sound. They seem to be approaching my location. Shit. Someone’s found me. I start to get up, and then someone joins the first party just beyond my location. From where I sit tucked in the corner, I can’t easily be seen from outside. The sounds of their conversation slowly crystallize into words, thanks to the translation unit.\n “Did anyone see you slip away?”\n “I do not believe so.”\n There’s a pause. I assume they’re scanning the area. My pulse thuds wildly. If they find me here, it doesn’t mean anything. They don’t know I understand. So I make myself sit still. Maybe I’ll learn something. I just wish I could recognize the speakers, based on how they sound, but that’s far beyond my primitive skills.\n “I do not like the way things are going,” the first one says.\n “We need to take steps,” the other agrees.\n “She humiliated you in the summit.”\n Karom. The second of these Ithtorians is Councilor Karom. A chill ripples over me. I try not to breathe, afraid something I ate will waft to them on the wind.\n “I will take care of her.”\n What does that mean exactly? Somehow, I doubt Karom intends to make provision for me in his will. I don’t know how far I can trust this translation to be accurate, allow for subtleties, nuance, and inflection.\n “Sooner rather than later,” the other says. “The alliance cannot be permitted to go forward. It dishonors our ancestors.”\n “Do not fear,” Karom replies. “It will be done in two days.”\n What’s “it”? Maybe I make a small sound. To my horror, the two Ithtorians rush into the nook where I sit, back to the flowering wall. Blank face, I tell myself. Blank face. I try to make myself look stupid as a herd animal, eyes wide and empty.\n At seeing them, I offer an abbreviated bow, arms to my chest, but I don’t rise. With a languid gesture, I indicate my appreciation for the flowers. They exchange a look. Then the taller one, who I don’t recognize, but judging by the colors on his thorax, he’s important, says, “She is no threat to us. We do not need to accelerate our plans.”\n Karom agrees, “Her dog is not here to translate. She only has this worthless soft-skin for protection. But we may wish to take more care in the future. This would have been disastrous if Velith had been with her.”\n I get the sense that the insult he used is much worse and not analogous to dog, but that was the best approximation my chip could offer. Instinct tells me it’s a bad idea to linger here with them, now they know I’m here, so I get to my feet and offer a low, respectful wa. I brush past, seeking the crowd I’d fled not too long ago. Jael follows along behind me.\n My relief when I spot March is profound. I go to him without hesitation, and to my delight, I feel a little tingle on the nape of my neck. He’s skimming my thoughts, just like he used to. Shock stiffens his spine.\n You got yourself chipped without telling them?\n Ah, shit. Now there’s the downside of our relationship. It’s impossible to keep secrets from him. But then he goes a little further, skimming the gist of what just happened. I can tell by the set of his shoulders he’d like to solve this problem with his fists—or maybe a knife in somebody’s eye. That, too, is progress. He wants to fight for me, not snap my neck with his hands.\n I shake my head slowly, wordless. Not here. Not now. We’ll talk later.\n Did he get that?\n March exhales slowly and nods. The discussion hasn’t been averted, just postponed. I’m grateful the meds keep him from breaking heads the way he wants to.\n We need to think and plan, not react impulsively. Too much rests on this alliance for me to do anything rash that might jeopardize it.\n I know; it’s crazy for me to be the voice of reason, the prudent one, but that’s the hat I’m wearing right now, and let me tell you, it’s tight across the brim.\n Omni News Net: Street Poll\n “Hello, I’m Kevin Cavanaugh from Omni News Net. I’m here on Perlas Station, where Sirantha Jax made her escape, thus beginning Farwan’s downfall.” He turns to a passerby. “Do you have a minute to answer a few questions?”\n “Absolutely.” The girl smiles at the vid. Behind her, the promenade flashes in garish hues, advertising a wide variety of goods and services, most of them formerly illegal on this station.\n “What’s your name, miss?”\n “Kelindra. With a K.”\n “What do you think of Sirantha Jax representing your interests on Ithiss-Tor?”\n “Well, it’s a bit of a joke, isn’t it?”\n “In what way?”\n “What kind of training has she had?” the girl demands. “They may as well have sent me. I saw her for years, showing her tits on the midnight bounce. Table dancing, amateur soft-porn vids, drunk-and-disorderly conduct, barroom brawls . . . how does any of that qualify her to be an ambassador? It’s damn near the dumbest thing I’ve ever heard.”\n “So you don’t think much of her chances then?”\n “We’ll be lucky if she doesn’t start another war.”\n “Are you worried about your safety here on Perlas?” the reporter asks.\n She shakes her head. “Not a bit. This place is more secure than ever, thanks to Jax.”\n “How so?”\n “She got Farwan out of here, so the Syndicate could move in. They now manage and operate more than half the businesses on station. Things are much more efficient these days, and there’s very little crime.”\n From off vid, someone mutters, “That’s because everything is legal.”\n “So you’re pro-Syndicate?”\n “I work for them, yes. They’re fair, unless you owe them money.”\n “So you advise against taking out loans from Syndicate offices?”\n “Well, they’re not a bank, are they? It stands to reason they require different terms. But no, I don’t recommend borrowing from them. In terms of products and services, however, they offer excellent value. Good manpower solutions as well.”\n “What do you think of the proposed initiative to outsource Conglomerate military and defensive contracts to the Syndicate?”\n “They’d make a good job of it. They know how to teach a lesson so that people don’t forget it. One strike from the Syndicate would make our enemies think twice.”\n “You’re not concerned the Syndicate would evolve into another Farwan?”\n “Realistically, it’s a risk, I suppose, but in this day and age, you almost have to choose between freedom, which can devolve into chaos, and security, which can become a pair of shackles. But at least the Syndicate doesn’t attempt to censor the flow of information.”\n “Thanks for your time, Kelindra. I’m Kevin Cavanaugh and this random street poll bounces live from Perlas Station, where you can already see the winds of change sweeping across the galaxy. Thanks for watching, and keep reaching for the stars.”\n CHAPTER 16\n “It’s time to go,” March says.\n He isn’t brooking any argument, so I make my wa to Sharis, allowing him to make our excuses. We’ve been here for hours, so nobody can be offended that we’re leaving. Even if I wasn’t worried, I’m also exhausted and . . . my feet hurt.\n I didn’t see Devri or Mako tonight. I’m not sure what to make of that. Sartha and Karom both attended, but the Grand Administrator didn’t. I guess she had something better to do. It was, all told, an odd occasion.\n With March in captain mode, we round up the rest of our people and head for quarters quickly. In the morning, I have another summit, this time meeting with the captains of industry. The Ithtorians who own controlling interest in the mines are particularly interested in this treaty because of the projected interest in their droids, which are far advanced in comparison to what we use currently.\n They want to question me about the conversion of currency and how much a droid, sold for credits, would actually be worth on planet. I’ll need to run some numbers in the morning and confer with Constance about the commercial aspects of the alliance. She and Vel are best able to provide me accurate information about the profits the Conglomerate can offer.\n I’ve never been so happy to see the end of a party, which says something, considering my reputation. The gutter press used to stalk me, assured of getting something juicy for the midnight bounce if they just stuck with me. Before falling for Kai, I was known for closing down bars and spending all my creds on a last round for strangers who had become my new best friends. But that was a lifetime ago.\n My brain feels a little numb, but I murmur something appropriate as Jael, Hit, Vel, and Dina bid us good night.\n Constance surprises me by asking, “Do you mind if I accompany Velith? I would like to inquire about the native flora and fauna.”\n I hope that’s all she asks about. It wouldn’t surprise me if she took it into her processor to ask about the elevated heat levels she recorded in Devri, who wasn’t in attendance at the party tonight. I try to imagine Vel’s reaction.\n “No, that’s fine if Vel doesn’t mind.” I glance at the bounty hunter.\n He seems willing, if not eager, to put up with Constance, so I give my blessing to their collaboration with a nod. March shoves me into our adjoining quarters without ceremony, then demands, “You got an implant? Do you have any idea what they’ll do if they find out? Are you out of your mind?”\n “They won’t if you keep your voice down,” I mutter.\n He waves that away. “That’s the stupidest, riskiest . . .”\n “Sneakiest?” I offer. He gives me a look, and I go on, “Why do you care anyway? I thought you just wanted to get away from me.”\n “I don’t want anything to happen to you. You’re mine.” The answer slips out from somewhere deep . . . because he looks as astonished as I feel.\n Possessiveness isn’t love. I’m not even sure it qualifies as an emotion. But if he’s feeling territorial, that’s progress from nothing at all. I can work with protectiveness. It’s a stepping-stone to other things.\n “Am I still?” I ask quietly. “Or do you just remember that I used to be?”\n His fingers flex at his sides, but I don’t feel threatened. It’s a restless, searching movement. Belatedly, I notice that he shaved for the party, so his jaw is smooth and strong. I fight the urge to close the distance between us and walk my fingertips across to his mouth. Once, I wouldn’t have thought twice about yielding to the impulse, but he’s a new animal now, struggling between the man he was and the one I want him to be again. \n","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-15.html","bookId":1648,"book":{"id":1648,"title":"Doubleblind (Sirantha Jax #3)","description":"Storyline: \n Doubleblind (Sirantha Jax #3) \n It’s not easy to tread lightly wearing steel-toed boots. \n Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. \n And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. \n But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. \n Which has Jax wondering why a notorious troublemaker like her was given the job.\n \n","cover":"https://allnovel.net/images/doubleblind-sirantha-jax-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/doubleblind-sirantha-jax-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
