{"id":99428,"no":21,"title":"Page 21","content":"Now that’s quite an opening salvo. I’d like to tell her to fuck off, but I count to five, manage not to show my teeth, and come up with a diplomatic reply while Vel buys me time with his unnecessary restatement. To inspire me, I remember Karl Fitzwilliam, the worst ambassador in the history of the universe.\n “I understand we must seem very different to you,” I offer with what I think is admirable aplomb. “That’s why this is such a valuable opportunity for both our peoples. I hope we may come from this alliance with a greater measure of understanding and appreciation.” I cap the shit with a deep wa.\n There, take that. Though it feels hideously unnatural, I don’t lose my cool. Don’t blow my top, or show her my teeth. Mary, but I want to get out of here. It’s only been a day, and I’m dying for grimspace. With attitudes like hers, I think what I said is about as likely to happen as me discovering a cure for Jenner’s Retrovirus over my morning meal, but I can only do so much. Permanent change takes time.\n “Which brings me to my next point,” the Grand Administrator continues. “Though I do not like your people as a whole, I admire your tactics. Your strategies have proven sound and effective, winning support where I would have imagined it impossible. Since I enjoy seeing a female in a position of power, even among lesser species, I invited you to dine. I believe we have something to discuss.”\n I must be careful not to show comprehension too soon, so I merely watch as she raises her arms and wings spread from her back, tissue thin and somehow sensuous, shining with ruby red and glowing gold. In the center, on each side, shines an enormous eye. I’ve seen similar displays before in nature, generally designed for threatening off intruders. For pure and lovely exoticism, I don’t think I’ve ever seen anything that surpasses Otlili. I pay only half attention as Vel murmurs her words over again.\n “Do we?” I ask.\n Slowly the Grand Administrator brings her arms down without collapsing her wings. She crosses them over her thorax, showing me her red-tipped claws. I don’t need Vel to point out her rudeness. In fact, from what I recall, her posture borders on aggressive. I find myself gazing at the eye jutting from her wings.\n “Yes,” she confirms. “If you do not take your ship and depart within twenty-four hours, I cannot guarantee your safety.”\n CHAPTER 22\n As conversational gambits go, that’s a hell of a way to start a meal.\n I’m not sure whether I’m being warned or threatened, and she doesn’t give me an opportunity to inquire. Instead, she summons an automated attendant the likes of which I’ve never seen. It prepares the food inside what I’d call its chest cavity, then folds outward to accommodate us as a makeshift table. We eat standing up with a minimum of conversation.\n No wonder Tarn said there would be great interest in their droid technology. This could make the kitchen-mate obsolete. Of course, for humans to warm to the brand of tech, we’ll need to throw in a couple of chairs, but I can see the appeal overall. Call the bot to make you dinner on the terrace while you lounge, enjoying the sunset. There will be a lot of money in this.\n While musing on the commercial applications, I taste bits of this and that. I can’t recognize most of the dishes served in heavy sauce. The food tastes strange and pungent, with a coppery cloy that reminds me of blood. Flesh slips down my throat, slick and rubbery. I don’t like it at all, and the silence isn’t helping.\n I suspect she remains quiet to keep me off-balance, knowing I must be thinking about what she’s said. Her tactic works like a charm; I find myself feverishly turning over the possibilities while trying not to watch how the food she devours appears to still be squirming. The Ithtorians think humans are disgusting because, among many other offensive habits, we’re also carrion eaters. In our past, we’ve feasted on dead flesh, even if now we prefer synthetic proteins. Vel’s people find that repugnant, as even now, they like their food fresh to the point of wiggling.\n Finally, the interminable luncheon ends, and Otlili seems ready to elaborate on her words. But first I must thank her for the hospitality.\n “You have done us great honor, and we feel privileged to be in your company.”\n After Vel relays my words, she acknowledges this graciously, but that’s not why I’m here. She can find someone to flatter her, probably much better than me, at any hour of the day. She’s the most powerful person on Ithiss-Tor, after all.\n “You are to be commended for your patience,” she says then. “And though I have been favorably impressed with you, ambassador, I cannot say my overall opinion of humanity has changed. My people would be irrevocably altered—lessened—should we come into regular contact with your kind. I do not particularly wish any harm would befall you, but . . .” She pauses delicately, the force of a thousand rivers powering words unspoken. “This alliance will never come to pass. I strongly recommend that you take your team and depart before the matter is put to a vote.”\n A threat then.\n “I regret that I am unable to comply with your recommendation.”\n I wish now that I hadn’t eaten at her table, but surely she wouldn’t poison me here and now. For all she knew, I might have heeded her warning. A murder attempt in daylight seems a bit precipitous, and the Grand Administrator is not known for her impulsive nature.\n She regards me for a moment from eyes that give nothing back, a dark infernal sea teeming with her clever conspiracies. “Not yet,” she answers with the air of one making a final judgment. “But you will.”\n That sounds like a promise, but if she has her way, I won’t live to regret my choice too long. I feel strange and dizzy, sick with too much unfamiliar food. Vel guides me through the courtesies in departure. I’m vaguely aware that my wa is not good, but if I bend too low, I might sick up on her rug. What the hell did she serve me?\n I want to ask if she slipped me something, but it’s not like anyone would believe me. She could deny ever having me up here. The room blurs, two of everything swimming in a bizarre array of inexplicable colors.\n Once we step into the lift, Vel takes my arm, supporting me. “At least you walked out on your own two feet.”\n My tongue feels weird and thick. “Most people don’t?”\n Vel sounds grim. “Most are not invited at all. And the ones who are have a history of disappearing.”\n I should have known that. Why didn’t I know that? I mumble something incomprehensible. The world flickers in and out like a corrupt vid file. Belatedly I realize this coincides with my blinking. So I do it three or four times just to test the theory.\n His mandible works, but there’s a delay, and the chip is feeding me what I think is native Rodeisian, except I don’t know that language, so I can’t understand anything from the weird racket in my brain. I find myself wondering if he’s ever lain down like a good submissive male for Sartha. Maybe she misses the sex. Maybe that’s why she’s still sad he left turns ago . . . and why not, I’d miss him too if he left. But for her, it’s been longer than that, actually—\n Holy shit, is that a giant crab? No, that’s my foot.\n We’re at the bottom somehow now. I don’t remember riding down, and we’re facing those bizarre plant soldiers again. Do they attack people for leaving without the Grand Administrator? I press my spine against the back of the lift. I’m not going past them. There’s something wrong with those things. Their blank faces seem inexpressibly evil, like a white cloth pressed against a madman’s leer.\n “Come, Sirantha. Take a step for me.”\n I’m appalled to hear how young and scared my voice sounds. “No, please don’t make me.”\n “This is what she wants,” Vel says firmly. “She wants to undo all your work. When people see you acting like a terrified, truculent child, it makes Karom’s case. Humanity is impulsive and irrational, reckless and unpredictable. You cannot gauge their future behavior based on past precedent. So I need you to walk for me. Take a step. Say nothing. I will take you to your room and look after you. This will not kill you, but you might wish you were dead before nightfall.”\n I rein in my irrational terror of the plants long enough to fix on something he’s said. “She did give me something.”\n “A spice in that blue sauce reacts on human physiology as a powerful hallucinogen. I did not realize until after you had eaten it. I am sorry, Sirantha. I fear I have failed you. But if your mission is to succeed, I need you to take a step. Just one. Come.”\n “You didn’t fail me.” Even brain-fuggled, I know that much. I can’t make myself walk past those plants. I can’t. So I close my eyes and pretend they’re not there. “Can you lead me?”\n I might have been able to say that to March, once. Not anymore. That means Vel’s the only person left I trust completely. In answer, he takes my arm. As he asked, I take a step. Then another. In comparison with the world zooming in and out of focus, the darkness feels comforting.\n We’re stopped only once, and Vel tells some importunate well-wisher, “The ambassador is meditating. She will converse with you later.”\n Glee zings through me. They won’t know that humans don’t generally amble around with their eyes closed as part of any spiritual regime. Still, I’m relieved when the door to my quarters glides shut behind us.\n Vel guides me to the sloping settee where I listened to Mair’s journals last night instead of sleeping, but I can’t lie down in my ceremonial robes. I’m afraid I’m going to hurl all over them. I try to explain that, but the words come out all jumbled. After taking stock of the situation, Constance escorts me to the bedroom, where she helps me into what passes for my pajamas.\n With the best of intentions, she tucks me in, but I don’t want to go to bed because that’ll mean being alone. So I stumble back into the living room. I try to ask how long before this wears off but the question comes out, “Jump weasel wants a dark shooter.”\n Well, shit. I haven’t been this fragged up in turns. Hard to believe I used to do this for fun. I don’t like the way the world keeps reinventing itself for my amusement, and I’m starting to feel really queasy. By fighting it instead of enjoying the show, I’m no doubt making it worse.\n Vel leads me to the settee again, then kneels beside me, looking into my face. “It is going to get a lot worse,” he tells me. “Do you understand that, Sirantha?”\n I understand that his right eye is slowly sliding to the side of his head. Then it zips down to his neck and keeps going, a sly, saucy little thing that winks at me as it goes. It’s hard for me to keep track of what he’s saying when his face is doing that. I squeeze my eyes shut, and the pressure on my lids gives the darkness a red tinge. I feel his claws rake through my hair, unpinning the mass with Constance’s help.\n “I will stay with you. Do not worry,” Vel says, but he sounds like someone else now, as if his voice has shifted, and if I open my eyes I would see another in his place.\n Then I’m lost to fever dreams. \n","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-21.html","bookId":1648,"book":{"id":1648,"title":"Doubleblind (Sirantha Jax #3)","description":"Storyline: \n Doubleblind (Sirantha Jax #3) \n It’s not easy to tread lightly wearing steel-toed boots. \n Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. \n And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. \n But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. \n Which has Jax wondering why a notorious troublemaker like her was given the job.\n \n","cover":"https://allnovel.net/images/doubleblind-sirantha-jax-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/doubleblind-sirantha-jax-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
