{"id":101077,"no":34,"title":"Page 34","content":"Vel shakes his head. “Not easily. If she has managed to pass undetected this long, perhaps we underestimate her abilities. I hope she has not come to harm, but it will certainly arouse suspicion if we go in search of her now. We cannot be caught attempting to leave our housing complex, so for now, we must maintain a holding pattern, as Tarn instructed.”\n I hate hearing that.\n Three days pass, the Bugs pursuing their painstaking investigation. They won’t tell me anything when I inquire. We’re confined to our wing of the annex as best as I can tell “for your own safety.” Apparently it’s getting ugly out there, and I suspect it won’t improve as long as we remain in hiding. To my mind, doing so reeks of cowardice and guilt.\n Sharis clings to life stubbornly, and that’s my sole comfort. If he dies, events escalate from nasty to irreparable. Doc hasn’t come to any conclusions, nothing the Bugs don’t already know, but he has a lead on a regenerative nanoprotein string that might be able to do something about the internal burns Sharis suffered when he ingested the food laced with citric acid.\n We live in hope that Doc will be able to reverse some of the damage. A very chilly Councilor Karom calls on the morning of the fourth day. He doesn’t bother with a wa over the vid.\n “Please inform your pet,” he addresses Vel, “that Sharis will never again enjoy full health, even if he survives. I am not alone in blaming your delegation. It is only a matter of time before one of you is arrested. You might find it wise to flee before we discover which of you vermin did this.”\n Yeah, running away would solve all our problems. I disconnect the call without bothering with any of the outward trappings of diplomacy either. Maybe we should leave. I don’t think the alliance is going to happen now. Nothing I do hereafter will make a difference. Despair weighs on me, knowing how bad it is in the star lanes already.\n Raiders, Farwan loyalists, Syndicate skyjackers, and the Morgut rampaging unchecked—Ramona will love this. People will queue up to pay her protection money. The thought of her satisfaction absolutely galls me.\n And we still haven’t heard from Constance. She’s not just my PA; she’s also my friend. Didn’t she try to comfort me after the Grand Administrator drugged me, and I dreamed about Kai? When I woke, it felt like I had lost him all over again. Constance was kind, and she touched my hair that night. I haven’t seen her since.\n Jael told me she was fine, so I didn’t worry until the next day. And then I listened when Vel said it wouldn’t be prudent to search for her. But if she were human, I wouldn’t have listened. I’d have searched before now. Guilt becomes my constant companion, and not even March’s arms around me can dispel the gloom that’s fallen.\n On day five of our polite incarceration, things go from bad to worse.\n HARD Times Hit Dobrinya Asteroid\n [ONN: byline Lili Lightman] Fighting broke out today on a mining colony hard hit by the food shortage. Gaunt-faced men wrestled for the last packet of paste while starving children wept. The riots continued until volunteers put themselves in peril to pacify the situation. There were ten serious injuries and one fatality by the time the dust settled.\n Dobrinya asteroid is harsh on its settlers, one of the most extreme environments that allows for human habitation, for it is impossible to step outside without a pressure suit. This small outpost makes its living from the uranium mines. There’s big profit for those willing to put up with living so far from civilization, but their survival relies on regular trade vessels to make the difference between credit-rich and provision-poor. These people cannot farm outdoors. They have a finite amount of space upon which to subsist, and as miners marry and have children, the population is increasing.\n “Supply ships don’t run as regular as they used to,” mine manager Olen Brown said. “It doesn’t matter how many credits you have in your account. If the merchantmen can’t make it through, then we don’t get organic for the kitchen-mate. By the time the last ship got here, we were down to almost nothing and trying to jury-rig the recyclers to purify our waste.”\n Pirates have plagued this particular trade route, preying on both freighters carrying supplies and those loaded with ore slated for processing. The more daring raiders sell the stolen goods to the Dobrinya miners at a ridiculously inflated price. Colonies everywhere are feeling the pinch of a disordered galactic economy.\n “Sometimes you don’t have a choice,” longtime resident Basil Knapp said. “Recently, we bought from the pirates, which only encourages them. But it was that or starve. Dobrinya has been good to me, but if things don’t take a turn for the better, I may need to move somewhere safer. Problem is, I don’t know where that would be.”\n There are a few alternatives they can explore. Jere Bowen, local physician, proposed the following: “Since we can’t rely on regular shipments anymore, we need to work on becoming self-sufficient. Laying in a hydroponics garden would be the most practical solution. Unfortunately, we didn’t foresee this, and we don’t have all the components. That means we need to order supplies . . . and, well, you see the problem there.”\n It’s definitely a volatile situation. Supply store clerk Sadie Reid asked, “Why is it that nobody is doing anything about this? I feel like we’ve been totally abandoned out here. Doesn’t anyone care whether we live or die? After they murdered Miriam Jocasta, I never thought I’d say this, but . . . I miss Farwan. They were bastards, but at least they kept us safe.”\n Bolstered by overpriced supplies, things have calmed on Dobrinya, but the population is sadder and more subdued in the aftermath. During this hardship, they can only cling to one another in the face of a government that seems to have forsaken them.\n CHAPTER 36\n A full complement of Bug soldiers shows up at my lodgings.\n No conversation, they simply come in, according to the commander’s directive. They make for a particular section of wall, and, while I watch, not understanding what I’m seeing at first, they dismantle one of the sections.\n There’s a secret cache inside.\n A technician seizes the item and logs it on a datapad. My heart sinks. I don’t need to be told what they’ve found. Shit. Someone really went to a lot of trouble to make it look like we were behind Sharis’s poisoning.\n “Ambassador—or should I call you spy? We will be taking you and your translator into custody for further questioning.” The captain seems pleased with this development, as well he might.\n “Custody” is probably a euphemism for holding us indefinitely. I don’t understand this time. How can things have gone so drastically wrong? I did everything by the book; I took Tarn’s suggestions seriously and did my best to comply.\n Think, Jax. If I let them take Vel and me, there’s no coming back from that. The alliance will never happen, even if we’re eventually exonerated. I have to find some way to spin this, but I’m coming up blank. There’s just no good reason why I’d have citric acid hidden in a tiny vial inside one of my walls.\n “I had no opportunity the night Sharis fell ill,” I point out. “And no motive.”\n The commander doesn’t care. Once Vel translates, he replies, “Il-Nok may be lying for you, or perhaps you poisoned the food at some earlier time, knowing Sharis would not eat it until later.”\n There are more holes in this theory than in a piece of green Gehenna cheese, but I don’t think they’re looking for logic. They want a scapegoat, someone they can hold up to the general populace and say, This is the culprit. Enjoy her punishment! See, now you can sleep safely again. We’ve taken care of the problem as we always do.\n They must’ve analyzed all the scans they took the first time they searched my quarters. Bugs are slow but methodical when they work, and they would have left no centimeter unexamined. That’s when it occurs to me.\n “I knew you had checked this place thoroughly,” I say then. “If that’s mine, why wouldn’t I have moved it before your return? That makes no sense at all. The person who planted it either didn’t know you’d taken readings or didn’t care. Neither applies to me.”\n “Perhaps you were unfamiliar with the way our technology works.” The captain is out of patience with me. “Will you come quietly, or must I use force?”\n Every muscle bristles with the urge to fight. My stance says, Bring it.\n “It’s mine,” March says into the silence. “They knew nothing about my personal agenda.” He stands tall and strong, arms behind his back. There’s a certain resolve about him, as if he knew this was inevitable.\n Oh, Mary, no. I remember him saying, They like me for it. In awakening his emotions, I’ve also aroused his monstrous sense of accountability. Coupled with impossible altruism, I know exactly why he’s doing this.\n No, no, no. I don’t want him to save me. I want him to stay with me. Tears prickle at the corners of my eyes. He didn’t do this. He wouldn’t. But he seems so firm; maybe it comes from the knowledge he’s delivering us from an ugly situation. Something tells me March would rather die a hero than as an old man in my bed. We share that in common.\n The crew freezes, as if they don’t dare breathe. Everything holds a queer, polished sheen from the glimmer running along Dina’s golden hair to the glamour of Hit’s dusky skin. The light refracts to the chitin of the Bugs standing by with weapons. At any moment, this could turn into a bloodbath to make Fitzwilliam’s colossal blunder look like a minor glitch.\n “And I didn’t realize your scans would show spatial anomalies,” March continues, seemingly oblivious to the tension. “I never meant to cause any trouble for you personally, Jax. But I’m a purist . . . it offends me to think of allying with these monsters. However bad it gets out there, we can handle it on our own, as we always have. Nobody bailed us out in the Axis Wars.”\n The conviction in his voice alarms me. While Vel relays March’s words, a look of stunned heartbreak shines in Dina’s clear green eyes. Hit takes her hand, probably trying to comfort, but Dina shakes her off.\n “No,” the mechanic says. “He’s lying, he has to be. Don’t let him do this, Jax.”\n I don’t know how she thinks I can stop it. The wheels are already in motion, and they’re not going to listen to anything I have to say. They wanted a scapegoat, and now they have one. I could kill him for this, but I’m terrified the Bugs will do that for me. March will wind up in the mines, and he won’t even have his emotional detachment as a defense mechanism.\n Still, I try. “Scan him to make sure he’s telling the truth.”\n I know the Bugs have the technology, but the commander reacts as if I have suggested something vaguely obscene. “Do you call your own lover a liar, ambassador? One wonders at your judgment then, as I can smell him all over you.”\n Vel repeats the insult, and, by the way his claws unfurl, he would like to teach the captain some manners. Under any other circumstances, I’d let him. With untold effort, I manage to keep my cool when all my instincts are telling me to wade in and wreck this room, then run for it. \n","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-34.html","bookId":1648,"book":{"id":1648,"title":"Doubleblind (Sirantha Jax #3)","description":"Storyline: \n Doubleblind (Sirantha Jax #3) \n It’s not easy to tread lightly wearing steel-toed boots. \n Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. \n And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. \n But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. \n Which has Jax wondering why a notorious troublemaker like her was given the job.\n \n","cover":"https://allnovel.net/images/doubleblind-sirantha-jax-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/doubleblind-sirantha-jax-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
