{"id":101079,"no":47,"title":"Page 47","content":"“I must be dreaming.” I shake my head. “You’re not.” I think this is the first time I’ve ever seen him totally overcome. March struggles visibly for words, and finally comes up with: “What’re you doing here, Jax?” “I tried to get them to let you go, but your confession was all they wanted. They don’t care about the truth. They don’t even care which human suffers, as long as one of us does, but it must give them special satisfaction to know they’ve taken someone important to me. It’s an indirect way of punishing me, too.” “That doesn’t answer the question.” He hasn’t moved, hasn’t tried to take me in his arms. I continue my story doggedly. “So I made up my mind to fix this. Jael belongs in here, not you. As far as I’m concerned, he can rot here forever in your place. I don’t care after what he let them do to you.” “It was Jael?” Now he’s surprised. “What the hell—” “My mother,” I answer bitterly. “She bought him on Venice Minor. I should have wondered why he drew the line at slitting her throat, but I didn’t know him well enough to realize he’d kill anybody if the price was right. Credits are the only god he acknowledges. The bastard was still doing his job as my bodyguard while working to undermine the alliance. He figured he could collect both payouts as long as the alliance failed, and I didn’t die here.” “Tarn would have to pay,” March agrees. “But they won’t listen to you . . . so you sneaked in . . . to say good-bye?” He looks older somehow, thin, battered, and inexpressibly weary, possibly even of life itself. His lip is split, and even in this light, I can tell he has a black eye. There’s crusted blood all down his neck. I can’t imagine what the rest of him looks like. Rage flashes though me. Right now I would like to blow this whole planet to pieces. I try not to consider that this is the ending he wants, dying like a hero. So I take a breath, mustering the courage to go on. “You proved once you’d kill the world for me. I may be doing the same thing . . . I don’t know if the alliance will hold, if they notice the switch. They might see it as treachery and call everything off. I don’t know, and I don’t care either. See, the world isn’t worth saving without you in it.” “Jax—” “Vel is waiting in the hall with Jael. Dina and Hit have a shuttle hidden nearby, and the ship’s in orbit, waiting for us. We need to get you out.” I manage a smile then. “You have three minutes to decide, Mr. March, and the clock is ticking.” There’s a flicker of recognition as he remembers his words in my cell that day. I have the feeling he really thought he’d been abandoned. That hurts as much as anything he could have said. Or not said. I can’t believe he doesn’t know I’d walk through hell for him. I can’t believe he doesn’t realize there are no circumstances under which I’d give up on him. I’m not that Jax anymore. “Well . . . I’d be an idiot to say no after you went to all this trouble, wouldn’t I?” He pushes to his feet though he can’t stand upright in here. I slip out the open cell door and signal Vel, who brings our replacement. From here, the plan is simple. March dons the Bug disguise Jael had on, and we walk him out, leaving Jael in his cell. Now we just need to find an exit. THE CONGLOMERATE NEEDS YOU! The Armada motto: “We make war that we may live in peace.” The time has come for us to return to the days of empire. We will build a strong tomorrow, and you can be a part of it. We will fear nothing but injustice. Join now! Fight for liberty, truth, and right! There can be no greater good than to give yourself for your people. Don’t miss this opportunity to see the stars Full training provided Includes special, credentialed career paths 500-credit signing bonus Enlistment term, three turns Recruitment offices on all tier worlds Bounce inquiries to 12.45.900.78.0987 CHAPTER 51 “This isn’t over,” Jael says, as Vel takes off his muzzle. Next, the bounty hunter removes his restraints. We can’t leave any sign this isn’t the same human they had before. I’m counting on the fact that we all look alike to them . . . and even if some guard notices, he won’t want to get in trouble by being the one to point it out. How do you explain winding up with the wrong prisoner in a completely secure facility? In such a case, the person who reports the discrepancy is almost certainly going to be blamed, harking back to a long, proud tradition of shooting the messenger. Jael fixes on us a look sparkling with hatred. “They won’t be able to hold me. And I will find you.” I smile from the other side of the grate. “Good luck with that.” “Word to the wise,” March says. “Yelling just pisses them off.” “From here, you cannot speak,” Vel tells us. I know that, but March needs the reminder. Jael’s suit is a tight squeeze for him in the shoulders, but he wedges into it. Vel takes a moment to paint some stripes on it, differentiating him from the Bug we carried in. Clever. It wouldn’t pass muster close up in good light since the colors are clearly painted, not etched in the usual way, but down here, it should do. We pass through the checkpoints easily, just three Bugs returning from a patrol. We’re only stopped at the last one. The guard eyes us. “Everything quiet in there?” “There is one troublemaker making noise,” Vel says. “Otherwise, yes.” “Good. Going off duty?” “Food break.” The guard accepts this without question. “Enjoy. See you later.” Like hell. To my surprise, Vel takes us straight back to the staging area. “One glitch,” he says in an undertone. “I did not mention it earlier, Sirantha, because you were worried enough. But when I was using the workstation, I could not find an exit not linked to the underground. This place is completely secure.” Well, shit. Our ride off world is already in orbit. We have to get to the shuttle within twenty-four hours. If we take the underground back to the city, that’s eight hours gone. Then how do we get back out here? We have no ground transport, and the Ithtorians don’t travel on the surface, because of the hazardous conditions. “They have to get fresh air in here somehow,” March says. It’s a little disconcerting to hear his voice coming out of a Bug head. No wonder he thought he was dreaming when I opened his cell. “That was my first thought as well,” Vel answers. “But according to the schematics, they use fissures too small for humans—or Ithtorians to pass through.” “So what do we do?” Vel seems none too certain, hesitating before he speaks. “My scans are not entirely accurate with so much rock around us, you must understand . . . but they indicate there is an abandoned area in the mines. There may be holes once used for structural supports, which have since been relocated. I cannot determine whether these shafts go all the way to the surface, but they offer the only outlets not connected to the underground.” I shrug. “So let’s go.” He’s not telling us everything, but standing around here will just get us caught. Without further conversation, he leads across the platform and into the mines. The metal sheeting bangs underfoot. As during our last foray, the workers don’t pay us any attention. Some of them operate heavy machinery in the large caverns. Others use hand units to take samples. Starry ore glitters in wheeled tubs. We pass a few other guards, but they don’t speak. They also roam the place in twos and threes, so our number doesn’t attract any attention. Eventually, we come to a rusty old locked door. March and I stand watch while Vel gets it open. On the other side, Vel says, “From here, it does not matter if we speak. There are no miners and no guards over here.” “Do we know what lies ahead?” I ask. “There was no data regarding this area in the archives, but I note a number of large life signs ahead of us. They may be hostile.” “Then I’m taking this off.” March pulls off his Bug head. “I can’t fight this way.” I agree with that, so we take a moment to pull off our suits. Mary, I smell rank. Vel sprinkles them with dry acid chemburner and in short order, they’re reduced to dust. He’s amazing at leaving no trace of where he’s been or what he’s done there. I love that gift now, since he’s no longer using it to hunt me. “You got a shockstick in there for me?” I ask Vel. In answer, he hands me one, and I power it up. We haven’t come this far to be stopped by a few cave beasts. March accepts a shockstick and a knife. He can probably use both at the same time—stun and stab. “This way to the first shaft.” The bounty hunter leads. March falls in behind him, and I bring up the rear. It occurs to me we finally have the time for me to ask some questions. “Vel . . . I’ve been meaning to ask you. This chip you implanted in me, it’s experimental, isn’t it?” The bounty hunter casts a glance over one shoulder. “How did you know?” “Because it governs more than just speech.” I explain how it helped me understand body language as well. “Wait a minute.” March stops walking, his hands curling into fists. “You put something inside her that hasn’t been fully tested?” “Not by any formal authority,” Vel admits. “But my own research indicated I have perfected the prototype.” For a long moment, March stares at him. “If it was anyone else, I’d end you. Don’t screw around with her safety, you understand me?” He touches my throat with care and delicacy. “It’s bad enough you put your mark on her to cover something I did.” “So you realize you hurt her. Then perhaps it is you who should not ‘screw around’ with her safety.” Vel starts walking without waiting for a response. March lunges as if he’s going to start something, and I snag his arm. “We can’t fight down here. You know that, right?” In the distance, I hear something rumbling. It sounds big and angry. “That’s our obstacle. Not each other.” He follows in furious strides, but he’s not angry with Vel or me. The connections I restored also include their share of guilt. The bitter with the sweet, as Hit said. In the darkness, I can hear the monsters gathering. Grunts and muted roars echo through the empty mine shafts. Are they talking about us, trying to figure out what we are? I assume they’ve smelled Ithtorians before. I wonder what they eat down here, if there’s a complex ecosystem underground, driven off the surface by nuclear winter. It stands to reason that there would be. So maybe all the creatures aren’t dangerous. Bearing out this possibility, something flutters past my face, but it doesn’t bite or sting. I shudder, my breath sticking in my throat. The little thing comes back. Flutter, flutter, flutter. I’m afraid to ask Vel to shine the light on me.","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-47.html","bookId":1648,"book":{"id":1648,"title":"Doubleblind (Sirantha Jax #3)","description":"Storyline: Doubleblind (Sirantha Jax #3) It’s not easy to tread lightly wearing steel-toed boots. Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. Which has Jax wondering why a notorious troublemaker like her was given the job.","cover":"https://allnovel.net/images/doubleblind-sirantha-jax-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/doubleblind-sirantha-jax-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
