{"id":99413,"no":6,"title":"Page 6","content":"Ramona: Indeed. The Syndicate offers value to all, regardless of creed, culture, or species.\n Lili: [She looks uncertain and confused.] That’s very . . . egalitarian.\n Ramona: Exactly. I’m quite proud of our organization, but concerned with the dissemination of deliberate misinformation. Too long has the public been misled by the pathetic tidbits let slip by the Farwan regime, and it seems as if the Conglomerate intends to continue that same fascist censorship policy. For instance, consider this proposed alliance with Ithiss-Tor. Has anyone examined the long-term ramifications of having the Ithtorians involved in interstellar affairs? They have a history every bit as violent as the aliens from whom we would ask them to protect us. What if the Ithtorians choose to side with the Morgut? Can we accurately predict their loyalties, based on our knowledge of them? I think not, and it troubles me that humanity decided not to ask its own for aid.\n Lili: What do you mean?\n Ramona: The Syndicate has an extensive fleet, Lili. Our services can be retained for a reasonable fee, which includes private security and military applications. If humanity needs a defender, surely we are the reasonable choice.\n Lili: [She listens for a moment to an unheard voice.] I understand your daughter has been dispatched to Ithiss-Tor to broker this alliance. How do you feel about that?\n Ramona: Naturally, I advised against it, but you know how mothers and daughters can be. She discounts my age-earned wisdom, so I can only tell you that I’m proud of her, regardless of how misguided her decisions may be. I only hope her work there doesn’t cost us.\n Lili: [Her eyes widen.] What are you implying?\n Ramona: I’m sure it’s already on everyone’s minds—what a misstep could mean. [She lowers her voice, conspiratorial.] The Axis Wars.\n Lili: [She looks troubled.] You’ve given us a great deal to think about today, Ramona. Thanks for appearing on Lili Lightman Live, and we appreciate you offering your insights on current events. [She gazes intensely into the vid.] If you have thoughts on the alliance or the Syndicate—or the lovely blue dress Ramona is wearing (design by Care-wear)—you can bounce your thoughts to me at satellite 11.23.044.3340. Thanks for watching, and as always, keep reaching for the stars.\n CHAPTER 6\n On the way to medical, Jael steps out of the lounge, intercepting us. “What’re you two doing back here? I thought you were instructed to stay in your quarters. Are we making a run for it?”\n I give him a sour smile. “None of your business.”\n “Where you’re concerned, everything’s my business, darling.” He props himself up, obviously not intending to let us pass until his curiosity has been satisfied.\n March tenses dangerously, still seething with unspent impulses. The fight with the Ithtorians was broken up too soon for him to feel satisfied. Mary, I hope Jael doesn’t provoke him.\n “It doesn’t impact your assignment,” I tell Jael firmly.\n “I’ll decide that.”\n When March moves to push past him, Jael puts a hand on his shoulder, and that’s the last straw. March lashes out with a blow that would fell anyone else. Jael’s head snaps back, blood spurting from his nose, but an answering light kindles in his eyes. To these two, this is probably like foreplay.\n If I had any sense, I’d run.\n Instead, I skitter back a few paces as they slam into the wall. Jael’s slight build indicates he should be an easy opponent for March, but he’s stronger than he looks. Fists crash into jaws, fingers dig into each other. March lands an elbow in the sternum and follows with a kick that should’ve broken Jael’s kneecap, but the other man leaps aside.\n Jael retaliates with a flurry of blows, almost too fast to track. I wince as they land on March’s chest. The merc is too smart to go for the head. He knows the body is where you do the most damage.\n March doesn’t seem to feel it. He grabs Jael and slams his head into the wall with such force I expect to see his skull shatter. This can’t go on. I tap the comm.\n “Doc, I need you down on deck two, section A-12. Bring a tranq.”\n They grapple, better than a constant exchange of punches. Jael breaks free and slams his head into March’s chest, rocking him back. March replies with a strong right hook. If Jael had a glass jaw, he’d go down right there. The punch had all March’s power behind it. Instead, he takes the hit and slams an elbow into March’s gut. March in turn takes the blow and slams a roundhouse into Jael’s left cheek, and I swear I hear the crunch of bone.\n By the time Doc gets here, they’ve beaten each other bloody. Jael looks like he got the worst of it, but that’s only because of the broken nose. Blood has spattered all over both of them, and they show no sign of calming down.\n Doc assesses the situation in a single glance and tranqs them both. “You’re back sooner than I expected.” Only he could make such a moment conversational. “What brought this on?”\n He’s a short, stocky man with the heavy musculature of those from high-G worlds. I don’t think he was born on Lachion, though he has certainly been adopted into the clans. Doc’s real name is Saul Solaith, and he’s more a geneticist than a practicing physician, but he takes care of the crew nonetheless.\n A few clansmen help transport Jael and March to medical. I follow along behind, feeling sick. March has winked out completely, but Jael is fighting the meds; he’ll shake them off soon.\n “March is having trouble being surrounded by all those Ithtorians,” I explain. “It rouses his ‘fight’ instinct. We came in to have him checked out, and Jael decided he needed to interfere.”\n The merc glances up, groggy and squinting in the bright lights. “I thought he might be dangerous, Jax. What if he’d gone after you instead of me?”\n I ignore that, addressing Doc. “What can you do?”\n “Medicate him.” Doc narrows his gaze on March. “I can synthesize a wide range of behavior-modification drugs, but I’ll need to run some tests to confirm the dosage.”\n “We don’t have to be anywhere before tomorrow,” I add. “Can you do something for him that quickly?”\n A little voice reminds me I could leave him on the ship. Maybe March wouldn’t even care, but I would. I’d feel like I was abandoning him, unwilling to deal with the drawbacks associated with being with him. And yeah, right now it’s hard as hell; I can’t even touch him.\n But I remember what we were like together, and I won’t get that back without some effort. I’ve never been afraid to fight for what I want. Time to prove to him that I won’t walk when the going gets tough.\n Maybe he’ll find that confusing and incomprehensible in his present state. Maybe he won’t even appreciate it until after we fix him, but it’s when, not if. I won’t give up.\n He thought I gave up on us when I was at my weakest, but I’ve only ever wanted to keep from hurting him. March is such a maddening bundle of contradictions, brutal strength wrapped around a vulnerable core. The way he used to need me scared me to death—and now I’m afraid he’ll never need me again.\n I’m just never satisfied, am I?\n Doc has been tapping away at his terminal, trying to answer my question. Finally, he says, “Yes, if I get started right away, I should be able to pin down what he needs.”\n “What about me?” Jael asks, becoming more alert by the second. “Do I get anything recreational while I’m here? I’ve been a good boy.”\n Doc ignores him, but I’m finding it hard. “Could you piss off already? Go clean up. You don’t need to be here.”\n Jael sighs and pushes himself upright. “That’s the thanks I get for saving your ass? He could’ve really hurt you.”\n “You set him off.” But the idea takes root, and I don’t like the accompanying fear. It doesn’t look like it would take much to make March think I’m a threat.\n The merc sighs heavily and staggers toward the door. “I’m warning you, Jax. He’s not stable, and I’m not saying that to be a pain in the ass.”\n After Jael leaves, I watch while Doc hooks March up to various lab gear. “Do you want me to stay?”\n Saul shakes his head. “I’d rather you didn’t.” He pauses in his assessment of various readings. “But I think Jael’s right. March is in trouble.”\n Mary, I hate hearing that from Doc. He wouldn’t exaggerate the problem.\n “Buzz me on the comm if you find anything interesting or unexpected?”\n “Absolutely, Jax. Don’t worry . . . I’ll take good care of him.”\n I slip out, and afterward, I realize I didn’t ask Doc about the implant. Well, I guess that will keep. March was my first priority anyway. If I’m going to thaw him out, I need to keep him nearby so I can work on him in my spare time.\n That sounds terrible, as if he’s some scrap Skimmer I hope to refurbish, when it’s not like that at all. I’d say he’s my reason for living, but that sounds melodramatic even in my own head. So I’ll just say I owe him that.\n My steps turn toward the quarters Dina shares with Hit. They returned to the ship right after the party. Neither of them wants to stay on Ithtorian soil.\n Dina has recovered from the Teras attack better than anyone could have expected; she only moves with a slight limp now. When the door-bot announces me, they, too, seem surprised to see me back so soon.\n Hit greets me with a smile. “Jax.”\n “Did you already frag things up?” Dina cracks, as I step inside.\n I think about that. “Not irrevocably, I hope.”\n They offer me some hot choclaste, slightly bitter just the way I like it. My bones ache a little as I settle into a chair. As I sip, I sum up what’s happened and why we’re back on the ship.\n That sobers Dina immediately. “Damn. I didn’t realize war took such a toll on him. Is Doc going to be able to help him while he . . .” She hesitates. “Works through the nightmares or whatever?”\n I’m sure she knows soldiers can get flashbacks if the combat is intense enough, but she doesn’t know the half of it—how bad it strikes March—and I can’t tell her.\n So I shrug. “I hope so. Otherwise . . .”\n “He can’t take part in the diplomatic process,” Hit supplies. “Not when he’s having trouble restraining violent urges. Sometimes it’s pretty hard to come back to civilian life when all you know how to do is kill.”\n She sounds like she speaks from personal experience. I wonder if she knows anything that could help March. “Can you think of anything I should do—or not do—to help him recover?” Damn, I wish I could be more specific, but I can’t.\n Hit considers for a moment. “No sudden moves, no loud noises if you can avoid it. Sights, sounds, and smells can trigger an event. He may suddenly feel like he’s under attack . . . and it can seem so real.”\n Put that way, I’m amazed March managed to control himself so well out in the square. It wasn’t until they offered the first hostile action that he slipped his leash. He’s stronger than I knew. \n","sourceLink":"https://allnovel.net/doubleblind-sirantha-jax-3/page-6.html","bookId":1648,"book":{"id":1648,"title":"Doubleblind (Sirantha Jax #3)","description":"Storyline: \n Doubleblind (Sirantha Jax #3) \n It’s not easy to tread lightly wearing steel-toed boots. \n Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. \n And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. \n But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. \n Which has Jax wondering why a notorious troublemaker like her was given the job.\n \n","cover":"https://allnovel.net/images/doubleblind-sirantha-jax-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/doubleblind-sirantha-jax-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
