{"id":27094,"no":18,"title":"Havasupai Days","content":"I Lanso is a hedonist of seven. Day dawns late down in Cataract Canyon, but even spring nights in Arizona are chill, and one’s own soft-woven bedding, cedar-bark mat and rabbit-skin blanket, suffuse a warmth one would not willingly forego. But,—“Lanso,” whispers grandfather Sinyella, “up and run toward the daylight. Run, that you grow straight and lusty. And heed me; take your torch and touch it to your elbows and your wrists that you may never be rheumatic as I, your relative. Oh yes, and as you turn back, fling the torch behind you, turn once again and snatch it up, that your memory may be strong too, that you may remember quickly a forgotten deer charm when you go to hunt.” Lanso leaves his creekside home, worms his way among the slender cotton-woods, and emerging on the race course, drops into a dogged trot through the deep sand. The race course—but that is a place for a mad, scrambling dash; perched with brothers, and sisters too, on the bare back of father’s horse. What need to run afoot: foot races come at dance time, and that will have to wait until the harvest is in. Dance time—Lanso hums the songs. “Yes, I know them all; next time I, too, will dance....” It is lighter when Lanso turns back: all the Havasupai are astir. Acrid smoke begins to drift over the willow thickets; ethereal strata that rest in the still air against the towering rock walls; walls that stretch to the winter home high on the plateau above. There in the clearing is his home; the willow-thatched dome for rainy days, the branch-covered, dirt-roofed, box-like shade for refuge from the midday sun, and Hat’s sand-drifted hut merging in the swell of the creek bank. Lanso scents breakfast in the bubbling clay pot, the inexhaustible pot that stands day-long with open-mouthed hospitality extended to all comers. But even a cold-whetted appetite will not tempt him to a sidelong foray on the mess; no, there was bravery needed for the 180 sharp reproach and unbearable ridicule meted out to unmannerly pilferers. Better to wait until Round-one, Hat’s wife, should call the family, Lanso, her nephew, not last among them, to the stew of ground corn and big-horn meat, little loaves of corn meal tied in the husks and baked in the embers, sweet mescal juice, and salt from the cave far down the canyon. Then he would creep up to the elders grouped on the ground around the pots and baskets, and from the side of Fox, his favorite uncle, beg for tasty bits fished out with sharpened twigs, and to take his turn at the brimming, horn ladles. “Now,” said old Sinyella, “the brush is burned and our fields are cleared: to-day we will plant.” So, off the whole family trooped; men and children on horses, the women, their babies strapped to the cradle board in their arms, trudging along beside them. Lanso, clutching hard at his grandfather’s back, rocked to the easy canter of their horse. Here was business afoot he understood: next to the victims that fell before his arrows—very small creatures, indeed—this would be his chief contribution to the family larder. Yesterday he had watched them playing shinney, gambling for the future crops, and he had guessed they would begin to-day. Down through the broad fields they rode, noting here the dam that spread a somewhat broken wing to scoop the creek to the level of the fields, there an irrigation ditch that needed mending, until they reached the family fields. These were Sinyella’s and had been Sinyella’s father’s and grandfather’s, and one day would go to Lanso. Turning out the horses to graze at the foot of the rocky slope, they climbed to the storage houses set high above the reach of devastating floods, plastered like swallows’ nests in a crevice at the base of the cliff. The seed corn secured, Sinyella knelt in the field and scratched a hole with his pointed digging-stick. Then he prayed, “Grow good, corn; when your stalk grows, grow tall; grow like the ancient corn up there,” and dropping some kernels in the hole, he chewed another and blew it toward the “corn,” two white rocks high on the canyon wall. Then two short steps forward and he knelt to dig again. Lanso watched, and then followed; first a few kernels, a deft sweep to fill the hole, and then the next hill. Row after row they planted together under the white morning sun that rose to flood the canyon with its light and heat.... 181 Back in the deep shade of the huge cotton-wood he saw his grandfather playing with his little brother—a toddling fellow not yet worthy of a name. Now he was searching for his mislaid arrows for he heard a twittering from a nearby bush. “Yes,” Sinyella teased the baby, “that bird is calling to you, ‘You are not a boy; you have no arrow to kill me; you are a girl.’” Grandfather knew everything: he made fine bows and arrows, and he told long stories in the winter evenings. “Next winter,” Lanso thought, “I will track rabbits in the snow when it lies in the cedar glades where our other home is; now I must hunt down here....” The bushes spawned boys, Lanso among them. There were birds to be shot, dogs to be worried, deadfalls to be looked to, horses to be watered, sprawled over, and raced. They all ran down the canyon to Coyote’s, where there was that curious Navaho visitor to watch. Mornings are short when there are cliffs to scale, tanning to watch, flat cactus to roll for arrow-marks, food to beg from some friend—and relatives lived everywhere; Wooden-leg to listen to as he told of his trip to the Walapai people to fetch a bride, mock ambushes in the willows, and the creek, with its cooling embrace as it closes overhead.... II Panamida drove his horses down the creek bank in a cloud of dust. Standing belly deep, they sluiced the cool water through their outstretched throats. Panamida let it swirl around his dangling ankles; here was relief from the afternoon heat. Bending low he could look up-stream beneath the vaulting willows where the women were filling their water-baskets. “Fox,” one called to him. “Fox,” indeed! Who was this who did not know that they had begun to call him Panamida since his marriage. Couldn’t she see that these three were Left-hand’s horses: Left-hand, to whom he had given a big blanket, a black Hopi shirt, and much dried meat, all for Gathawinga when he had first gone to live at her father’s and work for him. “When I have a son, I will build my own house on my family fields; Sinyella will give me a place,” he thought. He knew he was to have a son: only yesterday Hat’s girl had made a string-figure that resembled a boy. Shrill laughter came from the dance-ground beyond the screening 182 thicket: the women were playing hiding games and tossing dice over there. He laughed abruptly; Swollen-wrist’s voice came bellowing the song, “My tally sticks; I want them to come back; I am nearly dead.” “That fellow never does win the stakes,” thought Panamida. “Well, those women should cook now for the dance to-night: later I will join them for the racing.” Panamida turned the horses out and sauntered down the creek side to Two-wives’ sweat lodge, where a dozen breechclouted men were lounging about in the sand. One could usually find them here, gossiping through the midday heat. While they waited a turn to enter, old Corn-thief droned recollections of his youth: “... We found a flock of mountain sheep, with several rams among them. I shot a very big one, the others all ran off. The wounded ram jumped down the cliff, and ran along a very narrow ledge. I and Hat’s father slid down from rock to rock, and followed him along that ledge until he stopped abruptly at its end. Suddenly he turned and dashed back at us, his head held down sideways. I flattened myself against the wall, Hat’s father beside me; there was hardly room. The ram struck Hat’s father, throwing him off the ledge: it is very high there. The ram stood quite still; those above me shot at him; when he was hit, he too tumbled headlong. Next day we tramped down the trail and found the body in the canyon. We carried it away, and dug a hole to bury it; we didn’t have time to burn it....” Panamida tried to recall Hat’s father’s name: no one said it now that he was dead. Some one carried freshly heated stones into the little dome-shaped lodge. Panamida followed the next three to enter; there should be four at each of their four “sweats.” He crouched down close to them on the carpet of leaves. It was blinding dark inside the tightly blanketed lodge. It was hot; whatever he touched burned. Sweat began to pour into his eyes and down his back. His hair felt dry and burning at the roots; each breath was a gulp of liquid fire that seared his nostril-edges and his throat. It was intensely still. Suddenly his neighbor commenced a song; he joined; that was better. Now there was a sharp hiss as the leader threw a handful of water on the 183 rocks: he gasped, the steam was choking and the heat suddenly unbearable. He bowed his head close to the ground between his feet to suck in the cooler air there; then he raised himself slowly. Sweat still streamed from him; every muscle was relaxed; every ache was gone; he felt pure and renewed. Struggling out beneath the door flap, he stood up in the sunlight, poised on the creek bank, and plunged into the stream. He gasped; his breath was sharply driven out; but his skin tingled, his muscles quivered, he felt exhilarated. Many races had been run when Panamida reached the dance-ground. He would not ride, though he had sung over his colt to make him fleet. Fragment-of-rock, his youngest brother, should ride, and he would bet. He would be chief when his father died: he must be dignified now. He sat beside Gathawinga and her mother, She-chews-men, who were weaving baskets. “The Navaho have come,” he whispered to Gathawinga, “I have given one a basket of shelled corn for his big blanket for you: I have his horse too, for two big buckskins and a little corn.” He went toward the visitors: “Well, you have only one knot in your string now; to-night we dance. Ten sleeps ago when you went to tell your chief to share our harvest bounty there were eleven. It is nearly sundown; the dance-boss has spread the meat and bread on a bed of willow leaves; guests must eat everything.” He drew back with his relatives that the Navaho and Hopi might eat first. Though they had not brought their women, these strangers could be trusted here, especially the Hopi, who lived so well and knew all manner of strange things, yet it was laughable to see them trotting by afoot when a man should ride. But the enemy, those Yavapai; Panamida knew them too. He recalled the previous autumn when the owls were warning, “Some one comes from the south: hoo hu.” And they had come climbing down into the canyon in the early dawn. He recalled the alarm; the women and children scrambling up to hide on the cliffs; the day-long pursuit up the canyon, the skirmish, and the enemy fleeing again. Then the Yavapai, tiring, had taken refuge on a little hill. “Good,” Chief Manakadja had said. “We are hungry now: some of you ride back and fetch us food.” After they had eaten they felt braver. Two took thick buckskins, which they hung from their bows before them. Panamida, crouching with arrow set, had followed184 in this shelter with the others. Boldly they marched up the hill, Yavapai arrows raining harmlessly on the flapping skins. Suddenly the carriers dipped their shields and the hidden archers let fly. They had nearly reached the summit, when Wasakwivama, who held a skin, was hit. “My arm is getting weak; I can’t hold it up much longer; we had better go back.” A second time they tried: the Yavapai arrows were exhausted, they were rolling rocks. Panamida chuckled at the recollection of his foolhardy spring, the sudden jerk that sent an unwary enemy sprawling down the slope to be pounced on and dispatched. Well, another feat like that and they might call him a chief even before his father died. The Yavapai had fled in the night, but they would return. “Yes,” he ruefully reflected, “they like to come; they always kill so many....” Moonlight spread across the clearing as they danced: the eastern cliffs stood sharply black against the sky. The song ended, and the group around the pole melted away. Sinyella rose in his place among the watching families. “My own land, hear me. Let all of us remain alive always. I want to live well always. Ground, hear me.” He prayed to the rocks, the ground, the creek: he told the young men to work hard, to dance well, not to be quarrelsome, as chiefs always spoke in the lull between the dances. Paiya, the best singer, again took up his place, facing the pole; Panamida, with the drum, stepped beside him; quickly others formed the circle with them. Shoulder to shoulder they stood; fingers intertwined. Paiya began to sing to the drum beats: “A fresh wind in that country, Girls dance circling.” He had dreamed that he had gone to that far land where he had seen them dancing. The others caught up the refrain: they stood singing for some minutes. Then when they sang in unison Paiya signaled and all began circling to the left with a short, sidewise shuffling step. Slowly the circle swung, fifty men in their gala dress, girls with their jingling ornaments; over and over they sang the song, to bring it to an end when the leader reached his starting point. They stood hardly a minute: none dropped out. “Nidjanwi,” several prompted; so Paiya began the favorite: 185 “Nidjanwi, I do it; I am the man who names himself; Maidens stand alongside.” Soon all were chanting, and the circle moved again. Excitement was high; the old people called out encouraging compliments; girls shouldered their way beside partners of their choice; reluctant Navaho were laughingly forced into the throng. Panamida felt some one pushing against his thigh; there was little Lanso, his older brother’s boy: “Yes, come in,” as he made space. Another song, and they stopped to rest. Navaho paid a trifle to their partners for release. Now a grotesque figure dashed from the obscurity of the night; white mask, cross-barred body, yucca leaf switches in hand, he sprang about, whipping the laggards to the dance; adults were laughing, children scampering in fright, dogs barking. The dance commenced again. Panamida was hoarse, it was far from dawn, and this was only the first of three nights’ dance. III Sinyella is half a skeptic. He sat back in the lodge and watched Sack, the medicine man, in the firelight beside his sister’s sick grandson. Let the other relatives shout to make the shaman strong: he would wait, if the boy died, he would kill the incompetent. The shaman knelt over the boy, swaying as he sang, his head to one side, his left knuckles clenched over his closed eyes, his clashing rattle in the other hand. Once he stopped rigid with open mouth, so that his familiar spirit might leave his chest to search for sickening ghosts outside the house. Then he rose and went out into the dark. Sinyella heard his spirit halloing and whistling as it returned to him out there. The shaman re?ntered and resumed his singing. He put his lips to the boy’s forehead that the spirit might go in search of the sickness. He sucked the spirit back with a gulp, spat into his palm, and triumphantly exhibited its contents, some little white thread-like worms. “That was hard for me, but I have taken out all the sickness; there is no more there now.” Well, the boy’s father would give Sack a big blanket, but Sinyella decided that he, at any rate, would wait. 186 Musing as he waded through the crusted snow to his own lodge set snugly in the cedar thickets, he thought: Sack is young, he may not be much good, perhaps his spirit is weak. But I don’t know much about these things: there’s that star up there, Pagioga, the man-snatcher, and sometimes there are ghosts. I pray too: “Sun, my relative,” I say, “do something for me. You make me work so I can do anything: make good things for us: keep me always as I am now.” ... Of late his ears had been frequently ringing; ghosts were whispering to him. Suddenly he shouted, “Huuuu; no, though you talk that way, I am not going to die.” It was well that they had collected a good store of pine nuts and wild seeds in the autumn after they left the canyon; the snow was thigh deep this winter. It was bitter cold; men and birds would freeze; the firewood on the ground was covered. But deep snow soon exhausted hunted deer and antelope, and there would be no lack of drinking water here on the plateau. The laden trees brought back to him that long past day when his father found the Navaho woman lost in the snow and took her to wife. He remembered other Navaho; those he had fought, those whose horses he had carried off, those who had despoiled him on a trading trip to the Hopi. There had been many a trip eastward to the Hopi villages, where the Navaho, quondam enemies, came to trade too. Presents exchanged, friendships renewed in night-long talks, buckskins and horn ladles traded for blankets, he would turn his packed horses back for the fortnight’s journey across the arid wastes toward his canyon home. There he would wait the coming of the Walapai, his blood brothers, from the west. Or, if they did not come, he would carry the Hopi woven stuffs to trade in their country. Once he had even penetrated beyond their range to the Mohave in the low land of the Colorado River, where, astounded at his effrontery, they had permitted him to stay and peaceably trade. In all countries they knew him well: that was why people called him chief. He made himself a chief. True, his grandfather had been chief, like his fathers before him. But his own father was never chief; no one would call him that; he was a good-for-nothing. Now when I die, he thought, my two oldest sons will share it, as they will my fields. I have taught them both to talk like chiefs. As, stooping, he lifted the door flap of his dome-shaped house 187 he sensed to the full the flood of warmth and light. This was his own, these his people, and it was always good to be at home. The group reclining about the central fire broke off their cheerful chatter to greet him: back under the dark eaves he could hear the children, nominally asleep, giggling over some fine mischief. “The Walapai have come to ask our young men to join them next spring in a raid on the Paiute across the Grand Canyon; Panamida wants to go,” they told him. “Panamida will fight them soon enough, let him but stay at home.” “Panamida, younger brother, some nice Walapai girl will say to you, ‘Here’s a roasted lizard,’” said Grediva, mocking the gruff Walapai speech, amid the laughter of her relatives at the thought of eating lizard. Sinyella smiled drowsily at the firelit faces: yes, all his own people. At his side he heard Lanso, “Grandfather, tell us just one story. Don’t refuse this time; the snakes will not bother now, it is winter.” Sinyella sat back where the children were listening, lying in the darkness. “Wolf and Coyote lived far to the west close to the ocean. Wolf said to Coyote, ‘This country holds no game, no deer, no antelope. All we eat is rats; that’s all we kill; that’s the only meat we have. I think I want you to go right down in the water, way down to the bottom of the ocean.’ Many elk lived under the water. Coyote tried: he went close to the water and put his head down, but he felt afraid. ‘I’m afraid to go down: I want you to go.’ Wolf said, ‘All right, I will go down and hunt. I will hunt a big elk and drive it right out. I will come out again after four sleeps.’”... Leslie Spier \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3319/90897.html","bookId":397,"book":{"id":397,"title":"American Indian life","description":"简介： She always says she will come, and sometimes she comes and sometimes she doesnt come. I was so surprised when I first came out here to find that Indians were like that, the wife of the Presbyterian Missionary in an Indian town in New Mexico was speak...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3319","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
