{"id":27097,"no":21,"title":"The Understudy of Tezcatlipoca","content":"This story[16] is a mirage of thin words and bodiless phrases. It paints on a film of mist things that are long ago and far away, and lifts up a pale reflection of cities and grandeurs lying below the horizon of our times, never to be resurrected in fact. It presents in a vaguely understandable fashion, strange beliefs and philosophies that a wonderful society of human beings created out of their common thought and supposed necessities. Have you ever tried really to understand the Past, not so much the material Past of quaint costumes and accoutrements, as the immaterial Past of ideals, ambitions, and enthusiasms? Have you ever wilfully imprisoned your present spiritual being in the emotional matrix of an age that is dead? In the hall where the glum old faces of your ancestors stare out from dull frames upon your unimagined new life, have you ever paused to gaze back into those dim presentments, and to think how impossible to-day would be the quest of the Pilgrims, or of the Crusaders? And when, not so long ago, a Gothic fantasy in gently treated stone crumbled before the war-saddened eyes of the world, did this fearful thought impress itself upon you: No man in all Christendom can ever re-carve those shattered prophets or re-groin those airy arches in the dread sincerity of the first builders? Now, it is not the stone that changes, nor the chisel, nor the loves and hates of individual men and women: it is the over-soul of society that passes. For, out of our herded life of tribe or nation, comes an over-soul that directs our hands and implants in our minds the seeds of duty, the impulses of sincerity, and the recognition of all the needs which we think are absolute, but which, in a larger view, are merely relative. The cloud forms of communal emotion that constitute these over-souls, flame and fade like the western sky and never twice assume the same shapes and colors. In Mexico, before the steel-clad soldiers of Cortes landed at Vera Cruz, there was a civilization that ran back into a twilight of the 238 gods. Centuries of accumulating art and ceremony had enriched the first crude thoughts of savages coming out of desert camps to abide in houses of mud and stone, amid maize stalks and squash vines. Cities and indeed, empires, had risen, flourished and fallen. There had come into being those slaves to the ideal of ritual whom we call priests, and those slaves to the ideal of political grandeur whom we call kings. And back of all these were gods to whom sacrifices were duly given for benefits received. And the people, commanded by their over-soul, raised gleaming temples on stately pyramids for their gods, and built palaces with bright gardens for their priest and kings. And, moreover, they gave honors and rewards for success in trade and war and they set the marks of class upon certain men and their children. This is a story of their sincerity.... That wise old man, bent from much climbing of temple stairs, but with the steady, believing gaze which comes from watching the stars, foretold the distant event with deceptive clarity. He was reader of the fates and keeper of the calendar in Quauhnahuac, and after grave study of his painted books he resolved the tangled interests of greater and lesser gods in the new-born child. So he said to the father and the friends who crowded round: “Let him be called Macuilquaultli, Five-eagle, after the day on which he was born, and let him be well taught in all that a chief should know. He shall acquire grace, skill, and a knowledge of all arts, for he shall come to rule in a high place. Thus it is written: he shall govern the City.” The father of Five-eagle was a Captain among the armed men of Quauhnahuac, a bearer of standards, and a councilor in matters of state. He proudly bore the insignia of high success in war against the strange-tongued people of Tolucca. Yet, Quauhnahuac was not a city of warriors. The populous capital of the Tlahuica (as you may know from that Cuernavaca of sunlight and indolence which survives) lay deep below the mist houses of Ajusco, in a valley where waters dance and flowers flame. To be sure this people had come out from the Seven Caves with the Azteca and other tribes, but they had passed down from the cold highlands and had prospered under the benign protection of Xochivuetzalli, goddess of239 flowers, and patroness of all the arts that give beauty to the world and take vigor from it. Five-eagle, at the age of eight, left the shaded portico of his father’s courtyard, where the fountain bubbled in a gleaming pool and where imprisoned birds sang, to study and sleep in one of the Great Houses with other youths. He was a slender boy with a pleasing and thoughtful face. Under the instruction of the old warriors he acquired only a careless skill in the hurling of lances, and took little pride when he won his set in the battering contests with wooden swords and shields of cane. Rather he preferred to beat out the thundering war songs of his people on the two-lipped drums. In this he became proficient beyond all others, and in his hands the rubber-tipped drumsticks set up wild, nerve-racking rhythms that soon had young men and old whirling in a mad dance and chanting a song of the old nomadic days. Or, hidden among the trees he would play lonesome melodies on flutes of clay. He knew the narrow hunting trails that led across the hills to the haunts of deer and wild turkey. He knew the great lava flow that stretched, in twisted and forbidding ridges, along the sides of the high mountain which separated Quauhnahuac from the Valley of the Five Lakes. He had climbed the pinnacles of black desolation on this lava desert and descended into its caverns of whirring bats. Often in the shade of a market shrine Five-eagle would encounter the aged priest of the calendar who had laid the gorgeous prophecy upon him. This wise old man knew there was no end of knowledge, for he squatted with his books unfolded on the ground before him, and diligently made other books. But always he laid aside his brushes and his sheets of lime-sized paper when the youth drew near. First he would explain what calculation was being written down, and then expanding to the breadth of his subject, he would tell his young disciple how time ran in wheels of days and years and ages, and how the cycles of the Morning Star fell now for good and now for evil fortune, and how the gods ruled the hours in turn. He taught the boy to calculate in high numbers, to make hieroglyphs and read history, and to draw with a sure skill the faces and distinguishing marks of all the gods. And sometimes, at the dead of night, he took the youth with him 240 to the top of the high pyramid and before the very door of the temple itself. Below them lay the sleeping city amid soft rustlings of the wind and sweet smells of hidden flowers. The ravines were in deep shadow except where a thread of water gleamed faintly. The palm-thatched huts of the common people were huddled in the folds of the valley, with here and there a chieftain’s house built round a little court. The barracks and public buildings were placed on the four sides of larger squares, and in the dark of night their plaster walls showed ghostly white. In the market places still glowed the coals of dying fires, about which were massed the muffled figures of men who had brought their packs to market from afar. It was a solemn hour when mysteries crowd in upon the soul, and a still more solemn station. With heads together, speaking now and then in hushed and reverential voices, they studied the multitudinous stars as these swung grandly around the pole in a march of majesty across the eternal depths of heaven. And they kept their vigil until the great white Star of Morning hung like a splendid jewel above the calm snows of Ixtaccihuatl, the White Woman. Then the blue of the East turned to pearl and rose; new smoke streamed upwards through roofs of heavy thatch; the city stirred and the markets filled with sellers and buyers; the yellow Sun had given another day. Once Five-eagle and the old priests journeyed together to the ruined site of Xochicalco, where one fair temple was still used in religious services. But the walls of a hundred more lay in shapeless heaps of fallen stone. In front and on either side, the terraced hill dropped off to great depths, but behind it rose another hill to a commanding height with a stronghold on its crest. The priest related fragments of history of this all-but-forgotten capital, shards of myths with names of kings and empty dates to signify resounding triumphs. Then he spoke sadly: “The glories of the great pass like the smoke of Popocatepetl, leaving the skies serene.” “But Tenochtitlan,” broke in the youth, “tell me about that famous city, for surely you have been there and seen its wonders. Once from the top of Ajusco I looked down, far down, across the lava, and I saw the five lakes like five mists in the valley, and there was Tenochtitlan shining like a jewel. And I saw the roads that lead out from the land like a spider’s web.” “Tenochtitlan: yes, I have seen it, and its gardens and temples 241 are rich and beautiful. Its priests and warrior chiefs have much jade and green feathers of the quetzal. Yet Tenochtitlan is youngest of all the cities of Anahuac. Many ages older are Chaleo, Colhuacan, Atzcapotzalco,—and Tezcoco, too, where ruled the loved singer. They say that Tenochtitlan was nought but a rock amid the reeds of the great lake when the Azteca came in bondage and distress. But these sought favor of Tacuba to fish and build floating gardens. Then came Acamapichtli and his sons, so that the fishermen went forth to fight, and their god Huitzilopochtli gave them victory. And now the ancient cities have fallen, save only Tezcoco, in all the valley. Those Azteca of Tenochtitlan go now to Colima and Tuxpan for tribute and captives, and even past Cholula to the lands of the Zapoteca. Their traders first go forth with shining goods to spy out the way; then their warriors fall like the lightning flash. Only the wild Tarasca have turned them back, and those of Tlaxcala, fighting behind stone walls.” So the priest of the calendar told the long history of Mexico, and he described the great feasts that fell, one each twenty days, till the year was done. He discussed the signs and powers of the various gods who thirsted for the blood of human sacrifices and hungered for hearts that were freely given. “But they say,” said Five-eagle, “that in ancient times we gave only flowers to our Xochiquetzalli. Now we must offer children to her or she will be displeased.” “They,” replied the priest softly, “are the most precious flowers! And to her who gives should be returned gifts as precious. Yet, I think pride of place enters sometimes into sacrifices, and that there is human boasting where the altars are piled too high. If only the Cause of All, to whom even the gods are quarreling children, would speak the last truth, so that man might understand! But if Tlaloc calls for a sprinkling of blood before he will give us showers of rain, then it is indeed just that he should have his blood. Without rain the world would die. Yet Huitzilopochtli, under whose standard fight those of Tenochtitlan, is a god of war alone. He can promise only plunder. He is a little god suddenly grown to commanding stature, so that all the cities pay tribute to his children. But Tezcatlipoca is the great one of all the land; he is the Magician to whom nothing is hidden—may he remember us only in gentle mood!” 242 There stands to this day in Cuernavaca a graven bowlder bearing a shield, a sheaf of arrows and a record in hieroglyphs of the fatal hour when the painted warriors of Tenochtitlan swept down upon Quauhnahuac. Then the City of Flowers withered before a rain of flint and a wind of flame. And among the men and women carried away as slaves or more honorable sacrifice was Five-eagle. This young man had disclosed, in the stress of that sudden attack, the qualities of true leadership. Out of the confusion he had emerged at the head of his people, leading them vainly against the foe. Yet he was captured at last and taken to Tenochtitlan without degradation, wearing still his ear-plugs of jade, sandals, and the embroidered mantle of his rank. And then the prophecy of his birth was justified. For, because of his beauty, his daring and his arts of music and song, Five-eagle was raised to wealth, honor and the power of kings. He was made that other Tezcatlipoca to live among men and enjoy life and be granted every wish while the year turned slowly round to the feast of Toxcatl. His laughter meant good fortune to all the land, and his momentary sorrow spelled calamity. But at the end, replete with every honor, accomplished in every grace, surfeited with every joy, he must go freely under the black knife of glass. And the offer of his youth must be made so that the youth of Tezcatlipoca should be eternal, so that his powers should not wither with the creeping infirmities of time, so that his mysteries should still give forth life and happiness to the sad tribes of men. What wonderful beings are the gods that men have imagined out of hopes and fears in the twilight of faith! They are creatures of beauty and terror, shaped from stars and storm winds and green waters and from the subtle and powerful beasts. Or they rise still higher to the very form and mind of their creator, man. They loom forever majestic, immortalized by the sincerities of human sacrifice, by prayers and incense and devoted lives, by ceremony and all its pictured train of magnificence and centered power, by temples and songs and statues that artists, in the grip of common thought, yield up and create. They are the over-souls of nations made visible from afar. But to their makers they are the blinding light of a great presence. And what more gallant god ever bestrode the heavens than Tezcatlipoca 243 of the Mexicans? He was a Lord of Magic, inscrutable, pitiless, magnificent. He combined the wisdom of white hair and wrinkled cheeks with the reckless joy of never-passing youth. He was swift and cunning and unconquerable, making and breaking fates, snaring his brother gods in wizard traps. He was not alone the Smoking Mirror in which the world lay reflected, he was the Sun that looked down into the hearts of men, he was the prowling Jaguar, he was the night wind stealing across land and sea. Yet in his proper guise he was Youth with all its wiles and enchantments: Youth that was graceful, debonair, beguiling as music, subtle as the perfume of flowers,—but cruel, swift and terrible as the lightning bolt. The greatest feast of the Mexican year was the feast of Toxcatl, made in honor of Tezcatlipoca. It fell in the springtime when thirsty fields called for rain. Scarcely had one young warrior, chosen from the clean-limbed and accomplished prisoners of a sacred war, been sacrificed on the last day of his fictitious glory than another stepped into the empty r?le. And, as had been said, it was the fate of Five-eagle, after his arrival at the Aztecan capital, to be chosen as a fit candidate for this dramatic death. With a true knowledge of the symbolism and significance of the ceremony in the emotional fabric that then was Mexico, he assumed the part proudly, and made ready his mind to play out the drama to the end, with minute regard for all the details and effects. A retinue of pages, the sons of chiefs and great merchants of Tenochtitlan, accompanied him in his daily wanderings about the city. These were six in number. They were dressed in fine liveries and it was their duty to see that their master, whom they addressed as Tezcatlipoca, did not fall into sad thoughts. A sacred college of girls embroidered new garments for Five-eagle and each day braided fresh garlands of fragrant blossoms to hang about his neck. Later, from this house of virgins, it was fated that four maidens should be chosen to act as his brides, during the last month of his earthly life, the month of Toxcatl, crowded with gayeties and tears. So Five-eagle, as the Youth of Toxcatl, walked through the public squares of Tenochtitlan and over the many bridges that spanned its canals, and on the great wall that held back the storm winds of 244 the lake. Clothed in the bright habiliments of divinity, with a laughing retinue, he played upon his flutes and chanted songs and danced. And no one in all the city remembered to have seen an understudy of the great God of Magic in other years so skilled in all the graces or so well taught to tread the brief stage of vanity and pride. Five-eagle, a captive from the enslaved city of Quauhnahuac, where Xochiquetzalli had been worshiped in happier times, ruled great and small in Tenochtitlan. He chanted many songs that the people loved, but none that was so great a favorite as a splendid lament of fallen soldiers, a requiem of the young men who died in the sacred service of arms. All Mexico knew this song composed by a famous ruler of the Toltec cities whose name was a smile and a benediction after the passing of many years. Words like the saddest, drooping flowers I seek I, the Singer, weaving my tears in song, For Youths, alas!—broken as spears are broken! And the women weep in darkened corners But the men lift up their heads in pride. A valiant song it was, full of high courage and the will that conquers death. Upon such songs as this, planted deep in human hearts, rest the brave deeds of nations. So Five-eagle passed through Tenochtitlan with his pages by his side, in the white mantle of Tezcatlipoca, with a garland of fragrant blossoms about his neck. His chanted verses charmed the market and the court to silence and tears, but when the song was done there was sudden laughter, and he was pelted with flowers by a gay throng. And he was invited to enter the houses and to eat of the choicest fruits, and to rest under canopies of those rare trees with crowns of cardinal, that now we call poinsettia. Among the girls who did service in the temple of Tezcatlipoca, according to the law of consecration that none might escape, there was one who had come to look upon Five-eagle as more than a man, perhaps,—but less than a god. Once, as she had thrown across his shoulder a wreath of her own weaving, he had looked at her with unclouded eyes and a faint, steady smile. And she had turned away, thrilled and chilled with awakened interest in life and sudden visions 245 of death. In the days that followed she wove other wreaths and awaited his coming at a certain place. And though she greeted the Youth of Toxcatl with a smile, she turned away in tears. A kindly priest saw and understood. He knew that women were used to weep and moan for all the fine burst of glory that death might bring to the stilled flesh. Women, in the thoughts of Aztecan poets and philosophers, were flowers blooming near the ground. They were crushed beneath the feet of Huitzilopochtli leading his men to war. They could not be trusted for supreme sacrifices, and must be caught by surprise and trapped in the midst of revelry. By the water gate against Tlaltelolco, when night was falling and mists were stretching filmy hands across the lake, the priest spoke to the girl of Tenochtitlan, “My child, are you envious of the gift that must be given cheerfully to a god who knows all thoughts? Do you dare love the consecrated sacrifice of Toxcatl?” “Then why do those of the upper skies put seeds of love in our hearts to grow and bloom when it is spring?” “That sometimes we may climb, my child, to heights where only the mind rules. The Youth of Toxcatl is a captive of Quauhnahuac. He fought bravely; he will die bravely that the city and all Mexico may prosper. Should he falter, he will live as a vile slave unworthy of a bright death; he will live as a vile slave condemned to life—beneath the whip. Daughters of Tenochtitlan may not mate with slaves.” She stood rigidly by the wall as the priest spoke, a mutinous and tragic figure, with yellow flowers in her hair. On the towers of the water gate the torches were being lighted so that belated fishing boats might find their way into the city. The stars were beginning to twinkle faintly. “But twenty days remain for that gallant boy,” said the priest softly, “for to-morrow is the feast of Huey Tozoztli, the great Humility, and then begins the month of Toxcatl, of such gladness and sorrow. Twenty days mean much when there is new love to be gathered and enjoyed. There are four who shall be his brides, impersonating in name and dress those four gracious beings of the ninth heaven to whom the love of Tezcatlicopa is given. If you might be the first of these, would your mind be content and filled with happy246 thoughts? Would you teach your will to strengthen his and not let your soft tears plunge him in worse than death, you to despair and the land to disaster?” A new light shone in the eyes of the girl. “See how I shall laugh to the last,” she said, “and be happy in the noon of love and in him who is noble.” So among the gifts that came vicariously to Five-eagle, as the impersonator of Tezcatlipoca, there was a humble gift of love for him alone. But this is a tale of the stupendous lights and shadows that pass, not of those little ones of love and hate, forever found in human hearts. When the sun rose after the feast of Huey Tozoztli, Five-eagle was installed in a royal house with many rooms and a wide court. Then the dancing that began with the sun ended with the paling stars. They dressed the hair of Five-eagle as if he were a leader in the army and they put new jewels upon him. When he went out into the streets of the city, the people knelt as he passed and bowed their heads and prayed. But in the temple many things were prepared behind the veil. On the tenth day before the feasts of Toxcatl a priest in the common livery of the God of Magic stepped out into the marketplace and, while the multitude of buyers and sellers stood in silent awe, he played a summons on his clay flute. The shrill notes were directed first to the east and then to the north and west and south, so that the universe might be aware. When the signal notes had died away, every one bent forward and, having taken a bit of earth upon a finger tip placed it in the mouth as a sign of humility and abnegation. Then they wept strongly and threw themselves upon the ground, invoking the darkness of nights, the invisible winds, and other unknowable manifestations through which the great god spoke, imploring that men upon the earth be not forgotten, nor overwhelmed with labors, nor left in misery and despair. And because the God of Magic could look into secret deeds and thoughts, the thieves and murderers and those whose deeds had been secret and sinful were struck with great fear and sadness, and their faces altered with fright so that men knew their guilt. With tears they pleaded for clemency to an intangible, invisible presence, while incense carried their prayers upward. And the strong men of war bowed themselves in great agonies and begged for strength against 247 all enemies, that they might return from their forays with many captives. So the shrill notes of the flute opened the floodgates of fear throughout the great city and there were tremblings and tears. In the still air, threads of smoke rose upward; now they were white from fragrant copal, now black from evil-smelling rubber. On the fifth day before the feast of Toxcatl, the high priest of Mexico that in those days was Tizoc, locked himself in an inner room of his palace while his courtiers bowed low and acknowledged Five-eagle as lord. A day of submission was granted to each quarter of the city, and with pomp and pageants the temporary powers of an empire were conferred upon the impersonator of Tezcatlipoca. And the grandeurs crowded into these days kept sorrow from the eyes of a love which could see too clearly. Before dawn of the last day, the priests went into the temple and removed the old garments from the stone image of Tezcatlicopa and refurbished it with new clothes, and adorned it, moreover, with feather ornaments and bangles and spread over it a bright canopy. Then they drew back the curtains of the temple so that the world might see the hard and splendid image. As this was done, a high priest came out with flowers in his hand, and played again a summons addressed to the east and the north and the west and the south. When the multitude had gathered in the principal court of the city, before the temple enclosure with its serpent walls, a procession formed behind Five-eagle and the stone image of the god and two priests who carried ladles of incense. Five-eagle was seated on a gorgeous litter carried high on the shoulders of men. Behind him rode the high priests of the cults of magic with their bodies painted black and their hair tied at the nape with white ribbons. Then a throng of youths and maidens, comprising those specially dedicated to a year’s service in the temple of Tezcatlipoca, rushed forth with a rope of surprising whiteness in their hands, encircling with it the line of gorgeous litters. This rope was made up of threaded popcorn and was symbolical, so they say, of the thirstiness of the fields. The boys were dressed in mantles of open network, and the girls in new smocks with gay embroideries at neck and hem, but all of them wore necklaces of popcorn and turbans as well. Then the priests, leaning forward, took long strings of the white corn to wrap around their heads and to loop over the sides of the litters. Then the procession 248 moved slowly forward over a road of green leaves strewn with flowers. On the ground, too, were strewn needle-like tips of the maguey with which many penitents perforated tongue and ears till they were bathed in blood that glistened horribly in the sunlight. And there were others in the long procession who lashed themselves with knotted cords. But such are the ways of frenzy whenever the souls of men are stirred in common. It would prove over-tiresome should all the happenings of the marvelous day be related in full detail. There was a solemn sitting in state on the summit of the pyramid of Tezcatlipoca and before the door of the temple, where stood likewise the grim idol of stone, while complicated dances were being enacted in the court below. And Five-eagle, with a precise and certain artistry, wasted no moments of the triumph forecast at his birth and compromised in no feature his dignities and obligations. The water pageant came at the end of the long, brilliant day when the sun was dropping towards the mountain crests. There was a long line of the largest canoes, laden with flowers and colored streamers and surmounted with awnings and sunshades. In the first of these Five-eagle sat erect on a royal seat with his brides beside him. The waters of the lake were calm, with pale reflections of gossamer clouds, and the boats struck a wide wake that found the distant reeds and willows. Still there was laughter and gayety, but that one who in fantasy was a goddess of mountain crests had floating mists in her eyes while her lips formed a tremulous smile. On her black hair rested softly the hand of a lover, mortal at heart, but divine in a subtle play of mind over substance. “O little Lady of the House of Mists, see how your white fogs cling to Ajusco, dropping dew on the cosmos flowers that Xochiquetzalli loves.” “They are mists of a joyful sorrow, my Lord, they are mists of sorrow that obscure the world to-day that it may be fairer to-morrow.” “Then tell me that no shadows shall lie across your heart to-morrow when the fishing boats enter the canal at sunset. Tell me there shall be no shadows but only content in what has been, O my precious Lady of Mists.” 249 “Youth of Toxcatl, there shall be no weeping.” At a rocky point called Tlapitzahuayan the procession of canoes came to land. Here the courtiers and the four brides of the Youth of Toxcatl took merry leave of him, and he set out with his six boys for Tlacuchcalco, a nearby ancient temple, neglected and unused except on this one occasion of the year. A winding trail led to a rocky field of cactus and acacia to a temple mound overrun with desert growths. A broken stair climbed upward to a crumbling sacrificial chamber whose doorway was nearly closed by yellow orchids and thorny vines. Behind this humble screen, the thirsty knife of the great Magician awaited its draft of blood. The boys of the retinue followed in the footsteps of Five-eagle, and from the shore rang out a last sally of uplifting laughter. At the foot of the temple stairs they took from his shoulders the white mantle of the god who must be kept youthful at the cost of youth, and they unwrapped from his waist the gayly brocaded breechcloth, and they took from his feet the sandals, and from his ears the disks of apple-green jade, the last symbols of his year of earthly power. Only around his neck remained the necklace of flutes. He was a naked mortal, come, in the last humility of all men, to make the sincere gift of his life itself to a jealous and implacable god. With a gallant smile Five-eagle dismissed his pages and mounted the broken stairs; pausing on each step to break a flute between his two hands. Only a moment later and a human body, naked, horribly gaping at the breast, came crashing down the temple stairs, staining the brambles and the stones with blood. We can know the Past only as a masquerade of the Present. We can imagine only those smells and colors which have come into our nostrils and have passed before our eyes. To-day there are no gods, you say, and it is true that terrible Siva and the sweet face of Christ fade back into the haze that covers unbelief. Yet, to-day, how many a young Icarus plunges gladly to his death from dizzy heights. Does Necessity make us invade the airy kingdom of the birds or the green depths of the sea? Or are we driven to these conquests by the lusts and sincerities of a new commanding 250 over-soul, built out of song and fellowship and ordered lives of work and play? For the harnessed Powers enslave their busy masters, and the new-found gods of Speed and Thrill count victims as freely offered as that Youth of Toxcatl, who bravely climbed to the bloody altar of his sacrifice in Tenochtitlan that is no more. The soul of the Machine comes forth to rule the prostrate nations that another age may see a strange mirage thrown upward on the pale mists of romance. Herbert Spinden \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3319/90900.html","bookId":397,"book":{"id":397,"title":"American Indian life","description":"简介： She always says she will come, and sometimes she comes and sometimes she doesnt come. I was so surprised when I first came out here to find that Indians were like that, the wife of the Presbyterian Missionary in an Indian town in New Mexico was speak...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3319","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
