{"id":27103,"no":27,"title":"Windigo, a Chipewyan Story","content":"I Behind the Hudson’s Bay Company’s post at Fort Hearne, they were wrestling for wives. Forgotten were the words of Catholic priests on the sanctity of marriage, forgotten the precepts of Episcopal missionaries. In the twinkling of an eye those high-flown, newfangled notions had been swept aside by the deep rooted usage of ancient days. The Indians had been peaceably playing at “Button, button, who has the button?” with half the spectators staking shirts and blankets on the issue of the game. The real fun started when drunken Ramsay MacCrae reeled into the crowd and hugged Blanche Lecouvreur. Her husband sent him staggering to the ground, but the toper rose and, thrusting his fingers into Lecouvreur’s face, challenged him to an old-time combat for his spouse. There was no more guessing game after that, there was genuine sport. Ramsay was laid low, but he had set the example and another young swashbuckler fell foul of Casimir; and so it went on. There was nothing riotous about the affair, it was as nicely regulated as a prize fight. There was never more than one contest at a time for no one would miss part of the spectacle by engaging in a side show of his own. The wrestlers pulled each other about by the hair and ears, after the approved Athabaskan fashion before attempting other holds. What amusement when Angus had thrown the gauntlet to little Gordon and was on the point of carrying off buxom Peggy by default! But there was still more laughter when the crafty wag of the camp, supposed to be cowering in a hiding-place, popped out of his tent, his skull cropped, ears and body glistening with grease, and, seizing his handicapped adversary by his long locks, dragged him to the ground. Cries of encouragement and admiration filled the air. One wagered his gun on a friend’s victory, another staked his net or tent. The women fought for, looked on stolidly while the battle was waging, but when Ramsay had fallen, Blanche heaved a sigh of relief, and Peggy could not suppress a sneer at her would-be captor.326 Others were hauled away whimpering, but with Marie every one knew that she was wailing only to satisfy the proprieties, for she was well rid of her brute of a husband who had nearly beaten her to death after his last journey. But the climax came when big Douglas thrust his paw in Pierre Villeneuve’s face. To be sure, Louise was as comely as any young matron in or near the settlement, yet until now the bullies had refrained from challenging her husband. Every one respected her for her virtue and her kindness; and every one, too, was fond of Pierre. He was such a harmless, easy-going, good-natured chap, so handy with packstrap and toboggan, a prime companion after a two days’ trip without food, keeping up his blithe old ditty about “ma belle patrie” or warbling some native melody, when every one else was ready to sink down from exhaustion. But what was all that to crazy Douglas when he was in drink and lusting for a woman? He had the advantage of four inches in height, and of at least two stone in weight,—good enough reason for trying for a prize. Still, Pierre was no mean antagonist with his sinewy, agile frame and his widely famed strength of grip. Nor was it long before Douglas discovered that he had caught a tartar. Twice he was on the point of scoring, only to have Pierre wriggle unhurt from his grasp. At last a cry of anguish from Louise as the inevitable was about to happen. Douglas had lifted her husband and was about to hurl him to the ground. But then things happened quickly, no one knew how, and Douglas lay stretched out on the ground panting. He limped off with a sprained ankle, amidst the mocking and jubilations of Pierre’s friends, while even his backers had sportsmanship enough to congratulate the conqueror. Then through the laughing, shouting, gesticulating crowd a Titanic figure elbowed his way. In the midst of the din and excitement the strange half-breed’s approach had passed unnoticed. He had arrived only yesterday, with a letter of credit from the Company of Gentlemen and Adventurers’ Trading into Hudson’s Bay. His name was George MacDonald; beyond that nothing was known about him. What a frame was his! Beside it, huge Douglas looked puny. Pierre seemed a mere babe. MacDonald was not a man of many words. He strode towards Louise, lightly touched her arm and said, “I want you.” She shrank back shrieking, and Pierre rushed at the327 giant in a blind fury, only to be firmly grasped and gently deposited on the ground. Once more he leaped at his conqueror but was caught in a vise-like grip and laid low again, raging and impotent. In his madness he unsheathed his knife, but now Casimir and Gordon pinioned his arms and the crowd shouted, “Peace, peace! The stranger has won fairly!” MacDonald stood there calm and supercilious. “I have won,” he said to Louise, “come.” Without looking back he walked towards his tent, and the woman followed sobbing. That was the last wrestling bout that day. II MacDonald stayed at Fort Hearne and built himself a cabin at the other end of the post. He went off for a few days and returned with a retinue of Slaveys. Then he began trading against the Company itself. He had a way of dealing with the Indians that no other man had. He paid less, rather than more, for their furs, and disdained to coddle them with gifts and favors. Yet, when the peltry hunters caught a silver fox or some other valuable fur, the prize went to the gruff giant’s shack rather than to the Company’s warehouse. There was no competing with him. One factor was sent to relieve another, but without avail. At last the Commissioner himself braved the journey to the Fort, bought out MacDonald, and set him up as head of the post. Now, things began to hum at Fort Hearne. Never had such a factor been seen as MacDonald. He spoke Dogrib and Chipewyan and Cree and French as well as his father’s Orkney Island brogue: there was no hunter for hundreds of miles with whom he could not converse in his own tongue. He was on his feet from morning until night and kept every one else on the go. As a freetrader he had beaten the Company at its own game. With the Company’s prestige behind him he allowed no freetrader to raise his head. By fair means none could compete, and who dared try force or trickery against MacDonald? In the long winter evenings, when boresome hours of sloth were whiled away with story telling, strange tales began to circulate about the big factor. Since little or nothing was known of his early life, imagination ran riot. Angus knew that the factor could transform himself into a wolf, and hunt deer thus disguised. 328 Casimir pictured him in his youth, pulling cargo-laden scows, single-handed, that were wont to be towed by a half-dozen strapping Indians. Jean had it from an aunt that MacDonald had once swum a river in pursuit of a bear, had stabbed it with a knife and carried the carcass twenty miles to camp. Some said he was bulletproof, and others with a tincture of Christian lore spoke of his pact with the devil. He grew into the central figure of a new mythology. The hero himself moved across his stage with the saturnine grandeur of a Norse god. He never boasted, never faltered, never failed. He ran unscathed through rapids never attempted since two parties of canoemen had been capsized and drowned. He walked toward the cocked gun of a drink-crazed competitor, and calmly knocked it out of his hand. MacDonald did not know what it was to be afraid. Between the trader and Pierre a curious relationship developed. The factor of course used men as pawns, and knew a good lieutenant when he saw one. But for Pierre he showed more consideration than was due to even the best of assistants. Perhaps it was because Louise prompted kindness to her former husband; perhaps there was some spontaneous sentimentalism for a man he had wronged. However that might be, Pierre became a sort of attendant-in-ordinary on MacDonald, his companion on trips of inspection and the rarer jaunts of pleasure. For Pierre, his sullen, imperious master became the one and only subject of interest. He studied his habits and gestures and speech. He had set out eager to detect weakness, but his prying skepticism had changed to grudging admiration, and later to despondent amazement. He had begun by hating his wife’s abductor, and he came to hate with an ever intenser hatred the man who was without peer. It was not merely the giant’s strength or dauntless courage, it was the way he had with men. How he ordered about Casimir or Angus or Ramsay! A word was enough to quell rebellion. Again and again, in the beginning, Pierre had resolved to bid him defiance, yet when the moment came his resolution had failed. Yes, people liked Pierre and after a fashion they respected him, but that was a different thing. It was not in him to issue commands to others. If he ever mustered courage to do so, they would think he was putting on airs and laugh in his face, so that he would slink off in shame and humiliation.329 Why were men born so different? Why was he not born superior to the rest, like MacDonald? Why born at all only to be lorded over by another? Thus he brooded and brooded for hours at night, losing all hope and joy in life. Then one day, unexpectedly, his despair was lifted. He had been on a fruitless hunting trip with the factor, and the two were approaching the post at the close of a rainy day. They were walking through a dense wood. Both were drenched to the skin, and Pierre was nearly exhausted. Suddenly, odd fancies crossed his mind. Weird tales of childhood, retold round many a winter camp fire, surged in memory and would not down. At dark, the forest was peopled with mysterious beings. The Windigo were about then—cadaverous shapes with glaring eyes, and feeders on human flesh. They lurked in the shadows of trees, and rose upon wayfarers from the depths of the swamps. What chance of escape when they had once sighted a victim? Rattling their skeletons, they flitted after him faster than a hawk can fly, tore him apart like a rabbit or swallowed him whole. The very wood Pierre was now traversing had been once entered by a trapper who was never seen again. Pierre began to feel oppressed by a sense of uncanniness. He peered cautiously into the gathering darkness, then glanced eagerly behind him. He was glad MacDonald was near. The great man could protect him if any one could. Pierre felt reassured, yet it was best to take no chances, so he hurried on. Of a sudden there was a snapping of boughs, and he heard his name called as if in mockery as a long form swished through the wood, and a grim face was gaping at him not ten feet away. He turned in horror and fled towards MacDonald, crying, “Windigo! Windigo!” as he pointed at a spot ahead. But MacDonald did not smite the ogre with one of his huge fists, or seek to grapple with it as he was said to have once wrestled with a bear. His face turned an ashen hue, his mighty body was quivering like an aspen. That was the half-breed of it. Then with a bound he ran through the wood as fast as his legs would carry him, down to the river bank and along the rocky water front, till at length he caught sight of the big warehouse. There he paused panting, with the cold perspiration on his forehead. Pierre had followed as swiftly as he could, and at last overtook his master. Both were trembling 330 from head to foot and MacDonald kept muttering, “Windigo! Windigo!” Thus they walked toward the Fort. And Pierre felt happier than he had ever been since that wrestling bout when he had lost Louise: for all his way, MacDonald was afraid of the Windigo! III Casimir was dangerously ill. His appetite was gone and his limbs seemed paralyzed. There came rumors that a famous Cree doctor was visiting the Chipewyan of a nearby settlement, and Pierre was dispatched to lure him to Fort Hearne with promise of fabulous fees. The Cree consented. He was a garrulous old man and on their joint trip Pierre tried to sound him about his powers, but on that subject he was mum. “You will see,” he answered, and Pierre was obliged to wait. When they arrived at the Fort, the medicine man erected a little booth and had himself thrust in, with his hands and feet firmly tied. He sang his incantations and the lodge began to shake. It seemed filled with strange beings, for unearthly sounds were heard, followed by a death-like silence. Opening the lodge they saw the conjuror unbound, and as if awakening from a trance. He proclaimed that the spirits had visited him and declared that Casimir would recover. Next, the patient himself was stretched out in the booth and the doctor entered it, stripped stark naked. He knelt and sang and blew at Casimir’s heart, sucked at his breasts, and talked as if with his guardian spirits. Then he swallowed a stick three feet long, and retched it up again, announcing that all was well. In sooth, Casimir was carried from the tent clamoring for food, and in a week he was able to walk about. Then his kin showered gifts on the great magician, and all the other Indians sought to curry favor with him by every manner of attention. Pierre was less ostentatious than others in his entertainment of the old sage, but sometimes when the rest were fast asleep he would steal to the conjuror’s tent with liquor and tobacco, to ply him with questions about the magic art. And after a while his host’s reticence waned. He even confessed to having bewitched a rival by drawing his image on the ground with an arrow pointed at his heart. Yet when Pierre hinted that he, too, had a strong enemy on 331 whom he would fain cast a spell, the old fox hedged and said that sorcery was a dangerous business. Some men had power of their own, and could hurl the evil charm back with redoubled force against the sorcerer. Besides, he himself was old and wanted to live his few years in peace. When Pierre found it hopeless to make the Cree bewitch his master, he changed his tactics. What was the truth about the Windigo? He had heard his mother tell about them, but did they really exist? That proved a less delicate subject for the medicine man. He himself had never seen a Windigo, but he knew all about them from another conjuror. Yes, the Windigo were dangerous spirits and fearfully strong. How strong? Surely no stronger than the factor? Why, they would rend him asunder like a dry twig. They swooped down upon men to tear out their vitals, and played ball with their skulls. There was a way to gain their favor, but it was very hard. If one fasted for three or four days in a wood they haunted, and freely offered them of one’s flesh, they were pleased and might adopt him as their child. True, they were likely to swallow the sufferer whole, but when they spewed him out he was like one of themselves ever after, fierce and cannibalistic. The other Indians had better keep a wide berth of such as these, or placate them by gifts lest they break loose and destroy every one in sight. And now Pierre himself recalled a gaunt man who had terrorized the camp of his childhood, and whose bare glance had thrown timid folk into convulsions. Pierre slipped home and sat musing for a long time. Should he tempt the spirits of the woods? Would they answer his prayer? What if they ate him before he could make his offering? Yet, why should he live? He had lost Louise; and her captor was master of Fort Hearne. Life mattered not, unless the Windigo chose to bless him. The next day he entered the wood he had traversed with MacDonald that memorable evening. He ate not a morsel of food all day, and continued his fast next day, praying to the Windigo. At last he mustered up courage, gashed his chest with a big knife, and offered his body to the spirits. Then he fell down in a dead swoon. When he woke up, there was joy in his heart for all his pain. A Windigo had really come and blessed him! It had seized him as332 a boy seizes a moth, but when it saw the blood streaming from his breast it took pity on him, swallowed and disgorged him. Next spring he was to wreak vengeance as a Windigo. He must merely bide his time. As he walked homeward, he exulted in his new powers. Why not try them for a joke? He, too, would show people his strength now. The first man he encountered he would terrify into fits. Yonder was Angus, mending a net in front of his tent. He would do as well as the next. Pierre quickly stepped up to him, and assuming a ferocious grimace, he cried, “I am Windigo! I have come to eat you!” But Angus burst into a guffaw, “You a Windigo! You, who never hurt a fly! You are crazy. You’ve been drinking. Go home and sleep it off!” Pierre slunk home like a whipped cur, and threw himself on his bed crestfallen and humiliated. The Windigo had blessed him, yet he could not be Windigo. It was not in him. Even the Windigo could help only men like MacDonald. Thus he lay in impotent grief till exhaustion brought sleep. Then the Windigo loomed in sight and whispered, “In the spring, fool! I said, in the spring!” IV Spring came, and word reached Fort Hearne that the factor was to meet a fleet of scows at Fort Batise. That was a post he had never visited, so he summoned Pierre to make ready for the trip as his guide. They laid in an ample stock of provisions, for it was a long journey and there might be a protracted wait for the boats at their destination: Hudson’s Bay Company transports do not run on schedule time. One fine morning the two men set out in a canoe, struggling up-stream against the powerful current. Now and then they landed to shoot some partridges, and one day MacDonald killed a moose. Otherwise there was little to relieve the monotony of the journey. From morning till night, not a soul crossed their path. With MacDonald lapsing into his wonted silence, hours would pass without a sound but the splashing of the paddles and the quaint, plaintive notes of Pierre’s Red River melodies. Once in a while an abandoned site, with tent poles standing, suggested former human occupation. Every night the two men camped near the water edge,333 played a game or two of cribbage, and then stretched out to rest till four or five o’clock the next morning. And in the night Pierre would hear strange sounds, and as they grew nearer they turned into words: “In the spring! In the spring!” When they reached Fort Batise, the post was all but deserted. The Company’s trader had gone on a hunting trip and the dozen Indians in his charge were scattered though the woods. A single half-witted breed was holding down the Fort, and pointed out the uninhabited island, already known to Pierre, where the scows from time immemorial had been unloading the cargoes destined for Northern posts. The factor and Pierre paddled across and threw their bedding into a long, tumble-down shack reserved for the Company’s servants. It was still somewhat too early for retiring, so MacDonald suggested a walk, and they set out for a stroll through the dense wood. Pierre had been unusually silent that evening, as though by contagion with the factor’s taciturnity. Now, of a sudden, his tongue was loosened. Did MacDonald know why the post had never been transferred to the island for all its fine landing place? The Indians would not live there, they never came there alone, for the spot was haunted, they said. It was called Simon’s island. There was a long story about it, a foolish tale, but one the Indians told about their camp fires as though it were true. Of course Simon had really lived; Pierre remembered him well from the days of his boyhood—a ne’er-do-well, not a bad sort, but one always in bad luck. First, none of the girls would have him, then he got married and his wife died in childbirth. He would get a job towing a boat, stumble over a windfall on his first trip, and break his leg. It was always that way with poor Simon. When he gave up tracking, he became a pelt hunter. For years he roamed over the country and eked out a miserable livelihood. At last he had a stroke of luck and caught a silver fox. Now he thought he should live in plenty. But while on his way to the nearest trader’s, he fell in with another trapper. They slept side by side, and in the morning the stranger and the silver fox were both gone. High and low, Simon looked for them, but in vain. Then he turned crazy in his grief and became a Windigo. Whomever he chanced upon, men or women, he killed and ate. The Indians made up parties to hunt him like334 a wild beast. He laughed at them; he was Windigo. They could never catch him. Then some time after, those who had hunted him were found murdered in their tents, and people ceased pursuing him. Now they tried to buy him off. As soon as he had been sighted near a camp, heaps of meat were piled up outside the settlement, and the handsomest clothing was laid beside the food. Then he would leave the camp alone—till some fine day the fancy seized him once more, and he stole into a camp to gratify his craving. That was long ago, and Simon had died on this very island, where he lay buried. Yet the natives believed that his ghost still walked as a Windigo from time to time, though the Company said it was all nonsense and put up its shack there, in defiance of Indian tales. Of course the Company knew best. MacDonald had been listening with growing attention, and throughout the tale Pierre’s gaze had been riveted on his features. Had not a faint tremor passed down his spine when he first heard the word “Windigo”? Had he not caught his breath when he learned of the ghost’s reported wanderings? And why this sudden turning on his heels at the close of the story? Pierre was whistling a tune on the return walk, and the factor roared at him to keep still. He was plainly nervous; the tale had done its work. Arrived at the cabin, MacDonald picked up his bedding and muttered, “Perhaps we had better go across to the post, we won’t be able to sleep here for mosquitoes.” He did not expect Pierre to have faith in his pretext; neither did he expect to be openly flouted by his meek companion. But Pierre, looking him up and down, asked drily, “Afraid of Simon’s ghost?” “Afraid of nothing!” thundered MacDonald, hurling his blankets on the floor and glowering at his mate. He began to pace the room with giant strides. There was no doubt of it, he was troubled. He would not play cribbage. He was too tired, he said. MacDonald, who had never been tired before! So, soon both men sprawled out on the floor covered with their four-point blankets. But neither fell asleep. After a while MacDonald rose softly, and tiptoed toward the door. Perhaps he could make his way to the bank unnoticed, and put the river between Simon’s ghost and himself. But Pierre was wide awake and staring at him in the gloaming of a Northern night. “I was just stretching a bit,” the big man offered in explanation, 335 and Pierre did not even deign to tell him he lied. He sat up against the door now, and was eyeing the factor steadily, scornfully. The big man was nonplussed. What was Pierre’s game? How could he be so calm in a haunted spot? A mad hatred against him suddenly rose in MacDonald’s breast. He would brain this puny dolt with a blow of his fist, and say he had been drowned in the rapids. Then he would escape to the post and no soul would know of his weakness. Still Pierre sat looking at him with his gun across his knees. MacDonald cared little for the gun. There was at least a chance for him to take Pierre by surprise, and wrest the weapon from his grasp, and when had MacDonald been afraid to take chances? But there was something in Pierre’s gaze that cowed and subdued him. So he merely sat up facing Pierre and the door, with neither uttering a word. As the minutes passed, strange noises became audible. The floor was creaking and the door began to rattle, and over on the other bank the dogs were barking as dogs never barked before. There was a something—was it a bat?—that kept flitting against the roof, and on the door came an unaccountable rhythmic tapping. The factor fidgeted and peered in this direction and that, while Pierre sat now six feet away, immobile and pitiless. Then there was a different sound. A slow, heavy tread was coming up from the water edge. It was approaching the shack from the rear, passed round and got to the door. MacDonald sprang to his feet, but the steps went on, and he sank on the floor relieved though faint. But what was that? The steps were coming closer again: the wanderer was circling the shack a second time. Yet it seemed he had no intention of coming in, for, without halting at the door, the mysterious being started on its third round. But if it cared not to enter, neither was its purpose to leave the inmates in peace, for a fourth circuit began. Now Pierre burst forth: “It is Simon! He is walking round four times, then he will stop and pay you a visit.” MacDonald leaped up—a beast at bay, afraid to stay, afraid to go out now, straining to hear the weird footfalls first passing away then returning, ever more and more distinct. And now there was a dead halt at the door. Would it fly open and usher in the hideous shape of Simon’s ghost? The door remained closed. But now Pierre rose with a grim laugh, dropping his gun. He walked toward his master and336 thrust his thumb at his face. “Simon has come to see us wrestle. I will wrestle you for Louise. Simon has made me Windigo. I will throw you and kill you and eat you, and he wants to look on.” Fearlessly and madly he sprang at the giant’s throat. The factor had not watched him, he had not heard his speech, he was still looking and looking at the door. Where now were those puissant arms that had held Pierre like an infant at Fort Hearne? Limp and powerless, they were hanging from a twitching heap that fell resistless at the first impact. Pierre beat him and kicked him and choked him. Without knife or gun, with his bare hands he murdered the great factor. And then—he was Windigo! He rose jubilant. The Windigo had spoken truly: his enemy lay conquered. What next? Return to the post and tell of his deed? Would they believe him? They would say he was drunk or crazed, he who could not kill a fly. They would say some enemy of MacDonald’s, a party of freetraders perchance, had shot him from ambush. And he would be once more good, meek Pierre Villeneuve. It had all been in vain. To kill MacDonald was nothing, nothing even to regain Louise. He wanted to be master like the dead giant, and that he could never be. He staggered to the door and flung it open. What was that? A pallid face recoiling in terror, a horror-stricken cry of “Windigo!” and a man fleeing to the river and paddling across. He had forgotten the breed he had bribed, on plea of a practical joke, to cross from the post and prowl round the shack. The man had peeped in and seen everything. Now Pierre was saved, now he had won. His witness would spread the news and warn the people against the new Windigo. Pierre was greater now than MacDonald had ever been. His fame would travel from Hudson’s Bay to the Rocky Mountains and from the Red River to Fort Macpherson. How they would pamper him—Crees and half-breeds, Chipewyans and Slaveys—as he roamed over their country that now was his. He would steal their furs and eat their game and kidnap their wives, snapping his fingers in their faces. He was master now, for now he was Windigo. Robert H. Lowie \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3319/90906.html","bookId":397,"book":{"id":397,"title":"American Indian life","description":"简介： She always says she will come, and sometimes she comes and sometimes she doesnt come. I was so surprised when I first came out here to find that Indians were like that, the wife of the Presbyterian Missionary in an Indian town in New Mexico was speak...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3319","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
