{"id":33564,"no":10,"title":"Chapter 10","content":"WORMS-CLAVELIN had insisted on his old friend, Georges Frémont, staying to déjeuner. Frémont, an inspector of fine art, was going on circuit through the department. When they had first met in the painters’ studios at Montmartre, Frémont was young and Worms-Clavelin very young. They had not a single idea in common, and they had no points of agreement at all. Frémont loved to contradict, and Worms-Clavelin put up with it; Frémont was fluent and violent in speech, Worms-Clavelin always yielded to his vehemence and spoke but little. For a time they were comrades, and then life separated them. But every time that they happened to meet, they once more became intimate and quarrelled zestfully. For Georges Frémont, middle-aged, portly, beribboned, well-to-do, still retained something of his youthful fire. This morning, sitting between Madame Worms-Clavelin in a morning gown and M. Worms-Clavelin in a breakfast137 jacket, he was telling his hostess how he had discovered in the garrets at the museum, where it had been buried in dust and rubbish, a little wooden figure in the purest style of French art. It was a Saint Catherine habited in the garb of a townswoman of the fifteenth century, a tiny figure with wonderful delicacy of expression and with such a thoughtful, honest look that he felt the tears rise to his eyes as he dusted her. M. Worms-Clavelin inquired if it were a statue or a picture, and Georges Frémont, glancing at him with a look of kindly scorn, said gently: “Worms, don’t try to understand what I am saying to your wife! You are utterly incapable of conceiving the Beautiful in any form whatever. Harmonious lines and noble thoughts will always be written in an unknown tongue as far as you are concerned.” M. Worms-Clavelin shrugged his shoulders: “Shut up, you old communard!” said he. Georges Frémont actually was an old communard. A Parisian, the son of a furniture maker in the Faubourg Saint-Antoine, and a pupil at the Beaux-Arts, he was twenty at the time of the German invasion, and had enlisted in a regiment of francs-tireurs who never saw service. For this slight Frémont had never forgiven Trochu. At the time of the capitulation he was one of the most excited,138 and shouted with the rest that Paris had been betrayed. But he was no fool, and really meant that Paris had been badly defended, which was true enough, of course. He was for war to the knife. When the Commune was proclaimed, he declared for it. On the proposition of one of his father’s old workmen, a certain citizen Charlier, delegate for the Beaux-Arts, he was appointed assistant sub-director of the Museum of the Louvre. It was an honorary appointment and he performed his duties booted, with cartridges in his belt, and on his head a Tyrolese hat adorned with cock feathers. At the beginning of the siege the canvases had been rolled up, put into packing-cases and carried away to warehouses from which he never succeeded in unearthing them. The only duty that remained to him was to smoke his pipe in galleries that had been transformed into guard-rooms and to gossip with the National Guard, to whom he denounced Badinguet for having destroyed the Rubens pictures by a cleaning process which had removed the glaze. He based his grounds for this accusation on the authority of a newspaper article, backed up by M. Vitet’s opinion. The federalists sat on the benches and listened to him, with their guns between their legs, whilst they drank their pints of wine in the palace precincts, for it was warm weather. When, however,139 the people of Versailles forced their way into Paris by the broken-down Porte du Point-du-Jour and the cannonade approached the Tuileries, Georges Frémont was much distressed to see the National Guard of the federalists rolling casks of petroleum into the Apollo gallery. It was with great difficulty that he at length succeeded in dissuading them from saturating the wainscoting to make it blaze. Then, giving them money for drink, he got rid of them. After they had gone, he managed, with the assistance of the Bonapartist guards, to roll these dangerous casks to the foot of the staircase and to push them as far as the bank of the Seine. When the colonel of the federalists was informed of this, he suspected Frémont of betraying the popular cause and ordered him to be shot. But as soon as the Versailles mob was approaching and the smoke of the blazing Tuileries rising into the air, Frémont fled, cheek by jowl with the squad that had been ordered out to execute him. Two days later, being denounced to the Versailles party, he was a fugitive from the military tribunal for having taken part in a rebellion against the established Government. And it was perfectly certain that the Versailles party was in direct succession, since having followed the Empire on September 4th, 1870, it had adopted and retained the recognised procedure of the preceding Government,140 whilst the Commune, which had never succeeded in establishing those telegraphic communications that are absolutely essential to a recognised government, found itself undone and destroyed—and, in fact, very much in the wrong. Besides, the Commune was the outcome of a revolution carried out in face of the enemy, and this the Versailles administration could never forgive, for its origin recalled their own. It was for this reason that a captain of the winning side, being employed in shooting rebels in the neighbourhood of the Louvre, ordered his men to search for Frémont and shoot him. At last, after remaining in hiding for a fortnight with citizen Charlier, a member of the Commune, under a roof in the Place de la Bastille, Frémont left Paris in a smock-frock, with a whip in his hand, behind a market-gardener’s cart. And whilst a court-martial at Versailles was condemning him to death, he was earning his livelihood in London by drawing up a complete catalogue of Rowlandson’s works for a rich City amateur. Being an intelligent, industrious and honourable man, he soon became well known and respected among the English artists. He loved art passionately, but politics scarcely interested him at all. He remained friendly towards the Commune through loyalty alone and in order to avoid the shame of141 deserting vanquished friends. But he dressed well and moved in good society. He worked strenuously and, at the same time, knew how to profit by his work. His Dictionnaire des monogrammes not only established his reputation, but brought him in some money. After the amnesty had been passed and the last fluttering rags of civil strife had blown away, there landed at Boulogne, after Gambetta’s motion, a certain gentleman, haughty and smiling, yet not unsociable. He was youngish, but a little worn by work, and with a few grey hairs; he was correctly dressed in a travelling costume and carried a portmanteau packed with sketches and manuscripts. Establishing himself in modest style at Montmartre, Georges Frémont quickly became intimate with the artist colony there. But the labours upon the emoluments from which he had mainly supported himself in England only brought him the satisfaction of gratified vanity in France. Then Gambetta obtained for him an appointment as inspector of museums, and Frémont fulfilled his duties in this department both conscientiously and skilfully. He had a true and delicate taste in art. The nervous sensitiveness which had moved him deeply in his youth before the spectacle of his country’s wounds, still affected him, now that he was growing old, when confronted by unhappy142 social conditions, but enabled him, too, to derive delight from the graceful expression of human thought, from exquisite shapes, from the classic line, and the heroic cast of a face. With all this he was patriotic even in art, never jesting about the Burgundian school, faithful to political sentiment, and relying on France to bring justice and liberty to the universe. “You old communard!” repeated M. Worms-Clavelin. “Hold your tongue, Worms! Your soul is ignoble and your mind obtuse. You have no meaning in yourself, but, in the phrase of to-day, you are a representative type. Just Heavens! how many victims were butchered during a whole century of civil war just that M. Worms-Clavelin might become a republican préfet! Worms, you are lower in the scale than the préfets of the Empire.” “The Empire!” exclaimed M. Worms-Clavelin. “Blast the Empire! First of all it swept us all into the abyss, and then it made me an official. But, all the same, wine is made, corn is grown, just as in the time of the Empire; they bet on the Bourse, as under the Empire; one eats, drinks, and makes love, as under the Empire. At bottom, life is just the same. How could government and administration be different? There are certain143 shades of difference, I grant you. We have more liberty; we even have too much of it. We have more security. We enjoy a government which suits the ideals of the people. As far as such a thing is possible, we are the masters of our fate. All the social forces are now held in just balance, or nearly so. Now just you show me what there is that could be changed. The colour of our postage stamps perhaps ... and after that!... As old Montessuy used to say, ‘No, no, friend, short of changing the French, there is nothing in France to change.’ Of course, I am all for progress. One must talk about moving, were it only in order to dispense with movement. ‘Forward! forward!’ The Marseillaise must have been useful in not carrying one to the frontier!...” The look which Georges Frémont turned on the préfet was full of deep, affectionate, kindly, thoughtful scorn: “Everything is as perfect as it can be, then, Worms?” “Don’t make out that I speak like an utter dolt. Nothing is perfect, but all things cling together, prop one another up, dovetail with one another. It is just like père Mulot’s wall which you can see from here behind the orangery. It is all warped and cracked and leans forward. For the last thirty years that fool of a Quatrebarbe, the144 diocesan architect, has been stopping dead in front of Mulot’s house. Then, with his nose in air, his hands behind his back and his legs apart, he says: ‘I really don’t see how that holds together!’ The little imps coming out from school stand behind him and shout in mockery of his gruff tones: ‘I really don’t see how that holds together!’ He turns round and, seeing nobody, looks at the pavement as though the echo of his voice had risen from the earth. Then he goes away repeating, ‘I really don’t see how that holds together!’ It holds together because nobody touches it; because père Mulot summons neither masons nor architects; above all, because he takes good care not to ask M. Quatrebarbe for his advice. It holds together because up till now it has held together. It holds together, you old dreamer, because they neither revise the taxes nor reform the Constitution.” “That is to say, it holds together through fraud and iniquity,” said Georges Frémont. “We have fallen into a cauldron of shame. Our finance ministers are under the thumb of the cosmopolitan banking-houses. And, sadder still, it is France—France, of old the deliverer of the nations—that has no care in European politics save to avenge the rights of titled sovereigns. Without even daring to shudder, we permitted the massacre of145 three hundred thousand Christians in the East, although, by our traditions, we had been constituted their revered and august protectors. We have betrayed not only the interests of humanity, but our own; and now you may see the Republic floating in Cretan waters among the Powers of Europe, like a guinea-fowl amid a flock of gulls. It was to this point, then, that our friendship with our ally was to lead us.” The préfet protested: “Don’t attack the Russian entente, Frémont. It’s the very best of all the electioneering baits.” “The Russian alliance,” replied Frémont, waving his fork, “I hailed the birth of it with joyful expectation. But, alas, did it not, at the very first test, fling us into the arms of that assassin the Sultan and lead us to Crete, there to hurl melinite shell at Christians whose only fault was the long oppression they had suffered? But it was not Russia that we took such pains to humour, it was the great bankers interested in Ottoman bonds. And you saw how the glorious victory of Canea was hailed by the Jewish financiers with a burst of generous enthusiasm.” “There you go,” cried the préfet, “that’s just sentimental politics! You ought to know, at any rate, where that sort of thing leads. And why the146 deuce you should be excited about the Greeks, I don’t see. They’re not at all interesting.” “You are right, Worms,” said the inspector of fine arts. “You are perfectly right. The Greeks are not interesting, for they are poor. They have nothing but their blue sea, their violet hills and the fragments of their statues. The honey of Hymettus is never quoted on the Bourse. The Turks, on the contrary, are well worthy of the attention of European financiers. They have internal dissensions; above all they have resources. They pay badly and they pay much. One can do business with them. Stocks rise. All is well then. Such are the ideals of our foreign policy!” M. Worms-Clavelin interrupted him hurriedly, and casting on him a reproachful look, said: “Ah, now! Georges, don’t be disingenuous. You know well enough that we neither have, nor can have, any foreign policy.”","sourceLink":"http://novel.tingroom.com/duanpian/3185/87199.html","bookId":849,"book":{"id":849,"title":"The Wicker Work Woman","description":"简介： M. Bergeret was preparing his lesson on the eighth book of the ?neid, and he ought to have been devoting himself exclusively to the fascinating5 details of metre and language. In this task he would have found, if not joy, at any rate mental peace and...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3185","creation":"Aug 1, 2019 12:23:35 AM","modification":"Aug 1, 2019 12:23:35 AM"}}
