{"id":33563,"no":9,"title":"Chapter 9","content":"EANWHILE M. Bergeret was re-reading the meditations of Marcus Aurelius. He had a fellow-feeling for Faustina’s husband, yet he found it impossible really to appreciate all the fine thought contained in this little book, so false to nature seemed its sentiments, so harsh its philosophy, so scornful of the softer side of life its whole tone. Next he read the tales of Sieur d’Ouville, and those of Eutrapel, the Cymbalum of Despériers, the Matinées of Cholière and the Serées of Guillaume Bouchet. He took more pleasure in this course of reading, for he perceived that it was suitable to one in his position and therefore edifying, that it tended to diffuse serene peace and heavenly gentleness in his soul. He returned grateful thanks to the whole band of romance-writers who all, from the dweller in old Miletus, where was told the Tale of the Wash-tub, to the wielders of the spicy wit of Burgundy, the charm of Touraine, and the broad humour of Normandy,126 have helped to turn the sorrow of harassed hearts into the ways of pleasant mirth by teaching men the art of indulgent laughter.[8] [8] In his study of medi?val romances, M. Bergeret devotes himself to the Conte badin, or jesting tale of ludicrous adventure by which so much of Chaucer’s work was inspired. This school of short stories starts with the tales of Aristeides of Miletus, a writer of the second century B.C. His Milésiaques, as they are called, were followed by the fabliaux of the Middle Ages, and in the fifteenth century and onwards by the Cent Nouvelles nouvelles of Louis XI’s time, by the Heptaméron of the Queen of Navarre, the Decameron of Boccaccio and the Contes of Despériers, of Guillaume Bouchet, of No?l du Fail and others. La Fontaine retold many of the older tales in verse and Balzac tried to revive the Gallic wit and even the language of the fabliaux in his Contes dr?latiques. “These romancers,” thought he, “who make austere moralists knit their brows, are themselves excellent moralists, who should be loved and praised for having gracefully suggested the simplest, the most natural, the most humane solutions of domestic difficulties, difficulties which the pride and hatred of the savage heart of man would fain solve by murder and bloodshed. O Milesian romancers! O shrewd Petronius! O No?l du Fail,” cried he, “O forerunners of Jean de La Fontaine! what apostle was wiser or better than you, who are commonly called good-for-nothing rascals? O benefactors of humanity! you have taught us the true science of life, a kindly scorn of the human race!” 127 Thus did M. Bergeret fortify himself with the thought that our pride is the original source of all our misery, that we are, in fact, but monkeys in clothes, and that we have solemnly applied conceptions of honour and virtue to matters where these are ridiculous. Pope Boniface VIII, in fact, was wise in thinking that, in his own case, a mountain was being made out of a mole-hill, and Madame Bergeret and M. Roux were just about as worthy of praise or blame as a pair of chimpanzees. Yet, he was too clear-sighted to pretend to deny the close bond that united him to these two principal actors in his drama. But he only regarded himself as a meditative chimpanzee, and he derived from the idea a sensation of gratified vanity. For wisdom invariably goes astray somewhere. M. Bergeret’s, indeed, failed in another point: he did not really adapt his conduct to his maxims, and although he showed no violence, he never gave the least hint of forbearance. Thus he by no means proved himself the follower of those Milesian, Latin, Florentine, or Gallic romance-writers whose smiling philosophy he admired as being well suited to the absurdity of human nature. He never reproached Madame Bergeret, it is true, but neither did he speak a word, or throw a glance in her direction. Even when seated128 opposite her at table, he seemed to have the power of never seeing her. And if by chance he met her in one of the rooms of the flat, he gave the poor woman the impression that she was invisible. He ignored her, he treated her not only as a stranger, but as non-existent. He ousted her both from visual and mental consciousness. He annihilated her. In the house, among the numberless preoccupations of their life together, he neither saw her, heard her, nor formed any perception of her. Madame Bergeret was a coarse-grained, troublesome woman, but she was a homely, moral creature after all; she was human and living, and she suffered keenly at not being allowed to burst out into vulgar chatter, into threatening gestures and shrill cries. She suffered at no longer feeling herself the mistress of the house, the presiding genius of the kitchen, the mother of the family, the matron. Worst of all, she suffered at feeling herself done away with, at feeling that she no longer counted as a person, or even as a thing. During meals she at last reached the point of longing to be a chair or a plate, so that her presence might at least be recognised. If M. Bergeret had suddenly drawn the carving-knife on her, she would have cried for joy, although she was by nature timid of a blow. But not to129 count, not to matter, not to be seen, was insupportable to her dull, heavy temperament. The monotonous and incessant punishment that M. Bergeret inflicted on her was so cruel that she was obliged to stuff her handkerchief into her mouth to stifle her sobs. And M. Bergeret, shut up in his study, used to hear her noisily blowing her nose in the dining-room while he himself was placidly sorting the slips for his Virgilius nauticus, unmoved by either love or hate. Every evening Madame Bergeret was sorely tempted to follow her husband into the study that had now become his bedroom as well, and the impregnable fastness of his impregnable will. She longed either to ask his forgiveness, or to overwhelm him with the lowest abuse, to prick his face with the point of a kitchen-knife or to slash herself in the breast—one or the other, indifferently, for all she wanted was to attract his notice to herself, just to exist for him. And this thing which was denied her, she needed with the same overpowering need with which one craves bread, water, air, salt. She still despised M. Bergeret, for this feeling was hereditary and filial in her nature. It came to her from her father and flowed in her blood. She would no longer have been a Pouilly, the niece of Pouilly of the Dictionary, if she had acknowledged any kind of equality between herself and her husband.130 She despised him because she was a Pouilly and he was a Bergeret, and not because she had deceived him. She had the good sense not to plume herself too much on this superiority, but it is more than probable that she despised him for not having killed M. Roux. Her scorn was a fixed quantity, capable neither of increase nor decrease. Nevertheless, she felt no hatred for him, although until lately, she had rather enjoyed tormenting and annoying him in the ordinary affairs of every day, by scolding him for the untidiness of his clothes and the tactlessness of his behaviour, or by telling him interminable anecdotes about the neighbours, trivial and silly stories in which even the malice and ill-nature were but commonplace. For this windbag of a mind produced neither bitter venom nor strange poison and was but puffed up by the breath of vanity. Madame Bergeret was admirably calculated to live on good terms with a mate whom she could betray and brow-beat in the calm assurance of her power and by the natural working of her vigorous physique. Having no inner life of her own and being exuberantly healthy of body, she was a gregarious creature, and when M. Bergeret was suddenly withdrawn from her life, she missed him as a good wife misses an absent husband. Moreover, this meagre little man, whom she had always considered131 insignificant and unimportant, but not troublesome, now filled her with dread. By treating her as an absolute nonentity, M. Bergeret made her really feel that she no longer existed. She seemed to herself enveloped in nothingness. At this new, unknown, nameless state, akin to solitude and death, she sank into melancholy and terror. At night, her anguish became cruel, for she was sensitive to nature and subject to the influence of time and space. Alone in her bed, she used to gaze in horror at the wicker-work woman on which she had draped her dresses for so many years and which, in the days of her pride and light-heartedness, used to stand in M. Bergeret’s study, proudly upright, all body and no head. Now, bandy-legged and mutilated, it leant wearily against the glass-fronted wardrobe, in the shadow of the curtain of purple rep. Lenfant the cooper had found it in his yard amongst the tubs of water with their floating corks, and when he brought it to Madame Bergeret, she dared not set it up again in the study, but had carried it instead into the conjugal chamber where, wounded, drooping, and struck by emblematic wrath, it now stood like a symbol that represented notions of black magic to her mind. She suffered cruelly. When she awoke one morning a melancholy ray of pale sunlight was shining between the folds of the curtain on the132 mutilated wicker dummy and, as she lay watching it, she melted with self-pity at the thought of her own innocence and M. Bergeret’s cruelty. She felt instinct with rebellion. It was intolerable, she thought, that Amélie Pouilly should suffer by the act of a Bergeret. She mentally communed with the soul of her father and so strengthened herself in the idea that M. Bergeret was too paltry a man to make her unhappy. This sense of pride gave her relief and supplied her with confidence to bedeck herself, buoying her mind with the assurance that she had not been humiliated and that everything was as it always had been. It was Madame Leterrier’s At Home day, and Madame Bergeret set out, therefore, to call on the rector’s highly respected wife. In the blue drawing-room she found her hostess sitting with Madame Compagnon, the wife of the mathematical professor, and after the first greetings were over, she heaved a deep sigh. It was a provocative sigh, rather than a down-trodden one, and while the two university ladies were still giving ear to it, Madame Bergeret added: “There are many reasons for sadness in this life, especially for anyone who is not naturally inclined to put up with everything.... You are a happy woman, Madame Leterrier, and so are you, Madame Compagnon!...” 133 And Madame Bergeret, becoming humble, discreet and self-controlled, said nothing more, though fully conscious of the inquiring glances directed towards her. But this was quite enough to give people to understand that she was ill-used and humiliated in her home. Before, there had been whispers in the town about M. Roux’s attentions to her, but from that day forth Madame Leterrier set herself to put an end to the scandal, declaring that M. Roux was a well-bred, honourable young man. Speaking of Madame Bergeret, she added, with moist lips and tear-filled eyes: “That poor woman is very unhappy and very sensitive.” Within six weeks the drawing-rooms of the county town had made up their minds and come over to Madame Bergeret’s side. They declared that M. Bergeret, who never paid calls, was a worthless fellow. They suspected him of secret debauchery and hidden vice, and his friend, M. Mazure, his comrade at the academy of old books, his colleague at Paillot’s, was quite sure that he had seen him one evening going into the restaurant in the Rue des Hebdomadiers, a place of questionable repute. Whilst M. Bergeret was thus being tried by the tribunal of society and found wanting, the popular voice was crowning him with quite a different134 reputation. Of the vulgar symbol that had lately appeared on the front of his own house only very indistinct traces remained. But phantoms of the same design began to increase and multiply in the town, and now M. Bergeret could not go to the college, nor on the Mall, nor to Paillot’s shop, without seeing his own portrait on some wall, drawn in the primitive style of all such ribaldries, surrounded by obscene, suggestive, or idiotic scrawls, and either pencilled or chalked or traced with the point of a stone and accompanied by an explanatory legend. M. Bergeret was neither angered nor vexed at the sight of these graffiti; he was only annoyed at the increasing number of them. There was one on the white wall of Goubeau’s cow-house on the Tintelleries; another on the yellow frontage of Deniseau’s agency in the Place Saint-Exupère; another on the grand theatre under the list of admission rates at the second pay-box; another at the corner of the Rue de la Pomme and the Place du Vieux-Marché; another on the outbuildings of the Nivert mansion, next to the Gromances’ residence; another on the porter’s lodge at the University; and yet another on the wall of the gardens of the prefecture. And every morning M. Bergeret found yet newer ones. He noted, too, that these graffiti were not all from the same hand. In some, the man’s figure was drawn in quite135 primitive style; others were better drawn, without showing, however, upon examination, any approach to individual likeness or the difficult art of portraiture. But in every case the bad drawing was supplemented by a written explanation, and in all these popular caricatures M. Bergeret wore horns. He noticed that sometimes these horns projected from a bare skull, sometimes from a tall hat. “Two schools of art!” thought he. But his refined nature suffered. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3185/87198.html","bookId":849,"book":{"id":849,"title":"The Wicker Work Woman","description":"简介： M. Bergeret was preparing his lesson on the eighth book of the ?neid, and he ought to have been devoting himself exclusively to the fascinating5 details of metre and language. In this task he would have found, if not joy, at any rate mental peace and...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3185","creation":"Aug 1, 2019 12:23:35 AM","modification":"Aug 1, 2019 12:23:35 AM"}}
