{"id":106308,"no":40,"title":"Page 40","content":"“Hey,” Jada whispered. Drake looked over at her. In the glow of their flashlights, he saw that magenta strands had come loose from her ponytail. To someone who hadn’t been at her side these last days, she might have looked fragile, but to Drake, she seemed as strong as if she’d been forged in fire. “Thanks,” she said. He didn’t feel deserving of her gratitude. What had he done for her thus far except be by her side while people died around her, while she took a life for the first time, while her godfather had been stolen from her and her stepmother betrayed her? He couldn’t bring her father back to life. The best he could do was finish the job they’d started. “Any time,” he said, grinning. “I wouldn’t want to go on a suicide mission with anyone else.” Jada pushed off from the wall and went to punch him. “Enough!” Drake said, holding up his hands in surrender. Jada smiled. “Tough guy.” Then she walked toward Henriksen. “All right, Tyr. Time to tell us what the hell that was all about back there.” Henriksen turned, still in the pool of Drake’s flashlight. He hung his head, shadows gathering under his eyes, and it made him look a century older. “I never thought she would go so far,” he said. Lifting his head, he turned his sorrowful gaze upon Jada. “Tonight I have blood on my hands for the first time.” “Join the club,” she said. She tried to sound cavalier, but Drake heard the pain in her voice. “But you’re not exactly an innocent. Your whole career has been about doing whatever it took to get what you wanted. If you never killed someone or had anybody killed, I’m willing to bet people have died because of you before.” The words scuffed the walls, but they were nothing compared to the screams that once had reverberated here. “She’s got you there,” Drake said. Henriksen glanced at him and managed to look almost ashamed. “You are not what I expected, Mr. Drake.” He nodded toward Jada. “Either of you. You are survivors, and you have my admiration.” “Yeah, well, considering we thought you were pretty much the devil when this all started, I guess you’re not what we expected, either,” Drake said. “But we don’t have time for group therapy, Tyr. I’m going to bet there are still some spooky ninja guys—” “And girls,” Jada put in. “Yeah, I noticed that,” Drake said. “My point is, no matter how many Protectors of the Hidden Word were killed by Perkins’s goon squad, I doubt they’re all dead. If I was calling the shots, I’d have held some of my people back. They’ve got Sully and Ian Welch somewhere, and maybe others. Never mind the gold. There could be one or two right around the next turn. So we’re not going another step until you tell us what it is you’ve been holding back.” Henriksen frowned. Jada aimed her flashlight at his eyes, and he squinted, turning away. “Come on,” she said. “No more secrets. If the three of us are going to make it through till morning, we need to work together.” Several seconds ticked by in the silence of the torture chamber. Its gruesomeness struck Drake anew, and he became more impatient than ever to be gone from there, to find the heart of the labyrinth and make an end to things. “Tyr—” “Knossos,” Henriksen said. Drake shrugged. “What about it?” “The labyrinth there is in ruins,” Henriksen went on, his gaze shifting from Drake to Jada. “But I’ve had theories about Minos for years, and I’ve had teams going through the ruins, doing small excavations, all through museums and universities but with my people running it. One of those excavations turned up the wreckage of a chamber.” “A worship chamber,” Jada said, her voice low. Henriksen nodded. “I brought your father in after my people had translated fragments of several tablets and the writing on a shattered sacramental jar we had recovered. I had been keeping track of progress at Crocodilopolis for a while, but once your father confirmed my suspicions that Daedalus had designed both the labyrinth at Knossos and the one in Crocodile City, it became my priority. I’d hoped to find a complete worship chamber there, and of course we found even more than that.” “But there are things you knew already,” Drake said, studying his face. “Things you learned from the fragments from Knossos.” “Bits and pieces. Suppositions,” Henriksen said. “The first Mistress of the Labyrinth was Ariadne herself. Her beauty and gentleness kept the Minotaur calm—” “There’s no such thing—” Jada began. “But there was!” Henriksen snapped. “You don’t understand.” He took Drake’s flashlight and shone it upon the wall, where a gruesome painting in the ancient Chinese style represented the Mistress of the Labyrinth tipping a cup of honey into the mouth of a slave whose back was streaked with scars from the lash. Others awaited the same communion. One of them, off to the right, was hunched over, having already received the cup. Horns jutted from his head, and his features were contorted, almost savage. “You’ve gotta be kidding me,” Drake rasped, staring. “The honey? What, it turned them into monsters?” “Not with horns,” Henriksen said, waving his disbelief away. “Those were an affectation, something to frighten the others, I think, and to perpetuate the legend that Daedalus had so carefully built. The skeleton we examined in the labyrinth of Sobek—the one you found on the stairs under the altar—had the horns of an actual bull. They were probably tied to his head with some kind of leather strap. “There are conditions that could explain many of the Minotaur’s legendary features. The chemical composition of the honey might have triggered hypertrichosis, causing the growth of thick, shaggy hair all over their bodies, their faces included. I also suspect they attained their monstrous size through slave labor and the honey’s activation of the pituitary gland’s growth hormones. It’s even possible that one or two grew cutaneous horns, prompting the legend to begin with and leading Daedalus and his inner circle to use fake horns to perpetuate the monstrous image of the Minotaur in order to keep people too terrified to attempt to explore the labyrinth. But the key element is strength and aggression. Savagery. Perhaps an edge of lunacy.” Jada’s flashlight beam wavered. “What are ‘cutaneous horns’? Is that even something real?” “They’re not actual horn. In rare cases, people have seemed to grow horns on their heads or faces or hands, but it’s a buildup of keratotic material, like hair or fingernails. Sometimes there’s cancer involved …” Henriksen waved the topic away. “This is not important.” “Agreed,” Drake said. “And it’s pretty gross. How the hell do they do it? What’s in the honey?” Henriksen smiled slightly, as if he couldn’t help it. “The white blossoms you’ve seen? Much of what we learned from the fragments discovered at Knossos concerned them. White hellebore.” Drake turned his flashlight back on the wall painting of the slaves being given honey in a ritual presided over by the Mistress of the Labyrinth. Images of those flowers were mixed amid ancient Chinese characters and portrayals of hellish torture. “But those flowers aren’t white hellebore,” Jada said. “We’ve established that.” Henriksen arched an eyebrow. “Tell me what you know about Helleborus.” She shrugged. “Only what your research team turned up. The ancients thought there were two species, white and black, both poisonous.” “In the legends, black hellebore was a cure for madness,” Drake said. “But the flower they thought was white hellebore back then—” Jada began. “It’s still called white hellebore—” Drake put in. “—isn’t white hellebore at all. It’s a different species. Like Nate said, they still call it that, but it’s something else.” Henriksen nodded. “But what if, in ancient times, true white hellebore did exist? What if the flower they call by that name today, knowing it isn’t the same species, is not the same flower the ancients called white hellebore? What if true white hellebore has been all but extinct for more than two thousand years—except inside this labyrinth, where it had continued to be cultivated all down through the ages?” Drake stared at him. “You’re telling me this whole thing has been about flowers?” “More than you can imagine,” Henriksen said. “Why?” Jada asked. “You want to create an army of Minotaurs or something?” Henriksen’s expression hardened; whatever camaraderie they had built through their mutual survival was shattered. “I don’t,” he said. “But I’m sure there are more than a few governments that would love that.” “Oh, my—” Jada started. “I don’t think it’s that simple, though,” Henriksen said, forging onward. “Look at that painting. There are six or seven slaves being fed that honey, but not all of them are Minotaurs. What we’ve translated suggests that creating the Minotaurs was a happy accident, a by-product of the intended purpose of the white hellebore and the honey made from it. Daedalus—and later Talos—wanted slaves, and the primary effect of the distilled essence of the white hellebore was to make those who ingested it suggestible. Controllable. In theory it’s not unlike the manner in which Haitian ‘witch doctors’ were once supposed to have used tetrodotoxin from puffer fish and other species to induce a trance state, but without the motor and mental impairment associated with those toxins. In small doses, Daedalus’s honey left his subjects none the wiser, and in larger doses it either turned them into mindless drones or triggered the physiological and psychological changes that created Minotaurs. At Knossos, the honey had another name. In English, it translates as—” “The hidden word,” Drake interrupted. “The word they all had to obey.” Henriksen nodded. “Precisely.” “You’re saying the hooded men aren’t protecting Daedalus’s treasure,” Jada said. “They’re protecting the white hellebore.” “This is where Olivia and I disagree,” Henriksen replied, his voice echoing off the torture chamber’s walls. “I believe that all references to treasure in the ancient records are really references to the flower. Mr. Drake, if you’re the expert you claim to be, you must know that historically, white hellebore has also been reputed to be one of the key ingredients used—” “In alchemy,” Drake finished for him. He shook his head, waves of disbelief washing over him. He just had to make sure he didn’t drown in them. “I don’t think alchemists turned base metals to gold any more than I think you can pull a rabbit out of a hat,” Henriksen said. “I think all the great alchemists did was get their hands on some white hellebore and use it to influence the minds of those around them to control their perceptions and make them believe they had seen something they had not seen.” “There’s no treasure,” Drake said. “No gold?” “Oh, I’m sure there must be something, or there was once upon a time,” Henriksen said. “Do I think that Daedalus paid his workers with gold from inside the labyrinths? No. At Knossos, I suspect he paid them in stones or nuts before he realized that it would be much easier to simply take over their minds entirely and enslave them, which is what he likely did while building the labyrinth of Sobek. “Olivia disagrees. She believes that Daedalus must have accumulated vast wealth, and perhaps she’s right. But we won’t know until we reach the center of the labyrinth. If she cared only for the white hellebore, she’d have turned around the moment we found it as we entered Diyu. But she wants that gold.” Drake scowled. “While all you want is to sell mind control to whichever government is the highest bidder.” Henriksen shrugged. “Someone’s going to profit from this. I’d rather it were me.” Jada took a step backward. “This is what my father wanted to stop,” she said, staring at him. “I have no doubt,” Henriksen agreed. “But I’m not some James Bond villain, Jada. It’s not as if I’m going to try to take over the world. I’m only a businessman.” “Do you have any idea what this could be used for?” Jada demanded. “Think of the espionage applications. Dosing world leaders so you could control their decisions. Never mind the military uses. You know that soldiers would be experimented on. And what about dictatorships that want more pliable people?” “As I said,” Henriksen replied, “someone’s going to do it.” “Unless we destroy the white hellebore,” Jada said. “Burn it all.” Henriksen clenched his fists. “I’m afraid I can’t allow that.” “Whoa!” Drake said, dropping his hand to the gun on his belt. “Let’s all take a breath, okay?” He shone his flashlight at Jada and saw the emotions wracking her features. “Henriksen might not be a world conqueror, but right now, we have no idea what Olivia has in mind.” “Oh, make no mistake,” Henriksen said. “If whoever she hires for the science can synthesize the chemicals, there’s nothing Olivia would like more than to have presidents and despots as her puppets.” Drake glanced back and forth between them. “Our goals haven’t changed. I’m here for Sully.” “I’m here for my father,” Jada corrected him. “I love my Uncle Vic, but I’m here to stop Henriksen—or my stepmother—from getting what they want.”","sourceLink":"https://allnovel.net/uncharted-the-fourth-labyrinth/page-40.html","bookId":1539,"book":{"id":1539,"title":"Uncharted: The Fourth Labyrinth","description":"Storyline: Uncharted: The Fourth Labyrinth The official novel of Naughty Dog’s award-winning videogame franchise! In the ancient world there was a myth about a king, a treasure, and a hellish labyrinth. Now the doors to that hell are open once again. Nathan Drake, treasure hunter and risk taker, has been called to New York City by the man who taught him everything about the “antiquities acquisition business.” Victor Sullivan needs Drake’s help. Sully’s old friend, a world-famous archaeologist, has just been found murdered in Manhattan. Dodging assassins, Drake, Sully, and the dead man’s daughter, Jada Hzujak, race from New York to underground excavations in Egypt and Greece. Their goal: to unravel an ancient myth of alchemy, look for three long-lost labyrinths, and find the astonishing discovery that got Jada’s father killed. It appears that a fourth labyrinth was built in another land and another culture—and within it lies a key to unmatched wealth and power. An army of terrifying lost warriors guards this underground maze. So does a monster. And what lies beyond—if Drake can live long enough to reach it—is both a treasure and a poison, a paradise and a hell. Welcome to The Fourth Labyrinth.(","cover":"https://allnovel.net/images/uncharted-the-fourth-labyrinth.jpg","author":"Christopher Golden","type":"Adventure","source":"allnovel","link":"https://allnovel.net/uncharted-the-fourth-labyrinth.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:54:52 PM"}}
