{"id":16029,"no":8,"title":"CHAPTER I","content":"MY EXPLANATION OF THE 24TH OF FEBRUARY, AND MY VIEWS AS TO ITS EFFECTS UPON THE FUTURE. And so the Monarchy of July was fallen, fallen without a struggle, and before rather than beneath the blows of the victors, who were as astonished at their triumph as were the vanquished at their defeat. I have often, since the Revolution of February, heard M. Guizot and even M. Molé and M. Thiers declare that this event should only be attributed to a surprise and regarded as a mere accident, a bold and lucky stroke and nothing more. I have always felt tempted to answer them in the words which Molière\u0027s Misanthrope uses to Oronte: Pour en juger ainsi, vous avez vos raisons; for these three men had conducted the affairs of France, under the guidance of King Louis-Philippe, during eighteen years, and it was difficult for them to admit that it was the King\u0027s bad government which had prepared the catastrophe which hurled him from the Throne. As for me, I have not the same motives for forming an opinion, and I could hardly persuade myself to be of theirs. I am not prepared to say that accidents played no part in the Revolution of Feb[80]ruary: on the contrary, they played a great one; but they were not the only thing. I have come across men of letters, who have written history without taking part in public affairs, and politicians, who have only concerned themselves with producing events without thinking of describing them. I have observed that the first are always inclined to find general causes, whereas the others, living in the midst of disconnected daily facts, are prone to imagine that everything is attributable to particular incidents, and that the wires which they pull are the same that move the world. It is to be presumed that both are equally deceived. For my part, I detest these absolute systems, which represent all the events of history as depending upon great first causes linked by the chain of fatality, and which, as it were, suppress men from the history of the human race. They seem narrow, to my mind, under their pretence of broadness, and false beneath their air of mathematical exactness. I believe (pace the writers who have invented these sublime theories in order to feed their vanity and facilitate their work) that many important historical facts can only be explained by accidental circumstances, and that many others remain totally inexplicable. Moreover, chance, or rather that tangle of secondary causes which we call chance, for want of the knowledge how to unravel it, plays a great part in all that happens on the world\u0027s stage; although I firmly believe that chance does nothing[81] that has not been prepared beforehand. Antecedent facts, the nature of institutions, the cast of minds and the state of morals are the materials of which are composed those impromptus which astonish and alarm us. The Revolution of February, in common with all other great events of this class, sprang from general causes, impregnated, if I am permitted the expression, by accidents; and it would be as superficial a judgment to ascribe it necessarily to the former or exclusively to the latter. The industrial revolution which, during the past thirty years, had turned Paris into the principal manufacturing city of France and attracted within its walls an entire new population of workmen (to whom the works of the fortifications had added another population of labourers at present deprived of work) tended more and more to inflame this multitude. Add to this the democratic disease of envy, which was silently permeating it; the economical and political theories which were beginning to make their way and which strove to prove that human misery was the work of laws and not of Providence, and that poverty could be suppressed by changing the conditions of society; the contempt into which the governing class, and especially the men who led it, had fallen, a contempt so general and so profound that it paralyzed the resistance even of those who were most interested in maintaining the power that was being overthrown; the centralization[82] which reduced the whole revolutionary movement to the overmastering of Paris and the seizing of the machinery of government; and lastly, the mobility of all things, institutions, ideas, men and customs, in a fluctuating state of society which had, in less than sixty years, undergone the shock of seven great revolutions, without numbering a multitude of smaller, secondary upheavals. These were the general causes without which the Revolution of February would have been impossible. The principal accidents which led to it were the passions of the dynastic Opposition, which brought about a riot in proposing a reform; the suppression of this riot, first over-violent, and then abandoned; the sudden disappearance of the old Ministry, unexpectedly snapping the threads of power, which the new ministers, in their confusion, were unable either to seize upon or to reunite; the mistakes and disorder of mind of these ministers, so powerless to re-establish that which they had been strong enough to overthrow; the vacillation of the generals; the absence of the only Princes who possessed either personal energy or popularity; and above all, the senile imbecility of King Louis-Philippe, his weakness, which no one could have foreseen, and which still remains almost incredible, after the event has proved it. I have sometimes asked myself what could have produced this sudden and unprecedented depression in the King\u0027s mind. Louis-Philippe had spent his[83] life in the midst of revolutions, and certainly lacked neither experience, courage, nor readiness of mind, although these qualities all failed him so completely on that day. In my opinion, his weakness was due to his excessive surprise; he was overwhelmed with consternation before he had grasped the meaning of things. The Revolution of February was unforeseen by all, but by him more than any other; he had been prepared for it by no warning from the outside, for since many years his mind had withdrawn into that sort of haughty solitude into which in the end the intellect almost always settles down of princes who have long lived happily, and who, mistaking luck for genius, refuse to listen to anything, because they think that there is nothing left for them to learn from anybody. Besides, Louis-Philippe had been deceived, as I have already said that his ministers were, by the misleading light cast by antecedent facts upon present times. One might draw a strange picture of all the errors which have thus been begotten, one by the other, without resembling each other. We see Charles I. driven to tyranny and violence at the sight of the progress which the spirit of opposition had made in England during the gentle reign of his father; Louis XVI. determined to suffer everything because Charles I. had perished by refusing to endure anything; Charles X. provoking the Revolution, because he had with his own eyes beheld the weakness of Louis XVI.; and lastly, Louis-Philippe, who had more perspicacity than any[84] of them, imagining that, in order to remain on the Throne, all he had to do was to observe the letter of the law while violating its spirit, and that, provided he himself kept within the bounds of the Charter, the nation would never exceed them. To warp the spirit of the Constitution without changing the letter; to set the vices of the country in opposition to each other; gently to drown revolutionary passion in the love of material enjoyment: such was the idea of his whole life. Little by little, it had become, not his leading, but his sole idea. He had wrapped himself in it, he had lived in it; and when he suddenly saw that it was a false idea, he became like a man who is awakened in the night by an earthquake, and who, feeling his house crumbling in the darkness, and the very ground seeming to yawn beneath his feet, remains distracted amid this unforeseen and universal ruin. I am arguing very much at my ease to-day concerning the causes that brought about the events of the 24th of February; but on the afternoon of that day I had many other things in my head: I was thinking of the events themselves, and sought less for what had produced them than for what was to follow. I returned slowly home. I explained in a few words to Madame de Tocqueville what I had seen, and sat down in a corner to think. I cannot remember ever feeling my soul so full of sadness. It was the second revolution I had seen accomplish itself, before my eyes, within seventeen years![85] On the 30th of July 1830, at daybreak, I had met the carriages of King Charles X. on the outer boulevards of Versailles, with damaged escutcheons, proceeding at a foot pace, in Indian file, like a funeral, and I was unable to restrain my tears at the sight. This time my impressions were of another kind, but even keener. Both revolutions had afflicted me; but how much more bitter were the impressions caused by the last! I had until the end felt a remnant of hereditary affection for Charles X.; but that King fell for having violated rights that were dear to me, and I had every hope that my country\u0027s freedom would be revived rather than extinguished by his fall. But now this freedom seemed dead; the Princes who were fleeing were nothing to me, but I felt that the cause I had at heart was lost. I had spent the best days of my youth amid a society which seemed to increase in greatness and prosperity as it increased in liberty; I had conceived the idea of a balanced, regulated liberty, held in check by religion, custom and law; the attractions of this liberty had touched me; it had become the passion of my life; I felt that I could never be consoled for its loss, and that I must renounce all hope of its recovery. I had gained too much experience of mankind to be able to content myself with empty words; I knew that, if one great revolution is able to establish liberty in a country, a number of succeeding revolu[86]tions make all regular liberty impossible for very many years. I could not yet know what would issue from this last revolution, but I was already convinced that it could give birth to nothing that would satisfy me; and I foresaw that, whatever might be the lot reserved for our posterity, our own fate was to drag on our lives miserably amid alternate reactions of licence and oppression. I began to pass in review the history of our last sixty years, and I smiled bitterly when I thought of the illusions formed at the conclusion of each period in this long revolution; the theories on which these illusions had been fed; the sapient dreams of our historians, and all the ingenious and deceptive systems by the aid of which it had been endeavoured to explain a present which was still incorrectly seen, and a future which was not seen at all. The Constitutional Monarchy had succeeded the Ancien Régime; the Republic, the Monarchy; the Empire, the Republic; the Restoration, the Empire; and then came the Monarchy of July. After each of these successive changes it was said that the French Revolution, having accomplished what was presumptuously called its work, was finished; this had been said and it had been believed. Alas! I myself had hoped it under the Restoration, and again after the fall of the Government of the Restoration; and here is the French Revolution beginning over again, for it is still the same one. As we go on, its end[87] seems farther off and shrouded in greater darkness. Shall we ever—as we are assured by other prophets, perhaps as delusive as their predecessors—shall we ever attain a more complete and more far-reaching social transformation than our fathers foresaw and desired, and than we ourselves are able to foresee; or are we not destined simply to end in a condition of intermittent anarchy, the well-known chronic and incurable complaint of old races? As for me, I am unable to say; I do not know when this long voyage will be ended; I am weary of seeing the shore in each successive mirage, and I often ask myself whether the terra firma we are seeking does really exist, and whether we are not doomed to rove upon the seas for ever. I spent the rest of the day with Ampère, who was my colleague at the Institute, and one of my best friends. He came to discover what had become of me in the affray, and to ask himself to dinner. I wished at first to relieve myself by making him share my vexation; but I soon perceived that his impression was not the same as mine, and that he looked differently upon the revolution which was in progress. Ampère was a man of intelligence and, better still, a man full of heart, gentle in manner, and reliable. His good-nature caused him to be liked; and he was popular because of his versatile, witty, amusing, good-humoured conversation, in which he made many remarks that were at once entertaining and agreeable to hear, but too shallow to remember.[88] Unfortunately, he was inclined to carry the esprit of the salons into literature and the esprit of literature into politics. What I call literary esprit in politics consists in seeking for what is novel and ingenious rather than for what is true; in preferring the showy to the useful; in showing one\u0027s self very sensible to the playing and elocution of the actors, without regard to the results of the play; and, lastly, in judging by impressions rather than reasons. I need not say that this eccentricity exists among others besides Academicians. To tell the truth, the whole nation is a little inclined that way, and the French Public very often takes a man-of-letters\u0027 view of politics. Ampère held the fallen Government in great contempt, and its last actions had irritated him greatly. Moreover, he had witnessed many instances of courage, disinterestedness, and even generosity among the insurgents; and he had been bitten by the popular excitement. I saw that he not only did not enter into my view, but that he was disposed to take quite an opposite one. Seeing this, I was suddenly impelled to turn against Ampère all the feelings of indignation, grief and anger that had been accumulating in my heart since the morning; and I spoke to him with a violence of language which I have often since recalled with a certain shame, and which none but a friendship so sincere as his could have excused. I remember saying to him, inter alia: \"You understand nothing of what is happening;[89] you are judging like a poet or a Paris cockney. You call this the triumph of liberty, when it is its final defeat. I tell you that the people which you so artlessly admire has just succeeded in proving that it is unfit and unworthy to live a life of freedom. Show me what experience has taught it! Where are the new virtues it has gained, the old vices it has laid aside? No, I tell you, it is always the same, as impatient, as thoughtless, as contemptuous of law and order, as easily led and as cowardly in the presence of danger as its fathers were before it. Time has altered it in no way, and has left it as frivolous in serious matters as it used to be in trifles.\" After much vociferation we both ended by appealing to the future, that enlightened and upright judge who always, alas! arrives too late. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2885/79823.html","bookId":1143,"book":{"id":1143,"title":"The Recollections of Alexis de Tocqueville","description":"简介： of his talent. He threw himself into the struggle, resolving to devote himself to the interests of the country and of society, and he was one of the first among those whole-hearted, single-minded men who endeavoured to keep the Republic within a wise...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2885","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
