{"id":108525,"no":47,"title":"Page 47","content":"MATT DROVE AWAY. Sonya McGrath headed back inside. Their relationship, if there had ever been one, was over. It felt odd and yet, despite the honesty and raw emotion, anything built on such misery was bound to cave. It was all too fragile. They were simply two people needing something that neither could ever get.\\n\\n He wondered if Sonya would call the police. He wondered if it mattered.\\n\\n God, he\u0027d been stupid to come here.\\n\\n He was hurting badly. He needed to rest. But there was no time. He\u0027d have to push through. He checked the gas gauge. It was near empty. He stopped at a nearby Shell station and used the rest of his money to fill the tank.\\n\\n During his ride, he thought about the bombshell Olivia had just dropped on him. At the end of the day, as weird or naive as this might sound, he wondered what it really changed. He still loved Olivia. He loved the way she frowned when she checked herself in the mirror, that little smile she made when she was thinking of something funny, the way she rolled her eyes when he made a clumsy double entendre, the way she tucked her feet under when she read, the way she took deep, almost cartoon breaths when she was irritated, the way her eyes welled up with tears when they made love, the way his heart pumped a little faster when she laughed, the way he\u0027d catch her studying him when she thought he wouldn\u0027t notice, the soft way her eyes closed when she listened to a favorite song on the radio, the way her hand would just take his at any time without hesitation or embarrassment, the way her skin felt, the charge at her touch, the way she\u0027d drape a leg over him on the lazy mornings, the way her chest felt pressed against his back when they slept, the way when she slipped out of bed in the early morning she\u0027d kiss his cheek and make sure the blankets still covered him.\\n\\n What about any of that was different now?\\n\\n The truth was not always freeing. Your past was your past. He had not, for example, told her about his stint in prison to illuminate the \"real Matt\" or \"take their relationship to the next level\"- he told her because she would undoubtedly find out anyway. It didn\u0027t mean a thing. If he hadn\u0027t told her, wouldn\u0027t their relationship be equally strong?\\n\\n Or was this all a giant rationalization?\\n\\n He stopped at an ATM near Sonya\u0027s house. He had no choice now. He needed money. If she called the police, well, they\u0027d know he\u0027d been in this area anyway. If they traced it down, he\u0027d be long gone by the time they arrived. He didn\u0027t want to use the credit card at a gas station. They might get his license plate number that way. As it was, if he could get the money and put distance between himself and this ATM, he figured that he\u0027d be all right.\\n\\n The ATM had a max of a thousand dollars. He took it.\\n\\n Then he started thinking of a way to get to Reno.\\n\\n Loren drove. Adam Yates sat in the passenger seat.\\n\\n \"Explain this to me again,\" he said.\\n\\n \"I have a source. A man named Len Friedman. A year ago we found two dead women in a hooker alley, both young, both black, both had their hands cut off so that we couldn\u0027t get an ID off fingerprints. But one of the girls had a strange tattoo, a logo from Princeton University, on her inner thigh.\"\\n\\n \"Princeton?\"\\n\\n \"Yes.\"\\n\\n He shook his head.\\n\\n \"Anyway, we put that in the papers. The only person who came forward was this Len Friedman. He asked if she also had a rose petal tattoo on her right foot. That hadn\u0027t been released. So our interest, to put it mildly, was piqued.\"\\n\\n \"You figured he was the perp.\"\\n\\n \"Sure, why not? But it turns out that both women were strippers- or as Friedman calls them, erotic dancers- at a dump called the Honey Bunny in Newark. Friedman is an expert on all things stripper. It\u0027s his hobby. He collects posters, bios, personal information, real names, tattoos, birthmarks, scars, I mean everything. A full database. And not just on the local trade. I assume you\u0027ve walked the Vegas Strip?\"\\n\\n \"Sure.\"\\n\\n \"You know how they pass out cards advertising strippers and prostitutes and whatever.\"\\n\\n \"Hey, I live there, remember?\"\\n\\n She nodded. \"Well, Len Friedman collects them. Like baseball cards. He gathers information on them. He travels for weeks at a time visiting these places. He writes what some consider academic essays on the subject. He also collects historical material. He has a brassiere belonging to Gypsy Rose Lee. He has stuff that dates back more than a century.\"\\n\\n Yates made a face. \"He must be a lot of fun at parties.\"\\n\\n Loren smiled. \"You have no idea.\"\\n\\n \"What\u0027s that supposed to mean?\"\\n\\n \"You\u0027ll see.\"\\n\\n They fell into silence.\\n\\n Yates said, \"I\u0027m really sorry again. About what I said before.\"\\n\\n She waved him off. \"How many kids do you have anyway?\"\\n\\n \"Three.\"\\n\\n \"Boys, girls?\"\\n\\n \"Two girls, one boy.\"\\n\\n \"Ages?\"\\n\\n \"My daughters are seventeen and sixteen. Sam is fourteen.\"\\n\\n \"Seventeen- and sixteen-year-old girls,\" Loren said. \"Yikes.\"\\n\\n Yates smiled. \"You have no idea.\"\\n\\n \"You have pictures?\"\\n\\n \"I never carry pictures.\"\\n\\n \"Oh?\"\\n\\n Yates shifted in his seat. Loren glanced at him out of the corner of her eye. His posture was suddenly rigid. \"About six years ago,\" he began, \"I had my wallet stolen. I know, I\u0027m head of an FBI field office and I\u0027m dumb enough to get pickpocketed. Sue me. Anyway, I went nuts. Not because of the money or the credit cards. But all I kept thinking about was, some slimeball has pictures of my kids. My kids. He probably just took the cash and dumped the wallet in the garbage. But suppose he didn\u0027t. Suppose he kept the pictures. You know, for his own amusement. Maybe he, I don\u0027t know, stared at the pictures longingly. Maybe he even put his fingers on their faces, caressed them.\"\\n\\n Loren frowned. \"Talk about being a lot of fun at parties.\"\\n\\n Yates chuckled without humor. \"Anyway, that\u0027s why I never carry pictures.\"\\n\\n They turned off of Northfield Avenue in West Orange. It was a nicely aging town. Most of the newer burbs had landscapes that looked somehow phony, like a recent hair transplant. West Orange had lush lawns and ivy on the walls. The trees were tall and thick. The houses were not cookie-cutter- there were Tudors, next to capes, next to Mediterranean style. They were all a little past due, not in prime condition, but it all seemed to work.\\n\\n There was a tricycle in the driveway. Loren pulled up behind it. They both got out. Someone had set up one of those baseball net-retrievers in the front yard. Two mitts sat in the fetal position on the grass.\\n\\n Yates said, \"Your source lives here?\"\\n\\n \"Like I said, you have no idea.\"\\n\\n Yates shrugged.\\n\\n A woman straight out of the Suzy Homemaker handbook answered the door. She wore a checkered apron and a smile Loren usually associated with religious fervor. \"Len\u0027s in the workroom downstairs,\" she said.\\n\\n \"Thank you.\"\\n\\n \"Would you like some coffee?\"\\n\\n \"No, that\u0027s okay.\"\\n\\n \"Mom!\"\\n\\n A boy of maybe ten ran into the room. \"Kevin, we have guests.\"\\n\\n Kevin smiled like his mother. \"I\u0027m Kevin Friedman.\" He stuck out his hand and met Loren\u0027s eye. The shake was firm. He turned to Yates, who seemed startled. He shook too and introduced himself.\\n\\n \"Very nice to meet you,\" Kevin said. \"Mom and I are making some banana bread. Would you care for a slice?\"\\n\\n \"Maybe later,\" Loren said. \"We, uh...\"\\n\\n \"He\u0027s down that way,\" Suzy Homemaker said.\\n\\n \"Right, thanks.\"\\n\\n They opened the basement door. Yates muttered, \"What did they do to that boy? I can\u0027t even get my kids to say hello to me, forget strangers.\"\\n\\n Loren muffled a laugh. \"Mr. Friedman?\" she called out.\\n\\n He stepped into view. Friedman\u0027s hair had gone a shade grayer since the last time she\u0027d seen him. He wore a light blue button-down sweater and khakis. \"Nice to see you again, Investigator Muse.\"\\n\\n \"Same here.\"\\n\\n \"And your friend?\"\\n\\n \"This is Special Agent in Charge Adam Yates from Las Vegas.\"\\n\\n Friedman\u0027s eyes lit up when he heard the location. \"Vegas! Welcome then. Come, let\u0027s sit and see if I can help you out.\"\\n\\n He opened a door with a key. Inside was everything stripper. There were photographs on the wall. Documents of one kind or another. Framed panties and bras. Feathered boas and fans. There were old posters, one advertising Lili St. Cyr, and her \"Bubble Bath Dance,\" another for Dixie Evans, \"The Marilyn Monroe of Burlesque,\" who was appearing at the Minsky-Adams Theater in Newark. For a moment Loren and Yates just looked around and gaped.\\n\\n \"Do you know what that is?\" Friedman gestured toward a big feathered fan he kept in a museum-style glass cube.\\n\\n \"A fan?\" Loren said.\\n\\n He laughed. \"Not just a fan. Calling this a fan would be like\"- Friedman thought about it-\"like calling the Declaration of Independence a piece of parchment. No, this very fan was used by the great Sally Rand at the Paramount Club in 1932.\"\\n\\n Friedman waited for a reaction, didn\u0027t get one.\\n\\n \"Sally Rand invented the fan dance. She actually performed it in the 1934 movie Bolero. The fan is made from real ostrich feathers. Can you believe that? And that whip over there? It was used by Bettie Page. She was called the Queen of Bondage.\"\\n\\n \"By her mother?\" Loren couldn\u0027t resist.\\n\\n Friedman frowned, clearly disappointed. Loren held up an apologetic hand. Friedman sighed and moved toward his computer.\\n\\n \"So I assume this involves an erotic dancer from the Vegas area?\"\\n\\n \"It might,\" Loren said.\\n\\n He sat at his computer and typed something in. \"Do you have a name?\"\\n\\n \"Candace Potter.\"\\n\\n He stopped. \"The murder victim?\"\\n\\n \"Yes.\"\\n\\n \"But she\u0027s been dead for ten years.\"\\n\\n \"Yes, we know.\"\\n\\n \"Most people believe she was killed by a man named Clyde Rangor,\" Friedman began. \"He and his girlfriend Emma Lemay had a wonderful eye for talent. They comanaged some of the best low-rent but talent-loaded gentlemen\u0027s clubs anywhere.\"\\n\\n Loren sneaked a glance at Yates. Yates was shaking his head in either amazement or repulsion. It was hard to tell which. Friedman saw it too.\\n\\n \"Hey, some guys get into NASCAR,\" Friedman said with a shrug.\\n\\n \"Yeah, what a waste,\" Loren said. \"What else?\"\\n\\n \"There were bad rumors about Clyde Rangor and Emma Lemay.\"\\n\\n \"They abused the girls?\"\\n\\n \"Sure, I mean, they were mob connected. This isn\u0027t unusual in the business, unfortunately. It really taints the overall aesthetic, you know what I mean?\"\\n\\n Loren said, \"Uh huh.\"\\n\\n \"But even among thieves there is a certain code. They purportedly broke it.\"\\n\\n \"In what way?\"\\n\\n \"Have you seen the new commercials for Las Vegas?\" Friedman asked.\\n\\n \"I don\u0027t think so.\"\\n\\n \"The ones that say, \u0027What goes on in Vegas stays in Vegas\u0027?\"\\n\\n \"Oh, wait,\" Loren said. \"I\u0027ve seen them.\"\\n\\n \"Well, gentlemen\u0027s clubs take that motto to a fanatical extreme. You never, ever tell.\"\\n\\n \"And Rangor and Lemay told?\"\\n\\n Friedman\u0027s face went dark. \"Worse. I-\"\\n\\n \"Enough,\" Yates said, cutting him off.\\n\\n Loren turned toward Yates. She gave him a what-gives shrug.\\n\\n \"Look,\" Yates continued, checking his watch, \"this is all interesting, but we\u0027re a little pressed for time here. What can you tell us about Candace Potter specifically?\"\\n\\n \"May I ask a question?\" Friedman said.\\n\\n \"Shoot.\"\\n\\n \"She\u0027s been dead a long time. Has there been a new development in the case?\"\\n\\n \"There might have been,\" Loren said.\\n\\n Friedman folded his hands and waited. Loren took the chance.\\n\\n \"Did you know that Candace Potter may have been\"- she decided to go with a more popular though inaccurate term-\"a hermaphrodite?\"\\n\\n That got him. \"Wow.\"\\n\\n \"Yes.\"\\n\\n \"You\u0027re sure?\"\\n\\n \"I\u0027ve seen the autopsy.\"\\n\\n \"Wait!\" Friedman shouted it in the same way an editor in an old movie would shout, \"Hold the presses!\" \"You have the actual autopsy?\"\\n\\n \"Yes.\"\\n\\n He licked his lips, tried not to look too anxious. \"Is there any way I can get a copy?\"\\n\\n \"It can probably be arranged,\" Loren said. \"What else can you tell us about her?\"\\n\\n Friedman started typing on the computer. \"The information on Candace Potter is sketchy. For the most part she went by the stage name Candi Cane, which, let\u0027s face it, is a horrible name for an exotic dancer. It\u0027s too much, you know? Too cute. You know what a good name is? Jenna Jameson, for example. You\u0027ve probably heard of her. Well, Jenna started as a dancer, you know, before she got into porn. She got the name Jameson from a bottle of Irish whiskey. See? It\u0027s classier. It has more oomph, you know what I mean.\"\\n\\n \"Right,\" Loren said, just to say something.\\n\\n \"And Candi\u0027s solo act was not the most original either. She dressed like a hospital candy striper and carried a big lollipop. Get it? Candi Cane? I mean, talk about cliched.\" He shook his head in the manner of a teacher let down by a prized pupil. \"Professionally she\u0027ll be better remembered for a dual act where she was known as Brianna Piccolo.\"\\n\\n \"Brianna Piccolo?\"\\n\\n \"Yes. She worked with another dancer, a statuesque African American named Kimmy Dale. Kimmy, in the act, went by the name Gayle Sayers.\"\\n\\n Loren saw it. So did Yates.\\n\\n \"Piccolo and Sayers? Please tell me you\u0027re kidding.\"\\n\\n \"Nope. Brianna and Gayle did a sort of exotic dance rendition of the movie Brian\u0027s Song. Gayle would tearfully say, \u0027I love Brianna Piccolo,\u0027 you know, like Billy Dee did on the dais in the movie. Then Brianna would be lying sick in a bed. They\u0027d help each other undress. No sex. Nothing like that. Just an exotic artistic experience. It had great appeal to those with an interracial fetish, which, frankly, is nearly everyone. I think it was one of the finest political statements made in exotic dance, an early display of racial sensitivity. I never saw the act in person, but my understanding was that it was a moving portrayal of socioeconomic-\"\\n\\n \"Yeah, moving, I get it,\" Loren interrupted. \"Anything else?\"\\n\\n \"Sure, of course, what do you want to know? The Sayers-Piccolo number was usually the opening act for Countess Allison Beth Weiss IV, better known as Jewish Royalty. Her act- get this- was called \u0027Tell Mom It\u0027s Kosher.\u0027 You\u0027ve probably heard of it.\"\\n\\n A waft of banana bread was reaching them down here. The smell was wonderful, even in this appetite-reducing atmosphere. Loren tried to get Friedman back on track. \"I mean anything else about Candace Potter. Anything that can illuminate what happened to her.\"\\n\\n Friedman shrugged. \"She and Kimmy Dale were not only dance partners but also real-life roommates. In fact, Kimmy Dale paid for the funeral to save Candi from- pardon the unintentional pun here- a potter\u0027s grave. Candi is buried at Holy Mother in Coaldale, I think. I\u0027ve visited the tombstone to pay my respects. It\u0027s quite a moving experience.\"\\n\\n \"I bet. Do you keep track of what happens to exotic dancers after they leave the business?\"\\n\\n \"Of course,\" he said, as if she\u0027d asked a priest if he ever went to Mass. \"That\u0027s often the most interesting part. You wouldn\u0027t believe the variety of life roads they take.\"\\n\\n \"Right, so what happened to this Kimmy Dale?\"\\n\\n \"She\u0027s still in the business. A true warhorse. She no longer has the looks. She\u0027s- again pardon the unintentional pun- slid down the pole, if you will. The headline days are over. But Kimmy still has a small following. What she loses in not being, say, toned or hard-bodied she makes up for in experience. She\u0027s out of Vegas though.\"\\n\\n \"Where is she?\"\\n\\n \"Reno, last I heard.\"\\n\\n \"Anything else?\"\\n\\n \"Not really,\" Friedman said. Then he snapped his fingers. \"Hold on, I have something to show you. I\u0027m quite proud of this.\"\\n\\n They waited. Len Friedman had three tall file cabinets in the corner. He opened the second drawer of the middle one and began to finger through it. \"The Piccolo and Sayers act. This is a rare piece and it\u0027s only a color reproduction off a Polaroid. I\u0027d really like to find more.\" He cleared his throat as he continued his search. \"Do you think, Investigator Muse, that I could get a copy of that autopsy?\"\\n\\n \"I\u0027ll see what I can do.\"\\n\\n \"It would really add to my studies.\"\\n\\n \"Studies. Right.\"\\n\\n \"Here it is.\" He took out a photograph and placed it on the table in front of them. Yates looked at it and nodded. He turned to Loren and saw the expression on her face.\\n\\n \"What?\" Yates said.\\n\\n Friedman added, \"Investigator Muse?\"\\n\\n Not in here, Loren thought. Not a word. She stared at the late Candace Potter aka Candi Cane aka Brianna Piccolo aka the Murder Victim.\\n\\n \"This is definitely Candace Potter?\" she managed.\\n\\n \"Yes.\"\\n\\n \"You\u0027re sure?\"\\n\\n \"Of course.\"\\n\\n Yates looked a question at her. Loren tried to blink it away.\\n\\n Candace Potter. If this really was Candace Potter, then she wasn\u0027t a murder victim. She wasn\u0027t dead at all. She was alive and well and living in Irvington, New Jersey, with her ex-con husband Matt.\\n\\n They\u0027d had it all wrong. Matt Hunter wasn\u0027t the connection here. Things were finally starting to make some sense.\\n\\n Because Candace Potter had a new alias now.\\n\\n She was Olivia Hunter. \\n\\n","sourceLink":"https://allnovel.net/the-innocent/page-47.html","bookId":1557,"book":{"id":1557,"title":"The Innocent","description":"Storyline: You never meant to kill him…. \\n One night, Matt Hunter innocently tried to break up a fight—and ended up a killer. Now, nine years later, he’s an ex-con who takes nothing for granted. His wife, Olivia, is pregnant, and the two of them are closing on their dream house. But all it will take is one shocking, inexplicable call from Olivia’s phone to shatter Matt’s life a second time…. \\n An electrifying thrill ride of a novel that peeks behind the white picket fences of suburbia, The Innocent is at once a twisting, turning, emotionally charged story and a compelling tale of the choices we make and the repercussions that never leave.\\n","cover":"https://allnovel.net/images/the-innocent.jpg","author":"Harlan Coben","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-innocent.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:19:16 PM"}}
