{"id":108543,"no":65,"title":"Page 65","content":"YOUR NAME IS MATT HUNTER. A year has passed. Lance Banner has apologized to you. For several months Lance remains wary, but then one day, at a neighborhood barbecue, he asks you to be his assistant basketball coach. Your nephew, Paul, Lance reminds you with a slap on the back, is on the team too. So what do you say? You say yes. You bought the house in Livingston, after all. You work out of it now, consulting on legal matters for Carter Sturgis. Ike Kier is by far your biggest client. He pays you well. All charges against Cingle Shaker were dropped. Cingle has opened her own private investigation agency called Cingler Service. Ike Kier and Carter Sturgis throw all the business they can her way. She has three investigators working for her now. Your sister-in-law, Marsha, is now serious with a man named Ed Essey. Ed works in manufacturing. You really don\u0027t understand what he does. They plan on marrying soon. He seems nice, this Ed guy. You try to like him, but you can\u0027t. He loves Marsha though. He will take care of her. He will probably be the only father Paul and Ethan will remember. They\u0027ll be too young to remember Bernie. Maybe that\u0027s how it should be, but it kills you. You will always try to be a presence in their lives, but you will become simply an uncle. Paul and Ethan will run to Ed first. Last time you were in the house, you looked for the picture of Bernie on the refrigerator. It was still there, but it\u0027s buried under more recent photographs and report cards and artwork. You never hear from Sonya or Clark McGrath again. Their son, Stephen, still visits you sometimes. Not as much as he used to. And sometimes you\u0027re even glad to see him. After you close on the new house, Loren Muse comes over. The two of you sit in the backyard with Corona beers. \"Back in Livingston,\" she says. \"Yep.\" \"Happy?\" \"Towns don\u0027t make you happy, Loren.\" She nods. There is still something hanging over your head. \"What\u0027s going to happen to Olivia?\" you ask. Loren reaches into her pocket and pulls out an envelope. \"Nothing.\" \"What\u0027s that?\" \"A letter from Sister Mary Rose nee Emma Lemay. Mother Katherine gave it to me.\" You sit up. She hands it to you. You start to read it. \"Emma Lemay put it all on herself,\" Loren tells you. \"She and she alone killed Clyde Rangor. She and she alone hid his body. She and she alone lied to the authorities about the identity of the murder victim. She claimed Candace Potter didn\u0027t know anything about it. There\u0027s more, but that\u0027s the gist.\" \"You think that will wash?\" Loren shrugs. \"Who\u0027s to say otherwise?\" \"Thank you,\" you say. Loren nods. She puts down her beer and sits up. \"Now, you want to tell me about those phone records, Matt?\" \"No.\" \"You think I don\u0027t know who Darrow spoke to in Westport, Connecticut.\" \"Doesn\u0027t matter. You can\u0027t prove anything.\" \"You don\u0027t know that. McGrath probably sent him money. There could be a trail.\" \"Let it go, Loren.\" \"Wanting revenge is not a defense.\" \"Let it go.\" She picks the beer back up. \"I don\u0027t need your approval.\" \"True.\" Loren looks off. \"If Kyra had just told Olivia the truth in the beginning-\" \"They\u0027d probably all be dead.\" \"What makes you say that?\" \"Emma Lemay\u0027s phone call. She told Kyra to stay silent. And I think she had a good reason.\" \"That being?\" \"I think Emma- or Sister Mary Rose- knew that they were getting close.\" \"You saying Lemay took the hit for all of them?\" You shrug. You wonder how they found Lemay and Lemay alone. You wonder why Lemay, if she suspected something, didn\u0027t run. You wonder how she stood up to their torture and never gave Olivia away. Maybe Lemay figured one last sacrifice would end it. She wouldn\u0027t have known they\u0027d post something about the adoption. She probably figured that she was the only link. And if that link was permanently broken- especially by force- there\u0027d be no way to find Olivia. But you\u0027ll never know for sure. Loren looks off again. \"Back in Livingston,\" she says. You both shake your head. You both sip your beers. Over the course of the year Loren visits every once in a while. If the weather is cooperating, you two sit outside. The sun is high on that day a year later. You and Loren are sprawled out in lawn chairs. You both have Sol beers. Loren tells you that they\u0027re better than Coronas. You take a sip and agree. As always, Loren looks around and shakes her head and says her usual refrain: \"Back in Livingston.\" You are in your backyard. Your wife Olivia is there, planting a flower bed. Your son Benjamin is on a mat next to her. Ben is three months old. He is making a happy cooing noise. You can hear it all the way across the yard. Kyra is in the garden too, helping her mother. She has been living with you for a year now. She plans on staying until she graduates. So you, Matt Hunter, look at them. All three of them. Olivia feels your eyes on her. She looks up and smiles. So does Kyra. Your son makes another cooing noise. You feel the lightness in your chest. \"Yeah,\" you say to Loren with a silly grin on your face. \"Back in Livingston.\"","sourceLink":"https://allnovel.net/the-innocent/page-65.html","bookId":1557,"book":{"id":1557,"title":"The Innocent","description":"Storyline: You never meant to kill him…. One night, Matt Hunter innocently tried to break up a fight—and ended up a killer. Now, nine years later, he’s an ex-con who takes nothing for granted. His wife, Olivia, is pregnant, and the two of them are closing on their dream house. But all it will take is one shocking, inexplicable call from Olivia’s phone to shatter Matt’s life a second time…. An electrifying thrill ride of a novel that peeks behind the white picket fences of suburbia, The Innocent is at once a twisting, turning, emotionally charged story and a compelling tale of the choices we make and the repercussions that never leave.","cover":"https://allnovel.net/images/the-innocent.jpg","author":"Harlan Coben","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-innocent.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:19:16 PM"}}
