{"id":83883,"no":1,"title":"Page 1","content":"Chapter 1\n Rain slashed against the windscreen ofJackson\u0027s car wit fierce intensity. Aware of the dangers inherent in the dark winter\u0027s night, he kept the speed of his powerful car well under control, watching out for reckless pedestrians.\n However, in sharp contrast to the usual Friday night crowds, there was an almost deserted air about the brightly lit centre ofAuckland. He knew it was illusionary. The revelers were there but hidden in soundproofed, weatherproofed basements and upstairs rooms, full of pumping music that drowned out the driving rain. He\u0027d passed one such room on his way out of his studio office. It had been the site of a wrap party for a murder drama.\n A reed-thin blonde had caught him leaving the building and invited him to join in. Her eyes had been frank with invitation for a much more private party. Unfortunately for her ambition, he didn\u0027t play those kinds of games, and ever since Bonnie, blondes held about as much appeal as arsenic.\n After the day he\u0027d had, all he wanted was some cognac and a hot bath.Taylorlooked like she could do with both. The poor baby was standing outside in the icy rain, waiting for a bus, her face pinched with cold. She could probably do with a hot man in bed as well but...\n Taylor?\n Standing in the pouring rain under a barely glowing streetlight, shivering and blue?\n \"Dio!\"He screeched to a stop and then backed up, thanking God for the lack of traffic. As soon as he reached her, he leaned across and threw open the passenger door. \"Get the hell in!\" The weather obliged, butTaylordidn\u0027t.\n The sodden woman outside made a face, as if debating whether to take his less than warm offer.\n Needle-sharp rain continued to pelt her, hard and certainly painful, even through the thick wool of her pantsuit. \"The bus is supposed to come any m-m-m-minute.\"\n Her chattering teeth enragedJackson. For a second, he thought he saw fear in those big eyes of hers but it had to have been a trick of the light. He\u0027d never met a woman less afraid of him than this bedraggled creature. \"Get in here right now,Taylor.\"\n She looked like she was going to be obstinate, but then the universe took pity on him. It started to hail.\n With a tiny shriek that was undeniably feminine, she scrambled into the car and pulled the door shut. Her trembling hands immediately went to the warm air circulating from the ventilation shafts.\n He turned up the heat before pulling away from the curb to make a right turn instead of going left.Taylor lived on the opposite side of the city from him. Outside, the night had become immeasurably darker, but the hailstorm petered away after a short but brutal reign.\n \"I\u0027m wet ... your car...\"Taylorbegan, through lips that were blue with cold.\n He was furious with her. \"It\u0027ll dry.\" A plume of water from a passing motorist momentarily blanketed the windscreen in sleet. He slowed to a crawl until the vehicle had passed, taking the chance to send a glare Taylor\u0027s way. \"What the hell were you doing catching a bus at this time of night?\" His voice was a lacerating whip. How dare she put herself in such a vulnerable position?\n \"None of your b-b-business.\" The sound of chattering teeth destroyed her attempt at a haughty dismissal.\n \"Taylor,\"he warned, in a tone that he only used when his temper was on the thinnest edge, as she very well knew.\n \"You\u0027re not my boss anymore, so don\u0027tTaylorme.\" His passenger\u0027s unrepentant stubbornness was a living being in the air around them.\n Jacksonwas used to being obeyed, especially by pretty young women. Everyone loved the man who could get them onto the silver screen, though he remembered vividly thatTaylorharbored no such ambition. He also recalled the steely spine beneath that beautiful exterior. Aware that the more he demanded, the more obstinate she\u0027d become, he tried a calmer approach. \"I\u0027m being a Good Samaritan.\n Humor me.\"\n She didn\u0027t say anything for a while but he figured that was because she was thawing out. When she finally spoke, what she revealed made his blood boil. All thoughts of calming down were consigned to the deepest hell.\n \"My ride wanted more than I did. I left.\" Out of the corner of his eye, he could see her huddling into the seat. The small sign of vulnerability tore at him. All of his protective instincts awoke fully armed.\n \"Did he hurt you?\" His hands had turned into claws on the steering wheel.\n A pause. \"No.\"\n \"Taylor.\"\n \"Don\u0027tTaylorme!\" she cried again, but her voice broke at the end - another uncharacteristic sign of weakness. \"He was a bozo.\" She sniffed. \"I thought he was someone I could trust. We were at a party on the Shore thrown byDracena Medical - the place where I\u0027ve been temping for the past three months.\n My contract ended yesterday, but they invited me to the party anyway. When it began to break up, one of the project directors offered a few of us a ride home. I didn\u0027t realize that I was going to be the last one left in the car until it was too late.\" She was babbling, betraying her fear even as she tried to convince him of the lightness of the matter.\n \"I\u0027d never have gone with him otherwise. I thought I\u0027d get dropped off first because the others live farther out, but apparently, they\u0027d all decided to get off in the city and go dancing. He didn\u0027t tell me that. I still thought it would be okay until ... well, as soon as the others left, he started talking about ... s-spending the night with me.\"\n Jacksonbecame quietly murderous at the evidence of this man\u0027s predetermination to get her alone. \"Did he hurt you?\" he repeated, knowing that she\u0027d told him the truth about why she\u0027d accepted the ride. He\u0027d long ago learned of her wariness around most men.\n She mumbled something under her breath.\n \"Did. He. Hurt. You?\" He was ruthless, aware that her emotional state made her susceptible to questioning. Freed from the constraints which had forced him to keep his distance in the past, he would protect her with every breath in his body. \"Answer me.\"\n \"He ripped my shirtsleeve when I was leaving the car. And he\u0027s got my purse. No big deal,\" she muttered.\n A wave of red rose in front of his eyes. \"Name?\"Taylorhad always touched the deepest, most primitive part of him. Tonight, that part was beyond furious.\n \"Jackson, I...\" She sounded hesitant.\n \"Name?\" The night outside wasn\u0027t as dark as his thoughts about the man who\u0027d dared to assault her.\n \"Why?\" The question was far more confident, his stubborn, temperamentalTaylorrising back from the upsetting experience.\n He gave her an imminently reasonable answer. \"How else are you going to get your purse back?\"\n \"You\u0027re, um ... not going to mess him up are you?\"\n \"What do you think I am - some sort of mobster?\" He was well aware that he looked like one. Big, dark and thickly muscled. Half of that was genetics. Being part Italian and part Viking tended to do that to a man. The other half was nightmares. Exercise took his mind off them. Add his black hair and eyes and he could easily pass for one of themafioso .\n \"Maybe.\" She didn\u0027t sound timid, as one should while conversing with a mobster.\n \"I\u0027ll just pick up your purse. No problem,\" he lied. This creep was going to have major problems.\n \"Promise you won\u0027t hurt him first.\"\n \"Why?\" The thought that this might\u0027ve been just a lovers\u0027 quarrel rocked him. Pain squeezed his gut at the idea of her wrapped in another man\u0027s arms. Blinded and numbed by the horrifying revelation after Bonnie\u0027s death more than a year ago, had he left his pursuit ofTaylortoo late?\n \"Because I don\u0027t want you in trouble.\"\n The relief he felt at her response should have shocked him. \"Tell me his name.\"\n \"Promise first or I won\u0027t say.\" She folded her arms. The smell of wet wool rose into the air.\n He swore under his breath, well aware that she was mule-headed enough to do exactly that. \"I promise not to touch him,\" he gritted out.\n Deprived of his preferred form of revenge, he accepted that the man could be taught a lesson in another way. He knew a few men whom he could count on to do what was right, and one of them was a detective in sex crimes.\n There was silence from the recalcitrant woman in the passenger seat, as if she was debating whether or not to trust his promise. At last, she sighed. \"Donald Carson.\"\n He nodded, absurdly pleased that his word was good enough for her. \"Are you warm yet?\" He was beginning to overheat, but she\u0027d been soaking. She needed to get out of those wet clothes but he wasn\u0027t going to make that insane suggestion. Being alone with a nakedTaylorwas not the best of ideas.\n Especially when the primitive side of his nature was blazing with the need to brand her with his mark.\n \"Getting there.\" Her voice was soft, unintentionally stoking the hunger inside of him.\n Desire burned through the anger, turning his voice rough. \"There is a picnic blanket in the back seat.\" He was aware that the cadence of his speech was changing, as his long-dormant instincts awoke. It was a habit that betrayed too much, and he made a concerted effort to rein it in.\n He heard her move. \"It\u0027s still in the plastic wrap.\"\n \"It was part of a gift. I threw it back there months ago.\" Rain pounded the windscreen as he drove out into a particularly unsheltered part of the road. \"You still live in New Lynn?\" He named a suburb about thirty minutes out ofNew Zealand\u0027s biggest city, under normal circumstances.\n \"Uh-huh.\" Her voice was muffled.\n When he chanced a quick glance, he saw that only her bright little face remained uncovered by the woolen blanket. With long black hair beginning to curl in the heat, and thickly lashed blue eyes smudged with tiredness, she looked like a bedraggled and bad-tempered kitten.\n And he wanted to scoop her up into his lap and kiss and cuddle her until she melted for him.\n His reaction toTaylorwent against all of the vows he\u0027d made after he\u0027d found out the terrible revenge Bonnie had taken on him for leaving her. Standing over his estranged wife\u0027s grave, he\u0027d sworn to never again let a woman close enough to wound him so terribly. At that moment, while his heart felt like it had been ripped from his chest to lie torn and bleeding on the crying earth, such a vow had been easy to make. \n","sourceLink":"https://allnovel.net/awaken-to-pleasure/page-1.html","bookId":1881,"book":{"id":1881,"title":"Awaken To Pleasure","description":"Storyline: \n \"WHAT WOULD YOU SAY TO MARRYING ME?\" \n The proposal was as unexpected as her feelings for the man whose dark good looks rivaled an even darker past. Painful experience screamed that Taylor Reid should run far and fast from Jackson Santorini. But keeping custody of her brother meant becoming her former boss\u0027s bride. \n And giving Jackson a baby. \n Despite his powerful size and presence, Jackson had been wounded...deeply...by a woman. Yet he\u0027d protected her at a personal cost, if his restrained ardor in deference to her virginal apprehension was one indication. Suddenly, for Jackson\u0027s sake, Taylor wanted to replace pain with pleasure. Only, she\u0027d never imagined what sensations--and secrets--she would awaken....\n \n","cover":"https://allnovel.net/images/awaken-to-pleasure.jpg","author":"Nalini Singh","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/awaken-to-pleasure.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:54:41 PM"}}
