{"id":83893,"no":11,"title":"Page 11","content":"\"He has to know. And we have to see how he reacts to me.\" Taking the bag she\u0027d packed in anticipation of spending the night before the wedding at his house,Jacksontouched her on her lower back, a subtle pressure that reminded her she now belonged to him. Her feelings of confusion intensified but she didn\u0027t move away, because whileJacksonmight be the most disturbing thing in her life, he was also the safest. \"I don\u0027t want him to know why we\u0027re marrying.\" She couldn\u0027t bear it if Nick thought she was sacrificing something for him, because she wasn\u0027t. \"I agree.\" As they drove to the school.Jacksonsaid, \"Don\u0027t worry. He\u0027s met me before so it won\u0027t be a total surprise.\" The fleeting touch on her cheek was unexpected but welcome. Dutifully chaperoned by his camp counselor, her brother was waiting for them by the gate. When the sleek black Mercedes stopped in front of him, she saw his eyes widen. She stepped out and feltJackson follow. While she went to hug Nick, after thanking the counselor, he picked up her brother\u0027s bags and dumped them in the trunk. After a quick hug that apparently embarrassed him from the speed with which he pulled away, Nick looked up at the man beside her. \"Hi,Jackson.\" \"Nick.\" Nick was a smart boy. He looked from her toJackson. \"What?\" Speculation turned his blue eyes sky-bright. Taylordidn\u0027t want to tell him right now but realized that she didn\u0027t really have a choice. \"What would you say if I told you that ... me and Jackson...\" Nick started to grin. \"Are you gonna marry my sister?\" Her jaw dropped. \"How did you know that?\" The boy shrugged. \"I dunno. \u0027CauseJacksonlikes you?\" Flustered, she looked at Jackson, who just said, \"Smart kid. Jump in the car - we\u0027ll talk on the way.\" Nick scrambled in, already asking his first question. \"Are we going to live with you?\" \"Yes.\"Jacksonanswered. A short silence. \"Will I always stay with you?\" Taylorfrowned, not understanding. ButJacksonevidently did. Stopping the car at the side of the street, he looked over his shoulder. \"Yes. I went to boarding school and I would never send a child of mine there.\" \"But I\u0027m not yours.\" Taylor\u0027s heart clenched at that quiet statement. Her instinct was to reassure him but she remained silent, aware that something important was happening between the solemn, ten-year-old and the charismatic man in the driver\u0027s seat. \"You are now.\" There was no arguing withJackson\u0027s decisive statement. He turned and restarted the car. Nick was quiet for a longtime. Then he said, \"Will I have my own room like I do now?\" \"Sure. You can\u0027t sleep with us, after all.\"Jacksongrinned in the rearview mirror. \"You can have one of the two big first floor bedrooms. We\u0027ll be on the second floor.\" Meanwhile,Taylor\u0027s stomach went into freefall. He\u0027d said \"us.\" Did he expect her to have sex with him from the start in spite of everything? The idea of being with him wasn\u0027t abhorrent, had never been so. It was the fact that she knew she\u0027d freeze up and he\u0027d hate her for it. Once at the apartment, she sent Nick off to pack enough fresh clothes to see him through to the wedding. Jacksoncame to stand in front of her. \"Something\u0027s bothering you.\" His body language conveyed that he wasn\u0027t moving until she confided in him. She swallowed and decided to be blunt. \"Are we going to be sharing a bedroom?\" His mouth thinned. \"I won\u0027t go back on my word,Taylor. You may not have noticed, but my bedroom is part of a suite. It\u0027s internally connected to a smaller bedroom. You can use that. Nick will never know.\" \"I hadn\u0027t considered what he\u0027d think if we were in separate bedrooms.\" She was flustered, used to providing everything for her brother\u0027s happiness. Jacksontook her hand in his, his dark gaze trapping hers. \"You can\u0027t think of everything. Learn to depend on me a little. We males like to be needed.\" \"I\u0027m depending on you a great deal.\" The strong lines of his face were suddenly sharper. \"Do not just depend on me as someone powerful, but also as a man. As your husband. You are now in my care.\" His rough declaration made her eyes widen in surprise. \"Taylor! I don\u0027t have a suit for your wedding.\" Nick barreled out of his room. Worry stamped his face. Jacksonreached out and tousled his jet-black hair. \"I\u0027ve ordered you a tux. If you\u0027re ready, let\u0027s head home.\" Nick\u0027s smile strengthenedTaylor\u0027s resolve. She\u0027d do anything for her brother. And, she thought, a little shocked, she\u0027d do anything to keep a smile onJackson\u0027s face, too. She would not hurt him by withholding herself - he understood her fear but it was a rejection all the same, telling him that she didn\u0027t trust him. If she couldn\u0027t trust her body withJackson, who could she trust? It was a startling insight. That day was a whirlwind of activity. With Nick tagging along quietly,Taylorwent to work withJackson, helping him organize matters so that the studios could temporarily function without him at the helm. After lunch, she left to meet Maggie, the therapist she\u0027d agreed to see. To her surprise, she found herself comfortable with the older woman who welcomed her into her office. When she returned to the studios,Jacksonsimply asked, \"So?\" \"I like her. It might work.\" Giving her a smile,Jacksonwent back to work and after checking on Nick, she continued to assist him. They\u0027d agreed to leave town for a few days on the pretext of a honeymoon, so that Lance would have no room to ask awkward questions about their marriage. As Nick was now on vacation, it was decided that he\u0027d spend the time out on a farm, with a friend of his who\u0027d moved out of the city. \"I want to take him with us, but I know we have to give the impression of being on a honeymoon,\"Taylor said, late that night. She was pacing in front of the sofa, whileJacksonstood by the window, back to the night, cognac in hand. The amber liquid sparkled through the crystal snifter, momentarily catching her gaze. \"I\u0027ve missed him so much. I don\u0027t know if they\u0027ll take care of him out on the farm.\" \"You\u0027re overprotective.\"Jackson\u0027s quiet declaration stopped hermidpace . Shocked, she clenched her fists. Her temper ignited. \"What would you know about bringing up a child?\" She thought pain flickered over the rugged beauty of his face but his tone was calm. \"I was a boy at one stage.\" \"And you think that gives you the right to tell me how to raise Nick?\" Just because he was helping her keep her brother didn\u0027t mean he could dictate to her. \"No. What gives me the right is that I can see he\u0027s unhappy and that he\u0027ll never say anything to you, because he loves you too much.\" An arrow to her heart would have done less damage. \"Unhappy?\" she whispered. \"He\u0027s been getting bullied for being a sissy.\" \"How do you know? He just got back from camp.\" \"He told me while you were having a bath - he couldn\u0027t hide it after I saw the bruise on his leg.\" \"What!\" she cried, fighting the urge to wake Nick and check up onhim. \"Who? I\u0027ll kill them.\" \"That\u0027s just the problem.\" \"Why didn\u0027t he tell me? What\u0027s the problem?\" She couldn\u0027t bear to think of her sweet baby brother being bullied. Why hadn\u0027t he trusted her with this? Why had he toldJackson, whom he hardly knew? \"You\u0027re always sticking up for him. Even at school.\" \"You wouldn\u0027t know, but that\u0027s what elder siblings do.\" Her hurt made her cruel. \"You don\u0027t even know where your sister is at the moment.\" Jacksondidn\u0027t blink but she knew him well enough to know that her barb had found its target. The skin over his cheekbones tightened and he looked away from her and over the water vista out the window. The night was peaceful and the water moved in gentle symphony, but inside, she felt like she was crashing and burning. His hurt pained her. \"I\u0027m sorry,\" she whispered, meaning it. \"It doesn\u0027t matter.\" Heshrugged, shoulders taut under the blue shirt. JacksonSantorini , she remembered, was used to being hurt. His wife had torn into his pride and the world had lapped up his suffering. She even knew that his family never contacted him except to complain or ask for something. No wonder he didn\u0027t keep in touch. It had only been her own feelings of inadequacy at having let her brother down that had made her strike out. She wanted to kick herself. \"Yes, it does.\" Walking over, she touched her hand to his back and rested her head against his thickly muscled arm. \"I hurt you. And I despise myself for it, for taking out my frustration on you.\" He put his drink on the windowsill and slipped his arm around her. \"You know something?\" Relieved that he wasn\u0027t holding a grudge, she said, \"What?\" \"I think you\u0027re the first person I\u0027ve ever met who really means they\u0027re sorry when they say so.\" And she knew she was forgiven. \"I do. So don\u0027t be angry. I know what yourfamily\u0027s like, and I don\u0027t blame you for keeping them at a distance. It just makes me crazy to know that Nick\u0027s being hurt.\" \"I showed him some moves.\" Her brows furrowed. \"Moves?\" \"Self-defense.\" She bit her lip. Nick had kept something else from her. Once, he\u0027d shared every new experience. \"And?\" \"He\u0027s a natural.\" \"But he\u0027s not very physical.\" \"He\u0027s never had a chance to be.\" He hugged her tight, as if aware that this was hurting her. \"Trust him, Taylor. He\u0027s an extraordinary boy.\" She heard the affection in his tone and knew that he meant it. \"I hate it when he\u0027s hurting. I hate it!\" \"Iknow, cara mia .\"Theendearment made her want to reach up and kiss him. \"Let me help.\" Her instincts rebelled. She was used to looking out for Nick on her own. But, though it was a painful concession, she acknowledged that over the past year, his needs had changed in a way she couldn\u0027t fulfill.","sourceLink":"https://allnovel.net/awaken-to-pleasure/page-11.html","bookId":1881,"book":{"id":1881,"title":"Awaken To Pleasure","description":"Storyline: \"WHAT WOULD YOU SAY TO MARRYING ME?\" The proposal was as unexpected as her feelings for the man whose dark good looks rivaled an even darker past. Painful experience screamed that Taylor Reid should run far and fast from Jackson Santorini. But keeping custody of her brother meant becoming her former boss\u0027s bride. And giving Jackson a baby. Despite his powerful size and presence, Jackson had been wounded...deeply...by a woman. Yet he\u0027d protected her at a personal cost, if his restrained ardor in deference to her virginal apprehension was one indication. Suddenly, for Jackson\u0027s sake, Taylor wanted to replace pain with pleasure. Only, she\u0027d never imagined what sensations--and secrets--she would awaken....","cover":"https://allnovel.net/images/awaken-to-pleasure.jpg","author":"Nalini Singh","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/awaken-to-pleasure.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:54:41 PM"}}
