{"id":83900,"no":18,"title":"Page 18","content":"\n She sat up in his lap, both arms around his neck, breasts grazing his chest. It took every ounce of self-control he had not to lower his head and suck a nipple into his mouth. He could almost feel the succulent flesh against histongue, almost taste the uniqueness that was her. \"I don\u0027t have any practical experience. I thought you\u0027d like to be in charge this time around.\"\n So serious, so solemn, like she was learning a lesson in school,Taylor\u0027s very innocence gave him the reins he needed to leash his escalating hunger. As a young man, he\u0027d had very earthy appetites. He\u0027d forcibly caged that part of his psyche for years, but when he\u0027d seenTayloron that rainy night, it had shattered the chains and stretched awake. It had been gaining in power over the past week and tonight, he knew it would storm him. Before that happened, he needed to have her trust. Otherwise, he thought darkly, the strength of his passion could devastate her.\n \"I\u0027m afraid of hurting you,\" he admitted. He ran the hand on her thigh up her side. Her skin was so smooth and silky that he just wanted to lay her down and indulge himself in her body. Tugging her hand off his shoulder, he pressed his palm against hers. \"I\u0027m so much bigger than you.\" Their differences were graphically illustrated by the way his hand dwarfed hers.\n Eyes wide, she stared and then carefully intertwined her fingers through his. Pulling their clasped hands to her lips, she kissed his knuckles one by one, her lips velvety on his skin. The tenderness of the caress shook him. Biting sensual need was overlaid with a painfully soft emotion. No woman had ever touched him like that. As if she was afraid of hurting him.\n \"Cara.\"He released her hand and returned his to her curvy hip. \"I want to give you only pleasure. Tell me what would pleasure you, my little wife.\"\n \"I\u0027m not little.\" She glared and pushed her hands into his hair. \"Well, only next to you.\"\n \"I\u0027m the only one who matters.\" He kissed her once more, loving the taste of her. \"What do you like?\n This?\" He moved his thumb on her thigh again.\n \"Yes.\" It was a whisper against his lips.\n \"This?\" He reluctantly left her lips to press kisses along the tops of her breasts. He was careful to use only his mouth to caress her, aware that she had come to associate male hands on her breasts with pain.\n \"Oh, yes. Can you...\"\n He raised his head, the barbarian maleness within him scenting victory within his grasp. \"Yes, piccola?\"\n Blushing, she shook her head. \"No, it\u0027s okay.\"\n \"Tell me. I don\u0027t want to be a brute.\" He deliberately played up his helplessness. He was floundering, not wanting to scare her, but he also knew that for some reason he would never understand, his little wife was insanely protective of him.\n \"You\u0027re not!\" She frowned at him, fingers digging into his flesh. \"Don\u0027t you ever let anyone call youthat. \"\n He bit back his smile to nibble at her lips. \"Tell me then. What would you like?\"\n She looked down and then back up. Her cheeks were pink. Dressed in strips of delicate black lace, she was sexy innocence personified. \"I just wondered...\"\n \"Yes.\" He cradled her nearer, pressing her against the heat of his body. The pressure of her full breasts on his chest pushed him one step closer to insanity.\n She snuggled impossibly closer. \"You know how I like to touch you?\"\n Did he know? He\u0027d never been as aroused as he\u0027d been last night. \"Yes.\" It came out a rough growl.\n \"Um ... I thought since you liked it so much and I liked doing it ... I thought it might work in reverse.\"\n Crazed with desire, it took him a few seconds to understand. He buried his face in her hair, trying to relearn to breathe. The scent of her twined around him, turning up the heat several degrees. He burned.\n For her.\n \"No?\" A faint whisper. \"You wouldn\u0027t like that?\"\n Raising his head, he kissed her hard. \"Like it? I feel like all my Christmases have come at once.\"\n Her lips parted in surprise. \"Why?\"\n He smiled, finding his footing again. \"Because you\u0027re going to let me touch you.\" He stroked his hands to clasp her waist. \"Kiss you.\" He pressed his lips against her jaw. \"Fondle you.\" He ran one hand boldly to her breast and closed over it very, very gently, shocking a gasp out of her. \"And do anything else I please.\" Grinning, he kicked off his shoes,then put her on the bed, lying down beside her, propped up on one elbow. \"Can I touch you anywhere?\"\n Wide-eyed, she nodded. \"It only seems fair.\"\n Chuckling, he put one hand on her stomach. \"Do you like everything I\u0027ve done so far?\"\n Her immediate nod made him grin.\n \"What did you like best?\" He leaned close, giving her the intimacy she needed to make her sensual requests.\n She swallowed but said, \"Your hands on me.\"\n He fought off a shudder. \"In that case...\" Moving the hand on her stomach, he brought it to her garter belt. \"Can I take this off?\"\n \"I can...\" she began to offer, reaching between their bodies. Her knuckles brushed his abdomen and he had to bite back the demand that she move lower.\n \"I want to.\" After a little fumbling, he flicked open the catches holding the entire contraption together.\n Pulling it off her, he threw it aside. Now, his pretty little wife was dressed only in barely there panties and lace-topped black stockings.\n He saw her swallow. Her eyes fluttered shut. It was just as well that she wasn\u0027t looking, because he was sure that the lust in his eyes would\u0027ve scared his sexyTaylor. His teeth-gritting control after she\u0027d first stripped had flown out the window with the garter belt.\n He\u0027d known that she had lush breasts, just right for his big hands, but he\u0027d never thought that they\u0027d be so delicate, traced with blue veins and translucent skin. He could spend hours adoring those breasts, topped with coral-colored nipples that peaked for him when he touched them with the tip of one finger.\n \"Oh!\"Taylor\u0027s body arched and her eyes opened.\n Looking up, he held her gaze as he closed a hand over her left breast. It was time she learned to associate pleasure with this particular man\u0027s hands on her. Because he intended to have them there on a regular basis.\n Her body went taut. Her heartbeat accelerated.\n \"Breathe,\" he instructed.\n \"I can\u0027t, not when you\u0027re doing that!\" She sucked in a breath, giving lie to her declaration. \"That feels ...\n good.\" Her surprised words trailed off into a moan as he began to massage her sensitive flesh. \"Jackson, please don\u0027t stop.\"\n He had to bite back a smile of satisfaction at the little victory. \"Try and make me.\" He played with her breasts untila sheen of perspiration covered her body, a fine layer that made her skin shimmer. He thanked God that she hadn\u0027t thought to ask for the lights to be turned off. The sight of her long-limbed, luscious body coming to life for him was indescribable. Her nipples were very sensitive - a touch and she whimpered, a rub and shegasped, a squeeze and her entire body went taut.\n When she was moaning, needy without knowing what she searched for, he leaned down and took one pouting nipple into his mouth and suckled. Hard. Her body shuddered. Against her, he smiled in satisfaction and moved to her neglected breast. He wasn\u0027t going to be merciful and let her rest. Not when he could feel his own need trying to buck the reins. Another wave of shudders rippled through her. Her hands clutched at his body, desperately trying to find an anchor.\n Using his teeth to hold it for a moment, he finally released her nipple, sending tiny shock waves through her limp body. While she was half-dazed, he got rid of the rest of his clothing and took care of protection. She\u0027d barely risen through the pleasure-fog when he rejoined her.\n There was no fear in her eyes, nothing but surprised joy and welcome. For him. Certain of her acquiescence, he ran his hand down her stomach to the satin and lace protecting her core. Wet heat met his cupping hand. The wild hunger in him came within sniffing distance of freedom. He pressed his fingers against her, pushing her toward another precipice. Blue eyes, almost blind with desire, opened.\n \"Jackson...\" She sounded lost.\n He moved over her, careful not to scare her with his weight, but she relaxed at the touch of his body.\n Arms around him, she parted her legs. The trust implicit in the action shook him. Sliding one hand under her neck, he tangled his fingers in her hair and lifted her head for a kiss that was lusty and wild and erotic.\n She reciprocated stroke for stroke, meeting his demands and making her own, her breasts pressing against the crisp hair on his chest. With his other hand, he continued to stroke her through her panties, assuaging the need he\u0027d aroused.\n Possessive need roared through him when she squirmed under him. She was his . No other man had ever touched her like he was touching her. And, he vowed, no other man ever would. A yearbe damned.\n Child or not, TaylorSantorini was never going to be allowed to leave her husband.\n The sensation ofJackson\u0027s crisp, black hair against her breasts renderedTayloralmost insensate with bliss. All these years, she\u0027d associated shame with her breasts. After tonight, if she survived, she\u0027d think only of the pure heat inJackson\u0027s eyes as he\u0027d indulged himself. After his attentive loving, her flesh was incredibly tender. Hardly knowing what she was doing, she rubbed herself against him and heard him groan, deep inside. The hand between her legs was removed.\n She ripped her lips from his and said, \"No! Come back!\" and surprised herself with her own boldness.\n Twenty-four years of sexual starvation had made her voracious. AndJackson\u0027s tenderness had made her daring. The joy she felt was overwhelming.\n He growled at her as if he was almost over the edge, and kissed her again. When she felt close to mindless, he pushed her down into the pillow and she felt his big hand slipping under one side of her panties. She was puzzled by the action for only a second because by then he\u0027d ripped the fragile material from her body. Then he did as she\u0027d asked and cupped her again. Except this time there was no barrier between her most sensitive place and his big, possessive hand. Or his fingers. \n","sourceLink":"https://allnovel.net/awaken-to-pleasure/page-18.html","bookId":1881,"book":{"id":1881,"title":"Awaken To Pleasure","description":"Storyline: \n \"WHAT WOULD YOU SAY TO MARRYING ME?\" \n The proposal was as unexpected as her feelings for the man whose dark good looks rivaled an even darker past. Painful experience screamed that Taylor Reid should run far and fast from Jackson Santorini. But keeping custody of her brother meant becoming her former boss\u0027s bride. \n And giving Jackson a baby. \n Despite his powerful size and presence, Jackson had been wounded...deeply...by a woman. Yet he\u0027d protected her at a personal cost, if his restrained ardor in deference to her virginal apprehension was one indication. Suddenly, for Jackson\u0027s sake, Taylor wanted to replace pain with pleasure. Only, she\u0027d never imagined what sensations--and secrets--she would awaken....\n \n","cover":"https://allnovel.net/images/awaken-to-pleasure.jpg","author":"Nalini Singh","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/awaken-to-pleasure.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:54:41 PM"}}
