{"id":37272,"no":6,"title":"CHAPTER V TWO DAYS WITH BRABAZON (continued)","content":"Camp before Dewetsdorp: April 22. Whether I am to see the white cliffs of Dover again I know not, nor will I attempt to predict. But it seems that my fortunes in this land are to be a succession of adventures and escapes, any one of which would suffice for a personal experience of the campaign. I acquit myself of all desire to seek for these. Indeed, I have zealously tried to avoid all danger except what must attend a War Correspondent\u0027s precarious existence. This I recognise as a necessary evil, for the lot of the writer in the field is a hard and heavy one. \u0027All the danger of war and one-half per cent. the glory\u0027: such is our motto, and that is the reason why we expect large salaries. But these hazards swoop on me out of a cloudless sky, and that I have hitherto come unscathed through them, while it fills my heart with thankfulness to God for His mercies, makes me wonder why I must be so often thrust to the brink and then withdrawn. However, I will tell the tale of the doings of the Army, and what happened to me shall fill its proper place, so that the reader may himself be the judge of the matter. The night of the 20th passed quietly, but the Boers were awake with the sunrise and saluted us with discharges of the \u0027pom-pom,\u0027 which, as far as I could see, did no harm to anyone. We could not press the attack on the previous day because the Infantry were tired out and the enemy\u0027s position of sufficient natural strength to make an assault a serious business. In the night the Dutchmen had been busy, and the black lines of entrenchments marked the hill-sides. When I inquired whether there would be a battle or not that day, staff officers pointed over the veldt to a column of dust which was coming slowly nearer. General Campbell, with three battalions (including two of her Majesty\u0027s Guards) and a battery, was marching to join the main column. It was necessary, in view of the entrenchments and the approaching reinforcements, to wait until the force was complete. The event would be decided on the morrow, and meanwhile Brabazon and the mounted troops--Cavalry, I shall call them--were to make a reconnaissance of the Boer left. The brigade, which included the Mounted Infantry, and was about a thousand strong, moved southward behind the outpost line and, making a rapid and wide circuit, soon came on the enemy\u0027s left flank. Here we waited while patrols were pushed out and while Brabazon was clearing his own right by a still wider turning movement. The patrols soon drew the fire of the Boer pickets, and the rifle shots began to ring out in the clear cool air of the morning. Presently a party of a dozen Boers appeared in the distance, galloping down towards a farm whence they might fire on the gradually advancing Cavalry. The General asked the subaltern in charge of our two guns whether they were within range. The young officer was anxious to try. We watched the experiment with attention. The practice was extremely good. The first shell burst in the middle of the Boer horsemen, who at once spread into a looser formation. The next exploded in front of them, and all the seven shells that were fired fell within measurable distance of someone. For the first time in this war I saw the Boers show what I consider cowardice; for without anyone being killed or wounded the whole party turned back and, abandoning their intention or duty, scurried away to cover behind the long swell of ground over which they had come. The Boer Army in Natal was not thus easily dissuaded from its objects. Meanwhile the flanking movement was in progress, and as the ground to our right was gradually made good and secured by Colonel Sitwell, Brabazon pushed his centre forward until McNeill\u0027s scouts were cantering all over the slopes where the Boers had just been shelled, and hunting such of the enemy as tarried to safer and more remote positions. At last we arrived at the edge of the swell of ground. It fell steeply towards a flat basin, from the middle of which rose a most prominent and peculiar kopje. Invisible behind this was Dewetsdorp. Round it stood Boers, some mounted, some on foot, to the number of about two hundred. Our rapid advance, almost into the heart of their position, had disturbed and alarmed them. They were doubtful whether this was reconnaissance or actual attack. They determined to make certain by making an attempt to outflank the outflanking cavalry; and no sooner had our long-range rifle fire compelled them to take cover behind the hill than a new force, as it seemed, of two hundred rode into the open and passing across our front at a distance of, perhaps, 2,000 yards, made for a white stone kopje on our right. Angus McNeill ran up to the General. \u0027Sir, may we cut them off? I think we can just do it.\u0027 The scouts pricked up their ears. The General reflected. \u0027All right,\u0027 he said, \u0027you may try.\u0027 \u0027Mount, mount, mount, the scouts!\u0027 cried their impetuous officer, scrambling into his saddle. Then, to me, \u0027Come with us, we\u0027ll give you a show now--first-class.\u0027 A few days before, in an unguarded moment, I had promised to follow the fortunes of the scouts for a day. I looked at the Boers, they were nearer to the white stone kopje than we, but, on the other hand, they had the hill to climb, and were probably worse mounted. It might be done, and if it were done--I thought of the affair of Acton Homes--how dearly they would have to pay in that open plain. So, in the interests of the \u0027Morning Post,\u0027 I got on my horse and we all started--forty or fifty scouts, McNeill and I, as fast as we could, by hard spurring, make the horses go. It was from the very beginning a race, and recognised as such by both sides. As we converged I saw the five leading Boers, better mounted than their comrades, outpacing the others in a desperate resolve to secure the coign of vantage. I said, \u0027We cannot do it\u0027; but no one would admit defeat or leave the matter undecided. The rest is exceedingly simple. We arrived at a wire fence 100 yards--to be accurate 120 yards--from the crest of the kopje, dismounted, and, cutting the wire, were about to seize the precious rocks when--as I had seen them in the railway cutting at Frere, grim, hairy and terrible--the heads and shoulders of a dozen Boers appeared; and how many more must be close behind them? There was a queer, almost inexplicable, pause, or perhaps there was no pause at all; but I seem to remember much happening. First the Boers--one fellow with a long, drooping, black beard, and a chocolate-coloured coat, another with a red scarf round his neck. Two scouts cutting the wire fence stupidly. One man taking aim across his horse, and McNeill\u0027s voice, quite steady: \u0027Too late; back to the other kopje. Gallop!\u0027 Then the musketry crashed out, and the \u0027swish\u0027 and \u0027whirr\u0027 of the bullets filled the air. I put my foot in the stirrup. The horse, terrified at the firing, plunged wildly. I tried to spring into the saddle; it turned under the animal\u0027s belly. He broke away, and galloped madly off. Most of the scouts were already 200 yards off. I was alone, dismounted, within the closest range, and a mile at least from cover of any kind. One consolation I had--my pistol. I could not be hunted down unarmed in the open as I had been before. But a disabling wound was the brightest prospect. I turned, and, for the second time in this war, ran for my life on foot from the Boer marksmen, and I thought to myself, \u0027Here at last I take it.\u0027 Suddenly, as I ran, I saw a scout. He came from the left, across my front; a tall man, with skull and crossbones badge, and on a pale horse. Death in Revelation, but life to me. I shouted to him as he passed: \u0027Give me a stirrup.\u0027 To my surprise he stopped at once. \u0027Yes,\u0027 he said, shortly. I ran up to him, did not bungle in the business of mounting, and in a moment found myself behind him on the saddle. Then we rode. I put my arms around him to catch a grip of the mane. My hand became soaked with blood. The horse was hard hit; but, gallant beast, he extended himself nobly. The pursuing bullets piped and whistled--for the range was growing longer--overhead. \u0027Don\u0027t be frightened,\u0027 said my rescuer; \u0027they won\u0027t hit you.\u0027 Then, as I did not reply, \u0027My poor horse, oh, my poor ---- horse; shot with an explosive bullet. The devils! But their hour will come. Oh, my poor horse!\u0027 I said, \u0027Never mind, you\u0027ve saved my life.\u0027 \u0027Ah,\u0027 he rejoined, \u0027but it\u0027s the horse I\u0027m thinking about.\u0027 That was the whole of our conversation. Judging from the number of bullets I heard I did not expect to be hit after the first 500 yards were covered, for a galloping horse is a difficult target, and the Boers were breathless and excited. But it was with a feeling of relief that I turned the corner of the further kopje and found I had thrown double sixes again. The result of the race had been watched with strained attention by the rest of the troops, and from their position they knew that we were beaten before we ever reached the wire fence. They had heard the sudden fierce crackle of musketry and had seen what had passed. All the officers were agreed that the man who pulled up in such a situation to help another was worthy of some honourable distinction. Indeed, I have heard that Trooper Roberts--note the name, which seems familiar in this connection--is to have his claims considered for the Victoria Cross. As to this I will not pronounce, for I feel some diffidence in writing impartially of a man who certainly saved me from a great danger. Well satisfied with my brief experience with the scouts, I returned to General Brabazon. While we had been advancing deeply into the Boer flank, they had not been idle, and now suddenly, from the side of the solitary kopje behind which they had collected, three guns came into action against us. For ten minutes the shell fire was really hot. As these guns were firing with black powder, the smoke springing out in a thick white cloud from the muzzle warned us whenever a projectile was on its way, and, I think, added to the strain on the nerves. You could watch the distant artillery. There was the gun again; four or five seconds to wonder whether the shell would hit you in the face; the approaching hiss rushing into a rending shriek; safe over; bang! right among the horses a hundred yards behind. Here comes the next--two guns fired together this time. Altogether, the Boers fired nearly thirty shells--several of which were shrapnel--on this small space of ground. But fate was in a merciful mood that day, for we had but one man killed and five or six--including the General\u0027s orderly--wounded by them. It was, however, evident that this could not endure. Brabazon had not cared to bring his own two guns into such an advanced position, because they were not horse guns, and might not be able to get away safely if the Boers should make a strong counter attack. Indeed, so long as the loss of guns is considered a national disaster instead of only an ordinary incident of war, Cavalry officers will regard them rather as sources of anxiety than as powerful weapons. Without guns it was useless to stay, and as, moreover, Sir Leslie Rundle\u0027s orders were that the Cavalry were not to be severely engaged, Brabazon decided to withdraw the reconnaissance, and did so most successfully, after an instructive little rearguard action. He had penetrated far into the enemy\u0027s position; had compelled him to move his guns and disturb his frontal dispositions; had reconnoitred the ground, located the laagers, and come safely away with the loss of little more than a dozen men. Had there been on this day an Infantry support behind the Cavalry we should have hustled the enemy out of his whole position and slept triumphantly in Dewetsdorp. Sir Leslie Rundle was much impressed by the vigour and success of the Cavalry, whose fortunes were watched from the plateau, and as evening came the report spread through the camp that a general engagement would be fought on the next day. He also decided to entrust the direction of the actual turning attack to General Brabazon, who, besides his Cavalry force, was to have twelve guns and an Infantry brigade under his command. With every feeling of confidence in the issue the Army went to bed, impatient for the dawn. But in the dead of night a telegram arrived from Lord Roberts, instructing Rundle not to press his attack until he was in touch with Pole-Carew and other reinforcements; and it thus became evident that the operations had grown to an altogether larger scale. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2887/79883.html","bookId":1141,"book":{"id":1141,"title":"Ian Hamilton\u0027s March","description":"简介： This book is a continuation of those letters to the Morning Post newspaper on the South African war, which have been lately published under the title \u0027London to Ladysmith via Pretoria.\u0027 Although the letters had been read to some extent in their seria...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2887","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
