{"id":37274,"no":8,"title":"CHAPTER VII IAN HAMILTON\u0027S MARCH","content":"Winburg: May 8. The unsatisfactory course of the operations in the south-eastern corner of the Free State, and the indecisive results to which they led, were soon to be arrested and reversed by a series of movements of surprising vigour and remarkable success. Of all the demonstrations which had been intended against the enemy to the east of the railway, Hamilton\u0027s advance towards the waterworks position, being the most northerly, was to have been the least earnestly pressed. The orders were: \u0027If you find the waterworks weakly held, which is not likely, you may try to occupy them, and, in the event of success, may call up Smith-Dorrien\u0027s Brigade to strengthen you.\u0027 On this General Ian Hamilton, who now commanded the imposing, but somewhat scattered, Mounted Infantry Division, started from Bloemfontein on the 22nd of April with about 2,000 Light Horse, Australians, and Mounted Infantry, and one battery of Horse Artillery. On the 23rd he arrived before the waterworks, reconnoitred them, found them weakly held, or, at any rate, thought he could take them, attacked, and before dark made himself master of the waterworks themselves, and of the drift over the river which led to the hills beyond, into which the enemy had retired. Smith-Dorrien\u0027s Brigade was called up at once, arrived after dark, and the next morning the force crossed at the drift, and the whole position was occupied. The enemy offered a slight resistance, which was attributed by some to a deep design on their part to lure the column into a trap further to the east, and by others to the manner in which the attack was delivered. The news o the capture of this strong and important place, which secures the Bloemfontein water supply, was received with great satisfaction at headquarters. Meanwhile the operations round Dewetsdorp came to their abortive conclusion, and it became evident that the Boers had evaded the intercepting columns and were making their way northwards by Thabanchu. What was to be done? Had the officer commanding at the waterworks any suggestion to make? Most certainly, and the suggestion was that he should be permitted to advance himself and occupy Thabanchu. This was the answer that was expected and desired. Permission, and with it a field battery, was accordingly given, and, on the 25th of April, the column moved out of the waterworks position towards Thabanchu. It consisted of Ridley\u0027s Brigade of Mounted Infantry, which included a large proportion of colonials--Australians and New Zealanders--Smith-Dorrien\u0027s Infantry Brigade (Gordons, Canadians, Shropshires, and Cornwalls), with twelve guns. The country to the east of Bloemfontein is at first smooth and open. Great plains of brownish grass stretch almost to the horizon, broken to the eye only by occasional scrub-covered hills. To any one unaccustomed to the South African veldt they appear to offer no obstacle to the free movement of cavalry or artillery; nor is it until one tries to ride in a straight line across them that the treacherous and unimagined donga and the awkward wire fence interpose themselves. But beyond the Modder River, on which the waterworks are situated, the surface of the ground becomes rocky and hilly, and the features increase in prominence until Thabanchu Mountain is reached, and thereafter the country uprears itself in a succession of ridges to the rugged and lofty peaks of Basutoland. Thabanchu, a small village, as we should regard it in England, a town of comparative commercial importance in the Orange Free State, and of undoubted strategic value during this phase of the operations, stands at the foot of the precipitous feature that bears its name. It is approached from the direction of Bloemfontein by a long, broad, flat-bottomed valley, whose walls on either side rise higher and higher by degrees as the road runs eastward. The eastern end of this wide passage is closed by a chain of rocky kopjes, whose situation is so curious and striking that they seem to be devised by nature to resist the advance of an invader. The kopjes, rising abruptly from the flat glacis-like ground, are a strong rampart, and the whole position, resting on apparently secure flanks, creates a most formidable barrier, which is called locally Israel\u0027s Poorte. Along the valley, on the 25th of April, Hamilton proceeded to march with his entire force, Ridley and the Mounted Infantry being a considerable distance in front of the main body. At ten o\u0027clock a heavy fire of musketry and artillery was opened at an extreme range from the hills on the left hand side of the column. Ignoring this, which proved afterwards to be only a Boer demonstration, Ridley continued his march, and Hamilton followed, until, at a little after eleven o\u0027clock, both were brought to a stand-still before the Israel\u0027s Poorte position, which was found to be occupied by the enemy, estimated at 800 strong, with several guns. After a personal reconnaissance, and in spite of a most disquieting report that the Boers had just been reinforced by \u0027two thousand men in four lines,\u0027 the General resolved to attack. His plan was simple but effective. It resembled very closely Sir Bindon Blood\u0027s forcing of the \u0027Gate of Swat\u0027 at Landakai in 1897. The front was to be masked and contained by a sufficient force of infantry and all the guns. The rest of the troops were to stretch out to the left and swing to the right, the infantry along the left hand wall of the valley, the mounted men actually the other side of the wall. Accordingly, the Canadian Regiment and the Grahamstown Volunteers (Marshall\u0027s Horse) moved forward in extended order--25 yards interval between men--to within about 800 yards of the enemy\u0027s position, and here, just out of the range of serious harm, they lay down and opened a continuous musketry fire. Both batteries came into action forthwith and shelled the crest line with satisfactory energy. Smith-Dorrien, with the remaining three battalions of his brigade, moved to the left, and began working along the ridges. Ridley, breaking out of the valley into the more open ground beyond, began to move against the enemy\u0027s line of retreat. DIAGRAM EXPLAINING HAMILTON\u0027S ACTION AT ISRAEL\u0027S POORTE, THE 25TH OF APRIL. Four hours passed, during which the Boers indulged the hope that the frontal attack would be pushed home, and at the end of which they found their right flank turned and their rear threatened. Immediately, with all the hurry of undisciplined troops who feel a hand on their communications, they evacuated the position, and, running to their horses, galloped away. The Canadians and Grahamstown Volunteers thereupon arose and occupied the line of kopjes, and thus the door was opened and the road to Thabanchu cleared. Our losses in this smart action were about twenty killed and wounded, among whom were no less than five officers of the Grahamstown Volunteers. The Dutch left five corpses on the field, and doubtless carried away a score of wounded. General Hamilton, pushing on, entered Thabanchu the same night, and the British flag was again hoisted over the town. The Imperialist section of the community, who had in the interval between the evacuation and reoccupation of the town been subjected to much annoyance at the hands of the Boers, were naturally shy, and afraid to make any sign of welcome. The southern commandos from Dewetsdorp and Wepener had by hard marching already passed behind Thabanchu with their convoys. On the 26th French and his Cavalry, covering the march of Rundle\u0027s (Eighth) Division, arrived, and, since he was a lieutenant-general, took the command out of Hamilton\u0027s hands for a time. I had come northwards from Dewetsdorp with the Cavalry Brigades, and was an eyewitness of the operations round Thabanchu which occupied the 26th and 27th. Thabanchu Mountain is a lofty and precipitous feature of considerable extent, and, towards the south, of indefinite shape. To the north, however, it presents a wide bay, on whose grassy shores rising from the more arid plain the Boer laagers were reported to stand. The enemy held the crest of the crescent-shaped mountain with guns and riflemen, and in order that no one should pry behind it they extended on their right a few hundred trustworthy fellows, who, working in the most scattered formation, gave to their position an enormous front of doubtful strength. On the afternoon of the 26th, with a view to further operations on the following day, a force of Mounted Infantry, supported by galloping Maxims and a Horse Battery, was sent to reconnoitre, and if possible to hold the hill, henceforward called \u0027Kitchener\u0027s Horse Hill.\u0027 The troops gained possession of the feature without fighting, though a few Boers were seen galloping along the ridges to the right and left, and an intermittent musketry fire began. A garrison to hold the hill was detailed, consisting of Kitchener\u0027s Horse, a company of the Lincoln Mounted Infantry, and two Maxim guns; but just as the sun sank this plan was changed by the officer commanding the force, and the whole were ordered to retire into Thabanchu. On the Indian frontier it is a cardinal rule to retire by daylight and sit still when overtaken by night in the best position at hand. In this war experience has shown that it is usually better to remain on the ground, even at a heavy cost, until it is quite dark, and then to retreat, if necessary. The reason of the difference is, that while close contact with an Afridi armed with a four-foot knife, active as a cat and fierce as a tiger, is to be avoided as much as possible, no soldier asks better than the closest contact with a Dutchman. But though the teaching of both wars may seem contradictory on many points, on one point it is in complete agreement: twilight is the worst time of all to retire. The consequences of this ill-timed change of plan were swift. The Boers saw the retrograde movement, and pressed boldly forward, and Kitchener\u0027s Horse, finding themselves closely engaged, were unable to move. A sharp and savage little fight followed in the gloom. The Boers crept quite close to the soldiers, and one fierce greybeard was shot through the head eight paces from the British firing line, but not until after he had killed his man. The reports which reached the town, that Kitchener\u0027s Horse were \u0027cut off\u0027 on a kopje four miles from the camp, induced General French to send the Gordon Highlanders to their relief. This battalion started at about ten o\u0027clock, and were put on their road to the northward. But in the darkness and the broken ground they lost their way, marched five miles to the south, occupied another hill, and did not rejoin the command until the afternoon of the next day, an absence which, since no inquiries could discover them, caused much anxiety. Kitchener\u0027s Horse meanwhile, under Major Fowle, of the 21st Lancers, made a plucky defence, beat off the Boers, and managed at about eleven o\u0027clock to effect their retreat undisturbed. The losses in the affair were twelve or fourteen men killed and wounded, including one officer, who was shot through the head. Very early the next morning the whole force marched out of the town, and French\u0027s operations were this day designed to compel the enemy to retreat from his positions in rear of Thabanchu Mountain, and if possible to surround some part of his force. The information at General French\u0027s disposal could not, however, have been very accurate, for in my telegram of the 26th I wrote that \u0027more than 2,000 Boers\u0027 were collected to the north of Thabanchu, and the Press Censor erased this and substituted the words \u0027small parties.\u0027 If this latter view had been correct it is probable that the operations of the following day would have been attended by a greater measure of success. The plan was clear and vigorous. Gordon\u0027s Cavalry Brigade was to move to the right, round the east of Thabanchu Mountain, and force their way into the plains behind it. It was hoped that the Lancers, of which this brigade is entirely composed, would find some opportunity for using their dreaded weapon. Hamilton was to push back the weak Boer right, and open the way for Dickson\u0027s Cavalry Brigade to pass through and join hands with Gordon. Rundle, whose infantry were tired from their long march from Dewetsdorp, was to demonstrate against the Boers\u0027 centre and hold the town. The action opened with the re-occupation of Kitchener\u0027s Horse Hill by Smith-Dorrien\u0027s Infantry Brigade, who advanced in determined style, and by a sweeping movement of Ridley\u0027s Mounted Infantry. Both these undertakings, which were directed by Hamilton, prospered. The Boer right, which was very thin, was brushed aside, and the road for the cavalry was opened. At, and not until, nine o\u0027clock, French\u0027s leading squadrons began to appear on the plain, and by ten the whole of Dickson\u0027s Brigade had passed through the gap and were safely extended in the undulating plains beyond. DIAGRAM EXPLAINING FRENCH\u0027S OPERATIONS ROUND THABANCHU, THE 26TH AND 27TH APRIL. Wishing to see, for the first time, Cavalry and Horse Artillery working in suitable country, I rode down from my post of observation on Kitchener\u0027s Horse Hill and trotted and cantered until I caught up the squadrons. It was evident that the left enveloping arm was making good progress. Already we could almost look into the bay behind Thabanchu Mountain. If Gordon were only getting on as well we might join hands with him, and enclasp a goodly catch of prisoners. So the brigade continued to advance from ridge to ridge, and presently Boers began to gallop across the front to escape, as was thought, from the net we were drawing round them. At all of these--the Horse Artillery and the pom-poms--British pom-poms at last--fired industriously. But as the enemy kept a respectful distance and an open formation, only a few were seen to fall. The others did not fly very far, but gathered together in what soon became considerable numbers outside the net, near a peaked hill, which does not appear in my sketch, but which the reader may bear in mind as lying to the left rear of the turning Cavalry. At last Dickson\u0027s advance reached a point between Thabanchu Mountain and the peaked hill, so that no more Boers could escape by that road; and we saw the others, three or four hundred in number, riding about, up and down, or round and round in the bay, like newly-caught rats in a cage. At this everyone became very excited. \u0027Gordon must have headed them back,\u0027 it was said. \u0027Only a few more men and we might make a bag.\u0027 Where could men be found? Somebody suggested asking Hamilton. The helio twinkled: \u0027Come and help us make a bag,\u0027 it said, in somewhat more formal language. And Hamilton came forthwith, leaving positions which were of much value; collecting every man he could lay his hands on--weary mounted Infantry, a tired-out battery, and all of Smith-Dorrien\u0027s Brigade that could march fast at the end of a long day--he hurried to seize and line the northern spurs of Thabanchu Mountain, prepared to risk much to strike a heavy blow. The movement of Infantry and guns to support him encouraged Dickson to press still further forward, and the whole brigade advanced nearly another mile. At length we overtopped a smooth ridge, and found ourselves looking right into the bay or horseshoe of mountains. Now at last we must see Gordon. \u0027There he is,\u0027 cried several voices, and looking in the direction shown I saw a majestic body of horse streaming out of the centre of the bay towards the north-west. But was it Gordon? At least 4,000 mounted men were riding across our front, hardly two miles away. Surely no brigade was so numerous. Yet such was the precision of the array that I could not believe them Boers. Boers their numbers, however, proved them to be; and not their numbers alone, for before we had watched this striking spectacle long, two large puffs of smoke leapt from the tail of the hostile column, and two well-aimed shells burst near our Horse Battery. At the same time patrols from the left rear hurried in with the news that the Boers who had already escaped from our imagined \u0027trap\u0027 were advancing in force, with two more guns, to cut us from the rest of the army. As for Gordon, there was no longer any doubt about his fortunes. Far away to the eastward the horseshoe wall of mountains dipped to a pass, and on the sides of this gateway little puffs of smoke, dirty brown against the darkening sky, showed that Gordon was still knocking with his Artillery at the door, and had never been able to debouch in the plains behind it. Moreover, the dangerous hour of twilight was not long distant. Dickson determined to retreat while time remained, and did so without any unnecessary delay. Whereat the Boers came down on our rear and flank, opening furious fire at long range, and galloping eagerly forward, so that the brigade and its guns, so far from entrapping the enemy, were all but entrapped themselves; indeed, the brigadier\u0027s mess cart, the regimental water carts, and several other little things, which, being able only to trot, could not \u0027conform to the general movement,\u0027 were snapped up by the hungry enemy, who now pressed on exulting. Meanwhile Hamilton had taken some risks in order to promote the expected entrapping. He had now to think of himself. First, the Boer advance must be stopped, and, secondly, the force which had, in the hopes of grasping the Boers, let go its hold on Kitchener\u0027s Horse Hill, must be withdrawn within the Thabanchu picket line. The General, however, was equal to both requirements. Judiciously arranging some force of Infantry and guns, he peppered the advancing Boers heavily, so that at 800 yards they wheeled about and scurried to the shelter of adjacent kopjes. This advantage restored the situation. Hamilton remained on the ground till dark, and then, with the whole of Ridley\u0027s and Smith-Dorrien\u0027s commands, returned safely into Thabanchu. During the day rifle and artillery fire had been constant; but as the fighting had been conducted at extreme ranges, which neither side showed much anxiety to diminish, the slaughter was small. Indeed, I do not think that a dozen men were stricken in either army. So far as the British were concerned, the result of the day\u0027s operations was a qualified success. The Boers were evidently prepared to retreat from Thabanchu, but they proposed to do so in their own time and at their most excellent discretion, and it was quite evident that we had not succeeded in any way in hindering or preventing them. It was also clear that, far from being \u0027in small parties,\u0027 their strength was nearly 6,000, so that on the whole we might congratulate ourselves on having moved in ignorance and taken no great hurt, The only point about the action difficult to understand was the behaviour of the Boers who had ridden about like caged rats. Why should they do so when they knew that their line of retreat to the north-east was perfectly secure? I can only conclude that this particular commando had arranged to retire northwards towards the peaked hill, and were annoyed at being prevented from joining their comrades at the point where their waggons, and, consequently, their dinners, were awaiting them. On the evening of this instructive, but unsatisfactory, day, Hamilton received orders from Lord Roberts to march north on Winburg in conformity with the general advance of the army. For this purpose his force was to be largely increased, and the operations which followed require the space of another letter. French remained for some days at Thabanchu, but attempted no further serious operations against the enemy. Only one other incident of interest occurred in the neighbourhood of Thabanchu. After his relief of Wepener, Brabazon was ordered thither via Dewetsdorp. On the 28th, dusty and tired at the end of a long march, he arrived with his Yeomanry at the foot of a pass among the hills. A Kaffir lounged into the bivouac and asked the General whether he would like to see some pretty shelling, for that there was a fine show at the top of the valley. Brabazon, much interested, mounted his horse forthwith, and, guided by the Kaffir through devious paths, reached a point which afforded an extensive view. There, in the twilight, lay a British convoy, stoutly defended by a company of the kiddies and a few Yeomanry, and shelled--as the Kaffir had said--with great precision by two Boer guns. The General thereupon gave the Kaffir a \u0027fiver\u0027 to carry a letter through the Boer lines to the commander of the convoy, telling that officer to hold out manfully, and promising that with the dawn Brabazon and the Imperial Yeomanry would come to his aid. The Kaffir succeeded in his mission. The convoy was encouraged, and, good as his word, with the daylight came the General, at whose approach the Boers fled incontinently, so that Brabazon, the Yeomanry, and the convoy came in safety and triumph into Thabanchu together.","sourceLink":"http://novel.tingroom.com/duanpian/2887/79885.html","bookId":1141,"book":{"id":1141,"title":"Ian Hamilton\u0027s March","description":"简介： This book is a continuation of those letters to the Morning Post newspaper on the South African war, which have been lately published under the title \u0027London to Ladysmith via Pretoria.\u0027 Although the letters had been read to some extent in their seria...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2887","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
