{"id":101619,"no":46,"title":"Page 46","content":"I was holding a piece of opal. Chapter 31 We sort of stared at each other like two doofuses, and then we both sprang into action. Taking the stone that was a little bigger than a nickel, we went downstairs. Our heart rates picked up. I handed him the stone. “Try something—like that reflection thing.” Daemon, who’d probably been jonesing for a piece of opal since he learned what they could do, didn’t refuse. He wrapped his palm around it, and concentration tightened the line of his mouth. At first nothing happened, and then a faint shimmer surrounded the outline of his body. Like when Dee got excited and her arm would glimmer and fade, but then the shine spread over his body and he disappeared. Completely disappeared. “Daemon?” A soft chuckle came from the vicinity of the couch. My eyes narrowed. “I can’t see you at all.” “Not at all?” I shook my head. Weird. He was here, but I couldn’t see him. Stepping back, I forced myself to focus on the couch. Then I noticed the difference. In front of the middle cushion and behind the coffee table, the space was distorted. Sort of wavy, like looking at water through glass, and I knew he had to be standing there, blending in like a chameleon. “Oh my God, you’re totally like the Predator.” There was a pause and then, “This is so cool.” Moments later he reappeared, grinning like a kid who just got his first video game. “God, I am so going to sneak into your bathroom like the Invisible Man.” I rolled my eyes. “Give me the opal.” Laughing, he handed it over. The stone was body temperature, which I thought was weird. “Want to hear something crazier than me being completely invisible? It barely took any energy away. I feel fine.” “Wow.” I turned the stone over. “We need to test this out.” Taking the stone, Daemon and I headed to the lake. We had about fifteen minutes before anyone else showed. “You try it,” Daemon said. Holding the opal in my palm, I wasn’t sure what to try. The hardest thing and the one that took the most strength was using the Source as a weapon. So I decided to go with that. I concentrated on the rush and it felt different this time—potent and consuming. Tapping into it came faster, easier, and within seconds, a ball of whitish-red light appeared over my free hand. “Wow,” I said, smiling. “This is…different.” Daemon nodded. “Do you feel tired or anything?” “No.” And usually this wiped me out pretty darn quickly, so the opal really did have an impact. Then I got an idea. Letting the Source fizzle out, I searched the ground and found a small branch. Taking it to the bank of the lake, I squeezed the opal in one hand. “I could never do the heat-to-fire thing. Burned my fingers pretty badly the last time I tried it.” “Should you be trying it now, then?” Ah, good point. “But you’re here to heal me.” Daemon frowned. “Worst logic ever, Kitten.” I grinned as I focused on the branch. The Source flared once again, traveling along the slender, crooked twig of a branch, encasing it whole. A second later, the stick collapsed into an ash replica, and as the whitish-red light receded, the branch fell apart. “Uh,” I said. “That wasn’t fire, but it was pretty damn close.” I’d never done anything like that before. Had to be the opal-enhanced alien coolness, because I just turned a stick into Pompeii. “Let me have it,” Daemon said. “I want to see if it has any effect on the onyx.” Handing it over, I followed him to the pile of onyx, wiping the ash off my fingers. Holding the opal in one hand, he uncovered the stones and, jaw clenching, he picked one up. Nothing happened. All of us had grown a tolerance to the rocks, but there was usually a gasp or flinch of pain. “What’s happening?” I asked. Daemon lifted his chin. “Nothing—I don’t feel anything.” “Let me try.” We switched off and he was right. The bite of onyx wasn’t there. We stared at each other. “Holy crap.” Footsteps and voices carried into the clearing. Daemon swiped the opal, sliding it in his pocket. “I don’t think we should let Blake see this.” “No doubt,” I agreed. We turned as Matthew, Dawson, and Blake appeared at the edge of the woods. It would be interesting to see if the opal had any affect in Daemon’s pocket or if we had to be physically touching it. “I talked to Luc,” Blake announced while we were all standing around the onyx. “He’s good for this Sunday, and I think we’ll be ready by then.” “You think?” Dawson said. He nodded. “It’s either going to work or not.” Failure wasn’t an option. “So the Sunday after prom?” “You guys are going to prom?” Blake asked, scowling. “Why not?” I said defensively. Blake’s eyes darkened. “Just seems like a stupid thing to do the night before. We should be spending Saturday training.” “No one asked for your opinion,” Daemon said, hands curving into fists. Dawson shifted closer to his brother. “One night isn’t going to hurt anything.” “And I have prom duty,” Matthew said, sounding absolutely disgusted with the idea. Outnumbered, Blake let out a disgruntled mumble. “Fine. Whatever.” We got started then, and I kept my eyes trained on Daemon when it came to his turn. When he touched the onyx, he immediately flinched but held on. Unless he was faking it, the opal had to be touching flesh. Good to know. Over the next couple of hours, we did our rounds with the onyx. I was seriously beginning to think my fingers and muscle control would never be the same again. Blake kept the required ten feet distance and didn’t try to talk to me. I liked to think my come-to-Jesus discussion had gotten through to him. If not…then, well, I doubted I’d be able to control myself. As we broke apart for the night, I lingered back with Daemon. “It didn’t work in your pocket, did it?” “No.” He dug the thing out. “I’m going to hide this somewhere. Right now, I don’t think we need anyone fighting over it or it getting into the wrong hands.” I agreed. “Do you think we’re ready for this Sunday?” My stomach dropped thinking about it, no matter how long I’d known that this day was coming. Daemon slipped the opal back into his pocket and then gathered me in his arms. Anytime he held me, it always felt unbelievably right and I wondered how I could’ve denied it for so long. “We’re going to be as ready as we ever will be.” He brushed his cheek along mine and I shivered, closing my eyes. “And I don’t think we can keep Dawson off much longer.” I nodded and wrapped my arms around him. Now or never. Oddly, in that moment, I felt like we didn’t have enough time, even though we’d been practicing for months. Maybe it wasn’t that. Maybe I just felt we didn’t have enough time together. On Saturday, Lesa and I piled into the back of Dee’s Jetta. Windows rolled down, we enjoyed the seasonably warm temps. Dee seemed different today, too. It wasn’t the pretty pink summer dress she’d worn, paired with a black cardigan and strappy sandals. Her hair was pulled up in a loose ponytail and her thick hair cascaded down her back, revealing a perfectly symmetrical face that bore an easy grin—not the one I was so familiar with and missed painfully, but almost. She was lighter somehow, her shoulders less tense. Right now, she hummed along to a rock song on the radio, speeding around cars like a Nascar driver. Today was a turning point. Lesa grasped the back of Ash’s seat, face pale. “Uh, Dee, you do realize this is a no passing zone, right?” Dee grinned in the rearview mirror. “I think it’s a suggestion, not a rule.” “I think it’s a rule,” Lesa advised. Ash snorted. “Dee thinks yield signs are a suggestion, too.” I laughed, wondering how I could’ve forgotten Dee’s terrifying driving. Normally I’d be clutching a seat or handle too, but today I couldn’t care as long as she got us to the shop in one piece. And she did. And we only narrowly avoided wiping out a family of four plus a religious tour bus once. The shop was downtown, occupying an old row house. Ash’s pert little nose wrinkled as her heels touched the gravel we parked on. “I know it looks less than savory from the outside, but it’s really not bad. They have cool dresses.” Lesa studied the old brick building, doubtful. “Are you sure?” Sashaying past her, Ash cast a mischievous grin over her shoulder. “When it comes to clothing, I’ll never steer you wrong.” Then she frowned and reached out, flicking green-painted nails along Lesa’s shirt. “We need to go shopping one day.” Lesa’s mouth dropped open as Ash spun and headed toward the back door that bore an OPEN sign written in elegant calligraphy. “I’m going to hit her,” Lesa said under her breath. “You just watch. I’m gonna break that pretty nose of hers.” “I’d try to resist that urge if I were you.” She smirked. “I could take her.” Ah, no, she couldn’t. Finding dresses didn’t take very long. Ash went with one that barely covered her ass, and I found a really great red dress I just knew Daemon would go gaga for. Afterward, we headed to Smoke Hole Diner. Going out to eat with Lesa felt good, and Dee being there was like the proverbial icing on the cake. Ash? I wasn’t so sure about that part. I ordered a hamburger while Ash and Dee ordered practically everything on the menu. Lesa went with a grilled cheese sandwich and something I found entirely gross. “I don’t know why you drink cold coffee. You can just get regular coffee and let it grow cold.” “So not the same,” Dee answered as the waitress put our sodas down. “Tell them, Ash.” The blonde Luxen peered up from ridiculously long eyelashes. “Chilled coffee is more sophisticated.” I made a face. “I’ll be uncivilized with my warm coffee.” “Why doesn’t that surprise me?” Ash arched a brow and then turned her attention back to her cellphone. Sticking my tongue at her, I smothered a giggle when Lesa elbowed me. “I still think I should’ve gotten the transparent wings for my dress.” Dee smiled. “They were cute.” I nodded, thinking Daemon would’ve loved them. Lesa tugged her curls out of her face. “You guys are lucky you found dresses on this short notice.” Since her and Chad had made plans to go like ordinary people months ago, she had gotten her dress from some shop in Virginia. She had gone mostly along for the ride. As conversation picked up and Dee started talking about her dress, I sat back against the booth. Sadness trickled through me, followed by bittersweet memories. I thought I’d known Carissa, but I really hadn’t. Had she known a Luxen? Or had she been picked up by Daedalus and used? Months had passed and there had been no answers; the only reminder was the piece of opal I had discovered under my bed.","sourceLink":"https://allnovel.net/opal-lux-3/page-46.html","bookId":1663,"book":{"id":1663,"title":"Opal (Lux #3)","description":"Storyline: Opal (Lux #3) No one is like Daemon Black. When he set out to prove his feelings for me, he wasn’t fooling around. Doubting him isn’t something I’ll do again, and now that we’ve made it through the rough patches, well... There’s a lot of spontaneous combustion going on. But even he can’t protect his family from the danger of trying to free those they love. After everything, I’m no longer the same Katy. I’m different... And I’m not sure what that will mean in the end. When each step we take in discovering the truth puts us in the path of the secret organization responsible for torturing and testing hybrids, the more I realize there is no end to what I’m capable of. The death of someone close still lingers, help comes from the most unlikely source, and friends will become the deadliest of enemies, but we won’t turn back. Even if the outcome will shatter our worlds forever. Together we’re stronger... and they know it.","cover":"https://allnovel.net/images/opal-lux-3.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/opal-lux-3.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:03:05 PM"}}
