{"id":101621,"no":48,"title":"Page 48","content":"“Your mother wanted that.” My hands curled into fists. “It seemed to hold at first.” A cough racked his frail body and I almost expected him to topple over. “Weeks went by and the things I could do…” A weak, brittle smile split his dry lips. “Moving objects with a wave of my hand, running miles without breaking a sweat…I felt better than I ever had. Everything had fallen into place just like I planned, just like I paid for.” My horrified gaze flickered over his sunken chest. “Then what happened to you?” His left arm twitched. “The mutation didn’t hold, but that doesn’t mean it didn’t change me on a cellular level. Something I’d wanted to prevent ended up being…propelled by the mutation. My cancer,” he said, lip curling. “My cancer was in remission. The statistics of a complete recovery were high, but when the mutation faded, this…” He waved a weak hand around himself. “This happened.” I blinked, stunned. “Your cancer came back?” “With a vengeance,” he said, laughing that terrible, fragile laugh. “There’s nothing that can be done. My blood is like a toxin. My organs are failing at an abnormal rate. Apparently, the whole theory of cancer being linked to DNA may have some basis to it.” Each word he spoke seemed to exhaust him and there was no doubt he was one step, maybe two, away from death. Reluctant sympathy flooded me. How crappy was it that everything he’d done to secure his health had ultimately led to his death? I shook my head. Irony was such a witch. “If you had just left everything alone, you’d be fine.” His eyes met mine. “You want to rub that in?” “No.” And I really didn’t. If anything, I was sickened by this. “It’s just sad, really sad.” He stiffened. “I don’t want your pity.” Okay. I crossed my arms. “Then what do you want?” “I want revenge.” My brows shot up. “For what? You brought this on yourself.” “I did everything right!” He slammed his fist down on the table, rattling it and surprising me. Well, he was stronger than he looked. “I did everything right. It was him—Daemon. He didn’t do what he was supposed to.” “He healed you like you wanted.” “Yes! He healed me! And that gave me a temporary mutation.” Another fit of coughing stole his words. “He…he didn’t mutate me. What he did…was he gave himself what he wanted and enough time for him to think he got away with it.” I stared at him. “The whole healing and mutation thing isn’t an exact science.” “You’re correct. The DOD has dedicated entire organizations to discovering how a successful hybrid is created.” No big announcement there. “But Daemon is the strongest. There was no reason why it wouldn’t have held.” “There’s no way of knowing what would’ve happened.” “Don’t pretend that you don’t know,” he spat. “That punk knew what he was doing. I saw it in his eyes. I just didn’t know what it meant then.” I looked away and then faced him. “There has to be a true want behind the healing for it to work. Anything else won’t do the job…or at least that’s what we’ve learned.” “That’s mystical BS.” “Is it?” My gaze drifted over him. Yeah, I was being a bitch, but he locked me in a cage, tortured me, and had slept with my mom to get what he wanted. I felt sympathy for the guy, but in a twisted way, he’d gotten what he deserved. “Sure doesn’t seem that way.” “You’re so cocky, Katy. The last I saw of you, you were screaming your head off.” He smiled again, his head wobbling on his neck. And there went my sympathy. “What do you want, Will?” “I told you.” He stood awkwardly, swaying to the left of the table. “I want revenge.” I arched a brow. “Not sure how you’re going to pull that off.” He placed one hand on the counter, supporting himself. “This is your fault—Daemon’s fault. I made a deal. I held up my end of the bargain.” “Dawson wasn’t where you said he was.” “No. I had him released from the office building.” His smug smile came off as a grimace. “I had to give myself more time to get away. I knew Daemon would come after me.” “No. He wouldn’t have, because he really didn’t know if it worked or not. If so…” I stopped. “We’d be joined, and there’d be nothing he could do?” he supplied. “That’s what I hoped.” I watched him place a hand on his bony hip, all at once grateful that Mom would never see him like this. Will would remind her of Dad. Part of me felt like I should help Will sit down or something. He bared yellow teeth. “But you two are joined, right? One life split into two. One of you dies, so does the other.” I snapped to attention. My stomach lurched. He caught my reaction. “If I had to pick what I’d want to accomplish here, it would be to make him suffer, to live on without the thing he cherishes most, but…he’s not going to die instantaneously, right? He’ll know—and those seconds of him knowing…” His intentions sunk in slowly. A buzzing filled my ears and my mouth dried. He wanted to kill us. With what? His evil-eye power? Will pulled a gun out from underneath his loose shirt. Oh, yeah, that would do it. “You can’t be serious,” I said, shaking my head. “I’m as serious as they come.” He took a breath, and his chest rattled a death sound. “And then I’m going to sit here and wait for your pretty mom to come home. She’s going to see your dead body first and then she’ll see the business end of my gun.” My heart tripped up. Ice water slipped over my skin. The buzzing roared now. Like a switch being thrown inside me, something else took over. It wasn’t timid, gullible Katy who followed him into a car. It wasn’t the one who stood in the kitchen seconds ago feeling sorry for him. This was the girl who stood before Vaughn and watched the life seep out of him. Maybe later I would be bothered by how quickly the change came over me. How easy it was for me to go from the girl who’d just bought her prom dress and flirted with her boyfriend to this stranger who now occupied my body, ready to do anything to protect those I loved. But right now, I didn’t care. “You’re not going to hurt Daemon. You’re not going to hurt me,” I said. “And you are sure as hell not going to hurt my mother.” Will lifted the gun. The metal looked too heavy for his feeble hand. “What are you going to do, Katy?” “What do you think?” I took a bold step forward, my brain and mouth propelled by this stranger. “Come on, Will, you’re smart enough to figure it out on your own.” “You don’t have it in you.” Calmness settled over me, and I felt my lips spread into a smile. “You don’t know what I’m capable of.” Up until then, I hadn’t known what I was capable of, not truly, but seeing Will, staring down the barrel of that gun, I knew exactly what I was capable of. And as wrong as it may be, I was okay with what I was going to have to do. Completely accepting of it. There was a part of me that was scared of how easy that acceptance was and I wanted to cling to the old Katy, because she would’ve had a problem with this. She would’ve been sickened by this and the words I was saying. “You do look a little ill, Will. You might want to get checked out. Oh, wait.” I widened my eyes innocently. “You can’t go to a regular doctor because even though the mutation obviously didn’t stick, I’m sure it changed you and you can’t go to the DOD, because that would be like suicide.” The hand around the gun trembled. “You think you’re so smart and brave, don’t you, little girl?” I shrugged. “Perhaps, but I do know I’m completely healthy. What about you, Will?” “Shut up,” he hissed. Stepping next to the kitchen table, I eyed the gun. If I could distract him, then I could take him out. I really didn’t want to test the whole stopping-a-bullet theory. “Just think of all that money you paid, and it didn’t even work out in the end,” I said. “And you’ve lost everything—your career, your money, my mom, and your health. Karma’s a tool, isn’t it?” “You stupid bitch.” Spittle flew from between his chapped lips. “I’m going to kill you, and you’ll die knowing that your precious freak will be dead, too. And then I’m going to sit here and wait for your mother to come home.” My humanity clicked off. I was so done with this. Will smiled. “Where’s your smart mouth now?” My gaze dropped to the gun, and I felt the Source soar over my skin. My fingers splayed, their tips already tingling. Drawing in the power, I focused on the gun. His hand shook again. The muzzle of the gun swayed to the left. The trigger finger twitched. Will’s throat spasmed as he swallowed. “What… What are you doing?” I lifted my gaze, and I smiled. His bloodshot eyes widened. “You—” I waved my hand to the left and several things happened next. There was a popping sound, like a cork being pulled from a champagne bottle, but the sound and everything else was lost in the roar of electricity that flowed outward and then the gun flew from his hand. It was like a bolt of lightning—pure and raw. The stream of whitish-red light arced across the room, slamming into Will’s chest. Maybe—maybe if he wasn’t so ill, it wouldn’t have done much, but the man was weak and I wasn’t. He flew backward, bouncing off the wall next to the fridge, his head flopping on his neck like a rag doll. He made no sound as he hit the floor in a boneless heap. That was it—it was over. No more wondering about Will or where he was, what he was doing. This part of our lives was closed. My house is like the killing fields, I thought. I exhaled and something—I don’t know, something went wrong. Air was stuck in my throat, in my lungs, but when I dragged in a breath, there was this burning pain I hadn’t noticed before. But as the Source receded back into me, the burning grew across my chest, spread over my stomach. I looked down. A red inkblot had formed on the pale blue shirt and it spread…larger and larger, an irregular circle that bled. I pressed my hands against the circle—it was damp, warm, and sticky. Blood. It was blood—my blood. My head swam. “Daemon,” I whispered. Chapter 33 I don’t remember falling, but I was staring at the ceiling, trying to keep my hands pressed to the gunshot wound, because I’d seen people do that on TV, but I couldn’t feel my hands, so I wasn’t sure if they were there or by my sides. My face was wet. I was going to die in minutes, maybe sooner, and I’d failed Daemon and my mom. Failed them, because Daemon would die, too, and my mom—oh, God, my mom would come home to find this. She wouldn’t survive this, not after Dad.","sourceLink":"https://allnovel.net/opal-lux-3/page-48.html","bookId":1663,"book":{"id":1663,"title":"Opal (Lux #3)","description":"Storyline: Opal (Lux #3) No one is like Daemon Black. When he set out to prove his feelings for me, he wasn’t fooling around. Doubting him isn’t something I’ll do again, and now that we’ve made it through the rough patches, well... There’s a lot of spontaneous combustion going on. But even he can’t protect his family from the danger of trying to free those they love. After everything, I’m no longer the same Katy. I’m different... And I’m not sure what that will mean in the end. When each step we take in discovering the truth puts us in the path of the secret organization responsible for torturing and testing hybrids, the more I realize there is no end to what I’m capable of. The death of someone close still lingers, help comes from the most unlikely source, and friends will become the deadliest of enemies, but we won’t turn back. Even if the outcome will shatter our worlds forever. Together we’re stronger... and they know it.","cover":"https://allnovel.net/images/opal-lux-3.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/opal-lux-3.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:03:05 PM"}}
