{"id":17133,"no":29,"title":"Chapter 27","content":"The Reply. \\n\\n \\n\\n Thou bear’st a precious burden, gentle post, \\n\\n \\n\\n Nitre and sulphur — See that it explode not! \\n\\n \\n\\n Old Play. \\n\\n \\n\\n “I have received your two long letters, my dear Etherington, with equal surprise and interest; for what I knew of your Scottish adventures before, was by no means sufficient to prepare me for a statement so perversely complicated. The Ignis Fatuus which, you say, governed your father, seems to have ruled the fortunes of your whole house, there is so much eccentricity in all that you have told me. But n’importe, Etherington, you were my friend — you held me up when I was completely broken down; and, whatever you may think, my services are at your command much more from reflections on the past, than hopes for the future. I am no speechmaker, but this you may rely on while I continue to be Harry Jekyl. You have deserved some love at my hands, Etherington, and you have it. \\n\\n \\n\\n “Perhaps I love you the better since your perplexities have become known to me; for, my dear Etherington, you were before too much an object of envy to be entirely an object of affection. What a happy fellow! was the song of all who named you. Bank, and a fortune to maintain it — luck sufficient to repair all the waste that you could make in your income, and skill to back that luck, or supply it should it for a moment fail you. — The cards turning up as if to your wish — the dice rolling, it almost seemed, at your wink — it was rather your look than the touch of your cue that sent the ball into the pocket. You seemed to have fortune in chains, and a man of less honour would have been almost suspected of helping his luck by a little art. — You won every bet; and the instant that you were interested, one might have named the winning horse — it was always that which you were to gain most by. — You never held out your piece but the game went down — and then the women! — with face, manners, person, and, above all, your tongue — what wild work have you made among them! — Good heaven! and have you had the old sword hanging over your head by a horsehair all this while? — Has your rank been doubtful? — Your fortune unsettled? — And your luck, so constant in every thing else, has that, as well as your predominant influence with the women, failed you, when you wished to form a connexion for life, and when the care of your fortune required you to do so? — Etherington, I am astonished! — The Mowbray scrape I always thought an inconvenient one, as well as the quarrel with this same Tyrrel, or Martigny; but I was far from guessing the complicated nature of your perplexities. \\n\\n \\n\\n “But I must not run on in a manner which, though it relieves my own marvelling mind, cannot be very pleasant to you. Enough, I look on my obligations to you as more light to be borne, now I have some chance of repaying them to a certain extent; but, even were the full debt paid, I would remain as much attached to you as ever. It is your friend who speaks, Etherington; and, if he offers his advice in somewhat plain language, do not, I entreat you, suppose that your confidence has encouraged an offensive familiarity, but consider me as one who, in a weighty matter, writes plainly, to avoid the least chance of misconstruction. \\n\\n \\n\\n “Etherington, your conduct hitherto has resembled anything rather than the coolness and judgment which are so peculiarly your own when you choose to display them. I pass over the masquerade of your marriage — it was a boy’s trick, which could hardly have availed you much, even if successful; for what sort of a wife would you have acquired, had this same Clara Mowbray proved willing to have accepted the change which you had put upon her, and transferred herself, without repugnance, from one bridegroom to another? — Poor as I am, I know that neither Nettlewood nor Oakendale should have bribed me to marry such a —— I cannot decorously fill up the blank. \\n\\n \\n\\n “Neither, my dear Etherington, can I forgive you the trick you put on the clergyman, in whose eyes you destroyed the poor girl’s character to induce him to consent to perform the ceremony, and have thereby perhaps fixed an indelible stain on her for life — this was not a fair ruse de guerre. — As it is, you have taken little by your stratagem — unless, indeed, it should be difficult for the young lady to prove the imposition put upon her — for that being admitted, the marriage certainly goes for nothing. At least, the only use you can make of it, would be to drive her into a more formal union, for fear of having this whole unpleasant discussion brought into a court of law; and in this, with all the advantages you possess, joined to your own arts of persuasion, and her brother’s influence, I should think you very likely to succeed. All women are necessarily the slaves of their reputation. I have known some who have given up their virtue to preserve their character, which is, after all, only the shadow of it. I therefore would not conceive it difficult for Clara Mowbray to persuade herself to become a countess, rather than be the topic of conversation for all Britain, while a lawsuit betwixt you is in dependence; and that may be for the greater part of both your lives. \\n\\n \\n\\n “But, in Miss Mowbray’s state of mind, it may require time to bring her to such a conclusion; and I fear you will be thwarted in your operations by your rival — I will not offend you by calling him your brother. Now, it is here that I think with pleasure I may be of some use to you — under this special condition, that there shall be no thoughts of farther violence taking place between you. However you may have smoothed over your rencontre to yourself, there is no doubt that the public would have regarded any accident which might have befallen on that occasion, as a crime of the deepest dye, and that the law would have followed it with the most severe punishment. And for all that I have said of my serviceable disposition, I would fain stop short on this side of the gallows — my neck is too long already. Without a jest, Etherington, you must be ruled by counsel in this matter. I detect your hatred to this man in every line of your letter, even when you write with the greatest coolness; even where there is an affectation of gaiety, I read your sentiments on this subject; and they are such as — I will not preach to you — I will not say a good man — but such as every wise man — every man who wishes to live on fair terms with the world, and to escape general malediction, and perhaps a violent death, where all men will clap their hands and rejoice at the punishment of the fratricide — would, with all possible speed, eradicate from his breast. My services therefore, if they are worth your acceptance, are offered on the condition that this unholy hatred be subdued with the utmost force of your powerful mind, and that you avoid every thing which can possibly lead to such a catastrophe as you have twice narrowly escaped. I do not ask you to like this man, for I know well the deep root which your prejudices hold in your mind; I merely ask you to avoid him, and to think of him as one, who, if you do meet him, can never be the object of personal resentment. \\n\\n \\n\\n “On these conditions, I will instantly join you at your Spa, and wait but your answer to throw myself into the post-chaise. I will seek out this Martigny for you, and I have the vanity to think I shall be able to persuade him to take the course which his own true interest, as well as yours, so plainly points out — and that is, to depart and make us free of him. You must not grudge a round sum of money, should that prove necessary — we must make wings for him to fly with, and I must be empowered by you to that purpose. I cannot think you have any thing serious to fear from a lawsuit. Your father threw out this sinister hint at a moment when he was enraged at his wife, and irritated by his son; and I have little doubt that his expressions were merely flashes of anger at the moment, though I see they have made a deep impression on you. At all events, he spoke of a preference to his illegitimate son, as something which it was in his own power to give or to withhold; and he has died without bestowing it. The family seem addicted to irregular matrimony, and some left-handed marriage there may have been used to propitiate the modesty, and save the conscience, of the French lady; but, that any thing of the nature of a serious and legal ceremony took place, nothing but the strongest proof can make me believe. \\n\\n \\n\\n “I repeat, then, that I have little doubt that the claims of Martigny, whatever they are, may be easily compounded, and England made clear of him. This will be more easily done, if he really entertains such a romantic passion, as you describe, for Miss Clara Mowbray. It would be easy to show him, that whether she is disposed to accept your lordship’s hand or not, her quiet and peace of mind must depend on his leaving the country. Rely on it, I shall find out the way to smooth him down, and whether distance or the grave divide Martigny and you, is very little to the purpose; unless in so far as the one point can be attained with honour and safety, and the other, if attempted, would only make all concerned the subject of general execration and deserved punishment. — Speak the word, and I attend you, as your truly grateful and devoted \\n\\n \\n\\n “HENRY JEKYL.” \\n\\n \\n\\n To this admonitory epistle, the writer received, in the course of post, the following answer:— \\n\\n \\n\\n “My truly grateful and devoted Henry Jekyl has adopted a tone, which seems to be exalted without any occasion. Why, thou suspicious monitor, have I not repeated a hundred times that I repent sincerely of the foolish rencontre, and am determined to curb my temper, and be on my guard in future — And what need you come upon me, with your long lesson about execration, and punishment, and fratricide, and so forth? — You deal with an argument as a boy does with the first hare he shoots, which he never thinks dead till he has fired the second barrel into her. What a fellow you would have been for a lawyer! how long you would have held forth upon the plainest cause, until the poor bothered judge was almost willing to decide against justice, that he might be revenged on you. If I must repeat what I have said twenty times, I tell you I have no thoughts of proceeding with this fellow as I would with another. If my father’s blood be in his veins, it shall save the skin his mother gave him. And so come, without more parade, either of stipulation or argument. Thou art, indeed, a curious animal! One would think, to read your communication, that you had yourself discovered the propriety of acting as a negotiator, and the reasons which might, in the course of such a treaty, be urged with advantage to induce this fellow to leave the country — Why, this is the very course chalked out in my last letter! You are bolder than the boldest gipsy, for you not only steal my ideas, and disfigure them that they may pass for yours, but you have the assurance to come a-begging with them to the door of the original parent! No man like you for stealing other men’s inventions, and cooking them up in your own way. However, Harry, bating a little self-conceit and assumption, thou art as honest a fellow as ever man put faith in-clever, too, in your own style, though not quite the genius you would fain pass for. — Come on thine own terms, and come as speedily as thou canst. I do not reckon the promise I made the less binding, that you very generously make no allusion to it. \\n\\n \\n\\n “Thine, “ETHERINGTON. \\n\\n \\n\\n “P.S. One single caution I must add — do not mention my name to any one at Harrowgate, or your prospect of meeting me, or the route which you are about to take. On the purpose of your journey, it is unnecessary to recommend silence. I know not whether such doubts are natural to all who have secret measures to pursue, or whether nature has given me an unusual share of anxious suspicion; but I cannot divest myself of the idea, that I am closely watched by some one whom I cannot discover. Although I concealed my purpose of coming hither from all mankind but you, whom I do not for an instant suspect of blabbing, yet it was known to this Martigny, and he is down here before me. Again, I said not a word — gave not a hint to any one of my views towards Clara, yet the tattling people here had spread a report of a marriage depending between us, even before I could make the motion to her brother. To be sure, in such society there is nothing talked of but marrying and giving in marriage; and this, which alarms me, as connected with my own private purposes, may be a bare rumour, arising out of the gossip of the place — Yet I feel like the poor woman in the old story, who felt herself watched by an eye that glared upon her from behind the tapestry. \\n\\n \\n\\n “I should have told you in my last, that I had been recognised at a public entertainment by the old clergyman, who pronounced the matrimonial blessing on Clara and me, nearly eight years ago. He insisted upon addressing me by the name of Valentine Bulmer, under which I was then best known. It did not suit me at present to put him into my confidence, so I cut him, Harry, as I would an old pencil. The task was the less difficult, that I had to do with one of the most absent men that ever dreamed with his eyes open. I verily believe he might be persuaded that the whole transaction was a vision, and that he had never in reality seen me before. Your pious rebuke, therefore, about what I told him formerly concerning the lovers, is quite thrown away. After all, if what I said was not accurately true, as I certainly believe it was an exaggeration, it was all Saint Francis of Martigny’s fault, I suppose. I am sure he had love and opportunity on his side. \\n\\n \\n\\n “Here you have a postscript, Harry, longer than the letter, but it must conclude with the same burden — Come, and come quickly.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1316/39645.html","bookId":1489,"book":{"id":1489,"title":"Saint Ronan\u0027s Well","description":"简介： We have seldom found Sydney Smith giving higher praise, and nobody can deny the justice of the censure with which it is qualified. Scott himself explains, in his Introduction, how, in his quest of novelty, he invaded modern life, and the domain of Mi...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1316","creation":"Aug 1, 2019 12:25:17 AM","modification":"Aug 1, 2019 12:25:17 AM"}}
