{"id":74735,"no":32,"title":"Page 32","content":"Connor sighed, and shook his head. \"It\u0027s not,\" he said. \"And now we must resolve everything before you meet your wife at four o\u0027clock. So let\u0027s make sure we are done by then.\" Chapter 15 \"Christ, I\u0027d say it\u0027s pretty fucking wrapped up,\" Graham said. He was walking around Sakamura\u0027s house in the Hollywood hills. The last of the SID teams was packing up cases to leave. \"I don\u0027t know why the chief has such a bug up his ass on this,\" Graham said. \"The SID boys have been doing most of their work right here, on the spot, because he\u0027s in such a rush. But thank God: everything ties up perfect. Sakamura is our boy. We combed his bed for pubic hair - it matches the pubic hair found on the girl. We got dried saliva off his toothbrush. It matches blood type and genetic markers for the sperm inside the dead girl. Matchup is ninety-seven percent sure. It\u0027s his come inside her, and his pubic hair on her body. He fucked her and then he killed her. And when we came to arrest him, he panicked, made a break for it, and died as a result. Where is Connor?\" \"Outside,\" I said. Through the windows, I could see Connor standing down by the garage, talking to policemen in a black-and-white patrol car. Connor was pointing up and down the street; they were answering questions. \"What\u0027s he doing down there?\" Graham said. I said I didn\u0027t know. \"Damn, I don\u0027t understand him. You can tell him the answer to his question is no.\" \"What question?\" \"He called me an hour ago,\" Graham said. \"Said he wanted to know how many pairs of reading glasses we found here. We checked. The answer is, no reading glasses. Lots of sunglasses. Couple of pairs of women\u0027s sunglasses. But that\u0027s it. I don\u0027t know why he cared. Strange man, isn\u0027t he? What the hell is he doing now?\" We watched as Connor paced back and forth around the squad car, then pointed up and down the road again. One man was in the car, talking on the radio. \"Do you understand him?\" Graham said. \"No, I don\u0027t.\" \"He\u0027s probably trying to track down the girls,\" Graham said. \"Christ, I wish we had gotten the ID on that redhead. Especially now it\u0027s turned out this way. She must have fucked him, too. We could have gotten some sperm from her, and made an exact match with all the factors. And I look like a horse\u0027s ass, letting the girls get away. But shit, who knew it was going to go that way. It was all so fast. Naked girls up here, prancing around. A guy gets a little confused. It\u0027s natural. Shit, they were good-looking, weren\u0027t they?\" I said they were. \"And there\u0027s nothing left of Sakamura,\" Graham said. \"I talked to the PEO boys an hour ago. They\u0027re downtown, cutting the corpse out of the car, but I guess he\u0027s burned beyond identification. The M.E.\u0027s office is going to try, but good luck.\" He stared unhappily out the window. \"You know what? We did the best we could with this fucking case,\" he said. \"And I think we did pretty good. We got the right guy. We did it fast, no fuss no muss. But all I hear now is a lot of Japan-bashing. Fuck. You can\u0027t win.\" \"Uh-huh,\" I said. \"And Christ they have juice now,\" Graham said. \"The heat on my ass is terrific. I got the chief calling me, wanting this thing wrapped up. I got some reporter at the Times investigating me, hauling out some old shit about a questionable use of force on a Hispanic back in 1978. Nothing to it. But this reporter, he\u0027s trying to show I\u0027ve always been a racist. And what is the background of his story? That last night was a \u0027racist\u0027 incident. So I am now an example of racism rearing its ugly head again. I tell you. The Japanese are masters of the smear job. It\u0027s fucking scary.\" \"I know,\" I said. \"They getting to you, too?\" I nodded. \"For what?\" \"Child abuse.\" \"Christ,\" Graham said. \"And you got a daughter.\" \"Yes.\" \"Doesn\u0027t it piss you off? Innuendo and smear tactics, Petey-san. Nothing to do with reality. But try and tell that to a reporter.\" \"Who is it?\" I asked. \"The reporter talking to you.\" \"Linda Jensen, I think she said.\" I nodded. Linda Jensen was the Weasel\u0027s protege. Somebody once said that Linda didn\u0027t fuck her way to the top. She fucked other people\u0027s reputations to the top. She had been a gossip columnist in Washington before graduating to the big time in Los Angeles. \"I don\u0027t know,\" Graham said, shifting his bulk. \"Personally, I think it\u0027s not worth it. They\u0027re turning this country into another Japan. You\u0027ve already got people afraid to speak. Afraid to say anything against them. People just won\u0027t talk about what\u0027s happening.\" \"It would help if the government passed a few laws.\" Graham laughed. \"The government. They own the government. You know what they spend in Washington every year? Four hundred million fucking dollars a year. That\u0027s enough to pay the campaign costs of everybody in the United States Senate and the House of Representatives. That is a lot of fucking money. Now you tell me. Would they spend all that money, year after year, if it wasn\u0027t paying off for them? Of course they wouldn\u0027t. Shit. The end of America, buddy. Hey. Looks like your boss wants you.\" I looked out the window. Connor was waving to me. I said, \"I better go.\" \"Good luck,\" Graham said. \"Listen. I may take a couple of weeks off.\" \"Yeah? When?\" \"Maybe later today,\" Graham said. \"The chief mentioned it. He said as long as the fucking Times is on my ass, maybe I should. I\u0027m thinking of a week in Phoenix. I got family there. Anyway, I wanted you to know, I might be going.\" \"Okay, sure,\" I said. Connor was still waving to me. He seemed impatient. I hurried down to see him. As I came down the steps, I saw a black Mercedes sedan pull up, and a familiar figure emerge. It was Weasel Wilhelm. Chapter 16 By the time I got down there, the Weasel had his notepad and tape recorder out. A cigarette hung from the corner of his mouth. \"Lieutenant Smith,\" he said. \"I wonder if I could talk to you.\" \"I\u0027m pretty busy,\" I said. \"Come on,\" Connor called to me. \"Time\u0027s a\u0027wasting.\" He was holding the door open for me. I started toward Connor. The Weasel fell in step with me. He held a tiny black microphone toward my face. \"I\u0027m taping, I hope you don\u0027t mind. After the Malcolm case, we have to be extra careful. I wonder if you would comment on racial slurs allegedly made by your associate Detective Graham during last night\u0027s Nakamoto investigation?\" \"No,\" I said. I kept walking. \"We\u0027ve been told he referred to them as \u0027fucking Japs.\u0027 \" \"I have no comment,\" I said. \"He also called them \u0027little Nips.\u0027 Do you think that kind of talk is appropriate to an officer on duty?\" \"Sorry. I don\u0027t have a comment, Willy.\" He held the microphone up to my face as we walked. It was annoying. I wanted to slap it away, but I didn\u0027t. \"Lieutenant Smith, we\u0027re preparing a story on you and we have some questions about the Martinez case. Do you remember that one? It was a couple of years back.\" I kept walking. \"I\u0027m pretty busy now, Willy,\" I said. \"The Martinez case resulted in accusations of child abuse brought by Sylvia Morelia, the mother of Maria Martinez. There was an internal affairs investigation. I wondered if you had any comment.\" \"No comment.\" \"I\u0027ve already talked to your partner at that time, Ted Anderson. I wondered if you had any comment on that.\" \"Sorry. I don\u0027t.\" \"Then you aren\u0027t going to respond to these serious allegations against you? \u0027 \"The only one I know that\u0027s making allegations is you, Willy.\" \"Actually, that\u0027s not entirely accurate,\" he said, smiling at me. \"I\u0027m told the D.A.\u0027s office has started an investigation.\" I said nothing. I wondered if it was true. \"Under the circumstances, Lieutenant, do you think the court made a mistake in granting you custody of your young daughter?\" All I said was, \"Sorry. No comment, Willy.\" I tried to sound confident. I was starting to sweat. Connor said, \"Come on, come on. No time.\" I got into the car. Connor said to Wilhelm, \"Son, I\u0027m sorry, but we\u0027re busy. Got to go.\" He slammed the car door. I started the engine. \"Let\u0027s go,\" Connor said. Willy stuck his head in the window. \"Do you think that Captain Connor\u0027s Japan-bashing represents another example of the department\u0027s lack of judgment in racially sensitive cases?\" \"See you, Willy.\" I rolled up the window, and started driving down the hill. \"A little faster wouldn\u0027t bother me,\" Connor said. \"Sure,\" I said. I stepped on the gas. In the rearview mirror, I saw the Weasel running for his Mercedes. I took the turn faster, tires squealing. \"How did that lowlife know where to find us? He monitoring the radio?\" \"We haven\u0027t been on the radio,\" Connor said. \"You know I\u0027m careful about the radio. But maybe the patrol car phoned in something when we arrived. Maybe we have a bug in this car. Maybe he just figured we\u0027d turn up here. He\u0027s a scumbag. And he\u0027s connected to the Japanese. He\u0027s their plant at the Times. Usually the Japanese are a little more classy about who they associate with. But I guess he\u0027ll do everything they want done. Nice car, huh?\" \"I notice it\u0027s not Japanese.\" \"Can\u0027t be obvious,\" Connor said. \"He following us?\" \"No. I think we lost him. Where are we going now?\" \"U.S.C. Sanders has had enough time screwing around by now.\" We drove down the street, down the hill, toward the 101 freeway. \"By the way,\" I said. \"What was all that about the reading glasses?\" \"Just a small point to be verified. No reading glasses were found, right?\" \"Right. Just sunglasses.\" \"That\u0027s what I thought,\" Connor said. \"And Graham says he\u0027s leaving town. Today. He\u0027s going to Phoenix.\" \"Uh-huh.\" He looked at me. \"You want to leave town, too?\" \"No,\" I said. \"Okay,\" Connor said. I got down the hill and onto the 101 going south. In the old days it would be ten minutes to U.S.C. Now it was more like thirty minutes. Especially now, right at midday. But there weren\u0027t any fast times, anymore. Traffic was always bad. The smog was always bad. I drove through haze. \"You think I\u0027m being foolish?\" I said. \"You think I should pick up my kid and run, too?\" \"It\u0027s one way to handle it.\" He sighed. \"The Japanese are masters of indirect action. It\u0027s their instinctual way to proceed. If someone in Japan is unhappy with you, they never tell you to your face. They tell your friend, your associate, your boss. In such a way that the word gets back. The Japanese have all these ways of indirect communication. That\u0027s why they socialize so much, play so much golf, go drinking in karaoke bars. They need these extra channels of communication because they can\u0027t come out and say what\u0027s on their minds. It\u0027s tremendously inefficient, when you think about it. Wasteful of time and energy and money. But since they cannot confront - because confrontation is almost like death, it makes them sweat and panic - they have no other choice. Japan is the land of the end run. They never go up the middle.\" \"Yeah, but...\" \"So behavior that seems sneaky and cowardly to Americans is just standard operating procedure to Japanese. It doesn\u0027t mean anything special. They\u0027re just letting you know that powerful people are displeased.\" \"Letting me know? That I could end up in court over my daughter? My relationship with my kid could be ruined? My own reputation could be ruined?\" \"Well, yes. Those are normal penalties. The threat of social disgrace is the usual way you\u0027re expected to know of displeasure.\" \"Well, I think I know it, now,\" I said. \"I think I get the fucking picture.\" \"It\u0027s not personal,\" Connor said. \"It\u0027s just the way they proceed.\" \"Yeah, right. They\u0027re spreading a lie.\" \"In a sense.\" \"No, not in a sense. It\u0027s a fucking lie.\" Connor sighed. \"It took me a long time to understand,\" he said, \"that Japanese behavior is based on the values of a farm village. You hear a lot about samurai and feudalism, but deep down, the Japanese are farmers. And if you lived in a farm village and you displeased the other villagers, you were banished. And that meant you died, because no other village would take in a troublemaker. So. Displease the group and you die. That\u0027s the way they see it. \"It means the Japanese are exquisitely sensitive to the group. More than anything, they are attuned to getting along with the group. It means not standing out, not taking a chance, not being too individualistic. It also means not necessarily insisting on the truth. The Japanese have very little faith in truth. It strikes them as cold and abstract. It\u0027s like a mother whose son is accused of a crime. She doesn\u0027t care much about the truth. She cares more about her son. The same with the Japanese. To the Japanese, the important thing is relationships between people. That\u0027s the real truth. The factual truth is unimportant.\" \"Yeah, fine,\" I said. \"But why are they pushing now? What\u0027s the difference? This murder is solved, right?\" \"No, it\u0027s not,\" Connor said. \"It\u0027s not?\" \"No. That\u0027s why we have all the pressure. Obviously, somebody badly wants it to be over. They want us to give it up.\" \"If they are squeezing me and squeezing Graham - how come they\u0027re not squeezing you?\" \"They are,\" Connor said. \"How?\" \"By making me responsible for what happens to you.\" \"How are they making you responsible? I don\u0027t see that.\" \"I know you don\u0027t. But they do. Believe me. They do.\" I looked at the line of cars creeping forward, blending into the haze of downtown. We passed electronic billboards for Hitachi (#1 IN COMPUTERS IN AMERICA), for Canon (AMERICA\u0027S COPY LEADER), and Honda (NUMBER ONE RATED CAR IN AMERICA!). Like most of the new Japanese ads, they were bright enough to run in the daytime. The billboards cost thirty thousand dollars a day to rent; most American companies couldn\u0027t afford them.","sourceLink":"https://allnovel.net/rising-sun/page-32.html","bookId":2407,"book":{"id":2407,"title":"Rising Sun","description":"Storyline: During the grand opening celebration of the new American headquarters of an immense Japanese conglomerate, the dead body of a beautiful woman is found. The investigation begins, and immediately becomes a headlong chase through a twisting maze of industrial intrigue and a violent business battle that takes no prisoners.","cover":"https://allnovel.net/images/rising-sun.jpg","author":"Michael Crichton","type":"Mystery","source":"allnovel","link":"https://allnovel.net/rising-sun.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:32:07 AM"}}
