{"id":110764,"no":19,"title":"Page 19","content":"MRS. SENTAS, ANSWERED THE DOOR. It was a few minutes past seven that evening.\n \"Yes?\" she said. She spoke in a withdrawn, regal manner.\n \"May I speak to you and your husband, Mrs. Sentas?\" I asked.\n \"Speak to us about what?\" she asked, frowning curiously.\n I cleared my throat. \"It\u0027s-rather delicate,\" I said. \"May I come in?\" She stared at me a while as if she couldn\u0027t make up her mind whether I was human or not. Then, with an expression of distaste, she asked, \"Is it absolutely necessary? My husband and I are getting ready to go out.\"\n \"It\u0027s about your sister,\" I said.\n If I had jabbed her with a needle I couldn\u0027t have gotten a more forceful twitch from her.\n \"My-?\" She stopped.\n \"May I come in?\" I asked.\n Swallowing, she stepped back. I walked past her into the living room and she closed the door.\n \"Sit down, please,\" she told me.\n I glanced around as I sat on the sofa. It was a duplicate of our living room as far as size went. There the resemblance ended. Where ours was furnished in early-American time-payment, the Sentas\u0027 was strictly French provincial and that of the most elegant variety-black-marble-topped tables, antique chairs and sofas, gilded mirrors, thick drapes and thicker carpeting. Without the aid of mediumship I would have laid odds that it was all the result of Mrs. Sentas\u0027 taste.\n She settled on the edge of a period chair as Mr. Sentas came out of the kitchen, a drink in his hand.\n \"What\u0027s up?\" he asked, looking over at me as if I were an intruding salesman.\n \"Mr. Wallace says he has something to tell us about Helen,\" said his wife.\n \"Oh?\" Moving to another chair Sentas sat down. \"Well?\" he asked. I swallowed nervously. It was one thing to make statements to Anne; quite another to sit facing the Sentas\u0027 with what I had to say.\n \"I-wonder,\" I began, \"if you could tell me whether you\u0027ve heard from your sister lately-\"\n \"Why d\u0027ya ask?\" Harry Sentas broke in before I\u0027d finished.\n \"I have a reason,\" I said. \"Have you?\"\n \"Don\u0027t see where it\u0027s any of your-\" he started.\n \"Harry.\" She spoke quietly but it muted him in an instant. I turned to Mrs. Sentas. She looked a trifle drawn.\n \"Why do you ask?\" she inquired.\n \"What\u0027d ya do, open a letter she sent us?\" Harry Sentas challenged me. I looked at her a moment before answering.\n \"No,\" I said, glancing at him.\n \"Mr. Wallace, I asked you a question,\" Mrs. Sentas said coldly. I looked at her again. Behind that forbidding exterior I sensed an abject fear.\n \"I asked, Mrs. Sentas, because I have something to tell you about your sister. But first I have to know if-\"\n \"Tell us what?\" she demanded.\n \"I\u0027m afraid you\u0027ll have to bear with me.\"\n \"Mr. Wallace I demand to know what you\u0027re talking about!\"\n \"I\u0027m talking about your sister, Mrs. Sentas,\" I said. \"I think she\u0027s dead.\" Mrs. Sentas twitched, then sat motionless.\n \"What are you talkin\u0027 about!\" Harry Sentas asked loudly. He put down the glass with a bang and stood up. \"Look here, boy!\"\n \"Harry...\" Her voice faltered as she spoke.\n It was silent. I regretted having put it so bluntly even if she had, virtually, forced it from me. Mrs. Sentas drew in a trembling breath.\n \"Why do you say she\u0027s...\" She seemed unable to finish.\n I braced myself.\n \"Because,\" I said, \"I\u0027ve seen her in our house.\"\n \"What?\" Mrs. Sentas leaned forward, her dark eyes stricken.\n \"I\u0027ve seen her,\" I repeated.\n Mrs. Sentas shuddered.\n \"Who the hell d\u0027ya think you are comin\u0027 in here with a cock \u0027n\u0027 bull story like that!\" Sentas flared. \"God damn it, I got half a mind to-!\"\n \"It\u0027s not a-\" I started.\n \"I don\u0027t know what your game is,\" he said, pointing at me, \"but you better watch it. I\u0027m warnin\u0027 ya.\"\n \"Harry...\"\n He broke off and looked nervously at Mrs. Sentas. \"Look, Mildred,\" he said, \"this is some kind of-\" He broke off again-instantly-as she shook her head.\n \"You haven\u0027t heard from her, have you?\" I said.\n Her voice was hollow. \"Not since she went back to New York,\" she said.\n \"How long ago was that?\"\n \"Almost a year now.\"\n \"Look, fella, we don\u0027t want t\u0027hear anymore o\u0027 this, y\u0027understand?\" said Sentas.\n \"Harry, please.\"\n \"Look,\" he said to his wife, \"are we gonna sit here \u0027n\u0027 listen to all this bullsh-\" He stopped and glared at me. \"You get outta here,\" he ordered. \"Right now!\"\n I stood up.\n \"Mr. Wallace, what do you mean, you\u0027ve seen my sister in your house?\" Mrs. Sentas asked, her voice rising.\n \"I mean what I said,\" I answered. \"I\u0027ve seen her. If you want to see her too be at my house in an hour.\"\n \"God damn it, boy, you get the hell outta here!\" roared Sentas. He started for me.\n \"Stay away from me,\" I said and headed for the door.\n \"Mr. Wallace!\"\n I turned. Mrs. Sentas was on her feet, staring at me.\n \"If this is some kind of joke...\" she began tensely.\n I opened the door. \"It\u0027s no joke,\" I said.\n Sentas reached the door. He slammed it violently behind me, hitting the heel of my shoe.\n \"You come back here again, I\u0027ll call the cops!\" he yelled.\n I exhaled wearily as I walked out to the sidewalk. Across the street I saw Elizabeth sitting on her lawn. Anne was standing beside her and both of them were looking across the street at me. Doubtless the noise of the slammed door had attracted them. Anne said something to Elizabeth, then came across the street.\n \"Well, that was a great big nothing,\" I said as she came into the house after me.\n \"They won\u0027t come?\"\n \"Hell, no,\" I said, ruefully. \"Sentas practically threw me out of the house. He\u0027ll probably evict us next month. That is, she will.\"\n Anne clucked. \"Now what?\" she asked.\n I shrugged and blew out a long breath. \"Lord knows,\" I said.\n Anne looked at me without saying anything.\n \"How\u0027s Elizabeth?\" I asked.\n \"How could she be?\" she asked. \"She\u0027s alive; no more.\"\n \"That poor woman,\" I said.\n \"I-told her about...\"\n \"What?\"\n \"About what\u0027s happened. Not all of it, of course. Just about Helen Driscoll.\"\n \"Oh.\" I shook my head. \"That\u0027s guaranteed to cheer her up,\" I said.\n \"Well, she saw you going into Sentas\u0027 house and asked if you were having trouble with them.\" I nodded. Then I sank down on the green chair. \"Well,\" I said, \"we are exactly nowhere. If only-\" The telephone rang. \"Oh, it\u0027ll wake up Richard,\" Anne said hurrying for the hall as fast as she could.\n \"Hello?\" I heard her say quietly. Silence. Then, \"Oh?\" Pause. \"Yes. That\u0027s right.\" Another pause.\n \"Good-bye.\"\n She came back, looking surprised.\n \"They\u0027re coming,\" she said.\n At eight-fifteen the doorbell rang.\n \"I\u0027ll get it,\" I said. We were in the kitchen finishing up the dishes.\n \"Tom?\"\n I stopped in the doorway. \"Yes?\"\n \"Will it be-terrible?\"\n I started to lie, then restrained it. \"I don\u0027t know, honey,\" I told her, \"honestly, I don\u0027t know what will happen. That\u0027s why I want you to go over to Elizabeth\u0027s house until it\u0027s over.\" The doorbell rang again. Anne shook her head.\n \"I won\u0027t leave you alone,\" she said. \"If you-go off or something I want to be here.\" I smiled. \"It could be nothing at all,\" I said, \"but we might as well try to get this thing settled.\" The doorbell rang insistently. I could visualize Sentas pushing at it, thin-lipped, impatient.\n \"You\u0027d better let him in before he kicks it down,\" Anne said, trying to sound amused.\n \"No fear of that,\" I said. \"He wouldn\u0027t hurt his own property. His wife\u0027s property, that is.\" I walked across the living room and opened the door.\n \"Hello,\" I said.\n Sentas grunted. Mrs. Sentas nodded once. They came in and I noted how they stared at the card table and four chairs in the middle of the living room.\n Anne came in. \"Good evening.\" she said.\n Sentas grunted again. \"Mrs. Wallace,\" said Mildred Sentas, stiffly polite.\n \"Want to sit down?\" Anne invited.\n They took their places awkwardly, without comfort.\n \"Now look,\" Sentas started before we were seated. \"Don\u0027t think for a minute we go along with this story o\u0027 yours. We don\u0027t. But my wife here\u0027s worried about not hearin\u0027 from her sister, see? That\u0027s why we\u0027re here. If this is a joke or anything...\" He didn\u0027t finish. He didn\u0027t have to.\n \"I assure you it isn\u0027t a joke,\" I said.\n \"Then what is it?\" asked Mrs. Sentas. \"What did you mean telling us to come over here if we want to see my sister?\"\n \"I meant-\"\n \"And what about your kid talkin\u0027 t\u0027me the other night?\" accused Sentas. \"I suppose that wasn\u0027t a joke.\" I looked at his angry face.\n \"You don\u0027t really think that was him talking, do you?\" I asked. He started to blurt a reply, then sat with his mouth open. \"What d\u0027ya mean?\" he asked then in a vaguely frightened voice.\n \"I think it was your sister-in-law,\" I said.\n \"What?\"\n \"Mr. Wallace, I\u0027ve had enough of this!\" Mrs. Sentas interrupted angrily. \"Either you explain yourself or we\u0027re leaving!\"\n \"I\u0027ll be glad to explain,\" I said.\n Quickly, omitting the variety of small detail, I told them about the hypnosis and its results.\n \"This is- true?\" asked Mrs. Sentas incredulously when I\u0027d finished.\n \"If you wish you can call Dr. Porter for verification,\" I told her.\n \"I may do that,\" she said.\n \"Well, I never heard such a load o\u0027 crap in my life,\" Sentas spoke up; but his voice lacked his usual blunt assurance.\n \"I still don\u0027t see why you say my sister is-dead,\" said Mrs. Sentas.\n \"I said I think she is,\" I answered. \"That\u0027s why I asked you if you\u0027d heard from her. The fact that you haven\u0027t...\"\n \"You\u0027re telling us that what you\u0027ve seen is her- ghost?\" she asked contemptuously.\n \"I think it is,\" I said. I didn\u0027t look at Anne.\n \"I trust you-\"\n \"Come on!\" Sentas said.\n \"I trust you realize what you\u0027re asking us to believe,\" Mrs. Sentas repeated, stiffly.\n \"I realize it,\" I said. \"But it\u0027s your sister I\u0027ve seen. I\u0027m sure of it now.\"\n \"How do you know it was her?\" asked Mrs. Sentas. \"Assuming you saw anything-which I doubt.\" I told her about the dress, about Elizabeth verifying me.\n \"You saw this?\" she whispered. \"In here?\"\n \"Oh, for chrissake!\" Sentas broke in. \"He saw a picture o\u0027 Helen and he\u0027s tryin\u0027 t\u0027pull somethin\u0027 on us!\n What d\u0027ya-!\"\n \"Pull what, Mr. Sentas?\" I interrupted, coldly. \"Just what have I to gain by telling you these things?\" He started to answer, then checked himself and glared at me. I turned back to his wife.\n \"When did your sister leave California?\" I asked her.\n \"Last September,\" she answered.\n \"I don\u0027t mean to pry,\" I said, \"but-did she have any special reason?\" She shook her head. \"No, she did not.\"\n \"She didn\u0027t act-strangely when she left?\"\n \"We didn\u0027t see her leave, Mr. Wallace.\"\n The words acted on me like an electric shock. I stared at her. \"I don\u0027t understand,\" I said.\n \"She just left us a note,\" said Mrs. Sentas.\n I tried to hold back the thunderous beating of my heart.\n \"I see,\" I said. \"Well... shall we try to-?\" I gestured toward the card table and chairs.\n \"Come on, Mildred, let\u0027s get the hell outta here,\" Sentas said. She waved his words aside, looking at me intently. \"What do you hope to accomplish, Mr. Wallace?\" she asked. \"I may as well tell you I don\u0027t believe a word of this talk. But I am concerned about Helen.\"\n \"It\u0027s very simple,\" I said. \"We sit around that card table and I try to-locate your sister, so to speak.\"\n \"Oh, for-!\" Sentas stood up with a heavy thump. \"Maybe you\u0027re crazy enough t\u0027 stay here, Mildred, but I ain\u0027t!\"\n \"We\u0027ll stay.\" It was all she said but, in a second, I sensed the entire relationship between her and Sentas: the ignorant, loud-mouthed man married to the ugly but well-to-do woman; the woman preferring this to sterile spinsterhood.\n I stood up. \"Shall we sit down then?\" I suggested.\n Without a word, Anne and Mrs. Sentas took their places at the table. Mrs. Sentas sat very stiffly, her face an emotion-stripped mask. With a muttered curse, her husband sat across from me, the chair creaking beneath his bulk. He crossed his arms and looked balefully at me. There was something animal in his eyes-and in his mind. I felt waves of it buffeting at me, cold with animosity.\n \"All right,\" I said, trying to ignore him, \"just sit quietly, please.\" Mrs. Sentas didn\u0027t move. Anne looked at me fearfully and shuddered. Sentas leaned back in the chair and it squeaked. \"Lotta crap,\" he muttered.\n Then it was silent. I waited until they were settled fully and closed my eyes. The only sound I could hear was the heavy breathing of Harry Sentas. I tried to blank my mind, feeling positive that something was going to happen. I don\u0027t know why I felt so sure; it was just a conviction in my mind. After a while I began to wonder why Sentas was breathing so hard. Until, abruptly, with a last fleck of consciousness, I realized that it was me. My chest was laboring with breath and clouds of darkness were settling over my mind. I felt my feet and ankles, hand and wrists going ice cold. My breath grew heavier yet, until it was a violent, body-wrenching intake and output of air. I caught a momentary vision of the three of them staring at me. Then I was gone.\n Anne told me later what happened.\n Almost as soon as I closed my eyes my breathing became agitated. My head went limp on my neck and lolled from side to side; my hands which started on my lap slid off and hung limply, twitching once in a while; my features went slack, mouth slipping open, all my features losing definition, becoming plastic and devoid of personality.\n This went on for many minutes.\n Then, suddenly, the accelerated breathing stopped and it was dead quiet. They gasped as my head snapped up alertly, eyes still shut. There was a dry clicking in my throat, a rattling, a gagging crackle-like the sound of an idiot attempting speech.\n Which speech came.\n \"Mildred,\" I said, flatly, expressionlessly.\n Mrs. Sentas gasped and cringed in her chair, her dark eyes fixed to my face.\n \"Mildred,\" I said. \"Mildred.\"\n There was a quick, dry exhalation from her.\n \"You-you\u0027d better answer,\" Anne told her in a whisper.\n \"Mildred?\" I insisted.\n \"... yes,\" she said.\n My face fell abruptly into an expression of utter despair. \"Mildred\" I said, my voice breaking with emotion. \"Oh, God, Mildred. Where are you?\"\n \"Oh...\" Mrs. Sentas was trembling, staring at me in horror.\n I stretched out my hand. \"Mildred?\"\n \"No,\" she whimpered, drawing back.\n \"Mildred?\" I reached around for her.\n \"God damn it, stop it,\" muttered Sentas.\n I touched her cold, shaking hand and held it. Mrs. Sentas moaned. She tried to draw it back but I wouldn\u0027t let her.\n \"I\u0027m sorry, Mildred,\" I said, miserably. \"Oh, God, I\u0027m so sorry, darling.\" A wild-eyed Sentas started to reach out but Anne held up a hand and blocked him. \"No!\" she whispered furiously.\n \"Mildred,\" I said, \"it\u0027s me, Helen.\"\n Mrs. Sentas suddenly bent over, sobbing helplessly.\n \"Mildred, don\u0027t hate me,\" I said, \"please don\u0027t hate me.\"\n \"Stop this damn-!\"\n Sentas broke off abruptly as, with a serpent like hiss, I jerked back my hand and sat erect in my chair. Suddenly, my eyes opened.\n I stared at him.\n \"Come on, let\u0027s go,\" he said to his wife, apparently thinking I was now awake.\n \"Harry,\" I said in a terrible voice.\n He glared at me. \"Look, boy,\" he started, then was quiet, staring at me, open-mouthed, suddenly realizing that I wasn\u0027t awake at all.\n \"Harry,\" I said, \"Harry Sentas.\" My teeth clenched and breath began to hiss between my teeth. \"God damn you to hell, Harry, you dirty bastard, you. You filthy son-of-a-\" Suddenly, I closed my eyes and threw a hand over my eyes. \"Oh, God what have I done?\" I sobbed. I raised my head. I held out imploring hands toward Harry\n Sentas, my cheeks covered with running tears. \"Harry, why?\" I asked. \"Why, Harry, why?\" With a hoarse shout, Harry Sentas flung the table over me, sending me sprawling back on the floor. \n","sourceLink":"https://allnovel.net/a-stir-of-echoes/page-19.html","bookId":2543,"book":{"id":2543,"title":"A Stir of Echoes","description":"Storyline: \n Tom Wallace lived an ordinary life, until a chance event awakened psychic abilities he never knew he possessed. Now he\u0027s hearing the private thoughts of the people around him-and learning shocking secrets he never wanted to know. But as Tom\u0027s existence becomes a waking nightmare, even greater jolts are in store as he becomes the unwilling recipient of a compelling message from beyond the grave! \n This eerie ghost story, by award-winning author of \"Hell House\" and \"I Am Legend,\" inspired the acclaimed 1999 film starring Kevin Bacon.\n \n","cover":"https://allnovel.net/images/a-stir-of-echoes.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-stir-of-echoes.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:04:32 AM"}}
