{"id":110766,"no":21,"title":"Page 21","content":"\"LIZ, WHAT ARE YOU-\" ANNE GOT NO FARTHER. She stared blankly at the pistol. I stood without a word looking at Elizabeth\u0027s pale, tension-sick face. For all my talk, I thought; for all my celebrated awareness, I was as astounded by this as if I\u0027d never sensed a thing. \"Liz, what is this?\" Anne said. Elizabeth\u0027s eyes were terrible to look at. \"You,\" I said, incredulously, \"you?\" \"Don\u0027t you talk to me like that,\u0027 Elizabeth said; and I twitched as her finger started to tense on the trigger. \"Elizabeth?\" Anne didn\u0027t understand. It was obvious by the confused, distraught sound in her voice. \"You had to meddle, didn\u0027t you?\" Elizabeth said to me. \"Had to meddle.\" \"Elizabeth,\" I said, \"put... put that gun away.\" \"You\u0027d like that, wouldn\u0027t you?\" she said. \"You\u0027d like it if the police had taken it away from me. But they didn\u0027t-because Frank said it was an accident. Wasn\u0027t that nice of him?\" All the contempt and hatred she\u0027d been repressing for months seemed to edge her voice. \"What is this?\" Anne demanded to know. \"May I sit down?\" I asked Elizabeth. \"May you sit down,\" she echoed scornfully. \"What\u0027s the difference what you do?\" I sat down slowly so the movement wouldn\u0027t startle her. I put my hand over Anne\u0027s. \"Liz?\" asked my wife. \"Don\u0027t you make a pretty picture,\" said Elizabeth, ignoring her. \"A pretty picture.\" It started as scorn but ended in almost a sob. \"Elizabeth, put that gun-\" \"Shut up!\" A tear sped down her cheek but she didn\u0027t seem to notice it. \"I don\u0027t want to hear anything from you.\" \"Elizabeth, what is it?\" Anne asked, still not knowing. \"Elizabeth is the-\" I started to tell Anne. \"Stop whispering!\" Elizabeth ordered. \"Liz, you\u0027ll wake up-\" Anne broke off as, with a bolt of panic, I squeezed her hand sharply. \"-Richard?\" finished Elizabeth, her eyes glittering. \"Your baby?\" I heard Anne gasp in a breath of air. \"What...?\" she murmured. \"Tell us about it, Liz,\" I said, quickly. \"If we can help we\u0027ll-\" \"Help- \" Her laugh was a sick, convulsive sound. \"You\u0027re going to help me? You\u0027re going to give me back my baby? You are?\" I swallowed dryly. \"No, Elizabeth,\" I said, \"but we can help you with the police.\" She sat up straight in the chair, the skin tightening across her bloodless cheeks. \"You\u0027ll never see the police,\" she said. \"You\u0027ll never see anyone. You\u0027re a meddler. A damn meddler. I heard you when the Sentas\u0027 were here. I heard. I was outside on the porch. I heard. Damn meddler-!\" Her voice broke again and she drew in a rasping breath to hold back the sob. \"Elizabeth...\" Only a faint sound from my wife. \"You\u0027d like to know how I killed her, wouldn\u0027t you?\" said Elizabeth. \"How I killed that- bitch!\" The word coming from her lips sounded hideous. \"That\u0027s what she was,\" she said. \"She didn\u0027t care. No, she didn\u0027t care. It was al-always open season on men for her. Always. Any man. Any one. Even husbands, any husband.\" I heard Anne sob slightly. Good old Frank, I thought, good old, good old Frank. \"It wasn\u0027t-wasn\u0027t enough she was stealing her own s-sister\u0027s husband,\" Elizabeth said. \"No, n-no, that wasn\u0027t enough.\" The gun wavered in her hand. \"She had to branch out, had to get some other husbands too. Any one, any one would do. So long as they\u0027d- get in her filthy bed with her.\" Elizabeth spoke the last words through clenched teeth, her body trembling with mindless fury. \"Liz,\" I started but she paid no attention. \"I found out,\" she said, nodding, \"I found out. Everybody thinks I\u0027m so-so stupid. Poor old Liz. P-p-poor old Liz. Doesn\u0027t know a thing, not a thing. Poor old Liz. Just-just a stupid old-\" Another gasped-in sob shook her body. I started up. \"Sit down!\" she shouted fiercely; I shrank back quickly. She glared at me and it was obvious there was not much left in her that was sane. It was little wonder after what she\u0027d been through. \"I found out,\" she went on, nodding, a terrible, humorless smile on her lips, \"I found out. Frank thought I didn\u0027t know but I did. That\u0027s why he let me have a baby. You didn\u0027t know that, did you? I had to bargain for it. I had to make a bargain-\" Suddenly, her free hand clutched across her cheek and one eye. \"With my own husband I had to make a bargain so I could have a baby! That\u0027s wonderful, isn\u0027t that w-w-wonderful?\" \"Liz, don\u0027t,\" I muttered. It was sickening to listen to her pitiful voice spilling out all the horrors she\u0027d had to live with. \"Oh, you\u0027re going to hear all of it,\" she said, extending the Luger toward us. I pressed close to Anne, ready to jump in front of her if I had to. \"Every single dirty detail of it,\" she said. She sank back against the chair. \"Frank went out that night, I don\u0027t know where. Who cares where he went? Probably out with some girl, with some cheap-\" She stopped and shuddered fitfully, lips pressed together, her face the mask of a demented woman. \"I saw Sentas come over here,\" she said. \"His wife was out. So he came- creeping over here.\" Her voice was a contemptuous whine. \"Like a dog who smelled the air and knew there was a bitch around.\" Little Elizabeth; shy, quiet Elizabeth. \"He wasn\u0027t here long,\" she said. \"It didn\u0027t take them long. Then he came out. The house was dark so I went over. The door wasn\u0027t locked. And I went in. \"She wasn\u0027t in the living room. I knew she wouldn\u0027t be. There was only one place she\u0027d be, one place her kind would be. Lying on a bed. So I-I-\" She seemed breathlessly excited at the memory. \"I picked up the poker-that one over there; you didn\u0027t know that, did you? And I went in the bedroom.\" It was deathly still in the room-except for the harsh breathing of Elizabeth Wanamaker, who had wanted only to have a baby and be loved. \"She was still dressed,\" she said, her voice hard and savage. \"She still had her dress on. The black one!\" she said to me, smiling for an instant; awfully. \"The one you asked me about, remember? With-with the Aztec symbols on it? She hadn\u0027t even taken it off.\" Her voice was a hating whine again. \"She\u0027d just pulled it up over her hips. That\u0027s all! That\u0027s all she needed. Pull it up like a-like a-\" She flung a talon of a hand over her eyes again and there was a horrible sob in her chest, racking her. \"Oh, God!\" she cried, \"Oh, God. I killed her and I\u0027d kill her again! Again and again and again and again and again!\" A line of spittle ran across her jaw. She didn\u0027t even notice it. She sat there, panting. The End","sourceLink":"https://allnovel.net/a-stir-of-echoes/page-21.html","bookId":2543,"book":{"id":2543,"title":"A Stir of Echoes","description":"Storyline: Tom Wallace lived an ordinary life, until a chance event awakened psychic abilities he never knew he possessed. Now he\u0027s hearing the private thoughts of the people around him-and learning shocking secrets he never wanted to know. But as Tom\u0027s existence becomes a waking nightmare, even greater jolts are in store as he becomes the unwilling recipient of a compelling message from beyond the grave! This eerie ghost story, by award-winning author of \"Hell House\" and \"I Am Legend,\" inspired the acclaimed 1999 film starring Kevin Bacon.","cover":"https://allnovel.net/images/a-stir-of-echoes.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-stir-of-echoes.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:04:32 AM"}}
