{"id":110750,"no":5,"title":"Page 5","content":"I TOLD ANNE ABOUT IT that night after Phil had left for Berkeley. Richard was asleep and we were getting ready for bed. I was in my pajamas, Anne undressing by the closet. \"I don\u0027t understand what you mean,\" she said when I\u0027d finished. I shook my head slowly. \"I don\u0027t blame you,\" I said somberly. \"I don\u0027t understand it either.\" \"Well... what is it?\" she asked. \"You say you felt repelled by her but-\" She didn\u0027t finish; just stood there looking at me. \"That\u0027s it,\" I said, \"I-I think I must have known what was going on in her mind. I don\u0027t mean her thoughts exactly; not words or sentences.\" I gestured helplessly. \"What was behind her words I guess. What she felt.\" \"My God,\" Anne said. \"You make her sound like a monster.\" \"Maybe we\u0027re all monsters underneath,\" I said. I saw her shudder a little as she drew on her robe. She came over and sat down beside me. We were quiet for a moment. \"All right,\" she said, \"forgetting about Elsie for the moment. Do you think this is a carry-over from last night? Like... seeing that woman?\" \"I don\u0027t know what else it could be,\" I told her. She bit her lower lip. \"What could have happened?\" she asked. \"I don\u0027t know,\" I said. \"You saw it. Did I act-strange in any way while I was under hypnosis?\" She looked at me worriedly. \"Not that I can remember,\" she said. \"I\u0027ve seen people hypnotized before. I\u0027ve seen Phil hypnotize other people. They didn\u0027t act any different from the way you did.\" I sighed. \"I don\u0027t get it then.\" \"You should have told Phil,\" she said. \"Maybe he could have done something.\" \"How?\" I asked. \"As far as he was concerned the hypnosis was everything he wanted it to be. He\u0027d just say I\u0027m a little keyed up.\" \"I know, but...\" She looked so disturbed that I tried to sound a little less worried about it. \"Telepathy, you can have it.\" \"You really think that\u0027s what it is?\" \"I don\u0027t know what it is.\" I shrugged. \"I guess that\u0027s as good a word as any.\" \"It\u0027s-such a remote word,\" she said. \"You hear it spoken once in a blue moon. You read about it occasionally. But you never really think about it in personal terms.\" \"Well, maybe I\u0027m just jumping to conclusions,\" I said. \"It may just be a simple old nervous breakdown.\" She put her hand over mine. \"Well, if this... sort of thing goes on,\" she said, \"we\u0027ll go to Alan Porter.\" She smiled wryly. \"Or something.\" I smiled back. \"Or something; maybe to an asylum.\" \"Honey, don\u0027t talk like that.\" \"I\u0027m sorry.\" I put my arms around her and we pressed together. \"I got a friend in here needs a daddy,\" she murmured. \"Not some character in a padded cell.\" I kissed her. \"Tell your friend,\" I said, \"I accept his terms.\" I saw her again. It was the same as it had been the first time; the strange dark dress, the string of pearls at her throat, the hair all uncombed, a frame of tangled blackness around her white face. She was standing in the same way by the back window, looking at me. This time I could see more because I wasn\u0027t incapacitated by shock. I could see that she had a look of pleading on her face. As if she were asking me for something. \"Who are you?\" I asked again. Then I woke up. For a few moments, a surge of almost overwhelming relief flooded through me-and, with it, recognition. Phil was right, it hadn\u0027t been a ghost. It hadn\u0027t even been telepathy but only a dream. She wasn\u0027t real. I was safe. All these thoughts in the space of seconds. And gone sooner. Because I felt that tingling in my head again, that cramping tension in my guts. That same twisting aggravation of the flesh that had driven me from my bed the night before. And I knew-as surely as anything I had ever known that, if I got up and walked into the living room, she\u0027d be there waiting for me. I pushed my face into the pillow and lay there shuddering, fighting it. I wasn\u0027t going in there. I simply wasn\u0027t going in there! Suddenly I froze, listening. There was something in the hall; I heard the sound of it. A swishing crackle of a sound- like the skirt of a moving woman. Abruptly, there was a cry. Richard! A blade of terror plunged into my heart. Gasping, I threw back the covers and jumped up, rushed across the floor, lunging into the hall, into Richard\u0027s room. He was standing in his crib, crying and shivering in the darkness. Quickly, I pulled him up and pressed my cheek to his. \"Shhh, baby, it\u0027s all right,\" I whispered. \"It\u0027s all right, daddy\u0027s here.\" I felt a shudder ripple down my back and I held him tightly, patting his back with shaking fingers. \"It\u0027s all right baby; daddy\u0027s here. Go to sleep, sweetheart. It\u0027s all right.\" I felt his fear; felt it as distinctly as if it were a current of icy water trickling from his brain to mine. \"It\u0027s all right,\" I said. \"Go to sleep now. Daddy\u0027s here.\" I kept on talking to him until he fell asleep again. \"It\u0027s just a dream, baby. Just a dream.\" It had to be. Sunlight. And, with it, what passes for reason-a desperate groping for solace. I\u0027d only dreamed about the woman, imagined the rustling skirt; and Richard had only had a nightmare. The rest was fancy, a disorder of the nerves. That was my conclusion as I shaved. It is amazing how much one is willing to distort belief in the name of reason; how little one is willing to trust the intuitions of the flesh. A combination of things served to bolster my conclusion. The aforementioned sunlight-always a strong factor in enabling one to deny the fears of the night. Add to that a tasty breakfast, a sunny-countenanced wife, a happy, laughing baby son, the first day of a week\u0027s work, and you have arrayed a potent force against belief in all things that have no form or logic. By the time I left the house I was convinced. I walked across the street and up the alley beside Frank and Elizabeth\u0027s house; it was Frank\u0027s turn to drive. I knocked on the back door and went into their kitchen. Frank was still at the table, drinking coffee. \"Up, man,\" I said, \"we\u0027ll be late.\" \"That\u0027s what you always say,\" he said. \"Are we ever late?\" \"Often,\" I answered, winking at Elizabeth who was standing at the stove. \"False,\" said Frank, \"false as hell.\" He got up and stretched, groaning. \"Oh, God,\" he said, \"I wish it was Saturday.\" He walked out of the kitchen to get his suit coat. I asked Elizabeth how she was. \"Fine, thank you,\" she said. \"Oh, we\u0027d like you and Anne to come to dinner Wednesday night if you\u0027re free.\" I nodded. \"Fine. We\u0027d love to.\" Elizabeth smiled and we stood there a moment in silence. \"That was certainly interesting the other night,\" she said then. \"Yes,\" I said. \"Too bad I didn\u0027t get to see it.\" She laughed faintly. \"It was certainly interesting,\" she said. Frank came back in. \"Well, off to goddamn Siberia,\" he said disgustedly. \"Darling, don\u0027t forget to bring home some coffee when you-\" Elizabeth started to say. \"Hell, you get it,\" Frank interrupted angrily. \"You\u0027ve got all day to horse around. I\u0027m not going shopping after working all day in that lousy, goddamn plant.\" Elizabeth smiled feebly and turned back to the stove, a flush rising in her cheeks. I saw her throat move convulsively. \"Women,\" Frank said, jerking open the door. \"Jesus!\" I didn\u0027t say anything. We left the house and drove to work. We were seven minutes late. It happened that afternoon. I\u0027d just come out of the washroom. I stopped at the cooler and drew myself a cup of water. I drank it and, crumpling the cup, threw it into the disposal can. I turned and started back for my desk. And staggered violently as something heavy hit me on the head. At my cry, several of the men and women in the office turned suddenly from their work and gaped at me. My legs were rubbery under me and I was lurching sideways toward one of the desks; which I caught at desperately and clung to, a dazed expression on my face. One of the men, Ken Lacey, ran over to me and caught me by the arm. \"What is it, fella?\" I heard him ask. \"Anne,\" I said. \"What?\" \"Anne!\" I pulled away from him, then staggered again, my hands pressing at the top of my head. I could feel terrible shooting pains there; as if someone had hit me with a hammer. Several other people came hurrying over. \"What is it?\" I heard one of the secretaries say. \"I don\u0027t know,\" Lacey said. \"Somebody get him a chair.\" \"Anne.\" I looked around with an expression of panic on my face. I wouldn\u0027t sit down. \"I\u0027m all right, I\u0027m all right,\" I kept insisting, managing to pull away from Lacey again. They watched me in surprise as I ran to my desk, threw myself down on the chair and grabbed the phone. They told me later I looked like a very frightened man. I was. The only trouble was I didn\u0027t know what I was frightened about. I only knew it had something to do with Anne. The phone kept ringing at home with no one answering. I writhed in the chair and (they said later) the tense, stricken look on my face got worse. I punched down the button and dialed again with shaking fingers. I didn\u0027t look over to where they were standing, watching. I kept the receiver pressed to my ear. \"Come on,\" I remember muttering in an agony of inexplicable dread. \"Come on. Answer!\" I heard the phone picked up. \"Hello?\" \"Anne?\" \"Is this you, Tom?\" I recognized Elizabeth\u0027s thin voice and I felt as if someone had kicked me in the stomach. \"Where\u0027s Anne?\" I said, barely able to breathe. \"She\u0027s on the bed,\" Elizabeth told me. \"I just found her unconscious on the kitchen floor.\" \"Is she all right?\" \"I don\u0027t know. I called the doctor.\" \"I\u0027ll be right there.\" I slammed down the receiver and jerked my coat off the hat rack. I must have looked like a maniac as I raced out of there. The next half hour was sheer hell. I had to rush to Frank\u0027s department to get the car key-and that took a pass. Then I had to get another emergency pass to leave the plant. I raced across the parking lot until I got a stitch in my side-and, naturally, Frank had parked as far from the gate as it was possible to get. I gunned the car across the lot at sixty miles an hour, screeching to a halt at the gate, showed my pass, then jolted into the street. It was pure luck I didn\u0027t get arrested at least a dozen times on that drive home. I passed red lights, stop signs, blinkers. I passed on the right, turned left from the right-hand lane and right from the left-hand lane; I broke every speed law there is. But I got home in twelve minutes. I skidded to a halt and was out of the car before the motor sound had faded. I raced across the lawn, leaped onto the porch and slammed through the front doorway. I found them in the bedroom, Anne on the bed, Elizabeth sitting beside her. Richard slipped off the bed as I entered and ran to me. \"Hi, daddy!\" he said, cheerfully. \"Hello, baby.\" I stroked his head distractedly and moved quickly to the bed. Elizabeth got up and I sat where she\u0027d been. Anne smiled weakly at me. Her eyes didn\u0027t seem to focus very well. I saw that Elizabeth had put the ice-bag on her head. \"Are you all right, honey?\" I asked. Anne swallowed slowly and smiled again. \"I\u0027m all right.\" She more framed the words with her lips than spoke them aloud. \"Where\u0027s the doctor?\" I asked Elizabeth. \"He hasn\u0027t come yet,\" she told me. \"Well... where in God\u0027s name is he?\" I muttered. I looked back at Anne. \"What happened?\" I asked. \"No, no, never mind. Don\u0027t talk. You\u0027re sure you\u0027re all right? You don\u0027t want me to take you to the hospital?\" \"No.\" Her head stirred slightly on the pillow. \"Daddy, mama faw down.\" Richard was by my side now, looking at me very intently. For a second I seemed to see Anne standing in the kitchen, reaching upward \"Yes, baby, I know,\" I said, putting my arm around him. I looked back at Anne. \"You\u0027re sure you\u0027re all right?\" \"It\u0027s all right.\" Her voice was a little clearer. \"How long ago did you call the doctor?\" I asked Elizabeth. \"Just a few minutes before you called,\" she said. \"How did it happen?\" I asked. \"Did she faint?\" \"I came over to say hello,\" Elizabeth said. \"I found Anne on the kitchen floor. I think a large can of tomatoes fell off the top shelf and hit her.\" I stared at her blankly. Then I turned to Anne. \"On... the top of your head?\" I asked, slowly. Her lips moved. \"Yes.\" The doctor came about three and said that the only complication was a big goose egg on Anne\u0027s skull. I phoned the plant and said I wouldn\u0027t be back. Elizabeth said she\u0027d pick up Frank at four fifteen. A little before five o\u0027clock Anne insisted she was all right and got up to make supper. While she was at the stove I sat at the table with Richard on my lap and told her what had happened. She stopped stirring and looked over at me strangely. \"But that\u0027s fantastic,\" she said. \"I know it is. But it happened.\" She stood there motionlessly, staring at me. \"No, why bother telling him?\" I said. Her face went blank. \"What?\" she asked. \"I said why bother telling him?\" \"Telling who?\" \"You just said we should-tell Phil,\" I said, \"didn\u0027t you?\" \"Tom, I didn\u0027t say anything.\" There was a hanging pause. \"You didn\u0027t?\" I finally said. \"No.\" I swallowed. I leaned back against the wall, hearing Richard tell me about a worm he and Candy had found in the back yard; not aware of the fact that I could see, in my mind, the actual scene of the two children kneeling on the soil, bent over, staring intently at the wriggling coils of the worm. \"What next?\" I murmured. \"Good God, what next?\" The dream again. Waking up with a gasp of terror, staring at the blackness, knowing she was in the living room waiting for me. Wanting to shout Get out of here! Burrowing under the covers instead, pressing close to Anne, shaking and terrified. Hearing the sound of a rustling skirt in the hallway, rushing to Richard once again as he woke up, crying. And, in the morning, another, dull, clinging headache, another stomach ache. A sense of depletion-of having been used. And the inevitable attempt to convince myself it was only a dream. Futile now.","sourceLink":"https://allnovel.net/a-stir-of-echoes/page-5.html","bookId":2543,"book":{"id":2543,"title":"A Stir of Echoes","description":"Storyline: Tom Wallace lived an ordinary life, until a chance event awakened psychic abilities he never knew he possessed. Now he\u0027s hearing the private thoughts of the people around him-and learning shocking secrets he never wanted to know. But as Tom\u0027s existence becomes a waking nightmare, even greater jolts are in store as he becomes the unwilling recipient of a compelling message from beyond the grave! This eerie ghost story, by award-winning author of \"Hell House\" and \"I Am Legend,\" inspired the acclaimed 1999 film starring Kevin Bacon.","cover":"https://allnovel.net/images/a-stir-of-echoes.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-stir-of-echoes.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:04:32 AM"}}
