{"id":96197,"no":15,"title":"Page 15","content":"“That\u0027s not a bad idea!”\\n\\n \"Besides, he\u0027s been kind to me. He didn\u0027t have to be.\\n\\n “You think that? Is that what you think? Have you looked at the man\u0027s mind?”\\n\\n “Of course I haven\u0027t! I don\u0027t know how to!”\\n\\n “You don\u0027t?”\\n\\n \"No! Humans can\u0027t do-\\n\\n Brutha paused. Vorbis seemed to do it. He only had to look at someone to know what wicked thoughts they harbored. And grandmother had been the same.\\n\\n “Humans can\u0027t do it, I\u0027m sure,” he said. “We can\u0027t read minds.”\\n\\n “I don\u0027t mean reading them, I mean looking at them,” said Om. “Just seeing the shape of them. You can\u0027t read a mind. You might as well try and read a river. But seeing the shape\u0027s easy. Witches can do it, no trouble.”\\n\\n “ `The way of the witch shall be as a path strewn with thorns,\u0027 ” said Brutha.\\n\\n “Ossory?” said Om.\\n\\n “Yes. But of course you\u0027d know,” said Brutha.\\n\\n “Never heard it before in my life,” said the tortoise bitterly. “It was what you might call an educated guess.”\\n\\n “Whatever you say,” said Brutha, “I still know that you can\u0027t truly be Om. The God would not talk like that about His chosen ones.”\\n\\n “I never chose anyone,” said Om. “They chose themselves.”\\n\\n “If you\u0027re really Om, stop being a tortoise.”\\n\\n “I told you, I can\u0027t. You think I haven\u0027t tried? Three years! Most of that time I thought I was a tortoise.”\\n\\n “Then perhaps you were. Maybe you\u0027re just a tortoise who thinks he\u0027s a god.”\\n\\n “Nah. Don\u0027t try philosophy again. Start thinking like that and you end up thinking maybe you\u0027re just a butterfly dreaming it\u0027s a whelk or something. No. One day all I had on my mind was the amount of walking necessary to get to the nearest plant with decent lowgrowing leaves, the next . . . I had all this memory filling up my head. Three years before the shell. No, don\u0027t you tell me I\u0027m a tortoise with big ideas.”\\n\\n Brutha hesitated. He knew it was wicked to ask, but he wanted to know what the memory was. Anyway, could it be wicked? If the God was sitting there talking to you, could you say anything truly wicked?\\n\\n Face to face? Somehow, that didn\u0027t seem so bad as saying something wicked when he was up on a cloud or something.\\n\\n “As far as I can recall,” said Om, “I\u0027d intended to be a big white bull.”\\n\\n “Trampling the infidel,” said Brutha.\\n\\n “Not my basic intention, but no doubt some trampling could have been arranged. Or a swan, I thought. Something impressive. Three years later, I wake up and it turns out I\u0027ve been a tortoise. I mean, you don\u0027t get much lower.” Careful, careful . . . you need his help, but don\u0027t tell him everything. Don\u0027t tell him what you suspect.\\n\\n “When did you start think-when did you remember all this?” said Brutha, who found the phenomenon of forgetting a strange and fascinating one, as other men might find the idea of flying by flapping your arms.\\n\\n “About two hundred feet above your vegetable garden,” said Om, “which is not a point where it\u0027s fun to become sapient, I\u0027m here to tell you.”\\n\\n “But why?” said Brutha. “Gods don\u0027t have to stay tortoises unless they want to!”\\n\\n “I don\u0027t know,” lied Om.\\n\\n If he works it out himself I\u0027m done for, he thought. This is a chance in a million. If I get it wrong, it\u0027s back to a life where happiness is a leaf you can reach.\\n\\n Part of him screamed: I\u0027m a god! I don\u0027t have to think like this! I don\u0027t have to put myself in the power of a human!\\n\\n But another part, the part that could remember exactly what being a tortoise for three years had been like, whispered: no. You have to. If you want to be up there again. He\u0027s stupid and gormless and he\u0027s not got a drop of ambition in his big flabby body. And this is what you\u0027ve got to work with . . .\\n\\n The god part said: Vorbis would have been better. Be rational. A mind like that could do anything!\\n\\n He turned me on my back!\\n\\n No, he turned a tortoise on its back.\\n\\n Yes. Me.\\n\\n No. You\u0027re a god.\\n\\n Yes, but a persistently tortoise-shaped one.\\n\\n If he had known you were a god . . .\\n\\n But Om remembered Vorbis\u0027s absorbed expression, in a pair of grey eyes in front of a mind as impenetrable as a steel ball. He\u0027d never seen a mind shaped like that on anything walking upright. There was someone who probably would turn a god on his back, just to see what would happen. Someone who\u0027d overturn the universe, without thought of consequence, for the sake of the knowledge of what happened when the universe was flat on its back . . .\\n\\n But what he had to work with was Brutha, with a mind as incisive as a meringue. And if Brutha found out that . . .\\n\\n Or if Brutha died . . .\\n\\n “How are you feeling?” said Om.\\n\\n “Ill.”\\n\\n “Snuggle down under the sails a bit more,” said Om. “You don\u0027t want to catch a chill.”\\n\\n There\u0027s got to be someone else, he thought. It can\u0027t be just him who . . . the rest of the thought was so terrible he tried to block it from his mind, but he couldn\u0027t .\\n\\n . . . it can\u0027t be just him who believes in me.\\n\\n Really in me. Not in a pair of golden horns. Not in a great big building. Not in the dread of hot iron and knives. Not in paying your temple dues because everyone else does. Just in the fact that the Great God Om really exists.\\n\\n And now he\u0027s got himself involved with the most unpleasant mind I\u0027ve ever seen, someone who kills people to see if they die. An eagle kind of person if ever there was one . . .\\n\\n Om was aware of a mumbling.\\n\\n Brutha was lying face down on the deck.\\n\\n “What are you doing?” said Om.\\n\\n Brutha turned his head.\\n\\n “Praying.”\\n\\n “That\u0027s good. What for?”\\n\\n “You don\u0027t know?”\\n\\n “Oh.”\\n\\n If Brutha dies . . .\\n\\n The tortoise shuddered in its shell. If Brutha died, then it could already hear in its mind\u0027s ear the soughing of the wind in the deep, hot places of the desert.\\n\\n Where the small gods went.\\n\\n Where do gods come from? Where do they go?\\n\\n Some attempt to answer this was made by the religious philosopher Koomi of Smale in his book Ego-Video Liber Deorum, which translates into the vernacular roughly as Gods: A Spotter\u0027s Guide.\\n\\n People said there had to be a Supreme Being because otherwise how could the universe exist, eh?\\n\\n And of course there clearly had to be, said Koomi, a Supreme Being. But since the universe was a bit of a mess, it was obvious that the Supreme Being hadn\u0027t in fact made it. If he had made it he would, being Supreme, have made a much better job of it, with far better thought given, taking an example at random, to thinks like the design of the common nostril. Or, to put it another way, the existence of a badly puttogether watch proved the existence of a blind watchmaker. You only had to look around to see that there was room for improvement practically everywhere.\\n\\n This suggested that the Universe had probably been put together in a bit of a rush by an underling while the Supreme Being wasn\u0027t looking, in the same way that Boy Scouts\u0027 Association minutes are done on office photocopiers all over the country.\\n\\n So, reasoned Koomi, it was not a good idea to address any prayers to a Supreme Being. It would only attract his attention and might cause trouble.\\n\\n And yet there seemed to be a lot of lesser gods around the place. Koomi\u0027s theory was that gods come into being and grow and flourish because they are believed in. Belief itself is the food of the gods. Initially, when mankind lived in small primitive tribes, there were probably millions of gods. Now there tended to be only a few very important ones-local gods of thunder and love, for example, tended to run together like pools of mercury as the small primitive tribes joined up and became huge, powerful primitive tribes with more sophisticated weapons. But any god could join. Any god could start small. Any god could grow in stature as its believers increased. And dwindle as they decreased. It was like a great big game of ladders and snakes.\\n\\n Gods liked games, provided they were winning.\\n\\n Koomi\u0027s theory was largely based on the good old Gnostic heresy, which tends to turn up all over the multiverse whenever men get up off their knees and start thinking for two minutes together, although the shock of the sudden altitude tends to mean the thinking is a little whacked. But it upsets priests, who tend to vent their displeasure in traditional ways.\\n\\n When the Omnian Church found out about Koomi, they displayed him in every town within the Church\u0027s empire to demonstrate the essential flaws in his argument.\\n\\n There were a lot of towns, so they had to cut him up quite small.\\n\\n Ragged clouds ripped across the skies. The sails creaked in the rising wind, and Om could hear the shouts of the sailors as they tried to outrun the storm.\\n\\n It was going to be a big storm, even by the mariners\u0027 standards. White water crowned the waves.\\n\\n Brutha snored in his nest.\\n\\n Om listened to the sailors. They were not men who dealt in sophistries. Someone had killed a porpoise, and everyone knew what that meant. It meant that there was going to be a storm. It meant that the ship was going to be sunk. It was simple cause and effect. It was worse than women aboard. It was worse than albatrosses.\\n\\n Om wondered if tortoises could swim. Turtles could, he was pretty sure. But those buggers had the shell for it.\\n\\n It would be too much to ask (even if a god had anyone to ask) that a body designed for trundling around a dry wilderness had any hydrodynamic properties other than those necessary to sink to the bottom.\\n\\n Oh, well. Nothing else for it. He was still a god. He had rights.\\n\\n He slid down a coil of rope and crawled carefully to the edge of the swaying deck, wedging his shell against a stanchion so that he could see down into the roiling water.\\n\\n Then he spoke in a voice audible to nothing that was mortal.\\n\\n Nothing happened for a while. Then one wave rose higher than the rest, and changed shape as it rose. Water poured upward, filling an invisible mold; it was humanoid, but obviously only because it wanted to be. It could as easily have been a waterspout, or an undertow. The sea is always powerful. So many people believe in it. But it seldom answers prayers.\\n\\n The water shape rose level with the deck and kept pace with Om.\\n\\n It developed a face, and opened a mouth.\\n\\n “Well?” it said.\\n\\n \"Greetings, oh Queen of- Om began.\\n\\n The watery eyes focused.\\n\\n “But you are just a small god. And you dare to summon me?”\\n\\n The wind howled in the rigging.\\n\\n “I have believers,” said Om. “So I have the right.”\\n\\n There was the briefest of pauses. Then the Sea Queen said, “One believer?”\\n\\n “One or many does not matter here,” said Om. “I have rights.”\\n\\n “And what rights do you demand, little tortoise?” said the Queen of the Sea.\\n\\n “Save the ship,” said Om.\\n\\n The Queen was silent.\\n\\n “You have to grant the request,” said Om. “It\u0027s the rules.”\\n\\n “But I can name my price,” said the Sea Queen.\\n\\n “That\u0027s the rules, too.”\\n\\n “And it will be high.”\\n\\n “It will be paid.”\\n\\n The column of water began to collapse back into the waves.\\n\\n “I will consider this.”\\n\\n Om stared down into the white sea. The ship rolled, sliding him back down the deck, and then rolled back. A flailing foreclaw hooked itself around the stanchion as Om\u0027s shell spun around, and for a moment both hind legs paddled helplessly over the waters. \\n\\n","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-15.html","bookId":1629,"book":{"id":1629,"title":"Small Gods (Discworld #13)","description":"Storyline: Small Gods (Discworld #13) \\n Just because you can\u0027t explain it, doesn\u0027t mean it\u0027s a miracle.\u0027 Religion is a controversial business in the Discworld. Everyone has their own opinion, and indeed their own gods. Who come in all shapes and sizes. In such a competitive environment, there is a pressing need to make one\u0027s presence felt. And it\u0027s certainly not remotely helpful to be reduced to be appearing in the form of a tortoise, a manifestation far below god-like status in anyone\u0027s book. In such instances, you need an acolyte, and fast. Preferably one who won\u0027t ask too many questions...\\n","cover":"https://allnovel.net/images/small-gods-discworld-13.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/small-gods-discworld-13.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:18:24 PM"}}
