{"id":96206,"no":24,"title":"Page 24","content":"“It\u0027s all right,” said Didactylos. “I don\u0027t put any oil in it.” “A lantern that doesn\u0027t shine for a man that doesn\u0027t see?” “Yeah. Works perfectly. And of course it\u0027s very philosophical.” “And you live in a barrel.” “Very fashionable, living in a barrel,” said Didactylos, walking forward briskly, his fingers only occasionally touching the raised patterns on the plank. “Most of the philosophers do it. It shows contempt and disdain for worldly things. Mind you, Legibus has got a sauna in his. It\u0027s amazing the kind of things you can think of in it, he says.” Brutha looked around. Scrolls protruded from their racks like cuckoos piping the hour. “It\u0027s all so . . . I never met a philosopher before I came here,” he said. “Last night, they were all . . .” “You got to remember there\u0027s three basic approaches to philosophy in these parts,” said Didactylos. “Tell him, Urn.” “There\u0027s the Xenoists,” said Urn promptly. “They say the world is basically complex and random. And there\u0027s the Ibidians. They say the world is basically simple and follows certain fundamental rules.” “And there\u0027s me,” said Didactylos, pulling a scroll out of its rack. “Master says basically it\u0027s a funny old world,” said Urn. “And doesn\u0027t contain enough to drink,” said Didactylos. “And doesn\u0027t contain enough to drink.” “Gods,” said Didactylos, half to himself. He pulled out another scroll. “You want to know about gods? Here\u0027s Xeno\u0027s Reflections, and old Aristocrates\u0027 Platitudes, and Ibid\u0027s bloody stupid Discourses, and Legibus\u0027s Geometries and Hierarch\u0027s Theologies . . . ” Didactylos\u0027s fingers danced across the racks. More dust filled the air. “These are all books?” said Brutha. “Oh, yes. Everyone writes \u0027em here. You just can\u0027t stop the buggers.” “And people can read them?” said Brutha. Omnia was based on one book. And here were . . . hundreds . . . “Well, they can if they want,” said Urn. “But no one comes in here much. These aren\u0027t books for reading. They\u0027re more for writing.” “Wisdom of the ages, this,” said Didactylos. “Got to write a book, see, to prove you\u0027re a philosopher. Then you get your scroll and free official philosopher\u0027s loofah.” The sunlight pooled on a big stone table in the center of the room. Urn unrolled the length of a scroll. Brilliant flowers glowed in the golden light. “Orinjcrates\u0027 On the Nature of Plants,” said Didactylos. “Six hundred plants and their uses . . .” “They\u0027re beautiful,” whispered Brutha. “Yes, that is one of the uses of plants,” said Didactylos. “And one which old Orinjcrates neglected to notice, too. Well done. Show him Philo\u0027s Bestiary, Urn.” Another scroll unrolled. There were dozens of Pictures of animals, thousands of unreadable words. “But . . . pictures of animals . . . it\u0027s wrong . . . isn\u0027t it wrong to . . .” “Pictures of just about everything in there,” said Didactylos. Art was not permitted in Omnia. “And this is the book Didactylos wrote,” said Urn. Brutha looked down at a picture of a turtle. There were . . . elephants, they\u0027re elephants, his memory supplied, from the fresh memories of the bestiary sinking indelibly into his mind . . . elephants on its back, and on them something with mountains and a waterfall of an ocean around its edge . . . “How can this be?” said Brutha. “A world on the back of a tortoise? Why does everyone tell me this? This can\u0027t be true!” “Tell that to the mariners,” said Didactylos. “Everyone who\u0027s ever sailed the Rim Ocean knows it. Why deny the obvious?” “But surely the world is a perfect sphere, spinning about the sphere of the sun, just as the Septateuch tells us,” said Brutha. “That seems so . . . logical. That\u0027s how things ought to be.” “Ought?” said Didactylos. “Well, I don\u0027t know about ought. That\u0027s not a philosophical word.” “And . . . what is this . . .” Brutha murmured, pointing to a circle under the drawing of the turtle. “That\u0027s a plan view,” said Urn. “Map of the world,” said Didactylos. “Map? What\u0027s a map?” “It\u0027s a sort of picture that shows you where you are,” said Didactylos. Brutha stared in wonderment. “And how does it know?” “Hah!” “Gods,” prompted Om again. “We\u0027re here to ask about gods!” “But is all this true?” said Brutha. Didactylos shrugged. “Could be. Could be. We are here and it is now. The way I see it is, after that, everything tends towards guesswork.” “You mean you don\u0027t know it\u0027s true?” said Brutha. “I think it might be,” said Didactylos. “I could be wrong. Not being certain is what being a philosopher is all about.” “Talk about gods,” said Om. “Gods,” said Brutha weakly. His mind was on fire. These people made all these books about things, and they weren\u0027t sure. But he\u0027d been sure, and Brother Nhumrod had been sure, and Deacon Vorbis had a sureness you could bend horseshoes around. Sureness was a rock. Now he knew why, when Vorbis spoke about Ephebe, his face was gray with hatred and his voice was tense as a wire. If there was no truth, what was there left? And these bumbling old men spent their time kicking away the pillars of the world, and they\u0027d nothing to replace them with but uncertainty. And they were proud of this? Urn was standing on a small ladder, fishing among the shelves of scrolls. Didactylos sat opposite Brutha, his blind gaze still apparently fixed on him. “You don\u0027t like it, do you?” said the philosopher. Brutha had said nothing. “You know,” said Didactylos conversationally, “people\u0027ll tell you that us blind people are the real business where the other senses are concerned. It\u0027s not true, of course. The buggers just say it because it makes them feel better. It gets rid of the obligation to feel sorry for us. But when you can\u0027t see you do learn to listen more. The way people breathe, the sounds their clothes make . . .” Urn reappeared with another scroll. “You shouldn\u0027t do this,” said Brutha wretchedly. “All this . . .” His voice trailed off. “I know about sureness,” said Didactylos. Now the light, irascible tone had drained out of his voice. “I remember, before I was blind, I went to Omnia once. This was before the borders were closed, when you still let people travel. And in your Citadel I saw a crowd stoning a man to death in a pit. Ever seen that?” “It has to be done,” Brutha mumbled. \"So the soul can be shriven and-\u0027 “Don\u0027t know about the soul. Never been that kind of a philosopher,” said Didactylos. “All I know is, it was a horrible sight.” \"The state of the body is not- “Oh, I\u0027m not talking about the poor bugger in the pit,” said the philosopher. “I\u0027m talking about the people throwing the stones. They were sure all right. They were sure it wasn\u0027t them in the pit. You could see it in their faces. So glad it wasn\u0027t them that they were throwing just as hard as they could.” Urn hovered, looking uncertain. “I\u0027ve got Abraxas\u0027s On Religion,” he said. “Old \u0027Charcoal\u0027 Abraxas,” said Didactylos, suddenly cheerful again. “Struck by lightning fifteen times so far, and still not giving up. You can borrow this one overnight if you want. No scribbling comments in the margins, mind you, unless they\u0027re interesting.” “This is it!” said Om. “Come on, let\u0027s leave this idiot.” Brutha unrolled the scroll. There weren\u0027t even any pictures. Crabbed writing fiIled it, line after line. “He spent years researching it,” said Didactylos. “Went out into the desert, talked to the small gods. Talked to some of our gods, too. Brave man. He says gods like to see an atheist around. Gives them something to aim at.” Brutha unrolled a bit more of the scroll. Five minutes ago he would have admitted that he couldn\u0027t read. Now the best efforts of the inquisitors couldn\u0027t have forced it out of him. He held it up in what he hoped was a familiar fashion. “Where is he now?” he said. “Well, someone said they saw a pair of sandals with smoke coming out just outside his house a year or two back,” said Didactylos. “He might have, you know, pushed his luck.” “I think,” said Brutha, “that I\u0027d better be going. I\u0027m sorry to have intruded on your time.” “Bring it back when you\u0027ve finished with it,” said Didactylos. “Is that how people read in Omnia?” said Urn. “What?” “Upside down.” Brutha picked up the tortoise, glared at Urn, and strode as haughtily as possible out of the Library. “Hmm,” said Didactylos. He drummed his fingers on the tables. “It was him I saw in the tavern last night,” said Urn. “I\u0027m sure, master.” “But the Omnians are staying here in the palace.” “That\u0027s right, master.” “But the tavern is outside.” “Yes.” “Then he must have flown over the wall, do you think?” “I\u0027m sure it was him, master.” “Then . . . maybe he came later. Maybe he hadn\u0027t gone in when you saw him.” “It can only be that, master. The keepers of the labyrinth are unbribable.” Didactylos clipped Urn across the back of the head with his lantern. “Stupid boy! I\u0027ve told you about that sort of statement.” “I mean, they are not easily bribable, master. Not for all the gold in Omnia, for example.” “That\u0027s more like it.” “Do you think that tortoise was a god, master?” “He\u0027s going to be in big trouble in Omnia if he is. They\u0027ve got a bastard of a god there. Did you ever read old Abraxas?” “No, master.” “Very big on gods. Big gods man. Always smelled of burnt hair. Naturally resistant.” Om crawled slowly along the length of a line. “Stop walking up and down like that,” he said, “I can\u0027t concentrate.” “How can people talk like that?” Brutha asked the empty air. “Acting as if they\u0027re glad they don\u0027t know things! Finding out more and more things they don\u0027t know! It\u0027s like children proudly coming to show you a full potty!” Om marked his place with a claw. “But they find things out,” he said. “This Abraxas was a thinker and no mistake. I didn\u0027t know some of this stuff. Sit down!” Brutha obeyed. “Right,” said Om. “Now . . . listen. Do you know how gods get power?” “By people believing in them,” said Brutha. “Millions of people believe in you.” Om hesitated. All right, all right. We are here and it is now. Sooner or later he\u0027ll find out for himself . . . “They don\u0027t believe,” said Om. \"But- “It\u0027s happened before,” said the tortoise. “Dozens of times. D\u0027you know Abraxas found the lost city of Ee? Very strange carvings, he says. Belief, he says. Belief shifts. People start out believing in the god and end up believing in the structure.”","sourceLink":"https://allnovel.net/small-gods-discworld-13/page-24.html","bookId":1629,"book":{"id":1629,"title":"Small Gods (Discworld #13)","description":"Storyline: Small Gods (Discworld #13) Just because you can\u0027t explain it, doesn\u0027t mean it\u0027s a miracle.\u0027 Religion is a controversial business in the Discworld. Everyone has their own opinion, and indeed their own gods. Who come in all shapes and sizes. In such a competitive environment, there is a pressing need to make one\u0027s presence felt. And it\u0027s certainly not remotely helpful to be reduced to be appearing in the form of a tortoise, a manifestation far below god-like status in anyone\u0027s book. In such instances, you need an acolyte, and fast. Preferably one who won\u0027t ask too many questions...","cover":"https://allnovel.net/images/small-gods-discworld-13.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/small-gods-discworld-13.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:18:24 PM"}}
