{"id":12238,"no":1,"title":"Chapter 1","content":"An immense gallery, five hundred feet long, occupied the upper floor of the main factory-building. Looking down the gallery, a perspective of iron girders spanned the roof, gaunt skeletons of architecture, uncompromising, inexorably utilitarian, inflexible, remorseless. A drone of machinery filled the air, neither very loud nor very near at hand, but softly and unremittingly continuous; the drone of clanking, of loosely-running wheels and leather belts, muffled by the intervening floor into a not unpleasant murmur. Outside the windows three chimneys reared their heads side by side, emitting three parallel streams of smoke, gigantic black plumes that floated horizontally away over the flooded country, and that at night were flecked with red sparks as they flowed out from the red glare at their base. 4All these things, the chimneys and the girders, were crushingly larger than the men who laboured amongst them. The men seemed of pigmy size as they pushed their hand-trucks along the floor of the big gallery. They pushed them down the narrow passage-ways left between the vats. The gallery was full of vats, set in pairs down the whole length of the building; square vats twenty feet each way, as large and as deep as an ordinary room. Some of the vats were empty, temporarily not in use; some were only half full; but in most the hot, liquid soap boiled and bubbled right up to the rim. The smell which filled the gallery was the smell of the soap, pungent and acrid on the surface, but fat and nauseating underneath, rasping the throat of the chance visitor before it penetrated deeper with its hot, furry smell that tickled and disgusted the sensitiveness at the back of his nose. The chance visitor rarely lingered long in the gallery. He would stand for a few moments watching the men that came and went in their splashed overalls, indifferent to his presence; then he would turn to go carefully down the steep iron stair into the pleasanter rooms where white powder was heaped on the floor in miniature mountains, and where lines of 5girls seated on high stools were occupied in tying ribbons with the twist of dexterity round the necks of scent bottles, and the room was filled with scent like a garden of orange-trees in blossom. Up in the gallery, the soap in the vats moved uneasily with the motion of an evil quicksand. The soap was yellow, and its consistency one of slimy liquidity. If the vat were not sufficiently full, the quantity increased mysteriously from below, the level rising thanks to the unseen source of supply. It was not hard to believe that the recesses of the vat were inhabited by some foul and secret monster whose jaws emitted the viscid, yellow stream to conceal his abode. The soap moved restlessly, boiling and bursting into little craters, which subsided, leaving wrinkles and circles on the surface. Quiet for a moment, it heaved in another place; heaved slowly and deliberately, but did not break; heaved again; broke with a spout of steam and a sluggish splash as the walls of the crater fell in. It was never altogether still. It seemed alive, because it swelled and breathed and vomited, or at least it seemed as though some live creature dwelt within, occasioning by its movements the disturbances and eruptions of the slime. 6In other vats a wrinkled brown skin had formed over the cooling soap, a skin puckered and broken up into valleys and chasms, plains and ridges, so that of all things it most resembled the physical map of a country. The parallel was exact as to colour, even to the greenish stretches at the bottom of the valleys. Mountain ridges three inches high, chasms three inches deep, plateaux six inches across, the landscape of some dead but perpetually changing world. For here the slime moved also, but with a difference; it did not seethe, it did not erupt; it rather subsided; was a dead, rather than a living thing. The monster that dwelt in those depths had died, and lay at the bottom, a heap of corruption the imagination would not willingly picture. Other vats were empty, and if the hot boiling soap resembled a shifting quicksand, and the cooling soap the desolation of a dead world, the empty vats resembled the sea-bottom. The others, with their hint of greed and evil, might be more terrifying; these empty vats were infinitely more fantastic. Their sides were caked with the dry soap, brown-yellow, and their depths were surprisingly revealed; ending in a blunt point, like the point of a cone; they were sunk lower than the floor of the gallery 7into an unlighted chamber of corresponding size below. In these empty vats, various portions of apparatus were brought to light: immense chains, caked and corroded, hung like ship’s cables and were lost in the deposit at the bottom; vast strainers swung against the sides; ropes, stiffened hard as wood, spanned diagonally from side to side; and, emerging from the tapering depths, stumps of wreckage stood up, transformed from their original shape to stalagmites of dry frangible matter, that would chip away, crisp and powdery, betraying the nature of their kernel,—was it a shovel? was it an anchor? was it the decaying bones of the ancient monster?—and the low parapets of the vats were coated with the same brittle dryness that yellowed the walls of those grotesque and extraordinary pits.","sourceLink":"http://novel.tingroom.com/duanpian/3254/89181.html","bookId":600,"book":{"id":600,"title":"The Dragon in Shallow Waters","description":"简介： An immense gallery, five hundred feet long, occupied the upper floor of the main factory-building. Looking down the gallery, a perspective of iron girders spanned the roof, gaunt skeletons of architecture, uncompromising, inexorably utilitarian, infl...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3254","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
