{"id":11026,"no":17,"title":"SCENE XVII","content":"\"If you please, my lady,\" said Mistress Megrim, \"I should like to quit your ladyship\u0027s service.\" \n \n \"How?\" cried Lady Standish, waking with a start out of the heavy sleep of trouble, and propping herself upon her elbow, to gaze in blinking astonishment at the irate pink countenance of her woman. Lady Standish looked very fair and young, poor little wife, with her half-powdered curls of hair escaping in disorder from the laces of her nightcap, and her soft blue eyes as full of uncomprehending grief as a frightened baby\u0027s. \n \n Mistress Megrim gazed upon her coldly and her old-maid\u0027s heart hardened within her. \n \n \"No, your ladyship,\" said she, with a virtuous sniff, \"I shouldn\u0027t feel as I was doing my duty to her ladyship, your mother, nor to my humble self, were I to remain an hour longer than I could help, the Handmaid of Sin.\" \n \n \"Oh, dear,\" said Lady Standish, letting herself fall back on her pillows with a weary moan, \"I do wish you\u0027d hold your tongue, woman, and allow me to rest! Pull the curtain again; oh, how my head aches!\" \n \n \"Very well, my lady,\" ejaculated Megrim, all at once in a towering passion. \"Since you\u0027re that hardened, my lady, that a sign from Heaven couldn\u0027t melt your heart—I allude to that man of God, his lordship the Bishop (oh, what a holy gentleman that is!); and, my lady, me and Mistress Tremlet saw him out of the pantry window as he shook the dust of this House of Iniquity from his shoes; if that vessel of righteousness could not prevail with your ladyship, what hopes have I that you\u0027ll hear the voice of the Lord through me?\" \n \n \"Megrim, hold your tongue,\" said her mistress in unwontedly angered tones, \"pull the curtains and go away!\" \n \n With a hand that trembled with fury Mistress Megrim fell upon the curtains and rattled them along their pole. Then she groped her way to Lady Standish\u0027s bedside and stood for some seconds peering malevolently at her through the darkness. \n \n \"I wouldn\u0027t believe it, my lady,\" she hissed in a ghastly whisper, \"although indeed I might have known that such a gentleman as Sir Jasper would never have taken on like that if he hadn\u0027t had grounds. But you\u0027ve mistaken your woman, when you think you can make an improper go-between of me! Oh,\" cried she, with a rigid shudder, \"I feel myself defiled as with pitch, that these fingers should actually have touched sich a letter!\" \n \n \"For goodness sake,\" moaned the lady from her pillows, \"what are you talking about now?\" \n \n \"My lady,\" said Megrim sepulchrally, \"when that minx with her face muffled up in a hood, came and had the brazen boldness to ask for me this morning, saying she had some lace of your ladyship\u0027s from the mender\u0027s, and that it was most particular and must be given into my hands alone, my mind misgave me. \u0027Twas like an angel\u0027s warning. The more so as there isn\u0027t a scrap of your ladyship\u0027s lace as has been to the mender\u0027s since we came here.\" \n \n \"Mercy, Megrim, how you do ramble on! I can\u0027t make head or tail of your stupid story.\" Even a dove will peck. \n \n \"Ho, do I, my lady! Can\u0027t you indeed? Perhaps your ladyship will understand better when I tell her, that that same bold thing had no lace at all—but a letter. \u0027Give it to your mistress,\u0027 says she, \u0027in secret, and for your life don\u0027t let Sir Jasper see it.\u0027\" \n \n \"Well, give it to me,\" said Lady Standish, \"and hold your tongue, and go and pack your trunks as soon as you like.\" \n \n \"Ho, my lady,\" cried the incorruptible Megrim, with an acid laugh, \"I hope I know my Christian duty better. I brought the letter to my master, according to the Voice of Conscience. And now,\" she concluded, with a shrill titter, \"I\u0027ll go and pack my trunks.\" \n \n Yet she paused, expecting to enjoy Lady Standish\u0027s outburst of terror and distress. There was no sign from the bed, however, not even a little gasp. And so Mistress Megrim was fain to depart to her virtuous trunks without even that parting solace. \n \n Meanwhile, with the pillow of her spotless conscience to rest upon, and deadened to fresh disturbances by the despairing reflection that nothing for the present could make matters much worse between her and her husband, Lady Standish, without attempting to solve the fresh problem, determinedly closed her weary eyes upon the troubles of the world and drifted into slumber again. \n \n ***** \n \n \"I shall catch them red-handed,\" said Sir Jasper. \n \n This time all doubt was over: in his hand lay the proof, crisp and fluttering. He read it again and again, with a kind of ghastly joy. Unaddressed, unsealed, save by a foolish green wafer with a cupid on it, the document which Mistress Megrim\u0027s rigid sense of duty had delivered to him instead of to his guilty wife, was indited in the self-same dashing hand as marked the crumpled rag that even now burned him through his breast-pocket like a fly-blister. \n \n \n \"I never got a wink of sleep, dreaming of you, dearest dear, so soon to be my own at last! The chay shall be drawn by horses such as Phoebus himself, my darling, would have envied. And, so you fail me not, we shall soon be dashing through the night—a world of nothing but happiness and love before us. I could find it in my heart to bless the poor foolish individual who shall be nameless, since, had it not been for my lovely one\u0027s weariness of him, she might never have turned to the arms of her own devoted, \n \n RED CURL! \n \n P.S.—I\u0027ll have as good a team as there is in England (barring the one that shall bring us there), waiting for us at the Black Bear, Devizes. We ought to arrive before midnight, and there shall be a dainty trifle of supper for your Beautyship—while the nags are changed. Ah, my dear, what rapture!\" \n \n \n Indescribable were the various expressions that crossed Sir Jasper\u0027s countenance upon the perusal and re-perusal of this artless missive. Now he gnashed his teeth; now snorts of withering scorn were blown down the channels of his fine aquiline nose; now smiles of the most deadly description curled and parted luridly his full lips. \n \n \"Ha, ha!\" said Sir Jasper, \"and perhaps the poor foolish individual may give you cause for something less than blessings, Master Carrots! And I think, madam, your beautyship may find at Devizes something harder to digest than that trifle of supper! Till then, patience!\" \n \n He folded the letter, placed it beside its fellow, and once more, with a sort of bellow, he cried, \"Patience!\" \n \n ***** \n \n \"Well, Lydia?\" said Bellairs. She had but just finished her chocolate, and looked like a rose among her pillows. \n \n \"Well, madam,\" said Lydia, still panting from her hurried quest, \"\u0027tis safe delivered. I gave it into Mistress Megrim\u0027s own hands, and——\" \n \n \"And can you reckon,\" said the lady, smiling at the amusing thought, \"upon her bringing it straight to Sir Jasper?\" \n \n \"Ah, lud, ma\u0027am, yes. I told the sour, ugly old cat, that if her master caught sight of it, Lady Standish would be ruined. You should have seen how she grabbed at it, ma\u0027am!\" \n \n \"Lydia,\" said her mistress, looking at her admiringly, \"I question whether I\u0027d have risked it myself; you\u0027re a bold girl! But there, if anything fail, you know that rose-coloured pelisse remains hanging in my closet.\" \n \n \"Never fear, ma\u0027am,\" said Lydia, smiling quietly to herself, as she pulled her mistress\u0027s long pink silk stocking over her hand, and turned it knowingly from side to side, looking for invisible damage, \"the pelisse is as good as mine already.\" \n \n \"But, think you, was Sir Jasper at home?\" said Mistress Bellairs, after a few moments\u0027 reflection. \n \n \"I am sure of that,\" said Lydia triumphantly, peeling off the stocking. \"I thought it best to go in by the mews, ma\u0027am, and I heard that Sir Jasper had not left the house since that little—that little affair with the Bishop, you know, ma\u0027am. But all the night, and all the morning, he kept William and Joseph (those are the grooms, ma\u0027am) going backwards and forwards with challenges to the Bishop\u0027s lodgings.\" \n \n \"Oh!\" cried Kitty, and kicked her little toes under the silk counterpane with exquisite enjoyment, \"and what does the Bishop answer, I wonder?\" \n \n \"Sends back the letter every time unopened, ma\u0027am, with a fresh text written on the back of it. The texts it is, William says, that drive Sir Jasper mad.\" \n \n \"Oh! oh! oh!\" cried Mistress Kitty faintly, rolling about her pillows. \"Child, you\u0027ll be the death of me! ... Well, then, to business. You know what you are to do to-night?\" \n \n \"No sooner are you gone to the Assembly Rooms this evening, ma\u0027am, than I take a letter from you for Lady Standish, and this time deliver it myself to her own hand, and, if needs be, persuade her to follow your advice, ma\u0027am.\" \n \n \"Right, girl; thou shalt have the gold locket with the Turkey stones——\" \n \n \"Thank you, ma\u0027am. Well, then, I\u0027m to scurry as fast as I can to the corner of Bond Street and Quiet Street, and watch you being carried off by the gentleman. And then——\" \n \n \"Be sure you wait till the chaise has well started.\" \n \n \"Yes, ma\u0027am, of course! When you\u0027re safely on the London Road, I\u0027ll go and give the alarm at the Assembly Rooms.\" \n \n \"Remember, you ask first for Lord Verney.\" \n \n \"Oh, ay, ma\u0027am. \u0027My mistress is carried off, is carried off! Help, help, my lord!\u0027 I\u0027ll say. Oh, ma\u0027am, I\u0027ll screech it well out, trust me.\" \n \n \"Don\u0027t forget,\" said her mistress, whose mood became every moment merrier, \"don\u0027t forget to say that you heard the ravisher mention London, by Devizes.\" \n \n \"Well, ma\u0027am,\" said Lydia, \"I thought of saying that he first flung you swooning upon the cushions of the chay; then, stepping in himself, cried out to the coachman, with an horrible oath, \u0027If you\u0027re not in Devizes before twelve, I\u0027ll flay you with your own whip, and then hang you with it to the shaft!\u0027\" \n \n \"Aha, ha, Lydia,\" laughed her mistress. \"I see I must give you a gold chain to hang that locket upon. But pray, child,\" she added warningly, \"be careful not to overdo it.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1945/55697.html","bookId":768,"book":{"id":768,"title":"The Bath Comedy","description":"简介： Mistress Kitty Bellairs poised her dainty person on one foot and cast a mocking, somewhat contemptuous, yet good-humoured glance at the slim length of sobbing womanhood prone on the gilt-legged, satin-cushioned sofa....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1945","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
