{"id":90869,"no":3,"title":"Page 3","content":"God-the box, Jenny thought. Michael was the sort who would potter around the room reading your mail and opening your drawers in an absentminded way. Insatiably curious. She followed him.\\n\\n Her stomach knotted at the sight of it, pristine and rectangular and gleaming on her mother\u0027s solid ponderosa pine coffee table. Jenny\u0027s mother had worked very hard with a very expensive decorator to make sure the living room looked \"natural and inevitable and not at all arty.\" There were Navajo weavings and Hopi baskets on the walls, Zuni pots on the floor, and a Chimayo rug above the fireplace. Jenny wasn\u0027t allowed to touch any of them.\\n\\n Calm down, she told herself. But even approaching the white box was strangely difficult. She picked it up and realized that her palms were sweaty enough to stick to it.\\n\\n Thrummm. The current tingled through her fingers. The feeling of something wrong increased.\\n\\n Oh, hell! I\u0027ll just throw the thing away, Jenny thought, surprised at the relief the idea brought. We\u0027ll play canasta.\\n\\n Michael, munching spring rolls, was eyeing her with interest.\\n\\n \"What\u0027s that? A present?\"\\n\\n \"No-just a game I bought, but I\u0027m going to get rid of it. Michael, do you know how to play canasta?\"\\n\\n \"Nope. So where\u0027s the sun bunny?\"\\n\\n \"Not here yet-oh, that\u0027s probably her. Would you get the door?\"\\n\\n Michael just looked vaguely at the plate in his one hand and the roll in his other. Jenny ran to the hallway, still holding the box.\\n\\n Summer Parker-Pearson was tiny, with thistledown hair and dimples you wanted to poke your fingers into. She was wearing a china blue shirtdress and shivering.\\n\\n \"It\u0027s freezing out here. How\u0027re we going to go swimming, Jenny?\"\\n\\n \"We\u0027re not,\" Jenny said gently.\\n\\n \"Oh. Then why did I bring my bathing suit? Here\u0027s my present.\" She piled a shirt box wrapped in maroon paper on top of the white box Jenny was holding, added a small tote bag to the stack, and headed for the living room.\\n\\n Jenny followed, put all the things on the coffee table, then pulled the white box from beneath them. Thrum. Summer was saying hello to Mike and Zach and Dee.\\n\\n \"Look,\" Jenny said, \"if you guys will excuse me for a second-\" She was cut off by the doorbell. This time she didn\u0027t want anybody else to answer it. \"I\u0027ll get it.\"\\n\\n Tom was on the doorstep.\\n\\n He looked good. Of course, he always looked good to Jenny, but tonight he was especially handsome, really devilishly good-looking, with his dark brown hair neat and short and his smile faintly mocking. Tom wore simple clothes like other guys, but somehow he wore them differently. He could make a pair of Basic Jeans look as if they\u0027d been tailored for him. Tonight he was wearing a teal T-shirt under a button-down shirt that was simply a beautiful blue, an intense color that reminded Jenny of something.\\n\\n \"Hi,\" Jenny said.\\n\\n He grinned rakishly and held out an arm to her.\\n\\n Jenny went willingly, as always, but she hung on to the box. \"Tom, there\u0027s something I want to talk to you about, alone. It\u0027s hard to explain-\"\\n\\n \"Oh, no, I\u0027m getting \u0027Dear Johnned\u0027 on my birthday,\" he said loudly, arm still around her, leading her down the hallway to the living room.\\n\\n \"Quit it,\" Jenny said, exasperated. \"Can you please be serious for a minute?\"\\n\\n Tom was clearly in no mood to be serious. He waltzed her into the living room, where everyone but Audrey was sitting around laughing and talking. He ignored her protests, which were growing fainter anyway. Tom always made Jenny feel better, and it was hard to stay worried with him around. All her fears of shadows and thrumming boxes seemed faraway and childish.\\n\\n Still, she felt a prickle of unease as he took the box from her, asking, \"What\u0027s this? For me?\"\\n\\n \"It\u0027s a game,\" Michael said, \"about which Jenny\u0027s being very mysterious. She can\u0027t let go of it, apparently.\"\\n\\n \"I understand why,\" Tom said as he shook the box to hear the rattle. Jenny looked at him sharply. He didn\u0027t seem to be joking, or at least no more than usual, but how could you say that about a blank white box? Why should Tom look so deeply intrigued by it, shifting it in his hands eagerly?\\n\\n There is something about it, Jenny thought, opening her mouth to speak. But just then her mother came in from the back of the house, fastening an earring and wafting perfume. Jenny shut her mouth again.\\n\\n Mrs. Thornton had been blond like Jenny when\\n\\n she was young, but over the years her hair had darkened to a golden brown, honey-in-shadow tone. She smiled at everyone and said happy birthday to Tom. \"Now, let me see,\" she said to Jenny, \"Joey\u0027s out of the way at the Stensons\u0027, and we\u0027ll be back late Sunday, so everything should be ready for you.\"\\n\\n Then, as Jenny\u0027s father appeared behind her with a small suitcase, she added earnestly, \"Dear one, I know you\u0027re going to break something. Just don\u0027t let it be the R. C. Gorman vase, all right? It cost fifteen hundred dollars, and your father is deeply attached to it. Otherwise, clean up whatever you destroy and try to keep the roof on.\"\\n\\n \"If it comes off, we\u0027ll nail it back,\" Jenny promised, then kissed her mother\u0027s smooth Shalimar-scented cheek without embarrassment.\\n\\n \"Krazy Glue in the kitchen drawer,\" Jenny\u0027s father muttered in her ear as she kissed him in turn. \"But watch out for the R. C. Gorman vase. Your mother would die.\"\\n\\n \"We won\u0027t go near it,\" Jenny said.\\n\\n \"And no ...\" Her father made a vague fiddling gesture with one hand. He was looking at Tom in a way that Jenny thought was what people meant when they said askance. He\u0027d taken to looking like that at Tom lately.\\n\\n \"Daddy!\"\\n\\n \"You know what I mean. Only the girls are staying the night, right?\"\\n\\n \"Of course.\"\\n\\n \"Right.\" Her father pushed his wire-framed glasses higher on his nose, squared his shoulders, and looked at her mother. They both glanced around the living room one last time-as if to remember it-and then, like a pair of fatalistic soldiers, they turned and marched out the door.\\n\\n \"Don\u0027t have much faith in us, do they?\" Michael said, looking after them.\\n\\n \"It\u0027s the first time I\u0027ve had a party while they\u0027ve been away for the weekend,\" said Jenny. \"That they know about,\" she added thoughtfully.\\n\\n When she looked back, Tom had the box open.\\n\\n \"Oh-\" Jenny said. And that was all she said. Because Tom was lifting out sheets of thick, glossy tagboard, printed in colors so vibrant they glowed. Jenny saw doors and windows, a porch, a turret. Shingles.\\n\\n \"It\u0027s a dollhouse,\" said Summer. \"No, I mean one of those paper thingies, like you get in the big flat books and cut out. A paper house.\"\\n\\n Not a game, Jenny thought. And not dangerous. Just a kids\u0027 toy. She felt a wave of relaxation soften her, and when Audrey called from the kitchen that the food was ready, she went almost dreamily.\\n\\n Tom was suitably surprised and impressed at the Chinese dinner, and the fact that Audrey was responsible for it.\\n\\n \"You can cook!\"\\n\\n \"Of course I can cook. Why is it that everyone assumes I\u0027m a mere social ornament?\" She looked at him from under spiky lashes and smiled.\\n\\n Tom smiled back, maintaining eye contact. Audrey kept flirting as she served him, smiling up at him, allowing her fingers to touch his as she handed him a plate. But when he moved away, she slanted a grim, significant glance at Jenny. You see? that glance said.\\n\\n Jenny returned the look benevolently. Tom was always nice to other girls, and it didn\u0027t bother her. It didn\u0027t mean anything. She was feeling very pleased with the world as they all filled their plates and went back to the living room.\\n\\n There was no formal dining. They all sat around the coffee table, some on leather footstools, some directly on the Mexican paved tiles. Jenny was surprised that the white box with the sheets of tagboard wasn\u0027t already put aside.\\n\\n \"You got some scissors?\" asked Zach. \"Actually, an X-Acto knife would be better. And a metal ruler, and glue.\"\\n\\n Jenny stared at him. \"You\u0027re going to make it?\"\\n\\n \"Sure, why not? It looks like a good model.\"\\n\\n \"It\u0027s cute,\" Summer said and giggled.\\n\\n \"You\u0027ve got to be kidding,\" Jenny said. \"A paper house ...\" She looked around for support.\\n\\n \"It\u0027s a game,\" Dee said. \"See, there are instructions on the back of the lid. Scary instructions.\" She shot a barbaric smile around the room. \"I like them.\"\\n\\n Michael, with bits of spring roll hanging out of his mouth, looked alarmed.\\n\\n \"But how can you play a game with a paper house?\" Jenny felt her voice going weak again as she saw the way Tom was looking at her. The way only Tom could look-charming, persuasive, and tragic. It was all a put-on, but Jenny could never resist. \"Oh, all right, you big baby,\" she said. \"If you really want it. I should have gotten you a rattle and a pacifier, too.\" Shaking her head, she went off to fetch the scissors.\\n\\n They put the model together as they ate, occasionally getting grease on the tagboard, gesturing with chopsticks. Tom supervised, naturally. Zach did a lot of the cutting; he\u0027d had practice matting the photographs he took. Jenny watched his careful, clever fingers transform the flat sheets of paper into a three-foot-high Victorian house and was forced into admiration.\\n\\n It had three floors and a turret and was open in front like a dollhouse. The roof was removable. Sheet after sheet had to be cut out to make all the chimneys and cornices and balconies and eaves, but no one got tired of working, and only Michael complained. Tom seemed delighted with the whole thing. Even Audrey, whom Jenny would have thought far too sophisticated to enjoy this, lent an experienced hand.\\n\\n \"Look, here\u0027s some furniture to put inside-are you done with the first floor, Zach? You see, this is the parlor, and here\u0027s a little parlor table. Gothic Revival, I think. Mother has one. I\u0027ll put it... here.\"\\n\\n \"Here\u0027s a sort of Oriental screen thing,\" Summer said. \"I\u0027ll put it by the table for the dolls to look at.\"\\n\\n \"There aren\u0027t any dolls,\" said Jenny.\\n\\n \"Yes, there are,\" Dee said and grinned. She\u0027d curled her long legs up and was reading the instructions to herself. \"And they\u0027re us. It says we each get a paper doll for a playing piece, and we draw our own face on it, and then we move the pieces through the house, trying to get to the turret at the top. That\u0027s the game.\"\\n\\n \"You said it was scary,\" Tom objected.\\n\\n \"I didn\u0027t finish. It\u0027s a haunted house. You run into a different nightmare in every room while you\u0027re trying to get to the top. And you have to watch out for the Shadow Man.\"\\n\\n \"The what?\" Jenny said.\\n\\n \"The Shadow Man. He\u0027s like the Sandman, only he brings you nightmares. He\u0027s lurking around inside, and if he catches you, he\u0027ll-well, listen. He\u0027ll \u0027bring to life your darkest fantasies and make you confess your most secret fears,\u0027\" she read with obvious enjoyment.\\n\\n \"All right!\" said Tom.\\n\\n \"Oh, geez,\" said Michael.\\n\\n \"What kind of darkest fantasies?\" said Summer.\\n\\n Mystery, thought Jenny. Danger. Seduction. Fear. Secrets revealed. Desires unveiled.\\n\\n Temptation.\\n\\n \"What\u0027s wrong with you, Thorny?\" Tom said affectionately. \"You\u0027re so nervous.\"\\n\\n \"It\u0027s just-I don\u0027t know if I like this game.\" Jenny looked up at him. \"But you do, don\u0027t you?\"\\n\\n \"Sure.\" His hazel eyes, brown flecked with green, were sparkling. \"It\u0027s good for a laugh.\" Then he added, \"Don\u0027t be scared. I\u0027ll protect you.\"\\n\\n Jenny gave him a mock glare and leaned against him. When she was away from Tom, the skin of her forearm missed him, and so did her shoulder and her side and her hip. The right side because she always sat on Tom\u0027s left.\\n\\n \"Go get some of Joey\u0027s crayons,\" Dee was ordering Summer. \"We\u0027re going to need to draw a lot. Not just the paper dolls that are us; we\u0027re also supposed to draw our worst nightmare.\"\\n\\n \"Why?\" said Michael unhappily.\\n\\n \"I told you. We have to face a different nightmare\\n\\n in every room. So we each draw one on a slip of paper and shuffle the papers and put them facedown on the floor of different rooms. Then when you get to a room, you can look at the slip and see what that person\u0027s nightmare is.\"\\n\\n Tom wiped his fingers on his jeans and went to sit by Dee on the couch, bending his head over the instructions. Summer jumped up to get crayons from Jenny\u0027s little brother\u0027s room. Zach, ignoring the rest of them, was working silently. Zach didn\u0027t say anything unless he had something to say.\\n\\n \"I think I\u0027m going to like this,\" Audrey said, judiciously placing furniture in the different rooms. She was humming a little, her polished nails gleaming, her hair shining copper under the track lighting.\\n\\n \"Here are the crayons, and I found some colored pencils, too,\" Summer said, returning with a Tupperware container. \"Now we can all draw.\" She rummaged through the sheets of glossy tagboard left in the box, finally producing one printed with human outlines. The paper dolls.\\n\\n They were all enjoying themselves. The game was a hit, the party a success. Jenny still felt cold inside.\\n\\n She had to admit, though, that there was a certain satisfaction in cutting neatly along dotted lines. It brought back long-ago memories. Coloring the paper dolls was fun, too, the Crayola wax sliding richly onto the stiff matte tagboard.\\n\\n But when it came to drawing on the rectangle of paper Summer gave her next, she stopped helplessly.\\n\\n Draw a nightmare? Her worst nightmare? She couldn\u0027t.\\n\\n Because the truth was that Jenny had a nightmare. Her own, personal, particular nightmare, based on\\n\\n something that had happened long ago ... and she couldn\u0027t remember it. She could never remember it when she was awake.\\n\\n The bad feeling was coming on, the one she sometimes got late at night. The scared feeling. Was she the only person in the world who woke up in the middle of the night sure that she\u0027d discovered some awful secret-only, once she\u0027d awakened, she couldn\u0027t remember what it was? Who felt sick with fear over something she couldn\u0027t remember?\\n\\n A picture flickered through her mind. Her grandfather. Her mother\u0027s father. Thinning white hair, a kind face, tired, twinkling dark eyes. He had entertained her when she was five years old with souvenirs from far-off places and magic tricks that had seemed real to a child. His basement had been full of the most wonderful things. Until the day something had happened....\\n\\n That last horrible day...\\n\\n The flicker died, and Jenny was glad. The only thing worse than not remembering was remembering. It was better to just leave the whole thing buried. The therapists had said differently at the time, but what did they know?\\n\\n Anyway, she certainly couldn\u0027t draw it.\\n\\n The others were all sketching assiduously. Tom and Dee were snickering together, using the lid of the game box as a desk. Summer was laughing, shaking back her soft light curls, drawing something with a lot of different colors. Zach was frowning over his nightmare, his face even more intense than usual; Audrey\u0027s eyebrows were arched in amusement.\\n\\n \"Where\u0027s green? I need lots of green,\" said Michael, hunting among the crayons.\\n\\n \"What for?\" asked Audrey, eyes narrowed.\\n\\n \"Can\u0027t tell you. It\u0027s a secret.\"\\n\\n Audrey turned her back on him, shielding her own paper.\\n\\n \"That\u0027s right, they\u0027re secrets,\" Dee agreed. \"You don\u0027t get to see them until you reach the room they\u0027re in.\"\\n\\n Nobody here could possibly have a secret from me, Jenny thought. Except Audrey, I\u0027ve known them all forever. I know when they lost their first tooth and got their first bra. None of them could have a real secret-like mine.\\n\\n If she had one, why not the others?\\n\\n Jenny looked at Tom. Handsome Tom, headstrong and a little arrogant, as even Jenny had to admit, if only to herself. What was he drawing now?\\n\\n \"Mine needs green, too. And yellow,\" he said.\\n\\n \"Mine needs black,\" said Dee and chuckled.\\n\\n \"All right, done,\" Audrey said.\\n\\n \"Come on, Jenny,\" Tom said. \"Aren\u0027t you finished yet?\"\\n\\n Jenny looked down at her paper. She had made a formless doodle around the edges; the middle was blank. After an embarrassed moment with everyone\u0027s eyes on her, she turned the paper over and gave it to Dee. She would just have to explain later.\\n\\n Dee shuffled all the slips and put them facedown in various rooms on the upper floors. \"Now we put our paper dolls in the parlor downstairs,\" she said. \"That\u0027s where we all start. And there should be a pile of game cards in the box, Summer, to tell us what to do and where to move. Put them in a stack on the table.\"\\n\\n Summer did while Audrey fixed the paper dolls on their little plastic anchors and set them up in the parlor.\\n\\n \"We need just one more thing,\" Dee said. She paused dramatically and then said, \"The Shadow Man.\"\\n\\n \"Here he is,\" Summer said, picking up the last sheet of stiff tagboard from the box. \"I\u0027ll cut out his friends first-the Creeper and the Lurker.\" She did, then handed the figures to Audrey. The Creeper was a giant snake, the Lurker a bristling wolf. Their names were printed in blood-red calligraphy.\\n\\n \"Charming,\" Audrey said, snapping anchors on. \"Anywhere in particular I\u0027m supposed to put them, Dee?\"\\n\\n \"No, the cards will tell us when we meet them.\"\\n\\n \"Here\u0027s the Shadow Man. He can shadow me if he wants; I think he\u0027s cute,\" Summer said. Audrey took the paper doll from her, but as she did Jenny grabbed her wrist. Jenny couldn\u0027t speak. She couldn\u0027t breathe, actually.\\n\\n It couldn\u0027t be-but it was. There was no question about it. The printed face that stared up at her was unmistakable.\\n\\n It was the boy in black, the boy from the game store. The boy with the shocking blue eyes. \\n\\n","sourceLink":"https://allnovel.net/the-forbidden-game-the-hunter-the-forbidden-game-1/page-3.html","bookId":2100,"book":{"id":2100,"title":"The Forbidden Game: The Hunter (The Forbidden Game #1)","description":"Storyline: The first part of the book Jenny is looking to buy a game (at a game store) because she is having a group of friends coming over to her house to hang out. At the game store she chooses the most \"unusual\" game to buy because the \"guy\" at the game store talks her into buying this particular game. Fast forward a little - Julian (the guy at the store) is actually from the dark world. He has been watching Jenny for years, from a far and is totally in love with her. He wants her with him in his world. Jenny\u0027s boyfriend thinks differently. Any hoo...Jenny\u0027s friends start the game not knowing that it is a \"forbidden game\". It turns out that the game is magical... and here are the rules - if Julian wins, he gets Jenny - if Jenny and her friends win, they go free. Simple right? - Wrong - because Julian is in charge of the game.\\n","cover":"https://allnovel.net/images/the-forbidden-game-the-hunter-the-forbidden-game-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-forbidden-game-the-hunter-the-forbidden-game-1.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:45:26 PM"}}
