{"id":14187,"no":18,"title":"TWO DAYS WE CELEBRATE","content":"Cartoon drawing of Boswell If we were asked (we have not been asked) to name a day the world ought to celebrate and does not, we would name the 16th of May. For on that day, in the year 1763, James Boswell first met Dr. Samuel Johnson. This great event, which enriched the world with one of the most vivid panoramas of human nature known to man, happened in Tom Davies\u0027s bookshop in Covent Garden. Mr. and Mrs. Davies were friends of the Doctor, who frequently visited their shop. Of them Boswell remarks quaintly that though they had been on the stage for many years, they \"maintained an uniform decency of character.\" The shop seems to have been a charming place: one went there not merely to buy books, but also to have a cup of tea in the back parlor. It is sad to think that though we have been hanging round bookshops for a number of years, we have never yet met a bookseller who invited us into the private office for a quiet cup. Wait a moment, though, we are forgetting Dr. Rosenbach, the famous bookseller of Philadelphia. But his collations, held in amazed memory by many editioneers, rarely descend to anything so humble as tea. One recalls a confused glamor of ortolans, trussed guinea-hens, strawberries reclining in a bowl carved out of solid ice, and what used to be known as vintages. It is a pity that Dr. Johnson died too soon to take lunch with Dr. Rosenbach. \"At last, on Monday, the 16th of May,\" says Boswell, \"when I was sitting in Mr. Davies\u0027s back parlor, after having drunk tea with him and Mrs. Davies, Johnson unexpectedly came into the shop; and Mr. Davies, having perceived him through the glass door, announced his awful approach to me. Mr. Davies mentioned my name, and respectfully introduced me to him. I was much agitated.\" The volatile Boswell may be forgiven his agitation. We also would have trembled not a little. Boswell was only twenty-two, and probably felt that his whole life and career hung upon the great man\u0027s mood. But embarrassment is a comely emotion for a young man in the face of greatness; and the Doctor was speedily put in a good humor by an opportunity to utter his favorite pleasantry at the expense of the Scotch. \"I do, indeed, come from Scotland,\" cried Boswell, after Davies had let the cat out of the bag; \"but I cannot help it.\" \"That, sir,\" said Doctor Johnson, \"is what a great many of your countrymen cannot help.\" The great book that dated from that meeting in Davies\u0027s back parlor has become one of the most intimately cherished possessions of the race. One finds its admirers and students scattered over the globe. No man who loves human nature in all its quirks and pangs, seasoned with bluff honesty and the genuineness of a cliff or a tree, can afford to step into a hearse until he has made it his own. And it is a noteworthy illustration of the biblical saying that whosoever will rule, let him be a servant. Boswell made himself the servant of Johnson, and became one of the masters of English literature. It used to annoy us to hear Karl Rosner referred to as \"the Kaiser\u0027s Boswell.\" For to boswellize (which is a verb that has gone into our dictionaries) means not merely to transcribe faithfully the acts and moods and import of a man\u0027s life; it implies also that the man so delineated be a good man and a great. Horace Traubel was perhaps a Boswell; but Rosner never. It is pleasant to know that Boswell was not merely a kind of animated note-book. He was a droll, vain, erring, bibulous, warm-hearted creature, a good deal of a Pepys, in fact, with all the Pepysian vices and virtues. Mr. A. Edward Newton\u0027s \"Amenities of Book Collecting\" makes Boswell very human to us. How jolly it is to learn that Jamie (like many lesser fry since) wrote press notices about himself. Here is one of his own blurbs, which we quote from Mr. Newton\u0027s book: Boswell, the author, is a most excellent man: he is of an ancient family in the west of Scotland, upon which he values himself not a little. At his nativity there appeared omens of his future greatness. His parts are bright, and his education has been good. He has traveled in post chaises miles without number. He is fond of seeing much of the world. He eats of every good dish, especially apple pie. He drinks Old Hock. He has a very fine temper. He is somewhat of a humorist and a little tinctured with pride. He has a good manly countenance, and he owns himself to be amorous. He has infinite vivacity, yet is observed at times to have a melancholy cast. He is rather fat than lean, rather short than tall, rather young than old. His shoes are neatly made, and he never wears spectacles. This brings the excellent Boswell very close to us indeed: he might almost be a member of the Authors\u0027 League. \"Especially apple pie, bless his heart!\" When we said that Boswell was a kind of Pepys, we fell by chance into a happy comparison. Not only by his volatile errors was he of the tribe of Samuel, but in his outstanding character by which he becomes of importance to posterity—that of one of the great diarists. Now there is no human failing upon which we look with more affectionate lenience than that of keeping a diary. All of us, in our pilgrimage through the difficult thickets of this world, have moods and moments when we have to fall back on ourselves for the only complete understanding and absolution we will ever find. In such times, how pleasant it is to record our emotions and misgivings in the sure and secret pages of some privy notebook; and how entertaining to read them again in later years! Dr. Johnson himself advised Bozzy to keep a journal, though he little suspected to what use it would be put. The cynical will say that he did so in order that Bozzy would have less time to pester him, but we believe his advice was sincere. It must have been, for the Doctor kept one himself, of which more in a moment. \"He recommended to me,\" Boswell says, \"to keep a journal of my life, full and unreserved. He said it would be a very good exercise and would yield me great satisfaction when the particulars were faded from my remembrance. He counselled me to keep it private, and said I might surely have a friend who would burn it in case of my death.\" Happily it was not burned. The Great Doctor never seemed so near to me as the other day when I saw a little notebook, bound in soft brown leather and interleaved with blotting paper, in which Bozzy\u0027s busy pen had jotted down memoranda of his talks with his friend, while they were still echoing in his mind. From this notebook (which must have been one of many) the paragraphs were transferred practically unaltered into the Life. This superb treasure, now owned by Mr. Adam of Buffalo, almost makes one hear the Doctor\u0027s voice; and one imagines Boswell sitting up at night with his candle, methodically recording the remarks of the day. The first entry was dated September 22, 1777, so Bozzy must have carried it in his pocket when Dr. Johnson and he were visiting Dr. Taylor in Ashbourne. It was during this junket that Dr. Johnson tried to pole the large dead cat over Dr. Taylor\u0027s dam, an incident that Boswell recorded as part of his \"Flemish picture of my friend.\" It was then also that Mrs. Killingley, mistress of Ashbourne\u0027s leading inn, The Green Man, begged Boswell \"to name the house to his extensive acquaintance.\" Certainly Bozzy\u0027s acquaintance was to be far more extensive than good Mrs. Killingley ever dreamed. It was he who \"named the house\" to me, and for this reason The Green Man profited in fourpence worth of cider, 134 years later. There is another day we have vowed to commemorate, by drinking great flaggonage of tea, and that is the 18th of September, Dr. Johnson\u0027s birthday. The Great Cham needs no champion; his speech and person have become part of our common heritage. Yet the extraordinary scenario in which Boswell filmed him for us has attained that curious estate of great literature the characteristic of which is that every man imagines he has read it, though he may never have opened its pages. It is like the historic landmark of one\u0027s home town, which foreigners from overseas come to study, but which the denizen has hardly entered. It is like Niagara Falls: we have a very fair mental picture of the spectacle and little zeal to visit the uproar itself. And so, though we all use Doctor Johnson\u0027s sharply stamped coinages, we generally are too lax about visiting the mint. But we will never cease to pray that every honest man should study Boswell. There are many who have topped the rise of human felicity in that book: when reading it they feel the tide of intellect brim the mind with a unique fullness of satisfaction. It is not a mere commentary on life: it is life—it fills and floods every channel of the brain. It is a book that men make a hobby of, as golf or billiards. To know it is a liberal education. I could have understood Germany yearning to invade England in order to annex Boswell\u0027s Johnson. There would have been some sense in that. What is the average man\u0027s conception of Doctor Johnson? We think of a huge ungainly creature, slovenly of dress, addicted to tea, the author of a dictionary and the center of a tavern coterie. We think of him prefacing bluff and vehement remarks with \"Sir,\" and having a knack for demolishing opponents in boisterous argument. All of which is passing true, just as is our picture of the Niagara we have never seen; but how it misses the inner tenderness and tormented virtue of the man! So it is refreshing sometimes to turn away from Boswell to those passages where the good old Doctor has revealed himself with his own hand. The letter to Chesterfield is too well known for comment. But no less noble, and not nearly so well known, is the preface to the Dictionary. How moving it is in its sturdy courage, its strong grasp of the tools of expression. In every line one feels the weight and push of a mind that had behind it the full reservoir of language, particularly the Latin. There is the same sense of urgent pressure that one feels in watching a strong stream backed up behind a dam: I look with pleasure on my book, however defective, and deliver it to the world with the spirit of a man that has endeavored well. That it will immediately become popular I have not promised to myself: a few wild blunders, and risible absurdities, from which no work of such multiplicity was ever free, may for a time furnish folly with laughter, and harden ignorance in contempt, but useful diligence will at last prevail, and there never can be wanting some who distinguish desert; who will consider that no dictionary of a living tongue ever can be perfect, since while it is hastening to publication, some words are budding, and some falling away; that a whole life cannot be spent upon syntax and etymology, and that even a whole life would not be sufficient; that he, whose design includes whatever language can express, must often speak of what he does not understand; that a writer will sometimes be tarried by eagerness to the end, and sometimes faint with weariness under a task, which Scaliger compares to the labors of the anvil and the mine; that what is obvious is not always known, and what is known is not always present; that sudden fits of inadvertency will surprise vigilance, slight avocations will seduce attention, and casual eclipses of the mind will darken learning; and that the writer shall often in vain trace his memory at the moment of need, for that which yesterday he knew with intuitive readiness, and which will come uncalled into his thoughts to-morrow. I know no better way of celebrating Doctor Johnson\u0027s birthday than by quoting a few passages from his \"Prayers and Meditations,\" jotted down during his life in small note-books and given shortly before his death to a friend. No one understands the dear old doctor unless he remembers that his spirit was greatly perplexed and harassed by sad and disordered broodings. The bodily twitchings and odd gestures which attracted so much attention as he rolled about the streets were symptoms of painful twitchings and gestures within. A great part of his intense delight in convivial gatherings, in conversation and the dinner table, was due to his eagerness to be taken out of himself. One fears that his solitary hours were very often tragic. There were certain dates which Doctor Johnson almost always commemorated in his private notebook—his birthday, the date of his wife\u0027s death, the Easter season and New Year\u0027s. In these pathetic little entries one sees the spirit that was dogmatic and proud among men abasing itself in humility and pouring out the generous tenderness of an affectionate nature. In these moments of contrition small peccadilloes took on tragic importance in his mind. Rising late in the morning and the untidy state of his papers seemed unforgivable sins. There is hardly any more moving picture in the history of mankind than that of the rugged old doctor pouring out his innocent petitions for greater strength in ordering his life and bewailing his faults of sluggishness, indulgence at table and disorderly thoughts. Let us begin with his entry on September 18, 1760, his fifty-second birthday: RESOLVED, D.J. To combat notions of obligation. To apply to study. To reclaim imaginations. To consult the resolves on Tetty\u0027s [his wife\u0027s] coffin. To rise early. To study religion. To go to church. To drink less strong liquors. To keep a journal. To oppose laziness by doing what is to be done to-morrow. Rise as early as I can. Send for books for history of war. Put books in order. Scheme of life. The very human feature of these little notes is that the same good resolutions appear year after year. Thus, four years after the above, we find him writing: Sept. 18, 1764. This is my 56th birthday, the day on which I have concluded 55 years. I have outlived many friends, I have felt many sorrows. I have made few improvements. Since my resolution formed last Easter, I have made no advancement in knowledge or in goodness; nor do I recollect that I have endeavored it. I am dejected, but not hopeless. I resolve, To study the Scriptures; I hope, in the original languages. Six hundred and forty verses every Sunday will nearly comprise the Scriptures in a year. To read good books; to study theology. To treasure in my mind passages for recollection. To rise early; not later than six, if I can; I hope sooner, but as soon as I can. To keep a journal, both of employment and of expenses. To keep accounts. To take care of my health by such means as I have designed. To set down at night some plan for the morrow. To-morrow I purpose to regulate my room. At Easter, 1765, he confesses sadly that he often lies abed until two in the afternoon; which, after all, was not so deplorable, for he usually went to bed very late. Boswell has spoken of \"the unseasonable hour at which he had habituated himself to expect the oblivion of repose.\" On New Year\u0027s Day, 1767, he prays: \"Enable me, O Lord, to use all enjoyments with due temperance, preserve me from unseasonable and immoderate sleep.\" Two years later than this he writes: \"I am not yet in a state to form many resolutions; I purpose and hope to rise early in the morning at eight, and by degrees at six; eight being the latest hour to which bedtime can be properly extended; and six the earliest that the present system of life requires.\" One of the most pathetic of his entries is the following, on September 18, 1768: \"This day it came into my mind to write the history of my melancholy. On this I purpose to deliberate; I know not whether it may not too much disturb me.\" From time to time there have been stupid or malicious people who have said that Johnson\u0027s marriage with a homely woman twenty years older than himself was not a love match. For instance, Mr. E.W. Howe, of Atchison, Kan., in most respects an amiable and well-conducted philosopher, uttered in Howe\u0027s Monthly (May, 1918) the following words, which (I hope) he will forever regret: \"I have heard that when a young man he (Johnson) married an ugly and vulgar old woman for her money, and that his taste was so bad that he worshiped her.\" Against this let us set what Johnson wrote in his notebook on March 28, 1770: This is the day on which, in 1752, I was deprived of poor dear Tetty. When I recollect the time in which we lived together, my grief of her departure is not abated; and I have less pleasure in any good that befalls me, because she does not partake it. On many occasions, I think what she would have said or done. When I saw the sea at Brighthelmstone, I wished for her to have seen it with me. But with respect to her, no rational wish is now left but that we may meet at last where the mercy of God shall make us happy, and perhaps make us instrumental to the happiness of each other. It is now 18 years. Let us end the memorandum with a less solemn note. On Good Friday, 1779, he and Boswell went to church together. When they returned the good old doctor sat down to read the Bible, and he says, \"I gave Boswell Les Pensées de Pascal, that he might not interrupt me.\" Of this very copy Boswell says: \"I preserve the book with reverence.\" I wonder who has it now? So let us wish Doctor Johnson many happy returns of the day, sure that as long as paper and ink and eyesight preserve their virtue he will bide among us, real and living and endlessly loved. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3202/87466.html","bookId":761,"book":{"id":761,"title":"Mince Pie","description":"简介： Those who buy their ink in little stone jugs may prefer to do so because the pottle reminds them of cruiskeen lawn or ginger beer (with its wire-bound cork), but they miss a noble delight. Ink should be bought in the tall, blue glass, quart bottle (w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3202","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
