{"id":14171,"no":2,"title":"ON FILLING AN INK-WELL","content":"Those who buy their ink in little stone jugs may prefer to do so because the pottle reminds them of cruiskeen lawn or ginger beer (with its wire-bound cork), but they miss a noble delight. Ink should be bought in the tall, blue glass, quart bottle (with the ingenious non-drip spout), and once every three weeks or so, when you fill your ink-well, it is your privilege to elevate the flask against the brightness of a window, and meditate (with a breath of sadness) on the joys and problems that sacred fluid holds in solution. How blue it shines toward the light! Blue as lupin or larkspur, or cornflower—aye, and even so blue art thou, my scriven, to think how far the written page falls short of the bright ecstasy of thy dream! In the bottle, what magnificence of unpenned stuff lies cool and liquid: what fluency of essay, what fonts of song. As the bottle glints, blue as a squill or a hyacinth, blue as the meadows of Elysium or the eyes of girls loved by young poets, meseems the racing pen might almost gain upon the thoughts that are turning the bend in the road. A jolly throng, those thoughts: I can see them talking and laughing together. But when pen reaches the road\u0027s turning, the thoughts are gone far ahead: their delicate figures are silhouettes against the sky. It is a sacramental matter, this filling the ink-well. Is there a writer, however humble, who has not poured into his writing pot, with the ink, some wistful hopes or prayers for what may emerge from that dark source? Is there not some particular reverence due the ink-well, some form of propitiation to humbug the powers of evil and constraint that devil the journalist? Satan hovers near the ink-pot. Luther solved the matter by throwing the well itself at the apparition. That savors to me too much of homeopathy. If Satan ever puts his face over my desk, I shall hurl a volume of Harold Bell Wright at him. But what becomes of the ink-pots of glory? The conduit from which Boswell drew, for Charles Dilly in The Poultry, the great river of his Johnson? The well (was it of blue china?) whence flowed Dream Children: a Revery? (It was written on folio ledger sheets from the East India House—I saw the manuscript only yesterday in a room at Daylesford, Pennsylvania, where much of the richest ink of the last two centuries is lovingly laid away.) The pot of chuckling fluid where Harry Fielding dipped his pen to tell the history of a certain foundling; the ink-wells of the Café de la Source Man filling inkwell on the Boul\u0027 Mich\u0027—do they by any chance remember which it was that R.L.S. used? One of the happiest tremors of my life was when I went to that café and called for a bock and writing material, just because R.L.S. had once written letters there. And the ink-well Poe used at that boarding-house in Greenwich Street, New York (April, 1844), when he wrote to his dear Muddy (his mother-in-law) to describe how he and Virginia had reached a haven of square meals. That hopeful letter, so perfect now in pathos— For breakfast we had excellent-flavored coffee, hot and strong—not very clear and no great deal of cream—veal cutlets, elegant ham and eggs and nice bread and butter. I never sat down to a more plentiful or a nicer breakfast. I wish you could have seen the eggs—and the great dishes of meat. Sis [his wife] is delighted, and we are both in excellent spirits. She has coughed hardly any and had no night sweat. She is now busy mending my pants, which I tore against a nail. I went out last night and bought a skein of silk, a skein of thread, two buttons, a pair of slippers, and a tin pan for the stove. The fire kept in all night. We have now got four dollars and a half left. To-morrow I am going to try and borrow three dollars, so that I may have a fortnight to go upon. I feel in excellent spirits, and haven\u0027t drank a drop—so that I hope soon to get out of trouble. Yes, let us clear the typewriter off the table: an ink-well is a sacred thing. Do you ever stop to think, when you see the grimy spattered desks of a public post-office, how many eager or puzzled human hearts have tried, in those dingy little ink-cups, to set themselves right with fortune? What blissful meetings have been appointed, what scribblings of pain and sorrow, out of those founts of common speech. And the ink-wells on hotel counters—does not the public dipping place of the Bellevue Hotel, Boston, win a new dignity in my memory when I know (as I learned lately) that Rupert Brooke registered there in the spring of 1914? I remember, too, a certain pleasant vibration when, signing my name one day in the Bellevue\u0027s book, I found Miss Agnes Repplier\u0027s autograph a little above on the same page. Among our younger friends, Vachel Lindsay comes to mind as one who has done honor to the ink-well. His Apology for the Bottle Volcanic is in his best flow of secret smiling (save an unfortunate dilution of Riley): Sometimes I dip my pen and find the bottle full of fire, The salamanders flying forth I cannot but admire.... O sad deceiving ink, as bad as liquor in its way— All demons of a bottle size have pranced from you to-day, And seized my pen for hobby-horse as witches ride a broom, And left a trail of brimstone words and blots and gobs of gloom. And yet when I am extra good ... [here I omit the transfusion of Riley] My bottle spreads a rainbow mist, and from the vapor fine Ten thousand troops from fairyland come riding in a line. I suppose it is the mark of a trifling mind, yet I like to hear of the little particulars that surrounded those whose pens struck sparks. It is Boswell that leads us into that habit of thought. I like to know what the author wore, how he sat, what the furniture of his desk and chamber, who cooked his meals for him, and with what appetite he approached them. \"The mind soars by an effort to the grand and lofty\" (so dipped Hazlitt in some favored ink-bottle)—\"it is at home in the groveling, the disagreeable, and the little.\" I like to think, as I look along book shelves, that every one of these favorites was born out of an ink-well. I imagine the hopes and visions that thronged the author\u0027s mind as he filled his pot and sliced the quill. What various fruits have flowed from those ink-wells of the past: for some, comfort and honor, quiet homes and plenteousness; for others, bitterness and disappointment. I have seen a copy of Poe\u0027s poems, published in 1845 by Putnam, inscribed by the author. The volume had been bought for $2,500. Think what that would have meant to Poe himself. Some such thoughts as these twinkled in my head as I held up the Pierian bottle against the light, admired the deep blue of it, and filled my ink-well. And then I took up my pen, which wrote: A GRACE BEFORE WRITING On Filling an Ink-well This is a sacrament, I think! Holding the bottle toward the light, As blue as lupin gleams the ink: May Truth be with me as I write! That small dark cistern may afford Reunion with some vanished friend,— And with this ink I have just poured May none but honest words be penned! \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3202/87450.html","bookId":761,"book":{"id":761,"title":"Mince Pie","description":"简介： Those who buy their ink in little stone jugs may prefer to do so because the pottle reminds them of cruiskeen lawn or ginger beer (with its wire-bound cork), but they miss a noble delight. Ink should be bought in the tall, blue glass, quart bottle (w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3202","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
