{"id":14217,"no":48,"title":"VISITING POETS","content":"We were giving a young English poet a taste of Philadelphia, trying to show him one or two of the simple beauties that make life agreeable to us. Having just been photographed, he was in high good humor. \"What a pity,\" he said, \"that you in America have no literature that reflects the amazing energy, the humor, the raciness of your life! I woke up last night at the hotel and heard a motor fire engine thunder by. There\u0027s a symbol of the extraordinary vitality of America! My, if I could only live over here a couple of years, how I\u0027d like to try my hand at it. It\u0027s a pity that no one over here is putting down the humor of your life.\" \"Have you read O. Henry?\" we suggested. \"Extraordinary country,\" he went on. \"Somebody turned me loose on Mr. Morgan\u0027s library in New York. There was a librarian there, but I didn\u0027t let her bother me. I wanted to see that manuscript of \u0027Endymion\u0027 they have there. I supposed they would take me up to a glass case and let me gaze at it. Not at all. They put it right in my hands and I spent three quarters of an hour over it. Wonderful stuff. You know, the first edition of my book is selling at a double premium in London. It\u0027s been out only eighteen months.\" \"How do you fellows get away with it?\" we asked humbly. \"I hope Pond isn\u0027t going to book me up for too many lectures,\" he said. \"I\u0027ve got to get back to England in the spring. There\u0027s a painter over there waiting to do my portrait. But there are so many places I\u0027ve got to lecture—everybody seems to want to hear about the young English poets.\" \"I hear Philip Gibbs is just arriving in New York,\" we said. \"Is that so? Dear me, he\u0027ll quite take the wind out of my sails, won\u0027t he? Nice chap, Gibbs. He sent me an awfully cheery note when I went out to the front as a war correspondent. Said he liked my stuff about the sodgers. He\u0027ll make a pot of money over here, won\u0027t he?\" We skipped across City Hall Square abreast of some trolley cars. \"I say, these trams keep one moving, don\u0027t they?\" he said. \"You know, I was tremendously bucked by that department store you took me to see. That\u0027s the sort of place one has to go to see the real art of America. Those paintings in there, by the elevators, they were done by a young English girl. Friend of mine—in fact, she did the pictures for my first book. Pity you have so few poets over here. You mustn\u0027t make me lose my train; I\u0027ve got a date with Vachel Lindsay and Edgar Lee Masters in New York to-night. Vachel\u0027s an amusing bird. I must get him over to England and get him started. I\u0027ve written to Edmund Gosse about him, and I\u0027m going to write again. What a pity Irvin Cobb doesn\u0027t write poetry! He\u0027s a great writer. What vivacity, what a rich vocabulary!\" \"Have you read Mark Twain?\" we quavered. \"Oh, Mark\u0027s grand when he\u0027s serious; but when he tries to be funny, you know, it\u0027s too obvious. I can always see him feeling for the joke. No, it doesn\u0027t come off. You know an artist simply doesn\u0027t exist for me unless he has something to say. That\u0027s what makes me so annoyed with R.L.S. In \u0027Weir of Hermiston\u0027 and the \u0027New Arabian Nights\u0027 he really had something to say; the rest of the time he was playing the fool on some one else\u0027s instrument. You know style isn\u0027t something you can borrow from some one else; it\u0027s the unconscious revelation of a man\u0027s own personality.\" We agreed. \"I wonder if there aren\u0027t some clubs around here that would like to hear me talk?\" he said. \"You know, I\u0027d like to come back to Philadelphia if I could get some dates of that sort. Just put me wise, old man, if you hear of anything. I was telling some of your poets in New York about the lectures I\u0027ve been giving. Those chaps are fearfully rough with one. You know, they\u0027ll just ride over one roughshod if you give them a chance. They hate to see a fellow a success. Awful tripe some of them are writing. They don\u0027t seem to be expressing the spirit, the fine exhilaration, of American life at all. If I had my way, I\u0027d make every one in America read Rabelais and Madame Bovary. Then they ought to study some of the old English poets, like Marvell, to give them precision. It\u0027s lots of fun telling them these things. They respond famously. Now over in my country we poets are all so reserved, so shy, so taciturn. \"You know Pond, the lecture man in New York, was telling me a quaint story about Masefield. Great friend of mine, old Jan Masefield. He turned up in New York to talk at some show Pond was running. Had on some horrible old trench boots. There was only about twenty minutes before the show began. \u0027Well,\u0027 says Pond, hoping Jan was going to change his clothes, \u0027are you all ready?\u0027 \u0027Oh, yes,\u0027 says Jan. Pond was graveled; didn\u0027t know just what to do. So he says, hoping to give Jan a hint, \u0027Well, I\u0027ve just got to get my boots polished.\u0027 Of course, they didn\u0027t need it—Americans\u0027 boots never do—but Pond sits down on a boot-polishing stand and the boy begins to polish for dear life. Jan sits down by him, deep in some little book or other, paying no attention. Pond whispers to the boy, \u0027Quick, polish his boots while he\u0027s reading.\u0027 Jan was deep in his book, never knew what was going on. Then they went off to the lecture, Jan in his jolly old sack suit.\" We went up to a private gallery on Walnut Street, where some of the most remarkable literary treasures in the world are stored, such as the original copy of Elia given by Charles Lamb to the lady he wanted to marry, Fanny Kelly. There we also saw some remarkable first editions of Shelley. \"You know,\" he said, \"Mrs. L---- in New York—I had an introduction to her from Jan—wanted to give me a first edition of Shelley, but I wouldn\u0027t let her.\" \"How do you fellows get away with it?\" we said again humbly. \"Well, old man,\" he said, \"I must be going. Mustn\u0027t keep Vachel waiting. Is this where I train? What a ripping station! Some day I must write a poem about all this. What a pity you have so few poets ...\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3202/87496.html","bookId":761,"book":{"id":761,"title":"Mince Pie","description":"简介： Those who buy their ink in little stone jugs may prefer to do so because the pottle reminds them of cruiskeen lawn or ginger beer (with its wire-bound cork), but they miss a noble delight. Ink should be bought in the tall, blue glass, quart bottle (w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3202","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
