{"id":62409,"no":11,"title":"Page 11","content":"CHAPTER 30\\n\\n SB level.\\n\\n Senate basement.\\n\\n Robert Langdon\u0027s claustrophobia gripped him more tightly with every hastening step of their descent. As they moved deeper into the building\u0027s original foundation, the air became heavy, and the ventilation seemed nonexistent. The walls down here were an uneven blend of stone and yellow brick.\\n\\n Director Sato typed on her BlackBerry as they walked. Langdon sensed a suspicion in her guarded manner, but the feeling was quickly becoming reciprocal. Sato still hadn\u0027t told him how she knew Langdon was here tonight. An issue of national security? He had a hard time understanding any relation between ancient mysticism and national security. Then again, he had a hard time understanding much of anything about this situation.\\n\\n Peter Solomon entrusted me with a talisman . . . a deluded lunatic tricked me into bringing it to the Capitol and wants me to use it to unlock a mystical portal . . . possibly in a room called SBB13.\\n\\n Not exactly a clear picture.\\n\\n As they pressed on, Langdon tried to shake from his mind the horrible image of Peter\u0027s tattooed hand, transformed into the Hand of the Mysteries. The gruesome picture was accompanied by Peter\u0027s voice: The Ancient Mysteries, Robert, have spawned many myths . . . but that does not mean they themselves are fiction.\\n\\n Despite a career studying mystical symbols and history, Langdon had always struggled intellectually with the idea of the Ancient Mysteries and their potent promise of apotheosis.\\n\\n Admittedly, the historical record contained indisputable evidence that secret wisdom had been passed down through the ages, apparently having come out of the Mystery Schools in early Egypt. This knowledge moved underground, resurfacing in Renaissance Europe, where, according to most accounts, it was entrusted to an elite group of scientists within the walls of Europe\u0027s premier scientific think tank--the Royal Society of London--enigmatically nicknamed the Invisible College.\\n\\n This concealed \"college\" quickly became a brain trust of the world\u0027s most enlightened minds-- those of Isaac Newton, Francis Bacon, Robert Boyle, and even Benjamin Franklin. Today, the list of modern \"fellows\" was no less impressive--Einstein, Hawking, Bohr, and Celsius. These great minds had all made quantum leaps in human understanding, advances that, according to some, were the result of their exposure to ancient wisdom hidden within the Invisible College. Langdon doubted this was true, although certainly there had been an unusual amount of \"mystical work\" taking place within those walls.\\n\\n The discovery of Isaac Newton\u0027s secret papers in 1936 had stunned the world by revealing Newton\u0027s all-consuming passion for the study of ancient alchemy and mystical wisdom. Newton\u0027s private papers included a handwritten letter to Robert Boyle in which he exhorted Boyle to keep \"high silence\" regarding the mystical knowledge they had learned. \"It cannot be communicated,\" Newton wrote, \"without immense damage to the world.\"\\n\\n The meaning of this strange warning was still being debated today.\\n\\n \"Professor,\" Sato said suddenly, glancing up from her BlackBerry, \"despite your insistence that you have no idea why you\u0027re here tonight, perhaps you could shed light on the meaning of Peter Solomon\u0027s ring.\"\\n\\n \"I can try,\" Langdon said, refocusing.\\n\\n She produced the specimen bag and handed it to Langdon. \"Tell me about the symbols on his ring.\"\\n\\n Langdon examined the familiar ring as they moved through the deserted passageway. Its face bore the image of a double-headed phoenix holding a banner proclaiming ORDO AB CHAO, and its chest was emblazoned with the number 33. \"The double-headed phoenix with the number thirty-three is the emblem of the highest Masonic degree.\" Technically, this prestigious degree existed solely within the Scottish Rite. Nonetheless, the rites and degrees of Masonry were a complex hierarchy that Langdon had no desire to detail for Sato tonight. \"Essentially, the thirty- third degree is an elite honor reserved for a small group of highly accomplished Masons. All the other degrees can be attained by successful completion of the previous degree, but ascension to the thirty-third degree is controlled. It\u0027s by invitation only.\"\\n\\n \"So you were aware that Peter Solomon was a member of this elite inner circle?\"\\n\\n \"Of course. Membership is hardly a secret.\"\\n\\n \"And he is their highest-ranking official?\"\\n\\n \"Currently, yes. Peter heads the Supreme Council Thirty-third Degree, which is the governing body of the Scottish Rite in America.\" Langdon always loved visiting their headquarters--the House of the Temple--a classical masterpiece whose symbolic ornamentation rivaled that of Scotland\u0027s Rosslyn Chapel.\\n\\n \"Professor, did you notice the engraving on the ring\u0027s band? It bears the words `All is revealed at the thirty-third degree.\u0027 \"\\n\\n Langdon nodded. \"It\u0027s a common theme in Masonic lore.\"\\n\\n \"Meaning, I assume, that if a Mason is admitted to this highest thirty-third degree, then something special is revealed to him?\"\\n\\n \"Yes, that\u0027s the lore, but probably not the reality. There\u0027s always been conspiratorial conjecture that a select few within this highest echelon of Masonry are made privy to some great mystical secret. The truth, I suspect, is probably far less dramatic.\"\\n\\n Peter Solomon often made playful allusions to the existence of a precious Masonic secret, but Langdon always assumed it was just a mischievous attempt to coax him into joining the brotherhood. Unfortunately, tonight\u0027s events had been anything but playful, and there had been nothing mischievous about the seriousness with which Peter had urged Langdon to protect the sealed package in his daybag.\\n\\n Langdon glanced forlornly at the plastic bag containing Peter\u0027s gold ring. \"Director,\" he asked, \"would you mind if I held on to this?\"\\n\\n She looked over. \"Why?\"\\n\\n \"It\u0027s very valuable to Peter, and I\u0027d like to return it to him tonight.\"\\n\\n She looked skeptical. \"Let\u0027s hope you get that chance.\" \"Thanks.\" Langdon pocketed the ring.\\n\\n \"Another question,\" Sato said as they hastened deeper into the labyrinth. \"My staff said that while cross-checking the concepts of the `thirty-third degree\u0027 and `portal\u0027 with Masonry, they turned up literally hundreds of references to a `pyramid\u0027?\"\\n\\n \"That\u0027s not surprising, either,\" Langdon said. \"The pyramid builders of Egypt are the forerunners of the modern stonemasons, and the pyramid, along with Egyptian themes, is very common in Masonic symbolism.\"\\n\\n \"Symbolizing what?\"\\n\\n \"The pyramid essentially represents enlightenment. It\u0027s an architectural symbol emblematic of ancient man\u0027s ability to break free from his earthly plane and ascend upward toward heaven, toward the golden sun, and ultimately, toward the supreme source of illumination.\"\\n\\n She waited a moment. \"Nothing else?\"\\n\\n Nothing else?! Langdon had just described one of history\u0027s most elegant symbols. The structure through which man elevated himself into the realm of the gods.\\n\\n \"According to my staff,\" she said, \"it sounds like there is a much more relevant connection tonight. They tell me there exists a popular legend about a specific pyramid here in Washington--a pyramid that relates specifically to the Masons and the Ancient Mysteries?\"\\n\\n Langdon now realized what she was referring to, and he tried to dispel the notion before they wasted any more time. \"I am familiar with the legend, Director, but it\u0027s pure fantasy. The Masonic Pyramid is one of D.C.\u0027s most enduring myths, probably stemming from the pyramid on the Great Seal of the United States.\"\\n\\n \"Why didn\u0027t you mention it earlier?\"\\n\\n Langdon shrugged. \"Because it has no basis in fact. Like I said, it\u0027s a myth. One of many associated with the Masons.\"\\n\\n \"And yet this particular myth relates directly to the Ancient Mysteries?\"\\n\\n \"Sure, as do plenty of others. The Ancient Mysteries are the foundation for countless legends that have survived in history--stories about powerful wisdom protected by secret guardians like the Templars, the Rosicrucians, the Illuminati, the Alumbrados--the list goes on and on. They are all based on the Ancient Mysteries . . . and the Masonic Pyramid is just one example.\"\\n\\n \"I see,\" Sato said. \"And what does this legend actually say?\"\\n\\n Langdon considered it for a few steps and then replied, \"Well, I\u0027m no specialist in conspiracy theory, but I am educated in mythology, and most accounts go something like this: The Ancient Mysteries--the lost wisdom of the ages--have long been considered mankind\u0027s most sacred treasure, and like all great treasures, they have been carefully protected. The enlightened sages who understood the true power of this wisdom learned to fear its awesome potential. They knew that if this secret knowledge were to fall into uninitiated hands, the results could be devastating; as we said earlier, powerful tools can be used either for good or for evil. So, in order to protect the Ancient Mysteries, and mankind in the process, the early practitioners formed secret fraternities. Inside these brotherhoods, they shared their wisdom only with the properly initiated, passing the wisdom from sage to sage. Many believe we can look back and see the historical remnants of those who mastered the Mysteries . . . in the stories of sorcerers, magicians, and healers.\"\\n\\n \"And the Masonic Pyramid?\" Sato asked. \"How does that fit in?\"\\n\\n \"Well,\" Langdon said, striding faster now to keep pace, \"this is where history and myth begin to merge. According to some accounts, by the sixteenth century in Europe, almost all of these secret fraternities had become extinct, most of them exterminated by a growing tide of religious persecution. The Freemasons, it is said, became the last surviving custodians of the Ancient Mysteries. Understandably, they feared that if their own brotherhood one day died off like its predecessors, the Ancient Mysteries would be lost for all time.\"\\n\\n \"And the pyramid?\" Sato again pressed.\\n\\n Langdon was getting to it. \"The legend of the Masonic Pyramid is quite simple. It states that the Masons, in order to fulfill their responsibility of protecting this great wisdom for future generations, decided to hide it in a great fortress.\" Langdon tried to gather his recollections of the story. \"Again, I stress this is all myth, but allegedly, the Masons transported their secret wisdom from the Old World to the New World--here, to America--a land they hoped would remain free from religious tyranny. And here they built an impenetrable fortress--a hidden pyramid-- designed to protect the Ancient Mysteries until the time that all of mankind was ready to handle the awesome power that this wisdom could communicate. According to the myth, the Masons crowned their great pyramid with a shining, solid-gold capstone as symbol of the precious treasure within--the ancient wisdom capable of empowering mankind to his full human potential. Apotheosis.\"\\n\\n \"Quite a story,\" Sato said.\\n\\n \"Yes. The Masons fall victim to all kinds of crazy legends.\"\\n\\n \"Obviously you don\u0027t believe such a pyramid exists.\"\\n\\n \"Of course not,\" Langdon replied. \"There\u0027s no evidence whatsoever to suggest that our Masonic forefathers built any kind of pyramid in America, much less in D.C. It\u0027s pretty difficult to hide a pyramid, especially one large enough to hold all the lost wisdom of the ages.\"\\n\\n The legend, as Langdon recalled, never explained exactly what was supposed to be inside the Masonic Pyramid--whether it was ancient texts, occult writings, scientific revelations, or something far more mysterious--but the legend did say that the precious information inside was ingeniously encoded . . . and understandable only to the most enlightened souls.\\n\\n \"Anyway,\" Langdon said, \"this story falls into a category we symbologists call an `archetypal hybrid\u0027--a blend of other classic legends, borrowing so many elements from popular mythology that it could only be a fictional construct . . . not historical fact.\"\\n\\n When Langdon taught his students about archetypal hybrids, he used the example of fairy tales, which were recounted across generations and exaggerated over time, borrowing so heavily from one another that they evolved into homogenized morality tales with the same iconic elements-- virginal damsels, handsome princes, impenetrable fortresses, and powerful wizards. By way of fairy tales, this primeval battle of \"good vs. evil\" is ingrained into us as children through our stories: Merlin vs. Morgan le Fay, Saint George vs. the Dragon, David vs. Goliath, Snow White vs. the Witch, and even Luke Skywalker battling Darth Vader.\\n\\n Sato scratched her head as they turned a corner and followed Anderson down a short flight of stairs. \"Tell me this. If I\u0027m not mistaken, pyramids were once considered mystical portals through which the deceased pharaohs could ascend to the gods, were they not?\"\\n\\n \"True.\"\\n\\n Sato stopped short and caught Langdon\u0027s arm, glaring up at him with an expression somewhere between surprise and disbelief. \"You\u0027re saying Peter Solomon\u0027s captor told you to find a hidden portal, and it didn\u0027t occur to you that he was talking about the Masonic Pyramid from this legend?\"\\n\\n \"By any name, the Masonic Pyramid is a fairy tale. It\u0027s purely fantasy.\"\\n\\n Sato stepped closer to him now, and Langdon could smell her cigarette breath. \"I understand your position on that, Professor, but for the sake of my investigation, the parallel is hard to ignore. A portal leading to secret knowledge? To my ear, this sounds a lot like what Peter Solomon\u0027s captor claims you, alone, can unlock.\"\\n\\n \"Well, I can hardly believe--\"\\n\\n \"What you believe is not the point. No matter what you believe, you must concede that this man might himself believe that the Masonic Pyramid is real.\"\\n\\n \"The man\u0027s a lunatic! He may well believe that SBB Thirteen is the entrance to a giant underground pyramid that contains all the lost wisdom of the ancients!\"\\n\\n Sato stood perfectly still, her eyes seething. \"The crisis I am facing tonight is not a fairy tale, Professor. It is quite real, I assure you.\"\\n\\n A cold silence hung between them. \"Ma\u0027am?\" Anderson finally said, gesturing to another secure door ten feet away. \"We\u0027re almost there, if you\u0027d like to continue.\" Sato finally broke eye contact with Langdon, motioning for Anderson to move on. They followed the security chief through the secure doorway, which deposited them in a narrow passage. Langdon looked left and then right.\\n\\n You\u0027ve got to be kidding.\\n\\n He was standing in the longest hallway he had ever seen.\\n\\n CHAPTER 31\\n\\n Trish Dunne felt the familiar surge of adrenaline as she exited the bright lights of the Cube and moved into the raw darkness of the void. The SMSC\u0027s front gate had just called to say that Katherine\u0027s guest, Dr. Abaddon, had arrived and required an escort back to Pod 5. Trish had offered to bring him back, mostly out of curiosity. Katherine had said very little about the man who would be visiting them, and Trish was intrigued. The man was apparently someone Peter Solomon trusted deeply; the Solomons never invited anyone back to the Cube. This was a first.\\n\\n I hope he handles the crossing okay, Trish thought as she moved through the frigid darkness. The last thing she needed was Katherine\u0027s VIP panicking when he realized what he had to do to get to the lab. The first time is always the worst.\\n\\n Trish\u0027s first time had been about a year ago. She had accepted Katherine\u0027s job offer, signed a nondisclosure, and then come to the SMSC with Katherine to see the lab. The two women had walked the length of \"The Street,\" arriving at a metal door marked POD 5. Even though Katherine had tried to prepare her by describing the lab\u0027s remote location, Trish was not ready for what she saw when the pod door hissed open.\\n\\n The void.\\n\\n Katherine stepped over the threshold, walked a few feet into the perfect blackness, and then motioned for Trish to follow. \"Trust me. You won\u0027t get lost.\"\\n\\n Trish pictured herself wandering in a pitch-black, stadium-size room and broke a sweat at the mere thought.\\n\\n \"We have a guidance system to keep you on track.\" Katherine pointed to the floor. \"Very low- tech.\"\\n\\n Trish squinted through the darkness at the rough cement floor. It took a moment to see it in the darkness, but there was a narrow carpet runner that had been laid down in a straight line. The carpet ran like a roadway, disappearing into the darkness.\\n\\n \"See with your feet,\" Katherine said, turning and walking off. \"Just follow right behind me.\"\\n\\n As Katherine disappeared into the blackness, Trish swallowed her fear and followed. This is insane! She had taken only a few steps down the carpet when the Pod 5 door swung shut behind her, snuffing out the last faint hint of light. Pulse racing, Trish turned all of her attention to the feeling of the carpet beneath her feet. She had ventured only a handful of steps down the soft runner when she felt the side of her right foot hit hard cement. Startled, she instinctively corrected to the left, getting both feet back on soft carpet.\\n\\n Katherine\u0027s voice materialized up ahead in the blackness, her words almost entirely swallowed by the lifeless acoustics of this abyss. \"The human body is amazing,\" she said. \"If you deprive it of one sensory input, the other senses take over, almost instantly. Right now, the nerves in your feet are literally `tuning\u0027 themselves to become more sensitive.\"\\n\\n Good thing, Trish thought, correcting course again.\\n\\n They walked in silence for what seemed entirely too long. \"How much farther?\" Trish finally asked.\\n\\n \"We\u0027re about halfway.\" Katherine\u0027s voice sounded more distant now.\\n\\n Trish sped up, doing her best to stay composed, but the breadth of the darkness felt like it would engulf her. I can\u0027t see one millimeter in front of my face! \"Katherine? How do you know when to stop walking?\"\\n\\n \"You\u0027ll know in a moment,\" Katherine said.\\n\\n That was a year ago, and now, tonight, Trish was once again in the void, heading in the opposite direction, out to the lobby to retrieve her boss\u0027s guest. A sudden change in carpet texture beneath her feet alerted her that she was three yards from the exit. The warning track, as it was called by Peter Solomon, an avid baseball fan. Trish stopped short, pulled out her key card, and groped in the darkness along the wall until she found the raised slot and inserted her card.\\n\\n The door hissed open.\\n\\n Trish squinted into the welcoming light of the SMSC hallway.\\n\\n Made it . . . again.\\n\\n Moving through the deserted corridors, Trish found herself thinking about the bizarre redacted file they had found on a secure network. Ancient portal? Secret location underground? She wondered if Mark Zoubianis was having any luck figuring out where the mysterious document was located. Inside the control room, Katherine stood in the soft glow of the plasma wall and gazed up at the enigmatic document they had uncovered. She had isolated her key phrases now and felt increasingly certain that the document was talking about the same far-flung legend that her brother had apparently shared with Dr. Abaddon.\\n\\n . . . secret location UNDERGROUND where the . . .\\n\\n . . . somewhere in WASHINGTON, D.C., the coordinates . . .\\n\\n . . . uncovered an ANCIENT PORTAL that led . . .\\n\\n . . . warning the PYRAMID holds dangerous . . .\\n\\n . . . decipher this ENGRAVED SYMBOLON to unveil . . .\\n\\n I need to see the rest of the file, Katherine thought.\\n\\n She stared a moment longer and then flipped the plasma wall\u0027s power switch. Katherine always turned off this energy-intensive display so as not to waste the fuel cell\u0027s liquid hydrogen reserves.\\n\\n She watched as her keywords slowly faded, collapsing down into a tiny white dot, which hovered in the middle of the wall and then finally twinkled out.\\n\\n She turned and walked back toward her office. Dr. Abaddon would be arriving momentarily, and she wanted to make him feel welcome.\\n\\n CHAPTER 32\\n\\n \"Almost there,\" Anderson said, guiding Langdon and Sato down the seemingly endless corridor that ran the entire length of the Capitol\u0027s eastern foundation. \"In Lincoln\u0027s day, this passage had a dirt floor and was filled with rats.\"\\n\\n Langdon felt grateful the floor had been tiled; he was not a big fan of rats. The group continued on, their footfalls drumming up an eerie, uneven echo in the long passageway. Doorways lined the long hallway, some closed but many ajar. Many of the rooms down on this level looked abandoned. Langdon noticed the numbers on the doors were now descending and, after a while, seemed to be running out.\\n\\n SB4 . . . SB3 . . . SB2 . . . SB1 . . .\\n\\n They continued past an unmarked door, but Anderson stopped short when the numbers began ascending again.\\n\\n HB1 . . . HB2 . . .\\n\\n \"Sorry,\" Anderson said. \"Missed it. I almost never come down this deep.\"\\n\\n The group backed up a few yards to an old metal door, which Langdon now realized was located at the hallway\u0027s central point--the meridian that divided the Senate Basement (SB) and the House Basement (HB). As it turned out, the door was indeed marked, but its engraving was so faded, it was almost imperceptible.\\n\\n SBB\\n\\n \"Here we are,\" Anderson said. \"Keys will be arriving any moment.\"\\n\\n Sato frowned and checked her watch.\\n\\n Langdon eyed the SBB marking and asked Anderson, \"Why is this space associated with the Senate side even though it\u0027s in the middle?\"\\n\\n Anderson looked puzzled. \"What do you mean?\"\\n\\n \"It says SBB, which begins with an S, not an H.\"\\n\\n Anderson shook his head. \"The S in SBB doesn\u0027t stand for Senate. It--\"\\n\\n \"Chief?\" a guard called out in the distance. He came jogging up the hallway toward them, holding out a key. \"Sorry, sir, it took a few minutes. We couldn\u0027t locate the main SBB key. This is a spare from an auxiliary box.\"\\n\\n \"The original is missing?\" Anderson said, sounding surprised.\\n\\n \"Probably lost,\" the guard replied, arriving out of breath. \"Nobody has requested access down here for ages.\"\\n\\n Anderson took the key. \"No secondary key for SBB Thirteen?\"\\n\\n \"Sorry, so far we\u0027re not finding keys for any of the rooms in the SBB. MacDonald\u0027s on it now.\" The guard pulled out his radio and spoke into it. \"Bob? I\u0027m with the chief. Any additional info yet on the key for SBB Thirteen?\"\\n\\n The guard\u0027s radio crackled, and a voice replied, \"Actually, yeah. It\u0027s strange. I\u0027m seeing no entries since we computerized, but the hard logs indicate all the storage rooms in the SBB were cleaned out and abandoned more than twenty years ago. They\u0027re now listed as unused space.\" He paused. \"All except for SBB Thirteen.\"\\n\\n Anderson grabbed the radio. \"This is the chief. What do you mean, all except SBB Thirteen?\"\\n\\n \"Well, sir,\" the voice replied, \"I\u0027ve got a handwritten notation here that designates SBB Thirteen as `private.\u0027 It was a long time ago, but it\u0027s written and initialed by the Architect himself.\"\\n\\n The term Architect, Langdon knew, was not a reference to the man who had designed the Capitol, but rather to the man who ran it. Similar to a building manager, the man appointed as Architect of the Capitol was in charge of everything including maintenance, restoration, security, hiring personnel, and assigning offices.\\n\\n \"The strange thing . . .\" the voice on the radio said, \"is that the Architect\u0027s notation indicates that this `private space\u0027 was set aside for the use of Peter Solomon.\"\\n\\n Langdon, Sato, and Anderson all exchanged startled looks.\\n\\n \"I\u0027m guessing, sir,\" the voice continued, \"that Mr. Solomon has our primary key to the SBB as well as any keys to SBB Thirteen.\"\\n\\n Langdon could not believe his ears. Peter has a private room in the basement of the Capitol? He had always known Peter Solomon had secrets, but this was surprising even to Langdon.\\n\\n \"Okay,\" Anderson said, clearly unamused. \"We\u0027re hoping to get access to SBB Thirteen specifically, so keep looking for a secondary key.\"\\n\\n \"Will do, sir. We\u0027re also working on the digital image that you requested--\"\\n\\n \"Thank you,\" Anderson interrupted, pressing the talk button and cutting him off. \"That will be all. Send that file to Director Sato\u0027s BlackBerry as soon as you have it.\"\\n\\n \"Understood, sir.\" The radio went silent.\\n\\n Anderson handed the radio back to the guard in front of them. The guard pulled out a photocopy of a blueprint and handed it to his chief. \"Sir, the SBB is in gray, and we\u0027ve notated with an X which room is SBB Thirteen, so it shouldn\u0027t be hard to find. The area is quite small.\"\\n\\n Anderson thanked the guard and turned his focus to the blueprint as the young man hurried off. Langdon looked on, surprised to see the astonishing number of cubicles that made up the bizarre maze beneath the U.S. Capitol.\\n\\n Anderson studied the blueprint for a moment, nodded, and then stuffed it into his pocket. Turning to the door marked SBB, he raised the key, but hesitated, looking uneasy about opening it. Langdon felt similar misgivings; he had no idea what was behind this door, but he was quite certain that whatever Solomon had hidden down here, he wanted to keep private. Very private.\\n\\n Sato cleared her throat, and Anderson got the message. The chief took a deep breath, inserted the key, and tried to turn it. The key didn\u0027t move. For a split second, Langdon felt hopeful the key was wrong. On the second try, though, the lock turned, and Anderson heaved the door open.\\n\\n As the heavy door creaked outward, damp air rushed out into the corridor.\\n\\n Langdon peered into the darkness but could see nothing at all.\\n\\n \"Professor,\" Anderson said, glancing back at Langdon as he groped blindly for a light switch. \"To answer your question, the S in SBB doesn\u0027t stand for Senate. It stands for sub.\"\\n\\n \"Sub?\" Langdon asked, puzzled.\\n\\n Anderson nodded and flicked the switch just inside the door. A single bulb illuminated an alarmingly steep staircase descending into inky blackness. \"SBB is the Capitol\u0027s subbasement.\" \\n\\n","sourceLink":"https://allnovel.net/the-lost-symbol-robert-langdon-3/page-11.html","bookId":1515,"book":{"id":1515,"title":"The Lost Symbol (Robert Langdon #3)","description":"Storyline: In 1991, a document was locked in the safe of the director of the CIA. The document is still there today. Its cryptic text includes references to an ancient portal and an unknown location underground. The document also contains the phrase \u0027It\u0027s buried out there somewhere.\u0027 All organizations in this novel exist, including the Freemasons, the Invisible College, the Office of Security, the SMSC, and the Institute of Noetic Sciences.l. All rituals, science, artwork, and monuments in this novel are read \\n back: \\n READ BOOKS ONLINE FREE\\n","cover":"https://allnovel.net/images/the-lost-symbol-robert-langdon-3.jpg","author":"Dan Brown","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-lost-symbol-robert-langdon-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:36:29 AM"}}
