{"id":62412,"no":14,"title":"Page 14","content":"CHAPTER 40\\n\\n What\u0027s taking Trish so long?\\n\\n Katherine Solomon checked her watch again. She\u0027d forgotten to warn Dr. Abaddon about the bizarre commute to her lab, but she couldn\u0027t imagine the darkness had slowed them down this much. They should have arrived by now.\\n\\n Katherine walked over to the exit and heaved open the lead-lined door, staring out into the void. She listened for a moment, but heard nothing.\\n\\n \"Trish?\" she called out, her voice swallowed by the darkness.\\n\\n Silence.\\n\\n Puzzled, she closed the door, took out her cell phone, and called the lobby. \"This is Katherine. Is Trish out there?\"\\n\\n \"No, ma\u0027am,\" the lobby guard said. \"She and your guest headed back about ten minutes ago.\"\\n\\n \"Really? I don\u0027t think they\u0027re even inside Pod Five yet.\"\\n\\n \"Hold on. I\u0027ll check.\" Katherine could hear the guard\u0027s fingers clicking on his computer keyboard. \"You\u0027re right. According to Ms. Dunne\u0027s key-card logs, she has not yet opened the Pod Five door. Her last access event was about eight minutes ago . . . at Pod Three. I guess she\u0027s giving your guest a little tour on his way in.\"\\n\\n Katherine frowned. Apparently. The news was a bit odd, but at least she knew Trish wouldn\u0027t be long in Pod 3. The smell in there is terrible. \"Thanks. Has my brother arrived yet?\"\\n\\n \"No, ma\u0027am, not yet.\"\\n\\n \"Thank you.\"\\n\\n As Katherine hung up, she felt an unexpected twinge of trepidation. The uneasy feeling made her pause, but only for a moment. It was the same exact disquiet she\u0027d felt earlier when she stepped into Dr. Abaddon\u0027s house. Embarrassingly, her feminine intuition had failed her there. Badly.\\n\\n It\u0027s nothing, Katherine told herself.\\n\\n CHAPTER 41\\n\\n Robert Langdon studied the stone pyramid. This isn\u0027t possible.\\n\\n \"An ancient encoded language,\" Sato said without looking up. \"Tell me, does this qualify?\"\\n\\n On the newly exposed face of the pyramid, a series of sixteen characters was precisely engraved into the smooth stone. Beside Langdon, Anderson\u0027s mouth now gaped open, mirroring Langdon\u0027s own shock. The security chief looked like he had just seen some kind of alien keypad.\\n\\n \"Professor?\" Sato said. \"I assume you can read this?\"\\n\\n Langdon turned. \"Why would you assume that?\"\\n\\n \"Because you were brought here, Professor. You were chosen. This inscription appears to be a code of some sort, and considering your reputation, it seems obvious to me that you were brought here to decipher it.\"\\n\\n Langdon had to admit that after his experiences in Rome and Paris, he\u0027d received a steady flow of requests asking for his help deciphering some of history\u0027s great unsolved codes--the Phaistos Disk, the Dorabella Cipher, the mysterious Voynich Manuscript.\\n\\n Sato ran her finger over the inscription. \"Can you tell me the meaning of these icons?\"\\n\\n They\u0027re not icons, Langdon thought. They\u0027re symbols. The language was one he had recognized immediately--an encrypted cipher language from the seventeenth century. Langdon knew very well how to break it. \"Ma\u0027am,\" he said, feeling hesitant, \"this pyramid is Peter\u0027s private property.\"\\n\\n \"Private or not, if this code is indeed the reason you were brought to Washington, I am not giving you a choice in the matter. I want to know what it says.\"\\n\\n Sato\u0027s BlackBerry pinged loudly, and she yanked the device from her pocket, studying the incoming message for several moments. Langdon was amazed that the Capitol Building\u0027s internal wireless network provided service this far down. Sato grunted and raised her eyebrows, giving Langdon an odd look.\\n\\n \"Chief Anderson?\" she said, turning to him. \"A word in private, if I may?\" The director motioned for Anderson to join her, and they disappeared into the pitch-black hallway, leaving Langdon alone in the flickering candlelight of Peter\u0027s Chamber of Reflection.\\n\\n Chief Anderson wondered when this night would end. A severed hand in my Rotunda? A death shrine in my basement? Bizarre engravings on a stone pyramid? Somehow, the Redskins game no longer felt significant.\\n\\n As he followed Sato into the darkness of the hall, Anderson flicked on his flashlight. The beam was weak but better than nothing. Sato led him down the hall a few yards, out of sight of Langdon.\\n\\n \"Have a look at this,\" she whispered, handing Anderson her BlackBerry.\\n\\n Anderson took the device and squinted at the illuminated screen. It displayed a black-and-white image--the X-ray of Langdon\u0027s bag that Anderson had requested be sent to Sato. As in all X- rays, the objects of greatest density appeared in the brightest white. In Langdon\u0027s bag, a lone item outshone everything else. Obviously extremely dense, the object glowed like a dazzling jewel in a murky jumble of other items. Its shape was unmistakable.\\n\\n He\u0027s been carrying that all night? Anderson looked over at Sato in surprise. \"Why didn\u0027t Langdon mention this?\"\\n\\n \"Damned good question,\" Sato whispered.\\n\\n \"The shape . . . it can\u0027t be coincidence.\"\\n\\n \"No,\" Sato said, her tone angry now. \"I would say not.\"\\n\\n A faint rustle in the corridor drew Anderson\u0027s attention. Startled, he pointed his flashlight down the black passageway. The dying beam revealed only a deserted corridor, lined with open doors.\\n\\n \"Hello?\" Anderson said. \"Is somebody there?\"\\n\\n Silence.\\n\\n Sato gave him an odd look, apparently having heard nothing.\\n\\n Anderson listened a moment longer and then shook it off. I\u0027ve got to get out of here.\\n\\n Alone in the candlelit chamber, Langdon ran his fingers over the sharply carved edges of the pyramid\u0027s engraving. He was curious to know what the message said, and yet he was not about to intrude on Peter Solomon\u0027s privacy any more than they already had. And why would this lunatic care about this small pyramid anyway?\\n\\n \"We have a problem, Professor,\" Sato\u0027s voice declared loudly behind him. \"I\u0027ve just received a new piece of information, and I\u0027ve had enough of your lies.\"\\n\\n Langdon turned to see the OS director marching in, BlackBerry in hand and fire in her eyes. Taken aback, Langdon looked to Anderson for help, but the chief was now standing guard at the door, his expression unsympathetic. Sato arrived in front of Langdon and thrust her BlackBerry in his face.\\n\\n Bewildered, Langdon looked at the screen, which displayed an inverted black-and-white photograph, like a ghostly film negative. The photo looked like a jumble of objects, and one of them shone very brightly. Though askew and off center, the brightest object was clearly a little, pointed pyramid.\\n\\n A tiny pyramid? Langdon looked at Sato. \"What is this?\"\\n\\n The question seemed only to incense Sato further. \"You\u0027re pretending you don\u0027t know?\"\\n\\n Langdon\u0027s temper flared. \"I\u0027m not pretending anything! I\u0027ve never seen this before in my life!\"\\n\\n \"Bullshit!\" Sato snapped, her voice cutting through the musty air. \"You\u0027ve been carrying it in your bag all night!\"\\n\\n \"I--\" Langdon stalled midsentence. His eyes moved slowly down to the daybag on his shoulder. Then he raised them again to the BlackBerry. My God . . . the package. He looked more closely at the image. Now he saw it. A ghostly cube, enclosing the pyramid. Stunned, Langdon realized he was looking at an X-ray of his bag . . . and also of Peter\u0027s mysterious cube-shaped package. The cube was, in fact, a hollow box . . . a small pyramid.\\n\\n Langdon opened his mouth to speak, but his words failed him. He felt the breath go out of his lungs as a new revelation struck him.\\n\\n Simple. Pure. Devastating.\\n\\n My God. He looked back at the truncated stone pyramid on the desk. Its apex was flat--a small square area--a blank space symbolically awaiting its final piece . . . that piece which would transform it from an Unfinished Pyramid into a True Pyramid.\\n\\n Langdon now realized the tiny pyramid he was carrying was not a pyramid at all. It\u0027s a capstone. At that instant, he knew why he alone could unlock the mysteries of this pyramid.\\n\\n I hold the final piece.\\n\\n And it is indeed . . . a talisman. When Peter had told Langdon the package contained a talisman, Langdon had laughed. Now he realized his friend was right. This tiny capstone was a talisman, but not the magic kind . . . the far older kind. Long before talisman had magical connotations, it had another meaning-- \"completion.\" From the Greek telesma, meaning \"complete,\" a talisman was any object or idea that completed another and made it whole. The finishing element. A capstone, symbolically speaking, was the ultimate talisman, transforming the Unfinished Pyramid into a symbol of completed perfection.\\n\\n Langdon now felt an eerie convergence that forced him to accept one very strange truth: with the exception of its size, the stone pyramid in Peter\u0027s Chamber of Reflection seemed to be transforming itself, bit by bit, into something vaguely resembling the Masonic Pyramid of legend.\\n\\n From the brightness with which the capstone shone on the X-ray, Langdon suspected it was made of metal . . . a very dense metal. Whether or not it was solid gold, he had no way of knowing, and he was not about to let his mind start playing tricks on him. This pyramid is too small. The code\u0027s too easy to read. And . . . it\u0027s a myth, for heaven\u0027s sake!\\n\\n Sato was watching him. \"For a bright man, Professor, you\u0027ve made some dumb choices tonight. Lying to an intelligence director? Intentionally obstructing a CIA investigation?\"\\n\\n \"I can explain, if you\u0027ll let me.\"\\n\\n \"You will be explaining at CIA headquarters. As of this moment, I am detaining you.\"\\n\\n Langdon\u0027s body went rigid. \"You can\u0027t possibly be serious.\"\\n\\n \"Deadly serious. I made it very clear to you that the stakes tonight were high, and you chose not to cooperate. I strongly suggest you start thinking about explaining the inscription on this pyramid, because when we arrive at the CIA . . .\" She raised her BlackBerry and took a close-up snapshot of the engraving on the stone pyramid. \"My analysts will have had a head start.\"\\n\\n Langdon opened his mouth to protest, but Sato was already turning to Anderson at the door. \"Chief,\" she said, \"put the stone pyramid in Langdon\u0027s bag and carry it. I\u0027ll handle taking Mr. Langdon into custody. Your weapon, if I may?\"\\n\\n Anderson was stone-faced as he advanced into the chamber, unsnapping his shoulder holster as he came. He gave his gun to Sato, who immediately aimed it at Langdon.\\n\\n Langdon watched as if in a dream. This cannot be happening.\\n\\n Anderson now came to Langdon and removed the daybag from his shoulder, carrying it over to the desk and setting it on the chair. He unzipped the bag, propped it open, and then hoisted the heavy stone pyramid off the desk and into the bag, along with Langdon\u0027s notes and the tiny package. Suddenly there was a rustle of movement in the hallway. A dark outline of a man materialized in the doorway, rushing into the chamber and approaching fast behind Anderson. The chief never saw him coming. In an instant, the stranger had lowered his shoulder and crashed into Anderson\u0027s back. The chief launched forward, his head cracking into the edge of the stone niche. He fell hard, crumpling on the desk, sending bones and artifacts flying. The hourglass shattered on the floor. The candle toppled to the floor, still burning.\\n\\n Sato reeled amid the chaos, raising the gun, but the intruder grabbed a femur and lashed out with it, striking her shoulder with the leg bone. Sato let out a cry of pain and fell back, dropping the weapon. The newcomer kicked the gun away and then wheeled toward Langdon. The man was tall and slender, an elegant African American whom Langdon had never seen before in his life.\\n\\n \"Grab the pyramid!\" the man commanded. \"Follow me!\"\\n\\n CHAPTER 42\\n\\n The African American man leading Langdon through the Capitol\u0027s subterranean maze was clearly someone of power. Beyond knowing his way through all the side corridors and back rooms, the elegant stranger carried a key ring that seemed to unlock every door that blocked their way.\\n\\n Langdon followed, quickly running up an unfamiliar staircase. As they climbed, he felt the leather strap of his daybag cutting hard into his shoulder. The stone pyramid was so heavy that Langdon feared the bag\u0027s strap might break.\\n\\n The past few minutes defied all logic, and now Langdon found himself moving on instinct alone. His gut told him to trust this stranger. Beyond saving Langdon from Sato\u0027s arrest, the man had taken dangerous action to protect Peter Solomon\u0027s mysterious pyramid. Whatever the pyramid may be. While his motivation remained a mystery, Langdon had glimpsed a telltale shimmer of gold on the man\u0027s hand--a Masonic ring--the double-headed phoenix and the number 33. This man and Peter Solomon were more than trusted friends. They were Masonic brothers of the highest degree.\\n\\n Langdon followed him to the top of the stairs, into another corridor, and then through an unmarked door into a utilitarian hallway. They ran past supply boxes and bags of garbage, veering off suddenly through a service door that deposited them in an utterly unexpected world--a plush movie theater of some sort. The older man led the way up the side aisle and out the main doors into the light of a large atrium. Langdon now realized they were in the visitor center through which he had entered earlier tonight. Unfortunately, so was a Capitol police officer.\\n\\n As they came face-to-face with the officer, all three men stopped, staring at one another. Langdon recognized the young Hispanic officer from the X-ray machine earlier tonight.\\n\\n \"Officer Nunez,\" the African American man said. \"Not a word. Follow me.\"\\n\\n The guard looked uneasy but obeyed without question.\\n\\n Who is this guy?\\n\\n The three of them hurried toward the southeast corner of the visitor center, where they arrived at a small foyer and a set of heavy doors blocked with orange pylons. The doors were sealed with masking tape, apparently to keep the dust of whatever was happening beyond out of the visitor center. The man reached up and peeled off the tape on the door. Then he flipped through his key ring as he spoke to the guard. \"Our friend Chief Anderson is in the subbasement. He may be injured. You\u0027ll want to check on him.\"\\n\\n \"Yes, sir.\" Nunez looked as baffled as he did alarmed.\\n\\n \"Most important, you did not see us.\" The man found a key, took it off the key ring, and used it to turn the heavy dead bolt. He pulled open the steel door and tossed the key to the guard. \"Lock this door behind us. Put the tape back on as best as you can. Pocket the key and say nothing. To anyone. Including the chief. Is that clear, Officer Nunez?\"\\n\\n The guard eyed the key as if he\u0027d just been entrusted with a precious gem. \"It is, sir.\"\\n\\n The man hurried through the door, and Langdon followed. The guard locked the heavy bolt behind them, and Langdon could hear him re-applying the masking tape.\\n\\n \"Professor Langdon,\" the man said as they strode briskly down a modern-looking corridor that was obviously under construction. \"My name is Warren Bellamy. Peter Solomon is a dear friend of mine.\"\\n\\n Langdon shot a startled glance at the stately man. You\u0027re Warren Bellamy? Langdon had never met the Architect of the Capitol, but he certainly knew the man\u0027s name.\\n\\n \"Peter speaks very highly of you,\" Bellamy said, \"and I\u0027m sorry we are meeting under these dreadful circumstances.\"\\n\\n \"Peter is in terrible trouble. His hand . . .\"\\n\\n \"I know.\" Bellamy sounded grim. \"That\u0027s not the half of it, I\u0027m afraid.\"\\n\\n They reached the end of the lit section of corridor, and the passageway took an abrupt left. The remaining length of corridor, wherever it went, was pitch-black. \"Hold on,\" Bellamy said, disappearing into a nearby electrical room from which a tangle of heavy-duty orange extension cords snaked out, running away from them into the darkness of the corridor. Langdon waited while Bellamy rooted around inside. The Architect must have located the switch that sent power to the extension cords, because suddenly the route before them became illuminated.\\n\\n Langdon could only stare.\\n\\n Washington, D.C.--like Rome--was a city laced with secret passageways and underground tunnels. The passage before them now reminded Langdon of the passetto tunnel connecting the Vatican to Castel Sant\u0027Angelo. Long. Dark. Narrow. Unlike the ancient passetto, however, this passage was modern and not yet complete. It was a slender construction zone that was so long it seemed to narrow to nothing at its distant end. The only lighting was a string of intermittent construction bulbs that did little more than accentuate the tunnel\u0027s impossible length.\\n\\n Bellamy was already heading down the passage. \"Follow me. Watch your step.\"\\n\\n Langdon felt himself fall into step behind Bellamy, wondering where on earth this tunnel led.\\n\\n At that moment, Mal\u0027akh stepped out of Pod 3 and strode briskly down the deserted main corridor of the SMSC toward Pod 5. He clutched Trish\u0027s key card in his hand and quietly whispered, \"Zero-eight-zero-four.\"\\n\\n Something else was cycling through his mind as well. Mal\u0027akh had just received an urgent message from the Capitol Building. My contact has run into unforeseen difficulties. Even so, the news remained encouraging: Robert Langdon now possessed both the pyramid and the capstone. Despite the unexpected way in which it had happened, the crucial pieces were falling into place. It was almost as if destiny itself were guiding tonight\u0027s events, ensuring Mal\u0027akh\u0027s victory.\\n\\n CHAPTER 43\\n\\n Langdon hurried to keep pace with Warren Bellamy\u0027s brisk footsteps as they moved without a word down the long tunnel. So far, the Architect of the Capitol appeared far more intent on putting distance between Sato and this stone pyramid than he did on explaining to Langdon what was going on. Langdon had a growing apprehension that there was far more going on than he could imagine.\\n\\n The CIA? The Architect of the Capitol? Two Thirty-third-degree Masons? The shrill sound of Langdon\u0027s cell phone cut the air. He pulled his phone from his jacket. Uncertain, he answered. \"Hello?\" The voice that spoke was an eerie, familiar whisper. \"Professor, I hear you had unexpected company.\"\\n\\n Langdon felt an icy chill. \"Where the hell is Peter?!\" he demanded, his words reverberating in the enclosed tunnel. Beside him, Warren Bellamy glanced over, looking concerned and motioning for Langdon to keep walking.\\n\\n \"Don\u0027t worry,\" the voice said. \"As I told you, Peter is somewhere safe.\"\\n\\n \"You cut off his hand, for God\u0027s sake! He needs a doctor!\"\\n\\n \"He needs a priest,\" the man replied. \"But you can save him. If you do as I command, Peter will live. I give you my word.\"\\n\\n \"The word of a madman means nothing to me.\"\\n\\n \"Madman? Professor, surely you appreciate the reverence with which I have adhered to the ancient protocols tonight. The Hand of the Mysteries guided you to a portal--the pyramid that promises to unveil ancient wisdom. I know you now possess it.\"\\n\\n \"You think this is the Masonic Pyramid?\" Langdon demanded. \"It\u0027s a chunk of rock.\"\\n\\n There was silence on the other end of the line. \"Mr. Langdon, you\u0027re too smart to play dumb. You know very well what you\u0027ve uncovered tonight. A stone pyramid . . . hidden at the core of Washington, D.C. . . . by a powerful Mason?\"\\n\\n \"You\u0027re chasing a myth! Whatever Peter told you, he told you in fear.\\n\\n The Legend of the Masonic Pyramid is fiction. The Masons never built any pyramid to protect secret wisdom. And even if they did, this pyramid is far too small to be what you think it is.\"\\n\\n The man chuckled. \"I see Peter has told you very little. Nonetheless, Mr. Langdon, whether or not you choose to accept what it is you now possess, you will do as I say. I am well aware that the pyramid you are carrying has an encrypted engraving. You will decipher that engraving for me. Then, and only then, will I return Peter Solomon to you.\"\\n\\n \"Whatever you believe this engraving reveals,\" Langdon said, \"it won\u0027t be the Ancient Mysteries.\"\\n\\n \"Of course not,\" he replied. \"The mysteries are far too vast to be written on the side of a little stone pyramid.\"\\n\\n The response caught Langdon off guard. \"But if this engraving is not the Ancient Mysteries, then this pyramid is not the Masonic Pyramid. Legend clearly states the Masonic Pyramid was constructed to protect the Ancient Mysteries.\" The man\u0027s tone was condescending now. \"Mr. Langdon, the Masonic Pyramid was constructed to preserve the Ancient Mysteries, but with a twist you\u0027ve apparently not yet grasped. Did Peter never tell you? The power of the Masonic Pyramid is not that it reveals the mysteries themselves . . . but rather that it reveals the secret location where the mysteries are buried.\"\\n\\n Langdon did a double take.\\n\\n \"Decipher the engraving,\" the voice continued, \"and it will tell you the hiding place of mankind\u0027s greatest treasure.\" He laughed. \"Peter did not entrust you with the treasure itself, Professor.\"\\n\\n Langdon came to an abrupt halt in the tunnel. \"Hold on. You\u0027re saying this pyramid is . . . a map?\\n\\n \" Bellamy jolted to a stop now, too, his expression one of shock and alarm. Clearly, the caller had just hit a raw nerve. The pyramid is a map.\\n\\n \"This map,\" the voice whispered, \"or pyramid, or portal, or whatever you choose to call it . . . was created long ago to ensure the hiding place of the Ancient Mysteries would never be forgotten . . . that it would never be lost to history.\"\\n\\n \"A grid of sixteen symbols doesn\u0027t look much like a map.\"\\n\\n \"Appearances can be deceiving, Professor. But regardless, you alone have the power to read that inscription.\"\\n\\n \"You\u0027re wrong,\" Langdon fired back, picturing the simplistic cipher. \"Anyone could decipher this engraving. It\u0027s not very sophisticated.\"\\n\\n \"I suspect there is more to the pyramid than meets the eye. Regardless, you alone possess the capstone.\"\\n\\n Langdon pictured the little capstone in his bag. Order from chaos? He didn\u0027t know what to believe anymore, but the stone pyramid in his bag seemed to be getting heavier with every passing moment.\\n\\n Mal\u0027akh pressed the cell phone to his ear, enjoying the sound of Langdon\u0027s anxious breathing on the other end. \"Right now, I have business to attend to, Professor, and so do you. Call me as soon as you have deciphered the map. We will go together to the hiding place and make our trade. Peter\u0027s life . . . for all the wisdom of the ages.\"\\n\\n \"I will do nothing,\" Langdon declared. \"Especially not without proof Peter is alive.\"\\n\\n \"I suggest you not test me. You are a very small cog in a vast machine. If you disobey me, or attempt to find me, Peter will die. This I swear.\" \"For all I know, Peter is already dead.\"\\n\\n \"He is very much alive, Professor, but he desperately needs your help.\"\\n\\n \"What are you really looking for?\" Langdon shouted into the phone.\\n\\n Mal\u0027akh paused before answering. \"Many people have pursued the Ancient Mysteries and debated their power. Tonight, I will prove the mysteries are real.\"\\n\\n Langdon was silent.\\n\\n \"I suggest you get to work on the map immediately,\" Mal\u0027akh said. \"I need this information today.\"\\n\\n \"Today?! It\u0027s already after nine o\u0027clock!\"\\n\\n \"Exactly. Tempus fugit.\" \\n\\n","sourceLink":"https://allnovel.net/the-lost-symbol-robert-langdon-3/page-14.html","bookId":1515,"book":{"id":1515,"title":"The Lost Symbol (Robert Langdon #3)","description":"Storyline: In 1991, a document was locked in the safe of the director of the CIA. The document is still there today. Its cryptic text includes references to an ancient portal and an unknown location underground. The document also contains the phrase \u0027It\u0027s buried out there somewhere.\u0027 All organizations in this novel exist, including the Freemasons, the Invisible College, the Office of Security, the SMSC, and the Institute of Noetic Sciences.l. All rituals, science, artwork, and monuments in this novel are read \\n back: \\n READ BOOKS ONLINE FREE\\n","cover":"https://allnovel.net/images/the-lost-symbol-robert-langdon-3.jpg","author":"Dan Brown","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-lost-symbol-robert-langdon-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:36:29 AM"}}
