{"id":62419,"no":21,"title":"Page 21","content":"CHAPTER 71\\n\\n Mal\u0027akh stood naked in the billowing warmth of his steam shower. He felt pure again, having washed off the last remaining scent of ethanol. As the eucalyptus-infused vapors permeated his skin, he could feel his pores opening to the heat. Then he began his ritual.\\n\\n First, he rubbed depilatory chemicals across his tattooed body and scalp, removing any traces of body hair. Hairless were the gods of the seven islands of Heliades. Then he massaged Abramelin oil into his softened and receptive flesh. Abramelin is the sacred oil of the great Magi. Then he turned his shower lever hard to the left, and the water turned ice cold. He stood beneath the frigid water for a full minute to close his pores and trap the heat and energy within his core. The cold served as a reminder of the icy river in which this transformation had begun.\\n\\n When he stepped from the shower, he was shivering, but within seconds, his core heat emanated up through his layers of flesh and warmed him. Mal\u0027akh\u0027s insides felt like a furnace. He stood naked before the mirror and admired his form . . . perhaps the last time he would see himself as a mere mortal. His feet were the talons of a hawk. His legs--Boaz and Jachin--were the ancient pillars of wisdom. His hips and abdomen were the archways of mystical power. Hanging beneath the archway, his massive sex organ bore the tattooed symbols of his destiny. In another life, this heavy shaft of flesh had been his source of carnal pleasure. But no longer.\\n\\n I have been purified.\\n\\n Like the mystical eunuch monks of Katharoi, Mal\u0027akh had removed his testicles. He had sacrificed his physical potency for a more worthy one. Gods have no gender. Having shed the human imperfection of gender along with the earthly pull of sexual temptation, Mal\u0027akh had become like Ouranos, Attis, Sporus, and the great castrati magicians of Arthurian legend. Every spiritual metamorphosis is preceded by a physical one. Such was the lesson of all the great gods . . . from Osiris, to Tammuz, to Jesus, to Shiva, to the Buddha himself.\\n\\n I must shed the man who clothes me.\\n\\n Abruptly, Mal\u0027akh drew his gaze upward, past the double-headed phoenix on his chest, past the collage of ancient sigils adorning his face, and directly to the top of his head. He tipped his head toward the mirror, barely able to see the circle of bare flesh that waited there. This location on the body was sacred. Known as the fontanel, it was the one area of the human skull that remained open at birth. An oculus to the brain. Although this physiological portal closes within a matter of months, it remains a symbolic vestige of the lost connection between the outer and inner worlds.\\n\\n Mal\u0027akh studied the sacred patch of virginal skin, which was enclosed by the crownlike circle of an ouroboros--a mystical snake devouring its own tail. The bare flesh seemed to stare back at him . . . bright with promise.\\n\\n Robert Langdon soon would uncover the great treasure that Mal\u0027akh required. Once Mal\u0027akh possessed it, the void on top of his head would be filled, and he would at last be prepared for his final transformation.\\n\\n Mal\u0027akh padded across his bedroom and took from his bottom drawer a long strip of white silk. As he had done many times before, he wrapped it around his groin and buttocks. Then he went downstairs.\\n\\n In his office, his computer had received an e-mail message.\\n\\n It was from his contact:\\n\\n WHAT YOU REQUIRE IS NOW WITHIN REACH.\\n\\n I WILL CONTACT YOU WITHIN THE HOUR. PATIENCE.\\n\\n Mal\u0027akh smiled. It was time to make final preparations.\\n\\n CHAPTER 72\\n\\n The CIA field agent was in a foul mood as he descended from the reading-room balcony. Bellamy lied to us. The agent had seen no heat signatures whatsoever upstairs near the Moses statue, nor anywhere else upstairs for that matter.\\n\\n So where the hell did Langdon go?\\n\\n The agent retraced his steps now to the only place they\u0027d spotted any heat signatures at all--the library\u0027s distribution hub. He descended the stairs again, moving beneath the octagonal console. The noise of the rumbling conveyors was grating. Advancing into the space, he flipped down his thermal goggles and scanned the room. Nothing. He looked toward the stacks, where the mangled door still showed hot from the explosion. Other than that, he saw no--\\n\\n Holy shit!\\n\\n The agent jumped back as an unexpected luminescence drifted into his field of vision. Like a pair of ghosts, the dimly glowing imprints of two humanoids had just emerged from the wall on a conveyor belt. Heat signatures.\\n\\n Stunned, the agent watched as the two apparitions circled the room on the conveyor loop and then disappeared headfirst into a narrow hole in the wall. They rode the conveyor out? That\u0027s insanity.\\n\\n In addition to realizing they had just lost Robert Langdon through a hole in the wall, the field agent was now aware that he had another problem. Langdon\u0027s not alone?\\n\\n He was just about to switch on his transceiver and call the team leader, but the team leader beat him to it.\\n\\n \"All points, we\u0027ve got an abandoned Volvo on the plaza in front of the library. Registered to one Katherine Solomon. Eyewitness says she entered the library not long ago. We suspect she\u0027s with Robert Langdon. Director Sato has ordered that we find them both immediately.\"\\n\\n \"I\u0027ve got heat signatures for both of them!\" shouted the field agent in the distribution room. He explained the situation.\\n\\n \"For Christ\u0027s sake!\" the team leader replied. \"Where the hell does the conveyor go?\"\\n\\n The field agent was already consulting the employee reference schematic on the bulletin board. \"Adams Building,\" he replied. \"One block from here.\" \"All points. Redirect to the Adams Building! NOW!\"\\n\\n CHAPTER 73\\n\\n Sanctuary. Answers.\\n\\n The words echoed in Langdon\u0027s mind as he and Katherine burst through a side door of the Adams Building and out into the cold winter night. The mysterious caller had conveyed his location cryptically, but Langdon had understood. Katherine\u0027s reaction to their destination had been surprisingly sanguine: Where better to find One True God?\\n\\n Now the question was how to get there.\\n\\n Langdon spun in place, trying to get his bearings. It was dark, but thankfully the weather had cleared. They were standing in a small courtyard. In the distance, the Capitol Dome looked startlingly far away, and Langdon realized this was the first moment he had stepped outside since arriving at the Capitol several hours ago.\\n\\n So much for my lecture.\\n\\n \"Robert, look.\" Katherine pointed toward the silhouette of the Jefferson Building.\\n\\n Langdon\u0027s first reaction on seeing the building was astonishment that they had traveled so far underground on a conveyor belt. His second reaction, however, was alarm. The Jefferson Building was now abuzz with activity--trucks and cars pulling in, men shouting. Is that a searchlight?\\n\\n Langdon grabbed Katherine\u0027s hand. \"Come on.\"\\n\\n They ran northeast across the courtyard, quickly disappearing from view behind an elegant U- shaped building, which Langdon realized was the Folger Shakespeare Library. This particular building seemed appropriate camouflage for them tonight, as it housed the original Latin manuscript of Francis Bacon\u0027s New Atlantis, the utopian vision on which the American forefathers had allegedly modeled a new world based on ancient knowledge. Even so, Langdon would not be stopping.\\n\\n We need a cab.\\n\\n They arrived at the corner of Third Street and East Capitol. The traffic was sparse, and Langdon felt fading hope as he scanned for taxis. He and Katherine hurried northward on Third Street, putting distance between themselves and the Library of Congress. It was not until they had gone an entire block that Langdon finally spotted a cab rounding the corner. He flagged it down, and the cab pulled over.\\n\\n Middle Eastern music played on his radio, and the young Arab driver gave them a friendly smile. \"Where to?\" the driver asked as they jumped into the car.\\n\\n \"We need to go to--\"\\n\\n \"Northwest!\" Katherine interjected, pointing up Third Street away from the Jefferson Building. \"Drive toward Union Station, then left on Massachusetts Avenue. We\u0027ll tell you when to stop.\"\\n\\n The driver shrugged, closed the Plexiglas divider, and turned his music back on.\\n\\n Katherine shot Langdon an admonishing look as if to say: \"Leave no trail.\" She pointed out the window, directing Langdon\u0027s attention to a black helicopter that was skimming in low, approaching the area. Shit. Sato was apparently dead serious about recovering Solomon\u0027s pyramid.\\n\\n As they watched the helicopter land between the Jefferson and Adams buildings, Katherine turned to him, looking increasingly worried. \"Can I see your cell phone for a second?\"\\n\\n Langdon handed her his phone.\\n\\n \"Peter told me you have an eidetic memory?\" she said, rolling down her window. \"And that you remember every phone number you\u0027ve ever dialed?\"\\n\\n \"That\u0027s true, but--\"\\n\\n Katherine hurled his phone out into the night. Langdon spun in his seat and watched as his cell phone cartwheeled and splintered into pieces on the pavement behind them. \"Why did you do that!\"\\n\\n \"Off the grid,\" Katherine said, her eyes grave. \"This pyramid is our only hope of finding my brother, and I have no intention of letting the CIA steal it from us.\"\\n\\n In the front seat, Omar Amirana bobbed his head and hummed along with his music. Tonight had been slow, and he felt blessed to finally have a fare. His cab was just passing Stanton Park, when the familiar voice of his company dispatcher crackled over the radio.\\n\\n \"This is Dispatch. All vehicles in the area of the National Mall. We have just received a bulletin from government authorities regarding two fugitives in the area of the Adams Building . . .\"\\n\\n Omar listened in amazement as Dispatch described the precise couple in his cab. He stole an uneasy glance in his rearview mirror. Omar had to admit, the tall guy did look familiar somehow. Did I see him on America\u0027s Most Wanted?\\n\\n Gingerly, Omar reached for his radio handset. \"Dispatch?\" he said, speaking quietly into the transceiver. \"This is cab one-three-four. The two people you asked about--they are in my cab . . . right now.\"\\n\\n Dispatch immediately advised Omar what to do. Omar\u0027s hands were trembling as he called the phone number Dispatch had given him. The voice that answered was tight and efficient, like that of a soldier.\\n\\n \"This is Agent Turner Simkins, CIA field ops. Who is this?\"\\n\\n \"Um . . . I\u0027m the taxi driver?\" Omar said. \"I was told to call about the two--\"\\n\\n \"Are the fugitives currently in your vehicle? Answer only yes or no.\"\\n\\n \"Yes.\"\\n\\n \"Can they hear this conversation? Yes or no?\"\\n\\n \"No. The slider is--\"\\n\\n \"Where are you taking them?\"\\n\\n \"Northwest on Massachusetts.\"\\n\\n \"Specific destination?\"\\n\\n \"They didn\u0027t say.\"\\n\\n The agent hesitated. \"Is the male passenger carrying a leather bag?\"\\n\\n Omar glanced in the rearview mirror, and his eyes went wide. \"Yes! That bag doesn\u0027t have explosives or anything in--\"\\n\\n \"Listen carefully,\" the agent said. \"You are in no danger so long as you follow my directions exactly. Is that clear?\"\\n\\n \"Yes, sir.\"\\n\\n \"What is your name?\"\\n\\n \"Omar,\" he said, breaking a sweat.\\n\\n \"Listen, Omar,\" the man said calmly. \"You\u0027re doing great. I want you to drive as slowly as possible while I get my team out in front of you. Do you understand?\" \"Yes, sir.\"\\n\\n \"Also, is your cab equipped with an intercom system so you can communicate with them in the backseat?\"\\n\\n \"Yes, sir.\"\\n\\n \"Good. Here\u0027s what I want you to do.\"\\n\\n CHAPTER 74\\n\\n The Jungle, as it is known, is the centerpiece of the U.S. Botanic Garden (USBG)--America\u0027s living museum--located adjacent to the U.S. Capitol Building. Technically a rain forest, the Jungle is housed in a towering greenhouse, complete with soaring rubber trees, strangler figs, and a canopy catwalk for more daring tourists.\\n\\n Normally, Warren Bellamy felt nurtured by the Jungle\u0027s earthy smells and the sunlight glinting through the mist that filtered down from the vapor nozzles in the glass ceiling. Tonight, however, lit only by moonlight, the Jungle terrified him. He was sweating profusely, writhing against the cramps that now stabbed at his arms, still pinned painfully behind him.\\n\\n Director Sato paced before him, puffing calmly on her cigarette--the equivalent of ecoterrorism in this carefully calibrated environment. Her face looked almost demonic in the smoke-filled moonlight that streamed down through the glass ceiling overhead.\\n\\n \"So then,\" Sato continued, \"when you arrived at the Capitol tonight, and you discovered that I was already there . . . you made a decision. Rather than making your presence known to me, you descended quietly into the SBB, where, at great risk to yourself, you attacked Chief Anderson and myself, and you helped Langdon escape with the pyramid and capstone.\" She rubbed her shoulder. \"An interesting choice.\"\\n\\n A choice I would make again, Bellamy thought. \"Where is Peter?\" he demanded angrily.\\n\\n \"How would I know?\" Sato said.\\n\\n \"You seem to know everything else!\" Bellamy fired back at her, making no attempt to hide his suspicion that she was somehow behind all this. \"You knew to go to the Capitol Building. You knew to find Robert Langdon. And you even knew to X-ray Langdon\u0027s bag to find the capstone. Obviously, someone is giving you a lot of inside information.\" Sato laughed coldly and stepped closer to him. \"Mr. Bellamy, is that why you attacked me? Do you think I\u0027m the enemy? Do you think I\u0027m trying to steal your little pyramid?\" Sato took a drag on her cigarette and blew the smoke out of her nostrils. \"Listen carefully. No one understands better than I do the importance of keeping secrets. I believe, as you do, that there is certain information to which the masses should not be privy. Tonight, however, there are forces at work that I fear you have not yet grasped. The man who kidnapped Peter Solomon holds enormous power . . . a power that you apparently have yet to realize. Believe me, he is a walking time bomb . . . capable of initiating a series of events that will profoundly change the world as you know it.\"\\n\\n \"I don\u0027t understand.\" Bellamy shifted on the bench, his arms aching in his handcuffs.\\n\\n \"You don\u0027t need to understand. You need to obey. Right now, my only hope of averting a major disaster is to cooperate with this man . . . and to give him exactly what he wants. Which means, you are going to call Mr. Langdon and tell him to turn himself in, along with the pyramid and capstone. Once Langdon is in my custody, he will decrypt the pyramid\u0027s inscription, obtain whatever information this man is demanding, and provide him with exactly what he wants.\"\\n\\n The location of the spiral staircase that leads to the Ancient Mysteries? \"I can\u0027t do that. I\u0027ve taken vows of secrecy.\"\\n\\n Sato erupted. \"I don\u0027t give a damn what you\u0027ve vowed, I will throw you in prison so fast--\"\\n\\n \"Threaten me all you like,\" Bellamy said defiantly. \"I will not help you.\"\\n\\n Sato took a deep breath and spoke now in a fearsome whisper. \"Mr. Bellamy, you have no idea what\u0027s really going on tonight, do you?\"\\n\\n The tense silence hung for several seconds, finally broken by the sound of Sato\u0027s phone. She plunged her hand into her pocket and eagerly snatched it out. \"Talk to me,\" she answered, listening carefully to the reply. \"Where is their taxi now? How long? Okay, good. Bring them to the U.S. Botanic Garden. Service entrance. And make sure you get me that god-damn pyramid and capstone.\"\\n\\n Sato hung up and turned back to Bellamy with a smug smile. \"Well then . . . it seems you\u0027re fast outliving your usefulness.\"\\n\\n CHAPTER 75\\n\\n Robert Langdon stared blankly into space, feeling too tired to urge the slow-moving taxi driver to pick up the pace. Beside him, Katherine had fallen silent, too, looking frustrated by their lack of understanding of what made the pyramid so special. They had again been through everything they knew about the pyramid, the capstone, and the evening\u0027s strange events; they still had no ideas as to how this pyramid could possibly be considered a map to anything at all.\\n\\n Jeova Sanctus Unus? The secret hides within The Order?\\n\\n Their mysterious contact had promised them answers if they could meet him at a specific place. A refuge in Rome, north of the Tiber. Langdon knew the forefathers\u0027 \"new Rome\" had been renamed Washington early in her history, and yet vestiges of their original dream remained: the Tiber\u0027s waters still flowed into the Potomac; senators still convened beneath a replica of St. Peter\u0027s dome; and Vulcan and Minerva still watched over the Rotunda\u0027s long-extinguished flame.\\n\\n The answers sought by Langdon and Katherine were apparently waiting for them just a few miles ahead. Northwest on Massachusetts Avenue. Their destination was indeed a refuge . . . north of Washington\u0027s Tiber Creek. Langdon wished the driver would speed up.\\n\\n Abruptly, Katherine jolted upright in her seat, as if she had made a sudden realization. \"Oh my God, Robert!\" She turned to him, her face going white. She hesitated a moment and then spoke emphatically. \"We\u0027re going the wrong way!\"\\n\\n \"No, this is right,\" Langdon countered. \"It\u0027s northwest on Massachu--\"\\n\\n \"No! I mean we\u0027re going to the wrong place!\"\\n\\n Langdon was mystified. He had already told Katherine how he knew what location was being described by the mysterious caller. It contains ten stones from Mount Sinai, one from heaven itself, and one with the visage of Luke\u0027s dark father. Only one building on earth could make those claims. And that was exactly where this taxi was headed.\\n\\n \"Katherine, I\u0027m certain the location is correct.\"\\n\\n \"No!\" she shouted. \"We don\u0027t need to go there anymore. I figured out the pyramid and capstone! I know what this is all about!\"\\n\\n Langdon was amazed. \"You understand it?\"\\n\\n \"Yes! We have to go to Freedom Plaza instead!\"\\n\\n Now Langdon was lost. Freedom Plaza, although nearby, seemed totally irrelevant.\\n\\n \"Jeova Sanctus Unus!\" Katherine said. \"The One True God of the Hebrews. The sacred symbol of the Hebrews is the Jewish star--the Seal of Solomon--an important symbol to the Masons!\" She fished a dollar bill out of her pocket. \"Give me your pen.\" Bewildered, Langdon pulled a pen from his jacket.\\n\\n \"Look.\" She spread the bill out on her thigh and took his pen, pointing to the Great Seal on the back. \"If you superimpose Solomon\u0027s seal on the Great Seal of the United States . . .\" She drew the symbol of a Jewish star precisely over the pyramid. \"Look what you get!\"\\n\\n Langdon looked down at the bill and then back at Katherine as if she were mad.\\n\\n \"Robert, look more closely! Don\u0027t you see what I\u0027m pointing at?\"\\n\\n He glanced back at the drawing.\\n\\n What in the world is she getting at? Langdon had seen this image before. It was popular among conspiracy theorists as \"proof\" that the Masons held secret influence over our early nation. When the six-pointed star was laid perfectly over the Great Seal of the United States, the star\u0027s top vertex fit perfectly over the Masonic all-seeing eye . . . and, quite eerily, the other five vertices clearly pointed to the letters M-A-S-O-N.\\n\\n \"Katherine, that\u0027s just a coincidence, and I still don\u0027t see how it has anything to do with Freedom Plaza.\"\\n\\n \"Look again!\" she said, sounding almost angry now. \"You\u0027re not looking where I am pointing! Right there. Don\u0027t you see it?\"\\n\\n An instant later, Langdon saw it.\\n\\n CIA field-operations leader Turner Simkins stood outside the Adams Building and pressed his cell phone tightly to his ear, straining to hear the conversation now taking place in the back of the taxi. Something just happened. His team was about to board the modified Sikorsky UH-60 helicopter to head northwest and set up a roadblock, but now it seemed the situation had suddenly changed.\\n\\n Seconds ago, Katherine Solomon had begun insisting they were going to the wrong destination. Her explanation--something about the dollar bill and Jewish stars--made no sense to the team leader, nor, apparently, to Robert Langdon. At least at first. Now, however, Langdon seemed to have grasped her meaning.\\n\\n \"My God, you\u0027re right!\" Langdon blurted. \"I didn\u0027t see it earlier!\"\\n\\n Suddenly Simkins could hear someone banging on the driver\u0027s divider, and then it slid open. \"Change of plans,\" Katherine shouted to the driver. \"Take us to Freedom Plaza!\"\\n\\n \"Freedom Plaza?\" the cabbie said, sounding nervous. \"Not northwest on Massachusetts?\"\\n\\n \"Forget that!\" Katherine shouted. \"Freedom Plaza! Go left here! Here! HERE!\"\\n\\n Agent Simkins heard the cab screeching around a corner. Katherine was talking excitedly again to Langdon, saying something about the famous bronze cast of the Great Seal embedded in the plaza.\\n\\n \"Ma\u0027am, just to confirm,\" the cabbie\u0027s voice interjected, sounding tense. \"We\u0027re going to Freedom Plaza--on the corner of Pennsylvania and Thirteenth?\"\\n\\n \"Yes!\" Katherine said. \"Hurry!\"\\n\\n \"It\u0027s very close. Two minutes.\"\\n\\n Simkins smiled. Nicely done, Omar. As he dashed toward the idling helicopter, he shouted to his team. \"We\u0027ve got them! Freedom Plaza! Move!\" \\n\\n","sourceLink":"https://allnovel.net/the-lost-symbol-robert-langdon-3/page-21.html","bookId":1515,"book":{"id":1515,"title":"The Lost Symbol (Robert Langdon #3)","description":"Storyline: In 1991, a document was locked in the safe of the director of the CIA. The document is still there today. Its cryptic text includes references to an ancient portal and an unknown location underground. The document also contains the phrase \u0027It\u0027s buried out there somewhere.\u0027 All organizations in this novel exist, including the Freemasons, the Invisible College, the Office of Security, the SMSC, and the Institute of Noetic Sciences.l. All rituals, science, artwork, and monuments in this novel are read \\n back: \\n READ BOOKS ONLINE FREE\\n","cover":"https://allnovel.net/images/the-lost-symbol-robert-langdon-3.jpg","author":"Dan Brown","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-lost-symbol-robert-langdon-3.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:36:29 AM"}}
