{"id":15422,"no":21,"title":"CHAPTER XX: AN OLD SCORE","content":"Hector was not present with the army during the last three campaigns of the war. He had joined Turenne in April, 1646, and shared in the general disappointment when the order was received that the army was not to cross the Rhine, because Bavaria had promised to remain neutral if it did not do so. “I cannot think,” the marshal said to him a day or two after he received the order—for he had always maintained the same pleasant relations with Hector that had subsisted between them in Italy, and placed the most entire confidence in the discretion of the young colonel—“how Mazarin can allow Bavaria to hoodwink him. Indeed, I cannot believe that he is really deceived; he must know that that crafty old fox the duke is not to be relied upon in any way, and that he is merely trying to save time. \u0027Tis hard indeed to see us powerless to move, now that the season for campaigning is just opening, and when by advancing we could cut the Bavarians off from Austria. As to besieging Luxembourg, it would be but a waste of time, for before we could open a trench we should hear that the duke has again declared against us, and we should have to hurry back with all speed.” It was, indeed, but a fortnight later that the news came that the Bavarians were on the move to join the Imperialists, and a fortnight later it was known that the two armies had effected their junction. Turenne at once collected his troops from the towns and villages where they were placed, and marched to Mayence. “I am going to send you to Paris, Campbell,” he said on the evening of their arrival there. “All is lost if the enemy, now united, throw themselves upon the Swedes, and I have resolved to take upon myself the responsibility of marching round through Holland and joining Wrangel. There is, of course, risk in such an expedition, and the cardinal may object very strongly to my undertaking such a movement, especially as it will leave the frontier of France virtually unguarded, but I have no fear that evil consequences will arise. The enemy will not hear of my march until ten days after I have started, and even then they will probably suppose that we have gone to Flanders. By the time they find out what my intentions are, it will be too late for them to take advantage of my absence. “Even then they would have to storm Philippsburg or some other strong place before they could cross the Rhine, and before they could do that Wrangel and I would be at their heels. Moreover, as they would know that, instead of pursuing them, we might, after effecting a junction, make straight for Vienna, and that no army could be got together to oppose us, I consider that the movement is a perfectly safe one. Now, I am going to send you to Mazarin with my despatch telling him of my intention. I am choosing you for the purpose, because you will be able to explain and enforce the reasons that I have given him. He has a high opinion of you, and will listen to you when perhaps he would not pay any regard to Rosen or any other of these Weimar officers I might send. Remember that there is no occasion for extreme hurry,” and he smiled. “Of course it is necessary that you should travel with a certain amount of speed, but do not founder your horse. Every day is of value to me, and if I am once well on my way north Mazarin could hardly recall me. “Say that you take five days to get to Paris, by that time I should be north of Cologne, and a courier from Mazarin can hardly overtake me until I am in Holland, I should then feel justified in disregarding the order, seeing that I should by pushing on effect a junction with the Swedes quite as quickly as I could return here. Of course it would be too late for you to overtake me, and I shall give you a written order to remain in Paris until I am again so near the Rhine that you can join your regiment. I consider that it will be an advantage to have you near the cardinal, as, knowing my intentions and methods as you do, you would be able to so explain matters to him that he will understand the reasons for my various movements.” “Very well marshal, I am ready to start as soon as you hand me the despatch.” “I will do that tomorrow morning, and you will then be able to tell Mazarin that we were just setting out when you left us.” “As it will be some time before I shall rejoin my regiment, may I ask you to appoint Captain de Thiou as second colonel? He has now served as senior captain of the regiment for three years. He aided me heartily and cordially in organizing it. He has seconded me throughout in a manner of which I cannot speak too highly, and distinguished himself greatly at Freiburg, and on every occasion in which we have been in contact with the enemy. I think it very desirable that there should be an officer of rank superior to the others while I am away; and both for the sake of the regiment, and as a reward for the merit and conduct of Captain de Thiou himself, I should be very glad were he promoted and should feel that the regiment would in no way deteriorate during my absence.” “Certainly, Campbell, I will carry out your recommendation. He has fairly earned his promotion, and as you say, it is better in your absence that the regiment should be led by an officer of rank above the others, and not by a captain having but a very slight seniority to some of them. Doubtless you will be saying goodbye to the officers tonight. I authorize you to inform de Thiou that he will be placed in orders tomorrow morning as second colonel of the regiment.” “I did not think that we were likely to be back in Paris before next winter, master,” Paolo said rather discontentedly when Hector told him that they were to start early next morning. “Nor did I, Paolo, and I should very much rather have remained with the regiment; but as the marshal is good enough to consider that my presence there may be of advantage to him, I have of course nothing to say against it.” There was great regret among the officers when they heard that their colonel was not going to lead them, but all were pleased that de Thiou, who was a general favourite, had obtained promotion. That officer was at once surprised and gratified at the news, for it was not often that men without strong family interest rose to the rank of colonel. “I know that this is your doing,” he said gratefully. “I never expected to get above my present rank, and I am sure that I should never have done so had it not been for you.” “You thoroughly deserve it, de Thiou, for it was by your support that I was enabled, when I first joined, to introduce reforms, and get the officers to take upon themselves more work and responsibilities, and thus make the regiment what it is. I hope I shall rejoin before the end of the campaign. This may be the last, for now that they have begun the peace conference at Munster, something must surely come of it sooner or later, for all parties must be thoroughly sick of this long and terrible war, which has ruined Germany and impoverished France, and from which neither party, after nigh thirty years of fighting, has gained any material advantage. At any rate it will be a great satisfaction to me to know that the regiment is in your hands. I know that during the time that I have been away this winter things have gone on satisfactorily; but it is clearly impossible for an officer to keep a regiment well in hand when, as in your case, your appointment was only a day or two earlier than that of some of the others. You are likely to have some stiff marching now, for only one other infantry regiment besides ours will accompany the cavalry, the rest will remain here until they get an opportunity of rejoining. Of course I shall take Paolo and my four mounted troopers back with me to Paris. I may probably send them on to la Villar, as it is not likely that I shall need them at court.” On the evening of the fifth day after leaving Mayence Hector arrived in Paris, and alighted at the cardinal\u0027s hotel. “So you are again a bearer of despatches, Monsieur Campbell,” the cardinal said, as Hector entered his apartment. “They need be important, or the marshal would hardly have sent you with them.” “They are, as you will see, important, your eminence, but I am sent rather to explain further than the marshal could do in a letter his reasons for the step that he has taken. As you have learned long before this, the Duke of Bavaria has proved false to his promises. He has effected a junction with the Imperialist army, and the marshal has news that both are marching against the Swedes, who are in no strength to show fight against so great a force.” The cardinal opened the despatch, and read it in silence. “\u0027Tis a grave step for the marshal to have taken without orders,” he said, frowning; “and do you mean to say that he has already started on this expedition?” “The troops had fallen into their ranks when I started, and by this time they must be well on their way towards Holland. There was no time, sir, for the marshal to await a reply to the despatch. The matter was most urgent, every day was of importance, for if the Swedes fell back, as they might do, before the archduke, the latter would be able to overrun all northern Germany, to capture the towns of the Protestant princes, break up their confederation, and compel them to give in their submission; for Turenne with his small force would be powerless to interfere with their operations, even if by pressing after them with all speed he arrived within striking distance.” “And think you that he will reach Wrangel in time?” “He hopes so, sir. He sent off a messenger before starting, with orders to buy fresh horses at all cost at each halting place, to carry the news as quickly as possible to Wrangel that he was on his way to join him, and imploring him to intrench himself in some strong position until he should come up. “How long hence will that be?” “The march will be pressed forward with all speed, your eminence, with such delays only as may be needed to keep the horses in such a state that they may be ready for fighting as soon as they join the Swedes. He hopes to be there in a month from the day of starting.” “And in the meantime,” Mazarin said, “France is open to invasion. He says, indeed, that the Imperialists would hardly venture to march hitherward, as thereby they in turn would leave it open to him and the Swedes to march into the heart of Austria.” “Assuredly that is so, sir. The archduke will hardly get news that Marshal Turenne has moved until he has been some ten or twelve days on his march, and even when he hears it he will not know in what direction he has gone, but may think it likely that he either intends to seize Luxembourg or to reinforce your army in Flanders. By the time they discover his true object he will be within a week\u0027s march of the Swedes, possibly less than that. It will be too late for them then to think of marching to the Rhine. If they consider themselves strong enough to fight the marshal and the Swedes together, they will do so at once; if they fear to give battle, still more would they fear to be attacked by him when entering a country where they would have him in their rear, and be hemmed in between him and the Rhine, not to speak of the risk of leaving Austria open to invasion, should he, instead of pursuing them, direct his march thither. If I might presume to judge, I should say that the expedition that the marshal has undertaken is at once worthy of his military genius, and will at the same time do far more to ensure the safety of the Rhine provinces than he could do were he to remain there with his small army until the Imperialists, having chased the Swedes out of the country and reduced northern Germany, turned their whole forces against him.” “I see, Monsieur Campbell,” the cardinal said, turning the subject, “that you have been five days coming here from Mayence. It is a very different rate of speed to that at which you traveled from Rocroi.” “It is so, your eminence; but on that occasion the Duc d\u0027Enghien had placed relays of his best horses all along the road, so that we were enabled to travel without making a halt.” “And moreover, my dear colonel,” Mazarin said, “Turenne, far from urging you to haste, was desirous of getting so far before he received my answer as to render it impossible for me to recall him.” “I cannot think that your eminence would do that. It is a grand enterprise, and almost without precedent in point both of daring and in the great advantages to be gained from it.” “And Turenne thought that by sending you, you would be able to assist him in persuading me to regard it favourably. Well, well, it is certainly too late to recall him now. He has taken the responsibility upon himself, and must stand or fall by the result. And now in the first place are you going to hurry back again or are you going to remain here?” “My regiment is one of those that he has taken with him, sir, and as I could not hope to overtake him he has requested me to remain here until I receive orders from him.” “We shall be gainers so far,” the cardinal said cordially, “and I am sure that from your knowledge of the country and of Turenne\u0027s methods your advice upon military matters will be of great service to us. I must now go and report to the queen this sudden change in the situation, and if she disapproves of it I shall tell her that if she will but listen to you, you will convert her to the view that this escapade of the marshal\u0027s is all for the best, and seems likely indeed to retrieve the position that has been caused by the treachery of Bavaria.” During his stay in Paris Hector soon found that intrigue was more rampant than ever. The Duke of Beaufort and others who had been implicated in the plot on Mazarin\u0027s life had been pardoned and had returned to Paris, and as the lesson that had been given them had taught them prudence, they were now openly on good terms with the court. They were secretly, however, intriguing with the parliament of Paris, which was now bitterly opposed to Mazarin, had refused to register some of his decrees, and had even forced him to dismiss his superintendent of finance, an Italian named Emeri. The latter had imposed taxes at his will to satisfy his extravagance and avarice, had raised the octroi duty, made the sale of firewood a monopoly, and in various ways had incurred the indignation and hatred of the Parisians. Mazarin\u0027s own greed had been in no slight degree the cause of his unpopularity; he who had come to France a penniless priest was now the owner of great estates. It was even said that much of the money that should have been devoted to the needs of the army had been privately sent into Italy by him, and throughout the country it was felt to be scandalous that while the deepest distress was universal on account of the weight of taxation, these two Italians should be piling up wealth for themselves. But, avaricious as he was, the cardinal was lavish in his expenditure among his friends and adherents; honours, titles, dignities, and estates were freely bestowed upon them, and he did not hesitate to pay any sum that would gain him the support of those whose aid he deemed to be essential. Madame de Chevreuse was again at court, and was, as she had always been, the centre of the intrigues that were going on. One evening she made a sign for Hector to take a place by her side. She had taken a fancy to the young Scottish colonel on the evening when he had been first introduced to her, and was always gracious to him now. “Monsieur le baron,” she said in a low tone, “do you think that the air of Paris agrees with you as well as that of the army?” He felt from the manner in which she spoke, that she meant more than she said. “So far, madam, it has not disagreed with me,” he said; “and even did it do so I should not be able to leave it, as I have orders to remain here.” “By the way, monsieur,” she said, changing the subject of conversation, “it is whispered that that party of pleasure to which you took the officers of your regiment at St. Germain did not come off, at least none of the landlords of the hotels there can recall any such gathering, and it is even said that your falling in with the carriage of the Duke of Orleans was not altogether an accident. I only mention the reports; of course, it was a matter of no moment whether your party dined at St. Germain or at Sevres. But sometimes misapprehensions of this kind lead to trouble, especially when they happen a few days before serious events. I like you, Colonel Campbell, and that is why I have mentioned this; you understand me, I have no doubt;” and, turning to a gentleman who had at that moment approached her, she entered into a lively conversation with him, and Hector rose, and with the words, “Thank you, madam,” bowed, and moved away. It was easy to understand her meaning. Beaufort and the conspirators whose plan he had thwarted, and who had suffered imprisonment and exile thereby, had in some way discovered that it was to him that they owed their failure and disgrace. At the moment his explanation and that of his officers had deceived them, but doubtless someone whose connection with the plot was unsuspected had instituted inquiries, found that the party he had spoken of had not taken place, and had at once come to the conclusion that he had in some way discovered their intentions, had really ridden out with his officers to furnish a guard to Mazarin, and had afterwards acquainted him with what he had discovered. Doubtless, as Madame de Chevreuse had warned him, the air of Paris was at present dangerously unwholesome for him. He had been the means of bringing disgrace and punishment upon the Duc de Vendome and the Duke of Beaufort, two of the most powerful nobles in France, and a host of their friends. It was probable that they only recently assured themselves that it was he who had thwarted their plans; had it been otherwise he would scarcely have escaped their vengeance the last time that he was in Paris. Now, from what Madame de Chevreuse had said, he had no doubt whatever that some plot would be made against his life. He might thwart one such attempt, but others would follow. He resolved to lay the matter before the cardinal and take his advice. Accordingly he waited until he was leaving; several gentlemen of his suite accompanied him, and at the entrance to the Louvre the men of the cardinal\u0027s guard fell in on either side. When they reached Mazarin\u0027s hotel Hector moved up to him. “Can I have a few words with you, your eminence?” “Certainly, Colonel Campbell; I never retire to bed till long past midnight. It is something serious, I see,” he said quickly as they entered his apartment, where a number of candles were burning, and he obtained a full view of Hector\u0027s face. “Another plot?” “Not against your eminence; it is a matter which concerns myself only. I have been warned tonight that my share in the last affair has been discovered, that inquiries have been made at St. Germain, and that the various innkeepers have declared that no party of officers dined there that morning, and that it was therefore concluded that our presence behind your carriage was not accidental. They no doubt guessed that it was I who discovered the plot, in consequence of which so many were arrested and exiled. I have been distinctly warned that the air of Paris is unwholesome for me.” “Who warned you?” the cardinal said abruptly. “It would not be fair of me to mention the name, but it is at any rate one who is of Beaufort\u0027s party.” “Ah!” the cardinal said sharply, “I noticed you sitting for a few minutes by Madame de Chevreuse. Never mind, I will respect your confidence. I can well understand, after what you have said, that there is great danger here, and it is a danger from which it is well nigh impossible to protect you, unless you take up your residence here and never stir abroad. Nor do I know that you would be safer with the army; an assassin\u0027s knife can reach a man as easily in a camp as in a city, and with perhaps less risk of detection. Neither Beaufort nor Vendome are men to forget or forgive an injury, and they have scores of fellows who would for a few crowns murder anyone they indicated, and of gentlemen of higher rank who, although not assassins, would willingly engage you in a duel, especially those who suffered in the plot that you discovered. Frankly, what do you think yourself?” “I might retire to la Villar, cardinal. I should be safe there in my own castle.” “So long as you did not leave it; but a man with a musket in ambush behind a hedge might cut your career short. It is probable enough that you are watched, and in that case I should doubt whether you would ever get to la Villar, nor do I think that if you left for the Rhine you would get halfway. Now you see, Monsieur Campbell, that your cause is mine, and that your safety touches me as if it were my own, for it was in my service that you incurred the danger. I must think the matter over. In the meantime I beg of you to sleep here tonight. I will send word to your servant that you will not return. I could of course send a guard with you to your hotel, but some of the servants there may have been bribed to murder you as you slept. I can look after myself; I seldom leave the house except to go to the Louvre, and I never go even that short distance without a guard, but it is much more difficult to protect you.” “I have my own bodyguard, your excellency—four stout Scotch soldiers and my lackey, Paolo, who is a good swordsman also; and as it does not seem to me that I should be safer elsewhere than here, I shall at any rate stay for a time. I should imagine that the warning was a general one. They have just found out that I had a hand in thwarting their plot against you, and I dare say used threats; but the threats of angry men come very often to nothing; and at any rate, I do not choose that they should obtain the satisfaction of driving me from Paris against my will.” The cardinal shook his head. “You see, monsieur, that Beaufort is a man who hesitates at nothing. A scrupulous person would hardly endeavour to slay a cardinal, who is also the minister of France, in the streets of Paris in broad daylight. He is capable of burning down the Pome d\u0027Or, and all within it, in order to obtain revenge on you. I feel very uneasy about you. However, sleep may bring counsel, and we will talk it over again in the morning.” “Have you thought of anything, Monsieur Campbell?” Mazarin asked when they met in the morning. “I have not, sir, save to go on trusting to my own sword and my followers.” “I can think of nothing,” the cardinal said, “save to send an order to Turenne for two companies of your regiment to march hither, where, on their arrival, you will receive orders to proceed with them to your castle of la Villar, and to use them in the king\u0027s service in repressing all troubles that may occur in Poitou. What say you to that?” “I would not deprive her majesty of two hundred of her best soldiers to guard me from what may not be after all a very real danger. My own conclusions, after thinking it over this morning, are that I will remain here for a time, trusting to my friends and my own sword. If a serious attempt is made on my life I could then consider whether it would be best to withdraw myself, and if so, whither to go; but I will not run away merely on a vague hint that my life is in danger. I have faced death in battle many times, and this danger can hardly be considered as more serious. I imagine that in the first case some of the duke\u0027s followers will force me into a duel, before proceeding to try assassination, and although doubtless he has some good blades among his friends, I do not think that I need to feel uneasy on that score. I was always practising with my sword as a boy. Since I have been in the army I have spent a good deal of my time, when in winter quarters, in such practice with my own officers, and with any maitres d\u0027armes in the towns where I have been, and while in Italy had the opportunity of learning much, for there are fine fencers there.” “So be it, then,” Mazarin said. “But if matters go to extremes, remember that I consider myself responsible for you. I believe that you saved my life, and although there are many things that men say against me, none have ever charged me with ingratitude. If I can protect you in no other way I shall have you arrested, sent to the frontier, that is to say, to the sea frontier, and put on board ship and sent to England or Scotland, as you choose, with a chest containing a sum that will suffice to purchase any estate you may choose there. “I am in earnest,” he went on as Hector was about to answer. “It is for my own sake as much as yours; when my friends are attacked I am attacked, and I am doubly bound in your case. It needs but a stroke of my pen to make you a duke and lord of half a province; and if I cannot do that here, because you would still be within reach of your enemies, I can, as far as the estates go, do it for you abroad. Do not fail to let me know each day if anything new takes place.” Hector felt that there was no more to say, and bowing, left the cardinal\u0027s presence and went out. Paolo and Macpherson were waiting outside. “The cardinal\u0027s messenger, who brought the news last night that you would not return, master,” the former said when he saw by Hector\u0027s look of surprise that he had not expected to see him there, “said also that I and one of your men had best be here at eight this morning and wait until you came out.” “I did not know that he had sent such a message, Paolo, but I will when we get to the hotel tell you why he sent it.” The street was somewhat crowded, and Hector had gone but a short distance when he saw three gentlemen, who he knew to be intimates of the Duke of Beaufort, coming in the other direction. One of them was Monsieur de Beauvais, who said in a loud tone to his companions just as Hector was passing: “That is the Scotchman whom the cardinal employs to do his dirty business.” Hector faced round at once. “At any rate, Monsieur de Beauvais, the Scotchman in question is not employed by the cardinal as an assassin, which is an even more dishonourable post.” De Beauvais turned white with anger. “Behind the Luxembourg in an hour\u0027s time, Monsieur de Villar.” “I shall be there,” Hector said coldly. He paused a minute, after the three gentlemen, with the customary salute, walked on. He did not like to go to the Hotel Mazarin lest the cardinal should obtain news of what was going to take place, so he waited in the neighbourhood, knowing that some of Mazarin\u0027s personal friends would be sure to arrive about this hour. Presently he saw a colonel who, like himself, was spending the winter in Paris, and who frequently attended the cardinal\u0027s levees. “Colonel de Serres, as a fellow soldier I have a service to ask of you.” “I am entirely at your disposal, Monsieur Campbell.” “I have just had a quarrel forced upon me by Monsieur de Beauvais, and I have to meet him in fifty minutes\u0027 time at the back of the Luxembourg. As he was in company with two gentlemen, the Comte de Marplat and Monsieur de Vipont, I shall be glad if you would kindly act as my second, and if you can find another officer who would do so, I shall be glad of his services also.” “I shall be glad to support you, Monsieur Campbell, and can lay my hand on another second at once, for here comes my friend and yours, Monsieur Emile de Chavigny, who will, like myself, be charmed to be concerned in any affair against the duke\u0027s friends.” De Chavigny, whom Hector had seen at the court on the previous day for the first time since they had parted in Italy, agreed at once to Hector\u0027s request. “De Beauvais has the reputation of being a good swordsman, Campbell,” he said as they walked together towards the Luxembourg, Paolo and his companion having now returned to the inn at his master\u0027s order; “but I should say that he will want all his skill now. You were by far the best swordsman among us when you left us suddenly in the south, and doubtless since then your skill will not have fallen off.” “No, I know a good deal more than I knew then, Chavigny. There were few days when we were in winter quarters that I had not an hour\u0027s work in the fencing school with the officers of my regiment, and whenever I heard that there was a professor of the art I have never failed to frequent his salon and to learn his favourite strokes.” “That is all right, then. We need have no fear whatever as to the result.” They reached the point fixed upon a minute or two before the clock struck, and just as it chimed de Beauvais and his friends made their appearance. The seconds exchanged a few words and selected a piece of ground for the encounter, the principals at once removed their doublets and faced each other. “This is a duel a la mort,” de Beauvais said in a loud voice. “For that I am quite prepared,” Hector said quietly; “but you are likely to find, Monsieur de Beauvais, that it is not so easy a thing to kill the colonel of one of her majesty\u0027s regiments as it is to stab a churchman in his carriage.” De Beauvais at once took up his position, and, without the parade of courtesy that usually preceded an encounter, fell furiously upon Hector. The latter did not give way a step. With a wrist of iron he put aside half a dozen thrusts, and then lunging, ran de Beauvais through the body, his sword hilt striking against his adversary\u0027s chest. De Beauvais\u0027 two seconds ran forward as their principal fell. “He is dead,” one said as they knelt over him. Then rising he addressed Hector: “Monsieur le Colonel Campbell,” he said, “I claim satisfaction at your hands, for I take it that your words applied to me as well as to de Beauvais, though addressed only to him.” “You may take it so,” Hector replied coldly, “for you were also at that house in the Rue St. Honore on that occasion you know of.” Hector\u0027s two seconds endeavoured to interpose, but he said: “Gentlemen, I must ask you to let the matter go on. This is no ordinary duel. These gentlemen, with whom I have no personal animosity, have picked a quarrel with me at the request of one higher in rank than themselves, and are simply his agents. I had no hesitation in killing the first of them, but as Monsieur de Vipont wishes an encounter with me in spite of what he has seen I will give him one, but will content myself with a less severe lesson than that I have given Monsieur de Beauvais. Now, sir, I am at your service.” De Vipont, knowing now how dangerous an opponent he was meeting, fought cautiously. Hector, however, was anxious to finish the matter before they were interrupted, and therefore took the offensive, and after two passes ran his antagonist through the shoulder. “Now, Monsieur le Comte, do you desire a turn?” he said carelessly. The count was pale, but he answered steadily, “I claim it by the same right as Monsieur de Vipont.” “Agreed,” Hector said; and as soon as the count had removed his upper garments they engaged. The swords had scarcely clashed when the count\u0027s weapon was wrenched from his hand and sent flying for a distance of twenty paces. “That is enough,” Colonel de Serres said, stepping forward; “you have done what you thought to be your duty, Monsieur le Comte, but it needs very different blades from those of yourself and your companions to stand before Colonel Campbell. He had you at his mercy, and had a right to take your life if he chose; but as he refrained from doing that when you had your sword in your hand, he certainly will not do so now. Messieurs, we wish you good morning.” “And you may mention,” Hector added, “to this person of high rank, that I shall be happy to accommodate as many of the gentlemen of his following as choose to take the matter up.” “He will send no more to you, Campbell,” Chavigny said as they moved off, leaving the count, whose valet now ran up, to obtain a vehicle and carry his dead and wounded comrades away. “No, I fancy not; he will try other means now. The war has only begun. Men like Lei, Brillet, and the Campions are not the sort of men who would act as bravos, even for the Duke of Beaufort, and I do not think that he would even venture to propose it to them. It will be meaner instruments that he will employ next time. However, I shall of course go straight to the cardinal and acquaint him with what has happened. I doubt not but that he will lay the matter before the queen, and then that Beaufort will hear of it; but, passionate and revengeful as he is, I think that he will not be turned from his purpose, even if he knows that he may be forced to retire to his estates, or even leave the country till the matter blows over.”","sourceLink":"http://novel.tingroom.com/duanpian/3092/85318.html","bookId":952,"book":{"id":952,"title":"Won by the Sword","description":"简介： A mounted officer, followed by two orderlies, was proceeding at a brisk trot from Paris to St. Denis, in October, 1639, when he came upon a large party of boys, who, armed with sticks, were advancing in something like military order against a wall on...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3092","creation":"Aug 1, 2019 12:23:58 AM","modification":"Aug 1, 2019 12:23:58 AM"}}
