{"id":73146,"no":13,"title":"Page 13","content":"“Absolutely. But I need something looked into, and it’s too delicate an assignment to trust to anyone else.” Stepping deeper into the room, Torque halted when the tips of his steel-toe boots touched the line between sunlight and shadow. His brutally short hair stuck straight up in opposing directions, the thick Asian locks bleached nearly white at the tips. It was a style that suited both the exotic features he’d inherited from his mother and his sharp-edged lifestyle. While Syre nurtured small towns that attracted motorcycle enthusiasts, ensuring a steady flow of fresh blood to local cabals and covens, Torque managed an expanding chain of nightclubs that offered haven to fledgling minions. Approaching his son, Syre clasped him by the shoulders. There was so much of Shadoe in Torque’s features, all the haunting similarities of twins. Now his daughter was stripped of her genes along with her memories. Once the spitting image of her mother, her incarnations bore the trademarks of someone else’s lineage. Although he loved Shadoe regardless of her exterior, there was a part of him that felt as if he was losing her mother anew every time their daughter was reborn with another woman’s face. “I know this is a terrible time,” he said softly, “but I have to ask you to drop off the map. In addition to Adrian’s comments about Nikki attacking him, he made a reference to Phineas that concerns me. I need you to find out what’s happened in the last forty-eight hours.” “I’ll see to it.” Torque set his hands over Syre’s. “I need something to focus on now, or I might do something we’ll all regret.” Syre pressed his lips to his son’s forehead. He understood all too well. He’d barely survived the loss of his wife and Shadoe. If not for Torque, their deaths would have killed him long ago. “When we spread the word that you’ve gone under in mourning, no one will question your absence.” It was heartless to use his son’s grief to further his agenda, but he didn’t have the luxury of passing up perfect opportunities. God, he felt old and callous. So old that he didn’t recognize the youthful face staring back at him from the mirror on the wall by the door. He looked to be only ten years older than Torque, who most people would guess was in his mid- to late-twenties. Torque spoke gruffly. “How does Adrian maintain control when he’s losing the love of his life every few hundred years? Can you be sure he’s got it together? Shadoe’s been gone a long time, Dad. It has to be fucking with his head.” “That might be true if he gave a shit. Letting her die again and again . . . never having any memory of her family and the people who love her? That’s cruelty, not love.” “I don’t know.” Torque’s eyes reflected his inner torment. “I think I’d do anything to get Nikki back, whatever the cost.” “He’s not like us. If you’d heard him on the phone . . . so calm and unaffected. He’s a seraph in every sense of the word. The soul is everything to him. He can see no purpose in existing without one. You say you’d do anything, but if you were faced with the choice, I know you’d make the right one.” “You can’t know that. I can’t know that. I feel like ripping apart every Sentinel and lycan who crosses my path.” “That’s precisely what Nikki’s death was designed to do—make us wild with rage. We have to be smarter than that. If we gather intel first, we can move with precision instead of shooting in the dark. Think of how it would benefit us to cause a rift between the Sentinels and the lycans. All we need is proof that the dogs are conspiring against their masters. We turn that over to Adrian and he’ll do the dirty work for us.” “What am I looking for?” “You’ll know it when you see it. If something’s off, you’ll catch it.” “Suggestions for where to begin?” Syre held his wrist before his son’s mouth, offering the potency of his Fallen blood to assist him on his way. Although Torque’s naphil state gave him an advantage over minions, he was still disadvantaged when compared to the Fallen. Drinking a pint or two of pure Fallen blood would negate that deficiency for a few days. Hissing as Torque’s fangs sank into his artery, Syre closed his eyes. “Phineas will be near Adrian. Go to Anaheim. Start there.” “Don’t like flying?” Lindsay queried, eyeing the white-knuckled force with which Elijah clutched the armrests of his seat. He looked at her with those beautiful emerald eyes. “Not especially.” “You have to admit, taking a private jet is way better than flying commercial.” “No.” He paled as the plane banked slightly. “I don’t.” Her mouth quirked. She looked around the luxurious cabin, her palms rubbing over the tan leather of the bucket seat she lounged in. Adrian sat a few feet away, deep in conversation with Damien and a blond guy—Jason—who was smokin’ hot, as all the angels appeared to be. She returned her attention to Elijah, who sat across from her on the other side of a table. A table. On a plane. The aircraft was about as cozy as an RV. “You got stuck with babysitting duty, didn’t you?” He just looked at her. “I’m sorry about that,” she said, feeling bad for him. “I won’t give you any trouble.” “You say that, but I can tell Adrian isn’t happy about bringing you.” Lindsay finished his thought. “And you think that means he’s acting under duress, which makes me troublesome?” Again, he just looked at her with those keen eyes. A hunter’s eyes, watchful and assessing. Knowing she had to mitigate any speculation that she was a weakness, she said, “Come on. You know him better than that. He’s not the type of guy who does anything he doesn’t want to do.” Elijah lifted a thickly muscled shoulder in reply. She set her elbow on the table and her chin in her hand. “You don’t talk much, do you? I think I’m going to like you, if only because Adrian trusts you to watch his back, but I think for more than that. Hopefully, you’ll grow to like me, too.” “I prefer to face danger only on the hunt.” Lindsay had to absorb that a moment before she understood. “You think you’ll get in trouble for being friendly with me? If Adrian intended to be territorial, he wouldn’t have assigned you to babysitting duty.” Elijah’s face gained more color as his attention shifted from his fear to their conversation. “There’s a big difference between ordering me to take a hit for you and allowing us to be . . . friends.” Looking over her shoulder again, she found Adrian watching her. He was dressed in tailored khakis and a black dress shirt that she knew must be worth a month’s pay for her, at least. The sleeves were rolled up and the collar undone, exposing just enough of his olive skin to captivate her. So far she’d seen him casually dressed in the airport, half naked just that morning, and now urbanely elegant. Of course, he was stunning in all ways. She was so infatuated with him that she had difficulty looking away. It was Adrian who broke the contact first, smoothly returning his attention to his men. Lindsay looked back at Elijah. “See? Not territorial at all.” “We have the same bloodline,” he whispered. “Not all of the beast in us comes from demons.” Momentarily taken aback by the notion, she eventually nodded her comprehension. Adrian definitely had some wildness in him; she felt it thrumming just beneath the surface. “You’re not surprised.” His verdant gaze narrowed. “He told you what we are.” His tone was pitched so low she had to lip-read as well as listen. She was amazed he was able to speak that quietly with a voice as deep as his. “I got the Cliffs Notes version,” she replied, lacking the practice to speak as softly as he did, but trying her damnedest. “I’m still not sure I understand the whole hierarchy thing, though. I mean, clearly the Sentinels are bad-ass, or else they wouldn’t have been able to subdue the Watchers to begin with. Unless the Watchers didn’t put up a fight . . . ?” “I don’t know. Perhaps not as much as they would have, had they known what they would become.” “What do you mean you don’t know? You can’t remember?” His lips pursed. “I wasn’t there. Lycans aren’t immortal. I’m only seventy years old.” Her mouth fell open. Her idea of a seventy-year-old man so did not fit with the serious hunk of beefcake sitting across from her. His thick sable hair hadn’t even one strand of gray in it and his strong, handsome features were unmarred by lines. “Wow,” she said. Silence descended. Surprisingly, it was Elijah who finally broke it. “Why do you hunt?” Lindsay thought about her answer for a moment. It was a topic she never discussed, because talking about her mother’s death meant reliving the memories of it. But Adrian knew now, and in this new world she was living in, her past was relevant to understanding her. That was something she didn’t take lightly. She had never been fully understood before and hadn’t realized how much she craved acceptance until she’d found it in Adrian. Taking a deep breath, she answered, “I was a victim of a vampire attack.” “Not you directly, or you’d be dead.” “A family member.” Elijah nodded. “Me, too.” “Is that why you’re fighting the good fight?” His dark brow arched. “As if I had a choice. But yes, that motivates me.” “Yeah.” Lindsay sighed. “I don’t have a choice, either. I thought I did, but I was deluding myself.” “What are you?” “Huh?” “How did you know that was a demon last night?” “Oh.” She winced. “I’m a human—mortal—with bad luck, I guess you could say.” She used to wonder what it would be like to be blissfully ignorant like other mortals were, but it’d been a long time since she had entertained such thoughts. It was pointless, like wondering what her life would be like if she were a cat. “What is it you see?” “I don’t see anything. I feel things. Like a ghost walking over my grave, if you’re familiar with that saying.” “You went straight to Adrian the moment you saw him. Is that why?” “No. I picked him up because he’s hot.” She embellished the half-truth with a smile, keeping her sense of the weather and its connection to Adrian close to the chest. “I’m a woman, too, you know. Heterosexual. Good-looking guys attract my attention.” “You don’t find it coincidental that you happened to pick out the one angel in the terminal?” “Absolutely. I said the same thing to Adrian last night, but he had some six-degrees-of-separation explanation.” “Hmm . . .” “Pretty much my reaction, too, but what do I know? I’m not religious.” “So says the woman who now lives with angels.” “No shit.” Lindsay grinned. “Did you see Adrian’s face when the dragon went down?” Elijah’s eyes lit with amusement. “Yeah.” The plane began to descend. She rubbed her hands together. “I hope we find whoever it is we’re looking for.” “We will.” His face hardened, taking on the fierce cast of a predator. “You like hunting, don’t you?” “Yes. This time especially.” His irises took on a preternatural glow. “In addition to Adrian’s lieutenant, this vamp is responsible for the death of two lycans.” “Friends?” “Something like that.” Lindsay wondered how many people Elijah called friends and suspected it was a small, elite group. She rolled her shoulders back and exhaled audibly. “You all right?” he asked, blanching as the plane dropped swiftly. “I will be.” For the first time, she was actually looking forward to killing something. And she didn’t feel nearly as bad about that as she thought she should. CHAPTER 10 Lindsay stepped out of the plane, slipped on her sunglasses, and looked around. “Holy shit.” A warm hand settled in the small of her back, followed by Adrian’s murmur. “What?” She turned all the way around, slowly, until she faced him directly. “Where is the ground?” The runway ended . . . in midair. “We’re on a mesa.” “No way.” “Yes way.” “Who’s crazy enough to build a landing strip on a mesa? If the pilot overshoots, you’re toast.” His mouth twitched, making her long to see him smile again. “Come on.” He led her to the airport’s small parking lot, where two sleek dark town cars awaited them. Jason and Damien climbed into the back of the first vehicle, while Elijah slid into the front passenger seat of the second one. “Saint George, huh?” she said as Adrian opened the door for her. “I’ve never been to Utah before.” “It’s a beautiful state.” He took the seat beside her and shut the door. The cars rolled into motion. “The southern half has some gorgeous red rock formations.” “Where are we headed?” “Not far. A little town called Her-ah-kun.” Lindsay frowned. “Her-ah-kun? Weird name.” Again, he almost smiled. “It’s spelled like ‘hurricane.’ ” A storm. Oh man . . . Resolve strengthened her.The city’s moniker couldn’t be a coincidence, not on top of everything else that had happened to her since she’d left Raleigh. As they descended into the city, Adrian grew still and silent, but she felt his volatility gathering force with every mile that passed. His best friend was dead. As stoic as Adrian appeared, it was clearly a loss he felt deeply. His pain humanized him, made him more man than angel. It also made her wonder where he sought comfort when he needed it, or if he internalized everything. Surrounded by angels who would die for him, he still seemed so alone.","sourceLink":"https://allnovel.net/a-touch-of-crimson-renegade-angels-1/page-13.html","bookId":1983,"book":{"id":1983,"title":"A Touch of Crimson (Renegade Angels #1)","description":"Storyline: A Touch of Crimson (Renegade Angels #1) Adrian Mitchell is a powerful angel leading an elite Special Ops unit of Seraphim. His task is to punish the Fallen-angels who have become vampires-and command a restless pack of indentured lycans. But Adrian has suffered his own punishment for becoming involved with mortals- losing the woman he loves again and again. Now, after nearly two hundred years, he has found her-Shadoe-her soul once more inhabiting a new body, with no memory of him. And this time, he won\u0027t let her go.","cover":"https://allnovel.net/images/a-touch-of-crimson-renegade-angels-1.jpg","author":"Sylvia Day","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-touch-of-crimson-renegade-angels-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:26:51 AM"}}
