{"id":73164,"no":31,"title":"Page 31","content":"Abruptly, his senses went on alert. Elijah scanned the immediate area again, just as he’d automatically done before they’d exited the lobby. The uncanny wind that always seemed to follow Lindsay blew past him, carrying the blood-rich scent of vampire. The beast inside him coiled in readiness, growling softly in anticipation of his order to attack.\n The vamp responsible for their instinctive reactions appeared a moment later, strolling into the parking lot from the public sidewalk, blissfully unaware of the predators she’d roused.\n Her looks hit him like a sledgehammer. She was tall and stacked, with curvy hips and full, firm tits. Her hair hung to her waist, straight as a board and blood red. She was clad like a goddamned dominatrix, with spiky-heeled boots, tight black pants, and a leather vest dipping in a low V that displayed the deep valley of her cleavage.\n Elijah was blindsided by the insane urge to bend her over the hood of the Mercedes she was walking past, wrap her hair around his forearm, and drill her lush body until he came with a roar.\n He fucking hated vampires, especially the females, who were more vicious than the males. Yet his cock was swelling with feral lust the longer he watched her.\n She jerked violently, jolting him back to reality. She spun wildly, as if felled by a blow, then rounded back with fangs bared.\n It wasn’t until he saw the glint of sunlight on something metallic embedded in her shoulder that he realized what had happened.\n “Shit,” he muttered, barely catching Lindsay by the shoulder as she darted forward.\n “Let me go, El,” she snapped, yanking to be free of his unyielding grip.\n “What the fuck are you doing?” he barked. “It’s goddamned daylight. That’s one of the Fallen.”\n Lindsay sliced across his forearm with her blade, eliciting a roar of pain and garnering her release.\n She was halfway to the vampire when she answered him.\n “That bitch killed my mother.”\n CHAPTER 20\n Vash stared down at the burning pain in her shoulder and realized she’d been hit with a silver-plated throwing knife. Ripping the blade free, she looked up in time to catch sight of another volley a split second before it caught her in the bicep.\n “Fuck!” she hissed, unprepared for a full-on attack in the middle of the damn day.\n A blonde was racing toward her, another blade flying from her grip. Vash barely lurched out of the way in time, the smell of her own blood stirring the hunger in her.\n A human. What the hell?\n Vash charged, ready to take the crazy bitch down, when she smelled lycan. He raced out from beneath the shadow of the hotel’s front awning, chasing the crazy blonde with the death wish.\n It hit her then: Shadoe. Followed swiftly by the identifying scent of her guard dog . . .\n The fucking bastard who’d kidnapped Nikki.\n Stunned into senselessness, Vash skidded to a halt, earning her another blade in the thigh.\n The two people she was in town to capture were coming straight toward her, and there wasn’t a damn thing she could do about it. Not while she was alone. Not without her weapons. Not with witnesses.\n Another blade nailed her in the shoulder, damn near dead center of the first hit she’d taken.\n She had taught Shadoe how to throw like that. She had taught her how to hunt, how to kill. It was clear to Vash right away: Shadoe was deliberately avoiding hitting vital organs and arteries. The crazy blonde thought she was going to capture a vamp.\n Vash grabbed a blade out of her shoulder and lobbed it at the lycan, then discarded the one in her leg and lunged forward, hitting Shadoe in the chest with her palms and throwing her backward several feet to crash into her lycan guard. The two went down, and Vash fled, leaping onto the hood of a nearby Jaguar and running up to its roof. She vaulted up and over the stone wall that divided the Belladonna parking lot from that of the dinner theater’s next door, her rage so wild she could barely see straight.\n She never ran away. She never took multiple hits. She never let anyone live who spilled her blood. But she couldn’t take out Syre’s daughter. She couldn’t kill Shadoe.\n “Goddamn! Shit! Fuck!” she shouted.\n Her boots hit the roof of a Suburban on the other side of the wall, the alarm activating in an eruption of horn blaring. Her right heel broke off and stole her balance, sending her tumbling down the windshield, across the hood, and onto the asphalt.\n She’d barely regained her footing when she heard another body hit the car behind her. Glancing over her shoulder, she saw the blonde hot on her heels. Vash took another hit in the shoulder, the sizzle of silver sending agony racing through her veins. Unable to pull a dagger out of her back, she could only run forward and hope like hell an escape route opened up. Ahead of her was a busy street, but that didn’t seem to deter Shadoe. Whatever had crawled up Syre’s daughter’s ass was goading her like a cattle prod.\n A white full-sized pickup truck bounced into the lot with too much speed, racing toward her. Vash was calculating the trajectory needed to leap over it when it spun out and swung around. Salem’s head shot out the driver’s-side window. “Get in!”\n She jumped into the back and he hit the gas, kicking up loose asphalt and leaving behind a cloud that smelled of burning rubber. A throwing knife hit the rear of the cab with a sharp ping. Vash ducked with a curse.\n The truck squealed into the swift-moving traffic to a chorus of angry horns and the crunch of metal and fiberglass. They were a good two miles away before Vash felt safe enough to pop her head up.\n “You asked for reports of abductions.”\n Syre looked up from the spreadsheets on the monitor in front of him and met the gaze of the vampress in his office doorway. “Yes, Raven.”\n The dark-haired beauty entered with an unconsciously sensual stride. She wore mile-high black stilettos, a knee-length pencil skirt, and a button-down shirt that hugged full breasts. Apparently she was acting the role of naughty secretary, one of the many games she played to keep things interesting.\n “There was a raid last night in Oregon,” she said. “A group of Sentinels invaded a nest and took several minions with them.”\n Leaning back in his chair, Syre wondered at Adrian’s growing boldness. To infect minions with a disease seemed unlike him. He was a warrior who engaged in and excelled in physical combat. Biological warfare wasn’t a tactic Syre would ever have attributed to the Sentinel leader. Something had changed, or was in the process of changing.\n For the first time in many, many years, Syre felt the clock ticking with brutal impatience. Torque had been pushing him to act, instead of react, for many years now. It looked like that time might indeed be nigh.\n “Thank you,” he murmured. “Send a team out to Oregon. I want to know every detail of the raid. And keep me apprised of any further reports immediately.”\n “Yes, Syre.”\n Raven left the room. He attempted to return his focus to the screen in front of him. The effort was futile. When the phone rang, he reached for it with relief, his thoughts still occupied by Adrian’s offensive moves.\n You have no idea of what I’m authorized to do, the Sentinel leader had said just a few short weeks earlier. Perhaps there was a wealth of threat in those words that Syre had been oblivious to.\n The raised voice of the caller on the other end of the line was audible before he even placed the receiver by his ear.\n “Calm yourself, Vash,” he soothed. “Slow down. I can’t—”\n He stiffened as she continued spewing words in a rush, all but one thought dissipating from his mind. Act, instead of react.\n It was indeed the time.\n “What the fuck were you thinking?” Adrian asked in that cool, modulated tone of voice that made Lindsay grit her teeth.\n As wired as she felt, she’d prefer him to yell or raise his voice, pace or glower—something. Instead, he stood casually in front of his desk and spoke so calmly he might have been commenting on the weather. It was only the distant rumble of thunder that told her he wasn’t taking the news of her reckless assault on one of the Fallen with anything less than total aplomb.\n “I’ve been looking for that vampire my whole damn life,” she bit out, “and there she was, strolling right by me. I had to do something.”\n “It was the middle of the day. You were surrounded by dozens of tourists.”\n Her arms crossed. “I don’t have forever to hunt her down. If I have to wait another twenty years to find her, I might not be physically capable of doing anything about it. I might not even be alive. It’s now or never.”\n Adrian’s flame blue gaze bored into her, searing her with its heat. “You’ve now exposed yourself to the Fallen. They’re going to come after you.”\n “I hope they send her,” Lindsay shot back defiantly. “Next time, I won’t play with her. I’ll just take her down.”\n Damien made a noise that drew her attention. “If you could have killed her, why didn’t you?”\n “Because I need to know where the other two assholes are. She was alone when I first saw her. I didn’t see anyone with her until she was rescued. And, by the way, the guy driving the getaway vehicle had the same crazy crayon-colored spiked hair I remember from the day they attacked my mother. If she’s still hanging with that dude, I’m guessing the other one isn’t far away.”\n “The ramifications of what you’ve done are going to haunt us. We don’t hunt the Fallen. We can’t. Their punishment is to live with what they are.”\n “She wasn’t suffering when she terrorized my mom; she was having a damn good time. That bloodsucking cunt doesn’t deserve to live.” She shot a look at Adrian, whose impassive face gave nothing away. Her stomach knotted. God, she didn’t want to cause him any more trouble. But what could she have done? Her entire life had been built around avenging her mother. “She left me alive, so it’s her stupid mistake that I’m hunting her now. I guess she figured that, as a human, I wasn’t going to grow up to be a threat. But that should absolve you of any blame. I’m not one of you. I don’t operate under the same rules. What I do shouldn’t affect you.”\n “You had a lycan with you,” Adrian reminded. “That involves us.”\n “So cut me loose.” She hated the soft note of pleading in her voice. “I can’t bring you anything but trouble. That’s killing me, Adrian. It’s breaking my heart.”\n With a harsh exhale, Adrian leaned his hip against his desk and wrapped his hands around the edge. “When Vash shoved you into Elijah, she could have just as easily punctured your rib cage with her fist and ripped out your heart. You’re only breathing now because she let you go.”\n “Why the fuck would she do that? Again? I got the drop on her; I can do it again.”\n “That was Vash?” Elijah’s growl rumbled through the room. “I want that hunt.”\n Lindsay glanced at him and gave a curt nod. Vash had taken people they loved from them, and it was time to make her pay.\n Looking back at Adrian, Lindsay said, “You told me you’d help me hunt her down. You dug around in my brain. You knew who she was. Were you lying?”\n “No. But we need to provoke them into attacking us, not launch a war ourselves. We can take defense, not offense. There are rules and there are ways around those rules—” His cell phone rang, drawing his attention to where the phone rested on his desk. Frowning, he said, “Excuse me.”\n He answered with a clipped “Mitchell.”\n As she watched, Adrian’s face took on the hardness of stone. She could hear someone speaking rapidly, but couldn’t make out the words. Elijah exhaled in a rush and stepped closer to her, as if to stand with her. Support her. A chilly sense of foreboding swept over her.\n A long, drawn-out moment passed. Finally, Adrian nodded. “Yes. Stand by. I’ll make the arrangements.”\n Putting the BlackBerry down with far too much care, Adrian swept his gaze from Damien to Elijah. A silent communication passed between them, and the two men moved to leave the room. Elijah’s brief squeeze to her shoulder and Damien’s pitying look tightened the cold knot of dread in her stomach.\n “What is it?” she asked when the door shut, leaving her and Adrian alone in his office.\n He stepped toward her and gripped her upper arms in gentle hands. “It’s your father, Lindsay. He—”\n “No.” The floor fell away from her and she swayed. Her chest felt as if it had just cracked open, the pain so excruciating she would have sunk to the floor if not for Adrian’s hold.\n “He was driving and swerved off the road. He hit a tree.”\n “Bullshit.” Tears streamed down her face. “I don’t fucking believe it. My dad handles cars like a pro. This is Vash’s fault. She’s Syre’s second. She could order this.”\n Which made this partly her own fault.\n His wings unfurled and wrapped around her, sheltering her. He caught her close, gripping her nape and hip to press her fully against him. “I can’t rule that out. I’ll investigate until I know for sure.”\n A broken, serrated noise filled the room. Lindsay realized she was sobbing, her entire body racked by violent quaking.\n Adrian held her, his warmth penetrating from the outside and sinking into her. No—he was inside her. Inside her mind like before, curling around everything like insidious tendrils of smoke. Her agonized grief began to fade, the sharpest edges softened by a strange sense of comfort.\n Lindsay wrenched away from him, stumbling backward before crumpling to the floor. “What the f-fuck are you doing?”\n Crouching beside her, he reached to brush her hair away from her face. His eyes flickered with preternatural flame and glistened with tears. “Taking away your pain. I can’t bear it.”\n “W-what? How . . . ?”\n “I can pull the painful memories from you, neshama. I can heighten your recollection of the happy ones.” \n","sourceLink":"https://allnovel.net/a-touch-of-crimson-renegade-angels-1/page-31.html","bookId":1983,"book":{"id":1983,"title":"A Touch of Crimson (Renegade Angels #1)","description":"Storyline: \n A Touch of Crimson (Renegade Angels #1) \n Adrian Mitchell is a powerful angel leading an elite Special Ops unit of Seraphim. His task is to punish the Fallen-angels who have become vampires-and command a restless pack of indentured lycans. But Adrian has suffered his own punishment for becoming involved with mortals- losing the woman he loves again and again. Now, after nearly two hundred years, he has found her-Shadoe-her soul once more inhabiting a new body, with no memory of him. And this time, he won\u0027t let her go.\n \n","cover":"https://allnovel.net/images/a-touch-of-crimson-renegade-angels-1.jpg","author":"Sylvia Day","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-touch-of-crimson-renegade-angels-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:26:51 AM"}}
