{"id":90788,"no":6,"title":"Page 6","content":"\"I know we said this would be our evening alone, but Raj has been suffering from some major separation anxiety lately.\" Adam was on Cassie\u0027s doorstep with a pizza box in one hand and a dog leash in the other.\\n\\n \"It\u0027s okay.\" Cassie bent down to give the shaggy dog a loving pat. \"We\u0027re not completely alone with Jekyll and Hyde downstairs anyway. At least Raj can\u0027t order me around like a maidservant.\"\\n\\n Adam\u0027s eyes softened. \"Has it gotten that bad already?\" he asked, nodding in the direction of Faye and Laurel in the basement.\\n\\n \"Let\u0027s just say I\u0027d love to take this pizza to go.\"\\n\\n \"A picnic on the bluff. That\u0027s a great idea. Let\u0027s do it.\" Adam tugged on Raj\u0027s leash and the dog sniffed and snorted, almost too excited for Adam to keep hold of him.\\n\\n Cassie grabbed a jacket and followed Adam out the door. Of course it was impossible for Faye and Laurel to hear her, but Cassie still couldn\u0027t bring herself to open up to Adam about her nightmare or the cord with her friends so close by. Whether it was pure paranoia or not, having a heart-to-heart with Adam out in the fresh air on the bluff seemed like a far superior option.\\n\\n Adam kept Raj in check as he and Cassie made their way along Crowhaven Road, arm in arm, savoring the beautiful night. Cassie felt safe and protected with Adam, but she couldn\u0027t help surveying the surrounding area, scanning every tree and shadow, alert to any movement or sound. She knew Scarlett or a hunter could be behind any one of the many crooked mailboxes or lopsided lampposts along their way.\\n\\n The bluff was tranquil, a rocky fort of solitude. The night was quiet in a way that usually made Cassie feel calm, but tonight she wanted to scream as loud as she could and shatter it.\\n\\n Adam instructed Raj to lie down, then opened up the pizza box and handed Cassie a drooping, dripping slice. \"I got your favorite. Hawaiian.\"\\n\\n Cassie accepted the slice from him and took a small bite before diving right into what she\u0027d been waiting to say. \"I have to tell you something,\" Cassie said. Her words echoed into the night. \"I had a dream last night.\"\\n\\n \"By the tone of your voice,\" Adam said while chewing, \"I\u0027m guessing it wasn\u0027t a good one.\"\\n\\n Cassie shook her head. \"And it was so real. I\u0027m not sure if it actually happened.\"\\n\\n \"If it was a dream, Cassie, of course it didn\u0027t happen. Are you saying you had another vision? Was it Scarlett?\"\\n\\n \"No. This was something else.\" Cassie looked down from the sloping cliff to the lapping water below. \"In the dream I was reading my father\u0027s Book of Shadows, absorbing all of its energy. And then when I woke up my hands had been burned. See this?\"\\n\\n Cassie set her slice of pizza down and lifted her shirtsleeve to show Adam the new burn on the inside of her hand. \"That wasn\u0027t there before I went to bed.\"\\n\\n Adam closely examined the mark. \"Okay, that\u0027s weird,\" he said. \"Do you think you were reading the book in your sleep?\"\\n\\n Cassie pulled her sleeve back down and picked at a pineapple bit on top of her pizza. \"I don\u0027t know. When I woke up, I found it locked away just as I\u0027d left it before I went to bed. It really doesn\u0027t make any sense.\"\\n\\n \"Have you told anyone else about this?\"\\n\\n \"No, just you. And I want to keep it that way.\"\\n\\n Adam\u0027s face took on an air of seriousness as his eyes wandered across the bluff. Cassie could tell he was trying to come up with some explanation or solution, but not finding any.\\n\\n \"We have to find out more about that book,\" he said. \"It\u0027s time for us to learn how dark magic works.\"\\n\\n Cassie stiffened at the words dark magic. It wasn\u0027t something she wanted to be associated with, especially in Adam\u0027s mind. But Adam was right.\\n\\n \"I want to try to open the book,\" Cassie said. \"With you at my side. I know for sure the witch-hunter curse my father used is in there and I want us to research it together.\"\\n\\n \"I think that\u0027s a good idea.\" Adam put aside his half-eaten slice of pizza and held Cassie by the shoulders. \"I understand your fears about telling the rest of the Circle about this, but they might be able to help. Diana\u0027s Book of Shadows has a lot of information in it. We should at least tell her, if not the others.\"\\n\\n Cassie shook her head. \"Not yet.\"\\n\\n \"Diana\u0027s not going to judge you,\" Adam said. \"You know that.\"\\n\\n \"There\u0027s more to it than that, Adam.\"\\n\\n Cassie could see how strongly Adam disagreed with her, so she had to remain firm. \"This is a private matter,\" she said. \"A family matter. It\u0027s not for you to decide who should and shouldn\u0027t know about it.\"\\n\\n \"Fine.\" Adam exhaled loudly. \"When you\u0027re ready then.\"\\n\\n For a few seconds his frustration was palpable. He got quiet and picked a pebble off the ground, worrying it between his fingers.\\n\\n But soon enough he lobbed the pebble into the water and refocused on Cassie. \"I\u0027m with you on this,\" he said. \"I need you to know that.\"\\n\\n Cassie reached out to pull Adam closer. She buried her head in his chest and he rested his chin on her hair. Raj barked and jumped with jealousy. He nosed at their legs and pawed at their feet until Cassie gave in and bent down to give him a pat on the head. Adam laughed and stroked the dog\u0027s disheveled coat.\\n\\n \"I think Raj is right,\" Adam said. \"We\u0027ve had enough serious talk for one night.\" He returned to his pizza and bit off a mouthful.\\n\\n \"Actually, there\u0027s one more thing.\" Cassie looked down at the dewy ground. As much as she wanted to forget all her troubles and enjoy her time with Adam, she knew she couldn\u0027t keep the cord a secret from him any longer.\\n\\n \"More bad news?\" Adam said with a smile. \"Have you been saving it all up for this one walk?\"\\n\\n \"Kind of.\" Cassie couldn\u0027t bear to fake levity. \"I\u0027ve kept this inside for a while now.\"\\n\\n Adam commanded Raj to sit and tried to read Cassie\u0027s expression. \"What is it?\"\\n\\n \"I saw something,\" Cassie said, in a barely audible voice. \"That night in Cape Cod. When I was in your arms. I saw the cord, our cord.\"\\n\\n \"Okay.\"\\n\\n \"But I also saw a second cord. Going from you to Scarlett.\"\\n\\n \"I don\u0027t understand what you\u0027re telling me,\" Adam said, but Cassie knew he must have perfectly understood what she was saying.\\n\\n \"It looked just like ours,\" Cassie explained. \"But it was between the two of you. What do you think that means?\"\\n\\n Adam shook his head. \"I didn\u0027t see anything like that.\"\\n\\n Cassie didn\u0027t want this to turn into an argument, but denying it wouldn\u0027t help any. They couldn\u0027t just pretend this away. \"I saw it with my own eyes,\" she said. \"I could almost reach out and touch it.\"\\n\\n \"Cassie.\" Adam took Cassie\u0027s face into his hands and made her look him in the eye. \"Whatever conclusion your mind is racing to right now, stop it. You were close to dying when you think you saw that cord. You must have been hallucinating in the smoke.\"\\n\\n \"Adam ...\" Cassie started to say, but he interrupted.\\n\\n \"The silver cord is just between us. That\u0027s how soul mates work.\"\\n\\n \"What if you have more than one soul mate? That\u0027s what I\u0027m asking.\"\\n\\n \"I don\u0027t even think that\u0027s possible.\" Adam wrapped his arms around Cassie\u0027s torso. \"And any cord aside, I love you, Cassie. Only you. With everything I have.\"\\n\\n \"I love you too, but - \"\\n\\n Adam kissed Cassie on the mouth, softly at first and then with more passion. The kisses made Cassie feel dizzy and light-headed in a way that made her want to giggle out loud. Even more so, she felt him - his essence - intertwining with hers.\\n\\n Then Adam abruptly pulled away. \"Did you feel that?\"\\n\\n \"Of course I did.\"\\n\\n \"That\u0027s all the proof I need. Cord or no cord. So forget about what you think you saw when you were half-conscious.\" Adam kissed Cassie again, this time affectionately on the cheek.\\n\\n His lips felt warm and loving on her skin, and she couldn\u0027t deny the feeling she got every time Adam kissed her. He was right about that much.\\n\\n \"I only wish you\u0027d told me this sooner,\" he said. \"I hate that you\u0027ve been worrying about this.\"\\n\\n \"You would tell me if you saw it, wouldn\u0027t you, Adam?\" Cassie wasn\u0027t sure where the question came from. She never doubted Adam\u0027s word before. She\u0027d never had a reason to.\\n\\n But Adam hesitated in a way that caught her attention. His answer didn\u0027t come with the immediacy of honesty.\\n\\n \"Of course I\u0027d tell you,\" he said, calmly and dismissively, only after he\u0027d faltered. \"I didn\u0027t see a thing. And I don\u0027t think you did either.\"\\n\\n Perhaps it was all in Cassie\u0027s head, but Adam didn\u0027t sound quite convincing enough. Maybe she was even more confused and paranoid than she realized.\\n\\n Cassie turned away, focusing her attention on the long murky line of Crowhaven houses in the distance behind them. Like Adam said, cord aside, their relationship had grown and evolved way beyond love at first sight.\\n\\n \"You know what I think?\" Adam said in a lighter tone. \"I think it\u0027s time you allowed yourself to relax. Your mother\u0027s right - you\u0027re taking on too much.\"\\n\\n \"She said that to you?\"\\n\\n Adam nodded. \"At the meeting you slept through this morning. But she didn\u0027t have to. We can all see it, Cassie. And you\u0027re not alone.\" Cassie started to respond, but Adam got that goofy look on his face once more.\\n\\n \"Will you do me the honor of being my date for the Spring Fling? We could use a little fun, hunters be damned. And I can\u0027t think of a better person to have on my arm than you.\"\\n\\n Cassie giggled in spite of herself. But her gaze shifted back to Crowhaven Road, all the way down to the blackened depths of the bottom of the hill. \"That sounds perfect, but I don\u0027t know if we can afford to make fun a priority right now.\"\\n\\n Then Cassie paused and thought better of the idea. \"On second thought,\" she said, \"the dance might be just the opportunity we need to get close to the principal and Max in a public setting, to see if we can figure out some of their weaknesses, or find out more about their stone relics.\"\\n\\n \"Cassie. You\u0027re missing the point. Your only concern should be making sure I wear the right color bow tie.\"\\n\\n \"Come on, Adam, I know you better than that. You\u0027re always putting Circle business first, before everything else.\"\\n\\n Adam blushed with guilt. \"Okay, you\u0027re right. Using the dance to get close to the hunters had crossed my mind. But that is all the more reason we both need a night off.\" His eyes flickered in the moonlight and he reached for Cassie\u0027s hand. \"No magic. Just go to the dance and have a nice time - simple as that.\"\\n\\n Adam was so much better than Cassie at being happy these days. Maybe some awful punch and silly dancing with her friends and boyfriend was just what she needed to clear out the black cloud that had settled into her chest. At the very least she could pretend to be excited about it - for Adam\u0027s sake, and her mother\u0027s peace of mind.\\n\\n Cassie accepted Adam\u0027s hand and let him draw her in, ballroom dance - style.\\n\\n \"Pink,\" she whispered into his ear. \"For your bow tie.\"\\n\\n Adam took a step back. \"Seriously? Couldn\u0027t you choose a color that\u0027s a bit more manly?\"\\n\\n \"Nope. Pink it is.\" \\n\\n","sourceLink":"https://allnovel.net/the-secret-circle-the-hunt-the-secret-circle-5/page-6.html","bookId":2099,"book":{"id":2099,"title":"The Secret Circle: The Hunt (The Secret Circle #5)","description":"Storyline: For Cassie and her Circle of witches, it\u0027s hard to imagine life in New Salem getting any worse. A band of powerful witch hunters is targeting the group, determined to destroy them one by one. And Cassie\u0027s half sister, Scarlett, won\u0027t rest until she has a spot in the Circle - even if she has to kill Cassie to get it. The Circle\u0027s only hope against their enemies is Cassie\u0027s father\u0027s Book of Shadows - an ancient guide to the world of dark magic. But Cassie soon discovers that opening the book has grave consequences. Cassie\u0027s drawn in by the book\u0027s sinister spell, and it starts controlling her emotions and impulses, unraveling her relationship with Adam as it takes over her life. Cassie fights against the darkness inside her as the threats against the Circle grow. But once evil is let in, she may never escape...\\n","cover":"https://allnovel.net/images/the-secret-circle-the-hunt-the-secret-circle-5.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-secret-circle-the-hunt-the-secret-circle-5.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:44:39 PM"}}
