{"id":43814,"no":40,"title":"Chapter XL","content":"Vailima, June 18th, 94. My Dear Colvin, — You are to please understand that my last letter is withdrawn unconditionally. You and Baxter are having all the trouble of this Edition, and I simply put myself in your hands for you to do what you like with me, and I am sure that will be the best, at any rate. Hence you are to conceive me withdrawing all objections to your printing anything you please. After all it is a sort of family affair. About the Miscellany Section, both plans seem to me quite good. Toss up. I think the Old Gardener has to stay where I put him last. It would not do to separate John and Robert. In short, I am only sorry I ever uttered a word about the edition, and leave you to be the judge. I have had a vile cold which has prostrated me for more than a fortnight, and even now tears me nightly with spasmodic coughs; but it has been a great victory. I have never borne a cold with so little hurt; wait till the clouds blow by, before you begin to boast! I have had no fever; and though I’ve been very unhappy, it is nigh over, I think. Of course, St. Ives has paid the penalty. I must not let you be disappointed in St. I. It is a mere tissue of adventures; the central figure not very well or very sharply drawn; no philosophy, no destiny, to it; some of the happenings very good in themselves, I believe, but none of them Bildende, none of them constructive, except in so far perhaps as they make up a kind of sham picture of the time, all in italics and all out of drawing. Here and there, I think, it is well written; and here and there it’s not. Some of the episodic characters are amusing, I do believe; others not, I suppose. However, they are the best of the thing such as it is. If it has a merit to it, I should say it was a sort of deliberation and swing to the style, which seems to me to suit the mail-coaches and post-chaises with which it sounds all through. ’Tis my most prosaic book. I called on the two German ships now in port, and we are quite friendly with them, and intensely friendly of course with our own Curacoas. But it is other guess work on the beach. Some one has employed, or subsidised, one of the local editors to attack me once a week. He is pretty scurrilous and pretty false. The first effect of the perusal of the weekly Beast is to make me angry; the second is a kind of deep, golden content and glory, when I seem to say to people: ‘See! this is my position — I am a plain man dwelling in the bush in a house, and behold they have to get up this kind of truck against me — and I have so much influence that they are obliged to write a weekly article to say I have none.’ By this time you must have seen Lysaght and forgiven me the letter that came not at all. He was really so nice a fellow — he had so much to tell me of Meredith — and the time was so short — that I gave up the intervening days between mails entirely to entertain him. We go on pretty nicely. Fanny, Belle, and I have had two months alone, and it has been very pleasant. But by tomorrow or next day noon, we shall see the whole clan assembled again about Vailima table, which will be pleasant too; seven persons in all, and the Babel of voices will be heard again in the big hall so long empty and silent. Good-bye. Love to all. Time to close. — Yours ever, R. L. S.","sourceLink":"http://novel.tingroom.com/jingdian/1389/41635.html","bookId":1427,"book":{"id":1427,"title":"Vailima Letters","description":"简介： My Dear Colvin,This is a hard and interesting and beautiful life that we lead now. Our place is in a deep cleft of Vaea Mountain, some six hundred feet above the sea, embowered in forest, which is our strangling enemy, and which we combat with axes a...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1389","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
