{"id":92539,"no":3,"title":"Page 3","content":"“Cuidado, querida.” I dusted off my hands, as embarrassed by my lame excuse as I was by my epic fall. Picking the sharp pebbles from my knees, I mumbled, “So much for graceful.” I heard a low, rumbling chuckle overhead. The shadows shifted, and Alcántara came into view, squatting before me. “If you but relax, the legs will be as supple as the mind.” I felt his deft hands on my knee and elbow, and before I knew it, he’d arranged me so I was sitting before him. I was horrified, sprawled there in my damp cotton shorts and oversized sweatshirt—my legs seemed extra pale, the flesh extra mottled with bruises. But it got worse, because he took one of my sneakers in his hand, unlaced it, and slipped it free, and then the other, until both my feet were pale and naked before him. I felt as if he’d bared more than just my pruny toes. I’d lied—I didn’t trip because I had sand in my shoe; I tripped because my nerves made me clumsy. But if he sensed my excuse, he didn’t show it. Instead, Alcántara took turns cupping each heel, gently sweeping away every last bit of sand. The sensation of his hands rubbing rough sand over the delicate arch of my foot sent electric shocks zinging up my body. I couldn’t have budged if I wanted to, I was so paralyzed watching his every move. He worked in silence, eventually lacing me back up, and as I came back to myself, he was sliding his hand over mine, his grip cool and firm on my buzzing skin. He stood, pulling me with him, and I became aware of his nascent power. Hugo de Rosas Alcántara might have been lean, but he was strong. Those dark eyes met mine. “Better?” “I’m feeling much more…uh…supple now, yes, thank you.” I felt the blood dump into my cheeks. Great. First Alcántara witnessed me stripped of dignity, and now my violently blushing cheeks would make him so thirsty, he wouldn’t be able to fight the urge to bite me and drink me dry. Well, maybe he’ll make it quick.… But instead he smiled. “You must have a care,” he told me with that devil’s grin. He bent over the rock that’d tripped me and easily pried it from the dirt. He held it before him in his outstretched palm. “We cannot have the best fighter on this island downed by a simple stone.” And then he crushed it to powder. He dumped the dust from his palm, his fingers sprinkling it into the breeze. “You are working with me now, and we must let nothing stand in your way.” It was a kind thought, and yet menace had infused the words. I got the sense that Alcántara would allow nothing to distract me—not obstacles, not fear. And especially not people. “Thank you,” I managed. If I’d known winning the Directorate Challenge would mean this, I might’ve rethought things a bit. He gave me a courtly nod in reply, strolling on, and I did my best to keep up, despite my trembling legs. We walked, and time passed, and despite our little foot interlude, his features remained as still as marble. I imagined that, to an immortal, fifteen minutes of quiet was like the blink of an eye, but to me, the silence was excruciating. I distracted myself by carefully scanning the path as we went, all the while trying to discern whether Master Alcántara breathed and wondering if his heart beat. Would I ever feel comfortable enough to ask? Not daring to look straight at him, I snuck a peek at his legs and feet. Black denim. Thighs that were not too skinny, not too muscle-y. Simple ankle-high boots in a leather that wasn’t too shiny, nor too weathered. This vampire might’ve looked the part of an indie rocker, but his attention to detail struck me as studied. He’d have been just as pitch-perfect in the seventeenth century, or the nineteenth, or forty years ago for that matter. I stifled the nervous laugh that threatened to bubble free, picturing Alcántara in a seventies leisure suit and paisley shirt. Surely he sensed my shifting gaze—nothing escaped the vampires—but still he remained silent, until it began to scare me, certain as I was that I’d start giggling at any moment. Unable to bear it any longer, I asked the question that’d dogged me since I won the Directorate Award. “So, what’s my, uh, independent study, anyway?” I knew our assignment would take us off-island, and my mind raced with all sorts of James Bond possibilities. Would I learn to fly a plane? Ski while balancing a rifle over my shoulder? Hack into state-of-the-art computer systems? His black eyes went flat. “You really must work on your diction, Acari Drew. You are lovely, your wit amuses, and your mind has great potential, but your language betrays a certain lack of sophistication.” “Umm…” I began, earning a sharp look from the vampire. I swallowed hard, trying again. “I mean to say, what will be my independent study this term?” We reached our destination, and I’d been so preoccupied, I hadn’t noticed we were standing in front of my most detested spot on campus—the Arts Pavilion. It was a ridiculous name, and I was sure he’d named it, the head of the arts department and my least favorite person, dead or undead: Master Alrik Dagursson. “Wait. What are we doing here?” “I am delivering you to your independent study.” “I thought my independent study would be with you.” Embers smoldered to life in those coal black eyes. “I am deeply flattered, querida.” He stroked a finger down my cheek, and I held my breath, vowing to guard my words more carefully from now on. “We shall have many hours together, you and I. But first you must begin with Master Dagursson.” I cleared my throat, focusing on the matter at hand and not the silken feel of his cool finger on my hot skin. “But he’s my decorum teacher.” “And so the obvious choice to delve deeper into topics of manners, dining, and dance.” “But I’m in my gym clothes.” I squirmed. My shorts were almost dry, but a thin layer of sand was caked to my chilly butt cheeks. “And so an Acari learns to adjust.” I’d registered the warning in his tone and tempered my voice. I had yet to figure out who these vampires were and what their goal was. I’d gathered that they were fighting some unnamed foe, which was why they needed to train us Watchers in the first place. But dancing? “I’ll need to know…manners for our mission?” He brushed a wisp of hair from my eyes. “Yes. Among other skills.” My heart leapt to my throat. Had he meant to give the word a double meaning, or was I just a hormonally overactive teenager? “When you blush so, you resemble a cat caught with the cream.” He pressed the backs of his fingers to my cheek as though fascinated. “Such an innocent you are. Yours, such peculiar circumstances. You have been touched by man, yet you remain unsullied. Tempered like steel, with what wisdom you possess hammered into you.” To call getting smacked around hammered with wisdom seemed a stretch, but I had no choice but to play along. Besides, it beat analyzing his other subtext, namely the whole unsullied-virgin thing. “My dad as blacksmith—that’s one way to interpret it.” He chuckled at that. “Yes, a very pretty reading of an ugly childhood.” Cupping my chin, he added somberly, “Such a pretty creature demands no less.” His hand migrated to my hair, twirling a lock between his fingers. “It’s a shame, really, what Acari Lilac did to your hair. Tan rubia. So very pale and fine. But it shall grow back, no?” I managed a nod. Always the damned hair attracted attention. “I’m told blondes have more fun, though I’ll believe it when I see it.” But instead of looking amused, he stared blankly. When he spoke again, his voice was subdued. “Do you know a vampire’s hair does not grow? This notion that our hair, our nails, grow on after death—sadly, it is a myth.” But then his voice strengthened again, his tone stern, laser focused, and back on topic. “I know you dislike topics in decorum. As I also know, I’ve shown you favor that some might deem unacceptable. And so I tell you now, Acari Drew, you shall dance because I bid it.” He still held a swath of my hair between his thumb and finger, and he gave the merest tug, holding it taut from my scalp. “You shall focus on topics in decorum because our mission requires it. And the first of these topics is dance.” I tried to keep my face stoic but must’ve failed, because he added, “You can dance, Alrik has assured me.” He let go of my hair, and with it went the edge from his voice. “The key to elegance on the dance floor is to believe you are beautiful.” “Beautiful,” I repeated tonelessly, wondering what sort of mantra I’d need to withstand a summer full of elegance. With Dagursson. “You can say it, you can repeat it”—he paused long enough to make me once again question how many thoughts of mine he knew—“but you must believe you are beautiful. You must feel it, here.” He grazed a finger just above my left breast. I held my breath, and my heart thumped to meet his touch, as though beckoned. Alcántara let his hand linger, his fingertip gently pressing down on the soft swell of my flesh. My skin always felt cool in his presence, but this time flames licked up my legs, dancing into my very core. I didn’t want him, though. Not in a sexual way. Not precisely. The yearning I felt was more for the glimpse of something dark and forbidden. I wanted to go there in my mind, but never could I ever imagine going there in body. The strains of some cloyingly classical tripe drifted through an open window. I fought the urge to grimace. How was it I found myself in this preposterous situation? I had to leave one vampire because another awaited me. Alcántara took a step back. Without dropping his gaze, he tilted his chin in an elegant nod of farewell. “Until we meet again, querida.” He turned and walked away. Leaving me to wonder at the mess I’d gotten myself into. And how I might get myself back out again. CHAPTER THREE I stared at that bizarrely skinny back and steeled myself. Master Alrik Dagursson—the creepiest of the creeps. As far as I could tell, he’d been some sort of Viking in his time—but weren’t Vikings supposed to be all big and brawny? If anything, Dagursson looked like an aging rocker after several hard-lived decades of sex, drugs, and rock and roll. Except maybe not the sex part.","sourceLink":"https://allnovel.net/vampire-s-kiss-the-watchers-2/page-3.html","bookId":2292,"book":{"id":2292,"title":"Vampire\u0027s Kiss (The Watchers #2)","description":"Storyline: Vampire\u0027s Kiss (The Watchers #2) As someone who has survived her first year as an Acari recruit, Drew\u0027s ultimate goal is to become a Watcher and be paired up with a Vampire agent. Except nothing is as it seems. The vampire Alcántara is as sinister as he is sexy, Ronan is more distant than ever, and it turns out there are other vampires out there. Bad ones. They\u0027ve captured one of the Watcher vamps and are torturing him for information-and Drew is going undercover to rescue him. But when their vampire prisoner turns out to be a gorgeous bad boy, Drew\u0027s first mission quickly turns into more than she bargained for...","cover":"https://allnovel.net/images/vampire-s-kiss-the-watchers-2.jpg","author":"Veronica Wolff","type":"Mystery","source":"allnovel","link":"https://allnovel.net/vampire-s-kiss-the-watchers-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:55:40 PM"}}
