{"id":590,"no":40,"title":"第二十章 计划远离","content":"“不！我不要回家！你不能强迫我！”乔纳思又哭又叫的，用拳头捶打着床铺。 “坐起来，乔纳思。”传授人坚定地告诉他。 乔纳思听话地坐在床边，低垂着头，一边擦泪，一边发抖。 “今晚你可以留下来，跟我说话。现在我要通知你的家人，你必须安静下来，不可以让人听见你的哭声。” 乔纳思猛然抬头：“也没人听见小双胞胎在哭！只有我父亲！”说着他又趴下来啜泣。 传授人静静地等待，最后乔纳思终于冷静下来，缩成一团，肩膀仍旧颤动不已。 传授人走到墙边对着对讲机拨开开关。 “您好，记忆传承人，请问有何吩咐？” “请通知新记忆传承人的家人，说他今晚要留在这里加强训练。” “我会照办的，先生。谢谢您的指示。” “我会照办的，先生。我会照办的，先生。”乔纳思用冷酷、挖苦的声音说：“只要你吩咐，我会照办的，先生。我会杀人，先生。老人？或是体重较轻的新生儿？我很乐意杀他们，先生。谢谢您的指示，先生。我可以为您效劳吗……” 他好像停不下来了。 传授人牢牢地抓住他的肩膀，乔纳思猛然停下来，看着他。 “听我说，乔纳思，他们也无能为力，他们什么都不知道。” “以前您也说过这句话。” “我这样说，因为这是事实。这就是他们的生活，特别为他们创造出来的生活。如果你没被选为我的继承人，你的生活也跟他们一样。” “但是，他对我说谎！”乔纳思又哭了。 “别人告诉他要这么做，他什么也不懂。” “你呢？你也对我说谎吗？”乔纳思愤怒地提出这个尖锐的问题。 “我被賦予说谎的权力，但我不曾对你说过谎。” 乔纳思瞪着他：“解放都是这样子吗？只要是违规三次的人？还有那些老人？他们也杀老人吗？” “对，事实如此。” “费欧娜呢？她爱老人啊！她正在接受看护的训练。她知道吗？当她发现她必须这么做的时候，她要怎么办？她会有什么感觉？”乔纳思用手背抹掉脸上的泪。 “费欧娜早就练好解放的技巧了。”传授人告诉他，“你的红头发朋友很能干，工作非常有效率。她的生活里没有‘感觉’这回事。” 乔纳思用手臂环抱住自己，身体前后摇晃：“我该怎么办？我不能回家！我做不到！” 传授人站起来：“首先，我要订我们的晚餐，然后吃饭。” 乔纳思不自觉地用发怒、讽刺的语气说：“再来一段感觉分享？” 传授人发出怜悯、痛苦又空洞的笑声：“乔纳思，只有你和我是拥有感觉的人，过去这一年来，我们彼此分享这些感觉。” “对不起，传授人，”乔纳思悲惨地说，“我没有憎恨您的意思。” 传授人拍拍乔纳思拱起的肩膀：“等吃过饭后，”他说，“我们来定个计划。” 乔纳思困惑地抬起头：“定什么计划？没有用的，我们什么也不能做。长久以来就是这样，在我以前，在您以前，在您前面那一位以前，以前，以前，再以前……”他故意拉长这句熟悉的用句。 “乔纳思，”停了一会儿，传授人说，“没错，这样的状况看起来好像是天经地义了。但是记忆告诉我们，以前并不是这样的。人们也曾经有过感觉。你跟我都经历过，所以我们知道。我们知道他们曾经有过骄傲、悲哀、还有……” “还有爱，”乔纳思补充，他想起那幕令他深深感动的家庭场景，“还有痛苦。”他再度想起那名士兵。 “拥有记忆并不痛苦，真正的痛苦是孤寂，找不到人分享这些记忆。” “我一开始就分享您的记忆。”乔纳思说，试着让他开心起来。 “的确。过去这一年来有你跟我一起共同度过，让我更加确认，事情一定要改变。多年来，我一直有这样的念头，但总觉得改善无望。现在，我头一次想到了可能有转机。”传授人慢慢地说：“是你让我想起这个方法的，就在……”他瞄了时钟一眼，“两个小时之前。” 乔纳思看着他，仔细聆听。 现在，夜深了。他们谈了又谈，谈了又谈。乔纳思身上裹着传授人的罩袍，这种长袍只有长老才有资格穿。 他们的计划有可能成功，只是有可能。如果失败了，他可能被杀。 但是，这又有什么关系？如果留下来，他的生命同样毫无意义。 “好的，”他告诉传授人，“就这么办。我应该做得到。无论如何，我尽力就是了。但是，我希望您跟我一起走。” 传授人摇摇头：“乔纳思，”他说，“过去这些世代，整个社区一直仰赖记忆传授人来为他们保存记忆。过去这一年，我已经把很多记忆转移给你了。我不能再要回来，一旦给出去，就不能再要回来。 所以，如果你逃跑了，成功走掉了——乔纳思，你要知道，你再也不能回来……” 乔纳思严肃地点点头，这是最难的决定，“是的，”他说：“我知道。不过，如果您跟我一起走……” 传授人摇摇头，示意他安静：“如果你走掉了，成功越过边界，你到了别的地方，那么整个社区就要自行背负这个大负担，接受你为大家承担的记忆。 我相信大家有这个能力，也能从中获取一些智能，但是冲击绝对是很大的。十年前我们失去萝丝玛丽时，她的记忆回到大家身上，引起一阵恐慌。那些记忆跟你获得的记忆比起来，实在是小巫见大巫。当你的记忆回到大家身上时，他们会需要帮助。还记得你开始受训时，面对从未有过的经历，我是怎么帮助你的吗？” 乔纳思点点头：“初次面对那些记忆，实在太吓人，伤害也太重了。” “那时候，你需要我；以后，大家也会需要我。” “没有用的，他们会再去物色一个人来代替我，重新立一位新的记忆传承人。” “但没有人能够立刻接受训练。当然，他们会加速遴选，但是我想不出来有谁刚好具备这些特质……” “有个小女生的眼珠子也是淡色的，但是她只有六岁。” “没错，我知道你指的是谁，她叫凯萨林。但是她年纪太小了，所以大家被迫要承受这些记忆。” “我要您跟我一起走，传授人。”乔纳思要求。 “不行，我一定得留在这里。”传授人坚定地说，“我也很想去，乔纳思。但是他们对所有的记忆毫无防备能力，我一走，社区里就没有人可以帮助大家，大灾难就会降临。他们会自我毁灭，所以我不能走。” “传授人，”乔纳思建议，“您和我，不必为其他人想太多。” 传授人带着疑问的笑容看着他，乔纳思困窘地低下头。 他们当然要为其他人着想，这才是这一切计划的真意啊。 “而且，无论情况如何，乔纳思，”传授人叹了一口气，“我都完成不了了。我现在非常虚弱，你知道吗？我已经看不见颜色了。” 乔纳思心碎了，他紧紧握住传授人的手。 “你看得见颜色，”传授人告诉他，“也拥有勇气，我会帮助你获得更多力量。” “一年前，”乔纳思提醒他，“当我刚晋升十二岁，刚开始看见颜色，您告诉我，您开始时的征兆跟我不一样，我到现在还不懂那是什么。” 传授人一听，面色顿时开朗了起来：“没错，你知道吗？ 乔纳思，虽然你现在具备了这么多知识，拥有这么多记忆，学习了这么多东西——结果，为什么你还是不懂？因为我有点自私，还没有转移这方面的记忆给你，我想保留到最后一刻“保留什么呢？” “当我还是个小男孩儿，比你还小的时候，我就开始感受到了。但我不是‘超眼界’，情况和你不相同，我经历的算是‘超听觉’吧。” 乔纳思皱皱眉头，努力想要弄清楚：“您听见的是什么呢？” “音乐。”传授人微笑着说，“我开始听见一些非常奇妙的声音，那叫做‘音乐’，我会在你离开前给你一些。” 乔纳思使劲地摇头：“不要，传授人，我希望您保留下来，在我走了以后可以有音乐陪伴您。” 第二天早上，乔纳思回到家，开心地向父母问好，而且很轻松地撒谎说昨晚有多忙、多愉快。 他的爸爸微笑着，也轻松地说着谎，表示昨天又忙碌又愉快。 在学校，他一边上课，一边在脑海里演练整个计划。昨天他和传授人一遍又一遍地推敲，直到深夜。 距离十二月的典礼还有两个礼拜，传授人会在这段期间，将有关勇气、力量的记忆传授给乔纳思。因为一定要有这两种记忆，他才能在远方生存。他们都知道这是一段艰辛的旅程。 乔纳思准备在典礼前一天的半夜悄悄离家。这可能是计划中最危险的一环，因为违反重大规定：除非公派外出，否则任何社区居民不准在晚上离开住处。 “深夜里，”乔纳思说，“食物回收员收完晚餐的剩菜，道路清洁员又还没开始工作，所以不会有人看见我，除非有人因紧急公务外出。” “万一被人发现，怎么办呢，乔纳思？”传授人问：“我虽然有各种逃跑的记忆，历史上也有很多避难事件，而且每件事的时空背景都不一样，可就偏偏没有跟这次类似的情况。” “我会非常小心的，”乔纳思说，“不会被人发现。” “你是受训中的记忆传承人，地位崇高，我想他们应该不至于太为难你。” “我会说是记忆传授人吩咐我去办一件很重要的事情，所以才这么晚外出，把责任推给你。”乔纳思开玩笑地说。 两个人都紧张地笑了笑。不过乔纳思很确定，他可以带几件衣服，神不知鬼不觉地从家里溜出来，静悄悄地骑上自行车，来到河边，把自行车和叠好的衣服藏在草丛里。 接着，他就步行，无声无息地穿过黑暗，来到安尼斯。 “这里没有晚班的工作人员，”传授人说，“门没上锁，你直接进来就行了，我会等你的。\"他的父母醒来后，会发现他已经走了。他们会在乔纳思的床上找到一张纸条，上面写着他沿河骑车散步，会在典礼前回来。 他的父母会有点生气，但不会警觉到出事了。他们会觉得他做事有欠考虑，打算等他回来再数落他。 他们越等越气，最后等不及了，只好先带莉莉去参加典礼。 乔纳思非常肯定地说：“不过，他们不会对任何人提起这件事，免得别人知道了，说他们没把孩子教养好。不管怎样，大家的焦点是典礼，没有人会注意到我的缺席，更何况我已经过了十二岁，正在受训，不用跟同学坐在一起，所以亚瑟会认为我跟父母，或是跟您在一起……” “而你的父母会假设你跟亚瑟，或是跟我在一起……” 乔纳思耸耸肩：“总之要花点时间，大家才会发现我不见了。” 一大早，传授人会请广播员帮他叫一部车和司机。他经常拜访其他社区，跟他们的长老开会：他的活动范围远达附近地区，所以这样的举止一点都不奇怪。 传授人通常不参加十二月的典上一次他所以出席，是因为乔纳思被遴选上，这件事又跟他有密切的关系。至于他平常的生活，本来就跟社区的运作不相干。不会有人对他的缺席有意见，或对他选在这天离开感到突兀。 等到司机和车子抵达后，传授人会找个理由将司机支开，再帮乔纳思躲在车子的行李箱里。传授人会在接下来的这两周从三餐中省下一些食物，让乔纳思带到路上吃。 典礼开始，所有的社区居民都在礼堂里。那时，乔纳思和传授人早已上路了。 快到中午时，乔纳思的缺席才会引起大家的关切。但是典礼不会因此中断——因为这不在计划中。不过他们会派人到社区各处搜寻。 在他们找到他的自行车和衣服之前，传授人已经回来了；而乔纳思在那之前，也已经独自一人踏上旅途了。 传授人回来后，会发现整个社区陷入迷惘和慌乱中。由于从未碰到过这样的事件，没有记忆可供参考，更没有智能判断该怎么做，他们只好向传授人求助。 他会来到人潮聚集的大礼堂，步上台阶，严肃地宣布，乔纳思已经坠河失踪了，并马上举行哀悼仪式。 “乔纳思，乔纳思……”他们先是大声地呼唤，就像上次呼喊凯尔博一样，再慢慢让乔纳思从他们的生活中淡出。 方式是传授人引导大家念诵，通过全体复述他的名字，让声音渐慢、渐柔，直到他仿佛从大家心里消失不见，直到他变成大家口中偶发的一句呢喃。在漫长的一天结束之前，他就永远地消失，再也不会被提起。 大家的注意力会转移到来袭的记忆，传授人会协助大家度过难关。 “当然，我了解他们很需要您。”在经过长时间的讨论和计划后，乔纳思说，“但是，我也很需要您。请跟我一起走。” 即使已经知道答案，他还是不放弃希望。 “当我协助整个社区作出改变，让生活更完整后，我的工作就结束了。“传授人温和地回答。\"我非常感激你，乔纳思，如果没有你，我永远也想不出该如何改变。你现在必须扮演好逃跑者的角色，而我的角色就是留下来。” “但是您不想跟我在一起吗，传授人？”乔纳思悲伤地请求着。 传授人抱住他：“我爱你，乔纳思。”他说，“但是我还有别的地方要去。当这里的工作结束后，我想去跟我的女儿在一起。” 乔纳思本来忧郁地盯着地板，听到这里不禁惊讶得抬起头：“我不知道您有女儿，传授人！您只跟我说您有配偶，我从不知道您也有女儿。” 传授人微笑了起来，点点头。相处了这么长一段时间，乔纳思第一次看见他露出真正快乐的笑容。 “她的名字叫萝丝玛丽。”传授人说。","sourceLink":"http://novel.tingroom.com/shuangyu/1208/36352.html","bookId":18,"book":{"id":18,"title":"The Giver 记忆传授人","description":"简介： 《记忆传授人》是一部科幻小说，2014年科幻电影。描写的故事发生在一个乌托邦世界里。在这个世界里一切事情都在控制之中，人们安居乐业，衣食无忧，也没有战争或痛苦的感觉．大家所要做的事情早在一开始就被确定好，没有改变的可能。孩子们都在规定好的统一模式里长大。...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/1208","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
