{"id":594,"no":44,"title":"第二十二章 亲身体验","content":"景观渐渐变了，刚开始很细微，并不容易察觉，只觉得道路窄了，也更崎岖了，很久没有人维修的样子。接下来，骑在自行车上也不容易平衡了，前轮老是辗过一些石子和坑洞。 \n \n 有一天晚上，乔纳思撞上石头，跌了下来。他赶紧伸手护住加波，幸好小宝宝牢牢地绑在座椅上，没有受伤，只不过在自行车倒地的时候吓了一跳。但是乔纳思的手腕扭到了，膝盖擦伤了，鲜血从他擦破的裤管滴了下来。他痛苦地直起身子，扶起自行车，并仔细检査加波的身体。 \n \n 他逐渐淡忘了对侦察机队的恐惧，开始在白天上路，但是新的恐惧又出现了，因为不熟悉的景致，隐藏着他难以理解的危险。 \n \n 树木越来越多，道路边的森林漆黑、浓密又神秘。溪流不时出现，他们也经常停下来喝水。乔纳思小心地洗着受伤的膝盖，碰到擦伤的皮肉时，忍不住缩了一下。原本肿大、疼痛的膝盖，在冷冽的山涧溪流浸泡下，终于慢慢地消肿、不痛了。 \n \n 他重新体认到，加波的安全全靠他的毅力。 \n \n 有一天，他们看见从没见过的瀑布，也看见从没见过的野生动物。 \n \n “飞机！飞机！”加波大叫。乔纳思虽然已经好几天没有看见飞机，耳边也没听见飞机引擎的声音，他还是不加思索地冲进树林，将自行车停在灌木丛里，然后伸手捉住加波。加波胖胖的小手指向天空。 \n \n 他惊恐地抬起头来。还好，不是飞机。他从没亲眼见过这样的生物，但透过他那日益消退的记忆，他认出那是经常出现在传授人记忆库中的动物——鸟。 \n \n 很快，路边出现了很多飞上飞下、啁啾鸣叫的鸟。他们也看到鹿。有一次，看见一只有着红棕色皮毛、一条粗尾巴的小动物，站在路边好奇地看着他们，一点也不害怕。乔纳思不知道叫什么，就放慢自行车的速度。他们彼此好奇地张望着，直到那只小动物转身，跑进森林里不见了踪影。 \n \n 所有的事物是如此新奇，让他内心充满敬畏。过去的生活单纯到每桩事都可以预期，现在竟然是每转个弯都会遇见令他惊奇的事物。他一次又一次地放慢自行车的速度，充满欣喜地看着路边的野花，欣赏着身旁小鸟婉转的歌唱，或风儿吹动林间树叶的姿态。在社区生活的十三年间，他从未经历过这般生动的幸福与快乐。 \n \n 但是，他的内心也同时隐藏着绝望的恐惧。最大的恐惧是他们可能挨饿。现在他们远离耕作区，已经不太可能找到食物了。他们上次在最后一个耕种区收集来的马铃薯和胡萝卜，存量不多，吃完以后，就什么都没有了。最近，他们经常饿着肚子。 \n \n 乔纳思跪在溪边，想用手去抓鱼，但徒劳无功。于是改用石块砸，结果还是无效。他失望极了，但依然绞尽脑汁,利用加波毯子上的绳子，缠住一根根弯弯的枯枝，做出一张代用鱼网。 \n \n 经过无数次的尝试，这张鱼网竟然捕到两条滑溜溜的小银鱼。乔纳思找了一块尖锐的石头，把鱼切成小段，一些喂加波，自己也吃一些。他们还吃了一些莓子。本来还想捉一只鸟，但是没有成功。 \n \n 到了晚上，加波安稳地睡在他身边，乔纳思却睡不着，饥饿折磨着他，让他想起以前在社区时，每天每户人家都可以收到餐点。 \n \n 他试着运用逐渐模糊的记忆，自己创造出一份大餐，还加上短暂的扑鼻香味：陈列着大块烤肉的宴会；摆满了厚厚奶油蛋糕的庆生会，结实累累的水果迎着阳光垂挂在枝头。 \n \n 但是当记忆退去的那一刻，痛苦、噬咬心田的空洞立即漫上他的心头。乔纳思突然闪过小时候的记忆，他曾经因为用错一个“饿死了”的词，而被严厉地责骂。大家告诉他，你绝不可能饿死。 \n \n 现在他就快要饿死了。如果他仍留在社区里就不会有这样的遭遇。事情就是这么简单，他曾希望可以选择，但真正面临选择的机会时，他却选错了。他选择离开，所以现在要挨饿。 \n \n 如果他留下来…… \n \n 他继续思考，如果他留下来，他会在其他方面挨饿，也会因为生活中缺乏感觉、色彩和爱而处于精神上的饥饿状态。 \n \n 加波呢？加波如果还留在那儿，根本连命都没了。所以那里不是选择留下的地方。 \n \n 吃不饱，让乔纳思骑起自行车来，犹如在打一场硬仗。 \n \n 他同时体认到他正在翻越长久以来梦寐以求的事物：山丘。 \n \n 他奋力地蹬着自行车，受伤的膝盖传来阵阵抽痛，但他还是拼命向前。 \n \n 气候也跟着变了，一连下了两天的雨。乔纳思不曾看过雨，虽然他在记忆中经历过，也很喜欢雨，很享受那冰凉的感受。但现在可不同了，他和加波又冷又湿，衣服一直干不了，就连偶尔露个脸的太阳也无济于事。 \n \n 在这段漫长、可怕的旅程中，加波都没有哭，直到这一刻，饥寒交迫，身子虚弱，他才哭了出来。乔纳思也哭了，除了和加波相同的理由外，他流泪是因为害怕自己救不了加波！他已经不在乎自己了。 \n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/1208/36356.html","bookId":18,"book":{"id":18,"title":"The Giver 记忆传授人","description":"简介： 《记忆传授人》是一部科幻小说，2014年科幻电影。描写的故事发生在一个乌托邦世界里。在这个世界里一切事情都在控制之中，人们安居乐业，衣食无忧，也没有战争或痛苦的感觉．大家所要做的事情早在一开始就被确定好，没有改变的可能。孩子们都在规定好的统一模式里长大。...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/1208","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
