{"id":30968,"no":35,"title":"Volume One—Chapter Thirty Two.","content":"A Tale of the Plains of Errur. Aylia was the comeliest of the dark-eyed daughters of the desert. Sixteen tropical summers had already ripened a form modelled in that exquisite perfection which nature is wont to bestow upon her wildest works, and the native symmetry of the sylph-like maid was yet unblemished by any of those barbarous improvements wherein her nation delight. Her sparkling eye, fringed with long silken lashes, in brilliancy eclipsed the pet gazelle that ever bounded by her side; and the graceful gambols of the sportive fawn would seem to have been inspired by the fairy footstep of its blooming mistress. Luxuriant hair fell in elf-like tresses over her ebon shoulder. Teeth of ivory whiteness were revealed by a radiant smile that ever played over her animated features; and few indeed of her virgin charms were veiled under the folds of the slender drapery that belongs to the Bedouin shepherdess. (Note 1. The following narrative, recounted by one of the Wóema escort, although necessarily enlarged, is as strictly literal as the embodiment of the subject would admit; and it will convey to the English reader a better picture of life in the desert than could be painted in a less connected form.) The maid tended her father’s flocks in the vale of Errur, which forms a constant scene of predatory incursion on the part of the ruthless savages that hover round the border. When least expected, the Galla war-hawks of the adjacent mountains were wont to stoop from their rocky fastnesses, and to sweep away the riches of the Wóema. The treacherous Eesah, although ready to extend the hand which should have denoted friendship, was nothing loath to the appropriation of other men’s chattels; and throughout all the nomade Adel hordes, whose tents were erected during the more sultry months, the feud and the desultory skirmish favoured the inroads of the foe. Amongst the surrounding clans, even her own tribe was not notorious for its honesty, and by frequent depredations abroad, it invited the foray of reprisal. Thus the brawl and the mortal encounter would follow the stillness of indolent existence with a rapidity not less startling than frequent, and none knew what the next hour might bring forth. But fear had no place in the breast of the daughter of old Ali. Nursed in the lap of strife, the Bedouin blood of her roving sire coursed through her young veins, and she pursued her Arcadian occupation beneath the spreading boughs of the venerable acacia, chanting to her gazelle the wild ditty that revealed the thraldom of her heart, or listening to the bleat of her black-faced lambs from the Hejáz. Often had the shrill war-whoop rung through the wild valley, and the rush of the gathering warriors who flew to answer the summons, arrested her plaintive song, but only lately had it caused her to spring to her feet with a bosom throbbing audibly; and now she would sigh as she sank again upon the smooth bank that formed her favourite seat, for the swain for whom her soft eyes had been strained across the flickering desert was not among the number of those that had swept past, and she knew not why, nor whither he had gone. Many were the ardent suitors who had wooed the hand of the blooming Aylia, and often-times had she been sought from her avaricious father, who viewed the still expanding attractions of his daughter as a certain source of increase to his ill-gotten and idolised wealth. None, however, had yet been able to produce the price set upon the damsel’s charms, neither had any possessed an advocate in her eloquence. Her heart had already been tacitly relinquished, but her hand she knew to be in the gift of her sire, and therefore not her own to bestow. Ambeesa it was who had silently gained this ascendancy over the green affections of the maid. The milch goats of Irripa, his mother, were by her driven daily to pasture, and his wigwam was within spear’s throw of her own. The twain had known each other from earliest infancy, for they came upon the world’s stage in the self-same hour. They had feasted and they had played together as children; and now that their young hearts had become entwined, it was his wont to accompany the nymph into the vale, where they would hold converse the livelong day. The vapid language of the savage admits of but a limited embodiment of the softer passions; but the simple courtship of the uncultivated was ably sustained. Aylia felt the force of her charms when she saw the warrior grasp the spear and the shield, without which no Bedouin ever crosses the threshold of his cabin—in order that he might chase the fawn that she had coveted; or when he drew water from the well in her gourd, to replenish again and again the ox-hide that formed a drinking trough for her thirsty flock. And Ambeesa felt himself amply rewarded when the slender fingers of the blooming girl decked his hair with the aromatic herbs that she had plucked in the wild meadow, or she counted over the ewes that they were shortly to possess in common. Ambeesa was ever in the foremost rank when the spear was thrown over the shoulder of the brave; and successful in every foray, he had won wealth as well as fame. None appeared more frequently in the many-tailed leopard spoils which form the garb of victory; and the white feather always floated above his raven locks. But his father having been treacherously murdered by the Eesah, a blood feud clung to the old man’s sole descendant; and it formed to him a source of self-reproach, that although he had for years dogged the footsteps of the assassin, the opportunity had never yet occurred when he might wash out the stain! A skulker amongst his clansmen at a distant oasis, the cowardly savage had profited of his deep cunning to baffle the creese of the avenger; and he still vaunted his trophy of blood without any account of its acquisition having been required. But the day of reckoning and of retribution was now nigh at hand. The mother of Ambeesa had counted out the dowry demanded of any who should espouse young Aylia, and had claimed the girl as her daughter-in-law elect. At the sight of the beeves and the fat rams and the trinkets and the trumpery cloths, the sole remaining eye of the old sheikh glistened with a lustre that it had not known for years; but his haughty soul could ill brook the thought of his daughter being wedded to one whose father’s death thus rested unavenged. “Get thee hence, young man,” he exclaimed sternly, shaking his silvered locks, after a short inward conflict with his avarice—“Get thee hence, nor show thy face again within my doors as a suitor until thou hast appeased the spirit of thy murdered sire. The blood of him to whom thou art indebted for existence crieth aloud to thee for vengeance; and Wulláhi, until the grave of Hássan shall have been soaked by thy hands, thou shalt not talk to Ali of his daughter.” Ambeesa sought not his dark mistress, but snatching the spear and buckler which had been carefully deposited in a corner of the cabin, stalked forth without uttering a syllable. Passing his own hut in mental abstraction, he took the road to the brook, and throwing himself upon his face, drew a deep draught to allay the fever that consumed him. Then whetting his brass-mounted creese to the keenest edge upon a smooth stone, he muttered a dread oath betwixt his clenched teeth, and strode moodily across the sandy plain. The great annual fair had already assembled at the sea-port of Berbera, and tribes from all parts of the country were flocking thither with their motley wares. The curious stalls of the fat Banians from India were thronged from morning until night with barbarians from the adjacent districts, who brought peltries and drags to be exchanged; and the clamour of haggling and barter was hourly increased by the arrival of some new caravan of toil-worn pedlars from the more remote depths of the interior, each laden with an accession of rich merchandise to be converted into baubles and blue calico at a clear net profit to the specious Hindoo of two hundred per cent. Myrrh, ivory, and gum-arabic; civet, frankincense, and ostrich feathers, were piled in every corner of his booth; and the tearing of ells of Nile stuff and Surat cloth, and the counting out of porcelain beads, was incessant so long as the daylight lasted. Withered beldames, with cracked penny-trumpet voices, were meanwhile actively employed in the erection of new edifices; and more and more camels were ever pouring towards the scene of primitive commerce, loaded with the long elastic ribs, and the coarse date matting which form the skeleton and shell of the nomade’s wigwam. It was dusk when Ambeesa entered the long centre street of this busy scene. He had journeyed many days alone and on foot, and his mantle and his arms and his lofty brow were alike deeply stained with the disguising dust of the desert. A gang of Bones, with a stalking ostrich, driving before them sundry asses laden with the spoils of the chase, arrived at the same moment from the opposite direction. Rude parchment-covered quivers, well stocked with poisoned shafts, hung negligently by their side, suspended by the tufted tail of a lion, and with their classic bows over their wiry shoulders, the gypsey votaries of Diana advanced swearing and blaspheming towards the Eesah quarter of the straggling encampment. The light which gleamed through the black goat-hair awning of a Guráguê slave-merchant, fell upon the features of the wild party as it passed; and Ambeesa’s heart beat high with exultation when, in the person of one whose matted locks were decorated with a dirty ostrich plume, he fancied he could recognise the very foe of whom he was in search. The archer was in truth a most truculent-looking knave—one who, if his visage did not strangely belie him, might have been the perpetrator of any given atrocity. The tail fat of four Bérbera rams encrusted his head in a perfect helmet of tallow, and the putrid entrails of the antelope he had last slain, were slung in noisome coils about his neck, to the pollution of the atmosphere he breathed. His repulsive front displayed through the accumulated filth of forty years a perfect maze of mystic figures in tattooed relief, on which were imbedded amulets stitched in greasy leather; and the distended lobes of his enormous ears were so loaded with pewter rings, that not another could have been squeezed in. A gap, consequent upon the loss of five front teeth in a recent brawl, made room for a quid of no ordinary dimensions. Two small sunken blear eyes, which appeared to work upon a swivel, squinted alternately, as the inflamed balls were revealed by turns according to the employment of the wearer’s sinister vision; and on his meagre sunken cheek yawned a seam five inches in length, which precisely corresponded with a gash known to have been inflicted by the youth’s father during a certain moonless night at Errur, when a stab in the back had aroused the veteran from deep sleep to his mortal struggle. “Stay you here, Moosa,” quoth one of the bowmen, addressing this captivating hero, as they stopped before the doorway of an unfinished cabin at no great distance beyond the rover’s pall,—“tarry you here, and Inshállah, we’ll turn out these lazy wenches to unload the asses.” The name had not been lost upon Ambeesa, who, like all of his bigot creed, placed the firmest reliance in fate. He had sworn never to return until he should have given the body of Moosa to the wild beasts, where the vultures might pick out his eyes. The object of his weary journey was by the interference of destiny in his favour, already within his clutches. He who murdered his sire was assuredly alone with him in a dark lane, and Aylia was without doubt his own! “Wogérri maani, wogérri maani, wogérri maani” repeated the Wóema coldly, as he extended his open hand towards the doomed victim in token of amity. “Wogérri, wogérri, wogérri,” carelessly returned the savage thus accosted, at the same time passing his greasy fingers mechanically over the palm presented. The same triple salutation again reiterated, was thrice returned; and it gradually dwindled away to an assenting “um hum,” in itself fully as frigid as the wearisome repetitions of inquiry had been deeply treacherous. Moosa stooped to shake the pebbles from his dilapidated sandal. His bare back was towards the Wóema, for his garment had fallen from his brawny shoulder. It was enough. Muttering through his closed teeth an inaudible invocation to Allah, Ambeesa suddenly drew his creese, plunged the razor-edged blade to the very hilt into the yielding spine of his unsuspecting foe, tore the vaunting white feather from his greasy locks, spumed the prostrate carcase with his foot, spat upon the unseemly features now distorted in the agonies of death, and fled into the wilderness. Months had elapsed, and the festive season had now returned at which the Bedouins annually celebrate their weddings. Many a dark-eyed damsel had been led by her happy swain to the nuptial wigwam, when a gayer procession than usual was to be seen passing up the centre street of the encampment at Ga?el. Eight wrinkled matrons led, brandishing swords and creeses with truly Amazonian gestures, whilst they danced to a wild song in which all joined chorus to the dissonant thumping of a kettle-drum. The charms of the maiden bride who followed, and had been long betrothed, were screened from vulgar gaze beneath a canopy of blue calico, home by a party of the village belles, splendid with porcelain jewellery and grease—their arms, like those of the sister Graces, entwining each other’s waists; whilst every idle blackguard that could be mustered, swelled the nuptial train. At intervals, the music of the tambourine gave place to a shrill vocal solo, when the nymphs pirouetted in a mazy circle; and the procession, after thus parading through the hamlet, was preceded on its return by a party of dirty urchins bearing the dower in ornamented baskets woven of the wiry leaf of the palm. Massive ear-rings of brass and copper were amongst the treasures, and the much-prized, though far from becoming coif of blue calico which forms the badge of the wedded wife, had not been forgotten. Aylia was still the fairest of all the daughters of her tribe, and Ambeesa ever the foremost when the spear was thrown over the shoulder of the warrior. Happiness and content reigned in the rude hut. No harsh word had ruffled the existence of the young pair, and the stranger never passed the door without the ready draught of milk being proffered, or the kind word exchanged. But in accordance with the barbarous usage of the Adel Bedouin, the wife was to remain an inmate of her father’s dwelling, until she should have become the mother of three children. ’Twas mid-day in the sultry summer months, and the fiery sun poured his fiercest rays from his meridian throne. No human eye was able to endure the broad glare that pervaded the vast sandy plain of Errur, which at intervals was scoured by towering whirlwinds, imparting the aspect of a manufacturing town with its huge steam-engines at work. All animate nature shrank under the scorching heat, which had even curled the few scanty tufts of withered vegetation. The stillness of death pervaded a desolate scene over which floated the treacherous mirage. Not a creature moved, and no sound was heard save the roar of the angry whirlwind tearing every thing before it, as it swept in reckless wrath across the encampment, eliciting while it raged among the frail mat tenements of the location—unroofing some and filling others with dust and pebbles—a curse from the drowsy savage whose rest it had disturbed. Suddenly a shrill cry arose in the distance, the well-known tocsin for the assembly of the men-at-arms. Electrical in its effect, every slumberer started to his feet, and each hut, which had for hours been silent as the tomb, poured forth its warrior, armed and ready for the fight. On the verge of the plain was descried a band of the Alla Galla driving off a troop of camels, and with the points of their spears goading the awkward animals to a grotesque gallop. Their remoteness, and the unnatural speed to which they had been urged, imparted, through the medium of the mirage, the appearance of dismembered animals flying in portions through the deceptive atmosphere. Now a head attached to a long neck was separated from the body, and elevated many feet above its proper place; and now animated legs of exaggerated length could alone be perceived flitting fast over the sultry desert. Unattached tails danced in the quivering vapour, and the entire distance was alive with fragments of men and dromedaries, which seemed to have been hurled through the air by the bursting of an exploded mine. Galla and Wóema, pursuer and pursued, scoured for some hours over the sandy waste; and it was near sunset when the pagan marauders were overtaken on the confines of their own territories. A sharp conflict ensued; and two on each side having fallen, the booty was retaken, and the unbelievers put to flight by the sons of the Faithful. From the door of her father’s wigwam Aylia watched with inward misgivings the return of the victors; and as she saw the bodies of the fallen borne upon the shoulders of their comrades, her young heart throbbed audibly, for her newly-wedded husband was one of those who had gone forth. As her straining gaze fell upon the still gory corse of him she loved, a flood of hot tears dimmed her lustrous eyes, and uttering a piercing shriek, she sank senseless at the threshold. Roused again to life, the bereaved girl filled the hut with her doleful cries, and shriek succeeded shriek as she bewailed her fallen condition. Death would indeed have been almost preferable to the lot accorded by her destiny. The property brought at his marriage by the deceased was resumed by his grasping relatives, and the late light-hearted wife became once again a slave under the roof of her avaricious parent, there to lead a life of drudgery until another wealthy suitor should pay the dower fixed upon her charms. But the light elastic step was gone, by which Aylia had erst been distinguished above all the Wóema maidens. The full black orbs had lost their wonted lustre, and the radiant smile no longer beamed over her faded features. The orphan pledge of her first love clung to a widowed breast, and the heart that beat beneath was broken by the untimely fate of the brave youth Ambeesa.","sourceLink":"http://novel.tingroom.com/jingdian/2355/65679.html","bookId":437,"book":{"id":437,"title":"The Highlands of Ethiopia","description":"简介： It was late on the afternoon of a sultry day in April, which had been passed amid active preparations, when a dark column of smoke, streaming over the tall shipping in the crowded harbour of Bombay, proclaimed the necessity of a hurried adieu to a co...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2355","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
