{"id":30986,"no":53,"title":"Volume Two—Chapter Four.","content":"Special Summons to Machal-Wans. His Majesty had more than once intimated an intention of holding consultation relative to his projected expedition on the termination of winter, and early one morning an express courier arrived to desire our immediate attendance at the palace. Blacksmiths and workers in silver were as usual plying their craft in the verandah, under the royal eye—artists were daubing red and yellow paint over the pages of the Psalter, or illuminating the lives of the saints with white angels and sable devils—saddles and warlike furniture were in course of repair—spears were being burnished—gun-locks cleaned—and musket barrels engraved with the despot’s name; but the artificers were all summarily dismissed, and the king, rising from his seat in the portico, beckoned us to follow into the audience hall. “Gaita,” “master,” he cautiously began, “there is yet another subject upon which I am desirous of taking counsel, and wherein I need your assistance. It is my intention shortly to undertake an expedition to the great lake in Guráguê. In it be many islands which contain the treasures of my ancestors. There are jars filled with bracelets of solid gold. There are forty drums made of elephants’ ears, and many holy arks pertaining unto ancient churches, besides seven hundred choice Ethiopic volumes, some of which have unfortunately been defaced by the animals called ashkóko (Hyrax Abyssinicus). Elephants abound on the borders. In the trees are found black leopards of a most ferocious nature, multiplying always among the branches, and never descending upon the earth; and the waters of the lake, which are smooth as glass, and without bottom, teem with monstrous gomári (Hippopotamus amphibius), and with fish of brilliant colours, red, yellow, green, and blue, such as have never before been seen. “Moreover there are specifics against small-pox and other dreadful diseases. No resistance is to be anticipated, for the inhabitants, who are chiefly Christian monks, have often invited me. I must no longer delay to recover the lost wealth of my forefathers, and it is fitting that you, with the British officers who have come hither from a far country, should accompany me and construct boats. Hereof my people are ignorant, and your name as well as mine will therefore become great, and will live in the annals of this kingdom. “From the summit of a lofty hill near Aiméllele, I have beheld through a telescope the lake and its tall trees, but the elephants came in numbers. I feared that my people would be destroyed. I ran, and they all ran with me. Now, what say you? What is your advice in this matter? Are you able to build boats?” In furtherance of His Majesty’s intentions, I caused models of skin punts, gun rafts, and a pontoon train, to be prepared upon the most approved design, with crews and ordnance complete, and advised that every requisite should be prepared at Ankóber whilst leisure served, in order that he might take the field with ample means at his disposal. The king expressed himself above all things pleased both with models and advice, which he declared to come from wise and expert soldiers; but he was still obviously undecided, and the fear of wild beasts and of the lone forest at length kicked the vibrating beam. The castle visions of glory mounted far out of reach, and his fickle ambition evaporated in a bluster of empty words— “My people will weep at the carriage of such ponderous engines.” “The preparations must be made on the banks of the Háwash, or on the borders of the Lake Zooai, where timber grows abundantly. A man of rank, one of the frontier governors, who resides near Aiméllele, should be summoned as guide to the expedition, and might then be consulted.” But the presence of the great functionary was ever wanting—no further wish escaped the lips of the vacillating monarch—and engrossed with the passing whim of the moment, the chivalrous project of the day had vanished. So passed the dreary winter on. The arrival in the kingdom of Shoa of the many valuable presents brought by the Embassy, had not proved more agreeable to the traders from Gondar and Tigré who reside in Ankóber, than to the narrow-minded governor of Alio Amba. These men had been in the habit of selling glass-ware, cloths, and fire-arms to the king at a very considerable premium, and now did not fail to repeat and to improve the absurdities circulated by the mischievous Danákil regarding the foreign intruders. The Gypzis were pronounced eaters of serpents, mice, and other reptiles, and had come with the design of possessing themselves of the country by the aid of magic and medicine. Great umbrage was taken at our practice of toasting the wretched half-baked dough which we received, under the denomination of bread, from the royal stores; and a soldier who carried a metallic pitcher to the stream, was roundly taxed with having used charms to poison the water, which was consequently condemned as unfit for use until purified by the blessing of the priest. Predictions of the impending fate of Abyssinia were derived from the fact of the foreigners employing instruments which read the stars; and the despot was repeatedly and earnestly warned to be upon his guard. But His Majesty cut short these insinuations by threatening to extract the tongues of three or four of the maligners, and paid no attention whatever to the threat of excommunication extended to him by the fanatic clergy of Arámba, who had declared the ban of the Church to be the just punishment due for the admission into the empire “of red heretics, who ought carefully to be shunned, since they practised witchcraft, and by burning the king’s bread threatened to bring a famine upon the land.” Taking their cue from the feelings of the people, the Shoan sorcerers gave out that Sáhela Selássie was to be the last of the Ethiopian dynasty, descended from the house of Solomon, who should sit upon the throne of his forefathers, and that a foreign king would come by way of Alio Amba to usurp the dominion. It is, amusing to trace the progress of these crafty insinuations among an ignorant and weak-minded people. In some of the northern provinces it was confidently asserted that the Sultán of the Mohammadans had already conquered Shoa, and that all the surrounding Moslem potentates were about to unite with him in a war of extermination against the Christians; whilst in others it was believed that an Alaka, or chief of the Gypts from Grand Cairo, had contrived to smuggle himself into the capital, carrying his sovereign in a box, and that after consulting the heavenly bodies until a favourable horoscope was presented, he stamped his foot upon the ground, which opened, and ten thousand red soldiers, with beards flowing to their girdles, springing forth out of the chasm, placed the aforesaid monarch upon the throne. “Now,” said the magicians, “will Theodórus arise according to the tradition, that he will come in the latter days of -Ethiopia, and create a kingdom of Peace.” Theodórus was one of the emperors who reigned during the fifteenth century, and was canonised. It is recorded, that during the observance of his festival the queen-dowager had prepared a great entertainment, and the guests being all assembled, the heavens rained down a shower of fishes ready roasted. In the Ethiopic liturgy, the miracle is thus commemorated. “Peace be upon thee. King of the Agaazi nation, Theodórus, Son of the Lion; thy memory shall this day be celebrated with the slaughter of oxen and sheep, with which alone Zion Mogáss, thy mother, kept it not, for the clouds also dropped fishes.” It is confidently believed that this saint will rise again from the dead, and reign a thousand years, during which period neither war, famine, nor discord, is to disturb the happiness of Abyssinia.","sourceLink":"http://novel.tingroom.com/jingdian/2355/65697.html","bookId":437,"book":{"id":437,"title":"The Highlands of Ethiopia","description":"简介： It was late on the afternoon of a sultry day in April, which had been passed amid active preparations, when a dark column of smoke, streaming over the tall shipping in the crowded harbour of Bombay, proclaimed the necessity of a hurried adieu to a co...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2355","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
