{"id":30998,"no":65,"title":"Volume Two—Chapter Sixteen.","content":"Massacre of the Christians at Chérkos. \\n\\n \\n\\n The verdant meadows of the Shoan district of Dággee are strangely crossed and intersected by low chains of barren rock, with here and there an isolated hillock crowned by the abode of the Christian farmer; whilst between each little eminence rolls the lazy brook, winding sluggishly over the flowery plain, as if reserving its energies for the thundering leap into the great chasm of the Chácha. \\n\\n \\n\\n Broken, craggy, and desolate, this mighty abyss sinks upwards of a thousand feet abruptly from the plain. Its giant sides are in part slightly fringed with moss or sweet-scented thyme; and a few small huts dot the narrow ledges; but the wolf and the hyaena chiefly tenant the dark fissures, whilst the vulture screams her death note over the yawning gulf. Superstition has wrapped the beetling cliff and the gloomy ravine in her dark embrace, for here the captive toils in the bowels of the earth to procure the stubborn iron. The clang of the dreaded smith disturbs the stillness of day; and the chant of the hymn rises solemnly in the morning mist from the adjacent church of the Saviour, which stands embosomed in a dark grove of junipers. Far down in the bottom, the Chácha appears like the small murmuring mill-stream, although the accumulated waters of a broad plateau are there rolling on to swell the mighty Nile; and at frequent intervals the mountain torrents pour their tribute over the frowning scarp, which for miles forms the impregnable fortification of the land. \\n\\n \\n\\n Near the commencement of this stupendous precipice, and barely a gunshot from its brink, stands Angollála, the Galla capital of the kingdom, commanding the upper pass into the Christian land. Three small hills which rise abruptly from the plain, and enclose a circular area, had been judiciously selected as a site by the wary founder, but the settlement was at this date in all the disorder of infancy. Only a few hundred hovels, composed of most flimsy materials, had been hastily erected on the sloping sides of two of the hillocks; but the smallest was distinguished by the more imposing edifice dedicated as a church to the Ark of the Holy Covenant, and its table summit was crowned with an ample residence for the Negoos. \\n\\n \\n\\n A few trees raised their stunted heads above the thatch of the various kitchens and storehouses, which were crowded thick over the crest, and the flowering umbár threw a broad zone of fragrant lilac blossoms around the royal buildings. Stones and rocks, strewed plentifully in every direction by the hand of nature, formed a considerable impediment to the rapid advance of horsemen; and stout heavy wooden palings, which descended in a double or treble row far down the slope, completely screened the inmates against any sudden surprise from the border foe. \\n\\n \\n\\n A wide meadow stretches from the palace tumulus to the very brink of the abyss; and on the opposite height is situated the lovely village of Chérkos, which, from its beauty, had been formerly designated by the Galla “The Queen of the Hill.” Sheltered by a magnificent grove of evergreens, the hamlet overlooked the pleasant slope which extends to the verge of the precipice, gaily diversified with rich fields of cultivation and plots of green pasture land. It had been captured from the heathen by the last king of Shoa; and although colonised by favourite Christians of the court, the revenues were bestowed upon the church of the Saviour, which had been erected immediately below the village, in the dark depths of the Chácha ravine, and which was now under the direction and guidance of Father Asrát. \\n\\n \\n\\n The hazy sun had sunk beyond the dark waters of the muddy Nile; the rivulets were trickling in discoloured streams from the surrounding hillocks, to form a temporary lake in the enclosed amphitheatre, and each reeking thatch sent up its tribute to the cloud of thick mist, which was fast settling over the low hills of Angollála. The meadow brooks were swollen to the brim, and the long plains, brilliant with verdure, presented a pleasing prospect to the eye, although a most treacherous surface to the incautious foot. The monsoon was indeed raging in violence over the land; and according to custom, the monarch, thinly attended by his household officers and establishment, alone occupied the palace. All the governors and great men had taken leave and departed to their respective provinces, the capital was well nigh deserted, and as night closed in, the few remaining serf inhabitants were seeking a dry corner in their frail huts, to shiver through the weary hours of darkness. \\n\\n \\n\\n As the moan of the wind is heard preceding the coming storm, so the hum of a confused multitude first struck upon the practised ear of the vigilant. The alarm was quickly spread by the fierce baying of the dogs. The chant of the singer suddenly ceased within the palace, and the king, followed by all his attendants, rushed to the southern palisade. Then was distinctly heard the clattering of hoofs over the opposite heights above the Chácha, as the pagan host surrounded the devoted hamlet of Chérkos. The glare of light and the faint wreath of smoke next succeeded, as the torch spread from hut to hut. The wind blew cold and gusty, and the flames wheeling in fearful eddies through the mist, revealed at intervals the cliff and the crag, and the peaceful church reposing amid the dark grove of junipers, hitherto unpolluted by the foot of the Gentile. \\n\\n \\n\\n The wild shout of triumph, mingling with the shrill shriek of despair, now rolled in fitful notes across the intervening plain. The whole firmament was illumined by the flames of the burning village, and they were witnessed in terror by the assembled inmates of the palace; for the sacred precincts of the church itself had now been invaded, and a group of priests in their last extremity could be distinctly seen, surrounded by a mass of the savage foe. But the next eddy of mist from the boiling cauldron that was interposed, shrouded the scene. \\n\\n \\n\\n The priest Asrát shuddered at the thoughts of his narrow escape, for he had only that morning quitted the sacred shelter. But the eyeball was in vain strained to see what was passing. Darkness rendered its efforts abortive. By degrees the flame expired, and one horrid shout of exultation from ten thousand wild throats rose over hill and dale, in earnest that the work of slaughter had been well finished for that night, and that numbers were not wanting for the morrow. \\n\\n \\n\\n Hurry and confusion reigned throughout the capital. The king was advised to avail himself of the protection of darkness, and retire to Ankóber; but his evening dream had been pleasant, and he was buoyed up by the words of the strong monk. “Shall I leave my children in the day of their distress,” he exclaimed, “and the seat of my fathers to be polluted by the accursed touch of the rebel? No; death is preferable to such disgrace.” The royal gates opened to receive the terrified inhabitants, who came flocking up the hill. Every matchlock was lowered from the walls of the great hall, and distributed amongst the young and able-bodied. Doors were barred and barricaded, and sufficient means of defence for a time seemed to have miraculously sprung from the untenanted location. \\n\\n \\n\\n The pens of the scribes were now wielded with vigour; and as each tiny letter, or token, or entreaty, was handed for approval, the wild horseman mounted on the moment, and his long hair streamed in the night breeze, as, floundering through the muddy outlet, he dashed at speed over the eastern plain. \\n\\n \\n\\n The pressing call for aid flew quick through the land. The love and the fear of the king brought governor and vassal to the rescue; and as hatred of the rebel’s insolence stimulated even the dullest to action, long before morning numerous bands from the immediate vicinity had formed, on the meadow, a living barrier between the beleaguered monarch and his stern foe. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2355/65709.html","bookId":437,"book":{"id":437,"title":"The Highlands of Ethiopia","description":"简介： It was late on the afternoon of a sultry day in April, which had been passed amid active preparations, when a dark column of smoke, streaming over the tall shipping in the crowded harbour of Bombay, proclaimed the necessity of a hurried adieu to a co...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2355","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
