{"id":31001,"no":68,"title":"Volume Two—Chapter Nineteen.","content":"The Galla Borders—Proclamation of War. \\n\\n \\n\\n Shortly after our departure from Ankóber, a robbery was committed in the residency; and the delinquents having been duly traced out by the Lebáshi, were sent in chains to Angollála, and incarcerated in one of the palace court-yards. The principal party proved to be a slave of the king, aided and abetted by a scribe, who had been for some time employed in copying manuscripts for Dr Roth; and the greater portion of the stolen property was shortly returned by the hands of the chief smith, who succeeded the disgraced page in the office of báldoraba. “Strangers have visited me from a far country,” was the message wherewith he was charged, “and whilst residing under my protection they have been plundered by my subjects. My name has become tarnished. I have beaten the culprits with sticks, and shall cut off the ears of the slave Wooseni, and sell him to the merchants of Hurrur.” \\n\\n \\n\\n Intercession, backed by presents, was successfully made with the king and queen, in behalf of the offender, a lad of ten years of age, and he was liberated after severe castigation. “God must be angry with me,” sobbed the juvenile thief, who had once before been detected beneath a bed with a pair of scissors in his possession—“God must be angry with me, for I have only twice attempted to rob, and on both occasions have I been punished.” \\n\\n \\n\\n Among the articles stolen, which consisted chiefly of beads, were sovereigns of William the Fourth and of Queen Victoria, and suspicions arising in the royal mind that these were not of gold, as asserted by Lieutenant Barker, His Majesty proposed testing the metal by the ordeal of fire. A coin of the former reign was accordingly thrust into the forge, and having then been immersed in water, was broken with a chisel by the conclave of smiths. “Call you this English gold?” exclaimed the Negoos: “here then is a piece of Abyssinian gold for you,”—and throwing upon the ground the brass foil of a sword scabbard, he laughed immoderately. A fourpenny piece was then exhibited, as a somewhat more portable and commodious medium of exchange than blocks of fossil salt, and the figure on the obverse immediately elicited the inquiry whether the queens of England went forth with their armies to battle, since Britannia was equipped with spear and shield, and was about to set a saréti in her crown like the warrior king of the Amhára. \\n\\n \\n\\n (The saréti is a sprig of wild asparagus worn in Shoa as a token of victory, as will be seen presently.) \\n\\n \\n\\n A quarrel of long standing between Ayto Melkoo and the commander-in-chief of the gun-men, who ranked among the foremost of the court sycophants, had been this day brought for adjustment before the royal tribunal. The award being found in favour of the appellant, the Master of the Horse, although a great favourite, was handcuffed, and imprisoned in the brewery, but after a few hours’ durance he was set at large, and his punishment commuted to a fine of seven hundred and fifty pieces of salt. “It is of no consequence,” he remarked somewhat unwisely, “I shall carry a mamalacha to the ‘commander,’ Captain Harris, and he will pay the amount for me.” \\n\\n \\n\\n This boast had given occasion to malicious insinuations on the part of his enemies, and after dark a confidential message was brought to me from the palace, to the effect that Ayto Melkoo stood suspected of concealing certain “pleasing things” understood to have been received from my hands. But this imputation, which, if confirmed, must have involved disgrace and confiscation of property, proved, fortunately for the accused, to have no foundation. \\n\\n \\n\\n A better instance could scarcely have been adduced to illustrate the fleeting and precarious nature of the despot’s smiles. The mother of this tottering favourite, a native of Ambásel in the province of Lasta, was for many years the mistress of Hatzé Yasoo, then Emperor of Gondar, on whose demise she became an inmate of the seraglio of Asfa Woosen. Ayto Wadi, the distinguished Galla governor of Angollála, being thrown into prison by the latter monarch, contrived to solace himself with the presence of the lady, and the Master of the Horse was the result of the intrigue. No disgrace whatever attaching to his illegitimate origin, he was regarded in the light of a member of the royal family; and, being brought up in the palace, has succeeded during three several reigns in maintaining a position at court, which might now have been sacrificed by the clandestine possession of a dozen ells of English broad-cloth. The amende was, nevertheless, made to him in the course of a few days, by the addition of another village to his landed possessions at Dóba. \\n\\n \\n\\n Such paltry proofs of espionage were invariably followed by some especial token of the royal goodwill, ushered in by a goat, or a jar of honey, as a peace-offering. In this instance, after the despot had been fully satisfied of the groundless nature of his surmises, I received a special invitation to accompany him the next day on a shooting excursion, a Galla ram, the size of a well-grown calf, having first been thrust into the tent by the bearer of the message—the dirty page Besábeh—who, as usual, composed himself to sleep in a corner after the due performance of his errand. \\n\\n \\n\\n Saturday, being the Jewish Sabbath, brings rest from all labour, and is invariably devoted by the king to excursions abroad. Starting on horseback at an early hour, a gallop of several miles led us across the Chácha, and over the border of the Galla dependencies, to an extensive, but narrow sheet of water, where an otter had lately been seen. “It has hands, and nails, and fingers like a man,” observed the monarch gravely, “and a head like a black dog, and a skin like velvet; and it builds its house at the bottom of the river, and plucks grass, and washes it in the water; and all my people thought it was the devil, and would destroy them with strong medicine. Now is this animal found in your country, and how do they call its name?” \\n\\n \\n\\n We amused ourselves by killing snipe, much to the entertainment of the monarch, who displayed little talent for shooting birds on the wing, and made no secret of many very unsportsmanlike ideas. Numerous ducks and geese soon arrested his attention. Drawing up with his retinue, and resting his weapon over the shoulder of an attendant to insure steady aim, he kept up a murderous fire with ball, shot, and slugs, during a full half hour. The weather was passing cold, and ever and anon His Majesty blew his nose betwixt his thumb and fore-finger, and wiped them on the mantle of the governor of Bulga, who eagerly proffered it for acceptance. A serious diminution in the numerical strength of the feathered fools resulted in no attempt to take flight or even to shift position. Incredible though it may appear, the living still paddled among the floating carcasses of their slaughtered comrades, as if nothing had happened, until the destroyer, weary of persecuting the “unclean birds,” which were not even taken out of the water, remounted and crossed the country at speed to a wide meadow, traversed by the serpentine Chácha. \\n\\n \\n\\n Bald coots were here playing at hide-and-seek, whilst red-headed divers peeped warily forth for an instant, as the noisy cavalcade advanced. The spoonbill, and the leather-necked ibis of Egyptian veneration, displayed their white plumage along the sedge-grown borders. The heron, the snakebird, and the redshank, waded through the shallow drifts; and geese, widgeon, teal, and mallard, rose whirring in the air at every step. But amidst all this inviting variety, the snowy egret was the object of the king’s ambition; and although, after many unsuccessful attempts, he failed in adorning his head with her unsullied plumes, he retired perfectly satisfied with his skill as a rifleman, after a long stray shot had perforated the eye of an “alata furda.” This is a gigantic slate-coloured crane, with eccentric red wattles; and several pairs that were marching over the mead had previously elicited most notable displays of gunmanship on the part of Ayto Berkie and others of the royal favourites. \\n\\n \\n\\n Abogáz Maretch, with his feudal train of Abitchu, joined the cortège as it passed Wona-badéra, his seat of government. The treeless expanse passed over—a type of the entire Galla territory north of Moolo-Fálada, where forest land commences—consists of wide valleys clothed with a verdant carpet of grass, clover, and trefoil, which, from their redundant luxuriance, almost impede progress. Every little intersecting eminence is completely covered with flourishing fields of barley and wheat, and crowned with villages fortified with strong stockades; and one ancient woira excepted, whose venerable boughs formed in days gone by a trysting-place to the hostile pagans, not a single bush or tree was visible during the long ride. \\n\\n \\n\\n An extensive barrier of loose stones hastily thrown up during the rebellion of Medóko, fortifies the south-eastern environs of Angollála; and although confessedly inferior to the great wall of China, it is calculated to offer temporary opposition to horsemen who are no Nimrods. Some of the lower parts were cleared by Captain Graham and myself without the slightest difficulty, and much to His Majesty’s amazement; but every attempt on the part of the Amhára to follow our example proved a complete failure. On our return we passed through a palisaded wicket in this breastwork, which is dignified with the title of “the King’s Gate,” and forms the scene of the few public executions that take place. Chiefs and governors were also accorded the privilege of squeezing through with the crowned head, but followers and people of low degree were compelled by the stick of the doorkeeper to adopt a circuitous route over a belt of stony hills adjoining, which form a continuation of the defences. \\n\\n \\n\\n The ascent to the palace was accomplished under a wild choral chant, laudatory of the monarch, which invariably announces his return from an excursion abroad. The road was lined with pilgrims clothed in yellow garments, and having each a cross of blue clay upon his forehead. They had been to perform their vows, or redeem their pledges left, at the sanctuary of Debra Libanos (Mount Lebanon), chief seat of learning in Shoa, and the renowned scene of the miracles of Tekla Ha?manót, its founder. Hard pressed by his enemies, the patron and lawgiver of Ethiopia is said to have leapt through the trunk of a venerable tree, a seam in which yet vouches for the truth of the legend that it spontaneously clave asunder at his holy bidding, but closed to foil the sacrilegious assailants who sought his life. Being athirst, he prayed unto God, whereupon the archangel Michael, who was his mediator, caused a fountain to rise at his feet, supplied by the stream of the river Jordan. A cross which he carried in his hand had been swept away during the passage of a neighbouring torrent, but no sooner did he curse the waters, than they were dried up, and have never since flowed above the channel! \\n\\n \\n\\n The remains of the saint still cast a halo over the spot in which they he interred, and the pool which he blessed, retains to this day the property of cleansing the leper, and healing every disease on either of the three days annually devoted to the commemoration of his birth, death, and ascension. Famous as the most holy of shrines throughout Southern Abyssinia, men of every rank, from the monarch to the meanest peasant, if unable to repair thither in person, delegate their substitute with offerings according to their wealth. Having on his way bathed in the “Segga Wadúm,” or “river of flesh and blood”—a tributary to the Nile, formed by the confluence of the Sána Robi and the Sána Boka—the pilgrim quaffs the waters of the mineral well, describes upon his forehead the sacred emblem of Christianity, and after kissing, at the adjacent church of Saint Mary, a cross which is asserted by the priesthood to have fallen from heaven, he is secure against sickness and witchcraft. The very earth from Debra Libanos is carried away as an antidote to maladies, and all who meet the returning pilgrim, fall prostrate upon the ground, and kiss the dust from off his feet. \\n\\n \\n\\n No sooner had His Majesty entered the palace-gate, than the sound of the imperial kettle-drum announced the presence of the herald, and crowds collected to listen to the royal edict. Standing upon the hill-side beneath the shadow of a solitary stunted tree, which, had it a tongue, could unfold many a tale of woe and oppression, he thus proclaimed in a loud voice to the multitude assembled; “Hear, oh, hear! Thus saith the King. Behold, we have foes, and would trample upon their necks. Prepare ye every one for war. On the approaching festival of Abba Kinos, whoso faileth to present himself at Yeolo as a good and loyal subject, mounted, armed, and carrying provisions for twenty-one days, shall be held as a traitor, and shall forfeit his property during seven years.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2355/65712.html","bookId":437,"book":{"id":437,"title":"The Highlands of Ethiopia","description":"简介： It was late on the afternoon of a sultry day in April, which had been passed amid active preparations, when a dark column of smoke, streaming over the tall shipping in the crowded harbour of Bombay, proclaimed the necessity of a hurried adieu to a co...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2355","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
