{"id":39811,"no":21,"title":"CHAPTER XXI. THE AMERICAN LETTERS.","content":"Stewart Routh was as hard a man as could readily be found, but his hardness was not proof against his meeting with George Dallas, and he showed Harriet how great a trial it was to him, and how much he feared his own constancy, when he told her he thought she had better not be present at their meeting. The curse of an unholy alliance had fallen upon these two, and was now beginning to make itself felt. Each was desirous to conceal from the other the devices to which they were compelled to resort, in order to keep up the false appearances to which they were condemned; in all their life there was no time in which they were free from restraint, except in solitude. But, though the effect was in each case the same, the origin was widely different. Harriet suffered for her husband\u0027s sake; he, entirely for his own. He had calculated that if anything in his appearance, voice, and manner, should escape his control, George would be certain to impute it to the natural feelings of horror and regret with which he would have received the intelligence conveyed to him by Harriet, of George\u0027s discovery of the identity of the murdered man. \"You had better remain upstairs until I call you,\" Routh had said to Harriet, \"when Dallas comes to dinner. It will be easier for you,\" he added. Harriet was sitting listlessly by her dressing-table while he spoke, and he stood behind her chair, and looked gloomily at the reflection of her face in the glass. She smiled faintly. \"Thank you, Stewart,\" she said; \"it will be easier.\" Then, after a brief pause, \"Would you very much mind my not going down to dinner at all?\" So far from minding it, Routh instantly felt that her absence would be a great relief. It would enable him to sound George thoroughly, to scheme upon whatever discoveries he should make concerning his future plans; and then, Harriet had done all the hard work, had prepared the way for him, had got over the difficulty and the danger. A little unpleasantness, some disagreeable emotion, must indeed be encountered, that was inevitable, but everything might go off well, and if so, Harriet\u0027s restraining presence, Harriet\u0027s face, with its constant reminder in it, would be much better out of sight. \"Not at all,\" he answered. \"Stay upstairs if you like. I\u0027ll tell Dallas you are a little knocked up, but will be all right in the morning.\" \"He will not be surprised, I dare say,\" she replied, \"though it was not my way to be knocked up formerly.\" \"Nor to be always harping on one string, either; and I can\u0027t say there\u0027s a change for the better,\" said Routh roughly. Once or twice of late the innate ruffianism of the man had come out towards her, from whom it had once been so scrupulously concealed. But she did not heed it; not a quiver crossed the drooping rigid face, at which Routh once more glanced covertly before he left the room. It would have been impossible to tell whether she had even heard him. Routh went down to the well-appointed dining-room, so different to the scene of the dinners of which George had formerly partaken, in the character of his guest. Wherever Harriet was, neatness and propriety never were absent, but there was something more than neatness and propriety in Routh\u0027s house now. Nevertheless, the look which the master of the house cast upon the well-laid, well-lighted table, with its perfect, unobtrusive, unpretentious appointments, was full of gloom. He wished he had not come down so soon; the inevitable meeting assumed a more portentous aspect with every minute that it was delayed; he wished he had not told Harriet to remain in her room. The fact was, Routh was staggered by the first failure of his plans. Everything had gone so right with him; his calculations had been fulfilled so exactly, so unfailingly, until now, and this unexpected accident had befallen through a blunder of his own. True, Harriet had met it with amazing tact, and had so treated it, that if only it could be further dexterously managed, it might be turned to ultimate advantage and an incalculable strengthening of his position. Let him keep his thoughts to that view of the question, and keep his nerves still. Were they going to play him false now, his nerves, which had never failed him before? So Mr. Stewart Routh passed a very unpleasant quarter of an hour before his expected guest arrived. He had just had recourse, as much in weakness as in nervousness, to a flask of brandy which stood on the sideboard, and had drank off half a glassful, when a knock at the door was quickly answered by the grave and correct man-servant, who formed an important and eminently respectable feature of the improved household of the Rouths, and the well-known quick tread of Dallas crossed the hall. \"Well, Routh, old fellow!\" \"George, my boy; delighted to see you!\" and the meeting was over; and Routh, looking into the young man\u0027s face, saw that not a trace of suspicion rested upon it, and that the material before him was as plastic as ever. \"Harriet is not very well this evening,\" said Routh, \"and begs you will excuse her if she does not make her appearance. I undertook to make it all right, and indeed I am rather glad we should be alone just at first. I have so much to say and to hear, and Harriet has had a long talk with you already.\" \"Yes,\" said George, and his smile was at once overcast, and his face darkened into gloom, \"I had a long talk with her. Of course, Routh, she told you the dreadful discovery I have made, and the curious way in which I am implicated in this ghastly affair.\" \"She told me all about it, my dear fellow,\" returned Routh. \"But here comes dinner, and we must postpone discussion until afterwards. I can only say now that I think Harriet\u0027s view of the matter perfectly correct, and her advice the soundest possible; it generally is, you know of old.\" And then Routh made a slight signal suggestive of caution to his guest, and the two men stood by the fireplace and talked of trifles while the irreproachable man-servant set the dishes upon the table, assisted by a neat parlour-maid. While far more serious thoughts were busy in George\u0027s mind, over the surface of it was passing observation of the changed order of things, and an amused perception of the alteration in Routh himself. It was as he had said in his letter--he had assumed the responsibility, the pose, the prosperity of the genuine plodding \"City man;\" and he looked the part to absolute perfection. \"And yet,\" George thought, \"he knows that one who was with us two the last time we met has met with a violent death; he knows that I am in a position as painful and perilous as it is extraordinary, and that he is indirectly mixed up with the dreadful event, and he is as cool and unconcerned as possible. I suppose it is constitutional, this callousness; but I\u0027m not sure it is very enviable. However, one thing is certain--it makes him the very best adviser one can possibly have under such circumstances. He won\u0027t be carried away by the horror of the circumstances, anyhow.\" The dinner proceeded, and George yielded rapidly to the influences which had been so powerful, and which he had been so determined to resist, when out of Routh\u0027s presence and under the sway of his penitence and his determination to reform. The conversation of Routh asserted all its old charm; the man\u0027s consummate knowledge of the world, his varied experience, the perfect refinement and tact which he could display at will, the apparent putting off of old things, the tone of utter respectability which abled George\u0027s newly-sharpened conscience to consent to the fascination as readily as his predilections, had more than ever an irresistible attraction for the young man. During dinner, which, in the altered state of affairs, involved the presence of the servant, Routh kept the conversation almost entirely to Dallas\u0027s own doings, plans, and prospects. He knew Amsterdam well, and talked of Dutch art and the history of the Low Countries with much skill and fluency. Without an allusion which could supply material for the curiosity and the gossip of the servants, he made George understand that the Bohemian element had been completely banished from his life and its associations; he sketched a plan of London life for George, moderately prosperous, quite practical, and entirely inoffensive. He made him, in short, as ready to congratulate himself on the resumption of their intimacy in the present phase of his moral being as he had been to rejoice in its formation under former conditions. Routh\u0027s spirits rose with his senses. He felt a depraved pride in the devilish skill he possessed in his grand faculty of deception. He excelled in it, he revelled in its exercise, and he had not enjoyed it, in this orthodox way, of late. He had been making money, it is true, and doing some real work as well as a good deal of swindling in the process, but he had had only the opportunity of using a certain set of his faculties. His persuasive eloquence, his personal influence, his skilful and expansive but shrewd falsehood had lain dormant for some time. As a singer who has lost his voice for a time suddenly finds the liquid notes filling the air with all their accustomed power and sweetness, and exults in the recovered faculty, so Stewart Routh marked the pleasure, the enthusiasm, almost enabling George to forget the coming painful topic of discussion from which only a few minutes divided them, as he listened to the voice of the charmer, who had never before charmed him so wisely nor so well. At length the wine was set upon the table, and then they were alone; and by this time, so complete did Routh feel his resumption of power over George Dallas, that it was with indifference only very little feigned that he said: \"And now, George, let us go into this sad business about poor Deane. It has quite floored Harriet, as I dare say you guessed.\" \"And so you give me the same counsel as Harriet has given me,\" said George, when he had to tell his story all over again, and had worked himself up into a new fit of excitement over the horror of the murder, and the dreadful idea of the ignorance of the deed in which the dead man\u0027s relatives still remained. \"I do, indeed, George,\" said Routh, solemnly: \"in taking any other course you will expose yourself to certain difficulty, and, indeed, to imminently probable danger. While you have been telling all this, I have been thinking how fortunate it was that I was away at the time, and so down upon my luck that I never knew or thought about any public affairs, and so did not hear of the murder except in the vaguest way. In the peculiar lustre of our London civilization, you know, George, somebody found dead in the river is so frequent a mote, that nobody thinks about it.\" \"Not in a general way,\" said George; \"but they made so much of this, and were so confident that it was a political affair, I cannot understand how any of us escaped hearing of it.\" \"Yes,\" acquiesced Routh, \"it is very extraordinary, but such things do happen. And rather fortunate, it seems, that they do, for if I had dropped in on the inquest, it would have been very awkward for you.\" \"Why?\" said George; \"after all, the truth must have come out, and all this misery about my mother would have been avoided.\" An evil look from Routh\u0027s eye lighted for a moment on the young man\u0027s unconscious face, then glanced away, as he said: \"You forget that all I could have said must have strongly favoured the notion that the man who wore the coat which the waiter swore to, and was last seen with Deane, was the last person who ever saw him alive. If I had had time to think, of course I shouldn\u0027t have said a word about it; but if I had been hurried into speaking, that is what I must have said. Come, George, you are much too sensitive about this matter. Of course, I\u0027m sorry for Deane, but I care a great deal more for you, and I decline to look at any part of this matter except such as concerns you. As to his relatives, as that part of the business appears to distress you most keenly, I must set your mind at rest by informing you that he had not a near relation in the world.\" \"Indeed!\" said George. \"How do you know?\" \"He told me so,\" said Routh. \"You will say, perhaps, that is not very trustworthy evidence, but I think we may take it in this particular instance for more than its general worth. He was the coldest, hardest, most selfish fellow I ever knew in the whole course of my experience, which has included a good deal of scoundreldom, and he seemed so thoroughly to appreciate the advantages of such isolation, that I believe it really did exist.\" \"He was certainly a mystery in every way,\" said George. \"Where did he live? We never knew him--at least I never did--except loafing about at taverns, and places of the kind.\" \"I don\u0027t know where he lived,\" said Routh; \"he never gave me an address, or a rendezvous, except at some City eating-house, or West-end billiard-room.\" \"How very extraordinary that no one recognized the description! It was in every way remarkable, and the fur-lined coat must have been known to some one. If I had seen any mention of the murder, I should have remembered that coat in a moment.\" \"Would you?\" said Routh. \"Well, it would have thrown me off the scent, for I never happened to see it. An American coat, no doubt. However, I have a theory, which I think you will agree with, and which is this: I suspect he had been living somewhere in another name--he told me he wasn\u0027t always known by that of Deane--under not very creditable circumstances, and as he must have had some property, which, had he been identified, must have been delivered up to the authorities, those in the secret have very wisely held their tongues.\" \"You think there was a woman in the case?\" Routh smiled a superior smile. \"Of course I think so; and knowing as much or as little of the man as you and I know, we are not likely to blame her much for consulting her own interests exclusively. This seems a curious case to us, because we happen to know about it; but just think, in this enormous city, in this highly criminal age, how common such things must be. How many persons may not have dropped out of existence since you and I last met, utterly unknown and uncared for, amid the mass of human beings here? It is no such rare thing, George, believe me, and you must listen to reason in this matter, and not run absurd risks to do an imaginary piece of justice.\" This was Harriet\u0027s counsel merely put in colder, more worldly words. Routh watched his listener keenly as he gave it, and saw that his purpose was gained. He would have been glad now to have turned the conversation into some other channel; and did partially succeed in directing it to Dallas\u0027s literary prospects and intentions, but only for a time. George pertinaciously came back to the murder, to his mother\u0027s state, to his apprehensions that she might never recover, and to his altered feelings towards Mr. Carruthers. Routh made very effective use of the latter topic. He enlarged upon the pride and sensitiveness of Mr. Carruthers; adverted to the pleasure with which, in case of her recovery, his mother would hail the better state of things for which Mr. Carruthers\u0027s letter to his stepson, combined with George\u0027s adoption of a new and steady career, would afford an opening; and congratulated George upon having been saved from taking any step which, by bringing public notice upon himself in so terrible a matter, must have incensed the proud man, and irritated him against him incalculably. George was amenable to this line of reasoning, and with only occasional divergence from the main topic of their discourse, the evening passed away, and the two men parted for the night, it having been agreed that Harriet should be taken into consultation in the morning, and a well-considered letter written to Mr. Carruthers. George Dallas was in the dining-room on the following morning before Routh and Harriet came in, and he found a letter directed to himself, in a hand with which he was unacquainted, on the breakfast-table. He broke the seal with some alarm and much curiosity. A slip of paper folded round two thin limp letters formed the enclosure; it bore only the words; \"My dear boy, I forgot to give you these letters. You had better read them. I think they are from your uncle.--E. B.\" George sat down by the window, through which the soft air of a morning bright and beautiful even in London came refreshingly in. He looked at the postmarks of the two letters, and broke the seal of that which bore the earliest date first. As he read the letter, which was long, and closely written, ail occasional exclamation escaped him, and when he had finished its perusal, he threw it hastily down, and impatiently tore open the other. This one, on the contrary, was brief; he had read the few lines it contained in a few minutes, with a face expressive of the utmost astonishment, when Harriet, whose noiseless step had escaped his hearing, entered the room. Without pausing to exchange the customary greeting, she came quickly towards him, and asked him \"What was the matter? Had he any bad news?\" \"Not bad news, but most astonishing, most unexpected news, Mrs. Routh. These letters have been sent to me from Poynings; they are written to my mother by my uncle, her only brother, and they announce his immediate arrival in England. How fortunate that Ellen should have sent them to me! But I don\u0027t know what to do about sending the news to my mother. She ought to know it. What can I do?\" \"Communicate with Mr. Carruthers at once, George,\" said Harriet, in the tone of quiet decision with which she was accustomed to settle matters submitted to her judgment. \"He is with her, and knows what she can bear. Sit down now and have some breakfast, and tell me about this uncle of yours. I never heard you mention him.\" She took her place at the head of the table. She was dressed, as he had been accustomed to see her, with neatness and taste; there was no change in her appearance in that respect, yet there was a change--a change which had struck George painfully yesterday, and which, in the midst of all the agitation of to-day, he could not keep from noticing. \"Are you well, Mrs. Routh?\" he asked her, anxiously. \"Are you sure you are well? I don\u0027t like your looks.\" \"Never mind my looks, George,\" Harriet said, cheerfully; \"I am very well. Get on with your breakfast and your story. Routh will be here presently, and I want to know all about it before he comes. He gets impatient at my feminine curiosity, you know.\" The smile with which she spoke was but the ghost of her former smile, and George still looked at her strangely, but he obeyed her, and proceeded with his breakfast and his story. \"I don\u0027t know very much about my mother\u0027s family,\" he said, \"because they did not like her marriage with my father, and she kept aloof from them, and her parents were dead before she had the opportunity of appeasing them by making the fine match they would have considered her marriage with Mr. Carruthers to be. I know that some of their relatives were settled in America,--some at New York, some in South Carolina,--and my mother\u0027s brother, Mark Felton--queer name, puritanical and fanatical, with a touch of the association of assassination about it--was sent out to New York when quite a child. I forgot to tell you it was my mother\u0027s stepfather and her mother who objected to her first marriage--her own father died when she was an infant; and on her mother\u0027s second marriage with a Mr. Creswick--a poor, proud, dissipated fellow, I fancy, though I never heard much about him--the American branch of the family sent for the boy. My mother has told me they would have taken her too, and her stepfather would not have made the least objection--we haven\u0027t been lucky in stepfathers, Mrs. Routh--but her mother would not stand it; and so she kept her child. Not for many years, for she married my father when she was only seventeen. Her brother was just twenty then, and had been taken into the rich American firm of his relatives, and was a prosperous man. She knew very little of him, of course. I believe he took the same view of her marriage as her mother had taken; at all events, the first direct communication between them took place when my mother was left a handsome and poor young widow, with one boy, who did not make much delay about proving himself the graceless and ungrateful son you know him to have been.\" George\u0027s voice faltered, and an expression of pain crossed his face. Harriet looked at him kindly, and laid her soft white hand on his. \"That is all over, you know,\" she said. \"You will not err in that way again.\" \"But the consequences, Mrs. Routh, the consequences. Think of my mother now. However,\" and he drew a long breath, and threw his shoulders back, like a man who tries to shift a burden, \"I must go on with my story. There\u0027s not much more to tell, however. My mother might have had a home for herself and me in her brother\u0027s house, but she could not bear dependence, and has told me often that she regarded unknown relatives as the most formidable kind of strangers. Her brother\u0027s wife made him resent my mother\u0027s determination to remain in England, and do the best she could for us both on our small means. Of course, all this was an old story long before I knew anything about it, and I fancy that it is only lately any correspondence has taken place between my mother and her brother. From this letter\" (he touched the first he had read) \"I can divine the nature of that correspondence. My mother,\" said George, sadly, \"has appealed to her brother on behalf of her prodigal son, and her brother has told her his sorrows in return; they have been heavy, and in one respect not unlike her own. He, too, has an only son, and seems to find little happiness in the fact.\" \"Did you not know of your cousin\u0027s existence until now?\" asked Harriet. \"O yes, I knew of it, in a kind of way; in fact, I just knew he existed, and no more. I don\u0027t think my mother knew more. I fancy in some previous letter he told her of his wife\u0027s death, and the general unsatisfactoriness of Arthur.\" \"He--your uncle, I mean---is then a widower.\" \"Yes,\" replied George. \"I won\u0027t bother you with the whole of this long letter, Mrs. Routh; the gist of it is this: My cousin, Arthur Felton, is not a good son, nor a good anything, I fancy, for I find my uncle congratulating my mother on my affection for her, my good feeling, in spite of all--(bless the poor man! he little knew how his words would wound, and how ill-deserved is the extenuation!)--and prophesying all manner of good things about me. It appears this hopeful son of his has been in Europe for some months, and probably in London for some months too, as my uncle says--stay, here is the passage: \u0027Arthur has with him a letter of introduction to you and Mr. Carruthers, some trifles from this side of the world which I thought you might like, and my instructions to make his cousin\u0027s acquaintance as soon as possible. You speak of George as living habitually in London; I hope by this time they have met, are good friends, and are, perhaps, chumming together. I have not heard from Arthur for some time. He is a careless correspondent, and not at any time so regardful of the feelings of other people as he might be. I dare say the first intelligence I shall have of him from England, as he cannot possibly want money\u0027--that looks bad, Mrs. Routh,\" said George, breaking off abruptly, and looking up at her; \"that looks bad--\u0027as he cannot possibly want money, will be from you. I know you will receive him kindly, and I earnestly hope he may make a favourable impression on Mr. Carruthers.\u0027\" Here George left off reading the letter, and looked blankly at Harriet. \"And he has never presented himself at Poynings, has he?\" she asked. \"Never, that I know of; and of course Ellen Brookes would have told me, if he had. Besides, you see this letter was late for the mail, and arrived with this other one. My mother never saw either, and they have been lying more than six weeks at Poynings.\" \"No doubt your cousin is still in Paris. All Americans delight in Paris. He would be in no hurry to leave Paris, depend on it, if he had no more interesting acquaintance than that of an aunt and a cousin to make in London, and as much time before him as he chose.\" \"I should think with you, Mrs. Routh, only that this letter, written at New York on the 3rd of April, says my uncle had heard from Arthur, who had merely written him a line from London, saying: \u0027Here I am. Particulars by next mail.\u0027 The mail brought no particulars, and my uncle writes to my mother, subsequently to this long letter, which is cheerful enough, you\u0027ll observe, that he is a prey to a presentiment that something is wrong with Arthur, also that he has conceived the strongest wish to come to England and see her, and especially to see me--that he has sufficient money and leisure to gratify the inclination--that he will wait for the chance of further intelligence of Arthur, and to arrange certain business matters, a month longer, and then come to England. He seems to have formed a remarkably elementary notion of my respected stepfather\u0027s manners, customs, and general disposition, for he proposes to present himself at Poynings immediately on his arrival, and never appears to entertain the least misgiving as to the cordiality of his reception. He must have been astonished at getting no answer to either letter, and I should think must have had his presentiments considerably sharpened and strengthened by the fact.\" Here George referred to the date of the later of the two letters, and exclaimed: \"By Jove! I should not be surprised if he were at Poynings now!\" At this moment Routh entered the room, and, in his turn, had the new aspect of affairs explained to him, but at no great length. He displayed very little interest in the matter, thought it very probable that Mr. Felton might have arrived in England, or even at Poynings, but did not see what George could do in that case. \"You can\u0027t go and entertain another man at a house where you haven\u0027t the entrée yourself,\" he said. \"I suppose the old woman will let you know if he really comes to Poynings. In the mean time, send the letters on to Mr. Carruthers. You expect to get his address from some girl or other--his niece, I think I understood Harriet--and ask what is to be done. It\u0027s rather a lucky turn up, Dallas, I take it, and will help your good-boy intentions towards your stepfather wonderfully, to have a rich uncle to act as a connecting-link between you. By the by, he\u0027s sure to set you up in life, George, and periodical literature will be robbed of a shining luminary.\" George did not altogether like the tone in which all this was said. It was a little sneering, and altogether careless. Nothing was so difficult to Routh, as it always is to men of his class, as the sustained assumption of interest in any affairs but their own; and now that his anxieties of the previous day were relieved, and he had no immediate object in which Dallas was concerned, to gain, he was impatient of any interruption of his immediate pursuits, and harsh and rough with him. He sat down, and ate his breakfast hastily, while he read a heap of letters which lay beside his plate. \"I don\u0027t know, indeed,\" George had replied good-humouredly to the speech which had jarred upon him; \"but you are busy, Routh, and I won\u0027t trouble you with my business just now. Mrs. Routh and I will discuss the letter to Mr. Carruthers.\" \"A telegram for Mr. Dallas,\" said the irreproachable servant, who entered the room while George was speaking. \"Please to sign this, sir.\" Routh looked up from his letters, Harriet set down the teapot, and quietly taking up the slip of paper which the man had laid upon the table by George\u0027s elbow, signed it with his name, writing it with a pencil which hung at her waist. The servant left the room, and George said: \"I was not wrong. This is from my uncle, and it comes from Amherst. He says: \u0027Meet me at Morley\u0027s Hotel this evening, at six.\u0027\" \"Very odd,\" said Routh. \"Well, George, I am sure I wish you all manner of luck with your American uncle.\" He had taken up his hat and gloves as he spoke, and now rang for the servant, whom he directed to call a hansom. The man went to the door, and transferred the commission to a street-boy lingering about there, who ran off, and returned in two minutes with the required vehicle. George and Routh were standing on the steps as the boy reappeared, talking. They shook hands, and Routh was stepping into the cab, when George followed him, and said, in a whisper: \"Was it not extraordinary the boy did not recognize poor Deane?\" \"What boy?\" said Routh, in astonishment, and stepping back on to the flagway. \"Why, that boy; the boy you always employ. He brought you my message the other day. Don\u0027t you remember it was he brought your note to poor Deane that day at the tavern?\" \"I did not remember; I did not particularly notice,\" said Routh. \"Good-bye.\" And he jumped into the cab, and was driven away. George went back into the house, eyed curiously by Jim Swain, who touched his cap as he passed. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3306/90393.html","bookId":420,"book":{"id":420,"title":"Black Sheep","description":"简介： The polite porter who had made the inquiry, and the satirical station-master who had commented on the reply, remained gazing for a minute or two at the stranger who had just arrived at the Amherst station of the South-Eastern Railway, and then went b...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3306","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
