{"id":39797,"no":7,"title":"CHAPTER VII. AMONG THE BEECHES.","content":"A fine avenue of beech-trees led from the gate through which George Dallas had passed, to the house which had attracted his admiration. These grandest and most beautiful of trees were not, however, the distinguishing feature of the place: not its chief pride. \"The Sycamores\" was so called in honour of a profusion of trees of that kind, said in the neighbourhood to have no rivals in all England. Be that as it might, the woodland scenery in Sir Thomas Boldero\u0027s noble park was beautiful in the highest degree, and of such beauty George Dallas was keenly and artistically appreciative. The tender loveliness of the spring was abroad throughout the land; its voices, its gladness, its perfumes, were around him everywhere, and as the young man strolled on under the shadow of the great branches, bearing their tender burden of bright, soft, green, half-unclosed buds, the weight and blackness of care seemed to be lifted off him, and his heart opened to fresh, pure, simple aspirations, long strangers to his jaded but not wholly vitiated character. He was very young, and the blessed influence of youth told upon him, its power of receiving impressions, its faculty of enjoyment, its susceptibility to external things--a blessing or a curse as it is used--its buoyancy, its hopefulness. As George Dallas turned from the broad smooth carriage-way, and went wandering over the green elastic turf of the carefully kept park, winding in and out through the boles of the grand old trees, treading now on a tender twig, again on a wild flower, now startling from her nest a brooding lark, anon stopping to listen to a burst of melody from some songster free from domestic cares, he was hardly recognizable as the man who had sat listening to Philip Deane\u0027s hard worldly talk at the Strand tavern the day before. \"Brighter and softer\" his mother had said he was looking, and it was true. Brighter and softer still the hard, pleasure-wearied, joyless face became, as the minutes stole over him, among the sycamores and beeches. He had pursued his desultory path a mile or more, and had lost sight of the house and the avenue, when he came to a beautiful open glade, carpeted with turf of the softest green, and over-arched by forest trees. Looking down its long vista, he saw that it terminated with a brilliant flower-garden, and a portion of a noble stone terrace, lying beneath one side of the many-turreted house. He stood entranced by the beauty of the scene, and, after a few moments, felt in his pocket for pencil and paper, in order to sketch it. He found both, and looking round him, saw a piece of the trunk of a felled tree, not yet removed by the care of the forester. \"A capital place to sketch from,\" thought George, as he folded his coat, and laid it upon the convenient block, and immediately became absorbed in his occupation. He was proceeding rapidly with his sketch, and feeling rather disposed to get it finished as quickly as he could, in order that he might return to the inn and procure some food, of which he stood in considerable need, when he caught the sound of galloping upon the turf in the distance behind him. He raised his head and listened; there it was, the dull rapid thud of hoofs on the grass. Was there one rider, or were there more? He listened again--only one, he thought; and now the rapid noise ceased, and was succeeded by the slow, pattering sound of a horse ridden daintily and gently about and about, by a capricious fancy. Still George listened, and presently there came riding out of the shadowy distance into the full expanse of the glade, down which the declining sun sent golden rays, as if in salutation, a lady, who was, as his first glance showed him, young and beautiful. She was quite unconscious of his presence, for the piece of timber on which he had been sitting was out of the line of sight, and though he had risen, he was still standing beside it. She came towards him, her slight form swaying to the movements of her bright bay thorough-bred, as she put the animal through all sorts of fanciful paces, now checking him with the rein, now encouraging him with her clear sweet young voice, and patting his arched neck with her white-gloved hand. The young man looked out from his hiding-place, enraptured, as she came on, a vision of youth, beauty, and refinement, down the wide green glade, the sun shining on her, the birds singing, the flowers blooming for her, the proud walls of the old house rising grandly in the back-ground, as if in boast of the worthy shelter that awaited her. Nearer and nearer she came, and now George Dallas could see her face distinctly, and could hear the pretty words with which she coaxed her horse. It was a face to remember; a face to be the happier for having seen; a face whose beauty was blended of form and colour, of soul, feature, and expression; a face which had all that the earth has to give of its best and fairest, touched with the glory which is higher and better, which earth has not to bestow. It was the face of a girl of nineteen, whose clear eyes were of golden brown, whose cheeks bloomed with the purest, most varying flower-like colour, whose rich golden hair shone in the sunlight, as its braids rippled and turned about with the movement of her head, tossed childishly to the rhythmical measure of her horse\u0027s tread. Half a dozen trees only intervened between her and the spot where George Dallas stood, greedily watching her every movement and glance, when she took her hat off, and pushed the heavy golden hair off her broad white forehead. At that moment her horse jerked the rein she held loosely, and pulled her slightly forward, the hat falling from her hand on the grass. \"Now see what you have done,\" she said, with a gay laugh, as the animal stood still and looked foolish. \"I declare I\u0027ll make you pick it up with your mouth. There, sir, turn, I tell you; come, you know how.\" And she put the horse through all the pretty tricks of stooping and half kneeling, in which she evidently felt much more pleasure than he did. But she did not succeed: he obeyed touch and word readily; but he did not pick up the hat. At last she desisted, and said with a funny look of mock patience: \"Very well, Sir Lancelot, if you won\u0027t you won\u0027t, so I must get off.\" She had just gathered her skirt in her hand, and was about to spring from her saddle, when George Dallas stepped out from among the trees, picked up the hat, and handed it to her, with a bow. The young lady looked at him in astonishment, but she thanked him with self-possession, which he was far from sharing, and put her hat on, while Sir Lancelot pawed impatiently. \"Thank you,\" she said; \"I did not see any one near.\" \"I was sitting yonder,\" said George, pointing to the spot whence he had emerged, \"on some fallen timber, and was just taking the liberty of sketching the view of the house, when you rode up.\" She coloured, looked pleased and interested, and said, hesitatingly, having bidden Sir Lancelot \"stand:\" \"You are an artist, sir?\" \"No,\" he answered, \"at least, only in a very small way; but this is such a beautiful place, I was tempted to make a little sketch. But I fear I am intruding; perhaps strangers are not admitted.\" \"Oh yes, they are,\" she replied hurriedly. \"We have not many strangers in this neighbourhood; but they are all welcome to come into the park, if they like. Had you finished your sketch?\" she asked timidly, with a look towards the sheet of paper, which had fallen when Dallas rose, and had been fluttered into sight by the gentle wind. George saw the look, and caught eagerly at any pretext for prolonging the interview a few moments. \"May I venture to show you my poor attempt?\" he asked, and without awaiting her answer, he stepped quickly back to the place he had left. The girl walked her horse gently forward, and as he stooped for the paper, she was beside him, and, lifting his head, he caught for a moment the full placid gaze of her limpid eyes. He reddened under the look, full of gentleness and interest as it was, and a pang shot through his heart, with the swift thought, that once he might have met such a woman as this on equal terms, and might have striven with the highest and the proudest for her favour. That was all over now; but at least he, even he, might sun himself in the brief light of her presence. She laid the rein on Sir Lancelot\u0027s neck, and took the little drawing from his hand with a timid expression of thanks. \"I am no judge,\" she said, when she had looked at it, and he had looked at her, his whole soul in his eyes; \"but I think it is very nicely done. Would you not like to finish it? Or perhaps there are some other points of view you would like to take? I am sure my uncle, Sir Thomas Boldero, would be delighted to give you every facility. He is very fond of art, and--and takes a great interest in artists.\" \"You are very kind,\" said Dallas. \"I shall be at Amherst a day or two longer, and I will take the liberty of making a few sketches--that splendid group of sycamores, for instance.\" \"Ah, yes,\" she said, laughing, \"I call them the godfathers and godmothers of the park. They would make a pretty picture. I tried to draw them once, myself, but you cannot imagine what a mess I made of it.\" \"Indeed,\" said Dallas, with a smile, \"and why am I to be supposed unable to imagine a failure?\" \"Because you are an artist,\" she said, with charming archness and simplicity, \"and, of course, do everything well.\" This simple exhibition of faith in artists amused Dallas, to whom this girl was a sort of revelation of the possibilities of beauty, innocence, and na?veté. \"Of course,\" he replied gravely; \"nevertheless I fear I shall not do justice to the sycamores.\" And now came an inevitable pause, and he expected she would dismiss him and ride away, but she did not. It was not that she had any of the awkward want of manner which makes it difficult to terminate a chance interview, for she was perfectly graceful and self-possessed, and her manner was as far removed from clumsiness as from boldness. The girl was thinking, during the pause whose termination Dallas dreaded. After a little, she said: \"There is a very fine picture-gallery at the Sycamores, and I am sure it would give my uncle great pleasure to show it to you. Whenever any gentlemen from London are staying at Amherst, or passing through, Mr. Page at the inn tells them about the picture-gallery, and they come to see it, if they care about such things; perhaps it was he who told you?\" \"No,\" said Dallas, \"I am not indebted for the pleasure--for the happiness--of this day to Mr. Page. No one guided me here, but I happened to pass the gate, and a very civil old gentleman, who was doing some gardening at the lodge, asked me in.\" His looks said more than his words dared to express, of the feelings with which his chance visit had inspired him. But the girl did not see his looks; she was idly playing with Sir Lancelot\u0027s mane, and thinking. \"Well,\" she said at last, settling herself in the saddle in a way unmistakably preliminary to departure, \"if you would like to see the picture-gallery, and will walk round that way, through those trees, to the front of the house\"--she pointed out the direction with the handle of her riding-whip--\"I will go on before, and tell my uncle he is about to have a visitor to inspect his treasures.\" \"You are very kind,\" said Dallas earnestly, \"and you offer me a very great pleasure. But Sir Thomas Boldero may be engaged--ay think it an intrusion.\" \"And a thousand other English reasons for not accepting at once a civility frankly offered,\" said the girl, with a delightful laugh. \"I assure you, I could not gratify my uncle more than by picking up a stray connoisseur; or my aunt than by bringing to her a gentleman of sufficient taste to admire her trees and flowers.\" \"And her niece, Miss Carruthers,\" thought George Dallas. \"So pray go round to the house. Don\u0027t forget your coat. I see it upon the ground--there. It has got rubbed against the damp bark, and there\u0027s a great patch of green upon it.\" \"That\u0027s of no consequence,\" said George gaily; \"it\u0027s only an Amherst coat, and no beauty.\" \"You must not make little of Amherst,\" said the girl, with mock gravity, as George stood rubbing the green stain off his coat with his handkerchief; \"we regard the town here as a kind of metropolis, and have profound faith in the shops and all to be purchased therein. Did dear old Evans make that coat?\" \"A venerable person of that name sold it me,\" returned George, who had now thrown the coat over his arm, and stood, hat in hand, beside her horse. \"The dear! I should not mind letting him make me a habit,\" she said. \"Good-bye, for the present--that way,\" again she pointed with her whip, and then cantered easily off, leaving George in a state of mind which he would have found it very difficult to define, so conflicting where his thoughts and emotions. He looked after her, until the last flutter of her skirt was lost in the distance, and then he struck into the path which she had indicated, and pursued it, musing. \"And that is Clare Carruthers! I thought I had seen that head before, that graceful neck, that crown of golden hair. Yes, it is she; and little she thinks whom she is about to bring into her uncle\u0027s house--the outcast and exile from Poynings! I will see it out; why should I not? I owe nothing to Carruthers that I should avoid this fair, sweet girl, because he chooses to banish me from her presence. What a presence it is! What am I that I should come into it?\" He paused a moment, and a bitter tide of remembrance and self-reproach rushed over him, almost overwhelming him. Then he went on more quickly, and with a flushed cheek and heated brow, for anger was again rising within him. \"You are very clever as well as very obstinate, my worthy stepfather, but you are not omnipotent yet. Your darling niece, the beauty, the heiress, the great lady, the treasure of price to be kept from the sight of me, from the very knowledge of anything so vile and lost, has met me, in the light of day, not by any device of mine, and has spoken to me, not in strained, forced courtesy, but of her own free will. What would you think of that, I wonder, if you knew it! And my mother? If the girl should ask my name, and should tell my mother of her chance meeting with a wandering artist, one Paul Ward, what will my mother think?--my dear conscientious mother, who has done for me what wounds her conscience so severely, and who will feel as if it were wounded afresh by this accidental meeting, with which she has nothing in the world to do.\" He lifted his hat, and fanned his face with it. His eyes were gleaming, his colour had risen; he looked strong, daring, active, and handsome--a man whom an innocent girl, all unlearned in life and in the world\u0027s ways, might well exalt in her guileless fancy into a hero, and be pardoned her mistake by older, sadder, and wiser heads. \"How beautiful she is, how frank, how graceful, how unspeakably innocent and refined! She spoke to me with such an utter absence of conventional pretence, without a notion that she might possibly be wrong in speaking to a stranger, who had offered her a civility in her uncle\u0027s park. She told that man on the balcony that night that Sir Thomas Boldero was her uncle. I did not remember it when the old man mentioned the name. How long has she been here, I wonder? Is she as much here as at Poynings? How surprised she would be if she knew that I know who she is; that I have heard her voice before to-day; that in the pocket-book she held in her hand a few minutes ago there lies a withered flower, which she once touched and wore. Good God! What would a girl like that think of me, if she knew what I am--if she knew that I stole like a thief to the window of my mother\u0027s house, and looked in, shivering, a poverty-stricken wretch, come there to ask for alms, while she herself glittered among my mother\u0027s company, like the star of beauty and youth she is? How could she but despise me if she knew it! But she will never know it, or me, most likely. I shall try to get away and work out all this, far away in a country where no memories of sin and shame and sorrow will rise up around me like ghosts. I am glad to have seen and spoken to Clare Carruthers; it must do me good to remember that such a woman really exists, and is no poet\u0027s or romancer\u0027s dream. I am glad to think of her as my mother\u0027s friend, companion, daughter almost. My mother, who never had a daughter, and has, God help her, no son but me! But I shall never see her again, most likely. When I reach the house, I shall find a pompous servant, no doubt, charged with Sir Thomas\u0027s compliments, and orders to show me round a gallery of spurious Dutch pictures, copies of Raphael and Carlo Dolce, and a lot of languishing Lelys and gluttony-suggesting Knellers.\" \"With these disparaging words in his thoughts, George Dallas reached the border of the park, and found himself in front of the house. The fa?ade was even more imposing and beautiful than he had been led to expect by the distant view of it, and the wide arched doorway gave admittance to an extensive quadrangle beyond. A stone terrace stretched away at either side of the entrance, as at Poynings. Standing on the lower step, a tame peacock displaying his gaudy plumage by her side, he saw Miss Carruthers. She came forward to meet him with a heightened colour and an embarrassed manner, and said: \"I am very sorry, indeed, but Sir Thomas and my aunt are not at home. They had no intention of leaving home when I went out for my ride, but they have been gone for some time.\" She looked towards a servant who stood near, and added: \"I am so sorry; nothing would have given my uncle more pleasure; but if you will allow me, I will send--\" George interrupted her, but with perfect politeness. \"Thank you very much, but, if you will allow me, I will take my leave, and hope to profit by Sir Thomas Boldero\u0027s kindness on a future occasion.\" He bowed deeply, and was turning away, when, seeing that she looked really distressed, he hesitated. \"I will show you the pictures myself, if you will come with me,\" she said, in a tone so frank, so kindly and engaging, that the sternest critic of manners in existence, supposing that critic to have been any other than an old maid, could not have condemned the spontaneous courtesy as forwardness. \"I am an indifferent substitute for my uncle, as a cicerone, but I think I know the names of all the artists, and where all the pictures came from. Stephen,\"--she spoke now to the servant,--\"I am going to take this gentleman through the picture-gallery; go on before us if you please.\" So George Dallas and Clare Carruthers entered the house together, and lingered over the old carvings in the hall, over their inspection of the sporting pictures which adorned it, and the dining-room, over the family portraits in the vestibule, the old china vases, and the rococo furniture. Every subject had an interest for them, and they did not think of asking themselves in what that interest originated and consisted. The girl did not know the young man\u0027s name, but his voice was full of the charm of sweet music for her, and in his face her fancy read strange and beautiful things. He was an artist, she knew already, which in sober language meant that she had seen a very tolerable sketch which he had made. He was a poet, she felt quite convinced; for did he not quote Tennyson, and Keats, and Coleridge, and even Herrick and Herbert, as they wandered among the really fine and valuable paintings which formed Sir Thomas Boldero\u0027s collection, so aptly and with such deep feeling and appreciation as could spring only from a poetic soul? It was the old story, which has never been truly told, which shall never cease in the telling. Both were young, and one was beautiful; and though the present is an age which mocks at love at first sight, and indeed regards love at all, under any circumstances, with only decent toleration, not by any means amounting to favour, it actually witnesses it sometimes. The young man and the girl--the idle, dissolute, perverted young man; the beautiful, pure, innocent, proud, pious young girl--talked together that spring afternoon, as the hours wore on to evening, of art, of literature, of music, of travel, of the countless things over which their fancy rambled, and which had wondrous charms for her bright intellect and her secluded life, simple and ignorant in the midst of its luxury and refinement. All that was best and noblest in George\u0027s mind came out at the gentle bidding of the voice that sounded for him with a new, undreamed-of music; and the hard, cold, wicked world in which he lived, in which hitherto, with rare intervals of better impulses, he had taken delight, fell away from him, and was forgotten. The girl\u0027s grace and beauty, refinement and gentleness, were not more conspicuous than her bright intelligence and taste, cultivated, not indeed by travel or society, but by extensive and varied reading. Such was the influence which minute after minute was gaining upon George. And for her? Her fancy was busily at work too. She loved art; it filled her with wonder and reverence. Here was an artist, a young and handsome artist, of unexceptionable manners. She adored poetry, regarding it as a divine gift; and here was a poet--yes, a poet; for she had made Dallas confess that he very often wrote \"verses;\" but that was his modesty: she knew he wrote poetry--beautiful poetry. Would he ever let her see any of it? \"Yes, certainly,\" he had answered; \"when I am famous, and there is a brisk competition for me among the publishers, I will send a copy of my poems to you.\" \"To me! But you do not know my name.\" \"O yes, I do. You are Miss Carruthers.\" \"I am; but who told you?\" The question disconcerted Dallas a little. He turned it off by saying, \"Why, how can you suppose I could be at Amherst without learning that the niece of Sir Thomas Boldero, of the Sycamores, is Miss Carruthers?\" \"Ah, true; I did not think of that,\" said Clare simply. \"But I do not live here generally; I live with another uncle, my father\u0027s brother--Sir Thomas is my mother\u0027s--Mr. Capel Carruthers, at Poynings, seven miles from here. Have you heard of Poynings?\" Yes, Mr. Dallas had heard of Poynings; but now he must take his leave. It had long been too dark to look at the pictures, and the young people were standing in the great hall, near the open door, whence they could see the gate and the archway, and a cluster of servants idling about and looking out for the return of the carriage. Clare was suddenly awakened to a remembrance of the lateness of the hour, and at once received her visitor\u0027s farewell, gracefully reiterating her assurances that her uncle would gladly make him free of the park for sketching purposes. She would tell Sir Thomas of the pleasant occurrences of the day;--by the by, she had not the pleasure of knowing by what name she should mention him to her uncle. \"A very insignificant one, Miss Carruthers. My name is Paul Ward.\" And so he left her, and, going slowly down the great avenue among the beeches, met a carriage containing a comely, good-humoured lady and an old gentleman, also comely and good-humoured who both bowed and smiled graciously as he lifted his hat to them. \"Sir Thomas and my lady, of course,\" thought George; \"a much nicer class of relatives than Capel Carruthers, I should say.\" He walked briskly towards the town. While he was in Clare\u0027s company he had forgotten how hungry he was, but now the remembrance returned with full vigour, and he remembered very clearly how many hours had elapsed since he had eaten. When he came in sight of the railway station, a train was in the act of coming in from London. As he struck into a little by-path leading to the inn, the passengers got out of the carriages, passed through the station gate, and began to straggle up in the same direction. He and they met where the by-path joined the road, and he reached the inn in the company of three of the passengers, who were about to remain at Amherst. Mr. Page was in the hall, and asked George if he would dine. \"Dine?\" said George. \"Certainly. Give me anything you like, so that you don\u0027t keep me waiting; that\u0027s the chief thing.\" \"It is late, sir, indeed,\" remarked Mr. Page; \"half-past seven, sir.\" \"So late?\" said George carelessly, as he turned into the coffee-room.","sourceLink":"http://novel.tingroom.com/duanpian/3306/90379.html","bookId":420,"book":{"id":420,"title":"Black Sheep","description":"简介： The polite porter who had made the inquiry, and the satirical station-master who had commented on the reply, remained gazing for a minute or two at the stranger who had just arrived at the Amherst station of the South-Eastern Railway, and then went b...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3306","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
