{"id":23328,"no":12,"title":"CHAPTER XII TURNED DOWN.","content":"It was not a difficult thing to find a hotel. Inquiry enabled them to reach the Hall House, which was the nearest public house after leaving the station. It was not a particularly inviting house on the outside, being sadly in need of paint. It was a frame building, standing on a corner, and a number of loafers were sitting about in front, smoking, chewing tobacco, and gossiping. They stared curiously at the boys. \n \n Frank led the way into the office. \n \n Two men, one in his shirt sleeves and the other looking like a countryman, were talking politics. They stopped and turned to look the strangers over. \n \n “Where is the proprietor?” inquired Frank, as he stepped briskly up to the desk. \n \n The man in his shirt sleeves drawled: \n \n “What yer want o’ him?” \n \n “We want to put up here.” \n \n “Can’t do it.” \n \n “Can’t?” \n \n “Nope.” \n \n “Why not?” \n \n “I reckon you’re ball players, ain’t ye?” \n \n “Yes, sir.” \n \n “This house don’t accommerdate no ball players.” \n \n “But we are gentlemen, and we——” \n \n “I tell you this house don’t accommerdate no ball players. That ought to be plain ernough for ye. Go on about your business.” \n \n “This is a public house, isn’t it?” \n \n “Ye-ah.” \n \n “Well, I demand to see the proprietor.” \n \n “You’re lookin’ at him. Help yourself.” \n \n “Are you the proprietor?” \n \n “You bet!” \n \n “And you refuse to give us accommodations in your hotel?” \n \n “You bet!” \n \n “All right. Your only reason for doing so is because we are baseball players, is it?” \n \n “I didn’t say so,” answered the man shrewdly. \n \n “But you inferred it.” \n \n “Did I?” \n \n “It sounded that way.” \n \n “Well, there may be a dozen other reasons, young feller. I’ve been in the hotel business ten years, an’ you can’t trap me. We ain’t prepared to accommerdate ye. You didn’t notify us you was comin’, an’ so we made no special preparations. Our help is short, there’s a case of typhus fever in the house, my wife is down with the lumbago, and I’m some broke up myself with the chills. So you see there ain’t no need to discuss the matter further. We can’t take ye in. Good day. The Mansion House is up the street three squares.” \n \n “That inn did not appeal to my ?sthetic sense of refinement, anyhow,” observed Ready, as they filed out onto the street with their hand bags and grips. “It looked somewhat soiled and out of condition. The Mansion House seems far more alluring.” \n \n “I don’t think much of being turned down in that manner,” said Merry. “It is irritating.” \n \n The Mansion House proved to be a brick building near the centre of the business section of the place. \n \n “I’m glad we were turned down back there,” said Morgan. “This looks better to me.” \n \n “Yah, I pelief id does haf a petterment look,” agreed Dunnerwurst. “I think we vill peen accommodationed mit superiority here.” \n \n The office was empty. They waited a few moments and no one appeared. Then Frank found a bell on the desk and rang it. After another period of waiting and a second ringing of the bell, a sleepy-eyed fat boy came in, dragging his feet and looking both tired and disturbed. \n \n “Here, boy!” exclaimed Merry; “what’s the matter with this place? We want to stop here.” \n \n “You’ll ha-ve t-o s-ee Mr. Jones,” declared the boy, drawling forth his words with a great effort. \n \n “Who is Mr. Jones?” \n \n “He’s th-e pro-pri-e-tor.” \n \n “Well, where is he?” \n \n “I do-n’t kno-ow.” \n \n “Stick a pup-pup-pin into him and wa-wa-wake him up, Ready!” cried Joe Gamp. \n \n “Do-n’t yo-ou lar-a-rfe a-ut me-e-e!” said the fat boy, still in that weary drawl. “I do-n’t li-ke to ha-ave a pi-un stu-ck in-to me-e-e.” \n \n Rattleton dropped on a chair and began to laugh. \n \n “He cakes the take—no, takes the cake!” cried Harry. “He don’t li-i-ike to ha-ave a pi-un stu-ck in-to he-e-e-um. Ha! ha! ha!” \n \n “Do-n’t yo-ou lar-r-rfe a-ut me-e-e!” said the fat boy resentfully. \n \n “This is a fine hotel!” exploded Hodge. \n \n Dunnerwurst waddled over to the fat boy. \n \n “Look ad myseluf,” he commanded. “We vish to pecome the jests uf the house.” \n \n “Guests, Hans,” corrected Frank, laughing. \n \n “Yah, so id vos I said id. Ve vant to pecome der jests uf der house. Der money we vill paid vor dot, und we haf id readiness. Now on yourseluf got a mofement und pring righdt avay quick der brobrietor. Id is our urchent objection to registrate righdt off before soon und to our rooms got assignments. Yah!” \n \n “Why-y do-n’t yo-ou ta-a-alk E-e-eng-lish?” inquired the fat boy. \n \n “Vot?” squawled Hans excitedly. “Vot dit you hear me say? Vy don’t Enklish talk me? Vot dit you caldt id? Dit you pelief I vos Irish talking alretty now? Chust you got a viggle on und pring der chentleman by der name of Chones vot this hodel runs.” \n \n He gave the fat boy a push, and the sleepy-eyed chap disappeared through the door by which he had entered, muttering: \n \n “So-ome fo-o-olks are al-wus in a naw-ful hur-ry.” \n \n Five minutes later an undersized man with a reddish mustache came pudging into the room. He was smoking a huge, black cigar, which he held slanted upward in a comical manner. His hands were in his pockets. \n \n “What do you fellers want?” he asked, in a voice like the yapping of a small dog. \n \n “Are you Mr. Jones?” asked Merry. \n \n “That’s my name,” yapped the little man. \n \n “Well, my name is Frank Merriwell, and these are members of my baseball team. We would like to know your rates.” \n \n “Won’t do ye any good to know.” \n \n “Why not?” \n \n “My house is full, an’ I can’t accommodate ye.” \n \n “Oh, come!” exclaimed Frank; “we’ll pay in advance.” \n \n “That don’t make no difference. Can’t take ye.” \n \n “We’ll put up with accommodations of any sort.” \n \n “Ain’t got any sort for ye. I tell ye the house is full an’ runnin’ over. That settles it.” \n \n “Where can we find accommodations in this town?” \n \n “Can’t say.” \n \n Frank was holding himself well in hand, although burning with indignation. \n \n “We would like to know the meaning of this,” he said. “Do the hotels in this town ever accommodate transient guests?” \n \n “Certain they do.” \n \n “There are only two hotels here.” \n \n “That’s correct.” \n \n “Well, we have applied to both, and neither will take us in. Where are we to go?” \n \n “That ain’t none o’ my business, is it?” yapped the landlord. “If my place is full you can’t force me to take ye in. Git out! I can’t bother with ye.” \n \n Merriwell felt like making trouble, but knew it would do no good and might do a great deal of harm. He longed to talk straight to the insolent little man who snapped like a bad-natured dog; but that, too, he believed would be a mistake, and so he turned to his companions, saying: \n \n “Come on, boys.” \n \n “Wait!” cried Bart Hodge, his dark eyes blazing—“wait until I tell this imitation of a real man a few things!” \n \n Before Bart could express himself, however, Frank had him by the arm. \n \n “Keep still, Hodge,” he commanded, in a low tone of authority. “It will be a mistake. Come away quietly.” \n \n Although he felt like rebelling, Bart submitted in mute protest, giving Jones one contemptuous look, and they all left the Mansion House. \n \n “Vasn’t id a sadness to haf der coldt und empty vorld turned oudt indo us!” sobbed Hans Dunnerwurst, as they paused in front of the hotel. \n \n Jack Ready sang: \n I ain’t got no reg’ler place that I can call my home, \n I mark each back-yard gate as through this world I roam; \n Portland, Maine, is just the same as sunny Tennessee, \n And any old place that I hang up my hat is home, sweet home to me. \n \n “Don’d dood id! Don’d dood id!” implored Dunnerwurst. “Id gifes me such a melancholery. I vish I vouldt be more thoughtlesss uf your feelings!” \n \n Browning growled and grumbled. \n \n “I’m mighty tired of this business!” he declared. “We’re having a fine time playing baseball in this town! I’m sick of this baseball business, anyhow. It’s too much trouble. There’s always something doing. I’m going to swear off and never play the game any more.” \n \n Dick Starbright laughed and slapped Bruce on the shoulder. \n \n “You’re a great bluffer, old chap,” he said. “You’ve been swearing off ever since I knew you, but I’ll bet you’ll stick to the game until you weigh three hundred pounds.” \n \n “When I reach the three-hundred-pound mark I’m going to commit suicide.” \n \n “Then you haven’t long to live.” \n \n Frank stepped out and spoke to a man who was passing, inquiring about boarding houses. The man was rather surly, but he told Merry of a house kept by Mrs. Walker, and soon the party was on the way thither. \n \n Mrs. Walker’s house proved to be a long, rambling, frame building, about which hovered an atmosphere of poverty. They were met at the door by a sharp-nosed, belligerent-appearing woman, who placed her hands on her hips and demanded to know who they were and what they wanted. \n \n Removing his hat and bowing low with grace and politeness, Merry explained that they were looking for a place to stop overnight, at least, and he hastened to add that they were willing to pay in advance, emphasizing this statement by producing a roll of bills. \n \n The eyes of the woman glittered as she saw the money. \n \n “Are you baseball players?” she inquired. \n \n Merry confessed that they were, whereupon she shook her head with an air of regret. \n \n “Then I can’t have anything to do with ye,” she declared. \n \n “What difference does that make, if we are quiet and gentlemanly and pay our bills in advance?” inquired Merriwell. \n \n “It makes a heap of difference. I can’t take ye in.” \n \n “I wish you would be kind enough to give a satisfactory reason for refusing us, madam.” \n \n “I ain’t giving any reasons, and I ain’t talking too much. You can’t stop here.” \n \n “Not if we pay double rates for transients and pay in advance, Mrs. Walker?” \n \n “Not if you pay ten times regler rates and pay in advance,” was the grim answer. “I judge that’s plain enough for you.” \n \n “It’s plain enough, but still we cannot understand your reasons. I wish you would——” \n \n “It ain’t any use making further talk. You’ve got my answer, and that settles it.” \n \n Saying which, she retreated into the house and slammed the door in their faces. \n \n “I’m so lonesome, oh, I’m so lonesome!” sang Jack Ready. “Children, we are cast adrift in the cold and cruel world. We are stranded in the wilds of Iowa, far from home and kindred. Permit me to shed a few briny tears.” \n \n “This thing is getting me blazing mad!” grated Bart Hodge. “What do you think about it, Merry?” \n \n “There seems to exist a peculiar prejudice against baseball teams in this town,” said Frank. \n \n “This makes me think of a little experience of mine in Missouri two years ago,” began Stretcher. \n \n But Buck Badger suddenly placed a clenched fist right under Jim’s nose, which caused the boy from Missouri to dodge backward, exclaiming: \n \n “I beg your pardon! I’ll tell you about that some other time.” \n \n “What can we do?” exclaimed Morgan. “We seem to be up against it.” \n \n “Perhaps we can get into a private house somewhere if we pay enough,” suggested Rattleton. “I’m willing to doff the coe—I mean cough the dough.” \n \n “We’ll have to try it,” said Frank. \n \n They did try it, with the result that they were promptly refused at three houses, although Merry resorted to all the diplomacy at his command. \n \n They turned back into the main part of the town. \n \n “What will you do now, Frank?” asked Morgan. \n \n “I’m going to try to get track of Mr. Joseph Gaddis,” answered Merriwell grimly. “When I do——” \n \n The manner in which he paused and failed to complete the sentence was very expressive. \n \n “I don’t blame you!” cried Hodge. “Mr. Gaddis must explain why we have been treated in this outrageous manner. He agreed to meet us at the station and have accommodations for us at the best hotel in town. He has broken his contract, and I’d like to break his face!” \n \n “That wouldn’t help matters much, Bart.” \n \n “But it would relieve my feelings in a wonderful manner.” \n \n “There is something behind this affair that we do not understand,” said Merry. “In order to understand it we’ll have to learn the facts.” \n \n “You’re sure Gaddis was in earnest when he made that contract with you in Omaha?” questioned Rattleton. \n \n “If ever I saw a man who seemed to be in earnest, Mr. Gaddis was such a man. He witnessed our great seventeen-inning game with the Nebraska Indians and lost no time after that in seeking to arrange a game with us to be played here. Stated that his team had beaten the Indians twice out of three times last season, and Green, the manager of the Indians, acknowledged that it was so. The inducements offered were satisfactory. We could reach this town without going out of our way on the trip East, and I finally made a contract with him. Here we are.” \n \n “And where, oh! where is Gaddis?” sighed Ready. \n \n Reaching the main street of the town, they entered a drug store and inquired for Mr. Gaddis. The druggist looked them over in a peculiar manner. He knew Gaddis very well, he said. Gaddis was out of town. Left suddenly that very morning for Des Moines. \n \n At this moment a handsome open carriage, in which sat a woman heavily veiled, drew up before the door. The lady waited until the druggist’s clerk stepped out to see what she wanted. A moment later the clerk re-entered the store and asked if Mr. Merriwell was there. \n \n “That is my name,” said Frank. \n \n “The lady in the carriage wishes to speak to you,” said the clerk. \n \n “What’s this? what’s this?” muttered Jack Ready. “How could she miss me? My ravishing beauty should have appealed to her. I am fast coming to the conclusion that beauty like mine is a decided disadvantage. It awes the fair sex.” \n \n Wondering who the unknown woman could be and what she wanted, Merry left the store. \n \n “Are you Mr. Merriwell?” inquired the woman, as Frank stepped up to the carriage and lifted his hat. \n \n “I am—miss.” \n \n He had quickly decided that she was young, and diplomacy led him in his uncertainty to address her as miss instead of madam. \n \n Her veil was so heavy that it was absolutely baffling, permitting him to obtain no view of her features that would give him a conception of her looks. Her voice was musical and low and filled with strange, sweet sadness. \n \n There was about her an air of mystery that struck Frank at once. \n \n “I believe you are looking for some place to stop while in town?” she observed questioningly. \n \n “That is quite true, and thus far I have looked in vain.” \n \n “It is a shame that a stranger here should be treated thus. The hotels have declined to take you in?” \n \n “Yes, miss; likewise the only boarding house and several private houses where we have made application.” \n \n “If you will depend on me I’ll find accommodations for you and your friends.” \n \n Merry’s surprise increased. His face cleared and he gave her one of those rare, manly smiles that made him so wonderfully attractive. \n \n “You are very kind, but I fear——” \n \n “Do not fear anything. I live here, and this outrage upon strangers has awakened my indignation. If you will enter my carriage and ask your friends to follow us I’ll see that you are taken care of.” \n \n “I hope you will not be putting yourself to any inconvenience in this——” \n \n “Not at all; it gives me pleasure and satisfaction. Do not hesitate. Speak to your friends at once.” \n \n Thus urged, Merry called his followers from the store and made known the offer he had received from the unknown woman. Hodge surveyed her suspiciously and then found an opportunity to whisper in Frank’s ear without being observed: \n \n “Look out for some kind of a trick, Merry.” \n \n “Nonsense!” laughed Frank. “Come on.” \n \n He entered the carriage and took a seat beside the lady, who made room for him. Thus they were driven away along the street, the others following on the sidewalk. \n \n “You appeared just in time to save us, miss,” said Merry. “We were beginning to get desperate.” \n \n She urged him to tell her just what had happened, which he did, passing over the attack upon him by the ruffian Madison. \n \n “It’s all very mysterious to me,” admitted Frank. “I wonder if you can throw any light on the situation.” \n \n “All I know is that there is trouble in town over baseball affairs. During a number of seasons, and up to last season, baseball here was conducted by the cheapest element in the town, and the place acquired a very bad reputation. Outside teams, I have heard, were robbed and mobbed here. It became so bad that no manager who knew the exact condition of affairs would bring his team here. Last season a number of people who enjoy clean baseball resolved to put a stop to the hoodlumism. They secured the ball ground through some stratagem, and the tough characters found themselves out in the cold. A baseball association of respectable people was formed and Mr. Gaddis was chosen manager. The ruffians made him a lot of trouble, but he ran a team through the season. This year he was warned that he would not be permitted to conduct a team here. He paid no attention to the warning, but went ahead and made up his team. Immediately there was trouble, and it became evident that an attempt would be made to drive Gaddis out of baseball. The same ruffianly element that had predominated before his appearance started to make it warm for him. In doing this the whole place has been terrorized into backing up the ruffians. No one seems to dare to do anything different. Another man by the name of——” \n \n She seemed to hesitate over the name, but quickly resumed: \n \n “A man by the name of Cameron has organized a baseball team here. He has announced that he will take possession of the ball ground to-morrow, and that Gaddis will not be permitted to hold it longer. The members of Gaddis’ team have been intimidated and driven out of town, Gaddis himself has been threatened with personal violence. Without doubt, the hotel keepers and people of the place were warned in advance to have nothing to do with any ball team that came here to play with Gaddis’ team. Your team was chosen in particular, as it happened to be the first to arrive here after—after Cameron came out boldly and announced his intention. That is about all there is to it. At least, it is all I know about it.” \n \n “Well,” cried Merry, in surprise, “it certainly is astonishing that a whole town can be intimidated in such a manner by a set of ruffians. Is there no law here?” \n \n “If so, there is little danger that it will be enforced against the scoundrel Cameron!” she exclaimed, with surprising bitterness, all the music and sweetness gone from her voice. “He is a wretch who finds methods of evading the law, even when he commits the most heinous crimes! But vengeance will fall on him in the end! He cannot always escape!” \n \n The depth of feeling betrayed by the mysterious woman told Frank that she was the implacable enemy of Cameron and that she had reasons for hating the man most intensely. \n \n As they were passing the Mansion House two men came out and paused on the steps. \n \n One of them was the bruiser, Mat Madison. \n \n The other was a slender, red-lipped, dark man of thirty-five or more, dressed stylishly and smoking a cigarette. \n \n “There is Carey Cameron!” hissed the veiled woman. \n \n For all of her evident hatred of Cameron, the mysterious woman made no outward demonstration that could lead either of the men on the steps of the hotel to suppose she had as much as noticed them. If her face expressed the passion of hatred that was betokened by her voice, the veil effectually concealed the fact, and apparently she sat looking straight ahead without even turning her eyes in the direction of the hotel. \n \n The two men who had chanced to come out upon the steps at that moment quickly discovered Merriwell in the carriage and saw the others of Frank’s team following on the sidewalk. \n \n “What in blazes does that mean, Madison?” exclaimed Cameron. \n \n “You know as well as I do, boss,” answered the bruiser. \n \n “Who is that chap in the carriage with the woman?” \n \n “That’s the feller I was just telling you about—the one who downed me at the station.” \n \n “Frank Merriwell himself, eh?” \n \n “Yes, boss.” \n \n “Well, I swear he doesn’t look very much like a fighter. You should handle a smooth-faced chap like that with ease. I’m disgusted with you. Where is he going with that woman?” \n \n “I judge she’s taking him to her house, and it looks like the rest of the bunch is bound for the same place. They couldn’t git no accommodations at hotels or other places, so she’s goin’ to take them in.” \n \n Carey Cameron flung aside his cigarette. \n \n “Hasn’t she been warned?” he asked. \n \n “No, for nobody reckoned she would be taking strangers in, as she’s been so haughty and high-headed since comin’ here that she’s scarce spoke to anybody, and she don’t have any dealings with the people in the town.” \n \n Instantly Cameron descended the steps and hastened to the street, where he planted himself in front of the horse, commanding the driver to stop. \n \n “Madam,” he said, “it’s likely you don’t understand what you are doing. I am led to suppose that you contemplate taking your companion and his crowd into your house and giving them shelter. If such is the case you had better change your mind instantly, or you will find yourself in serious trouble.” \n \n The woman did not answer, but, rising slightly from her seat, she hissed at the driver: \n \n “Whip up! Drive over that man!” \n \n The driver’s whip was in his hand, but he hesitated about obeying the order. Turning his head, he answered, in a low tone: \n \n “I dare not, Miss Blake. He——” \n \n Instantly she sprang erect, snatched the whip and, reaching over the driver’s seat, hit the horse such a cut that the fiery animal instantly leaped forward. \n \n By an agile spring, Cameron succeeded in escaping, although he barely avoided the wheels of the carriage. His hand went to his hip as he glared after the woman, but he did not draw a weapon. \n \n Frank’s friends had seen this, but were not given time to come up and take any part in the affair. Hodge was inclined to pitch into Cameron, but the others advised against it, and all hurried along after the carriage. \n \n There was a glare of fury in the eyes of Carey Cameron as he stood in the street looking after the mysterious woman who had dared defy him. \n \n Madison hurried up. \n \n “Why didn’t you stop her, boss?” he asked. \n \n Cameron turned on him, blazing with wrath. \n \n “You idiot, didn’t you see what she did? She tried to run over me!” \n \n “I should say she did, boss.” \n \n “Confound her! I’ll make her regret it! She doesn’t know me! She doesn’t know my influence in this town. I’ll drive her out of Cartersville!” \n \n “Are you goin’ to let her take Merriwell’s crowd in?” \n \n “I could stop it, but what’s the good? We’ve done enough, I fancy. Gaddis is out of baseball, and the fine crowd that was backing him have taken to cover. I don’t believe they’ll dare butt against us after this. I wanted to show them just what we could do when we wished, and I believe they understand. Half our new players are here now, and the rest will arrive in the morning. The new Cartersville baseball team will take the field the following day. Old Martin, who owns the field, is so well cowed that he has told me to go ahead and use it, although Gaddis holds a receipt for the season’s rent, which he has paid. I have no particular quarrel with the Merriwell crowd.” \n \n “Well, I have!” snarled Madison; “and I’m going to get a crack at Merriwell before they pull out of Cartersville!” \n \n “Go ahead,” nodded Cameron, as he took a gold cigarette case, decorated with diamonds, from his pocket, and selected a fresh cigarette. “You have my permission; but, according to your own story you’ll have to catch him off his guard and lay him out stiff before he has a chance to recover.” \n \n “Leave it to me!” growled the bruiser. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1950/55816.html","bookId":754,"book":{"id":754,"title":"Frank Merriwell\u0027s Endurance","description":"简介： On the way East with his athletic team Frank Merriwell accepted the invitation made by Hugh Morton to stop off at Omaha and visit the Midwestern Athletic Association....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1950","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
