{"id":23332,"no":16,"title":"CHAPTER XVI AN ASTOUNDING WAGER.","content":"The expected members of the new local team arrived before noon that day. In the afternoon Cameron had them out for practice. They were, indeed, for the most part, well-known players, seven of them, at least, being professionals with records. Several were league men who had been blacklisted for one offense or another. Taken all together, they were a tough set and just the aggregation to win a game by bulldozing when other methods failed. They made a team that was certain to be heartily approved by the local toughs. These players, the most of them, also stopped at the Mansion House. They looked Frank’s team over, with no effort to conceal their merriment and disdain. To them Merry’s players were a lot of stripplings. “We’ll eat ’em up,” said Big Hickey, the Indianapolis man. “Why, dey won’t last t’ree innin’s.” “Sho’ not,” chuckled Wash Johnson, the colored player from the Chicago Giants. “Dey is a lot o’ college fellers. Nebber seen none o’ dem college fellers dat could play de game wid professionals. No, sar.” “They ain’t got-a da nerve,” observed Tony Tonando, the Italian from Kansas City. “Sometimes they play one-a, two or three-a inning first-a rate; but they no keep-a it up.” “Easy frightened, easy frightened,” grunted Wally Weaver, the Indian. “When they play too well, then jump in and scare them. That’s easy.” “Look here, you chaps,” said Tunk Moran, who had made a great reputation on the Springfield, Illinois, team, but had been fired for drinking, “I happen to know something about Frank Merriwell, and you’re off your trolley if you think you’re going to win from him by scaring him. If you beat that chap you’ll have to play baseball, and don’t you forget it.” The others laughed at this and ridiculed Moran. “All right,” he growled. “Just you wait until after the game and see if you don’t agree with me.” The appearance of Cameron’s team in suits when they left the hotel to march to the ball ground was the signal for a great demonstration on the part of the youngsters of Cartersville, who were waiting to escort them. The cheering brought a number of the Merries to windows to look out, and they saw their opponents-to-be set off down the street, followed by the admiring crowd. “Behold the gladiators whom we are to meet in the arena!” cried Jack Ready. “They’re a hot bunch of old-stagers,” grunted Browning. “It will keep us busy to cool them off,” said Frank. “Don’t get the idea that they are has beens. Half of them could play on fast league teams if they were not crooked and rebellious. They will go after us savage, with the idea of taking the sand out of us at the very start.” “On the other hand,” said Rattleton, “if we get a start on them early in the game all the hoodlums will be against us and we’ll be in danger of the mob.” “I have thought about that,” declared Frank. “I have a plan. Come, fellows, and we’ll talk it over.” They gathered in one room, and Merry explained his plan, speaking as follows: “Rattleton is right in fancying it will not do to get a big lead on those fellows at an early stage in the game. Of course, we might not be able to do so, even if we tried; but should the opportunity offer, we must still refrain from it and take chances on our ability to pull out toward the end. Cameron has no idea of permitting us to take the game under any circumstances. If we started off like winners the hoodlums would be set on us. I’ve had more than one experience with hoodlums. They can make it hot for any team by crowding down to the base lines, insulting the players, stoning them and doing a hundred things to rattle them. I am confident that, as long as the crowd has a belief that the local team is sure to win it will behave in a fairly decent manner. Cameron will make an effort to hold the toughs in check. Therefore, we must resort to the stratagem of keeping close to the enemy all through the game, with the hope of winning at the very finish by an unexpected spurt that will take them by surprise. Of course, we may lose in this manner; but I am confident it is also our only chance of winning.” “I think you are right, Merry,” agreed Hodge. “If you could fix it with Cameron so that we may have our last turn at bat, there is a possible show for us.” “I’ll do what I can,” assured Merriwell, “although it is possible he will refuse such a request if I make it. If we can’t get our last turn at bat we’ll have to do the best we can. But I wish you all to keep in mind the scheme I have proposed, and play from the start with the idea of holding them down and keeping close to them, so that we may have a chance at the finish.” To this they agreed readily enough. During the remainder of the day they saw nothing of the strange woman who had befriended them. The following morning, directly after breakfast, a stranger appeared at the Mansion House. He was a quiet, smooth-faced young man, and he registered as “Warren Doom, Chicago.” Doom betrayed interest at once when he learned there was to be a baseball game in town that afternoon, and when he was told that the locals were to meet Frank Merriwell’s team, his interest became genuine enthusiasm. He was purchasing a cigar at the counter when he received this bit of information. “Going to play Merriwell’s team?” he cried. “Well, I struck this place at the proper moment! I’ve seen Merriwell pitch once, and he’s a wonder. I’ve always longed to see him again. Your team hasn’t a chance against him.” “What’s that?” exclaimed the man behind the counter disdainfully. “I reckon you don’t know what you’re talking about. We’ve got a team right here in this town that can skin anything outside the two big leagues. Our players are professionals and crackajacks. This Merriwell bunch looks like a lot of boys. They’re amateurs, and Cartersville will bury them up this afternoon.” “Oh, come, come!” smiled Doom. “It’s plain you are the one who doesn’t know what he’s talking about. I don’t care how many professionals you have, Merriwell will defeat you. I’ll bet on it.” “How much will you bet?” was the hot inquiry. “Anything from ten dollars to ten thousand.” “That’s a bluff.” “Is it? I’ll back it up.” “Of course it is a bluff,” said another voice, as Carey Cameron, puffing at a cigarette, came sauntering up. “The cocksure gentleman never saw ten thousand dollars.” Doom turned with his freshly lighted cigar in his mouth and his hands in his pockets, surveying Cameron critically. “Who are you?” he inquired. “Why are you so sudden to chip into this?” “I’m the manager of the Cartersville baseball team, and my name is Cameron. I happened to hear you making a lot of bluff betting talk, which I am positive you can’t back up.” “How positive are you?” “Positive enough to stake ten thousand dollars against a similar sum that Cartersville will win to-day. Put up—or shut up!” “I don’t happen to have ten thousand dollars in cash on my person.” “Of course not!” cried Cameron sneeringly. “Bluffers never are able to make good.” “I believe you have a good bank in town?” “Yes; the First National.” “Well, I have with me a certified check for ten thousand dollars, and I believe the cashier at your bank will recognize it as good. If you are not running a bluff I’ll step out to the bank with you and deposit my check in the hands of one of the bank officials, with the understanding that I am backing Frank Merriwell and you are to put up a similar sum to back your own team. Now you put up—or shut up!” Cameron was somewhat surprised, but he recovered quickly, still confident that Doom was still bluffing. “Come on!” he almost shouted. “Come out to the bank! I can raise ten thousand dollars if your old check is good. I’ll do it, too! It will be like finding a small fortune.” The man from Chicago was ready to go. “But wait a moment,” said the manager of the local team. “I want to tell you something. I hate to be fooled, and it makes me very disagreeable. In case I accompany you to the bank and find this is what I believe it to be—a bluff—you’ll be very sorry. I warn you that you’ll leave Cartersville in such a condition that you’ll require medical attention for some time to come.” “Come on, man,” said Doom, with curling lips. “You are wasting your breath. You’ll find I am in earnest, although I fancy you are the one who will squeal.” Together they left the hotel and started for the bank. The man who had sold Doom a cigar and overheard this conversation ran out after them and told what had happened to a number of loiterers who were in front of the hotel. Immediately these loiterers hustled away after Cameron and Doom, greatly excited over what they had heard. “Ten thousand dollars!” exclaimed one. “Cameron will make a fortune off this first game!” “I don’t believe it!” declared another. “Nobody is fool enough to bet Cameron ten thousand dollars.” “The man is joking,” was the opinion expressed by a third. “Then it will be a mighty poor joke for him when Carey Cameron is done with him,” said the first. Outside the bank they lingered and waited. Cameron and Doom were inside a full quarter hour, but finally they appeared. Immediately the crowd besieged the manager of the local team to know if such a bet had really been made. “Sure thing,” nodded Cameron, with a smile of confidence. “This gentleman had a certified check that was good, and I covered it. There is a wager of ten thousand dollars on the result of the game to-day.” The report spread like wildfire. In less than an hour, it seemed, every man, woman, and child over six years of age in Cartersville knew of the amazing wager that had been made. The report was wired to surrounding towns and carried into the country in various ways. By midday people from out of town began to appear in Cartersville. At first they straggled in, but as the time passed they came faster and thicker. They came from the country in conveyances of all sorts, while the 12.48 P.M. train brought at least a hundred. The streets took on a surprising appearance of life. Men gathered in groups and discussed the wonderful bet that had been made. Some were skeptical and pronounced it an advertising dodge on the part of Cameron. Others there were who knew the stakeholder, or knew those who did know him, and they protested that the wager was on the level. At any rate, never had so much excitement over a game of baseball been aroused in such a brief time in the whole State of Iowa. A later train brought a still larger number of visitors, and the influx from the country continued up to the hour for the game to begin. No sooner were the gates opened at the ball ground than the great crowd waiting outside made a push to get in and secure seats. It required the united efforts of a number of local officers, who had been summoned by Cameron for that purpose, to hold the eager people back. In the meantime Merriwell and his friends had learned of the wager. At first all were inclined to laugh over it, thinking, like many others, that it was an advertising scheme. After a while, however, they began to have reasons to believe there was something of truth in the report. “By Jove!” cried Morgan. “We’ll be playing for a fortune this afternoon, boys!” “If such a bet has actually been made,” said Rattleton, “we won’t have any show to win.” “Wh-wh-why not?” demanded Gamp. “Don’t you fancy for a moment that Carey Cameron is the sort to lose that amount of money. He’ll fix it somehow so he can win.” “Dost hear the croaker?” inquired Jack Ready. “Rattles, you have a very weak heart.” “See if I’m not right!” exclaimed Harry. “Cameron is no fool.” “I am certain that he depends mainly on the skill of his players,” said Frank. “He cannot believe it possible that a lot of amateurs stand a show of downing those professionals. There will be nothing crooked as long as it appears to him that his players have the best chance to take the game. We must fool them, fellows.” “We’ll do our best, Frank,” was the assurance they gave him. Never had there been such a wonderful outpouring to witness a baseball game in all that region. When Frank and his players entered the inclosure they found the stand packed, the bleachers black with people, and a great gathering held back by ropes stretched on both sides of the field. Besides that, the officers employed by Cameron were kept busy chasing spectators out of the outfield. Not only did it seem that all Cartersville was there, but more than a like number of people had come in from outside the town. The Merries were received with a hearty cheer. They hurried to their bench, lost no time in laying out their bats, pulling off their sweaters, adjusting gloves and preparing for practice. At a word from Frank they trotted briskly onto the field, and practice began. Merry warmed up with Stretcher as catcher, while Hodge and Starbright batted to the men practicing on the diamond and in the field. Frank was slow and deliberate in warming up. He did not use speed, but limbered his arm gradually. Toward the last he threw two or three fairly swift ones and let it go at that. The players, however, went at it in earnest from the very start, and both infield and outfield work was of a snappy and sensational order. At a quarter to three the local players, with Cameron leading them, appeared. Instantly there was a great uproar from the toughs of the town who had been supporting Cameron. They rose up and yelled like a lot of Indians. Not only that, but they insisted that every one else should yell and threatened those who did not. “Them’s our boys!” they cried. “Cheer, you duffers—cheer!” If any one declined to cheer he suddenly found himself beaten over the head by two or three of the toughs, who insisted that he must “open up,” and this came near causing a general riot. Not for at least five minutes after the arrival of the Cartersville team did the commotion cease. Even then there were symptoms of anger and resentment in a number of places amid the crowd, and it seemed as if a spark might fire the powder and bring about an explosion. Frank called his players from the field, and the home team went out for practice. Merry found an opportunity to speak with Cameron, but the local manager insisted on his privilege of choosing innings, declining to toss a coin for choice. “All right,” smiled Frank. “Take your choice.” Imagine his surprise when Cameron said: “We’ll go to bat first.” “Suit yourself,” nodded Frank, with pretended disappointment. Cameron had played into his hands without knowing it. The practice of the locals was soon over. Then big Dick Starbright was accepted as the umpire. The time for the game to begin had arrived. Merriwell gave the signal, and his players ran out onto the field, scattering to their different positions. Frank entered the pitcher’s box. “Play ball!” cried Starbright. At this point, to the astonishment of Frank, the mysterious veiled woman darted onto the diamond and grasped his arm with her gloved hand. “Win this game, Frank Merriwell!” she urged huskily. “My fortune—yes, my life—depends upon it!”","sourceLink":"http://novel.tingroom.com/jingdian/1950/55820.html","bookId":754,"book":{"id":754,"title":"Frank Merriwell\u0027s Endurance","description":"简介： On the way East with his athletic team Frank Merriwell accepted the invitation made by Hugh Morton to stop off at Omaha and visit the Midwestern Athletic Association....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1950","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
