{"id":23344,"no":28,"title":"CHAPTER XXVIII NO CONTROL.","content":"Hodge knew Merry’s ankle was in poor condition, but he was not aware of Frank’s trouble in securing control of the ball. Therefore he was satisfied when he donned the body protector and mask that there would be a great and immediate change in the run of the game. He doubted not that Merriwell would check the run getting of the enemy. Cronin, the lank and lively third baseman of the Elks, was the first batter to face Frank. Merry knew Cronin was a great sacrifice hitter, his position being second on the batting list. Still the man had shown that he could hit out beautifully when occasion demanded, and, with no one ahead of him on the bags, he would be sure to try for a hit or a pass. This man’s only weakness was a high ball, close to the shoulder; and sometimes he could hit those safely. Frank’s first ball was handsomely placed and cleanly missed. “Str-r-r-rike—kah!” called the umpire. “Hit id vere id missed you!” yelled Dunnerwurst, from the field. “That’s the place, Merry,” laughed Hodge, all the clouds gone from his face. “It’s so easy!” “Verily it is a thing of great delight,” murmured Jack Ready. “How can he hit them when he can’t see them?” rumbled Bruce Browning. Dade Morgan, sitting on the bench, his left hand clasping his right arm above the elbow, smiled and nodded with satisfaction. “Merry will save the game,” he muttered to himself. “He’s a snap, Billy,” called Rush, the Elkton shortstop. “Let those whisker trimmers go.” Cronin nodded and winked. He was satisfied that he would have no trouble in getting what he wanted off Frank. As for Merry, he was agreeably surprised by his success in placing the first ball. “If I can only keep that up!” he thought. His next ball was lower, but still close. Cronin let it pass. “Ba-a-a-all—ah!” came from the umpire. “He’s got to put it over, Billy,” chirped Rush. Hodge snapped the ball back to Frank, who instantly returned it. Cronin was caught napping and did not try to hit. It cut the plate in halves. “Str-r-r-rike—kah two!” “Come, come, Mr. Batter!” yelled one of the spectators; “smoke up! You’re in a trance.” “It surely is a thing of exceeding great delight,” again murmured Ready. Cronin was somewhat disgusted. He was not, as a rule, the sort of chap to be caught in such a manner, and it made him sore. His face flushed and his eyes glinted. He gripped his bat and stood ready for anything. Frank tried an outcurve, causing it to sweep outside the plate. Cronin grinned derisively and let it pass. “Ba-a-a-all—ah!” “Even with him, Merry,” said Hodge. “Put the next one right over. Let him hit it a mile—if he can.” At the same time he called for a drop. Frank had abandoned the practice of shaking his head when about to pitch a ball different from the one called for. Instead, he assumed a position that plainly told Hodge he would use a rise or a very high ball. It proved too high, and Cronin did not move his bat. “Ba-a-a-all—ah three!” announced the umpire. “Got him in a hole, Billy!” chuckled Rush. “Now he’s got to put ’er over.” Merry had no intention of putting the next one straight over. It was his object to keep it shoulder high and on the inside corner. This time, however, he did not gauge it accurately, and, to his dismay, he did put it over the middle of the pan and a trifle lower than the batter’s shoulder. “Just what the doctor ordered!” cried Rush, as Cronin hit the ball. It was a clean drive to left field, and, by swift running, Cronin succeeded in reaching second before the ball could be fielded in. “Why, how easy he is!” laughed Rush. “Put it over the fence, Sparks.” Sparks, the centre fielder of the Elks, was the next batter. Although Merry was greatly displeased with himself, he did not betray it. He knew it was the easiest thing in the world for a disappointed pitcher to take the spirit out of an entire team. Hodge was cheerful. “Accidents will happen, Merry,” he said. “Never mind that.” Apparently Frank did not mind. “I’ll have to try the double shoot for a strike-out ball,” he mentally decided. Sparks expected to find Frank easy. “It’s a shame to do it,” he declared. “I’m afraid you’ll loss your reputation to-day, my boy.” “Don’t let that worry you,” said Frank, with perfect good nature. “Oh, I’m not worrying. Still I’m sorry for you. It can’t be helped, you know. We can’t afford to let you youngsters have this game. The whole Central League would laugh at us.” The Elks had discovered that Hodge was a beautiful thrower to the bags, and it was not difficult to hold Cronin close to second, although he took sufficient lead to go to third on a sacrifice or any sort of a scratch hit. Cronin was a fast runner, and Frank knew he might score on a clean single. Merry worked carefully. Finally, with two strikes and three balls called, he ventured to try the double shoot. Sparks was fooled handsomely and missed. “Str-r-r-rike—kah! You’re out!” said the umpire. “Now you’re doing it, Merry!” nodded Hodge. But Frank had hurt his ankle with that final delivery, and he limped about the pitching plate a few moments. “Can’t use the double shoot unless I’m willing to go onto the shelf,” he decided. “It’s out of the question.” He felt now that it was necessary for him to win the game without resorting to his most effective curve. “Try it on me,” invited Rush, the talkative, as he danced out to the plate. “I’d like to,” thought Frank. “You’re one fellow I’d enjoy striking out.” “Get after him, Rushie!” urged an Elktonite. “You say he’s easy. Now prove it.” Rush made no retort to this, but he hit the second ball pitched. The ball was driven straight at Badger, who was playing at short. Buck felt sure of it, and Cronin did not try to take third, although he was ready to move to draw a return throw if the stocky young Kansan whistled the sphere over to first. Just before the ball reached Badger it struck a small pebble and was deflected. Buck managed to cuff it with his glove, but did not get hold of it. It rolled toward second. Badger went after it, Cronin being forced back to the bag. Merry took in everything quickly, seeing that it would be dangerous for the Kansan to attempt a throw to first. It was extremely doubtful if Rush, a fast runner, could be caught, and a bad throw would let Cronin reach third, to say nothing of the possibility that it might permit him to score. Therefore Frank shouted for Buck to hold the ball. “Well! well! well!” laughed Rush, as he crossed the initial sack. “This is too much!” “It is,” agreed Browning. “You should have been out.” Badger was dismayed, but he did not receive a calldown from Frank. Nevertheless, Merry regretted that he had not placed Morgan at short after taking him out of the box. Buck was playing out of his regular position, while Morgan could cover shortstop’s territory in a most beautiful manner. It was too late now, however; Morgan had been retired. Badger was the only man for the position, Stretcher having left the team at Ashport to return to his home in Missouri. Jack Lawrence, the manager of the Elks, was pleased by the prospect of victory. On hearing that the Elks would play with the Merries, the managers of other teams in the league had given Lawrence the laugh, all of them saying his great aggregation would be downed by the visitors. Lawrence was anxious to win the game. Glade, the right fielder of the Elks, was the next man to hit. That is, he was the next man in order on the batting list. He did not try to hit, for it was not necessary. Merriwell’s control was poor, and he could not find the plate. Two balls were called. Then came a strike, although, if anything, the umpire favored Frank. “He can’t find the pan again,” yelled a coacher. It seemed that he was right, for the next one pitched was a ball—and the next. Glade was sent to first. The bags were filled, with only one out. Well might the Elks and the Elkton crowd be confident and jubilant. Things were coming their way. The local team had played an uphill game, and victory seemed in sight. Frank was in a tight box. Tinker, the next batter, was no slouch with the stick. He had a reputation for making hits when they were badly needed. Behind the wires of his mask, the face of Bart Hodge looked grim and a trifle worried. Hodge knew now that Merry was in anything but good form. He realized that the game might go against them, and no one disliked to lose a game more than did Bart, the bulldog. Especially hard was it to lose after seeming to have victory within reach. But Hodge did not have a thought of giving up. “Line it out, Tink!” urged Rush. “We’ve quit fooling. Give us some runs.” Tinker looked harmless enough. He was an awkward chap with a half-foolish face. Apparently he did not waste much of his time in thinking real thoughts. Merry knew the fellow was not nearly as foolish as he appeared. So Frank worked carefully with the batter, using a change of pace, but making no further effort to throw the double shoot. Finally Tinker put up a foul. Hodge went after it, although the spectators yelled derisively, thinking he could not touch it. In some manner the catcher stretched himself amazingly and got the ball on the end of his big mitt as it was falling to the ground. It bounded off. On the dead run, Bart caught it a second time. And held it. After a moment of silence, the spectators applauded. The people of Elkton were generous enough to recognize a good play, whether made by one of their own team or by an opponent. “Hard luck, Tink!” cried Rush. “That catcher ought to be decorated with horseshoes.” “Clever, Bart,” smiled Merry approvingly. “Only one more man this inning, Frank,” said Bart. Could Merriwell “get” the next batter? The situation was one to work up the spectators, who felt that it would be shameful to have their new team, on which they had spent so much money, defeated by the visitors. “A pall nefer couldt catch dot Part Hodge!” shouted Hans Dunnerwurst joyously. Sitting on the bench, Wolfers growled a little to the manager of the team. “What’s the matter?” he said. “Why don’t they hit some? I can’t win the game if they don’t hit. I’ll hold those kids down all right, but the rest of the team must bat a little.” “A hit right now will win the game,” asserted Lawrence. “But Tink was the man to make the hit. If he had lifted a long one to the field it would have been something. Cronin could have scored on it, even if it had been caught.” “Cross will have to turn the trick.” “He ought to,” nodded Wolfers. “That pitcher is pie. He’s pie, I say. Don’t see how he ever got such a reputation.” “He has a lame ankle to-day.” “Don’t you think it! That’s a bluff. He was afraid to pitch against us, and so he put up that squeal about a lame ankle.” “But the rest of his players say his ankle is lame.” “He gets round on it all right, don’t he?” “He limps.” “Well, a lame ankle isn’t much beside a lame wing. Hey, there, Lem, what are you doing?” Cross had reached for a wide one. He shook his head and settled his feet into position. “He’s trying for the fence,” said Wolfers. “Better stop him.” Instantly Lawrence rapped on the bench in a manner that caused Cross to give him a look. The manager signaled for the batter to attempt to single. “Oh, it’s easy!” growled Cross. Lawrence persisted. A moment later the batter hit a ball that struck the ground and rolled slowly toward Frank. Merry sprang forward, but as he sought to pick the ball up his weak ankle seemed to melt beneath him, and he went down onto one knee. He secured the ball, however, and snapped it instantly to Hodge, who was standing on the plate. Bart promptly whistled the ball to Browning, although it was not necessary, Cronin having been forced. The local team had failed to secure a run in the eighth, after having everything in its favor. The crowd was keenly disappointed. Frank was relieved and his players were delighted. Now came the ninth inning.","sourceLink":"http://novel.tingroom.com/jingdian/1950/55832.html","bookId":754,"book":{"id":754,"title":"Frank Merriwell\u0027s Endurance","description":"简介： On the way East with his athletic team Frank Merriwell accepted the invitation made by Hugh Morton to stop off at Omaha and visit the Midwestern Athletic Association....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1950","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
