{"id":32132,"no":2,"title":"INTRODUCTION.","content":"Very beautiful was the long vista of the elm-arched street. So irresistibly did it woo the eye to linger among its gray columns and green arches, or wander adown its fair, temple-like perspective to the hazy vanishing point, that the wayfarer might easily forget to observe what sort of dwellings were ranged along its sides. Nor did they seek to force themselves upon his notice. They were all plain, substantial structures, with no obtrusive marks of ostentation or of meanness about them; and they all stood a little back from the street, leaving room for a trim grass-plot, or a thicket of flowering shrubs, between them and the passer-by. They would impress him, collectively, as genuine, well-to-do homes, free alike from the struggles of poverty and the temptations of wealth, without troubling him to recognize them individually, or diverting his gaze from the over-arching elms that were so much better worth his looking at. \n \n Such, at least, would be the fact, until he came to a certain corner; where a large square structure of stuccoed brick, coming boldly forward to the pavement, and planting its heavy steps thereon, would be sure to arrest his glance, and, perhaps, faintly stir his curiosity. It was too large for a private building, and too unpretending for a public one,—what was it? If he had put the inquiry into audible words, he would have been told that it was the Medical College. And if his interlocutor had chanced to be a white-haired, genial-faced old man, long ago flung aside from the stream of active life, and, consequently, with time on his hands for a little chat with a stranger,—he would, doubtless, have woven into his answer the popular witticism;— \n \n \"Everything here, sir, is arranged just as it should be. The divinity school is on the road to the poorhouse; the law-school adjoins the jail; and the medical college—this building before you, sir—is hard by the cemetery;—you can see the monuments rising above the hedge yonder.\" \n \n But the young man now coming up the street, through the pleasant play of sunshine and shadow beneath the elms, would neither have asked the question, nor smiled at the answer. He knew the stuccoed building well, as a three years\u0027 occupant thereof must needs do; and he had heard and repeated the witticism too many times to leave it the faintest sparkle. It was doubtful, too, whether he gave a thought to the loveliness of the elm-arched vista that stretched before him,—partly by reason of his familiarity therewith, partly on account of a preoccupied mind, and still more, perhaps, because his bright, brisk, energetic temperament was not of the sort which is quickest to feel subtile charm, and recognize the delicate outline, of the spirit of beauty. He came on rapidly, with an elastic step and a cheery whistle, and, as he neared the college, he cast a quick glance at one of its upper windows. What he saw there would have been a pretty enough sight to most people,—merely a tiny brown bird hopping to and fro on the window-sill, and turning its small head briskly from side to side in its search for infinitesimal crumbs,—but it brought a shadow to his broad, frank brow. \n \n \"Not yet up,\" he muttered, \"or that wren wouldn\u0027t be trotting up and down there so complacently! To be sure, he may have gone out, but it isn\u0027t likely.\" \n \n Neither for the look nor the thought did he pause, but strode straight up two flights of stairs, his firm tread resounding loudly through the empty, uncarpeted halls, and knocked at the door of a front room. There was no response. He knocked again, with a somewhat impatient hand, tried the door and found it locked, waited a moment, beat a third emphatic rat-tat-too upon the panel, without eliciting other reply than a faint and dreary echo from the attic above; and, finally, turned on his heel, and walked down-stairs. At the head of the second flight, a thought seemed to strike him; after a moment of hesitation, he turned and knocked at a door close at hand. Scarcely waiting for the prompt \"Come in!\" he opened it, with the question,—\"Have you seen Arling this morning?\" \n \n The occupant of the room was a broad-shouldered young man, sitting at a table covered with books and papers, and deeply absorbed in study. He only half turned his head, showing a regular, clear-cut profile, as he answered,— \n \n \"No. I left him so late last night that I overslept this morning, and have thought of nothing but making up lost time. And really, Trubie, a man might be excused for forgetting his best friend—if he had one—in examination week. But, is Arling any worse?\" \n \n \"That\u0027s what I should like to know, Roath,\" returned Trubie, planting himself a little more firmly on the threshold, but taking no notice of the chair that the other had carelessly pushed toward him. \"At any rate, he\u0027s out.\" \n \n Roath started, and turned completely round, giving a view of a square-featured, somewhat moody, but still handsome, face. \"Out!\" he repeated, looking both amazed and startled. \n \n \"So it would seem. The door is locked, and I rapped and rattled loud enough to wake the dead.\" \n \n \"Oh,\" said Roath, with a prolonged falling inflection. And after a moment\u0027s consideration, he turned back to his books, as if there were no more to be said. \n \n Trubie lingered. Not, evidently, from any special liking for Roath\u0027s society, but because he was undecided what to do next. \"I don\u0027t understand it, Roath,\" he said slowly. \"You know Arling was to have kept his room to-day, by way of gaining strength, and guarding against a relapse. And we were to have gone over \u0027Barnes\u0027 together this morning, so as to be all primed for Professor Beers to-morrow. What can he have done with himself?\" \n \n \"Perhaps,\" said Roath, absently, with his eyes on his book, \"some of the others may have seen him.\" \n \n Trubie took the hint—if such it was meant to be—and withdrew. He spent the next half hour in knocking at sundry doors, and repeating, with slight variation, the questions and remarks wherewith he had favored Roath. No one had seen Arling; no one knew anything about him. All seemed surprised to learn that he had gone out; but all were laboriously cramming for the examinations in progress, and the surprise made but a faint and transient ripple on the surface of their troubled minds. Trubie\u0027s persistency impressed them much more strongly; they wondered that he had leisure to bestow upon any anxiety not connected with those dreaded examinations, any fear save that of failing to secure the right to sign himself, \"Frank Trubie, M.D.\" \n \n Nor—to represent him fairly—was the young man himself wholly insensible of his absurdity. \"Well!\" said he, at last, \"I can\u0027t afford to spend my morning in this way. I must go back to my room, and set to work. When Arling comes in, tell him I\u0027ve been here.\" And away he went through the dancing elm-shadows, more quickly than he had come. \n \n Two hours passed. Then Roath closed his books, gathered up his papers, and took his way to the examination room, amid the groups of assembling students. Many eyes followed him, some with admiration, some with envy,—few or none, it was plain to see, with affection. \n \n \"No question but that he\u0027ll pass!\" said one. \"He\u0027s all brain,—I\u0027d be content with half as much.\" \n \n \"And his memory!\" exclaimed another. \"It appears to be constructed on the principle of a rat-trap; ingress is easy, egress—not provided for!\" \n \n \"No one can keep step with him but Arling,\" remarked a third; \"if he gets well enough, there will be a close race between them.\" \n \n \"I bet on Arling,\" said a fourth,—a somewhat slender young man, with an easy, almost careless air, but a thoughtful face,—Mark Tracey by name. \n \n \"Eh! why?\" asked the first speaker. \n \n \"Because, as you said just now, Roath is all brain. Whereas Arling, while he does not want for brain, has also a heart and a conscience. And in medicine, as in everything else, that wonderful trio are too strong for brain alone.\" \n \n \"Moralizing, as usual,\" returned the other with a light laugh. \n \n \"Not at all. It is plain common-sense. The history of the world shows it. Perhaps there is no better type of pure intellect than Satan. And Michael the archangel does very well for a representative of love, duty, and intellect, combined. You remember which beat?\" \n \n \"It is not possible, Tracey, that you believe that fable!\" \n \n \"Grant that it is a fable,\" replied Tracey, lifting his eyebrows;—\"it nevertheless stands for the concrete wisdom of the ages which preceded it.\" \n \n The last words were spoken on the threshold of the examination room, and, of necessity, closed the discussion. \n \n Roath\u0027s examination, on this day, did not disappoint the general expectation. Although somewhat paler than ordinary, he was thoroughly self-possessed; his answers were clear and to the point; not once did his memory play him false; scarcely once did he hesitate for a word. He gave evidence not only of close study, but of careful analysis, and profound, sagacious thought. But he looked worn when it was over, as if the mental strain had been severe; and seemed scarcely to hear the comments and congratulations showered upon him. \n \n Into the midst of these burst Trubie, with the old question, \"Have you seen anything of Arling?\" and hardly waiting for the general \"No\" which answered it, upstairs he rushed, three steps at a time, to the room of his friend. The stream of talk had scarcely resumed its flow, ere he was back again, with a hurried step, and a perturbed face. \n \n \"It\u0027s odd about Arling,\" he began, abruptly. \"I can\u0027t get any answer, and there\u0027s nothing stirring in the room. But I looked into the keyhole, and the key is certainly inside.\" \n \n Some few of the students, startled by his words, and the deep gravity of his look, gathered around him to discuss the matter, when a stout, gray-haired professor came out from the examination room. \n \n \"Good day, Mr. Trubie,\" said he, as he passed the group. \"I hope your patient is doing well.\" \n \n \"I—I don\u0027t know, sir,\" faltered Trubie; \"I have not seen him since yesterday, at dusk. And he is unaccountably missing this morning;—at least, I thought he must be out when I went to his room, at eight o\u0027clock, and couldn\u0027t get in. But I have just been up again, and—and the door is certainly locked on the inside.\" \n \n Being already in possession of the main facts of the case,—namely, that Alec Arling, one of the class of medical students now undergoing examination for their degree, had been suffering for some days from severe and increasing intestinal trouble, and had been advised by the faculty to keep his room for a day or two, under the care of his friend, Frank Trubie;—the professor now, by means of a few rapid questions, elicited the additional facts, that Trubie had been suddenly called away, on the previous evening, by family affliction, to his home in a near suburb, and had spent the night there, and that Edmund Roath, who had volunteered to keep a little watch over the sick-room during his absence, had remained with Arling till past midnight, engaged in comparing notes of clinical lectures, and in psychological talk (with which matters Arling would busy himself, in spite of remonstrance), and had then left him, recommending him to go to sleep at once, and had heard the door duly locked on his exit. Roath further stated that, in consequence of this protracted sitting, and previous hard work, he had slept late this morning; and, taking it for granted that Trubie, according to promise, was already back at his post, he had seated himself at his books, immediately upon rising. Very shortly after, Trubie had appeared, and informed him that Arling had gone out, whereat he had been considerably surprised,—not that the young man was unable to leave his room, but because it was inexpedient to do so. Nevertheless, he frankly acknowledged that his mind was too much preoccupied to give more than a passing thought to the matter, especially as he knew well that any remissness on his part was sure to be amply atoned for by Trubie,—he and Arling being, as everybody knew, the Damon and Pythias of the class. \n \n The professor was a man of few words, quick conclusions, and prompt action. \"There is but one way of getting at the bottom of the matter,\" said he, at the end of this rapid statement. \"Let somebody bring a crowbar, and pry open the door.\" \n \n Scarce sooner said than done. The door yielded easily to the rude implement, in Trubie\u0027s impetuous hands, and was followed by a rush of the assembled students toward the opening,—though, even in this moment of eager curiosity, the instinct of subordination allowed the professor to in first. He went straight to the bed, where was seen a human form, lying on its side, in an easy attitude of slumber. He bent for a moment above this form, while a sudden silence fell upon the startled spectators,—he touched the brow, lifted the hand, and then, turning slowly round, said, in deep, serious tones;— \n \n \"He is dead.\" \n \n Trubie let fall the crowbar, darted forward, and caught the hand of his dead friend, with a kind of indignant incredulity. But the icy touch, the marble pallor, the lifeless weight, brought instant conviction. He stood as if stunned. \n \n The professor had turned from the bed to the table, where a glass, a spoon, and four or five phials, stood within easy reach of the dead man\u0027s hand. He held the spoon to his nostrils, and then examined the phials, holding them up to the light. In one, labelled \"Mag. Sol. Morph.,\" he seemed to find what he sought. \n \n \"Mr. Trubie,\" said he, turning round, with the open phial in his hand, \"did your friend ever say anything to you, that indicated a disposition to suicide?\" \n \n The question roused the young man from his stupor, although it was a moment or two ere he seemed to comprehend its purport fully. \"Never, sir!\" he exclaimed, indignantly, a hot flush rising to his brow,—\"Alec Arling would have scorned to do such a thing! He was neither a fool nor a coward, sir! Besides, there was no earthly reason why he should do it.\" \n \n The professor shook his head. \"He seems to have done it, nevertheless,\" said he, thoughtfully. \"To be sure,\" he added, after a moment, \"it is barely possible that he took it by mistake.\" \n \n \"Most likely, that is the real state of the case,\" remarked Roath, who was standing on the other side of the table, calmly and gravely observant of the scene. \n \n In temperaments like Trubie\u0027s, the transition from grief to anger is often curiously direct; the one is the natural outlet of the other; and in this instance, the sound of Roath\u0027s voice seemed to afford the bereaved and horrified young man the object of indignation that he so sorely needed. Springing quickly forward, and clenching his fist, he confronted the speaker with a convulsive rage and excitement in strong contrast with Roath\u0027s grave composure. \n \n \"You know better!\" he shouted. \"It was neither a suicide nor a mistake. You killed him!\" \n \n Roath gave a violent start, and seemed about to speak, but his lips only trembled nervously. He was evidently confounded, almost bewildered, by the suddenness and fierceness of the accusation. \n \n Trubie went on with scarce a moment\u0027s pause, and with, still hotter indignation, \"You were last in his room—you acknowledge it. And you hated him.\" \n \n Roath had regained his self-command,—which, to do him justice, he had but for an instant lost. \"If you were not beside yourself with grief,\" said he, coldly, \"there could be but one answer to such a charge as that. As it is—\" \n \n \"\u0027As it is,\u0027 I repeat it,\" interrupted Trubie, with bitter scorn. \"I repeat it, and am ready to maintain it, always—anywhere—anyhow!\" \n \n Roath drew himself up. \"I, too, am ready,\"—he began, haughtily, but the professor interposed. \"Mr. Roath,\" said he, with dignity, \"I command you to be silent. Mr. Trubie,\"—laying his hand on the shoulder of the agitated young man, and speaking in a tone of grave rebuke,—\"much may be forgiven to the first excitement of sorrow and horror, but this is going too far. Such an accusation is not to be made lightly.\" \n \n \"Lightly!\" repeated the frantic Trubie;—\"he hated Alec, I tell you! He couldn\u0027t forgive him for rivalling him—aye, and beating him, too—everywhere; in scholarship, in popularity, in\"—he hesitated for an instant,—\"in love.\" \n \n Roath\u0027s face grew dark; a frown traced a deep, vertical line between his brows; he set his teeth, and made a quick stride forward. But a dozen hands seized him, a dozen others laid hold of Trubie, and both were half forced, half led away to their rooms; while the faculty of the college, hastily called together, gathered around the corpse, to examine more minutely into the cause of death. \n \n \n A coroner\u0027s jury was duly summoned. It examined the body, weighed the evidence, and being about equally divided in regard to the question of suicide, finally agreed upon \"Accidental Death by Poison,\" as, upon the whole, the safer and less objectionable verdict. There seemed to be no good reason to suspect murder, nor any ground whatever for implicating Roath, or anybody else, as a perpetrator thereof. \n \n Trubie, to be sure, persisted in his accusation; but it was with a vehemence and a dogmatism so unlike his wonted careless good nature, as to suggest the idea that his mind had been temporarily thrown off its balance by the shock of his friend\u0027s death. This idea gained color from the fact that all which he could offer, in support of so grave a charge, was the statement that he had long seen or suspected, in Roath a secret hatred of Arling, and a willingness to do him covert mischief. He had even mentioned the suspicion to his friend; but Arling—being of the most candid and generous, as well as unsuspecting temper, unable to conceive of any but an open, honorable enemy—had refused to entertain it for a moment. Trubie also solemnly affirmed that his passionate accusation of Roath, by the side of the newly-discovered corpse, was the involuntary result of an intuition so sudden, so clear, and so powerful, that, though little given to look for supernatural agencies in human affairs, he could not rid himself of the conviction that it was the direct inspiration of his dead friend. But it may readily be imagined how much weight a statement of this sort was likely to have with men of plain minds and sturdy understanding, searching among the external phenomena of the event for grounds upon which to base a reasonable verdict. \n \n On the other hand, the theory of accidental poisoning was supported, negatively, by the lack of apparent cause for self-destruction; and positively, by the fact that on the dead man\u0027s table, side by side with the potent narcotic before mentioned, stood a phial of exactly the same size, and with equally colorless contents. Of this Arling had been accustomed to take two or three spoonfuls, mixed with a few drops of a third preparation of exceeding bitter flavor. A careless hand might have mistaken the one phial for the other. The taste of the morphine, so swallowed, would be much disguised; while the dose was sufficient, under the circumstances, to produce death. It will be seen, therefore, that the verdict rendered was the only one upon which a coroner\u0027s jury could well have been expected to agree. \n \n The body was next solemnly laid in a vault, to await the disposal of the parents, who lived in a western state; and the widening circles of excitement, horror, curiosity, and regret, of which it had been the unconscious centre, rapidly subsided, or were effaced by the growing interests of the now imminent closing examination. \n \n Even Trubie, though he flatly refused to acquiesce in the coroner\u0027s verdict, was forced tacitly to accept its results. He took refuge in a complete personal proscription of Roath; he neither spoke to him nor looked at him; he treated him precisely as if he did not exist. To a person of Roath\u0027s cold, hard, steely temper, and obtuse sensibilities, this demeanor was, perhaps, the most tolerable of which the circumstances admitted. It spared him the necessity of being either conciliatory or resentful; he was well content to ignore Trubie as completely as Trubie ignored him. \n \n He soon found, however, that he had greatly underestimated the moral force of an abhorrence deeply rooted in immitigable distrust. Though largely given to psychological studies, and profoundly learned, for his years, in the intricacies and tendencies of the human mind, he was astonished to find how soon the atmosphere grew heavy around him, how quickly Trubie\u0027s dogged dislike communicated itself, more or less strongly, to others; while the increased cordiality of a few, though kindly intended to offset it, only served to point him out more clearly as one set apart, for the time, from life\u0027s ordinary course and level, by the force of an unenviable, if undeserved, notoriety. Not that he ever appeared to be conscious of either of these manifestations, or of their ultimate effect. Nature had given him a moral and intellectual fibre so tough, and he had trained himself to a control so perfect, that the keenest observer could not detect the least variation from his usual composed, concentrated, somewhat moody demeanor. Whatever of suffering, or of sin, lay at the bottom of his heart, not a shadow thereof was seen in his face. \n \n It might well be, however, that he was glad when the examination was over, his degree obtained, and himself left free to depart by any one of the many paths which life opened before him. \n \n Yet he was in no suspicious haste to be gone. His departure was fixed for an early hour on the following morning. Meanwhile, at dusk, he went out for his habitual solitary stroll. Never had he invited companionship, and was it thrust upon him. He had no intimate friend. Though he had been not only admired, but respected, by many, for his intellectual gifts, and for a certain firm, even texture of character, and dispassionateness of judgment, that often looked like virtue, whether such in reality or not, he was beloved by none. \n \n Where he went, what he thought, is not to the purpose of our narrative. His walk was long, however; he did not return until dusk had deepened into clear and starry, but moonless night. As he came up through the great, dim elm-arches, with their solemn resemblance to a vast cathedral nave, a strange tremor seized him. A complete sceptic in regard to all superstitions and forebodings, he yet felt his nerves shaking with an undefined fear; he could not rid himself of the impression that something unprecedented and sinister was at that moment taking place. Reaching the college, he ascended the steps with a strange mixture of eagerness and reluctance; and immediately became aware of a subdued but excited murmur of voices in the upper hall. At the same moment, Mark Tracey came rushing down the stairs, carpet-bag in hand. \n \n \"What\u0027s up?\" asked Roath, in a voice that trembled in spite of himself. \n \n \"I don\u0027t rightly know,\" responded Tracey, hurriedly,—\"I am so late for the train, that I couldn\u0027t stop to hear. Something about a diamond that Trubie has found in Arling\u0027s glass—the one from which the poor fellow drank his death-draught, I believe. Good-by!\" And away he went. \n \n Had he waited but for an instant, he would have been startled and spellbound by the deadly whiteness of Roath\u0027s face. Through all the glimmering indistinctness of the dimly-lighted hall, his features were clearly discernible, by reason of that marble pallor. For the moment, he seemed to lose sense and consciousness; he would have fallen, except for the friendly support of the wall against which he leaned. \n \n But it was only for a moment. The man\u0027s hard energy of character, his iron will, his rigid self-control, though they had gone down before the suddenness and severity of the shock, quickly rose again. With a mighty effort, he rallied his broken forces; back into his face came the look of purpose, the sense of power, the sternness of immitigable resolve; and this with so rapid and almost imperceptible a change, that it seemed as if the granite man must have stood there from the first, and the weak man not at all. While Tracey\u0027s receding footsteps still echoed faintly from without, going swiftly in the direction of the city\u0027s principal thoroughfare,—while the murmur of voices from above was still at its eager, wondering height,—he had turned, noiselessly descended the steps, and was gliding down through the sombre elm-arches, swift and stealthy as a phantom. The street was shadowy at best, but he chose the darker side; it was wellnigh deserted, at that hour, but he soon turned into a still less frequented one, and then struck into a more assured and less noiseless, as well as swifter, pace. \n \n As he went, he drew a ring from his finger, and glancing hastily round, to make sure that he was unobserved, he flung it far into the dusky shadow of a garden thicket. Only the day before, a friend had said to him,—\"Roath, do you know that the stone is gone from your ring?\" and he had answered,—\"Yes; and I am sorry to have lost it, for it was my father\u0027s.\" And he had proceeded to point out the antique setting, and to describe the peculiar shape and tint of the gem which it had inclosed. He gnashed his teeth as he recalled the short, but momentous conversation. But for that, he would not have fled. \n \n The garden into which he had flung the ring adjoined a small cottage; and, at one of the open windows, a gray-haired dame sat in a high-backed chair, listening to the clear, musical voice of an invisible reader. This fragment of a sentence floated out to him on the dim night air,—\"He shall be holden with the cords of—\" \n \n Even at that moment, the words struck him sharply. Involuntarily he slackened his pace, and half-turned to catch the remainder of the sentence, but it was inaudible. The uncertainty before him, the terror behind, were, for the time, almost forgotten in a certain chill curiosity. \"Holden with the cords—holden with the cords,\" he repeated to himself, as he hurried on,—\"I wonder what book she was reading! I should really like to hear the end of that sentence!\" \n \n Still keeping up his swift pace and vigilant glance, he nevertheless sank into a partial abstraction. Some disconnected sentences, breaking at intervals from his lips, served to show the current of his thoughts. \n \n \"Set it down, once for all,\" he muttered, \"that crime—absolute crime, of which the law can take hold—is a mistake.—Into the best-laid scheme, the one most carefully framed and skilfully executed, Chance—many would say, Providence (can there be a Providence after all?)—drops some trivial, fortuitous circumstance, which disconcerts or betrays everything.—The question is, could it have been foreseen?—I have worn that ring for sixteen years.—No! no! it is too subtile and too intricate a matter to think about now. I have more pressing subjects of reflection.—Only, set it down, for future use, that the essential thing is to keep clear of crime.\" \n \n \"Holden with the cords!\" echoed suddenly and pertinaciously through his memory, as if by way of defiant answer to the conclusion that he had reached. He set his teeth, and dashed more swiftly onward. \n \n Ere long, he reached the railway depot. In a large, underground space, half-filled with smoke and steam, a train stood on the track, the engine fretting and snorting like a steed impatient to be off, and the bell ringing out a hasty summons, curiously typifying the sharp call to leap on to some favorable train of circumstances, and be borne away to fortune or to ruin, which life often gives us, at certain fateful moments of its rapid career. Roath sprang to the rear platform, and, on the instant, the train moved. \n \n Swiftly it left the depot behind: decayed fences, rickety outhouses, heaps of rubbish and offal, quickly receded into a dingy perspective of backside city life; scattered coal-yards, and freight and engine-houses, succeeded; and then, the cool, moist air coming in at the windows, and a swift-gliding panorama of what looked like a terrestrial sky and stars, told him that he was being borne rapidly along the causeway that traversed the broad bay,—in the tranquil waters of which the fair night-heavens were faithfully mirrored. Hastily running his eye over his fifty or sixty fellow-passengers, and finding no familiar face, he settled himself back in his seat with a long-drawn breath of relief. He remembered that he was on an express train, with twenty miles between him and the next station; he could count upon a safe half hour, at least, for the working out of the difficult problem before him. To that problem he at once addressed himself, with the whole force of his intellect and will;—though ever and anon, that perplexing fragment of a sentence would float distractingly through his mind, saying itself over and over to the accompaniment of the sharp click of the rails,—\"Holden with the cords—Holden with the cords!\" \n \n \n From that night, for many years, Edmund Roath disappeared as completely from the sight and search of all who had known him, as if the train wherein he sat had suddenly flung itself headlong from that narrow causeway, and those deep, silent, star-mirroring waters, closing above him, had steadfastly refused to give up their dead. In brief space of time, his very name, as well as the circumstances that had made it notorious, was forgotten by those who had been most diligent in passing it from mouth to mouth. Seldom was it recalled even by the few who had known him best, and had yielded the heartiest admiration to his rare intellectual gifts. Having never taken any real hold of any human heart, it was but natural that he should pass behind the first intervening cloud, and leave no vacancy. \n \n Did he thereby escape the worst consequences of his sin? \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2089/59249.html","bookId":526,"book":{"id":526,"title":"Holden with the Cords","description":"简介： In sending forth another book belonging to the class known as religious novels, the author is moved to say a word to the critics who received a former one with so pleasant a mixture of praise and deprecation. As one of them frankly explained, they li...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2089","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
