{"id":32171,"no":41,"title":"Chapter 3 FARVIEW.","content":"Diva Thane, it is perhaps needless to say, was a child of the North. Her peculiar type of beauty blossoms only out of soil, which, for half the year, withdraws its warmth into its deep heart, and wraps itself in a chill, white robe of snow. She had made her appearance in Savalla, about a twelvemonth before, unheralded and unknown, had rented the parlor of a decayed aristocratic mansion as a studio, and had tacked on the door a card signifying to the public that she was a painter in oils. She had thenceforth been an example of that freedom and independence of life which Art makes possible for its votaries, of either sex, as a compensation, in some sort, for the sacrifices that they are bound to make to her. \n \n It soon became known that the Youles endorsed Miss Thane to the fullest extent, both socially and financially; else society might have given her a cool reception. But it could scarcely, in its haughtiest mood, have meted out to her a fuller measure of scornful indifference than she accorded to it, when, in due time, it made up its mind to hold out a condescending hand to her. She declined its invitations, she took no notice of its calls, she would none of its patronage. Just in proportion as it grew more eager, piqued by her indifference, and curious to penetrate the mystery which surrounded her, she became colder and more distant. Finally, society was compelled to understand that the sole favor which she would accept at its hands, was forgetfulness of her existence. \n \n Nor was the public treated much better, in her capacity of artist. Visitors at her studio found free admission, and opportunity to examine, at their leisure, the pictures, sketches, and studies, which crowded the walls; but rarely did she turn from her easel, to give them more than the briefest glimpse of her statuesque beauty, or the most concise of answers to their questions. Generally, she found some reason for declining their orders; and fully one half of the pictures on her walls were labelled, \"Not to be Sold,\" while the sale of the remainder was plainly a matter of the profoundest indifference to her. It must needs be inferred that she had means of subsistence other than her art, amply sufficient for her quiet, inexpensive mode of life. \n \n Nevertheless, she worked with indefatigable industry, as well as undeniable talent. If her pictures evinced some lack of technical skill, they were endued with a force and feeling which more than atoned for its absence; since the one would address itself chiefly to connoisseurs, while the other went straight to the universal heart. They covered a wide range of subjects, yet a profound observer would have traced a certain connection and sequence in them all. The earlier and cruder efforts of her pencil were pleasant outdoor scenes,—children wading in a sunshine brook, farm youths and maidens tossing about new-mown hay, and village girls dancing under wide-spreading boughs,—scenes so perfect in their idealization as to seem familiar to every eye, yet never without that inestimable something added or eliminated, which constitutes the difference between the picturesque and the commonplace. After these came works not only marked by greater skill of design and felicity of color, but informed with a deeper feeling;—yet so delicately indicated that none but the finest instinct would have perceived how softly Love illumined the landscape, or shone in the smile of the youth, or looked up to the maiden from her own downcast eyes reflected in the water. Then came a sudden change,—pictures and sketches wherein the artist\u0027s pencil must have been driven by some terrible intensity of feeling, to have wrought with such sombre power;—such as an illimitable desert, with a man riding fast toward a wan, setting sun, and his long, backward shadow falling upon a woman\u0027s outstretched, yearning hands,—or the black silhouette of a drifting and dismantled ship, seen against a blood-red moon, setting in a dun and angry sea,—or a deep and dismal cavern, with a female figure lying bruised and broken at the bottom of a fissure, and a man, also torn and bleeding, seen at the end of a long vista, searching for what he will not find. These pictures affected the spectator like a nightmare; there was such a fell shadow of immitigable fate in them all, and so notable an absence of anything like hope or faith, that while he acknowledged their power, he shuddered at their spirit. \n \n Of course, Rumor could not help busying herself with a subject so inviting as the artist, though so bare of definite results. She was variously reported to be an escaped nun, a bride that had nearly lost her life at the hands of an insane bridegroom, a widow—barely one month a wife—seeking to throw off an intolerable burden of grief by the help of new scenes, new faces, and a new manner of life, and an heiress, fled from the importunities of harsh guardians and an unwelcome suitor. It will serve as an indication of the occasional correctness of the popular instinct, that not one of these conjectures cast any shadow upon the whiteness of her fame. Not more inevitably did her face suggest snow, marble, and whatever was at once white and cold, than her demeanor suggested their chill purity. Moreover, notwithstanding that she led so unfettered and independent a life, as compared with the majority of her sex—dwelling under her own guardianship, and ordering her day\u0027s routine to her own liking—the closest scrutiny could not detect anything therein, that was not austere, lonely, and laborious enough to suit the cell of an anchorite. \n \n Yet, though there was so little in her way of living to suggest affluence, it soon became known that her hands were open, and her purse deep, to any claim upon her benevolence. While it never appeared that she set herself to seek out objects of charity, to such as came to her, either in person or by proxy, her bounty was generally far in excess of the demand. The only grace which it lacked, was that subtle element of the giver in the gift, which imparts a sympathetic warmth to the silver or the gold, as it is dropped in the outstretched hand; augmenting, to a degree incalculable by any known arithmetic, its power of relieving the distressed heart. Though Miss Thane gave generously, she gave none the less carelessly and coldly. \n \n The only person whom she distinguished by any mark of affection, or measure of confidence, was Coralie Youle. The two had been classmates at a Northern boarding-school, where the native girl had first soothed and petted the stranger through a severe attack of homesickness, and then had been devotedly nursed, in her turn, during a trying dispensation of scarlet fever; in consequence of which a friendship of more than ordinary warmth and tenacity had grown up between them; manifesting itself on Coralie\u0027s part, by a half worshipping admiration, and on Diva\u0027s, by the strong, yearning clasp of a nature that puts forth no slender, fragile tendrils, but clings only in virtue of a bend or coil of its own tough fibre. To Coralie she was never cold, never unresponsive; the girl knew that there was no veiled, inner chamber of her friend\u0027s heart to which she had not some time penetrated, and which she would be allowed to enter again, whenever her presence could throw one ray of light across its dusk. With that she was satisfied. One thing the two possessed in common—the most absolute trust in each other. \n \n Still, though Diva always received Coralie at her studio with deep-lit eyes of welcome, and a hand-clasp into which she had the power of putting more tenderness than ordinary women would express by a close embrace, and though she often joined her in long walks through the city and suburbs, it was rarely that she could be persuaded to visit her in her own home. If she did so, it was usually at an hour when she would be little likely to meet the other members of the family. It was as a great favor, therefore, that she had consented to stay to dinner, on the day when Bergan had met her. Nevertheless, when Coralie really set her heart upon anything in her friend\u0027s power to give, she always gained her point. And so it came to pass that, a few weeks later, when the family left for their summer residence of Farview, in the hill-region of the State, she carried Diva with her, for a visit of a fortnight. \n \n Thither, also, after awhile, came Bergan; yielding to Mr. Youle\u0027s entreaty that he would close the office, for at least a day or two, and give himself a breath of fresh air. Secure in his dearly bought acclimation, he had not purposed to leave the city; anticipating no worse effect from its summer atmosphere than a kind of dreamy languor, which, in his present state of mind, was perhaps more to be desired than any bracing of his energies. Nevertheless, he had come to feel for Mr. Youle a degree of filial affection; and he would not pain him by a churlish disregard of his kindness. \n \n He reached Farview about sunset. For the last three or four miles, he had seen the low roof and broad piazzas of his goal looking down upon him from the hill top, as he journeyed up the valley, and when he finally stood on the green and flowery lawn, he felt as if his own being were suddenly and sympathetically magnified an hundred degrees, so wide was the lovely and luxuriant Southern landscape outspread before him. Field and forest spotted it with various verdure; a river drew a bright, wavy line across it; here, the yellow sunshine brought out clearly every line and tint; there, the clouds dimmed it with patches of shadow; and all around was a massive framework of sunset-gilded hills. \n \n Half involuntarily, Bergan took off his hat. \"How good are the works of God, and how harmonious in their relations to one another, when we get high enough to command a wide view of them!\" he reverently thought. \"So, too, I doubt not, I shall find it with the dealings of His providence, when once I have climbed to a proper standpoint whence to view them as a whole. Till then, let faith accept the truth which is hidden from sight!\" \n \n A larger party than he had expected to see, was gathered in the dining-room. A legal brother, who had received a general invitation from Mr. Youle to visit him during the Summer, had hit upon this occasion; one planter from the neighborhood was present by appointment, and another by accident; and there was also a lady friend of Miss Youle, with her young daughter, Nina, besides Miss Thane. The latter signified her remembrance of Bergan by a cool bow; but it was not until dinner was over, and the evening tolerably well advanced, that he found himself in her immediate vicinity. Coralie had been led to the piano, leaving him in a somewhat isolated position, near one of the long windows; and, while the notes of a fairy-like waltz seemed to be dropping from her slender fingers, as they flitted up and down the ivory key-board, he thought he might venture to step out on the moonlit piazza, for a few moments, without being missed. Suiting the action to the thought, he discovered that Miss Thane had made her escape before him. She was leaning against a pillar, looking out over the moon-silvered valley with a weary and wistful expression scarcely in keeping with the calm, icy indifference of her wonted aspect. With a brief apology for interrupting her, he was about to retire, when she spoke, in a tone that seemed to accord him permission to stay if he chose. \n \n \"Coralie\u0027s music sounds sweeter outside than within.\" \n \n Bergan drew near to her, not to let his voice penetrate to the parlor. \n \n \"That is true, I suspect, of many things in life. To feel their full sweetness, one must get a little out of their immediate sphere.\" \n \n \"Is that true of persons, also?\" she asked, with a keen glance. \n \n Some moments elapsed before Bergan could answer. Compelled by the question to make a sudden, rapid investigation into the deeper things of the heart, he was confounded at the unexpected result. Too truthful, however, to attempt to hide it, he finally answered, thoughtfully;— \n \n \"In some measure, I think it is. Miss Thane, did you ever experience quite that deep delight in the presence of a friend, which you sometimes (please remember, I say only, sometimes) derive from the thought of him or her in absence?\" \n \n She did not answer the question. She only said, in a tone of cool irony;—\"You do not flatter your friends, Mr. Arling.\" But in another moment, she exclaimed, with a sudden, startling intensity of passion and longing;—\"Is there, then, nothing,—neither love, nor friendship,—absolutely nothing, which answers expectation, and satisfies desire? Horrible, horrible thought!\" \n \n \"I do not think so,\" replied Bergan, gently; \"though I confess that I was troubled, at first, by the necessity of answering your question as I did. But I now recognize the fact thus revealed to me as very satisfactory evidence that our affections, our friendships, are to know a richer and lovelier development than they can ever attain to on this earth. In heaven there must be room for every lofty ideal.\" \n \n Then, with a sudden deep intuition of the real necessities of the soul beside him, he went on to say;—\"Yet there, as here, I suppose, the one satisfying, completing thing will be the love of God. The soul was made to look up, not along a level; it can only find its highest joy in something superior to itself.\" \n \n She turned, and looked him intently in the face. \n \n \"Do you believe what you say?\" she asked, doubtfully. \n \n Very solemnly Bergan answered;—\"I do.\" \n \n \"Belief is nothing,\" she rejoined, after a pause, \"action is the test. Do you live your belief?\" \n \n Bergan drew a deep breath. \"I try to do so, Miss Thane.\" \n \n She went on, seemingly so intent upon her own train of thought as to be utterly unmindful of the solemn and searching nature of the questions that she was putting;— \n \n \"You feel, then, this all-satisfying love of God in your heart?\" \n \n \"In some measure, I trust I do.\" \n \n \"And when the sun suddenly dropped, or faded, out of your sky, and the past became a corpse, and the present a burden, and the future a blank, what comfort did it give you?\" \n \n \"The comfort of knowing that all things work together for the good of those that love God,\" responded Bergan, not without a momentary wonder at the curious appositeness of the question to his recent experiences, but quickly divining that she was looking more into her own heart than his, in asking it. \n \n \"Good,\" she repeated, musingly; \"you did not say, happiness.\" \n \n \"Good is a better word than happiness, in this world. In the world to come, they will be synonyms.\" \n \n She gave him another long, penetrating look. Then she said, quite simply, and evidently with no thought or intention of paying him compliments;—\"You have talents, you have culture, you have a clear and powerful intellect (I heard Judge Emly begin an argument with you just now, and you soon cut the very ground from under his feet), you have been wonderfully successful, too, considering your years,—yet you do not hesitate to bind yourself to these narrow theories.\" \n \n \"Narrow, do you think them? Broad, rather, since they link eternity to time, and give one the long outlook and overlook which alone reveal things in their true relations. No one can construe this world aright, or even satisfactorily, without doing it by the light of the next. As for intellect, Miss Thane, some of the most commanding intellects of the world have been defenders of the \u0027faith once delivered.\u0027 And, if such had been lacking, there is a certain Book that Time has not been able to make obsolete, nor Science to nullify, which tells how, aforetime, God chose the foolish things of the world to confound the wise: and He can do it again, when the necessity arises.\" \n \n \"You are content, then, to feel that your intellect, your learning, give you no advantage, in these matters, over the most ignorant of your neighbors?\" \n \n \"I am content to know that, in religion as in most other things, though books may help, thorough knowledge is of experience. The man who feels most of the Spirit of God in his heart, and makes it most clearly manifest in his life, is the man most competent, other things being equal, to analyze its operations and effects. Political economy, Miss Thane, is not the only subject about which men may prate very learnedly, and know very little.\" \n \n Coralie\u0027s music ceased suddenly. There was a little stir in the parlor, and a murmur of voices, as if some subject of interest were under discussion. \n \n \"Go,\" commanded Miss Thane, \"they will be looking for you. I will follow you in a few moments.\" \n \n He stepped back through the window. Coralie came toward him. \"We are talking,\" said she, \"of going down to the negroes\u0027 camp-meeting, a little below here; Mr. Sypher was just telling us that it is a sight well worth seeing, by night. Will you go?\" \n \n \"I am entirely at your service,\" replied Bergan, courteously. \n \n \"And Diva!—where is she? Oh, there she comes.\" \n \n Bergan turned. Miss Thane was standing between the curtains, with her usual expression of calm indifference. \n \n Coralie explained what was wanted. \"Would you like it?\" she inquired, twining her arm round her friend. \"There will be some fine artistic effects.\" \n \n Miss Thane looked down upon her, with a softness that Bergan had never before seen in her face, and which gave it a marvellous beauty. \"I like whatever you like, child,\" she answered, evasively. \n \n In the hall, she stopped, and took a shawl from the rack. \n \n \"Oh, Diva,\" exclaimed Coralie, \"you will not need that, it is so warm.\" \n \n Miss Thane stood doubtful, with the shawl in her hand. Bergan took it from her quietly, and threw it across his broad shoulder. \"It is always safe to carry a shawl, if not to wear it,\" said he, lightly. \n \n There was no formal arrangement of the party. The path lay through the fields, and was often too narrow to admit more than one person; at other times, partnerships of two or three were formed or broken, very much by chance. A broad glory of moonshine not only lighted them on their way, but surrounded them with enchantment,—softening lines, and deepening shadows, and turning the whole earth into a new creation of silver and ebony. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2089/59288.html","bookId":526,"book":{"id":526,"title":"Holden with the Cords","description":"简介： In sending forth another book belonging to the class known as religious novels, the author is moved to say a word to the critics who received a former one with so pleasant a mixture of praise and deprecation. As one of them frankly explained, they li...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2089","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
