{"id":32172,"no":42,"title":"Chapter 4 A WORD IN DUE SEASON.","content":"Ere long, the shadowy wood-line was reached, and very soon a red twinkle of light became visible through the trees, broadening and brightening as they advanced. The sweet and solemn notes of a hymn, sung by many voices, next pervaded the air; and in a few minutes more, they were standing on the edge of the camp-ground, interested observers of a singularly picturesque scene. \\n\\n \\n\\n Opposite to them was the speaker\u0027s stand, well lighted, covered with evergreen boughs, and affording accommodation to a goodly company of preachers, but too distant to be unpleasantly prominent. Between them and it, the whole vast space was crowded with negro worshippers; some sitting, some kneeling; here, an uncouth figure bowed in an attitude of absorbed meditation (or, it might be, indulging in a peaceful sleep); there, a dusky, upturned face, intent, or agonized, or rapturous, according as the owner was devoutly receptive, torn with conviction of sin, or blissfully assured of pardon. From among them the brown trunks of the forest trees rose straight and shapely as the pillars of a vast temple; and overhead, the under surfaces of the leaves showed gray and spectral against the sombre night sky. Here and there, lanterns were fastened to the trees, but the place was chiefly illuminated by great fires of pitch pine, whence clouds of smoke arose ever and anon, and hung trembling in the tree-tops; and the flames of which, as they rose and fell, cast alternate glow and gloom upon the upturned faces, and seemed to work corresponding changes of expression,—sudden transitions of joy and sorrow for which there was no apparent cause. Outside of these fires, scattered groups of spectators now came out into bold relief, and now lost themselves in shadow; strong profiles caught the eye, and then vanished; here and there, too, white faces offered an effective contrast to their darker neighbors. \\n\\n \\n\\n Altogether, it was a picture to delight an artist\u0027s eye; yet Miss Thane seemed scarcely to enjoy it. On the way hither she had been silent, shut up within herself, neither seeking nor giving amusement; and she now stood a little apart, letting her eyes rove absently from point to point, but without appearing to take intelligent cognizance of any! Yet she seemed to be listening, after awhile, to the voice of the white-haired negro preacher who occupied the stand, and talked of the comfort of religious faith in a way to argue profound personal knowledge of the subject,—albeit, his phraseology was illiterate, and occasionally absurd, calling a smile to some faces in the party. But Diva did not smile; her thoughts were evidently far below the surface of the subject, in depths where the gleaming ripple of the comic was unfelt and unseen. \\n\\n \\n\\n The party was considerably scattered. Miss Youle and her friend, tired with their walk, had found a seat on the outermost of the benches, watched over by Judge Emly; the youthful Miss Nina and one of the planters had gone round to get a view from the other side; Coralie stood near a fire, listening to the low comments of Mr. Sypher; and Mr. Youle and Bergan were quite in the background, silent spectators, for the most part, of what was going on. \\n\\n \\n\\n The white-haired speaker brought his brief address to a close; and a number of negroes quitted the benches and came up the path. Mechanically, Coralie stepped back to make way. \\n\\n \\n\\n \"Take care,\" exclaimed Mr. Sypher, in a warning voice, \"you will catch fire.\" \\n\\n \\n\\n But he was too late. She had moved within reach of the draft, and her light muslin robe was wafted into the blaze. Instantly, she felt the heat, saw over her shoulder a rising tongue of flame, and with the insane impulse which usually seizes upon those in like peril, turned to flee from the danger which it was so impossible to distance. But scarcely had she taken a step, before Bergan\u0027s strong arm caught her, and flung her, face downward, on the ground; with a deft movement of the other hand and arm, Miss Thane\u0027s shawl was shaken out and thrown over her; and, in spite of her frantic struggles, she was held fast by one knee, while he applied both hands to the task of smothering the flames. Miss Thane was the first to come to his aid; then the rest of the party woke from their momentary stupor of alarm, and joined their efforts to hers. In very brief space of time, the work of extinguishment was complete, and Coralie, being lifted to her feet, still enveloped in the friendly shawl, was found to be comparatively uninjured. Her floating curls were singed at the ends, one arm was slightly reddened and smarting, and her nerves were considerably shaken—that was all;—all I where there might so easily have been death, or torture and disfigurement worse than death. \\n\\n \\n\\n The whole thing had taken place so suddenly and swiftly, that only such persons as were in the immediate vicinity had been aware either of the peril or the rescue; so that it was by chance, as it were, that the whole vast multitude now burst forth with the solemn old Doxology;— \\n\\n \\n\\n \"Praise God from whom all blessings flow.\" \\n\\n \\n\\n \\n\\n The great wave of sound flowed round and over the little breathless party, and charitably veiled or soothed its emotions. Mr. Youle, standing with his arm round his daughter, bowed his face on her head, and a large tear glistened on her soft curls; Miss Youle sank on her knees by the bench where she had been sitting, and wept silently; others of the party bent their heads, or lifted their hats; Diva Thane held one of Coralie\u0027s hands close clasped in hers, but her face was turned away. Suddenly, she threw her voice into the last line of the Doxology,— \\n\\n \\n\\n \"Praise Father, Son, and Holy Ghost,\" \\n\\n \\n\\n with a richness and power that were like the swell of an organ. It appeared to pervade and sustain the whole chorus of voices, and impressed them inevitably with its own character; which, to Bergan\u0027s ear, seemed not so much an expression of thankfulness, as the irresistible outbreak of a feeling that would gladly have given itself the more effectual relief of moaning aloud, had the opportunity been afforded it. \\n\\n \\n\\n A bystander now considerately offered Mr. Youle the loan of his horse and buggy, and Coralie and her aunt were swiftly driven homeward. The remainder of the party walked back as they had come, Miss Thane and Bergan being in the rear. As they turned into the narrow wood-path, she motioned him to precede her; and he quietly obeyed, understanding, better than she knew, her desire to feel herself free from observation. Yet he failed not to listen for the sound of her light footsteps behind him, and to adapt his pace to hers. Meanwhile, his mind busied itself, almost against his will, with a new and serious question. In the little interval before the starting of the buggy, Coralie had taken his hands in hers, and thanked him for the service rendered her, with a look that haunted him still. There had been nothing in that look but what was most delicate and maidenly,—an involuntary attempt to help out with her eyes the broken words which yet expressed her gratitude so well; nevertheless, it had been possessed of some indefinable quality which had touched him deeply at the time, and now set him gravely to question within himself whether he had any right to be the object of a second look of the kind; at least, while the past was still a desolate grave, over which no grass yet grew green, no flowers bloomed. Trained to look difficult questions in the face, stripping them of all confusing or meretricious appendages, it did not take him long to arrive at an emphatic \"No,\" as the only possible answer to this one. Fortunately, he had not committed himself to any particular length of stay at Farview, and the sudden recollection of an important paper that he had locked up in his desk, instead of committing it to the safer guardianship of the fire-proof safe, suggested itself as an excellent excuse for a speedy departure. He decided that he would take his leave early in the morning, and see Coralie no more until he had determined that the past had become so far a dream as to admit of a new dream of the future. \\n\\n \\n\\n This honorable decision being reached, his mind was sufficiently at ease to allow him to notice that his pace had gradually become a very slow one, in half unconscious conformity to the lagging footsteps behind him,—footsteps which spoke so unmistakably of a troubled mind or an exhausted frame. It even appeared that Miss Thane stopped altogether, now and then, by reason of absorbing thought, or from the necessity of taking breath. Bergan hesitated for a moment, divided between the fear of being intrusive, and the kindly impulse to afford timely help; but the latter prevailed, and, the path having widened somewhat, he turned and offered her his arm. She shook her head absently, at first; then seemed to become suddenly aware that support was needful, and accepted it. \\n\\n \\n\\n \"We are privileged to be silent, I believe,\" said Bergan, as they moved on together, \"only in the presence of strangers or friends. Count me in either category, as you please, and do not trouble yourself to talk. I see you are tired.\" \\n\\n \\n\\n \"Thank you,\" returned Miss Thane, in a cool tone of acquiescence. \\n\\n \\n\\n Across the next two fields, their own linked shadows, sliding slowly over the ground in advance of them, were not more silent than they. The voices of their companions, who had far outstripped them, reached their ears only in subdued and harmonious murmurs. The moonlight lay over the earth like a visible blessing of peace; and even threw a kind of reflected brightness into Miss Thane\u0027s heart, by the aid of which she was better able to try to find some pathway out of its shadows. In that one terrible moment, when she had seemed to see Coralie wrapped in flames, a swift vision of herself, left standing alone in the world—without relative, without friend, without human affection, hope, or solace—a lonely, empty, unsatisfied heart—had risen before her, and left her appalled, even in the midst of her thankfulness that it was only a vision as yet, and not a reality. For, how easily, through the agency of a boat or an engine, a fever or a chill, a thousand every-day accidents, it might still become a reality! With what was she then to supply Coralie\u0027s place in her heart and life? \\n\\n \\n\\n Awhile ago, she would have answered confidently, \"With Art.\" Now, she knew better. For two years she had been testing Art\u0027s capacity to fill and satisfy an empty human heart, and her soul was exceeding bitter with the unexpected result. She had painfully experienced the truth (though she could hardly be said to understand it as yet) that he who embraces Art with a thought of self and not of service, will find it turn to ice or to ashes in his arms. In itself, it has neither balm for affliction, nor skilful surgery for remorse, nor sunshine to throw athwart the black gloom of despair. \\n\\n \\n\\n Out of this bitter knowledge Miss Thane finally spoke, apparently recurring in thought to their previous talk on the piazza;— \\n\\n \\n\\n \"Mr. Arling, how is one to love God, if one does not?\" \\n\\n \\n\\n It was perhaps the most difficult of all questions to answer. How are the blind eyes to be opened, and the deaf ears unstopped? How is the frozen heart to be softened, and the slumbering affection to be wakened into leaf and bloom? How is the Father to be made acceptable to the children that are insensible of His goodness, and will none of His reproof? And how is the Saviour to be presented unto those to whom He has hitherto been without form or comeliness, in such beauty as that they shall desire Him? \\n\\n \\n\\n \"I think, where it is not spontaneous,\" Bergan answered, after a moment\u0027s consideration, \"that such love is most surely to be attained through prayer and service;—a frequent lifting up of the heart to Him whom it would fain love; a constant endeavor to do His will, as the best means of developing and manifesting love.\" \\n\\n \\n\\n Miss Thane looked down thoughtfully. \"I have known—a man,\"—she began slowly, with a shade of irrepressible sadness in her tone,—\"a man not less gifted with talent and intellectual power than yourself, and with a somewhat longer and more varied experience in the use of his gifts, who would have laughed at the idea of any virtue in prayer, except as affording a pleasant illusion to a weak mind.\" \\n\\n \\n\\n \"I, too, have known such a man,\" replied Bergan, the image of Doctor Remy rising irresistibly before his mind, and causing a dull ache in his heart; \"but was he—was this man of whom you speak—or had he ever been, in the devout, habitual use of prayer?\" \\n\\n \\n\\n She shook her head. \"I do not know; probably not.\" \\n\\n \\n\\n \"Miss Thane, you would scarcely need to have me warn you that no man is to be accepted as authority, in law or medicine, who is not thoroughly conversant with the subject, both by study and practice. So those, and those only, who pray themselves, humbly, devoutly, persistently, have any right to pronounce upon the efficacy of prayer.\" \\n\\n \\n\\n She looked up at him quickly and keenly. \"Pardon me, but—have you the right to speak with authority?\" \\n\\n \\n\\n \"In some small measure, yes. I can certify you that the medicine is good, because I have taken it; that the staff is strong, because I have leaned upon it; that the weapon is efficient, because I have fought with it. Allow me to hope that you do not need the certification.\" \\n\\n \\n\\n Her eyes fell, and her cheek flushed slightly, but she answered with her usual straightforward candor:—\"I was never taught to pray;—my mother died when I was born, and my father believed none of these things. I have no habit of prayer.\" \\n\\n \\n\\n \"Does no one pray for you?\" \\n\\n \\n\\n \"I don\u0027t know—Coralie, perhaps.\" \\n\\n \\n\\n Bergan looked down upon her, and a sudden moisture dimmed his eyes. His heart was taken complete possession of, for the moment, by a vast, sorrowful pity for this beautiful and gifted woman, who masked so empty and aching a heart with so cold a demeanor, impelling him irresistibly to help her, as he could. \\n\\n \\n\\n \"When you are next asked that question,\" said he, and there was a deep, rich melody in his voice, \"do not say that you \u0027don\u0027t know,\u0027 for I promise to put up a prayer for you daily, from henceforth, until you send me word that you have learned to pray habitually and gladly for yourself. Hereafter, when you lie down to rest, remember that another—claiming no title of friend, but simply that of neighbor—has asked forgiveness for your day, protection for your night, and every strength that you need for your morrow.\" \\n\\n \\n\\n The proud heart was touched at last. That is to say, Bergan\u0027s words were the effectual \"last drop\" in the full cup of the evening\u0027s varied emotions,—comparatively insignificant perhaps in itself, but none the less inevitably productive of overflow. Miss Thane\u0027s lips parted with a kind of gasp, scarcely distinguishable as sound, but profoundly suggestive of pain; and a perceptible tremor ran over her from head to foot. Suddenly releasing Bergan\u0027s arm, she sat down on a fallen tree by the side of the path, and covered her face with her hands, while tears, dripping through her slender fingers, glistened gem-like in the moonlight. \\n\\n \\n\\n Yet it argued much for her power of self-control, that she made no sound, nor shook with any sob. Grief must be content to exercise over her limited, not absolute dominion. \\n\\n \\n\\n Bergan withdrew to a little distance, and waited silently, looking out over the shadowy valley to the fair, flowing outline of the moon-silvered hills. Those womanly tears, he was certain, would afford most safe and seasonable relief to whatever pain and excitement, whatever distressful memories or dismal forebodings, had resulted from the evening\u0027s events. For himself, comparative stranger as he was, he had no right to give Miss Thane more than the silent sympathy of a heart itself not unacquainted with sorrow. \\n\\n \\n\\n Suddenly, the deep silence was broken by the soft whirr of wings. A bird, flying as straight over the moonlighted fields as if let loose by an unseen hand for that purpose, alighted in the boughs over the two motionless figures, and shook down upon them a shower of liquid notes,—sweet, clear, and joyous,—a very prophecy of hope. \\n\\n \\n\\n The song being sung, the bird soon spread its wings and flew back to its nest and its mate. Then Diva rose, and held out her hand to Bergan. \\n\\n \\n\\n \"I accept your offer,\" said she. \"Something tells me that the time will come when I can repay you in degree, if not in kind.\" \\n\\n \\n\\n And Bergan, as he took the white, cool hand—empty now, except perhaps of a half-reluctant gratitude, and a moderate measure of good-will—had a singular intuition that some day it would be held out to him with an inestimable gift in it. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2089/59289.html","bookId":526,"book":{"id":526,"title":"Holden with the Cords","description":"简介： In sending forth another book belonging to the class known as religious novels, the author is moved to say a word to the critics who received a former one with so pleasant a mixture of praise and deprecation. As one of them frankly explained, they li...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2089","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
