{"id":86870,"no":13,"title":"Page 13","content":"\n Cade rolled him to his back and spread his legs. He looked down at him with satisfaction. “Mine,” he groaned, then held him up and buried his face between his cheeks again. Jax could feel his tongue thrusting inside until he thought he’d lose his mind. He was reduced to begging until finally, Cade pulled his face away and fingered him.\n “Look at me, baby,” he commanded and Jax looked up at him. He carefully put in one finger, moving it until Jax felt the burn. Next came another finger and Cade carefully watched his face to gauge his reactions. When Jax’s eyelids fluttered, he smiled down at him. “I’m claiming you, Jax. You’re mine now. Forever.” He pushed inside Jax again with his fingers and Jax moaned, his teeth gritted together. Then Cade shifted his angle to slide across his prostate and Jax put his head back and moaned so loudly it must have sounded like Cade was killing him.\n “That’s it, baby. Let me hear you sing.” Cade’s eyes were glowing down at him, his heated stare running over him, making Jax breathe faster, and making his body tingle from that touch alone. Impatiently, Cade surged to his feet. His big hands went to the buttons on his jeans and he stripped them off expertly. Jax’s gaze was fixed on him as he revealed his body, so gorgeous with his smooth muscles and tanned skin. And mine, Jax thought, a little thrill running through him.\n Jax’s eyes moved down to his groin and his gaze faltered. He looked back up to find Cade’s gaze burning into him. “Cade…what…what is that?” He pointed down to Cade’s cock, long, thick and uncut. Around the base of his cock was a growth of some kind. Circling right around the shaft, it was almost the size of a small baseball.\n “It’s my knot, Jax. It has to go inside you this first time to ensure our bond. It will hold us together for a while, and I won’t be able to release from you. Do you understand? It’ll hurt, baby. I’ll try to stretch you as much as I can, and we’ll take it slow, but it has to go inside you.”\n Jax looked up into Cade’s eyes and then nodded his understanding. He didn’t really understand at all, but he wanted to be whatever Cade needed him to be. He reminded himself that this man wasn’t human—naturally there would be some differences. That was what Cade kept saying, and he had to believe him. He looked up at Cade and tried to nod.\n “I know how this must seem, honey. It’s natural for us, but I know it looks strange to humans. It’s just a part of me, a part of my wolf. I don’t want to hurt you, and it will be just this first time we make love. It will help form our bond.”\n Jax nodded again. He wasn’t a virgin, after all, and he wasn’t afraid. That had all been taken from him a long time ago, and in a much more brutal manner. In the past, he’d even been forced to wear large plugs for hours at a time, so he knew how this might feel. He didn’t want to think about it, but he was desperate to please Cade, and to understand.\n “I’m so sorry, baby. I never want to hurt you. I’ll be as gentle as I can, okay?”\n Jax nodded and Cade continued. “It’ll be better for both of us if you can relax as much as possible.”\n Cade stood for a moment looking down at Jax, and Jax crawled to the edge of the bed and curled a hand around his thigh, dragging him closer. He stepped forward, his eyes glowing, as Jax leaned closer. Without any more warning, Jax swallowed him down. He couldn’t get his mouth around the knot, but he held it in his hands and massaged it gently.\n Cade gave a startled, harsh cry and his knees buckled a little to the side of the bed. Jax’s tongue caressed the vein on the underside of his huge cock, licking upward to torment the head. He let his teeth graze the tender skin and his hands came down on the back of Jax’s head.\n “God, Jax,” he cried, and Jax slipped his tongue deeply into his slit. With a choked cry, Cade pulled him off, whirled him around, and put him back on his hands and knees, facing away from him. Gentle hands kneaded the muscles of his back and then moved down between his legs.\n “Stay right there—don’t move.” Jax watched Cade over his shoulder as he moved over to his bags and dug inside. He came out with some lube and triumphantly came back over to the bed, grinning. He slicked his shaft with it, paying extra attention to his knot. Then he positioned himself behind Jax and pushed himself in.\n Jax cried out, “Wait…”\n Breathing hard, Cade looked up at him, his eyes not focused, his pupils almost blown.\n “A c-condom?” Jax saw him slowly register the request, but shake his head.\n “Human diseases—I don’t need condoms.” He seemed to notice Jax’s eyes grow wide at the comment and patted his hip. “Trust me, baby. I’ll always take care of you.”\n Jax nodded, pretty far gone in both ecstasy and pain, but he pushed back hard, opening himself and not stopping until he could feel what must have been Cade’s knot brushing against his ass. It wasn’t cold and hard like the anal plugs he’d had inside him in the past. This was warm, smooth and much softer. Cade stopped moving at that point, running a hand down Jax’s back, the touch making Jax arch up into it.\n “More,” Jax said, panting for breath, and Cade pushed in again, a little more this time, rocking gently back and forth. He was continually rubbing against Jax’s prostate, bringing him to the brink again and again. Each time, Cade would stop moving until he could recover and gently rock against him again. Cade added more lube, and pushed hard one last time and with a soft plop, the knot slipped all the way in. Jax was painfully full and stretched, and it hurt like a bitch, but he was also very aroused.\n Jax twisted and whined, thrusting backward, and then came again, great pulsing streams of white shooting from him as he arched upward. Cade gripped him around the throat and bit down hard into the side of his neck, while at the same time grinding into him. Jax could feel him sucking his blood, his teeth sharp and painful. He held him there against his chest as he drank, riding him obscenely, possessively. Just when Jax thought he might die from the pleasure and the pain, Cade came hard, filling him with his hot cum. His cock stayed hard, and they were still fused together as Jax felt the pressure rise in him again.\n “I-I’m coming again,” he cried. Cade held and soothed him through it, murmuring soft words in his ear as he came apart. Jax could feel the blood trickling down his neck and onto his back. Cade raised his head and licked at the wound, closing it up. He bit down into his own wrist and pushed it up against Jax’s lips. “Drink from me, little one. Drink deeply. It’ll help.”\n Jax opened his lips and allowed the hot, bitter blood to seep into his mouth.\n Cade shook his head. “No. Drink. Suck my wrist.” It tasted metallic, like iron, but he sucked in as hard as he could, wanting to please Cade. He was only able to take in a couple of mouthfuls before he started to cough and turned his head, but it must have been enough. Cade kissed his shoulder. “Good. Good boy.”\n A feeling of lassitude came over him in waves, soothing the pain and making him feel boneless and totally relaxed. He was flying, higher than before. He soared up into the clouds and they thickened around him. He was incredibly groggy and his pain eased off. Jax wondered in a vague, unfocused way if the blood had anything to do with it—Cade said it would help.\n Cade whispered to him that he was “in heat” from the mating bite, not that his body secreted anything, but he would be overwhelmed with the urge to have sex with Cade. It must have been true, because suddenly he couldn’t get close enough to Cade. He pulled at his own cock and his breath came in big hitches as his body tried to process the chemicals that were flooding into him from Cade’s cum. He strained back against him and put a hand back to grab Cade’s hip and pull him closer, still pulling at himself frantically. Cade pulled his hand away.\n “Be still, Jax. You’ll have multiple orgasms now, without stimulation. You’ll hurt yourself if you’re not careful. You just have to ride the orgasms out, baby, but I’ve got you. I’m here.”\n Jax was too far gone to listen to him, and when Cade stopped him from straining closer, he moaned pitifully. “I’m sorry. I don’t mean to hurt you, but it’s the only way. Try to be still…”\n His prostate bathed in the chemicals released from the gland, Jax arched his back and cried out as an intense orgasm made him scream hoarsely. He reared back against Cade again, seeking help. Cade licked at the wound on his neck and held him down as his body spasmed out of control.\n Jax thought afterward that he passed out for a while, because the next thing he remembered was his muscles clenching on the hardness inside him, and he wasn’t sure any more where he stopped and Cade began. The orgasms were more like little aftershocks now, jolting through him again and again, but almost pleasurable now. Cade moved behind him, and Jax realized he was finally able to pull away. He felt glad it was gone, but at the same time he felt strangely empty.\n Holding Jax up with one arm, Cade pulled back the covers, and they both crawled in the bed. Jax felt exhausted but still dizzy and needy. He immediately scooted over next to Cade and tried to crawl on top of him. Cade laughed softly and turned him over, spooning him, pulling his back tightly against his chest. “Sleep now.”\n Jax settled in his arms, pushing his butt up into Cade’s groin. His thoughts were tumbling around in his head. He belonged to Cade—truly belonged, and it was a strangely heady feeling. He wondered if it would be this way all the time between them. He wondered too if this meant that Cade loved him, and he turned his head back to ask Cade, but he was already breathing hard, like he was sound asleep. Snuggling closer, he felt sleep stealing over him and let out the long breath he hadn’t realized he’d been holding.\n In the morning, he promised himself. In the morning, Cade would tell him. Cade would say the words he wanted to hear. Not just that he belonged to him, but that he loved Jax too. Jax needed Cade to love him. He wasn’t sure why it was so important all of a sudden, because he hadn’t cared much one way or the other before, but things were different now. He knew that instinctively. They hardly knew each other, despite what they’d just done. But still, something was changing inside him and he could feel it. It was as if something deep within yearned to hear those words—as if without them, he’d never feel complete. \n","sourceLink":"https://allnovel.net/bloodlust-dark-hollow-wolf-pack-9/page-13.html","bookId":2261,"book":{"id":2261,"title":"Bloodlust (Dark Hollow Wolf Pack #9)","description":"Storyline: \n Bloodlust (Dark Hollow Wolf Pack #9) \n Forty miles east of New Orleans, dog tired and out of money, nineteen year old Jax and his little brother are on the run. They stop for breakfast at a roadside café and have a run-in with the leader of a tough looking motorcycle gang. His name is Cade D’Allisande, an alpha wolf leading his pack to a new home in North Carolina, hoping to join the Dark Hollow Wolf Pack. Cade instantly recognizes his bloodlust mate, an intense and rare blood match that forms an alpha pair. The trouble is Cade isn’t ready for a mate. Unable to leave him behind, he convinces the young man to join their group and takes him with them on their journey to find a new home. But once there, an old enemy of the Pack threatens their happiness, and Jax, Nicky and Gabe must team up to save their mates.\n \n","cover":"https://allnovel.net/images/bloodlust-dark-hollow-wolf-pack-9.jpg","author":"Shannon West","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodlust-dark-hollow-wolf-pack-9.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:18:58 PM"}}
