{"id":101276,"no":7,"title":"Page 7","content":"It hasn’t been an easy day for anyone.\\n\\n I can tell my tribe wants me outside, where my bow and my eyes can protect them. It’s where I need to be for Clara’s sake too. So I tell her that.\\n\\n “I’m going out there for you, Clara. To keep you safe. I have to go now.” I hug her. Then, to take my mind off leaving her, I count my steps as I walk outside.\\n\\n One, two, three . . . five . . . eleven . . . twenty.\\n\\n Hayden falls in step with me when I reach forty-two. By ninety-seven we have stepped completely out of the cave. I pause on the small strip of sand and finally allow myself to look back.\\n\\n Bad idea. The pull to return to my sister is immense. Strong, like I’m falling toward her. She needs me in there and she needs me out here, and how am I supposed to know what’s right? What’s best?\\n\\n “Ready?” Hayden asks. He is watching me closely.\\n\\n “I’m with you tonight?” My voice is sharp, like the crack of a whip.\\n\\n I wonder if Hyde requested not to be with me. I wonder why I feel jilted and depressed when I was the one who balked at what he offered. Which was tenderness and poetry and smiling kisses.\\n\\n Good job, Brooke. Because those things are all so horrible.\\n\\n Can this day get any worse?\\n\\n A laugh bursts out of Hayden. “I’m glad you’re so happy about it.” He gives me his back before I can respond, and breaks into a jog, threading his way up the steep switchback path to the bluff.\\n\\n “Thrilled,” I mutter, catching up to him.\\n\\n My walk with Hyde last night on this same trail felt contemplative, but Hayden attacks it. He is muscular and long-limbed like Hyde, but more energetic. Louder and more aggressive. The pace he sets forces me to focus on my footing and my breathing in order to keep up with him.\\n\\n In minutes, sweat rolls down my spine, but I relish it. Since we’ve been in the cave, we haven’t run like this. Everyone is always shuffling around, looking miserable.\\n\\n You can’t be miserable when you’re running. It’s such a simple and pure way to feel alive. As we put miles behind us, my mood begins to lift.\\n\\n Gren and Reef aren’t far to the north, and Hyde and Straggler are just south of us. We have reinforced our patrol numbers in all posts, but most substantially here on the eastern approach—the shortest distance to the cave. If Wylan is coming, this would be the most direct path, the one that would give us the least amount of time to react. This is where we are most vulnerable, so Perry appointed the Six to guard it tonight—the Six and me.\\n\\n I am with these warriors because I am one of the best, but that distinction brings me nothing but pride now. It’s an honor to be regarded as their equal.\\n\\n After an hour of running, we stop to catch our breath and drink water. My eyes drift to the range of hills to the north, and dread seeps through me. The Aether looked fierce last night, but today its threats are not empty. The sky there flashes with funnels. Along the ridge below, a glowing orange line has appeared.\\n\\n Fire.\\n\\n Land is burning. Tide land. Mine.\\n\\n I’ve been so focused on the trail ahead of me that I didn’t see it.\\n\\n “Do you think Reef and Gren are in that?” I ask. Then I gulp water, trying to slake my thirst.\\n\\n Hayden’s Seer eyes take in the distant hills, and then settle on me. He shakes his head. “They were swinging south to avoid it.”\\n\\n I focus my attention on the trees around me. The flutter of their leaves and the sway of their branches. “The wind is blowing our way, Hayden. You do know what that means?”\\n\\n He takes another deep drink from his water skin and nods. “Why do you think I’ve been in such a hurry?”\\n\\n “You knew the fires were going to blow our way?”\\n\\n “I had a feeling.”\\n\\n “Why didn’t you say anything?”\\n\\n “Because I wasn’t sure.” He smiles. “But now I am.”\\n\\n I shake my head at him. “Great.” The dry creek bed we followed from the cave is pooling with smoke. Our path is disappearing behind us. “We can’t go back.”\\n\\n “No. But we better keep moving.”\\n\\n We have no other choice. The fires to the north—the source of the smoke that’s blowing our way—show no sign of abating.\\n\\n We run again. The wind continues to build, blowing hot, thick smoke that swirls past us. Black pieces of ash and glowing embers flutter by, some as large as leaves.\\n\\n My lungs ache when Hayden finally stops. I have to press my thumbs into my eyes for a few seconds to relieve the stinging.\\n\\n Still trying to catch my breath, I scan the distance for our position. I want to see the wooded slope where Hyde and I posted up last night, but I find that I can’t see more than three hundred yards away. I know this territory as well as I know Clara’s face, but with smoke billowing past, nothing is recognizable.\\n\\n I bite back a curse. Sight is my gift. When I can’t see, I’m not happy.\\n\\n “Well, I’m terrified,” Hayden says. “How about you?”\\n\\n I look at him. “Where are we?”\\n\\n “Definitely lost.” He kneels, pulling his quiver over his shoulder. Sweat drips off his forehead. He swipes at it absently and withdraws a compass from a small pocket.\\n\\n Relief washes over me. “I could hug you right now.” That small instrument may have just saved our lives. It’s easy to lose direction when you can’t navigate by sight. As disoriented as we are, we could get turned around and head directly toward the fire line.\\n\\n “A nice thought, but unnecessary.” Hayden checks the compass. “We haven’t gone off course by much. We’re still heading east.” He points straight ahead and stands. “Let’s keep going. We have to get clear of this smoke.”\\n\\n As we run again, he doesn’t state the obvious. We aren’t protecting the tribe anymore. We are no longer looking for signs of Wylan and his group. Our mission has shifted. We are running to save our own lives.\\n\\n The night becomes snatches of foreign-looking woods. The dirt beneath my feet and Hayden running next to me. I have the feeling we’re getting swept out to sea. Away from safety and everyone we know.\\n\\n I don’t know how long we’ve been running when my energy begins to flag. Unable to keep up anymore, I slow down. Hayden notices immediately. He hooks his arm into mine and yanks me forward, giving me the boost I need to climb a small hill.\\n\\n We collapse at the top, sprawling on the dirt.\\n\\n I lie there for a while, facedown, trying to catch my breath. Then I roll on my back and stare up at the Aether.\\n\\n My muscles twitch, and I’m so light-headed it feels like the world is spinning. A gust drifts over me, cooling me down. The air is clear here. Not a trace of smoke. I close my burning eyes and drink it into my lungs. My sweat-drenched clothes are heavy on my skin.\\n\\n I sense Hayden climbing to his feet. “You all right?”\\n\\n “I’m great. Just perfect.”\\n\\n He doesn’t move away. When I peer at him through my lashes, I find him looking down at me, his full lips parted just slightly. “Still want to know where we are?” he asks.\\n\\n I climb to my feet, my legs quavering a little.\\n\\n I know where we are. The Tides’ territory is shaped like an hourglass, narrower in the middle, broader at its poles. Three hours of running due east would cut right through this narrow section and put us at the edge of the territory—or just beyond.\\n\\n Though I’m positive about where we’ve ended up, I need to hear Hayden say it. I don’t know if I’ll really believe it otherwise.\\n\\n My voice is barely above a breath as I say, “Tell me.”\\n\\n 8\\n\\n The borderlands,” Hayden says.\\n\\n Where chaos reigns. My father’s voice fills my mind. It’s what he always says when the borderlands are mentioned. Like it all goes together. One long name for a place that belongs to no one.\\n\\n The borderlands, where chaos reigns.\\n\\n Also, where I am currently standing.\\n\\n The knowledge spreads through me like ice, chilling my overheated muscles.\\n\\n As a little girl my nightmares were about this very place. I dreamed that monsters and wolves and ghouls lived here. Bloodthirsty creatures that tore into flesh for no reason. Now I am older and I know better.\\n\\n Monsters and ghouls don’t commit atrocities out here. People do.\\n\\n “Does it feel like coming home?” I hear myself say. I don’t know what I want from Hayden’s response. Maybe some assurance that he’s as comfortable here as anywhere.\\n\\n Hayden lifts an eyebrow. “If home is where a person finds sanctuary and peace, then this place has never been that to me.”\\n\\n His tone is surprisingly somber. What was it like for him to look after two younger brothers out here? Did he worry about Hyde and Straggler constantly, like I worry about Clara?\\n\\n He smiles at me suddenly. It’s a cover-up grin, like Clara’s sunbeam smile. Like he believes he said something he shouldn’t have.\\n\\n “Drink,” he says, handing me a water skin.\\n\\n “Thanks.” I take it. I finished mine an hour ago. The leather skin is warm and damp from his grip.\\n\\n “Don’t worry about being out here. It’s not as bad as you think.”\\n\\n I take a long drink and hand the skin back to him. “I can stomach anything except lies.”\\n\\n “Fair enough. It is as bad. But we’ll be safe on this hill until the wind carries the smoke away.”\\n\\n I consider our position and see that he’s right. Our hill is small, but we have a few oak trees here that will give us some cover, and an unobstructed view on every side. No one will sneak up on us without earning an arrow between the eyes.\\n\\n My gaze strays west. Clara is out there, inside the cave on the edge of the coast. I wish I could see her. All I see are plumes of smoke interspersed with glowing spots, where the flames leap highest. The Aether rolls in waves across the sky, looking so alive, so vibrant, compared to the earth with its scorching skin.\\n\\n I don’t know whether it’s the sight of this war between earth and sky or the cooling of my sodden clothes that chills me, but I begin to shiver.\\n\\n “You want me to get a fire going?”\\n\\n That makes me laugh. “Would you? That’d be great.” I can’t think of anything I’d like less than a fire. The smoke has gotten in my hair. It’s all I can taste. All I can feel, in the tightness of my lungs. I feel like I’ve bathed in smoke.\\n\\n Hayden gazes across the distance. “The wind is dying down. The fires will burn out soon. We’ll be able to get back by morning at the latest.”\\n\\n That sounds overly optimistic, but I don’t say anything.\\n\\n Hayden finds a smooth rock to perch on. “Come on. There’s room for you.”\\n\\n “I’m fine,” I say reflexively.\\n\\n After pacing around for five minutes, I realize he’s chosen the only spot on this craggy hill that’s halfway comfortable, but I’ve already made up my mind.\\n\\n I plop down on the dirt a few paces away from him. A sharp rock pokes into my backside. I am cold, tired, and wet—and I smell like a chimney—but that rock is what pushes a string of curses out of me.\\n\\n “Everything all right?” Hayden asks.\\n\\n I can tell he’s trying not to laugh.\\n\\n “Wonderful. How’s your throne?” \\n\\n","sourceLink":"https://allnovel.net/brooke-under-the-never-sky-0/page-7.html","bookId":1661,"book":{"id":1661,"title":"Brooke (Under the Never Sky #0)","description":"Storyline: Brooke (Under the Never Sky #2.5) \\n Set just before the events of Into the Still Blue, the conclusion to Veronica Rossi\u0027s Under the Never Sky trilogy, this breathtaking novella is a satisfying stand-alone for new readers as well as an exciting glimpse at favorite characters from the trilogy. Pulsing with romance and danger, Brooke will leave readers desperate for the conclusion to this epic and unforgettable saga. \\n The only fight she can\u0027t win is the one for Perry\u0027s heart. Following the stunning climax in Through the Ever Night, the Tides have been forced to seek shelter from the Aether storms in a dismal, secluded cave. But Brooke\u0027s memories of the cave go back much further, to when she and Perry used to come here together. That was before Perry fell in love with Aria and before Vale\u0027s dealings with the Dwellers altered the course of the Tides forever. \\n Now, with her sister back from a haunting year in captivity and Aria lying unconscious in the sick bay, Brooke struggles to put the pieces of her life back together. Without Perry, who is she? And what is her role in this frightening new world? As these questions swirl about her, an old threat to the Tides resurfaces, and Brooke is forced to put the lives of her people before her own. But in taking this step outside of herself, Brooke may finally discover what she truly wants.\\n","cover":"https://allnovel.net/images/brooke-under-the-never-sky-0.jpg","author":"Veronica Rossi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/brooke-under-the-never-sky-0.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:00:18 PM"}}
