{"id":5920,"no":29,"title":"Part 3 Chapter 8","content":"JUDE wondered if she had really left her handkerchief behind; or whether it were that she had miserably wished to tell him of a love that at the last moment she could not bring herself to express.\n He could not stay in his silent lodging when they were gone, and fearing that he might be tempted to drown his misery in alcohol he went upstairs, changed his dark clothes for his white, his thin boots for his thick, and proceeded to his customary work for the afternoon.\n But in the cathedral he seemed to hear a voice behind him, and to be possessed with an idea that she would come back. She could not possibly go home with Phillotson, he fancied. The feeling grew and stirred. The moment that the clock struck the last of his working hours he threw down his tools and rushed homeward. \"Has anybody been for me?\" he asked.\n Nobody had been there.\n As he could claim the downstairs sitting-room till twelve o\u0027clock that night he sat in it all the evening; and even when the clock had struck eleven, and the family had retired, he could not shake off the feeling that she would come back and sleep in the little room adjoining his own in which she had slept so many previous days. Her actions were always unpredictable: why should she not come? Gladly would he have compounded for the denial of her as a sweetheart and wife by having her live thus as a fellow-lodger and friend, even on the most distant terms. His supper still remained spread, and going to the front door, and softly setting it open, he returned to the room and sat as watchers sit on Old-Mid-summer eves, expecting the phantom of the Beloved. But she did not come.\n Having indulged in this wild hope he went upstairs, and looked out of the window, and pictured her through the evening journey to London, whither she and Phillotson had gone for their holiday; their rattling along through the damp night to their hotel, under the same sky of ribbed cloud as that he beheld, through which the moon showed its position rather than its shape, and one or two of the larger stars made themselves visible as faint nebulae only. It was a new beginning of Sue\u0027s history. He projected his mind into the future, and saw her with children more or less in her own likeness around her. But the consolation of regarding them as a continuation of her identity was denied to him, as to all such dreamers, by the wilfulness of Nature in not allowing issue from one parent alone. Every desired renewal of an existence is debased by being half alloy. \"If at the estrangement or death of my lost love, I could go and see her child--hers solely--there would be comfort in it!\" said Jude. And then he again uneasily saw, as he had latterly seen with more and more frequency, the scorn of Nature for man\u0027s finer emotions, and her lack of interest in his aspirations.\n The oppressive strength of his affection for Sue showed itself on the morrow and following days yet more clearly. He could no longer endure the light of the Melchester lamps; the sunshine was as drab paint, and the blue sky as zinc. Then he received news that his old aunt was dangerously ill at Marygreen, which intelligence almost coincided with a letter from his former employer at Christminster, who offered him permanent work of a good class if he would come back. The letters were almost a relief to him. He started to visit Aunt Drusilla, and resolved to go onward to Christminster to see what worth there might be in the builder\u0027s offer.\n Jude found his aunt even worse than the communication from the Widow Edlin had led him to expect. There was every possibility of her lingering on for weeks or months, though little likelihood. He wrote to Sue informing her of the state of her aunt, and suggesting that she might like to see her aged relative alive. He would meet her at Alfredston Road, the following evening, Monday, on his way back from Christminster, if she could come by the up-train which crossed his down-train at that station. Next morning, according, he went on to Christminster, intending to return to Alfredston soon enough to keep the suggested appointment with Sue.\n The city of learning wore an estranged look, and he had lost all feeling for its associations. Yet as the sun made vivid lights and shades of the mullioned architecture of the facades, and drew patterns of the crinkled battlements on the young turf of the quadrangles, Jude thought he had never seen the place look more beautiful. He came to the street in which he had first beheld Sue. The chair she had occupied when, leaning over her ecclesiastical scrolls, a hog-hair brush in her hand, her girlish figure had arrested the gaze of his inquiring eyes, stood precisely in its former spot, empty. It was as if she were dead, and nobody had been found capable of succeeding her in that artistic pursuit. Hers was now the city phantom, while those of the intellectual and devotional worthies who had once moved him to emotion were no longer able to assert their presence there.\n However, here he was; and in fulfilment of his intention he went on to his former lodging in \"Beersheba,\" near the ritualistic church of St. Silas. The old landlady who opened the door seemed glad to see him again, and bringing some lunch informed him that the builder who had employed him had called to inquire his address.\n Jude went on to the stone-yard where he had worked. But the old sheds and bankers were distasteful to him; he felt it impossible to engage himself to return and stay in this place of vanished dreams. He longed for the hour of the homeward train to Alfredston, where he might probably meet Sue.\n Then, for one ghastly half-hour of depression caused by these scenes, there returned upon him that feeling which had been his undoing more than once--that he was not worth the trouble of being taken care of either by himself or others; and during this half-hour he met Tinker Taylor, the bankrupt ecclesiastical ironmonger, at Fourways, who proposed that they should adjourn to a bar and drink together. They walked along the street till they stood before one of the great palpitating centres of Christminster life, the inn wherein he formerly had responded to the challenge to rehearse the Creed in Latin-- now a popular tavern with a spacious and inviting entrance, which gave admittance to a bar that had been entirely renovated and refitted in modern style since Jude\u0027s residence here.\n Tinker Taylor drank off his glass and departed, saying it was too stylish a place now for him to feel at home in unless he was drunker than he had money to be just then. Jude was longer finishing his, and stood abstractedly silent in the, for the minute, almost empty place. The bar had been gutted and newly arranged throughout, mahogany fixtures having taken the place of the old painted ones, while at the back of the standing-space there were stuffed sofa-benches. The room was divided into compartments in the approved manner, between which were screens of ground glass in mahogany framing, to prevent topers in one compartment being put to the blush by the recognitions of those in the next. On the inside of the counter two barmaids leant over the white-handled beer-engines, and the row of little silvered taps inside, dripping into a pewter trough.\n Feeling tired, and having nothing more to do till the train left, Jude sat down on one of the sofas. At the back of the barmaids rose bevel-edged mirrors, with glass shelves running along their front, on which stood precious liquids that Jude did not know the name of, in bottles of topaz, sapphire, ruby and amethyst. The moment was enlivened by the entrance of some customers into the next compartment, and the starting of the mechanical tell-tale of monies received, which emitted a ting-ting every time a coin was put in.\n The barmaid attending to this compartment was invisible to Jude\u0027s direct glance, though a reflection of her back in the glass behind her was occasionally caught by his eyes. He had only observed this listlessly, when she turned her face for a moment to the glass to set her hair tidy. Then he was amazed to discover that the face was Arabella\u0027s.\n If she had come on to his compartment she would have seen him. But she did not, this being presided over by the maiden on the other side. Abby was in a black gown, with white linen cuffs and a broad white collar, and her figure, more developed than formerly, was accentuated by a bunch of daffodils that she wore on her left bosom. In the compartment she served stood an electro-plated fountain of water over a spirit-lamp, whose blue flame sent a steam from the top, all this being visible to him only in the mirror behind her; which also reflected the faces of the men she was attending to--one of them a handsome, dissipated young fellow, possibly an undergraduate, who had been relating to her an experience of some humorous sort.\n \"Oh, Mr. Cockman, now! How can you tell such a tale to me in my innocence!\" she cried gaily. \"Mr. Cockman, what do you use to make your moustache curl so beautiful?\" As the young man was clean shaven the retort provoked a laugh at his expense.\n \"Come!\" said he, \"I\u0027ll have a curacao; and a light, please.\"\n She served the liqueur from one of the lovely bottles and striking a match held it to his cigarette with ministering archness while he whiffed.\n \"Well, have you heard from your husband lately, my dear?\" he asked.\n \"Not a sound,\" said she.\n \"Where is he?\"\n \"I left him in Australia; and I suppose he\u0027s there still.\"\n Jude\u0027s eyes grew rounder.\n \"What made you part from him?\"\n \"Don\u0027t you ask questions, and you won\u0027t hear lies.\"\n \"Come then, give me my change, which you\u0027ve been keeping from me for the last quarter of an hour; and I\u0027ll romantically vanish up the street of this picturesque city.\"\n She handed the change over the counter, in taking which he caught her fingers and held them. There was a slight struggle and titter, and he bade her good-bye and left.\n Jude had looked on with the eye of a dazed philosopher. It was extraordinary how far removed from his life Arabella now seemed to be. He could not realize their nominal closeness. And, this being the case, in his present frame of mind he was indifferent to the fact that Arabella was his wife indeed.\n The compartment that she served emptied itself of visitors, and after a brief thought he entered it, and went forward to the counter. Arabella did not recognize him for a moment. Then their glances met. She started; till a humorous impudence sparkled in her eyes, and she spoke.\n \"Well, I\u0027m blest! I thought you were underground years ago!\"\n \"Oh!\"\n \"I never heard anything of you, or I don\u0027t know that I should have come here. But never mind! What shall I treat you to this afternoon? A Scotch and soda? Come, anything that the house will afford, for old acquaintance\u0027 sake!\"\n \"Thanks, Arabella,\" said Jude without a smile. \"But I don\u0027t want anything more than I\u0027ve had.\" The fact was that her unexpected presence there had destroyed at a stroke his momentary taste for strong liquor as completely as if it had whisked him back to his milk-fed infancy.\n \"That\u0027s a pity, now you could get it for nothing.\"\n \"How long have you been here?\"\n \"About six weeks. I returned from Sydney three months ago. I always liked this business, you know.\"\n \"I wonder you came to this place!\"\n \"Well, as I say, I thought you were gone to glory, and being in London I saw the situation in an advertisement. Nobody was likely to know me here, even if I had minded, for I was never in Christminster in my growing up.\"\n \"Why did you return from Australia?\"\n \"Oh, I had my reasons.... Then you are not a don yet?\"\n \"No.\"\n \"Not even a reverend?\"\n \"No.\"\n \"Nor so much as a rather reverend dissenting gentleman?\"\n \"I am as I was.\"\n \"True--you look so.\" She idly allowed her fingers to rest on the pull of the beer-engine as she inspected him critically. He observed that her hands were smaller and whiter than when he had lived with her, and that on the hand which pulled the engine she wore an ornamental ring set with what seemed to be real sapphires--which they were, indeed, and were much admired as such by the young men who frequented the bar.\n \"So you pass as having a living husband,\" he continued.\n \"Yes. I thought it might be awkward if I called myself a widow, as I should have liked.\"\n \"True. I am known here a little.\"\n \"I didn\u0027t mean on that account--for as I said I didn\u0027t expect you. It was for other reasons.\"\n \"What were they?\"\n \"I don\u0027t care to go into them,\" she replied evasively. \"I make a very good living, and I don\u0027t know that I want your company.\"\n Here a chappie with no chin, and a moustache like a lady\u0027s eyebrow, came and asked for a curiously compounded drink, and Arabella was obliged to go and attend to him. \"We can\u0027t talk here,\" she said, stepping back a moment. \"Can\u0027t you wait till nine? Say yes, and don\u0027t be a fool. I can get off duty two hours sooner than usual, if I ask. I am not living in the house at present.\"\n He reflected and said gloomily, \"I\u0027ll come back. I suppose we\u0027d better arrange something.\"\n \"Oh, bother arranging! I\u0027m not going to arrange anything!\"\n \"But I must know a thing or two; and, as you say, we can\u0027t talk here. Very well; I\u0027ll call for you.\"\n Depositing his unemptied glass he went out and walked up and down the street. Here was a rude flounce into the pellucid sentimentality of his sad attachment to Sue. Though Arabella\u0027s word was absolutely untrustworthy, he thought there might be some truth in her implication that she had not wished to disturb him, and had really supposed him dead. However, there was only one thing now to be done, and that was to play a straightforward part, the law being the law, and the woman between whom and himself there was no more unity than between east and west being in the eye of the Church one person with him.\n Having to meet Arabella here, it was impossible to meet Sue at Alfredston as he had promised. At every thought of this a pang had gone through him; but the conjuncture could not be helped. Arabella was perhaps an intended intervention to punish him for his unauthorized love. Passing the evening, therefore, in a desultory waiting about the town wherein he avoided the precincts of every cloister and hall, because he could not bear to behold them, he repaired to the tavern bar while the hundred and one strokes were resounding from the Great Bell of Cardinal College, a coincidence which seemed to him gratuitous irony. The inn was now brilliantly lighted up, and the scene was altogether more brisk and gay. The faces of the barmaidens had risen in colour, each having a pink flush on her cheek; their manners were still more vivacious than before-- more abandoned, more excited, more sensuous, and they expressed their sentiments and desires less euphemistically, laughing in a lackadaisical tone, without reserve.\n The bar had been crowded with men of all sorts during the previous hour, and he had heard from without the hubbub of their voices; but the customers were fewer at last. He nodded to Arabella, and told her that she would find him outside the door when she came away.\n \"But you must have something with me first,\" she said with great good humour. \"Just an early night-cap: I always do. Then you can go out and wait a minute, as it is best we should not be seen going together.\" She drew a couple of liqueur glasses of brandy; and though she had evidently, from her countenance, already taken in enough alcohol either by drinking or, more probably, from the atmosphere she had breathed for so many hours, she finished hers quickly. He also drank his, and went outside the house.\n In a few minutes she came, in a thick jacket and a hat with a black feather. \"l live quite near,\" she said, taking his arm, \"and can let myself in by a latch-key at any time. What arrangement do you want to come to?\"\n \"Oh--none in particular,\" he answered, thoroughly sick and tired, his thoughts again reverting to Alfredston, and the train he did not go by; the probable disappointment of Sue that he was not there when she arrived, and the missed pleasure of her company on the long and lonely climb by starlight up the hills to Marygreen. \"l ought to have gone back really! My aunt is on her deathbed, I fear.\"\n \"I\u0027ll go over with you to-morrow morning. I think I could get a day off.\"\n There was something particularly uncongenial in the idea of Arabella, who had no more sympathy than a tigress with his relations or him, coming to the bedside of his dying aunt, and meeting Sue. Yet he said, \"Of course, if you\u0027d like to, you can.\"\n \"Well, that we\u0027ll consider.... Now, until we have come to some agreement it is awkward our being together here--where you are known, and I am getting known, though without any suspicion that I have anything to do with you. As we are going towards the station, suppose we take the nine-forty train to Aldbrickham? We shall be there in little more than half an hour, and nobody will know us for one night, and we shall be quite free to act as we choose till we have made up our minds whether we\u0027ll make anything public or not.\"\n \"As you like.\"\n \"Then wait till I get two or three things. This is my lodging. Sometimes when late I sleep at the hotel where I am engaged, so nobody will think anything of my staying out.\"\n She speedily returned, and they went on to the railway, and made the half-hour\u0027s journey to Aldbrickham, where they entered a third-rate inn near the station in time for a late supper.\n \n 她究竟真把手绢忘了，还是她因为伤心，希望在最后一刻要向他倾诉衷情？裘德百思不得其解。\n 他们走了，家里一片寂静，他没法再呆下去。他又怕自己把持不住，可能重蹈借酒浇愁的覆辙，于是到楼上脱下黑衣服，换上白的，把薄高帮鞋换成厚的，照常上班干下半天的活。\n 但是他在大教堂时候老仿佛听见身后有人说话，心里一直前咕着她要回来。他想入非非，认为她不大可能跟费乐生一块儿回家。这种感觉越来越强，而且越来越有刺激性。下班钟一敲，他就把工具一甩，直往家里奔。‘有人找过我吗？”\n 没人来过。\n 那个晚上，他有权使用楼下起坐室直到十二点，所以他整晚都坐在那儿；甚至钟打了十一点，房东全家都已进入睡乡，他还是摆脱不掉那个预感：她会回来，睡在他隔壁的小屋里，她先前不就睡过好多大吗？她的行动总是难以预料，既然如此，她又为什么不能回来？有她住一块儿，有她做紧邻的房客和朋友，哪怕同她的关系疏远得不能再疏远，他也就非常高兴啦，而绝对不会再生出拿她当情人和妻子的念头。他的晚饭仍然摆在桌上没动。他走到前门，轻轻把它开了，然后回到屋里坐着，就像旧历中夏日前几个夜晚害相思病的守候者那样盼望着心爱的人儿的幻影出现。\n 他胡思乱想一阵之后就上了楼，从窗口向外瞭望，心中绘出一幅她夜行前往伦敦，同费乐生到那儿度假的情景：他们旅途中的天空正像他现在所望见的那样，游云缕缕，月亮从云层中露出，略见朦胧，一两颗大星星皎然可辨，宛如迷茫的星云。在潮湿的夜气中，车声磷磷，他们到了下榻的旅馆，苏的历史翻开了新篇。接着他的心思投射到未来，看见她周围是些多多少少长得像她的孩子们；但是大自然铁面无私，决不许单凭一个爹或单凭一个妈就能一线单传，所以他把那些孩子想象成苏的形体奕世再传，从中聊以自慰的那个梦，也不免像其他人做那类梦一样，无法实现。凡是存这类打算，想恢复这样单根独脉制造出来的生命，一概被称之为半吊子货，为人所贱视。裘德说， “倘若我这无根无寄的爱情此生长隔，又或沦于渐灭，那么我能去看望看望她的孩子——她一个人生的孩子——不也是乐在其中吗？”他又像以往频频经历过那样，颓然醒悟，原来造物主对于人类的微妙感情深怀鄙夷，对他的热烈向往不屑一顾。\n 第二天和以后几天，他对苏的深情怀念所引起的强烈的压抑感更为显著了。他再也没法忍受麦尔切斯特的灯光；麦尔切斯特的阳光给他的感觉就像失掉光泽的油漆；蔚蓝的天空竟然跟锌板一样青白。随后他接到马利格林的老姑婆病重的消息；巧的是几乎同时，他收到从前在基督堂时的雇主的来信，提出他如果愿意，可以回去长期担任高等手艺活儿。两封信多少减轻了他的苦恼。他立即起身去探视多喜姑婆，还决定顺路到基督堂了解一下建筑商的意见有多大实际价值。\n 裘德发现姑婆的病情比艾林寡妇信中说的还严重。大概她还能拖几个礼拜或几个月，不过这种可能性微乎其微。他写信给苏，说明姑婆的病情，嘱她考虑是否在这位高龄亲戚在世时来探望一回。如果她能乘上火车在礼拜一晚上到达阿尔夫瑞顿站，同他从基督堂乘的回程车正好错车，那么他将在阿尔夫瑞顿大路上接她。这样他第二天早晨就去了基督堂，打算尽快回来，以便如约同苏见面。\n 那座学问之城显得疏远、冷漠，而他自己对于同它有关系的一切事物也不再有什么感情。但是在灿烂阳光下，那些有直棂窗的建筑学作品的正面光影交织，色彩鲜明，并已在四方院嫩草地上面绘出逶迤的垛堞的图形。裘德感到他以前从没见过这地方景色如此之美。他走到头一回看见苏的那条街。当初她坐在椅子上，俯身对着教会经卷，手拿猪鬃笔，那少女般光彩形象吸住他的想一询究竟的目光。椅子这会儿虽然还是不偏不离摆在原处，人则沓然。这光景就如同物在人亡，再无从找到合适的人能以接替她，致力于工艺方面的研究。她的形象现在成了那个城市的魂灵，至于从前一度使他大动感情的学问渊博、矢志不移的非凡人物却再也没有力量独占一方了。\n 尽管如此，他总还是到了那地方。为了实现自己的打算，他先到从前在“别是巴”靠近礼仪派圣·西拉教堂的住所。年老的房东太太开了门，一见他来了，似乎挺高兴，给他端来点午饭，跟他说以前雇他的建筑商来打听过他的通信处。\n 裘德去了以前干活的石作。但是老工棚和老工作台叫他大倒胃口，他深深感到不可能回到旧日梦想破灭了的地方，再在那儿呆下去。他渴望开往阿尔夫瑞顿的回程火车的钟点快快到来。他多半能迎上苏。\n 他看到的情景令他的心情异常恶劣，往下半个钟头，他就像中了魔一样活受罪，以往多次使他陷入绝望的感想又向他袭来——他这人实在不值得他自己，也不值得别人因为替他操心费力而惹起种种烦恼。恰好这半个钟头中间，他在四路口碰上破了产的经营圣器的五金商，也就是补锅匠泰勒，此人提出不妨到酒吧喝上一杯解解闷。于是他们一路沿街走去，到了基督堂的很有气派的热闹生活中心之一前面就站住了。原来就是那个小酒馆啊，他上次就是在那儿让人将了军，为回击而高诵拉丁文《信经》的。打他从那地方搬走以后，它已经按现代风貌彻底翻修，装磺得焕然一新，成为远近驰名的酒馆。门面富丽堂皇，颇能招徕顾客。\n 泰勒把自己一杯喝干就走了，他说那地方搞得太讲究，他觉着不自在；要不然他得是个酒鬼，不计较手里多少钱，硬拼一下就算了。裘德又稍呆了会儿才喝完，无精打采地站在一阵子人极少的酒吧中间，默不作声。酒吧拆掉了原来的装置，重新安排过了，红木件替换了漆件，在后方站位放满了软凳，室内按核定样式隔成包间，包间之内隔以镶着红木框子的磨砂玻璃，以防此一包间的酒客因被彼一包间的酒客认出来而感到难堪。柜台里边有两个女招待，她们靠着安着白把子的啤酒机，机上装有一排镀银小龙头，啤酒从龙头慢慢滴到锡囗槽子里。\n 裘德很乏，再说开往阿尔夫瑞顿的火车的时间没到，既然没事可做，他就坐到一个沙发上。女招待身后斜装着一排镜子，镜子前面是一溜儿玻璃槅子，上面陈列着各种各样的黄玉色、蓝宝石色、红宝石色和紫水晶色的瓶子，里边装的都是裘德叫不出名字的名酒。几个顾客走进了隔壁包间，空气一下子活跃起来，收银机开始操作，顾客每丢进一个硬币，就发出叮叮声。\n 裘德没法直接看到那个包间的女招待，不过他偶尔瞥见她身后镜子映出的背影。他本来有意无意地看看而已，不料她陡然掉过脸来，对镜整理头发。他吓了一跳，原来那是阿拉贝拉的脸。\n 要是她过到他这个包间来，她就会看见他。但是她没来，因为这由另一边的女招待负责。阿贝穿一件黑长袍，袖口上镶着白亚麻布花边，领子是白的，开口很大，体态较前更丰满，搭上左胸前佩一簇水仙花就更惹眼。她侍候的那个包间里边放着一盏酒精灯，冒着发蓝的火苗，正在催热上面的电镀水壶，水蒸气直往上飘。不过他只能从她身后的镜子里分辨出这些东西。镜子也映出她侍候的那些人的面孔，其中一个是年轻漂亮的浪荡儿，多半是个大学生，正对她说一件挺逗趣的经历。\n “哎，考克门先生，行啦！你怎敢跟咱这清白人讲这事儿！”她快活地高声说，“考克门先生，你把胡子鬈得这么个漂亮劲儿，是干啥用啊？”小伙子胡子刮得光光的，她这一回嘴逗引得哄堂大笑。\n “得啦！”他说。“给我来杯柑香酒，点个火吧。”\n 她从那些好看的瓶子中间拿出一个倒了酒，又擦了根火柴，讨好地猫着腰送到他的烟卷上，他立刻吸了一口。\n “好啦，亲爱的，你男人最近有消息吗？”\n “一个字儿也没有。”她说。\n “他在哪儿呀？”\n “我是在澳洲离开他的，估摸他还在那儿。”\n 裘德的眼睛瞪得更大了。\n “你怎么跟他散了呀？”\n “不问问题，也就听不见瞎话。”\n “那就是啦，把找的零给我吧，你卡在手里有一刻钟啦。我还要在这风景如画的城里再风流一阵子，就无影无踪喽。”\n 她把零钱从柜台上递给他，他顺手抓住她的手指头，还捏着不放。阿拉贝拉稍微挣了一下，哧哧地笑了笑。\n 裘德就像个头昏眼花的哲学家一直看下去。阿拉贝拉这会儿看起来跟他的生活居然拉开得这么远，真是太离谱了。就拿名分上的密切关系讲，他也看不出来还剩下什么。既然事情变化到了这地步，按他这会儿的心境，阿拉贝拉到底算得上还是算不上他妻子，他实在无所谓。\n 她侍候的那个包间已经空下来，他稍微想了想，就进去了。阿拉贝拉起初没认出他来。接着他们目光一对。她一下子愣住了，随即眼神露出了涎皮赖脸、满不在乎的味道，跟着开了口：\n “哎呀呀，我的天哪！我还当你早就人士为安啦！”\n “哦！”\n “我一直没听见你什么，要不然我才不上这儿来呢。不过这也算不了什么！我这个下午怎么招待招待你？威士忌加苏打？论咱们老交情，这屋子里的东西，随你点什么都行！”\n “谢谢，阿拉贝拉。”裘德说，没有笑容。“我什么也不想要，我已经喝够啦。”事实是她这出乎意料的出现倒掉了他一瞬间曾想喝烈酒的胃口，像是把他推回到吃奶的襁褓期。\n “这倒怪可惜的，那你就什么不用吧。”\n “你到这儿多久啦？”\n “大概六个礼拜吧。我是三个月之前从悉尼回来的。我向来喜欢这生意，这你知道。”\n “我不懂你怎么会上这儿来！”\n “好啦，我就说说吧，我原来当你一命归天啦。我在伦敦那会儿瞧见过这个位子招人的广告，我琢磨来琢磨去，反正这儿总没人认得我，因为我长大成人以后压根儿没到过基督堂。”\n “你干吗从澳洲向后转呢？”\n “哦，我自有道理。……那你现在还没当上大学学监吧？”\n “没有。”\n “连个牧师也没当上？”\n “没有。”\n “也没当反国教的老爷子？”\n “我原来什么样还是什么样。”\n “这话不错——瞧你这样儿就知道啦。”她一边上上下下打量他，一边懒洋洋地把手指头放在啤酒机的拉把上。他注意到她的手比他们在一块儿生活的时候还小还白，放在拉把儿上的手戴了只镶宝戒指，看上去真像蓝宝石——果然不错，而且常来这酒吧的小伙子们一见就赞不绝口。\n “这么说，你还冒着男人活着的名儿在混着哪。”他继续说。\n “对啦，我想我总得这么办才对路。我觉着说自己是寡妇，未免太别扭。”\n “这倒是实话。这儿知道我的人可不算少。”\n “我可不是那个意思——我已经说了，我早拿你不算数啦。这其间另有道理。”\n “什么道理？”\n “这会儿我不想说。”她没正面回答。“我眼下日子好得很，我可不想跟你缠到一块儿。”\n 这时进来一个没下巴颏的阔少，小胡子留得像女人的眉毛，他点名要一种挺希奇的搀合酒；阿拉贝拉只好先去招呼他。“咱们不好在这儿谈。”她说，犹豫了一下。“你还能等到九点再来？干脆说个行，别那么二百五似的。我可以请假，比平常早两个钟头下班。”\n 他想了想，闷声闷气地说，“我来就是啦。我看咱们倒得安排安排。”\n “哦，安排个屁！我才不要什么安排哪！”\n “不过我总得了解这么一两样才行呢；就照你说的办，咱们不在这儿谈。”\n 他把杯子里剩的酒倒掉，离开酒吧，到街上走来走去。他苦苦恋着苏，缠绵悱恻，本是一泓澄碧，不料被这突如其来的冲击搅浑了。阿拉贝拉的话固然绝不可信，可是她话里也透露出来她并不打算跟他纠缠的意思，以前当他离开人世，恐怕话中也有几分真。话说回来，现在还有唯一一件事得办，那非得采取一杆子到底办法不可，因为法律总是法律，再说就算她跟这个女人已经两不相干，比如一个东头一个西头，可是在教会眼里，他们还是合成一体呢。\n 既然他非在这儿跟阿拉贝拉碰头不可，那就不可能如约到阿尔夫瑞顿去迎苏了。这么一想，他就心里觉着刺痛；不过事情自有前缘，莫非天定。也许就因为他对苏的爱情踰分非礼，上苍有意把阿拉贝拉插进来，以示惩罚。所以这个晚上他只好在城里到处转悠，等着会她；同时他又避开每个有学院回廊和会堂的地方，因为他瞧见它们就觉得难受得不得了。在走回酒馆的路上，红衣主教学院大钟正好响了一百零一下，这种巧合简直就像对他存心嘲弄。酒馆已经灯火辉煌，场面一片欢腾，纵情嬉笑。女招待粉面生春，个个颊上飞红；她们一举一动比先前更来得轻快自然——更大胆、更兴奋、更富于肉感，表现自己的情绪与欲望不再躲躲闪闪、扭扭捏捏，而是懒洋洋。软绵绵，笑个没完。\n 前一个钟头，酒吧挤满各色人等，他在外面听得见他们大声喧呼；但到得后来，剩下的顾客不多了。他对阿拉贝拉点点头，示意她出来时候可以在门外找到他。\n “不过你先得跟我来点什么。”她兴致勃勃地说。“先来个睡前杯吧，我天天这样。然后你就先出去，等个分把钟，咱们顶好别让人瞧见在一块儿。”她倒了两杯白兰地；虽然她脸上明明是喝足了，或者说她吸足那么多钟头的酒气，把她薰够了，她还是一倾而尽。他也喝了自己的一杯，然后走到酒馆外面。\n 几分钟后她出来了，穿着一件厚上衣，戴着一顶上插黑羽毛的帽子。“我住得挺近。”她说，挽起他的胳臂。“我有前门钥匙，什么时候都进得去。你倒是要怎么个安排法儿？”\n “哦——没什么特别的。”他回答，又难受又累。他的思想又转到阿尔夫瑞顿，他赶不上那趟火车了。苏到时看不到他，难免大失所望，他也错过了跟她同行，爬上往马利格林的又长又僻静的山路的乐趣。“我真应该回去。我担心姑婆都停床啦。”\n “明儿早上我跟你过那边去。我看我可以请天假。”\n 阿拉贝拉平素就像母夜叉，无论对他的亲人还是他本人，哪有什么情义可言，这会儿居然准备到他的垂死的姑婆床前，还要跟苏见面，他觉得真是太出格了。不过他说：“当然，你要愿意去，就去好啦。”\n “好吧，咱们得考虑考虑啊……就说这会儿吧，咱们先得来个协议，要不然咱们在这地方呆在一块儿就啰嗦啦，因为这儿人家本来认识你，慢慢儿也认识我啦，眼下自然还没人瞎猜疑我跟你有什么关系。咱们这会儿正朝车站那边走，你瞧咱们就搭九点四十分的火车上奥尔布里肯好不好？不到半个钟头就到啦，也没人认得咱们，想干什么，就干什么，谁也管不着。以后咱们再定关系公开不公开好啦。”\n “随你便吧。”\n “那你就等着我去拿两三样东西。我就住这儿。有时候晚了，我才歇在干活儿的饭店里头，所以没人会想到我在外面过夜。”\n 她很快回来了，他们接着走到车站，坐半个钟头火车去奥尔布里肯；到达后住进靠火车站一家三等客店，刚好赶上来顿晚饭。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/292/7803.html","bookId":190,"book":{"id":190,"title":"无名的裘德 Jude the Obscure","description":"简介： Jude the Obscure, the last of Thomas Hardy\u0027s novels, began as a magazine serial and was first published in book form in 1895. The book was burned publicly by William Walsham How, Bishop of Wakefield, in that same year. Its hero, Jude Fawley...","cover":"http://novel.tingroom.com/uploads/110425/1-110425151Z1A7.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/292","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
