{"id":5931,"no":40,"title":"Part 5 Chapter 1","content":"How Gillingham\u0027s doubts were disposed of will most quickly appear by passing over the series of dreary months and incidents that followed the events of the last chapter, and coming on to a Sunday in the February of the year following. Sue and Jude were living in Aldbrickham, in precisely the same relations that they had established between themselves when she left Shaston to join him the year before. The proceedings in the law-courts had reached their consciousness, but as a distant sound and an occasional missive which they hardly understood. They had met, as usual, to breakfast together in the little house with Jude\u0027s name on it, that he had taken at fifteen pounds a year, with three-pounds-ten extra for rates and taxes, and furnished with his aunt\u0027s ancient and lumbering goods, which had cost him about their full value to bring all the way from Marygreen. Sue kept house, and managed everything. As he entered the room this morning Sue held up a letter she had just received. \"Well; and what is it about?\" he said after kissing her. \"That the decree NISI in the case of Phillotson VERSUS Phillotson and Fawley, pronounced six months ago, has just been made absolute.\" \"Ah,\" said Jude, as he sat down. The same concluding incident in Jude\u0027s suit against Arabella had occurred about a month or two earlier. Both cases had been too insignificant to be reported in the papers, further than by name in a long list of other undefended cases. \"Now then, Sue, at any rate, you can do what you like!\" He looked at his sweetheart curiously. \"Are we--you and I--just as free now as if we had never married at all?\" \"Just as free--except, I believe, that a clergyman may object personally to remarry you, and hand the job on to somebody else.\" \"But I wonder--do you think it is really so with us? I know it is generally. But I have an uncomfortable feeling that my freedom has been obtained under false pretences!\" \"How?\" \"Well--if the truth about us had been known, the decree wouldn\u0027t have been pronounced. It is only, is it, because we have made no defence, and have led them into a false supposition? Therefore is my freedom lawful, however proper it may be?\" \"Well--why did you let it be under false pretences? You have only yourself to blame,\" he said mischievously. \"Jude--don\u0027t! You ought not to be touchy about that still. You must take me as I am.\" \"Very well, darling: so I will. Perhaps you were right. As to your question, we were not obliged to prove anything. That was their business. Anyhow we are living together.\" \"Yes. Though not in their sense.\" \"One thing is certain, that however the decree may be brought about, a marriage is dissolved when it is dissolved. There is this advantage in being poor obscure people like us-- that these things are done for us in a rough and ready fashion. It was the same with me and Arabella. I was afraid her criminal second marriage would have been discovered, and she punished; but nobody took any interest in her--nobody inquired, nobody suspected it. If we\u0027d been patented nobilities we should have had infinite trouble, and days and weeks would have been spent in investigations.\" By degrees Sue acquired her lover\u0027s cheerfulness at the sense of freedom, and proposed that they should take a walk in the fields, even if they had to put up with a cold dinner on account of it. Jude agreed, and Sue went up-stairs and prepared to start, putting on a joyful coloured gown in observance of her liberty; seeing which Jude put on a lighter tie. \"Now we\u0027ll strut arm and arm,\" he said, \"like any other engaged couple. We\u0027ve a legal right to.\" They rambled out of the town, and along a path over the low-lying lands that bordered it, though these were frosty now, and the extensive seed-fields were bare of colour and produce. The pair, however, were so absorbed in their own situation that their surroundings were little in their consciousness. \"Well, my dearest, the result of all this is that we can marry after a decent interval.\" \"Yes; I suppose we can,\" said Sue, without enthusiasm. \"And aren\u0027t we going to?\" \"I don\u0027t like to say no, dear Jude; but I feel just the same about it now as I have done all along. I have just the same dread lest an iron contract should extinguish your tenderness for me, and mine for you, as it did between our unfortunate parents.\" \"Still, what can we do? I do love you, as you know, Sue.\" \"I know it abundantly. But I think I would much rather go on living always as lovers, as we are living now, and only meeting by day. It is so much sweeter--for the woman at least, and when she is sure of the man. And henceforward we needn\u0027t be so particular as we have been about appearances.\" \"Our experiences of matrimony with others have not been encouraging, I own,\" said he with some gloom; \"either owing to our own dissatisfied, unpractical natures, or by our misfortune. But we two----\" \"Should be two dissatisfied ones linked together, which would be twice as bad as before.... I think I should begin to be afraid of you, Jude, the moment you had contracted to cherish me under a Government stamp, and I was licensed to be loved on the premises by you--Ugh, how horrible and sordid! Although, as you are, free, I trust you more than any other man in the world.\" \"No, no--don\u0027t say I should change!\" he expostulated; yet there was misgiving in his own voice also. \"Apart from ourselves, and our unhappy peculiarities, it is foreign to a man\u0027s nature to go on loving a person when he is told that he must and shall be that person\u0027s lover. There would be a much likelier chance of his doing it if he were told not to love. If the marriage ceremony consisted in an oath and signed contract between the parties to cease loving from that day forward, in consideration of personal possession being given, and to avoid each other\u0027s society as much as possible in public, there would be more loving couples than there are now. Fancy the secret meetings between the perjuring husband and wife, the denials of having seen each other, the clambering in at bedroom windows, and the hiding in closets! There\u0027d be little cooling then.\" \"Yes; but admitting this, or something like it, to be true, you are not the only one in the world to see it, dear little Sue. People go on marrying because they can\u0027t resist natural forces, although many of them may know perfectly well that they are possibly buying a month\u0027s pleasure with a life\u0027s discomfort. No doubt my father and mother, and your father and mother, saw it, if they at all resembled us in habits of observation. But then they went and married just the same, because they had ordinary passions. But you, Sue, are such a phantasmal, bodiless creature, one who--if you\u0027ll allow me to say it-- has so little animal passion in you, that you can act upon reason in the matter, when we poor unfortunate wretches of grosser substance can\u0027t.\" \"Well,\" she sighed, \"you\u0027ve owned that it would probably end in misery for us. And I am not so exceptional a woman as you think. Fewer women like marriage than you suppose, only they enter into it for the dignity it is assumed to confer, and the social advantages it gains them sometimes--a dignity and an advantage that I am quite willing to do without.\" Jude fell back upon his old complaint--that, intimate as they were, he had never once had from her an honest, candid declaration that she loved or could love him. \"I really fear sometimes that you cannot,\" he said, with a dubiousness approaching anger. \"And you are so reticent. I know that women are taught by other women that they must never admit the full truth to a man. But the highest form of affection is based on full sincerity on both sides. Not being men, these women don\u0027t know that in looking back on those he has had tender relations with, a man\u0027s heart returns closest to her who was the soul of truth in her conduct. The better class of man, even if caught by airy affectations of dodging and parrying, is not retained by them. A Nemesis attends the woman who plays the game of elusiveness too often, in the utter contempt for her that, sooner or later, her old admirers feel; under which they allow her to go unlamented to her grave.\" Sue, who was regarding the distance, had acquired a guilty look; and she suddenly replied in a tragic voice: \"I don\u0027t think I like you to-day so well as I did, Jude!\" \"Don\u0027t you? Why?\" \"Oh, well--you are not nice--too sermony. Though I suppose I am so bad and worthless that I deserve the utmost rigour of lecturing!\" \"No, you are not bad. You are a dear. But as slippery as an eel when I want to get a confession from you.\" \"Oh yes I am bad, and obstinate, and all sorts! It is no use your pretending I am not! People who are good don\u0027t want scolding as I do.... But now that I have nobody but you, and nobody to defend me, it is very hard that I mustn\u0027t have my own way in deciding how I\u0027ll live with you, and whether I\u0027ll be married or no!\" \"Sue, my own comrade and sweetheart, I don\u0027t want to force you either to marry or to do the other thing--of course I don\u0027t! It is too wicked of you to be so pettish! Now we won\u0027t say any more about it, and go on just the same as we have done; and during the rest of our walk we\u0027ll talk of the meadows only, and the floods, and the prospect of the farmers this coming year.\" After this the subject of marriage was not mentioned by them for several days, though living as they were with only a landing between them it was constantly in their minds. Sue was assisting Jude very materially now: he had latterly occupied himself on his own account in working and lettering headstones, which he kept in a little yard at the back of his little house, where in the intervals of domestic duties she marked out the letters full size for him, and blacked them in after he had cut them. It was a lower class of handicraft than were his former performances as a cathedral mason, and his only patrons were the poor people who lived in his own neighbourhood, and knew what a cheap man this \"Jude Fawley: Monumental Mason\" (as he called himself on his front door) was to employ for the simple memorials they required for their dead. But he seemed more independent than before, and it was the only arrangement under which Sue, who particularly wished to be no burden on him, could render any assistance. 在上一章所叙种种变化后，接下来的几个月沉闷单调，没有波澜起伏，但是季令安对费乐生的决定所持的怀疑，到次年二月一个礼拜天，就在须臾间廓清了。 苏和裘德这时住在奥尔布里肯，他们之间的关系跟她从沙氏顿来同他相聚时建立的相比，一切照旧。法庭的诉讼程序犹如远方传来的声音，时有所闻而已，至于间或送达的法律文书，他们看了也不大明白。 他们住在一座标着裘德名牌的小房子里，平常都是早饭时候见面。裘德一年得出十五镑房租，外加三镑十先令房捐，家里摆着他姑婆的古老笨重的家具，单为把它们从马利格林运过来的花费就抵得上它们的全部价值。苏管家，料理一切。 那个早上，他一进屋子就瞧见苏手上拿着一封信，是她才收到的。 “呃，这里头是什么玩意儿？”他吻了苏之后说。 “是费乐生诉费乐生和福来一案的最后判决书，六个月以前公告过，现在已经到期，判决刚刚生效。” “啊。”裘德说着就坐下来。 裘德诉阿拉贝拉离婚案大约一两个月之前也有了同样结果。两案实在无足重轻，所以报章不屑报道，只在一长串无异议案件表上公布一下姓名就算了。 “苏，你现在总算可以想干什么就干什么啦！”他看着心爱的人，带着好奇的神气。 “咱们——你跟我这么一来是不是跟压根儿没结过婚一样自由呢？” “一样自由——我看，就差一样，牧师也许拒绝由他本人给你主持婚礼，让给别人替他办吧。” “不过我还是没明白——你真是觉着咱们就那么自由吗？我大致知道是自由了。可是我心里直嘀咕，因为我这自由是靠欺诈弄到手的。” “怎么这么说呢？” “呃——人家要是知道咱们的实情，决不会把判决公告出来。就因为咱们一点没为自己辩护，让他们做了错误的推断，认为理当如此，对不对？不管程序多正当，难道我这自由就合乎法律的规定吗？” “哎——你先头干吗用欺诈取得自由呢？这只好怪你自己喽。”他说，故意怄她。 “裘德——别这么说！你大可不必为这个瞎生气。我是怎么样就怎么样，你别把我看错了。” “好啦，好啦，亲亲，我听命就是啦。你大概对吧。至于你那个问题，咱们本来无需去表示什么，该怎么办是他们的事儿。反正咱们在一块儿过啦。” “话是这么说，不过他们的判决的含义不是这个意思。” “有一点总是确定无疑的。别管判决怎么来的，反正该判离婚就判了离婚。拿咱们这样出不了头的穷人说，碰上这样的事也有好处——反正按现成规章给咱们草草一办就行了。我跟阿拉贝拉的事也一样。我原来还担心她第二次犯了法的婚姻一旦叫人发现了，要受惩罚呢；可是谁对她也没兴趣，没人去查问，也没人起疑心。咱们要是有封号的贵族，那麻烦可就无尽无休了，一调查就是多少天，多少个礼拜。” 苏自己也跟她情人一样因获得自由而慢慢感到心情舒畅，于是提出到野外散步，尽管晚上免不了吃冷饭。裘德也赞成。她上楼打扮了一下，穿上一件艳丽的长袍来纪念她的自由。裘德一看她这样，也打了条色调明快的领带。 “现在咱们可以挽着胳臂大摇大摆地走啦，”他说，“就跟别的订了婚的两口子一样。咱们现在有合法权利这样做啦。” 他们慢慢腾腾地出了市区，顺着一条小路走。路两边的洼地全结了霜，广阔的麦田已经下了种，庄稼还没露头，还是原来干巴巴的泥土颜色。不过这一对情人全心沉浸在他们自己这会儿所处的情境里，周围的景物在他们的意识里占不到地位。 “啊，我的最亲爱的，既然有了这么个结果，再到个适当时间，咱们就可以结婚啦。” “是啊，我看咱们可以结婚啦。”苏说，没表现出热情。 “那咱们要不要就办呢？” “我可不想说别这样，亲爱的裘德；不过我这会儿的感觉，还跟我以前经历的一样。我还跟以前一样怕，怕的是一份铁一般的契约就把你对我的柔情、我对你的柔情，全给葬送了，落得跟咱们不幸的爹妈的下场一样。” “那要是这样，咱们又能怎么办呢？你知道，苏，我是真真爱你呀。” “我知道得心里快盛不下啦。可是我觉着宁可咱们老接着情人那样过下去，一天见一回就行啦。那样要甜蜜得多呢——至少女人是这个感觉，只要她觉着这个男人靠得住就行。往后咱们也就用不着老是为出头露面费心思啦。” “要说按咱们跟别人的结婚经验，的确叫人心灰意冷，这我也有数。”他说，略显颓丧。“要不是因为咱们生来不知足，不实际，就是因为咱们命不好。不过咱们两个——” “要是两个都不知足，又凑到一块儿，那不是比以前还雪上加霜吗？我想着，一朝你靠着政府大印，按契约把我据为己有，我呢，按“只限店内”特许条件承你错爱，我一定害怕起来了，裘德——噢，这多可怕、多肮脏啊！固然你现在随心所欲，谁也管不着，我对你可比对谁都信赖哪。” “对，对——你可不能说我会变心！”他急着阻止她往下说，不过他声音也带着几分疑虑。 “撇开咱们自己、咱们倒霉的乖僻不说吧，如果谁要是对一个男人说他应该受某某，要当她的情人，按男人的天性，那就背道而驰了，他再也不会把那个人爱下去了。如果人家叫他别爱，那么他爱那个人的缘分可能还大得多呢。要是结婚仪式，包括起誓签约，说从当天起，他们双方相爱到此为止，又由于双方都成了对方的人，要尽量留在各自小天地而避免在公开场合相伴露面，那一来相亲相爱的夫妻准比现在多了。你就好好想想吧，那发了假誓的丈夫和妻子该怎么偷偷约会呀，不许他们见面，那就逾窗入室，藏身柜子，共度良宵！这样他们的爱情就不会冷下去了。” “你说得不错。不过就算你看到情况会这样，或者大致这样，说实话，你也不是唯一有这种看法的人，亲爱的小苏啊。人们接连不断地结婚是因为他们抗不住自然的力量，尽管其中很多人心里完全有数，为了得到一个月的快乐，可能要拿一辈子受罪做代价。我爹我妈，你爹你妈，要是也有跟咱们一样的观察事物的习惯，毫无疑问，也看得明白。无奈他们还是照结婚不误，因为他们都有普通的情欲。可是你呢，苏啊，你空灵有如幻影，飘渺若无肉身，是这般生灵，你若容我说，我就说你简直就没有出自动物本能的情欲，所以你所作所为一概听命于理性，而我们这些粗劣坯子造出来的可怜而又不幸的浊物可办不到啊。” “唉，”她叹口气，“你也承认咱们要是结婚，结局大概也挺惨。我倒不是你想象的那么一个一万里头也挑个出来的女人。不过真想结婚的女人比你设想的少得多，她们所以走这一步，不过自以为有了个身份，有时候也能得到在社会上的好处——而我是我行我素，不管什么身份与好处。” 裘德的思想禁不住回到他耿耿于怀的事情上——他们固然关系亲热，可他连一回也没听她诚实而恳挚地表白过，说她爱他，或她能爱他。“我的确有时候挺害怕你不爱我。”他说，那疑心近乎生气。“你就是这么一字不提。我知道，女人都从别的女人那儿学，千万别对男人把实话说尽。但是最高形式的情深意切的爱的基础正是双方毫无保留的真诚。那类女人，因为她们不是男人，不知道他回顾以往跟女人柔情缱绻之时，他感到最贴心的总是言行表现出真心的那个女人。素性好的男人固然一时让假假真真的柔情一擒一纵，可是他们并不会老让她们摆布。一个好玩欲擒故纵、藏头露尾手腕的女人，早晚受到报应，自食其果，让原来对她倾心相与的男人鄙视；他们也因此看着她走向绝路，而不会为之动容，流涕。” 苏正目注远处，脸上显出内愧，突然她以伤感的口气回应说：“我觉着今儿个不像先头那么喜欢你啦，裘德！” “你不喜欢？这是为什么？” “哦，我讨厌——你老是说教。不过我想我这么坏，这么下作，活该你劈头盖脸教训一通！” “不是这么回事儿，你不坏。你是个叫人疼的。不过我一想听你说真心话，你就跟鳗鱼一样滑。” “啊，我就是又坏又不讲理，坏到家啦。你捧我，说我不坏，那没用！品性好的人不像我这样招人骂！……不过我现在既然没别人，只有你，也没别人替我说话，你要是不许我按自己的方式决定怎么跟你一块儿过，决定跟还是不跟你结婚，那我就觉着苦不堪言啦！” “苏啊，你是我的同志，是我的心上人哪，我才不想勉强你结婚或者干这个于那个——我绝对不会那样！你这么乱发脾气，实在太要不得！现在咱们别谈这个啦，还是照以前一样，该怎么样，就怎么样。咱们还有一段时间散散步，就谈谈牧场呀，流水呀，往后这一年的年景呀，好啦。” 以后几天他们没再提结婚这个题目，不过他们住在一块儿，中间只隔个楼梯平台，心里免不了老揣着这件事。苏现在给裘德帮的忙倒挺实在的，他如今一心扑在干活上，在墓碑上凿字。房后边有个小院子，他把石头都放在里边。苏做完家务事，一有空，就帮他把字母按大小描好，等他镌好，再上墨。他这个手艺比从前当大教堂的石匠要下一等，他的主顾都是住在方近左右的穷人，他们都认识这个“石匠裘德·福来：专凿纪念碑”（他自己前门上有这个招牌），干活要价低。他们需要为亡人立个简单的纪念物，就找他。但是他如今看来比以前更不必俯仰由人了。苏特别不愿意成他的累赘，她能帮他忙的也只能在这方面插得上手。","sourceLink":"http://novel.tingroom.com/jingdian/292/7814.html","bookId":190,"book":{"id":190,"title":"无名的裘德 Jude the Obscure","description":"简介： Jude the Obscure, the last of Thomas Hardy\u0027s novels, began as a magazine serial and was first published in book form in 1895. The book was burned publicly by William Walsham How, Bishop of Wakefield, in that same year. Its hero, Jude Fawley...","cover":"http://novel.tingroom.com/uploads/110425/1-110425151Z1A7.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/292","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
