{"id":5936,"no":45,"title":"Part 5 Chapter 6","content":"THE unnoticed lives that the pair had hitherto led began, from the day of the suspended wedding onwards, to be observed and discussed by other persons than Arabella. The society of Spring Street and the neighbourhood generally did not understand, and probably could not have been made to understand, Sue and Jude\u0027s private minds, emotions, positions, and fears. The curious facts of a child coming to them unexpectedly, who called Jude \"Father,\" and Sue \"Mother,\" and a hitch in a marriage ceremony intended for quietness to be performed at a registrar\u0027s office, together with rumours of the undefended cases in the law-courts, bore only one translation to plain minds.\n Little Time--for though he was formally turned into \"Jude,\" the apt nickname stuck to him--would come home from school in the evening, and repeat inquiries and remarks that had been made to him by the other boys; and cause Sue, and Jude when he heard them, a great deal of pain and sadness.\n The result was that shortly after the attempt at the registrar\u0027s the pair went off--to London it was believed--for several days, hiring somebody to look to the boy. When they came back they let it be understood indirectly, and with total indifference and weariness of mien, that they were legally married at last. Sue, who had previously been called Mrs. Bridehead now openly adopted the name of Mrs. Fawley. Her dull, cowed, and listless manner for days seemed to substantiate all this.\n But the mistake (as it was called) of their going away so secretly to do the business, kept up much of the mystery of their lives; and they found that they made not such advances with their neighbours as they had expected to do thereby. A living mystery was not much less interesting than a dead scandal.\n The baker\u0027s lad and the grocer\u0027s boy, who at first had used to lift their hats gallantly to Sue when they came to execute their errands, in these days no longer took the trouble to render her that homage, and the neighbouring artizans\u0027 wives looked straight along the pavement when they encountered her.\n Nobody molested them, it is true; but an oppressive atmosphere began to encircle their souls, particularly after their excursion to the show, as if that visit had brought some evil influence to bear on them. And their temperaments were precisely of a kind to suffer from this atmosphere, and to be indisposed to lighten it by vigorous and open statements. Their apparent attempt at reparation had come too late to be effective.\n The headstone and epitaph orders fell off: and two or three months later, when autumn came, Jude perceived that he would have to return to journey-work again, a course all the more unfortunate just now, in that he had not as yet cleared off the debt he had unavoidably incurred in the payment of the law-costs of the previous year.\n One evening he sat down to share the common meal with Sue and the child as usual. \"I am thinking,\" he said to her, \"that I\u0027ll hold on here no longer. The life suits us, certainly; but if we could get away to a place where we are unknown, we should be lighter hearted, and have a better chance. And so I am afraid we must break it up here, however awkward for you, poor dear!\"\n Sue was always much affected at a picture of herself as an object of pity, and she saddened.\n \"Well--I am not sorry,\" said she presently. \"I am much depressed by the way they look at me here. And you have been keeping on this house and furniture entirely for me and the boy! You don\u0027t want it yourself, and the expense is unnecessary. But whatever we do, wherever we go, you won\u0027t take him away from me, Jude dear? I could not let him go now! The cloud upon his young mind makes him so pathetic to me; I do hope to lift it some day! And he loves me so. You won\u0027t take him away from me?\"\n \"Certainly I won\u0027t, dear little girl! We\u0027ll get nice lodgings, wherever we go. I shall be moving about probably--getting a job here and a job there.\"\n \"I shall do something too, of course, till--till Well, now I can\u0027t be useful in the lettering it behoves me to turn my hand to something else.\"\n \"Don\u0027t hurry about getting employment,\" he said regretfully. \"I don\u0027t want you to do that. I wish you wouldn\u0027t, Sue. The boy and yourself are enough for you to attend to.\"\n There was a knock at the door, and Jude answered it. Sue could hear the conversation:\n \"Is Mr. Fawley at home? ... Biles and Willis the building contractors sent me to know if you\u0027ll undertake the relettering of the ten commandments in a little church they\u0027ve been restoring lately in the country near here.\"\n Jude reflected, and said he could undertake it.\n \"It is not a very artistic job,\" continued the messenger. \"The clergyman is a very old-fashioned chap, and he has refused to let anything more be done to the church than cleaning and repairing.\"\n \"Excellent old man!\" said Sue to herself, who was sentimentally opposed to the horrors of over-restoration.\n \"The Ten Commandments are fixed to the east end,\" the messenger went on, \"and they want doing up with the rest of the wall there, since he won\u0027t have them carted off as old materials belonging to the contractor in the usual way of the trade.\"\n A bargain as to terms was struck, and Jude came indoors. \"There, you see,\" he said cheerfully. \"One more job yet, at any rate, and you can help in it--at least you can try. We shall have all the church to ourselves, as the rest of the work is finished.\"\n Next day Jude went out to the church, which was only two miles off. He found that what the contractor\u0027s clerk had said was true. The tables of the Jewish law towered sternly over the utensils of Christian grace, as the chief ornament of the chancel end, in the fine dry style of the last century. And as their framework was constructed of ornamental plaster they could not be taken down for repair. A portion, crumbled by damp, required renewal; and when this had been done, and the whole cleansed, he began to renew the lettering. On the second morning Sue came to see what assistance she could render, and also because they liked to be together.\n The silence and emptiness of the building gave her confidence, and, standing on a safe low platform erected by Jude, which she was nevertheless timid at mounting, she began painting in the letters of the first Table while he set about mending a portion of the second. She was quite pleased at her powers; she had acquired them in the days she painted illumined texts for the church-fitting shop at Christminster. Nobody seemed likely to disturb them; and the pleasant twitter of birds, and rustle of October leafage, came in through an open window, and mingled with their talk.\n They were not, however, to be left thus snug and peaceful for long. About half-past twelve there came footsteps on the gravel without. The old vicar and his churchwarden entered, and, coming up to see what was being done, seemed surprised to discover that a young woman was assisting. They passed on into an aisle, at which time the door again opened, and another figure entered--a small one, that of little Time, who was crying. Sue had told him where he might find her between school-hours, if he wished. She came down from her perch, and said, \"What\u0027s the matter, my dear?\"\n \"I couldn\u0027t stay to eat my dinner in school, because they said----\" He described how some boys had taunted him about his nominal mother, and Sue, grieved, expressed her indignation to Jude aloft. The child went into the churchyard, and Sue returned to her work. Meanwhile the door had opened again, and there shuffled in with a businesslike air the white-aproned woman who cleaned the church. Sue recognized her as one who had friends in Spring Street, whom she visited. The church-cleaner looked at Sue, gaped, and lifted her hands; she had evidently recognized Jude\u0027s companion as the latter had recognized her. Next came two ladies, and after talking to the charwoman they also moved forward, and as Sue stood reaching upward, watched her hand tracing the letters, and critically regarded her person in relief against the white wall, till she grew so nervous that she trembled visibly.\n They went back to where the others were standing, talking in undertones: and one said--Sue could not hear which--\"She\u0027s his wife, I suppose?\"\n \"Some say Yes: some say No,\" was the reply from the charwoman.\n \"Not? Then she ought to be, or somebody\u0027s--that\u0027s very clear!\"\n \"They\u0027ve only been married a very few weeks, whether or no.\"\n \"A strange pair to be painting the Two Tables! I wonder Biles and Willis could think of such a thing as hiring those!\"\n The churchwarden supposed that Biles and Willis knew of nothing wrong, and then the other, who had been talking to the old woman, explained what she meant by calling them strange people.\n The probable drift of the subdued conversation which followed was made plain by the churchwarden breaking into an anecdote, in a voice that everybody in the church could hear, though obviously suggested by the present situation:\n \"Well, now, it is a curious thing, but my grandfather told me a strange tale of a most immoral case that happened at the painting of the Commandments in a church out by Gaymead-- which is quite within a walk of this one. In them days Commandments were mostly done in gilt letters on a black ground, and that\u0027s how they were out where I say, before the owld church was rebuilded. It must have been somewhere about a hundred years ago that them Commandments wanted doing up just as ours do here, and they had to get men from Aldbrickham to do \u0027em. Now they wished to get the job finished by a particular Sunday, so the men had to work late Saturday night, against their will, for overtime was not paid then as \u0027tis now. There was no true religion in the country at that date, neither among pa\u0027sons, clerks, nor people, and to keep the men up to their work the vicar had to let \u0027em have plenty of drink during the afternoon. As evening drawed on they sent for some more themselves; rum, by all account. It got later and later, and they got more and more fuddled, till at last they went a-putting their rum-bottle and rummers upon the communion table, and drawed up a trestle or two, and sate round comfortable and poured out again right hearty bumpers. No sooner had they tossed off their glasses than, so the story goes they fell down senseless, one and all. How long they bode so they didn\u0027t know, but when they came to themselves there was a terrible thunder-storm a-raging, and they seemed to see in the gloom a dark figure with very thin legs and a curious voot, a-standing on the ladder, and finishing their work. When it got daylight they could see that the work was really finished, and couldn\u0027t at all mind finishing it themselves. They went home, and the next thing they heard was that a great scandal had been caused in the church that Sunday morning, for when the people came and service began, all saw that the Ten Commandments wez painted with the \"nots\" left out. Decent people wouldn\u0027t attend service there for a long time, and the Bishop had to be sent for to reconsecrate the church. That\u0027s the tradition as I used to hear it as a child. You must take it for what it is wo\u0027th, but this case to-day has reminded me o\u0027t, as I say.\"\n The visitors gave one more glance, as if to see whether Jude and Sue had left the \"nots\" out likewise, and then severally left the church, even the old woman at last. Sue and Jude, who had not stopped working, sent back the child to school, and remained without speaking; till, looking at her narrowly, he found she had been crying silently.\n \"Never mind, comrade!\" he said. \"I know what it is!\"\n \"I can\u0027t BEAR that they, and everybody, should think people wicked because they may have chosen to live their own way! It is really these opinions that make the best intentioned people reckless, and actually become immoral!\"\n \"Never be cast down! It was only a funny story.\"\n \"Ah, but we suggested it! I am afraid I have done you mischief, Jude, instead of helping you by coming!\"\n To have suggested such a story was certainly not very exhilarating, in a serious view of their position. However, in a few minutes Sue seemed to see that their position this morning had a ludicrous side, and wiping her eyes she laughed.\n \"It is droll, after all,\" she said, \"that we two, of all people, with our queer history, should happen to be here painting the Ten Commandments! You a reprobate, and I--in my condition.... O dear!\" ... And with her hand over her eyes she laughed again silently and intermittently, till she was quite weak.\n \"That\u0027s better,\" said Jude gaily. \"Now we are right again, aren\u0027t we, little girl!\"\n \"Oh but it is serious, all the same!\" she sighed as she took up the brush and righted herself. \"But do you see they don\u0027t think we are married? They WON\u0027T believe it! It is extraordinary!\"\n \"I don\u0027t care whether they think so or not,\" said Jude. \"I shan\u0027t take any more trouble to make them.\"\n They sat down to lunch--which they had brought with them not to hinder time-- and having eaten it were about to set to work anew when a man entered the church, and Jude recognized in him the contractor Willis. He beckoned to Jude, and spoke to him apart.\n \"Here--I\u0027ve just had a complaint about this,\" he said, with rather breathless awkwardness. \"I don\u0027t wish to go into the matter-- as of course I didn\u0027t know what was going on--but I am afraid I must ask you and her to leave off, and let somebody else finish this! It is best, to avoid all unpleasantness. I\u0027ll pay you for the week, all the same.\"\n Jude was too independent to make any fuss; and the contractor paid him, and left. Jude picked up his tools, and Sue cleansed her brush. Then their eyes met.\n \"How could we be so simple as to suppose we might do this!\" said she, dropping to her tragic note. \"Of course we ought not-- I ought not--to have come!\"\n \"I had no idea that anybody was going to intrude into such a lonely place and see us!\" Jude returned. \"Well, it can\u0027t be helped, dear; and of course I wouldn\u0027t wish to injure Willis\u0027s trade-connection by staying.\" They sat down passively for a few minutes, proceeded out of the church, and overtaking the boy pursued their thoughtful way to Aldbrickham.\n Fawley had still a pretty zeal in the cause of education, and, as was natural with his experiences, he was active in furthering \"equality of opportunity\" by any humble means open to him. He had joined an Artizans\u0027 Mutual Improvement Society established in the town about the time of his arrival there; its members being young men of all creeds and denominations, including Churchmen, Congregationalists, Baptists, Unitarians, Positivists, and others-- agnostics had scarcely been heard of at this time--their one common wish to enlarge their minds forming a sufficiently close bond of union. The subscription was small, and the room homely; and Jude\u0027s activity, uncustomary acquirements, and above all, singular intuition on what to read and how to set about it-- begotten of his years of struggle against malignant stars--had led to his being placed on the committee.\n A few evenings after his dismissal from the church repairs, and before he had obtained any more work to do, he went to attend a meeting of the aforesaid committee. It was late when he arrived: all the others had come, and as he entered they looked dubiously at him, and hardly uttered a word of greeting. He guessed that something bearing on himself had been either discussed or mooted. Some ordinary business was transacted, and it was disclosed that the number of subscriptions had shown a sudden falling off for that quarter. One member--a really well-meaning and upright man-- began speaking in enigmas about certain possible causes: that it behoved them to look well into their constitution; for if the committee were not respected, and had not at least, in their differences, a common standard of CONDUCT, they would bring the institution to the ground. Nothing further was said in Jude\u0027s presence, but he knew what this meant; and turning to the table wrote a note resigning his office there and then.\n Thus the supersensitive couple were more and more impelled to go away. And then bills were sent in, and the question arose, what could Jude do with his great-aunt\u0027s heavy old furniture, if he left the town to travel he knew not whither? This, and the necessity of ready money, compelled him to decide on an auction, much as he would have preferred to keep the venerable goods.\n The day of the sale came on; and Sue for the last time cooked her own, the child\u0027s, and Jude\u0027s breakfast in the little house he had furnished. It chanced to be a wet day; moreover Sue was unwell, and not wishing to desert her poor Jude in such gloomy circumstances, for he was compelled to stay awhile, she acted on the suggestion of the auctioneer\u0027s man, and ensconced herself in an upper room, which could be emptied of its effects, and so kept closed to the bidders. Here Jude discovered her; and with the child, and their few trunks, baskets, and bundles, and two chairs and a table that were not in the sale, the two sat in meditative talk.\n Footsteps began stamping up and down the bare stairs, the comers inspecting the goods, some of which were of so quaint and ancient a make as to acquire an adventitious value as art. Their door was tried once or twice, and to guard themselves against intrusion Jude wrote \"Private\" on a scrap of paper, and stuck it upon the panel.\n They soon found that, instead of the furniture, their own personal histories and past conduct began to be discussed to an unexpected and intolerable extent by the intending bidders. It was not till now that they really discovered what a fools\u0027 paradise of supposed unrecognition they had been living in of late. Sue silently took her companion\u0027s hand, and with eyes on each other they heard these passing remarks-- the quaint and mysterious personality of Father Time being a subject which formed a large ingredient in the hints and innuendoes. At length the auction began in the room below, whence they could hear each familiar article knocked down, the highly prized ones cheaply, the unconsidered at an unexpected price.\n \"People don\u0027t understand us,\" he sighed heavily. \"I am glad we have decided to go.\"\n \"The question is, where to?\"\n \"It ought to be to London. There one can live as one chooses.\"\n \"No--not London, dear! I know it well. We should be unhappy there.\"\n \"Why?\"\n \"Can\u0027t you think?\"\n \"Because Arabella is there?\"\n \"That\u0027s the chief reason.\"\n \"But in the country I shall always be uneasy lest there should be some more of our late experience. And I don\u0027t care to lessen it by explaining, for one thing, all about the boy\u0027s history. To cut him off from his past I have determined to keep silence. I am sickened of ecclesiastical work now; and I shouldn\u0027t like to accept it, if offered me!\"\n \"You ought to have learnt classic. Gothic is barbaric art, after all. Pugin was wrong, and Wren was right. Remember the interior of Christminster Cathedral--almost the first place in which we looked in each other\u0027s faces. Under the picturesqueness of those Norman details one can see the grotesque childishness of uncouth people trying to imitate the vanished Roman forms, remembered by dim tradition only.\"\n \"Yes--you have half-converted me to that view by what you have said before. But one can work, and despise what one does. I must do something, if not church gothic.\"\n \"I wish we could both follow an occupation in which personal circumstances don\u0027t count,\" she said, smiling up wistfully. \"I am as disqualified for teaching as you are for ecclesiastical art. You must fall back upon railway stations, bridges, theatres, music-halls, hotels--everything that has no connection with conduct.\"\n \"I am not skilled in those.... I ought to take to bread-baking. I grew up in the baking business with aunt, you know. But even a baker must be conventional, to get customers.\"\n \"Unless he keeps a cake and gingerbread stall at markets and fairs, where people are gloriously indifferent to everything except the quality of the goods.\"\n Their thoughts were diverted by the voice of the auctioneer: \"Now this antique oak settle--a unique example of old English furniture, worthy the attention of all collectors!\"\n \"That was my great-grandfather\u0027s,\" said Jude. \"I wish we could have kept the poor old thing!\"\n One by one the articles went, and the afternoon passed away. Jude and the other two were getting tired and hungry, but after the conversation they had heard they were shy of going out while the purchasers were in their line of retreat. However, the later lots drew on, and it became necessary to emerge into the rain soon, to take on Sue\u0027s things to their temporary lodging.\n \"Now the next lot: two pairs of pigeons, all alive and plump-- a nice pie for somebody for next Sunday\u0027s dinner!\"\n The impending sale of these birds had been the most trying suspense of the whole afternoon. They were Sue\u0027s pets, and when it was found that they could not possibly be kept, more sadness was caused than by parting from all the furniture. Sue tried to think away her tears as she heard the trifling sum that her dears were deemed to be worth advanced by small stages to the price at which they were finally knocked down. The purchaser was a neighbouring poulterer, and they were unquestionably doomed to die before the next market day.\n Noting her dissembled distress Jude kissed her, and said it was time to go and see if the lodgings were ready. He would go on with the boy, and fetch her soon.\n When she was left alone she waited patiently, but Jude did not come back. At last she started, the coast being clear, and on passing the poulterer\u0027s shop, not far off, she saw her pigeons in a hamper by the door. An emotion at sight of them, assisted by the growing dusk of evening, caused her to act on impulse, and first looking around her quickly, she pulled out the peg which fastened down the cover, and went on. The cover was lifted from within, and the pigeons flew away with a clatter that brought the chagrined poulterer cursing and swearing to the door.\n Sue reached the lodging trembling, and found Jude and the boy making it comfortable for her. \"Do the buyers pay before they bring away the things?\" she asked breathlessly.\n \"Yes, I think. Why?\"\n \"Because, then, I\u0027ve done such a wicked thing!\" And she explained, in bitter contrition.\n \"I shall have to pay the poulterer for them, if he doesn\u0027t catch them,\" said Jude. \"But never mind. Don\u0027t fret about it, dear.\"\n \"It was so foolish of me! Oh why should Nature\u0027s law be mutual butchery!\"\n \"Is it so, Mother?\" asked the boy intently.\n \"Yes!\" said Sue vehemently.\n \"Well, they must take their chance, now, poor things,\" said Jude. \"As soon as the sale-account is wound up, and our bills paid, we go.\"\n \"Where do we go to?\" asked Time, in suspense.\n \"We must sail under sealed orders, that nobody may trace us.... We mustn\u0027t go to Alfredston, or to Melchester, or to Shaston, or to Christminster. Apart from those we may go anywhere.\"\n \"Why mustn\u0027t we go there, Father?\"\n \"Because of a cloud that has gathered over us; though \u0027we have wronged no man, corrupted no man, defrauded no man!\u0027 Though perhaps we have \u0027done that which was right in our own eyes.\u0027\"\n \n 这对情人的生活本来没人注意，但从他们的婚礼中止后，不单阿拉贝拉，而且其他人也开始对他们观察和议论。清泉街的公众和左邻右舍一般不理解，恐怕也无法让他们理解苏和裘德难与外人道的心理、感情、境遇和恐惧。他们的事也着实令人莫名其妙：家里突然来了个孩子，还管裘德叫“爸爸”，管苏叫“妈妈”；他们为图清静省事才上登记处办结婚，可又当场变卦，临时取消。此外在离婚官司中没出庭声辩，也引起流言蜚语。这一切叫头脑简单的人只能有一种解释。\n 时光小老爹（他已正式改名‘嚷德”，但这个恰如其分的外号始终纠缠着他）晚上放学到家之后，就把别的男孩子盯着他问个不了和他们说的难听话，学给他们听。苏非常痛苦和伤心。裘德听着，心情也一样。\n 结果是，这对情人在取消登记处婚礼后没多久，外出了几天（人家认为去了伦敦），雇了个人照应孩子。回来以后他们用一种间接方式使别人了解他们已依法成婚，态度显得无所谓，也不起劲。从前人家称苏为柏瑞和太太，现在苏就公开用福来太太这名字了。有好些天，她样子闷闷不乐、局促不安、无精打采，看来也足以证实确有这回事。\n 不过他们这样行踪诡秘地去办理婚事，在别人眼里实在是个不智之举，因为这一来反而增添了他们的生活的神秘性。他们自己也发现这一着并没收效，不像设想的那样改进他们同邻居的关系。近在眼前的神秘勾起人的兴趣决不亚于已成过去的丑闻。\n 面包房的小把戏和杂货店的小伙计从前送货上门，一见苏，顿时殷勤地举帽行礼，如今也免掉了。住在左右的手艺人的老婆每逢碰上她，就两眼直勾勾朝前看，从人行道走过去，只当没瞧见她。\n 谁也没故意找他们岔子，这也是实情。但是他们的精神世界开始陷入令人窒息的气氛的包围，在他们远路参观展览会之后尤其如此，似乎那次参观使他们有了某种邪恶影响。他们的禀性本来容易在这样气氛中感受伤害，但又不肯直言不讳地表态，以求缓解这种气氛。他们显然也曾打算多方弥缝，无奈为时已晚，难以奏效。\n 凿墓碑、镌墓志的生意日渐其少，两三个月过去，秋天到了，裘德心里很清楚他非再去打零活不可，因为他上年为支付诉讼费不得已而欠下的债务尚未还清，而这时候走这条路无非雪上加霜。\n 有天晚上，他跟平常一样跟苏和孩子一块儿吃饭。“我在考虑，”他对她说，“在这儿是撑不下去了。当然这儿的生活很适合咱们。不过咱们要是离开这儿，换个没人认识的地方，心里头总要舒坦点，机会也多点吧。我看咱们这儿的家非拆了不可，这一来你可就受罪了，可怜的，亲爱的！”\n 苏每逢人家把她形容成叫人怜悯的对象，就倍感刺激，所以她听了很伤心。\n “呃——我没什么难受的。”她立刻说。“这儿的人看我的那个样儿，大叫我气闷啦。再说维持这个家，还有家具，本来为孩子跟我才添这笔开销，你自己根本用不着，都是多余的。可是不管咱们干什么，上哪儿去，你总不会把我跟孩子分开吧，亲爱的裘德？我这会儿可不能放他走呀。孩子稚嫩的心灵上一片乌云，我老替他难受；我真盼着哪天把乌云吹散啊！他又这么恋恋着我。你不会让孩子跟我分开吧？”\n “我当然不会，亲爱的小姑娘。不管咱们到哪儿，咱们都要搞个像样的地方住。我大概得到处奔波了——今天这儿干干，明天那儿干干。”\n “我也得做点事，当然要到——到……呃，现在描字的事，我还插不上手，别的事占着手，不忙又不行。”\n “你先别急着找事。”他带着歉意说。“我不想让你于那个活儿。我希望你别干，苏。你把孩子跟自个儿照料好就够你忙啦。”\n 这时听见有人敲门，裘德出来应付。苏听得到他们的谈话。\n “福来先生在家吗？……拜·威营造厂最近正修一个小教堂，就在离这儿不远的乡下，他们打发我来问问，你还能接那儿重描《十诫》的活儿。”\n 裘德考虑了一下，说他可以接。\n “这活儿也用不着多高的手艺。”捎信的人说。“牧师是个顶拘礼的老派，他只要把教堂洗洗刷刷，修修补补，别的全不许干。”\n “这老头真是个大好人。”苏自言自语，她对整修教堂过事雕琢的种种可怕结果一向抱有反感。\n “十诫文就装在东厢上，”来人接着说，“他们想把它放在墙上跟别的东西一块儿施工，按这行老规矩，拆下来的旧东西都归营造商收去，可牧师怎么也不干，不准他们下掉运走，也就只好这么办了。”\n 他们把干活条件敲定后，裘德又回到屋里。“哪，你瞧。”他乐滋滋地说。“天无绝人之路，还是有活儿可干，你也能帮一手了——起码可以试试。等别的修缮活儿一了，教堂就全归咱们一家包啦。”\n 第二天裘德前往不过两英里外的教堂，他看了看，营造厂职员所言果然不虚。犹太法律凛凛然俯临有基督教典雅格调的圣器，是圣坛末端的主要装饰，属于上世纪那种工艺精良而缺乏生气的风格。又因它们的整体边框是用装饰性石膏做成，所以不好取下来修理，其中一部分已因受潮而发泡开裂，需要完全更换；等这个活儿于完了，全部边框也清洗干净，他这才开始把字重描。第二天上午苏来看看她能帮什么忙，不过她来了也是因为他们老喜欢呆在一块儿。\n 教堂里不闻人声，不见人影，她心里很踏实。裘德原来搭好一个比较矮点的脚手架，挺安全的，不过她一往架子上爬，还是有点胆怯。她开始给第一块字版上色，裘德就着手修补第二块字版的另一部分；从前她给基督堂教会圣物店画经文插图时就学会了这类技巧。这时候看来不大可能有人来打扰他们。众鸟欢悦的啁啾和十月叶丛的窸窣从打开的窗户飘进来，同他们的谈话交织在一起。\n 殊不知他们感受到的宁静畅适却好景不长。大概十二点半光景，外面石子路上有了脚步声，年事已高的教区长和教堂管事进来了，他们要看看现在干什么，没想到瞧见个年轻女人在帮活，好像吃了一惊。他们又往前走，进了座位中间的走道，门这时又打开了，闪进个一个人——小小的身形，原来是小时光，哭哭啼啼的。苏已经跟他说了，他中午课间要找她，就到什么地方。她从架子上下来，问他，“什么事呀，我的宝贝儿？”\n “我没法在学校里头吃饭啦，因为他们说——”他就把几个孩子怎么臭他、说他妈是叫着玩儿的，不是真的，一五一十说了一遍。苏听了很难过，就向高处的裘德表示非常气愤。孩子到教堂墓地去了，她又上去干活儿。门这时再次打开，进来了一个系着白围裙的女人，是打扫教堂的，满脸正经的样子。苏认得她，这女人在清泉街有朋友，苏也曾去看望过她们。这打扫教堂的女人一看见苏，就一发愣，手抬抬，没错儿，她认出来裘德这个同伴，就像苏也认出她来。接着来了两位女士，她们跟打扫女工说了几句话，朝前走来，上上下下、仔仔细细打量靠在白墙上撑着身子的苏。后来她让她们看得紧张得不得了，明显地发起抖来。\n 她们又回身走到前面来的人站的地方，压着嗓门说话，一个说——苏听不出来是哪个——“她是他老婆吧，我想？”\n “有人说是，有人说不是。”这是女杂工在答腔。\n “不是？不是还行吗？要不然就是别人的——这一清二楚嘛！”\n “是也好，不是也好，他们反正结婚才几个礼拜。”\n “这么不明不白的一对，居然涂十诫！我就不懂拜·威厂怎么想得起来用这样的人！”\n 教堂管事表示拜尔和威利斯厂子没听到不对的地方，接着那个跟老太婆说话的女人解释了一下她管他们叫不明不白的人是什么意思。\n 他们先是压着嗓子嘀嘀咕咕，勉强听得出来，后来教堂管事猛孤了地讲起一桩奇怪的传说，嗓门大得教堂里头的人都听得清清楚楚，显而易见是由眼前这个情景引出来的。“我爷爷当年给我讲过一个奇怪的故事，真是邪恶到顶啦，这会儿听起来还叫人莫名其妙呢。这事就出在该密得近边上教堂给十诫上色的时候。那年头，十诫差不多都是黑底描金，我说的那个地方也这样，当时老教堂还没拆了重造。大概一百年前不定哪天吧，他们想把十诫好好修修，跟咱们这会儿一样，这件事他们得上奥尔布里肯找人于。他们很想在预定好的礼拜天之前能完工，做工的也只好捺住性子在礼拜六于到三更半夜，那会儿跟现在不一样，加班不加钱。那年头哪儿有什么真正信教的人哪，不管是乡下牧师、管事，还是老百姓全一样。过了晌午，教区长要叫他们于下去，就得让他们喝个够。天快黑了，他们自个儿又想法子弄了些酒来；没说的，全是兰姆酒。天越来越晚了，他们也醉得越来越厉害了，到后来索性连酒瓶带杯子一齐放到圣餐台上，搬过来一两条板凳，舒舒服服地围台子一坐，一大缸一大缸地开怀畅饮。把杯子里的酒喝光了，个个都倒下来了，人事不知啦，传说就是这样。究竟他们人事不知有多大工夫，他们自个儿一点儿不知道。不过他们全醒过来的时候，正是疾风暴雨，电闪雷鸣，在昏天黑地里好像看见个黑不唧的人形，腿细得很，脚也怪特别的，站在梯子上，替他们赶活儿。等天亮了，他们一瞧，果然活干完了，可他们根本想不起来是自个儿把活儿干完了的。然后他们就回家了，以后就听说那个晚上教堂里出了个骇人听闻的怪事儿，原来礼拜天早上，大伙儿到了教堂，也开始做礼拜了，忽然间瞧见上好色的十诫上边的“不”字全漏下了。正派人好久好久没去做礼拜，没办法，只好把主教请来，再为教堂向上天祈祷一回。我孩子时候常听说这个传说。实不实，你们自个儿想就是啦，不过就是这会儿的光景，把我给提醒啦。”\n 来人又对他们俩瞄了一眼，仿佛要看看裘德和苏是不是也照样把“不”字抹掉。他们一个接一个离开了教堂，后来连老女人也走了。裘德和苏原来没有把活儿停下来，现在就把孩子打发回学校，两个人始终没说一句话；等等他仔细一瞧她，才发现她没出声地哭着。\n “别管它吧，同志！”他说。“我看才不值得管它呢。”\n “他们，个个都是，因为人家想按自己的方式生活，就把人家糟蹋得一塌糊涂，我真受不了啊！就这样嚼舌根，难怪逼得心地高尚的人走投无路，结果就堕落下去，这真是一点不假啊。”\n “你千万别为这个泄气，这只算是个笑话！”\n “这可是对着咱们说的呀！裘德，我想我来了，帮了个倒忙，倒叫你受屈啦！”\n 要是按他们的处境来认真一想，他们惹得别人讲那样的故事，当然不是滋味。不过几分钟以后，苏似乎明白过来这个上午的情况确有其滑稽的一面，也就擦了擦眼睛，破涕为笑了。\n “芸芸众生，偏偏咱们这两个经历这么奇特，凑巧又上这儿来给十诫上色，也真可谓滑天下之稽啦！你让上帝抛弃了，我呢，按我的情形……哦，亲爱的！”她用手捂起眼睛，又没出声笑着，笑笑停停，直到笑累了才停下来。\n “这不就说对了嘛。”裘德开心地说。“咱们这会儿还不是恢复了原状吗，小姑娘！”\n “哦，不过到底挺严重啊！”她叹口气，同时拿起刷子，站稳了。“难道你还没明白，他们不承认咱们结了婚？他们决不肯相信！这太离谱啦！”\n “他们怎么想，我才不在乎。”裘德说。“我犯不上叫他们信。”\n 他们坐下来吃午饭（这是他们带来的，好多挤点干活时间）；吃完了，刚要动手干，突然有个人进堂，裘德一眼就认出来，是营造商威利斯。他招招手叫裘德过来，要跟他说话。\n “这么回事——人家对你干这活儿有意见，我刚听说的。”他说，有点上气不接下气。“我可不想搅到这里头——因为我实在不晓得怎么搞的，不过我恐怕得请你跟她别往下干了，叫别人干完吧！这样顶好，省得生阔气。我照样给你一个礼拜工钱。”\n 裘德这人赋性高傲，决不肯为这点事吵吵闹闹；营造商给了钱，就走了。裘德把工具收抬好，苏洗干净自己的刷子。接着两个人面面相觑。\n “咱们头脑太简单啦，居然想可以接下来这个活儿！”她说，声调里又带着伤感。“咱们确实不应该——我确实不应该到这儿来。”\n “我真是一点没想到，这么个偏僻地方，居然还有人闯进来瞧咱们！”裘德接过话碴说。“事到如今，无法可想喽，亲爱的；我当然决不想赖着不走，把威利斯做成的生意砸了。”他们又勉强坐了几分钟，就走出教堂，为了追上孩子，一路上心事重重直奔奥尔布里肯。\n 福来始终不能忘情于教育事业，凡他力所能及者，他必定略尽绵薄之力，积极推动“机会均等”的实现。按他个人遭际来说，这也很自然。他大概一到奥尔布里肯，就参加了该市才建立的“工匠共进会”，会员都是青年，什么信仰、宗派的都有，包括国教派、公理教会派。浸礼派、一神派、实证派等等，以及当时还不大听说的不可知派。他们具有开扩心智的共同愿望，因而组成了这个联系十分密切的团体，会费很少，集会地点朴实，气氛亲切。裘德的活动能力、他的非同小可的学识，尤其是他在读什么书和怎样读书方面特有的直觉——是他多年同厄运斗争磨砺而成的——使他得以入选该会的委员会。\n 承接教堂修复工程的营造商把他解雇以后，又过了几个晚上，他一时还没找到别的活儿，有一次去参加上面说的委员会的会议。他到会为时已迟，其他人都先他而到，大家用疑虑的眼光望着他，也没人对他招呼。他心里琢磨总是讨论过或是争论过什么有关他的事。他们先处理好日常事务，随后言语之间流露出来这个季度交会费的会员人数突然下降了。一位委员（其人确实与人为善、本性正直）开始故弄玄虚地谈了几个可能的原因：他们理应好好审查一下该会章程；因为如果委员会得不到会员尊重，如果委员之间有分歧，又没有一项起码的共同信守的行为准则，长此下去，他们非把团体搞垮了不可。由于裘德在场，他们也没拿话旁敲侧击，但是他们话里有话，他心中有数，二话没说，走到桌子那儿，写了个条子，表示立即辞去委员职务。\n 至此这对特为敏感的夫妇，被人一步步逼得只好离开这个地方。跟着账单也送上门来了，同时还发生个问题，就是如果裘德要离开这个地方，又不知此后人去何方，他该怎么处理姑婆那些又旧又笨重的家具？这件事，加上他手里得有现款才行，迫使他决定搞一次拍卖，虽然他本心想把那些古老庄严的东西保存下来。\n 拍卖的日子到了；苏最后一次在裘德装修布置的小房子里给自己，给孩子，给裘德做早饭。没想到这天偏巧下雨；苏也感到不适；她不想把她的可怜的裘德一个人丢在那个乌烟瘴气的场合，因为他是迫不得已只好在那儿呆段时间，于是她自告奋勇，向拍卖行的人提出来，楼上有间屋子，她自己要歇在里头，东西可以出清，关上门就可以挡住参加拍卖的人了。裘德在那儿找到她，跟孩子在一块儿，还有不多几个箱子、篮子和几捆东西，再就是不打算卖的两把椅子、一张桌子，两人就坐在椅上说话，心事重重。\n 人们开始踩着很重的步子，在光板楼梯上上下下，把拍卖的东西左看右看，其中一些形制古雅，颇具艺术价值。他们这间屋子的门，也让人推了一两回，裘德怕人随便往里闯，就在纸上写了“私寓”字样，贴在门上。\n 他们很快就发现买主居然肆无忌惮地议论开他们俩的经历和从前的行为，真是叫人再也料不到。他们这才真正明白，一段时间以来，他们是如何自以为别人对他们一无所知，而身处极乐世界之中。苏一言不发，拉着她的同伴的手，四目相视，听着他们东拉西扯——在那些含沙射影、无中生有的扯谈中，时光老爹的奇特而神秘的身世成了他们颇占分量的话题。拍卖总算在楼下屋里开场了，他们听得见自己用惯的家具一件件成交的过程，他们素常心爱的东西卖得很便宜，而平时不起眼的东西卖的价钱之高倒想不到。\n “别人不理解咱们啊。”他深深地叹了口气。“咱们总算是决定走了，我还是很高兴的。”\n “问题是，上哪儿去呢？”\n “还是上伦敦吧。住在那个地方，你怎么生活都行，随你的便。”\n “不行——不能上伦敦，亲爱的！这我心里有数。咱们到那儿，一定不舒心。”\n “为什么？”\n “难道你不明白？”\n “因为阿拉贝拉在那儿？”\n “这是主要原因。”\n “可是住在乡下，我会一直心神不定，怕再碰上新近这样的事。再说我也不想为了咱们少烦恼点，就把孩子的身世一古脑亮出来。我现在下了决心，从今以后一个字儿不提，让他跟过去一刀两断。替教会干活儿，我也腻透啦，就是有人来找，我也不想再接。”\n “你原先本该学学古典建筑。哥特式艺术毕竟是粗野的。蒲京是错误的，伦恩是正确的。别忘了基督堂的大教堂内部装饰——那儿可以说是头一回你看见我，我看见你的地方。那些诺曼式细部固然形象如画，可你一经寓目，就看出来全是些不学无术之辈刻意模仿已经湮没了的罗马形式，弄出来的不伦不类的小儿手笔，其实那种形式不过是靠似是而非的传说流传下来而已。”\n “对啊——我听了你从前跟我说的那些话，叫我早已有一半改过来啦，信从了你的观点。可人不干活怎么行呢，那就顾不得干什么啦。就算不干哥特式教堂的活儿，我总得干点别的活儿呀。”\n “我倒是想咱们俩都干一行，跟个人的原来的境遇不沾边。”她说，带着渴望的神情，微笑着。“你在宗教艺术方面不合格，我也一样，在教学方面不合格。你不妨退一步，干干整修火车站呀、桥梁呀。戏院呀、音乐厅呀、饭店呀——凡是跟行为没一点关系的都行。”\n “这些玩意儿，我并不在行。……我倒可以做做面包，挺合适的。我是跟姑婆做面包生意长大的，这你知道。不过就连个面包师傅想招来主顾，也得顺着风俗转，合群才行。”\n “要不然，就上庙会集市摆个摊子卖蛋糕和姜汁饼好啦，那儿人家只问做得怎么样，此外大咧咧地什么也不往心里去。”\n 他们的思想叫拍卖经纪人的声音打断了，“现在是一件老古董，橡木高背靠椅——老式英国家具独一无二的典型，够得上所有收藏家刮目相看哪。”\n “这是我祖爷爷的。”裘德说。“我真想咱们能把这件可怜的老东西留在手里！”\n 一件又一件，家具都出手了，下午已经过去了。裘德和苏跟孩子又累又饿，但是他们听过别人议论之后，在买家具的人陆续退场之际，不好意思走出屋于。可还剩几件在喊价，他们非露面不可了，哪怕冒着雨，也得把苏的东西送往他们的临时住处。\n “现在是下一件：一对鸽子，全是欢蹦乱跳，肥肥壮壮——下礼拜天拿它们做正餐上的馅饼，刮刮叫的美味佳肴。”\n 逼在眼前的卖鸽子这一幕成了整个下午最折磨人的揪心事儿。鸽子乃是苏的心爱之物，眼看着再也无法把它们留在手里，他们的痛苦要比同所有家具分离时还厉害。苏一边看着她的宝贝从预定的微不足道的起价一步步升到最后的卖价，一边极力想把思想岔开，忍住眼泪。买鸽子的是邻近一个家禽贩于，毫无疑问，它们注定要在下个集市前一命呜呼。\n 裘德见她强抑痛苦，故作无事，不禁吻了她。跟她说，他该去看看住处是否安排妥当，要先把孩子带过去，再回来接她。\n 她一个人留下来，耐着性子等，但裘德一时没回来。于是她也起身走了，真是天赐良机，因为正当她路过不远处的家禽店时，瞧见自己鸽子装在店门边一只大筐里。目击故物，她一阵激动，又值天渐昏暗，一冲动，竞不顾一切，采取行动，先赶快往四下一看，跟着把插紧筐盖的小木签拔掉，往前就走。盖子给打里边顶起来了，扑喇喇，鸽子一飞冲天，家禽贩子一看，气得在门口指天划地，咒骂不休。\n 到了住处，苏浑身哆嗦，看到裘德跟孩子还在替她准备，好让她舒舒服服的。“买主拿走东西之前，是不是先付了钱？”她气喘不过来地问。\n “当然，我想是这样吧，问这个干吗？”\n “因为，这么一说，我干了坑人的事啦！”接着她说了事情经过，痛悔不已。\n “要是贩子没把鸽子逮回来，我一定照价赔他。”裘德说。“不过别想啦。亲爱的，别为这个苦恼吧。”\n “我真是太糊涂啦！哦，自然的法则干吗一定要自相残杀呀！”\n “是这回事儿吗？”孩子关切地问。\n “就是这回事儿！”苏狠狠地说。\n “好啦，这会儿它们该利用这个机会啦，可怜的东西。”裘德说。“拍卖家具的账一算清，再把欠账一还，咱们就马上走人。”\n “咱们＿上哪儿呀？”时光不放心地问。\n “咱们一路都得背着人走，那谁也没法踩着咱们的脚印。咱们决不能上阿尔夫瑞顿，也决不能上麦尔切斯特、沙氏顿、基督堂。除了这几个地方，哪儿都行。”\n “咱们干吗不上那几个地方，爸？”\n “因为咱们是乌云压顶啊，虽说咱们‘未曾亏负谁，未曾败坏谁，未曾占谁的便宜。’不过咱们也许已经按‘各人任意而行’过啦。”\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/292/7819.html","bookId":190,"book":{"id":190,"title":"无名的裘德 Jude the Obscure","description":"简介： Jude the Obscure, the last of Thomas Hardy\u0027s novels, began as a magazine serial and was first published in book form in 1895. The book was burned publicly by William Walsham How, Bishop of Wakefield, in that same year. Its hero, Jude Fawley...","cover":"http://novel.tingroom.com/uploads/110425/1-110425151Z1A7.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/292","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
