{"id":37723,"no":5,"title":"AUT C SAR AUT NIHIL.","content":"There is a sentence in one of Miss Mitford’s earliest and most charming papers, “The Cowslip Ball,” which has always delighted me by its quiet satire and admirable good-temper. She is describing her repeated efforts and her repeated failures to tie the fragrant clusters together. “We went on very prosperously, considering, as people say of a young lady’s drawing, or a Frenchman’s English, or a woman’s tragedy, or of the poor little dwarf who works without fingers, or the ingenious sailor who writes with his toes, or generally of any performance which is accomplished by means seemingly inadequate to its production.” Here is precisely the sentiment which Dr. Johnson embodied, more trenchantly, in his famous criticism of female preaching. “Sir, a woman’s preaching is like a dog walking on its hind legs. It is not done well, but you are surprised to find it done at all.” It is a senti{61}ment which, in one form or another, prevailed throughout the last century, and lapped over into the middle of our own. Miss Mitford is merely echoing, with cheerful humor, the opinions of the very clever and distinguished men whom it was her good fortune to know, and who were all the more generous to her and to her sister toilers, because it did not occur to them for a moment that women claimed, or were ever going to claim, a serious place by their sides. There is nothing clearer, in reading the courteous and often flattering estimate of woman’s work which the critics of fifty years ago delighted in giving to the world, than the under-current of amusement that such things should be going on. Christopher North, who has only censure and contempt for the really great poets of his day, is pleased to lavish kind words on Mrs. Hemans and Joanna Baillie, praising them as adults occasionally praise clever and good children. That, neither he nor his boon companions of the “Noctes” are disposed to take the matter seriously, is sufficiently proved by North’s gallant but controvertible statement that all female poets are handsome. “No truly ugly{62} woman ever yet wrote a truly beautiful poem the length of her little finger.” The same satiric enjoyment of the situation is apparent in Thackeray’s description of Barnes Newcome’s lecture on “Mrs. Hemans, and the Poetry of the Affections,” as delivered before the appreciative audience of the Newcome Athen?um. The distinction which the lecturer draws between man’s poetry and woman’s poetry, the high-flown civility with which he treats the latter, the platitudes about the Christian singer appealing to the affections, and decorating the homely threshold, and wreathing flowers around the domestic hearth;—all these graceful and generous nothings are the tributes laid without stint at the feet of that fragile creature known to our great-grandfathers as the female muse. It may as well be admitted at once that this tone of combined diversion and patronage has changed. Men, having come in the course of years to understand that women desire to work, and need to work, honestly and well, have made room for them with simple sincerity, and stand ready to compete with them for the coveted prizes of life. This is all that can in fair{63}ness be demanded; and, if we are not equipped for the struggle, we must expect to be beaten, until we are taught, as Napoleon taught the Allies, how to fight. We gain nothing by doing for ourselves what man has ceased to do for us,—setting up little standards of our own, and rapturously applauding one another when the easy goal is reached. We gain nothing by withdrawing ourselves from the keenest competition, because we know we shall be outdone. We gain nothing by posing as “women workers,” instead of simply “workers;” or by separating our productions, good or bad, from the productions, good or bad, of men. As for exacting any special consideration on the score of sex, that is not merely an admission of failure in the present, but of hopelessness for the future. If we are ever to accomplish anything admirable, it must be by a frank admission of severe tests. There is no royal road for woman’s feet to follow. As we stand now, our greatest temptation to mediocrity lies in our misleading content; and this content is fostered by our incorrigible habit of considering ourselves a little aside from the grand march of human events. Why{64} should a new magazine be entitled “Woman’s Progress,” as if the progress of woman were one thing, and the progress of man another? If we are two friendly sexes working hand in hand, how is it possible for either to progress alone? Why should I be asked to take part in a very animated discussion on “What constitutes the success of woman?” Woman succeeds just as man succeeds, through force of character. She has no minor tests, or, if she has, they are worthless. Above all, why should we have repeated the pitiful mistake of putting woman’s work apart at the World’s Fair, as though its interest lay in its makers rather than in itself. Philadelphia did this seventeen years ago, but in seventeen years women should have better learned their own worth. Miss Mitford’s sentence, with its italicized “considering,” might have been written around the main gallery of the Woman’s Building, instead of that curious jumble of female names with its extraordinary suggestion of perspective,—Mme. de Sta?l and Mrs. Potter Palmer, Pocahontas and Mrs. Julia Ward Howe. The erection of such a building was a tacit acknowledgment of inferior standards, and{65} therein lies our danger. All that was good and valuable beneath its roof should have been placed elsewhere, standing side by side with the similar work of men. All that was unworthy of such competition should have been excluded, as beneath our dignity, as well as beneath the dignity of the Exposition. Patchwork quilts in fifteen thousand pieces, paper flowers, nicely stitched aprons, and badly painted little memorandum-books do not properly represent the attitude of the ability of women. We are not begging for consideration and applause; we are striving to do our share of the world’s work, and to do it as well as men. Shall we ever succeed? It is not worth while to ask ourselves a question which none can answer. Reasoning by analogy, we never shall. Hoping in the splendid possibilities of an unknown future, we may. But idle contention over what has been done already is not precisely the best method of advance. To wrangle for months over the simple and obvious statement that there have been no great women poets, is a lamentable waste of energy, and leads to no lasting good. To examine{66} with fervent self-consciousness the exact result of every little step we take, the precise attitude of the world toward us, while we take it, is a retarding and unwholesome process. Why should an indefatigable philanthropist, like Miss Frances Power Cobbe, have paused in her noble labor to write such a fretful sentence as this? “It is a difficult thing to keep in mind the true dignity of womanhood, in face of the deep, underlying contempt wherewith all but the most generous of men regard us.” Perhaps they do, though the revelation is a startling one, and the last thing we had ever suspected. Nevertheless, the sincere and single-minded worker is not asking herself anxious questions anent man’s contempt, but is preserving “the true dignity of womanhood” by going steadfastly on her appointed road, and doing her daily work as well as in her lies. Neither does she consider the conversion of man to a less scornful frame of mind as the just reward of her labors. She has other and broader interests at stake. For my own part, I have a liking for those few writers who are admirably explicit in their contempt for wo{67}men, and I find them more interesting and more stimulating than the “generous” men who stand forth as the champions of our sex, and are insufferably patronizing in their championship. When Schopenhauer says distinctly that women are merely grown-up babies, short-sighted, frivolous, and occupying an intermediate stage between children and men; when he protests vigorously against the absurd social laws which permit them to share the rank and titles of their husbands, and insists that all they require is to be well fed and clothed, I feel a sincere respect for this honest statement of unpopular and somewhat antiquated views. Lord Byron, it will be remembered, professed the same opinions, but his ingenuousness is by no means so apparent. Edward Fitzgerald’s distaste for women writers is almost winning in its gentle candor. Ruskin, despite his passionate chivalry, reiterates with tireless persistence his belief that woman is man’s helpmate, and no more. Theoretically, he is persuasive and convincing. Practically, he is untouched by the obtrusive fact that many thousands of women are never called on to be the helpmates of any men, fathers,{68} brothers, or husbands, but must stand or fall alone. Upon their learning to stand depends much of the material comfort, as well as the finer morality, of the future. And surely, the first and most needful lesson for them to acquire is to take themselves and their work with simplicity, to be a little less self-conscious, and a little more sincere. In all walks of life, in all kinds of labor, this is the beginning of excellence, and proficiency follows in its wake. We talk so much about thoroughness of training, and so little about singleness of purpose. We give to every girl in our public schools the arithmetical knowledge which enables her to stand behind a counter and cast up her accounts. That there is something else which we do not give her is sufficiently proven by her immediate adoption of that dismal word, “saleslady,” with its pitiful assumption of what is not, its pitiful disregard of dignity and worth. I own I am dispirited when I watch the more ambitious girls who attend our great schools of manual training and industrial art. They are being taught on generous and noble lines. The elements of beauty and appropriateness enter into their{69} hourly work. And yet—their tawdry finery, the nodding flower-gardens on their hats, the gilt ornaments in their hair, the soiled kid gloves too tight for their broad young hands, the crude colors they combine so pitilessly in their attire, their sweeping and bedraggled skirts, their shrill, unmodulated voices, their giggles and ill-controlled restlessness—are these the outward and visible results of a training avowedly refining and artistic? Are these the pupils whose future work is to raise the standard of beauty and harmonious development? Something is surely lacking which no technical skill can supply. Now, as in the past, character is the base upon which all true advancement rests secure. Higher in the social and intellectual scale, and infinitely more serious in their ambitions, are the girl students of our various colleges. As their numbers increase, and their superior training becomes less and less a matter of theory, and more and more a matter of course, these students will combine at least a portion of their present earnestness with the healthy commonplace rationality of college men. At present they are laboring under the disadvan{70}tage of being the exceptions instead of the rule. The novelty of their position dazes them a little; and, like the realistic story-tellers and the impressionist painters, they are perhaps more occupied with their points of view than with the things they are viewing. This is not incompatible with a very winning simplicity of demeanor, and the common jest which represents the college girl as prickly with the asperities of knowledge, is a fabric of man’s jocund and inexhaustible imagination. Mr. Barrie, it is true, tells a very amusing story of being invited, as a mere lad, to meet some young women students at an Edinburgh party, and of being frightened out of his scanty self-possession when one of them asked him severely whether he did not consider that Berkeley’s immaterialism was founded on an ontological misconception. But even Mr. Barrie has a fertile fancy, and perhaps the experience was not quite so bad as it sounds. There is more reason in the complaint I have heard many times from mothers, that college gives their daughters a distaste for social life, and a rather ungracious disregard for its amenities and obligations.{71} But college does not give men a distaste for social life. On the contrary, it is the best possible training for that bigger, broader field in which the ceaseless contact with their fellow-creatures rounds and perfects the many-sidedness of manhood. If college girls are disposed to overestimate the importance of lectures, and to underestimate the importance of balls, this is merely a transient phase of criticism, and has no lasting significance. Lectures and balls are both very old. They have played their parts in the history of the world for some thousands of years; they will go on playing them to the end. Let us not exaggerate personal preference, however contagious it may appear, into a symbol of approaching revolution. For our great hope is this: As university training becomes less and less exceptional for girls, they will insensibly acquire broader and simpler views; they will easily understand that life is too big a thing to be judged by college codes. As the number of women doctors and women architects increases with every year, they will take themselves, and be taken by the world, with more simplicity and candor.{72} They will also do much better work when we have ceased writing papers, and making speeches, to signify our wonder and delight that they should be able to work at all; when we have ceased patting and praising them as so many infant prodigies. Perhaps the time may even come when women, mixing freely in political life, will abandon that injured and aggressive air which distinguishes the present advocate of female suffrage. Perhaps, oh, joyous thought! the hour may arrive when women having learned a few elementary facts of physiology, will not deem it an imperative duty to embody them at once in an unwholesome novel. These unrestrained disclosures which are thrust upon us with such curious zest, are the ominous fruits of a crude and hasty mental development; but there are some sins which even ignorance can only partially excuse. Things seen in the light of ampler knowledge have a different aspect, and bear a different significance; but the “fine and delicate moderation” which Mme. de Souza declared to be woman’s natural gift, should preserve her, even when semi-instructed, from all gross offences against good taste. More{73}over “whatever emancipates our minds without giving us the mastery of ourselves is destructive,” and if the intellectual freedom of woman is to be a noble freedom it must not degenerate into the privilege of thinking whatever she likes, and saying whatever she pleases. That instinctive refinement which she has acquired in centuries of self-repression is not a quality to be undervalued, or lightly thrust aside. If she loses “the strength that lies in delicacy,” she is weaker in her social emancipation than in her social bondage. The word “Virago,” in the Renaissance, meant a woman of culture, character, and charm; a “man-like maiden” who combined the finer qualities of both sexes. The gradual debasement of a word into a term of reproach is sometimes a species of scandal. It is wilfully perverted in the course of years, and made to tell a different tale,—a false tale, probably,—which generations receive as true. On the other hand, it sometimes marks the swift degeneracy of a lofty ideal. In either case, the shame and pity are the same. Happily, as we are past the day when men looked askance upon women’s sincere efforts at ad{74}vancement, so we are past the day when women deemed it profitable to ape distinctly masculine traits. We have outgrown the first rude period of abortive and misdirected energy, but it does not follow that the millennium has been reached. Mr. Arnold has ventured to say that the best spiritual fruit of culture is to keep man from a self-satisfaction which is retarding and vulgarizing, yet no one recognized more clearly than he the ungracious nature of the task. What people really like to be told is that they are doing all things well, and have nothing to learn from anybody. This is the reiterated message from the gods of which the daily press delivers itself so sapiently, and by which it maintains its popularity and power. This is the tone of all the nice little papers about woman’s progress, and woman’s work, and woman’s influence, and woman’s recent successes in literature, science, and art. “I gain nothing by being with such as myself,” sighed Charles Lamb, with noble discontent. “We encourage one another in mediocrity.” This is what we women are doing with such apparent satisfaction; we are encouraging one another in mediocrity. We{75} are putting up easy standards of our own, in place of the best standards of men. We are sating our vanity with small and ignoble triumphs, instead of struggling on, defeated, routed, but unconquered still, with hopes high set upon the dazzling mountain-tops which we may never reach. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2936/80635.html","bookId":1093,"book":{"id":1093,"title":"In the Dozy Hours and other papers","description":"简介： Montaigne and Howells letters, says Thackeray, are my bedside books. If I wake at night, I have one or other of them to prattle me to sleep again. They talk about themselves forever, and dont weary me. I like to hear them tell their old stories over...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2936","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
