{"id":37727,"no":9,"title":"THE DISCOMFORTS OF LUXURY: A SPECULATION.","content":"Mr. Frederick Harrison, in a caustic little paper on the ?sthete, has taken occasion to say some severely truthful things anent the dreary grandeur of rich men’s houses, where each individual object is charming in itself, and out of harmony with all the rest. “I believe,” he observes sadly, “that the camel will have passed through the eye of the needle before the rich man shall have found his way to enter the Kingdom of Beauty. It is a hard thing for him to enjoy art at all. The habits of the age convert him into a patron, and the assiduity of the dealers deprive him of peace.” Is it, then, the mere desire to be obliging which induces a millionaire to surround himself with things which he does not want, which nobody else wants, and which are perpetually in the way of comfort and pleasure? Does he build and furnish his house to support the dealers, to dazzle his friends, or to increase his{113} own earthly happiness and well-being? The serious fashion in which he goes to work admits of no backsliding, no merciful deviations from a relentless luxury. I have seen ghastly summer palaces, erected presumably for rest and recreation, where the miserable visitor was conducted from a Japanese room to a Dutch room, and thence to something Early English or Florentine; and such a jumble of costly incongruities, of carved scrolls and blue tiles and bronze screens and stained glass, was actually dubbed a home. A home! The guest, surfeited with an afternoon’s possession, could escape to simpler scenes; but the master of the house was chained to all that tiresome splendor for five months of the year, and the sole compensation he appeared to derive from it was the saturnine delight of pointing out to small processions of captive friends every detail which they would have preferred to overlook. It is a painful thing, at best, to live up to one’s bricabrac, if one has any; but to live up to the bricabrac of many lands and of many centuries is a strain which no wise man would dream of inflicting upon his constitution. Perhaps the most unlovely circumstance{114} about the “palatial residences” of our country is that everything in them appears to have been bought at once. Everything is equally new, and equally innocent of any imprint of the owner’s personality. He has not lived among his possessions long enough to mould them to his own likeness, and very often he has not even selected them himself. I have known whole libraries purchased in a week, and placed en masse upon their destined shelves; whole rooms furnished at one fell swoop with all things needful, from the chandelier in the ceiling to the Dresden figures in the cabinet. I have known people who either mistrusted their own tastes, or who had no tastes to mistrust, and so surrendered their houses to upholsterers and decorators, giving them carte blanche to do their best or worst. A room which has been the unresisting prey of an upholsterer is, on the whole, the saddest thing that money ever bought; yet its deplorable completeness calls forth rapturous commendations from those who can understand no natural line of demarcation between a dwelling-place and a shop. The same curious delight in handsome things,{115} apart from any beauty or fitness, has resulted in our over-ornamented Pullman cars, with their cumbrous and stuffy hangings; and in the aggressive luxury of our ocean steamers, where paint and gilding run riot, and every scrap of wall space bears its burden of inappropriate decoration. To those for whom a sea voyage is but a penitential pilgrimage, the fat frescoed Cupids and pink roses of the saloons offer no adequate compensation for their sufferings; whitewash and hangings of sackcloth would harmonize more closely with their sentiments. Yet these ornate embellishments pursue them now even to the solitude of their staterooms, and the newest steamers boast of cabins where the wretched traveler, too ill to arise from his berth, may be solaced by Cupids of his own frisking nakedly over the wash-bowl, and by pink roses in profusion festooning his narrow cell. If he can look at them without loathing, he is to be envied his unequaled serenity of mind. It is strange that the authors who have written so much about luxury, whether they praise it satirically, like Mandeville, or con{116}demn it very seriously, like Mr. Goldwin Smith, or merely inquire into its history and traditions, like that careful scholar, M. Baudrillart, should never have been struck with the amount of discomfort it entails. In modern as in ancient times, the same zealous pursuit of prodigality results in the same heavy burden of undesirable possessions. The youthful daughter of Marie Antoinette was allowed, we are told, four pairs of shoes a week; and M. Taine, inveighing bitterly against the extravagances of the French court, has no word of sympathy to spare for the unfortunate little princess, condemned by this ruthless edict always to wear new shoes. Louis XVI. had thirty doctors of his own; but surely no one will be found to envy him this royal superfluity. He also had a hundred and fifty pages, who were probably a terrible nuisance; and two chair-carriers, who were paid twenty thousand livres a year to inspect his Majesty’s chairs, which duty they solemnly performed twice a day, whether they were wanted or not. The Cardinal de Rohan had all his kitchen utensils of solid silver, which must have given as much satis{117}faction to his cooks as did Nero’s golden fishing-hooks to the fish he caught with them. M. Baudrillart describes the feasts of Elagabalus as if their only fault was their excess; but the impartial reader, scanning each unpalatable detail, comes to a different conclusion. Thrushes’ brains, and parrots’ heads, peas mashed with grains of gold, beans fricasseed with morsels of amber, and rice mixed with pearls do not tempt one’s fancy as either nourishing or appetizing diet; while the crowning point of discomfort was reached when revolving roofs threw down upon the guests such vast quantities of roses that they were well-nigh smothered. Better a dish of herbs, indeed, than all this dubious splendor. Nothing less enjoyable could have been invented in the interests of hospitality, save only that mysterious banquet given by Solomon the mighty, where all the beasts of the earth and all the demons of the air were summoned by his resistless talisman to do honor to the terrified and miserable banqueters. “Le Superflu, chose très-nécessaire,” to quote Voltaire’s delightful phrase, is a diffi{118}cult thing to handle with propriety and grace. Where the advantages of early training and inherited habits of indulgence are lacking, men who endeavor to spend a great deal of money show a pitiful incapacity for the task. They spend it, to be sure, but only in augmenting their own and their neighbors’ discomfort; and even this they do in a blundering, unimaginative fashion, almost painful to contemplate. The history of Law’s Bubble, with its long train of fabulous and fleeting fortunes, illustrates the helplessness of men to cope with suddenly acquired wealth. The Parisian nabob who warmed up a ragout with burning bank notes, that he might boast of how much it cost him, was sadly stupid for a Frenchman; but he was kinder to himself, after all, than the house-painter who, bewildered with the wealth of Fortunatus, could think of nothing better to do with it than to hire ninety supercilious domestics for his own misusage and oppression. Since the days of Darius, who required thirty attendants to make his royal bed, there probably never were people more hopelessly in one another’s way than that little army of ninety servants await{119}ing orders from an artisan. The only creature capable of reveling in such an establishment was the author of “Coningsby” and “Lothair,” to whom long rows of powdered footmen, “glowing in crimson liveries,” were a spectacle as exhilarating as is a troop of Horse Guards to persons of a more martial cast of mind. Readers of “Lothair” will remember the home-coming of that young gentleman to Muriel Towers, where the house steward, and the chief butler, and the head gardener, and the lord of the kitchen, and the head forester, and the grooms of the stud and of the chambers stand in modest welcome behind the distinguished housekeeper, “who curtsied like the old court;” while the underlings await at a more “respectful distance” the arrival of their youthful master, whose sterling insignificance must have been painfully enhanced by all this solemn anticipation. “Even the mountains fear a rich man,” says that ominous Turkish proverb which breathes the corruption of a nation; but it would have been a chicken-hearted molehill that trembled before such a homunculus as Lothair. The finer adaptability of women makes{120} them a little less uncomfortable amid such oppressive surroundings, and their tamer natures revolt from ridiculous excess. They listen, indeed, with favor to the counsel of Polonius, and their habit is occasionally costlier than their purses can buy; witness that famous milliner’s bill for fifteen thousand pounds, which was disputed in the French courts during the gilded reign of Napoleon III. But, as a rule, the punishment of their extravagances falls on themselves or on their husbands. They do not, as is the fashion with men, make their belongings a burden to their friends. It is seldom the mistress of a curio-laden house who insists with tireless perseverance on your looking at everything she owns; though it was a woman, and a provincial actress at that, raised by two brilliant marriages to the pinnacle of fame and fortune, who came to Abbotsford accompanied by a whole retinue of servants and several private physicians, to the mingled amusement and despair of Sir Walter. And it was a flower girl of Paris who spent her suddenly acquired wealth in the most sumptuous entertainments ever known even to that city of costly caprice. But for stupid and meaningless luxury we must look, after all, to men: to Caligula, whose horse wore a collar of pearls, and drank out of an ivory trough; to Condé, who spent three thousand crowns for jonquils to deck his palace at Chantilly; to the Duke of Albuquerque, who had forty silver ladders among his utterly undesirable possessions. Even in the matter of dress and fashion, they have exceeded the folly of women. It is against the gallants of Spain, and not against their wives, that the good old gossip James Howell inveighs with caustic humor. The Spaniard, it would seem, “tho’ perhaps he had never a shirt to his back, yet must he have a toting huge swelling ruff around his neck,” for the starching of which exquisitely uncomfortable article he paid the then enormous sum of twenty shillings. It was found necessary to issue a royal edict against these preposterous decorations, which grew larger and stiffer every year, even children of tender age wearing their miniature instruments of torture. “Poverty is a most odious calling,” sighs Burton with melancholy candor; but it is not without some small compensations of its own. To realize them, we might compare one of Murillo’s dirty, smiling, half-naked beggar boys with an Infanta by Velasquez, or with Moreelzee’s charming and unhappy little Princess, who, in spreading ruff and stiff pearl-trimmed stomacher, gazes at us with childish dignity from the wall of Amsterdam’s museum. Or we might remember the pretty story of Meyerbeer’s little daughter, who, after watching for a long time the gambols of some ragged children in the street, turned sadly from the window, and said, with pathetic resignation, “It is a great misfortune to have genteel parents.”","sourceLink":"http://novel.tingroom.com/duanpian/2936/80639.html","bookId":1093,"book":{"id":1093,"title":"In the Dozy Hours and other papers","description":"简介： Montaigne and Howells letters, says Thackeray, are my bedside books. If I wake at night, I have one or other of them to prattle me to sleep again. They talk about themselves forever, and dont weary me. I like to hear them tell their old stories over...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2936","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
