{"id":29707,"no":3,"title":"I THE FIRE BEAST","content":"No one among the Cave People knew how to kindle a fire. On several occasions when they found the trees in the forest aflame, Strong Arm had borne back to the Hollow a burning branch. Immediately all the other Cave People were seized with a desire to have torches and they swarmed around the skirts of the blaze and secured boughs also. And on they sped toward home and the Hollow amid roars of laughter and much pride, till the sparks from one of the branches blew into the frowsy hair of the Stumbler and set him aflame. 16Instantly all the Cave People dropped their boughs in terror and the Stumbler beat his head with his hand, uttering shrill cries of pain. Only Strong Arm advanced steadily toward the river, grunting his disgust. “Bah! Bah!” he said many times, spitting the words from his mouth. Strong Arm was the great man of the tribe. No one among the Cave People could jump so far, or lift so large a rock as he. His back was broader than the shoulders of the other men. His head was less flat, and his eyes were very keen and saw many things. When they reached the Hollow, Strong Arm gathered dry leaves and sticks and built a huge bonfire upon the rocks. And the Old Woman and Gray Beard came out of their cave to marvel at his work. The young men brought branches and leaves and fed the flames and when night came on the Cave People sat around the fire and laughed together. For the wolves came out of their holes and showed their white fangs. And their yellow eyes gleamed through the darkness, but they hovered on the edge of the woods, for they were afraid. Far into the night the Cave People danced, while the flames from the fire brightened the whole Hollow. They beat their hands together and chanted in two tones from a minor strain, and not 17till they were worn out with dancing and fuel gathering did they crawl back into their caves. But in the morning the fire was dead. Grey ashes marked the spot of their gaiety and the Cave People were filled with awe and wonder. But they learned many things. The next time Strong Arm brought a blazing bough to the Hollow he discovered that the fire burned best when the branches met the face of the wind, and in time they learned to coax the coals to live through the night by covering them carefully with ashes and damp moss. And at last, by watchful care, the Cave People were able to keep the fire burning constantly. The Cave Women with little children, who were unable to hunt with the men, came in time to be the natural care-takers of the fire. It was the Foolish One who first, in a fit of wantonness, threw a hunk of bear meat upon the coals, and it was Strong Arm, the wise, who fished it out again. For in those days bear meat was not to be had all the time, and Famine followed close upon the heels of Feasting. Often a chunk of bear meat was the most precious thing in the world. Strong Arm ate the steak which he had poked from the coals and he found it delicious. Then he threw more chunks into the fire and gave them to the Cave People. After that every one threw his meat into the flames. By and by they stuck great 18hunks of raw flesh upon long sticks and broiled them over the fire. No longer as darkness crept over the world were the Cave People forced into their Caves for safety. Secure around the fire they danced and chanted rude measures wherein they mocked their enemies, the mountain lion and the grey wolves, who came forth in the night and watched them hungrily from afar. Four times had the nut season come and gone since the birth of little Laughing Boy and he could remember one day only when the fire had not burned upon the rocks in the Hollow. Ever since he had been able to walk he had trotted at his mother’s heels down to the shore, when the air was chill and had squatted very close to the coals, for the warmth was very pleasant to his small body. His mother, Quack Quack, which meant Wild Duck in the language of the Cave People, always screamed shrilly to him and gesticulated wildly, till he crept back out of danger, while she scoured the woods for logs and branches. But there came a day when he crawled down to the river and found no fire on the shore. Then his father, Strong Arm, had gone upon a long journey. Many paths he had crossed on his journey along the bank of the river to a friendly neighboring tribe. And he returned after several suns with the good fire in his hands. 19Since then the Cave People had tended the fire more carefully than ever. Thus Laughing Boy came to know that the fire was a friend, a friend who protected the Cave People from the wild animals of the forest. He knew also that it was very good to feel the warm flames near his brown body when the days were cool, and that it hurt very much if touched with his fingers. Laughing Boy always ran at the side of his mother, Quack Quack, tagging at her heels or hanging on her shoulders. Although a very big boy, as Cave Boys grew, he had never been weaned and always when he grew cold or hungry, he ran to her side and pulled at her breasts, uttering queer little grunts and cries. In the bad season Quack Quack grew very thin as Laughing Boy nursed at her breasts. When he was four years old and the fruit was dead and the nuts and berries were nowhere to be found from the North fork of the river to the bend far below, Quack Quack felt that she could no longer endure but pushed him from her again and again, giving him bits of meat and fish to chew. When once the Cave People had hunted twelve days without bringing home any large game, the eyes of the people grew deep with hunger and their faces were drawn and gaunt. A few fish they caught and again found bitter roots and some scrubby tubers, but these meant only a mouthful 20to the Cave People when they could, one and all, have devoured great hunks of meat. Strong Arm sat on the bank of the river one whole day, but the storms had driven the fish up stream and he caught only two small ones that fluttered and beat themselves against the sticks which he had rammed into the mud, after the fashion of a fence. Quack Quack, who was often alone in the Hollow, felt the gnawing pangs of hunger more keenly every day as she weakly thrust Laughing Boy from her breasts again and again, and staggered into the forest after fresh fuel. And there came a time when the hunger and pain grew so strong that she remembered only that she must satisfy them. Then she pushed Laughing Boy into the cave, which was the place that served to her and Strong Arm for a home, and with a mighty effort rolled a stone before the entrance. Laughing Boy, too, was very hungry, but she knew he was safe from the beasts of the forest. She heard his low wails as she turned her back on the Hollow and hurried away toward the branch of the river, pausing only when she saw the scrub ends of the wild plants, to examine them. But she found nothing to eat, only many holes where the Cave People had thrust their sticks in a search of roots. Quack Quack continued on her way, almost forgetting 21the mountain lion, and the dangers that assailed without, for the hunger passion was strong within her. The wild duck she sought and knew their haunts of old. It was because of her skill in catching them that she had earned her name among the Cave People. Better than any other, she knew their habits and how to catch and kill one among them without alarming the flock. This she had discovered when she was a very little girl. In those days it had been almost impossible for the Cave People to catch the wild duck. While they were sometimes successful in killing one, the others always scattered in terror. Soon they began to regard the Cave People as their enemies and immediately one of them appeared the alarm was given. But when Quack Quack, the mother of Laughing Boy, was ten years old and the Cave People were disgusted because the wild ducks eluded them so quickly, she found a way to deceive the flocks. She had waded out into the fork of the river, with the great green leaves of the cocoanut palm wet and flapping about her head, for the sun was very hot, and she stood quietly among the rushes, when a flock of wild ducks swam slowly down the stream. Suddenly she stretched out her arm, under the water, and seized one of the ducks by the legs and drew him down. And then the rest of 22the flock, unsuspicious of danger, swam on slowly around the bend.[1] 1. Prof. Frederick Starr says in his Some First Steps in Human Progress that this old method of catching wild ducks is still practiced by the tribes in Patagonia. Then the little brown girl ran out of the water holding aloft the duck, which was dead. Her mother was very proud as well as the young brown girl, and all the Cave People clapped their hands and said, “Good! Good!” And the young men said “Woman,” meaning she was grown very wise, and after that everybody called her Quack Quack, after the voice of the wild duck. And Quack Quack grew very proud of her accomplishment and spent long hours hiding in the rushes for ducks. All the Cave People put leaves or bark over their heads in order to hide themselves and tried to catch them as the brown young girl had done, but they always frightened away the flock even when they were lucky enough to seize one of the ducks. Many years had passed since the brown girl discovered the new way of hunting, but the brown woman, whom they still called Quack Quack, had not forgotten. She could not forget with a great hunger in her breast, as she slipped through the wood along the river bank. Gently she stepped, making no sound, and every little while she parted the brushes lining 23the river with her hands and peered through. But there were no ducks and she caught her breath each time eagerly and went further on, twitching her ears nervously. When she was almost exhausted, after some time, she again parted the brush. Now her eyes flashed, her small nostrils quivered and her hands worked convulsively, for there, not very far away, evidently drowsing near the rushes, she saw a solitary wild duck. The brown woman drew in her breath, and softly, very softly, withdrew from the brush and bent her steps further up the river. On her way she tore a long strip of dead bark from a tree and wound it carefully around her head and face. Then she plunged into the river until it rose above her shoulders, when she waded very gently with the current, down stream. The water was very cold, but Quack Quack clutched her hands sharply and stepped onward, deeper into the sluggish current, till only the rough bark which covered her head, remained in view. Slowly, very slowly, she felt her way over the soft bottom, making no sound, causing not even a ripple in the water. A small bough floated at her side and she kept pace with it, going no faster, no slower than it drifted, till she came close, very close, to the motionless duck. Then her hand shot forth and she dragged it sharply under the water. But it was alone. There was none to take flight 24at its cries and Quack Quack, the brown woman, scrambled up the bank, wringing the duck’s neck as she ran. She shivered in the wind and shielded herself in the brush, and then, lying flat on the ground, buried her teeth in the duck’s breast. Swiftly she ate, making loud noises with her lips and grunting joyfully, and not until the last portion was gone did she rise and turn her face toward the Hollow. Her stomach sagged with its heavy load and she walked slowly, glutted with food. When the Cave People saw her, they cried out, “Wild Duck, Wild Duck!” They looked at her stomach, big and distended and were very miserable, for they knew after what manner she had earned her name. The fire on the rocks in the Hollow was cold and dead and Strong Arm was very angry, but Quack Quack said nothing. She heard the cry of Laughing Boy as she slipped into the Cave, and she threw herself onto the bed of dead leaves and drew him, whimpering, to her breast.","sourceLink":"http://novel.tingroom.com/duanpian/3309/90432.html","bookId":417,"book":{"id":417,"title":"Stories of the Cave People","description":"简介： No man or woman can begin to intelligently interpret the causes of social phenomena and human progress to-day without a practical knowledge of sociology and a general understanding of the underlying causes of social evolution....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3309","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
