{"id":102506,"no":103,"title":"Page 103","content":"‘Aye. Estranged kin, I’d say. Saw no hugs when we all met.’\n ‘If Sergeant Gesler is now Mortal Sword, Corporal, what does that make you?’\n ‘Shield Anvil.’\n ‘I see. And the god you serve?’\n ‘Damned if I know, Adjunct.’\n Tucking the gloves in her belt, she drew off her helm and ran a hand through her hair. ‘Your battle with the Nah’ruk …’\n ‘Malazan tactics, Adjunct, along with these beasts, gave us the upper hand. We annihilated the bastards.’\n Something changed in her face, but nothing he could work out. She glanced back at her officers, or perhaps the army waiting beyond, and then once more fixed her gaze upon him. ‘Shield Anvil Stormy, this creature you ride—’\n ‘Ve’Gath Soldier, Adjunct. Only three bear these … saddles.’\n ‘And your K’Chain Che’Malle army – I see Hunters behind you as well. There are more of these Ve’Gath?’\n My K’Chain Che’Malle army . ‘Aye, lots. We got a bit mauled, to be sure. Those sky keeps gave us trouble, but some unexpected allies arrived to take ’em down. That’s what I’m here to tell you, Adjunct. Sinn and Grub found us. There was someone else, too. Never figured out who, but no matter, nobody climbed down out of the Azath when it was all done with, so I doubt they made it.’\n He’d just thrown enough at her to confuse a damned ascendant. Instead, she simply studied him, and then asked, ‘Shield Anvil, you now command an army of K’Chain Che’Malle?’\n ‘Aye, and our two runts are saying they have to stay with us, unless you order ’em back to you—’\n ‘No.’\n Stormy cursed under his breath. ‘You sure? They’re handy, don’t eat much, clean up after themselves … mostly – well, occasionally – but with plenty of back-of-the-hand training, why, they’d shape up—’\n ‘Fist Keneb is dead,’ she cut in. ‘We have also lost Quick Ben, and most of the marines and the heavies.’\n He winced. ‘Them Short-Tails was bleeding when they found us. But what you’re saying tells me you could do with the runts—’\n ‘No. You will need them more than we will.’\n ‘We will? Adjunct, where do you think we’re going?’\n ‘To war.’\n ‘Against who?’\n ‘“Whom”, Shield Anvil. You intend to wage war against the Forkrul Assail.’\n He grimaced, glanced at the Fist and captains positioned behind the Adjunct. Blistig, Lostara Yil, Ruthan Gudd. That miserable ex-priest, half slumped over his saddle. His attention returned to the Adjunct. ‘Now, why would we declare war on the Forkrul Assail?’\n ‘Ask the runts.’\n Stormy sagged. ‘We did that. They ain’t good on explanations, those two. Grub’s the only one between ’em who’ll say anything to us at all. Oh, Sinn talks just fine, when it suits her. Me and Ges, we was hoping you’d be more … uh, forthcoming.’\n A snort from Blistig.\n Tavore said, ‘Shield Anvil, inform Mortal Sword Gesler of the following. The Perish, Letherii and Bolkando armies are marching on the Spire. It is my fear that even such a formidable force … will not be enough. The sorcery of the Assail is powerful and insidious, especially on the field of battle—’\n ‘Is it now, Adjunct?’\n She blinked, and then said, ‘I have spent three years amidst the archives of Unta, Stormy. Reading the oldest and obscurest histories drawn to the capital from the further reaches of the Malazan Empire. I have interviewed the finest scholars I could find, including Heboric Light-Touch, on matters of fragmented references to the Forkrul Assail.’ She hesitated, and then continued. ‘I know what awaits us all, Shield Anvil. The three human armies you now see marching into the southeast are … vulnerable .’\n ‘Where the K’Chain Che’Malle are not.’\n She shrugged. ‘Could we conjure before us, here and now, a Forkrul Assail, do you imagine it could command your Ve’Gath to surrender its weapons? To kneel?’\n Stormy grunted. ‘I’d like to see it try. But what of the runts?’\n ‘Safer in your company than in ours.’\n He narrowed his gaze on her. ‘What is it you mean to do with your Bonehunters, Adjunct?’\n ‘Split the enemy forces, Shield Anvil.’\n ‘You have taken a savaging, Adjunct—’\n ‘And have been avenged by you and your Che’Malle.’ She took a step closer, dropping her voice. ‘Stormy, when news of your victory spreads through my army, much that haunts it now will fall silent. There will be no cheers – I am not such a fool as to expect anything like that. But, at the very least, there will be satisfaction. Do you understand me?’ \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-103.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
