{"id":102416,"no":12,"title":"Page 12","content":"His elongated eyes opened and he observed her with unfeigned curiosity. ‘You prefer?’ ‘Ale.’ ‘Sorry. You will need to go to the kitchens below for that.’ ‘Mare’s milk, then.’ His brows lifted. ‘Down to the palace gate, turn left, walk half a thousand leagues. And that is just a guess, mind you.’ Shrugging, she edged closer to the hearth. ‘The gift struggles.’ ‘Gift? I do not understand.’ She gestured at the flames. ‘Ah,’ he said, nodding. ‘Well, you stand in the breath of Mother Dark—’ and then he started. ‘Does she know you’re here? But then,’ he settled back again, ‘how could she not?’ ‘Do you know who I am?’ she asked. ‘An Imass.’ ‘I am Apsal’ara. His night within the Sword, his one night , he freed me. He had the time for that. For me.’ She found she was trembling. He was still studying her. ‘And so you have come here.’ She nodded. ‘You didn’t expect that from him, did you?’ ‘No. Your father – he had no reason for regret.’ He rose then, walked over to the table and poured himself a goblet of wine. He stood with the cup in hand, staring down at it. ‘You know,’ he muttered, ‘I don’t even want this. The need … to do something.’ He snorted. ‘“No reason for regret”, well …’ ‘They look for him – in you. Don’t they?’ He grunted. ‘Even in my name you will find him. Nimander. No, I’m not his only son. Not even his favoured one – I don’t think he had any of those, come to think of it. Yet,’ and he gestured with the goblet, ‘there I sit, in his chair, before his fire. This palace feels like … feels like—’ ‘His bones?’ Nimander flinched, looked away. ‘Too many empty rooms, that’s all.’ ‘I need some clothes,’ she said. He nodded distractedly. ‘I noticed.’ ‘Furs. Skins.’ ‘You intend to stay, Apsal’ara?’ ‘At your side, yes.’ He turned at that, eyes searching her face. ‘But,’ she added, ‘I will not be his burden.’ A wry smile. ‘Mine, then?’ ‘Name your closest advisers, Lord.’ He swallowed half the wine, and then set the goblet down on the table. ‘The High Priestess. Chaste now, and I fear that does not serve her well. Skintick, a brother. Desra, a sister. Korlat, Spinnock, my father’s most trusted servants.’ ‘Tiste Andii.’ ‘Of course.’ ‘And the one below?’ ‘The one?’ ‘Did he once advise you, Lord? Do you stand at the bars in the door’s window, to watch him mutter and pace? Do you torment him? I wish to know the man I will serve.’ She saw clear anger in his face. ‘Are you to be my jester now? I have heard of such roles in human courts. Will you cut the sinews of my legs and laugh as I stumble and fall?’ He bared his teeth. ‘If yours is to be my face of conscience, Apsal’ara, should you not be prettier?’ She cocked her head, made no reply. Abruptly his fury collapsed, and his eyes fell away. ‘It is the exile he has chosen. Did you test the lock on that door? It is barred from within. But then, we have no problem forgiving him. Advise me, then. I am a lord and it is in my power to do such things. To pardon the condemned. Yet you have seen the crypts below us. How many prisoners cringe beneath my iron hand?’ ‘One.’ ‘And I cannot free him. Surely that is worth a joke or two.’ ‘Is he mad?’ ‘Clip? Possibly.’ ‘Then no, not even you can free him. Your father took scores for the chains of Dragnipur, scores just like this Clip.’ ‘I dare say he did not call it freedom.’ ‘Nor mercy,’ she replied. ‘They are beyond a lord’s reach, even that of a god.’ ‘Then we fail them all. Both lords and gods – we fail them, our broken children.’ This, she realized, would not be an easy man to serve. ‘He drew others to him – your father. Others who were not Tiste Andii. I remember, in his court, in Moon’s Spawn.’ Nimander’s eyes narrowed. She hesitated, unsure, and then resumed. ‘Your kind are blind to many things. You need others close to you, Lord. Servants who are not Tiste Andii. I am not one of these … jesters you speak of. Nor, it seems, can I be your conscience, ugly as I am to your eyes—’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-12.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
