{"id":102418,"no":14,"title":"Page 14","content":"Paran slowly nodded. ‘Now I understand. It’s all about faith. A notion unfamiliar to you, I take it.’\n ‘This siege is meaningless!’\n ‘Is it?’\n Shadowthrone hissed, one ethereal hand reaching out, as if to claw at Paran’s face. Instead, it hovered, twisted and then shrank into something vaguely fist-shaped. ‘You don’t understand anything!’\n ‘I understand this,’ Paran replied. ‘Dragons are creatures of chaos. There can be no Dragon Master, making the title meaningless.’\n ‘Exactly.’ Shadowthrone reached out to gather up a tangled snarl of spider’s web from beneath the wall’s casing. He held it up, apparently studying the cocooned remnant of a desiccated insect.\n Miserable turd . ‘Here is what I know, Shadowthrone. The end begins here. Do you deny it? No, you can’t, else you wouldn’t be haunting me—’\n ‘Not even you can breach the power surrounding this keep,’ the god said. ‘You have blinded yourself. Open your gate again, Ganoes Paran, find somewhere else to lodge your army. This is pointless.’ He flung the web away and gestured with the head of his cane. ‘You cannot defeat those two, we both know that.’\n ‘But they don’t, do they?’\n ‘They will test you. Sooner or later.’\n ‘I’m still waiting.’\n ‘Perhaps even today.’\n ‘Will you wager on that, Shadowthrone?’\n The god snorted. ‘You have nothing I want.’\n ‘Liar.’\n ‘Then I have nothing you want.’\n ‘Actually, as it happens …’\n ‘Do you see me holding a leash? He’s not here. He’s off doing other things. We’re allies, do you understand? An alliance. Not a damned marriage!’\n Paran grinned. ‘Oddly enough, I wasn’t even thinking of Cotillion.’\n ‘A pointless wager in any case. If you lose you die. Or abandon your army to die, which I can’t see you doing. Besides, you’re nowhere near as devious as I am. You want this wager? Truly? Even when I lose, I win. Even when I lose … I win! ’\n Paran nodded. ‘And that has ever been your game, Shadowthrone. You see, I know you better than you think. Yes, I would wager with you. They shall not try me this day. We shall repulse their assault … again. And more Shriven and Watered will die. We shall remain the itch they cannot scratch.’\n ‘All because you have faith? Fool!’\n ‘Those are the conditions of this wager. Agreed?’\n The god’s form seemed to shift about, almost vanishing entirely at one moment before reappearing, and the cane head struck chips from the merlon’s worn edge. ‘Agreed!’\n ‘If you win and I survive,’ resumed Paran, ‘you get what you want from me, whatever that is, and assuming it’s in my power to grant. If I win, I get what I want from you.’\n ‘If it’s in my power—’\n ‘It is.’\n Shadowthrone muttered something under his breath, and then hissed. ‘Very well, tell me what you want.’\n And so Paran told him.\n The god cackled. ‘And you think that’s in my power? You think Cotillion has no say in the matter?’\n ‘If he does, best you go and ask him, then. Unless,’ Paran added, ‘it turns out that, as I suspect, you have no idea where your ally has got to. In which case, Lord of Shadows, you will do as I ask, and answer to him later.’\n ‘I answer to no one!’ Another shriek, the echoes racing.\n Paran smiled. ‘Why, Shadowthrone, I know precisely how you feel. Now, what is it you seek from me?’\n ‘I seek the source of your faith.’ The cane waggled. ‘That she’s out there. That she seeks what you seek. That, upon the Plain of Blood and Chains, you will find her, and stand facing her – as if you two had planned this all along, when I damned well know you haven’t! You don’t even like each other!’\n ‘Shadowthrone, I cannot sell you faith.’\n ‘So lie, damn you, just do it convincingly!’\n He could hear silk wings flapping, the sound a shredding of the wind itself. A boy with a kite. Dragon Master. Ruler over all that cannot be ruled. Ride the howling chaos and call it mastery – who are you fooling? Lad, let go now. It’s too much . But he would not, he didn’t know how.\n The man with the greying beard watches, and can say nothing .\n Distress .\n He glanced to his left, but the shadow was gone.\n A crash from the courtyard below drew him round. The throne, a mass of flames, had broken through the mound beneath it. And the smoke leapt skyward, like a beast unchained. \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-14.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
