{"id":102548,"no":146,"title":"Page 146","content":"With desolate eyes, she looked up at him. ‘I wanted a just war. I wanted it to be the last war of all wars. I wanted an end. One day the wolves will run only in our memories, our dreams. I do not want to live to see that day.’\n ‘There was something there,’ Abrastal insisted. ‘In her hand – your seers saw it, Krughava. They saw it. You must find out what it was – for all of us to do this, to do as she bids – for us , Krughava, you must find it!’\n ‘But I know what it is, Highness. In this moment, I have found my answer. And I see now how I have watched it weaken. How I have watched its light fade from the world. You see the Adjunct’s desperation – oh yes, she is desperate. We are too few. We are failing. That precious thing she found, she paid a price for it, and that price is now proving too high. For her, for the Bonehunters, for us.’\n Spax bared his teeth. ‘Then the mirror did not lie.’\n ‘The lie is in the faith, sir. The faith that it can win, that it can even survive at all. You see, she is indeed but one woman, a mortal, and her strength is no greater than anyone else’s. She has been at war – I now think – all of her life. Is it any wonder she now stumbles?’\n Spax thought back to that parley, and then shook his head. ‘From somewhere, Krughava, she is finding strength. I saw it – we all did, damn you—’\n ‘She turned me away.’\n Abrastal snorted. ‘You feel slighted? Is that where all this has come from?’\n ‘Highness.’ Krughava’s tone hardened. ‘From the very beginning, I saw myself as the reflection of her faith. I would be her one unshakeable ally – sworn to her and her alone, no matter where she would lead us. And I knew that we understood each other. And that as much as I needed her – and what she held inside – she in turn needed me . Do you grasp any of this? I was the source of her strength. When her faith faltered, she needed only to look at me.’ Krughava held her palms against her face, covering her eyes, and slowly leaned forward. Muffled, she said, ‘She turned me away.’\n Spax looked over at Abrastal and met the queen’s steady gaze. The Gilk Warchief slowly nodded.\n ‘You leave me in a difficult position,’ Abrastal said. ‘Krughava. If I understand you correctly, it is now your thought that in denying you, the Adjunct has in effect lost her faith. Yet was this not a matter of disposition? Two objectives, not one, and so we are to be divided in strength. And given the nature of the Glass Desert—’\n But Krughava was shaking her head behind her hands. ‘Do you truly imagine that she believes she can cross it? With her army?’\n Spax loosed a stream of Barghast curses, and then said, ‘What would be the point of that? If she intends suicide – no, her ego cannot be so diabolically monstrous that she’d take all her soldiers with her!’\n ‘You are yet, I think,’ and Krughava’s hands fell away as she looked up at him, ‘to acquaint yourself with the third voice in this eternal argument.’\n ‘What do you speak of?’\n ‘I speak of despair, sir. Yes, she would will herself and her army across the Glass Desert, but she does so without faith. It is gone, driven away—’\n Abrastal said, ‘Sincerely as you may have seen yourself as the true and unshakeable reflection of Tavore’s faith, I believe your conviction that Tavore saw you the same way – in those precise terms – is itself an article of faith. This place of despair where you now find yourself is entirely of your own making.’\n Krughava shook her head. ‘I have watched it weaken. I have watched its light fade from the world. And I have seen her desperation. We are too few. We are failing. That shining thing, there in her hand, is dying.’\n ‘Tell me its name,’ Abrastal whispered. ‘This argument of yours. You name one side faith and another despair . Speak to me of what she holds. This failing, dying thing.’\n Spax turned to Abrastal in surprise. ‘Why, Firehair, you do not yet know? That which fades from the world? Its name is compassion . This is what she holds for the Fallen God. What she holds for us all.’\n ‘And it is not enough,’ Krughava whispered. ‘ Gods below, it is not enough .’\n BOOK FOUR\n THE FISTS OF THE WORLD\n If there was a better place\n Would you seek it out?\n If peace was at hand\n Would you reach for it?\n And on this road stand thousands\n Weeping for all that is past\n The journey’s at an end\n We are done with our old ways \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-146.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
