{"id":102562,"no":162,"title":"Page 162","content":"Staring at her own knees, at the thick bundling of myrid skins surrounding her splinted leg. Hair hanging down, hiding from her eyes Badan Gruk, Sinter and all the rest, so useless in their clumping along, so bitter in all the ghosts they now carried, the weight bowing them down. Was it Pores or Kindly? Yes, Pores. ‘Grow that hair, woman!’ Or was it ‘Cut it’? I can’t remember – how can I not remember? Was it that long ago? Pores, pretending to be Kindly. Where does that kind of courage come from? That … audacity? That knowing look will be in his eye right up until he’s shoved through Hood’s Gate. It will, won’t it? How I admire people like that. How I wanted to be like them . Badan Gruk, take a lesson from Pores, I beg you. No more of the sad eyes, the hurt look. I see it and I want to stab deeper. Lash out. I want to make true all your miserable worries, all those wounds upon your heart. Let’s see them bleed! The wagon jarred beneath her. She gasped. Flowers and trees, leaves of fire igniting behind her eyes. No time to think. Every thought tried running, only to explode in the forest. Bursting awake all the leaves, high in the canopy, and every thought wings away . Like birds into the sky. The leg was infected. There was fever, and nothing anyone could do about it. Herbs fought the good war, or they would if there were any. If she asked for them. If she told someone. Pastes and poultices, elixirs and unguents, all the ranks of grim-faced soldiers, banners waving, marching into disease’s grinning face. No one’s allowed to get off. On pain of death, aye . Stay right here, this rocking wagon, the rank sweat of the oxen so sweet in our nostrils. We got us a war, comrades. Can’t stop and chat. We got us a war, and no one’s allowed to get off. No one’s allowed to get off. No one’s allowed to — Badan grunted and looked up. ‘Shit,’ said Sinter, starting forward. Kisswhere had been leaning forward over her thighs, one leg dangling off the wooden tail, the other splinted straight, thrust out at an angle. She’d just fallen back, head cracking as it bounced on the slats. Sinter clambered on to the wagon. ‘Gods below, she’s on fire. Badan – get us a cutter, fast.’ Straightening, she faced forward and leaned over the bundles of gear. ‘Ruffle! Pull this thing over to one side – hurry! Out of the line!’ ‘Aye, Sergeant!’ ‘They’re pulling outa line, Sergeant. Should we go back and see what’s up?’ Hellian scowled. ‘Just march, Corporal.’ It was dark but not so dark as it maybe should be. People glowed green, but then, could be that was how it always was, when she didn’t drink. No wonder I drink . ‘Listen, all of you,’ she said, ‘keep an eye out.’ ‘For what?’ Breathy asked. ‘For a tavern, of course. Idiot.’ They’d gotten two transfers. From the Seventh Squad. A pair of swords, one of them with a bad knee and the other one with the face of a gut-sick horse. Limp’s the name of one of them. But which one? That other one … Crump. A sapper? Is Crump the sapper? But sappers ain’t worth much now, are they? Big enough to be a sword, though, unless Crump is the one with the bad knee. Imagine, a sapper with a bad knee. Set the charge and run! Well, hobble. Fast as you can. Guess you looking like a horse was some kind of joke, huh? Sappers. Nothing but a bad idea that stayed bad. Bust up one leg on all of ’em, that’d make the breed extinct quick enough . Aye, Limp’s the sapper. Crump’s the other one. Crump goes the knee. Limp goes the sapper. But wait, which one’s got the bad knee again? I could turn round. I suppose. Turn round and, say, take a look. Which one’s limping? Get the limper sorted and I got Crump, meaning the sapper’s the other one, with the bad knee. Limp, then. He’s named Limp on account of the bad knee of his buddy’s, since he has to help the fool along all the time. But then, if he got that name at the start, why, he’d not make it as a soldier at all. He’d of been drummed out, or planted behind a desk. So, the sapper didn’t run fast enough from some fuse, that’s how he earned his name. Got the name Crump, on account of a crumpling knee. Now I get it. Whew . But what’s the point of a horse with a bad knee? ‘’S getting cold, Sergeant.’ Hellian’s scowl deepened. ‘What do you want me to do about it, fart in your face?’ ‘No. Was just saying. Oh, and Limp’s lagging – we should’ve stuck ’im on the wagon.’ ‘Who are you again?’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-162.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
