{"id":102600,"no":201,"title":"Page 201","content":"Power filled the glade, an emanation that pushed back the vile curse of this realm, all the exultant expressions of evil that seemed to thrive unopposed in this place. Swept away. Refuted.\n He remembered sitting at a campfire, listening to Harllo going on about something, and a fragment of words returned to him now. The face across the fire, long and flickering. ‘ War, Gruntle. Like it or not, it’s the spur of civilization .’ And then that lopsided grin.\n ‘Hear that, Trake? I just figured out why you’ve granted me this gift. It’s all nothing but expedience with you. One hand blesses but the other waits for the coin. And you’ll be paid, no matter what. No matter what.’\n Twenty-one silent warriors now faced him, their sores gone, their eyes bright. He could be cruel now and just take them. ‘He’ll have made sure you can understand me. He’ll have done that, I think.’\n Cautious nods.\n ‘Good. You can stay here. You can return to your people – if any are still alive. You can try to seek vengeance against the ones who killed you. But you know you’ll lose. Against the evil now in your land, you are doomed.\n ‘You’re warriors. When you run with me, know that a fight awaits us. That is our path.’ He hesitated, and then spat to one side. ‘Is there glory in war? Come with me and let’s find out.’\n When he set off, twenty-one warriors followed.\n And when he awakened his power they rushed closer. This, my friends, is called veering. And this, my friends, is the body of a tiger .\n A rather big one .\n The three strangely garbed strangers they found walking on the trail ahead barely had time to lift their long clubs before Gruntle was among them. Once he passed, there wasn’t much left of those three pale men, and he felt the pleasure of his companions. And shared it. There’s only one thing to do with evil. Take it in your jaws and crush it .\n Then they were gone from the world.\n What place washes bones up like driftwood? Mappo’s gaze narrowed on the flat, blinding stretch awaiting him. Shards of quartz and gypsum studded the colourless, dead ground, like knots of cacti. The horizon was level behind shimmering waves of heat, as if this desert reached to the very edge of the world.\n I have to cross it .\n He crouched, reached down and picked up a long bone, studied it. Bhederin? Maybe. Not yet fully grown . He collected another. Wolf or dog jaw. So, this desert was once prairie. What happened? The bones fell with a clatter. Straightening, Mappo drew a deep breath. I think … I think I am getting tired of living. Tired of the whole thing. Nothing is working like it used to. Flaws are appearing, signs of things breaking down. Inside. The very core of my spirit .\n But I have one thing left to do. Just one thing left, and then I can be done with all this . He found himself drifting off, not for the first time, finding that place in his head where every thought rattled like chains, and he could only drag himself in crooked circles, the weight stealing his strength, his willingness to go on.\n One thing left. It’s down to managing resources. Harbouring the will. Navigating between all the sour truths. You can live that long, Mappo. You have no choice but to live that long, or all this will be for nothing .\n I see the world’s edge. Waiting for me .\n He tightened the straps of his sack, and then set out. At a steady jog. It’s just a desert. I’ve run across a few in my day. I won’t go hungry. I won’t go thirsty, and whatever exhaustion comes to me, well, it’ll end when it’s all over .\n With each footfall his nerves seemed to recoil from the contact. This was a damaged place, one vast scar upon the earth. And for all the death lining the desert’s bizarre shore behind him, there was life here. Inimical, unpleasant life. And it possessed intent .\n You feel me, don’t you? I offend you. But it is not my desire to offend. Leave me to pass, friend, and we will be done with each other .\n Flies buzzed round him now. He had settled into a dogtrot, his breathing steady and deep. The insects kept pace, gathering in ever greater numbers. Death is not punishment. It is release. I have seen that all my life. Though I did not wish to, though I told myself stories to pretend otherwise. Every struggle must end. Is the rest that follows eternal? I doubt it. I doubt we’d ever get off that easily .\n Hood, I feel your absence. I wonder what it means. Who now waits beyond the gate? So much anguish comes in knowing that each of us must pass through it alone. To then discover that once through we remain alone – no, that is too much to bear .\n I could have married. Stayed in the village. I could have fathered children, and seen in each child something of my wife, something of me. Is that enough meaning to a life? A cloth of unending folds? \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-201.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
