{"id":102661,"no":263,"title":"Page 263","content":"‘You do not believe in the power to do good? To do what is right?’\\n\\n ‘The Hold of the Beasts wants vengeance. It wants to redress the balance of slaughter. Messy as that would be, at least I see the logic of it. But I fear it’s too late. Their age is past, for now.’\\n\\n ‘We will prove the lie of your words, human.’\\n\\n ‘No, you won’t. Because, Forkrul Assail, you are going to fail, and in failing you fail your allies as well, and for them the misery simply goes on and on. The only end to the tragedy of the beasts will come at the hands of humans – and to the Wolves I would advise patience. They need do nothing more, because we humans will destroy ourselves. It may take a while, because there’s lots of us, but we’ll do it in the end, because we are nothing if not thorough. As for you and your kind – you’re not even relevant.’\\n\\n ‘Draw your knife, human. Kneel.’\\n\\n ‘I am sorry, but I can barely hear you.’\\n\\n She blinked. ‘Draw your knife!’\\n\\n ‘Barely a whisper, I’m afraid.’ He drew out a small wooden card. ‘I am Ganoes Paran. I was a soldier in the Malazan army, a marine, to be precise. But then I became the Master of the Deck of Dragons. I didn’t ask for the title, and had no real understanding of the role for quite some time. But I’m getting the hang of it now.’ He held up the card. ‘This is where your voice is going. It’s another realm, where the only things hearing you – or, rather, succumbing to your power – are insects and worms in the mud. They’re confused. They don’t know what a knife is. They don’t even know how to kneel.’\\n\\n Sister Belie stepped forward. ‘Then I shall break you with my hands—’\\n\\n He seemed to lean back, and suddenly he was gone. The card fell, clattered on the stones. She reached down, picked up it. The image was little more than a scratching of lines, a rough landscape, a hint of ground, low plants – and there, vague in the gloom, stood the man. He beckoned and in her mind she heard his voice.\\n\\n ‘ Come after me, Forkrul Assail. I invite you to do battle with me here. No? Well, it was foolish of me to think you were that stupid. After all, I need only step out of this wretched place, leaving you trapped – and it’d be a long, long time before you found your way home. Well. We have now met. We are enemies known to one another, as it should be .\\n\\n ‘ You cannot enslave my army. If you want to defeat us, you’ll have to do it the hard way. Oh, by the way, I enjoyed our little talk. I think I now understand you better than you do me, which is an advantage I intend to exploit. Oh, if you could see your expression now —’\\n\\n With a snarl she snapped the card in half, flung the pieces to the ground. Whirling, she marched back to where her officers waited. ‘Summon Brother Grave – assemble the legions. We shall end this!’\\n\\n One of the Watered stepped forward tremulously and bowed. ‘Pure, we need reinforcements—’\\n\\n ‘And you shall have them. We shall sustain this assault – give them no rest. Brother Grave waits with three legions. I will have that human’s hide nailed to the wall of this citadel.’\\n\\n The Watered grinned. ‘A worthy trophy, Pure.’\\n\\n She faced the edifice once more. ‘ I will ,’ she whispered, ‘ because I can .’\\n\\n ‘You fool,’ snapped Noto Boil. ‘She almost had you, didn’t she?’\\n\\n Paran wiped at the mud caked on his boots. ‘Find Fist Bude. Get the reserves ready. This one’s going to be messy. And tell Mathok to mount up for a sortie – before the bastards get a chance to set up.’\\n\\n ‘Did she seek to command you?’\\n\\n ‘I told you, I had an answer to that. But you’re right, those Forkrul Assail move damned fast. It was close. Closer than I would have liked, but then,’ he smiled at the healer, ‘we’ve stirred them up. Got two pure-bloods over there now – and more legions to boot.’\\n\\n ‘Let me guess – all according to your plan.’\\n\\n ‘Where’s Ormulogun? I need him to work on that etching – in case we need to get the Hood out of here.’\\n\\n Noto Boil sighed, and set off to look for the Imperial Artist. He chewed on his fish spine until he tasted blood.\\n\\n ‘ You always could pick them, couldn’t you, woman?’ She’d been walking in her sleep again, this time out and down the steps into the cellar, where waited a dead friend. He was sitting on one of the kegs Antsy called the Sours – one of those that held bodies of damned Seguleh. Not that they were there any more, but that pickling concoction was still one of the foulest brews she’d ever smelled . \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-263.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
