{"id":102701,"no":304,"title":"Page 304","content":"Just look at the ones hauling those ropes – the ones just up ahead. What in Hood’s name are they doing, dragging these wagons? It don’t matter. They’re heavies and someone told ’em, ‘Haul these wagons,’ and so that’s what they’re doing. Y’see? Attitude . Aye, we stopped ’em cold, those Stumpies. They swung high, we ducked low. They gave us the blade, we gave ’em the shield. That’s how it’s done. True, I won’t lie, not many of us left. We was outnumbered, badly outnumbered . These days? I’m working for Master-Sergeant Lieutenant Quartermaster Pores. He’s just gone back to check on a cracked axle three wagons back. Be with us shortly. Me? I’m waiting for our squad of marines, t’stand guard, aye. But they had a scrap last night, got cut up a bit, but it never went further, since nobody’s got the strength to take it further, if you see what I mean. Still, needed some sewing and the like. I’m expectin’ them any time . The name’s Shorthand — Something hard as stone smashed into the side of his head. Rackle lowered the mace, watched as Stull and Bester dragged the body off to one side. A score or so regulars had looked up at the scuffle, and now watched with dull eyes as they went, their legs dragging them along as if those legs were the last parts of them still working. Rackle wasn’t ready to be like that. Hood take ’em all, he wasn’t. ‘So much for the bodyguard,’ he said. ‘Quiet!’ hissed Bester, nodding ahead to the lines of haulers. ‘Get up on the wagon, Rack, but go slow and careful – they’re going to feel the extra weight no matter what.’ Rackle grunted. ‘Oafs are past feeling anything, Best.’ But he edged up close to the wagon, reached up one hand and set a foot on the helper, and as the wagon rolled ahead he let it lift him from the ground, nice and slow the way Best wanted it. Rackle watched as Stull re-joined Bester, and the two melted away into the gloom. So far so good. Somewhere in this wagon, probably packed dead centre, were Blistig’s special casks. Time had come for a drink. He drew himself higher up, leaning against the bales as he did so, reaching for more handholds. That water – he could smell it. Close. Pores crawled out from under the wagon. ‘Cracked right through,’ he said, climbing to his feet. ‘What’s in this one?’ he asked the man beside him. The once-company cook scratched at his beard. ‘Some lantern oil. Horseshoes. Wax, grease—’ ‘ Grease? And it didn’t occur to you to maybe use some of it on this damned axle?’ ‘We was saving it for when it got real bad, sir. Aye, maybe that was a mistake.’ ‘All right,’ Pores sighed. ‘Cut the haulers loose and send them on. I’ll take a closer look at what else is up there.’ ‘Aye, sir, but I don’t think anybody’s going to come back for whatever you think we still need.’ Pores looked round. They’d been left behind by the train. Shit . ‘Even so – there might be a child hiding under the blankets, the way they come crawling out of the unlikeliest of places. Or too sick to move.’ ‘I’ll be on with it then, sir.’ ‘Spread the haulers out with the rest.’ ‘Aye sir.’ Pores watched him go, and then heaved himself up on to the bed of the wagon. Trying to ignore the fire someone had lit in the back of his throat, and his growing sense of helplessness, he set to exploring. The kegs of grease were pretty much empty – with only a few handfuls of the rancid gunk left – so it probably wouldn’t have been enough to save the axle anyway. He tried pushing clear a cask filled with horseshoes, but he no longer had the strength left to do that. Clambering over it, he thumped the nearest bale. ‘Anyone down there? Wake up or get left behind!’ Silence. Pores drew his dagger and slit open the bale. Spare uniforms? Gods below! If the haulers find out they’ll skin me alive . He cut open a few more. Tick for mattresses. Lead shot packed in wool for slingers – we don’t have any slingers. Who’s quartermaster of this mess? Oh, me. Right . ‘That’s it, then,’ he muttered, ‘Master-Sergeant Pores, fire Quartermaster Pores. Can I do that, Lieutenant? You can, because I’m telling you so, or do I need to take this to Fist Kindly? Please, sir, no, don’t do that. He hates me! Odd, he doesn’t hate me , Master-Sergeant. Really, sir? I’m certain of it, Master-Sergeant. Reasonably. I hope. All right, no more excuses for the old man – he hates us all. This is what happens to a bald man who starts collecting combs—’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-304.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
