{"id":102705,"no":308,"title":"Page 308","content":"Kindly glanced across at Raband, who stood waiting. ‘Is the Fist alone, captain?’\n ‘No sir. Fist Sort and Captain Skanarow are with him, along with Captain Ruthan Gudd. There’s been an accusation voiced, sir – I was planning on telling you on the way, but,’ and he shot Balm a look, ‘Ruthan Gudd says there’s blood on Blistig’s knife. Pores’s blood.’\n Balm swore. ‘Togg’s bloody jowls! By his own hand? ’\n Raband shrugged.\n ‘Lead on, Captain,’ Kindly said, so quiet the words barely carried.\n Balm watched them go.\n Deadsmell followed a pace behind his guide. Ahead, the other T’lan Imass had raised a tarp. Lanterns were lit, shutters slipped back, wicks turned up and blazing. It had been a long way back along the trail, forty or more paces. Nearby squatted a wagon. In the harsh light beneath the tarp, he saw Pores’s body.\n Blood everywhere. He won’t survive this . He edged past the T’lan Imass and made his way under the tarp, falling to his knees beside Pores. Studied the wound. This is a bleeder. Above the heart. He should be already dead . But he could see the faint pulse, pushing out thinning trickles of blood. The man’s breathing was shallow, rasping. Not a lung, too. Please, not a lung . ‘I’ve got no magic here,’ he said, looking up and seeing nothing but withered, lifeless faces staring back down at him. Shit, no help there .\n He stared back down at Pores. ‘Seen the insides of plenty of people,’ he muttered. ‘Living and dead. Well. Had a teacher, once, a priest. Dresser of the dead. He had some radical notions. Gods, why not? He’s going to die either way.’\n Deadsmell drew out his sewing kit. ‘Said it should be possible to go right inside a body, clamp the bleeder, and then sew it back together, right there inside. Not that it’ll help much if he’s got a punctured lung too. But no blood froth at the mouth. Not yet. So … I guess I’ll give it a try.’ He looked up. ‘Two of you, I need your hands – I need the wound held open, wide as you can make it – gods, those are foul-looking fingers you Imass got.’\n ‘There is nothing living on our hands,’ said one of them.\n ‘What’s that got to do with anything?’ Deadsmell asked.\n ‘We will carry no infection into his flesh, healer.’\n ‘No, but the knife blade that did this probably has.’\n ‘His bleeding has cleaned the wound, healer. The greatest risk of infection will be from your hands, and your tools.’\n Threading a needle with gut, Deadsmell scowled. ‘That old priest shared your opinion. But there’s nothing I can do about that, is there?’\n ‘No.’\n Deadsmell’s vision spun momentarily, and then steadied once more. Unbelievable. I’m dying, even as I’m trying to save another man from doing the same. And really, is there any point to this?\n Two Imass had knelt, reaching to prise open the wound.\n ‘Dig your fingers in – I need to see as much as I can. No, wait, now all I can see are your fingers.’\n One spoke. ‘Healer. One of us shall hold open the wound. The other shall reach inside and find the two severed ends of the vessel.’\n ‘Yes! That’s it! And once you’ve got them, pinch hard – stop the blood flow – and then bring them together so I can see them.’\n ‘We are ready, healer.’\n ‘He’s lost a lot of blood. He’s in shock. This probably won’t work. Surprised he’s not already dead. I might just kill him. Or he’ll die later. Blood loss. Infection.’ He trailed off, looked across at blank, staring, lifeless faces. ‘Right, needed to get all that out of the way. Here goes.’\n They were waiting well off to one side of the trail. The column’s ragged end had already passed. Blistig stood facing the others, arms crossed.\n Kindly and Raband made their way over.\n Overhead, the Jade Strangers blazed with a green light bright enough to cast sharp shadows, and it seemed the desert air itself was confused, not nearly as chill as it should have been. There was no wind, and stillness surrounded the group.\n Blistig met Kindly’s eyes unflinchingly. ‘I executed a traitor tonight, Kindly. That and nothing more. I was holding on to reserves of water – knowing a time of great need would come.’\n ‘Indeed,’ Kindly replied. ‘How many casks was it again? Four? Five?’\n ‘For the officer corps, Kindly. With some, if we so judged, to the marines and heavies. It wouldn’t have been much, granted, but something … maybe enough. Didn’t the Adjunct make it plain? The marines and the heavies before everyone else. In fact, the rest of them don’t matter.’ \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-308.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
