{"id":102721,"no":324,"title":"Page 324","content":"‘I believe you, Erekala. And I find in you and your people much to admire. I will regret sending you all to your deaths. But, as you might well understand, the Wild poses a threat even to us Forkrul Assail, should it truly be unleashed upon the world.’\n ‘Pure, with my own Thrones of War I have carried your most dangerous enemy to this land. I know well what is coming. It is my judgement – and I am confident that the Mortal Sword and the Shield Anvil will concur – it is my judgement, Pure, that in the war now begun we will all lose. And in our losing, the Wild shall win.’\n Serenity was silent for a time, studying the Perish commander, the unearthly eyes unwavering. Then, a small catch of breath. ‘Do I err in understanding you, Erekala? You crossed the field of battle … to help even the scales ?’\n ‘By all means, Pure, send us to our deaths. Upon the other side, we shall await you.’\n Serenity advanced a step. ‘I know well these Malazans. And I will welcome them!’\n ‘The Mortal Sword Krughava stood before the Adjunct Tavore and placed her sword in the Adjunct’s hands. Before her , Pure, we did not kneel.’\n ‘Sister Reverence forced you to kneel, you pompous fool!’\n Erekala cocked his head. ‘Did she?’\n ‘You resisted!’\n ‘Pure, why would we resist? You forget, we came to you, not the other way round.’\n Serenity turned, faced the back wall again. His head tilted as he emptied the goblet of wine. ‘Tomorrow we double our pace, Commander. We will hunt down the foreign army – the murderers of Sister Belie. And your Perish will fling themselves into the battle, and fight and not yield. If it takes the life of every single one of you, the enemy shall be destroyed.’\n ‘Precisely,’ Erekala replied.\n ‘Dismissed.’\n Donning his helm once more, Erekala left the tent.\n Hips aching, Sister Reverence made her way along the ridge overlooking the now-withered farmland. She could see where Brother Diligence had established revetments, arbalest sangers, berms and trenches. She could see how he intended to funnel the enemy to the place of killing. Only the forward echelons and the engineer corps of the Shriven Army were present, the rest remaining closer to the city where supplies could readily accommodate them.\n Such an army. Fifty thousand for this one battle, says Brother Diligence. And soon, more Perish Grey Helms. Five thousand heavy infantry, fanatical, and entirely subject to my desire – and Brother Diligence’s. And surrounding the Spire, twenty thousand more, entrenched, immovable. What foe would dare this?\n She saw her commander ahead, surrounded by officers and messengers. Old as he was, Brother Diligence seemed to have shed years now that a battle was imminent. As she drew closer, she heard him addressing his officers. ‘… shall be starving – we well know how unproductive the southlands are. And in this weakened state, they will gamble everything on a single cast of the die, a solitary, determined, desperate advance. We need but hold them until their energy is spent, for once that strength is gone they will have nothing in reserve. And then, and only then, shall we advance. Ah, Sister Reverence. Welcome.’\n ‘Brother Diligence. All that I see here pleases me.’\n He tilted in head in acknowledgement. ‘Sister, has there been any word from Sisters Calm and Equity?’\n ‘No, but I am not unduly concerned. In truth, we can manage quite well without them.’\n He frowned, but nodded.\n They walked a short distance from the officers.\n ‘Brother Diligence,’ she said, studying the preparations, ‘I am aware of the Spire defences, and of this, your main army. Where are the reserve armies?’\n ‘Sister Freedom and Brother Grave command twenty thousand Kolanse infantry positioned ten leagues to the west. To support them, Brother Aloft oversees fifteen thousand Shriven auxiliaries. These combined forces are so positioned as either to respond to a break-out from the enemy holding the keep, or to drive south to engage the enemy marching here – should we perceive the need for them, which I do not.’ He fell silent then, and Reverence saw that his attention had been drawn downslope, to where a rider was fast approaching.\n ‘News comes,’ Reverence said. ‘In haste.’\n ‘From my southern outlying pickets, Sister.’\n The Shriven’s horse was lathered, straining with exhaustion as it lumbered up the slope. When the rider reined the beast in, it stumbled and barely recovered. The man, soaked in sweat, dismounted and stood before Diligence. ‘Inquisitor,’ he said, struggling to catch his breath. \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-324.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
