{"id":102743,"no":350,"title":"Page 350","content":"Not a chance – oh, gods below, what’s it doing here? He could feel it now. A massive, looming presence. ‘What’s it doing?’ he hissed. ‘Er, sniffing you.’ Kalam felt his skin crawl. ‘Why can’t I see it?’ ‘Because it doesn’t want you to.’ The assassin almost shouted when a sharp talon tracked gently across one cheek, ending up directly beneath an eye. He forced himself to lie perfectly still. ‘A servant of the Wolves, I think.’ Aye. Don’t tell me what I already know . Then the hand pressed down on Kalam’s chest, directly over his shattered ribs. But there was no pain, just a sudden heat. A moment later the hand was gone. And then— ‘Hood take me,’ Quick Ben muttered a few heartbeats later. ‘Gone. Never seen the like. It fucking healed you, Kalam. Why did it do that?’ Feeling shaken, fragile, as if he’d inhaled a fist and had only just now coughed it back out, the assassin slowly regained his feet. There was chaos on all sides of the burning tent, and he saw a Perish officer, one of Krughava’s ship commanders. He was standing staring at the tent with an odd, almost satisfied expression on his lean face. ‘Ready to try for him?’ Quick Ben asked. Kalam shook his head. ‘No. We don’t touch the Perish.’ ‘What do you mean?’ ‘Unless you want that thing to come back, a whole lot madder.’ ‘Good point.’ ‘You’re sure there aren’t any more Pures?’ ‘No.’ ‘Time to go, then.’ They set out, winding unseen through the crowd of soldiers. At the skirting wall, the assassin paused and glanced back. And nodded. ‘Always an even trade …’ Not that I can remember what I did to make him so happy . In his tent, Paran slowly sat back, carefully setting down the wooden card. He could have pulled them out, right at the moment the demon closed on them. But something had held him back. That was a chosen servant of the Wolves of Winter. I felt its anger, and then I felt its … what was it? Solicitude? I didn’t know they could even feel things like that . He straightened, walked over to the stick, took it in his hand, and pulled it from the ground. The balls on the string snapped after it. A thunderous concussion in the confines of the tent, clouds of dust, and Quick Ben and Kalam staggered into view. The wizard’s expression twisted with outrage. He glared across at Paran. ‘That was a little late, High Fist! We were already halfway back.’ Paran waved at the dust. He could hear footsteps from beyond the flap and called out, ‘Everything’s fine!’ From outside, a soldier’s voice hissed, ‘Hear that, Gebbla? When a High Fist farts the whole world shakes!’ ‘Shh, y’damned idiot!’ The footsteps retreated. Paran sighed. ‘I got impatient waiting for you. Sorry. I didn’t know retrieving you was going to be so messy.’ ‘It was for emergencies , sir. I feel like I’ve been pulled inside out.’ ‘Aye to that,’ Kalam growled, moving over to sit down heavily on the chest. The stout legs snapped and the chest thumped down hard. The assassin winced. ‘Just what my old bent spine needed, gods below.’ He started pulling off his gloves. ‘My sister’s allies, then – am I correct, Kalam?’ ‘Good guess.’ ‘Allies no longer,’ said Quick Ben, and now he was the one pacing in the confines of the tent. ‘But that was Erekala, not the Mortal Sword. Didn’t see the Shield Anvil either. This force is the one that came from the sea. The soldiers left to travel with the fleet.’ ‘So it could be that Krughava has no idea they’ve turned,’ Kalam said. ‘That alliance always had me nervous,’ Quick Ben said. ‘Fanatical worshippers of a world without humans – how does that make any sense? Even if Krughava hasn’t turned, it’s only a matter of time – all they have to do is follow their faith to its logical conclusion. I warned Tavore—’ ‘Now you’re lying,’ Kalam said in a growl. The wizard turned on him. ‘How would you know?’ ‘Just guessing. Because I know you, remember? You’re just mad at yourself because you never anticipated this happening.’ ‘Fine. Have it your way then. The point is, Tavore is in trouble. She could get backstabbed at any time, and there’s no way we can warn her.’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-350.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
