{"id":102763,"no":370,"title":"Page 370","content":"Down came Brother Diligence, and there was Tanakalian, climbing into view, turning first to study the approaching Forkrul Assail, and then facing Setoc. He made his way closer – but not so close that should she leap, her fangs would find his throat. She noted that, and was not surprised.\\n\\n ‘Destriant Setoc. We are about to be challenged.’\\n\\n She bared her teeth.\\n\\n His face knotted in a scowl. ‘Listen to me! It is of no use if you can do little more than lift hackles and growl! He will use Akhrast Korvalain – do you understand me?’\\n\\n ‘And what is it about that to cause fear, Shield Anvil?’\\n\\n ‘The Assail know nothing of the K’Chain Che’Malle – do you see? I have kept that from them.’\\n\\n ‘Why?’\\n\\n ‘It does us no good if the Assail win on this day, does it?’\\n\\n She cocked her head. ‘It doesn’t?’\\n\\n ‘We remain balanced on the knife’s edge – or have you forgotten? By what we do, by what we say or do not say, it all falls to us. Here. Now.’\\n\\n ‘Shield Anvil’ – she paused to yawn – ‘Shield Anvil, why did you banish the Mortal Sword?’\\n\\n ‘She broke our holy vow, Destriant. I have already told you this.’\\n\\n ‘By swearing fealty to this Adjunct woman.’\\n\\n ‘Yes.’\\n\\n ‘And these Letherii and Bolkando – they are her allies? This Adjunct’s allies?’ She could see the growing frustration in the man, and was unmoved.\\n\\n ‘I told you this!’\\n\\n ‘Do you fear Brother Diligence? I see that you do. Should he … compel us. But, Shield Anvil, I want to know, which do you fear the most? The Adjunct or the Brother? Think of it as a contest if that helps. Which one is it?’\\n\\n Tanakalian looked back up the slope, to where Diligence was coming ever nearer to their earthen fort, and then back again. ‘The Adjunct is dead.’\\n\\n ‘You do not know that, and besides, that doesn’t matter – it’s not relevant to the question I asked.’\\n\\n A sneer curled his lips. ‘If it is a question of immediacy, then it must be Brother Diligence.’ His tone dripped venom, and she understood that as well – all the reasons, all the emotions raging back and forth in this man.\\n\\n Setoc nodded, and then straightened from her crouch. She arched her back, stretched out her limbs. ‘Immediacy, it’s such a lie. One is close, the other is far away. So … fear more the one who is close. But, you see, there are two sides to immediacy. The one you’re seeing is the one now, but there is another one, the one you only find at the end of things.’\\n\\n Tanakalian’s eyes narrowed on her, and she could see that he was startled, that he was thinking, and thinking hard now.\\n\\n ‘So,’ Setoc continued, ‘let’s forget the now for the moment, and go to the end of things. At the end of things, Shield Anvil, whom will you fear the most? Yon Brother Diligence, or the Adjunct?’ Hearing voices from the trenches – filled with surprise and something like excitement – she smiled and added, ‘Or our Mortal Sword, who even now rides for us?’\\n\\n Suddenly white, Tanakalian climbed the nearest berm, faced the valley called Blessed Gift. For a dozen heartbeats, he made no move. And then he looked back down at Setoc. ‘Where will you stand in this, Destriant?’\\n\\n ‘I stand with the Wolves.’\\n\\n Triumph flashed in his eyes.\\n\\n ‘But,’ she continued, ‘that is only half the question, isn’t it?’\\n\\n He frowned.\\n\\n ‘You must then ask me, where stand the Wolves?’\\n\\n He half snarled – and all the beasts beneath now awaken! – and said, ‘I know well their position, Destriant.’\\n\\n ‘Well,’ Setoc corrected, ‘you thought you did.’ She leapt down then, crossed the back edge of the fort to come opposite the narrow stepped track down which the Forkrul Assail was descending. Lifting her gaze, she held out her arms and shouted, ‘Brother! Come no closer! You are not welcome here!’\\n\\n Diligence was still fifty or more steps away, but he halted in obvious surprise.\\n\\n She felt him awakening the sorcery in his voice.\\n\\n And in the moment that he released it, Setoc opened her own throat to the howl of ten thousand ghost wolves.\\n\\n The sound was a detonation, rising up to slam Diligence down on to his back on the earthen steps. In the numbed silence that followed, Setoc shouted again, ‘You are not welcome! Go back to your slaves, Brother!’\\n\\n There was no sign that the Forkrul Assail had heard. He was lying sprawled on the track, unmoving. Shriven were rushing towards him from both sides and from above. In moments they had closed, and then were lifting him up, carrying him back up the steps. \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-370.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
