{"id":102764,"no":371,"title":"Page 371","content":"Satisfied, Setoc turned round.\n The entire Perish army was facing her, every soldier. Among those closest to her, she saw blood at their ears, and trickling down from nostrils. She saw faces that looked bruised, and eyes shot with red. When Setoc spread out her arms again, they visibly flinched back. ‘No foreign magic can compel us,’ she said, and then she pointed. ‘The Mortal Sword approaches. We shall welcome her. And in the making of this day, we shall know our fates.’\n ‘Destriant!’ someone shouted from one of the trenches. ‘Who do we choose? Who do we follow?’\n Tanakalian wheeled round at that, but there was no way to find the speaker amidst the press.\n ‘I am Destriant of the Wolves,’ Setoc replied. ‘I am not a Grey Helm, not a sister to any of you. I am not one of your pack, and in this matter, who is to rule the pack is not for me to say.’\n ‘Who do we fight? Destriant! Who do we fight?’\n Setoc dropped her gaze to Tanakalian, just briefly, and then she answered, ‘Sometimes even wolves know the value of not fighting at all .’\n And there, she had given him what he thought he would need, for the challenge to come. Because Setoc could smell that Mortal Sword, and that woman – that woman was a thing of war .\n Inside, the ghost wolves huddled close, giving her their immeasurable warmth. The echoes of their howl whispered back and forth – even they had been surprised at its power. But I wasn’t. This is my den and we shall defend it .\n Ears ringing at that holy cry, Krughava slowed her mount to a slow canter. Before her, lining the top of the front berm, stood her brothers and sisters – those she had known and loved for years. It was still too far for her to make out their expressions, to see if her arrival was welcome or cause for fury. But even the latter would not dissuade her. She was coming to fight for her people, and for all of Tanakalian’s gleeful mocking of her belief in heroism – and indeed, in heroism lay her one and only true faith – she knew that the next few moments would test her as no battle had ever done.\n If I am to be a hero, if I have such capacity within me, let it come now .\n They said nothing when she reined in at the foot of the mound. Dismounting, Krughava looped the reins about the saddle’s horn, pulled the horse round until it faced the valley once more, and with a hard slap on his rump sent it on its way. Was the gesture lost on the witnesses? No, it most assuredly was not .\n Drawing off her helm, Mortal Sword Krughava swung round and looked up at her estranged brothers and sisters. She raised her voice. ‘I would speak to Shield Anvil Tanakalian.’\n An old veteran replied in a toneless voice, ‘He awaits you within. Come forward in peace, Krughava.’\n They have not chosen a new Mortal Sword … but neither will they give me my old title. So then, it all remains to be decided. So be it .\n A knotted rope slithered down the steep ramp side. She took hold of it, and began climbing.\n Precious Thimble drew closer to Faint’s side. They remained on the valley’s ridge, watching the ranks of Letherii marching down into the basin. Far to their right the Evertine Legion and its auxiliaries were doing the same. All that marching, for this. This and only this. I’ll never understand soldiers .\n ‘Faint?’\n ‘What is it, Precious? You’re going to tell me that you can use all this power, to carve us out a gate back home?’ She glanced over, studied the pale, round face. ‘No, I thought not.’\n ‘What can you feel?’\n Faint shrugged. ‘My skin is crawling, and I’m no mage.’\n ‘Exactly! You have no idea how this is feeling! Even Amby Bole is a mass of nerves, though he won’t talk to me any more. I think he’s become unhinged—’\n ‘He never was hinged in the first place,’ Faint cut in. ‘So, what do you want from me?’\n ‘That boy.’\n ‘What boy?’\n ‘The one half swallowed up by that giant lizard – who did you think I was talking about?’\n Faint twisted kinks from her back, wincing. ‘Fine. What about him? I’ll grant you he’s cute enough, but—’\n ‘You think all this sorcery that’s making us sick is coming from the Assail? You’re wrong .’\n ‘What?’ Faint stared at Precious. ‘Him?’\n ‘It’s only making us sick because he doesn’t know what to do with it.’\n ‘He’s Malazan, isn’t he?’\n ‘I don’t think he’s anything.’\n ‘What’s that supposed to mean?’ \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-371.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
