{"id":102775,"no":382,"title":"Page 382","content":"I have saved my people, my dear soldiers – let them fight on. Let them take breaths, in owning and in release, in all the measures of living. I have done as a prince should do – Tehol, be proud of me. Aranict, do not curse me .\n The sorrow of the ages closed around him. This was one river from which there could be no escape. Do not grieve. We all must come to this place .\n My friends, it is time to leave —\n Impossibly, he felt hands close from behind, hard as iron over his shoulders. And a harsh voice hissed in his ear. ‘Not so fast.’\n Faint stood close to Aranict. The Atri-Ceda was standing, head bowed, her arms out-thrust – but her hands and forearms had vanished inside a billowing, grey-brown cloud, and water was streaming down from her elbows. The air around her was rank, thick with the decay of tidal flats.\n Faint could see the veins standing out on Aranict’s taut neck, could see the muscles of her shoulders straining. And the Atri-Ceda was slowly being pulled forward – whatever was inside that swirling cloud was seeking to drag her into its maw.\n Off to one side, Precious Thimble was on her knees, shrieking without surcease.\n They had seen Brys Beddict, there atop the first earthen embankment – they had seen the standing stones rise from the ground around him, pushing upward through dirt and rocks, almost black with slime and filth. They had seen the prince’s armour and clothing disintegrating, and then on the man’s pallid skin dark swarms – tattoos, runes – emerging only to be torn free, spinning wild around him, and then rushing across, hammering into the Forkrul Assail.\n And then, as if within a whirlwind, Brys Beddict vanished inside swirling gloom that was so thick as to be impenetrable. It spread out, devouring the huge menhirs.\n Aranict now began howling – she was being pulled forward – and Faint suddenly understood. She has him. She has hold of the prince! Gods below —\n Faint staggered towards the Atri-Ceda – but something resisted with devastating pressure, bitter cold, and she was flung back, gasping, spitting out blood. On her hands and knees, she lifted her head and looked across.\n Most of Aranict’s arms had disappeared inside the cloud. And now Faint could make out words in the Atri-Ceda’s cries.\n ‘Mael! Damn you! Help me!’\n Faint crawled over to Precious Thimble. ‘Stop that screaming, witch! Look at me! No, here, look at me!’\n But the eyes that fixed on Faint belonged to a mad woman. ‘I can’t help her! Can’t you see that? She’s gone too far – too deep – how is she even alive? It’s impossible!’ Precious Thimble pulled away, scrabbling like a crab. ‘He’s lost! He’s for ever lost!’\n Faint stared at the witch, as the words slowly sank deep. But that’s not fair. Not a love like that – no! You can’t take it away – don’t you dare kill it! ‘Precious! What can I do? To help? Tell me!’\n ‘Nothing!’\n Go to Hood then .\n She spun round, drawing a dagger. Mael’s an Elder God – but Aranict must understand this. He cannot answer this prayer, not the way it is now. I won’t stand here to see this love die. I won’t . The blade cut a glistening slash along her left arm, and then, fumbling to take the knife in her left hand, she carved deep diagonally across her right forearm. Forcing herself forward, she reached for Aranict.\n Mael – take my blood in offering. Just fucking take it!\n The pressure sought to rebuff her, but she pushed harder – and then she was through, floundering, unable to breathe, the cold crushing her – she saw her blood billowing out as if under water, saw it spin on currents – so much of it – she almost lost sight of Aranict.\n Desperate, feeling her bones cracking, Faint pushed closer, reached out and took the Atri-Ceda into an embrace.\n Mael … don’t you dare … don’t you dare tell me this is not enough .\n Precious Thimble had stared, disbelieving, as Faint struggled to reach Aranict. Her blood was a thick billowing cloud streaming out from her, curling round to whirl into the dark cloud. There seemed to be no end to it.\n Someone had taken hold of the witch – strong arms closing round her, lifting her from the ground. Twisting now, she looked up.\n Amby Bole’s face was almost unrecognizable. ‘This is bad magic,’ he said.\n ‘Save Faint! Save her!’\n But the man shook his head. ‘No one can live in there.’\n ‘Save her, Amby! For my love – save her!’\n His frown deepened, his eyelids suddenly fluttering, and he met her eyes. ‘What?’ \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-382.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
