{"id":102780,"no":387,"title":"Page 387","content":"From all sides voices rose upon seeing him. Grimacing, Brys straightened, and then raised one gauntleted hand. The roar redoubled in its intensity.\\n\\n He saw Grub riding up the slope towards him. The boy didn’t look much like a boy any longer. He was splashed with drying blood, and from somewhere he’d found a Bluerose lance, and its iron point had swum in blood not long past.\\n\\n ‘Prince Brys – I didn’t know you— I mean—’\\n\\n ‘There is little time to waste,’ Brys cut in. ‘I am placing you in command of the relief force. They’re almost assembled – in fact’ – he squinted eastward – ‘they can shake themselves out on the march – the Bolkando are losing ground. Lead them, Commander, and be quick about it.’\\n\\n Grub saluted. ‘Sir, when we close, I may ride ahead.’\\n\\n ‘Would any of us expect otherwise?’ Brys asked. ‘Just don’t get yourself killed.’\\n\\n Nodding, the Malazan youth kicked at the flanks of the Ve’Gath, and the huge beast wheeled round and set off.\\n\\n Faint studied the defenders opposite, watching as they regrouped, drawing reinforcements down from the higher earthworks. ‘They’re going to break cover,’ she muttered. ‘They’re going to charge us.’\\n\\n Precious Thimble glanced over. ‘What? Why would they do that?’\\n\\n ‘Because most of us are headed east, down the valley – they can’t let us chase after their own relieving force. They need to wipe out both the Letherii and the Bolkando.’\\n\\n The witch’s gaze was darting back and forth along the hasty defences thrown up by the Letherii. ‘We’re badly outnumbered.’\\n\\n ‘Haven’t you been paying attention? Assaulting costs dear – we’re about to turn the tables on them, and they’re not going to like it.’\\n\\n ‘It’s only the mixed-bloods who’re keeping them fighting at all,’ Precious said under her breath.\\n\\n ‘What? What did you say?’\\n\\n ‘It’s the mixed-bloods, feeding off this cursed warren – using it to bend the Kolansii to their will. I doubt they’d fight this hard without it.’\\n\\n ‘Now you say all this!’ Faint looked about, saw the prince sitting on a horse twenty paces away, his back to them as he observed the departing companies. Stepping forward, Faint stumbled slightly, recovered. But her head was spinning. ‘What’s wrong with me?’\\n\\n ‘Blood loss,’ snapped Precious Thimble.\\n\\n Hissing in frustration, Faint made her way – slowly – towards Brys Beddict. Find the damned mixed-bloods. Aim a few onagers at them. Tear them to pieces. And this battle is done . ‘Prince Brys!’\\n\\n The man turned his head.\\n\\n Faint hobbled forward. ‘A word with you, Highness …’\\n\\n Ascending a valley side at the run and in full armour left the Perish staggering once they’d reached the top. Heart hammering in the cage of his chest, Syndecan pulled clear of the others and then halted, studying the lay of the land.\\n\\n Shit. It’s all shit .\\n\\n Forty paces away was a raised road, running parallel with the valley, its steep side facing them banked with water-worn stones. In between was a strip of furrowed field, left fallow for two years or more. Off to the right, a hundred paces along, rose a cluster of buildings – farmstead facing on to the field, public stables and inn facing the road.\\n\\n Syndecan continued on, bleakly eyeing the sharp slope of the roadside. Reaching it, he sheathed his sword and scrambled his way to the top.\\n\\n Beyond the road the unplanted fields stretched on for at least a third of a league, broken up by walled hedgerows forming a chaotic patchwork. ‘Now that’s better,’ he grunted. No army would be happy crossing that – the walls alone would slow them up, since they were as high as a man was tall. The Perish could break up into half-cohorts and contest one after another, and by the time the Kolansii won through the battle at the Spire would be long over.\\n\\n Still leaves the road and this side, though. Narrow enough, but where do I weight my defence? Road or field? And what about this infernal stony bank? Can’t defend it worth a damn. That said, trying to breach along it would be a nightmare – until they won through. So I throw a cohort five steps back of the line, waiting for them. We bottle them up, don’t let them spill out to the sides. It’ll work. It’ll have to .\\n\\n Hands on his hips, he turned round, looked down on his Grey Helms. Winded, most of them bent over, or on one knee, gulping air like beached carp. He pointed at the buildings. ‘Wounded go there. Cutters on your way – set up fast as you can. Rest of you, drink down the last of your water if you haven’t already. Chew on some food while you’re at it. We’re going to hold on the road and this side of it – mostly. I want two cohorts on the other side in case they send anyone that way. If they do, make them pay, brothers and sisters. Now, march to twenty paces from the buildings and form up there.’ \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-387.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
