{"id":102793,"no":400,"title":"Page 400","content":"Frozen blood slashed down from the sky. Behind him, the wind brought close the sound of laughter from Olar Ethil. Glancing back, he saw that she was facing the Spire. Absi suddenly wailed. Storii cried, ‘Don’t leave us, Torrent! You promised!’ ‘I will catch you up!’ ‘Torrent!’ ‘ Just run! ’ Taking up Absi in her thin arms, Stavi plucked at her sister’s filthy tunic. And then they were on their way, vanishing in moments as the red sleet intensified, flinging curtains down that rolled deeper inland, one after another. Turning to the east, Torrent stared in astonishment. The entire edge of the headland now sloped steeply towards the bay – but ice was rising beyond that edge, now level with the top of the cliff. Off to his right, the Spire was engulfed in the downpour. Hearing the witch’s laughter again, he looked across to where Olar Ethil stood. But the ancient hag was no more – a young woman stood in the deluge. ‘ Reborn! ’ she shrieked. ‘ My kin – all reborn! I shall lead them – we shall rise again! ’ She spun to face Torrent, blood like paint on her bold features, and then her head darted like a bird’s. ‘Where are they? Where are the children! My gifts to him – and I will give him more! More children! We shall rule together – the Bonecaster and the First Sword – where are they? ’ Torrent stared at her, and then, slipping treacherously on the icy ground, he collected up his bow and quiver. ‘They slid,’ he said. ‘They panicked – went down the slope. Down on to the ice – I couldn’t reach them—’ ‘ You fool! ’ When she ran towards the ice field, Torrent followed. The frozen blood lacerated his face as the wind howled up from the bay. One forearm held up to shield his eyes, he stumbled after Olar Ethil. You will give him more ? Is that what all this was about? You love him? You took his life and made him a thing of skin and bones – you stole his children away – maybe even killed his wife, their mother. You did all this – thinking you could win his heart? But he had seen her – enough of her, anyway. Reborn, made young, she was not displeasing to the eye, solid, full-breasted and wide-hipped, her hair – before the blood soaked it – so blonde it was almost white, her eyes the colour of a winter sky. No longer undead. So too, then, Onos Toolan? Now reborn? She took everything away from him, and would now replace it with herself – with the world she would make . Toc Anaster, did you know this? Did you understand her reasons for all that she has done? Does it matter? He reached the ice – she was still ahead, fleet as a hare as she danced her way down the broken, jagged slope. He thought he could hear her, crying out for the children. Fissures were opening up as the field’s own weight began to crush the ice, and the descent was growing ever steeper – off to his right he could see one part of it still climbing as if would reach to the very summit of the Spire itself. Was there a speck there, halfway up that ramp of ice? Someone ascending? He could not be sure. His feet went out from under him and he slid, rebounding from spars of rock-hard ice. In a blur he was past Olar Ethil, hearing her shout of surprise. His head struck something, spinning him round, and then his feet jammed against a hard edge that suddenly gave way. He was thrown forward, the upper half of his body pitching hard, as what felt like jaws closed on the lower half – snapping shut on his hips and legs. He heard and felt both thigh bones snap. Torrent screamed. Trapped in a fissure, the edges now rising above his hips as he sank deeper. He could feel blood streaming down, could feel it freezing. He had lost grip on his bow and the hide quiver – they lay just beyond his reach. Olar Ethil was suddenly there, standing almost above him. ‘I heard bones break – is it true? Is it true, pup?’ She reached down and took a handful of hair, twisting his torn face around. ‘Is it? Are you useless to me now?’ ‘No, listen – I thought I heard them – the children. Absi – I thought I heard him crying.’ ‘Where? Point – you can still do that. Where? ’ ‘Pull me out, witch, and I’ll show you.’ ‘Can you walk?’ ‘Of course I can, woman – I’m simply jammed in this crack. Pull me out – we can find them! But quickly – this entire field is shattering!’ She cackled. ‘Omtose Phellack in all its glory – yet who dares face it? A Bonecaster, that is who! I will destroy it. Even now, I am destroying it – that fool thinks he will take that wretched heart? I will defy him! He deserves no less – he is Jaghut !’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-400.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
