{"id":102802,"no":410,"title":"Page 410","content":"The Adjunct dismounted, drawing off her leather gloves. ‘Captain.’\\n\\n ‘Aye,’ he replied. ‘It will do.’\\n\\n When Fiddler slipped down from his horse, Banaschar followed suit.\\n\\n The Adjunct in the lead, they ascended the hillside. Now closer to the rotted outcrops, Banaschar saw bleached fragments of human bone trapped in cracks and crevasses, or heaped on ledges and in niches. On the narrow, winding tracks between the up-thrust bedrock, his boots crunched on beads made from polished nuts, and the ground was littered with the withered remnants of woven baskets.\\n\\n Reaching the summit, they saw that the dolomite boulders formed a rough ring, perhaps ten paces across, with the centre area more or less level. When the Adjunct walked between two boulders and stepped into the clearing, her lead boot skidded and she lurched back. Righting herself, she looked down, and then crouched to pick something up.\\n\\n Banaschar reached her side.\\n\\n She was holding a spear point made from chipped flint, almost dagger length, and the priest now saw that the entire stretch of level ground was carpeted in thousands of similar spear points.\\n\\n ‘Left here, all unbroken,’ muttered Banaschar, as Fiddler joined them. ‘Why, I wonder?’\\n\\n The captain grunted. ‘Never could figure out holy sites. Still, those tools are beautifully made. Even an Imass would be impressed.’\\n\\n ‘Here is my guess,’ Banaschar said. ‘They discovered a technology that was too successful. Ended up killing every animal they saw, until none were left. Why? Because we are all equally stupid, just as shortsighted, twenty thousand years ago or tomorrow, makes no difference. And the seduction of slaughter is like a fever. When they finally realized what they’d done, when they all began starving, they blamed their tools. And yet,’ he glanced across at Fiddler, ‘even to this day, we think efficiency’s a good thing.’\\n\\n Fiddler sighed. ‘I sometimes think we only invented war when we ran out of animals to kill.’\\n\\n Dropping the spear point – it broke in half when it struck the layer of its kin – the Adjunct stepped forward. Stone snapped with every stride. When she was at the very centre, she turned to face them.\\n\\n ‘This is not a matter of sacredness,’ she said. ‘There is nothing worth worshipping in this place, except perhaps a past that can never again exist, and the name for that is nostalgia . I am not a believer in innocence, either.’\\n\\n ‘Then why here?’ Banaschar asked.\\n\\n But it was Fiddler who answered, ‘Because it is defendable, Priest.’\\n\\n ‘Demidrek?’ Tavore asked, one hand now on the grip of her sword.\\n\\n He looked round, stepped over to one of the dolomite boulders. Swirling patterns, grooves flowing like hair. Demonic, vaguely human figures, faces composed of staring eyes and open mouths filled with sharp teeth. He sighed, looked back at the Adjunct, and then nodded. ‘She can … I don’t know … wrap herself round the base of this hill, like a dragon-worm of legend, I suppose.’\\n\\n ‘To what end, Demidrek?’\\n\\n ‘Containment.’\\n\\n ‘For how long?’\\n\\n Until she dies . He shrugged.\\n\\n He saw her studying him for a moment longer, and then the Adjunct Tavore drew out her Otataral sword.\\n\\n The rust-coloured blade seemed to blaze in Banaschar’s eyes, and he staggered back a step.\\n\\n Nearby, Fiddler swore under his breath. ‘Adjunct – it’s … awake.’\\n\\n ‘And,’ whispered Banaschar, ‘ it shall summon .’\\n\\n Tavore kicked a space clear on the ground with one boot, and then set the sword’s tip against the earth. She pushed down using all of her weight.\\n\\n The blade slid, as if through sand, down to half its length.\\n\\n Stepping back, the Adjunct seemed to reel.\\n\\n Banaschar and Fiddler reached her at the same time, taking her weight – gods, there is so little left of her! Bones and skin! She slumped unconscious in their arms.\\n\\n ‘Here,’ grunted Fiddler, ‘let’s drag her back – find somewhere clear.’\\n\\n ‘No,’ said Banaschar. ‘I will carry her down to the horses.’\\n\\n ‘Right. I’ll go ahead, get her some water.’\\n\\n Banaschar had picked Tavore up. ‘Fiddler …’\\n\\n ‘Aye,’ he growled. ‘Like a starved child under that armour. When she comes round, Priest, we’re making her eat.’\\n\\n The soldier might as well have said, ‘We’re laying siege to the moon,’ and been absolutely convinced that he would do just that, and then take the damned thing down in ruin and flames. It’s how a soldier thinks. At least, this one, this damned marine . Saying nothing, he followed Fiddler down the narrow, twisting track. \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-410.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
