{"id":102808,"no":416,"title":"Page 416","content":"Maybe the Bridgeburners had been the worst of the lot, but they’d also been the best, too. No, Widdershins liked being a marine, a Bonehunter in the tradition of their unruly predecessors. At least it had put an end to this kind of marching.\n His heels were already bloody in his boots.\n Deadsmell didn’t want to say goodbye, not to anyone. Not even Throatslitter limping one row ahead of him, whom with a choice comment or two he could make yelp that laugh – like squeezing a duck. Always entertaining, seeing people flinch on hearing it. And Deadsmell could do it over and over again.\n It’d been a while since he’d last heard it, but now was not the time – not with all these regulars on either side. All these men and women saying goodbye to us . The Bonehunters were in their last days. This tortured army could finally see the end of things – and it seemed to have come up on them fast, unexpected, appallingly close.\n But no. We marched across half a world. We chased a Whirlwind. We walked out of a burning city. We stood against our own in Malaz City. We took down the Letherii Empire, held off the Nah’ruk. We crossed a desert that couldn’t be crossed .\n Now I know how the Bridgeburners must have felt, as the last of them was torn down, crushed underfoot. All that history, vanishing, soaking red into the earth .\n Back home – in the Empire – we’re already lost. Just one more army struck off the ledgers. And this is how things pass, how things simply go away. We’ve gone and marched ourselves off the edge of the world .\n I don’t want to say goodbye. And I want to hear Throatslitter’s manic laugh. I want to hear it again and again, and for ever more .\n Hedge had drawn up his Bridgeburners just outside the northwest edge of the encampment. Waiting for the marines and heavies to appear, he scanned his collection of soldiers. They were loaded down, almost groaning beneath the weight of their gear. Way too many kittens .\n Sergeant Rumjugs caught his eye and he nodded. She moved up to position herself at his side as he turned to face the Bonehunter camp. ‘Ever seen the like, sir? Who do you think gave the command for that? Maybe the Adjunct herself?’\n Hedge shook his head. ‘No commands, Sergeant – this came from somewhere else. From the regulars themselves, rank and file and all that. I admit it, I didn’t think they had this in them.’\n ‘Sir, we heard rumours, about the marines and heavies … that maybe they won’t want us with them.’\n ‘Doesn’t matter, Sergeant. When it comes right down to it, we don’t even take orders from the Adjunct.’\n ‘But didn’t she—’\n ‘I lied,’ Hedge said. ‘I ain’t talked to nobody. This is my decision.’ He glanced over at her. ‘Got a problem with that, Sergeant?’\n But she was grinning.\n Hedge studied her. ‘You find that funny, do you? Why?’\n She shrugged. ‘Sir, we heard rumours – other ones – about us not being real Bridgeburners. But you just proved ’em wrong, didn’t you? We don’t belong to nobody – only to each other, and to you, sir. You lied – hah!’\n Behind them Sweetlard said, ‘Last night I took a man t’bed for free, sir, and y’know why? When he asked me how old I was and I said twenty-six, he believed me. Lies are sweet, ain’t they?’\n ‘Here they come,’ said Hedge.\n Fiddler had appeared, leading his troops out from the camp. Even from this distance, Hedge could see the faces of the marines and heavies – sickly, grim. They’d not been expecting any sort of send-off. And they don’t know what to do with it. Did Fiddler throw a salute back? No, he wouldn’t have .\n Fid, I see you. You’re as bad off as the rest of ’em. Like you’re headed for the executioner .\n Us soldiers only got one kind of coin worth anything, and it’s called respect. And we hoard it, we hide it away, and there ain’t nobody who’d call us generous. Easy spenders we’re not. But there’s something feels even worse than having to give up a coin – it’s when somebody steps up and tosses one back at us .\n We get antsy. We look away. And part of us feels like breaking inside, and we get down on ourselves, and outsiders don’t understand that. They think we should smile and wave or stand proud. But we don’t want to do anything of the sort, even when we’re made to. It’s because of all the friends we left behind, on all those battlefields, because we know that they’re the ones deserving of all that respect .\n We could sit on a king’s hoard of those coins and still stay blind to all of ’em. Because some riches stick in the throat, and choke us going down . \n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-416.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: \n The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\n \n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
