{"id":102815,"no":423,"title":"Page 423","content":"‘Understood, Sister Freedom. Then, might I suggest the following? That Brother Grave divide his army on the basis of speed of travel. That he personally lead his light and medium infantry not northwestward, but southwest skirting the force you and I shall engage, and then striking due north behind said enemy; while in turn his heavy infantry take the shorter northwest route – being heavy infantry, they can well successfully withstand incursions by cavalry should the unexpected happen. If led by the purest of the Watered, the heavy infantry element can coordinate their arrival at the target to coincide with Brother Grave’s own companies, as rudimentary communication should be possible.’ Sister Freedom turned to Brother Grave. ‘Does this suit you, Brother?’ ‘Light and medium elements constitute a little over two thousand soldiers – my force was ever weighted on the heavier elements, organized as it originally was for sieges and set battles. Sister Freedom, how accurate is your gauging of the complement of this smaller enemy force?’ ‘No more than a hundred, I believe, Brother Grave.’ ‘Well then.’ The man smiled, face folding with the expression. ‘Two thousand against a hundred. Will you both forgive me for a small measure of confidence regarding those odds?’ Brother Aloft said, ‘Since we are certain that there is nothing like a pass or any other similar feature into which to force attackers, then I cannot but share your confidence, Brother Grave. At best, the enemy will be defending a hill – perhaps one of the ancient Elan barrow camps – and so can be attacked from all sides. And of course, even should the light and medium forces fail, the heavy infantry companies will rejoin you and thereby contribute to subsequent assaults. Given all this, I believe we have successfully addressed the matter of the smaller enemy force.’ Aloft faced Freedom. ‘Only a hundred, you say? Perhaps they are deserters.’ ‘It is possible,’ she conceded. ‘Yet my instincts say otherwise.’ ‘With vehemence?’ She glanced at him. ‘Yes, Brother Aloft, with vehemence.’ ‘Then, if I may,’ said Aloft, ‘we should perhaps discuss another concern. The third force, which has so thoroughly negated our efforts at defeating or even containing it, is now marching with the clear intention of joining this battle – though as you say, Sister, they will be too late. My thoughts are these: it is too great a reach to imagine that there has been no coordination here. To begin, the strongest fortress in Estobanse is taken, thus threatening our north and, more important, our primary source of food, being the valley province. We respond by sending armies against them, only to have them crushed. Now, from what we are able to glean from Sister Reverence and Brother Diligence, at the Spire, two distinct elements have engaged us from the south. And we of course now march to block an incursion from the west. For all we know, a foreign fleet is even now entering Kolanse Bay.’ He surveyed the expressions before him and slowly nodded. ‘This was well planned, do you not agree? Its principal aim, to draw apart our active armies, has already succeeded. In each instance, we are forced to react rather than initiate.’ ‘A proficient high command, then,’ said Sister Freedom, nodding. But Aloft shook his head. ‘In truth, this has the feel of a grand strategy, and just as your instincts speak with vehemence to you about the matter of the smaller force, Sister Freedom, so now my instincts have been shouting that this invasion – this strategy and each and every tactical engagement – is in fact the product of a single individual’s will.’ He nodded to Brother Grave. ‘I accept your assessment of humans, in general. But is it not also true that, on rare occasions, there rises from the multitude of mediocrity that is humanity a single person of extraordinary vision conjoined with the will to achieve that vision, who presents a most formidable presence. One to shape the course of history.’ Brother Grave grunted. ‘Charismatic tyrants, you mean. Indeed, they do appear from time to time, burning bright and deadly and expunged just as quickly. Such individuals, among humans, are inevitably self-corrupting, and for all that they may shape history, that shaping is more often than not simply born out of that tyrant’s indulgence in destruction. Brother Aloft, you may well be right that we face such a person behind all of this. But does it matter in the end? And is it not that unbridled ambition that assures the fool’s demise? I would venture, with considerable amusement, that we now represent that fatal overreaching on that tyrant’s part.’ He faced Sister Freedom. ‘Have you not confirmed that the northern threat is too far away? This grand execution of coordinated invasions has failed, in fact.’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-423.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
