{"id":102826,"no":435,"title":"Page 435","content":"They all hurt you .\\n\\n I was nothing. A Trell youth among a dying people. Nothing .\\n\\n My friend. I am sorry .\\n\\n She crushed his windpipe. She crushed every bone in his neck. Her fingers pushed through wrinkled, slack skin – skin that felt like worn deerhide – and the blood welled out.\\n\\n His dead eyes stared up at her from a blackened face, a face now frozen in a peculiar expression of sorrow. But she would give that no thought. Just one more warrior cursed to fail. The world was filled with them. They littered battlefields. They marched into the fray beating time with swords on shields. But not for much longer.\\n\\n He is mine. I will awaken him now – I will free him to kill this world .\\n\\n A sound to her left, and then a voice. ‘That’s not nice.’\\n\\n She twisted, to fling herself away, but something massive slammed into the side of her head, hard enough to lift her from the ground, spin her in the air.\\n\\n Calm landed on her right shoulder, rolled and came to her feet. Her face – her entire head – felt lopsided, unbalanced.\\n\\n The backswing caught her left hip. Shards of jagged bone erupted from her pelvis. She folded around the blow, pitched headfirst downward, and once more landed hard. Fought to her knees, stared up with her one working eye to see a Toblakai standing before her.\\n\\n But you freed me!\\n\\n No. You’re not him. That was long ago. Another place – another time .\\n\\n ‘I don’t like fighting,’ he said.\\n\\n His next swing tore her head from her shoulders.\\n\\n ‘Brother Grave?’\\n\\n ‘A moment.’ The Forkrul Assail stared at the distant knot of hills. This is where the cloud of birds descended. I see … shapes, there, upon the flanks of the Elan barrow . He spoke to the High Watered at his side. ‘Do you see, Haggraf? We will now encircle – but maintain our distance. I want us rested before we strike.’\\n\\n ‘Perhaps we should await the heavy infantry, Pure. They have prepared for us on that barrow.’\\n\\n ‘We will not wait,’ Grave replied. ‘That hill is not large enough to hold a force of any appreciable threat. Before dawn, we shall form up and advance.’\\n\\n ‘They will surrender.’\\n\\n ‘Even if they do, I will execute them all.’\\n\\n ‘Pure, will you make them kneel before our blades?’\\n\\n Brother Grave nodded. ‘And once we are done here, we shall return to Brother Aloft and Sister Freedom – perhaps the enemy they have now found will prove more of a challenge. If not, we will form up and march our three armies north, to eliminate that threat. And then … we shall retake the Great Spire.’\\n\\n Haggraf strode off to relay the orders to the company commanders.\\n\\n Brother Grave stared at the distant barrow. At last, we will end this .\\n\\n Vastly Blank stepped down from the boulder, and then sat to adjust the leather bindings protecting his shins.\\n\\n Fiddler frowned down at the heavy, and then across at Badan Gruk.\\n\\n The sergeant shrugged. ‘Just our luck, Captain, that it’s him got the best eyes here.’\\n\\n ‘Soldier,’ said Fiddler.\\n\\n Vastly Blank looked up, smiled.\\n\\n ‘Captain wants to know what you saw from up there,’ Badan Gruk said.\\n\\n ‘We’re surrounded.’ He began pulling at a torn toenail.\\n\\n Fiddler made a fist, raised it for a moment, and then let his hand fall to his side again. ‘How many?’\\n\\n Vastly Blank looked back up, smiled. ‘Maybe three thousand.’ He brought up most of the nail, which he’d prised off, and squinted at it, wiping the blood away.\\n\\n ‘And?’\\n\\n ‘Banded leather, Captain. Some splint. Not much chain. Round shields and spears, javelins, curved swords. Some archers.’ He wiped more blood from the nail, but it was still mottled brown.\\n\\n ‘They’re getting ready to attack?’\\n\\n ‘Not yet,’ Vastly Blank replied. ‘I smell their sweat.’\\n\\n ‘You what?’\\n\\n ‘Long march.’\\n\\n ‘Best nose, too,’ Badan Gruk offered.\\n\\n Vastly Blank popped the nail into his mouth, made sucking sounds.\\n\\n Sighing, Fiddler moved away.\\n\\n The sky to the east was lightening, almost colourless, with streaks of silver and pewter close to the horizon. The sound of the Kolansii soldiers was a soft clatter coming at them from all sides. The enemy taking position, readying shields and weapons. Ranks of archers were forming up, facing the hill.\\n\\n Sergeant Urb heard Commander Hedge talking to his own dozen or so archers, but couldn’t quite make out what he was saying. Shifting his heavy shield, he edged closer to where Hellian sat. He couldn’t keep his eyes from her. She is so beautiful now. So pure and clean and the awful truth is, I liked her better when she looked like a bird that’s flown into a wall. At least then I had a chance with her. A drunk woman will take anyone, after all, so long as they clean up after them and take care of them, and got the coin for more to drink . \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-435.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
