{"id":102835,"no":444,"title":"Page 444","content":"It’s a warm day. Nothing to slip on. No numbness to steal all feeling from my hands. No raw patches where my skin has torn away at the touch of metal . I have faced worse. Remember that – it’s what has kept you going battle after battle . The Forkrul Assail was walking ahead of her troops now, up towards a low rise. Faradan Sort suddenly looked down, studied the yellow, brittle grasses, the countless rodent holes. ‘Soldiers – anyone see any scorpions hereabouts?’ A chorus of grunts answered her, all in the negative. ‘Good. That will do, then. Shields high – seems she’s got something to say to us!’ Gods, this is where it gets unfair . Smiling, Sister Freedom studied the enemy forces. Ah, we were wrong. They are not moments from routing . There was rage and stolid determination in the faces across from her, but none of that would help – not now. Shields and armour would resist the power she was about to unveil, would protect them – for a time. Perhaps a handful of heartbeats. But then her voice would tear through, claw away skin and muscle, spray blood into the air. Bones would snap, skulls would shatter. They were all about to die, and nothing they did would prevent that. As here, so too the rest of the world . Glancing to her left, she saw the centre advancing – now less than thirty paces distant from the motionless line of defenders. Archers were loosing arrow upon arrow, with the enemy’s own archers countering here and there. Soldiers were falling, though for most shields fended off the deadly rain. Twelve paces, and then the charge. Its weight will drive them back, break up that facing line, and into the gaps we will pour, splitting the formation apart. And then will come the slaughter . Returning her attention to the flank opposite her, she raised her arms, began drawing breath. The flint sword that erupted from the ground beneath the Forkrul Assail ripped into the inside of her left thigh, lifting her into the air as the tip cracked and pierced her hip bone. As its wielder rose in a shower of earth, stones and roots, others burst from the ground surrounding the Forkrul Assail. Weapons hammered into her. Howling, writhing still on that sword, she lashed out. The back of one hand struck the forehead of Urugal the Woven, collapsing it inward, pitching the T’lan Imass from its feet. Kalt Urmanal’s bone mace caught the Forkrul Assail under her left arm, spun her entirely around, boots skyward, and off from the skewering sword. She landed with a roar, surging back to her feet. Beroke’s obsidian-tipped spear slid through her, exploding out from her lower belly. Twisting round, the Assail grasped hold of the spear shaft and lifted it into the air, taking Beroke with it. Releasing the wood, she reached up to trap Beroke’s skull between her hands as he slid closer to her. With a bellow she crushed the warrior’s skull. In her mind, Sister Freedom shouted commands to her officers. ‘ Charge the enemy – break through and encircle them! Kill every damned one of them! Leave these bone-bags to me! ’ The T’lan Imass with the crumpled forehead came towards her again. Snarling, she flung herself at him. Blistig could feel the desperate rage growing in him, and as the enemy ranks suddenly seemed to build like a rising wave and rush howling towards him, he screamed his own fury. The collision lifted soldiers from their feet, shoved them into the air. Blood misted, weapons hammered down, and the front ranks of the Malazans recoiled, and then stiffened. The clamour was deafening – weapons and shrieks – and the world was crazed before the Fist’s eyes, frantic with motion, the flash of faces, teeth bared, sudden gushes of blood from mouths and gaping throats. Bodies pushing up against his shins. Staggering, flaying with his sword, buffeted by repeated blows against his shield, Blistig fought with the ferocity of a rabid dog. He was going to die. They wanted to kill him – every damned one of them wanted to kill him, drag him down, trample his corpse. His life wasn’t supposed to end like this. He would fight, and fight. This was not going to be the end – he wouldn’t let it. I will not let it! Chaos spun wild around him and the soldiers pressing against his sides. They were pushed back another step. Lostara Yil moved up alongside the Adjunct, drawing her swords. Another dance. All I can do. The dance of the world – this fucking, miserable, murderous world . She saw Ruthan Gudd take Tavore’s other flank, and behind her she could hear Henar Vygulf – the fool was singing some damned Bluerose sea shanty. Ahead, advancing now, leaning forward and striding on stiff legs like a madman, came the Forkrul Assail. His eyes were feral and they were fixed on the Adjunct.","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-444.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
