{"id":102846,"no":455,"title":"Page 455","content":"Tears now in Fiddler’s eyes – wiping them frantically – but the laughter went on.\\n\\n And on.\\n\\n Smiles looked over at the others in her squad, saw them doubling over, saw faces flushed and tears streaming down. Bottle. Koryk. Even Tarr. And Smiles … smiled.\\n\\n When her squad-mates saw that, they convulsed as if gut-stabbed.\\n\\n Lying jammed in a crack between two stones a third of the way down the slope, half buried beneath Kolansii corpses, and feeling the blood draining away from the deep, mortal wounds in his chest, Cuttle heard that laughter.\\n\\n And in his mind he went back, and back. Childhood. The battles they fought, the towering redoubts they defended, the sunny days of dust and sticks for swords and running this way and that, where time was nothing but a world without horizons – and the days never closed, and every stone felt perfect in the palm of the hand, and when a bruise arrived, or a cut opened red, why he need only run to his ma or da, and they would take his shock and indignation and make it all seem less important – and then that disturbance would be gone, drifting into the time of before, and ahead there was only the sun and the brightness of never growing up.\\n\\n To the stones and sweat and blood here in his last resting place, Cuttle smiled, and then he whispered to them in his mind, You should have seen our last stands. They were something .\\n\\n They were something .\\n\\n Darkness, and then brightness – brightness like a summer day without end. He went there, without a single look back.\\n\\n Lying beneath the weight of the chains, the Crippled God, who had been listening, now heard. Long-forgotten, half-disbelieved emotions rose up through him, ferocious and bright. He drew a sharp breath, feeling his throat tighten. I will remember this. I will set out scrolls and burn upon them the names of these Fallen. I will make of this work a holy tome, and no other shall be needed .\\n\\n Hear them! They are humanity unfurled, laid out for all to see – if one would dare look!\\n\\n There shall be a Book and it shall be written by my hand. Wheel and seek the faces of a thousand gods! None can do what I can do! Not one can give voice to this holy creation!\\n\\n But this is not bravado. For this, my Book of the Fallen, the only god worthy of its telling is the crippled one. The broken one. And has it not always been thus?\\n\\n I never hid my hurts .\\n\\n I never disguised my dreams .\\n\\n And I never lost my way .\\n\\n And only the fallen can rise again .\\n\\n He listened to the laughter, and suddenly the weight of those chains was as nothing. Nothing .\\n\\n ‘They have resurr—’ Brother Grave stopped. He turned, faced the dark hill.\\n\\n Beside him, High Watered Haggraf’s eyes slowly widened – and on all sides the Kolansii soldiers were looking up at the barrow, the weapons in their hands sagging. More than a few took a backward step.\\n\\n As laughter rolled down to them all.\\n\\n When Brother Grave pushed harshly through the soldiers, marching towards the corpse-strewn foot of the hill, Haggraf followed.\\n\\n The Pure halted five paces beyond the milling, disordered ranks, stared upward. He flung Haggraf a look drawn taut with incredulity. ‘Who are these foreigners?’\\n\\n The High Watered could only shake his head, a single motion.\\n\\n Brother Grave’s face darkened. ‘There are but a handful left – there will be no retreat this time, do you understand me? No retreat! I want them all cut down!’\\n\\n ‘Yes sir.’\\n\\n The Forkrul Assail glared at the soldiers. ‘Form up, all of you! Prepare to advance!’\\n\\n Suddenly, from the hill, deathly silence.\\n\\n Brother Grave smiled. ‘Hear that? They know that it is over!’\\n\\n A faint whistling in the air, and then Haggraf grunted in pain, staggering to one side – an arrow driven through his left shoulder.\\n\\n Brother Grave spun to him, glared.\\n\\n Teeth clenching, Haggraf tore the iron point from his shoulder, almost collapsing from the burst of agony as blood streamed down. Staring down at the glistening sliver of wood in his hand, he saw that it was Kolansii.\\n\\n Snarling, Brother Grave wheeled and forced his way back through the press of soldiers. He would join this assault – he would ride his Jhag horse to the very top, cutting down every fool who dared stand in his way.\\n\\n In his mind, seeping in from the soldiers surrounding him, he could hear whispers of dread and fear, and beneath that palpable bitterness there was something else – something that forced its way through his utter command of their bodies, their wills.\\n\\n These were hardened veterans, one and all. By their hands they had delivered slaughter, upon foes armed and unarmed, at the command of the Forkrul Assail. They had been slaves for years now. And yet, like a black current beneath the stone of his will, Brother Grave sensed emotions that had nothing to do with a desire to destroy the enemy now opposing them. \\n\\n","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-455.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. \\n Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. \\n Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.\\n","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
