{"id":102458,"no":55,"title":"Page 55","content":"Cuttle snorted. ‘Hardly. You went forward, no different from any fist I ever seen.’ ‘I went forward to stand still, sapper.’ ‘Well, that’s a good point,’ Cuttle conceded. ‘I stand corrected, then.’ ‘I just realized something,’ said Smiles. ‘We got no sergeant any more. Unless it’s you, Tarr. And if that’s the case, then we need a new corporal, and since I’m the only one left with any brains, it’s got to be me.’ Tarr scratched at his greying beard. ‘Was thinking Corabb, actually.’ ‘He needs his own private weapons wagon!’ ‘I kept my Letherii sword,’ Corabb retorted. ‘I didn’t lose anything this time.’ ‘Let’s vote on it.’ ‘Let’s not, Smiles,’ said Tarr. ‘Corabb Bhilan Thenu’alas, you’re now the Fourth Squad’s corporal. Congratulations.’ ‘He’s barely stopped being a recruit!’ Smiles scowled at everyone. ‘Cream will rise,’ said Cuttle. Koryk bared his teeth at Smiles. ‘Live with it, soldier.’ ‘I’m corporal now,’ said Corabb. ‘Did you hear that, Shortnose? I’m corporal now.’ The heavy looked up from his cup. ‘Hear what?’ Losing Bottle had hurt them. Cuttle could see that in their faces. The squad’s first loss, at least as far as he could recall. First from the originals, anyway. But the loss of only one soldier was pretty damned good. Most squads had fared a lot worse. Some squads had ceased to exist. Some? More like most of ’em . He settled back against a spare tent’s bulky folds, watched the others covertly. Listened to their complaints. Koryk was a shaken man. Whatever spine of freedom there’d once been inside him, holding him up straight, had broken. Now he wore chains inside, and they messed with his brain, and maybe that was now permanent. He drank from a well of fear, and he kept on going back to it. That scrap back there had been horrible, but Koryk had been stumbling even before then. Cuttle wondered what was left of the warrior he’d once known. Tribals had a way of kneeling to the worst vicissitudes of civilization, and no matter how clever the cleverest ones might be, they often proved blind to what was killing them. Maybe no different from regular people, but, to Cuttle’s mind, somehow more tragic. Even Smiles was slowly prising herself loose from Koryk. She hadn’t changed, Cuttle decided. Not one whit. As psychotic and murderous as ever, was Smiles. Her knife work had been vicious, down there beneath the swing of the lizards’ weapons. She’d toppled giants that day. For all that, she’d make a terrible corporal. Tarr had been Tarr. The same as he always was and always would be. He’d be a solid sergeant. Perhaps a tad unimaginative, but this squad was past the need for anything that might shake it up. And we’ll follow him sharp enough. The man’s a bristling wall, and when that helm of his settles low over his brow, not a herd of charging bhederin could budge him. Aye, Tarr, you’ll do just fine . Corabb. Corporal Corabb. Perfect . And now Shortnose. Sitting like a tree stump, flattened blisters weeping down his hand. Drinking that rotgut Smiles had brewed up, a half-smile on his battered face. You ain’t fooling me, Shortnose. Been in the army way too long. You love the thick-skull stuff, you heavies all do. But I see the flick of those tiny eyes under those lids . ‘ Hear what?’ Nice one, but I saw the spark you tried to hide. Happy to be here, are you? Good. Happy to have you . As for me, what have I learned? Nothing new. We got through it but we got plenty more to get through. Ask me then. Ask me then . He glanced over to see Fiddler arriving. Only the neck of his fiddle left, hanging down his back, kinked strings sprung like errant hairs. Most of the red gone from his beard. His short sword’s scabbard was empty – he’d left the weapon jutting from a lizard’s eye socket. The look in his blue eyes was cool, almost cold. ‘Sergeant Tarr, half a bell, and then lead them to the place.’ ‘Aye, Captain.’ ‘We got riders coming up from the south. Perish, a few Khundryl, and someone else. A whole lot of someone else.’ Cuttle frowned. ‘Who?’ Fiddler shrugged. ‘Parley. We’ll find out soon enough.’ ‘Told you you’d live.’ Henar Vygulf smiled up at her from where he lay on the cot. But it was an uncertain smile. ‘I did what you asked, Lostara. I watched.’","sourceLink":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10/page-55.html","bookId":2012,"book":{"id":2012,"title":"The Crippled God (The Malazan Book of the Fallen #10)","description":"Storyline: The Bonehunters march for Kolanse, led by Adjunct Tavore. This woman with no gifts of magic, deemed plain, unprepossessing, displaying nothing to instill loyalty or confidence, will challenge the gods - if her own mutinous troops don\u0027t kill her first. Her enemy, the Forkrul Assail, seek to cleanse the world, to annihilate everything. In the realm of Kurald Galain, home to the long lost city of Kharkanas, a refugees commanded by Yedan Derryg, the Watch, await the breaching of Lightfall, and the coming of the Tiste Liosan. In this war they cannot win, they will die in the name of an empty city and a queen with no subjects. Elsewhere, the three Elder Gods, Kilmandaros, Errastas and Sechul Lath, work to shatter the chains binding Korabas, the Otataral Dragon. Against her force of utter devastation, no mortal can stand. At the Gates of Starvald Demelain, the Azath House sealing the portal is dying. Soon will come the Eleint, dragons, and a final cataclysm.","cover":"https://allnovel.net/images/the-crippled-god-the-malazan-book-of-the-fallen-10.jpg","author":"Steven Erikson","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-crippled-god-the-malazan-book-of-the-fallen-10.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:47:48 PM"}}
