{"id":106114,"no":47,"title":"Page 47","content":"Nothing Lynn Peyer Whatever Whatever Matousek had told me proved that Jack Barrett had murdered Elizabeth. I could see why she believed it, why she wanted to believe it. Others in Victoria probably believed it, too. Yet the question remained: Who sent the e-mail? I didn’t think it was Lynn. She didn’t strike me as the e-mail type. If she had decided to threaten Governor Barrett, she would have done so far less subtly and at a much greater volume. Besides, how could she have possibly learned Lindsey Bauer’s private e-mail address? I crossed her name off my list of likely suspects, but lightly, and in pencil.\n I was idling at the intersection waiting on the light, debating which way to turn next. The traffic had an anxious feel to it, like all the drivers were afraid they were missing appointments. A black Mercedes pulled next to me, the engine revved impatiently. It was a new SLK 320 convertible with the top up, costing about the same as my car. I had taken a look at one a few months back before buying the Audi.\n I recognized the driver immediately. Coach Testen. We glanced at each other and I nodded my head in greeting. He looked away. Was the snub intentional or did he simply not notice me?\n The light changed and he was off in a hurry. I watched the Mercedes disappear around a corner.\n A few minutes later I was on a county road heading out of town toward the South Dakota border. Both Lynn Matousek and Mrs. Rogers had asked why I cared about what had happened to Elizabeth. I wasn’t sure myself. She wasn’t the reason I had come to Victoria, although I was beginning to think she was the reason I was sent here. At the same time, it felt as if her eyes were watching me from on high as I drove Victoria’s back roads. Perhaps she had been searching for someone to speak for her after all these years and finally found a man who might manage it. It was an incredibly arrogant thing for me to think, I know. Yet the idea pleased me just the same. It made me feel important.\n At the same time, I recalled what Mrs. Rogers had said earlier. “Perhaps you were sent by God.”\n “Yeah, right. Me and God.” I crossed my fingers. “We’re like this.”\n I still had the map of the greater Victoria area that I had purchased at the convenience store and was now following it to the Hugoson farm. It was only 4:30 P.M., but dusk was already gathering. By five the sun would set. I had hoped to arrive at my destination before then. As it turned out, I drove past the farm and was nearly two miles down the road before I realized my mistake and doubled back.\n I couldn’t estimate the size of the Hugoson farm. It seemed huge, its snow-covered fields stretching toward the setting sun. The farm’s driveway, however, was about two hundred yards long and plowed to the dirt. It started at the county blacktop and rose up a slight incline to a white two-story house with blue shutters that were badly in need of paint. There were two large pole barns flanking the house, both made of sheet metal. The driveway ended in a kind of courtyard framed by the three structures. I parked in the center, turned off the engine, and slid out of the Audi. The huge door to the nearest pull barn was open and I moved toward it. A hard crust had formed on the snow. It made each step sound like I had dropped my car keys.\n Just inside the door, I could see the back end of a dark blue pickup. I called out and a man dressed for a tedious day’s work in the hard cold stepped around the truck and into the courtyard.\n I recognized him instantly. I had been trained by experience to recognize him by the way he restricted his movements, not turning his head or gesturing with his hands, relying on peripheral vision instead of normal eye movement. I recognized the way he controlled the muscles that gave his face expression and spoke in a restrained conversational range, neither low nor loud, excited nor dull. He was an ex-con, someone who had done the kind of time measured by many wall calendars.\n “Mr. Hugoson?” I asked.\n “Whatever you’re sellin’ I ain’t interested in buyin’ and by the looks of that car of yours, I doubt I could afford it, anyway.”\n “My name’s McKenzie. I’d like to talk to you about—”\n “I know what you want to talk about and I ain’t havin’ none of it. Get off my property.”\n “Mr. Hugoson—”\n “You don’t hear real good, do you, boy?”\n He stepped nearer. Somehow he seemed to expand, becoming larger, straighter, harder, with eyes that held all the warmth of an ice pick. He stared at me without blinking so I would know that he was a dangerous man and certainly not squeamish about assaulting a trespasser. It was unnecessary. I already knew he was a dangerous man. I took a step backward as my right hand moved slowly to the spot on my hip where I would have holstered my gun if I hadn’t been so careless as to leave it in my glove compartment.\n “News travels fast in a small town,” I said.\n “Bad news does.”\n I turned to my right, but he was quicker, moving so that the setting sun was at his back and shining directly into my eyes.\n “Why are you afraid to talk to me?”\n Hugoson strung together a half dozen altogether filthy obscenities that suggested he wasn’t afraid of anything, much less a big city punk of dubious sexual orientation.\n","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-47.html","bookId":2223,"book":{"id":2223,"title":"Pretty Girl Gone (Mac McKenzie #3)","description":"Storyline: \n Rushmore \"Mac\" McKenzie has a lot of old girlfriends, but only one went on to marry the current governor of the state of Minnesota. And only one is calling him with a desperate request to meet in secret. First Lady Lindsay Barrett is carrying an anonymous e-mail that contains the makings of an ugly rumor about her husband, the man about to run for higher office---perhaps even the highest office. Someone says they have evidence that Jack Barrett killed his high school sweetheart. Lindsay says it\u0027s an outright lie, but the truth lies buried decades in the past in the small town where the governor grew up. \n Of course, Mac, who\u0027s richer than he needs to be and always has plenty of time on his hands, is in the business of handling such matters for his friends. So he packs up and drives straight into the governor\u0027s past with the brilliantly conceived plan to poke around and see if he can stir up a little information. He\u0027s soon got goons of all sorts poking him back, including a nasty little group of political movers and shakers who aren\u0027t above kidnapping and murder to protect their interests. It\u0027s clear that his little plan has stirred up nothing but trouble. \n With no choice but to stick to it, he continues shifting through a complex web of interlocking secrets and lies, some decades old and some rooted violently in the present day. It\u0027s up to Mac to sort truth from untruth before a vicious rumor becomes a political nightmare---or worse, before the \"outright lie\" is proved a solid, irrefutable fact.\n \n","cover":"https://allnovel.net/images/pretty-girl-gone-mac-mckenzie-3.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:48:58 PM"}}
