{"id":106119,"no":52,"title":"Page 52","content":"“These days? These days he’s—I’m not sure what you’d call him. Not a gambler, anyway. What Josie does, he goes around to all the bars in the county, every place that sells pull tabs. In Minnesota, the winning tabs must be posted—it’s the law—so a guy can look at a box and determine how many winning tabs are still left to be pulled. Sometimes you can get a box that’s maybe a quarter full or less, except the big winners, they haven’t been pulled yet. What Josie does, he looks for these boxes. When he finds one, he determines if the total amount of the winners still left in the box is worth more than the cost of all the remaining tabs. If it is, well then he just buys the entire box, guaranteeing himself a nice payday. “Problem is, it’s expensive. A box, even a quarter box, might cost a couple of thousand dollars and it’s illegal to buy pull tabs with a check or credit card, so Josie has to carry a lot of cash with him. Two, three, four thousand.” “Flashing that kind of money is dangerous,” I said. “Tell me about it. And Josie, he’s not what you’d call retiring.” “I’ve noticed.” “People know him. They know what he does, and most people, the people buying the pull tabs, they don’t like it much when he just swoops in and grabs all the winners. This one time these guys jump him in his driveway—he’s got a place out on the county road, kinda isolated. One night these guys jump him, steal about a thousand dollars. Josie, though, he hid most of his money—as much as five grand he said—in his boots. Problem was, next day he goes around bragging about it, telling how he outfoxed the muggers. So, what happens . . .” “Let me guess.” “Same guys jump him again a couple nights later. Only this time they take all of his money and his boots.” “Surprise, surprise, surprise,” I said. “Ah, Josie. What a guy.” “Where does he get his seed money?” “Who knows? Hey, Josie.” Bloom had returned. If anything, he appeared even worse off than when he left. His face was paler, his eyes flat and expressionless, and he continued to scratch his hands and face. He looked as though he had as much future as a lighted match. “Whaddaya say?” Axelrod said. “It’s a dog-eat-dog world out there Nick, ’cept when it’s the other way round.” “I hear that.” “ ’Bout that drink.” “Dinner should be ready in a jiff.” Axelrod came around the bar and took Bloom by the arm. “I have a nice booth for you. Sit here and Jace will be with you in a minute.” Bloom pulled his arm away. Axelrod nudged him hard and Bloom half sat, half fell into the booth. He leaned both elbows on the table and held his head. “Christ, Nick.” Axelrod excused himself so he could tend bar. At the same time, someone had pumped a fistful of quarters into the jukebox. The music—some country hokum about the appeal of women who drove pickup trucks—filled the room, causing everyone to raise their voices. Bloom sat unmoving in the booth, supporting his head with both hands. I glanced at Axelrod. As soon as his back was turned I motioned to the other bartender and asked him to pour a shot of rye whiskey and a beer chaser. I took both to Bloom, set them on the table in front of him. He looked at me, focusing his eyes like I was someone he’d met before but couldn’t place. “May I join you, Mr. Bloom?” His little eyes blinked at me a couple of times without seeing me. Maybe he hadn’t heard me. Maybe I wasn’t there. I sat across from him, setting my own drink on the table’s edge. He didn’t seem to notice. Instead he took down the shot in one long swallow and sighed like a tire with a slow leak. I had pounded them myself from time to time, only not like that. Never like that. I wondered what kind of pain would make a man drink the way Josiah Bloom drank? Or was it pain? Maybe it was just habit. “I’d like to ask you about Elizabeth Rogers,” I said. Bloom cupped both hands around the glass of beer, inhaled deeply, and drank. He drank half the beer and when he set the glass down again, he exhaled and coughed, as if the few seconds he had held his breath had nearly suffocated him. “This can’t go on,” he said. “What can’t go on?” I asked. In reply, Bloom drained the beer and motioned for more. I caught the younger bartender’s eye and another rye and beer were served. Bloom guzzled the rye. I drank half my Scotch. “You shouldn’t drink like that,” Bloom told me suddenly. “It’s not good for you.” Like you should talk, I almost said, but didn’t. “You don’t want to end up like me, do ya?” Bloom asked. “You could quit, get treatment.” “I have. Many times. I once did 184 weeks and two days without a drink. I was younger then.” I did the math—three and a half years of sobriety out of how many? Over fifty? I nudged the remainder of the Scotch away. “You drink and sometimes, not always, but sometimes, maybe once outta ten tries it all becomes perfectly clear, you understand everything and then”—he snapped his fingers—“it’s gone. It just—It lasts a moment, then it’s gone. But that moment, what a moment. Do you know what I mean?” I didn’t but said I did. “It can break your heart,” Bloom said. He drank half the beer in one gulp and set the glass carefully in front of him. “Beth Rogers,” he said. “Yes.” “What do you know about Beth Rogers?” “That’s what I wanted to ask you.” “What?” “Tell me about Elizabeth. Tell me about that night.” “The night when she—Oh, what did we do?” “Tell me.”","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-52.html","bookId":2223,"book":{"id":2223,"title":"Pretty Girl Gone (Mac McKenzie #3)","description":"Storyline: Rushmore \"Mac\" McKenzie has a lot of old girlfriends, but only one went on to marry the current governor of the state of Minnesota. And only one is calling him with a desperate request to meet in secret. First Lady Lindsay Barrett is carrying an anonymous e-mail that contains the makings of an ugly rumor about her husband, the man about to run for higher office---perhaps even the highest office. Someone says they have evidence that Jack Barrett killed his high school sweetheart. Lindsay says it\u0027s an outright lie, but the truth lies buried decades in the past in the small town where the governor grew up. Of course, Mac, who\u0027s richer than he needs to be and always has plenty of time on his hands, is in the business of handling such matters for his friends. So he packs up and drives straight into the governor\u0027s past with the brilliantly conceived plan to poke around and see if he can stir up a little information. He\u0027s soon got goons of all sorts poking him back, including a nasty little group of political movers and shakers who aren\u0027t above kidnapping and murder to protect their interests. It\u0027s clear that his little plan has stirred up nothing but trouble. With no choice but to stick to it, he continues shifting through a complex web of interlocking secrets and lies, some decades old and some rooted violently in the present day. It\u0027s up to Mac to sort truth from untruth before a vicious rumor becomes a political nightmare---or worse, before the \"outright lie\" is proved a solid, irrefutable fact.","cover":"https://allnovel.net/images/pretty-girl-gone-mac-mckenzie-3.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:48:58 PM"}}
