{"id":106124,"no":57,"title":"Page 57","content":"“There’s that, too.”\n “Why are you talking to me?”\n “You used to be a cop. A good one. I checked you out, first after your problems at the Rainbow Cafe this morning and then some more after your run-in with Reif and Hugoson.”\n “They file a complaint?”\n “Not with me.”\n “Where are you going with this, Chief?”\n “You’ve been running around town talking to a lot of people, asking a lot of questions.”\n “Not about meth.”\n “You want to know what happened to Elizabeth Rogers.”\n “That’s becoming less and less of a secret.”\n “I can help.”\n “How?”\n “I can show you the original incident reports, the supplementals, photos of the victim, transcripts of the Q\u0026As, the coroner’s final summary—everything.”\n “I’d like to see the reports.”\n “Then give me something in return.”\n “Like what?”\n “Whatever you find out. A smart guy like you, McKenzie, someone who keeps his eyes and ears open, he could do himself a lot of good.”\n “If I learn anything at all about your meth problem, I’ll tell you.”\n “Then we have a deal.”\n “Why not? But you gotta know, Chief, meth is easy. These people, they’re so damn paranoid they’re far more dangerous than any other people who use drugs. More guns, more violence. They love booby traps.”\n “You call that easy?”\n “Because they’re so outrageously paranoid you can get rid of them with a simple knock-and-talk. Just knock on their doors and warn them to shut down or prepare to be arrested and they’ll be on the first stage outta Dodge. The trouble is, all you’re doing is moving them down the road to another jurisdiction.”\n “The trouble is finding them, McKenzie. Help me find them and I’ll help you.”\n Seemed fair enough.\n 10\n Mankato was originally called Mahkato—meaning “greenish blue earth”—by its earliest inhabitants, the Dakota, although it didn’t look any different to me. It became Mankato because of a spelling error that was never corrected, possibly made by the eighteenth-century Europeans searching for the Northwest Passage who settled there after getting lost on the Minnesota River. That’s all I knew about the city except that it was where the Minnesota Vikings football team held its annual training camp.\n About four inches of snow fell overnight, but the plows had been out early and I had no trouble holding the road even at fifteen miles above the posted speed limit. The sun was bright and the sky was unclouded and deep blue.\n I easily found Dr. Dave Peterson’s address, a red brick three-story building across from the River Hills Mall that he shared with several dentists, two psychiatrists, and an insurance agent. An assistant guided me to an examination room that I guessed also served as Dr. Peterson’s office because of the family photographs and certificates hanging from the walls. I studied the photos while I waited. In their wedding picture, Dr. Peterson’s wife was a petite brunette and he was tall with a full head of hair. She had become a plump blonde and he was bald by the time their photograph was taken at their daughter’s high school graduation and I wondered if Nina’s future and mine held a similar fate.\n I glanced at my watch. Ten past eight. Dr. Peterson was late, but when was a doctor ever on time? I examined his certificates—Bachelor of Arts, Gustavus Adolphus College; Doctor of Medicine, University of Minnesota; Medical Specialist, Department of Ophthalmology, University of Minnesota; elected to the American Academy of Ophthalmology. That killed another five minutes. At twenty past eight, I returned to the receptionist to advise her that I was still waiting.\n “I’m sorry. Dr. Peterson cannot see you today. Would you like to reschedule?”\n “You don’t understand. I’m not here for an examination. I came to ask—”\n “I’m sorry, Dr. Peterson cannot see you today.”\n “Please. I’m here—”\n “Would you care to reschedule your appointment? We have an opening in March.”\n I considered shouting. It’s amazing how much grease a squeaky voice can get. Only the receptionist didn’t look like a woman who was easily intimidated.\n “May I leave a message?” I asked instead.\n “Certainly.”\n On a notepad emblazoned with the doctor’s name, address, and phone number, I wrote:\n Since everyone has been so cooperative, I’m going to petition the Cold Case Unit of the Minnesota Bureau of Criminal Apprehension to immediately reopen the investigation into the murder of Elizabeth Rogers.\n “Make sure he gets that,” I said.\n “Certainly,” said the receptionist. \n","sourceLink":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3/page-57.html","bookId":2223,"book":{"id":2223,"title":"Pretty Girl Gone (Mac McKenzie #3)","description":"Storyline: \n Rushmore \"Mac\" McKenzie has a lot of old girlfriends, but only one went on to marry the current governor of the state of Minnesota. And only one is calling him with a desperate request to meet in secret. First Lady Lindsay Barrett is carrying an anonymous e-mail that contains the makings of an ugly rumor about her husband, the man about to run for higher office---perhaps even the highest office. Someone says they have evidence that Jack Barrett killed his high school sweetheart. Lindsay says it\u0027s an outright lie, but the truth lies buried decades in the past in the small town where the governor grew up. \n Of course, Mac, who\u0027s richer than he needs to be and always has plenty of time on his hands, is in the business of handling such matters for his friends. So he packs up and drives straight into the governor\u0027s past with the brilliantly conceived plan to poke around and see if he can stir up a little information. He\u0027s soon got goons of all sorts poking him back, including a nasty little group of political movers and shakers who aren\u0027t above kidnapping and murder to protect their interests. It\u0027s clear that his little plan has stirred up nothing but trouble. \n With no choice but to stick to it, he continues shifting through a complex web of interlocking secrets and lies, some decades old and some rooted violently in the present day. It\u0027s up to Mac to sort truth from untruth before a vicious rumor becomes a political nightmare---or worse, before the \"outright lie\" is proved a solid, irrefutable fact.\n \n","cover":"https://allnovel.net/images/pretty-girl-gone-mac-mckenzie-3.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/pretty-girl-gone-mac-mckenzie-3.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:48:58 PM"}}
