{"id":78905,"no":11,"title":"Page 11","content":"Conrad was in his room, and when Jeremiah went up and asked him to come, he said no. He\u0027d been spending an awful lot of time alone, in his room, and I could tell it hurt Steven\u0027s feelings. He\u0027d be leaving soon for a college road trip with our dad, and Conrad didn\u0027t seem to care. When Conrad wasn\u0027t at work, he was too busy strumming his guitar and listening to music. So it was just Jeremiah, Steven, and me. I convinced them to watch a romantic comedy about two dog walkers who walk the same route and fall in love. It was the only thing playing. The next movie wouldn\u0027t start for another hour. About five minutes in, Steven stood up, disgusted. \"I can\u0027t watch this,\" he said. \"You coming, Jere?\" Jeremiah said, \"Nah, I\u0027ll stay with Belly.\" Steven looked surprised. He shrugged and said, \"I\u0027ll meet you guys when it\u0027s over.\" I was surprised too. It was pretty awful. Not long after Steven left, a big burly guy sat in the seat right in front of me. \"I\u0027ll trade you,\" Jeremiah whispered. I thought about doing the fake \"That\u0027s okay\" thing but decided against it. This was Jeremiah, after all. I didn\u0027t have to be polite. So instead I said thanks and we traded. To see the screen Jeremiah had to keep craning his neck to the right and lean toward me. His hair smelled like Asian pears, this expensive shampoo Susannah used. It was funny. He was this big tall football guy now, and he smelled so sweet. Every time he leaned in, I breathed in the sweet smell of his hair. I wished my hair smelled like that. Halfway through the movie, Jeremiah got up suddenly. He was gone a few minutes. When he came back, he had a large soda and a pack of Twizzlers. I reached for the soda to take a sip, but there were no straws. \"You forgot the straws,\" I told him. He ripped the plastic off of the Twizzler box and bit the ends off of two Twizzlers. Then he put them in the cup. He grinned broadly. He looked so proud of himself. I\u0027d forgotten all about our Twizzler straws. We used to do it all the time. We sipped out of the straws at the same time, like in a 1950s Coke commercial--heads bent, foreheads almost touching. I wondered if people thought we were on a date. Jeremiah looked at me, and he smiled in this familiar way, and suddenly I had this crazy thought. I thought, Jeremiah Fisher wants to kiss me. Which, was crazy. This was Jeremiah. He\u0027d never looked at me like that, and as for me, Conrad was the one I liked, even when he was moody and inaccessible the way he was now. It had always been Conrad. I\u0027d never seriously considered Jeremiah, not with Conrad standing there. And of course Jeremiah had never looked at me that way before either. I was his pal. His movie-watching partner, the girl he shared a bathroom with, shared secrets with. I wasn\u0027t the girl he kissed. Chapter sixteen AGE 14 I knew bringing Taylor was a mistake. I knew it. I knew it and I did it anyway. Taylor Jewel, my best friend. The boys in our grade called her Jewel, which she pretended to hate but secretly loved. Taylor used to say that every time I came back from the summer house, she had to win me over again. She had to make me want to be there, in my real life with school and school boys and school friends. She\u0027d try to pair me up with the cutest friend of the guy she was obsessed with at the time. I\u0027d go along with it, and maybe we\u0027d go to the movies or to the Waffle House, but I\u0027d never really be there, not completely. Those boys didn\u0027t compare to Conrad or Jeremiah, so what was the point? Taylor was always the pretty one, the one the boys looked at for that extra beat. I was the funny one, the one who made the boys laugh. I thought that by bringing her I\u0027d be proving that I was a pretty one too. See? See, I\u0027m like her; we are the same. But we weren\u0027t, and everybody knew it. I thought that bringing Taylor would guarantee me an invitation to the boys\u0027 late-night walks on the boardwalk and their nights on the beach in sleeping bags. I thought it would open up my whole social world that summer, that I would finally, finally be in the thick of things. I was right about that part at least. Taylor had been begging me to bring her for forever. I\u0027d resisted her, saying it\u0027d be too crowded, but she was very persuasive. It was my own fault. I\u0027d bragged about the boys too much. And deep down, I did want her there. She was my best friend, after all. She hated that we didn\u0027t share everything--every moment, every experience. When she joined the Spanish club, she insisted I join too, even though I didn\u0027t take Spanish. \"For when we go to Cabo after graduation,\" she said. I wanted to go to the Galapagos Islands for graduation, that was my dream. I wanted to see a blue-footed booby. My dad said he\u0027d take me too. I didn\u0027t tell Taylor, though. She wouldn\u0027t like it. My mother and I picked Taylor up at the airport. She walked off the plane in a pair of short shorts and a tank top I\u0027d never seen before. Hugging her, I tried not to sound jealous when I said, \"When\u0027d you get that?\" \"My mom took me shopping for beach stuff right before I left,\" she said, handing me one of her duffel bags. \"Cute, right?\" \"Yeah, cute.\" Her bag was heavy. I wondered if she\u0027d forgotten she was only staying a week. \"She feels bad she and Daddy are getting a divorce so she\u0027s buying me all kinds of stuff,\" Taylor continued, rolling her eyes. \"We even got mani-pedis together. Look!\" Taylor lifted up her right hand. Her nails were painted a raspberry color, and they were long and square. \"Are those real?\" \"Yeah! Duh. I don\u0027t wear fake, Belly.\" \"But I thought you had to keep your nails short for violin.\" \"Oh, that. Mommy finally let me quit violin. Divorce guilt,\" she said knowingly. \"You know how it is.\" Taylor was the only girl I knew our age who still called her mother Mommy. She was the only one who could get away with it too. The boys came to attention right away. Right away they looked at her, checked out her smallish B-cups and her blond hair. It\u0027s a Miracle Bra, I wanted to tell them. That\u0027s half a bottle of Sun-In. Her hair isn\u0027t usually that yellow. Not that they would\u0027ve cared either way. My brother, on the other hand, barely looked up from the TV. Taylor irritated him, always had. I wondered if he\u0027d already warned Conrad and Jeremiah about her. \u003c \"Hi, Ste-ven,\" she said in a singsong voice. \"Hey,\" he mumbled. Taylor looked at me and crossed her eyes. Grump , she mouthed, emphasis on the p. I laughed. \"Taylor, this is Conrad and Jeremiah. Steven you know.\" I was curious about who she\u0027d pick, who she\u0027d think was cuter, funnier. Better. \"Hey,\" she said, sizing them up, and right away I could tell Conrad was the one. And I was glad. Because I knew that Conrad would never, ever go for her.","sourceLink":"https://allnovel.net/the-summer-i-turned-pretty-summer-1/page-11.html","bookId":2723,"book":{"id":2723,"title":"The Summer I Turned Pretty (Summer #1)","description":"Storyline: Belly measures her life in summers. Everything good, everything magical happens between the months of June and August. Winters are simply a time to count the weeks until the next summer, a place away from the beach house, away from Susannah, and most importantly, away from Jeremiah and Conrad. They are the boys that Belly has known since her very first summer--they have been her brother figures, her crushes, and everything in between. But one summer, one terrible and wonderful summer, the more everything changes, the more it all ends up just the way it should have been all along.","cover":"https://allnovel.net/images/the-summer-i-turned-pretty-summer-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-summer-i-turned-pretty-summer-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:10:58 PM"}}
