{"id":98812,"no":11,"title":"Page 11","content":"Disappointment. So deep it feels like heartbreak. I brush the back of my hand against my eyes. I didn’t realize until now that I expected to recognize the Pilot’s voice. Did I think he would sound like Grandfather? Did I think the Pilot would be Grandfather, somehow? “We call this illness the Plague,” the Pilot says. “The Society created it and sent it to the Enemy in their water.” The Pilot’s words come into the silence like carefully selected seeds or bulbs, dropped into hollowed-out spaces in the soil. The Rising has made these spaces, I think, and now they’re filling them. This is the moment they come into power. The port changes; now we’re outside following someone up the steps of Central’s City Hall. The view is clear, even in the night, and though the building isn’t lit up with special occasion lights, the look of the marble steps and the waiting doors make me think of the Match Banquet. Not even a year ago, I walked up steps much like those back in Oria. What lies behind the doors of Halls across the Society now? The camera moves inside. “The Enemy is gone,” the Pilot says. “But the Plague the Society gave to the Enemy lives on with us. Look at what has happened in the Society’s own capital, in Central, where the Plague first made inroads. The Society can no longer contain the Plague within the medical centers. They’ve had to fill other government buildings and apartments with the sick.” The Hall is filled, brimming, with even more of the patients. And now we’re outside, looking from above at the white barricade that encircles Central’s City Hall. “There are barricades like this in every Province now,” the Pilot tells us. “The Society has tried to keep the Plague from spreading, but they have failed. So many have fallen ill that the Society can no longer keep up even its most important occasions. Tonight, the Match Banquets fell apart. Some of you will remember this.” When I go to the window, I see movement. The Rising is here, no longer hiding. They fly over us in ships; they are among us in black. How many of them came in from the sky? I wonder. How many simply changed a set of clothes? How deeply and well had the Rising infiltrated Central? Why do I know so little about what is taking place? Is that the Society’s fault, for making me forget, or the Rising’s, for not telling me enough in the first place? “When the Plague was first developed,” the Pilot says, “there were those of us who saw what might happen. We were able to give some of you immunity. For the rest, we have a cure.” And now the Pilot’s voice takes on more emotion, more persuasion, more. It becomes bigger; it plays on our emptiness, fills our hearts. “We will keep all the good things from the Society, all the best parts of our way of life. We won’t lose all the things you’ve worked so hard to build. But we’ll get rid of the sicknesses in the Society. “This rebellion,” the Pilot says, “is different than others throughout history. It will begin and end with saving your blood, not spilling it.” I start to edge toward the door. I need to run. To try to find Ky. He didn’t come tonight to the lake; perhaps this is why. He couldn’t get away. But he might still be here in Central, somewhere, tonight. “Our only regret,” the Pilot says, “is that we were unable to step in before any lives were lost. The Society was stronger than we were, until now. Now, we can save all of you.” On the screen, someone in a black uniform opens a case. It is filled with small red tubes. Like the tubes in the cave, I think again, only those were lit blue. “This is the cure,” the Pilot says. “And now, at last, we have made enough for everyone.” The man on the screen reaches inside the case and takes out a tube, pulling off the cap and revealing a needle. With the smooth confidence of a medic, he plunges the needle into the line. I draw in a breath. “This illness may look peaceful,” the Pilot says, “but I can assure you that it is still fatal. Without medical care, bodies shut down quickly. Patients dehydrate and die. Infection can set in. We can bring you back if we find you soon enough, but if you try to run, we cannot guarantee a cure.” The port goes dark. But not silent. There are likely many reasons they chose this Pilot. But one of the reasons has to be his voice. Because when the Pilot starts to sing, I stop to hear. It’s the Anthem of the Society, a song I have known all my life, one that followed me into the canyons, one that I will never forget. The Pilot sings it slow, and sad. The Society is dying, is dead. Tears stream down my cheeks. In spite of myself, I find that I am crying for the Society, for its end. For the death of what did keep some of us safe for a very long time. The Rising told me to wait. But I am no longer any good at that. I feel my way along the long underground hallway, crumbles of green moss coming off in my hands, and I wonder at how thick and fast things can grow here, below. Somehow, I rarely seem to run into anyone going or coming, though the fear of putting out my hand to touch stone and feeling skin instead is always there. I couldn’t find Ky, so I’ve come to ask the Archivists what they know. They might lean one way or the other—Society or Rising—but it seems to me that they are Archivists above all. Today, everyone isn’t hidden among their own shelves, tucked away in their own trades. The Archivists and traders have gathered in the larger main room and stand in clusters, talking. Of course, the largest group has gathered around the head Archivist. I might have to wait a long time to speak with her. To my surprise, when she sees me, she separates herself out to come talk with me. “Is the Plague real?” I ask. “That information is worth quite a bit,” she says, smiling. “I should ask for something in exchange.” “All my papers are gone,” I tell her. Her face changes, shows genuine regret. “No,” she says. “How?” “They were stolen,” I say. Her expression softens. She hands me a piece of paper, a curl of white from one of the illegal Archivist ports. As I look around the room, I notice that many of the people hold slips of paper like mine. “You’re not the only one who wanted to know if the Plague was real,” she says. “It is.” “No,” I breathe out. “We suspected a Plague even before the stillzone barrier went up,” she says. “The Society was able to keep it contained for a long time, but now it’s spreading. Quickly.” “Who told you?” I ask. “Was it the Rising?” She smiles. “We hear things from the Rising and the Society. But Archivists have learned to be wary of both.” She gestures to the paper I hold in my hand. “We have a code for times like these. We’ve used it for a long time to warn one another of illness. The lines come from a very old poem.” I look down and read it. Physic himself must fade. All things to end are made; The plague full swift goes by. I am sick, I must die. I grip the paper tightly in my hand. “Who is the physic?” I ask, thinking of Xander. “No one,” she says. “Nothing. The important word here is plague. The physic isn’t anyone special.” She tilts her head. “Why? Who did you think it might be?” “The Leader of the Society,” I say, hedging. Even after all my trading with the head Archivist, I’m hesitant to tell her about Xander, or Ky. She smiles. “There is no Leader of the Society,” she says. “They rule by committees of Officials from different departments. Surely you’ve figured that out by now.” She’s right. I have. But it’s strange to hear confirmation of what I’ve suspected. “What about the Plague, then?” I ask. “There must be other mentions of it in your Archives.” “Oh, there are,” the Archivist says. “Plagues are mentioned everywhere, in literature, histories, even poetry, as you’ve seen. But they all say the same thing. People die until someone finds a cure.” “Will you tell me if my papers surface somehow?” I ask. “If someone else brings them to trade?” I already know the answer but it’s difficult to hear. “No,” she says. “Our job is only to certify authenticity of items and keep track of our own trades. We do not ask anyone to account for the items they bring here.” I knew that, of course. Otherwise, I would have had to explain how I came by my papers in the first place. In a way, I stole them, too. “I could write some poems,” I say. “I’ve thought of them before—” The head Archivist interrupts me. “There’s no market for that,” she says, her voice matter-of-fact. “We deal in old things of established worth. And some new things whose value is obvious.” “Wait,” I say, my idea taking hold and making me reckless. I can’t help it—I picture it: all of us coming together to trade. For some reason I imagine the scene taking place in a City Hall, under the dome, only instead of wearing bright dresses we are bearing bright pictures, holding colorful words, humming snatches of new melodies under our breaths, unafraid of being caught out, ready to be asked, What song is this you sing? “What if,” I say, “we started another line of trading, using new things that we’ve made? I might want someone else’s painting. They might want my poem. Or—” The Archivist shakes her head. “There’s no market for that,” she says again. “But I am sorry about your papers.” Her voice rings with the loss only felt by a true connoisseur. She knew what those pages were worth. She saw the words, smelled the faint aroma of rocks and dust that clung to them. “So am I,” I say. And my loss is much deeper, more visceral and essential. I have lost my way to get to Ky, the insurance I always had that if I stopped believing in the Rising, or if things went terribly wrong, I could trade my way to Ky, to my family. Now I have very little left, and even the Thomas poem, which no one else knows, won’t be nearly enough to get me there without the actual document. “You have, of course, two items in transit,” the Archivist says. “When those items arrive, you’ll be able to take possession of them immediately since you have already paid in full.” Of course. The I did not reach Thee poem. Grandfather’s microcard. Will they still come through? “And you may keep running trades for us,” the Archivist says, “as long as you prove trustworthy.” “Thank you,” I say. At least there’s that. The small amount I get as payment for the trades won’t be much, but perhaps I can start to accrue something. “Some things will remain valuable no matter who is in charge,” the Archivist tells me. “Others will change. The currency will shift.” She smiles. “It is always,” she says, “so interesting to watch.” PART TWO POET CHAPTER 9 XANDER I’m dying,” the patient tells me. He opens his eyes. “It’s not very hard.”","sourceLink":"https://allnovel.net/reached-matched-3/page-11.html","bookId":1645,"book":{"id":1645,"title":"Reached (Matched #3)","description":"Storyline: Reached (Matched #3) After leaving Society to desperately seek The Rising, and each other, Cassia and Ky have found what they were looking for, but at the cost of losing each other yet again. Cassia is assigned undercover in Central city, Ky outside the borders, an airship pilot with Indie. Xander is a medic, with a secret. All too soon, everything shifts again.","cover":"https://allnovel.net/images/reached-matched-3.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/reached-matched-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:36:04 PM"}}
