{"id":71566,"no":12,"title":"Page 12","content":"\\n\\n “Whoa, you’re acting weird and I like it.” I tap my finger against my chin thoughtfully. “Well, first off, you don’t pull hair. That’s a girl’s way of fighting.”\\n\\n “But I am a girl.”\\n\\n “Yeah, but if you fight like a guy then you win. Element of surprise. It totally throws them off.”\\n\\n Lila bobs her head up and down, eyeing Kenzie as she takes a swallow from the red cup in her hand. “I could see how that would work.”\\n\\n “It works perfectly almost every time,” I assure her. “And if you really want to get mean you can kick—” I’m cut off by the low beat of the drums, guitar, and base mixing together in perfect unison. I turn around and face the front of the room, no longer giving a crap about Kenzie. She can say whatever she wants. It doesn’t mean anything to anyone who matters.\\n\\n Micha strums his long fingers across the guitar as he stands in front of the microphone. His eyes are locked on me, the silver O-ring on his wedding finger glistening in the inadequate light of the living room as he sings the song that was playing while we were in the shower earlier. The lyrics bring fresh memories flooding back and I swear to God I can feel the heat of the steam and the scorching trail his hands left all over my body.\\n\\n I watch him play, longing to touch him and for him to touch me. I put the plastic cup up to my lips and swallow another mouthful of Bacardi, feeling the burn of it along with the heat on my skin, realizing that Micha was right. That I do get horny when I’m drunk because all I can think about right now is him being inside me like he was in the shower.\\n\\n When his lips part to sing the chorus, I shut my eyes and let the lyrics and sultry sound of his voice spill over my body. I’m gone. The people around me no longer exist. It’s just me and Micha and his beautiful voice. I remember the first time I heard him play, sitting in his room on this beanbag chair he had, watching him play and sing on his bed without a shirt on with this intense look on his face, like the words he sang owned him.\\n\\n “So what do you think?” he’d asked after he’d stopped strumming the strings.\\n\\n I’d shrugged, pretending that the sketchpad on my lap wasn’t holding a drawing of him on the bed. That I didn’t just draw him, making lines and shades that mattered. That he mattered enough to me that I took the time to draw him. I felt so lost at the moment, hearing him sing like that as I stared at a drawing that wasn’t just a drawing. I was lost but in the most wonderful way.\\n\\n “It was okay, I guess,” I replied nonchalantly, adding a few shadings around his eyes because they were too beautiful not to have extra detail on them.\\n\\n “Just okay?” He cocked his eyebrow as he held the guitar on his lap. He looked a little upset about my answer and it made me feel guilty.\\n\\n “No, it was beautiful,” I said softly as I stared down at my drawing, uncomfortable at how intimate the moment was because I didn’t use the word beautiful. Just like I didn’t draw pictures of people unless it was an assignment for school.\\n\\n I waited for him to say something, even though I wished he wouldn’t. But he never said anything, finally just playing the same song again. I’d smiled down at my drawing because even though I knew it wasn’t possible, I swear to God he could read my mind and eventually I’d started working on my drawing of him again while listening to him play. I’d always loved music, but hearing it from his mouth warmed my soul in a way that I never knew was possible.\\n\\n I shake my head from the memory. Maybe there’s another sentence to put in my vows. Although, all these notes are getting a little personal and I’m not certain I’ll dare read them out loud. Panic claws at my throat and I start to open my eyes to go get another drink, but then Micha reaches the intense part of the song and I don’t want to leave the moment. I want to dance, get lost again like the first time I heard him play. So I keep my eyelids closed and sway my hips, shaking my head back and forth, my hair flying everywhere. I’m in heels and it’s a struggle to maintain my balance, but I don’t care even when I stumble a few times. Just like I don’t care that I’m rocking out in a room full of people who are absorbed in beer and trying to find someone to hookup with and who are probably looking at me like I’m a weirdo. I’ll take being a weirdo over not enjoying this moment. I’ve forced myself not to enjoy too many moments in my life. I need more enjoyment. Maybe it’s the alcohol in my system that’s making me think these things or maybe I’m just being my old self. Or perhaps I’m just being me. Whatever it is, I roll with it, dancing to the tempo of the music. Lila laughs at me and when I open my eyes she’s dancing, too.\\n\\n We continue through the entire song and I keep swaying my hips with my hands above my head, even when the music stops and voices rise around me. Moments later the stereo clicks on and the sound suffocates the chatter. “New Low,” by Middle Class Rut, starts vibrating through the speakers and I know it will only be seconds before I’m no longer dancing solo in a room full of people.\\n\\n Right on cue, Micha’s long arms wrap around my waist and he guides me back against his body. I know it’s him because of the overpowering scent: his cologne mixed with mint and beer and something intoxicatingly wonderful that belongs only to him. I deeply inhale it in, moving with him as we grind our bodies together to the beat.\\n\\n “You’re so God damn sexy,” he says, breathing into my ear and giving it a little nip. “Do you know how hard it is to stand up there and play while you’re down here doing this?”\\n\\n “Doing what?” I ask innocently as his hand sneaks up the back of my dress and cups my bare ass.\\n\\n His brow arches. “What panties are you wearing?”\\n\\n I smile to myself. “A sequined thong.” I whirl around and press my body up against him, enjoying myself way too much.\\n\\n His hand slides down my back and he crushes my body into his until there’s no space left between us. I roll my hips against him and he lets out a husky growl. Unable to control myself, I throw my arms around him, stand on my tiptoes, and kiss him, urging his lips apart with my tongue. He kisses me with equal intensity as I suck on his lip ring, stroke the inside of his mouth with my tongue, and bite at his bottom lip.\\n\\n “God damn it, pretty girl, you’re killing me.” He groans a deep, throaty groan that makes my thighs tingle and I slip my hand between us, rubbing him hard. “Baby, easy. There are people…” He trails off as I move my fingers to the top of his jeans. I know I’m drunk and horny just like he said earlier, but I don’t care. I know what I want. Him.\\n\\n When I start to undo the button of his jeans, he jerks away, his aqua eyes glazed, his expression blazing with desire that matches my own. He doesn’t say a word as he entwines our fingers and then pulls me with him as he maneuvers through the crowd for the kitchen, shoving people out of the way with his elbow.\\n\\n He scoops up two beers as we pass the cooler and hands me one. Ethan is standing beside the cooler, dripping with sweat from playing the drums, his shirt off and his tattoos showing. Lila is behind him with her head on his back as she traces her fingernails up and down his skin.\\n\\n Micha gives him a chin up and says, “In an hour kick everyone out.”\\n\\n “Why can’t you…” Ethan blinks at him and then pulls a face as he glances between Micha and me as Lila giggles. “All right, will do.”\\n\\n I pinch Micha’s ass because I can and he incoherently mutters something. Then he’s tugging me with him as he crosses the kitchen and moves toward the hallway. We go into his room and he kicks the door shut behind us. When he turns to face me, his lips immediately cover mine, his fingers digging roughly through the fabric of my dress.\\n\\n “You taste like beer,” I murmur with a drunken giggle as I kiss him back, fiddling with the bottom of his shirt as we back toward his bed with our beers still in our hands.\\n\\n “And you taste like Bacardi,” he mutters against my lips, and then suddenly he’s pulling away. “Wait, how wasted are you?”\\n\\n I roll my eyes. “First of all, even if I was wasted, it wouldn’t matter. You can’t take advantage of me when I’m yours,” I say and this lustful look flares in his eyes. “And second of all, I’m not that wasted. I’ll remember everything we did in the morning.”\\n\\n “I do like your logic.” He takes the unopened beer from my hand and sets it down on top of the dresser along with his. “But are you sure?”\\n\\n “I’m positive.”\\n\\n That’s all the convincing he needs. With one swift tug, he jerks my dress over my head so forcefully that he tears the corner of the fabric and sends the pins in my hair flying through the air.\\n\\n He pulls a “whoops” face, but I cover his mouth with my hand. “It’s just a dress.” Then I crush my lips against his, his lip ring searing hot against my mouth as my hair falls down and brushes against my shoulders. Minutes later, all our clothes are on the floor and we’re lying on his bed, him on his back and me straddling him. He thrusts his hips up to me halfway as I slide down on top of him. His eyes shut as I grip onto his shoulders and I gasp when he sinks farther into me. My hair falls loosely down my back as I slant my head back and shut my eyes. Gripping onto my hips, he rhythmically thrusts inside me over and over again. Our bodies bead with sweat as my mind drifts further away. Helpless energy channels through me and I dig my nails into his flesh, needing something to hold on to. Finally he takes my hands and I grasp on to him until I come apart. I cry out his name and every single worry I had disappears and all that’s left is the blissful contentment that only Micha can make me feel.\\n\\n Chapter 8\\n\\n Micha\\n\\n I’m lying in my bed, thinking about how to tell Ella about the tour when Ethan kicks everyone out of the house. Darkness has settled into my room and the noise and voices slowly dwindle until the house becomes silent. I sit up, but only to turn my iPod on, selecting “I Can Feel a Hot One,” by Manchester Orchestra, then lie back down. Ella is naked beside me, flat on her stomach, her hair scattered all over her back, the sheets pulled up halfway over her body as she sleeps soundlessly. \\n\\n","sourceLink":"https://allnovel.net/the-ever-after-of-ella-and-micha-the-secret-4/page-12.html","bookId":1972,"book":{"id":1972,"title":"The Ever After of Ella and Micha (The Secret #4)","description":"Storyline: The Ever After of Ella and Micha (The Secret #4) \\n The day Ella has waited for is just around the corner. It\u0027s the day she\u0027ll marry Micha, the love of her life, the light that guided her out of the darkness. It looks like it will be the perfect Christmas-until an unexpected package arrives with a harsh reminder of Ella\u0027s past. Suddenly Ella doesn\u0027t feel as confident about her future. Can she really have a \"happily-ever-after\" if she\u0027s never even seen one? \\n Micha will stand by Ella no matter what she\u0027s going through-though he worries that she might leave him standing at the altar again. When he\u0027s offered a once-in-a-lifetime chance to tour with his favorite bands for three months, Micha knows he can\u0027t leave Ella behind. But can he ask her to uproot her life to join him on the road? \\n Now Ella and Micha must find a way to balance their fears, their dreams, and their love . . . if they ever want to hear wedding bells.\\n","cover":"https://allnovel.net/images/the-ever-after-of-ella-and-micha-the-secret-4.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-ever-after-of-ella-and-micha-the-secret-4.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:20:27 AM"}}
