{"id":89377,"no":25,"title":"Page 25","content":"\\n\\n She never wanted to move. Never.\\n\\n With his arms around her, she slept at last.\\n\\n Even so, she was plagued by dreams.\\n\\n She was running through the old cemetery again, with its crosses of wood and graves encircled with stones. The wind was light and warm, and at first there was sun but then there wasn’t. Always, though, there were people behind her. Chasing her.\\n\\n Hunting her.\\n\\n They were coming to kill her, and so she ran, tripping over the stones, running against the sagebrush that blew at her as if a tempest was coming. Just as she heard the footsteps coming closer and closer, she saw a light ahead of her, and a man framed in that light.\\n\\n It was Dillon.\\n\\n As she neared him, the sun came out again and her pursuers vanished, fading to nothing but empty darkness behind her, because in him she found the anger and strength and desire to fight back.\\n\\n She opened her eyes slowly. It was morning, a soft glow filtering through the drapes.\\n\\n She wasn’t alone. And for once she was glad of that.\\n\\n Dillon lay beside her, just holding her, though she saw that he, too, was awake. When she turned to face him, she saw in his eyes the humor, the kindness and the strength she had expected—along with something more that made her heart leap. There was an intimacy there that made her blood heat, and when he smiled slowly, she felt a little tremor ripple through her as she realized that she wanted him—that look, his touch, everything about him—in her life for much longer than just one night. She had been wary of relationships for so long, like a kid with a chip on her shoulder. She had felt that she needed to defend Timothy from anyone who might pity him or mock her for her devotion to him, but no more. She knew without question that Dillon would understand Timothy’s condition, would honor an elder, and would never expect anything from her but loyalty to the grandfather who had raised her.\\n\\n “Good morning,” he said softly. “Did you sleep well?”\\n\\n She nodded.\\n\\n “No nightmares?”\\n\\n “Only one, but you were there,” she told him gravely.\\n\\n “Great,” he murmured dryly.\\n\\n She laughed. “No, you were there in a good way,” she assured him. “I was running away from these people I knew wanted to kill me, but then I saw you.”\\n\\n “I hoped I rescued you,” he said.\\n\\n “You did even more.”\\n\\n “Oh?”\\n\\n “You gave me strength, and when they knew they couldn’t scare me anymore, they disappeared.”\\n\\n “Well, I’m glad of that,” he told her, then sat up suddenly, frowning. “Fear can be a good thing sometimes, though. Fear can keep you safe.”\\n\\n “I’ve been afraid of a ghost,” she said softly. “A ghost who you said needs help.”\\n\\n “But someone made Tanner Green into a ghost,” he said. “And someone killed Rudy Yorba. That person is alive, and it’s wise to be afraid of him and what he can do.”\\n\\n She stared at him, her mind suddenly embracing the true importance of what they had shared, and what had—and hadn’t—been said.\\n\\n “Indigo,” she told him.\\n\\n She was startled by his reaction. It was a color, just a color, and when Tanner Green had whispered the word with his dying breath, it hadn’t meant anything to her, hadn’t struck her as anything that could possibly be important.\\n\\n “What?” he said sharply.\\n\\n “Indigo. That’s what Tanner Green said right before he died. I’m sorry. I trust you, and I would tell you if he’d said anything more, but that was it. One word. Indigo. Just a color.”\\n\\n He rose, lean muscle and sinew, his back to her, tall and straight in the early-morning light.\\n\\n “It’s more than a color,” he said tightly, his back still toward her.\\n\\n “Oh?”\\n\\n “It’s a place. Indigo, Nevada.”\\n\\n “I’ve never heard of it. What kind of a place?”\\n\\n He turned to face her, his dark eyes grim and worried. “A ghost town.”\\n\\n 9\\n\\n Dillon was preparing coffee when Ringo made his first appearance of the day.\\n\\n Death, apparently, didn’t quell a man’s sense of humor.\\n\\n “You look like hell, my friend, and here I was, thinking I was the dead man.”\\n\\n “Funny. Now sit down, will you? I’m pretty sure she hears your spurs. And you sure as hell better not have been hanging around here last night.”\\n\\n “I’m deeply wounded!” Ringo protested. “And I was not hanging around,” he added indignantly. “But aren’t you going to introduce us?”\\n\\n “I was trying to get her accustomed to the ghosts already haunting her. I thought she needed to get a handle on that before realizing that sometimes someone might be…gifted…with an unearthly presence for quite some time.”\\n\\n “Hey, I’m fun and I’m helpful. It’s thanks to me that her grandfather is a happy man in that hoity-toity place he likes. I’m anxious to get to know the lady.”\\n\\n “Just don’t freak her out when the time comes, okay, Ringo?”\\n\\n “Stop panicking.” Ringo was quiet for a moment. “You took this job with that creep Emil Landon because of me.”\\n\\n “Adam asked, too—though there didn’t seem to be a supernatural angle at the time, but I guess he knew something somehow—so…” Dillon trailed off with a shrug. “Get out of here for now, though, huh?”\\n\\n “Hey, that was my room you guys were hogging last night.”\\n\\n “I gave you my room, so quit complaining.”\\n\\n Ringo laughed. “Hey, doesn’t much matter to me. Anything is better than being out in the cold. Oh, wait. I don’t feel the cold. Still, it’s a nice feeling, being in the house and all. Even the damn dog finally likes me.”\\n\\n “Clancy is a good old girl,” Dillon said. She was standing next to him and he scratched her ears. “Ringo, listen, I’m going with Jessy to have breakfast with her grandfather. Then you and I are going to take a drive.”\\n\\n “Where?”\\n\\n “Out to Indigo,” Dillon said.\\n\\n “Indigo?” Ringo said, stunned and anything but pleased. “But that’s where—”\\n\\n “It’s where you died. Yeah, I know. And where you hooked yourself with my ancestors. I know that, too. It’s also the word that Tanner Green whispered to Jessy before he died.”\\n\\n “Hell and damnation. You’re serious?” Ringo demanded.\\n\\n “Dead serious.”\\n\\n “Excuse me?” Ringo said irritably.\\n\\n “Bad choice of words. Sorry.”\\n\\n “What are we looking for?” Ringo asked.\\n\\n “I don’t know. But why the hell would a dying man say ‘Indigo’ unless he had a damn good reason?” He frowned. “When you wanted me to take the Emil Landon assignment, did you know anything about this?” Dillon asked him.\\n\\n Ringo shook his head with what looked like honesty. “Like I told you then, even for Vegas, that guy is one strange player. I figured there had to be something going on, and the job paid big bucks. I figured it would get you in good with the cops to save one of the local money men.” Ringo shrugged. “Okay, I’m outta here right. I’m going to see if I can find out where Tanner Green hangs out when he’s not haunting Jessy. And I’ll see if I can find Rudy Yorba, too. Maybe I’ll even do some spying on Emil Landon.”\\n\\n “You do that. The spying part could be useful. I’ll be heading to Indigo about one.”\\n\\n “Doesn’t Jessy have to be at work by noon?” Ringo asked him.\\n\\n “Yeah, I want to run by the morgue after I drop her off. You can meet me there.”\\n\\n “The morgue?” Ringo said with distaste.\\n\\n “What’s the matter? Don’t tell me you’re squeamish.”\\n\\n “I’ll be waiting outside. Just don’t hang around in there too long. You never know what you might pick up. Or who,” Ringo warned.\\n\\n “I’ll, uh, be careful,” Dillon promised.\\n\\n “Aren’t you worried about leaving Jessy alone? I thought she wanted you around, even when she was working,” Ringo said.\\n\\n “She’s going to be all right. She isn’t terrified of seeing Tanner Green anymore. She knows now that she’s…sane,” Dillon said.\\n\\n Ringo nodded, and with a little jingle of spurs, he was gone.\\n\\n A few minutes later Jessy made her appearance. She had showered but had been forced to put on her outfit from the night before.\\n\\n She could have worn cardboard for all Dillon cared. The woman was beautiful. With makeup or without. Whatever made her magic was in the way she spoke, in her eyes, in the way she moved, in the sound of her laughter. In her soul. He saw beautiful women all the time, but what made Jessy unique went beyond looks. The phrase was so overused that it had become a joke, but she really was beautiful inside and out.\\n\\n “Ooh, coffee,” she said, looking around the room. She was still wary, but she had lost the panic he had seen in her eyes when she had spotted Tanner Green—and then Rudy Yorba—in the café yesterday. “There’s no one here, is there?” she asked him.\\n\\n He shook his head. “No.”\\n\\n She jumped up on one of the bar stools at the counter. “Good.” She hesitated. “How do you know when…when someone is around?”\\n\\n “You just…see them,” he told her. “And it’s unusual to be hounded the way you’ve been, but for some reason Tanner Green’s desperate, and he’s decided that he trusts you. Soon we’ve actually got to try to talk to him. But for right now, we’ll have coffee, get your car and drop it off at your place, and then we’ll go have breakfast with your grandfather, and afterward I’ll drop you at the casino.”\\n\\n “How will I get home?” she asked.\\n\\n “Not alone,” he said firmly. “Stay with other people—or call Sandra. Hang with her.”\\n\\n “I need to change,” she said, indicating her outfit.\\n\\n “There’s plenty of time,” he assured her. \\n\\n","sourceLink":"https://allnovel.net/nightwalker-harrison-investigation-8/page-25.html","bookId":2274,"book":{"id":2274,"title":"Nightwalker (Harrison Investigation #8)","description":"Storyline: Nightwalker (Harrison Investigation #8) \\n Jessy Sparhawk has seen firsthand how gambling can ruin people\u0027s lives. But one night, desperate for money, she places the bet that will change her life forever. Just as she\u0027s collecting her winnings, a man stumbles through the crowd, a knife protruding from his back, and crashes into her, pinning her to the craps table. Hired to investigate the murder, private detective Dillon Wolf finds himself fascinated by the gorgeous redhead who\u0027d been trapped beneath the victim--and by the single word the dying man had whispered in her ear. \"Indigo.\" \\n What neither of them realizes is that the nightmare is only just beginning. Because bodyguard Tanner Green may have been killed by that knife, but his angry ghost isn\u0027t going anywhere--not without vengeance. Now, literally caught between the living and the dead, Dillon and Jessy have no choice but to forge ahead together. Their investigation will take them from the glitz of the Vegas strip into the dealings of casino magnate Emil Landon, the man who signs both their paychecks, and out into the desert to a ghost town called Indigo, where past and present come together in a search for gold. \\n Years ago, blood was shed on that very ground, and now it looks as if history is about to repeat itself, with the living and the dead facing off for possession of a fortune, and Dillon and Jessy fighting not only to stay alive but for the chance to build a future.\\n","cover":"https://allnovel.net/images/nightwalker-harrison-investigation-8.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/nightwalker-harrison-investigation-8.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:33:48 PM"}}
