{"id":15627,"no":16,"title":"CHAPTER XVI","content":"IN THE KLINK The police court room of Glucom was seldom a busy place, and as a rule the police magistrate had little to do. A few drunks generally made up the list for the week, with an occasional family \"affair\" to add a little spice of excitement. It was, therefore, a welcome relief to the monotony when Abner Andrews was brought into court, and charged with assault upon the Editor of The Live Wire. Abner felt keenly the position in which he was placed as he stood in the dock and listened to the words of the sergeant who had arrested him. He realized how serious was the nature of the charge against him, and he clutched the rail of the dock firmly with both hands and carefully studied the face of the magistrate. He did not regret what he had done, neither was he much concerned about himself. It was of those at home he thought, for he knew how badly they would feel, and how they would worry when they heard of his arrest. He was anxious, too, about his wife. He surmised that something unusual had happened to her, otherwise that scurrilous article would not have appeared in the paper. \"You have heard the charge, Mr. Andrews?\" It was the magistrate now speaking. \"Do you plead \u0027Guilty\u0027 or \u0027Not Guilty\u0027?\" \"Not guilty, ye\u0027r Honor,\" was the prompt reply. \"Not guilty!\" the magistrate repeated in surprise. \"Why do you say that? Didn\u0027t you make an assault upon Joseph Preston this morning?\" \"Ye bet I did, and gave him a lickin\u0027 he won\u0027t fergit to the end of his days.\" \"Well, then, if you acknowledge all that, why do you plead \u0027Not guilty\u0027?\" \"But I\u0027m not guilty. I don\u0027t feel one bit guilty. My conscience doesn\u0027t bother me any more\u0027n if I\u0027d beat up a skunk that was after my chickens. Joe got jist what was comin\u0027 to him. Somebody had to do it sooner or later, and that\u0027s all there is about it.\" If it had been anyone else than Aimer Andrews the magistrate would have remanded him at once. But in truth he felt a certain sympathy for the prisoner, as he well knew that Joe Preston had merely received a just punishment. He himself had often mentally vowed vengeance upon the editor for his mean attacks upon him as police magistrate. But he had the dignity of his position to maintain, and it would not do for him to give expression to his feelings, especially in the court room, of all places. \"Did you not take a mean advantage of Mr. Preston?\" he presently asked. \"You gave him no chance, so I understand, but sprang upon him and hit him while he was sitting at his desk. Wasn\u0027t that rather a mean thing to do?\" \"Mean! Isn\u0027t there different ways of hittin\u0027, ye\u0027r Honor? Some hit with their eyes, an\u0027 some with their tongues. But Joe Preston hits with that dirty sheet of his.\" \"And you hit with your fists, eh?\" \"I sartinly do when it\u0027s necessary.\" \"They get you into a lot of trouble, don\u0027t they?\" \"Mebbe so. But they save me from a darn lot of trouble, too. I\u0027m nat\u0027rally a man of peace, an\u0027 mind me own bizness, but when a critter like Joe Preston hits me a mean, nasty cut below the belt, well, he won\u0027t do it no more. It saves one from doin\u0027 it to others, that\u0027s all.\" The magistrate stroked his chin as he thoughtfully mused for a few seconds. He was thinking of a story he would have to tell his wife when he went home to dinner. \"But why did you take matters into your own hands?\" he asked. \"You might have brought in an action for libel and receive damages.\" \"Receive damages! Good Lord! That\u0027s what I was afraid of. If I\u0027d gone to law with Joe Preston I wouldn\u0027t have had a ghost of a chance, an\u0027 you know it. So that\u0027s why I was anxious fer Joe to receive all the damages straight from my shoulder, an\u0027 with my special compliments. He\u0027s welcome to sich damages, an\u0027 I guess they\u0027re the only kind he understands.\" \"Perhaps your damages are yet to come,\" was the magistrate\u0027s reminder. \"Mr. Preston is not likely to forget the injuries he has received, that is, providing he recovers.\" A startled expression came into Abner\u0027s eyes at these words. \"Won\u0027t he recover?\" he asked. \"He\u0027s not as bad as that, is he?\" \"The doctors are not certain, so I understand. Preston received a nasty blow on the head when he fell against the desk. If he doesn\u0027t get better it will go hard with you. But there, I guess that is all for to-day. I shall have to remand you. I am sorry, but I cannot help it.\" \"Surely ye\u0027r not goin\u0027 to send me back to that hole agin, are ye?\" Abner anxiously asked. \"Why it\u0027s not a fit place fer a dog, let alone a human bein\u0027. There\u0027s a drunken brute in the cell next to mine who\u0027s cuttin\u0027 up pretty lively.\" \"I can\u0027t help it, Mr. Andrews. You\u0027ll have to stay there unless you get someone to bail you out.\" \"Bail me out! Good heavens! De ye think I\u0027m a leaky old boat, or a tub, an\u0027 need to be baled out?\" \"It\u0027s not that kind I mean,\" the magistrate explained. He would have another good story to tell his wife. \"Well, then, ye must think I\u0027ve got water on the brain, or I\u0027m a bloomin\u0027 watered-stock company.\" \"I guess you know what I mean,\" and the magistrate smiled. \"You\u0027re not so thick-headed as you try to make out.\" \"I ought to be pretty thick-headed, ye\u0027r Honor. Wouldn\u0027t anyone be that way with more\u0027n a dozen heads on his shoulders?\" \"A dozen heads!\" \"Sure. Sometimes I\u0027m Abner Andrews, of Ash Pint, an\u0027 agin I\u0027m old Baron Rothschild, the Dook of Wellington, or some other guy. I guess I was the Dook all right when I walked over Joe Preston, though now I feel like old Boney Part when he was on that Island.\" The magistrate looked curiously at the prisoner. \"Don\u0027t you often get mixed up?\" he asked. \"Should say so. I\u0027m never jist sure who I am. It gives me a lot of trouble.\" \"Well, if that\u0027s the way you feel, Mr. Andrews, I think the proper place for you to be is the lunatic asylum and not here. Anyway, we\u0027ve got you now, and so must keep you for a while. Sergeant, you may take the prisoner down,\" he added, turning to the officer who had been standing quietly by during this interview. During the rest of the morning Abner paced up and down the room adjoining his cell. He knew very well how people would regard his imprisonment and how most of them would say it served him right. He wondered how long he would have to stay in that hole. He had not the remotest hope of getting out on bail, for he knew of no one interested in his welfare who was able to put up the money whatever it might be. He thought, too, of Joe Preston. Suppose the man should die, what then? He would be tried for murder, perhaps convicted, and he would be either hung or given a life-sentence in the penitentiary. The perspiration stood out in beads on his forehead as he thought of this, and it was a relief when the jailer brought him his dinner of bread and water. \"Is that the best this hotel kin afford?\" he demanded, as he took the mean meal. \"Hotel! This is no hotel,\" was the curt reply. \"This is the Klink, and that\u0027s the food fer birds that come here. It\u0027s more\u0027n they deserve, too.\" Abner stepped up close to, the iron grate, and looked fiercely at the jailor. \"De ye know who I am?\" he roared. \"H\u0027m, I have a pretty good idea.\" \"Ye think ye do, ye old goat. But I guess ye\u0027r mistaken. I\u0027m a public benefactor, that\u0027s what I am.\" \"A public benefactor!\" \"Sure. I did what many in this town were too cowardly to do. I gave Joe Preston the lickin\u0027 he desarved, an\u0027 this is the way I\u0027m treated fer it. I can\u0027t eat this dry stuff. Hurry up an\u0027 bring me a piece of roast chicken, with all the fixin\u0027s an\u0027 some plum puddin\u0027, an\u0027 don\u0027t fergit the cigars, either. Them\u0027s the things fer a public benefactor.\" Abner chuckled to himself as the jailor ambled away. \"They\u0027ll think I\u0027m luney, fer sure, the magistrate, an\u0027 the hull dang bunch, an\u0027 mebbe they\u0027ll not be fer astray. What\u0027s the use of bein\u0027 a public benefactor if ye\u0027ve got to eat this stuff?\" He glanced at the bread he was holding in his hands. \"Ugh! What trash! Heavy as lead, soggy, an\u0027 sure death. Well, I\u0027m not goin\u0027 to commit suicide yit a while. The rats kin if they want to.\" Tossing the bread into a corner of the room, he went into his narrow cell, and stretched himself out upon his hard rough cot. \"Might as well take life easy,\" he soliloquized. \"What\u0027s the use of worryin\u0027, anyway. Guess a nap\u0027ll do me good.\" He had no intention of sleeping and was quite surprised when he at length opened his eyes and saw a young man standing by his side. \"Where in h—l am I?\" the visitor unceremoniously asked. Abner looked curiously at the man without replying. He noted his bloodshot eyes, unshaven, haggard face, unkempt hair, and dirty, dishevelled clothes. \"Are you deaf?\" the fellow demanded. \"Didn\u0027t you hear what I said?\" \"Oh, yes, I heard, all right,\" Abner drawled. \"But I was merely tryin\u0027 to figger out what part of the hot place you\u0027ve jist come from.\" The wild-eyed youth emitted a hoarse mirthless laugh. \"I certainly have come from a hot place, the hottest I ever struck.\" \"Well, ye don\u0027t tell! Ye sartinly look it. Run up aginst somethin\u0027 pretty hard, eh?\" \"Should say so. Greatest ever. A hen, a real livin\u0027 hen in the shape of a woman; that\u0027s what it was.\" \"My, my,\" Abner commented, now becoming much interested. \"An\u0027 de ye consider ye\u0027rself a man to be knocked out by sich a critter?\" \"But you should have seen her. My G—d, it was awful! When she caught me by the hair with both hands, and pulled with all her might, I was sure my neck would be broken or my head would come off. \"That sartinly was some doin\u0027s, young man.\" \"Indeed it was, ye bet ye\u0027r boots. And when she added her blood-curdling screeches to her claws, I thought for sure a whole bunch of wild cats was on my back.\" \"Look here, young man,\" Abner remarked, rousing to a sitting position. \"You\u0027ve had the D.T.\u0027s; that\u0027s what\u0027s wrong with you. Guess ye\u0027ve been seein\u0027 things.\" \"But it\u0027s Gospel truth, I tell you,\" the other insisted. \"It was only last night, when I was taking a joy-ride in Dimock\u0027s car that it happened. I only meant a little fun at the old hen\u0027s expense, but, Lord! it proved the other way round.\" The mention of Dimock\u0027s car made Abner fully alert, and in an instant he surmised that this was the chauffeur who had run away with his wife. His first feeling was one of anger, accompanied by a strong impulse to give the fellow a threshing. He banished this idea, however, as another method of punishment flashed upon his mind. \"So ye got more\u0027n ye looked fer, eh?\" he at length queried. \"Should say so. I didn\u0027t expect to find such a wild cat in that old hen.\" \"Easy, go easy there,\" Abner warned, as he slowly doubled up his fists. \"Leave out all sich flourishes. They ain\u0027t becomin\u0027 when ye\u0027r speakin\u0027 of a woman. Mebbe she\u0027s somebody\u0027s wife an\u0027 mother.\" \"I pity them, then, whoever they are,\" the young man replied. \"Why, that she-devil ought to be put in a cage and placed on exhibition. When the car went into the ditch, because I couldn\u0027t see to steer, she bounded out like a rocket, seized a stick, and flew upon me like a whirlwind. My head and body are black and blue from her blows. It\u0027s a wonder I\u0027m alive to tell the story.\" \"It sartinly is, young man, it sartinly is,\" Abner assented. \"Ye\u0027r lucky to be alive, though perhaps it\u0027d have been better if she\u0027d finished ye outright.\" \"I almost wish she had,\" was the mournful agreement. \"I\u0027m sick, nearly dead, and in jail, as far as I can see.\" \"Oh, cheer up, young man, ye\u0027r troubles are jist beginnin\u0027. The worst is yit to come. Ye\u0027r in jail, all right, an\u0027 most likely ye\u0027ll stay here fer some time. But that ain\u0027t the worst that\u0027s comin\u0027 to ye.\" \"What do you mean?\" and a look of fear came into the chauffeur\u0027s eyes. \"Oh, you\u0027ll find out later when the Queen of Sheby brings in damages. Then ye\u0027ll squirm, let me tell ye that.\" \"The Queen of Sheby! Who in the devil is she?\" \"Why, the woman ye took fer a joy-ride last night. Ye see, she doesn\u0027t know much about autos. She\u0027s used to travellin\u0027 on camels, so I believe, an\u0027 they didn\u0027t go so fast.\" \"Travel on camels!\" the other gasped. \"Sure. She travelled over hundreds of miles on them hump-backed critters to see old King Solomon several thousand years ago.\" \"Say, what are you giving me?\" the chauffeur demanded. \"Do you think I\u0027m a fool? That wild cat is no queen and never was. She\u0027s the wife of Abner Andrews, a queer cuss, so I\u0027ve heard, who lives at Ash Point. Do you know him?\" \"Y\u0027bet I do. Better\u0027n his own brother. I\u0027ve known him fer several thousand years.\" The chauffeur did not reply, but stood staring at the man before him. He was trying to make out whether he was a fool or a madman. \"Yes,\" Abner continued, enjoying the other\u0027s astonishment. \"I knew that old feller well when he was rich old Baron Rothschild, the Dook of Wellington, old Boney Part, an\u0027 the husband of the Queen of Sheby.\" The chauffeur was now certain that Abner was making fun of him, and he was in no mood for any pleasantries. \"You must be a pretty old bird yourself,\" he retorted, \"if you knew all of those guys. It\u0027s no wonder you\u0027ve lost your brains, that is, if you ever had any. Who the devil are you, anyway?\" \"Me? Oh, it doesn\u0027t matter much who I am. But if ye want to know, I\u0027ll tell ye as a great secret that I\u0027m the Queen of Sheby\u0027s husband.\" \"The devil!\" \"No, I ain\u0027t his Satanic majesty. I\u0027m jist the Queen of Sheby\u0027s husband. She\u0027s allus ruled me, ye see, an\u0027 kept me to black her boots, button up her dress, an\u0027 do sich odd jobs that husbands are generally called upon to do. I have allus done as she said except that time several thousand years ago when she started to pay a visit to King Solomon. She had heard of his wisdom, an\u0027 thought she\u0027d like to see him, an\u0027 hear some of his wise sayin\u0027s. But, my lands, when I bucked up, an\u0027 said she couldn\u0027t go, she landed upon me jist like she did upon you last night. I had to be put to bed, rubbed with palm-olive oil, an\u0027 fed like a baby fer a hull month. By the time I was able to set up the Queen was somewheres out in the desert on her way to the wise old king. I kin sartinly sympathize with you, young feller, fer I\u0027ve been there meself, an\u0027 know what the Queen of Sheby is like when she gits roused.\" \"Look here,\" the chauffeur demanded, \"are you kidding me or are you a blooming fool? I can\u0027t see any connection between that old queen and the creature that landed on me last night.\" He paused and a sudden look of fear leaped into his eyes. \"Say,\" he gasped, \"surely you\u0027re not Abner Andrews, are you?\" \"I am an\u0027 I ain\u0027t. I was an\u0027 I isn\u0027t, so there ye are. Now kin ye jist tell me who I am, anyway?\" But the chauffeur did not wait to reply. He had retreated, and was out in the adjoining room when Abner had finished. \"Don\u0027t be skeered, young man,\" the latter remarked. \"Ye can\u0027t run very fer in this hole, anyway, an\u0027 I kin ketch ye whenever I want ye.\" \"Oh, Lord!\" the unhappy chauffeur groaned. \"It\u0027s her husband, and he\u0027s crazy! What am I to do?\" \"Hold ye\u0027r tongue, that\u0027s what ye kin do,\" Abner roared. \"De ye think I\u0027m goin\u0027 to kill ye right off? That\u0027d be too good fer the likes of you. Come in here an\u0027 set down, an\u0027 tell me why ye ran off with my queen.\" \"Your queen! Good heavens! Why didn\u0027t you tell me she belonged to you? Are you sure you\u0027re not crazy?\" \"I will be soon if ye don\u0027t stop ye\u0027r gab and set down. There, that\u0027s better,\" he continued, when the other had perched himself gingerly upon the edge of the cot. \"Now, look here, young feller, I want to know why ye chose my queen fer ye\u0027r joy-ride last night? It wasn\u0027t fer her beauty, or attractive manner, was it?\" \"Oh, Jerusalem, no!\" \"Well, why was it? Out with it.\" But the young man held down his head, and made no reply. Abner studied him for a few minutes in silence. \"Did somebody put ye up to that job?\" he presently enquired. \"Don\u0027t be afraid to tell me. But if ye don\u0027t, I\u0027ll be as tender with ye as a cat with a mouse. Somebody set ye on, didn\u0027t he?\" \"Yes,\" the chauffeur finally blurted out. \"Ah, I thought so. We\u0027re gittin\u0027 on nicely now with our little teeter game, you at one end, me at the other, an\u0027 someone in the middle. Now, who was that someone?\" \"It was Lawyer Rackshaw; that\u0027s who it was.\" \"H\u0027m, I guessed as much. I s\u0027pose he paid ye fer the job?\" \"Yes; money and whiskey.\" \"Ho, ho, money an\u0027 whiskey, eh? Well, I declare! An\u0027 all fer the sake of givin\u0027 the Queen of Sheby a joy-ride. He was sartinly kind. I wish he\u0027d been along too.\" \"So do I, the mean devil. He got me into the fix, and he\u0027ll snap his fingers at me now.\" \"Will he?\" \"Certainly. That\u0027s the kind he is.\" \"But can\u0027t you do somethin\u0027?\" \"Do! What can I do?\" \"Swear to what ye\u0027ve jist told me.\" \"Oh, yes, I\u0027ll swear to that at any old time. But what good will it do?\" \"It might do ye a lot of good, an\u0027 me too.\" \"You!\" \"Sure. I\u0027m in this hole fer bein\u0027 a public benefactor, an\u0027 if you\u0027ll jist swear to what ye\u0027ve told me, it might help us both out, see?\" \"Have you something against Rackshaw?\" \"Yes, a few things, more or less.\" \"Then I\u0027ll swear. But say, you\u0027ll not do anything to me for giving your wife that joy-ride last night, will you?\" \"No, no, that\u0027s all right, now that I know who put ye up to it. But look here, young feller, take an old man\u0027s advice and let whiskey alone after this. It\u0027s put a good many more chaps than you in the ditch when they were joy-ridin\u0027 with women. Yes, whiskey an\u0027 women have sartinly got many a fine bright chap into trouble, as ye know from experience. Women ain\u0027t allus what they seem, an\u0027 it\u0027s hard sometimes to tell the difference between the Queen of Sheby an\u0027 Tildy Andrews, of Ash Pint.\"","sourceLink":"http://novel.tingroom.com/jingdian/1683/49584.html","bookId":1171,"book":{"id":1171,"title":"The Touch of Abner","description":"简介： These words drawled slowly forth produced an immediate effect, and caused fifty people to straighten suddenly up and look enquiringly around. The reporter of The Live Wire gave one lightning glance toward the speaker, and then began to write rapidly...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1683","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
