{"id":15619,"no":8,"title":"CHAPTER VIII","content":"THE DUMP SCHEME \\n\\n \\n\\n \"I wonder what the critter wants now.\" \\n\\n \\n\\n \"Who is it from?\" Mrs. Andrews asked, as she paused in her work of beating an egg for one of her special company cakes. \\n\\n \\n\\n For a few minutes Abner studied the letter he was holding in his hand, and paid no attention to his wife\u0027s question. He read it through again very carefully, and when he finished he gave a grunt of disgust. \\n\\n \\n\\n \"It must be serious if it makes you feel like that,\" Mrs. Andrews ventured. \\n\\n \\n\\n \"Hey, what\u0027s that?\" Abner demanded. \"Was ye speakin\u0027, Tildy?\" \\n\\n \\n\\n \"Yes, I was. But what\u0027s the use of my speaking, when you\u0027re as deaf as a post. I was merely asking you who\u0027s the letter from?\" \\n\\n \\n\\n \"Why, it\u0027s from Lawyer Rackshaw. I thought I told ye.\" \\n\\n \\n\\n \"What does he want?\" \\n\\n \\n\\n \"He says he wants to see me on very important bizness. But I can\u0027t take the time to go to town this fine weather jist to see him. I\u0027ve got to git to work hayin\u0027.\" \\n\\n \\n\\n \"But you are going to town, anyway, in the morning, daddy,\" Jess reminded, looking up from the apples she was peeling. \\n\\n \\n\\n \"I am, eh? An\u0027 what for, I\u0027d like to know?\" \\n\\n \\n\\n \"Belle is coming on the morning train, and you must meet her.\" \\n\\n \\n\\n \"Oh, Lord!\" Abner groaned. \"I fergot all about her. Say, Jess, you take Jerry an\u0027 go fer her.\" \\n\\n \\n\\n \"I\u0027m afraid I can\u0027t, daddy. There is so much work I have to do in the morning that I must stay at home. And, besides, you have to see Lawyer Rackshaw.\" \\n\\n \\n\\n \"So I have, confound it! But how\u0027ll I know the gal when I see her, tell me that?\" \\n\\n \\n\\n \"Oh, you\u0027ll have no trouble. She has beautiful auburn hair.\" \\n\\n \\n\\n \"Red hair! Oh, my!\" and Abner spread out his hands in dismay. \"What next? Pink eyes?\" \\n\\n \\n\\n \"No, no,\" and Jess laughed. \"Not pink eyes, but sparkling dark ones, animated face, and such beautiful white teeth.\" \\n\\n \\n\\n \"Whew! I\u0027ll know the red hair, sparklin\u0027 eyes, an\u0027 animated face, all right, won\u0027t I, Tildy? I\u0027ll be Abner-on-the-spot as fer as they\u0027re consarned. But white teeth! How\u0027ll I know they\u0027re white? Will I have to ask her to open her mouth good an\u0027 wide so\u0027s I kin see?\" \\n\\n \\n\\n \"I guess that won\u0027t be necessary,\" Jess laughingly replied. \"As soon as Belle opens her mouth to speak, which she does very often, you will see her teeth, all right. You will know her anyway, for she is sure to be well dressed, and not likely she will be wearing any hat. It\u0027s a fad of hers.\" \\n\\n \\n\\n \"No hat! Gee whittaker! I wish you\u0027d do the same, Jess; it\u0027d save a lot of money.\" \\n\\n \\n\\n Abner rose to his feet, picked up his hat, and reached for his pipe. \\n\\n \\n\\n \"I\u0027m goin\u0027 over to see Lost Tribes, Tildy,\" he announced. \"I want to know how Widder Denton is makin\u0027 out with her kids. Anything ye want me to do before I go?\" \\n\\n \\n\\n \"Yes, you can bring in a pail of water and some wood. You might as well fasten up the chicken-coops, as I am too busy. I wish you\u0027d set a trap, for there was a skunk around last night.\" \\n\\n \\n\\n \"H\u0027m, is that so? Well, I guess it\u0027s the bear-trap I\u0027d better set. There\u0027ll be more skunks around this place before long, if I\u0027m not mistaken, an\u0027 two-legged ones at that. There was one here yesterday, but I soon cleared him out.\" \\n\\n \\n\\n \"Who was that?\" Mrs. Andrews sharply asked. \"What in the world were you up to?\" \\n\\n \\n\\n \"It was Ikey Dimock. He was the skunk. He wants to buy our farm fer a summer place. What de ye think o\u0027 that?\" \\n\\n \\n\\n Abner slipped out of the house before his wife could recover from her astonishment to question him further. \\n\\n \\n\\n \"I\u0027ve given Tildy a jolt,\" he chuckled, as he moved across the field toward Zeb\u0027s house. \"I wonder what she\u0027d think of the Dimocks livin\u0027 here? Mebbe it\u0027ll make her consider the old place is of some value after all.\" \\n\\n \\n\\n Abner soon returned, harnessed Jerry and drove into town. He was hitching his horse to the post near the station-house when the agent appeared around the corner of the building. \\n\\n \\n\\n \"Mornin\u0027, Sam,\" he accosted. \"How\u0027s the train?\" \\n\\n \\n\\n \"On time,\" was the reply. \"Expecting anyone?\" \\n\\n \\n\\n Abner gave the rope a final yank, and then turned toward the agent. \\n\\n \\n\\n \"Say, Sam,\" he began, \"will ye do me a favor?\" \\n\\n \\n\\n \"What is it?\" \\n\\n \\n\\n \"Well, ye see, I\u0027m expectin\u0027 company on the train this mornin\u0027, an\u0027 as you\u0027re mighty slick with women folks I thought mebbe ye\u0027d meet her, in case I don\u0027t git back in time.\" \\n\\n \\n\\n \"Meet who?\" Sam demanded in surprise. \\n\\n \\n\\n \"Why, Belle Rivers, of course. Didn\u0027t I tell ye? She\u0027s the \u0027torney General\u0027s gal, an\u0027 she\u0027s comin\u0027 on a visit to our place. I\u0027m here to meet her, but if you\u0027d do it fer me, break the ice, so to speak, I\u0027d consider it a great favor.\" \\n\\n \\n\\n Sam was all alert now, and keen with interest. The Attorney General Rivers\u0027 daughter! What a piece of news he would have for the reporter of The Live Wire when he made his regular afternoon call. The whole town would be agog at the news, and he mentally pictured the excitement of Mrs. Dimock and Mrs. Rackshaw when they heard it. \\n\\n \\n\\n \"Will ye do it, Sam?\" Abner asked. \\n\\n \\n\\n \"Sure, I shall be only too delighted. But how shall I know her?\" \\n\\n \\n\\n \"Oh, ye\u0027ll have no trouble. Let me see,\" and Abner scratched the back of his head. \"Jess gave me a full description. She\u0027s got hair like fire; eyes like diamonds; cheeks like roses; and teeth like the white of an egg; dresses like one of the fashion picters, an\u0027 doesn\u0027t wear any hat.\" \\n\\n \\n\\n \"Gee whiz!\" Sam exclaimed. \"If she\u0027s all that she must be worth looking at. And, say, Mr. Andrews, I didn\u0027t know you were so poetical.\" \\n\\n \\n\\n \"Poetical! What de ye mean?\" \\n\\n \\n\\n \"Why, the way you described Miss Rivers. I never heard you use such language before.\" \\n\\n \\n\\n \"Oh, that ain\u0027t nuthin\u0027 to what I kin do. Ye should hear me when Bill Kincaid\u0027s cows break into my oats. Then ye\u0027d know somethin\u0027 about my command of the English language.\" \\n\\n \\n\\n \"I guess there wouldn\u0027t be much poetry about such language, would there?\" Sam smilingly bantered. \"A poet, for instance, needs to be inspired, so I understand.\" \\n\\n \\n\\n \"An\u0027 de ye think I\u0027m not inspired when I\u0027m chasin\u0027 them cows? Tildy says I am, an\u0027 I guess the cows do, too, by the way they run. I know I feel inspired, anyway, an\u0027 I\u0027m all het up an\u0027 excited fer the rest of the day. That\u0027s the way poets look when they\u0027re inspired, accordin\u0027 to the picters I\u0027ve seen of \u0027em. But, there, I must be off. Ye\u0027ll look after that gal, Sam, like a good feller, won\u0027t ye? Show her my waggon there, an\u0027 tell her she kin study the sights of the town while she waits. If she\u0027s nervous, homesick, or anythin\u0027 like that, ye might take her into the waitin\u0027-room. I\u0027ll make it all right with ye, Sam. Don\u0027t fergit what she looks like, \u0027specially the red hair.\" \\n\\n \\n\\n Lawyer Rackshaw was seated at his office desk as Abner entered. He rose briskly to his feet, and grasped the farmer by the hand. \\n\\n \\n\\n \"I\u0027ve just come in,\" he told him, \"and am enjoying my usual morning smoke. Sit right down and have a cigar.\" \\n\\n \\n\\n \"Another ten-center, eh?\" Abner queried, as he sat down, crossed his legs, bit off the end of the Havana, and struck a match. \\n\\n \\n\\n \"Yes, Mr. Andrews, it\u0027s the real thing, all right. I was quite certain you would call to-day, and so had it ready. You received my letter?\" \\n\\n \\n\\n \"Sure; that\u0027s why I\u0027m here. I allus hustle when I git a letter from a lawyer jist the same as I do when a hen hollers, fer then I know a hawk\u0027s after her. It\u0027s a sure sign there\u0027s somethin\u0027 important astir.\" \\n\\n \\n\\n A peculiar smile lurked in the lawyer\u0027s eyes as he reached out and picked up a paper lying upon the desk. \\n\\n \\n\\n \"I hope this is not a case of the hen and the hawk,\" he replied, as he tilted back in his chair and bent his eyes on the paper. \\n\\n \\n\\n \"Hope not,\" Abner sighed, as he blew forth a great cloud of smoke. \"But, then, one kin never tell.\" \\n\\n \\n\\n \"This has merely to do with the new Orphan Home,\" the lawyer explained, \"and no matter what tricks there might be in other matters, there must be nothing shady in a transaction where poor helpless children are concerned.\" \\n\\n \\n\\n \"Ye\u0027re sartinly right,\" Abner assented. \"When it comes to the care of poor little orphans everythin\u0027 must be squared with the great Golden Rule, as old Parson Shaw used to say. How\u0027s the Home gittin\u0027 along, anyway?\" \\n\\n \\n\\n \"First rate. It\u0027s in connection with that I wish to speak to you to-day.\" \\n\\n \\n\\n \"I thought so. Is the buildin\u0027 up yit?\" \\n\\n \\n\\n \"Oh, no. It\u0027s been such a short time since the meeting that we\u0027ve been able to do little more than settle upon a suitable situation for the institution. We have given considerable thought to the matter, and are most fortunate in obtaining a plot of ground at a very reasonable cost.\" \\n\\n \\n\\n \"Cost!\" Abner exclaimed in astonishment. \"Will it cost anythin\u0027 fer a piece of ground fer the Home? Why, there\u0027s lots of idle land in this town.\" \\n\\n \\n\\n \"But none so suitable as the one we have settled upon. And it is reasonable, too, considering the many advantages connected with it, such as the fine view, and the distance from private dwellings. It will cost us only one thousand dollars for such a situation as that.\" \\n\\n \\n\\n \"One thousand dollars!\" Abner almost leaped out of his chair. \"Good Lord! Has this town come to that, when it wants one thousand dollars fer a piece of ground fer an Orphan Home! Where is this wonderful spot, I\u0027d like to know, an\u0027 who owns it?\" \\n\\n \\n\\n \"It lies just outside of the town, near the creek, and is a part of the land owned by Mr. Henry Whittles.\" \\n\\n \\n\\n \"What! The dump?\" \\n\\n \\n\\n \"Well, you see, it\u0027s not all dump, as there is more land surrounding it which will make an excellent playground for the children.\" \\n\\n \\n\\n \"An\u0027 Hen Whittles wants one thousand dollars fer that?\" \\n\\n \\n\\n \"He says he is willing to let it go at that sum, considering what it is to be used for.\" \\n\\n \\n\\n \"He is sartinly generous. An\u0027 so I s\u0027pose ye want the money I offered to pay fer it, eh?\" \\n\\n \\n\\n \"Yes, if you can find it convenient to let us have it now. As soon as we get the matter of the land settled we can rush the building along.\" \\n\\n \\n\\n This was more than Abner could stand. His pent-up wrath and righteous indignation could be controlled no longer. Bounding from his seat, he towered above the legal light of Glucom. He thrust out his big right hand toward the lawyer\u0027s face, forgetting in his excitement that the fingers of that hand clutched the partly smoked cigar. He hardly realized what he was doing. But the lawyer did, and when the hot end of the cigar came into sudden contact with the tip of his nose, he emitted a yell of pain and lurched violently back in an effort to escape the onslaught. The result was most disastrous, for the sudden recoil sent swivel-chair and occupant backwards upon the floor. \\n\\n \\n\\n With as much dignity as possible the lawyer picked himself up, righted the chair, and sat down again. He was mad, and longed to turn his sharp tongue upon the cause of the disaster. But he was shrewd enough to control his temper, and pretend to make light of the mishap. He would get more than even in due time. But the end of his nose was smarting painfully, and he could not keep his fingers away from the injured member. \\n\\n \\n\\n Abner was at first surprised at the lawyer\u0027s sudden collapse. Then a smile lightened his face. \\n\\n \\n\\n \"De ye do that every day?\" he asked. \\n\\n \\n\\n \"Do what?\" \\n\\n \\n\\n \"Cut up sich capers. Regular mornin\u0027 exercise, I s\u0027pose.\" \\n\\n \\n\\n \"Certainly not. Do you think I\u0027m accustomed to having a hot cigar dashed into my nose every morning?\" \\n\\n \\n\\n \"Well, it\u0027s not altogether likely, oh, no. But judgin\u0027 by the color of ye\u0027r nose I\u0027d say it\u0027s been affected by somethin\u0027 more fiery than a hot ten-cent cigar.\" \\n\\n \\n\\n \"Ye do, eh?\" The lawyer was visibly irritated now. \\n\\n \\n\\n \"I sure do. But that was an inward application, while mine was outward. It was merely a touch of Abner Andrews, of Ash Pint, an\u0027 when an\u0027 where he touches there\u0027s ginerally somethin\u0027 doin\u0027 which ain\u0027t allus pleasant to the feelin\u0027s, either.\" \\n\\n \\n\\n \"I hope your touch is not always as hot as the one you just applied to my nose, anyway,\" the lawyer replied. \\n\\n \\n\\n \"Oh, it\u0027s a dam sight hotter sometimes, let me tell ye that, \u0027specially when there\u0027s somethin\u0027 crooked afoot.\" \\n\\n \\n\\n \"What are you driving at?\" \\n\\n \\n\\n \"What am I drivin\u0027 at? Why, at that Orphan Home affair. It jist twists me all to pieces when I think of Hen Whittles wantin\u0027 one thousand dollars fer that dump of his, an\u0027 him one of the richest men in Glucom, at that.\" \\n\\n \\n\\n \"But surely you don\u0027t expect him to give it for nothing, do you?\" the lawyer queried. \\n\\n \\n\\n \"An\u0027 why not? It\u0027s worth nuthin\u0027, an\u0027 what\u0027s more, Hen Whittles should be fined fer keepin\u0027 sich a disgraceful place so near town. Every time I drive past that spot I have to hold me nose, the smell is so bad. An\u0027 sich a mess of stuff! Tin cans, dead cats an\u0027 dogs, an\u0027 every blamed thing that isn\u0027t of any use is dumped there. It\u0027d take more\u0027n a thousand dollars to clean it up. The Board of Health should git after Hen an\u0027 make him squirm like an angle-worm on a hook.\" \\n\\n \\n\\n \"But what are we going to do about it?\" the lawyer asked, now greatly annoyed. \\n\\n \\n\\n \"Do about it?\" Abner roared, rising to his feet. \"Why, git a decent place, of course. There\u0027s lots of land in town fer that Home without puttin\u0027 it on top of a stinkin\u0027 dump.\" \\n\\n \\n\\n \"But suppose we can\u0027t get any other place?\" \\n\\n \\n\\n \"Then come to Ash Pint. If the people of this town are as mean as all that, I\u0027ll give \u0027em all the land they want fer the Home. An\u0027 it\u0027ll be clean land, too, with a great view, plenty of fresh air, an\u0027 the river right near where the youngsters kin swim. That\u0027s all I\u0027ve got to say.\" \\n\\n \\n\\n Abner picked up his hat and started for the door when the lawyer detained him. \\n\\n \\n\\n \"Surely you\u0027re not going to back down,\" he coolly remarked. \\n\\n \\n\\n \"Back down! On what?\" \\n\\n \\n\\n \"On the offer you made, that is, the money you promised to give for the Home.\" \\n\\n \\n\\n \"Back down! No! Did ye ever hear of Abner Andrews backin\u0027 down? I\u0027m jist buckin\u0027 up, that\u0027s what I\u0027m doin\u0027. I\u0027m not goin\u0027 to give a red cent fer Hen Whittles\u0027 stinkin\u0027 dump, so you an\u0027 the rest of the gang kin chew on that fer a while.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1683/49576.html","bookId":1171,"book":{"id":1171,"title":"The Touch of Abner","description":"简介： These words drawled slowly forth produced an immediate effect, and caused fifty people to straighten suddenly up and look enquiringly around. The reporter of The Live Wire gave one lightning glance toward the speaker, and then began to write rapidly...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1683","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
