{"id":106676,"no":11,"title":"Page 11","content":"Before the biga was entirely stopped, Ignatia had jumped out of the vehicle and was running toward the gate of Domina Clemens\u0027 house, her face flushed, her eyes reddened from weeping. She pounded on the gates, shouting for someone to admit her, while Philius brought his pair to a halt and turned them around in the space in front of the Temple of Hercules, then came back to the gate where Ignatia was still demanding to be let in, announcing her name and her mission. A waning moon imparted its gelid light from the eastern sky, marking the first clear night in the last four.\\n\\n \"Do you know how late it is?\" a sleepy voice asked from behind the sturdy upright planks of the gate. \"Call back at a sensible hour, and the master will see you, if it is convenient.\"\\n\\n It took all of Ignatia\u0027s determination to give a sensible answer. \"It\u0027s very late, I know, and I apologize. But this is urgent. Most urgent. I would not have come if it weren\u0027t.\" Toward the end of her words, she managed to steady her voice enough that her sobbing was no longer apparent.\\n\\n \"It is unsafe to be abroad at this hour,\" the voice admonished her. \"Women of good character should not be abroad this late.\"\\n\\n \"That is no business of yours: you forget yourself,\" Ignatia yelled, no longer adhering to her discipline of a moment ago, but giving her temper free rein. \"Let me in! I must see Sanct-Franciscus!\"\\n\\n \"You could be set upon by ruffians or worse,\" said the slave, \"riding abroad at this time of night.\"\\n\\n \"My groom carries a whip and a cudgel. Not that it is any concern of yours. What does it matter to you? We are wasting time,\" Ignatia said firmly, and tried to keep her tone steady. \"Is Sanct-Franciscus about? I must speak with him. Now!\" She bludgeoned the gate for emphasis.\\n\\n \"Yes, he is here. He is in his study; we are not to disturb him,\" said the under-steward, taking a deep breath. \"You must wait until morning, I fear.\"\\n\\n \"Let me in!\" Ignatia shouted. \"My mother has fallen into a lethargy and has not awakened since early afternoon yesterday.\"\\n\\n \"Do you mean twelve hours since, or thirty-six?\" the slave asked, curious in spite of the hour and the circumstances of this most unseemly demand.\\n\\n \"Thirty-six. Thirty-six! I would not bother your master for less than that,\" Ignatia said, her voice beginning to falter. \"Let me speak with him. If he says there is no reason for concern, I will leave, I promise you. I am sorry to intrude-you may tell him that. Just let me talk with him for a little while. Please.\"\\n\\n \"I will tell him you are here, and why. If he is willing to see you, I will escort him to the gate.\" Tigilus coughed for emphasis. \"Wait here.\"\\n\\n \"Even though it is dangerous?\" Ignatia asked with an edge in her voice.\\n\\n There was a pause, and then Tigilus said, \"I will admit you, but you must remain in the courtyard. You may not come into the house unless the master permits it.\"\\n\\n \"Thank you for that,\" Ignatia said, keeping the sarcasm out of her response. She motioned to Philius. \"You heard him. We\u0027re being admitted to the courtyard.\"\\n\\n The sound of the bolt being drawn back seemed unusually loud in the night, and the moan of the hinges was like the sighing of giants. As soon as there was room enough, Philius put the biga through, Ignatia following behind. Tigilus pointed the way to the stable, saying, \"There is a night-groom who will see to you and your pair. You had best stay with them until you are needed.\" Then he indicated a small alcove along the inner peristyle. \"Wait there,\" he said to Ignatia; with a shrug of annoyance, he trudged off into the house, across the atrium and on to the study where Sanct-Franciscus was working at a beehive-shaped oven that had been installed at the far end of the room. The athanor was hot, the door closed and bolted shut so that the jewels being made within it would not be damaged by a sudden lessening of heat.\\n\\n \"What is it, Tigilus?\" Sanct-Franciscus asked as the under-steward tapped at the door.\\n\\n \"Doma Laelius is here,\" said Tigilus.\\n\\n \"At this hour?\" Sanct-Franciscus sounded more worried than surprised.\\n\\n \"You\u0027re right: it is too late. I will send her away,\" Tigilus offered.\\n\\n \"Did she say why she came?\" Sanct-Franciscus began to bank the fires of his athanor, preparing to leave at the mention of Ignatia.\\n\\n \"Her mother has been in lethargy for thirty-six hours, or so she claims,\" said Tigilus.\\n\\n \"How deep a lethargy? do you know?\" Sanct-Franciscus opened a tall, red-lacquer chest, and began to select unguents and vials from its pigeon-hole shelves.\\n\\n \"No,\" said Tigilus, not wanting to admit he had not asked. \"She came with a groom, in a biga.\"\\n\\n \"Very sensible, and more useful than a messenger,\" said Sanct-Franciscus as he packed the items he had selected into a small, leather case. \"Have one of the night-slaves come in here, to be sure my oven cools properly. There is a pail of water at the end of the trestle-table if he needs to stop a fire.\"\\n\\n \"Do you anticipate fire?\" Tigilus could not keep from inquiring.\\n\\n \"No, but it is well to be prepared,\" Sanct-Franciscus answered. \"Where is Doma Laelius?\"\\n\\n \"In the courtyard,\" said Tigilus, sounding a bit uncertain.\\n\\n \"You should have brought her into the house, and provided her with hot wine to drink,\" said Sanct-Franciscus as he picked up his abolla and pulled it on, then made for the door, his leather case in hand. \"She has a position in the world that must be recognized.\"\\n\\n Tigilus stood aside as Sanct-Franciscus came out of his study and closed the door. \"She is waiting.\"\\n\\n \"So I assumed,\" said Sanct-Franciscus. \"I will go with her, of course.\"\\n\\n \"She\u0027ll be relieved,\" said Tigilus with a suggestion of sarcasm in his observation; he took as step back as Sanct-Franciscus turned toward him.\\n\\n \"Why do you slight her? Have you taken her in dislike?\" Sanct-Franciscus asked.\\n\\n \"Slaves have no opinions on such things,\" said Tigilus.\\n\\n \"Of course you do,\" Sanct-Franciscus countered. \"You may tell me what they are.\"\\n\\n Tigilus hesitated. \"I don\u0027t dislike her; it is only that she clings on you, so that troubles me. What manner of character has she, that she would have to do that?\" He sniffed to underscore his disapproval.\\n\\n \"Is it that she lacks resolve in your eyes or that she depends upon a foreigner instead of a Roman?\" Sanct-Franciscus did not wait for an answer, but went on, \"Do not speak slightingly of that young woman. She has had heavy burdens placed upon her that she cannot hope to discharge, but which she bears nonetheless. If nothing else, her devotion deserves our respect.\" He continued on, his steps loud in the stillness while Tigilus fell behind, chagrined and perplexed.\\n\\n \"Sanct-Franciscus,\" Ignatia exclaimed as she saw him come out of the house. \"You have decided to see me.\"\\n\\n \"I have decided to accompany you to your house,\" said Sanct-Franciscus, and saw her pinch her nose to keep from crying again. \"Tell me about your mother.\"\\n\\n Ignatia waved, signaling Philius to bring the biga out of the stable, and as she climbed into the open chariot, she made room for Sanct-Franciscus beside her. \"My mother is in a very bad state, I fear. I hoped she would ... that she would revive of her own inclination, but ... It began a day-and-a-half ago.\" Taking a deep breath, she launched into her account. \"She had been fretful all morning, and I was at a loss to ease her discomforts. She ordered Starus to beat Benona because something Benona did displeased her-he didn\u0027t, on my enjoining him not to, but now Benona has asked not to have to attend to her, and she is better in the sick-room than any of the rest. My mother refused the honied wine I had made for her, and she would not eat anything more than bread with baked marrow spread on it.\" She took a second, uneven breath as the courtyard gate was opened and Philius snapped the pair to a trot. \"Then she became calmer, and I thought she had improved; I ordered a prandium made for her, which she refused, but which was entirely dishes she usually likes. She said she wanted to be left alone, to rest. But she soon fell into a slumber that was more than sleep. I have tried to rouse her, but without success. She continued in her dazed condition, neither sinking deeper nor emerging from it. When she did not waken after our evening meal, I became more worried, so I watched her, which is when I discovered that her eyes were open a little, showing only whites, and that is when I decided to seek you out.\"\\n\\n \"Has she urinated or-\" Sanct-Franciscus began.\\n\\n \"Once. I ordered her sheets and blankets changed, but carefully, so she would not be disturbed. I thought she needed to sleep, you see. She had complained of not sleeping just a few days ago, and it seemed to me that she must require ...\" She made a complicated gesture, composed of distress, guilt, and a need to put it all aside. \"That was yesterday, when she had been asleep for four or five hours. She has eaten so little that nothing else has left her body, and that worries me. She eats no more than a kitten, and she drinks two cups of water in a day at most.\"\\n\\n \"Insufficient to support life, if carried on for long,\" said Sanct-Franciscus. \"That is something we must attend to, whether or not we waken her.\"\\n\\n \"You can cause her to drink though she sleeps?\" said Ignatia, her dubiety making the comment into a question.\\n\\n \"I hope to, yes, with your help,\" Sanct-Franciscus answered.\\n\\n Ignatia considered this, then asked, \"Do you think you can-waken her?\" her voice rising in near-panic.\\n\\n \"I trust I may,\" he said, taking hold of the side of the biga as it swayed around a particularly steep corner. \"Do you have a slave keeping watch on her?\"\\n\\n \"When I am not tending to her myself, I do. She prefers me to sit with her.\"\\n\\n \"No doubt,\" said Sanct-Franciscus, and fell silent for a short while.\\n\\n \"Have you ever seen this condition before?\" Ignatia pursued when the quiet began to trouble her.\\n\\n \"A few times, yes,\" he said, thinking back to various forms of stupor he had observed during his centuries of service in the Temple of Imhotep. He had encountered such relentless semiconsciousness a few times since then, and was aware that the probable outcome was not what Ignatia would want, for even if Adicia recovered from her stupor, it would be likely that she would suffer a change from it, and not for the better.\\n\\n \"Was the outcome ... satisfactory?\" Ignatia almost held her breath.\\n\\n \"In two cases the sufferer made a good recovery,\" said Sanct-Franciscus, keeping his demeanor as calm as he was able.\\n\\n \"Two cases. Only two,\" said Ignatia.\\n\\n \"Three others less so,\" he admitted.\\n\\n \"And what do you think my mother will ...\" Her question faded, unfinished.\\n\\n \"Until I see her, I have no way to determine that,\" he told her gently.\\n\\n The biga turned toward the Laelius house, the horses beginning to labor; Philius pulled them in to a walk, saying, \"It isn\u0027t much farther to go, Doma, and they are tired.\"\\n\\n \"Niger and Neva deserve a respite,\" said Ignatia. \"I hope they won\u0027t be harmed by this night\u0027s work.\"\\n\\n \"They shouldn\u0027t be,\" said Philius. \"I will see they are walked before I brush them down and stall them again.\"\\n\\n \"I will tell Starus that you need not rise at dawn with the others, Philius,\" said Ignatia. \"You have earned your rest. And so have the pair.\" She smiled in the direction of Neva and Niger as if the horses would recognize her gratitude.\\n\\n \"I thank you, Doma; I\u0027ll give them an extra measure of grain,\" said Philius, expertly negotiating the narrow approach to the front of the Laelius house; he pulled in his pair so that Ignatia and Sanct-Franciscus could alight.\\n\\n \"That\u0027s very good of you,\" said Ignatia, stepping down from the biga after Sanct-Franciscus had done so. \"I will see you later in the morning, and you may be certain that I will reward your service.\"\\n\\n \"Thank you, Doma,\" said Philius as he started the horses moving toward the stable.\\n\\n \"Starus has waited to admit us,\" said Ignatia to Sanct-Franciscus as she hastened toward the door. \"Half the house is awake, I venture.\" She rapped on the door, adding with a quivering smile, \"Ironic, isn\u0027t it? that we should be awake because my mother is asleep?\"\\n\\n \"And sad,\" Sanct-Franciscus said as the door was opened for them. Crossing the threshold on his right foot, he turned to Starus, and began without other salutation, \"How is Domina Laelius?\"\\n\\n \"She sleeps. Still,\" said Starus, and then went on to Ignatia. \"Your brother\u0027s gone out. He said he is going to ask his Christian friends to pray for your mother.\"\\n\\n Ignatia gave a little, vexed shake of her head after lighting an oil-lamp over the lares in their alcove next to the door. \"Well, that may be more useful than fretting about here. At least he won\u0027t bother the household.\"\\n\\n \"He didn\u0027t say when he\u0027d be back,\" Starus added.\\n\\n \"That cannot concern me just now,\" said Ignatia with an expression that revealed her irritation with her brother more than her words did. \"Who is with my mother?\"\\n\\n \"Tallia, but she is very tired, and needs to rest,\" said Starus. \"Had you been away much longer, I was going to wake Mirza to relieve Tallia.\"\\n\\n \"I will take her place,\" said Sanct-Franciscus, starting toward the corridor that led to Domina Laelius\u0027 bedchamber, Ignatia keeping pace with him, Starus trudging behind. \"I want a ewer of boiled water mixed with a little salt and honey brought to her room, and a basin of warm oil. In an hour I will want help from a woman with strong hands-\"\\n\\n \"I will do whatever you require,\" said Ignatia.\\n\\n \"You may want help before this is done,\" said Sanct-Franciscus. \"We may be working through the night and into the morning.\"\\n\\n \"I will summon help when it is wanted,\" Ignatia said with deep determination.\\n\\n \"As you wish,\" said Sanct-Franciscus, and made the turn into Adicia\u0027s room.\\n\\n Four branches of oil-lamps provided illumination, revealing both Adicia herself, lying still beneath her covers, and Tallia, seated on a stool, chin propped on her hands, elbows on her knees, her face slack with fatigue. She rose as Sanct-Franciscus and Ignatia came into the room, rubbing her eyes carefully and trying to show herself to be ready for any task.\\n\\n \"You may go to bed, Tallia, Sleep as long as you must,\" said Ignatia, going to Adicia\u0027s bedside and bending over her. \"No change, I see.\"\\n\\n \"No, Doma, none,\" said Tallia. \"I would have told Starus had there been.\" She started toward the door. \"When will you need me?\"\\n\\n \"When you waken. Starus will not summon you until you rise,\" said Ignatia, stepping back to allow Sanct-Franciscus to examine his patient.\\n\\n Sanct-Franciscus pulled one branch of oil-lamps nearer, for although his dark-seeing eyes did not require the additional light, he knew the eyes of the living did, and this difference would set him apart from those around him, leading to the kind of scrutiny he could not withstand. \"She must have water with honey and salt. If you will bring a linen cloth, a moist one, and place it over her mouth, then wet it often with the water she needs, she will not suffer descication, which can be as deadly as this lethargy.\"\\n\\n \"Starus will bring the things you want,\" said Ignatia, bending over her mother once more. \"Her eyes are unchanged.\"\\n\\n \"She is breathing, shallowly but steadily,\" said Sanct-Franciscus. \"This means that she may still respond.\"\\n\\n \"Respond-not recover,\" said Ignatia.\\n\\n \"Respond is a safer assumption. Recovery is more problematic in cases like this. It will depend on how much strength she can muster, and there is no way you or I may determine that.\" He touched her hand-it felt like vellum, and he shook his head. \"Moisture is the most pressing problem.\"\\n\\n \"I will get the linen for you. But you see?-her mouth is closed. How can she be induced to drink?\"\\n\\n \"A small fold in the linen will part her lips, and for now, that is all that is needed.\"\\n\\n Ignatia gave a little sigh. \"Are you sure you aren\u0027t trying to soften the blow for me? You do not think she is dying?\"\\n\\n Sanct-Franciscus moved back from the bed to face Ignatia. \"Do you mean that I think she might die? Yes, I do. But if you mean that I think she shall die, no, I do not: not now, not yet, not from this, not if she can take liquid.\" He put his hand on her shoulder. \"If she continues this way for another two days without being able to drink, then there will be little chance of saving her. But we must do all we can to bring about an awakening.\"\\n\\n \"Yes. I think we must,\" said Ignatia, then went on in another, more matter-of-fact tone. \"A box of spices was brought to her yesterday, from the Emperor\u0027s grandmother, with a most flattering note; they have been great friends in times past. When my mother is better, I will read it to her. Julia Maesa is the real power in that family, not her grandson or her daughters or daughters-in-law, so her attention will mean a great deal to my mother.\"\\n\\n \"An excellent notion,\" said Sanct-Franciscus. \"If you will, get the linen, and I hope Starus will bring the ewer of honey-and-salt water. I will add an elixir to that, and you may begin to offer her water.\"\\n\\n \"Do you think ... ,\" she began, then faltered. \"No, I won\u0027t ask you any more until after dawn.\" She moved back from the bed. \"However this turns out, I thank you from the bottom of my heart. I shall tell my uncle how much you have done for my mother.\" To express her sincerity, she rose on the balls of her feet and kissed his cheek. \"I am in your debt.\"\\n\\n A thousand years ago, Sanct-Franciscus thought, he might have taken advantage of her vulnerability, but he had learned how dangerous such pursuits could be; so he took her hand in his. \"You owe me nothing, Doma: believe this.\"\\n\\n Her smile was uncertain, but she left him with her mother while she went to get the linen and to urge Starus to ready the ewer of water. She felt strangely light-headed and she found it hard to concentrate. As she made her way along the corridor, she amazed herself by skipping once, then, chagrined at such a lapse, made herself walk more steadily, eyes downcast as suited this present occasion. She told herself that she was giddy from worry and enervation, but she knew that was not the whole cause; she lifted the hand Sanct-Franciscus had held and was surprised to find it unchanged. Inwardly chiding herself for such frivolity, she entered the kitchens and called out to Starus, doing her utmost to sound firm and devoted.\\n\\n When she returned to her mother\u0027s room, Starus was with her, bearing the ewer. \"How big a basin of oil do you need?\" he asked Sanct-Franciscus as he set the ewer down.\\n\\n \"Not a large one,\" said Sanct-Franciscus; he had repositioned Adicia on her pillows so that she was directly on her back, and her lips slightly parted. \"Doma, if you will?\" He indicated where he had placed the stool by the bed.\\n\\n \"Certainly,\" said Ignatia, handing him a damp square of linen. \"Is this what you wanted?\"\\n\\n \"Yes. Very good,\" Sanct-Franciscus approved, folding the square in thirds and making a crease in the middle. He placed this over Adicia\u0027s mouth, the crease holding her mouth open, then said to Ignatia. \"I will give you a measure; use it to keep the water in the crease wet enough to continue to drip down her tongue. Tell me if she doesn\u0027t swallow, but I think she will.\"\\n\\n Concealing her doubts, Ignatia did as she was told. \"Is this what Galen taught?\"\\n\\n \"No, although he was an excellent teacher,\" said Sanct-Franciscus, taking a small ladle off a ring of measures hanging on his belt. \"Let me put my elixir in the water\"-he took a rose-colored vial from his case and poured half its contents into the ewer-\"and now you are ready to begin.\"\\n\\n Ignatia watched Sanct-Franciscus spoon out a little of the water and slowly pour it onto the crease in the linen. \"I see.\" She took the measure from him and repeated what he had done. \"Is this proper?\"\\n\\n \"It is,\" he said, and went back to his case; he removed a jar of unguent and a container of powder, which he set on the table near the bed. \"I am going to mix a salve that should help to increase her pulse, which is a first step in reviving her.\" He added to himself, if she is able to waken.\\n\\n \"Won\u0027t that be dangerous?\" Ignatia asked.\\n\\n \"No, not in her present state. Her breath does not smell of stale meat, nor of ruined cheese, so it is likely that she will be able to have her pulse sped up without risking a seizure.\" He continued with his preparations. \"This salve is to be applied before the warm oil is rubbed into her hands and feet.\"\\n\\n \"All right,\" said Ignatia, watching him with an intensity that verged on adoration; she scooped another measure of water from the ewer and dribbled it onto the folded linen; to her astonishment, Adicia swallowed. \"Bona Dea!\" she exclaimed.\\n\\n \"What?\" Sanct-Franciscus asked, interrupting his work.\\n\\n \"She swallowed. I saw it. I felt it.\" She stared at him. \"How did you know?\"\\n\\n He touched her arm. \"One swallow is a good sign, but there is still a long way to go,\" he reminded her.\\n\\n \"Do you say so?\" The smile that suffused her features was radiant. \"It is more than I ... hoped.\"\\n\\n \"Perhaps,\" he said carefully. \"Let us see how she fares for the rest of the night. It is three hours until dawn. If she is still doing well by then, I think you may be encouraged for your mother\u0027s sake.\"\\n\\n \"I am encouraged already,\" said Ignatia.\\n\\n Sanct-Franciscus looked away from her, making his final preparations for the next phase of his treatment. \"Whatever the outcome, you have served Domina Laelius well.\"\\n\\n \"Because of your instruction, Sanct-Franciscus,\" she said, adding more treated water to the linen. She kept steadily at the task while Sanct-Franciscus made his salve and smeared it first on Adicia\u0027s hands, then on her feet, then rubbed it well into her skin with the warm oil Starus brought; in spite of the gravity of her mother\u0027s condition, Ignatia was almost overcome with happiness, and although it was an undutiful wish, she hoped the dawn would delay its arrival so that she would not have to give up this wondrous time almost alone with Sanct-Franciscus.\\n\\n Text of a letter from Almericus Philetus Euppo, freedman and mercer of Ostia, to Ragoczy Germainus Sanct-Franciscus at Roma, carried by private messenger.\\n\\n To the most excellent exile, Ragoczy Germainus Sanct-Franciscus living near the Temple of Hercules in Roma, the greetings of Almericus Philetus Euppo at Ostia, and the promise of delivery of spices from Alexandria, as well as private missives and two bolts of black linen, which this messenger shall have in charge.\\n\\n There has been another debasing of coins, as- you must know. The Emperor is too young, I suspect, to realize what damage his greed is inflicting on Roman merchants in our trading throughout the Empire and beyond. Just a month ago, I had to spend thirty percent more for a cargo of silk than I had originally bid because the denarii have been debased again. Fortunately, I still have a cache of aurei that you provided me to spend, although I paid half that increase in gold rather than silver, so as not to lose still more in the transaction.\\n\\n You have expressed an interest in Barbary horses, and to that end, I have sent word to those brokers who deal in horseflesh to find out what their prices may be, and what quality of stock they may have for your consideration. You have approved the mares from Bithynia three years ago; I am prepared to deliver your agent to any port at which your ships trade, and to provide him with any assistance that I can. Perhaps you are aware that the Legions still seek out mules in great numbers, and because of that, they will put a premium on all those animals that have tested bloodlines in donkey and mare. In these uncertain times, having the good opinion of the military is a prudent measure-do you not agree?\\n\\n The prices for wheat and barley have been fluctuating more than in previous years. Some claim it is the debasement of the coins that is the cause, some say it is the presence of barbarians at the edges of the Empire, who prey upon the vast farmlands in those places, that are the cause. Egypt continues to have the steadiest prices for wheat, but even there the costs are not as steady as before. If you intend to purchase barrels from the coming harvest, I would recommend settling on a price, and soon, for as the harvest draws near there may be increased instability in what is expected by the farmers, and that could mean a doubling in what is charged, and once the harvest is in, there will be no chance to bargain.\\n\\n In relation to wheat, dates remain far less volatile, and for that reason you may wait until June to secure your barrels. It is also important to be careful of those agents who oversell their consigned stock, or attempt to foist inferior stock upon the purchaser. You say your man in Alexandria is reliable, and I have no reason to doubt it, but I ask you to enjoin him to be especially diligent this year, for between the monetary problems and the discontinuity of purchaser and seller, there is a great opportunity for fraud. You, and many others, will need to exercise great care in dealing with contracts, spelling out details and conditions more rigorously than in previous years.\\n\\n I have recently arranged to import linen, cotton, and silk from Phoenicia and Judaea, and have contracted to supply mercers there with canvas and wool, as well as rope from Britannia. These seem not to be as much compromised by the debasement of coins, although I suspect that in time even cloth and similar goods will become as inconstant in price as foodstuffs are at present. I am attempting to prepare for that time by making my contracts now, while the markets are still holding, for I cannot persuade myself that the denarius will hold value when more than half its silver is gone to pay for the Emperor\u0027s amusements.\\n\\n There has been a rumor circulating here in Ostia that the ships of Valerius Sejanus Paren have been bringing young men and women slaves to this port and Neopolis who are not truly slaves at all, but unfortunates who have been stolen from their homes and families. To hear some accounts, no attractive youth of either sex is safe. It is said that the appetency of the Emperor has fueled the license that has been increasing throughout the Empire, turning what had been an occasional lapse into a general practice among those dealing in slaves. If this is as widespread as has been claimed, there are likely to be uprisings in many parts of the Empire, for what family will accept such rapacity without protest? You have said that your ships are not to be used to transport slaves; this is known throughout Ostia, yet many are now saying that such a posture can only result in a loss of revenue. For that reason, it may be wise to reiterate your orders in this regard to your captains, if they are still truly your orders. Otherwise, your ships may yet be used for such purpose, if only to stay ahead of the devaluation of coins.\\n\\n May the gods give you good fortune, and look upon you with favor; may your ships\u0027 voyages be successful and profitable, and may you never have cause to regret a purchase or a choice in bedpartners. This, on the 6th day of February in the 972nd Year of the City,\\n\\n Almericus Philetus Euppo\\n\\n merchant and freedman of Ostia \\n\\n","sourceLink":"https://allnovel.net/roman-dusk-saint-germain-19/page-11.html","bookId":2502,"book":{"id":2502,"title":"Roman Dusk (Saint-Germain #19)","description":"Storyline: Roman Dusk (Saint-Germain #19) \\n Rome is crumbling. The child-emperor, Heliogabalus, diverts the Roman populace with parties, circuses, and celebrations, while his mother and grandmother jockey for power behind the scenes. The government is riddled with scandal and no business is conducted without bribes which grow ever larger. Religions joust for prominence, with factions of Christians seeking to overthrow the ancient Roman pantheon. Courtesans, once honored for their skills and protected by special guards, have become targets of opprobrium. \\n The vampire Ragoczy Germanius Sanct\u0027 Franciscus, already subject to extra taxes and regulations because he is a foreigner, falls under the maleficent eye of Telemachus Batsho, a minor functionary who dreams of power and wealth. When Franciscus thwarts his attempts to extort ever-increasing sums from a young Roman of good birth, Batsho swears revenge. Franciscus finds his activities closely monitored and is accused of treason and conspiracy. His friends, threatened with similar scrutiny, abandon him to Batsho\u0027s mercies or urge him to leave the Eternal City. \\n But Franciscus has many ties to Rome. He has taken under his protection a beautiful courtesan who was brutally beaten by the very men who should have been protecting her. She has been the vampire\u0027s sustenance for many months. \\n Franciscus is also held in the city by the plight of the family Laelius. The Domina\u0027s health is failing despite the vampire\u0027s great medical skills; her son has converted to Christianity and rails against his mother\u0027s beliefs; her daughter Ignatia, who has sacrified her own life to care for her mother, realizes that when her mother dies, her fate will rest in the hands of her increasingly fanatical brother. \\n Determined to claim pleasure for herself, Ignatia invites Franciscus\u0027s attentions, inflaming him with the power of her untapped sexuality. Unfortunately, they are not unobserved, and their simple yet powerful act of love sparks a conflagration that destroys Ignatia\u0027s family and nearly brings about the vampire\u0027s True Death.\\n","cover":"https://allnovel.net/images/roman-dusk-saint-germain-19.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/roman-dusk-saint-germain-19.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:00:28 PM"}}
