{"id":106681,"no":16,"title":"Page 16","content":"As the sky faded from sunset to twilight, the torches of Roma blazed to life. On every avenue, street, and alley of the city, Watchmen set pitch-soaked staves in brackets, then lit them from their own torches, before passing on to the next corner to repeat the process. Throughout the city there were people gathering in the fora and fountain-squares to see this evening\u0027s entertainment, for this was the Summer Solstice, the Feast of Balus, the Emperor\u0027s Syrian sun-god, and he had promised a spectacular celebration to mark it, with dramatic reenactments of the story of Balus, accompanied by songs and heroic recitations-prospects that brought the Romans out in force. Already companies of musicians were cavorting among the crowds, playing their instruments and accepting copper ae for their efforts.\n \"They say he\u0027s ordered two hundred carpenta filled with rose-petals for the grand convivium; there are said to be more than two hundred guests invited; a carpentum of rose-petals for each guest, it appears,\" Vitellius remarked disapprovingly as he returned from lighting the torch by the outer gate of Domina Clemens\u0027 house; beyond the gate, the Temple of Hercules shone from the light of a dozen torches. \"The boy is quite mad.\"\n Aedius could not bring himself to disagree with Vitellius. \"It is his religion. Everyone with a single god is mad.\"\n \"True enough,\" said Vitellius. \"But two hundred carpenta of rose-petals? What kind of god wants so many rose-petals?\"\n \"He would need an army of slaves to pluck them,\" said Aedius, chuckling at the thought. \"Five petals to a rose ... how many slaves would it take to fill a single carpentum, let alone two hundred?\" He shoved the gate-bolt in place and started across the courtyard to the main house.\n \"Will you climb to the roof to watch the festivities?\" asked Vitellius.\n \"I may,\" said Aedius. \"If it turns out to be more than torches and noise.\"\n \"Do you think it won\u0027t?\" Vitellius was both amused and disgusted. \"That child is being permitted license enough to ruin him, if only he had the wits to see it. Chariot races with bears and ostriches! Who knows what he will present at his Games tomorrow?\"\n \"Who knows what he will offer the people tonight?\" Aedius said.\n \"His caprice is boundless,\" Vitellius said, shaking his head that the Emperor should set such an unRoman example.\n \"I think that is the intent-to show his power through whim,\" said Aedius, surprised that he and Vitellius were in such accord. \"I think he is being turned into a distraction, a gaudy diversion so that others may work invisibly.\"\n \"It\u0027s his mother and grandmother doing that,\" said Vitellius.\n Aedius nodded. \"It will be a hard day for the Emperor if Julia Maesa and her daughter Julia Soaemias ever turn against him.\"\n \"Julia Mamaea is already against him.\"\n \"Well, she has a son of her own to advance,\" said Aedius. \"You can\u0027t expect her to support her nephew over her own son.\"\n \"And she is truly ambitious, as all honorata and illustriata are,\" said Vitellius. \"They are dangerous as serpents.\"\n \"Who is to hold them accountable for being that-are we?\" Aedius said, and laughed.\n \"No, probably not; an uprising of slaves would do little to change the nobility. The Praetorians may yet take a hand in dealing with the Emperor, if they become sufficiently revolted by his actions; Heliogabalus would have to pay attention to them, and so would his mother and grandmother,\" said Vitellius, entering the house correctly onto the right foot. \"You and I are far from such corruption.\"\n \"And that is a reason to thank Hercules and Vulcan, who protect all who labor,\" said Aedius with as much piety as he could summon. \"Their help is always needed, and they will do much for those who burn incense to them.\"\n \"Yes, and to Carna, who guards our bodies. If she deserts us, our hearts and livers fail.\"\n \"And Verplaca-without her, there is no harmony in households.\" Aedius stopped walking. \"We should burn incense to all of them tonight, to show that in spite of Heliogabalus, we haven\u0027t forgot them, nor lost any esteem for them.\" He saw Vitellius nod in agreement.\n \"And ask Verplaca to send wisdom to the Emperor\u0027s family, as well,\" Vitellius said.\n \"Truly. Or let the Juliae scheme amongst themselves and leave honest slaves alone,\" Aedius declared.\n \"Just so,\" said Vitellius, suddenly wary; it was not always safe to make a joke of the ruling family-there was no telling who might be listening. He spat to protect himself from evil, then said, \"There is a fine convivium for all the household tonight. The master does well by us.\"\n \"He\u0027s foreign,\" said Aedius. \"It helps to do the right thing when you\u0027re foreign. People notice if you don\u0027t.\"\n \"He doesn\u0027t attend the Great Games; Romans notice that,\" said Vitellius. \"Says he has lost his taste for carnage and display.\"\n \"Foreign,\" Aedius repeated; the two stewards paused at the edge of the atrium. \"In an hour, we dine.\"\n \"Yes,\" said Vitellius, feeling awkward now that their burst of camaraderie had faded quickly as it had risen. \"Well, until the convivium.\"\n \"Until the convivium,\" said Aedius, and went off toward the dining room to supervise the final preparations for the household convivium.\n Vitellius went up the stairs to the gallery and busied himself lighting the torches set in place there to provide the illumination Heliogabalus had ordered for all villas and households with gardens. He was almost at the end of the gallery when a voice spoke out of the darkness; Vitellius nearly dropped his torch.\n \"I prefer the stars to torches,\" said Sanct-Franciscus, stepping out of the dense shadows into the fluttering light of the flames. He was very grand tonight, in a Persian chandys of dual-colored silk-deep-red and black-that shone glossily; he wore bracae of fine-spun black goat-hair from Asiana, and had thick-soled peri of tooled, black leather on his feet. A silver bracelet ornamented with three large rubies was clasped to his left wrist and a silver chain around his neck held his eclipse device: displayed silver wings with a black sapphire supplying the disk. \"I apologize for startling you, Vitellius.\"\n \"No matter,\" said Vitellius. \"You ... took me by surprise. I didn\u0027t know you were in your quarters.\"\n \"I am not, now,\" said Sanct-Franciscus with a trace of amusement.\n \"No; I can see that.\" Vitellius took three steps back. \"I will not intrude.\"\n \"You are not intruding,\" Sanct-Franciscus told him. \"I am about to go to my study. Rugeri and I have a few matters to discuss before I depart for the Capitolinus Hill and the official festivities.\"\n \"Will you want an escort? You are wearing jewels and there are many thieves about on such a night as this.\"\n \"Thank you; I have arranged for Natalis to accompany me; he should suffice,\" said Sanct-Franciscus, and saw the look of outrage that crossed Vitellius\u0027 features.\n \"The man is a thief, master, no matter what he may say to you. You put yourself in danger when you are in his company.\"\n \"Do you really think so?\" Sanct-Franciscus asked lightly. \"I would think he would keep me safe; he knows the dangers I might encounter, and can avoid them.\"\n \"Because of his trade,\" Vitellius muttered.\n \"Yes, that is why he is valuable to me.\" Sanct-Franciscus smiled slightly and passed on along the gallery, noting with satisfaction that the torches were making no real headway against the stars.\n Rugeri was at the writing table in the study, going over a stack of folded scrolls by the light of a branch of nine oil-lamps. He was dressed in an elaborately pleated pallium of dove-gray linen belted in bands of braided rust- and straw-colored silk. As Sanct-Franciscus entered the study, he looked up, and rose respectfully, taking stock of Sanct-Franciscus\u0027 appearance. \"My master. You\u0027re going to be warm tonight, I think; it will stay more hot than cold.\"\n \"Hot and cold, as you are well-aware, mean little to me, my friend,\" said Sanct-Franciscus, smiling slightly. \"I see the records have come from Alexandria.\"\n \"This is only half of them, and they are copies. They arrived three hours ago, carried by hired courier. I provided five denarii as a commoda for him. Generous, but not remarkable.\" He patted the scrolls before sitting down again.\n \"You have begun your review of them, it appears.\"\n \"I have,\" said Rugeri, \"and I have to agree with Djuran: Perseus was stealing from the Company at a shocking rate, and so boldly that I can only assume he had help from someone in the Prefecture. It cannot be an accident or an oversight that so much money is missing.\"\n \"That is unfortunate,\" said Sanct-Franciscus.\n \"At least for Perseus,\" said Rugeri. He frowned. \"Do you intend to approach the Prefect of Trade on his behalf?\"\n \"I hadn\u0027t planned on it, no, and not now if you suspect he had an accomplice there.\" Sanct-Franciscus studied Rugeri\u0027s demeanor. \"Do you recommend it?\"\n \"No; in his case I do not.\" He tapped his stylus on the table-top. \"In general I understand your advocacy for slaves, and I applaud it. But in a case such as Perseus\u0027, I cannot see the use of sparing him the consequences of his crimes.\"\n \"Nor can I,\" said Sanct-Franciscus. \"It is apparent to me that he is beyond reclamation.\"\n \"So the evidence demonstrates,\" said Rugeri, looking down at the two opened sheets on the table. \"Do you want me to inform Djuran?\"\n \"If you would, please, and the Priests of Imhotep,\" said Sanct-Franciscus, then changed the subject. \"While I am out tonight, I ask that, in spite of your work here, you serve as my deputy. I know I can rely on you to keep the evening from becoming raucous. Let the slaves keep the convivium merrily, but not beyond all conduct. And with so many torches about the city and the house, be sure there are always four on watch for fire.\"\n \"There are already six barrels of water in the courtyard, my master, and men assigned to each of them, with relief to be provided two hours after sunset.\" Rugeri hesitated, then said, \"Should I expect you back tonight?\"\n \"I hardly know,\" said Sanct-Franciscus. \"Since it is a celebration for all of Roma, I may not find the opportunity I seek. And the festivities may go on far into the night.\"\n \"And will you ... feed?\"\n \"I doubt it. There would be a high risk, with so many folk about.\" He looked toward the window. \"It is such a strange feast they offer-flesh everywhere, and most of it willing, but without any passion beyond a short-lived thrill. It is as if in their gorging, they do not wish to be touched, not in their souls. I have had no trouble in getting adequate sustenance since I returned here, but nourishment-that intimacy that is more than the meeting of skins-that is proving to be rare.\"\n \"That is a concern of mine,\" Rugeri said diplomatically. \"You may go hungry for too long, and that is a troublesome prospect.\"\n \"Not without cause, my friend. Melidulci occasionally approaches true closeness with me, but she does not trust the emotions that come with it.\" Sanct-Franciscus took a turn about the room. \"If you would not mind manning the gate after midnight, my late return should not cause any comment among the household.\"\n \"I will attend to it,\" Rugeri promised. He cocked his head toward the window, now with the shutter half-lowered. \"Should the house be secured?\"\n \"On the lower floors, yes, until the festival is over, and then all windows should be shuttered and latched for the rest of the night. The household may spend the evening in the gallery while the celebration goes on. With the shutters open on the upper floor, the household may watch from the gallery, and the rooms along it-those that are unoccupied.\"\n \"That\u0027s ... very generous.\"\n \"It\u0027s preferable to having them try to slip out or find places from which to watch that no one knows to secure,\" said Sanct-Franciscus.\n \"You\u0027re thinking of Persia again,\" Rugeri said with obvious chagrin. \"I should have been more diligent.\"\n \"You did not understand the state of Srau\u0027s mind,\" said Sanct-Franciscus.\n \"It isn\u0027t an error I will make again,\" Rugeri vowed.\n \"I have no doubt of that, my friend,\" said Sanct-Franciscus. \"Look for me after the celebration is ended and the torches are quenched.\"\n \"I will. After midnight, I\u0027ll take up the post at the gate.\"\n \"Until then, my friend, may the gods-known and forgotten-guide your labors,\" said Sanct-Franciscus, and left the study making for the door, the courtyard, and the gate beyond. At the gate Natalis was waiting, in a calf-length dalmatica of mauve cotton, blending him with the shadows. \"Are you carrying any weapons?\"\n Natalis pulled a long, thin dagger from a hidden sheath in the sleeve of his dalmatica. \"If needed, I am.\"\n \"Excellent,\" Sanct-Franciscus approved. \"Let us hope you will have no cause to use it.\"\n \"Then we should keep away from the areas where the greatest numbers of people are congregating. It\u0027s too hard to maintain protection in a crowd.\" Natalis fell into step slightly behind Sanct-Franciscus on his left side as they made their way past the Temple of Hercules and entered the broad street leading toward the Forum Romanum.\n More than six bonfires had been lit in the major fora of the city, and it was there that the greatest number of Romans gathered; Sanct-Franciscus and Natalis skirted those places, not only to avoid the conflagrations, but to stay away from the most frantic celebrants, many of whom were already drunk-not even the women who worshipped Bacchus were as delirious in their ceremonies as some of the young men who were seeking to equal Heliogabalus in the extremity of their carousing, rushing at passersby and pelting them with eggs.\n \"What do you make of it?\" Natalis asked as they turned away from a group of youths throwing rocks at stray dogs while drinking greedily from wine-skins.\n \"I think it will lead to trouble,\" said Sanct-Franciscus. \"They are rowdy now and are likely to become belligerent.\"\n \"Because they\u0027re drunk? Half the crowds at the Circus are drunk.\" Natalis glanced back over his shoulder as a few of the young men began to wrestle amid the approving hollers of their companions.\n Sanct-Franciscus nodded once in agreement. \"But at the Circus they are in the stands, with races or battles to hold their attention. Here there are no such limitations on them: excesses of their sort could easily become a riot, and not even the Watchmen, the Urban Guard, and the Praetorians could stem a wholesale orgy of violence once it got started.\"\n \"Do you think Roma is prepared for trouble?\" Natalis put his hand on his knife. \"On the scale they could have it?\"\n \"I hope so: they are likely to get it,\" Sanct-Franciscus observed as they rounded another corner and saw the myriad torches of the Capitolinus Hill shining ahead of them. \"This alone is likely to inspire mischief. They flaunt their wealth and wonder why they are robbed.\"\n Natalis gave a knowing nod. \"At one time, I would have thought those torches a beacon.\"\n \"As they probably are to others,\" said Sanct-Franciscus.\n As the two came nearer, they noticed that the patrols of Urban Guards were more frequent, and the Guardsmen were more heavily armed than usual.\n \"They\u0027re expecting trouble; you\u0027re right,\" Natalis said, a note of regret in his tone.\n \"A wise precaution,\" Sanct-Franciscus said as quietly as the din in the streets allowed.\n \"Unless there is a fire. Then all the Urban Guards will be called to fight it, and the people might well panic: if that happens, then the city will be in grave danger, with people massing in the streets, attempting to get out of the gates,\" said Natalis, not quite shouting in the increasing noise around them. \"There would be chaos if that happens.\"\n Sanct-Franciscus motioned to him to keep his voice down, pulling him into the doorway of a closed thermopolium. \"We do not want to draw attention to ourselves, not tonight.\"\n \"I understand; I\u0027ll be circumspect,\" said Natalis. He stood a little straighter. \"While you are at the celebration, do you want me to remain in the household with the slaves, or shall I wait outside the house itself?\"\n \"You may stay in the house, unless I send you word to leave. You will know that the instructions are mine because I will ask you to carry a message to Rugeri. If any other orders come, no matter what they may require of you, do not obey them; they will not be my intentions.\" Sanct-Franciscus stepped back into the street, neatly avoiding a handsome biga drawn by a flashy pair of bright bays that was bound for the same porticus as they were.\n \"But if they give me orders, they will expect me to leave,\" Natalis pointed out; they were almost to the front of the grand house that was their destination.\n \"Then do so, but stay where you can watch the door, and wait for me. I will join you directly.\" Sanct-Franciscus smiled slightly. \"There will be others doing much the same thing-waiting for their masters to depart-particularly groups of bodyguards and drivers of bigae.\"\n \"Look at the Praetorians, bristling with spears and daggers. It isn\u0027t as if they are asked to wait upon the Emperor,\" Natalis said as they neared the porticus, pointing to the men in shining brass loricae who were taking the measure of the couple alighting from the biga.\n \"No, they are only guarding his aunt,\" said Sanct-Franciscus drily. \"For reasons of her own.\"\n \"Do you expect she will ask anything of you?\" Natalis could not keep from inquiring.\n \"Not tonight. That would be foolish, and from what I know of Julia Mamaea, she is no fool.\" He saw the two bodyguards flanking the steward in the doorway, and said, \"See? She leaves almost nothing to chance.\" He stepped up to the door and told the steward his name and the name of his freedman.\n The steward, a handsome man about thirty with northern features, looked the two of them over, consulted the fan-folded scroll in his hands, and said, \"Enter and turn to your right. Your freedman should continue ahead.\"\n They did as they were told, entering a vestibule where the alcove of lares was ablaze with oil-lamps, and the scent of incense hung heavily on the air.\n \"I will wait for you to send for me,\" said Natalis, and kept on toward the atrium that was filled with many pots of blooming flowers.\n Sanct-Franciscus watched him go, and thought as he did that he hoped that Natalis would not be tempted to take anything from the house, for such an outrage would lead to his execution, and nothing Sanct-Franciscus could do would spare him. He turned to the right and into the grand reception room, set up for an evening of dining and roistering. Statues of Apollo, Jupiter, Mercury, Vulcan, Mars, Diana, Venus, Minerva, and Vesta were prominently displayed, and a large sun-disk in brass hung over the center of the room, reflecting back the lights of the hundreds of oil-lamps set in brass lamp-trees around the room.\n Immediately under this grand decoration on a small dais sat Julia Mamaea in stola and palla of white silk edged in gold; a sunburst tiara was set amid formal curls. She wore extravagant earrings and a necklace of hammered gold links. Her lips were rouged and her eyelashes were darkened, and she wore a perfume compounded of jasmine, rose, and amber. At her feet sat her eleven-year-old son, Gessius Bassianus, dressed in a tunica of cloth-of-gold, looking bored and annoyed. A dozen men clustered around the two of them while more circulated through the room, waiting to be summoned to greet their hostess; in a short while the women would be admitted and the evening would properly begin.\n A consort of musicians hidden behind a screen were playing anthems to Roma and the historic tales of Roman heros; their tunes were familiar and the stories they told were known to almost everyone in the room. Their instruments were not loud enough to cut through the thrum of conversation, but served to underscore Julia Mamaea\u0027s position in regard to this alien festival.\n \"So, Sanct-Franciscus,\" said a voice at his shoulder. Sanct-Franciscus turned to see Dephinius Ambrosius Junian, rigged out in a brilliant yellow toga virilis, broad golden bracelets on both wrists. \"I don\u0027t know if you recall me-we met-\"\n \"-at the Saturnalia celebration. At Desiderius Vulpius\u0027 house,\" Sanct-Franciscus said.\n \"At the other end of the year,\" Junian said, and gave the room a swift perusal. \"I reckon this occasion will be somewhat more frenetic than even Saturnalia.\"\n \"Does that displease you?\" Sanct-Franciscus asked.\n \"If it were a Roman festival, it wouldn\u0027t. But this is a foreign god, and that troubles me.\" He began to walk along the edge of the room; Sanct-Franciscus kept pace with him.\n \"Roma has always welcomed foreign gods,\" he said.\n \"Yes, yes,\" Junian agreed. \"But not when the Emperor puts his foreign god above all our Roman ones. Wild as he is, the Emperor is as bad as those Christians, who are forever praising their god as the only god, and decry any others. The Emperor may be as licentious as the Christians are austere, but they are equals under the skin, demanding that everyone share their faith and have no other. Romans like fond devotion, not raving monomania.\" He halted by a doorway that led out onto the long, narrow terrace on the north side of the grand house. \"Not much of a garden, but in the city I suppose it does very well.\"\n \"And a smaller garden is easier to maintain,\" said Sanct-Franciscus, thinking back to the night at Nero\u0027s Golden House when prisoners had been let loose in the vast gardens in tunicae of pitch-soaked cotton that was then set blazing; even now the memory had the power to disgust him. \"And they conceal less.\"\n \"True enough,\" said Juniun, resting his hand on his broadening paunch. \"On an occasion like this, a man wants to see everything.\" His smirk had an air of prurience about it. \"Vulpius says you know how to keep confidential things said to you.\"\n Sanct-Franciscus\u0027 eyes flicked over the gathering. \"If anything can be held secret in such a gathering.\"\n \"I take your point, Sanct-Franciscus,\" Junian remarked, then cleared his throat and slightly raised his voice. \"They say the Emperor will dance naked for his guests tonight, and that rose-petals will fall thick as snow in the northern mountains in winter.\" This was clearly not what Junian had intended to say when he first approached Sanct-Franciscus. \"He has declared that all Roma will join in the celebration; we can but comply.\"\n \"According to household rumors there will be excess from one end of the city to the other,\" said Sanct-Franciscus. \"I doubt Heliogabalus would be so reckless as to endorse such overindulgence, not with his mother about, and his grandmother.\"\n \"Fierce old woman, is Julia Maesa, and raised her daughters to be the same.\" Junian glanced toward their hostess. \"They say Julia Mamaea is hoping to see that young Syrian sprig supplanted by her own son.\"\n \"Whether it is true or not, Romans would always think such things of ruling families-not without reason.\" Sanct-Franciscus ducked his head as the sound of a brass gong brought the guests to attention. \"The evening is about to begin.\"\n \"They\u0027ll bring in the women, and then the entertainment will start. Nothing like what the Emperor might offer, but at least something we Romans can approve,\" said Junian, and turned away from the open door.\n Sanct-Franciscus remained there for a long moment, then joined the men clustered around Julia Mamaea\u0027s dais, all the while listening for the shouts and cries that came from the city beyond the garden.\n Text of a letter from Gelasius Virginius Apollonius Metsari to Lucius Virginius Rufius, carried by one of the Christians in their group.\n To my cousin and Brother in Christ, the kiss of peace, on this, the anniversary of his birth, with the wishes that the Savior guide and protect you through the coming year.\n I must warn you that the Urban Guard has been about, asking questions about the fires that were lit during the appalling display on Mid-Summer Eve, when the Emperor himself paraded around his palace, naked and unashamed. A few of the Urban Guard have proclaimed that some of the fires were deliberate, and the deaths caused by them were therefore murder, a position that makes no allowance for the reasons behind the fires. The Prefect of the Urban Guard has issued orders for the arrest of anyone found to be party to setting the fires in question, and has assigned several of his men to conduct an investigation. The Praetorians also have decided to look into the reasons for the fires. So you would do well to suggest to your friends to keep to themselves, and to pray for aid from God\u0027s Christ. Any Christian found to have been party to the setting of fires will surely be sent to the arena, against which fate we must all pray. As you may not have heard, nine of the members of my own group of Christians have been sent to prison for attempting to get into the Emperor\u0027s palace during his Mid-Summer debacle for the purpose of chastising him for his carnality and luxuriousness, and are likely to be condemned to the oars of a bireme or trireme if they can avoid being sent onto the sands of the Great Games.\n So far, most of those detained have been Peterines, and part of the Jewish community. They\u0027re easier to find than we are, and few of them are more than humiliora: that may be why the Urban Guard has sought them out first. The Peterines are standing firm in their assertion that Jesus was a Jewish prophet and spoke only to those of the Jewish faith, and this is making them targets for Roman condemnation. As if Salvation could be limited to Jews! Let the Peterines decrease their numbers through defying Roma. Those Peterine Jews who call themselves Christians are mistaken in their understanding. Paul has shown the way, and we, who are true to the teachings of the Christ, bear witness to his righteousness. God has given us protection in this time of tribulation, and when the Last Judgment comes-as surely it must, as we see the Last Days upon us-we will emerge among the lambs.\n You and your companions have done much for our faith. I don\u0027t know who among you decided the houses to be burned, but at least three have struck a blow for Salvation: the silk merchant from Fars, the honoratus who was Lictor in Asiana, and the prostitute from the lupanar all are examples of those trading on sin, and whose punishment in this life heralds what is to come for all of mankind in this world and the next. Let the courts say what they will, they cannot deny the justice that we have done.\n But pious as your acts are, I advise you to discontinue them for the time being, for it is unwise to expose our Brothers to the harsh fate meted out by these Romans. Wait until summer is over before you undertake any more fires, and then resume your cleansing only after obtaining the approval of at least four Paulist groups, so that we may make preparations to protect ourselves. Salvation is for the devout, not the reckless, and so I ask you, in the Name of the Risen Savior, to contain your indignation for a time, and to seek consolation in prayer until we are agreed that more activity is required of us, and where to strike.\n May God extend His Grace to you, and may you know the Peace Beyond the World,\n Gelasius Virginius Apollonius Metsari\n On the 10th day of July, the 972nd Year of Roma, the 219th Year of Salvation \n","sourceLink":"https://allnovel.net/roman-dusk-saint-germain-19/page-16.html","bookId":2502,"book":{"id":2502,"title":"Roman Dusk (Saint-Germain #19)","description":"Storyline: \n Roman Dusk (Saint-Germain #19) \n Rome is crumbling. The child-emperor, Heliogabalus, diverts the Roman populace with parties, circuses, and celebrations, while his mother and grandmother jockey for power behind the scenes. The government is riddled with scandal and no business is conducted without bribes which grow ever larger. Religions joust for prominence, with factions of Christians seeking to overthrow the ancient Roman pantheon. Courtesans, once honored for their skills and protected by special guards, have become targets of opprobrium. \n The vampire Ragoczy Germanius Sanct\u0027 Franciscus, already subject to extra taxes and regulations because he is a foreigner, falls under the maleficent eye of Telemachus Batsho, a minor functionary who dreams of power and wealth. When Franciscus thwarts his attempts to extort ever-increasing sums from a young Roman of good birth, Batsho swears revenge. Franciscus finds his activities closely monitored and is accused of treason and conspiracy. His friends, threatened with similar scrutiny, abandon him to Batsho\u0027s mercies or urge him to leave the Eternal City. \n But Franciscus has many ties to Rome. He has taken under his protection a beautiful courtesan who was brutally beaten by the very men who should have been protecting her. She has been the vampire\u0027s sustenance for many months. \n Franciscus is also held in the city by the plight of the family Laelius. The Domina\u0027s health is failing despite the vampire\u0027s great medical skills; her son has converted to Christianity and rails against his mother\u0027s beliefs; her daughter Ignatia, who has sacrified her own life to care for her mother, realizes that when her mother dies, her fate will rest in the hands of her increasingly fanatical brother. \n Determined to claim pleasure for herself, Ignatia invites Franciscus\u0027s attentions, inflaming him with the power of her untapped sexuality. Unfortunately, they are not unobserved, and their simple yet powerful act of love sparks a conflagration that destroys Ignatia\u0027s family and nearly brings about the vampire\u0027s True Death.\n \n","cover":"https://allnovel.net/images/roman-dusk-saint-germain-19.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/roman-dusk-saint-germain-19.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:00:28 PM"}}
