{"id":1840,"no":31,"title":"Chapter 30","content":"　　那天晚上该做的事情这时都落实了。命令全部下达了。人人都知道了自己在早晨的确切任务。安德烈斯巳走了三个小时。天亮时不发动进攻的话，就不会发动，“。罗伯特‘乔丹到上面的岗哨跟普里米蒂伏说话之后，在回来的路上对自己说。”我相倌会发动的。”\n 　　戈尔兹部署了这次进攻，但他无权撤消。要撖消必须得到马德里的批准。他们很可能没法叫醖那儿的人，即使叫得醒，那些人也会充满着睡意，不会认真考虑。我应该把敌人为了对付进攻所作的准备的情况及早拫告戈尔兹，但是事情还没有发生,我怎能事先就打报告呢？天一断黑敌人才调动那些武器。他们不希望公路上的活动被我们的飞机发现。但是他们的那些飞机又怎么说呢？法西斯分子的这些飞机又怎么说呢？\n 　　当然啦，我们的人一定看到了这些飞机而引起了蓍惕。可是，法西斯分子也许想用这些飞机来假装将向瓜达拉哈拉发动另一次进攻，据说意大利军队在索里亚集结，除了那些在北方活动的之外,又在西昆萨集结①。然而他们没有足够的军队和物资同时发动两次大进攻。那是不可能的，所以肯定不过是虚张声势。\n 　　但是我们都知道，上个月和前一个月在加的斯②登陆的意大利军队有多少。他们想再进攻瓜达拉哈拉的可能性是始终存在的，当然不会象上一次那么愚蠢，而会用三股主力军朝南直插,然后扩大突玻点，沿着铁路线向高原西部进军。他们有一个可以采用的好办法。汉斯跟他讲过。上一次他们犯了很多错误。那整个设想就不对头。他们进攻阿甘迖企图切断马德里和瓦伦西亚之间的公路时③，没有动用他们进攻瓜达拉哈拉时用的任何部队。他们当时为什么不双管齐下？为什么？为什么？我们什么时侯才能知道为什么？\n 　　然而我们两次都用同样的那些部队挡住了他们。要是他们双管齐下，我们就绝对挡不住他们。他对自己说,别愁。想想以前出现过的奇迹吧。你要就必须在早上炸桥,要就不需要炸。但是别欺骗自己，以为可以不必炸桥。反正总有一天要炸。不是这座桥，就是另一座。决定要干些什么,由不得你。你服从命令。按照命令办事，不用想别的。\n 　　炸桥的命令很明确。太明确了。可是你不能愁，也不能怕　害怕固然是正常的，可是如果你听任自己害怕，这种害怕的心情就会感染那些必须跟你一起工作的人。\n ②加的斯为西班牙南端滨大西洋的大海港，内战一开始即陷入叛军之手，成为从西厲庠洛哥及德意法西斯输送武装人员及军用物资的补给港。阿甘达在马德里东南，在通往瓦伦西亚的公路干线上。\n 　　他揶揄自己说　作为蒙大拿大学的西班牙语讲师,你干得满不锥舸。已经不容易了。但是别以为自己是什么特殊人物。在这方面,你还没有做出多大的成绩。想想杜兰吧，他从役受过军事训练，是个作曲家，革命前经常出没于交际场所，现在却成了个了不起的军官,指挥一个旅。对杜兰来说，这一切是那么简单容易，就象一个象棋神童学下象棋一样。你从小就看战略战术的书籍’有些研究，你祖父给你讲美国南北战争，启发，“你的兴趣，不过祖父把南北战争说成是叛乱。但是你和杜兰相比，就象一个稳健的好棋手和一个神童对局。老杜兰啊。再见见杜兰倒不错。等这终行动之后，他将在乐爵饭店见到杜兰。对，等这次行动结束之后，看看他的表现有多好？\n 　　他又对自己说。”等这次行动之后，我将在乐爵饭店见到他。他说,别哄碥自己啦。你千得完全对头。要冷静。别哄骟自己。你不会再见到牡兰了，伹那也无关紫要。也别想这种亊了,他对自已说。别想这种不切实际的事情啦。\n 　　也不要英雄般的克己。在这一带山区，我们不需要任何英雄般的克已的公民。你祖父在我国的内战中打了四年仗，你在这次战争中才剐打满，“一年。你还有一段漫长的时间，你十分适合做这项工作。再说，你现在还有了玛丽亚。嗅,你什么都不缺啦，你不该发愁。一支游击队和一队骑兵之间的一场小小遭遇战，算得了什么？这算不了什么　他们砍了头又怎样呢？那有什么关系？不必大惊小怪。\n 　　祖父内战后在卡尼堡的时候，印第安人经常剥人头皮。你父亲办公室里有一个柜子,柜架上摊满了箭头,挂在埔上的军權上斜插着苍鹰羽翎,皮绑腿和衬衣上有一股熏制的鹿皮的味儿，有珠子装饰的鹿皮鞋摸上去十分柔软，这一切你还记得吗?靠在柜子角落里的野牛骨制的大弓，两个箭筒中装满了打猎和打仗用的箭，你用手紧紧地握住那一把箭杆时的感觉,这一切你还记得吗？\n 　　要想想这些事情。要想想具体而实际的东西。要想想祖父的马刀，亮晃晃的，擦遍了油，插在有齿纹的刀鞘里,袓父给你看经过多次打磨巳经变薄的刀刃。要想想祖父的史密斯-韦森手枪，那是一支　32口径、没有扳机护围的军官用的单发枪。枪上的扳机是你觖摸到的最轻巧最顺手的，手枪总是擦遍了油,枪膛干干净净，虽然枪身上的装饰花纹全磨损了’褐色的钢枪筒和转轮被皮枪套磨得滑溜溜的。这支枪插在盖口上烙有字样的枪套里，跟擦枪工具和两百发子弹一起放在柜子的抽屉里。放子弹的纸板盒用蜡线扎得整整齐齐。\n 　　你可以从抽屉里把手枪拿出来，握在手里，“随意摸弄“，这是袓父的说法。但是你不能拿它耍着玩，因为这是一支“不能闹着玩的枪”。\n 　　你有一次问袓父，他是否用这支枪杀过人，他说，“杀过。”于是你说。”什么时候，爷爷?”他说，“叛乱战争期间，和战“\n 　　你说,“你跟我讲讲好吗,爷爷？”他说,“我不想谈它，罗伯特，“\n 　　后来，你父亲用这支手枪自杀了，你从学校请俱回家，他们举行了葬礼。法医验？“后发还了手枪,他说，“鲍勃①，我看你很想保存这支枪吧。本来是应该没收的，但我知道你爸爸很看重这支枪，因为他的爸爸第一次随骑兵出征就用它，整个内战期间一直随身带着，现在这支枪仍然好得很。我今天下午把它拿到外面试了试。它打得不快，伹有准头。”\n 　　他把枪放在原来的柜子抽屉里，伹是第二天他把它傘出来，和査布两人骑马直赶到红棚厘城北面的高地上，如今那儿筑，“一条穿过山口、横跨熊齿髙原、通往库克城的公路②。那里不大有风,整个夏天山上也有积雪。他们来到一个湖边,据说这湖有八百英尺深，湖水是深绿色的。查布牵着两匹马，他呢，爬上一块岩石，採出身子，在那静静的水面看到了自己的脸，看到了自已握着枪的身形，接着握住了枪口把枪扔下去，看它在清澈的水里冒着气泡，直沉到变成表链上的小饰物那么大小，然后消失了踪迹。他接着从岩石上下来，跳上马鞍，用马刺狠剌了一下老贝斯，使它象只摇木马般弹眺起来。他策马沿湖狂奔,等它恢复了正常,他们才沿着山路返回。\n 　　“我知道你为什么这样处理这支旧枪，鲍勃，”查布说。“这样，往后我们就不用再谈它啦，”他说。他们就此再也没谈过这支枪，那就是袓父的除了马刀之外的腰佩武器的结局。他把那把马刀和他自己的其他物品仍然放在米苏拉的箱子里。\n ②红棚屋城在兼大拿州南部，该公路一直朝西甫，通过州界上的熊齿山口？往西通到美国风景坯黄石公园东北角的库克城。\n 　　但愿在这儿的是我祖父,而不是我。噢，也许明天晚上我们又都可以在一起了。如果真有所谓“来世”这种鬼玩意儿一他想，这肯定是没有的一我当然想跟他谈谈，因为有很多事情我想弄弄清楚。我现在有权问他了，因为我自己也必须做同样的事了。看来他现在不会计较我发问了。我从前没有权利问他。他不肯告诉我是可以理解的，因为他不了解我。然而现在我想，我们该谈得拢了。我希望现在能和他谈谈,听听他的意见。妈的，即使不想征求他的意见，我也希望银他谈谈。在我们这样的人之间竟隔着这种时间的距离,真不象话。\n 　　他一边想，一边认识到，如果真的能见面，他和他祖父俩都会为他父亲在场而感到非常难堪。他想,任何人都有权自杀。伹是这样做不是好事。我理解这种行为，但是并不赞成　这就叫窝囊。可是你亭，“理解它吗？当然，我理解它，但是。是舸，伹是。一个人得“，“了牛角尖才会干出这种事情来。\n \n ①乔治，卡斯特　在内战中为北军立下了出色战功。内战后经常率领部队在密西西比河西向夏延族和苏族印第安人的区域进犯。一八七六年六月二十五日，他在费大拿州南部边界。”、巨角河边发现有个印第安营地，没有觉察对方人数众多，就贸然分兵三路出击,结果他自己率领的二百多人全部在一坡地上被杀　\n 　　我决不会忘记，当我第一次知道父亲是个①时，我感到多么难受。说下去吧，用英语说。”慊夫。说出来就轻松些了，而且用外国话来骂人是狗娘养的，又有什么意义呢？当然他也不是什么狗娘养的。他仅仅是个慊夫，这是人生的最大不幸。因为如果他不是慊夫，他就会挺身反抗那个女人，不让她欺侮他。我不知道如果他娶了另一个女人，我会是个什么样的人。那是你永远无法知道的，他想，不禁露齿笑笑。也许她身上的蛮横劲儿有助于补充父亲所不足的地方。你呀,别太激动吧。等你干完了明天的事，再提什么好气质那一套吧。别过早地自高自大啦。再说，根本不能自高自大。我们要瞧瞧你在明天能表现出什么气质。他可又想起祖父来了。\n 　　\"乔治，卡斯特不是个聪明的骑兵领袖，罗伯特，”他祖父说。“他甚至谈不上是个聪明人。”\n 　　他记得，红棚屋城他家弹子房墙上挂有一张旧的安休塞-比施的石版画，画的是穿着鹿皮衫的卡斯特，黄色的鬈发在风中飆拂，手握军用左轮枪站在山上，苏族印第安人正在包围拢来。对这样一位英雄，他祖父竟说出这样的话来,使他感到愤慨，\n 　　“而菲尔，谢里登却是个聪明人，杰布〃斯图尔特也一样。但约翰　莫斯比才是历来最出色的骑兵领袖。”\n 　　他在米苏拉的箱子里的物品中有一封菲尔，谢里登将军写给老“骑死马”基尔帕特里克①的信，信上说他袓父是个非正规骑兵队的领袖，比约翰、莫斯比更出色。\n 　　他想，我应该跟戈尔兹谈谈我的袓父。他也许从没听人说起过吧，也许连约翰〃莫斯比也从没听说过。英国人都听说过他们，因为他们不得不比欧洲大陆上的人们更多地研究我们的南北战争。卡可夫说过，在这次行动之后，要是我愿意，可以进英斯科的列宁学院。他说，要是我愿意的话,坯可以进红军的军事学院。我不知道祖父会对此有什么想法，“祖父嘛，一辈子从没有意地和民主党人同坐一桌。\n 　　他想,得，“，我不想当军人啊，这我知道。所以这个问娌不存在。我只想要我方打廉这场战争。他想,我看囑，真正的好军人真正擅长的除了打胜仗以外，别无所长。这看法显然是不对的。瞧拿波企和威灵顿。他想,你今天晚上多蠹啊。\n 　　他的思想通常是个非常好的伴侶，今夜对他袓父的回忆就是如此，接着对他父亲的回忆使他沮丧。他理解父亲，原谅他的一切，可怜他，但为他感到羞愧。\n \n ①基尔帕特里克为北军将领，在一八六四年谢尔爱将军从亚特兰大向萨凡纳港的进军中　担任騎兵司令，\n 　　那种犹豫,那种扩大的犹豫情绪，就象一个人由于摘错了可能的日期，不知道客人是否真的会来参加晚会一样一这种佾绪是从他打发安德烈斯给戈尔兹送报告后一直存在的——现在全消失了。他现在确信这个重要的日子不会被取消。他想，鏵确信有多好啊。能确信总是大好的事。\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/696/3833.html","bookId":59,"book":{"id":59,"title":"丧钟为谁而鸣 For Whom the Bell TollS","description":"简介： 一九三六年初秋到一九三九年春的西班牙内战早已成为历史陈迹，今天已不大为人们所提及。然而它实际上是第二次世界大战欧洲战线的序幕，是全世界进步力量和德意法西斯政权之间...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/696","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
