{"id":69575,"no":46,"title":"Page 46","content":"\"You lied to me when you told me you hadn\u0027t talked to Blair,\" I say. \"You lied when you said you hadn\u0027t talked to her since June and I believed you.\"\n \"I know. It was awkward. I felt bad about that. I\u0027m sorry.\"\n I move to the bathroom. I try to brush my hair. My hand is shaking so hard I can\u0027t hold the brush.\n \"I didn\u0027t mean to f**k with you,\" he says.\n \"I just want to know one thing,\" I say. \"It keeps bothering me.\"\n \"What is it?\"\n \"Why did you set me up with Rain if - \"\n Chapter 14\n Julian cuts me off as if he knows the rest of the question. \"You\u0027ve been around a long time. You know how this town works. You\u0027ve been through it before.\" And then his voice softens. \"I just didn\u0027t know how f**ked up you got over Meghan Reynolds until it was too late.\"\n \"Yeah, yeah, yeah, I know that but what I can\u0027t understand is that if you knew Rip was so crazy about Rain why did you ... \" I stand in front of Julian, my arms at my sides, but I can\u0027t look at him until I force myself to. \"Why did you put me in danger?\" I ask. \"You pushed her onto me even after you knew how Rip felt? You pushed her onto me even though you thought he maybe had something to do with Kelly?\"\n \"Clay, I never thought that he had anything to do with Kelly,\" Julian says. \"Those were just rumors that - \"\n \"You wanted me to help her and I tried, Julian, but now I realize you didn\u0027t care whether I got hurt or not.\"\n This moves something in Julian and his face tightens and his voice begins to rise. \"Look, it\u0027s really cool you\u0027re trying to help me out here, but why do you keep thinking Rip was involved with Kelly\u0027s death? Do you know something? Do you have any proof? Or are you just making shit up like you always do?\"\n \"What are you talking about?\"\n \"Stop it,\" he says and suddenly he\u0027s a different person. \"You\u0027ve done this so many times before, Clay. I mean, come on, dude, it\u0027s a joke. Yeah, you tell people shit, but have you ever really gotten anybody anything?\" he asks sincerely. \"I mean, you promise shit and maybe you get them closer but, dude, you\u0027re lying all the time - \"\n \"Julian, come on, don\u0027t - \"\n \"And what I found out is that you really won\u0027t do anything for anybody,\" he says. \"Except for yourself.\" The gentle way he says this forces me to finally turn away. \"This, like, delusional fantasy you have of yourself is ... \" He pauses. \"Come on, dude, it\u0027s a joke.\" He pauses again. \"It\u0027s kind of embarrassing.\"\n I force myself to grin in order to lighten the moment and not scare him away.\n \"Why are you smiling?\" he asks.\n \"It must be a pretty good act,\" I say. \"This ... fantasy I have of myself.\"\n \"Why do you say that?\"\n \"Because you bought into it,\" I say.\n \"I never thought you\u0027d actually fall for her.\"\n \"Why did you think that?\"\n \"Because Blair told me how cold you could be.\"\n Can you drive?\" Julian asks as the elevator heads down to the garage. \"Or do you want me to?\"\n \"No, I can drive,\" I say. \"Are you sure you want to do this?\"\n \"Yeah, I\u0027m sure,\" Julian says. \"Let\u0027s just get this over with.\"\n \"Let him have her,\" I whisper.\n \"We\u0027re leaving tonight,\" he says.\n \"Where are you going?\"\n \"I\u0027m not telling you.\"\n Driving along Sunset I keep checking the rearview mirror and Julian sits in the passenger seat texting someone, probably Rain, and I keep turning on the radio and then turning it off but he doesn\u0027t notice, and then we\u0027re crossing Highland and the Eurythmics song fades into a voice from the radio talking about the aftershocks from an earthquake earlier, something that I slept through, and I have to roll down all the windows and pull the car over three times in order to steady myself because I keep hearing sirens all around us and my eyes are fixed on the rearview mirror because two black Escalades are following us and the last time I pull over, in front of the Cinerama Dome, Julian finally asks, \"What\u0027s wrong? Why do you keep stopping?\" and where Sunset Boulevard and Hollywood intersect I smile at him coolly as if this is all going to be okay, because in the condo I felt like I was sinking into a rage but now, turning onto Hillhurst, I\u0027m feeling better.\n Outside a building past Franklin that\u0027s surrounded by eucalyptus trees Julian gets out of the BMW, and starts walking toward the entrance just as I receive a text that says don\u0027t get out of the car, and when Julian realizes I\u0027m still sitting in the driver\u0027s seat he turns around and our eyes lock. A black Escalade pulls up behind the BMW and flashes its headlights over us. Julian leans into the opened passenger window. \n","sourceLink":"https://allnovel.net/imperial-bedrooms/page-46.html","bookId":2684,"book":{"id":2684,"title":"Imperial Bedrooms","description":"Storyline: \n Twenty-five years on from \"Less Than Zero\", we pick up again with \"Clay\". \n In 1985, Bret Easton Ellis shocked, stunned and disturbed with \"Less Than Zero\", his \u0027extraordinarily accomplished first novel\u0027 (\"New Yorker\"), successfully chronicling the frightening consequences of unmitigated hedonism within the ranks of the ethically bereft youth of 80s Los Angeles. Now, twenty-five years later, Ellis returns to those same characters: to Clay and the band of infamous teenagers whose lives weave sporadically through his. \n But now, some years on, they face an even greater period of disaffection: their own middle age. Clay seems to have moved on - he\u0027s become a successful screenwriter - but when he returns from New York to Los Angeles, to help cast his new movie, he\u0027s soon drifting through a long-familiar circle. Blair, his former girlfriend, is now married to Trent, and their Beverly Hills parties attract excessive levels of fame and fortune, though for all that Trent is a powerful manager, his baser instincts remain: he\u0027s still a bisexual philanderer. \n Then there\u0027s Clay\u0027s childhood friend, Julian - who\u0027s now a recovering addict - and their old dealer, Rip - face-lifted beyond recognition and seemingly even more sinister than he was in his notorious past. Clay, too, struggles with his own demons after a meeting with a gorgeous actress determined to win a role in his movie. And with his life careening out of control, he\u0027s forced to come to terms with the deepest recesses of his character - and with his seemingly endless proclivity for betrayal.\n \n","cover":"https://allnovel.net/images/imperial-bedrooms.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/imperial-bedrooms.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:13:03 AM"}}
