{"id":69536,"no":7,"title":"Page 7","content":"The night doorman sits at the front desk in the lushly lit lobby. I walk toward him, unsure of what to say. He looks up from a small TV.\n \"Did someone come by my place?\" I ask. \"Tonight? While I was out?\"\n The doorman checks the log. \"No. Why?\"\n \"I think there was someone in my place.\"\n \"What do you mean?\" the doorman asks. \"I don\u0027t understand.\"\n \"I think someone was in my condo while I was out.\"\n \"I\u0027ve been here all night,\" the doorman says. \"No one came by.\"\n I just stand there. The sound of a helicopter roars over the building.\n \"Anyway, they couldn\u0027t get in the elevator without me opening it for them,\" the doorman says. \"Plus Bobby\u0027s outside.\" He motions to the security guard slowly pacing the driveway. \"Are you sure someone was in there?\" He sounds amused. He notices I\u0027m drunk. \"Maybe it was no one,\" he says.\n Pare it down, I warn myself. Put it away. Just pare everything down. Or else the bells will start chiming. \"Things were rearranged,\" I murmur. \"My computer was on ... \"\n \"Is anything missing?\" the doorman asks, now openly humoring me. \"You want me to call the police?\"\n In a neutral voice: \"No.\" And then I say it again. \"No.\"\n \"It\u0027s been a quiet night.\"\n \"Well ... \" I\u0027m backing away. \"That\u0027s good.\"\n An actress I met at the casting sessions this morning is having lunch with me at Comme \u0026Ccedil;a. When she walked into the room at the casting director\u0027s complex in Culver City she instantly provided a steady hum of menace that left me dazed, which acted as a mask so I appeared as calm as a cipher. I haven\u0027t heard of her agent or the management company that reps her - she came in as someone\u0027s favor - and I\u0027m thinking how different things would be if I had. Certain tensions melt away but they\u0027re always replaced with new ones. She\u0027s drinking a glass of champagne and I still have my sunglasses on and she keeps touching her hair and talking vaguely about her life. She lives in Elysian Park. She\u0027s a hostess at the Formosa Cafe. I twist in my chair while she answers a text. She notices this and then offers an apology. It\u0027s not coy, exactly, but it\u0027s premeditated. Like everything else she does it wants a reaction.\n \"So what are you doing for Christmas?\" I ask her.\n \"Seeing my family.\"\n \"Will that be fun?\"\n \"It depends.\" She looks at me quizzically. \"Why?\"\n I shrug. \"I\u0027m just interested.\"\n She touches her hair again: blond, blown out. A napkin becomes faintly stained after she wipes her lips with it. I mention the parties I went to last night. The actress is impressed, especially by the one I went to first. She says she had friends who were at that party. She says she wanted to go but she had to work. She wants me to confirm if a certain young actor was there. When I say he was, the expression on her face makes me realize something. She notices.\n \"I\u0027m sorry,\" she says. \"He\u0027s an idiot.\"\n Some people at that party, she adds, are freaks, then mentions a drug I\u0027ve never heard of, and tells me a story that involves ski masks, zombies, a van, chains, a secret community, and asks me about a Hispanic girl who disappeared in some desert. She drops the name of an actress I\u0027ve never heard of. I\u0027m trying to stay focused, trying to stay in the moment, not wanting to lose the romance of it all. Concealed, a movie I wrote, is brought up. And then I get the connection: she asked about the young actor with the gorgeous girl I was gazing at because he had a small role in Concealed.\n \"I don\u0027t really want to know.\" I\u0027m staring at the traffic on Melrose. \"I didn\u0027t stay long. I had another party to go to.\" And suddenly I remember the blond girl walking out of the shadows in Bel Air. I\u0027m surprised she has stayed with me, and that her image has lingered for so long.\n \"How do you think it went?\" she asks.\n \"I thought you were great,\" I say. \"I told you that.\"\n She laughs, pleased. She could be twenty. She could be thirty. You can\u0027t tell. And if you could, everything would be over. Destiny. \"Destiny\" is the word I\u0027m thinking about. The actress murmurs a line from The Listeners. I made sure the director and producer had no interest in her for the role she auditioned for before asking her out. This is the only reason she\u0027s with me at lunch and I\u0027ve been here so many times and I realize there\u0027s another premiere tonight and that I\u0027m meeting the producer in Westwood at six. I check my watch. I\u0027ve kept the afternoon open. The actress drains the glass of champagne. An attentive and handsome waiter fills it up again. I\u0027ve had nothing to drink because something else in the lunch is working for me. She needs to take this to the next level if anything\u0027s ever going to pan out for her. \n","sourceLink":"https://allnovel.net/imperial-bedrooms/page-7.html","bookId":2684,"book":{"id":2684,"title":"Imperial Bedrooms","description":"Storyline: \n Twenty-five years on from \"Less Than Zero\", we pick up again with \"Clay\". \n In 1985, Bret Easton Ellis shocked, stunned and disturbed with \"Less Than Zero\", his \u0027extraordinarily accomplished first novel\u0027 (\"New Yorker\"), successfully chronicling the frightening consequences of unmitigated hedonism within the ranks of the ethically bereft youth of 80s Los Angeles. Now, twenty-five years later, Ellis returns to those same characters: to Clay and the band of infamous teenagers whose lives weave sporadically through his. \n But now, some years on, they face an even greater period of disaffection: their own middle age. Clay seems to have moved on - he\u0027s become a successful screenwriter - but when he returns from New York to Los Angeles, to help cast his new movie, he\u0027s soon drifting through a long-familiar circle. Blair, his former girlfriend, is now married to Trent, and their Beverly Hills parties attract excessive levels of fame and fortune, though for all that Trent is a powerful manager, his baser instincts remain: he\u0027s still a bisexual philanderer. \n Then there\u0027s Clay\u0027s childhood friend, Julian - who\u0027s now a recovering addict - and their old dealer, Rip - face-lifted beyond recognition and seemingly even more sinister than he was in his notorious past. Clay, too, struggles with his own demons after a meeting with a gorgeous actress determined to win a role in his movie. And with his life careening out of control, he\u0027s forced to come to terms with the deepest recesses of his character - and with his seemingly endless proclivity for betrayal.\n \n","cover":"https://allnovel.net/images/imperial-bedrooms.jpg","author":"Bret Easton Ellis","type":"Thriller","source":"allnovel","link":"https://allnovel.net/imperial-bedrooms.html","creation":"Oct 5, 2019 8:59:06 AM","modification":"Oct 5, 2019 10:13:03 AM"}}
