{"id":4645,"no":23,"title":"Chapter 23","content":"Dear Clive,\\n\\n Please come back on receiving this. I have looked out your connections, and you can reach England on Tuesday week if you start at once. I am very anxious about you on account of your letter, as it shows how ill you are. I have waited to hear from you for a fortnight and now come two sentences, which I suppose mean that you cannot love anyone of your own sex any longer. We will see whether this is so as soon as you arrive!\\n\\n I called upon Pippa yesterday. She was full of the lawsuit, and thinks your mother made a mistake in closing the path. Your mother has told the village she is not closing it against them. I called to get news of you, but Pippa had not heard either. You will be amused to hear that I have been learning some classical music lately—also golf. I get on as well as can be expected at Hill and Hall\u0027s. My mother has gone to Birmingham after changing back-wards and forwards for a week. Now you have all the news. Wire on getting this, and again on reaching Dover.\\n\\n Maurice.\\n\\n Clive received this letter and shook his head. He was going with some hotel acquaintances up Pentelicus, and tore it to pieces on the top of the mountain. He had stopped loving Mau-rice and should have to say so plainly.\\n\\n 亲爱的克莱夫：\\n\\n 收到这封信后，就请回来吧。我查了一下交通情况。假若马上动身的话，星期二你就能抵达英国。由于你的信的缘故，我为你非常担忧。因为它证实了你病得多么重。这封信我盼了两个星期，盼到的是两个句子。你的意思莫非是说，今后你再也不能爱任何一个同性的人了。你一回来就水落石出了！\\n\\n 昨天我给皮帕打了电话。她满脑子都是诉讼的事。她认为令堂禁止通行那条路是个错误。令堂已告诉村方，此举不是针对他们的。我打电话是为了得到你的消息，然而皮帕也没收到你的信。近来我学了点儿古典音乐，你听了，会觉得好笑吧。还学会了打高尔夫球。我在希尔与霍尔混得还可以。家母反复考虑了一周之后，到伯明翰去了。现在你已有了所有的消息。收到此函，请打个电报。在多佛上岸后，再打一次。\\n\\n 莫瑞斯\\n\\n 克莱夫收到此信，摇了摇头。他约好了跟几个在旅馆结识的人去攀登彭特利库斯山（译注：彭特利库斯山是希腊阿蒂卡州山地。主峰科基纳拉斯峰海拔1109米，位于雅典东北约16公里处。山顶有一座雅典娜女神殿堂。）。在山顶上，他把信撕得粉碎。克莱夫已经不再爱莫瑞斯了，必须坦率地告诉他。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/313/450.html","bookId":162,"book":{"id":162,"title":"莫瑞斯 Maurice","description":"简介： 一部探讨社会价值与爱情冲突的经典文学作品。 这是一部描写同性恋情的小说，莫瑞斯和克莱夫是剑桥大学的同学，他们背负社会歧视的压力相爱三年，克莱夫突然提出中止这段感情，遂与安妮结婚。这一变故使莫瑞斯几乎精神崩溃，走上自杀的道路。他寻求心理医生的治疗，谴责...","cover":"http://novel.tingroom.com/uploads/110526/1-110526162KV57.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/313","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:23:13 AM"}}
