{"id":4666,"no":44,"title":"Chapter 44","content":"\"Alec, wake up.\"\n An arm twitched.\n \"Time we talked plans.\"\n He snuggled closer, more awake than he pretended, warm, sinewy, happy. Happiness overwhelmed Maurice too. He moved, felt the answering grip, and forgot what he wanted to say. Light drifted in upon them from the outside world where it was still raining. A strange hotel, a casual refuge protected them from their enemies a little longer.\n \"Time to get up, boy. It\u0027s morning.\"\n \"Git up then.\"\n \"How can I the way you hold me!\"\n \"Aren\u0027t yer a fidget, I\u0027ll learn you to fidget.\" He wasn\u0027t defer-ential any more. The British Museum had cured that. This was \u0027oliday, London with Maurice, all troubles over, and he wanted to drowse and waste time, and tease and make love.\n Maurice wanted the same, what\u0027s pleasanter, but the oncoming future distracted him, the gathering light made cosiness unreal. Something had to be said and settled. O for the night that was ending, for the sleep and the wakefulness, the toughness and tenderness mixed, the sweet temper, the safety in darkness. Would such a night ever return?\n \"You all right, Maurice?\"—for he had sighed. \"You comfort-able? Rest your head on me more, the way you like more . . . that\u0027s it more, and Don\u0027t You Worry. You\u0027re With Me. Don\u0027t Worry.\"\n Yes, he was in luck, no doubt of it. Scudder had proved honest and kind. He was lovely to be with, a treasure, a charmer, a find in a thousand, the longed-for dream. But was he brave?\n \"Nice you and me like this ...\" the lips so close now that it was scarcely speech. \"Who\u0027d have thought.... First time I ever seed you I thought, \"Wish I and that one...\u0027 just like that... \u0027wouldn\u0027t I and him ...\u0027 and it is so.\"\n \"Yes, and that\u0027s why we\u0027ve got to fight.\"\n \"Who wants to fight?\" He sounded annoyed. \"There\u0027s bin enough fighting.\"\n \"All the world\u0027s against us. We\u0027ve got to pull ourselves to-gether and make plans, while we can.\"\n \"What d\u0027you want to go and say a thing like that for, and spoil it all?\"\n \"Because it has to be said. We can\u0027t allow things to go wrong and hurt us again the way they did down at Penge.\"\n Alec suddenly scrubbed at him with the sun-roughened back of a hand and said, \"That hurt, didn\u0027t it, or oughter. That\u0027s howI fight.\" It did hurt a little, and stealing into the foolery was a sort of resentment. \"Don\u0027t talk to me about Penge,\" he went on. \"Oo! Mah! Penge where I was always a servant and Scudder do this and Scudder do that and the old lady, what do you think she once said? She said, \u0027Oh would you most kindly of your good-ness post this letter for me, what\u0027s your name?\u0027 What\u0027s yer name! Every day for six months I come up to Clive\u0027s bloody front porch door for orders, and his mother don\u0027t know my name. She\u0027s a bitch. I said to \u0027er, \"What\u0027s yer name? Fuck yer name.\u0027 I nearly did too. Wish I \u0027ad too. Maurice, you wouldn\u0027t believe how serv-ants get spoken to. It\u0027s too shocking for words. That Archie Lon-don you\u0027re so set on is just as bad, and so are you, so are you. \u0027Haw my man\u0027 and all that. You\u0027ve no idea how you nearly missed getting me. Near as nothing I never climbed that ladder when\n you called, he don\u0027t want me really, and I went flaming mad when you didn\u0027t turn up at the boathouse as I ordered. Too grand! We\u0027ll see. Boathouse was a place I always fancied. I\u0027d go down for a smoke before I\u0027d ever heard of you, unlock it easy, got the key on me still as a matter of fact... boathouse, looking over the pond from the boathouse, very quiet, now and then a fish jump and cushions the way I arrange them.\"\n He was silent, having chattered himself out. He had begun rough and gay and somehow factitious, then his voice had died away into sadness as though truth had risen to the surface of the water and was unbearable.\n \"We\u0027ll meet in your boathouse yet,\" Maurice said.\n \"No, we won\u0027t.\" He pushed him away, then heaved, pulled him close, put forth violence, and embraced as if the world was ending. \"You\u0027ll remember that anyway.\" He got out and looked down out of the grayness, his arms hanging empty. It was as if he wished to be remembered thus. \"I could easy have killed you.\"\n \"Or I you.\"\n \"Where\u0027s my clothes and that gone?\" He seemed dazed. \"It\u0027s so late. I h\u0027aint got a razor even, I didn\u0027t reckon staying the night. ... I ought—I got to catch a train at once or Fred\u0027ll be thinking things.\"\n \"Let him.\"\n \"My goodness if Fred seed you and me just now.\"\n \"Well, he didn\u0027t.\"\n \"Well, he might have—what I mean is, tomorrow\u0027s Thursday isn\u0027t it, Friday\u0027s the packing, Saturday theNormannia sails from Southampton, so it\u0027s goodbye to Old England.\"\n \"You mean that you and I shan\u0027t meet again after now.\"\n \"That\u0027s right. You\u0027ve got it quite correct.\"\n And if it wasn\u0027t still raining! Wet morning after yesterday\u0027s downpour, wet on the roofs and the Museum, at home and on\n the greenwood. Controlling himself and choosing his words very carefully, Maurice said, \"This is just what I want to talk about. Why don\u0027t we arrange so as we do meet again?\"\n \"How do you mean?\"\n \"Why don\u0027t you stay on in England?\"\n Alec whizzed round, terrified. Half naked, he seemed also half human. \"Stay?\" he snarled. \"Miss my boat, are you daft? Of all the bloody rubbish I ever heard. Ordering me about again, eh, you would.\"\n \"It\u0027s a chance in a thousand we\u0027ve met, we\u0027ll never have the chance again and you know it. Stay with me. We love each other.\"\n \u00271 dessay, but that\u0027s no excuse to act silly. Stay with you and how and where? What\u0027d your Ma say if she saw me all rough and ugly the way I am?\"\n \"She never will see you. I shan\u0027t live at my home.\"\n \"Where will you live?\"\n \"With you.\"\n \"Oh, will you? No thank you. My people wouldn\u0027t take to you one bit and I don\u0027t blame them. And how\u0027d you run your job, I\u0027d like to know?\"\n \"I shall chuck it.\"\n \"Your job in the city what gives you your money and position? You can\u0027t chuck a job.\"\n \"You can when you mean to,\" said Maurice gently. \"You can do anything once you know what it is.\" He gazed at the grayish light that was becoming yellowish. Nothing surprised him in this talk. What he could not conjecture was its outcome. \"I shall get work with you,\" he brought out: the moment to announce this had now come.\n \"What work?\"\n \"We\u0027ll find out.\"\n \"Find out and starve out.\"\n \"No. There\u0027ll be enough money to keep us while we have a look round. I\u0027m not a fool, nor are you. We won\u0027t be starving. I\u0027ve thought out that much, while I was awake in the night and you weren\u0027t.\"\n There was a pause. Alec went on more politely: \"Wouldn\u0027t work, Maurice. Ruin of us both, can\u0027t you see, you same as my-self.\"\n \"I don\u0027t know. Might be. Mightn\u0027t. \u0027Class.\u0027 I don\u0027t know. I know what we do today. We clear out of here and get a decent breakfast and we go down to Penge or whatever you want and see that Fred of yours. You tell him you\u0027ve changed your mind about emigrating and are taking a job with Mr Hall instead. I\u0027ll come with you. I don\u0027t care. I\u0027ll see anyone, face anything. If they want to guess, let them. I\u0027m fed up. Tell Fred to cancel your ticket, I\u0027ll repay for it and that\u0027s our start of getting free. Then we\u0027ll do the next thing. It\u0027s a risk, so\u0027s everything else, and we\u0027ll only live once.\"\n Alec laughed cynically and continued to dress. His manner resembled yesterday\u0027s, though he didn\u0027t blackmail. \"Yours is the talk of someone who\u0027s never had to earn his living,\" he said. \"You sort of trap me with I love you or whatever it is and then offer to spoil my career. Do you realize I\u0027ve got a definite job awaiting me in the Argentine? Same as you\u0027ve got here. Pity theNormannids leaving Saturday, still facts is facts isn\u0027t it, all my kit bought as well as my ticket and Fred and wife expecting me.\"\n Maurice saw through the brassiness to the misery behind it, but this time what was the use of insight? No amount of insight would prevent theNormannia from sailing. He had lost. Suffer-ing was certain for him, though it might soon end for Alec; when he got out to his new life he would forget his escapade with a\n gentleman and in time he would marry. Shrewd working-class youngster who knew where his interests lay, he had already crammed his graceful body into his hideous blue suit. His face stuck out of it red, his hands brown. He plastered his hair flat. \"Well, I\u0027m off,\" he said, and as if that wasn\u0027t enough said, \"Pity we ever met really if you come to think of it.\"\n \"That\u0027s all right too,\" said Maurice, looking away from him as he unbolted the door.\n \"You paid for this room in advance, didn\u0027t you, so they won\u0027t stop me downstairs? I don\u0027t want no unpleasantness to finish with.\"\n \"That\u0027s all right too.\" He heard the door shut and he was alone. He waited for the beloved to return. Inevitable that wait. Then his eyes began to smart, and he knew from experience what was coming. Presently he could control himself. He got up and went out, did some telephoning and explanations, placated his mother, apologized to his host, got himself shaved and trimmed up, and attended the office as usual. Masses of work awaited him. Nothing had changed in his life. Nothing remained in it. He was back with his loneliness as it had been before Clive, as it was after Clive, and would now be for ever. He had failed, and that wasn\u0027t the saddest: he had seen Alec fail. In a way they were one person. Love had failed. Love was an emotion through which you occasionally enjoyed yourself. It could not do things.\n “阿列克，起来。”\n 一只胳膊颤动了一下。\n “咱们该谈谈今后的打算了。”\n 他越发紧紧地偎依着，比他所假装的要清醒，浑身热乎乎的，肌肉发达，感到幸福。莫瑞斯也沉浸在幸福的感觉中。他动弹了一下，发觉对方作为回应用手使劲攥着他，于是忘掉自己想说什么了。外面还在下雨，一片光从那儿飘浮到他们上面来。一家陌生的旅店，临时的避难所，为了免遭敌人伤害，暂且把他们保护起来。\n “该起来了，小伙子，到了早晨了。”\n “那就起来吧。”\n “你这样攥着我，我怎么起来呀！”\n “好个急性子，我教你别这么急性子。”他对莫瑞斯不再表示敬意了，大英博物馆治好了他的自卑感。这是个假日，在伦敦与莫瑞斯相处，摆脱了一切烦恼，他想要打盹儿、浪费光阴、戏弄、做爱。\n 莫瑞斯又何尝不想这样做，那更惬意一些。然而逼近的未来使他精神涣散。出现了一抹曙光，温暖舒适更加显得不真实。总得说点儿什么，安排妥当。哦，即将结束的夜晚，人眠与睡醒的时候，强壮与体贴混杂在一起，美好的心情，黑暗中的平安，还能再迎来这样的夜晚吗？\n “你不要紧吗，莫瑞斯？”——因为他叹了口气。“你觉得舒服吗？把你的脑袋再往我身上靠，照你更喜欢的那个样子……就这样再靠。你别着急，你跟我在一起，着什么急。”\n 是啊，他交了好运，这是毫无疑问的。斯卡德显示出是个正直、厚道的人。与他共处，感到愉快。他是个宝贝，使人着迷，一千个人当中才能发现这么一个，是他渴望多年的梦幻。然而，他勇敢吗？\n “多好哇，你和我像这样……”两个人的嘴唇挨得那么近，几乎不是在说话了。“谁能想得到呢……我第一次看见你的时候，我就有了个念头：‘但愿我能跟那个主儿……’就是这么想的……‘我跟他能不能……’于是就这样了。”\n “是啊，因此咱们就得战斗。”\n “谁愿意战斗呢？”他用厌烦的声调说，“已经打够啦。”\n “全世界都与咱们为敌，咱们得同心协力，趁着还做得到的时候，定出计划来。”\n “你为什么说这样的话，真叫人扫兴！”\n “因为非说不可。咱们不能眼看着情况越变越糟，就像在彭杰那次似的，再一次伤害咱们的感情。”\n 阿列克突然伸出被太阳晒得粗糙不堪的手背，在莫瑞斯的身上蹭来蹭去，并且说：“疼吧？不疼才怪呢。我要是战斗，就这么干。”确实有点儿疼，这种愚蠢的行为还带有怨恨的意味。“别跟我谈彭杰的事。”他接下去说。“哼！呸！在彭杰，我从来就是个仆人。斯卡德，干这个；斯卡德，干那个。还有那个老太太，你知道有一次她说什么吗？她说：‘劳驾啦，请你为我寄这封信。你叫什么名字呀7．你叫什么名字呀！半年来，我每天走到克莱夫家那该死的正面门廊外面听候使唤，他母亲却不知道我的名字。她是个婊子。我想对她说：‘你叫什么名字呀？×你的名字。’我差点儿这么说出口。我要是说给她听就好了。莫瑞斯，你不能相信人们是怎样跟仆人说话的。粗鲁透顶，简直说不出口。那个阿尔赤·伦敦，你挺买他的账，可他跟你一样坏。你也这么坏，你也这么坏，张嘴就是：‘喂，来人哪！’你想不到吧，你差点儿失掉了把我弄到手的机会。你呼唤的时候，我几乎打消了爬那梯子的念头。我心里嘀咕：‘他不是真正想要我。’你没有按照我说的那样到船库来，把我气疯了，火冒三丈。架子太大啦！咱们等着瞧吧。我一直喜欢船库这个地方。从压根儿没听说过你的时候，我就经常到那儿去抽上一支烟。很容易就能把锁打开，当然，直到现在，我手里还有钥匙呢……船库，从船库向池塘望去，安静极了，有时候会蹿上一条鱼。我在地板上摆了好几个靠垫。”\n 他聊累了，就默然无语了。起初他的口气粗里粗气、快快活活的，有点儿做作，随后嗓音变得有气无力，悲伤地消失了。仿佛事实真相浮现到表面上来，使他承受不住似的。\n “咱们还可以在你的船库里见面。”莫瑞斯说。\n “不，咱们见不着面了。”阿列克把莫瑞斯推开，接着吃力地发出呻吟声，猛烈地紧紧拽过莫瑞斯来，好像世界末日到了一般地拥抱他。“不管怎样，你记住这个吧。”他溜出被窝，透过灰色的曙光俯视着，双臂空空，耷拉下来，好像希望让莫瑞斯记住他这个姿势似的。“我很容易地就能杀掉你。”\n “我也能杀掉你。”\n “我的衣服都跑到哪儿去啦？”他好像迷迷糊糊的。“都这么晚了，我连刮胡刀都没带。我没想到会在外面过夜……我必须——我得马上去赶火车，不然的话，弗雷德指不定会想什么呢。”\n “爱想什么想什么。”\n “天哪，要是现在弗雷德看见了咱俩这副样子。”\n “他没看见，不就结了。”\n “他有可能看见呀。我的意思是说，明天不是星期四吗？星期五捆行李，星期六诺曼尼亚号从南安普敦（译注：英格兰汉普郡的一座城市，英吉利海峡港口。l980年跃居英国第二大港。）起航，这就跟古老的英国告别了。”\n “你的意思是说，咱们两个人从此就再也见不着了。”\n “可不是嘛，你说得完全正确。”\n 要是雨停了该有多好！在昨天的倾盆大雨之后，又迎来了下雨的早晨，不论是万家屋顶还是博物馆，抑或自己的家以及绿林，统统是湿漉漉的。莫瑞斯抑制着自己的感情，非常谨慎地选择用词，说道：“我要谈的正是这个。我们为什么不安排好再一次见面的事呢？”\n “你打算怎么见面？”\n “你为什么不留在英国？”\n 阿列克吓得魂不附体，飕地转过身来。他半裸着身子，活脱脱像个未完全开化的人。\n “留下来？”他怒吼道，“不坐船啦？你疯了吗？我从来没听说过这样荒唐的废话。再支使我干这干那，啊，你会这么做的。”\n “我们两个人相遇，这是千载难逢的好机会。你也清楚，我们永远也不会再有这样的机缘了。留在我身边吧，我们相互爱慕。”\n “当然，但是这不能成为做蠢事的借口。留在你身边，怎么留？待在哪儿？我就是这个样儿，又粗俗又丑陋，你妈要是看见了我，会说什么？”\n “她永远也见不到你，我不在自己家里住。”\n “你要住在哪儿？”\n “跟你同住。”\n “哦，同住吗？谢谢，可是不行啊。我家里的人一点儿也不会对你产生好感，我决不怪他们。我倒是想知道，你的工作怎么办？”\n “我辞职。”\n “你在城里的那份差事能给你金钱和地位，怎能辞职呢？你不能辞职。”\n “当你不想干了的时候，你就能辞职。”莫瑞斯温柔地说．“一旦了解了其性质，任何工作你都能胜任。”他凝视那从发灰变得发黄的曙光。这些话，没有一句使他吃惊，然而他无法预测今后将怎么样。“我会找到一份跟你一起干的工作。”他明确地说，到了吐露实情的时刻了。\n “什么工作？”\n “咱们找找。”\n “找着找着就饿死了。”\n “不会的。找工作的期间，咱们有足够的钱来糊口。我不足个傻子，你也不傻，咱们不会挨饿。昨天晚上你睡着了以后-我一直醒着，琢磨这些问题。”\n 停顿了片刻。接着，阿列克用斯文一些的口吻说：“行不通，莫瑞斯。会把咱俩都毁了，难道你不明白吗？你也罢，我也罢。”\n “我不知道，也许是这样，也许不是这样。‘阶级’，我不明白，我知道今天我们该怎么办。咱们离开这儿，吃上一顿像样儿的早饭。然后到彭杰去，或者你愿意到哪儿就到哪儿，见你那位弗雷德。你告诉他，你改变了主意，不移居海外了，改为跟霍尔先生一起就业。我会跟你同往，我才不在乎呢。我可以见任何人，什么事都敢正视。他们如果愿意猜想，就听之任之，我已经感到厌烦了。告诉弗雷德把你那张船票退掉，所受的损失，由我来补偿。这，是我们获得自由的第一步，随后我们再做第二件事。要担风险，其他的也都得担风险。而不论是谁，只有一条命。”\n 阿列克讥诮地笑了，继续穿衣服。他的态度跟昨天的相似，不过，没有进行恫吓。“你这一套是从来也用不着自食其力的人说的话。”他说，“你用‘我爱你’等等让我上了圈套，这会儿又想要毁掉我的前程。你难道不知道，在阿根廷有一份可靠的差事在等着我吗？就跟你在这里有个职业一样。真可惜！诺曼尼亚号星期六就起航了。不过，事实就是事实，不是吗？我的行装都已经打点好了，船票也买了，弗雷德和我嫂子正眼巴巴地等着我呢。”\n 莫瑞斯透过阿列克这番粗鄙的言语看出了隐藏在背后的悲哀。然而，事到如今，洞察力又有什么用呢？多么了不起的洞察力也无法阻挡诺曼尼亚号起航。他失败了，苦恼不可避免地等待他。至于阿列克呢，这种苦恼可能即将结束。离开此地进入新生活之后，他就忘掉了与一位绅士之间的这些越轨行为，迟早会结婚的。属于工人阶级的这个精明的小伙子明白自己的利益所在。他已经把那优美的肉体塞进了丑陋的蓝色三件套礼服，红脸蛋儿和褐色的手从衣服里伸了出来，头发梳平了。“好啦，我走了。”他说。随后，好像意犹未尽．又补上一句：“想想看，我们俩真的还不如不见面呢。”\n “这也没有什么。”莫瑞斯说。当阿列克拨开门闩的时候，莫瑞斯把脸转了过去。\n “你已经预付房费了，对吧？下楼后，他们不会拦住我吧？我可不愿意最后弄得不愉快。”\n “你就放心好了。”他听见关门的声音，就剩下他一个人了。他等待心上人回来，他不得不等待。接着，两眼痛起来了。根据经验，他知道会发生什么事。过一会儿他就能克制自己的感情了。他起床，走出去，打了几个电话，解释一番。安抚了母亲，向昨天晚上的东道主道歉。他刮胡子，修边幅，照常去上班。大量的工作等着他，他的人生丝毫也没有变，什么东西也没留下。他又回到孤寂中了，犹如跟克莱夫之间有过那些事以前，以及事后的孤寂。这样的孤寂将来还会永远延续下去。他失败了。然而最使他难过的是，他眼睁睁地看着阿列克败下阵去。在某种意义上，他们俩是一个人。爱吃了败仗，爱是一种感情，通过爱，你能偶尔享受乐趣。爱是成不了什么气候的。\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/313/471.html","bookId":162,"book":{"id":162,"title":"莫瑞斯 Maurice","description":"简介： 一部探讨社会价值与爱情冲突的经典文学作品。 这是一部描写同性恋情的小说，莫瑞斯和克莱夫是剑桥大学的同学，他们背负社会歧视的压力相爱三年，克莱夫突然提出中止这段感情，遂与安妮结婚。这一变故使莫瑞斯几乎精神崩溃，走上自杀的道路。他寻求心理医生的治疗，谴责...","cover":"http://novel.tingroom.com/uploads/110526/1-110526162KV57.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/313","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:23:13 AM"}}
