{"id":19980,"no":18,"title":"CHAPTER XVII. THE SCOUT\u0027S STORY.","content":"\"Luckily enough there was a canoe lying close at our feet. \u0027Shove it out, Jack,\u0027 says I, \u0027and then keep along the bank.\u0027 We gave it a shove with all our strength and sent it dancing out into the river. Then we dived in and swum down close under the bank. There was bushes growing all along, and we came up each time under \u0027em. The redskins was some little distance behind us as we reached the river, and in course thought we had throwed ourselves flat in the canoe. In a minute or two they got another and paddled off to it, and we soon heard the shout they raised when they found it was empty. By this time we was a hundred yards below the spot where we had taken to the water, and knowing as they would be off along the bank and would find us in no time, we scrambled straight up and made for the trees. \"We was within fifty yards of the edge of the forest, and none of the redskins was near us, as the hull body had clustered down at the spot where we had jumped in. We hadn\u0027t fairly set foot on the bank afore they saw us and, with a whoop—which sometimes wakes me even now in my sleep and makes me sit up with the sweat on my forehead—they started. I could run faster then than I can now, and ye may guess I went my best. We plunged into the trees and went as hard as we could foot it, the redskins being fifty or sixty yards behind. \"Our hope was to find a place with a thickish underwood. It was darker a deal under the trees than in the clearing, still it was not dark enough to hide us from redskin eyes. We run straight, for we knew they could see us, and arter about four hundred yards we come upon a place where the undergrowth grew thick. Here we began to dodge \u0027em, turning now one way and now another, keeping always low in the bushes. They had lost us by sight now, but there was so many of \u0027em that we pretty nigh despaired of getting through. Some of \u0027em had tried to follow us, but the best part had run straight on for a bit, and then, when sure they had headed us, scattered right and left, so that they were ahead of us now as well as on our traces, and we could hear \u0027em shouting all round us, so we did the only thing there was to be done and made the best of our way back to the clearing, keeping low and taking good care not to cross any patch where the moonlight through the trees fell on the ground. \"It were lucky for us that it was a camp of braves. Had it been an ordinary redskin encampment there would have been squaws, and boys, and wuss still, dogs, who would have seed us the moment we got back; but being all braves on the war-path the hull gang had started arter us, and not a soul had remained in the clearing. We did not rest there long, you may be sure, but made straight down to the water. There we picked out a canoe, crossed the river, and got into the shade of the trees the other side. Then we kept along down it till we got close to the fort of Detroit. \"We could see a good many smoldering fires out afore it, and guessed that a strong body of redskins, pretending to be friends, had camped there. We made round \u0027em and reached the gate of the fort safe. The sentries wouldn\u0027t let us in, but when a sergeant was fetched it turned out as he knew us, seeing that we had been scouting out from thar in the summer. Pretty thankful we was when the gate closed arter us. Our news would keep, so we waited till morning afore we saw the major, and then told him the whole history of the matter, and how Pontiac had raised all the tribes east of the Mississippi against us. \"We found that Pontiac had been into the camp with fifty of his warriors three days afore, professing great friendship, and had said that in two or three days he would call again and pay a formal visit. \"Detroit then was but a trading post, defended by a stockade twenty feet high and twelve hundred yards in circumference. About fifty houses of traders and storekeepers stood within it. The garrison was composed of 120 men of the Eighteenth Regiment and 8 officers. They had three guns—two six-pounders, and a three-pounder—and three mortars, but their carriages was so old and rotten that they was of no real service. Two vessels, mounting some small guns, lay in the river off the fort. The governor was a good soldier, but he was naturally startled at hearing that there was something like a thousand redskins in the woods round; but he said that now he had warning he was not afraid of \u0027em. A messenger was sent off in a canoe to carry the tidings east and to ask for re-enforcements, and the traders was all told to get their arms ready. \"At eight o\u0027clock in the morning Pontiac was seen a-coming with three hundred warriors. There had been no declaration of war, and the redskins was supposed to be friendly, so the major didn\u0027t like to be the first to commence hostilities, as folks who knew nothing of it might likely enough have raised an outcry about massacring the poor Injuns. Howsumever, he called all the troops under arms and disposed \u0027em behind the houses. The traders, too, with their rifles, were drawn up ready. The gates was opened when Pontiac arrived, and he and his warriors entered. They had left their rifles behind them, as they pretended that their mission was a peaceful one, but they had all got their tomahawks and knives under their blankets. They advanced in a body toward where Major Gladwin and his officers was standing in front of his quarters. \"Jack and me and two or three scouts who happened to be in the fort stood just behind, careless like, with our rifles, so that, in case of any sudden attack, we could keep them back for a moment or two. I noticed that Pontiac carried in his hand a wampum belt. I noticed it because it was green on one side and white on the other, and it turned out arterward that when he twisted that belt with two hands it was to be the signal for an attack. \"Pontiac spoke soft for a time. He was a fine redskin; that can\u0027t be denied. He was a Catawba by birth, but had been adopted into the tribe of Ottawas and had risen to be their chief. He were a great brave and one of the best speakers I ever heard. He was a wise chief, as you may guess by the way he got all the tribes to lay aside their private quarrels and make common cause against us. I watched him close. He kept his eyes on the major and spoke as cool and as calm as if he had nothing on his mind; but I could see the warrior glancing about, wondering, no doubt, what had become of the soldiers. Presently the chief changed his tone and began to pretend as he was in a rage at some grievance or other. \"The major jest put his whistle to his lips, and in a moment from behind the houses the soldiers and traders marched out, rifle in hand. You never saw a more disgusted crew than them redskins. I\u0027ll do Pontiac justice to say that he never so much as moved, but jest went on talking as if he hadn\u0027t noticed the troops at all. The major answered him in the same way, and after half an hour\u0027s talk the redskins went out again without so much as a knife having been shown. Major Gladwin gave Jack and me papers testifying as how we had saved Detroit from destruction, and sent an account of it to Governor Amherst, and to this day Jack and me draws special pensions for that \u0027ere business, besides what we earned as British scouts.\" \"That was an adventure, Peter!\" Harold said. \"They did not take Detroit after all, did they?\" \"No; we beat \u0027em off handsome when they tried it. Then they laid siege to Fort Pitt and tried very hard there, too, but the place held out till some troops who had come up marched out from here and raised the siege. At some of the little places they succeeded. Lots of settlers was massacred. At Fort Sandusky Ensign Paulli and the garrison was massacred by a party of Hurons and Ottawas who come in as friends. This was on the same day as they had intended to do for us at Detroit. \"At St. Joseph\u0027s an English ensign with fourteen soldiers was killed by the Pottawatomies, but nowhere did Pontiac obtain any real successes. The French in Illinois were preparing to leave, and he couldn\u0027t git no assistance from them. After the siege of Fort Pitt was raised peace was patched up again. Pontiac\u0027s confederacy, finding as they hadn\u0027t got none of the successes he promised \u0027em, was beginning to break up, and the English saw no chance of doing any good by hunting the redskins among the forests, so both parties was willing for peace. \"Pontiac never gave any more trouble, and some years arterward, coming into one of the towns, he was killed by an Injun who had a private grudge agin\u0027 him. And now I\u0027m longing for a quiet pipe, and you\u0027d better turn in. There\u0027s no saying whether we\u0027ll have a quiet night of it.\" A fortnight passed without further incident. Then the sky became overcast, and Peter and the Indians agreed that snow would soon fall. All hands were at once set to work to make up their stores into packages. The deerskins and blankets were tied in bundles; besides these there were only two kegs of powder and about two hundred pounds of frozen fish. Harold was in high glee at the thought that their imprisonment was to come to an end, although there was no doubt that the attempt would be a hazardous one, as the backwoodsmen were sure that the instant the snow began to fall the Indians would be out in great numbers round the island, to prevent the defenders taking advantage of the storm. Several times Harold observed the two backwoodsmen talking with the Seneca chief and looking at the sky, and he thought that their countenances expressed some anxiety. \"What is it, Peter?\" he asked at length. \"Don\u0027t you think we shall have a snowstorm?\" \"We may have snow,\" Peter said, \"but I think it\u0027s more than a snowstorm that\u0027s coming. The clouds are flying past very fast, and it seems to me as ef we\u0027re in for a big gale of wind.\" \"But that will drift the snow and cover our footsteps almost as well as a snowstorm,\" Harold said. \"Yes, it \u0027ll do all that,\" the scout answered. \"What is the objection to it, Peter?\" \"In the first place, lad, ef it don\u0027t snow we may stop where we are, for there\u0027d be no chance of getting through the Injuns unless it snowed so thick you couldn\u0027t see five feet away. It\u0027ll be difficult enough, anyhow. There\u0027ll be four or five hundred of the varmints out, for they\u0027ll bring even their boys with \u0027em, so as to form a pretty close line round the island. Our only chance\u0027ll be for the Senecas to go first, and to silence, afore they can give the alarm, any they might meet on our line. That might be done in a heavy snowstorm, but without snow it would be impossible. In the next place, even if we got through \u0027em, we\u0027d have to carry our canoe.\" \"Why?\" Harold asked, surprised. \"What good could the canoe be to us, with the lake frozen hard?\" \"You see, the wind is on the shore here, lad, and when it does blow on these lakes it blows fit to take the har off your head. It\u0027s as much as a man can do to make way agin\u0027 it, and I doubt whether the gals could face it, even with our help. As to carrying a canoe in its teeth, it couldn\u0027t be done.\" \"But why carry the canoe at all, Peter? That\u0027s what I cannot understand.\" \"Waal, you see, lad, the force of the wind acting on sech a big sheet of ice will move it, and like enough you\u0027d see it piled up in a bank forty feet high on this side of the lake, and there\u0027ll be a strip of clear water half a mile wide on the other. That\u0027s why we must take the canoe.\" Harold was silent. In the face of such a probability it was clear that they must encumber themselves with the canoe. The prevision of the scout proved well founded. Before evening the wind was blowing with tremendous force. Small flakes of snow were driven before it, inflicting stinging blows on the face and eyes of those who ventured out of shelter. As it became dark the lookout announced that he could, see large numbers of Indians starting from the shore at some distance to the right and left of them, showing that the redskins were fully alive to the possibility of the garrison of the island taking advantage of the storm, which would hide their trail, to effect their escape. Every hour the fury of the gale increased, and it was unanimously agreed that until it diminished it would be impossible for the girls, and for men carrying a canoe, to face it. Two men were placed on watch at the mouth of the cove, where mines similar to the first had been sunk in the ice in a semicircle some little distance outside that before exploded. This precaution had been taken on the day succeeding the great repulse of the enemy, although the scouts felt assured that the attempt would not be repeated. But it was thought possible that the Indians might toward morning, if they found the whites did not attempt to pass them, take advantage of the storm to attempt a surprise. After it became dark Cameron and Harold, as was their custom, went into the girls\u0027 hut to chat until it was time to turn in. The deerskin and blankets had again been unrolled, and the covering of snow kept the interior warm in spite of the storm without. \"What is that noise?\" Nelly asked in a pause of the conversation. \"I don\u0027t know,\" Harold answered. \"I have heard it for some time.\" All were silent, intent upon listening. Even above the fury of the gale a dull grinding sound, with occasional crashes, could be heard. \"I think it must be the ice,\" Harold said. \"I will go out and see.\" On issuing from the hut he was for a time blinded by the force of the wind and the flying particles of snow. The din was tremendous. He made his way with difficulty in the teeth of the storm to the edge of the rocks. Then he started in surprise. A great bank of cakes and fragments of ice was heaped up against the wall of the rock, crashing and grinding against each other as they were pressed onward by fresh additions from beyond. Already the bank was nearly level with the top of the rock, and some of the vast blocks, two feet in thickness, had been thrust on to it. The surface of the lake beyond was no longer a brilliant white. Every particle of snow had been swept away and the dull gray of the rough ice lay unbroken. He made his way at once to the hut of the men, and just as he reached the entrance Peter (who had also been out to reconnoiter) came up, and before Harold had turned to speak he put his head into the hut. \"Turn out!\" he said. \"I tell ye we\u0027re in a fix. This aint no common gale. I don\u0027t know as ever I\u0027ve been in a worse one.\" \"What\u0027s the use of turning out?\" Pearson asked. \"We can\u0027t do nothing, and it\u0027s warmer here a sight than it is outside.\" \"I tell ye ye\u0027ve got to go. The ice is breaking up fast and it\u0027s level with the top of the island already. Unless I\u0027m mistaken there\u0027ll be forty foot of ice piled over this island afore an hour.\" This was, indeed, alarming news. And in a minute the occupants of the hut were all in the open air. \"You can call in your scouts, Seneca. There aint no fear of an attack to-night. No mortal soul—not even an Injun—could stand the force of the wind out on the lake.\" A very short examination sufficed to show the truth of Peter\u0027s anticipations. Already the upper part of the bank was sliding over the rock, and it was clear that in a very short time the whole would be covered. \"What is to be done, Peter?\" Harold shouted. \"We must take to the canoe. There\u0027s clear water on the other side.\" Harold crossed the island and saw that what Peter said was correct. A broad strip of black water stretched away in the darkness toward the shore. The whole ice-sheet was moving bodily before the wind, and as the island stood up in its course the ice to windward of it was forced up over it, while under its lee the lake was clear. Not a moment was lost. The canoe was got out, carried over the rocks, and carefully lowered into the water under shelter of the island. All the stores and provisions were lowered into it. A deerskin was spread on the bottom, and the girls, having been helped down into the boat, were told to lie down and were then covered with blankets. The men wrapped themselves up in skins and blankets and took their places in the canoe, the four Indians taking paddles. Quickly as the preparations had been made, there were but a few feet of the island uncovered by the ice, as the last man descended into the boat and they pushed off and, after a couple of strokes, lay with the boat\u0027s head facing toward the island at a distance of fifty yards from it. Although somewhat sheltered from the wind, the Indians were obliged to paddle hard to maintain their position. Harold wondered at first that they had not kept closer to the island, but he soon understood their reason for keeping at a distance. The massive blocks of ice, pressed forward by, the irresistible force behind, began to shoot from the top of the island into the water, gliding far on beneath the surface with the impetus of the fall, and then shooting up again with a force which would have destroyed the canoe at once had they touched it. Soon a perfect cataract of ice was falling. Peter and Pearson took their places on each side of the bow of the canoe, with poles to push off the pieces as they drifted before the gale toward the shore. The work required the utmost strength and care. One touch from the sharp-edged blocks would have ripped open the side of the bark canoe like a knife, and in the icy cold water, encumbered by floating fragments of ice, even the best swimmer could not have gained the solid ice. The peril was great, and it needed all the strength and activity of the white men and the skill of the paddlers to avoid the danger which momentarily threatened them. So quickly did the blocks float down upon them that Pearson thought it might be impossible to avoid them all. The skins, therefore, were hung round the boat, dropping some inches into the water, and these, although they could not have prevented the boat from being stove in, by the larger fragments, yet protected its sides from the contact of the smaller ones. For upward of an hour the struggle continued, and Harold felt something like despair at the thought of a long night passed in such a struggle. Presently sounds like the booming of cannon were heard above the gale. \"What is that?\" he shouted to the Seneca chief, next to whom he was sitting. \"Ice break up,\" the chief replied. \"Break up altogether.\" This proved to be the case. As the ice was driven away from the further side of the lake the full force of the wind played upon the water there, and as the streak widened a heavy sea soon got up. The force of the swell extended under the ice, aiding the effect of the wind above, and the vast sheet began to break up. The reports redoubled in strength, and frequently the ice was seen to heave and swell. Then, with a sound like thunder, it broke and great cakes were forced one on the top of another, and soon, instead of a level plain of ice, a chaos of blocks were tossing about on the waves. Harold watched the change with anxiety. No longer was the channel on either side marked by regular defined lines, but floating pieces encroached upon it, and, looking toward the shore, the channel appeared to be altogether lost. The danger was overwhelming, but the Indians, paddling with increased strength, urged the boat forward until within a few yards of the island. A few minutes before such an approach would have assured the immediate destruction of the boat. But Harold saw with surprise that, almost simultaneously with the breaking up of the ice-sheet, the fall of blocks from the island had ceased. A moment\u0027s reflection showed him the reason of this phenomenon. With the break-up of the ice-field the pressure from behind had suddenly ceased. No longer were the blocks piled on the island pushed forward by the tremendous pressure of the ice-field. The torrent was stayed and they could approach the island with safety. As soon as they were assured that this was so the canoe was brought close to the rocks. Pearson leaped ashore, climbed the rocks and the ice piled twenty feet above them, and with his pole convinced himself that at this point there were no loose blocks likely to fall. Having satisfied himself on this head, he descended again and took his place in the boat. This was moored by a rope a few feet long to a bush growing from a fissure in the rock close to the water\u0027s edge. He and Peter remained on watch with their poles, to fend off any pieces of ice which might be brought round by the waves, while the rest of the crew, wrapping themselves up in their blankets, lay down at the bottom of the boat. The next morning the storm still raged, and the lake presented the appearance of an angry sea. Sheltered under the lee of the island, the party were protected from its effects, although the light canoe rose and fell on the heavy swell. The ice had wholly disappeared from the lake, the pieces having been ground to atoms against each other in the storm. Along the line of shore there was a great bank of ice as high as the tree-tops. \"The ways of the Lord are won\u0027erful,\" Duncan Cameron said. \"The storm which threatened to be our destruction has proved our salvation. When it abates we shall be able to paddle down the lake without fear of interruption.\" \"Yes,\" Peter said, \"the varmints are not likely to follow us. In the first place, unless they thought of taking their canoes into the forest when the storm first began, which aint likely, as they was a-thinking only of cutting off our escape, they\u0027d \u0027ve been smashed into tinder. In the second place, they couldn\u0027t ketch us if they had canoes, for, as we\u0027ve eight paddles, counting them we made out of the seats when we was on shore, we\u0027d be able to laugh at \u0027em. And lastly, they\u0027ve had such a taste of the quality of our rifles that, even if they had a dozen canoes on hand, I doubt if they\u0027d care to attack us. No, sir; when this storm\u0027s over we have nothing to do but paddle down to the settlements at the other end of the lake.\" Toward the afternoon the storm abated, and next morning the sun was shining brilliantly and the waves had gone down sufficiently to enable the canoe to start on her voyage. \"Now, boys,\" Pearson said cheerfully, \"ef ye don\u0027t want to git froze up again you\u0027d best be sharp, for I can tell ye about thirty-six hours of this weather and the lake\u0027ll be solid again.\" Five minutes later the canoe with its eight sturdy paddlers started on its way, speeding like an arrow from the ice-covered island which had done them such good service in their greatest need. \"Now, Jake,\" Peter said, \"the more strength you put into that paddle of yourn the sooner you\u0027ll have a piece of meat atween your jaws.\" The negro grinned. \"Don\u0027t talk ob him, Massa Peter; don\u0027t say a word about him until I see him. Fish bery good when dere\u0027s noting else to eat, but Jake never want to see him again. He hab eat quite enough for the rest ob his life.\" Cameron, who was not accustomed to the use of the paddle, sat in the stern with the two girls; but the others were all used to the exercise, and the boat literally bounded along at each stroke from the sinewy arms, and by nightfall they had reached the opposite shore. After some hours\u0027 work together two of them had rested, and from that time they took it by turns, six paddles being kept constantly going. Without any adventure they arrived safely at the end of the lake. The clearing where Nelly had lived so long, and where her father and mother had been killed, was passed in the night, much to Harold\u0027s satisfaction, as he was afraid that she would have been terribly upset at the many sad memories which the sight of the place could not but call up. On their way down they had seen many gaps in the forest caused by the gale, but it was not until they reached their landing place that the full effect of its destructive force was visible. Several scows and other boats lay wrecks upon the shore, every house in the little village was leveled to the ground, the orchards were ruined, palings and fences torn down, and the whole place strewn with fragments. A few people were moving among the ruins. They gazed with a dull apathy upon the new-comers, apparently dazed by the misfortune that had befallen them. Harold learned, on questioning them, that twenty-seven persons had been killed and the majority of the survivors more or less seriously injured. With the exception of the few whom they saw, about all the survivors had been taken off to the town in boats down the river, or in wagons lent by neighbors whose villages, sheltered in the woods, had escaped the ravages of the gale. After a few hours\u0027 halt, having obtained meat and other stores, they proceeded on their way to Detroit. Here Nelly had several friends, who had long believed her to have fallen at the massacre at the farm. By them she was gladly received, and she took up her abode in a family with some daughters of her own age. Harold found that there was a considerable sum of money in the bank in her father\u0027s name, and from this, after a consultation with her, a sum of money sufficient to provide the Seneca and his followers with blankets, powder, and Indian finery for years was drawn and bestowed upon them. A day or two afterward the Indians left for their own country, highly gratified with the success of the expedition and proud of the numerous scalps which hung from each of their girdles. Harold learned that there was but little fighting going on along the Canadian frontier. The winter had set in again with extreme severity; the St. Lawrence would be frozen, and he would have no means of leaving Canada; he was therefore well content to settle down until the spring at Detroit, where he received numerous and hearty invitations to stay, for any time, from the various friends of his cousins. Jake, of course, remained with him. Peter went up to Montreal, where he had some relatives residing; Harold promising to call for him on his way East in the spring. Pearson, after a few days\u0027 stay in Detroit, started again with a comrade on a hunting expedition. Cameron and his daughter also spent the winter at Detroit. The months passed very pleasantly to Harold. Since the war began he had had no period of rest or quiet, and he now entered with zest into the various amusements, sleighing, and dancing, which helped to while away the long winter in America. He also joined in many hunting parties, for in those days game abounded up to the very edge of the clearings. Moose were abundant, and the hunt of these grand deer was full of excitement. Except when the snow is on the ground these animals can defy their pursuers, but the latter with their snowshoes go lightly over the frozen snow, in which the moose sink heavily. There were many discussions as to the future of Nelly. Several of her friends would gladly have adopted her as a member of their family, but Harold warmly urged that she should go to England and take up her abode with his mother, who was her nearest relative, and Nelly, somewhat to the surprise of her friends, finally agreed to this proposal. A purchaser was readily found for the farm, which was an excellent one, and the proceeds of the sale, with the amount of savings in the bank, gave her a little fortune of some twenty-five hundred pounds. When the spring came and the navigation of the lake was open, Harold, Nelly, the Camerons, and Jake started in a ship for Montreal. There they were joined by Peter and sailed down to Quebec, where Nelly and the Camerons took passage for England. Very deep was the gratitude which Duncan expressed to the friends who had restored his daughter to him. He had had enough of the colonies, and intended to spend the rest of his life among his own people in Scotland. Harold, Peter, and Jake sailed to join the English army in the South. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3107/85574.html","bookId":937,"book":{"id":937,"title":"True to the Old Flag","description":"简介： MY DEAR COUSIN: I am leaving next week with my husband for England, where we intend to pass some time visiting his friends. John and I have determined to accept the invitation you gave us last summer for Harold to come and spend a few months with you...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3107","creation":"Aug 1, 2019 12:23:56 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
