{"id":19982,"no":20,"title":"CHAPTER XIX. IN AN AMERICAN PRISON.","content":"Upon the morning after the victory of Camden Lord Cornwallis dispatched Colonel Tarleton with the light infantry and the German legion, 350 men in all, to attack Colonel Sumpter, who, with 800 men and two pieces of cannon, had, upon hearing late at night of General Gates\u0027 defeat, marched away at all speed. Thinking himself out of danger he halted at midday to rest his men. The British came upon them by surprise. One hundred and fifty were killed or wounded and 300 made prisoners. The rest scattered as fugitives. Two guns, one thousand stand of arms, and all the stores and baggage were taken, and 250 prisoners, some of them British soldiers and the rest loyal militiamen, whom Sumpter had captured near Camden, were released. Lord Cornwallis, after obtaining supplies for his troops and taking steps for the pacification of the State, was about to move forward into North Carolina, when he received news of the destruction of a column under Major Fergusson. This officer, with a detachment of 150 British regulars and 800 provincials, was attacked by 5000 mounted partisans, most of them border men accustomed to forest fighting. Fergusson took up a position on a hill called King\u0027s Mountain. This from its height would have been a good position for defense, but being covered with wood it offered great opportunities for the assailants, who dismounted and fought behind trees in accordance with the tactics taught them in Indian warfare. Again and again the English charged with the bayonet, each time driving their assailants back, but these instantly recommenced their destructive fire from their shelter behind the trees. In little over an hour from the commencement of the fight 150 of the defenders were killed and many more wounded. Still they repulsed every attack until their commander fell dead; then the second in command, judging further resistance in vain, surrendered. On the news of this misfortune Lord Cornwallis fell back, as the western frontiers of South Carolina were now exposed to the incursions of the band which had defeated Fergusson. In the retreat the army suffered terribly. It rained for several days without intermission. The soldiers had no tents, and the water was everywhere over their shoes. The continued rains filled the rivers and creeks prodigiously and rendered the roads almost impassable. The climate was most unhealthy, and for many days the troops were without rum. Sometimes the army had beef and no bread, sometimes bread and no beef. For five days it was supported on Indian corn, which was collected in the fields, five ears being served out as a daily allowance to each two soldiers. They had to cook it as they could, and this was generally done by parching it over the fire. One of the officers of the quartermaster\u0027s department found some of the loyal militia grating their corn. This was done by breaking up a canteen and punching holes in the bottom with their bayonets, thus making a kind of rasp. The idea was communicated to the adjutant general and afterward adopted for the army. The soldiers supported their hardships and privations cheerfully, as their officers were no better provided than themselves and the fare of Lords Cornwallis and Rawdon was the same as their own. The toilsome march came to an end at last, and the army had rest after its labors. The only other incident of importance which occurred was an action between a force under Colonel Tarleton and one of considerably superior strength under General Sumpter, strongly posted on a commanding position. The British attack was repulsed, but General Sumpter, being badly wounded, was carried off the field during the night, and the force under his command at once dispersed. No other event occurred, and the army passed its time in winter quarters till the spring of 1781. During this winter the enemies of Great Britain were re-enforced by the accession of the Dutch. At this time the efforts which England was called upon to make were indeed great. In Europe France, Spain, and Holland were banded against her; in India our troops were waging a desperate war with Hyder Ali; while they were struggling to retain their hold on their American colonies. Here, indeed, the operations had for the last two years languished. The re-enforcements which could be spared were extremely small, and although the British had almost uniformly defeated the Americans in every action in which there was any approach to equality between the forces engaged, they were unable to do more than hold the ground on which they stood. Victorious as they might be, the country beyond the reach of their rifles swarmed with their enemies, and it became increasingly clear to all impartial observers that it was impossible for an army which in all did not amount to more than 20,000 men to conquer a continent in arms against them. Harold was not present at the later events of the campaign of 1780. He and Jake had been with the column of Major Fergusson. Peter Lambton had not accompanied him, having received a bullet wound in the leg in a previous skirmish, which, although not serious, had compelled him to lay up for a time. \"Me no like de look ob dis affair, Massa Harold,\" Jake said, as the Americans opened fire upon the troops gathered at the top of King\u0027s Mountain. \"Dese chaps no fools; dey all backwoodsmen; dey know how to fight de redskins; great hunters all ob dem.\" \"Yes,\" Harold agreed, \"they are formidable opponents, Jake. I do not like the look of things. These men are all accustomed to fighting in the woods, while our men have no idea of it. Their rifles are infinitely superior to these army muskets, and every man of them can hit a deer behind the shoulder at the distance of 150 yards, while at that distance most of our men would miss a haystack.\" The scouts and a few of the provincials who had been accustomed to forest warfare, took up their position behind trees and fought the advancing enemy in their own way. The mass of the defenders, however, were altogether puzzled by the stealthy approach of their foes, who advanced from tree to tree, seldom showing as much as a limb to the fire of the defenders, and keeping up a deadly fire upon the crowd of soldiers. Had there been time for Major Fergusson, before being attacked, to have felled a circle of trees and made a breastwork round the top of the hill, the result might have been different. Again and again the British gallantly charged down with the bayonet, but the assailants, as they did so, glided away among the trees after firing a shot or two into the advancing troops, and retreated a hundred yards or so, only to recommence their advance as soon as the defenders retired again to their position. The loss of the assailants was very slight, the few who fell being for the most part killed by the rifles of the scouts. \"It am no use, Massa Harold,\" Jake said. \"Jest look how dem poor fellows am being shot down. It\u0027s all up wid us dis time.\" When upon the fall of Major Fergusson his successor in command surrendered the post, the defenders were disarmed. The Kentucky men, accustomed only to warfare against Indians, had no idea of the usages of war and treated the prisoners with great brutality. Ten of the loyalist volunteers of Carolina they hung at once upon trees. There was some discussion as to the disposal of the rest. The border men, having accomplished their object, were anxious to disperse at once to their homes. Some of them proposed that they should rid themselves of all further trouble by shooting them all. This was overruled by the majority. Presently the prisoners were all bound, their hands being tied behind them, and a hundred of the border men surrounded them and ordered them to march across the country. Jake and several other negroes who were among the captives were separated from the rest, and, being put up at auction, were sold as slaves. Jake fell to the bid of a tall Kentuckian who, without a word, fastened a rope round his neck, mounted his horse, and started for his home. The guards conducted the white prisoners to Woodville, eighty miles from the scene of the fight. This distance was accomplished in two days\u0027 march. Many of the unfortunate men, unable to support the fatigue, fell and were shot by their guards; the rest struggled on, utterly exhausted, until they arrived at Woodville, where they were handed over to a strong force of militia gathered there. They were now kindly treated, and by more easy marches were taken to Richmond, in Virginia, where they were shut up in prison. Here were many English troops, for the Americans, in spite of the terms of surrender, had still retained as prisoners the troops of General Burgoyne. Several weeks passed without incident. The prisoners were strongly guarded and were placed in a building originally built for a jail and surrounded by a very high wall. Harold often discussed with some of his fellow-captives the possibility of escape. The windows were all strongly barred, and even should the prisoners break through these they would only find themselves in the courtyard. There would then be a wall thirty feet high to surmount, and at the corners of this wall the Americans had built sentry-boxes, in each of which two men were stationed night and day. Escape, therefore, seemed next to impossible. The sentries guarding the prison and at the gates were furnished by an American regiment stationed at Richmond. The wardens in the prison were, for the most part, negroes. The prisoners were confined at night in separate cells; in the daytime they were allowed, in parties of fifty, to walk for two hours in the courtyard. There were several large rooms in which they sat and took their meals, two sentries with loaded muskets being stationed in each room. Thus, although monotonous, there was little to complain of; their food, if coarse, was plentiful, and the prisoners passed the time in talk, playing cards, and in such games as their ingenuity could invent. One day when two of the negro wardens entered with, the dinners of the room to which Harold belonged, the latter was astounded at recognizing in one of them his faithful companion Jake. It was with difficulty that he suppressed an exclamation of gladness and surprise. Jake paid no attention to him, but placed the great tin dish heaped up with yams, which he was carrying, upon the table, and, with an unmoved face, left the room. A fortnight passed without a word being exchanged between them. Several times each day Harold saw the negro, but the guards were always present, and although, when he had his back to the latter, Jake sometimes indulged in a momentary grin or a portentous wink, no further communication passed between them. One night at the end of that time Harold, when on the point of going to sleep, thought he heard a noise as of his door gently opening. It was perfectly dark, and, after listening for a moment he laid his head down again, thinking that he had been mistaken, when he heard close to the bed the words in a low voice: \"Am you asleep, Massa Harold?\" \"No, Jake,\" he exclaimed directly. \"Ah, my good fellow! how have you got here?\" \"Dat were a bery easy affair,\" Jake said. \"Me tell you all about it.\" \"Have you shut the door again, Jake? There is a sentry coming along the passage every five minutes.\" \"Me shut him, massa, but dere aint no fastening on dis side, so Jake will sit down wid him back against him.\" Harold got up and partly dressed himself and then sat down by the side of his follower. \"No need to whisper,\" Jake said. \"De walls and de doors bery thick; no one hear. But de sentries on de walls hear if we talk too loud.\" The windows were without glass, which was in those days an expensive article in America, and the mildness of the climate of Virginia rendered glass a luxury rather than a necessity. Confident that even the murmur of their voices would not be overheard if they spoke in their usual way, Jake and Harold were enabled to converse comfortably. \"Well, massa,\" Jake said, \"my story am not a long one. Dat man dat bought me he rode in two days someting like one hundred miles. It wor a lucky ting dat Jake had tramp on his feet de last four years, else soon enough he tumble down, and den de rope round him neck hang him. Jake awful footsore and tired when he git to de end ob dat journey. De Kentucky man he lib in a clearing not far from a village. He had two oder slaves; dey hoe de ground and work for him. He got grown-up son, who look after dem while him fader away fighting. Dey not afraid ob de niggers running away, because dere plenty redskin not far away, and nigger scalp jest as good as white man\u0027s. De oder way dere wor plenty ob villages, and dey tink nigger git caught for sure if he try to run away. Jake make up his mind he not stop dere bery long. De Kentuckian was a bery big, strong man, but not so strong as he was ten years ago, and Jake tink he more dan a match for him. Jake pretty strong himself, massa?\" \"I should think you were, Jake,\" Harold said. \"There are not many men, white or black, who can lift as great a weight as you can.\" \"For a week Jake work bery hard. Dat Kentuckian hab a way ob always carrying his rifle about on his arm, and as long as he do dat dere no chance ob a fair fight. De son he always hab a stick, and he mighty free wid it. He hit Jake seberal times, and me say to him once, \u0027Young man, you better mind what you do.\u0027 Me suppose dat he not like de look dat I gib him. He speak to his fader, and he curse and swear awful, and stand wid de rifle close by and tell dat son ob his to larrup Jake. Dat he do, massa, for some time. Jake not say noting, but he make a note ob de affair in his mind. De bery next day de son go away to de village to buy some tings he want. De fader he come out and watch me at work; he curse and swear as usual; he call me lazy hound and swear he cut de flesh from my back; presently he come quite close and shake him fist in Jake\u0027s face. Dat was a foolish ting to do. So long as he keep bofe him hands on de gun he could say what he like quite safe, but when he got one hand up lebel wid Jake\u0027s nose, dat different ting altogether. Jake throw up his hand and close wid him. De gun tumble down and we wrastle and fight. He strong man for sure, but Jake jest a little stronger. We roll ober and ober on de ground for some minutes; at last Jake git de upper hand and seize de white man by de t\u0027roat, and he pretty quick choke him life out. Den he pick up de gun and wait for de son; when he come back he put a bullet t\u0027rough him. Den he go to de hut and git food and powder and ball and start into de woods. De oder niggers dey take no part in de affair. Dey look on while the skirmish lasts, but not interfere one way or oder. When it ober me ask dem if dey like to go wid me, but dey too afraid ob de redskins; so Jake start by himse\u0027f. Me hab plenty ob practice in de woods and no fear ob meeting redskins, except when dey on de warpath. De woods stretch a bery long way all ober de country, and Jake trabel in dem for nigh t\u0027ree weeks. He shoot deer and manage bery well; see no redskin from the first day to de last; den he come out into de open country again, hundreds ob miles from de place where he kill dat Kentuckian. He leab his gun behind now and trabel for Richmond, where he hear dat de white prisoners was kept. He walk all night and at day sleep in de woods or de plantations, and eat ears ob corn. At last he git to Richmond. Den he gib out dat him massa wanted him to fight on de side ob de English and dat he run away. He go to de prison and offer to work dere. Dey tink him story true, and as he had no massa to claim him dey say he State property, and work widout wages like de oder niggers here; dey all forfeited slaves whose massas had jined de English. Dese people so pore dey can\u0027t afford to pay white man, so dey take Jake as warden, and by good luck dey put him in to carry de dinner to de bery room where Massa Harold was.\" \"And have you the keys to lock us up?\" \"No, massa, de niggers only cook de dinners and sweep de prison and de yard, and do dat kind ob job; de white wardens—dere\u0027s six ob dem—dey hab de keys.\" \"Then how did you manage to get here, Jake?\" \"Dat not bery easy matter, Massa Harold. Most ob de wardens drink like fish; but de head man, him dat keep de keys, he not drink. For some time Jake not see him way, but one night when he lock up de prisoners he take Jake round wid him, and Jake carried de big bunch ob keys—one key to each passage. When he lock up de doors here and hand de key to Jake to put on de bunch agin, Jake pull out a hair ob him head and twist it round de ward ob de key so as to know him agin. Dat night me git a piece ob bread and work him up wid some oil till he quite like putty, den me steal to de chief warden\u0027s room, and dere de keys hang up close to him bed. Jake got no shoes on, and he stole up bery silent. He take down de bunch ob keys and carry dem off. He git to quiet place and strike a light, and search t\u0027rough de keys till he find de one wid de hair round it; den he take a deep impression ob him wid de bread; den he carry back the keys and hang \u0027em up. Jake not allowed to leabe de prison. We jest as much prisoners as de white men, so he not able to go out to git a key made; but in de storeroom dere\u0027s all sorts ob tools, and he git hold ob a fine file; den he look about among de keys in de doors ob all de storerooms and places which wor not kept locked up. At last he find a key jest de right size, and dough de wards were a little different dey was ob de right shape. Jake set to work and filled off de knobs and p\u0027ints which didn\u0027t agree wid de shape in de bread. Dis morning, when you was all out in de yard, me come up quietly and tried de key and found dat it turned de lock quite easy. Wid a fedder and some oil me oil de lock and de key till it turned widout making de least, noise. Den to-night me waited till de sentry come along de corridor, and den Jake slip along and here he is.\" \"Capital, Jake!\" Harold said. \"And now what is the next thing to do? Will it be possible to escape through the prison?\" \"No, Massa Harold, dere am t\u0027ree doors from de prison into de yard and dere\u0027s a sentry outside ob each, and de main guard ob twenty men are down dere, too. No possible to git out ob doors widout de alarm being given.\" \"With the file, Jake, we might cut through the bars.\" \"We might cut t\u0027rough de bars and git down into de courtyard; dat easy enough, massa. Jake could git plenty ob rope from de storeroom, but we hab de oder wall to climb.\" \"You must make a rope-ladder for that, Jake.\" \"What sort ob a ladder dat, massa?\" Harold explained to him how it should be made. \"When you have finished it, Jake, you should twist strips of any sort of stuff, cotton or woolen, round and round each of the wooden steps, so that it will make no noise touching the wall as we climb it. Then we want a grapnel.\" \"Me no able to make dat, massa.\" \"Not a regular grapnel, Jake, but you might manage something which would do.\" \"What sort ob ting?\" Jake asked. Harold sat for some time in thought. \"If the wall were not so high it would be easy enough, Jake, for we could do it by fastening the rope within about three inches of the end of a pole six feet long and three inches thick. That would never pull over the wall, but it is too high to throw the pole over.\" \"Jake could t\u0027row such a stick as dat ober easy enough, massa—no difficulty about dat; but me no see how a stick like dat balance massa\u0027s weight.\" \"It would not balance it, Jake, but the pull would be a side pull and would not bring the stick over the wall. If it were only bamboo it would be heavy enough.\" \"Bery well, Massa Harold; if you say so, dat\u0027s all right. Jake can git de wood easy enough; dere\u0027s plenty ob pieces among de firewood dat would do for us.\" \"Roll it with strips of stuff the same way as the ladder steps, so as to prevent it making a noise when it strikes the wall. In addition to the ladder we shall want a length of rope long enough to go from this window to the ground, and another length of thin rope more than twice the height of the wall.\" \"Bery well, Massa Harold, me understand exactly what\u0027s wanted; but it\u0027ll take two or t\u0027ree days to make de ladder, and me can only work ob a night.\" \"There is no hurry, Jake; do not run any risk of being caught. We must choose a dark and windy night. Bring two files with you, so that we can work together, and some oil.\" \"All right, massa. Now me go.\" \"Shut the door quietly, Jake, and do not forget to lock it behind you,\" Harold said, as Jake stole noiselessly from the cell. A week passed without Jake\u0027s again visiting Harold\u0027s cell. On the seventh night the wind had got up and whistled around the jail, and Harold, expecting that Jake would take advantage of the opportunity, sat down on his bed without undressing, and awaited his coming. It was but half an hour after the door had been locked for the night that it quietly opened again. \"Here me am, sar, wid eberyting dat\u0027s wanted; two files and some oil, de rope-ladder, de short rope for us to slide down, and de long thin rope and de piece ob wood six feet long and thick as de wrist.\" They at once set to work with the files, and in an hour had sawn through two bars, making a hole sufficiently wide for them to pass. The rope was then fastened to a bar, Harold took off his shoes and put them in his pocket and then slid down the rope into the courtyard. With the other rope Jake lowered the ladder and pole to him and then slid down himself. Harold had already tied to the pole, at four inches from one end, a piece of rope some four feet long, so as to form a loop about half that length. The thin rope was put through the loop and drawn until the two ends came together. Noiselessly they stole across the yard until they reached the opposite wall. The night was a very dark one, and although they could make out the outline of the wall above them against the skyline, the sentry-boxes at the corners were invisible. Harold now took hold of the two ends of the rope, and Jake, stepping back a few yards from the wall, threw the pole over it. Then Harold drew upon the rope until there was a check, and he knew that the pole was hard up against the edge of the wall. He tied one end of the rope-ladder to an end of the double cord and then hauled steadily upon the other. The rope running through the loop drew the ladder to the top of the wall. All this was done quickly and without noise. \"Now, Jake, do you go first,\" Harold said. \"I will hold the rope tight below, and do you put part of your weight on it as you go up. When you get to the top, knot it to the loop and sit on the wall until I come up.\" In three minutes they were both on the wall, the ladder was hauled up and dropped on the outside, while the pole was shifted to the inside of the wall; then they descended the ladder and made across the country. \"Which way we go, massa?\" Jake asked. \"I have been thinking it over,\" Harold replied, \"and have decided on making for the James River. We shall be there before morning and can no doubt find a boat. We can guide ourselves by the stars, and when we get into the woods the direction of the wind will be sufficient.\" The distance was about twenty miles, but although accustomed to scouting at night, they would have had difficulty in making their way through the woods by morning had they not struck upon a road leading in the direction in which they wanted to go. Thus it was still some hours before daylight when they reached the James River. They had followed the road all the way, and at the point where it reached the bank there was a village of considerable size, and several fishermen\u0027s boats were moored alongside. Stepping into one of these, they unloosed the head-rope and pushed out into the stream. The boat was provided with a sail. The mast was soon stepped and the sail hoisted. Neither Harold nor Jake had had much experience in boat-sailing, but the wind was with them and the boat ran rapidly down the river, and before daylight they were many miles from their point of starting. The banks of the James River are low and swampy, and few signs of human habitation were seen from the stream. It widened rapidly as they descended and became rougher and rougher. They therefore steered into a sheltered spot behind a sharp bend of the river and anchored. In the locker they found plenty of lines and bait, and, setting to work, had soon half a dozen fine fish at the bottom of the boat. They pulled up the kedge and rowed to shore and soon made a fire, finding flint and steel in the boat. The fish were broiled over the fire upon sticks. The boat was hauled in under some overhanging bushes, and, stretching themselves in the bottom, Harold and Jake were soon fast asleep. The sun was setting when they woke. \"What you going to do, sar?\" Jake asked. \"Are you tinking ob trabeling by land or ob sailing to New York?\" \"Neither, Jake,\" Harold answered. \"I am thinking of sailing down the coast inside the line of keys to Charleston. The water there is comparatively smooth, and as we shall be taken for fishermen it is not likely that we shall be overhauled. We can land occasionally and pick a few ears of corn to eat with our fish, and as there is generally a breeze night and morning, however still and hot the day, we shall be able to do it comfortably. I see that there is an iron plate here which has been used for making a fire and cooking on board, so we will lay in a stock of dry wood before we start.\" The journey was made without any adventure. While the breeze lasted they sailed; when it fell calm they fished, and when they had obtained a sufficient supply for their wants they lay down and slept under the shade of their sail stretched as an awning. Frequently they passed within hail of other fishing-boats, generally manned by negroes. But beyond a few words as to their success, no questions were asked. They generally kept near the shore, and when they saw any larger craft they either hauled the boat up or ran into one of the creeks in which the coast abounds. It was with intense pleasure that at last they saw in the distance the masts of the shipping in Charleston harbor. Two hours later they landed. They fastened the boat to the wharf and made their way into the town unquestioned. As they were walking along the principal street they saw a well-known figure sauntering leisurely toward them. His head was bent down and he did not notice, them until Harold hailed him with a shout of \"Halloo, Peter, old fellow! How goes it?\" Peter, although not easily moved or excited, gave a yell of delight which astonished the passers-by. \"Ah, my boy!\" he exclaimed, \"this is a good sight for my old eyes. Here have I been a-fretting and a-worrying myself for the last three months, and cussing my hard luck that I was not with you in that affair on King\u0027s Mountain. At first, when I heard of it, I says to myself, \u0027The young un got out of it somehow. He aint going to be caught asleep.\u0027 Waal, I kept on hoping and hoping you\u0027d turn up, till at last I couldn\u0027t deceive myself no longer and was forced to conclude that you\u0027d either been rubbed out or taken prisoner. About a month ago we got from the Yankees a list of the names of them they\u0027d captured, and glad I was to see yours among \u0027em. As I thought as how you weren\u0027t likely to be out as long as the war lasted, I was a-thinking of giving it up and going to Montreal and settling down there. It was lonesome like without you, and I missed Jake\u0027s laugh, and altogether things didn\u0027t seem natural like. Jake, I\u0027m glad to see ye. Your name was not in the list, but I thought it likely enough they might have taken you and set you to work, and made no account of ye.\" \"That is just what they did; but he got away after settling his score with his new master, and then made for Richmond, where I was in prison; then he got me loose, and here we are. But it is a long story, and I must tell it you at leisure.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3107/85576.html","bookId":937,"book":{"id":937,"title":"True to the Old Flag","description":"简介： MY DEAR COUSIN: I am leaving next week with my husband for England, where we intend to pass some time visiting his friends. John and I have determined to accept the invitation you gave us last summer for Harold to come and spend a few months with you...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3107","creation":"Aug 1, 2019 12:23:56 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
