{"id":7620,"no":14,"title":"A Pleasant Evening","content":"Et pis, doucett’ment on s’endort. On fait sa carne, on fait sa sorgue. On ronfle, et, comme un tuyan d’orgue. L’tuyan s’met à ronfler pus fort . . . \n \n Aristide Bruant \n Chapter I \n \n As I stepped upon the platform of a Broadway cable-car at Forty-second Street, some body said: \n \n “Hello, Hilton, Jamison’s looking for you.” \n \n “Hello, Curtis,” I replied, “what does Jamison want?” \n \n “He wants to know what you’ve been doing all the week,” said Curtis, hanging desperately to the railing as the car lurched forward; “he says you seem to think that the Manhattan Illustrated Weekly was created for the sole purpose of providing salary and vacations for you.” \n \n “The shifty old tom-cat!” I said, indignantly, “he knows well enough where I’ve been. Vacation! Does he think the State Camp in June is a snap?” \n \n “Oh,” said Curtis, “you’ve been to Peekskill?” \n \n “I should say so,” I replied, my wrath rising as I thought of my assignment. \n \n “Hot?” inquired Curtis, dreamily. \n \n “One hundred and three in the shade,” I answered. “Jamison wanted three full pages and three half pages, all for process work, and a lot of line drawings into the bargain. I could have faked them — I wish I had. I was fool enough to hustle and break my neck to get some honest drawings, and that’s the thanks I get!” \n \n “Did you have a camera?” \n \n “No. I will next time — I’ll waste no more conscientious work on Jamison,” I said sulkily. \n \n “It doesn’t pay,” said Curtis. “When I have military work assigned me, I don’t do the dashing sketch-artist act, you bet; I go to my studio, light my pipe, pull out a lot of old Illustrated London News, select several suitable battle scenes by Caton Woodville — and use ’em too.” \n \n The car shot around the neck-breaking curve at Fourteenth Street. \n \n “Yes,” continued Curtis, as the car stopped in front of the Morton House for a moment, then plunged forward again amid a furious clanging of gongs, “it doesn’t pay to do decent work for the fat-headed men who run the Manhattan Illustrated. They don’t appreciate it.” \n \n “I think the public does,” I said, “but I’m sure Jamison doesn’t. It would serve him right if I did what most of you fellows do — take a lot of Caton Woodville’s and Thulstrup’s drawings, change the uniforms, ‘chic’ a figure or two, and turn in a drawing labelled ‘from life.’ I’m sick of this sort of thing anyway. Almost every day this week I’ve been chasing myself over that tropical camp, or galloping in the wake of those batteries. I’ve got a full page of the ‘camp by moonlight,’ full pages of ‘artillery drill’ and ‘light battery in action,’ and a dozen smaller drawings that cost me more groans and perspiration than Jamison ever knew in all his lymphatic life!” \n \n “Jamison’s got wheels,” said Curtis — “more wheels than there are bicycles in Harlem. He wants you to do a full page by Saturday.” \n \n “A what?” I exclaimed, aghast. \n \n “Yes he does.He was going to send Jim Crawford, but Jim expects to go to California for the winter fair, and you’ve got to do it.” \n \n “What is it?” I demanded savagely. \n \n “The animals in Central Park,” chuckled Curtis. \n \n I was furious. The animals! Indeed! I’d show Jamison that I was entitled to some consideration! This was Thursday; that gave me a day and a half to finish a full-page drawing for the paper, and, after my work at the State Camp I felt that I was entitled to a little rest. Anyway I objected to the subject. I intended to tell Jamison so — I intended to tell him firmly. However, many of the things that we often intended to tell Jamison were never told. He was a peculiar man, fat-faced, thin-lipped, gentle-voiced, mild-mannered, and soft in his movements as a pussy-cat. \n \n Just why our firmness should give way when we were actually in his presence, I have never quite been able to determine. He said very little — so did we, although we often entered his presence with other intentions. \n \n The truth was that the Manhattan Illustrated Weekly was the best paying, best illustrated paper in America, and we young fellows were not anxious to be cast adrift. Jamison’s knowledge of art was probably as extensive as the knowledge of any ‘Art editor’ in the city. Of course that was saying nothing, but the fact merited careful consideration on our part, and we gave it much consideration. \n \n This time, however, I decided to let Jamison know that drawings are not produced by the yard, and that I was neither a floor-walker nor a hand-me-down. I would stand up for my rights; I’d tell old Jamison a few things to set the wheels under his silk hat spinning, and if he attempted any of his pussy-cat ways on me, I’d give him a few plain facts that would curl what hair he had left. \n \n Glowing with a splendid indignation I jumped off the car at the City Hall, followed by Curtis, and a few minutes later entered the office of the Manhattan Illustrated News. \n \n “Mr. Jamison would like to see you, sir,” said one of the compositors as I passed into the long hallway. I threw my drawings on the table and passed a handkerchief over my forehead. \n \n “Mr. Jamison would like to see you, sir,” said a small freckle-faced boy with a smudge of ink on his nose. \n \n “I know it,” I said, and started to remove my gloves. \n \n “Mr. Jamison would like to see you, sir,” said a lank messenger who was carrying a bundle of proofs to the floor below. \n \n “The deuce take Jamison,” I said to myself I started toward the dark passage that leads to the abode of Jamison, running over in my mind the neat and sarcastic speech which I had been composing during the last ten minutes. \n \n Jamison looked up and nodded softly as I entered the room. I forgot my speech. \n \n “Mr. Hilton,” he said, “we want a full page of the Zoo before it is removed to Bronx Park. Saturday afternoon at three o’clock the drawing must be in the engraver’s hands. Did you have a pleasant week in camp?” \n \n “It was hot,” I muttered, furious to find that I could not remember my little speech. \n \n “The weather,” said Jamison, with soft courtesy, “is oppressive everywhere. Are your drawings in, Mr. Hilton?” \n \n “Yes. It was infernally hot and I worked like a nigger —” \n \n “I suppose you were quite overcome. Is that why you took a two days’ trip to the Catskills? I trust the mountain air restored you — but — was it prudent to go to Cranston’s for the cotillion Tuesday? Dancing in such uncomfortable weather is really unwise. Good-morning, Mr. Hilton, remember the engraver should have your drawings on Saturday by three.” \n \n I walked out, half hypnotized, half enraged. Curtis grinned at me as I passed — I could have boxed his ears. \n \n “Why the mischief should I lose my tongue whenever that old tom-cat purrs!” I asked myself as I entered the elevator and was shot down to the first floor. “I’ll not put up with this sort of thing much longer — how in the name of all that’s foxy did he know that I went to the mountains? I suppose he thinks I’m lazy because I don’t wish to be boiled to death. How did he know about the dance at Cranston’s? Old cat!” \n \n The roar and turmoil of machinery and busy men filled my ears as I crossed the avenue and turned into the City Hall Park. \n \n From the staff on the tower the flag drooped in the warm sunshine with scarcely a breeze to lift its crimson bars. Overhead stretched a splendid cloudless sky, deep, deep blue, thrilling, scintillating in the gemmed rays of the sun. \n \n Pigeons wheeled and circled about the roof of the grey Post Office or dropped out of the blue above to flutter around the fountain in the square. \n \n On the steps of the City Hall the unlovely politician lounged, exploring his heavy under jaw with wooden toothpick, twisting his drooping black moustache, or distributing tobacco juice over marble steps and close-clipped grass. \n \n My eyes wandered from these human vermin to the calm scornful face of Nathan Hale, on his pedestal, and then to the grey-coated Park policeman whose occupation was to keep little children from the cool grass. \n \n A young man with thin hands and blue circles under his eyes was slumbering on a bench by the fountain, and the policeman walked over to him and struck him on the soles of his shoes with a short club. \n \n The young man rose mechanically, stared about, dazed by the sun, shivered, and limped away. \n \n I saw him sit down on the steps of the white marble building, and I went over and spoke to him. \n \n He neither looked at me, nor did he notice the coin I offered. \n \n “You’re sick,” I said, “you had better go to the hospital.” \n \n “Where?” he asked vacantly —“I’ve been, but they wouldn’t receive me.” \n \n He stooped and tied the bit of string that held what remained of his shoe to his foot. \n \n “You are French,” I said. \n \n “Yes.” \n \n “Have you no friends? Have you been to the French Consul?” \n \n “The Consul!” he replied; “no, I haven’t been to the French Consul.” \n \n After a moment I said, “You speak like a gentleman.” \n \n He rose to his feet and stood very straight, looking me, for the first time, directly in the eyes. \n \n “Who are you?” I asked abruptly. \n \n “An outcast,” he said, without emotion, and limped off thrusting his hands into his ragged pockets. \n \n “Huh!” said the Park policeman who had come up behind me in time to hear my question and the vagabond’s answer; “don’t you know who that hobo is? — An’ you a newspaper man!” \n \n “Who is he, Cusick?” I demanded, watching the thin shabby figure moving across Broadway toward the river. \n \n “On the level you don’t know, Mr. Hilton?” repeated Cusick, suspiciously. \n \n “No, I don’t; I never before laid eyes on him.” \n \n “Why,” said the sparrow policeman, “that’s ‘Soger Charlie’; — you remember — that French officer what sold secrets to the Dutch Emperor.” \n \n “And was to have been shot? I remember now, four years ago — and he escaped — you mean to say that is the man?” \n \n “Everybody knows it,” sniffed Cusick, “I’d a-thought you newspaper gents would have knowed it first.” \n \n “What was his name?” I asked after a moment’s thought. \n \n “Soger Charlie —” \n \n “I mean his name at home.” \n \n “Oh, some French dago name. No Frenchman will speak to him here; sometimes they curse him and kick him. I guess he’s dyin’ by inches.” \n \n I remembered the case now. Two young French cavalry officers were arrested, charged with selling plans of fortifications and other military secrets to the Germans. On the eve of their conviction, one of them, Heaven only knows how, escaped and turned up in New York. The other was duly shot. The affair had made some noise, because both young men were of good families. It was a painful episode, and I had hastened to forget it. Now that it was recalled to my mind, I remembered the newspaper accounts of the case, but I had forgotten the names of the miserable young men. \n \n “Sold his country,” observed Cusick, watching a group of children out of the corner of his eyes —“you can’t trust no Frenchman nor dagoes nor Dutchmen either. I guess Yankees are about the only white men.” \n \n I looked at the noble face of Nathan Hale and nodded. \n \n “Nothin’ sneaky about us, eh, Mr. Hilton?” \n \n I thought of Benedict Arnold and looked at my boots. \n \n Then the policeman said, “Well, so long, Mr. Hilton,” and went away to frighten a pasty-faced little girl who had climbed upon the railing and was leaning down to sniff the fragrant grass. \n \n “Cheese it, de cop!” cried her shrill-voiced friends, and the whole bevy of small ragamuffins scuttled away across the square. \n \n With a feeling of depression I turned and walked toward Broadway, where the long yellow cable-cars swept up and down, and the din of gongs and the deafening rumble of heavy trucks echoed from the marble walls of the Court House to the granite mass of the Post Office. \n \n Throngs of hurrying busy people passed up town and down town, slim sober-faced clerks, trim cold-eyed brokers, here and there a red-necked politician linking arms with some favourite heeler, here and there a City Hall lawyer, sallow-faced and saturnine. Sometimes a fireman, in his severe blue uniform, passed through the crowd, sometimes a blue-coated policeman, mopping his clipped hair, holding his helmet in his white-gloved hand. There were women too, pale-faced shop girls with pretty eyes, tall blonde girls who might be typewriters and might not, and many, many older women whose business in that part of the city no human being could venture to guess, but who hurried up town and down town, all occupied with something that gave to the whole restless throng a common likeness — the expression of one who hastens toward a hopeless goal. \n \n I knew some of those who passed me. There was little Jocelyn of the Mail and Express; there was Hood, who had more money than he wanted and was going to have less than he wanted when he left Wall Street; there was Colonel Tidmouse of the 45th Infantry, N.G.S.N.Y, probably coming from the office of the Army and Navy Journal, and there was Dick Harding who wrote the best stories of New York life that have been printed. People said his hat no longer fitted —— especially people who also wrote stories of New York life and whose hats threatened to fit as long as they lived. \n \n I looked at the statue of Nathan Hale, then at the human stream that flowed around his pedestal. \n \n “Quand même,” I muttered and walked out into Broadway, signalling to the gripman of an uptown cable-car. \n Chapter ii \n \n I passed into the Park by the Fifth Avenue and 59th Street gate; I could never bring myself to enter it through the gate that is guarded by the hideous pigmy statue of Thorwaldsen. \n \n The afternoon sun poured into the windows of the New Netherlands Hotel, setting every orange-curtained pane a-glitter, and tipping the wings of the bronze dragons with flame. \n \n Gorgeous masses of flowers blazed in the sunshine from the grey terraces of the Savoy, from the high grilled court of the Vanderbilt palace, and from the balconies of the Plaza opposite. \n \n The white marble fa?ade of the Metropolitan Club was a grateful relief in the universal glare, and I kept my eyes on it until I had crossed the dusty street and entered the shade of the trees. \n \n Before I came to the Zoo, I smelled it. Next week it was to be removed to the fresh cool woods and meadows in Bronx Park, far from the stifling air of the city, far from the infernal noise of the Fifth Avenue omnibuses. \n \n A noble stag stared at me from his enclosure among the trees as I passed down the winding asphalt walk. “Never mind, old fellow,” said I, “you will be splashing about in the Bronx River next week and cropping maple shoots to your heart’s content.” \n \n On I went, past herds of staring deer, past great lumbering elk, and moose, and long-faced African antelopes, until I came to the dens of the great carnivora. \n \n The tigers sprawled in the sunshine, blinking and licking their paws; the lions slept in the shade or squatted on their haunches, yawning gravely. A slim panther travelled to and fro behind her barred cage, pausing at times to peer wistfully out into the free sunny world. My heart ached for caged wild things, and I walked on, glancing up now and then to encounter the blank stare of a tiger or the mean shifty eyes of some ill-smelling hyena. \n \n Across the meadow I could see the elephants swaying and swinging their great heads, the sober bison solemnly slobbering over their cuds, the sarcastic countenances of camels, the wicked little zebras, and a lot more animals of the camel and llama tribe, all resembling each other, all equally ridiculous, stupid, deadly uninteresting. \n \n Somewhere behind the old arsenal an eagle was screaming, probably a Yankee eagle; I heard the “rchug! rchug!” of a blowing hippopotamus, the squeal of a falcon, and the snarling yap! of quarrelling wolves. \n \n “A pleasant place for a hot day!” I pondered bitterly, and I thought some things about Jamison that I shall not insert in this volume. But I lighted a cigarette to deaden the aroma from the hyenas, unclasped my sketching block, sharpened my pencil, and fell to work on a family group of hippopotami. \n \n They may have taken me for a photographer, for they all wore smiles as if “welcoming a friend,” and my sketch block presented a series of wide open jaws, behind which shapeless bulky bodies vanished in alarming perspective. \n \n The alligators were easy; they looked to me as though they had not moved since the founding of the Zoo, but I had a bad time with the big bison, who persistently turned his tail to me, looking stolidly around his flank to see how I stood it. So I pretended to be absorbed in the antics of two bear cubs, and the dreary old bison fell into the trap, for I made some good sketches of him and laughed in his face as I closed the book. \n \n There was a bench by the abode of the eagles, and I sat down on it to draw the vultures and condors, motionless as mummies among the piled rocks. Gradually I enlarged the sketch, bringing in the gravel plaza, the steps leading up to Fifth Avenue, the sleepy park policeman in front of the arsenal — and a slim, white-browed girl, dressed in shabby black, who stood silently in the shade of the willow trees. \n \n After a while I found that the sketch, instead of being a study of the eagles, was in reality a composition in which the girl in black occupied the principal point of interest. Unwittingly I had subordinated everything else to her, the brooding vultures, the trees and walks, and the half indicated groups of sun-warmed loungers. \n \n She stood very still, her pallid face bent, her thin white hands loosely clasped before her. \n \n “Rather dejected reverie,” I thought, “probably she’s out of work.” Then I caught a glimpse of a sparkling diamond ring on the slender third finger of her left hand. \n \n “She’ll not starve with such a stone as that about her,” I said to myself, looking curiously at her dark eyes and sensitive mouth. They were both beautiful, eyes and mouth — beautiful, but touched with pain. \n \n After a while I rose and walked back to make a sketch or two of the lions and tigers. I avoided the monkeys — I can’t stand them, and they never seem funny to me, poor dwarfish, degraded caricatures of all that is ignoble in ourselves. \n \n “I’ve enough now,” I thought; “I’ll go home and manufacture a full page that will probably please Jamison.” So I strapped the elastic band around my sketching block, replaced pencil and rubber in my waistcoat pocket, and strolled off toward the Mall to smoke a cigarette in the evening glow before going back to my studio to work until midnight, up to the chin in charcoal grey and Chinese white. \n \n Across the long meadow I could see the roofs of the city faintly looming above the trees. A mist of amethyst, ever deepening, hung low on the horizon, and through it, steeple and dome, roof and tower, and the tall chimneys where thin fillets of smoke curled idly, were transformed into pinnacles of beryl and flaming minarets, swimming in filmy haze. Slowly the enchantment deepened; all that was ugly and shabby and mean had fallen away from the distant city, and now it towered into the evening sky, splendid, gilded, magnificent, purified in the fierce furnace of the setting sun. \n \n The red disk was half hidden now; the tracery of trees, feathery willow and budding birch, darkened against the glow; the fiery rays shot far across the meadow, gilding the dead leaves, staining with soft crimson the dark moist tree trunks around me. \n \n Far across the meadow a shepherd passed in the wake of a huddling flock, his dog at his heels, faint moving blots of grey. \n \n A squirrel sat up on the gravel walk in front of me, ran a few feet, and sat up again, so close that I could see the palpitation of his sleek flanks. \n \n Somewhere in the grass a hidden field insect was rehearsing last summer’s solos; I heard the tap! tap! tat-tat-t-t-tat! of a woodpecker among the branches overhead and the querulous note of a sleepy robin. \n \n The twilight deepened; out of the city the music of bells floated over wood and meadow; faint mellow whistles sounded from the river craft along the north shore, and the distant thunder of a gun announced the close of a June day. \n \n The end of my cigarette began to glimmer with a redder light; shepherd and flock were blotted out in the dusk, and I only knew they were still moving when the sheep bells tinkled faintly. \n \n Then suddenly that strange uneasiness that all have known — that half-awakened sense of having seen it all before, of having been through it all, came over me, and I raised my head and slowly turned. \n \n A figure was seated at my side. My mind was struggling with the instinct to remember. \n \n Something so vague and yet so familiar — something that eluded thought yet challenged it, something — God knows what! troubled me. And now, as I looked, without interest, at the dark figure beside me, an apprehension, totally involuntary, an impatience to understand, came upon me, and I sighed and turned restlessly again to the fading west. \n \n I thought I heard my sigh re-echoed — I scarcely heeded; and in a moment I sighed again, dropping my burned-out cigarette on the gravel beneath my feet. \n \n “Did you speak to me?” said some one in a low voice, so close that I swung around rather sharply. \n \n “No,” I said after a moment’s silence. \n \n It was a woman. I could not see her face clearly, but I saw on her clasped hands, which lay listlessly in her lap, the sparkle of a great diamond. I knew her at once. It did not need a glance at the shabby dress of black, the white face, a pallid spot in the twilight, to tell me that I had her picture in my sketch-book. \n \n “Do — do you mind if I speak to you?” she asked timidly. The hopeless sadness in her voice touched me, and I said: “Why, no, of course not. Can I do anything for you?” \n \n “Yes,” she said, brightening a little, “if you — you only would.” \n \n “I will if I can,” said I, cheerfully; “what is it? Out of ready cash?” \n \n “No, not that,” she said, shrinking back. \n \n I begged her pardon, a little surprised, and withdrew my hand from my change pocket. \n \n “It is only — only that I wish you to take these,”— she drew a thin packet from her breast ——“these two letters.” \n \n “I?” I asked astonished. \n \n “Yes, if you will.” \n \n “But what am I to do with them?” I demanded. \n \n “I can’t tell you; I only know that I must give them to you. Will you take them?” \n \n “Oh, yes, I’ll take them,” I laughed, “am I to read them?” I added to myself, “It’s some clever begging trick.” \n \n “No,” she answered slowly, “you are not to read them; you are to give them to somebody.” \n \n “To whom? Anybody?” \n \n “No, not to anybody. You will know whom to give them to when the time comes. \n \n “Then I am to keep them until further instructions?” \n \n “Your own heart will instruct you,” she said, in a scarcely audible voice. She held the thin packet toward me, and to humor her I took it. It was wet. \n \n “The letters fell into the sea,” she said; “there was a photograph which should have gone with them but the salt water washed it blank. Will you care if I ask you something else?” \n \n “I? Oh, no.” \n \n “Then give me the picture that you made of me to-day.” I laughed again, and demanded how she knew I had drawn her. \n \n “Is it like me?” she said. \n \n “I think it is very like you,” I answered truthfully. “Will you not give it to me?” \n \n Now it was on the tip of my tongue to refuse, but I reflected that I had enough sketches for a full page without that one, so I handed it to her, nodded that she was welcome, and stood up. She rose also, the diamond flashing on her finger. \n \n “You are sure that you are not in want?” I asked, with a tinge of good-natured sarcasm. \n \n “Hark!” she whispered; “listen! — do you hear the bells of the convent!” I looked out into the misty night. \n \n “There are no bells sounding,” I said, “and anyway there are no convent bells here. We are in New York, mademoiselle”— I had noticed her French accent —“we are in Protestant Yankee-land, and the bells that ring are much less mellow than the bells of France.” \n \n I turned pleasantly to say good-night. She was gone. \n Chapter iii \n \n “Have you ever drawn a picture of a corpse?” inquired Jamison next morning as I walked into his private room with a sketch of the proposed full page of the Zoo. \n \n “No, and I don’t want to,” I replied, sullenly. \n \n “Let me see your Central Park page,” said Jamison in his gentle voice, and I displayed it. It was about worthless as an artistic production, but it pleased Jamison, as I knew it would. \n \n “Can you finish it by this afternoon?” he asked, looking up at me with persuasive eyes. \n \n “Oh, I suppose so,” I said, wearily; “anything else, Mr. Jamison?” \n \n “The corpse,” he replied, “I want a sketch by to-morrow — finished.” \n \n “What corpse?” I demanded, controlling my indignation as I met Jamison’s soft eyes. \n \n There was a mute duel of glances. Jamison passed his hand across his forehead with a slight lifting of the eyebrows. \n \n “I shall want it as soon as possible,” he said in his caressing voice. \n \n What I thought was, “Damned purring pussy-cat!” What I said was, “Where is this corpse?” \n \n “In the Morgue — have you read the morning papers? No? Ah — as you very rightly observe you are too busy to read the morning papers. Young men must learn industry first, of course, of course. What you are to do is this: the San Francisco police have sent out an alarm regarding the disappearance of a Miss Tufft — the millionaire’s daughter, you know. To-day a body was brought to the Morgue here in New York, and it has been identified as the missing young lady —— by a diamond ring. Now I am convinced that it isn’t, and I’ll show you why, Mr. Hilton.” \n \n He picked up a pen and made a sketch of a ring on a margin of that morning’s Tribune. \n \n “That is the description of her ring as sent on from San Francisco. You notice the diamond is set in the centre of the ring where the two gold serpents’ tails cross! \n \n “Now the ring on the finger of the woman in the Morgue is like this,” and he rapidly sketched another ring where the diamond rested in the fangs of the two gold serpents. \n \n “That is the difference,” he said in his pleasant, even voice. \n \n “Rings like that are not uncommon,” said I, remembering that I had seen such a ring on the finger of the white-faced girl in the Park the evening before. Then a sudden thought took shape — perhaps that was the girl whose body lay in the Morgue! \n \n “Well,” said Jamison, looking up at me, “what are you thinking about?” \n \n “Nothing,” I answered, but the whole scene was before my eyes, the vultures brooding among the rocks, the shabby black dress, and the pallid face — and the ring, glittering on that slim white hand! \n \n “Nothing,” I repeated, “when shall I go, Mr. Jamison? Do you want a portrait — or what?” \n \n “Portrait — careful drawing of the ring, and — er — a centre piece of the Morgue at night. Might as well give people the horrors while we’re about it.” \n \n “But,” said I, “the policy of this paper —” \n \n “Never mind, Mr. Hilton,” purred Jamison, “I am able to direct the policy of this paper.” \n \n “I don’t doubt you are,” I said angrily. \n \n “I am,” he repeated, undisturbed and smiling; “you see this Tufft case interests society. I am —— er — also interested.” \n \n He held out to me a morning paper and pointed to a heading. \n \n I read: “Miss Tufft Dead! Her Fiancé was Mr. Jamison, the well known Editor.” \n \n “What!” I cried in horrified amazement. But Jamison had left the room, and I heard him chatting and laughing softly with some visitors in the press-room outside. \n \n I flung down the paper and walked out. \n \n “The cold-blooded toad!” I exclaimed again and again; —“making capital out of his fiancée’s disappearance! Well, I— I’m d — nd! I knew he was a bloodless, heartless grip-penny, but I never thought — I never imagined —” Words failed me. \n \n Scarcely conscious of what I did I drew a Herald from my pocket and saw the column entitled: \n \n “Miss Tufft Found! Identified by a Ring. Wild Grief of Mr. Jamison, her Fiancé.” \n \n That was enough. I went out into the street and sat down in City Hall Park. And, as I sat there, a terrible resolution came to me; I would draw that dead girl’s face in such a way that it would chill Jamison’s sluggish blood, I would crowd the black shadows of the Morgue with forms and ghastly faces, and every face should bear something in it of Jamison. Oh, I’d rouse him from his cold snaky apathy! I’d confront him with Death in such an awful form, that, passionless, base, inhuman as he was, he’d shrink from it as he would from a dagger thrust. Of course I’d lose my place, but that did not bother me, for I had decided to resign anyway, not having a taste for the society of human reptiles. And, as I sat there in the sunny park, furious, trying to plan a picture whose sombre horror should leave in his mind an ineffaceable scar, I suddenly thought of the pale black-robed girl in Central Park. Could it be her poor slender body that lay among the shadows of the grim Morgue! If ever brooding despair was stamped on any face, I had seen its print on hers when she spoke to me in the Park and gave me the letters. The letters! I had not thought of them since, but now I drew them from my pocket and looked at the addresses. \n \n “Curious,” I thought, “the letters are still damp; they smell of salt water too.” \n \n I looked at the address again, written in the long fine hand of an educated woman who had been bred in a French convent. Both letters bore the same address, in French: \n \n “Captain d’Yniol. \n \n (Kindness of a Stranger.)” \n \n “Captain d’Yniol,” I repeated aloud —“confound it, I’ve heard that name! Now, where the deuce — where in the name of all that’s queer —” Somebody who had sat down on the bench beside me placed a heavy hand on my shoulder. \n \n It was the Frenchman, “Soger Charlie.” \n \n “You spoke my name,” he said in apathetic tones. \n \n “Your name!” \n \n “Captain d’Yniol,” he repeated; “it is my name.” \n \n I recognized him in spite of the black goggles he was wearing, and, at the same moment, it flashed into my mind that d’Yniol was the name of the traitor who had escaped. Ah, I remembered now! \n \n “I am Captain d’Yniol,” he said again, and I saw his fingers closing on my coat sleeve. \n \n It may have been my involuntary movement of recoil — I don’t know — bur the fellow dropped my coat and sat straight up on the bench. \n \n “I am Captain d’Yniol.” he said for the third rime, “charged with treason and under sentence of death.” \n \n “And innocent!” I muttered, before I was even conscious of having spoken. What was it that wrung those involuntary words from my lips, I shall never know, perhaps — but it was I, not he, who trembled, seized with a strange agitation, and it was I, not he, whose hand was stretched forth impulsively, touching his. \n \n Without a tremor he took my hand, pressed it almost imperceptibly, and dropped it. Then I held both letters toward him, and, as he neither looked at them nor at me, I placed them in his hand. Then he started. \n \n “Read them,” I said, “they are for you.” \n \n “Letters!” he gasped in a voice that sounded like nothing human. \n \n “Yes, they are for you — I know it now —— Letters! — letters directed to me?” \n \n “Can you not see?” I cried. \n \n Then he raised one frail hand and drew the goggles from his eyes, and, as I looked, I saw two tiny white specks exactly in the centre of both pupils. \n \n “Blind!” I faltered. \n \n “I have been unable to read for two years,” he said. \n \n After a moment he placed the tip of one finger on the letters. \n \n “They are wet,” I said; “shall — would you like to have me read them?” For a long time he sat silently in the sunshine, fumbling with his cane, and I watched him without speaking. At last he said, “Read, Monsieur,” and I rook the letters and broke the seals. \n \n The first letter contained a sheet of paper, damp and discoloured, on which a few lines were written: \n \n “My darling, I knew you were innocent —” Here the writing ended, but, in the blur beneath, I read: “Paris shall know — France shall know, for at last I have the proofs and I am coming to find you, my soldier, and to place them in your own dear brave hands. They know, now, at the War Ministry — they have a copy of the traitor’s confession —— but they dare not make it public — they dare not withstand the popular astonishment and rage. Therefore I sail on Monday from Cherbourg by the Green Cross Line, to bring you back to your own again, where you will stand before all the world, without fear, without reproach.” \n \n “Aline.” \n \n “This — this is terrible!” I stammered; “can God live and see such things done!” \n \n But with his thin hand he gripped my arm again, bidding me read the other letter; and I shuddered at the menace in his voice. \n \n Then, with his sightless eyes on me, I drew the other letter from the wet, stained envelope. And before I was aware — before I understood the purport of what I saw, I had read aloud these half effaced lines: \n \n “The Lorient is sinking — an iceberg — mid-ocean — goodbye you are innocent — I love —” \n \n “The Lorient!” I cried; “it was the French steamer that was never heard from — the Lorient of the Green Cross Line! I had forgotten — I—” \n \n The loud crash of a revolver stunned me; my ears rang and ached with it as I shrank back from a ragged dusty figure that collapsed on the bench beside me, shuddered a moment, and tumbled to the asphalt at my feet. \n \n The trampling of the eager hard-eyed crowd, the dust and taint of powder in the hot air, the harsh alarm of the ambulance clattering up Mail Street — these I remember, as I knelt there, helplessly holding the dead man’s hands in mine. \n \n “Soger Charlie,” mused the sparrow policeman, “shot his-self, didn’t he, Mr. Hilton? You seen him, sir — blowed the top of his head off, didn’t he, Mr. Hilton?” \n \n “Soger Charlie,” they repeated, “a French dago what shot his-self;” and the words echoed in my ears long after the ambulance rattled away, and the increasing throng dispersed, sullenly, as a couple of policemen cleared a space around the pool of thick blood on the asphalt. \n \n They wanted me as a witness, and I gave my card to one of the policemen who knew me. The rabble transferred its fascinated stare to me, and I turned away and pushed a path between frightened shop girls and ill-smelling loafers, until I lost myself in the human torrent of Broadway. \n \n The torrent took me with it where it flowed — East? West? — I did not notice nor care, but I passed on through the throng, listless, deadly weary of attempting so solve God’s justice —— striving to understand His purpose — His laws — His judgments which are “true and righteous altogether.” \n Chapter iv \n \n “More to be desired are they than gold, yea, than much fine gold. Sweeter also than honey and the honey-comb!” \n \n I turned sharply toward the speaker who shambled at my elbow. His sunken eyes were dull and lustreless, his bloodless face gleamed pallid as a death mask above the blood-red jersey — the emblem of the soldiers of Christ. \n \n I don’t know why I stopped, lingering, but, as he passed, I said, “Brother, I also was meditating upon God’s wisdom and His testimonies.” \n \n The pale fanatic shot a glance at me, hesitated, and fell into my own pace, walking by my side. \n \n Under the peak of his Salvation Army cap his eyes shone in the shadow with a strange light. \n \n “Tell me more,” I said, sinking my voice below the roar of traffic, the clang! clang! of the cable-cars, and the noise of feet on the worn pavements —“tell me of His testimonies.” \n \n “Moreover by them is Thy servant warned and in keeping of them there is great reward. Who can understand His errors? Cleanse Thou me from secret faults. Keep back Thy servant also from presumptuous sins. Let them not have dominion over me. Then shall I be upright and I shall be innocent from the great transgression. Let the words of my mouth and the meditation of my heart be acceptable in Thy sight — O Lord! My strength and my Redeemer!” \n \n “It is Holy Scripture that you quote,” I said; “I also can read that when I choose. But it cannot clear for me the reasons — it cannot make me understand —” \n \n “What?” he asked, and muttered to himself. \n \n “That, for instance,” I replied, pointing to a cripple, who had been born deaf and dumb and horridly misshapen — a wretched diseased lump on the sidewalk below Sr. Paul’s Churchyard —— a sore-eyed thing that mouthed and mowed and rattled pennies in a tin cup as though the sound of copper could stem the human pack that passed hot on the scent of gold. \n \n Then the man who shambled beside me turned and looked long and earnestly into my eyes. \n \n And after a moment a dull recollection stirred within me — a vague something that seemed like the awakening memory of a past, long, long forgotten, dim, dark, too subtle, too frail, too indefinite —— ah! the old feeling that all men have known — the old strange uneasiness, that useless struggle to remember when and where it all occurred before. \n \n And the man’s head sank on his crimson jersey, and he muttered, muttered to himself of God and love and compassion, until I saw that the fierce heat of the city had touched his brain, and I went away and left him prating of mysteries that none but such as he dare name. \n \n So I passed on through dust and heat; and the hot breath of men touched my cheek and eager eyes looked into mine. Eyes, eyes — that met my own and looked through them, beyond — far beyond to where gold glittered amid the mirage of eternal hope. Gold! It was in the air where the soft sunlight gilded the floating moats, it was under foot in the dust that the sun made gilt, it glimmered from every window pane where the long red beams struck golden sparks above the gasping gold-hunting hordes of Wall Street. \n \n High, high, in the deepening sky the tall buildings towered, and the breeze from the bay lifted the sun-dyed flags of commerce until they waved above the turmoil of the hives below — waved courage and hope and strength to those who lusted after gold. \n \n The sun dipped low behind Castle William as I turned listlessly into the Battery, and the long straight shadows of the trees stretched away over greensward and asphalt walk. \n \n Already the electric lights were glimmering among the foliage althoughthe bay shimmered like polished brass and the topsails of the ships glowed with a deeper hue, where the red sun rays fell athwart the rigging. \n \n Old men tottered along the sea-wall, tapping the asphalt with worn canes, old women crept to and fro in the coming twilight — old women who carried baskets that gaped for charity or bulged with mouldy stuffs — food, clothing? — I could not tell; I did not care to know. \n \n The heavy thunder from the parapets of Castle William died away over the placid bay, the last red arm of the sun shot up out of the sea, and wavered and faded into the sombre tones of the afterglow. Then came the night, timidly at first, touching sky and water with grey fingers, folding the foliage into soft massed shapes, creeping onward, onward, more swiftly now, until colour and form had gone from all the earth and the world was a world of shadows. \n \n And, as I sat there on the dusky sea-wall, gradually the bitter thoughts faded and I looked out into the calm night with something of that peace that comes to all when day is ended. \n \n The death at my very elbow of the poor blind wretch in the Park had left a shock, but now my nerves relaxed their tension and I began to think about it all — about the letters and the strange woman who had given them to me. I wondered where she had found them — whether they really were carried by some vagrant current in to the shore from the wreck of the fated Lorient. \n \n Nothing but these letters had human eyes encountered from the Lorient, although we believed that fire or berg had been her portion; for there had been no storms when the Lorient steamed away from Cherbourg. \n \n And what of the pale-faced girl in black who had given these letters to me, saying that my own heart would teach me where to place them? \n \n I felt in my pockets for the letters where I had thrust them all crumpled and wet. They were there, and I decided to turn them over to the police. Then I thought of Cusick and the City Hall Park and these set my mind running on Jamison and my own work — ah! I had forgotten that —— I had forgotten that I had sworn to stir Jamison’s cold, sluggish blood! Trading on his fiancée’s reported suicide — or murder! True, he had told me that he was satisfied that the body at the Morgue was not Miss Tufft’s because the ring did not correspond with his fiancée’s ring. But what sort of a man was that! — to go crawling and nosing about morgues and graves for a full-page illustration which might sell a few extra thousand papers. I had never known he was such a man. It was strange too — for that was not the sort of illustration that the Weekly used; it was against all precedent —— against the whole policy of the paper. He would lose a hundred subscribers where he would gain one by such work. \n \n “The callous brute!” I muttered to myself, “I’ll wake him up — I’ll —” \n \n I sat straight up on the bench and looked steadily at a figure which was moving toward me under the spluttering electric light. \n \n It was the woman I had met in the Park. \n \n She came straight up to me, her pale face gleaming like marble in the dark, her slim hands outstretched. \n \n “I have been looking for you all day — all day,” she said, in the same low thrilling tones — “I want the letters back; have you them here?” \n \n “Yes,” I said, “I have them here — take them in Heaven’s name; they have done enough evil for one day!” \n \n She took the letters from my hand; I saw the ring, made of the double serpents, flashing on her slim finger, and I stepped closer, and looked her in the eyes. \n \n “Who are you?” I asked. \n \n “I? My name is of no importance to you,” she answered. \n \n “You are right,” I said, “I do not care to know your name. That ring of yours —” \n \n “What of my ring?” she murmured. \n \n “Nothing — a dead woman lying in the Morgue wears such a ring. Do you know what your letters have done? No? Well I read them to a miserable wretch and he blew his brains out!” \n \n “You read them to a man!” \n \n “I did. He killed himself.” \n \n “Who was that man?” \n \n “Captain d’Yniol —” \n \n With something between a sob and a laugh she seized my hand and covered it with kisses, and I, astonished and angry, pulled my hand away from her cold lips and sat down on the bench. \n \n “You needn’t thank me,” I said sharply; “if I had known that — but no matter. Perhaps after all the poor devil is better off somewhere in other regions with his sweetheart who was drowned —— yes, I imagine he is. He was blind and ill — and broken-hearted.” \n \n “Blind?” she asked gently. \n \n “Yes. Did you know him?” \n \n “I knew him.” \n \n “And his sweetheart, Aline?” \n \n “Aline,” she repeated softly — “she is dead. I come to thank you in her name.” \n \n “For what? — for his death?” \n \n “Ah, yes, for that.” \n \n “Where did you get those letters?” I asked her, suddenly. \n \n She did not answer, but stood fingering the wet letters. \n \n Before I could speak again she moved away into the shadows of the trees, lightly, silently, and far down the dark walk I saw her diamond flashing. \n \n Grimly brooding, I rose and passed through the Battery to the steps of the Elevated Road. \n \n These I climbed, bought my ticket, and stepped out to the damp platform. When a train came I crowded in with the rest, still pondering on my vengeance, feeling and believing that I was to scourge the conscience of the man who speculated on death. \n \n And at last the train stopped at 28th Street, and I hurried out and down the steps and away to the Morgue. \n \n When I entered the Morgue, Skelton, the keeper, was standing before a slab that glistened faintly under the wretched gas jets. He heard my footsteps, and turned around to see who was coming. Then he nodded, saying: \n \n “Mr. Hilton, just take a look at this here stiff — I’ll be back in a moment —— this is the one that all the papers take to be Miss Tufft — but they’re all off, because this stiff has been here now for two weeks.” \n \n I drew out my sketching-block and pencils. \n \n “Which is it, Skelton?” I asked, fumbling for my rubber. \n \n “This one, Mr. Hilton, the girl what’s smilin’. Picked up off Sandy Hook, too. Looks as if she was asleep, eh?” \n \n “What’s she got in her hand — clenched tight? Oh — a letter. Turn up the gas, Skelton, I want to see her face.” \n \n The old man turned the gas jet, and the flame blazed and whistled in the damp, fetid air. Then suddenly my eyes fell on the dead. \n \n Rigid, scarcely breathing, I stared at the ring, made of two twisted serpents set with a great diamond — I saw the wet letters crushed in her slender hand — I looked, and — God help me! — I looked upon the dead face of the girl with whom I had been speaking on the Battery! \n \n “Dead for a month at least,” said Skelton, calmly. \n \n Then, as I felt my senses leaving me, I screamed out, and at the same instant somebody from behind seized my shoulder and shook me savagely —— shook me until I opened my eyes again and gasped and coughed. \n \n “Now then, young feller!” said a Park policeman bending over me, “if you go to sleep on a bench, somebody’ll lift your watch!” \n \n I turned, rubbing my eyes desperately. \n \n Then it was all a dream — and no shrinking girl had come to me with damp letters — I had not gone to the office — there was no such person as Miss Tufft — Jamison was not an unfeeling villain — no, indeed! — he treated us all much better than we deserved, and he was kind and generous too. And the ghastly suicide! Thank God that also was a myth — and the Morgue and the Battery at night where that pale-faced girl had — ugh! \n \n I felt for my sketch-block, found it; turned the pages of all the animals that I had sketched, the hippopotami, the buffalo, the tigers — ah! where was that sketch in which I had made the woman in shabby black the principal figure, with the brooding vultures all around and the crowd in the sunshine —? It was gone. \n \n I hunted everywhere, in every pocket. It was gone. \n \n At last I rose and moved along the narrow asphalt path in the falling twilight. \n \n And as I turned into the broader walk, I was aware of a group, a policeman holding a lantern, some gardeners, and a knot of loungers gathered about something — a dark mass on the ground. \n \n “Found ’em just so,” one of the gardeners was saying, “better not touch ’em until the coroner comes.” \n \n The policeman shifted his bull’s-eye a little; the rays fell on two faces, on two bodies, half supported against a park bench. On the finger of the girl glittered a splendid diamond, set between the fangs of two gold serpents. The man had shot himself; he clasped two wet letters in his hand. The girl’s clothing and hair were wringing wet, and her face was the face of a drowned person. \n \n “Well, sir,” said the policeman, looking at me; “you seem to know these two people — by your looks —” \n \n “I never saw them before,” I gasped, and walked on, trembling in every nerve. \n \n For among the folds of her shabby black dress I had noticed the end of a paper — my sketch that I had missed! \n \n \n","sourceLink":"http://novel.tingroom.com/lizhi/1023/31306.html","bookId":248,"book":{"id":248,"title":"The Maker of Moons","description":"简介： The Maker of Moons by Robert W. Chambers...","cover":"https://cunovel.com/defaultCover.png","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/1023","creation":"Aug 1, 2019 12:18:27 AM","modification":"Aug 1, 2019 12:18:27 AM"}}
