{"id":41392,"no":28,"title":"CHAPTER XXVIII. LOVEL V. MURRAY AND ANOTHER.","content":"Monday, the 9th of November, was the day set down for the trial of the case which had assumed the name of \"Lovel versus Murray and Another.\" This denomination had been adopted many months ago, when it had been held to be practicable by the Lovel party to prove that the lady who was now always called the Countess, was not entitled to bear the name of Lovel, but was simply Josephine Murray, and her daughter simply Anna Murray. Had there been another wife alive when the mother was married that name and that name only could have been hers, whether she had been the victim of the old Earl\u0027s fraud,—or had herself been a party to it. The reader will have understood that as the case went on the opinions of those who acted for the young Earl, and more especially the opinion of the young Earl himself, had been changed. Prompted to do so by various motives, they, who had undertaken to prove that the Countess was no Countess, had freely accorded to her her title, and had themselves entertained her daughter with all due acknowledgment of rank and birth. Nevertheless the name of the case remained and had become common in people\u0027s mouths. The very persons who would always speak of the Countess Lovel spoke also very familiarly of the coming trial in \"Lovel v. Murray,\" and now the 9th of November had come round and the case of \"Lovel v. Murray and Another\" was to be tried. The nature of the case was this. The two ladies, mother and daughter, had claimed the personal property of the late lord as his widow and daughter. Against that claim Earl Lovel made his claim, as heir-at-law, alleging that there was no widow, and no legitimate child. The case had become infinitely complicated by the alleged existence of the first wife,—in which case she as widow would have inherited. But still the case went on as Lovel v. Murray,—the Lovel so named being the Earl, and not the alleged Italian widow. \\n\\n \\n\\n Such being the question presumably at issue, it became the duty of the Solicitor-General to open the pleadings. In the ordinary course of proceeding it would have been his task to begin by explaining the state of the family, and by assuming that he could prove the former marriage and the existence of the former wife at the time of the latter marriage. His evidence would have been subject to cross-examination, and then another counter-statement would have been made on behalf of the Countess, and her witnesses would have been brought forward. When all this had been done the judge would have charged the jury, and with the jury would have rested the decision. This would have taken many days, and all the joys and sorrows, all the mingled hopes and anxieties of a long trial had been expected. Bets had been freely made, odds being given at first on behalf of Lord Lovel, and afterwards odds on behalf of the Countess. Interest had been made to get places in the court, and the clubs had resounded now with this fact and now with that which had just been brought home from Sicily as certain. Then had come suddenly upon the world the tidings that there would absolutely be no trial, that the great case of \"Lovel v. Murray and Another\" was to be set at rest for ever by the marriage of \"Lovel\" with \"Another,\" and by the acceptance by \"Lovel\" of \"Murray\" as his mother-in-law. But the quidnuncs would not accept this solution. No doubt Lord Lovel might marry the second party in the defence, and it was admitted on all hands that he probably would do so;—but that would not stop the case. If there were an Italian widow living, that widow was the heir to the property. Another Lovel would take the place of Lord Lovel,—and the cause of Lovel v. Murray must still be continued. The first marriage could not be annulled, simply by the fact that it would suit the young Earl that it should be annulled. Then, while this dispute was in progress, it was told at all the clubs that there was to be no marriage,—that the girl had got herself engaged to a tailor, and that the tailor\u0027s mastery over her was so strong that she did not dare to shake him off. Dreadful things were told about the tailor and poor Lady Anna. There had been a secret marriage; there was going to be a child;—the latter fact was known as a certain fact to a great many men at the clubs;—the tailor had made everything safe in twenty different ways. He was powerful over the girl equally by love, by fear, and by written bond. The Countess had repelled her daughter from her house by turning her out into the street by night, and had threatened both murder and suicide. Half the fortune had been offered to the tailor, in vain. The romance of the story had increased greatly during the last few days preceding the trial,—but it was admitted by all that the trial as a trial would be nothing. There would probably be simply an adjournment. \\n\\n \\n\\n It would be hard to say how the story of the tailor leaked out, and became at last public and notorious. It had been agreed among all the lawyers that it should be kept secret,—but it may perhaps have been from some one attached to them that it was first told abroad. No doubt all Norton and Flick knew it, and all Goffe and Goffe. Mr. Mainsail and his clerk, Mr. Hardy and his clerk, Serjeant Bluestone and his clerk, all knew it; but they had all promised secrecy. The clerk of the Solicitor-General was of course beyond suspicion. The two Miss Bluestones had known the story, but they had solemnly undertaken to be silent as the grave. Mrs. Bluestone was a lady with most intimately confidential friends,—but she was sworn to secrecy. It might have come from Sarah, the lady\u0027s-maid, whom the Countess had unfortunately attached to her daughter when the first gleam of prosperity had come upon them. \\n\\n \\n\\n Among the last who heard the story of the tailor,—the last of any who professed the slightest interest in the events of the Lovel family,—were the Lovels of Yoxham. The Earl had told them nothing. In answer to his aunt\u0027s letters, and then in answer to a very urgent appeal from his uncle, the young nobleman had sent only the most curt and most ambiguous replies. When there was really something to tell he would tell everything, but at present he could only say that he hoped that everything would be well. That had been the extent of the information given by the Earl to his relations, and the rector had waxed wrathful. Nor was his wrath lessened, or the sorrow of the two aunts mitigated, when the truth reached them by the mouth of that very Lady Fitzwarren who had been made to walk out of the room after—Anna Murray, as Lady Fitzwarren persisted in calling the \"young person\" after she had heard the story of the tailor. She told the story at Yoxham parsonage to the two aunts, and brought with her a printed paragraph from a newspaper to prove the truth of it. As it is necessary that we should now hurry into the court to hear what the Solicitor-General had to say about the case, we cannot stop to sympathize with the grief of the Lovels at Yoxham. We may, however, pause for a moment to tell the burden of the poor rector\u0027s song for that evening. \"I knew how it would be from the beginning. I told you so. I was sure of it. But nobody would believe me.\" \\n\\n \\n\\n The Court of Queen\u0027s Bench at Westminster was crowded on the 9th of November. The case was to be heard before the Lord Chief Justice, and it was known that at any rate Sir William Patterson would have something to tell. If nothing else came of it, the telling of that story would be worth the hearing. All the preliminaries of the trial went on, as though every one believed that it was to be carried through to the bitter end,—as though evidence were to be adduced and rebutted, and further contradicted by other evidence, which would again be rebutted with that pleasing animosity between rival lawyers, which is so gratifying to the outside world, and apparently to themselves also. The jurors were sworn in,—a special jury,—and long was the time taken, and many the threats made by the Chief Justice, before twelve gentlemen would consent to go into the box. Crowds were round the doors of the court, of which every individual man would have paid largely for standing-room to hear the trial; but when they were wanted for use, men would not come forward to accept a seat, with all that honour which belongs to a special juryman. And yet it was supposed that at last there would be no question to submit to a jury. \\n\\n \\n\\n About noon the Solicitor began his statement. He was full of smiles and nods and pleasant talk, gestures indicative of a man who had a piece of work before him in which he could take delight. It is always satisfactory to see the assurance of a cock crowing in his own farm-yard, and to admire his easy familiarity with things that are awful to a stranger bird. If you, O reader, or I were bound to stand up in that court, dressed in wig and gown, and to tell a story that would take six hours in the telling, the one or the other of us knowing it to be his special duty so to tell it that judge, and counsellors, and jury, should all catch clearly every point that was to be made,—how ill would that story be told, how would those points escape the memory of the teller, and never come near the intellect of the hearers! And how would the knowledge that it would be so, confuse your tongue or mine,—and make exquisitely miserable that moment of rising before the audience! But our Solicitor-General rose to his legs a happy man, with all that grace of motion, that easy slowness, that unassumed confidence which belongs to the ordinary doings of our familiar life. Surely he must have known that he looked well in his wig and gown, as with low voice and bent neck, with only half-suppressed laughter, he whispered into the ears of the gentleman who sat next to him some pleasant joke that had just occurred to him. He could do that, though the eyes of all the court were upon him; so great was the man! And then he began with a sweet low voice, almost modest in its tones. For a few moments it might have been thought that some young woman was addressing the court, so gentle, so dulcet were the tones. \\n\\n \\n\\n \"My lord, it is my intention on this occasion to do that which an advocate can seldom do,—to make a clean breast of it, to tell the court and the jury all that I know of this case, all that I think of it, and all that I believe,—and in short to state a case as much in the interest of my opponents as of my clients. The story with which I must occupy the time of the court, I fear, for the whole remainder of the day, with reference to the Lovel family, is replete with marvels and romance. I shall tell you of great crimes and of singular virtues, of sorrows that have been endured and conquered, and of hopes that have been nearly realised; but the noble client on whose behalf I am here called upon to address you, is not in any manner the hero of this story. His heroism will be shown to consist in this,—unless I mar the story in telling it,—that he is only anxious to establish the truth, whether that truth be for him or against him. We have now to deal with an ancient and noble family, of which my client, the present Earl Lovel, is at this time the head and chief. On the question now before us depends the possession of immense wealth. Should this trial be carried to its natural conclusion it will be for you to decide whether this wealth belongs to him as the heir-at-law of the late Earl, or whether there was left some nearer heir when that Earl died, whose rightful claim would bar that of my client. But there is more to be tried than this,—and on that more depends the right of two ladies to bear the name of Lovel. Such right, or the absence of such right, would in this country of itself be sufficient to justify, nay, to render absolutely necessary, some trial before a jury in any case of well-founded doubt. Our titles of honour bear so high a value among us, are so justly regarded as the outward emblem of splendour and noble conduct, are recognised so universally as passports to all society, that we are naturally prone to watch their assumption with a caution most exact and scrupulous. When the demand for such honour is made on behalf of a man it generally includes the claim to some parliamentary privilege, the right to which has to be decided not by a jury, but by the body to which that privilege belongs. The claim to a peerage must be tried before the House of Lords,—if made by a woman as by a man, because the son of the heiress would be a peer of Parliament. In the case with which we are now concerned no such right is in question. The lady who claims to be the Countess Lovel, and her daughter who claims to be Lady Anna Lovel, make no demand which renders necessary other decision than that of a jury. It is as though any female commoner in the land claimed to have been the wife of an alleged husband. But not the less is the claim made to a great and a noble name; and as a grave doubt has been thrown upon the justice of the demand made by these ladies, it has become the duty of my client as the head of the Lovels, as being himself, without any doubt, the Earl Lovel of the day, to investigate the claim made, and to see that no false pretenders are allowed to wear the highly prized honours of his family. Independently of the great property which is at stake, the nature of which it will be my duty to explain to you, the question at issue whether the elder lady be or be not Countess Lovel, and whether the younger lady be or be not Lady Anna Lovel, has demanded the investigation which could not adequately have been made without this judicial array. I will now state frankly to you our belief that these two ladies are fully entitled to the names which they claim to bear; and I will add to that statement a stronger assurance of my own personal conviction and that of my client that they themselves are fully assured of the truth and justice of their demand. I think it right also to let you know that since these inquiries were first commenced, since the day for this trial was fixed, the younger of these ladies has been residing with the uncle of my client, under the same roof with my client, as an honoured and most welcome guest, and there, in the face of the whole country, has received that appellation of nobility from all the assembled members of my client\u0027s family, to dispute which I apparently now stand before you on that client\u0027s behalf.\" The rector of Yoxham, who was in court, shook his head vehemently when the statement was made that Lady Anna had been his welcome guest; but nobody was then regarding the rector of Yoxham, and he shook his head in vain. \\n\\n \\n\\n \"You will at once ask why, if this be so, should the trial be continued. \u0027As all is thus conceded,\u0027 you will say, \u0027that these two ladies claim, whom in your indictment you have misnamed Murray, why not, in God\u0027s name, give them their privileges, and the wealth which should appertain to them, and release them from the persecution of judicial proceedings?\u0027 In the first place I must answer that neither my belief, nor that of my friends who are acting with me, nor even that of my noble client himself, is sufficient to justify us in abstaining from seeking a decision which shall be final as against further claimants. If the young Earl should die, then would there be another Earl, and that other Earl might also say, with grounds as just as those on which we have acted, that the lady, whom I shall henceforward call the Countess Lovel, is no Countess. We think that she is,—but it will be for you to decide whether she is or is not, after hearing the evidence which will, no doubt, be adduced of her marriage,—and any evidence to the contrary which other parties may bring before you. We shall adduce no evidence to the contrary, nor do I think it probable that we shall ask a single question to shake that with which my learned friend opposite is no doubt prepared. In fact, there is no reason why my learned friend and I should not sit together, having our briefs and our evidence in common. And then, as the singular facts of this story become clear to you,—as I trust that I may be able to make them clear,—you will learn that there are other interests at stake beyond those of my client and of the two ladies who appear here as his opponents. Two statements have been made tending to invalidate the rights of Countess Lovel,—both having originated with one who appears to have been the basest and blackest human being with whose iniquities my experience as a lawyer has made me conversant. I speak of the late Earl. It was asserted by him, almost from the date of his marriage with the lady who is now his widow,—falsely stated, as I myself do not doubt,—that when he married her he had a former wife living. But it is, I understand, capable of absolute proof that he also stated that this former wife died soon after that second marriage,—which in such event would have been but a mock marriage. Were such the truth,—should you come to the belief that the late Earl spoke truth in so saying,—the whole property at issue would become the undisputed possession of my client. The late Earl died intestate, the will which he did leave having been already set aside by my client as having been made when the Earl was mad. The real wife, according to this story, would be dead. The second wife, according to this story, would be no wife,—and no widow. The daughter, according to this story, would be no daughter in the eye of the law,—would, at any rate, be no heiress. The Earl would be the undisputed heir to the personal property, as he is to the real property and to the title. But we disbelieve this story utterly,—we intend to offer no evidence to show that the first wife,—for there was such a wife,—was living when the second marriage was contracted. We have no such evidence, and believe that none such can be found. Then that recreant nobleman, in whose breast there was no touch of nobility, in whose heart was no spark of mercy, made a second statement,—to this effect—that his first wife had not died at all. His reason for this it is hardly for us to seek. He may have done so, as affording a reason why he should not go through a second marriage ceremony with the lady whom he had so ill used. But that he did make this statement is certain,—and it is also certain that he allowed an income to a certain woman as though to a wife, that he allowed her to be called the Countess, though he was then living with another Italian woman; and it is also certain that this woman is still living,—or at least that she was living some week or two ago. We believe her to have been an elder sister of her who was the first wife, and whose death occurred before the second marriage. Should it be proved that this living woman was the legitimate wife of the late Earl, not only would the right be barred of those two English ladies to whom all our sympathies are now given, but no portion of the property in dispute would go either to them or to my client. I am told that before his lordship, the Chief Justice, shall have left the case in your hands, an application will be made to the court on behalf of that living lady. I do not know how that may be, but I am so informed. If such application be made,—if there be any attempt to prove that she should inherit as widow,—then will my client again contest the case. We believe that the Countess Lovel, the English Countess, is the widow, and that Lady Anna Lovel is Lady Anna Lovel, and is the heiress. Against them we will not struggle. As was our bounden duty, we have sent not once only, but twice and thrice, to Italy and to Sicily in search of evidence which, if true, would prove that the English Countess was no Countess. We have failed, and have no evidence which we think it right to ask a jury to believe. We think that a mass of falsehood has been heaped together among various persons in a remote part of a foreign country, with the view of obtaining money, all of which was grounded on the previous falsehoods of the late Earl. We will not use these falsehoods with the object of disputing a right in the justice of which we have ourselves the strongest confidence. We withdraw from any such attempt. \\n\\n \\n\\n \"But as yet I have only given you the preliminaries of my story.\" He had, in truth, told his story. He had, at least, told all of it that it will import that the reader should hear. He, indeed,—unfortunate one,—will have heard the most of that story twice or thrice before. But the audience in the Court of Queen\u0027s Bench still listened with breathless attention, while, under this new head of his story he told every detail again with much greater length than he had done in the prelude which has been here given. He stated the facts of the Cumberland marriage, apologizing to his learned friend the Serjeant for taking, as he said, the very words out of his learned friend\u0027s mouth. He expatiated with an eloquence that was as vehement as it was touching on the demoniacal schemes of that wicked Earl, to whom, during the whole of his fiendish life, women had been a prey. He repudiated, with a scorn that was almost terrible in its wrath, the idea that Josephine Murray had gone to the Earl\u0027s house with the name of wife, knowing that she was, in fact, but a mistress. She herself was in court, thickly veiled, under the care of one of the Goffes, having been summoned there as a necessary witness, and could not control her emotion as she listened to the words of warm eulogy with which the adverse counsel told the history of her life. It seemed to her then that justice was at last being done to her. Then the Solicitor-General reverted again to the two Italian women,—the Sicilian sisters, as he called them,—and at much length gave his reasons for discrediting the evidence which he himself had sought, that he might use it with the object of establishing the claim of his client. And lastly, he described the nature of the possessions which had been amassed by the late Earl, who, black with covetousness as he was with every other sin, had so manipulated his property that almost the whole of it had become personal, and was thus inheritable by a female heiress. He knew, he said, that he was somewhat irregular in alluding to facts,—or to fiction, if any one should call it fiction,—which he did not intend to prove, or to attempt to prove; but there was something, he said, beyond the common in the aspect which this case had taken, something in itself so irregular, that he thought he might perhaps be held to be excused in what he had done. \"For the sake of the whole Lovel family, for the sake of these two most interesting ladies, who have been subjected, during a long period of years, to most undeserved calamities, we are anxious to establish the truth. I have told you what we believe to be the truth, and as that in no single detail militates against the case as it will be put forward by my learned friends opposite, we have no evidence to offer. We are content to accept the marriage of the widowed Countess as a marriage in every respect legal and binding.\" So saying the Solicitor-General sat down. \\n\\n \\n\\n It was then past five o\u0027clock, and the court, as a matter of course, was adjourned, but it was adjourned by consent to the Wednesday, instead of to the following day, in order that there might be due consideration given to the nature of the proceedings that must follow. As the thing stood at present it seemed that there need be no further plea of \"Lovel v. Murray and Another.\" It had been granted that Murray was not Murray, but Lovel; yet it was thought that something further would be done. \\n\\n \\n\\n It had all been very pretty; but yet there had been a feeling of disappointment throughout the audience. Not a word had been said as to that part of the whole case which was supposed to be the most romantic. Not a word had been said about the tailor. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2734/75299.html","bookId":1397,"book":{"id":1397,"title":"Lady Anna","description":"简介： Women have often been hardly used by men, but perhaps no harder usage, no fiercer cruelty was ever experienced by a woman than that which fell to the lot of Josephine Murray from the hands of Earl Lovel, to whom she was married in the parish church o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2734","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
