{"id":41402,"no":38,"title":"CHAPTER XXXVIII. LADY ANNA\u0027S BEDSIDE.","content":"All December went by, and the neighbours in the houses round spent each his merry Christmas; and the snow and frost of January passed over them, and February had come and nearly gone, before the doctors dared to say that Lady Anna Lovel\u0027s life was not still in danger. During this long period the world had known all about her illness,—as it did know, or pretended to know, the whole history of her life. The world had been informed that she was dying, and had, upon the whole, been really very sorry for her. She had interested the world, and the world had heard much of her youth and beauty,—of the romance too of her story, of her fidelity to the tailor, and of her persecutions. During these months of her illness the world was disposed to think that the tailor was a fine fellow, and that he ought to be taken by the hand. He had money now, and it was thought that it would be a good thing to bring him into some club. There was a very strong feeling at the Beaufort that if he were properly proposed and seconded he would be elected,—not because he was going to marry an heiress, but because he was losing the heiress whom he was to have married. If the girl died, then Lord Lovel himself might bring him forward at the Beaufort. Of all this Daniel himself knew nothing; but he heard, as all the world heard, that Lady Anna was on her deathbed. \n \n When the news first reached him,—after a fashion that seemed to him to be hardly worthy of credit,—he called at the house in Keppel Street and asked the question. Yes; Lady Anna was very ill; but, as it happened, Sarah the lady\u0027s-maid opened the door, and Sarah remembered the tailor. She had seen him when he was admitted to her young mistress, and knew enough of the story to be aware that he should be snubbed. Her first answer was given before she had bethought herself; then she snubbed him, and told no one but the Countess of his visit. After that Daniel went to one of the doctors, and waited at his door with patience till he could be seen. The unhappy man told his story plainly. He was Daniel Thwaite, late a tailor, the man from Keswick, to whom Lady Anna Lovel was engaged. In charity and loving kindness, would the doctor tell him of the state of his beloved one? The doctor took him by the hand and asked him in, and did tell him. His beloved one was then on the very point of death. Whereupon Daniel wrote to the Countess in humble strains, himself taking the letter, and waiting without in the street for any answer that might be vouchsafed. If it was, as he was told, that his beloved was dying, might he be allowed to stand once at her bedside and kiss her hand? In about an hour an answer was brought to him at the area gate. It consisted of his own letter, opened, and returned to him without a word. He went away too sad to curse, but he declared to himself that such cruelty in a woman\u0027s bosom could exist only in the bosom of a countess. \n \n But as others heard early in February that Lady Anna was like to recover, so did Daniel Thwaite. Indeed, his authority was better than that which reached the clubs, for the doctor still stood his friend. Could the doctor take a message from him to Lady Anna;—but one word? No;—the doctor could take no message. That he would not do. But he did not object to give to the lover a bulletin of the health of his sweetheart. In this way Daniel knew sooner than most others when the change took place in the condition of his beloved one. \n \n Lady Anna would be of age in May, and the plan of her betrothed was as follows. He would do nothing till that time, and then he would call upon her to allow their banns to be published in Bloomsbury Church after the manner of the Church of England. He himself had taken lodgings in Great Russell Street, thinking that his object might be aided by living in the same parish. If, as was probable, he would not be allowed to approach Lady Anna either in person, or by letter, then he would have recourse to the law, and would allege that the young lady was unduly kept a prisoner in custody. He was told that such complaint would be as idle wind, coming from him,—that no allegation of that kind could obtain any redress unless it came from the young lady herself; but he flattered himself that he could so make it that the young lady would at any rate obtain thereby the privilege of speaking for herself. Let some one ask her what were her wishes and he would be prepared to abide by her expression of them. \n \n In the meantime Lord Lovel also had been anxious;—but his anxiety had been met in a very different fashion. For many days the Countess saw him daily, so that there grew up between them a close intimacy. When it was believed that the girl would die,—believed with that sad assurance which made those who were concerned speak of her death almost as a certainty, the Countess, sitting alone with the young Earl, had told him that all would be his if the girl left them. He had muttered something as to there being no reason for that. \"Who else should have it?\" said the Countess. \"Where should it go? Your people, Lovel, have not understood me. It is for the family that I have been fighting, fighting, fighting,—and never ceasing. Though you have been my adversary,—it has been all for the Lovels. If she goes,—it shall be yours at once. There is no one knows how little I care for wealth myself.\" Then the girl had become better, and the Countess again began her plots, and her plans, and her strategy. She would take the girl abroad in May, in April if it might be possible. They would go,—not to Rome then, but to the south of France, and, as the weather became too warm for them, on to Switzerland and the Tyrol. Would he, Lord Lovel, follow them? Would he follow them and be constant in his suit, even though the frantic girl should still talk of her tailor lover? If he would do so, as far as money was concerned, all should be in common with them. For what was the money wanted but that the Lovels might be great and noble and splendid? He said that he would do so. He also loved the girl,—thought at least during the tenderness created by her illness that he loved her with all his heart. He sat hour after hour with the Countess in Keppel Street,—sometimes seeing the girl as she lay unconscious, or feigning that she was so; till at last he was daily at her bedside. \"You had better not talk to him, Anna,\" her mother would say, \"but of course he is anxious to see you.\" Then the Earl would kiss her hand, and in her mother\u0027s presence she had not the courage,—perhaps she had not the strength,—to withdraw it. In these days the Countess was not cruelly stern as she had been. Bedside nursing hardly admits of such cruelty of manner. But she never spoke to her child with little tender endearing words, never embraced her,—but was to her a careful nurse rather than a loving mother. \n \n Then by degrees the girl got better, and was able to talk. \"Mamma,\" she said one day, \"won\u0027t you sit by me?\" \n \n \"No, my dear; you should not be encouraged to talk.\" \n \n \"Sit by me, and let me hold your hand.\" For a moment the Countess gave way, and sat by her daughter, allowing her hand to remain pressed beneath the bedclothes;—but she rose abruptly, remembering her grievance, remembering that it would be better that her child should die, should die broken-hearted by unrelenting cruelty, than be encouraged to think it possible that she should do as she desired. So she rose abruptly and left the bedside without a word. \n \n \"Mamma,\" said Lady Anna; \"will Lord Lovel be here to-day?\" \n \n \"I suppose he will be here.\" \n \n \"Will you let me speak to him for a minute?\" \n \n \"Surely you may speak to him.\" \n \n \"I am strong now, mamma, and I think that I shall be well again some day. I have so often wished that I might die.\" \n \n \"You had better not talk about it, my dear.\" \n \n \"But I should like to speak to him, mamma, without you.\" \n \n \"What to say,—Anna?\" \n \n \"I hardly know;—but I should like to speak to him. I have something to say about money.\" \n \n \"Cannot I say it?\" \n \n \"No, mamma. I must say it myself,—if you will let me.\" The Countess looked at her girl with suspicion, but she gave the permission demanded. Of course it would be right that this lover should see his love. The Countess was almost minded to require from Lady Anna an assurance that no allusion should be made to Daniel Thwaite; but the man\u0027s name had not been mentioned between them since the beginning of the illness, and she was loth to mention it now. Nor would it have been possible to prevent for long such an interview as that now proposed. \n \n \"He shall come in if he pleases,\" said the Countess; \"but I hope you will remember who you are and to whom you are speaking.\" \n \n \"I will remember both, mamma,\" said Lady Anna. The Countess looked down on her daughter\u0027s face, and could not help thinking that her child was different from what she had been. There had been almost defiance in the words spoken, though they had been spoken with the voice of an invalid. \n \n At three o\u0027clock that afternoon, according to his custom, Lord Lovel came, and was at once told that he was to be spoken to by his cousin. \"She says it is about money,\" said the Countess. \n \n \"About money?\" \n \n \"Yes;—and if she confines herself to that, do as she bids you. If she is ever to be your wife it will be all right; and if not,—then it will be better in your hands than in hers. In three months time she can do as she pleases with it all.\" He was then taken into Lady Anna\u0027s room. \"Here is your cousin,\" said the Countess. \"You must not talk long or I shall interrupt you. If you wish to speak to him about the property,—as the head of your family,—that will be very right; but confine yourself to that for the present.\" Then the Countess left them and closed the door. \n \n \"It is not only about money, Lord Lovel.\" \n \n \"You might call me Frederic now,\" said he tenderly. \n \n \"No;—not now. If I am ever well again and we are then friends I will do so. They tell me that there is ever so much money,—hundreds of thousands of pounds. I forget how much.\" \n \n \"Do not trouble yourself about that.\" \n \n \"But I do trouble myself very much about it,—and I know that it ought to be yours. There is one thing I want to tell you, which you must believe. If I am ever any man\u0027s wife, I shall be the wife of Daniel Thwaite.\" That dark frown came upon his face which she had seen once before. \"Pray believe that it is so,\" she continued. \"Mamma does not believe it,—will not believe it; but it is so. I love him with all my heart. I think of him every minute. It is very very cruel that I may not hear from him or send one word to tell him how I am. There! My hand is on the Bible, and I swear to you that if I am ever the wife of any man, I will be his wife.\" \n \n He looked down at her and saw that she was wan and thin and weak, and he did not dare to preach to her the old family sermon as to his rank and station. \"But, Anna, why do you tell me this now?\" he said. \n \n \"That you may believe it and not trouble yourself with me any more. You must believe it when I tell you so in this manner. I may perhaps never live to rise from my bed. If I get well, I shall send to him, or go. I will not be hindered. He is true to me, and I will be true to him. You may tell mamma if you think proper. She would not believe me, but perhaps she may believe you. But, Lord Lovel, it is not fit that he should have all this money. He does not want it, and he would not take it. Till I am married I may do what I please with it;—and it shall be yours.\" \n \n \"That cannot be.\" \n \n \"Yes, it can. I know that I can make it yours if I please. They tell me that—that you are not rich, as Lord Lovel should be, because all this has been taken from you. That was the reason why you came to me.\" \n \n \"By heaven, Anna, I love you most truly.\" \n \n \"It could not have been so when you had not seen me. Will you take a message from me to Daniel Thwaite?\" \n \n He thought awhile before he answered it. \"No, I cannot do that.\" \n \n \"Then I must find another messenger. Mr. Goffe will do it perhaps. He shall tell me how much he wants to keep, and the rest shall be yours. That is all. If you tell mamma, ask her not to be hard to me.\" He stood over her and took her hand, but knew not how to speak a word to her. He attempted to kiss her hand; but she raised herself on her elbow, and shook her head and drew it from him. \"It belongs to Daniel Thwaite,\" she said. Then he left her and did not speak another word. \n \n \"What has she said?\" asked the Countess, with an attempt at smiling. \n \n \"I do not know that I should tell you.\" \n \n \"Surely, Lovel, you are bound to tell me.\" \n \n \"She has offered me all her property,—or most of it.\" \n \n \"She is right,\" said the Countess. \n \n \"But she has sworn to me, on the Bible, that she will never be my wife.\" \n \n \"Tush!—it means nothing.\" \n \n \"Ah yes;—it means much. It means all. She never loved me,—not for an instant. That other man has been before me, and she is too firm to be moved.\" \n \n \"Did she say so?\" \n \n He was silent for a moment and then replied, \"Yes; she did say so.\" \n \n \"Then let her die!\" said the Countess. \n \n \"Lady Lovel!\" \n \n \"Let her die. It will be better. Oh, God! that I should be brought to this. And what will you do, my lord? Do you mean to say that you will abandon her?\" \n \n \"I cannot ask her to be my wife again.\" \n \n \"What;—because she has said this in her sickness,—when she is half delirious,—while she is dreaming of the words that man spoke to her? Have you no more strength than that? Are you so poor a creature?\" \n \n \"I think I have been a poor creature to ask her a second time at all.\" \n \n \"No; not so. Your duty and mine are the same,—as should be hers. We must forget ourselves while we save the family. Do not I bear all? Have not I borne everything—contumely, solitude, ill words, poverty, and now this girl\u0027s unkindness? But even yet I will not give it up. Take the property,—as it is offered.\" \n \n \"I could not touch it.\" \n \n \"If not for you, then for your children. Take it all, so that we may be the stronger. But do not abandon us now, if you are a man.\" \n \n He would not stay to hear her further exhortations, but hurried away from the house full of doubt and unhappiness. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2734/75309.html","bookId":1397,"book":{"id":1397,"title":"Lady Anna","description":"简介： Women have often been hardly used by men, but perhaps no harder usage, no fiercer cruelty was ever experienced by a woman than that which fell to the lot of Josephine Murray from the hands of Earl Lovel, to whom she was married in the parish church o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2734","creation":"Aug 1, 2019 12:25:01 AM","modification":"Aug 1, 2019 12:25:01 AM"}}
