{"id":65684,"no":1,"title":"Page 1","content":"NATHAN RUBIN DIED because he got brave. Not the sustained kind of thing that wins you a medal in a war, but the split-second kind of blurting outrage that gets you killed on the street.\\n\\n He left home early, as he always did, six days a week, fifty weeks a year. A cautious breakfast, appropriate to a short round man aiming to stay in shape through his forties. A long walk down the carpeted corridors of a lakeside house appropriate to a man who earned a thousand dollars on each of those three hundred days he worked. A thumb on the button of the garage-door opener and a twist of the wrist to start the silent engine of his expensive imported sedan. A CD into the player, a backward sweep into his gravel driveway, a dab on the brake, a snick of the selector, a nudge on the gas, and the last short drive of his life was under way. Six forty-nine in the morning, Monday.\\n\\n The only light on his route to work was green, which was the proximate cause of his death. It meant that as he pulled into his secluded slot behind his professional building the prelude ahead of Bach\u0027s B Minor Fugue still had thirty-eight seconds left to run. He sat and heard it out until the last organ blast echoed to silence, which meant that as he got out of his car the three men were near enough for him to interpret some kind of intention in their approach. So he glanced at them. They looked away and altered course, three men in step, like dancers or soldiers. He turned toward his building. Started walking. But then he stopped. And looked back. The three men were at his car. Trying the doors.\\n\\n \"Hey!\" he called.\\n\\n It was the short universal sound of surprise, anger, challenge. The sort of instinctive sound an earnest, naive citizen makes when something should not be happening. The sort of instinctive sound which gets an earnest, naive citizen killed. He found himself heading straight back to his car. He was outnumbered three to one, but he was in the right, which swelled him up and gave him confidence. He strode back and felt outraged and fit and commanding.\\n\\n But those were illusory feelings. A soft suburban guy like him was never going to be in command of a situation like that. His fitness was just health club tone. It counted for nothing. His tight abdominals ruptured under the first savage blow. His face jerked forward and down and hard knuckles pulped his lips and smashed his teeth. He was caught by rough hands and knotted arms and held upright like he weighed nothing at all. His keys were snatched from his grasp and he was hit a crashing blow on the ear. His mouth filled with blood. He was dropped onto the blacktop and heavy boots smashed into his back. Then his gut. Then his head. He blacked out like a television set in a thunder-storm. The world just disappeared in front of him. It collapsed into a thin hot line and sputtered away to nothing.\\n\\n So he died, because for a split second he got brave. But not then. He died much later, after the split second of bravery had faded into long hours of wretched gasping fear, and after the long hours of fear had exploded into long minutes of insane screaming panic.\\n\\n JACK REACHER STAYED alive, because he got cautious. He got cautious because he heard an echo from his past. He had a lot of past, and the echo was from the worst part of it.\\n\\n He had served thirteen years in the Army, and the only time he was wounded it wasn\u0027t with a bullet. It was with a fragment of a Marine sergeant\u0027s jawbone. Reacher had been stationed in Beirut, in the U.S. compound out by the airport. The compound was truck-bombed. Reacher was standing at the gate. The Marine sergeant was standing a hundred yards nearer the explosion. The jawbone fragment was the only piece left of the guy. It hit Reacher a hundred yards away and went tumbling through his gut like a bullet. The Army surgeon who patched Reacher up told him afterward he was lucky. He told him a real bullet in the gut would have felt much worse. That was the echo Reacher was hearing. And he was paying a whole lot of attention to it, because thirteen years later he was standing there with a handgun pointing straight at his stomach. From a range of about an inch and a half.\\n\\n The handgun was a nine-millimeter automatic. It was brand-new. It was oiled. It was held low, lined up right on his old scar. The guy holding it looked more or less like he knew what he was doing. The safety mechanism was released. There was no visible tremor in the muzzle. No tension. The trigger finger was ready to go to work. Reacher could see that. He was concentrating hard on that trigger finger.\\n\\n He was standing next to a woman. He was holding her arm. He had never seen her before. She was staring at an identical nine-millimeter pointed at her own gut. Her guy was more tensed up than his. Her guy looked uneasy. He looked worried. His gun was trembling with tension. His fingernails were chewed. A nervous, jumpy guy. The four of them were standing there on the street, three of them still like statues and the fourth hopping slightly from foot to foot.\\n\\n They were in Chicago. Center of the city, a busy sidewalk, a Monday, last day of June. Broad daylight, bright summer sunshine. The whole situation had materialized in a split second. It had happened in a way that couldn\u0027t have been choreographed in a million years. Reacher had been walking down the street, going nowhere, not fast, not slow. He had been about to pass the exit door of a store-front dry cleaner. The door had opened up in his face and an old metal walking cane had clattered out on the sidewalk right in front of him. He\u0027d glanced up to see a woman in the doorway. She was about to drop an armful of nine dry-cleaning bags. She was some way short of thirty, expensively dressed, dark, attractive, self-assured. She had some kind of a bad leg. Some kind of an injury. Reacher could see from her awkward posture it was causing her pain. She\u0027d thrown him a would-you-mind look and he\u0027d thrown her a no-problem look and scooped up the metal cane. He\u0027d taken the nine bags from her with one hand and given her the cane with the other. He\u0027d flicked the bags up over his shoulder and felt the nine wire hangers bite into his finger. She had planted the cane on the sidewalk and eased her forearm into the curved metal clip. He had offered his hand. She had paused. Then she had nodded in an embarrassed fashion and he had taken her arm and waited a beat, feeling helpful but awkward. Then they had turned together to move away. Reacher had figured he would maybe stroll a few steps with her until she was steady on her feet. Then he would let her arm go and hand back her garments. But he\u0027d turned straight into the two men with the nine-millimeter automatics.\\n\\n The four of them stood there, face-to-face in pairs. Like four people eating together in a tight booth in a diner. The two guys with the guns were white, well fed, vaguely military, vaguely alike. Medium height, short brown hair. Big hands, muscular. Big, obvious faces, bland pink features. Tense expressions, hard eyes. The nervous guy was smaller, like he burned up his energy worrying. They both wore checked shirts and poplin windbreakers. They stood there, pressed together. Reacher was a lot taller than the other three. He could see all around them, over their heads. He stood there, surprised, with the woman\u0027s dry cleaning slung over his shoulder. The woman was leaning on her crutch, just staring, silent. The two men were pointing the guns. Close in. Reacher felt they\u0027d all been standing like that for a long time. But he knew that feeling was deceptive. It probably hadn\u0027t been more than a second and a half.\\n\\n The guy opposite Reacher seemed to be the leader. The bigger one. The calmer one. He looked between Reacher and the woman and jerked his automatic\u0027s barrel toward the curb.\\n\\n \"In the car, bitch,\" the guy said. \"And you, asshole.\"\\n\\n He spoke urgently, but quietly. With authority. Not much of an accent. Maybe from California, Reacher thought. There was a sedan at the curb. It had been waiting there for them. A big car, black, expensive. The driver was leaning across and behind the front passenger seat. He was stretching over to pop the rear door. The guy opposite Reacher motioned with the gun again. Reacher didn\u0027t move. He glanced left and right. He figured he had about another second and a half to make some kind of an assessment. The two guys with the nine-millimeter automatics didn\u0027t worry him too much. He was one-handed, because of the dry cleaning, but he figured the two guys would go down without too much of a problem. The problems lay beside him and behind him. He stared up into the dry cleaner\u0027s window and used it like a mirror. Twenty yards behind him was a solid mass of hurrying people at a crosswalk. A couple of stray bullets would find a couple of targets. No doubt about that. No doubt at all. That was the problem behind him. The problem beside him was the unknown woman. Her capabilities were an unknown quantity. She had some kind of a bad leg. She would be slow to react. Slow to move. He wasn\u0027t prepared to go into combat. Not in that environment, and not with that partner.\\n\\n The guy with the California accent reached up and grabbed Reacher\u0027s wrist where it was pinned against his collar by the weight of the nine clean garments hanging down his back. He used it to pull him toward the car. His trigger finger still looked ready to go to work. Reacher was watching it, corner of his eye. He let the woman\u0027s arm go. Stepped over to the car. Threw the bags into the rear seat and climbed in after them. The woman was pushed in behind him. Then the jumpy guy crowded in on them and slammed the door. The leader got in front on the right. Slammed the door. The driver nudged the selector and the car moved smoothly and quietly away down the street.\\n\\n THE WOMAN WAS gasping in pain and Reacher figured she had the jumpy guy\u0027s gun jammed in her ribs. The leader was twisted around in the front seat with his gun hand resting against the thick leather headrest. The gun was pointed straight at Reacher\u0027s chest. It was a Glock 17. Reacher knew all about that weapon. He had evaluated the prototype for his unit. That had been his assignment during his light-duty convalescence after the Beirut wound. The Glock was a tough little weapon. Seven and a half inches long from firing pin to muzzle tip. Long enough to make it accurate. Reacher had hit thumbtack heads at seventy-five feet with it. And it fired a decent projectile. It delivered quarter-ounce bullets at nearly eight hundred miles an hour. Seventeen rounds to a magazine, hence the name. And it was light. For all its power, it weighed under two pounds. The important parts were steel. The rest of it was plastic. Black polycarbonate, like an expensive camera. A fine piece of craftsmanship.\\n\\n But he hadn\u0027t liked it much. Not for the specialized requirements of his unit. He\u0027d recommended rejection. He\u0027d supported the Beretta 92F instead. The Beretta was also a nine-millimeter, a half-pound heavier, an inch longer, two fewer rounds in the magazine. But it had about ten percent more stopping power than the Glock. That was important to him. And it wasn\u0027t plastic. The Beretta had been Reacher\u0027s choice. His unit commander had agreed. He had circulated Reacher\u0027s paper and the Army as a whole had backed his recommendation. The same week they promoted him and pinned on his Silver Star and his Purple Heart, they ordered Berettas even though the Beretta was more expensive and NATO was crazy for the Glock and Reacher had been just about a lone voice and was not long out of West Point. Then he had been assigned elsewhere and served all around the world and hadn\u0027t really seen a Glock 17 since. Until now. Twelve years later, he was getting a pretty damn good second look at one.\\n\\n He switched his attention away from the gun and took a second look at the guy holding it. He had a decent tan which whitened near his hairline. A recent haircut. The driver had a big shiny brow, thinning hair swept back, pink and vivid features, the smirk that pig-ugly guys use when they think they\u0027re handsome. Same cheap chain store shirt, same windbreaker. Same corn-fed bulk. Same in-charge confidence, edged around with a slight breathlessness. Three guys, all of them maybe thirty or thirty-five, one leader, one solid follower, one jumpy follower. All of them tense but rehearsed, racing through some kind of a mission. A puzzle. Reacher glanced past the steady Glock into the leader\u0027s eyes. But the guy shook his head.\\n\\n \"No talking, asshole,\" he said. \"Start talking, I\u0027ll shoot you. That\u0027s a damn promise. Keep quiet, you could be OK.\"\\n\\n Reacher believed him. The guy\u0027s eyes were hard and his mouth was a tight line. So he said nothing. Then the car slowed and pulled onto a lumpy concrete forecourt. It headed around behind an abandoned industrial building. They had driven south. Reacher figured they were now maybe five miles south of the Loop. The driver eased the big sedan to a stop with the rear door lined up with the back of a small panel truck. The truck was standing alone on the empty lot. It was a Ford Econoline, dirty white, not old, but well used. There had been some kind of writing on the side. It had been painted over with fresh white paint which didn\u0027t exactly match the bodywork. Reacher scanned around. The lot was full of trash. He saw a paint can discarded near the truck. A brush. There was nobody in sight. The place was deserted. If he was going to make some kind of a move, this was the right time to make it, and the right location. But the guy in front smiled a thin smile and leaned right over into the back of the car. Caught Reacher\u0027s collar with his left hand and ground the tip of the Glock\u0027s muzzle into Reacher\u0027s ear with his right.\\n\\n \"Sit still, asshole,\" the guy said.\\n\\n The driver got out of the car and skipped around the hood. Pulled a new set of keys from his pocket and opened up the rear doors of the truck. Reacher sat still. Jamming a gun into a person\u0027s ear is not necessarily a smart move. If the person suddenly jerks his head around toward it, the gun comes out. It rolls around the person\u0027s forehead. Then even a quick trigger finger won\u0027t do much damage. It might blow a hole in the person\u0027s ear, just the outside flap, and it\u0027s sure to shatter the person\u0027s eardrum. But those are not fatal wounds. Reacher spent a second weighing those odds. Then the jumpy guy dragged the woman out of the car and hustled her straight into the back of the truck. She hopped and limped across the short distance. Straight out of one door and in through the other. Reacher watched her, corner of his eye. Her guy took her pocketbook from her and tossed it back into the car. It fell at Reacher\u0027s feet. It thumped heavily on the thick carpet. A big pocketbook, expensive leather, something heavy in it. Something metal. Only one metal thing women carry could make a heavy thump like that. He glanced across at her, suddenly interested.\\n\\n She was sprawled in the back of the truck. Impeded by her leg. Then the leader in the front pulled Reacher along the leather seat and passed him on to the jumpy guy. As soon as one Glock was out of his ear, the other was jammed into his side. He was dragged over the rough ground. Across to the rear of the truck. He was pushed inside with the woman. The jumpy guy covered them both with the trembling Glock while the leader reached into the car and pulled out the woman\u0027s metal crutch. He walked over and tossed it into the truck. It clanged and boomed on the metal siding. He left her dry cleaning in the back of the sedan with her handbag. Then he pulled a set of handcuffs from the pocket of his jacket. He caught the woman\u0027s right wrist and cuffed it with half the handcuff. Pulled her roughly sideways and caught Reacher\u0027s left wrist. Snapped the other half of the cuff onto it. Shook the cuff to check it was secure. Slammed the truck\u0027s left rear door. Reacher saw the driver emptying plastic bottles into the sedan. He caught the pale color and the strong smell of gasoline. One bottle into the backseat, one into the front. Then the leader swung the truck\u0027s right rear door shut. Last thing Reacher saw before darkness enveloped him was the driver, pulling a matchbook from his pocket. \\n\\n","sourceLink":"https://allnovel.net/die-trying-jack-reacher-2/page-1.html","bookId":2340,"book":{"id":2340,"title":"Die Trying (Jack Reacher #2)","description":"Storyline: Die Trying (Jack Reacher #2) \\n When a woman is kidnapped off a Chicago street in broad daylight, Jack Reacher\u0027s in the wrong place at the wrong time. He\u0027s kidnapped with her. Handcuffed together and racing across America toward an unknown destination, they\u0027re at the mercy of a group of men demanding an impossible ransom - the woman is worth more than he can imagine.\\n","cover":"https://allnovel.net/images/die-trying-jack-reacher-2.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/die-trying-jack-reacher-2.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:58:05 AM"}}
