{"id":65703,"no":20,"title":"Page 20","content":"BROGAN WAS THE guy who made the breakthrough in Chicago. He was the third guy that morning to walk past the can of white paint out there on the abandoned industrial lot, but he was the first to realize its significance.\n \"The truck they stole was white,\" Brogan said. \"Some kind of ID on the side. They painted over it. Got to be that way. The can was right there, with a brush, about ten feet from the Lexus. Stands to reason they would park the Lexus right next to the truck, right? Therefore the paint can was next to where the truck had been.\"\n \"What sort of paint?\" McGrath asked.\n \"Ordinary household paint,\" Brogan said. \"A quart can. Two-inch brush. Price tag still on it, from a hardware store. And there are fingerprints in the splashes on the handle.\"\n McGrath nodded and smiled.\n \"OK,\" he said. \"Go to work.\"\n BROGAN TOOK THE computer-aided mug shots with him to the hardware store named on the paintbrush handle. It was a cramped, family-owned place, two hundred yards from the abandoned lot. The counter was attended by a stout old woman with a mind like a steel trap. Straightaway she identified the picture of the guy the video had caught at the wheel of the Lexus. She said the paint and the brush had been purchased by him about ten o\u0027clock Monday morning. To prove it, she rattled open an ancient drawer and pulled out Monday\u0027s register roll. Seven-ninety-eight for the paint, five-ninety-eight for the brush, plus tax, right there on the roll.\n \"He paid cash,\" she said.\n \"You got a video system in here?\" Brogan asked her.\n \"No,\" she said.\n \"Doesn\u0027t your insurance company say you got to?\" he asked.\n The stout old woman just smiled.\n \"We\u0027re not insured,\" she said.\n Then she leaned under the counter and came up with a shotgun.\n \"Not by no insurance company, anyway,\" she said.\n Brogan looked at the weapon. He was pretty sure the barrel was way too short for the piece to be legal. But he wasn\u0027t about to start worrying over such a thing. Not right then.\n \"OK,\" he said. \"You take care now.\"\n MORE THAN SEVEN million people in the Chicago area, something like ten million road vehicles, but only one white truck had been reported stolen in the twenty-four-hour period between Sunday and Monday. It was a white Ford Econoline. Owned and operated by a South Side electrician. His insurance company made him empty the truck at night, and store his stock and tools inside his shop. Anything left inside the truck was not covered. That was the rule. It was an irksome rule, but on Monday morning when the guy came out to load up and the truck was gone, it started to look like a rule which made a whole lot of sense. He had reported the theft to the insurance broker and the police, and he was not expecting to hear much more about it. So he was duly impressed when two FBI agents turned up, forty-eight hours later, asking all kinds of urgent questions.\n \"OK,\" MCGRATH SAID. \"We know what we\u0027re looking for. White Econoline, new paint on the sides. We\u0027ve got the plates. Now we need to know where to look. Ideas?\"\n \"Coming up on forty-eight hours,\" Brogan said. \"Assume an average speed of fifty-five? That would make the max range somewhere more than twenty-six hundred miles. That\u0027s effectively anywhere on the North American continent, for God\u0027s sake.\"\n \"Too pessimistic,\" Milosevic said. \"They probably stopped nights. Call it six hours\u0027 driving time on Monday, maybe ten on Tuesday, maybe four so far today, total of twenty hours, that\u0027s a maximum range of eleven hundred miles.\"\n \"Needle in a haystack,\" Brogan said.\n McGrath shrugged.\n \"So let\u0027s find the haystack,\" he said. \"Then we\u0027ll go look for the needle. Call it fifteen hundred maximum. What does that look like?\"\n Brogan pulled a road atlas from the stack of reference material on the table. He opened it up to the early section where the whole country was shown all at once, all the states splattered over one page in a colorful mosaic. He checked the scale and traced his fingernail in a circle.\n \"That\u0027s anywhere shy of California,\" he said. \"Half of Washington State, half of Oregon, none of California and absolutely all of everywhere else. Somewhere around a zillion square miles.\"\n There was a depressed silence in the room.\n \"Mountains between here and Washington State, right?\" McGrath said. \"So let\u0027s assume they\u0027re not in Washington State yet. Or Oregon. Or California. Or Alaska or Hawaii. So we\u0027ve cut it down already. Only forty-five states to call, right? Let\u0027s go to work.\"\n \"They might have gone to Canada,\" Brogan said. \"Or Mexico, or a boat or a plane.\"\n Milosevic shrugged and took the atlas from him.\n \"You\u0027re too pessimistic,\" he said again.\n \"Needle in a damn haystack,\" Brogan said back.\n THREE FLOORS ABOVE them, the Bureau fingerprint technicians were looking at the paintbrush Brogan had brought in. It had been used once only, by a fairly clumsy guy. The paint was matted up in the bristles, and had run onto the mild steel ferrule which bound the bristles into the wooden handle. The guy had used an action which had put his thumb on the back of the ferrule, and his first two fingers on the front. It was suggestive of a medium-height guy reaching up and brushing paint onto a flat surface, level with his head, maybe a little higher, the paintbrush handle pointing downward. A Ford Econoline was just a fraction less than eighty-one inches tall. Any sign writing would be about seventy inches off the ground. The computer could not calculate this guy\u0027s height, because it had only seen him sitting down inside the Lexus, but the way the brush had been used, he must have been five eight, five nine, reaching up and brushing just a little above his eye level. Brushing hard, with some lateral force. There wasn\u0027t going to be a lot of finesse in the finished job.\n Wet paint is a pretty good medium for trapping fingerprints, and the techs knew they weren\u0027t going to have a lot of trouble. But for the sake of completeness, they ran every process they had, from fluoroscopy down to the traditional gray powder. They ended up with three and a half good prints, clearly the thumb and the first two fingers of the right hand, with the extra bonus of a lateral half of the little finger. They enhanced the focus in the computer and sent the prints down the digital line to the Hoover Building in Washington. They added a code instructing the big database down there to search with maximum speed.\n IN THE LABS at Quantico, the hunters were divided into two packs. The burned pickup had been torn apart, and half the staff was examining the minute physical traces unique to that particular vehicle. The other half was chasing through the fragmented records held by the manufacturers, listening out for the faint echoes of its construction and subsequent sales history.\n It was a Dodge, ten years old, built in Detroit. The chassis number and the code stamped into the iron of the engine block were both original. The numbers enabled the manufacturer to identify the original shipment. The pickup had rolled out of the factory gate one April and had been loaded onto a railroad wagon and hauled to California. Then it had been driven to a dealership in Mojave. The dealer had paid the invoice in May, and beyond that, the manufacturer had no further knowledge of the vehicle.\n The dealership in Mojave had gone belly-up two years later. New owners had bought the franchise. Current records were in their computer. Ancient history from before the change in ownership was all in storage. Not every day that a small automotive dealership on the edge of the desert gets a call from the FBI Academy at Quantico, so there was a promise of rapid action. The sales manager himself undertook to get the information and call right back.\n The vehicle itself was pretty much burned out. All the soft clues were gone. There were no plates. There was nothing significant in the interior. There were no bridge tokens, no tunnel tokens. The windshield stickers were gone. All that was left was the mud. The vehicle technicians had cut away both of the rear wheel wells, the full hoop of sheet metal right above the driven tires, and carried them carefully across to the Materials Analysis Unit. Any vehicle writes its own itinerary in the layers of mud it throws up underneath. Bureau geologists were peeling back the layers and looking at where the pickup had been, and where it had come from.\n The mud was baked solid by the burning tires. Some of the softer crystals had vitrified into glass. But the layers were clear. The outer layers were thin. The geologists concluded they had been deposited during a long journey across the country. Then there was a couple of years\u0027 worth of mixed rock particles. The particular mixture was interesting. There was such a combination of sands there that identifying their exact origin should be easy enough. Under that mixture was a thick base layer of desert dust. Straightaway, the geologists agreed that the truck had started its life out near the Mojave Desert.\n EVERY SINGLE LAW enforcement agency in forty-five states had the description and the plate number of the stolen white Econoline. Every single officer on duty in the whole nation had been briefed to look for it, parked or mobile, burned or hidden or abandoned. For a short time that Wednesday, that white Econoline was the most hunted vehicle on the planet.\n McGrath was sitting at the head of the table in the quiet conference room, smoking, waiting. He was not optimistic. If the truck was parked and hidden, it would most likely never be found. The task was too huge. Any closed garage or building or barn could hide it forever. If it was still somewhere on the road, the chances were better. So the biggest gamble of his life was: after forty-eight hours, had they gotten where they were going, or were they still on their way?\n TWO HOURS AFTER starting the patient search, the fingerprint database brought back a name: Peter Wayne Bell. There was a perfect match, right hand, thumb and first two fingers. The computer rated the match on the partial from the little finger as very probable.\n \"Thirty-one years old,\" Brogan said. \"From Mojave, California. Two convictions for sex offenses. Charged with a double rape, three years ago, didn\u0027t go down. Victims were three months in the hospital. This guy Bell had an alibi from three of his friends. Victims couldn\u0027t make the ID, too shaken up by the beatings.\"\n \"Nice guy,\" McGrath said.\n Milosevic nodded.\n \"And he\u0027s got Holly,\" he said. \"Right there in the back of his truck.\"\n McGrath said nothing in reply to that. Then the phone rang. He picked it up. Listened to a short barked sentence. He sat there and Brogan and Milosevic saw his face light up like a guy who sees his teams all win the pennant on the same day, baseball and football and basketball and hockey, all on the same day that his son graduates summa cum laude from Harvard and his gold stocks go through the roof.\n \" Arizona,\" he shouted. \"It\u0027s in Arizona, heading north on U.S. 60.\"\n AN OLD HAND in an Arizona State Police cruiser had spotted a white panel truck making bad lane changes round the sharp curves on U.S. 60 as it winds away from the town of Globe, seventy miles east of Phoenix. He had pulled closer and read the plate. He saw the blue oval and the Econoline script on the back. He had thumbed his mike and called it in. Then the world had gone crazy. He was told to stick with the truck, no matter what. He was told that helicopters would be coming in from Phoenix and Flagstaff, and from Albuquerque way over in New Mexico. Every available mobile unit would be coming in behind him from the south. Up ahead, the National Guard would be assembling a roadblock. Within twenty minutes, he was told, you\u0027ll have more backup than you\u0027ve ever dreamed of. Until then, he was told, you\u0027re the most important lawman in America.\n THE SALES MANAGER from the Dodge dealership in Mojave, California, called Quantico back within an hour. He\u0027d been over to the storage room and dug out the records for the sales made ten years ago by the previous franchise owners. The pickup in question had been sold to a citrus farmer down in Kendall, fifty miles south of Mojave, in May of that year. The guy had been back for servicing and emissions testing for the first four years, and after that, they\u0027d never seen him again. He had bought on a four-year time payment plan and his name was Dutch Borken.\n A HALF-HOUR LATER, the stolen white Econoline was twenty-eight miles farther north on U.S. 60 in Arizona and it was the tip of a long teardrop shape of fifty vehicles cruising behind it. Above it, five helicopters were hammering through the air. In front of it, ten miles to the north, the highway was closed and another forty vehicles were stationary on the pavement, parked up in a neat arrowhead formation. The whole operation was being coordinated by the Agent-in-Charge from the FBI\u0027s Phoenix office. He was in the lead helicopter, staring down through the clear desert air at the roof of the truck. He was wearing a headset with a throat mike, and he was talking continuously.\n \"OK, people,\" he said. \"Let\u0027s go for it, right now. Go go go!\"\n His lead chopper swooped upward out of the way and two others arrowed down. They hovered just in front of the truck, low down, one on each side, keeping pace. The police cars behind fanned out across the whole width of the highway and they all hit their lights and sirens together. A third chopper swung down and flew backward, right in front of the truck, eight feet off the ground, strobes flashing, rotors beating the air. The copilot started a sequence of clear gestures, hands wide, palms out, like he was personally slowing the truck. Then the sirens all stopped and the enormous bullhorn on the front of the helicopter fired up. The copilot\u0027s voice boomed out, amplified grotesquely beyond the point of distortion, clearly audible even over the thrashing and hammering of the rotor blades.\n \"Federal agents,\" his voice screamed. \"You are commanded to stop at once. I repeat, you are commanded to stop your vehicle at once.\"\n The truck kept on going. The helicopter right in front of it swung and wobbled in the air. Then it settled again, even closer to the windshield, flying backward, not more than ten feet away.\n \"You are surrounded,\" the copilot shouted through the huge bullhorn. \"There are a hundred police officers behind you. The road is closed ahead. You have no option. You must slow your vehicle and come to a complete stop. You must do that right now.\"\n The cruisers all lit up their sirens again and two of them pulled alongside. The truck was locked into a solid raft of hostile traffic. It sped on for a long moment, then it slowed. Behind it, the frantic convoy braked and swerved. The helicopters rose up and kept pace. The truck slowed more. Police cruisers pulled alongside, two deep, door to door, bumper to bumper. The truck coasted to a halt. The helicopters held station overhead. The lead cars swerved around in front and jammed to a stop, inches from the truck\u0027s hood. All around, officers jumped out. The highway was thick with police. Even over the beating of the helicopter rotors, the crunching of shotgun mechanisms and the clicking of a hundred revolver hammers were clearly audible.\n IN CHICAGO, MCGRATH did not hear the shotguns and the revolvers, but he could hear the Phoenix Agent-in-Charge shouting over the radio. The output from the throat mike in his helicopter was patched through Washington and was crackling out through a speaker on the long hardwood table. The guy was talking continuously, excited, half in a stream of instructions to his team, half as a running commentary on the sight he was seeing on the road below. McGrath was sitting there, hands cold and wet, staring at the noisy speaker like if he stared at it hard enough, it would change into a crystal ball and let him see what was going down.\n \"He\u0027s stopping, he\u0027s stopping,\" the guy in the helicopter was saying. \"He\u0027s stationary now, he\u0027s stopped on the road, he\u0027s surrounded. Hold your fire, wait for my word, they\u0027re not coming out, open the doors, open the damn doors and drag them out, OK, we got two guys in the front, two guys, one driver, one passenger, they\u0027re coming out, they\u0027re out, secure them, put them in a car, get the keys, open up the back, but watch out, there are two more in there with her. Ok, we\u0027re going to the back, we\u0027re going around to the rear, the doors are locked back there, we\u0027re trying the key. You know what? There\u0027s still writing on the side of this truck. The writing is still there. It says Bright Spark Electrics. I thought it was supposed to be blanked out, right? Painted over or something?\"\n In Chicago, a deathly hush fell over the third-floor conference room. McGrath went white. Milosevic looked at him. Brogan stared calmly out of the window.\n \"And why is it heading north?\" McGrath asked. \"Back toward Chicago?\"\n The crackling from the speaker was still there. They turned back toward it. Listened hard. They could hear the thump of the rotor blades behind the urgent voice.\n \"The rear doors are open,\" the voice said. \"The doors are open, they\u0027re open, we\u0027re going in, people are coming out, here they come, what the hell is this? There are dozens of people in there. There are maybe twenty people in there. They\u0027re all coming out. They\u0027re still coming out. There are twenty or thirty people in there. What the hell is going on here?\"\n The guy broke off. Evidently he was listening to a report radioed up from the ground. McGrath and Brogan and Milosevic stared at the hissing speaker. It stayed quiet for a long time. Nothing coming through at all except the guy\u0027s loud breathing and the hammering of the blades and the waterfall of static. Then the voice came back.\n \"Shit,\" it said. \"Shit, Washington, you there? You listening to this? You know what we just did? You know what you sent us to do? We just busted a load of wetbacks. About thirty illegals from Mexico. Just got picked up from the border. They\u0027re on their way up to Chicago. They say they all got jobs promised up there.\" \n","sourceLink":"https://allnovel.net/die-trying-jack-reacher-2/page-20.html","bookId":2340,"book":{"id":2340,"title":"Die Trying (Jack Reacher #2)","description":"Storyline: \n Die Trying (Jack Reacher #2) \n When a woman is kidnapped off a Chicago street in broad daylight, Jack Reacher\u0027s in the wrong place at the wrong time. He\u0027s kidnapped with her. Handcuffed together and racing across America toward an unknown destination, they\u0027re at the mercy of a group of men demanding an impossible ransom - the woman is worth more than he can imagine.\n \n","cover":"https://allnovel.net/images/die-trying-jack-reacher-2.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/die-trying-jack-reacher-2.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:58:05 AM"}}
