{"id":65724,"no":41,"title":"Page 41","content":"REACHER WATCHED THE whole thing happen. He was a hundred and fifty yards away in the trees. Northwest of the ambush, high up the slope on the other side of the road. There was a dead sentry at his feet. The guy was lying in the dirt with his head at right angles to his neck. Reacher had his field glasses raised to his eyes. Watching. Watching what, he wasn\u0027t exactly sure.\n He had caught the gist of the radio conversation in the Bastion. He had heard Borken\u0027s side. He had guessed the replies. He had heard the southern lookouts calling in on the walkie-talkies. He knew about the Marines on the bridge. He knew about Webster and Johnson sitting there alongside them, on the end of the line.\n He had wondered who else was down there. Maybe more military, maybe more FBI. The military wouldn\u0027t come. Johnson would have ordered them to sit tight. If anybody came, it would be the FBI. He figured they might have substantial numbers standing by. He figured they would be coming in, sooner or later. He needed to exploit them. Needed to use them as a diversion while he got Holly out. So he had moved southeast to wait for their arrival. Now, an hour later, he was gazing down at the short stocky guy getting loaded into the jeep. Dark suit, white shirt, town shoes. FBI, for sure.\n But not the Hostage Rescue Team. This guy had no equipment. The HRT came in all loaded down with paramilitary gear. Reacher was familiar with their procedures. He had read some of their manuals. Heard about some of their training. He knew guys who had been in and out of Quantico. He knew how the HRT worked. They were a high-technology operation. They looked like regular soldiers, in blue. They had vehicles. This guy he was watching was on foot in the forest. Dressed like he had just stepped out of a meeting.\n It was a puzzle. Eight Marines. No Hostage Rescue Team. An unarmed search-and-rescue Chinook. Then Reacher suddenly thought maybe he understood. Maybe this was a very clandestine operation. Low-profile. Invisible. They had tracked Holly all the way west from Chicago, but for some reason they maybe weren\u0027t gathering any kind of a big force. They were dealing with it alone. Some tactical reason. Maybe a political reason. Maybe something to do with Holly and the White House. Maybe the policy was to deal with this secretly, deal with it hard, tackle it with a tight little team. So tight the right hand didn\u0027t know what the left was doing. Hence the unarmed search-and-rescue chopper. It had come in blind. Hadn\u0027t known what it was getting into.\n In which case this ambushed guy he was watching was direct from Chicago. Part of the original operation that must have started up back on Monday. He looked like a senior guy. Maybe approaching fifty. Could be Brogan, Holly\u0027s section head. Could even be McGrath, the top boy. In either case that made Milosevic the mole. Question was, was he up here as well, or was he still back in Chicago?\n The jeep turned slowly in the road. The Bureau guy in the suit was in back, jammed between two armed men. His nose was bleeding and Reacher could see a swelling starting on his face. Borken had twisted his bulk around and was talking at him. The rest of the ambush squad was forming up in the road. The jeep drove past them, north toward town. Passed by thirty yards from where Reacher was standing in the trees. He watched it go. Turned and picked up his rifle. Strolled through the woods, deep in thought.\n His problem was priority order. He had a rule: stick to the job in hand. The job in hand was getting Holly away safe. Nothing else. But this Bureau guy was in trouble. He thought about Jackson. The last Bureau guy they\u0027d gotten hold of. Maybe this new guy was heading for the same fate. In which case, he ought to intervene. And he liked the look of the guy. He looked tough. Small, but strong. A lot of energy. Some kind of charisma there. Maybe an ally would be a smart thing to have. Two heads, better than one. Two pairs of hands. Four trigger fingers. Useful. But his rule was: stick to the job in hand. It had worked for him many times over the years. It was a rule which had served him well. Should he bend that rule? Or not? He stopped and stood concealed in the forest while the ambush squad marched by on the road. Listened to the sound of their footsteps die away. Stood there and thought about the guy some more and forced himself toward a tough decision.\n GENERAL GARBER WATCHED the whole thing happen, too. He was a hundred and fifty yards south of the ambush. West side of the road, behind a rocky outcrop, exactly three hundred yards south of where Reacher had been. He had waited three minutes and then followed McGrath in through the ravine. Garber was also a reasonably fit man, but a lot older, and it had cost him a lot to keep pace with McGrath. He had arrived at the rocky outcrop and collapsed, out of breath. He figured he had maybe fifteen or twenty minutes to recover before the rendezvous took place. Then his plan was to follow behind the three agents and see what was going to happen. He didn\u0027t want anybody making mistakes about Jack Reacher.\n But the rendezvous had never happened. He had watched the ambush and realized a lot of mistakes had been made about a lot of things.\n \"YOU\u0027RE GOING TO die,\" Borken said.\n McGrath was jammed between two soldiers on the back seat of the jeep. He was bouncing around because the road was rough. But he couldn\u0027t move his arms, because the seat was not really wide enough for three people. So he put the shrug into his injured face instead.\n \"We\u0027re all going to die,\" he said. \"Sooner or later.\"\n \"Sooner or later, right,\" Borken said. \"But for you, it\u0027s going to be sooner, not later.\"\n Borken was twisted around in the front seat, staring. McGrath looked past him at the vast blue sky. He looked at the small white clouds and thought: Who was it? Who knew? Air Force operational personnel, he guessed, but that link was ludicrous. Had to be somebody nearer and closer. Somebody more involved. The only possibilities were Johnson or his aide, or Webster himself, or Brogan, or Milosevic. Garber, conceivably. He seemed pretty hot on excusing this Reacher guy. Was this some military police conspiracy to overthrow the Joint Chiefs?\n \"Who was it, Borken?\" he asked.\n \"Who was what, dead man?\" Borken asked back.\n \"Who\u0027s been talking to you?\" McGrath said.\n Borken smiled and tapped his finger on his temple.\n \"Common cause,\" he said. \"This sort of issue, there are a lot more people than you think on our side.\"\n McGrath glanced back to the sky and thought about Dexter, safe in the White House. What had Webster said he\u0027d said? Twelve million people? Or was it sixty-six million? \u0026#8250;\n \"You\u0027re going to die,\" Borken said again.\n McGrath shifted his focus back.\n \"So tell me who it was, before I do,\" he said.\n Borken grinned at him.\n \"You\u0027ll find out,\" he said. \"It\u0027s going to be a big surprise.\"\n The jeep pulled up in front of the courthouse. McGrath twisted and looked up at it. There were six soldiers standing guard outside the building. They were fanned into a rough arc, facing south and east.\n \"She in there?\" he asked.\n Borken nodded and smiled.\n \"Right now she is,\" he said. \"I may have to get her out later.\"\n The walkie-talkie on his belt burst into life. A loud burst of static and a quick distorted message. He pressed the key and bent his head down. Acknowledged the information without unclipping the unit. Then he pulled the radio transmitter from his pocket. Flipped it open and pulled up the short antenna. Pressed the send button.\n \"Webster?\" he said. \"You lied to me. Twice. First, there were three of your agents down there with you. We just rounded them all up.\"\n He listened to the response. Kept the radio tight against his ear. McGrath could not hear what Webster was saying.\n \"Doesn\u0027t matter anyway,\" Borken said. \"They weren\u0027t all on your side. Some people in this world will do anything for money.\"\n He paused for a response. Apparently there was none.\n \"And you bullshitted me,\" Borken said. \"You weren\u0027t going to fix the line at all, were you? You were just stringing me along.\"\n Webster was starting a reply, but Borken cut him off.\n \"You and Johnson,\" he said. \"You can get off the bridge now. The Marines stay there. We\u0027re watching. You and Johnson walk back to your trucks. Get yourselves in front of those TVs. Should be some interesting action pretty soon.\"\n He clicked off the radio and folded it back into his pocket. A big wide smile on his face.\n \"You\u0027re going to die,\" he said to McGrath for the third time.\n \"Which one?\" McGrath asked. \"Brogan or Milosevic?\"\n Borken grinned again.\n \"Guess,\" he said. \"Figure it out for yourself. You\u0027re supposed to be the big smart federal investigator. Agent-in-Charge, right?\"\n The driver jumped down and pulled a pistol from his holster. Aimed it two-handed at McGrath\u0027s head. The left-hand guard squeezed out and unslung his rifle. Held it ready. The right-hand guy did the same. Then Borken eased his bulk down.\n \"Out,\" he said. \"We walk from here.\"\n McGrath shrugged and eased himself down into the circle of weapons. Borken stepped behind him and caught his arms. Cuffed his wrists together behind his back. Then he shoved him forward. Pointed beyond the ruined county office.\n \"Up there, dead man,\" he said.\n They left the jeep behind them next to the courthouse. The two guards formed up. McGrath stumbled across the street and up onto the lumpy knoll. He was pushed past the dead tree. He was pushed left until he found the path. He followed it around behind the old building. The rough ground bit up through the thin soles of his ruined city shoes. He might as well have been walking barefoot.\n \"Faster, asshole,\" Borken grunted at him.\n The guards were behind him, prodding him forward with the muzzles of their rifles. He picked up the pace and stumbled on through the woods. He felt the blood clotting on his lip and nose. After a mile, he came out into the clearing he recognized from the surveillance pictures. It looked bigger. From seven miles overhead, it had looked like a neat hole in the trees, with a tidy circle of buildings. From ground level, it looked as big as a stadium. Rough shale on the floor of the clearing, big wooden huts propped expertly on solid concrete piles.\n \"Wait here,\" Borken said.\n He walked away and the two guards took up station either side of McGrath as he gazed around. He saw the communications hut, with the phone wire and the whip antenna. He saw the other buildings. Smelled stale institutional food coming out of the largest. Saw the farthest hut, standing on its own. Must be their armory, he thought.\n He glanced up and saw the vapor trails in the sky. The urgency of the situation was written up there, white on blue. The planes had abandoned their innocent east-west trawling. Their trails had tightened into continuous circles, one just inside the other. They were flying around and around, centered seven miles above his head. He stared up at them and mouthed: help! He wondered if their lenses were good enough to pick that out. Wondered if maybe Webster or Johnson or Garber or Johnson\u0027s gofer could lip-read. His best guess was: yes, and no.\n REACHER\u0027S PROBLEM WAS a hell of an irony. For the first time in his life, he wished his opponents were better shots. He was concealed in the trees a hundred yards northwest of the courthouse. Looking down at six sentries. They were ranged in a loose arc, to the south and east beyond the big white building. Reacher\u0027s rifle was trained on the nearest man. But he wasn\u0027t shooting. Because if he did, the six men were going to shoot back. And they were going to miss.\n Reacher was happy with an M-16 and a range of a hundred yards. He could pretty much absolutely guarantee to hit what he wanted with that weapon at that range. He would bet his life on it. Many times, he had. And normally, the worse shots his opponents were, the happier he\u0027d be about it. But not in this situation.\n He would be shooting from a northwest direction. His opponents would be shooting back from the southeast. They would hear his shots, maybe see some muzzle flash, they would take aim, and they would fire. And they would miss. They would shoot high and wide. The targets on the rifle range were mute evidence for that conclusion. There had been some competent shooting at three and four hundred yards. The damaged targets bore witness to that fact. But Reacher\u0027s experience was that guys who could shoot just about competently at three or four hundred yards on a range would be useless in a firefight. Lying still on a mat and sighting in on a target in your own time was one thing. Shooting into a noisy confused hailstorm of bullets was a very different thing. A different thing entirely. The guy defending the missile trucks had proved that. His salvos had been all over the place. And that was the problem. Shooting back from the southeast, these guys\u0027 stray rounds were going to be all over the place, too. Up and down, left and right. The down rounds and the left rounds were no problem. They were just going to damage the scrubby vegetation. But the up rounds and the right rounds were going to hit the courthouse.\n The M-16 uses bullets designated M855. Common NATO rounds, 5.56 millimeters in caliber, just a fraction under a quarter-inch wide. Fairly heavy for their size, because they are a sandwich of lead and steel, inside a copper jacket. Designed for penetration. Those stray rounds which hit the courthouse were going to impact the siding at two thousand miles an hour. They were going to punch through the old wood like it wasn\u0027t there at all. They were going to smash through the unstable dynamite like a train wreck. The energy of their impact was going to act like a better blasting cap than anything any mining company had ever possessed. That was what those bullets were designed to do. Some committee had asked for a bullet capable of shooting through the sides of ammunition trucks. And that\u0027s what had been delivered.\n So Reacher wasn\u0027t shooting. Three sentries, he might have risked it. He figured he could get off three aimed shots in maybe three seconds. Too fast for any reaction. But six was too many. They were too spaced out. Too much physical movement was required between rounds. The later targets would have time to react. Not much time. Certainly not enough to be accurate. That was the problem.\n Reversing the geometry would be no help, either. He could work himself right around to the south. It would take him maybe twenty minutes to skirt around in the trees and come back at them from the opposite direction. But then what? He would be looking at his targets, uphill. The courthouse would be right behind them. He could hit each of them in the head, no problem at all. But he couldn\u0027t ask the bullets just to stop there in midair. He couldn\u0027t prevent those high-energy copper-jackets bursting on out of the back of those skulls and heading on their uphill trajectories straight toward the courthouse\u0027s second-story walls. He shook his head and lowered his rifle.\n MCGRATH SAW BORKEN conferring with somebody on the edge of the clearing. It was the guy who had led the ambush squad. The guy who had taken his gun and his bullets and punched him in the face. The two of them were glancing at their watches and glancing up at the sky. They were nodding. Borken slapped the guy on the shoulder and turned away. Ducked into the trees and disappeared back toward the town. The ambush leader started in toward McGrath. He was smiling. He was unslinging his rifle.\n \"Showtime,\" he called.\n He stepped near and reversed the rifle in his hands as he did so. Smashed the butt into McGrath\u0027s stomach. McGrath went down on the shale. One guard jammed the muzzle of his rifle into McGrath\u0027s throat. The other jammed his into McGrath\u0027s stomach, right where the blow had landed.\n \"Lie still, asshole,\" the unit leader said. \"I\u0027ll be back in a minute.\"\n McGrath could not move his head because of the rifle in his throat, but he followed the guy with his eyes. He was going into the next-to-last hut in line. Not the armory, which stood on its own. Some kind of an equipment store. He came out with a mallet and ropes and four metal objects. Dull-green, Army issue. As he got nearer, McGrath recognized what they were. They were tent pegs. Maybe eighteen inches long, designed for some kind of big mess tent.\n The guy dropped his load on the shale. The metal pegs clinked on the stones. The guy nodded to the soldier with the gun in McGrath\u0027s belly, who straightened up and stepped away. The unit leader took his place. Used his own weapon to keep McGrath pinned down.\n The soldier got busy. He seemed to know what he was supposed to do. He used the mallet to drive the first peg into the ground. The ground was stony and the guy had to work hard. He was swinging the mallet in a big arc and using a lot of force. He drove the peg down until it was two-thirds buried. Then he paced off maybe eight feet and started driving the second. McGrath followed him with his eyes. When the second peg was in, the guy paced another eight feet at a right angle and hammered the third peg in. The fourth peg completed an exact square, eight feet on a side. McGrath had a pretty good idea what that square was for.\n \"We normally do this in the woods,\" the unit leader said. \"We normally do it vertically, with trees.\"\n Then the guy pointed upward at the sky.\n \"But we need to let them see,\" he said. \"They can\u0027t see properly in the woods. This time of year, too many leaves in the way, right?\"\n The guard who had driven the tent pegs into the ground was panting from the exertion. He changed places with his leader again. Jammed his rifle into McGrath\u0027s gut and leaned on it, recovering. McGrath gasped and squirmed under the pressure. The leader squatted down and sorted through the ropes. Untangled one and caught McGrath by the ankle. Looped the rope around and tied it off, hard. Used the rope to drag McGrath by the leg into the approximate center of the square. Then he tied the loose end to the fourth peg. Tied it tight and tested it.\n The second length of rope went around McGrath\u0027s other ankle. It was tied off to the third peg. McGrath\u0027s legs were forced apart at a right angle. His hands were still cuffed behind his back, crushed against the rocky ground. The leader used the sole of his boot to roll McGrath\u0027s upper body sideways. Ducked down and unlocked the cuff. Caught a wrist and looped a rope around. Tied it tight and hauled the wrist up to the second peg. He pulled on it until McGrath\u0027s arm was stretched tight, in a perfect straight line with the opposite leg. Then he tied it tight to the peg and reached down for the other wrist. The soldiers jammed their muzzles in tighter. McGrath stared up at the vapor trails and gasped in pain as his arm was stretched tight and he was tied into a perfect cross.\n The two soldiers jerked their rifles away and stepped back. They stood with their leader. Gazing down. McGrath lifted his head and looked wildly around. Pulled on the ropes, and then realized he was only pulling the knots tighter. The three men stepped farther back and glanced up at the sky. McGrath realized they were making sure the cameras got an uninterrupted view.\n THE CAMERAS WERE getting an uninterrupted view. Seven miles in the sky, the pilots were flying circles, one on a tight radius of a few miles, the other outside him on a wider path. Their cameras were trained downward, under the relentless control of their computers. The inside plane was focusing tight on the clearing where McGrath was spread-eagled. The outer camera was zoomed wider, taking in the whole of the area from the courthouse in the south to the abandoned mines in the north. Their real-time video signals were bouncing down more or less vertically to the dish vehicle parked behind the mobile command post. The dish was focusing the datastream and feeding it through the thick armored cable into the observation truck. Then the decoding computers were feeding the large color monitors. Their phosphor screens were displaying the appalling truth. General Johnson and his aide and Webster were motionless in front of them. Motionless, silent, staring. Video recorders were whirring away, dispassionately recording every second\u0027s activity taking place six miles to the north. The whole vehicle was humming with faint electronic energy. But it was as silent as a tomb.\n \"Can you zoom in?\" Webster asked quietly. \"On McGrath?\"\n The General\u0027s aide twisted a black rubber knob. Stared at the screen. He zoomed in until the individual pixels in the picture began to clump together and distort. Then he backed off a fraction.\n \"Close as we can get,\" he said.\n It was close enough. McGrath\u0027s spread-eagled figure just about filled the screens. The unit leader could be seen from directly above, stepping over the lengths of rope as he circled. He had a knife in his hand. A black handle, a shiny blade, maybe ten inches long. It looked like a big kitchen knife. The sort of thing a gourmet cook might buy. Useful for slicing a tough cut of steak into strips. The sort of tool that would get set out on the kitchen counter by someone making a stew or a stroganoff.\n They saw the guy lay the knife flat on McGrath\u0027s chest. Then he used both hands to fold back the flaps on McGrath\u0027s jacket. He loosened McGrath\u0027s tie and pulled it sideways, almost up under his ear. Then he grasped the shirt and tore it open. The cotton pulled apart under the knife, leaving the knife where it was, now next to the skin. The guy pulled the tails out of the waistband and tucked the shirt right back to the sides. Carefully, well out of the way, like he was a surgeon faced with a difficult emergency procedure.\n They saw the guy pick up the knife again. He was squatted down to McGrath\u0027s right, leaning over slightly, holding the knife. He was holding it point down, close to McGrath\u0027s belly. The electronic pink of McGrath\u0027s skin was reflected in the faces of the watchers inside the observation vehicle.\n They saw the guy raise the knife an inch. They saw his index finger slide along the back of the blade, like he was adjusting his grip for extra precision. They saw the blade move down. The pale sun glinted on the steel. Then their view was disrupted. A silent puff of pink mist obscured the picture. When it cleared, the knife was still in the guy\u0027s hand. But the guy had no head. His whole head was a shattered pink wound, and he was toppling slowly sideways. \n","sourceLink":"https://allnovel.net/die-trying-jack-reacher-2/page-41.html","bookId":2340,"book":{"id":2340,"title":"Die Trying (Jack Reacher #2)","description":"Storyline: \n Die Trying (Jack Reacher #2) \n When a woman is kidnapped off a Chicago street in broad daylight, Jack Reacher\u0027s in the wrong place at the wrong time. He\u0027s kidnapped with her. Handcuffed together and racing across America toward an unknown destination, they\u0027re at the mercy of a group of men demanding an impossible ransom - the woman is worth more than he can imagine.\n \n","cover":"https://allnovel.net/images/die-trying-jack-reacher-2.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/die-trying-jack-reacher-2.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:58:05 AM"}}
