{"id":98465,"no":29,"title":"Page 29","content":"“So, I’ve learned K,” I say, grinning back. “That’s strange. I thought we were going alphabetical y.”\\n\\n “We were,” Ky tel s me. “But I think K is a good letter to know.”\\n\\n “What’s my next letter, then?” I ask with mock innocence. “Could it be Y?”\\n\\n “It could,” Ky agrees. He’s no longer smiling but his eyes are mischievous.\\n\\n The whistle sounds behind and below us. Hearing it, I wonder how I could have ever thought that the birdcal I heard earlier sounded anything like the Officer’s whistle. One sounds metal ic and man-made and the other is high and clear and lovely.\\n\\n I sigh and brush my hand across the dirt, returning the letters to the earth. Then I reach for a rock to make a cairn. Ky does the same. Together we build the tower piece by piece.\\n\\n When I put the last rock on top of the pile, Ky puts his hand over mine. I do not pul it away. I do not want anything to fal and I like the feeling of his rough warm hand on top of mine with the cool smooth surface of the rocks underneath. Then I turn my hand slowly so that my palm is up and our fingers intertwine.\\n\\n “I can never be Matched,” he says, looking first at our hands and then into my eyes. “I’m an Aberration.” He waits for my reaction.\\n\\n “But you’re not an Anomaly,” I say, trying to make light of things, knowing immediately that it’s a mistake; there’s nothing light about this.\\n\\n “Not yet, anyway,” he says, but the humor in his voice sounds forced.\\n\\n It is one thing to make a choice and it is another thing to never have the chance. I feel a sharp cold loneliness deep within me. What would it be like to be alone? To know that you could never choose anything else?\\n\\n That’s when I realize that the statistics the Officials give us do not matter to me. I know there are many people who are happy and I am glad for That’s when I realize that the statistics the Officials give us do not matter to me. I know there are many people who are happy and I am glad for them. But this is Ky. If he is the one person who fal s by the wayside while the other ninety-nine are happy and fulfil ed, that is not right with me anymore. I realize that I don’t care about the Officer pacing below or the other hikers among the trees or real y anything else at al , and that is when I realize how dangerous this truly is.\\n\\n “But if you were Matched,” I say softly, “what do you think she’d be like?”\\n\\n “You,” he says, almost before I’ve finished. “You.”\\n\\n We do not kiss. We do nothing but hold on and breathe, but stil I know. I cannot go gently now. Not even for the sake of my parents, my family.\\n\\n Not even for Xander.\\n\\n CHAPTER 22\\n\\n A few days later, I sit in Language and Literacy, staring at the instructor as she talks about the importance of composing succinct messages when communicating via port. Then, as if to il ustrate her point, one such message comes through the main port in the classroom.\\n\\n “Cassia Reyes. Procedural. Infraction. An Official wil arrive to escort you shortly.” Everyone turns to look at me. The room goes silent: students stop tapping on their scribes; their fingers stil ed. Even the instructor al ows an expression of pure surprise to cross her face; she doesn’t try to keep teaching. It’s been a long time since someone here committed an Infraction.\\n\\n Especial y one announced publicly.\\n\\n I stand up.\\n\\n In some ways, I am ready for this. I expect it. No one can break as many rules as I have and not get caught somehow, sometime.\\n\\n I gather my reader and scribe, dropping them into my bag with my tablet container. It seems very important, suddenly, to be ready for the Official.\\n\\n For I have no doubt which Official wil come this time. The first one, the one from the greenspace near the game center, the one who told me everything would be al right and nothing would change with my Match.\\n\\n Did she lie to me? Or did she tel the truth, and my choices made a lie of her words?\\n\\n The teacher nods to me as I leave the room, and I appreciate this simple courtesy.\\n\\n The hal is empty, long, the floor slick-surfaced from a recent cleaning. Yet another place where I cannot run.\\n\\n I don’t wait for them to come for me. I walk down the hal , setting my feet precisely on the tile, careful, careful, not to slip, not to fal , not to run while they are watching.\\n\\n She is there in the greenspace next to the school. I have to walk across the paths to sit on another bench under her eye. She waits. I walk.\\n\\n She does not stand to greet me. When I come close to her, I do not sit down. It’s bright out here, and I squint my eyes against the white of her uniform and the metal of the bench, both dazzling, sharp, crisp in the sunlight. I wonder if she and I see things differently now that we don’t just see what we hope to see.\\n\\n “Hel o, Cassia,” she says.\\n\\n “Hel o.”\\n\\n “Your name has come up lately in several Society departments.” She gestures for me to sit. “Why do you think that is?” There could be any number of reasons, I think to myself. Where do I begin? I’ve hidden artifacts, read stolen poems, learned how to write. I’ve fallen in love with someone who’s not my Match and I’m keeping that fact from my Match.\\n\\n “I’m not sure,” I say.\\n\\n She laughs. “Oh, Cassia. You were so honest with me the last time we talked. I should have known it might not last.” She points at the spot on the bench next to her. “Sit down.”\\n\\n I obey. The sun shines almost directly overhead, the light unflattering. Her skin looks papery and misted with sweat. Her edges seem blurred, her uniform and its insignia smal , less powerful than the last time we talked. I tel myself this so that I won’t panic, so that I won’t give anything away, especial y Ky.\\n\\n “There’s no need to be modest,” she says. “Surely you have some idea of how wel you performed on your sorting test.” Thank goodness. Is that why she’s here? But what about the Infraction?\\n\\n “You have the highest score of the year. Of course, everyone is fighting to get you assigned to their department for your vocation. We in the Match Department are always looking for a good sorter.” She smiles at me. Like last time, she offers relief and comfort, reassurance about my place in the Society. I wonder why I hate her so much.\\n\\n In a moment I know.\\n\\n “Of course,” she says, her tone now touched with what sounds like regret, “I had to tel the testing Officials that, unless we see a change in some of your personal relationships, we would be averse to hiring you. And I had to mention to them that you might also be unfit for other sorting-related work if these things keep up.”\\n\\n She doesn’t look at me as she says al of this; she watches the fountain in the center of this greenspace, which I suddenly notice has run dry. Then she turns her gaze on me and I feel my heart racing, my pulse pounding clear to my fingertips.\\n\\n She knows. Something, at least, if not everything.\\n\\n “Cassia,” she says kindly. “Teenagers are hot-blooded. Rebel ious. It’s part of growing up. In fact, when I checked your data, you were predicted to have some of these feelings.”\\n\\n “I don’t know what you’re talking about.”\\n\\n “Of course you do, Cassia. But it’s nothing to worry about. You might have certain feelings for Ky Markham now, but by the time you are twenty-one, there is a ninety-five percent chance that it wil al be over.”\\n\\n “Ky and I are friends. We’re hiking partners.”\\n\\n “Don’t you think this happens quite often?” the Official says, sounding amused. “Almost seventy-eight percent of teenagers who are Matched have some kind of youthful fling. And most of those occur within the year or so after the Matching. This is not unexpected.” I hate the Officials the most when they do this: when they act as if they have seen it al before, as if they have seen me before. When real y they have never seen me at al . Just my data on a screen.\\n\\n “Usual y, al we do in these situations is smile and let things work themselves out. But the stakes are higher for you because of Ky’s Aberration status. Having a fling with a member of Society in good standing is one thing. For the two of you, it’s different. If things continue, you could be declared an Aberration yourself. Ky Markham, of course, could be sent back to the Outer Provinces.” My blood runs cold, but she isn’t finished with me yet. She moistens her lips, which are as dry as the fountain behind her. “Do you understand?”\\n\\n “I can’t quit speaking to him. He’s my hiking partner. We live in the same neighborhood—” She interrupts me. “Of course you may talk with him. There are other lines you should not cross. Kissing, for example.” She smiles at me. “You wouldn’t want Xander to know about this, would you? You don’t want to lose him, do you?” I am angry, and my face must show it. And what she says is true. I don’t want to lose Xander.\\n\\n “Cassia. Do you regret your decision to be Matched? Do you wish that you had chosen to be a Single?”\\n\\n “That’s not it.”\\n\\n “Then what is it?”\\n\\n “I think people should be able to choose who they Match with,” I say lamely.\\n\\n “Where would it end, Cassia?” she says, her voice patient. “Would you say next that people should be able to choose how many children they have, and where they want to live? Or when they want to die?”\\n\\n I am silent, but not because I agree. I am thinking of Grandfather. Do not go gentle.\\n\\n “What Infraction have I committed?” I ask.\\n\\n “Excuse me?”\\n\\n “When they cal ed me out of school over the port, the message said I’d committed an Infraction.” The Official laughs. Her laugh sounds easy and warm, which makes a shiver of cold prickle my scalp. “Ah, that was a mistake. Another one, it seems. They seem to keep happening where you are concerned.” She leans a little closer. “You haven’t committed an Infraction, Cassia. Yet.” She stands up. I keep my eyes on the dry fountain, wil ing the water back to it. “This is your warning, Cassia. Do you understand?”\\n\\n “I understand,” I say to the Official. The words are not entirely a lie. I do understand her, on some level. I know why she has to keep things safe and stable and some part of me respects that. I hate that most of al .\\n\\n When I final y meet her gaze, her expression is satisfied. She knows she’s won. She sees in my eyes that I won’t risk making things worse for Ky.\\n\\n “There’s a delivery for you,” Bram tel s me when I arrive home, his face eager. “Someone brought it by. It must be something good. I had to have my fingerprint entered in their datapod when I accepted it.”\\n\\n He fol ows me into the kitchen where a smal package sits on the table. Looking at the pulpy brown paper wrapped around it, I think how much of Ky’s story he could put on those pages. But he can’t do that anymore. It’s too dangerous.\\n\\n Stil , I can’t help but open the paper careful y. I smooth it out neatly, taking my time. This almost drives Bram crazy. “Come on! Hurry up!” Deliveries don’t happen every day.\\n\\n When Bram and I final y see what’s in the package we both sigh. Bram’s is a sigh of disappointment and mine is a sigh of something else I can’t quite define. Longing? Nostalgia? \\n\\n","sourceLink":"https://allnovel.net/matched-matched-1/page-29.html","bookId":1643,"book":{"id":1643,"title":"Matched (Matched #1)","description":"Storyline: Matched (Matched #1) \\n Cassia has always trusted the Society to make the right choices for her: what to read, what to watch, what to believe. So when Xander\u0027s face appears on-screen at her Matching ceremony, Cassia knows with complete certainty that he is her ideal mate... until she sees Ky Markham\u0027s face flash for an instant before the screen fades to black. \\n The Society tells her it\u0027s a glitch, a rare malfunction, and that she should focus on the happy life she\u0027s destined to lead with Xander. But Cassia can\u0027t stop thinking about Ky, and as they slowly fall in love, Cassia begins to doubt the Society\u0027s infallibility and is faced with an impossible choice: between Xander and Ky, between the only life she\u0027s known and a path that no one else has dared to follow.\\n","cover":"https://allnovel.net/images/matched-matched-1.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/matched-matched-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:33:42 PM"}}
