{"id":98443,"no":7,"title":"Page 7","content":"“He’s staying with the Markhams, then,” my father said. “They’ve adopted him,” I told my parents. “He cal s Aida his mother and Patrick his father. I heard him.” My parents exchanged glances. Adoptions were and are virtual y unheard of in our Province of Oria. We heard a knock on the door. “Stay here, Cassia,” my father said. “Let us see who it is.” I waited back in the kitchen, but I heard Xander’s father, Mr. Carrow, at the door, his deep loud voice booming through the foyer. We aren’t al owed to go into one another’s residences, but I could imagine him standing there on the steps, looking like an older version of Xander. Same blond hair. Same laughing blue eyes. “I talked with Patrick and Aida Markham,” he said. “I thought you’d want to know. The boy is an orphan. He’s from the Outer Provinces.” “He is?” My mother’s voice held a note of concern. The Outer Provinces are on the geographic fringe of the Society where life is harder and wilder. Sometimes people refer to them as the Lesser Provinces, or the Backward Provinces, because they have so little order and knowledge there. There’s a higher concentration of Aberrations there than in the general populace. And even Anomalies, some say. Though no one knows for certain where the Anomalies are. They used to be kept in safe houses, but many of those stand empty these days. “He’s here with ful Society approval,” Mr. Carrow said. “Patrick showed me the paperwork himself. He told me to tel anyone else who might be concerned. I knew you’d be worried, Mol y, and you, too, Abran.” “Wel , then,” my mother said, “it sounds al right.” I edged around the corner to look into the foyer, where my parents’ backs were to me and Xander’s father stood on the steps with the night behind him. Then Xander’s father dropped his voice, and I had to listen closely to hear what he said over the low hum of the port in the foyer. “Mol y, you should have seen Aida. And Patrick. They seemed alive again. The boy is Aida’s nephew. Her sister’s son.” My mother’s hand went up to her hair, a gesture she always made when she was uncomfortable. Because we al remembered vividly what had happened to the Markhams. It was a rare case of government failure. A Class One Anomaly should never have been unidentified, let alone al owed to roam the streets, to sneak into the government offices where Patrick worked and where his son was visiting him that day. We al kept quiet about it, but we al knew. Because the Markham boy was gone, murdered while he waited for his father to come back from a meeting elsewhere in the building. Because Patrick Markham himself had to spend time being healed, since the Anomaly waited in the office, quiet, and attacked Patrick, too. “Her nephew,” my mother said, her voice fil ed with empathy. “Of course Aida would want to raise him.” “And the government might feel like they owed it to Patrick to make an exception for him,” my father said. “Abran,” my mother said reproachful y. But Xander’s father agreed. “It’s logical. An exception as recompense for the accident. A son to replace the one that they shouldn’t have had to lose. That’s how the Officials see it.” Later, my mother came to my room to tuck me in. With her voice soft like the blankets she settled around me, she asked, “Did you hear us talking?” “Yes,” I said. “The Markhams’ nephew—son—starts school tomorrow.” “Ky,” I said. “That’s his name.” “Yes,” she said. She bent down and her long blond hair swung over her shoulder and her freckles looked like stars scattered across her skin. She smiled at me. “You’l be nice to him, won’t you?” she asked. “And help him fit in? It might be hard to be new when everyone else belongs.” “I wil ,” I promised. As it turned out, her advice was unnecessary. The next day at Second School, Ky said hel o and introduced himself to everyone. Quiet and quick, he moved through the hal s; he told everyone who he was so that no one had to ask. When the bel rang, he disappeared into the groups of students. It was shocking how quickly he vanished. He was there one minute—separate and distinct and new—and then he became part of the crowd, as though he had done it al of his life. As if he had never lived anywhere but here. And that is how it’s always been with Ky, I realize now, looking back. We have always seen him swimming along the surface. Only that first day did we see him dive deep. “I have something to tel you,” I say to Grandfather as I pul up a chair next to him. The Officials didn’t keep me too long at the game center after I stepped on the tablets; I stil have enough time for a visit. I’m grateful, because this is the second-to-last time that I wil visit him. The thought makes me feel hol ow. “Ah,” Grandfather says. “Something good?” He sits by the window, as he often does at night. He watches the sun out of the world and the stars into it and sometimes I wonder if he watches the sun come up again. Is it hard to sleep when you know you are almost at the end? Do you not want to miss a moment, even those that would otherwise seem dul and unremarkable? In the night, the colors wash away; gray and black take over. Now and then a bright pinprick of light flashes as a street lamp lights up. The air-train tracks, dul in the daylight, look like beautiful glowing paths above the ground now that their evening lights have been turned on. As I watch, an air train rushes past, carrying people along in its white and lighted space. “Something strange,” I say, and Grandfather puts down his fork. He is eating a piece of something cal ed pie, which I have actual y never tasted, but it looks delicious. I wish that it weren’t against the rules for him to share his food with me. “Everything’s fine. I’m stil Matched to Xander,” I say. I’ve learned from the Society that this is the way to give news; reassurance first, al else after. “But there was an error with my microcard. When I went to view it, Xander’s face vanished. And I saw someone else.” “You saw someone else?” I nod, trying not to look too hard at the food on his dish. The flakiness of the sugared crust, which reminds me of crystals on an edge of snow. The red-stained berries smeared across the plate, ripe and surely ful of taste. The words I’ve said cling to my mind like the pastry does to the heavy silver fork. I saw someone else. “What did you feel, when you saw that other boy’s face come up on the screen?” Grandfather asks kindly, putting his hand on mine. “Were you worried?” “A little,” I say. “I was confused. Because I know the second boy, too.” Grandfather’s eyebrows curve in surprise. “You do?” “It’s Ky Markham,” I tel him. “Patrick and Aida’s son. He lives in Mapletree Borough, down the street from me.” “What explanation did the Official give you for the mistake?” “It wasn’t a mistake by the Society,” I say. “The Society doesn’t make mistakes.” “Of course not,” Grandfather says, his tone measured and even. “People do, though.” “That’s what the Official thinks must have happened. She thinks someone must have altered my microcard and put Ky’s face on there.” “Why?” Grandfather wonders. “She thinks it was some kind of cruel joke. Because,” I lower my voice even further, “of Ky’s status. He’s an Aberration.” Grandfather pushes out of his chair, knocking his tray to the ground. I’m surprised to see how thin he’s grown, but he stands straight as a tree. “There was a picture of an Aberration as your Match?” “Just for a moment,” I say, trying to reassure him. “But it was an error. Xander’s my Match. This other boy wasn’t even in the Matching pool at al .” Grandfather doesn’t sit down, even though I remain in my chair hoping to calm him, to make him see that this is al right. “Did they say why he was classified that way?” “His father did something,” I say. “It isn’t Ky’s fault.” And it isn’t. I know it, and Grandfather knows it. The Officials never would have al owed the adoption if Ky himself had been a threat. Grandfather looks at the plate where it clattered from the tray onto the floor. I move to pick it up, but he stops me. “No,” he says, his voice sharp, and then he bends creakily. As if he were made of old wood, an old tree, stiff wooden joints. He pushes the last pieces of food back onto the plate and then he looks at me with his clear eyes. Nothing stiff about them; they are alive, ful of movement. “I don’t like it,” he says. “Why would someone change your microcard?” “Grandfather,” I say. “Please, sit down. It’s a prank, and they’l find out who did it and take care of everything. An Official from the Matching Department said so herself.” I wish I hadn’t told him. Why did I think there would be comfort in the tel ing? But now there is. “That poor boy,” Grandfather says, his voice sad. “He’s been marked through no fault of his own. Do you know him wel ?” “We’re friendly, but we’re not close. I see him sometimes during free-rec hours on Saturdays,” I explain. “He received his permanent work position a year ago and so I don’t see him much anymore.” “And what is his work position?” I hesitate to tel Grandfather because it is such a dismal one. We were al surprised when Ky received such a lowly assignment, since Patrick and Aida are wel respected. “He works at the nutrition disposal center.” Grandfather makes a grimace. “That’s hard, unfulfil ing work.” “I know,” I say. I’ve noticed that, in spite of the gloves the workers wear, Ky’s hands are permanently red from the heat of the water, the machines. But he does not complain. “And the Official let you tel me this?” Grandfather asks. “Yes,” I say. “I asked her if I could tel one person. You.” Grandfather’s eyes gleam mischievously. “Because the dead can’t talk?” “No,” I say. I love Grandfather’s jokes, but I can’t joke back, not about this. It’s coming too quickly. I wil miss him too much. “I wanted to tel you because I knew you would understand.” “Ah,” Grandfather says, raising his eyebrows in a wry expression. “And did I?” Now I am laughing, a little. “Not as wel as I’d hoped. You acted like my parents would have, if I’d told them.” “Of course I did,” he says. “I want to protect you.” Not always, I think, raising my eyebrows back at him. Grandfather is the one who final y made me stop sitting at the edge of the pool. He joined us there one summer day and asked, “What is she doing?” “That’s what she always does,” Xander said. “Can’t she swim?” Grandfather asked, and I glared at him because I could speak for myself. He knew that.","sourceLink":"https://allnovel.net/matched-matched-1/page-7.html","bookId":1643,"book":{"id":1643,"title":"Matched (Matched #1)","description":"Storyline: Matched (Matched #1) Cassia has always trusted the Society to make the right choices for her: what to read, what to watch, what to believe. So when Xander\u0027s face appears on-screen at her Matching ceremony, Cassia knows with complete certainty that he is her ideal mate... until she sees Ky Markham\u0027s face flash for an instant before the screen fades to black. The Society tells her it\u0027s a glitch, a rare malfunction, and that she should focus on the happy life she\u0027s destined to lead with Xander. But Cassia can\u0027t stop thinking about Ky, and as they slowly fall in love, Cassia begins to doubt the Society\u0027s infallibility and is faced with an impossible choice: between Xander and Ky, between the only life she\u0027s known and a path that no one else has dared to follow.","cover":"https://allnovel.net/images/matched-matched-1.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/matched-matched-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:33:42 PM"}}
