{"id":10387,"no":1,"title":"INTRODUCTION.","content":"The book here presented is the result of an attempt to correct existing errors relative to the Yosemite Valley. It was originally designed to compress the matter in this volume within the limits of a magazine article, but this was soon found to be impracticable; and, at the suggestion of Gen. C. H. Berry, of Winona, Minnesota, it was decided to “write a book.” \\n\\n \\n\\n This, too, proved more difficult than at first appeared. \\n\\n \\n\\n Born in Rochester, New York, in 1824, and carried to Western wilds in 1833, the writer’s opportunities for culture were limited; and in this, his first attempt at authorship, he has found that the experiences of frontier life are not the best preparations for literary effort. Beside this, he had mainly to rely upon his own resources, for nothing could be obtained in the archives of California that could aid him. It was not deemed just that California should forget the deeds of men who had subdued her savages, and discovered her most sublime scenery. Having been a member of the “Mariposa Battalion,” and with it when the Yosemite was discovered, having suggested its name, and named many of the principal objects of interest in and near the valley, it seemed a duty that the writer owed his comrades and himself, to give the full history of these events. Many of the facts incident thereto have already been given to the public by the author at various times since 1851, but these have been so mutilated or blended with fiction, that a renewed and full statement of facts concerning that remarkable locality seems desirable. 10 \\n\\n \\n\\n While engaged upon this work, the writer was aided by the scientific researches of Prof. J. D. Whitney, and by the “acute and helpful criticism” of Doctor James M. Cole of Winona, Minnesota. \\n\\n \\n\\n Since the publication of the second edition of this book, and an article from the author’s pen in the Century Magazine for September, 1890, numerous letters of approval from old comrades have been received, and a few dates obtained from old official correspondence that will now be introduced. \\n\\n \\n\\n In addition to what may properly belong to this history, there have been introduced a few remarks concerning the habits and character of the Indians. This subject is not entirely new, but the opinions expressed are the results of many years acquaintance with various tribes, and may be useful. \\n\\n \\n\\n The incidental remarks about game will probably interest some. To the author, the study of nature in all its aspects has been interesting. \\n\\n \\n\\n The author’s views regarding the gold deposits and glaciers of the Sierras are given simply as suggestions. \\n\\n \\n\\n His especial efforts have been directed to the placing on record events connected with the discovery of the Yosemite, for description of its scenery he feels to be impossible. In reverent acknowledgment of this, there are submitted as a prologue, some lines written while contemplating the grandeur of his subject. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1925/55318.html","bookId":882,"book":{"id":882,"title":"Discovery of the Yosemite","description":"简介： The book here presented is the result of an attempt to correct existing errors relative to the Yosemite Valley. It was originally designed to compress the matter in this volume within the limits of a magazine article, but this was soon found to be im...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1925","creation":"Aug 1, 2019 12:23:47 AM","modification":"Aug 1, 2019 12:23:47 AM"}}
