{"id":111435,"no":18,"title":"Page 18","content":"\\n\\n He knew Niki had been teasing him the day before about being his pet, trying to get his mind off his pain, but he really had no idea what his new life as Niki’s mate would be like. He knew it would be exciting, and passionate, and probably contentious, but he didn’t know exactly what to expect and the not knowing was taking its toll on his nerves. He loved Niki—his mother had made him admit it— but he wasn’t sure if he wanted Niki to know how much he loved him. He thought that Niki might use it against him in some way. Still, he yearned for him. He should never have allowed his mother to keep them apart the night before. His balls were aching at the thought of the big Lycan. He needed to speak to Niki and have him tell him it would be all right.\\n\\n “Enough, mother, please!” Jagger said, pulling away and standing with his hands on his hips. “It’s almost time.”\\n\\n “All right, darling. Let’s go. I believe your Niki is waiting for you in the throne room.”\\n\\n Jagger took a deep breath, trying to calm his nerves. He gave his mother his arm and they walked slowly together down the corridors to the great hall. Jagger saw Niki right away, standing by the throne. He was wearing much the same clothing he’d worn the day before—black pants, boots and sweater, though the clothing he wore was clean, and his boots looked shiny and freshly polished. He’d taken pains with his hair as well, and it was pulled back neatly. He looked devastatingly handsome, and made Jagger a little weak in the knees.\\n\\n Jagger escorted his mother to her seat and then turned, squaring his shoulders to walk to Niki. When he got to within a few steps of him, Niki held out his hand. Jagger gratefully clutched the lifeline and allowed Niki to pull him to his side. Glancing up at his mate, he saw Niki’s normally wine-colored eyes almost black as he regarded him, and Jagger nervously dropped his gaze.\\n\\n The minister came forward and the ceremony began. Through it all, Jagger clung to Niki’s hand, but couldn’t get the courage to look directly up at him. When it came time for the vows, Niki spoke in a clear, firm voice, but Jagger’s voice was soft and low. When it was over, Niki squeezed his hand and they turned to face their families. Konnor jumped to his feet and reached them first, clapping Niki on the back. “Am I allowed to kiss him and welcome him to the family?”\\n\\n Niki grabbed Jagger around the waist and hauled him to his side. “What do you think?” he snarled at his cousin, who only laughed good-naturedly and settled for a handshake.\\n\\n The next hour or so passed quickly and soon they were preparing to climb aboard the transport that would take them to the ship. His mother cried and patted his cheek, and his father shook hands with Nikolai solemnly as the servants followed with his trunks.\\n\\n “Four trunks, Nikolai?” Lucas said with a grin. “You’ll have to add on a room for his clothes.”\\n\\n “If Nikolai ever lets him wear any…” Larsson said, laughing.\\n\\n Once on the transport, Jagger sat quietly looking out the window at the last glimpses he might have of his homeland for a long time. Nikolai had promised his mother he’d bring him home for regular visits, but he didn’t know when he’d see his homeland again. He’d been flinching a little all morning at the Lycans’ jokes and innuendos. Actually, he wasn’t altogether certain they were joking. Niki’s solid bulk next to him should have comforted him, but he had to admit to being frightened. What if Niki decided to punish him for the way he’d treated Niki when he first arrived on the planet? And despite the fact that his mother insisted on marriage between them, what was there to prevent Niki from sending him home in a few months? After he tired of him? Niki said he wouldn’t, but maybe he’d only said all that to appease Jagger’s mother. Jagger didn’t even realize he was wringing his fingers until Niki put a big hand over his to stop him. Jagger looked up at him in surprise, and then quickly dropped his gaze as he saw an unreadable expression on his face.\\n\\n “When we get on board, take what you need for a few days, and put it in one trunk. We can leave the rest below decks.”\\n\\n Jagger nodded. “The big black one has my clothes and most of my things I use every day in it,” he said softly. Niki nodded. When they got to the docks he hoisted it to his shoulders, turning to go down the corridor, while his brother Kyle directed the men to leave the others in the cargo hold. Niki’s other family members had gone ahead, giving them some privacy, and Niki and Jagger were both being very careful with each other and speaking only of practical matters. Once Niki put the trunk inside his rooms he turned to Jagger and smiled politely, with no trace of his former rancor, but no trace of his former cockiness and playfulness either. “I’ll leave you to get settled in, while I go check on everything with Lucas. I’ll be back soon and bring you something to eat—you must be starving.”\\n\\n “All right,” Jagger agreed and wandered over to sit on the bed, looking down forlornly at his trunk. Niki hesitated only a second or two longer, seeming as if he wanted to say something, but changing his mind and taking off down the hall.\\n\\n Jagger sat on the bed and thought about what had happened in his life in so short a time. He was a Lycan mate, and he knew very well now what that entailed. What he didn’t know was whether or not Niki was happy he was mated to him. There were times over the past few days when he didn’t seem so sure—much different from the beginning, when he had been so loving and so playful. He wanted that Niki back. What had changed? Why did he seem so different? Was it possible that Niki hadn’t changed at all, but that Jagger himself had created this new, colder version of Niki? If so, he had to find a way to undo it. He had to find a way to bring that old Niki back. An idea occurred to him and for the first time in that long day, a little smile lit his face. Niki would return soon with dinner, and he had to be ready for him. He got up off the bed and began to unwind the length of cloth from his body.\\n\\n * * * * Nikolai carefully opened the door and backed inside the room, carrying Jagger’s dinner tray. He had forced himself to give Jagger plenty of time to get used to things, when all he’d wanted to do was take him to bed. He didn’t want to frighten him anymore than he was already. He’d seen him wringing his hands in the transport, and it had torn at his heart. Ever since he’d seen him walking down the aisle toward him, looking nervous and beautiful and scared to death, his protective nature had been on high alert. He had his mate now and he would never let him go—but first he had to win him over and make him want to be his mate. Forcing him to stay, no matter what the agreement said, would be intolerable.\\n\\n Putting the tray down by the door, he turned and froze in his tracks. Jagger was kneeling by the foot of the bed, stark naked, his beautiful skin gleaming in the lamplight, a silver collar wrapped around his neck.\\n\\n “Uh…Jagger…?”\\n\\n “You will please address me by my proper name. It is Prince Jagger Evanolite Goolrick of the Jayronian Kingdom, mate of Nikolai Balanescu of Lycanus 3.” Nikolai leaned against the door frame, afraid his legs wouldn’t hold him up properly. Remembering their exchange that first night they’d been together—recalling every word they’d said to each other, he cleared his throat. “What a mouthful…I think I shall call you Princeling.”\\n\\n Jagger smiled shyly at him. “You can call me anything you like…sweetheart.” Nikolai caught his breath, knowing he was echoing his own words to Jagger the first night he’d spent with his prince. Reversing their roles, he smiled softly. “My name is Nikolai, but you will address me as ‘Master.’ You will give me proper respect from this time forward or I’ll beat you. Do you understand?”\\n\\n “Yes, I understand. You want me to call you master.”\\n\\n “Well?”\\n\\n “Well what?”\\n\\n Nikolai’s voice was low and soft. “Address me as master.”\\n\\n “Master…I am very hungry. Can you feed me?”\\n\\n “I’ll feed you, if you can behave. From now on, you’ll do as I command. If you disobey or cause me any problems, you’ll be punished. If you’re good, and obey my commands, you’ll be well treated. Do you understand?”\\n\\n Jagger nodded, raising his eyes so his mate could see the desire raging in them. Nikolai had a powerful urge to pull his mate up in his arms, and it was taking everything in him not to act on it. Jagger raised his eyes and caught Nikolai’s gaze. “Yes…Master.”\\n\\n Nikolai walked back to the bed on shaky legs and held out a hand, palm up. Jagger took his hand, and rose gracefully to stand beside his mate. “There’s no use resisting, Princeling.” Nikolai said. “I’ll be a kind master, so long as you obey me. Come with me, Princeling, and I’ll feed you.”\\n\\n Nikolai pulled him over to the table where he’d left the food. The prince’s erection bobbed and bounced against his stomach, almost driving Nikolai mad. “Kneel beside me and I’ll feed you.”\\n\\n Jagger dropped to his knees, keeping his face lowered. His erection was rigid and his balls were drawn up tight to his body.\\n\\n “Are you all right?” Nikolai asked.\\n\\n “I’m hungry, Master,” Jagger said quietly. Nikolai picked up a small morsel from the plate and held it next to Jagger’s lips. Jagger looked up at him with a wicked smile and engulfed his fingers with his lips, licking at the underside with his tongue and then sitting innocently back on his heels, gazing up at Nikolai from under his long eyelashes.\\n\\n Barely able to speak, Nikolai took a deep breath and managed to choke out the words. “Are you being insolent, Princeling?”\\n\\n Jagger looked up at him and smiled. “No, Master. I’m just so hungry. For you…”\\n\\n Nikolai bent over and picked him up in his arms, making it to the bed in one or two long strides. He put Jagger on the bed and stopped long enough to tear his own clothes off before diving in on top of him, and covering his lips with his own. The Lycan howling in his mind intensified as he pinned his mate in place with his arms over his head. He bent his head to Jagger’s throat, intent on claiming him again, needing to mark him as his own after so many days apart. His fangs, needle sharp, sank deeply into Jagger’s neck as he writhed beneath him, his excitement obvious from the rock hard erection digging into Nikolai’s stomach. Jagger squirmed beneath him as he drew his sweet tasting blood into his mouth, and Jagger moaned loudly, only spurring Nikolai on. He could feel Jagger coming beneath him, the hard pulsing of his seed plastering their bodies together, but he was a long way from being finished with his sweet mate. He turned him over, frantic with his need, he scooped up Jagger’s cum from his stomach to spread on Jagger’s hole and Nikolai’s own cock. Unable to wait any longer, he thrust his cock inside, impaling him hard and deep with each thrust of his hips. \\n\\n","sourceLink":"https://allnovel.net/the-alpha-s-concubine-love-slaves-of-the-alphas-2/page-18.html","bookId":1592,"book":{"id":1592,"title":"The Alpha\u0027s Concubine (Love Slaves of the Alphas #2)","description":"Storyline: The Alpha\u0027s Concubine (Love Slaves of the Alphas #2) \\n When Nikolai Balenescu and his brother stop by a small, out of the way planet called Jayron to deliver some goods, they have no idea what’s in store for them. Nikolai is immediately attacked by a fierce, gorgeous little prince named Jagger, who takes the Lycan shifter away in chains. Nikolai allows himself to be disarmed because he instantly recognizes the prince as his mate, and he’s willing to play along until he can figure out why his ship was attacked and how he’s now going to save his prince from his fearsome Lycan family who will be coming for him, intent on revenge. Meanwhile, Prince Jagger decides he’ll take the gorgeous Lycan as his love slave and puts him in chains. At first Nikolai is angry, but soon decides that being a love slave to his beautiful mate is an idea he’s only too happy to go along with.\\n","cover":"https://allnovel.net/images/the-alpha-s-concubine-love-slaves-of-the-alphas-2.jpg","author":"Shannon West","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-alpha-s-concubine-love-slaves-of-the-alphas-2.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:24:12 AM"}}
