{"id":81915,"no":18,"title":"Page 18","content":"“Sorry, MiShaun.” I make no attempt to come up with an excuse, having overplayed the lack-of-caffeine defense, when the actual reason has nothing to do with drinkable stimulants. I can’t get that kiss out of my head. Plus, before we kissed, he’d just come from Brooke’s room. I have no idea what he was doing with her, even if I did shove that thought out of my head before we kissed. “I was going to see if you wanted to go over lines, but if you need to zone out, far be it from me to intrude…” She looks curious. I must be more distracted than I thought. “No, I’m fine, just… a lot to think about lately, with my parents still here.” The truth is, I’ve all but forgotten they’re here. “I guess we aren’t doing the mall scenes this week?” “I heard they’re holding off until next week to do mall scenes, since Graham’s in them.” “Oh, yeah, Graham…” I say this as though I haven’t been thinking of him all day. My finger traces circles on the table. “Why did he leave Austin? Did anyone say?” “I heard family thing in New York.” I feel instantly guilty. “What kind of family thing?” MiShaun shrugs, shuffling through sides. “I’m sure we’ll get the story when he gets back.” I have all the emotional weight of a ping pong ball, flying back and forth between my own feelings for Reid and Graham, nevermind what either of them feels. On the surface, Reid is paying attention to no one but me, while Graham is often occupied with Brooke. Reid is a known player and Graham—who knows what he’s doing? Last night, he went from Brooke’s room straight to mine, and like an idiot I let him kiss me. This should be clear-cut… but the kiss last night felt so right. And then Graham disappeared this morning and everything is more confused than ever. “MiShaun? You’re pretty good at giving advice…” “You need more? Shoot, baby.” I swallow. “Okay. So… how do you know whether to follow logic or intuition? I mean, when something looks like one thing, but feels like another—how do you know which is the truth?” She puts the pages down and levels a look at me. “Is this about Reid?” “What? No, just a general question, not relating to anyone in particular.” Just two anyones. I should be crossing my fingers under the table. She presses her lips together, a crease forming on her forehead. Finally, she sighs. “Sometimes, you just can’t tell. But I’ll say this, if what looks like the facts of the matter are conflicting with your feelings, then you need more information before deciding.” “Even if your feelings seem really sure of themselves?” I ask, knowing the answer. “Especially then.” She narrows her eyes at me, one eyebrow raised. “You sure this isn’t about Reid? Because this seems like the sort of questions a girl would start asking herself after being kissed senseless by him.” “We haven’t—I didn’t—” “Mmm-hmm.” “So I noticed you being dropped off at the hotel Monday night,” I blurt out. “And the driver looked sorta familiar…” Emily calls this redirecting the subject. She’s a big fan of this tactic when losing an argument with her mom. “MiShaun, are you blushing?” “Don’t be ridiculous. My people do not blush.” She puts on her prim and proper face and I smirk at her, because she’s wrong about that. “Well. I’m obviously not as sneaky as I think.” “So what’s he’s like? What does he do?” “He’s a computer guy. I don’t know the details and I already told him not to bother trying to tell me, because I get disoriented if I have to do any more to my laptop than turn it on.” “Computer guy, huh?” I wonder vaguely if this ‘huh’ counts towards Graham’s tally. He isn’t here to rule on it, so I rule no. “Among other things.” A wistful smile crosses her face. “Such as?” “Now, Emma. You know I don’t kiss and tell.” “Right,” I say. “But you can ask me about kissing Reid Alexander.” As if on cue, Reid walks around the corner, stops and puts his hands on the back of the chair next to me. “What was that?” He smiles, and I know he overheard me. “Um, we’re just, uh…” “Going over lines,” MiShaun says, straightening the sheets and placing them between us. “What are you doing here, Mr. Alexander? This afternoon is a Lizbeth/Charlotte scene. And as much as the producers would like your pretty face in every shot they can squeeze you into, you are not in it.” “I had to discuss something with Richter. Also, there’s a concert tonight. It’s an LA band; I know the lead singer. He says we can come in the back way, separate from the crowd, and have our own cordoned-off area so the bodyguards can do their thing. You guys up for it?” I nod at MiShaun, and she says, “Sure, we’re in.” “Cool. We’re meeting in the lobby at eight to go get food, and the band goes on around ten.” He drums the top of the chair, blue eyes twinkling. “I’ll let you get back to… whatever you were discussing.” Chapter 21 REID “Party of seven for Alexander.” The hostess glances up, her expression morphing into the wide-eyed look I’m used to outside of LA or NYC. You’d think celebrities are imaginary beings, the way people react when they see us in public. Like aliens have landed, or Jesus has risen. My presence alone would have been enough for her, but the addition of whoever else she recognizes in the group renders her incapable of unstuttered speech. Brooke, MiShaun, Quinton, Tadd, Jenna and Emma are along for the ride. Graham, apparently, went home to New York last night, and I’m just so bummed about that. Not. I’m careful that there’s no overt touching between Emma and me, just grazes here and there—my hand at the small of her back from the car to the door of the restaurant, and again walking to the table. My arm across the back of her chair. Our shoulders and thighs pressing against each other intermittently while we’re all talking and interacting during dinner. If things go as planned, she won’t have to wait for the movie release to be famous, because everyone wants to know who I’m hooking up with. Paparazzi. Gossip rags and Internet sites. She’s going to have to get used to this—the way that people know who I am, and because of that, they think they know me. Fame is people screaming your name, loving you, hating you, all on a whim. When we arrive at the club, we use the band entrance Walt offered, rather than walk through the crowd. The hallways in the back are a cramped, dim maze, and I take Emma’s hand as we’re led through by the manager. We follow him to a restricted area, just off-stage, where we can sit and watch without being recognized or pestered. Bob and Jeff hover nearby. I love my fans, but I wish they’d fade off occasionally and let me live my life. I escort Emma to the front spot near the wall. The way the chairs are arranged, there’s no one behind us and no one in front of us of us—it’s private as possible. Quinton is next to me, and Brooke, of course, is as far from me as she can get. My arm is propped across the back of Emma’s chair as the warm-up band winds up their last set. The music is deafening, so there’s not a lot of talking. In between sets, Emma asks if I know any of the other band members. “I met the guitarist when I was hanging out with Walt in LA. The other guys, no.” “Cool,” she says. The music is hella good, and Walt is damned incredible. Girls gathered in front of the stage jostle for position in front of him, but he’s not staying in one place. He plays the whole audience, and everyone’s into it. The floor pulses with bass notes, sending waves of vibration up through my legs. I glance at Emma and she smiles, leans closer and says, “He’s amazing.” “I know, right?” My hand moves to her shoulder, kneading the muscles absently. She relaxes under my touch as my fingers slide through her hair at the base of her neck and the moment says now, now, now. When I lean in, twisting the brim of my Lakers cap to the back, she doesn’t pull away. Cradling her head against my shoulder, with the beat pounding through us and the weird sense of privacy provided by the smoky darkness and a few hundred people all focused elsewhere, I kiss her. There’s no script, no film crew, and this is unlike anything we’ve done on camera, where I have to do the leading man thing, choreographed for shadows and camera angles and a hundred other aspects of filming a scene. I slide my tongue across hers and deepen the kiss until I can taste her hesitation melting. When I pull away, her eyes open slowly, staring into mine. When we get back to the hotel, I deliver her to her room, kissing her once more, short and sweet—nothing like the kiss during the show—despite the pleasantly evil ideas of everything I’d like to do to her pounding through my head. My friend John will be in town tomorrow—he says he’s always wanted to visit Texas and he’s bored as hell in LA. That’s John. Too much money, too much time, no celebrity on his own. I think going out with me is like a drug for him—it’s like he’s famous, too, and he loves it. Guess he needs another hit. Tadd and I talked earlier today about going south for a couple of days to go tubing on the Guadalupe river. Disappearing for a couple of days would be a good idea, because this is how girls like Emma operate: they need just enough attention to let them know they’re on your mind. A text or two per day, just on edge of naughty, and she’ll be ready to go by Saturday. I think I might like this going slower thing. Emma All morning, I keep blushing for no apparent reason—every time I think of the fact that I’ve kissed two insanely hot guys in the last two days. I still haven’t heard from Graham. Reid sent me a text this morning wishing me good luck with filming today. His fans know where we’re filming, and they showed up early to stand just outside the barricades surrounding the house. But he isn’t filming today, so all but the most tenacious of them eventually trickled away. Chloe and my father are visiting the set this afternoon, and when their taxi arrives, there’s renewed excitement among the dozen or so fans until they exit. Chloe’s outfit today consists of skintight lowrise jeans, wedge heels, and a low-hanging peasant blouse that would look more appropriate on someone in high school. And I don’t mean someone who teaches high school. When I go outside to authorize them through set security, a couple of the fans holler, “Emma!” I turn and wave, surprised they know who I am. The afternoon’s schedule consists mainly of a scene including Tim Warner and Leslie Neale as Lizbeth’s parents, a fact that sends Chloe into insufferable enthusiasm overdrive. As Tim and Leslie are discussing the interaction they’ll be filming first, Chloe interrupts to tell them how she’s been a huge fan since she was a little girl. Tim stops talking, flabbergasted, and Leslie stares at Chloe for a moment before saying, “Thank you dear, and who are you?”","sourceLink":"https://allnovel.net/between-the-lines-between-the-lines-1/page-18.html","bookId":2739,"book":{"id":2739,"title":"Between the Lines (Between the Lines #1)","description":"Storyline: Between the Lines (Between the Lines #1) Reid Alexander is used to getting what he wants – and what he wants next is his newest costar, Emma Pierce. The universe is lining up nicely to grant his wish, until he’s confronted with two unexpected obstacles on location: a bitter ex-girlfriend and a rival for Emma’s affections. Emma Pierce just got her big break after years of filming commercials and made-for-TV movies. Winning the lead role in a wide-release film – opposite the very hot Reid Alexander – should be a dream come true. But Emma’s heart is hiding a secret fantasy: she wants to be a normal girl.","cover":"https://allnovel.net/images/between-the-lines-between-the-lines-1.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/between-the-lines-between-the-lines-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:37:45 PM"}}
