{"id":22393,"no":13,"title":"XII THE LITTLE SETTLEMENT","content":"There was a strong farmer one time and he was the boastfullest man in all Ireland. He had a tidy, comfortable place, sure enough, but to hear him speaking you’d be thinking his house was built of silver and thatched with the purest gold. \\n\\n \\n\\n Herself was a very different sort of a person, kindly and simple-hearted; she took no pleasure in making out she had more property and grandeur than another body; and she was neither envious, uncharitable, nor a clash. \\n\\n \\n\\n The two had but one child, a daughter, and she was their whole delight. Bride was a beautiful white girl with a countenance on her would charm a king from his golden [116]throne to be walking the bogs with herself. The boys were flocking after her by the score, and she had but to raise her hand to draw any one of them to her side. But, being a seemly, well-reared lass, she took her diversion without any consideration of marriage at all—well satisfied her father would be making a fitting settlement for her when the time came. \\n\\n \\n\\n The youth of the world will always be playing themselves and chatting together, all the while them that have right wit and a good upbringing do leave their settlement in the hands of the parents have the best understanding for the same. \\n\\n \\n\\n “I’m thinking,” says himself one evening, “that it’s old and stiff I am growing. It might be a powerful advantage to take a son-in-law into the place, the way I’d get sitting in peace by the hearth, and he out in the fields attending to the management of all.” \\n\\n \\n\\n “Bride is full young to be joining the world,” says his wife. “But I will not be putting any hindrance in the way of it, for maybe it’s better contented she’d be to have a fine man of her own, foreby to be looking [117]on an old pair like ourselves, and we dozing by the fire of an evening.” \\n\\n \\n\\n “I’ll be making a little settlement for her, surely,” says himself. \\n\\n \\n\\n The next day he gave out through the country that Bride was to be married. What with the little handful of money, the fine farm of land and the looks of the girl, the suitors were coming in plenty. There were strong farmers, small farmers, tradesmen and dealers; a cow doctor, a blacksmith, and evenly a man that travelled in tea. Himself was disgusted with all; he put out the farmers and dealers very civil and stiff, but the tea man he stoned down the road for a couple of miles. \\n\\n \\n\\n The next suitor to come was a beautiful young lad the name of Shan Alec. He was a tasty worker, and he had the best of good money was left him by his da. Now if you were to seek all Ireland ten times through, I’ll go bail you wouldn’t be finding a more suitable match nor Shan Alec and Bride. The girl and her mother were fair wild with delight, but they got an odious disappointment for didn’t himself run the poor boy out of the house. [118] \\n\\n \\n\\n “I’m surprised at you,” says the wife. “Why couldn’t you have wit and give that decent lad an honourable reception?” \\n\\n \\n\\n “Is it to give my daughter to yon country coley?” says he. “And I the warmest man in these parts.” \\n\\n \\n\\n “A better match for her like isn’t walking this earth,” says the wife. \\n\\n \\n\\n “Hold your whisht, woman,” says he. “I’d sooner let the devil have her than see her join the world with Shan Alec.” \\n\\n \\n\\n “What is on you at all to be speaking such foolishness?” asks herself. \\n\\n \\n\\n “I’d have you to know,” says he, “that I’ll have a gentleman for my son-in-law and no common person at all.” \\n\\n \\n\\n “It is the raving of prosperity is on you,” says she. “And that is the worst madness out.” \\n\\n \\n\\n “Speak easy,” says he, “or maybe I’ll correct you with the pot stick.” \\n\\n \\n\\n With that she allowed he be to be gone daft entirely, or he’d never have such an unseemly thought as to raise his hand to a woman. \\n\\n \\n\\n “Hold your whisht,” he answers. “Surely ’tis both hand and foot I’ll be giving you unless you quit tongueing.” [119] \\n\\n \\n\\n Not a long afterwards a splendid gentleman came to the house, and he riding on a horse. \\n\\n \\n\\n “I have heard tell,” says he to the farmer, “that you are seeking a suitable settlement for your daughter.” \\n\\n \\n\\n “If your honour wants a wife,” says himself. “Let you be stepping in, for it’s maybe in this house you’ll find her.” \\n\\n \\n\\n With that the gentleman got down off his horse, and it was an honourable reception they made him. Evenly herself was content to remember the scorn put on poor Shan Alec, when she seen the magnificent suitor was come. \\n\\n \\n\\n The gentleman had a smile on his face when he heard all the boasts of the farmer. \\n\\n \\n\\n “My good man,” says he, “I think scorn on your money and land, for I’d have you to know that I am a King in my own place. But that girl sitting by the hearth has a lovely white countenance on her, and her heart I am seeking for love of the same.” \\n\\n \\n\\n “Oh mother,” says Bride in a whisper, “will you send him away?” \\n\\n \\n\\n “Is it raving you are?” asks herself. \\n\\n \\n\\n “I’d go through fire and water for my poor Shan Alec!” says Bride. [120] \\n\\n \\n\\n “Will you hold your whisht,” says her mother. “That is no right talk for a well-reared girl.” \\n\\n \\n\\n The farmer and the gentleman made their agreement and opened the bottle of whiskey. There was to be a nice little feast for to celebrate the settlement, and the cloth was set in the parlour on account of the grandeur of the suitor and he not used to a kitchen at all. \\n\\n \\n\\n When the supper was served didn’t the servant girl call the mistress out to the kitchen. \\n\\n \\n\\n “Oh mam,” says she. “I couldn’t get word with you in private before. Let you hunt that lad from the place.” \\n\\n \\n\\n “And why, might I ask?” says herself. \\n\\n \\n\\n “Sure how would he be a right gentleman and he having a foot on him like a horse?” says the girl. \\n\\n \\n\\n With that the mistress began to lament and to groan. \\n\\n \\n\\n “What’ll I do! What’ll I do, and I scared useless with dread?” \\n\\n \\n\\n “I’ll go in and impeach him,” says the servant girl. \\n\\n \\n\\n In she went to the parlour. [121] \\n\\n \\n\\n “Quit off out of this,” says she. “We’ll have no horse feet in this place.” \\n\\n \\n\\n The master got up to run her from the room. \\n\\n \\n\\n “Look under the table at your lovely gentleman’s foot!” says she. \\n\\n \\n\\n The farmer done as she bid, but he was that set in his own conceit he just answers: \\n\\n \\n\\n “What harm is in a reel foot? It’s no ornament surely, but that’s all there is to it.” \\n\\n \\n\\n “Many’s the reel foot I’ve laid eyes on,” she says. “But yon is the hoof of a horse.” \\n\\n \\n\\n “It’s truth you are speaking,” says the gentleman. “I am the devil and no person less.” \\n\\n \\n\\n “Quit off from here,” says the servant. “A decent girl, like us two, need never be fearing your like. I’d hit you a skelp with the pot stick as soon as I’d stand on a worm.” \\n\\n \\n\\n “You can’t put me out,” says the devil. “For the man of the house has me promised his daughter.” \\n\\n \\n\\n “There is no person living,” says Bride, “might have power on the soul of another. If my sins don’t deliver me into your hand the word of my da is no use.” [122] \\n\\n \\n\\n “Then I’ll be taking himself,” says the devil, making ready to go. \\n\\n \\n\\n “You may wait till he’s dead,” cries the woman of the house. “He made you no offer of his bones and his flesh.” \\n\\n \\n\\n “The tongues of three women would argue the devil to death,” says he, and away with him in a grey puff of smoke. The man and woman of the house began for to pray. But says Bride to the servant: \\n\\n \\n\\n “Let you slip off to Shan Alec and bid him come up—for it’s maybe an honourable reception is waiting him here.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1800/52270.html","bookId":1054,"book":{"id":1054,"title":"Folk Tales of Breffny","description":"简介： Many of the stories in this volume were told by an old man who said he had more and better learning nor the scholars. The like of them, he declared, do be filled with conceit out of books, and the most of it only nonsense; tis myself has the real old...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1800","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
