{"id":22406,"no":26,"title":"XXV THE GANKEYNOGUE IN THE OAK CHEST","content":"There was once a man of these parts and he had a great longing for to find a treasure. \\n\\n \\n\\n It chanced one evening that he seen a gankeynogue in the field, sitting in under a bush, and he says: \\n\\n \\n\\n “Yon lad will surely be worth a powerful weight of gold.” \\n\\n \\n\\n With that he went over and caught a hold of the gankey. \\n\\n \\n\\n “Let you discover a treasure,” says he, “or else I’ll keep you like a dog on a chain from this out.” \\n\\n \\n\\n “Keep away!” says the gankey. “How would a poor creature like myself be finding treasure for a strong farmer!” [198] \\n\\n \\n\\n “Let you not let on to be miserable,” says the man, “for well I know it’s great wealth you enjoy.” \\n\\n \\n\\n “Is it me!” says the gankeynogue. “Sure I support a lengthy family entirely by my own industry.” \\n\\n \\n\\n But the farmer would not believe a word of the sort. He carried the gankey to his house and put him into a big oak chest. \\n\\n \\n\\n “You’ll never get out except for to show me where treasure is lodged,” he allows. \\n\\n \\n\\n But the gankeynogue wasn’t in notion of giving the least information. He sat up in the oak chest, hammering, shouting and singing until he had the people’s heads light. \\n\\n \\n\\n All the while the farmer was determined to get the better of him and he never agreed to let him go. \\n\\n \\n\\n The lad was his tenth day in the chest when the man of the house came running in that evening, shouting at the top of his voice: \\n\\n \\n\\n “Darragh fort’s on fire! Darragh fort’s on fire!” \\n\\n \\n\\n With that the gankey began the most woeful lamentations, and he hammering like mad to get out of the chest. \\n\\n \\n\\n “What ails you at all?” asks the farmer. [199] \\n\\n \\n\\n “My wife and family are in that place,” says the gankey. “Let me away to bring them safe from the fire.” \\n\\n \\n\\n “Will you show me a treasure?” asks the man. “Aye surely!” says the gankeynogue. “But let’s go first to Darragh fort to save my weak family, and then I’ll bestow the treasure.” \\n\\n \\n\\n So the two started off for Darragh fort, and it not on fire at all—that was a story the man was after inventing for to scare the gankeynogue. \\n\\n \\n\\n When they landed in sight of the place the man allowed the fire be to have burnt out. Didn’t the gankey make a run and lep in among the trees. \\n\\n \\n\\n “I’m safe from you now,” says he. \\n\\n \\n\\n But the man never let on to be vexed that he couldn’t see the lad any more, he listened to his voice speaking for to know the direction he went. Then he lay down in that part of the fort and let on to be asleep. \\n\\n \\n\\n After a while he heard the gankeynogue telling his wife about how he was kept in the chest. \\n\\n \\n\\n “I was ten days in that place,” says he. “And I full of venom against the farmer. [200]But it’s the cunning lad I am, for I never let on where the treasure is buried at all.” \\n\\n \\n\\n “Where is it?” asks the gankeynogue’s wife. \\n\\n \\n\\n “Under a stone in the street before his house,” says the gankey. “And herself tripped and spilled a bucket of milk just over the place this morning. I was looking out on a hole in the chest, and still I never let on one word when I seen what happened.” \\n\\n \\n\\n “You’re a wise little fellow, sure enough,” says his wife. \\n\\n \\n\\n The farmer got up and away home with him after hearing what they said. He asked herself where she spilled the milk at the morning of the day. \\n\\n \\n\\n “By that stone,” says she, setting her foot on a flag in the street. \\n\\n \\n\\n He brought the loy and a crowbar for to hoke up the place, and didn’t he discover a beautiful treasure of gold. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1800/52283.html","bookId":1054,"book":{"id":1054,"title":"Folk Tales of Breffny","description":"简介： Many of the stories in this volume were told by an old man who said he had more and better learning nor the scholars. The like of them, he declared, do be filled with conceit out of books, and the most of it only nonsense; tis myself has the real old...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1800","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
