{"id":107705,"no":19,"title":"Page 19","content":"\"It\u0027s more than that,\" he admitted, one hand sunk in her fawn-brown hair. \"It was the futility of it all. We had not enough supplies or money or troops, and so we lost. Belisarius has done more to hold on to Italy with less than anyone—\" \"Such as the Emperor?\" Olivia suggested. \"He promises, but nothing comes, or not enough, or not in time,\" he said uncomfortably. \"If he understood, if he knew, then he would not withhold what is needed.\" \"Perhaps,\" said Olivia. \"Or it may be that he wishes for his forces to manage with less.\" She said this as gently as she could, but it did not soften the blow that Drosos felt. \"The Emperor is not like that!\" He shoved her, almost throwing her off him. \"He has the Empire on his mind, and that is why he does not always comprehend what one part of it is up against. He in concerned for the welfare of everyone in the Empire and that often means that he faces conflicts. Even Belisarius knows this, for he has explained it to everyone who has served with him over the last years.\" \"And you believe as Belisarius does?\" said Olivia. \"Well, I am new to Byzantium, and it may be that as a Roman I do not have sufficient knowledge to judge what I see.\" Inwardly she knew better—that Justinian had decided to withdraw his support of his forces in Italy—but had no desire to argue with Drosos about it. \"Women never understand these matters,\" said Drosos. \"Although,\" he amended, \"you have a better grasp than many; it is your Roman heritage.\" \"No doubt,\" she concurred. Her hazel eyes grew distant. \"And I do miss Roma, more than I thought I would.\" \"Because it is your home,\" he said, doing his best to reassure her. \"You are like all of us; you would rather be in the place you know than among strangers. That\u0027s not surprising. No one could think that it is. No matter how much more opulent and beautiful Konstantinoupolis is, you will miss Roma, because it is where you were born.\" \"Yes,\" she said very slowly dragging out the word. \"Yes, Roma is my native earth, and for that reason alone it pulls me. And you do not know what it was like at the height of its grandeur. You can\u0027t imagine it, seeing it now. You don\u0027t know how glorious it was, once.\" \"But that was centuries ago, when the corrupt Caesars ruled,\" Drosos reminded her. \"The corrupt Caesars,\" she mused. \"Well, some of them were, certainly, but others only did their best, as you have done, as Belisarius does. You might not think so now, but many of those Caesars were as revered in their time as your Emperor Justinian is now.\" She shook her head as if to be free of her memories. \"Why are we dwelling on the past when the present is so much more enjoyable?\" He did not catch her mood quickly, but he did find a way to respond to her. \"I thought all Romans longed for the past.\" \"If we do, then we are great fools,\" she said roundly, doing her best to bring him out of the unhappiness that was taking hold of him. \"The past, no matter what it was, is over, and there is only the present. The future is still ahead, all unknown. We have what we have now.\" She kissed him on the earlobe. \"Haven\u0027t we.\" \"Possibly,\" he allowed. \"Oh, Drosos, pay attention,\" she said, this time tweaking the edge of his well-trimmed beard. \"How can I give you pleasure if your thoughts are in Roma with the army?\" \"I don\u0027t know,\" he growled, but there was the beginning of a smile in his eyes. \"Do, please, give me your attention. Let me show you all the delights you have missed—I trust you have missed them?—while we have been apart.\" She tossed her head and her long, loose hair trailed over his chest. \"You have returned to me and I want to know every joy with you.\" \"You\u0027re greedy, that\u0027s what it is,\" he told her, his expression less distant. \"You want to drain me.\" \"Hardly,\" she said, her face inscrutable. \"You do not understand what I want if that\u0027s what you think I\u0027m doing.\" \"All right, then; what is it you want of me?\" He had moved over her and had succeeded in pinning her shoulder to the couch. \"Tell me.\" \"I want you,\" she said directly. \"All of you, without ruse or deception.\" \"What?\" Her serious answer took him unaware and he released her, watching her with great curiosity. \"You asked me what I want: I\u0027ve told you.\" She remained unmoving. \"You want me?\" He spoke as if the words were unfamiliar and difficult. \"Yes.\" \"Why?\" She hesitated before she answered. \"Because you touch me, you reach something in me that has not been reached for many, many years.\" \"I wish you wouldn\u0027t do that,\" he complained softly. \"Do what?\" \"Keep talking as if you were as old as the sphinx,\" he said. \"All right, you\u0027re probably older than I am, but that doesn\u0027t mean you\u0027re my great-grandmother.\" Olivia chuckled but there was a sadness in her eyes. \"I\u0027ll try to remember that,\" she said in a remote way. \"There are times you\u0027re impossible,\" he said, and ended their disagreement with a long, deep kiss that left both of them breathless and wide-eyed. \"If I am what you want, then I\u0027m yours.\" He ran his fingers over the planes of her face, so lightly that she almost could not feel them. This time they made love easily, with less frenzy than before. The demand they felt grew more slowly, losing nothing in being less urgent than before. Drosos was willing to permit her to take the time she wanted to bring him to a level of arousal that astonished him, for until she did this, he was certain that he would never be more stimulated and eager than he had been when he first sought her. \"Lie back,\" she said as her hands traced patterns of desire through his body. \"There is no reason to press.\" He did as she told him, luxuriating in the endless subtle caresses and kisses she bestowed on him. He returned them, taking pride in the depth of her response to him. He had known enough women to realize that Olivia\u0027s desire was more profound than any he had encountered before, and that Olivia was more vulnerable to him than any woman he had taken to bed in the past. \"Your breast was made to fit my hand,\" he said, demonstrating. \"There are other parts that fit as well,\" she reminded him, her voice low. \"Oh, Kyrios,\" he murmured, his need for her intensifying even more. She drew him closer to her, her hands pressing him against the length of her body, and then into her. She arched to meet him, moving with him. The tang of him, the weight of him pervaded her senses and increased as their union deepened. This time when it was over neither spoke; they hardly moved. Each was replete with the other, each was gratified beyond all expectation. They lay together, not quite asleep, their arms around each other no longer straining but unwilling to part more than comfort demanded. \"Olivia?\" Drosos whispered, hardly more than a breath. \"Umm?\" \"What if the slaves find us?\" \"Niklos will bring a blanket,\" she said, drowsiness making her words slur. \"But you are a widow—\" \"I am a Roman,\" she corrected him. \"But if your slaves gossip, you might be criticized for what you… do with me.\" He brushed her hair back from her face. \"I don\u0027t want you to suffer on my account.\" She opened her eyes and studied his face. \"People will talk no matter what. As a Roman, I will be the subject of speculation. The worst they can say of me is that I have taken a Captain of the army as my lover. If they say any more, then we can worry about it then.\" She kissed him affectionately. \"How good of you to be concerned for me.\" \"Just as well that one of us is,\" he said, rousing himself enough to show his worry. \"If there are questions,\" she said as she smoothed the line that had deepened between his brows, \"you need only tell anyone who has the ill grace to speculate that I am bound by my husband\u0027s will to remain a widow.\" \"Are you?\" he asked, genuinely startled. \"No.\" She smiled sleepily. \"But many Roman women are, for reasons of property. There was a time when it was different, when…\" Her voice trailed off. \"That was long ago, and there is no point in recalling. It only serves to make me angry at things I cannot change.\" She stretched her one free arm and then rested it across his chest. \"If you say that I am obedient to my husband\u0027s will, no one will question it and you and I can continue as we are.\" \"But if it is a lie,\" he began only to have her stop him. \"Drosos, it is close enough to the truth that it does not matter. If you wish to remain my lover and you need some explanation, then this will do as well as any.\" He took her hand in his. \"And if I wish for more?\" \"You are an officer in the army and your life is not wholly your own. Wait a while before you decide that you want more of me.\" She did her best to conceal a yawn. \"In a year, if you think then that you need a different arrangement with me, we will talk about it. By then, you might prefer the way we are now.\"","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-19.html","bookId":2509,"book":{"id":2509,"title":"A Flame in Byzantium (Atta Olivia Clemens #1)","description":"Storyline: A Flame in Byzantium (Atta Olivia Clemens #1) Atta Olivia Clemens had received St. Germain\u0027s darkest gift. Would his love save her from the True Death? \"A skillful blend of history and fiction, given added spice by the fact that its heroine happens to be a 500-year-old vampire\".--Library Journal.","cover":"https://allnovel.net/images/a-flame-in-byzantium-atta-olivia-clemens-1.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:08:33 PM"}}
