{"id":107710,"no":24,"title":"Page 24","content":"\\n\\n \"General,\" said the rider, \"if there has been a misunderstanding, the Emperor is a just man and he will hear you out if you petition him.\"\\n\\n \"Yes, but he has already heard out others and anything I say will have little weight now. And that does not trouble me as much as his apparent conviction that I have not done my utmost to stop the advance of Totila, given the men and materiel at my disposal.\" He rubbed his fingers over his brow and pinched the bridge of his nose. \"That perturbs me. I have never had my loyalty and devotion questioned before. I don\u0027t know what to do to refute these charges.\"\\n\\n \"You could take Roma again,\" suggested the rider with a trace of sympathy.\\n\\n \"That is what I have been trying to do for months!\" the General burst out. \"Ask my men—not the officers, for they have not been on campaign long, but the cavalry and foot soldiers who have served with me since I came here—they will tell you that we have done everything possible under the circumstances. They know, because we have fought together.\"\\n\\n \"But you have lost ground. Roma is in the hands of the enemy and two ports are controlled by Totila\u0027s men.\" The rider stared at the peak of the tent. \"The Emperor has expressed his displeasure with good cause.\"\\n\\n \"Puppy,\" Belisarius chided. \"You\u0027ve been shaving for less than a year by the look of you, and you are trying to tell me that we have not fought with determination and valor. Go outside. Look at the men. Most of them are thin because they do not get enough to eat. Half-starved soldiers make poor warriors. Our cavalry is short of mounts and there are no remounts. We have few arrows for our archers, few lances and spears. Each man should have three swords but now the soldiers count themselves fortunate if they have two. Those are the obvious problems. There are others, less visible, that beset us more keenly than hunger.\"\\n\\n \"You will have supplies when Captain Hyperion joins you,\" the rider assured him. \"And there will be more men. He has brought also sixty horses.\"\\n\\n \"Sixty,\" scoffed Belisarius. \"All of sixty. Gracious.\" He laughed. \"Sixty will almost supply my men now. It will not begin to provide remounts. This is what I meant when I said that we have insufficient men and materiel.\"\\n\\n \"What of local farmers?\" asked the rider.\\n\\n \"Picked clean months ago, and no longer pleased to help us.\" Belisarius dropped back into his camp chair. \"We have scoured the countryside for food and mounts and equipment and slaves. At first the farmers and landholders were willing to aid us, thinking that we would give them protection and that we would be gone soon, but it has not turned out that way, and they are no longer willing to extend themselves for us. I don\u0027t blame them. We have treated them badly. Our men have foraged and raided as rapaciously as the barbarians, and they have excused themselves because it was done to benefit the ones they stole from. Now all the farmers want is for us to be gone.\"\\n\\n With a condemning shaking of his head the rider regarded Belisarius critically. \"You have not controlled your men as you should.\"\\n\\n \"If I had tried to control my men in the way you mean, they would have starved to death,\" countered Belisarius. \"It is an easy thing for a man with six slaves in the kitchen and a full larder to condemn what we\u0027ve done, but let him live with us and try to think himself satisfied on a handful of grain and a few pieces of boiled chicken, because that is what has been feeding my men for the last twelve days. For a while we had some fresh fruit as well, but the orchards are bare now.\"\\n\\n \"My uncle told me that you were using your men as an excuse to keep from waging battle.\"\\n\\n \"Your uncle, whoever he is, has no idea of what we have been enduring here,\" Belisarius informed the young man.\\n\\n \"My uncle is Captain Vlamos of the Imperial Guard,\" the rider said stiffly and with great pride. \"I am Linos, the second son of Linos Aristrades. Captain Vlamos is my mother\u0027s brother.\"\\n\\n \"A good family,\" said Belisarius. \"But none of them have set foot in Italy, and they can have no notion of what has transpired here.\"\\n\\n \"They are loyal to the Emperor and defend his cause.\"\\n\\n Linos declared, repeating a maxim.\\n\\n \"Yes. I am loyal and I defend him as well. Justinian wishes to restore the boundaries of the Roman Empire and that is the task he has set me. I have said from the first that if I do not succeed it not be for want of effort. If this campaign were not for the Emperor, I would have abandoned it long ago; but since it is Justinian who commands me, I will do everything I am able for as long as there is breath in my body to bring his vision to fruition.\" He set the second scroll with the first. \"I might as well read this last one.\"\\n\\n The scroll from the Court Censor was not as long as the other, but it contained a number of questions that the Censor requested Belisarius answer, most of them having to do with statements the General had made that might be construed as being against the wishes and orders of the Emperor. Belisarius flung the thing aside impatiently. \"It\u0027s nonsense.\"\\n\\n Linos stared in surprise. \"The Censor does not deal in nonsense.\"\\n\\n \"In this instance he does,\" said Belisarius. \"It can\u0027t be serious.\" He rose, stretching. \"There is food of a sort, and you\u0027re welcome to eat with me, but I warn you that the fare is limited and there isn\u0027t very much of it.\"\\n\\n \"I brought my own provisions,\" Linos said sulkily. \"I will not have to deprive anyone of a mouthful of grain.\"\\n\\n Belisarius gave the young man a hard stare. \"If that is your state of mind, you had better remain in this tent. My men are not going to be very tolerant of such temperament. Nor am I, for that matter.\"\\n\\n \"I didn\u0027t mean…\"He flushed. \"If my supplies would be of help, you\u0027re welcome to them.\" There was a grudging tone to this offer, but Belisarius decided to ignore it.\\n\\n \"Fine. Get whatever you have and give it to my slave Iakis. He\u0027s the tall fellow with the pockmarked face and a wedge-shaped scar on his shoulder.\" He held the flap of the tent up. \"After we eat, I will confer with my officers.\\n\\n You may join us if you wish. They will be relieved to hear your news.\"\\n\\n Linos scowled, uncertain whether he was being mocked or not. \"What use is that?\"\\n\\n \"I don\u0027t know yet,\" Belisarius admitted. \"But between your news, which will lift their spirits, and your current information they may be satisfied that the last year has not been in vain.\" He squinted against the sunlight, averting his head a moment. \"Most of them are around that fire, over there. I used to spread my officers through the camp, but now, with so many unfamiliar faces, I need to keep them all in one place.\"\\n\\n \"Don\u0027t you trust them?\" asked Linos, shocked.\\n\\n \"Not the way you might think; I do not know them well enough to rely on them without question. I don\u0027t know which of these officers reacts too quickly, which too slowly. I don\u0027t know who among them is best at night, and who is best before midday. I don\u0027t know if one of them is afraid of confinement, or fire, or serpents. I don\u0027t know who has a way with horses, or dogs, or peasants. I don\u0027t know which of them speaks Latin.\" He walked as he enumerated his points, pausing now and then to nod or wave to his soldiers. \"For that reason, I require my officers to stay near me.\"\\n\\n \"Doesn\u0027t this irritate them?\" Linos inquired.\\n\\n \"Not most of them, no, because they are as new to me as I am to them, and there are several of them who have never been on campaign before.\" He indicated the large fire surrounded by tents, most of them with slaves stationed in front of them. \"This is where they are. You can see for yourself that half of them have new gear that has not seen much use. What they lack are horses to carry it, but that is another matter, isn\u0027t it?\"\\n\\n Four officers hastened forward as Belisarius approached their campfire, two of them armed with nothing more than short, wide-bladed glavi. They looked at the newcomer with Belisarius, all of them betraying some degree of curiosity.\\n\\n \"This is Linos,\" Belisarius said, raising his voice so that all would hear him. \"He comes from Captain Hyperion who has landed at Rhegium with men and supplies for us.\"\\n\\n A growl of approval met this announcement. \"I know Captain Hyperion,\" said one of the younger officers. \"He is very good in battle, so they say.\"\\n\\n \"And where has he fought?\" asked one of the others, a trifle older than most of the officers. Another seven men had come up to the space near the fire, for although it was stifling in the heat, it was also the only sensible place to gather.\\n\\n \"He fought in Egypt,\" Linos said defensively. \"He has had experience.\"\\n\\n One of the men laughed unpleasantly. \"If he has not had some before, he will get some now.\"\\n\\n \"Regimus,\" warned Belisarius, \"wait until you see the man in action before you condemn him.\"\\n\\n \"You know the type as well as I do; highborn relatives, ambitious family, purchased promotion and all the rest of it. That\u0027s what all the officers are like now. They are puppets of the court.\" Regimus touched a jagged scar that crossed the bridge of his nose and ran unevenly down his left cheek. \"None of them lifted a sword except to practice with slaves.\" \\n\\n","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-24.html","bookId":2509,"book":{"id":2509,"title":"A Flame in Byzantium (Atta Olivia Clemens #1)","description":"Storyline: A Flame in Byzantium (Atta Olivia Clemens #1) \\n Atta Olivia Clemens had received St. Germain\u0027s darkest gift. Would his love save her from the True Death? \"A skillful blend of history and fiction, given added spice by the fact that its heroine happens to be a 500-year-old vampire\".--Library Journal.\\n","cover":"https://allnovel.net/images/a-flame-in-byzantium-atta-olivia-clemens-1.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:08:33 PM"}}
