{"id":107725,"no":39,"title":"Page 39","content":"\\n\\n \"Do not speak to me! Do not do anything. I have endured all the words I ever want to hear.\" She reached to the nearest ikon and flung it across the room. When Belisarius reached out his hand to restrain her, she turned on him, her mouth square with ire. \"What use are the Saints? What use is your precious honor if we are driven to this disgrace? Why must you be blameless? Why didn\u0027t you plot against the Emperor if this is to be the reward you have?\"\\n\\n \"For your own sake, Anton—\" Belisarius began, then broke off as Antonina threw herself on him, her hands raised and her nails poised as talons to rake his face and gouge his eyes.\\n\\n \"Coward!\" she shrieked. \"Fool! Fool! Fool!\"\\n\\n Striving not to hurt her, Belisarius struggled to hold Antonina and pin her arms to her sides. \"Antonina,\" he panted. \"Beloved. Wife. My most dear.\"\\n\\n Her nails scored his neck before she was restrained. \"I hate you,\" she hissed. \"I hate you.\"\\n\\n At that, the strength went out of him and he released her, standing without resistance as she scratched and struck him. Only when this gave way to high, keening wailing did he act again. Tenderly he drew her to him, holding her, smoothing her hair, whispering to her. \"I can bear the rest, if I must. I will bear it. But I cannot endure to give you pain, Antonina, and your disgust of me is more than I am able to stand. Hush, hush, my dearest, my only beloved. All the rest can be borne, but not your odium. Antonina. Antonina.\"\\n\\n Finally she recovered enough to speak without screaming vituperations. She looked at the blood on his face and shoulders, at the rents in his clothing. \"Did I do that?\"\\n\\n \"It doesn\u0027t matter,\" he said, kissing her brow.\\n\\n \"Did I?\"\\n\\n \"Yes.\" He met her eyes steadily. \"You were very angry.\"\\n\\n \"Yes.\" Some remaining fire flared in her face, then faded quickly. She let him support her and take her to her bed. \"I must sleep,\" she murmured.\\n\\n He said nothing, waiting for her invitation which did not come. As he dismissed her body slaves, he watched closely but covertly. \"Do you need anything from me?\"\\n\\n \"I have already had more from you than ever I sought,\" she said with consuming bitterness. \"I will have to have time, Belisarius. So much has happened.\" This last was vague and she did not look at him.\\n\\n \"Antonina?\" He held out his hand to her. When she did not take it, he let it fall.\\n\\n \"Tomorrow,\" she said distantly. \"Tomorrow, perhaps, we will talk. When I am more myself.\" It was a dismissal, and he recognized this.\\n\\n \"Very well. Tomorrow.\"\\n\\n As he went to the door, she said after him, \"Perhaps.\"\\n\\n Text of a letter from Pope Sylvestros to Captain Ghornan.\\n\\n To the heretical Copt Ghornan for whom I still entertain a certain admiration, hail from Pope Sylvestros, currently in Roma.\\n\\n Your information about our most recent venture has given me renewed hope in our current enterprise, and I cannot help but believe that if we continue our efforts, we might well do far more than we currently anticipate, given what we have accomplished. It seems to me that a little determination and zeal might provide the impetus your last letter had so little of. While I admire your prudence, I do not think that this is the time for hesitation. Everything has gone so well that I cannot but assume that it will continue to go well for us, no matter what you fear.\\n\\n I find it ironic that you, who were so determined at the beginning of our project, are now the one who preaches caution and contentment with what we have achieved.\\n\\n In this regard, let me say that there are still many valuable things to be gained in areas we have been before. We have not, by any means, exhausted the possibilities of our venture as defined in the past, and were we to continue as we have begun, there is no reason to suppose that we would not reap the rewards of our efforts. You have advised that we take time to assess what we have gained, and I concur, but you see this as a point where we might suspend our activities; I see it as the first real spur to us to be more determined than we have been.\\n\\n You say you are worried at what might befall us because of our partnership, but why should anything unfortunate happen? You are concerned that some authorities could become curious about the achievements we have, and I agree that a little more circumspection about the projects would not hurt us, but I also believe that we must consider the larger benefits we stand to gain from our dealings, and weigh that against the hazards of official objections.\\n\\n This is not to say that I am unaware of the risks. I know that what we do may be frowned upon by some of those in Roma, but there are those in Konstantinoupolis who will be delighted with our efforts and who will urge us to continue.\\n\\n We are admonished in scripture to turn ourselves to the labor that we do best and to do it with dedication and determination. It is not unreasonable to assume that what we have accomplished thus far has been due to our determination, and if we only persevere, we might look forward to many more such successes. Before you reject the new venture out of hand, consider the possibilities in this light and you will have to come to the same conclusion I have reached, that there is enough treasure here to justify the things we must do to claim it.\\n\\n Think of your well-being and you will see that I am right. I pray that you will reconsider and join with me in this expansion of our previous activities. It would pain me to think I might have to search out another to aid me in this worthy pursuit; that would merely serve to increase the danger to all of us, and I cannot think that you would want that.\\n\\n I will be waiting for you at the villa where we discovered the chalcedony jars. I will be there for a period of ten days, and if at the end of that time you have not come there, I will conclude that you are no longer interested in what we have done and will at that time begin the task of seeking out other assistance.\\n\\n With prayers that you will be guided by me and continue to champion the work I have begun here, I send you my blessings and a list of those items you will find interesting.\\n\\n Pope Sylvestros\\n\\n at the villa of the Gracchi\\n\\n north of Roma\\n\\n near Capena on the Via Flaminia\\n\\n 3\\n\\n \"They denied me entrance!\" Drosos fumed, his eyes hard with indignation. \"They would not let me see him.\"\\n\\n Olivia trailed her hand in the fishpond and sought for the right words to console him. \"It isn\u0027t your fault, Drosos.\"\\n\\n \"Of course it\u0027s not my fault,\" he concurred, flinging the parchment scroll he had been given halfway across the garden. \"It\u0027s the damned Censor and his clique that are to blame, and they will answer for it, believe me.\" He paced down the wide stone path, then came back to her. \"Aren\u0027t you going to say anything more? Just that it\u0027s not my fault?\"\\n\\n \"What can I say? I am as distressed as you are; it is a dreadful state of affairs, and I wish it were otherwise. But words do not change these things.\" She watched the flickering shine of the fish under the water lily pads.\\n\\n \"No, they don\u0027t,\" he agreed, trying to be fair. His disappointment lessened. \"You wouldn\u0027t want to try to gain entry to Beh\u0027sarius\u0027 house yourself, would you?\"\\n\\n She turned, not quite smiling. \"I am not prohibited from seeing him, but I am not allowed to carry any messages to him, or bring any writing to the house.\" It was only two days since she had paid her first visit to Belisarius since his return from Italy, and she was still shocked by the reception she had received at the hands of the Guard who were posted there.\\n\\n \"You could tell him a few things from me, couldn\u0027t you?\" Drosos suggested, putting his hand on her head and starting to loosen the pins that held her complicated hairdo in place.\\n\\n \"I might,\" she said, her voice softening as the first lock fell on her shoulder. \"If I were caught doing it, I would be prohibited from seeing him again.\"\\n\\n \"You\u0027re clever. They wouldn\u0027t catch you,\" Drosos said belligerently. \"Tsakza!\" he cursed, kicking at the path, his manner changed from teasing and sensual to restless dissatisfaction in an instant. He dropped one of her hairpins and let it lie at his feet.\\n\\n \"But if they did,\" she went on, unflustered by his behavior, \"I would cease to be much use to you or to him. Drosos, I do not want to see you cut off from your friend.\"\\n\\n \"My General,\" he corrected her, moving away from her, her hair forgotten. He paced through her garden.\\n\\n \"Your friend,\" she insisted gently. \"Drosos, if you had a tail it would be lashing. Come back and let us see if there is a way we might reach Belisarius without endangering him or you or me.\"\\n\\n \"You just said there isn\u0027t,\" he reminded her, close to sneering.\\n\\n \"I said that if I were caught giving him a message I wouldn\u0027t be allowed to see him again, and that\u0027s another matter entirely.\" She took the last of the pins from her hair and shook it loose. \"Drosos, please.\"\\n\\n \"They\u0027ve made a prisoner of him, but they dare not lock him up. The people wouldn\u0027t stand for it.\" He folded his arms and stopped beside her fishpond.\\n\\n \"Whether the people would or wouldn\u0027t, the Court Censor isn\u0027t going to test his power with Justinian quite yet. As displeased as the Emperor is with Belisarius, he isn\u0027t ready to be rid of him entirely, or you can be certain that he would already be locked in a cell or have been condemned as a traitor.\" \\n\\n","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-39.html","bookId":2509,"book":{"id":2509,"title":"A Flame in Byzantium (Atta Olivia Clemens #1)","description":"Storyline: A Flame in Byzantium (Atta Olivia Clemens #1) \\n Atta Olivia Clemens had received St. Germain\u0027s darkest gift. Would his love save her from the True Death? \"A skillful blend of history and fiction, given added spice by the fact that its heroine happens to be a 500-year-old vampire\".--Library Journal.\\n","cover":"https://allnovel.net/images/a-flame-in-byzantium-atta-olivia-clemens-1.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:08:33 PM"}}
