{"id":107768,"no":82,"title":"Page 82","content":"Drosos sat up suddenly, his hand clapped to the little thread of blood that ran over his collarbone and down his chest. \"Christos! You did it again!\" He rounded on her, his other hand closed in a fist. \"Drosos?\" She was fighting off the anguish that threatened to take hold of her. \"You bit me! You drank my blood!\" He heaved himself out of the bed. She raised herself on her elbows. \"But I\u0027ve always—you haven\u0027t objected—\" \"You\u0027re unnatural!\" he bellowed. \"Drosos—\" \"Monster! Monster!\" Seriously alarmed, she got out of her bed and took a hesitant step toward him, one arm out. \"Keep away, monster!\" He reached for the heap of his clothes and drying sheet and flung them at her. \"Stay back!\" \"I won\u0027t—\" \"Monster!\" His voice had risen to a shriek. \"Vampire!\" She stopped. \"But you know that,\" she said softly. \"From the first you knew that.\" \"Fiends of Hell, I did!\" He reached the door latch and yanked it open. \"Keep off me, you, or I\u0027ll dash your brains out.\" Naked, he went into the hallway, tugging the door closed behind him. Olivia stood alone as she listened to his hasty footsteps outside the door. He would find another place in the house to sleep, and later she would see that he was covered. Terrible desolation swept through her, and she went down on her knee to gather up the cloth he had thrown at her. Slowly, automatically, she made a bundle of it and placed it by the door so that it could all be washed in the morning. She moved the way a doll might move, her tragic eyes blank, her thoughts in such turmoil that she could not sort them out yet. She added the bedding to the other bundle, and then sat on the uncovered mattress, trying to keep from capitulating to the despair that clawed at her heart. \"There have been worse times,\" she whispered, the words making no sense to her. There had been awakening in her own tomb. There had been the day that Regius discovered her with his son. There was the time that she had been trapped in a burning cottage, when she was sure that she would die the true death. There had been Zaminian who had run her through with his sword six times, but never touched her spine. All of them had been more dire than this. But they were in the past; the immediacy of her debacle overwhelmed her. The loss of Drosos engulfed her. Some little time later she was shocked out of her misery by a loud crash from somewhere near the front of her house. Gathering one of her bed-curtains around her, Olivia rushed out into the hall. Her sight, keener than others at night, let her find her way quickly and easily to the reception room off the vestibule. Drosos had come there to drink the wine kept for visitors, and he had consumed two amphorae of it. Now he lay where he had fallen, amid spilled wine and overturned roses. A commendation from the Emperor Justinian to his naval fleet. To the men who have achieved so great a triumph over the ships of Totila, we send our grateful commendation for the superb triumph you have achieved. The Ostrogothic ships are vanquished and you all share in this victory. Each of you will know the extent of our gratitude in our prayers and our public thanks. For every man who participated in this great campaign there will be a commemorative coin struck and distributed. To all officers there will be greater rewards, which will be heaped upon them and their families. All those who have been in this battle will be honored in a great Mass at Hagia Sophia, and upon the consecration of the entire great basilica, another Mass will be offered, so that the building will be made a more holy monument by the addition of the names of these valiant men who have defended our land from the predations of Totila and have discharged their duty to the Empire with greater valor than has ever been shown before. There are many tributes that an Emperor values above the riches and treasures of his realm, and a victorious navy is one of them. You have given us more than any Emperor could want, and for that we bless your names and give thanks to God for your courage and might. From this time on, all men who set out to sea to conquer the ships of Totila may count themselves excused from taxes levied for the benefit of our warriors, either on sea or land, for a greater measure than gold has already been paid, and we disdain to require more of you. Every officer who was part of this undertaking is relieved of taxes on all chariots, palanquins, and boats owned by his family in recognition of the officer\u0027s service in our cause. In this, the Lord\u0027s Year 551, we offer up praises to God, His Son and the Holy Spirit for the success of the enterprise, and admonish all loyal subjects within the bounds of the Empire to join with us in this celebration, for surely we are delivered for the purpose of Christian vindication throughout the world. Justinian Emperor of Byzantion 8 The reception hall in the Censor\u0027s house was three times the size of the vestibule, and lined with benches and writing tables. There were three other benches at the center of the room reserved for those about to be questioned by the Censor, for this clearly was not a room intended for anything so frivolous as social entertainment. Both Panaigios Chernosneus and Konstantos Mardino-polis were waiting for the Guard escort to arrive. Between them huddled a figure more like a collection of sticks held together with rags than a man. One of his eyes was fever-bright, the other was missing entirely. His hands were wrapped in strips of filthy cloth, but the shape of these improvised bandages suggested that part of his fingers were missing. \"When is Captain Vlamos supposed to be here?\" Konstantos asked, irritated at being kept waiting. It was one thing for Panaigios to suffer these delays; he, Konstantos, was of too high a position to warrant such treatment. \"His slave said that he was leaving the house immediately. He said there had been no resistance.\" Panaigios folded his arms. \"I suppose there is some reason they are not here yet.\" \"There had better be,\" Konstantos said, his eyes hot. \"Perhaps there has been another procession for the returning ships,\" Panaigios suggested. \"Then Captain Vlamos should use other streets.\" He lifted his head as one of his eunuchs came to the door. \"What is it?\" \"The Guard escort has turned the corner, master. They will be here shortly. Are the Guards to be offered refreshments?\" \"Later,\" Konstantos said, waving the eunuch away. The slave made a deep reverence and left. Panaigios hoped that Konstantos might offer him a glass of fruit juice or wine, or even a little water, but he knew better than to ask for it. He concealed a sigh and leaned back, bracing himself against the wall. \"Do you think this will take long?\" \"Not very long. We have this worthy pope\u0027s sworn statement, and he will confront the woman,\" said Konstantos, nudging the pathetic creature between them. \"You will not require long, will you?\" Pope Sylvestros rolled his one eye toward the ceiling. \"I have called to Heaven from the depth of my agony and I was shown the path of retribution. I was shown the way of righteousness and my soul rejoiced.\" \"Will that be enough?\" Panaigios asked. \"If the Emperor is satisfied, you and I are not entitled to question him.\" Konstantos drummed his fingers on the table. \"The Censor requests that we deliver our findings to him personally, so that there will be little gossip. There are those whom the Censor does not wish to know of these proceedings.\" \"Of course,\" said Panaigios, more fretful than before. \"Be pleased you are serving here,\" Konstantos recommended. \"You and I both stand to advance through this investigation.\" Panaigios nodded, feeling sweat gathering on his chest and under his arms. \"It is always an honor to serve the Emperor.\" Both men heard the front door open and the sound of many voices. Pope Sylvestros started to wail and slid back against the wall as if seeking to make himself invisible. Captain Vlamos was the first into the enormous reception room. \"In the name of the Emperor Justinian, we have carried out our duty,\" he announced formally. \"Where is the culprit?\" Olivia Clemens stepped around the Captain. \"I am not a culprit and I will be grateful if you will not use such words until you have some basis for them.\" She was dressed in Roman splendor and her carriage was confident and regal. \"She! It is she!\" screamed Pope Sylvestros, raising his covered hands as if to ward off a blow. \"Who is that unfortunate wretch?\" Olivia asked; if his behavior caused her any alarm, there was no outward sign of it. \"He is among those who accuse you,\" said Konstantos, distaste in his long features. \"And it is most improper for you to address any of us directly.\" \"Since I have been forbidden the right to summon my sponsor, I can think of no alternative. Incidentally, why have I been forbidden to have Belisarius here?\" She glanced from Konstantos to Panaigios. \"Or am I not allowed to have answers, either? If I am not, then these proceedings are apt to be difficult for all of us.\" \"Your deportment is shameful.\" Konstantos had half-risen and was pointing his stylus at her.","sourceLink":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1/page-82.html","bookId":2509,"book":{"id":2509,"title":"A Flame in Byzantium (Atta Olivia Clemens #1)","description":"Storyline: A Flame in Byzantium (Atta Olivia Clemens #1) Atta Olivia Clemens had received St. Germain\u0027s darkest gift. Would his love save her from the True Death? \"A skillful blend of history and fiction, given added spice by the fact that its heroine happens to be a 500-year-old vampire\".--Library Journal.","cover":"https://allnovel.net/images/a-flame-in-byzantium-atta-olivia-clemens-1.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-flame-in-byzantium-atta-olivia-clemens-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:08:33 PM"}}
