{"id":65387,"no":13,"title":"Page 13","content":"“I was on my own with my mother after Dad died,” Carolyn reminded her. “Trust me, I know how hard this is. I didn’t need to move Mom into a facility, thankfully, but sometimes I wonder if she might’ve done better with other women her age.” Abruptly changing the subject, she added, “The reason I phoned was to see if you could come for dinner one night next week. Thursday works best for everyone else.”\\n\\n “Everyone else?” Susannah repeated. “Who’s everyone?”\\n\\n “I ran into Sandy Giddings and she mentioned seeing you at Wal-Mart, so I invited her, along with Yvette Lawton and Lisa Mitchell. Is that okay?”\\n\\n “Of course!”\\n\\n Sandy, Lisa and Yvette had been Susannah’s best friends through high school. “I didn’t know you’d been friends with them, too.”\\n\\n “We’re acquaintances more than friends,” Carolyn explained, “but I want to connect with the community and this seemed a painless way to get reacquainted.”\\n\\n “It sounds great. Thanks for setting everything up.”\\n\\n “Girls’ night out,” Carolyn said.\\n\\n Susannah could use a night to relax with old friends. Although she’d lost touch with these women, she felt excited about seeing them again. Carolyn might need to reconnect with the community, but Susannah needed to connect with her past. That had become clear to her. Sandy, Yvette, Lisa and Carolyn were part of her personal history.\\n\\n She and Carolyn chatted a few minutes longer and afterward she felt much better. She sat in front of the television again, flicking through channels, but she still couldn’t concentrate. Then she went to bed, but it was a long time before she slept.\\n\\n Her dreams were filled with memories of her childhood, of her mother baking cookies and serving as her Camp Fire Leader. She dreamed of summer walks with her father, going for ice-cream cones—always strawberry for her, vanilla for him. As a judge, he was a community leader and to her, he’d seemed the most wonderful man in the world. Her opinion had changed when she entered high school and she’d discovered how dictatorial and unreasonable he was. She dreamed of the yearly Easter egg hunts she’d participated in as a kid and swimming in the local pool with her friends.\\n\\n The next morning, the sun shining in her bedroom window woke Susannah. It was a pleasant way to wake up, especially when the clear, bright sunshine was accompanied by the sound of birdsong. She showered and dressed, and made a pot of coffee, drinking her first cup outside. Before leaving to visit her mother, she watered the plants, lingering among the roses for a few minutes and marveling anew at her mother’s energy. Vivian might have let other things go, but she’d maintained her garden. Then she loaded the car with a few odds and ends for her mother’s new home and headed out.\\n\\n When she reached Elm Street, Susannah surprised herself by taking a left instead of a right and drove up the road that led to the cemetery. She hadn’t been to her father’s grave since the funeral. Why she felt the urge to go now, she couldn’t say. Perhaps it had to do with her dreams, with her need to revisit the past.\\n\\n She parked near the entrance—the only car there—and walked between the grave markers to where she’d stood almost seven months earlier. As she moved across the lawn to her father’s grave, she remembered his casket being lowered into the ground. The headstone was in place now, her mother’s name on the marble slab beside his, along with Vivian’s date of birth, followed by a blank space to note her mother’s death.\\n\\n Susannah stood, feeling stiff and uncomfortable, on the freshly watered lawn. “Hi, Dad,” she said, her voice a hoarse whisper. “How’s it going?” She snickered at this weak attempt at conversation. From her early teenage years, she’d never really had much to say to him. It wasn’t any easier now that he was six feet under.\\n\\n “Mom says you’re the one who told her to go into assisted living.” Yesterday, her mother had made a point of letting Susannah know the reason for her sudden change of heart.\\n\\n Susannah slid her shoe over the grass, which was slick and moist beneath her feet. “I suppose I should thank you for that.”\\n\\n Biting her lower lip, she walked two grave markers away but didn’t read the names on them. She wanted to leave, to walk back to her car and drive off, but for some reason she couldn’t make herself do it.\\n\\n “You know, Dad, you weren’t the easiest man to live with. Mom went along with whatever you wanted, but not me. I know we would’ve had a better relationship if I’d given in to you, but…I couldn’t.”\\n\\n In many ways her father was a tough man, rigid and often uncompromising. He had to be, sitting on the bench, dealing with lawbreakers and…well, lowlifes. Not surprisingly, her father had become emotionally distant, more so after Doug’s death.\\n\\n As clichéd as it seemed, George Leary had favored his only son. After her brother died, it was as if the sun had permanently disappeared from her father’s world. Their relationship had been strained before her brother’s fatal car accident, but had deteriorated even further afterward. The truth was, her father hadn’t loved her as much as he had Doug.\\n\\n Susannah gasped at that realization, pain spiraling through her. She clenched her hands into tight fists. That was it, although she’d never acknowledged it before. Doug, his precious son, was dead and she’d been a damn poor replacement.\\n\\n With Doug’s death, this branch of the Leary family had died out. Her uncle Henry had never married; Uncle Steve died on D-Day. That left only Doug to carry on the family name and he was gone. Gone, too, were her father’s dreams.\\n\\n She was fifty years old and it had taken her this long to figure it out. In one of their recent conversations, Joe had suggested Susannah make an appointment with a counselor to help her deal with her father’s death. At the time she’d dismissed the suggestion. Today, however, she was beginning to think there might be some benefit to discussing her feelings.\\n\\n “When you died, I thought that if we’d had a chance to talk…to sort everything out,” Susannah whispered, “it would’ve been better for us both. I wanted to tell you how sorry I was and now…now I wonder if it would’ve done any good. You were so set in your ways, so self-righteous.”\\n\\n Tears streaked her cheeks and she brushed them aside, angry that her father still had the power to reduce her to this. “I wanted to talk to you, but I know that was impossible.”\\n\\n She circled his grave site, years of anger and frustration building to a fever pitch. “Not once in all the time since I returned from Paris did we have a decent conversation. Didn’t that bother you? I was your only surviving child. Didn’t you want to know me?”\\n\\n Standing over the grave, she closed her eyes and waited for the ache in her heart to abate. “I wonder if you noticed how rarely Joe and I came to Colville. Did you ever wonder why? No, I don’t suppose you did.”\\n\\n Susannah had remained dry-eyed during her father’s funeral. Joe claimed her father had loved her deeply, but Susannah believed otherwise. She’d stayed strong for her mother, or so she’d told herself. Now she realized she hadn’t allowed herself to grieve, not for the father he’d become or the father he could have been—the father she remembered from early childhood. She couldn’t break down for fear that once she started, she might not be able to stop.\\n\\n As Susannah walked to her car, she was emotionally spent. She battled sorrow and tears, and regretted coming here.\\n\\n When she reached her parked car, she leaned against the passenger door, trying to compose herself before going to visit her mother. She wasn’t up to it this morning. Instead she’d tackle the house, packing what she could, and making some of the decisions that had to be made.\\n\\n As she got into the car, it occurred to Susannah that she hadn’t visited Doug’s grave in years. She almost began to cry again as she thought about her brother, who was just a week over twenty-one when he died.\\n\\n On the way to the cemetery, Susannah had driven around the very curve where his car had gone off the road. From what she’d subsequently learned, he’d been doing in excess of seventy miles an hour when he hit the guardrail and slammed into a tree. Her one wish was that he hadn’t suffered. She couldn’t bear it if he had.\\n\\n Susannah needed a few minutes to locate her brother’s grave. She wondered again why her father hadn’t been buried next to his son. Instead, Doug was five rows up. Presumably all the grave sites close by had been sold. That must have frustrated her father.\\n\\n To Susannah’s astonishment, lovely pink roses and purple lilacs were arranged in a vase by the headstone. She knew her mother had routinely visited the grave that first year, her grief nearly overwhelming. But to the best of her knowledge, Vivian hadn’t been to the cemetery recently and if she had, she would’ve left flowers at her husband’s grave, too.\\n\\n Susannah crouched down and fingered the delicate petals. The roses, still buds, hadn’t been cut more than a few hours ago. She stood and glanced around, wondering if whoever brought them was nearby. As far as Susannah could see, she was alone.\\n\\n Despite everything she’d told her father, Susannah had little to say to her brother. She smiled down at his grave, blew him a kiss and returned to the car, determined to leave and not come back for a long, long time.\\n\\n From the cemetery Susannah drove to Safeway, where she picked up packing boxes. Then, feeling she owed her mother a visit, she decided not to postpone it, after all, and drove to Altamira. Her mother sat in her tiny apartment, waiting for her. The minute Susannah walked in, Vivian stretched out her arms, her eyes pleading.\\n\\n “What took you so long?” she asked in a faltering voice. “I was afraid you weren’t going to come.”\\n\\n “I wouldn’t do that,” Susannah assured her. Taking the fragile, bony hand in her own, Susannah knelt so that the two of them were at eye level. “How did you sleep last night?”\\n\\n “I didn’t. Not a wink.”\\n\\n “Too much noise?”\\n\\n “No…yes. I don’t know and the food here is terrible. You don’t expect me to eat cold eggs and dry toast the rest of my life, do you?”\\n\\n “Mom, give it a chance.”\\n\\n “I hate it already. I know your father thinks I should be here, but I’m telling you right now, Susannah, I want out.”\\n\\n “Two weeks,” Susannah reminded her. “You promised me you’d give it your best shot for two weeks.”\\n\\n Reluctantly her mother nodded. “Yes, I know, but I can tell you this isn’t going to work.”\\n\\n Susannah prayed with all her might that her mother would change her mind and soon. Because there were no other options.\\n\\n “Where are my clothes?”\\n\\n “Mom, we already brought your clothes, don’t you remember?”\\n\\n “What about my purple dress? I need that dress, Jean. You didn’t give it away, did you?”\\n\\n “No, Mom.”\\n\\n “Jean, oh, Jean, what am I going to do?”\\n\\n Susannah had to bite her tongue to keep from correcting her mother. “I brought everything you asked for.” \\n\\n","sourceLink":"https://allnovel.net/susannah-s-garden-blossom-street-3/page-13.html","bookId":1935,"book":{"id":1935,"title":"Susannah\u0027s Garden (Blossom Street #3)","description":"Storyline: Susannah\u0027s Garden (Blossom Street #3) \\n When Susannah Nelson turned eighteen, she said goodbye to her boyfriend, Jake--and never saw him again. She never saw her brother, Doug, again, either. He died unexpectedly that same year. Now, at fifty, Susannah finds herself regretting the paths not taken. Long married, a mother and a teacher, she \"should\" be happy. But she feels there\u0027s something missing in her life. Not only that, she\u0027s balancing the demands of an aging mother and a temperamental twenty-year-old daughter. \\n Her mother, Vivian, a recent widow, is having difficulty coping and living alone, so Susannah goes home to Colville, Washington. In returning to her parents\u0027 house, her girlhood friends and the garden she\u0027s always loved, she also returns to the past--and the choices she made back then. What she discovers is that things are not always as they once seemed. Some paths are dead ends. But some gardens remain beautiful....\\n","cover":"https://allnovel.net/images/susannah-s-garden-blossom-street-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/susannah-s-garden-blossom-street-3.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:57:07 AM"}}
