{"id":65390,"no":16,"title":"Page 16","content":"“He thanked me for the offer,” Jim continued, “but said he liked his current job just fine. I told him what his starting wage would be and I’m sure it’s more than he’s making now, but he wasn’t interested.”\n Carolyn didn’t know whether she should be disappointed or gratified on behalf of her garden. She was pleased with the work he was doing, but surprised that he’d walked away from a job offer that would likely double his income.\n She shrugged. “It’s his choice.”\n “I think he drifts around a lot,” Jim said. “I asked him where he was from and he told me he’d been living in California, and before that, Arizona and that he picked fruit in Yakima for a season. I’ve met men like him before. They don’t put down roots.”\n Carolyn nodded, inhaling deeply. Ponderosa pine and fir scented the afternoon air. As a child, she’d loved the smell of her father’s clothes. Now her own shirts carried the same woodsy fragrance. To her, it was more enticing than the most exotic perfume.\n They turned the corner just as the whistle blew. All around her the crew shut down their machines and, within moments, the buildings and yards emptied as men sauntered past, their black lunch boxes in hand. She enjoyed the sound of their talk and laughter, and the fact that they acknowledged her with nods or waves.\n Carolyn ended up staying for an extra hour. She finished reading through her e-mail, checked on Grady’s condition—which was improving—and then closed her computer before going home.\n As she made her way down the long driveway, she noticed the landscaping truck parked outside her house. The bed was loaded with beauty bark, which Dave Langevin had begun spreading over her flower beds. Carolyn was pleased to see him.\n She parked in the garage, then stepped out of her vehicle and walked toward him.\n Dave was a middle-aged man with dark hair, callused hands and deep-set dark eyes. He wore nondescript work clothes and a big straw hat that shaded his face. As she drew closer, he thrust his shovel into the earth and leaned against the handle.\n “I didn’t realize you’d be here,” she said.\n He wiped the back of one hand across his brow. “Your housekeeper said you were having dinner guests, and I wanted to get this beauty bark spread before they arrived.”\n It was thoughtful of him, and unexpected. “Thank you,” she said simply, feeling a bit awkward. “And thank you for your help this afternoon at the mill. Jim told me what you did.”\n Dave seemed almost embarrassed by her praise. “No big deal.”\n “I doubt Grady thinks that. Jim said you saved his life.”\n Dave stared down at the ground, then pulled out the shovel. “Better get back to work,” he said tersely.\n “I understand, but I wanted you to know I appreciate what you did. Thank you again, Dave.”\n He seemed surprised that she knew who he was. For a long moment, he held her gaze. “You’re welcome…Carolyn.”\n Just the way he said her name made her look at him again, really look at him. When she saw that her scrutiny unsettled him, she turned and hurried into the house. The oddest sensation settled in the pit of her stomach. The last time she’d felt anything like this had been the day she’d met her husband, her long-divorced husband. There’d been a powerful physical attraction between them and she felt the same thing now, with this man. This groundskeeper who’d let it be known that he was a drifter. She was attracted to Dave Langevin. It was an uncomfortable sensation, one that left her vulnerable and alarmed. At her age and in her position, she couldn’t afford to be interested in romance. And yet, there was something about him…. Responsibility, common sense—and lack of time—won out, otherwise she would’ve invited him in or found an excuse for him to linger. But knowing her dinner guests would be coming soon saved her from making a fool of herself.\n Despite her wariness, Carolyn studied Dave from inside the house. After ten or fifteen minutes, he walked over to his pickup truck and stored his equipment on the passenger seat. He opened the driver’s door and then, as if aware of her surveillance, he paused and looked over his shoulder at her.\n Embarrassed, Carolyn ducked away from the window and into the shadows, mortified that he’d caught her watching him.\n Touching the rim of his large straw hat, he climbed into the truck and drove off. As he rumbled down the driveway Carolyn couldn’t shake the feeling that—if she were to allow it, if she were to seek it—Dave Langevin would be interested in her, too.\n CHAPTER 12\n Susannah no longer felt sociable, but it was too late to cancel out of dinner with Carolyn and the others. Dreading the evening, she sat at the table in her mother’s kitchen and tried to relax. Vivian hadn’t had a good afternoon and Susannah felt guilty about leaving her, guilty for having read her mother’s private thoughts and then questioning her as if she had the right. Susannah blamed herself for Vivian’s melancholy mood, which seemed to reflect her own dissatisfaction with life. She’d made a mistake in reminding her mother of unattained dreams; a bigger mistake was bringing it up again today.\n She’d mentioned searching for Jake to Carolyn but she’d done nothing, fearing…she didn’t know what. Fearing, she guessed, what she might feel once she found him. If she found him. It was quite possibly the most inane idea of her life and still she couldn’t let it go, couldn’t get the thought of him out of her mind.\n Because she was dissatisfied with her own life, Susannah had questioned her mother about the choices Vivian had made. She should’ve known better. Her mother had grown even more irritable than she’d been last night, claiming that Susannah was looking for excuses to vilify her father.\n That simply wasn’t true. All she’d wanted her mother to do was acknowledge the truth. Twice, in two different journal entries, Vivian had written about her desire to enter a nursing program and both times she’d been thwarted by George. Now her mother insisted a nursing career hadn’t been that important.\n Because of Susannah’s questions, it had been an awkward visit; she felt bad about that. Later Vivian had refused to eat her dinner and lain down for a nap instead.\n The rest of Susannah’s day had been spent working. She’d rented storage space and started taking packed cardboard boxes to the unit for safekeeping until she decided what to do with the house. More and more, Susannah realized her mother was incapable of making even the most mundane decisions. Like everything else, this would be up to her. In a midday phone conversation, Joe had suggested that renting storage space might be the best solution for now. He was right and Susannah had immediately called to arrange it. She appreciated the advice but felt he didn’t understand the emotional difficulties she was facing.\n Susannah was not only dealing with her mother, she was sorting through a lifetime of accumulated things. It seemed her mother had never discarded a single dish or piece of clothing, and her father wasn’t much better. For decades, she’d largely avoided her father and now, every time she opened a drawer, there he was. The memories of her teenage years made her uncomfortable. Because he was a judge, he felt he could dictate everyone’s life, whether he had a gavel in hand or not.\n After talking to her husband, Susannah found she was annoyed with him, too, unreasonable though that might be. He was in Seattle, living his normal, predictable life, and she was stuck in Colville. She didn’t want to decide what to do with Aunt Sophie’s handknit bedspread or her father’s stamp collection. It was easy for Joe to sit at home and make helpful suggestions, she thought bitterly. Susannah knew he was only trying to be supportive, but at this point she doubted there was much he could do or say that would satisfy her—and that bothered her, too. Almost overnight she’d turned into someone she didn’t know or like. Even spending time in her mother’s garden hadn’t calmed her the way it usually did. In fact, she’d come away irritated all over again. How was it that her mother couldn’t manage the simplest of household tasks and yet kept her garden in pristine condition? It was as if Vivian had let everything slide except her garden—her life, her appearance, her mind were just about gone, but not her garden. No, not her precious garden.\n Sitting at the kitchen table, Susannah buried her face in her hands. She was upset with her father and her husband, and now she’d added her mother to the list, and Doug, too. If her brother were alive, she wouldn’t have to cope with all these painful decisions alone. She knew it was a fruitless thought, but she couldn’t stop feeling that way. She wished she could be seventeen again, before the year that changed everything. The year of Doug’s death and Jake’s disappearance. If she was, she wouldn’t think twice about eloping. More than that, she’d leap at the chance. Oh, to be young again, to be in love with the fervor and intensity of youth. Only this time, she’d defy her father, stand up to him and run away with the man she loved.\n At six-thirty, Susannah pulled into Carolyn’s long gravel driveway and, as if by magic, her unease left her. She’d loved this house as a young teenager. Tucked against the foothills, it had a lush green lawn that sloped down from the tree line into a soft meadow. Many a late afternoon had been spent with Carolyn, listening to records in her upstairs bedroom and looking out her window, watching the deer graze.\n The house itself was a brown-shingled two-story with a sweeping porch across the front. A profusion of roses bloomed in the beds nearby. It was a shame that Carolyn’s mother and her own had never become friends, since they’d shared a love of gardening. A large cement patio was positioned on the right-hand side of the house, complete with a set of matching outdoor furniture.\n Susannah parked by the three-car garage and reached for her contributions: a package that contained the makings for a Caesar salad and a bottle of wine she’d picked up at the grocery store on her way out of town. She felt a twinge of guilt about bringing something store-bought, but between packing up the house and visiting her mother, there hadn’t been time to prepare anything.\n The front door was open and the screen unlatched when Susannah approached.\n “Come on in,” Carolyn called from the kitchen.\n Susannah walked inside. Her friend was assembling an appetizer plate of cheeses, fresh green grapes and crackers, which sat on the marble counter.\n “I brought wine,” Susannah said, holding up the bottle of white zinfandel. She placed the bag of Caesar salad fixings on the table.\n “Great.” Carolyn motioned toward the cupboard. “Wineglasses are on the top shelf. And you’ll find a bowl in the bottom cupboard.”\n Susannah quickly prepared her salad. She’d begun setting out wineglasses when the sound of two car doors closing interrupted her.\n A moment later, two of Susannah’s high school friends walked in together, each carrying a dish and a bottle of wine. From the way Lisa and Yvette looked around, it was clear they’d never been inside the house. Susannah came forward to meet them, and as soon as they saw her, they both started screeching with delight.\n Once they’d put the desserts and the wine aside, Susannah was wrapped in a giant hug and questions were tossed at her in quick succession. \n","sourceLink":"https://allnovel.net/susannah-s-garden-blossom-street-3/page-16.html","bookId":1935,"book":{"id":1935,"title":"Susannah\u0027s Garden (Blossom Street #3)","description":"Storyline: \n Susannah\u0027s Garden (Blossom Street #3) \n When Susannah Nelson turned eighteen, she said goodbye to her boyfriend, Jake--and never saw him again. She never saw her brother, Doug, again, either. He died unexpectedly that same year. Now, at fifty, Susannah finds herself regretting the paths not taken. Long married, a mother and a teacher, she \"should\" be happy. But she feels there\u0027s something missing in her life. Not only that, she\u0027s balancing the demands of an aging mother and a temperamental twenty-year-old daughter. \n Her mother, Vivian, a recent widow, is having difficulty coping and living alone, so Susannah goes home to Colville, Washington. In returning to her parents\u0027 house, her girlhood friends and the garden she\u0027s always loved, she also returns to the past--and the choices she made back then. What she discovers is that things are not always as they once seemed. Some paths are dead ends. But some gardens remain beautiful....\n \n","cover":"https://allnovel.net/images/susannah-s-garden-blossom-street-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/susannah-s-garden-blossom-street-3.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:57:07 AM"}}
