{"id":97525,"no":16,"title":"Page 16","content":"But Thel bowed his head. \"I thank you for your gift of troops and ships,\" he said out loud. And he thought secretly to himself: I do not have to use them on this mission, they can simply come along and watch true warriors do their duty. He had just recently become a shipmaster, something he\u0027d longed to attain ever since he\u0027d stood on the stone walls of his keep and looked up at the stars and wondered what amazing things might be waiting for him up there. Now, with another ship and more troops under his command, the dream of becoming a fleetmaster seemed within reach. With a promotion like this, Thel would need to send a message home to the keep elders. He would have more wives brought to the keep. It was time for Thel to create more alliances on the homeworld. It was time to expand the rooms, and father more children to pack the common rooms. The line of Vadam would be continued in strength. The keep\u0027s poet would add a line to the family saga, celebrating Thel\u0027s furthering in rank. Thel would be the most renowned Vadam yet. The Prophet of Regret waved his hand. \"Come with me, Shipmaster.\" Thel loped behind the antigravity throne that Regret drove across the room to a massive wall-sized projection of the planet they\u0027d come to orbit. \"They left only three ships to protect it,\" Regret mused. \"You know why we fight these creatures?\" \"They committed a grievous sin,\" Thel said. \"They destroyed Forerunner artifacts.\" He shivered as he said that. The Forerunners had left traces of the time they spent in the galaxy scattered across worlds and in space. These mighty demigods of the galaxy had been the forefathers of all the Covenant knew, and they\u0027d just... disappeared. But they\u0027d left clues as to where they\u0027d gone. A Holy Journey, to another plane of existence, using the technology of the Halos. So the Prophets taught, and the Covenant existed for finding the Halos, and following the Forerunners on their holy path. But these humans, they\u0027d found Forerunner artifacts, and instead of venerating them like all other species, they had destroyed them. Thel vibrated with religious rage. For that, the humans would pay \"It is important their heresy and desecration be punished,\" Regret said. \"So anything that distracts us from this holy duty, that itself, is unholy. And must be stopped. Like these blasphemous weapons.\" \"I understand, Hierarch,\" Thel said. \"I will stop at nothing.\" Regret sighed. It spoke into its chair to the fleet commanders throughout. \"Destroy this planet, and all on its surface.\" On the screen, plasma roiled and grew on the sides of the Covenant cruisers as the ships prepared to rain fire down upon the world the humans called Charybdis IX. Chapter TWENTY UNSC FRIGATE MIDSUMMER NIGHT, OUTER CHARYBDIS IX Zheng stood on the bridge of the Midsummer Night, his hands behind his back. Keyes watched him pace as the screens lit up. All the bridge crew were on duty, and the junior officers stood at the back, looking on. \"I called you all here to watch this,\" Zheng announced, suddenly pausing in place to turn and face them, \"because it\u0027s important to remember why we fight.\" Keyes swiveled his chair. Zheng had been averse to talking to the entire ship before this, slightly nervous. Keyes bet that Zheng knew what his reputation was. Or maybe Zheng was still damaged from whatever it was he was dealing with. Either way, he\u0027d kept his distance, even from his own bridge crew. And everyone had been happy to keep their distance from him as well. Until now. Zheng looked animated. Angry. For this he\u0027d asked Kirtley to broadcast his address to the rest of the ship. It was an interesting change. \"Some of you joined because you had no other options, some because you were looking for adventure, and others because of patriotism. And since the first contact at Harvest, many of you out of a desire to fight the Covenant. \"But as days pass, and the dreariness of daily life, cramped in this ship with your fellow sailors mounts, I know it can be easy to forget that we are, first and foremost, a weapon.\" Zheng looked out over the officers on deck. \"A weapon to strike back against all our enemies. External... or internal. Because if we don\u0027t do our best, this will be a small taste of what is to come.\" Behind Zheng the screens lit up with images broadcast from Charybdis. Keyes found his eyes drawn to the nearest, a scene from low orbit taken by a satellite. Far below, the sleek, sharklike shape of a Covenant cruiser passed over the patches of land, and as it did so, everything underneath it glowed. The screen flickered off, jumping to a new scene: a shot from the top of a skyscraper in downtown Scyllion. What looked like shimmering rain fell from the sky, but wherever it touched the city exploded into actinic flame. Buildings melted, slumping over and then bubbling down into a lava-like mix of asphalt and concrete and shattered glass. The camera wavered as blue haze began to build up near it, and then it melted and static filled the screen. Another live feed, from far outside the city, showed the blue waterfalls of plasma strike the river, sending up a giant cloud of steam as it was vaporized. \"They\u0027re attacking,\" someone said in a shocked voice. Keyes looked to the screen everyone pointed out, and saw tiny dots rising up to harass the bulbous-nosed Covenant cruisers. They were about as successful as minnows attacking sharks, Keyes thought. Plasma darted out from the sides of the cruiser over Scyllion, swatting the tiny Charybdis defense fighters out of the sky like annoying insects. Maybe if they\u0027d been more coordinated, Keyes wondered. Could a force of tiny craft distract a Covenant cruiser long enough for someone to slip something through their defenses? He realized he was trying to avoid the death and destruction in front of him with academics, and forced himself to continue watching. One by one the screens turned to static, and Zheng waved at them. \"This ship we\u0027re chasing, it looks like it\u0027s going into Covenant territory, and we know it\u0027s Insurrectionist. Working with Covenant. For all we know, they led the Covenant to Charybdis.\" Keyes raised an eyebrow. That was quite an assumption for Zheng to make. If the Kestrel had led the Covenant to Charybdis IX, they\u0027d gotten a lot of their fellow Insurrectionists killed here today, not just UNSC. Innies might be ready to die for their cause, but like this? Keyes thought back to what Jeffries had said about Zheng when they\u0027d first met. Zheng had lost his entire family to the Covenant. Zheng had even been impatient about Watanabe\u0027s mission. Now Zheng seemed to have been electrified into fiery, angry motion. \"There will be a reckoning,\" he shouted to the bridge crew. \"We will throw ourselves against whoever was responsible for all this.\" And behind Zheng the remaining screens shut down, leaving the last few images of the burned world flickering across everyone\u0027s eyes. Keyes spotted Badia Campbell staring at the screens. She looked queasy. Zheng turned back to the empty screens, surveying them for a long moment, and then said softly, \"That is all.\" Chapter TWENTY-ONE COVENANT CRUISER INFINITE SACRIFICE, CHARYBDIS IX The Prophet of Regret watched the surface of Charybdis IX melt from the firepower of his ships with grim satisfaction and heavily lidded eyes. He shouldn\u0027t have chosen to smoke in his private quarters before coming out, but before attacks like this Regret always found a good smoke calmed his nerves. Energy rolled over the square buildings that the humans loved to cluster near one another on the ground. That made it all that much easier for the Covenant to destroy them. Regret grew bored of watching the destruction of the planet, and turned the screen off. \"You are dismissed. Go. Weed out the Heretics. Leave no stone unturned!\" The Sangheili zealot blinked, and then bowed in that sinuously graceful Sangheili way. \"Your will be done, Hierarch,\" he said, and then left to pursue his mission. Regret sat in the control room, listening to the buzz of the ship\u0027s bridge crew. The matter of the Kig-Yar smuggling weapons rankled the Prophet. Only the San\u0027Shyuum, the leaders of the Covenant and its pinnacle species, could alter holy technology. To let other races control technology was a dangerous path. The Covenant\u0027s cohesion was grounded in their shared need for Forerunner technology. It was their unified religion, their political structure, and the hub of all commerce. To pull out one major tenet of the Covenant meant risking the entire thing crumbling. And Regret had not worked the last ten years of his life to watch the Covenant die. He\u0027d helped it face one of its biggest threats, with hardly anyone any the wiser, right before his ascension to Hierarch. Together, Prophets Regret, Truth, and Mercy had been aboard the massive Forerunner dreadnought that sat in the heart of High Charity, powering the entire moving world with just a fraction of its engines\u0027 power. The dreadnought had come to life as the Oracle at its heart had muttered blasphemous, world-changing accusations at the Prophets. All triggered by the Oracle encountering information about the humans. This machine had accused the Prophets of mistranslating Forerunner documents, and misunderstanding the Great Journey. It claimed the very tenets of their religion were false. And then the Oracle had attempted to launch the dreadnought. They had disconnected it just in time. In that moment, Regret felt, they had saved the entire Covenant. Without the Halos to search for, the Path to walk, and the worship of the Forerunners who left their mark all over the galaxy, the Covenant would fall apart. And the Hierarchs would not let that happen. So they turned that conflict into the annihilation and genocide of the humans. There was no room for negotiation or settlement. Humanity would be the first species they had encountered that they hadn\u0027t tried to absorb into the Covenant, as it was the source of the Oracle\u0027s confusion. Destroy them, and the Covenant would be able to continue its holy search to follow the Forerunners safely. Nothing could detract from that. Not even these counterfeit weapons. Regret didn\u0027t care that they\u0027d been modified. The San\u0027Shyuum happily pilfered Forerunner technology and modified it as they saw fit. What Regret cared about was that the weapons had been modified for humans, and that they\u0027d been tampered with without the Prophet\u0027s approval. And Regret wouldn\u0027t stand for that -- not from the Oracle, or from whoever was making those weapons. Regret turned the screen back on and looked down on the burning of Charybdis IX and watched. This was for the good of the Covenant, he told himself. Regret had only made one major mistake, he told himself. When the humans were first discovered Regret had assumed the world they\u0027d been found on was their homeworld. But after destroying it, they\u0027d found out that the humans had scattered across many worlds. It made destroying them all a lot more difficult, tiring, and time-consuming than Regret had anticipated. Chapter TWENTY-TWO MADRIGAL, 23 LIBRAE The humans called it 23 Librae. For the Covenant it was no more than a series of coordinates, another star in a long series of stars that Kig-Yar ships scouted out under their Ministry of Tranquility contracts. The Covenant hoped to find Forerunner artifacts in these various systems. It was in one of these many human places that the Kig-Yar had found signs of a massive wealth of Forerunner artifacts, the Prophets said. They also said that instead of studying them and learning of the glorious truths contained in them about the journey all species could prepare themselves for, the stupid creatures had destroyed them. Cosmic vandalism, mused Thel, as the two ships skipped out of Slipspace next to the one planet 23 Librae had in its habitable zone: the orbit not too close to the sun where it would boil its atmosphere off, or so far away that it would freeze. \"Start scanning the planet,\" Thel ordered his bridge crew. \"Engage all sensors. Make the sweep through. Last thing we need is for the Kig-Yar to lay claim, or the Jiralhanae to best the Sangheili in a task personally assigned them by a Hierarch!\" Madrigal. Retribution\u0027s Thunder fell into orbit around the planet that had once been inhabited by the humans. Just off to their starboard side the Kig-Yar ship that the Hierarch had assigned to them, A Psalm Every Day, accompanied them. Thel\u0027s lower mandibles twitched. The Kig-Yar Shipmistress had come in too close. They could have collided thanks to her aggressive piloting. But neither the Kig-Yar nor the Jiralhanae aboard would listen to Thel. They hadn\u0027t so far. He\u0027d asked them to keep their distance, but they acted as if he were going to cheat them of any discovery, or any chance to get into battle. Thel felt he would have been better off alone than saddled with A Psalm Every Day dogging his every move. Then again, maybe that was the Hierarch\u0027s way of keeping an eye on him. Thel had a general feeling, from what he knew of politics on High Charity, that the Prophet of Regret was very crafty. Yes, this one probably didn\u0027t just outright trust Thel, but wanted some verification. A Psalm Every Day was here to monitor him. Fair enough. \"Nothing there,\" Jora grumbled from his station as initial results from the systematic scans began to scroll through the holographic display. \"It is as we left it, Shipmaster. There are no signs of activity. Our quarry could not have come from here.\" The entire surface of the human planet had been destroyed. Melted with plasma. Zhar grunted. \"Their structures have deep roots. Is it possible they survived deep underground?\" Thel shook his head. \"I participated there.\" Thel considered it briefly. \"I personally saw to the destruction of their warrens in the capitol. I doubt it will become useful again in this Age. You may tell the Jiralhanae they may check the capitol for spoils ... with my leave. Meanwhile, send a probe to finish the sweep, then let us move on.\" \"To where?\" Jora asked. He threw the words out almost like a challenge. Thel eyed Jora. \"This is a system. There is more than one place to hide. These are Kig-Yar we are dealing with, remember.\"","sourceLink":"https://allnovel.net/halo-the-cole-protocol-halo-6/page-16.html","bookId":1638,"book":{"id":1638,"title":"Halo: The Cole Protocol (Halo #6)","description":"Storyline: Halo: The Cole Protocol (Halo #6) In the first, desperate days of the Human-Covenant War, the UNSC has enacted the Cole Protocol to safeguard Earth and its Inner Colonies from discovery by a merciless alien foe. Many are called upon to rid the universe of lingering navigation data that would reveal the location of Earth. Among them is Navy Lieutenant Jacob Keyes. Thrust back into action after being sidelined, Keyes is saddled with a top secret mission by ONI. One that will take him deep behind enemy lines, to a corner of the universe where nothing is as it seems. Out beyond the Outer Colonies lies the planet Hesiod, a gas giant surrounded by a vast asteroid belt. As the Covenant continues to glass the human occupied planets near Hesiod, many of the survivors, helped by a stronghold of human Insurrectionists, are fleeing to the asteroid belt for refuge. They have transformed the tumbling satellites into a tenuous, yet ingenious, settlement known as the Rubble--and have come face-to-face with a Covenant settlement of Kig-Yar . . . yet somehow survived. News of this unlikely treaty has spread to the warring sides. Luckily for the UNSC, this uneasy alliance is in the path of the Spartan Gray Team, a three-man renegade squad whose simple task is to wreak havoc from behind enemy lines in any way they see fit. But the Prophets have also sent their best---an ambitious and ruthless Elite, whose quest for nobility and rank is matched only by his brutality . . . and who will do anything to secure his Ascendancy and walk the Path.","cover":"https://allnovel.net/images/halo-the-cole-protocol-halo-6.jpg","author":"Tobias S. Buckell","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-cole-protocol-halo-6.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:27:30 PM"}}
