{"id":97512,"no":3,"title":"Page 3","content":"through the preserve. \"Outer Colony refugees, sir. They keep piling up at spaceports. Nowhere for them to go. We\u0027ve shut down arenas, parking lots, even whole streets for them. Running out of tents, food, and a lot of people are running out of patience. It\u0027s ugly out there, sir. I\u0027ve pulled a shift or two patrolling.\" \"Patrolling?\" Keyes asked. \"What\u0027s the UNSC doing police work for?\" \"The refugees are a drain, sir. We\u0027re planning an extended battle here, a few surprises for the Covenant if... or when they arrive. With the refugees on the surface, they\u0027re just costing us food and sitting out here like targets. Every ration they get is a ration we won\u0027t have when holding the line. How long brass will put up with all this chaos out here, I don\u0027t know.\" They roared on past several massive JOTUN robotic combines, and then into a gap in the wooded area around the recently created farmland. \"Almost there,\" Gerencer said as they bounced over ruts and gaps in the dirt. With a final roar the Warthog leapt out into a small ring of trees. The marine idled them over a well-worn patch of mud. The ground rumbled underneath, and the edges rose around them as they slowly moved down a long shaft. \"Welcome to Camp Patmos, Lieutenant.\" Gerencer grinned. \"From here we plan how to open up a can of whup-ass on the Covenant every hour of every day.\" Rows of Warthogs lined a metal cavern wall. Lurking behind them in the shadows were the marines\u0027 tank units, looking like squashed but hulkingly armored four-legged spiders dominated by two pairs of fore and aft treads and a long cab at its core. The barrels of their long cannons pointed menacingly at Keyes. Any Covenant landing on Chi Rho were in for a fierce fight. There were enough Scorpion M808B Battle Tanks for a full division. \"Lieutenant Keyes!\" A strong voice shouted. \"How good to see you.\" Keyes let his eyes adjust as he peered deeper into the gloom of the oversized hanger. A doorway between a pair of Mongoose quad bikes spilled light, and someone stood in the doorframe. Keyes hopped out of the Warthog, right leg tingling slightly. He briskly walked over, and swallowed. Even on a silhouette, it was hard to miss three stars on a uniform. Keyes knew who this would be. Only one vice admiral on Chi Rho. A man who\u0027d volunteered to come out to the front, and agreed to take on any colony defense, no matter long the odds. \"Vice Admiral Jean Mawikizi. Sir! It\u0027s an honor.\" Keyes snapped a smart salute. Mawikizi had fought intense lost battles on three planets, getting lifted off each one under protest as they were being glassed. The stringy, yet short, dark-skinned Mawikizi returned the salute with a smile. \"I pulled some serious strings to haul you out here this quick, Keyes.\" He held the door open for Keyes, and it banged shut behind them once the lieutenant stepped through. \"Walk with me.\" The rough rock-tunneled corridor stretched out in front of them. Mawikizi led Keyes down past offices, shouldering past privates and officers who stood to attention as he walked by. Keyes glanced off down a subcorridor, seeing barracks in the distance. All well below ground, and recently constructed. Mawikizi spotted his glance. \"They yanked me out of retirement in Burundi to run a battle fleet that\u0027s been getting pushed back almost every day. I\u0027m drawing the line for that group here on Chi Rho. A last stand. We\u0027re burrowing down as deep as we can. They\u0027re going to have to come on down and flush us out man by man.\" \"Sir, what about the refugees? And the gardens? I never imagined it was this bad.\" Mawikizi opened the door to his offices. \"It\u0027s that bad. We\u0027ve ordered local colonists to share the burden, but they believe the refugees had their chance to fight and survive. They\u0027re happy to give them land, but the locals here come from survivors of what used to be a rough planet. No handouts, just self-sufficient families spread out across the continents. They\u0027re not thrilled about being ordered to share ... it\u0027s not their culture. Been some dust-ups, so we can\u0027t trust locals or refugees to police. We\u0027re trying to figure out where to move them to before the Covenant attacks. And before they get too comfortable here.\" The vice admiral\u0027s offices had windows and a balcony that looked out over a massive shaft leading deeper into the ground. No doubt at the bottom Pelicans and other support craft lay stored, waiting to spiral up and out into battle when needed. \"But when will the attack come? That\u0027s the question. The Covenant started glassing planets nine years ago. They could hit us next month, or another couple years down the road. In some ways, Lieutenant Keyes, we\u0027re all dead men walking and we know it.\" The outer offices were filled with the hum of smooth-working administration -- privates murmuring into headsets, officers poring over holographic battle readouts; this was the center for a lot of frontier decisions. Keyes threaded past desks to the inner office, and the hum of activity disappeared with the thick blast-proof door creaking to a thud as Mawikizi shut it. \"Keyes, this is Commander Dmitri Zheng.\" Zheng, waiting by the conference table in the corner of the vice admiral\u0027s office, stood up and shook Keyes\u0027s hand. He was taller than Keyes, with sharp cheekbones, piercing gray eyes, and a shaved head. He looked about the same age as Keyes. \"Zheng\u0027s a frigate man, just coming forward to the front.\" The vice admiral sounded tired, Keyes thought. Five years of being back at the top must have worn him out. The man looked gaunt as he sat down at the small conference table. \"Okay, gentlemen, let\u0027s get down to business.\" Mawikizi opened a letter-sized envelope and slid the contents across the table to Keyes. \"Every shipboard Navy CO has to read this. It just went out recently. The order is spreading around to all vessels and all UNSC as we speak.\" Keyes pulled a plastic sheet out and read it. United Nations .Space Command Emergency Priority Order 098831A-1 Encryption Code: RED Public Key: FILE /FIRST LIGHT/ From: UNSC/NAVCOM Fleet H. T. Ward To: ALL UNSC PERSONNEL Subject: General Order 098831A-1 (\"The Cole Protocol\") Classification: RESTRICTED (BGX Directive) The Cole Protocol To safeguard the Inner Colonies and Earth, all UNSC vessels or stations must not be captured with intact navigation databases that may lead Covenant forces to human civilian population centers . If any Covenant forces are detected: . Activate selective purge of databases on all ship-based and planetary data networks. . Initiate triple-screen check to insure all data has been erased and all backups neutralized. . Execute viral data scavengers . If retreating from Covenant forces, all ships must enter Slipstream Space with randomized vectors NOT directed toward Earth, the Inner Colonies, or any other human population center. . In case of imminent capture by covenant forces, all UNSC ships must self-destruct . Violation of this directive will be considered an act of TREASON, and pursuant to UNSC Military Law articles JAG 845-P and JAG 7556-L, such violations are punishable by life imprisonment or execution. Keyes looked back up at Mawikizi. \"Admiral Cole thinks we\u0027re taking some serious hits.\" He thought for a second and realized that since Cole\u0027s major victory at the Battle of Harvest four years ago, there\u0027d been no big victories. \"The order is spreading throughout the UNSC. Keeping Inner Colony and Earth locations secret has become a top priority, particularly here near the front. And that, Lieutenant Keyes, is where you come in. \"I sat in on the board when they sidelined you. I voted for you to stay on your ship. I am most sorry about the medical disqualification from active duty.\" \"So am I, sir.\" Keyes massaged his leg. \"It is a waste to me, just a waste, to leave you in a classroom back on Luna. You are a good tactician, Keyes. I have read your papers and looked at your training. More important, you charged boarders on the Meriwether Lewis with nothing more than a pistol and a barbaric yawp. I like that, Keyes. You stand strong when you need to.\" \"Thank you, sir.\" Keyes was still waiting to hear what came next. A rush of adrenaline was building. He might be getting back on a ship! At the least, maybe a staff position advising fleet movements and strategy on Vice Admiral Mawikizi\u0027s team. He\u0027d have to move Miranda out from Luna to a closer Inner Colony. Not here, too close to the front, but close enough he could easily visit her on leave. \"So, we have an offer for you, Keyes.\" Mawikizi glanced over at Commander Zheng, who\u0027d been watching the exchange in silence. Zheng tapped a button hidden in the table and a scale model of a frigate flickered into existence in front of the three men. Like any other frigate it looked like a bulky rifle with its magazine removed. Only one with two barrels, one on top of each other in front. Unlike the dull gun-metal gray of most, this frigate was midnight black. Toward the bow, the numerals FFG-209 had been overlayed by the computer. Farther back, near the center, was the frigate\u0027s name: Midsummer Night. \"She\u0027s a light frigate.\" Zheng stated the obvious. \"With a few tricks up her sleeves.\" A faint smile cracked his stony exterior as he said that. \"Night is a long-range stealth ship,\" Mawikizi said. \"Like a Prowler, but she packs more of a punch.\" \"But it\u0027s frigate-slow,\" Zheng finished. \"She also has the ability to deliver a large complement of marines and orbital-drop shock troopers, giving her a wider variety of mission abilities.\" \"Which will come in handy,\" said a fourth voice from behind them. Keyes twisted in his chair, surprised that they\u0027d been snuck up on so easily. \"Major Akio Watanabe, of the Prowler Corps. ONI,\" Zheng introduced the addition. Keyes hadn\u0027t heard the door open. But then, that was a spook for you. The Office of Naval Intelligence didn\u0027t believe in announcing themselves to the world; they really liked sneaking up on people. A point of professional pride, no doubt. Keyes still found it creepy and annoying. Watanabe slid into a vacant chair. He wore long sleeves and a high-collared form of gray uniform. His dark black eyes seemed to look through people into the distance. \"I arrived ... just in time, I see.\" He looked around. \"I take it, Vice Admiral, our agreement is still in effect?\" Mawikizi looked truly disgruntled. He sighed. \"I stand by my word, Major Watanabe.\" Zheng tapped a button, and the scale hologram of the Midsummer Night faded away. \"The ship begins her shakedown cruise today, Lieutenant Keyes. We\u0027ll be helping enforce the Cole Protocol for the first three days, getting a feel for the ship.\" Zheng turned to Watanabe. The major nodded. \"After that, there will be sealed orders for the bridge crew that will be available to me after the quick shakedown cruise.\" Keyes frowned and turned to the Admiral. \"Sir, we\u0027ll be working for ONI?\" Mawikizi pursed his lips. \"Only initially. A professional exchange for helping us stealth the frigate.\" \"It\u0027ll be a brief mission,\" Watanabe promised. He glanced at Zheng, who\u0027d folded his arms. \"Then I\u0027ll be out of your hair and you and the vice admiral can play with your new little toy.\" Keyes looked over at Mawikizi. The old Burundian looked like he\u0027d found bird crap on his freshly polished staff car. Then he looked at Keyes and grinned. \"Zheng and I\u0027d like you to be on the bridge. We\u0027re planning for very long recon and long-range Covenant harassment, taking down targets of opportunity, and just causing general hell. We want you because of your excellence in long-range navigation and your tactical skills, as we\u0027ll be using the Night in ways frigates aren\u0027t usually used. We need someone who can really work with Zheng to think outside the box.\" \"How long-range?\" \"Very,\" Mawikizi repeated. \"I know you have family, but we don\u0027t have a lot of time for you to make a decision.\" Keyes leaned forward. \"I won\u0027t lie to you, sir,\" he muttered. \"It\u0027s a hard thing to ask me to leave my daughter.\" Raising Miranda had been the brightest point of being stuck in the Academy. Now that he was faced with a potential position on a ship, Keyes wondered if he\u0027d just been focusing on what he couldn\u0027t have, and not on what he really had. \"I know,\" Mawikizi said. \"I know.\" \"On the other hand, defending our worlds from the Covenant is the best form of fathering I can think of,\" Keyes finished. \"I\u0027d be honored to serve aboard the Midsummer Night. Thank you for giving me the option.\" Technically they didn\u0027t have to ask. It had been a courtesy because he was medaled and taken off the line. They\u0027d made a good choice. There was a lot more bite left in this dog, Keyes thought. \"I have one favor to ask, if I may,\" Keyes continued. \"The Pelican pilot who flew me here. I\u0027d like him transferred to the Midsummer Night.\" Commander Zheng looked at Vice Admiral Mawikizi, who shrugged. \"I don\u0027t see why not. You know the pilot?\" \"Never met him before. But he\u0027s a hell of a flyer and if we\u0027re going to be doing unorthodox missions, he might come in handy. His name is Jeffries.\" \"Consider it done.\" Mawikizi stood up, as did Keyes and Zheng, then finally Watanabe. The vice admiral shook Keyes\u0027s hand. \"Glad to have you aboard, Lieutenant.\" \"Thrilled to be aboard, sir.\" And he was, Keyes realized. Thrilled to be back on the line. Jeffries waited for him, his legs propped up on the controls of the Pelican. When he heard Keyes board the dropship he sat up. \"Know where we\u0027re going, sir?\" Keyes smiled as he stepped up behind the pilot\u0027s chair, looking at the Warthog that had dropped him off barreling away down the fields. \"Yes, Mr. Jeffries, I do. Hail Midsummer Night. They\u0027ll give you coordinates.\" \"Yes, sir.\" \"Also, do you know anything about Commander Dmitri Zheng?\" \"Zheng?\" Jeffries thought for a second. \"He\u0027s been all over the rumornet lately. He was from one of the Outer Colonies. Captained a frigate for a short while.\"","sourceLink":"https://allnovel.net/halo-the-cole-protocol-halo-6/page-3.html","bookId":1638,"book":{"id":1638,"title":"Halo: The Cole Protocol (Halo #6)","description":"Storyline: Halo: The Cole Protocol (Halo #6) In the first, desperate days of the Human-Covenant War, the UNSC has enacted the Cole Protocol to safeguard Earth and its Inner Colonies from discovery by a merciless alien foe. Many are called upon to rid the universe of lingering navigation data that would reveal the location of Earth. Among them is Navy Lieutenant Jacob Keyes. Thrust back into action after being sidelined, Keyes is saddled with a top secret mission by ONI. One that will take him deep behind enemy lines, to a corner of the universe where nothing is as it seems. Out beyond the Outer Colonies lies the planet Hesiod, a gas giant surrounded by a vast asteroid belt. As the Covenant continues to glass the human occupied planets near Hesiod, many of the survivors, helped by a stronghold of human Insurrectionists, are fleeing to the asteroid belt for refuge. They have transformed the tumbling satellites into a tenuous, yet ingenious, settlement known as the Rubble--and have come face-to-face with a Covenant settlement of Kig-Yar . . . yet somehow survived. News of this unlikely treaty has spread to the warring sides. Luckily for the UNSC, this uneasy alliance is in the path of the Spartan Gray Team, a three-man renegade squad whose simple task is to wreak havoc from behind enemy lines in any way they see fit. But the Prophets have also sent their best---an ambitious and ruthless Elite, whose quest for nobility and rank is matched only by his brutality . . . and who will do anything to secure his Ascendancy and walk the Path.","cover":"https://allnovel.net/images/halo-the-cole-protocol-halo-6.jpg","author":"Tobias S. Buckell","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-cole-protocol-halo-6.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:27:30 PM"}}
