{"id":99757,"no":49,"title":"Page 49","content":"\"We are all more than the sum of our sins,\" he said in an even voice. \"You know that better than most people, Leila.\" Then he held out his hand. I stared at it, what I\u0027d experienced through the multiple essences contained in those manacles making horror flit over me. Then other images covered those, my memories of Vlad, so different in comparison. Very slowly, I placed my hand in his and let him help me up. I walked back to the manacles, repressing a shudder. The second time is always easier, I reminded myself. Vlad had ordered my family pulled in, but Maximus had been unable to reach Marty. He might be fine or he might need help, and the only way to find out was to follow the essence trail Marty had left in these restraints the day Vlad had questioned him. Before I grasped the wrist manacles again, I fingered the edge of Vlad\u0027s coat and gave him a faint smile. \"Nice choice. You looked great in this.\" His brow arched. \"Of course I did.\" His indefatigable arrogance made me shake my head, but it also gave me the last bit of strength I needed to grab the metal clamps again. That same swarm of horrendous images bombarded my mind, but as expected, they were fainter, allowing me to fight through them and find the essence thread I was looking for. Once I did, I concentrated until everything else fell away. To my dread, the new surroundings I found myself looking at didn\u0027t appear much better than the ones I was actually in. Instead of dark stone walls, concrete was all around me, the few splashes of color a wooden door in the corner and blood staining the front of Marty\u0027s shirt. Mihaly Szilagyi stood in front of him, wearing another nondescript outfit and holding a knife dripping with red. The silver-haired vampire who\u0027d snapped my legs and left me to die was there, too, restraining Marty while chewing an unlit cigarette and looking bored. I dropped the link with a snarl that came from a part of me I hadn\u0027t known existed. \"I found Marty. Szilagyi\u0027s got him.\" \"No,\" Vlad said again. I paced in front of the fireplace. Despite him turning it into an inferno that was barely contained by the gilded grate, I still felt chilled to the bone. \"I have the right to talk to the bastard who kidnapped my friend,\" I snapped. \"Since we don\u0027t have his phone number, linking to him through my abilities is the only option.\" Vlad settled back into the crimson Louis XV chair, an elbow propped on the armrest, chin balanced on his hand. He looked completely relaxed except for his eyes, which focused on me with unrelenting intensity. \"You link to Szilagyi, and his response will be to torture your friend to a level designated to break you. That\u0027s why he took Martin. He wants you to see what he does to him, but if you\u0027re not looking, then he won\u0027t spare the effort.\" My hair swung with my furious strides. \"Marty was already cut up pretty good, so Szilagyi isn\u0027t waiting for anyone!\" \"That\u0027s for information\" was his pitiless reply, \"but Martin can\u0027t relay anything of real import, so his primary effectiveness lies in your affection. Once Szilagyi realizes he can\u0027t use him to force you to betray me, Martin\u0027s usefulness ends, so if you want to keep your friend alive and in the best possible condition, you won\u0027t link to Szilagyi.\" \"Why doesn\u0027t he find another psychic?\" I muttered. \"I\u0027m not the only one: psychics work with police all the time.\" \"A regular psychic isn\u0027t enough. You can track people in the present and get accurate glimpses of the future. I\u0027ve only met two other people with that ability. One is dead, and the other is having what you might call technical difficulties with his power.\" My fists clenched, currents pulsing so strongly inside me that I half expected the nearest light socket to short-circuit. \"You wouldn\u0027t abandon one of your people to this fate, so don\u0027t expect me to respond any differently, Vlad.\" \"You were at that club less than two hours before those vampires attacked,\" he stated. \"When you spied upon Szilagyi, he was fully clothed while resting under several blankets. He made sure you saw him in nothing but a nondescript concrete room, and a nondescript concrete room is where he has Martin.\" \"What does this have to do with anything?\" I demanded. \"It means that he\u0027s not far,\" he replied, tone implying it was obvious. \"Szilagyi gave the silver-haired vampire orders to kill or retrieve you after they saw surveillance footage of you at the club, so that puts him at less than two hours away. He hasn\u0027t left Romania since or he wouldn\u0027t be so concerned with you seeing details of where he\u0027s hiding, and I doubt it\u0027s a modern or even refurbished house because most of those have heat, yet he used blankets when vampires don\u0027t easily get cold.\" He ticked off the items as he spoke. Put together, they made sense, and I cursed myself for not seeing it, too. \"I have my people scouring all abandoned or seldom used buildings within a two-hundred-mile radius,\" Vlad continued. \"It\u0027s a large area, but soon we\u0027ll either find Szilagyi or force him to run. Once he surfaces, then you, my beautiful psychic, can link to him and see exactly where he is.\" It was a logical plan that tightened the noose around Szilagyi\u0027s neck, yet left Marty to the whims of fate. Maybe Szilagyi would kill him before he ran. Maybe he wouldn\u0027t. Problem was, I didn\u0027t have a better idea. That didn\u0027t mean I was settling for coin-flipping odds on my friend, however. \"If I come up with a way to stick it to Szilagyi and save Marty, promise me you\u0027ll act on it.\" Vlad\u0027s gaze was hard yet steady. \"I don\u0027t want him to die since it would hurt you and he was acting under my orders when he was captured. So if you find a way that doesn\u0027t pose more danger to my people, you have my word that it will be done.\" Chapter 33 I walked through the huge hall, catching glimpses of a few vampires in their discreet yet vigilant positions as I passed. Vlad told me he had some things to attend to before dinner, but I think he sensed that I wanted to be alone. My emotions had been put through the wringer and today still wasn\u0027t over. Soon, I had to sit across from my family and keep up the witness protection charade. If their lives hadn\u0027t been upended in a spectacular way because of me, I would have pled a headache and stayed in my room, but I couldn\u0027t be so selfish. \"Leila,\" a familiar voice hissed. I blinked, seeing my father come out from around the back of the staircase as if he\u0027d been hiding behind it. \"What are you doing?\" I wondered. He walked over, his limp more pronounced from his haste. The effects from the roadside bomb that precipitated his early retirement would stay with him forever.","sourceLink":"https://allnovel.net/once-burned-night-prince-1/page-49.html","bookId":2011,"book":{"id":2011,"title":"Once Burned (Night Prince #1)","description":"Storyline: After a tragic accident scarred her body and destroyed her dreams, Leila never imagined that the worst was still to come: terrifying powers that let her channel electricity and learn a person\u0027s darkest secrets through a single touch. Leila is doomed to a life of solitude...until creatures of the night kidnap her, forcing her to reach out with a telepathic distress call to the world\u0027s most infamous vampire... Vlad Tepesh inspired the greatest vampire legend of all--but whatever you do, don\u0027t call him Dracula. Vlad\u0027s ability to control fire makes him one of the most feared vampires in existence, but his enemies have found a new weapon against him - a beautiful mortal with powers to match his own. When Vlad and Leila meet, however, passion ignites between them, threatening to consume them both. It will take everything that they are to stop an enemy intent on bringing them down in flames.","cover":"https://allnovel.net/images/once-burned-night-prince-1.jpg","author":"Jeaniene Frost","type":"Horror","source":"allnovel","link":"https://allnovel.net/once-burned-night-prince-1.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:45:01 PM"}}
