{"id":99762,"no":54,"title":"Page 54","content":"\"Shoving you away?\" My voice rose as long-buried wounds rocketed to the surface. \"I was a little busy trying to cope with getting Mom killed and electrocuting everyone while reliving their darkest secrets, remember?\" \"Know what I remember?\" While I\u0027d gotten louder, Gretchen\u0027s voice became soft. \"Coming home from school to find you in a bathtub full of blood. Calling 911 while holding your wrist together and praying I wouldn\u0027t have to bury someone else I loved, and I remember that as soon as you got better, you left.\" If she\u0027d screamed it at me, it would\u0027ve been easier, but the quiet despair in her voice cut me deeper than that knife had back then. How could I explain the darkness I\u0027d felt trapped in? Or the conviction I\u0027d had afterward that if I didn\u0027t get away from her, I\u0027d destroy her life more than I already had? I couldn\u0027t explain, and in hindsight, it didn\u0027t matter. \"I was wrong, Gretchen,\" I said, blinking back tears. \"I couldn\u0027t see past my own pain so I let it swallow me up. By the time I fought through it, you wanted nothing to do with me and Dad was wrapped up in his job again. Marty was all I had. That might have been my doing, but I abandoned you once when I shouldn\u0027t have. I\u0027m not making that mistake with Marty now.\" Then I went over and touched her cheek, my new gloves making it possible to do so without hurting her. She swatted my hand away, but her blue eyes were shiny, and redness peeked through her artfully applied makeup. \"I\u0027m not trying to get killed, I just want this over with,\" I said softly. \"Szilagyi wants me for my abilities. I\u0027ll let him think he\u0027s got me, and then Vlad will bring the pain.\" She looked behind me to the vampire I still hadn\u0027t convinced yet. Her chin lifted. \"I\u0027m supposed to trust Dracula with your life?\" \"Not Dracula,\" I said with a faint smile as I turned around. \"Vlad Tepesh, former voivode of Wallachia and the most arrogant, deadly, frightening man I\u0027ve ever met.\" His lips curled with disdainful amusement. \"Compliments won\u0027t sway me any more than the word please, Leila.\" \"You take those as compliments?\" Gretchen was incredulous. \"Of course.\" His smile bared his fangs. \"She named all of my best qualities.\" Then that unrelenting gaze landed on me. \"I\u0027ll consider this as a possible option for later, but for now, the answer is still no.\" \"You promised,\" I said angrily, ignoring the look of surprised approval Gretchen shot toward Vlad. \"You said if I came up with a plan to rescue Marty that didn\u0027t put your people in too much danger, you\u0027d act on it. Well, here\u0027s the plan!\" \"It endangers you too much\" was his implacable reply. \"As my lover, you\u0027re also considered one of my people.\" \"But not as valuable,\" I countered, a hurt I hadn\u0027t known I carried causing me to say the next part. \"You\u0027ve admitted that you\u0027ll never love me, so if something goes wrong, it\u0027s not that hard for you to find another girlfriend. Marty does love me, and he\u0027s the best friend I\u0027ve got. I refuse to abandon him.\" Vlad\u0027s eyes turned flat green and he stood so still that it made looking at him almost painful. Not a breath or twitch disturbed his beautiful, inflexible frame. Even his gaze didn\u0027t waver by the slightest degree. No one alive could hold himself so immobile, and it was as if he showed me the unbridgeable distance between us with that icily rigid posture. \"My people will continue to scour the area,\" he stated after a silence that sliced like knives across my emotions. \"Starting tomorrow, you will also visit nearby prominent vampires\u0027 houses looking for a trace of Szilagyi\u0027s essence. Someone has to be assisting him. Once we find out who, that will lead us to your beloved friend.\" Then he walked away, throwing one last scalding comment over his shoulder. \"If you need something else tonight, you\u0027ll find me in the dungeon, doing what I do best.\" Chapter 36 I was glad Vlad was occupied with his gruesome task. It gave me time to mull our latest spat without worrying that he was clued into my thoughts since his \"due diligence\" policy meant the prisoner would receive all his attention. To help take the edge off, I took a bath and drank three glasses of wine while I quietly acknowledged the reason behind my unexpected venom toward him tonight. It wasn\u0027t just frustration because he refused to implement my plan. It was because I\u0027d done the stupidest thing possible-started to fall in love with a man who would never love me. Sure, Vlad might care for me in his fashion, but he\u0027d never allow himself to be emotionally vulnerable enough to love. With his usual brutal honesty, he\u0027d stated that up front. I thought I could deal with it, but somewhere along the lines, this complicated, mesmerizing, often terrifying man had gotten so deeply beneath my skin that he\u0027d pierced my heart. Now, I wasn\u0027t so sure that having most, but not all, of him would be enough, and the hell of it was, I still didn\u0027t want to let him go. Maybe I wasn\u0027t the only one with psychic abilities, I thought. Unless something drastic changed, Marty would be dead on in his prediction that Vlad would break my heart. The last thing I felt like doing was sleep, but I\u0027d need to be clearheaded tomorrow if I was using my powers to hunt for Szilagyi. A couple hours of restless tossing and turning later, I\u0027d just started to drift off when sharp raps at the door startled me. Vlad wouldn\u0027t knock, and Maximus was busy helping him play hide-the-hot-poker on Szilagyi\u0027s captured henchman. \"Leila.\" My father\u0027s voice, followed by another series of raps. \"Let me in. We need to talk.\" Gretchen, I thought with a mental groan. She must\u0027ve told Dad about what she overheard earlier. Why hadn\u0027t I asked Vlad to glare her into keeping her mouth shut? I got up, putting a robe over my silk nightgown before I opened the door. My father came inside, his rapid but thorough glance taking in the area that was a smaller, paler green, and more feminine version of Vlad\u0027s bedroom. \"Where is he?\" he asked without preamble. \"Torturing the hell out of an enemy combatant he captured tonight,\" I replied with equal abruptness. \"And this is the man you\u0027re risking your life for?\" Hugh Dalton had the kind of hardened, self-possessed stare that some vampires a hundred years older hadn\u0027t manage to perfect, and he turned it on me with full force. It bounced off. \"No, I\u0027m risking it for myself, Marty, and a nice boy who helped save me recently and then got killed by the vampire I\u0027m trying to take down,\" I said coolly. He spun in a half circle and paced a few steps away, his limp making the strides shorter and less graceful than his former militarily precise movements.","sourceLink":"https://allnovel.net/once-burned-night-prince-1/page-54.html","bookId":2011,"book":{"id":2011,"title":"Once Burned (Night Prince #1)","description":"Storyline: After a tragic accident scarred her body and destroyed her dreams, Leila never imagined that the worst was still to come: terrifying powers that let her channel electricity and learn a person\u0027s darkest secrets through a single touch. Leila is doomed to a life of solitude...until creatures of the night kidnap her, forcing her to reach out with a telepathic distress call to the world\u0027s most infamous vampire... Vlad Tepesh inspired the greatest vampire legend of all--but whatever you do, don\u0027t call him Dracula. Vlad\u0027s ability to control fire makes him one of the most feared vampires in existence, but his enemies have found a new weapon against him - a beautiful mortal with powers to match his own. When Vlad and Leila meet, however, passion ignites between them, threatening to consume them both. It will take everything that they are to stop an enemy intent on bringing them down in flames.","cover":"https://allnovel.net/images/once-burned-night-prince-1.jpg","author":"Jeaniene Frost","type":"Horror","source":"allnovel","link":"https://allnovel.net/once-burned-night-prince-1.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:45:01 PM"}}
