{"id":99719,"no":9,"title":"Page 9","content":"\"I heard you were looking for me,\" a now-familiar voice said mockingly. The instant heat and smoke had me looking for a way out, but before I could attempt to crawl away, a blur of violence erupted in front of me. It was so fast I was reminded of the cartoons I\u0027d watched as a kid, only this whirling mass of limbs was frighteningly real. With their incredible speed and the smoke making everything hazy, I couldn\u0027t tell who was winning, or if more than two people were involved in it. If I got caught up in that deadly maelstrom, I\u0027d be finished, but this was my chance. I took in a deep breath for courage, coughed at the smoke, and crawled to the nearest light socket. Then I placed my right hand over it, feeling the instant surge as the currents in me connected to the voltage in the socket. Energy flooded me like an adrenaline shot to my heart, followed by a searing ache along my nerves. The lights blinked out, but even with the sudden darkness and my eyes watering with pain and smoke, I could still see the window Vlad had decimated. Flames and some jagged pieces of glass clung to the frame, making it look like the mouth to hell. A few feet away, several vampires were locked in a death match that defied tracking with the naked eye. None of that made me hesitate. I took in another coughing breath and then hurtled toward the window, jumping at the last second as if the floor were a springboard. Chapter 6 \"Leila, don\u0027t!\" a harsh voice shouted. Too late, not that I would\u0027ve obeyed anyway. My jump was high enough to clear the three-foot ledge, and I tucked into a ball immediately, rolling as soon as I hit the ground. My arms protected my head for another few bruising, scrape-inducing tumbles until something hard stopped my momentum. Air burst from my lungs at the impact, pain radiating through my body. I wanted to stay hunched in a protective ball, but there was no time. I rose, assessing my options. I\u0027d slammed into the front of a car with my wild dive, but beyond that was the welcoming darkness of the parking lot. I shook my head to clear the ringing that probably indicated a mild concussion and sprinted toward it as fast as my aching muscles could take me. \"Stop her!\" a voice commanded behind me. I glanced back while adding some extra oomph to my stride. Smoke and flames still poured from the ruined window, but no one chased me. With luck, they\u0027d be occupied long enough for the fire department to distract them from coming after me. Bye bye, biters! I thought, smiling despite pain radiating through me. Too bad I hadn\u0027t been wearing my running shoes when I was kidnapped. Out of nowhere, something snatched me from behind with what felt like bands of steel around my midsection. I doubled over, almost vomiting from the abrupt resistance that made me instantly come to a stop. For a dazed second, I didn\u0027t know what happened, but then I saw dark arms looped around my waist and felt something large and solid behind me. \"I\u0027ve got her,\" a male voice called out. Then a cool mouth pressed to my ear. \"Don\u0027t bother with the stun gun again. It won\u0027t be enough against me.\" Wait until my new assailant realized my entire body was a stun gun. He must be another vampire or he\u0027d be on the ground from touching me after the extra voltage I\u0027d absorbed from the light socket-and that was just what my body gave off. My right hand was now a formidable weapon, but I needed more leverage to use it to its best advantage. \"All right,\" I said, trying to sound meek. \"You\u0027re hurting me,\" I added to see if that made him loosen his grip. It did. So my captor wasn\u0027t cruel like Jackal or the others. Without that unyielding grip cementing me in place, I was able to step away enough to glance behind me. The vampire who\u0027d grabbed me was the brawny African American I\u0027d spied Vlad talking to earlier today. Guess the fire starter had arrived with backup, but holding me hostage hadn\u0027t been part of our deal. The man looked me up and down, grimacing when his gaze followed the scar that zigzagged from my temple all the way to my right hand. I was so used to that pitying reaction; it didn\u0027t even elicit a twinge of self-consciousness. Right now, I was grateful for every sympathy-inducing advantage I had. \"I think I sprained my ankle,\" I said, holding one foot off the ground for effect. Hey, I was getting better at this lying thing! \"Could you look at it?\" The vampire let me go, starting to kneel just as I\u0027d hoped. His attention was on my ankle as I extended it, leaning forward like I was having trouble balancing. One touch of my right hand on his head should incapacitate him long enough for me to run away. I reached out- \"Touch him, and I revoke my promise not to harm you.\" Vlad\u0027s voice cut through the night air, freezing my hand an inch away from its goal. The other vampire stood at once, back on full alert. Shit! I silently screamed. How had Vlad known what I was going to do? \"The same way I knew you were spying on me before,\" he replied with sardonic amusement. \"You have your unusual abilities. I have mine, and mind reading is one of them.\" Mind reading. No wonder he\u0027d been able to hear me when I established a link with him! Slowly, I turned toward his voice. Flames still shot from the hotel window, illuminating Vlad in an orange glow. He strode toward us while dragging someone who was so covered in soot and scabs, I couldn\u0027t tell which of my former captors he was. \"Where are the others?\" I asked, striving to sound calm. His features were still hazy from smoke and shadows, but I caught a glimpse of white teeth as he smiled. \"Ashes.\" His captive tried to pull away, but Vlad\u0027s grip tightened until his fingers disappeared into the blackened flesh beneath them. I looked away, my stomach twisting. Sirens cut through the mutterings of people who came out of their hotel rooms to gawk at the blaze. Vlad was unperturbed, as if torching a hotel room and then restraining a charred vampire was what he normally did on a Thursday night. \"You have what you wanted,\" I said, still managing to sound composed. \"Now hold up your end of our agreement and let me go.\" That emerald gaze seemed to pierce me to the quick. \"I agreed not to harm you and I haven\u0027t. As for letting you go, I will . . . after we have a more detailed conversation.\" Despair crashed over me. Vlad\u0027s idea of a detailed conversation probably meant torture followed by execution. I should have known someone who\u0027d callously burned several people to death wouldn\u0027t honor his word to let me go. But then, unbelievably, I heard Marty\u0027s voice over the blare of sirens. \"Run, Frankie, run!\" Vlad swiveled toward the sound just in time to see Marty barreling toward him as though he\u0027d been fired from a cannon. I\u0027d wondered why he hadn\u0027t done anything when I was kidnapped, but he must have followed me and stayed hidden until he thought he had the best chance to rescue me. Problem was, this wasn\u0027t it.","sourceLink":"https://allnovel.net/once-burned-night-prince-1/page-9.html","bookId":2011,"book":{"id":2011,"title":"Once Burned (Night Prince #1)","description":"Storyline: After a tragic accident scarred her body and destroyed her dreams, Leila never imagined that the worst was still to come: terrifying powers that let her channel electricity and learn a person\u0027s darkest secrets through a single touch. Leila is doomed to a life of solitude...until creatures of the night kidnap her, forcing her to reach out with a telepathic distress call to the world\u0027s most infamous vampire... Vlad Tepesh inspired the greatest vampire legend of all--but whatever you do, don\u0027t call him Dracula. Vlad\u0027s ability to control fire makes him one of the most feared vampires in existence, but his enemies have found a new weapon against him - a beautiful mortal with powers to match his own. When Vlad and Leila meet, however, passion ignites between them, threatening to consume them both. It will take everything that they are to stop an enemy intent on bringing them down in flames.","cover":"https://allnovel.net/images/once-burned-night-prince-1.jpg","author":"Jeaniene Frost","type":"Horror","source":"allnovel","link":"https://allnovel.net/once-burned-night-prince-1.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:45:01 PM"}}
