{"id":15775,"no":15,"title":"Chapter 15","content":"ONE evening at dinner, about a fortnight later, “What’s the matter, Elias?” the rabbi asked. “You’re not feeling sick, are you? Or blue? Or worried about any thing?” \n \n “Why, no,” Elias answered, “I feel all right. Why do you ask?” \n \n “Oh, I don’t know. I thought you were looking a little out-of-sorts. Likely enough, it was only an idea.” \n \n “The truth is,” Elias presently volunteered, “that, so far from feeling blue or low-spirited or anything of that kind, I don’t seem to feel much of any thing at all. I’m sort of sluggish—dull—dead-and-alive. I’d give a good deal for a sensation, an excitement. I’ve been feeling this way pretty much all the time since—for the last two weeks. Heavy, thick, as though my blood had stopped circulating. I wish you’d stick a pin into me.” \n \n “Oh, you need a little amusement, a little fun, something to take you out of yourself. That’s all. Why don’t you go to the theater?” \n \n “No, thanks. I’m not fond of the theater. Besides, it’s too hot.” \n \n “Well, then, why don’t you make a call?” \n \n “A call! Pshaw; is that your notion of excitement?” \n \n “Well, it’s better than sitting at home, and moping, isn’t it?” \n \n “And, any how, whom do I know to call on?” \n \n “Whom do you know? Mercy upon me! I could name fifty people, whom you not only know, but to whom you actually owe calls. It’s really abominable, the way you neglect, and always have neglected, your social duties. There’s no excuse for it. If—if you were an old recluse like me, it would be different.” \n \n “I don’t see how. What if you were a young recluse, like me?” \n \n “Ah, but nobody has a right to be a young recluse. It is only when we get along in years, that we are entitled to withdraw from the world. Besides, it’s narrowing, it’s hardening. You need contact with other people, to broaden your mind, and keep your sympathies alive. If you avoid society while you’re young, the milk of human kindness will dry up in your bosom. You’ll get coldblooded, selfish, indifferent.” Which amiable sentiments, falling from the lips of the rabbi, possessed a peculiar interest. “Come,” he added, “run up-stairs, and put on your best suit, and go make a call.” \n \n “Again I ask, whom on?” \n \n “On—on anybody. I’ll tell you whom. Call on Mr. and Mrs. Koch.” \n \n The pronunciation of this name has been anglicized into Coach. \n \n “Which Koch? A. Hamilton?” \n \n “No, of course not. Washington I.” \n \n “Oh, heavens! I haven’t called on them these two years. I’d be afraid to show my face inside their door. They’d overwhelm me with reproaches.” \n \n “Well, what of that? You could stand it, I guess. They’re very nice people, the Kochs; people whom it is worth while to be on good terms with—so warm-hearted and unpretentious, and yet with their hundreds of thousands behind them. There isn’t a smarter business man in New York City than Washington I. Koch, nor a more honest, nor a more open-handed. Look at that stained glass window he gave the congregation. And then, at the same time, he’s a man of ideas, a well-informed man; and best of all, he’s a pious Jew.” \n \n “Well, I’ll tell you what I’ll do,” said Elias; “I’ll call on them, if you’ll come along.” \n \n “I! Nonsense! I called on them last New-Year’s, and shall call again next. That’s the most that can be expected of me.” \n \n “Well, I shouldn’t dare to go alone. If you’d come along, to keep me in countenance, I’d go. But alone—no, never.” \n \n There was an interval of silence. Suddenly the rabbi said, “Well, I declare, I’ll do it. I’ll do it, just to encourage you. There; let’s go up-stairs and dress.” \n \n Pretty soon they left the house and sauntered westward arm-in-arm. Elias wore the Prince Albert coat that he had had made to be married in. \n \n It was a hot night, and it had all the qualities characteristic of a hot night in New York. The air was redolent of bursting ailanthus buds. Strains of music, more or less musical, were wafted from every point of the compass—from behind open windows, where people sang, or played pianos; from the blazing depths of German concert saloons, where cracked-voiced orchestrions thundered discord; from the street corners, where itinerant bands halted, and blew themselves red in the face; and from the indeterminate distance, where belated hand-organs wailed with mechanical melancholy. Third Avenue, into which thoroughfare Elias and the rabbi presently turned, was thronged by many sorts and conditions of men and women clad in light summer gear, and drifting onward in light, languid, summer fashion. It was intensely hot and oppressive; and yet, somehow, it was productive of a certain unmistakable exhilaration. The sense one got of busy, teeming human life, was penetrating and enlivening. \n \n They walked up to Eighteenth Street, where they took the Elevated Railway. At Fifty-ninth Street they descended, and thence proceeded to Lexington Avenue. On Lexington Avenue, just above Sixty-first Street, the Kochs resided. Out on the stoops of most of the houses that they passed, the inmates were seated, resting, gossiping, trying to cool off—the ladies in white dresses, the gentlemen often in their shirt-sleeves. Here and there, some of them were partaking of refreshments; beer, sandwiches, or cheese that savored of the Rhine. Here and there, some of them had fallen asleep. Here and there, a couple of young folks made surreptitious love, and, consumed by inner fires, forgot the outer heat. A pervasive odor, compounded of tobacco smoke and eau-de-cologne, assailed the nostrils. What snatches of conversation could be overheard, were either in German, or in English pronounced with a strong German accent. \n \n They rang the Kochs’ door-bell, and were ushered by a white-capped, flaxen-haired M?dchen into the drawing-room. \n \n The drawing-room was gorgeously and elaborately over-furnished. A bewildering arabesque, in gold, vermilion, and purple, decorated the ceiling. A dark, pseudo-?sthetic paper, bearing huge pink apricots embossed upon a ground of olive-green, covered the walls. The gas fixtures were of brass, wrought into an intricate design, and burnished to the highest possible brilliancy. The globes were alternately of ruby and emerald tinted glass. There were a good many pictures; two or three family portraits in charcoal, and several bits of color. Of the latter, the one above the mantelpiece was the largest. A blaze of crimson and orange, deep-set in a massive gilt frame, it proved, on close inspection, to be a specimen of worsted-work; and represented, as a device embroidered upon the margin testified, the Queen of Sheba playing before Solomon. The Queen had beautiful gambooge hair, and ultramarine eyes. Her harp was of ivory, with strings of silver; her costume, décolleté, of indigo velvet, trimmed profusely with handsome gold lace. Solomon—it is to be hoped, for his own sake, that Solomon in all his glory was not arrayed like this flamboyant effigy of himself. In a robe of gold brocade, lined with scarlet satin, and bearing upon his brow a richly bejeweled crown, that must certainly have weighed in the neighborhood of twenty pounds, the sagacious monarch looked wretchedly hot and uncomfortable. The rest of this apartment was in perfect keeping. The chairs were of ebony, upholstered in stamped red velvet. \n \n Before long Mr. Koch came in. He wore alligator-skin slippers, and a jacket of pongee silk. Between the fingers of his left hand, he carried a half-smoked cigar. He was a short, thick-set, pale-complexioned man, of forty, or thereabouts; inclined to baldness; with clear, light-gray eyes, and a straw-colored mustache waxed in the style of the Second Empire. He looked very clean, very alert, very good-tempered, and yet as though he could become as hard and as sharp as flint, if occasion demanded. He welcomed the rabbi with warm and deferential courtesy. Then, turning to Elias, in hearty, jovial, hail-fellow-well-met manner: “Well, Mr. Bacharach, how goes it? It’s a dog’s age since we’ve seen you, and no mistake. Have a cigar?” \n \n With one hand, he was subjecting Elias’s arm to a vigorous pumping. With the other, he offered him a tortoise-shell cigar-case. \n \n “They’re genuine,” he remarked. “I’ll warrant them. Imported by my brother-in-law for his private consumption. Cost you a quarter apiece straight, if you bought them in New York. Hoyo de Montereys.” \n \n Elias selected one. Mr. Koch produced a silver match-box, extracted a wax match, scratched it, and held it while his guest got his cigar alight. \n \n “Now,” said he, flirting the match flame into extinction, “I’m going to ask you gentlemen to step down stairs to the basement. You’ll find the whole family down there, engaged in an impressive ceremony. They’re bidding good-night to the baby, whom my wife is about to put to bed.” \n \n In the basement, or dining-room (which, in the Koch establishment, pursuant to a common Jewish habit, was made to serve also as a general sitting-room), as many as seven or eight ladies and gentlemen, some seated, some standing, were gathered around the extension-table, upon which, in the approximate center of it, sprawled a fair, fat, two-year-old baby. The spectators were all smiling benevolently at him, addressing complimentary remarks to him, and exchanging complimentary notes about him among themselves. All the gentlemen were smoking. \n \n “Lester, was you a good boy?” \n \n “Mein Gott! He kroes bigger every day.” \n \n “Laistair, was you sleeby?” \n \n “Tust look at that smile! Ain’t it perfectly grand?” \n \n “Laistair, haif you got a kiss for grainpa, before you go to bed?” \n \n And so forth, and so forth: all of which Master Lester acknowledged with a vague grin, and a gutteral goo-goo-goo. \n \n But at the entrance of Mr. Koch, flanked by Elias and the rabbi, the whole company deserted Lester, and making a rush forward, surrounded the visitors. The rabbi, every body greeted with subdued respect, as was due to his sacerdotal quality. But over Elias, they gushed. \n \n Mrs. Koch, a thin, wiry little woman, with a prominent nose and a pleasant manner, piped in her shrill treble: “Oh, Meester Bacharach! I didn’t naifer expaict to haif this honor. I ain’t seen you in this house for two—for three—years, already: dot time you called with your mamma.” \n \n Mrs. Koch’s mother, Mrs. Blum, a dumpy, rubicund old lady, with rather a sly, rollicking air about her, held his hand, and swayed her head like an inverted pendulum from side to side, and smiled incredulously, and kept repeating, “Vail, vail, vail!” \n \n Then came sprightly Mr. Blum, short, corpulent, and florid, like his wife; with a glossy bald pate, a drooping white mustache, and white mutton-chop whiskers, which left exposed a very red and shiny double chin. “My kracious? Was dot Elias Bacharach? Du lieber Gott! How you haif krown, since laist time you was here!” He held Elias off at arm’s-length, and scrutinized him carefully. “Excuse me,” he demanded all at once; “where you get dot coat mait? Washington, come over here, and look at Elias Bacharach’s coat. Dem must be Chairman goots, hey?” He plucked at the material of the unfortunate garment with his thumb and forefinger, and stroked it with the palm of his hand. “Dot’s a goot coat,” he declared at last. “What you pay for it?” He lifted up one of the skirts, and examined the lining. He was a veritable child of nature, this Mr. Blum; and besides, he and his son-in-law constituted the firm of Blum \u0026 Koch, manufacturers and jobbers of ready-made clothing, Franklin Street, near Broadway. \n \n Elias and the rabbi paid their respects to the baby; after which, Mrs. Koch picked him up and carried him off. \n \n “Mr. Bacharach,” said Mr. Koch, grasping him by the elbow, “don’t you know my brother-in-law, Mr. Sternberg?—Guggenheim \u0026 Sternberg, wholesale tobacco. My sister, Mrs. Sternberg; my other sister, Mrs. Morgenthau; my niece, Miss Tillie Morgenthau: Mr. Bacharach.” \n \n To each of these persons, in turn, Elias made his obeisance. \n \n Mrs. Morgenthau was in appearance a feminine duplicate of her brother; short, thick-set, smart-looking, and with an air of having lots of go; what is called a bouncing woman. \n \n “Delighted to make your acquaintance,” she announced, in a loud, robust voice, and with emphasis, as though she wanted it understood that she wasn’t fooling, but meant exactly what she said. She shook his hand, giving it a virile grip. \n \n Miss Tillie Morgenthau was a young lady of eighteen or twenty, taller than her mother, exceedingly taper in the waist, and of an exceedingly fresh complexion; decidedly a pretty girl, with plenty of waving black hair, a pair of bright blue eyes, a shapely red mouth, and a generous provision of tiny teeth, regular and of pearly whiteness. \n \n “Oh, I suppose Mr. Bacharach don’t remember me,” she said, pouting playfully. She pronounced the personal pronoun I, like the interjection Ah. \n \n “Oh, on the contrary,” protested Elias, trying hard to remember whether he had ever seen her before. \n \n “Now, Ah’m perfectly sure you don’t,” she insisted. “But All’ll tell you. It was at the Advance Club, winter before last. Mr. Greenleaf introduced you to me—Charley Greenleaf. Do you belong to the Advance?” \n \n No, Elias said; he was not a member of any club. \n \n “Well, now,” called out Mr. Koch, to the company generally, “now that the baby’s gone to bed, I propose that we adjourn to the summer-house, and try to get cooled off.” \n \n An exodus at once began; and presently they were all established, a picturesque, free-and-easy group, upon the stoop. Elias found himself at Miss Tillie’s side. \n \n “Fearfully hot, isn’t it?” she observed. \n \n “Very, indeed,” agreed Elias. \n \n “It always is hot over here on Lexington Avenue—Jerusalem Avenue, I call it, on account of the number of Jews that live over here. Pretty good name for it, don’t you think so?” \n \n “Quite good, yes,” he assented. \n \n “But over where we live, it’s much cooler. Have a breeze there most all the time.” \n \n “Ah, where is that?” \n \n “Beekman Place—clear down on the edge of the river. Number 57. Be happy to have you call on us there. We—mamma and I—we live with my uncle and aunt, the Sternbergs. It’s fearfully out of the way, but it’s grand when you get there.” \n \n “Yes, I’ve heard so,” Elias said. \n \n “Musical, Mr. Bacharach?” she inquired. \n \n “Well, I don’t know. I’m very fond of music.” \n \n “Sing?” \n \n “No.” \n \n “Play?” \n \n “No, not any more. I used to, a little. But I gave it up.” \n \n “Oh, my! What a pity! I think it’s perfectly elegant for a gentleman to play, don’t you? But so few of them do. I think it’s simply awful.” \n \n “I suppose you play, of course?” \n \n “Oh, I should say so. Yes, indeed. Music’s my forte. I teach, too. Give lessons in Dr. Meyer’s conservatory, and take private pupils.” \n \n “Won’t you play for us a little to-night, then?” \n \n “Oh, gracious, no. It’s too hot. Ah’m about melted, as it is. Ain’t you?” \n \n “Well, it is pretty warm,” Elias confessed, in \u0026 reflective tone. \n \n At this juncture, the white-capped maid-servant began to circulate among the people, bearing a large tray, upon which reposed a pitcher, a couple of slim bottles, and half a score of cut-glass tumblers. \n \n “Beer or wine, Mr. Bacharach?” cried Mr. Koch, from above. “Take your choice, and help yourself. They’re both gratis.” \n \n Elias poured out a glass of wine for Miss Tillie, and for himself a glass of beer. \n \n “Have a fresh cigar?” cried Mr. Koch. \n \n “No, thank you. I haven’t finished this one,” returned Elias, who had allowed the fire of his cigar to go out. \n \n “Well, if you ain’t comfortable, speak up, that’s all,” his host concluded, and became silent. \n \n “Oh, by the way, Meester Bacharach,” piped Mrs. Koch, who, having disposed of Lester, had rejoined the company, “I hear dot we haif to con-kratulate you.” \n \n “Indeed? What about?” inquired Elias, unsuspiciously. \n \n “We hear dot you was encaged. Was it true?” \n \n “Oh!” he cried, taken aback. He colored up; but the darkness hid his blushes. \n \n “Vail?” pursued his good-natured tormentress. \n \n “No—not at all—an entire mistake,” he stammered. \n \n “Oh, dot’s too baid. Ain’t you naifer going to get married?” \n \n “I don’t know. I guess not,” he said. \n \n At this, there was a universal murmur of disapproval. \n \n “Dot’s just the way with all the young fellers, now-a-days,” Mr. Blum exclaimed. “They don’t none of them want to get married. It’s simply fearful; hey, Dr. Gedaza? When me and you was young men, we’d be ashamed to be single at his age, hey? Why, a man ain’t a goot Jew, if he don’t get married. Might just as well be an American right out. If I was you, Elias Bacharach, I’d be afraid. The Lord will punish you. You better get married, or look out.” \n \n “Yes, that’s so.” \n \n “There ain’t any doubt about that.” \n \n “A young fellow ought to get married, and no mistake.” \n \n Remarks such as these went up from all directions; and poor Elias felt like the most miserable of sinners. \n \n Tillie came to his rescue. “Oh, let Mr. Bacharach alone,” she cried. “He ain’t dead yet. Give him time.” Then, turning to the victim, “Don’t you mind them. They’ve got marriage on the brain.—How are you going to spend this summer? In the country?” \n \n “Well I haven’t made any plans yet,” he answered; “have you?” \n \n “Oh, yes—we’re going to the Catskills—Tannerstown—all of us. Ever been there? It’s perfectly ideal—the grandest place I ever did see. And such a lot of nice people! I must know a hundred at the very least, who are going there this season—Advance Club people—friends of my uncle Wash. You said you didn’t belong to the Advance. Why don’t you join? If I were a man, wouldn’t I, though! They give the most elegant balls that you can possibly imagine. Mamma and I go to all of them. Mamma took the prize at the last.” \n \n “Prize for what?” asked Elias. \n \n “Why, don’t you know? They give a prize for the most original costume; generally a book, or a work of art. Mamma’s was a magnificent picture album, with hinges and clasps of hammered silver—solid, not plated. The ladies all go in costume, and each one tries to wear the most curious and surprising. Well, for instance, one lady represented a match. She had a dress just perfectly covered with burned matches, and matches in her hair, and for ear-rings, and every thing. Then, another lady, she went as a pack of cards; and her dress was just one mass of patch-work, and each patch was a card. And then mamma—Well, guess. What do you suppose mamma represented?” \n \n “I give it up.” \n \n “Well, it was simply the grandest idea you can possibly imagine. It took the whole room by storm. Gracious me, how they did laugh and applaud! She went as a fireman.” \n \n “A—what? M gasped Elias. \n \n “Yes, a fireman. She had a red shirt with brass buttons, and a helmet, and a badge, and a hatchet, and a big black mustache, like a regular member of the department. Well, she did look just too funny for any thing. You ought to have been there. You’d have laughed to die. I had a side-ache for a week afterward. She and the match were rivals; and there was quite a lot of betting as to who would come in first. But, as the judge who made the awards said, she did her duty, and extinguished the match. That was pretty good, wasn’t it? She got the prize, and the match got an honorable mention.” \n \n “And your own costume?” Elias questioned. “What was that like?” \n \n “Oh, I went in an ordinary white dress. Mamma thought I was too young to take a character. But next fall—Promise you won’t tell. You mustn’t breathe a word of it, will you? Next fall, I’m going as an ear of corn.” \n \n “Why,” exclaimed Elias, “how can that be managed?” \n \n “Oh, we’ve got it all designed; and my Uncle Wash, he’s having some stuff woven on purpose, to represent the kernels. It’s right in his line, you know. You wait till you see it. It will be simply the most ideal thing you can possibly imagine. But please don’t mention it. Some one else might do it first, and get in ahead of me, if you did.” \n \n “You may rely upon me,” Elias vowed. “I’ll be as secret as the grave.” \n \n The rabbi now rose, and began to make his adieux. Elias followed his example. \n \n “You two gentlemen come up here to dinner next Sunday afternoon, will you?” demanded Mr. Koch. \n \n Before Elias had had a chance to decline, if he had been disposed to do so, the rabbi replied, “We will, with pleasure. Thank you.” \n \n On the way home, “Well,” the rabbi asked, “did you have a good time?” \n \n “Oh, fair,” returned Elias. “Queer set, aren’t they?” \n \n “Well, they have certain mannerisms, yes. But you mustn’t mind a superficial thing like that. They talk too loud, and their grammar isn’t of the choicest; but they’re thoroughly kind-hearted and well-meaning; and they’re not wanting in brains, either, though they may be a trifle unpolished. Mr. Koch himself is a remarkably intelligent man, a man of ideas. You get to talking to him sometime, and you’ll find out. How did you like that little Miss Morgenthau?” \n \n “Oh, she’s quite amusing. Not a bad little thing. Very raw and untamed, but good-natured enough, I dare say.” \n \n “Her father, Reuben Morgenthau, was a professional, musician—one of the best pianists I ever heard; and she is said to have inherited his talent. He was lost at sea when she was a baby. Good-looking girl, isn’t she? I suppose Washington I. Koch will make her a handsome settlement, when she gets married. Yes, I suppose he’ll do something very handsome, indeed.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1813/52688.html","bookId":1043,"book":{"id":1043,"title":"The Yoke Of The Thorah","description":"简介： IT was the last day of November, 1882. The sun had not shone at all that day. The wind, sharp-edged, had blown steadily from the northeast. The clouds, leaden of hue and woolly of texture, had hung very close to the earth. Weather-wise people had pre...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1813","creation":"Aug 1, 2019 12:24:13 AM","modification":"Aug 1, 2019 12:24:13 AM"}}
