{"id":76332,"no":16,"title":"Page 16","content":"Even as he posed the question again, his answer was still the same. Yeah, she was worth it. God only knew why but there it was. He couldn’t simply walk away from her, no matter that it was the path of least resistance. He was stuck, for lack of a better word. In between a rock and a hard place no doubt. His fate, his future, was in the hands of this delicate woman and the hell of it was she had no idea. No inkling that she had him so tied in knots. He massaged his nape, weariness assailing him. He’d wrapped things up in Dallas a day early, eager to be back, to see for himself how Kylie was faring. Now he realized he never should have left, no matter that this contract was huge for his company. She’d needed him and he’d failed her. Just as he’d failed her their last night together. That would all end now because going forward she was his primary concern. THIRTEEN KYLIE climbed through the heavy veil of sleep, realizing at once that something was very different. Oddly, no panic registered. Just a sense of . . . well-being. She felt warm and safe. She emitted a contented sigh and snuggled deeper into the strong embrace that surrounded her like the thickest blanket. “Hey, you with me?” She blinked in surprise, her eyelashes slowly fluttering open. Only to collide with a very familiar, very warm gaze. Jensen? She struggled to remember all that had happened. For that matter, where the heck was she? “Don’t panic, baby. You’re safe. I’ve got you.” His murmur of reassurance calmed her but her brow furrowed in silent question. “You collapsed at the office. Do you remember?” More came into focus, and she blinked, realizing they were in bed. Together. And not her bed. She pushed herself upward, surprised at the strength it took to perform such a simple function. “Easy. Don’t move too fast,” he cautioned. “Take it nice and slow. Breathe for me, okay?” “I’m okay,” she whispered. “Just confused. Where are we?” “My house. I brought you here. You worried the hell out of me, Kylie. When was the last time you slept? You were obviously running on fumes. Thank God I got there when I did.” She glanced around, taking in the masculine feel of the room. The furnishings. The colors and the huge bed they currently occupied. She was nestled up close to him, their legs entwined. Immediately her gaze shot downward, and she was relieved to see she was fully clothed. Surely she’d remember if they’d had sex! He nudged her chin upward with a gentle finger, his gaze sincere. “Nothing happened, baby. I wouldn’t take advantage of you that way. You passed out at the office and I brought you here and put you to bed. You’ve slept sixteen hours straight.” Her eyes widened in shock and then horror. “Oh my God. I should be at work! What time is it?” His eyes narrowed and his lips turned down into a frown. “Don’t get any ideas. You aren’t going near the office any time soon. What you’re going to do is stay here and catch up on much-needed rest. You aren’t going to so much as lift a finger for the next several days and that’s not negotiable.” She had absolutely nothing to say about that. What could she? She stared at him in bewilderment. Why was she here? Why hadn’t he washed his hands of her? “What are you thinking?” he murmured, his brow furrowing in concentration. “I’m wondering why you’re here, or rather why I’m here,” she blurted. “I can’t imagine why you didn’t run as fast and as far away from me as possible after what happened.” His expression softened and he stroked a hand down her arm to rest on her hip. “I’m not going anywhere, baby. And neither are you for the time being.” “You can’t possibly want me after what happened,” she whispered. “I can and I do,” he said simply. “You’re going to have to work a hell of a lot harder than that to scare me away. You and I are inevitable, Kylie. I’ve accepted that. Now you have to as well.” Warmth rushed through her veins and with it, relief. Overwhelming, mind-boggling relief. She sagged against the pillow, her strength leaving her. Why was she so relieved? Shouldn’t she be pissed? Shouldn’t she be arguing the point? Convincing him that they weren’t possible and that he should leave her alone? What did it say that the only reaction she could conjure to his autocratic demand was . . . relief? “I seem to do nothing around you except freak out,” she muttered. “You have to be some kind of a masochist to sign up for more.” Humor glinted in those dark eyes. “We’ll get through it, baby. Together.” Longing like she’d never experienced flooded her heart. And hope. Genuine and unfettered hope. He wasn’t giving up on her. He was sticking it out, and he’d seen her at her absolute worst. If he could get past that, he could get past anything, couldn’t he? She hadn’t realized just how much she’d hoped for such a thing until now. She’d braced herself for the inevitability of his rejection. She’d known with absolute certainty that he’d drop her like a bad habit after the ass she’d made of herself on their date. And yet here he was, resolve shining in those beautiful eyes. “Together,” she whispered. Hope flared in his own eyes. Had he been as convinced that she’d reject him as she had been that he’d reject her? “Are you hungry?” he asked. “It’s obvious you haven’t slept since I left, but have you not eaten either?” She struggled to remember, to get through the fog of the last few days. “I’ll take that as a no,” he muttered. “Okay, you stay put. Don’t even think about getting out of bed. I have a T-shirt you can change into and some sweat pants too. But that’s it. Get up long enough to change if you like but then you get your ass back in bed and wait until I bring you something to eat.” “Yes, sir,” she said crisply. He grinned and tousled her hair affectionately. “I like that attitude, baby.” Then he pushed off the bed and she saw that he too was fully dressed. She was touched by the knowledge that he’d taken such care to make sure she had no doubts as to what went on when he’d brought her here. The man had to have the patience of Job because God knew he was dealing with a complete head case. She watched as he walked away and then glanced down to the end of the bed where the clothing he’d set out for her was. She felt grubby and wanted a shower, but that might get her into trouble since he’d been adamant that she stay in bed. And, well, the idea of going through the motions of taking a shower exhausted her. She was still tired and the idea of staying in bed certainly appealed. Breakfast in bed? Even better. She hurriedly changed, not wanting to chance him returning and seeing her na**d. She tossed aside her work clothes and slid into the much more comfortable shirt and sweat pants. They smelled of him. It was almost as good as having him wrapped around her. Almost but not quite. She slid back underneath the covers and inhaled deeply, savoring his scent on the pillow next to her. It was a ridiculous thing to do but she quickly exchanged her pillow for his, glancing guiltily at the doorway to make sure he hadn’t seen. But she wanted his pillow. Wanted his scent surrounding her. She settled back down, closing her eyes, savoring the warmth and comfort of his bed, his pillow and his clothing. Him. A few moments later, he came back into the bedroom carrying a tray. She hastily sat up, plumping her pillow behind her back as he set the tray in front of her. Waffles and bacon. Perfect. “This looks wonderful,” she said huskily. “Thank you.” He scooted onto the bed beside her so they were shoulder to shoulder. “Eat up,” he encouraged. “I don’t want a single bite left over.” She grinned as she swallowed a scrumptious bite. “Admit it. You love getting to boss me around. It’s that whole dominant thing you have going on.” He looked surprised at the ease with which she spoke of the matter. It surprised her as well. It should freak her out. Certainly everything else had. And yet she knew to her soul that this man would never willfully hurt her. She might not know much else, but she did know that. Maybe it made her a trusting fool, but she felt safe with him. He’d seen her at her most vulnerable and he didn’t lord it over her. He didn’t try to press his obvious advantage. He treated her like she was precious. Breakable. With tenderness she didn’t fully comprehend but that she savored wholly. “You’ll learn in time that you have all the power where I’m concerned,” he said in a serious tone. “And that I have none.” She swallowed hard, the food stuck in her throat as she processed his declaration. Everything about him radiated authority and yet he was saying she had all the power? How was that even possible? “What does that mean?” she asked in a low voice. His gaze was intent, unfaltering, stroking over her face like sunshine. “What it means is that you’re in the driver’s seat, baby. Whatever happens from here on out is up to you. It means that when or if we make love, you’ll be in complete control and I will be at your mercy. It means that when it comes to you, I’m not dominant, nor do I have any desire to be. I am, in effect, at your feet.” Whoa. How the hell was she even supposed to respond to that? Emotion knotted and welled in her throat and suddenly she felt like crying. Not because she was sad but because she was utterly overwhelmed by the magnitude of what he was offering her. This was not a man who made concessions like this lightly. Everything about him screamed dominant, alpha male. And yet he was willing to suppress what made him who he was for her. She didn’t deserve this kind of gift. She wasn’t worthy of it. And the fact that he was offering it to her destroyed any wall she would have erected between them. She was defenseless against such unselfishness. “I don’t know what to say,” she choked out. “The first thing I want you to say is that you’ll stay here with me for the next several days. Let me take care of you. Let me work on building trust between us.” “And the second?” “I want you to give us a chance.” “Is there an us?” she whispered. “I want there to be,” he said sincerely. “But you have to want it too. If you only want it half as much as I do it’s a starting point.” She held her breath until she was light-headed and then, before she could chicken out and tuck tail and run, just like she did in every other aspect of her life, she took the plunge. “Yes and okay,” she said, the words tumbling out. He blinked. “Be a little more specific, baby. I need to know what you’re saying here. This is too important for me to make assumptions or to think you’re saying something you aren’t.” She sucked in a breath and blew it out, steadying herself before inevitable meltdown occurred. “Yes I’ll stay with you, and okay, I’ll give us a chance.” The relief was so stark in his eyes that it was like a punch in the stomach. She hadn’t realized how much he wanted this—her. It was mind-boggling that they’d gone from antagonists to potential lovers, or something more than just acquaintances. She couldn’t quite make the leap to lovers in her mind because that night was still too bright in her mind. He gently framed her face in his hands, turning her to face him. He stroked her cheekbones with his thumbs and then lowered his head, tenderly touching his lips to hers. He licked syrup from her lips in a light brush that sent a spark shooting through her veins. Her body wanted him. Now her mind just had to follow suit. Her heart was in accord with her body. Now she just had to get her damn brain to stop freaking the f**k out every time things got heavy. God, maybe she did need to see a shrink. She’d never even entertained the thought. She’d never had a solid reason to want to try and deal with her issues. But Jensen gave her that reason. He gave her hope. He gave her many things she’d never thought she’d have or even want to have. “What did you mean when you said, uhm, that if we made love that I would be in control?” she asked hesitantly. He stroked her face again, pushing her hair back as he stared into her eyes. “It means that if we decide to take that step that I will willingly put myself in a vulnerable position so you feel absolutely safe. Whatever that takes. But baby, it doesn’t have to be now. It doesn’t have to be soon. It will be whenever you’re ready for it to happen. I don’t want you to ever be pressured to offer me something you’re not ready to give. We have all the time in the world.” “You’d wait that long?” She tried to keep the doubt from her voice, but knew she failed miserably. Still, he didn’t look offended or angry at her skepticism. If anything his look grew even more tender. “For the right woman, I’d wait forever.” It came out as a solemn vow. There was absolutely no doubt in his voice and his conviction was unwavering. She shook her head in wonder. “I don’t get it. I really don’t. I was so bitchy toward you. How could you possibly even like me?” He smiled and placed his hand over her heart. “Because I could see through the prickly, protective barriers to the woman in here, and I liked what I saw. You didn’t fool me for a minute, baby. Maybe others are more easily fooled or perhaps they can’t be bothered to look beyond the exterior. That’s not who I am, though.”","sourceLink":"https://allnovel.net/giving-in-surrender-trilogy-2/page-16.html","bookId":1782,"book":{"id":1782,"title":"Giving In (Surrender Trilogy #2)","description":"Storyline: Kylie sees the way Jensen looks at her. The dark promise in his eyes. That rough edge of dominance she knows he possesses. But dominance is the one thing that frightens her above all else. She and her brother barely survived a childhood steeped in violence and abuse. She could never give up total control and submit to a man. Especially a man like Jensen. Could she? Jensen sees the shadows in Kylie’s eyes. Knows he has to tread very carefully or risk losing any chance he has with her. All he wants is the opportunity to show her that dominance doesn’t equal pain, bondage or discipline. That emotional surrender is the most powerful of all, and that to submit—fully to him—will fulfill the aching void in her heart in a way nothing else ever will.","cover":"https://allnovel.net/images/giving-in-surrender-trilogy-2.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/giving-in-surrender-trilogy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:37:48 AM"}}
