{"id":76325,"no":9,"title":"Page 9","content":"What was the old saying? Opposites attract?\n And in their case, could they possibly be more opposite? She and Jensen were polar opposites. He was strong, invulnerable, courageous, confident. Nothing would ever get him down. He oozed authority and self-assurance and she envied him that. She was weak, a coward, and confidence could never be listed as one of her better qualities.\n She sat in her office, staring down at one of the many reports she was supposed to proof and get back to Jensen within the hour. But she was numb, her mind blank. And if she was going to be honest, and she certainly hadn’t held back with herself yet, she was terrified to face him.\n They had a date tomorrow night. He’d spent the night in her bed. They’d gone to lunch where he’d asked her on a real date. And he’d made it clear that it would have nothing to do with business.\n How was she supposed to act around him? She nearly laughed at the idea that somehow she was living one of those crackalicious category romances she read about CEOs and their secretaries. Bosses and their personal assistants. In real life, most people were well aware of the difficulties in mixing business and pleasure and most companies had strict rules about their employees becoming personally involved.\n But Dash and Jensen answered to no one save themselves. They weren’t a typical corporation and Kylie pitied the person who ever tried to tell them how to run their business.\n They didn’t have an employee handbook and there certainly wasn’t a rule against employee fraternization. But that didn’t mean that Kylie wasn’t a complete idiot for becoming involved with Jensen Tucker.\n “Let’s separate the fact that he’s your boss,” Kylie muttered grimly to herself. “That’s the most obvious one under the ‘no’ category.”\n There was also the fact that he was the antithesis of what she wanted or needed from a man. She couldn’t really say what she wanted, though. Because the truth was she hadn’t sought out relationships with men. Sure, she’d had a few casual dates here and there, but it had quickly become evident that Kylie’s issues weren’t endearing her to the men who asked her out.\n She couldn’t blame them. She could reflect on herself objectively and realize that she was difficult. Bitchy, prickly, defensive and timid. Not the hallmarks of a desirable, kickass woman who made men drool at a hundred paces.\n Still, it was nice to think about having that effect on men just once. That Kylie could actually summon the courage to be ballsy and confident. Walk into a room like she owned it in a pair of killer heels and a dress to die for and have every man there wanting her.\n “Yeah, and then what would you do with them?” she said in disgust.\n Absolutely nothing. That was what. She’d run like the chicken she was and she’d stick her head in the sand like an ostrich and pray that life passed her by and didn’t use her as a whipping post anymore.\n At what point was she going to say enough? She was in her midtwenties. Still young by all accounts, and yet there were days she felt so much older. The weight of a lifetime bearing down on her, suffocating and miserable. Her childhood had seemed to last an eternity, her imprisonment stretching to infinity.\n At her worst times, when she and Carson were just children, she’d had the secret hope that she could end it all. It shamed her now to even think of just how close she’d come to taking her own life. She’d been just a child, and what child had such dark, horrific thoughts?\n The only thing that had stopped her was the fact that Carson would be by himself. He and he alone would bear the brunt of her father’s rage. And she wouldn’t allow that.\n Carson had put himself in between her and her father many times, but just as many times, Kylie had done the same for him.\n When her father was in a drunken rage, he seemed to target Carson. It was the other times, when he was absolutely sober, that his hatred for Kylie shone through and nothing she did was right. Everything was a punishable offense. Carson had tried to protect her just as Kylie protected him when their father drank too much and vented his rage on his son.\n She’d never admitted to Carson that she’d considered suicide. It would have destroyed him. Kylie had never told anyone at all. It had remained her darkest secret, buried under layers of hurt and despair but still there. A memory that burned brightly in Kylie’s mind. A reminder of how close she’d come to her breaking point.\n And yet she seemed to be drifting further in the direction of that dark, murky past. Seemed to be reaching that breaking point that she’d never quite come to before. Why now?\n She was safe from her father. No one could hurt her. She had a home, her fortress, where she could lock herself behind the walls and have a safe haven, no intrusion from the outside world.\n Carson’s death had been a strain on her. Was still a strain. Maybe she’d never properly dealt with her grief. She’d performed robotically during the entire ordeal, unable to comprehend that the only person who’d ever loved and protected her was gone. That she was alone in the world, the one thing she’d always feared the most.\n She’d known that Carson and Joss would be her only family. That she had no desire for one of her own. She’d also known that Carson didn’t want children, though Joss did. She understood his fear. That somehow their tainted genes would be passed down to his children. It was a fear she shared.\n Her own mother had abandoned them to a monster she knew was capable of horrific atrocities. She had no example. No one to look up to. An absent mother and a father who was alcoholic and abusive and a misogynist to boot.\n She shook her head, her lips tight. No, she didn’t want to risk having children either. What if she was a horrible mother? What if her children turned into monsters like her own parents? God only knew all the things that could go wrong if she or Carson ever had children.\n She was perfectly content for her father’s name and blood to die with her, his only remaining blood relative in this world. If only she could take him to hell with her. Because God knew, she lived that hell every single day and had since she was just a baby.\n “Do you have those reports ready?”\n Jensen’s crisp voice came over the intercom, startling Kylie from her dark thoughts.\n She ruffled the papers frantically, glancing to see that she had indeed finished proofing the stack.\n “Yes,” she replied, hating the catch in her voice. “Would you like me to bring them to you?”\n “Yes, please.”\n She rose and gathered the papers, tidying them into a neat stack. Then she sucked in a deep breath and strode down the hall to Jensen’s office. His door was open and he wasn’t paying attention. His attention was focused on his computer and he wore a slight frown.\n His shirt was unbuttoned at the top and his tie had long been shed. His sleeves were rolled up to his elbows and his jacket tossed over a nearby chair.\n He was a creature of comfort, and while Dash and Carson both seemed comfortable in finer clothes and embraced the world they’d created for themselves, Jensen seemed less at ease. He was quiet, reserved. And he seemed content to allow Dash to do most of the talking.\n But Kylie would bet her entire paycheck that Jensen didn’t miss a single beat. That he knew every single client and the ins and outs of the contracts and the job that needed to be done.\n She approached his desk hesitantly, not wanting to disturb his obvious concentration. She slid the stack of papers onto the edge and turned hastily, intending to get out quickly.\n “Kylie, wait,” Jensen commanded.\n It shouldn’t have surprised her that he’d known the moment she’d come through the door. Even though he hadn’t acknowledged her in any way and had kept his focus on whatever he was studying on his computer screen.\n She glanced up to see him staring at her, his gaze stroking over her skin like a tangible touch. She loved the way he looked at her. She loved the way it made her feel. Safe. Protected. Like he cared about what happened to her.\n Those looks were addicting. She soaked up every single one of them with unabashed greed.\n His look changed to one of displeasure, and apprehension gripped Kylie’s chest. She hated conflict of any kind. It was her nature to avoid it at all costs and if she couldn’t avoid it, then soothe, soothe, soothe.\n “Is something wrong?” she asked anxiously. “Is there something I can help you with?”\n Jensen reached for her hand, shocking her, because he’d always maintained a semblance of casualness between them at work. He gently squeezed and pulled her closer until she stood right by his chair, her back to his desk. He pushed back his chair so he was looking squarely at her.\n “I have to go out of town Monday. I fly back in Wednesday night so I’ll be in the office early Thursday.”\n She nodded, wondering why that had set him off. It certainly wasn’t unusual for him and Dash both to be out of town.\n “It’s the S\u0026G contract,” he continued. “The CFO was very impressed and wants to move forward with our proposal. He wants me to attend a meeting with the CEO and the board of directors in Dallas. The contract is ours. We’re just going through the motions of getting approval up the chain. And of course they want to meet me—us.”\n It was then that he grimaced and ran a hand through his hair.\n “This is your contract, Kylie. It’s you who should be going. Not me. At the very least, you should be attending with me. But with Dash gone, we can’t leave the office unattended for three days.”\n “Of course not,” Kylie said, shocked that he’d even considered it. “My job is to run the office, Jensen.”\n “But you deserve this,” he said, his lips still turned down into a frown. “Most of the suggestions were yours, even if they were in agreement with mine. You handled yourself very well in the meeting with the CFO. I have absolute faith you’d have their entire corporation eating out of your hand if you gave the presentation.”\n She shook her head, pleased beyond measure with his praise, but at the same time, panic-stricken over the idea of presenting their proposal alone. Without Jensen there to back her up. She might like the idea of breaking out of her shell and taking on the world one day, but it wouldn’t be today. Or tomorrow for that matter.\n Baby steps, she reminded herself.\n “So you’ll be gone Monday, Tuesday and Wednesday,” she said lightly. “I believe I can hold the fort down while you’re gone.”\n “Oh, I know that much,” Jensen said, his tone serious. “But damn it, I wanted you with me.”\n Kylie’s eyes widened as finally the reason for his irritation became clear. He hadn’t wanted to leave her behind and yet they had no choice. They didn’t employ a full staff, though Kylie had been after them to hire one or two more office assistants. For that matter, both men needed personal assistants. Employees who would travel with them, work side by side with them and take care of personal as well as professional matters.\n Kylie’s job was to manage the office. Ensure that everything ran smoothly, that things got done on time and accounts receivable were kept up to date. But she acted as a personal assistant to both men instead of just an office manager, and they definitely kept her on her toes. There was enough work for two more employees but neither man seemed to have any interest in taking on anyone else. They claimed to like the job Kylie did for them and seemed content with the services she provided.\n She made a mental note to ask for a raise if one wasn’t automatically given in her annual performance review, which was coming up in just a few weeks. She deserved it. The old Kylie would have never rocked the boat. Continued to take the same pay and not complain when she took on more of a workload. Anything to keep peace and to keep away from conflict.\n The new Kylie? Knew she was worth more than what her paycheck reflected. Not that either man ever took her for granted. She felt appreciated. Both men went out of their way to tell her she was doing a good job and that they couldn’t manage without her.\n The new Kylie was going to be crisp and efficient and ballsy. She was going to ask for a raise. And not a small one.\n She had goals just like everyone else did. She wanted a new house, one not in the same neighborhood as Dash, Joss, Tate and Chessy. Jensen lived just a mile away in another upscale gated community. It was time for her to break free. To not be so dependent on the people around her and for them to constantly have to baby her.\n Kylie felt like a fraud living where she did. Carson had insisted that she live near him. Where he could look in on her, protect her. Just like he’d always done. And she’d failed him when he’d needed her most. It should have been her. Not him. He had Joss. Someone who loved him and whom he had adored beyond reason. Kylie had no one. Just Carson, and by extension Joss.\n It should have been her.\n It had nothing to do with a death wish. Not since she’d been a little girl and had that awful moment when she’d considered that she’d be alone, protected, away from the violence and turmoil of her everyday life if only she gave in and took the easy way out, had she given any serious consideration to giving up and ending her life.\n “What the hell is going through your mind?” Jensen muttered.\n She glanced guiltily in his direction, knowing she wasn’t giving him the attention he deserved as her employer. Heat scorched her cheeks. Shame. That she’d even dwelled on those awful moments in the past.\n “Nothing worth repeating,” she said honestly.\n Jensen shook his head. “One of these days, you’re going to trust me enough to share those dark thoughts you seem to have on a regular basis. You may think you hide them from the world, and maybe you do, but not from me. I see past the practiced façade, Kylie. And I don’t want that to alarm you. I want you to trust in the fact that I will never hurt you. I’ll never do anything to cause you pain.” \n","sourceLink":"https://allnovel.net/giving-in-surrender-trilogy-2/page-9.html","bookId":1782,"book":{"id":1782,"title":"Giving In (Surrender Trilogy #2)","description":"Storyline: \n Kylie sees the way Jensen looks at her. The dark promise in his eyes. That rough edge of dominance she knows he possesses. But dominance is the one thing that frightens her above all else. She and her brother barely survived a childhood steeped in violence and abuse. She could never give up total control and submit to a man. Especially a man like Jensen. Could she? \n Jensen sees the shadows in Kylie’s eyes. Knows he has to tread very carefully or risk losing any chance he has with her. All he wants is the opportunity to show her that dominance doesn’t equal pain, bondage or discipline. That emotional surrender is the most powerful of all, and that to submit—fully to him—will fulfill the aching void in her heart in a way nothing else ever will.\n \n","cover":"https://allnovel.net/images/giving-in-surrender-trilogy-2.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/giving-in-surrender-trilogy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:37:48 AM"}}
