{"id":39096,"no":16,"title":"CHAPTER XVI. ALAN\u0027S DEFENSE","content":"\"Dead!\" repeated Sophy, after a pause. \"Then was this Mr. Beauchamp really my father or a relative?\" \"I think he was Mr. Marlow, dear,\" said her lover gravely. \"No doubt your father intended to feign death to escape Lestrange, but it would seem that he overdid it, and really died. I saw the manager of the Occidental Bank. He informed me that he had received a letter telling him that Beauchamp was dead.\" \"How long ago was this?\" \"A little over a week.\" \"Who wrote the letter?\" \"That he refused to tell me.\" \"Had he seen this Mr. Beauchamp, to whom the money was to be paid?\" \"Never. Your father had informed him that he had left an income to Beauchamp, and that drafts for the money were to be sent to a certain place--where, I don\u0027t know. The manager sent a draft, but it was returned to him with a letter stating that the man was dead. For my own part, I believe that Mr. Marlow was Beauchamp. His plan to hide himself from Lestrange has succeeded only too well.\" Mr. Phelps now joined in. \"Then I understand, Alan, that you think Marlow is really dead?\" \"I do. If he had only feigned death, then Beauchamp would be receiving his income. In my opinion, the two men are one and the same. I believe Lestrange\u0027s story so far.\" \"Humph!\" said the Rector, who was really of the same opinion. \"But let us leave this question for the moment and talk of the other. You say that Lestrange arrived on the day and by the boat he asserted that he did?\" \"I saw the passenger-list myself. If he had not been on board, his name would not have been there. Even he could not falsify a passenger-list.\" \"Then our idea that Lestrange was the Quiet Gentleman is false?\" \"It must be, sir. The man--Lestrange I mean--was not in England when the Quiet Gentleman lived in this village. I believe Brown had to do with the stealing of the body and the murder. But, then, Brown is not Lestrange. Who he is I don\u0027t know!\" \"Alan!\" cried Sophy--for if what Lestrange stated was true, this hypocrisy was detestable--\"you are not straightforward with me!\" \"Indeed I am,\" he said, with a stare of astonishment. \"I have told you of my discoveries. Why should I deceive you?\" \"Why, indeed!\" said the girl bitterly. \"You know how much I love you, yet you keep me in the dark about matters which concern us both--matters which I, if any one, have a right to know.\" He might have had some inkling of what she meant, for his face turned a dark red. Nevertheless, he held himself well in hand, and looked inquiringly at the Rector. \"What does she mean, sir?\" \"I think you can guess,\" said Phelps, more coldly than he had ever before spoken to Alan. \"No; upon my word, I----\" Sophy rose from her chair and closed his mouth with her hand. \"Don\u0027t! don\u0027t!\" she cried despairingly. \"I can\u0027t bear it. Captain Lestrange----\" She hesitated. \"Ah!\" said Alan fiercely. \"I might have guessed he had been making mischief. Well, and what does he say?\" \"That you stole my father\u0027s body, Alan!\" \"I--I--stole the body?\" \"Yes!\" chimed in the Rector. \"And he further says that you took it to the hut on the heath, where Warrender\u0027s corpse was found.\" \"Oh, indeed!\" cried the young man derisively. \"And did I murder Warrender, too?\" \"Alan! Alan! Oh, don\u0027t jest! If you love me, Alan, tell me the truth.\" \"Sophy! What do you mean?\" He pushed away his plate and rose. \"Do you believe this man\u0027s tale for one moment? Am I the man to violate a grave--to drag the remains of a man I respected and honored to the light of day? You must be mad to think of such a thing! How dare he bring forward such a terrible--such a dastardly accusation? For what reason does he say that I did it?\" \"Out of revenge, I expect,\" said Phelps. \"He dislikes you, Alan. He says you took poor Marlow\u0027s body to dissect it.\" \"And bases his lie upon some gossip of my having been a medical student, I suppose?\" cried the young man, now thoroughly angry. \"I\u0027ll thrash the scoundrel within an inch of his life!\" \"Oh, Alan, I am so glad--so thankful! I said so, didn\u0027t I, Mr. Phelps? You didn\u0027t do it!\" \"Do it--of course I didn\u0027t do it! Why should I? Phelps,\"--Alan forgot his respect for the Rector in his rage--\"do you believe this lying story?\" \"Knowing you as I do, I don\u0027t believe it. But I must say that Lestrange--he is a very dangerous man--makes out a strong case against you.\" \"Oh! Let me hear on what grounds.\" \"Alan!\" Sophy came forward and took him by the lapels of his coat, \"before we tell you anything, confess if you have kept anything from us.\" He looked at her in a puzzled manner. Then a light seemed to dawn upon him. He glanced at the Rector. \"Now I understand, Mr. Phelps. Jarks has told you.\" \"Told me what?\" asked the Rector, with well-feigned ignorance. \"I see! I see!\" Alan sat down again. \"It\u0027s all right, Sophy. I kept that from you only that you should not be worried. So Lestrange found out--from Jarks, I suppose--that I was at Heathton on the night of the funeral?\" \"Yes, yes. Oh, Alan, is it true?\" \"True--of course it is. Why should it not be true? Does the fact of my having been here corroborate this cock-and-bull story? You ought to know me better, Sophy, and you too, Phelps.\" \"I couldn\u0027t believe it--I didn\u0027t,\" cried the girl. \"Nor I. We both told him that he lied. But I must admit that things looked bad for you, as he put it. Why didn\u0027t you tell us you were at Heathton on that night? Why did you come? Was there any serious reason for such secrecy?\" \"No reason whatsoever,\" replied the young man frankly, \"save the trifling one that I did not want to bother Sophy with my suspicions. Yes, I came by the 8.30 train from Bournemouth, and I returned at half-past eleven. I had to go to another station to keep my secret, you know. Jarks saw me in the graveyard about ten, and as I wished to keep my visit quiet, for the reason I have told you, I gave him something to hold his tongue. It appears that he did not. I suppose Lestrange bribed him?\" \"Well, no,\" said the Rector, \"not exactly. Jarks, in his cups, told that scoundrel Gramp, and he told Lestrange.\" \"Oh! So there are two of them in league to make trouble. A proper pair of scoundrels!\" \"But,\" said Sophy, more composedly, \"you have not told us why you came.\" \"I came,\" said her lover, determined now to make a clean breast of it, \"to look at the vault--to see that all was safe.\" The Rector uttered an exclamation of astonishment. \"Did you expect, then, that there would be some foul play?\" \"Well, I hardly know, sir. It was this way: After Mr. Marlow received that letter from the West Indies--which doubtless warned him that Lestrange was on his track--he was much worried. He would not tell me the reason, but kept speaking of some shock he had had which might cause his death. \u0027And I don\u0027t know if the scoundrel will let my body rest in its grave,\u0027 he said in a fit of passion. I asked to whom he alluded, but he would say no more. When he died so unexpectedly, his words came back to me. I wondered if he had enemies who might disturb his remains, and all that day after the funeral I felt so bothered about it that I could not rest without coming back to see if all was well.\" \"And you found nothing wrong?\" \"Nothing, sir. I was in the churchyard for about a quarter of an hour. I examined the door of the vault, and saw everything was right. As I came away I met Jarks; the rest you know.\" \"You saw no signs of that tramp in the churchyard?\" \"None! I expect he was sleeping when I was there. According to his story, it was after midnight when the vault was opened.\" \"Alan,\" said Sophy, much relieved, \"how is it they did not know at Heathton Station that you were here?\" \"I did not go to Heathton Station. I stopped at Murbury, and walked from there across the heath. I went back the same way. I did so simply to keep the tongues of gossips quiet. I did not want you to be worried, Sophy; and after all,\" he said, after a pause, \"beyond the chance words of your father I had no reason to think that anything was wrong. Ah! if I had only stayed in the churchyard all night, I should have prevented this trouble. The vault would never have been broken into, and poor Warrender would still be alive.\" The Rector nodded approval of this speech, and poured himself out a glass of wine, which, poor man, he sadly needed. Lestrange\u0027s accusation had been disproved; still, there remained the evidence of Cicero. Sophy put the question which was in the Rector\u0027s mind. \"Captain Lestrange brought Cicero here, Alan,\" she said abruptly, \"and he--Cicero, I mean--declared that you were in the hut on the moor that night.\" \"I was not!\" cried young Thorold hotly. \"I was never near the hut. Why should I have been? Ask yourself, as I had to walk to and from Murbury, and spend a quarter of an hour in the churchyard, had I time to cross the moor all the distance to the hut?\" \"Of course, you know I don\u0027t believe it. But Cicero----\" \"Well, and how can he prove I was there?\" he said impatiently. \"He found something there which belonged to you.\" \"What?\" \"A lancet.\" \"A lancet! And why mine? Warrender was a doctor; he took away the body--why should the lancet not belong to him? If he had intended to dissect the body--which he might have, for all I know--he would want one.\" \"No doubt,\" Mr. Phelps said dryly. \"But this lancet had your initials on the ivory handle. It is your lancet, Alan, and it is now in Cicero\u0027s possession.\" \"H\u0027m! that\u0027s queer. Initials?--yes, it might be mine. But how did it get there?\" \"Did you ever lend a lancet to Dr. Warrender?\" \"No, not that I can remember.\" \"Then there was the other man, his accomplice, Brown the----\" \"Ha!\" cried Alan, starting up and pacing the room. \"I see, I see!\" \"See what?\" cried Sophy eagerly. \"How the lancet came to be found in the hut. The Quiet Gentleman stole it.\" \"Stole it?\" \"Of course. Did he not steal the key of the vault from my desk? There was a case of lancets in the same drawer; he took one. Ha! this proves to me that Brown stole the body and murdered Warrender. A clever scoundrel! He stole my lancet to throw suspicion on me.\" Alan clenched his hands and looked upward. \"In God\u0027s name, what does this roguery mean?\" It was indeed a perplexing case. They were all in the dark, and such gleams of light as came served only to confuse them the more. Lestrange could not be the Quiet Gentleman, for, as had been proved by Alan, he had landed in England only the week before. Brown was the deus ex machina who could put matters right, and Brown had vanished. He could reappear only at the risk of being charged with murder. Why had the body been removed? If it were a case of blackmailing, the claim would have been made long since. The police were apparently as much at a loss as Alan himself. And Blair---- \"Does Blair know of this accusation?\" asked Mr. Thorold suddenly. \"I am certain he does not,\" answered the Rector emphatically. \"In the first place, it was only made to-day. Lestrange, I am sure, wants money, and would come to us before going to the police.\" \"If he does not want money, Cicero does,\" put in Sophy scornfully. \"In the second place,\" resumed Mr. Phelps, \"Blair is away.\" \"Where has he gone?\" \"I can\u0027t say, but he will be back in a fortnight.\" \"Well,\" said Alan moodily, \"I don\u0027t know if he will be much good when he does come. I shall see this firm of scoundrels at the Good Samaritan, and threaten them with the police, unless they tell all they know. Lestrange is as bad as Cicero, and I know him to be a scoundrel. What\u0027s that?\" This exclamation was drawn from him by the violent ringing of the door-bell. Before the sounds had ceased, Miss Vicky, red, hot and agitated, rushed in a most unladylike manner into the room. \"Oh, Sophy! Mr. Phelps! Mr. Alan! I really never! Joseph Brill--oh, that Joseph Brill! He\u0027s back again!\"","sourceLink":"http://novel.tingroom.com/jingdian/1919/55174.html","bookId":908,"book":{"id":908,"title":"The Millionaire Mystery","description":"简介： Steering his course by a tapering spire notched in the eye of the sunset, a tramp slouched along the Heathton Road. From the western sky a flood of crimson light poured over the dusty white highway, which led straightly across the moor. To right and...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1919","creation":"Aug 1, 2019 12:23:51 AM","modification":"Aug 1, 2019 12:23:51 AM"}}
