{"id":73274,"no":104,"title":"Page 104","content":"Too blank to think up an appropriate response to his sweet words, I nodded. I wanted to thank him, pile my own heap of sweetness right back onto him, and praise him for being...him. But I’m pretty sure he’d just scrambled all rational thought right out of my head. So what I ended up saying was, “There’s more, right?” His blue eyes sparkled as he nodded. My gaze fell down to his cock where he was still kneeling between my spread legs. Hard, and long, and completely intimidating, it dripped with anticipation, stirring up a new arousal in me I had thought for sure he’d licked away. Before, I’d been worried about the fit, but after his finger had been in me and I’d loved the way it had filled me—and had wanted even more filling me—I was actually eager to feel the real deal. Spreading my legs wider, I lifted my hips to him, displaying everything I had to let him know I wanted it. I had no clue where my inhibitions had gone, but with Quinn Hamilton hard and dripping before me, those things had highjacked themselves out my body and taken a vacation. “Show me,” I said. Again, he nodded without speaking. After spotting his crumpled jeans hanging off the side of the bed, he dug into the back pocket, pulled out his wallet and flipped it open. As he pulled out a condom, a moment of reality struck. Hard. I experienced another slap of guilt. He’d probably bought that condom, thinking he’d use it on my roommate. Oh, God. What was I doing? I shouldn’t be doing this. He was Cora’s. She’d had him first, and probably opened herself in this very position to him many times. I should never be allowed— But then he tore open the package and began to sheathe himself. It was beautiful to watch. He rolled the small layer of latex down with such care, holding on to the tip as he went. Then he wrapped his fist around the base as if to insure everything was in proper place. When he started to let go, I choked out a sound of resistance. “No. Don’t.” He looked up, startled. “What’s wrong?” I blushed, embarrassed by what I wanted and averted my gaze. “Nothing.” “No, tell me. Zoey, please.” He touched my hip and looked so worried, as if he thought I might stop everything, I had to tell him. Ducking my face, I admitted, “I...I liked watching you...touch it.” His mouth fell open. He looked down at himself and then back up to me. Then his lips twitched. “What? Like this?” He touched himself again, rewrapping his palm around his thick girth. Then he went and pumped his fist slowly up and down the entire length. “Oh, God.” I drew in an awestruck breath. “Yeah. Like that. Is that...is that how you masturbate?” He nodded and closed this eyes, his throat working as he kept on with the movement of his hand. “This is what I did when I thought about you.” “It’s breathtaking,” I didn’t mean to admit aloud. His pupils seemed to dilate and his shallow pants went even more erratic. “You could do it too.” When his gaze slid between my legs, a spark of arousal shot through my pussy, startling me. “You could touch yourself where I just touched you.” My mouth worked before I could form the words. “W-would that...I mean, would you like that?” Face going from red to deep purple, he nodded, his eyes intent. “Only as much as you seem to like watching me do it.” Oh. Wow. That much, huh? I slowly, hesitantly reached down. But my fingers had barely begun to fondle, eliciting an excited tremble in my womb, when Quinn lost it. “Fuck,” he rasped, his teeth locked tight as he stared dumbfounded at my hand between my legs. “I can’t...I’m sorry, I can’t wait. I have to...” He let go of himself to grasp my thighs. As he pulled me down toward him, into his lap, he thrust his hips forward. Like two matching pieces of a puzzle, we came together. Quinn pushed inside me without pause or hesitation. I cried out from the shock and nip of pain as he filled me completely. His overly long eyelashes fluttered as he tipped his head back, making the muscles in his throat strain. He said something, then said it again. I wasn’t sure if it was Jesus or Jeez or a strange version of both, but the word seemed to be ripped out of him. When he finally looked down at me, he appeared dazed and drugged. But he only had to glance into my eyes before his own widened with realization. “Oh shit, Zoey. I’m inside you.” “I know.” If there was only one thing in the world I knew in that moment, it was that he was full and hard and deep inside me.","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-104.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
