{"id":73303,"no":133,"title":"Page 133","content":"His breath tickled my ear. “Please what?”\\n\\n “Make me come.”\\n\\n He chuckled, the jerk. He knew he had absolute control over me. “Yes, ma’am.” Ten seconds later, he had me screaming into the pillow again as I contracted around his steely length.\\n\\n Too drowsy to move after Quinn has his way with me—or maybe I should say, after I coaxed him into having his way with me—I began to fall asleep as soon he pulled free from my body. Then he kissed my cheek tenderly and crawled off the bed.\\n\\n “Can I finally take my shower now?” his voice teased as he lovingly laid his sheets over me and tucked them in around me. “Or does my beautiful, insatiable girl need anything else this morning?”\\n\\n “Breakfast,” I mumbled with a smile, remembering how he’d always made Cora breakfast. Hoping I could get that same treatment, I opened one eye and asked, “With bacon?”\\n\\n He winked. “You got it.” Then he leaned in, sniffed my hair and kissed me one last time on the cheek before strolling from the room.\\n\\n I tried to go back to sleep but thinking about him in the shower, all naked and clean, smearing slick soap over his hard, large body and down between his legs… I suddenly wondered what the heck I was doing in here, alone, while he was in there all wet and sexy.\\n\\n Grinning goofily to myself, I popped out of bed and pulled on one of his large T-shirts. Bypassing a bra and panties, I shot out of his room and down the hall to where I heard a shower running. I took a breath before grasping the handle and pushing my way inside.\\n\\n Steam had already filmed the mirrors and heated the room. I considered stripping naked before slipping in with him. But then I bit my lip, suddenly unsure. What if he didn’t like company in the shower? What if my presence upset him instead of delighted him?\\n\\n Testing the waters, I said, “Quinn?” and slipped the shower curtain aside just enough to see in.\\n\\n “What the fuck?” Under a pounding stream of water, a fully naked Ten spun around to gape at me.\\n\\n I screamed and lurched backward, tripping over the toilet and sprawling onto my butt onto the floor. The shower curtain flew the rest of the way open. I scurried upright, shoving Quinn’s shirt down to cover as much of my bare legs as possible.\\n\\n “Blondie?” he screeched, only to cover his dick with both of his hands as my wide-eyed gaze landed on it without my permission. I slammed my eyes closed. “Oh my God, oh my God. I’m sorry. I’m so sorry.”\\n\\n Spinning away blindly, I fled, running smack into the door before I patted my hands around, found the doorknob, and yanked it open to dart into the hall, only to collide with a huge, hard body.\\n\\n I screamed again, not expecting anyone. But then Quinn’s smell reached me and instead of trying to escape him, I latched on and climbed up him, and clutched him gratefully.\\n\\n “Wha...?” he started in confusion.\\n\\n “I thought it was you,” I babbled. “You said you were going to take a shower. You said you were going to take a shower. Why weren’t you in the shower?”\\n\\n He hugged me to him. “Ten was already in there, so I thought I’d start breakfast instead.”\\n\\n I buried my absolutely mortified face into his chest. “Oh my God. I’m never sneaking into a bathroom to shower with you again.”\\n\\n “You were...?” Before he could finish the question, the bathroom door slammed open behind me.\\n\\n I clutched Quinn tighter and totally didn’t mean to blurt out, “Something’s wrong with his penis.”\\n\\n “What?” a clearly confused Quinn said as Ten choked out a horrified growl.\\n\\n “I’m sorry,” I said, still freaked out about everything that had just happened. “I didn’t mean to say that out loud, but...oh my God. It doesn’t look like yours. There’s this big, blood bruise-looking thing on it.”\\n\\n “Blondie!” Ten cried in a strained voice. “Shut...up.”\\n\\n I finally glanced back at him. He had a towel wrapped around his waist, but he was still streaming wet. As I looked at him, though, all I could see was that huge discoloration on his junk.\\n\\n “I’m sorry,” I said, genuinely remorseful for blurting what was probably something very private about his privates. “I just couldn’t keep it in. I tried. But…oh my God. What is it? Does it hurt?”\\n\\n Quinn choked out a surprised laugh, while a blushing Ten slapped his palm against his forehead. “It’s a birthmark,” he gritted out. “Just a birthmark. Nothing is wrong with my dick. It doesn’t hurt. I’ve had it since birth.” \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-133.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
