{"id":73304,"no":134,"title":"Page 134","content":"“It was big... I mean the bruise, not the penis.” When Ten buried his face in his hands and groaned in misery, I winced. “Sorry. I’m so sorry.” He lifted his hand. “Just...shut up. Please, for the love of God...stop talking.” “I’m trying,” I cried, “But it was just so—” He growled again and pointed his finger in a threatening manner. “You are dead to me.” He stalked toward his room, only to pause and glance back and point at me again. “You owe me breakfast for this. Eggs, toast, and bacon. Lots of fucking bacon.” Spinning away, he stormed off to his room, calling over his shoulder, “And Sunny D too,” right before he slammed his door, hard. I looked up at Quinn. “I can’t believe I couldn’t stop talking. I feel so awful. I have to be the worst person ever. Did you see him blush? I can’t believe I made Ten blush.” Instead of scolding me for my stupid, uncontrollable outburst, Quinn grinned. “You are so adorable.” He kissed me on the tip of my nose. “I love that you were the first person I’ve ever seen make my roommate blush.” “It’s not funny.” I groaned. “I was completely insensitive and—” “And you’re weren’t serious at all when you said you were never sneaking into my bathroom again to shower with me, right? Because honestly, as long as it’s me in there, and not Ten, you could sneak in every morning and I’d be perfectly okay with that.” “Quinn!” My scold went unheeded though because he picked me up, tossed me over his shoulder and carried me into the bathroom, where we showered together. After that, we finished breakfast together, making sure a mollified Ten got everything he’d ordered. When he finally emerged from his room, fully clothed, he cleared his throat, scowled at us and grumbled under his breath as he filled his plate and sat across from Quinn, pausing to glare at us every few bites. And he completely forgot to say thank you. “It goes without saying that what she saw in the shower stays between the three of us...right?” Quinn shook his head. “Why would I go around talking to anyone about your junk, man?” Ten’s shoulders loosened, but when he looked at me, he narrowed his eyes. I lifted my hands. “Of course, I’m not going to say anything.” Why would I? I felt awful enough for the way I reacted; the least I could do was keep it private. “But I can’t believe word hasn’t gotten out before...what with all the girls you sleep with,” I murmured more to myself. Ten winked. “I have my ways of keeping it under wraps.” Literally, was my guess. I shook my head. What a morning. Mere months ago, I never would’ve guessed I’d be discussing a guy’s birthmark on his penis so casually and without wanting to die from embarrassment twenty minutes after seeing it. Oh, how the times had changed...how I’d changed. But I just didn’t feel so insecure and timid about everything, not when Quinn was near. And I wasn’t joking when I said near. He didn’t let me sit in my own chair. Instead, he’d pulled me onto his lap and together, we ate off the same plate. Ten watched us for a second, scowling and chewing before he swallowed. Then he pointed his fork our way. “So…how long has this been going on? Last night was so not your first time together, because you wouldn’t be this familiar with each other yet. And thanks for letting me know you were already getting some, buddy. Make me feel like an idiot for trying to find you pussy when you were already—” “Shh.” Quinn scowled at him and hugged me closer. Ten rolled his eyes. “Seriously, man, you don’t have to mark your territory like that just because your girl accidentally saw my awesome body all naked and wet. She ain’t going to hop over here to ride the Ten Express.” Then he leaned in and winked at me. “Even though the colorful peckers like mine do feel better in you.” “Cut it out,” Quinn growled, pulling his arms even tighter around me. Rolling his eyes, Ten scooped up another forkful of his omelet. “Jesus, man. You make no sense. This one is a million times more faithful than that last one, and yet you’re already fifty times more possessive of her.” If anything, that only made Quinn’s arms band tighter around me. “Don’t make comparisons,” he ordered softly. “But they’re so obvious,” Ten argued. “This one is sooo much better.” Ten gave a low whistle as he sent me an appreciative look. “I mean, she—”","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-134.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
