{"id":73309,"no":139,"title":"Page 139","content":"With Zoey, we just...clicked. I knew I liked her. I never worried about needing to impress her because I had this sense I already did without really trying. I was usually too concerned about when I’d get to see her again to worry about that, anyway. I just wanted to be with her constantly. The urge to always find my way close to her was like an itch just under the skin that could never be relieved until she was back with me.\\n\\n Even though I’d ordered Ten not to compare her with Cora, I did in my head, too. A lot. She always came out the victor. In looks, temperament, compatibility, likeability, even in the bedroom. When it came to sex…wow, there was no contest at all. Zoey lit up in my arms like a wildfire every time I touched her. Her eagerness for me was genuine, and I couldn’t get enough of it.\\n\\n With Cora, I’d been clueless, and she’d been the one with all the experience. When we’d dated, I didn’t think I had a problem with that. She taught me what she liked, and I was willing and ready to learn everything I could to please her. But she’d always led. I didn’t think I had a problem with that, either.\\n\\n Until Zoey.\\n\\n Now, I was the teacher. And I was the one giving her her first experience with every new thing we did. There was something so hot and bonding about that, about knowing I was the only man who’d ever touched her there, or kissed her here. I wanted all her firsts, and I craved each one I took.\\n\\n I felt closer to her because I knew every detail about her sexual past. That was probably wrong of me, but I still liked it. And I didn’t just know all her secrets; I was her secret. It made me trust her implicitly. I told myself I should have some reservations. After the way Cora had lied and betrayed me and so absolutely hoodwinked me, I should’ve been wizened and hardened to the next girl who came along. But Zoey was so sweet and innocent I couldn’t summon an iota of doubt over anything she said to me.\\n\\n Six days after we started our secret relationship—secret because we didn’t want Cora finding out and making a big deal about it—I went to school anxious and jittery. The last time I’d gotten a chance to see Zoey was yesterday morning in Art Appreciation. I’d had to work last night and I had to again tonight, which meant I wouldn’t get to see her again until tomorrow, Wednesday morning\\n\\n I walked to my next class, unable to concentrate on school or think about practice I would be attending later in the afternoon. Coach was finally going to officially label me as a second-string quarterback. I’d been working for this spot for a year now. I should be excited that today was finally the day. Instead, I was tempted to pull out my cell phone and fire off a text to Zoey, even though I’d had a ten-minute conversation with her earlier when I called to say good morning.\\n\\n This constant craving for her was driving me nuts.\\n\\n But even as my hand went to my back pocket while I strolled along the sidewalk, I spotted her up ahead, walking with Cora in my direction. Neither of them noticed my approach. Soon they would, though. It was inevitable; I was going to walk right by them. I frowned slightly, wondering why they looked so buddy, buddy. I didn’t get a sense from Zoey that she and Cora were even remotely friendly any more.\\n\\n But then I heard Cora saying, “You won’t forget, right? This Saturday? It can’t be rescheduled,” and I figured it had to be something about their apartment.\\n\\n “I won’t forget.” Zoey sounded a little irritated by the reminder.\\n\\n She was the first to see me. My insides fired to life, and great...I instantly went hard. Remembering every single thing we’d done together, I stared at her a little too intently, and way too obviously. She began to look away, but did a double take before her eyes widened.\\n\\n I couldn’t help it. I smiled. When she blushed, I mouthed the word, “Library,” without really thinking what I was doing. I was that desperate for her.\\n\\n She darted a quick look at Cora, who was checking something on her phone and didn’t notice me for another half a second.\\n\\n “Oh,” Cora said with genuine surprise when she finally looked up. She pushed her chest out and then tossed her hair over her shoulder. It was pathetic how hard she tried to preen in front of me. “Hey there, Quinn.”\\n\\n I sniffed, making a face at her, wondering why she thought there was anything friendly, or even civil between us.\\n\\n Then my gaze returned to Zoey and my internal organs started burning. I held her stare until they passed and she was gone. I hoped she’d understood my message because I was already veering toward the library, and my mouth was watering to taste her.\\n\\n “Umm...is that all you needed from me?” Heart racing, I glanced at Cora and bit my lip, hoping she didn’t notice my eagerness. \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-139.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
