{"id":73318,"no":148,"title":"Page 148","content":"She paused before leaving. “Don’t worry, sweetie. I already told him how rough you like it, and how much acting like you’re resisting turns you on.” Then she slammed the door.\n I raced to it only to find it locked. I pounded on it. “Cora! This isn’t funny.”\n Her muffled laugh came back to me, telling me how much she disagreed.\n A hand gripped my waist from behind. I yelped and whirled around, backing into the door.\n “She lied,” I rushed out, gaping up at him with wide eyes. “I don’t want you. I don’t want this at all.”\n But he looked too glassy-eyed and drunk to care.\n “As long as I get some pussy, you can fight as much as you want, honey.”\n “What? No!” I pushed against him, but he didn’t seem deterred. “Stop!”\n He kissed me hard, smelling like garlic and sweat, and tasting like beer. I struggled against him, gagging and hitting him on the chest, then the side of his head.\n He cursed and hit me back until I saw stars.\n I checked out long enough for him to get his pants undone and try to stick his tongue down my throat. I bit it and he hit me again. The hitting I could take. My father had acclimated me well to that kind of pain. It was the added worry of being raped that freaked me out.\n Fighting as hard as I could, I bit and scratched and tried to scream again until he clamped a hand over my mouth and kneed me in the stomach. When he began to rip open my jeans, I shook my head frantically, trying to beg him with my eyes. He had no mercy. He jammed his fingers down the inside of my pants and cupped me hard between the legs, making tears spill from my eyes.\n I squeezed my lashes shut, trying to cope with reality. I couldn’t believe this was happening. I couldn’t believe Cora would—\n “Blondie? You in here?”\n The door opening across the room, letting in noise from the party raging outside, startled my attacker into taking his attention off me. I wiggled my leg free enough to hike my knee up and catch him as hard as I could in the nuts.\n As he groaned and doubled over, I escaped from between him and the wall to launch myself as a dumbstruck Ten stood frozen in the doorway.\n “Ten,” I sobbed.\n “Holy shit.” He shook his head and caught me, dragging me behind him before he looked down at Belcher, who was curled up on the floor in the fetal position, cradling himself and gasping.\n Grabbing him by the shirt, Ten dragged him back to his feet. “Oh, honey. You just roughed up the wrong girl.” He fisted his hand and wound his arm back. But at the moment Belcher closed his eyes and braced for the impact, Ten paused and shook his head, dropping his hand. “No. You know what? I think I’ll just save your pretty face until Blondie’s boyfriend can get his hands on you.”\n “Boyfriend?” Belcher croaked, cracking open one eye to look up at Ten. “Who’s her boyfriend?” He glanced at me, and I immediately hugged myself, backing away from him.\n “Oh, you’ll find out…soon,” Ten promised him before shoving him toward the doorway. “Until then, you’d better run as fast and far as you can, because he’s coming for you. I’ll make sure of it.”\n Belcher stumbled out of the room, half limping, half running. As soon as he was gone and the door fell shut behind him, reality crashed down on me. Reliving in my head what had just happened, and even worse, what could’ve happened, I began to whimper out these gasping sobs. Feeling his phantom touch everywhere, I tried to wipe it away, but it just kept clinging to my flesh, so I gave up and rocked back and forth for a moment before I remembered my pants were still undone. I fumbled to pull them together, but my hands wouldn’t stop shaking, so I started breathing hard because I was so upset that my fingers wouldn’t work right.\n I was half a second from a hysterical, hyperventilating breakdown, when I heard Ten shout, “ZOEY!”\n He’d never called me by my name before. It broke through my daze and made me realize this wasn’t the first time he’d tried to get my attention. I blinked and looked up at him, gulping down my panic.\n “Don’t you fucking freak out on me,” he warned, his voice stern. “I can’t handle shit like that.”\n When he ripped off his shirt, I gaped in horror and started to back away from him toward the one door I knew had to be unlocked. “What’re you doing?”\n He paused at my cry. “Relax, I’m just giving you something to cover yourself. He practically shredded your shirt.”\n I glanced down to see that I was showing him half my bra. My fingers instantly went to straighten as much of my shirt as possible. My face ached where Belcher had hit me and my skin crawled where he’d pawed me. \n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-148.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: \n I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \n -Zoey Blakeland\n \n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
