{"id":73340,"no":170,"title":"Page 170","content":"“No. Haven’t heard anything.”\\n\\n Zoey nodded her understanding, and her gaze shifted to the other side of her bed where our roommate lingered with his hands stuffed in his pockets.\\n\\n “Ten,” she said and slowly reached out an IV-stuck hand his way.\\n\\n He caught her fingers. “Hey, Blondie. Glad you didn’t die. Ham probably would’ve become a pain in the ass to live with if you had.”\\n\\n Her chest shook as she laughed softly. “I imagine he would have.” Her smile settled into a gaze of adoration. “You’re seriously never going to call me Zoey, are you?”\\n\\n Ten shrugged. “Probably not.” His eyes filled with a pain I’d never seen in him before. Glancing away, he mumbled what sounded like, “That was my sister’s name.”\\n\\n Zoey’s smile died. “Was?” she repeated.\\n\\n He cleared his throat and met her gaze before nodding. “Yeah. Was.” With a wince, he shook his head. Then he leaned down swiftly and stamped a quick kiss to her forehead. “I better go. I’ve got a fucking family thing I should probably go suffer through before the holiday’s over. Just…take care of yourself, will you? And make sure this asshole takes care of you, too.”\\n\\n “Okay.” Zoey let go of his hand and watched him stride from the room. Then her concerned gaze found mine. “Did you know he had a sister named Zoey who died?”\\n\\n I shook my head, in just as much shock as she was in. “I had no idea he’d even had a sister.” Much less that her name had been Zoey, or that she’d died.\\n\\n “Poor Ten. I wonder how he was ever able to talk to me at all.”\\n\\n A smile lit up my face. “Easy. How could anyone not talk to you? You’re a freaking angel.”\\n\\n She snorted and rolled her eyes, but the smile that followed told me how much she loved the praise. “I love you,” she whispered.\\n\\n I kissed her knuckles. “Not as much as I love you. In a way, I’m glad you decided to come to Ellamore and give away one of your kidneys, because it brought you to me.”\\n\\n “You know what,” she slurred, “So am I. Thank God my half-sister is an evil, conniving witch, or we never would’ve met.”\\n\\n Together, we laughed softly. We’d discovered that finding a way to laugh and make light of it was easier to handle than the cold, dark truth: Cora was evil, and Zoey would always be connected to her.\\n\\n Zoey’s eyelashes fluttered, and I knew she needed rest. I was about to tell her to get some sleep while I kept watch over her, but someone knocked softly on the opened doorframe.\\n\\n It was Cora’s father. I straightened and stiffened indignantly, but Zoey’s grip on my fingers warned me to behave.\\n\\n “Hi,” she said simply, not welcoming him, but not giving him the cold shoulder either.\\n\\n “Hey.” His gaze softened as he glanced over at her and stepped hesitantly into her room. “So, I see you made it through okay.”\\n\\n Zoey nodded. “How’s Cora?”\\n\\n His mouth twitched into a half grimace, half smile. “She made it through surgery as well. So far her body is accepting your kidney.”\\n\\n Zoey’s shoulders eased. “Good.”\\n\\n Her biological father glanced away and cleared his throat. “I just wanted to tell you how sorry I am…for everything.” When his green gaze met hers, her fingers clamped even tighter around mine. “If I had known what Cora was doing earlier, I would’ve put a stop to it long ago. I can only assure you that she won’t bother you again…” His gaze flickered my way. “She won’t bother either of you. She’s always had a strong will and wanted her own way. Just like her mother. It’s been a challenge to keep her even moderately in line. And...” He sighed and glanced down at his hands, touched his wedding ring before he kept talking. “I probably shouldn’t have allowed her so much contact with you when you started high school. I knew she’d end up trying to control you. She does that with everyone. But...” He gave a half shrug. “I guess I was curious about you, too. Please believe me when I say you don’t have to worry about her again. If there’s one thing she listens to and respects, it’s money. And since I control hers, I can keep her away from you.”\\n\\n “Thank you,” Zoey said.\\n\\n “And about…about Ernest.” Shaking his head, he glanced away in shame. “It’s troubled me for years, knowing how he treated you. But my marriage and—”\\n\\n “You don’t have to explain anything,” Zoey broke in, wincing when she probably tensed enough to pull something she shouldn’t have. I moved to remove Mr. Wilder from her room, but she tightened her grip on my hand, stopping me. \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-170.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
