{"id":73172,"no":2,"title":"Page 2","content":"Not that she didn’t deserve someone gorgeous or wasn’t good enough to catch a hunk. She was beautiful and way more outgoing than me. She could probably get any guy she wanted. But Quinn Hamilton had just seemed like movie-star pretty, completely untouchable to regular non-movie-star citizens like us. Even as he stood among a throng of attractive, drunk college guys and sipped from a red SOLO cup, he managed to shine above them all.\\n\\n It didn’t seem possible, but he was even better looking in person. Grainy pictures online so did not do him justice. I stared a moment longer because, well...art was meant to be appreciated, and he was a masterpiece.\\n\\n After maybe a bit too much appreciation, I finally scanned the faces around him, hoping Cora might be near. But I didn’t find her anywhere.\\n\\n I knew I should approach him since he was the best chance I had of locating my best friend, but going anywhere near such perfection felt utterly forbidden.\\n\\n I’d have to meet him eventually, sure; he was Cora’s boyfriend. But I wasn’t ready yet, mostly because he’d just smiled at something someone was telling him. The skin around his eyes crinkled with genuine warmth, his lips lifted into the most attractive demeanor, while his entire complexion just...brightened. And yeah, I couldn’t do it.\\n\\n I turned to find the exit behind me, only to discover it was blocked. Fear and a bit of claustrophobia clutched my throat, making it suddenly hard to breathe. I needed to get out of this house. The sooner I found Cora, the better.\\n\\n Okay, fine. I’d meet the boyfriend, then. I could do that. Sure.\\n\\n I started toward Quinn Hamilton just as the guy talking to him pulled up his phone and showed the screen to Quinn. I was only a few feet away now; one more step and I’d be close enough to reach out and tap him on the shoulder—holy Lord, could I actually summon the nerve to touch those thick, amazingly formed shoulders?\\n\\n But the curious smile lighting his face dropped as soon as he looked at the phone.\\n\\n I stumbled to a halt as his eyes went flint hard and narrowed on his friend. His lips were tight as he said something in a low growl I couldn’t hear. The other guy threw back his head and laughed as if it was the funniest comment in the world. But Quinn dropped his drink—yeah, right on the floor—splattering...what was that—water?—all over his shoes. Then he grabbed two fistfuls of the other man’s shirt and propelled him backward, right through a crowd of people until he had his opponent pinned to the wall with the guy’s shoes dangling a good foot above the floor.\\n\\n Holy—\\n\\n “I said, delete it,” Quinn roared, loud enough for not just me, but everyone in the room to hear. Maybe everyone in the house. Possibly the city.\\n\\n The skin pulled taut over his hard jaw as he glared at the man he was holding captive, letting everyone know he wasn’t kidding around.\\n\\n The room went hushed, and every eye turned toward them. I shrank a step back, not sure what to do or where to hide. While all my duck-and-cover instincts flared to life, someone came shoving through people and right past me, hollering, “Hey, hey, hey! What the fuck is going on?”\\n\\n When the newcomer reached Quinn, he tugged him away from the other guy, who gratefully slid to the floor and made a production of gasping for breath and straightening his shirt.\\n\\n “Get his phone,” Quinn commanded the man who’d so easily been able to pull him out of a fight.\\n\\n Without question, his friend snatched the phone from the guy who was still patting himself down.\\n\\n The new guy’s face drained of color before he sent Quinn a grimace. “Shit,” he muttered. His thumb punched the screen a few times before he shoved it back at its owner.\\n\\n The owner scowled. “Hey! You deleted it.”\\n\\n “Hey! Douche nozzle,” Quinn’s friend shot back, imitating the phone owner’s insulted tone. “You shouldn’t have had it in the first place. Where did you get it, and who the fuck else did you show it to? Did you send it to anyone?”\\n\\n “Why do you care? Or were you the one banging her?”\\n\\n “Oh, I’m going to bang you, buddy.” This time it was Quinn’s friend, not Quinn, who grabbed two handfuls of shirt and shoved the phone owner against the wall. “I’m going to bang your fucking head against this fucking wall if you don’t answer my fucking questions.”\\n\\n That was probably more f-bombs than I’d heard in my entire life. To have them assault my stunned ears all in one breath left them ringing. Frozen to the spot, I clutched my own shirt with two handfuls and watched as Quinn gripped his friend’s shoulder and tried to tug him back.\\n\\n “Enough. The picture’s gone. It’s over.” \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-2.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
