{"id":73207,"no":37,"title":"Page 37","content":"As soon as I settled myself beside her, she reached out and gripped my forearm. “Hey, thanks again for Friday night.” “I...” When my words stumbled over my tongue, I looked up from the notepad I was taking from my backpack to find the most sincere expression on her face. “Oh, but I didn’t do any—” “You were there for me when I needed someone to just…be there. Trust me, your presence helped. I was so worried I freaked you out, though, because of the way I acted at the—” “No! Not at all.” With a roll of my eyes, I admitted, “I would’ve freaked a little myself to learn what you’d just learned about your brother.” “I know, right.” She leaned in to whisper. “I still can’t believe it. I’ve been hiding in a hole all summer, worried he thought I was the most wicked person ever for—” She stopped abruptly, as if she’d just then realized I had no idea what had happened to her. With a small clearing of her throat, she shoved some hair out of her eyes. “Anyway, come to find out, Noel hasn’t been a perfect angel either.” She grinned and patted my arm. “It was actually kind of a relief to learn. I mean, it’s weird. Don’t get me wrong. But...I don’t know. I can’t really condemn them for anything because I’ve seen them as a couple and they just click together, you know. How they hooked up just doesn’t bother me.” Biting her lip, she sent me a hesitant look. “Do you think that’s wrong?” I shrugged. “I don’t know. I’ve always loved happily ever afters in romances. I love to see couples in love beat the odds. And those two really seemed to be—” “They are.” Caroline sent me a nod of approval. “They really, really are.” She opened her mouth to say something else, but a call from across the room stalled her. “Caroline? Is that you?” Caroline looked over, and her face instantly brightened. “Reese! What a happy surprise. I was so sure I wouldn’t know anyone all day. But look, I have you two in my first class. This is Zoey. I met her this weekend at the football’s fundraiser car wash. She’s roommates with Cora, Quinn’s girlfriend.” The brunette with a nose ring skipping toward us latched her attention on me. “Oh, I love Quinn.” She gave a happy clap before carelessly flinging her bag onto the desk beside mine. “He’s such a good guy, and a total sweetheart.” Caroline turned to me. “Reese is engaged to Mason, who also works at Forbidden with Quinn and Noel...and Oren.” Her smile faltered when she said that last name. I nodded. “Oh.” Then I couldn’t handle the curiosity anymore. “What is Forbidden, exactly?” “It’s a nightclub,” Reese explained, plopping into her chair with a relieved smile before she kicked off her shoes and began to wiggle her purple-painted toes. Then she took a sip from the steaming cup she’d brought in with her. “All our guys are bartenders there.” “What...the hell are all you hens doing in this class?” I turned to see a horrified Ten standing before us, a single thick textbook tucked under his arm. He spun and scowled at Caroline, his gaze accusing. “Where’s your brother?” She blinked and moved deeper into her seat away from him. “Um...I don’t know. His own first class of the day, I would assume.” Her eyes narrowed and lips pinched tight. “He didn’t hold my hand and walk me to class.” “But he should be here.” He pointed down to the exact spot where he was standing. “I saw his class schedule sitting out on the table in the kitchen at your place. He had this class, so I enrolled.” Caroline flushed. “Well, that must’ve been my schedule you saw because I know for a fact Noel isn’t taking this class.” As Ten closed his eyes and lightly pounded a fist to his forehead, I darted my gaze between them. When Ten had told me he’d have to change his game plan around Caroline, I guess he hadn’t been kidding. He definitely wasn’t being as sweet or nice to her as he’d been before she’d tried to kiss him. “Motherfucker,” he groaned. “No Gamble, and I’m stuck in a class with not one, or even two, but three untouchables. This is going to suck...ass.” “I’m sorry, what?” Reese lifted a curious eyebrow. “Do I even want to ask what an untouchable is?” “You know...” He twirled out his finger to encompass Reese, Caroline and me. “You’re Lowe’s woman. Can’t flirt with you. You’re Noel’s little sister.” He scowled at Caroline. “Can’t fucking go there. And you...” He flicked his attention to me, “...belong to Hamilton.” Then he made a sweeping gesture over all three of us. “Ergo I can’t touch any of you. Untouchables. And to make it worse, you all will probably be watching me with your judgey little eyes so I’ll have to behave and can’t hit on any other woman in this class either.”","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-37.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
