{"id":73214,"no":44,"title":"Page 44","content":"I held out my hand for the sheet, and she readily handed it over. When I scanned over her first assignment, I pointed. “Actually, this is Latin...not Greek.”\\n\\n The dry look she sent me told me just how much she wasn’t impressed by my nerd knowledge. “Sorry.” I cleared my throat. “Bad joke.”\\n\\n She rolled her eyes and fluttered a hand. “No. Go ahead and rub it in. I suck at biology and you rule. I got it.”\\n\\n I smiled out a silent laugh as I motioned to the syllabus again. “Looks like you’ll be starting with human anatomy.”\\n\\n “Really?” She leaned in to read over my arm, which stirred up more of that wild cherry and orchid smell. “Why didn’t he just say human anatomy, then?”\\n\\n “Because Gilcrest only knows science jargon. But I think I wrote pretty common terms in my notes, so hopefully that’ll help you.”\\n\\n Zoey pulled the notes into her lap. I found her biology book next to my hip, and we spent a few minutes going through the text, syllabus, and notes.\\n\\n I know I got a little too involved in some of the things I explained. But it was so nice to know what I was talking about, I got a little carried away...and possibly a little off topic. Zoey didn’t seem to mind though. She kept nodding and transferring her attention from my notes, to her book, to my face as I went on. Sometimes, she’d even write down something I said.\\n\\n “And did you know ancient Greek doctors thought there was a vein in this finger,” I tugged at the fourth digit on my left hand, “that led right to the heart? It’s not true, of course. But they called it the vena amoris, which means—”\\n\\n “Vein of love,” she said.\\n\\n My gaze shot to hers. “Oh, you know the story already.”\\n\\n She shrugged and smiled apologetically. “I knew that was why that was the wedding ring finger, but I didn’t know it wasn’t true.” Disappointment filled her eyes. “So that finger doesn’t really have a vein that leads directly to the heart? That’s kind of depressing.”\\n\\n “I know. Sorry.” I shook my head, feeling crappy for destroying a perfectly sweet theory. “I always liked that story of why couples wore their wedding rings on that particular finger, too. But, no, the vein structure in all the fingers is pretty similar.”\\n\\n “Yeah. That’s too bad.”\\n\\n I opened my mouth to tell her I hated nothing more than being misled with lies like that, but then I also wanted to restore her faith in romance, except yeah, my mind was blank with something eternally romantic.\\n\\n Cora saved me from having to come up with a response when she called from her room. “Hey, is Quinn here yet?”\\n\\n “Yes,” I answered for Zoey. “I’ve been polluting Zoey with more episodes of Pysch.”\\n\\n Cora grumbled something that sounded vaguely like “Be out in a minute,” and slammed her bedroom door shut. Zoey and I shared a smile. But we both seemed to realize our time together was about up. Setting my notes aside, she smoothed her hands down her legs and let out a breath. “Well, thanks for taking the time to explain all that to me. It makes a lot more sense, now.”\\n\\n I straightened in surprise. “Really?”\\n\\n Zoey blushed and ducked her face. “Yeah, I...yeah.”\\n\\n I was sure I’d only been confusing her more, but if she said it helped, then...cool. I bumped my shoulder into hers. “Actually I was glad for the distraction after practice today.”\\n\\n She glanced up, her green eyes wide with concern. “Did you get in trouble from your coach for that fight you were in?”\\n\\n I frowned in confusion. “Fight?”\\n\\n “You know...” She flailed out a hand. “With that guy you pushed against the wall at the party where—”\\n\\n “Oh! Right.” I’d forgotten all about that. “No.” I sighed and ran my fingers through my hair. “Nothing like that. I’m just worried about Noel. He’s having a hard time, wondering who had that picture of his girlfriend. He’s really ticked at Ten and me for refusing to tell him whose phone it was on. But if we told him—”\\n\\n “He’d beat up Belcher,” Zoey surmised with a knowing nod.\\n\\n I glanced at her sharply, stunned. “You know whose phone it was on?”\\n\\n “Oh! I...” She flushed and stammered a moment. “I hear things.”\\n\\n Of course she did. She was like me, a watcher and a listener. I nodded slowly. “Right.”\\n\\n “So...Noel would definitely go after Belcher if he knew?”\\n\\n “Definitely.” I blew out a breath. “He wanted to storm the entire baseball team today and start taking names. I don’t know what to do for him. I don’t blame him for being upset, but if he did anything to get himself kicked off the team, everything he’s fought so hard to protect would be over.” \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-44.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
