{"id":73175,"no":5,"title":"Page 5","content":"Really awkward.\\n\\n She smelled good, too. I caught myself leaning in to catch another whiff so I could figure out what the heck that scent was. I stopped cold when she looked up at me with big seafoam green eyes.\\n\\n And oh...wow.\\n\\n I totally didn’t mean to freeze, but I was thunderstruck, and I paused for way too long of a second.\\n\\n Great, now she was going to think I was coming on to her or something. She’d have Cora talked out of dating me within the hour.\\n\\n My hands jerked off her as if she’d scalded me. My ears burned with humiliation while I cleared my throat. “You okay?” When she nodded, I did too, motioning us back toward the crowded part of the frat house. “We, uh, we should probably take this way.”\\n\\n I was trying too hard. I always flubbed things up whenever I wanted to impress someone. My stress levels rose, I paid too much attention to every little thing I did and said, and I became so self-conscious my stutter usually returned.\\n\\n Refusing to say a word so I could at least keep that little embarrassment under control, I led Zoey into the next room where noise and the bustling activity of a college party assaulted us. She inched closer to me, which was nice, since it meant she wasn’t flat-out afraid of me, but I told myself she did it because the place was cramped; there was honestly nowhere else for her to go.\\n\\n When some drunkard stumbled backward into her, she gasped and grabbed my wrist, smashing her side into mine. I curled a protective arm around her and used my free hand to nudge the drunk away. She didn’t pull away from me, so I kept her flush against me and led her to my girlfriend.\\n\\n Cora was exactly where I’d last seen her, dancing to some hip-hop song with two guys who were laughing and talking with her above the music between all the Jell-O shots they were downing. Eyes closed, she lifted her hands above her head, swished her hair around her face and rotated her hips in a way that reminded me of the first night we’d met. The night I’d lost my virginity.\\n\\n “There,” I said, pointing her out. I freed Zoey so she could go to Cora. But she didn’t leave my side.\\n\\n Her mouth fell open as she gawked openly, moving her face forward as if she didn’t believe her own eyes. “Is...” Her mouth moved a few more times before she looked up at me. “Is she drunk?”\\n\\n I froze, not sure how to answer. But, oh, boy.\\n\\n Apparently, those two had a lot of catching up to do.\\n\\n Instead of saying anything, I left her and eased through the dancers to catch Cora’s elbow. When she turned and saw me, her face brightened, which always lit me up inside. I couldn’t explain how nice it was to be with someone who was always happy to see me.\\n\\n “Quinn!” she cheered, vaulting herself against me and looping her arms around my neck. “Are you finally going to dance with me?” When she lifted onto her toes to kiss me, I kissed her back.\\n\\n I liked it better when she was doing shots instead of sucking down beer. Tasted better. Plus the smell of beer haunted me with too many bad memories. As her tongue slid against mine, I decided tonight’s Jell-O of choice must’ve been cherry.\\n\\n Cora definitely knew how to make cherry my favorite flavor.\\n\\n “Your friend’s here,” I said, pulling away to call into her ear above the music and licking the last hint of cherry off my bottom lip.\\n\\n She frowned up at me, obviously confused. So I pointed out Zoey, who was still hovering in the same spot I’d left her, arms crossed over her chest as if she were cold...or scared out of her mind.\\n\\n “Oh my God. Zoey!” Deserting me, Cora lifted her arms over her head and shook them excitedly as she wove through people to reach her friend. Swooping in, she gave Zoey a huge hug, to which Zoey couldn’t really hug her back because Cora had pinned her arms to her sides. “I can’t believe you’re really here. This is so exciting. We’re going to have the best year ever.”\\n\\n When she pulled away, she grabbed Zoey’s hand. “Come on. Let’s dance.”\\n\\n Zoey’s eyes went huge and her head began to swish back and forth. I knew the last thing she wanted to do was dance. In fact, I knew she wanted to get out of this place. Bad. The way she kept glancing around with such apprehension reminded me of how I’d felt a year ago when Noel had invited me to my first party.\\n\\n He’d been the big star, the first-string quarterback for the football team, and I’d been a lowly freshman nobody. An invitation from him hadn’t been something I could turn down. I had wanted to fit in and feel normal, so I’d sucked up all my anxieties and gone.\\n\\n I’d hated every minute of that loud, overbearing frat house. \\n\\n","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-5.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. \\n Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. \\n Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. \\n -Zoey Blakeland\\n","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
