{"id":73239,"no":69,"title":"Page 69","content":"“Looks like you’re already on season five,” he said, appearing shocked by my progress. “Yeah, I...” I tucked a piece of hair behind my ear. “I’m definitely a fan now.” He grinned at me. “That’s so cool.” I knew I should’ve taken the side chair, but I could see the television from a better angle on the couch, with him, so I sat beside him, leaving a whole cushion of space between us. He sent me another glance and then started the show. When neither of us laughed at the first one-liner, I knew something was wrong. Quinn picked up his phone and glanced at the screen, and it struck me how worried he was. I’d learned not to worry so much about Cora. She seemed like one of the most self-sufficient people I knew. When she needed help, she knew how to get it. I was almost glad he didn’t know about her kidneys; he’d probably be through the roof right now. I scooted closer to him and patted his knee. “She’s okay.” I was going to make sure she stayed okay. Just a few more months of testing, and she’d be as good as new again. He glanced at me, his eyes swirling with misery. Then he blew out a breath and tugged me closer to him so he could wrap his arm around my shoulder. Tipping his face to the side until our heads touched, he murmured, “Yeah,” but he didn’t sound so sure of his claim. “I bet she’s fine.” We fell asleep that way, watching Psych and pressed up against each other with his arm around my shoulder and my cheek resting against his shoulder. Cora woke us when she unlocked the front door. Yawning and stretching, we stirred to find the show was long over. We were getting to our feet when she stumbled inside. She faltered to a stop, glancing between us. “What’s going on?” She focused on Quinn. “Where’s your shirt?” “It’s in the dryer. Where have you been?” She pulled back, blinking as if she couldn’t believe he’d dare to answer her question with another question. “I was out working on a group project for my World Geography class. I told you that. Why are you here, alone, with my roommate?” He glanced at me, answering, “She called, looking for you. She thought you were with me. I thought you were with her.” I thought I detected a bit of accusation in his voice, so I quickly said, “The water line to the toilet broke and I didn’t know how to turn it off or how to get a hold of the super. You weren’t answering your phone.” She looked down and pulled her phone from her purse. “Oh, I must’ve turned it off. Hmm. Wonder when I did that.” She turned it on and checked over the half a dozen or so messages from both Quinn and me. Then she looked up and smiled at us brightly. “So...everything’s fixed now?” “No,” Quinn said. “The line’s still broken. You’ll need to get a hold of your super.” Then he leaned in and sniffed her. “You smell like alcohol.” She scowled. “Well, yeah. We finished the project a couple hours ago and then went out for a few drinks. Is that okay with you, dad?” He nodded even as he answered, “I just...I could swear you said you were staying in and doing something with Zoey tonight.” “Are you sure?” When he kept bobbing his head up and down, she sighed and pressed her hand to her temple. “I don’t know, maybe I did say that. But I meant I was going to work on the group project with Sydney and Kallie and all of them in my World Geo class.” When Quinn didn’t respond, she looked at him. “You believe me, right?” Again he stayed silent, but he swished his head up and down, letting her know he did believe her. “Good.” She let out an exhausted sigh. “Well, I’m beat, so I’m going to bed.” When she started down the hall, Quinn followed her. He went into her bedroom with her, and then he shut the door. I slumped against the wall and hugged myself. I felt sick because I knew what he was going to be doing with her. And I felt even sicker because I could’ve sworn Cora told me she was going to be with Quinn tonight. But why would she lie to both of us? “Want to ride to class together?” Cora’s question made me stumble to a halt just as I reached the front door of our apartment Friday morning. After the night I’d had dealing with the plumbing, my limbs were sore and my head ached from how exhausted I was, but strangely enough, I felt kind of exhilarated. My roommate’s question warmed me from the inside. This might’ve been the first time since the car wash that she’d asked me to do anything with her that didn’t involve her health. But she just had to pick the worst day ever to ask, didn’t she? For once, I actually had plans.","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-69.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
