{"id":73248,"no":78,"title":"Page 78","content":"Aspen and Noel began to dance with each other, and Caroline’s eyes watered as she covered her mouth. “That is so freaking sweet. I had no idea my brother was such a romantic.” “Disgusting, isn’t it?” Ten asked. Caroline sniffed and sent him a glare, bumping his shoulder with her knee. My glaze slid unwillingly to Quinn. His lips had tipped up in a smile as he watched Noel and Aspen. Then, as if he felt my stare, he looked up. Instead of frowning at me for staring, his smile only widened. Then he returned his attention to the main couple. But my chest still pounded from that half of a second we’d shared. I shook my head. I was so pathetic. I couldn’t believe I had such a raging crush on my roommate’s boyfriend. Bad enough that Cora even knew about it, now I was longing for stolen little glances that probably meant nothing to him. No wonder Cora had been so nasty and unfriendly to me lately. She probably thought I was actually going to try to steal him. I forced my attention back to Noel and Aspen just as the song drew to a close. Noel let go of Aspen to kneel down in front of her and pull a ring from his pocket. Caroline gasped. “Oh my God. Oh my God!” Aspen took a step back, and her mouth fell open as tears filled her eyes. I couldn’t hear the actual proposal from where I sat, but I could tell what her response was when she leapt at him, hugging him and kissing him. “Dude,” Ten spoke up. “I can’t believe you’re freaking proposing to a break-up song.” “Shut up,” Caroline hissed, slapping his shoulder. “Before I punch you in the nuts.” “What?” He glanced at her in shock before he motioned to Noel and Aspen, who were still kissing. “I’m just saying...that can’t be good luck.” “It’s her favorite song. Who cares what the lyrics say?” Ten snorted. “Obviously no one.” He turned away, taking a huge gulp of his beer, and focused his attention on Asher singing. I watched the tense set of his shoulders and the tormented expression on Caroline’s face before glancing away to focus back on Noel and Aspen. But, yeah, they were still connected at the mouth. “Wow.” I turned away from the bar completely to face outward. “They’re really going at it.” Next to me, Cora laughed. “Oh, Zoey. You poor innocent little virgin. Look at your blush.” To my mortification, she said it loud enough that all the Forbidden people could no doubt hear her. Just wanting to sink into a hole and die, I continued to blush as she went on. “We totally need to get you some experience. Quinn, baby, let’s set Zoey up with one of your single friends. We could do a double date.” Quinn froze and sent her a look that told her going on a double date with me was the last thing he wanted to do. It was the last thing I wanted to do, too. I didn’t want to see him and Cora hanging all over each other any more than necessary, much less purposely trap myself into a front row seat of watching it all night long. But knowing Quinn didn’t want to spend an evening with me either, hurt. Why didn’t he want to hang out with me? I opened my mouth to tell Cora there was no way I’d go on a double date with her and Quinn—blind dates equaled hell in my book—when Ten suddenly turned to us. “I’ll do it.” Everyone stopped drinking whatever they were drinking and gaped at him. Caroline even choked on hers. He shrugged, taking in all the expressions focused on him. “What?” “Since when do you double date?” Quinn asked. “Since now, I guess.” Glancing at me, he grinned and wiggled his eyebrows. “What do you say, Blondie? It could be fun.” I glanced toward Caroline. Her expression was surprisingly blank. She was watching the band as if she wasn’t listening in on every word we said. “Uh...” I couldn’t say yes. I didn’t want to say yes. But what if Cora kept pressuring me until she found someone else, someone I didn’t know. Ten was the antithesis of any guy I would consider dating, but for some reason I trusted him, and I somehow knew he didn’t want to go out with me because he was interested in me. He had some kind of agenda. And whatever it was, I’d rather take a chance on him and his ulterior motive than someone else. “I don’t know,” I mumbled. “I guess.” I guess. She’d said I guess. Why in the world had she said I guess? Did she like Ten? I could tell Caroline was into him, but I’d never caught that vibe from Zoey. So why would she ever agree to go out with him? And what’s more, why had he asked her to? Ten didn’t do the dating thing. He was more of a one-night stand kind of guy.","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-78.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
