{"id":73261,"no":91,"title":"Page 91","content":"“Wait. What?” Caroline gripped my arm. Hard. “If you didn’t kiss Oren, then who....” Her eyes shot open wide. “You did not,” she whispered and glanced around before hissing, “You almost kissed Quinn?!” Then she gave a happy squeal and literally jumped up and down. “Ohmigod, cool!” “Shh.” I yanked on her arm to hush her. “It was...we were...drunk. And talking...and we leaned in toward each other, but no...you know what? I don’t think we almost kissed at all. We just moved in closer to each other to hear each other better over all the noise. Yeah. I would never kiss another woman’s boyfriend. It just...no...” Caroline arched an eyebrow. “I know you like him, Zoey,” she said softly. “You don’t have to lie to me.” Tears filled my eyes, but I quickly swallowed them back down. I hadn’t meant to lie to her. I’d just been in denial. “Damn, what a pair we make,” she said, taking my hand and squeezing my fingers, “liking guys we can’t have. Or won’t have us.” She started to lead me into the art room but stopped when she saw someone loitering in the back, where our chairs were located. Jerking me to a halt at her side, she pointed and whispered, “Look.” Someone wearing a sweatshirt with the hood up was placing something in Caroline’s chair. I elbowed her. “Oh my God. It’s your secret admirer! Can you see his face?” No one had turned the lights on in the room yet and he was sheathed in shadow. When he glanced our way, we both quickly ducked out of the doorway, then we just as quickly peeked back inside as he began to jog down the steps. I was beginning to think the way he moved looked familiar when he stepped into a pocket of sunlight coming in through the windows. My mouth dropped open and Caroline clamped her hand hard around mine when Ten hit the last step and turned in the opposite direction as us, escaping out the other side of the lecture hall. Like a streak, Caroline took off and raced into the room and up the steps. “It’s... Zoey... Look.” Too wide-eyed and breathless to explain, she spun the page around to show me what Ten had left for her. I set my hand over my chest, my mouth dropping open. It was the same picture her admirer had been leaving her all semester, but this time the Caroline in the picture and the kitten were rolling around in the grass, laughing. “Ten’s your secret admirer?” I lifted my dazed gaze to her, and she stared back, looking just as shocked as I felt before the biggest smile bloomed across her face. “He is.” She covered her mouth as tears glistened in her eyes. And then she started to laugh. “Oh my God. He really is.” She sat down blindly in her chair and kept staring at the picture he’d put so much time and detail into drawing. “I can’t believe he’s such a good artist. None of the crap he turns in for class assignments ever looks this good.” I sat beside her, taking Reese’s spot. “I found out on Saturday he’s actually an architecture major.” She blinked at me. Then she shook her head. “But why would he be taking a beginning art course if he was a senior with a major in architecture?” I probably shouldn’t tell her, but I drew in a breath and did anyway. I was tired of lying to so many people about so many things. “I think he knew that wasn’t your brother’s class schedule he saw on the table at your house. I think he just...he wanted a reason to be close to you.” Caroline huffed out a breath. She gazed wildly around the room for a minute before focusing on me again. “But...he pushed me away. I tried to kiss him, and he—” “You’re his best friend’s little sister. He knows he should stay away.” Her mouth fell open. “Well, fuck that. If Oren...if he really, truly, honestly likes me, Noel is not getting in my way.” With a laugh, I blurted out, “I wish I could be more like you.” She snorted. But I think she was too thrilled about the idea of Ten actually liking her to bother arguing with me. Instead, she started to fluff her hair and pinch her cheeks. “Shit. I knew I should’ve dressed up today. How do I look? Be honest.” I grinned. “You look lovely.” Reese arrived then, carrying a Styrofoam cup. “Starbucks is freaking bound and determined that I not get my white chocolate mocha today. They were out of lids and I almost spilled this on me twice already.” She nearly tripped over her feet and spilled it again when she saw me sitting in her chair. “Oh! Hi.”","sourceLink":"https://allnovel.net/with-every-heartbeat-forbidden-men-4/page-91.html","bookId":2703,"book":{"id":2703,"title":"With Every Heartbeat (Forbidden Men #4)","description":"Storyline: I used to think everything was black and white, truth or lie, easy or hard, that if I could just escape my strict, overbearing, abusive father, my life would be perfect. But since I’ve found a reason to risk his wrath and leave, to help a friend in need, I’ve come to realize everything I thought I knew is wrong. Friends have their own agenda, honesty comes with a dosage of lie, easy doesn’t even exist, keeping secrets sucks, and love...love is the most painful thing of all. Maybe if Quinn Hamilton hadn’t asked me to skip classes for the day and help him pick out an engagement ring for my best friend, I wouldn’t have fallen for him so completely on that sunny Tuesday afternoon and I wouldn’t feel so conflicted. But I did, and I can’t take it back, no matter how hard I try. So I have to deal with the fact that even I’m not as good, or honest, or caring as I’d always thought I was, and no matter what I do next, someone’s going to get hurt. Probably me. -Zoey Blakeland","cover":"https://allnovel.net/images/with-every-heartbeat-forbidden-men-4.jpg","author":"Linda Kage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/with-every-heartbeat-forbidden-men-4.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:25:03 AM"}}
