{"id":98626,"no":14,"title":"Page 14","content":"The assistant with the clipboard went back to the van and stood beside the cameraman. Hong smoothed her hair and watched the assistant, waiting. “In ten,” he called and began counting down. I moved closer to hear what they were saying. After “one,” Hong furrowed her brow into a serious-reporter look and addressed the camera. “Tonight, your Channel 10 On-the-Scene News Team has exclusive coverage of a shocking tragedy that occurred in the New Combat Zone earlier today. With me is Brian Sykes, a previously deceased police officer with Boston’s Joint Human-Paranormal Task Force. Officer Sykes, tell us what happened.” Sykes nodded and opened his mouth. “An employee—” His voice cracked, and he licked his lips nervously. He cleared his throat and tried again. “An employee of this establishment, Timothy John Stillwell, known as T.J., was found … was found dead at approximately seven thirty this morning.” “Yet there’s been no official announcement of a death. Why is that?” “It’s because T.J. was a PDH—um, a previously deceased human. Despite Massachusetts law, the police commissioner refuses to recognize the legal rights and protections afforded to the previously deceased.” “Quite an inflammatory statement, Officer Sykes. Do you have evidence to support it?” Sykes pulled at his necktie, leaving it even more crooked. “Two detectives—human detectives, I mean—stopped the JHP’s investigation and commandeered the forensics team.” He looked at Hong as though that explained it. “Can you prove that Commissioner Hampson authorized the actions of these men?” “They said …” Sykes’s words trailed off. Hong let the silence hang for a few seconds and then changed the subject. “What caused Stillwell’s death?” Sykes blinked and looked like he wished she hadn’t asked that question. “At this time, unfortunately, we … uh … we don’t know.” “But you believe it was murder?” “I do.” “And why is that?” “Because …” Sykes ran out of steam. He shut his mouth, opened it, shut it again. The reporter pressed on. “Do you have any suspects?” “I … We …” Sykes tugged at his collar again. Then his expression darkened. “No. There are no suspects because Commissioner Hampson shut down our investigation.” Hong faced the camera. “Tonight, many questions remain. Was a zombie in fact murdered here? If so, how? And why are Boston police refusing to investigate? Reporting to you from the New Combat Zone, I’m Lynne Hong.” Sykes turned toward Hong like he wanted to say something, but she was already moving toward the van. The floodlights went out. Sykes stood there, blinking rapidly. “Okay, guys,” Hong said, “the real story’s with Hampson. I’ll try to get him on the phone.” She whipped out her cell phone, pulled off a mitten, and hit some buttons. She slid the phone under her earmuff and spoke for a few seconds. Then she snapped the phone shut and shook her head. “He’s not at headquarters. I know where he lives; it’s on Marlborough Street. Let’s get over to the Back Bay and see if we can catch him on camera.” They clambered into the van, which took off with a screech toward the checkpoint into human-controlled Boston. Sykes, standing in front of Creature Comforts like a giant abandoned child, stared after the vehicle. I walked over to him. “That was gutsy.” I was thinking about Daniel’s comment that he was lucky to keep his job after helping me rescue Maria. And that incident had been hushed up. Not only was Sykes going public with T.J.’s killing, he’d effectively sent a team of reporters to camp out on Commissioner Hampson’s doorstep until they got some answers. Definitely gutsy. “I sounded like an idiot.” “No, you—” “I did, damn it. I rehearsed all evening, but when those lights went on I managed to act like some kind of inarticulate, shambling brain-muncher straight out of a horror film.” “Don’t worry about it, Sykes. Lynne Hong can be tough. How come you contacted her?” “I wanted someone mainstream. The norms don’t watch PNN. They don’t read News of the Dead. Hong wanted an exclusive, which made me think she’d take the story seriously.” He looked at me doubtfully. “Oh, I think she’s taking it seriously. Did you hear where they’re going? To ambush Hampson at home.” “Good.” His face didn’t look glad. “How’s she going to play it, I wonder: focus on a dead nobody zombie or on a commissioner who looks like he’s hiding something?” I didn’t say anything. We both knew the answer. Sykes pounded a fist into his hand. “I couldn’t stand by and do nothing. I became a cop to protect people. That kid’s dead. Who’s going to speak for him now?” He shook his head. “I tried. I did a lousy job, but at least I tried.” “You did a good thing, Sykes.” “Maybe,” he said, his eyes distant. Then he shook himself. “I’d better go. I’ve got stuff to do before my shift.” He headed toward the Deadtown checkpoint, then stopped and turned around. “If I still have a job after the eleven o’clock news.” I watched him walk down the empty street. Somewhere, a crow cawed. It was a bleak sound, like the cry of the last living creature in a blasted landscape. I shook off the lonely feeling and turned toward Creature Comforts. Although Deadtown came to life when the sun went down, it’d be a few hours before things started hopping in the Zone. Still, Axel would be getting ready to open. With T.J. gone, he could probably use some help—and some company, whether he’d admit it or not. But tacked to the door was a sign I hadn’t seen with Sykes standing there. Hand-lettered in black marker on a piece of brown cardboard, it read CLOSED UNTIL FURTHER NOTICE. I knocked on the door. I went into the alley behind the bar and rang the back doorbell. No response. I peered through the barred windows, but inside, all was dark and silent. Nothing to do but drive over to the Fenway. I wasn’t hungry, but I’d stop somewhere and get a bite to eat to kill time before I had to be at the job site. As I got into the Jag, I wished I’d met Daniel after all, if for no other reason than the warm touch of his hand. Instead, I got a chill as the crow cawed again. It sounded like desolation, like heartache, like a hunger for things forever gone. I shivered. Then I started my car and drove into the darkness. 9 MY CLIENT, TYLER BOSKIRK, LIVED ALONE IN A ONE-BEDROOM condo on Peterborough Street. Tyler was an MBA with a stalled career who suffered from anxiety dreams. The poor guy was stuck in a vicious circle. Every night, he’d lie in bed, worrying himself to a frazzle about his job. When he fell asleep, that anxiety spilled over into his dreams. In the morning, he was exhausted and even more anxious—which didn’t do a whole lot for his job performance. “The dream always begins the same way.” Tyler sat propped against pillows in his queen-sized bed, wearing blue-and-white-striped pajamas. He was clean-cut, with short brown hair. I’d guess he was in his mid-thirties, but with his starting-to-droop jowls and receding hairline, his fifty-year-old face was already beginning to show. As he spoke, he twisted his monogrammed sheet in his hands. “I dream I have to give a presentation. But from the moment I walk into the conference room, everything goes wrong.” “What typically happens?” I shifted in the hard wooden chair I’d carried in from the dining room. “Um. I don’t know. Different things.” His face flushed scarlet. He looked at the sheet he was strangling in his fist, then smoothed it over his lap. “I’m not prepared. The equipment I need isn’t there. Or if it is, it won’t work. Or the room is empty and I realize I got the time wrong. Or, you know, other things …” He shuddered as his voice trailed off. “Whatever happens, though, I wake up in a cold sweat. My heart’s pounding, and I can’t get back to sleep.” “Well, tonight you’re going to sleep like a baby safe in Mama’s arms.” I smiled reassuringly as I handed him the magically charged sleeping pill I dispense to keep clients slumbering through the extermination. He gave me a funny look as he took the pill and picked up a water glass from his nightstand. He washed down the pill and set the glass back in place. “She dropped me,” he said. I raised my eyebrows. “My mother. When I was a baby. She dropped me on my head.” He lay back on the pillows. “I’m still working through it with my therapist.” “Sorry. I didn’t know.” Guess I’d have to cut that line from my patter. He yawned, his eyelids already drooping. “ ’S okay.” The pill was hitting him fast—the magic sometimes did that—so I hurried to finish explaining my procedure. I took the dream-portal generator from my duffel bag and plugged it in. When I touched the On button, it hummed to life, sending a rainbow-hued beam of sparkling light into the room. “This portal allows me to enter your dream. Like a door, it works both ways—it gets me into your dream and back out again. But it’s password-protected, so you don’t have to worry about any demons escaping from your dreamscape into your waking world.” “Mmm-hmm.” Tyler punched his pillow and turned onto his side. “This device,” I said, holding it out, “is an InDetect. It helps me locate demons. I’ve set it to Inimicus somniorum—that’s the fancy name for dream-demons, or Drudes. I won’t leave your dreamscape until I’ve exterminated all Drudes hiding in there.” I looped the InDetect’s cord around my neck. “ ’ Kay.” “Stay with me one more minute, Tyler. This is what I use to kill Drudes.” I pulled my pistol from the bag and checked the clip. “It’s loaded with bronze bullets. Bronze kills demons. I’m showing it to you now because I don’t want you to be alarmed if you see me firing a gun in your dream. It can’t hurt you in there. Understand?”","sourceLink":"https://allnovel.net/hellforged-deadtown-2/page-14.html","bookId":2610,"book":{"id":2610,"title":"Hellforged (Deadtown #2)","description":"Storyline: Hellforged (Deadtown #2) A demon is stalking Vicky\u0027s dreams-just as several of Deadtown\u0027s zombies are viciously attacked and become really dead. And when Vicky realizes she is the only connection between the victims, she suspects that the demon is somehow working through her dreams to become Deadtown\u0027s living nightmare.","cover":"https://allnovel.net/images/hellforged-deadtown-2.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/hellforged-deadtown-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:34:26 PM"}}
