{"id":98616,"no":3,"title":"Page 3","content":"\\n\\n “Locked me in, you mean.”\\n\\n “—and I went to the security surveillance station to see what you were up to. The officer was sprawled across the desk, and snoring. I woke him, and we both saw you disable the camera. We rushed to the lab before you could do worse.” His glare was just this side of murderous.\\n\\n “Whoa, Professor.” I held out both hands in a calm-down gesture. “I didn’t disable anything. That was the Glitch. I sprayed the camera to pull it out of your surveillance system. It fried the camera when it came out.”\\n\\n “That’s impossible.”\\n\\n “You are so lame!” sputtered Tina. “That Glitch zapped you halfway into next week, it clawed your face all to hell, you’ve got Glitch spit gooping up your hair—and you keep saying there’s no such thing. How can you be so stupid?”\\n\\n Milsap gaped at her, his face a mixture of dumbfounded dropped-jaw and angry furrowed-forehead. As if never in his whole life had anyone called him stupid before.\\n\\n “Whatever.” Tina dismissed him with a wave of her hand. “I saw a vending machine back there, Vicky. I’m getting something to eat.” She’d have slammed the door behind her if it wasn’t the self-closing kind.\\n\\n Zombies are always hungry. Now that I thought of it, I’d never seen Tina go so long without a snack—or twelve. It’d be good for her to work off her emotions by chomping down twenty or thirty chocolate bars.\\n\\n Milsap stared after her. “Next, you people will be telling me the library is haunted by the ghost of some undergraduate who perished in the stacks.”\\n\\n “Don’t be ridiculous, Professor.” He blinked at me like a purple-spotted owl. “Everyone knows there’s no such thing as ghosts.”\\n\\n He kept blinking, like he couldn’t tell whether I was kidding or not.\\n\\n I approached him with the sodden mass of paper towels. “Let me get a look at you.” He leaned over the sink again, turning his head so the spit-covered side was toward me. I used the paper towels to scrub more of the gunk from his face. I can’t say I was all that gentle—I mean, the guy had tried to rip me off and have me arrested. He winced, but he didn’t complain. I inspected the slashes on his cheek where the Glitch had clawed him, checking the broken skin for specks of venom. I dabbed at a couple of spots with the paper towels, lifting the poison out, then rubbed in more soap. Milsap flinched as the soap stung him. Another rinse, and I checked again.\\n\\n “That’s the best we can do for now,” I said. “I cleaned the venom out of the cuts, but keep scrubbing your face until there’s no trace of purple left. It’ll take a day or two to get rid of it, but you should be okay as long as it’s completely gone in a week. It takes about that long for the poison to work.”\\n\\n He straightened again and glanced in the mirror. “And my hair?”\\n\\n “Wash it a hundred times, shave it off, whatever. You could even leave it in for a new look—if you can stand the smell. The stuff in your hair won’t hurt you. But get it off your skin.”\\n\\n A tremendous crash shuddered the bathroom door. Tina must have been awfully hungry—it sounded like she’d torn the front off the vending machine and hurled it down the hallway. Well, why not? Like I said, zombies are always hungry. And she’d already wrecked her manicure.\\n\\n 2\\n\\n “I DON’T SEE WHY YOU WOULDN’T LET ME DRIVE.” TINA SAT sideways in an upholstered chair in the lounge of the group home she shared with other zombified teens. A sofa and some chairs formed a semicircle in front of a thirty-two-inch TV mounted on the wall. Behind the chairs stood a battered Ping-Pong table, its net sagging. Bookshelves lined the far wall. An audio system took up more shelf space than any books did.\\n\\n Tina lay back against one arm of the chair; her legs stuck out over the other, showing off her ripped-knee jeans. Her legs didn’t exactly dangle, thanks to her undead stiffness, but it was as close to lounging as a zombie could get. Empty chip bags and donut boxes littered the floor.\\n\\n “Why didn’t I let you drive? Hmm. Well, for starters, you don’t have a driver’s license.”\\n\\n “So? I know how. I almost had my learner’s permit when the stupid plague came along.”\\n\\n “You were fifteen,” I reminded her. “You need to be sixteen to get a permit.”\\n\\n She picked at her baby-pink nail polish. “I said almost. Anyway, who’d teach me? My dad promised he would, but he and Mom couldn’t dump me fast enough once they realized I was gonna be stuck this way forever.”\\n\\n It was true. And I felt for the kid, really—but nobody besides me would ever drive that car. A 1964 E-type Jaguar in classic racing green, Dad had shipped it over from Wales when he and Mom moved to Massachusetts in the 1970s. Now, the Jag was all I had left of him—and Tina would not be wrapping it around a lamppost.\\n\\n “Enough. Let’s talk about tonight’s job.” Tina was getting work-study credit at her high school for being my apprentice. “What did you know about Glitches going in?”\\n\\n She swung around in the chair so she was sitting up straight—more or less. She tore open a bag of pretzels and stuffed handfuls into her mouth between sentences. “Anti-technology demons. Glitches are really old—like, older than cavemen. Back in the day, they didn’t bother the norms. They lived in storm clouds, eating electricity. But the Bronze Age dawned, and humans discovered that bronze weapons kill demons. Glitches declared war, attacking any new kind of technology.”\\n\\n “Right.” I nodded. “That’s why I have to go after them with low-tech weapons like knives and axes. Anything more advanced, and they gum up the weapon itself. You saw what happened when the security guard fired his gun.”\\n\\n “That was awesome.” She sent me a sidelong glance. “Are you mad at me for busting out of that professor’s office? I know you said I have to stay away from the job site, but—”\\n\\n “It’s okay. This time.” Back in October, Tina had wreaked all kinds of havoc when she’d followed me into a client’s dream and accidentally torched his dreamscape. “You’re supposed to stay with the client, yes, but this client wouldn’t stay put. It was an unusual situation.”\\n\\n We went over other info about Glitches—their habits, their habitat, the effects of Glitch venom on humans and other species.\\n\\n “Would that stuff hurt zombies?”\\n\\n “That’s a good question, Tina. I don’t know. Probably not.” Boston’s zombies, like their horror-movie counterparts, were hard to kill. Direct exposure to sunlight made their skin deteriorate—a “zombie sunburn” caused orange, pitted, permanently damaged skin—but it didn’t kill them. A zombie could fall off a building, walk through a raging fire, be riddled with bullets, chug a gallon of drain cleaner, and then go out for pizza. Zombies didn’t feel pain, but neither did they heal. A burned or bullet-riddled zombie would survive, but the flesh would remain charred, the holes always open. A couple of things were known to kill zombies, like cutting off the head or using special exploding bullets available only to cops. Maybe setting off a nuclear bomb under the bed of a sleeping zombie would do it, but as far as I knew no one had tried that yet.\\n\\n “Okay,” I said. “Write a report on Glitches for your portfolio. We’re meeting tomorrow night at seven thirty before school, right?” She nodded. “Finish Russom’s chapter on water demons.” Russom’s Demoniacal Taxonomy was the textbook my aunt Mab had started me on. I’d trained with Mab every summer for seven years at her remote estate in north Wales. The book was every bit as dry as its title promised, but there was no better resource on demons.\\n\\n I was pulling on my jacket when the door to the lounge flew open, banging against the wall. Through it flew Jenna, Tina’s zombie BFF. With long, straight, straw-colored hair, Jenna was a little shorter and a little chubbier than her friend. She wore jeans and an oversized black T-shirt that read HUG A ZOMBIE in white letters.\\n\\n “Omigod! Turn on the TV—now. Now!” Jenna didn’t wait for Tina to move; she snatched the remote from the coffee table and pressed the Power button. She flipped through the channels until she found PNN—the Paranormal News Network—then fell onto the sofa. The station showed a press conference with the Council of Three: the vampire, werewolf, and zombie who (in name, anyway) were Deadtown’s elected leaders. The Council was just a trio of figureheads, as anyone could tell by the topic of their press conference. Hadrian, the vampire councilor, was announcing a resolution declaring February 2 Paranormal Appreciation Day.\\n\\n Groundhog Day. How appropriate. Maybe we were supposed to step into the norm world, get scared by our own shadows, and run back to our burrows here in Deadtown.\\n\\n Tina snorted. “What, are you trying to bore me to death?”\\n\\n Jenna hit the Mute button and popped her gum. “It’ll be on again in a minute.”\\n\\n “What?”\\n\\n “Nuh-uh. I’m not telling. You’ll see.”\\n\\n “Jenna, aren’t you supposed to be in school?” I asked. It was three in the morning, half an hour before school let out.\\n\\n She shrugged, snapping her gum again. “I only cut last period.”\\n\\n Not my problem. I wasn’t about to start playing truant officer for Deadtown’s teenage zombies. I began to say good-bye, but before I got two words out Jenna shouted, “Here it is!” A blast of guitar chords assaulted my ears, and both girls leapt to their feet and screamed. I looked at the TV to see what had them so excited.\\n\\n The image switched from a stadium concert to the PNN newsroom. Rhoda Harris, a zombie newscaster, sat behind a desk, her stiff hairstyle and bright yellow suit contrasting with her zombified features. Behind her was a publicity photo of a man with wavy hair, big brown eyes, and a million-dollar smile. “He used to be known as Paul Montoya, singer of soulful love ballads such as ‘I’ll Give You My World’ and ‘Tomorrow Is for Us.’ Then, nearly three years ago, he was caught in Boston’s plague. As a previously deceased human, Montoya believed his career was over.” \\n\\n","sourceLink":"https://allnovel.net/hellforged-deadtown-2/page-3.html","bookId":2610,"book":{"id":2610,"title":"Hellforged (Deadtown #2)","description":"Storyline: Hellforged (Deadtown #2) \\n A demon is stalking Vicky\u0027s dreams-just as several of Deadtown\u0027s zombies are viciously attacked and become really dead. And when Vicky realizes she is the only connection between the victims, she suspects that the demon is somehow working through her dreams to become Deadtown\u0027s living nightmare.\\n","cover":"https://allnovel.net/images/hellforged-deadtown-2.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/hellforged-deadtown-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:34:26 PM"}}
