{"id":98672,"no":61,"title":"Page 61","content":"\\n\\n “Greetings, former daughter of Ceridwen. At last our bond is fulfilled.”\\n\\n I tried to turn around, but I could barely twist my head, so heavily did the Hellion weigh me down.\\n\\n “Release me … Hellion … I … command it.” Even speaking required immense effort.\\n\\n “No.” That single syllable of refusal rang with triumph. “We are part of thee, bound to thee by thine own words. And now we claim that bond.”\\n\\n Something broke inside me, and I knew there was no escape. I’d been a fool, chasing after purity. Purity was lost to me, and it had been ever since I’d bound this Hellion to myself. No, earlier. Ever since the night it marked me. I could never be pure. I was tainted, corrupted, contaminated. Just like Pryce, I was part demon. I belonged in Hell.\\n\\n From a goddess two lines diverged, but they are reunited in Victory.\\n\\n So this was my destiny—bound forever to the Destroyer, subject to the demon I hated more than anything in any world.\\n\\n I watched, helpless, as Pryce drew back his club and struck a slate gravestone. Black mist wafted upward, solidified, and flew cawing into the night.\\n\\n Instinctively, I reached for Hellforged, but Difethwr’s arm came forward and plucked the dagger from my belt. “At last,” it said, “the blade we crafted returns to us. We have better uses for it than the crude one thou hast employed.”\\n\\n Pryce came over and stood before me, the oak club dangling from his hand. Cysgod towered beside him. Pryce looked me over appraisingly, his gaze roaming over my face and body; my heaviness was so great I couldn’t look away. Lips pursed, he leaned forward, and I struggled to turn my head and avoid his kiss.\\n\\n He spat in my face.\\n\\n “Teach this bitch a lesson, Cysgod,” he said. “Hurt her as much as you like. But don’t kill her, and don’t injure her womb. She and I have a date later tonight.”\\n\\n Cysgod’s sword flashed. I couldn’t raise my own in time to deflect the blow. The blade hacked into my arm, a slash of pain and fire that cut to the bone. Black flame burned me, eating at the edges of the wound.\\n\\n As Pryce watched, Cysgod surged forward in a flurry of slashing cuts. Its sword bit my arms, my chest, my legs, my back, my face. Life-eating flame engulfed me, scorching, burning, consuming my flesh, my spirit. Difethwr’s crushing weight held me in place. Covered with blood, I collapsed to my knees, then fell onto my face. My left hand still grasped the Sword of Saint Michael, but the blade’s flames had died to a weak glow.\\n\\n “Enough,” Pryce said. Immediately, Cysgod stopped. Pryce’s shiny black shoes appeared and stood beside Cysgod’s scaly, taloned foot. Together, they kicked dirt onto the blade of my sword. Its glow went out. Dirt got into my eyes and mouth. It tasted like death.\\n\\n “Cysgod,” Pryce said. “I have an idea. Let’s see if there’s anything left of my cousin’s suitors. If they’re still alive, we’ll bring them back here for you and Difethwr to occupy yourselves with while I finish releasing the Morfran.” His voice took on a tone of playful warning. “No squabbling, though, over who gets the werewolf and who gets the human.”\\n\\n No! I struggled to push myself up, but I couldn’t. I was merely a heap of burned and beaten flesh.\\n\\n Pryce laughed, and the shoes moved away. Cysgod’s feet moved with them. As the shadow demon lifted its foot to step over the Sword of Saint Michael, I dug deep and summoned the strength to turn and position my blade. Cysgod’s foot came down on its edge. Black, stinking blood fountained up as the blade went in deep.\\n\\n At the touch of demon flesh, the sword burst into full flame. Cysgod roared and tried to shake itself loose, but its foot was stuck, the flesh liquefying around the blade. Somehow, I got my knees under me. Clutching the sword grip with my left hand, I sliced upward. Yellow, sulfurous smoke billowed from the wound. Cysgod shrieked and kicked out, hard. The powerful kick, combined with the momentum of my stroke, cut the foot in two and sent the weapon arcing backward. I almost lost the sword but managed to hang on. The blade struck something behind me and sank in, then stopped from the resistance. Keeping my eye on Cysgod—the demon, half-obscured by the yellow smoke, howled and roared and hopped around on one foot—I jerked the sword forward.\\n\\n It came out with such force that I fell, catching myself on my forearms.\\n\\n The strength I thought I’d lost surged into me, and I jumped to my feet. I charged Cysgod, driving my sword into its gut and knocking the one-footed demon off balance. It crashed to the ground. I was right on top of it, slicing, stabbing, hacking. It swiped at me with its claws, but each time I landed a blow with the sacred sword, Cysgod weakened. The foul yellow smoke spread, stinging my eyes and clogging my lungs. It filled the cemetery. I squinted through the smoke, coughing, and kept striking. I drove the sword into the creature, over and over, until it felt like the blade was striking bare ground.\\n\\n I stepped back, breathing hard. I waved at the smoke to clear it. The ground where Cysgod had fallen was empty, except for a fetid pool of thick, black blood.\\n\\n One demon down.\\n\\n I whirled around, my sword blazing, to face the Destroyer. Difethwr slumped on the ground, its head split in two. Gobs of black stuff and steaming liquid oozed from its skull. How … ? Cysgod’s kick—the Hellion must have been bending over me, and the force of the backward blow sliced open its skull. No wonder my strength had returned. Now, Difethwr’s blue skin looked dull and wan. Its eyes, no longer fiery, were black, empty sockets.\\n\\n I couldn’t believe it was dead.\\n\\n I poked its leg with my toe. No response. I drew back my foot and kicked it as hard as I could. It was like kicking a stone wall. I stretched and flexed my right hand—it felt whole and strong, no longer useless in the Destroyer’s presence. With my left hand, I tossed the Sword of Saint Michael into the air and caught it in my right. Its flames burned brighter, flaring to a conflagration as I struck the blow that severed the Hellion’s ruined head from its body.\\n\\n Now to deal with Pryce.\\n\\n He wasn’t far off. I spotted him immediately, slouched by a tombstone, the oak club dangling from his hand. I dashed toward him, sword raised, intent on preventing him from releasing any more of the Morfran. But he didn’t lift his arm to strike the slate. He didn’t move at all. There was something odd in the way he stood there, shoulders slumped, body slack.\\n\\n Kane roared in out of nowhere and tackled Pryce. They tumbled across the grass. Kane sat up, pulling Pryce up with him by his lapels. “WHERE IS SHE?” he shouted. Pryce’s head lolled. Kane backhanded him; blood splattered a tombstone. “If you’ve hurt her,” he growled. “If you’ve touched one hair on her head, I’ll rip you apart.”\\n\\n Kane was a nightmare vision, his features twisted with rage. Blood matted his hair and streaked his face. His torn shirt was drenched with even more blood. He backhanded Pryce again but got no response. Kane bellowed with fury and pounded Pryce into the ground.\\n\\n “Kane!” I screamed, but he didn’t hear.\\n\\n Someone else was yelling, too. Daniel. He ran to Kane, tried to pull him off Pryce. Kane swatted him away, but Daniel grabbed his arm and held on. “Stop!” he shouted. “Kane, listen, you’ve got to stop. The Goon Squad is here.”\\n\\n Oh, God. The werewolf murder suspect beating the crap out of a human. Pryce wasn’t human, but the Goon Squad didn’t know that. They’d shoot him on sight.\\n\\n “Stop! Please stop!” I pleaded.\\n\\n Kane didn’t look at me, but he paused. A shudder went through him, and he shook off whatever he was feeling. Slowly, he climbed to his feet. Pryce flopped backward onto the ground. Daniel leaned over to check his pulse.\\n\\n “Vicky,” Kane said, his voice thick. “Have you seen her?”\\n\\n “No. We’ll find her. But for now you’d better move over there, away from this guy.”\\n\\n Kane nodded.\\n\\n “Are you okay?” Daniel asked. “I thought that thing killed you.”\\n\\n “I don’t die that easily. And no, I’m not okay.” Kane stalked away from Pryce’s inert form. He paced by the fence.\\n\\n I ran to him. Just before I caught up with him, he stopped and pressed his face into his hands. Then he looked up into the sky. “Vicky!” he howled.\\n\\n “I’m here, Kane,” I said. “What happened to you?”\\n\\n He gave no sign he’d heard me. Instead, he resumed pacing.\\n\\n I ran ahead and planted myself in front of him. He walked right through me as though I were a ghost.\\n\\n I might as well have been.\\n\\n Kane didn’t know I was there. Because I wasn’t—not in his world. I was in Uffern. All around me, black fires burned, giving off the stench of sulfur and charred meat. Cries of pain and torment and cruel, mocking laughter clogged the air. None of this reached Kane in the Ordinary. He couldn’t see or hear me.\\n\\n My heart thumped. What if I couldn’t get out? What if my bond to Difethwr kept me here, a prisoner in Hell? The Hellion was dead, but its essence was still inside me.\\n\\n Never had I felt so filthy, so contaminated. Purity was a joke.\\n\\n But if I wasn’t pure, then I wasn’t purely demon, either. This wasn’t my place. I’d found my way out of that weird, demon-induced sleep world by focusing on what was real. Maybe I could do the same thing now. I concentrated, willing myself into the Ordinary, bringing back the colors and sounds and scents I knew existed there. The frost-covered grass. The pearl-white, waning moon. Warm, yellow lights shining from buildings. Kane’s moonlight-and-pine scent. The heat of his skin, the suppleness of his muscles. Slowly, my senses shuttered themselves to the horrors of Uffern. Demonic shrieks and smells faded; light brightened.\\n\\n Kane’s eyes brightened, too, when they saw me.\\n\\n “Vicky.” Never has a single word held so much meaning.\\n\\n We came together like waves crashing into the shore. I tasted his blood, his sweat, his skin. His closeness swept away any lingering horror. I couldn’t touch him enough. I ran my hands over his chest, through his hair, across his back. The back of his shirt was as torn and stiff with blood as the front. Hard lumps of scar tissue arose at regular intervals, to the right of his spine, four or five inches apart. \\n\\n","sourceLink":"https://allnovel.net/hellforged-deadtown-2/page-61.html","bookId":2610,"book":{"id":2610,"title":"Hellforged (Deadtown #2)","description":"Storyline: Hellforged (Deadtown #2) \\n A demon is stalking Vicky\u0027s dreams-just as several of Deadtown\u0027s zombies are viciously attacked and become really dead. And when Vicky realizes she is the only connection between the victims, she suspects that the demon is somehow working through her dreams to become Deadtown\u0027s living nightmare.\\n","cover":"https://allnovel.net/images/hellforged-deadtown-2.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/hellforged-deadtown-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:34:26 PM"}}
