{"id":79553,"no":25,"title":"Page 25","content":"Rennie shook her head. “He used a condom. Don’t worry.” She looked away. “He came over and asked Ian for one.”\\n\\n “Oh my God. Oh my God.” I said it over and over. Like a prayer. A prayer for this to be a nightmare, to wake up and not be here. Anywhere but here.\\n\\n “Lil, you need to—”\\n\\n “Did you have sex with Ian?”\\n\\n “Yeah.” She said it softly.\\n\\n “Why didn’t you help me?” I wept. I remembered now, calling out her name. I saw her with Ian in the bed. Mike was kissing me down my neck, pulling the front of my bathing suit as low as it would go. I called out “Rennie.” Then I blacked out.\\n\\n “You were fine! You were having a good time.” She started walking away from me.\\n\\n I ran up to her and grabbed her arm. “No, I wasn’t! You knew I didn’t want it to happen this way!” With a boy I barely knew, in the same room as my best friend, so drunk I could barely keep my head up. My first time was supposed to be special. With someone I loved. I’d barely fooled around with anybody before. I’d only ever kissed three boys total.\\n\\n Rennie shook me off. Her eyes were hard diamonds. “Things got out of hand. But we both knew what was going to happen when we went upstairs with them.”\\n\\n “I didn’t know!” I screamed it so loud, my throat burned.\\n\\n “Come on, Lillia! You were in it just as much as I was. No one poured those shots down your throat.”\\n\\n “It—it wasn’t supposed to happen like that. Not to me.”\\n\\n Rennie curled her lip. “But it was okay for me? I might not be a virgin, but I’m no slut.” I was crying too hard to answer her, and she sighed and said, “Look, it happened but it’s over. Let’s just forget it.”\\n\\n “I can’t,” I said, my shoulders shaking. “I mean, what if people find out? What if we see those guys again?” The thought of running into Mike somewhere on the island made me want to die.\\n\\n Rennie shook her head and put her hands on my shoulders. “They were only renting for the week, remember? They’ll be gone by this afternoon.” She locked eyes with me. “I’m not saying anything. You’re not saying anything. No one will ever know.”\\n\\n It was light out by the time we got to Rennie’s apartment complex. I wanted to go home. I wanted to tell my mom everything. She’d know what to do. She’d know how to fix it. But I couldn’t tell her. She thought I was having a sleepover at Rennie’s. And what would she think of me if she knew? What would my dad think? And Nadia? I would never be the same girl to them. Never, ever.\\n\\n When I got out of the shower, Rennie was already in her bed, her eyes closed. I crawled in next to her. With our backs to each other, she said, “Tonight never happened. We’re never talking about this ever again.”\\n\\n * * *\\n\\n We pick up Ashlin and then drive over to the theater. I don’t even know what’s playing until we get there. The guys are waiting outside for us. Rennie jumps onto Reeve’s back, and he carries her inside. Ashlin and I get in the concessions line and figure out our snack game plan.\\n\\n “How about popcorn, Reese’s Pieces, and gummi bears?” she asks.\\n\\n I can feel Alex lurking behind me, so I make a big show of saying, “No Sno-Caps? They’re the best!” Sno-Caps are Alex’s favorite.\\n\\n Ashlin makes a face. “Sno-Caps are gross, Lil! They taste like dust.”\\n\\n And just like clockwork, Alex comes over and says to Ashlin, “Are you kidding? Sno-Caps are awesome.”\\n\\n “See?” I say to Ashlin. “I’m not the only one who likes them.”\\n\\n To the girl at the concessions stand, Alex says, “One box of Sno-Caps, please.”\\n\\n I put my chin on his shoulder. “You’re sharing with me, right?”\\n\\n “Get your own box,” he says. But the backs of his ears are pink, and the corners of his mouth are turned up in a smile.\\n\\n Just like that, I know I’ve got Alex right where I want him—thinking everything’s cool between us and that I don’t suspect a thing.\\n\\n CHAPTER FIFTEEN\\n\\n MARY\\n\\n I’M AT THE KITCHEN TABLE, FINISHING UP MY HOMEWORK. Aunt Bette’s on the phone with one of her friends as she does the dinner dishes. She says, “Things are great. Mary’s been keeping me company.”\\n\\n Even though things were a little awkward those first few days, now Aunt Bette is really happy to have me here. We’ve settled into a nice routine. I try to stay out of her way, and not interrupt her while she’s painting. And if my bedroom door is closed, she leaves me alone.\\n\\n When I came home super late from that night at the docks, Aunt Bette was still up. I begged her to please not say anything to my parents. If they found out, they’d probably pack up the car and come and get me. Aunt Bette didn’t say yes or no, but my parents haven’t showed up in the minivan, so I’m pretty sure she didn’t tell them.\\n\\n That’s the kind of cool aunt she is.\\n\\n As soon as Aunt Bette goes to bed, I sneak outside to wait for Kat. I sit on the curb with my legs stretched out. The other houses are dark, and far, far down the hill I can just barely make out the moon hitting the water. If I concentrate hard enough, I bet I could hear the ocean.\\n\\n Eventually Kat’s convertible comes up the hill with the lights off, and I jump up from the curb. She pulls to a stop right in front of me. “Hey,” she says. “Ready to do this?”\\n\\n “Totally,” I say as I climb in over the door and into the backseat. “I can’t wait to get my license.” I mean, I love my bike, but with a license I could go anywhere. So long as Aunt Bette let me borrow the Volvo.\\n\\n Turning around, she says, “Why are you sitting in the back? I’m not a chauffeur.”\\n\\n I flush. “I don’t know. I thought I’d give Lillia the front seat.”\\n\\n I feel clumsy and stupid until she starts to drive and then she says, “I’m sure that’s exactly what she’d expect. Only the best for Princess Lillia.”\\n\\n “I really don’t mind,” I say, leaning forward.\\n\\n Kat snorts. “Of course you don’t,” but she says it nice, as if it were a compliment.\\n\\n Pretty soon we’re in front of Lillia’s house. It’s so big and modern. It’s not even a house; it’s a full-on mansion. Lillia lives on the ritziest part of the island, White Haven. Most of the houses have thick hedges around the yards so you can barely see what they look like. And there’s so much space. The houses are spread far apart, with big garages that fit a ton of cars, and fancy gardens and manicured lawns. \\n\\n","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-25.html","bookId":2726,"book":{"id":2726,"title":"Burn for Burn (Burn for Burn #1)","description":"Storyline: Postcard-perfect Jar Island is home to charming tourist shops, pristine beaches, amazing oceanfront homes—and three girls secretly plotting revenge. \\n KAT is sick and tired of being bullied by her former best friend. \\n LILLIA has always looked out for her little sister, so when she discovers that one of her guy friends has been secretly hooking up with her, she’s going to put a stop to it. \\n MARY is perpetually haunted by a traumatic event from years past, and the boy who’s responsible has yet to get what’s coming to him. \\n None of the girls can act on their revenge fantasies alone without being suspected. But together…anything is possible. \\n With an alliance in place, there will be no more “I wish I’d said…” or “If I could go back and do things differently...” These girls will show Jar Island that revenge is a dish best enjoyed together.\\n","cover":"https://allnovel.net/images/burn-for-burn-burn-for-burn-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/burn-for-burn-burn-for-burn-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:15:45 PM"}}
