{"id":79563,"no":36,"title":"Page 36","content":"“Quarterback and captain, number sixty-three, REEVE TABATSKY.”\\n\\n Hearing his name, Reeve hops up onto the team bench and waves to the crowd. They scream for him rock star style. Rennie turns a bunch of back handsprings the entire length of the bench.\\n\\n “Your kicker, number twenty-seven, PJ MOORE!”\\n\\n Everyone cheers for PJ as he steps up onto the bench with Reeve. He pulls his leg back and then swings it forward, simulating a kick. Lillia leaps up and does a toetouch.\\n\\n The applause dies down, and I suck in a breath, because I know what’s next.\\n\\n “Wide receiver, number forty-six, ALEX LIMP.”\\n\\n A few people clap, but mostly there’s just snickers and people whispering, “What did they just call him? ‘Limp’?”\\n\\n Alex drops his head to the side, like he maybe didn’t hear right. His face is red, redder than it is normally with his skin issue. Redder than I’ve ever seen a face get. The blond girl who’s Alex’s cheerleader has her pom-poms up over her head and, she’s about to lean into a handstand. But she doesn’t. She freezes.\\n\\n I guess because Alex doesn’t climb up onto the bench, the announcer says his name once again. “ALEX LIMP!”\\n\\n This time everyone hears.\\n\\n Reeve pitches forward laughing. PJ too. One of the players standing behind Alex taps him on the back. When Alex turns around, everyone in the crowd sees it. The back of his jersey doesn’t say “Lind.” It says “Limp.”\\n\\n Lillia’s brilliant idea. She swapped out his old jersey with this new one, bought from an athletic store online that makes jerseys in our school colors. She sent them a money order so the order couldn’t be traced to her, and then she had it overnighted.\\n\\n “Oh my God,” the girls in front of me squeal. “Alex Limp? Eww! That’s so gross!”\\n\\n I watch Lillia. She’s covering her face with her hands, pretending to be shocked. Her sister had started jumping around and clapping when the announcer first called out Alex’s name, but now her hands are dropped to her sides. She takes a few steps backward, and hides behind the other cheerleaders standing around the bench.\\n\\n Alex starts turning in circles like a dog chasing his tail, trying to see or get his hands up on the back of his jersey. I burst out laughing, because it’s just too funny.\\n\\n Reeve eventually hops down from the bench and tries to help Alex, even though he’s laughing at him pretty hard. Well, maybe that’s what Reeve wants to do. But I guess Alex just sees his friend laughing at him, because he lowers his head, drops his helmet, and rushes Reeve, wrapping his arms around Reeve’s waist. He tackles him down on the ground with a big thud.\\n\\n No one in the stands is applauding anymore. The whole team swarms around the boys wrestling on the ground, and the coach puts his whistle into his mouth and blows it a bunch of times, rapid-fire. The announcer keeps announcing the names of the other senior boys, but no one’s getting up onto the bench. They’re all trying to pull Alex off Reeve, to stop him from punching Reeve in the face. I see Alex get a real good shot in, right against Reeve’s jaw. My hands fly to my face.\\n\\n Kat and her friends run up to the fence, shouting, “Fight! Fight! Fight!” Kat climbs up onto the fence a few links, trying to get a better look.\\n\\n Finally Alex gets pulled off. Reeve is there in the grass, lying on his back. One of his teammates holds out a hand to help him up, but Reeve swats it away and gets to his feet on his own. It takes him a second, though. His jaw is red and swollen. And his jersey is dirty.\\n\\n Alex is standing a few feet away, with Derek trying his best to keep him from lunging at Reeve again. Alex is shouting something I can’t hear from where I’m sitting, and he’s jabbing his finger at Reeve over Derek’s shoulder. Reeve isn’t even listening. He turns his back on Alex and walks down the sideline. Rennie’s trying to get to Reeve, to see if he’s okay, I guess, but Ashlin is holding her arm. She won’t let her go. Two of the coaches run up, looking concerned, and check Reeve’s throwing arm. No one goes to Alex to see if he’s okay. But the head coach does storm over and scream at Alex so hard, spit goes flying out of his mouth. Derek forces Alex to sit down on the team bench before he walks away too.\\n\\n “What is Alex thinking?” one of the girls in front of me cries. “Reeve is our QB. Alex could have just ruined our whole football season!”\\n\\n “I bet he’s still pissed at Reeve for that Red Ribbon thing.”\\n\\n “Poor limp Alex,” the third girl says, and the rest of them laugh.\\n\\n The game starts shortly thereafter, and if Reeve was shaken by the whole Alex fight, he doesn’t show it. It only takes two or three plays before he lobs a touchdown pass into the end zone. By then everyone’s back to cheering for Reeve again, as if the fight never happened. Alex is on the bench, looking upset.\\n\\n At halftime I get up to buy some Diet Coke, but the line’s too long. Kat’s already gone. I saw her and her friends leave not long after the fight. I wonder if I should stick around or not.\\n\\n I walk past the cheering bench. The girl who cheered for Alex is a few steps away from the other girls on the squad, pleading with Rennie and Lillia.\\n\\n “Come on, you guys!” she whines. “Isn’t there someone else I can cheer for?”\\n\\n “Are you serious?” Lillia says, folding her arms.\\n\\n “Please! Every time I do my player cheer, people are yelling ‘Go Liiimp!’”\\n\\n “Don’t worry about it,” Rennie says. “He probably won’t even get to play tonight.”\\n\\n The girl gasps. “What if he gets kicked off the team? I won’t have anyone to cheer for!”\\n\\n At that moment Nadia comes over. Quietly she says to Rennie, “If Wendy doesn’t want to cheer for Alex, I will. We can trade. I don’t mind.”\\n\\n Lillia’s mouth drops open. She crosses her arms. “No one is changing players. Rennie put a lot of thought into the assignments.”\\n\\n Nodding, Rennie says, “Lillia’s right. What I say, goes. Wendy, you made a commitment to Alex. You’re going to honor that. If you don’t like it, quit.” She grabs a mirror out of her duffel bag on the bench and fusses with her hair. “There are five college scouts in the crowd for Reeve tonight, and I need to be bringing my A game for him, not worrying about this nonsense. We’re done here.”\\n\\n Rennie turns and walks away from Nadia and the other cheerleader. Lillia follows her, and as she passes me, she gives me a nod.\\n\\n I give one back. Mission accomplished. And not a moment too soon, because honestly, I can’t wait until we start in on Rennie. \\n\\n","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-36.html","bookId":2726,"book":{"id":2726,"title":"Burn for Burn (Burn for Burn #1)","description":"Storyline: Postcard-perfect Jar Island is home to charming tourist shops, pristine beaches, amazing oceanfront homes—and three girls secretly plotting revenge. \\n KAT is sick and tired of being bullied by her former best friend. \\n LILLIA has always looked out for her little sister, so when she discovers that one of her guy friends has been secretly hooking up with her, she’s going to put a stop to it. \\n MARY is perpetually haunted by a traumatic event from years past, and the boy who’s responsible has yet to get what’s coming to him. \\n None of the girls can act on their revenge fantasies alone without being suspected. But together…anything is possible. \\n With an alliance in place, there will be no more “I wish I’d said…” or “If I could go back and do things differently...” These girls will show Jar Island that revenge is a dish best enjoyed together.\\n","cover":"https://allnovel.net/images/burn-for-burn-burn-for-burn-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/burn-for-burn-burn-for-burn-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:15:45 PM"}}
