{"id":79569,"no":44,"title":"Page 44","content":"Reeve didn’t say anything to me, but he suddenly picked up his pace. I walked faster too, to keep up with him. The boys called out, “Hey, Reeve! You forgot your book!” but Reeve pretended he didn’t hear them. He practically sprinted the last few feet to the ferry, like he was afraid he might miss it. The cars and trucks had already driven onto the freight deck, and it was just the people left, lining up to climb the plank onto the ferry. Reeve and I took our place at the end, him first and me right behind him. Then the boys from class came up and stood a few feet off to the side. They handed Reeve his notebook, and Reeve mumbled a thank-you. They started to walk away. I don’t know where this surge of courage came from. Maybe because things had been good between us. Maybe because I wanted to put Reeve in a spot where he’d have to admit what was going on. Maybe because I knew he didn’t really care about what these guys thought of him, from our conversations. There was one thing I did know for sure. Reeve had started the Big Easy thing, and it had caught on like wildfire. But if he showed everyone in class that we were cool, I knew it could end just as quickly. That’s how big a deal he was. I stepped forward so Reeve and I were side by side, and shouted at the boys, “So what? We’re friends!” as loudly as I possibly could. Then I threw my arm around Reeve’s shoulder and smiled at him. Reeve stared at me with unbelieving eyes. Once he blinked, though, he looked furious. He shouted, “Get the hell away from me!” And then he lunged. His palms went straight into my chest, and, throwing all his strength behind it, he shoved me toward the guys. The force of it was unbelievable. I didn’t have a chance. My sneakers skidded over the gravel. The boys quickly stepped out of my path, revealing the edge of the dock. I tried to just fall down, to keep myself from going into the water, but I kept flying backward. At the last second I put my arms out to try to stop myself from going over the side of the dock, and tiny splinters embedded in my palms. The pain had me gasping for air, my last breath before I plunged into the water. It was so cold, I could barely move. I could tell my hands were bleeding by the way the skin burned despite the chill of the water. I could hear their warbled laughter above me. “Yo, she looks like a manatee!” “Hey, manatee! You need a net?” “Swim! Swim for shore, manatee!” I flailed my arms and kicked my legs, trying to get to the surface. But my clothes weighed a hundred pounds, and I barely managed to get my head above water. I was gasping for air, and I kept swallowing mouthfuls of salty water. The dockworkers came running, and one of them tossed me a life preserver. It took two of them to pull me out. The ferry passengers leaned over the edge of the deck to watch. As soon as I was on land, I threw up a gallon of that salty water. That was when the boys finally stopped laughing and shrank away from the spectacle. The only one who wasn’t there was Reeve. My hands were bleeding, my clothes were soaked and stiff and speckled with gravel, and there was vomit on my shoes. It took me a minute before I realized that my white T-shirt was completely see-through, clinging to every one of my fat rolls. I started shaking, but I wasn’t cold. I was about to lose it. And then I did. I started crying, and I couldn’t stop. One ferry worker helped me up to the galley, then left to find me a blanket. He came back with a stack of brown paper towels from one of the bathroom dispensers. I tried using them to dry off, but as soon as they got wet, they disintegrated into ropy bits of pulp. The whole time I was sobbing. Reeve was there, in the galley too. He sat in the first row of seats near the deck windows, the seat he’d carved his name in. He looked straight ahead, out the window at Jar Island off in the distance. He didn’t acknowledge me, or what he’d done. He didn’t even turn around once. No matter how hard I cried. When we reached Jar Island, Reeve took off right away. I waited for the other passengers to disembark, and then I snuck off the ferry and hid behind a delivery truck that was waiting to drive aboard for the return trip. I could see my mom waiting there. As Reeve ran off the boat, she waved at him. He didn’t wave back. He pretended not to see her. If she didn’t see me, I knew she’d stay and wait for me to come in on the next boat. I couldn’t stand her seeing me that way. I didn’t want her to know that the boy I’d told her so much about, the boy we took for ice cream that rainy day, had done this to me. I decided to sneak home, change my clothes, and pretend to have come back by the next boat. She would never have to know what happened. Dad, too. I crouched down and used different cars for cover. Once I was out of the parking lot, I huffed it up the hill to our house, my sneakers squishing with every step. All I could think about was how he’d acted all those times when we were alone. Like he cared about me. Like we were friends. I couldn’t imagine facing him the next morning. Both because of what he’d done to me, and because I knew I’d never get that back again. As pathetic as it was, Reeve was the only friend I had left. I went up to my room and opened my closet with the intention to change clothes. Really. But instead of doing that I found myself staring up at the beams on my ceiling. Then I got a rope from the basement and, after a couple of tries, looped it over a beam and tied it into a noose. I dragged my desk chair over, slipped the rope over my neck. And then took a big step off the chair, and dropped. But as soon as I fell, I realized that I didn’t want to die. I started to fight, kicking my legs to try to get the desk chair to roll back to me. But the rope was so tight, and I couldn’t breathe. My weight swung me like a pendulum, and my feet kept knocking into the wall. I was starting to black out, lose consciousness. Luckily, my mom came home. She heard the tapping of my feet against the wall. She came in and screamed at the sight of me. She got me down, slipped the rope off my neck, and laid with me on the floor while she called 911, stroking my hair, until the paramedics arrived. * * * Kat and Lillia stare at me, horrified. “As soon as I was stable, my parents had me transferred to a different hospital, one far away from Jar Island. I was out of school for a whole year doing therapy and stuff. I had to live on a psych floor for months, trying to convince the doctors and nurses that I didn’t want to kill myself anymore. And the truth is, I didn’t want to. The one thing that kept me going was the thought of coming back here one day and making Reeve own up to what he did.”","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-44.html","bookId":2726,"book":{"id":2726,"title":"Burn for Burn (Burn for Burn #1)","description":"Storyline: Postcard-perfect Jar Island is home to charming tourist shops, pristine beaches, amazing oceanfront homes—and three girls secretly plotting revenge. KAT is sick and tired of being bullied by her former best friend. LILLIA has always looked out for her little sister, so when she discovers that one of her guy friends has been secretly hooking up with her, she’s going to put a stop to it. MARY is perpetually haunted by a traumatic event from years past, and the boy who’s responsible has yet to get what’s coming to him. None of the girls can act on their revenge fantasies alone without being suspected. But together…anything is possible. With an alliance in place, there will be no more “I wish I’d said…” or “If I could go back and do things differently...” These girls will show Jar Island that revenge is a dish best enjoyed together.","cover":"https://allnovel.net/images/burn-for-burn-burn-for-burn-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/burn-for-burn-burn-for-burn-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:15:45 PM"}}
