{"id":79572,"no":47,"title":"Page 47","content":"As if planning parties not everyone is invited to makes this school a better place. Ugh. She’s so transparent, I can’t believe everyone else doesn’t see through her.\\n\\n Rennie lowers her eyelashes, fake-humbly. “So please consider that when you vote, you guys.” As soon as she’s done with her speech, Rennie whispers to me, “This is so mine.”\\n\\n “Nobody deserves it more than you,” I whisper back, showing her my ballot with her name checked off.\\n\\n She reaches over and squeezes my knee. “You’re the best, Lil.”\\n\\n * * *\\n\\n My knee socks keep falling down. I wanted to wear sweats or leggings, but Rennie kept saying how knee socks are part of the powder-puff tradition. I was like, can’t we just dress up for the actual game? This is just practice. But no.\\n\\n Like always, powder-puff is the day before the homecoming game. That’s when the senior girls play flag football, and the senior boys dress up like cheerleaders.\\n\\n As soon as it came out that Reeve was coaching one team and Alex was coaching the other, Rennie volunteered to be captain on Reeve’s team. Ashlin’s the other captain and she won the coin toss, and I was praying that she would pick me, which she did. Obviously, I hate Alex, but Reeve is disgusting. I used to think his ego, his cockiness was a put on. No one could be that into himself. But now I know that it’s all true. I wonder if he’s thought about Mary once since that day. If he even realizes the hell he put her through. I doubt it. I doubt he’d even remember her name. Honestly, I think death would be going too easy on that monster.\\n\\n Across the field Reeve blows his whistle. I watch him throw his head back and scream, “Suicides! I want suicides, men!” He’s loving this. Obviously, their team is going to win, since Reeve is Mr. Football, and both he and Rennie are super-competitive.\\n\\n Alex doesn’t even have a whistle. Our team is basically just throwing footballs at each other, dropping them more often than we catch them. Ashlin yelps every time the ball comes near her face, and I can’t even get my whole hand around the thing. I don’t get why we can’t use a Nerf. People could get hurt.\\n\\n “Girls!” Alex says, clapping his hands. “Run a few laps to get warmed up, okay? Then we’ll practice some plays.”\\n\\n Some of the girls obey, but I ignore him and toss the ball to Ashlin again. It lands nowhere near her, and she goes running for it. “Sorry!” I call out.\\n\\n I feel a tap on my shoulder. I turn around. It’s Alex. “Cho. I need to talk to you for a second.”\\n\\n I can barely stand to look at him. Yesterday I saw him and Nadia talking in the courtyard. And I felt pretty stupid about the fact that I almost bailed on the Limp jersey plan. If anything, I wish we’d done more to Alex. But it’s not my turn anymore. “Um, I’m trying to practice,” I say.\\n\\n “Now!” he barks, and stalks over to the bleachers.\\n\\n I make a face at Ashlin, and she shrugs and jogs after the other girls on the track.\\n\\n I follow Alex over to the bleachers and cross my arms. “Yes, Coach?” I say it as bitchy as I possibly can.\\n\\n In a low, urgent voice he asks, “What is your problem with me?”\\n\\n I stare at him. I just thought he was going to yell at me for not doing laps. “I don’t have a problem with you, Coach,” I say, but I’m glad he knows I’m angry. “Can I go now?”\\n\\n “Stop calling me Coach! I thought we were friends, but lately you’re acting like you hate me. I don’t get it.”\\n\\n Is Alex honestly this dumb? I probably shouldn’t say anything, but I can’t help myself. I look around to make sure no one’s in earshot, and then I say, “You want to be my friend? I’ll tell you how. Don’t call my sister. In fact, don’t talk to her ever again.” Alex opens his mouth like he’s going to defend himself, but I keep going. “Don’t come to our house in the middle of the night and get her to sneak out, don’t give her alcohol at parties, don’t—”\\n\\n “You’ve got it all wrong! I didn’t give her any alcohol.”\\n\\n “Hello! I found her shirt. And I know that she slept over your house that night. She’s fourteen, you pervert!”\\n\\n Alex’s jaw goes slack in disbelief. Then he rears up and says, “Pervert? You need to get your facts straight. First of all, I never gave her any drinks. She was sneaking rum with her friends, and by the time I caught them, she was already drunk off her ass. While you were at some other party, I was cleaning up her throw-up and making sure she didn’t leave and get caught by your parents!” His Adam’s apple is bobbing up and down, and his fists are clenched. “Her friends left her, so she had to spend the night. I stayed up the whole time to make sure she didn’t drown in her own vomit. So, you’re welcome.”\\n\\n I cross my arms. “If that’s true, why were you sneaking off with her in the middle of the night on the first day of school? Don’t bother trying to deny it. I saw you drop her off.”\\n\\n “Because she called me crying! She wanted to make sure you never found out she was drunk that night. She made me promise not to tell you. That’s how much she cares what you think of her.” He lets out an impatient breath of air, shaking his head. “I told her that you had every right to be upset. And that I was going to be watching her too. And that if she ever had a drink in front of me, I was going to make sure you knew about it.”\\n\\n I don’t say anything. I just look back over at the field where all the girls are running laps. I’m shivering now.\\n\\n “I can’t believe you would ever think that of me, Lillia. You and I have been friends since the ninth grade! Our families are friends! Nadia’s practically my kid sister. I would never think of her like that!” He pushes his hair out of his eyes. Now that the sun isn’t as strong as it was in summer, his hair is looking less blond and more coppery. And longer. “That’s, like, sick.”\\n\\n “I’m sorry.” I don’t know what else to say.\\n\\n “Don’t worry about it.” I feel this sudden urge to confess everything to him. To really apologize, the way he deserves. But I can’t. Because it’s not just me. It’s Kat and Mary. I had them put themselves on the line for nothing.\\n\\n I’m shaking, because I’m cold and because I’m sick over what I’ve done.\\n\\n Alex takes a step toward me. He unzips his windbreaker, shrugs out of it, and drapes it over my shoulders. It has a clean laundry smell. \\n\\n","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-47.html","bookId":2726,"book":{"id":2726,"title":"Burn for Burn (Burn for Burn #1)","description":"Storyline: Postcard-perfect Jar Island is home to charming tourist shops, pristine beaches, amazing oceanfront homes—and three girls secretly plotting revenge. \\n KAT is sick and tired of being bullied by her former best friend. \\n LILLIA has always looked out for her little sister, so when she discovers that one of her guy friends has been secretly hooking up with her, she’s going to put a stop to it. \\n MARY is perpetually haunted by a traumatic event from years past, and the boy who’s responsible has yet to get what’s coming to him. \\n None of the girls can act on their revenge fantasies alone without being suspected. But together…anything is possible. \\n With an alliance in place, there will be no more “I wish I’d said…” or “If I could go back and do things differently...” These girls will show Jar Island that revenge is a dish best enjoyed together.\\n","cover":"https://allnovel.net/images/burn-for-burn-burn-for-burn-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/burn-for-burn-burn-for-burn-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:15:45 PM"}}
