{"id":79536,"no":8,"title":"Page 8","content":"When we were young, he was a good-looking kid. But now . . . he’s beautiful. He’s so beautiful. My legs start to quiver. I can’t do this. I want to run away, to hide, but I can’t move. I just stand there, rooted to the spot. The two of them walk in my direction, Reeve’s arm slung around Rennie’s shoulder. I hold my breath and wait for a flash of recognition, something, anything, as Reeve gets closer. But there’s nothing. He walks right past me, so close we nearly touch. He doesn’t notice me. I spin around and stare at his back. Did he not see me? Or could it be that he was too distracted by Rennie hanging all over him. Or maybe he did see me but I’ve changed so much, and that’s why he didn’t recognize me. I’m probably the last person he’d expect to see again. Dazed, I follow them inside the building. Reeve and Rennie disappear down a hallway together, swallowed up by a crowd of other students. I don’t know where to go. I wander around and end up ducking into the girls’ room as someone exits. I slip into the dwindling space of the closing door. My stomach seizes up. I hurry to the last stall and collapse at the bowl, the ends of my hair skimming the water. I take a couple of deep breaths. In and out. Maybe it wasn’t any of those things. Maybe I wasn’t worth remembering. CHAPTER FOUR LILLIA WE’RE SITTING AT OUR NEW LUNCH TABLE WITH THE regulars—me and Rennie, Ashlin, Alex, Reeve, PJ, Derek, plus a couple other guys from the football team. We inherited this table from last year’s seniors. It’s a tradition. Star table, center of the so-called action. The last day of school junior year, the coolest seniors call the coolest juniors over and invite you to have lunch with them. It’s like the passing of the popularity torch. Too bad it’s just the same as any other gross table in this cafeteria. Ashlin is being annoying, going on and on about the sauna her parents had installed. I finally say, “Ashlin, nobody cares,” and her mouth snaps shut, her brown eyes hurt. I feel kind of bad, so I add, “Just kidding.” Rennie snags a powdered sugar doughnut off my tray and pops it into her mouth. “I thought you weren’t eating carbs during cheer season,” I say, and I pull my lunch tray closer. I only have three left. Rennie makes a face at me. “I deserve some comfort after this morning. I should probably get an AIDS test or something. Who knows what kind of germs that skank is harboring.” She gags, and her tongue is white from powdered sugar. I can’t believe Kat DeBrassio spit in Rennie’s face. I mean, that was totally gross. But it’s not like Rennie didn’t have it coming. I just can’t believe someone called her out on it. Reeve pulls his chair up closer to us. I scoot away a little. He must have used half a bottle of cologne this morning. It’s giving me a headache. He drawls, “Rennie, honey?” “Yes, Reevie baby?” Rennie flips her hair around. “You know you’re my wifey, right?” Eww. “Of course.” “And a wifey has to make sure her man is taken care of,” he continues. I make a Gag me face at Ashlin, who giggles. Reeve sees me do it, and he waves his hand at me dismissively before turning back to Rennie. “Anyway . . . will you please make sure that I get a cheerleader who knows what she’s doing this year? I’m serious. I can’t have a girl up there representing number sixty-three if she’s just a pretty face. Whoever gets the job, she’s gonna have a lot of airtime, and she’s got to have the entire package.” “What’s the entire package?” Rennie purrs. Reeve ticks off his fingers. “Rhythm, good hand-eye coordination, flexible enough to do some of the more complicated moves. No cartwheel bullshit. I want back handsprings, pop and lock. Good variety. You know what I’m saying.” “I know exactly what you’re saying, Reevie,” Rennie says, her eyes bright. “Consider it taken care of.” Reeve reaches across the table and pinches her cheek. Rennie slaps his hand away, laughing. “What about you, Alex? Who do you want?” “I don’t care,” he says, and he goes back to talking to Derek. Rennie mouths to me, What’s his problem? I shrug back. PMS, she mouths. She leans forward and takes another doughnut off my tray. “What do you think about me giving Alex to Nadia? . . . I mean, it’s definitely true that if she nabbed a senior player, she’d be hot shit with her little freshman piggies.” I snatch the doughnut right back. “Yeah, whatever.” I still feel bad about what I said to Nadia this morning. Maybe this will make her feel better. “So you’re cool with that?” “Why wouldn’t I be?” I know what she’s getting at, but I refuse to play along. Like I’ve told her a thousand times, I don’t see him that way. “O-kay.” I get up from the table and walk over to the soda machine before she can say anything else. I’m trying to decide between grape soda and Coke when Alex comes up behind me. “Hey, Lindy,” I say, pressing Coke. It occurs to me that Rennie is probably leaning on Alex just as hard as she’s been leaning on me. I bet she’s telling him the same lies too. That I’ve been dreaming of him. That we’re supposed to be together. Flatly, he says, “That’s all you have to say to me? ‘Hey, Lindy?’ Have you not noticed that I’ve been giving you the cold shoulder since Saturday?” I stare at him, my mouth an O. What’s the matter with him? “I can’t believe you, Lillia,” he says, seething. “You and Rennie ambush my house for a freaking party and you make a huge mess with glitter everywhere, and then you dip out after half an hour to go to another party! What the hell!” I’ve never seen Alex like this before, so pissed. But he’s right to be upset. We never should have left like that. “I’m sorry,” I whisper. He has no idea how sorry I really and truly am. He shakes his head at me and turns to go, but I reach out and grab his shirtsleeve. Tugging on it, I say, “Don’t be mad.” He’s glaring at me, but he doesn’t shrug me off. “When are you going to come and get your decorations and crap?” Quickly I say, “Rennie and I will come over after cheerleading tryouts today and pick everything up.” Alex doesn’t say anything. He just walks away. Not back to the table but straight out of the cafeteria.","sourceLink":"https://allnovel.net/burn-for-burn-burn-for-burn-1/page-8.html","bookId":2726,"book":{"id":2726,"title":"Burn for Burn (Burn for Burn #1)","description":"Storyline: Postcard-perfect Jar Island is home to charming tourist shops, pristine beaches, amazing oceanfront homes—and three girls secretly plotting revenge. KAT is sick and tired of being bullied by her former best friend. LILLIA has always looked out for her little sister, so when she discovers that one of her guy friends has been secretly hooking up with her, she’s going to put a stop to it. MARY is perpetually haunted by a traumatic event from years past, and the boy who’s responsible has yet to get what’s coming to him. None of the girls can act on their revenge fantasies alone without being suspected. But together…anything is possible. With an alliance in place, there will be no more “I wish I’d said…” or “If I could go back and do things differently...” These girls will show Jar Island that revenge is a dish best enjoyed together.","cover":"https://allnovel.net/images/burn-for-burn-burn-for-burn-1.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/burn-for-burn-burn-for-burn-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:15:45 PM"}}
