{"id":97246,"no":12,"title":"Page 12","content":"A red status light winked from Olivia. The team froze.\n Five meters ahead, a fern bent and sprang back.\n Ash rapidly blinked his green status light: the signal to open fire. This was the best target they\u0027d had all morning.\n Suppressed gunfire surrounded him. The fern exploded into a shower of confetti.\n A single Spartan hidden by the fern turned, their SPI armor flashing silver from the staccato of stun rounds that peppered its surface. Their foot caught on a root and they tumbled.\n Ash repeated the go-ahead signal, and his squad made sure the target stayed down with several bursts of well-placed rounds. The ballistic gel underlayer of their armor could take a heck of a pounding before breaking down.\n After three seconds, he flashed red, and they ceased fire.\n Olivia moved up and slapped a lime-green sticky flag on the still-writhing Spartan\u0027s back.\n The target was now officially \"dead.\"\n Ash activated a NAV marker and alerted C and C for pickup of the \"corpse.\"\n The ground trembled, just for a moment, but all the Spartans in Team Saber froze, and then scanned the jungle, looking for the source of the disturbance.\n Earthquake? Not likely. There was no tectonic activity on Onyx. That left only two possibilities: impact or detonation. Neither was especially welcome.\n Ash motioned for Saber to move out. They slinked through the jungle and emerged on a plain. Here small limestone granite and quartz mesas, grottos, and fissures extended to the north— up to and beyond the high fence of Zone 67.\n The Zone was where the \"ghost\" of Onyx was supposed to be. It\u0027d been spotted once or twice according to other Spartan candidates: a single eye in the dark. They just made up that stuff to scare plebes. Ash had, however, heard of a Beta Company squad that had vanished near here and never been found.\n He looked around warily and spotted a naturally eroded tunnel that extended through a hill. Ash pointed and Team Saber settled inside to assess the tactical situation.\n Ash pulled off his helmet, and wiped the blood from his nose and hair. \"Too close,\" he said.\n \"Still, we got one,\" Holly said, pulling off her own golden mirrored helmet, \"and we didn\u0027t lose one of ours… although you sure gave it a good try.\" She scratched the fuzz on her head, which she had buzz-cut into a series of bear-claw scratch patterns. The length was a-okay by the regs, but some of the other teams teased her about it. Holly got a little wild about the teasing, and she had been demoted twice for fighting.\n Dante removed his helmet and felt his scarred face for any damage. Satisfied, he retrieved two black flash-bang grenades from his pack. \"Found these, just before yours went off. Caught the trip wires.\"\n Ash nodded. He should have reprimanded Dante for sticking his hands near a set of primed grenades. Then again, Dante had near-magical abilities when it came to explosives. He always knew when they were about to go, and when they wouldn\u0027t. That or he was the luckiest person he\u0027d ever seen.\n Olivia kept her SPI helmet on. She slipped out of the cave, taking up a guard position outside. Ash wasn\u0027t worried. She was the best sneak in Gamma Company. They called her \"O\" for short because she was as whisper-quiet as her vowel namesake.\n Ash turned to Mark. \"Head check,\" he said, and patted his friend on the back of his helmet.\n Mark pulled the helmet off, and Ash saw a nasty bruise on his cheek. Mark ran his hands over his shaved head and worried the edges of that bruise.\n \"I\u0027m fine,\" Mark said. He smoothed the inner lining of his armor, making sure it was perfect, and then slipped the helmet back on.\n They called Mark \"The Mark,\" because he was their best marksman—good with a sniper rifle, but better with a rifle on full auto in all-out target-rich free-for-all. The more pressure on him, the cooler he got.\n Ash spotted bands of rough onyx along the tunnel wall, black and white and streaked with flecks of gold. He ran a gloved finger over the patterns, intrigued by the geological oddity.\n He then snapped out of it and focused on the here and now. He slipped his helmet back on.\n \"Audio check,\" Ash whispered over TEAMCOM.\n Green status lights winked back. Good. No one was deaf.\n A dull thump echoed off the distant mesa walls, and dust rained down from the cave ceiling.\n Team Saber instinctively dropped to a crouch. Ash pulled his sidearm.\n \"Big one,\" Dante muttered. \"Artillery? One of the new four-forties?\"\n \"I don\u0027t think the Lieutenant Commander would use artillery on us,\" Ash whispered.\n \"Not normally,\" Holly replied. \"But this is the last test. Maybe he\u0027s pulling out all the stops to figure out who\u0027ll get top honors.\"\n Top honors. Ash had pushed Team Saber to stay on top for the last three years: honing their specialties; learning every lesson Endless Summer threw at them; and thinking, moving, and acting together as a single razor-edged weapon. Only two other teams were even close in the rankings. Gladius and Katana. Top honors would mean bragging rights and respect. It would mean they were the best. That they\u0027d won.\n Over TEAMCOM, Ash said, \"O, you get a direction on that blast?\"\n Olivia\u0027s status light winked red.\n \"Okay,\" Ash said, \"we\u0027ll assume it\u0027s artillery for now. I can\u0027t believe the Lieutenant Commander would be using it… but Mendez is another story. You hear incoming, scatter, and take cover.\"\n Four green LEDs lit on his heads-up display, acknowledging the order.\n Ash had read somewhere that you never heard the artillery shell that killed you. He had no desire to personally test that battlefield legend.\n \"What\u0027s the plan for Katana and Gladius?\" Mark asked.\n \"Katana\u0027s down one,\" Ash replied. \"We\u0027ll focus on the weaker of the two. We\u0027ll find—\"\n Another thump and the ground shuddered.\n \"Closer,\" Olivia whispered over TEAMCOM. \"Vector north.\"\n Ash stepped out of the tunnel and took cover by a large boulder. The others followed and their SPI armor blended into the rocky terrain.\n If this was another trap, then they were probably stepping out right into a sniper\u0027s line of fire. But Ash didn\u0027t think so. No one would use ordnance that big so close, not even Mendez.\n An explosion like that wasn\u0027t something you could throw together from rocks and branches and a couple of flash-bang grenades, either… so that eliminated Teams Katana and Gladius.\n So who was doing it?\n Forty meters to the north v/as the triple fence surrounding Zone 67. Electrified razor wire, motion sensors, and lanes of minefields made an effective barrier. If pressed, Team Saber could have gotten around it—but they wouldn\u0027t. The LC\u0027s orders had been crystal clear: DO NOT CROSS. It would count as an instant disqualification for top honors.\n What about the other teams? Just a quick hop over and lateral move to flank him? No.\n None of them would risk a disqualification.\n There was a dust storm about three kilometers into Zone 67, a wall of sand, swirling smoke… and fire.\n A distant mesa exploded—vaporized into a mushroom of glittering quartz dust, a hail of boulders, and roiling flame.\n Ash instinctively ducked, and his insides clenched.\n He\u0027d seen big explosions before. Nothing like that, though.\n \"Two kilometers,\" Dante said. \"Felt that one in my bones.\"\n They watched the stones rain from the sky.\n \"A few Archer missiles maybe…\" Mark murmured.\n Dots swirled about the edge of the expanding cloud of dust. If Ash didn\u0027t know better he\u0027d have sworn they were vultures. But Onyx didn\u0027t have raptorlike avian species.\n Ash zoomed magnification on his faceplate. At five-times he saw the dots had a three- fold symmetry.\n He unslung his sniper rifle and sited through the scope.\n They were drones of some sort. But not UNSC MAKOS. Not Covenant Banshees fliers, either. They were a few meters long.\n Three dull steel booms that surrounded a centra! eye, glowing like molten iron. No obvious jets. No cockpit. There were a dozen of them.\n \"Has to be an experimental prototype,\" Dante said. Maybe Zone 67 is a testing range for new weapons.\"\n \"They wouldn\u0027t be \u0027testing\u0027 a megaton worth of destructive force while we were so close,\"\n Ash countered.\n Or was this part of the final test? Some new threat that the three squads would have to band together to defeat? That would be Chief Mendez\u0027s style: change the rules in the middle of a test.\n The drones moved away from the atomized mesa, drifted closer to Team Saber\u0027s location, stopping short just on the opposite side of the Zone 67 fence, where they circled another butte.\n Ash spied motion atop that formation. Shutters from a a camouflaged bunker popped open, and heavy machine-gun fire strafed the drones.\n The lead drone\u0027s three booms snapped forward to make a triangular flat plane. A glimmering film of gold popped into place and fifty-caliber rounds impacted and bounced off.\n \"Energy shields!\" Dante said. \"Has to be Covenant.\"\n Ash reluctantly agreed with this assessment. This was no game, no final honors test.\n The war had arrived on Onyx.\n He broadcast over an open COM channel: \"Currahee C and C, come in. This is Saber One. We have an emergency.\"\n No answer. His radio light was green. He was broadcasting, but no one was listening.\n \"Radio check,\" Ash said to his team. \"Everyone try to get the Lieutenant Commander or the Chief. Try to raise the Agincourt, too.\"\n Ash used his sniper rifle and tracked the drones.\n The remaining eleven lined up behind the one distorted to form an energy shield; their red eyes aligned and pointed directly at the mesa top.\n Men emerged from the bunker with M19 missile launchers.\n The drones\u0027 eyes flared to a brilliant gold—energy projected forward, flicking like a rapier strike.\n The men and bunker wavered a moment, erupted into flames, and vaporized. The mesa top then detonated into a cloud of dust and molten rock.\n The ground tilted and cracked. Team Saber retreated into the tunnel and debris rained over them.\n Ash squinted back through the haze.\n The drones had scattered and moved forward, zigzagging over the rocky terrain: a search pattern.\n He moved to the opposite end of the tunnel and risked another open COM broadcast.\n \"Team Katana, Team Gladius, Covenant activity in Zone 67. Forget the test, guys. We\u0027ve got a situation.\"\n CHAPTER THIRTEEN\n 0700 HOURS, OCTOBER 31, 2552 (MILITARY CALENDAR) \\ ZETA DORADUS SYSTEM, NEAR CAMP CURRAHEE, PLANET ONYX\n Kurt scanned the horizon with his binoculars. He watched the pattern of the wind in the tree line, the birds that had taken wing, and a whisper of smoke that snaked up from the canopy.\n There was trouble in the air.\n From his perch in the \"tree house\" he couldn\u0027t see the source of the disturbance near the Spartan test area.\n The tree house was a platform a hundred meters off the jungle floor in the titan arms of a banyan tree. The only electronics here were the radio and the AI projection unit. Everything else was low-tech: optic binoculars and telescopes, parabolic sound collection dishes, good old-fashioned signal flags.\n \"What\u0027s the Agincourt got?\" he asked Mendez.\n Chief Mendez turned to Kurt, pressing the bud receiver into his ear. \"A lot of static.\n Encountering broadband interference. They\u0027re moving to high orbit to get a clear picture.\"\n The Agincourt had just delivered supplies for the incoming Delta Company. Kurt had asked for a little observational assistance before they broke orbit.\n \"Pass my thanks to the Commander,\" Kurt said.\n Chief Mendez\u0027s face darkened. \"They\u0027re breaking up.\"\n The dish-sized AI projector sparked to life, and warm red sunlight sparked and filled the tree house. It solidified into a tall Cherokee brave, bare-chested, wearing buckskins, feathered spear in his massive hand. This was Endless Summer, the ONI AI stationed at the ultrahigh-secure facility thirty kilometers to the north, a place that technically no longer existed, it was so secret.\n The AI gestured for Kurt and then he vanished, replaced by the lightning-bolt symbol for a UNSC priority flash communique.\n The AI that had replaced Deep Winter was aloof, had barely tolerated Kurt and his staff, and it never initiated communication. This was trouble.\n Kurt stepped closer and the pad scanned his biometrics. Several files were beamed directly onto his retina, a top-secret protocol that gave a new twist to the phase \"eyes-only\"\n security.\n He read:\n UNITED NATIONS SPACE COMMAND PRIORITY TRANSMISSION FLASH 91762P-06\n ENCRYPTION\n CODE\n : BLACK\n PUBLIC\n KEY:\n FILE/SEASONAL/\n FROM: CODE NAME ENDLESS SUMMER\n TO: / LIEUTENANT KURT AMBROSE, SPECIAL ATTACHE. LOGISTICAL OPERATIONS\n COMMAND (NAVLOGCOM) , OFFICE OF INVESTIGATIONS UNSCMID: 045888947\n SUBJECT: EMERGENCY\n ALERT\n STATUS\n CLASSIFICATION: RESTRICTED (XXX-XD DIRECTIVE)\n /START FILE/DECRYPTION PROTOCOL/\n FLASH TRANSMISSION TO CAMP CURRAHEE COMMAND AND CONTROL\n ENDLESS SUMMER DIRECTED TO LIEUTENANT COMMANDER AMBROSE-EYES\n ONLY\n ZONE 67 UNDER ATTACK.\n PER GENERAL ORDER 98.93.120, I AM AUTHORIZED TO TAKE COMMAND OF ALL MILITARY\n PERSONNEL ON ONYX UNDER EMERGENCY CIRCUMSTANCE. I HEREBY EXERCISE THAT\n AUTHORITY AND ORDER ALL UNDER YOUR COMMAND TO IMMEDIATELY DEFEND ZONE 67 FROM\n EMINENT DANGER.\n ATTACKER IDENTITY: UNKNOWN. NONHUMAN ORIGIN.\n ATTENTION: POSSIBLE COVENANT VECTORS.\n ATTENTION: POSSIBLE NON-COVENANT VECTORS.\n YOU ARE AUTHORIZED WITH CODE-WORD CLEARANCE PATRIOT-SEVEN-BLUE TO\n REVIEW THEFOLLOWING CONDENSED MATERIAL OF IMMEDIATE BENEFIT. ANY BREACH OF\n CODE-WORD CLASSIFICATION CONFIDENTIALITY IS PUNISHABLE BYTHE DEATH PENALTY AS\n PER UNSC MIL-JAG 4 4 65/LHG, THE WARTIME ARTICLES OF SECRECY, AND THE\n AMENDED ARTICLES OF THE UNITED SECURITY ACTS OF 2162.\n /END/\n /ATTACHED FILE 1 OF 9/\n MAY\n 6, 24 91 (MILITARY CALENDAR)\n FIELD REPORT A76344-USNC . ENGCORP SUBJECT: SURVEY PLANET XF-0 63\n REPORTING OFFICER: CAPTAIN D. F. LAMBERT UNSC. ENGCORP/ UNSCMID:\n 03981762\n XF-0 63 IS A RARE JEWEL OF A FIND. THERE IS AN OXYGEN-NITROGEN-INERT GAS\n ATMOSPHERE OF SUITABLE PRESSURE AND A MODERATE WEATHER CYCLE. THERE IS A \n","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-12.html","bookId":1636,"book":{"id":1636,"title":"Halo: Ghosts of Onyx (Halo #4)","description":"Storyline: \n Halo: Ghosts of Onyx (Halo #4) \n Continuing the saga of the award-winning Xbox™ game! \n The Spartan-II program has gone public. Tales of super-soldiers fending off thousands of Covenant attacks have become the stuff of legend. \n But just how many Spartans are left? \n While the Master Chief defends a besieged Earth, and the myriad factions of the Covenant continue their crusade to eliminate humanity, an ultrasecret cell of the Office of Naval Intelligence known as \"Section Three\" devises a plan to buy the UNSC vital time. They\u0027re going to need hundreds of willing soldiers, though . . . and one more Spartan to get the job done. \n The planet Onyx is virtually abandoned and the perfect place to set this new plan in motion. But when the Master Chief destroys Halo, something is triggered deep within Onyx: Ancient Forerunner technology stirs, and fleets of UNSC and Covenant race to claim it to change the course of the Human-Covenant War. \n But this reawakened and ancient force may have plans of its own . . .\n \n","cover":"https://allnovel.net/images/halo-ghosts-of-onyx-halo-4.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-ghosts-of-onyx-halo-4.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:25:02 PM"}}
