{"id":97268,"no":35,"title":"Page 35","content":"He and Holly turned and sprinted toward the extraction point. Mark and Olivia were already on the platform, waving them to hurry.\n Ash felt the thunderous force through the floor that grew louder with every step until it shook his bones.\n He and Holly leapt onto the platform.\n \"Dr. Halsey, go,\" he screamed over an open COM channel.\n Nothing happened.\n Team Saber stood shoulder to shoulder and watched the tidal wave of metal smash over machinery and crush the Sentinels that struggled to escape its kilometer-high surge.\n But there was no escaping something Hke this.\n \"We got the mission done,\" Ash told his friends over TEAMCOM. \"We won.\"\n He still held Holly\u0027s hand. He gripped it tighter.\n The shadow of the wave covered them and plunged them into darkness.\n There was a flash of light.\n Nausea hit Ash in the gut like a lead glove wrapped around a brick.\n The blinding light faded.\n They were back on the ledge.\n Holly disentangled her hand from his and looked away. Mark steadied himself against the wall. Olivia stepped off the platform and hung her head between her legs.\n Dr. Halsey sat and stared at a tornado of Covenant symbols that rose from her laptop, her eyes darting back and forth trying to watch them all at the same time. She herded a collection of silver triangles together.\n \"My apologies for the delay,\" she said without glancing up. \"There are complications.\n Please, step off the platform. Tom and Lucy are next.\"\n The SPARTAN-II Blue Team was already back crouched along the shadow line by the ledge overlooking the factory.\n The air was full of Sentinels flying in formations. The pyramid was gone, and on the floor a million spheres bounced and surged forward, flattening machinery and sparking conduits.\n The fountain of fire that Blue Team had targeted oscillated wildly out of control, spaying molten alloy on the walls, ceiling, everywhere but the receiving vessel it was supposed to hit.\n Over the COM Tom\u0027s voice crackled: \"Ready for translocation. Dr. Halsey.\" Gunfire sounded in the background.\n Dr. Halsey exhaled a hiss of frustration and slashed her hand through the icons, and then started the process of gathering them again.\n \"What\u0027s the holdup?\" the Lieutenant Commander asked.\n \"Someone else is accessing this system,\" she replied. \"This accounts for Team Saber\u0027s delay… and now Tom and Lucy\u0027s.\"\n \"Someone else?\" he said. \"You mean the Covenant?\"\n \"Entirely probable,\" she replied.\n Fred turned around and whispered, \"That means they can I rack and follow us.\"\n Over the COM Tom yelled, \"Doctor, if you\u0027re going to do anything you have to do it—\"\n Rings of gold strobed on the platform and then vanished; Tom and Lucy stood there, hands raised in an instinctive effort to ward off danger. Wisps of plasma curled and dissipated around them.\n \"—Now,\" Tom finished. He exhaled a long sigh and then reported to the Lieutenant Commander, \"Mission accomplished, sir.\"\n In the distance small explosions popped, sounding like a string of firecrackers. The flying Sentinel formations scattered— some crashing into one another, others accelerating straight into the walls.\n Dr. Halsey consulted her watch. \"We have fifty-three minutes before the core-room entrance closes, Kurt.\"\n The Lieutenant Commander nodded. \"Everyone on the platform,\" he ordered. \"Doctor, move us to Team Katana\u0027s location.\"\n Unease already settling into his stomach, Ash crowded onto the four-meter pad with his teammates.\n Funny, but he hadn\u0027t thought of the older Spartans as part of the team until now. Or was he part of their team? He then noticed the blood oozing from his armor joints, mirrored red by the camouflaging panels. Baptized in battle. They\u0027d lost Dante, too. High prices to pay.\n Chief Mendez watched the self-destructing factory. \"That\u0027s a lot of Sentinels,\" he murmured. \"Wonder why they only deployed a fraction of them?\"\n \"Setting time delay for three seconds,\" Dr. Halsey said, shut her laptop, and then joined them.\n Mendez\u0027s remark bothered Ash more than he could explain, and the unease in his gut intensified. There were hundreds oi\u0027 thousands of Sentinels here. Why just have them sit around? They had to serve some purpose… Rings of light enveloped the squad.\n Ash hoped he never found out why. He just wanted to rescue Katana, get the technology Dr. Halsey had promised, and get out of here before the Covenant caught up with them.\n He had a feeling, though, it wasn\u0027t going to be that easy.\n CHAPTER THIRTY-FIVE\n 2105 HOURS, NOVEMBER 3, 2552 (MILITARY CALENDAR) \\ ZETA DORADUS SYSTEM, ORBIT NEAR THE MOON OF ONYX \\ ABOARD UNSC PROWLER DUSK\n Commander Richard Lash supervised the release of the mines.\n He and Lieutenant Commander Cho monitored the launch bay of the Dusk. The closet- sized chamber behind the tiny observation window had been chilled near absolute zero. The nukes inside had been cycled through three thermal cooldowns and were now the same temperature as interstellar space.\n The tiny HORNET warheads had been transferred aboard from the Brasidas, a destroyer with extensive damage. Thankfully Cho had detected the minuscule leak from their reactor and moved off before it irradiated the Dusk\u0027s hull. That would have lit them up against the background intrasolar radiation and fatally compromised their stealth ability.\n \"Let her fly,\" Lash ordered.\n \"Releasing,\" Cho whispered. He grasped the manual override claw, and with supreme concentration, he dropped the warhead.\n The bay door irised open and the black egg-shaped HORNET mine dropped from its carrier and, centimeter by centimeter, drifted into space.\n \"That was the last, sir.\" Cho wiped the beads of sweat that had collected on his wrinkled forehead.\n Cho was technically past the mandatory retirement age in the UNSC prowler corps. This was a fact that had been carefully ignored by Captain Iglesias. The UNSC was running out of qualified recruits, and Cho would have been impossible to replace.\n Lash gave him an approving nod, which was as much praise as the old engineer was ever comfortable with.\n \"Thank you, sir.\"\n Lash entered the tube to the bridge and pushed off, propelling himself in the null gee, somersaulting and then using his legs to brake. He took a moment to compose himself before he opened the hatch. In the last fifteen minutes the Dusk had seeded the space on the dark side of the moon of Onyx with fourteen nuclear mines—thirty-megaton yield with vacuum-enhanced loads.\n Delicate work to stay stealthed and get them all deployed on Admiral Patterson\u0027s timetable, but they\u0027d done it.\n All it had cost was the fraying of Lash\u0027s already shot nerves. He smoothed his uniform, brushed his thinning hair, took a deep breath, and then spun open the hatch.\n \"Report,\" he said to Lieutenant Commander Waters.\n Waters looked up with bloodshot eyes from his display. \"The Admiral has been informed mission accomplished, sir. He\u0027s moving the fleet to new coordinates, a high orbit on the bright side of the moon.\"\n Lash examined the system NAV map. Patterson was going to use the entire planetoid as cover. He\u0027d need it. The enemy forces still outnumbered them sixteen ships to their four. By any sane measure it would be suicide to attack that Covenant battle group.\n The line, however, between sane and not was becoming increasingly blurred in this system.\n Lash settled in the captain\u0027s chair. \"Lieutenant Yang? Status?\"\n \"As dark as midnight under a rock, sir.\"\n Lash nodded, pleased at Yang\u0027s hyperbole. A little humor was a good sign. \"Lieutenant Durruno, move us to lunar Lagrange-Four, one-quarter full. Tell Lieutenant Commander Cho to trickle-charge our Slipspace capacitors.\"\n \"Aye, sir.\" She tapped in the commands, cursed, and then backspaced and retyped them correctly.\n Durruno needed sleep. They all did. But he\u0027d keep her in play a little longer. There was no one to replace her, and this would be over, one way or the other, very soon.\n \"Covenant fleet on-screen,\" Lash ordered Waters. \"Rescan and give me a full spectral analysis.\"\n \"All sensors on target,\" Waters replied.\n Rainbows played over the central viewscreen, building composite images from radiation far-infrared to soft gamma, and fourteen Covenant ships resolved, clustered together in a spherical formation three hundred thousand kilometers distant.\n To Lash they looked like hungry sharks, ready to pounce on a few sardines.\n Their spectral analysis, however, painted a different picture. Thermal blooms and radiation leaks spewed in helical showers from the vessels. They\u0027d been damaged by Admiral Patterson\u0027s alpha strike and the captured plasma redirected by the alien drones.\n The enemy was sitting there, making repairs, in all likelihood frothing from their split mouths to get back in the fight and go another round with the UNSC battle group.\n Patterson, however, had another plan: hit them first. Hard.\n \"Activity from Onyx on the E-Band?\" Lash asked Yang.\n \"No, sir. Not a flicker since that ONI AI took care of the alien drones.\"\n Lash wondered how the AI and Spartans on the planet had neutralized the alien fleet. Had they recovered some new super-weapon? However they did it, he promised he\u0027d personally shake every one of their hands.\n \"Continue to monitor all UNSC bands,\" he told Yang. \"Those Spartans might need a lift.\"\n \"Action on-screen,\" Waters announced. The camera snapped aft and centered on the silver moon.\n In the twilight regions on either side of the moon, magnetic accelerator cannons flared, briefly illuminating the now-split UNSC battle group in high orbit. Slugs of steel and tungsten rocketed into space, curving slightly from the gravitational distortion—streaking toward the Covenant ships.\n The Covenant ships broke formation.\n One MAC slug cleanly missed.\n Three hit.\n The targeted ships lit as their shields absorbed the massive kinetic energy. They careened backward… slowed, and stopped, undamaged from the single MAC strikes.\n Covenant ships turned and accelerated toward the moon.\n The MAC salvo had done precisely what Admiral Patterson had hoped: tweaked their collective noses, and gotten them good and mad.\n The UNSC battle group maneuvered behind the moon, denying the enemy a clean line of fire.\n \"Set EMP dampers,\" Lash said, trying to control his rising adrenaline. \"Shut down primary and secondary computers.\"\n \"Aye, sir,\" Durruno and Yang said together. They scrambled to isolate the Dusk\u0027s delicate electronics from the impending nuclear blasts.\n The Covenant battle group divided—each half moving to opposite sides of the moon, taking flanking positions where they could blast the hiding human ships into oblivion with their plasma.\n What they couldn\u0027t see on their approach vector, however, was Admiral Patterson\u0027s fleet backing directly away from the moon.\n \"Enemy vessels approaching distal radius of alpha and beta minefields,\" Durruno reported.\n \"Arm alpha and beta fields,\" Lash whispered.\n Yang fidgeted and said, \"Command sent, sir… and confirmation received across the board.\"\n That Covenant fleet was about to find out why UNSC battle groups always had a prowler assigned to their ranks. They were the sneak thieves and spies of the UNSC fleet, capable of behind-enemy-lines recon, rescue missions… and under the right conditions, the pinpoint placement of a nuclear minefield.\n \"Proximal enemy group now in the center of alpha field,\" Durruno announced. Her hands shook. \"Distal group crossing the terminal line of beta field.\"\n \"Remove safety interlocks,\" Lash said.\n Yang nodded and typed in the code words that made the sixteen nukes hot.\n The red \"inferno\" button on Lash\u0027s command console lit. He set his thumb next to it, and it beeped, verifying his biometric signature. He then flipped up the clear protective cover, inserted the master key in the adjacent slot, and turned it.\n \"Proximal group approaching terminal plane,\" Durruno said. \"Beta group of ships now centered in distal field.\"\n \"Here goes nothing,\" Lash whispered. \"Here\u0027s goes everything.\"\n He pressed the button, and it made a satisfying dick.\n On either side of the moon, seven tiny suns flashed into existence, ballooned, and enveloped the Covenant battle groups.\n The collective nuclear fireballs cooled to yellow and then dull red. Even with vacuum- enhanced loads, nuclear warheads in space did not persist a fraction as long as aerial or ground bursts.\n The destructive clouds thinned to translucency and a glittering haze of cooling metal formed an expanding halo around the planetoid.\n Inside this silver confetti, however, larger shimmering patches resolved: the energy shields of four surviving Covenant destroyers.\n Admiral Patterson moved his fleet toward the moon and opened fire. MAC rounds tore through space and behind them Archer missiles traced lacy paths of exhaust through the vacuum.\n Two Covenant ships sluggishly changed course and intercepted the MAC slugs. Their distressed shields shattered and their hulls cratered inward. Fire fountained as their plasma lines vented. Flocks of Archer missiles dove into the injured ships and explosions punctuated armor and propulsion grids.\n The crippled ships turned toward the moon, and in slow motion tumbled toward their surface.\n The UNSC battle group continued their charge. Four warships against the last two wounded Covenant destroyers… not entirely impossible odds.\n Lash imagined that a hundred years in the future historians might look back at this moment and declare it the turning point of humanity\u0027s struggle. That they had fought and defeated the Covenant at Onyx, won the prize of alien technology, and gone on—not only to survive, but to win their long struggle.\n He had secretly believed that they could not win this war for so long. Lash barely recognized the emotion that coursed though him now: hope.\n \"Covenant ships on new heading,\" Lieutenant Durruno said. She chewed on her lower lip and a tiny drop of blood appeared. \"Intercept course, sir.\"\n On-screen the last two enemy destroyers accelerated toward the moon. An extrapolated trajectory appeared: a slingshot orbit that would bring them around and back, and straight toward the Dusk. \n","sourceLink":"https://allnovel.net/halo-ghosts-of-onyx-halo-4/page-35.html","bookId":1636,"book":{"id":1636,"title":"Halo: Ghosts of Onyx (Halo #4)","description":"Storyline: \n Halo: Ghosts of Onyx (Halo #4) \n Continuing the saga of the award-winning Xbox™ game! \n The Spartan-II program has gone public. Tales of super-soldiers fending off thousands of Covenant attacks have become the stuff of legend. \n But just how many Spartans are left? \n While the Master Chief defends a besieged Earth, and the myriad factions of the Covenant continue their crusade to eliminate humanity, an ultrasecret cell of the Office of Naval Intelligence known as \"Section Three\" devises a plan to buy the UNSC vital time. They\u0027re going to need hundreds of willing soldiers, though . . . and one more Spartan to get the job done. \n The planet Onyx is virtually abandoned and the perfect place to set this new plan in motion. But when the Master Chief destroys Halo, something is triggered deep within Onyx: Ancient Forerunner technology stirs, and fleets of UNSC and Covenant race to claim it to change the course of the Human-Covenant War. \n But this reawakened and ancient force may have plans of its own . . .\n \n","cover":"https://allnovel.net/images/halo-ghosts-of-onyx-halo-4.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-ghosts-of-onyx-halo-4.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:25:02 PM"}}
