{"id":9004,"no":43,"title":"CHAPTER II","content":"CORTéS RECONNOITRES THE CAPITAL—OCCUPIES TACUBA—SKIRMISHES WITH THE ENEMY—EXPEDITION OF SANDOVAL—ARRIVAL OF REINFORCEMENTS 1521 IN the course of three or four days, the Spanish general furnished the Tlascalans with the opportunity so much coveted, and allowed their boiling spirits to effervesce in active operations. He had for some time meditated an expedition to reconnoitre the capital and its environs, and to chastise, on the way, certain places which had sent him insulting messages of defiance and which were particularly active in their hostilities. He disclosed his design to a few only of his principal officers, from his distrust of the Tezcucans, whom he suspected to be in correspondence with the enemy. Early in the spring, he left Tezcuco, at the head of three hundred and fifty Spaniards and the whole strength of his allies. He took with him Alvarado and Olid, and intrusted the charge of the garrison to Sandoval. Cortés had had practical acquaintance with the incompetence of the first of these cavaliers for so delicate a post, during his short but disastrous rule in Mexico. {305} But all his precautions had not availed to shroud his designs from the vigilant foe, whose eye was on all his movements; who seemed even to divine his thoughts and to be prepared to thwart their execution. He had advanced but a few leagues, when he was met by a considerable body of Mexicans, drawn up to dispute his progress. A sharp skirmish took place, in which the enemy were driven from the ground, and the way was left open to the Christians. They held a circuitous route to the north, and their first point of attack was the insular town of Xaltocan, situated on the northern extremity of the lake of that name, now called San Christóbal. The town was entirely surrounded by water, and communicated with the main land by means of causeways, in the same manner as the Mexican capital. Cortés, riding at the head of his cavalry, advanced along the dike till he was brought to a stand by finding a wide opening in it, through which the waters poured, so as to be altogether impracticable, not only for horse, but for infantry. The lake was covered with canoes filled with Aztec warriors, who, anticipating the movement of the Spaniards, had come to the aid of the city. They now began a furious discharge of stones and arrows on the assailants, while they were themselves tolerably well protected from the musketry of their enemy by the light bulwarks with which, for that purpose, they had fortified their canoes. The severe volleys of the Mexicans did some injury to the Spaniards and their allies, and began to throw them into disorder, crowded as they were on the narrow causeway, without the means of{306} advancing, when Cortés ordered a retreat. This was followed by renewed tempests of missiles, accompanied by taunts and fierce yells of defiance. The battle-cry of the Aztec, like the war-whoop of the North American Indian, was an appalling note, according to the Conqueror’s own acknowledgment, in the ears of the Spaniards.[343] At this juncture, the general fortunately obtained information from a deserter, one of the Mexican allies, of a ford, by which the army might traverse the shallow lake and penetrate into the place. He instantly despatched the greater part of the infantry on the service, posting himself with the remainder and with the horse at the entrance of the passage, to cover the attack and prevent any interruption in the rear. The soldiers, under the direction of the Indian guide, forded the lake without much difficulty, though in some places the water came above their girdles. During the passage, they were annoyed by the enemy’s missiles; but when they had gained the dry level they took ample revenge, and speedily put all who resisted to the sword. The greater part, together with the townsmen, made their escape in the boats. The place was now abandoned to pillage. The troops found in it many women, who had been left to their fate; and these, together with a considerable quantity of cotton stuffs, gold, and articles of food, fell into the hands of the victors, who, setting fire to{307} the deserted city, returned in triumph to their comrades.[344] Continuing his circuitous route, Cortés presented himself successively before three other places, each of which had been deserted by the inhabitants in anticipation of his arrival.[345] The principal of these, Azcapozalco, had once been the capital of an independent state. It was now the great slave-market of the Aztecs, where their unfortunate captives were brought and disposed of at public sale. It was also the quarter occupied by the jewellers, and the place whence the Spaniards obtained the goldsmiths who melted down the rich treasures received from Montezuma. But they found there only a small supply of the precious metals, or, indeed, of anything else of value, as the people had been careful to remove their effects. They spared the buildings, however, in consideration of their having met with no resistance. During the nights, the troops bivouacked in the open fields, maintaining the strictest watch, for the country was all in arms, and beacons were{308} flaming on every hill-top, while dark masses of the enemy were occasionally descried in the distance. The Spaniards were now traversing the most opulent region of Anahuac. Cities and villages were scattered over hill and valley, with cultivated environs blooming around them, all giving token of a dense and industrious population. In the centre of this brilliant circumference stood the Indian metropolis, with its gorgeous tiara of pyramids and temples, attracting the eye of the soldier from every other object, as he wound round the borders of the lake. Every inch of ground which the army trod was familiar to them,—familiar as the scenes of childhood, though with very different associations, for it had been written on their memories in characters of blood. On the right rose the hill of Montezuma,[346] crowned by the teocalli under the roof of which the shattered relics of the army had been gathered on the day following the flight from the capital. In front lay the city of Tacuba, through whose inhospitable streets they had hurried in fear and consternation; and away to the east of it stretched the melancholy causeway. It was the general’s purpose to march at once on Tacuba and establish his quarters in that ancient capital for the present. He found a strong force encamped under its walls, prepared to dispute his entrance. Without waiting for their advance, he rode at full gallop against them with his little body of horse. The arquebuses and{309} cross-bows opened a lively volley on their extended wings, and the infantry, armed with their swords and copper-headed lances and supported by the Indian battalions, followed up the attack of the horse with an alacrity which soon put the enemy to flight. The Spaniards usually opened the combat with a charge of cavalry. But, had the science of the Aztecs been equal to their courage, they might with their long spears have turned the scale of battle, sometimes at least, in their own favor; for it was with the same formidable weapon that the Swiss mountaineers, but a few years before this period of our history, broke and completely foiled the famous ordonnance of Charles the Bold, the best-appointed cavalry of their day. But the barbarians were ignorant of the value of this weapon when opposed to cavalry. And, indeed, the appalling apparition of the warhorse and his rider still held a mysterious power over their imaginations, which contributed, perhaps, quite as much as the effective force of the cavalry itself, to their discomfiture. Cortés led his troops without further opposition into the suburbs of Tacuba, the ancient Tlacopan, where he established himself for the night. On the following morning he found the indefatigable Aztecs again under arms, and, on the open ground before the city, prepared to give him battle. He marched out against them, and, after an action hotly contested, though of no long duration, again routed them. They fled towards the town, but were driven through the streets at the point of the lance, and were compelled, together{310} with the inhabitants, to evacuate the place. The city was then delivered over to pillage; and the Indian allies, not content with plundering the houses of everything portable within them, set them on fire, and in a short time a quarter of the town—the poorer dwellings, probably, built of light, combustible materials—was in flames. Cortés and his troops did all in their power to stop the conflagration, but the Tlascalans were a fierce race, not easily guided at any time, and when their passions were once kindled it was impossible even for the general himself to control them. They were a terrible auxiliary, and, from their insubordination, as terrible sometimes to friend as to foe.[347] Cortés proposed to remain in his present quarters for some days, during which time he established his own residence in the ancient palace of the lords of Tlacopan. It was a long range of low buildings, like most of the royal residences in the country, and offered good accommodations for the Spanish forces. During his halt here, there was not a day on which the army was not engaged in one or more rencontres with the enemy. They terminated almost uniformly in favor of the{311} Spaniards, though with more or less injury to them and to their allies. One encounter, indeed, had nearly been attended with more fatal consequences. The Spanish general, in the heat of pursuit, had allowed himself to be decoyed upon the great causeway,—the same which had once been so fatal to his army. He followed the flying foe until he had gained the farther side of the nearest bridge, which had been repaired since the disastrous action of the noche triste. When thus far advanced, the Aztecs, with the rapidity of lightning, turned on him, and he beheld a large reinforcement in their rear, all fresh on the field, prepared to support their countrymen. At the same time, swarms of boats, unobserved in the eagerness of the chase, seemed to start up as if by magic, covering the waters around. The Spaniards were now exposed to a perfect hail-storm of missiles, both from the causeway and the lake; but they stood unmoved amidst the tempest, when Cortés, too late perceiving his error, gave orders for the retreat. Slowly, and with admirable coolness, his men receded, step by step, offering a resolute front to the enemy.[348] The Mexicans came on with their usual vociferation, making the shores echo to their war-cries, and striking at the Spaniards with their long pikes, and with poles, to which the swords taken from the Christians had been fastened. A cavalier, named Volante, bearing the standard of{312} Cortés, was felled by one of their weapons, and, tumbling into the lake, was picked up by the Mexican boats. He was a man of a muscular frame, and, as the enemy were dragging him off, he succeeded in extricating himself from their grasp, and, clenching his colors in his hand, with a desperate effort sprang back upon the causeway. At length, after some hard fighting, in which many of the Spaniards were wounded and many of their allies slain, the troops regained the land, where Cortés, with a full heart, returned thanks to Heaven for what he might well regard as a providential deliverance.[349] It was a salutary lesson; though he should scarcely have needed one, so soon after the affair of Iztapalapan, to warn him of the wily tactics of his enemy. It had been one of Cortés’ principal objects in this expedition to obtain an interview, if possible, with the Aztec emperor, or with some of the great lords at his court, and to try if some means for an accommodation could not be found, by which he might avoid the appeal to arms. An occasion for such a parley presented itself when his forces were one day confronted with those of the enemy, with a broken bridge interposed between them. Cortés, riding in advance of his people, intimated by signs his peaceful intent, and that he wished to confer with the Aztecs. They respected the signal, and, with the aid of his interpreter, he requested that if there were any great chief among{313} them he would come forward and hold a parley with him. The Mexicans replied, in derision, they were all chiefs, and bade him speak openly whatever he had to tell them. As the general returned no answer, they asked why he did not make another visit to the capital, and tauntingly added, “Perhaps Malinche does not expect to find there another Montezuma, as obedient to his commands as the former.”[350] Some of them complimented the Tlascalans with the epithet of women, who, they said, would never have ventured so near the capital but for the protection of the white men. The animosity of the two nations was not confined to these harmless though bitter jests, but showed itself in regular cartels of defiance, which daily passed between the principal chieftains. These were followed by combats, in which one or more champions fought on a side, to vindicate the honor of their respective countries. A fair field of fight was given to the warriors, who conducted these combats à l’outrance with the punctilio of a European tourney; displaying a valor worthy of the two boldest of the races of Anahuac, and a skill in the management of their weapons, which drew forth the admiration of the Spaniards.[351] Cortés had now been six days in Tacuba. There was nothing further to detain him, as he had accomplished the chief objects of his expedition. He had humbled several of the places which had been{314} most active in their hostility; and he had revived the credit of the Castilian arms, which had been much tarnished by their former reverses in this quarter of the Valley. He had also made himself acquainted with the condition of the capital, which he found in a better posture of defence than he had imagined. All the ravages of the preceding year seemed to be repaired, and there was no evidence, even to his experienced eye, that the wasting hand of war had so lately swept over the land. The Aztec troops, which swarmed through the Valley, seemed to be well appointed, and showed an invincible spirit, as if prepared to resist to the last. It is true, they had been beaten in every encounter. In the open field they were no match for the Spaniards, whose cavalry they could never comprehend, and whose fire-arms easily penetrated the cotton mail which formed the stoutest defence of the Indian warrior. But, entangled in the long streets and narrow lanes of the metropolis, where every house was a citadel, the Spaniards, as experience had shown, would lose much of their superiority. With the Mexican emperor, confident in the strength of his preparations, the general saw there was no probability of effecting an accommodation. He saw, too, the necessity of the most careful preparations on his own part—indeed, that he must strain his resources to the utmost—before he could safely venture to rouse the lion in his lair. The Spaniards returned by the same route by which they had come. Their retreat was interpreted into a flight by the natives, who hung on{315} the rear of the army, uttering vainglorious vaunts, and saluting the troops with showers of arrows, which did some mischief. Cortés resorted to one of their own stratagems to rid himself of this annoyance. He divided his cavalry into two or three small parties, and concealed them among some thick shrubbery which fringed both sides of the road. The rest of the army continued its march. The Mexicans followed, unsuspicious of the ambuscade, when the horse, suddenly darting from their place of concealment, threw the enemy’s flanks into confusion, and the retreating columns of infantry, facing about suddenly, commenced a brisk attack, which completed their consternation. It was a broad and level plain, over which the panic-struck Mexicans made the best of their way, without attempting resistance; while the cavalry, riding them down and piercing the fugitives with their lances, followed up the chase for several miles, in what Cortés calls a truly beautiful style.[352] The army experienced no further annoyance from the enemy. On their arrival at Tezcuco they were greeted with joy by their comrades, who had received no tidings of them during the fortnight which had elapsed since their departure. The Tlascalans, immediately on their return, requested the general’s permission to carry back to their own country the valuable booty which they had gathered{316} in their foray,—a request which, however unpalatable, he could not refuse.[353] The troops had not been in quarters more than two or three days, when an embassy arrived from Chalco, again soliciting the protection of the Spaniards against the Mexicans, who menaced them from several points in their neighborhood. But the soldiers were so much exhausted by unintermitted vigils, forced marches, battles, and wounds, that Cortés wished to give them a breathing-time to recruit, before engaging in a new expedition. He answered the application of the Chalcans by sending his missives to the allied cities, calling on them to march to the assistance of their confederate. It is not to be supposed that they could comprehend the import of his despatches. But the paper, with its mysterious characters, served for a warrant to the officer who bore it, as the interpreter of the general’s commands. But, although these were implicitly obeyed, the Chalcans felt the danger so pressing that they soon repeated their petition for the Spaniards to come in person to their relief. Cortés no longer hesitated; for he was well aware of the importance of Chalco, not merely on its own account, but from its position, which commanded one of the great avenues to Tlascala, and to Vera Cruz, the intercourse with which should run no risk of interruption. Without further loss of time, there{317}fore, he detached a body of three hundred Spanish foot and twenty horse, under the command of Sandoval, for the protection of the city. That active officer soon presented himself before Chalco, and, strengthened by the reinforcement of its own troops and those of the confederate towns, directed his first operations against Huaxtepec, a place of some importance, lying five leagues or more to the south among the mountains. It was held by a strong Mexican force, watching their opportunity to make a descent upon Chalco. The Spaniards found the enemy drawn up at a distance from the town, prepared to receive them. The ground was broken and tangled with bushes, unfavorable to the cavalry, which, in consequence, soon fell into disorder; and Sandoval, finding himself embarrassed by their movements, ordered them, after sustaining some loss, from the field. In their place he brought up his musketeers and crossbowmen, who poured a rapid fire into the thick columns of the Indians. The rest of the infantry, with sword and pike, charged the flanks of the enemy, who, bewildered by the shock, after sustaining considerable slaughter, fell back in an irregular manner, leaving the field of battle to the Spaniards. The victors proposed to bivouac there for the night. But, while engaged in preparations for their evening meal, they were aroused by the cry of “To arms, to arms! the enemy is upon us!” In an instant the trooper was in his saddle, the soldier grasped his musket or his good Toledo, and the action was renewed with greater fury than{318} before. The Mexicans had received a reinforcement from the city. But their second attempt was not more fortunate than their first; and the victorious Spaniards, driving their antagonists before them, entered and took possession of the town itself, which had already been evacuated by the inhabitants.[354] Sandoval took up his quarters in the dwelling of the lord of the place, surrounded by gardens which rivalled those of Iztapalapan in magnificence and surpassed them in extent. They are said to have been two leagues in circumference, having pleasure-houses, and numerous tanks stocked with various kinds of fish; and they were embellished with trees, shrubs, and plants, native and exotic, some selected for their beauty and fragrance, others for their medicinal properties. They were scientifically arranged; and the whole establishment displayed a degree of horticultural taste and knowledge of which it would not have been easy to find a counterpart, at that day, in the more civilized communities of Europe.[355] Such is the testimony not only of the rude Conquerors,{319} but of men of science, who visited these beautiful repositories in the day of their glory.[356] After halting two days to refresh his forces in this agreeable spot, Sandoval marched on Jacapichtla, about twelve miles to the eastward. It was a town, or rather fortress, perched on a rocky eminence almost inaccessible from its steepness. It was garrisoned by a Mexican force, who rolled down on the assailants, as they attempted to scale the heights, huge fragments of rock, which, thundering over the sides of the precipice, carried ruin and desolation in their path. The Indian confederates fell back in dismay from the attempt. But Sandoval, indignant that any achievement should be too difficult for a Spaniard, commanded his cavaliers to dismount, and, declaring that he “would carry the place or die in the attempt,” led on his men with the cheering cry of “St. Jago.”[357] With renewed courage, they now followed their gallant leader up the ascent, under a storm of lighter missiles, mingled with huge masses of stone, which, breaking into splinters, overturned the assailants and made fearful havoc in their ranks. Sandoval, who had been wounded on the preceding day, received a severe contusion{320} on the head, while more than one of his brave comrades were struck down by his side. Still they clambered up, sustaining themselves by the bushes or projecting pieces of rock, and seemed to force themselves onward as much by the energy of their wills as by the strength of their bodies. After incredible toil, they stood on the summit, face to face with the astonished garrison. For a moment they paused to recover breath, then sprang furiously on their foes. The struggle was short, but desperate. Most of the Aztecs were put to the sword. Some were thrown headlong over the battlements, and others letting themselves down the precipice, were killed on the borders of a little stream that wound round its base, the waters of which were so polluted with blood that the victors were unable to slake their thirst with them for a full hour![358] Sandoval, having now accomplished the object of his expedition, by reducing the strongholds which had so long held the Chalcans in awe, returned in triumph to Tezcuco. Meanwhile, the Aztec emperor, whose vigilant eye had been attentive to all that had passed, thought that the absence of so many of its warriors afforded a favorable opportunity for recovering Chalco. He sent a fleet of boats, for this purpose, across the lake, with a numerous force under the command of some of his most valiant chiefs.[359] Fortunately,{321} the absent Chalcans reached their city before the arrival of the enemy; but, though supported by their Indian allies, they were so much alarmed by the magnitude of the hostile array that they sent again to the Spaniards, invoking their aid. The messengers arrived at the same time with Sandoval and his army. Cortés was much puzzled by the contradictory accounts. He suspected some negligence in his lieutenant, and, displeased with his precipitate return in this unsettled state of the affair, ordered him back at once, with such of his forces as were in fighting condition. Sandoval felt deeply injured by this proceeding, but he made no attempt at exculpation, and, obeying his commander in silence, put himself at the head of his troops and made a rapid countermarch on the Indian city.[360] Before he reached it, a battle had been fought between the Mexicans and the confederates, in which the latter, who had acquired unwonted confidence from their recent successes, were victorious. A number of Aztec nobles fell into their hands in the engagement, whom they delivered to Sandoval to be carried off as prisoners to Tezcuco. On his arrival there, the cavalier, wounded by the unworthy treatment he had received, retired to his own quarters without presenting himself before his chief.{322} During his absence, the inquiries of Cortés had satisfied him of his own precipitate conduct, and of the great injustice he had done his lieutenant. There was no man in the army on whose services he set so high a value, as the responsible situations in which he had placed him plainly showed; and there was none for whom he seems to have entertained a greater personal regard. On Sandoval’s return, therefore, Cortés instantly sent to request his attendance; when, with a soldier’s frankness, he made such an explanation as soothed the irritated spirit of the cavalier,—a matter of no great difficulty, as the latter had too generous a nature, and too earnest a devotion to his commander and the cause in which they were embarked, to harbor a petty feeling of resentment in his bosom.[361] During the occurrence of these events the work was going forward actively on the canal, and the brigantines were within a fortnight of their completion. The greatest vigilance was required, in the mean time, to prevent their destruction by the enemy, who had already made three ineffectual attempts to burn them on the stocks. The precautions which Cortés thought it necessary to take against the Tezcucans themselves added not a little to his embarrassment. At this time he received embassies from different Indian states, some of them on the remote shores of the Mexican Gulf, tendering their alle{323}giance and soliciting his protection. For this he was partly indebted to the good offices of Ixtlilxochitl, who, in consequence of his brother’s death, was now advanced to the sovereignty of Tezcuco. This important position greatly increased his consideration and authority through the country, of which he freely availed himself to bring the natives under the dominion of the Spaniards.[362] The general received also at this time the welcome intelligence of the arrival of three vessels at Villa Rica, with two hundred men on board, well provided with arms and ammunition, and with seventy or eighty horses. It was the most seasonable reinforcement. From what quarter it came is uncertain; most probably from Hispaniola. Cortés, it may be remembered, had sent for supplies to that place; and the authorities of the island, who had general jurisdiction over the affairs of the colonies, had shown themselves, on more than one occasion, well inclined towards him, probably considering him, under all circumstances, as better fitted than any other man to achieve the conquest of the country.[363]{324} The new recruits soon found their way to Tezcuco; as the communications with the port were now open and unobstructed. Among them were several cavaliers of consideration, one of whom, Julian de Alderete, the royal treasurer, came over to superintend the interests of the crown. There was also in the number a Dominican friar, who brought a quantity of pontifical bulls, offering indulgences to those engaged in war against the infidel. The soldiers were not slow to fortify themselves with the good graces of the Church; and the worthy father, after driving a prosperous traffic with his spiritual wares, had the satisfaction to return home, at the end of a few months, well freighted, in exchange, with the more substantial treasures of the Indies. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3310/90485.html","bookId":406,"book":{"id":406,"title":"History of the Conquest of Mexico","description":"简介： WILLIAM HICKLING PRESCOTT was born in Salem, Massachusetts, May 4, 1796. He died in Boston, January 28, 1859. William Prescott, his father, a lawyer of great ability and of sterling worth, was at one time a judge, and was frequently elected to public...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3310","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
