{"id":66158,"no":17,"title":"Page 17","content":"\n Tabby nodded fiercely, thinking of her father. “Aye, Sir Nevril. On that, at the least, we can agree.”\n “And the rabbit? Lady Judith isn’t opposed to having such a four-legged beastie hopping about her chamber?” His eyes were grave.\n “She was not altogether pleased,” Tabby admitted. “But when the king had no real complaint, what more could she say?”\n “The king?” Nevril looked at her in surprise.\n Tabby wanted to give herself a firm kick—or mayhap the man in front of her should be the one to be kicked. “I should not have said anything.” But then she felt she must explain, for the man was looking at her as if she were mad. “The king made a visit to our chamber last eve, to assure himself my lady was unhurt.”\n “How kind of the king,” he replied.\n “Please do not speak on it,” she added in a rush. “My lady gave strict orders there should be no gossip about it, and I even ensured the pages and serfs who brought her bath did not encounter his majesty.”\n “I do not gossip,” he replied, clearly insulted. “That is a woman’s task. But since you are asking a boon of me, I must be allowed to ask one of you in return.”\n Tabby truly wished to kick him now. How had she come into such a pickle? “What sort of boon?”\n “I should like to meet your—what was his name, did you say? Maggot?”\n “Maggin,” she replied fiercely. “I do not trust you, sirrah. You might pluck him from his cage and drop him into your stew pot.”\n “I vow I will do nothing of the sort,” he said soberly. “At the least, as long as Maggin is still kicking and his nose is quivering.”\n She couldn’t control a sound of disgust and he laughed, which made her even more angry. “Why do you want to see him?”\n The spark of humor drained away. “I merely wished to see how the fellow fares. Despite your belief, I do not like to see any creature in pain.”\n “Then mayhap you ought sheath your sword and put your bow and arrows away,” she grumbled.\n “Aye, and then what would you eat and who would protect the lands on which you live?” he countered.\n Tabby huffed and rolled her eyes. “Very well. I will bring you to see him. On the morrow.”\n “I shall hold you to that, Tabatha,” he said. “On the morrow. After morning mass. To your chamber.”\n Just as Nevril turned to go, Tabby noticed Bruin. He was standing at the open door of the stable, holding a bridle in his hand. He looked from her to Nevril and back again, then turned to go back into the dim building.\n She glared up at the man she wanted to kick even more and said, “And now you have utterly ruined my day. Good morrow.” She spun and stalked off, the basket of greens swaying violently from her arm.\n Malcolm obtained his audience with King Henry late the day after Judith’s rescue. He left his sword with the guard at the door as he strode into the royal court room, then bowed deeply.\n “Warwick. What brings you to our presence?” demanded the king.\n Mal took that as permission to straighten and did so, looking around the chamber. The queen was present, as she oft was when Henry held court, as well as the Archbishop of Canterbury (although he appeared to be distracted by a chess game with some other clergyman Mal didn’t recognize). A scribe sat at a table to one side, inks, pens and rolls of parchment at the ready along with the king’s seal and a pot of wax kept warm over a small candle.\n The royal couple sat on two massive chairs raised on a small dais with Canterbury next to them. A large table near the queen held an array of food: white cheese, grapes, apples, and a round, dark loaf of bread. A page stood behind it at a smaller table laden with plates, goblets, and a trio of wine bottles.\n “I’ve come to petition your majesty for the right to wed,” Mal replied as he approached the dais.\n “Is that so?” Henry said, his eyes narrowing thoughtfully. “You married Sarah of Glawstering quite some time ago….” The queen leaned over and spoke quickly to her husband, who sobered. “And our queen has reminded us that your wife died four years past. Our sympathies, Lord Warwick.”\n “Many thanks,” Mal replied. “I received your letter of condolence at the time, and I was much appreciative for that as well as the one you sent on the death of my father. But it is four years gone, and ’tis time I set my mind to a new wife and begetting an heir.”\n “There was no issue from your previous consummation?” Henry frowned. “I recall aught of a daughter….”\n Mal kept his expression smooth. “Aye. But she is very sickly and weak, and is not expected to….” Mortified when his voice trailed off, he swallowed hard and continued flatly, “She cannot inherit.”\n Henry looked at him, then at his wife. “I see,” he said with notable gentleness. “’Tis never easy to lose a child, nor to see one waste away.” He patted Eleanor’s hand, reminding Mal that the king and queen had lost three of their own children in a variety of ways over the years. “In that case, we foresee no problem with such a request. Warwick is flush, well-managed, and pays its rents on time. You send mercenaries as needed. Your loyalty to the crown is unquestionable. Of course, the granting of such a privilege will require some recompense on your part.”\n Of course. A large, fat recompense, I am sure. Mal tried not to show that he was gritting his teeth as he bowed briefly, responding, “I would expect naught other than to show my gratitude for such grace, your majesty.”\n Eleanor leaned over again and murmured. Henry chuckled and muttered in response and she laughed in return. Then the king looked at Mal with shrewd eyes. “The queen wishes to know which lovely lady might have caught the eye of the Lord of Warwick.”\n “I’ve made no offers, my liege, as of yet. I am considering Beatrice of Delbring, for her estate adjoins my lands at Pranville, and her father is more than willing for the match. But ’twas another reason I came to petition your highness directly: I thought to see if there were other candidates here in your court.”\n “Beatrice of Delbring is a pitiful mouse of a girl,” Eleanor said, surprising Mal with her bluntness. “But joining your lands with hers would be a smart decision. Yet there are others of an age to wed. Ursula of Tenevaux is sweet and pretty, but more importantly, she comes with an estate near the sea. A bit vacant-headed, but ’tis no great matter. And there is Lady Alynne…though a bit long in tooth, she is sturdy, wealthy, and would at the least not be crushed beneath your great…ehm…physique.”\n Mal wasn’t certain whether to blush or laugh at the queen’s assessment, for her eyes were bold as they swept over his figure. “I assure you, my lady queen, my previous wife did not expire due to being crushed under my…self.”\n Eleanor laughed, clearly surprised at his jest—though no more than Mal himself. He hardly considered himself a wit, let alone forward enough to make such a lewd jest in the company of the queen. But he had done so and, thank fortune, didn’t appear to have offended. Even the king was chuckling as he called the scribe over.\n “Very well, then, Warwick. The writ shall be prepared thus: a grant to wed as you wish, provided the maid is not otherwise betrothed or promised, and that her lands—if she brings any—reside in England. I do not wish you to expend resources traveling across the Channel to see to an estate when you have aught to keep you busy in England.”\n But of course, for that would mean less of my “resources” to flow to your coffers, my lord king. Yet Mal was sore pleased, even when the king named the very generous remuneration he must pay for the privilege of obtaining the writ—as well as a fine based on a portion of the lady’s dowry when he actually exercised the entitlement. The grant gave him the freedom to negotiate with any number of fathers or brothers for a lady’s hand, and allowed him the ability to make a decision quickly and expediently if necessary.\n The king signed and sealed the charter, then called Canterbury and the queen to witness it as well. Mal took the precious paper with relief and begged leave of the king.\n He was one step closer to returning to Warwick. And if he chose to wed Beatrice of Delbring, Mal realized, he could leave as soon as the morrow.\n Two days after her ill-fated hunting trip, Judith was in the mews checking on Hecate and the other raptors when a long shadow fell across the space.\n Startled, she turned to see Malcolm standing on the inner threshold. His shoulders were so broad he barely fit in the entrance, his head tilted slightly down to keep from bumping the top of it. His too-long hair hung in shaggy waves, curling about his neck and clean-shaven jaw. Her heart gave a sudden, warm lurch.\n He wore an ambiguous expression as he said, “I didn’t mean to frighten you.”\n “You didn’t frighten me as much as startle me,” she replied smartly, aware that her heart was pounding now. Why was her heart pounding? “I thought I was alone—and then all at once, there is a large, hulking man standing in the doorway.”\n “I am not so very hulking,” he said stiffly.\n Judith couldn’t help but giggle as she looked him over. For some reason, she was ridiculously happy to see him. “Tall, then, my lord. You are very tall. And your shoulders are very wide, and if one doesn’t call that hulking—”\n “You’re here alone?” he interrupted, looking around the space. His attention skimmed the sawdust floor and the five falcons sitting calmly on the long perch.\n “At the moment. Tessing went to check the traps for pigeons.” Judith opened the mews’s three large windows, allowing more mellow light to illuminate the area. It was large enough for any of the falcons to bate—spread and flap its wings—without hitting the walls. The raptors preferred an open, well-lit space once they were full grown. “’Tis time to feed them. The raptors, not the pigeons,” she added quickly, then felt foolish for babbling…but she couldn’t seem to stop. “We feed the raptors the caught pigeons or sparrows, for they prefer fresh meat, still warm.” What on earth was wrong with her? \n","sourceLink":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4/page-17.html","bookId":2670,"book":{"id":2670,"title":"A Lily on the Heath (Medieval Herb Garden #4)","description":"Storyline: \n A Lily on the Heath (Medieval Herb Garden #4) \n Passion and deception amid the turbulent court of Eleanor of Aquitaine and Henry II. \n An honorable man: Malcolm de Monde, Lord of Warwick needs a wife. He reluctantly journeys to the royal court where his plan is simple: find a dutiful woman, gain the king’s approval for his choice and return to Warwick with his chosen lady wedded, bedded, and carrying his heir—all before winter. \n An independent woman: Judith of Kentworth, Royal Falconer and lady-in-waiting, is a woman from Malcolm’s past. Although she is a confidante of the queen, Judith’s beauty and vivacity attract the unwanted attentions of the king—and the woman who commands winged predators becomes prey herself. \n A simple plan that goes awry when Malcolm encounters Judith, once betrothed to his friend—and a woman who is nothing like the meek wife he seeks…but who may be exactly the type of woman he needs. \n An impossible choice: Malcolm offers Judith a chance to escape her predicament…But can she risk entangling her own personal white knight in a dangerous web of royal intrigue?\n \n","cover":"https://allnovel.net/images/a-lily-on-the-heath-medieval-herb-garden-4.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:59:40 AM"}}
