{"id":66185,"no":44,"title":"Page 44","content":"\n He hesitated, then released his breath. “Put it on.”\n By now she’d unfolded it and saw that it was a mitten, made of mail. Small, much smaller than the one of his she’d borrowed when unmuzzling the fox. Tabby’s heart began to beat rapidly as she realized the mitt was just the size of her own hand. “Nevril,” she breathed, staring down at it. Then she looked at him in surprise. “I…is this for me?”\n He nodded abruptly, but his eyes did not leave her face. “Mayhap you will keep from being bitten when you do your work.” He seemed awkward and tense.\n Her face had gone hot and her insides shuddered with delight and shock. Not only was this an expensive gift, but it was so…thoughtful. Tabby couldn’t remember ever being given something so perfect. She could hardly breathe as she looked down at the mitt, then back up at him. “Nevril…I…thank you.” She blinked hard, suddenly filled with some indefinable emotion. “’Tis a most wondrous, wondrous gift.” She swallowed and slipped on the mitt.\n It fit perfectly, as if someone had formed the mail precisely around her hand whilst she waited. Tabby looked back up at him. “I do not know how to thank you, sir,” she whispered. And all at once, her heart was ramrodding in her chest.\n “I can think of one way,” he said, his voice quiet…yet very loud in the close, dim shelter.\n “How?” she asked around the sudden frog filling her throat. The flush of heat grew stronger and her stomach flipped around like a fish out of water.\n “Might you…might you answer a question for me?” Nevril replied.\n Tabby was aware of a wave of disappointment, but she said, “I would attempt it.”\n He nodded. “Haps you would tell me, Mistress Tabatha, what ’tis about an armored man that stirs so much loathing in you.”\n Oh. She snatched in her breath, feeling her eyes go wide. “’Tis…was…my father. He was a knight. A skillful one. He loved to fight, he was always the first to draw his sword or to lead a siege. Every day, it seemed, he looked for a chance to die. My mother hated it. She begged him not to leave, then wept when he did, always certain he would never return. And one day…he didn’t.” She swallowed, her throat burning. “My mother…she went a little mad. For five years, I cared for her like a child. At last she died, finally at peace. I do not wish to be like my mother,” she added fiercely, aware, at the same time, of a strange, ill-fitting chill settling over her. A disappointment, an emptiness. But she grated out the words—words she’d repeated over and over throughout her life. “I will never love a man of war. I cannot.”\n A long silence stretched, and for a moment, she thought he might leave. His posture stiffened and he was staring at the ground. “’Tis a great shame, then,” he said at last. His voice was low and grated like metal over stone. “For this man of war…loves you.”\n His words hung there for a moment, raw and taut. She could think of naught to say, for her insides churned with heat and nausea, mixing and battling. I cannot.\n “Good day, Mistress Tabatha,” he said, turning on the ball of his booted foot. The grinding sound was like a roar in her ears. “I shall not encumber you with my presence ever again.”\n “Wait,” she said, grabbing for his arm. Then she dropped her hand, fearful she’d overstepped. The chain mail mitt slid to the ground in a soft thunk.\n “Aye?” he said, and in the low light, she saw a flare of hope in his eyes. She swallowed hard, forcing her heart back down into its proper place.\n “Mayhap…mayhap I should thank you in some other way,” she said, forcing the words from her suddenly dry throat. “Other than answering a question.”\n His expression closed off. “Indeed?” He sounded impatient now, irritable; tension emanated from him. The muscles in his jaw were tight.\n But before she could think of aught to say, there was a commotion in the bailey. Nevril looked down at her for another instant, then firmly pulled his arm away. “Good day, Mistress Tabatha.”\n Wait! She cried the word inside, but she could not force her lips to move. And then he was gone, out of the lean-to and into the sunny bailey.\n When she would have gone after Nevril—though for what purpose, she was uncertain—she found him greeting new arrivals from Warwick. Though Lord Malcolm was not among them, Tabby noticed a pretty blond child riding in a cart, along with her mother. Nevril greeted them warmly and lapsed into a long, intense conversation with the girl’s mother.\n Afterward, Tabby watched as he bounced the girl-child from the cart and, settling her atop his shoulders, took her and the mother off into the keep.\n “I have oft seen this malady of the red-orange spots,” wrote Maris of Ludingdon. The note was enclosed within a message from her husband, Dirick, to Malcolm. “It begins with the cattle, on their tongues, as you have noted, and at times is known to spread to men. And though it can be devastating, there is a treatment that will keep it at some bay and decrease the chances of death. You are right to confine those who have it, and to send away those weak and old who have not yet been afflicted.”\n Mal read on, appreciating the legibility of Lady Maris’s neat script compared to the scrawl of her husband’s. Both messages, however, were of equal use to him. Dirick was responding to Mal’s message regarding the certainty that Queen Eleanor had attempted to take matters into her own hands regarding his marriage to Judith, and Lady Maris detailed a recipe of bearberry leaves steeped with rosemary as a remedy for the illness at Warwick.\n Dirick’s words, however, were not as optimistic. “I will confer with Mal Verne and Salisbury as to the best course to take while ruffling no feathers or turning over no ugly stones. At the least, if there is any news or rumblings, I shall send to you at once. In the mean while, ’tis best to stay close at home.”\n Malcolm’s mouth flattened grimly at Dirick’s last sentence. He was home, aye, but filled with discontent. While at Clarendon, he could only anticipate returning to Warwick, to his home—but now he was here, away from the politics and people, surrounded by his land, attending to his domain…and yet he was discontent.\n It was no difficult task for him to realize why. And his foul mood wasn’t simply because he’d been sleeping in an empty bed for the two months since his wedding. That could easily be remedied—there were plenty of willing women in the keep or the village who would be happy to see to those base needs. Every man utilized whores when his wife wasn’t available—or even, sometimes, if she was.\n But Mal found he had no interest in such a simple solution. And that realization alone was enough to make his chest tighten, and his mood more foul. Yet, it wasn’t merely the lack of coupling that had him pacing his chamber at night, or feeling unsettled when he sat to meal. He found himself actually missing Judith’s company, desiring to confer with her about problems and issues that arose about the estate, and—most telling of all—wondering about her, wishing to hear about her thoughts and experiences during the days.\n It was a shocking realization to a man who’d meant to marry only for the purpose of breeding an heir…and yet, he was filled with a sense of inevitability. For ever since the morrow Judith had manipulated him into playing chess, he sensed he’d been fighting a losing battle.\n Indeed. He had no armor against her. No protection.\n If only she could come to accept him as well.\n Tabatha easily healed the wing of the sparrow which Nevril had brought to her; it was a matter of making certain the bird rested while the bent wing-vein mended itself. And though, true to his word, he no longer visited her in the animal infirmary, she did make much use of the chain mail mitten and could not help but think of him regularly.\n For oftimes when she came to the small lean-to in the mornings after attending to Lady Judith, Tabby would find a basket or cage with an injured animal waiting for her. Or at times, a serf-boy or villager would bring a cat, dog, or even a hen, to her for care.\n And though she tensed hopefully every time she heard the rattle of chain mail or the heavy footfall of a man outside of the infirmary, and though she looked for Nevril’s curly head in the hall, she never saw him. An ache in her chest that had begun when he walked away continued to swell and grow over the next weeks.\n Tabby also noticed that the blond girl who’d arrived from Warwick with her mother often played in the herb garden behind the kitchens. Though she was young, the child, whose name she learned was Violet, reminded Tabatha of an old man named Gentle Ned who used to help her grandfather sew the jesses for Judith’s father’s hawks. Violet liked to wander among the flowers in the herb garden and orchard, but Tabby noticed the girl only ever picked a single blossom.\n “My poppy says I must save them for him,” Violet told her one day as she examined a cluster of golden calendula. “One each day.”\n “And where do you keep all these flowers for your papa? Does your mama help you find a place?” Tabby couldn’t help but feel a kinship for the girl, for surely her “poppy” was off fighting some war somewhere.\n “My mama is with the angels,” Violet told her matter-of-factly, crouching down to get a better look at one of the flowers. She seemed to have honed in on her choice.\n “That is not your mama?” Tabby asked, gesturing to the woman named Clara, who was chatting happily with one of the kitchen maids as they shelled peas.\n “Nay, my mama is in heaven. That’s only Clara,” said Violet, who’d transferred her attention to a fuzzy orange and black caterpillar. “Soft!”\n “Aye, but do not touch him very hard,” Tabby warned as a pudgy little finger came out inquisitively. “Else you might squash him.”\n “Oh,” Violet said, retracting her hand immediately. “But could you not fix him then?”\n “I? Oh, I could not do that.”\n “But Sir Nevril says you can fix any creature,” Violet told her, now fixing her guileless blue eyes on her. \n","sourceLink":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4/page-44.html","bookId":2670,"book":{"id":2670,"title":"A Lily on the Heath (Medieval Herb Garden #4)","description":"Storyline: \n A Lily on the Heath (Medieval Herb Garden #4) \n Passion and deception amid the turbulent court of Eleanor of Aquitaine and Henry II. \n An honorable man: Malcolm de Monde, Lord of Warwick needs a wife. He reluctantly journeys to the royal court where his plan is simple: find a dutiful woman, gain the king’s approval for his choice and return to Warwick with his chosen lady wedded, bedded, and carrying his heir—all before winter. \n An independent woman: Judith of Kentworth, Royal Falconer and lady-in-waiting, is a woman from Malcolm’s past. Although she is a confidante of the queen, Judith’s beauty and vivacity attract the unwanted attentions of the king—and the woman who commands winged predators becomes prey herself. \n A simple plan that goes awry when Malcolm encounters Judith, once betrothed to his friend—and a woman who is nothing like the meek wife he seeks…but who may be exactly the type of woman he needs. \n An impossible choice: Malcolm offers Judith a chance to escape her predicament…But can she risk entangling her own personal white knight in a dangerous web of royal intrigue?\n \n","cover":"https://allnovel.net/images/a-lily-on-the-heath-medieval-herb-garden-4.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:59:40 AM"}}
