{"id":66147,"no":6,"title":"Page 6","content":"By the time Judith finished checking Hecate’s foot and feeding her and the three other falcons, what was left of the anemic yellow sun had turned gray. She stayed with her birds for another few moments, settling them one by one in turn on a leather-gloved fist and speaking quietly while they ate a small treat, just as her father had taught her to do. When she finally came back out of the mews, the clouds hung thick and heavy. The scent of impending damp filled the air. Nevertheless, Judith took her time wandering back to the hall. She’d missed mass, but there was another at terce and she could always go to confession if she missed that one too. Since she was bound to be closed up the rest of the day if the clouds were any indication, she wanted to enjoy the fresh air—and she suspected God might appreciate that sentiment as much or more than her presence at daily mass. At the least, she hoped so. She certainly wasn’t brave enough to raise the question with Father Anselm. Some of the men were still training, and Judith slowed her pace without appearing to do so. She looked around for Rike, wanting to assure herself he wasn’t moping in a corner of the yard—or, worse, tumbled on the ground again or cut by his own blade. At first she didn’t see him, and Judith slowed even more. Hugh caught sight of her and paused mid-battle, swiping a forearm over his perspiring forehead. He grinned and waved, then charged back toward his opponent, who was no match for Hugh’s quick feet. She returned the hail and finally caught sight of Rike. He was standing near the edge of the training yard, away from the others, but he wasn’t alone. Malcolm of Warwick stood there, speaking to him, gesturing with his large, broad hands, and the younger man was nodding earnestly. Malcolm towered over the boy just enough that Judith suspected Rike might grow as tall as he some day, for he was well on his way there. Well. Mayhap they’d both had the same idea. Judith smiled to herself, determined to find out if that was the case. “And what does such a lovely woman find so amusing on this dreary day?” Judith halted in her tracks, then sank into an efficient curtsy. “My lord,” she said, her voice directed toward the ground due to her pose of obeisance. She could see the fine leather shoes of the king just outside her field of vision. When he took her hand to draw her to her feet, she looked up to find him smiling down at her. “Well, Lady Judith, what is it that brings such a beautiful smile to an already lovely face?” he asked again. “Good morrow, my lord,” she said, trying to gather her scattered wits. She’d spoken with the king numerous times, and she was a confidante of his wife. The mere royal presence wasn’t enough to set her mind to the wind; it was that he’d come upon her so quickly and intruded upon her thoughts. Thoughts which she preferred not to share. “I was merely thinking about…a jest Lord Hugh made last evening, at the expense of the jongleur,” she manufactured quickly. “And pray what was that?” pressed the king. His attention was focused so heavily on her Judith found it difficult to breathe. “Naught but his assertion that if the man could shave his face, then why could he not cut his hair?” Hugh had said that about Warwick in an almost admiring fashion, but the king didn’t know that and Judith needed an answer. “Indeed,” replied Henry. He stroked his reddish beard, a darker, duller shade than Judith’s own hair. He hadn’t released her hand, and Judith felt an odd tripping of her heart as she became aware of this. “Hugh is a witty man, ’tis true. Lady Judith,” he said, command replacing his conversational tone, “’tis our good fortune to have come upon you this morrow. Had we attended mass as Becket suggested, in the stead of coming to view our men, we shouldn’t have had such a happy moment.” “Ah,” Judith replied, managing to slip her fingers from his grip under the guise of adjusting her girdle, “I wonder what the archbishop would say on that, knowing you chose the task of war over that of worship.” She kept her tone light, knowing the king appreciated jests. “But mayhap you could convince him your intent was to worship amid God’s natural house on this cloudy day, and not mention that it was in the same yard as your fighting men.” Henry chuckled, his blue eyes lighting with humor. “Beautiful and witty. ’Tis no wonder our queen admires you, Lady Judith.” She relaxed. She’d misunderstood the warmth in his eyes and the too-long clasp of her hand. Even the king wouldn’t tread upon his wife’s ground. “Not nearly as much as I love her, your majesty,” she replied. “And pretty with the compliments as well,” he acknowledged. “Well, then, Lady Judith, let us tell you of the thought we’ve had. The queen has just informed us of her news—that she expects another confinement in seven or eight months. So soon after Joan’s birth, aye? But I daresay, ’tis not only the fault of the queen. And mayhap you are already aware of this,” he added with a twinkle in the eye. Judith wasn’t certain whether to acknowledge that she was, indeed, aware of the queen’s condition and so she remained silent with a vague smile curving her lips. “We now tell you—if she produces another son and heir for us, his name shall be John. But if she is blessed with a daughter, her name shall be Mary. ’Tis no matter now…but the reason we wish to speak with you is simple. We wish to gift her with a fine, well-trained falcon, fit for a queen, in celebration of this news. And we know of no other lady who should be the one to find and train this huntress bird.” “Oh my lord, you honor me,” Judith said, sweeping into another curtsy. Inside, she was alive and fairly bouncing with enthusiasm. “I would be very grateful to take on such a task! It would give me such pleasure to do so for her majesty—and for you as well. I thank you.” “Please, rise, my lady,” he said, pulling her to her feet again. “We have great confidence in your abilities. You may begin this task this day—if,” he added as a large raindrop splashed onto their joined hands, “the weather allows.” Before she could reply, the clouds opened up, releasing a heavy downpour. Judith gave a soft shriek in surprise, and the king chuckled. “Apparently, ’tis not to be. Off with you, my lady,” he said, gesturing her back to the keep. She heard his laughter behind her as she took his advice, picked up her skirts, and ran. Mal didn’t mind the rain, and to the lad Rike’s obvious surprise, he kept him in the training yard even after the other men peeled away and went inside. A crash of thunder rolled nearby, followed by a streak of lightning—but it was distant. They had time. “You’ll fight in the rain too,” he told Rike, showing the boy once more how to use the weight of the broadsword to lever it into a powerful upward swing. “And in the dark. And when you’re weary or injured or hungry. Thus ’tis best to train under all conditions as well.” “Aye, my lord,” Rike replied soberly, trying the demonstrated move once more. Mal watched him try it twice, then thrice, and nodded with satisfaction. “Aye. ’Tis much improved even today.” The rain pelted onto them, dripping from their hair into their eyes, soaking through to their hose. Mal could have remained in the training yard all the day, for the downpour felt cool and refreshing after the closeness of the great hall and sleeping chambers. But Rike, still wearing his tunic, looked like an angular, half-drowned dog, so he took pity on the miserable boy. “Go on with you, then. But I’ll meet up with you here tomorrow at dawn if you wish some more advice.” “Oh, aye, Lord Warwick, I do.” The young man’s reply was filled with genuine hope and enthusiasm. “Thank you.” “Be off,” Mal said with a grin. “And do you take care not to trip on those boat-feet of yours.” He watched Rike hurry away, remembering with more than a touch of discomfort his early days of training. He had the same massive feet, the same uncontrollable arms of ridiculous length, and hands that just couldn’t seem to do what he wanted. There’d been no kind lord to mentor him while at Kentworth, but at last a grizzled master-at-arms had taken him aside—much as Mal had done to Rike today—and found him a sword better suited for his weight and height. And Mal had practiced and practiced and practiced. A bolt of lightning flashed closer now and Mal glared up at it. “Very well,” he growled to the heavens. “Back into shelter I go. But if you’ll be so kind as to find me a wife, I can soon quit this place.” He collected his sherte and tunic. He preferred to train without them whenever possible, because they became soaked with perspiration and, often, blood and dirt as well. But today, they were just as wet as if he’d worn them. And as he didn’t wish to walk into the keep with his torso bare, he struggled into the soaking clothing and slid his sword into its sheath. When he came into the Great Hall, dripping but not the least bit chilled, Malcolm found it just as he expected: filled with people everywhere, the space loud and close. Yet he hadn’t broken his fast and there was food to be had, so he tamped down his irritation and searched for an empty place among the trestle tables. “Warwick!” someone called, and he turned to see Lady Judith. For some unaccountable reason, his chest tightened and he meant to keep walking…but before he could force himself to do so, his feet turned and brought him over to her. It was rude, he told himself, to ignore a gentlelady’s hail. She sat at a small table next to one of the lesser fireplaces, a chessboard arranged in front of her. He swiped the long, sopping hair from his forehead, careful not to stand so close he’d drip all over her and the table as he gave a brief bow. “Good morrow, Lady Judith,” he said politely, noticing her own clothing was still damp. Of course he’d seen her walking by the training yard earlier—how could one ignore that beacon of fiery hair, especially in a colorless morn such as this? Little wisps of it fell from her coiffure, settling over her shoulders in frizzing curls. She wore no veil this morrow.","sourceLink":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4/page-6.html","bookId":2670,"book":{"id":2670,"title":"A Lily on the Heath (Medieval Herb Garden #4)","description":"Storyline: A Lily on the Heath (Medieval Herb Garden #4) Passion and deception amid the turbulent court of Eleanor of Aquitaine and Henry II. An honorable man: Malcolm de Monde, Lord of Warwick needs a wife. He reluctantly journeys to the royal court where his plan is simple: find a dutiful woman, gain the king’s approval for his choice and return to Warwick with his chosen lady wedded, bedded, and carrying his heir—all before winter. An independent woman: Judith of Kentworth, Royal Falconer and lady-in-waiting, is a woman from Malcolm’s past. Although she is a confidante of the queen, Judith’s beauty and vivacity attract the unwanted attentions of the king—and the woman who commands winged predators becomes prey herself. A simple plan that goes awry when Malcolm encounters Judith, once betrothed to his friend—and a woman who is nothing like the meek wife he seeks…but who may be exactly the type of woman he needs. An impossible choice: Malcolm offers Judith a chance to escape her predicament…But can she risk entangling her own personal white knight in a dangerous web of royal intrigue?","cover":"https://allnovel.net/images/a-lily-on-the-heath-medieval-herb-garden-4.jpg","author":"Colleen Gleason","type":"Historical","source":"allnovel","link":"https://allnovel.net/a-lily-on-the-heath-medieval-herb-garden-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:59:40 AM"}}
