{"id":16416,"no":2,"title":"CONUNDRUM NUMBER ONE","content":"THE STOLEN MINUTE BOOK Rose always insisted that she was psychic, and I have some faith myself in presentiments. At any rate, we both declared, on that Monday night before the curtain went up, that something was going to happen. Leonard had no convictions of the sort himself but he was favourably disposed towards our attitude. He put the matter succinctly. \"Here we are,\" he pointed out, \"sold to the devil, body and soul, and if the old boy doesn\u0027t make some use of us, I shall begin to be afraid the whole thing\u0027s coming to an end. Five pounds a week, and a reserve fund for costumes and posters suits me very nicely, thank you.\" \"I don\u0027t think you need worry,\" I told him. \"It doesn\u0027t seem reasonable to imagine that we\u0027ve been sent to the slums of Liverpool for nothing.\" [Pg 16]\"Then there are those posters,\" Rose put in, \"offering prizes to amateurs. I\u0027m quite certain there\u0027s some method in that. Besides——\" She hesitated. We both pressed her to go on. \"You\u0027ll think this silly, but for the last three nights I\u0027ve had a queer sort of feeling that Mr. Thomson was somewhere in the audience. I can\u0027t explain it. I looked everywhere for him. I even tried looking at the people one by one, all down the rows. I never saw any one in the least like him. All the same, I expected to hear his voice at any moment.\" \"Granted the old boy\u0027s Satanic connections,\" Leonard observed, \"he may appear to us in any form. Brimstone and horns are clean out of date. He\u0027ll probably send his disembodied voice with instructions.\" I strolled to the wings and had a look at the house. Although it still wanted a quarter of an hour before the performance was due to commence, the hall was almost packed with people. The audience, as was natural considering the locality, was a pretty tough lot. It[Pg 17] seemed to consist chiefly of stewards and sailors from the great liners which lay in the river near by, with a sprinkling of operatives and some of the smaller shopkeepers. The study of faces has always interested me, and there were two which I picked out from the crowd during that brief survey and remembered. One was the face of a youngish man, dressed in the clothes of a labourer and seated in a dark corner of the room. He was very pale, almost consumptive-looking, with a black beard which looked as though it had been recently grown, and coal black hair. His features were utterly unlike the features of his presumed class, and there was a certain furtiveness about his expression which puzzled me. A quietly dressed girl sat by his side, whose face was even more in the shadow than his, but it struck me that she had been crying, and that for some reason or other there was a disagreement between her and the young man. The other person whom I noticed was a stout, middle-aged man, with curly black hair, a rather yellow complexion, of distinctly Semitic appearance. His hands were folded[Pg 18] upon his waistcoat, he was smoking with much obvious enjoyment a large cigar, and his eyes were half-closed, as though he were enjoying a brief rest. I put him down as a small shopkeeper, for choice a seller of ready-made garments, who had had a long day\u0027s work and was giving himself a treat on the strength of it. At half-past seven the hall was crammed and the curtain rang up. We went through the first part of our programme with a reasonable amount of success, Leonard in particular getting two encores for one of his humorous songs. At the beginning of the second part, I came out upon the stage and made the little speech which our mysterious patron\u0027s wishes rendered necessary. \"Ladies and gentlemen,\" I said, \"I have much pleasure in announcing, according to our posters outside, that if there are any amateurs here willing to try their luck upon the stage, either with a song or a dance, we shall be very happy to provide them with music and any slight change of costume. A prize of one pound will be given to the performer whose song meets with the greatest approval, and[Pg 19] a second prize of five shillings for the next most successful item.\" I gagged on for a few more minutes, trying to encourage those whom I thought likely aspirants, amidst the laughter and cheers of the audience. Presently a showily dressed young woman threw aside a cheap fur cloak, displaying a low-cut blue satin gown, jumped nimbly on to the stage, ignoring my outstretched hand, and held out a roll of music to Rose, who came smilingly from the background. \"I\u0027ll try \u0027The Old Folks down Wapping Way\u0027, dear,\" she announced, \"and don\u0027t you hurry me when the sloppy stuff comes. I like to give \u0027em time for a snivel or two. Sit you down at the piano. I\u0027m that nervous, I can\u0027t stand fussing about here.\" They bent over the music together and I turned back to the audience. There were only two others who showed any disposition to follow the example of the lady in blue satin. One was the young man whom I had previously noticed, and who had now risen to his feet. It was obvious that the girl by his side was[Pg 20] doing all she could to dissuade him from his purpose. I could almost hear the sob in her throat as she tried to drag him back to his place. I myself felt curiously indisposed to interfere, but Leonard, who was standing by my side, and who saw them for the first time, imagining that a word of encouragement was all that was necessary, concluded the business. \"Come along, sir,\" he called out. \"You look as though you had a good tenor voice, and nothing fetches \u0027em like it. You let him come, my dear, and he\u0027ll buy you a new hat with the money.\" The young man shook himself free and stepped on to the platform, obviously ill at ease at the cheer which his enterprise evoked. He was followed, to my surprise, by the middle-aged man whom I had previously noticed. \"Here, Mister,\" was his greeting, as he stepped on to the platform, \"I\u0027ll have a go at \u0027em. Sheeny patter and a clog dance, eh?\" \"You must find me some sort of a change,\" the young man insisted hurriedly. \"And I\u0027ll tidy up a bit myself,\" his rival observed. \"We\u0027ll let the gal have first go.\" [Pg 21]I conducted them behind and showed the young man into the men\u0027s dressing room. \"You\u0027ll find an old dress suit of mine there,\" I pointed out. \"Change as quickly as you can. I don\u0027t fancy the young lady will hold them for long.\" He nodded and drew me a little on one side. His manner was distinctly uneasy, and his clothes were shabbier even than they had seemed at a distance, but his voice was the voice of a person of education, pleasant, notwithstanding a queer, rather musical accent which at the moment was unfamiliar to me. \"Shall I be able to lock my things up?\" he asked, in an undertone. \"No offence,\" he went on hastily, \"only I happen to be carrying something rather valuable about with me.\" I handed him the key of the dressing room, for which he thanked me. \"How long will that screeching woman be?\" he asked impatiently. \"You can go on directly she\u0027s finished murdering this one,\" I promised him. \"I don\u0027t think they\u0027ll stand any more.\" He nodded, and I turned back towards[Pg 22] where the other aspirant was standing in the shadow of the wings. \"Now what can I do for you, sir?\" I asked. \"I don\u0027t think you need to change, do you?\" There was no immediate reply. Suddenly I felt a little shiver, and I had hard work to keep back the exclamation from my lips. I knew now that Rose had been right. It was a very wonderful disguise, but our master had at last appeared. He drew a little nearer to me. Even then, although I knew that it was Richard Thomson, I could see nothing but the Jew shopkeeper. \"I shall pretend to make some slight change behind that screen,\" he said in a low tone. \"Come back here when you\u0027ve taken him on the stage. I may want you.\" He disappeared behind a screen a few feet away, and I stood there like a dazed man. From the stage I could still hear the lusty contralto of the young lady candidate. I heard her finish her song amidst moderate applause, chiefly contributed by a little group of her supporters. There was a brief pause. The young lady obliged with an encore. Then the[Pg 23] door of the men\u0027s dressing room opened, was closed and locked. The young man, looking a little haggard but remarkably handsome, came towards me, clenching the key in his hand. \"I was a fool to take this on,\" he confided nervously. \"You are sure my things will be all right in there?\" I pointed to the key in his hand. \"You have every assurance of it,\" I told him. He fidgeted about, listening with obvious suffering to the girl\u0027s raucous voice. \"Ever been in the profession?\" I enquired. \"Never,\" was the hasty reply. \"What\u0027s your line to-night?\" \"Tenor. Your pianist will be able to do what I want. I\u0027ve heard her.\" \"If you win the prize, do you want a job?\" I asked, more for the sake of making conversation than from any real curiosity. He shook his head. \"I\u0027ve other work on.\" \"Down at the docks?\" \"That\u0027s of no consequence, is it?\" was the[Pg 24] somewhat curt reply.—\"There, she\u0027s finished, thank heavens! Let me get this over.\" I escorted him to the wings. The young lady, amidst a little volley of good-natured chaff, jumped off the stage and returned to her friends. Her successor crossed quickly towards Rose, who was still seated at the piano. I slipped back behind the scenes. Mr. Richard Thomson was examining the lock of the men\u0027s dressing room. \"He\u0027s got the key,\" I told him. There was no reply. Then I saw that our patron held something in his hand made of steel, which glittered in the light of an electric torch which he had just turned towards the keyhole. A moment later the door was opened and he disappeared. Out on the stage, Rose was playing the first chords of a well-known Irish ballad. Then the young man began to sing, and, notwithstanding my state of excitement, I found myself listening with something like awe. The silence in the hall was of itself an extraordinary tribute to the singer. Shuffling of feet, whispering and coughing had ceased. I felt myself holding my own breath,[Pg 25] listening to those long, sweet notes with their curious, underlying surge of passion. Then I heard Mr. Thomson\u0027s voice in my ear, curt and brisk. \"You\u0027ve a telephone somewhere. Where is it?\" \"In the passage,\" I pointed out. He disappeared and returned just as a roar of applause greeted the conclusion of the song. The young man hurried in from the stage. The Jew shopkeeper was seated in the same chair, with his hands in his pockets and a disconsolate expression upon his face. Outside, the audience was literally yelling for an encore. \"You\u0027ll have to sing again,\" I told him. \"I don\u0027t want to,\" he declared passionately. \"I was a fool to come.\" \"Nonsense!\" I protested, for the uproar outside was becoming unbearable. \"Listen! They\u0027ll have the place down if you don\u0027t.\" \"I sha\u0027n\u0027t go on,\" his rival competitor grumbled sombrely, thrusting a cigar into his mouth and feeling in his pockets for a match. \"You\u0027ve queered my pitch all right. They\u0027re[Pg 26] all Irish down in this quarter. You\u0027ve fairly got \u0027em by the throat.\" The young man stood still for a moment, listening to the strange cries which came from the excited audience. Suddenly inspiration seemed to come to him. His eyes flashed. He turned away and strode out on to the stage almost with the air of a man possessed by some holy purpose. I followed him to the wings, and from there I had a wonderful view of all that happened during the next few minutes. The young man stood in the middle of the stage, waved his hand towards Rose, to intimate that he needed no music, waited for a few more moments with half-closed eyes and a strange smile upon his face, and commenced to sing. I realised then what inspiration meant. He sang against his will, carried away by an all-conquering emotion, sang in Gaelic, a strange, rhythmic chant, full of deep, sweet notes, but having in it something almost Oriental in its lack of compass and superficial monotony. Again the silence was amazing, only this time, as the song went on, several of the women began to sob, and a dozen or[Pg 27] more men in the audience stood up. Afterwards I knew what that song meant. It was the Hymn of Revolution, and every line was a curse. From my place in the wings I was able to follow better, perhaps, than any one else in the room, the events of the next sixty seconds. I saw two policemen push their way along the stone passage, past the box office and into the back of the hall, led by a man in plain clothes, a stalwart, determined-looking man with a look of the hunter in his face. Almost at the same moment the singer saw them. His song appeared somehow to become suspended in the air, ceased so abruptly that there seemed something inhuman in the breaking off of so wonderful a strain. He stood gazing at the slowly approaching figures like a man stricken sick and paralysed with fear. Then, without a word, he left the stage, pushed past me, sprang for the dressing room, and, turning the key in the lock, disappeared inside. I followed him for a few yards and then hesitated. Behind, I could hear the heavy, slowly moving footsteps of the police, making their way with[Pg 28] difficulty through the crowd, a slight altercation, the stern voice of the detective in charge. Then, facing me, the young man emerged from the dressing room, ghastly pale, shaking the coat in which he had arrived, distraught, furious, like a man who looks upon madness. Mr. Richard Thomson leaned back in his chair, his mouth open, his whole attitude indicative of mingled curiosity and surprise. \"What you break off for like that, young man?\" he demanded. \"Have you forgotten the words? You\u0027ve won the quid all right, anyway.\" \"I\u0027ve been robbed!\" the singer called out. \"Something has been stolen from the pocket of this coat!\" \"You locked it up yourself,\" I reminded him, with a sudden sinking of the heart. \"I don\u0027t care!\" was the wild reply. \"It was there and it is gone!\" He flung the coat to the ground with a gesture of despair. The advancing footsteps and voices were louder now. The man in the plain clothes pushed his way through the[Pg 29] wings, beckoned the police to follow and pointed to the young man. \"The game\u0027s up, Mountjoy,\" he said curtly. \"We don\u0027t want any shooting here,\" he added, as he saw the flash of a revolver in the other\u0027s hand. \"I\u0027ve half a dozen men outside besides these two.\" The trapped man seemed in some measure to recover himself. He half faced me, and the revolver in his hand was a wicked looking instrument. \"Some one has been at my clothes,\" he muttered, his great black eyes glaring at me. \"If I thought that it was you——\" I was incapable of reply, but I imagine that my obviously dazed condition satisfied him. He turned from me towards where Mr. Richard Thomson was seated, watching the proceedings with stupefied interest, breathing heavily with excitement, his mouth still a little open. \"Or you,\" the young man added menacingly. Thomson held out his hands in front of his face. [Pg 30]\"You put that up, Mister,\" he enjoined earnestly. \"If you\u0027re in a bit of trouble with the cops, you go through with it. Don\u0027t you get brandishing those things about. I\u0027ve known \u0027em go off sometimes.\" The singer\u0027s suspicions, if ever he had any, died away. He tossed the revolver to the officer, who had halted a few yards away. \"Better take me out the back away,\" he advised. \"There\u0027ll be trouble if the crowd in front gets to know who I am.\" The officer clinked a pair of handcuffs on his captive\u0027s wrists with a sigh of satisfaction. They moved off down the passage. All the time there had been a queer sort of rumble of voices in front, which might well have been a presage of the gathering storm. I moved back to the wings just in time to see the torch thrown. The girl who had been seated with the young man, suddenly leaped upon a bench. She snatched off her hat and veil as though afraid that they might impede her voice. A coil of black hair hung down her back, her face was as white as marble, but the strength of her voice was wonderful. It rang through the hall[Pg 31] so that there could not have been a person there who did not hear it. \"You cowards!\" she shouted. \"You have let him be taken before your eyes! That was Mountjoy who sang to you—our liberator! Rescue him! Is there any one here from Donegal?\" Never in my life have I looked upon such a scene. The men came streaming like animals across the benches and chairs, which they dashed on one side and destroyed as though they had been paper. I was just in time to seize Rose and draw her back to the farthest corner when the sea of human forms broke across the stage. Nobody took any notice of us. They went for the back way into the street, shouting strange cries, brandishing sticks and clenched fists, fighting even one another in their eagerness to be first. Until they were gone, the tumult was too great for speech. Rose clung to my arm. \"What does it mean, Maurice?\" she asked breathlessly. \"Who is he?\" \"I have no idea,\" I answered, \"but I can[Pg 32] tell you one thing. To-night has been our début.\" \"Talk plain English,\" Leonard begged. \"Remember we had to be on the stage all the time.\" \"It means,\" I explained, \"that we\u0027ve begun our little job as spokes in the wheel which our friend Mr. Richard Thomson is turning. You remember the other competitor, a man who never sang at all, who looked like a Jew fishmonger in his best clothes?\" \"What about him?\" Rose demanded. \"He was Mr. Richard Thomson,\" I told her. \"You and I, Leonard, are simply mugs at making up. It was the most wonderful disguise I ever saw in my life.\" \"That accounts for it,\" she declared, with a little shiver. \"He has been here before, watching. I told you that I felt him around, without ever recognising him.\" \"Where is he now?\" Leonard asked abruptly. We searched the place. There was no sign of our patron. Just as mysteriously as he had come, he had disappeared. The young lady[Pg 33] in blue satin came up and claimed her sovereign. We went down into the auditorium and inspected the damage. Finally, as we were on the point of leaving, a smartly dressed page came in through the back door and handed me a note. It was dated from the Adelphi Hotel and consisted only of a few lines: Mr. Richard Thomson presents his compliments and will be glad to see Miss Mindel, Mr. Lister and Mr. Cotton to supper to-night at eleven-thirty. History repeated itself. When we presented ourselves at the Adelphi Hotel and enquired for Mr. Richard Thomson, doors seemed to fly open before us, a reception clerk himself hurried out with smiles and bows, and conducted us to the lift. We were ushered into a luxurious sitting room on the first floor and welcomed by our host, whose carefully donned dinner clothes and generally well-cared-for appearance revealed gifts which filled me with amazement. \"This is a very pleasant meeting,\" Mr. Thomson declared, as he placed us at the table and gave orders that the wine should be[Pg 34] opened. \"We met last on the east coast, I remember. I trust that you are finding business better?\" \"Business is wonderfully good,\" I acknowledged. \"We turned away money last week,\" Leonard announced. There was something a little unreal about the feast which was presently served, excellent though it was, and I am quite sure that we three guests breathed a sigh of relief when at last the table was cleared and the waiter dismissed. Our host lit a cigar and leaned back in his high chair. With the passing of that smile of hospitality from his lips, his face seemed to have grown hard and unpropitious. \"I trust,\" he said slowly, \"that you are all satisfied with our arrangement so far?\" \"We are more than satisfied,\" I assured him, trying to infuse as much gratitude as I could into my tone. \"I am thankful to say that we are able to put by a little every week, too, towards the capital which you advanced. The new costumes, songs and posters are bringing something of their own back.\" [Pg 35]Mr. Thomson waved his hand. \"That is a matter of no concern,\" he pronounced. \"Have you anything further to say?\" I looked at Leonard and at Rose. We all three looked at our host. \"I should like to know,\" I asked bluntly, \"how much of my soul was scotched by to-night\u0027s little adventure?\" Mr. Thomson stretched out his hand for the evening paper which the waiter has just placed by his side. \"I do not wish to encourage curiosity,\" he remarked coldly. \"Our bargain renders any explanation on my part unnecessary. You had better read aloud that item in the stop press news, however. It may allay your qualms, if you are foolish enough to have any.\" The sheet was wet from the press. I held it under the light and read:— ARREST OF MOUNTJOY, THE CASTLE DERMOY MURDERER! Denis Mountjoy was arrested to-night at a music hall in Watergate Street. A determined attempt was made at a rescue, and a[Pg 36] free fight took place outside the Watergate Street police station, all the windows of which were broken. With the arrest of Mountjoy, who will be charged with no less than five murders, it is hoped that the whole conspiracy of which he was the head will be broken up. It is known that he has in his possession the famous minute book of the revolutionary secret society which bore his name, and numerous other arrests may be expected at any moment. The chief constable has received a telephone message of congratulation from Scotland Yard. I laid down the paper. For the life of me I could not keep back the question which rose to my lips. \"There was five hundred pounds reward for the arrest of Mountjoy. Are you claiming it?\" \"Blood money,\" Mr. Thomson confessed, with a queer smile, \"is not in my line.\" \"It was you who put the police on to Mountjoy?\" I persisted. He made no direct reply. He was stonily thoughtful for a moment. \"I knew,\" he continued presently, \"I believe even the police knew, that Mountjoy was[Pg 37] lying hidden somewhere within a quarter of a mile of Watergate Street. How to draw him out of his hiding place was the problem. I remembered his two failings,—vanity, and love of hearing that beautiful voice of his. I pandered to them.\" \"You laid a trap on behalf of the police, then?\" Mr. Thomson knocked the ash from his cigar. \"That might be considered the truth,\" he admitted. \"And the minute book?\" \"Concerning the minute book,\" he replied, \"I have nothing to say.\" Rose drew her chair a little nearer towards him. The rose-shaded electric light shone upon her fair hair, her wonderful eyes, her piquant face with its alluring smile. She leaned forward towards our host, and it seemed to me that the soft entreaty in her tone and the pleading of her eyes were irresistible. \"Mr. Thomson,\" she said, \"I am a woman, and I am desperately, insatiably curious. I must know—please tell me—what are we[Pg 38]—you and we three? Your confederates, I suppose we are? Are we on the side of the police or the criminal, the informer, or do we come somewhere between? I must adapt my conscience to our position.\" Mr. Thomson was unshaken. He looked at Rose just as though she had been an ordinary human being. \"That,\" he said, \"may be put in the category of questions which you will be at liberty to ask me when our agreement comes to an end. Shall we call it Conundrum Number 1? By the bye, if it is any convenience to you to know your movements in advance, I may tell you that you will open at Bath next week.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3028/83732.html","bookId":1066,"book":{"id":1066,"title":"The Seven Conundrums","description":"简介： The wind, storming up from the sea, beat against the frail little wooden building till every rafter creaked and groaned. The canvas sides flapped and strained madly at the imprisoning ropes. Those hanging lamps which were not already extinguished swu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3028","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
