{"id":107148,"no":13,"title":"Page 13","content":"We can get to Paris and have enough left for hotels and food and stuff for maybe a week. But I don\u0027t know if we\u0027ll have enough to get back. If Nellie finds out -- \"\n \"Let\u0027s worry about that when we get there,\" Amy said. And she ran to the car, already taking her passport out of her back pocket.\n CHAPTER 10\n Alistair Oh was just leaving customs when his enemies ambushed him.\n \"Bonjour, Uncle.\" Ian Kabra appeared on his right. \"Have a good flight?\"\n Alistair turned to the left but Natalie Kabra cut off his escape.\n \"I wouldn\u0027t try to get away, Uncle Alistair,\" she said sweetly. \"It\u0027s amazing how many weapons I can carry through an airport.\"\n She held up a china doll in a blue satin dress. Natalie was too old to be carrying something like that, but no doubt she could charm the security guards into thinking otherwise.\n \"What is that?\" Alistair asked, trying to stay calm. \"A gun? A bomb?\"\n Natalie smiled. \"I hope you don\u0027t have to find out. It would be quite messy.\"\n \"Keep walking, Uncle.\"\n Ian put as much sarcasm into the word as possible. \"We don\u0027t want to arouse suspicion.\"\n They strode through the terminal. Alistair\u0027s heart pounded. He could feel the Poor Richard\u0027s Almanack in his jacket pocket, slapping against his chest with every step.\n \"So,\" Alistair said. \"When did you get in?\"\n \"Oh, we took our own jet,\" Ian said. \"We use a private airstrip where the security is much more ... relaxed. We just thought we\u0027d come welcome you!\"\n \"How nice,\" Alistair said. \"But I don\u0027t have anything you want.\"\n \"That\u0027s not what we\u0027ve heard,\" Natalie said. \"Hand over the book.\"\n Alistair\u0027s throat went dry. \"How ... how could you possibly know -- \"\n \"News travels fast,\" Natalie said. \"We have informants -- \"\n \"Natalie,\"\n Ian snapped. \"I\u0027ll do the talking, thank you very much. You hold the doll.\"\n She scowled, which made her face not nearly as pretty. \"I can talk if I want to, Ian! Mother and Father said -- \"\n \"Blast what they said! I\u0027m in charge!\"\n Natalie looked ready to yell back at him, but she swallowed her rage. Alistair didn\u0027t like the tight grip she was keeping on her doll. He imagined the thing must have a trigger somewhere, and he didn\u0027t want to find out what it did.\n \"Surely you don\u0027t want another war between our branches,\" Alistair said, trying to sound diplomatic.\n \"One phone call and I can mobilize help from Tokyo to Rio de Janeiro.\"\n \"As can we,\" Ian said. \"And I\u0027ve read my family history, Alistair. The last time our branches fought, it didn\u0027t go very well for your lot, did it?\"\n Alistair kept walking, thinking hard. A gendarme was standing by a security checkpoint up ahead -- about twenty meters. If Alistair could create a distraction...\n \"The 1908 explosion in Siberia,\" he said to Ian. \"Yes, that was impressive. But we have more at stake this time.\"\n \"Exactly,\" Ian agreed. \"So hand over the book, old man, before we have to hurt you.\"\n Natalie laughed. \"If you could hear yourself, Ian. Honestly.\"\n Her brother frowned. \"Excuse me?\"\n Five meters to the gendarme,\n Alistair thought.\n Stay calm.\n \"Oh, nothing,\" Natalie told her brother airily. \"Just that you\u0027re a terrible bore. Without me, you couldn\u0027t even frighten this pathetic old man.\"\n Ian\u0027s expression hardened. \"I most certainly could, you useless little -- \"\n Natalie stepped in front of Alistair, intent on confronting her brother, and Alistair saw his chance. He stepped backwards, then sideways, and before the Kabras could regroup, Alistair was standing next to the gendarme, talking as loudly as he could in French.\n \"Merci, niece and nephew!\" he shouted at the Kabras. \"But your parents will be worried. Run along now, and tell them I\u0027ll be out in a few moments. I have some questions for this officer. I may have forgotten to declare my fresh fruits in customs!\"\n \"Fresh fruits?\" the officer said. \"Sir, that\u0027s very important. Come with me, please!\"\n Alistair shrugged apologetically to the Kabras. \"You must excuse me.\"\n Ian\u0027s eyes were so angry they looked like they might catch fire, but he managed a stiff smile. \"Of course, Uncle. Don\u0027t worry. We will definitely catch you later. Come, Natalie.\" He said her name through clenched teeth. \"We have to talk.\"\n \"Ow!\" She yelped as he gripped her arm, but he herded her down the hallway and out of sight.\n Alistair sighed with relief. He followed the gendarme gratefully back to customs, where after twenty minutes of questions and searching bags, Alistair realized -- quelle surprise! -- he did not have any fresh fruit in his luggage after all. He pretended to be a confused old man, and the irritated customs official let him go.\n Back in the terminal, Alistair allowed himself a smile. Ian and Natalie Kabra may have been deadly opponents, but they were still children. Alistair would never let himself be outfoxed by youngsters like them -- not when his own future and the future of his branch were at stake.\n He patted the Poor Richard\u0027s Almanack, still safe in his jacket pocket. Alistair doubted any other team knew more about the thirty-nine clues than he did. After all, he\u0027d been spying on Grace for years, learning her purpose. There was still a lot he didn\u0027t understand -- secrets he hoped Grace had given to her grandchildren. But soon he would find out.\n He was off to an excellent start. He now understood the true meaning of the first clue:\n Richard S___\u0027s RESOLUTION. He had to chuckle about that. Even Amy and Dan had failed to see what it really meant.\n He made his way through the terminal, keeping his eyes open for the Kabras, but they seemed to have vanished. He got outside and was dragging his bags toward the taxi stand when a purple van pulled up to the curb.\n The side door rolled open. A cheerful male voice said, \"Hey, there!\"\n The last thing Alistair Oh saw was a large fist hurtling toward his face.\n CHAPTER 11\n After getting through customs at Charles de Gaulle Airport, Amy felt like she\u0027d just lost a fight with a tornado.\n She\u0027d endured eight hours on the plane, wedged between Dan and Nellie, who both kept their headphone volume too loud. Dan watched movies. Nellie listened to music and flipped through French cookbooks with full-color pictures of snails and goose livers. Meanwhile, Amy tried to make herself small and read her own books. She\u0027d picked up six new ones in Philadelphia, but she\u0027d only managed to finish one Benjamin Franklin biography and two Paris guidebooks. For her, that was terrible. Every muscle in her body ached. Her hair was a rat\u0027s nest. Her clothes smelled like airplane lasagna, which Dan had spilled on her mid-flight. Worst of all, she hadn\u0027t gotten any sleep, because the more she read, the more an idea had started to form in her head about Franklin and Paris -- and the idea scared her.\n In the customs line, she was sure she was going to lose it when the official asked about her parents, but\n she muttered the lie Dan and she had rehearsed -- that their parents were coming over on a later flight. Nellie\u0027s presence seemed to reassure the official, especially when Nellie started answering his questions in French. The official nodded, stamped their passports, and let them through.\n \"Nellie!\" Dan said. \"You speak French?\"\n \"Duh. My mom taught French. She was, like, French.\"\n \"I thought your family was from Mexico City.\"\n \"That\u0027s my dad. I grew up trilingual.\"\n \"That\u0027s amazing,\" Amy said. She was really jealous. She wished she knew other languages, but she was hopeless at learning them. She couldn\u0027t even remember the colors and numbers from kindergarten Spanish.\n \"It\u0027s no big deal,\" Nellie assured them. \"Once you know two languages, learning three or four or five is easy.\"\n Amy wasn\u0027t sure if she was serious, but they kept going through customs. They reclaimed their bags, changed their dollars into euros at a kiosk, and straggled onto the main concourse.\n Amy felt completely lost with all the French signs. Morning light slanted through the windows, though it felt like midnight to her. Down the hall, a crowd was gathering.\n People were flashing cameras and shouting questions at somebody Amy couldn\u0027t see.\n \"Oh, paparazzi!\" Nellie said. \"Maybe it\u0027s, like, Kanye West!\"\n \"Wait!\" Amy said, but Nellie wasn\u0027t going to be discouraged. They pushed through the crowd with a lot of excusez-mois.\n As they got closer, Amy stopped in her tracks. \"Jonah Wizard.\"\n He was wading through the mob, signing autographs, while his dad trailed behind like a bodyguard. Jonah wore baggy jeans, a black leather jacket over a white tank top, and his standard half ton of silver jewelry. He looked fresh and well-rested, like his flight had been a lot better than Amy\u0027s.\n \"Le Wizard!\"\n The reporters peppered him with questions. To Amy\u0027s surprise, Jonah answered them in French.\n There were so many people Amy wanted to melt into the walls, but Jonah looked relaxed. He gave the crowd a brilliant smile and said something that made them laugh, then scanned the faces and locked eyes with Amy.\n \"Yo!\" he called. \"My peeps!\"\n Amy was mortified. Jonah started pushing his way toward them and the whole crowd turned to figure out who he was talking to.\n \"Oh, no way,\" Nellie said. \"You know Jonah Wizard?\"\n \"We\u0027re related to him,\" Dan grumbled. \"Distantly.\"\n Nellie looked like she was going to faint. Suddenly, Jonah was right in front of them, shaking Amy\u0027s hand and patting Dan on the back and signing Nellie\u0027s T-shirt, and the cameras started taking pictures of them.\n Don\u0027t look at me!\n Amy wanted to scream.\n I\u0027m covered with lasagna!\n Her voice didn\u0027t work. She tried to back away but her legs were frozen.\n \"Jonah!\" his father said. \"We should get going.\"\n \"Yeah, sure.\" Jonah winked at Amy. \"Come with, cuz. We got stuff to talk about.\"\n Jonah\u0027s dad started to protest, but Jonah put his arm around Amy and steered her through the terminal, with Dan and Nellie and a mob of frantic paparazzi behind them, flashing pictures. Amy was sure she would die from embarrassment any second, but somehow they made it outside. The day was warm and overcast. Storm clouds were gathering on the horizon. A black limousine waited at the curb.\n \"We -- we shouldn\u0027t,\" Amy started to protest. She remembered Mr. McIntyre\u0027s warning: Trust no one.\n \"Are you kidding?\" Nellie said. \"A limo ride with Jonah Wizard? Come on!\" She practically dove into the limo. A few minutes later, they were gliding down Vautoroute de Vest toward the heart of Paris.\n \"Man, I love this town,\" Jonah said.\n His limo had facing backseats. Jonah and his dad sat on one side. Amy, Dan, and Nellie sat on the other. Jonah\u0027s dad typed notes on his BlackBerry, every once in a while looking up and scowling at Amy, like he couldn\u0027t believe she was still there.\n Outside, rows of gold stone buildings glided by, their windows overflowing with flower boxes. The cafés were crowded with people, all the chairs facing the street like they were waiting for a parade. The air smelled like\n coffee and baked bread. The cloudy skies gave everything a weird light -- as if the city weren\u0027t quite real. \n","sourceLink":"https://allnovel.net/the-maze-of-bones-the-39-clues-1/page-13.html","bookId":1546,"book":{"id":1546,"title":"The Maze of Bones ( The 39 Clues #1)","description":"Storyline: \n The Maze of Bones (The 39 Clues #1) \n Minutes before she died Grace Cahill changed her will, leaving her decendants an impossible decision: You have a choice - one million dollars or a clue. \n Grace is the last matriarch of the Cahills, the world\u0027s most powerful family. Everyone from Napoleon to Houdini is related to the Cahills, yet the source of the family power is lost. 39 clues hidden around the world will reveal the family\u0027s secret, but no one has been able to assemble them. Now the clues race is on, and young Amy and Dan must decide what\u0027s important: hunting clues or uncovering what REALLY happened to their parents.\n \n","cover":"https://allnovel.net/images/the-maze-of-bones-the-39-clues-1.jpg","author":"Rick Riordan","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-maze-of-bones-the-39-clues-1.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 11:03:02 PM"}}
