{"id":9947,"no":6,"title":"CHAPTER V. THE SELVAGE EDGE OF CIVILIZATION.","content":"O UR next act in the drama before us begins with the foot-lights still turned down low, for another night scene is to be enacted. It is the new township of Ulysses. Some six or seven thousand miners are crowding into the one long, irregular street of a new Queensland “gold rush” township. For it is the night of the week,—pay-day night; with Sunday for an idle to-morrow on which to get sober. The new field of Ulysses—some sixty miles from the famous copper mines of Reid’s Creek—is, like many of the later Queensland gold fields which have been within an easy distance of railway communication with the coast, quite a different affair to the old rushes of an earlier date, or even the modern Croydens and Kimberleys of the far north. As such it is worth sketching. Rapid means of transportation, cheap fares,34 and double-leaded notices in the daily southern papers have brought hosts of town-bred men and boys to compete with the professional miner. The difference between these two classes of workers is immense. Now the reader can take it as a gospel truth that of the various classes of men who earn their bread with the sweat of their brow, those who follow the profession of the practical miner are amongst the noblest specimens of humanity. Mind you, we do not mean the labourers, who, by hundreds, earn their 6s. to 10s. per day in the great Wyndham “stopes” or upon the hot “benches” of Mount Morgan. Nor do I intend you to mistake for the real article the half digger, half speculator, who haunts the grog-shanties at night, and spies for chances to make some “unearned increment” from the whisky-wagging tongues of the true workers on the field. The professional jumper of claims too, who figures more often in the Warden’s court than the “m drives” and “cross-cuts” of the field, is another individual that no one experienced in mining camps would long mistake for a bona fide Queensland miner. Watch the latter at his work. Look at him toiling over perhaps hundreds of miles of semi-desert to the dreary, flat waste, covered with stunted box or quinine trees, where the white quartz glares back at the red-hot sun across the dusty plain. Burnt by the scorching heat all day; watching midst the dangers of desperate starving natives, poisonous snakes, and unguardable fever all night; thankful if he can fill and boil his pint pot three times a day with the foul drink that goes by the name of water in the interior,—he toils on to the golden goal. 35 Once there, his active brain and stalwart arms send the stunted forest reeling with flashing axe-strokes. The mushroom village of blue-gum bark and branches springs up in a purple-brown crop around the red and yellow trenches, and “whips” and “poppet heads” rise in due course. Geologist, mineralogist, carpenter, blacksmith, hunter, surgeon, and cook, the true prospecting and working miner, who has “followed the diggings” since the Canoona rush or the Palmer field excited the mining world, is a veritable Admirable Crichton. He is a true, iron-bound, walking edition of practical receipts. Open-handed when “on a patch;” frugal and level-headed when a “slide” or “fault” has taken his golden “leader” out of sight; quick to take offence at an intentional insult, and as quick to “Put your hand there, pard,” if in the wrong,—this character may be summed up in the expressive words used by a miner to us, when describing a brother of the pick: “He’d lend you a fiver if you harsked him, and he’d fight you for a bob if he thought it b’longed to him.” The “towneys,” as I have hinted, muster very strong at Ulysses, and as a consequence the rowdy element swamps the steady miners, such as we have just described, right out of sight. The Warden of the new field has only just arrived, and is toiling night and day to arrange affairs into workable form out of the chaos of matters before him. He is “underhanded,” to use a nautical expression, as is always the case, and is powerless to act, as he could and would act, were he not—besides being Police Magistrate, Warden, Senior-constable Surveyor, Clerk36 of Petty Sessions, etc., etc.—also general adviser to the field upon every conceivable subject. Let me draw you a rough outline sketch, in black and white, of a “pay-day Saturday night” at Ulysses. The long, straggling collection of dwellings, that has not yet crystallized into a town proper, and which is now emerging from the “bark-humpy” to the “iron” age, begins to look more lively than ever, as evening with its lighted windows and moving lanterns shows that business is commencing with the influx of miners from the surrounding claims. Troops of “larrikins,” who think, because they wear muddy clothes and get drunk, they must be rough-and-ready miners, begin to perambulate the muddy street, in a state of body more or less bordering upon intoxication. Crowds of picturesquely-rough characters now collect round the gaming-tables, shooting-tables, and other attractions, over and around which flare great oil lamps, minus shade or glass. Every shot, every throw of the dice, every action of every actor upon the busy scene, gives rise to strings of filthy oaths,—so profane, so disgusting, that to any one but a man long acclimatised to them a feeling of extreme nausea would result. Darker grows the evening and larger the crowd; oaths, blasphemy, and yells that would make a Red Indian blush with envy hurtle through the hot, close night air. Wilder grows the feverish excitement, born of bad whisky and worse beer, till, words growing tame, blows are resorted to. A curious and interesting if disgusting spectacle is Ulysses on a Saturday night. All around are wretched creatures wallowing in the much-trampled mud, like so many spirit-preserved37 beings,—half hog, half man. From the open door and windows of the foul-smelling, brilliantly-lighted “shanty” just at hand, a Babel of filthy and excited language roars and roars, as if an opening to “the murky pit” were close by, and the voices of the damned had reached our ears. Crowds of men and boys jostle each other as they pass amidst the flaring lights and dusky shadows of the much-peopled ways, and near us a couple of tipsy, blear-eyed rowdies are doing the only useful thing they have done this day, in attempting to destroy each other with fist, foot, and teeth. Round them a vile crowd, mostly composed of lanky, big-piped, beardless, weakly-looking, youthful, would-be miners are exchanging bets, in language as idiotic as obscene. Darker grows the night and later the hour; the majority of the crowd are either reposing in the mud or have staggered to their tents and “humpies,” out of reach of the robbers, male and female, who begin to slink about, like those horrible beings who haunt the fields of battle to prey upon the spoils of the honoured dead. Woe betide the sinner who lies down to sleep off his drunken fit in an Ulysses street after sundown if he has money upon him. The main “street” is now abandoned by the gamblers, three-card-trick men, and other blacklegs of like nature, and now wretches, who disgrace the name of white men, and who would never have dared to show themselves upon the older fields of the colony, are to be seen offering miserable, frightened native women to the loafers round the “shanties.” One o’clock comes, and only select parties of soakers still make night hideous with their songs. 38 Outside the “gins” (native women), drunken and howling, are screaming out obscene remarks to each other and passers-by in broken English; and scenes take place that make the observer almost fancy himself viewing one of those horrible December orgies of Ancient Rome, rather than a scene in a civilized township of an English colony. But let us ring up a change of scene. In another part of the embryo township, a few hundred yards along the main “street,” the Queensland Federal Banking Company has erected a small, curiously-constructed edifice of galvanised iron and sheets of bark. Competition is immense amongst the Queensland banking concerns to establish the first branch upon a new gold-field. On a new “rush” taking place, information as to the likelihood of its turning out a “wild cat” (or failure) or not is obtained as rapidly as possible. The manager at the nearest township receives a wire from the head office; and next morning some unhappy wight, who likely enough has just been married, or was to have taken unto himself a wife in a few days, is ordered off at perhaps two hours’ notice to administer to the commercial comfort of the rough selvage of humanity at Devil’s Gap, or Three Gin Gulch, five hundred miles from anywhere, and situated in a dreary desert. He starts actually not knowing what part of the country he is going to, till he opens his sealed instructions at the railway station or wharf. The remarkable little building to which we have referred is about the size of a ticket-taker’s office at a small theatre. Upon its front elevation, and overhanging it at each end, hangs a wooden-framed sheet39 of linen, upon which is painted the name of the bank whose branch it is. But we must go behind the bank-buildings to where stands the “most desirable residence” upon the field. It is a travelled house this; and has seen more than one “rush” before. With tongued and grooved sides screwed securely to studs and plates, the house can be taken to pieces and removed a few hundred miles by a bullock team, and put up again, not much the worse for wear. It is like rising from the lower regions to that “ethereal beyond,” which is the appointed permanent location, so say the poets, of all “good niggers,” to leave behind the scenes we have just described, and saunter up to the quiet deserted end of the town, and hear through the darkness the chinkle chankle of a real piano. Through the windows we catch a glimpse of a lady (the only one within, perhaps, a hundred miles), in a cool, white dress, indulging her husband, the bank manager, and a few select sojourners upon the field, with the latest waltz from Melbourne. Inside the cottage—which stands on wooden blocks, surmounted with snake-and-ant-foiling tin plates—are seated some half-dozen men, listening to the music and chatting by turns. All are dressed in white, with crimson or yellow sashes round their waists, save one,—a new “chum,” lately from Albion’s cooler climes, whose idea of what is due to the lady of the “house” makes him appear in a suit of dark tweed, as the nearest approach to evening dress his travelling baggage can afford him. The conversation, as the piano ceases its rather raspy vibrations, reopens upon a subject that had commenced to be discussed earlier 40 in the evening,—the treatment of the aborigines by the settlers. “Yes, it must appear strange to you,” says a dark-eyed, brown-haired man, leaning back in his cane-chair, and looking at the ceiling of unpainted canvas, “it must appear to you rather strange that such scenes can occur in what people are pleased to call a Christian land. But remember, my dear Mr. Jolly, you are a ‘new chum,’ and don’t understand our ways yet.” After a pause he continued: “I was one myself once, by Jove.” “If you mean by a ‘new chum,’” replied the young gentleman rather hotly,—whose appearance in dark clothes has already attracted our attention,—“if you mean by that, that I’m an Englishman, I’m only too glad to acknowledge——” “Now don’t fall out, you two boys,” roars a big, burly, perspiring, jolly-faced, elderly man, who is sitting by the open window, “it’s much too hot to quarrel. Morton’s only trying to get a rise out of you. All new-comers here talk like you do at first. Now as I’m a little bit older than you are, Mr. Jolly, I’ll just give you a friendly bit of advice. Don’t take offence, if I say you are airing your opinions in an incautious manner. You ought to allow that we ‘old chums’ know more about the way to treat the niggers than you can. You raise,” continued the speaker, who is the pushing proprietor-editor of the new-born local gazette, ladling an ant out of his glass of lager-beer, “you raise the old indictment of wholesale slaughter of the black population by the white Christians who have seized upon their lands. It is the ancient story of midnight murder, treachery,41 bloodshed, hypocrisy, cruelty, and immorality, which has been told in every land where the Englishman——” “I deny that,” interrupts Mr. Jolly. “Well, to please you,—the, er, European has come in contact with and dispossessed a feeble population. The men by whom these outrages,—confound the brute! (this to a gecke, or climbing lizard, that has fallen off the ceiling on to the speaker’s pate),—the men by whom these outrages are perpetrated are members of that race which, with all respect for Mr. Jolly’s favourable and patriotic opinions of his countrymen, claims to be the protector of the oppressed all the world over; and the tale of their atrocities is identical with the tales which—when the scene was laid in Bulgaria instead of Australia—roused the whole Anglo-Saxon race to an outburst of virtuous wrath and holy reproach. It is a story, on a smaller scale,” continued the speaker, taking a fresh cigar from a box near him and lighting it, “on a smaller scale, of India over again.” “No!” jerks out the dark-coated youth. “But it is,” snaps Mr. Editor-Proprietor. “The tragedy which the British alleged Christian enacted in Jamaica, Burmah, Egypt, and a hundred other scenes of massacre, and which the same snuffling Christian will continue to enact so long as he is strong enough to kill, and some one else is weak enough to be killed——” Here the speaker paused, and, taking a glass of lager at a gulp, spat out of the window, and looked round, cigar in mouth, at the young man who had been the cause of his lengthy speech. “Well, you surprise me, Mr. Brown,” says the 42 latter, in answer to that gentleman’s stare, “and that’s all I’ll say further. I was prepared to find some excuses presented for such atrocities, as, for example, hot-blood, revenge, etc., but not on the lines you have laid down. You will excuse me if I take your remarks to mean that you are expressing your constituents’ opinions, not your own, when you say that no man would attempt to protect the helpless, unless he had selfish motives in view, or was a fool.” Swinging round on her chair at the piano, the pretty, little, fragile hostess, who is a young woman of twenty, but who looks at least twenty-five years old, eyes the debaters with an amused and rather satirical face. “Well,” she says, interrupting the somewhat heated conversation, making a pretty little moue, “what’s the good of talking about those horrid blacks? Augh! I hate them. And I ought to know, for I’m a squatter’s daughter; and my father had to shoot more niggers when he first took up the Whangaborra country than any man in Queensland has.” The young black-coated philaboriginist turns his head, and looks with mute wonder at the fair young advocate of human slaughter. “What’s wanted here is a Black war like they had in Tasmania,” continues the fair pianist. “Wait till you’ve been amongst our squatters awhile, and you won’t think more of shooting a nigger than of eating your tucker.” The speaker laughs a silvery little laugh, and all her audience, save one, smile in acquiescence. “What are the blacks? They’re only horrid thieves, and are worse than wild animals, and murdered43 poor old Billy Smith, only a couple of weeks ago, at Boolbunda.” “Yes,” growls a stern-faced man with dark hairy face and coal-like eyes, a mine manager on the Mount Rose line of reef, “and many’s the time I said to Billy, ‘They’ll close in on you, my boy, some day.’ How he used to laugh when I told him he oughter carry a shooting-iron! ‘They know me too well,’ he’d say, ‘and this too,’ and he’d clap his hand on his coiled-up stockwhip on the saddle. ‘Many’s the yard of black hide I’ve taken off with my bit of twist here.’ But they got him at last, the black devils! Poor Billy; he was a rough sort, but he was true as a level, was Billy.” “Did they send the ‘boys’ out?” drawls out a languid youth, who has been silent so far. “Yes, rather!” answers the bright little hostess, with a curious steely gleam in her grey eyes, clasping her tiny hands together on her lap, as a child does when excited with delight or anticipated pleasure. “Yes, rather! Inspector Puttis, my cousin, you know, was at Gilbey’s station at the time when the news came in. And you bet he gave them a lesson they won’t forget in a hurry.” “Did he catch the murderers?” asks the unfortunate Mr. Jolly innocently, immediately wishing, on noticing the half-hidden sneer on all the faces present, that he had kept quiet. “Catch the murderers?” the little lady in white repeats, with a grin that spoils for the instant her pretty face. “No, indeed. We don’t go hunting round with sleepy Bobbies here, and summonses and such rubbish.” A murmur of applause rises from 44 the cigar-holding lips of the auditors. “No! Cousin Jack I guess cleared off every nigger from the face of the earth within forty miles of the place. At least, if he didn’t, he ought to. They’re a horrid nuisance, and besides, it’s a long time since they’ve given the ‘boys’ a chance of doing anything.” The irrepressible new chum however is not satisfied. “But they’re awfully useful as servants, ain’t they?” he asks. “Yes, if they’re trained young. You saw that girl of mine, when you were pretending to admire my baby this morning.” And the fair speaker smiles a smile of great sweetness upon Mr. Jolly, as she remembers his unfeigned praise of her child. “Well, she comes from a bad lot of Myall blacks near Cairns. The police have cleared them all out now. Inspector Young gave her to me. One of his sergeants got her at a ‘rounding-up’ about three years ago, before I was married. She was only about six years old then, and had got her leg broken above the knee with a bullet. She’d have got away then, he said, but the dogs found her in a hollow log. He saved her,” continued the lady, in the same tone of voice that a sportsman’s daughter in England would have employed when speaking of one of a litter of foxhounds, “he kept the dogs off her and saved her, because she looked such a strong, healthy little animal. But all this reminds me that Jack Puttis, the Inspector, you know, said he’d call in here to-night, if he could get so far. So I’ll just go in and see about supper.” Rising, the active, fragile speaker trips away, leaving the rather stolid brain of the young Englishman slowly recovering from the shock it has received. 45 His preconceived notions—“young-man notions,” if you like—of woman as a gentler, diviner creature than man, and worthy of the worship of the ruder sex as the citadel of mercy and holiness of thought and action, have received a blow that they will never quite recover from. His thoughts flash back to a line in the “Civilization” of Emerson: “Where the position of the white woman is injuriously affected by the outlawry of the black woman,” and he feels sick and disgusted. A grave-looking young man, who has sat in silence watching the face of the heretical new chum expounder of the doctrine of Mercy, now leans forward and touches his shoulder. “It won’t do, Jolly,” he says, in a half whisper, “you really mustn’t express your ideas upon this subject. It isn’t business-like to speak of your opinion against that expressed by a possible customer. You’ll have to get case-hardened, like I had to. We ain’t in England now, and you’ll have to close your eyes and ears to much out here. A new chum is especially the object of suspicion and dislike to many of the older colonists. ‘He’s come out to reap the harvests we have sown in labour and danger,’ they say; and consequently the figurative ‘new chum’ is hated. You can ask as many questions as you like, but don’t air your opinions on such subjects as you’ve broached to-night. You’ll find the colonists hospitable if you wink at their pet vices and sins, but act otherwise, and,—they’re the very devil. Now I’ve told you the square facts, and don’t you forget it.” “Here’s Puttis!” cries the fat man by the window, at this instant; and the sound of several horses46 stamping, and the silvery jingling of bits, is soon after heard at the side of the house. Directly afterwards a small, well-made man, wearing enormous spurs (nearly a foot in length), and habilited in the semi-uniform of an Inspector of the Queensland Black Police, marches into the room. He is immediately noisily welcomed by all the men present. Mr. Jolly is, in due course, introduced to the new-comer, of whom he has heard all kinds of terrible tales since his arrival at the new township, and he cannot overcome his repugnance to the man who, he has reason to believe, is a paid butcher of defenceless women and children. He feels unable to stretch forward his hands to meet the slender white fingers extended towards him, and, pretending not to see them, bows stiffly and turns away. The bad impression he has already created is doubled in those who notice this action of the young man, and he is forthwith put down for certain as “an unmannerly, proud beggar of an Englishman.” Inspector Puttis, as he stands talking to the men (all a head or more taller than he is), has a face that would immediately attract the attention of an artist or physiognomist. The skin of the forehead and cheeks is pallid beneath the bronze of an open-air life. The “corrugator” muscles of the eyebrows are unusually well developed (a sign, according to Sir Charles Bell, of great power of thought and action combined with the savage and wild rage of a mere animal). The brows cover small, piercing, restless, blue-grey eyes, the lids of which are generally half-closed. The lips are thin, and kept tightly closed over brilliantly white teeth, 47 except when talking or smiling; when expressing the latter emotion the lips are lifted so as to expose the canine teeth, which are large. The nostrils are full and slightly raised. In conversation, the Inspector’s words come short and sharp, in brief breaths of speech; and he has an uneasy way with him, as if always on the watch and impatient of inactivity. You feel, looking at him, instinctively that before you stands a man who is as incapable of a merciful action as he is of running away from an enemy,—a sharp, active, well-drilled man, who bites before he growls, and has led a life of wild exhausting excitement and danger for some years past. His black, tight-fitting jacket (ornamented with frogs) and buckskin riding breeches fit him to perfection; his leather gaiters are splashed with mud, and a dirty straw hat—the national head-dress of Queenslanders, and called by them a “cabbage-tree”—lies by him on the table. Inspector Puttis stands chatting to the men for a few minutes, and then turns to greet the little hostess as she trips in and pays her tribute of welcome and laudation to her “cousin the Inspector.” Handing him two telegrams presently, she says,— “They came over from Nanga just after you left. As you said you’d be back I didn’t send them after you.” “Thanks, awfully, Minta. You’ll excuse me; and—er—you gentlemen. May have to start at once. To-night. Never know. Deuce take these telegrams, I say.” The little man bows an apology for opening the messages in their presence, and struts to the candle still burning on the piano, and tears open the first48 envelope. It is from the Chief-Commissioner of Police, Brisbane, and is brief and concise:— “Proceed Cairns and Georgetown, with troop, to relieve Inspector Snaffle.” “What the devil does this mean?” murmurs the police-officer to himself. Then a ghost of a smile plays over his face—a grim, half-hidden trembling of the nostrils and opening of the eyes—as he reads the second wire. It is signed “Lileth Mundella.” “Want to see you at once. Palmer will see Commissioner about it. Bad news from Sydney.” The message that the Inspector holds in his hand is from his fiancée of six months’ standing; and he smiles to himself as he thinks how lucky he is in having appropriated a girl who is clever enough to bend even the Commissioner of Police himself to her purposes. There are numbers of odd matches arranged every year, and this is one of them. Neither Inspector Puttis nor Miss Mundella, to whom we shall introduce our readers presently, have ever pretended for an instant that either of them were “soft enough” (as the lady once expressed it) to be in love with the other. The one, a dark-haired girl of the Diana type of beauty, who could carry a room full of ordinary people to her wishes with a flash of her magnificent brown eyes and a word from her haughty, firm-set mouth; the other, a determined man, who had climbed through sheer hard work (work that few would care to undertake, and, thank God, still fewer to carry out) to a good position, and from which he meant to climb still higher. 49 “We can help each other to our mutual advantage, Mr. Puttis,” Miss Mundella had said, when the preliminaries of the arrangement between them were being discussed. Although we shall introduce this young lady personally to our readers shortly, it is perhaps best to preface that ceremony by a few preliminary remarks. Miss Mundella, since returning to Australia, some five years before the date of our story, after receiving a European education at London and Paris, has resided with her uncle, a Mr. Wilson Giles. Highly educated, and with the reputation of being a large heiress, Miss Mundella, at the time she left school, was a girl whose lot in life seemed to have been cast in pleasant places. But a change came o’er the spirit of her dream. Her bright chateaux d’Espagne were rudely broken up by the unforeseen ruin of her father, and his subsequent death. This gentleman—a member of an old Jewish family in England—was a successful squatter for some years in Queensland. Suddenly, to the surprise of his friends, and the indignant anger of his relations in the old country, he married a Christian lady. A complete rupture with his own people ensued; and he shortly afterwards became nominally a member of the Church to which his wife belonged. From this period ruin seemed to dog his steps; and finally, whilst his daughter was still in Europe, a series of bad seasons placed his name upon the list of bankrupts. Overcome with the weight of his afflictions, which were suddenly added to by the loss of his wife, Mr. Mundella paid the only debt left in his power to liquidate,—that of Nature. He left two children behind him, a son50 and a daughter; to the former we have already introduced our readers, in “mufti,” in Paddy’s Market. A professional visit to the uncle’s station in Northern Queensland throws Inspector Puttis and Miss Mundella into each other’s company. The two individuals both find in the other those strongly ambitious views for the future that is their own bosom’s god. One meeting leads to others; and the arrival of Billy at the station with the deceased explorer’s letter gives Miss Mundella the opportunity of indulging in a scheme for placing herself, by means of her fiancé, in as enviable a position as that occupied by herself when she left school, as the wealthy young heiress. But we have left our friends waiting for supper and the Inspector to finish his telegrams too long, and must hurry back. The well-drilled little man offers his arm to his fair cousin, and the pair lead the way to the next room. Whilst the company are seating themselves the Inspector attracts his cousin’s attention, and whispers hurriedly,— “Will you do me a favour?” “Anything I can, Jack.” “Is it likely you’ll be stationed here for a few months?” “Yes.” “Well, a young friend of mine—a great chum. Made an awful mess of it. Hurt a man down south. Want him out of the way for a month or two. Vous savez?” “Is that all?” answers the little hostess with a gay 51 laugh. “Send him up here. If he ain’t too handsome, so as to make Bob wild, he can stop here. As for being out of the way, there’s plenty of that lying around here.” “Thanks, awfully, I’ll wire him to-morrow.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3251/89078.html","bookId":603,"book":{"id":603,"title":"The Black Police","description":"简介： STAR! Ev-en Star! Full account o the fi-re! echoes shrilly on all sides from the throats of bare-legged, paper-laden urchins, who after the manner of their kind are actively engaged in supplying the passing public of Auckland, New Zealand, with the s...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3251","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
