{"id":63014,"no":1,"title":"Page 1","content":"Chapter One\\n\\n MY NAME IS MARINA, AS OF THE SEA, BUT I WASN’T called that until much later. In the beginning I was known merely as Seven, one of the nine surviving Garde from the planet Lorien, the fate of which was, and still is, left in our hands. Those of us who aren’t lost. Those of us still alive.\\n\\n I was six when we landed. When the ship jolted to a halt on Earth, even at my young age I sensed how much was at stake for us—nine Cêpan, nine Garde—and that our only chance waited for us here. We had entered the planet’s atmosphere in the midst of a storm of our own creation, and as our feet found Earth for the very first time, I remember the wisps of steam that rolled off the ship and the goose bumps that covered my arms. I hadn’t felt the wind in a year, and it was freezing outside. Somebody was there waiting for us. I don’t know who he was, only that he handed each Cêpan two sets of clothes and a large envelope. I still don’t know what was in it.\\n\\n As a group we huddled together, knowing we might never see one another again. Words were spoken, hugs were given, and then we split up, as we knew we must, walking in pairs in nine different directions. I kept peering over my shoulder as the others receded in the distance until, very slowly, one by one, they all disappeared. And then it was just Adelina and me, alone. I realize now just how scared Adelina must have been.\\n\\n I remember boarding a ship headed to some unknown destination. I remember two or three different trains after that. Adelina and I kept to ourselves, huddled against each other in obscure corners, away from whoever might be around. We hiked from town to town, over mountains and across fields, knocking on doors that were quickly slammed in our faces. We were hungry, tired, and scared. I remember sitting on a sidewalk begging for change. I remember crying instead of sleeping. I’m certain that Adelina gave away some of our precious gems from Lorien for nothing more than warm meals, so great was our need. Perhaps she gave them all away. And then we found this place in Spain.\\n\\n A stern-looking woman I would come to know as Sister Lucia answered the heavy oak door. She squinted at Adelina, taking in her desperation, the way her shoulders drooped.\\n\\n “Do you believe in the word of God?” the woman asked in Spanish, pursing her lips and narrowing her eyes in scrutiny.\\n\\n “The word of God is my vow,” Adelina replied with a solemn nod. I don’t know how she knew this response—perhaps she learned it when we stayed in a church basement weeks before—but it was the right one. Sister Lucia opened the door.\\n\\n We’ve been here ever since, eleven years in this stone convent with its musty rooms, drafty hallways, and hard floors like slabs of ice. Aside from the few visitors, the internet is my only source to the world outside our small town; and I search it constantly, looking for some indication that the others are out there, that they’re searching, maybe fighting. Some sign that I’m not alone, because at this point I can’t say that Adelina still believes, that she’s still with me. Her attitude changed somewhere over the mountains. Maybe it was with the slam of one of the doors that shut a starving woman and her child out in the cold for another night. Whatever it was, Adelina seems to have lost the urgency of staying on the move, and her faith in the resurgence of Lorien seems to have been replaced by the faith shared by the convent’s Sisters. I remember a distinct shift in Adelina’s eyes, her sudden speeches on the need for guidance and structure if we were to survive.\\n\\n My faith in Lorien remains intact. In India, a year and a half ago, four different people witnessed a boy move objects with his mind. While the significance behind the event was small at first, the boy’s abrupt disappearance shortly thereafter created much buzz in the region, and a hunt for him began. As far as I know, he hasn’t been found.\\n\\n A few months ago there was news of a girl in Argentina who, in the wake of an earthquake, lifted a five-ton slab of concrete to save a man trapped beneath it; and when news of this heroic act spread, she disappeared. Like the boy in India, she’s still missing.\\n\\n And then there’s the father-son duo making all the news now in America, in Ohio, who the police are hunting after the two allegedly demolished an entire school by themselves, killing five people in the process. They left no trace behind other than mysterious heaps of ash.\\n\\n “It looks like a battle took place here. I don’t know how else to explain it,” the head investigator was quoted as saying. “But make no mistake, we will get to the bottom of this, and we will find Henri Smith and his son, John.”\\n\\n Perhaps John Smith, if that’s his real name, is merely a boy with a grudge who was pushed too far. But I don’t think that’s the case. My heart races whenever his picture appears on my screen. I’m gripped with a profound desperation that I can’t quite explain. I can feel it in my bones that he’s one of us. And I know, somehow, that I must find him.\\n\\n Chapter Two\\n\\n I PERCH MY ARMS ON THE COLD WINDOWSILL AND watch the snowflakes fall from the dark sky and settle on the side of the mountain, which is dotted with pine, cork oak, and beech trees, with patches of craggy rock mixed throughout. The snow hasn’t let up all day, and they say it will continue through the night. I can barely see beyond the edge of town to the north—the world lost in a white haze. During the day, when the sky is clear, it’s possible to see the watery blue smudge of the Bay of Biscay. But not in this weather, and I can’t help but wonder what might lurk in all that white beyond my line of sight.\\n\\n I look behind me. In the high-ceilinged, drafty room, there are two computers. To use one we must add our name to a list and wait our turn. At night there’s a ten-minute time limit if somebody is waiting, twenty minutes if there isn’t. The two girls using them now have been on for a half hour each, and my patience is thin. I haven’t checked the news since this morning when I snuck in before breakfast. At that time nothing new about John Smith had been reported, but I’m almost shaking in anticipation over what might have sprung up since then. Some new discovery has been uncovered each day since the story first broke.\\n\\n Santa Teresa is a convent that doubles as an orphanage for girls. I’m now the oldest out of thirty-seven, a distinction I’ve held for six months, after the last girl who turned eighteen left. At eighteen we must all make the choice to strike out on our own or to forge a life within the Church. The birthday Adelina and I created for me when we arrived is less than five months away, and that’s when I’ll turn eighteen, too. Of all who’ve reached eighteen, not a single girl has stayed. I can’t blame them. Like the others, I have every intention of leaving this prison behind, whether or not Adelina comes with me. And it’s hard to imagine she will.\\n\\n The convent itself was built entirely of stone in 1510 and is much too large for the small number of us who live here. Most of the rooms stand empty; and those that aren’t are imbued with a damp, earthy feel, and our voices echo to the ceiling and back. The convent rests atop the highest hill overlooking the village that shares the same name, nestled deep within the Picos de Europa Mountains of northern Spain. The village, like the convent, is made of rock, with many structures built straight into the mountainside. Walking down the town’s main road, Calle Principal, it’s impossible not to be inundated by the disrepair. It’s as though this place was forgotten by time, and the passing centuries have turned most everything to shades of mossy green and brown, while the pervasive smell of mildew hangs in the air.\\n\\n It’s been five years since I started begging Adelina to leave, to keep moving like we were instructed to. “I’m going to be getting my Legacies soon, and I don’t want to discover them here, with all of these girls and nuns around,” I’d said. She had refused, quoting La Biblia Reina Valera that we must stand still for salvation. I’ve begged every year since, and every year she looks at me with blank eyes and talks me down with a different religious quote. But I know my salvation does not lie here.\\n\\n Past the church gates and down the gently sloping hill, I can see the faint dimness of the town lights. In the midst of this blizzard, they look like floating halos. Though I can’t hear the music from either of the two cantinas, I’m sure both of them are packed. Aside from those, there is a restaurant, a café, a market, a bodega, and various vendors that line Calle Principal most mornings and afternoons. Towards the bottom of the hill, on the southern edge of town, is the brick school we all attend.\\n\\n My head snaps around when the bell dings: prayers are five minutes away, followed directly by bed. Panic sweeps through me. I have to know if anything new has been reported. Perhaps John’s been caught. Perhaps the police have found something else at the demolished school, something originally overlooked. Even if there’s nothing new at all, I have to know. I’ll never get to sleep otherwise.\\n\\n I fix a hard stare on Gabriela García—Gabby for short—who sits at one of the computers. Gabby’s sixteen and very pretty, with long dark hair and brown eyes; and she always dresses slutty when she’s outside the convent, wearing tight shirts that show off her pierced navel. Every morning she dresses in loose, baggy clothes, but the second we’re out of sight of the Sisters she removes them, revealing a tight, skimpy outfit underneath. Then she spends the rest of the walk to school applying makeup and redoing her hair. It’s the same with her four friends, three of whom also live here. And when the day ends, they wipe their faces clean during the walk back and re-dress in their original clothes.\\n\\n “What?” Gabby asks in a snotty voice, glaring at me. “I’m writing an email.”\\n\\n “I’ve been waiting longer than ten minutes,” I say. “And you’re not writing an email. You’re looking at guys with their shirts off.”\\n\\n “So what? Are you gonna tell on me, tattletale?” she asks mockingly.\\n\\n The girl beside her, whose name is Hilda but who most kids in school call La Gorda—“the fat one”—(behind her back, never to her face) laughs.\\n\\n They’re an inseparable pair, Gabby and La Gorda. I bite my tongue and turn back to the window, folding my arms across my chest. I’m seething inside, partly because I need to get on the computer and partly because I never know how to respond when Gabby mocks me. There are four minutes left. My impatience segues to full-on desperation. There could be news right now—breaking news!—but I have no way of knowing because these selfish jerks won’t give up one of the computers.\\n\\n Three minutes left. I’m nearly shaking with anger. And then an idea pops into my head, and a grin plays across my lips. It’s risky, but worth it if it works.\\n\\n I pivot just enough to see Gabby’s chair in my peripheral vision. I take a deep breath and, focusing all my energy on her chair, use my telekinesis to jerk it to the left. Then I quickly thrust it right so hard it nearly topples over. Gabby jumps up and yelps. I look at her in mock surprise.\\n\\n “What?” La Gorda asks.\\n\\n “I don’t know; it felt like somebody just kicked my chair or something. Did you feel anything?”\\n\\n “No,” La Gorda says; and as soon as the word is uttered, I move her chair a few centimeters backwards, then jerk it to the right, all the while remaining at my spot by the window. Both of the girls scream this time. I thrust Gabby’s chair, then La Gorda’s again; and without giving their computer screens a second glance, they flee the room, screaming as they go. \\n\\n","sourceLink":"https://allnovel.net/the-power-of-six-lorien-legacies-2/page-1.html","bookId":1676,"book":{"id":1676,"title":"The Power of Six (Lorien Legacies #2)","description":"Storyline: The Power of Six (Lorien Legacies #2) \\n I\u0027ve seen him on the news. Followed the stories about what happened in Ohio. John Smith, out there, on the run. To the world, he\u0027s a mystery. But to me . . . he\u0027s one of us. \\n Nine of us came here, but sometimes I wonder if time has changed us—if we all still believe in our mission. How can I know? There are six of us left. We\u0027re hiding, blending in, avoiding contact with one another . . . but our Legacies are developing, and soon we\u0027ll be equipped to fight. Is John Number Four, and is his appearance the sign I\u0027ve been waiting for? And what about Number Five and Six? Could one of them be the raven-haired girl with the stormy eyes from my dreams? The girl with powers that are beyond anything I could ever imagine? The girl who may be strong enough to bring the six of us together? \\n They caught Number One in Malaysia. \\n Number Two in England. \\n And Number Three in Kenya. \\n They tried to catch Number Four in Ohio—and failed. \\n I am Number Seven. One of six still alive. \\n And I\u0027m ready to fight.\\n","cover":"https://allnovel.net/images/the-power-of-six-lorien-legacies-2.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-power-of-six-lorien-legacies-2.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:49:18 AM"}}
