{"id":63058,"no":45,"title":"Page 45","content":"“Head north,” I say. “I think north would be good.”\n “You got it, boss.” Nine steps on the gas and I look over at Bernie Kosar, who has curled up and fallen asleep.\n We bury Héctor’s body at the bottom of the dam, where the white concrete meets the grass.\n “He once told me that the key to change is letting go of fear,” I say, looking into the eyes of Ella, Crayton and Six. “I don’t know if I’ve let go of fear just yet, but the change is happening. It’s definitely happening. And I can only hope that you all can help me through it.”\n “We’re a team,” Ella says. “Of course we will.”\n After we say our good-byes, we climb the dam’s ladder. We stand on top of the dam, peering down into the valley and the lake. On the other side of the dam is a series of locks holding back a much larger lake, and I can’t help but think it’s a metaphor for the way I’m feeling right now. In front of me lies my past, small and distant and dotted with carnage, threatened to be flooded at any time. Behind me and my fellow Garde members, the future is massive and held back by unnatural forces.\n I turn to Six and ask, “Do you know a John Smith in Ohio? Is he one of us?”\n Her smile is wide. “I do know John. He’s Number Four.”\n I reach for Ella’s hand on my right and Six’s on my left, and we stand there letting the mountain breeze whip our hair around our faces. Ella looks over at Six and asks, “Can we go to America?”\n “The charm is broken. I don’t see why we can’t all be together now.” Six shrugs, turning back to the lake below.\n Crayton joins us. “I hate to say this, but it’s the calm before the storm, ladies. We’re winning far too many battles for them to ease up now. You’re getting too strong for them, and they’ll be throwing everything they have at you. No more small armies with a few hundred soldiers and a couple of clumsy beasts. Their ruler will be here soon. Setrákus Ra.”\n “Who?” I ask.\n “Setrákus Ra.” Crayton shakes his head. “And I don’t think we’re ready for him.”\n “Then it’s settled,” I say. “We’re going to Ohio to be with John Smith.”\n “West Virginia, actually. In exactly two weeks,” Six says.\n “I’m not sure that’s wise just yet.” Crayton begins walking away. “We need to gather the others first.”\n Six walks after him. “That sounds good and all, but I have no idea where they are.”\n “I do,” Crayton says, not turning around. “I also know where our Chimæras are. If Setrákus Ra thinks this is going to be easy, he’s got another thing coming.”\n We follow him, taking the first of many steps down the opposite side of the dam. \n","sourceLink":"https://allnovel.net/the-power-of-six-lorien-legacies-2/page-45.html","bookId":1676,"book":{"id":1676,"title":"The Power of Six (Lorien Legacies #2)","description":"Storyline: \n The Power of Six (Lorien Legacies #2) \n I\u0027ve seen him on the news. Followed the stories about what happened in Ohio. John Smith, out there, on the run. To the world, he\u0027s a mystery. But to me . . . he\u0027s one of us. \n Nine of us came here, but sometimes I wonder if time has changed us—if we all still believe in our mission. How can I know? There are six of us left. We\u0027re hiding, blending in, avoiding contact with one another . . . but our Legacies are developing, and soon we\u0027ll be equipped to fight. Is John Number Four, and is his appearance the sign I\u0027ve been waiting for? And what about Number Five and Six? Could one of them be the raven-haired girl with the stormy eyes from my dreams? The girl with powers that are beyond anything I could ever imagine? The girl who may be strong enough to bring the six of us together? \n They caught Number One in Malaysia. \n Number Two in England. \n And Number Three in Kenya. \n They tried to catch Number Four in Ohio—and failed. \n I am Number Seven. One of six still alive. \n And I\u0027m ready to fight.\n \n","cover":"https://allnovel.net/images/the-power-of-six-lorien-legacies-2.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-power-of-six-lorien-legacies-2.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:49:18 AM"}}
