{"id":44272,"no":3,"title":"CHAPTER III","content":"Mrs. Elles took a ticket for London. The train was due to leave in ten minutes. She was out of breath and felt the compromising colour mounting to her cheeks under her thick white veil. The young poet was on the platform, apparently seeing Miss Drummond off. Ph?be Elles smiled at the little love drama here developing. It would have been hers to further it if she had been staying at home, for she was a born matchmaker with a very kind heart and dearly loved helping people, from a variety of motives. But for the moment she had something else to do. She got quickly into her carriage. The poet had glanced at her, but had, of course, soon averted his gaze from such an uninteresting object as the pretty Mrs. Elles now presented. Atalanta Drummond was probably only going as far as Darlington, where, as everybody knew, she had relations. But still her presence in the same train was a dangerous and delightful fact. Mrs. Elles felt all the exhilaration of a superior criminal evading the pursuit of justice and forthwith planned to play an exciting game of hide-and-seek with her unwitting fellow-traveller. She would man?uvre the most carefully-arranged, hair-breadth escapes from the unconscious pursuer. How nice it was to be running{48} away, so to speak, and how it at once removed everything from the region of the commonplace! She got out of her carriage at Darlington, and looked about the great station. She was one of those persons in whom the mere sight of a telegraph office immediately inspires a desire to send a message of some sort, and she at once went into the bureau and proceeded to compose a wire to Mortimer. “Gone away for the present; do not be anxious about me. Ph?be.” Then she crossed out “for the present” and substituted “for a change.” “I don’t want him to be dragging the Tyne for me!” she thought. “That is, if his affection for me should prompt him to such an extreme course, which I do not think it would.” When she got back to her carriage, a porter was engaged in putting some effects into the rack, which she at once recognized as belonging to Miss Drummond. In spite of her plans, terror then filled her soul. Had that young lady recognized her? Was she intending to join her for the pleasure of her company? Or was it only because this was a through carriage to London? The poor, hunted creature dared not stay to ascertain, but, seizing her bag, jumped out and searched wildly for another compartment. She was bewildered and uncertain. Nobody helped her or took any interest in her, because she was unattractive, so she thought, and the end of it was that the London train moved on without her, as trains will.{49} She watched it steaming out of the station, but she was far too much excited to care. There happened to be another train, just like it, on the other side of the station, about to go westwards to Barnard Castle. “Scott’s Rokeby!” she said to herself. Scott was not one of her modern gods, but still the names—famous and familiar to everyone—“Brignal Banks” and Greta Bridge—had a certain old-world magic of their own. So, acting on the inspiration of the moment, she took a ticket for Barnard Castle, and at twelve o’clock found herself in the market-place of the sleepy little town on the Tees, in front of a char-à-banc full of tourists just starting for Rokeby, four miles off. She took a seat. Once arrived there, she declined to make the tour of the famous Park with a guide and a noisy party of barbarians, with fern-leaves artlessly stuck behind their ears, but, leaving her bag in charge of the obliging porter at the gates, whom the more effectually to cajole she took off her spectacles for a second, started on a voyage of discovery in the opposite direction, across the bridge, following the course of the Greta, along a cart track in a wood, to the east. She did not in the least know where this path would lead her; she only knew that she was extremely happy. She felt just as she imagined the young journeyman heroes in the tales of Grimm must have felt when they walked, knapsack in hand, to seek their fortunes. She walked with an assured step, she sang to{50} herself, she listened to the jubilant song of the mounting larks that came from the fields on the other side of the river, she enjoyed the country as only a town-bred person can; she actually experienced the joy of life she had read about so often. “I have not seen enough of nature!” she said to herself, as one says of a friend who lives a long way off, and whom one has somehow neglected. Tags of poetry, scraps of philosophy, queer mythological ideas, born of her miscellaneous reading, about the Earth Mother and the Earth Spirit, passed through her mind. What a terribly artificial life it was that she had been leading! Nature was the real thing after all! And meantime, at home in smoky, sophisticated Newcastle, Mortimer and Mrs. Poynder and Charles would be sitting down to the substantial midday meal that their souls loved, and that she had carefully ordered for them before she left, as a valedictory service. She pictured the complacent three, pent up in the hideous, stuffy dining-room (Mortimer’s taste—she was only permitted jurisdiction over the drawing-room), with all the windows fast closed down in accordance with that innate dislike of fresh air inherent in some persons, and a blazing fire for the crown of discomfort. She, whose spiritual needs were being so thoroughly satisfied, for once, was not in the least materially hungry, and, if she became so, would eat roots like other heroines before her. There must be plenty of things edible in this luxuriance of undergrowth in{51} which she was wandering, where all possible forms of vegetable life seemed literally crushing one another out in their mutual excess and exuberance. There were great, flame-coloured fungi glistering from the boles of enormous beech trees whose leaves grew so closely that, although the hot July sun, she knew, was beating outside on their thick panoply, she yet was able to walk at ease in their cool penumbra. Beds of magnificent nettles, and the broad, green discs of what the children call “fairy tables” filled all the hollows of the dells. Here and there, tall-stemmed, pale lilac campanulas rose and lightened the gloom through which the sunbeams pierced in vivid streaks, like golden spears probing the dimness. The low bank of red sandstone that formed the background to the grove showed at intervals like a rosy wall, but on the opposite side the character of the country had changed; there were no more meadows; she was hemmed in; the granite cliff rose sheer, clothed with trees that found but a scanty purchase in the rocky clefts to which they seemed to cling frantically with hoary roots upturned, detached almost, the relative positions of roots and boughs nearly reversed. The call of the wood-pigeons that nested in these coverts—she sentimentally called them doves—came to her across the river that flowed along beside her, red like wine, over shiny stones and deep, rocky crevices that modified the sound of its ripples into a thousand musical varieties. She was in an ecstasy. To herself she murmured,{52} softly, Rossetti’s lines about the “Banks in Willow Wood”: “With woodspurge wan, with bloodwort burning red”— and was in a mood to utter invocations to the “spotted snakes, with double tongue,” that must be lurking in those dark beds of hoary nettles. She was a well-read woman, and had her poets at her fingers’ ends, for use, not ornament, since she so frequently quoted them. She walked on, imagining that she heard the interesting rustle of wild animals that her footsteps affrighted, and presently, out of pure caprice, left the path and began to clamber up the bank, in the vague aspiration after blackberries in July. The dell began to widen out, and the river, which up to that time had flowed in a more or less massive and self-contained flood, began to spread and lose itself in shallows. The noise of many counter-ripples, of the suction of large masses of water pouring into crevices and over many different levels, grew very loud. She stood, as it were, at the end of a funnel, looking towards a sunlit clearing where the trees grew more thinly and more interspersedly, and the cliffs stood away on either side. She stopped and stood still, and pushed her spectacles, which she had been wearing very laxly, a little further up her forehead. “This is like a glimpse of Paradise,” she thought, looking towards the golden space in front of her, “coming as it does, just after this long, cool dark{53} grove that I have been walking in for more than half an hour! That was a kind of Purgatorio. This is a painter’s paradise, I might say, and there is the painter!” For very nearly under her feet—she was half-way up the sloping bank that sheltered this little oasis on the south—was the white calico umbrella planted on its spiked stick, like a gigantic mushroom, which Mrs. Elles was well-informed enough to associate at once with the painter’s craft. The painter was, of course, seated on his camp-stool under it, and she looked down on the back of his sunburnt neck and noticed the way his hair curled a little on it. One rash step would bring her down on him in a helpless rush, for she was not an expert climber and her steps were rendered precarious by the crumbly nature of the soil on which she stood. She settled her spectacles firmly on her nose—“I shall probably fall and break them into my eyes, but it can’t be helped!” and began to skirt round to the left, intending to make a circuit of the umbrella and approach the artist from the front. She had a wild desire to speak to someone. She had actually not opened her lips since ten o’clock that morning, and she was a woman hardly cast by nature for the part of a Trappist! In this lonely place, the least a man could do would be to wish her good day! Then she might possibly go so far as to ask him to tell her the name of the place where she found herself, and a pleasant conversation would thereby be inaugurated. She worked gradually round to him—how ugly the{54} world looked through the wall of cold blue in front of her eyes!—and the continuous ripple of the water, flowing over the many obstacles and narrow channels of its bed, effectually drowned the noise of the snapping of dry twigs and the breaking of pulpy burdock stalks that attended her clumsy progress. She was almost in front of him—a few yards off only—but he had not raised his head. He did so presently, in the natural course of things, and she made a step forward. “For God’s sake, mind that foxglove!” he shouted, but, even as he spoke, it was doomed and the splendid column of pink bells fell prone to the ground. She stood aghast. “I beg your pardon!” he said, in a tone as civil as was consistent with the most obvious and excessive irritation, “but do you know you have completely ruined my foreground?” “I beg your pardon—oh, ten thousand times!” she replied, ruefully surveying the snapped stem of the injured flower. “But it will grow again, won’t it?” “Not that one—not this summer—and it came in just right! Well, well; it can’t be helped.... Please don’t apologise!... It is no matter.” But she continued to apologise, and he to beg her not to do so. The voice in which she conveyed her protestations, however, became more and more feeble. The hot sun was beating down on her head as she stood, and she was conscious of an overpowering faintness and desire to sink down on the desecrated{55} bed of foxgloves and rest; but she felt also very strongly that she must resist and conquer the impulse until she could remove herself to a place beyond the artist’s proximity. “You seem faint,” she heard him saying, and his voice, grown gentle now, seemed to come from miles away. “Sit down on this!” and he hastily emptied a bulgy canvas sketching bag and laid it down beside her. “Now shall I get you some water?” She was so really ill that she could only nod in response to his offer. “I have no glass,” he said; “but this little thing will be quite clean when I have washed it out.” He took the japanned tin attached to his water-colour paint box, and ran down to the river to fill it. She watched him. “How nice of him!” she thought to herself; “and I was just thinking him such a bear; and I spoiled his poor foxglove; and I am so hungry!” There were several crusts of dry bread lying about which he had thrown out of the canvas bag—how dry she dared not think, but she put out her hand and nibbled at one. “Good Heavens, you must not eat that!” he said, when he came back, raising his eyebrows. His eyes were quite dark, though his hair was grey. “Mrs. Watson put some sandwiches into my bag this morning, but I regret to say I ate them all half-an-hour ago! I generally take them back with me untouched. How unlucky!{56}” He raised his voice and called, and after a time a lubberly boy came slouching up. “Now, Billy Gale, where the devil have you been? What is the good of you? Go up to the cottage and ask them for a glass of milk and a slice of bread-and-butter—on a plate, mind!” The boy was off, and he turned to Mrs. Elles, who had drunk her cool, pure river water, and was looking less pale. “You are very kind to me,” she murmured, “and I know how you must hate being interrupted! Please do go on painting now as if I were not here. I won’t say a single word, and, as soon as I am a little rested, I will go away and leave you in peace.... I am very fond of art!” she added, inconsequently. “I used to do a little myself.” But the artist seemed to have taken her at her word, and she did not think he could have heard her, as he sat complacently dabbling his brush in the little water-tin, now restored to its proper use, and then put it to his lips, and then touched his paper with it. There was no colour in the brush, and no particular effect upon the paper, so it seemed to the ignorant tyro at his side. In spite of her promise of silence, she could not resist pointing this out to him. “Don’t be too sure,” he said; “every touch counts.” “I do wish I might have a look at it!” She was quite unprepared for the terrible frown that appeared on his mild countenance when she preferred this innocent-seeming request.{57} “You must excuse me, please. I cannot bear to show my things before they are done. I could never work at them again if I did. It is a peculiarity of mine—dreadful, but—here is Billy! I am afraid he will have spilt most of the milk by the time he gets here.” “Mr. Rivers, sir,” said the boy, as soon as he got within earshot, “Farmer says as one o’ they little black pigs—you knows ’em, sir—?” “Intimately, every one of them,” replied the artist, bitterly. “It’s your business to keep them off me, you young villain, and instead of that you go and let them rout about in my colour box——” “That’s just it, sir,” Billy answered, grinning joyfully; “one of ’em has died suddent-like, and Farmer says as how it died along of eating those little sticky things o’ yourn that squeedge in and out.” “One of my oil-colour tubes! What nonsense! Just go and tell Mr. Ward—no, stop; I’ll speak to him myself, later.” He turned and laughed at Mrs. Elles very pleasantly. “What an absurd thing! But I certainly have missed my Naples yellow, lately.” She laughed too. “Now I have heard your name,” she said. “Edmund Rivers.” “Yes, Edmund Rivers, the famous landscape-painter—you see I know all about your fame—and I have a letter of yours in my pocket.” As a matter of fact, she had not, she was thinking of the muslin dress she had worn days ago, into whose{58} pocket she had thrust the autograph letter Egidia had given her. The dress was in her bag, lying at the Porter’s lodge, a mile away. Still it sounded better. The artist luckily did not ask to see the letter, but looked puzzled, and a little displeased. “I collect autographs!” she went on hastily, “and Miss Giles—Egidia, you know, the famous novelist—gave it to me. She said she was a relation of yours. She is a great friend of mine, too. I am on my way to stay with her.” “Oh, indeed!” he said, stiffly. “But I must ask you,” she went on, clasping her hands together, “not to mention my name to her when you write, or even to say that you have seen me. Please promise?” “But, my dear madam, I don’t know your name, and am never likely to.” “Oh, yes; but indeed you must know my name,” she said simply, “Miss Frick.” It was a pseudonym adopted on the spur of the moment; she had known a German governess of the name. Once fairly launched in fiction she went on easily. “I am the daughter of a country clergyman, and he’s very poor—we are seven—and we all earn our bread. It is a very strange story. My father married again, an odious woman none of us could live with. I did type-writing—that is how I weakened my eyes—and then I broke down, and I had to go into the country for my health.{59}” “I am very sorry to hear all this,” said the artist, languidly. “Oh, not at all. And then—there was a further complication—there was a man, and he pestered me—annoyed me—molested me, in fact, till I got ill. It was not all the fault of the type-writing, you see”—she had a wan, well-executed smile under her veil. “My life was a torment to me. He followed me about; he even threatened to shoot me! You may have read about it in the papers.” “No, I never have.” His voice betrayed no interest. “People do such dreadful things, sometimes!” she observed, vaguely, to Nature at large, for the artist had become quite absorbed in his work and seemed to be paying no attention to what she was saying. “He is all the time wishing me at the devil!” she thought to herself, but she did not go. She was perforce silent awhile, but took the opportunity to look closely at and focus this personage who had so completely filled up her field of vision. “He looks rather like a foreign sailor, such as one sees on the quays at Newcastle,” she thought. “He only wants earrings to complete the effect. I suppose it is because he is so sunburnt, and his eyes are so dark. They are like brown pools—like the river here, as if they grew like what they looked on. There are all sorts of little wrinkles round them—not money wrinkles, as I always call Mortimer’s—but wrinkles that come of screwing up his eyes to see{60} effects, and shutting one of them altogether now and then, as he is doing. He talks languidly, like a society man, as if everything was a bore, but then his eager eyes are all over the place. I like that greyish hair in so young a man—it is ‘a sable silvered,’ as Hamlet said of his father. What a beautiful mouth! It is like a woman’s, and yet it is strong. His moustache hides it a good deal. Well, a mouth like that should not be too obvious to the vulgar eye. It tells too much. He is very thin. I wonder if he is delicate? No, not with a figure like that—he must be strong, and his instep is beautifully arched—that comes of springing about these rocks—people grow flat-footed in Newcastle....” She started suddenly. “Why am I sitting here beside a strange man of whose existence I did not even know an hour ago? It is as if I had been here all my life! I ought to go, of course, but where?” She looked round her distractedly. The sun had declined; the day had changed from morning to afternoon. She had been in this man’s company for nearly two hours, without any excuse beyond her temporary faintness. She got up nervously, though he did not seem to notice her, and wandered a little way off across the meadow trying to collect her thoughts and make a plan. A curious brown ball lying at the foot of a wild rose tree attracted her attention. She picked it up and, with childish inconsequence, carried it back to the artist to ask him{61} to tell her what it was. Suddenly it uncurled in her hand, and a tiny snout appeared in front of the bristles! She dropped it with a modish scream, and the artist perforce raised his head. He saw the situation at once, and smiled a little. There was a cynical twist in his mouth that delighted her. “Did you say you had been bred in the country?” he asked. “Why, what is it?” “Only a hedgehog—a ‘hodgeon,’ as they call them here. Poor thing: it trusted you, you see, and uncurled itself!” “The darling; I must take it home.” “I would,” he said dryly, and looked at his watch. “Four o’clock! I must go to my afternoon subject.” Trembling with apprehension, she watched him as he took the sketching bag, and rammed his sketching things into it. He then summoned Billy to take down the umbrella and follow with it, and shouldering the bag himself, raised his cap civilly, bade her good morning, and was gone. She sat there stupidly staring at the little yellow patch of trodden grass where his feet had rested, and his camp had been set. She was alone in the world again, a runaway wife, with all the problem of her life before her! The obvious course was to get up and go; but where? To London? What did she care for London now? And anyhow, it was far too late to go on there that night!{62} The smoke was rising from the chimneys of the cottage up there on the brow, whence Billy Gale had brought the milk. Was the artist staying there? She cast her eyes vaguely round her as if to ask the mild heavens for help, and saw the boy in the distance, sitting kicking his heels about on a dry rock, in mid-stream, not far from his master, presumably! Then she rose, having conceived a reckless plan of action which she felt the necessity of putting into execution at once; for if she were to allow herself to think it over, she would never be able to bring herself to do it at all. She beckoned to Billy Gale, and asked him to be so good as to direct her to Mr. Rivers’ “afternoon subject” as she had heard him call it. The lad stared, but obediently led her to a place about a quarter of a mile further down the river, opposite a ruined church, and a church garth full of antique, wooden headstones, smothered in burdock leaves; a scene of beautiful desolation. Mr. Rivers was standing, sketch book in hand, on a little beach of pebbles under the shelving, undercut bank, executing with incredible dexterity what looked like meaningless parabolic curves, with a hard lead pencil. His back was turned to her. She jumped down the bank, and, though the crunching of the pebbles under her feet, and the sound of her own voice, affrighted her, managed to pluck up courage to address him. “I must apologise for troubling you again—but you{63} were so very kind to me before—perhaps you would not mind telling me if there is any—if I could find any accommodation here?” “No, none!” he replied hastily, without even turning round. After an appreciable pause he added, unwillingly, “At least—there’s an inn a mile off—about a mile——” “But that is what I mean!” she cried, joyfully. “And is that where you stop?” He turned on her a gaze of acute distress. “Oh, yes, I suppose so, but I warn you—I, of course, can put up with anything—it is very rough, very rough indeed. They are not good hands at cooking—I have had a chop a day for the last fortnight. And the beds are very hard!” Here he shuddered somewhat elaborately. “I don’t happen to mind that sort of thing at all.” “I chose it for quiet,” he went on, pathetically. “The landlady is a good soul, who understands my little ways, but——” “That quite decides me——” “They may have a room—I am sure I don’t know—but I should advise you not——” “I should not be in your way at all,” she went on, barefacedly assuming her acquaintance with the remoter causes of his feeble degree of encouragement, and smiling sweetly into his blank face, “in fact, I should be a comfort to you—I mean, I am very quiet,{64} and if I occupy the room, no one else can, don’t you see? I should at any rate serve to keep noisier people out.” “There is something in that!” he observed, as if to himself. “So I will go along and see,” she went on, pursuing her advantage. “My lad can show you a short cut over the river,” was the painter’s unexpected rejoinder. She was not deceived by his mildness. He only wanted to get rid of her, and the moment he had spoken he turned round and resumed his drawing again. “Delightful, but not quite human,” she thought to herself. His “lad,” with frank confidence in her power of accommodation to somewhat unusual methods of progression, piloted her across the river by way of a rough bridge of stepping stones, apparently half natural, half artificial, and then led her by many a varied and devious track, through a succession of brambly coppices, and over many stiles of many patterns, tantalizing enough to a town-bred woman. She enjoyed it, however, and was proud of her newly-discovered powers, as she surmounted one unusual impediment after another, and was as quick about it as the long-legged country lad who guided her. Then they crossed a couple of upland pastures where the great, mild-eyed cows were grazing, and half-turning their heads to look at her and Billy Gale, who left her no time to be afraid of them, and at last the{65} slender smoke spirals from the chimneys of a little homestead rose in sight. “The Heather Bell” was an old-fashioned coaching inn on the outskirts of the great park of Rokeby, and opposite one of its gates. The enormous beech trees leaned over the high Park wall and shadowed the inn that was only separated from it by the width of the road, and whose windows were darkened at noonday by their shade. The inn itself was a large, straggling building, with a low-pitched, tiled roof covered with houseleek. A bushy, garish-coloured garden on the south side, full of flowers, reached to where the fields ended. A woman was standing under the rose-hung porch, shading her eyes with her hand. “Yon’s the Mistress!” said Billy Gale, suddenly, “and she owes me a skelping, so I think I’ll just mak’ myself skarse!” He bolted, and just in time, for the landlady came striding up the garden path with obviously less zeal for the welcoming of the guest than for Billy Gale’s discomfiture. “Little, idle good-for-nought!” exclaimed she, shaking her fist in the direction of his recalcitrant back. “Is this the proper way for to bring fowk in? What’s the front entrance for? Good morning, Mem. Coom in this way, since ye are here!” Mrs. Elles asked for a bedroom, and was told that she could have one. “It’s a bit smarl, but ye’re no very big yersel’,” said the landlady, tenderly patronizing her already. People always did. “Coom, an’ I’se show ye!...{66} Ye’ll be a penter, too, will ye?” she enquired, on the way upstairs. “Lord love ye, there’s heaps on ’em cooms here! It’s a fine place for such as them! There’s the Joonction—the Greta and the Tees, ye know, and the Dairy Bridge and Mortham Tower, they’re all bonnie—ye’se find plenty for to ockipy ye here. We’ve got a grand artiss here now.... That’s his room, see ye, next yours—ye’ll mebbies have seen his pectewers in Lunnon, Mem?” “Miss,” corrected Mrs. Elles. “He’s a permanent lodger like. It’s a matter o’ ten year since he first coomed here, seeking rooms. I seed he was a painter lad at onst, and I says to my man—I had a man then—‘Tak’ him, George, and ye’ll ne’er repent it! He’ll be out a’ the day long a dirtying o’ bits of nice clean paper, and amusing hisself, and no trouble at all!’... Well, he’ll be in soon to his bit denner. Ye’ll be having a chop to yer tea, along of he?” “Oh, but can’t I have a sitting-room of my own?” “Nay, we haven’t another setting-room, honey. There’s only the big meetin’-room, ye know—’tis only fit for picnic parties, and sich like—but Mr. Rivers is a nice quiet body; he’ll not be in your way, I promise ye.” But Mrs. Elles, whatever her private wishes might have been, was resolved not to have any appearance of intruding on the hermit painter; and six o’clock—for she was ridiculously, umromantically hungry—found her established at a corner of a long-rudimen{67}tary, wooden table, built on trestles, that ran the whole length of a bare, barn-like room, evidently a recent addition to the comfortable old coaching inn, for it was high-pitched, with three tall sash windows, and the walls distempered in French grey. The floor was sanded, and its raftered ceiling was not free from spiders, that ever and anon made terrifying voyages of discovery down their shadowy webs to the end of the long table that was spread with a coarse, white cloth for her benefit. She was struck, amid all this roughness and rusticity, with the white, well-tended hands that served her. It was not a servant who stood behind her chair, and who was continually addressed from afar by the landlady as “Jane Anne!” Jane Anne was a short, thick-set young woman in a well-made black dress, and an opulent watch-chain. Mrs. Elles did not like her face, with its heavy chin and sullen eyes and masses of crisped black hair parted carefully on a low forehead, or the mincing Cockney pronunciation, grafted on a native Yorkshire accent, with which the girl answered the trifling questions she asked her. She wore no cap or apron, and performed her service with a silent concentration which showed that it was not her usual vocation. To all Mrs. Elles’ remarks she replied civilly, but with a suggestion of closure in each answer. Mrs. Elles took a strong dislike to her at once. The three windows of the room opened on to the garden, the main path of which led by a slight{68} upward gradient to the wicket gate and the series of upland pastures which she had traversed a few hours before on her way back from Brignal. That, she had ascertained, was the name of the place where she had first met Mr. Rivers. He must surely be even now crossing them on his way home from his work. She went across to the window and leaned out, and gazed disconsolately towards the empty sunset sky. Two pretty brown cows were leaning over and rubbing their noses against the stumps of the gate, lowing gently for human sympathy. Suddenly their heads were persuasively pushed aside, and the painter appeared, silhouetted against the saffron background. He stroked them, and then coming through, closed the gate carefully against their obtrusive noses. Mrs. Elles watched him as he walked down the path, pebbly and uneven with the washing down of previous heavy rains, between the low espalier pear trees, and disappeared under the porch a few yards to the left. Then, with a little suppressed sigh, she withdrew her gaze from the gleaming sky and turned sharply, to find the body of the girl who had waited on her at dinner in close proximity to her own. The girl had evidently been watching the painter’s entry, too, over her unsuspecting shoulders. Mrs. Elles conceived a violent dislike to her, which, in her wilful way, she was at no pains to hide. Everybody here seemed to be attached to Mr. Rivers. Through the open door of the room, she heard the landlady’s ecstatic welcome to him as he{69} passed under the rose-hung porch of the “Heather Bell.” “Well, and here ye coom, sir!” as of one receiving a cherished lamb back into the fold. Presently, the listening woman heard him walk wearily into his sitting-room—it happened to be next door to the kind of annex in which she was—and close the door. She now felt strangely and unutterably lonely. What had she come here for? During the rest of the evening, she sat in a hard cane chair by the window, and leaned her elbow on the equally hard stone sill. The light slowly faded out of the sky and the scent of the nightstocks came to her in sweet, overpowering wafts, and the evening primroses opened wider and wider till they seemed to shine like yellow moons in the dusky garden beds. Then the real moon came out, and still she could smell nothing but the sweet smells of the garden and she wondered whether Mr. Rivers would begin to smoke enormous strong cigars or a horrid pipe, like Mortimer, and thus kill all the poetry of the evening. His window was next to the one out of which she was now leaning, and it was wide open. Her window was raw and square, his was smothered in the leaves of an immense pear which she had noticed as she came in, growing, in stiffly arranged branches like a genealogical tree, all over the southern side of the house. No, he was not smoking! What was he doing? She suddenly conceived the notion of going out of doors—of taking a walk in the Park, that is, if the{70} porter would allow her to pass at this hour. She would see the famous yew grove she had read of, dark at noonday, and positively sepulchral at night, where the White Lady of Mortham walked and bewailed her unnamed woes. She would listen to the mysterious “hum” beetles, which served for “tuck of drum” to marshal the gallant outlaws of the ballad:— “Oh, Brignal Banks are fresh and fair, And Greta woods are green; I’d rather rove with Edmund there Than reign our English Queen!” “How strange his name should be Edmund, too!” So musing, she went out. She did not trouble to put on a hat, and she took off her tiresome spectacles and put them in her pocket, for it had grown so dark that, even if anyone were to meet her going out of the inn door, he would not be able to see her face with any degree of clearness. But when she got into the hall, she changed her mind capriciously and went into the garden instead of the Park. As she passed the window of his room, she noticed that the white linen blind was not drawn down, and the lighted lamp inside showed the table with its queer, old-fashioned, rose-embroidered cloth, all littered with the paraphernalia of an artist’s work, and the artist himself intently bending over a sepia sketch lying in front of him. He had evidently forgotten her very existence! No wonder! A plain woman with smoked spectacles and a bald forehead. So she characterized herself. That was all she had allowed him to see of her. She stood there for a very long time, watching him, her hand raised to her face ready to veil it in case he should look up. She had no scruples, for if he had objected to being looked at, he would have pulled down the blind. Every now and then, a ripe pear, ruined by the insidious wasp that preyed on it secretly, fell heavily down on the sodden earth under the window, and startled her, but he never raised his head. She ceased to expect him to do so, and stood at ease, listening to the various puzzling night sounds and quite unconscious of the flight of time. Queer noises came from the great, mysterious demesne on the other side of the house—that excess of rank foliage in which it seemed that every known variety of animal might find a home; it was so “whick,” in local parlance, so full of all the forms of sylvan life, crawling, creeping, rustling in among the long grasses and twisted boughs all through the summer night. Presently, the short, sharp bark of a fox, that came from the covert, did penetrate to his ears through the thickness of the pane; he looked up, seemed to stare at her, and she fled. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2761/76190.html","bookId":1341,"book":{"id":1341,"title":"The Human Interest","description":"简介： One dull afternoonand it was in summera London authoress of some repute, whose nom-de-guerre was Egidia, was wandering along the pavement of a dull and imposing street in Newcastle. Day was beginning to decline, but the approach of evening was not al...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2761","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
