{"id":44274,"no":5,"title":"CHAPTER V","content":"Mrs. Elles had arrived at Rokeby on a Monday. When Sunday came round, she had been prepared for the usual flying in the face of Philistine custom and observance that prevailed in her own circle and imagined that the artist would go out to paint as usual or perhaps as a concession to popular prejudice stay and work indoors. But to her intense surprise and amusement, eleven o’clock on Sunday morning found her murmuring the Litany by the side of the artist in the parish church, among the placid farmers and their complacent, Sunday-bedizened wives. Mr. Rivers, it seemed, was in the habit of going to church every Sunday, and, when she discovered this, it had seemed quite natural to go with him, though it was the first time she had been inside the walls of a church since her marriage. The service, to her mind unblunted by custom, seemed very picturesque; so was the church, a beautiful specimen of pure early Gothic, and the figure of this grave, handsome man, standing by her side, with his dark head relieved against the white plaster background, most natural of all. “If anyone had told me, a month ago,” she{99} thought, “that I should be doing this, I believe I should have laughed in his face.” She felt happy, but a little out of place, and looked it, perhaps, for the vicar, a stolid, white-bearded, dignified man, stared at her over the pulpit cushion, discreetly, while a thin, little, sharp-nosed lady, presumably of some authority in the congregation, did so, too, indiscreetly. Jane Anne, who played the harmonium, was discretion itself and never even glanced her way, but Mrs. Elles thought she read excommunication and condemnation in every turn of her not too supple wrist. “So you go to church every Sunday?” Mrs. Elles said to Rivers, as they walked down the path and away together. “Somehow I thought artists——” “Never went to church?” He finished her sentence for her. “Well, I don’t know. I don’t do it as a religious observance, exactly, I am afraid. I do it because I like it, here in the country. Besides,” he added, “it is a beautiful church!” Mrs. Elles, who considered herself an agnostic, was satisfied, by this speech, that Rivers’ church-going was the result of his indulgence of ?sthetic needs rather than spiritual ones; though, indeed, she would have been quite ready to embrace any faith to which he should pronounce his adhesion. “How picturesque the Vicar’s white hair is!” she remarked, aloud. “Do you know him?” “Oh, yes; Mr. Popham. He will come now to call on you, since you have been to call on him.{100}” “Good heavens! Does he go to see you?” she cried, with what would appear to be uncalled-for emphasis. “Yes; he comes now and again, but I am always out. We generally meet somewhere about the place, and then we get on very well. He had a tiresome habit of coming and looking over my shoulder at Brignal, but I have trained him not to stay very long.” “Is he married?” she enquired, eagerly. “Yes; that was his wife in the pew to the right.” “Does she come and look over your shoulder, too?” “She takes a tender interest in my work,” Rivers said, laughing. “She is by way of being an artist herself, you see.” “That little, starved, angular, high-cheek-boned woman, without a touch of artistic feeling about her, and bonnet strings of the wrong colour!” “You must not go by bonnet strings entirely. They are a matter of convention. Mrs. Popham has a very good eye for colour, let me tell you, only she is dreadfully shy of publicity, and would think it quite improper to exhibit. One never knows into what vessels the spirit will be poured. I go in in the evening sometimes and look over her sketches; she is very good to me. She walked all the way to Brignal once, with a cork mat for me to put my feet on!” “And did you use it? I never see you!” “It bores me—that sort of thing bores me. You will find it in my sketching bag, though.{101}” “What is the good of carrying it there and back every day, if you don’t use it?” “Ah, but in case she were to come, I would hastily adjust it under my feet, so as not to hurt her feelings. But she is not likely to walk so far.” “I suppose she is perfectly devoted to you, like everybody else?” He did not take any notice of her remark. “So is Jane Anne!” she next observed. “Jane Anne is a very clever girl,” replied Rivers, too single-minded and too busy to see the construction that might be put on the turn of his phrase. “She may be a mute inglorious Milton!” remarked Mrs. Elles, “but I am sure she is not a nice nature. She looks a potential murderess with those lowering brows. As for Mrs. Popham, I don’t know her.” “Ah, but you will!” “I hope sincerely I shall not,” Mrs. Elles muttered, under her breath. Mrs. Popham might be a noble soul, and a very fair water-colour artist, but still a woman with surely an enquiring mind and a scent for irregular situations. She began to dread the Pophams and Jane Anne, and to regard them as natural enemies. Jane Anne she could not avoid meeting about the house, and the girl was so antipathetic to her that she made a point of not encountering her eyes, and did this so obviously as to provoke an enmity which, possibly, had so far only existed in her own imagination. The vicar and his wife, whether by accident or{102} design, never crossed her path. One day, when she made her accustomed pilgrimage to Brignal, she saw that Rivers was not alone, and, at first, thought it was the sacerdotal back that blotted the fair landscape. But it was not Mr. Popham’s; it was that of the opulent farmer on whose land Rivers had taken up his position, and with whom the dispute of the pig’s unlawful consumption of Naples yellow had long been arranged amicably. Farmer Ward was standing by the side of the artist, passing his felt wide-awake from one hand to the other and staring up into the sky as if he expected the first rain-drop of the autumn to fall on his expectant features from moment to moment. “No, it won’t rain to-day,” Rivers was saying, decidedly, “but you had better make the most of the opportunity, for I won’t vouch for this spell of weather lasting.” “Aal reet, Measter, I’ll take yer word for’t.... Ye see, Miss,” he turned to the young woman who now approached, “artisses and sech like, they seem to know the meanin’ of it all!—” he waved his hand comprehensively round the horizon,—“a deal better nor we do.” “We are bound to notice it,” said Rivers, indulgently. “You see, the weather affects our crops, too!” He pointed to his canvas. “Ha! Ha! Measter, I takes ye! And if I might be so bold as to ask, what might ye happen to get for that little pectewer there? A matter o’ fifteen shillin’—or saxteen, maybe.{103}” “My good man, how do you think I could possibly live at that rate? I have been at this thing a month already!” “Ay, ay, Measter, but then, some folks is pertickler slow!” “There’s a snub for me!” whispered Rivers to Mrs. Elles. “But it’s a grand pectewer, all the same,” continued the honest farmer, “though I’d like it better a deal, I must say, if there was a bit o’ life in it, just a hen and chicken preening about maybe, or a bit doggie, ye knaw, or even the young leddie here!... Well, I’ll just be going now, I’m thinkin’!” He touched his cap and withdrew, tactfully, conscious that the “gentry” might perhaps be getting a little tired of him. “Why do you never put people into your pictures?” Mrs. Elles enquired. “I confess I am like Farmer Ward; I should like it better, too!” “Somehow, I never care much for the human interest in landscape.” “Or in life either?” Mrs. Elles hazarded. It was the same remark she had made to Egidia. “I don’t know anything about that,” he replied, distantly, “but I think the introduction of figures is always somewhat of an insult to landscape. One ought to be able to make a transcript of nature interesting without the adventitious aid of figures, it seems to me, though certainly Turner had no such theory. There is generally a boy and a kite, or a{104} man and a dog in the foreground of his pictures. There is often a suggestion of cruelty, of torture of animals that I could wish away, for instance——” “Yes, you do hate people!” Mrs. Elles insisted, unconsciously cutting short his little dissertation on his idol, Turner, far too impersonal in its application to interest her. “You have all the instincts of a recluse, although you force yourself to be civil to bores when they come your way. Tell me, didn’t you hate me when I first came?” “You took me by storm rather,” he admitted. “You were so rapid in your tactics that you didn’t even give me time to harden my heart against you. Of course I am speaking of you as a mere tourist, as I thought you were the first time I saw you. And I was rather rude to you at first?” “Very,” she said. “You did your best to put me off the inn, but you are not sorry now that you failed, are you?” “Of course I am not!” he replied, cordially, and it was quite the nicest and most encouraging thing he had ever said to her. “It seems to me that I have frightened away your other bore—the Vicar,” she said, carelessly. “He never comes here, and she has never called on me, as you said she would. Not that I think you mind not seeing anyone! Yes, you are an arrant hermit at heart—Shelley must have meant you when he wrote Alastor—the Spirit of Solitude. I was reading that{105} the other day in your Shelley; I am studying Shelley, now.” “I admit that my instincts are unsociable,” he said, with his brush between his teeth. “I don’t see how I am to help it. The conditions of a landscape painter’s life make it necessarily a very solitary and inhuman one. You see I am in the country for the greater part of the year, and I never tell anyone where I go. I call my pictures by fanciful titles, so as not to have to put the name of the place in the catalogues. It is absurd, but then it happens to be the only way I can work. I generally don’t open my lips from June to November, at least not to talk to persons of culture! The other sort doesn’t matter.” “Don’t you care to study people?” she said. “It is my business to study the physiognomy of clouds, the character of tree trunks, not faces!” “Don’t speak so ferociously!” she said laughingly. “You mean that your only books are—not women’s looks. It is Nature who is—your mistress——” “Yes, and a nice capricious mistress she is, and very hard her service!” “But she never did betray the heart that loved her—we have that on good authority!” “Betray—no, but she does lead him a dance!” the artist exclaimed passionately. “She rains her tears on him, she blows hurricanes on him, she plagues him with flies, and, what is worse, wasps—she lets him break his back, and contract his chest with stooping, the better to deal with her. She is never the same{106} for two minutes together. She is exacting and exclusive. ‘Thou shalt have no other mistress but me!’ she says. ‘You shall dance attendance on all my moods, and submit to all my caprices, and you shall go on trying to paint the unpaintable all your life, and die before you have succeeded in doing it!’” The painter, having grown a little serious and excited over his own tirade, ended it with a little laugh at himself, and she murmured with apparent inconsequence, “Oh, I think it such a pity—such a waste!” “What do you mean?” he asked her, negligently, and stayed not for an answer—it was a little way he had. She would have been ashamed to admit to him what her meaning had been; that he was still young, that he was handsome, that, in her opinion, such a man was thrown away on the service of Nature. She changed the conversation by offering to read him some passages from the Newcastle paper. He nodded in assent. She first gathered and fastened two large fern fronds behind each ear, as a clerk his pen, to keep away the flies which Rivers’ mistress Nature continued to send him. She felt herself already so hideously travestied, that an added touch of grotesqueness or so did not matter. Then she began to read aloud in her quick, impulsive way. She had not read more than a few sentences, when she stopped suddenly. The painter might, or might not, have been attending to her, but the sudden cessation of her voice inevitably excited his attention.{107} “Well?” he asked her sharply. “I stopped. It was getting so dull in that part of the paper,” she said, confusedly, bent on herself getting the gist of a certain paragraph that had caught her eye. It was an account of an arch?ological meeting that had recently been held in Newcastle, where Mr. Mortimer Elles had seconded the motion of somebody or other, and had “given an exceedingly humorous turn” to the debate. She pored over it with a certain sense of bitterness, mingled with relief. “So he is cheerful enough to make bad jokes! He is getting on all right. I need not have troubled to be anxious! He will have told all my friends and his that his gadding fool of a wife is away amusing herself on a visit. He is quite clever enough to invent some excuse like that! Men don’t care to admit that they have been run away from!” Mr. Rivers had meanwhile idly taken up the few letters she had brought and laid down beside him as usual, ready to his hand. He was quite capable of leaving them for hours unopened, to her continual surprise and somewhat to her annoyance. She could not understand dilatoriness in such matters. But he was reading one now, of which the immense signature inevitably caught her eye. It was Egidia’s real name—Alice Giles—which she happened to know. “I—had a few letters this morning,” she remarked, pointedly, “but they were all very dull.{108}” “This one of mine is rather amusing,” returned the guileless artist. “It is from my cousin—I daresay you know her by the name she writes under—‘Egidia.’” “Why, I told you I did when I first came here!” she exclaimed. “Don’t you remember? It is through Egidia that we know each other. And is that from her? Oh, do, if you can, read me some of it.” Rivers tossed the letter into her lap. “Read it all, if you like. It is a lively account of her Northern experiences. There seem to be some odd types in Newcastle, to judge by what she says!” Thus empowered, Ph?be Elles devoured the letter. A great many of her friends were mentioned in it—the poet, Miss Drummond, and Mrs. Poynder, while there was a whole page entirely devoted to the muse of Newcastle. “I met her at a lecture I was giving. Somebody or other on the platform introduced us. I had noticed her big eyes fixed on me, and her lips parted, following every word I said. It was flattering. She implored me to call. It was because I wrote books. I went because I liked her. She was an audience in herself! And her home! She has, I could see, a hard fight of it, poor little thing, to cultivate culture there. It was quite pathetic to see her straining every nerve to be modern and morbid and blasée, as she thinks we are in London. But give me the provinces for morbidity and unconscious Ibsenism! In spite of her amusing little affectations and pre{109}ciousnesses, she is a dear little woman, and I think I shall ask her to come and stay with me in town—there is no one who would enjoy it more. If I do, you must come and meet her, you would like her. Pretty, too, though I don’t think you care much about that. But so intensely interested in everything, so eager, too nervous, perhaps, to be soothing, a woman with more brain than temperament, and perhaps not so very much of that. Incapable, I should think, of a grande passion, but so anxious to have one! She is really to be pitied, I think, for the milieu she lives in is naturally abhorrent to one of her way of thinking. It is unfortunately that of nine-tenths of her class, the provincial women whose wits outrun their opportunities, and their aspirations their social possibilities. The type is so sadly common. English Madame Bovarys! “She has a husband, but I did not see him. I was going to dine there to meet him, but she put me off. Perhaps he explains her. At any rate, from what she told me, and allowing for her very strong bias, he furnishes a very good excuse for any vagaries she may choose to commit. I believe he drinks, though she did not say so, and I respected her for not giving him away. An ordinary, middle-class brute, my dear Edmund, incapable of making even a goose happy, far less a woman who has educated herself into some of the subtleties of refinement. “I don’t know why I write all this about a perhaps not specially interesting person, but—her eyes—when{110} she looked at me, and was not posing!—were the eyes of a prisoner. I see them now!” Interesting as this document was to the subject of it, there were things about it that she did not quite like. She was silent for a little time, quite ten minutes. Then an irresistible impulse prompted her to say, “I happen to know that woman Egidia writes of, very well.” “Do you really? Then perhaps I ought not to have shown you the letter. One never knows.” “Oh, it doesn’t matter. Ph?be Elles is one of my greatest friends—poor thing!” “Why poor thing?” “Oh, don’t you know—she is one of the unhappy ones. She made the usual mistake, ten years ago, and has been repenting it ever since.” “What was that?” “She married, that’s all. They all do it. But Ph?be—my friend—complicated matters by marrying a man who was unworthy of her, though I am bound to say she was in love with him at the time she married him—or thought she was.” “If she thought so, she probably was,” came from behind the easel. “You think that proves it? Well, ‘there is nothing either good or bad but thinking makes it so,’ as Hamlet says. However, poor Ph?be Elles never knew what it was to be happy with the man she had chosen, though she had a vague idea that there was happiness somewhere in the world for her, as all we poor deluded{111} fools of women have. There was nothing to make her happy, her life was starved, maimed, stunted—no colour in it at all. He had been married before, and the house was full of—what shall I call them?—obstacles to sentiment, in the shape of stepsons, and awful aunts——” “How many aunts?” “Only one, perhaps, but a horror, a perfectly awful woman! I shall never forget what I——” She recovered herself and went on. “He—her husband was not unkind to her—not cruel, oh no, he took good care of that! but he contrived to make himself generally odious to her, and was antagonistic in every possible way——” “Poor man!” ejaculated Rivers, in rather an incomprehensible manner. “Then,” Mrs. Elles went on, complacently, warming to her subject, “there came a final scene—such a sordid affair too, but it brought matters to a head. He sent away all her servants at an hour’s notice, on the very flimsiest of pretexts, and when she ventured, very naturally, to expostulate, he turned round on her and insulted her grossly. He told her that he had never loved her, but had only married her out of pity, because she had so obviously set her affections on him; and that now, when she had entirely lost her looks and her youth——” “The man must have been an utter cad.” “Yes, wasn’t he!” exclaimed, Mrs. Elles, delighted with his concurrence. “I was sure you would say{112} so. And then he abused her and called her names—I am sure you could never bring yourself to use such words as he used to Ph?be, to your wife!” She snatched a fearful joy in the use of this phrase. “No, I suppose not,” said Rivers, who, for some reason or other, did not seem inclined to treat this story very seriously. “No, I suppose not, unless she aggravated me beyond endurance. Then there is no knowing what I might not say.” “Oh, yes, I quite understand, if she was a nagging woman—but poor Ph?be—I know her so well—is incapable of anything of the sort. She is too gentle ever to make a fuss—and too dignified, besides. She behaved simply like an angel all through—a perfect martyr—she hardly said a word, but——” “But what?” “She did the only thing that was left her to do. She left him.” “I call that rather a strong measure!” “Oh, but alone! She did not leave him to go to another man!” Here the narrator of Ph?be Elles’ fortunes stopped and hesitated, a little overcome by a reflection that necessarily occurred to her. Presently she resumed. “Tell me, do you disapprove of poor Ph?be?” “I can hardly form an opinion, can I, without knowing the rights and wrongs of the case. But as a general thing—Was he unfaithful to her?” “No indeed, she only wishes he were!” Mrs. Elles broke out, in an uncontrollable burst of candour.{113} “Now, I’ve shocked you,” she said, looking up into his face and bitterly repenting her flippant outspokenness. She went on, nervously, “You think she ought to have stuck to her post—ought not to have thrown up her cards like that.” She was translating the thoughts that she thought she could read on his face, and expostulating with them. “But still, you know, I had—a woman has surely a right to live her own life?” “Only another phrase for selfishness,” he retorted vehemently. “I hate it. Nobody has a right. Our lives are far too inextricably bound up with other lives for us to be able to assume complete freedom. We can’t live our own lives—anything like it—for the very sufficient reason that it isn’t to be done without spoiling other people’s.” “But you seem to be able to manage to do it—live your own life—in the way I mean?” Mrs. Elles retorted, in the heat of argument, carrying the war into the enemy’s country. “I am a selfish beggar, I daresay, and don’t practice what I preach.” He spoke sharply, bending down over his drawing, and she felt that she had been tactless to force the personal application. She fancied that it was a touch of remorse at his curtness that made him say presently, in a benignant manner, “And what is your friend doing now?” “Oh, Ph?be is all right for the present. She is{114} comparatively free; she does not have to sit opposite that man at breakfast every morning and listen to his coarse jokes and shiver at his impossible manners all day long. Now, she is in the society of—persons—congenial to her, at least.... I really must write to Ph?be.” “Don’t bring her here, for heaven’s sake!” exclaimed Rivers, in real or affected alarm. “I should have to pack up my traps and bolt at once.” “Oh, don’t be afraid of poor Ph?be!” pleaded Mrs. Elles, not without some appreciation of the humour of the situation. “You really wouldn’t mind her if you knew her, I do assure you. Anyhow she wouldn’t be any worse than I.” “Oh, by Jove, though, but she would! A woman with a grievance is worse than anything else in the world.” “Of course,” Mrs. Elles replied, with some dignity—she did not like being snubbed, even in the person of her pseudo-self,—“I am not thinking of asking Ph?be here. I shall not even put an address when I write. I will send the letter to a friend to forward. You know I have my own reasons for not wishing the world to know where I am—at present.” She made this statement for about the hundredth time, and the artist, as usual, completely ignored the allusion to her ambiguous position at Greta Bridge. And yet—he was obviously Bohemian, but of the world where such social rules are used to be enforced.{115} Another instance of the anomalousness of the artist nature! She was not without tact, though she was so impulsive, and she now fancied, with the morbid and strained apprehension of one whose feelings are deeply engaged, that he was colder to her as they walked home together. She felt, in some indefinable way, that she had lost ground with him, and that her relation of and flippant comments on the story of Ph?be Elles had been the cause of it. Her brain was working furiously as she walked on, treading rough and smooth at his side, her head bowed, and her eyes fixed on the enormous dried-up hoof marks that the cows had made on their way down the bank to drink at the ford, and into which she sedulously and mechanically made a point of fitting her little foot. Higher up, in the upland field, the footpath was so narrow that she was obliged to walk, not beside, but in front of Rivers, who was universally beloved of farmers because of his fixed principle never heedlessly to widen a footpath, though he would fight tooth and nail for the right of way. He and she were thus perforce more or less silent, but nothing would have surprised the modest artist more than to think that he himself was the subject of the cogitations that were agitating the brain behind the little knot of brown curls which was presented to his gaze, as they walked along about a yard apart from each other. “I have vexed him—I have shocked him! He is a{116} gentleman, and he isn’t modern, thank God!—and I have talked flippantly of things that a gentleman—and an old-fashioned gentleman—takes seriously. He has a higher moral standard than I have, and I have been fool enough to let him see that mine is lower. How tiresome!” Then she consoled herself a little. “He is sweet, but he is not quite human. It is very easy to talk about duties and self-effacement and all that, but what can a bachelor—he is not married, I am sure—what can a hermit, a recluse, know of the stress of life? How can a bachelor possibly enter into the agonies of the married? How can Alastor sympathize with the miseries of Incompatibles?” “You must think me a very odd kind of woman,” she said to him that night, adding hastily: “That is, if you think about me at all.” It was a habit of hers to put leading questions of this kind to the artist, but generally, like Pilate, she stayed not for an answer, and nervously hastened to fill up the pause by a further remark of her own. The result was a somewhat one-sided conversation. “Yes, I am mysterious, I suppose,” she went on, leaning her elbows on the table in front of her and looking fixedly at him through her glasses. She had drunk nothing but water at dinner, yet her cheeks burned with an unaccountable flush, and her eyes were bright with excitement. “How strange it is!” she went on. “You cannot have the remotest idea of what I am really like—as if{117} it mattered!” She laughed apologetically. “It is strange, though, to think that though we are such friends, you have never seen my face.” “You mean because you wear those glasses?” he replied, in the blunt, matter-of-fact way in which he generally did receive her personal allusions, and which disconcerted her and drove her to utter desperation sometimes. “I suppose you have some good reason for wearing them?” “I have a reason, but I don’t know if it is a good one,” she replied in tones sharp from nervousness. “You wear them under advice, I imagine?” “No, really my own idea,” she said, airily. “Shall I take them off? Tell me to, and I will!” Her voice was trembling, her hands were twitching with the overmastering desire to do away, once for all, with this absurd barrier between them. A woman, shorn of her powers, mulcted of her charm, handicapped, at the very moment when she needed the full arsenal of her feminine armoury! That was what she was, and his imperturbability irritated her vanity, and made it, for the moment, paramount. She realized the full gravity of the situation, she felt it a turning point, she had attached an almost fetish-like importance to the insignia of her virtuous resolutions, but in the wild desire to assert her womanhood that mastered her now, she was prepared to abandon anything and everything that stood in the way of its accomplishment. “Shall I take them off? Shall I?” was her irre{118}sponsible cry. “You have advised me to. Remember that.” There was a pause—a century of vital emotion for her, the mere opportunity for an added touch of the brush on to a ticklish corner of his foreground for the painter. “Did I?” he asked, carelessly, as she deliberately laid aside the spectacles, and looked him full in the face. But the heavens did not fall or the solid earth fail, and with the single unconcerned remark: “I should not have said that your eyes were at all weak!” the painter continued tranquilly to deposit brushes full of diluted sepia and water on to his drawing. There were tears in her eyes next time she raised them.","sourceLink":"http://novel.tingroom.com/duanpian/2761/76192.html","bookId":1341,"book":{"id":1341,"title":"The Human Interest","description":"简介： One dull afternoonand it was in summera London authoress of some repute, whose nom-de-guerre was Egidia, was wandering along the pavement of a dull and imposing street in Newcastle. Day was beginning to decline, but the approach of evening was not al...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2761","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
