{"id":75396,"no":115,"title":"Page 115","content":"Elise nodded and then went into a kind of stasis. She didn’t want him to go, but knew he didn’t feel comfortable staying—and she couldn’t blame him.\\n\\n “Shit,” Axe breathed. “Come here.”\\n\\n Safe in his arms, she relaxed and held him close, feeling his warmth and strength.\\n\\n “I wish there was something I could do to help you,” he whispered as he rubbed her back. “I feel like I’m bad for you.”\\n\\n “No, you’re not.”\\n\\n After a while, she said, “Actually …” Pulling away from him, she took a deep breath. “There is something you could do for me.”\\n\\n “Name it,” he replied. “And it’s yours.”\\n\\n FORTY-SIX\\n\\n The following evening, Rhage and Mary let Bitty go to the Audience House again to see her uncle.\\n\\n It wasn’t any easier, Mary decided. Nope. Not something you got used to—especially not after Rhage’s getting shot.\\n\\n And as the Mercedes took off down the hill once more, she and Rhage went back into the house and stalled out in the foyer. The mansion was largely quiet, First Meal being cleaned up, the Brothers going on about their nights, the shellans, too.\\n\\n “I kind of feel left behind,” she said as she went over and sat on the lower step of the staircase. “You know, our lives are ending in a way. Everyone else is going on. I mean, I realize that’s sadness talking, but it’s how I feel.”\\n\\n Rhage came across and joined her. “I’m with you.”\\n\\n She glanced at him. “I’m so glad you were wearing that vest last night. But why didn’t you tell me?”\\n\\n “It’s just an addition in gear. You know, after that last chest wound—that was too close a call, even for me. And with Bitty around …” He cleared his throat. “So, yeah, I asked Fritz to get me some. I tried a number of them out. And the one I had on last night is my favorite. Worked like a charm, too.”\\n\\n “Are you going to order another one?”\\n\\n He shrugged. “Guess so.”\\n\\n Mary put her arm around his shoulders—well, not all the way around because of his size. “Bitty was so glad you’re okay.”\\n\\n “She’s a sweet kid.”\\n\\n As Rhage looked at his hands and pretend-picked at his clipped nails, Mary felt a now-familiar mourning that she recognized she was going to have to live with for the rest of her life. There would be times when it wouldn’t be this acute, she told herself. Times when it was even worse. But it was now her companion, a scar on her insides that was always going to be there.\\n\\n She didn’t have to ask Rhage to know that it would be the same for him.\\n\\n “Do you have any regrets?” she asked softly.\\n\\n “About taking her in?”\\n\\n “Yes.”\\n\\n He was quiet for a long time, and she studied his handsome profile. His blond hair needed a trim. His cheeks seemed hollower than usual. And the grim light in those beautiful blue eyes made him look so much older.\\n\\n As she rubbed his back, she felt the beast following her touch as she passed over his muscle shirt, the tattooed representation shifting to stay with her.\\n\\n “I don’t know,” he said. “This is pretty rough. This is really hard. But no, I would still have wanted to take her in. If all I’m supposed to get is two months of being her father to tide her over to her rightful home? Then I’ll be grateful for what I was given. I’d rather me suffer for the next thousand years over not having her than for her to have been alone in the world, getting those arms and legs fixed, wondering where she was going to end up. That trade-off ’s worth it to me.”\\n\\n Mary laid her head on his biceps. “That’s how I feel, too.”\\n\\n “I owe you an apology, by the way.”\\n\\n “About what?”\\n\\n “I should have told you about what they were going to do to Bitty’s limbs. I didn’t want to concern you, and I was hoping it was all going to be okay.”\\n\\n “Oh, God … not to worry. Water under the bridge.”\\n\\n “Yeah.”\\n\\n They sat there for oh, so long, the sounds of conversation in the kitchen and a distant vacuum and Wrath up in his study talking to someone trickling down.\\n\\n Eventually, Boo, the black cat, padded by, the animal curling into a sit right in front of them.\\n\\n “Have you got something to tell us, Boo?” Mary murmured. “We could use some good news.”\\n\\n A couple of meows were released, but they were hard to translate. And then Boo kept on going, attending to very important feline business, clearly.\\n\\n “Did you talk to Marissa about how it was going to work?” Rhage asked. “You know … and when?”\\n\\n Mary took a deep breath. “A social worker went down tonight to check Ruhn’s cottage again. There will have to be regular welfare visits there, but V did all the due diligence brilliantly. Oh—and it turns out Ruhn’s employer has access to schooling for Bitty. They’re totally willing to help Ruhn get her into a program. That would be fantastic.”\\n\\n “She won’t know anyone.”\\n\\n “She didn’t know anyone when she came into this house. But she adapted.”\\n\\n “They won’t know what she likes to eat. Her ice cream—she’s in a mint chocolate chip phase now.”\\n\\n “She’ll tell them.” Mary rubbed her eyes. “I’ll help her pack up her things. I think it’s best that we don’t draw it out longer than we have to. The transition is going to be hard enough on her without her having to stay in limbo.” \\n\\n","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-115.html","bookId":1778,"book":{"id":1778,"title":"Blood Vow (Black Dagger Legacy #2)","description":"Storyline: The Black Dagger Brotherhood continues to train the best of the best to join them in the deadly battle against the Lessening Society. Among the new recruits, Axe proves to be a cunning and vicious fighter—and also a loner isolated because of personal tragedy. When an aristocratic female needs a bodyguard, Axe takes the job, though he’s unprepared for the animal attraction that flares between him and the one he is sworn to protect. \\n For Elise, who lost her first cousin to a grisly murder, Axe’s dangerous appeal is enticing—and possibly a distraction from her grief. But as they delve deeper into her cousin’s death, and their physical connection grows into so much more, Axe fears that the secrets he keeps and his tortured conscience will tear them apart. \\n Rhage, the Brother with the biggest heart, knows all about self-punishing, and he wants to help Axe reach his full potential. But when an unexpected arrival threatens Rhage and Mary’s new family, he finds himself back in the trenches again, fighting against a destiny that will destroy all he holds most dear. \\n As Axe’s past becomes known, and fate seems to be turning against Rhage, both males must reach deep—and pray that love, rather than anger, will be their lantern in the darkness.\\n","cover":"https://allnovel.net/images/blood-vow-black-dagger-legacy-2.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-vow-black-dagger-legacy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:32:56 AM"}}
