{"id":75405,"no":124,"title":"Page 124","content":"“No,” she said softly. “Not terrific. But the biggest fallacy people sell themselves is that they should be happy all the time.”\\n\\n “I’ve never believed that. And you’ve just proved my position all over again.”\\n\\n He leaned to the side and opened the door; then he walked away without looking back.\\n\\n Which was fine.\\n\\n She was going to do the same.\\n\\n Once outside, Elise dematerialized back to her house, and after she went in through the front door, she proceeded directly to her father’s study. Knocking on the closed panels, she waited … and then let herself in.\\n\\n He was, as always, at his desk. Dressed impeccably. Shuffling papers. Working on his investments.\\n\\n “Well, good evening, daughter mine. How fare thee?”\\n\\n Elise ditched the preamble and sat down without being invited to do so. “I’m moving out as soon as I find a suitable place to live. I have some money that mahmen left me, and I’m also going to be taking on more hours at the university for pay. I’d like to stay here while I apartment hunt, but if that makes you uncomfortable, I’ll locate other accommodations.”\\n\\n As her father dropped his pen, and his lower jaw, she nodded. “And yes, my mind’s made up. I’m sorry if this causes you any grief or embarrassment, and I would very much like to continue to have a relationship with you. That’s your choice, of course, and if you need to distance yourself from me temporarily or even permanently, it will break my heart, but I will understand.”\\n\\n She got back to her feet. “I need to go live my own life, on my own terms—and that’s not something that you, or anyone else, can grant me permission to do or withhold permission from me for. It’s up to me, and me alone. And actually … I’m really good with that.”\\n\\n FIFTY\\n\\n The following evening at around midnight, Mary stood to the side and watched Bitty walk Ruhn through the vestibule and into the great, colorful foyer of the Black Dagger Brotherhood’s mansion.\\n\\n Bitty’s uncle had been interviewed by Wrath, and actually all the males of the household, the night before—and you want to talk about a grilling? The poor guy had been two feet shorter after the interrogations were through, and Mary and Bitty had practically had to pour him into one of the beds down below at Darius’s.\\n\\n And then there had been the trip down South right after sunset, Ruhn, Rhage, and V heading back to where Ruhn stayed, and talking to his employer, who hadn’t required notice. There had been so little in terms of personal belongings that the three of them had been able to fill up some backpacks and duffels and dematerialize the stuff up here to Caldwell, traveling at jumps of fifty to a hundred miles.\\n\\n “Isn’t it beautiful!” Bitty exclaimed as she let go of the male’s hand and started to jump around. “And don’t worry, you get used to it. I promise!”\\n\\n Ruhn looked like his head was spinning as his eyes bounced around the gold leafing and the crystal and the columns. “It’s … well, I’ve worked in a big mansion. But nothing like this.”\\n\\n Bitty grabbed his hand again and dragged him into the billiards room. “Come meet the pool tables!”\\n\\n As the pair of them went off, Rhage put his arm around Mary and whispered, “His place was spotlessly clean, my Mary, but there was nothing in it. Just a bed and table with one chair. Breaks your fucking heart—he was prepared to make it work, though. His employer told me that Ruhn was going to take on more hours to put Bitty in school on the estate. He was ready to do his best.”\\n\\n At that moment, there was a chiming sound from the vestibule door and Mary glanced at the security screen. “Oh, it’s Saxton.”\\n\\n She went over and let the King’s attorney in. “Come to join the festivities?”\\n\\n The blond-haired lawyer was perfectly dressed as always, a cravat at his neck, his dark suit set off with a coral shirt and pocket square. And oh, dear Lord, did he smell good.\\n\\n And also, oh, dear Lord, did it feel great to be lighthearted enough to notice that kind of thing.\\n\\n Ever since Ruhn and Bitty had come forward with The Plan, as Mary thought of it, she felt as though her life had been returned to her. It was incredible. Everything was back to normal, almost like the pain and fear and uncertainty had never happened.\\n\\n And it was funny … Although Mary didn’t know firsthand what birth was like, she decided that she had been through something at least emotionally similar: She had been out of control, in pain, grinding through hours and days, terrified and in a nightmare that seemed to have no end. Then there had been some tearing, and a vital separation … only, in the end, to have her daughter in her arms, safe, the world righted once again, her life more complete than ever because the transition was over and everyone was okay on the other side.\\n\\n It was a miracle—and the pain, instead of crippling her and Bitty, had just made their bond stronger.\\n\\n “Actually,” Saxton said, “I’ve brought the paperwork Ruhn requested.”\\n\\n As the attorney took a folded sheaf of papers out of his inside pocket, Mary was very aware that both she and Rhage went totally still.\\n\\n “Ruhn just has to sign them,” Saxton explained gently.\\n\\n “Sign what?” the male said, as he came back into the foyer with Bitty. “Oh. Yes, please.”\\n\\n As he spoke, Saxton turned—and did a double take.\\n\\n “You haven’t met, have you,” Mary said. “Saxton, this is Bitty’s uncle, Ruhn. Ruhn, this is Saxton, keeper of all papers, strategist, and all-around great person.” \\n\\n","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-124.html","bookId":1778,"book":{"id":1778,"title":"Blood Vow (Black Dagger Legacy #2)","description":"Storyline: The Black Dagger Brotherhood continues to train the best of the best to join them in the deadly battle against the Lessening Society. Among the new recruits, Axe proves to be a cunning and vicious fighter—and also a loner isolated because of personal tragedy. When an aristocratic female needs a bodyguard, Axe takes the job, though he’s unprepared for the animal attraction that flares between him and the one he is sworn to protect. \\n For Elise, who lost her first cousin to a grisly murder, Axe’s dangerous appeal is enticing—and possibly a distraction from her grief. But as they delve deeper into her cousin’s death, and their physical connection grows into so much more, Axe fears that the secrets he keeps and his tortured conscience will tear them apart. \\n Rhage, the Brother with the biggest heart, knows all about self-punishing, and he wants to help Axe reach his full potential. But when an unexpected arrival threatens Rhage and Mary’s new family, he finds himself back in the trenches again, fighting against a destiny that will destroy all he holds most dear. \\n As Axe’s past becomes known, and fate seems to be turning against Rhage, both males must reach deep—and pray that love, rather than anger, will be their lantern in the darkness.\\n","cover":"https://allnovel.net/images/blood-vow-black-dagger-legacy-2.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-vow-black-dagger-legacy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:32:56 AM"}}
