{"id":75310,"no":29,"title":"Page 29","content":"And he was, absolutely, hired.\n Even if Axe hadn’t come across as the deadly force her father was looking for, Felixe had wrongly assumed Novo was a guy: There was no way this genteel chauvinist was going to stand for a female guarding his daughter, no matter how spectacular a soldier and professional Novo was. And that was just fucked up.\n But it worked in his favor.\n Because he wanted her—\n The job, he corrected. He wanted the job.\n “So I’ll be in touch,” Felixe said as he rose to his feet.\n “Yes,” Axe murmured to them both. “I think you will be. And I’ll give you my answer right now. I accept the position and I can start whenever you two are ready.”\n TEN\n Complete. Chaos.\n As the beast broke out of Rhage’s body, triggered by Bitty’s suffering, Mary covered the little girl on the exam table with her own body—although not from any fear that the dragon would hurt her.\n Parts of the ceiling were raining down, chunks of plaster falling from where the great dragon’s head had slammed into the panels. And then that barbed tail was slashing back and forth, splintering cabinets and scattering equipment, smashing into the sink and springing the pipes.\n As a spray of hot water golf-sprinklered all around and lights flickered, Havers and his staff had the exact wrong idea. Instead of freezing, they made themselves targets by bolting around, trying to get to an exit that was blocked by something that might eat them.\n But come on. Like any of them had dealt with this before?\n “Stop! Don’t move!” Mary barked.\n And that was when the beast roared.\n Mary turned her head to try to get one of her ears protected, but she wasn’t going to use her hands. Bitty was so exposed—\n Behind the dragon, the door to the exam room broke open, Zsadist, V, and Lassiter crowding in.\n “Close the door!” Mary yelled. “And stay out!”\n Her best shot for this not turning into complete carnage was to make contact with the dragon, soothe it, and keep the thing trained on her and Bitty. As long as she could get and keep its attention, no one was going to get hurt—\n The dragon’s jaw snapped closed. And then the beast seemed to shudder as its reptilian eyes swung around and focused on Bitty. Chuffing noises came out of its throat, and it took a step forward, the clawed foot landing heavy as construction equipment.\n Mary slowly straightened, letting Rhage’s alter ego see the child. “She’s okay. Come on, investigate for yourself.”\n The massive head of the monster lowered slowly, as if it didn’t want to spook the little girl, and as Mary backed off, the muzzle snuffled over Bitty. Worried sounds of inquiry came out, part nervous purr, part aching chest rattle.\n Bitty lifted her hand up and stroked the purple-scaled cheek. “I’m okay.…”\n Her voice was surprisingly strong, and then she smiled, as if the room wasn’t a wreck, and people weren’t scared to death, and she hadn’t been through torture.\n Mary put her palm on the bulging neck of the beast, feeling the muscle and the power. “It’s all right … shh … that’s right, snuffle over her.…”\n Without moving her head or even eyes, she whispered to Havers, “Tell me you got the bone reset.”\n In her peripheral vision, she saw the male straighten his hornrimmed glasses, which had gone cockeyed and a half. “I’m s-s-sorry—what?”\n “The bone,” Mary repeated in the same quiet, even tone. “Did you do what you needed to?”\n “Y-y-yes, I believe … yes. I n-n-n-need an X-ray to confirm.”\n “Okay, let’s not try to do that now.”\n The nurses clutched together even tighter, as if they were afraid of their boss challenging that.\n “I … no,” he said, “I agree it would not be advisable the now. Permit me to inquire—how long … ah, how long does he …?”\n “It all depends. But we’re going nowhere until Rhage comes back.”\n Bitty and the beast were still communicating with touch and sound, and as far as Mary was concerned, considering the distress that the girl had been in, the two of them could spend the next six hours together and the rest of the adults in the room were just going to have to suck it up.\n On that note, Mary glanced around and winced. This was going to run into some money, she thought, as she checked out the ruined floor, the battered ceiling, the debris field of glass-front cabinets. But then she looked back at her hellren and her little girl. The beast was a big part of their non-linear, freaky family, and deserved to be counted—\n The door opened a crack, and then Lassiter, in his game gear, stepped inside the room. As he held something out, Mary couldn’t see what it was—\n Wait a minute, was that a Snickers bar?\n “What are you doing?” she blurted as he cautiously approached.\n The beast snapped to attention, its jowls curling up in a snarl at the angel. But Lassiter was undaunted—so not a shocker.\n “Here,” he said. “Have a Snickers. You’re not yourself when you’re hangry.”\n There was a heartbeat of a pause. And then she couldn’t help it.\n She had to start laughing. “Really. Really?”\n And it was funny, as Lassiter looked over at her, his expression behind the open grille of the hockey mask was goofy—yet his eyes were anything but. That pupil-less, glowing stare was dead serious, offering her a kind of lifeline through the painful reality that she loved a child who had been horribly mistreated and that was something she was going to have to deal with for the rest of her days. \n","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-29.html","bookId":1778,"book":{"id":1778,"title":"Blood Vow (Black Dagger Legacy #2)","description":"Storyline: \n The Black Dagger Brotherhood continues to train the best of the best to join them in the deadly battle against the Lessening Society. Among the new recruits, Axe proves to be a cunning and vicious fighter—and also a loner isolated because of personal tragedy. When an aristocratic female needs a bodyguard, Axe takes the job, though he’s unprepared for the animal attraction that flares between him and the one he is sworn to protect. \n For Elise, who lost her first cousin to a grisly murder, Axe’s dangerous appeal is enticing—and possibly a distraction from her grief. But as they delve deeper into her cousin’s death, and their physical connection grows into so much more, Axe fears that the secrets he keeps and his tortured conscience will tear them apart. \n Rhage, the Brother with the biggest heart, knows all about self-punishing, and he wants to help Axe reach his full potential. But when an unexpected arrival threatens Rhage and Mary’s new family, he finds himself back in the trenches again, fighting against a destiny that will destroy all he holds most dear. \n As Axe’s past becomes known, and fate seems to be turning against Rhage, both males must reach deep—and pray that love, rather than anger, will be their lantern in the darkness.\n \n","cover":"https://allnovel.net/images/blood-vow-black-dagger-legacy-2.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-vow-black-dagger-legacy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:32:56 AM"}}
