{"id":75327,"no":46,"title":"Page 46","content":"“Not for long,” Lassiter murmured.\n “Excuse me?”\n “The casts.”\n Mary looked back at Bitty. The girl seemed perfectly content, reclining back and reading a magazine.\n “Six weeks seems like forever,” Mary whispered. “But you’re right. It isn’t.”\n The angel put his hand on her shoulder. “It’s all going to be okay.”\n Something in his voice reached her at her heart and eased the ache there sure as if he had given her a Tylenol for a sprained ankle.\n “Go,” he told her. “I’m not leaving her side.”\n “I love you, Lassiter,” she said without looking away from her daughter.\n “I know.”\n Mary glanced back at him. “Did you just quote Harrison Ford to me.”\n “Yes, Leia. And it’s also true. Go on, Mother, she’s safe.”\n Mary gave the angel a quick hug and then she left the mansion, going out through the vestibule to the Volvo station wagon she used. As she was getting in, her phone went off and she dumped half her purse out trying to get to the thing in case Bitty needed—\n It was a text from Rhage.\n Can’t wait till coast is clear today. Meet me in tub?\n Mary laughed. “Coast is clear” was the code phrase they used for making love. And it was funny, ever since Bitty had come into their lives, the sex had gotten even better because it had to be planned, snuck in, kept a secret.\n It’s a date, she texted back. But I’ll fill the Jacuzzi so the level is right.\n Nobody wanted a repeat of the deluge that had happened the last time they’d tried to have sex in a bubble bath. Besides, Lassiter had already purchased all of the Little Mermaid merch in the United States. And where the hell would he get a second stuffed tarpon the size of a Volkswagen?\n Then again, that was a question best left unanswered.\n Mary was still smiling when she pulled up to Safe Place about twenty minutes later. As she headed in through the garage, the feeling that all was right in her world was like having sunshine pouring down over her body, her step light as a breeze, a little tune humming up and out of her throat.\n “Hey, everyone,” she said to the group making gingerbread men in kitchen. “Oh, this smells amazing in here.”\n She greeted a couple of the kids and their mahmens, glad that the human Christmas tradition she had passed on was being put to good use.\n “Nice work,” she murmured to one little guy who was covering his cookie with enough frosting to put a red and green blitz on half of Caldwell.\n The stairs to the second floor were in the front of the rambling house, and she was still humming as she ascended to the top landing. Her office was not far from Marissa’s, but when she put her head into her boss’s work space, the female wasn’t there.\n It felt really good to prioritize in her mind the work for the night: the reports she wanted to finish up, the meeting with the intake supervisor, and then the community meal right before she would go back home.\n So much easier than dealing with the trauma of what had gone down at Havers’s clinic.\n She was behind her desk, answering email, talking on the phone, about to transition into her report-writing mind-set, when she realized she hadn’t kept up with tradition.\n “… think that is a really healthy solution,” she said to the female on the line. “Your being close to your family is a good thing. You need extra help and support during this transitional period.”\n The survivor she was speaking with had been in the house for about eight months, the victim of an abusive boyfriend who had threatened to kill her when she’d told him she was finally leaving him after twenty-two years. Fortunately, she had had Safe Place to come to and be protected in as she had gradually unpacked all the damage from decades of abuse.\n Now she was out on her own, and as for the boyfriend?\n He was doing better, too.\n Although that wasn’t a result of personal introspection and growth. That was because Butch and Rhage had paid him a visit one evening right before dawn.\n Mary hadn’t asked a lot of questions. Actually, there had been only one: Was the bastard still breathing? When that had been answered in the affirmative, that was all she’d needed to know—and it went without saying that the male wasn’t going to be bothering his ex anymore. Not if he wanted to keep his arms, legs, head, and testicles where they were supposed to be.\n “I’m always here for you,” Mary said, meaning every word. “Okay, great. I’ll look forward to it. Bye, now.”\n As she hung up, she opened Facebook on her computer and signed in to the closed group for vampires only. She hadn’t checked the night before, and her buoyant mood meant, for once, she didn’t have a stomach ache as she went through the postings that had absolutely nothing to do with Bitty in the slightest.\n “Nailed it,” she said as she went to—\n She had almost signed out when she noticed the red-flagged number 1 by the messenger icon.\n For some stupid reason, she looked around the room. Like maybe the person it was actually intended for might materialize behind her desk or maybe walk through her open door.\n Mary had never gotten a message before on her account. She wasn’t a frequent FB user at all. In fact … the only post she had ever made had been the one asking if anybody was familiar with Bitty’s family—specifically that uncle the girl had talked about right after her mother had passed. The one who had supposedly been imminently coming for her, in spite of the fact that her mahmen had never mentioned him or given any forwarding address for any family whatsoever. \n","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-46.html","bookId":1778,"book":{"id":1778,"title":"Blood Vow (Black Dagger Legacy #2)","description":"Storyline: \n The Black Dagger Brotherhood continues to train the best of the best to join them in the deadly battle against the Lessening Society. Among the new recruits, Axe proves to be a cunning and vicious fighter—and also a loner isolated because of personal tragedy. When an aristocratic female needs a bodyguard, Axe takes the job, though he’s unprepared for the animal attraction that flares between him and the one he is sworn to protect. \n For Elise, who lost her first cousin to a grisly murder, Axe’s dangerous appeal is enticing—and possibly a distraction from her grief. But as they delve deeper into her cousin’s death, and their physical connection grows into so much more, Axe fears that the secrets he keeps and his tortured conscience will tear them apart. \n Rhage, the Brother with the biggest heart, knows all about self-punishing, and he wants to help Axe reach his full potential. But when an unexpected arrival threatens Rhage and Mary’s new family, he finds himself back in the trenches again, fighting against a destiny that will destroy all he holds most dear. \n As Axe’s past becomes known, and fate seems to be turning against Rhage, both males must reach deep—and pray that love, rather than anger, will be their lantern in the darkness.\n \n","cover":"https://allnovel.net/images/blood-vow-black-dagger-legacy-2.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-vow-black-dagger-legacy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:32:56 AM"}}
