{"id":75344,"no":63,"title":"Page 63","content":"“I don’t know how to be when we see her,” Rhage said. “I mean, you know, how to be normal.”\n “I don’t either.”\n They’d decided it made no sense to tell her about the male showing up. What if he turned out to be a faker? How cruel would that be? And yet … how were they going to pretend to Bitty that everything was fine and nothing unusual was going on?\n That was going to require acting skills far out of her league.\n Mary’s stomach ache, which had begun riiiiiight after she had read that private message back in her office, got even worse as they started up the mansion’s drive, the ascent seeming to compress the unprocessed omelet and bagel, which she’d had at First Meal hours before, into a cement block.\n As the great gray manse came into view, with its gargoyles and its countless windows and its towering, monolithic mass, she felt like she couldn’t breathe.\n “Take your time parking,” she muttered as Rhage slowed to go around the winterized fountain in the center of the courtyard. “God …”\n He eased in between Qhuinn’s second Hummer and V’s new R8. Turned off the engine and the lights. Even undid his seat belt. But neither of them made a move to get out. They just stared ahead, at the rolling, snow-dusted lawn that dipped down to the edge of the forest … at the drop to the valley below … at the show of stars above.\n There was so much ugliness that she felt prepared to deal with. And by that, she didn’t mean that she was excited to see tragedy or disease or loss up close and personal. But she at least had frames of reference for all of that.\n This?\n Well, life was just full of surprises, wasn’t it.\n And all things considered, she would have rather learned what winning the lottery was like. Or maybe try going around the world. Or becoming president of the United States.\n But not this bungee cord of learning she wasn’t ever going to be a mom. And then finding out she was. And then having all of that taken away.\n Potentially taken away, she reminded herself.\n Plus on top of that, Bitty was in a damn wheelchair, still recovering from what they’d had to do to her at Havers’s.\n “Come on,” she said. “Let’s go see her.”\n They got out together and reunited at the trunk of the muscle car, Rhage putting his arm around her shoulders. As they came up to the fountain, she was sad that it had been all drained and tarped up: The gentle fall of the sparkling water was something she had come to associate with home. But winter in upstate New York did not offer the kind of climate where you wanted exposed exterior pipes to be full of H2O, even if the system was running.\n The main entrance to the Brotherhood mansion looked like a cathedral’s front door, a pile of broad stone steps leading up to a portal made all the more regal because of the carvings that graced its jambs. Rhage led the way into the vestibule, and then they put their faces in front of the camera and waited for someone, likely Fritz, to allow them entrance.\n The whole time, an inner voice was screaming that she couldn’t do this, she couldn’t meet Bitty’s eyes without being honest, she couldn’t lie by omission, she couldn’t—\n “Good evening, master and mistress,” the ancient butler said with a smile as he pulled the heavy door wide. “How fare thee?”\n Like I’ve been shot through the heart, Fritz, thank you.…\n Mary stepped over the threshold. Frowned. Looked around.\n At first, she didn’t understand the sound she was hearing. Laughter, yes. And it was Bitty—but why was it accompanied by—\n A water balloon flew right in front of Mary’s face, and it was a case of duck or get soaked. And then Bitty was right on its tail, running full tilt out of the dining room, her hair streaming behind her, her shirt wet, one red and one blue water balloon in her hands.\n “What the hell!” Rhage barked as he marched inside.\n “Hi, Mom! Hello, Father!”\n The little girl kept right on going into the billiards room. And yup, what do you know, Lassiter was on her, a yellow balloon high over his shoulder—at least until he threw it at the girl, catching her solidly in the back. The squealing sound was all delight—and then Bitty twisted around without missing a beat and nailed Lassiter full in the face.\n Perfect aim.\n Splash!\n But that wasn’t the point.\n As the wet bomb went off, drenching the angel’s face and all of his blond-and-black hair, Rhage grabbed on to the male and ripped him right off his feet, landing him back-flat on the ground—and then he double-palmed him by the neck like he was prepared to choke the life out of the immortal.\n Or … something like that. Whatever.\n Mary rushed over. “Rhage—”\n “What the hell did you do to her! Where are her casts!”\n But then the mom in her made Mary switch gears. “Yeah, what the hell! She’s not supposed to be out of them for six weeks! And not even walking!”\n Lassiter tried to answer, but his crushed windpipe wouldn’t let any air out. Bitty was the one who solved the mystery.\n “He healed my arms and legs! Don’t hurt him! He made them better—honest! Don’t hurt him, Father.”\n Instantly, Rhage released Lassiter and then fell back on his butt as if he realized the show of violence might have triggered memories.\n But Bitty didn’t seem worried about that. “See?” She hopped from one foot to another. Spun around with her arms out. Laughed in a happy giggle. “All better!” \n","sourceLink":"https://allnovel.net/blood-vow-black-dagger-legacy-2/page-63.html","bookId":1778,"book":{"id":1778,"title":"Blood Vow (Black Dagger Legacy #2)","description":"Storyline: \n The Black Dagger Brotherhood continues to train the best of the best to join them in the deadly battle against the Lessening Society. Among the new recruits, Axe proves to be a cunning and vicious fighter—and also a loner isolated because of personal tragedy. When an aristocratic female needs a bodyguard, Axe takes the job, though he’s unprepared for the animal attraction that flares between him and the one he is sworn to protect. \n For Elise, who lost her first cousin to a grisly murder, Axe’s dangerous appeal is enticing—and possibly a distraction from her grief. But as they delve deeper into her cousin’s death, and their physical connection grows into so much more, Axe fears that the secrets he keeps and his tortured conscience will tear them apart. \n Rhage, the Brother with the biggest heart, knows all about self-punishing, and he wants to help Axe reach his full potential. But when an unexpected arrival threatens Rhage and Mary’s new family, he finds himself back in the trenches again, fighting against a destiny that will destroy all he holds most dear. \n As Axe’s past becomes known, and fate seems to be turning against Rhage, both males must reach deep—and pray that love, rather than anger, will be their lantern in the darkness.\n \n","cover":"https://allnovel.net/images/blood-vow-black-dagger-legacy-2.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-vow-black-dagger-legacy-2.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:32:56 AM"}}
