{"id":96682,"no":5,"title":"Page 5","content":"\"Get dressed, young lady!\"\n \"But this isn\u0027t - \" I began.\n \"You\u0027re lucky I found you and not the police!\"\n The police? I had no choice. I couldn\u0027t spend my first day on Earth in jail. I picked up a pink top and a pair of matching shorts. I had seen Earthees before, of course, and I knew how they dressed, but\n Finally I stuck my new two legs into different holes and struggled to pull the shorts up. I tried to fasten the button but the shorts were too tight. So I let it go and reached for the shirt.\n I tried inserting my head. Choking, I realized I had an arm hole. I rearranged the top and managed to pull it down, but it was much too big and hung off my shoulders like seaweed clinging to the edge of a rock. The shirt came down to my knees, so I tied it around my waist.\n I knew I must have been completely dressed when Earthlady grinned with relief.\n \"You kids are always breaking the rules!\" she chided, like a grandma.\n An Earthee! Speaking to me, as if I were one of her own kind. Fascinated, I forgot my fear. In any case, she seemed as harmless as a starfish. I stared at her crinkly beige skin and her purple straw hat, her fiery attitude hunching her over more than her aging years.\n \"You\u0027re too pale to lay out without clothes,\" she\n I nodded respectfully, and shoved white open-toed shoes on my two new feet. My two new feet! I was a real Earthee!\n Earthlady continued to observe me. I tried to stand up, but I immediately fell over.\n \"I just bought these legs,\" I joked, choking the words out.\n \"You must have gotten up too quickly,\" she said, extending her hand.\n \"Blood rushed to my head.\"\n She guided me straight up and held me steady as we began to walk - I for the first time in my life!\n \"You forgot your backpack,\" Earthlady said.\n \"But that\u0027s not - \" I began, but she had already left me to kindly retrieve the bag.\n I teetered on one leg, then the other. I clung to the lifeguard stand. I didn\u0027t have water for support, and the air was so thin. Okay, Lills, I said to myself. Either walk to Seaside High or swim all the way to the freezing Atlantic!\n \"You\u0027re dehydrated!\" the woman said, pulling a bottle of water from her huge canvas purse.\n I pressed my lips around the opening and sucked the contents down in one gulp.\n \"Oh, my. You are thirsty!\"\n \"Which way to Seaside High?\" I asked, choking, as she helped me put on the backpack.\n She pointed past the beach to the hill, where a large school overlooked the Pacific Ocean.\n \"Well, in that case, you\u0027re late, kid,\" she said sternly. \"You\u0027d better get moving!\"\n \"I\u0027m walking as fast as I can,\" I said, starting to balance on my own.\n I stepped on shells, cigarette butts, and empty soda cans. But I quickly recovered and marched up to the top of the beach, where I walked on deep, green grass. It bent easily and felt cushiony, even tickling my toes. A paved hilly road lined with palm trees led to Seaside High School. I was exhausted when I arrived at the entrance. An actual Earthee school! It was much bigger than Pacific Reefs High.\n I was breathing and walking pretty well by now. I once read it takes a whole year for an Earth child to stand, much less walk, and I\u0027d done it in less than an hour! Maybe mermaids are a higher life form after all.\n Earthdudes and dudettes were leaning against palm trees, walking briskly up stairs, and sitting on the lawn. Tall ones, short ones, skinny and fat, red\n Would they know I was a mermaid? Would they pounce on me? Harpoon me? I sucked in a deep breath of air and slowly walked up the front stairs, with the help of the railing, but a girl making out with her boyfriend blocked the way. I carefully stepped around them and opened a huge wooden door. I entered a corridor filled with tall cabinets, smooth to my touch, not rusted like the metal at home. One minute it smelled like water lilies, then the next it smelled like an old finball. I read the signs hanging on the walls: MATH CLUB MEETING CANCELED. CONGRATULATIONS, SHARKS, ON A WINNING YEAR! FESTIVAL OF FIREWORKS - FRIDAY NIGHT.\n I was mesmerized by all the Earthly activity - laughing, shouting, running, kissing. Some Earthteens dressed as if they\u0027d come straight from the Underworld - tattoos, pierced ears, noses, eyebrows, and tongues. Others dressed as if they\u0027d come from a finball game. Many looked at me as I walked by. Could they tell I was a mermaid? I felt dizzy and leaned against a cabinet to catch my breath.\n A guy in a Go SHARKS! shirt approached me, leaned in, and reached his hand to my side. I jumped away.\n \"That\u0027s my locker, chick.\"\n Shocked, I raced away and was thrust into the\n I noticed a wall clock. Nine fifty-five. I was way late for our stadium meeting. And where was the stadium, anyway? Where was he? I peered into a laboratory classroom. Then I looked into an office where a flustered woman was sorting papers at a cluttered wooden desk. Apparently I looked lost.\n \"May I help you?\" the round Earthwoman asked. She seemed to be helpful and trusting.\n \"I\u0027m looking for - \"\n \"You must be Candy Hartman!\" she exclaimed. \"I\u0027m Mrs. Linwood, the school secretary. We\u0027ve been expecting you! I have all your paperwork here.\" She reached among the papers scattered on her desk. \"Welcome to Seaside!\"\n \"But I\u0027m not - \"\n \"Prepared? I know. It\u0027s hard joining school at the end of the year. But with your father being with the government, I\u0027m sure you\u0027re used to it! Quite exciting, really. But mum\u0027s the word!\" she said, strangely motioning her hand over her lips.\n \"We\u0027ve assigned you to Mr. Costello\u0027s class. I\u0027ll show you the way,\" she said, taking me by the arm. \"You\u0027ll fit right in!\"\n Fit right in? But I just learned to walk an hour ago!\n I was supposed to be in predators and prey class\n My cherub-faced escort stopped at a crowded classroom. Is this where Earthdude studied? A thousand wide-eyed sharks were staring at me! All I wanted to do was get my locket and leave. But suddenly I not only had legs, but new clothes, and now a new name.\n \"Good morning, Ms. Hartman, take a seat, please,\" the teacher said to me. He looked like Mr. Dorsal in cheap pants.\n The room was fascinating. Everyone sat on wooden seats with small tables attached, in neat rows. Lights hung from the ceiling, and the walls were plastered with pictures and maps.\n I folded my new legs together under my chair and quickly became stuck. Students stared at me as my legs banged against the desk. I noticed their legs dangled, their feet touching the floor.\n \"This isn\u0027t yoga class!\" said the leering girl who sat next to me.\n The clock read ten-thirty! I was stuck here, trapped from moving forward on my mission. But suddenly my new surroundings engaged me, tantalized me with the reality of all I\u0027d ever dreamed of. I, Waterlilly, was suddenly an Earthdudette myself! I immediately became engrossed with my Earth-school environment.\n I had learned a lot in Earth history, but a lifetime of study couldn\u0027t have prepared me for a real Earthee class. And the Earthees themselves were interesting - blonde girls with blue makeup on their eyelids, shorts, short skirts, dresses, chunky canvas shoes with string ties, or open-toed shoes. And each girl had different colored toenails - pink, purple, green. I wondered if it was cosmetic paint or if they were born that way.\n I glanced out the window, which gave a thrilling view of the sea in the distance. I watched the waves crashing against the shore. It was an incredible perspective, breathtakingly beautiful. I\u0027d never seen the ocean from such a height.\n \"Candy . . . Candy?\" Mr. Costello shouted, just as Mrs. Current always shouted at me. At least some things on Earth were the same. \"Can you name the four men sculpted in rock on Mount Rushmore?\"\n Rock group? I thought. \"Of course!\" I answered confidently. \"John, Paul, George, and Ringo!\"\n The class burst into laughter. A cute guy sitting next - who looked like Beach, only instead of white hair, he had sandy blond hair - nudged me in the legs. Everyone stared and giggled. I slunk back, feeling stupid.\n \"Miss Hartman, this is social studies, not MTV one-oh-one.\"\n The class laughed even more.\n \"Do you even know where Mount Rushmore is?\"\n The cute guy leaned toward me. \"Tennessee,\" he whispered.\n \"Tennessee!\" I shouted.\n The class laughed even louder.\n I stared at him with contempt. \"I thought it was,\" he whispered, shrugging his shoulders.\n \"Settle down, class,\" Mr. Costello said. \"Now let\u0027s review the presidential elections.\"\n I was fascinated with the rest of his lecture and forgot about the necklace and the time. Presidents, the electoral college, voting. I had never been interested in school in my whole life! But I seemed to be the only one listening. One boy had his head resting on his desk. The girl in front of me was scribbling hearts in a pink journal. Another boy was watching moving pictures on a small screen in his lap. In the sea all students were attentive, like merpuppets.\n Suddenly the bell rang.\n Mr. Tennessee picked up my social studies text\n \"My name\u0027s Calvin.\"\n \"My name\u0027s . . .\"\n \"I know your name. It\u0027s cool to meet you, Candy.\"\n \"Yeah . . . totally glacial,\" I said, distracted. \"Hey Calvin,\" I said inching close. \"I need help. Can you help me find - \"\n \"Your next class?\" he interrupted.\n What if Earthdude was sitting in my next class? I held out the slip of paper with my class schedule.\n \"Cool, you have geography. Same as me! This is your lucky day. I\u0027ll show you the way.\"\n \"Just hurry,\" I said.\n The moon was ticking.\n - a dumping ground for CDs, video games, candy wrappers, and books I\u0027d never opened.\n Robin was a mother\u0027s laundry dream. All dark colors. Never an accidental red bleeding into white. No need for bleach, no need for separate washes. I think the only reason Robin had a crush on me was because I changed my hair color with my changing mood. And my colors were all dark as well: black, purple, blue. She thought I was her soulmate. One day, I\u0027ll show up with white hair to see how much she really cares.\n \"Yeah, Droopy, one minute you\u0027re skipping like a\n \"Go away,\" I said, grabbing my Gameboy from my locker shelf.\n \"It\u0027s that fantasy girl,\" Robin teased, with more than a hint of jealousy. \"I\u0027m sick for one day and some babe steps in and wins your heart. Or should I say swims in?\"\n \"Yeah, ever since yesterday morning he\u0027s been on a major mood swing,\" Chainsaw quipped.\n \"Was she really pretty?\" Robin asked hesitantly, like she was waiting for a bomb to drop.\n \"She was beautiful!\" Chainsaw answered. \"And never to be seen again!\"\n \"Too bad.\" Robin smiled, cozying up to me. \"But I\u0027m here, if you need someone to resuscitate you again.\"\n \"Maybe she was a swimming instructor,\" Chainsaw suggested.\n \"She was alone,\" I said, shaking my head.\n \"Maybe she was a lifeguard,\" Chain said.\n \"Seaside\u0027s lifeguards wear red. She was wearing green,\" I said, glaring.\n \"Then maybe she was a mermaid!\" he declared loudly.\n \"What makes you say that?\" I exclaimed, dropping\n \"Makes sense. She\u0027s beautiful, swims in the ocean better than you do, saves your life, and disappears in the water.\"\n \"Sure, a mermaid,\" Robin teased dramatically. \"And you know what mermaids are like - they demand pearls and lobster, live in underwater castles, have kings for fathers and stare at themselves in their mirrors. You\u0027d better stick with humans, Spence. We\u0027re not so vain.\"\n \"Enough!\" I said.\n Chainsaw opened his locker and he and Robin giggled to themselves.\n \"Maybe I should start wearing green,\" Robin said.\n I slammed more texts into my backpack, wondering if I\u0027d ever see her again, wondering if I\u0027d ever really seen her in the first place.\n \"You\u0027ve got to help me! I\u0027m looking for this guy,\" I shouted urgently. \"He has my necklace, and I desperately need to get it back!\" \n","sourceLink":"https://allnovel.net/teenage-mermaid/page-5.html","bookId":2151,"book":{"id":2151,"title":"Teenage Mermaid","description":"Storyline: \n Spencer almost drowns in a surfing accident when a sparkling, golden girl saves him with a kiss of life before she suddenly disappears. Where did this dream girl come from, and will she return? Lilly rescues a boy from nearly drowning and dangerously steps out of her own watery world. Curious to explore this forbidden land, she\u0027s gotta find her handsome Earthdude. \n A silver heart locket is their only clue. \n Ellen Schreiber revamps a classic favorite with a funky magical romance that shows what transpires when boy meets girl, but discovers girl is really a . . .\n \n","cover":"https://allnovel.net/images/teenage-mermaid.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/teenage-mermaid.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:21:55 PM"}}
