{"id":67954,"no":21,"title":"Page 21","content":"Chapter 27 The Eel-Skinner\u0027s Perplexity\n Economists of the mid-Victorian period note that increasing numbers of people made their living by what was then called \"dealing,\" an inclusive term that referred to supplying goods and services to the burgeoning middle class. England was then the richest nation on earth, and the richest in history. The demand for all kinds of consumer goods was insatiable, and the response was specialization in manufacture, distribution, and sale of goods. It is in Victorian England that one first hears of cabinetmakers who made only the joints of cabinets, and of shops that sold only certain kinds of cabinets.\n The increasing specialization was apparent in the underworld as well, and nowhere more peculiar than in the figure of the \"eel-skinner.\" An eel-skinner was usually a metalworker gone bad, or one too old to keep up with the furious pace of legitimate production. In either case, he disappeared from honest circles, re-emerging as a specialized supplier of metal goods to criminals. Sometimes the eel-skinner was a coiner who could not get the stamps to turn out coins.\n Whatever his background, his principal business was making eel-skins, or coshes. The earliest eel-skins were sausage-like canvas bags filled with sand, which rampsmen and gonophs--- muggers and thieves--- could carry up their sleeves until the time came to wield them on their victims. Later, eel-skins were filled with lead shot, and they served the same purpose.\n An eel-skinner also made other articles. A \"neddy\" was a cudgel, sometimes a simple iron bar, sometimes a bar with a knob at one end. The \"sack\" was a two-pound iron shot placed in a strong stocking. A \"whippler\" was a shot with an attached cord, and was used to disable a victim head on; the attacker held the shot in his hand and flung it at the victim\u0027s face, \"like a horrible yo-yo.\" A few blows from these weapons were certain to take the starch out of any quarry, and the robbery proceeded without further resistance:\n As firearms became more common, eel-skinners turned to making bullets. A few skilled eel-skinners also manufactured sets of bettys, or picklocks, but this was demanding work, and most stuck to simpler tasks.\n In early January, 1855, a Manchester eel-skinner named Harkins was visited by a gentleman with a red beard who said he wanted to purchase a quantity of LC shot.\n \"Easy enough done,\" the skinner said. \"I make all manner of shot, and I can make LC right enough. How much will you have?\"\n \"Five thousand,\" the gentleman said.\n \"I beg pardon?\"\n \"I said, I will have five thousand LC shot\"\n The eel-skinner blinked. \"Five thousand--- that\u0027s a quantity. That\u0027s--- let\u0027s see--- six LC to the ounce. Now, then...\" He stared up at the ceiling and plucked at his lower lip. \"And sixteen... now, that makes it... Bless me, that\u0027s more\u0027n fifty pounds of shot all in.\"\n \"I believe so,\" the gentleman said.\n \"You want fifty pounds of LC shot?\"\n \"I want five thousand, yes.\"\n \"Well, fifty pounds of lead, that\u0027ll take some doing, and the casting--- well, that\u0027ll take some doing. That\u0027ll take some time, five thousand LC shot will, sometime indeed.\"\n \"I need it in a month,\" the gentleman said.\n \"A month, a month... Let\u0027s see, now... casting at a hundred a mold... Yes, well...\" The eel-skinner nodded. \"Right enough, you shall have five thousand within a month. You\u0027ll be collecting it?\"\n \"I will,\" the gentleman said, and then he leaned closer, in a conspiratorial fashion. \"It\u0027s for Scotland, you know.\"\n \"Scotland, eh?\"\n \"Yes, Scotland.\"\n \"Oh, well, yes, I see that plain enough,\" the eel-skinner said, though the reverse was clearly true. The red-bearded man put down a deposit and departed, leaving the eel-skinner in a state of marked perplexity. He would have been even more perplexed to know that this gentleman had visited skinners in Newcastler-on-Tyne, Birmingham, Liverpool, and London, and placed identical orders with each of them, so that he was ordering a total of two hundred and fifty pounds of lead shot. What use could anyone have for that?\n Chapter 28 The Finishing Touch\n London at the mid-century had six morning newspapers, three evening newspapers, and twenty influential weeklies. This period marked the beginning of an organized press with enough power to mold public opinion and, ultimately, political events. The unpredictability of that power was highlighted in January, 1855.\n On the one hand, the first war correspondent in history, William Howard Russell, was in Russia with the Crimean troops, and his dispatches to the Times had aroused furious indignation at home. The charge of the light Brigade, the bungling of the Balaclava campaign, the devastating winter when British troops, lacking food and medical supplies, suffered a 50 percent mortality--- these were all reported in the press to an increasingly angry public.\n By January, however, the commander of British forces, Lord Raglan, was severely ill, and Lord Cardigan--- \"haughty, rich, selfish and stupid,\" the man who had bravely led his Light Brigade to utter disaster, and then returned to his yacht to drink champagne and sleep--- Lord Cardigan had returned home, and the press everywhere hailed him as a great national hero. It was a role he was only too happy to play. Dressed in the uniform he had worn at Balaclava, he was mobbed by crowds in every city; hairs from his horse\u0027s tail were plucked for souvenirs. London shops copied the woolen jacket he had worn in the Crimea--- called a \"Cardigan\"--- and thousands were sold.\n The man known to his own troops as \"the dangerous ass\" went about the country delivering speeches recounting his prowess in leading the charge; and as the months passed, he spoke with more and more emotion, and was often forced to pause and revive himself. The press never ceased to cheer him on; there was no sense of the chastisement that later historians have richly accorded him.\n But if the press was fickle, public tastes were even more so. Despite all the provocative news from Russia, the dispatches which most intrigued Londoners in January concerned a man-eating leopard that menaced Naini Tal in northern India, not far from the Burmese border. The \"Panar man-eater\" was said to have killed than four hundred natives, and accounts were remarkable for their vivid, even lurid detail. \"The vicious Panar beast,\" wrote one correspondent, \"kills for the sake of killing and not for any food. It rarely eats any portion of the body of its victims, although two weeks past it ate the upper torso of an infant after stealing it from its crib. Indeed, the majority of its victims have been children under the age of ten who are unfortunate enough to stray from the center of the village after nightfall: Adult victims are generally mauled and later die of suppurating wounds; Mr. Redby, a hunter of the region, says these infections are caused by rotten flesh lodged in the beast\u0027s claws. The Panar killer is exceedingly strong, and has been seen to carry off a fully grown female adult in its jaws, while the victim struggles and cries out most piteously.\"\n These and other stories became the delicious talk of dining rooms among company given to raciness; women colored and tittered and exclaimed, while men ---especially Company men who had spent time in India--- spoke knowledgeably about the habits of such a beast, and its nature. An interesting working model of a tiger devouring an Englishman, owned by the East India Company, was visited by fascinated crowds. (The model can still be seen in the Victoria and Albert Museum.)\n And when, on February 17, 1855, a caged, fully grown leopard arrived at London Bridge Terminus, it created a considerable stir--- much more than the arrival, a short time previously, of armed guards carrying strongboxes of gold, which were loaded into the SER luggage van.\n Here was a full-sized, snarling beast, which roared and charged the bars of its cage as it was loaded onto the same luggage van of the London-Folkestone train. The animal\u0027s keeper accompanied the beast, in order, to look after the leopard\u0027s welfare, and to protect the luggage-van guard in the event of any unforeseen mishap.\n Meanwhile, before the train departed the station, the keeper explained to the crowd of curious onlookers and children that the beast ate raw meat, that it was a female four years old, and that it was destined for the Continent, where it would be a present to a wellborn lady.\n The train pulled out of the station shortly after eight o\u0027clock, and the guard on the luggage van closed the sliding side door. There was a short silence while the leopard stalked its cage, and growled intermittently; finally the railway guard said, \"What do you feed her?\"\n The animal\u0027s attendant turned to the guard. \"Does your wife sew your uniforms?\" he asked.\n Burgess laughed. \"You mean it\u0027s to be you?\"\n The attendant did not answer. Instead, he opened a small leather satchel and removed a jar of grease, several keys, and a collection of files of varied shapes and sizes.\n He went immediately to the two Chubb safes, coated the four locks with grease, and began fitting his keys. Burgess watched with only vague interest in the process: he knew that rough-copied wax keys would not work on a finely made safe without polishing and refining. But he was also impressed; he never thought it would be carried off with such boldness.\n \"Where\u0027d you make the impressions?\" he said.\n \"Here and there,\" Agar replied, fitting and filing.\n \"They keep those keys separate.\"\n \"Do they,\" Agar said.\n \"Aye, they do. How\u0027d you pull them?\"\n \"That\u0027s no matter to you,\" Agar said, still working.\n Burgess watched him for a time, and then he watched the leopard. \"How much does he weigh?\"\n \"Ask him,\" Agar said irritably.\n \"Are you taking the gold today, then?\" Burgess asked as Agar managed to get one of the safe doors open. Agar did not answer; he stared transfixed for a moment at the strongboxes inside. \"I say, are you taking the gold today?\"\n Agar shut the door. \"No,\" he said. \"Now stop your voker.\"\n Burgess fell silent.\n For the next hour, while the morning passenger train chugged from London to Folkestone, Agar worked on his keys. Ultimately, he had opened and closed both safes. When he was finished, he wiped the grease from the locks. Then he cleaned the locks with alcohol and dried them with a cloth. Finally he took his four keys, placed them carefully in his pocket, and sat down to await the arrival of the train at the Folkestone station.\n Pierce met him at the station and helped to unload the leopard.\n \"How was it?\" he asked.\n \"The finishing touches are done,\" Agar said, and then he grinned. \"It\u0027s the gold, isn\u0027t it? The Crimean gold--- that\u0027s the flash pull.\"\n \"Yes,\" Pierce said.\n \"When?\"\n \"Next month,\" Pierce said.\n The leopard snarled. \n","sourceLink":"https://allnovel.net/the-great-train-robbery/page-21.html","bookId":2678,"book":{"id":2678,"title":"The Great Train Robbery","description":"Storyline: \n Lavish wealth and appalling poverty live side by side in Victorian London -- and Edward Pierce easily navigates both worlds. Rich, handsome, and ingenious, he charms the city\u0027s most prominent citizens even as he plots the crime of his century, the daring theft of a fortune in gold. But even Pierce could not predict the consequences of an extraordinary robbery that targets the pride of England\u0027s industrial era: the mighty steam locomotive. \n Based on remarkable fact, and alive with the gripping suspense, surprise, and authenticity that are his trademarks, Michael Crichton\u0027s classic adventure is a breathtaking thrill-ride that races along tracks of steel at breakneck speed.\n \n","cover":"https://allnovel.net/images/the-great-train-robbery.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-great-train-robbery.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
