{"id":67964,"no":31,"title":"Page 31","content":"Chapter 41 A Final Inconvenience In fact, Pierce had been among the crowd that witnessed the dreadful episode of the opened coffin. He saw that the episode proceeded precisely as he had intended, and that Agar, in his hideous make-up, had escaped detection. When the crowd dissipated, Pierce moved forward to the van, with Barlow at his side. Barlow was carrying some rather odd luggage on a porter\u0027s trolley, and Pierce had a moment of disquiet when he saw the dispatcher himself take up the job of supervising the loading of the van. For if anyone considered it, Pierces behavior was distinctly odd. To all appearances, he was a prosperous gentleman. But his luggage was unusual, to say the least: five identical satchels of leather. These satchels were hardly the sort of items considered agreeable by gentlemen. The leather was coarse and the stitching at the seams was crude and obvious. If the satchels were unquestionably sturdy, they were also unmistakably ugly. Yet none was very large, and Pierce could easily have stowed them in the overhead luggage racks of his carriage compartment, instead of the luggage van. The van was ordinarily considered a nuisance, since it meant delays at both the start and the conclusion of the journey. Finally, Pierces manservant--- he did not employ a railway porter--- loaded the bags onto the luggage van separately. Although the servant was a burly character of evident strength, he was clearly straining under the weight of each satchel. In short, a thoughtful man might wonder why a gentleman of quality traveled with five small, ugly, extremely heavy, and identical bags. Pierce watched the dispatcher\u0027s face while the bags were loaded, one after another. The dispatcher, somewhat pale, never noticed the bags at all, and indeed did not emerge from his distracted state until another gentleman arrived with a parrot, and an argument ensued. Pierce drifted away, but did not board the train. Instead, he remained near the far end of the platform, apparently curious about the recovery of the woman who had fainted. In fact, he was lingering in the hope of seeing the padlock that he would soon be attempting to pick. When the dispatcher left, with a final sharp rebuke to his nephew, the young woman made her way toward the coaches. Pierce fell into step beside her. \"Are you fully recovered, Miss?\" he asked. \"I trust so,\" she said. They merged with the boarding crowd at the coaches. Pierce said, \"Perhaps you will join me in my compartment for the duration of the journey?\" \"You are kind,\" the girl said, with a slight nod. \"Get rid of him,\" Pierce whispered to her. \"I don\u0027t care how, just do it.\" Miriam had a puzzled look for only a moment, and then a hearty voice boomed out, \"Edward! Edward, my dear fellow!\" A man was pushing toward them through the crowd. Pierce waved a delighted greeting. \"Henry,\" he called. \"Henry Fowler, what an extraordinary surprise. Fowler came over and shook Pierce\u0027s hand. \"Fancy meeting you here,\" he said. \"Are you on this train? Yes? Why, so am I, the fact of the matter--- ah...\" His voice trailed off as he noticed the girl at Pierce\u0027s side. He displayed some discomfiture, for in terms of Henry Fowler\u0027s social world all the signals were mixed. Here was Pierce, dressed handsomely and showing his usual polish, standing with a girl who was, God knew, pretty enough, but by her dress and manner a very common sort. Pierce was a bachelor and a blood, and he might travel openly with a mistress for a holiday by the sea, but such a girl would certainly be dressed with gentility, which this girl was not. And contrariwise, were this creature a servant in his household, he would hardly have her out and about in so public a place as a train station unless there was some particular reason for it, but Fowler could not imagine a reason. Then, too, he perceived that the girl had been weeping; her eyes were red and there were streaks upon her cheeks, and so it was all most perplexing and unusual, and--- Pierce put Fowler out of his misery. \"Forgive me,\" he said, turning to the girl. \"I should introduce you, but I do not know your name. This is Mr. Henry Fowler.\" The girl, giving him a demure smile, said, \"I am Brigid Lawson. How\u0027d you do, sir.\" Fowler nodded a vaguely polite greeting, struggling to assume the correct stance toward an obvious servant girl (and therefore not an equal) and a female in distress (and therefore deserving of gentlemanly conduct, so long as her distress sprang from some morally acceptable exigency). Pierce made the situation clearer. \"Miss, ah, Lawson, has just had a most trying encounter,\" Pierce said. \"She is traveling to accompany her deceased brother, who is now situated in the van. But a few moments past, the bell rang, and there was hope of revival and the casket was opened---\" \"I see, I see,\" Fowler said, \"most distressing---\" \"---but it was a false alarm,\" Pierce said. \"And thus doubly painful, I am certain,\" Fowler said. \"I offered to accompany her on the journey,\" Pierce laid. \"And indeed I should do the same,\" Fowler said, \"were I in your place. In fact...\" He hesitated. \"Would it seem an imposition if I joined you both?\" Pierce did not hesitate. \"By all means,\" he said cheerfully. \"That is, unless Miss Lawson...\" \"You are ever so kind, you two are,\" the girl said, ;with a brave but grateful smile. \"Well, it\u0027s settled, then,\" Fowler said, also smiling. Pierce saw that he was looking at the girl with interest. \"But would you like to come with me? My compartment is just a short way forward.\" He pointed up the line of first-class coaches. Pierce, of course, intended to sit in the last compartment of the final first-class coach. From there, he would have the shortest distance to travel, over the tops of the cars, to reach the luggage van at the rear. \"Actually,\" Pierce said, \"I\u0027ve my own compartment down there.\" He pointed toward the back of the train. \"My bags are already there, and I\u0027ve paid the porter, and so on.\" \"My dear Edward,\" Fowler said, \"How did you get yourself way back there? The choice compartments are all toward the front, where the noise is minified. Come along: I assure you, you\u0027ll find a forward compartment more to your liking, and particularly if Miss Lawson feels poorly....\" He shrugged as if to suggest the conclusion was obvious. \"Nothing would delight me more,\" Pierce said, \"but in truth I have selected my compartment on the advice of my physician, after experiencing certain distress on railway journeys. This he has attributed to the effects of vibrations originating in the engine, and therefore he\u0027s warned me to sit as far back from the source as possible.\" Pierce gave a short laugh. \"He said, in fact, that I should sit second class, but I cannot bring myself to it.\" \"And little wonder,\" Fowler said. \"There is a limit to healthy living, though you cannot expect a physician to know it. My own once advised me to quit wine--- can you imagine the temerity ? Very well, then, we shall all ride in your compartment. Pierce said, \"Perhaps Miss Lawson feels, as you do, that a forward carriage would be preferable.\" Before the girl could speak, Fowler said, \"What? And steal her away from you, leaving you solitary upon the journey? I would not think of it. Come, come, the train will soon leave. Where is your compartment?\" They walked the length of the train to Pierces compartment. Fowler was in unshakable good spirits, and chattered at length about physicians and their foibles. They stepped into Pierce\u0027s compartment and closed the door. Pierce glanced at his watch: it was six minutes to eight. The train did not always leave precisely on schedule, but even so, time was short. Pierce had to get rid of Fowler. He could not climb out of his compartment onto the roof of the train if there were any strangers--- and certainly anyone from the bank--- in his compartment. But at the same time, he had to get rid of Fowler in such a way that no suspicion would be aroused; for in the aftermath of the robbery Mr. Fowler would search his memory--- and probably be questioned by the authorities--- to uncover the least hint of irregularity that might explain who the robbers were. Mr. Fowler was still talking, but his focus was directed toward the girl, who gave every appearance of rapt and fascinated attention. \"It\u0027s the most extraordinary luck, running across Edward today. Do you travel this route often, Edward? I myself do it no more than once a month. And you, Miss Lawson?\" \"I been on a train before,\" the girl said, \"but I never gone first class; only my mistress, this time she buys me a first ticket, seeing as how, you know...\" \"Oh, quite, quite,\" Fowler said, in a hearty, chin-up manner. \"One must do all one can for one in times of stress. I must confess, I am under no little stress myself this morning. Now, Edward here, he may have guessed the reason for my travel, and therefore my stress. Eh, Edward? Have you a guess?\" Pierce had not been listening. He was staring out the window, considering how to get rid of Fowler in the remaining few minutes. He looked over at Fowler. \"Do you think your bags are safe?\" he said. \"My bags? Bags? What--- Oh, in my compartment? I have no bags, Edward. I carry not so much as a ease of briefs, for once in Folkestone, I shall remain there just two hours, hardly the space of time to take a meal, or some refreshments, or smoke a cigar, before I am back on the train, homeward bound.\" Smoke a cigar, Pierce thought. Of course. He reached into his coat pocket, and withdrew a long cigar, which he lit. \"Now, then, dear girl,\" Fowler said, \"our friend Edward here shall surely have surmised the purpose of my journey, but I fancy you are still in the dark.\" The girl was, in fact, staring at Mr. Fowler with her mouth slightly open. \"The truth is that this is no ordinary train, and I am no ordinary passenger. On the contrary, I am the general manager of the banking firm of Huddleston \u0026 Bradford, Westminster, and today, aboard this very train--- not two hundred paces from us as we sit here--- my firm has stored a quantity of gold bullion for shipment overseas to our brave troops. Can you imagine how much? No? Well, then--- it is a quantity in excess of twelve thousand pounds, my dear child.\" \"Cor!\" the girl exclaimed. \"And you\u0027re in charge of all that?\" \"I am indeed.\" Henry Fowler was looking plainly self-satisfied, and with reason. He had obviously overwhelmed the simple girl with his words, and she now regarded him with dizzy admiration. And perhaps more? She appeared to have entirely forgotten Pierce. That is, until Pierce\u0027s cigar smoke billowed in gray clouds within the compartment. Now the girl coughed in a delicate, suggestive fashion, as she had no doubt observed her mistress to do. Pierce, staring out the window, did not seem to notice. The girl coughed again, more insistently. When Pierce still made no response, Fowler took it upon himself to speak. \"Are you feeling well?\" he inquired. \"I was, but I\u0027m faint....\" The girl made a vague gesture toward the smoke. \"Edward,\" Fowler said. \"I believe your tobacco causes Miss Lawson some distress, Edward.\" Pierce looked at him and said, \"What?\" \"I say, would you mind---\" Fowler began. The girl bent forward and said, \"I feel quite faint, I fear, please,\" and she extended a hand toward the door, as if to open it. \"Just look, now,\" Fowler said to Pierce. Fowler opened the door and helped the girl--- who leaned rather heavily upon his arm--- into the fresh air. \"I had no idea,\" Pierce protested. \"Believe me, had I but known---\" \"You might have inquired before lighting your diabolical contraption,\" Fowler said, with the girl leaning against him, weak-kneed, so that much of her bosom pressed against his chest. \"I\u0027m most dreadfully sorry,\" Pierce said. He started to get out himself, to lend assistance. The last thing Fowler wanted was assistance. \"You shouldn\u0027t smoke anyway, if your doctor has warned you that trains are hazardous to your health,\" he snapped. \"Come, my dear,\" he said to the girl, \"my compartment is just this way, and we can continue our conversation with no danger of noxious fumes.\" The girl went willingly. \"Dreadfully sorry,\" Pierce said again, but neither of them looked back. A moment later, the whistle blew and the engine began to chug. Pierce stepped into his compartment, shut the door, and watched London Bridge Station slide away past his window as the morning train to Folkestone began to gather speed.","sourceLink":"https://allnovel.net/the-great-train-robbery/page-31.html","bookId":2678,"book":{"id":2678,"title":"The Great Train Robbery","description":"Storyline: Lavish wealth and appalling poverty live side by side in Victorian London -- and Edward Pierce easily navigates both worlds. Rich, handsome, and ingenious, he charms the city\u0027s most prominent citizens even as he plots the crime of his century, the daring theft of a fortune in gold. But even Pierce could not predict the consequences of an extraordinary robbery that targets the pride of England\u0027s industrial era: the mighty steam locomotive. Based on remarkable fact, and alive with the gripping suspense, surprise, and authenticity that are his trademarks, Michael Crichton\u0027s classic adventure is a breathtaking thrill-ride that races along tracks of steel at breakneck speed.","cover":"https://allnovel.net/images/the-great-train-robbery.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-great-train-robbery.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
