{"id":67971,"no":38,"title":"Page 38","content":"Chapter 52 The End\n Pierce concluded his testimony on August 2nd. At that time, the prosecutor, aware that the public was perplexed by the master criminal\u0027s cool demeanor and absence of guilt, turned to a final line of inquiry.\n \"Mr. Pierce,\" said the prosecutor, rising to his full height, \"Mr. Pierce, I put it to you directly: did you never feel, at any time, some sense of impropriety, some recognition of misconduct, some comprehension of unlawful behavings, some moral misgivings, in the performance of these various criminal acts?\"\n \"I do not comprehend the question,\" Pierce said.\n The prosecutor was reported to have laughed softly. \"Yes, I suspect you do not; it is written all over you.\"\n At this point, His Lordship cleared his throat and delivered the following speech from the bench:\n \"Sir,\" said the judge, \"it is a recognized truth of jurisprudence that laws are created by men, and that civilized men, in a tradition of more than two millennia, agree to abide by these laws for the common good of society. For it is only by the rule of law that any civilization holds itself above the promiscuous squalor of barbarism. This we know from all the history of the human race, and this we pass on in our educational processes to all our citizens.\n \"Now, on the matter of motivation, sir, I ask you: why did you conceive, plan, and execute this dastardly and shocking crime?\"\n Pierce shrugged. \"I wanted the money,\" he said.\n Following Pierce\u0027s testimony, he was handcuffed and escorted from the courtroom by two stout guards, both armed. As Pierce left the court, he passed Mr. Harranby.\n \"Good day, Mr. Pierce,\" Mr. Harranby said.\n \"Goodbye,\" Pierce replied.\n Pierce was taken out the back of Old Bailey to the waiting police van, which would drive him to Coldbath Fields. A sizable crowd had gathered on the steps of the court. The guards pushed away the crowd, which shouted greetings and expressions of luck to Pierce. One scabrous old whore, slipping forward, managed to kiss the culprit full on the mouth, if only for a moment, before the police pushed her aside.\n It is presumed that this whore was actually the actress Miss Miriam, and that in kissing Pierce she passed him the key to the handcuffs, but that is not known for certain. What is known is that when the two van guards, coshed into insensibility, were later discovered in a gutter near Bow Street, they could not reconstruct the precise details of Pierce\u0027s escape. The only thing they agreed upon was the appearance of the cabby--- a tough brute of a man, they said, with an ugly white scar across his forehead.\n The police van was later recovered in a field in Hampstead. Neither Pierce nor the cabby was ever apprehended. Journalistic accounts of the escape are vague, and all mention that the authorities showed reluctance to discuss it at length.\n In September the British recaptured Cawnpore. They took no prisoners, and burned, hanged, and disemboweled their victims. When they found the blood-soaked house where the women and children had been slaughtered, they made the natives lick the red floor before hanging them. They went on, sweeping through India in what was called \"the Devil\u0027s Wind\" ---marching as much as sixty miles a day, burning whole villages and murdering every inhabitant, tying mutineers to the muzzles of cannons and blowing them to bits. The Indian Mutiny was crushed before the end of the year.\n In August, 1857, Burgess, the railway guard, pleaded the stresses of his son\u0027s illness, claiming that it had so warped his moral inclinations that he fell in with criminals. He was sentenced to only two years in Marshalsea Prison, where he died of cholera that winter.\n The screwsman Robert Agar was sentenced to transportation to Australia for his part in The Great Train Robbery. Agar died a wealthy man in Sydney, New South Wales, Australia, in 1902. His grandson Henry L. Agar was the Lord Mayor of Sydney from 1938 to 1941.\n Mr. Harranby died in 1879 while flogging a horse, which kicked him in the skull. His assistant, Sharp, became head of the Yard and died a great-grandfather in 1919. He was reported to have said he was proud that none of his children was a policeman.\n Mr. Trent died of a chest ailment in 1857; his daughter Elizabeth married Sir Percival Harlow in 1858, and had four children by him. Mr. Trent\u0027s wife behaved scandalously following her husband\u0027s demise; she died of pneumonia in 1884, having enjoyed, she said, \"more lovers than this Bernhardt woman.\"\n Henry Fowler died of \"unknown causes\" in 1858.\n The South Eastern Railway, tired of the inadequate arrangements of London Bridge Station, built two new terminals for its line: the famous vaulted arch of Cannon Street in 1862, and Blackfriars Station soon after.\n Pierce, Barlow, and the mysterious Miss Miriam were never heard from again. In 1862, it was reported that they were living in Paris. In 1868, they were said to be residing in \"splendid circumstances\" in New York. Neither report has ever been confirmed.\n The money from The Great Train Robbery was never recovered. \n","sourceLink":"https://allnovel.net/the-great-train-robbery/page-38.html","bookId":2678,"book":{"id":2678,"title":"The Great Train Robbery","description":"Storyline: \n Lavish wealth and appalling poverty live side by side in Victorian London -- and Edward Pierce easily navigates both worlds. Rich, handsome, and ingenious, he charms the city\u0027s most prominent citizens even as he plots the crime of his century, the daring theft of a fortune in gold. But even Pierce could not predict the consequences of an extraordinary robbery that targets the pride of England\u0027s industrial era: the mighty steam locomotive. \n Based on remarkable fact, and alive with the gripping suspense, surprise, and authenticity that are his trademarks, Michael Crichton\u0027s classic adventure is a breathtaking thrill-ride that races along tracks of steel at breakneck speed.\n \n","cover":"https://allnovel.net/images/the-great-train-robbery.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-great-train-robbery.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
