{"id":67940,"no":6,"title":"Page 6","content":"Chapter 07 The Swell Teddy Burke, twenty-four, was working the Strand at two in the afternoon, the most fashionable hour. Like the other gentlemen, Teddy Burke was decked out, wearing a high hat, a dark frock coat, narrow trousers, and a dark silk choker. This outfit had cost him a pretty, but it was essential to his business, for Teddy Burke was one of the swellest of the swell mobsmen. In the throng of gentlemen and ladies who browsed among the elegant shops of this thoroughfare, which Disraeli called \"the first street in Europe,\" no one would notice that Teddy Burke was not alone. In fact, he was working his usual operation, with himself as dipper, a stickman at his side, and two stalls front and back--- altogether, four men, each as well-dressed as the next. These four slipped through the crowd, attracting no attention. There was plenty of diversion. On this fine early summer day, the air was warm and redolent of horse dung, despite the busy working of a dozen street-urchin sweepers. There was heavy traffic of carts, drays, brightly lettered rattling omnibuses, four-wheel and hansom cabs, and from time to time an elegant chariot rode past, with a uniformed coachman in front and liveried servants standing behind. Ragged children darted among the traffic and turned cartwheels under the horses\u0027 hoofs for the amusement of the crowd, some of whom threw a few coppers in their direction. Teddy Burke was oblivious to the excitement, and to the rich array of goods on display in the shopwindows. His attention was wholly fixed upon the quarry, a fine lady wearing a heavy flounced crinoline skirt of deep purple. In a few moments he would dip her as she walked along the street. His gang was in formation. One stall had taken up a position three paces ahead; another was five paces back. True to their title, the stalls would create disorder and confusion should anything go wrong with the intended dip. The quarry was moving, but that did not worry Teddy Burke. He planned to work her on the fly, the most difficult kind of dip, as she moved from one shop to the next. \"Right, here we go,\" he said, and the stickman moved alongside him. It was the stickman\u0027s job to take the pogue once Teddy had snaffled it, thus leaving Teddy clean, should there be hue and cry and a constable to stop him. Together with the stickman, he moved so close to the woman he could smell her perfume. He was moving along her right side, for a woman\u0027s dress had only one pocket, and that was on the right. Teddy carried an overcoat draped across his left arm. A sensible person might have asked why a gentleman would carry an overcoat on such a warm day; but the coat looked new, and he could have conceivably just picked it up from a fitting at one of the nearby shops. In any case, the overcoat concealed the movement of his right arm across his body to the woman\u0027s skirt. He fanned the dress delicately, to determine if a purse was there. His fingers touched it; he took a deep breath, praying that the coins would not clink, and lifted it out of the pocket. Immediately he eased away from the woman, shifted his overcoat to his other arm, and in the course of that movement passed the purse to the stickman. The stickman drifted off. Ahead and behind, the stalls moved out in different directions. Only Teddy Burke, now clean, continued to walk along the Strand, pausing before a shop that displayed cut-glass and crystal decanters imported from France. A tall gent with a red beard was admiring the wares in the window. He did not look at Teddy Burke. \"Nice pull,\" he said. Teddy Burke blinked. The speaker was too well-dressed, too square-rigged, to be a plainclothes crusher, and he certainly wasn\u0027t a nose, or informer. Teddy Burke said carefully, \"Are you addressing me, sir?\" \"Yes,\" the man said. \"I said that was a very nice pull. You tool her off?\" Teddy Burke was profoundly insulted. A tool was a wire hook that inferior dippers employed to snare a purse if their fingers were too shaky for the job. \"Beg your pardon, sir. I don\u0027t know your meaning, sir.\" \"I think you do, well enough,\" the man said. \"Shall we walk awhile?\" Teddy Burke shrugged and fell into step alongside the stranger. After all, he was clean; he had nothing to fear. \"Lovely day,\" he said. The stranger did not answer. They walked for some minutes in silence. \"Do you think you can be less effective?\" the man asked after a time. \"How do you mean, sir?\" \"I mean,\" the man said, \"can you buzz a customer and come out dry?\" \"On purpose?\" Teddy Burke laughed. \"It happens often enough without trying, I can tell you that.\" \"There\u0027s five quid for you, if you can prove yourself a prize bungler.\" Teddy Burke\u0027s eyes narrowed. There were plenty of magsmen about, sharp con men who often employed an unwitting accomplice, setting him up to take a fall in some elaborate scheme. Teddy Burke was nobody\u0027s fool. \"Five quid\u0027s no great matter.\" \"Ten,\" the man said, in a weary voice. \"I have to think of me boys.\" \"No,\" the man said, \"this is you, alone.\" \"What\u0027s the lay, then?\" Teddy Burke said. \"Lots of bustle, a ruck touch, just enough to set the quarry to worry, make him pat his pockets.\" \"And you want me to come up dry?\" \"Dry as dust,\" the man said. \"Who\u0027s the quarry, then?\" Teddy Burke said. \"A gent named Trent. You\u0027ll touch him with a bungler\u0027s dip in front of his offices, just a roughing-up, like.\" \"Where\u0027s the office, then?\" \"Huddleston \u0026 Bradford Bank.\" Teddy Burke whistled. \"Westminster. Sticky, that is. There\u0027s enough crushers about to make a bloody army.\" \"But you\u0027ll be dry. All you\u0027ve to do is worry him.\" Teddy Burke walked a few moments, looking this way and that, taking the air and thinking things over. \"When will it be, then?\" \"Tomorrow morning. Eight o\u0027clock sharp.\" \"All right.\" The red-bearded gentleman gave him a five-pound bill, and informed him he would get the rest when the job was done. \"What\u0027s it all about, then?\" Teddy Burke asked. \"Personal matter,\" the man replied, and slipped away into the crowd.","sourceLink":"https://allnovel.net/the-great-train-robbery/page-6.html","bookId":2678,"book":{"id":2678,"title":"The Great Train Robbery","description":"Storyline: Lavish wealth and appalling poverty live side by side in Victorian London -- and Edward Pierce easily navigates both worlds. Rich, handsome, and ingenious, he charms the city\u0027s most prominent citizens even as he plots the crime of his century, the daring theft of a fortune in gold. But even Pierce could not predict the consequences of an extraordinary robbery that targets the pride of England\u0027s industrial era: the mighty steam locomotive. Based on remarkable fact, and alive with the gripping suspense, surprise, and authenticity that are his trademarks, Michael Crichton\u0027s classic adventure is a breathtaking thrill-ride that races along tracks of steel at breakneck speed.","cover":"https://allnovel.net/images/the-great-train-robbery.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-great-train-robbery.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:00 AM"}}
