{"id":97657,"no":9,"title":"Page 9","content":"Danifae could feel the Binding, and she could feel Halisstra. No matter how many thousands of feet of rock separated them, they were connected.\n Danifae\u0027s skin crawled.\n The farther from the center of the city she walked, the higher the mix of non-drow she passed on the streets. It was with no little relief,and after enduring lewd remarks from a trio of hobgoblins that she came to her destination.\n She had never been to Sschindylryn before and had never seen that one particular structure, but she had gone straight to it. She\u0027d made no wrong turns and asked for no directions.\n Danifae stood in front of a complex jumble of mud bricks and flagstones arranged into what looked like some kind of hive or termite hill. Over the wide door-wide enough to accommodate a pack lizard and a decent-sized wagon-hung a slab of black stone into which was carved an elaborate sigil. The symbol contained unmistakable traces of the Yauntyrr crest but somehow turned in on itself, imploded, perverted.\n Danifae reminded herself that no matter what happened, House Yauntyrr was gone. The integrity of its heraldry was of no concern to her, nor, she was sure, to anyone else.\n She stepped inside.\n Zinnirit\u0027s gatehouse, not unlike the larger gatehouse they\u0027d entered the city through, was mostly open space on the street level. There looked to be room for another floor or even two above-likely Zinnirit\u0027s private residence-but the heart of the establishment was in that single cavernous chamber.\n There were three gates, each a circle of elaborately interconnected stones easily thirty feet in diameter. No seething magical light pulsed through them. All three were inactive, dark.\n \"Zinnirit!\" Danifae called.\n Her voice echoed in the empty space. There was no immediate reply. Danifae had lost track of time quite a while before, and as she called the former House Mage\u0027s name again, she realized she might have dropped in on the wizard in the middle of his Reverie.\n She didn\u0027t care.\n \"Zinnirit!\"\n A quiet, slow shuffling of feet answered Danifae\u0027s third entreaty. The sound was unmistakable but difficult to trace in the huge, echoing space. Despite the echoes, Danifae got the distinct impression that there was more thanone set of feet. She couldn\u0027t count exactly how many-maybe half a dozen-and they were getting closer.\n Danifae drew her morningstar and set it swinging at her right side.\n \"Zinnirit,\" she called. \"Show yourself, you old fool.\"\n Again, the only answer was that same echoing set of shuffling footsteps.\n A shadow bobbed back and forth at the edge of her peripheral vision from deeper into the gatehouse. Danifae reacted with a thought, calling without question or hesitation on an ability bred into all highborn drow.\n Five figures blazed to life with shimmering purple light. The faerie fire ringed their bodies and outlined them against the dull gloom behind them. The figures slowly shambled toward her and took no notice of the faerie fire.\n The realization of what they were hit her half a second after the foul smell did.\n They were zombies: walking dead of what looked to be mostly humans, though Danifae wasn\u0027t interested in conducting a thorough physical examination. \"Zinnirit. . .\" she breathed, irritated.\n One of the zombies reached out for her, and a quiet, painful-sounding groan escaped its rotting, tattered lips.\n In answer, Danifae stood straight, arched one delicate eyebrow, held out one slim-fingered hand, and said, \"Stop.\"\n The zombies stopped.\n \"That will be all,\" she said, her voice a perfect, level calm.\n The zombies, all still aglow in purple, turned clumsily, bumping into each other, and shambled away from the battle-captive. They were moving a bit faster away from her than they had come at her.\n \"Well,\" a firm male voice said, the single word echoing a thousandfold in the gatehouse chamber.\n Danifae put her hand down, let it rest on her hip.\n \"You shouldn\u0027t have been able to do that,\" the voice said, quieter but closer. Danifae followed that echo back to its source and saw another drow-shaped shadow at the edge of the gloom.\n \"No need for faerie fire,\" he said and stepped close enough for Danifae to see him.\n \"Zinnirit,\" she said, pasting a broad grin on her face. \"How lovely it is to see you, my old friend.\"\n The aged drow moved a few steps closer to her but still kept a respectful-no, suspicious-distance from Danifae.\n \"You were taken to Ched Nasad,\" the wizard said. \"I heard that Ched Nasad fell apart.\"\n \"It did,\" Danifae answered.\n \"I honor Lolth as much as any drow,\" the wizard said, \"but you can keep buildings made of web, thank you very much.\"\n \"That wasn\u0027t the problem,\" Danifae replied. \"Of course, you don\u0027t give the south end of a northbound rothe what happened to Ched Nasad.\"\n \"You know me too well still,\" he said.\n \"As you know me.\"\n \"It isn\u0027t easy, you know,\" the old wizard said, taking a few steps closer. \"What you want done. It\u0027s not something you simply . . . dispel.\"\n Zinnirit looked different. Danifaewas amazed at how stooped he was, how thin, how wizened. He looked like a human, or a goblin. He looked bad.\n \"You\u0027ve adopted the fashions of your new home, I see,\" Danifae remarked, nodding at the wizard\u0027s outlandish dress.\n \"Yes, I have,\" he replied. \"Good for business, you know. Doesn\u0027t frighten the neighbors as much as the old spiky armor.\"\n \"You know why I\u0027m here,\" said Danifae, \"and I know you knew I was coming. Were the zombies meant to scare me?\"\n \"Another bit of showmanship, actually,\" the mage explained. \"Drow and lesser races alike are attracted to the odd bit of necromancy. Makes me seem more serious, I suppose.\"\n \"You knew I was in Sschindylryn the second I stepped through the gate,\" she said.\n \"I did, yes.\"\n \"Then let\u0027s get on with it.\"\n \"Things have changed, my dear Danifae,\" Zinnirit said. \"I am no longer your mother\u0027s House mage, subject to the whims of her spoiled daughters.\"\n \"You expect me to pay?\" she asked.\n \"You expect something for nothing?\"\n Danifae let one of her eyebrows twitch in response. That barely perceptible gesture made the old wizard look away. She took a deep breath and concentrated on that corner of her mind in which the Binding hid.\n \"I know why you\u0027ve come,\" Zinnirit pressed. \"It\u0027s always there, isn\u0027t it?\" Seeing no reason to lie, Danifae said, \"It is. It\u0027s been there every second since I fell into the hands of House Melarn.\"\n \"It\u0027s an insidious enchantment that binds you . . .\" said the old drow, \"binds you in a way that only a drow could imagine. While the Binding is in effect, you will never be free. If your mistress . . . ?\"\n \"Halisstra Melarn.\"\n \"If Halisstra Melarn dies, so goes Danifae,\" he continued. \"If she calls for you, you\u0027ll go to her. No question, no hesitation, no choice. You can never-much as you might like to, even as a method of suicide-raise your hand to her. The Binding won\u0027t let your body move in a way that would result in your mistress\u0027s death.\"\n \"You understand well,\" she whispered, \"but not completely. In many ways, it\u0027s the Binding that fuels me. That spell keeps me alive, keeps me vital, keeps me listening, watching, and learning. That spell, and my desire to break its hold, is what I live for.\"\n Danifae saw fear flash across the old wizard\u0027s eyes.\n \"You weren\u0027t the only member of our House to be brought to Ched Nasad,\" he said. \"After that last raid-the one that destroyed the redoubt, that destroyed the family-others were taken by Ched Nasad\u0027s Houses, and the rest were scattered over a wide swath of the Underdark. Those who lived, anyway, and that was precious few.\"\n \"Zinnirit Yauntyrr made it to Sschindylryn,\" she continued for him, \"and did quite well here. That never surprised me. You were a talented spellcaster. No one could teleport like you. You were the master. And teleporting isn\u0027t all you\u0027re good at.\n \"You\u0027re ready,\" she said. \"I know you.\"\n \"What will you do when you\u0027re free?\" he asked.\n Danifae smiled at him and stepped closer. They could touch each other if either lifted an arm.\n \"All right,\" the old mage breathed. \"I don\u0027t need to know, doI?\"\n Danifae offered no response. She stood waiting.\n \"I will have to touch you,\" the wizard said.\n Danifae nodded and stepped closer still-close enough that she could smell the old man\u0027s breath: cinnamon and pipeweed.\n \"It will hurt,\" he said even as his hand was reaching up to her. He placed the tips of his first and second fingers on her forehead. His touch was dry and cool. Strange words poured from his mouth. It might have been Draconic he was speaking but a dialect she couldn\u0027t quite pin down. After a full minute he stopped and lowered his hand. His red-orange eyes locked on hers. Danifae did not pull away, much as she wanted to.\n \"Tell me,\" he whispered, \"that you want to be through with it.\"\"I want it gone,\" she said. Her voice seemed too loud, too sharp to her own ears. \"I want to be free of the Binding.\"\n No sooner had that last syllable left her lips than her chest tightened, then her legs, her arms, her feet, her hands, her neck, her jaw, her fingers and toes-each one. Every muscle in her body cramped and seemed to rip into shreds under her skin. She might have screamed, but her throat was clamped shut. Her lungs tried to force what air was left in them up and out through her closed throat, past her clenched jaws, between her grinding teeth. She went blind with pain.\n It was over.\n Her body loosened so quickly and so completely that she collapsed. Vomit poured from her, and her vision was a swirling blur. Her eyes watered, her nose ran, and she came within half a second of wetting herself.\n That was over too.\n Danifae was shaking as she stood. She mastered the barrage of emotions that assaulted her-everything from humiliation to homicidal rage-with a single thought:\n I\u0027m free.\n She wiped her mouth on her sleeve and stepped away from her own sick. Zinnirit followed, reaching out to steady her in case she fell again, but she avoided his touch, and he seemed as reluctant to touch her.\n \"I can\u0027t feel her,\" Danifae said even as she realized that the connection was truly gone.\n \"She won\u0027t feel you either,\" said the mage. \"She\u0027ll probably think you died . . . wherever she is.\"\n Danifae nodded and collected herself. Part of her wanted to shriek with delight, to dance and sing like some sun-cursed surface elf, but she did not. There was still one more thing she needed. The battle-captive turned free drow blinked the tears from her eyes and looked at the old mage\u0027s hands.\n Zinnirit wore many rings, but Danifae was looking for one in particular, and she recognized it immediately. On the second finger of Zinnirit\u0027s left hand was a band of intertwined platinum and copper traced with delicate Draconic script.\n \"You kept it,\" she said.\n He looked at her with narrowed eyes and shook his head.\n \"That ring,\" she explained. \"My mother\u0027s ring.\"\n Zinnirit nodded, unsure.\n \"You enchanted that for her yourself, didn\u0027t you?\" she asked.\n Zinnirit nodded again.\n \"Wherever she might go,\" Danifae mused, \"that ring would return her home to her private chamber in House Yauntyrr in far Eryndlyn. I remember she used it once when we were in Llacerellyn. The ring took us both home when an idle threat turned into an assassination attempt and someone sent an elemental after her. \"You\u0027ve never used it? You\u0027ve never tried to go back?\"\n \"There\u0027s nothing there,\" the mage answered too quickly. \"Nothing to return to. I retuned the ring years ago to bring me back here.\"\n \"Still, have you ever had necessity to use it?\" she asked. \"Has it ever brought you back here from some distant cave?\"\n Zinnirit shook his head.\n \"Never stepped through your own gates?\"\n The old drow shook his head again and said, \"I have nowhere to go.\"\n Danifae tipped her head to one side and let the tiniest smile of appreciation slide across her lips.\n \"You poor thing,\" she whispered. \"All these years ... so lonely, waiting for one last chance to serve a daughter of House Yauntyrr.\"\n Danifae reached out and took Zinnirit\u0027s hand. The mage flinched at her touch but didn\u0027t pull away.\n She lifted his hand to her lips and kissed it. Considering she\u0027d just thrown up all over his floor, Zinnirit winced at the gesture, but still allowed it. Danifae pressed the old drow\u0027s hand to her cheek. It felt warmer, less dry. \"Dear Zinnirit,\" she whispered, looking the old mage in the eye, \"what has become of you?\"\n \"I\u0027m a thousand years old,\" the mage replied. \"At least, I think I am. I have no House, just these three gates and whatever meager tolls I can charge. I\u0027m a stranger in a strange city, with no House to protect me, no matron mother to serve. What has become of me? I can barely remember \u0027me\u0027.\"\n Danifae kissed his hand again and whispered, \"You remember me, don\u0027t you, House Mage?\"\n He didn\u0027t reply but didn\u0027t take his hand away.\n \"You remember our lessons,\" she said, punctuating her words with the gentle brush of her lips against his hand. \"Our special lessons?\"\n She took his finger into her mouth and let her tongue play over it. The old drow\u0027s skin was dry and tasteless then there was the tang of metal against her lips.\n \"I didn\u0027t. . .\" the mage mumbled. \"I don\u0027t . . .\"\n Danifae slipped the ring off his finger, slowly teasing his flesh with her lips all the way. She tucked the ring under her tongue before kissing the back of his hand again.\n \"I do,\" she said.\n Danifae twisted the old drow\u0027s arm down and around hard and fast enough that more than one bone snapped in more than one place. Zinnirit gasped in pain and surprise and didn\u0027t even try to stop Danifae from turning him around. She brought her other hand up and cupped his chin. She was standing behind him, his broken arm twisted painfully behind his back.\n \"I remember,\" she whispered into his ear. Then she broke his neck.\n For any mage, the preparation of a day\u0027s spells was part experience, part intuition, and part inspiration. Pharaun Mizzrym was no different. From time to time he looked up from his spellbook to refresh his eyes and let a particularly complex incantation sink into his memory. What he saw when he looked up was the still, quiet deck of the ship of chaos. Larger patches of sinew and cartilage and ever more complex traceries of veins and arteries embellished the bone ship. It lived-a simple, pain-ravaged, tortured, insensible life-and when it was quiet and the others were still in Reverie, Pharaun imagined he felt the thing breathing.\n The uridezu captain lay in his place, visited only by the occasional rat. He was curled into a tight ball, his body wrapped into itself in a way that made Pharaun\u0027s back ache to look at it. His breathing was deep and regular, punctuated by the odd snore.\n Jeggred sat opposite the captured demon, his knees drawn up to his chest and his head down. Unlike Pharaun and his fellow dark elves, the draegloth slept.\n Obviously that was a trait carried over from his father, Belshazu.\n Well, the Master of Sorcere thought, you can\u0027t chose your parents.\n Quenthel sat as far away from the rest of them as she could, at the very tip of the demon ship\u0027s pointed bow. Her back was turned to Pharaun, and she sat straight and stiff, meditating.\n Can you talk? a voice echoed at the edge of his consciousness-a voice he recognized.\n Aliisza? he thought back.\n You remember me, the alu-demon\u0027s voice echoed more loudly in his head-or was it more clearly? I will consider that a supreme honor.\n As well you should, Pharaun sent back, instinctively attaching light, playful emotions to the thought. Where are you?\n On the ceiling, she replied, right above you.\n Pharaun couldn\u0027t help but look up, but even with his fine dark-vision, the gloom of the Lake of Shadows hid the ceiling from his sight.\n How did you find me? he asked.\n I\u0027m a resourceful, intelligent, and talented woman.\n That you are, he replied.\n If you levitate straight up, she sent, you\u0027ll come right to me.\n Well, Pharaun returned, in that case. . .\n The wizard closed the book he was working on, the spell still not fully prepared, and tucked the volume back into his pack. He stood and touched the brooch that held his piwafwi on his shoulders.\n Straight up? he sent.\n I\u0027ll catch you, came the alu-demon\u0027s playful reply.\n Pharaun\u0027s feet left the deck, and he accelerated, the ship falling rapidly away beneath him. When it was lost-or more properly when he was lost-in the pitch-dark shadows of the ominous cavern, he slowed.\n \"A little more,\" Aliisza whispered to him, her voice barely audible.\n Pharaun came to a stop slowly, a defensive spell hanging on his lips in case the alu-demon turned on him-she was a demon after all, so there was always some possibility of that.\n There was a surprisingly loud rustle, and Pharaun looked up. Aliisza, her batlike wings spread out behind her, was slowly sinking toward him. He turned so they were facing each other.\n They were almost together when Aliisza asked, \"Can your levitation hold me up?\" Pharaun almost had a chance to answer before her arms folded around his neck and her full-though not substantial-weight fell on him all at once. He concentrated hard on the brooch, almost losing his defensive spell in the process, and managed to hold them both aloft. They bobbed a bit at first, but ultimately managed a tight embrace in the gloomy air near the ceiling of the Lake of Shadows.\n They were face-to-face, less than an inch apart. Pharaun could smell the beautiful alu-demon\u0027s breath. The touch of her skin against him, the curves of her body in his arms again, and the soft caress of her fleshy wings folding around him, enclosing him, madehis body react of its own accord.\n A playful smile crossed Aliisza\u0027s full lips, and she showed a set of perfect white teeth with the exaggerated canines of a vampire. Pharaun remembered her habit of playing with her teeth. He didn\u0027t bother wondering why he liked that about her so much.\n \"Yes,\" she whispered, \"I remember you.\"\n Pharaun returned her smile and asked, \"So, what brings a bad girl like you to an evil place like this?\"\n That made her laugh.\n \"The Lake of Shadows?\" she replied playfully. \"Oh, I try to get here a couple times a year, if I can. To take the waters.\"\n Pharaun nodded, smiled, but didn\u0027t bother extending the banter. Kaanyr Vhok\u0027s consort had come there for a reason, and he wasn\u0027t quite smitten, or egomaniacal enough to think it was only to see him.\n \"You\u0027re spying on us again,\" he accused.\n \"No,\" Aliisza replied with a pout, \"I\u0027m spying on you still. Doesn\u0027t that make you feel important, having someone like me spying on you all the time?\"\n \"Yes,\" he said, \"and that\u0027s precisely the problem.\"\n \"What do you hope to find in the Abyss?\" she asked abruptly. Pharaun had to blink a few times to get his head wrapped around the question. \"That is where you\u0027re going in that wonderful old ship of chaos you\u0027ve salvaged, isn\u0027t it?\" \"What would Kaanyr Vhok care what we do,\" he asked, \"or where we go?\"\n \"Can\u0027t a girl be curious?\"\n \"No,\" he replied with some finality. \"In this case, no, she can\u0027t.\"\n \"You can be quite the rodent when you want to be, Pharaun,\" she said, and she smiled again.\n \"Shall I take that as a compliment?\"\n Aliisza looked him in the eyes. Drow and demon were both smart and pragmatic enough to know they weren\u0027t some pair of star-crossed human lovers. They might even be combatants on opposite sides of a war that could ruin both their civilizations-if Kaanyr Vhok\u0027s ragged Scoured Legion could be called a civilization.\n \"Can I come too?\" she asked, tipping her head, and looking almost as if she were trying to read an answer written across his brow.\n \"With us?\" he asked. \"On the ship?\"\n She nodded.\n \"I\u0027ll have to check with the purser to see if there\u0027s a cabin available, but at first glance I\u0027d have to say no way in all Nine Hells and the Barrens of Doom and Despair besides.\"\n \"Pity,\" she said. \"I\u0027ve been there before, you know.\"\n \"Where else have you been?\" Pharaun asked, intentionally jarring the subject away from her joining their expedition. \"Have you visited the City of Spiders lately?\"\n \"Menzoberranzan?\" she replied. \"Why do you ask?\"\n \"News of home and all that,\" said the wizard.\n Her wings tightened around him, and Pharaun liked the sensation. It was similar to the warmed blankets his favorite masseuse used to drape on him in Menzoberranzan. He\u0027d been traveling too long.\n \"You\u0027re missing some of your comrades,\" the alu-demon noted. \"The big fighter with the greatsword and the other one. The scout.\"\n \"You have been spying on us,\" Pharaun replied.\n He couldn\u0027t imagine why she\u0027d want to know that unless she was testing their strength, or ...\n \"Reporting back to Kaanyr Vhok?\" he asked.\n She pretended to blush and batted her eyelashes at him.\n \"Menzoberranzan is under siege,\" he said. \"I suppose you know that.\"\n She nodded and asked, \"You\u0027ve sent your warriors back to aid in the defense of the city?\"\n Pharaun laughed, and Aliisza looked put out. He didn\u0027t care.\n \"Tell me they didn\u0027t run afoul of some less civilized denizen of the Underdark between Ched Nasad and here,\" she said. \"It would break my heart.\"\n \"Your heart will remain intact then,\" he replied. \"I don\u0027t suppose it would hurt you to tell me who lays siege to my home.\"\n \"It might just,\" she replied with a wink. \"Let\u0027s not risk it. Of course, if I knew what you know about the fate of your Spider Queen, that might cushion the blow.\"\n \"Ah,\" he said, \"I tell you the big secret, and you tell me the little one.\" \"There are no little secrets,\" the alu-demon replied, \"if you\u0027re the one in the dark.\"\n \"You know, Aliisza,\" Pharaun said. \"We should get together andtell each other nothing more often. It beats preparing spells or getting on with my life.\" \"You\u0027re a sarcastic little devil, Pharaun. You know, that\u0027s just what I love about you.\"\n \"Please assume I feel the same,\" was the mage\u0027s reply. \"So if we\u0027re done not speaking to each other, can I go?\"\n \"We\u0027ve spoken to each other, Pharaun,\" said Aliisza, \"I\u0027m sure of it. For instance, until now I hadn\u0027t imagined you didn\u0027t know who was laying siege to your City of Spiders. Oh, and you told me you were going to the Abyss.\"\n \"Yes, well,\" Pharaun said, unconcerned that she\u0027d drawn those obvious conclusions. \"Good for you. Do run along and change the course of life in the Underdark.\"\n \"You\u0027re playing games with me,\" the alu-demon said, ice in her voice and in her eyes like Pharaun had never seen. \"I like that but not forever.\"\n \"You\u0027re withholding information from me,\" he retorted. \"I never like that.\"\n They floated in midair, wrapped in a tight, familiar embrace, staring into each other\u0027s cold, uninviting eyes for a long time.\n \"I could be yourfriend still, Pharaun,\" Aliisza said quietly, her voice barely above a whisper.\n The Master of Sorcere found himself struggling for something to say. He knew they were finished, feared they were finished forever, and found himself wishing that weren\u0027t true.\n Longing, Pharaun silently mused.\n Yes, Aliisza replied directly into his mind, longing.\n Pharaun pushed her away. Aliisza hung in the air for half a second before she started to fall. She stared daggers at him even as her wings openedto slow her descent. Pharaun thought she looked more hurt than angry.\n \"We\u0027ll talk again,\" she said, then she was gone with a flash of dull purple light, and Pharaun was alone in the impenetrable shadows.\n I hope so, he found himself thinking. I really do. \n","sourceLink":"https://allnovel.net/annihilation-war-of-the-spider-queen-5/page-9.html","bookId":2163,"book":{"id":2163,"title":"Annihilation (War of the Spider Queen #5)","description":"Storyline: \n Annihilation: War of the Spider Queen, Book V (R.A Salvatore Presents the War of the Spider Queen) \n The fifth title in the New York Times best-selling saga of civil war and chaos in the darkest part of the Forgotten Realms setting. This latest title expands the civil upheaval among the drow, one of the most popular races in the Forgotten Realms setting. Best-selling author R.A. Salvatore wrote the prologue to Annihilation and continues to consult on the series, lending his expertise as the author who brought drow society to the forefront of the Forgotten Realms setting. \n Dissolution (Forgotten Realms: R.A. Salvatore\u0027s War of the Spider Queen, Book 1) \n Insurrection (Forgotten Realms: R.A. Salvatore\u0027s War of the Spider Queen, Book 2) \n Condemnation (Forgotten Realms: R.A. Salvatore\u0027s War of the Spider Queen, Book 3) \n Extinction (Forgotten Realms: R.A. Salvatore\u0027s War of the Spider, Book 4) \n Annihilation: War of the Spider Queen, Book V (R.A Salvatore Presents the War of the Spider Queen) \n Resurrection (Forgotten Realms: R.A. Salvatore\u0027s War of the Spider Queen, Book 6)\n \n","cover":"https://allnovel.net/images/annihilation-war-of-the-spider-queen-5.jpg","author":"Philip Athans","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/annihilation-war-of-the-spider-queen-5.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:28:26 PM"}}
