{"id":68551,"no":1,"title":"Page 1","content":"All of the characters in this book are fictious,\\n\\n and any resemblance to actual persons, living or dead,\\n\\n is purely coincidental.\\n\\n To David, who took his time coming, but was worth waiting for\\n\\n Prolog\\n\\n A Year Before\\n\\n TBE MAN from Earth came to a decision. It had been slow in coming and developing, but it was here.\\n\\n It had been weeks since he had felt the comforting deck of his ship and the cool, dark blanket of space about it. Originally, he had intended a quick report to the local office of the Interstellar Spatio-analytic Bureau and a quicker retreat to space. Instead, he had been held here.\\n\\n It was almost like a prison.\\n\\n He drained his tea and looked at the man across the table. He said, \"I\u0027m not staying any longer.\"\\n\\n The other man came to a decision. It had been siow in coming and developing, but it was here. He would need time, much more time. The response to the first letters had been nil. They might have fallen into a star for all they had accomplished.\\n\\n That had been no more than he had expected, or, rather, no less. But it was only the first move.\\n\\n It was certain that, while fut~ire moves developed, he could not allow the man from Earth to squirm out of reach. He fingered the smooth black rod in his pocket.\\n\\n He said, \"You don\u0027t appreciate the delicacy of the problem.\"\\n\\n The Earthman said, \"What\u0027s delicate about the destruction of a planet? I want you to broadcast the details to all of Sark; to everyone on the planet.\"\\n\\n \"We can\u0027t do that. You know it would mean panic.\"\\n\\n \"You said at first you would do it.\"\\n\\n \"I\u0027ve thought it over and it just isn\u0027t practical.\"\\n\\n The Earthman turned to a second grievance. \"The representative of the I.S.B. hasn\u0027t arrived.\"\\n\\n \"I know it. They are busy organizing proper procedures for this crisis. Another day or two.\"\\n\\n \"Another day or two! It\u0027s always another day or two! Are they so busy they can\u0027t spare me a moment? They haven\u0027t even seen my calculations.\"\\n\\n \"I have offered to bring your calculations to them. You don\u0027t want me to.\"\\n\\n \"And I still don\u0027t. They can come to me or I can go to them.\" He added violently, \"I don\u0027t think you believe me. You don\u0027t believe Florina will be destroyed.\"\\n\\n \"I believe you.\"\\n\\n \"You don\u0027t. I know you don\u0027t. I see you don\u0027t. You\u0027re humoring me. You can\u0027t understand my data. You\u0027re not a Spatio-analyst. I don\u0027t even think you\u0027re who you say you are. Who are you?\"\\n\\n \"You\u0027re getting excited.\"\\n\\n \"Yes, I am. Is that surprising? Or are you just thinking, Poor devil, Space has him. You think I\u0027m crazy.\"\\n\\n \"Nonsense.\"\\n\\n \"Sure you do. That\u0027s why I want to see the I.S.B. They\u0027ll know if I\u0027m crazy or not. They\u0027ll know.\"\\n\\n The other man remembered his decision. H~ said, \"Now you\u0027re not feeling well. I\u0027m going to help you.\"\\n\\n \"No, you\u0027re not,\" shouted the Earthman hysterically, \"because I\u0027m going to walk out. If you want to stop me, kill me, except that you won\u0027t dare. The blood of a whole world of people will be on your hands if you do.\"\\n\\n The other man began shouting, too, to make himself heard. \"I won\u0027t kill you. Listen to me, I won\u0027t kill you. There\u0027s no need to kill you.\"\\n\\n The Earthman said, \"You\u0027ll tie me up. You\u0027ll keep me here. Is that what you\u0027re thinking? And what will you do when the I.S.B. starts looking for me? I\u0027m supposed to send in regular reports, you know.\"\\n\\n \"The Bureau knows you\u0027re safely with me.\"\\n\\n \"Do they? I wonder if they know I\u0027ve reached the planet at all? I wonder if they received my original message?\" The Earthman was giddy. His limbs felt stiff.\\n\\n The other man stood up. It was obvious to him that his decision had come none too soon. He walked slowly about the long table, toward the Earthman.\\n\\n He said soothingly, \"It will be for your own good.\" He took the black rod from his pocket.\\n\\n The Earthman croaked, \"That\u0027s a psychic probe.\" His words were slurred, and when he tried to rise, his arms and legs barely quivered.\\n\\n He said, between teeth that were clenching in rigor, \"Drugged!\"\\n\\n \"Drugged!\" agreed the other man. \"Now look, I won\u0027t hurt you. It\u0027s difficult for you to understand the true delicacy of the matter while you\u0027re so excited and anxious about it. I\u0027ll just remove the anxiety. Only the anxiety.\"\\n\\n The Earthman could no longer talk. He could only sit there. He could only think numbly, Great Space, I\u0027ve been drugged. He wanted to shout and scream and run, but he couldn\u0027t.\\n\\n The other had reached the Earthman now. He stood there, looking down at him. The Earthman looked up. His eyeballs could still move.\\n\\n The psychic probe was a self-contained unit. Its wires needed only to be fixed to the appropriate places on the skull. The Earthman watched in panic until his eye muscles froze. He did not feel the fine sting as the sharp, thin leads probed through skin and flesh to make contact with the sutures of his skull bones.\\n\\n He yelled and yelled in the silence of his mind. He cried, No, you don\u0027t understand. It\u0027s a planet full of people. Don\u0027t you see that you can\u0027t take chances with hundreds of millions of living people?\\n\\n The other man\u0027s words were dim and receding, heard from the other end of a long, windy tunnel. \"It won\u0027t hurt you. In another hour you\u0027ll feel well, really well. You\u0027ll be laughing at all this with me.\"\\n\\n The Earthman felt the thin vibration against his skull and then that faded too.\\n\\n Darkness thickened and collapsed about him. Some of it never lifted again. It took a year for even parts of it to lift. \\n\\n","sourceLink":"https://allnovel.net/the-currents-of-space-galactic-empire-2/page-1.html","bookId":1725,"book":{"id":1725,"title":"The Currents of Space (Galactic Empire #2)","description":"Storyline: The Currents of Space (Galactic Empire #2) \\n High above planet Florinia, the Squires of Sark live in unimaginable wealth and comfort. Down in the eternal spring of the planet, however, the native Florinians labor ceaselessly to produce the precious kyrt that brings prosperity to their Sarkite masters. \\n Rebellion is unthinkable and impossible. Not only do the Florinians no longer have a concept of freedom, any disruption of the vital kyrt trade would cause other planets to rise in protest, resulting in a galactic war. So the Trantorian Empire, whose grand plan is to unite all humanity in peace, prosperity, and freedom, has allowed the oppression to continue. \\n Living among the workers of Florinia, Rik is a man without a memory or a past. He has been abducted and brainwashed. Barely able to speak or care for himself when he was found, Rik is widely regarded as a simpleton by the worker community where he lives. As his memories begin to return, however, Rik finds himself driven by a cryptic message he is determined to deliver: Everyone on Florinia is doomed…the Currents of Space are bringing destruction. But if the planet is evacuated, the power of Sark will end-so there are those who would kill the messenger. The fate of the Galaxy hangs in the balance.\\n","cover":"https://allnovel.net/images/the-currents-of-space-galactic-empire-2.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-currents-of-space-galactic-empire-2.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:09:31 AM"}}
