{"id":80592,"no":11,"title":"Page 11","content":"“Why do you say that?” I want to know why she got that vibe, too. He was just so freaking perfect. When I first saw him, I could hardly even look at him. He has this whole mix of sweet guy/bad boy going on, and I’m not sure if those two things can mix together. Either way, he pulled it off.\\n\\n His tattoos ran up both arms in a mix of dark blues, reds, and black. Some were even poking out of the top of the white T-shirt he was wearing. The material stretched tight across his broad chest, making him look like the epitome of a bad boy, but his face was far from that. When my eyes finally took in his features, he looked kind. His dark beard was just long enough to make me want to feel how soft it was. His brown eyes were swirled with dark green, and the way they looked at me was like nothing I’d ever experienced before. His hair was a little long on top, and he looked like he just rolled out of bed, but in a sexy-as-hell kind of way. There was just something about him, even with his hulk-like size. I felt the need to snuggle into him. It was as if everything I felt was in contrast to what I should be feeling. Instead of his size and forward behavior intimidating me, I felt as if I would be safe with him.\\n\\n When he pressed into my back, he made me feel feminine against him. His big body engulfed mine, making me feel small—something I didn’t feel very often. It was intoxicating. During the whole experience, I felt like I was under some kind of spell, and I want that feeling again.\\n\\n “I don’t mean to sound like a bitch…but…” She bites her lip, like she never says bitchy stuff, which is laughable. “He kind of targeted you. Like you were easy pickings.” She looks almost sorry that she had to deliver the news, but I can see the jealousy in her eyes. She’s pissed he didn’t go for her.\\n\\n I feel my nose burn at her words. Maybe I looked like I was an easy target, but why did I find that I was still happy that he picked me over her? Even if he was just looking for sex.\\n\\n “Sorry, but it’s the truth.” She squeezes my shoulder, like she is trying to reassure me, before she walks back to her spot at the front counter.\\n\\n I’m standing back at my computer when I look down and see my phone light up. My heart actually jumps. He wouldn’t be texting me already, would he? I thought you were supposed to wait, like, a day or two. It’s a written dating rule or something, right? When I see it’s from an unknown number, I bite my lip to stop from smiling. Looking over, I make sure Harper isn’t watching at me, because I don’t want her to know what I’m doing. She already gave me her two cents, and I don’t think I could take another two.\\n\\n I pick up my phone, secretly checking it so no one can see. I don’t know why but I’m so nervous yet excited at the same time.\\n\\n Sean: So, where am I picking you up?\\n\\n Me: I’m not sure this is a good idea.\\n\\n Sean: Am I going to have to come back in there and prove to you otherwise?\\n\\n Me: I don’t even know you. I can’t just go out with you.\\n\\n Sean: Isn’t that what dating is for?\\n\\n He’s right, but I’ve never done this before, and I don’t want him to know that. I probably already seem like a freaking prude. I mull over my response, but he comes back faster.\\n\\n Sean: Give me one dinner.\\n\\n Maybe I should just give it to him straight. If it scares him away, then it’s for the best.\\n\\n Me: I’ve never done this before.\\n\\n I hold my breath, waiting for his response.\\n\\n Sean: Had dinner? I find that hard to believe.\\n\\n I put the phone back down on the counter. I know he probably didn’t mean it the way I’m thinking. Had dinner? I find that hard to believe. I’m undoubtedly being sensitive, but it still burns. I’m clearly not up for dating if something so simple can make me feel like shit. This man has barely said three words to me and I’m already feeling heartbreak.\\n\\n He could shatter me.\\n\\n Me: I can’t do this.\\n\\n I send the text and just stare at my phone. Minutes tick by, each one seeming heavier than the last, with no response.\\n\\n I guess that was that. No fight to make me change my mind. I need to get some air.\\n\\n “I’m going to lunch,” I mutter to Harper, who’s playing on the computer. The bank has been pretty dead today. Maybe when I get back I can get caught up on some paperwork and get my mind off this Sean guy. How I got so wrapped up so fast, I’ll never understand.\\n\\n I try to tell myself it’s better this way. I just dodged a major bullet.\\n\\n “K. I’ll go when you get back.”\\n\\n I go into my office, grabbing my purse from the drawer inside my desk before checking in with a few other people. I slip out the door. I don’t make it two blocks in the direction of my favorite bakery, Muffin Tops, before I’m pushed up against the side of a building.\\n\\n Sean.\\n\\n His mouth is on mine before I can even take in what’s happening. His hands grip my hips in a firm hold, making me gasp, and he steals the opportunity to push his tongue into my mouth. I thought the kiss would be rough and fast with the way he pressed me against the wall, but it’s sweet and soft.\\n\\n He’s taking his time, giving me slow lazy strokes of his tongue. It’s as if he’s savoring my taste, and I let him. I don’t feel as if I’m really kissing him back. I’m just enjoying the warmth of his lips on mine as I come alive inside. I\u0027ve never felt such need in my life.\\n\\n When he nibbles my bottom lip, desire shoots through my whole body, making me want more. I press myself into him, wanting to make the kiss deeper, but just as I do, he pulls away, resting his forehead against mine. His chest rises and falls, and I feel his warm breath against my lips. \\n\\n","sourceLink":"https://allnovel.net/thief-breeding-3/page-11.html","bookId":1798,"book":{"id":1798,"title":"Thief (Breeding #3)","description":"Storyline: Sean Sparrow has one more job to pull: break into the bank, steal what he was hired to take, and get out. He plans everything to the very last detail, sure of success... until he sees Tessa. \\n Tessa Martin lives a humdrum life. With a boring job and a crappy roommate, she\u0027s sure there must be more to life than this. She\u0027s not prepared for the muscle-bound bearded man who walks into her life, offering her everything she\u0027s ever wanted. \\n When Sean breaks down all of Tessa\u0027s walls, she has no choice but to fall hard and fast. But when the truth comes out, and Sean is fully revealed to her, will their instalove be enough to hold them together? \\n Warning: This book hero is over- the-top obsessed, totally head over heels in love, and desperate to make babies with the heroine ASAP. If you want a fun read with SUPER hot steam, Kindle-melting love, and a beard to rub between thighs, then this book is for you.\\n","cover":"https://allnovel.net/images/thief-breeding-3.jpg","author":"Alexa Riley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/thief-breeding-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:27:10 PM"}}
