{"id":29839,"no":5,"title":"CHAPTER V. THE INQUEST.","content":"It was six o\u0027clock, and already quite dark, when, as Lieutenant Gulston was writing in his cabin, his servant told him that Dr. Mackenzie had just come off from the shore, and would be glad if he could spare him a few minutes\u0027 conversation. \"Tell him I will be on the quarter-deck in a minute.\" He added a few lines to the letter he was writing, put it in an envelope, and, taking his cap, went out, dropping the letter into the post-bag that hung near his cabin, and then went on to the quarter-deck. He was rather pleased with the doctor\u0027s summons, for he highly esteemed him, and regretted the slight estrangement which had arisen between them. \"Well, doctor,\" he asked, cheerily, \"have some of the men been getting into mischief ashore?\" \"No, lad, no,\" the doctor replied, and the first-lieutenant felt that something more serious was the matter, for since he had obtained his rank of first-lieutenant the doctor had dropped his former habit of calling him lad. \"No, I have heard some news ashore that will affect you seriously. I am sorry, dear lad, very sorry. I may have thought that you were foolish, but that will make no difference now.\" \"What is it, doctor?\" Lieutenant Gulston asked, with a vague alarm at the gravity of the doctor\u0027s manner of treating him. \"The evening papers came out with an early edition, Gulston, and the boys are shouting out the news of a terrible affair, a most terrible affair at your friends the Carnes\u0027. Be steady, lad, be steady. It\u0027s a heavy blow for a man to have to bear. Miss Carne is dead.\" \"Dead! Margaret dead!\" the lieutenant repeated, incredulously. \"What are you saying, doctor? There must be some mistake. She was well yesterday, for I was over there in the evening and did not leave until nine o\u0027clock. It can\u0027t be true.\" \"It is true, lad, unhappily; there is no mistake. She was found dead in her bed this morning.\" The lieutenant was almost stunned by the blow. \"Good God!\" he murmured. \"It seems impossible.\" The doctor walked away and left him for a minute or two to himself. \"I have not told you all as yet, lad,\" he went on, when he returned; \"it makes no difference to her, poor girl—none. She passed out of life, it seems, painlessly and instantly, but it is worse for those who are left.\" He paused a moment. \"She was found stabbed to the heart by a midnight robber.\" An exclamation of horror broke from the sailor. \"Murdered? Good Heavens!\" \"Ay, lad, it is true. It seems to have been done in her sleep, and death was instantaneous. There, I will leave you for a while, now. I will put the paper in your cabin, so that when you feel equal to reading the details you can do so. Try and think it is all for the best, lad. No one knows what trouble might have darkened her life and yours had this thing not happened. I know you will not be able to think so now, but you will feel it so some day.\" An hour later Lieutenant Gulston entered the doctor\u0027s cabin. There was a look of anger as well as of grief on his face that the doctor did not understand. \"Doctor, I believe this is no murder by a wandering tramp, as the paper says. I believe it was done from revenge, and that the things were stolen simply to throw people off the scent. I will tell you what took place yesterday. I drove up as far as the gate in the garden; there one road sweeps round in front of the house, the other goes straight to the stables; so I got down, and told the man he might as well drive straight in, while I walked up to the house. The road follows close under the drawing-room windows, and, one of these being open, as I passed I heard a man\u0027s voice raised loud in anger, so loudly and so passionately, indeed, that I involuntarily stopped. His words were, as nearly as I can recollect, \u0027You have fooled me and spoilt my life, but you shall regret it. You think after all these years I am to be thrown off like an old glove. No, by Heaven; you may throw me over, but I swear you shall never marry this sailor or anybody else, whatever I may have to do to prevent it. You say I have the curse of the Carnes in my blood! You are right, and you shall have cause to regret it.\u0027 The voice was so loud and passionate that I believed the speaker was about to do some injury to Margaret, for I did not doubt that it was to her he was speaking, and I ran round through the hall-door to the door of the room; but I found Carne himself standing there. He, too, I suppose, when he had been about to enter, had heard the words. He said, \u0027Don\u0027t go in just at present, Margaret and her cousin are having a quarrel, but I think it\u0027s over now.\u0027 Seeing that he was there at hand I went away for a bit, and found afterwards that Mervyn had jumped from the window, gone to the stable and ridden straight off. Margaret didn\u0027t come down to dinner, making an excuse that she was unwell. Now, what do you think of that, doctor? You know that Mervyn\u0027s mother was a Carne, and that he has this mad blood that you warned me against in his veins. There is his threat, given in what was an almost mad outburst of passion. She is found dead this morning; what do you think of it?\" \"I don\u0027t know what to think of it, Gulston; I know but little of Mervyn myself, but I have heard men in his regiment say that he was a queer fellow, and though generally a most cheery and pleasant companion, he has at times fits of silence and moroseness similar, I should say, to those of his cousin, Reginald Carne. It is possible, lad, though I don\u0027t like to think so. When there is madness in the blood no one can say when it may blaze out, or what course it can take. The idea is a terrible one, and yet it is possible; it may indeed be so, for the madness in the family has twice before led to murder. The presumption is certainly a grave one, for although his messmates may consider Mervyn to be, as they say, a queer fellow, I do not think you would find any of them to say he was mad, or anything like it. Remember, Gulston, this would be a terrible accusation to bring against any man, even if he can prove—as probably he can prove—that he was at home, or here in Plymouth, at the time of the murder. The charge that he is mad, and the notoriety such a charge would obtain, is enough to ruin a man for life.\" \"I can\u0027t help that,\" the lieutenant said, gloomily. \"I heard him threaten Margaret, and I shall say so at the coroner\u0027s inquest to-morrow. If a man is such a coward as to threaten a woman he must put up with any consequences that may happen to befall him.\" The coroner and jury met in the dining-room at The Hold; they were all Carnesford men. Hiram Powlett, Jacob Carey, and the landlord of the \"Carne\u0027s Arms\" were upon it, for the summoning officer had been careful to choose on such an important occasion the leading men of the village. After having gone upstairs to view the body, the coroner opened the proceedings. The room was crowded. Many of the gentry of the neighbourhood were present. Lieutenant Gulston, with a hard set look upon his face, stood in a corner of the room with the doctor beside him. Ronald Mervyn, looking, as some of the Carnesford people remarked in a whisper, ten years older than he did when he drove through the village a few days before, stood on the other side of the table talking in low tones to some of his neighbours. \"We shall first, gentlemen,\" the coroner said, \"hear evidence as to the finding of the body. Ruth Powlett, the maid of the deceased lady, is the first witness.\" A minute later there was a stir at the door, and Ruth was led in by a constable. She was evidently so weak and unhinged that the coroner told her to take a chair. \"Now, Miss Powlett, tell us what you saw when you entered your mistress\u0027s room.\" \"Upon opening the door,\" Ruth said, in a calmer and more steady voice than was expected from her appearance, \"I saw that the window was open and the blind up. I was surprised at this, for Miss Carne did not sleep with her window open in winter, and the blind was always down. I walked straight to the washstand and placed the can of hot water there; then I turned round to wake Miss Carne, and I saw her lying there with a great patch of blood on her nightdress, and I knew by her face that she was dead. Then I fainted. I do not know how long I lay there. When I came to myself I got up and went to the door, and went downstairs to the kitchen and gave the alarm.\" \"You did not notice that any of Miss Carne\u0027s things had been taken from the table?\" the coroner asked. \"No, sir.\" \"Were there any signs of a struggle having taken place?\" \"No, sir, I did not see any. Miss Carne lay as if she was sleeping quietly. She was lying on her side.\" \"The bedclothes were not disarranged?\" \"No, sir, except that the clothes were turned down a short distance.\" \"You were greatly attached to your mistress, Miss Powlett?\" \"Yes, sir.\" \"She was generally liked—was she not?\" \"Yes, sir. Every one who knew Miss Carne was fond of her.\" \"Have any of you any further questions to ask?\" the coroner asked the jury. There was no reply. \"Thank you, Miss Powlett. I will not trouble you further at present.\" The cook then gave her testimony, and Dr. Arrowsmith was next called. He testified to the effect that upon his arrival he found that the room had not been disturbed in any way; no one had entered it with the exception, as he understood, of Miss Carne\u0027s maid, the cook, and Mr. Carne. The door was locked. When he went in, he found the deceased was dead, and it was his opinion, from the coldness and rigidity of the body, that she must have been dead seven or eight hours. It was just nine o\u0027clock when he arrived. He should think, therefore, that death had taken place between one and half-past two in the morning. Death had been caused by a stab given either with a knife or dagger. The blow was exactly over the heart, and extended down into the substance of the heart itself. Death must have been absolutely instantaneous. Deceased lay in a natural position, as if asleep. The clothes had been turned down about a foot, just low enough to uncover the region of the heart. After making an examination of the body, he examined the room with the constable, and found that a jewel-box on the table was open and its contents gone. The watch and chain of the deceased had also disappeared. He looked out of the window, and saw that it could be entered by an active man by climbing up a thick stem of ivy that grew close by. He observed several leaves lying on the ground, and was of the opinion that the assassin entered there. \"From what you say, Dr. Arrowsmith, it is your opinion that no struggle took place?\" \"I am sure that there was no struggle,\" the doctor replied. \"I have no question that Miss Carne was murdered in her sleep. I should say that the bedclothes were drawn down so lightly that she was not disturbed.\" \"Does it not appear an extraordinary thing to you, Dr. Arrowsmith, that if, as it seems, Miss Carne did not awake, the murderer should have taken her life?\" \"Very extraordinary,\" the doctor said, emphatically. \"I am wholly unable to account for it. I can understand that had she woke and sat up, a burglar might have killed her to secure his own safety, but that he should have quietly and deliberately set himself to murder her in her sleep is to me most extraordinary.\" \"You will note this circumstance, gentlemen,\" the coroner said to the jury. \"It is quite contrary to one\u0027s usual experiences in these cases. As a rule, thieves are not murderers. To secure their own safety they may take life, but as a rule they avoid running the risk of capital punishment, and their object is to effect robbery without rousing the inmates of the house. At present the evidence certainly points to premeditated murder rather than to murder arising out of robbery. It is true that robbery has taken place, but this might be merely a blind.\" \"You know of no one, Dr. Arrowsmith, who would have been likely to entertain any feeling of hostility against Miss Carne?\" \"Certainly not, sir. She was, I should say, universally popular, and certainly among the people of Carnesford she was regarded with great affection, for she was continually doing good among them.\" \"I am prepared to give evidence on that point,\" a voice said from the corner of the room, and there was a general movement of surprise as every one turned round to look at the speaker. \"Then perhaps, sir, we may as well hear your evidence next,\" the coroner said, \"because it may throw some light upon the matter and enable us to ask questions to the point of further witnesses.\" The lieutenant moved forward to the table: \"My name is Charles Gulston. I am first-lieutenant of the Tenebreuse, the flagship at Plymouth. I had the honour of the acquaintance of Mr. and Miss Carne, and have spent a day or two here on several occasions. I may say that I was deeply attached to Miss Carne, and had hoped some day to make her my wife. The day before yesterday I came over here upon Mr. Carne\u0027s invitation to dine and spend the night. His dogcart met me at the station. As we drove up to the last gate—that leading into the garden—I alighted from the trap and told the man to drive it straight to the stable, while I walked across the lawn to the house. The drawing-room window was open, and as I passed I heard the voice of a man raised in tones of extreme passion, so much so that I stopped involuntarily. His words were: \"\u0027You have fooled me and spoilt my life, but you shall regret it. You think that after all these years I am to be thrown off like an old glove. No, by Heaven! You may throw me over, but I vow that you shall never marry this sailor, or any one else, whatever I may have to do to prevent it. You say I have the curse of the Carnes in my blood. You are right, and you shall have cause to regret it.\u0027 \"The words were so loud and the tone so threatening that I ran round into the house and to the door, and should have entered it had not Mr. Carne, who was standing there, having apparently just come up, begged me not to do so, saying that his sister and cousin were having a quarrel, but that it was over now. As he was there I went away for a few minutes, and when I returned I found that Miss Carne had gone upstairs, and that her cousin had left, having, as Mr. Carne told me, left by the open window.\" While Lieutenant Gulston was speaking a deep silence reigned in the room, and as he mentioned what Reginald Carne had said, every eye turned towards Ronald Mervyn, who stood with face as white as death, and one arm with clenched hand across his breast, glaring at the speaker. \"Do you mean, sir——?\" he burst out as the lieutenant ceased; but the coroner at once intervened. \"I must pray you to keep silent for the present, Captain Mervyn. You will have every opportunity of speaking presently. \"As to these words that you overheard, Mr. Gulston, did you recognise the speaker of them before you heard from Mr. Carne who was with his sister in the drawing-room?\" \"Certainly. I recognised the voice at once as that of Captain Mervyn, whom I have met on several occasions.\" \"Were you impressed with his words, or did they strike you as a mere outburst of temper?\" \"I was so impressed with the tone in which they were spoken that I ran round to the drawing-room to protect Miss Carne from violence.\" \"Was it your impression, upon thinking of them afterwards, that the words were meant as a menace to Miss Carne?\" \"No, sir. The impression left upon my mind was that Captain Mervyn intended to fix some quarrel on me, as I had no doubt whatever that it was to me he alluded in his threats. The matter dwelt in my mind all the evening, for naturally nothing could have been more unpleasant than a public quarrel with a near relative of a lady to whom one is attached.\" There was a long silence. Then the coroner asked the usual question of the jurymen. None of them had a question to ask; indeed, all were so confounded by this new light thrown upon the matter that they had no power of framing a question. Job Harpur was then called. He testified to entering the bedroom of the deceased with Dr. Arrowsmith, and to the examination he had made of it. There he had found the jewel-box opened, its contents abstracted, and the watch gone. He could find nothing else disarranged in the room, or any trace whatever that would give a clue as to the identity of the murderer. He then looked out of the window with Dr. Arrowsmith, and saw by a few leaves lying on the ground, and by marks upon the bark of the ivy, that some one had got up or down. Dr. Arrowsmith had suggested that he should take up his post there, and not allow any one to approach, as a careful search might show footsteps or other marks that would be obliterated were people allowed to approach the window. When Captain Hendricks came they examined the ground together. They could find no signs of footsteps, but at a distance of some ten yards, at the foot of the wall, they found a torn glove, and this he produced. \"You have no reason in connecting this with the case in any way, I suppose, constable?\" the coroner asked as the glove was laid on the table before him. \"It might have been lying there for some time, I suppose.\" \"It might, sir.\" It was a dog-skin glove stitched with red, with three lines of black and red stitching down the back. While the glove was produced and examined by the jury, Ronald Mervyn was talking in whispers to some friends standing round him. \"I wish to draw your attention,\" Lieutenant Gulston said in a low tone to Captain Hendricks, \"that Captain Mervyn is at this moment holding in his hand a glove that in point of colour exactly matches that on the table; they are both a brighter yellow than usual.\" The Chief Constable glanced at the gloves and then whispered to the coroner. The latter started, and then said, \"Captain Mervyn, would you kindly hand me the glove you have in your hand. It is suggested to me that its colour closely resembles that of the glove on the table.\" Mervyn, who had not been listening to the last part of the constable\u0027s evidence, turned round upon being spoken to. \"My glove, yes, here it is. What do you want it for?\" The coroner took the glove and laid it by the other. Colour and stitching matched exactly; there could be no doubt but that they were a pair. A smothered exclamation broke from almost every man in the room. \"What is it?\" Ronald Mervyn asked. \"The constable has just testified, Captain Mervyn, that he found this glove a few feet from the window of the deceased. No doubt you can account for its being there, but until the matter is explained it has, of course, a somewhat serious aspect, coupled with the evidence of Lieutenant Gulston.\" Again Ronald Mervyn whitened to the hair. \"Do I understand, sir,\" he said in a low voice, \"that I am accused of the murder of my cousin?\" \"No one is at present accused,\" the coroner said, quietly. \"We are only taking the evidence of all who know anything about this matter. I have no doubt whatever that you will be able to explain the matter perfectly, and to prove that it was physically impossible that you could have had any connection whatever with it.\" Ronald Mervyn passed his hand across his forehead. \"Perhaps,\" the coroner continued, \"if you have the fellow of the glove now handed to me in your pocket, you will kindly produce it, as that will, of course, put an end to this part of the subject.\" \"I cannot,\" Ronald Mervyn answered. \"I found as I was starting to come out this morning that one of my gloves was missing, and I may say at once that I have no doubt that the other glove is the one I lost; though how it can have got near the place where it was found I cannot explain.\" The men standing near fell back a little. The evidence given by Mr. Gulston had surprised them, but had scarcely affected their opinion of their neighbour, but this strong piece of confirmatory evidence gave a terrible shock to their confidence in him. Mr. Carne was next called. He testified to being summoned while dressing by the cries of the servants, and to having found his sister lying dead. \"Now, Mr. Carne,\" the coroner said, \"you have heard the evidence of Lieutenant Gulston as to a quarrel that appears to have taken place on the afternoon of this sad event, between your sister and Captain Mervyn. It seems from what he said that you also overheard a portion of it.\" \"I beg to state that I attach no importance to this,\" Reginald Carne said, \"and I absolutely refuse to give any credence to the supposition that my cousin, Captain Mervyn, was in any way instrumental in the death of my sister.\" \"We all think that, Mr. Carne, but at the same time I must beg you to say what you know about the matter.\" \"I know very little about it,\" Reginald Carne said, quietly. \"I was about to enter the drawing-room, where I knew my cousin and my sister were, and I certainly heard his voice raised loudly. I opened the door quietly, as is my way, and was about to enter, when I heard words that showed me that the quarrel was somewhat serious. I felt that I had better leave them alone, and therefore quietly closed the door again. A few seconds later Lieutenant Gulston rushed in from the front door, and was about to enter when I stopped him. Seeing that it was a mere family wrangle, it was better that no third person should interfere in it, especially as I myself was at hand, ready to do so if necessary, which I was sure it was not.\" \"But what were the words that you overheard, Mr. Carne?\" Reginald Carne hesitated. \"I do not think they were of any consequence\" he said. \"I am sure they were spoken on the heat of the moment, and meant nothing.\" \"That is for us to judge, Mr. Carne. I must thank you to give them us as nearly as you can recollect.\" \"He said then,\" Reginald Carne said, reluctantly, \"\u0027I swear you shall never marry this sailor or any one else, whatever I may have to do to prevent it.\u0027 That was all I heard.\" \"Do you suppose the allusion was to Lieutenant Gulston?\" \"I thought so at the time, and that was one of the reasons why I did not wish him to enter. I thought by my cousin\u0027s tone that did Lieutenant Gulston enter at that moment an assault might take place.\" \"What happened after the lieutenant, in compliance with your request, left you?\" \"I waited a minute or two and then went in. My sister was alone. She was naturally much vexed at what had taken place.\" \"Will you tell me exactly what she said?\" Again Reginald Carne hesitated. \"I really don\u0027t think,\" he said after a pause, \"that my sister meant what she said. She was indignant and excited, and I don\u0027t think that her words could be taken as evidence.\" \"The jury will make all allowances, Mr. Carne. I have to ask you to tell them the words.\" \"I cannot tell you the precise words,\" he said, \"for she spoke for some little time. She began by saying that she had been grossly insulted by her cousin, and that she must insist that he did not enter the house again, for if he did she would certainly leave it. She said he was mad with passion; that he was in such a state that she did not feel her life was safe with him. I am sure, gentlemen, she did not at all mean what she said, but she was in a passion herself and would, I am sure, when she was cool, have spoken very differently.\" There was a deep silence in the room. At last the coroner said: \"Just two more questions, Mr. Carne, and then we have done. Captain Mervyn, you say, had left the room when you entered it. Is there any other door to the drawing-room than that at which you were standing?\" \"No, sir, there is no other door; the window was wide open, and as it is only three feet from the ground I have no doubt he went out that way. I heard him gallop off a minute or two later, so that he must have run straight round to the stables.\" \"In going from the drawing-room window to the stables, would he pass under the window of your sister\u0027s room?\" \"No,\" Reginald replied. \"That is quite the other side of the house.\" \"Then, in fact, the glove that was found there could not have been accidentally dropped on his way from the drawing-room to the stable?\" \"It could not,\" Reginald Carne admitted, reluctantly. \"Thank you; if none of the jury wish to ask you any question, that is all we shall require at present.\" The jury shook their heads. They were altogether too horrified at the turn matters were taking to think of any questions to the point. The Chief Constable then called the gardener, who testified that he had swept the lawn on the afternoon of the day the murder was committed, and that had a glove been lying at that time on the spot where it was discovered he must have noticed it. When the man had done, Captain Hendricks intimated that that was all the evidence that he had at present to call. \"Now, Captain Mervyn,\" the coroner said, \"you will have an opportunity of explaining this matter, and, no doubt, will be able to tell us where you were at the time Miss Carne met her death, and to produce witnesses who will at once set this mysterious affair, as far as you are concerned, at rest.\" Ronald Mervyn made a step forward. He was still very pale, but the look of anger with which he had first heard the evidence against him had passed, and his face was grave and quiet. \"I admit, sir,\" he began in a steady voice, \"the whole facts that have been testified. I acknowledge that on that afternoon I had a serious quarrel with my cousin, Margaret Carne. The subject is a painful one to touch upon, but I am compelled to do so. I had almost from boyhood regarded her as my future wife. There was a boy and girl understanding between us to that effect, and although no formal engagement had taken place, she had never said anything to lead me to believe that she had changed her mind on the subject; and I think I may say that in both of our families it was considered probable that at some time or other we should be married. \"On that afternoon I spoke sharply to her—I admit that—as to her receiving the attentions of another man; and upon her denying altogether my right to speak to her on such a subject, and repudiating the idea of any engagement between us, I certainly, I admit it with the greatest grief, lost my temper. Unfortunately I have been from a child given to occasional fits of passion. It is long since I have done so, but upon this occasion the suddenness of the shock, and the bitterness of my disappointment, carried me beyond myself, and I admit that I used the words that Lieutenant Gulston has repeated to you. But I declare that I had no idea whatever, even at that moment, of making any personal threat against her. What was in my mind was to endeavour in some way or other to prevent her marrying another man.\" Here he paused for a minute. So far the effect of his words had been most favourable, and as he stopped, his friends breathed more easily, and the jury furtively nodded to each other with an air of relief. \"As to the glove,\" Ronald Mervyn went on, deliberately, \"I cannot account for its being in the place where it was found. I certainly had both gloves on when I rode over here; how I lost it, or where I lost it, I am wholly unable to say. I may also add that I admit that I went direct from the drawing-room to the stable, and did not pass round the side of the house where the glove was found.\" He again paused. \"As to where I was between one o\u0027clock and half-past two the next morning, I can give you no evidence whatever.\" A gasp of dismay broke from almost every one in the room. \"It was becoming dark when I mounted my horse,\" he said, \"and I rode straight away; it is my custom, as my fellow-officers will tell you, when I am out of spirits, or anything has upset me, to ride away for hours until the fit has left me, and I have sometimes been out all night. It was so on this occasion. I mounted and rode away. I cannot say which road I took, for when I ride upon such occasions, I am absorbed in my thoughts and my horse goes where he will. Of myself, I do not know exactly at what hour I got home, but I asked the stableman, who took my horse, next morning, and he said the clock over the stable-gate had just struck half-past three when I rode in. I do not know that I have anything more to say.\" The silence was almost oppressive for a minute or two after he had finished, and then the coroner said: \"The room will now be cleared of all except the jury.\" The public trooped out in silence. Each man looked in his neighbour\u0027s face to see what he thought, but no one ventured upon a word until they had gone through the hall and out into the garden. Then they broke up in little knots, and began in low tones to discuss the scene in the dining-room. The shock given by the news of the murder of Miss Carne was scarcely greater than that which had now been caused by the proceedings before the coroner. A greater part of those present at the inquest were personal friends of the Carnes, together with three or four farmers having large holdings under them. Very few of the villagers were present, it being felt that although, no doubt, every one had a right to admission to the inquest, it was not for folks at Carnesford to thrust themselves into the affairs of the family at The Hold. Ronald Mervyn had, like the rest, left the room when it was cleared. As he went out into the garden, two or three of his friends were about to speak to him, but he turned off with a wave of the hand, and paced up and down the front of the house, walking slowly, with his head bent. \"This is a horribly awkward business for Mervyn,\" one of the young men, who would have spoken to him, said. \"Of course Mervyn is innocent; still it is most unfortunate that he can\u0027t prove where he was.\" \"Most unfortunate,\" another repeated. \"Then there\u0027s that affair of the glove and the quarrel. Things look very awkward, I must say. Of course, I don\u0027t believe for a moment Mervyn did it, because we know him, but I don\u0027t know what view a jury of strangers might take of it.\" Two or three of the others were silent. There was present in their minds the story of The Hold, and the admitted fact of insanity in the family of Ronald Mervyn, which was in close connection with the Carnes. Had it been any one else they, too, would have disbelieved the possibility of Ronald Mervyn having murdered Margaret Carne. As it was, they doubted: there had been other murders in the history of the Carnes. But no one gave utterance to these thoughts, they were all friends or acquaintances of the Mervyn family. Ronald might yet be able to clear himself completely. At any rate, at present no one was inclined to admit that there could be any doubt of his innocence. \"Well, what do you think, doctor, now?\" Lieutenant Gulston asked his friend, as separated from the rest they strolled across the garden. \"I don\u0027t quite know what to think,\" Dr. Mackenzie said, after a pause. \"No?\" Gulston said in surprise. \"Why it seems to me as clear as the sun at noon-day. What I heard seemed pretty conclusive. Now there is the confirmation of the finding of the glove, and this cock and bull story of his riding about for hours and not knowing where he was.\" \"Yes, I give due weight to these things,\" the doctor said, after another pause, \"and admit that they constitute formidable circumstantial evidence. I can\u0027t account for the glove being found there. I admit that is certainly an awkward fact to get over. The ride I regard as unfortunate rather than damnatory, especially if, as he says, his fellow officers can prove that at times, when upset, he was in the habit of going off for hours on horseback.\" \"But who else could have done it, Mackenzie? You see the evidence of the doctor went to show that she was murdered when asleep; no common burglar would have taken life needlessly, and have run the risk of hanging; the whole thing points to the fact that it was done out of revenge or out of ill-feeling of some sort, and has it not been shown that there is not a soul in the world except Mervyn who had a shadow of ill-feeling against her?\" \"No, that has not been shown,\" the doctor said, quietly. \"No one was her enemy, so far as the witnesses who were asked knew; but that is a very different thing; it\u0027s a very difficult thing to prove that any one in the world has no enemies. Miss Carne may have had some; some servant may have been discharged upon her complaint, she may have given deep offence to some one or other. There is never any saying.\" \"Of course that is possible,\" said the lieutenant again, \"but the evidence all goes against one man, who is known to have an enmity against her, and who has, to say the least of it, a taint of insanity in his blood. What are the grounds on which you doubt?\" \"Principally on his own statement, Gulston. I watched him narrowly from the time that you gave your evidence, and I own that my impression is that he is innocent. I give every weight to your evidence and that afforded by the glove, and to his being unable to prove where he was; and yet, alike from his face, his manner, and the tone of his voice, I do not think that he is capable of murder.\" No other words were spoken for some time, then the lieutenant asked: \"Do you think that an insane person could commit a crime of this kind and have no memory of it in their saner moments?\" \"That is a difficult question, Gulston. I do believe that a person in a sudden paroxysm of madness might commit a murder, and upon his recovery be perfectly unconscious of it; but I do not for a moment believe that a madman sufficiently sane to act with the cunning here shown in the mode of obtaining access, by the quiet stealthiness in which the victim was killed whilst in her sleep, and by the attempt to divert suspicion by the abstraction of the trinkets, would lose all memory of his actions afterwards. If Captain Mervyn did this thing, I am sure he would be conscious of it, and I am convinced, as I said, that he is not conscious.\" \"What will the jury think?\" the lieutenant asked after a long pause. \"I think they are sure to return a verdict against him. A coroner\u0027s jury are not supposed to go to the bottom of a matter; they are simply to declare whether there is prima facie evidence connecting any one with a crime; such evidence as is sufficient to justify them in coming to a conclusion that it should at any rate be further examined into. It\u0027s a very different thing with a jury at a trial; they have the whole of the evidence that can be obtained before them. They have all the light that can be thrown on the question by the counsel on both sides, and the assistance of the summing-up of the judge, and have then to decide if the guilt of the man is absolutely proven. A coroner\u0027s jury is not supposed to go into the whole merits of the case, and their finding means no more than the decision of a magistrate to commit a prisoner for trial. I think the coroner will tell the jury that in this case such evidence as there is before them points to the fact that Captain Mervyn committed this murder, and that it will be their duty to find such a verdict as will ensure the case being further gone into.\" \"Most of the jury are tenants of the Carnes,\" Gulston said; \"two or three of them I know are, for I met them at the inn when I was over here fishing. They will scarcely like to find against a relation of the family.\" \"I don\u0027t suppose they will,\" the doctor argued, \"but at the same time the coroner will not improbably point out to them that their verdict will simply lead to further investigation of the case, and that even for Captain Mervyn\u0027s own sake it is desirable that this should take place, for that the matter could not possibly rest here. Were they to acquit him, I imagine the Chief Constable would at once arrest him and bring him before a magistrate, who, upon hearing a repetition of the evidence given to-day, would have no choice but to commit him for trial.\" \"I suppose he would do that, anyhow?\" Lieutenant Gulston said. \"Not necessarily. I fancy a man can be tried upon the finding of a coroner\u0027s jury as well as upon that of a magistrate. Perhaps, however, if the coroner\u0027s jury finds against him he may be formally brought up before the magistrates, and a portion of the evidence heard, sufficient to justify them in committing him for trial. See, people are going into the house again. Probably they have thrown the door open, and the jury are going to give their finding. I don\u0027t think we need go in.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3157/86665.html","bookId":776,"book":{"id":776,"title":"The Curse of Carne\u0027s Hold","description":"简介： There was nothing about Carne\u0027s Hold that would have suggested to the mind of the passing stranger that a curse lay upon it. Houses to which an evil history is attached lie almost uniformly in low and damp situations. They are embedded in trees; thei...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3157","creation":"Aug 1, 2019 12:19:30 AM","modification":"Aug 1, 2019 12:19:30 AM"}}
