{"id":40428,"no":49,"title":"GETAWAY","content":"“Give me a knife.” Maddy held out her hand, ignoring theshocked look on her son’s face. \\n\\n Tally scrambled through her knapsack. She passed hermultiknife to Maddy, who pulled out a short blade and cuta piece from the arm of her jumpsuit. When the elevatorreached roof level, its doors slid halfway open and groanedto a halt, revealing the uneven hole Tally had torn to gainentry. They slipped through one by one and ran for the edgeof the roof. \\n\\n A hundred meters away, Tally saw the hoverboardscruising across the compound, called by her crashbracelets. Alarms were ringing all around them now. If bysome magic the Specials hadn’t noticed the escape so far,the riderless boards had tripped the wire. \\n\\n Tally spun around, looking for David. He was stumblingalong at the back of the group, half in a daze. Shecaught him by his shoulders. “I’m so sorry.” \\n\\n He shook his head. Not at her, not at anything in particular. \\n\\n 390 Scott Westerfeld“I don’t know what to do, Tally.” \\n\\n She took his hand. “We have to run. That’s all we cando right now. Follow your mother.” \\n\\n He looked into her eyes, his face wild. “Okay.” Hestarted to say more, but the words were drowned out by anoise like huge fingernails scraping metal. The hovercardoor was fighting against the nanotech glue, setting thewhole roof shuddering. \\n\\n Maddy, last out of the elevator, had jimmied its dooropen with a powerjack. Its voice kept repeating, “Elevatorrequested.” \\n\\n But there were other ways onto the roof. Maddy turnedto David. “Glue down those hatches so they can’t get out.” \\n\\n His gaze cleared for a moment, and he nodded. \\n\\n “I’ll get the boards,” Tally said, turning to dash for theedge of the roof. When she reached it, she jumped intospace, hoping her bungee jacket still had some charge. \\n\\n After one bounce, Tally was on the ground running. Theboards sensed her crash bracelets and sped toward her. \\n\\n “Tally! Look out!” \\n\\n She looked over her shoulder at Croy’s shout. A squadof Specials was headed toward her across the compound, anopen door behind them at ground level. They ran inhumanlyfast, covering the ground with long, loping strides. \\n\\n The boards nudged her calves from behind, like dogsready to play. Tally leaped up, teetering for a moment withone foot on each pair of sandwiched boards. She’d neverheard of anyone riding four boards at once. But the closestcruel pretty was only a few strides away. \\n\\n Tally snapped her fingers and rose swiftly into the air. \\n\\n The Special jumped, amazingly high, the fingers of oneoutstretched hand just brushing the front edge of theboards. The contact set them wobbling beneath Tally. It waslike standing on a trampoline while someone else jumpedon it. The other Specials watched from the ground below,waiting for her to fall. \\n\\n But Tally regained her balance and leaned forward,heading back toward the building. The boards picked upspeed, and seconds later Tally leaped off onto the roof,kicking one pair of hoverboards to Croy. He pulled themapart while she separated the other two. \\n\\n “Go now,” Maddy said. “Take this.” \\n\\n She handed Tally a swatch of orange fabric, a small bitof circuitry visible on one side. Tally noticed that Maddyhad cut pieces from the forearms of all the jumpsuits. \\n\\n “There’s a tracker in that cloth,” Maddy said. “drop itsomewhere to throw them off.” \\n\\n Tally nodded, looking around for David. He was runningtoward them, his face set into a grim mask, the tube ofglue crushed and empty in his hand. “David—,” she started. \\n\\n “Go!” Maddy shouted, pushing Shay onto the boardbehind Tally. \\n\\n “Um, no crash bracelets?” Shay said, her feet unsteady. \\n\\n “This is not my first party tonight, you know.” \\n\\n UGLIES 391“I know. Hold on,” Tally said, and shot away from theroof. \\n\\n The two of them teetered for a moment, almost losingtheir balance. But Tally steadied herself, feeling Shay’s armswrap tightly around her waist. \\n\\n “Whoa, Tally! Slow down!” \\n\\n “Just hang on.” \\n\\n Tally leaned into a turn, sickened by the sluggishness ofthe board. Not only was it carrying two, but Shay’s wobblymoves were freaking it out. \\n\\n “Don’t you remember how to ride?” \\n\\n “Sure!” Shay said. “Just a little rusty, Squint. Plus a littletoo much to drink tonight.” \\n\\n “Just don’t fall off. It’ll hurt.” \\n\\n “Hey! I didn’t ask to be rescued!” \\n\\n “No, I guess you didn’t.” Tally looked down as theysoared over Crumblyville, skipping the greenbelt to headstraight back toward the river. If Shay hit the ground at thisspeed, she’d be worse than hurt. She’d be dead. \\n\\n Like David’s father. Tally wondered how he’d died. Hadhe tried to escape the Specials, like the Boss? Or had Dr. \\n\\n Cable done something to him? One thought stuck in hermind: However it had happened, it was her fault. \\n\\n “Shay, if you fall off, take me with you.” \\n\\n “What?” \\n\\n “Just hold on to me and don’t let go, no matter what. \\n\\n I’m wearing a bungee jacket and bracelets. We should392 Scott Westerfeldbounce.” Probably. Unless the jacket pulled her one wayand the bracelets the other. Or Tally’s and Shay’s combinedweight was too much for the lifters. \\n\\n “So give me the bracelets, silly.” \\n\\n Tally shook her head. “No time to stop.” \\n\\n “Guess not. Our Special friends are going to be royallypissed.” Shay clung tighter. \\n\\n They were almost at the river, with no sign of pursuitbehind them. The nanotech glue must have beenputting up quite a fight. But Special Circumstances hadother hovercars—the three they’d seen leave earlier, atleast—and regular wardens had them too. \\n\\n Tally wondered if Special Circumstances would call forhelp from the wardens, or whether they’d keep the wholesituation a secret. What would the wardens think of theunderground prison? Did the regular city governmentknow what the Specials had done to the Smoke, or to Az? \\n\\n Water flashed below her, and Tally dropped the swatchof orange cloth as they turned. It fluttered away, downtoward the river. The current would take it back toward thecity, in the opposite direction of their escape route. \\n\\n Tally and David had agreed to rendezvous upriver, along way past the ruins, where he had found a cave yearsbefore. Because its entrance was covered by a waterfall, itwould shelter them from heat sensors. From there, theycould hike back to the ruins to retrieve the rest of theirequipment, and then . . . \\n\\n UGLIES 393Rebuild the Smoke? Seven of them? With Shay as theirhonorary pretty? Tally realized that they hadn’t made plansbeyond tonight. The future hadn’t seemed real until now. \\n\\n Of course, they still might all be caught. \\n\\n “You think it’s true?” Shay shouted. “What Maddy said?” \\n\\n Tally dared a glance back at Shay. Her pretty face lookedworried. \\n\\n “I mean, Az was fine when I visited a few days ago,” \\n\\n Shay said. “I thought they were going to make him pretty. \\n\\n Not kill him.” \\n\\n “I don’t know.” It was hardly something Maddy wouldlie about. But maybe she was mistaken. \\n\\n Tally leaned forward, skimming the river low and fast,trying to leave the cold feeling in her stomach behind. \\n\\n Spray struck their faces as they hit the white water. Shayhad started to ride properly, leaning with the slow arcs ofthe river’s bends. “Hey, I remember this!” she shouted. \\n\\n “Do you remember anything else from before youroperation?” Tally yelled over the roar of water. \\n\\n Shay ducked behind Tally as they struck a wall of spray. \\n\\n “Of course, silly.” \\n\\n “You hated me. Because I stole David from you. BecauseI betrayed the Smoke. Remember?” \\n\\n Shay was silent for a moment, only the roar of whitewater and the rushing wind around them. Finally, sheleaned closer, her voice thoughtful in Tally’s ear. “Yeah, Iknow what you mean. But that was all ugly stuff. Crazy love394 Scott Westerfeldand jealousy and needing to rebel against the city. Everykid’s like that. But you grow up, you know?” \\n\\n “You grew up because of an operation? Doesn’t thatstrike you as weird?” \\n\\n “It wasn’t because of the operation.” \\n\\n “Then why?” \\n\\n “It was just good to come home, Tally. It made me realizehow crazy the whole Smoke thing was.” \\n\\n “What happened to biting and kicking?” \\n\\n “Well, it took a few days to sink in, you know.” \\n\\n “Before or after you became pretty?” \\n\\n Shay went silent again. Tally wondered if you could talksomebody out of their brain damage. \\n\\n She pulled a position-finder from her pocket. The coordinatesfor the cave were still half an hour away. A glanceover her shoulder didn’t reveal any hovercars, not yet. If allfour boards took different routes to the river, and all ofthem dropped their trackers in different places, the Specialswere going to have a confusing night. \\n\\n There were also Dex, Sussy, and An, who’d promised totell every tricky ugly they knew to go for a ride tonight. Thegreenbelt would be crowded. \\n\\n Tally wondered how many uglies had seen the burningletters in New Pretty Town, how many of them knew whatthe Smoke was, or were coming up with their own storiesto explain the mysterious message. What new legends hadshe and David created with their little diversion? \\n\\n UGLIES 395When they reached a calmer part of the river, Shayspoke up again. “So, Tally?” \\n\\n “Yeah?” \\n\\n “Why do you want me to hate you?” \\n\\n “I don’t want you to hate me, Shay.” Tally sighed. “Ormaybe I do. I betrayed you, and I feel horrible about it.” \\n\\n “The Smoke wasn’t going to last forever, Tally. Whetheryou turned us in or not.” \\n\\n “I didn’t turn you in!” Tally cried. “Not on purpose,anyway. And the whole thing with David was just an accident. \\n\\n I didn’t mean to hurt you.” \\n\\n “Of course not. You’re just confused.” \\n\\n “I’m confused?” Tally groaned. “You’re the one who . . .” \\n\\n She trailed off. How could Shay not understand that she’dbeen changed by the operation? Not just been given apretty face, but also a . . . pretty mind. Nothing else couldexplain how quickly she’d changed, abandoning the rest ofthem for parties and hot showers, leaving her friendsbehind, just as Peris had so many months ago. \\n\\n “Do you love him?” Shay asked. \\n\\n “David? I, uh . . . maybe.” \\n\\n “That’s sweet.” \\n\\n “It’s not sweet. It’s real!” \\n\\n “Then why are you ashamed of it?” \\n\\n “I’m not . . . ,” Tally sputtered. She lost concentrationfor a moment, and the back of the board dipped low, sendinga sheet of water up behind them. Shay whooped and396 Scott Westerfeldheld tighter. Tally gritted her teeth and took them a bithigher. \\n\\n When Shay had stopped laughing, she said, “And youthink I’m confused?” \\n\\n “Listen, Shay, there’s one thing I’m not confused about. \\n\\n I didn’t want to betray the Smoke. I was blackmailed intogoing there as a spy, and when I sent for the Specials, it wasan accident, really. But I’m sorry, Shay. I’m sorry I ruinedyour dream.” Tally felt herself crying, the tears driven backwardby the wind. The trees rushed past in the darkness fora while. \\n\\n “I’m just glad you two made it back to civilization,” \\n\\n Shay said softly, holding on tight. “And I’m not sorry aboutwhat happened. If that makes you feel any better.” \\n\\n Tally thought of the lesions on Shay’s brain, the tinycancers or wounds or whatever they were, that she didn’teven know she had. They were in there somewhere, changingher friend’s thoughts, warping her feelings, gnawing atthe roots of who she was. Making her forgive Tally. \\n\\n “Thanks, Shay. But no, it doesn’t.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1847/53581.html","bookId":974,"book":{"id":974,"title":"Uglies 丑人儿","description":"简介： 2005年，Scott发表了作品《丑人儿》(Uglies)。作品虚构了一个表面繁华美丽的New Pretty Town，这里的人们全都优雅美丽，生活富足快乐，过着无忧无虑的生活。所有的青少年只需在年满16岁时接受一次全身整容手术，即可拥有明星般的外貌和美好的生活。在这一看似充满诱惑力...","cover":"http://novel.tingroom.com/file/upload/201708/01/15-55-12-46-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1847","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
