{"id":40430,"no":51,"title":"HIPPOCRATIC OATH","content":"They stayed at the edge of the Rusty Ruins. \\n\\n Occasionally, hovercars would pass over the crumblingcity, threading a slow search pattern across the sky. But theSmokies were old hands at hiding from satellites and aircraft. \\n\\n They placed red herrings across the ruins—chemicalglowsticks that gave off human-size pockets of heat—andcovered the windows of their building with sheets of blackMylar. And of course the ruins were very large; findingseven people in what had once been a city of millions wasno simple matter. \\n\\n Every night, Tally watched the influence of the “NewSmoke” grow. A lot of uglies had seen the burning messageon the night of the escape, or had heard about it, and thenightly pilgrimages out to the ruins slowly increased, untilsparklers wavered atop high buildings from midnight untildawn. Tally, Ryde, Croy, and Astrix made contact with thecity uglies, starting new rumors, teaching new tricks, andoffering glimpses of the ancient magazines the Boss had salvagedfrom the Smoke. If they doubted the existence of406 Scott WesterfeldSpecial Circumstances, Tally showed them the plastic handcuffbracelets still encircling her wrists, and invited them totry to cut the cuffs off. \\n\\n One new legend towered above all the rest. Maddy haddecided that the brain lesions couldn’t be kept a secret anymore;every ugly had the right to know what the operationreally entailed. Tally and the others spread the rumoramong their city friends: Not just your face was changed bythe knife. Your personality—the real you inside—was theprice of beauty. \\n\\n Of course, not every ugly believed such an outrageoustale, but a few did. And some sneaked across to New PrettyTown in the dead of night to talk to their older friends faceto-face, and decided for themselves. \\n\\n The Specials sometimes tried to crash the party, settingtraps for the New Smokies, but someone always gave awarning, and no hovercar could ever catch a board amongwinding streets and rubble. The New Smokies learned thenooks and crannies of the ruins as if they’d been born there,until they could disappear in a heartbeat. \\n\\n Maddy worked on the brain cure, using materials salvagedfrom the ruins or brought by city uglies willing toborrow from hospitals and chem classes. She withdrewfrom the rest of them, except for David. She seemedparticularly cool to Tally, who felt guilty for every momentshe spent with David, now that his mother was alone. Noneof them ever talked about Az’s death. \\n\\n UGLIES 407Shay stayed with them, complaining about the food,the ruins, her hair and clothes, and having to look at all theugly faces around her. But she never seemed bitter, onlyperpetually annoyed. After the first few days she didn’t eventalk about leaving. Perhaps the brain damage made her pliant,or the fact that she hadn’t lived in New Pretty Town forlong. She still remembered them all as friends. Tally sometimeswondered if Shay secretly enjoyed having the onlypretty face in their little rebellion. Certainly, she didn’t doany more work than she would have in the city; Ryde andAstrix obeyed her every command. \\n\\n David helped his mother, searching the ruins for salvage,and taught wilderness survival tricks to any ugly whowanted to learn. But in the two weeks after his father’sdeath, Tally found herself missing the days when it hadbeen just the two of them. \\n\\n Twenty days after the rescue, Maddy announced thatshe had found a cure. \\n\\n “Shay, I want to explain this to you carefully.” \\n\\n “Sure, Maddy.” \\n\\n “When you had the operation, they did something toyour brain.” \\n\\n Shay smiled. “Yeah, right.” She looked across at Tally,wearing a familiar expression. “That’s what Tally keeps tellingme. But you guys don’t understand.” \\n\\n Maddy folded her hands. “What do you mean?” \\n\\n “I like the way I look,” Shay insisted. “I’m happier inthis body. You want to talk about brain damage? Look atyou all, running around these ruins playing commando. \\n\\n You’re all full of schemes and rebellions, crazy with fearand paranoia, even jealousy.” Her eyes skipped back andforth between Tally and Maddy. “That’s what being uglydoes.” \\n\\n “And how do you feel, Shay?” Maddy asked calmly. \\n\\n “I feel bubbly. It’s nice not being all raging with hormones. \\n\\n Of course, it kind of sucks being out here instead ofin the city.” \\n\\n “No one’s keeping you here, Shay. Why haven’t you left?” \\n\\n Shay shrugged. “I don’t know. . . . I’m worried aboutyou guys, I guess. It’s dangerous out here, and messing withSpecials isn’t a good idea. You should know that by now,Maddy.” \\n\\n Tally took a sharp breath, but Maddy’s expression didn’tchange. “And you’re going to protect us from them?” sheasked calmly. \\n\\n Shay shrugged. “I just feel bad about Tally. If I hadn’ttold her about the Smoke, she’d be pretty right now insteadof living in this dump. And I figure eventually she’ll decideto grow up. We’ll go back together.” \\n\\n “You don’t seem to want to decide for yourself.” \\n\\n “Decide what?” Shay rolled her eyes, looking at Tally toconfirm what a bore this was. The two of them had plowedthrough this conversation a dozen times before, until Tally408 Scott Westerfeldhad realized there was no convincing Shay that her personalityhad changed. To Shay, her new attitude was simply theresult of growing up, moving on, leaving all the overheatedemotions of ugliness behind. \\n\\n “You weren’t always this way, Shay,” David said. \\n\\n “No, I used to be ugly.” \\n\\n Maddy smiled gently. “These pills won’t change the wayyou look. They’ll only affect your brain, undoing what Dr. \\n\\n Cable did to the way your mind works. Then you candecide for yourself how you want to look.” \\n\\n “Decide? After you’ve messed with my brain?” \\n\\n “Shay!” Tally said, forgetting her promise to remainsilent. “We’re not the ones messing with your brain!” \\n\\n “Tally,” David said softly. \\n\\n “That’s right, I’m the one who’s crazy.” Shay’s voice tookon the tone of her daily round of complaining. “Not youguys, who live in a broken-down building on the edge of adead city, slowly turning into freaks when you could bebeautiful. Yeah, I’m crazy all right . . . for trying to help you!” \\n\\n Tally sat back and crossed her arms, silenced by Shay’swords. Whenever they had this conversation, realitybecame a little unhinged, as if she and the other NewSmokies might really be the insane ones. It felt like Tally’shorrible first days in the Smoke, when she hadn’t knownwhose side she was on. \\n\\n “How are you helping us, Shay?” Maddy asked calmly. \\n\\n “I’m trying to get you to understand.” \\n\\n UGLIES 409“Just like you did when Dr. Cable used to bring you bymy cell?” \\n\\n Shay’s eyes narrowed, confusion clouding her face, as ifher memories of the underground prison didn’t fit in withthe rest of her pretty worldview. \\n\\n “I know Dr. C was horrible to you,” she said. “TheSpecials are psychos—just look at them. But that doesn’tmean you have to spend your whole lives running away. \\n\\n That’s what I’m saying. Once you turn, Specials won’t messwith you.” \\n\\n “Why not?” \\n\\n “Because you won’t make trouble anymore.” \\n\\n “Why not?” \\n\\n “Because you’ll be happy!” Shay took a couple of deepbreaths, and her usual calm returned. She smiled, beautifulagain. “Like me.” \\n\\n Maddy picked up the pills on the table in front of her. \\n\\n “You won’t take these willingly?” \\n\\n “No way. You said they’re not even safe.” \\n\\n “I said there was a small chance something could gowrong.” \\n\\n Shay laughed. “You must think I’m nuts. And even ifthose pills work, look what they’re supposed to do. Fromwhat I can tell, ‘cured’ means being a jealous, self-important,whiny little ugly-brain. It means thinking you’ve got all theanswers.” She crossed her arms. “In a lot of ways, you andDr. Cable are alike. You’re both convinced you’ve personally410 Scott Westerfeldgot to change the world. Well, I don’t need that. And I don’tneed those.” \\n\\n “Okay, then.” Maddy picked up the pills and put themin her pocket. “That’s all I have to say.” \\n\\n “What do you mean?” Tally asked. \\n\\n David squeezed her hand. “That’s all we can do, Tally.” \\n\\n “What? You said we could cure her.” \\n\\n Maddy shook her head. “Only if she wants to be cured. \\n\\n These are experimental, Tally. We can’t give them to someoneagainst her will. Not when we don’t know if they’llwork.” \\n\\n “But her mind . . . she’s got the lesions!” \\n\\n “Hello,” Shay called. “She is sitting right here.” \\n\\n “Sorry, Shay,” Maddy said mildly. “Tally?” \\n\\n Maddy pulled aside the Mylar barrier, stepping outonto what the New Smokies called the balcony. It was reallyjust part of the top floor of the building, where the roof hadentirely collapsed, leaving sweeping views of the ruins. \\n\\n Tally followed. Behind her, Shay was already talkingabout what was for dinner. David came out a moment later. \\n\\n “So, we give her the pills secretly, right?” Tally whispered. \\n\\n “No,” Maddy said firmly. “We can’t. I’m not going to domedical experiments on unwilling subjects.” \\n\\n “Medical experiments?” Tally swallowed. \\n\\n David took her hand. “You can’t know for sure howsomething like this will work. It’s only a one-percent chance,but it could screw up her brain forever.” \\n\\n UGLIES 411“It’s already screwed up.” \\n\\n “But she’s happy, Tally.” David shook his head. “And shecan make decisions for herself.” \\n\\n Tally pulled her hand away, staring out over the city. Asparkler was already showing on the tall spire, uglies cometo gossip and trade. “Why did we even have to ask? Theydidn’t get her permission when they did this to her!” \\n\\n “That’s the difference between us and them,” Maddysaid. “After Az and I found out what the operation reallymeant, we realized we’d been party to something horrible. \\n\\n People had had their minds changed without their knowledge. \\n\\n As doctors, we took an ancient oath never to do anythinglike that.” \\n\\n Tally looked into Maddy’s face. “But if you weren’tgoing to help Shay, why did you bother finding a cure?” \\n\\n “If we knew the treatment would work safely, then wecould give it to Shay and see how she felt about it later. Butto test it, we need a willing subject.” \\n\\n “Where are we ever going to find one? Anyone who’spretty is going to say no.” \\n\\n “Maybe for right now, Tally. But if we keep makinginroads into the city, we might find a pretty who wants out.” \\n\\n “But we know Shay’s crazy.” \\n\\n “She’s not crazy,” Maddy said. “Her arguments makesense, in fact. She’s happy as she is, and doesn’t want to takea deadly risk.” \\n\\n “But she’s not really herself. We have to change her back.” \\n\\n 412 Scott Westerfeld“Az died because someone thought like that,” Maddysaid grimly. \\n\\n “What?” \\n\\n David put his arm around her. “My father . . .” Hecleared his throat, and Tally waited in silence. Finally hewould tell her how Az had died. \\n\\n He took a slow breath before continuing. “Dr. Cablewanted to turn them all, but she was worried that Mom andDad might talk about the brain lesions, even after theoperation, because they’d been focused on them for solong.” David’s voice trembled, but it was soft and careful, asif he didn’t dare put any emotion into the words. “Dr. Cablewas already working on ways to change memories, a way oferasing the Smoke forever from people’s minds. When theytook my father for the operation, he never came back.” \\n\\n “That’s awful,” Tally whispered. She gathered him intoa hug. \\n\\n “Az was the victim of a medical experiment, Tally,” \\n\\n Maddy said. “I can’t do the same thing to Shay. Otherwise,she’d be right about me and Dr. Cable.” \\n\\n “But Shay ran away. She didn’t want to become pretty.” \\n\\n “She doesn’t want to be experimented on, either.” \\n\\n Tally closed her eyes. Through the Mylar shade, she couldhear Shay telling Ryde about the hairbrush she’d made. Fordays she’d proudly shown the little brush, made of splintersof wood shoved into a lump of clay, to anyone who wouldlisten. As if it were the most important thing she’d ever done. \\n\\n UGLIES 413They had risked everything to rescue her. But they hadnothing to show for it. Shay would never be the same. \\n\\n And it was all Tally’s fault. She’d come to the Smoke,and had brought the Specials, leaving Shay an emptyheadedpretty, and Az dead. \\n\\n She took a deep breath. “Okay, you’ve got a willingsubject.” \\n\\n “What do you mean, Tally?” \\n\\n “Me.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1847/53583.html","bookId":974,"book":{"id":974,"title":"Uglies 丑人儿","description":"简介： 2005年，Scott发表了作品《丑人儿》(Uglies)。作品虚构了一个表面繁华美丽的New Pretty Town，这里的人们全都优雅美丽，生活富足快乐，过着无忧无虑的生活。所有的青少年只需在年满16岁时接受一次全身整容手术，即可拥有明星般的外貌和美好的生活。在这一看似充满诱惑力...","cover":"http://novel.tingroom.com/file/upload/201708/01/15-55-12-46-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1847","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
