{"id":40432,"no":53,"title":"DOWN THE RIVER","content":"Before leaving, Tally wrote a letter to herself. \\n\\n It was Maddy’s idea, to put her consent in writing. Thatway, even as a pretty, unable to comprehend why she wouldever want her brain fixed, Tally could at least read her ownwords and know what was about to happen. \\n\\n “Whatever makes you feel better,” Tally said. “As longas you cure me, no matter what I say. Don’t leave me likeShay.” \\n\\n “I’ll cure you, Tally. I promise. I just need written consent.” \\n\\n Maddy handed her a pen and a small, precious pieceof paper. \\n\\n “I never learned penmanship,” Tally said. “They don’trequire it anymore.” \\n\\n Maddy shook her head sadly and said, “Okay. You dictate,and I’ll write it.” \\n\\n “Not you. Shay can write it for me. She took a class,back when she was trying to get to the Smoke.” Tallyremembered the scrawl of Shay’s directions to the Smoke,clumsy but readable. \\n\\n UGLIES 421F F FThe letter didn’t take long. Shay giggled at Tally’s heartfeltwords, but she wrote them down as directed. There wassomething earnest in the way she put stylus to paper, like alittlie learning how to read. \\n\\n When they were finished, David still hadn’t come back. \\n\\n He’d taken one of the hoverboards in the direction of theruins. As she put away her things, Tally kept glancing at thewindow, hoping he would return. \\n\\n But Maddy was probably right. If Tally saw him again,she would just talk herself out of this. Or maybe Davidwould stop her. \\n\\n Or worse, maybe he wouldn’t. \\n\\n But no matter what David said now, he would alwaysremember what she had done, the lives she had cost withher secrets. This was the only way Tally could be certainthat he had forgiven her. If he came to rescue her, shewould know. \\n\\n “So, let’s get moving,” Shay said when they were done. \\n\\n “Shay, I’m not going to be gone forever. I’d rather you . . .” \\n\\n “Come on. I’m sick of this place.” \\n\\n Tally bit her lip. What was the point of giving herself upif Shay was coming too? Of course, they could alwayssnatch her away again as well. Once the cure was proven towork, they could give it to anyone. Or everyone. \\n\\n “The only reason I’ve been hanging around this dumpis to try to get you to come back,” Shay said, then loweredher voice. “You know, it’s my fault you’re not already pretty. \\n\\n I messed up everything by running away. I owe you.” \\n\\n “Oh, Shay.” Tally’s head began to spin. She closed hereyes. \\n\\n “Maddy always says I can go anytime. You don’t wantme to go back all alone, do you?” \\n\\n Tally tried to imagine Shay hiking to the river alone. \\n\\n “No, I guess not.” She looked at her friend’s face and saw aspark in her eyes, something real ignited by the idea ofgoing on a trip with Tally. \\n\\n “Please! We’ll have a blast in New Pretty Town.” \\n\\n Tally spread her hands. “Okay. I guess I can’t stop you.” \\n\\n They rode together on one hoverboard. Croy came along onanother, to take the boards back when they reached thecity’s edge. \\n\\n He didn’t talk the whole way down. The other NewSmokies had all heard the fight outside, and finally knewwhat Tally had done. It must have been worse for Croy. Hehad suspected, and she’d lied to him face-to-face. He wasprobably wishing he’d stopped Tally himself before she’dhad a chance to betray them all. \\n\\n When they reached the greenbelt, though, he forcedhimself to look at her. “What did they do to you, anyway? \\n\\n To make you do something like that?” \\n\\n “They said I couldn’t turn, until I’d found Shay.” \\n\\n He looked away, staring at the lights of New Pretty422 Scott WesterfeldTown, bright in the clear cold of a November night. “Soyou’re finally getting your wish.” \\n\\n “Yeah. I guess.” \\n\\n “Tally’s going to be pretty!” Shay said. \\n\\n Croy ignored her and looked at Tally again. “Thanks forrescuing me, though. That was some trick you guys pulledoff. I hope that . . .” He shrugged, and shook his head. “Seeyou later.” \\n\\n “I hope so.” \\n\\n Croy stuck the boards together and headed back upthe river. \\n\\n “This is going to be the best!” Shay said. “I can’t wait foryou to meet all my new friends. And you can finally introduceme to Peris.” \\n\\n “Sure.” \\n\\n They walked down toward Uglyville until they foundthemselves in Cleopatra Park. The earth was hard underneaththeir feet in the late autumn chill, and they huddledclose against the cold. Tally wore her Smoke-made sweater. \\n\\n She’d wanted Maddy to keep it for her, but she’d left hermicrofiber jacket behind instead. City-made clothes weretoo valuable to waste on someone going back to civilization. \\n\\n “You see, I was already getting popular,” Shay was saying. \\n\\n “Having a criminal past is the only way into the reallygood parties. I mean, no one wants to hear about whatclasses you took in ugly school.” She giggled. \\n\\n UGLIES 423“We should be a hit, then.” \\n\\n “Duh. When we tell everyone about your kidnappingme right out of Special Circumstances headquarters? Andhow I talked you into escaping from that band of freaks? \\n\\n But we’re going to have to tone it down, Squint. No one’sever going to believe the truth!” \\n\\n “No, you’re right about that.” \\n\\n Tally thought of the letter she’d left with Maddy. Wouldshe even believe the truth in a few weeks’ time? How wouldthe words of a fugitive, desperate, tragic ugly look throughpretty eyes? \\n\\n For that matter, what was David going to look like aftershe’d been surrounded by new pretty faces twenty-fourhours a day? Would she really believe all that stuff aboutugliness again, or would she remember how someone couldbe beautiful even without surgery? Tally tried to pictureDavid’s face, but it hurt to think of how long it would bebefore she saw him again. \\n\\n She wondered how long it would take after the operation,before she would stop missing David. It might be afew days before the lesions completely took hold of her,Maddy had warned. But that didn’t mean it was her ownmind, changing itself. \\n\\n Maybe if she decided to go on missing him, no matterwhat, Tally could keep her mind from changing. Unlikemost people, she knew about the lesions. Maybe she couldbeat them. \\n\\n 424 Scott WesterfeldA dark shape passed overhead, a warden’s hovercar,and Tally instinctively froze. The city uglies had said therewere more patrols out these days. The regular authoritieshad finally noticed that things were changing. \\n\\n The hovercar halted, then settled softly onto the earthnext to them. A door slid open, and a blinding light poppedon. “All right, you kids . . . oh, sorry, miss.” \\n\\n The light was on Shay’s face. Then it flicked acrossto Tally. \\n\\n “What are you two . . . ?” The warden’s voice stumbled. \\n\\n Didn’t this beat everything? A pretty and an ugly taking astroll together. The warden came closer, confusion all overhis middle-pretty face. \\n\\n Tally smiled. At least she was causing trouble to the end. \\n\\n “I’m Tally Youngblood,” she said. “Make me pretty.” \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1847/53585.html","bookId":974,"book":{"id":974,"title":"Uglies 丑人儿","description":"简介： 2005年，Scott发表了作品《丑人儿》(Uglies)。作品虚构了一个表面繁华美丽的New Pretty Town，这里的人们全都优雅美丽，生活富足快乐，过着无忧无虑的生活。所有的青少年只需在年满16岁时接受一次全身整容手术，即可拥有明星般的外貌和美好的生活。在这一看似充满诱惑力...","cover":"http://novel.tingroom.com/file/upload/201708/01/15-55-12-46-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1847","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
