{"id":40387,"no":8,"title":"RAPIDS","content":"“Good night.” “Sleep tight,” replied the room. Tally pulled on a jacket, clipped her sensor to her bellyring, and opened the window. The air was still, the river soflat that she could make out every detail of the city skylinemirrored in it. It looked like the pretties were having somesort of event. She could hear the roar of a huge crowdacross the water, a thousand cheers rising and fallingtogether. The party towers were dark under the almost fullmoon, and the fireworks all shimmering hues of blue,climbing so high that they exploded in silence. The city had never looked so far away. “I’ll see you soon, Peris,” she said quietly. The roof tiles were slick with a late evening rain. Tallyclimbed carefully to the corner of the dorm where it wasbrushed by an old sycamore tree. The handholds in itsbranches felt solid and familiar, and she descended quicklyinto the darkness behind a recycler. When she’d cleared the dormitory grounds, Tallylooked back. The pattern of shadows that led away from thedorm seemed so convenient, almost intentional. As if uglieswere supposed to sneak out every once in a while. Tally shook her head. She was starting to think likeShay. They met at the dam, where the river split in two to encircleNew Pretty Town. Tonight, there weren’t any river skimmersout to disturb the darkness, and Shay was practicingmoves on her board when Tally walked up. “Should you be doing that here in town?” Tally calledover the roar of water rushing through the dam’s gates. Shay danced, shifting her weight back and forth on thefloating board, dodging imaginary obstacles. “I was justmaking sure it worked. In case you were worried.” Tally looked at her own board. Shay had tricked thesafety governor so it wouldn’t tattle when they flew at night,or crossed the boundary out of town. Tally wasn’t so muchworried about it squealing on them as whether it would flyat all. Or let her fly into a tree. But Shay’s board seemed tobe hovering just fine. “I boarded all the way here, and nobody’s come to getme,” Shay said. Tally dropped her board to the ground. “Thanks formaking sure. I didn’t mean to be so wimpy about this.” “You weren’t.” “Yeah, I was. I should tell you something. That night,54 Scott Westerfeldwhen you met me, I kind of promised my friend Peris Iwouldn’t take any big risks. You know, in case I really gotin trouble, and they got really mad.” “Who cares if they get mad? You’re almost sixteen.” “But what if they get mad enough that they won’t makeme pretty?” Shay stopped bouncing. “I’ve never heard of that happening.” “I guess I haven’t either. But maybe they wouldn’t tell usif it had. Anyway, Peris made me promise to take it easy.” “Tally, do you think maybe he just said that so youwouldn’t come around again?” “Huh?” “Maybe he made you promise to take it easy so youwouldn’t bother him anymore. To make you afraid to go toNew Pretty Town again.” Tally tried to answer, but her throat was dry. “Listen, if you don’t want to come, that’s fine,” Shaysaid. “I mean it, Squint. But we’re not going to get caught. And if we do, I’ll take the blame.” She laughed. “I’ll tellthem I kidnapped you.” Tally stepped onto her board and snapped her fingers. When she reached Shay’s eye level she said, “I’m coming. Isaid I would.” Shay smiled and took Tally’s hand for a second, squeezing. “Great. It’s going to be fun. Not new pretty fun—thereal kind. Put these on.” UGLIES 55“What are they? Night vision?” “Nope. Goggles. You’re going to love the white water.” They hit the rapids ten minutes later. Tally had lived her whole life within sight of the river. Slow-moving and dignified, it defined the city, marking theboundary between worlds. But she’d never realized that afew kilometers upstream from the dam, the stately band ofsilver became a snarling monster. The churning water really was white. It crashed overrocks and through narrow channels, catapulted up intomoonlit sprays, split apart, rejoined, and dropped downinto boiling cauldrons at the bottom of steep falls. Shay was skimming just above the torrent, so low thatshe lifted a wake every time she banked. Tally followed atwhat she guessed was a safe distance, hoping her trickedupboard was still reluctant to crash into the darknesscloakedrocks and tree branches. The forest to either sidewas a black void full of wild and ancient trees, nothing likethe generic carbon-dioxide suckers that decorated the city. The moonlit clouds above glowed through their brancheslike a ceiling of pearl. Every time Shay screamed, Tally knew she was about tofollow her friend through a wall of spray leaping up fromthe maelstrom. Some shone like white lace curtains in themoonlight, but others struck unexpectedly from the darkness. Tally also found herself crashing through the arcs of56 Scott Westerfeldcold water rising from Shay’s board when it dipped orbanked, but at least she knew when a turn was coming. The first few minutes were sheer terror, her teethclenched so hard that her jaw ached, her toes curled upinside her special new grippy shoes, her arms and even fingersspread wide for balance. But gradually Tally grewaccustomed to the darkness, the roar of water below, theunexpected slap of cold spray against her face. It waswilder, and faster, and farther than she’d ever flown before. The river wound into the dark forest, cutting its serpentineroute into the unknown. Finally, Shay waved her hands and pulled up, the backof her board dipping low into the water. Tally climbed toavoid the wake, spinning her board in a tight circle to bringit to a smooth halt. “Are we there?” “Not quite. But look.” Shay pointed back the waythey’d come. Tally gasped as she took in the view. The distant citywas a bright coin nestled in darkness, the fireworks of NewPretty Town the barest cold-blue shimmer. They must haveclimbed a long way up; Tally could see patches of moonlightrolling slowly across the low hills around the city,pushed along by the light wind that barely tugged at theclouds. She’d never been beyond the city limits at night, hadnever seen it lit up like this from afar. UGLIES 57Tally pulled off her spattered goggles and took a deepbreath. The air was full of sharp smells, evergreen sap andwildflowers, the electric smell of churning water. “Nice, huh?” “Yeah,” Tally panted. “Much better than sneakingaround New Pretty Town.” Shay grinned happily. “I’m really glad you think so. I’vebeen wanting to come out here so bad, but not alone. Youknow?” Tally looked at the surrounding forest, trying to peerinto the black spaces between the trees. This was really thewild, where anything could be hidden, not a place forhuman beings. She shivered at the thought of being therealone. “Where to now?” “Now we walk.” “Walk?” Shay eased her board to the shore and stepped off. “Yeah, there’s a vein of iron about half a kilometer that way. But nothing between here and there.” “What are you talking about?” “Tally, hoverboards work on magnetic levitation, right? So there’s got to be some kind of metal around or they don’thover.” “I guess so. But in town—” “In town, there’s a steel grid built into the ground, nomatter where you go. Out here, you have to be careful.” “What happens if your board can’t hover anymore?” 58 Scott Westerfeld“It falls down. And your crash bracelets don’t workeither.” “Oh.” Tally stepped from her board and held it underone arm. All her muscles were sore from the wild ride here. It was good to be on solid ground. The rocks felt reassuringlythe-opposite-of-hovery under her shakey legs. After a few minutes’ walking, though, the board startedto grow heavy. By the time the noise of the river had fadedto a dull roar behind them, it felt like a plank of oak underher arm. “I didn’t know these things weighed so much.” “Yeah, this is what a board weighs when it’s not hovering. Out here, you find out that the city fools you abouthow things really work.” The sky was getting cloudier, and in the darkness thecold seemed more intense. Tally hoisted the board up to geta better grip, wondering if it was going to rain. She wasalready wet enough from the rapids. “I kind of like beingfooled about some things.” After a long scramble through the rocks, Shay broke thesilence. “This way. There’s a natural vein of iron underground. You can feel it in your crash bracelets.” Tally held out one hand and frowned, unconvinced. But after another minute she felt a faint tugging in herbracelet, like a ghost pulling her forward. Her board startedto lighten, and soon she and Shay had hopped on again,UGLIES 59coasting over a ridge and down into a dark valley. Onboard, Tally found the breath to ask a question thathad been bugging her. “So if hoverboards need metal, howdo they work on the river?” “Panning for gold.” “What?” “Rivers come from springs, which come from insidemountains. The water brings up minerals from inside theearth. So there’s always metals at the bottom of rivers.” “Right. Like when people used to pan for gold?” “Yeah, exactly. But, actually, boards prefer iron. All thatglitters is not hovery.” Tally frowned. Shay sometimes talked in a mysteriousway, like she was quoting the lyrics of some band no oneelse listened to. She almost asked, but Shay came to a sudden halt andpointed downward. The clouds were breaking, and moonlight shot throughthem to fall across the floor of the valley. Hulking towersrose up, casting jagged shadows, their human-made shapesobvious against the plain of treetops rippling in the wind. The Rusty Ruins.","sourceLink":"http://novel.tingroom.com/jingdian/1847/53540.html","bookId":974,"book":{"id":974,"title":"Uglies 丑人儿","description":"简介： 2005年，Scott发表了作品《丑人儿》(Uglies)。作品虚构了一个表面繁华美丽的New Pretty Town，这里的人们全都优雅美丽，生活富足快乐，过着无忧无虑的生活。所有的青少年只需在年满16岁时接受一次全身整容手术，即可拥有明星般的外貌和美好的生活。在这一看似充满诱惑力...","cover":"http://novel.tingroom.com/file/upload/201708/01/15-55-12-46-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1847","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
