{"id":29452,"no":6,"title":"CHAPTER V THE GARDEN OF THE REPUBLIC","content":"The second city in Argentina is Rosario de Santa Fé. It is the Chicago of Argentina, for it is the chief wheat market, and is about as far inland as Pittsburg. It is connected with Buenos Aires by two branches of the Central Railway, as well as river communication. Rosario is to a great extent a replica of the national capital on a much smaller scale. The streets all cross each other at right angles. One-storied buildings predominate everywhere, and I do not believe that there is a structure which exceeds three stories in the city. Even in the business section one story is the general rule. In the way of municipal improvement Rosario is up to date, and contains all the advantages of the metropolis except population. There are a number of plazas after the usual style, and a beautiful park adorns one section of the city. Electric light and cars serve the entire city, so that in physical comforts Rosario[100] is not behind similar cities in Europe, or North America. There is quite a considerable foreign colony and each one boasts its club where the members can meet, eat, drink and be merry. Although Rosario is almost two centuries old, it was an obscure little village up to a generation ago. In the past ten years it has doubled its population. As a commercial centre Rosario is of great importance. Tapping the greater portion of the rich provinces of Cordoba and Santa Fé, it receives enormous quantities of wheat and other cereals as well as live stock. It is accessible to ocean-going steamers, and hundreds of vessels leave it each year loaded with food for the millions of Europe. The Paraná River at this point is nearly a mile wide, and is an imposing, if not beautiful, stream of water. The river has cut its channel down into the soil to such a depth that the bluffs upon which Rosario is built stand about sixty feet high. Warehouses line these bluffs, and the wheat is transferred to the waiting vessels below by gravity. Each warehouse has a long chute running down to the river bank through which the grain is poured. It has been bagged on the estancias and is shipped in the same bags to Europe. As[101] soon as a bag touches the chute it speeds down the inclined plane into the waiting vessel. The bags follow one another in quick succession. At harvest time the wheat often becomes congested at this port. Large port works have been constructed so that the docks have accommodation for a goodly number of boats, although not comparing at all with Buenos Aires in extent. From here the river lines carry passengers up and down the Paraná for hundreds of miles, and then they branch off to the Paraguay and Alta Paraná. Quite a network of railway lines also converge at Rosario, and altogether it is a hustling and busy place. The large and rich province of Santa Fé is second in importance only to that of Buenos Aires. It is long and narrow, being several hundred miles in length from its northern to its southern boundary, and is almost as large as England. The capital of the province is the city of Santa Fé. For a long time this little city was an unimportant place, even though it was the provincial capital. To-day it is, after almost three hundred and fifty years of existence, a place of about twenty-five thousand inhabitants. It is proposed to deepen the channel[102] so that ocean-going steamers can reach this port, but this project will not be done before “to-morrow.” The northern part of this province partakes of the character of the Chaco and is undeveloped. At least three-fourths of the state, however, is rich land, well suited for the cultivation of cereals, which form the principal product, and have contributed most to the wealth. There is usually sufficient rain in this province, but its nearness to the Chaco makes it subject to a visitation which is almost equal in its destructive qualities to that of the drouth. The farmer everywhere thinks that he has his full share of troubles. But the American farmer has never had to contend with the locusts to the extent that frequently befalls the Argentinian. One who has never seen a plague of locusts can scarcely appreciate the troubles undergone by Pharaoh when the clouds of locusts appeared as a punishment for his disobedience. The farmer in Argentina, however, can heartily sympathize with the Egyptian king, and, like him, would be willing to do or promise almost anything to secure relief from this enemy to his peace and prosperity. During the past season these abominable insects[103] destroyed millions of dollars’ worth of grain in that republic, and roused the people to greater efforts than ever to find some means of exterminating them. In travelling across the country last winter, which is their summer, I saw thousands of acres of corn absolutely stripped of all the leaves, and millions upon millions of the winged locusts were visible from the train, so thick in places as to almost cast a shadow. The locust is blessed, or cursed, with a voracious and unquenchable appetite. This appetite is perhaps equalled in extent only by the hatred with which it is regarded by the farmer. Prior to 1905 Argentina had not had a scourge of locusts for several years, but since that time they have come almost every year. The first intimation of their approach is usually in October, when a few flying locusts will appear coming from the north. These seem to be the advance guard, for in a few days they are followed by increasing hordes, until the clouds of insects are so thick that they obscure the sun like passing clouds. Although these locusts are so numerous they do not do so much damage, as they are migrating and do not stay in one place long. A farmer may wake up some nice[104] morning and find his beautiful shade trees stripped almost bare by the locusts that have alighted during the night. But in a day or two these will be gone, although others may follow. Future trouble has been laid up for him, however, for eggs have been laid by the millions. These are usually deposited in a small hole which has been bored down in a bare space of ground. With the advent of the young locusts about six weeks later the real troubles of the farmer have begun, and matters begin to wear a serious aspect. The little gaudy-coloured creatures, with their yellow, green and black bodies and red legs, are shaped very much like grasshoppers. They cannot yet fly, and for that reason remain as the guests of the landowner for several weeks while they are awaiting their final development. They pass slowly along, jumping in grasshopper fashion from stem to stem, or leaf to leaf. They cling in clusters to each leaf and stem like a devouring army, and stay there until it is absolutely bare. The extent of the damage which they are able to inflict can be seen by inspecting a corn field after their visit. The transformation is as marvellous as it is tragic. Every shred of the rich, luxuriant[105] leaves and tassels has disappeared, and only the thin, bare stalks, shivering and desolate, remain. Even the houses will be invaded by these unpleasant creatures (beasts, the Englishman would say), and to say that they are unwelcome but mildly expresses the real feeling of the farmer who sees the fruit of his toil thus disappearing before the hordes with insatiable appetites. The only vegetable growth that will not be touched, except as a last resort, is the Paraiso tree. They will eat everything else first, and only fall back upon the leaves and bark of this tree when all other food has failed. In about six weeks the wings have developed and the “hoppers” become “fliers.” Their bodies have waxed fatter, but their colouring has become sobered. Then flights will again become noticeable. A swarm will sometimes resemble a vast smoke-cloud from a burning city or straw stack. They will oftentimes settle on the boughs of limbs in such quantities as to cause the limbs to bend and crack beneath their weight. Carriages, trucks and the fronts of locomotives will be thickly coated with the fragments of the bodies of the insects, which they have killed. In such armies, where numbers are[106] countless, casualties go for nothing. A trifling loss of a few thousand or a few millions is only a drop in the ocean. You might as well try to stop a cloud passing across the sky by shooting at it as a swarm of these insects. One newspaper account, which I saw, reported: “The north and centre of Entre Rios are simply covered with locusts both in the hopper and flying stages. The city of Paraná was invaded by a swarm calculated to be nine miles in front and several miles in depth, and so thick that the sun was partially obscured. Other cities are hurriedly being enclosed with screens in order to keep the locusts at bay. In places they have completely devastated the vineyards, orchards and maize. In many places a cry of desperation is heard. In the province of Santa Fé swarms of fliers passed Santa Isabel bearing east; enormous swarms passed General Lopez proceeding west; Monte Vera reports the passage of fliers towards the north and south. The work of destruction goes on successfully. To-day between Zarate, Pilar and Campa?a were destroyed sixty-eight thousand kilos (more than seventy-four tons) of saltona (hoppers).” The farmer is in a quandary what to do. If he had only a hundred acres to look after[107] it would not be so difficult, but none of them have fewer than thousands of acres. How to secure the labour to drive these locusts is a difficult problem. The government has passed laws requiring each landowner to maintain men to fight the locusts, on the basis of about one to each thousand acres. If this is not done the owner is fined. The general method is to dig pitfalls three or four feet deep, the outer edge of which is protected by overlapping sheets of corrugated iron. These traps run out for some distance. The locusts, while still in the hopping stage, are driven towards this trap until these pits are oftentimes nearly filled up with their bodies. They are then covered up with a coating of earth, and they die very quickly. If this work is thoroughly done it is quite efficacious, but it is oftentimes difficult to get sufficient labour, for it is unpleasant work because of the nauseating odour from the bodies of the crushed locusts. Unless the work is systematically and thoroughly done, however, it does not have much effect, for a few millions will not be missed. If one man does his work well, and his neighbour is indifferent to his duty, then his work is for naught, as they will soon swarm[108] over his land again from his neighbour’s fields. United effort alone is efficacious, and that is what the government is endeavouring to either induce or compel the people to do. It has a commission at work studying this and other insect pests, and the best way to exterminate them. The source of these insects is not positively known. They come from the north, in what is known as the Chaco, which is a vast wilderness little known, and covering tens of thousands of square miles. Some think that they come from the state of Matto Grosso, in Brazil, which is an empire in itself just north of the Chaco. Accurate knowledge of the location of their hatcheries is yet wanting. The insect is fortunate in having chosen the wild and unexplored portion of the country for its home. The wisest and surest method of getting rid of these locusts, in my opinion, would be to search out this place and destroy them there. In that way it might be possible within a very few years to absolutely rid the country from this scourge of locusts as it is to-day. AMONG THE HILLS OF CORDOBA No one knows any good purpose that the locust serves unless a chastening against pride and vain glory. They are relished by the ostriches and poultry, who devour them greedily.[109] Chickens will enjoy a hearty meal upon them, but the result is that the eggs are ruined for edible purposes. The interior becomes dark, almost a wine colour, and they are given a fishy flavour, which is altogether unpalatable. Thus the malice of the locust towards man holds fast even in death, and makes him useless as food for the fowls which frequent every barn-yard. It is little wonder that the far-reaching cry comes up from Argentina for help and deliverance from this awful pest. Adjoining Santa Fé on the west is the still larger province of Cordoba. The eastern part of this province is level, but the surface begins to rise and is broken here and there by ridges and hills. During the summer season many seek the hills of Cordoba to escape the heat of the summer. There is a fine train service from Buenos Aires to Cordoba. This city is about two hundred and forty-six miles beyond Rosario. The Central Argentine runs through trains and makes the trip in about sixteen hours. The railway reaches the hills quite a while before the city of Cordoba is sighted, and there are a couple of little branches that run to Alta Gracia and Rio Segundo respectively, each of which boasts a summer[110] colony. The former is quite noted as a health resort. The city of Cordoba is the capital of the province of the same name, and one of the most important commercial towns of the republic. It is situated at an elevation of fourteen hundred feet and has a population of almost fifty thousand. It lies in a hollow, and can hardly be seen by the incoming traveller until almost upon the town itself. The woods and hills, with the Rio Primero (first river), in the foreground, make a very pretty picture. Cordoba has always been noted for its university, which was granting learned degrees long before our own universities were even thought of; and it has been granting them continuously ever since. It is also a strong centre of Catholicism, and has more priests in proportion to the population than any other city of Argentina. The public buildings are all very creditable, of which the University, Cathedral, National College, Normal School and government buildings are the principal. There is quite a noted observatory located on a nearby height, which is under the control of the national government. Its first director was a North American. The work accomplished by this observatory has received[111] high praise from both Europe and America, and has aided much in the work of studying the southern heavens. There are several pretty squares and promenades. The many hotels are filled with a well dressed crowd of people in summer, and much of the fashion of the capital is transferred to this place for a few weeks. From Cordoba the Cordoba Central Railway conveys the traveller through a not very thickly settled country and across some salty marshes to the fair city of Tucuman, which is situated in what is called the garden spot of the republic. This city is about the same elevation and has about the same temperature as Cordoba. “Have you seen Tucuman?” is a question usually asked of the foreigner, for the Argentinians look upon this city and district with a pardonable pride. Here is the effusive description of a native writer, who becomes poetic in dwelling upon the beauties of this favoured city. “O Tucuman! thou the most beautiful among thy sisters, all hail to thee! Whether I contemplate the level plain or lift up my eyes to the lofty mountains encircling thee on the side of the Circola Massimo or the Occaso, my[112] soul is thrilled with delight and admiration. Nature, who has been somewhat niggardly to thy companions, has lavished her gifts on thee, her favoured one, because thou wert beautiful and beloved! To thee she has given the vast plain of the Pampa, and bounded it with a semicircle of hills so as to welcome the Alisian winds, that in return for thy hospitality, enrich thee with the life-giving elements gathered in their wanderings over numberless Alpine heights, and fraternize with thy river, called by thee the Fondo, but changing its name over and over again, according to the caprice of the friendly lands whose bosoms it fertilizes. And if the sun shines on thee with burning rays, his heat is tempered by the moisture dropping from the clouds as they are rent by electricity, with sudden explosion, or prolonged thunder. “Hence thy soil is verdant in the winter, and in spring is adorned with innumerable flowers—a treasure-house of exotics—giving place one to the other for thy embellishment during half the year; and in the summer and autumn thou gatherest abundantly the fruits of a few growths.” The city is laid out in the usual checkerboard[113] fashion, with extremely narrow streets. In a public hall here the declaration of independence was signed on the 9th of July, 1816. There are a number of large churches, a cathedral and several schools. The spiritual welfare of the people is not neglected through lack of opportunity to attend service. There is a public library, a theatre, etc. It is an ancient town, having been founded in what was then a remote district, in 1585. It is in sight of some very high peaks of the Andes, although a considerable distance away. Tucuman is in the centre of a rich sugar district, there being about thirty sugar factories at work. Almost one hundred thousand tons of sugar have been produced in a single year, in addition to large quantities of alcohol. Rice growing is also quite a feature of this district. The soil is carefully cultivated and irrigation is resorted to by many of the planters, for an abundance of water is easily obtained. The climate is what might be termed semi-tropical. Tucuman is the last city of any size or great importance in the northwestern provinces. North of Tucuman are the provinces of Salta and Jujuy, both of which reach to the borders of Bolivia. To the west of Tucuman lie the[114] provinces of Rioja and Catamarca, as well as the territory of Los Andes, all of which border Chile. These are all mountainous states, but they are neither small nor unimportant. The smallest one is as large as Massachusetts, Rhode Island and Maryland, and the largest one, Salta, is nearly as large as all of New England. The altitude of the towns varies from Rioja, the capital of the province of the same name, at an altitude of only seventeen hundred feet, to Jujuy, capital of that province, which lies four thousand two hundred and seventy feet above sea level, and is the highest city in the republic. Jujuy is distant just about one thousand miles from Buenos Aires by railroad, and is at the foot of the spurs of the range of mountains that reach up into Bolivia. Although so near the Tropic of Capricorn yet the elevation prevents the extreme heat that prevails in the lowlands during the summer, while the freezing point is never reached in winter. The scenery in the neighbourhood of this city is really beautiful, for hill and valley, wood and plain all contribute to make up an enchanting landscape. When the connection with the Bolivian railway is completed this city will be on another transcontinental line from[115] the Atlantic to the Pacific. The territory of Los Andes, in the extreme northwestern corner of the country, is the most mountainous section and is very little known. The provinces of Cordoba and Santa Fé are the home of many beautiful birds. One of the most gorgeous of humming-birds is to be found here. Its body is green streaked with gold, with a vivid scarlet tail. A common song bird is the bien te veo (I see you well), so named because its song is supposed to represent those words. The call, which is an extremely musical one, is repeated over and over again. It is brightly coloured and is a species of thrush. The oven-bird is a favourite bird and is looked upon much as the robin with us. It is chiefly remarkable for its nest, which is built of mud and is entered by a doorway. The nests are usually built upon any convenient post, and in places one will find half of the telephone and telegraph posts surmounted by one of these nests. It is a common saying that the oven-bird will not, under any consideration, build its nest on a Sunday. There are many birds of the vulture tribe in Argentina. Patagonia is especially a wonderful country for these birds of prey. Of these[116] the chinango is a small carrion-hawk of a brown-gray colour. Another is the carancho, which is very common throughout the Camp. This bird is a dark brown with a light band across the wings. These two birds prefer carrion, but will attack enfeebled and helpless small animals such as hares or lambs. “Next comes the condor, awful bird, On the mountains’ highest tops, Has been known to eat up boys and girls And then to lick its chops.” Thus runs the nursery rhyme about the chief of the larger army of the vulture tribe, which is common in the states adjacent to the Andes. Seen against the pale blue of the sky, swerving in graceful circles at a great height amidst the inner solitudes of the Andine peaks, its stately flight and grand spread of motionless wing make it seem like a noble bird. On a nearer view it shares the repulsive appearance of all birds that feed on dead animal flesh. Eagles are scarce in the Andes, and the condors take their place. They are difficult to approach unless they are gorged so that they cannot fly. Their size is enormous. One writer tells of killing one in Patagonia that measured nine[117] feet, three inches across the outstretched pinions, and some of even greater size are reported. They are sometimes four feet long from tip of beak to tail. They hatch their young amid the snow-covered crags at an altitude of twenty thousand feet, so it is said, for they can endure a temperature which renders human existence impossible. These birds, which fly so high that they become mere specks on the intense blue of the skies, exceed the vulture in their ability to discover a dead carcass. It has been said that they will follow a mule train a long distance waiting for a disabled animal to be left behind. If a sick animal, large or small, is found they will immediately pluck out the eyes, and then wait for the animal to die before eating it. They fly so high that it is impossible to shoot them, and the only way to kill the condor is to place a dead animal as a decoy and then lay in ambush until the birds appear. It is one thing to admire these birds wheeling in graceful circles on quiescent wing, but it would be quite another for the lonely and helpless traveller out among the hills where no help was near. Long before aid could come this powerful and unscrupulous bird might discover the helpless[118] one. These gigantic birds have been tamed when captured at a sufficiently early age. Some have found them interesting pets, but their immense size soon makes their presence very undesirable around the house and farmyard. Argentina is undoubtedly rich in mineral deposits which have as yet scarcely been touched. All along the Andes, from Bolivia, herself extremely rich in the precious metals, to Tierra del Fuego, traces of silver, gold and copper have been found. The indifference to the exploitation of this mineral wealth may be due to the lack of available capital, the difficulties of transportation of the ore and the scarcity of fuel in the mineral zones of the country. The exports of all minerals do not reach half a million dollars yearly, of which copper is one of the principal items. The early history of the country records a story of marvellous wealth dug from the earth. The future may have a still greater story to tell. The workings of many of these earlier mines have been absolutely lost. The locations of mines from which fabulous wealth was wrung are unknown to-day. Some of these mines date back to the early conquerors, and others to the Incas themselves, who overran this section of the country.[119] Ancient bronze instruments of that race have been found here, giving indisputable evidence of that fact, although it is doubtful if they ever had a permanent abode in these mountains. The Indians used to bring tributes of gold to the priests, but would not reveal the site of the hidden mines. The principal mines of Argentina, that are being worked to-day, are in the provinces of Rioja and Catamarca, in the northwestern part of the republic, and in Mendoza. The most important are undoubtedly the Famatima copper mines of Rioja. The government has recently constructed a wonderful aerial wire ropeway here which is really a marvel and has greatly aided in transporting the metals. The main ropeway is nearly twenty-five miles in length, with its highest terminal nearly fourteen thousand feet above sea level. Power is available for control and to assist the upward traffic. One span of this wonderful ropeway is half a mile in length where it cuts across a deep valley. Argentina possesses some fine marble quarries and their production has been gradually increasing. The production of gold and silver is comparatively small. Within the past year[120] petroleum has been found near Mendoza, and a number of good wells have been sunk. If this valuable oil can be found in large quantities it will go a long ways toward solving the problem of cheaper fuel. Nearly three million tons of coal are imported annually to supply the need of fuel. Nearly all of this coal is imported from England, the shipments from the United States in 1909 being only a few thousand tons, but petroleum products are nearly all imported from North America. The value of the products of the mines of Argentina will average nearly a million dollars a year. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3330/91171.html","bookId":377,"book":{"id":377,"title":"Argentina and Her People of To-day","description":"简介： The Spaniards who first visited the coast of Argentina, and sailed up the broad and imposing river that empties into the Atlantic Ocean, were so impressed with the outlook and prospects, that they named the country Argentina, which means silvery or s...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3330","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
