{"id":5414,"no":12,"title":"Chapter 12","content":"WIDE, frantic wings were beating on either side of him, and even in that desperate moment he realized that he must have grasped the flying monster at the instant it struck the aeroplane. Doubtless much against its will, it was now carrying him along as an equally unwilling passenger. As a matter of fact, he was clinging to its fur and the skin of its breast, which was fortunately very loose, affording an excellent handhold. But Mr. Jones was no acrobat, although he was certainly playing the part of one. Already his hands were numb and aching. He wondered if he could manage to climb around and up to the creature’s back, but gave it up as a feat too great for his weakening muscles. Suddenly he found himself laughing wildly. He had remembered the story of Sindbad and the Roc, which had carried him into the Valley of Diamonds. But the Roc bore the sailor in its claws, and this creature was not half so obliging. Looking downward, Jones was sure that they were far higher than when the beast had struck them. He should, even swinging so dizzily through the air, have caught a glimpse of light where the fire must still be blazing by the cliff, or perhaps, if they were very high, the lights of the other encampment outside the wall. But all beneath was a black void, under what seemed a swirling, dancing firmament of stars. Then, sick and giddy, the moment came when Jones knew he must shortly let go his grip upon skin and fur and whirl down, breathless, helpless, into the waiting arms of death. Suddenly he began to kick violently, and swing his body from side to side. If he went he was determined that his involuntary captor should go with him. Came a harsh scream from above, a few mad circles, and then, though the wings still beat, he knew that they were dropping with dangerous speed through the empty blackness of space. The fall, however, ended a great deal sooner than Jones anticipated, and not upon the earth but in the sea. There was one terrific splash, as beast and man struck the water. Mr. Jones, being of course underneath, had decidedly the worst of the dive. In the first place he had expected to be hurled into the maw of a death-cabbage, perhaps, or to be dashed to pieces upon the earth, or, if he were lucky, that they might break their fall upon the crest of one of the tall, slender palms. The one thing which he did not anticipate was to be plunged into a cold bath. His mouth was open, and his lungs nearly empty of air when it happened, and the consequence was that he nearly drowned before recovered sufficient sense to let go of the fur to which he was still clinging with the tenacity of the dying. Even then it was more by good luck than presence of mind that he reached the surface, for all the water was in a whirl with the flapping struggles of the creature which had brought him there. Fortunately, although evidently it could not swim, its convulsive efforts pushed it along, so that Jones came up at last a few feet clear of the worst of the turmoil. The sea was running in long, smooth, oily swells, nearly as kind as quiet water to the gasping swimmer. He cleared his lungs, then turned on his back and floated, drawing in the air in huge draughts. As his blood became reoxygenated, he began to feel a certain curiosity. What had become of the enemy? Turning again he swam slowly and quietly, reserving his strength, and looking anxiously about from the top of each swell as it came under him. The sea, which was free that night from the phosphorescence that often characterizes those waters, reflected very little light, from the stars. He could see nothing — no land, no monster — nothing but the stars above and beneath — blackness. He felt as if he had been dropped into a sea of India ink, a sea where no man or beast had ever come or sun shone upon. Then he remembered the possibility of sharks and hoped devoutly that no company of that sort would arrive. His clothes dragged him down, and he determined to be rid of them, at least. He kicked off his shoes and at last, by working carefully, got rid of his khaki tunic. The puttees were hardest to deal with, but he finally got them off, followed them with his breeches, and even shed the thin, loosefitting silk underwear, as a last slight impediment to what he intended to be a fight to the finish for life and the chance to get back and finish his voluntary job of helping Sergius, or find and bury his remains. The latter contingency seemed the more likely one. The water was warm, the slow, even swells friendly, and Mr. Jones felt sure that he could keep afloat till dawn, which could not now be far off. What he would do then depended upon circumstances, but he did not really believe the flying monster could have carried him far out to sea, and he hoped that when day broke he would see Joker Island within easy swimming distance. Until then it would be dangerous to strike out, perhaps in the wrong direction, so he floated a great deal, only swimming enough to keep his blood in circulation. In one of the periods when he was on his back, his ears in consequence being under water, there reached them a peculiar, vibratory, explosive sound. He had heard it before, while floating in the quiet reaches of Long Island Sound, and with a great rush of hope Jones turned over and trod water raising himself as far as he could above the surface and staring from right to left through the blind veil of night. Nothing. He turned himself slowly, waiting for the rise of each successive swell to look long. Then he gave a wild shout and letting himself drop back struck out with frantic strokes. Very small, very far away, he had seen two lights which were not stars, for one was red and one was green. Had his mood of exultation lasted long he must have perished even on the threshold of salvation, for such a pace as he had set himself would have exhausted the most expert swimmer. Fortunately common sense returned in time, and he realized that since he saw both the red and the green it must mean but one thing. The vessel, whatever it was, was approaching him, probably at a far greater speed than he could possibly attain even if he could have kept it up. He “loafed” again, rising on each swell with the deadly fear that this time one of the lights would have disappeared, sinking again into the trough with the blissful assurance that both lights still shone. There is nothing much harder than to estimate distance at night across water. Knowing this from his own yachting experience, Jones floated several times, listening for the engine beat which the sea carried so much farther than the wind. And each time he fancied that it was louder, more distinct. At last he raised himself again upon the crest of a swell and sent a long, anxious hail across the waste. To his inexpressible joy it was immediately answered. Ten minutes later Mr. Roland C. Jones was picked up out of the watery vastness of the Pacific Ocean by his own power cruiser, the Bandersnatch, which had for three days been cross-quartering those waters in the vain, despairing hope of picking up some trace of him or his body.","sourceLink":"http://novel.tingroom.com/kehuan/1119/33349.html","bookId":176,"book":{"id":176,"title":"Nightmare","description":"简介： Gertrude BarrowsBennett (1883-1948) was the first major female writer of fantasy andscience fiction in the United States, publishing her stories under thepseudonym Francis Stevens. She completed school through the eighth gradethen attended night scho...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1119","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
