{"id":5416,"no":14,"title":"Chapter 14","content":"THREE months had elapsed, and Mr. Roland C. Jones remained, to all appearances, a well and mentally sound man. Back in New York he quietly resumed the peaceful pursuits of his easy-going, pleasant, bachelor life. Laroux and Martindale adhered strictly and honorably to their promise and never mentioned to any one the singular delusion which had marked the termination of their friend’s illness. Indeed, they themselves had practically forgotten it, thinking of it only as the overheard ravings of a sick man, not to be regarded as indicating mental unbalance since the man had regained his health. \n \n Mr. Jones’s first act on reaching New York had been to consult an eminent specialist in diseases of the brain, and have himself examined for insanity. The report was reassuring. Whatever he might have been in the past, this worthy physician declared him, to be now free from any taint of the disorder he so feared. \n \n Jones went to the theater, danced, golfed and made brief cruises in the early spring, but an invitation to a flying meet was instantly and firmly declined. He never wished to see another aeroplane in his life. In fact, he did all that a man could to banish from his memory that dream which he had dreamed while cast upon the barren beach of an unnamed — absolutely an unnamed — rock in the Pacific. \n \n If in visions of the night man-eating vegetables writhed their flaming tentacles, or strange yet familiar faces smiled or frowned upon him, he at least never spoke of the matter to any one. \n \n So the three months had drifted by, and it was the latter end of March. One morning Jones slept later than usual — he never was an early riser — and when he sat up in bed, yawning, his window was a gray expanse against which sleet drove with a continual desolate rattling. \n \n “Darn!” exclaimed Mr. Jones, at the end of his stretch. “Another day of ‘indoor sports,’ I see. How I hate a sleet storm! Philip!” he called. \n \n Instantly his English man servant, an elderly but intensely efficient individual, appeared bearing coffee, newspapers, and the mail. \n \n “You can get my bath ready. Now, let’s see. Who’s going to be married, and who desires the extreme boredom of my company — hello, I wonder what this can be — ” \n \n “This” was a small flat package, wrapped in white paper and addressed to himself in a small, perfect hand. Unlike a woman, he did not pause to contemplate its exterior, but untied the string immediately. Within the paper was a white pasteboard box, and inside that another box of Morocco leather, unquestionably a jewel case of some sort. He pressed the catch and it snapped open. What-in-the-world — The whole room seemed to reel and sway about him dizzily. It vanished, and before him stretched a little glade all dark save where two white beams of light flashed and danced. Sergius — Miss Weston — the aeroplane — the flying monster! Was this some cruel joke that his friends had perpetrated against him. \n \n For within the box, upon a bed of white velvet, rested an exquisite affair of gold, encrusted with blue-white diamonds. It was a tiny aeroplane, and enmeshed with it, its wings and the plane’s interlocked, was a golden bat, with two tiny rubies for eyes. \n \n Who had sent him this thing? Who had been so cruel as to taunt him with such a reminder of his time of madness? He raised box and jewel in his hand and was about to hurl it across the room when his eyes fell upon one of the letters scattered before him on the counterpane. The writing upon it was in that same small, yet distinctive hand that had appeared on the box-wrapping. \n \n Dropping the leather case Jones hastily seized the letter and ripped it open. He, read: \n \n MY DEAR FRIEND ROLAND: \n \n “Two weeks ago I read in an old newspaper of your rescue and of your return to your native city. Until that moment I— we all — believed you to have been drowned in the sea, as was the enormous bat which carried you thither. We found its body washed up upon the shore, and believe me, my friend, I wept over it for sorrow at your loss and for such an end to such an heroic deed as yours. \n \n “I know, however, that you must have been far more overcome by your terrible experience than the newspaper account indicated. You will not need to explain to me that otherwise you would have taken your yacht back to Joker Island and, if necessary, risked death in the cavern labyrinth seeking to return to aid me, if I needed aid. There are some friendships which spring into being without the need of years to build them up, and though few words were spoken, I know that ours was such a one.” \n \n “Well, the old son-of-a-gun,” murmured Jones, “and he means it, too.” The eyes he raised to Philip, coming to announce the readiness of the bath, were perceptibly wet, to that worthy Briton’s great, though unrevealed, astonishment. \n \n “Get out, Philip,” was Jones’s only reply. “I’ll bath after a while.” \n \n Alone once more he eagerly resumed his reading: \n \n “But enough of that. I am coming to New York soon — this is written from Tokio, where I have caused to be made a small remembrance which I am also mailing you — and then we can talk together. \n \n “After you had so courageously and with incredible presence of mind flung yourself upon the great bat — ” \n \n Jones grinned, remembering the actual state of his feelings in that moment. \n \n “ — and been snatched away into the air, I managed to right the plane and we went on across the wall. I did not even know that you were gone. Miss Weston tried to tell me, but you know how great is the noise in flight. We came down upon the beach and I was overcome with dismay and self-reproach when I discovered that you were missing. I could perhaps have pursued the bat and rescued you from the sea, but then it was too late. \n \n “Well, the yacht — the Monterey — was gone. I afterward learned that the traitorous and rascally Ivanovitch, believing that I had been killed or captured in the valley, and wishing to make off with the yacht which he afterward successfully sold, had deserted me early in the afternoon of the day you and I took flight. \n \n “And, of course, Laroux and Martindale had to wait until the Monterey was gone before they looked up the island,” muttered Jones. \n \n “There was nothing else to be done, so I took Miss Weston back into the valley. We arrived there a little after sunrise and found things at the cave just as we had left them. I pulled away the rocks and we applied my restorative to my brother and the rest. They were considerably annoyed at my little strategy, but Paul was, I am sorry to say, so rejoiced over the desertion of my companions that he forgave me and persuaded the rest to do so. \n \n “After making one flight in vain, I crossed the course of a tramp steamer and succeeded in dropping upon her deck a letter wrapped about a stone. It was fortunate that I succeeded, for there was barely sufficient petrol left to take me to land. The captain of the tramp, more I fear for the reward which the letter offered than for humanity, turned his vessel to the island and took us all off, together with our possessions. \n \n “I have little more to tell you, save that in the month we spent in the valley Holloway, Haskins and I (Paul never cared for hunting) killed off most of the more dangerous animals. They are a peculiar collection. Over on the eastern side we discovered a cavern, or grotto, much bigger than any which Holloway had before explored. In it — it was, of course, daytime — we found scores of those enormous bats hanging, asleep. \n \n “They are nothing but bats, although they are so big. They are fruit-eaters, subsisting upon the fruit of the palm-trees, something similar to a large date. I do not believe that it is their custom to attack other creatures, but, that they were simply actuated by curiosity. Still we thought it best to kill them, and their skins are really wonderful pieces of fur. \n \n “Two of the best are for you and also the hide and head of the bear-creature you killed. We bagged two more of them, and I think they were the last of their kind. \n \n “After we killed off the bats the death cabbages began to wither and decay, and now they, too, are all dead. It is evident that they lived almost entirely upon the bats, which they attracted by their palmlike crests. I do not think the bats could have had any sense of smell, though, do you? \n \n “And now, I come to my conclusion to a very long letter. Mr. Holloway was mistaken in regard to the quantity of the substance, of which I told you, to be found in Joker Island. We were able to obtain altogether only about a pound of it, enough to make perhaps a million rubles’ worth of what I told you it would make. \n \n “This is not sufficient for the purpose of which I spoke, so, as both Paul and myself are fairly wealthy, we agreed to divide it among our companions. The largest share was received, of course, by Holloway. We gave him our portion as a wedding present. Did I tell you that Holloway and Miss Weston were married two weeks ago here in Tokio?” \n \n For the love of Pete! Jones thought. First I thought it was Paul, and then I thought it was Sergius, only she didn’t want him to know it, and all the while it was Holloway! I’ll bet Miss Weston had Jim Haskins wondering if he wasn’t the lucky one, too. Guess I was the only one not in the running. Well — “They have, of course, my very kindest wishes for their happiness, but Paul — perhaps you knew of his hopes — he felt very badly. He has returned to Russia and is now fighting at the front, having, I fear purposely, obtained his transference to a very dangerous position. And why am I not at his side? Because, although those men with me proved traitors, such a thing would hardly turn me against the cause. And it is upon a mission for the cause that I am now about to engage, after visiting you in New York.” \n \n “Hurray!” ejaculated the reader. “Just wait until I introduce you to Messrs. Cocksure Martindale and Laroux! Oh, when will I forgive you two for the last three months?” \n \n “It is a mission of some danger, perhaps, but also I think that it might interest a man of your adventurous disposition. I will tell you more of it later. Until that moment, my friend, believe me ever and always your friend and comrade of the past, perhaps — who knows? — of the future. \n \n “SERGIUS ALEXIUS PETROFSKY \n \n It was a long letter, but Mr. Jones read it through twice. Then he laid it down carefully, picked up the little box and stared at the golden bat and aeroplane with shining eyes and exultant face. \n \n The sleet still beat upon the window, but it didn’t bother Mr. Jones, for he was far away, on a little rock-walled island in the Pacific Ocean, which did have a name after all, and a most appropriate one — Joker Island! \n \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1119/33351.html","bookId":176,"book":{"id":176,"title":"Nightmare","description":"简介： Gertrude BarrowsBennett (1883-1948) was the first major female writer of fantasy andscience fiction in the United States, publishing her stories under thepseudonym Francis Stevens. She completed school through the eighth gradethen attended night scho...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1119","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
