{"id":37010,"no":22,"title":"CHAPTER XXII. IN THE MACQUIS","content":"“Before man made us citizens, great Nature made us men.” The Abbé Susini had no money, but he was a charitable man in a hasty and impulsive way. Even the very poor may be charitable: they can think kindly of the rich. It was not the rich of whom the abbé had a friendly thought, but the foolish and the stubborn. For this fiery little priest knew more of the unwritten history of the macquis than any in Corsica—infinitely more than those whose business it was. It is the custom at Ajaccio, and in a smaller way at Bastia, to ignore the darker side of Corsican politics, and the French officials are content with the endeavour to get through their term of office with a whole skin. It is not, as in other islands of the Mediterranean, the gospel of “ma?ana” which holds good here, but rather the gospel of “So I found it—it will last my time.” So, from the préfet to the humblest gendarme, they come, they serve, and they go back rejoicing to France. They strike when absolutely forced to do so, but they commit the most fatal of all administrative errors—they strike gently. The faults are not all on one side; for the islanders are at once turbulent and sullen. There are many who “keep the country,” as the local saying is, and wander year after year in the mountain fastnesses, far above road or pathway, beyond the feeble reach of the law, rather than pay a trifling fine or bend their pride to face a week\u0027s imprisonment. In the macquis, as in better society, there are grades of evil. Some are hiding from their own pride, others are evading a lifelong sentence, while many know that if the gendarme sees them he will shoot at sight—running, standing, sleeping, as a keeper kills vermin. Only a few months ago, on a road over which many tourists must have travelled, a young man of twenty-three was “destroyed” (the official term) by the gendarmes who wanted him for eleven murders. It is commonly asserted that these bandits are not dangerous, that they have no grievance against travellers. A starving man has a grievance against the whole world, and a condemned fratricide is not likely to pick and choose his next victim if tempted by a little money and the chance of escape therewith from the island. It is, moreover, usual for a man to take to the macquis the moment that he finds himself involved in some trouble, or, it may be, merely under suspicion. From his retreat in the mountains he enters into negotiations with his lawyer, with the local magistrate, with his witnesses, even with the police. He distrusts justice itself, and only gives himself up or faces the tribunal when he has made sure of acquittal or such a sentence as his pride may swallow. Which details of justice as understood in a province of France at the beginning of the century may be read at the Assize terms in those great newspapers, Le Petit Bastiais or Le Paoli Pascal, by any who have a halfpenny to spend on literature. It would appear easy enough to exterminate the bandits as one would exterminate wolves or other large game; but in such a country as Corsica, almost devoid of roads, thinly populated, heavily wooded, the expense would be greater than the administration is prepared to incur. It would mean putting an army into the field, prepared and equipped for a long campaign which might ultimately reach the dignity of a civil war. The bandits are not worth it. The whole country is not worth exploiting. Corsica is a small open wound on the great back of France, carefully concealed and only tended spasmodically from time to time at such periods as the health of the whole frame is sufficiently good to permit of serious attention being given to so small a sore. And such times, as the wondering world knows, are few and far between in the history of France. The law-abiding natives, or such natives as the law has not found out, regard the denizens of the macquis with a tender pity not unmixed with respect. As often as not the bandit is a man with a real grievance, and the poor have a soft place in their hearts for a man with a grievance. And all Corsicans are poor. So all are for the bandits, and every man\u0027s hand is secretly or openly against the gendarme. Even in enmity, there is a certain sense of honour among these na?ve people. A man will shoot his foe in the back, but he will not betray him to the gendarme. Among a primitive people a man commands respect who has had the courage to take the law into his own hands. Amidst a subject population, he who rebels is not without honour. It was among these and such as these that the Abbé Susini sought from time to time his lost sheep. He took a certain pleasure in donning the peasant clothes that his father had worn, and in going to the mountains as his forefathers had doubtless done before him. For every man worthy of the name has lurking in his being a remnant of the barbarian which makes him revolt occasionally against the life of the city and the crowded struggle of the streets, which sends him out to the waste places of the world where God\u0027s air is at all events untainted, where he may return to the primitive way of living, to kill and gather with his own hands that which must satisfy his own hunger. The abbé had never known a very highly refined state of civilization. The barbarian was not buried very deep. To him the voice of the wind through the trees, the roar of the river, the fine, free air of the mountains had a charm which he could not put into words. He hungered for them as the exile hungers for the sight of his own home. The air of houses choked him, as sooner or later it seems to choke sailors and wanderers who have known what it is to be in the open all night, sleeping or waking beneath the stars, not by accident as an adventure, but by habit. Then the abbé would disappear for days together from Olmeta, and vanish into that mystic, silent, prowling world of the macquis. The sights he saw there, the men he met there, were among those things which the villagers said the abbé knew, but of which he never spoke. During the stirring events of August and September the priest at Olmeta, and Colonel Gilbert at Bastia, watched each, in his individual way, the effect of the news upon a very sensitive populace. The abbé stood on the high-road one night within a stone\u0027s throw of Perucca, and, looking down into the great valley, watched the flickering flames consume all that remained of the old Chateau de Vasselot. Colonel Gilbert, in his little rooms in the bastion at Bastia, knew almost as soon that the chateau was burning, and only evinced his usual easy-going surprise. The colonel always seemed to be wondering that any should have the energy to do active wrong; for virtue is more often passive, and therefore less trouble. The abbé was puzzled. “An empty house,” he muttered, “does not set itself on fire. Who has done this? and why?” For he knew every drift and current of feeling amid his turbulent flock, and the burning of the chateau of Vasselot seemed to serve no purpose, and to satisfy no revenge. There was some influence at work which the Abbé Susini did not understand. He understood well enough that a hundred grievances—a hundred unsatisfied vengeances—had suddenly been awakened by the events of the last months. The grip of France was for a moment relaxed, and all Corsica arose from its sullen sleep, not in organized revolt, but in the desire to satisfy personal quarrels—to break in one way or another the law which had made itself so dreaded. The burning of the Chateau de Vasselot might be the result of some such feeling; but the abbé thought otherwise. He went to Perucca, where all seemed quiet, though he did not actually ring the great bell and speak to the widow Andrei. A few hours later, after nightfall, he set off on foot by the road that leads to the Lancone Defile. But he did not turn to the left at the cross-roads. He went straight on instead, by the track which ultimately leads to Corte, in the middle of the island, and amidst the high mountains. This is one of the loneliest spots in all the lonely island, where men may wander for days and never see a human being. The macquis is thin here, and not considered a desirable residence. In fact, the mildest malefactor may have a whole mountain to himself without any demonstration of violence whatever. This was not the abbé\u0027s destination. He was going farther, where the ordinary traveller would fare worse, and hurried along without looking to the left or right. A half-moon was peeping through an occasional rift in those heavy clouds which precede the autumn rains in these latitudes, and gather with such astonishing slowness and deliberation. It was not a dark night, and the air was still. The abbé had mounted considerably since leaving the cross-roads. His path now entered a valley between two mountains. On either side rose a sharp slope, broken, and rendered somewhat inaccessible by boulders, which had at one time been spilled down the mountain-side by some great upheaval, and now seemed poised in patient expectance of the next disturbance. Suddenly the priest stopped, and stood rooted. A faint sound, inaudible to a townsman\u0027s ear, made him turn sharply to the right, and face the broken ground. A stone no bigger than a hazel nut had been dislodged somewhere above him, and now rolled down to his feet. The dead silence of the mountains closed over him again. There was, of course, no one in sight. “It is Susini of Olmeta,” he said, speaking quietly, as if he were in a room. There was a moment\u0027s pause, and then a man rose from behind a rock, and came silently on bare feet down to the pathway. His approach was heralded by a scent which would have roused any sporting dog to frenzy. This man was within measurable distance of the beasts of the forests. As he came into the moonlight it was perceivable that he was hatless, and that his tangled hair and beard were streaked with white. His face was apparently black, and so were his hands. He had obviously not washed himself for years. “You here,” said the abbé, recognizing one who had for years and years been spoken of as a sort of phantom, living in the summits—the life of an animal—alone. The other nodded. “Then you have heard that the gendarmes are being drafted into the army, and sent to France?” The man nodded again. He had done so long without speech that he had no doubt come to recognize its uselessness in the majority of human happenings. The abbé felt in his pocket, and gave the man a packet of tobacco. The Corsicans, unlike nearly all other races of the Mediterranean, are smokers of wooden pipes. “Thanks,” said the man, in an odd, soft voice, speaking for the first time. “I am going up into the mountains,” said the abbé, slowly, knowing no doubt that men who have lived long with Nature are slow to understand words, “to seek an old man who has recently gone there. He is travelling with a man called Jean, who has the evil eye.” “The Count de Vasselot,” said the outlaw, quietly. He touched his forehead with one finger and made a vague wandering gesture of the hand. “I have seen him. You go the wrong way. He is down there, near the entrance to the Lancone Defile with others.” He paused and looked round him with the slow and distant glance which any may perceive in the eyes of a caged wild beast. “They are all down from the mountains,” he said. Even the Abbé Susini glanced uneasily over his shoulder. These still, stony valleys were peopled by the noiseless, predatory Ishmaels of the macquis. They were, it is true, not numerous at this time, but those who had escaped the clutch of the imperial law were necessarily the most cunning and desperate. “Buon,” he said, turning to retrace his steps. “I shall go down to the Lancone Defile. God be with you, my friend.” The man gave a queer laugh. He evidently thought that the abbé expected too much. The abbé walked until midnight, and then being tired he found a quiet spot between two great rocks, and lying down slept there until morning. In the leather saddle-bag which formed his pillow he had bread and some meat, which he ate as he walked on towards the Lancone Defile. Once, soon after daylight, he paused to listen, and the sound that had faintly reached him was repeated. It was the warning whistle of the steamer, the old Persévérance, entering Bastia harbour ten miles away. He was still in the shade of the great heights that lay between him and the Eastern coast, and hurried while the day was cool. Then the sun leapt up behind the hazy summits above Biguglia. The abbé looked at his huge silver watch. It was nearly eight o\u0027clock. When he was near to the entrance of the defile he stood in the middle of the road and gave, in his high clear voice, the cry of the goat-herd calling his flock. He gave it twice, and then repeated it. If there were any in the macquis within a mile of him they could not fail to see him as he stood on the dusty road in the sunlight. He was not disappointed. In a few minutes the closely-set arbutus bushes above the road were pushed aside and a boy came out—an evil-faced youth with a loose mouth. “It is Jean of the Evil Eye who has sent me,” he said glibly, with an eye on the abbé\u0027s hands in case there should be a knife. “He is up there with a broken leg. He has with him the old man.” “The old man?” repeated the abbé, interrogatively. “Yes, he who is foolish.” “Show me the way,” said Susini. “You need not look at my hands; I have nothing in them.” They climbed the steep slope that overhung the road, forcing their way through the thick brushwood, stumbling over the chaos of stones. Quite suddenly they came upon a group of men sitting round a smouldering fire where a tin coffee-pot stood amid the ashes. One man had his leg roughly tied up in sticks. It was Jean of the Evil Eye, who looked hard at the Abbé Susini, and then turning, indicated with a nod the Count de Vasselot who sat leaning against a tree. The count recognized Susini and nodded vaguely. His face, once bleached by long confinement, was burnt to a deep red; his eyes were quite irresponsible. “He is worse,” said Jean, without lowering his voice. “Sometimes I can only keep him here by force. He thinks the whole island is looking for him—he never sleeps.” Jean was interrupted by the evil-faced boy, who had risen, and was peering down towards the gates of the defile. “There is a carriage on the road,” he said. They all listened. There were three other men whom the abbé knew by sight and reputation. One by one they rose to their feet and slowly cocked their old-fashioned single-barrelled guns. “It is the carriage from Olmeta—must be going to Perucca,” reported the boy. And at the word Perucca, the count scrambled to his feet, only to be dragged back by Jean. The old man\u0027s eyes were alight with fear and hatred. He was grasping Jean\u0027s gun. The abbé rose and peered down through the bushes. Then he turned sharply and wrenched Jean\u0027s firearm from the count\u0027s hands. “They are friends of mine,” he said. “The man who shoots will be shot by me.” All turned and looked at him. They knew the abbé and the gun. And while they looked, Denise and Mademoiselle Brun drove past in safety. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2874/79532.html","bookId":1164,"book":{"id":1164,"title":"The Isle of Unrest","description":"简介： The afternoon sun was lowering towards a heavy bank of clouds hanging still and sullen over the Mediterranean. A mistral was blowing. The last yellow rays shone fiercely upon the towering coast of Corsica, and the windows of the village of Olmeta gli...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2874","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
