{"id":64159,"no":20,"title":"Page 20","content":"ALL THAT afternoon Ransom remained alone answering Oyarsa\u0027s questions. I am not allowed to record this conversation, beyond saying that the voice concluded it with the words: \"You have shown me more wonders than are known in the whole of heaven.\" After that they discussed Ransom\u0027s own future. He was given full liberty to remain in Malacandra or to attempt the desperate voyage to Earth. The problem was agonizing to him. In the end he decided to throw in his lot with Weston and Devine. \"Love of our own kind,\" he said, \"is not the greatest of laws, but you, Oyarsa, have said it is a law. If I cannot live in Thulcandra, it is better for me not to live at all.\" \"You have chosen rightly,\" said Oyarsa. \"And I will tell you two things. My people will take all the strange weapons out of the ship, but they will give one to you. And the eldila of deep heaven will be about your ship till it reaches the air of Thulcandra, and often in it. They will not let the other two kill you.\" It had not occurred to Ransom before that this own murder might be one of the first expedients for economizing food and oxygen which would occur to Weston and Devine. He was now astonished at his obtuseness, and thanked Oyarsa for his protective measures. Then the great eldil dismissed him with these words: \"You are guilty of no evil, Ransom of Thulcandra, except a little fearfulness. For that, the journey you go on is your pain, and perhaps your cure: for you must be either mad or brave before it is ended. But I lay also a command on you; you must watch this Weston and this Devine in Thulcandra if ever you arrive there. They may yet do much evil in, and beyond, your world. From what you have told me, I begin to see that there are eldila who go down into your air, into the very stronghold of the Bent One; your world is not so fast shut as was thought in these parts of heaven. Watch those two bent ones. Be courageous. Fight them. And when you have need, some of our people will help. Maleldil will show them to you. It may even be that you and I shall meet again while you are still in the body; for it is not without the wisdom of Maleldil that we have met now and I have learned so much of your world. It seems to me that this is the beginning of more comings and goings between the heavens and the worlds and between one world and another - though not such as the Thick One hoped. I am allowed to tell you this. The year we are now in - but heavenly years are not as yours - has long been prophesied as a year of stirrings and high changes and the siege of Thulcandra may be near its end. Great things are on foot. If Maleldil does not forbid me, I will not hold aloof from them. And now, farewell.\" It was through vast crowds of all the Malacandrian species that the three human beings embarked next day on their terrible journey. Weston was pale and haggard from a night of calculations intricate enough to tax any mathematician even if his life did not hang on them. Devine was noisy, reckless and a little hysterical. His whole view of Malacandra had been altered overnight by the discovery that the \u0027natives\u0027 had an alcoholic drink, and he had even been trying to teach them to smoke. Only the pfifltriggi had made much of it. He was now consoling himself for an acute headache and the prospect of a lingering death by tormenting Weston. Neither partner was pleased to find that all weapons had been removed from the space-ship, but in other respects everything was as they wished it. At about an hour after noon Ransom took a last, long look at the blue waters, purple forest and remote green walls of the familiar handramit, and followed the other two through the manhole. Before it was closed Weston warned them that they must economize air by absolute stillness. No unnecessary movement must be made during their voyage; even talking must be prohibited. \"I shall speak only in an emergency,\" he said. \"Thank God for that, anyway,\" was Devine\u0027s last shot. Then they screwed themselves in. Ransom went at once to the lower side of the sphere, into the chamber which was now most completely upside down, and stretched himself on what would later become its skylight. He was surprised to find that they were already thousands of feet up. The handramit was only a straight purple line across the rose-red surface of the harandra. They were above the junction of two handramits. One of them was doubtless that in which he had lived, the other that which contained Meldilorn. The gully by which he had cut off the corner between the two, on Augray\u0027s shoulders, was quite invisible. Each minute more handramits came into view - long straight lines, some parallel, some intersecting, some building triangles. The landscape became increasingly geometrical. The waste between the purple lines appeared perfectly flat. The rosy colour of the petrified forests accounted for its tint immediately below him; but to the north and east the great sand deserts of which the sorns had told him were now appearing as illimitable stretches of yellow and ochre. To the west a huge discoloration began to show. It was an irregular patch of greenish blue that looked as if it were sunk below the level of the surrounding harandra. He concluded it was the forest lowland of the pfifltriggi - or rather one of their forest lowlands, for now similar patches were appearing in all directions, some of them mere blobs at the intersection of handramits, some of vast extent. He became vividly conscious that his knowledge of Malacandra was minute, local, parochial. It was as if a sorn had journeyed forty million miles to the Earth and spent his stay there between Worthing and Brighton. He reflected that he would have very little to show for his amazing voyage if he survived it: a smattering of the language, a few landscapes, some half-understood physics - but where were the statistics, the history, the broad survey of extra-terrestrial conditions, which such a traveller ought to bring back? Those handramits, for example. Seen from the height which the space-ship had now attained, in all their unmistakable geometry, they put to shame his original impression that they were natural valleys. There were gigantic feats of engineering, about which he had learned nothing; feats accomplished, if all were true, before human history began ... before animal history began. Or was that only mythology? He knew it would seem like mythology when he got back to Earth (if he ever got back), but the presence of Oyarsa was still too fresh a memory to allow him any real doubts. It even occurred to him that the distinction between history and mythology might be itself meaningless outside the Earth. The thought baffled him, and he turned again to the landscape below - the landscape which became every moment less of a landscape and more of a diagram. By this time, to the east, a much larger and darker patch of discoloration than he had yet seen was pushing its way into the reddish ochre of the Malacandrian world - a curiously shaped patch with long arms or horns extended on each side and a sort of bay between them, like the concave side of a crescent. It grew and grew. The wide dark arms seemed to be spread out to engulf the whole planet. Suddenly he saw a bright point of light in the middle of this dark patch and realized that it was not a patch on the surface of the planet at all, but the black sky showing behind her. The smooth curve was the edge of her disk. At this, for the first time since their embarkation, fear took hold of him. Slowly, yet not too slowly for him to see, the dark arms spread farther and even farther round the lighted surface till at last they met. The whole disk, framed in blackness, was before him. The faint percussions of the meteorites had long been audible; the window through which he was gazing was no longer definitely beneath him. His limbs, though already very light, were almost too stiff to move, and he was very hungry. He looked at his watch. He had been at his post, spellbound, for nearly eight hours. He made his way with difficulty to the sunward side of the ship and reeled back almost blinded with the glory of the light. Groping, he found his darkened glasses in his old cabin and got himself food and water: Weston had rationed them strictly in both. He opened the door of the control room and looked in. Both the partners, their faces drawn with anxiety, were seated before a kind of metal table; it was covered with delicate, gently vibrating instruments in which crystal and fine wire were the predominant materials. Both ignored his presence. For the rest of the silent journey he was free of the whole ship. When he returned to the dark side, the world they were leaving hung in the star-strewn sky not much bigger than our earthly moon. Its colours were still visible - a reddish-yellow disk blotched with greenish blue and capped with white at the poles. He saw the two tiny Malacandrian moons - their movement quite perceptible - and reflected that they were among the thousand things he had not noticed during his sojourn there. He slept, and woke, and saw the disk still hanging in the sky. It was smaller than the Moon now. Its colours were gone except for a faint, uniform tinge of redness in its light; even the light was not now incomparably stronger than that of the countless stars which surrounded it. It had ceased to be Malacandra; it was only Mars. He soon fell back into the old routine of sleeping and basking, punctuated with the making of some scribbled notes for his Malacandrian dictionary. He knew that there was very little chance of his being able to communicate his new knowledge to man, that unrecorded death in the depth of space would almost certainly be the end of their adventure. But already it had become impossible to think of it as \u0027space.\u0027 Some moments of cold fear he had; but each time they were shorter and more quickly swallowed up in a sense of awe which made his personal fate seem wholly insignificant. He could not feel that they were an island of life journeying through an abyss of death. He felt almost the opposite - that life was waiting outside the little iron eggshell in which they rode, ready at any moment to break in, and that, if it killed them, it would kill them by excess of its vitality. He hoped passionately that if they were to perish they would perish by the \u0027unbodying \u0027of the space-ship and not by suffocation within it. To be let out, to be set free, to dissolve into the ocean of eternal noon, seemed to him at certain moments a consummation even more desirable than their return to Earth. And if he had felt some such lift of the heart when first he passed through heaven on their outward journey, he felt it now tenfold, for now he was convinced that the abyss was full of life in the most literal sense, full of living creatures. His confidence in Oyarsa\u0027s words about the eldila increased rather than diminished as they went on. He saw none of them; the intensity of light in which the ship swam allowed none of the fugitive variations which would have betrayed their presence. But he heard, or thought he heard, all kinds of delicate sound, or vibrations akin to sound, mixed with the tinkling rain of meteorites, and often the sense of unseen presences even within the space-ship became irresistible. It was this, more than anything else, that made his own chances of life seem so unimportant. He and all his race showed small and ephemeral against a background of such immeasurable fullness. His brain reeled at the thought of the true population of the universe, the three-dimensional infinitude of their territory, and the unchronicled aeons of their past; but his heart became steadier than it had ever been. It was well for him that he had reached this frame of mind before the real hardships of their journey began. Ever since their departure from Malacandra, the thermometer had steadily risen; now it was higher than it had stood at any time on their outward journey. And still it rose. The light also increased. Under his glasses he kept his eyes habitually tight shut, opening them only for the shortest time for necessary movements. He knew that if he reached Earth it would be with permanently damaged sight. But all this was nothing to the torment of heat. All three of them were awake for twenty-four hours out of the twenty-four, enduring with dilated eyeballs, blackened lips and froth-flecked cheeks the agony of thirst. It would be madness to increase their scanty rations of water: madness even to consume air in discussing the question. He saw well enough what was happening. In his last bid for life Weston was venturing inside the Earth\u0027s orbit, leading them nearer the Sun than man, perhaps than life, had ever been. Presumably this was unavoidable; one could not follow a retreating Earth round the rim of its own wheeling course. They must be trying to meet it - to cut across ... it was madness! But the question did not much occupy his mind; it was not possible for long to think of anything but thirst. One thought of water; then one thought of thirst; then one thought of thinking of thirst; then of water again. And still the thermometer rose. The walls of the ship were too hot to touch. It was obvious that a crisis was approaching. In the next few hours it must kill them or get less. It got less. There came a time when they lay exhausted and shivering in what seemed the cold, though it was still hotter than any terrestrial climate. Weston had so far succeeded; he had risked the highest temperature at which human life could theoretically survive, and they had lived through it. But they were not the same men. Hitherto Weston had slept very little even in his watches off; always, after an hour or so of uneasy rest, he had returned to his charts and to his endless, ahnost despairing, calculations. You could see him fighting the despair - pinning his terrified brain down, and again down, to the figures. Now he never looked at them. He even seemed careless in the control room. Devine moved and looked like a somnambulist. Ransom lived increasingly on the dark side and for long hours he thought of nothing. Although the first great danger was past, none of them, at this time, had any serious hope of a successful issue to their journey. They had now been fifty days, without speech, in their steel shell, and the air was already very bad. Weston was so unlike his old self that he even allowed Ransom to take his share in the navigation. Mainly by signs, but with the help of a few whispered words, he taught him all that was necessary at this stage of the journey. Apparently they were racing home - but with little chance of reaching it in time - before some sort of cosmic \u0027trade-wind.\u0027 A few rules of thumb enabled Ransom to keep the star which Weston pointed out to him in its position at the centre of the skylight, but always with his left hand on the bell to Weston\u0027s cabin. This star was not the Earth. The days - the purely theoretical \u0027days\u0027 which bore such a desperately practical meaning for the travellers - mounted to fifty-eight before Weston changed course, and a different luminary was in the centre. Sixty days, and it was visibly a planet. Sixty-six, and it was like a planet seen through field-glasses. Seventy, and it was like nothing that Ransom had ever seen - a little dazzling disk too large for a planet and far too small for the Moon. Now that he was navigating, his celestial mood was shattered. Wild, animal thirst for life, mixed with homesick longing for the free airs and the sights and smells of earth - for grass and meat and beer and tea and the human voice - awoke in him. At first his chief difficulty on watch had been to resist drowsiness; now, though the air was worse, feverish excitement kept him vigilant. Often when he came off duty he found his right arm stiff and sore; for hours he had been pressing it unconsciously against the control board as if his puny thrust could spur the space-ship to yet greater speed. Now they had twenty days to go. Nineteen - eighteen - and on the white terrestrial disk, now a little larger than a sixpence, he thought he could make out Australia and the south-east corner of Asia. Hour after hour, though the markings moved slowly across the disk with the Earth\u0027s diurnal revolution, the disk itself refused to grow larger. \"Get on! Get on!\" Ransom muttered to the ship. Now ten days were left and it was like the Moon and so bright that they could not look steadily at it. The air in their little sphere was ominously bad, but Ransom and Devine risked a whisper as they changed watches. \"We\u0027ll do, it,\" they said. \"We\u0027ll do it yet.\" On the eighty-seventh day, when Ransom relieved Devine, he thought there was something wrong with the Earth. Before his watch was done, he was sure. It was no longer a true circle, but bulging a little on one side; it was almost pear-shaped. When Weston came on duty he gave one glance at the skylight, rang furiously on the bell for Devine, thrust Ransom aside, and took the navigating seat. His face was the colour of putty. He seemed to be about to do something to the controls, but as Devine entered the room he looked up and shrugged his shoulders with a gesture of despair. Then he buried his face in his hands and laid his head down on the control-board. Ransom and Devine exchanged glances. They bundled Weston out of the seat - he was crying like a child - and Devine took his place. And now at last Ransom understood the mystery of the bulging Earth. What had appeared as a bulge on one side of her disk was becoming increasingly distinct as a second disk, a disk almost as large in appearance as her own. It was covering more than half of the Earth. It was the Moon - between them and the Earth, and two hundred and forty thousand miles nearer. Ransom did not know what fate this might mean for the space-ship. Devine obviously did, and never had he appeared so admirable. His face was as pale as Weston\u0027s, but his eyes were clear and preternaturally bright; he sat crouched over the controls like an animal about to spring and he was whistling very softly between his teeth. Hours later Ransom understood what was happening. The Moon\u0027s disk was now larger than the Earth\u0027s, and very gradually it became apparent to him that both disks were diminishing in size. The space-ship was no longer approaching either the Earth or the Moon; it was farther away from them than it had been half an hour ago, and that was the meaning of Devine\u0027s feverish activity with the controls. It was not merely that the Moon was crossing their path and cutting them off from the Earth; apparently for some reason - probably gravitational - it was dangerous to get too close to the Moon, and Devine was standing off into space. In sight of harbour they were being forced to turn back to the open sea. He glanced up at the chronometer. It was the morning of the eighty-eighth day. Two days to make the Earth, and they were moving away from her. \"I suppose this finishes us?\" he whispered. \"Expect so,\" whispered Devine, without looking round. Weston presently recovered sufficiently to come back and stand beside Devine. There was nothing for Ransom to do. He was sure, now, that they were soon to die. With this realization, the agony of his suspense suddenly disappeared. Death, whether it came now or some thirty years later on earth, rose up and claimed his attention. There are preparations a man likes to make. He left the control room and returned into one of the sunward chambers, into the indifference of the moveless light, the warmth, the silence and the sharp-cut shadows. Nothing was farther from his mind than sleep. It must have been the exhausted atmosphere which made him drowsy. He slept. He awoke in almost complete darkness in the midst of a loud continuous noise, which he could not at first identify. It reminded him of something - something he seemed to have heard in a previous existence. It was a prolonged drumming noise close above his head. Suddenly his heart gave a great leap. \"Oh God,\" he sobbed. \"Oh God! It\u0027s rain.\" He was on Earth. The air was heavy and stale about him, but the choking sensations he had been suffering were gone. He realized that he was still in the space-ship. The others, in fear of its threatened \u0027unbodying,\u0027 had characteristically abandoned it the moment it touched Earth and left him to his fate. It was difficult in the dark, and under the crushing weight of terrestrial gravity, to find his way out. But he managed it. He found the manhole and slithered, drinking great draughts of air, down the outside of the sphere; slipped in mud, blessed the smell of it, and at last raised the unaccustomed weight of his body to its feet. He stood in pitch-black night under torrential rain. With every pore of his body he drank it in; with every desire of his heart he embraced the smell of the field about him - a patch of his native planet where grass grew, where cows moved, where presently he would come to hedges and a gate. He had walked about half an hour when a vivid light behind him and a strong, momentary wind informed him that the space-ship was no more. He felt very little interest. He had seen dim lights, the lights of men, ahead. He contrived to get into a lane, then into a road, then into a village street. A lighted door was open. There were voices from within and they were speaking English. There was a familiar smell. He pushed his way in, regardless of the surprise he was creating, and walked to the bar. \"A pint of bitter, please,\" said Ransom.","sourceLink":"https://allnovel.net/out-of-the-silent-planet-space-trilogy-1/page-20.html","bookId":1688,"book":{"id":1688,"title":"Out of the Silent Planet (Space Trilogy #1)","description":"Storyline: Out of the Silent Planet (Space Trilogy #1) In the first novel of C.S. Lewis\u0027s classic science fiction trilogy, Dr Ransom, a Cambridge academic, is abducted and taken on a spaceship to the red planet of Malacandra, which he knows as Mars. His captors are plotting to plunder the planet\u0027s treasures and plan to offer Ransom as a sacrifice to the creatures who live there. Ransom discovers he has come from the \u0027silent planet\u0027 – Earth – whose tragic story is known throughout the universe...","cover":"https://allnovel.net/images/out-of-the-silent-planet-space-trilogy-1.jpg","author":"C. S. Lewis","type":"Christian","source":"allnovel","link":"https://allnovel.net/out-of-the-silent-planet-space-trilogy-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:53:15 AM"}}
