{"id":111002,"no":8,"title":"Page 8","content":"\"It was seriously creepy,\" said Bonnie. They had al bundled into Matt\u0027s car, Elena hopping onto Stefan\u0027s lap and Meredith onto Alaric\u0027s (which, Bonnie had noted, Dr. Celia had seemed less than thril ed by). Then they\u0027d hurried back to the boardinghouse, looking for counsel. Once there, they\u0027d al crowded into the parlor and spil ed out the story to Mrs. Flowers, talking over one another in their excitement. \"First Celia\u0027s name - in my blood -\\n\\n appearing out of nowhere,\" Bonnie went on, \"and then there\u0027s this weird accident that could have killed her, and then Meredith\u0027s name appears, too. It was al just real y, real y creepy.\"\\n\\n \"I\u0027d put it a bit more strongly than that,\" Meredith said. Then she arched an elegant eyebrow. \"Bonnie, this is no doubt the first time I\u0027ve ever complained you weren\u0027t being dramatic enough.\"\\n\\n \"Hey!\" Bonnie objected.\\n\\n \"There you go,\" Elena joked. \"Keep looking on the bright side. The latest insanity is making Bonnie low-key.\"\\n\\n Matt shook his head. \"Mrs. Flowers, do you know what\u0027s happening?\"\\n\\n Mrs. Flowers, seated in a cozy corner chair of the parlor, smiled and patted him on the shoulder. She\u0027d been knitting when they came in, but had laid the pink bundle of yarn aside and had fixed her calm blue eyes on them with her ful attention as they told their story. \"Dear Matt,\" she said.\\n\\n \"Always straight to the point.\"\\n\\n Poor Celia had been sitting on the couch by Alaric and Meredith, looking stunned since they\u0027d arrived. It was one thing to study the supernatural, but the reality of a vampire, mysteriously appearing names, and a brush with death must have been a shock to her system. Alaric had a reassuring arm around her shoulders. Bonnie thought maybe the arm should have been around Meredith\u0027s shoulders. After al , Meredith\u0027s name had just shown up in the scarf\u0027s folds. But Meredith was just sitting there, watching Alaric and Celia, her face composed, her eyes unreadable.\\n\\n Now Celia leaned forward and spoke for the first time.\\n\\n \"Pardon me,\" she said politely, her voice shaking a bit,\\n\\n \"but I don\u0027t understand why we\u0027ve brought this... this issue to...\" Her voice trailed off as her eyes flickered to Mrs. Flowers.\\n\\n Bonnie knew what she meant. Mrs. Flowers looked like the epitome of a sweet, dotty elderly lady: soft flyaway gray hair drawn back in a bun, a politely vague expression, a wardrobe that leaned toward pastels or shabby blacks, and a habit of muttering quietly, apparently to herself. A year ago, Bonnie herself had thought Mrs. Flowers was just the crazy old woman who ran the boardinghouse where Stefan lived.\\n\\n But appearances could be deceptive. Mrs. Flowers had earned the respect and admiration of every one of them by the way she had protected the town with her magic, Power, and good sense. There was a lot more to this little old lady than met the eye.\\n\\n \"My dear,\" said Mrs. Flowers firmly, \"you\u0027ve had a very traumatic experience. Drink your tea. It\u0027s a special calming blend that\u0027s been passed down in my family for generations. We wil do everything we can for you.\"\\n\\n Which, Bonnie observed, was a very sweet and ladylike way of putting Dr. Celia Connor in her place. She was to drink her tea and recuperate, and they would figure out how to solve the problem. Celia\u0027s eyes flashed, but she sipped her tea obediently.\\n\\n \"Now,\" Mrs. Flowers said, looking around at the others, \"it seems to me that the first thing to do is to figure out what the intention is behind the appearance of the names. Once we do that, perhaps we wil have a better idea of who might be behind their appearance.\"\\n\\n \"Maybe to warn us?\" Bonnie said hesitantly. \"I mean, Celia\u0027s name appeared, and then she almost died, and now Meredith...\" Her voice trailed off and she looked at Meredith apologetical y. \"I\u0027m worried you might be in danger.\"\\n\\n Meredith squared her shoulders. \"It certainly wouldn\u0027t be the first time,\" she said.\\n\\n Mrs. Flowers nodded briskly. \"Yes, it\u0027s possible that the appearance of the names has a benevolent intention. Let\u0027s explore that theory. Someone may be trying to get a warning to you. If so, who? And why do they have to do it in this way?\"\\n\\n Bonnie\u0027s voice was even softer and more hesitant now. But if no one else was going to say it, she would. \"Could it be Damon?\"\\n\\n \"Damon\u0027s dead,\" Stefan said flatly.\\n\\n \"But when Elena was dead, she warned me about Klaus,\" Bonnie argued.\\n\\n Stefan massaged his temples. He looked tired. \"Bonnie, when Elena died, Klaus trapped her spirit between dimensions. She hadn\u0027t ful y passed away. And even then, she could only visit you in your dreams - not anyone else, just you, because you can sense things other people can\u0027t. She couldn\u0027t make anything happen in the physical world.\"\\n\\n Elena\u0027s voice trembled. \"Bonnie, the Guardians told us that vampires don\u0027t live on after death. In any sense of the word. Damon\u0027s gone.\" Stefan reached out and took her hand, his eyes troubled.\\n\\n Bonnie felt a sharp stab of sympathy for them both. She was sorry she\u0027d brought Damon up, but she hadn\u0027t been able to stop herself. The thought that he might be watching over them, irascible and mocking but ultimately kind, had briefly lifted the weight from her heart. Now that weight came crashing back down. \"Wel ,\" she said dul y, \"then I don\u0027t have any idea who might be warning us. Does anybody else?\"\\n\\n They al shook their heads, baffled. \"Who even knows about us now that has this kind of power?\" Matt asked.\\n\\n \"The Guardians?\" said Bonnie doubtful y.\\n\\n But Elena shook her head with a quick decisive motion, blond hair swinging. \"It\u0027s not them,\" she said. \"The last thing they\u0027d do is send a message in blood. Visions would be more their style. And I\u0027m pretty sure the Guardians washed their hands of us when they sent us back here.\"\\n\\n Mrs. Flowers interlocked her fingers in her lap. \"So perhaps there is some as yet unknown person or being looking after you, warning you of danger ahead.\"\\n\\n Matt had been sitting ramrod straight in one of Mrs. Flowers\u0027s daintier chairs, and it creaked alarmingly as he leaned forward. \"Um,\" he said. \"I think the better question is, what\u0027s causing that danger?\"\\n\\n Mrs. Flowers spread her smal , wrinkled hands. \"You\u0027re perfectly right. Let\u0027s consider the options. On the one hand, it could be a warning for something that was natural y going to happen. Celia\u0027s - you don\u0027t mind if I cal you Celia, do you, dear?\"\\n\\n Celia, stil looking shel -shocked, shook her head.\\n\\n \"Good. Celia\u0027s scarf getting caught in the train doors could have been a natural accident. Forgive me for saying so, but those long, dramatic scarves can be very dangerous. The dancer Isadora Duncan was kil ed in just that way when her scarf caught in the wheel of a car many years ago. Perhaps whoever sent the message was simply raising a flag for Celia to be careful, or for the rest of you to take care of her. Perhaps Meredith merely needs to be cautious over the next few days.\"\\n\\n \"You don\u0027t think so, though, do you?\" asked Meredith sharply.\\n\\n Mrs. Flowers sighed. \"This al feels rather malevolent to me. I think if someone wanted to warn you about the possibility of accidents, they could find a better way than names written in blood. Both of these names appeared as the results of rather violent incidents, correct? Bonnie cutting herself and Stefan ripping the scarf from Celia\u0027s neck?\"\\n\\n Meredith nodded.\\n\\n Looking troubled, Mrs. Flowers continued. \"And, of course, the other possibility is that the appearance of the names is itself malicious. Perhaps the names\u0027 appearance is an essential ingredient in or targeting method for some spel that is causing the danger.\"\\n\\n Stefan frowned. \"You\u0027re talking about dark magic, aren\u0027t you?\"\\n\\n Mrs. Flowers met his eyes squarely. \"I\u0027m afraid so. Stefan, you\u0027re the oldest and most experienced of us by far. I\u0027ve never heard of anything like this, have you?\"\\n\\n Bonnie felt a bit surprised. Of course, she knew that Stefan was much older than even Mrs. Flowers - after al , he\u0027d been alive before electricity, or running water, or cars, or anything they took for granted in the modern world, while Mrs. Flowers was probably only in her seventies. But stil , it was easy to forget how long Stefan had lived. He looked just like any other eighteen-year-old, except that he was exceptional y handsome. A traitorous thought flickered at the back of her mind, one she\u0027d had before: How was it that Elena always got al the best-looking guys?\\n\\n Stefan was shaking his head. \"Nothing like this, no. But I think you\u0027re right that it may be dark magic. Perhaps, if you spoke to your mother about it...\"\\n\\n Celia, who was starting to take more of an interest in what was going on, looked at Alaric quizzical y. Then she cast a glance toward the door, as if expecting a hundredyear-old woman to wander in. Bonnie grinned to herself, despite the seriousness of the situation.\\n\\n They had al gotten so matter-of-fact about Mrs. Flowers\u0027s frequent conversations with the ghost of her mother that none of them blinked when Mrs. Flowers gazed off into space and started muttering rapidly, eyebrows lifting, eyes scanning unoccupied space as if someone unseen were speaking to her. But to Celia it must have seemed pretty strange.\\n\\n \"Yes,\" said Mrs. Flowers, returning her attention to them.\\n\\n \"Mama says there is indeed something dark stirring in Fel \u0027s Church. But\" - her hands lifted, palms empty - \"she cannot tel what form it takes. She simply warns us to be careful. Whatever it is, she can sense that it\u0027s deadly.\"\\n\\n Stefan and Meredith frowned, taking this in. Alaric was murmuring to Celia, probably explaining what was going on. Matt bowed his head.\\n\\n Elena pushed on, already working on the next angle.\\n\\n \"Bonnie, what about you?\" she asked.\\n\\n \"Huh?\" Bonnie asked. Then she realized what Elena meant. \"No. Nuh-uh. I\u0027m not going to know anything Mrs. Flowers\u0027s mother doesn\u0027t.\"\\n\\n Elena just looked at her, and Bonnie sighed. This was important, after al . Meredith\u0027s name was next, and if there was one thing that was true, it was that she and Meredith and Elena had one another\u0027s backs. Always. \"Al right,\" she said reluctantly. \"I\u0027l see if I can find out anything else. Can you light me a candle?\"\\n\\n \"What now?\" Celia asked in confusion.\\n\\n \"Bonnie\u0027s psychic,\" Elena explained simply.\\n\\n \"Fascinating,\" Celia said brightly, but her eyes slid, cool and disbelieving, across Bonnie.\\n\\n Wel , whatever. Bonnie didn\u0027t care what she thought. She could assume that Bonnie was pretending or crazy if she wanted to, but she\u0027d see what happened eventual y. Elena brought a candle over from its spot on the mantel, lit it, and placed it on the coffee table.\\n\\n Bonnie swal owed, licked her lips, which were suddenly dry, and tried to focus on the candle flame. Although she\u0027d had plenty of practice, she didn\u0027t like doing this, didn\u0027t like the sensation of losing herself, as if she were sliding underwater.\\n\\n The flame flickered and grew brighter. It seemed to swel and fil Bonnie\u0027s field of vision. Al she could see was flame. I know who you are, a cold, rough voice suddenly growled in her ear, and Bonnie twitched. She hated the voices, sometimes as soft as if they were coming from a distant television, sometimes right beside her, like this one. She somehow always managed to forget them until the next time she began to fal into a trance. A faraway child\u0027s voice began a wordless off-key humming, and Bonnie focused on making her breathing slow and steady.\\n\\n She could feel her eyes slipping out of focus. A sour taste, wet and nasty, fil ed her mouth.\\n\\n Envy twisted, sharp and bitter, inside her. It\u0027s not fair, not fair, something muttered sul enly in her skul . And then blackness took over.\\n\\n Elena watched apprehensively as Bonnie\u0027s pupils widened, reflecting the candle flame. Bonnie was able to sink into trances much more quickly now than when she had begun having them, which worried Elena.\\n\\n \"Darkness rises.\" A flat, hol ow voice that didn\u0027t sound anything like Bonnie\u0027s came from her friend\u0027s mouth. \"It\u0027s not here yet, but it wants to be. It\u0027s cold. It\u0027s been cold for a long time. It wants to be near us, out of the darkness and as warm as our hearts. It hates.\"\\n\\n \"Is it a vampire?\" asked Meredith quickly.\\n\\n The not-Bonnie voice gave a harsh, choking laugh. \"It\u0027s much stronger than any vampire. It can find a home in any of you. Watch one another. Watch yourselves.\"\\n\\n \"What is it?\" asked Matt.\\n\\n Whatever it was that spoke through Bonnie hesitated.\\n\\n \"She doesn\u0027t know,\" said Stefan. \"Or she can\u0027t tel us. Bonnie,\" he said intently, \"is someone bringing this thing to us? Who\u0027s causing it?\"\\n\\n No hesitation this time. \"Elena,\" it said. \"Elena brought it.\" \\n\\n","sourceLink":"https://allnovel.net/the-hunters-phantom-the-vampire-diaries-1/page-8.html","bookId":2066,"book":{"id":2066,"title":"The Hunters: Phantom (The Vampire Diaries #1)","description":"Storyline: Phantom (The Vampire Diaries: The Hunters, #1) \\n The past is never far... Elena Gilbert and her friends saved Fell\u0027s Church from evil spirits bent on destroying it, but the town\u0027s freedom came at a price: Damon Salvatore\u0027s life. Damon\u0027s death changes everything. He and his vampire brother, Stefan, had been locked in a vicious battle for Elena\u0027s heart. Now that he\u0027s gone, Elena and Stefan can finally be together. So why can\u0027t Elena stop dreaming of Damon? As Elena\u0027s feelings for Damon grow, a new darkness is brewing in Fell\u0027s Church. Elena has been to hell and back, but this demon is like nothing she\u0027s ever seen. Its only goal is to kill Elena and everyone she loves.\\n","cover":"https://allnovel.net/images/the-hunters-phantom-the-vampire-diaries-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-hunters-phantom-the-vampire-diaries-1.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:14:34 AM"}}
