{"id":40970,"no":35,"title":"CHAPTER XXXV.","content":"A Woman\u0027s Jealousy. Mrs. Tilton\u0027s house was ablaze with light, for it was the evening of the great party. Ambitious of social distinction, she took care to do things on a handsome scale, though she was not averse to saving money where it would not attract attention. Among the young ladies present were two with whom we are especially concerned. One of them was Arethusa Jayne, who was dressed with more splendor than taste. She made a profuse display of jewelry, some of which, we may confidentially inform the reader, was borrowed from a well-known jeweler, who was handsomely paid for the favor. Of course no one suspected this, and the society young men were misled into thinking that the owner of so many diamonds must be very rich. This was precisely what Arethusa desired, for she [288] was in the market, and had been for more years than she liked to remember. Another young lady, still better known to us, was Rose Beaufort. She was the most plainly dressed young lady in the handsome parlors, yet she attracted an unusual share of attention. \"Who is that pretty young lady?\" asked a middle-aged lady of Arethusa. \"That?\" answered Miss Jayne, with a sneer. \"Oh, that is Miss Beaufort, the music-teacher.\" \"She is very sweet-looking.\" \"Do you think so? I don\u0027t at all agree with you. To me she looks very artful, and I have reason to think that beneath her innocent exterior there is something quite different.\" \"That is a pity.\" \"It is not surprising. Still water runs deep, you know.\" Rose kept in the background. She had no wish to make herself conspicuous at Mrs. Tilton\u0027s gay party. She would rather not have been there, but did not wish to disappoint her employer. [289] \"Ah, here you are, Miss Beaufort,\" said a glad voice. Rose looked up, and her face flushed with pleasure as she recognized Clinton Randall. \"I did not think you would find me,\" she said. \"I was sure to do it. I have been looking for you everywhere. Can\u0027t you spare a seat for me?\" Rose moved, and Clinton sat down beside her on the sofa. He had scarcely been there two minutes, however, when Arethusa discovered them. She went straightway to her aunt. \"Aunt Lucy,\" she said, in a low voice, \"look at the sofa opposite.\" \"Well?\" said Mrs. Tilton, who was rather short-sighted. \"There is your precious music-teacher monopolizing Clinton Randall. Didn\u0027t I tell you?\" \"I am really shocked at her brazen ways. You were right, Arethusa.\" \"For goodness\u0027 sake, separate them before the whole room notices them.\" [290] \"How can I do it?\" \"Send her to the piano.\" \"Miss Beaufort,\" said Mrs. Tilton, coldly, \"oblige me by sitting down to the piano. You may play a waltz.\" \"Certainly, Mrs. Tilton,\" said Rose. \"That woman speaks as if she owned Miss Beaufort,\" thought young Randall. He was about to follow her to the piano when Arethusa came up, and with an insinuating smile, said: \"Don\u0027t look so mournful, Mr. Randall. Let me fill Miss Beaufort\u0027s place.\" \"Certainly,\" answered the young man, moving, but not with alacrity. \"I wasn\u0027t aware that you knew Miss Beaufort,\" said the young lady. \"I believe you saw me walking with her the other day.\" \"Yes, to be sure; it had escaped my mind.\" Rose began to play. Her touch was fine, and her performance could hardly fail to attract attention. \"Miss Beaufort plays remarkably well,\" said Clinton Randall. [291] \"Oh, it\u0027s her business,\" answered Arethusa, with careless hauteur. \"She gives lessons to my aunt\u0027s children, you know.\" \"Your aunt is fortunate to secure such an accomplished pianist.\" \"Oh, she is very well,\" said Arethusa, carelessly. \"Do you feel like dancing?\" \"I beg your pardon. I should have suggested it.\" The two moved out upon the floor and took their places among the dancers. Arethusa danced passably, her partner remarkably well. At length he led her to her seat, and, with a bow, left her, much to her chagrin. Later in the evening some one relieved Rose at the piano. Clinton took the earliest opportunity to seek her out and ask her for a dance. Rose hesitated. \"I have not danced for a long time,\" she said. \"Circumstances have kept me out of society. I am afraid you won\u0027t find me a satisfactory partner.\" \"I will take the risk, Miss Beaufort. You won\u0027t refuse?\" [292] She rose and took her place on the floor. Arethusa Jayne, who was dancing with one of the walking gentlemen of society, a young man who was merely invited to swell the number of guests, was not long in discovering Miss Beaufort\u0027s good luck, and her face showed her displeasure. It would have pleased her had Rose been awkward, but she was unusually graceful, in spite of her want of practice. Miss Jayne was hot with jealousy. \"You shall repent this,\" she said to herself, and looked so stern that her partner asked, with alarm: \"Are you not well, Miss Jayne?\" \"Certainly\"—you fool! she would liked to have added. \"Why do you ask?\" \"I thought you looked disturbed,\" he stammered. \"I was only a little thoughtful,\" she said, with a constrained smile. \"But I am fatigued. Suppose we sit down.\" He led her to her seat, nothing loth, and she had the satisfaction of following with her glance Clinton Randall and her rival five minutes more. [293] \"Did you have a good time, Rose?\" asked her sister Adeline, next morning, at the breakfast-table. \"Better than I dared to hope,\" answered Rose, with a smile. \"Did you dance?\" \"Two or three times.\" She had danced with two partners besides Clinton Randall, and with him a second time. \"It seemed quite like the old times,\" she said, after a pause, \"when we were in society. Though I only appeared in the character of a governess, I enjoyed it.\" \"Don\u0027t you feel tired?\" \"A little; but I don\u0027t go out to give lessons till afternoon.\" At two o\u0027clock Rose went to Mrs. Tilton\u0027s to give her regular lessons. \"Mrs. Tilton would like to see you,\" said the servant. A little surprised, Rose remained in the parlor till that lady appeared. \"I wish to speak to you, Miss Beaufort,\" said Mrs. Tilton, coldly, \"about your conduct last evening.\" [294] \"My conduct last evening!\" repeated Rose, in utter surprise. \"To what do you refer?\" \"To your indelicate conduct with Mr. Clinton Randall and other gentlemen.\" \"What do you mean? I demand an explanation!\" exclaimed Rose, indignantly. \"You seem to forget your position, Miss Beaufort. As the instructress of my children, I feel I must be exacting. I do not approve of your bold flirtation with gentlemen above yourself in social position, and I beg to say that I must provide myself with another music-teacher for my girls.\" \"After your insulting remarks,\" said Rose, hotly, \"nothing would induce me to remain in charge of them. Nothing in my conduct has called for such cruel charges.\" \"Doubtless you think so. I disagree with you,\" said Mrs. Tilton, coldly. \"Good-afternoon, madam!\" said Rose, rising abruptly. \"Good-afternoon, Miss Beaufort.\" It was like a thunderbolt to Rose, and mystified as well as made her indignant. She could recall nothing that had passed which [295] would justify Mrs. Tilton in her strange treatment. It was the first blow, but not the last. Arethusa Jayne, with unappeased malice, went the rounds of the families in which Rose was employed, and within a week she received notes from all the parents, expressing regret that they could no longer avail themselves of her services. It began to look serious for poor Rose. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2945/80933.html","bookId":467,"book":{"id":467,"title":"A Boy\u0027s Fortune","description":"简介： Wake up there! This is no place to sleep.The speaker was a policeman, the scene was City Hall Park, and the person addressed was a boy of perhaps sixteen, who was reclining on one of the park benches, with a bundle at his side....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2945","creation":"Aug 1, 2019 12:18:49 AM","modification":"Aug 1, 2019 12:18:49 AM"}}
