{"id":27677,"no":19,"title":"CHAPTER XVIII A MEETING ON THE RIVER","content":"Two weeks passed and Randy felt quite at home on board of the steamboat. He had learned his duties fully and was giving satisfaction to Captain Hadley and Pat Malloy. His only enemy seemed to be Polk the purser, who was as disagreeable as possible. Our hero did his best to steer clear of the fellow, and in a measure succeeded. One evening, while the boat was tied up at the dock in New York Randy chanced to look ashore when he saw Rose Clare motioning to him. He at once joined the girl. \"I came down to tell you that Bill Hosker was around yesterday,\" said the girl to our hero. \"Is he around now?\" questioned Randy, quickly. \"No, he went away yesterday evening. He was only around about two hours.\" \"I wish I had seen him.\" \"I thought you\u0027d like to know about it. I came down last night, but a man here told me you were at Albany.\" \"Yes, we come to New York every other night, not counting Sundays.\" \"I think Bill Hosker will come again soon. I suppose he thinks you have given up trying to find him.\" \"Well, I haven\u0027t given it up, Rose. How are things going with yourself and your mother?\" \"Not very good.\" \"Can\u0027t she get much sewing to do?\" \"She and I made only five dollars and a quarter last week.\" \"And what rent do you pay?\" \"Six dollars a month for just the one room.\" \"That is certainly hard. I wish I could help you, but I can\u0027t—at least, not now.\" \"We wouldn\u0027t want help, if only we could get more sewing.\" \"I\u0027ll ask Captain Hadley about it. He has a wife and a family of girls.\" Randy was as good as his word. He met the captain the next day, when the officer appeared to have little to do. \"Captain, may I speak to you a moment?\" he asked, respectfully, and at the same time tipping his cap. \"What is it, Randy?\" \"I know a poor lady in New York who does sewing for a living. She is anxious to get more work and I am anxious to help her, if I possibly can. Do you know of anybody who would like some sewing done—your wife or anybody else?\" \"Hm! I don\u0027t know,\" answered the steamboat captain. \"I\u0027ll remember what you say and see. Is that all?\" \"Yes, sir.\" \"Where does the poor woman live?\" \"Not far from our landing place in New York.\" He gave the street and number. \"It isn\u0027t a nice neighborhood, but it is the best the woman can afford,\" he added. \"Yes, I know many folks in New York who live in bad neighborhoods simply because they cannot afford something better. I will speak to my wife about this.\" The captain did as he had promised. Mrs. Hadley was going to New York the next day and said she would call upon Mrs. Clare. The family lived in Albany, so that the captain was home every other night. Mrs. Hadley was as good as her word. She was a Christian woman, a worker in the church, and she became at once interested in Mrs. Clare and her daughter Rose. \"This is no place for Rose,\" said she. \"This foul air is bad for her.\" \"I know it—but I do not see how I can turn myself,\" said Mrs. Clare, with a sigh. Poverty had completely broken her spirit. The captain\u0027s wife looked over some of the sewing that Mrs. Clare had done and soon learned that the woman was a clever seamstress. Then she made an offer. \"If you wish, you can come to my home with me,\" she said. \"You can sew for me, and Rose can go to school and also help around the house. I will give you five dollars a week and your board.\" \"I will accept gladly!\" cried the poor woman, and burst into tears of gratitude. It was arranged that Mrs. Clare should leave New York on the following Saturday. She was to sell off the most of her things—alas! there were not many articles to dispose of! and the others were to be transferred to Albany on the boat. \"My cousin, Mr. Polk, will be surprised to learn of this move,\" said Mrs. Clare to the captain\u0027s wife. \"What, is he your cousin?\" queried Mrs. Hadley. \"Yes, by marriage,\" and then Mrs. Clare told her tale of suffering, to which the captain\u0027s wife gave a willing ear. \"I must speak of this to my husband,\" said Mrs. Hadley. \"I do not think he likes Mr. Polk very much.\" On Saturday Randy was moving some baggage from one side of the lower deck to the other when Peter Polk came along. As luck would have it, some trunks were in the way, so that the purser could not pass. \"Look here, you blockhead, why don\u0027t you keep this gangway clear?\" he roared to Randy. \"I am trying to clear it now,\" answered our hero, as calmly as he could. \"It ought to be kept clear always. Who ordered this stuff here, anyway?\" \"Mr. Malloy.\" \"He had no business to do it.\" \"Why didn\u0027t I, I\u0027d like to be after knowin\u0027?\" came in a voice from behind the purser, and the head deckhand appeared on the scene. \"Oh, so you\u0027re here, are you?\" sneered Peter Polk. \"I am that, Mr. Polk. I ordered thim trunks there. Have ye anything against it?\" demanded Malloy, boldly. \"If ye have, report to the captain.\" \"You\u0027re blocking the whole gangway.\" \"Thim trunks had to be shifted, an\u0027 Thompson is shiftin\u0027 \u0027em.\" \"Humph!\" \"I know me juty on this boat, Mr. Polk.\" \"Well—er—hurry up then and clear this gangway,\" grumbled the purser, and walked away. Malloy closed one eye and looked at Randy suggestively with the other. \"He knew he had no right to interfere—it\u0027s not his line o\u0027 juty,\" said the head deckhand. Randy completed his work and then went to one of the upper decks, to fix some of the awnings. To his surprise he found Mrs. Clare and Rose there, in conversation with Peter Polk. \"Going to Albany?\" the purser was saying. \"What for?\" \"I have a situation there, and Rose is going also,\" answered the poor woman. \"What kind of a situation?\" \"I am to sew for Mrs. Hadley.\" \"Not the captain\u0027s wife?\" \"Yes.\" At this announcement the face of the purser dropped. Evidently the news did not please him. \"You won\u0027t find that very pleasant,\" he said. \"It will be better than starving in the city, Peter.\" \"How much is she going to pay you?\" Mrs. Clare told him. \"That is not a fortune. You ought to be able to earn more in New York.\" \"I couldn\u0027t get the work.\" \"I might have gotten something for you, if you had let me know,\" went on Peter Polk. \"Thank you—I prefer to look out for myself,\" answered Mrs. Clare, coolly. \"This looks as if I was letting one of my relatives live on charity,\" pursued the purser. \"I do not consider it a charity.\" \"How did the captain\u0027s wife hear of you?\" \"Why, she—there is a boy on this boat—there he is—he spoke to the captain about it.\" \"You mean Randy Thompson?\" \"Yes, that is his name.\" \"He got the place for you?\" \"Yes.\" \"How did you happen to know him?\" \"It\u0027s a long story. He was knocked down and robbed and Rose and I went to his assistance. But we must go now. Mrs. Hadley wanted us to do some sewing for the captain while on this trip,\" and Mrs. Clare walked away, followed by Rose. Peter Polk gazed after them thoughtfully. \"I hope she doesn\u0027t get the captain\u0027s wife too much interested in her affairs,\" he muttered to himself. \"I shouldn\u0027t care to have the old accounts raked up in court.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2998/82718.html","bookId":303,"book":{"id":303,"title":"Randy of the River The Adventures of a Young Deckhand","description":"简介： The majority of stories for boys have their background laid either in the city or the country, or possibly on the ocean, and we have read much about the doings of lads both rich and poor in such locations....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2998","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
