{"id":27692,"no":34,"title":"CHAPTER XXXII BROUGHT TO TERMS—CONCLUSION","content":"They had to make one change of cars and then take a stage running to Oakdale, which was but a small village four miles from Riverport. When they arrived it was close on to midday. Fortunately for them, one of the storekeepers of the village knew Mamie Jackson\u0027s married sister and also knew Mamie, and he told them where to go. It was a dilapidated cottage on the outskirts, surrounded by a garden filled mostly with weeds. \"Not very thrifty people, that is certain,\" was Mr. Bartlett\u0027s comment. \"I think I shall know the servant if I see her,\" said Randy. They paused at the gate and saw the two sisters near the side porch. One was on a bench shelling peas and the other was lolling in a hammock. Each looked very untidy and both wore wrappers that were full of holes. \"That is the servant,\" said Randy, pointing to the person in the hammock. \"And see, she has some papers in her hands!\" \"Step behind the wellhouse,\" said Mr. Bartlett, and this both of them quickly did. \"Well, go ahead and read the papers, Mamie,\" said the woman on the bench. \"Ain\u0027t no use, Sarah, I can\u0027t make head nor tail of \u0027em,\" answered Mamie Jackson. \"What do you suppose makes \u0027em so valuable?\" \"I don\u0027t know. But I do know the Bangses don\u0027t want that Mr. Bartlett to get hold of \u0027em.\" \"I think you made a good bargain with the Bangses—that is, if they pay up.\" \"I\u0027ll make \u0027em pay. Oh, Mrs. Bangs was scart, I could see it.\" Mamie Jackson laughed shrilly. \"And to think she was going to discharge me!\" \"Well, I guess you gave her a piece of your mind.\" \"So I did. She is too stuck-up to live,\" went on the former servant girl. \"When I get my money I\u0027m going to have a fine dress too—and I\u0027ll buy you one, Sarah.\" \"Oh, Mamie, will you? I want a blue silk so!\" \"I\u0027m going to have a green silk, and a parasol to match, and then—Oh, dear! look at them bees!\" And with a shriek Mamie Jackson threw up her arms and sprang out of the hammock. For the moment the papers were forgotten, and quick to take advantage of the situation, Randy darted forward and secured them. Then he turned the documents over to Philip Bartlett. \"Who are you?\" demanded the woman of the cottage, rising in alarm. \"It\u0027s that Mr. Bartlett himself!\" shrieked Mamie Jackson, forgetting all about the two bees that had disturbed her, and which had now flown away. \"Oh, how did you get here?\" she faltered. \"I came after my papers—and I got them sooner than I anticipated,\" answered Mr. Bartlett, and there was a tone of triumph in his voice. \"Are those your papers?\" asked the girl, trying to appear innocent. \"You know they are.\" \"I do not. I—I found them.\" \"I know better. You took them from where Mrs. Bangs hid them.\" \"Well, she didn\u0027t have any right to them.\" \"I know that well enough.\" \"I—I was going to send them to you,\" faltered the girl. She scarcely knew what to say. \"Really,\" returned Philip Bartlett, dryly. \"Well, I will save you the trouble.\" \"It\u0027s a shame to suspect an innocent girl like me,\" said Mamie Jackson, bursting into tears. \"My sister never did anything wrong,\" put in the other woman. \"As I have my papers I won\u0027t argue with you,\" returned Mr. Bartlett. \"But when the proper time comes you may have to explain how you happened to get the papers.\" \"Are you going to haul Mr. Bangs into court?\" \"Perhaps.\" \"Well, I will tell what I know about them, if it will do any good. Mrs. Bangs and a man named Tuller plotted to keep the papers out of your reach. They opened the safe and took the papers out just before you came with that constable.\" After that Mamie Jackson seemed anxious enough to confess and told her whole story, omitting to state how she had asked Mrs. Bangs to pay so much a month to her for keeping silent. \"We may as well go back to the town, and take the stage for Riverport,\" said Mr. Bartlett to Randy. \"I will then telegraph to Mr. Robinson to come on, and we will settle with Bangs, Tuller \u0026 Company in short order.\" \"Will you make him give up the control of the iron company?\" \"Either that or have him arrested for fraud.\" The journey to Riverport was quickly made, and the telegram sent to Mr. Robinson. The bank official sent word back that he would be on in the morning. Then Mr. Bartlett went to a hotel and Randy hurried home. \"Why, Randy, is it really you!\" cried his mother as she kissed him. \"This is certainly a surprise.\" \"I didn\u0027t expect to come home,\" said he. \"How are you and how is father?\" \"I am real well as you see, and your father is doing splendidly. He says he feels better now than for three years back.\" \"That is good news.\" \"But what brings you?\" \"I will tell you,\" said Randy, and sitting down he told his story, just as I have related it here. In the midst of the recital Mr. Thompson came in, and he listened also to what our hero had to say. \"I hope Mr. Bartlett gets what is coming to him,\" said Mr. Thompson. \"And I hope Mr. Shalley brings that Peter Polk to terms also.\" The next morning Randy received word to come to the iron works. He went and there witnessed a stormy meeting between Amos Bangs on one side and Mr. Bartlett and Mr. Robinson on the other. Randy was called in as a witness, and what he had to say made Amos Bangs gasp for breath and sink into a chair. \"You are going to expose me—to ruin me!\" gasped Amos Bangs, at last, addressing the two men who had accused him. \"We shall expose you unless you give up the control here and do as we think is fair,\" said Philip Bartlett. \"As for ruining you, I think you have about ruined yourself.\" \"But my wife, and my son——\" \"Mrs. Bangs does not deserve my sympathy after what she has done. As for your son, he can go to work, as my son has done.\" \"Bob! What can he do?\" \"Work may make a man of him. He will never amount to anything if you bring him up in idleness.\" \"It is hard!\" groaned Amos Bangs. \"I—I shall have to go to work myself!\" \"That is what I was forced to do,\" answered Philip Bartlett, dryly. \"But you will not be so badly off, Mr. Bangs. Your stock is worth at least four or five thousand dollars.\" \"Humph! That is not much. Well, I suppose I am cornered and must do as you say,\" and he gave a deep sigh. Secretly, however, he was glad to escape arrest. A lawyer was called in, and the best part of the day was spent in drawing up and signing various legal documents. The iron works were thereby placed in the control of Mr. Bartlett, Mr. Robinson, and a stockholder named Wells, and Philip Bartlett was made the general manager of the company. All of the books and accounts were placed in charge of an expert accountant, and in the end Amos Bangs had to make good a deficiency of cash. The former rich man had to give up his elegant mansion, and soon after he and his family moved to the West without leaving their new address behind them. When Randy went back to the steamboat, two days later, a surprise awaited him. An accountant, assisted by a detective, had gone over Peter Polk\u0027s affairs and discovered that the purser had robbed Andrew Shalley of between eight and ten thousand dollars. Polk had taken time by the forelock and fled. He tried to get to Canada, but telegrams were sent out, and he was caught just as he was trying to cross the Suspension Bridge at Niagara Falls. Later on he was brought back and tried, and received three years in prison for his crimes. He had nearly six thousand dollars of the stolen money in the bank, and this was turned over to Andrew Shalley. Two hundred and fifty dollars went to Mrs. Clare as part of her husband\u0027s estate. \"Bringing Peter Polk to justice is due to you, Randy,\" said the steamboat owner, after the affair was a thing of the past. \"I feel I must reward you for what you did.\" \"I don\u0027t ask any reward, Mr. Shalley. I am glad that I cleared my own name.\" \"Here is something for you, nevertheless,\" said Andrew Shalley, and handed a big document to our hero. \"What is it?\" \"It is the deed to the farm on which your folks are living. It is made out in your name. I bought the place from Peter Thompson, your uncle. Now you have something that you can really call your own,\" and Mr. Shalley laughed pleasantly. \"Mr. Shalley, you are more than kind,\" cried Randy, warmly. \"Do my parents know of this?\" \"No. You can go home over Sunday and surprise them.\" \"I will, and I thank you very much, sir.\" Randy went home, and there was a general rejoicing over the good news. But more was to follow. \"I met Mr. Bartlett to-day,\" said Mr. Thompson. \"He says they want a first-class carpenter at the iron works to take charge of the repairs He offered me the place at a dollar a day more than I am getting.\" \"Good enough, father!\" cried Randy. \"That is just like Mr. Bartlett.\" \"He said he wanted to do something for us on your account. And he sent you this,\" added Mr. Thompson, and brought out a neat silver watch and chain. It was a nice present and pleased Randy greatly. Not long after that the season on the river closed and Randy came home for the winter. As his father now had a steady place at good wages, the youth went to school, in company with Jack Bartlett, who had moved back to Riverport with the rest of his family. Randy was a good scholar and made rapid progress. \"I want you to get a good education,\" wrote Andrew Shalley to our hero. \"Then, later on, you can enter my office if you wish, or take a better place on the steamboat.\" Six years have passed since that time and Randy has finished his education. He is now the general manager for the steamboat company, and rumor has it that he is soon to marry Rose Clare, who still lives with the Shalleys. He is prosperous, but come what may, will never forget the time when he was only a deckhand. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2998/82733.html","bookId":303,"book":{"id":303,"title":"Randy of the River The Adventures of a Young Deckhand","description":"简介： The majority of stories for boys have their background laid either in the city or the country, or possibly on the ocean, and we have read much about the doings of lads both rich and poor in such locations....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2998","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
