{"id":12640,"no":20,"title":"CHAPTER III PROSTITUTION","content":"The Causes of Prostitution.—As in every commercial transaction, so also in the women-market, two factors are decisive—supply and demand. The demand arises from the fact that to men of the upper classes marriage has become difficult or impossible. Whereas in the case of the lower classes of the population, concubinage offers a substitute for marriage, so that for the men of the lower classes prostitution may be regarded as superfluous, in the case of men of the upper classes prostitution is practically the only available substitute for marriage, so that these men are led to purchase casual and temporary wives from among the women of the lower classes. The supply depends upon poverty, which is the principal cause of prostitution. By this it is not meant to imply that actual destitution is usually the direct and immediate cause of the adoption of a life of prostitution. It is rather that a number of factors, the outcome or the accompaniments of poverty, combine to place girls in a position very favourable to their becoming prostitutes. The environment in which proletarian children live is an unfavourable one in the matter of sexual relationships. It is one which prepares girls for prostitution, and makes them very liable to adopt this mode of life. They are forced to live in a single room with the other members of a large family, with strangers, and even casual night-lodgers—a room in which they all cook, eat, sleep, and practise sexual intercourse. The girls even have to share a common bed. Thus there is no place in their experience for the sentiment of shame. In addition, proletarian children often form evil associations at a very early age, and become acquainted in very early childhood and in the dirtiest possible manner with all the[250] circumstances of the sexual life—with the most offensive and unclean, the most abnormal and morbid excrescences of the disordered sexual life. Many women would never have sunk into the slough of prostitution had their upbringing been a different one. Often enough the pressure of poverty even leads parents to make money out of the procurement of their own children. The great majority of prostitutes are recruited from the class of young maid-servants. Maid-servants pass their childhood in country villages. Even to-day, in some countries, most of them can neither read nor write. They are not only unintelligent, but thoroughly simple; naturally they are easily seduced. In the country circles from which the great majority of them come, premarital sexual intercourse is hardly regarded as immoral, and is an almost universal custom. The girls bring these ideas with them to the town, with results that are necessarily disastrous. In most cases they are completely cut off from their parental homes, and lack the firm support given by a well-ordered family life, are sent from the country into a strange and incomprehensible world, and live under one roof with persons belonging to a social class by whose members they are regarded as being of inferior birth. They pass their new lives in a circle in which the demands are far higher than they have been accustomed to; imitatively, they soon come to share these demands, but can satisfy them only by the supplementary earnings of shame. By the men of the household, most often by their employer or his sons, they are seduced, and then left to fend for themselves. They seldom stay long in one situation; and when out of employment, especially if they have formed bad associations, they are exposed to the gravest moral dangers. Their hours of work are unlimited, and for this reason they wish to live as intensely as possible during the few and scanty hours of liberty. Their legal position is a very unfavourable one, and it is practically impossible for them to organise themselves in a trade union. They form a servile class. Their personal desires are continually repressed, and even this is but a preparation for their subsequent profession, in which servility and repression will be their fate. [251] Prostitution and Child-Protection.—Prostitution explains and favours the development of numerous factors which make the work of child-protection an ever-existing need. These factors are: (a) criminal offences against persons under age; (b) venereal diseases; (c) a fall in women’s wages, and a consequent fall in men’s wages also; (d) corruption of the sexual morals of juveniles; (e) the fact that prostitutes, though somewhat exceptionally, bear children. (a) The definite purpose of certain criminal offences committed against women under age is simply to supply fresh and new wares for the market of prostitution. For it is not only or mainly women who, in respect of physical beauty, age, or of some other circumstance, are of comparatively little value, that become prostitutes. Among the men who have recourse to prostitutes are some who can pay high fees, and therefore demand an article of high quality. Among these latter, there are, of course, some who actually prefer experienced prostitutes. But most of them demand especially physical beauty, and this is more likely to be possessed by younger women than by older ones. A considerable proportion of prostitutes are under legal age; a large majority of them have entered the career of professional prostitution before coming of age. An adult woman is much less likely than one under age to become a prostitute. Statistical data bearing on this question are, however, lacking. The white-slave traffic has to-day attained gigantic proportions; the sources of this traffic are supplied by professional procurement, a branch of industry in which many thousands are engaged. It is obvious that the young girls who will attract the attention of the professional procurer or procuress will, for the most part, belong to the proletariat. (b) Prostitution is an unceasing source of the venereal diseases, the character of these in any district being intimately associated with the characteristics of prostitution in that district. The principal seats of prostitution are the true foci of the venereal diseases. (c) The matter of women’s wages has already been discussed.[7] [252] (d) Prostitution leads to the corruption of children’s morals and drags them into vicious courses. Prostitutes usually live in those quarters of the town, in those streets, in those houses, in which the population belongs mainly to the proletariat. It is utterly improper that prostitutes should live in the same house with persons who have young children. Indeed, the question arises whether prostitutes should not be absolutely forbidden to live in any house in which there are persons under age. (e) No official statistics exist to show how many children are born to prostitutes. According to certain private statistical data, collected in large towns, two children are born each year to every hundred prostitutes. Many regard it as inexplicable that prostitutes, who have sexual intercourse so often, should so rarely become pregnant. But it is precisely on account of over-use that the female reproductive organs, in these cases, lose their functional reproductive power. Where everyone walks, the grass never grows. Moreover, there is no necessary association between coitus and conception. In most cases, alike in the prostitute and in the man who has intercourse with her, the idea and the desire of procreation are non-existent. Many make excuses for prostitution on the ground that, since prostitutes seldom have children, we have here a counterpoise to illegitimate births. But it is statistically proved that where prostitution is general—as, for example, in great towns—illegitimate births are commoner than in the country, where prostitution is practically unknown. We need not stop to consider here whether the wider diffusion of prostitution would be more desirable than the occurrence of a greater number of illegitimate births. It is obviously necessary that the children of prostitutes should be removed from the care of their mother and brought up elsewhere. Those who regard every prostitute as a degenerate being will reject a priori any attempt to rescue them. It is a fact of experience that attempts to reform prostitutes are rarely very successful. Experience shows also that the reformatory education of boys is more effectual than the reformatory education of girls, and that such an education gives better results in the case of girls who are merely[253] neglected than of those who are morally fallen. But this difference is not due to the fact that prostitutes are congenitally degenerate, but simply to the fact that they have become degenerate owing to the conditions of their life. For in women a life of prostitution develops all those qualities—laziness, love of adornment, hypertension of the sexual impulse, \u0026c.—which make it impossible for people to earn their bread by regular work. As soon as the girl is subjected to the supervision of the police des m?urs, she is for ever lost. The supervision breaks down completely her power of resistance, exposes her to contempt, and permanently excludes her from what is called respectable society. For these reasons, girls under age should on no account be subjected to the supervision of the police des m?urs. Precisely because it is almost impossible to induce a prostitute to adopt any other mode of life, we must, in our campaign against prostitution, devote ourselves above all to those prophylactic measures by which girls may be withheld from the first steps which will lead ultimately to the marketing of their bodies. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2854/78740.html","bookId":1212,"book":{"id":1212,"title":"The Elements of Child-protection","description":"简介： During the latter half of the nineteenth century, the importance of child-protection gained a far wider recognition.The nineteenth century has been well named The Century of the Child. But there are reasons no less cogent for describing this century...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2854","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
