{"id":12641,"no":21,"title":"CHAPTER IV PUNISHABLE OFFENCES AGAINST CHILDREN","content":"The Two Groups.—Previously we have spoken of punishable offences committed by children; we pass now to consider those committed against children. These latter may be classified in two sub-groups. To the former group belong the punishable offences in which the primary aim is to injure or destroy a child. To the latter group belong offences against children in which the injury to the child is incidental. The precise line of demarcation between these two groups differs in the legal systems of different countries. The most important offences in the former group are: infanticide, the exposing of children, abortion (these three crimes occur chiefly in connection with the birth of illegitimate children), criminal offences against the chastity of women (for example, rape, seduction, procurement). It is only with regard to offences in this first group that statistical data are available. In association with the development of capitalism, there has been a great increase in their number. But, according to official statistics, there is not one of the offences above specified which occurs to the extent of 1 per cent. of all criminal offences; most of those named are considerably less than 1 per cent. In the case of the other criminal offences, only private statistical data are available. In respect of the offences comprising the second group, the important questions arise, whether there exist any mitigating or aggravating circumstances, such as that the offence was committed against a child, and not against an adult, or that it was committed, not against a stranger, but against one for whose instruction or upbringing the offender was responsible. Is it not desirable that the circumstance that the criminal offence was committed against a child should be stated in the law expressly as a reason for an increase in the severity of the[255] punishment, or else that the law should give children, precisely because they are children, a higher degree of protection against certain offences? Owing to the fact that young people, in consequence of their physical weakness, are much less able than adults to resist aggression, there is every reason for the preferential legal protection of children. The protection should, indeed, be more effective the younger the child. For example, a child of ten can call for help, and can run away, but an infant is utterly defenceless. Punishable offences against children need to be severely punished, because they betray the existence of a coarse and rough disposition in the offender. It must be regarded as an aggravating circumstance when the offender is the person responsible for the child’s upbringing. And yet the criminal offences of parents, guardians, foster-parents, and teachers, against the children under their care, are often nothing more than a misuse in all good faith of the authority entrusted to them. Simply in the interests of the child, severe punishment is often undesirable, because of the rancour against the child it would tend to arouse. (These questions are of importance only so long as the practice continues of passing determinate sentences. The introduction of the indeterminate sentence, which is in line with the tendency of evolution, would render these questions unimportant.) If any offender whose conduct against a child has proved him to be incapable of exercising with propriety parental authority, the powers of a guardian, the powers of a foster-parent, the duties of a teacher, it is essential to deprive him of these powers without delay; and this should be done, not only in the interests of the particular child, but in the interests of all children. Anyone who has committed a serious punishable offence against a child is, as a rule, altogether unfitted to exercise authority of any kind over any children. If the offender is punished, and thereafter the child is left in his power, the child will usually become the object upon which he will work off the rancour inspired by the punishment. It is essential that this change in the guardianship of the child should not be postponed until the case is decided and judgment is passed, but that it should be effected immediately it is thought necessary to institute proceedings. The objection[256] that the right to remove a child from the care of an offender properly belongs, not to the criminal court, but to the Board of Guardianship, is invalid. The procedures rendered necessary in consequence of the initiation of the criminal proceedings cannot, in these cases, be distributed among various different authorities. In most instances it is essential to act at once. Authority over a child, in a modern State, is not essentially different from an official position. Since our criminal courts are empowered to decree any one’s unfitness to hold an official position, and to deprive any citizen of his civil rights, why should they not also be empowered to decide that certain persons are unfitted to exercise authority over children? The courts have the power to declare that through the loss of civil rights a man has become unfitted for the position of an official guardian; a teacher in a State school loses his position ipso facto if convicted of a criminal offence; why should not the criminal courts have the power to deprive parents, foster-parents, and private teachers of their “office,” and to declare them to be unfitted to hold it? The great majority of punishable offences against children are committed against children of the lower classes. Infanticide.—By infanticide we understand the deliberate killing of an illegitimate child by its mother during or immediately after birth. For the following reasons, it is necessary that this offence should not be punished with extreme severity: (a) in the act of parturition the mother’s physical and mental equilibrium is disturbed, so that her condition must be regarded as one of diminished responsibility; (b) in the act of parturition the unmarried mother is influenced by the dread of disgrace, and by fears as to the child’s future, in ways from which the married mother is free; (c) neither the secret and indiscriminate reception of illegitimate children into foundling hospitals, nor the most severe punishments, suffice to prevent the commission of this crime. (In France, for example, infanticide is punished with the greatest possible severity, but this does not prevent the commission of the offence. For, in the first place, since in France inquiry into paternity is forbidden, during parturition the fears of the unmarried mother as to the future of the child are exceptionally distressing. In the second place, since the[257] jury know that the offence will be punished with draconian severity, they prefer to return a verdict of Not Guilty.) We do not find, in every modern State, such an attitude towards infanticide. There are certain countries in which infanticide is even more severely punished than the murder of an adult. In the country, infanticide is comparatively commoner than in towns, this difference being connected with the fact that in the country districts there are no foundling hospitals, and with the fact that in the country criminal abortion is less frequently practised than in the towns. There are certain children with respect to whom medical science indicates, beyond the possibility of a doubt, that it is impossible for them ever to become useful members of society; indeed, in the case of many of them, it is obvious that their existence is directly harmful to the species—for example, cripples, high-grade cretins, idiots, and children with gross deformities. But at the present day such children are preserved to lead a life of martyrdom. The greatest possible pains and the highest refinements of medical skill are employed to keep them alive. Huge institutions are erected for their care, and there is great rejoicing if, after years of laborious efforts, some of these small unfortunates have been taught to speak or write a few words. This procedure is a grave infringement of the law of parsimony (see the first paragraph of Chapter V. in the General Part), if only for the reason that in other departments of social life, with the same expenditure of effort, far greater and more valuable results could be obtained. When such children, for one reason or another, find their way into the world, they should be quickly and painlessly destroyed. What method should be adopted to attain this end is a minor consideration. The most suitable plan would appear to be that, after a thorough expert medical examination, such children should be killed by a swift and painless narcotic. For the present, we may leave the question open whether the consent of the parents should first be obtained. According to the moral conceptions of to-day, not only do people shrink back when such energetic measures are proposed, but every act by which individuals, however worthless, are sacrificed in the interests of the species, is regarded as immoral, and even as a punishable[258] offence. But just as to-day we treat certain individuals whose conduct endangers the present generation in such a way as to deprive them of opportunities for doing further harm, so also should we deal as seems best from the social point of view with those individuals who are useless to society, or may be harmful to future generations. As soon as it is generally understood that the interest of future generations is at least as important as that of the present generation, that the interest of the species is more important than that of a few individuals useless to society, and as soon as the number of cases in which such destruction of children is desirable has been greatly diminished owing to the adoption of appropriate preventive measures, it will be regarded as a necessary and moral act to put an end to these defectives. Abortion.—Abortion is common in every age. In ancient times, amongst the majority of peoples, it was not considered a punishable offence. Even in Christian Europe, down to the eighteenth century, it was not punished when the act was performed within ten weeks of the occurrence of conception. The explanation of this is that during the earlier stages of development the embryo was not supposed to possess a soul. To-day, abortion is a punishable offence, but is none the less extraordinarily common. Official statistics make no approach to completeness, for the great majority of abortions remain secret. An expert to-day, owing to the gigantic advances in surgical technique, can procure abortion without either difficulty or danger. In every large town there are numerous doctors who specialise as abortionists. Even the midwives do not hesitate to undertake such manipulations. In every populous resort will be found large institutions where women are given an opportunity for concealing the consequences of illicit intercourse by the practice of abortion. Where conception has occurred in a married woman, it may be fear for the future of the child, of a lowering of the standard of life of the family, or of the act of parturition, which leads to the practice of abortion; where the pregnant woman is unmarried, fears as to the future of mother and child may also be operative, but the principal motives are the dread of disgrace and the desire to conceal the fact that[259] pregnancy has occurred. Among women of the proletariat it will readily be understood that abortion is carried out less skilfully than in the case of women belonging to the well-to-do class, for proletarian women are unable to pay for such highly-skilled assistance. It is for this reason that a much larger proportion of criminal abortions are discovered in the case of proletarian women than in the case of the well-to-do. The number of abortions is comparatively greater in the towns than in the country, and the technique of abortion is a more skilful one in the former districts than in the latter. It has recently been advocated that abortion should no longer be regarded as a punishable offence. Others are satisfied with the proposal that the mother should be left unpunished. These proposals are supported by the following arguments. The existing law is altogether inefficient, for it attacks not the act in itself, but merely the poverty of the doer and the clumsiness of the act. The punishment of abortion is especially unjust: (a) when the act of intercourse has been effected against the will of the woman who has been impregnated—for example, in case of rape; (b) when abortion is indicated on special grounds of health—for example, when the health or life of the mother is seriously threatened by pregnancy or parturition, and there is no doubt that the life of the mother is more valuable than that of the child; (c) when there is no doubt that the child, if born at full term, would be weakly, diseased, useless, or even injurious to society—for example, when a person suffering from severe insanity or chronic alcoholism impregnates a woman, or when an insane, epileptic, or imbecile woman becomes pregnant. (As to certain other arguments which are put forward, such as that everyone has a perfect right to the disposal of his own body, and that for this reason the prospective mother can deal with the fruit of her womb precisely as she pleases; or that, according to the biogenetic law, the embryo is not a human being, but a lower animal—no importance need be attached to them. They are altogether superfluous.) As yet there is no country in which these views have been incorporated in legislation, but the time cannot be far distant in which this will take place. Of course, when this happens,[260] abortion, if effected by a married woman, without sufficient cause, and without the consent of her husband, would have to be regarded as an adequate ground for divorce. The Protection of Feminine Chastity.—The criminal laws of to-day recognise only the more serious offences against the chastity of women, such as rape, seduction, gross instances of procurement, and so on. The aims at reform in this connection are as follows. Feminine chastity, above all as far as young girls are concerned, demands much more effective protection than it receives to-day. The age of consent—that is, the age below which intercourse with a woman is in any case a punishable offence—should be raised at least to eighteen, since protection is needed, not merely for the age of bodily immaturity, but also for the period of the puberal development, the dangerous time during which the sexual impulse is awakening. Not only those should be punished who have effected intercourse with a woman by force or under stress of threats, but also those who have effected intercourse by fraudulent means, by promise of marriage, or by taking advantage of the woman’s dependent position (as in the case of employer and female employee or master and maid-servant). Procurement, in the legislation of most countries, receives a ridiculously mild punishment; and in order to restrict the growth of the white-slave traffic, which, as previously pointed out, has now attained colossal dimensions, it is essential that any one who procures a child for sexual purposes should be punished very severely. Those also should be punished who perform improper acts in the presence of an immature person, or who show such a person obscene pictures, or tell obscene stories, or the like. Boys, on account of their sexual inexperience, need the protection of the criminal law no less than girls. Maltreatment of Children.—Maltreatment of children belongs to the second group of punishable offences against children. It is rare for the offender to maltreat the child of a stranger; the offence is usually committed against a child for whose care the offender is responsible. The principal kinds of maltreatment of children are—(a) corporal chastisement; (b) improper behaviour towards children (in this connection the[261] question arises whether parents can commit an offence against the honour of their own children); (c) working children to excess, either in the form of overwork at school, excessive domestic work, overwork at wage-earning, forcing children to beg, and the like. Begging is more lucrative in proportion to the degree to which the child’s appearance is calculated to arouse compassion—the poorer, the more miserable, the more delicate it looks. In actual fact, a child is often ill-used simply in order to give it an aspect which will arouse more sympathy. Frequently a minimum amount of money is fixed, which, under fear of punishment—usually gross physical ill-treatment—the child has to bring home as a result of its day’s begging. In large towns children are hired out to professional beggars; in such towns as Paris and London there is actually a regular market for such children. The child employed for purposes of begging suffers many moral disadvantages; it becomes crafty and obstinate, acquires a dislike for work and a love of enjoyment, \u0026c. The general public, which squanders money freely in almsgiving to child beggars, gives without thought of the consequences. It is less trouble to drop a few coppers into the outstretched hand of a mendicant than to undertake a thorough investigation of the case, and, if necessary, to remove the child from the corrupting influences of its present environment, and to see that it will be properly cared for in future. Mendicancy frequently leads to criminal courses, more especially to offences against property, and in the case of girls to offences against sexual morality. The immediate causes of the maltreatment of children are the following: (a) Illness or delicacy of the child; (b) illness or nervousness in the parents; (c) interested motives; (d) a rough disposition and incapacity for education on the part of the child; (e) improper views concerning education; (f) alcoholism; (g) exaggerated religious ideas; (h) sexual causes; (i) unhappy conditions of conjugal life. (a) Parents are much more likely to ill-treat sickly or weakly children than healthy ones, for the former much more readily prove a burden than the latter. Feeble-mindedness, moreover, is difficult to recognise, and is often regarded by[262] the parents as obstinacy or naughtiness. It is a painful fact that in many cases the parents are themselves responsible for the defective intellectual equipment of their child, and yet it is on account of this very defect that they ill-use the child. (b) Delicate and nervous parents are much more likely than healthy ones to ill-treat their children. In the case of parents who are mentally unsound, the lust of cruelty may be a direct outcome of their mental state. (c) In many cases children’s lives are insured for a considerable sum, and in this case the death of the child may be desired by the parents for the sake of the insurance money. This happened very often in the manufacturing towns of England, until the matter became the subject of special legislation. Sometimes parents ill-treat children in the hope of inheriting money belonging to these latter. (e) The view is very general that the corporal punishment of children plays an essential part in the process of education. The child becomes to some extent accustomed to such punishment, whereby the punishment ceases to be effective; as a result of this, yet more severe punishment is inflicted. (f) Alcoholism is a cause, both direct and indirect, of the maltreatment of children. The father of a family who, in a state of intoxication, will maltreat his family, and who, when sober again, is bitterly ashamed of himself, is a familiar figure. (g) Maltreatment of children (especially by clergymen, monks, and nuns) often depends on the belief that it is necessary to mortify the flesh in order to save the soul. There is also some connection between exaggerated piety and sexual perversion. (h) A quite considerable proportion of cases in which children are maltreated are dependent upon sexual motives. But the maltreatment of a child may give rise to sexual excitement, not only in the active agent, but also in the passive. Cases of this nature occur chiefly in the upper classes. (i) In an unhappy marriage, one of the parents will often maltreat the child simply because the latter loves the other parent. [263] Ill-usage of children may be the act either of relatives or of strangers. Among the relatives, we have first of all the unmarried mother; secondly, the natural father; thirdly, the stepmother; fourthly, the lawful parents. Among strangers, we have chiefly to consider teachers and foster-parents. (a) Among children suffering from gross ill-treatment, we find a preponderance, in view of their respective numbers, of illegitimate as compared with legitimate children. (b) We are always told that an illegitimate child will be horribly ill-treated if its mother marries, not the child’s father, but another man. It will be ill-treated by the man because it is a stepchild, and by the woman because it interferes with her relations to her husband, and awakens unpleasant memories. But these views are exaggerated. (c) The r?le of the stepmother is also commonly exaggerated. It is easier to excuse a stepmother for ill-treating a child than it is to excuse the child’s own parents. When all is said and done, it is impossible to expect a stepmother to have the same love for the stepchild as for the children of her own body, and it is only natural that the stepchild which stands between her and her husband should be differently treated from her own children. A stepchild is certainly more likely to be ill-used when the stepmother has children of her own. (d) A mother is more likely to ill-treat children than a father. The father cannot love children so well as a mother, nor can he hate them to the same extent. (e) Many teachers maltreat their pupils. They are seldom prosecuted on this account, for many children are unfortunately accustomed to the same sort of ill-treatment at home; moreover, the parents may regard the teacher’s treatment as perfectly natural, or may be afraid to institute proceedings against him. (f) Ill-treatment of children by foster-parents is comparatively common, owing to the fact that in this case the inhibiting influence of the natural love for the offspring is lacking. The consequences of maltreatment are extremely serious to the health of the child, alike physically, mentally, and morally.[264] The child becomes naughty, lazy, and untruthful, and this results in yet more maltreatment. The child’s affection and confidence are destroyed, not only towards the person who ill-treats it, but towards others as well; feelings of hatred towards the whole of society and desire for revenge may even be aroused. Such a child will in turn maltreat other children; its will-power is defective and its ambition is destroyed. Actual disease, physical or mental, often ensues. Many children run away from home as a result of ill-treatment, become vagabonds, and even commit suicide. The increase recently noted in the number of suicides is probably, in part, dependent upon the more frequent ill-treatment of children during the same period. The usual motive for suicide where children are concerned is seldom anything else than the fear of ill-treatment. (Dread of parents, of school, of punishment at school, of examination, \u0026c.) Most of the cases of the maltreatment of children take place among the lower classes of the population. This is clearly proved by statistical data, which show that more than 90 per cent. of those convicted of maltreating children belong to the lowest strata of the population. (a) Among the lower classes, the r?le of the child is a very different one from what it is among the upper classes. It often makes its appearance, not as the greatly-desired heir, the inheritor of an honoured name, or of considerable property, but merely as an additional mouth, whose presence forces the parents to lower yet further their already low standard of life, and entails upon them numerous other inconveniences. (b) The lower classes are less cultivated, rougher, more passionate, less gentle, than the upper. They work all day, and we need not be surprised if they become rough and disagreeable. The proletarian parent has not received a proper education. (c) Far more commonly they are slaves to alcohol. (d) They are subordinated to everyone. The only persons to whom they can display power and superiority are their own immediate dependants. (e) They come into far more intimate contact with their children, and are not in a position to hand over the upbringing[265] of their children to salaried persons. In this connection we have to remember that the presence of strangers in the house tends to put a check upon maltreatment. (f) They find it essential that their children should begin to earn money very early in life. The circumstances in consequence of which the part played in the maltreatment of children by the lower classes appears to be even greater than it is in actual fact, are as follows. (a) In the case of the lower classes, maltreatment of children takes the form exclusively or almost exclusively of gross physical misusage. In this form the maltreatment of children is more obviously apparent, and is legally punishable; whereas more subtle but in fact worse modes of ill-usage are less easy to discover, and many of them are not legally punishable. (b) Owing to the housing conditions of the lower classes, the maltreatment of children is in their case far less likely to remain secret. (c) People are readier to lodge an information and to institute criminal proceedings when the offender is poor than when he or she is well-to-do. Where the effects of capitalism have been most marked—that is to say, in the large towns—the maltreatment of children is commoner, and takes worse forms. The maltreatment of children occurred in very early times, but no particular importance was then attached to the matter, owing to the sacred character in those times of the institution of the family. Far from being an indispensable part of the education of children, their maltreatment is a direct hindrance to a good education. In the discovery and the prevention of the maltreatment of children, teachers, medical practitioners, and private associations play a very important part. A teacher is able to observe whether a child is ill-used, and is also in a position to obtain information from the brothers and sisters of the child. The useful work the teacher can do in this regard can be powerfully supported by the school physician. Societies for the Prevention of Cruelty to Children are both influential and important, especially in England and the United States of America. To the latter country we owe the institution of Children’s Courts. In England, it may be, that so great importance is attached to efforts for preventing[266] the maltreatment of children, owing to the fact that in that country the position of the illegitimate child is an exceptionally bad one. The following measures are recommended for the prevention of the maltreatment of children. (a) Cruelty to children on the part of those legally responsible for the care of such children must be the subject of official prosecution. (b) Parents who maltreat their own children must at once be deprived of their parental authority, for unless this is done, after they have been punished, the parents will be likely to maltreat the child more than ever, merely taking more care to avoid discovery. (c) It should be made the legal duty of anyone who becomes aware of a case of cruelty to a child to lodge official information without delay. Children are not in a position to protect themselves against adults, nor are they able on their own account to initiate proceedings against anyone who has misused them. This difficulty is especially great when the offender is one upon whom the child is legally dependent. Suggested Reforms.—Recently the necessity has been recognised that many offences against children should be punished much more severely than they now are, and that many acts not otherwise punishable should be made punishable if committed against a child. (a) It is suggested that a new criminal offence should be defined in the following terms:—“A parent, 1, who, although possessed of the requisite means, fails, wilfully or neglectfully, to provide for the child’s proper maintenance; 2, who, in consequence of a disorderly life, is rendered unable to provide for the proper support of his child; 3, who neglects his child—shall be punished in the following manner.... A guardian or a foster-parent shall have the same liabilities to punishment under this clause as the real parents of a child.” (b) It is suggested that, in the case of offences against the laws regulating child-labour, the criminal legal authorities, and not the local authorities, should have the right of intervention, that in the case of the graver breaches of these laws, the offence should be regarded, not as a petty offence, but as a misdemeanour, or as a crime, and that, for this reason, the[267] description of these offences should be incorporated in the criminal code. (c) It is suggested that the employment of children in mendicancy, vagabondage, \u0026c., which is at present treated as a petty offence merely, should be constituted a misdemeanour. (d) It is proposed to make it a punishable offence to supply, or cause to be supplied, in a public place, to any juvenile, alcoholic drinks whereby that juvenile becomes intoxicated. (e) As regards the sale of tobacco, similar legal provisions are considered desirable. (f) It is suggested that parents should be severely punished, when in the case of one of their children being ill they fail to summon medical advice, or when they send the child to school suffering from one of the acute infectious disorders, or from a house in which any such disorder prevails. With regard to the first recommendation (a), people begin to recognise that a misuse of the rights and powers involved in parental authority must be visited, not by private condemnation only, but by that of the criminal law. It is seen that the standpoint of the existing law, by which only the gravest offences, such as the abduction of a child, or the infliction upon a child of grievous bodily harm, are specified as punishable, is inadequate. Ever more general becomes the demand that parental neglect of the proper maintenance or education of a child should be constituted an offence per se, and dealt with as such. It is only in the case specified in (a) 1 that deliberate or gross neglect constitutes the essential quality of the offence. (If all cases of neglect were punishable, the provision (a) 1 would operate chiefly against offenders of the lower classes, since it is in their case that such neglect most commonly occurs.) In (a) 2 deliberate or gross neglect is no essential part of the offence, because the idler, the man led astray by his passions, \u0026c., should not escape punishment. In (a) 3 simple neglect is made punishable, because in such cases the community becomes responsible for the maintenance of the child. Nothing must be done to encourage what is really quite common—that parents should neglect their child, simply in order that it should be taken away from their care, and that in this way they may be freed from the burden of its[268] maintenance. It is essential that no complaint by the injured party or his representatives should be requisite to the initiation of a prosecution, for in most cases the child is itself unable to complain, and the legal representative is often the prime offender. Moreover, it is not the child alone that is injured, but also the State, which has entrusted the offender with the care of the child. The objection has been raised that such legal provisions as have been suggested would be directed principally against the lower classes, that they would often lead to the unjust infliction of punishment, that no one can be compelled to love another, and that it would be difficult to determine the precise point at which the proper limits of parental authority had been exceeded. But all these objections are invalid, if only the gross cases that have been mentioned are made punishable, and provided that wherever necessary the child is removed from the care of the offender. With regard to (b), it is altogether disproportionate that the most trifling bodily injury to a child should be legally punishable through the instrumentality of the criminal courts, whilst one who inflicts a far more severe injury upon a child by forcing it to perform excessive and unsuitable work is liable to nothing more effectual than a reprimand on the part of the local authority. The local authority is seldom in an independent position, but is commonly subject to the influence of large employers of labour. The maximum punishment which can be inflicted for a breach of the laws regulating child-labour is so trifling, that the risk of this punishment is far more than counterbalanced by the profits the employer can make by the illegal exploitation of child-labour—especially when the fact is borne in mind that not one instance in ten of a breach of these laws is ever the subject of a prosecution. The gross injustices and miseries which occur daily and everywhere from the improper exploitation of child-labour will not disappear until the punishments inflicted are such as the employers will seriously fear to incur, and which they will be unable to avoid. The employer laughs at a fine, for he pays it out of his surplus profits; but he will think twice before incurring the risk of imprisonment. [269] With regard to (d), since alcohol affects children more powerfully than it affects adults, it is necessary that it should be a legally punishable offence to expose children to the dangerous influences of this intoxicant. With regard to (e), for the young, the use of tobacco is hardly less harmful than the use of alcohol. With regard to (f), it sometimes happens that the parents fail to take the steps absolutely essential to the preservation of the child’s health, and in this way the public health may be seriously endangered. The proposals mentioned under these last three headings, (d), (e), and (f), are as yet hardly realised anywhere; but there are good grounds for hoping that they will soon be adopted in more countries than one. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2854/78741.html","bookId":1212,"book":{"id":1212,"title":"The Elements of Child-protection","description":"简介： During the latter half of the nineteenth century, the importance of child-protection gained a far wider recognition.The nineteenth century has been well named The Century of the Child. But there are reasons no less cogent for describing this century...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2854","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
