{"id":103108,"no":1,"title":"Page 1","content":"Prologue\n September 1879\n Sally Louisa Tomkins stood her ground. She jerked her elbow free from the congressman’s hand and refused to take even one small step toward the door. Instead, she planted her feet on the speaker’s stand and turned on him, pointing a finger between his eyes. “I came here at your behest, Mr. Caperton, but I will not stand for your disrespect.”\n “Captain Sally,” he tried, reaching for her elbow again, but missing, as the tiny dark-haired woman ducked out of his reach.\n “Nor your condescension, thank you very much. I came to say my piece. I was invited to say my piece—”\n From the second row on the left, Herschel Cobb interjected. “You were invited to discuss your hospital.”\n “And so I am,” she fired back. “If you don’t like my report, that’s well and good. It’s a terrible report, one that I hate to make—but my facts and figures are true! Gentlemen, we have an epidemic on our hands. One that the Robertson Hospital is neither equipped nor prepared to fight.”\n “Don’t sell yourself short, Captain. We have great faith in you,” assured Francis Pugh, in the third row on the right. He smiled indulgently, his muttonchops stretching across the wide expanse of his fleshy pink cheeks. “Your rank is testament to that.”\n She sneered, and took one measured step away from Boyd Caperton, who opened his arms as if he might ask her to dance. “Apparently my rank is meaningless here.” And before the gentle hems and haws of protest could rise loud enough to drown her out, she declared, “For nineteen years I’ve served the Confederacy. Nineteen years, I’ve made this work my life—taking no husband, bearing no children, and bankrupting myself in the bargain. I’d do it again in a moment, because it’s good work. I’ve saved thousands of men. Tens of thousands, and still counting. I keep them clean; I feed them and bathe them and stitch their wounds, hold their heads while they bleed and cry. And most relevant to this testimony, I watch them. And I know what I’ve seen! You can’t make this go away by pretending I’m a madwoman!”\n Senator Landon Barksdale rose from his seat. “Miss Tompkins, no one is accusing you of being a madwoman.”\n “Yet you treat me like a liar or a scoundrel. And a fine irony that is, as I stand here before your Congress.” She spit out the word, and eyed Mr. Caperton, who hovered about her now as if he wasn’t entirely sure how to proceed.\n Praying that he wouldn’t make another, more aggressive grab, Captain Sally turned her back and addressed the assembled men. “You sit there behind your little desks in your fine suits and act like you understand this war and these soldiers more fully than I do … but every last one of you knows better than that. Josiah Snead, I see you creeping toward the door like you’re trying to escape me—you, sir. It was your son who picked up three bullets in Henegar; and everyone said he’d die, didn’t they? But they got him to me, and where is he now? Home with your new grandson, unless I’m mistaken. And Wellers Chrisman, don’t you hide your head. Your brother would’ve died without the attention he received at the Robertson. Morgan Cluskey, your father wouldn’t be here without me. Charlie Hartridge, your nephew. Robert Batson, your sons—both of them!—still walk this earth because of me.”\n She glowered at them, her gaze darting from face to face.\n She knew them all, in some fashion or another. She’d received letters from many of them, begging, accompanied by money, all of them essentially the same: “They say this man is done for, but at the Robertson he may have a chance.”\n When they prayed to God, they prayed for her.\n And still they treated her like a fondly regarded pet, a reliable watchdog, or a steadfast mule.\n While she still had them stunned into uncomfortable silence, she lowered her voice, steadied it, and continued. “Out on the western coast, in the Washington Territory, a substance seeps from the ground—a toxic gas, which kills anyone who breathes it. But the people it kills don’t lie down and rot. They walk, they hunt, and they feed. The gas is largely confined to a walled, partially abandoned city called Seattle, but its ill effects have scaled the walls and headed east in the form of a drug—sometimes called sap, sometimes saffron—which has become terribly popular with fighting men on both sides of the Mason-Dixon.”\n “Conjecture!” cried Morgan Cluskey, who sat back in his chair with an impatient sigh.\n His sigh gave Boyd Caperton the nudge he needed. Caperton caught Sally’s arm again, and this time, she could not shake him loose.\n As he determinedly, carefully ushered her off the speaker’s stand, she called out over her shoulder, “Men are dying—more men than I ever saved at the Robertson! And if you think”—she tripped over Caperton’s foot, and recovered—“if you think it’ll stop with the soldiers, with the poor men from the Southern fields and the Northern factories, you’re idiots, every last one of you! The problem grows bigger every day.”\n “We’re aware of this drug, Captain Sally,” said Wellers Chrisman. “But it’s a Union problem. Who cares if the illiterate Italians blast themselves senseless?”\n Frantic now, she grabbed the edge of a table. That bought her another few seconds while her escort tried to figure out how to more forcibly accost a lady without being too ungallant in front of God and everybody.\n “Exactly how many Union soldiers do you think I treat at the Robertson, Mr. Chrisman? It’s our boys, too, and we’ve got fewer of them to lose. Take off your blinders and take action while there’s still time. Gentlemen, the world will judge us by the steps we take right now. The whole globe is in danger!”\n Her grasp on the table edge failed. She lost a few steps, then caught herself on the door frame. But before Caperton pushed her out with absolute finality, he bowed his head so that his lips came close to her ear, and his breath lightly tousled the stray curl that dangled there. “Captain Sally, you put us in a difficult position.”\n She turned her head so fast that it cracked his face. “More difficult than mine?”\n He let go of her, then, so he could hold his nose, waiting for it to start bleeding. It didn’t, so he removed his hand. “This isn’t a problem of war. It’s a social issue.”\n “It’s a disease!” She tried another angle, pleading now. “A disease spread by soldiers, not so different from cholera or typhoid. That makes it an issue of war, does it not?”\n “Not on the word of one nurse.”\n “One nurse, fine. What about two? What about a dozen? A thousand? How many nurses will it take, Mr. Caperton?”\n “You’re missing the point. Bring me a doctor, and let him testify. In the meantime, the Confederacy thanks you for your service, but you must return to your duties and let the men run the war.”\n “Which you’ve done a bang-up job of thus far.”\n He didn’t answer. He only shepherded her through the last great door and shut her out of the proceedings with heavy, slow calmness.\n He leaned against the door then, holding it shut even though she no longer pushed or knocked. All eyes were on him. He wiped at his nose once more, in case it’d begun to bleed after all. But no. He was not injured, just unsettled. He cleared his throat. “Gentlemen. Now that the matter is resolved, let us return to business.”\n The room sighed its relief with a rustle of papers and the creaks of men shifting in their seats, suddenly more at ease. The fifteenth Congress of the Confederacy was in session still, in its enormous hall with gilt ceiling, leaded and colored glass windows, and polished wood trim—all designed to advertise and reassure that Danville was not finished, and certainly not broke.\n In the far corner, a young man still in his teens wrote feverishly, recording the minutes in his cleanest Pitman shorthand. He captured every word faithfully, scrawling like a phonography racehorse, noting the last bits of the tense exchange between Captain Sally and Congressman Caperton. He even dutifully included the muttered gripe of Robert Welch, who’d complained, “Shouldn’t have let a woman address the floor in the first place, rank or no rank. Let her take her pride in it, but give her no privileges apart from cashing checks.”\n Above and behind the stenographer, on the second-story balcony that ran around the congressional hall, a board creaked under a finely heeled boot, and a spindly white cobweb was swept aside by the long hem of a cotton skirt.\n This woman did not approach the floor, but withdrew from it, leaning back among the shadows that had hidden her thus far. She did not want to talk to the men. She’d come to see Captain Sally, though the captain did not know it. Now that the fireworks were finished, this woman took her leave exactly as she’d arrived: in silence and darkness, with a widow’s veil to hide the smile that spread coldly across her face.\n But she had not gone unnoticed or unrecognized.\n In the back row, seated beside the stenographer, a man collected his belongings, sorting his papers and straightening them before slipping them into a satchel, as if he were any other clerk wrapping up his business.\n He was no clerk. Nor was he a congressman, senator, or any other party to the CSA.\n As he retreated from the seat he’d borrowed from an absent legislator, he mentally composed the telegram he’d send within the hour.\n KATHARINE HAYMES IN DANVILLE STOP PLEASE ADVISE\n One\n Gideon Bardsley was working in the basement of the former Jefferson Hospital, which had been converted into the science center that housed his laboratory, when the first window broke. He heard the brittle sound of glass being strategically shattered, but he did not turn off the machine. Instead, he glanced at the dial beside his hand. Its tiny needle leaned hard past the yellow warning threshold, and tapped against the red zone.\n A second window broke upstairs.\n He rejected the reflex to look up at the basement door. Looking at the basement door would not tell him anything he did not already know—nothing he could not discern from the sounds of motion upstairs. Two intruders, at least. Entering from the western side of the building. Not close yet; not even in the correct wing of the disused hospital space. But coming. \n","sourceLink":"https://allnovel.net/fiddlehead-the-clockwork-century-5/page-1.html","bookId":1671,"book":{"id":1671,"title":"Fiddlehead (The Clockwork Century #5)","description":"Storyline: \n Fiddlehead (The Clockwork Century #5) \n Ex-spy ‘Belle Boyd’ is retired – more or less. Retired from spying on the Confederacy anyway. Her short-lived marriage to a Union navy boy cast suspicion on those Southern loyalties, so her mid-forties found her unemployed, widowed and disgraced. Until her life-changing job offer from the staunchly Union Pinkerton Detective Agency. \n When she’s required to assist Abraham Lincoln himself, she has to put any old loyalties firmly aside – for a man she spied against twenty years ago.Lincoln’s friend Gideon Bardsley, colleague and ex-slave, is targeted for assassination after the young inventor made a breakthrough. Fiddlehead, Bardsley’s calculating engine, has proved an extraordinary threat threatens the civilized world. Meaning now is not the time for conflict. \n Now Bardsley and Fiddlehead are in great danger as forces conspire to keep this secret, the war moving and the money flowing. With spies from both camps gunning for her, can even the notorious Belle Boyd hold the war-hawks at bay?\n \n","cover":"https://allnovel.net/images/fiddlehead-the-clockwork-century-5.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/fiddlehead-the-clockwork-century-5.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:18:50 PM"}}
