{"id":103125,"no":20,"title":"Page 20","content":"\n First floor.\n She pressed her ear to the door with the large number “1” painted on it. She heard hollering on the other side. Hollering for her? Hollering at her? No, it didn’t sound like it. These were the shouts of doctors giving orders, and the sounds of wheeled gurneys squeaking hastily between the rows. Maria heard nurses answering the doctors, and asking for supplies; injured men moaning or vomiting, and explanations being cast back and forth across the turmoil. Was it truly loud enough that no one here had heard the gunshots below?\n Maria took her chances with the door and opened it, revealing utter chaos: dozens of freshly arrived patients, rolled in on chairs or tables, being sorted and positioned and addressed with professional but imperfect haste.\n “Oh, God,” she said into her mask, then pulled it off because she hadn’t realized until then that she still wore it. She dropped it on the floor and pushed her way forward, through the teeming crowd of the wounded and their caretakers, taking a gurney to the hip with such force that she cried out, bounced off it, and stumbled forward around an operating table that had been wheeled into place right beside it.\n On the table was a man who was about to lose his leg; even a laywoman like herself could see that for a fact. A nurse held the man down as he writhed and cried, and a doctor struggled to put a molded glass mask over his face for ether, but the patient thrashed. Maria watched, fascinated, unable to tear herself away. The nurse lost her grip on the mangled leg and a jet of blood gushed several feet in the air, spraying Maria across the face.\n She could hardly move for the horror of it, but she forced herself toward the rear of the room, where another door promised an exit, or so she hoped. She wiped at her face, tracking a streak of crimson across the back of her hand. Though she blinked and blinked, the vision in her right eye still swam with red. A bucket of clean rags in soapy water sat by the door, and although she remembered what Sally had said about every rag being sacred, she took one anyway. As she retreated, she wrung it out and wiped at her face, working the rag’s corner into her eye even though the soap stung.\n Her sight cleared, and she swabbed her décolletage, fretting over a splotch or two on her scarf and another on her bodice. But she’d have to wash them later, there was no time to take a trip to the washroom now. Not when she heard—bang—another gunshot somewhere behind her.\n It might’ve been anything, she told herself. Might’ve been some agitated, delirious soldier burning through ammunition, threatening the very people who would bring him back from the brink if he’d give them but a chance.\n But she wasn’t prepared to wait around and find out.\n As she reached the door that should take her into the main lobby, the stairwell door crashed open and another gunshot rang out.\n The reaction was immediate and loud; nurses screamed, patients howled, every able-bodied person ducked for cover. One of the doctors drew a weapon of his own to fire back at the man in the doorway.\n Maria only got a glimpse of him and all she could tell was that he was a white man in a long brown coat. He ducked back into the stairs, only to return fire … right into the room where all the wounded were waiting for help.\n “Despicable!” she gasped, and reached for her Colt’s handle, but came to her senses before adding to the fray.\n Besides, the doctor was returning fire with the skill and calm of a sharpshooter, and maybe he was one, or had been. This was a war hospital, after all, and surely most of the surgeons had seen the field at some point in their service. Maria said a prayer and wished him luck, concluding that the best way she could help defuse the situation would be to leave it behind and let the gunmen chase her to another place.\n So she kept running, out the door and into the circular driveway, where four ambulances of military make were jumbled together, having just arrived from the front. Their rear doors hung open, bloody rags and clothing spilling out from within, as if the vehicles had been disemboweled. At least two of these mechanical carriages had been left with their engines still running, pumping black smoke from their exhaust pipes, their idling motors gurgling.\n Maria had never driven an ambulance before.\n But when she looked inside the nearest cab and scanned the controls, she recognized most of them. The machine wasn’t wholly different from the newfangled taxis she’d driven in Atlanta during one summer’s desperate effort to feed herself.\n She came to a decision. She tossed the satchel onto the seat, seized her Colt, and jumped back onto the lawn in front of the house-turned-hospital … and fired her gun twice into the air. “Hey!” she shouted at the top of her lungs. “Hey, I’m out here! Follow me, boys—I’ve got what you want, so come and get it!”\n Silence fell in the wake of her proclamation. For a moment, she didn’t know what to do. Try again? Wait a little longer? See what happened? But the decision was made for her. One of the hospital’s front windows broke as an elbow smashed through it and the barrel of a gun emerged in the hole.\n Before the attempted assassin could squeeze off more than a shot, she dived back into the cab of the ambulance and shut the door, hunkering down as low as she could while still operating the controls. There was a clutch? Yes, a clutch. There, that pedal. And the diesel injector, yes. That pedal there. Where was the gearshift? She fumbled around until she found it on the side of the steering wheel—doing most of this by feel, since she couldn’t see much of anything. But she got the vehicle moving.\n And immediately struck one of the other ambulances.\n She didn’t hit it hard, but the impact knocked her head against the dash, and she swore like no lady ought to.\n A bullet shattered the windscreen and she was showered with shards of glass, but she shook her head and brushed them away, then sat up just long enough to see where she was going—and to shove her foot onto the accelerator as soon as she spied an opening.\n Over the grass the vehicle hopped, winging a low stone retaining wall as she skidded inexpertly over the driveway and then alongside a ditch, into which the ambulance leaned sharply, threatening to flip and fall. But she urged it up, up, and onto level ground. Now the shooters were far enough behind her that they couldn’t hit her except by the most outrageous accident. Or so she was fairly certain, because she could still hear the shots cracking behind her, but nothing striking home.\n She guided the unwieldy craft onto the road and did her best to avoid any horse-drawn carriages, dogs, men or women on foot, wagons, or other motored devices; but it was hard to see with the windshield gone and the sharp, cold air flying into her face without mercy. Maria squinted against the wind and wished for goggles like the airship flyers used … but if wishes were fishes they’d all cast nets. So she drove on, paying so much attention to her technique that she’d gone a mile before putting any thought into where she was headed.\n Was she still being followed? Hard to say.\n She was rolling toward downtown, and the traffic thickened as she neared the city center. If any assailant followed, he did so with a remarkable obedience to the rules of the road—undoubtedly a better one than Maria herself displayed, as the ambulance stalled out twice, leaped a curb, and ran past a policeman swinging a sign that urged CAUTION.\n It was just as well that her career as a driver hadn’t panned out, or so she told herself as she tried to recall what she knew of this city, and where its train station was located. She’d been there before, but it’d been a while, and she didn’t wish to stop for directions while driving a somewhat stolen ambulance and running from armed gunmen.\n But she did stop, once she recognized her surroundings and correctly extrapolated the way to the station. She abandoned the ambulance beside a saddle company, and then was off once more, making a beeline for the station. It wasn’t far, and she almost felt better on foot, now that she was reasonably confident she’d lost whoever was chasing her.\n Unless she’d become too comfortable too soon.\n Over her shoulder she noted a pair of men keeping pace. It might have been anything, or nothing. It might’ve only been two perfectly ordinary gentlemen on an unrelated errand, likewise headed in the direction of the train station. They did not brandish any weapons, and they did not jog to catch up, but something about their carriage and posture reminded Maria entirely too much of Pinkerton agents. Men on missions, staying casually unremarkable for the sake of efficiency and invisibility.\n But she was one of them now. She knew how they worked, and these two men were working on her—she was almost certain of it.\n There was always the chance they were Pinks after all, sent as backup or as checkup. It’d happened before, that work was spread among agents, and they’d catch one another up in a more or less friendly fashion in their free time.\n She angled her next turn to catch their reflections in a shop window advertising warm winter cloaks. Two white men. Both dark-haired and dressed for indoor work, but not expensively. If these were Pinks, they didn’t come from the Chicago office—she would’ve recognized them—but there were four other offices, so she couldn’t assume they didn’t. She could, however, take note of their appearance and shoot a telegram back to her employer. If they were from her organization, she’d raise a stink. She didn’t like being second-guessed.\n In truth, Maria did not think they were Pinks. But if they weren’t, they were hired hands from some other corner, and she wasn’t ready to handle that prospect yet. What corner might it be? There were other agencies, to be certain—the biggest and best-known in the South was probably the Baldwin-Felts company. She hoped it wasn’t them, as she didn’t think much of that particular establishment.\n Of course, depending on who you asked, the Pinks weren’t much better. But she had a badge for the Pinks, and could reasonably expect to be safe from friendly fire. As for the other, God only knew.\n She took a sharp turn, a fast one that she saved for the last second, and kept a brisk pace but did not run. No one runs unless they want to be chased. Better to let the sidewalk crowds buffer the distance between them than become a casualty to whatever might otherwise transpire. \n","sourceLink":"https://allnovel.net/fiddlehead-the-clockwork-century-5/page-20.html","bookId":1671,"book":{"id":1671,"title":"Fiddlehead (The Clockwork Century #5)","description":"Storyline: \n Fiddlehead (The Clockwork Century #5) \n Ex-spy ‘Belle Boyd’ is retired – more or less. Retired from spying on the Confederacy anyway. Her short-lived marriage to a Union navy boy cast suspicion on those Southern loyalties, so her mid-forties found her unemployed, widowed and disgraced. Until her life-changing job offer from the staunchly Union Pinkerton Detective Agency. \n When she’s required to assist Abraham Lincoln himself, she has to put any old loyalties firmly aside – for a man she spied against twenty years ago.Lincoln’s friend Gideon Bardsley, colleague and ex-slave, is targeted for assassination after the young inventor made a breakthrough. Fiddlehead, Bardsley’s calculating engine, has proved an extraordinary threat threatens the civilized world. Meaning now is not the time for conflict. \n Now Bardsley and Fiddlehead are in great danger as forces conspire to keep this secret, the war moving and the money flowing. With spies from both camps gunning for her, can even the notorious Belle Boyd hold the war-hawks at bay?\n \n","cover":"https://allnovel.net/images/fiddlehead-the-clockwork-century-5.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/fiddlehead-the-clockwork-century-5.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:18:50 PM"}}
