{"id":63386,"no":36,"title":"Page 36","content":"Now I reloaded the gun and aimed at objects in the room, getting the feel of the weapon. I took off my jacket and tried to find a convenient and comfortable way to tuck the gun under my belt. A shoulder holster might be best, I decided, and I made a note to go get one later in the day. There were other things I could use, too. Handcuffs, certainly, so that I could immobilize Motley while I questioned him, and neutralize the unnatural strength in those hands of his. I could pick up a set of cuffs at a store specializing in police items. There was at least one such store downtown near One Police Plaza, and I seemed to remember another in the East Twenties, near the Academy. I could stop there on my way to the Lepcourt apartment, and they could very likely supply a shoulder holster as well. Some of their goods were available only to working cops, but most were unrestricted, for sale to anyone who wanted them, and handcuffs were certainly in that category. You could buy body armor there, too, and I wondered if a Kevlar vest might be a wise purchase. I didn\u0027t think he\u0027d be shooting at me, and the mesh won\u0027t do much to stop a knife thrust, but would it be likely to afford me any protection against his fingers? I didn\u0027t know, and I couldn\u0027t quite see myself trying to pry that information from a clerk. \"Will this protect me if somebody pokes me in the ribs?\" \"What\u0027s the matter, sir, you ticklish or something?\" A small tape recorder would be good. One of those pocket-size models that take the microcassettes. They had them at the Reliable office, and maybe they\u0027d let me check one out for a couple of days. Or maybe it would be simpler if I went to Radio Shack and bought my own. I didn\u0027t need state-of-the-art equipment, so how much could it cost me? I set the gun on top of the dresser and got undressed. I went into the bathroom to run a tub of hot water, and while it filled I came back and switched on the television set and scanned the dial. I caught a newscast on one of the independent channels. The lead item was something about a crisis in the savings-and-loan industry, and then a cheerful girl reporter with a Pepsodent smile came on to tell me that police believed there might be a connection between last night\u0027s bizarre murder of an Auxiliary Police officer in the West Village and this morning\u0027s pre-dawn assault in exclusive Turtle Bay. I\u0027d missed hearing about the AP officer earlier, so I paid attention. I was hooked in tighter when she went on to say that police were speculating further about the possibility of a connection between both crimes and the brutal rape and murder of Elizabeth Scudder earlier in the week at her home on Irving Place. The victim in this morning\u0027s assault, an unmarried woman residing at 345 East Fifty-first Street, had been rushed to New York Hospital with multiple stab wounds and other unspecified injuries. The screen filled with a shot of the building entrance, with paramedics rushing a stretcher out to a waiting ambulance. I tried to make out the face of the woman on the stretcher but I couldn\u0027t see anything. Then the reporter was back, showing what was probably supposed to be a serious smile. The victim, she chirped, was currently undergoing emergency surgery, and a police-department spokesman rated her survival chances as slim. Her identification was being withheld pending notification of next of kin. I hadn\u0027t been able to see her face, but I\u0027d seen the building entrance. Anyway, I\u0027d recognized the address. And I think I\u0027d have known anyway. I think I knew from the moment the item began. It couldn\u0027t have taken me more than five minutes to get dressed and out the door. As it closed behind me the phone started ringing. I let it ring. Here\u0027s how it must have happened: At ten o\u0027clock Thursday night, around the time we were closing the meeting at St. Paul\u0027s, Andrew Echevarria and Gerald Wilhelm finished their tour of duty and reported back to their commanding officer at the Sixth Precinct on West Tenth Street. Since six that evening the two men had comprised one of five Auxiliary Police patrols walking assigned beats in the precinct, carrying nightsticks and walkie-talkies, and serving as the eyes and ears of the regular police while providing a visible police presence on the streets of the city. Gerald Wilhelm left his uniform in a locker and went home in civilian clothes. Andrew Echevarria wore his uniform to and from his weekly service, as was his right. He left the station house around twenty minutes after ten and walked north and west toward a converted warehouse on Horatio Street between Washington and West, where he shared a one-bedroom apartment with his lover, a textile designer named Clarence Freudenthal. Maybe Motley started tailing him early in the evening. Maybe he picked him up for the first time shortly after he left the station house. Then again, maybe the whole thing was a matter of impulse. Motley was certainly a frequent habituй of the western edge of the Village, and God knows he was capable of spur-of-the-moment indecency. What\u0027s evident is that he lured Echevarria into a darkened passage between two buildings, probably by asking for help. Echevarria, still in uniform, would expect to be asked for assistance. Then, before the young airlines ticket agent could guess what was happening, Motley immobilized him and very likely rendered him unconscious by manually constricting his throat. That\u0027s not how he killed him, though. For that he used a long narrow-bladed knife, but he didn\u0027t do this until he\u0027d removed the young man\u0027s jacket and shirt. Then he killed Echevarria with a single thrust to the heart. He stripped the corpse of everything but the underwear and socks. He took the shoes off in order to remove the trousers, but either they were the wrong size or he preferred his own, because he left them behind. (Surprisingly enough, they were still there when the body was discovered. If a street person had been first on the scene, those shoes probably would have walked.) He left Echevarria in the alley, dressed in socks and underwear and quite dead. The undershorts were down around the victim\u0027s thighs and some sort of indignity had been performed upon him, but a subsequent examination did not reveal the presence of semen in the dead man\u0027s anus. He had been penetrated anally, but either the assailant failed to ejaculate or the agent of penetration was Echevarria\u0027s own hardwood nightstick. In any event, Motley took the nightstick away with him, along with his other gear- handcuffs and key, notebook, walkie-talkie, AP shield, and, of course, shirt and jacket and pants and cap. He probably wore his own clothing and carried these articles, and he may have had some sort of shopping bag with him to facilitate this task. (If so, that would support the conjecture that he planned the attack on Echevarria, that he deliberately picked out a uniformed officer similar to himself in height and build and then stalked him.) Echevarria\u0027s death evidently took place between 10:30 and 10:45, and his killer was probably out of the passageway and off into the night before eleven o\u0027clock. It was another hour before police from the Sixth Precinct, responding to an anonymous phone tip, discovered the body where the killer had left it. One of the officers on the scene happened to recognize the victim, having seen him just a couple of hours earlier; but for this bit of luck, he might not have been identified, or known to have been an auxiliary cop, for a considerable time. At this point James Leo Motley was a full hour away from the murder scene, with few clues left behind to point to him. He probably went directly to the Lepcourt apartment on East Twenty-fifth, where he stowed his street clothes and dressed in Echevarria\u0027s uniform. Did he look at himself in his new uniform? Did he stride to and fro across the floor, slapping his nightstick against the palm of his hand? Did he, like every rookie cop since Teddy Roosevelt was commissioner, try twirling his nightstick? One can only imagine. Just what he did is uncertain, as is the time he arrived at the Twenty-fifth Street apartment and the time he left it. He may have been there while I stood in the courtyard behind the building, peering up through the fire escape at his window and listening to the rats scuttling among the garbage cans. He may have been on the other side of the apartment door while I was in front of it, looking for light under the door, listening for sounds within. I doubt it myself. I don\u0027t think he stayed in the apartment for very much longer than the time it took him to change his clothes for his victim\u0027s, but there\u0027s no way to know. At four-thirty, while Mick Ballou and I were having an early breakfast at the diner, he was entering the lobby at 345 East Fifty-first. He found the easy way to get through all those locks. He got her to open them for him. First he presented himself to the doorman. He showed up in full police regalia and announced that he\u0027d come to talk with one of the building\u0027s tenants, a woman named- and here he flipped his notebook\u0027s black leather cover and read the name off- a woman named Elaine Mardell. The doormen were never supposed to let anyone in unannounced, and they\u0027d received special instructions recently as far as visitors for Miss Mardell were concerned. Even so, the doorman might not have called on the intercom if Motley had cautioned him against it. A blue uniform cuts through a lot of rules and regulations. Any NYPD officer looking at him would have seen an Auxiliary Police uniform. If you knew what to look for it wasn\u0027t hard to spot the difference. His badge was a seven-pointed star instead of a shield, his shoulder patch was different, and of course he wasn\u0027t wearing a holstered firearm. But everything else was right, and there are so many different kinds of cops in the city, Transit Police and Housing Police and all, that he looked good enough to get by. In any event, he asked the doorman to use the intercom. The attendant had to ring a few times- she was sound asleep at the time- but eventually she came to the phone and the doorman told her that a police officer was asking to speak to her. And handed the phone to Motley. He probably changed the pitch of his voice. This wouldn\u0027t have been necessary. Her intercom distorted voices all by itself, but he might not have known that. Anyway, except for a couple of phone calls she hadn\u0027t heard his voice in twelve years, and her doorman had just announced that the caller was a cop, and she was fresh out of bed and barely had her eyes open. He told her he had to ask her some questions regarding an urgent matter. She asked for more details, and he let out that there had been a homicide earlier that evening, and that the victim was someone presumably known to her. She asked him who it was. He said it was a man named Matthew Scudder. She told him to come up. The doorman pointed him to the elevator. When she looked through the peephole she saw a cop. His brimmed cap concealed the shape of the top of his head. He was wearing a pair of drugstore glasses, and he had the notebook in front of him so that the shape of his chin was concealed. That was probably unnecessary, because she was expecting a cop, she\u0027d just talked to him, for God\u0027s sake, and here he was in uniform. And she was in a state anyway because somebody was trying to kill her and the man she\u0027d been counting on for protection was dead. So she unlocked all her locks and let him in. He was in her apartment for over two hours. He had the knife with which he\u0027d killed Andy Echevarria, a spring-powered stiletto with a five-inch blade. He had Echevarria\u0027s nightstick. And of course he had his own two hands, with their long strong fingers. He used them all on Elaine. I haven\u0027t wanted to think too much about what he did, or the order in which he did it. I suspect there must have been intervals during which she was unconscious, and I\u0027m sure he spent a fair part of the time talking to her, telling her just how strong and brilliant and resourceful he was. Maybe he quoted Nietzsche, or some other genius from the prison library.","sourceLink":"https://allnovel.net/a-ticket-to-the-boneyard-matthew-scudder-8/page-36.html","bookId":2326,"book":{"id":2326,"title":"A Ticket to the Boneyard (Matthew Scudder #8)","description":"Storyline: A Ticket to the Boneyard (Matthew Scudder #8) The streets of New York are never safe, but the release of James Leo Motley, a psychopath who went down swearing revenge on Matt Scudder on all who knew him, means death is out there looking for a victim. No-one is safe - friends, lovers or just those unfortunate enough to share the same name.","cover":"https://allnovel.net/images/a-ticket-to-the-boneyard-matthew-scudder-8.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-ticket-to-the-boneyard-matthew-scudder-8.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:50:23 AM"}}
