{"id":29950,"no":38,"title":"CHAPTER XXXVIII","content":"It was a wet evening in June, and a steady downrush of rain purred on the tiled roofs of the old town and set the broad eaves and high-peaked gables dripping. A summer sweetness breathed in the gardens where the fallen petals of rhododendrons lay like flame upon the green grass. The roses were weighed down with dew, and each leaf diamonded with a glimmering tear. In Lombard Street the tall cypresses stood like solemn monks cowled and coped against the rain. \\n\\n \\n\\n The downpour had lessened a little, and Jack Murchison, flattening his nose against the nursery window, saw a country cart driven by a man in a white mackintosh swing into Lombard Street from the silver, rain-drenched sheen of St. Antonia’s trees. The man’s big white body streamed with wet, his face shining out like a drenched peony under the brim of his hat, that dripped like the flooded gutter of a house. Tremulous rain-drops fell rhythmically from the big man’s nose, and the apron that covered his legs was full of puddles. \\n\\n \\n\\n The country cart drew up outside the doctor’s house, and Master Jack saw the big man in the white mackintosh climb out laboriously, the cart tilting under his weight. He threw the leather apron over the horse’s loins, and swung the water out of his hat, disclosing to the boy above a round bald patch about the size of a saucer. \\n\\n \\n\\n The bell rang, a good, rattling, honest peal that told of a straightforward and unaffected fist. Jack heard Mary’s rather nasal treble answering the big man’s vigorous bass. The white mackintosh was doffed and hung considerately on the handle of the bell. There was much wiping of boots, while the man Gage appeared at the side gate in the garden wall, and came forward to hold the farmer’s horse. \\n\\n \\n\\n “Sorry to bother you, doctor, on such a beast of an evening.” \\n\\n \\n\\n “Come in, Mr. Carrington.” \\n\\n \\n\\n “You remember me, sir?” \\n\\n \\n\\n “I don’t forget many faces. Come into my study.” \\n\\n \\n\\n The doffing of the white mackintosh had uncovered a robust and rather corpulent, thick-set figure in rough tweed jacket and breeches and box-cloth leggings. The farmer had one of those typically solid English faces, fresh-colored though deeply wrinkled, and chastening its good humor with an alert, world-wise watchfulness in the rather deep-set eyes. Mr. Carrington was considered rather a masterful man by his friends, a man who could laugh while his wits were at work bettering a bargain. He was one of the most prominent farmers in the neighborhood, and one of the few who confessed to making money despite the times. \\n\\n \\n\\n “My trap’s waiting outside, doctor. I want you to come back with me right away to Goldspur Farm.” \\n\\n \\n\\n Mr. Carrington was sitting on the extreme edge of a chair, and wiping the rain from his face with a silk handkerchief. \\n\\n \\n\\n “Anything much the matter?” \\n\\n \\n\\n “Well, doctor, you know I have taken to growing a lot of ground-fruit, and I’ve had about fifty pickers down from town this year.” \\n\\n \\n\\n Murchison nodded. \\n\\n \\n\\n “They’re camped out in two tin shanties and a couple of tents down at Goldspur Farm. East-enders, all of them; and you never quite know, doctor, what an East-ender carries. Well, to be frank, I’m worried about some of ’em.” \\n\\n \\n\\n Mr. Carrington sat squarely in his chair, and tapped the floor with the soles of his boots. He looked thoughtful, and the corners of his big, good-tempered mouth had a melancholy droop. \\n\\n \\n\\n “There’s one woman in particular, doctor, and her youngster, who seem bad. Sick and sweating; won’t take food; they just lie there in the straw like logs. My foreman didn’t tell me anything about it till this afternoon, but when I’d seen the woman I had the horse put in, and came straight here.” \\n\\n \\n\\n Murchison glanced at his watch, and then crossed the room and rang the bell. \\n\\n \\n\\n “Can you have me driven back?” he asked. \\n\\n \\n\\n “Certainly, doctor.” \\n\\n \\n\\n “Good. Ah, Mary, will you ask your mistress to have dinner postponed till eight. And tell Gage to take these letters to the post. Now, Mr. Carrington, my mackintosh and I are at your service.” \\n\\n \\n\\n “You’ll need it, doctor, and an old hat.” \\n\\n \\n\\n A slender vein of gold gashed the dull west as they left the outskirts of the town behind. As the rent in the sky broadened, long rays of light came down the valley, making the woods and meadows a glory of shimmering green, and firing the rain pools so that they shone like brass. The farmer took the private road that ran through Ulverstone Park, a rolling wilderness of beeches and Scotch firs, whose green “rides” plunged into the glimmering rain-splashed umbrage of tall trees. Here were tangled banks of purpling heather, and great stretches of sweet woodland turf. Old yews brooded in the deeps of the domain, solemn and still, most ancient and wise of trees. \\n\\n \\n\\n “Get up, Molly,” and Mr. Carrington shook a raindrop from his nose, and flicked the brown mare with the whip. “Clearing a little. Sorry for the people who cut their hay yesterday.” \\n\\n \\n\\n “Somewhat damp. How is the fruit doing?” \\n\\n \\n\\n “Oh, pretty fair, pretty fair, as far as our strawberries are concerned. The finest year, doctor, is when you have a first-class crop and your neighbors can only put up rubbish. It’s no good every one being in tip-top form. I’ve got rid of tons, and at no dirt price, either.” \\n\\n \\n\\n Mr. Carrington’s British face beamed slyly above his angelic white mackintosh. It was a face in which stolid satisfaction and stolid woe were easily interchanged, for the heavy lines thereof could be twisted into either expression. \\n\\n \\n\\n Murchison was listening to the hoarse rattle of the clearing shower beating upon a myriad leaves. The gold band in the west was broadening into a canopy of splendor. Had Mr. Carrington been educated up to more pushing and aggressive methods of making money, he would have seen in that sky nothing but a magnificent background for some silhouetted sky-sign shouting “Try Our Jam.” \\n\\n \\n\\n “And these pickers of yours, how long have they been with you?” \\n\\n \\n\\n The lines in the farmer’s face rearranged themselves abruptly. \\n\\n \\n\\n “Poor devils, they look on this as a sort of yearly picnic, doctor. There are about fifty of them, and they’ve been at Goldspur about ten days.” \\n\\n \\n\\n “Many children?” \\n\\n \\n\\n “Children? Plenty. If they were Irish, they’d bring the family pig out, doctor, just to give him some new sort of dirt to wallow in. But then, what can you expect—what can you expect?” \\n\\n \\n\\n They had left the park by the western lodge, and came out upon a stretch of undulating fields closed in the near distance by woods of oak and beech. A tall, gabled farm-house of red brick rose outlined against the sky with a great fir topping its chimney-stacks like the flat cloud seen above a volcano in full eruption. Near it, fronting the road, were a few nondescript cottages; farther still a jumble of barns, outhouses, and stables. In the middle of a fourteen-acre field Murchison could see two zinc-roofed sheds and a couple of old military tents standing isolated in a waste of sodden, dreary soil. \\n\\n \\n\\n Mr. Carrington pointed to them with his whip. \\n\\n \\n\\n “There’s the colony. Will you come in first, doctor, and have—” he reconsidered the words and cleared his throat—“and have—a cup of tea?” \\n\\n \\n\\n Murchison had noticed the break in the invitation, and had reddened. \\n\\n \\n\\n “No, thanks. We had better walk, I suppose?” \\n\\n \\n\\n “Sit light, doctor; we have a sort of road, though it ain’t exactly Roman.” \\n\\n \\n\\n The farmer passed Murchison the reins, and climbed down, the trap swaying like a small boat anchored in a swell. He opened a gate leading into the field, his white mackintosh flapping about his legs. \\n\\n \\n\\n “Not worth while getting up again,” he said, laconically. “Drive her on, doctor, I’ll follow.” \\n\\n \\n\\n Murchison heard the click of the gate, and the squelch of Mr. Carrington’s boots in the mud, as the trap bumped at a walking pace towards the zinc sheds in the field. The larger of the two resembled a coach-house, and could be closed at one end by two swinging doors. The rain was still rattling on the roof as Murchison drove up, and a thin swirl of smoke drifted out sluggishly from the darkness of the interior. The two tents had a soaked and slatternly appearance. Empty bottles, old tins, scraps of dirty paper, and miscellaneous rubbish littered the ground. On a line slung between two chestnut poles three dirty towels were hanging, either to wash or to dry? \\n\\n \\n\\n As the trap stopped at the end of the rough road, Murchison could see that the larger shed was like a big hutch full of live things crowded together. A litter of straw, ankle deep, lay round the walls. A fire burned in the middle of the earth floor. The faces that were lit up by the light from the fire were coarse, quick-eyed, and hungry, the faces seen in London slums. \\n\\n \\n\\n Half a dozen children scuttled out like a litter of young pigs, and stood in the slush and rain, staring at the trap. Murchison’s appearance on the scene seemed to arouse no stir of interest among the adult dwellers in the shed. They stared, that was all, one or two breaking the silence with crude and characteristic brevity. \\n\\n \\n\\n “’Ello, ’ere’s the b——y doctor.” \\n\\n \\n\\n “There’s ’air!” \\n\\n \\n\\n “Look at the hold boss, with a phiz like a round o’ raw beef stuck hon top of a sack of flour.” \\n\\n \\n\\n Mr. Carrington arrived with his boots muddy and the lines of his face emphatic and authoritative. \\n\\n \\n\\n “Some one hold the mare. Why don’t you keep the kids in out of the wet? This way, doctor, the second tent.” \\n\\n \\n\\n Mr. Carrington opened the flap, and, letting Murchison enter, contented himself with staring hard at two figures lying on an old flock mattress with a coat rolled up for a pillow. One was a woman, thin, still pretty, in a hollow-cheeked, hectic way, with a ragged blouse open at the throat, and a couple of sacks covering her. The other was a child, a girl with flaxen hair tossed about a flushed and feverish face. The child seemed asleep, with half an orange, sucked to the pulp, clutched by her grimy fingers. \\n\\n \\n\\n Murchison remained for perhaps half an hour in that rain-soaked tent, while Mr. Carrington stumped up and down impatiently, kicking the mud from his boots and eying the rubbish that marked the presence of these London poor. The eastern sky was filling fast with the oblivion of night when Murchison emerged. The woman had been able to answer his questions in a dazed and apathetic way. \\n\\n \\n\\n Mr. Carrington met him with a squaring of his sturdy shoulders and a bluff uplift of the chin. \\n\\n \\n\\n “Well, doctor?” \\n\\n \\n\\n “I’m glad you sent for me.” \\n\\n \\n\\n “As bad as that, is it?” \\n\\n \\n\\n “Typhoid, or I am much mistaken.” \\n\\n \\n\\n The farmer thrust his hands into the side pockets of his mackintosh, and flapped them to and fro. \\n\\n \\n\\n “Well, I’m damned!” was all he said. \\n\\n \\n\\n The cold sky rose dusted with a few stars in the west when the farmer’s cart set Murchison down in Lombard Street before his own door. Dinner had been waiting more than an hour. Catherine’s face, bright, yet a little troubled, met him in the shaded glow of the hall. \\n\\n \\n\\n “You must be soaked to the skin, dear,” and she felt his clothes. \\n\\n \\n\\n “No, nothing much. I’m more hungry than wet.” \\n\\n \\n\\n “A long case. Dinner is ready.” \\n\\n \\n\\n They went into the dining-room together, Murchison’s arm about her body. \\n\\n \\n\\n “Some responsibility for me at last,” he said, quietly; “I believe it is typhoid.” \\n\\n \\n\\n “Where, at Goldspur Farm?” \\n\\n \\n\\n “Yes, among Carrington’s pickers.” \\n\\n \\n\\n “Poor things!” \\n\\n \\n\\n “They are cooped up like cattle in a shed.” \\n\\n \\n\\n He was silent for some minutes, for Mary had set a plateful of hot soup before him, and even doctors are sufficiently human to enjoy food. \\n\\n \\n\\n “There is a child ill,” he said, staring at the bowl of roses in the middle of the table. \\n\\n \\n\\n “Poor little thing!” \\n\\n \\n\\n “Strange, Kate, but she reminds me—wonderfully, very wonderfully—of Gwen.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1619/47932.html","bookId":1232,"book":{"id":1232,"title":"A Woman\u0027s War 女性战线","description":"简介： There was a ripple of chimes through the frosty air as Catherine Murchison turned from Kings Walk into Lombard Street, and saw the moon shining white and clear between the black parapets and chimney-stacks of the old houses. St. Antonias steeple was...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1619","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
