{"id":39564,"no":5,"title":"Social Destiny of Man","content":"Social Destiny of Man: or Association and Reorganization of Industry. By Albert Brisbane. Philadelphia. 12mo. pp. 480. \\n\\n \\n\\n This work is designed to give a condensed view of the system of M. Fourier, for the improvement and elevation of productive industry. It will be read with deep interest by a large class of our population. The name of Fourier may be placed at the head of modern thinkers, whose attention has been given to the practical evils of society and the means of their removal. His general principles should be cautiously separated from the details which accompany their exposition, many of which are so exclusively adapted to the French character, as to prejudice their reception with persons of opposite habits and associations. The great question, which he brings up for discussion, concerns the union of labor and capital in the same individuals, by a system of combined and organized industry. This question, it is more than probable, will not be set aside at once, whenever its importance is fully perceived, and those who are interested in its decision will find materials of no small value in the writings of M. Fourier. They may be regarded, in some sense, as the scientific analysis of the cooperative principle, which has, within a few years past, engaged the public attention in England, and in certain cases, received a successful, practical application. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1378/41317.html","bookId":1432,"book":{"id":1432,"title":"Uncollected Prose","description":"简介： In the history of the Church no subject has been more fruitful of controversy than the Lords Supper. There never has been any unanimity in the understanding of its nature, nor any uniformity in the mode of celebrating it. Without considering the friv...","cover":"http://novel.tingroom.com/file/upload/201509/11/08-24-48-70-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1378","creation":"Aug 1, 2019 12:25:05 AM","modification":"Aug 1, 2019 12:25:05 AM"}}
