{"id":86079,"no":3,"title":"Page 3","content":"By the pendulum clock it was sixteen minutes after eight when Magistrate Nathaniel Powers entered the office, which was a large single room with a lead-paned glass window viewing upon the northward expanse of the Broad Way and the forested hills beyond. \"Morning, Matthew,\" he said, as he instantly and by constant habit shed his rather dimpled dove\u0027s-gray tricorn and the gray-striped coat of a suit that had known more needle-and-thread than a petticoat army. These he placed carefully, as always, upon two pegs next to the door. \"Good morning, sir,\" answered Matthew, as always. Truth be told, he\u0027d been day-dreaming out the window, turned around at his desk upon which lay two ledger books, his bottle of good black India ink, and two goose-feather quills. He\u0027d been quick enough, with the noise of boots on the corridor\u0027s boards and the click of the doorhandle, to dip his quill and return to his transcription of the most recent case of Duffey Boggs, found guilty of hog thievery and sentenced to twenty-five lashes at the whipping-post and the branding of a \"T\" on the right hand. \"ah, the letters are readyi\" Powers walked to his own desk, which befitting his status was central in the room and perhaps twice as large as Matthew\u0027s. He picked up the packet of more than a dozen envelopes, which were stamped with red wax seals of the magistrate\u0027s office and were bound for such destinations as varied as a city official down the stairs and a law colleague across the atlantic. \"Good work, very neatly done.\" \"Thank you,\" Matthew replied, as he always did when this compliment was offered him, and then he returned his attention to the thief of hogs. Magistrate Powers sat down at his desk, which faced Matthew. \"and what is on the docket for today, theni\" \"Nothing at court. at one o\u0027clock you have an appointment with Magistrate Dawes. Of course you\u0027re expected to attend Lord Cornbury\u0027s address at three o\u0027clock.\" \"Yes, that.\" He nodded, his face amiable though deeply lined and care-worn. He was fifty-four years old, was married, and had three children: a married girl with her own family and two sons who wished nothing to do with books or judgments of law and so occupied themselves as workmen on the docks, though one had risen to the rank of foreman. The thing was, the two boys were likely paid quite a sum more than their father, the salaries of civil servants being as low as a mudcat\u0027s whiskers. Powers had dark brown hair gone gray with fatigue at the temples, his nose as straight as his principles and his brown, once hawk-like eyes in need of spectacles from time to time. He had been a tennis champion in his youth, at the University of Cambridge, and he spoke often of greatly missing the cheers and tumult of the galleries. Sometimes Matthew thought he could see the magistrate as a young, supple, and handsome athlete drinking in the approval of the crowd, and times as well he wondered if the man\u0027s silent reveries replayed those days before his knees creaked and his back was bent under the weight of a pressing judgment. \"Edward Hyde is his given name,\" Powers said, interpreting Matthew\u0027s silence as an interest in the new governor. \"Third Earl of Clarendon. attended Oxford, was a member of the Royal Regiment of Dragoons and a Tory in Parliament. My ear-to-the-ground also says he\u0027ll have some interesting observations about our fair town.\" \"You\u0027ve met him, theni\" \"Mei No, I\u0027ve not been so favored. But it seems those who have-including High Constable Lillehorne-wish to keep the particulars to themselves and the rest of us in suspense.\" He began to go through the tidy stack of papers that had been arranged on the desk for his appraisal courtesy of his clerk, who had also prepared his quills and gathered some legal books from the shelves in anticipation of impending cases. \"So tomorrow morning is our interview with the widow Muckleroyi\" \"Yes sir.\" \"Casting a claim for stolen bedsheets on Barnaby Shearsi\" \"She contends he sold the bedsheets and bought his mule.\" \"Well, his entire house isn\u0027t worth an ass,\" Powers said. \"One wonders how these folk get together.\" \"Not without some effort, I\u0027m sure.\" The widow Muckleroy weighed near three-hundred pounds and Shears was a rascal so thin he could almost slide between the iron bars of his gaol cell, where he was now being held until this matter was cleared up. \"Friday, theni\" the magistrate inquired, looking through his notes. \"Friday morning, nine o\u0027clock, is the final hearing before sentence on George Knox.\" Powers found some writing he\u0027d done on the subject and spent a moment studying the pages. It was a matter of violence between rival owners of two flour mills. George Knox, when raging drunk, had hit Clement Sandford over the head with a bottle of ale in the Red Bull Tavern, causing much bloodshed and subsequent disorder as the supporters of both men in their dispute over prices and territories began a melee that had spilled out into Duke Street. \"It amazes me,\" the magistrate said quietly, in his appraisal of the facts, \"that in this town prostitutes may give sewing lessons to ladies of the church, pirates may be consulted for their opinions on seaworth by shipbuilders, Christians and Jews may stroll together on a Sunday, and Indians may play dice games with leatherstockings, but let one silver piece fall in a crack between two members of the same profession and it\u0027s a bloody war.\" He put aside his papers and scowled. \"Don\u0027t you get sick of it, Matthewi\" \"Siri\" Matthew looked up from his writing; the question had honestly surprised him. \"Sick of it,\" Powers repeated. \"Sick. as in ill. Of the pettiness and the never-ending pettifoggery.\" \"Well...\" Matthew had no idea how to respond. \"I don\u0027t-\" \"ah!\" Powers waved a hand at him. \"You\u0027re still a young fish, not a cranky old crab like I am. But you\u0027ll get here, if you stay in this profession long enough.\" \"I hope to not only stay in this profession, but to advance in it.\" \"Whati Quilling transcripts, hour after houri arranging my papers for mei Writing my lettersi and to become a magistrate some dayi The honest fact is that you\u0027d have to go to law school in England, and do you know the expense of thati\" \"Yes sir, I do. I\u0027ve been saving my money, and-\" \"It will take years,\" the magistrate interrupted, staring steadily at Matthew. \"Even then, you must have connections. Usually through social ties, family, or church. Didn\u0027t Isaac go over all this with youi\" \"He...told me I\u0027d need to be further educated in practical matters, and that...of course I\u0027d have to formally attend a university, at some point.\" \"and I have no doubt you\u0027d be an excellent university student and an excellent magistrate, if that\u0027s the professional path you choose to follow, but when were you planning on applying for placementi\" Matthew here had a jolt of what he might later term a \"brain check,\" in light of his interest and aptitude for playing chess; he realized, like a drowsy sleeper hearing a distant alarm bell, that since the death of Isaac Woodward the passage of days, weeks, and months had begun to merge together into a strange coagulation of time itself, and that what at first had seemed slow and almost deceptively languid was indeed a fast bleeding of a vital period of his life. He realized also, not without a sharp piercing of bitterness like a knife to the gut, that his fixation on bringing Eben ausley to justice had blinded him to his own future. He sat motionless, the quill poised over paper, his precise lettering spread out before him, and suddenly the quiet thrump of the pendulum clock in the corner seemed brutally loud. Neither did Powers speak. He continued to stare at Matthew, seeing the flash of dismay-fright, even-that surfaced on the younger man\u0027s face and then sank away again as false composure took its place. at length Powers folded his hands together and had the decency to avert his eyes. \"I think,\" he said, \"that when Isaac sent you to me he considered you\u0027d stay here only a short while. a year, at the most. Possibly he believed your wage would be better. I think he meant for you to go to England and attend school. and you still can, Matthew, you still can; but I have to tell you, the climate at those universities is not kind to a young man without pedigree, and the fact that you were born here and raised in an orphanage...I\u0027m not sure your application wouldn\u0027t be passed over a dozen times, even with my letter as to your character and abilities.\" He frowned. \"Even with the letters of every magistrate in the colony. There are too many formidable families with money who wish their sons to become lawyers. Not magistrates for america, you understand, but lawyers for England. The private practice always pays so much better than the public welfare.\" Matthew found his voice, albeit choked. \"What am I going to do, theni\" Powers didn\u0027t reply, but he was obviously deep in thought; his eyes were distant, his mind turning something over and over to examine it from all angles. Matthew waited, feeling like he ought to excuse himself to go home and spend the last of his remaining pocket-money on a few tankards full of the Old admiral\u0027s ale, but of what use was a drunken escape from realityi \"You could still go to England,\" the magistrate finally said. \"You might pay a captain a small amount and work on the ship. I might help you in that regard. You might find employ with a law office in London, and after a period of time someone there with more political currency than I possess might offer to champion you to a university of merit. If you really wanted to, that is.\" \"Of course I\u0027d want to! Why wouldn\u0027t Ii\" \"Because...there might be something better for you,\" Powers answered. \"Betteri\" Matthew asked incredulously. \"What could be better than thati\" He remembered his place: \"I mean...sir.\" \"a future. Beyond the hog thieves and the ruffians fighting in the streets. Look at the cases we\u0027ve heard together, Matthew. Did any of them stand out, particularlyi\" Matthew hesitated, thinking. In truth, the majority of cases had involved small thefts or various petty acts of criminality such as vandalism and slander. The only two real cases that had intrigued him and gotten his mind working had been the murder of the blue beggar, the first year he\u0027d come to work in New York, and the matter of the deadly scarecrow on the Crispin farm last October. Everything else, it seemed to him now, had been an exercise in sleepwalking. \"as I thought,\" Powers went on. \"Nothing much to report except the usual humdrum details of human malfeasance, carelessness, or stupidity, yesi\" \"But...it\u0027s those things that are usual in any pursuit of justice.\" \"Rightly so, and that is the nature of public work. I\u0027m just asking you, Matthew, if you really wish to give your life to those-how shall I put it-mundanitiesi\" \"It\u0027s suited you well enough, hasn\u0027t it, siri\" The magistrate smiled faintly and held up his frayed sleeve cuff. \"Let\u0027s not speak of suits, shall wei But yes, I\u0027ve been happy in my chosen profession. Well...pleased is the proper word, I suppose. But satisfied or challengedi Of those I\u0027m not so sure. You see, I didn\u0027t volunteer for this position, Matthew. In the course of my work in London I made some judgments which unfortunately secured me some influential enemies. The next thing I knew, I was pushed out of a position and the only avenue open to my family and myself was a sea route to either Barbados or New York. So I\u0027ve done the best I could, considering the situation, but now...\" He trailed off. Matthew had had the feeling that there was more to this line of thought than met the ear. He prodded, \"Yes, siri\" The magistrate scratched his chin and paused, constructing his next comment. Then he stood up and walked to the window, where he leaned against the casement to look down upon the street. Matthew swiveled around to follow his progress. \"I\u0027m leaving my position at the end of September,\" Powers said. \"and leaving New York, as well. That\u0027s what I\u0027m speaking to Magistrate Dawes about today...though he doesn\u0027t know it yet. You\u0027re the first I\u0027ve told.\" \"Leavingi\" Matthew had received no inkling of this, and his first thought was that the man\u0027s health demanded a change. \"are you ill, siri\" \"No, not ill. In fact, since I made up my mind I\u0027ve been feeling very perky lately. and I only did decide in the last few days, Matthew. It\u0027s not something I\u0027ve been keeping from you.\" He turned from the window to give the younger man his full attention, the sunlight spilling across his shoulders and head. \"You\u0027ve heard me mention my elder brother Durhami\" \"Yes sir.\" \"He\u0027s a botanist, I believe I\u0027ve told youi and that he manages a tobacco plantation for Lord Kent in the Carolina colonyi\" Matthew nodded. \"Durham has asked me to help him, as he wishes to concentrate only on the botanical aspects. Lord Kent keeps buying more land, and the place has gotten so large everything else is overwhelming him. It would be legal work-contracts with suppliers and such-and also managerial in nature. Not to mention three times the money I\u0027m currently making.\" \"Oh,\" Matthew said. \"Judith is certainly well for it,\" the magistrate continued. \"The social harridans here have never exactly welcomed her with open arms. But there\u0027s a town beginning to thrive near the plantation, and Durham has great expectations for it. I haven\u0027t mentioned this to the boys yet. I expect Roger may travel with us, but Warren will likely stay, his job being so important. abigail of course has her own family and I shall miss the grandchildren, but my mind is settled.\" \"I see,\" was Matthew\u0027s response. His shoulders slumped. He wondered if this was the personal calamity Cecily had smelled on him this morning. all in all, he ought to go do some drinking and then back to bed. \"That\u0027s not all I have to tell you,\" Powers said, and the bright tone of his voice instantly made Matthew sit up straight, whether expecting more bad news or not he wasn\u0027t sure. \"Don\u0027t think I\u0027m going to leave here and not find something of interest for you. Do you wish to clerk for another magistratei\" What are my choicesi Matthew asked himself, but didn\u0027t speak it. \"If you do, that\u0027s simple enough. Either Dawes or Mackfinay would take you on today, if they could. But I want you to know where I\u0027ve been this morning.\" \"Siri\" Now Matthew was totally lost. \"Where I\u0027ve been,\" the magistrate repeated, as if conversing with an imbecile. \"Or, more importantly, who I\u0027ve met. I received a messenger at home yesterday evening, asking if I would meet with a Mrs. Katherine Herrald at the Dock House Inn. It seems we share some enemies, to the extent that she wished to speak with me. I went this morning, and...though I regretted that I could not be of assistance to her, I told her I knew someone who might be, and that I\u0027d have you meet her at one o\u0027clock tomorrow afternoon.\" \"Mei\" Matthew truly thought the magistrate had lost a few coins from his treasury. \"Whyi\" \"Because...\" Powers stopped and seemed to think better of it. \"Just because, and that\u0027s all I\u0027m going to say. We have our interview with the widow Muckleroy at ten o\u0027clock, yesi So you\u0027ll have time for a good lunch and then off to the Dock House with you.\" \"Sir...I\u0027d really like to know what this is about. I mean, I appreciate any help you might give me, but...who is Mrs. Katherine Herraldi\" \"a businesswoman,\" came the reply, \"with a very intriguing plan. Now hush with the questions and contain yourself. Finish that transcript by noon and I\u0027ll take you to Sally almond\u0027s, but only if you\u0027ll order the lamb\u0027s broth and biscuits.\" So saying, he returned to his desk and began to prepare his notes for the widow\u0027s questioning, while Matthew stared at his back and wondered what kind of insanity had infected the town today. \"Siri\" he tried again, but Powers waved an impatient hand at him and thus signaled the absolute end of any further discussion of the mysterious Mrs. Herrald. at length Matthew had to put his curiosity aside, for nothing more would be forthcoming. He dipped his quill into the inkpot and put it to paper once again, as indeed he did need to finish the transcript and the Tuesday special at Sally almond\u0027s tavern was not to be missed.","sourceLink":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2/page-3.html","bookId":2251,"book":{"id":2251,"title":"The Queen of Bedlam (Matthew Corbett #2)","description":"Storyline: The Queen of Bedlam (Matthew Corbett #2) The unsolved murder of a respected doctor has sent ripples of fear throughout a city teeming with life and noise and commerce. Who snuffed out the good man\u0027s life with the slash of a blade on a midnight streeti The local printmaster has labeled the fiend \"the Masker,\" adding fuel to a volatile mystery...and when the Masker claims a new victim, hardworking young law clerk Matthew Corbett is lured into a maze of forensic clues and heart-pounding investigation that will both test his natural penchant for detection and inflame his hunger for justice.","cover":"https://allnovel.net/images/the-queen-of-bedlam-matthew-corbett-2.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:10:38 PM"}}
