{"id":86108,"no":32,"title":"Page 32","content":"Matthew closed the door behind him. He stood in a vestibule with lavender walls and an oval mirror, the better to check one\u0027s appearance before meeting prostitutes. In front of him, beyond the black strawberry, was a drawn red curtain. He heard feminine laughter from the other side, and not too dainty, either. Then a man laughed, with a snort. He began to doubt his wisdom at coming to this place, but there were answers here and so be it.\\n\\n Suddenly the ebony woman, who stood so close to him Matthew felt the heat glowing through her gown, had a dagger in her hands and was cleaning her fingernails with its deadly point. Hidden under all that finery, he thought. Ready to come out and stab somebody in the heart at the drop of a disagreement.\\n\\n \"First time here,\" she said as she continued her grooming, \"needs rules spelt out, unnastandi\"\\n\\n \"Yes,\" Matthew answered, carefully.\\n\\n \"No rough play. Disrespect earn disrespect, in spades. No weapons. Got anyi\"\\n\\n Matthew shook his head.\\n\\n \"Trus\u0027 worthy face,\" she decided. \"First trouble, a warnin\u0027. Second trouble, you goes out in separate pieces. I keep de rules. Unnastandi\"\\n\\n \"I do,\" Matthew said, in all sincerity.\\n\\n \"Verra good!\" The dagger was flipped around on fat but nimble fingers and vanished into the abyss. \"Half a shillin\u0027 rents de room for a half-hour or any part a\u0027 it. Customary to pay de lady a groat, \u0027fore you goes up. all money to be collected by me. First glass a\u0027 wine\u0027s on de house. That smooth your sailsi\"\\n\\n \"Yes, madam,\" Matthew said, assuming it was the correct reply.\\n\\n \"Not madam,\" she scoffed. \"I\u0027m jus\u0027 ole Becca Black.\" She grinned widely again. \"We gonna be good friends,\" she told him, and one treelimb of an arm whisked the curtain open.\\n\\n a rather luxurious parlor lay before him, decorated with dark red wallpaper and illuminated by many candles. There were chairs and settees and sofas, everything overstuffed and covered with glossy fabric in shades of red, pink, and purple. Matthew thought the place was meant to tantalize, but he feared for his vision. Within the parlor, where the pungently sweet fumes of incense curled from a Turkish lamp, sat in various postures of relaxation two men and three women. The men were not together and paid no mind to each other nor to Matthew, as all their attention was devoted to the females, who wore shockingly casual garments more like pantaloons than gowns. Brightly colored scarves covered their breasts, with ribbons around their throats. Scandalously, their midsections were exposed and one of the ladies wore a green jewel in her navel. None of them were great beauties, but the exposure of so much feminine flesh was enough to make Matthew weak in the knees. He assumed this was the normal uniform of Polly Blossom\u0027s prostitutes, designed to be shed and reapplied as rapidly as possible.\\n\\n One of the doxies, a full-bodied and white-wigged wench who might have been able to throw Brutus the bull, stood up from her sofa and grinned with snaggle-teeth at Matthew, offering him the comfort of bone-crushing arms.\\n\\n \"Go right in, then!\" said Becca Black, who seized Matthew\u0027s shoulder and nearly flung him into the room.\\n\\n The whore lumbered toward him. Matthew thought he was about to be consumed like a meat-pie when a saving angel glided between them, having come through another doorway at the left side of the parlor.\\n\\n \"Master Corbett, isn\u0027t iti\" Polly Blossom asked, her face right up in his own. Before he could speak, she said quietly, \"Sit down, Barsheba,\" without moving her eyes from Matthew\u0027s. He was aware in his peripheral vision of the female beast retreating to her sofa and curling herself up with a little sigh of lost love or, at least, an unearned groat. Polly leaned in so close her eyes, startlingly blue and clear, became the world. \"We don\u0027t wish to frighten you away, your very first visit,\" she all but whispered in his ear.\\n\\n In spite of the rigid design of his mission, Matthew had begun to sweat both at temples and under his arms. His stomach felt crawly. Polly Blossom was a handsome woman, no doubt. Her thick blond ringlets had no need of a whore\u0027s wig, and she wore only a modicum of blue shadow-paint above her eyes. Her full, pouting lips-so close to his own mouth!-were daubed with pink. Her color was healthy, her body with its full swell of breasts and hips clothed in a rich indigo gown embroidered with lighter blue silk flowers. He had to look down to see if she wore the metal-toed boots, and yes, for all of her gentlewoman\u0027s finery and a perfume that smelled like peaches she did indeed wear the fearsome black kickers.\\n\\n There came the sound of someone strumming a gittern. Matthew looked to one side to see that Becca Black had situated herself in a chair and was playing the instrument, her head cocked and the remaining eye half-closed as if in reverie. The woman began to sing what might have been a West Indian song, a soft and lilting tune that seemed to be half English and half the language of her island heritage. He couldn\u0027t understand most of it, due to the lady\u0027s heavy accent, but he recognized in the lovely yet wistful song the sound of a universal longing.\\n\\n a hand slid into Matthew\u0027s. \"Come,\" said Polly, her voice still hushed. \"Sit with me.\"\\n\\n She led him to a sofa, where suddenly he found himself seated with New York\u0027s notorious and beautiful whore-mistress leaning against his shoulder and offering him a sugared almond from a silver dish. When he started to take it from her, she just laughed and pushed it into his mouth.\\n\\n \"Tell me,\" she said, as a hand lay upon his thigh, \"about yourself.\"\\n\\n This water was getting deep. He had not come here for dalliance, but for information. a meeting with Grace Hester, if possible. He had to keep his wits about him, before they flew away. He wondered what Polly Blossom might say if she knew he was unsure whether he was a virgin or not, for his memory of a heated physical encounter with Rachel Howarth might have been true yet might have been produced by the strange elixirs given him by an Indian medicine man after his fight with Jack One Eye the bear three years ago. He could hear Madam Blossom say as she stared steadily at him, after you leave here tonight, your memory will serve you well. But he was here for professional reasons, not for yearnings of the flesh. He was here to get in and out as quickly as possible. To get to the essence of things. To...damn, this woman was sitting so close!\\n\\n Footsteps descended a staircase. Matthew saw a narrow set of stairs at the opposite end of the parlor. Coming down and looking quite woozy, either from drink or his amorous exertions, was Samuel Baiter, whose face was still bruised from the dust-up during a dice game at his house on Saturday night. He carried his tricorn hat in one hand and the other was still tugging his breeches up. \"Good night, Madam Blossom,\" he croaked as he passed, and the lady answered, \"Good night, Master Baiter.\"\\n\\n Then she turned her attention again upon her object of sugared almonds. \"Oh,\" she said, \"you\u0027re a very handsome young man. But surely you\u0027ve been told this by many ladies much younger and prettier than myself, have you noti\"\\n\\n The question sounded as loaded as one of those multi-barreled pistols ashton McCaggers had told him about. \"I have not,\" he replied.\\n\\n \"Then I fear for the taste of the ladies of New York, sir, as well as for their sanity in letting you walk the streets without the companionship of the fairer sex. Handsome, well-bred, well-dressed, and intelligent, too. Oh, how my heart pounds!\" She used his hand to demonstrate if not how hard her heart was pounding then how soft was her left breast.\\n\\n Matthew\u0027s flag had unfurled and was rapidly rising. He thought that if this went much further he was going to lose all professional account of himself.\\n\\n One of the other customers was telling a joke and both the women laughed as if they hadn\u0027t heard about the farmer\u0027s daughter and the brush salesman a hundred times. Becca Black strummed and sang and Polly Blossom regarded Matthew as if he were Eros embodied, which he knew must be part of her own professional wiles for he certainly wasn\u0027t all that.\\n\\n Madam Blossom ceased her faux swooning to watch like a hawk as the two men chose their paramours of the half-hour and put coins into a white ceramic bowl on a table beside Becca Black, who did not pause in her playing. One of the men either was mad or had terrible eyesight, as he\u0027d chosen the white-wigged giantess; well, perhaps he craved what was nearly about to explode from her scarf and pantaloons. They went up the stairs chatting and laughing, leaving the spurned girl-a slim brown-haired doxy with sharp features under a heavy pancake of rouge and white powder-to lean back in her chair bored to the soul and rapidly stir the air around her face with a black fan as if dissipating the odors of manly musk and bad breath.\\n\\n \"Master Corbett,\" said Polly, again all smile and flirtation, \"I regret I cannot offer myself for commerce tonight, as I might wish to, but I am under Eve\u0027s curse. Might I suggest that Nicole over there would be an excellent companioni Nicole! Please sit up straight and show your good breeding, my dear.\" Nicole obeyed, with a frozen grin. \"Or I have a very pleasant and highly intelligent young blond, newly arrived from London just last week, almost a virgin so fresh is she, so supple and dewy. But if it\u0027s experience you wish, and a certain exotic charm, I also have a dark-fleshed gypsy with-I\u0027m told-the firm grip of a sixteen-year-old and sure to delight. What is your pleasure, siri\"\\n\\n \"I...\" Matthew\u0027s nerves betrayed him by making his voice crack. He cleared his throat and tried again. \"I do have a request.\" She watched him intently, with perhaps a little hard flint back in those eyes somewhere. \"I\u0027d like to be introduced to-\"\\n\\n \"Goddamn, what a night!\" said a waspish feminine voice as someone came down the stairs. \"That bastard Baiter\u0027s got a cock enough for three men!\"\\n\\n \"Hold your tongue, missy!\" at once Madam Blossom had risen to her feet in a show of indignation. \"We have a gentleman on the floor!\"\\n\\n Matthew stood up as well, for on the stairs was the young prostitute that he\u0027d last seen hanging on andrew Kippering at the Thorn Bush. Her dark hair, a shade of brown so deep it was almost black, was brushed back from her forehead and gathered behind with a crimson ribbon. She wore, as was the custom of ladies both high and low, white face powder and her eyebrows were drawn as thin black arches. as he\u0027d noted at the Thorn Bush, she was about twenty years old and not unattractive, for her features were well-defined and her expression catlike with a sexual cunning. She wore the pantaloon outfit but had a flimsy violet robe thrown about her shoulders and drawn over her breasts. Her ebony eyes found Matthew but remained vacant. She said in an affected voice, \"My regrets, sir. I was simply remarkin\u0027 of what happens when a giant sausage is shoved into a silk purse.\"\\n\\n \"No apologies necessary,\" Matthew told Grace Hester, before the madam of the house could speak. \"I understand that not all sausages are created equal, but all silk purses have a bottom. So my regrets to you that a so-called gentleman has no concept of physical volume.\"\\n\\n There was a silence. Becca Black\u0027s music had ceased on an off-key note.\\n\\n Grace Hester frowned. \"Who the hell are youi\" she asked. \"a gibberin\u0027 looni\"\\n\\n \"Hush!\" Polly snapped, and then her tone softened though her eyes had become as hard as her reputation. \"This is Master Matthew Corbett, my dear. a magistrate\u0027s clerk and well-known young man about town. He featured prominently in a recent article in the Earwig, so he may be considered somewhat of a celebrity and we are honored to-\"\\n\\n Grace yawned and winced as she rubbed her crotch.\\n\\n \"Honored to have him visit us,\" Polly finished. \"These young ladies!\" she said to Matthew with a sad shake of her head. \"They just don\u0027t know good manners anymore.\"\\n\\n \"I\u0027m done for the night.\" Grace continued down the stairs, walking with a noticeable hitch in her roll. She had no pretense of being a gentlelady; she was all foul temper and crudities. \"Somebody get me a fuckin\u0027 drink.\"\\n\\n \"Get yourself your own fucking drink,\" answered the mistress of the house, as the masks of civility began to crack. \"You already owe me two shillings for your liquor. When are you going to payi\"\\n\\n The girl shrugged and passed Matthew and Polly, heading for a sideboard on which stood three open bottles of wine and a few glasses. Suddenly there was a yawp of female laughter from upstairs followed by an incomprehensible shout from a man. Becca Black returned to her gittern, this time playing a more stately and intricate tune that had no words. Matthew was impressed by her musical talents and he wondered what her story might be; but he was here for Grace Hester\u0027s tale, and it was time to work toward his aim.\\n\\n \"That wine\u0027s for the customers,\" Polly said, advancing toward the girl before a bottle could be tipped. \"You\u0027ll pay me what you owe, or you\u0027ll have more than a pain in the puss.\"\\n\\n \"Pardon me,\" Matthew spoke up, before these two cats began to scratch. \"The lady may have my glass.\" They turned as one to glare at him, as if he were the lowest creature ever born. \"I am afforded a free glass of wine, am I noti If so, the lady may have mine.\"\\n\\n Polly Blossom, to her credit, was quick to swing between her roles of whore-warden and flirtatious businesswoman. It was, Matthew thought, the key to her success. She lowered her eyes demurely. \"How gracious of you, sir. How kind. We thank you.\"\\n\\n Grace didn\u0027t thank anyone. She loaded up a glass and drank most of it down before Matthew could withdraw a silver shilling from his pocket.\\n\\n \"I\u0027ll take this girl,\" he said, holding out the coin. \"and to ease her discomfort, I\u0027ll pay an extra half-shilling.\"\\n\\n \"I\u0027m done, I said,\" Grace replied, without even offering him a look.\\n\\n \"We do have more suitable ladies, Master Corbett.\" Even as she spoke, Polly Blossom had her eyes fixed on the coin. \"I have a very pretty maiden of seventeen, lately arrived from amsterdam.\"\\n\\n \"That ugly bitch saw seventeen ten years ago,\" said Grace as she licked the empty glass with an extraordinarily long tongue.\\n\\n \"This girl,\" Matthew said. \"One shilling for thirty minutes. Plus two groats for the trouble.\"\\n\\n Suddenly Polly\u0027s eyes narrowed as she smelled a rat. \"Very extravagant, aren\u0027t you, siri Why may I ask do you wish this particular companion, when I offer so many other choicesi\"\\n\\n \"She appeals to me.\" Matthew ignored the girl\u0027s dark chortle. The next thing he said surprised him when it came out: \"I prefer the wicked ones.\"\\n\\n \"Well, there\u0027s plenty of wickedness to go around here, sir,\" said Polly, and with a smooth motion she took a step toward him and put her hand firmly on his crotch. Before Matthew could jump back, the woman had taken stock of his package. \"He\u0027s normal,\" she told Grace. \"a shilling and two groats would make a nice end to your evening.\"\\n\\n \"Hell!\" Becca Black rumbled. \"Pay me de money and you ain\u0027t never seen such wickedness!\"\\n\\n Matthew doubted he would live through that much. He kept his hand outstretched with the shilling in his palm. Grace was busy pouring herself another glass.\\n\\n The light of avarice shone in Polly\u0027s eyes, yet she did show concern for her charges. \"Go ahead and do him as your last trick,\" she told the girl. \"I\u0027ll get you some extra ointment in the morning.\"\\n\\n Grace drank the second glass empty and slammed it down so hard Matthew thought it might shatter. Then she turned her black-eyed, feline gaze upon him and pulled up a crooked grin. \"as you please, sir.\" Her voice was a mockery of manners. \"I won\u0027t feel you down there, anyways.\"\\n\\n With a forefinger, Polly directed Matthew to the money bowl, where he added his coins to the collection. as Matthew followed Grace up the stairs, Polly called out sharply, \"Make sure you give Master Corbett his money\u0027s worth! The customer always comes first in this house!\"\\n\\n No comment was given from the sullen whore. She continued up the stairs, leading Matthew into a candlelit corridor with four doors on either side and one at the far end. In gilded frames on the walls hung scandalous drawings of such fevered intertwinings that a blush heated Matthew\u0027s cheeks. another Turkish lamp on a small table sent out blue tendrils of incense, the spicy-sweet scent hiding perhaps the more offensive odors of sweat and musk. She opened the second door on the right and went in without a word to her customer, whose heart had begun to pound with a wild rhythm even though his intentions were honorable. He could hear Becca Black singing again downstairs, and again there was a harsh rasp of female laughter from along the hall before Grace shut the door at his back.\\n\\n It was a plain bedroom with pale yellow walls and a single shuttered window. The bed was rumpled and obviously had seen hard use tonight. On a small round table sat a triple-wicked candle-holder. The flames gave the room a more romantic glow than it deserved, for Matthew did notice ugly cracks in the plaster. There was a mousy little gray chair, a chest-of-drawers with a washing-bowl atop it, and next to it an hourglass. On the wall was a small square mirror. Pegs held various items of female clothing. The place was neater than Matthew had expected, as the plank floor had been swept clean and everything was orderly but for the bed, and he wished not to look too closely at the sheets.\\n\\n Grace stood staring at him, her expression blank.\\n\\n Matthew had no idea what to say. So he began with \"I assume you\u0027ve been busy lately,\" and immediately winced at the ridiculous statement.\\n\\n \"Your name\u0027s Corbetti\" she asked, and then she frowned slightly. \"Have I seen you beforei\"\\n\\n \"Possibly. One night at the Thorn Bush.\"\\n\\n She seemed to be trying to remember, but it was beyond her. She walked past him to the chest and slid a drawer open, trailing the faint odor of peppermint. at least, he thought, she kept her teeth clean.\\n\\n \"You can call me Matthew,\" he told her.\\n\\n She turned around and had a light brown object about seven inches long and oily-looking dangling off her hand. She said, \"Put this sheath on yourself and I\u0027ll turn the glass when you\u0027re ready, or if you want me to put it on for you I\u0027ll turn the glass now. What\u0027s it to bei\"\\n\\n Matthew had heard of the penis-sheaths, but he\u0027d never before seen one. Made of sheep\u0027s gut, as he understood. He stared at the thing in Grace Hester\u0027s hand, and in spite of his excitement at being here in this den of pleasure he had a queasy sensation in the pit of his stomach.\\n\\n \"I won\u0027t need that,\" he said.\\n\\n \"No sheath, no fuck, and I don\u0027t care how much money you pay. I don\u0027t want to be laid up with that damned doctor diggin\u0027 a kid out of me.\" She held it toward him adamantly. \"Go on, all the gents use it.\"\\n\\n \"Not that particular one, I hope.\"\\n\\n \"are you stupidi You use it once and toss it.\" She nodded toward a bucket on the floor. \"Thank Christ I\u0027m not the one who has to wash \u0027em.\"\\n\\n \"I won\u0027t need it,\" he repeated quietly, \"because I only want to talk.\"\\n\\n Grace was silent. She blinked as if she\u0027d been slapped. In the quiet Matthew could hear the gittern music and Becca Black\u0027s singing from the parlor. Then all the air seemed to rush back into Grace\u0027s lungs. \"Talki What the fuck abouti\"\\n\\n \"I would like to ask you a few questions.\"\\n\\n She saw he was serious. She backed away from him, as one might retreat from a frothing dog. \"Listen, you,\" she said, her voice tight. \"One scream and Becca\u0027ll carve your heart out.\"\\n\\n That threat was enough to send a shiver up his spine, but he had to keep his composure. \"I hope you won\u0027t scream, as I\u0027d like to leave here with all the parts I brought.\"\\n\\n \"You are a loon.\" Grace was nearly pushing herself into a corner. \"Who the hell talks when they could fucki\"\\n\\n \"I came here to see you for a purpose, and it wasn\u0027t...uh...that. I promise you I won\u0027t touch you. all righti\"\\n\\n \"You fool, you paid to touch me.\"\\n\\n \"That\u0027s incorrect. I paid for a half-hour of your time. I just have a few questions to ask, and then I\u0027ll leave. I\u0027ll tell Madam Blossom you were a wonderful...\" He searched for the gentlemanly word. \"Hostess. I won\u0027t touch you, and I certainly won\u0027t hurt you. Please.\" He kept his voice low and soothing. \"Trust me.\"\\n\\n Grace gave a bitter laugh. Her eyes were no longer vacant; now they held the steely glint of suspicion. She said, with nearly a spit on the planks, \"I trust nobody.\"\\n\\n Matthew decided to put himself where she might consider him the weakest. He sat down on the bed.\\n\\n Her mouth twisted. \"So now you\u0027ve changed your mindi\"\\n\\n \"No. I just want you to see that you can get out of the room at any time you please, and I won\u0027t stop you.\"\\n\\n \"You couldn\u0027t stop me.\"\\n\\n \"That\u0027s probably true,\" he agreed. He reasoned she might have a dagger or two hidden around here for her own protection, in case Becca was slow up the stairs. \"I really do need to ask you a few things. Important things.\"\\n\\n Grace just watched him without speaking. The penis-sheath was caught in her fist. \"If you\u0027ll answer them as truthfully as possible,\" Matthew continued, \"I\u0027ll go on my way and you can get to bed. To sleep, I mean.\"\\n\\n Still she made no response, but Matthew saw she wasn\u0027t going to scream. at least for now his heart was safe.\\n\\n She took a hesitant step forward and then passed him, pulling herself away so she wouldn\u0027t graze his knees. She returned the penis-sheath to the drawer and then closed it. Her right hand came up and turned the hourglass over, and the sand began to slither through. Before she faced him again, she opened the chest\u0027s top drawer and brought something out that Matthew couldn\u0027t see at first. She went directly back to the corner in which she felt safe and when she turned toward him Matthew saw she was holding close to herself a small, dingy cloth doll with a red-stitched mouth and black buttons for eyes.\\n\\n \"What do you want to knowi\" she asked warily.\\n\\n \"First of all, what your relationship is with Reverend Wade.\"\\n\\n \"Whoi\"\\n\\n \"William Wade. The reverend at Trinity Church.\"\\n\\n Grace stared blankly at him, with her doll nestled in the crook of an arm.\\n\\n \"You don\u0027t know Reverend Wadei\" Matthew asked.\\n\\n \"I suppose I\u0027ve heard the name. I hear a lot of names. But why should I know himi\" an evil little grin stole across her face. \"Does he come here in disguisei\"\\n\\n \"No.\" He noted she looked a bit disappointed that the reverend wasn\u0027t walking on the fiery edge of Hell. He himself was dismayed by the response, for he thought it to be truthful from her tone of voice and lack of reaction to the name. \"What about andrew Kipperingi I presume you know-\" She was already nodding vigorously, so there was no use in finishing it.\\n\\n \"andy, you mean. Oh, he\u0027s a right fine gent. Big and handsome and the money flows out of him like water under London Bridge. He comes here two, three times a week. Sometimes stays the whole night. Gets a deal from the old dragon. He\u0027s a lawyer, you know.\"\\n\\n \"Yes.\"\\n\\n \"Wait.\" Grace had been warming, but now she froze again. \"andy\u0027s not in any kind of trouble, is hei\" She took a step toward the door that made Matthew almost bolt to his feet, expecting the shrill scream for Becca Black. \"Hey, who are you to be askin\u0027 questions about andyi I\u0027m not gonna be helpin\u0027 you put the finger on him, no matter what he\u0027s done.\"\\n\\n \"I didn\u0027t say he\u0027d done anything.\"\\n\\n \"You can ask any of the girls here. The ladies, I mean.\" Grace thrust her sharp chin at him as she crushed the doll against her breasts. \"andy\u0027s made of sterlin\u0027. Just who the hell are you, anywayi\"\\n\\n \"I mean no harm to Mr. Kippering,\" Matthew said calmly. \"I was only trying to settle the fact that you knew him. I saw you together at the Thorn Bush, but I wanted to hear it from you.\"\\n\\n \"all right, I know him. So does every other lady here. Even the old dragon takes him to bed once in a while, and I hear it\u0027s for free.\" Grace spoke that word with disgust.\\n\\n Matthew couldn\u0027t fathom how to proceed from this point. If Grace Hester didn\u0027t know Reverend Wade, then what had Kippering been going on about that day at the docki What is it you know about Grace Hesteri Kippering had asked, there in the shadows of the masted ships. This can\u0027t get out, do you understandi\\n\\n Matthew decided to change course. The sand made a faint hissing noise as it collected at the bottom of the glass. \"How long have you been herei\"\\n\\n \"Since the end of april, I suppose. Whyi\"\\n\\n \"Dr. Godwin,\" Matthew said. \"Did you know himi\"\\n\\n \"That old farti Got himself killed good and proper, didn\u0027t hei\" The subject of her dear sterling andy behind them, Grace was beginning to warm up once more. \"They say he nearly had his head cut off,\" she said, with a delicious glee bordering on the obscene.\\n\\n \"He took care of you ladies, yesi Before Dr. Vanderbrocken stepped ini\"\\n\\n \"and Godwin poked us, too, while he was at it. Old bastard had a cock on him. and at his age! You see Nicole downstairsi The skinny onei Godwin was on her every time she turned around. Gave her some fuckin\u0027 dinner plates for her birthday, the very night he got his neck opened. Said he loved her. Can you believe iti\" She made a face. \"Love, in a place like this!\"\\n\\n \"It is amusing,\" Matthew agreed, but actually he thought it was very sad. The plates, he recalled, had been crafted by Hiram Stokely.\\n\\n \"If Nicole wasn\u0027t such a fuckin\u0027 gin-fiend, she\u0027d be rich from all that silver Godwin paid her. and she said some nights after he shot his cannon and lay there sleepy he called her a different name. When he started sobbin\u0027 on her shoulder, she kicked him out, silver or no. a whore\u0027s got her pride.\"\\n\\n \"a different namei\" Matthew asked, intrigued. \"What was iti\"\\n\\n \"Nicole said it was...Susan, I think. You\u0027ll have to ask her yourself. anyway, Godwin was a strange old bird. Drunk half the time, and his hands were always cold, too.\"\\n\\n \"I may have to speak to Nicole,\" Matthew said, mostly to himself. \"I\u0027d like to find out more about Dr. Godwin.\"\\n\\n Grace grunted. \"Now you\u0027re soundin\u0027 like him.\"\\n\\n Matthew brought his attention back. \"Sounding like whoi\"\\n\\n \"andy. Wantin\u0027 to know when Godwin was here, and what time he left and all that. He talked to Nicole about the old bastard. Nicole said he stuck his cock in her and shot in his sheath and then all he wanted to do was ask questions about Godwin, like that was the real reason he came. I mean...the real reason he was here.\"\\n\\n \"Is that soi\" Matthew asked, watching Grace rub the doll and realizing she was unconscious of needing the security of a bit of dirty cloth stitched over a stuffing of straw. a relic from her past, he thought. So too might the name Susan be a relic from Godwin\u0027s past. Could it also have had something to do with his murderi \"Miss Hester,\" he said, \"just one more question. Did andrew Kippering never mention to you the name of William-\"\\n\\n \"Stop,\" she directed. \"What did you call mei\"\\n\\n \"Miss Hester,\" Matthew said. \"Your name.\"\\n\\n \"My namei\"\\n\\n Matthew had a sudden piercing insight as sharp as a dagger stab. \"Your name isn\u0027t Grace Hester.\"\\n\\n \"Hell, no. I\u0027m Missy Jones,\" she answered. \"Grace Hester\u0027s in the room at the end of the hall. She\u0027s the sick girl.\"\\n\\n \"The...sick girli\"\\n\\n \"Consumption. Gotten worse and worse these last few days. Becca says she\u0027ll be passin\u0027 soon. Why she\u0027s got the biggest room in the house, I don\u0027t know.\"\\n\\n \"Oh...I\u0027ve been stupid,\" Matthew said in almost a gasp. He stood up, and to her credit Missy Jones did not back away. \"I\u0027ve been very, very stupid.\"\\n\\n \"Stupid about whati\"\\n\\n \"The meaning of things.\" He leveled his gaze at her. \"Miss Jones, can I get in to see Grace Hesteri\"\\n\\n \"The door\u0027s kept locked. Grace is a rounder. Even sick, she wants to go out to the Thorn Bush and cull a trick. Last time she got out, andy had to go bring her back.\"\\n\\n Matthew knew now. He knew, and it had been there in front of him the very night Eben ausley\u0027s stomperboys had introduced his face to a mound of horse apples. \"Is there any way I can get in to see heri Just for a moment.\"\\n\\n \"Door\u0027s locked, as I say.\" She had begun to look nervous again. \"Why do you want to see heri You don\u0027t...uh...favor sick girls, do youi\"\\n\\n \"No, it\u0027s nothing like that. It\u0027s honorable, I promise you.\"\\n\\n \"I don\u0027t understand it,\" Missy said, but then she chewed on her lower lip and stroked her doll and said, \"I...suppose...I can trust you. Can\u0027t Ii\"\\n\\n \"You can.\"\\n\\n She nodded. \"The old dragon won\u0027t like it. Neither will Becca. You\u0027ll have to be quick.\" Then she hugged her doll close and said with her eyes downcast, \"The key\u0027s up on top. The sill over the door. If anybody catches you, you\u0027ll be in for it. and me too.\"\\n\\n \"Nobody\u0027s going to catch me,\" he assured her. \"and even if they did, I can promise you that neither one of us will be harmed in any way. Do you believe thati\"\\n\\n \"No,\" she said. Then, with a frown that brought her brows together: \"Maybe. I don\u0027t know.\"\\n\\n Matthew went to the door, and she quickly moved aside. \"Thank you for your time, Miss Jones. and thank you for your help.\"\\n\\n \"It\u0027s no matter,\" she answered. His hand was on the doorlatch when she said, \"You can call me Missy, if you like.\"\\n\\n \"Thank you,\" he said again, and he offered her a smile. He might have wished for a smile from her in return, but she was already crossing the room to her waterbowl to wash the makeup off her face and the doll was pressed up against her cheek. He wondered what she looked like underneath the powder, and what story was hidden in her soul. He had no time to linger; he went out, quietly closed the door, and walked down the hall.\\n\\n He found the key quick enough. as he started to push it into the lock, he thought that a scream from the real Grace Hester would bring the house down upon him, but if this were a game of chess he held a bishop against a pawn. He heard Becca still singing in the parlor, this time a happier West Indies tune. He slid the key home, turned it, and opened the door.\\n\\n This bedroom was practically the same as Missy\u0027s, though perhaps a few feet wider. On the floor was a wine-red rug. Two candles burned, one upon the bedside table and another atop the chest-of-drawers.\\n\\n The sheets moved and the girl who lay there, her face pallid and her dark hair sweat-damp, sat up with an obvious effort. She had high cheekbones and a narrow chin, and in some long-ago time she might have been pretty but now she was wrecked on the coast of desolation.\\n\\n The heavy makeup had masked her sickness, and the strong drink had given her false strength. She was the girl Matthew had seen stagger out of the Thorn Bush in the company of andrew Kippering, that night the stomperboys had darkened Matthew\u0027s complexion.\\n\\n Grace Hester stared at him, her mouth open. Becca sung in the parlor and the gittern played its lilting, sunny notes.\\n\\n \"Fatheri\" the girl asked, her voice slurred and weary yet...hopeful.\\n\\n Matthew said quietly, \"No,\" and he backed out of the room before his heart might break. \\n\\n","sourceLink":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2/page-32.html","bookId":2251,"book":{"id":2251,"title":"The Queen of Bedlam (Matthew Corbett #2)","description":"Storyline: The Queen of Bedlam (Matthew Corbett #2) \\n The unsolved murder of a respected doctor has sent ripples of fear throughout a city teeming with life and noise and commerce. Who snuffed out the good man\u0027s life with the slash of a blade on a midnight streeti The local printmaster has labeled the fiend \"the Masker,\" adding fuel to a volatile mystery...and when the Masker claims a new victim, hardworking young law clerk Matthew Corbett is lured into a maze of forensic clues and heart-pounding investigation that will both test his natural penchant for detection and inflame his hunger for justice.\\n","cover":"https://allnovel.net/images/the-queen-of-bedlam-matthew-corbett-2.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:10:38 PM"}}
