{"id":86081,"no":5,"title":"Page 5","content":"No one sat down. No one moved.\n From far back of the room Matthew thought he heard the sound of a bass Chinese gong, muffled. He caught a movement beside him and looked over at Solomon Tully, whose mouth was stretched wide open and whose new choppers, wet with spit, were sliding out of the gaping aperture. Without a thought, Matthew reached out and pushed them back in until something clicked. Tully continued to stare open-mouthed at the colony\u0027s new governor.\n \"I said, you may be seated,\" Lord Cornbury urged, but the way his peacock feathers swayed had some already mesmerized.\n \"God above,\" whispered Magistrate Powers, whose eyes were about to pop, \"the lord\u0027s a lady!\"\n \"Gentlemen, gentlemen!\" a voice boomed from the back. There came the tap of a cane\u0027s tip, followed by the noise of boots clumping on the pineboards. High Constable Gardner Lillehorne, a study in purple from his stockings to the top of his tricorn, strode up to the front and stood at ease, one hand resting on the silver lion\u0027s head that adorned his black-lacquered cane. \"Ladies also,\" he amended, with a glance toward Polly Blossom. \"Lord Cornbury has asked you to be seated.\" He heard, as did the whole assemblage, the noise of giggling and scurrilous chatterings back where the crowd became a mob. Lillehorne\u0027s nostrils flared. He lifted his black-goateed chin like an axeblade about to fall. \"I,\" he said, in a louder voice, \"would also ask you not to show discourtesy, and to remember the manners for which you are so justly famous.\"\n \"Since wheni\" the magistrate whispered to Matthew.\n \"If we are not seated,\" Lillehorne went on against what was mostly still shock instead of resistance, \"we will not witness Lord Cornbury\u0027s address this day...I mean, his remarks this day.\" He stopped to pat his glistening lips with a handkerchief that bore the new fashion, an embroidered monogram. \"Sit, sit,\" he said with some annoyance, as if to wayward children.\n \"I\u0027ll be damned if my eyes haven\u0027t gone,\" Tully told Matthew as they sat down and the others got themselves settled again, as much as was possible. Tully rubbed his mouth, vaguely noting that the corners of his lips felt near split. \"Do you see a man up there, or a womani\"\n \"I see...the new governor,\" Matthew answered.\n \"Pray continue, sir!\" Lillehorne had turned around to face Lord Cornbury, and perhaps only Matthew saw that he squeezed his lion\u0027s head so hard his knuckles were bleached. \"The audience is yours.\" With a gesture of his arm that would have made competent actors challenge Lillehorne to a duel for the honor of the theater, the high constable retreated to his place at the back of the room where, Matthew considered, he could watch the reactions of the crowd to see how the popular wind ruffled Cornbury\u0027s feathers.\n \"Thank you, Mr. Lillehorne,\" said the governor. He gazed out upon his people with his purpled eyes. \"I wish to thank all of you as well for being here, and for showing me such hospitality as I and my wife have enjoyed these last few days. after a long sea voyage, one needs time to rest and recuperate before appearing properly in public.\"\n \"Maybe you need more time, sir!\" some wag shouted back in the gallery, taking advantage of all the swirling smoke to hide his face. a little laughter swelled up but it froze on Lillehorne\u0027s wintry appraisal.\n \"I\u0027m sure I do,\" agreed Lord Cornbury good-naturedly, and then he gave a ghastly smile. \"But rest will do for some other day. On this afternoon I wish to state some facts about your town-our town now, of course-and offer some suggestions as to a future avenue toward greater success.\"\n \"Oh, mercy,\" quietly groaned Magistrate Powers.\n \"I have been in consultation with your aldermen, your high constable, and many business leaders,\" Cornbury went on. \"I have listened and, I hope, learned. Suffice it to say I have not accepted this position lightly from my cousin, the Queen.\"\n Lillehorne thumped his cane tip against the floor, daring anyone to chortle for fear of a night in the gaol.\n \"My cousin, the Queen,\" Cornbury repeated, as if chewing on a sweet. Matthew thought he had very heavy eyebrows for such a lady. \"Now,\" the governor said, \"let me outline where we are.\"\n For the next half-hour, the audience was held not in rapture but rather by the droning on of Cornbury\u0027s less-than-majestic vocal skills. The man might be able to carry a dress, Matthew mused, but he couldn\u0027t manage a decent speech. Cornbury meandered through the success of the milling and shipbuilding businesses, the fact that there were nearly five thousand residents and that now in England people saw New York as not a struggling frontier town but a steady venture able to return sterling investment on the pound. He gave his lengthy opinion on how someday New York might surpass both Boston and Philadelphia as the central hub of the new British Empire, but added that first a shipment of iron nails that had accidentally gone to the Quaker town from the old British Empire must be retrieved so as to rebuild the structures unfortunately burned in the recent fire, as he did not trust treepegs. He waxed upon the potential of New York as a center for farming, for apple orchards and pumpkin fields. and then, going on forty minutes in his dry dissertation, he hit upon a subject that made the citizens sit up.\n \"all this potential for industry and profit must not be wasted,\" Cornbury said, \"by late-night carousings and the resulting problem of slugabeds. I understand the taverns are not closed here until the last...um...gentleman staggers out.\" He paused a moment, surveying the audience, before he clumsily plowed ahead. \"Forthwith, I shall decree that all taverns close at half past ten.\" a murmur began and quickly grew. \"also, I shall decree that no slave is to set foot in a tavern, and no red Indian shall be served-\"\n \"Just a moment, sir! Just a moment!\"\n Matthew and the others up front looked around. Pennford Deverick had stood up and was casting an eagle-eye at the governor, his brow deeply furrowed as a sign of his own discontent. \"What\u0027s this about the taverns closing early, siri\"\n \"Not early, Mr. Deverick, isn\u0027t iti\"\n \"That\u0027s right. Mr. Deverick it is.\"\n \"Well. Not early, sir.\" again the hideous smile emerged. \"I wouldn\u0027t call ten-thirty at night early, by any stretch. Would youi\"\n \"New York is not a town constrained by a bedtime, sir.\"\n \"Well, then, it ought to be. I\u0027ve done a study on this. Long before I set out from England, many wise men afforded me their opinions on the wastage of available manpower due to-\"\n \"The blazes with their opinions!\" Deverick said sharply, and when he spoke sharply it was like a very loud knife to the ears, if a knife might be loud. Matthew saw the people around him flinch, and beside him Robert Deverick looked as if he wished to crawl under the nearest stone. \"Do you know how many people here depend on the tavernsi\"\n \"Depend, siri On the ability to consume strong drink and in the morning be unable to go about their duties to themselves, their families, and our towni\"\n Deverick was already waving him off with the governor\u0027s ninth word. \"The taverns, Lord Cornblow...\"\n \"...bury,\" said the governor, whose quiet voice could also be cutting. \"Lord Cornbury, if you please.\"\n \"The taverns are meeting places for businessmen,\" Deverick continued, swirls of red beginning to come up on his cheeks not unlike the governor\u0027s rouge. \"ask any tavern owner here.\" He pointed toward various personages. \"Joel Kuyther over there. Or Burton Lake, or Thaddeus O\u0027Brien, or-\"\n \"Yes, I\u0027m sure the assembly is well-stocked,\" Cornbury interrupted. \"I presume you are also a tavern owneri\"\n \"Lord Governor, if I mayi\" again the smooth and rather oily High Constable Lillehorne slid forward, the lion\u0027s head on his cane nodding for attention. \"If you haven\u0027t been properly introduced to Mr. Deverick other than by name, you should know that he represents, in a way, all the taverns and their owners. Mr. Deverick is a goods broker, and it is by his untiring enterprises that the establishments are properly stocked with ale, wine, foodstuffs, and the like.\"\n \"Not only that,\" Deverick added, still staring squarely at the governor. \"I supply most of the glasses and platters, and a majority of the candles.\"\n \"and to also mention a majority of the candles used by the town,\" said Lillehorne, who Matthew thought was up to getting free wine for a year at his own favorite haunt.\n \"and, not least,\" Deverick pressed on, \"the majority of lanterns that hold those candles, supplied to the town\u0027s constables for a reasonable allowance.\"\n \"Well,\" Lord Cornbury said after a short rumination, \"it seems you run the town then, sir, is that not soi For all your good works procure both the peace and-you would have me believe-prosperity of New York.\" He lifted his gloved hands to show the palms, in an attitude of surrender. \"Shall I sign over my governing charter to you, siri\"\n Don\u0027t ask that of Lillehorne, Matthew thought. The high constable would use his own blood for want of ink.\n Deverick stood very straight and stiff and tall, his face with its craggy boxer\u0027s nose and high creased forehead taking on an expression of composed nobility that perhaps Lord Cornbury could do well to emulate. Of course Deverick was a rich man. Possibly one of the wealthiest in the colony. Matthew didn\u0027t know much about him-who didi for he was certainly a lone wolf-but he\u0027d heard from Grigsby that Deverick had fought his way out of the London rubbish piles to stand here, grandly clothed and as cold as midwinter\u0027s pond ice, staring down an official popinjay.\n \"I have my own fields of governance,\" replied Deverick, with a slight lift of his chin. \"I should stay within their boundaries lest I trip over another man\u0027s fence. But before I release this subject, let me please ask you to meet with myself and a committee of the tavern owners to discuss the matter at your convenience ere you decide upon a fixed course of action.\"\n \"Oh, he\u0027s good,\" Powers whispered. \"I didn\u0027t know there was so much lawyer in old Pennford.\"\n Lord Cornbury again hesitated, and Matthew thought the man was not so schooled in diplomacy as he ought to be. Surely his feminine nature would seize upon a truce, if not so much to appease a very influential man but to get through his first public display without a riot.\n \"Very well,\" the governor said flatly, with no trace of interest in hearing any other opinion. \"I shall delay my decree for one week, sir, and thank you for your remarks.\" With that gesture, Pennford Deverick returned to his seat.\n Some of the discordant hubbub that had been brewing back in the mob pot began to simmer down now, but there were occasional hoots and hollers out on the street that proclaimed the verdict of the common man. Matthew wondered if a live governor such as the one standing before them could be worse than a dead mayor; well, time would tell.\n Cornbury now launched upon another speech in which he praised every gentleman-and gentle lady, of course-for their support and recognition of the need for strong leadership in this growing and all-important town. Then, his smug horse half whipped to death, he said, \"Before I ask that this meeting be adjourned, are there any comments from youi any suggestionsi I want you to know I am an open-minded man, and I shall do my best to solve whatever problems may arise, small or large, to aid this town in its orderly and profitable progress. anyonei\"\n Matthew had in mind something to ask, but he warned himself against it because it was sure to anger Lillehorne and in his position that wasn\u0027t wise. He\u0027d already in the past month left two letters with the high constable\u0027s clerk outlining his thoughts and had heard nothing back, so what was the point of further expressing an opinioni\n Suddenly old wild-haired Hooper Gillespie stood up and said in his raspy wind-weathered voice, \"See here, sir! I\u0027ve got a problem needs fixin\u0027!\" He sailed on, as was his way, without waiting for a response. \"I run the ferry between here and Breuckelen and I\u0027m sick and tired of seein\u0027 them bullywhelp boys a-roamin\u0027 the river. You know they set fires out on Oyster Island to run them boats on the rocks, enough to make ye weep to see a good ship wrecked thataway. They got a cove they\u0027s hidin\u0027 in, I can point it out to ye quick enough. Holed up there in a shipwreck hulk, they got \u0027emselves a right nice hidin\u0027 place there all covered with weeds and sticks and such, \u0027nuff to make a beaver throw a jealousy. Well, it\u0027s gonna come to killin\u0027 if them boys ain\u0027t brought to justice, and I see \u0027em all the time a\u0027-workin\u0027 their mischiefs and bad intents. and you know they come up alongside me a night back first a\u0027 June and robbed me, robbed all my passengers right there pretty as you please. Next time I\u0027m feared if we don\u0027t have no coin or drink to scold \u0027em off with they\u0027re gonna run somebody clean through, \u0027cause their leader, that young fella thinks he\u0027s the like of Kidd his-self, well he carries a rapier sword and I tell you I don\u0027t like havin\u0027 a blade so near my throat on a night the Devil wouldn\u0027t be out there on that damn river. What do ye sayi\"\n Lord Cornbury said nothing, for the longest spell. His eyes had gotten very large, which did nothing for his beauty. Finally, he asked of the audience, \"Can anyone here translate that into proper Englishi\"\n \"Oh, Mr. Gillespie\u0027s prattling on, sir,\" said Cornbury\u0027s new favorite middleman, the high constable. \"He\u0027s mentioning a problem with some river trash that I am planning to clean up very soon indeed. It\u0027s nothing you need think about.\"\n \"What\u0027d he sayi\" Gillespie asked the man sitting next to him.\n \"Sit down, Hooper!\" commanded Lillehorne, with an imperial wave of that cane. \"The governor doesn\u0027t have time for your little situations.\"\n afterward, Matthew wondered why he did it. He thought it was because of those two words. Little situations. To Gardner Lillehorne, everything that did not pertain to himself was a little situation. The robbers that used the river as their highway was a little situation, though they\u0027d been at it for almost a year. The murder of Julius Godwin was a little situation, according to how much effort Lillehorne had put into it. So, too-and it seemed that all wickedness, sloth, and corruption came back to this point-the crimes of Eben ausley surely would have been a little situation to the constable, whom Matthew had seen gaming with the headmaster on many occasions.\n Well, it was time to make a big display of a little situation, Matthew thought.\n He stood up, steeled himself in an instant, and when Lord Cornbury looked at him with those painted eyes he said, \"I\u0027d like to ask that some measure of attention be given to the problem of the constables, sir. The problem being that, as the town has increased in population and unfortunately so has the incidence of criminal behavior, the number and efficiency of the constables has not kept pace.\"\n \"Please identify yourself,\" Cornbury requested.\n \"His name\u0027s Corbett, sir. He\u0027s a clerk for one of the town\u0027s-\"\n \"Matthew Corbett,\" came the steadfast and rather loud reply, as Matthew was determined not to be shot down by the high constable\u0027s crooked musket. \"I am clerk for Magistrate-\"\n \"-magistrates, Nathaniel Powers,\" Lillehorne kept talking, speaking directly to the governor, his own voice getting louder, \"and I am well aware of this-\"\n \"-Nathaniel Powers, sir,\" continued Matthew, battling the war of tangled voices, and then suddenly he was swept by a storm of images from his little situation with Magistrate Woodward at Fount Royal in the Carolina colony, where he had fought as a champion for the life of the accused witch Rachel Howarth. He remembered skeletons in a muddy pit, and the vile killer who\u0027d tried to murder them in the middle of the night; he remembered the evil smell of the gaol and the beautiful naked woman dropping her cloak and saying defiantly Here is the witch; he recalled the fires that burned across Fount Royal, set by a diabolical hand; he saw in that storm the mob surging toward the gaolhouse doors, the shouting for the death at the stake of a woman whom Matthew had come to believe was innocently embroiled in a plot demonic far beyond even the ravings of that mad Reverend Exodus Jerusalem; he saw the lifeforce of Isaac Woodward waning, even as Matthew risked everything for-as the magistrate had put it-his \"nightbird\"; he saw all these scenes and more awhirl in his mind, and as he turned his face upon High Constable Lillehorne he knew one thing certain about himself: he had earned the right to speak as a man.\n \"-problem, fear not. We have on hand a score of good men, loyal citizens who nightly heed their civic du-\"\n \"Sir!\" Matthew said; it hadn\u0027t been a shout, but it was as startling as a pistol report in the chamber, for no one dared raise a voice against Lillehorne. Instantly the place could have been a tomb, and Matthew thought he\u0027d indeed put the first shovel to his grave.\n Lillehorne stopped speaking.\n \"I hold the floor,\" Matthew said, the heat rising in his face. He saw Eben ausley give a mean little smile and then hide it behind the hand that cupped his chin. Later for him, Matthew thought. Today for me.\n \"What did you sayi\" Lillehorne came forward, a slow step at a time. This was a man who could glide. His narrow black eyes in the long pallid face were fixed upon his enemy with almost delicious anticipation.\n \"I hold the floor. I have the right to speak freely.\" He looked at Cornbury. \"Do I noti\"\n \"Um...yes. Yes, of course you do, son.\"\n Ugh, Matthew thought. Soni He stood sideways to the high constable, not prepared to fully turn his back on the man. Beside him, Magistrate Powers said sotto voce, \"Give your best.\"\n \"Please,\" Lord Cornbury urged, evidently feeling quite the benignant ruler now. \"Do speak freely.\"\n \"Thank you, sir.\" One more uneasy glance at Lillehorne, who\u0027d stayed his forward progress, and then Matthew gave all his attention to the man in the dress. \"I wished to point out that we-our town-suffered a murder two weeks ago, and that-\"\n \"Just one murderi\" Cornbury interrupted, with a lopsided grin. \"Mind you, I just made a sea voyage from a city where a dozen murders a night is commonplace, so bless your stars.\"\n Some laughter ensued from this, notably Lillehorne\u0027s chortle and a repugnant noseblow guffaw from none other than ausley. Matthew kept his face expressionless and continued. \"I do bless my stars, sir, but I\u0027d rather look to the constables for protection.\"\n Now Solomon Tully and the magistrate laughed, and across the aisle Effrem Owles gave a little gleeful yelp.\n \"Well.\" The governor\u0027s smile was not so hideous, or perhaps Matthew was getting accustomed to the face. \"Do go on.\"\n \"I\u0027m aware of London\u0027s mortality rate.\" The Gazette made sure of that, with all its grisly descriptions of throat-cuttings, decapitations, strangulations, and poisonings of men, women, and children. \"also of the fact that London has an advanced force of civic organization.\"\n \"Not too well organized, unfortunately,\" Cornbury said, with a shrug.\n \"But think of how many murders there might be a night, without that organization. and add to that all the other criminal acts that occur between dusk and dawn. I\u0027m proposing, sir, that we as a community take London\u0027s model into example and do something now to stem criminal violence before it becomes...shall we say...rooted.\"\n \"We don\u0027t have any criminal violence here!\" shouted someone from the back. \"That\u0027s just hog\u0027s breath, is all!\"\n Matthew didn\u0027t look around; he knew it was one of those so-called score of good men defending his woe-begotten honor. Other shouts and hollers burbled around, and he waited until they quieted. \"My point,\" he said calmly, \"is that we need organization before we have a problem. When we\u0027re chasing the cart it might be too late.\"\n \"You have suggestions, I assumei\"\n \"Lord Governor!\" Lillehorne, from the sound of the anguish in his voice, had been holding his breath while this discourse-this affront to his authority-was taking place. \"The clerk is free to write his suggestions and give them to my clerk, just as any man or woman in this room or this town or this colony can do. I don\u0027t see the need for this public laundering!\"\n Was there any point in reminding Lillehorne of the letters already written and obviously rejected or discarded outrighti Matthew didn\u0027t think so. \"I do have a few suggestions,\" he said, still speaking directly to Cornbury. \"May I state them, for the public recordi\" He nodded toward the scribes with quills poised over parchment paper at the aldermen\u0027s table.\n \"You may.\"\n Matthew thought he heard a hissing sound from behind him. Lillehorne was not having a good day, and it was likely to get worse. \"The constables,\" Matthew began, \"need to meet at a common place before their rounds begin. They should sign their names in a ledger, indicating what time they arrive for duty. They should also sign out, and so receive permission from a higher authority before they go back to their homes. They should sign an oath not to drink on duty. and, to be honest, the drunkards among them should be culled and sent packing.\"\n \"Reallyi\" Cornbury adjusted his hat, as the peacock feathers had begun to droop over into his eyes.\n \"Yes sir, really. The higher authority at this...this station, call it...should be responsible for making sure they\u0027re fit for service, and passing out to them lanterns and some sort of noise-making devices. Say a ratchet crank. Those are used in London, are they noti\" The Gazette said so, therefore no need to wait for Cornbury\u0027s verification. \"Something the Dutch used to do, and we for whatever reason ceased doing, was giving green-glassed lanterns to the constables. Therefore when you saw a green lantern\u0027s glow, you knew at whom you were looking. I think there also ought to be a program of training for the constables. They should all be able-\"\n \"Hold, hold!\" Lillehorne nearly shouted. \"The constables are picked from the common stock! What kind of training are you talking abouti\"\n \"They should all be able to read and write,\" Matthew said. \"also it wouldn\u0027t hurt if they were men whose eyesight was proven not to be faulty.\"\n \"Listen to this!\" The high constable was now back on stage, playing to the crowd. \"The clerk makes it seem as if we\u0027re a town full of dunce-caps!\"\n \"One dunce-cap is too many,\" Matthew answered; and with that he knew his future would be a battleground. Lillehorne was ominously silent. \"I would also suggest, Lord Cornbury, that for the purpose of finding the best individuals for this nightly task, they should be paid from the common fund.\"\n \"Paidi\" Cornbury managed to look both bemused and shocked at the same time. \"In moneyi\"\n \"Just as for any job. and let this central station be a serious workplace, not a warehouse or stable used as an afterthought. I think there are other details worth looking into, as well. Larger candles that burn longer, for instance. and more of them afforded to the constables and also placed in lanterns on every street corner. I\u0027m sure Mr. Deverick might help with that.\"\n \"Yes of course,\" Deverick spoke up quickly, but everyone including Matthew knew he was already counting the extra lucre. \"I also like the idea of the green lanterns. I can get those as a special order.\"\n \"This has not passed my approval yet, sir!\" Cornbury obviously had no liking for Pennford Deverick, and wasn\u0027t about to let the moneywagon run away from him. \"Please withhold your pleasure!\" Then he directed a piercing stare at Matthew, who felt the power of royalty like a fist balled up to knock him down. \"How is it you\u0027ve given such thought to this, and the high constable has heard nothing of iti\"\n Matthew pondered this. Everyone waited, with some expectation. Then Matthew said, \"The high constable is a busy man, sir. I\u0027m sure these ideas would have come clear to him, eventually.\"\n \"Or perhaps not.\" Cornbury frowned. \"Dear me, I\u0027ve seen men duel to the death over lesser affronts to offices as this. Mr. Lillehorne, I assume you have the good of the town in mind, and that would preclude any offense you might take at this young man\u0027s bravura. Yesi\"\n Gardner Lillehorne said with the hint of a hiss, \"My lord, I am only here to sssserve.\"\n \"Very good. Then I shall read over these remarks from the public record and I shall ask you at some point to meet with myself and, of course, the aldermen for further discussion. Until then, Mr. Deverick, I don\u0027t wish to see any green lanterns floating about in the dark. and you may sit down, Mr. Corbett, with thanks for your thoughtful suggestions. anyone elsei\"\n Matthew sat down, having been thoroughly dismissed. But Tully jabbed an encouraging elbow into his ribs and Powers said, \"Good show.\"\n \"Siri I have a question, if you pleasei\"\n The voice was familiar. Matthew looked around to see his chess-playing comrade stand up. Effrem Owles was twenty years old, but already the gray streaks were pronounced on the sides of his bird\u0027s-nest thatch of brown hair. His father, the tailor, had gone completely silver-haired by age thirty-five. Effrem was tall and thin and wore round spectacles that made his intelligent dark brown eyes seem to float out of his face. \"Effrem Owles, sir,\" he said. \"I do have a question, if it\u0027s not so...improper.\"\n \"I\u0027ll be the judge of impropriety, young man. ask away.\"\n \"Yes sir, thank you. Well then...why is it you\u0027re dressed as a womani\"\n a gasp went up that might have been heard \u0027round the world. Matthew knew Effrem had asked the question in all sincerity; it was not the younger man\u0027s nature to show cruelty or ill-will, but his vice-if such could be called-was a plain-spoken curiosity that sometimes rivaled even Matthew\u0027s.\n \"ah.\" Lord Cornbury lifted a gloved and ringed finger. \"ah, that. Thank you for asking, Mr. Owles. I do understand how some-many, even-might not fathom my attire today. I am not always dressed so, but I decided that I should today at our first meeting show my respect and solidarity of spirit with the royal lady who has given me this wonderful opportunity to represent her interests so far from the mother shore.\"\n \"You mean-\" Effrem began.\n \"Yes,\" Lord Cornbury said, \"my cousin-\"\n \"The Queen,\" supplied some harsh-voiced rascal from back amid the mob.\n \"There you have it.\" The governor smiled at his citizens as if he were the very sun. \"Now I must retire from you and go about my business. Your business, of course. I promise to obey your call and your needs, as much as is humanly possible. Never let it be said that Edward Hyde is not responsive to the people. Good day, all of you, and I trust that at our next meeting we shall all have progress to report. Good day, gentlemen,\" he said to the aldermen, and with a sharp turn he made his way back toward the door and out of the chamber, leaving voices both calling and cat-calling, and Matthew wondering how many hours it had taken the man to practice flouncing in that gown. The crier, still visibly shaken, managed to croak that the meeting was ended and God save Queen anne and the town of New York.\n \"That\u0027s that,\" said Magistrate Powers, which suitably summed everything up.\n On his way out through the converging crowd, which seemed torn between near-hysterical laughter and sheer speechless shock, Matthew caught Effrem\u0027s eye and gave a lift of the chin that said Good question. Then with the next step he was aware of the sweet scent of flowers and Polly Blossom was passing him, leaving her provocative perfume up his nostrils. No sooner was she past than Matthew\u0027s forward progress was stopped by a silver lion\u0027s head pressed firmly against his collarbone.\n Up close, Gardner Lillehorne was not a large man. In fact, he was three inches shorter than Matthew and wore too-large suits that did not hide his spindly frame but served to hang from it like baggy washing on a clothesline. His face was long and thin, accentuated by the precisely trimmed black goatee and mustache. He did not wear wigs, yet the blue sheen of his black hair pulled back with a dark purple ribbon suggested artificiality, at least for the season\u0027s latest dye from India. His nose was small and pointed, his lips like those of a painted doll\u0027s, his fingers small and his hands almost childlike. Nothing about him at close range was large or imposing, which Matthew thought had to do with why he was never likely to be granted a mayorship or governor\u0027s charter; the big, sprawling English empire liked big, sprawling men as their leaders.\n at least Lord Cornbury appeared to be a large man, under the dress. That was an area Matthew wished not to think about too much. Yet at this moment, for all his near-diminutive stature, High Constable Lillehorne appeared to have filled his guts and lungs and fleshy cavities with angry bile, for he seemed swollen to twice his size. Matthew had once, as an urchin living on the waterfront before he\u0027d gone to the orphanage, captured a small gray frog that in his hand expanded itself until it was twicefold all slippery slick skin, pulsating warts, and glaring enraged black eyes as big as duit coppers. Looking upon Lillehorne reminded Matthew of this maddened toad, which had promptly squirted his hand with piss and jumped into the East River.\n \"How very kind of you,\" said the goateed and livid puffer, in a quiet voice strained through clenched teeth. \"How very, very decent of you...Magistrate Powers.\"\n Matthew realized that, though Lillehorne was staring daggers at him, the high constable was addressing Powers at his right side.\n \"To ambush me in such a fashion, before the new governor. I knew you wished me out of a job, Nathaniel, but to use a clerk as your weapon of removal...it doesn\u0027t suit a gentleman like yourself.\"\n \"I heard Matthew\u0027s suggestions the same as you,\" Powers said. \"They were his own.\"\n \"Oh, of course they were. For certain. You know what Princess said to me, just this morningi She said, \u0027Gardner, I hope the new governor will shine a little light on you, and possibly report back to the Queen herself what a good job you\u0027re doing in a thankless situation.\u0027 Can\u0027t you see her face as she said that, Nathanieli\"\n \"I suppose,\" came the answer. Matthew knew that, though the true name of Lillehorne\u0027s rather socially voracious wife was Maude, she preferred to be called \"Princess,\" since her father was known in London as the \"Duke of Clams\" after his shellfish eating-house on East Cheap Street.\n \"You and I have had our differences over one case or another, but I hardly expected this. and to hide behind a boy!\"\n \"Siri\" Matthew had decided to stand firm, though the lion\u0027s head was trying to shove him off-balance. \"The magistrate had nothing to do with this. I spoke for myself, pure and simply.\"\n Lillehorne produced a mocking half-smile. \"Purei I doubt it. Simple-minded, yes. The time wasn\u0027t right to bring this issue to the forefront. I have the governor\u0027s ear, I could make these changes in our system gradually.\"\n \"We might not be able to wait for such gradual change,\" Matthew said. \"Time and the criminal element may overtake us, and whatever system you believe we have.\"\n \"You are an impudent fool.\" Lillehorne gave Matthew\u0027s chest a painful thrust with the cane and then, thinking better of any further public display, brought the instrument down to his side. \"and don\u0027t think I won\u0027t be watching you in case you want to overstep your bounds again, clerk.\"\n \"You\u0027re missing the point, Gardner,\" said Powers in an easy, nonthreatening voice. \"We\u0027re all on the same side, aren\u0027t wei\"\n \"and what side might that bei\"\n \"The law.\"\n It wasn\u0027t common that Lillehorne couldn\u0027t come up with a stinging response, but this time he fell silent. Suddenly an even worse visage came up alongside the high constable\u0027s shoulder. a hand touched the shoulder.\n \"Tonight at the Blind Eyei\" ausley inquired, pretending that neither Matthew nor the magistrate stood before him. \"Montgomery\u0027s vowing to go double-or-nothing at Ombre.\"\n \"I shall bring my wallet, in order to hold the winnings from Montgomery\u0027s and your own.\"\n \"Good afternoon, then.\" ausley touched the brim of his tricorn and glanced at Powers. \"and good afternoon to you, sir.\" Then he waddled along with the stream of citizens past Matthew, leaving in his wake the overpowering odor of cloves.\n \"Just remember your place,\" the high constable warned Matthew, not without some heat, and Matthew thought he might be pissed on yet. But Lillehorne suddenly put an odious smile on his face, called to one of the sugar mill owners, and sidled away from Matthew and Powers to put the grab on another man of greater financial influence.\n They got out of the chamber, out of the building, and onto the street where the sunlight was still bright and groups of people stood about discussing what they\u0027d witnessed.\n The magistrate, who looked tired and worn in the more glaring illumination, said he was going home to have a spot of tea in his rum, put his backside in a chair, and ponder on the differences not only between men and women but between talkers and doers. Then Matthew himself started up the incline hill of the Broad Way toward home, figuring there were always pots to be done and that the wheel and the work had a wonderful way of smoothing even the wicked edges of the world into a more comfortable shape. \n","sourceLink":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2/page-5.html","bookId":2251,"book":{"id":2251,"title":"The Queen of Bedlam (Matthew Corbett #2)","description":"Storyline: \n The Queen of Bedlam (Matthew Corbett #2) \n The unsolved murder of a respected doctor has sent ripples of fear throughout a city teeming with life and noise and commerce. Who snuffed out the good man\u0027s life with the slash of a blade on a midnight streeti The local printmaster has labeled the fiend \"the Masker,\" adding fuel to a volatile mystery...and when the Masker claims a new victim, hardworking young law clerk Matthew Corbett is lured into a maze of forensic clues and heart-pounding investigation that will both test his natural penchant for detection and inflame his hunger for justice.\n \n","cover":"https://allnovel.net/images/the-queen-of-bedlam-matthew-corbett-2.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-queen-of-bedlam-matthew-corbett-2.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:10:38 PM"}}
