{"id":36503,"no":5,"title":"CHAPTER V THE FORECAST","content":"The trip out to Sandford in the open trolley was bound to be either very pleasant or horrid. Today it was horrid, for a light drizzle floated in, not heavy enough to demand that curtains be lowered and not light enough to be just damp. Gloria was going out to her Aunt Harriet’s in response to the mysterious summons given in last night’s letter. There seemed to be many things mysterious lately about her aunt, but Gloria was determined that no unforeseen circumstance should come between her and her father’s commission to the foreign port. From a small beginning Edward Doane had quickly made his worth known to the big firm he was employed by, and now the chance long hoped for had come, right alongside of the opportunity to accept it. Gloria’s education was to be assured, and with it that special care expected from such circumstances as a first class boarding school afforded. Because of the pronounced peculiarities of Gloria’s Aunt Harriet, her father had not interfered with any matters concerning his wife’s relatives, and even the loved Aunt Lottie had been very gently refused when she had asked him to act as one of the two executors of her estate. Gloria did not know of the request. She only knew that her Aunt Harriet and some strange man had been put in charge, and she was too delicately sensitive about the whole situation to ask any direct questions. There had been unexpected delays about the settlement, but these Gloria condoned with the assurance to her father that with Aunt Harriet and Hazel everything would be all right, and so she insisted he was to finish up all his business and leave the details of hers to those just mentioned. The few passengers on the jerky trolley were taking their leave of each other as the trip to Sandford lengthened, but Gloria had to ride to the Green, then transfer to Oakley. The misty rain was collecting stringy little drops when she alighted behind a rattling old farm wagon, and when it passed and she emerged from her hiding place, she almost ran into the arms of a girl crossing toward her. “Oh, hello, Gloria!” greeted the girl with the wonderful smile. “Whatever are you doing out here?” “Hello, Trix,” called back Gloria, succumbing to the ready grasp of her friend’s hand upon her arm. “I’m bound for Aunt Harriet’s—” “Oh, of course,” interrupted Trix Travers. “Thought maybe you were out for the postponed tennis match. It isn’t. Did you ever see such a mean day?” The two were upon the sidewalk now, Trix affably abandoning her evident way to the north while she traveled south with Gloria. She was older than Gloria but had that encompassing way about her that always swept folks off their feet and into her graces. Even the tennis racket under her arm had no cause to complain that it was being disappointed in a possible victory, for Trixy held it fondly and found no fault herself. The girls chatted as they walked, Trixy told Gloria of her cousin Hazel’s try “in the tournament” and hinted of her ambitions to make the team at “her school,” but Gloria was prudently impersonal, and only said how fine tennis was, and how she wished the girls at Barbend would get up a club. “You babes,” teased Trixy, “better be playing bean-bag. It’s safer.” Her sally was a compliment, the smile and tone completely belying her words. Presently a little roadster swung up to the curb and a young man, after greeting Trixy, asked if he could not give them a lift. It was while driving out to Oakland that Gloria tried to vision herself in these new surroundings permanently. The town was so unlike Barbend—a newly built place with everything glowing and shining and threatening to break out over night in further improvements. There was a hum and a din, but no moan of the water bending over the bar, and no call of the kingfishers’ tallying their catches from the lake or river. And how would Tommy compare with this artless Hal Caldwell? Of course Hal was older, but would Tommy ever get to be like that? The capable little car buzzed along. Trixy chatted first into Gloria’s ear then over the wheel into Hal’s. Every one on the way bowed, smiled or called out pleasantly, and while the ride was only a short one it seemed to Gloria to typify life in Sandford. They left her in front of her Aunt Harriet’s new cottage, and Trixy wanted Gloria to promise she would call her up on the ’phone before she left town. Trixy Travers was the sort of girl who makes friends as readily as she smiles, and who keeps them without any more apparent effort. But whatever happened within the cottage between Gloria and her Aunt Harriet it seemed to take all the glow out of the girl’s face, and to put more gleam into her dark eyes. She did not wait to see Hazel later, instead, she walked away quickly, not even waiting for the little “jigger” that would have taken her to the regular trolley. Had Trixy Travers happened to meet her on the return trip, perhaps even her winning smile might not have been able to penetrate Gloria’s clouds. The rain had stopped and it was late afternoon. A repressed sunset was apologizing for the other dismal outlines of a jaded world, but none of this diverted the young girl under the linen hat that shaded little wisps of curls making tendrils to border the pretty face. It was pretty even in its sadness. Tommy happened to be at the square when her car rumbled in. She tried to avoid him but he waited for her, his own face aglow with some good news. “I made it!” he exclaimed. “I made the extra three dollars.” “Oh, that’s good.” Gloria jerked her mind back to the disabled bicycle and smiled. “Yep, I ran the launch all afternoon and Pop Sargeant gave me the dollar he’s been owing me so long.” “That’s fine,” said Gloria abstractedly. “And what do you think?” went on Tommy. “Old lady Trivett made mother a present of a horse-shoe geranium, the kind ma always admired.” “She never!” exclaimed Gloria. “Sure did,” insisted Tom. “We were awfully surprised.” “I should think you would be,” agreed Gloria. She and Tom were leaving the village behind them and wending their way homeward. “I tell you, Tom,” mused Gloria. “I guess poor old Nancy felt sorry for being so—so hasty. You can’t always judge folks, can you?” “No. Ma said she’d rather have that potted slip all ready for the winter, you know, than most anything else.” “So, see what your wheel spill did after all.” Gloria laughed lightly—rather too lightly for Gloria. “That geranium’s what they call a conscience gift, I guess,” she continued. “You know how Walter Garrabrant sent a dollar to the trolley company last year?” “Yes, but that seemed foolish,” replied Tom. “If he stole rides he didn’t use any extra power.” “Tom Whitely! I’m ashamed of you!” declared Gloria. “Of course the trolley company can’t be robbed any more than other folks. I believe the very meanest feeling must be that of taking and keeping something belonging to someone else.” She shuddered so that Tom looked up queerly. “What’s the matter, Glo? Did you have any trouble out to your aunt’s?” “Why no. Of course not,” said Gloria quickly. “How’s your cousin with the red hair?” “Look out who you’re calling a red head, Tom Whitely,” charged Gloria, “I can’t see that your own head is exactly black.” “’Tisn’t as carroty as hers,” retorted Tom. “Well, how is the girl with the golden locks? If you like that better.” “I didn’t see Hazel,” replied Gloria indifferently. Then hurried to talk of something else. “Tom,” she said suddenly, “I guess I’ll have time to go over and see the peace offering. Jane doesn’t expect me till the six o’clock car.” “And Mumsey will be glad to see you, Glo,” responded the boy, brightly. “She said this morning you were scarcer than hen’s teeth.” “I don’t like to be compared with hen’s teeth, but since there isn’t any such thing perhaps I’ll forgive you. How’s all the bruises?” “Turning green and mother says that’s the last stage. But no fooling, that old arm is stiff.” He demonstrated with a couple of easy exercises and even winced at those. “Get the wheel?” “I wouldn’t take it. The chain rattled like a flivver. There’s mother fetching in kindling. I thought I left enough for a week,” and before Gloria had time to reply Tom was off to relieve the mother of her kindling basket. Amid praise and good wishes for Nancy Trivett the rose geranium was presently exhibited. “You can’t always tell the difference between a wasp and a bee,” said Mrs. Whitely. “Both buzz a lot but only one poisons.” “Well, Nancy is more the wasp—” “Tommy-lad! You hush!” ordered the mother. “Nancy Trivett leads a lonely life—” “Moth-er!” mocked Tom. “As if any one could be lonesome with those geese, chickens and—” But the mother shooed the irrepressible Tom clear off the porch before he could further tell of Nancy Trivett’s diversions. “I heard Sally Hinds say the new teachers were to board at Blains,” said Mrs. Whitely, while Toni remained at a safe distance. “Yes?” said Gloria. “What’s the matter, child? You don’t seem a bit like yourself,” remarked Mrs. Whitely, noting Gloria’s abstraction. “I’m just tired,” replied the girl, avoiding those eyes so like Tom’s in their kind scrutiny. “And you see—I’m not going to Barbend school next term.” Then in snatches and exclamations, the prospect of Gloria’s change of school, change of home life and change, perhaps, of acquaintance was talked of. But somehow Gloria could not respond to her friend’s sympathetic eagerness. Tom went for Higgins’ cows while the way to the Doane’s cottage was traversed, but before they had reached the lane where Gloria should have parted with her companion, she suddenly jerked out a queer “S’long!” and raced off leaving Tom with his mouth open wider than his eyes. This was a new Gloria. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3079/85046.html","bookId":965,"book":{"id":965,"title":"Gloria: A Girl and Her Dad","description":"简介： The boy was taller than the girl, this could be noticed from quite a distance, but other marks of difference, such as Glorias red cheeks and Toms brave freckles, her black eyes flashing while Toms were meek, blue and shadowy; these distinct and contr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3079","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
