{"id":36506,"no":8,"title":"CHAPTER VIII NANNY’S RETURN","content":"Greatly as they enjoyed the feast, and what is greater than a feast on the shores of a lake on a perfect autumn evening—still, the thrill of adventure enshrouded that little goat. Mr. Doane did not give orders. He was one of those charming men who would not interfere with children’s plans unless he felt obliged to do so through some safety measure, so now, as each planned and the other contradicted as to the best method of getting Nanny across the lake and back to her little shed among Mrs. Higgins’ lima bean poles, Mr. Doane just ate his sandwiches and drank his lemonade as any guest of honor should have done. “Let me tell you! Hey, listen a minute!” begged Tom. He was copying Mr. Doane’s manner in a sort of aloofness until now. “I know a goat can swim—” “But not so far,” interrupted Mr. Doane. “Oh, well, maybe,” acceded Tom. “But anyway, we don’t have to take her in the launch—” “I should say not!” cried out Gloria, while the other girls gathered in their scant skirts apprehensively. “’Course you don’t have to take her in the launch,” echoed George Alton, who was the best “echoer” in the party, but never seemed able to send out an original suggestion. “She could float,” lisped Neddie, trying to take care of his own sandwich, while he ate the one Ranny gave him. They were too busy thinking to laugh. The goat must be brought back to Barbend, but how? “A raft!” exclaimed Tom, who had considered and disregarded almost every other craft for the visiting goat. “That’s it,” replied Mr. Doane, smiling broadly. “I was just waiting to see if any scout would think of that.” “Sure, that’s it, a raft,” repeated Jerry quite as if he had been waiting to give out the information. “We can make it—easy.” “How?” asked Ranny. He had not complete faith in Jerry’s ideas. “We’ve got hammer and nails and that’s heaps more than scouts generally have to start with,” said Mr. Doane. “It seems to me that this is pretty much a boys’ party,” remarked Gloria. She had sprinkled the flowers with lake water, and refused to let Neddie feed the goat any more of their sweet-flag root. After all, it did seem that boys knew best how to have a good time in the woods. “Why, Gloria!—” her father exclaimed under his breath. “Haven’t you been having a good time?” “Oh, of course, daddy, but the boys have climbed trees—” “I thought I saw you up a tree—” “Oh, that! That was only a little birch, and Mildred wanted a big branch to chew on,” replied Gloria. She was sunburned from the water’s sun and her hair was flying wildly about her head. Her red sweater “had whiskers on it,” as some one had remarked, for briars and brambles can pull a sweater pretty well apart. Still, she must have enjoyed herself, although there was that far-away look in her dark eyes, and often when the others were too busy to notice, she would gaze steadily at her father and seem to study anew his loved personality. Now the girls took exception to her complaint of the afternoon’s pleasure, and each tried to outdo the other in declaring they had had simply a wonderful time. Getting the raft made and putting the surprised goat upon it caused considerable excitement. But it was finally accomplished, and when the last knot was tied as gently as Tom could tie it, and the little animal lay helpless, her full faun-colored length upon the rough woods’ timber, Gloria said it reminded her of the Bible pictures of Abraham’s sacrifice. “All aboard!” called out Mr. Doane. “I’ve promised to get you youngsters home before supper time, and just look at that sun!” “Couldn’t I get a couple more white stones?” begged Neddie. “You’ve got plenty of stones,” scoffed his brother Jerry. “And what won’t mother do to you for stuffin’ them in that good blouse?” The trophies of the hunt were not as varied as usual, as Mrs. Higgins’ goat had taken up a lot of time, but then, it was a real find, and now as the launch started off, the boys were simply gasping with the excitement of “draggin’ home the prey.” “We’ll go as smoothly as we can,” announced Mr. Doane, “for poor old Nanny won’t know exactly what to make of her sail.” “But she isn’t kickin’,” declared Ranny. “I thought she’d kick like a steer. “Why, Ranny Blake!” scoffed Mildred. “How could she kick with her feet tied?” “I mean—wiggle them,” corrected Ranny. “She does take it all right,” remarked Tom, who had given up his seat in the bow to keep a hand on the rope that trailed from the stern. No hunters from the wilds ever returned with more precious spoils than Nanny constituted, as she lay quite contentedly upon her rugged raft. And in spite of Gloria’s comment, that the party had been mostly for boys, the girls were now as eager and enthusiastic over the capture as were their sterner companions. Crossing the lake took but a few minutes—less than half an hour really, and once upon the home shore there was an exciting time deciding just who would bring to Mrs. Higgins her errant goat. A wreath of wild flowers had been woven by the girls on the trip across, and this looked very festive indeed upon the neck of the prodigal. Besides this, her reins were interwoven with sprays and sprigs of foliage, so that her return was marked with gaiety and glamor, when Neddie drummed on a tin pan and Arthur piped on a squeaky tin whistle, as the march towards home-quarters was finally under way. “It isn’t far, let’s all go,” proposed Blanche when the escort was discussed, and there being no dissenting vote her plan was unanimously adopted. Mr. Doane laughed heartily as his little guests started off. He was delighted that Gloria had made so many friends in her home town, and while he may have feared the effects of new surroundings upon his brave, if self-willed, daughter—he was too anxious to get away and make brighter prospects for her, to entertain doubts of the ultimate success of his plan. The last of the marchers had turned the corner before he covered up the engine of the Finnan-Laddie, and a shout from some of the boys sent back a distant report of the triumphal advance. Over on the back road the youngsters were leading Nanny. She took it all so indifferently. In fact, the fragrant wreath upon her neck and the nice cool leaves brushing her slender sides seemed to please, rather than to trouble, the queen goat. Mrs. Higgins, fat and good-natured, was at the gate as they came up the lane. “My land of the livin’! What’s that!” she exclaimed excitedly. “Your goat,” yelled a chorus. “We found her—” “Nope, we hunted her—” “Listen, Mrs. Higgins, we trapped her—” “Oh say! Can’t you tell a story straight? “Mrs. Higgins, we lassoed her—” Each of the boys responsible for one of these outbursts now stood wondering why Mrs. Higgins did not respond. She had not taken a single step forward to welcome her retrieved goat. “What’s the matter, Mrs. Higgins?” asked Gloria. “Aren’t you glad to get her back?” The jovial Irish face wrinkled into a smile of the one piece pattern. “I was always fond of old Nanny,” said the woman, “but I sold her to Tom Sykes and here you fetched her back—” She broke into a laugh that began at her toes and surged over her generous form like a merry little earthquake. “Oh!” sighed the children, crestfallen. Nanny bleated expectantly. “We can never take her back,” began Gloria seriously. “It was some trouble, we’ll say, to get her over here.” “Sure, you couldn’t take her back,” agreed Mrs. Higgins, advancing now to welcome the wayfarer. “And isn’t she pretty?” She patted the wreath and Nanny kissed her familiar hand. “I’ll bet old Sykes starved you—” “He did,” declared Jerry. “We’ve been feedin’ her all afternoon.” The triumphant return of Mrs. Higgins’ goat. “Look at that now! I’m sure you were generous to her and gave her a fine picnic.” The goat seemed anxious to chew up the gingham apron in spite of all that, but Mrs. Higgins took the festive reins and directed the steed toward the side path that led to the barn. “I’ll tell you, children,” she addressed the entire party, “I’m real glad to get her back. There’s Becky Nolan who thinks she’s on the road to Heaven daily, if she hasn’t a pint of goat’s milk.” Seeing the joke in this remark, Mrs. Higgins explained that Becky was normally always on the road to Heaven, but she didn’t want to shorten the journey. The girls laughed but the boys were waiting for Mrs. Higgins to finish her announcement. Plainly there was a promise in her voice. “Soon as I tie her up I’ll give every one of you a nice, big bunch of grapes,” came the generous offer. “And Tom Whitely, be sure you ask me for two. I want to send one to your ma.” “Yes’m,” said Tom. And Nanny bleated a beautifully tuneful, long, echoing call. She must have been very glad indeed to get back to her own little shed under the lima bean poles. She was mocking Tom Sykes. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3079/85049.html","bookId":965,"book":{"id":965,"title":"Gloria: A Girl and Her Dad","description":"简介： The boy was taller than the girl, this could be noticed from quite a distance, but other marks of difference, such as Glorias red cheeks and Toms brave freckles, her black eyes flashing while Toms were meek, blue and shadowy; these distinct and contr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3079","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
