{"id":28677,"no":41,"title":"CHAPTER XXVIII. COMING VERY NEAR","content":"When rumours of this grave character arise, they do not come suddenly to a climax. Time must be given them to grow and settle down. It came at length, however, here. Doubts ripened into convictions: suppressed breathings widened into broad assertions: Oliver Rane had certainly murdered his wife for the sake of the tontine money. People affirmed it one to another as they met in the street--or rather, to avoid compromising themselves, said that others affirmed it. Old Phillis heard it one day, and almost fell down in a fit. She did not altogether believe it: nevertheless from that time she could not speak to her master without visibly trembling. The doctor thought she must be suffering from nervous derangement. At length it penetrated to Dallory Hall and the ears of madam; and upon madam it produced an extraordinary effect. \\n\\n \\n\\n It has been stated throughout that Mrs. North had conceived a violent dislike to Dr. Rane; or at least, that she persistently acted in a manner that produced the impression that she had done so. As if she had only waited for this rumour to accuse him of something tangible, madam made the cause her own. She never appeared to doubt the truth of the report, or to inquire as to its grounds; she drove about, here, there, and everywhere, unequivocally asserting that Bessy Rane had been poisoned, and that her husband, Oliver Rane, had done the deed. \\n\\n \\n\\n In truth Mrs. North had been in a state of mental ferment ever since she had become cognizant of the expected return of Mr. Adair to England. Why she should dread this, and why it should excite her in no measured degree she alone knew. No one around her had the least idea that the home-coming of Mr. Adair would be more to her than the arrival of any stranger might be. Restless, nervous, anxious, with an evil and crafty look in her eyes, with ears that were ever open, with hands that could never be still, waited madam. The household saw nothing--only that her tyranny became more unbearable day by day. \\n\\n \\n\\n It almost seemed as though she took up the whispered accusation against Dr. Rane as a vent for some of her other and terrible uneasiness. He must be brought to the bar of justice to answer for his crime, avowed madam. She drove to the houses of the different county magistrates, urging this view upon them; she besieged the county coroner in his office, and bade him get the necessary authority and issue his orders for the exhumation of the body. \\n\\n \\n\\n The coroner was Mr. Dale. There had recently been a sharp contest for the coronership, which had become vacant, between a doctor and a lawyer: the latter was Dale, of Whitborough, and he had gained the day. To say that madam, swooping down upon him with this command, startled him, would be saying little, as describing his state of astonishment. Occupied very much just now with the proceedings attaching to his new honour, Lawyer Dale had found less time for gossiping about his neighbours\u0027 affairs than usual; and not a syllable of the flying rumour had reached him. So little did he at first believe it, and so badly did he think of madam for the part she was playing, that, had she been a man, he would have given her the lie direct. But she was persistent, repeating the charge over and over to him in the most obnoxious and least delicate manner possible: Oliver Rane had poisoned his wife during her attack of fever, and he had done it to get possession of the tontine money. She went over the grounds of suspicion, dwelling on them one by one; and perhaps the lawyer\u0027s belief in Dr. Rane\u0027s innocence was just a trifle shaken--which, however, he did not acknowledge. After some sparring between them--Mr. Dale holding back from interference, she pressing it on--the coroner was obliged to admit that if a demand for an inquest were formally made to him he should have no resource but to call one. Finally he undertook to institute some private inquiries into the matter, and see whether there were sufficient grounds to justify so extreme a course. Madam sharply replied that if he showed the smallest disposition to stifle the inquiry, she should at once cause the Home Secretary to be communicated with. And with that she swept down to her carriage. \\n\\n \\n\\n Perhaps, of all classes of men, lawyers are most brought into contact with the crimes and follies committed by the human race. Mr. Dale had not been at all scrupulous as to what he undertook; and many curious matters had come under his experience. Leaning back in his chair after madam\u0027s visit, revolving the various points of the story, his opinion changed, and he came to the conclusion that, on the face of things, it did look very much as though Dr. Rane had been guilty. Lawyer Dale had no reason to wish the doctor harm; especially the fearful harm a public investigation might entail upon him: had the choice lain with him, he would have remained quiescent, and left the doctor to his conscience. But he saw clearly that Mrs. North would not suffer this, and that it was more than probable he would have to act. \\n\\n \\n\\n The first move he made, in his undertaking to institute some private inquiry, was to seek an interview with Mr. Seeley. He went himself; the matter was of too delicate a nature to be confided to a clerk. In his questions he was reticent, after the custom of a man of law, giving no clue, and intending to give none, as to why he put them; but Mr. Seeley had heard of the rumoured accusation, and spoke out freely. \\n\\n \\n\\n \"I confess that I could not quite understand the death,\" he avowed: \"but I do not suspect that Dr. Rane, or any one else had any hand in it. She died naturally, as I believe. Mr. Dale, this is a horrible thing for you to bring against him.\" \\n\\n \\n\\n \"I bring it!\" cried Mr. Dale. \"I don\u0027t bring it; I\u0027d rather let the doubt die out. It is forced upon me.\" \\n\\n \\n\\n \"Who by? These confounded scandalmongers?\" \\n\\n \\n\\n \"By Mrs. North.\" \\n\\n \\n\\n \"Mrs. North!\" echoed the surgeon, in surprise. \"You don\u0027t mean to say the North family are taking it up.\" \\n\\n \\n\\n \"I don\u0027t know about the family. Madam is, with a vengeance. She won\u0027t let it rest. There is an evident animus in her mind against Dr. Rane, and she means to pursue the charge to its extremity.\" \\n\\n \\n\\n Mr. Seeley felt vexed to hear it. When these rare and grave charges are brought against one of the medical body, the rest, as a rule, would rather resent than entertain it. And, besides, the surgeon liked Dr. Rane. \\n\\n \\n\\n \"Come; you may as well tell me the truth,\" cried the lawyer, breaking the silence. \"You\u0027ll have to do it publicly, I fancy.\" \\n\\n \\n\\n \"Mr. Dale,\" was the answer, \"I have told you the truth according to my belief. Never a suspicion of foul play crossed my mind in regard to Mrs. Rane\u0027s death. I saw nothing to give rise to it.\" \\n\\n \\n\\n \"You did not see her after she died: nor for some hours before it?\" \\n\\n \\n\\n \"No.\" \\n\\n \\n\\n \"You think she went off naturally.\" \\n\\n \\n\\n \"Most certainly I think so.\" \\n\\n \\n\\n \"But, see here--we lawyers have to probe opinions, you know, so excuse me. If it were to be proved that she went off in--in a different way, you would not be surprised; eh, Seeley?\" \\n\\n \\n\\n \"I should be very much surprised.\" \\n\\n \\n\\n \"From your recollection of the facts, you would not be able to bring forth any proof to the contrary?\" \\n\\n \\n\\n \"Well, no; I should not be able.\" \\n\\n \\n\\n \"There\u0027s the difficulty, you see,\" resumed the lawyer; \"there\u0027s where it will lie. You believe Rane was innocent, I may believe him innocent; but no one can furnish sufficient proof to stop the inquiry. It will have to go on as sure as fate.\" \\n\\n \\n\\n \"Cannot you stop it, Mr. Dale?\" \\n\\n \\n\\n \"I promise you this: that I will throw as many difficulties in the way of it as I possibly can. But when once I am publicly called upon to act, I shall have to obey.\" \\n\\n \\n\\n That was the end of the interview. It had a little strengthened the lawyer\u0027s doubts, if anything. Mr. Seeley had not seen her after death. What he was going to do next Mr. Dale did not say. \\n\\n \\n\\n By the day following this, perhaps the only two people accustomed to walk up and down the streets of Dallory who still remained in blissful ignorance of the trouble afloat, were Dr. Rane himself, and Richard North. No one had dared to mention it to either of them. Richard, however, was soon to be enlightened. \\n\\n \\n\\n Business took him to his bankers\u0027 in Whitborough. It was of a private nature, requiring to be transacted between himself and one of the old brothers at the head of the firm. After it was over they began talking about things in general, and Richard asked incidentally whether much further delay would take place in paying the tontine money to Dr. Rane. \\n\\n \\n\\n \"I am not sure that we shall be able to pay it at all,\" replied Sir Thomas Ticknell. \\n\\n \\n\\n \"Why not?\" asked Richard, in surprise. \\n\\n \\n\\n For answer, the old gentleman looked significantly at Richard for a moment, and then demanded whether he was still in ignorance of what had become the chief topic of the place. \\n\\n \\n\\n Bit by bit, it all came out. The Brothers Ticknell, it appeared, had heard the report quite at the first: friends are always to be found when there is an opportunity of doing a fellow-man an injury; and some one had hastened to the bankers with the news. Richard North sat aghast as he listened. His sister was supposed to have come by her death unfairly! For once in his life he changed to the hue of the grave, and his strong frame trembled. \\n\\n \\n\\n \"We hear the new coroner, Dale, has the matter in hand now,\" remarked Sir Thomas. \"I fear it will be a terrible scandal.\" \\n\\n \\n\\n Recovering the shock in some degree, Richard North took his departure, and went over to Dale\u0027s, whose offices were nearly opposite the bank. The lawyer was there, and made no scruple of disclosing what he knew to Richard. \\n\\n \\n\\n \"It\u0027s a pity that I have to take the matter up,\" said Dale. \"Considering the uncertainty at present attending it--considering that also it cannot bring the dead to life, and that it will be a most painful thing for old Mr. North--and for you too, Mr. Richard--I think it would be as well to let it alone.\" \\n\\n \\n\\n \"But who is stirring in it?\" asked Richard. \\n\\n \\n\\n \"Madam.\" \\n\\n \\n\\n \"Madam! Do you mean Mrs. North?\" \\n\\n \\n\\n \"To be sure I do. I don\u0027t say that public commotion and officious people would not soon have brought it to the same issue; but, any way, Mrs. North has forestalled them.\" And he told Richard of madam\u0027s visit to him. \\n\\n \\n\\n \"You say you have been making some private inquiries,\" observed Richard. \\n\\n \\n\\n Mr. Dale nodded. \\n\\n \\n\\n \"And what is your candid opinion? Tell me, Dale.\" \\n\\n \\n\\n But the lawyer hesitated to say he feared Dr. Rane might have been guilty. Not only because it was an unpleasant assertion to make to Dr. Rane\u0027s brother-in-law, but also because he really had doubts as to whether it was so or not. \\n\\n \\n\\n \"I hold no decided opinion as yet,\" he said. \"I may not be able to form one until the post-mortem examination has taken place----\" \\n\\n \\n\\n \"You do not mean to say that they will--that they will disturb my sister!\" interrupted Richard North, his eyes full of horror. \\n\\n \\n\\n \"Why, that\u0027s the first thing they will do--if the investigation goes on at all,\" cried the lawyer. \"That\u0027s always the preliminary step in these cases. You are forgetting.\" \\n\\n \\n\\n \"I suppose I am,\" groaned Richard. \"This has been a great shock to me. Dale, you cannot believe him guilty!\" \\n\\n \\n\\n \"Well, I can\u0027t tell; and that\u0027s the fact,\" candidly avowed the lawyer. \"There are certainly some suspicious circumstances attending the case: but at the same time, they are only what Dr. Rane may be able to explain satisfactorily away.\" \\n\\n \\n\\n \"How have the doubts arisen?\" questioned Richard. \"There were none--I suppose--at the time.\" \\n\\n \\n\\n \"As far as I can at present ascertain, they have sprung from some words incautiously dropped by Jelly, the late Mrs. Cumberland\u0027s maid. Whether Jelly saw anything at the time of Mrs. Rane\u0027s illness to give rise to suspicion I don\u0027t know. I have not yet seen her. It is necessary to go about this business cautiously; and Jelly, I expect, will not prove a willing witness.\" \\n\\n \\n\\n \"Did madam tell you this arose from Jelly?\" \\n\\n \\n\\n \"Oh dear, no. Madam does not concern herself as to the source of the suspicions; she said to me: \u0027There they are, and you must deal with them.\u0027 I had the information from my clerk, Timothy Wilks. In striving to trace the rumours to their source, I traced them to him. Carpeting him before me in this room, I insisted upon his telling me where he obtained them from. He answered readily enough, \u0027From Jelly.\u0027 It seems Jelly was spending an evening at his aunt\u0027s, or cousin\u0027s, or grandmother\u0027s--whatever it is. I mean the wife of your timekeeper, Mr. Richard North. Wilks was present: only those three; the conversation turned upon Mrs. Rane\u0027s death, and Jelly said a few words that startled them. I quite believe that was the beginning of the scandal.\" \\n\\n \\n\\n \"What can Jelly know?\" exclaimed Richard, dreamily. \\n\\n \\n\\n \"I can\u0027t tell. The report is, that Mrs. Rane had something wrong given to her by her husband the last day of her life: and that his object was to get the tontine money, which he could not touch whilst she lived. A curious thing that the husband and wife should be the two last left in that tontine!\" added the lawyer. \"I\u0027ve often said so.\" \\n\\n \\n\\n \"But even\"--Richard paused--\"if this had been so, how could Jelly have learnt it?\" \\n\\n \\n\\n \"Well, things come out in strange ways sometimes; especially if they are things that ought to be kept secret. I\u0027ve noticed it. Jelly\u0027s mistress was away, and she may have gone in to help nurse Mrs. Rane in her illness: we don\u0027t yet know how it was.\" \\n\\n \\n\\n Richard North rose to depart. \"At any rate, I do not see that it was madam\u0027s place to take it up,\" he remarked. \"She should have left that to the discretion of my father and myself.\" \\n\\n \\n\\n \"She was in a perfect fever over it,\" cried Mr. Dale. \"She talked of sending an application to the Home Secretary. I shouldn\u0027t wonder but what it has already gone up.\" \\n\\n \\n\\n From the lawyer\u0027s house, Richard went direct to that of the late Mrs. Cumberland. The darkness of evening was then drawing on. As he reached the door, Miss Beverage, in her dove-coloured Quaker\u0027s bonnet, approached it from an opposite direction. Raising his hat, he asked whether he could be allowed a five minutes\u0027 interview with Jelly. Miss Beverage, who knew Richard by sight, was very chatty and pleasant: she took him into the drawing-room and sent Jelly to him. And Jelly felt half inclined to faint as she shut the door, for she well knew what must be coming. \\n\\n \\n\\n But, after some fencing with Richard\u0027s questions, Jelly gave in. He was resolute in hearing all she could tell, and at length she made a clean breast of it. She related what she knew, and what she suspected, from beginning to end; and before she had finished, a strange relief, that Richard should know it, grew upon her. \\n\\n \\n\\n \"For I shall consider that the responsibility is now taken off my shoulders, sir,\" she said. \"And perhaps it has been nothing but this that the ill-fated lady has wanted me to do, in coming again.\" \\n\\n \\n\\n In the whole narrative, the part that most struck Richard North was Jelly\u0027s positive assertion that she had since twice seen Mrs. Rane. He was simply astounded. And, to tell the truth, he did not attempt to cast ridicule or disbelief on it. Richard North was an educated and practical man, possessed of an abundance of good common sense, with no more tendency to believe in supernatural appearances than men have in general; but his mind had been so unhinged since the interview with Sir Thomas Ticknell, that he almost felt inclined to admit the possibility of his sister\u0027s not resting in her grave. \\n\\n \\n\\n He sat with his head leaning on his hand. Collecting in some degree his scattered senses, he strove to go over the grounds of suspicion. But he could make nothing more of them than Dale had said. Grounds there certainly were, but none that Dr. Rane might not be able to explain away. Jelly drew her own deductions, and called them proofs: but Richard saw that of proofs as yet there were none. \\n\\n \\n\\n \"Ever since that first night, I\u0027ve lived in mortal horror of seeing it again,\" said Jelly, interrupting his reverie. \"Nobody can imagine, sir, what a dreadful time it has been. And when I was least thinking of it, it came the second time.\" \\n\\n \\n\\n \"To whom have you repeated this story of having seen her?\" asked Richard. \\n\\n \\n\\n \"The first time I told Dr. Rane and Mrs. Gass. This last time I told the doctor and Mr. Seeley.\" \\n\\n \\n\\n \"Jelly,\" said Richard quietly, \"there is no proof that anything was wrong, except in your fancy.\" \\n\\n \\n\\n \"And the hasty manner that she was hid out of the way, sir--no woman called in to do anything for her; no soul allowed to see her!\" urged Jelly. \"If it wanted proof positive before, it can\u0027t want it since what Thomas Hepburn related to me.\" \\n\\n \\n\\n \"All that may have been done out of regard to the welfare of the living,\" said Richard. \\n\\n \\n\\n Jelly shook her head. To her mind it was clearer than daylight. \\n\\n \\n\\n But at this juncture, a servant came in to know if she should bring lights. Richard took the opportunity to depart. Of what use to prolong his stay? As he went out he saw Mr. Seeley standing at his door. Richard crossed over and asked to speak with him: he knew of Dale\u0027s interview with the surgeon. \\n\\n \\n\\n \"Can Rane have been guilty of this thing, or not?\" questioned Richard, when they were closeted together. \\n\\n \\n\\n But not even here could Richard get at any decided opinion. It might have been so, or it might not, Seeley replied. For himself, he was inclined to think it was not so: that Mrs. Rane\u0027s death was natural. \\n\\n \\n\\n Leaving again, Richard paced up and down the dark road. His mind was in a tumult. He, with Seeley, could not think Dr. Rane guilty. And, even though he were so, he began to question whether it would not be better for his father\u0027s sake, for all their sakes, to let the matter lie. Richard put the two aspects together, and compared them. On the one side there would be the merited punishment of Oliver Rane and vengeance on Bessy\u0027s wrongs; the other would bring a terrible amount of pain, exposure, almost disgrace. And Richard feared for the effect it might have on Mr. North. Before his walk was over, he decided that it would be infinitely best to hush up the scandal, should that still be possible. \\n\\n \\n\\n But, for his own satisfaction, he wished to get at the truth. It seemed to him that he could hardly live in the uncertainty. Taking a rapid resolution, he approached Dr. Rane\u0027s; knocked at the door, and asked old Phillis if he could see her master. \\n\\n \\n\\n She at once showed him into the dining-room. Dr. Rane, weary, perhaps, with the cares of the day, had fallen asleep in his chair. He sprang up at the interruption; a startled, almost frightened expression appeared in his face. Richard North could but notice it, and his heart failed him, for it seemed to speak of guilt. Phillis shut them in together. \\n\\n \\n\\n How Richard opened the interview, he scarcely knew, and could never afterwards recall. He soon found that Dr. Rane remained as yet in ignorance of the stir that was abroad; and this rendered his task all the more difficult. Richard entered on the communication in the most delicate manner that the subject admitted of. Dr. Rane did not receive it kindly. He first swore a great oath, and then--his anger checked suddenly as if by some latent thought or fear--he sank back in his chair and bent his head on his hands, as a man struck dumb with tribulation. \\n\\n \\n\\n \"I think you need not have given credit to this report against me, Richard North,\" he presently spoke in reproachful accents. \"But I believe you lost confidence in me a year and a half ago.\" \\n\\n \\n\\n He so evidently alluded to the anonymous letter that Richard did not affect to misunderstand him. It might be better to speak openly. \\n\\n \\n\\n \"I believe you wrote that, Rane.\" \\n\\n \\n\\n \"True. I did. But not to injure your brother. I thought Alexander must be a bad man--that he must be leading Edmund North into difficulties to serve himself. I had no cause to spare him, but the contrary, for he had injured me, was injuring me daily; and I wrote what I did to Mr. North, hoping it might expose Alexander and damage him. There: you have it. I would rather have had my hand cut off than have hurt your brother. I wished afterwards that it had been cut off first. But it was too late then.\" \\n\\n \\n\\n And because of that anonymous letter Dr. Rane knew, and Richard felt, that the accusation, now made, gathered weight. When a man has been guilty of one thing, we think it a reason why he may be guilty of another. \\n\\n \\n\\n A silence ensued. They sat, the table between them. The room was rather dark. The lamp was shaded, the fire had burned low; before the large window wore stretched the sombre curtains. Richard North would have given some years of his life for this most distressing business never to have come into it. \\n\\n \\n\\n He went on with what he had to say. Dr. Rane, motionless now, kept his hand over his face whilst he listened. Richard told of the public commotion; of the unparalleled shock it had been to himself, of the worse shock he feared it might be to his father. Again there was an interruption: but Dr. Rane in speaking did not raise his face. \\n\\n \\n\\n \"Is my liberty in danger?\" \\n\\n \\n\\n \"Not yet--in one sense of the word. I believe you are under the surveillance of the police.\" \\n\\n \\n\\n \"Watched by them?\" \\n\\n \\n\\n \"Yes. But only to see that you do not get away.\" \\n\\n \\n\\n \"That is--they track me out and home, I am to understand? I am watched in and out of my patients\u0027 houses. If I have occasion to pay country visits, these stealthy bloodhounds are at my heels, night or day?\" \\n\\n \\n\\n \"I conclude it is so,\" answered Richard. \\n\\n \\n\\n \"Since when has this been?\" \\n\\n \\n\\n \"Since--I think since the day before yesterday. There is a probability, as I hear, that the Home Secretary will be applied to. If----\" \\n\\n \\n\\n \"For what purpose?\" \\n\\n \\n\\n \"For authority to disturb the grave,\" said Richard, in low tones. \\n\\n \\n\\n Dr. Rane started up, a frenzy of terror apparent in his face. \\n\\n \\n\\n \"They--they--surely they are not talking of doing that?\" he cried, turning white as death. \\n\\n \\n\\n \"Yes they are. To have her disturbed will be to us the most painful of all.\" \\n\\n \\n\\n \"Stop it, for Heaven\u0027s sake!\" came the imploring cry. \"Stop it, Richard North! Stop it!\" \\n\\n \\n\\n But at that moment there broke upon their ears a frightful commotion outside the door. Richard opened it. Dr. Rane, who had sunk on to his seat again, never stirred. Old Phillis, coming in from the scullery after a cleaning excursion, had accidentally dropped a small cartload of pots and pans. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2687/74003.html","bookId":1481,"book":{"id":1481,"title":"Bessy Rane","description":"简介： It was an intensely dark night. What with the mist that hung around from below, and the unusual gloom above, Dr. Rane began to think he might have done well to bring a lantern with him, to guide his steps up Ham Lane, when he should turn into it. He...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2687","creation":"Aug 1, 2019 12:25:13 AM","modification":"Aug 1, 2019 12:25:13 AM"}}
