{"id":89497,"no":12,"title":"Page 12","content":"“They never told Regina Holloway about the ghost?” Jackson asked. “She said that she didn’t believe in ghosts—the maids would not have told her that they had seen one,” Mama Matisse said flatly, staring at Jackson. “What about the alarm?” Jackson asked. “They heard her set the alarm. She was always careful when she was alone.” Mama Matisse hesitated. “But…she didn’t like the basement. She never went there when she was alone. She locked the door that led down to the basement.” Jackson looked at Angela. She kept staring at Mama Matisse. “Did she say why she was scared of the basement?” he asked. Mama Matisse shook her head. “She just said that basements—and attics—were inherently strange places. They were like depositories for the past, and she just didn’t like them.” Jackson mulled that information over for a moment. “She did believe, I’m sure, that she and the senator lived with a certain amount of danger and uncertainty because he was a politician.” “Yes.” Jackson then asked her, “Tell me about Senator Holloway’s bodyguard, Blake Conroy.” Mama Matisse sniffed. “He should have been guarding Mrs. Holloway, maybe,” Mama Matisse said. “The girls told me that he was always eating. Making a big mess in the kitchen, and thinking that he could make a big mess anywhere that he went. He is a big man,” she added. “Was he mean, or rude?” Jackson asked. “It’s rude to make a mess of a clean kitchen.” Angela smiled; she saw that Jackson did, too. “Did Mr. Holloway have a bodyguard just because he was a politician?” Jackson asked. “Well, there are some people—and some groups—who don’t like the senator,” Mama Matisse said. “Do you know who? Can you tell me about them?” Jackson coaxed. He apologized. “You see, we love New Orleans, but you know so much more than we do.” “Senator Holloway said all people did was fight when what they needed to do was figure out a solution. To live in our world, we had to learn to compromise. Senator Holloway likes to give speeches. He says that he believes in New Orleans and the state of Louisiana—it’s a place for everyone to live, and to live together, and to remember the past so that we never repeat it,” Mama Matisse said. “You don’t sound as if you believe all that,” Jackson said. Angela was surprised; she hadn’t heard anything out of the ordinary in Mama Matisse’s voice. She shrugged. “He is a politician.” “So, who disliked him? Who would want to hurt him?” Jackson asked. “The Aryans, for one,” she said. “Have they become a political group in this town?” Jackson asked. “They are bigots, that’s what they are,” Jake Mallory, who had been leaned against the counter, said irritably. “They’re Louisiana based, but they’re an offshoot of a group that formed up in North Dakota. Most people around here ignore them,” Jake said. “They could make Archie Bunker look like a bleeding-heart liberal.” “Archie Bunker?” Whitney murmured. “Hey, don’t you ever watch TV?” Jake asked her. “Archie Bunker, All in the Family, a major television show in its social honesty, reflecting the changing times.” “Hey, we can do television history at another time,” Jackson mimicked. “Right. The Aryans do hate Senator Holloway,” Whitney said. She was next to Jake, and she lifted a hand dismissively. “They have a campaign against interracial marriage. Ridiculous.” She made a face. “I’d be a poster child for what not to do! They are convinced that we’ve diluted America, and that all mixed babies should be aborted.” “They sound charming,” Angela said dryly. “There’s another group, too,” Mama Matisse said. “The Church of Christ Arisen.” Jackson waited, and Whitney explained, “They are like the Baptists, the Catholics and the Presbyterians all rolled into one.” Jake sniffed. “That insults the Baptists, the Catholics and the Presbyterians!” “They don’t believe in anything but early to rise, early to bed. No dancing, no drinking, no sex before marriage. Adultery means you’re banished from the church,” Whitney explained. “They believed that Haiti got what it received—just like New Orleans—when nature swept in and killed people. That was God taking vengeance on sinners. They campaign against Senator Holloway because he’s a huge believer in social reform. He opened a home for unwed mothers. They were horrified.” Jackson frowned, confused. “But—they don’t believe in abortion, I take it. Why wouldn’t they want to help unwed mothers?” “Unwed mothers shouldn’t exist,” Whitney explained. “I see,” Jackson said. “That’s why the senator needed a bodyguard,” Mama Matisse said, nodding solemnly. “I believe that the senator spent time investigating the groups, trying to find out what they might be up to next. But it was all very hush-hush, so I can’t really tell you much. He was worried that they might mean to take physical action against him.” “So, they do believe in assassination?” Jackson asked. “There was a doctor who came down from New York City and opened a clinic—a family-planning clinic. He was on a lot of the local talk shows. He denied that he had come because they call New Orleans the Big Easy,” Whitney said. “He was a smart man, from what I could see. He said that it was better for a confused young woman to abort a child early than to give birth in a ladies’ room and flush the living child down the toilet.” “What happened to him?” Angela asked. Whitney looked at her with a sad grimace. “He died in a hit-and-run accident just outside his clinic. It was over in the CBD—the Central Business District. Unrelated to their son’s accident.” Angela could see that Jackson seemed to have acquired all that he wanted from Mama Matisse. “You have been so kind to come and talk to us,” she said. “We thank you so much.” Mama Matisse rose. She looked at Whitney. “You know where I am. Come to see me, and we can talk more if you wish.” She turned to Jackson, studying him. “You have the ability to find all the answers—if you let yourself do so.” “Well, thank you for your faith. I’ll see you out,” Jackson offered, rising. “Do you need a ride anywhere? It would be the least we could do.” Mama Matisse shook her head. “I am nearing ninety. I am nearing ninety because I walk the French Quarter every day. But thank you. You do have courtesy.” “Well, thank you,” Jackson said. Angela was surprised when Mama Matisse offered him her hand. Jackson took it. There was an interesting exchange of gazes between the two. Mama Matisse smiled. They walked out together. “This is so, so sad,” Whitney murmured. “Yes, and it was good of your great-grandmother to come. Especially because she’s right. We can’t make the maids talk to us.” “Because Rene thought that she saw a ghost. And she won’t tell anyone—but my great-grandmother. Neither was here when Regina died,” Whitney said. “But I knew that they had spoken with Gran-Mama.” “Ah, but was it a ghost? A trick of the light, or her imagination—or was someone really in the house?” Angela asked reflectively. “I’d say that we opened a can of worms,” Jake said, shaking his head. “Now it doesn’t just seem like someone might have been responsible, it seems that way too many someones might have been responsible.” “Way too many someones,” Angela said. “Whitney, I love your great-grandmother. She’s fascinating. I hope to see her again.” “Yes, she is wonderful. She has so much wisdom—and kindness in her heart. But she’s not a fool, and she doesn’t like people easily.” She laughed suddenly, looking to the door. “Our fearless leader is a skeptic, and she knows it. But I think she’s seeing something deeper inside him. Something that makes him special.” Angela wasn’t sure about that. Jackson Crow was courteous, and he knew how to be completely stoic. Except for the fact that he didn’t seem to think much of her. She winced inwardly; oddly enough, she felt a great deal as Mama Matisse did. There was something deep in him that he didn’t give away easily. And more oddly still, she wanted to know what it was, wanted to know more about the real man beneath the facade. Why had he been chosen to lead their team? Firsthand knowledge and work with human behavior, she told herself dryly. But she did have a certain gift, whether he wanted to acknowledge it or not. She rose. “Excuse me, you all. I’m going to run upstairs for a minute.” “Do you want us with you?” Jake asked. “Not right now,” she told him. Leaving them, she hurried up the stairs to the second floor—and to the room where Regina Holloway had been. Right before she had died. She paused for a minute, and then she lay down on the bed as Regina might have done that fateful day. She closed her eyes. She imagined the woman who had been Regina Holloway. Her life had so recently been perfect. She’d had a loving husband. And a child. A son. She had lived in this house; she hadn’t been afraid. She had been lost and hurt. Angela let the pain sweep into her, and she opened her eyes…. She could see them. Two children. They were adorable. They were near the foot of the bed, and they had a game of jacks. The little girl had blond pigtails, and she wore a calico dress that probably ended at her ankles; the little boy was in breeches and a bleached cotton shirt and gray vest. They were both seated cross-legged, facing one another as they played.","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-12.html","bookId":2275,"book":{"id":2275,"title":"Phantom Evil (Krewe of Hunters #1)","description":"Storyline: Phantom Evil (Krewe of Hunters #1) A secret government unit, a group of renegade paranormal investigators... and a murder no one else can crack. Though haunted by the recent deaths of two teammates, Jackson Crow knows that the living commit the most heinous crimes. A police officer utilizing her paranormal intuition, Angela Hawkins already has her hands full of mystery and bloodshed. But one assignment calls to them too strongly to resist. In a historic mansion in New Orleans\u0027s French Quarter, a senator\u0027s wife falls to her death. Most think she jumped; some say she was pushed. And yet others believe she was beckoned by the ghostly spirits inhabiting the house — once the site of a serial killer\u0027s grisly work. In this seemingly unsolvable case, only one thing is certain: whether supernatural or all too human, crimes of passion will cast Jackson and Angela into danger of losing their lives... and their immortal souls.","cover":"https://allnovel.net/images/phantom-evil-krewe-of-hunters-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/phantom-evil-krewe-of-hunters-1.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:35:26 PM"}}
