{"id":89499,"no":14,"title":"Page 14","content":"\\n\\n “What was on the film?” Angela asked.\\n\\n “It looked like the ghost of a floating woman. We were out at one of the plantations. All kinds of companies have filmed out there, and you know, when it’s going to be on television they reenact the ‘haunting.’ The thing is, we hadn’t even started working on the images yet—and there she was. I don’t know how they think I pulled it off—minus an actress, lighting, editing equipment—but, supposedly, I did.”\\n\\n “Intriguing,” Angela said, looking at Jackson.\\n\\n “There’s usually something that isn’t what it appears, and it usually is manipulated,” Jackson said. “Anyway, Will and Whitney are our film team, Jake is a computer whiz—he can, and has, hacked into many places.” He smiled, staring at Jake.\\n\\n “Nothing terrible. I just know my way around a computer,” Jake said in his defense.\\n\\n When the meal ended, Jackson suggested that he and Angela go back—just in case the senator arrived early—while the others went and did some grocery shopping.\\n\\n They left Jake and Whitney at the corner store on Royal, and headed on up toward Dauphine.\\n\\n The house seemed just a house when they reached it again. Jackson opened the door and keyed in the alarm.\\n\\n “You’re still sure you want to sleep in Regina Holloway’s bedroom?” Jackson asked her.\\n\\n “Absolutely,” she said earnestly.\\n\\n “Okay, then we’ll pack up our things and move to that wing. I’ll take the bedroom right next to it.”\\n\\n They set about the task. As they did so, Angela realized that once the other two arrived, all six of them could be in the house—and not even run into one another unless they descended to the kitchen or the courtyard at the same time.\\n\\n She had just brought her belongings into the room and stepped out onto the balcony over the courtyard when the gate swung open and a black limousine drove in.\\n\\n The driver stepped out. He was tall, dark-haired and handsome. He smiled, displaying deep dimples as he opened the back door. That had to be Grable Haines.\\n\\n First out was a hulk. A true hulk. She assumed it was the senator’s bodyguard, Blake Conroy. He was clean-shaven bald, and muscled like a Titan.\\n\\n Another tall man, lean and almost elegant looking, got out of the car. He seemed to be about thirty-five, and moved with a fluid grace—and darting eyes. More than the bodyguard, he seemed to be on the lookout. He had to be Martin DuPre, the senator’s aide.\\n\\n She’d seen pictures of Senator Holloway. He was a striking man, as tall as the chauffeur, solid and lean in build, with graying dark hair and a face that was well sculpted, but showing signs of strain and character. Sad in a way that she felt as if her heart tightened, watching him.\\n\\n He looked up at the house and saw her looking down, and for a moment, his weathered features tensed; his hand came to his chest, tightly clenched.\\n\\n She realized she was standing where his wife would have stood.\\n\\n Before falling.\\n\\n Before being pushed.\\n\\n Before dying.\\n\\n She winced, and perhaps her horror at her accidental faux pas was evident, because he smiled at her then, lifted a hand and waved.\\n\\n Then Jackson stepped out from the dining room doors below to greet the senator, and she quickly stepped away from the balcony and back into the bedroom.\\n\\n She paused for a minute, wondering if she might feel anything of the woman who had lived here so briefly.\\n\\n But there was nothing, and so she started to leave the room. And then, as she did so, she thought that she felt something. A touch on her cheek. A gentle touch. Something so light it might have been imagined.\\n\\n “Regina?” she said softly.\\n\\n But again, there was nothing. And so she hurried down the stairs, anxious to meet the senator—and the men who followed behind him.\\n\\n CHAPTER SIX\\n\\n “Good to meet you, Mr. Crow. You know, I’m grateful to Adam Harrison for setting up this team.” Age became Senator Holloway. He was barely forty but looked more like fifty—a good fifty. His graying hair was left alone to gray. He had good teeth when he tried to offer a smile, and his handshake was firm.\\n\\n “We’re here to do everything that we can,” Jackson assured him.\\n\\n He turned. Angela, a little breathless, had come out the doors to stand behind him and to his side.\\n\\n “Miss Hawkins?” the senator asked, offering a hand.\\n\\n “Yes, I’m Angela,” she said. “It’s a pleasure to meet you, sir. And I’m so sorry. I saw the way that you looked up at me, and—”\\n\\n “Not to worry,” David Holloway told her. His smile was poignant. “I thought I saw an angel standing there for a minute. I understand you’re here to investigate, and that’s where you need to be in order to investigate.”\\n\\n “Senator Holloway, you did find your wife, right?” Jackson asked him.\\n\\n Holloway looked over at Jackson. “You know that, of course. You’ve read the police reports.”\\n\\n “I’m sorry. I need you to go over everything again. With me,” Jackson said.\\n\\n “Why don’t we go inside,” Angela suggested. She looked at the senator steadily. “Regina had an amazing talent as a decorator and homemaker. The house was coming along beautifully.”\\n\\n “Yes, she was talented, wasn’t she?” the senator said. He looked up at the house for a minute, as if he wanted to refuse to go in. But he said, “I like the kitchen.”\\n\\n “We’ll go hang around the kitchen table then,” Angela said.\\n\\n “Let me introduce everyone and make sure I’ve got it right, but even without files…” Jackson said, smiling. “I’m Jackson Crow, and this is Angela Hawkins. You are Blake Conroy, bodyguard, right?” He said to the massive bald man. He didn’t think that a man with so much bulk—even muscled bulk—might have scaled walls. “And, Martin DuPre,” he said, shaking the man’s hand. “We may be calling on you frequently, Martin.” DuPre’s Armani suit couldn’t conceal his litheness. And he stood close to the senator, a protective barrier, despite the hulky bodyguard nearby. “And Grable Haines, you are responsible for getting everyone everywhere, right?”\\n\\n “I go where the senator tells me,” Haines said. “That’s my job to serve Senator Holloway’s needs.”\\n\\n “Let’s go in and talk for a few minutes,” Jackson said. He wanted to split them up. As they went through the courtyard doors, he said, “Senator, would you take a walk with Angela and tell her everything that you did the night you found Regina?”\\n\\n Holloway’s mouth was grim, but he nodded.\\n\\n “Senator?” Angela said softly.\\n\\n It was evident that she had struck a sympathetic chord with the man. They might not get new evidence today, but at least he could see the dynamics between the men who served Senator Holloway, and perhaps get a better sense of the man who had believed so fully in his wife that he would not accept a verdict of suicide.\\n\\n Angela looked back at him gravely. He nodded, and she smiled grimly. It was a good communication. He may not like her and he might well be convinced still that she was a loon, but he trusted her with talking to the man; she knew it.\\n\\n Maybe they were becoming something of a team.\\n\\n “Did you come in through the front door that day?” Angela asked Senator Holloway. “Forgive me if I ask you to repeat too much. I know this is hard.”\\n\\n “Yes,” he said. While Jackson had ushered the chauffeur, the bodyguard and the aide into the kitchen, she walked down the hall to the great ballroom with the senator. He stood there a minute, his eyes filled with sadness as he looked around the room. He frowned, noting the cameras and lights and screens set up, but then the frown faded and he just looked sad again as he surveyed the furniture, covered in dust cloths and shoved against the walls.\\n\\n “It would have been beautiful,” he said.\\n\\n “You still own it,” she reminded him.\\n\\n He shook his head. “We really weren’t fanciful people. We didn’t believe in ghosts, and the house had been bought and abandoned, bought and abandoned over the years…its reputation had made it a deal when we bought it.” Holloway studied her gravely. “But you dug up bones—right after you got here. I knew if I went to Adam Harrison, he’d find the right people.”\\n\\n “I’m afraid the bones in the basement had nothing to do with your wife,” Angela told him. “That poor man was a victim, like many others in Madden C. Newton’s circle. Newton was a predator, swooping down on the misfortunes of others.” She segued back to the present. “So you came in by the front door? Didn’t your chauffeur let you off in the courtyard that day?”\\n\\n He shook his head. “No, I wasn’t in session. I have an office over in the CBD. I was working there, and I had Grable on call. I didn’t need him to hang at my side all day, so I told him just to pay attention to his cell phone.”\\n\\n There was no alibi for the chauffeur at the time Regina Holloway died.\\n\\n “So you entered through the front door?”\\n\\n “I used my key, and then I tapped in the code on the alarm pad.”\\n\\n “The alarm was set, you’re certain?”\\n\\n He nodded. “At least, I think I’m certain. Yes, I’m certain. I remember hearing the little chirps that warn you to key in the code.”\\n\\n “What next?”\\n\\n “I called out to Regina, but she didn’t answer. Obviously,” he added bitterly.\\n\\n “And then you went up the stairs and through the house?” she asked.\\n\\n He nodded.\\n\\n “Okay, let’s retrace your steps,” she said.\\n\\n He walked toward the grand staircase and she followed. He traversed the hall, turned at the ell and turned again at the last ell.\\n\\n Then he paused.\\n\\n There was absolutely no doubt in Angela’s mind that Senator David Holloway had truly loved his wife. He stood still, looking older than his years, his face a mask of grief and regret.\\n\\n “Are you all right?” she asked gently.\\n\\n He nodded and moved on. “I came to our room. I could see that she had been lying on the bed, resting. She loved this room. She was always so busy…she was industrious. That was why I wanted the house so badly. I knew she would work hard, embrace the project. And she did.” \\n\\n","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-14.html","bookId":2275,"book":{"id":2275,"title":"Phantom Evil (Krewe of Hunters #1)","description":"Storyline: Phantom Evil (Krewe of Hunters #1) \\n A secret government unit, a group of renegade paranormal investigators... and a murder no one else can crack. \\n Though haunted by the recent deaths of two teammates, Jackson Crow knows that the living commit the most heinous crimes. \\n A police officer utilizing her paranormal intuition, Angela Hawkins already has her hands full of mystery and bloodshed. \\n But one assignment calls to them too strongly to resist. In a historic mansion in New Orleans\u0027s French Quarter, a senator\u0027s wife falls to her death. Most think she jumped; some say she was pushed. And yet others believe she was beckoned by the ghostly spirits inhabiting the house — once the site of a serial killer\u0027s grisly work. \\n In this seemingly unsolvable case, only one thing is certain: whether supernatural or all too human, crimes of passion will cast Jackson and Angela into danger of losing their lives... and their immortal souls.\\n","cover":"https://allnovel.net/images/phantom-evil-krewe-of-hunters-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/phantom-evil-krewe-of-hunters-1.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:35:26 PM"}}
