{"id":89516,"no":31,"title":"Page 31","content":"\n “We can come back,” Angela said.\n “Well, let’s see what we can see in fifteen minutes. At least, I’ll get an idea of what we might be looking for when someone can get back here. There’s a library of archives here somewhere that might give us something.”\n A pleasant woman in her mid-sixties with elegant silver hair and a sweet manner refused to take Jackson’s money for entrance. “You haven’t time to see much,” she said. She brightened. “But, hopefully we’ll whet your appetite. Oh, and the new exhibit is opening tomorrow, so I know you’ll want to come back.”\n “It doesn’t open until tomorrow?” Jackson asked her.\n The woman pointed to curtains in the back. “No, I’m sorry, we still have it all under wraps.”\n He nodded. “Of course.”\n “We have a lot on Madden C. Newton, the murderer,” she said. “And that house.” The woman shivered dramatically. “It’s downright scary. Creepy. And, in the news again!”\n “So there is a lot on the house?” Jackson asked.\n “And Madden C. Newton. We have his death warrant in the display.”\n “But we can’t peek tonight?” Jackson asked, giving her a charming smile.\n “I’m so sorry—they’re still finishing up, and they’ll be doing so tonight. But if you take a quick walk-through of the rest of the museum, you’ll see that we’ve arranged a chronological history of the city. The new exhibit will focus more on the past scandal, murderers and mayhem.”\n Jackson thanked her. There was only time to get the layout of the place, really. Angela appreciated all that she saw—the stories were told with various tableaux featuring historical characters, while there was reading material on the walls between each episode of history.\n Angela tried to pull back; she wanted to at least take a look at all of the tableaux. She felt as if she sped through history—nearly three hundred years in three hundred seconds.\n And while she was there, she had a feeling that she would find something important in the museum. That she would find something that would give her a clue in the mystery of the house.\n Jackson dragged her back to where heavy canvas draperies enclosed a large section of the back. A banner over the drapery announced, “It’s here! Meet the real monsters who called the city their home throughout history, and learn how history dealt with real monsters.”\n “Tomorrow,” Jackson said glumly.\n “Hey, we’re on a mission tonight, remember?” Angela said.\n An announcement over the loudspeaker reminded guests the museum was closing.\n “Hey, I really love it. I’ll come back here.”\n Jackson ignored her for a moment, looked around, and stepped up to the heavy drapery. He pulled it back to take a peek inside.\n There were display cases at odd angles and a worker in a lab coat was still busy washing the floor. He looked up at them.\n “Museum is closed.”\n “Sorry,” Jackson said. He nodded and gave up. “All right, Angela, I guess we are on to the next part of our mission tonight. Let’s go—it is getting late. Are you hungry?”\n “Definitely. And when work combines with a good restaurant, it’s better than work combining with—”\n “Bones in a basement?” he interrupted.\n “Sure. So, we’re…trying to see what Martin DuPre might be up to?”\n He glanced down at her. “Neither Blake nor Grable like the man—while they don’t seem to have a problem with one another.”\n She was silent for a minute, and then said, “I’m just not sure what we’re actually supposed to interpret. The senator apparently had an affair with his secretary. Maybe he’s still seeing her—now that his wife is dead. However, he is definitely grieving his wife—no man could be that good an actor, not even a politician. The Aryans and the people belonging to the Church of Christ Arisen are apparently really, really messed up, but it’s not against the law to be messed up. No one likes Martin DuPre, even if they pretend to around the senator. So, where do you think that leaves us?” she asked.\n “Closer than we were yesterday,” he said.\n They neared the restaurant. To Angela’s surprise, he suddenly steered her around the block in another direction.\n “Okay, what are we doing now?” she asked.\n “Avoiding Grable Haines—he’s hanging out by the senator’s sedan just down from the entrance. We’re going to go around the block.”\n They reached the restaurant, coming in from the far side of the car.\n “Slip in, quick!” Jackson said. “I can see DuPre. They must have stopped for a drink or something, because they’re just coming now, from where they parked.”\n “What?” Yet she quickly stepped inside.\n The restaurant was situated in a building well over a century and a half old despite its modern decor. The place was jumping, an obvious indication that the food was very good—or that it had somehow become the trendy place to be. She waited in a group while Jackson spoke with the pretty girl at the front podium.\n While they waited for a hostess to bring them to their table—on the far side of an elevator shaft that brought diners to an upper level—Martin DuPre arrived with three other men. At first, they didn’t see Jackson and Angela, and they were close enough in the milling group that awaited tables for Jackson and Angela to hear their conversation.\n “Why, DuPre!” a squat and rotund man said to Martin DuPre, “this does seem to be the happening place for an evening meal. I hope you have the rest of the evening planned out as well.”\n “Of course!” DuPre said. “Gentlemen, this is my city. I know my way around. When we’ve finished eating, we’re headed to Bourbon Street. And I’ve made reservations there, too, just to make sure that you are entertained this evening.”\n “Sounds good to me,” a taller man said. “So, you know the best on Bourbon Street? Isn’t that strip clubs for college kids and the like?”\n “Not if you know where to go,” DuPre told him.\n “I’m game for anything,” said the last of DuPre’s trio of guests. “All business, you know, and a man gets a little crazy. With a new baby in the house, I don’t get out that much anymore. Nothing like a good business meeting—on Bourbon Street.”\n The conversation made Angela acutely uncomfortable–a group of middle-aged lechers.\n “Sad, huh?” Jackson whispered to her.\n “I guess…I guess some people have to pay. Or want to pay. Anyway, yuck. So much for a really nice dinner,” Angela said lightly. “But they’ll notice us soon enough. Won’t that make DuPre get as far from us as possible?”\n He brought his fingers to his lips and whispered, “Shh.”\n She moved closer to him. She meant to just whisper right away, but she found herself hesitating for a beat. His tailored shirt was crisp and clean. He smelled of shampoo and woodsy soap or aftershave, delicious. She found herself fascinated again by the bronze tone and texture of his skin, the sleek darkness of his hair and the brilliance in the back of his dark blue eyes.\n “What did you do? Pay the hostess to get the table next to his?” Angela whispered to Jackson.\n He grinned and whispered back, “Not the table next to theirs. I want to be behind, out of sight.”\n “And how will you manage that?” she asked.\n “You’ll see,” he told her.\n He had definitely done something right. DuPre and his party were seated first; they wound up at a table around the elevator shaft from DuPre and the other three men, out of sight, and yet, in a position where it seemed that anything said at DuPre’s table was amplified.\n Angela leaned toward Jackson. “Can they hear us so loudly, too?”\n “I’ll have to bump into him over there to find out,” he said.\n He opened his menu. Angela heard the men talking about oil interests. There was something that had to do with an inspection, and DuPre assured the men that he would see that everything was fine. She picked up her own menu, listening. The squat fellow had a booming voice. He could be overheard the best.\n “Well, I’m glad that Holloway has sent you out with us tonight, DuPre. David is a good fellow, but he’s been in the midst of too much tragedy lately. Not that I don’t sympathize with him, but…the man has forgotten what a good time could be,” he said.\n Angela was pretty sure that it was the tall thin fellow who spoke next, his voice lower. “Hey, I understand the man. He’s a politician, so when Regina was alive, he felt right in doing whatever he needed to do to get people moving in his direction. But now she’s gone. He needs his time of mourning. Then he’ll be all right again.”\n “He scares me,” DuPre said, speaking low, and yet the near whisper carrying. “He’s brought in a team to investigate the house, he’s so convinced that Regina didn’t kill herself. Supposedly, they’re from the government. I think they’re just a bunch of charlatans, ghost hunters. I think he wants them to prove that there’s some kind of presence in the house that killed his wife. Or maybe he’s just trying to appease the constituency.”\n “Well, now,” the taller man boomed. “That’s understandable, too. He can’t take the guilt that something he might have done caused her to take the header, you know? Frankly, I think Regina was a little off from the get-go. Might have been the death of their boy. That can do it to you. But I heard she had some kind of voodoo priestess in there—and a Catholic priest,” he said.\n “Maybe the voodoo worked too well,” the squat fellow said, laughing at what he thought was his own great joke.\n Their waitress appeared, smiling, and suggested the grouper almondine. They both agreed on the fish. Angela found herself noting that Jackson did have a knack for following and listening to people without being in the least obvious. He was pleasant with their server, not hurrying her along, but speaking easily in a manner to get their order in quickly—and the waitress on her way. \n","sourceLink":"https://allnovel.net/phantom-evil-krewe-of-hunters-1/page-31.html","bookId":2275,"book":{"id":2275,"title":"Phantom Evil (Krewe of Hunters #1)","description":"Storyline: \n Phantom Evil (Krewe of Hunters #1) \n A secret government unit, a group of renegade paranormal investigators... and a murder no one else can crack. \n Though haunted by the recent deaths of two teammates, Jackson Crow knows that the living commit the most heinous crimes. \n A police officer utilizing her paranormal intuition, Angela Hawkins already has her hands full of mystery and bloodshed. \n But one assignment calls to them too strongly to resist. In a historic mansion in New Orleans\u0027s French Quarter, a senator\u0027s wife falls to her death. Most think she jumped; some say she was pushed. And yet others believe she was beckoned by the ghostly spirits inhabiting the house — once the site of a serial killer\u0027s grisly work. \n In this seemingly unsolvable case, only one thing is certain: whether supernatural or all too human, crimes of passion will cast Jackson and Angela into danger of losing their lives... and their immortal souls.\n \n","cover":"https://allnovel.net/images/phantom-evil-krewe-of-hunters-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/phantom-evil-krewe-of-hunters-1.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:35:26 PM"}}
