{"id":95386,"no":22,"title":"Page 22","content":"THE MASK OF A GOD Why would you live in a desert, when such beauty is so near?\" Jarlaxle asked Entreri. The pair had moved quickly in the days after the disaster at Gentleman Briar\u0027s tavern, with Entreri even enlisting one wizard they found in an out-of-the-way tower magically to transport them many miles closer to their goal of the Spirit Soaring and the priest, Cadderly. It didn\u0027t hurt, of course, that Jarlaxle seemed to have an inexhaustible supply of gold coins. Now the Snowflake Mountains were in clear sight, towering before them. Summer was on the wane, and the wind blew chill, but Entreri could hardly argue Jarlaxle\u0027s assessment of the landscape. It surprised the assassin that a drow would find beauty in such a surface environment. They looked down on a canopy of great and ancient trees that filled a long, wide vale nestled right up against the Snowflake\u0027s westernmost slopes. Even Entreri, who seemed to spend most of his time denying beauty, could not deny the majesty of the mountains themselves, tall and jagged, capped with bright snow gleaming brilliantly in the daylight. \"Calimport is where I make my living,\" Entreri answered after a while. Jarlaxle snorted at the thought. \"With your skills, you could make your home anywhere in the world,\" he said. \"In Waterdeep or in Luskan, in Icewind Dale or even here. Few would deny the value of a powerful warrior in cities large and villages small. None would evict Artemis Entreri-unless, of course, they knew the man as I know him.\" That brought a narrow-eyed gaze from the assassin, but it was all in jest, both knew-or perhaps it wasn\u0027t. Even in that case, there was too much truth to Jarlaxle\u0027s statement for Entreri rationally to take offense. \"We must swing around the mountains to the south to get to Carradoon, and the trails leading us to the Spirit Soaring,\" Entreri explained. \"A few days should have us standing before Cadderly, if we make all haste.\" \"All haste, then,\" said Jarlaxle. \"Let us be rid of the artifact, and...\" He paused and looked curiously at Entreri. Then what? That question hung palpably in the air between them, though it had not been spoken. Ever since they had fled the crystalline tower in Dallabad, the pair had run with purpose and direction-to the Spirit Soaring to be rid of the dangerous artifact-but what, indeed, awaited them after that? Was Jarlaxle to return to Calimport to resume his command of Bregan D\u0027aerthe? both wondered. Entreri knew at once as he pondered the possibility that he would not follow his dark elf companion in that case. Even if Jarlaxle could somehow overcome the seeds of change sown by Rai-guy and Kimmuriel, Entreri had no desire to be with the drow band again. He had no desire to measure his every step in light of the knowledge that the vast majority of his supposed allies would prefer it if he were dead. Where would they go? Together or apart? Both were contemplating that question when a voice, strong yet melodic, resonant with power, drifted across the field to them. \"Halt and yield!\" it said. Entreri and Jarlaxle glanced over as one to see a solitary figure, a female elf, beautiful and graceful. She was approaching them openly, a finely crafted sword at her side. \"Yield?\" Jarlaxle muttered. \"Must everyone expect us to yield? And halt? Why, we were not even moving!\" Entreri was hardly listening, was focusing his senses on the trees around them. The elf maiden\u0027s gait told him much, and he confirmed his suspicions almost immediately, spotting one, and another, elf archer among the boughs, bows trained upon him and his companion. \"She is not alone,\" the assassin whispered to Jarlaxle, though he tried to keep the smile on his face as he spoke, an inviting expression for the approaching warrior. \"Elves rarely are,\" Jarlaxle replied quietly. \"Particularly when they are confronting drow.\" Entreri couldn\u0027t hold his smile, facing that simple truth. He expected the arrows to begin raining down upon them at any moment. \"Greetings!\" Jarlaxle called loudly. He swept off his hat, making a point to show his heritage openly. Entreri noted that the elf maiden did wince and slow briefly at the revelation, for even from her distance-and she was still thirty strides away-Jarlaxle, without the visually overwhelming hat, was obviously drow. She came a bit closer, her expression holding perfectly calm and steady, revealing nothing. It occurred to Entreri then that this was no chance meeting. He took a moment to listen for the silent call of Crenshinibon, to try to determine if the Crystal Shard had brought in more opponents to free it from Entreri\u0027s grasp. He sensed nothing unusual, no contact at all between the artifact and this elf. \"There are a hundred warriors about you,\" the elf maiden said, stopping some twenty paces from the pair. \"They would like nothing better than to pierce your tiny drow heart with their arrows, but we have not come here for that-unless you so desire it.\" \"Preposterous!\" Jarlaxle said, quite animatedly. \"Why would I desire such a thing, fair elf? I am Drizzt Do\u0027Urden of Icewind Dale, a ranger, and of heart not unlike your own, I am sure!\" The elf s lips grew very thin. \"She does not know of you, my friend,\" Entreri offered. \"Shayleigh of Shilmista Forest knows of Drizzt Do\u0027Urden,\" Shayleigh assured them both. \"And she knows of Jarlaxle of Bregan D\u0027aerthe, and of Artemis Entreri, most vile of assassins.\" That made the pair blink more than a few times. \"Must be the Crystal Shard telling her,\" Jarlaxle whispered to his companion. Entreri didn\u0027t deny that, but neither did he believe it. He closed his eyes, trying to sense some connection between the artifact and the elf maiden again, and again he found nothing. Nothing at all. But how else could she know? \"And you are Shayleigh of Shilmista?\" Jarlaxle asked politely. \"Or were you, perchance, speaking of another?\" \"I am Shayleigh,\" the elf announced. \"I, and my friends gathered in the trees all around you, were sent out here to find you, Jarlaxle of Bregan D\u0027aerthe. You carry an item of great importance to us.\" \"Not I,\" the drow said, feigning confusion and glad that he could further mask that confusion by speaking truthful words. \"The Crystal Shard is in the possession of Jarlaxle and Artemis Entreri,\" Shayleigh stated definitively. \"I care not which of you carries it, only that you have it.\" \"They will strike fast,\" Jarlaxle whispered to Entreri. \"The shard coaxes them in. No parlay here, I fear.\" Entreri didn\u0027t get that feeling, not at all. The Crystal Shard was not calling to Shayleigh, nor to any of the other elves. If it had been, that call had undoubtedly been completely denied. The assassin saw Jarlaxle making some subtle motions then-the movements of a spell, he figured-and he put a hand on the dark elf s arm, holding him still. \"We do indeed possess the item you claim,\" Entreri said to Shayleigh, stepping up ahead of Jarlaxle. He was playing a hunch here, and nothing more. \"We are bringing it to Cadderly of the Spirit Soaring.\" \"For what purpose?\" Shayleigh asked. \"That he may rid the world of it,\" Entreri answered boldly. \"You say that you know of Drizzt Do\u0027Urden. If that is true, and if you know Cadderly of the Spirit Soaring as well-which I believe you do-then you likely know that Drizzt was bringing this very artifact to Cadderly.\" \"Until it was stolen from him by a dark elf posing as Cadderly,\" Shayleigh said determinedly and in a leading tone. In truth, that was about as much as Cadderly had told her about how this particular pair had come to acquire the artifact. \"There are reasons for things that a casual observer might not understand,\" Jarlaxle interjected. \"Be satisfied with the knowledge that we have the Crystal Shard and are delivering it, rightfully so, to Cadderly of the Spirit Soaring, that he might rid the world of the menace that is Crenshinibon.\" Shayleigh motioned to the trees, and her companions walked out from the shadows. There were dozens of grim-faced elves, warriors all, armed with crafted bows and wearing fine weapons and gleaming, supple armor. \"I was instructed to deliver you to the Spirit Soaring,\" Shayleigh explained. \"It was not clear whether or not you had to be alive. Walk swiftly and silently, make no movements that indicate any hostility, and perhaps you will live to see the great doors of the cathedral, though I assure you that I hope you do not.\" She turned then and started away. The elves began to close in on the dark elf and his assassin companion, with their bows still in hand and arrows aimed for the kill. \"This is going better than I expected,\" Jarlaxle said dryly. \"You are an eternal optimist, then,\" Entreri replied in the same tone. He searched all around for some weakness in the ring of elves, but he saw only swift, inescapable death stamped on every fair face. Jarlaxle saw it, too, even more clearly. \"We are caught,\" he remarked. \"And if they know all the details of our encounter with Drizzt Do\u0027Urden.....\" Entreri said ominously, letting the words hang in the air. Jarlaxle held his wry smile until Entreri had turned away, hoping that he wouldn\u0027t be forced to reveal the truth of that encounter to his companion. He didn\u0027t want to tell Entreri that Drizzt was still alive. While Jarlaxle believed Entreri had gone beyond that destructive obsession with Drizzt, if he was wrong and Entreri learned the truth, he would likely be fighting for his life against the skilled warrior. Jarlaxle glanced around at the many grim-faced elves and decided he already had enough problems. As the meeting at the Spirit Soaring wore on, Cadderly fired back a testy remark concerning the feelings between the drow and the surface elves when Jarlaxle implied that he and his companion really couldn\u0027t trust anyone who brought them in under a guard of a score of angry elves. \"But you have already said that this is not about us,\" Jarlaxle reasoned. He glanced over at Entreri, but the assassin wasn\u0027t offering any support, wasn\u0027t offering anything at all. Entreri hadn\u0027t spoken a word since they\u0027d arrived, and neither had Cadderly\u0027s second at the meeting, a confident woman named Danica. Indeed, she and Entreri seemed cut of similar stuff-and neither of them seemed to like that fact. They had been staring, glowering at each other for nearly the entire time, as if there was some hidden agenda between them, some personal feud. \"True enough,\" Cadderly finally admitted. \"In another situation, I would have many questions to ask of you, Jarlaxle of Menzoberranzan, and most of them far from complimentary toward your apparent actions.\" \"A trial?\" the dark elf asked with a snort. \"Is that your place, then, Magistrate Cadderly?\" The yellow-bearded dwarf behind the priest, obviously the more serious of the two dwarves, grumbled and shifted uncomfortably. His green-bearded brother just held his stupid, naive smile. To Jarlaxle\u0027s way of thinking, where he was always searching for layers under lies, that smile marked the green-bearded dwarf as the more dangerous of the two. Cadderly eyed Jarlaxle without blinking. \"We must all answer for our actions,\" he said. \"But to whom?\" the drow countered. \"Do you even begin to believe that you can understand the life I have lived, judgmental priest? How might you fare in the darkness of Menzoberranzan, I wonder?\" He meant to continue, but both Entreri and Danica broke their silence then, saying in unison, \"Enough of this!\" \"Ooo,\" mumbled the green-bearded dwarf, for the room went perfectly silent. Entreri and Danica were as surprised as the others at the coordination of their remarks. They stared hard at each other, seeming on the verge of battle. \"Let us conclude this,\" Cadderly said. \"Give over the Crystal Shard and go on your way. Let your past haunt your own consciences then, and I will be concerned only with that which you do in the future. If you remain near to the Spirit Soaring, then know that your actions are indeed my province, and know that I will be watching.\" \"I tremble at the thought,\" Entreri said, before Jarlaxle could utter a similar, though less blunt, reply. \"Unfortunately, for all of us, our time together has only just begun. I need you to destroy the wretched artifact, and you need me because I carry it.\" \"Give it over,\" Danica said, eyeing the man coldly. Entreri smirked at her. \"No.\" \"I am sworn to destroy it,\" Cadderly argued. \"I have heard such words before,\" Entreri replied. \"Thus far, I am the only one who has been able to ignore the temptation of the artifact, and therefore, it remains with me until it is destroyed.\" He felt an inner twinge at that, a combination of a plea, a threat, and the purest rage he had ever known, all emanating from the imprisoned Crystal Shard. Danica scoffed as if his claim was purely preposterous, but Cadderly held her in check. \"There is no need for such heroics from you,\" the priest assured Entreri. \"You do not need to do this.\" \"I do,\" Entreri replied, though when he looked to Jarlaxle, it seemed to him as if his drow companion was siding with Cadderly. Entreri could certainly see that point of view. Powerful enemies pursued them, and the Crystal Shard itself was not likely to be destroyed without a terrific battle. Still, Entreri knew in his heart that he had to see this through. He hated the artifact profoundly. He needed to see this controlling, awful item be utterly obliterated. He didn\u0027t know why he felt so strongly, but he did, plain and simple, and he wasn\u0027t giving over the artifact not to Cadderly or to Danica, not to Rai-guy and Kimmuriel, not to anyone while he still had breath in his body. \"I will finish this,\" Cadderly remarked. \"So you say,\" the assassin answered sarcastically and without hesitation. \"I am a priest of Deneir,\" Cadderly started to protest. \"I name supposedly goodly priests among the least trustworthy of all creatures,\" Entreri interrupted coldly. \"They are on my scale just below troglodytes and green slime, the greatest hypocrites and liars in all the world.\" \"Please, my friend, do not temper your feelings,\" Jarlaxle said dryly. \"I would have thought that such a distinction would belong to assassins, murderers, and thieves,\" Danica remarked, her tone and expression making her hatred for Artemis Entreri quite evident. \"Dear girl, Artemis Entreri is no thief,\" Jarlaxle said with a grin, hoping to diffuse some of the mounting tension before it exploded-and he and his companion found themselves squared off against the formidable array within this room and without, where scores of priests and a group of elves were no doubt discussing the arrival of the two less-than- exemplary characters with more than a passing concern. Cadderly put a hand on Danica\u0027s arm, calming her, and took a deep breath and started to reason it all out again. Again Entreri cut him short. \"However you wish to parse your words, the simple truth is that I possess the Crystal Shard, and that I, above all others who have tried, have shown the control necessary to hold its call in check. \"If you wish to take the artifact from me,\" Entreri continued, \"then try, but know that I\u0027ll not give it over easily- and that I will even utilize the powers of the artifact against you. I wish it destroyed-you wish it destroyed, so you say. Thus, we do it together.\" Cadderly paused for a long while, glanced over at Danica a couple of times, and to Jarlaxle, and neither offered him any answers. With a shrug, the priest looked back at Entreri. \"As you wish,\" he agreed. \"The artifact must be engulfed in magical darkness and breathed upon by an ancient and huge red dragon.\" Jarlaxle nodded, but then stopped, his dark eyes going wide. \"Give it to him,\" he said to his companion. Artemis Entreri, though he had no desire to face a red dragon of any size or age, feared more the consequence of Crenshinibon\u0027s becoming free to wield its power once more. He knew how to destroy it now-they all did-and the Crystal Shard would never suffer them to live, unless that life was as its servant. That possibility Artemis Entreri loathed most of all. Jarlaxle thought to mention that Drizzt Do\u0027Urden had shown equal control, but he held the thought silent, not wanting to bring up the drow ranger in any context. Given Cadderly\u0027s understanding of the situation, it seemed obvious to Jarlaxle that the priest knew the truth of his encounter with Drizzt, and Jarlaxle did not want Entreri to discover that his nemesis was still alive-not now, at least, with so many other pressing issues before him. Jarlaxle considered blurting it all out, on a sudden thought that speaking the truth plainly would heighten Entreri\u0027s willingness to be done with all of this, to give over the shard that he and Jarlaxle could pursue a more important matter-that of finding the drow ranger. Jarlaxle held it back, and smiled, recognizing the source of the inspiration as a subtle telepathic ruse by the imprisoned artifact. \"Clever,\" he whispered, and merely smiled as all eyes turned to regard him. Soon after, while Cadderly and his friends made preparations for the journey to the lair of some dragon Cadderly knew of, Entreri and Jarlaxle walked the grounds outside of the magnificent Spirit Soaring, well aware, of course, that many watchful eyes were upon their every move. \"It is undeniably beautiful, do you not agree?\" Jarlaxle asked, looking back at the soaring cathedral, with its tall spires, flying buttresses, and great, colored windows. \"The mask of a god,\" Entreri replied sourly. \"The mask or the face?\" asked the always-surprising Jarlaxle. Entreri stared hard at his companion, and back at the towering cathedral. \"The mask,\" he said, \"or perhaps the illusion, concocted by those who seek to elevate themselves above all others and have not the skills to do so.\" Jarlaxle looked at him curiously. \"A man inferior with the blade or with his thoughts can still so elevate himself,\" Entreri explained curtly, \"if he can impart the belief that some god or other speaks through him. It is the greatest deception in all the world, and one embraced by kings and lords, while minor lying thieves on the streets of Calimport and other cities lose their tongues for so attempting to coax the purses of others.\" That struck Jarlaxle as the most poignant and revealing insight he had yet pried from the mouth of the elusive Artemis Entreri, a great clue as to who this man truly was. Up to that point, Jarlaxle had been trying to figure out a way that he could wait behind while Entreri, Cadderly, and whomever Cadderly chose to bring along went to face the dragon and destroy the artifact. Now, because of this seemingly unrelated glimpse into the heart of Artemis Entreri, Jarlaxle realized he had to go along.","sourceLink":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3/page-22.html","bookId":2138,"book":{"id":2138,"title":"Servant of the Shard (Paths of Darkness #3)","description":"Storyline: Servant of the Shard (Paths of Darkness #3) With each kill, I grow wiser, and with added wisdom, I grow stronger. Powerful assassin Artemis Entreri tightens his grip on the streets of Calimport, driven by the power of his hidden drow supporters. But his sponsor Jarlaxle grows ever more ambitious, and Entreri struggles to remain cautious and in control. Soon, the power of the malevolent Crystal Shard grows greater than them both, threatening to draw them into a vast web of treachery from which there will be no escape.","cover":"https://allnovel.net/images/servant-of-the-shard-paths-of-darkness-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:13:53 PM"}}
