{"id":95368,"no":4,"title":"Page 4","content":"A HUMBLING ENCOUNTER He had his old room back. He even had his name back. The memories of the authorities in Luskan were not as long as they claimed. The previous year, Morik the Rogue had been accused of attempting to murder the honorable Captain Deudermont of the good ship Sea Sprite, a famous pirate hunter. Since in Luskan accusation and conviction were pretty much the same thing, Morik had faced the prospect of a horrible death in the public spectacle of Prisoner\u0027s Carnival. He had actually been in the process of realizing that ultimate torture when Captain Deudermont, horrified by the gruesome scene, had offered a pardon. Pardoned or not, Morik had been forever banned from Luskan on pain of death. He had returned anyway, of course, the following year. At first he\u0027d taken on an assumed identity, but gradually he had regained his old trappings, his true mannerisms, his connections on the streets, his apartment, and, finally, his name and the reputation it carried. The authorities knew it too, but having plenty of other thugs to torture to death, they didn\u0027t seem to care. Morik could look back on that awful day at Prisoner\u0027s Carnival with a sense of humor now. He thought it perfectly ironic that he had been tortured for a crime that he hadn\u0027t even committed when there were so many crimes of which he could be rightly convicted. It was all a memory now, the memory of a whirlwind of intrigue and danger by the name of Wulfgar. He was Morik the Rogue once more, and all was as it had once been... almost. For now there was another element, an intriguing and also terrifying element, that had come into Morik\u0027s life. He walked up to the door of his room cautiously, glancing all about the narrow hallway, studying the shadows. When he was confident that he was alone, he walked up tight to the door, shielding it from any magically prying eyes, and began the process of undoing nearly a dozen deadly traps, top to bottom along both sides of the jamb. That done, he took out a ring of keys and undid the locks-one, two, three-then he clicked open the door. He disarmed yet another trap-this one explosive-then entered, closing and securing the door and resetting all the traps. The complete process took him more than ten minutes, yet he performed this ritual every time he came home. The dark elves had come into Morik\u0027s life, unannounced and uninvited. While they had promised him the treasure of a king if he performed their tasks, they had also promised him and had shown him the flip side of that golden coin as well. Morik checked the small pedestal at the side of the door next. He nodded, satisfied to see that the orb was still in place in the wide vase. The vessel was coated with contact poison and maintained a sensitive pressure release trap. He had paid dearly for that particular orb- an enormous amount of gold that would take him a year of hard thievery to retrieve-but in Morik\u0027s fearful eyes, the item was well worth the price. It was enchanted with a powerful anti-magic dweomer that would prevent dimensional doors from opening in his room, that would prevent wizards from strolling in on the other side of a teleportation spell. Never again did Morik the Rogue wish to be awakened by a dark elf standing at the side of his bed, looming over him. All of his locks were in place, his orb rested in its protected vessel, and yet some subtle signal, an intangible breeze, a tickling on the hairs at the back of his neck, told Morik that something was out of place. He glanced all around, from shadow to shadow, to the drapes that still hung over the window he had long ago bricked up. He looked to his bed, to the tightly tucked sheets, with no blankets hanging below the edge. Bending just a bit, Morik saw right through the bottom of the bed. There was no one hiding under there. The drapes, then, he thought, and he moved in that general direction but took a circuitous route so that he wouldn\u0027t force any action from the intruder. A sudden shift and quick-step brought him there, dagger revealed, and he pulled the drapes aside and struck hard, catching only air. Morik laughed in relief and at his own paranoia. How different his world had become since the arrival of the dark elves. Always now he was on the edge of his nerves. He had seen the drow a total of only five times, including their initial encounter way back when Wulfgar was new to the city and they, for some reason that Morik still did not completely understand, wanted him to keep an eye on the huge barbarian. He was always on his edge, always wary, but he reminded himself of the potential gains his alliance with the drow would bring. Part of the reason that he was Morik the Rogue again, from what he had been able to deduce, had to do with a visit to a particular authority by one of Jarlaxle\u0027s henchmen. He gave a sigh of relief and let the drapes swing back, then froze in surprise and fear as a hand clamped over his mouth and the fine edge of a dagger came tight against his throat. \"You have the jewels?\" a voice whispered in his ear, a voice showing incredible strength and calm despite its quiet tone. The hand slipped off of his mouth and up to his forehead, forcing his head back just enough to remind him of how vulnerable and open his throat was. Morik didn\u0027t answer, his mind racing through many possibilities-the least likely of which seeming to be his potential escape, for that hand holding him revealed frightening strength and the hand holding the dagger at his throat was too, too steady. Whoever his attacker might be, Morik understood immediately that he was overmatched. \"I ask one more time; then I end my frustration,\" came the whisper. \"You are not drow,\" Morik replied, as much to buy some time as to ensure that this man-and he knew that it was a man and certainly no dark elf-would not act rashly. \"Perhaps I am, though under the guise of a wizard\u0027s spell,\" the assailant replied. \"But that could not be-or could it? - since no magic will work in this room.\" As he finished, he roughly pushed Morik away, then grabbed his shoulder to spin the frightened rogue around as he fell back. Morik didn\u0027t recognize the man, though he still understood that he was in imminent danger. He glanced down at his own dagger, and it seemed a pitiful thing indeed against the magnificent, jewel-handled blade his opponent carried-almost a reflection of the relative strengths of their wielders, Morik recognized with a wince. Morik the Rogue was as good a thief as roamed the streets of Luskan, a city full of thieves. His reputation, though bloated by bluff, had been well-earned across the bowels of the city. This man before him, older than Morik by a decade, perhaps, and standing so calm and so balanced... This man had gotten into his apartment and had remained there unobserved despite Morik\u0027s attempted scrutiny. Morik noted then that the bed sheets were rumpled-but hadn\u0027t he just looked at them, to see them perfectly smooth? \"You are not drow,\" Morik dared to say again. \"Not all of Jarlaxle\u0027s agents are dark elves, are they, Morik the Rogue?\" the man replied. Morik nodded and slipped his dagger into its sheath at his belt, a move designed to alleviate the tension, something that Morik desperately wanted to do. \"The jewels?\" the man asked. Morik could not hide the panic from his face. \"You should have purchased them from Telsburgher,\" the man remarked. \"The way was clear and the assignment was not difficult.\" \"The way would have been clear,\" Morik corrected, \"but for a minor magistrate who holds old grudges.\" The intruder continued to stare, showing neither intrigue nor anger, telling Morik nothing at all about whether or not he was even interested in any excuses. \"Telsburgher is ready to sell them to me,\" Morik quickly added, \"at the agreed price. His hesitation is only a matter of his fear that there will be retribution from Magistrate Jharkheld. The evil man holds an old grudge. He knows that I am back in town and wishes to drag me back to his Prisoner\u0027s Carnival, but he cannot, by word of his superiors, I am told. Thank Jarlaxle for me.\" \"You thank Jarlaxle by performing as instructed,\" the man replied, and Morik nervously shifted from foot to foot. \"He helps you to fill his purse, not to fill his heart with good feelings.\" Morik nodded. \"I fear to go after Jharkheld,\" he explained. \"How high might I strike without incurring the wrath of the greater powers of Luskan, thus ultimately wounding Jarlaxle\u0027s purse?\" \"Jharkheld is not a concern,\" the man answered with a tone so assured that Morik found that he believed every word. \"Complete the transaction.\" \"But...\" Morik started to reply. \"This night,\" came the answer, and the man turned away and started for the door. His hands worked in amazing circles right before Morik\u0027s eyes as trap after trap after lock fell open. It had taken Morik several minutes to get through that door, and that with an intricate knowledge of every trap-which he had set- and with the keys for the three supposedly difficult locks, and yet, within the span of two minutes, the door now swung open wide. The man glanced back and tossed something to the floor at Morik\u0027s feet. A wire. \"The one on your bottom trap had stretched beyond usefulness,\" the man explained. \"I repaired it for you.\" He went out then and closed the door, and Morik heard the clicks and sliding panels as all the locks and traps were efficiently reset. Morik went to his bed cautiously and pulled the bed sheets aside. A hole had been cut into his mattress, perfectly sized to hold the intruder. Morik gave a helpless laugh, his respect for Jarlaxle\u0027s band multiplying. He didn\u0027t even have to go over to his trapped vase to know that the orb now within it was a fake and that the real one had just walked out his door. Entreri blinked as he walked out into the late afternoon Luskan sun. He dropped a hand into his pocket, to feel the enchanted device he had just taken from Morik. This small orb had frustrated Rai-guy. It defeated his magic when he\u0027d tried to visit Morik himself, as it was likely doing now. That thought alone pleased Entreri greatly. It had taken Bregan D\u0027aerthe nearly a ten day to discern the source of Morik\u0027s sudden distance, how the man had made his room inaccessible to the prying eyes of the wizards. Thus, Entreri had been sent. He held no illusions that his trip had to do with his thieving prowess, but rather, it was simply because the dark elves weren\u0027t certain of how resistant Morik might be and simply hadn\u0027t wished to risk any of their brethren in the exploration. Certainly Jarlaxle wouldn\u0027t have been pleased to learn that Rai-guy and Kimmuriel had forced Entreri to go, but the pair knew that Entreri wouldn\u0027t go to Jarlaxle with the information. So Entreri had played message boy for the two formidable, hated dark elves. His instructions upon taking the orb and finishing his business with Morik had been explicit and precise. He was to place the orb aside and use the magical signal whistle Rai- guy had given him to call to the dark elves in faraway Calimport, but he wasn\u0027t in any hurry. He knew that he should have killed Morik, both for the man\u0027s impertinence in trying to shield himself and for failing to produce the required jewels. Rai-guy and Kimmuriel would demand such punishment, of course. Now he\u0027d have to justify his actions, to protect Morik somewhat. He knew Luskan fairly well, having been through the city several times, including an extended visit only a few days before, when he, along with several other drow agents, had learned the truth of Morik\u0027s magic-blocking device. Wandering the streets, he soon heard the shouts and cheers of the vicious Prisoner\u0027s Carnival. He entered the back of the open square just as some poor fool was having his intestines pulled out like a great length of rope. Entreri hardly noticed the spectacle, concentrating instead on the sharp-featured, diminutive, robed figure presiding over the torture. The man screamed at the writhing victim, telling him to surrender his associates, there and then, before it was too late. \"Secure a chance for a more pleasant afterlife!\" the magistrate screeched, his voice as sharp as his angry, angular features. \"Now! Before you die!\" The man only wailed. It seemed to Entreri as if he was far beyond any point of even comprehending the magistrate\u0027s words. He died soon enough and the show was over. The people began filtering out of the square, most nodding their heads and smiling, speaking excitedly of Jharkheld\u0027s fine show this day. That was all Entreri needed to hear. He moved shadow to shadow, following the magistrate down the short walk from the back of the square to the tower that housed the quarters of the officials of Prisoner\u0027s Carnival as well as the dungeons holding those who would soon face the public tortures. He mused at his own good fortune in carrying Morik\u0027s orb, for it gave him some measure of protection from any wizard hired to further secure the tower. That left only sentries and mechanical traps in his way. Artemis Entreri feared neither. He went into the tower as the sun disappeared in the west. \"They have too many allies,\" Rai-guy insisted. \"They would be gone without a trace,\" Jarlaxle replied with a wide smile. \"Simply gone.\" Rai-guy groaned and shook his head, and Kimmuriel, across the room and sitting comfortably in a plush chair, one leg thrown over the cushioning arm, looked up at the ceiling and rolled his eyes. \"You continue to doubt me?\" Jarlaxle asked, his tone light and innocent, not threatening. \"Consider all that we have already accomplished here in Calimport and across the surface. We have agents in several major cities, including Waterdeep.\" \"We are exploring agents in other cities,\" Rai-guy corrected. \"We have but one currently working, the little rogue in Luskan.\" He paused and glanced over at his psionicist counterpart and smiled. \"Perhaps.\" Kimmuriel chuckled as he considered their second agent now working in Luskan, the one Jarlaxle did not know had left Calimport. The others are preliminary,\" Rai-guy went on. \"Some are promising, others not so, but none are worthy of the title of agent at this time.\" \"Soon, then,\" said Jarlaxle, coming forward in his own comfortable chair. \"Soon! They will become profitable partners or we will find others-not so difficult a thing to do among the greedy humans. The situation here in Calimport... look around you. Can you doubt our wisdom in coming here? The gems and jewels are flowing fast, a direct line to a drow population eager to expand their possessions beyond the limited wealth of Menzoberranzan.\" \"Fortunate are we if the houses of Ched Nasad determine that we are undercutting their economy,\" Rai-guy, who hailed from that other drow city, remarked sarcastically. Jarlaxle scoffed at the notion. \"I cannot deny the profitability of Calimport,\" the wizard lieutenant went on, \"yet when we first planned our journey to the surface, we all agreed that it would show immediate and strong returns. As we all agreed it would likely be a short tenure, and that, after the initial profits, we would do well to reconsider our position and perhaps retreat to our own land, leaving only the best of the trading connections and agents in place.\" \"So we should reconsider, and so I have,\" said Jarlaxle. \"It seems obvious to me that we underestimated the potential of our surface operations. Expand! Expand, I say.\" Again came the disheartened expressions. Kimmuriel was still staring at the ceiling, as if in abject denial of what Jarlaxle was proposing. \"The Rakers desire that we limit our trade to this one section,\" Jarlaxle reminded, \"yet many of the craftsmen of the more exotic goods-merchandise that would likely prove most attractive in Menzoberranzan-are outside of that region.\" \"Then we cut a deal with the Rakers, let them in on the take for this new and profitable market to which they have no access,\" said Rai-guy, a perfectly reasonable suggestion in light of the history of Bregan D\u0027aerthe, a mercenary and opportunistic band that always tried to use the words \"mutually beneficial\" as their business credo. \"They are pimples,\" Jarlaxle replied, extending his thumb and index finger in the air before him and pressing them together as if he was squeezing away an unwanted blemish. \"They will simply disappear.\" \"Not as easy a task as you seem to believe,\" came a feminine voice from the doorway, and the three glanced over to see Sharlotta Vespers gliding into the room, dressed in a long gown slit high enough to reveal one very shapely leg. \"The Rakers pride themselves on spreading their organizational lines far and wide. You could destroy all of their houses and all of their known agents, even all of the people dealing with all of their agents, and still leave many witnesses.\" \"Who would do what?\" Jarlaxle asked, but he was still smiling, even patting his chair for Sharlotta to go over and sit with him, which she did, curling about him familiarly. The sight of it made Rai-guy glance again at Kimmuriel. Both knew that Jarlaxle was bedding the human woman, the most powerful remnant-along with Entreri- of the old Basadoni Guild, and neither of them liked the idea. Sharlotta was a sly one, as humans go, almost sly enough to be accepted among the society of drow. She had even mastered the language of the drow and was now working on the intricate hand signals of the dark elven silent code. Rai-guy found her perfectly repulsive, and Kimmuriel, though seeing her as exotic, did not like the idea of having her whispering dangerous suggestions into Jarlaxle\u0027s ear. In this particular matter, though, it seemed to both of them that Sharlotta was on their side, so they didn\u0027t try to interrupt her as they usually did. \"Witnesses who would tell every remaining guild,\" Sharlotta explained, \"and who would inform the greater powers of Calimshan. The destruction of the Rakers Guild would imply that a truly great power had secretly come to Calimport.\" \"One has,\" Jarlaxle said with a grin. \"One whose greatest strength lies in remaining secret,\" Sharlotta replied. Jarlaxle pushed her from his lap, right off the chair, so that she had to move quickly to get her shapely legs under her in time to prevent falling unceremoniously on her rump. The mercenary leader then rose as well, pushing right past Sharlotta as if her opinion mattered not at all, and moving closer to his more important lieutenants. \"I once envisioned Bregan D\u0027aerthe\u0027s role on the surface as that of importer and exporter,\" he explained. \"This we have easily achieved. Now I see the truth of the human dominated societies, and that is a truth of weakness. We can go further- we must go further.\" \"Conquest?\" Rai-guy asked sourly, sarcastically. \"Not as Baenre attempted with Mithral Hall,\" Jarlaxle eagerly explained. \"More a matter of absorption.\" Again came that wicked smile. \"For those who will play.\" \"And those who will not simply disappear?\" Rai-guy asked, but his sarcasm seemed lost on Jarlaxle, who only smiled all the wider. \"Did you not execute a Raker spy only the other day?\" Jarlaxle asked. \"There is a profound difference in defending our privacy and trying to expand our borders,\" the wizard replied. \"Semantics,\" Jarlaxle said with a laugh. \"Simply semantics.\" Behind him, Sharlotta Vespers bit her lip and shook her head, fearing that her newfound benefactors might be about to make a tremendous and very dangerous blunder. From an alley not so far away, Entreri listened to the shouts and confusion coming from the tower. When he had entered, he\u0027d gone downstairs first, to find a particularly unpleasant prisoner to free. Once he had ushered the man to relative safety, to the open tunnels at the back of the dungeons, he had gone upstairs to the first floor, then up again, moving quietly and deliberately along the shadowy, torch-lit corridors. Finding Jharkheld\u0027s room proved easy enough. The door hadn\u0027t even been locked. Had he not just witnessed the magistrate\u0027s work at Prisoner\u0027s Carnival, Artemis Entreri might have reasoned with him concerning Morik. Now the way was clear for Morik to complete his task and proffer the jewels. Entreri wondered if the escaped prisoner, the obvious murderer of poor Jharkheld, had been found in the maze of tunnels yet. What misery the man would face. A wry grin found its way onto Entreri\u0027s face, for he hardly felt any guilt about using the wretch for his own gain. The idiot should have known better, after all. Why would someone come in unannounced and at obvious great personal risk to save him? Why hadn\u0027t he even questioned Entreri while the assassin was releasing him from the shackles? Why, if he was smart enough to deserve his life, hadn\u0027t he tried to capture Entreri in his place, to put this unasked-for and unknown savior up in the shackles in his stead, to face the executioner? So many prisoners came through these dungeons that the gaolers likely wouldn\u0027t even have been aware of the change. So, his fate was the thug\u0027s own to accept, and in Entreri\u0027s thinking, of his own doing. Of course, the thug would claim that someone else had helped him to escape, had set it all up to make it look like it was his doing. Prisoner\u0027s Carnival hardly cared for such excuses. Nor did Artemis Entreri. He dismissed all thoughts of those problems, glanced around to ensure that he was alone, and placed the magic dispelling orb along the side of the alley. He walked across the way and blew his whistle. He wondered then how this might work. Magic would be needed, after all, to get him back to Calimport, but how might that work if he had to take the orb along? Wouldn\u0027t the orb\u0027s dweomer simply dispel the attempted teleportation? A blue screen of light appeared beside him. It was a magical doorway, he knew, and not one of Rai-guy\u0027s, but rather the doing of Kimmuriel Oblodra. So that was it, he mused. Perhaps the orb wouldn\u0027t work against psionics. Or perhaps it would, and that thought unsettled the normally unshakable Entreri profoundly as he moved to collect the item. What would happen if the orb somehow did affect Kimmuriel\u0027s dimension warp? Might he wind up in the wrong place-even in another plane of existence, perhaps? Entreri shook that thought away as well. Life was risky when dealing with drow, magical orbs or not. He took care to pocket the orb slyly, so that any prying eyes would have a difficult time making out the movement in the dark alley, then strode quickly up to the portal, and with a single deep breath, stepped through. He came out dizzy, fighting hard to hold his balance, in the guild hall\u0027s private sorcery chambers back in Calimport, hundreds and hundreds of miles away. There stood Kimmuriel and Rai-guy, staring at him hard. \"The jewels?\" Rai-guy asked in the drow language, which Entreri understood, though not well. \"Soon,\" the assassin replied in his shaky command of Deep Drow. \"There was a problem,\" Both dark elves lifted their white eyebrows in surprise. \"Was,\" Entreri emphasized. \"Morik will have the jewels presently.\" \"Then Morik lives,\" Kimmuriel remarked pointedly. \"What of his attempts to hide from us?\" \"More the attempts of local magistrates to seal him off from any outside influences,\" Entreri lied. \"One local magistrate,\" he quickly corrected, seeing their faces sour. \"The issue has been remedied.\" Neither drow seemed pleased, but neither openly complained. \"And this local magistrate had magically sealed off Morik\u0027s room from outside, prying eyes?\" Rai-guy asked. \"And all other magic,\" Entreri answered. \"It has been corrected.\" \"With the orb?\" Kimmuriel added. \"Morik proffered the orb,\" Rai-guy remarked, narrowing his eyes. \"He apparently did not know what he was buying,\" Entreri said calmly, not getting alarmed, for he recognized that his ploys had worked. Rai-guy and Kimmuriel would hold their suspicions that it had been Morik\u0027s work, and not that of any minor official, of course. They would suspect that Entreri had bent the truth to suit his own needs, but the assassin knew that he hadn\u0027t given them anything overt enough for them to act upon-at least, not without raising the ire of Jarlaxle. Again, the realization that his security was almost wholly based on the mercenary leader did not sit well with Entreri. He didn\u0027t like being dependent, equating the word with weakness. He had to turn the situation around. \"You have the orb,\" Rai-guy remarked, holding out his slender, deceivingly delicate hand. \"Better for me than for you,\" the assassin dared to reply, and that declaration set the two dark elves back on their heels. Even as he finished speaking, though, Entreri felt the tingling in his pocket. He dropped a hand to the orb, and his sensitive fingers felt a subtle vibration coming from deep within the enchanted item. Entreri\u0027s gaze focused on Kimmuriel. The drow was standing with his eyes closed, deep in concentration. Then he understood. The orb\u0027s enchantment would do nothing against any of Kimmuriel\u0027s formidable mind powers, and Entreri had seen this psionic trick before. Kimmuriel was reaching into the latent energy within the orb and was exciting that energy to explosive levels. Entreri toyed with the idea of waiting until the last moment then throwing the orb into Kimmuriel\u0027s face. How he would enjoy the sight of that wretched drow caught in one of his own tricks! With a wave of his hand, Kimmuriel opened a dimensional portal, from the room to the nearly deserted dusty street outside. It was a portal large enough for the orb, but that would not allow Entreri to step through. Entreri felt the energy building, building... the vibrations were not so subtle any longer. Still he held back, staring at Kimmuriel-just staring and waiting, letting the drow know that he was not afraid. In truth this was no contest of wills. Entreri had a mounting explosion in his pocket, and Kimmuriel was far enough away so that he would feel little effect from it other than the splattering of Entreri\u0027s blood. Again the assassin considered throwing the orb into Kimmuriel\u0027s face, but again he realized the futility of such a course. Kimmuriel would simply stop exciting the latent energy within the orb, would shut off the explosion as completely as dipping a torch into water snuffed out its flame. Entreri would have given Rai-guy and Kimmuriel all the justification they needed to utterly destroy him. Jarlaxle might be angry, but he couldn\u0027t and wouldn\u0027t deny them their right to defend themselves. Artemis Entreri wasn\u0027t ready for such a fight. Not yet. He tossed the orb out through the open door and watched, a split second later, as it exploded into dust. The magical door went away. \"You play dangerous games,\" Rai-guy remarked. \"Your drow friend is the one who brought on the explosion,\" Entreri casually replied. \"I speak not of that,\" the wizard retorted. \"There is a common saying among your people that it is foolhardy to send a child to do a man\u0027s work. We have a similar saying, that it is foolhardy to send a human to do a drow\u0027s work.\" Entreri stared at him hard, having no response. This whole situation was starting to feel like those days when he had been trapped down in Menzoberranzan, when he had known that, in a city of twenty thousand dark elves, no matter how good he got, no matter how perfect his craft, he would never be considered any higher in society\u0027s rankings than twenty thousand and one. Rai-guy and Kimmuriel tossed out a few phrases between themselves, insults mostly, some crude, some subtle, all aimed at Entreri. He took them, every one, and said nothing, because he could say nothing. He kept thinking of Dallabad Oasis and a particular sword and gauntlet combination. He accepted their demeaning words, because he had to. For now.","sourceLink":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3/page-4.html","bookId":2138,"book":{"id":2138,"title":"Servant of the Shard (Paths of Darkness #3)","description":"Storyline: Servant of the Shard (Paths of Darkness #3) With each kill, I grow wiser, and with added wisdom, I grow stronger. Powerful assassin Artemis Entreri tightens his grip on the streets of Calimport, driven by the power of his hidden drow supporters. But his sponsor Jarlaxle grows ever more ambitious, and Entreri struggles to remain cautious and in control. Soon, the power of the malevolent Crystal Shard grows greater than them both, threatening to draw them into a vast web of treachery from which there will be no escape.","cover":"https://allnovel.net/images/servant-of-the-shard-paths-of-darkness-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:13:53 PM"}}
