{"id":95373,"no":9,"title":"Page 9","content":"THE SIMPLE REASON The tower will remain. Jarlaxle has declared it,\" said Kimmuriel. \"The fortress weathered our attack well enough to keep Dallabad operating smoothly, and without anyone outside of the oasis even knowing that an assault had taken place.\" \"Operating,\" Rai-guy echoed, spitting the distasteful word out. He stared at Entreri, who walked beside him into the crystal tower. Rai-guy\u0027s look made it quite clear that he considered the events of this day the assassin\u0027s doing and planned on holding Entreri personally responsible if anything went wrong. \"Is Bregan D\u0027aerthe to become the overseers of a great toll booth, then?\" \"Dallabad will prove more valuable to Bregan D\u0027aerthe than you assume,\" Entreri replied in his stilted use of the drow language. \"We can keep the place separate from House Basadoni as far as all others are concerned. The allies we place out here will watch the road and gather news long before those in Calimport are aware. We can run many of our ventures from out here, farther from the prying eyes of Pasha Da\u0027Daclan and his henchmen.\" \"And who are these trusted allies who will operate Dallabad as a front for Bregan D\u0027aerthe?\" Rai-guy demanded. \"I had thought of sending Domo.\" \"Domo and his filthy kind will not leave the offal of the sewers,\" Sharlotta Vespers put in. \"Too good a hole for them,\" Entreri muttered. \"Jarlaxle has hinted that perhaps the survivors of Dallabad will suffice,\" Kimmuriel explained. \"Few were killed.\" \"Allied with a conquered guild,\" Rai-guy remarked with a sigh, shaking his head. \"A guild whose fall we brought about.\" \"A very different situation from allying with a fallen house of Menzoberranzan,\" Entreri declared, seeing the error in the dark elf\u0027s apparent internal analogy. Rai-guy was viewing things through the dark glass of Menzoberranzan, was considering the generational feuds and grudges that members of the various houses, the various families, held for each other. \"We shall see,\" the drow wizard replied, and he motioned for Entreri to hang back with him as Kimmuriel, Berg\u0027inyon, and Sharlotta started up the staircase to the second level of the magical crystalline tower. \"I know that you desired Dallabad for personal reasons,\" Rai-guy said when the two were alone. \"Perhaps it was an act of vengeance, or that you might wear that very gauntlet upon your hand and carry that same sword you now have sheathed on your hip. Either way, do not believe you\u0027ve done anything here I don\u0027t understand, human.\" \"Dallabad is a valuable asset,\" Entreri replied, not backing away an inch. \"Jarlaxle has a place where he can safely construct and maintain the crystalline tower. There was gain here to be had by all.\" \"Even to Artemis Entreri,\" Rai-guy remarked. In answer, the assassin drew forth Charon\u0027s Claw, presenting it horizontally to Rai-guy for inspection, letting the drow wizard see the beauty of the item. The sword had a slender, razor-edged, gleaming red blade, its length inscribed with designs of cloaked figures and tall scythes, accentuated by a black blood trough running along its center. Entreri opened his hand enough for the wizard to see the skull-bobbed pommel, with a hilt that appeared like whitened vertebrae. Running from it toward the crosspiece, the hilt was carved to resemble a backbone and rib-cage, and the crosspiece itself resembled a pelvic skeleton, with legs spread out wide and bent back toward the head, so that the wielder\u0027s hand fit neatly within the \"bony\" boundaries. All of the pommel, hilt and crosspiece was white, like bleached bones-perfectly white, except for the eye sockets of the skull pommel, which seemed like black pits at one moment and flared with red fires the next. \"I am pleased with the prize I earned,\" Entreri admitted. Rai-guy stared hard at the sword, but his gaze inevitably kept drifting toward the other, less-obvious treasure: the black, red-stitched gauntlet on Entreri\u0027s hand. \"Such weapons can be more of a curse than a blessing, human,\" the wizard remarked. \"They are possessed of arrogance, and too often does that foolish pride spill over into the mind of the wielder, to disastrous result.\" The two locked stares, with Entreri\u0027s expression melting into a wry grin. \"Which end would you most like to feel?\" he asked, presenting the deadly sword closer to Rai-guy, matching the wizard\u0027s obvious threat with one of his own. Rai-guy narrowed his dark eyes, and walked away. Entreri held his grin as he watched the wizard move up the stairs, but in truth, Rai-guy\u0027s warning had struck a true chord to him. Indeed, Charon\u0027s Claw was strong of will- Entreri could feel that clearly-and if he was not careful with the blade always, it could surely lead him to disaster or destroy him as it had utterly slaughtered Kohrin Soulez. Entreri glanced down at his own posture, reminding himself-a humble self-warning-not to touch any part of the sword with his unprotected hand. Even Artemis Entreri could not deny a bit of caution against the horrific death he had witnessed when Charon\u0027s Claw had burned the skin from the head of Kohrin Soulez. \"Crenshinibon easily dominates the majority of the survivors,\" Jarlaxle announced to his principal advisors a short while later in an audience chamber he had crafted of the second level the magical tower. \"To those outside of Dallabad Oasis, the events of this day will seem like nothing more than a coup within the Soulez family, followed by a strong alliance to the Basadoni Guild.\" \"Ahdahnia Soulez agreed to remain?\" Rai-guy asked. \"She was willing to assume the mantle of Dallabad even before Crenshinibon invaded her thoughts,\" Jarlaxle explained. \"Loyalty,\" Entreri remarked under his breath. Even as the assassin was offering the sarcastic jibe, Rai-guy admitted, \"I am beginning to like the young woman more already.\" \"But can we trust her?\" Kimmuriel asked. \"Do you trust me?\" Sharlotta Vespers interjected. \"It would seem a similar situation.\" \"Except that her guildmaster was also her father,\" Kimmuriel reminded. \"There is nothing to fear from Ahdahnia Soulez or any of the others who will remain at Dallabad,\" Jarlaxle put in, forcefully, thus ending the philosophical debate. \"Those who survived and will continue to do so belong to Crenshinibon now, and Crenshinibon belongs to me.\" Entreri didn\u0027t miss the doubting look that flashed briefly across Rai-guy\u0027s face at the moment of Jarlaxle\u0027s final proclamation, and in truth, he, too, wondered if the mercenary leader wasn\u0027t a bit confused as to who owned whom. \"Kohrin Soulez\u0027s soldiers will not betray us,\" Jarlaxle went on with all confidence. \"Nor will they even remember the events of this day, but rather, they will accept the story we tell them to put forth as truth, if that is what we choose. Dallabad Oasis belongs to Bregan D\u0027aerthe now as surely as if we had installed an army of dark elves here to facilitate the operations.\" \"And you trust the woman Ahdahnia to lead, though we just murdered her father?\" Kimmuriel said more than asked. \"Her father was killed by his obsession with that sword; so she told me herself,\" Jarlaxle replied, and as he spoke, all gazes turned to regard the weapon hanging easily at Entreri\u0027s belt. Rai-guy, in particular, kept his dangerous glare upon Entreri, as if silently reiterating the warnings of their last conversation. The wizard meant those warnings to be a threat to Entreri, a reminder to the assassin that he, Rai-guy, would be watching Entreri\u0027s every move much more closely now, a reminder that he believed that the assassin had, in effect, used Bregan D\u0027aerthe for the sake of his personal gain-a very dangerous practice. \"You do not like this,\" Kimmuriel remarked to Rai-guy when the two were back in Calimport. Jarlaxle had remained behind at Dallabad Oasis, securing the remnants of Kohrin Soulez\u0027s forces and explaining the slight shift in direction that Ahdahnia Soulez should now undertake. \"How could I?\" Rai-guy responded. \"Every day, it seems that our purpose in coming to the surface has expanded. I had thought that we would be back in Menzoberranzan by this time, yet our footpads have tightened on the stone.\" \"On the sand,\" Kimmuriel corrected, in a tone that showed he, too, was not overly pleased by the continuing expansion of Bregan D\u0027aerthe\u0027s surface ventures. Originally, Jarlaxle had shared plans to come to the surface and establish a base of contacts, humans mostly, who would serve as profiteering front men for the trading transactions of the mercenary drow band. Though he had never specified the details, Jarlaxle\u0027s original explanation had made the two believe that their time on the surface would be quite limited. But now they had expanded, had even constructed a physical structure, with more apparently planned, and had added a second base to the Basadoni conquest. Worse than that, both dark elves were thinking, though not openly saying, perhaps there was something even more behind Jarlaxle\u0027s continuing shift of attitude. Perhaps the mercenary leader had erred in taking a certain relic from the renegade Do\u0027Urden. \"Jarlaxle seems to have taken a liking to the surface,\" Kimmuriel went on. \"We all knew that he had tired somewhat of the continuing struggles within our homeland, but perhaps we underestimated the extent of that weariness.\" \"Perhaps,\" Rai-guy replied. \"Or perhaps our friend merely needs to be reminded that this is not our place.\" Kimmuriel stared at him hard, his expression clearly asking how one might \"remind\" the great Jarlaxle of anything. \"Start at the edges,\" Rai-guy answered, echoing one of Jarlaxle\u0027s favorite sayings, and favorite tactics for Bregan D\u0027aerthe. Whenever the mercenary band went into infiltration or conquest mode, they started gnawing at the edges of their opponent-circling the perimeter and chewing, chewing-as they continued their ever-tightening ring. \"Has Morik yet delivered the jewels?\" There it lay before him, in all its wicked splendor. Artemis Entreri stared long and hard at Charon\u0027s Claw, the fingers on both of his unprotected hands rubbing in against his moist palms. Part of him wanted to reach out and grasp the sword, to effect now the battle that he knew would soon enough be fought between his own willpower and that of the sentient weapon. If he won that battle, the sword would truly be his, but if he lost.... He recalled, and vividly, the last horrible moments of Kohrin Soulez\u0027s miserable life. It was exactly that life, though, that so propelled Entreri in this seemingly suicidal direction. He would not be as Soulez had been. He would not allow himself to be a prisoner to the sword, a man trapped in a box of his own making. No, he would be the master, or he would be dead. But still, that horrific death.... Entreri started to reach for the sword, steeling his willpower against the expected onslaught. He heard movement in the hallway outside his room. He had the glove on in a moment and scooped up the sword in his right hand, moving it to its sheath on his hip in one fluid movement even as the door to his private chambers-if any chambers for a human among Bregan D\u0027aerthe could be considered private-swung open. \"Come,\" instructed Kimmuriel Oblodra, and he turned and started away. Entreri didn\u0027t move, and as soon as the drow realized it, he turned back. Kimmuriel had a quizzical look upon his handsome, angular face. That look of curiosity soon turned to one of menace, though, as he considered the standing, but hardly moving assassin. \"You have a most excellent weapon now,\" Kimmuriel remarked. \"One to greatly complement your nasty dagger. Fear not. Neither Rai-guy nor I have underestimated the value of that gauntlet you seem to keep forever upon your right hand. We know its powers, Artemis Entreri, and we know how to defeat it.\" Entreri continued to stare, unblinking, at the drow psionicist. A bluff? Or had resourceful Kimmuriel and Rai- guy indeed found some way around the magic-negating gauntlet? A wry smile found its way onto Entreri\u0027s face, a look bolstered by the assassin\u0027s complete confidence that whatever secret Kimmuriel might now be hinting of would do the drow little good in their immediate situation. Entreri knew, and his look made Kimmuriel aware as well, that he could cross the room then and there, easily defeat any of Kimmuriel\u0027s psionically created defenses with the gauntlet, and run him through with the mighty sword. If the drow, so cool and so powerful, was bothered or worried at all, he did a fine job of masking it. But so did Entreri. \"There is work to be done in Luskan,\" Kimmuriel remarked at length. \"Our friend Morik still has not delivered the required jewels.\" \"I am to go and serve as messenger again?\" Entreri asked sarcastically. \"No message for Morik this time,\" Kimmuriel said coldly. \"He has failed us.\" The finality of that statement struck Entreri profoundly, but he managed to hide his surprise until Kimmuriel had turned around and started away once more. The assassin understood clearly, of course, that Kimmuriel had, in effect, just told him to got to Luskan and murder Morik. The request did not seem so odd, given that Morik apparently was not living up to Bregan D\u0027aerthe\u0027s expectations. Still, it seemed out of place to Entreri that Jarlaxle would so willingly and easily cut his only thread to a market as promising as Luskan without even asking for some explanation from the tricky little rogue. Jarlaxle had been acting strange, to be sure, but was he as confused as that? It occurred to Entreri even as he started after Kimmuriel that perhaps this assassination had nothing to do with Jarlaxle. His feelings, and fears, were only strengthened when he entered the small room. He came in not far behind Kimmuriel but found Rai-guy, and Rai-guy alone, waiting for him. \"Monk has failed us yet again,\" the wizard stated immediately. \"There can be no further chances for him. He knows too much of us, and with such an obvious lack of loyalty, well, what are we to do? Go to Luskan and eliminate him. A simple task. We care not for the jewels. If he has them, spend them as you will. Just bring me Morik\u0027s heart.\" As he finished, he stepped aside, clearing the way to a magical portal he had woven, the blurry image inside showing Entreri the alleyway beside Morik\u0027s building. \"You will need to remove the gauntlet before you stride through,\" Kimmuriel remarked, slyly enough for Entreri to wonder if perhaps this whole set-up was but a ruse to force him into an unguarded position. Of course, the resourceful assassin had considered that very thing on the walk over, so he only chuckled at Kimmuriel, walked up to the portal, and stepped right through. He was in Luskan now, and he looked back to see the magical portal closing behind him. Kimmuriel and Rai-guy were looking at him with expressions that showed everything from confusion to anger to intrigue. Entreri held up his gloved hand in a mocking wave as the pair faded out of sight. He knew they were wondering how he could exercise such control over the magic-dispelling gauntlet. They were trying to get a feel for its power and its limitations, something that even Entreri had not yet figured out. He certainly didn\u0027t mean to offer any clues to his quiet adversaries, thus he had changed from the real magical gauntlet to the decoy that had so fooled Soulez. When the portal closed he started out of the alleyway, changing once again to the real gauntlet and dropping the fake one into a small sack concealed under the folds of his cloak at the back of his belt. He went to Morik\u0027s room first and found that the little thief had not added any further security traps or tricks. That surprised Entreri, for if Morik was again disappointing his merciless leaders he should have been expecting company. Furthermore, the thief obviously had not fled the small apartment. Not content to sit and wait, Entreri went back out onto Luskan\u0027s streets, making his way from tavern to tavern, from corner to corner. A few beggars approached him, but he sent them away with a glare. One pickpocket actually went for the purse he had secured to his belt on the right side. Entreri left him sitting in the gutter, his wrist shattered by a simple twist of the assassin\u0027s hand. Sometime later, and thinking that it was about time for him to return to Morik\u0027s abode, the assassin came into an establishment on Half-Moon Street known as the Cutlass. The place was nearly empty, with a portly barkeep rubbing away at the dirty bar and a skinny little man sitting across from him, chattering away. Another figure among the few patrons remaining in the place caught Entreri\u0027s attention. The man was sitting comfortably and quietly at the far left end of the bar with his back against the wall and the hood of his weathered cloak pulled over his head. He appeared to be sleeping, judging from his rhythmic breathing, the hunch of his shoulders, and the loll of his head, but Entreri caught a few tell-tale signs-like the fact that the rolling head kept angling to give the supposedly sleeping man a fine view of all around him-that told him otherwise. The assassin didn\u0027t miss the slight tensing of the shoulders when that angle revealed his presence to the supposedly sleeping man. Entreri strode up to the bar, right beside the nervous, skinny little man, who said, \"Arumn\u0027s done serving for the night.\" Entreri glanced over, his dark eyes taking a full measure of this one. \"My gold is not good enough for you?\" he asked the barkeep, turning back slowly to consider the portly man behind the bar. Entreri noted that the barkeep took a long, good measure of him. He saw respect coming into Arumn\u0027s eyes. He wasn\u0027t surprised. This barkeep, like so many others, survived primarily by understanding his clientele. Entreri was doing little to hide the truth of his skills in his graceful, solid movements. The man pretending to sleep at the bar said nothing, and neither did the nervous one. \"Ho, Josi\u0027s just puffing out his chest, is all,\" the bar-keep, Arumn, remarked, \"though I had planned on closing her up early. Not many looking for drink this night.\" Satisfied with that, Entreri glanced to the left, to the compact form of the man pretending to be asleep. \"Two honey meads,\" he said, dropping a couple of shining gold coins on the bar, ten times the cost of the drinks. The assassin continued to watch the \"sleeper,\" hardly paying any heed at all to Arumn or nervous little Josi, who was constantly shifting at his other side. Josi even asked Entreri his name, but the assassin ignored him. He just continued to stare, taking a measure, studying every movement and playing them against what he already knew of Morik. He turned back when he heard the clink of glass on the bar. He scooped up one drink in his gloved right hand, bringing the dark liquid to his lips, while he grasped the second glass in his left hand, and instead of lifting it, just sent it sliding fast down the bar, angled slightly for the outer lip, perfectly set to dump onto the supposedly- sleeping man\u0027s lap. The barkeep cried out in surprise. Josi Puddles jumped to his feet, and even started toward Entreri, who simply ignored him. The assassin\u0027s smile widened when Morik, and it was indeed Morik, reached up at the last moment and caught the mead-filled missile, bringing his hand back and wide to absorb the shock of the catch and to make sure that any liquid that did splash over did not spill on him. Entreri slid off the barstool, took up his glass of mead and motioned for Morik to go with him outside. He had barely taken a step, though, when he sensed a movement toward his arm. He turned back to see Josi Puddles reaching for him. \"No, ye don\u0027t!\" the skinny man remarked. \"Ye ain\u0027t leavin\u0027 with Arumn\u0027s glasses.\" Entreri watched the hand coming toward him and lifted his gaze to look Josi Puddles straight in the eye, to let the man know, with just a look and just that awful, calm and deadly demeanor, that if he so much as brushed Entreri\u0027s arm with his hand, he would surely pay for it with his life. \"No, ye...\" Josi started to say again, but his voice failed him and his hand stopped moving. He knew. Defeated, the skinny man sank back against the bar. \"The gold should more than pay for the glasses,\" Entreri remarked to the barkeep, and Arumn, too, seemed quite unnerved. The assassin headed for the door, taking some pleasure in hearing the barkeep quietly scolding Josi for being so stupid. The street was quiet outside, and dark, and Entreri could sense the uneasiness in Morik. He could see it in the man\u0027s cautious stance and in the way his eyes darted about. \"I have the jewels,\" Morik was quick to announce. He started in the direction of his apartment, and Entreri followed. The assassin thought it interesting that Morik presented him with the jewels-and the size of the pouch made Entreri believe that the thief had certainly met his master\u0027s expectations-as soon as they entered the darkened room. If Morik had them, why hadn\u0027t he simply given them over on time? Certainly Morik, no fool, understood the volatile and extremely dangerous nature of his partners. \"I wondered when I would be called upon,\" Morik said, obviously trying to appear completely calm. \"I have had them since the day after you left but have gotten no word from Rai-guy or Kimmuriel.\" Entreri nodded, but showed no surprise-and in truth, when he thought about it, the assassin wasn\u0027t really surprised at all. These were drow, after all. They killed when convenient, killed when they felt like it. Perhaps they had sent Entreri here to slay Morik in the hopes that Morik would prove the stronger. Perhaps it didn\u0027t matter to them either way. They would merely enjoy the spectacle of it. Or perhaps Rai-guy and Kimmuriel were anxious to clip away at the entrenchment that Jarlaxle was obviously setting up for Bregan D\u0027aerthe. Kill Morik and any others like him, sever all ties, and go home. He lifted his black gauntlet into the air, seeking any magical emanations. He detected some upon Morik and some other minor dweomers in and around the room, but nothing that seemed to him to be any kind of scrying spell. It wasn\u0027t that he could have done anything about any spells or psionics divining the area, anyway. Entreri had come to understand already that the gauntlet could only grab at spells directed at him specifically. In truth, the thing was really quite limited. He might catch one of Rai-guy\u0027s lightning bolts and hurl it back at the wizard, but if Rai-guy filled the room with a fireball.... \"What are you doing?\" Morik asked the distracted assassin. \"Get out of here,\" Entreri instructed. \"Out of this building and out of the city altogether, for a short while at least.\" The obviously puzzled Morik just stared at him. \"Did you not hear me?\" That order comes from Jarlaxle?\" Morik asked, seeming quite confused. \"Does he fear that I have been discovered, that he, by association, has been somehow implicated?\" \"I tell you to begone, Morik,\" Entreri answered. \"I, and not Jarlaxle, nor, certainly, Rai-guy or Kimmuriel.\" \"Do I threaten you?\" asked Morik. \"Am I somehow impeding your ascension within the guild?\" \"Are you that much a fool?\" Entreri replied. \"I have been promised a king\u0027s treasure!\" Morik protested. \"The only reason I agreed-\" \"Was because you had no choice,\" Entreri interrupted. \"I know that to be true, Morik. Perhaps that lack of choice is the only thing that saves you now.\" Morik was shaking his head, obviously upset and unconvinced. \"Luskan is my home,\" he started to say. Charon\u0027s Claw came out in a red and black flash. Entreri swiped down beside Morik, left and right, then slashed across right above the man\u0027s head. The sword left a trail of black ash with all three swipes so that Entreri had Morik practically boxed in by the opaque walls. So quickly had he struck, the dazed and dazzled rogue hadn\u0027t even had a chance to draw his weapon. \"I was not sent to collect the jewels or even to scold and warn you, fool,\" Entreri said coldly-so very, very coldly. \"I was sent to kill you.\" \"But....\" \"You have no idea the level of evil with which you have allied yourself,\" the assassin went on. \"Flee this place- this building and this city. Run for all your life, fool Morik. They will not look for you if they cannot find you easily- you are not worth their trouble. So run away, beyond their vision and take hope that you are free of them.\" Morik stood there, encapsulated by the walls of black ash that still magically hung in the air, his jaw hanging open in complete astonishment. He looked left and right, just a bit, and swallowed hard, making it clear to Entreri that he had just then come to realize how overmatched he truly was. Despite the assassin\u0027s previous visit, easily getting through all of Morik\u0027s traps, it had taken this display of brutal swordsmanship to show Morik the deadly truth of Artemis Entreri. \"Why would they...?\" Morik dared to ask. \"I am an ally, eyes for Bregan D\u0027aerthe in the northland. Jarlaxle himself instructed me to...\" He stopped at the sound of Entreri\u0027s laughter. \"You are iblith,\" Entreri explained. \"Offal. Not of the drow. That alone makes you no more than a plaything to them. They will kill you-I am to kill you here and now by their very words.\" \"Yet you defy them,\" Morik said, and it wasn\u0027t clear from his tone if he had come around yet truly to believe Entreri or not. \"You are thinking that this is some test of your loyalty,\" Entreri correctly guessed, shaking his head with every word. \"The drow do not test loyalty, Morik, because they expect none. With them, there is only the predictability of actions based in simple fear.\" \"Yet you are showing yourself disloyal by letting me go,\" Morik remarked. \"We are not friends, with no debt and little contact between us. Why do you tell me this?\" Entreri leaned back and considered that question more deeply than Morik could have expected, allowing the thief\u0027s recognition of illogic to resonate in his thoughts. For surely Entreri\u0027s actions here made little logical sense. He could have been done with his business and back on his way to Calimport, without any real threat to him. By contrast, and by all logical reasoning, there would be little gain for Entreri in letting Morik walk away. Why this time? the assassin asked himself. He had killed so many, and often in situations similar to this, often at the behest of a guildmaster seeking to punish an impudent or threatening underling. He had followed orders to kill people whose offense had never been made known to him, people, perhaps, similar to Morik, who had truly committed no offense at all. No, Artemis Entreri couldn\u0027t quite bring himself to accept that last thought. His killings, every one, had been committed against people associated with the underworld, or against misinformed do-gooders who had somehow become entangled in the wrong mess, impeding the assassin\u0027s progress. Even Drizzt Do\u0027Urden, that paladin in drow skin, had named himself as Entreri\u0027s enemy by preventing the assassin from retrieving Regis the halfling and the magical ruby pendant the little fool had stolen from Pasha Pook. It had taken years, but to Entreri, killing Drizzt Do\u0027Urden had been the justified culmination of the drow\u0027s unwanted and immoral interference. In Entreri\u0027s mind and in his heart, those who had died at his hands had played the great game, had tossed aside their innocence in pursuit of power or material gain. In Entreri\u0027s mind, everyone he had killed had indeed deserved it, because he was a killer among killers, a survivor in a brutal game that would not allow it to be any other way. \"Why?\" Morik asked again, drawing Entreri from his contemplation. The assassin stared at the rogue for a moment, and offered a quick and simple answer to a question too complex for him to sort out properly, an answer that rang of more truth than Artemis Entreri even realized. \"Because I hate drow more than I hate humans.\" Part 2 WHICH THE TOOL? WHICH THE MASTER? Entreri again teamed with Jarlaxle? What an odd pairing that seems, and to some (and initially to me, as well) a vision of the most unsettling nightmare imaginable. There is no one in all the world, I believe, more crafty and ingenious than Jarlaxle of Bregan D\u0027aerthe, the consummate opportunist, a wily leader who can craft a kingdom out of the dung of rothe. Jarlaxle, who thrived in the matriarchal society of Menzoberranzan as completely as any Matron Mother. Jarlaxle of mystery, who knew my father, who claims a past friendship with Zaknafein. How could a drow who befriended Zaknafein ally with Artemis Entreri? At quick glance, the notion seems incongruous, even preposterous. And yet, I do believe Jarlaxle\u0027s claims of the former and know the latter to be true-for the second time. Professionally, I see no mystery in the union. Entreri has ever preferred a position of the shadows, serving as the weapon of a high-paying master-no, not master. I doubt that Artemis Entreri has ever known a master. Rather, even in the service of the guilds, he worked as a sword for hire. Certainly such a skilled mercenary could find a place within Bregan D\u0027aerthe, especially since they\u0027ve come to the surface and likely need humans to front and cover their true identity. For Jarlaxle, therefore, the alliance with Entreri is certainly a convenient thing. But there is something else, something more, between them. I know this from the way Jarlaxle spoke of the man, and from the simple fact that the mercenary leader went so far out of his way to arrange the last fight between me and Entreri. It was for the sake of Entreri\u0027s state of mind, no less, and certainly as no favor to me, and as no mere source of entertainment for Jarlaxle. He cares for Entreri as a friend might, even as he values the assassin\u0027s multitude of skills. There lies the incongruity. For though Entreri and Jarlaxle have complementary professional skills, they do not seem well matched in temperament or in moral standards-two essentials, it would seem, for any successful friendship. Or perhaps not. Jarlaxle\u0027s heart is far more generous than that of Artemis Entreri. The mercenary can be brutal, of course, but not randomly so. Practicality guides his moves, for his eye is ever on the potential gain, but even in that light of efficient pragmatism, Jarlaxle\u0027s heart often overrules his lust for profit. Many times has he allowed my escape, for example, when bringing my head to Matron Malice or Matron Baenre would have brought him great gain. Is Artemis Entreri similarly possessed of such generosity? Not at all. In fact, I suspect that if Entreri knew that Jarlaxle had saved me from my apparent death in the tower, he would have first tried to kill me and turned his anger upon Jarlaxle. Such a battle might well yet occur, and if it does, I believe that Artemis Entreri will learn that he is badly overmatched. Not by Jarlaxle individually, though the mercenary leader is crafty and reputedly a fine warrior in his own right, but by the pragmatic Jarlaxle\u0027s many, many deadly allies. Therein lies the essence of the mercenary leader\u0027s interest in, and control of, Artemis Entreri. Jarlaxle sees the man\u0027s value and does not fear him, because what Jarlaxle has perfected, and what Entreri is sorely lacking in, is the ability to build an interdependent organization. Entreri won\u0027t attempt to kill Jarlaxle because Entreri will need Jarlaxle. Jarlaxle will make certain of that. He weaves his web all around him. It is a network that is always mutually beneficial, a network in which all security-against Bregan D\u0027aerthe\u0027s many dangerous rivals-inevitably depends upon the controlling and calming influence that is Jarlaxle. He is the ultimate consensus builder, the purest of diplomats, while Entreri is a loner, a man who must dominate all around him. Jarlaxle coerces. Entreri controls. But with Jarlaxle, Entreri will never find any level of control. The mercenary leader is too entrenched and too intelligent for that. And yet, I believe that their alliance will hold, and their friendship will grow. Certainly there will be conflicts and perhaps very dangerous ones for both parties. Perhaps Entreri has already learned the truth of my departure and has killed Jarlaxle or died trying. But the longer the alliance holds, the stronger it will become, the more entrenched in friendship. I say this because I believe that, in the end, Jarlaxle\u0027s philosophy will win out. Artemis Entreri is the one of this duo who is limited by fault. His desire for absolute control is fueled by his inability to trust. While that desire has led him to become as fine a fighter as I have ever known, it has also led him to an existence that even he is beginning to recognize as empty. Professionally, Jarlaxle offers Artemis Entreri security, a base for his efforts, while Entreri gives Jarlaxle and all of Bregan D\u0027aerthe a clear connection to the surface world. But personally, Jarlaxle offers even more to Entreri, offers him a chance to finally break out of the role that he has assumed as a solitary creature. I remember Entreri upon our departure from Menzoberranzan, where we were both imprisoned, each in his own way. He was with Bregan D\u0027aerthe then as well, but down in that city, Artemis Entreri looked into a dark and empty mirror that he did not like. Why, then, is he now returned to Jarlaxle\u0027s side? It is a testament to the charm that is Jarlaxle, the intuitive understanding that that most clever of dark elves holds for creating desire and alliance. The mere fact that Entreri is apparently with Jarlaxle once again tells me that the mercenary leader is already winning the inevitable clash between their basic philosophies, their temperament and moral standards. Though Entreri does not yet understand it, I am sure, Jarlaxle will strengthen him more by example than by alliance. Perhaps with Jarlaxle\u0027s help, Artemis Entreri will find his way out of his current empty existence. Or perhaps Jarlaxle will eventually kill him. Either way, the world will be a better place, I think.","sourceLink":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3/page-9.html","bookId":2138,"book":{"id":2138,"title":"Servant of the Shard (Paths of Darkness #3)","description":"Storyline: Servant of the Shard (Paths of Darkness #3) With each kill, I grow wiser, and with added wisdom, I grow stronger. Powerful assassin Artemis Entreri tightens his grip on the streets of Calimport, driven by the power of his hidden drow supporters. But his sponsor Jarlaxle grows ever more ambitious, and Entreri struggles to remain cautious and in control. Soon, the power of the malevolent Crystal Shard grows greater than them both, threatening to draw them into a vast web of treachery from which there will be no escape.","cover":"https://allnovel.net/images/servant-of-the-shard-paths-of-darkness-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/servant-of-the-shard-paths-of-darkness-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:13:53 PM"}}
