{"id":28408,"no":12,"title":"CHAPTER II.","content":"SHOWING THAT ADMINISTRATIVE CENTRALISATION IS AN INSTITUTION ANTERIOR IN FRANCE TO THE REVOLUTION OF 1789, AND NOT THE PRODUCT OF THE REVOLUTION OR OF THE EMPIRE, AS IS COMMONLY SAID. At a period when political assemblies still existed in France, I once heard an orator, in speaking of administrative centralisation, call it, ‘that admirable achievement of the Revolution which Europe envies us.’ I will concede the fact that centralisation is an admirable achievement; I will admit that Europe envies us its possession, but I maintain that it is not an achievement of the Revolution. On the contrary, it is a product of the former institutions of France, and, I may add, the only portion of the political constitution of the monarchy which survived the Revolution, inasmuch as it was the only one that could be made to adapt itself to the new social condition brought about by that Revolution. The reader who has the patience to read the present chapter with attention will find that I have proved to demonstration this proposition. I must first beg to be allowed to put out of the question what were called les pays d’état, that is to say, the provinces that managed their own affairs, or rather had the appearance, in part, of managing them. These provinces, placed at the extremities of the kingdom, did not contain more than a quarter of the total population of France; and there were only two among them in which provincial liberty possessed any real vitality. I shall revert to them hereafter, and show to what an extent the central power had subjected these very states to the common mould.[19] But for the present I desire to give my principal attention to what was called in the administrative language of the day, les pays d’élection, although, in truth, there were fewer elections in them than anywhere else. These districts encompassed Paris on every side, they were contiguous, and formed the heart and the better part of the territory of France. [29] To any one who may cast a glance over the ancient administration of the kingdom, the first impression conveyed is that of a diversity of regulations and authorities, and the entangled complication of the different powers. France was covered with administrative bodies and distinct officers, who had no connection with one another, but who took part in the government in virtue of a right which they had purchased, and which could not be taken from them; but their duties were frequently so intermingled and so nearly contiguous as to press and clash together within the range of the same transactions. The courts of justice took an indirect part in the legislative power, and possessed the right of framing administrative regulations which became obligatory within the limits of their own jurisdiction. Sometimes they maintained an opposition to the administration, properly so called, loudly blamed its measures and proscribed its agents. Police ordinances were promulgated by simple justices in the towns and boroughs where they resided. The towns had a great diversity of constitutions, and their magistrates bore different designations—sometimes as mayors, sometimes as consuls, or again as syndics, and derived their powers from different sources. Some were chosen by the king, others by the lord of the soil or by the prince holding the fief; some again were elected for a year by their fellow-citizens, whilst others purchased the right of governing them permanently. These different powers were the last remains of the ancient system; but something comparatively new or greatly modified had by degrees established itself among them, and this I have yet to describe. In the centre of the kingdom, and close to the throne, there had been gradually formed an administrative body of extraordinary authority, in the grasp of which every power was united after a new fashion: this was the King’s Council. Its origin was ancient, but the greater part of its functions were of recent date. It was at once a supreme court of justice, inasmuch as it had the right to quash the judgments of all the ordinary courts, and a superior administrative tribunal, inasmuch as every special jurisdiction was dependent on it in the last resort. It possessed, moreover, as a Council of State, subject to the pleasure of the King, a legislative power, for it discussed and proposed the greater part of the laws, and fixed and assessed the taxes. As the superior administrative board, it had to frame the general regulations which were to direct the agents of the Government. Within its walls all important affairs were decided and all secondary powers controlled. Everything[30] finally came home to it; from that centre was derived the movement which set everything in motion. Yet it possessed no inherent jurisdiction of its own. The King alone decided, even when the Council appeared to advise, and even when it seemed to administer justice, it consisted of no more than simple ‘givers of advice’—an expression used by the Parliament in one of its remonstrances. This Council was not composed of men of rank, but of personages of middling or even low extraction, former Intendants or other men of that class thoroughly versed in the management of business, all of whom were liable to dismissal by the Crown. It generally proceeded in its course quietly and discreetly, displaying less pretension than real power; and thus it had but little lustre of its own, or, rather, it was lost in the splendour of the throne to which it stood so near; at once so powerful that everything came within its scope, and so obscure that it has scarcely been remarked by history. As the whole administration of the country was directed by a single body, so nearly the entire management of home affairs was entrusted to the care of one single agent—the Comptroller-General. On opening an almanack of France before the Revolution, it will be found that each province had its special minister; but on studying the administration itself in the legal records of the time, it will soon be seen that the minister of the province had but few occasions of any importance for exercising his authority. The common course of business was directed by the Comptroller-General, who gradually took upon himself all the affairs that had anything to do with money, that is to say, almost the whole public administration; and who thus performed successively the duties of minister of finance, minister of the interior, minister of public works, and minister of trade. As, in truth, the central administration had but one agent in Paris, so it had likewise but a single agent in each province. Nobles were still to be found in the eighteenth century bearing the titles of governors of provinces; they were the ancient and often the hereditary representatives of feudal royalty. Honours were still bestowed upon them, but they no longer had any power. The Intendant was in possession of the whole reality of government. This Intendant was a man of humble extraction, always a stranger to the province, and a young man who had his fortune to make. He never exercised his functions by any right of election, birth, or purchase of office; he was chosen by the government[31] among the inferior members of the Council of State, and was always subject to dismissal. He represented the body from which he was thus severed, and, for that reason, was called, in the administrative language of the time, a Detached Commissioner. All the powers which the Council itself possessed were accumulated in his hands, and he exercised them all in the first instance. Like the Council, he was at once administrator and judge. He corresponded with all the ministers, and in the province was the sole agent of all the measures of the government. In each canton was placed below him an officer nominated by himself, and removable at will, called the Sub-delegate. The Intendant was very commonly a newly-created noble; the Sub-delegate was always a plebeian. He nevertheless represented the entire Government in the small, circumscribed space assigned to him as much as the Intendant did in the whole; and he was amenable to the Intendant as the Intendant was to the minister. The Marquis d’Argenson relates in his ‘Memoirs,’ that one day Law said to him, ‘“I never could have believed what I saw, when I was Comptroller of Finance. Do you know that this kingdom of France is governed by thirty Intendants? You have neither parliament, nor estates, nor governors. It is upon thirty Masters of Requests, despatched into the provinces, that their evil or their good, their fertility or their sterility, entirely depends.”’ These powerful officers of the Government were, however, completely eclipsed by the remnants of the ancient aristocracy, and lost in the brilliancy which that body still shed around it. So that, even in their own time, they were scarcely seen, although their finger was already on everything. In society the nobles had over such men the advantages of rank, wealth, and the consideration always attached to what is ancient. In the Government the nobility were immediately about the person of the Prince, and formed his Court, commanded the fleets, led the armies, and, in short, did all that most attracts the observation of contemporaries, and too often absorbs the attention of posterity. A man of high rank would have been insulted by the proposal to appoint him an Intendant. The poorest man of family would generally have disdained the offer. In his eyes the Intendants were the representatives of an upstart power, new men appointed to govern the middle classes and the peasantry, and, as for the rest, very sorry company. Yet, as Law said, and as we shall see, these were the men who governed France. To commence with the right of taxation, which includes, as it were, all other rights. It is well known a part of the taxes were[32] farmed. In these cases the King’s Council negotiated with the financial companies, fixed the terms of the contract, and regulated the mode of collection. All the other taxes, such as the taille, the capitation-tax, and the vingtièmes were fixed and levied by the agents of the central administration or under their all-powerful control. The Council, every year, by a secret decision, fixed the amount of the taille and its numerous accessories, and likewise its distribution among the provinces. The taille had thus increased from year to year, though public attention was never called to the fact, no noise being made about it. As the taille was an ancient tax, its assessment and collection had been formerly confided to local agents, who were all, more or less, independent of the Government by right of birth or election, or by purchase of office; they were the lords of the soil, the parochial collectors, the treasurers of France, or officers termed the élus. These authorities still existed in the eighteenth century, but some had altogether ceased to busy themselves about the taille, whilst others only did so in a very secondary and entirely subordinate manner. Even here the entire power was in the hands of the Intendant and his agents; he alone, in truth, assessed the taille in the different parishes, directed and controlled the collectors, and granted delays of payments or exemptions. As the other taxes, such as the capitation tax, were of recent date, the Government was no longer embarrassed in respect to them by the remnants of former powers, but dealt with them without any intervention of the parties governed. The Comptroller-General, the Intendant, and the Council fixed the amount of each quota. Let us leave the question of money for that of men. It is sometimes a matter of astonishment how the French can have so patiently borne the yoke of the military conscription at the time of the Revolution and ever since; but it must be borne in mind that they had been already broken in to bear it for a long period of time. The conscription had been preceded by the militia, which was a heavier burden, although the amount of men required was less. From time to time the young men in the country were made to draw lots, and from among them were taken a certain number of soldiers, who were formed into militia regiments, in which they served for six years. As the militia was a comparatively modern institution, none of the ancient feudal powers meddled with it; the whole business was intrusted to the agents of the Central Government alone. The Council fixed the general amount of men and the share of each[33] province. The Intendant regulated the number of men to be raised in each parish; his Sub-delegate superintended the drawing of the lots, decided all cases of exemption, designated those militia-men who were allowed to remain with their families and those who were to join the regiment, and finally delivered over the latter to the military authorities. There was no appeal except to the Intendant or the Council. It may be said with equal accuracy that, except in the pays d’état, all the public works, even those that had a very special destination, were decided upon and managed by the agents of the central power alone. There certainly existed local and independent authorities, who, like the seigneur, the boards of finance, and the grands voyers (surveyors of public roads), had the power of taking a part in such matters of public administration. But all these ancient authorities, as may be seen by the slightest examination of the administrative documents of the time, bestirred themselves but little, or bestirred themselves no longer. All the great roads, and even the cross-roads leading from one town to another, were made and kept up at the cost of the public revenue. The Council decided the plan and contracted for its execution. The Intendant directed the engineering works, and the Sub-delegate got together the compulsory labourers who were to execute them. The care of the by-roads was alone left to the old local authorities, and they became impassable. As in our days, the body of the Ponts et Chaussées was the great agent of the Central Government in relation to public works, and, in spite of the difference of the times, a very remarkable resemblance is to be found in their constitution now and then. The administration of the Ponts et Chaussées had a council and a school, inspectors who annually travelled over the whole of France, and engineers who resided on the spot and who were appointed to direct the works under the orders of the Intendant. A far greater number of the institutions of the old monarchy than is commonly supposed have been handed down to the modern state of French society, but in their transmission they have generally lost their names, even though they still preserve the same forms. As a rare exception, the Ponts et Chaussées have preserved both one and the other. The Central Government alone undertook, with the help of its agents, to maintain public order in the provinces. The maréchaussée, or mounted police, was dispersed in small detachments over the whole surface of the kingdom, and was everywhere placed under the control of the Intendants. It was by the help of these soldiers,[34] and, if necessary, of regular troops, that the Intendant warded off any sudden danger, arrested vagabonds, repressed mendicity, and put down the riots, which were continually arising from the price of corn. It never happened, as had been formerly the case, that the subjects of the Crown were called upon to aid the Government in this task, except indeed in the towns, where there was generally a town-guard, the soldiers of which were chosen and the officers appointed by the Intendant. The judicial bodies had preserved the right of making police regulations, and frequently exercised it; but these regulations were only applicable to a part of the territory, and, more generally, to one spot only. The Council had the power of annulling them, and frequently did annul them in cases of subordinate jurisdiction. But the Council was perpetually making general regulations applicable to all parts of the kingdom, either relative to subjects different from those which the tribunals had already settled, or applicable to those which they had settled in another manner. The number of these regulations, or arrêts du Conseil, as they were then called, was immense; and they seem to have constantly increased the nearer we approach the Revolution. There is scarcely a single matter of social economy or political organisation that was not reorganised by these arrêts du Conseil during the forty years preceding that event. Under the ancient feudal state of society, the lord of the soil, if he possessed important rights, had, at the same time, very heavy obligations. It was his duty to succour the indigent in the interior of his domains. The last trace of this old European legislation is to be found in the Prussian Code of 1795, which says, ‘The lord of the soil must see that the indigent peasants receive an education. It is his duty to provide means of subsistence to those of his vassals who possess no land, as far as he is able. If any of them fall into want, he must come to their assistance.’ But no law of the kind had existed in France for a long time. The lord, when deprived of his former power, considered himself liberated from his former obligations; and no local authority, no council, no provincial or parochial association, had taken his place. No single being was any longer compelled by law to take care of the poor in the rural districts, and the Central Government had boldly undertaken to provide for their wants by its own resources. Every year the Council assigned to each province certain funds derived from the general produce of the taxes, which the Intendant distributed for the relief of the poor in the different parishes. It was to him that the indigent labourer had to apply, and, in times[35] of scarcity, it was he who caused corn or rice to be distributed among the people. The Council annually issued ordinances for the establishment of charitable workshops (ateliers de charité) where the poorer among the peasantry were enabled to find work at low wages, and the Council took upon itself to determine the places where these were necessary. It may be easily supposed, that alms thus bestowed from a distance were indiscriminate, capricious, and always very inadequate.[20] The Central Government, moreover, did not confine itself to relieving the peasantry in time of distress; it also undertook to teach them the art of enriching themselves, encouraged them in this task, and forced them to it, if necessary.[21] For this purpose, from time to time, it caused distributions of small pamphlets upon the science of agriculture to be made by its Intendants and their Sub-delegates, founded schools of agriculture, offered prizes, and kept up, at a great expense, nursery-grounds, of which it distributed the produce. It would seem to have been more wise to have lightened the weight and modified the inequality of the burdens which then oppressed the agriculture of the country, but such an idea never seems to have occurred. Sometimes the Council insisted upon compelling individuals to prosper, whether they would or no. The ordinances constraining artisans to use certain methods and manufacture certain articles are innumerable; and as the Intendants had not time to superintend the application of all these regulations, there were inspectors-general of manufactures, who visited in the provinces to insist on their fulfilment. Some of the arrêts du Conseil even prohibited the cultivation of certain crops which the Council did not consider proper for the purpose; whilst others ordered the destruction of such vines as had been, according to its opinion, planted in an unfavourable soil. So completely had the Government already changed its duty as a sovereign into that of a guardian. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2886/79851.html","bookId":1142,"book":{"id":1142,"title":"The State of Society in France Before the Revolution of 1789","description":"简介： An interval of about seventeen years has elapsed since the first publication of this book in France, and of the translation of it, which appeared simultaneously, in England. The English version has not been republished, and has long been out of print...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2886","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
