{"id":28416,"no":20,"title":"CHAPTER X.","content":"THE DESTRUCTION OF POLITICAL LIBERTY AND THE ESTRANGEMENT OF CLASSES WERE THE CAUSES OF ALMOST ALL THE DISORDERS WHICH LED TO THE DISSOLUTION OF THE OLD SOCIETY OF FRANCE. Of all the disorders which attacked the constitution of society in France, as it existed before the Revolution, and led to the dissolution of that society, that which I have just described was the most fatal. But I must pursue the inquiry to the source of so dangerous and strange an evil, and show how many other evils took their origin from the same cause. If the English had, from the period of the Middle Ages, altogether lost, like the French, political freedom and all those local franchises which cannot long exist without it, it is highly probable that each of the different classes of which the English aristocracy is composed would have seceded from the rest, as was the case in France and more or less all over the continent, and that all those classes together would have separated themselves from the people. But freedom compelled them always to remain within reach of each other, so as to combine their strength in time of need. It is curious to observe how the British aristocracy, urged even by its own ambition, has contrived, whenever it seemed necessary, to mix familiarly with its inferiors, and to feign to consider them as its equals. Arthur Young, whom I have already quoted, and whose book is one of the most instructive works which exist on the former state of society in France, relates that, happening to be one day at the country-house of the Duc de la Rochefoucauld, at La Roche Guyon, he expressed a wish to converse with some of the best and most wealthy farmers of the neighbourhood. ‘The Duke had the kindness to order his steward to give me all the information I wanted relative to the agriculture of the country, and to speak to such persons as were necessary on points that he was in doubt about. At an English nobleman’s house there would have been three or four farmers asked to meet me, who would have dined with the family among ladies of the first rank. I do not[85] exaggerate when I say that I have had this at least an hundred times in the first houses of our islands. It is, however, a thing that in the present state of manners in France would not be met with from Calais to Bayonne, except by chance in the house of some great Lord, who had been much in England, and then not unless it were asked for. I once knew it at the Duke de Liancourt’s.’[43] Unquestionably the English aristocracy is of a haughtier nature than that of France, and less disposed to mingle familiarly with those who live in a humbler condition; but the obligations of its own rank have imposed that duty upon it. It submitted that it might command. For centuries no inequality of taxation has existed in England, except such exemptions as have been successively introduced for the relief of the indigent classes. Observe to what results different political principles may lead nations so nearly contiguous! In the eighteenth century, the poor man in England enjoyed the privilege of exemption from taxation; the rich in France. In one country the aristocracy has taken upon itself the heaviest public burdens, in order to retain the government of the State; in the other the aristocracy retained to the last exemption from taxation as a compensation for the loss of political power. In the fourteenth century the maxim ‘No tax without the consent of the taxed’—n’impose qui ne veut—appeared to be as firmly established in France as in England. It was frequently quoted; to contravene it always seemed an act of tyranny; to conform to it was to revert to the law. At that period, as I have already remarked, a multitude of analogies may be traced between the political institutions of France and those of England; but then the destinies of the two nations separated and constantly became more unlike, as time advanced. They resemble two lines starting from contiguous points at a slight angle, which diverge indefinitely as they are prolonged. I venture to affirm that when the French nation, exhausted by the protracted disturbances which had accompanied the captivity of King John and the madness of Charles VI., suffered the Crown to levy a general tax without the consent of the people, and when the nobility had the baseness to allow the middle and lower classes to be so taxed on condition that its own exemption should be maintained, at that very time was sown the seed of almost all the vices and almost all the abuses which afflicted the ancient society of France during the remainder of its existence, and ended by causing its violent dissolution; and I admire the rare sagacity of Philippe[86] de Comines when he says, ‘Charles VII., who gained the point of laying on the taille at his pleasure, without the consent of the States of the Realm, laid a heavy burden on his soul and on that of his successors, and gave a wound to his kingdom which will not soon be closed.’ Observe how that wound widened with the course of years; follow step by step that fact to its consequences. Forbonnais says with truth in his learned ‘Researches on the Finances of France,’ that in the Middle Ages the sovereigns generally lived on the revenues of their domains; and ‘as the extraordinary wants of the State,’ he adds, ‘were provided for by extraordinary subsidies, they were levied equally on the clergy, the nobility, and the people.’ The greater part of the general subsidies voted by the three Orders in the course of the fourteenth century were, in point of fact, so levied. Almost all the taxes established at that time were indirect, that is, they were paid indiscriminately by all classes of consumers. Sometimes the tax was direct; but then it was assessed, not on property, but on income. The nobles, the priests, and the burgesses were bound to pay over to the King, for a year, a tenth, for instance, of all their incomes. This remark as to the charges voted by the Estates of the Realm applies equally to those which were imposed at the same period by the different Provincial Estates within their own territories.[44] It is true that already, at that time, the direct tax known by the name of the taille was never levied on the noble classes. The obligation of gratuitous military service was the ground of their exemption; but the taille was at that time partially in force as a general impost, belonging rather to the seignorial jurisdictions than to the kingdom. When the King first undertook to levy taxes by his own authority, he perceived that he must select a tax which did not appear to fall directly on the nobles; for that class, formidable and dangerous to the monarchy itself, would never have submitted to an innovation so prejudicial to their own interests. The tax selected by the Crown was, therefore, a tax from which the nobles were exempt, and that tax was the taille. Thus to all the private inequalities of condition which already existed, another and more general inequality was added, which augmented and perpetuated all the rest. From that time this tax spread and ramified in proportion as the demands of the public Treasury increased with the functions of the central authority; it[87] was soon decupled, and all the new taxes assumed the character of the taille. Every year, therefore, inequality of taxation separated the classes of society and isolated the individuals of whom they consisted more deeply than before. Since the object of taxation was not to include those most able to pay taxes, but those least able to defend themselves from paying, the monstrous consequence was brought about that the rich were exempted and the poor burdened. It is related that Cardinal Mazarin, being in want of money, hit upon the expedient of levying a tax upon the principal houses in Paris, but that having encountered some opposition from the parties concerned, he contented himself with adding the five millions he required to the general brevet of the taille. He meant to tax the wealthiest of the King’s subjects; he did tax the most indigent; but to the Treasury the result was the same. The produce of taxes thus unjustly allotted had limits; but the demands of the Crown had none. Yet the Kings of France would neither convoke the States-General to obtain subsidies, nor would they provoke the nobility to demand that measure by imposing taxes on them without it. Hence arose that prodigious and mischievous fecundity of financial expedients, which so peculiarly characterised the administration of the public resources during the last three centuries of the old French monarchy. It is necessary to study the details of the administrative and financial history of that period, to form a conception of the violent and unwarrantable proceedings which the want of money may prescribe even to a mild Government, but without publicity and without control, when once time has sanctioned its power and delivered it from the dread of revolution—that last safeguard of nations. Every page in these annals tells of possessions of the Crown first sold and then resumed as unsaleable; of contracts violated and of vested interests ignored; of sacrifices wrung at every crisis from the public creditor, and of incessant repudiations of public engagements.[45] Privileges granted in perpetuity were perpetually resumed. If we could bestow our compassion on the disappointments of a foolish vanity, the fate of those luckless persons might deserve it who purchased letters of nobility, but who were exposed during the whole of the seventeenth and eighteenth centuries to buy over and over again the empty honours or the unjust privileges which they had already paid for several times. Thus Louis XIV.[88] annulled all the titles of nobility acquired in the preceding ninety-two years, though most of them had been conferred by himself; but they could only be retained upon furnishing a fresh subsidy, all these titles having been obtained by surprise, said the edict. The same example was duly followed by Louis XV. eighty years later. The militia-man was forbidden to procure a substitute, for fear, it was said, of raising the price of recruits to the State. Towns, corporations, and hospitals were compelled to break their own engagements in order that they might be able to lend money to the Crown. Parishes were restrained from undertaking works of public improvement, lest by such a diversion of their resources they should pay their direct taxes with less punctuality. It is related that M. Orry and M. Trudaine, of whom one was the Comptroller-General and the other the Director-General of Public Works, had formed a plan for substituting, for the forced labour of the peasantry on the roads, a rate to be levied on the inhabitants of each district for the repair of their thoroughfares. The reason which led these able administrators to forego that plan is instructive: they feared, it is said, that when a fund had been raised by such a rate it would be impossible to prevent the Treasury from appropriating the money to its own purposes, so that ere long the ratepayers would have had to support both the new money payment and the old charge of forced labour. I do not hesitate to say that no private person could have escaped the grasp of the criminal law who should have managed his own fortune as the Great Louis in all his glory managed the fortune of the nation. If you stumble upon any old establishment of the Middle Ages which maintained itself with every aggravation of its original defects in direct opposition to the spirit of the age, or upon any mischievous innovation, search to the root of the evil—you will find it to be some financial expedient perpetuated in the form of an institution. To meet the pressure of the hour new powers were called into being which lasted for centuries. A peculiar tax, which was called the due of franc-fief, had been levied from a distant period on the non-noble holders of noble lands. This tax established between lands the same distinction which existed between the classes of society, and the one constantly tended to increase the other. Perhaps this due of franc-fief contributed more than any other cause to separate the roturier and the noble, because it prevented them from mingling together in that which most speedily and most effectually assimilates men to each other—in the possession of land. A chasm was[89] thus opened between the noble landowner on the one hand, and his neighbour, the non-noble landowner, on the other. Nothing, on the contrary, contributed to hasten the cohesion of these two classes in England more than the abolition, as early as the sixteenth century, of all outward distinctions between the fiefs held under the Crown and lands held in villenage.[46] In the fourteenth century this feudal tax of franc-fief was light, and was only levied here and there; but in the eighteenth century, when the feudal system was well-nigh abolished, it was rigorously exacted in France every twenty years, and it amounted to one whole year’s revenue. A son paid it on succeeding his father. ‘This tax,’ said the Agricultural Society of Tours in 1761, ‘is extremely injurious to the improvement of the art of husbandry. Of all the imposts borne by the King’s subjects there is indisputably none so vexatious and so onerous to the rural population.’ ‘This duty,’ said another contemporary writer, ‘which was at first levied but once in a lifetime, is become in course of time a very cruel burden.’ The nobles themselves would have been glad that it should be abolished, for it prevented persons of inferior condition from purchasing their lands; but the fiscal demands of the State required that it should be maintained and increased.[47] The Middle Ages are sometimes erroneously charged with all the evils arising from the trading or industrial corporations. But at their origin these guilds and companies served only as means to connect the members of a given calling with each other, and to establish in each trade a free government in miniature, whose business it was at once to assist and to control the working classes. Such, and no more, seems to have been the intention of St. Louis. It was not till the commencement of the sixteenth century, in the midst of that period which is termed the Revival of Arts and Letters, that it was proposed for the first time to consider the right to labour in a particular vocation as a privilege to be sold by the Crown. Then it was that each Company became a small close aristocracy, and at last those monopolies were established which were so prejudicial to the progress of the arts and which so exasperated the last generation. From the reign of Henry III., who generalised the evil, if he did not give birth to it, down to Louis XVI., who extirpated it, it may be said that the abuse of the system of guilds never ceased to augment and to spread at the very time[90] when the progress of society rendered those institutions more insupportable, and when the common sense of the public was most opposed to them. Year after year more professions were deprived of their freedom; year after year the privileges of the incorporated trades were increased. Never was the evil carried to greater lengths than during what are commonly called the prosperous years of the reign of Louis XIV., because at no former period had the want of money been more imperious, or the resolution not to raise money with the assent of the nation more firmly taken. Letrone said with truth in 1775—‘The State has only established the trading companies to furnish pecuniary resources, partly by the patents which it sells, partly by the creation of new offices which the Companies are forced to buy up. The Edict of 1673 carried the principles of Henry III. to their furthest consequences by compelling all the Companies to take out letters of confirmation upon payment for the same; and all the workmen who were not yet incorporated in some one of these bodies were compelled to enter them. This wretched expedient brought in three hundred thousand livres.’ We have already seen how the whole municipal constitution of the towns was overthrown, not by any political design, but in the hope of picking up a pittance for the Treasury. This same want of money, combined with the desire not to seek it from the States-General of the kingdom, gave rise to the venality of public offices, which became at last a thing so strange that its like had never been seen in the world. It was by this institution, engendered by the fiscal spirit of the Government, that the vanity of the middle classes was kept on the stretch for three centuries and exclusively directed to the acquisition of public employments, and thus was the universal passion for places made to penetrate to the bowels of the nation, where it became the common source of revolutions and of servitude. As the financial embarrassments of the State increased, new offices sprang up, all of which were remunerated by exemptions from taxation and by privileges; and as these offices were produced by the wants of the Treasury, not of the administration, the result was the creation of an almost incredible number of employments which were altogether superfluous or mischievous.[48] As early as 1664, upon an inquiry instituted by Colbert, it was found that the capital invested in this wretched property amounted to nearly five hundred millions of livres. Richelieu had suppressed, it was said, a hundred thousand offices: but they cropped out again under[91] other names.[49] For a little money the State renounced the right of directing, of controlling, and of compelling its own agents. An administrative engine was thus gradually built up so vast, so complicated, so clumsy, and so unproductive, that it came at last to be left swinging on in space, whilst a more simple and handy instrument of government was framed beside it, which really performed the duties these innumerable public officers were supposed to be doing. It is clear that none of these pernicious institutions could have subsisted for twenty years if they could have been brought under discussion. None of them would have been established or aggravated if the Estates had been consulted, or if their remonstrances had been listened to when by chance they were still called together. Rarely as the States-General were convoked in the last ages of the monarchy, they never ceased to protest against these abuses. On several occasions these assemblies pointed out as the origin of all these evils the power of arbitrarily levying taxes which had been arrogated by the King, or, to borrow the identical terms employed by the energetic language of the fifteenth century, ‘the right of enriching himself from the substance of the people without the consent and deliberation of the Three Estates.’ Nor did they confine themselves to their own rights alone; they demanded with energy, and frequently they obtained, greater deference to the rights of the provinces and towns. In every session some voices were raised in those bodies against the inequality of the public burdens. They frequently demanded the abolition of the system of close guilds; they attacked with increasing vigour in each successive age the venality of public employments. ‘He who sells office sells justice, which is infamous,’ was their language. When that venality was established, they still complained of the abusive creation of offices. They denounced so many useless places and dangerous privileges, but always in vain. Three institutions had been previously established against themselves; they had originated in the desire not to convoke these assemblies, and in the necessity of disguising from the French nation the taxation which it was unsafe to exhibit in its real aspect. And it must be observed that the best kings were as prone to have recourse to these practices as the worst. Louis XII. completed the introduction of the venality of public offices; Henry IV. extended the sale of them to reversions. The vices of the system were stronger than the virtues of those who applied it. The same desire of escaping from the control of the States-General[92] caused the Parliaments to be entrusted with most of their political functions; the result was an intermixture of judicial and administrative offices, which proved extremely injurious to the good conduct of business. It was necessary to seem to afford some new guarantees in place of those which were taken away; for though the French support absolute power patiently enough, so long as it be not oppressive, they never like the sight of it; and it is always prudent to raise about it some appearance of barriers, which serve at least to conceal what they do not arrest. Lastly, it was this desire of preventing the nation, when asked for its money, from asking back its freedom, which gave rise to an incessant watchfulness in separating the classes of society, so that they should never come together, or combine in a common resistance, and that the Government should never have on its hands at once more than a very small number of men separated from the rest of the nation. In the whole course of this long history, in which have figured so many princes remarkable for their ability, sometimes remarkable for their genius, almost always remarkable for their courage, not one of them ever made an effort to bring together the different classes of his people, or to unite them otherwise than by subjecting them to a common yoke. One exception there is, indeed, to this remark: one king of France there was who not only desired this end, but applied himself with his whole heart to attain it; that prince—for such are the inscrutable judgments of Providence—was Louis XVI. The separation of classes was the crime of the old French monarchy, but it became its excuse; for when all those who constitute the rich and enlightened portion of a nation can no longer agree and co-operate in the work of government, a country can by no possibility administer itself, and a master must intervene. ‘The nation,’ said Turgot, with an air of melancholy, in a secret report addressed to the King, ‘is a community, consisting of different orders ill compacted together, and of a people whose members have very few ties among themselves, so that every man is exclusively engrossed by his personal interest. Nowhere is any common interest discernible. The villages, the towns, have not any stronger mutual relations than the districts to which they belong. They cannot even agree among themselves to carry on the public works which they require. Amidst this perpetual conflict of pretensions and of undertakings your Majesty is compelled to decide everything in person or by your agents. Your special injunctions are expected before men will contribute to the public[93] advantage, or respect the rights of others, or even sometimes before they will exercise their own.’ It is no slight enterprise to bring more closely together fellow-citizens who have thus been living for centuries as strangers or as enemies to each other, and to teach them how to carry on their affairs in common. To divide them was a far easier task than it then becomes to reunite them. Such has been the memorable example given by France to the world. When the different classes which divided the ancient social system of France came once more into contact sixty years ago, after having been isolated so long, and by so many barriers, they encountered each other on those points on which they felt most poignantly, and they met in mutual hatred. Even in this our day their jealousies and their animosities have survived them. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2886/79859.html","bookId":1142,"book":{"id":1142,"title":"The State of Society in France Before the Revolution of 1789","description":"简介： An interval of about seventeen years has elapsed since the first publication of this book in France, and of the translation of it, which appeared simultaneously, in England. The English version has not been republished, and has long been out of print...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2886","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
