{"id":28421,"no":25,"title":"CHAPTER XV.","content":"THAT THE FRENCH AIMED AT REFORM BEFORE LIBERTY. It is worthy of observation that amongst all the ideas and all the feelings which led to the French Revolution, the idea and the taste for political liberty, properly so called, were the last to manifest themselves and the first to disappear. For some time past the ancient fabric of the Government had begun to be shaken; it tottered already, but liberty was not yet thought of. Even Voltaire had scarcely thought about it; three years’ residence in England had shown him what that liberty is, but without attaching him to it. The sceptical philosophy which was then in vogue in England enchanted him; the political laws of England hardly attracted his attention; he was more struck by their defects than by their merits. In his letters on England, which are one of his best pieces, Parliament is hardly mentioned; the fact was that he envied the English their literary freedom without caring for their political freedom, as if the former could ever long exist without the latter. Towards the middle of the eighteenth century, a certain number of writers began to appear who devoted themselves especially to questions of public administration, and who were designated, in consequence of several principles which they held in common, by the general name of political economists or physiocrates. These economists have left less conspicuous traces in history than the French philosophers; perhaps they contributed less to the approach of the Revolution; yet I think that the true character of the Revolution may best be studied in their works. The French philosophers confined themselves for the most part to very general and very abstract opinions on government; the economists, without abandoning theory, clung more closely to facts. The former said what might be thought; the latter sometimes pointed out what might be done. All the institutions which the Revolution was about to annihilate for ever were the peculiar objects of their attacks; none found favour in their sight. All the institutions, on the contrary, which may be regarded as the product of the Revolution,[137] were announced beforehand by these economical writers, and ardently recommended; there is hardly one of these institutions of which the germ may not be discovered in some of their writings; and those writings may be said to contain all that is most substantial in the Revolution itself. Nay, more, their books already bore the stamp of that revolutionary and democratic temper which we know so well: they breathe not only the hatred of certain privileges, but even diversity was odious to them; they would adore equality, even in servitude. All that thwarts their designs is to be crushed. They care little for plighted faith, nothing for private rights—or rather, to speak accurately, private rights have already ceased in their eyes to exist—public utility is everything. Yet these were men, for the most part, of gentle and peaceful lives, worthy persons, upright magistrates, able administrators; but the peculiar spirit of their task bore them onwards. The past was to these economists a subject of endless contempt. ‘This nation has been governed for centuries on false principles,’ said Letronne, ‘everything seems to have been done by haphazard.’ Starting from this notion, they set to work; no institution was so ancient or so well-established in the history of France that they hesitated to demand its suppression from the moment that it incommoded them or deranged the symmetry of their plans. One of these writers proposed to obliterate at once all the ancient territorial divisions of the kingdom, and to change all the names of the provinces, forty years before the Constituent Assembly executed this scheme. They had already conceived the idea of all the social and administrative reforms which the Revolution has accomplished before the idea of free institutions had begun to cross their minds. They were, indeed, extremely favourable to the free exchange of produce, and to the doctrine of laissez faire et laissez passer, the basis of free trade and free labour; but as for political liberties, properly so called, these did not occur to their minds, or, if perchance they did occur to their imaginations, such ideas were at once rejected. Most of them began to display considerable hostility to deliberative assemblies, to local or secondary powers, and, in general, to all the checks which have been established, at different times, in all free nations, to balance the central power of the Government. ‘The system of checks,’ said Quesnay, ‘is a fatal idea in government.’ ‘The speculations on which a system of checks has been devised are chimerical,’ said a friend of the same writer. [138] The sole guarantee invented by them against the abuse of power was public education; for, as Quesnay elsewhere observes, ‘despotism is impossible when the nation is enlightened.’ ‘Struck by the evils arising from abuses of authority,’ said another of his disciples, ‘men have invented a thousand totally useless means of resistance, whilst they have neglected the only means which are truly efficacious, namely, public, general, and continual instruction in the principles of essential justice and natural order.’ This literary nonsense was, according to these thinkers, to supply the place of all political securities. Letronne, who so bitterly deplored the forlorn condition in which the Government had left the rural districts, who described them as without roads, without employment, and without information, never conceived that their concerns might be more successfully carried on if the inhabitants themselves were entrusted with the management of them. Turgot himself, who deserves to rank far above all the rest for the elevation of his character and the singular merits of his genius, had not much more taste than the other economists for political liberty, or, at least, that taste came to him later, and when it was forced upon him by public opinion. To him, as well as to all the others, the chief political security seemed to be a certain kind of public instruction, given by the State, on a particular system and with a particular tendency. His confidence in this sort of intellectual drug, or, as one of his contemporaries expressed it, ‘in the mechanism of an education regulated by principles,’ was boundless. ‘I venture to assure your Majesty,’ said he, in a report to the King, proposing a plan of this nature, ‘that in ten years your people will have changed out of knowledge; and that by their attainments, by their morality, and by their enlightened zeal for your service and for that of the country, France will be raised far above all other nations. Children who are now ten years of age will then have grown up as men prepared for the public service, attached to their country, submissive, not through fear but through reason, to authority, humane to their fellow-citizens, accustomed to recognise and to respect the administration of justice.’ Political freedom had been so long destroyed in France that men had almost entirely forgotten what are its conditions and its effects. Nay, more, the shapeless ruins of freedom which still remained, and the institutions which seem to have been formed to supply its place, rendered it an object of suspicion and of prejudice. Most of the Provincial Assemblies which were still in existence retained the spirit of the Middle Ages as well as their obsolete formalities,[139] and they checked rather than advanced the progress of society. The Parliaments, which alone stood in lieu of political bodies, had no power to prevent the evil which the Government did, and frequently prevented the good which the Government attempted to do. To accomplish the revolution which they contemplated by means of all these antiquated instruments appeared impracticable to the school of economists. To confide the execution of their plans to the nation, mistress of herself, was not more agreeable to them; for how was it possible to cause a whole people to adopt and follow a system of reform so extensive and so closely connected in all its parts? It seemed to them more easy and more proper to make the administrative power of the Crown itself the instrument of their designs. That new administrative power had not sprung from the institutions of the Middle Ages, nor did it bear the mark of that period; in spite of its errors they discovered in it some beneficial tendencies. Like themselves it was naturally favourable to equality of conditions and to uniformity of rules; as much as themselves it cordially detested all the ancient powers which were born of feudalism or tended to aristocracy. In all Europe no machine of government existed so well organised, so vast, or so strong. To find such a government ready to their hands seemed to them a most fortunate circumstance; they would have called it providential, if it had been the fashion then, as it now is, to cause Providence to intervene on all occasions. ‘The state of France,’ said Letronne, ‘is infinitely better than that of England, for here reforms can be accomplished which will change the whole condition of the country in a moment; whilst among the English such reforms may always be thwarted by political parties.’ The point was, then, not to destroy this absolute power, but to convert it. ‘The State must govern according to the rules of essential order,’ said Mercier de la Rivière, ‘and when this is the case it ought to be all powerful.’ ‘Let the State thoroughly understand its duty, and then let it be altogether free.’ From Quesnay to the Abbé Bodeau they were all of the same mind. They not only relied on the royal administration to reform the social condition of their own age, but they partially borrowed from it the idea of the future government they hoped to found. The latter was framed in the image of the former. These economists held that it is the business of the State not only to command the nation, but to fashion it in a certain manner, to form the character of the population upon a certain preconceived[140] model, to inspire the mind with such opinions and the heart with such sentiments as it may deem necessary. In fact, they set no limits to the rights of the State, nor to what it could effect. The State was not only to reform men, but to transform them—perhaps if it chose, to make others! ‘The State can make men what it pleases,’ said Bodeau. That proposition includes all their theories. This unlimited social power which the French economists had conceived was not only greater than any power they ever beheld, but it differed from every other power by its origin and its nature. It did not flow directly from the Deity, it did not rest on tradition; it was an impersonal power; it was not called the King, but the State; it was not the inheritance of a family, but the product and the representative of all. It entitled them to bend the right of every man to the will of the rest. That peculiar form of tyranny which is called Democratic Despotism, and which was utterly unknown to the Middle Ages, was already familiar to these writers. No gradations in society, no distinctions of classes, no fixed ranks—a people composed of individuals nearly alike and entirely equal—this confused mass being recognised as the only legitimate sovereign, but carefully deprived of all the faculties which could enable it either to direct or even to superintend its own government. Above this mass a single officer, charged to do everything in its name without consulting it. To control this officer, public opinion, deprived of its organs; to arrest him, revolutions, but no laws. In principle, a subordinate agent; in fact, a master. As nothing was as yet to be found about them which came up to this ideal, they sought it in the depths of Asia. I affirm, without exaggeration, that there is not one of these writers who has not, in some of his productions, passed an emphatic eulogy on China. That, at least, is always to be found in their books; and, as China was still very imperfectly known, there is no trash they have not written about that empire. That stupid and barbarous government, which a handful of Europeans can overpower when they please, appeared to them the most perfect model to be copied by all the nations of the earth. China was to them what England, and subsequently the United States, became for all Frenchmen. They expressed their emotion and enchantment at the aspect of a country, whose sovereign, absolute but unprejudiced, drives a furrow once a year with his own hands in honour of the useful arts; where all public employments are obtained by competitive examination, and which has a system of philosophy for its religion, and men of letters for its aristocracy. [141] It is supposed that the destructive theories which are designated in our times by the name of socialism are of recent origin: this, again, is a mistake; these theories are contemporary with the first French school of economists. Whilst they were intent on employing the all-powerful government they had conceived in order to change the form of society, other writers grasped in imagination the same power to subvert its foundations. In the Code de la Nature, by Morelly, will be found, side by side with the doctrines of the economists on the omnipotence and unlimited rights of the State, several of the political theories which have most alarmed the French nation in these later times, and which are supposed to have been born before our eyes—community of goods, the right to labour, absolute equality of conditions, uniformity in all things, a mechanical regularity in all the movements of individuals, a tyranny to regulate every action of daily life, and the complete absorption of the personality of each member of the community into the whole social body. ‘Nothing in society shall belong in singular property to any one,’ says the first article of this code. ‘Property is detestable, and whosoever shall attempt to re-establish it, shall be shut up for life, as a maniac or an enemy of mankind. Every citizen is to be supported, maintained, and employed at the public expense,’ says Article II. ‘All productions are to be stored in public magazines, to be distributed to the citizens and to supply their daily wants. Towns will be erected on the same plan; all private dwellings or buildings will be alike; at five years of age all children will be taken from their parents and brought up in common at the cost of the State and in a uniform manner.’ Such a book might have been written yesterday: it is a hundred years old. It appeared in 1755, at the very time when Quesnay founded his school. So true it is that centralisation and socialism are products of the same soil; they are to each other what the grafted tree is to the wild stock. Of all the men of their time, these economists are those who would appear most at home in our own; their passion for equality is so strong, and their taste for freedom is so questionable, that one might fancy they are our contemporaries. In reading the speeches and the books of the men who figured in the Revolution of 1789, we are suddenly transported into a place and a state of society quite unknown to us; but in perusing the books of this school of economists one may fancy we have been living with these people, and have just been talking with them. About the year 1750 the whole French nation would not have[142] been disposed to exact a larger amount of political freedom than the economists themselves. The taste and even the notion of freedom had perished with the use of it. The nation desired reform rather than rights; and if there had been at that time on the throne of France a sovereign of the energy and the character of Frederick the Great, I doubt not that he would have accomplished in society and in government many of the great changes which have been brought about by the Revolution, and this not only without the loss of his crown, but with a considerable augmentation of his power. It is said that one of the ablest ministers of Louis XV., M. de Machault, had a glimpse of this idea, and imparted it to his master; but such undertakings are not the result of advice: to be able to perform them a man must have been able to conceive them. Twenty years later the state of things was changed. A vision of political freedom had visited the mind of France, and was every day becoming more attractive, as may be inferred from a variety of symptoms. The provinces began to conceive the desire to manage once more their own affairs. The notion that the whole people has a right to take part in the government diffused itself and took possession of the public. Recollections of the old States-General were revived. The nation, which detested its own history, recalled no other part of it with pleasure but this. This fresh current of opinion bore away the economists themselves, and compelled them to encumber their Unitarian system with some free institutions. When, in 1771, the Parliaments were destroyed, the same public, which had so often suffered from their prejudices, was deeply affected by their fall. It seemed as if with them fell the last barrier which could still restrain the arbitrary power of the Crown. This opposition astonished and irritated Voltaire. ‘Almost all the kingdom is in a state of effervescence and consternation,’ he wrote to one of his friends; ‘the ferment is as great in the provinces as at Paris itself. Yet this edict seems to be full of useful reforms. To abolish the sale of public offices, to render the administration of justice gratuitous, to prevent suitors from coming from all corners of the kingdom to Paris to ruin themselves there, to charge the Crown with the payment of the expenses of the seignorial jurisdictions—are not these great services rendered to the nation? These Parliaments, moreover, have they not been often barbarous and persecutors? I am really amazed at the out-of-the-way people who take the part of these insolent and indocile citizens. For my own part I think the King right; and since we must serve, I think[143] it better to serve under a lion born of a good family, and who is by birth much stronger than I am, than under two hundred rats of my own condition.’ And he adds, by way of excuse, ‘Remember that I am bound to appreciate highly the favour the King has conferred on all the lords of manors, by undertaking to pay the expenses of their jurisdictions.’ Voltaire, who had long been absent from Paris, imagined that public opinion still remained at the point where he had left it. But he was mistaken. The French people no longer confined themselves to the desire that their affairs should be better conducted; they began to wish to conduct their affairs themselves, and it was manifest that the great Revolution, to which everything was contributing, would be brought about not only with the assent of the people, but by their hands. From that moment, I believe that this radical Revolution, which was to confound in common ruin all that was worst and all that was best in the institutions and condition of France, became inevitable. A people so ill-prepared to act for themselves could not undertake a universal and simultaneous reform without a universal destruction. An absolute sovereign would have been a less dangerous innovator. For myself, when I reflect that this same Revolution, which destroyed so many institutions, opinions, and habits adverse to freedom, also destroyed so many of those things without which freedom can hardly exist, I incline to the belief that had it been wrought by a despot it would perhaps have left the French nation less unfit one day to become a free people, than wrought as it was by the sovereignty of the people and by the people themselves. What has here been said must never be lost sight of by those who would understand the history of the French Revolution. When the love of the French for political freedom was awakened, they had already conceived a certain number of notions on matters of government, which not only did not readily ally themselves with the existence of free institutions, but which were almost contrary to them. They had accepted as the ideal of society a people having no aristocracy but that of its public officers, a single and all-powerful administration, directing the affairs of State, protecting those of private persons. Meaning to be free, they by no means meant to deviate from this first conception: only they attempted to reconcile it with that of freedom. They, therefore, undertook to combine an unlimited administrative centralisation with a preponderating legislative body—the[144] administration of a bureaucracy with the government of electors. The nation as a whole had all the rights of sovereignty; each citizen taken singly was thrust into the strictest dependence; the former was expected to display the experience and the virtues of a free people—the latter the qualities of a faithful servant. This desire of introducing political freedom in the midst of institutions and opinions essentially alien or adverse to it, but which were already established in the habits or sanctioned by the taste of the French themselves, is the main cause of the abortive attempts at free government which have succeeded each other in France for more than sixty years; and which have been followed by such disastrous revolutions, that, wearied by so many efforts, disgusted by so, laborious and so sterile a work, abandoning their second intentions for their original aim, many Frenchmen have arrived at the conclusion that to live as equals under a master is after all not without some charm. Thus it is that the French of the present day are infinitely more similar to the Economists of 1750 than to their fathers in 1789. I have often asked myself what is the source of that passion for political freedom which in all ages has been the fruitful mother of the greatest things which mankind have achieved—and in what feelings that passion strikes root and finds its nourishment. It is evident that when nations are ill directed they soon conceive the wish to govern themselves; but this love of independence, which only springs up under the influence of certain transient evils produced by despotism, is never lasting: it passes away with the accident that gave rise to it; and what seemed to be the love of freedom was no more than the hatred of a master. That which nations made to be free really hate is the curse of dependence. Nor do I believe that the true love of freedom is ever born of the mere aspect of its material advantages; for this aspect may frequently happen to be overcast. It is very true that in the long run freedom ever brings, to those who know how to keep it, ease, comfort, and often wealth; but there are times at which it disturbs for a season the possession of these blessings; there are other times when despotism alone can confer the ephemeral enjoyment of them. The men who prize freedom only for such things as these are not men who ever long preserved it. That which at all times has so strongly attached the affection of certain men is the attraction of freedom itself, its native charms independent of its gifts—the pleasure of speaking, acting, and breathing without restraint, under no master but God and the[145] law. He who seeks in freedom aught but herself is fit only to serve. There are nations which have indefatigably pursued her through every sort of peril and hardship. They loved her not for her material gifts; they regard herself as a gift so precious and so necessary that no other could console them for the loss of that which consoles them for the loss of everything else. Others grow weary of freedom in the midst of their prosperities; they allow her to be snatched without resistance from their hands, lest they should sacrifice by an effort that well-being which she had bestowed upon them. For them to remain free, nothing was wanting but a taste for freedom. I attempt no analysis of that lofty sentiment to those who feel it not. It enters of its own accord into the large hearts God has prepared to receive it; it fills them, it enraptures them; but to the meaner minds which have never felt it, it is past finding out. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2886/79864.html","bookId":1142,"book":{"id":1142,"title":"The State of Society in France Before the Revolution of 1789","description":"简介： An interval of about seventeen years has elapsed since the first publication of this book in France, and of the translation of it, which appeared simultaneously, in England. The English version has not been republished, and has long been out of print...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2886","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
