{"id":71762,"no":11,"title":"Page 11","content":"“She’s not anorexic or a Satan Worshiper.” I shake my head. “And she wasn’t always like that, nor is she like that anymore. She’s pretty normal.” And sad. And every time I look at her it rips at my heart. “Besides, she’s helped me out with some stuff.” “What kind of stuff?” she questions, giving me a hard stare, like she’s about to claw my eyes out. “Are you sleeping with her? Because if you are, that’s disgusting and pathetic.” For a second I consider telling her that I am, then stand there and watch her walk away, ridding her from my life. But then what the hell would I do? Date someone else? Date Callie? As much as my mind loves that idea of that—and my dick—she’s too good for me and even from the few moments I’ve spent with her, I’ve felt everything way too much. “No, I didn’t sleep with her. She’s just someone I talk to sometimes,” I say, and it’s the partial truth, because that’s who Callie needs to be to me. Callie There’s no one else at the library, except for the librarian who’s pushing a cart around, putting books back on the shelves. I wonder if she lives alone, has cats—I wonder if she’s happy. “So how much time has to go by before we can talk about what happened?” Seth asks, fanning through the pages of a textbook. I feel terrible, like a child, only I’m not anymore. I’m a grown woman, in college, yet I reacted like I’m in high school. I hate that crossing paths with someone from my past can throw me back to the darkness and sadness that may always be a part of me. I shrug, highlighting a note on a page with a bright yellow marker. “What’s there to talk about?” He snatches the marker from my hand and it leaves a yellow streak along the paper. “The fact that you just let that damn bitch walk all over you and the fact that Kayden barely said anything.” “Why would he? He never did before. I’m not his problem.” I peek up at the window where a trail of sunlight streams in. “What happened out there was the story of my life. Soon she’ll be gone and I won’t have to think about her.” He drops the marker onto the table and gazes out at the trees. “What happened with that girl is not okay. You need to grow some confidence and stand up for yourself. Next time she does something like that, pull those tacky extensions out of her hair.” “She wears extensions?” I ask and he nods. I smile, but then shake my head. “If it were the people who tortured you in high school, would you have been able to be so confident?” “We’re not talking about me,” he presses with hard eyes. He shuts his book and crosses his arms on top of it. “We’re talking about you.” “I don’t want us to talk about me anymore. It’s giving me a headache.” I collect the marker from the table and put the cap on. “How about we call it a day for studying. There are some other projects I need to work on.” He sighs and gathers his books into a stack, before pushing away from the table. “Fine, but when I get back to my room, I’m adding don’t take fucking shit from anyone to the list.” Kayden It’s been a week since I talked to Callie. The last time was during Daisy’s random visit that ended in a meaningless fuck and a half-hearted good-bye. I can’t tell who’s avoiding who when it comes to Callie and I, but the more time we spend apart, the more I think about her. My mom also made a sporadic stop at my dorm yesterday when she came to visit the town, which is the bull shit lie she uses whenever she’s taking a break from her drinking to go to a spa and sober up. She has a thing for painkillers and a whole lot of wine. It has been that way for as long as I can remember, which might be why she never stopped the fights. I tried to tell her once about my dad but she didn’t seem too eager to do anything about it. “Well, you’re just going to have to try harder,” she had said, taking a sip of her wine. Some of it spilled down the front of her shirt, but she didn’t seem to notice. “Sometimes we just have to deal with things the best that we can. It’s called life, Kayden. Your dad’s a good man. He puts a roof over our heads and gives us more than a lot of guys would. Without him, we’d probably be on the streets.” I stood at the end of the table, clutching my hands into fists. “But I’m trying my hardest and he only seems to get madder.” She turned the page of her magazine and when I looked into her eyes, she seemed like a ghost, absent, as lost as I was. “Kayden, there’s nothing I can do. I’m sorry.” I left the room, pissed off, wishing she could be the other person for two damn minutes; the one who hosted parties and charity events and smiled. The one that wasn’t a fucking zombie dosed up on pain meds. “What the hell is your problem today?” Luke chucks the football down the field near the field post so it’s far out of my reach. We’re in our uniforms, sweaty, and exhausted, but I can’t calm the fuck down. “Can we please call it a day?” His cheeks are red from underneath his helmet and his shirt is soaked with sweat. “I’m fucking tired. Practice ended two hours ago.” “Yeah, I guess.” I kick one of the cones and it dents before flying over toward the bleachers. Kellie and another girl are sitting on the bottom row, with books in front of them, observing us as they talk and pretend to study. I glance up at the grey sky and around at the bleachers that enclose the field. “How late is it?” He shrugs as he starts across the green field toward the tunnel that leads to the locker room, taking off his helmet. “I don’t know, but it’s pretty damn late and I’m done.” I follow after him, but out of the corner of my eye, I see Callie sitting in the grass below a tree at the far end of the field, on the other side of the fence. There are papers spread out in front of her and she’s chewing on a pen as she reads over them. I realize that maybe I’m the one avoiding her because she makes me feel things I’m not used to; the dirty dreams, the protectiveness, the way my stupid heart starts to beat like it’s finally alive. Unlatching the strap below my chin, I slip off my helmet as I make my way over to her. She’s so absorbed in whatever is written on the papers that she doesn’t notice me. Gripping onto the top of the fence, I swing my legs over it and land on the other side. Adjusting the sleeves of the shirt under my jersey, I stop just a few feet away from her. Her hair is twisted up in a messy bun and she has a short sleeve shirt on with a jacket tied around her waist. She stops biting on her pen to examine one of the papers closely but when my shadow casts over her, she glances up and her whole body spasms. For a second, I think she’s going to leap to her feet and run off. She catches her breath and puts her hand over her heaving chest. “You scared me.” “I can tell.” I drag my fingers through my damp, sweaty hair and then crouch down in front of her slowly, so I won’t scare her again. If I’ve learned anything, it’s that she doesn’t like people getting into her personal space without forewarning. “What are you doing out here?” She looks at the papers and then up at me again. “Homework…. I like hanging out here sometimes.” She gazes out at the field with recollection on her face. “It kind of reminds me of when I used to hang out with my dad while he coached.” “I don’t remember you ever being there,” I say, feeling like a dick again for not remembering her. “How old were you when you did that?” “I did it for years.” She swallows hard and focuses on her papers. “Besides, I can’t do my homework in my dorm a lot of the time. My roommate… well, sometimes…” Her cheeks blush and I find myself smiling at how cute she looks, in a really innocent way. She sputters, “She has guys over a lot.” I scratch my nose to stop myself from laughing at her. “I see. So you have to give her the room for a few hours.” She puts a hand on each side of the row of papers and rearranges them together until they form a stack. “Yeah.” I pause and an apology slips from my lips. “I’m sorry.” Her brows knit as she elevates her chin to meet my eyes. “For what?” “For not telling Daisy to shut her fucking mouth,” I say. “I should have. She was being a bitch to you.” She shrugs, staring at the field. “You don’t need to stick up for me. She’s your girlfriend. You should be on her side.” I kneel down on the grass, getting closer to her. “No, I should have stuck up for you. I owe you that much.” She presses her lips firmly together, returning her attention to me. “You don’t owe me anything, I swear. What I did that night wasn’t that big of a deal. If I would have walked away from the situation then it would have been a big deal.” I do owe her though, so much. Because of her, I have fewer scars. I wish I could take away whatever makes her look so sad all the time. I set my helmet on the grass and pick up her books for her as she reaches for her bag over by the bottom of the tree trunk. “What are you doing tonight?” She stuffs her papers into her bag, crinkling the edges, and then I hand her the books. “I’m probably going to just stay in and watch a movie or something.” “How much longer is your room preoccupied?” I ask and smile as her cheeks turn even redder. “I don’t know.” She rises on her knees, shifts her bag onto her shoulder, and gets to her feet. “I’ll probably just go hang out with Seth until her friend is gone.” I scoop up my helmet and follow her as she heads down the line of the fence. “Why don’t you come out with Luke and me? He wants to go check out this club down in the Town Center. It might end up being a complete shithole, but it’s better than just sitting around in your room.” She halts, adjusting the handle of her bag on her shoulder, and bites her bottom lip so hard the skin around her mouth turns purple. “I don’t think I can.” “Why?” I ask in a playful tone as I grin at her. “Am I that bad to be around?” Her arms fall to her sides and her eyes fasten on mine. “No.” I rub the sore muscles on the back of my neck. “Okay, then come with us. It’ll be fun and if it’s not, we can go do something else.” She balls her hands into fists and then stretches her fingers back out. “Okay.” I’m shocked. I’d been flirting with her out of simple fascination with how she gets flustered, but I didn’t think it would work on her. “Okay, meet us at Luke’s truck at like nine-ish?” She nods and turns her back to me, walking away so quickly, it’s like she’s terrified I’ll stab her in the back. She seems afraid of everyone, except for Seth. But why? Callie I remember pink and white birthday balloons floating around the room, red streamers hanging from the ceiling, and gold wrapping paper balled up on the floor. The way the flames of the candles danced and the trail of smoke flowed up to the ceiling. My mom on the other side of the table, with a camera in her hand and a smile on her face as she clicked the button over and over again.","sourceLink":"https://allnovel.net/the-coincidence-of-callie-kayden-the-coincidence-1/page-11.html","bookId":1974,"book":{"id":1974,"title":"The Coincidence of Callie \u0026 Kayden (The Coincidence #1)","description":"Storyline: The Coincidence of Callie \u0026 Kayden (The Coincidence #1) For Kayden, suffering in silence was the only way to survive. If he was lucky, he could keep his head down, do as he was told, and make it through the day. But one night it seemed like his luck -- and his life -- might finally end... until an angel named Callie appeared just in time to rescue him. Callie has never believed in luck. Not since her twelfth birthday when everything was taken from her. After the worst was over, she locked up her feelings and vowed never to tell anyone what happened. Now, six years later, she continues to struggle with the painful secret that threatens to consume her. When fate lands Kayden and Callie at the same college, Kayden is determined to get to know the beautiful girl who changed his destiny. Quiet and reserved, Callie still fears letting anyone else into her world. But Kayden is certain that Callie has come back into his life for a reason. And the more he tries to be a part of her life, the more he realizes that, this time, it\u0027s Callie who needs to be saved...","cover":"https://allnovel.net/images/the-coincidence-of-callie-kayden-the-coincidence-1.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-coincidence-of-callie-kayden-the-coincidence-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:21:14 AM"}}
