{"id":41769,"no":13,"title":"XIII LEAVE","content":"The Babe went to England on leave. Not that this was any new experience for him; he usually pulled it off every twelve months—influence, and that sort of thing, you know. He went down to the coast in a carriage containing seventeen other men, but he got a fat sleepy youth to sit on, and was passably comfortable. He crossed over in a wobbly boat packed from cellar to attic with Red Tabs invalided with shell shock, Blue Tabs with trench fever, and Green Tabs with brain-fag; Mechanical Transporters in spurs and stocks, jam merchants in revolvers and bowie-knives, Military Police festooned with pickelhaubes, and here and there a furtive fighting man who had got away by mistake, and would be recalled as soon as he landed. The leave train rolled into Victoria late in the afternoon. Cab touts buzzed about the Babe, but he would have none of them; he would go afoot the better to see the sights of the village—a leisurely sentimental pilgrimage. He had not covered one hundred yards when a ducky little thing pranced up to him, squeaking, \"Where are your gloves, Sir?\" \"I always put \u0027em in cold storage during summer along with my muff and boa, dear,\" the Babe replied pleasantly. \"Moreover, my mother doesn\u0027t like me to talk to strangers in the streets, so ta-ta.\" The little creature blushed like a tea-rose and stamped its little hoof. \"Insolence!\" it squeaked. \"You—you go back to France by the next boat!\" and the Babe perceived to his horror that he had been witty to an Assistant Provost-Marshal! He flung himself down on his knees, licking the A.P.M.\u0027s boots and crying in a loud voice that he would be good and never do it again. The A.P.M. pardoned the Babe (he wanted to save the polish on his boots) on condition that he immediately purchased a pair of gloves of the official cut and hue. The Babe did so forthwith and continued on his way. He had not continued ten yards when another A.P.M. tripped him up. \"That cap is a disgrace, Sir!\" he barked. \"I know it, Sir,\" the Babe admitted, \"and I\u0027m awfully sorry about it; but that hole in it only arrived last night—shrapnel, you know—and I haven\u0027t had time to buy another yet. I don\u0027t care for the style they sell in those little French shops—do you?\" The A.P.M. didn\u0027t know anything about France or its little shops, and didn\u0027t intend to investigate; at any rate not while there was a war on there. \"You will return to the Front to-morrow,\" said he. The Babe grasped his hand from him and shook it warmly. \"Thank you—thank you, Sir,\" he gushed; \"I didn\u0027t want to come, but they made me. I\u0027m from Fiji; have no friends here, and London is somehow so different from Suva it makes my head ache. I am broke and couldn\u0027t afford leave, anyway. Thank you, Sir—thank you.\" \"Ahem—in that case I will revoke my decision,\" said the A.P.M. \"Buy yourself an officially-sanctioned cap and carry on.\" The Babe bought one with alacrity; then, having tasted enough of the dangers of the streets for one afternoon, took a taxi, and, lying in the bottom, well out of sight, sped to his old hotel. When he reached his old hotel he found it had changed during his absence, and was now headquarters of the Director of Bones and Dripping. He abused the taxi-driver, who said he was sorry, but there was no telling these days; a hotel was a hotel one moment, and the next it was something entirely different. Motion pictures weren\u0027t in it, he said. Finally they discovered a hotel which was still behaving as such, and the Babe got a room. He remained in that room all the evening, beneath the bed, having his meals pushed in to him under the door. A prowling A.P.M. sniffed at the keyhole, but did not investigate further, which was fortunate for the Babe, who had no regulation pyjamas. Next morning, crouched on the bottom boards of another taxi, he was taken to his tailor, poured himself into the faithful fellow\u0027s hands, and only departed when guaranteed to be absolutely A.P.M.-proof. He went to the \"Bolero\" for lunch, ordered some oysters for a start, polished them off and bade the waiter trot up the consommé. The waiter shook his head. \"Can\u0027t be done, Sir. Subaltern gents are only allowed three and six-penceworth of food and you\u0027ve already had that, Sir. If we was to serve you with a crumb more, we\u0027d be persecuted under the Trading with the Enemy Act, Sir. There\u0027s an A.P.M. sitting in the corner this very moment, Sir, his eyeglass fixed on your every mouthful, very suspicious-like——\" \"Good Lord!\" said the Babe, and bolted. He bolted as far as the next restaurant, had a three-and-sixpenny entrée there, went on to another for sweets, and yet another for coffee and trimmings. These short bursts between courses kept his appetite wonderfully alive. That afternoon he ran across a lady friend in Bond Street, \"a War Toiler enormously interested in the War\" (see the current number of Social Snaps). She had been at Yvonne\u0027s trying on her gauze for the Boccaccio Tableaux in aid of the Armenians and needed some relaxation. So she engaged the Babe for the play, to be followed by supper with herself and her civilian husband. The play (a War drama) gave the Babe a fine hunger, but the Commissionaire (apparently a Major-General) who does odd jobs outside the Blitz took exception to him. \"Can\u0027t go in, Sir.\" \"Why not?\" the Babe inquired; \"my friends have gone in.\" \"Yessir, but no hofficers are allowed to obtain nourishment after 10 p.m. under Defence of the Realm Act, footnote (a) to para. 14004.\" He leaned forward and whispered behind his glove, \"There\u0027s a Hay Pee Hem under the portico watching your movements, Sir.\" The Babe needed no further warning; he dived into his friend\u0027s Limousine and burrowed under the rug. Some time later the door of the car was opened cautiously and the moon-face of the Major-General inserted itself through the crack. \"Hall clear for the moment, Sir; the Hay Pee Hem \u0027as gorn orf dahn the street, chasin\u0027 a young hofficer in low shoes. \u0027Ere, tyke this; I\u0027m a hold soldier meself.\" He thrust a damp banana in the Babe\u0027s hand and closed the door softly. Next morning the Babe dug up an old suit of 1914 \"civies\" and put them on. A woman in the Tube called him \"Cuthbert\" and informed him gratuitously that her husband, twice the Babe\u0027s age, had volunteered the moment Conscription was declared and had been fighting bravely in the Army Clothing Department ever since. Further she supposed the Babe\u0027s father was in Parliament and that he was a Conscientious Objector. In Hyde Park one urchin addressed him as \"Daddy\" and asked him what he was doing in the Great War; another gambolled round and round him making noises like a rabbit. In Knightsbridge a Military Policeman wanted to arrest him as a deserter. The Babe hailed a taxi and, cowering on the floor, fled back to his hotel and changed into uniform again. That night, strolling homewards in the dark, immersed in thought, he inadvertently took a pipe out of his pocket and lit it. An A.P.M. who had been sleuthing him for half a mile leapt upon him, snatched the pipe and two or three teeth out of his mouth and returned him to France by the next boat. * * * * * * * * His groom, beaming welcome, met him at the rail-head with the horses. \"Hello, old thing, cheerio and all the rest of it,\" Huntsman whinnied lovingly. Miss Muffet rubbed her velvet muzzle against his pocket. \"Brought a lump of sugar for a little girl?\" she rumbled. He mounted her and headed across country, Miss Muffet pig-jumping and capering to show what excellent spirits she enjoyed. Two brigades of infantry were under canvas in Mud Gully, their cook fires winking like red eyes. The guards clicked to attention and slapped their butts as the Babe went by. A subaltern bobbed out of a tent and shouted to him to stop to tea. \"We\u0027ve got cake,\" he lured, but the Babe went on. A red-hat cantered across the stubble before him waving a friendly crop, \"Pip\" Vibart the A.P.M. homing to H.Q. \"Evening, boy!\" he holloaed; \"come up and Bridge to-morrow night,\" and swept on over the hillside. A flight of aeroplanes, like flies in the amber of sunset, droned overhead en route for Hunland. The Babe waved his official cap at them: \"Good hunting, old dears.\" They had just started feeding up in the regimental lines when he arrived; the excited neighing of five hundred horses was music to his ears. His brother subalterns hailed his return with loud and exuberant noises, made disparaging remarks about the smartness of his clothes, sat on him all over the floor and rumpled him. On sighting the Babe, The O\u0027Murphy went mad and careered round the table wriggling like an Oriental dancer, uttering shrill yelps of delight; presently he bounced out of the window, to enter some minutes later by the same route, and lay the offering of a freshly slain rat at his best beloved\u0027s feet. At this moment the skipper came in plastered thick with the mud of the line, nodded cheerfully to his junior sub and instantaneously fell upon the buttered toast. \"Have a good time, Son?\" he mumbled. \"How\u0027s merrie England?\" \"Oh, England\u0027s all right, Sir,\" said the Babe, tickling The O\u0027Murphy\u0027s upturned tummy—\"quite all right; but it\u0027s jolly to be home again among one\u0027s ain folk.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3294/90088.html","bookId":457,"book":{"id":457,"title":"The Mudlarks","description":"简介： When I was young, my parents sent me to a boarding school, not in any hopes of getting me educated, but because they wanted a quiet home....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3294","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
