{"id":91014,"no":12,"title":"Page 12","content":"Yes, fine. I’ll finish up in a few more days, she typed. She went on to describe the town of Lily, and the people she’d met. She refrained from saying much about his friend, the sheriff. At the end she added, Anything on the rise? Do I need to be back sooner? She shut down the computer; if there’d been an emergency, Logan would have called her. She rose, stretched and looked around the room. Nothing in it had changed, nothing had moved and she hadn’t heard even a creak in the old floorboards around her. The clock on the mantel told her she’d managed to spend several hours on the computer. Too easy to do. She stood and walked into the dressing room and then the bathroom. The mirror was clear; no words remained, not even the hint of a smudge. Jane slid out of her clothing and into a pair of pajamas that consisted of a tank top and loose trousers. She pulled the bedcovers down and noticed that a blanket lay on the trunk at the foot of the bed. It didn’t seem cold in the room so she left it where it was. The bed stretched out invitingly. She hadn’t lied when she’d told Brian how tired she was. When she lay down to sleep, she hesitated for just a minute. “Good night,” she said softly. “And I apologize for anything I might have said about Sheriff Trent. He seems upset about what’s going on. I believe he’s a decent human being.” Once again, nothing moved or changed in the room. Jane closed her eyes and wondered if she’d stay awake all through the night, waiting to see if something was going to happen. She tossed and turned and half woke in the wee hours of the morning, feeling a chill. She was too tired to actually get up and do anything about it. She thought about the blanket, but she couldn’t make herself move. Moments later, she felt warm again and fell into a deep and peaceful sleep. The alarm on her phone went off at 7:00 a.m. She woke up. Light was filtering through the drapes and she lay there luxuriously for a few minutes, surprised that she’d slept so well. Rising, she showered, brushed her teeth and dressed in a black pantsuit, a blue shirt, her holster and gun and jacket. It wasn’t until she picked up her computer bag and supply box that she looked back at the bed. The blanket lay there, neatly stretched out over the bedspread. The blanket that had been on the trunk. The blanket she hadn’t reached for because she’d been too tired to move. She must have moved. She must have retrieved it in her sleep. But she hadn’t. She couldn’t help shivering. Yes, even knowing that some remained behind in spirit when death had claimed their earthly forms, she could still feel that eerie sense of disquiet, of fear. But she’d learned long ago to accept it. And really... What a nice gesture. “Thank you,” she said aloud. “Thank you so much. I was cold, and you made me warm, and I had a great sleep.” There was no response, but she hadn’t expected one. Yet as she walked to the door, a rush of cold air swept by her. If felt as if something, someone, was hurrying through the dressing room. She started to follow. As she did, there was a knock at her door. She glanced at her watch; she was late. Wonderful. Sheriff Trent had felt compelled to come up and make sure she was ready. “Just a minute!” she called. She followed the draft that had seemed to touch her and walked into the dressing room. This time, there was no steam coming from the bathroom. She didn’t need to go that far. There was a message on the mirror at the dressing table. It was written in her lipstick; it looked as if it had been written in blood. TELL THEM THE TRUTH Puzzled rather than scared, she ignored the chill that seemed to touch her. The truth about what? “But I don’t know the truth,” she said. She watched as the tube of lipstick she’d left out on the table began to float in the air and write out more letters. YOU WILL BEWARE TRICKSTER “Jane?” a woman’s voice called from outside her room. So not Sloan, after all. “Coming!” she said. She hurried to open the door and found Alice Horton. In jeans, a tank top and sneakers—her hair scooped up into a ponytail—Alice looked way more like the girl next door than she did a wicked vamp. But, of course, she was an actress, and she seemed to be pretty good. She could probably play just about any character. “Hey, Alice,” she said. “How are you?” “Fine, thanks. I thought I’d come up and get you. Jennie talked Sloan into having a cup of coffee, but he’s getting a little restless,” Alice told her. “Thank you. I’m on my way. Give me one second.” Jane left the door open and went back for her purse and bag; she hesitated and dashed into the bathroom, anxious to see if there was another message. There was. HELP PLEASE HELP US As he drove to the station, Sloan was smiling to himself. He didn’t realize his passenger had noticed until she asked, “What’s so amusing, Sheriff?” He glanced her way quickly, glad of the dark glasses that hid his eyes. “Oh, nothing.” “You’re grinning from ear to ear,” Jane said. “I’m sorry. I won’t do it anymore.” Jane let out a sigh of aggravation. “Come on, now you have to tell me what you were thinking. It’s only fair!” “First I should tell you I’m not rude or macho or politically incorrect—most of the time.” She laughed. “Okay, I believe you. But now I know there’s a really politically incorrect thought running through your head, so you have to tell me.” “Uh, well...you’re not what I was expecting. Not what I figured you’d, um, look like. Being a Krewe member and all...” His voice trailed off. “Pardon?” “Never mind!” “No! Tell me!” “You make me think of a TV show. Like those crime shows where the medical examiner is a beautiful woman who whispers gentle things to her corpses. You know, like, ‘You poor, poor baby, what did they do to you?’ Or a crime show where the detectives are dressed by Versace or some other designer.” She stared at him as if she were about to explode. “I didn’t mean to be offensive, Agent Everett. It was a compliment,” he insisted. “You’re just—I mean, you must be a little aware that you’re...beautiful.” She gazed at the road ahead, a slight smile playing on her lips. “Well, that part of your statement is quite charming, so thank you. But I don’t whisper sweet nothings to corpses,” she assured him. “And I only wish I had a wardrobe by Versace.” He winced. “I’m sorry. I guess, even if we know better—and I do—we all expect a forensic artist to be an old man like Dr. Bunsen Honeydew from the Muppets or... I’m not helping myself here, am I?” he asked. “No.” “Let me try again. Agent Everett, you look very nice today.” Her smile still teased at her lips as she turned to him. “Hmm. Does that mean I looked like hell yesterday?” “No. I just...hey, sorry. I told you! I shouldn’t have said anything.” Her smile became an honest laugh. “It’s all right. I prefer to avoid stereotypes—as an artist and a law enforcement officer. But you...” “Me?” “Yeah, Sheriff. You. Spend much time at the rodeo? Or, wait—walking down Main Street for a quick-draw contest with a bad guy?” “What?” “Well, you know, you look the part. Rugged Western hero. Gunslinger. Tough guy.” He grinned. “So I’m a stereotype?” “Oh, you definitely could be. But...are you?” He didn’t have to answer; they’d arrived at the sheriff’s office. But even as he exited the car, Deputy Chet Morgan came hurrying out of the office. “Heidi Murphy just called, and she sounded pretty hysterical. She took a group out on a trail ride and they found a body.” “A body? Did she call 9-1-1 for an ambulance?” Sloan asked quickly. “She did, and an ambulance is on its way out. But Heidi was insistent that there’s no need. Says the corpse is practically mummified and that she knows dead from alive. I was going to head out there.” “I’ll take it, Chet. Why don’t you hold down the fort with Betty and Agent Everett,” Sloan told him. Mummified? Were remains from the past showing up all over the place? “I’d like to ride with you on this, if you don’t mind,” Jane said. She was wearing her sunglasses and her perfect face was stoic. Sloan thought of the dream that had plagued him the night before. “It’s better if you stay here, get your work done.” She didn’t have an argument and she knew it as well as he did. She was a federal agent on loan, and a body in the desert was his territory. He’d be calling in the county coroner, and if someone had been killed recently, the state police would probably come in on it, too. But...she was a fed. “Please. I understand. But I’d really like to ride along on this,” she said. He wished she hadn’t been so polite, that the tone of her voice hadn’t shown her complete respect for her position—and his. The dream had been ridiculous. Brought on by the fact that he’d been back home too long without meeting a woman who really appealed to him. So, just because he was afraid for her, and because he was so attracted to her, he was about to be a jerk. He checked himself. “Sure. If you wish. Chet, where are they?” “They’re by that replica Apache village. She was working with a second guide, Terence McCloud, and she’s having him take the tour on back. She’ll be waiting for you. And I’ll warn you—she’s freaking out. She didn’t want to hang out by a corpse.”","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-12.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: The Night Is Watching (Krewe of Hunters #9) The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
