{"id":91016,"no":14,"title":"Page 14","content":"\\n\\n “You know him?” Jane asked.\\n\\n “No.”\\n\\n Heidi was standing there, hyperventilating.\\n\\n “Heidi, you don’t need to be here. Gavin, can you and Joe take the old corpse back to town and over to the county morgue and then get a medical examiner out here for me—and a crime-scene unit? Jane, can you get Heidi back to the stables? You can use the patrol car to return to the office. Looks like I’ll be out here for a few more hours.”\\n\\n Jane nodded. “Sure,” she said. “Heidi?”\\n\\n But Heidi didn’t seem to hear.\\n\\n “I knew him! I knew him. I knew him, oh, God, I knew him!” Heidi cried.\\n\\n Sloan rose and took her by the shoulders. “Heidi, calm down.” He led her out of the tepee. “Who is it?”\\n\\n “Um, um...his name was Jay. Jay something. He stayed at the Old Jail the other night. He was alone. He came and took the trail ride. Alone. His name’ll be on a form back at the stables. Everybody has to sign a form before they get on one of the horses. He was just a tourist, I’m pretty sure.”\\n\\n Gavin and Joe walked behind Sloan. “We’ll get the old corpse back and send out the investigators,” Joe said dully.\\n\\n Sloan nodded. He was still looking at Heidi. “So you took him on a trail ride. The usual?”\\n\\n “Um, it was three days ago. I took him on a night ride. No, wait. He went on two trail rides. He went during the day and then again at night. Oh, God, oh, God, oh, God...”\\n\\n “Heidi, let’s go back to the stables,” Jane said. She glanced at Sloan, evidently realizing that the biggest help she could offer was taking Heidi off his hands. She put an arm around her. “Come on now. Are you going to be able to ride?”\\n\\n “Her horse knows this trail and the way back to the stables better than I know my way around my own house,” Sloan said.\\n\\n “Call if you need me,” Jane told him. “Heidi, come on.”\\n\\n Sloan watched her go, berating himself. He’d actually wanted her to be an incompetent rider; he guessed that for some reason he’d wanted her to do badly at something.\\n\\n Now he was grateful. She was a well-trained federal agent. She also happened to be a beautiful one.\\n\\n He walked over to where Gavin and Joe had managed to slide a board beneath their century-old mummified corpse and lift it into the wagon, apparently causing no harm to the remains.\\n\\n “We’ll get crews out here as fast as we can,” Joe promised.\\n\\n “I’ll be here,” Sloan said.\\n\\n He watched as they crawled in the wagon and Joe picked up the reins. Jane helped Heidi onto her bay, mounted Kanga smoothly and turned to wave to him.\\n\\n He lifted his hand. “Thank you,” he said, though he doubted she could hear him.\\n\\n But she nodded. He didn’t hear her, either, but he thought she said, “See you tonight.”\\n\\n When they were gone, he returned to the area of the tepee. Unfortunately, they’d all done a lot of tracking around before they’d realized they had a current murder on their hands.\\n\\n Sloan inspected the area carefully. In the end, he decided they hadn’t messed up any tracks or caused the crime scene any real harm.\\n\\n The dead man—Jay, whatever his last name might be—had been forced to his knees, Sloan surmised. He’d been shot, execution-style, right where he’d knelt. The blanket had soaked up most of the blood.\\n\\n Why the hell would anyone take a casual tourist out to the desert and execute him?\\n\\n “Because, son, he wasn’t a casual tourist,” he heard.\\n\\n He turned around. Longman was with him. He seldom saw Longman except in his own house.\\n\\n Sloan nodded.\\n\\n “I will wait with you,” Longman told him.\\n\\n He smiled, glad that Longman hadn’t decided to reveal himself to Heidi. Poor Heidi would’ve had a heart attack and he might have had another corpse on his hands.\\n\\n “Thank you,” he said. He pulled out his phone and called the office, telling Chet to get down to the stables and the Old Jail and find out everything he could about the dead man they knew only as Jay.\\n\\n And then he waited.\\n\\n Soon enough, he heard the whir of a copter.\\n\\n He closed his eyes and remembered the strange feeling he’d had the day he’d gone to the Old Jail over the stolen wallets.\\n\\n He remembered the change in the air.\\n\\n The skull in the theater basement.\\n\\n And he remembered his dream.\\n\\n The dark cloud of evil wasn’t coming his way.\\n\\n It was already here.\\n\\n Heidi might have been in shock for a few minutes, but riding back to the stables, she talked nonstop. “It’s horrible. Just horrible. That poor man! Shot dead. He was nice—and he actually tipped after the ride. So he comes here on vacation and he winds up dead in the desert. That’s so horrible. Oh, Lord, I thought an old corpse was horrible. A new one is so much worse. I wonder who the old corpse is? You know, not much happens in Lily. Seriously, thank God we’re not that far from Tucson in one direction and Phoenix in the other, because we’re pretty dead these days. Oh, God, not dead! That’s not what I meant. I mean...there were all kinds of murders way back in the day. Right after the Civil War and into the era of all the cowboys and miners. Back then, I think it was a couple of killings a week. But that was the wild, wild west, you know?”\\n\\n Jane knew. It was just that her own mind was racing and she was only half paying attention to Heidi, which didn’t seem to matter.\\n\\n “We had our famous outlaws—sheriffs, deputies and outlaws. Trey Hardy was the big one around here. He robbed banks after the Civil War. He was a Reb and when the war was over, his family had nothing, but he was like a Robin Hood—giving money and food to everyone around him. Except, of course, robbing banks is illegal. He was finally taken into custody by Sheriff Brendan Fogerty. Problem was, his deputy, Aaron Munson, hated Hardy—although I don’t think he really knew him—and he murdered Hardy in his cell. But people loved Hardy, and they were furious, so they wound up lynching Aaron Munson right in front of the jail on Main Street. So Hardy’s supposed to haunt his old jail cell, just like Munson’s supposed to haunt the street. Oh! Wow! What if we found Trey Hardy’s body? Or Munson’s? No, wait, that can’t be. They’re buried up on Dead Horse Hill, in the graveyard there. Unless someone dug them up. But Hardy supposedly wore parts of an old Rebel cavalry lieutenant’s uniform. And Munson...he’d probably be in a deputy’s uniform. No, wait, maybe they didn’t have them back then....”\\n\\n Jane could have turned to Heidi and said that, yes, ghosts seemed to be teeming in Lily, Arizona. And that was probably true, but what could the ghosts have to do with a man being shot in the desert? And what was the point of scaring Heidi even more than she already was?\\n\\n “You’re so calm!” Heidi said, admiration brimming in her eyes.\\n\\n “Sad to say, I’ve seen a few corpses,” Jane told her. And sadder to say, I’ve had conversations with some.\\n\\n “Nothing happens here—nothing! And now a skull, an old corpse and a new corpse!” Heidi marveled.\\n\\n Thankfully, they reached the stables soon after that. And with almost perfect timing, her phone rang. It was Sloan; he’d called to make sure they’d gotten back without incident.\\n\\n She assured him that they had. “Is there anything I can do?” she asked.\\n\\n “A crime-scene unit is out here, and I have Betty and Chet on finding out who our dead man is, where he came from and how he might’ve gotten himself shot in the desert,” Sloan explained. “Our old corpse, as Heidi calls him, is on his way to the county morgue. If you’re up to it, take the patrol car back to the station and work on the skull.”\\n\\n She smiled at that.\\n\\n If she was up to it.\\n\\n “I’m in town. I’ll clean up, grab something to eat, then head over to your place to get the car and go back to the office. It’s still early.”\\n\\n “Sure. Like I said, I have a car for you. It’s at the office, so once you’re there, you can leave whenever you want. I’ll give Johnny Bearclaw a call and tell him you’ll need my backup keys. Oh, and thank you for dealing with Heidi.”\\n\\n “No problem. She was traumatized. I can well imagine. I remember the first time I saw a corpse. Don’t you remember what it was like?”\\n\\n He was quiet a minute. “There’ve been so many now. Anyway, thanks.”\\n\\n His voice seemed to wrap around her. Impatiently she gritted her teeth as they ended the call. It was better to think of him as a jerk. She didn’t need a one-night affair with cowboy.\\n\\n Or maybe she did. Work had consumed her since the Krewe had come together. She’d had a life. Once.\\n\\n She shook her head. They were dealing with the dead—not just the “old” dead, but the “new” dead.\\n\\n And she was daydreaming about sex....\\n\\n She walked toward Heidi, who was watering her bay. “Heidi, can I leave Kanga here? I’ll be back in an hour or so, then I’ll ride her over to Sloan’s.”\\n\\n “Sure. She’ll be fine here,” Heidi said.\\n\\n “Thanks.”\\n\\n She left Heidi and walked across the street. The door to the theater was open, although it was still early. When she went in, she found Valerie Mystro behind the bar making herself a cup of coffee at the espresso machine.\\n\\n “Hey!” Valerie said, turning around and hurrying to the bar when she saw Jane. “I heard someone was murdered out in the desert. How horrible! I don’t think I ever met the man, but I heard that he was here in town. That’s so scary—almost as scary as finding the skull.”\\n\\n “How do you know all of this already? I just got back with Heidi.”\\n\\n “Oh, well, this is a small town, remember? I was across the street at the saloon earlier, having lunch with Alice and Brian. And the people who’d been on the ride came in and told us about the weird mummified man they’d seen. And then Terence came in because they were closing the stables for the rest of the day. And Chet—Sloan’s deputy—had just been at the stables to get the information on the dead man. Seriously, Jane, this is a small town. If you sneeze, everyone knows about it.” \\n\\n","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-14.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: The Night Is Watching (Krewe of Hunters #9) \\n The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. \\n So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. \\n Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.\\n","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
