{"id":91021,"no":20,"title":"Page 20","content":"\n “I woke up because she was standing over me.”\n “That’s what the supposed ‘ghost expedition’ guy said when he ran out,” Sloan told her.\n His voice was level. She still couldn’t tell if he was skeptical.\n “She led me out of the room. It was late, in between the bar closing and the day staff coming in,” Jane said.\n He was watching her with a deep frown but didn’t say anything so she went on. “I followed her down to the theater and into one of the dressing rooms. She wanted me to see that there’s a trapdoor in the flooring.”\n “And what was under the trapdoor?”\n “I don’t know. I couldn’t budge it, and then...then I left because I thought I heard someone in the bar.”\n “Who was it?”\n “There was no one there, and then I just ran back up to the bedroom because the staff was coming in.”\n “So, you want me to ask Henri Coque about opening the hatch in the dressing room,” he said.\n “Yes. I mean, I shouldn’t even know it’s there. I’m a guest. I have no business being in that part of the theater at all.”\n He nodded. “I guess I need a reason to prowl around the dressing rooms,” he said.\n “There’s a little more....”\n “What’s that?”\n “When I woke up and showered...there was blood on my feet.”\n “You cut yourself?” he asked in a thick voice.\n She shook her head. “No, I didn’t have any cuts—not even a scratch. So, somewhere I walked, there was...blood. And when I heard those sounds, it was like something being dragged. But I didn’t see anything at all, so I don’t know if I imagined it. And I was in the kitchen, so it could’ve been blood from meat they used or...” She stopped, shaking her head again in disgust. “I’m not even sure it was blood. It had rinsed down the drain before I realized I’d tracked it in.”\n “All right. Let me call Newsome and check in with my deputies, then we’ll head back to the theater,” he said.\n He left, and she figured she had about fifteen minutes so she could get another few strips placed on the skull. She went back to work and was concentrating so fully that she didn’t hear him when he returned. He must have been watching her for a while.\n “Muscles make the face,” she murmured. “And soft tissue. The mouth is such a major part of a person’s expression, but working with eyes and nose can give us a good idea of that person’s appearance and demeanor. A skull can tell you about a person’s health and development, too. The reconstruction done on the skull of Robert the Bruce clearly showed the leprosy he suffered before his death. And the skull of King Midas revealed that he’d had his head bound as a child to create a longer vault—something considered noble or beautiful at the time.” She dusted her hands on her work jacket and covered the skull again. She’d been rambling on about her work.\n But, to her surprise, he didn’t refer to anything she’d said.\n “What you did was really dangerous,” he told her instead.\n “Pardon?”\n “Last night. You took off in the middle of the night to follow a ghost. You were barefoot, so I’m assuming you were still in your pajamas. And you didn’t bring your Glock.”\n She’d never mentioned that she carried a Glock, which she did—a Glock 23. A .40 caliber handgun with a magazine that allowed her seventeen bullets. He’d assumed it either because the Glock 23 was a common weapon among law enforcement personnel—or he hadn’t assumed it at all; he’d seen it beneath her jacket. But he’d homed right in on what she’d done the night before.\n “Sloan, there are a number of people in that building.”\n “And they were sound asleep. If they weren’t, they should have been. The cast seems to be a decent group of people—but someone in there probably dug up that skull somewhere...and used a mummified dead man to point the way to a recent murder victim.”\n “I won’t leave my room again without my weapon,” she promised him.\n He turned and left the room. She quickly threw on her coat and hurried into the kitchen to wash her hands.\n As he drove, he was thoughtful. “So, you were in the shower, and you noticed blood going down the drain.”\n She nodded. “I thought I’d stepped on something and cut myself and hadn’t realized it. But the blood wasn’t mine.” She glanced at him. “I suspect traces of it could be found. And the housekeeper is afraid of my room. I told her not to worry about it, just to bring me clean towels now and then. So, I must have tracked it into bed and...”\n “And it’ll be on the sheets,” Sloan finished.\n They neared town and he braked, sliding to the side of the road, surprising her. She looked into the yard where they’d stopped. A handsome young man in his late teens was helping an older woman into a house with groceries.\n “I need just a minute.” Sloan was frowning slightly as he surveyed the teen and the slim, gray-haired older woman.\n “Certainly,” she said.\n Jane got out and stood by the car. The older woman had gone into the house; the young man had a bag in his arms.\n “Jimmy,” Sloan called.\n “Hey, Sheriff,” the teen said, waiting. He smiled at Jane and nodded politely.\n “Giving a hand here, I see,” Sloan said.\n The teen blushed. “I, uh, came over here to apologize. I did hit Miss Larson’s car the other night. I figured the least I could do was a bit of hauling around for her.”\n “Your father know you’re here?” Sloan asked him.\n Jimmy looked uncomfortable. “This was just something I felt I should do.”\n “Good,” Sloan said.\n The older woman came back out. She waved to Sloan. “Hello, Sheriff!”\n “Hi, Connie. You take care.”\n “Yes, sir, thank you! Young Jimmy here helped me get in a week’s worth of groceries. Tomorrow, a lot of mayhem will be coming down on us, what with Silverfest on our doorstep,” she said cheerfully. “Now, I won’t have to venture out into the crowds. I can see the parades and such from my rooftop!”\n “Great, Connie. Enjoy,” Sloan said.\n Jane lifted a hand and waved to her. She waved in return.\n “Jimmy Hough,” Sloan explained, getting back in the car. “Kid smacked the older woman’s car with his dad’s Maserati the other day. He’s actually a decent kid—well, he’d been drinking and I’m not sure what else, but he leaped out of the car to run around and check on Connie Larson. I had him taken in for the night, and his father, Caleb, had a fit. He was in the office to threaten me. I would’ve thought he’d want Jimmy to learn a lesson—before he killed himself or someone else. I went easier than I could have on Jimmy, not because of his father, but because of him. Like I said, he’s a decent kid and I honestly think he learned that you can’t drive when you’re impaired. I was really glad to see that, of his own volition, he came over to Connie’s place to see if he could help her.”\n Jane grinned. “So, the father is a blowhard jerk. And the kid seems to be turning out okay, anyway.”\n “Yeah.” He still seemed worried.\n “What is it?” she asked.\n He shrugged. “Believe it or not, I doubt his father would be pleased. Caleb Hough has a big beefalo ranch about a mile or so past my property. He’s one of those people who feels entitled. He’d think his kid was a pansy—a word I’ve heard him use—for helping the woman just because he nicked what Caleb would call her ‘shit’ car.’”\n She was quiet for a minute; she could tell he liked the kid—if not the father.\n “He looks like he’s about to graduate. He’ll grow up and make his own decisions about the kind of man he wants to be.”\n Sloan nodded. A moment later, they pulled into town.\n “What are we going to say to get into the dressing room?” Jane asked.\n “You haven’t figured it out?”\n “No! This is your town, these are your friends. I waited for you because the plan was that you’d figure out how we’d get down there. I can’t say a ghost led me!”\n “Hmm. I was pretty sure the plan was to get me involved because you couldn’t get it open last night.”\n “With time, I could’ve managed. You’re missing the point—on purpose, I suspect.” She glared at him. “So do you have a plan?”\n His grin deepened. She felt a sizzle of fire; he really could assault the senses with that smile of his.\n “I kind of have a plan,” he said.\n “Yeah?”\n “We’ll get some lunch and come up with a plan. That’s the plan.”\n “They don’t serve lunch at the theater.”\n “We can make sandwiches, can’t we?”\n “Sure.”\n “Okay, while we’re having our sandwiches, we’ll come up with a plan. It’ll be easier to do that if we’re in there, right?”\n “You can’t just say you want to check out the dressing rooms?”\n “You don’t think someone will ask why? Of course, I could tell them all that you seem to be friends with the ghost of my great-great grandmother,” Sloan suggested, ignoring Jane’s groan.\n “Let’s have lunch—and come up with a plan.”\n Sloan grinned. “Isn’t that what I said?”\n 6\n Jane exited quickly as Sloan parked the car. If she didn’t move fast enough, he’d be around to open her car door. It was nice, but not necessary every time.\n They entered the theater and she blinked a minute, letting her eyes adjust after the bright sunlight.\n Alice Horton, dark hair swept back in a ponytail, in sweats, as unvamplike as could be, was digging in the refrigerator. She looked up and greeted them with “Hey, Jane. Sheriff. Any news on the murder?” \n","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-20.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: \n The Night Is Watching (Krewe of Hunters #9) \n The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. \n So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. \n Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.\n \n","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
