{"id":91046,"no":45,"title":"Page 45","content":"\n When she spoke, it was in a rush. “There are spirits of all the people gunned down or murdered in or near the theater, and now those spirits are possessing the mannequins.”\n Sloan felt disappointment streak through him. She’d sounded as if she’d come out of it with all her senses. Now he was worried.\n Not that spirits didn’t exist. Not that people wouldn’t think he was crazy if he ever told the truth.\n He just didn’t believe that spirits were possessing the mannequins. People were down there doing something. He wanted to know who and what. And why...\n “Jennie, maybe someone pushed one of the mannequins at you,” he said. “Maybe one of those people, whoever they are, were in the midst of the mannequins, talking. And that’s probably why it looked like the clown mannequin came after you.”\n “Yes, maybe... It can be so dark and shadowy down there. It’s funny. The theater’s always had that feeling. Of being haunted. Maybe being haunted is the same as being steeped in history. But I always felt good before. Now, I don’t.”\n “You’re right not to feel safe—but it wasn’t ghosts of the old theater doing bad things.”\n Tears stung her eyes. “Am I too old, Sloan?”\n “No, Jennie. You’re not. You walked in on someone’s secret meeting. Listen, you do everything at the theater and you do it well. That has nothing to do with the fact that you stumbled on someone who’s killing people, and that someone needed to silence you.”\n “But...I’m alive,” she said.\n “Yes, you’re alive, and we’re keeping an officer in the hospital, so you’ll stay alive. I’ve given orders that no one else be told that you’re awake,” Sloan explained. He squeezed her hand. “Jennie, you’re going to be okay.”\n She nodded. “I love that theater, Sloan. I was never an actress. But I love working with the actors. I love fixing the costumes, fixing the props.”\n “That brings me to another question, Jennie. Henri told me you loaded the guns for the annual duel.”\n “I did. With blanks.”\n “One of the guns had live ammunition, Jennie.”\n “Sloan, I did not load a gun with live ammunition. I don’t even have live ammunition!” she said indignantly.\n “When did you load the guns and where did you leave them?”\n “I always prepare for every day’s performance the night before,” she told him. “It might have been an hour or so before I went down to the basement.”\n “Where did you leave the guns?”\n “On the prop table. It’s backstage left, in one of the theater wings. Even if we—or the actors—are performing outside, we stick to protocol with the props and costumes.”\n The prop table. Not helpful. Anyone could’ve gotten to them. But no, that wasn’t really true; it had to be someone who could move through the theater unnoticed. The cast and crew had been working outside most of the day, but they certainly went in and out. The housekeeping staff went in—and anyone might duck their head in. But only someone who knew the theater would know where to look for the props.\n “Sloan, I would never, ever hurt an actor! Please, you have to believe me,” Jennie begged.\n He squeezed her hand reassuringly.\n Maybe Jennie wouldn’t, but someone would.\n He stood. “Jennie, anything you can think of, please call me.”\n “It was the clown, Sloan. I’m telling you. It was the clown.”\n “Thanks, Jennie. Now rest. Get better,” he said, and left.\n He reiterated to the staff and the officer on duty that he didn’t want anyone else knowing that Jennie was conscious. He checked in on Jimmy and Zoe Hough, but both were soundly asleep. The resident told Sloan that the Houghs were both doing fine and could be released; Sloan asked that they be kept at least one more night, giving him time to talk to Newsome about arrangements for their protection.\n He finally walked out of the hospital and headed for his car. The moon was high, the landscape glowing with its silvery light. But as he drove out, the desert seemed cast in shadow and mystery. The sand, he knew, hid many secrets of the past. Not some of humanity’s finer moments, he thought drily. Moments of brutality and bloodshed.\n He was eager to get back to town.\n The show had let out when Jane returned downstairs from her room at the Gilded Lily, her bag stuffed with an oversize T-shirt for the night and the few toiletries she’d need.\n She hadn’t heard from Sloan yet, and she knew Kelsey and Logan would remain at the theater, alert to all possibilities, so she called Logan and told him she was going over to the Old Jail. He gave her his customary admonition to be careful; she promised she would be.\n One of Mike Addison’s night managers was on duty when she entered the Old Jail. He greeted her cheerfully, but she felt she was being watched. She wondered if Mike had warned that the “agent” who had rented Trey Hardy’s cell had already caused trouble.\n There were Do Not Disturb signs on the other cell doors she passed; she was obviously the last one in for the night. Turning her key in the door, she stepped in, then sat on the bed. “I’m here. I wish you’d talk to me. I wish I could understand what you want me to know.”\n There was no response. She stood, brushed her teeth and prepared for bed. She left only the small night-light on in the bathroom and lay down in the bed. Everything was quiet. She waited. Lack of sleep took its toll and she dozed off long before she intended.\n She became aware of a weight settling by her side. Half-asleep, she assumed that Sloan had returned from the hospital and decided to join her. When she rolled over to touch him, she felt as though she’d slipped her hand into something thick and icy, and she jolted awake, barely managing to suppress a scream.\n He was back. Trey Hardy.\n He was at her side. He watched her gravely for a minute.\n “I see you,” she told him. “I see you clearly.”\n He reached out a hand, as if he wanted to stroke her face. She felt the sensation of something there—and not there. But the room was dark, and he suddenly seemed as solid as any breathing, living human being. He got up, waiting for her. She did the same. He walked back into the bathroom.\n “Please!” she whispered urgently. “Don’t bang the walls!”\n He placed his hand on the wall by the sink, then leaned against it. He moved his lips to speak.\n “Here,” the ghost said. It was a croak—dry, brittle. It was the rough, sandpapery whisper that others sometimes heard, and when they did, they’d get that eerie feeling that a place was really haunted.\n “In the wall,” she said softly.\n He nodded.\n She started, hearing a knock at the door. Hardy wavered and was gone.\n She hurried to her door, expecting Sloan. She was surprised to see Mike Addison. He hadn’t even been at the desk; she’d assumed he’d gone home for the night.\n She opened the door. “Mike. What’s the problem?”\n “I came to make sure you’re okay—and ask you to be quiet again,” he said.\n She frowned at him, startled. “Mike, I haven’t made any noise. I don’t know what you’re talking about.” She realized that beneath his Western denim jacket he was wearing a holster. He was armed, while her Glock was on the bedside table.\n “That pounding. The guest two cells down called me about it,” Mike said.\n He was just standing there, a little belligerently, talking to her. She didn’t know why he suddenly made her nervous.\n “Let me see what’s going on in here.”\n She wanted to slam the door, which would have been ridiculous. But she didn’t want to let him into the room. She wished she’d gotten her gun before opening the door.\n “Mike, there’s nothing going on in here. I’m alone,” she told him. “If any of the guests are hearing things, the sounds have to be coming from the theater.”\n “The theater is closed.”\n He seemed to be moving toward her. She assured herself that the man couldn’t possibly be enough of a fool to offer harm to a federal agent, especially when it was known that she was at the Old Jail.\n Thankfully, she didn’t have to let him in or slam the door. She heard a creak, and the barred door separating the office from the cells opened and closed.\n Sloan was coming down the hallway.\n “Hey, Mike. What’s up?” Sloan asked. “What are you doing here so late?”\n “I was over at the theater—thought I’d stop in,” Mike said. “And I got here just in time. The guests are complaining about the noise Agent Everett is making.”\n “I’m not making any noise,” Jane said with exasperation.\n Sloan stared at Mike. “If Agent Everett says she isn’t making any noise, I certainly believe her.”\n “But I had a complaint,” Mike protested.\n “Tell the complainers the ghosts must really like them,” Sloan said.\n Mike’s eyes narrowed and he cast his head at an inquisitive angle. “You gonna be here, Sheriff?”\n “I’m going to be here. I’ll see that nothing is going on,” Sloan told him.\n “Oh. Oh!” Mike said. “Okay, um, fine. Well, then. Just, uh, keep it down!” He turned and left abruptly.\n Sloan looked at Jane, amusement in his eyes. “What was that all about?”\n “I don’t know. There really wasn’t any noise coming from the room. But I did see Trey Hardy. And he put his hand on the wall again—right by the mirror. But, more importantly, how is Jennie?”\n “She’s doing well.”\n “What did she say?”\n “She said the clown did it,” he told her wearily. “She kept hearing voices from the room in the basement. She started to think that the spirits of people murdered in Lily had inhabited the mannequins. I think someone goes down there to talk and plot or...I don’t know. But I do think we need to get in that room and find out what’s down there. Anything happen here?” \n","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-45.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: \n The Night Is Watching (Krewe of Hunters #9) \n The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. \n So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. \n Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.\n \n","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
