{"id":91051,"no":50,"title":"Page 50","content":"It felt strange, almost eerie. “Want to check out the rooms upstairs while everyone else is outside?” Kelsey asked. “Sure,” Jane agreed. “If they aren’t all locked.” “The master key is in Jennie’s room. I found it last night,” Kelsey said. “I’ll grab that.” “Good find!” They didn’t need to search the Sage suite, nor Jennie’s room, since Logan and Kelsey had stayed in it. They entered Brian’s. Anything he might have taken—such as the dueling pistols that had disappeared from Jane’s bed—wasn’t there. But they were equally disappointed as they went through the rest of the rooms. The pistols didn’t turn up, nor did any notes, remnants of gold, hidden gold—or even gold jewelry. “Let’s try the theater,” Jane suggested. Downstairs, Kelsey admired the stage. “It’s a remarkable place, really,” she said. “We should move quickly. The company will be coming in soon,” Jane warned. “What’s Henri going to do? He’ll be missing a villain tonight,” Kelsey said. She was sorting through the props on the table, then looked at Jane. “Hey, I think I just found your dueling pistols.” Jane walked over to the prop table. The pistols were there, in plain sight. She picked up one and then the other, handing both to Kelsey. “Blanks,” she murmured. Kelsey nodded. “You’re sure there was live ammunition in one of them?” she asked Jane. “I’m sure—and Sloan still has the live rounds.” “So, I guess Brian was trying to kill Cy. But...why?” “Because he’s the hero? Because he gets the girl?” Jane shrugged. “Although, while he admits he set up the skull, he denies wanting to hurt anyone. According to Sloan, Brian was just trying to get out of the room without being seen.” “Should we check the dressing rooms?” Kelsey asked. “Let’s go.” She led Kelsey through the various rooms, showing her where Sage McCormick’s body had been found. As they walked to the next room, Jane saw something on the floor. Bending down, she touched the fresh, wet stain. She looked up at Kelsey. “Blood,” she mouthed. Kelsey drew her gun and Jane did the same. Kelsey counted silently to three, then nodded at Jane. Jane threw the door open. On the floor, as if he’d fallen while clutching the rack of costumes, lay a man in a pool of blood and fallen fabric. Jane quickly fell to her knees at his side and rolled him over...and recognized Brian Highsmith. She put two fingers on his throat to check for a pulse. It was there but weak. “He’s still alive.” As she spoke, Brian’s eyes flew open. He stared at Jane but couldn’t seem to focus. “She’s dead...she’s dead, too. They knew...they knew...they killed her.” His eyes closed. Jane felt for his pulse again. “Kelsey, I think...the bullet is in his shoulder. He might make it.” “I can’t get a signal down here,” Kelsey said urgently. “Go out to the street. Get an ambulance over here!” Jane begged. “I’ll stay with him.” Kelsey left her, running upstairs and out to the street. As Jane tried to staunch the flow of blood, she heard something behind her. She looked up, assuming Kelsey had returned. But it wasn’t Kelsey. It was one of the mannequins. An old one, from the late 1800s. She’d seen it downstairs.... Jennie had claimed that a clown attacked her, but they’d figured out that it had been Brian, that he’d pushed a clown figure toward her.... This clown was moving—alive and moving. It lifted its arm; it held a gun and took aim at Jane. She rolled to a corner of the room just as the bullet exploded against the dressing-table mirror. The sound of the mirror shattering was what she heard, and she realized there was a silencer on the gun. Someone had tracked Brian down. Someone had tracked him to this room. That someone meant to kill him. And now her. Sloan searched up and down the road, seeking a trail of blood. While he walked, he called the office and reported that Betty and her prisoner were missing. Then he called Newsome and asked for officers to scour the streets in town, the hell with Silverfest. He got into his car and drove slowly, searching the road for any sign of either Betty or Brian Highsmith. He was five minutes from town when his phone rang. Logan said, “Got a call from Kelsey. She has an ambulance rushing to the theater. She and Jane found Brian Highsmith, shot and bleeding to death, in his dressing room at the theater.” “I’m almost there,” Sloan told him. “Any word on Betty?” “None. I’ve got another officer coming to the hospital. I’ll be there as soon as he shows up.” “Thanks. Whatever’s going down seems to be going down now,” Sloan said. He stepped on the gas. As he reached the outskirts of Lily, he was forced to slow down. There was some kind of Silverfest event happening on the road. He left the car on the edge of Main Street and started running in. As he did, he nearly ran by a heap on the ground. He recognized what it was—a body—and stopped himself. He turned and fell to his knees. It was Betty. His heart thundered as he carefully examined her for an injury. “Betty!” he said softly. She groaned and looked up at him. “Sheriff!” “Betty, what the hell happened?” “There was someone flagging me down...I veered off the road. Next thing I knew, someone was in front of me, spraying something in my face...I can’t remember. My head...my head is killing me.... I...” “Stop talking. I’ll get an ambulance out here.” Betty sat up. “No, no, I’m fine. Go...after him. Whoever it was...took Brian. He took Brian....” “Betty, who the hell was it?” “I...don’t know.” “How can you not know?” “He—I can’t even say if it was a man or a woman—was dressed up. Dressed like a...like a Plains Indian...like an Apache in buckskin...with a dark wig and makeup and a black mask. I don’t know who it was...but—” He’d reached for his phone. She set her hand on his. “No, Sloan. I’m all right. Go—get to the theater!” “Betty, you’re injured—” “I’m fine! I’ll call for help. Go.” He didn’t trust her. Betty—who’d been his right hand since he’d returned to Lily. He rose, suddenly very afraid—for many reasons. On many fronts. He crouched down again and pretended to make sure she wasn’t shot or injured, hoping his sleight of hand was successful. “All right, Betty,” he said, and rose. She might be innocent; she might be telling the truth. But he didn’t know. Cops would be crawling all over the theater any minute—but he felt a growing urgency to get there himself. “Go!” Betty insisted. He did. He ran. As he raced through the streets, he looked for people he knew. He didn’t see anyone. He paused just long enough to pull out his phone and call Logan. “Found Betty on the road. I left her there. I’m at the theater.” “You see Kelsey? The ambulance?” “No.” “I’ve called for backup. Was Betty shot? Dead, alive?” “Alive. I don’t trust her, Logan. I don’t trust anything right now.” “I’ll be there in a few minutes. You’ve also got county cops moving in. Maybe you should wait for backup.” Maybe he should. “I can’t,” he said. He burst in through the slatted doors of the theater. Jane scrambled to get her own gun. She managed to fire a shot at the clown, but then the clown was gone. She jumped to her feet and moved carefully to the door—just in time to see the clown run across stage right. Ever wary that a bullet could come tearing at her again, she pursued the clown. She got off a shot when the clown passed ahead of her in the bar area, but he threw open the door to the basement and tore down the stairs. She walked to the doorway, determined to guard the one entry until someone could come. Then she realized that someone was behind her. She turned, ready to fire. Her gun went off just as she was slammed in the head. As she went tumbling down the stairs, she heard someone cry out; she might not have killed her attacker, but at least she’d injured him. It did her little good. She landed in the basement, staring up at the clown. She hadn’t released her grip on the Glock. She lifted her gun. The clown dived to the floor, knocking the wig stand on top of her. She struggled to free herself from the hair and heads with sightless eyes. Footsteps were heading her way down the stairs. The clown, too, was trying to get free from the wigs. She fired again; the clown rolled across the floor and into the mannequin room. Someone was nearly on top of her, coming down the stairs—and swearing in fury. Jane managed to get up and tear across the room, plowing into the rows of mannequins. Once she was there, she went as still as she could...and she listened. Someone was breathing near her. And someone else was walking into the room. In the near-darkness, Victorian madams stared at her, along with Mr. Hyde. A vampire held his cape above his eyes and in the dim light seemed real. Why not? The clown was real. And then she heard a voice she’d come to know well. “Agent Everett, you’re harder to kill than I’d thought! But you should just give it up. Those bullets won’t last forever, and quite frankly, you’re outnumbered. Give it up!” She didn’t move, didn’t breathe. When she felt movement beside her, she turned and fired. She heard a gasp and a scream and then cursing.","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-50.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: The Night Is Watching (Krewe of Hunters #9) The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
