{"id":91008,"no":6,"title":"Page 6","content":"\n The jawbone, disarticulated, lay in front of it, just as it had when it was found.\n Jane seemed to have eyes for nothing but the skull. She walked right up to it, studied it for a moment and then picked up the jaw, testing the jagged lines that connected it.\n “The M.E. was right,” she murmured. “It’s very old.” She glanced at Sloan. “If this was someone who’d died more recently, the structure would have more integrity. The years gone by create these soft spots. If you pressed too hard along one of these lines, it could just fall apart. I would agree that it’s the skull of a woman—probably in her late twenties or early thirties, judging by the fusion of the bones. She took good care of her teeth, since there’s very little decay.”\n For a moment, she closed her eyes. She seemed to be in a trance; she looked like a medium standing there, as if she could communicate with the bone.\n Irritated, he cleared his throat.\n “Can I get you anything?” he asked her.\n She turned to look at him, and she seemed equally irritated. “Sheriff, you are, after all, the sheriff. A very busy man. I’m sure I can find my own way around the office. I’ll help myself to coffee...if you don’t mind.”\n “We change to the night crew at five,” he told her. “Please wrap up your work for the day by then. I’ll get you back to the Gilded Lily and then pick you up in the morning, about 8:00 a.m.—if that works for you.”\n She nodded. “Yes, that’s fine.”\n He left her and returned to his office, the one directly behind Betty’s desk. There were several folders waiting for him. He picked up the first—the arrest report for Arty Johnson. Arty was an old-timer with a penchant for drinking too much. He’d wind up banned from the Gilded Lily and the saloon, but he was really a decent guy, and he’d quickly work his way back into the good graces of the management. Last week, Arty had gotten a little carried away and joined the cast onstage at the Gilded Lily. Henri Coque, incensed at the time, had demanded that he be arrested. Arty had slept it off in one of the five cells, and then Sloan had driven him home. Arty had rued his behavior all the way.\n He set the file aside. Hopefully, Henri wouldn’t press charges.\n He picked up the next file, shaking his head. Jimmy Hough, local high-school senior and football star, was in the cells now. His father owned a beefalo farm; the meat hadn’t become as popular in the east as they’d expected, but Caleb Hough still made a fortune selling his hybrid meat. Jimmy had taken his father’s Maserati out for a spin and crashed into Connie Larson’s Honda. When he was picked up, he’d been as high as a kite—not even Lily, Arizona, escaped the drugs that continued to ravage schools.\n Logan decided this was a good time to type up reports.\n An hour passed as he dealt with paperwork. Then he became aware of a commotion out front. He looked up. Caleb Hough was accosting Betty, reaming her out for putting his son’s future at risk.\n Sloan got up and went out to meet the big man. Caleb wore his wealth as if it were clothing. Maybe that was what happened to self-made men, at least in areas like this, where the population was sparse.\n “Trent!” Hough bellowed as Sloan walked out. “You had the audacity to order your deputy McArthur to keep my kid in jail overnight. It was just a fender bender! Jimmy has a future—he’s a star! He’s being scouted by colleges across the country. If my boy has a record—”\n “Hough, I had my deputy keep your boy in here when he was picked up because he was three sheets to the wind. I would think you’d want him learning something about accountability. No, he’s not a bad kid, and I don’t want to see him with a record. I didn’t just throw him in and forget him, either. I asked Doc Levin in to check on him. I also had a good conversation with him and with Connie Larson. Jimmy didn’t leave the scene, and he was concerned about hitting Connie. I kept him overnight because, for one, he needed to sober up. Two, he needed a lesson. I let him out this morning, since Connie doesn’t want charges pressed and there were no witnesses, and I believe that he’s a good kid. However...he knows I’m watching him now, even if you aren’t. I warned him that if he takes one step in the wrong direction, I’ll throw the book at him. He’s charged with careless driving. Now, get the hell out of here before I charge you with something.”\n Hough scowled at him furiously. “Who do you think you’re talking to? Who do you think you are, putting in your two cents on how to raise my boy?”\n “He won’t be a boy in a year, Caleb. He’ll be of legal age—and if he doesn’t learn his lessons now, he’ll face some real problems.”\n “This isn’t the end of this!” Hough warned him.\n “Let’s hope it is. For your son’s sake,” Sloan told him.\n Hough seemed about to explode. But he turned on his heel and stalked out. Sloan followed him to the door and saw Jimmy Hough standing in front, looking as if he wanted to crawl into a hole. His father walked up to him and slammed the back of his head. Sloan reached for the door but felt Betty’s hand on his arm.\n “Let it go. The kid’s okay. Maybe he’ll survive the old man,” she said quietly.\n He nodded and went back to his office. Betty followed him. “He is pretty powerful, you know, with all his money. Maybe you don’t want to be enemies.”\n “If money can buy this office, Betty, I don’t want it,” Sloan said.\n “He’s going to cause you trouble.”\n “I should have charged the kid with a DUI,” Sloan muttered. “I didn’t because Jimmy was so remorseful and no one was hurt—and because I figured he did deserve a second chance.”\n “And there were no witnesses,” Betty reminded him. “And Connie’s not going to file charges.”\n As they spoke, the door opened and he saw that Declan McCarthy, his senior-ranking night deputy, had arrived. It was time for the shift change.\n He shoved his folders into a desk drawer, anxious to leave. “Let’s call it a day, Betty. Declan is here.”\n Declan came in cheerfully. He’d started off working as an officer in Detroit. He frequently said that he found Lily, Arizona, to be like a little piece of hot, dry heaven.\n Betty went out to report on the day, but there wasn’t much. Sloan closed his computer and went to retrieve Jane Everett.\n He knocked on the door before opening it. She was sitting in front of the easel and had just finished a drawing.\n Sloan paused, staring at the rendering she’d done. It was only a sketch, but she’d done a remarkable job of capturing life. The woman on the page seemed vibrant—on the verge of speaking. Jane had her hair tucked in a bun, a few tendrils escaping to fall over her forehead. She wore a secretive smile as if she held some tidbit of information that she might be convinced to share with others.\n The oddest thing was that he sensed something familiar about her....\n “Sheriff? Ready to go?” she asked briskly.\n “That’s her?” he asked. “You’re already done?”\n She shook her head. “No—well, yes and no. I attached the jaw and did some of the easier work. That’s my preliminary, a bit of a guesstimate. This is what you might call a special science, because it’s a combination of science and art. It’s two-dimensional. You take photographs, feed them into the computer, fill in the tissue-depth approximations for race, age and sex and get a computer mock-up. In the sketch, I worked with images of the skull, using printouts and tracing paper, and this is what I came up with. Tomorrow, I’ll start with the tissue markers—build in the most likely muscle and tissue depths measurements, and begin physically reconstructing. This is just my first imagining.”\n “That’s pretty remarkable,” he said. He couldn’t take his eyes off the image she’d created. He gave himself a mental shake. “Yes, I’m ready when you are.”\n Jane picked up the coffee cup she’d apparently gotten from the kitchen, collected her bag and moved toward the door. She stopped. He was still in the doorway, he realized, staring at the drawing she’d done, wondering why he felt he knew the woman in the drawing.\n “Sheriff?”\n He stepped aside. She exited the room ahead of him, and he heard water running as she washed her coffee mug. He was still gazing at her rendering of a woman’s face.\n He made himself turn away and leave.\n Back in the front office, he introduced Jane to Declan McCarthy, Scotty Carter, the night man on the desk, and Vince Grainger. Now she’d met his entire department.\n Once outside, he again opened her car door, before he walked around to his own.\n They didn’t speak. He didn’t try to make small talk.\n He couldn’t dislodge the mental image he now had of a living, breathing woman.\n Except that she was long dead.\n And nothing remained of her except her skull.\n 2\n The Gilded Lily’s bar and restaurant was open for business when Sloan Trent dropped Jane off. The inner doors that had been locked earlier were now wide-open, and the slatted doors invited travelers to enter—just as they had for over a hundred years. Jane walked in, quickly noting there was no one around that she’d already met. She was assuming the actors she’d encountered that morning were getting into costume or makeup or perhaps finishing dinner somewhere else. In any event, she didn’t recognize a single person in the bar.\n A waitress in a prairie costume, her hair covered by a bonnet, greeted her as she came in. “Dinner, miss? Or did you just wish to sit at the bar?”\n Jane smiled. “Neither. I’m going upstairs. I’m staying here for a few days.”\n “Oh!” The young woman smiled. “I’m Liz. You’re the artist. Welcome. If you want to eat, call down to the bar. We can run something up if you want privacy. And if not, well, come on down! I know you’re here to work on a project, but you should take some time to see the place. Desert Diamonds across the street has great books and weird little treasures. The spa is terrific. The Old Jail is a neat place to stay—really scary. I live in town, but I rented a room there once. Oh, and you have to get down to the basement in the Gilded Lily. Henri took me through once.” She paused and laughed. “They wouldn’t need to do anything to set it up as a haunted attraction! They have old wig stands with painted and carved faces that can totally creep you out and a room filled with old film and theater stuff. Mannequins and wooden cutouts. Some of the mannequins were dressmakers’ dummies. Some were theatrical displays and some were movie props. One of the directors in the 1950s had Hollywood connections and started collecting them.” \n","sourceLink":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9/page-6.html","bookId":2283,"book":{"id":2283,"title":"The Night Is Watching (Krewe of Hunters #9)","description":"Storyline: \n The Night Is Watching (Krewe of Hunters #9) \n The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. \n So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it\u0027s agent Jane Everett. Jane\u0027s also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she\u0027s not resting in peace. \n Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.\n \n","cover":"https://allnovel.net/images/the-night-is-watching-krewe-of-hunters-9.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-night-is-watching-krewe-of-hunters-9.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:45:30 PM"}}
