{"id":79388,"no":44,"title":"Page 44","content":"“I know. He’s been great about not pressuring us.”\n “Lord knows he experienced enough pressure when he was your age. He refuses to put any of you through it, regardless of what Sullivan wants.”\n “What?” Lillian froze. “Are you telling me that the only reason Dad took over Harte Investments was because Granddad pressured him to do it?”\n “In the years following the breakup of Harte-Madison, your grandfather put everything he had into building Harte Investments. It was always understood that Hampton would be his heir apparent. Your father went along with Sullivan’s dreams but they were never really his dreams.”\n “I see.”\n Lillian got to her feet and stood in front of the window, the phone clutched very tightly in her hand. She looked out at the white ripples on the bay and knew a strange sense of sudden understanding. It was as if a veil had been pulled back. She had just gotten a fleeting glimpse of a piece of family history that she had never even suspected existed.\n “Hampton did not want any of you three to feel you had to live someone else’s dreams,” Elaine said.\n “He made that clear to your grandfather years ago.”\n “Dad took the heat for us? I always wondered why Granddad didn’t make a bigger issue out of the fact that none of us showed much interest in Harte Investments. We all thought that Sullivan had just mellowed with the years.”\n “Fat chance.” Elaine gave a soft, ladylike snort. “Your father went toe-to-toe with Sullivan more than once over that issue. He warned your grandfather that he would not permit any of you three to be coerced into turning the company into a family dynasty. Hampton wanted each of you to feel free to choose your own paths in life.”\n “But Dad never felt that he, himself, had that option?”\n “Not in the early days,” Elaine said. “But things have changed. Hampton and I agree now that life is simply too short to spend it maintaining someone else’s vision. Your father has plans for his future and he’s going after it with both hands. Sullivan has called the shots in this family long enough. He can do whatever he wants with Harte Investments. Hampton and I are cutting loose.”\n There was no mistaking the steely satisfaction and determination in her mother’s voice. This was, Lillian thought, a whole new side of Elaine.\n “You’re talking about the charitable foundation you two plan to set up, aren’t you?” Lillian asked.\n “Yes. Your father can’t wait to get started on it.”\n “I see.” Lillian blinked away the moisture that was blurring her view of the bay. “Guess Hannah and Nick and I all owe Dad big-time for keeping Sullivan off our backs, huh?”\n “Yes, you do,” Elaine said pointedly. “But that’s not the issue here. What I want you to understand is that Gabe Madison is one very smart, very savvy CEO. Rumors travel like wildfire in his world. He has to be aware of the situation at Harte Investments. He must know very well that the company probably won’t continue as a privately held family business much longer.”\n “So what?”\n “I suspect he’s working on the assumption that H.I. will either be merged or sold soon. But if he marries you—”\n “Stop.” Lillian could hardly breathe. “Stop right there. Don’t say it, Mom. Please don’t tell me that he’s sleeping with me just because he thinks he can get his hands on a third of Harte Investments that way.”\n There was a heavily freighted pause on the other end of the line.\n “He’d have to do more than sleep with you to get his hands on a large piece of the company,” Elaine said finally. “He’d have to marry you to accomplish that goal, wouldn’t he?”\n Through the window Lillian could see that another new storm was moving in quickly. The winds were snapping and snarling beneath the eaves of the cottage. An ominous haze was forming out on the bay.\n The water was turning steel gray.\n “Look on the bright side, Mom. Gabe hasn’t said a word about marriage. I have it on good authority that, when you get right down to it, I’m not his type.”\n She went through the motions of making a pot of tea while she dealt with the floodtide of restless thoughts that cluttered her brain after she hung up the phone. By the time the water boiled, she had managed to regain some perspective.\n Get a grip, she told herself as she poured the brewed green tea into a cup. What she had said to her mother was true. Gabe had not even hinted at marriage. He seemed quite satisfied with the prospect of having an affair with her, but that appeared to be his only goal.\n On the other hand, she did not have a great track record when it came to applying her intuitive abilities to Gabe Madison. For some reason, her normally reliable sensors always seemed to get scrambled when it came to analyzing his vibes. Until last night, for example, she had been laboring under the assumption that the man was suffering a severe case of burnout.\n She wandered into her studio, mug in hand, and looked at the blank canvas propped on the easel. She had come here to Eclipse Bay to paint, but thus far she had done little more than unpack her paints and brushes. She had made some sketches but she had not done any serious work. The relationship with Gabe was proving to be a huge distraction.\n She fiddled with a pencil for a while, doing a little drawing, trying to get into the zone where the vision of the picture took shape around her, forming an alternate universe.\n But she couldn’t concentrate, so she headed back toward the kitchen to refill her tea mug.\n She saw the light on the telephone answering machine when she was halfway across the living room.\n Belatedly she remembered that there had been two messages. She had only listened to the one from her mother.\n She changed course to play the second message.\n “. . . This is Mitchell Madison. We gotta talk.”\n Just what she needed to round out her day and ensure that she got absolutely no painting done whatsoever.\n That afternoon, she walked into Mitchell Madison’s garden and looked around with interest. She had heard about this fantasyland of lush ferns, exotic herbs, and exuberant roses for as long as she could recall. For years it had been generally accepted in Eclipse Bay that Mitchell’s garden was far and away the most spectacular in town. Even now, in the heart of winter when all of the blooms had disappeared, it was an earthly paradise. But, then, they said gardening was Mitchell’s passion and everyone knew how it was with a Madison and his passion.\n She followed the graveled path that led past banks of thriving ferns and through a maze of exquisitely maintained plant beds. The recent rains had released rich scents from the ground. At the far end of the walk a large greenhouse loomed. She could see a shadowy figure moving behind the opaque walls. \n","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-44.html","bookId":1794,"book":{"id":1794,"title":"Dawn in Eclipse Bay (Eclipse Bay #2)","description":"Storyline: \n From New York Times bestselling author Jayne Ann Krentz—the second novel in a dramatic trilogy set in breathtaking Eclipse Bay, a town filled with rivalries as fierce and compelling as the rugged Oregon coast….Nothing was ever simple between a Madison and a Harte. The feud that had divided their families still simmered. Now, only months after their siblings’ wedding, Lilian Harte and Gabe Madison are at each other’s throats. \n Successful CEO Gabe had insisted on becoming a client of Lilian’s matchmaking service. And after five disastrous dates, Lilian is at her wit’s end. If she hadn’t already decided to close her business and move home to Eclipse Bay, Gabe would have been the final straw. But when she finds Gabe at her door demanding she fulfill their business contract, the sparks between them suddenly turn personal. Once again, Eclipse Bay will witness a showdown—between a relentless Madison and an irresistible Harte…\n \n","cover":"https://allnovel.net/images/dawn-in-eclipse-bay-eclipse-bay-2.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:14:48 PM"}}
