{"id":79399,"no":55,"title":"Page 55","content":"“She may be right. Whoever hit her probably stole it. Maybe he figured he could get a few bucks for it.”\\n\\n “If he’s got any sense, he won’t try to unload it anywhere near Eclipse Bay,” Lillian said. “Sean Valentine will be watching for it and so will everyone else in town.”\\n\\n “I’ll do some research online,” Gabe said. “Maybe I can find another one to replace it for her.”\\n\\n Lillian flashed him a grateful smile. “That would be wonderful.”\\n\\n He liked it when she smiled at him like that, he thought. He liked it a lot. That smile had a very motivating effect on him. He took a long, slow breath and then he took her arm.\\n\\n “It’s getting late,” he said. “Be dark soon. Let’s go back to your place and get some dinner.”\\n\\n Another squall struck just as Gabe halted the car in front of the cottage. Lillian pulled up the hood of her cloak, opened the door, leaped out and made a dash for the front porch. Gabe was right behind her. She stopped in front of the door, shook rainwater off her cloak and rummaged in her purse for her keys.\\n\\n When she got the door open, she headed straight for the mudroom, intending to hang up her cloak so that it could drip dry.\\n\\n Gabe followed, stripping off his jacket. When they reached the mudroom she did not bother to switch on the overhead light. There was enough illumination from the hall to see the row of metal clothes hooks beneath the window.\\n\\n “I don’t know about you,” she said, “but I’m starving.”\\n\\n “I’ll open the wine. You can do the salad tonight.”\\n\\n “It’s a deal.” A damp draft sent a chill through her. “It’s cold in here. Why don’t you start a fire before you—” She broke off abruptly.\\n\\n “What’s wrong?”\\n\\n “No wonder it’s cold in here. The back door is open. I can’t believe I forgot to lock up. But I’ve been distracted a lot lately.”\\n\\n She crossed the small space to push the door closed.\\n\\n “Wait,” Gabe said quietly, pointing to the door.\\n\\n He reached out to switch on the mudroom light and then moved past her. She watched him lean forward slightly to examine the door frame.\\n\\n “Damn.”\\n\\n “What is it?” She moved closer. “Something wrong?”\\n\\n “Yeah. Something’s wrong, all right. Looks like A.Z. wasn’t the only one who got hit by a burglar today.”\\n\\n She didn’t answer him, just stared, disbelieving, at the deep gouges in the wooden door frame and the broken lock.\\n\\n “You sure there’s nothing missing?” Sean Valentine asked for the second time.\\n\\n “No, not as far as I can tell,” Lillian said.\\n\\n Gabe leaned against the kitchen counter and watched her answer Sean’s questions. She sat hunched on the kitchen stool, knees drawn up, feet propped on the top rung.\\n\\n “I went through the whole house,” she added. “Nothing looks as if it’s been touched. Of course, we don’t keep anything really valuable here because the cottage is empty for weeks, sometimes months, at a time. Still, there’s the old television and the new answering machine. And all the stuff I brought with me from Portland. My painting supplies. Some clothes.”\\n\\n “Nothing that would bring a burglar a lot of fast cash, though.” Sean looked down at what he had written. “You know, these guys aren’t known for neatness. They usually leave the place in a mess.\\n\\n Maybe he got scared off before he could get inside. A car coming down the drive would have done it.\\n\\n Or someone taking a walk along the bluff with a dog.”\\n\\n Gabe considered that. “Think that after he got nervous here, he went looking for another, more isolated house to break into? A.Z.’s place?”\\n\\n “And got surprised again. Hit Arizona and took off with her fancy camera.” Sean nodded. “Makes sense.” He flipped the notebook closed. “I’ve been interviewing people all day. So far no one has noticed any strangers acting suspiciously. But that still leaves a bunch of college kids and unknown transients. The camera is my best hope. If someone turns up with it, I’ll have a lead.”\\n\\n “Otherwise, zip, right?” Lillian asked morosely. “I’ve heard that these kinds of burglaries often go unsolved.”\\n\\n “That’s true in big cities but not so true in a small town where you’ve got a more limited group of suspects.” Sean stuffed the notebook into the pocket of his jacket and started toward the door. “I’ll let you know if I come up with anything useful. Meanwhile, get that back door fixed.”\\n\\n Lillian nodded. “I’ll ask the Willis brothers to come over here tomorrow and take care of it.”\\n\\n Sean paused at the door. “Folks are usually a little nervous after a break-in.” He angled a brief, meaningful glance at Gabe. “Nice for you that you won’t be here alone tonight.”\\n\\n Lillian gave him a basilisk stare from her perch on the stool. She did not say a word.\\n\\n Sean did not move. But, then, that was only to be expected, Gabe thought. A basilisk could turn a man to stone with the power of her gaze.\\n\\n “I mean, you’ll be a lot more comfortable with Madison here,” Sean muttered. “Not nervous or anything.”\\n\\n Lillian continued to glare.\\n\\n “Right, she won’t be alone.” Gabe pushed himself away from the counter. “I’ll walk outside with you.”\\n\\n He did not know why he felt obliged to rescue Sean. A guy thing, maybe. Or maybe he just didn’t like the way Lillian had reacted to Sean’s assumption that she was sleeping with him. She looked ticked. For some reason that irritated him.\\n\\n Sean cleared his throat. “Sure. Got to get going. Things to do.”\\n\\n Gabe crossed the kitchen in a few long strides. He had the front door open for Sean by the time the police chief reached it.\\n\\n He moved out onto the porch after Sean and closed the door behind them. They stood in the yellow light and looked at the cars parked in the drive.\\n\\n “Guess I stepped in it back there,” Sean said.\\n\\n “Yeah.”\\n\\n “Sorry about that.”\\n\\n Gabe braced a hand on the porch railing. “Not like it’s a big secret.”\\n\\n “Secrets like that are a little hard to keep here in Eclipse Bay. Especially when a Harte and a Madison are involved.”\\n\\n “I know,” Gabe said.\\n\\n Sean looked thoughtful. “Folks in town are sort of assuming that you’re planning to marry her in order to get your hands on a piece of Harte Investments.” \\n\\n","sourceLink":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2/page-55.html","bookId":1794,"book":{"id":1794,"title":"Dawn in Eclipse Bay (Eclipse Bay #2)","description":"Storyline: From New York Times bestselling author Jayne Ann Krentz—the second novel in a dramatic trilogy set in breathtaking Eclipse Bay, a town filled with rivalries as fierce and compelling as the rugged Oregon coast….Nothing was ever simple between a Madison and a Harte. The feud that had divided their families still simmered. Now, only months after their siblings’ wedding, Lilian Harte and Gabe Madison are at each other’s throats. \\n Successful CEO Gabe had insisted on becoming a client of Lilian’s matchmaking service. And after five disastrous dates, Lilian is at her wit’s end. If she hadn’t already decided to close her business and move home to Eclipse Bay, Gabe would have been the final straw. But when she finds Gabe at her door demanding she fulfill their business contract, the sparks between them suddenly turn personal. Once again, Eclipse Bay will witness a showdown—between a relentless Madison and an irresistible Harte…\\n","cover":"https://allnovel.net/images/dawn-in-eclipse-bay-eclipse-bay-2.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/dawn-in-eclipse-bay-eclipse-bay-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:14:48 PM"}}
