{"id":63115,"no":2,"title":"Page 2","content":"No one was more surprised than Helen when she kicked the ball. She had only paused on her way across the bailey to watch the children play for a moment when the ball suddenly rolled toward her, and she impulsively kicked it. It was a mistake.\\n\\n Goliath, who\u0027d stayed dutifully by her side as always until then, took it as a sign that they were going to play. He was off after the ball in a heartbeat, barking gaily and running like the wind. Helen tried to call him back, but her voice was easily drowned out by the squeals of the children who raced after the huge wolfhound. The dog reached the ball first, of course. Unfortunately, he didn\u0027t understand the rules of the game and, as a hunting animal, he did not fetch it back right away. Instead, he picked it up in his massive jaws and shook it viciously side to side.\\n\\n Helen couldn\u0027t hear the material tear, but she knew it had happened when feathers suddenly filled the air around the beast. Satisfied that he had killed his prey, Goliath strode cheerfully back through the dismayed children to drop the ruined ball at his mistress\u0027s feet. He then sank to the ground and rested his head happily on his front paws in what Helen considered the very picture of male satisfaction. Shaking her head, she bent to pick up and examine the damaged toy.\\n\\n \"My lady?\"\\n\\n Helen turned her attention from the slightly damp-with-dog-drool ball and glanced at the two women who appeared beside her. \"Aye?\"\\n\\n \"This is Maggie,\" Ducky said quietly. Ducky was Helen\u0027s lady\u0027s maid, but also a friend. If she had brought this other woman to her, there had to be something the two needed. Surveying the slightly warty but kindly looking crone, Helen decided she liked what she saw.\\n\\n \"Hello, Maggie.\" she greeted the woman, then tipped her head slightly. \"You are not from Tiernay.\" It wasn\u0027t a question. Helen knew every one of her people; she made it her business to know them. This woman wasn\u0027t one.\\n\\n \"Nay, my lady. I come from Holden.\"\\n\\n Helen\u0027s lips tightened at the news. It could only mean trouble of some sort. Her thoughts were distracted by a murmur of discontent as the children arrived to cluster around her. Their accusing little eyes moved unhappily from Goliath to their now mangled toy.\\n\\n \"I shall repair it at once,\" she assured them guiltily, relieved when the promise seemed to appease them.\\n\\n \"Come.\"\\n\\n The order was for Goliath, who immediately got to his feet to keep pace at Helen\u0027s side as she headed for the keep, but the humans obeyed as well. Ducky and Maggie promptly fell into step behind her while the children trailed at the back. The group made a small parade as it crossed the bailey, mounted the steps and entered Tiernay keep.\\n\\n \"I shall need some fresh feathers, Ducky,\" Helen announced as they crossed the great hall.\\n\\n \"Aye, my lady.\" The woman was off at once, heading for the kitchens where Cook had been plucking chickens all morning for that evening\u0027s meal.\\n\\n \"You children go wait at the table. I shall have Ducky bring you drinks and pasties while you wait.\" So saying, Helen led Maggie and Goliath over to two chairs by the fire. Seating herself in her usual spot, she gestured for the older woman to take the other, then began to search through the small chest nearby for her sewing needle and thread. Goliath settled on the floor by her feet.\\n\\n Helen was aware of the way the woman hesitated, then perched uncomfortably on the edge of her chair, nervous and stiff as could be, but she ignored it as she sought what was needed. She had just gotten ahold of the necessary items when Ducky appeared at her side with a wooden bowl containing the requested feathers.\\n\\n \"Thankyou.\" Helen accepted the bowl and smiled at the woman with appreciation. \"Perhaps you could have someone fetch the children some refreshments and sweets while they wait?\"\\n\\n \"Aye, my lady.\"\\n\\n Helen began to thread her needle, her attention focused on the task as she asked Maggie, \"So, you are from Holden?\"\\n\\n \"Aye.\" The old woman cleared her throat and shifted uncomfortably on her perch. \"I used to be in charge of the chambermaids there.\"\\n\\n \"Used to?\" Helen inquired gently. She drew the thread through the needle\u0027s eye, then glanced up in time to note the bitterness that flashed across the servant\u0027s face.\\n\\n \"Aye. I was released last Christmastide,\" the woman admitted reluctantly. A moment later she blurted,\\n\\n \"The lord wanted only young and pretty maids to serve in the chambers.\"\\n\\n Helen\u0027s mouth thinned. Such news didn\u0027t surprise her. Very little could surprise her regarding the Hammer of Holden\u0027s behavior. Hard work and service were not often repaid kindly by the man. Cruel bastard, she thought with irritation, then forced herself to start mending the large jagged tear in the children\u0027s ball. After several stitches she felt calm enough to ask, \"And what have you been doing for these last six months?\"\\n\\n The woman cleared her throat again. \"Farmer White had been courting me up until then. He was a widower,\" she explained, blushing like a lass fresh out of a schoolroom. \"When I was released, we married. I tended his home and helped on the farm.\" Her smile and blush faded, leaving her pale and weary looking. \"He died these two weeks past.\"\\n\\n \"I am sorry,\" Helen said gently. Glimpsing the tears that sprang to the woman\u0027s eyes before Maggie lowered her head, she turned her attention back to her task. Deciding she had left just enough unsewn, she turned the ball back inside out and began to stuff it with feathers. She was nearly done with the chore when Maggie recovered enough to continue.\\n\\n \"I knew there would be trouble. I couldn\u0027t manage the farm on my own, of course...\"\\n\\n \"He evicted you and gave the farm to another couple,\" Helen guessed quietly. Such wasn\u0027t unheard of, but to her mind it was cruel to treat someone so shabbily when they had worked so hard and faithfully for so long.\\n\\n Maggie nodded. \"He sent poor young Stephen down as usual to do his dirty work.\"\\n\\n Helen nodded. Stephen was Lord Holden\u0027s second, the man left in charge of Holden while the Hammer was away. Which appeared to be quite often. Lord Holden seemed forever off doing battle somewhere.\\n\\n But while Stephen wasHoldenCastle\u0027s chatelain, none of the decisions were his. Surely the Hammer kept up a steady discourse with the man, ordering him to do this or that - none of it very pleasant or kind - and from all accounts, young Stephen suffered horribly from being forced to carry out such wicked deeds.\\n\\n \"He had Stephen claim everything in the cottage for heriot,\" Maggie continued, drawing Helen\u0027s attention back to her. \"Then he was ordered to burn it all before me and send me on my way.\"\\n\\n Helen\u0027s eyes widened incredulously. Heriot was the equivalent of a death tax, a legal part of the feudal system. But claiming every last possession, then burning it all... well, that was just cruel. And deliberately so. \"Did Stephen do it?\"\\n\\n Maggie grimaced. \"Aye. He is a faithful servant. He apologized the whole while, but he did it.\"\\n\\n Helen nodded solemnly as she stuffed the last of the feathers firmly into the ball and prepared to sew it closed. Of course young Stephen had done it. He would follow his lord\u0027s orders.\\n\\n \"His mother would have wept to see him forced to act so.\"\\n\\n Helen glanced up questioningly at the woman\u0027s words and Maggie explained. \"We were friends when she lived in the village. This would have broken her heart.\"\\n\\n \"She is dead?\" she asked politely, knowing the old servant needed the change of topic to help her maintain composure. If talking about Stephen\u0027s mother would help her distance herself from her recent losses, Helen saw no reason not to indulge her.\\n\\n \"Oh, nay. She is not dead. But when Stephen became chatelain and was forced to dole out such harsh punishments... Well, she could not bear to stand by and watch. She left the village. Most people think she is dead, but I think she is living on the border of Tiernay and Holden. Stephen often rides out this way for the afternoon. I think he is visiting her.\" She fell silent for a moment, then added, \"He rode out here after seeing to burning my things. Probably went to visit her then as well.\"\\n\\n Helen took in the lost expression on the old woman\u0027s face and the way she was slumping in her seat and said gently, \"And so you came to Tiernay.\"\\n\\n \"Aye.\" Maggie sat a little straighter. \"My daughter married the tavern keeper in the village ten years back.\"\\n\\n Helen nodded. She knew the tavern owner and his wife, of course.\\n\\n \"And they have offered to take me in... but they must have your permission first.\"\\n\\n Helen was silent for several moments. She was responsible for her land and everyone on it, and therefore, as the woman said, her permission was imperative before any new tenants were allowed to move in. Her first instinct was simply to nod and say certainly Maggie was welcome at Tiernay. But Helen had noted the woman\u0027s odd tone as she had spoken of her daughter\u0027s offer. There was no doubt that Maggie had worked her whole life. Losing her position inHoldenCastlemust have been extremely demoralizing. Her marriage and position as a farmer\u0027s wife had saved her pride somewhat, but now she was reduced to accepting charity from her own child. Helen suspected it rankled the old woman greatly, and now, considering the matter solemnly, she shook her head. \"Nay.\"\\n\\n \"Nay?\" Maggie looked fit to burst into tears, and Helen mentally kicked herself for speaking her thoughts aloud.\\n\\n \"There will be no charity for you, Maggie. You are still strong and healthy. You can work. As it happens, I am in need of someone with your skills.\"\\n\\n Maggie lost her tragic look, hope slowly filling her withered face. \"You do?\"\\n\\n \"Aye. Edwith used to be in charge of my chambermaids here. She died a month ago and I have yet to replace her. Ducky has had to fill that job as well as tend to her own duties. You would be doing both of us a service should you take Edwith\u0027s place. It would relieve a great burden on Ducky.\"\\n\\n \"Oh!\" Much to Helen\u0027s consternation, the woman burst into tears. For a moment, she feared she had erred and Maggie wished to stay with her daughter. Then the woman positively beamed at her through her tears, and Helen relaxed.\\n\\n \"Oh, my lady. Thankyou,\" the new mistress of chambermaids breathed, positively glowing at the idea of being useful again.\\n\\n \"Thank you,\" Helen said firmly, then smiled at Ducky, who had appeared suddenly beside her. \"Perhaps Ducky could show you around and introduce you to the girls who will be under your guidance.\"\\n\\n \"Certainly.\" Ducky beamed at the other woman, then glanced back to Helen. \"Boswell says there is a party approaching.\"\\n\\n \"A party?\" Helen raised an eyebrow in inquiry, and Ducky nodded.\\n\\n \"Aye. They bear the king\u0027s standard.\"\\n\\n Helen paused briefly, then smiled widely. \"Good, good. If you should see my aunt on your tour, pray tell her the news.\" With that, she quickly slipped the last stitch through the ball, tied it off and broke the thread. Standing as the other two women moved away, Helen carried the ball over to the table where its owners were still eating and drinking.\\n\\n \"Here you are,\" she said cheerfully, setting the ball on the table. \"Good as ever. Hurry up with your treats, then get you outside to play. \u0027Tis too nice a day to be indoors.\"\\n\\n Moving away to a chorus of the children\u0027s agreement and thank-yous, Helen scurried to the door of the keep, brushing down her skirt as she went.\\n\\n The travelers were riding through the gates of the bailey as she stepped out into the light. She waited for Goliath to follow her through, then pulled the door closed behind the dog and quickly smoothed down her hair. She felt nervous. This was a party from the king, Ducky had said, and Helen could see that her servant was right. Henry II\u0027s standard fluttered there for all who cared to look - and Helen was looking.\\n\\n This was a banner day. The king was likely responding at last to the many letters she had sent him regarding Lord Holden. That was the only explanation for this visit.\\n\\n It did her heart good. Helen had been begun to fear that the king was entirely ambivalent toward the cold-hearted and even cruel behavior of her neighbor. She had been left feeling frustrated and helpless by her inability to do more than to take in Holden\u0027s serfs and villeins who fled or made their way to Tiernay, and write letters of complaint. Why, once or twice she\u0027d even had to go as far as to purchase Holden\u0027s prospective victims to save them from his wrath. Lord Hethe, the Hammer of Holden, was most certainly a devil in human guise.\\n\\n But finally the king had sent someone to handle the matter. At least, she assumed he had sent someone.\\n\\n This entourage was far too small to count the king amongst it. Henry\u0027s own traveling party could span for miles, as it included his lords and ladies, his servants, his vassals and everything he might need on his journey.\\n\\n Nay. He had obviously sent a man in his stead to tend the matter, and that was fine with her. This affair was most likely beneath his attention anyway; it affected only those whom the Hammer abused.\\n\\n Compared to an entire country\u0027s hardships, this was a small problem. In fact, the people of Holden were very fortunate King Henry was looking into the matter at all.\\n\\n That thought cheering her, Helen waited patiently until the group of men reached the bottom of the stairs; then she made her way down to greet them, Goliath at her side.\\n\\n \"Lady Tiernay?\" It was the oldest of the train who greeted her, his expensive robes rustling as he dismounted and faced her. He wore a hopeful expression.\\n\\n \"Aye. You are from the king.\" She stated the obvious, and the gentleman nodded, a smile tugging at his lips as he took her hand and bowed to press a kiss to her knuckles. \"Lord Templetun, at your service.\"\\n\\n \"You are welcome here at Tiernay, Lord Templetun,\" Helen said formally, then placed her hand on his arm and turned toward the stairs. \"Pray, you must be hungry and thirsty after your journey. Allow us to welcome you properly with a meal and drink.\"\\n\\n Nodding, Lord Templetun started up the stairs with her, calling orders over his shoulder as they went.\\n\\n They had nearly reached the door to the keep when it burst open and the children poured out. Laughing and screaming one moment, they were wide-eyed and silent the next. At the sight of Helen and Lord Templetun, the group mumbled their excuses and moved solemnly down the stairs, only to burst into a noisy run once they were past. Headed back to the game she and Goliath had interrupted, Helen thought with amusement. She smiled and ignored the questioning glance Lord Templetun threw her.\\n\\n Leading him inside, she urged the king\u0027s man to the table the children had just emptied. Helen saw him seated in the head chair that her father had always occupied, then excused herself for a quick trip to the kitchens. She returned moments later with a passel of servants trailing her, bearing the finest food and wine available in Tiernay keep, on its finest silver trays. After nervously supervising the serving of Lord Templetun, at last Helen seated herself beside him and sipped silently from a mug of mead while he ate.\\n\\n She was impatient to confirm his purpose in being there, but she knew it would be rude to do so before he had satisfied his hunger and thirst.\\n\\n Fortunately for her state of mind, Templetun was not a man to waste time on savoring sustenance. He devoured a shocking amount of food - and even more of her finest wine - in a trice, then sat back with a satisfied sigh and beamed.\\n\\n \"I must compliment you on a fine table, my lady. That meal did you credit.\"\\n\\n \"Thankyou, my lord,\" Helen murmured, wondering how to broach the subject of his purpose. Templetun soon put an end to that worry by tugging a scroll from his voluminous robes.\\n\\n \"I bring news from the king.\" He set the parchment before her, then began to dig at his not-so-shiny teeth with the longish nail of the baby finger on his right hand as he awaited her perusal of it.\\n\\n Her hands suddenly shaking, Helen broke the seal and quickly unrolled the scroll, her mind racing over the possibilities of how the king intended to punish her neighbor for his rough treatment of his subjects.\\n\\n Appoint someone to watch over him? Fine him? Chastise him?\\n\\n \"Marry him?\"The words seemed to scream out of the scroll at Helen as her eyes flew over its contents.\\n\\n \"Nay!\" Her head was suddenly light and fuzzy. Feeling herself sway, she shook her head determinedly and peered at Templetun. \"Surely this is a jest?\"\\n\\n She was so upset, she didn\u0027t even notice that she was agitatedly tearing the scroll as she glared at Lord Templetun. Nor did she notice the sudden wary concern on the man\u0027s face as he slowly shook his head.\\n\\n \"Nay, my lady. The king does not jest.\"\\n\\n \"Well, he must - He cannot - This is - \" Helen\u0027s stumbling monologue died abruptly at the sound of approaching footsteps. She turned, relieved to spy her aunt entering the room. Aunt Nell was ever the voice of reason. She would know what to do about this... situation.\\n\\n \"Aunt Nell!\" Even Helen was taken aback by the desperate tone of her voice as she launched out of her seat and rushed to greet the woman who had served as mother to her since her own mother\u0027s death some few years ago.\\n\\n \"What is it, my dear?\" her aunt asked and caught her hands, her gaze sliding between the ripped and crumpled scroll Helen held and her niece\u0027s pallid face.\\n\\n \"The king, he sent Lord Templetun here.\" Helen gestured at the man at the table. \"And he - \" Unable to even say it, she shoved the remains of the scroll at her older relative, silently urging her to read it.\\n\\n Taking the torn message, Lady Nell uncrumpled it and slowly read its contents. Helen watched as her aunt\u0027s eyes flew over the words on the page, then paused, went to the top, then flew over it again.\\n\\n \"Nay,\" the woman breathed with a horror as deep as Helen\u0027s own, then whirled on the man still seated at the table. \"Is this a jest, my lord? Because if it is, \u0027tis a sad one indeed.\"\\n\\n \"Nay, my lady.\" The king\u0027s man shifted uncomfortably in his seat, looking oddly guilty. His gaze darted around the room, looking everywhere but its occupants, then he said, \"The king dictated that missive himself and ordered me to bring it to you. I am to take another on to Lord Holden and bring him back here for the wedding. The king thought it would be good to allow your people time to prepare for the celebration.\"\\n\\n \"But - \" Helen paused and shook her head, trying to gather her rather scattered wits. \"But, this cannot be. Lord Holden is an evil, horrid, cruel man. The king cannot expect me to marry him !\"\\n\\n When Templetun remained silent, his head lowered, refusing to meet her eyes, Helen began to realize that she was indeed expected to do just that. Numbness crept over her, softening her horror, and she sank back onto the trestle table bench. She was to marry that horrid, cruel bastard neighbor of hers.\\n\\n Hethe. The Hammer of Holden. The man who burned villeins out of their homes for no purpose. Dear God, what would he do when he was displeased with her ?\\n\\n \"There must be a mistake,\" Aunt Nell announced firmly, drawing Helen from her miserable thoughts.\\n\\n \"Surely the king would not be so cruel as to force my niece to marry that man. Perhaps he simply does not understand. We must travel to court and explain things to him. We must - \"\\n\\n \"The king is no longer at court,\" Templetun interrupted solemnly. \"He has gone to Chinon to see young Henry and remove some of the members of his court.\"\\n\\n Helen and Nell exchanged startled glances at mention of the king\u0027s son. It was Helen who murmured uncertainly, \"Remove some of his court?\"\\n\\n \"Mmmm.\" Templetun\u0027s face was full of displeasure. \"Aye. Henry wishes to arrange a marriage between the daughter of the Count of Maurienne and youngJohn. The count seems interested, but wants to be sureJohnhas prospects first. The king offered to invest him with the castles Loudon, Mirebeau and Chinon, but young Henry objects. He will only concede to this if his father allows him to rule either England,NormandyorAnjouin his own right.\"\\n\\n \"He wants more power.\" Nell sighed with disgust.\\n\\n \"Aye.\" Templetun nodded his head solemnly. \"It was a mistake for the king to crown his son while he himself yet lives. The boy wants the power that goes with the title.\"\\n\\n \"But what has that to do with removing some of his court?\" Nell asked impatiently.\\n\\n \"Ah, well, the king first thought to take Henry into custody as a warning, but he believes some of young Henry\u0027s courtiers are sparking these ideas in him and hopes that after the removal of their influence, his oldest son will settle down.\" He spoke candidly, then, seeming to realize that he was gossiping, frowned and changed the subject back to the matter at hand. \"In any case, seeing him would make no difference.\\n\\n His mind was made up. He feels that you, Lady Helen, and Lord Holden should work your problems out between yourselves, and he wishes the wedding to take place at once. I am to see to it.\"\\n\\n Helen lowered her head, her gaze landing on the scroll her aunt still held, proof of King Henry\u0027s intent in the matter. It had been written plainly in the message, but for a moment her aunt\u0027s words had given her hope. If she could but talk to the king, throw herself on his mercy -\\n\\n Movement and a rustling just beyond her right shoulder drew Helen from her thoughts. Peering back, she spied Ducky. The maid was wringing her hands, grief and fear both twisting her face as she stared at her mistress. Obviously, the woman had heard enough to know what the message ordered, and she was no less horrified by the missive than her mistress. Straightening, Helen forced a reassuring smile to her face for the servant\u0027s benefit, then glanced around with a start when her aunt - the sweetest, gentlest of ladies - suddenly bellowed like the veriest fishmonger.\\n\\n \"Where the Devil did he get an asinine idea like this?\"\\n\\n Helen spared a moment to gape at her aunt briefly, then turned to hear Lord Templetun\u0027s answer. He did not appear eager to give it. In fact, he was looking quite reluctant. Guilty. The old man was nearly squirming in his seat with his discomfort. Helen was just starting to get the oddest inkling when her aunt suddenly spoke that suspicion aloud.\\n\\n \"You!\"\\n\\n Templetun froze abruptly, the expression on his face not unlike that of a child startled while raiding the pantry.\\n\\n \"It was you,\" Helen breathed in horror, unsure whether to ask why or simply go for the man\u0027s throat.\\n\\n Before she could do either, Templetun was on his feet and easing around the far end of the table.\\n\\n \"Well, I should be getting on now. The king doesn\u0027t like dawdling, and, while it is not a long ride to Holden, the day is waning and travel is so much more uncomfortable at night, is it not?\"\\n\\n The question was rhetorical, Helen was sure. At least, the man didn\u0027t appear to intend to stick around for the answer. He was sidling eagerly toward the main door now, moving fast, and talking faster still.\\n\\n She wished he\u0027d choked on the food she had served him.\\n\\n \"I have been informed that Lord Holden is presently on his way home from performing a task for the king,\" he continued as Helen\u0027s aunt began to follow him slowly across the floor, eyes narrowed and furious. \"So you will have plenty of time to prepare the celebratory feast. I would guess you should plan it for next week\u0027s end. That should be about right. I will send a messenger ahead, of course, so that you can see to any last-minute details.\" The last was said as he slid through the door.\\n\\n \"The little rat!\" Nell said harshly once the keep door had slammed closed behind him.\\n\\n Helen heartily agreed with the pronouncement, but had other concerns more pressing. \"Why would he suggest to the king that Holden and I marry?\"\\n\\n \"Why, indeed?\" Aunt Nell muttered, then moved back to place her hands on Helen\u0027s shoulders to comfort her.\\n\\n \"Surely you are not going to actually marry him?\" Ducky gasped, moving forward to join them. \"Not the Hammer?\"\\n\\n \"I hope not, Ducky. Truly I do.\" Helen\u0027s shoulders slumped miserably.\\n\\n \"Bur what will you do?\"\\n\\n Frowning, Helen began to twist her hands together as her mind flew over the possibilities. Flee? To where? Beg the king? How? He was away and the wedding was to take place at week\u0027s end. Kill the prospective groom? A nice thought, but not very practical, she admitted with a grimace.\\n\\n \"My lady?\" Ducky prompted anxiously.\\n\\n Helen sighed. \"I am not sure what I can do,\" she admitted unhappily.\\n\\n Ducky\u0027s eyes widened in horror. \"Can you not refuse him? Just refuse and - \"\\n\\n \"And have the king send me off to an abbey? I would rather marry the man and kill him than do that!\\n\\n Who would look after my people if that happened? The Hammer, that is who. Tiernay would be forfeit to him as my dower should I refuse the king\u0027s orders.\"\\n\\n Ducky bit her lip at that, then leaned closer to whisper. \"Maggie knows this and that about herbs. Or Old Joan the Healer. She might know of something we could give him to - \"\\n\\n \"Bite your tongue,\" Helen hissed, covering the maid\u0027s mouth with her hand and glancing nervously about the empty great hall. \"I never want to hear such a suggestion from you again, Ducky. It could get you strung up in the bailey.\"\\n\\n \"But then what will you do?\" The servant looked miserable as Helen removed the hand covering her mouth. \"You cannot marry the Hammer.\"\\n\\n Helen sighed again. \"It appears I will have to. I cannot refuse a direct order from the king.\"\\n\\n \"Why not?\" Ducky asked frantically. \"The Hammer does it often enough. Why, he - \"\\n\\n \"That\u0027s it!\" Aunt Nell, who had stood silent and thoughtful throughout the last few moments, suddenly grabbed Helen\u0027s arms excitedly, unconsciously giving her a shake.\\n\\n \"What?\" Helen asked with a glimmer of hope.\\n\\n \"You cannot refuse. But the Hammer can . He is too powerful a lord for the king to force him, should he really wish to refuse.\"\\n\\n Ducky snorted. \"And do you really think for one minute that the Hammer will refuse to marry her?\\n\\n Look! She\u0027s as pretty as her mother ever was. And sweet as honeyed mead as well. Then there is her land. Who would refuse a dower like Tiernay?\"\\n\\n Helen sagged slightly, some of her hope leaving her, but Aunt Nell merely straightened her shoulders and spoke staunchly. \"Then we shall have to make you and Tiernay less attractive.\"\\n\\n Ducky looked doubtful. \"Templetun has already seen her for the pretty lass she is. You can\u0027t suddenly blacken her teeth and shave her head.\"\\n\\n \"Nay,\" Helen agreed slowly, a small smile teasing the corners of her lips as an idea flared in her mind.\\n\\n \"But there are other things we can do.\" \\n\\n","sourceLink":"https://allnovel.net/bliss/page-2.html","bookId":2651,"book":{"id":2651,"title":"Bliss","description":"Storyline: Something had to be done. It had gone on too long, and if King Henry received one more letter from either of the feuding nobles, he\u0027d go mad. What Lady Tiernay needed was...well, she was a beauty, but whoever married the nag would truly get a mixed blessing. And Lord Holden-could all the rumors regarding his cold heart be lies? The man certainly had sobered since the death of his first wife. \\n If he were smart, Henry would force the two to wed, make them fatigue each other with their schemes and complaints. Yes, it was only fitting for them to share the bed they made-\u0027til death did them part! Who could tell, perhaps they would even find each other suitable; perhaps Lord Holden would find in his bride the sweet breath of new life. Heaven alone knew what would happen when two foes were the last things between themselves and the passion they\u0027d never known they wanted.\\n","cover":"https://allnovel.net/images/bliss.jpg","author":"Lynsay Sands","type":"Historical","source":"allnovel","link":"https://allnovel.net/bliss.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:49:59 AM"}}
