{"id":94713,"no":13,"title":"Page 13","content":"\n She felt her cheeks warm at the compliment. “Thank you.”\n “Okay if I kiss you?”\n She laughed softly. “You’ve never asked before, but, yes, it’s okay.”\n She closed her eyes as his arm slid around her shoulders, drawing her closer. His lips were cool, yet, at their touch, heat flowed through her, turning her blood to liquid fire. She had been kissed by other men, but never with such intensity. If kissing were an art form, he would surely be the master, she thought dreamily. The Michelangelo of osculatory delights. The Picasso of kissers.\n Somehow, they were lying on the sofa, with Rhys’s body covering hers, his mouth trailing fire as he rained kisses on her forehead, the tip of her nose, her eyelids, and her cheeks before returning to her lips. She moaned softly, every nerve and cell in her body straining toward him. It had been years since her divorce, years since she had taken a man to her bed. Or wanted to.\n She felt bereft when he took his mouth from hers and gained his feet.\n A rush of heat flooded her cheeks when she looked past Rhys and saw Shirl standing in the doorway, a smirk on her face. “I hate to interrupt you, but Mr. Parker just called.”\n “He did?” Sitting up, Megan smoothed a hand over her hair. “I didn’t hear the phone.”\n “I’m not surprised. Anyway, he said he’s going to be late tonight and wants to know if you can go in a little early and open up.”\n “Is he still on the phone?”\n “No. He said to call back if you can’t make it.”\n Megan glanced at her watch. It was seven fifteen. “I guess I’d better get ready.”\n “Sorry for the intrusion,” Shirl said, looking at Rhys. “It was nice to meet you, Mr. Costain.”\n He grinned at her as he raked a hand through his hair. “Just Rhys.”\n “Rhys it is,” she said, returning his grin. “See you tomorrow, Meggie. Good night, Rhys.”\n He waited until Shirl left the room before taking Megan by the hand and pulling her to her feet. “Meggie?”\n “I hate that name.”\n “Would you like me to drive you to work?” he asked.\n “That isn’t necessary.”\n He was about to say he would be glad to do it when his cell phone rang. “Excuse me.” Turning his back to Megan, he flipped open the phone. “What is it?”\n “There’ve been three more murders,” Rupert said. “Bodies all drained of blood.”\n “Where?”\n “Fort Worth.”\n “Thanks for letting me know,” Rhys said, and ended the call.\n “Is something wrong?” Megan asked.\n “Some business at the club I need to take care of,” he replied. “I’ll see you tomorrow night.”\n A quick kiss, and he was gone.\n “He’s a hottie, that one,” Shirl said, coming up behind her.\n “What? Oh, yes, he is.”\n “He sure left in a hurry.”\n “Some business at his club. I’ll have to take you there some time. You’ll love it.”\n “He’s gorgeous, but I can see why he scares you. There’s an edge about him, something…I don’t know.”\n “You sensed it, too?”\n “How could anyone miss it?”\n “I thought maybe it was just me.”\n “Another thing, he seems really, I don’t know, really worldly wise and self-assured for someone so young. You know what I mean?”\n Megan nodded. She had noticed that, too. “He doesn’t act his age, that’s for sure.”\n “Be careful, girlfriend,” Shirl admonished. “I think this one plays for keeps.”\n Rhys swore softly as he drove to the club. He didn’t want to have to worry about some rogue vamp, or what it might mean if the renegade decided to come to LA. As Master of the West Coast Vampires, Rhys had only one rule for those in his territory—don’t leave any bodies drained of blood where they could be found. Most vampires were smart enough not to call attention to their kind. They preyed on transients or the homeless—people who wouldn’t be missed. But this rogue, he was killing indiscriminately, and that boded ill for all of them.\n Chapter 10\n Tomás strolled through the Log Cabin Village located in a woodsy section of Trinity Park in Fort Worth. Seven fully restored cabins occupied the settlement. All had been built sometime in the 1850s. During the day, volunteers gave visitors a taste of what life had been like in days gone by, demonstrating things like grinding corn, spinning, weaving, and the art of making candles. The botanical gardens were another of his favorite sites. The gardens featured over two thousand acres of trails and garden exhibits in what was one of the oldest and largest natural settings in North Texas. In addition, there was a large conservatory filled with tropical plants and exotic birds.\n Another place he visited whenever he was in town was the Kimball Art Museum. At one time or another, the museum had showcased the work of such noted artists as Rubens, Picasso, Renoir, and Rembrandt, as well as the works of contemporary artists from around the world.\n One of the advantages of being a vampire was that he didn’t have to endure the crowds of tourists who descended on Trinity Park or roamed through the museum during the day. Visiting the museum late at night, he could study his favorite paintings without being bothered by impudent teens or noisy toddlers.\n Leaving the museum, he moved swiftly to Sundance Square. Located in the heart of downtown, the square gave him the feeling of walking the streets at the turn of the century, with its renovated storefronts and red brick streets. He had walked here when the city was new, when the streets were dirt and the stink of cowboys, horses, and cattle filled the air. But now his nostrils filled with a different scent.\n The scent of prey.\n He found them parked in a car on a side street, the windows covered with steam. Young lovers, he thought, as he wrenched the driver’s side door open. He broke the boy’s neck with a quick twist and had the girl in his arms and out of the car before she realized what was happening.\n His hand stifled her cries as he carried her away from the car, away from the city, to a place where her screams wouldn’t be heard, and then he let her scream to her heart’s content as he buried his fangs in her neck. She fought him as best she could, but her fists were puny weapons; he hardly noticed them striking his back as her warm red blood trickled down his throat.\n Chapter 11\n On the night of the concert, Rhys arrived at Megan’s house a few minutes after eight. He looked drop-dead gorgeous, as always. Clad all in black and wearing a pair of trendy dark glasses, he could easily have passed for a rock star himself.\n There was a line around the building when they arrived at the venue, but Megan had a pass so she and Rhys didn’t have to wait. There were hoots and hollers of protest when they bypassed the crowd and ducked through a side door reserved for VIPs.\n “Have you ever been to a rock concert?” Megan asked as they took their seats in a roped-off section in the front of the hall.\n “One or two,” Rhys answered. In his time, he had seen them all. He had to admit, being in close quarters with thousands of screaming fans wasn’t his favorite way to spend an evening. It wasn’t easy to keep his hunger under control when every indrawn breath carried the scent of blood, when his ears were assaulted by the sound of so many beating hearts. If not for the lovely woman beside him, he wouldn’t be here now. He supposed it was a sign of how smitten he was with Megan DeLacey that he had agreed to come to the concert at all.\n Excitement flooded the stadium and screams bounced off the walls when Drexel appeared. He wore a pair of black spandex pants, a white shirt reminiscent of the kind pirates had once worn, and knee-high black boots.\n Colored lights flashed as he swaggered to center stage. He looked out over the crowd and then, as if reaching for a woman, his hand curled around the microphone, and he began to sing.\n Rhys shook his head. He doubted if anyone could actually hear Drexel’s voice over the earsplitting music and the near-hysterical screams of thousands of crazed female fans. White vapor rose from the stage floor and curled around Drexel’s ankles. Cameras flashed. Girls fainted. Yellow-shirted security guards prowled the front of the stage and the edges of the crowd, leaping into action now and again to prevent overeager fans from jumping up on the stage.\n Rhys glanced at Megan when she tugged on his arm. “What do you think of him?” she asked, shouting to be heard over the roar of the crowd.\n “He’s good.” The kid might be young, but he knew how to play to the audience. They had fallen under his spell the minute he walked out on the stage, and he never let them go. Rhys had to admire that.\n The band had been playing for about an hour when Rhys detected the acrid scent of smoke. Lifting his head, he sniffed the air. The smell was coming from backstage, and getting thicker and stronger by the minute.\n “Come on,” he said, grabbing Megan by the hand. “We’re getting out of here.”\n “Why? What’s wrong?”\n “No time to talk about it now.” He slid his hand up until he had a firm grip on her forearm.\n “Rhys!” She twisted, trying to break his hold. “I’m not ready to go.”\n “Yes, you are.” He pulled her along behind him until they reached the aisle.\n A security guard stepped out in front of Rhys. He glanced at Megan, who was still trying to wriggle free of Rhys’s grasp. “Something wrong here?”\n “There’s a fire,” Rhys said curtly. “Backstage. You’d better get these people out of here before it’s too late.”\n The guard’s eyes narrowed. “Fire?”\n “Can’t you smell it?” Rhys glanced back at Megan. She had stopped fighting him, her gaze riveted on the stage where long, yellow tongues of flame were eating their way up the backdrop.\n Drexel and the band seemed unaware of what was going on until shouts of “fire!” grew so loud, they drowned out the band. The music came to an abrupt halt when Drexel glanced behind him. The drummer jumped to his feet when the backdrop dissolved in a shower of rainbow sparks. Without the barrier, the acrid stink of burning wood and fabric grew stronger, heavier. Panic erupted on the stage and spread through the audience as thousands of people blindly fought their way through the smoke toward the exits, tripping over each other in their haste. \n","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-13.html","bookId":2304,"book":{"id":2304,"title":"Everlasting Desire (Everlasting #2)","description":"Storyline: \n Everlasting Desire (Everlasting #2) \n Desire Burns Forever \n The clientele at Shore\u0027s clothing store includes some of L.A.\u0027s sexiest bachelors. But none of them affects Megan DeLacey as deeply as the dark-eyed stranger who strides into her boutique one evening - and keeps returning, night after night. Megan is drawn to Rhys Costain even as she fears him. Because his reason for being there is clear - he wants Megan, with an intensity that\u0027s both tempting and terrifying. \n For almost five centuries, Rhys has lived alone, using women as it pleased him and never wanting more. As Master of the West Coast vampires, it\u0027s his duty to eliminate the ancient vampire who\u0027s draining humans on his turf, putting all of their kind at risk. But Megan\u0027s lush beauty and vibrant warmth is blinding him to a danger that will soon engulf them both - and tear him from the only woman who can satisfy his darkest hunger.\n \n","cover":"https://allnovel.net/images/everlasting-desire-everlasting-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-desire-everlasting-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:09:34 PM"}}
