{"id":94737,"no":37,"title":"Page 37","content":"“Leave town,” Megan said quickly. Rhys looked at Daisy. “What do you think?” “I agree with Megan. There’s a whole world out there. Why shed blood over a few acres?” Erik laughed at her quick reply. Rhys snorted softly. “For the last time, I’m not slinking out of town like some whipped cur.” Megan exhaled sharply. “You and your silly pride.” “Sometimes it’s all a man’s got to call his own,” Rhys said quietly. Erik nodded. “Better to go out with a bang than a whimper, right?” “Exactly,” Rhys said. And that, Megan thought glumly, was that. Chapter 37 On Monday night, Rhys thanked Erik and Daisy for their help. Megan had expected them to be anxious to return to Boston, so she was surprised when Daisy said she wanted to stay for another week or so. “I haven’t been to Beverly Hills yet,” she explained with a sidelong glance at Erik. “I’ll be broke by the time I get her out of those shops,” Erik complained, but he was smiling when he said it. Daisy just grinned. “Let’s go find a nice hotel,” she suggested. She gave Megan a hug and Rhys a kiss on the cheek, then with a final wave, she and Erik left the house. The next few days passed peacefully enough. Rhys continued to drive Megan back and forth to work. He kept watch from outside while she was at Shore’s, and slept by her side until dawn. Megan hadn’t heard anything more from Shirl. In spite of everything, Megan missed her roommate. Good friends were hard to find. She wondered if they could ever be friends again now that Shirl had been turned and she was living with Villagrande. She still had a faint hope that it might be possible once Shirl learned to control her thirst. After all, Megan thought, who was she to judge Shirl’s choice of men when she, herself, had a vampire lover? As far as Megan knew, Rhys hadn’t heard from Villagrande. She couldn’t decide if that was good or bad. “Maybe he changed his mind,” Megan suggested when Rhys drove her to work on Saturday night. “No, he’s still here. He’s up to something, I just don’t know what.” Rhys drummed his fingertips on the steering wheel. Villagrande had threatened to destroy the members of the Vampire Council one by one and then come for Rhys. But he seemed to have backed off since destroying Adams. Maybe it was only a reprieve while Villagrande dallied with Shirl. Or maybe Megan was right and Villagrande had indeed had a change of heart. When they reached Shore’s, Rhys parked the car, then walked Megan across the parking lot to the back entrance. “Do you really think it’s necessary for you to stay here every night?” she asked. “I mean, it must be terribly boring, watching me all night long.” “Not at all.” He slipped his hands around her waist and kissed the tip of her nose. “I can’t think of anything else I’d rather do.” “Right.” “Time doesn’t have the same meaning for me that it does for you,” he reminded her. She supposed that was true. What were a few wasted hours when he had centuries ahead of him? He kissed her again, then opened the back door. “Send a smile my way now and then.” It was near the end of her shift when Mr. Parker poked his head out of the office, a sour expression on his face. “Phone for you.” Megan nodded. Mr. Parker was a sweetheart about most things, but the one thing he frowned on was personal calls at work, so Megan always kept her cell phone off. Mr. Parker left the office, giving Megan her privacy. “Hello?” “Megan, it’s Shirl.” “Shirl, this is a surprise. Is everything all right?” “Of course.” “So, do you still like being…” Megan paused and peered out the door to make sure no one could overhear her conversation. “A vampire.” “It’s wonderful, Meggie. I wish you’d think about it.” “Are you kidding? No way!” “Well, I’ll keep hoping. Think how much fun we could have. We could room together again.” And hunt together. Megan frowned. Had Shirl spoken those words aloud? “There’s so much to do,” Shirl was saying. “So much to see. Everything is new and exciting. Megan, you can’t believe how wonderful it is. I have so much energy, and I’m never tired, and—” “I’m glad you’re happy. Are you still with Villagrande?” “Yes, but he scares me a little. He can be really intense at times.” “Is he still planning to take over Rhys’s territory?” “I don’t know. He’s out of town right now.” “Oh? Where did he go?” “He told me but I don’t remember,” Shirl said. “He said he had some kind of vampire business to take care of. I don’t suppose you’d consider getting together tomorrow night, maybe go see a movie.” “I don’t know.” “I guess you still don’t trust me.” Megan stared into the distance. Neither one of them had family nearby and so, in good times or bad, they had always turned to each other. She remembered the fun times, the silly times, all the laughs they had shared. And the sad times, when they had comforted one another. Once, she would have trusted Shirl with her life. But now…how could she, when her roommate was so changed? “Megan?” “How can I trust you when you lied to me the other night?” Shirl was quiet for a long moment, so long that Megan wondered if she was still on the line. “I couldn’t help it,” Shirl said. “Tomás told me to.” “Do you do everything he says?” “No, but—” “I can’t talk anymore. I have to get back to work. Why don’t you call me tomorrow night?” “All right,” Shirl agreed. Megan felt a twinge of guilt when she heard the disappointment in Shirl’s voice. “I miss you, girlfriend,” Shirl said quietly. “I miss you, too. Good night.” Megan hung up the receiver, then stood there, replaying the conversation in her mind, until Mr. Parker knocked on the door. “You through in here?” he asked. “Clark’s out front waiting for you.” With a nod, Megan pasted a smile on her face and went out to wait on her least favorite client. Later that night, on the way home from work, Megan told Rhys about her conversation with Shirl. “I told her to call me tomorrow night.” She looked at Rhys and shook her head. “I don’t know what to do.” “She said Villagrande’s out of town?” “Yes. Is that important?” “I don’t know. Did she say how long he’s going to be gone or where he was going?” “No. So, do you think I should see her?” Rhys pulled into the driveway and killed the engine. “What does your gut tell you?” “I don’t know. I miss my friend, but I don’t know if I trust the vampire. What should I do?” “It’s up to you.” “You don’t trust her, do you?” “Right now, I don’t trust anyone.” Megan heaved a sigh. “I think I have to see her.” Rhys nodded. He wanted to see Shirl, too. He was beginning to think bringing her across had been a mistake. “Whatever you decide, I’ll be there with you. Wait here.” As he had every night, Rhys got out of the car, his senses probing the night. Only when he was certain that Villagrande hadn’t been there did he pull into the garage. Inside the house, Megan turned on the lights, dropped down on the sofa, and kicked off her shoes. Seeing the look on her face, Rhys sat beside her. “Give me your foot.” She turned sideways on the sofa and obligingly placed her left foot in his hand. She sighed as he began to massage her ankle. “That feels wonderful.” She closed her eyes, reveling in the soothing touch of his hands. A few minutes later, he lifted her other foot. “You’re in the wrong business,” she murmured. “You should be a masseur.” “Is that right?” His hand moved up, his fingers kneading her calf. “I’ll give you an hour to stop that.” “Only an hour?” “I’m easy,” she said. “Take two.” His hand slid farther up her leg, stroking the tender flesh of her inner thigh. “Two hours should be just about right.” And so saying, he swung her into his arms and carried her swiftly up the stairs to her room. The light came on, seemingly of its own accord, as he laid her on the bed. His clothing disappeared as if by magic, and then he stretched out beside her, his hands and lips teasing, touching, tasting, as he undressed her. She clung to him, every nerve humming with anticipation, her heart beating in time with his, her hands restless as she caressed him in return. “Open to me, Megan.” His voice washed over her, softly entreating. He was asking for more than her physical surrender. Wanting to please him, she lowered every inhibition, letting their minds merge so that each caress was shared. She knew his thoughts, sensed his pleasure when she rained kisses on his cheeks, his neck, his chest. She experienced his desire, so different from her own, and yet the perfect complement to hers. She writhed beneath him, lost in his touch, yearning for more, more. She cried his name as he rose over her, his eyes dark, glowing with need, with a craving she would never understand or share. “Let me.” His voice was ragged with longing, with a need she couldn’t begin to imagine. And because she loved him, because she wanted to please him, she turned her head to the side, giving him access to her throat. She moaned softly when he bit her, the faint sting swallowed up in the sensual pleasure that exploded through her as his body melded with hers. The sheer wonder of it was almost more than she could bear as she experienced his climax as well as her own.","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-37.html","bookId":2304,"book":{"id":2304,"title":"Everlasting Desire (Everlasting #2)","description":"Storyline: Everlasting Desire (Everlasting #2) Desire Burns Forever The clientele at Shore\u0027s clothing store includes some of L.A.\u0027s sexiest bachelors. But none of them affects Megan DeLacey as deeply as the dark-eyed stranger who strides into her boutique one evening - and keeps returning, night after night. Megan is drawn to Rhys Costain even as she fears him. Because his reason for being there is clear - he wants Megan, with an intensity that\u0027s both tempting and terrifying. For almost five centuries, Rhys has lived alone, using women as it pleased him and never wanting more. As Master of the West Coast vampires, it\u0027s his duty to eliminate the ancient vampire who\u0027s draining humans on his turf, putting all of their kind at risk. But Megan\u0027s lush beauty and vibrant warmth is blinding him to a danger that will soon engulf them both - and tear him from the only woman who can satisfy his darkest hunger.","cover":"https://allnovel.net/images/everlasting-desire-everlasting-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-desire-everlasting-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:09:34 PM"}}
