{"id":94704,"no":4,"title":"Page 4","content":"\\n\\n “Uh-huh.” Taking her lightly by the forearm, Rhys guided her to a chair and gently pushed her down. “Just rest a minute. These guys aren’t going anywhere.”\\n\\n Megan took several deep breaths. Had she been alone, she would have put her head between her knees and sobbed, but she wasn’t alone. She could feel Rhys Costain watching her, knew he was just waiting for her to faint or go into hysterics like some spineless female.\\n\\n “Hey.” His voice was soft and low as he laid a gentle hand on her shoulder. “Are you sure you’re all right?”\\n\\n His voice, his touch, went through her like an electric shock. Startled, she looked up, her earlier fear momentarily forgotten. Who was this man, that he should affect her so profoundly?\\n\\n “I’m…I’m fine.” She glanced at the two hoodlums who had come in to rob the store. They were still sprawled on the floor. Were they dead? She was vaguely aware that Mr. Parker was on the phone.\\n\\n A short time later, two police officers arrived. Polite, but all business, they took her statement, then Mr. Parker’s, then Costain’s. One of the officers offered to drive Rhys to the hospital, but he refused, insisting he wasn’t badly hurt. Megan didn’t believe him. Neither did the police, but when Rhys removed his coat and shirt, there was little more than a shallow gash on his arm.\\n\\n “But there was so much blood…” Megan murmured, frowning.\\n\\n “Just a flesh wound,” Rhys said with a grin.\\n\\n When the police were satisfied that they had all the information they needed, they handcuffed the two suspects, who had regained consciousness as soon as the police finished interrogating Rhys.\\n\\n “We’ll be in touch, Mr. Parker,” one of the officers said, and then they marched the suspects out of the store.\\n\\n Mr. Parker locked the front door behind the police, then walked back to where Rhys was standing. “Mr. Costain, I don’t know how we can ever repay you.”\\n\\n “No need.”\\n\\n “Please,” Mr. Parker said, pulling his checkbook from the inside pocket of his suit coat. “I’d be happy to give you a reward.”\\n\\n “If you insist,” Rhys said. “How about a new shirt?”\\n\\n Mr. Parker blinked at him. “A new shirt? That’s all you want?”\\n\\n “That’s it.”\\n\\n Shaking his head, Mr. Parker fetched the most expensive shirt the store had to offer. Handing it to Rhys, he said, “How about a new coat? That one’s ruined.”\\n\\n Rhys shrugged. “Sure.” He didn’t really need another coat, but what the hell? It would give him an excuse to see Megan again. “I’ll stop in and look around next time I’m in the neighborhood.”\\n\\n “Very well,” Mr. Parker said. “Megan, if you’re ready, I’ll take you home.”\\n\\n “I’ll see her home,” Rhys said.\\n\\n Mr. Parker looked doubtful, but there was no arguing with Costain’s expression or the implacable tone of his voice.\\n\\n Taking Megan by the hand, Rhys lifted her to her feet. “Ready?”\\n\\n “Yes, but…”\\n\\n Before she quite knew how it happened, they were in her car, with Rhys behind the wheel.\\n\\n “I can drive,” she protested.\\n\\n “Not tonight.” He slid the key into the ignition.\\n\\n Megan frowned. She didn’t remember giving him her keys.\\n\\n After a glance in the rearview mirror, he pulled away from the curb.\\n\\n “What made you come back to the shop?” Megan asked. “And what happened to all the things you bought earlier?”\\n\\n “I dropped them off at my place.”\\n\\n “You must live close by.”\\n\\n He shrugged. “Close enough.”\\n\\n She gave him the directions to her house, then wrapped her arms around her middle, suddenly chilled. Nerves, she thought, but that was to be expected. She had just been through a traumatic experience. She and Mr. Parker could have been hurt, killed. If Rhys hadn’t come along when he did…\\n\\n She shook her head. He had been shot because of her. She couldn’t explain it, but she knew in the deepest part of her being that he had come back to the store because she had been in danger, which begged the question: how had he known?\\n\\n Rhys slid a glance in her direction. “You doing okay?”\\n\\n She nodded, but she couldn’t stop trembling. “You came back because of me, didn’t you?”\\n\\n He hesitated a moment before he said, “I was hoping to change your mind about that drink.”\\n\\n “I could sure use one.” She didn’t believe for a minute that was why he had returned to Shore’s. She was tempted to pursue the matter, but she just didn’t have the energy.\\n\\n They drove in silence for a few moments, and then she frowned. “Where are we going?”\\n\\n “You said you needed a drink. I know just the place.”\\n\\n “It’s late. I don’t think…”\\n\\n “One drink,” he said, “and I’ll take you home.”\\n\\n Looking at him, at the gleam in his fathomless dark eyes, she knew without a doubt that Rhys Costain was more dangerous than a dozen armed thugs.\\n\\n Ten minutes later, he pulled up in front of a brick building. The name BLUE MOON flashed in turquoise neon above the entrance.\\n\\n Rhys came around the front of the car and opened the door for her. She hesitated when he offered her his hand, reluctant to touch him without knowing why. When he continued to stand there, his arm outstretched, she heaved a sigh, then placed her hand in his. His fingers were cool as they closed over her own.\\n\\n He handed her out of the car, then stripped off his ruined coat and bloody shirt and dropped them into the gutter. Opening the Camry’s rear door, he pulled out the shirt Mr. Parker had given him. After removing it from the wrapper, he shook it out and slipped it on.\\n\\n “Nice,” he said, running his hand over the navy blue silk. He gestured toward the club. “Shall we?”\\n\\n Megan gestured at the gutter. “What about your clothes?”\\n\\n “I’ll have someone from the club dispose of them.”\\n\\n “Oh.”\\n\\n “Shall we?”\\n\\n Still somewhat dazed, Megan nodded.\\n\\n The Blue Moon was a small club that catered to jazz enthusiasts. Old black-and-white photos of famous, and not-so-famous, musicians lined the walls, interspersed with pages of sheet music autographed by singers and songwriters.\\n\\n Rhys guided Megan to a vacant booth and slid in beside her. He could sense the tension rolling off her in waves. A part of it was due to the incident at Shore’s, but Rhys knew his presence caused the majority of her nervousness. She was afraid of him without knowing why.\\n\\n He smiled inwardly. He knew why. Some mortals were sensitive to the presence of his kind. On some instinctive level, they recognized the danger he represented. Most dismissed it, overwhelmed by his vampire glamour.\\n\\n He ordered a bottle of vintage red wine, then settled back against the seat. His gaze trapped hers as, ever so gently, he whispered peace to her mind, his words easing away some of the tension that gripped her.\\n\\n When she relaxed, he said, “So, tell me about yourself.”\\n\\n “There’s nothing much to tell. I was married, but it didn’t work out….”\\n\\n “Why not?” It was a silly question. Few marriages lasted any length of time these days, but any man who let Megan get away was crazy.\\n\\n “Oh, a lot of reasons. He was too young, not really ready to settle down. I wanted a home and a family. He didn’t. He liked partying and riding motorcycles with his friends on the weekends.” She lifted one shoulder and let it fall. “It was years ago. He’s married now. They just had a baby. I guess I should have waited for him to grow up.”\\n\\n He didn’t miss the wistful note in her voice. “You never married again?”\\n\\n “No. Once was enough.”\\n\\n “Once burned, twice shy?” he asked with a rueful grin.\\n\\n “Something like that. How about you? Have you ever been married?”\\n\\n He shook his head.\\n\\n “I’m surprised.”\\n\\n “Oh? Why?”\\n\\n “You’re young, rich, handsome….” She shrugged. “It just seems like someone would have snatched you up by now.”\\n\\n “You think I’m handsome?”\\n\\n “In a dark, devilish sort of way, yes.”\\n\\n Devilish. He laughed softly. If she only knew. “Go on,” he coaxed. “Tell me more.”\\n\\n “There’s not a lot to tell. I live with a friend of mine. I work.” She shrugged. “Sounds boring, doesn’t it?”\\n\\n “If you don’t like it, change it.”\\n\\n “I didn’t say I didn’t like it. I’ve always enjoyed my job and the people. At least until tonight.”\\n\\n “The friend you live with…?” He waited, jaw clenched, afraid of what he might do if her roommate was a man. Just because she hadn’t married again didn’t mean she wasn’t involved.\\n\\n “Shirley. We’ve been friends since college. She’s a high fashion model, very pretty. You’d like her.”\\n\\n “I like you.”\\n\\n The words, the tone of his voice, the sultry look in his eyes, sent a shiver down her spine. She took a sip of her wine, hoping it would calm her. His thigh brushed against hers, but it was more than his nearness that unsettled her.\\n\\n She eased her leg away from his. “What about you? What do you do for a living?”\\n\\n A smile flitted across his face before he said, “I own a little nightclub on the other side of town.”\\n\\n “Oh? What’s it called? Maybe I’ve been there.”\\n\\n He laughed softly. “I doubt it.”\\n\\n “Why? What kind of club is it?”\\n\\n “It’s a Goth hangout.”\\n\\n “Goth?” she asked, frowning. “You mean those weird people who dress all in black and pretend to be vampires, that kind of thing?”\\n\\n “Exactly.”\\n\\n “Are they into the blood thing?”\\n\\n “Some of them are.”\\n\\n “Shirl dated a guy who was a Goth a year or so ago. She was really into that kind of thing for a while. You know, the whole vampire mythology, but I can tell you, she broke it off with him pretty darn quick when he said he wanted to drink her blood.” Megan grimaced. “I’m not sure vampires really exist. I mean, I’ve never met one. Have you?” \\n\\n","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-4.html","bookId":2304,"book":{"id":2304,"title":"Everlasting Desire (Everlasting #2)","description":"Storyline: Everlasting Desire (Everlasting #2) \\n Desire Burns Forever \\n The clientele at Shore\u0027s clothing store includes some of L.A.\u0027s sexiest bachelors. But none of them affects Megan DeLacey as deeply as the dark-eyed stranger who strides into her boutique one evening - and keeps returning, night after night. Megan is drawn to Rhys Costain even as she fears him. Because his reason for being there is clear - he wants Megan, with an intensity that\u0027s both tempting and terrifying. \\n For almost five centuries, Rhys has lived alone, using women as it pleased him and never wanting more. As Master of the West Coast vampires, it\u0027s his duty to eliminate the ancient vampire who\u0027s draining humans on his turf, putting all of their kind at risk. But Megan\u0027s lush beauty and vibrant warmth is blinding him to a danger that will soon engulf them both - and tear him from the only woman who can satisfy his darkest hunger.\\n","cover":"https://allnovel.net/images/everlasting-desire-everlasting-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-desire-everlasting-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:09:34 PM"}}
