{"id":94754,"no":54,"title":"Page 54","content":"She licked her lips, remembering how enjoyable it had been to feed off the dark-haired man, amazed by how natural it had seemed, how good he had tasted. She should have been repulsed by what she had done; instead, she was eager to go out and do it again. What if she went to visit her parents and all she wanted to do was snack on them? What would they think when they saw her, when they knew what she was? Would they be horrified? Or overcome with guilt for agreeing to let Rhys turn her into a monster? But she didn’t feel like a monster. She felt the same as always, only better. What was she going to do about Rhys? He had asked her to marry him, but she had been mortal at the time. Was his proposal still valid now that she was dead? Not dead. Undead. She blew out an impatient sigh. Whatever she was, she felt more vital and alive than ever before. Stronger mentally and physically. More sure of herself. She lifted a hand to her face. Did she look the same? Shirl had looked the same, and yet not. Her hair had been more lustrous, her eyes more intense, her skin almost luminous. None of the changes had been blatant, but they had been there. Just her luck, Megan thought ruefully. She probably looked better than she ever had but, being a vampire, she would never be able to see for herself. Filled with a sudden nervous energy, she dived into a frenzy of housework, vacuuming the rugs, changing the sheets on her bed. Moving into the kitchen, she stared at the refrigerator for a moment and then, taking a deep breath, she opened the door. Megan had expected to find a gallon of sour milk and a crisper filled with spoiled produce; instead, the refrigerator was empty. That was odd, she thought, then realized that while she had been in a coma, her parents had probably stayed here. Her mother must have cleaned out the fridge and watered the plants. Murmuring, “Oh, Mom,” she sat on one of the kitchen chairs and burst into tears. How was she ever going to face her parents? How could she ever trust herself to be with them? What if she went to see them and they were repulsed by what she was, or, worse, afraid of her? But they hadn’t been afraid of Rhys, not if what he said was true. Her sobs came harder, faster. She cried for her lost humanity, for the children she would never have, the suntan she wouldn’t get next summer, all the chocolates she would never eat. She grabbed a towel and wiped her face, stared at the faint streaks of red on the towel, then, with her finger, she wiped a tear from her eye. It was red. But of course it was. She was a vampire now. Fighting a rush of hysteria, she went to the sink and splashed cold water on her face. So, she was a vampire. Time to stop feeling sorry for herself and look on the bright side. She would never get sick. She would never have to worry about getting old and wrinkled and helpless. But even that had its drawbacks. All the people she knew would age and die—her parents, Mr. Parker, Drexel, all of her other clients. Sooner or later, they would all be gone. All but Rhys… He loved her. She loved him. He was a vampire. She was a vampire. There was no reason for them to be apart now. Whatever danger she might have faced as his mortal companion no longer existed. She sat there, thinking about her future, until a rather unpleasant tingle skittered down her spine. She knew instinctively that it was almost dawn. She checked all the doors and windows to make sure they were locked, closed the curtains in her bedroom, then changed into her nightgown and climbed into bed, her heart pounding. Lying on her back, she stared up at the ceiling. What would it be like when she was compelled to sleep during the day? Was it like death? A cold knot of fear formed in the pit of her stomach. What if she didn’t wake up again? Megan, close your eyes and relax. The sound of Rhys’s voice calmed her immediately. His thoughtfulness made her love him all the more. In spite of everything, he hadn’t left her to face her first day as a vampire alone. Megan came awake as the sun went down. For a moment, she lingered under the covers. The Dark Sleep really was like death, she thought. Judging from the unrumpled blankets on her bed, she hadn’t moved at all once she closed her eyes. Nor had she dreamed. Throwing the covers aside, she went into the bathroom to shower. Emerging some fifteen minutes later, she pulled on her bathrobe, then sat on the edge of the bed. What did vampires do to pass the time? Feeling at loose ends, she found her cell phone, took a deep breath, and called her parents. As soon as she heard her mother’s voice, she knew everything would be all right. Vampire or not, her parents loved her. Nothing would change that. She talked to her mom and then her dad, and then her mom again. After assuring her mother that she was fine and promising to see them soon, Megan ended the call, had another good cry, and went out to try hunting solo. At eleven thirty, Megan stood in front of her closet, her foot tapping impatiently as she went through her clothes. Nothing suited her mood. And then, on impulse, she reached into the back and pulled out a dress she had bought on a whim but never worn. Removing the plastic, she held it up. It was perfect. A pair of three-inch black heels and her grandmother’s antique pearl necklace completed the outfit. “You can’t go wrong with basic black and pearls,” she muttered, and left the house. She arrived at the address Rhys had given her ten minutes late, on purpose. It was a small act of defiance, but it made her feel better. The house was small, the wood siding weathered and gray. A white picket fence surrounded the yard. Lights glowed from behind the curtains in the front window. The scent of sea and sand was strong, accented by the sound of waves endlessly rushing to the shore. An inhaled breath told her Rhys was inside the house, and that he wasn’t alone. Gathering her courage, she stepped through the gate and walked along the crushed shell path to the front door. It opened before she knocked, and Rhys stood there, his dark blond hair gleaming in the lamplight. Taking a step back, he said, “Come in.” She followed him into the living room. Two black leather sofas faced each other in the middle of the room. There was no other furniture. A tall man with wispy gray hair and blue eyes stood next to the fireplace. A man who appeared to be in his twenties slouched on one of the sofas, regarding her through slitted brown eyes. A red-and-black snake tattoo adorned his left arm. A third man, with black, slicked-back hair and a thin mustache, reminded her of an old-time matinee idol. He sat on the other sofa, his ankles crossed, a faint smile on his handsome face. Rhys gestured at the gray-haired man. “Megan, this is Nicholas. The man who looks like Valentino is Rupert…” “And I’m Julius.” The tattooed man eyed her as if she was a bowl of cream and he was a hungry cat. Rhys glared at Julius before returning his attention to Megan. “I’ve told them that you’re mine and as such, you’re under my protection, and by my law, theirs as well.” She hesitated, unsure of what to say, then murmured, “Pleased to meet you.” “My dear, the pleasure is all mine,” Nicholas said. Coming forward, he bowed over her hand. Rupert and Julius exchanged glances; then, as if pulled by the same string, they rose and offered her their hands. “Nice to have a pretty woman on the Council,” Julius remarked with a smile just short of a leer. “Yes, indeed,” Rupert agreed. Megan looked at Rhys askance. He hadn’t said anything about her being a member of the Council. Good grief, she had only been a vampire for one day. Rhys shrugged, then turned his attention to the others. “That’s all. I just wanted you to meet Megan.” “My pleasure,” Nicholas said, and vanished. “Ciao, baby,” Julius murmured, and he, too, disappeared from sight. “It was nice to meet you, Megan, my dear,” Rupert said. “I’m sure we’ll meet again soon.” Megan nodded, but before she could think of anything to say, Rupert was out the door, leaving her alone with Rhys. Suddenly nervous, she rubbed her hands up and down her arms. Why had she worn this come-and-get-me dress? Tight and black, it outlined her every curve. “You look lovely,” Rhys said quietly. “Thank you.” She cleared her throat. “I’m…I…” She looked up at him. He had always known what she was thinking, why wasn’t he reading her mind now? “The meeting is over,” he said formally. “Thank you for coming.” She stared at him, mute. If she didn’t say something, do something, she had the feeling she might never see him again. She cleared her throat. Squared her shoulders. And blurted, “You promised to marry me not long ago, Mr. Costain. Do you intend to renege on that promise?” “Megan…” “I love you.” She spoke quickly, before her courage could desert her. “And I know you love me.” He regarded her silently, one brow raised, for several moments. Megan resisted the urge to wring her hands as she waited for him to say something, anything, to break the tension between them. And then the corner of his mouth twitched. “Reading my mind, are you, Miss DeLacey?” “I believe turnabout is fair play, Mr. Costain.” “Indeed? What am I thinking now?” “Nothing I would dare repeat,” she replied with mock horror. Laughing, he pulled her body against his and kissed her, long and hard. “If you think that’s bad, just wait until I get you home.” Home, she thought, as he swept her into his embrace and kissed her again. Home wasn’t a house with a roof and four walls; it was here and now, in the arms of the man she loved. Epilogue Megan glanced over her shoulder. “How do I look?” Evelyn DeLacey blinked back a tear as her daughter pirouetted in front of her. “Beautiful,” she murmured. “Like a fairy-tale princess.” The dress looked as if it had been made for her, simple yet elegant with its fitted sleeves and square neckline edged with delicate lace. “How do you feel?” “Wonderful!” Megan exclaimed, and then, seeing the tears in her mother’s eyes, she whispered, “Mom, please don’t cry. I’m happy, truly I am.”","sourceLink":"https://allnovel.net/everlasting-desire-everlasting-2/page-54.html","bookId":2304,"book":{"id":2304,"title":"Everlasting Desire (Everlasting #2)","description":"Storyline: Everlasting Desire (Everlasting #2) Desire Burns Forever The clientele at Shore\u0027s clothing store includes some of L.A.\u0027s sexiest bachelors. But none of them affects Megan DeLacey as deeply as the dark-eyed stranger who strides into her boutique one evening - and keeps returning, night after night. Megan is drawn to Rhys Costain even as she fears him. Because his reason for being there is clear - he wants Megan, with an intensity that\u0027s both tempting and terrifying. For almost five centuries, Rhys has lived alone, using women as it pleased him and never wanting more. As Master of the West Coast vampires, it\u0027s his duty to eliminate the ancient vampire who\u0027s draining humans on his turf, putting all of their kind at risk. But Megan\u0027s lush beauty and vibrant warmth is blinding him to a danger that will soon engulf them both - and tear him from the only woman who can satisfy his darkest hunger.","cover":"https://allnovel.net/images/everlasting-desire-everlasting-2.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everlasting-desire-everlasting-2.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:09:34 PM"}}
