{"id":76410,"no":11,"title":"Page 11","content":"It took him a moment to recover from her bold action. His voice was gruff when he said, “Every mark on your body is my concern, Nicholaa. I’m responsible for you. Now tell me how you came by this injury.”\n “You’ll get surly if I do.”\n “How do you know that?”\n “I’ve been watching you,” she answered. “It’s important for one enemy to know how the other’s mind works, Baron. I’ve been studying you closely and am now convinced you have a surly nature.”\n He smiled at the authority in her voice. “And what else have you noticed?”\n “You don’t like me.”\n She waited for a contradiction. When none came, she continued. “You think I’m a nuisance.”\n “Yes, I do.”\n She took exception to that bit of honesty. “If it wasn’t a mortal sin to hate, I could become very good at hating you.”\n “No, you couldn’t,” he answered, smiling gently. The look in his eyes made her stomach quiver. “I may have an unpleasant nature, Nicholaa, but you have a very gentle one. You don’t know how to hate.”\n She was too weary to trade insults with him. “I’m going to freeze if I don’t return to the fire,” she announced. “Are you waiting for me to beg for your assistance?”\n He shook his head. “I’m waiting to hear how you came by this bruise,” he informed her.\n Lord, he was stubborn. She could tell from the look on his face that he was determined to get his way. “Justin struck me.”\n She should have softened the truth a little. Royce looked bloody furious. She didn’t want him to think ill of Justin. “You cannot blame my brother.”\n “The hell I can’t.”\n He started to stand. She grabbed his arm. “I can explain,” she said.\n “Nicholaa, you can’t justify what—”\n She put her hand over his mouth. “Justin was sound asleep, Royce. I was leaning over him to pull the covers up, and he turned. His fist caught me below the eye when he rolled to his side. Justin had no idea he struck me.”\n He didn’t look convinced.\n “I’m telling you the truth,” she muttered. “Saxon sisters and brothers don’t strike one another. Is it because the Norman families fight like devils that you find my truth difficult to believe?”\n He wasn’t going to let her bait him. He picked up his cloak, wrapped it around her, and lifted her in his arms. She wrapped her arms around his neck as he headed for the camp.\n She whispered thank you against his neck.\n What the hell was he going to do with her? he wondered.\n She was easing herself right into his heart and he didn’t have any weapons to stop her. Damn it, his life was set in a pattern, and he was too old to change. Besides, he liked the order, the discipline, of his daily routine. He was very content.\n Wasn’t he?\n Royce tried to put the contrary woman out of his thoughts. It was difficult, though, because she was so wonderfully soft and cuddly in his arms.\n She was still a nuisance. She gave him hell all the way back to camp. She was back in the mood to argue with him. He was in the mood to gag her just to gain a few minutes’ peace.\n When they finally reached the campsite, he carried her back to his spot by the tree. He sat down in one fluid motion that didn’t even jar her, adjusted her on his lap, shoved her head down against his shoulders, and then closed his eyes.\n His cloak covered her from head to foot, and his arms held her close. The heat from his body kept her nice and warm.\n “Royce?”\n “What now?”\n “I shouldn’t sleep like this,” she whispered. “I’m a married woman, after all, and I—”\n “Your husband’s dead.”\n She was surprised by the vehemence in his voice. “You can’t possibly know if my beloved husband is dead or alive.”\n “He’s dead.”\n Was he amused? She thought he might be, but when she tried to look at his face, he rudely shoved her head back on his shoulder again. “Oh, all right,” she muttered. “He’s dead. I’m still mourning him, though.”\n “You wear blue to mourn him?”\n She hadn’t thought of that. The man was a quick thinker, she realized. But then, so was she. “I’m mourning him in my heart,” she muttered.\n “How long has he been dead?”\n He was gently rubbing her shoulders. The soothing touch felt too good to protest. She let out a loud, unladylike yawn before answering. “Two years.”\n “You’re certain?”\n He was laughing at her all right. She could hear the amusement in his voice. “Yes, I’m certain,” she snapped. “’Tis the reason I’m not wearing black any longer. It’s been two years.”\n There, she’d bested him, she thought to herself. She closed her eyes. Her smile was smug.\n A long minute passed. She’d almost drifted off to sleep when he whispered her name.\n “Nicholaa?”\n “Yes?”\n “How old is Ulric?”\n “Almost eight months now.”\n He guessed she was too sleepy to see the error in her lies. She didn’t even tense against him. “But your husband’s been dead two years?”\n He couldn’t wait to see how she would try to get out of this one.\n Her eyes flew open. “My husband’s been gone just one year. Yes, exactly one full year. I specifically remember telling you so.”\n A good five minutes passed before he spoke again. “You aren’t any good at lying, either.”\n “I never lie.”\n He squeezed her to let her know he was irritated with her. “Will you concede defeat now?” he asked. “You were trying to run away.”\n “Will you let me sleep?” she asked.\n “When you admit—”\n “Yes,” she interrupted. “I was trying to run away. There, are you happy now?”\n “You will not try to escape again.”\n He didn’t have to sound so mean-hearted when he gave her that order. Nicholaa suddenly felt like crying. She had to escape. It was the only way she could protect herself against the horrible future his overlord, William, had planned for her.\n She adjusted her arms around his shoulders. Her fingers toyed absentmindedly with the hair on the back of his neck while she thought about the injustice of it all.\n Her touch was driving him to distraction.\n “Your William is determined to give me as booty to some man, isn’t he?” she said.\n “Yes.”\n She shoved away from his shoulder and glared at him. A leaf fell out of her hair. Her face was bruised and covered with dirt. He couldn’t contain his smile. Nicholaa looked as if she’d just lost a tug-of-war.\n “I’m not a prize.”\n He agreed wholeheartedly. “No, you’re not.”\n Chapter Four\n After spending one long week with Lady Nicholaa, Royce decided he wasn’t a very patient man, after all. By the time they reached their destination, he was ready to strangle her.\n The hellion had made the journey as unpleasant as possible, and damn if she didn’t try to escape three additional times.\n The woman simply refused to see the futility of running away. She was sinfully stubborn. But then, so was he. He had demanded she concede defeat to him each time he caught her. He had even said the one word—“checkmate”—that seemed to send her into a full rage, but in truth, he wasn’t trying to humiliate her. He only had her best interests at heart. If she was going to survive with her spirit intact under Norman rule, she would have to be more docile. Not everyone would be as kind and as thoughtful as he was.\n Royce didn’t want Nicholaa to be hurt. The mere thought of anyone mistreating her made his mood blacken.\n The need to protect her nagged at his conscience. He found himself lecturing her on how to behave when they reached London. Nicholaa, however, wasn’t in the mood to listen to anything he had to say. When he suggested she be docile, she bit him. He let her get away with that only because she’d had so little sleep over the past god-awful week, and she was simply too muddleheaded to think properly.\n They reached London in midafternoon. The palace was nearly empty of guests when Royce strode inside, nearly dragging Nicholaa in his wake. He ordered two soldiers to report to William that his prize had at last arrived. Royce personally saw to the task of settling Nicholaa in her chamber.\n She tried to trip him with her foot, and he really did drag her a good distance before letting her regain her balance.\n He would be glad to be rid of her. Royce kept telling himself that lie until he almost believed it.\n Almost.\n His second-in-command, a knight several years his senior, caught up with the pair just as Royce was opening the door to Nicholaa’s quarters. The soldier’s name was Lawrence. He was a fit looking man with brown hair and hazel eyes. He was nearly as tall as his liege lord, but lacked the bulk and the muscle around his shoulders. Lawrence had fought by Royce’s side in countless battles. He was a seasoned warrior, trustworthy, and loyal to his very soul. He was also Royce’s good friend.\n “’Tis good to see you again, my lord,” Lawrence said in greeting. In his enthusiasm, he slapped Royce on his shoulder. Dust flew up into the air between the two giants. Lawrence laughed. “You’re in need of a bath, Baron.”\n “Aye, I am,” Royce answered. “It’s good to be here.” He glanced down at Nicholaa, matched her frown, and then added, “At last.”\n The implication wasn’t lost on her. She knew she was the reason the journey had taken so long. Her chin came up a notch.\n Lawrence was highly curious about the woman. When he turned to her, his heart skipped a beat. Lord, she was a beauty. Her eyes captivated him. They were the most unusual shade of blue he’d ever seen.\n She wasn’t timid, either. Her gaze was direct, unwavering.\n Royce was amused by his vassal’s reaction. It was as telling as Ingelram’s had been when he’d first seen Nicholaa. Lawrence looked stunned.\n “This is Lady Nicholaa,” Royce announced.\n Lawrence bowed low. “It is a pleasure to meet you, milady.”\n She curtsied in response to his politeness.\n “I look forward to hearing about your adventures,” Lawrence said.\n “What adventures?” she asked.\n “For one, I would like to hear how you came by all those bruises. You do look as though you’d been in battle,” he added with a gentle smile. “Surely there’s a story there.”\n “She’s prone to accidents,” Royce drawled.\n She let Royce see her frown. Then she turned back to Lawrence. “I won’t be in London long enough to tell you any stories.”\n She remembered Royce still had hold of her wrist when he started squeezing it. Lawrence noticed the frown on his baron’s face, but couldn’t understand the reason behind it. “Are you going somewhere soon, milady?” he inquired.\n “No,” Royce said.\n “Yes,” she said at the very same instant.\n Lawrence grinned. “There’s a rumor, Baron, that we will be leaving for Normandy before the week is out.”\n “We’ll discuss that later,” Royce announced with a meaningful glance at Nicholaa.\n The vassal nodded. He noticed that a stricken look had come over the beautiful woman’s face and decided she must be exhausted from her journey. “The king will send servants to see to your comforts, Lady Nicholaa,” he announced.\n “And soldiers to see that I don’t escape?” she asked.\n Lawrence was taken aback by the vehemence in her voice. “You’re not a prisoner,” he announced. He gave Royce a look of puzzlement. “Is she, Baron?”\n Royce nodded. “She is until she accepts her fate,” he announced.\n “William is your king, too,” Lawrence said to Nicholaa. His voice was gentle.\n “No, he isn’t.”\n “Lawrence, it won’t do you any good to argue with her.”\n Royce let go of Nicholaa’s wrist and gave her a nudge to get her moving. She walked into the chamber, Royce and Lawrence following close behind her. “I will escape,” she boasted.\n She went directly to the window. Royce knew what was going through her mind. “You’ll break your neck if you try to jump, Nicholaa.”\n She turned around and smiled at him. “And would you care, Baron?”\n He didn’t give her a direct answer. “Your Ulric will care when he’s old enough to understand. Consider him and Justin, too, Nicholaa, whenever you contemplate doing something foolish. You’ll be harming your family as well as yourself.” He started to pull the door closed.\n “Wait,” she called out, a frantic edge in her voice.\n Royce stopped and turned to face her. “Yes?”\n She took a step toward him. “Is that it, then? You’re leaving?”\n “Was there something more you wanted?”\n “No.”\n He started to leave again.\n “Is that all you can say to me?” she demanded.\n He stopped again and let out a loud sigh. “What more do you want me to say?”\n Her eyes filled with tears, and she started wringing her hands.\n He couldn’t understand what had come over her. “What in God’s name is the matter with you?” he asked, thoroughly confused by her manner.\n She shook her head. “Nothing. Nothing’s the matter with me. I’m well rid of you, Baron. You’re. rude and insufferable.” A tear slipped down her cheek. She wiped it away with the back of her hand.\n Hell, she acted as though he was deserting her, and heaven help him, he felt as though he was. “I’m not leaving for Normandy,” he said then. “If you need me, send one of the soldiers with a message. He’ll find me.”\n Her relief was visible. The panic eased from her expression, and her stance relaxed. She couldn’t seem to control her tears, though, and she turned her back on him so that he wouldn’t witness her disgrace. “I won’t be sending anyone to fetch you, Norman. Leave. I don’t care.”\n He couldn’t leave her like this. She looked so alone, so miserable . . . and so vulnerable. Damn it all, for some reason he wanted to see her strong and angry at him as she’d been on their journey.\n “Baron?” Lawrence asked when his lord continued to stand there for such a long time without saying a word. \n","sourceLink":"https://allnovel.net/the-prize/page-11.html","bookId":1840,"book":{"id":1840,"title":"The Prize","description":"Storyline: \n In the resplendence of William the Conqueror\u0027s London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride. \n In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa revelled in their precious new love ... a fervent bond soon to be disrupted by the call of blood, kin and country!\n \n","cover":"https://allnovel.net/images/the-prize.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-prize.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:38:04 AM"}}
