{"id":76413,"no":14,"title":"Page 14","content":"Nicholaa realized she could defy the king then and there.\n And what would become of Ulric?\n She bowed her head.\n William chuckled. “You’ve shown great courage,” he announced in a near shout so everyone would be sure to hear his praise. “I had thought to allow my knights to compete for your hand in marriage, but now I’ve changed my mind. You will have the choice.”\n Her head came up with a start. The king smiled at the surprise he’d given her. “Yes, you shall choose your husband,” he said. “Turn and take their measure, my dear. They are now the prizes, Lady Nicholaa. All are worthy soldiers. Prod each one if you wish; question each, too. If it takes you the rest of the night to make your decision, so be it. We’ll wait. The marriage will take place as soon as you’ve made your choice.”\n Baron Guy let out a hoot of laughter. He adjusted his red tunic and took a step forward. One of his vassals nudged him in the ribs and gave him a knowing grin.\n There wasn’t any doubt in Guy’s mind that she would choose him. He didn’t believe he was being the least bit conceited in that judgment, either. He recognized his value. He was a handsome man, perhaps the most handsome baron in William’s army. Women tripped all over their hems just to get near him. And why not? He had thick blond hair, perfect hazel eyes, white teeth, and a commanding nature. He was also tall, reed thin, and possessed the physical endurance of three ordinary men put together. What more could any woman want?\n Yes, she would choose him. He just needed to get her attention. Then he’d smile at her, and she would be his for the plucking.\n As soon as Lady Nicholaa turned and started through the crowd, Guy moved to one side and barred her path. He smiled. She stopped, turned her gaze up to look into his eyes, and smiled back.\n And then she skirted her way around him and continued on.\n He couldn’t believe she’d rejected him. He reached out to touch her arm. Nicholaa shrugged it away.\n Guy could feel his face turning red with embarrassment. His hands became fists at his side, and it took all the restraint he had not to grab her shoulders and demand she choose him. With an effort, he forced himself to feign indifference.\n Guy’s two favored vassals, Morgan and Henry, moved to flank their baron. Not even trying to hide their anger, they openly scowled at Nicholaa’s back.\n Nicholaa had no idea of the fury she’d caused. Her attention was solely directed on one man. Royce. He was leaning against the far wall, looking very bored, almost sleepy.\n But he was staring at her.\n The closer she got, the more worried he looked. She tried not to smile.\n She could feel the tension in the hall. Most of it, she thought, came from Royce. None of the barons could possibly like this turn of the tables, for one of them had just become the coveted prize, the possession.\n She really should have felt a little compassion for the knights. She didn’t, though. She was too busy gloating.\n Lord, it was a fine moment.\n Nicholaa continued to move through the crowd until she reached Royce. When she was just a foot away from him, she stopped. She didn’t say a word, just looked up at him for the longest while.\n He couldn’t believe she was standing there. He shook his head.\n She nodded. “Royce?” She said his name in a whisper, but he heard it all the same.\n “Yes, Nicholaa?”\n Her smile captivated him. She motioned for him to come closer. And then she stretched up on tiptoes and whispered into his ear.\n “Checkmate.”\n Chapter Five\n They were married a scant half hour later.\n Both the bride and the groom acted like the guests of honor at a human sacrifice. Theirs.\n Nicholaa refused to look up at Royce. She knew he had to be furious.\n He kept his gaze directed at the top of her head throughout the brief ceremony. He thought she’d lost her mind.\n The queen was the only one who looked thoroughly pleased. She kept dabbing at the corners of her eyes while the bishop recited the ritual. It was an unusual display of emotion, for Matilda wasn’t one to let her feelings be known to anyone but her husband.\n After the promises were given, Royce bent down to kiss his bride. Nicholaa didn’t have time to get ready. His mouth was there and gone before she could even react.\n The married couples and their children had been allowed back inside the hall to watch the ceremony. They surged forward now to offer their congratulations. Men nodded to Nicholaa while their wives, unable to grasp her hands because of the bandages, gently patted her shoulder and offered her their best wishes for a happy future.\n The crowd suddenly moved back again, as though an unspoken command had been given and everyone but Nicholaa had heard it. She glanced up to judge Royce’s reaction to this oddity. He ignored her and kept his gaze directed on the crowd. She peeked around her husband to look at the vassal standing next to him. She remembered that his name was Lawrence. He was Royce’s second-in-command and had been the first knight to greet them when they’d arrived in London.\n Lawrence noticed she was staring at him. He winked at her. She blushed, then smiled back. She would have spoken to him if Royce hadn’t taken hold of her arm and pulled her back.\n Her attention turned to the crowd again. One of Royce’s vassals came forward. Nicholaa was astonished when he knelt in front of her, placed his hand over his heart, and vowed his loyalty. To her.\n And then another and another came forward to kneel in front of her. After each man had given his pledge, Royce nodded.\n She felt humbled and confused by their promises. Had they forgotten she was Saxon? They must have, she decided, or they wouldn’t have vowed to give up their lives just to keep her safe.\n Royce never looked at Nicholaa while his vassals took turns coming forward. He knew she was nervous, though. She kept edging closer and closer to him until she’d squeezed herself up tight against his side.\n The king watched from the platform. When the last of Royce’s vassals had given his pledge, William came lumbering down the steps.\n The king whacked Royce on the shoulder, then reached out and hauled Nicholaa into his arms. He gave her a fierce embrace before nudging her back to Royce. She was just getting over that surprise when the king patted her shoulder. The affectionate gesture nearly felled her.\n Royce caught her. He pulled her back into his side, put his arm around her shoulders, and anchored her.\n “I’m very pleased with this marriage,” the king announced. “You’ve chosen well, Lady Nicholaa.” He paused to give a dramatic eyebrow-lifting nod. “My dear wife was correct, as always. She told me you’d choose my most favored baron. Aye, sweet Matilda made just that prediction.”\n Nicholaa couldn’t stop herself from smiling. It was amusing to see such a fierce giant of a man acting so love-struck by his tiny wife. Heartwarming, too. It was apparent they were very much in love. In these advanced times, when the heart’s preference was placed on the bottom of everyone’s list of priorities in choosing a mate, it seemed a true miracle that William actually loved Matilda and that she returned those tender feelings.\n It made Nicholaa like the couple all the more. The bond of respect and trust between husband and wife reminded Nicholaa of her own parents.\n Heavens, what was the matter with her? She wasn’t supposed to like the king and his wife. It was disloyal, wasn’t it?\n But disloyal to whom? The Saxon king had been dead nearly three months now. The Normans were firmly entrenched, and there didn’t seem to be any faction strong enough to challenge them. It was such a confusion to her. She needed time to sort it all out.\n A voice from the crowd caught her attention. “Perhaps Lady Nicholaa made that choice because Royce was the only knight she knew. Had you sent me to fetch her, she surely would have chosen me.”\n It was the man who’d tried to block her path when she walked through the crowd to Royce. Nicholaa watched him walk forward as he made that outrageous boast, his stride every bit as arrogant as his remark. He was smiling, but Nicholaa didn’t think it was a sincere smile. His eyes looked as cold as frost.\n She didn’t like him.\n Two vassals had moved to flank the boastful knight. Nicholaa didn’t look up at their faces until she was formally introduced.\n “Nicholaa,” Royce said, “may I present Baron Guy and his vassals, Morgan and Henry.”\n Baron Guy made a low bow; his vassals rudely stood tall. Nicholaa inclined her head to Guy, then turned to look at his vassals.\n She wished she hadn’t bothered. The anger she saw on their faces almost took her breath away. Their disapproval bordered on hatred.\n Instantly she knew they both had black hearts, and just as quickly she realized the absurdity of such a fast judgment. She didn’t even know them. She still edged a little closer to Royce’s side, but she couldn’t seem to stop herself from shivering.\n They were only men, she told herself. Ugly men at that. The one called Morgan had dark brown hair and hazel eyes. He was identical in size to the one named Henry, though Henry’s hair was much lighter and his eyes were brown. The ugliness was a result of their scowls, Nicholaa decided, and their thoughts.\n Did they hate her because she was Saxon or because she hadn’t chosen their liege lord? Nicholaa decided it didn’t matter. They were damned rude, and if that wasn’t offensive, she didn’t know what was.\n King William whacked Royce’s shoulder again. “What say you to Baron Guy’s boast? Do you think Nicholaa would have chosen him over you if he’d been the one to escort her to London?”\n Royce shrugged. Nicholaa wanted to nudge him in his ribs. Did he have to act so bored? She stepped on his foot instead.\n “Perhaps,” Royce allowed.\n “My friend has such good fortune,” Guy interjected. His gaze returned to Nicholaa. “And now you, dear lady, will forever be denied the joy of having me for your mate.” He paused to sigh. “’Tis a pity.”\n Morgan and Henry snickered in unison.\n Why was Guy mocking her and Royce? Nicholaa was certain that’s exactly what he was doing, but she didn’t understand his reason. She looked up to judge Royce’s reaction. Her husband’s expression didn’t tell her anything, though.\n “Do you wish us well, Guy?” Royce asked in a voice as mild as a summer breeze.\n Guy took a long time answering. The atmosphere turned brittle with tension. What in God’s name was going on? It was as though a game was in play and Nicholaa was the only one who wasn’t taking part. Her stomach turned queasy, and she suddenly felt threatened.\n Then Royce tightened his hold on her shoulders and gave her a quick squeeze. Her fear vanished. She didn’t know what to make of that reaction, either.\n The Normans were making her daft.\n Guy still hadn’t answered Royce’s question. Several vassals moved forward, obviously intent on listening to the conversation. Lawrence took a step forward.\n She certainly liked this vassal. Lawrence wasn’t hiding his feelings or trying to play this strange game. His scowl was as fierce as a bear’s bite. He was properly furious on his baron’s behalf. At least he understood the insults Guy was tossing around, even if Royce didn’t.\n “Of course I wish you well,” Guy finally answered. “I’m just surprised,” he added with a shrug.\n “Why?” Lawrence asked. He folded his arms across his chest and waited for an answer.\n “Yes, why?” Nicholaa asked.\n Morgan and Henry both moved forward. Nicholaa thought the two vassals were trying to show their loyalty to their baron and intimidate Lawrence at the same time.\n Still Royce showed no outward reaction to the tension surrounding him.\n “I was surprised you chose Royce because of his appearance,” Guy explained. “’Tis a fact that his scar offends most women.”\n Morgan immediately nodded agreement. Henry was the least subtle of the lot. He grinned.\n Nicholaa shrugged Royce’s arm away from her shoulder and took a step forward. “Are you referring to the handsome mark of valor upon his cheek, Baron?”\n Her voice shook his anger. Guy couldn’t hide his surprise. The Saxon wench was a spirited woman. That added to her appeal, as did her eyes, which had turned a deep violet. Guy found her quite arousing. Damn but he wanted her.\n “Mark of valor?” he repeated. “What an unusual way of looking at the imperfection.”\n “Boys have perfection,” Nicholaa answered. “I chose a man.”\n That barb hit deep. Guy’s face turned pink with embarrassment. Nicholaa would have let the matter drop then and there if the baron hadn’t enraged her with his next remark: “Everyone knows you would have been happier with me.”\n That did it. His superior attitude might not have offended Royce, but it damn well offended her.\n Matilda chose that moment to interfere. “Nicholaa,” she began, “you have no way of knowing what this is all about, and so I shall explain Guy’s peculiar behavior. He’s a very competitive man, my dear. He doesn’t take defeat lightly. Yet each time he faces Royce in games of strength, Guy comes in second best.”\n Matilda’s voice held a note of censure. Guy bowed his head and tried to look amused instead of furious.\n Nicholaa now had her weapon. She knew she’d probably burn in purgatory an extra day or two for the sin she was about to commit, but she couldn’t be bothered with that worry now.\n “It was kind of you to explain,” she said. “But I already knew Royce is considered the best warrior in your army.”\n “How would you have come by that knowledge?” Matilda asked.\n “Oh, I’d heard about Royce a long time ago,” Nicholaa lied. “My brother’s soldiers would whisper about him. He’d become a legend. His feats were recounted over and over again. Royce was their most feared adversary.”\n Nicholaa turned and gave Guy a sympathetic smile. “Odd, but I never heard your name whispered, Baron.”\n King William laughed. “There you are, Guy,” he announced. “You have your answer. She would have chosen Royce even if you’d gone to fetch her.”\n Nicholaa nodded. She smiled at Morgan, then at Henry. “Aye,” she agreed. “I wanted the best.”\n It took a supreme act of concentration for Guy to smile back. “I’ve been properly answered.”\n Someone shouted for a toast to the groom, and the tension was broken. Guy walked across the hall with Henry by his side. Morgan lingered.\n The angry vassal was intent on whispering a threat or two, but Royce wouldn’t let him. He nudged Morgan forward and away from Nicholaa, then motioned for Lawrence to stand by her side. \n","sourceLink":"https://allnovel.net/the-prize/page-14.html","bookId":1840,"book":{"id":1840,"title":"The Prize","description":"Storyline: \n In the resplendence of William the Conqueror\u0027s London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride. \n In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa revelled in their precious new love ... a fervent bond soon to be disrupted by the call of blood, kin and country!\n \n","cover":"https://allnovel.net/images/the-prize.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-prize.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:38:04 AM"}}
