{"id":76435,"no":36,"title":"Page 36","content":"“Justin’s a man, Nicholaa. He can make his own choices. Ulric can’t. I couldn’t allow him to be caught in a tug-of-war.” “But Justin’s like a child, too,” Nicholaa argued. “He isn’t,” he countered. “He’s weak now, but each day he’ll improve, in both mind and.body.” “And if Thurston comes back to get him before this improvement takes place?” “Justin won’t leave with him.” Royce didn’t add that it didn’t matter if Justin wanted to go or not. He wouldn’t allow her brother to leave until he was strong enough to survive on his own. “Has he improved since that first day?” she asked, trying to sound only mildly interested. “Yes.” “So everything’s going according to your plans?” “Yes.” She let out a loud sigh. “Then you don’t have to kick Justin anymore?” Royce smiled. His wife had finally managed to bring up the topic he knew she’d wanted to discuss. “Answer me, please,” she said. “Do you still kick Justin?” There was a noticeable sting in her voice now. Royce ignored it. “Only when I want to,” he finally answered. She tried to get off his lap. He held her tight. “You really shouldn’t have watched, you know.” “Lawrence told you, didn’t he?” She sounded indignant. “My vassal didn’t betray you, Nicholaa. It was his duty to tell me. Besides, your expression would have told me anyway.” “It was my right to watch,” she announced. “He’s my brother.” “That isn’t as important as his relationship to me.” “He’s just your brother-in-law,” she said incredulously. “He’s also my vassal,” he patiently explained. “That bond is far more important. Surely you understand that.” She didn’t understand anything anymore. Everything had been turned inside out since the Normans started running things. King William had set up a rigid power structure in which everyone in his kingdom had a specific place, a specific duty. Aye, from the lowest serfs to the highest noblemen, everyone had a place. Everyone but Nicholaa . . . or so she felt in her heart. She didn’t fit in to this new scheme of things. She was suddenly so frightened that she actually started shaking. For a long time she’d had many responsibilities, but now Royce was methodically taking those duties away from her. She’d made a vow to protect her family in any way that she could. She had once believed that Ulric and Justin needed her to keep them safe. Now Ulric was gone. Soon Justin would leave, too. When her brother completed his training, he would leave to find his own way in this difficult world. Justin didn’t need her even now, she realized. No, he needed Royce to teach him how to be strong again. No one needed her. The holding belonged to Royce, and so did the servants. They had already given her husband their complete loyalty. It was only right, she told herself, because he was the master of this castle now . . . but where did that leave her? Nicholaa couldn’t shake the bout of self-pity she seemed to be wallowing in. She let out a sigh, pushed herself off her husband’s lap, and prepared for bed. She barely noticed that Royce was undressing, too. Damn, she hated feeling sorry for herself, but she couldn’t seem to stop. She felt empty inside—guilty, too. She’d deliberately trapped Royce into this marriage. He was only making the best of his circumstances. Nicholaa was standing near the bed, dressed only in her white chemise, her mind filled with chaos, when Royce put his arms around her waist and pulled her back against him. He leaned down to nuzzle the side of her neck. “Royce, you don’t need anyone, do you?” Since they’d been talking about her brother only minutes before, he misunderstood her question. “I’m a trainer,” he answered. “I’m not supposed to need anyone.” She turned around in his arms, splaying her hands on his bare chest. “I have a confession to make to you,” she said. “Will you listen to me?” Her fingers were making circles around his nipples. He put his hands on top of hers. “If you want me to listen, you’ll have to stop that.” “This is a serious confession,” she warned him. He quit smiling. “All right. I’m listening.” She turned her gaze to his chin. She didn’t want to be distracted. “When I chose you for my husband, I was thinking only of myself. I was being very selfish. I realize that now. I didn’t care if I ruined your life.” “I would never allow anyone to ruin my life,” he countered. “But you never would have chosen me,” she rushed out. She put her hand over his mouth to stop him from interrupting her again. “You probably think I was just getting even with you for taking me to London, and in part, perhaps that was true. But there was much more to my reasons, Royce. You were so gentle with Ulric. I knew you’d be a good father when I saw how you held him and made certain he was protected. You were gentle with me, too,” she added in another rush. “I came to know you quite well by the time we reached London. You’re proud and arrogant, but also strong and patient.” She paused to gather her courage to give him the rest of her confession. Royce pulled her hand away from his mouth and kissed her palm. “Are you finished yet? I have something to say to you when you’re done.” She shook her head. “I have to say all of this, Royce, before I lose my courage.” His smile was filled with tenderness. “You have enough courage. You can afford to lose a little of it,” he told her. He was wrong, but she wasn’t going to tell him so now. “You’d already given me your word you’d look after Justin,” she said, “but that wasn’t enough for me. No, I then forced you to marry me and added Ulric and myself to your burden.” She let out a sigh. “I can’t change what I’ve done to you, but I want you to know I’m sorry I didn’t consider your feelings. I know I haven’t made your adjustment easy. I’ve fought you every step of the way. But that’s going to stop now. I’m going to be the kind of wife you want, Royce. I give you my word. We’ll live in peace and harmony together, just the way you want.” He gently brushed the hair away from her face. The tenderness in his expression brought tears to her eyes. She ached with her need to tell him she loved him. She wouldn’t give him that confession, though, no matter how much she wanted to, for her pledge would only be one more burden for him to carry around. She knew he didn’t love her, and because he was such a kind, caring man, he was sure to feel guilty over that fact. “Nicholaa, are you sorry you married me?” “Oh, no, I’m not sorry,” she answered. “You haven’t listened to a word I’ve said, have you? You’re the one who’s sorry.” “I am?” His sudden grin waylaid her concentration. She nodded, but couldn’t remember why. She was overwrought, she decided. She put her arms around her husband’s neck, drawing his full attention, then tugged on his hair to bring his head down to hers. When he complied with that command, she kissed him with all the love and passion inside her. Royce had planned to sit down with her and straighten out all of her crooked conclusions, but the minute her mouth touched his, he decided to put that discussion aside until later. He only wanted to think about kissing her back. He went a little wild when her tongue rubbed against his. He growled low in his throat to let her know how much he liked that boldness. His hands shook when he untied the ribbon holding her chemise together. He moved back just long enough to let the garment fall to the floor, then roughly pulled her up against him, his jaw clenching when he felt her soft full br**sts press against his chest. Nicholaa tore her mouth away from his and kissed a wet path down his throat. She pushed his hands away from her waist as she moved lower. Her tongue stroked a circle around first one and then the other nipple hidden beneath the mat of crisp hair covering his chest. Then she moved lower still until she’d reached his hard, flat stomach. His skin was so hot, so appealing to her. Her tongue flicked his navel. He inhaled sharply, telling her without words he liked that caress. His reaction made her want to please him even more. Royce’s knees almost buckled when Nicholaa knelt in front of him. His hands turned into fists at his sides. He knew what she was going to do, but the agony of waiting for her to touch him, to feel himself inside her soft, wet mouth was almost unbearable. And then the wait was over. Her hands stroked him until he was wild, and then her mouth closed around the tip of his arousal. Royce forgot to breathe. The growl deep in his throat turned into a low groan of surrender. He moved against her. Once. Twice. He had to stop her. Her tongue was making him crazed, and he knew if he didn’t stop her now, it would be too late. “Enough,” he commanded, his voice harsh with his need. She didn’t want to stop. He forced her to stand up, then wrapped his arms around her waist and lifted her off the floor. He was out of control now, desperate to find fulfillment, and yet he wanted Nicholaa to surrender with him. Somehow they got into bed. His mouth slanted over hers even as he was covering her body with his own. He stroked the fire of passion inside her with his tongue and his hands. His fingers thrust inside her and when he felt the moist heat there, his control completely snapped. She arched up against him. “Royce, come to me now. I don’t want to wait any longer.” He would have smiled over the demand in her voice if he’d had the strength. Nicholaa was wild now, as out of control as he was. She scraped his shoulders with her nails and moved restlessly against him. Royce rolled onto his back, taking her with him, then forced her legs apart. She straddled his thighs, but still didn’t understand what he wanted to do. She tried to get him to roll over again. “Royce!” She shouted her demand this time. He jerked her head down by pulling on her hair and sealed her protest with a long hot kiss. His thighs came up and the tip of his hard arousal brushed against her. She understood then. She pulled back and looked down into her husband’s eyes. The passion she saw there made the warm knot of longing inside her burst into flames of pleasure. “We can make love this way?” she asked in a ragged voice. He didn’t answer her. He showed her instead. He slowly eased into her. God, she was so tight, so hot. She felt so good. Royce closed his eyes in sheer ecstasy. He never wanted the feeling to end. He wouldn’t let her quicken the pace. He gripped her h*ps as he slowly penetrated her. Nicholaa’s head fell back, and she let out a moan of pleasure. Her hands gripped Royce’s upper arms. “Lean back, Nicholaa.” She did as he ordered, then cried out. She’d taken all of him inside her. Her lower back was cushioned against his thighs now. Heat surrounded her, penetrated her. “Am I hurting you? I don’t want to hurt you.” She hushed his worry by taking his mind off the matter. She shifted, just a little and liked that wonderful feeling so much that she moved again. He grunted with pleasure. He opened his eyes to find her staring down at him. Were his eyes as glazed with passion as hers were? He knew they must be. It seemed a miracle to him that such a beautiful woman would want him as much as he wanted her. She loved him. The thought cut through his haze of passion and lust. Aye, she loved him. Nicholaa could no longer ignore the pressure building inside her. She felt as if she might explode with her need to find release from this sweet torture. She wanted it all now. She wouldn’t let Royce set the pace, couldn’t stop herself from moving, ever so slowly at first, and then more forcefully until she was mindless to everything but finding release. He helped her find fulfillment. He knew just what spots to touch, to caress, to drive her beyond the brink. His fingers were as magical as the rest of him. Her whole body suddenly tightened around him. Royce couldn’t hold back any longer. He poured his seed into her with a shout of surrender. Nicholaa’s release was every bit as consuming, just as shattering. She didn’t shout; she wept. She collapsed against her husband and held him tight. She never wanted to let go. It took a long, long time for Royce to recover. He gently stroked Nicholaa’s shoulders, her back, her arms. He couldn’t stop touching her. She felt so good pressed up against him. Each time he made love to her, he was left feeling stunned by the beauty of her response to him. She never held a part of herself back from him. Royce had never experienced such bliss or felt such contentment. It was a miracle, a gift. His wife could make him feel weak and powerful at the very same time. He knew that contradiction didn’t make any sense, but neither did the fact that he was now married to such a gentle, beautiful woman. He couldn’t believe she could love him. He’d never expected such a thing could happen to him. On the day he was disfigured—Lord, was he only fifteen years old then?—he’d accepted his lot in life. The looks of revulsion on women’s faces as they openly stared at him . . . yes, he’d learned to accept. But Nicholaa loved him. “Royce?” “Yes?” “Was it . . . all right?” Her voice was hesitant, filled with embarrassment. “What I did?” He knew what she was talking about of course. “Oh, yes, it was all right,” he answered. “What made you—” “I wanted to,” she interrupted. A long minute passed before Royce spoke again. “Nicholaa, did you make love that way because you were trying to be the kind of wife you thought I wanted, or did you take me into your mouth because you wanted to?” She was thankful he couldn’t see her face. She was burning with embarrassment. “I already told you I wanted to,” she whispered into the darkness. “And you said you liked it. My, I’m tired. I believe I’ll go to sleep now.” He wrapped his arms around her to keep her warm. He took the hint, of course, that Nicholaa didn’t want to discuss the intimacy. She fell asleep minutes later. Royce stayed awake much longer. What an innocent charmer his wife was. He recounted her confession over and over again in his mind. She really believed she’d forced him to marry her. Something else was bothering her, too. Something in the way she’d spoken told him she was harboring another worry or two. Nicholaa had looked so vulnerable, he remembered, and there had been a desperate edge in her voice.","sourceLink":"https://allnovel.net/the-prize/page-36.html","bookId":1840,"book":{"id":1840,"title":"The Prize","description":"Storyline: In the resplendence of William the Conqueror\u0027s London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride. In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa revelled in their precious new love ... a fervent bond soon to be disrupted by the call of blood, kin and country!","cover":"https://allnovel.net/images/the-prize.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-prize.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:38:04 AM"}}
