{"id":111306,"no":25,"title":"Page 25","content":"\n Until it came again, and scolded me. “I did not raise you to be ignorant, or a coward, and you have conducted yourself as a clever and resourceful woman. Since we were parted, you have made me and your father very proud of you.”\n I lifted my head and searched for a Harry-like presence, but no spirit appeared. “Mum?”\n “I don’t trifle with the passages between worlds as my father does,” my mother said. “I am quite content here. Or I was, until this moment.”\n It had to be my mother; no one else could make me feel such guilt. “But you’re dead.”\n “There is the death of the body, which comes to every person in the mortal world,” my mother said primly. “It cannot be stopped or avoided; it must be accepted as inevitable. But that which animates us, that which is the essence of us; that never truly dies.” A comforting warmth welled up inside me, as if I were being hugged all over. “This is not your time to leave this world, my dear. Or his.”\n “But he’s dead, too.” I should know, I’d murdered him. “Mum, I don’t think I can go on without him.”\n “You won’t have to now, Charmian.” Something tugged at me, pushing me through the darkness. “You must return now, and put things to rights. When you wake, you will know what is to be done.”\n I felt the warmth receding. “Don’t leave me, Mum.”\n In my mind she whispered, We’ll be reunited someday, my darling. When it’s your time, your father and I will be waiting for you.\n As my eyes cleared so did the darkness, and I found myself looking across my desk at Lady Diana Walsh.\n Chapter Thirteen\n “Are you unwell, Miss Kittredge?” Lady Diana asked, taking a lacy handkerchief from her reticule and touching it to the dark circles under her pretty eyes. “Is that why you refuse to help me?”\n “I’m not sick, milady.” The burning sensation in my stomach had vanished. So had all my aches and pains and the soot blackening my skin. My mind began to reel as I glanced down at the little calendar I kept on my desk and saw the date. The date that was a fortnight past. The day I’d met Lady Diana Walsh for the first time.\n Time. Harry had said something about it. It took a moment before I remembered what it was.\n You’ve turned time on its head.\n “The attacks on your person are not the result of a spell, nor are the words cut into your flesh actual wounds,” I told Lady Diana. “You are the victim of cruelty and contempt, not magic.”\n “How could you—?” She stopped and rose to her feet. “I should have known better than to come here. Good day, Miss Kittredge.”\n “Proof. Of course, you’ll want that before you believe me.” I took a flask from my drawer, went round the desk, seized one of her wrists, and pulled off the glove. “Here, hold still.” As I poured the brandy over her hand she uttered a shrill sound that I ignored as I picked at the edge of the letter S in SLUT, lifting the dried wound paste just enough to peel it off. “You see? Just as I said. The brandy acts as a solvent, but don’t yank at it too hard, or it will still tear your skin.”\n Lady Walsh stopped protesting and stared. “How in the world . . . ?” She went to work and in a few seconds had carefully peeled all the paste off her unmarked flesh. Her wide eyes shifted to my face. “You knew how this was done to me? Without ever meeting me? Who—?”\n “I’m afraid this time I do have an urgent appointment across town,” I told her as I reached for my walking cloak. “Perhaps we could meet later, at your home?”\n “You are not invited to my home. Nor can you tell me such things and then walk out.” Her voice grew shrill. “I must know who did this to me.”\n “In a few hours, you will. Or we’ll all be dead. I’m not quite sure how it will go.” Once I fastened my cloak I grabbed my keylace from the wall hook. “Oh, and you should know that the only reason your husband married you was to get another heir. Your stepson is diseased and barren. Good day, milady.”\n I ran past her footman for the stairs, praying that my assumptions about my own circumstances were just as correct. Puzzling that out made me forget about Fourth, who intercepted me on the stairs halfway to the first floor landing.\n “Good morning, Mr. Gremley.” Hoping to squeeze past him I moved to one side, but he did the same. “I do beg your pardon, but I’m in something of a hurry.”\n The clerk bent from the waist in one of his overdone bows. “Miss Kittredge, I’d hoped to—”\n “—run into me today,” I finished for him. “I regret to say that I cannot be your escort to the opening of the opera on Thursday next, excuse me, Friday next, as I will be away on business. Mr. Skolnik’s unmarried daughter, Maritza, will make a fine substitute. She speaks no English, so your dear mother will be unable to grill her.”\n By this point Fourth’s nonexistent chin had dropped to his reedy chest. “Miss Kittredge, you have anticipated my every thought. How in heaven’s name—?”\n “It’s magic. I was wrong. It does exist.” I patted his shoulder. “Must fly. Do enjoy the opera.”\n He didn’t try to stop me as I darted round him and made it to the basement access door on the first-floor landing.\n “Docket.” My voice couldn’t be heard above the clanking and hammering, but as soon as I spotted the bottom half of him sticking out from a familiar cabinet I didn’t bother to shout again. I did rap my knuckles on the side of the HangItAll to get his attention.\n “What the devil is it now?” Docket emerged, his face shiny with sweat and patches of black grease. “Oh, Kit, fabulous. I’m just putting the finishing touches on—”\n “—the HangItAll. Problem is that the boiler steam will soak all the garments you put in it, so best you call it the WashItAll.” I paused to catch my breath. “Docket, I need to borrow your carri for a few hours.”\n “WashItAll. That might work.” As he looked at me, his grin turned upside down. “Sorry, my dear, but the carri’s done for. Took it apart last week to repair the boiler.” He squinted at me. “What’s the matter? You look white as a wedding frock.”\n Without a carri I’d never get there. “I have to go.” Wouldn’t be the first time I’d stolen one. I hurried outside and looked down both sides of the street. No carris in sight, and the trolley wouldn’t reach the corner stop for half an hour. I felt so desperate I even thought of the tubes, but even if I could survive the pressure of being shot through one, I’d never fit inside.\n I sat down on the curb to prop my head against my fists. I would not wail or weep or otherwise make a fool of myself. I would think of a way.\n The clop of hooves came toward me, growing slower until they stopped. I raised my head to see a big black horse looming over me. He had been bridled but not saddled, and his sides were sweaty, as if he’d been on a long run.\n “George, what are you doing here?” The horse dropped his head to nudge my shoulder, and I automatically caught his reins. “You can’t be here. You weren’t here that day. This day. We haven’t met.”\n He snorted and tugged, pulling me to my feet. I had to hike up my skirts to mount him, which bared my legs almost to the knee as I rode down the street. Decent men stared, decent women turned away, but a few clerks and cartlasses laughed and waved me on.\n I guided George across the city, out to the farmlands, and down the long road to my destination. The black iron gates were closed, of course, but George leapt over them, as quick and nimble as a hare.\n I reined him into a respectable trot—dashing up to the great ugly place would only alarm the hooligans guarding it—but took him straight to the front of the house. Connell appeared before I could dismount, but as soon as he saw my face he turned and hurried back into the main house.\n “Well, we’re here, George,” I said as I dropped to my feet. “One of us has to go in there.”\n The big black horse eyed me before he turned and trotted off toward the stables.\n “Coward.” I shook out my skirts and took a deep breath, letting it out slowly as I walked up to use the knocker. But the door was already opening, the man inside stepping out.\n “Charmian.” Lucien Dredmore, resplendent in his usual silver and onyx, surveyed me from toe to crown and back again. “Am I to understand my man correctly? You’ve stolen one of my horses?”\n “No, sir.” He was alive. “I am returning it.” He was himself again. “It ran away and came to my building in the city and I have to sit down now.” I was going to cast up my accounts, all over his boots.\n The marble step felt so cold it was like perching on a block of ice. That was why I was shaking so badly. I felt a strong hand at the back of my head, an arm under my knees, and then he was lifting and carrying me through his dark dungeon of a house to a softer spot, a chaise lounge by a sunlit window. I heard him call for brandy, and then he was putting the rim of a glass to my lips.\n “Drink.” When I didn’t, he took hold of the end of my nose and pinched it shut.\n I drank, and coughed, and felt the fire in my throat spread through my insides as it settled to an agreeable warmth.\n He made me take another swallow and then he watched me until the shaking stopped. “Should I call for the smelling salts, Charmian, or is that the end of it?”\n “I don’t know,” I admitted. “I’ve never been in shock before now. I’m so sorry.”\n “You are apologizing. To me.” He put his hand to my brow. “You’ve no fever. Were you thrown from my horse?”\n “George would never unseat me,” I said, and took a deep breath. “This morning I was tossed back through time. I’m here because of that. Because I’ve seen the future, and I need your help to change it.”\n “You have hit your head on something.” Lucien glanced over at Connell. “Send for the physick at once.” \n","sourceLink":"https://allnovel.net/his-lordship-possessed/page-25.html","bookId":1589,"book":{"id":1589,"title":"His Lordship Possessed","description":"Storyline: \n Lady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. \n Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.\n \n","cover":"https://allnovel.net/images/his-lordship-possessed.jpg","author":"Lynn Viehl","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/his-lordship-possessed.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:20:11 AM"}}
