{"id":111308,"no":27,"title":"Page 27","content":"\\n\\n A transformation not unlike that of an Aramanthan possession came over Walsh’s shy daughter. “You think money can buy anything, Father? We live every day under Her Majesty’s grinding boot heel. The Reapers are coming to save us. They will muster our forces, crush the Empire, and end the occupation. Toriana will finally be free.”\\n\\n “Is that what they told you?” Dredmore sounded scathing. “The Reapers have no motive to fight for our liberation. Their sole interest in Toriana is to occupy it, and use its citizens and resources to ignite another mage war. Had your plan been successful, Miss Walsh, they would have burned their way across our country, and installed their own tyrants as our rulers.”\\n\\n “All Torians would have been bespelled and turned into mindless, thoughtless slaves,” I put in. “Rather like you.”\\n\\n “You know nothing about our plans.” She struggled viciously against my hold. “You think you can stop them? It’s too late. The ships are almost here.”\\n\\n “They’re still a fortnight from shore,” I corrected her. “By the time they arrive I expect the coastal fleet will be waiting to greet them.” I glanced at Dredmore. “You can arrange a proper reception, can’t you, milord?”\\n\\n His upper lip curled. “Indeed.”\\n\\n Miranda screamed something wholly unladylike as she hooked her fingers into claws and lunged for my eyes.\\n\\n I put an end to that nonsense by slapping her. “You might have pulled it off, had you left your stepmother alone. But you hated her for taking your mother’s place, and you feared she might discover that Lord Walsh had been possessed. It wouldn’t have mattered if she had, you know.” I looked up to see Lady Diana standing in the doorway. “No one would have believed her.”\\n\\n “My father should never have married that sniveling bitch.” Hatred contorted Miranda’s half-red face. “Always pretending to be so kind and sweet and loving. All she was interested in was his fortune.”\\n\\n “My family was.” Lady Diana joined us. “I married so I wouldn’t end an old maid.” She looked at her husband. “Nolan, I expect you have business to attend to in town. If you would send for our physick before you leave, I would greatly appreciate it. Montrose, please escort your sister to her room and sit with her until the whitecart arrives.”\\n\\n “You can’t put me in hospital,” Miranda shouted.\\n\\n “Of course not,” Diana soothed. “There’s a lovely little place called Havenwood, not far from my father’s country estate near Settle. Some of the best families in Rumsen have sent their troubled relations there to recuperate.”\\n\\n Miranda grabbed her brother’s jacket. “Monty, you have to help me. Please. They’re going to ruin everything.”\\n\\n “We’ll talk about it upstairs.” Montrose guided her out of the room.\\n\\n Lord Walsh gave Dredmore a desperate look. “My lord, if you would be so kind as to accompany me, and provide some explanation to our mutual friends and associates . . .”\\n\\n “It would be my pleasure. Lady Walsh.” Lucien inclined his head that way, and then came to me. “Miss Kittredge.” He raised my hand to his lips and kissed it like a perfect gentleman. Then he nipped one of my knuckles. “I will be calling on you later.”\\n\\n “Meet me down at the docks instead,” I murmured back.\\n\\n Once the men left the room, Lady Diana rang for the housekeeper, who summoned maids to remove the carpet and apply citrus oil to the floor to remove any lingering stains and odors. The butler himself delivered a tea cart generously piled with a beautiful cream tea.\\n\\n “With Lord Walsh’s compliments, Miss Kittredge.” He bowed to me as if I were royalty before he addressed Diana. “Milady, when the physick arrives, do you wish to speak with him?”\\n\\n “Not at all,” Diana said. “Inform Dr. Elgis that he is to remove Miss Miranda and have her immediately and securely transported to Havenwood for whatever treatment she requires. You might mention that Lord Walsh expects her stay to be of some duration.”\\n\\n “Yes, milady.” The butler bowed his way out of the study.\\n\\n “What about the husband in hiding?” I asked.\\n\\n “Lestin?” Diana picked up the teapot. “Without Miranda to supply him with his needs, I expect he will show his face here quite soon. We have footmen to deal with that. Sugar?”\\n\\n “No, thank you. Such an unusual name, Lestin.” I thought for a moment. “An abbreviated form of Celestino, isn’t it?”\\n\\n “I believe it is.” She filled two cups and handed one to me. “You might have warned me of your intentions this morning, Miss Kittredge.”\\n\\n I took a sip. “It is possible I could have convinced you that Miranda was responsible for the attacks on your person,” I agreed. “But the fact that she arranged for her father to be possessed to assist in an invasion of the city?” I set down my cup. “That you had to hear from her own lips.”\\n\\n “I expect you are right.” She left her own tea untouched. “Lord Walsh and I are exceedingly grateful for the discreet manner in which you have acted on our behalf.”\\n\\n I gave her the answer to the question she wasn’t asking. “I’ve worked before for other families on the Hill, milady. I know how things are done here.” When she reached for her reticule, I shook my head. “This morning I refused to provide you with my services, so no payment is necessary.”\\n\\n The tight lines round the corners of her mouth smoothed away. “Is there nothing I can do for you?”\\n\\n “At times my work requires me to make inquiries. I am always discreet, of course, but as an ordinary cit I am denied access to certain circles.” I sipped my tea before I added, “Under such circumstances, I would be most appreciative if I could rely upon your counsel and assistance.”\\n\\n “Were he to discover such an arrangement, my husband would absolutely forbid it.” She smiled. “I will have to see to it that he never does. Would you care for a crumpet?”\\n\\n Chapter Fourteen\\n\\n Lady Diana did not provide me with her carriage when I left her home—that would have overstepped the limits of ton gratitude—but she instructed the butler to summon a cab and have it take me wherever I wished.\\n\\n “Where to, miss?” the driver asked as he helped me inside.\\n\\n Somewhere in the city Dredmore and Walsh were no doubt astonishing the Tillers with news of the Reapers’ planned invasion. Even if I could find the secret meeting place of the spiritborn, as a female I would likely not be permitted entrance.\\n\\n Not that I cared to be privy to Tiller secrets. I had my own to sort out.\\n\\n “Drive to the docks,” I told the man. “But don’t rush. I’m in no hurry.”\\n\\n He touched his cap before he closed the door.\\n\\n As the cab headed down from the Hill, I reached up and curled my fingers over my pendant. I felt the movement of the gears inside, assuring me that it still functioned as my parents had intended. The chain snapped as I jerked it from my neck and tossed it onto the back-facing seat.\\n\\n My grandfather appeared in the next instant, his white hair neatly slicked back, his old-fashioned suit exquisitely pressed. “I’m not going to hurt you, lass. In fact, if you’ll give a moment to explain, I may be of some considerable assistance to—”\\n\\n “Save the speech, Harry,” I said, cutting him off. “Traveling back through time didn’t rob me of my memories.”\\n\\n He hid his dismay by becoming chatty. “Well, then, you’ve time enough to stop the invasion. You should start with Walsh and his daughter, but steer clear of that wretched Dredmore. Perhaps that Inspector Doyle fellow can be recruited to assist you. He seems a clearheaded chap. Why are you scowling like that? I like Arthur’s boy. Young Thomas has great potential.”\\n\\n “You know very well that I’ve already been to see Nolan Walsh, and that Miranda has dealt with. You were there with me, old man.” I leaned forward. “As you’ve been with me every day and night since I was a little gel.”\\n\\n “All right, then.” He sat back and folded his arms. “I’ve watched over you. You’re my granddaughter, Charm. No crime in that, is there?”\\n\\n “You’re lying to me again, Harry,” I said with great patience. “You never had a choice in the matter.”\\n\\n “Whatever you think, Charm.” He lifted the edge of the window shade and pretended to admire the scenery. “I say, are we near that fruit market? I smell peaches.”\\n\\n “Hedger gave it away when he called my pendant ‘a ginny bauble,’ ” I said. “Certainly there are ladies among the ton who wear tiny flasks fashioned to look like bracelets and watches and pendants, and I presumed he mistook it for something like those. But I misheard him. It’s his accent; it’s almost as bad as Wrecker’s.”\\n\\n “I just now realized, I’ve never seen your office.” Harry gave me an inveigling look. “We should take a ride over that way. I’ve time enough for a tour.”\\n\\n “Hedger didn’t say ginny bauble, did he?” I waited, but my grandfather only stared at the floor of the carriage. “He said genie bottle.”\\n\\n Harry made a halfhearted attempt to continue the ruse. “Don’t be foolish, gel. There is no such thing.”\\n\\n “My parents did make the pendant to contain a spirit, but it wasn’t mine.” I watched his face. “They used it to capture and imprison the spirit of the Aramanthan they feared most. They used it on you, Harry.”\\n\\n My grandfather opened his mouth, closed it, and hung his head.\\n\\n “That’s how you knew everything that has happened to me,” I continued. “You’ve been hanging about my neck all this time, unable to escape the nightstone.”\\n\\n “I did try, quite often, those first ten years.” He sat back. “I might have overcome your mother’s magic, or your father’s science, but the two together were beyond me. And then there was you and your devilish gift.” \\n\\n","sourceLink":"https://allnovel.net/his-lordship-possessed/page-27.html","bookId":1589,"book":{"id":1589,"title":"His Lordship Possessed","description":"Storyline: Lady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. \\n Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.\\n","cover":"https://allnovel.net/images/his-lordship-possessed.jpg","author":"Lynn Viehl","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/his-lordship-possessed.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:20:11 AM"}}
