{"id":111310,"no":29,"title":"Page 29","content":"\\n\\n “We could.”\\n\\n “Then as a friend I should tell you, that was a terrible lie,” he added. “Someday I will make you tell me the truth.”\\n\\n I lifted my brows. “Is that what friends do?” I saw how he was staring at the spot in the water where I’d thrown the stone. “He’s gone, Lucien. Forget about him.”\\n\\n “I wish I could, but Zarath was not the only warlord among the Aramanthan.” Dredmore’s voice grew as icy as the breeze. “There are many more out there. They are waiting, and watching, and plotting their return to power.”\\n\\n Something rose up in me, something that almost felt like icy burning of the spirit stone Zarath had forced me to swallow. “Do you expect me to burst into tears and clutch at you and wail about how powerless we are against them? Because we’re not. I’ve seen how we are, and we are . . . formidable.”\\n\\n “We are mortal,” he corrected.\\n\\n “Oh, very well.” I tossed up my hands. “I don’t think I can cry, but if you like I could swoon. I’m actually getting rather good at faking that.”\\n\\n “You’re not afraid of what’s coming.”\\n\\n “Among other things, milord, I am a spell-breaker, and a time traveler.” I turned my gaze to the sea. “Let them come.”\\n\\n Chapter Fifteen\\n\\n “Disenchanted \u0026 Co.,” the sign painter read out loud from my office window. “That’s a right strange name for this sort of business.”\\n\\n His young apprentice began mixing up some paint in a small can. “Sort of a pun, isn’t it, miss?”\\n\\n “Sort of.” I handed the painter the shilling we’d agreed on for the job along with a slip of paper. “There’s the name of my new partner. Make sure you mind the spelling.”\\n\\n “Whatever you say, miss.” He read the note. “Now this one’s mum must have known he’d go into the magic trade.”\\n\\n As he and his apprentice went to work, I retreated into my office to sort out the mail. On top of the pile I’d taken from the tube lay a thin gray envelope sealed with silver wax that bore the impression of a spike-wielding fist.\\n\\n I sat down behind my desk and used my letter dagger to slice off the seal and remove a single sheet of thin silver vellum folded in thirds.\\n\\n The paper exuded a faint scent of ripe peaches, which made me smile a little. Who would have guessed the most powerful deathmage in all of Toriana had such an infatuation with fruit?\\n\\n Charmian,\\n\\n Come to dinner tonight and you may have some.\\n\\n Dredmore\\n\\n P.S. Please.\\n\\n Two of my former clients had sent referrals, one for a haunted carri, and the other to remove some wardlings that had become wedged in a door frame. Rumsen Main must have missed those; upon learning from an anonymous source that nearly all of the talismans in the city were counterfeits containing a very dangerous raw stone, the cops had been very busy confiscating and smashing them.\\n\\n I penned a message to the desk sergeant at Rumsen Main, attached the referral to it, and got up to send it by tube, only to stop as the sign painter’s apprentice opened the door.\\n\\n “Gent to see you, miss.” He stepped aside as the gent strode in.\\n\\n Fair-haired and average-sized, Thomas Doyle wore his plainclothesman’s long trench and low-brim. Past his shoulder I saw a beater in dark blue hovering in the hallway.\\n\\n The inspector doffed his hat, revealing the tough, wind-weathered features and sun-faded blue eyes of a former navyman. “Forgive the intrusion, madam—”\\n\\n “It’s miss, To—ah, sir.” Barely remembering that to him this would be our first meeting, I sat down behind my desk. “And you are?”\\n\\n “Inspector Thomas Doyle, Rumsen Station. I’m here to speak to Mr. Kittredge,” he told me. “If he’s stepped out, I can wait.”\\n\\n “You’ll wait for a very long time, then, as there is no Mr. Kittredge. I am the proprietor.” I held out my hand. “Miss Kittredge.”\\n\\n He gave me a firm but gentle handshake as he inspected my features. “Surely not Charmian Kittredge of Middleway?”\\n\\n “Guilty as charged.” I pretended to study him back. “Would you be related to the Middleway Doyles?”\\n\\n “I am. I believe we played together as children, at my grandfather Arthur’s home.”\\n\\n I smiled. “I believe we did.”\\n\\n He paid closer attention to my face. “I haven’t seen you in years, not since you were a gel, but still you look . . . familiar.”\\n\\n “I haven’t changed all that much. Mostly taller.” I folded my hands in front of me. “Now how can I help the Yard, Inspector?”\\n\\n “We received a report of some fake wardlings needing collection, but my men are having some trouble removing them. Our staff warder, Mary Harris, recommended Kittredge of Disenchanted \u0026 Co.” He glanced over at the door. “But I see you’ve a partner now as well.”\\n\\n I smiled a little. “Yes, he’s just joined the firm. Unfortunately he works nights, so you’ll have to settle for me, if that’s acceptable.”\\n\\n “Of course.” He seemed a little embarrassed. “We’d appreciate any help you can give.”\\n\\n “Let me get my cloak and keys.” I stood up and went to the rack.\\n\\n On our way out, I inspected the sign painter’s progress:\\n\\n HARRY MERLI\\n\\n “Very nice lettering.”\\n\\n “We’ll have it done before you get back, miss.” He nodded toward the glass. “Then you and Mr. Merlin will be in business.” \\n\\n","sourceLink":"https://allnovel.net/his-lordship-possessed/page-29.html","bookId":1589,"book":{"id":1589,"title":"His Lordship Possessed","description":"Storyline: Lady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. \\n Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.\\n","cover":"https://allnovel.net/images/his-lordship-possessed.jpg","author":"Lynn Viehl","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/his-lordship-possessed.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:20:11 AM"}}
