{"id":1217,"no":25,"title":"Chapter 25","content":"ASKALON V filled the screen like a canker. \\n\\n \\n\\n For long moments no one on the bridge of the Excelsior said anything. Sulu stared at the planet, certain that he could feel sensations of evil and foulness rolling off the world\u0027s surface. Would it be likely that he\u0027d feel that way if Demora hadn\u0027t met her end there? Not likely. He was impressing his own views, shaped through the tragedy, upon the planet. \\n\\n \\n\\n None of which stopped him from feeling basically repulsed just looking at the place. \\n\\n \\n\\n The others regarded the planet as well, but they were seeing it differently than Sulu was. They looked at it and saw the world that was serving as the Waterloo for the captain whom they\u0027d come to admire and respect. None of them had the slightest doubt that this decision was going to cost him dearly. Cost him his command, perhaps even his career. And in exchange for this high price, the reward was meager if not nonexistent. Nothing could bring his daughter back, and there was certainly no guarantee that even the answers he craved would be forthcoming. \\n\\n \\n\\n Nonetheless, they stood in respectful silence. \\n\\n \\n\\n \"Commander Anik,\" he said after a time, \"ready a shuttlecraft, please.\" \\n\\n \\n\\n Anik nodded, feeling a bit relieved that another potential argument had been avoided. At least Sulu wasn\u0027t totally dismissing or ignoring the fact that the planet was under quarantine. When Captain Harriman and the rest of the landing party had beamed back aboard the Enterprise, the transporter had automatically screened and cleared them of any potentially harmful germs that they might have contracted on the planet … including the possible whatever-it-was that had had such a fatal effect on Demora. \\n\\n \\n\\n But if Sulu was going down there, he was going to be exposed to whatever viruses or germs might be awaiting him. The smart thing to do, therefore, was to cruise the surface via shuttle while making preliminary readings, rather than simply beaming down into a conceivably lethal situation. \\n\\n \\n\\n \"Shuttlecraft Galileo will be ready for you in five minutes, sir,\" said Anik. \\n\\n \\n\\n Upon hearing this, Janice Rand winced. Not the Galileo. Anything but the Galileo. Hadn\u0027t anyone noticed that the damned shuttle was jinxed? It was always crashing, burning, and making all manner of unfortunate and oftentimes catastrophic landings. She hoped that Sulu would ask for another craft. \\n\\n \\n\\n \"Excellent,\" he said. \\n\\n \\n\\n Lord, he really did believe in tempting fate. Not willing to send Sulu off to disaster all by himself, Rand stood. \"Permission to accompany you, sir,\" she said. \\n\\n \\n\\n \"I appreciate the offer, Commander, but no.\" He rose from his chair. \"This is my responsibility. My decision. And my business. No one else is going to take a risk as a result of it except me.\" \\n\\n \\n\\n She nodded, but she didn\u0027t look happy about it. Not unsympathetically, Sulu put a hand on her shoulder and said, \"I appreciate the thought, Janice. Hold the fort. I\u0027ll be back before you know it.\" \\n\\n \\n\\n \"Will do, sir,\" she said gamely … wondering if she was ever going to see him again. \\n\\n \\n\\n Sulu, meantime, turned to Anik. And in a low voice he said, \"If I were Starfleet, I\u0027d be sending another ship out to spank us. Keep sensors on maximum, and don\u0027t hesitate for a moment to back off. Leave me if necessary.\" \\n\\n \\n\\n \"Captain, we wouldn\u0027t …\" \\n\\n \\n\\n \"You would and you should, if it means the alternative is standing your ground and fighting another starship. You have your orders, Anik. I expect you to carry them out.\" \\n\\n \\n\\n \"Yes, sir,\" said Anik, not looking especially happy about it. \\n\\n \\n\\n He headed for the turbolift, and behind him various crew members echoed each other as they said, \"Good luck.\" He stopped and nodded to them in response. \\n\\n \\n\\n \"Good luck to us all,\" he said. \"I have no doubt we\u0027ll all need it.\" \\n\\n \\n\\n \\n\\n \\n\\n He stopped at the armory, not wanting to take any chances. By the time he got to the shuttlecraft, Anik was waiting for him. \\n\\n \\n\\n They stood facing each other, Sulu\u0027s arms draped behind his back. \"Here to wish me bon voyage, Commander?\" \\n\\n \\n\\n \"Sir … I am asking you one more time not to do this.\" \\n\\n \\n\\n \"And why are you asking me this, when you know I have already made up my mind?\" \\n\\n \\n\\n Anik looked somewhat self-conscious. \"Because I\u0027m being selfish, sir.\" \\n\\n \\n\\n He raised an eyebrow. \"Selfish?\" \\n\\n \\n\\n \"Yes. Because when I was coming up through the Academy, the exploits of Captain Kirk and his command crew were already … there\u0027s no other way to put it, sir … legendary. And my greatest hope, my goal, was to be able to serve under one of those remarkable people. You people were … are … my heroes. So when your previous number one, Commander Valtane, requested transfer off the Excelsior …\" \\n\\n \\n\\n \"Valtane was a good officer,\" admitted Sulu, \"but the crew never warmed to him.\" \\n\\n \\n\\n \"Yes, well … his loss was my gain. You have no idea, Captain, how many strings I pulled, favors I called in … how hard I lobbied for this assignment. And I achieved my goal. I am living my dream. I try not to make a point of it because, frankly\"—she shifted uncomfortably—\"I don\u0027t consider it a terribly professional attitude to have. But there it is, and it\u0027s mine.\" \\n\\n \\n\\n \"So what you\u0027re saying is that you feel I\u0027m taking a needless risk and, therefore, jeopardizing your dream.\" \\n\\n \\n\\n \"Yes, sir.\" \\n\\n \\n\\n \"Doesn\u0027t that seem a bit self-centered to you?\" \\n\\n \\n\\n \"Yes, sir,\" she said again, not sounding the least bit repentant. \\n\\n \\n\\n \"Well, Commander … I guess you\u0027ll find that just because one rises to the rank of captain, that doesn\u0027t necessarily mean that one becomes any less self-centered.\" He paused. \"I remember an incident with Captain Kirk, about ten years ago … he was Admiral Kirk at the time. We\u0027d been caught completely flat-footed by Khan … you might have heard about it.\" \\n\\n \\n\\n \"I was in my last year at the Academy. The students who came back, who … survived … called it the training mission from hell.\" \\n\\n \\n\\n \"That\u0027s fairly accurate. In any event, we were helpless, taken off guard by the Reliant. Power out, weapons down. Not a hope in the world. And we got a subspace transmission from the Reliant … and I\u0027ll never forget this, as long as I live. Uhura turned to the admiral and said we were receiving terms of surrender. It was as if she\u0027d spoken the foulest obscenity. Nobody moved. Nobody breathed. When the admiral told her to put it on-screen, it was as if we\u0027d all been stabbed because this was James T. Kirk, and he didn\u0027t surrender while he was alive. And he wound up stalling for time and outsmarting Khan. He\u0027d done it. Even though he blamed himself, called himself \u0027senile,\u0027 nevertheless … he sent the Reliant running. It was as if all was right with the galaxy once more. So I suppose … I learned that from him. To never surrender until the last card is played. And even though Demora is out of the game, I still have a few hands I\u0027m going to play out. Do you understand?\" \\n\\n \\n\\n Anik sighed. \"Not really, I guess, since I still would prefer you didn\u0027t have to go.\" \\n\\n \\n\\n \"I\u0027d prefer it too.\" He headed toward the shuttle, then turned and said, \"Anik. I should remind you that an attractive young yeoman served with Captain Kirk in his first five-year mission. One Janice Rand by name. She wasn\u0027t with him quite as long as I was, but … I suppose it could have been considered quality time. So if it\u0027s the spirit of us \u0027legends\u0027 that so motivated you, well … you\u0027ll find that there\u0027s legends everywhere you look. They are what we make of them.\" \\n\\n \\n\\n She nodded and stepped back as Sulu climbed into the shuttlecraft Galileo. \"Good luck, Captain. We\u0027ll be waiting for you.\" \\n\\n \\n\\n \"Keep a light burning,\" he replied as the door sealed him in. Moments later, the shuttlecraft lifted out of the bay and angled around and down toward the surface of Askalon V. \\n\\n \\n\\n She heard the voices, and they sounded concerned. \\n\\n \\n\\n They reached her as if from a great distance, and she sensed that, this time, they weren\u0027t directed at her. They were talking with each other, although she felt as if they were slowly moving toward her like the sun\u0027s rays creeping over the horizon. . . . \\n\\n \\n\\n \"They\u0027re in orbit. What are they doing here?\" \\n\\n \\n\\n \"What do you think they\u0027re doing here?\" \\n\\n \\n\\n \"He knows.\" \\n\\n \\n\\n \"He couldn\u0027t know!\" \\n\\n \\n\\n \"He does, somehow he does.\" \\n\\n \\n\\n \"I say we take him. I owe him.\" \\n\\n \\n\\n \"Don\u0027t be an idiot. We have the girl. That was risk enough. He\u0027s a damned starship captain. There will be questions. . . .\" \\n\\n \\n\\n \"Let there be questions. There\u0027s always questions. What there won\u0027t be is answers. I want him.\" \\n\\n \\n\\n \"No.\" \\n\\n \\n\\n \"I said …\" \\n\\n \\n\\n \"I said no! We\u0027ve indulged it this far! Any more would be suicide! I said … no!\" \\n\\n \\n\\n None of the conversation meant anything to her. It all blended together, one voice with another. All of it having a blur of incoherency to it. \\n\\n \\n\\n But still … \\n\\n \\n\\n But still … \\n\\n \\n\\n Vague bits of comprehension began to creep back to her. \\n\\n \\n\\n Self-awareness. Understanding. Slowly she became aware that she was more than just a mind floating in a pool of nothingness. She had a name. She had a being. She had a purpose. \\n\\n \\n\\n She had to get out. . . . \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/939/28441.html","bookId":44,"book":{"id":44,"title":"上尉的女儿 The Captain\u0027s Daughter","description":"简介： 普希金逝世前一年发表了一部真实而深刻地反映普加乔夫农民起义的长篇小说《上尉的女儿》，这部小说不仅在他的全部创作中占有极重...","cover":"http://novel.tingroom.com/file/upload/201312/06/13-37-09-16-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/939","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
