{"id":1219,"no":27,"title":"Chapter 27","content":"THE WORLD WAS BLACKNESS, and then a low mocking voice said, \"So … it\u0027s been quite a while, hasn\u0027t it, L.C.?\" Sulu reached out, feeling the cool smoothness of the floor beneath him. Slowly he opened his eyes, then squinted against the intensity of the light. Around him he could hear a soft humming and burbling, as if he were surrounded by large vats of liquid. He lifted his head up and looked around. He was surrounded by large vats of liquid. Every so often, things were what they seemed. The vats lined the room, and there seemed to be hundreds of them. In either direction, they seemed to stretch unto infinity, like a tunnel. Sulu had no clue as to how large the place might be. At the far end he thought he spied some additional machinery, like a massive engine or power source of some kind, but he was too far away to make it out clearly. The room itself had silver walls that curved upward into a cathedral ceiling, which seemed almost a mile high at its peak. In a way, the room had a feeling of a holy place, which struck Sulu as being slightly ironic. Then he saw a pair of boots standing a few feet away. He craned his head and followed the track of the legs, up to the face. He knew, however, what he would see. \"Taine,\" he said. His hair was longer, and he had a thick mustache tinged with gray. He\u0027d gotten slightly jowly, but he still looked hard and lean, and the years had not diminished the cold fury in his eyes when he stared at Sulu. He was dressed in green, his pants flared at the cuffs, his shirt hanging loosely. \"You remember my name. I\u0027m flattered.\" \"Don\u0027t be. I once had Vegan maringitis for a week and had to be hospitalized. I remember that name, too.\" He paused. \"Are your flunkies still with you?\" \"My associates, you mean? Rogers and Thor, yes. Ours has been a fruitful, if occasionally bumpy, partnership.\" \"And I was one of the bumps.\" \"Ohhh,\" said Taine softly, \"you were a very large bump, yes, L.C. Oh, but it\u0027s not Lieutenant Commander anymore, is it. It\u0027s Captain, isn\u0027t it. Captain Sulu. Very, very impressive.\" \"What are you doing here?\" he demanded. \"And why did you do it?\" \"Do what?\" asked Taine, all innocence. And Sulu felt his control slipping away. \"Demora,\" he said in a harsh whisper. \"Why did you … did you destroy her? What kind of creature are you that you would do that to … to …\" His hands convulsed in fury, and then he could hold himself back no longer. He lunged at Taine, hands outstretched. He didn\u0027t get far. To be precise, he got all of a foot before a heavy hand clamped on the back of his jacket and lifted him clear of the floor. He had just enough time to think Thor before he was hurled across the room, crashing into one of the vats. \"Are you all right, Captain?\" Taine asked with mock concern. Rocky, Sulu tried to pull himself to his feet. He felt blood trickling down the side of his face, but he didn\u0027t wipe it away. He didn\u0027t want to acknowledge the dull ache he felt. \"What are you doing here … and why did you kill her?\" Taine, leaning against one of the vats, laughed coarsely. \"Her? Oh! You mean Demora! We didn\u0027t kill her, Captain.\" \"I know, Harriman did. But you changed her. You made her over into some … some beast. You were responsible!\" Thor, his massive arms hanging at his sides, stepped next to Taine. Taine was shaking his head. \"You\u0027re not listening to me, Captain. No, not listening at all.\" He inclined his head slightly to Thor. Thor, apparently understanding Taine\u0027s desire, reached an arm into the vat that Taine was leaning against. He seemed to be fishing around for something, and then found it. He pulled it up and out. . . . Her eyes were closed, her face almost unrecognizable since it was covered with the thick liquid that coagulated in the vat. Her hair, which Thor was gripping in his meaty hands, was thick with it as well. She wasn\u0027t breathing. Then, all of a sudden her lungs seemed to contract and she vomited up thick white liquid. It splashed out onto the floor, some of it getting on Taine\u0027s boots. He stepped back distastefully. \"Could this be who you\u0027re looking for?\" asked Taine, chucking a thumb at her. Sulu stared in disbelief, unable to speak. And then, finally, he managed to push out a word: \"Demora,\" he whispered. She vomited once more, fingers clutching the edge of the vat spasmodically. Her eyes were caked shut with the liquid from the vat. And then, the years falling away, sounding like a child of six, she said, \"Daddy … I don\u0027t feel so good. . . .\" \"Incoming hail from the Enterprise,\" said Rand tonelessly. Anik of Matern didn\u0027t seem particularly inclined to jump to it immediately. She\u0027d had a feeling that this moment was inevitable and, now that it had arrived, she was oddly calm. \"Scan them, Mr. Chafin,\" she said. \"Scanning,\" said Chafin. After a moment, he announced, \"They\u0027re on yellow alert. Their defensive systems are charged.\" \"They\u0027re hailing again,\" Rand told her. \"They sound impatient.\" Anik pursed her lips and stared at the screen a moment more. \"All right. Put them on,\" she said. The bridge of the Enterprise appeared on the screen. Captain John Harriman was there, standing, his arms draped behind his back. Anik immediately noticed someone else there as well, someone who didn\u0027t appear to belong with the rest of the bridge crew. It was an older man, an admiral. Then she recognized him: Admiral \"Blackjack\" Harriman. The captain\u0027s father. Ohhh, this is not good, thought Anik. \"Excelsior, this is Captain Harriman of the Enterprise. I would have appreciated a faster response,\" said Harriman. \"Our apologies,\" Anik said evenly. \"This is Commander Anik. May we be of assistance.\" \"Yes, you may. You can start by allowing me to speak with Captain Sulu.\" \"I regret that he\u0027s indisposed.\" \"Indisposed? How?\" \"A flare-up of an old condition,\" deadpanned Anik. \"He\u0027s …\" She hesitated, looking briefly at Rand. Janice shrugged. Anik turned back to Harriman and said, \"He\u0027s chasing people around with a sword. We hope to alleviate the situation shortly.\" Harriman was silent for a moment. \"Commander, I\u0027m not interested in playing games,\" he said. \"If you do not bring Captain Sulu to speak to me, I will go on the assumption that he on the planet\u0027s surface. Would that be a safe assumption, Commander?\" Anik said nothing. \"Commander …\" Harriman said warningly. \"Captain Sulu … is not available.\" Harriman sighed and rubbed the bridge of his nose with his thumb and forefinger. \"All right, Commander … have it your way. The captain is not available. That being the case, I must warn you that I have been empowered by Starfleet to order you to leave this vicinity immediately.\" \"I … regret that I cannot comply at this time,\" said Anik. \"Why not?\" \"Orders.\" \"Whose?\" \"Captain Sulu\u0027s.\" \"Really,\" said Harriman, unimpressed. \"Then I wish to speak to him, now.\" \"Captain Sulu is not available,\" Anik told them. Harriman started to make a response, but abruptly Admiral Harriman stepped forward into the foreground. \"Commander … this is Admiral Harriman.\" \"Good day, Admiral,\" she said evenly. Janice Rand watched Anik with growing admiration. The Maternian looked fragile owing to her nearly transparent skin, but there was absolutely no denying her iron force of will. She was not one to be easily intimidated. \"I\u0027m not interested in playing word games, Commander,\" he said brusquely. \"It\u0027s important that you understand the dynamics here. I will tell you what\u0027s going on, and you can deny it if you wish, but I\u0027ll appreciate wasting no more of anyone\u0027s time. Captain Sulu has violated Starfleet orders and quarantine regs by bringing your ship to Askalon Five and then going to the surface himself. His behavior will not be tolerated. You\u0027re acting in good conscience as his subordinate, and that\u0027s fine. But now I am giving you a direct order as a Starfleet admiral: Return Captain Sulu to the Excelsior and then proceed to Starbase Nine, where Captain Sulu will be placed under arrest. Do you understand?\" Anik drew herself up straighter. \"I do not know if that will be possible, sir.\" \"I suggest you make it possible, Commander. Because if you defy me, that will be on your own head. You have five minutes to retrieve him. Enterprise out.\" The screen blinked out, but the Enterprise hung there in space, looking for all the world like it meant business. \"Commander Rand,\" Anik said softly, \"raise Captain Sulu. At the very least, he should be apprised of the situation.\" Rand nodded and immediately sent a signal to Sulu\u0027s wrist communicator … … which was, at that moment, being ground underneath a large heel of an even larger foot. On the surface of Askalon V, the shuttlecraft Galileo sat unmoving and, apparently, ineffectual. Inside, the computer kept careful track of the passage of time. Thor stepped back from the communicator, examining the busted equipment with pride. Rogers, who had just entered the room, nodded approvingly. He had a very sizable phaser rifle strapped to his back, and it looked very impressive. \"We have an arsenal down here as well,\" Taine informed Sulu. \"Some charming toys.\" Sulu wasn\u0027t listening. He was crouched on the floor, clutching the gasping body of Demora to him. Nude, she had been trembling with cold, and Sulu had removed his jacket and wrapped it around her. Her teeth were chattering so violently she couldn\u0027t even say another word. There was so much he wanted to say to her … so much he couldn\u0027t believe. He thought she\u0027d been dead. He\u0027d been at her funeral, for God\u0027s sake, her body reduced to ashes. He\u0027d come to Askalon V seeking some sort of cosmic truth and understanding, and instead he\u0027d gotten an insane riddle. She was alive, shaking in his arms, and he was so overwrought with emotion that he had no idea how to begin to handle it. He settled for patting her hair, feeling all the time as if he were treating her like a puppy. He couldn\u0027t let the depth of his feelings be displayed in these circumstances; not until he and Demora were safely out of it. Rogers looked less than happy with the situation, and he gave Taine a sufficiently angry glance that Sulu could discern his mind-set immediately. \"This whole thing is getting worse and worse,\" he muttered to Taine. \"You worry too much,\" Taine replied. \"Their instruments won\u0027t be able to detect life readings, and his communicator is dead. If they send more people to look for him, they won\u0027t find him. And that will be the end of the illustrious career of Captain Sulu.\" \"You\u0027re insane,\" said Sulu. Taine smiled slightly. \"No. I\u0027m in charge. So … do you remember years ago, Captain, when you expected me to explain to you the details behind my \u0027schemes.\u0027 Do you?\" \"Yes.\" \"And I didn\u0027t, did I. However … time has passed. I\u0027ve mellowed somewhat. Surviving the near-fatal crash of a shuttlecraft years ago tends to do that to you … tends to change your outlook.\" \"You don\u0027t have to tell me. I know what\u0027s going on.\" He tried to steady Demora\u0027s trembling. \"Really?\" said Taine in surprise. \"Now, that would be a switch. The hero giving the villain the secret behind the plot. Those are our respective positions, are they not? You the valiant hero, I the hissable villain. Tell me, O hero … what\u0027s going on.\" \"This … all this,\" Sulu said, gesturing to the vats and the vast room, \"is similar to the mechanisms on an amusement-park planet where I took shore leave twenty-odd years ago. They create cellular castings of people or objects, with built-in mechanisms capable of reading the thoughts of the subjects and developing them to order.\" \"Close,\" said Taine. \"Not quite, however. You have heard, I presume, of cloning?\" \"Of course. Growing a genetic copy from a cell.\" He thought of Dr. McCoy\u0027s recent health problems. \"Mostly it\u0027s used to supply new organs; organ banks with vital organs cloned from the originals keep them available for recipients.\" \"Not ambitious enough. Nowhere near ambitious enough. All this,\" Taine said, gesturing around, \"was created, we believe, by an offshoot race from the same one who created that \u0027amusement park\u0027 planet you speak so fondly of. But they were a warlike, conquest-minded race. They were not interested in using their technology to develop harmless, cellular cast synthetic creatures. They wanted genuine, living, breathing beings. They wanted clones that they could develop into an army. An army of workers. An army of soldiers. Whatever they were needed for, they could do. \"The drawback with cloning has always been the length of time involved. If you want a twenty-year-old, you have to take twenty years to grow one. It doesn\u0027t spring up overnight, at least not in all modern science. \"But here … oh, but here … it does. As instantly as whatever you encountered on the amusement-park planet did.\" Sulu cast his mind back, remembering how the samurai, for instance, had leaped into full-blown existence literally seconds after Sulu\u0027s thoughts had drifted that way. \"Sturdier, more dynamic … in every way, superior to the simple castings of the artificial beings. As near as we can determine, the practice of unrestrained cloning led to a great war on this world. By the time it was done, the city was in ruins, and only the clones survived … to die off after a time, or kill each other off. \"Because the clones were not perfect, you see. They had no restraint. They were uncivilized. They were ideal if you wanted an attack by a pack of mad dogs. Anything of greater restraint or finesse than that … and there were problems. I suspect that was their downfall Oh, this is all speculation, you understand.\" He made a dismissive gesture. \"But speculation based on our research. Research made in other worlds, at other sites. Hints, references, all manner of indications as to where this world might be. When Ling Sui …\" \"You mean Susan,\" corrected Sulu. For some reason the correction made him feel a little smug. But Taine looked at him archly. \"Ling Sui. Susan Ling. Any of the other half-dozen names she used. I doubt she even remembered what her real name was anymore by the time she died.\" He leaned forward, looking at Sulu contemplatively. \"You really know so very, very little. Don\u0027t you get it yet? Ling Sui and I were partners. Explorers. We went from world to world, working various digs, taking what we could find and selling it to the highest bidder. And in one world we found key information about the cloning technology hidden on another world. \"But Ling Sui decided to get greedy, to try and cut me out. She thought she would sell the information to the highest bidder all on her own. But I caught up with her … caught up with her in the city of Demora. You interfered and delayed things, but I eventually caught up with her. Oh yes, I did, before she could sell it.\" And from around his neck he removed a locket. Sulu recognized it instantly: It was the locket that Ling Sui had been wearing. It glittered green at him, as green as her eyes had been. \"We … renewed our partnership shortly thereafter, for the brief time it took for me to retrieve what she had stolen from me. Ultimately, there were no hard feelings, even though we went our separate ways after that … she to continue exploring and turning up new things to sell. And myself on the quest that eventually led me here, a year ago. It took that long, Captain. It\u0027s rare that you see that sort of dedication. We\u0027ve spent a year exploring everything that was down here, discoveries that would amaze you. Getting the equipment up and running. Producing experiments in cloning, using our own genetic material as the sample. Some experiments have been more successful than others, I\u0027ll grant you, and we had many early failures. But we\u0027ve been learning. At this point we can grow a clone to full growth in just under two minutes. Unfortunately they\u0027re difficult—impossible—to control. Furthermore, their cellular makeup tends to decay after about ten Earth days and they decompose. Not good for the long term. But we\u0027re getting there.\" \"And what\u0027s your plan?\" said Sulu sarcastically. \"To conquer the galaxy with a horde of clone warriors?\" \"Oh, hardly anything so grandiose. However, a Tholian faction is most interested. We\u0027ve had initial contact with them, opened the lines of communication. They\u0027re taken by the notion of armies upon armies of clone warriors. Of course, the Tholians keep trying to give us deadlines, and complain when we don\u0027t meet them. They\u0027re such sticklers for punctuality.\" \"I never thought I\u0027d say this,\" said Sulu, \"but Ling Sui was fortunate to have passed away when she did. Certainly preferable to being caught up in any more of your insanity.\" \"We were two of a kind, Ling Sui and I. At core, we both understood that. You see, Captain … what you got involved with was nothing more than a heightened lovers\u0027 quarrel.\" Sulu looked at him oddly. \"Lovers\u0027 quarrel? You were trying to kill each other.\" \"Of course. In case you didn\u0027t notice, Ling Sui was not one for half measures. But the fact is that I had prior claim to her, Captain … not to mention subsequent claim. Or haven\u0027t you figured it out yet.\" \"Figured out what?\" And Taine grinned lopsidedly. \"Demora is my daughter. Not yours. Mine.\" Janice Rand looked up from the comm board. \"No response, Anik,\" she said, making no effort to hide her concern. \"Scan for life-forms,\" Anik instructed. \"Scanning,\" said Chafin. \"Not picking up anything. Could be interference. Could be …\" \"Could be he\u0027s dead,\" said Anik tonelessly. The Starship Enterprise sat there in front of them, looking like she meant serious business. On the bridge of the Enterprise, the tension was rather palpable. And it was solidly between the admiral and the captain. \"Hope I didn\u0027t overstep my bounds, Captain,\" said the admiral formally. From his tone, he probably thought he was being tongue-in-cheek. To his mild surprise, however, Captain Harriman didn\u0027t seem to share in the amusement. \"I am aware that, as senior officer on this vessel, you have the privilege of stepping in where you see fit,\" said Harriman. \"I would appreciate some restraint, however, when possible.\" The admiral blinked in surprise, and then his eyes narrowed slightly. \"I have no problem with that,\" he said flatly, \"as long as you get the job done.\" \"Don\u0027t be concerned on that score, Admiral.\" \"Don\u0027t give me need to be, Captain.\" Upon hearing the exchange, Magnus and Chaput exchanged slightly nervous looks. Commander Dane shifted uneasily in her chair, and Science Officer Thompson suddenly became intensely interested in the readings from her station. And both Harrimans turned attention back to the screen.","sourceLink":"http://novel.tingroom.com/shuangyu/939/28443.html","bookId":44,"book":{"id":44,"title":"上尉的女儿 The Captain\u0027s Daughter","description":"简介： 普希金逝世前一年发表了一部真实而深刻地反映普加乔夫农民起义的长篇小说《上尉的女儿》，这部小说不仅在他的全部创作中占有极重...","cover":"http://novel.tingroom.com/file/upload/201312/06/13-37-09-16-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/939","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
