{"id":85289,"no":106,"title":"Page 106","content":"“I could’ve made a fortune with that sex tape!” she accused. “And they were going to pay me good money to write that book. Your wedding photos would’ve made me a mint. Now, what have I got? You’ve taken everything away from me. You fucking owe me.”\n I arched a brow. “They don’t want you to write the book anymore? How interesting.”\n She straightened, visibly pulling herself together. “Corinne didn’t know. About us.”\n “Let’s be clear. There was no us.” My smartphone chimed with a text from Raúl, letting me know that he was nearly at the Crossfire with Eva. I moved to the coatrack. “You wanted to fuck and I fucked you. If you wanted me, well … I’m not responsible for your exaggerated expectations.”\n “You don’t take responsibility for anything! You just use people.”\n “You used me, too. To get laid. To try to pad your bank account.” I shrugged into my jacket. “As for what I owe you for your financial losses, my wife suggested I offer you a job.”\n Her dark eyes widened. “You’re kidding.”\n “That was my response, too.” I retrieved my smartphone and slid it into my pocket. “But she was quite serious, so I’ve made the offer. If you’re interested, Scott can put you together with someone in human resources.”\n I headed toward the door. “You can see yourself out.”\n Going down to the lobby was totally unnecessary. Eva had lunch plans and the few words I could trade with her wouldn’t amount to a conversation of any importance.\n But I wanted to see her. Touch her for just a moment. Remind myself that the man I’d been when I’d screwed women like Deanna no longer existed. Never again would the scent of sex turn my stomach and make me scrub my skin nearly raw in the shower.\n I was passing through the security turnstiles in the lobby when Raúl escorted Eva through the revolving door, then retreated to his post outside. My wife wore a wine-colored jumpsuit with sky-high heels so delicate I couldn’t see how they stayed on. Her tanned shoulders were bared by thin straps, and gold hoops dangled from her ears. Sunglasses partially hid her face, drawing the eye to the plump mouth that had ringed my cock just hours ago. She carried a nude clutch in her hand and walked across the golden-veined marble with a naturally seductive sway to her hips.\n Heads swiveled as she walked by. Some of those gazes lingered to admire her ass.\n What would they think if they knew that deep inside her, she was still creamy with my cum? That her nipples were tender from the suction of my mouth and the plump lips of her perfect little cunt were swollen from the friction of my cock sliding through them?\n I knew what I thought. Mine. All mine.\n As if she felt the heat of that silent demand, her head turned sharply, catching me coming toward her. Her lips parted. I watched her chest lift and fall with a quick intake of breath.\n Same here, angel. Like a punch in the gut every time.\n “Ace.”\n Catching her slender waist in both hands, I pulled her into me and pressed a kiss to her forehead, breathing in the scent of her perfume. “Angel.”\n “This is a nice surprise,” she murmured, leaning into me. “Are you heading out?”\n “Just wanted to see you.”\n She pulled back, her eyes bright with pleasure. “You’ve got it real bad for me.”\n “It’s highly contagious. Caught it from you.”\n “Oh, did you?” Her laughter flowed over me in a warm rush of love.\n “There’s the big man himself,” Steven Ellison said, coming up beside us. “Congratulations, you two.”\n “Steven.” Eva turned from me and offered the brawny redhead a hug.\n He caught her in an embrace that lifted her feet from the floor. “Marriage looks good on you.”\n He released her and shook my hand. “You, too.”\n “It feels good,” I said.\n Steven grinned. “I can’t wait. Mark’s kept me waiting for years.”\n “You can’t keep kicking my ass about that,” Mark said, appearing next to us. He shook my hand, too. “Mr. Cross. Congratulations.”\n “Thank you.”\n “Are you joining us for lunch?” Steven asked.\n “I wasn’t planning on it, no.”\n “You’re welcome to. The more, the merrier. We’re heading to Bryant Park Grill.”\n I glanced at Eva. She’d pushed her sunglasses up on top of her head and eyed me expectantly. She gave a little nod of encouragement.\n “I’ve got a lot to catch up on,” I said, which wasn’t a lie. I was two days behind. Considering I needed to be ahead before we left for our honeymoon, I’d planned on eating in and working. \n","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-106.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: \n Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. \n Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. \n We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. \n But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.\n \n","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
