{"id":85297,"no":114,"title":"Page 114","content":"“Did you tell her about London?” “Hell, no.” Cary squeezed my hand. “Had to tell my best girl first. I’ll tell her tomorrow.” I debated bringing up the question, but I couldn’t help myself. “And Trey? Anything there?” “Not really. I send him a text or photo every couple days. Stupid shit. Stuff I’d send you.” “So no dick pics?” I teased. “Yeah, no. I’m trying to keep it real with him. He thinks I’m oversexed—which he totally doesn’t mind when he’s in bed with me—but whatever. I send him something every now and then, and he replies, but that’s it.” My nose wrinkled. I looked at Gideon and found him typing something into his phone. Cary took another drink, his throat working on a hard swallow. “It’s not a relationship. Not even friendship at this point. For all I know, he could be seeing someone, too, and I’m the odd man out.” “Well, for what it’s worth, celibacy looks good on you.” He snorted. “Because I’ve put on a few pounds? Happens. You eat, because you crave the endorphins you’re not getting with an orgasm, and you get less exercise, because you’re not practicing any mattress gymnastics.” “Cary.” I laughed. “Look at you, baby girl. You’re all tight and toned from Marathon Man Cross over there.” Gideon looked up from his phone. “Come again?” “That’s what I just said, dude,” Cary drawled, winking at me. “In so many words.” After waiting in a line of limos discharging their passengers, we finally pulled up to the red carpet rolled out in front of a historic brick-faced building, home to a private members-only club. Paparazzi were as thick as fall leaves on the ground, lining the velvet ropes that cordoned them off from the walkway. Leaning forward, I looked through the open glass entrance doors and saw more photographers held back on the right side of the entrance, while logoed backdrops lined the wall on the left for event and sponsor-branded photo ops. Angus opened the door and I could feel the momentary expectation as the paparazzi waited to see who would step out. The moment Gideon did, it was like the mother of all lightning storms, camera flashes exploding in rapid, endless succession. Mr. Cross! Gideon! Look this way! He held his hand out to me, the rubies in his wedding band catching the light and glittering. Holding my skirt up with one hand, I made my way over to him and set my hand in his. The moment I stepped out, I was blinded, but I kept my eyes open despite the spots dancing across my vision, a practiced smile pasted on my lips. I straightened, Gideon’s hand settled on the small of my back, and pandemonium ensued. It somehow managed to get worse when Cary appeared. The shouts became deafening. I spotted Raúl by the entrance, his hard gaze sweeping the melee. He lifted his arm and spoke into his wrist mic, coordinating with someone under his command. When he looked at me, my smile turned genuine. He gave me a brisk nod. Inside, we were met by two event handlers, who kept the required photo op moving along quickly, then escorted us up an elevator to the ballroom floor. We stepped into a vast space filled with New York’s elite, a glamorous assembly of powerful men and perfectly presented women displayed to flattering effect by dimmed chandelier lighting and a profusion of candlelight. The atmosphere was heavily fragranced by the massive floral arrangements centering each dining table and enlivened by a society orchestra playing upbeat instrumentals through the hum of conversation. Gideon steered me through the groups of people clustered around the dining tables, pausing often for those who stepped into our path with greetings and congratulations. My husband had slid effortlessly, seamlessly into his public persona. Splendidly handsome, completely at ease, quietly commanding, coolly aloof. I, however, was stiff and edgy, though I hoped that practiced smile hid my nervousness. Gideon and I didn’t have a good track record at events like these. We ended up fighting and leaving separately. Things were different now, but still … His hand slid up my bared back and cupped my nape, kneading the tense muscles gently. He continued to speak to the two gentlemen who’d intercepted us, discussing market fluctuations, but I was instinctively certain that he was focused on me. I stood to his right and he shifted smoothly, sliding just a bit behind me so that the right side of his body touched my back from shoulder to knee. Cary reached around my shoulder and passed me a chilled flute of champagne. “I see Monica and Stanton,” he told me. “I’ll let them know we’re here.”","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-114.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
