{"id":85317,"no":134,"title":"Page 134","content":"“Yes. Everything,” he said tightly. “It’s all fucked up. I don’t know what to do.” “No. Wrong inside me.” “Eva. How can you say that? There’s nothing wrong with you.” He cupped my face again, brought it around. “You nicked yourself.” I touched the little spot of dried blood on his jaw. “You never do that, either.” “What’s going on in that head of yours?” He wrapped himself around me. “I don’t know what to do,” he said again. “I don’t know what to do.” Gideon kept my hand in his as we returned to the living room. My father looked over from where he sat on the couch, then stood. Worn jeans. A faded UCSD T-shirt. The shadow of stubble on his strong square jaw. Gideon had shaved. Why hadn’t I processed that when I noticed the cut from the razor? Why hadn’t I noticed that he’d changed out of his tux? Some things came to me with strange clarity. Others were lost in the fog in my mind. The detectives were gone. Cary was curled up against the armrest of the couch, fast asleep, his mouth hanging partway open. I could hear him snoring softly. “We can step into my office,” Gideon said, releasing my hand to gesture down the hallway. With a curt nod, my dad rounded the coffee table. “Lead the way.” Gideon started walking. I fell into step behind him. “Eva.” My dad’s voice stopped me and I turned around. “I need to speak to Cross alone.” “Why?” “I’ve got things to say that you don’t need to hear.” I shook my head slowly. “No.” He made a frustrated noise. “We’re not arguing about this.” “Dad, I’m not a child. Anything you have to say to my husband has something to do with me and I think I should be involved.” “I have no objection,” Gideon said, returning to my side. My father’s jaw tensed, his gaze darting back and forth between us. “Fine.” We all went to Gideon’s office. Chris was sitting at Gideon’s desk, talking on the phone. He pushed back and stood when we came in. “Whenever you’re done for the day,” he said to whomever he was talking to. “I’ll explain when I see you. All right. Talk to you then, son.” “I need my office a minute,” Gideon told him when he hung up. “Sure.” His concerned gaze raked all three of us. “I’ll pull out some plates and things for lunch. We all need to eat something.” Chris left the room, which drew my eye to my dad, who was staring at the massive collage of photos on the wall. The one in the center was of me, sleeping. It was an intimate image; the kind of picture a man took to remember the things he had done with his lover before she’d fallen asleep. I looked at the other photos, noted one of me and Gideon at an event that I now knew had been captured by Hall. I turned my head away, feeling a prickle running down my spine. Fear? Hall had taken my mother from me, but who he’d really wanted was Gideon. I could be mourning my husband now. My stomach cramped at the thought, hunching me over. “Angel.” He was near me in an instant, urging me to sit in one of the two chairs facing his desk. “What’s wrong?” My dad hovered, too, his eyes wild. I couldn’t recognize my own feelings, but I saw his. He was frightened for me, more anxious than was warranted. “I’m okay,” I assured them, even as I reached for Gideon’s hand and held on tight. “You need to eat,” Gideon said. “So do you,” I countered. “The sooner you two get done, the faster we can do that.” Just the thought of food made me queasy, but I didn’t say that. They were both already too worried about me. My dad straightened. “I spoke to my family,” he told Gideon. “They still want to come and be here for Eva. And me.” Gideon half-sat on the edge of his desk, one hand running through his hair. “Okay. We were going to fly them direct to North Carolina. We’ll have to adjust the flight plan.” “I would appreciate that,” my dad said, grudgingly. “It’s fine. Don’t worry about it.” “Then why do you look worried?” I said to Gideon, seeing his frown. “It’s just … It’s a madhouse on the street right now. We can bring your family in through the garage, but if word gets out that they’re in town, they may have to deal with media and photographers at their hotel or anywhere else they may go in the city.” “They’re not coming to sightsee,” my dad snapped.","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-134.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
