{"id":85327,"no":146,"title":"Page 146","content":"Restless, I went to the bar, then realized a drink was the last thing I wanted.\n “Lauren went to the Tramells, confronted them about their son and what she suspected he’d done. He denied it and no one was able to prove a connection to him, owing to a lack of physical evidence at that time. But he saw an opportunity and took it. Lauren was the one he’d wanted, so he got his parents to cover the expenses of basic care for Katherine in return for Lauren herself and her silence about the assault.”\n Turning to face him, I stared. Money could hide a multitude of sins. The fact that Stanton had effectively hidden Eva’s past with sealed court files and nondisclosure agreements proved that. But Nathan Barker’s father had let him pay for his crimes. The Tramells had gone out of their way to conceal their son’s.\n Clancy straightened in his chair. “Jackson wanted sex. Lauren negotiated with his parents to secure marriage, which she thought would provide some sort of guarantee that Katherine would always be looked after.”\n I changed my mind about the drink and filled a tumbler to the halfway point with scotch.\n “For a span of months, the situation between Lauren and Jackson was stable. They lived—”\n “Stable?” A harsh laugh tore at my throat. “She just about sold herself to the man who orchestrated the gang rape of her twin sister. My God …”\n I tossed back the liquor.\n Monica—or Lauren—had been stronger than any of us had given her credit for. But was it worth it to Eva to learn that, considering the horror of the rest of it?\n “The situation was stable,” Clancy reiterated, “until she met Victor.”\n I caught his gaze. Just when you thought a situation was as bad as it could be, there was always worse.\n His jaw tightened. “She became pregnant with Eva. When Jackson found out the baby wasn’t his, he tried to take care of it—with his fists. Although they lived in his parents’ home, the older Tramells never interceded during arguments between the two. Lauren feared for the life of her child.”\n “She shot him.” I ran my hands through my hair, wishing I could scrape the image out of my mind as easily. “The undetermined manner of death—she killed him.”\n Clancy sat quietly, letting me absorb that revelation. I wasn’t the only one who’d killed to protect Eva.\n I began to pace. “The Tramells helped Lauren get away with it. They had to. Why?”\n “During the time Lauren was with Jackson, she quietly documented anything and everything she could use against him later. The Tramells valued their reputation—and the reputation of their debutante daughter, Monica—and they just wanted Lauren, and all the problems she’d caused, gone. Lauren left with the clothes on her back and the understanding that, moving forward, Katherine’s care was entirely her responsibility.”\n “So it was all for nothing,” I muttered. “She was right where she started.”\n Then all the information clicked into place. “Katherine’s still alive.”\n Which explained Monica’s marriages to wealthy men and her preoccupation with money. All these years, she had to know how shallow her daughter thought she was, but she’d lived with it, instead of telling the truth.\n Of course, I’d hoped Eva would never learn what I had done to Nathan. I feared she would think I was a monster.\n Clancy rose swiftly to his feet, despite his bulk. “And as I mentioned at the outset, Katherine’s care is now your financial responsibility. Whether you disclose any of this to Eva is something you’ll have to weigh.”\n I studied him. “Why are you trusting me with this?”\n He straightened his jacket. “I saw you throw yourself over Eva when Hall opened fire. That, along with how you dealt with Barker, tells me you’ll do anything to protect her. If you think it’s in her best interests to know, you’ll tell her when the time is right.”\n With a brusque nod of his head, he left the room.\n I lingered, gathering my thoughts.\n “Hey.”\n Pivoting at the sound of Eva’s voice, I faced the doorway and watched her come toward me.\n “What are you doing here?” she asked, looking starkly beautiful in a simple black dress. “I was looking all over for you. Clancy had to tell me where you were.”\n “I had a drink,” I told her, giving her a partial truth.\n “How many drinks?” The slight twinkle in her eye told me she wasn’t upset about it. “You’ve been in here awhile, ace. We have to take Dad to the airport.”\n Startled, I glanced at my watch, realized I’d been lost in my own reflections for some time. It was an effort to come back to the present and stop mulling over Lauren’s tragic history. I couldn’t change the past. \n","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-146.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: \n Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. \n Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. \n We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. \n But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.\n \n","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
