{"id":85237,"no":54,"title":"Page 54","content":"“It won’t change anything.”\n “You don’t know that for sure.”\n “I do.” I shifted and Lucky gave a protesting grunt. “I didn’t get around to telling you earlier. Chris filed for divorce.”\n “What? When?”\n “I’m not sure. I just heard about it today from Ireland. I talked to Chris after work, but he just went over their prenup and let me know that he wanted to make some added concessions. We didn’t discuss his reasons for wanting to end the marriage.”\n “Do you think it’s because he found out about Hugh?”\n I sighed, grateful I could talk to her about it. “I think it’s too much of a coincidence to be totally unrelated.”\n “Wow.” She cleared her throat. “I think I really love your stepfather.”\n I couldn’t say how I felt about Chris. I didn’t know. “When I think about my mother being upset about this … I can picture it, Eva. I’ve seen it before.”\n “I know you have.”\n “I hate it. I hated her like that. It hurt me to see her that way.”\n “You love her. That’s okay.”\n And I loved Eva. For her lack of judgment. Her unqualified devotion. It gave me the courage to say, “I’m also glad. What kind of asshole feels good that his mother is hurting?”\n There was a long pause. “She hurt you. She’s still hurting you. It’s a natural animal instinct to want to see her wounded, too. But I think what you’re glad about is having a … champion. Someone who’s telling her it really did happen to you and it’s not okay.”\n My eyes closed. If I had a champion, it was my wife.\n “Do you want me to come back over?” she asked.\n I almost said no. My routine after a nightmare was a long shower, followed by losing myself in work. It was what I knew, how I dealt with it. But soon she’d be living with me, sharing my life in a way I needed but wasn’t wholly prepared for. I had to start making adjustments for that.\n More than the logistics, though, was that I wanted her right then. Wanted to see her, smell her, feel her close.\n “I’ll come get you,” I told her. “I’ll take a quick shower and text you before I head out.”\n “Okay. I’ll be ready. I love you, Gideon.”\n I took a deep breath, let the words flow through me. “I love you, too, angel.”\n I woke again with the sun, feeling rested despite the hours I’d spent awake. Stretching, I felt something warm and furry shift against my arm, then the lash of a friendly tongue against my biceps.\n Opening one eye, I glanced at Lucky. “Can’t you keep that thing in your mouth?”\n Eva rolled onto her back and smiled, her eyes still closed. “Can’t blame him. You’re extremely, lickably delicious.”\n “Bring your tongue over here, then.”\n Her head turned my way and her eyes opened. Her hair was mussed and her cheeks pink.\n I grabbed Lucky and tucked him against my stomach as I rolled to my side. Propping my head on one hand, I took in the sight of my sleepy wife, feeling a rare contentment just from starting the day with her in my bed.\n Fact was, I shouldn’t have risked it. Eva hadn’t seen the state of my sheets, since I changed them before leaving to get her, but they were only a small sample of the damage I could cause when sleeping. Neither Lucky nor my wife was safe near me while I was sleeping. It was only because I never had multiple nightmares in one night that I’d taken the chance.\n And because I missed Eva fiercely. She wasn’t alone in her craving.\n “I’m glad you called me,” she murmured.\n Reaching over, I brushed my fingertips down her cheek. “Didn’t turn out so badly.”\n She moved slightly and kissed my hand.\n Eva saw the worst there was in me and loved me more each time she did. I’d stopped questioning it. I just had to deserve her and I would. I had a lifetime to work on it.\n “You’re not planning any more ambushes on enemies today, are you?” I asked.\n “No.” She stretched, drawing my eye to where her full tits strained against the ribbed cotton of her tank top. “But I’m ready if someone decides to ambush me.”\n I dropped Lucky to the floor and snatched Eva close, rolling on top of her. Her legs widened instinctively and I settled between them, circling my hips to rock my cock against her cunt.\n She gasped and grabbed my shoulders, her eyes wide. “I wasn’t talking about you, ace.”\n “I’m not someone?” I buried my face in the warmth of her neck, nuzzling her. She smelled heavenly, soft and sweet. Totally sexy. Hard, I rubbed against her, feeling the heat of her through her underwear and the silk of my pants. She softened for me, melted in the way that turned me on ferociously. \n","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-54.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: \n Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. \n Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. \n We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. \n But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.\n \n","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
