{"id":85246,"no":63,"title":"Page 63","content":"His stride was purposeful, but leisurely. His breathing even and steady. He kicked the door closed with a graceful, easy push. Oh God, it drove me insane when he was that controlled. He tried to set me down on the bed, but I held on. “I can’t take your clothes off if you don’t let me go.” Only the hoarseness of his voice betrayed his need. I released him, tackling the buttons of his vest before he straightened. “Take your clothes off.” He swatted my fingers away so he could take over. I stared, my breath held, as he started to strip. The sight of his hands, tanned by the sun, glittering with the rings I’d given him, deftly unknotting his tie … How could that be so erotic? The whisper of the silk as he tugged it off. The careless way he let it fall to the floor. The heat of his eyes as he watched me watching him. It was the worst sort of denial, extreme self-torture, and I forced myself to bear it. Wanting to touch him but restraining myself. Waiting for him while coveting him. I’d tortured us both by making us wait, so it was the least I deserved. I’d missed him. Missed having him like this. The collar of his shirt parted as he slid the buttons from their holes, exposing the strong column of his throat, then a glimpse of his chest. He stopped at the button below his pecs, teasing me, switching to his cuff links. He removed them slowly, one at a time, setting them carefully and deliberately on the nightstand. A soft whimper escaped me. Desperation was a wild thing inside me, sliding through my veins, the most potent aphrodisiac. Gideon shrugged out of his shirt and vest, his shoulders bunching, then relaxing. He was perfect. Every inch of him. Every hard slab of honed muscle visible beneath the rough silk of his skin. Nothing brutish in any way. Not too much of anything. Except his cock. Jesus. My thighs squeezed together as he toed out of his oxfords and pushed his slacks and boxer briefs down his long, strong legs. My sex ached and swelled, the blood rushing to my core, my slit slick with wanting. The rigid lacing of his abs flexed as he straightened. The muscles veed at his hips and pointed to the thick, long penis that curved upward between his thighs. “Oh God. Gideon.” Pre-ejaculate slicked the wide head. His testicles hung heavily, balancing the weight of his thickly veined cock. He was magnificent, beautiful in the most primal way, savagely masculine. The sight of him stirred everything feminine inside me. I licked my lips, my mouth flooded with moisture. I wanted to taste him, to hear his pleasure when I wasn’t lost to my own, to feel him quake and shiver when I took him over the edge. Gideon fisted his erection, stroking it hard from root to tip, pumping a thick pearl of moisture up to bead the tip. “It’s yours, angel,” he said roughly. “Take it.” I scrambled off the bed and started to sink to my knees. He caught me by the elbow, his mouth a taut line. “Naked.” It was hard to straighten my legs, my knees weak with desire. Harder still to resist yanking off my clothes in a rush. I was shaking as I untied my sleeveless wrap top, trying to pull open the loosened halves with some semblance of a striptease. His hissed intake of air when I exposed the lace of my bra betrayed his fraying control. My breasts were heavy and tender, the nipples hard and tight. Gideon took a step toward me, his hands sliding beneath the shoulder straps and pulling them down until I fell into his waiting palms. My eyes closed on a low moan as he squeezed gently, hefting the weight of my breasts before stroking over my nipples with the pads of his thumbs. “Should’ve kept you dressed,” he said tightly. But his touch said something else. That I was beautiful. Sexy. That I was all he could see. He pulled away and I cried out, missing his hands. His eyes were so dark they seemed black. “Offer them to me.” I shifted on my feet, my sex throbbing. Shrugging, I let my shirt drop, then reached behind me to unclasp my bra. It slid down my arms, freeing me to cup my breasts and lift them up to him. Bending his head with frustrating patience, Gideon ran the tip of his tongue over my nipple in a slow, unhurried lick. I wanted to scream … hit him … something. Anything to break that maddening restraint. “Please,” I begged, shameless. “Gideon, please …” He sucked, hard. Drawing on me with deep rapid pulls, his tongue furiously lashing the sensitive tip. I could smell the animal lust on him, pheromones and testosterone, the scent of a ferociously aroused virile male. It called to me, demanding and possessive. I felt the pull of it, of him. Felt the melting inside me, the surrender. I swayed and he caught me, tipping me back over his arms and moving to my other breast. His cheeks hollowed with the force of his sucking, my core clenching in rhythm. My spine ached with the strain of the pose I had to hold for him to take his pleasure, and that turned me on to the point of madness.","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-63.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
