{"id":85250,"no":67,"title":"Page 67","content":"My grip on the phone tightened. “Arnoldo, you’re the closest friend I have. But that’ll change if you don’t get your head out of your ass when it comes to Eva.”\\n\\n “You mistake me,” he corrected hurriedly. “If you cage her for your own security, you will lose her. What is considered romantic in a boyfriend can be stifling in a husband.”\\n\\n Realizing he was offering advice, I started counting to ten. I made it to seven. “I can’t believe this.”\\n\\n “Don’t get me wrong. Arash assures me she is the best thing to ever happen to you. He says he has never seen you happier and that she adores you.”\\n\\n “I’ve said the same.”\\n\\n Arnoldo exhaled audibly. “Men in love do not make the best witnesses.”\\n\\n Amusement replaced irritation. “Why are you and Arash discussing my personal life?”\\n\\n “It is what friends do.”\\n\\n “Girl friends. You’re grown men. You should have something better to do with your time.” I rapped my knuckles on the desktop. “And you want me to spend a weekend in Brazil with a bunch of guy gossips?”\\n\\n “Listen.” His tone was annoyingly calm. “Manhattan is out. I love the city, too, but I think we’ve exhausted its charms. Especially for such an occasion.”\\n\\n Chagrined, I looked out the windows at the city I loved. Only Eva knew about the hotel room I’d kept perpetually reserved—my “fuck pad,” as she’d called it. Until her, it was the only place where I took women for sex. It was safe. Impersonal. There was nothing to learn about me there but how I looked nude and how I liked to fuck.\\n\\n Leaving New York meant I wouldn’t get laid, so of course I’d always insisted the guys keep our prowling close to home.\\n\\n “All right. I won’t argue.” I was going to discuss it with Eva—and Cary—but that wasn’t Arnoldo’s concern.\\n\\n “Excellent. I will let you get back to work. We can catch up this weekend.”\\n\\n We ended the call. I looked over at Scott through the glass wall and lifted one finger, telling him I needed an additional minute of time. Picking up my smartphone, I called Eva.\\n\\n “Hey, ace,” she answered, sounding flirty and happy.\\n\\n I absorbed that, along with the punch of pleasure and heat that moved through me. Her voice, always throaty, was huskier than it had been lately. I was reminded of the long night, the sounds she made when aroused, her cries for me when she came.\\n\\n It was a new goal of mine to keep her sounding like that eternally, to keep her skin flushed and her lips swollen, her stride slow and sultry because she could still feel me inside her. Wherever she went, it should be obvious that I fucked her often and thoroughly. It felt obvious on me. I was loose-limbed and relaxed, a bit weak in the knees—although I’d never admit it.\\n\\n “Have our plans for the weekend changed?” I asked.\\n\\n “I might increase my vitamins,” she teased, “but otherwise, no. I’m really looking forward to it.”\\n\\n The purr in her voice aroused me. “I’ve been told our friends plan to keep us apart this weekend for our respective bachelor and bachelorette parties.”\\n\\n “Oh.” There was a pause. “I was kinda hoping everyone forgot about that.”\\n\\n My mouth curved in a smile I wished she could see. “We could run away where they can’t find us.”\\n\\n “I wish.” She sighed. “I think these things are more for them than us. It’s their last chance to have us all to themselves in the way they’re used to.”\\n\\n “Those days were over when I met you.” But I knew they weren’t yet over for Eva. She’d hung on to her independence, maintaining her friendships as she always had.\\n\\n “It’s an odd sort of ritual, isn’t it?” she mused. “Two people commit to each other for life and their friends take them out, get them drunk, and encourage them to be bad one last time.”\\n\\n All the sexy playfulness she’d had when the conversation started was gone. My wife was an intensely jealous woman. I knew that, accepted it, just as she accepted my possessiveness. “We’ll discuss this more tonight.”\\n\\n “Yay,” she said, sounding anything but happy about it.\\n\\n There was some consolation in that. I preferred to picture her suffering through a weekend without me rather than having the time of her life.\\n\\n “I love you, Eva.”\\n\\n Her breath caught. “I love you, too.”\\n\\n Ending the call, I turned to retrieve my jacket from the coatrack, then changed my mind. I retraced my steps to my desk and called Cary.\\n\\n “What’s up?” he answered.\\n\\n “Where are you planning on taking my wife this weekend?” \\n\\n","sourceLink":"https://allnovel.net/one-with-you-crossfire-5/page-67.html","bookId":1815,"book":{"id":1815,"title":"One with You (Crossfire #5)","description":"Storyline: Gideon Cross. Falling in love with him was the easiest thing I\u0027ve ever done. It happened instantly. Completely. Irrevocably. \\n Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. \\n We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn\u0027t see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. \\n But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.\\n","cover":"https://allnovel.net/images/one-with-you-crossfire-5.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/one-with-you-crossfire-5.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:00:59 PM"}}
