{"id":32959,"no":30,"title":"THE SOLITARY FAIRIES. THE BANSHEE.","content":"[The banshee (from ban [bean], a woman, and shee [sidhe], a fairy) is an attendant fairy that follows the old families, and none but them, and wails before a death. Many have seen her as she goes wailing and clapping her hands. The keen [caoine], the funeral cry of the peasantry, is said to be an imitation of her cry. When more than one banshee is present, and they wail and sing in chorus, it is for the death of some holy or great one. An omen that sometimes accompanies the banshee is the coach-a-bower [cóiste-bodhar]—an immense black coach, mounted by a coffin, and drawn by headless horses driven by a Dullahan. It will go rumbling to your door, and if you open it, according to Croker, a basin of blood will be thrown in your face. These headless phantoms are found elsewhere than in Ireland. In 1807 two of the sentries stationed outside St. James\u0027s Park died of fright. A headless woman, the upper part of her body naked, used to pass at midnight and scale the railings. After a time the sentries were stationed no longer at the haunted spot. In Norway the heads of corpses were cut off to make their ghosts feeble. Thus came into existence the Dullahans, perhaps; unless, indeed, they are descended from that Irish giant who swam across the Channel with his head in his teeth.—Ed.] \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3253/89133.html","bookId":601,"book":{"id":601,"title":"Fairy and Folk Tales of the Irish Peasantry","description":"简介： Yet, be it noticed, if you are a stranger, you will not readily [Pg xi] get ghost and fairy legends, even in a western village. You must go adroitly to work, and make friends with the children, and the old men, with those who have not felt the pressu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3253","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
