{"id":32985,"no":56,"title":"THE PHANTOM ISLE. GIRALDUS CAMBRENSIS.","content":"Among the other islands is one newly formed, which they call the Phantom Isle, which had its origin in this manner. One calm day a large mass of earth rose to the surface of the sea, where no land had ever been seen before, to the great amazement of islanders who observed it. Some of them said that it was a whale, or other immense sea-monster; others, remarking that it continued motionless, said, \"No; it is land.\" In order, therefore, to reduce their doubts to certainty, some picked young men of the island determined to approach nearer the spot in a boat. When, however, they came so near to it that they thought they should go on shore, the island sank in the water and entirely vanished from sight. The next day it re-appeared, and again mocked the same youths with the like delusion. At length, on their rowing towards it on the third day, they followed the advice of an older man, and let fly an arrow, barbed with red-hot steel, against the island; and then landing, found it stationary and habitable. This adds one to the many proofs that fire is the greatest of enemies to every sort of phantom; in so much that those who have seen apparitions, fall into a swoon as soon as they are sensible of the brightness of fire. For fire, both from its position and nature, is the noblest of the elements, being a witness of the secrets of the heavens. The sky is fiery; the planets are fiery; the bush burnt with fire, but was not consumed; the Holy Ghost sat upon the apostles in tongues of fire.","sourceLink":"http://novel.tingroom.com/duanpian/3253/89159.html","bookId":601,"book":{"id":601,"title":"Fairy and Folk Tales of the Irish Peasantry","description":"简介： Yet, be it noticed, if you are a stranger, you will not readily [Pg xi] get ghost and fairy legends, even in a western village. You must go adroitly to work, and make friends with the children, and the old men, with those who have not felt the pressu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3253","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
