{"id":12513,"no":24,"title":"CHAPTER XXIV. A STARTLING DISCOVERY.","content":"Jed slept on, unconscious of his loss, till the sun flooded the room with golden light. Then he opened his eyes and wondered for a moment where he was. But recollection came to his aid, and he recalled the incidents of his meeting with Graham and sharing the latter\u0027s room. He looked over to the other side of the bed, but his roommate was not to be seen. \"I suppose it is late and he has gone to his business,\" thought Jed tranquilly. \"Probably he didn\u0027t want to wake me up.\" This explanation seemed natural enough till he noticed that the pillow on the right-hand side of the bed did not seem to have been used. Lifting the quilt, he discovered that the sheet was smooth. Clearly Graham had not slept there at all. \"What does it mean?\" thought Jed, [Pg 213]perplexed. \"Why didn\u0027t he come back last evening?\" This was a question which he could not answer. No suspicion, however, had yet dawned upon him that anything was wrong. \"Well,\" he said, jumping out of bed, \"I must get up and try for a place. I guess I can find that eating-house where we took supper. Let me see, what was the name? Oh, Smith \u0026 Green. Well, I feel as if I could dispose of a good breakfast.\" He washed his face and hands and proceeded to dress. Mechanically, but not from any feeling of uneasiness, he thrust his hand into his pocket in search of his wallet. The pocket was empty! His heart gave a jump, and he hurriedly examined his other pockets, but it was of no avail. Then he looked about the room and on the floor, but there was no trace of the lost wallet. Jed felt faint, and his legs trembled under him, as he thought of the terrible situation in which he was placed. He began to connect Graham\u0027s absence with his loss, and [Pg 214]understood that his new acquaintance had played him false. It was a shock to him, for his nature was trustful, and he hated to believe that a young man who had seemed so friendly should prove so treacherous. \"What shall I do?\" thought poor Jed. \"I haven\u0027t enough money for my breakfast, and I am very hungry.\" At this point, just as he was ready to go out, there came a knock at the door. Jed rose and opened it. He confronted a stout woman of middle age with a very serious expression of countenance that seemed to indicate that she meant business. She regarded Jed with surprise. \"I expected to see Mr. Graham,\" she said. \"Are you a friend of his?\" \"I only met him yesterday. He invited me to come and spend the night in his room.\" \"Is he here, or has he gone out?\" \"I don\u0027t think he slept here at all last night. He left early in the evening, and said he would come back, but the bed doesn\u0027t seem to have been slept in except by myself.\" [Pg 215] \"He is very liberal in offering the use of a room that he has not paid for,\" said the lady sarcastically. \"I don\u0027t know anything about that,\" faltered Jed. \"No, I suppose not. But it\u0027s true. He only came here two weeks and a half ago, and paid one week\u0027s rent in advance—four dollars. When the next week\u0027s rent became due he said that his employer was on a visit to Chicago, and he could not get his pay till he came back. Do you know whether that is true?\" \"No, I don\u0027t. I never saw him before yesterday afternoon about four o\u0027clock in a park about half a mile from here.\" \"So he wasn\u0027t at work at that time?\" \"No; he said he worked for a broker and got through at three o\u0027clock.\" \"A broker? Why he told me he was working in a wholesale house down town. At any rate, I wish he\u0027d pay me the eight dollars he owes me.\" \"I wish he\u0027d pay me the thirty-five dollars he owes me,\" said Jed despondently. \"You don\u0027t mean to say that you were[Pg 216] goose enough to lend him thirty-five dollars?\" exclaimed Mrs. Gately in a crescendo voice. \"No; I didn\u0027t lend it to him,\" returned Jed bitterly. \"He must have taken it out of my pocket when I was asleep.\" \"Well, I declare! So he\u0027s a thief, too.\" She looked around the room, and opening a bureau examined the drawers. \"He\u0027s gone off and taken all of his things,\" she reported. \"That settles it. We shall not see our money again.\" \"I—I don\u0027t know what to do,\" said Jed sorrowfully. \"Did he take all your money?\" asked Mrs. Gately, drawn from a consideration of her own misfortune to that of her fellow-sufferer. \"Yes, he took every cent,\" answered Jed mournfully. \"And the worst of it is that I am a stranger in New York.\" \"Well, that is too bad!\" said the landlady, an expression of sympathy relieving the severity of her face. \"Your case is worse than mine. You actually haven\u0027t anything left?\" \"Except my gripsack.\" [Pg 217] \"And of course you haven\u0027t had any breakfast?\" \"No, ma\u0027am.\" \"Well, I do pity you. I suppose you are hungry?\" \"I don\u0027t know when I have ever felt so hungry,\" answered Jed. \"I will see that you don\u0027t leave the house in that condition at any rate. I\u0027m a poor woman, as any one must be who has to depend on lodgers for an income, but I\u0027m not penniless. Come down stairs, Mr.—Mr.—\" \"Gilman,\" suggested Jed. \"And I will skirmish round and scare you up something to eat.\" \"You are very kind,\" said Jed gratefully. \"Wait and see what you get,\" returned Mrs. Gately with a laugh and a softer expression, for Jed\u0027s case appealed to her heart. She led the way to the front basement. A table was set in the centre of the room. Evidently it had not yet been cleared off. \"I\u0027m a little behindhand this morning,\" remarked Mrs. Gately, beginning to bustle round. \"I don\u0027t take boarders in a general[Pg 218] way, but I have a young girl in the house that works at Macy\u0027s. I suppose you\u0027ve heard of Macy\u0027s?\" \"No, ma\u0027am.\" \"Never heard of Macy\u0027s? I thought everybody had heard of Macy\u0027s, Fo\u0027teenth Street and Sixth Avenue. Luella Dickinson works there, and I give her breakfast in the house as a favor. Let me see, there\u0027s a little coffee left—I\u0027ll warm it over—and there\u0027s bread and butter, and—I can cook you a sausage, and boil a couple of eggs.\" \"I hope you won\u0027t take too much trouble,\" said Jed. \"I guess I can afford to take a little trouble, especially as there\u0027s no knowing when you will have any dinner.\" Jed owned to himself with a sigh that there was a good deal of doubt on that point. However, it isn\u0027t wise to borrow trouble too far in advance, and the odor of the sausage as it was frying was very grateful to his nostrils. He was sure of one meal at any rate, and that was something, though the day before he thought he had enough money to last a month. [Pg 219] \"I don\u0027t think the coffee will do,\" said Mrs. Gately, as she bustled round the stove in the next room. \"I\u0027ll make some fresh. I don\u0027t think coffee amounts to much when it is warmed over.\" Jed was of the same opinion, and did not utter a protest. He was very fond of coffee, and felt that with a fresh pot of it the breakfast would be fit for a king. \"Haven\u0027t you got any folks, Mr. Gilman?\" asked the landlady, as she brought the pot of coffee and sat it on the table. \"No, ma\u0027am,\" answered Jed. \"I am alone in the world.\" \"Dear me, that\u0027s sad! And so young as you are, too!\" \"Yes, ma\u0027am. I\u0027m only sixteen.\" \"What did you calc\u0027late to do, if you could get a chance?\" \"Anything. I\u0027m not particular.\" \"You haven\u0027t any trade, have you?\" \"No. I\u0027ve been living in the country most of the time, and did chores on a farm.\" \"Well, we haven\u0027t many farms in New York,\" said the landlady with a laugh. [Pg 220] \"No. I suppose not. Even if there were, I don\u0027t like that kind of work.\" \"Have you never done anything else?\" \"I acted for a few weeks.\" \"Gracious! You don\u0027t mean to say you\u0027ve been a play actor?\" \"Yes, ma\u0027am.\" \"How Luella Dickinson would like to see you! She dotes on play actors, but I don\u0027t think she ever met one.\" \"I am afraid she would be disappointed in me. \"Oh, I guess not. If you\u0027ve played on the stage that\u0027s enough. Why can\u0027t you call round some evening? Luella would so like to see you.\" \"Thank you, Mrs. Gately. If I can get anything to do, I will call.\" Jed finished his breakfast. He ate heartily, for he had no idea where he should get another meal. \"I guess I\u0027ll be going,\" he said, as he rose from the table. \"You have been very kind.\" \"Oh, that\u0027s nothing. I hope you\u0027ll meet[Pg 221] that rascally Graham and make him give up your money.\" \"I am afraid there is little hope of that. Good morning, and thank you!\" And so Jed passed out of the hospitable house into the inhospitable street, without a cent of money or a prospect of earning any.","sourceLink":"http://novel.tingroom.com/ertong/2980/82177.html","bookId":343,"book":{"id":343,"title":"Jed, the Poorhouse Boy","description":"简介： Jed paused in his work with his axe suspended above him, for he was splitting wood. He turned his face toward the side door at which stood a woman, thin and sharp-visaged, and asked: Well, what\u0027s wanted?...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2980","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
