{"id":34297,"no":46,"title":"XLVI OUR FIRST GLIMPSE OF BRIDGMINSTER","content":"He had appreciated at once that it was a letter, not the usual note with which she had infrequently favoured him. Once before he had received a letter from her. It had arrived while he was in Purgatory and he had not opened it for a fortnight. Then, absorbed as he was, he had read it twice, so delightful was its quality. It was evident that not the least of Styr’s gifts was the epistolary, a common enough gift in her sex, but reaching the superlative degree when the woman has brains, experience, subtlety. As he opened this long letter, written on numberless sheets of thin foreign paper, he suddenly realized that he had looked forward to the time when he should have leisure to correspond with Margarethe Styr. Rarely as he faced it, he was still uneasily conscious that he had not been quite fair to this woman with whom he had enjoyed so deep and unique an intimacy. He knew there was a bond, that it was not severed, perhaps never would be. But he believed that he never again should seek her deliberately, for he had no desire to dislocate the even and, all things considered, delightful tenor of his present life; moreover, she was inaccessible save for a day now and again, or during some brief vacation he might pass in Munich. He was becoming dimly aware of deeper currents in his nature than those disturbed by his first love storm, dark and turbulent currents, perhaps, which his wife could never undam; but this was one reason the more for immuring them. Although his body had lost something of its inertia in this new life that took him so much out of doors, still was his hatred of bother, exertion, his dread of possible upheavals, no whit abated. Moreover, although it was now some time since he had admitted that he never should find companionship in his wife, still had he no wish to hurt her. She was, at least, a wife for pride, and although he had every intention of seeking his mental companionship elsewhere, still had he no desire to combine it with intoxications that Mabel must discover. As he stared at Margarethe Styr’s long letter, still half opened, he admitted, with that blunt candour of which he was signally capable, that here alone was the woman who could satisfy not only his mind but those deeper currents which run and roar in man’s maturer nucleus. This recognition, however, merely caused him to resolve anew to see no more of her. Correspondence, however—why not? He should enjoy sitting up after everybody—particularly his wife—was in bed, and living this purely mental life that ever had fascinated him in so many of its forms, enjoy it far more than assuring Mabel absent-mindedly that he loved her—of course. He read the letter. It was an extremely artful letter, for Styr was at all times and above all things—for the present, at least—an artist. It was so deliberately clever that Ordham smiled again and again in sheer delight at its spontaneity, its naturalness. She talked irresistibly this midnight to her absent friend; and how much there was to talk about, to tell him! The letter was saturated with the atmosphere of Munich, an atmosphere of art, beauty, indolence, independence; a world in itself was that city on its lofty plateau, where poverty and “business” and the rush of modern life were almost unknown; an aristocratic, exclusive, segregated city, created as with a magic wand for pleasure, for dreams, not for work. No wonder he had found it difficult to study there. Never could he repay his debt to Lutz—and to this most wonderful of women. He sighed for his lost paradise, saw the gallery with its divan upon which he so often had made himself wholly at home!—and talked . . . and listened as she read to him . . . or to the Isar beneath the window, the birds in the green trees beyond . . . She told him amusing anecdotes of his numerous acquaintance, of the opera house cabal, of the King. And she was impelled to write to him upon this particular night, not only because he had been even more than commonly in her mind all day, but because of the news that he had been accredited to Rome, and she must express the hope that he travel via Munich instead of Paris. She had learned a new r?le—Katharine, in The Taming of the Shrew; he must see her in comedy. Perhaps he would not believe it, but the experiment was a success; the critics, even those that belonged to the opposite faction, thought her as good as in tragedy, and her ovation from the public had been tremendous. He read this letter through eagerly, then again more slowly, the second time in search of something that had induced a certain uneasiness in his mind. It did not take a third reading to discover the causes—for they were two. She assumed, as a matter of course, that he was about to embark upon that career for which nature had so consummately equipped him, and to whose aid fortune had flown as if with a conscious sense of duty. How often they had discussed that future of his; she was on fire to witness the beginning of what must be an historical career; it was strange and delightful to be able to believe that she had played her little part in his life, and she was almost as excited as before her own début. But this was the least of the jars, and although it stirred and shamed him, not in a moment could he be roused from the pleasant sloth into which he had fallen. She had written little of herself, but that little upon careful reading assumed a dark significance. The King’s moroseness and eccentricities increased daily. There were no more midnight performances in the Hof. And there were hints! He might shortly be relegated to a deeper obscurity still, and permanently. His expenditures were passing belief; drastic action by the government might be necessary to save the state from bankruptcy. All this meant that Styr had lost her protector. The inimical party in the opera house, no longer restrained by fear of the King’s wrath, would conquer, drive her forth. It had required all the influence she possessed to obtain permission to learn two new r?les, and although her party was not contemptible, it was not likely that her friends among the opera house officials would go so far as to threaten Munich with their own loss were she driven out. Perhaps the most deeply human trait in Ordham was his quick and sincere sympathy. He experienced it toward mere acquaintances in trouble or slighted by fortune. It gushed warmly for those he loved, and only dried when, sulky and obstinate, he turned his back after they had bored or otherwise alienated him. Then he could be as cold and unrelenting as if all his heart instead of that core were flint, and it is doubtful if he would turn his head to observe the most malignant straits to which the offender might be reduced. He shared this trait with certain women; the women whom too much desire has spoilt, and who mete out the extreme penalty to the man that bores them as coolly and remorselessly as the law disposes of its criminals. Ordham was filled with pity and concern for this friend that had given him nothing but delight, and to whom he felt almost visibly linked by those latent vitalities which he would not permit to conquer his beloved inertia. But they shook him to-night. He rose and walked rapidly up and down the room. Driven from Munich, what would happen to this gifted unfortunate creature? There were other German capitals, but each had its hochdramatisch, who would use all her influence to exclude such a rival as Die Styr. She could merely gast about, with no assured income, while her lovely home was leased or sold. He had wished to think of her always in those intensely personal rooms which still seemed half his own, to see her moving about them with her noble pliant grace, or looking almost like a mere woman in that ugly rocking-chair. He had wished always to be able to close his eyes and conjure the vision of her Isolde, the notes of her great golden voice meeting in a rendezvous of happy birds in the cold classic dome of that opera house he had loved even before he knew her. What ailed the world that it was so slow to accept Richard Wagner, one of the few positive geniuses it had produced? If he could but do something to rouse the British public at least, create in it a thirst for The Master, interpreted by the greatest of his pupils, surely that must add to their happiness. The most ignorant were often quite happy when surrendering themselves to the seductive charm of music, to that spell which enmeshes the facile senses and makes no demand upon a brain often tired out by nightfall. And what master had ever liberated from those mysterious centres of the musically gifted brain such a voluptuous perfumed sea of music as Richard Wagner? People that had been educated on the old barrel-organ operas had only forcibly to be introduced to the far more satisfying—intoxicating—music to crave it constantly, as the Germans did. Suddenly he remembered that he possessed two hundred thousand pounds in his own right. To what better use could he put a part of it than to educate the musical taste of his country while assuring the future of the best of his friends? That a nice ethical point was involved in spending the gift of one woman upon another he would have dismissed as unworthy of consideration had it occurred to him. He was without conscious arrogance, but he had the blood of kings in his veins, as have all the older families of the British aristocracy, with or without the bend sinister, for Plantagenets and Tudors had married more than one daughter to a peer of the realm; and in blood of this order democracy is but one more affectation, or policy, or manifest of good manners, as the individual is composed; all tributes, therefore, are his natural due. Ordham would have shrunk with a hot blush from admitting that his wife belonged to a nation of upstarts, that her family pretensions were absurd, and that the god of circumstance had shown uncommon judgment in sweeping that river of crude American gold across the Atlantic to be properly enjoyed by one of a mighty people to whom that bundle of states owed its being; he would have blushed, but, driven to the wall, he would have set his countenance into the mask of a type, opened his large cold eyes, and carelessly admitted it. Therefore did he give no thought whatever to the source of his present affluence. Besides, not only would he have done as much for one or two of his old college friends, but he was meditating a great public service. To hold London by the nose until it swallowed, and assimilated, and bred an appetite for the greatest music ever written, what signified it if the artist who should help him to accomplish the miracle happened to be his dearest friend threatened with disaster? Not that he pretended to any such sophistry as that he was not thinking quite as much of Margarethe Styr as of London, more perhaps; but facts were facts. And he knew that in no more direct fashion would she ever accept aid from him. Were she driven from one opera house to the next by the jealousies of the most jealous of all artists, unable to obtain a permanent position, she could support herself by teaching; no doubt, too, she had a small private fortune, and the villa was hers. But that was not the point. She was a great and a very ambitious artist. The voice was the shortest-lived of all Nature’s gifts, and the voices devoted to the music of Wagner had an even shorter lease than the nightingales in the throats of the Violettas and Lucias. Something must be done at once. On Monday he would go up to London and ask advice of Hans Richter, who had conducted Wagner concerts with distinguished success, and whom Styr had met many times in Bayreuth and Munich. It must be the dream of his life to conduct a season of Wagner opera in London, and this could be made possible only if the experiment were privately financed. At this time Covent Garden was not a company; there was no board of directors to consult. It could be rented by any one that had the money to put up, so long as its traditions were not violated. Ordham knew that with Richter behind him, it would be possible to hire the opera house for a season—the season, were it not already disposed of; and that Styr could obtain a leave of absence either through the influence of her friends, or by flying into a rage and goading the directors to break her contract. He could rely upon many of his aristocratic and all of his artistic friends to spread the fame of Styr before her arrival, make her the fashion, fill the house for the first night with all that prided themselves upon being fad tasters, avid for new sensations. Let them be manipulated to that extent and Styr would do the rest. The English might not be able to appreciate the wonder of her voice, might yawn miserably during those everlasting recitatives, but they would succumb to her personality, her magic and magnetism; for to these rare qualities no race is more susceptible; and the mere sweetness of her voice would enchant them no matter what their lack of artistic instinct. And then! A triumph in London, and New York, already nibbling at Wagner, would give him at least a season’s hearing and demand the Styr as a matter of course. Her fortune and greater fame would be assured. Ordham, as he strode up and down the room, had never felt so enthusiastic, so energetic, so inspired. He could give to England what Ludwig II had given to central Europe. He had never been sensible, save when Styr had deliberately played upon him, of wishing to be of any use to the world; but in these exalted moments, rattling those thin sheets of foreign paper (a link in themselves), he felt his first real impulse toward accomplishment, to stand for something, experienced the real awakening of that gift for leadership which has raised him so high among men to-day, but which, so far, had only manifested itself occasionally in an obstinate determination to have his own way. He felt his power, saw his future more clearly than he had ever done before. His mind flashed to the woman who had always roused his higher and better impulses, while other women sought to make a Lucien de Rubempré of him; to-night she had transmitted to him out of her own stupendous energies—Good God! what had they not accomplished?—a tingling shock. She sent him his first opportunity to use his own energies, to taste the delights of power. It was something of the rapture of the creative artist that he felt on that never-to-be-forgotten night, for although no composition took form in his quickened brain, the genius of his personality came to life, the fires of his own peculiar gifts crackled in a mind created for the world’s use. As he finally made his way through the silent house to his room, he admitted with delight that he owed those moments of temperamental rapture, this awakening of his vital forces, which reached far beyond introducing Styr and Wagner to England, to the mate of that secret part of him the world would never suspect. His wife’s door was ajar, but he did not even glance at it. He made haste to get into bed, and, with the functional regularity of youth, was asleep in five minutes.","sourceLink":"http://novel.tingroom.com/jingdian/1954/56055.html","bookId":750,"book":{"id":750,"title":"Tower of Ivory","description":"简介： John Ordham had been in Munich several months before he met Margarethe Styr. Like all the young men, native and foreign, he chose to fancy himself in love with her, and although both too dignified and too shy to applaud with the vehemence of the Germ...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1954","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
