{"id":79596,"no":13,"title":"Page 13","content":"THE TUNNEL ran straight and downwards for five or six hundred metres, before opening out on to a huge, man-made cavern with smooth walls and an extremely high ceiling. Three heavy silver chandeliers hung from the ceiling, each adorned with dozens of thick, red, burning candles.\\n\\n As we entered the cavern I saw that it was oval in shape, wide across the middle, narrowing at either end. There was a platform set close in front of the wall across from us, suspended on sturdy steel pillars, fifteen metres high. We drifted towards it, weapons poised, spreading out to form an orderly line, Vancha slightly in front, his eyes flicking left, right, upwards, searching for vampaneze.\\n\\n \"Hold it,\" Vancha said as we approached the platform. We stopped instantly. I thought he\u0027d seen a vampaneze, but he was gazing down at the ground, puzzled but not alarmed. \"Have a look at this,\" he murmured, beckoning us forward.\\n\\n Stepping up beside him, I felt my insides turn to ice. We were standing on the edge of a pit - oval like the cavern - which was filled with steel-tipped stakes two or three metres tall. It reminded me of the pit in the Hall of Death in Vampire Mountain, only this was much bigger.\\n\\n \"A trap for us to fall - into?\" Harkat asked.\\n\\n \"I doubt it,\" Vancha said. \"The vampaneze would have covered it over if they wanted us to walk into it.\" He looked up. The platform was built directly over the pit, the support pillars rising from among the stakes. Now that we were close, we could see a long plank connecting the rear right of the platform to a hole in the wall behind it. There was also a thick rope running from the front left side of the platform to our side of the pit, where it was tied to a large holding stake.\\n\\n \"Looks like that\u0027s the only way forward,\" I noted, not liking the set-up one little bit.\\n\\n \"We could skirt the pit and climb the wall,\" Mr Crepsley suggested.\\n\\n Vancha shook his head. \"Look again,\" he said.\\n\\n I peered closely at the wall, as did Mr Crepsley. He saw what we were looking for just before I did and growled something foul beneath his breath.\\n\\n \"What is it?\" Harkat asked, his round green eyes not as sharp as ours.\\n\\n \"There are scores of tiny holes in the wall,\" I said. \"Ideal for firing darts or bullets through.\"\\n\\n \"They\u0027d cut us down in seconds if we tried climbing it,\" Vancha said.\\n\\n \"That\u0027s dumb,\" Chief Inspector Burgess muttered. We looked back at her. \"Why lay a trap here and not in the tunnel?\" she asked. \"The walls of the tunnel could have been peppered with holes like that one. We had nowhere to turn, nowhere to run. We were sitting ducks. Why leave it till now?\"\\n\\n \"Because it isn\u0027t a trap,\" Vancha told her. \"It\u0027s a warning. They don\u0027t want us going that way. They want us to use the platform.\"\\n\\n The police chief frowned. \"I thought they wanted to kill you.\"\\n\\n \"They do,\" Vancha said, \"but they want to play with us first.\"\\n\\n \"Dumb,\" she muttered again, clutching her knife close to her chest, turning slowly to survey the whole of the cavern, as though she expected demons to dart from the walls and floor.\\n\\n \"You smell that?\" Mr Crepsley asked, his nose wrinkling.\\n\\n \"Petrol,\" I nodded. \"It\u0027s coming from the pit.\"\\n\\n \"Perhaps we should move back,\" Vancha suggested, and we quickly withdrew without need of further prompting.\\n\\n We examined the rope tethered to the stake. It was thickly woven and taut, professionally tied. Vancha tested it by crawling a few metres along, while we stood with our weapons drawn, covering him.\\n\\n The Prince looked thoughtful when he returned. \"It\u0027s strong,\" he said. \"I think it would support all of us at the same time. But we won\u0027t chance it. We\u0027ll cross one at a time, the same order as we came through the tunnel.\"\\n\\n \"What about the platform?\" Harkat asked. \"It could be rigged to - collapse when we are on it.\"\\n\\n Vancha nodded. \"When I get up, I\u0027ll hurry to the opening across the plank. Don\u0027t come up until I\u0027m safe. When you do, make straight for the tunnel. The same goes for the rest of you. If they take the platform down while we\u0027re crossing, only one of us will die.\"\\n\\n \"Great,\" the Chief Inspector snorted. \"So I\u0027ve a one infive chance of making it across alive.\"\\n\\n \"Those are good odds,\" Vancha said. \"Much better than those we\u0027ll be facing when the vampaneze make their move.\"\\n\\n Vancha made sure his shurikens were strapped tight, grabbed hold of the rope, shimmied up it a few metres, then swung over on to his back, so he was hanging upside-down. He started across, hand over hand, foot over foot. The rope cut up at a steep angle, but the Prince was strong and his pace didn\u0027t falter.\\n\\n He was almost halfway across, dangling over the pit of deadly stakes, when a figure appeared in the mouth of the tunnel. Burgess spotted it first. \"Hey!\" she shouted, raising a hand to point. \"Someone\u0027s up there!\"\\n\\n Our eyes - and Vancha\u0027s - snapped to the tunnel entrance. The light was poor, and it was impossible to tell if the figure was big or small, male or female. Then it stepped forward on to the plank and the mystery was solved.\\n\\n \"Steve!\" I hissed, eyes filling with hatred.\\n\\n \"Howdy, boys!\" the half-vampaneze boomed, striding across the plank, not in the least bit afraid of falling and impaling himself on the stakes beneath. \"Find your way here OK? I was expecting you ages ago. Thought you might have got lost. I was preparing a search party to send after you.\"\\n\\n Steve reached the platform and walked to the waist-high railing which ran around the sides. He peered down at Vancha and beamed as though welcoming an old friend. \"We meet again, Mr March,\" he chuckled, waving sarcastically.\\n\\n Vancha snarled like an animal and began crawling faster than before. Steve watched, amused, then reached into a pocket, produced a match and held it up for our eyes to fix on. He winked, bent and struck the match on the floor of the platform. He cupped it close to his face a moment, while it flared into life, then casually tossed it over the railing - into the petrol-soaked pit.\\n\\n There was an explosive roar which almost burst my ear drums. Flames shot up out of the pit like huge, fiery fingers. They billowed over the edges of the platform, but didn\u0027t threaten Steve - he laughed through the red and yellow wall of fire. The flames scorched the roof and wall to the rear - and completely consumed the rope and Vancha, swallowing the Prince whole in the blink of a flame-filled eye. \\n\\n","sourceLink":"https://allnovel.net/killers-of-the-dawn-the-saga-of-darren-shan-9/page-13.html","bookId":2445,"book":{"id":2445,"title":"Killers of the Dawn (The Saga of Darren Shan #9)","description":"Storyline: The Saga of Darren Shan #9: Killers of the Dawn \\n Killers of the Dawn is the ninth book in The Saga of Darren Shan by Darren Shan. It is also the third book in the Vampire War trilogy. Mr. Crepsley, Darren, and Harkat go into the tunnels, where they find Vancha. they arm with weapons carelessly discarded by the Vampaneze and seek out Steve, steve calls the rest of the Vampaneze. There is a battle between the two sides vampaneze and vampires, and soon they face the Vampaneze Lord. The Vampaneze Lord says that he and Mr. Crepsley must fight one another alone with no help from anyone. The Vampaneze and Vampires stop their fighting at last Mr. Crepsley kills the Vampaneze Lord, but Steve jumps onto his back and causes him to fall over the cliff, where he is hanging over the pit of flaming stakes with Steve.\\n","cover":"https://allnovel.net/images/killers-of-the-dawn-the-saga-of-darren-shan-9.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/killers-of-the-dawn-the-saga-of-darren-shan-9.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:18:13 PM"}}
