{"id":79602,"no":19,"title":"Page 19","content":"AT THE last possible moment, when all seemed lost, someone on a rope swung from the ceiling, streaked through the air, grabbed Mr Crepsley around the waist, and rose with him to the safety of the platform, where they landed on their feet. As I stared, amazed, mouth hanging open, Mr Crepsley\u0027s rescuer turned - it was Mika Ver Leth, one of my fellow Vampire Princes!\n \"Now!\" Mika roared, and at his cry an army of vampires climbed through the holes in the ceiling and dropped to the floor, landing among the flabbergasted vampaneze and vampets. Before our foes had a chance to defend themselves, our troops were upon them, swords swinging, knives darting, axes chopping.\n On the platform, Gannen Harst howled miserably - \"No!\" - then threw himself at Mr Crepsley and Mika. As Harst lunged, Mika calmly stepped in front of Mr Crepsley, drew his sword, and swung it broadly at the advancing vampaneze, cutting his head clean off at the neck, sending it sailing through the air like a misdirected bowling ball.\n As Gannen Harst\u0027s lifeless, headless body toppled over the side of the platform, Steve Leopard yelped, turned, and dashed for the safety of the tunnel. He\u0027d made it almost to the end of the plank when Mr Crepsley borrowed one of Mika\u0027s knives, took careful aim, and sent it flashing through the air at the half-vampaneze.\n The knife buried itself between Steve\u0027s shoulder blades. He gasped, stopped, spun around slowly, face white, eyes bulging, hands grasping for the hilt of the knife, unable to draw it out. Coughing up blood, he collapsed on to the plank, spasmed briefly and fell still.\n Around us, the vampires were finishing off their opponents. Harkat and Vancha had joined the fighting and were cheerfully dispatching vampaneze and vampets. Behind them, Chief Inspector Alice Burgess was gazing upon the bloodshed, unsure of who these new warriors were. She sensed they were on our side, but she held on to her rifle, just in case.\n Debbie was still sobbing into my chest - she hadn\u0027t looked up and realized what was happening! \"It\u0027s OK,\" I told her, tilting her head up. \"Mr Crepsley\u0027s safe. He\u0027s alive. The cavalry arrived.\"\n \"Cavalry?\" she echoed, gazing around, wiping tears from her eyes. \"I don\u0027t understand. What ?? How ??\"\n \"I don\u0027t know!\" I chortled, then grabbed Vancha\u0027s arm as he came within range. \"What\u0027s going on?\" I roared in his ear. \"Where did this lot come from?\"\n \"I fetched them!\" he shouted gleefully. \"When I left yesterday, I flitted to Vampire Mountain and told them what was going on. They flitted back with me. They had to tread cautiously - I told them not to interfere until we\u0027d killed the Vampaneze Lord - but they\u0027ve been here all along, waiting.\"\n \"But - I don\u0027t - its?\"\n I stopped before my babbling got the better of me. I couldn\u0027t understand how they\u0027d crept up so quietly, or how Vancha had reached Vampire Mountain and got back so quickly - even flitting, it should have taken him a few nights - but what did that matter? They were here, they were kicking ass, Mr Crepsley was alive and Steve Leopard and the Lord of the Vampaneze were dead. Why question it?\n As I spun around like a child on Christmas Day surrounded by a room full of the most amazing presents, I saw a fabulously familiar figure pushing through the fighting, orange hair flecked with blood, a few new scars to add to the long one which carved up the left side of his face, limping on his sore ankle, but otherwise unbowed.\n \"Mr Crepsley!\" I roared, throwing myself into his arms.\n \"Master Shan!\" he laughed, hugging me tight to his chest. \"Did you think I was finished?\"\n \"Yes!\" I sobbed.\n \"Hah!\" he chuckled. \"You do not get rid of me that easily! You still have much to learn about our ways and customs. Who but I would have the patience to teach you?\"\n \"Vain old git!\" I snuffled.\n \"Rude young brat!\" he retorted, then pushed me back to study my face. Raising a hand, he thumbed tears and dirt away from my cheeks and then - then - then ? \n","sourceLink":"https://allnovel.net/killers-of-the-dawn-the-saga-of-darren-shan-9/page-19.html","bookId":2445,"book":{"id":2445,"title":"Killers of the Dawn (The Saga of Darren Shan #9)","description":"Storyline: \n The Saga of Darren Shan #9: Killers of the Dawn \n Killers of the Dawn is the ninth book in The Saga of Darren Shan by Darren Shan. It is also the third book in the Vampire War trilogy. Mr. Crepsley, Darren, and Harkat go into the tunnels, where they find Vancha. they arm with weapons carelessly discarded by the Vampaneze and seek out Steve, steve calls the rest of the Vampaneze. There is a battle between the two sides vampaneze and vampires, and soon they face the Vampaneze Lord. The Vampaneze Lord says that he and Mr. Crepsley must fight one another alone with no help from anyone. The Vampaneze and Vampires stop their fighting at last Mr. Crepsley kills the Vampaneze Lord, but Steve jumps onto his back and causes him to fall over the cliff, where he is hanging over the pit of flaming stakes with Steve.\n \n","cover":"https://allnovel.net/images/killers-of-the-dawn-the-saga-of-darren-shan-9.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/killers-of-the-dawn-the-saga-of-darren-shan-9.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:18:13 PM"}}
