{"id":97394,"no":6,"title":"Page 6","content":"Painfully, Waff disentangled himself from the chair and righted it as he got to his feet. His thigh throbbed. A fraction of a meter more and she would have broken his thigh! He realized that her reaction had not been mediated by her central nervous system. As with some insects, attack could be initiated by the required muscle system. That development would have to be investigated!\n His Face Dancer accomplice was listening at the open hatch. She stepped aside to allow the entry of another Face Dancer in the guise of an Ixian guard.\n Waff massaged his injured thigh while his Face Dancers disrobed the dead women. The one who copied the Ixian put her head to that of the dead old Honored Matre. Things moved swiftly after that. Presently, there was no Ixian guard, only a faithful copy of the old Honored Matre and a younger Honored Matre attendant. Another pseudo-Ixian entered and copied the younger Honored Matre. Soon, there were only ashes where dead flesh had been. A new Honored Matre scooped the ashes into a bag and concealed it beneath her robe.\n Waff made a careful examination of the room. The consequences of discovery made him shudder. Such arrogance as he had seen here came from obviously awesome powers. Those powers must be probed. He detained the Face Dancer who had copied the old one.\n \"You have printed her?\"\n \"Yes, Master. Her waking memories were still alive when I copied.\"\n \"Transfer to her.\" He gestured to the one who had been an Ixian guard. They touched foreheads for a few heartbeats then parted.\n \"It is done,\" said the older one.\n \"How many other copies of these Honored Matres have we made?\"\n \"Four, Master.\"\n \"None of them detected?\"\n \"None, Master.\"\n \"Those four must return to the heartland of these Honored Matres and learn all there is to know about them. One of those four must get back to us with what is learned.\"\n \"That is impossible, Master.\"\n \"Impossible?\"\n \"They have cut themselves off from their source. This is their way, Master. They are a new cell and have established themselves on Gammu.\"\n \"But surely we could...\"\n \"Your pardon, Master. The coordinates of their place in the Scattering were contained only in a no-ship\u0027s workings and have been erased.\"\n \"Their tracks are completely covered?\" There was dismay in his voice.\n \"Completely, Master.\"\n Disaster! He was forced to rein in his thoughts from a sudden frenzied darting. \"They must not learn what we have done here,\" he muttered.\n \"They will not learn from us, Master.\"\n \"What talents have they developed? What powers? Quickly!\"\n \"They are what you would expect from a Reverend Mother of the Bene Gesserit but without the melange memories.\"\n \"You\u0027re sure?\"\n \"There is no hint of it. As you know, Master, we - \"Yes, yes. I know.\" He waved her to silence. \"But the old one was so arrogant, so...\"\n \"Your pardon, Master, but time presses. These Honored Matres have perfected the pleasures of sex far beyond that developed by any others.\"\n \"So it\u0027s true what our informants said.\"\n \"They went back to the primitive Tantric and developed their own ways of sexual stimulation, Master. Through this, they accept the worship of their followers.\"\n \"Worship.\" He breathed the word. \"Are they superior to the Breeding Mistresses of the Sisterhood?\"\n \"The Honored Matres believe so, Master. Shall we demon -\"\n \"No!\" Waff dropped his elfin mask at this discovery and assumed the expression of a dominant Master. The Face Dancers nodded their heads in submission. A look of glee came over Waff\u0027s face. The returned Tleilaxu of the Scattering reported truthfully! By a simple mind-print he had confirmed this new weapon of his people!\n \"What are your orders, Master?\" the old one asked.\n Waff resumed his elfin mask. \"We will explore these matters only when we have returned to the Tleilaxu core at Bandalong. Meanwhile, even a Master does not give orders to an Honored Matre. You are my masters until we are free of prying eyes.\"\n \"Of course, Master. Shall I now convey your orders to the others outside?\"\n \"Yes, and these are my orders: This no-ship must never return to Gammu. It must vanish without a trace. No survivors.\"\n \"It will be done, Master.\"\n Technology, in common with many other activities, tends toward avoidance of risks by investors. Uncertainty is ruled out if possible. Capital investment follows this rule, since people generally prefer the predictable. Few recognize how destructive this can be, how it imposes severe limits on variability and thus makes whole populations fatally vulnerable to the shocking ways our universe can throw the dice.\n - Assessment of Ix, Bene Gesserit Archives\n On the morning after that initial test in the desert, Sheeana awoke in the priestly complex to find her bed surrounded by white-robed people.\n Priests and priestesses!\n \"She\u0027s awake,\" a priestess said.\n Fear gripped Sheeana. She clutched the bed covers close to her chin while she stared out at those intent faces. Were they going to abandon her in the desert again? She had slept the sleep of exhaustion in the softest bed with the cleanest linen she had experienced in her eight years but she knew everything the priests did could have a double meaning. They were not to be trusted!\n \"Did you sleep well?\" It was the priestess who had spoken first. She was a gray-haired older woman, her face framed in a white cowl with purple trim. The old eyes were watery but alert. Pale blue. The nose was an upturned stub above a narrow mouth and outjutting chin.\n \"Will you speak to us?\" the woman persisted. \"I am Cania, your night attendant. Remember? I helped you into your bed.\"\n At least, the tone of voice was reassuring. Sheeana sat up and took a better look at these people. They were afraid! A desert child\u0027s nose could detect the telltale pheromones. To Sheeana, it was a simple, straightforward observation: That smell equals fear.\n \"You thought you would hurt me,\" she said. \"Why did you do that?\"\n The people around her exchanged looks of consternation.\n Sheeana\u0027s fear dissipated. She had sensed the new order of things and yesterday\u0027s trial in the desert meant more change. She recalled how subservient the older woman... Cania? She had been almost groveling the previous night. Sheeana would learn in time that any person who lived through the decision to die evolved a new emotional balance. Fears were transitory. This new condition was interesting.\n Cania\u0027s voice trembled when she responded: \"Truly, Child of God, we did not intend harm.\"\n Sheeana straightened the bedcovers on her lap. \"My name is Sheeana.\" That was desert politeness. Cania already had produced a name. \"Who are these others?\"\n \"They will be sent away if you don\u0027t want them... Sheeana.\" Cania indicated a florid-faced woman at her left dressed in a robe similar to her own. \"All except Alhosa, of course. She is your day attendant.\"\n Alhosa curtsied at the introduction.\n Sheeana stared up at a face puffy with waterfat, heavy features in a nimbus of fluffy blond hair. Shifting her attention abruptly, Sheeana looked at the men in the group. They watched her with heavy-lidded intentness, some with looks of trembling suspicion. The fear smell was strong.\n Priests!\n \"Send them away.\" Sheeana waved a hand at the priests. \"They are haram!\" It was the gutter word, the lowest term of all for that which was most evil.\n The priests recoiled in shock.\n \"Begone!\" Cania commanded. There was no mistaking the look of malevolent glee on her face. Cania had not been included among the vile ones. But these priests clearly stood among those labeled as haram! They must have done something hideous for God to send a child-priestess to chastise them. Cania could believe it of priests. They had seldom treated her the way she deserved.\n Like chastened bedogs, the priests bowed themselves backward and left Sheeana\u0027s chamber. Among those who went out into the hallway was a historian-locutor named Dromind, a dark man with a busy mind that tended to fasten onto ideas like the beak of a carrion bird onto a morsel of meat. When the chamber door closed behind them, Dromind told his trembling companions that the name Sheeana was a modern form of the ancient name, Siona.\n \"You all know Siona\u0027s place in the histories,\" he said. \"She served Shai-hulud in His transformation from human shape into the Divided God.\"\n Stiros, a wrinkled older priest with dark lips and pale, glistening eyes, looked wonderingly at Dromind. \"That is extremely curious,\" Stiros said. \"The Oral Histories claim that Siona was instrumental in His translation from the One into the Many. Sheeana. Do you think...\"\n \"Let us not forget the Hadi Benotto translation of God\u0027s own holy words,\" another priest interrupted. \"Shai-hulud referred many times to Siona.\"\n \"Not always with favor,\" Stiros reminded them. \"Remember her full name: Siona Ibn Fuad al-Seyefa Atreides.\"\n \"Atreides,\" another priest whispered.\n \"We must study her with care,\" Dromind said.\n A young acolyte-messenger hurried up the hallway to the group and sought among them until he spied Stiros. \"Stiros,\" the messenger said, \"you must clear this hallway immediately.\"\n \"Why?\" It was an indignant voice from the press of the rejected priests.\n \"She is to be moved into the High Priest\u0027s quarters,\" the messenger said.\n \"By whose orders?\" Stiros demanded.\n \"High Priest Tuek himself says this,\" the messenger said. \"They have been listening.\" He waved a hand vaguely toward the direction from which he had come.\n All of the group in the hall understood. Rooms could be shaped to send voices from them into other places. There were always listeners.\n \"What have they heard?\" Stiros demanded. His old voice quavered.\n \"She asked if her quarters were the best. They are about to move her and she must not find any of you out here.\"\n \"But what are we to do?\" Stiros asked.\n \"Study her,\" Dromind said.\n The hall was cleared immediately and all of them began the process of studying Sheeana. The pattern born here would print itself on all of their lives over the subsequent years. The routine that took shape around Sheeana produced changes felt in the farthest reaches of the Divided God\u0027s influence. Two words ignited the change: \"Study her.\"\n How naive she was, the priests thought. How curiously naive. But she could read and she displayed an intense interest in the Holy Books she found in Tuek\u0027s quarters. Her quarters now.\n All was propitiation from the highest to the lowest. Tuek moved into the quarters of his chief assistant and the bumping process moved downward. Fabricators waited upon Sheeana and measured her. The finest stillsuit was fashioned for her. She acquired new robes of priestly gold and white with purple trim.\n People began avoiding historian-locutor Dromind. He took to buttonholing his fellows and expounding the history of the original Siona as though this said something important about the present bearer of the ancient name.\n \"Siona was the mate of the Holy Duncan Idaho,\" Dromind reminded anyone who would listen. \"Their descendants are everywhere.\"\n \"Indeed? Pardon me for not listening further but I am really on an urgent errand.\"\n At first, Tuek was more patient with Dromind. The history was interesting and its lessons obvious. \"God has sent us a new Siona,\" Tuek said. \"All should be clear.\"\n Dromind went away and returned with more tidbits from the past. \"The accounts from Dar-es-Balat take on a new meaning now,\" Dromind told his High Priest. \"Should we not make further tests and comparisons of this child?\"\n Dromind had braced the High Priest immediately after breakfast. The remains of Tuek\u0027s meal still occupied the serving table on the balcony. Through the open window, they could hear stirrings overhead in Sheeana\u0027s quarters.\n Tuek put a cautioning finger to his lips and spoke in a hushed voice. \"The Holy Child goes of her own choice to the desert.\" He went to a wall map and pointed to an area southwest of Keen. \"Apparently this is an area that interests her or... I should say, calls her.\"\n \"I am told she makes frequent use of dictionaries,\" Dromind said. \"Surely, that cannot be a -\"\n \"She is testing us,\" Tuek said. \"Do not be fooled.\"\n \"But Lord Tuek, she asks the most childish questions of Cania and Alhosa.\"\n \"Do you question my judgment, Dromind?\"\n Belatedly, Dromind realized he had overstepped the proper bounds. He fell silent but his expression said many more words were compressed within him.\n \"God has sent her to weed out some evil that has crept into the ranks of the anointed,\" Tuek said. \"Go! Pray and ask your self if that evil has lodged itself within you.\"\n When Dromind had gone, Tuek summoned a trusted aide. \"Where is the Holy Child?\"\n \"She has gone out into the desert, Lord, to commune with her Father.\"\n \"To the southwest?\"\n \"Yes, Lord.\"\n \"Dromind must be taken far out to the east and left on the sand. Plant several thumpers to make sure he never returns.\"\n \"Dromind, Lord?\"\n \"Dromind.\"\n Even after Dromind was translated into the Mouth of God, the priests continued to follow his original injunction. They studied Sheeana.\n Sheeana also studied.\n Gradually, so gradually that she could not identify the point of transition, she recognized her great power over those around her. At first, it was a game, a continual Children\u0027s Day with adults jumping to obey each childish whim. But it appeared that no whim was too difficult.\n Did she require a rare fruit for her table?\n The fruit was served to her on a golden dish.\n Did she glimpse a child far below on the teeming streets and require that child as a playmate?\n That child was hustled up to Sheeana\u0027s temple quarters. When fear and shock passed, the child might even join in some game, which the priests and priestesses observed intently. Innocent skipping about on the rooftop garden, giggling whispers - all were subjected to intense analysis. Sheeana found the awe of such children a burden. She seldom called the same child back to her, preferring to learn new things from new playmates.\n The priests achieved no consensus about the innocence of such encounters. The playmates were put through fearful interrogation until Sheeana discovered this and raged at her guardians.\n Inevitably, word of Sheeana spread throughout Rakis and off-planet. The Sisterhood\u0027s reports accumulated. The years passed in a kind of sublimely autocratic routine - feeding Sheeana\u0027s curiosity. It was a curiosity that appeared to have no limits. None of those among the immediate attendants thought of this as education: Sheeana teaching the priests of Rakis and they teaching her. The Bene Gesserit, however, observed this aspect of Sheeana\u0027s life at once and watched it closely.\n \"She is in good hands. Leave her there until she is ready for us,\" Taraza ordered. \"Keep a defense force on constant alert and see that I get regular reports.\"\n Not once did Sheeana reveal her true origins nor what Shaitan had done to her family and neighbors. That was a private thing between Shaitan and herself. She thought of her silence as payment for having been spared.\n Some things paled for Sheeana. She made fewer trips into the desert. Curiosity continued but it became obvious that an explanation of Shaitan\u0027s behavior toward her might not be found on the open sand. And although she knew there were embassies of other powers on Rakis, the Bene Gesserit spies among her attendants made sure that Sheeana did not express too much interest in the Sisterhood. Soothing answers to dampen such interest were provided and metered out to Sheeana as required.\n The message from Taraza to her observers on Rakis was direct and pointed: \"The generations of preparation have become the years of refinement. We will move only at the proper moment. There is no longer any doubt that this child is the one.\"\n In my estimation, more misery has been created by reformers than by any other force in human history. Show me someone who says \"Something must be done!\" and I will show you a head full of vicious intentions that have no other outlet. What we must strive for always! is to find the natural flow and go with it.\n - The Reverend Mother Taraza, Conversational Record, BG File GSXXMAT9\n The overcast sky lifted as the sun of Gammu climbed, picking up the scents of grass and surrounding forest extracted and condensed by the morning dampness.\n Duncan Idaho stood at a Forbidden Window inhaling the smells. This morning Patrin had told him: \"You are fifteen years of age. You must consider yourself a young man. You no longer are a child.\"\n \"Is it my birthday?\"\n They were in Duncan\u0027s sleeping chamber where Patrin had just aroused him with a glass of citrus juice.\n \"I do not know your birthday.\"\n \"Do gholas have birthdays?\"\n Patrin remained silent. It was forbidden to speak of gholas with the ghola.\n \"Schwangyu says you can\u0027t answer that question,\" Duncan said.\n Patrin spoke with obvious embarrassment. \"The Bashar wishes me to tell you that your training class will be delayed this morning. He wishes you to do the leg and knee exercises until you are called.\"\n \"I did those yesterday!\"\n \"I merely convey the Bashar\u0027s orders.\" Patrin took the empty glass and left Duncan alone.\n Duncan dressed quickly. They would expect him for breakfast in the Commissary. Damn them! He did not need their breakfast. What was the Bashar doing? Why couldn\u0027t he start the classes on time? Leg and knee exercises! That was just make-work because Teg had some other unexpected duty. Angrily, Duncan took a Forbidden Route to a Forbidden Window. Let the damned guards be punished!\n He found the odors coming through the open window evocative but could not place the memories that lurked at the edges of his awareness. He knew there were memories. Duncan found this frightening but magnetic - like walking along the edge of a cliff or openly confronting Schwangyu with his defiance. He had never walked along the edge of a cliff nor openly confronted Schwangyu with defiance, but he could imagine such things. Just seeing a filmbook holophoto of a cliff-edge path was enough to make his stomach tighten. As for Schwangyu, he often imagined angry disobedience and suffered the same physical reaction.\n Someone else is in my mind, he thought.\n Not just in his mind - in his body. He could sense other experiences as though he had just awakened, knowing he had dreamed but unable to recall the dream. This dream-stuff called up knowledge that he knew he could not possess.\n Yet he did possess it.\n He could name some of the trees he smelled out there but those names were not in the library\u0027s records.\n This Forbidden Window was forbidden because it pierced an outer wall of the Keep and could be opened. It was often open, as now, for ventilation. The window was reached from his room by climbing over a balcony rail and slipping through a storeroom air shaft. He had learned to do this without the slightest disturbance of rail or storeroom or shaft. Quite early, it had been made clear to him that those trained by the Bene Gesserit could read extremely small signs. He could read some of those signs himself, thanks to the teachings of Teg and Lucilla.\n Standing well back in the shadows of the upper hallway, Duncan focused on rolling slopes of forest climbing to rocky pinnacles. He found the forest compelling. The pinnacles beyond it possessed a magical quality. It was easy to imagine that no human had ever touched that land. How good it would be to lose himself there, to be only his own person without worrying that another person dwelled within him. A stranger there.\n With a sigh, Duncan turned away and returned to his room along his secret route. Only when he was back in the safety of his room did he allow himself to say that he had done it once more. No one would be punished for this venture.\n Punishments and pain, which hung like an aura around the places forbidden to him, only made Duncan exercise extreme caution when he broke the rules.\n He did not like to think of the pain Schwangyu would cause him if she discovered him at a Forbidden Window. Even the worst pain, though, would not cause him to cry out, he told himself. He had never cried out even at her nastier tricks. He merely stared back at her, hating her but absorbing her lesson. To him, Schwangyu\u0027s lesson was direct: Refine his ability to move unobserved, unseen and unheard, leaving no spoor to betray his passage.\n In his room, Duncan sat on the edge of his cot and contemplated the blank wall in front of him. Once, when he had stared at that wall, an image had formed there - a young woman with light amber hair and sweetly rounded features. She looked out of the wall at him and smiled. Her lips moved without sound. Duncan already had learned lip reading, though, and he read the words clearly.\n \"Duncan, my sweet Duncan.\"\n Was that his mother? he wondered. His real mother?\n Even gholas had real mothers somewhere back there. Lost in the time behind the axlotl tanks there had been a living woman who bore him and... and loved him. Yes, loved him because he was her child. If that face on the wall was his mother, how had her image found its way there? He could not identify the face but he wanted it to be his mother.\n The experience frightened him but fear did not prevent him from wanting to repeat it. Whoever that young woman was, her fleeting presence tantalized him. The stranger within him knew that young woman. He felt sure of this. Sometimes, he wanted to be that stranger only for an instant - long enough to gather up all of those hidden memories - but he feared this desire. He would lose his real self, he thought, if the stranger entered his awareness.\n Would that be like death? he wondered.\n Duncan had seen death before he was six. His guards had repelled intruders and one of the guards was killed. Four intruders died as well. Duncan had watched the five bodies brought into the Keep - flaccid muscles, arms dragging. Some essential thing was gone from them. Nothing remained to call up memories - self-memories or stranger-memories.\n The five were taken somewhere deep within the Keep. He heard a guard say later that the four intruders were loaded with \"shere.\" That was his first encounter with the idea of an Ixian Probe.\n \"An Ixian Probe can raid the mind even of a dead person,\" Geasa explained. \"Shere is a drug that protects you from the probe. Your cells will be totally dead before the drug effect is gone.\"\n Adroit listening told Duncan the four intruders were being probed in other ways as well. These other ways were not explained to him but he suspected this must be something secret to the Bene Gesserit. He thought of it as another hellish trick of the Reverend Mothers. They must animate the dead and extract information from the unwilling flesh. Duncan visualized depersonalized muscles performing at the will of a diabolical observer.\n The observer was always Schwangyu.\n Such images filled Duncan\u0027s mind despite every effort by his teachers to dispel \"foolishness invented by the ignorant.\" His teachers said these wild stories were valuable only to create fear of the Bene Gesserit among the uninitiated. Duncan refused to believe that he was of the initiated. Looking at a Reverend Mother he always thought: I\u0027m not one of them!\n Lucilla was most persistent lately. \"Religion is a source of energy,\" she said. \"You must recognize this energy. It can be directed for your own purposes.\"\n Their purposes, not mine, he thought.\n He imagined his own purposes and projected his own images of himself triumphant over the Sisterhood, especially over Schwangyu. Duncan felt that his imaginative projections were a subterranean reality that worked on him from that place where the stranger dwelled. But he learned to nod and give the appearance that he, too, found such religious credulity amusing.\n Lucilla recognized the dichotomy in him. She told Schwangyu: \"He thinks mystical forces are to be feared and, if possible, avoided. As long as he persists in this belief he cannot learn to use our most essential knowledge.\"\n They met for what Schwangyu called \"a regular assessment session,\" just the two of them in Schwangyu\u0027s study. The time was shortly after their light supper. The sounds of the Keep around them were those of transition - night patrols beginning, off-duty personnel enjoying one of their brief free-time periods. Schwangyu\u0027s study had not been completely insulated from such things, a deliberate contrivance of the Sisterhood\u0027s renovators. The trained senses of a Reverend Mother could detect many things from the sounds around her.\n Schwangyu felt more and more at a loss in these \"assessment sessions.\" It was increasingly obvious that Lucilla could not be won over to those opposing Taraza. Lucilla also was immune to a Reverend Mother\u0027s manipulative subterfuges. Most damnable of all, Lucilla and Teg between them were imparting highly volatile abilities to the ghola. Dangerous in the extreme. Added to all of her other problems, Schwangyu nurtured a growing respect for Lucilla.\n \"He thinks we use occult powers to practice our arts,\" Lucilla said. \"How did he arrive at such a peculiar idea?\"\n Schwangyu felt the disadvantage imposed by this question. Lucilla already knew this had been done to weaken the ghola. Lucilla was saying: \"Disobedience is a crime against our Sisterhood!\"\n \"If he wants our knowledge, he will surely get it from you,\" Schwangyu said. No matter how dangerous, in Schwangyu\u0027s view, this was certainly a truth.\n \"His desire for knowledge is my best lever,\" Lucilla said, \"but we both know that is not enough.\" There was no reproof in Lucilla\u0027s tone but Schwangyu felt it nevertheless.\n Damn her! She\u0027s trying to win me over! Schwangyu thought.\n Several responses entered Schwangyu\u0027s mind: \"I have not disobeyed my orders.\" Pah! A disgusting excuse! \"The ghola has been treated according to standard Bene Gesserit training practices.\" Inadequate and untrue. And this ghola was not a standard object of education. There were depths in him that could only be matched by a potential Reverend Mother. And that was the problem!\n \"I have made mistakes,\" Schwangyu said.\n There! That was a double-pronged answer that another Reverend Mother could appreciate.\n \"You made no mistake when you damaged him,\" Lucilla said.\n \"But I failed to anticipate that another Reverend Mother might expose the flaws in him,\" Schwangyu said.\n \"He wants our powers only to escape us,\" Lucilla said. \"He\u0027s thinking: Someday I\u0027ll know as much as they do and then I\u0027ll run away.\"\n When Schwangyu did not respond, Lucilla said: \"That was clever. If he runs, we will have to hunt him down and destroy him ourselves.\"\n Schwangyu smiled.\n \"I will not make your mistake,\" Lucilla said. \"I tell you openly what I know you would see anyway. I now understand why Taraza sent an Imprinter to one so young.\"\n Schwangyu\u0027s smile vanished. \"What are you doing?\"\n \"I am bonding him to me the way we bond all of our acolytes to their teachers. I am treating him with candor and loyalty as one of our own.\"\n \"But he\u0027s male!\"\n \"So the spice agony will be denied him, but nothing else. He is, I think, responding.\"\n \"And when the time comes for the ultimate stage of imprinting?\" Schwangyu asked.\n \"Yes, that will be delicate. You think it will destroy him. That, of course, was your plan.\"\n \"Lucilla, the Sisterhood is not unanimous in following Taraza\u0027s designs for this ghola. Certainly, you know this.\"\n It was Schwangyu\u0027s most powerful argument and the fact that it had been reserved for this moment said much. The fears that they might produce another Kwisatz Haderach were deep-seated and the dissension in the Bene Gesserit comparably powerful.\n \"He is primitive genetic stock and not bred to be a Kwisatz Haderach,\" Lucilla said.\n \"But the Tleilaxu have interfered with his genetic inheritance!\"\n \"Yes; at our orders. They have sped up his nerve and muscle responses.\"\n Is that all they have done?\" Schwangyu asked.\n \"You\u0027ve seen the cell studies,\" Lucilla said.\n \"If we could do as much as the Tleilaxu we would not need them,\" Schwangyu said. \"We would have our own axlotl tanks.\"\n \"You think they have hidden something from us,\" Lucilla said.\n \"They had him completely outside our observation for nine months!\"\n \"I have heard all of these arguments,\" Lucilla said.\n Schwangyu threw up her hands in a gesture of capitulation. \"He\u0027s all yours, then, Reverend Mother. And the consequences are on your head. But you will not remove me from this post no matter what you report to Chapter House.\"\n \"Remove you? Certainly not. I don\u0027t want your faction sending someone unknown to us.\"\n \"There is a limit to the insults I will take from you,\" Schwangyu said.\n \"And there\u0027s a limit to how much treachery Taraza will accept,\" Lucilla said.\n \"If we get another Paul Atreides or, the Gods forbid, another Tyrant, it will be Taraza\u0027s doing,\" Schwangyu said. \"Tell her I said so.\"\n Lucilla stood. \"You may as well know that Taraza left entirely at my discretion how much melange I feed this ghola. I have already begun increasing his intake of the spice.\"\n Schwangyu pounded both fists on her desk. \"Damn you all! You will destroy us yet!\"\n The Tleilaxu secret must be in their sperm. Our tests prove that their sperm does not carry forward in a straight genetic fashion. Gaps occur. Every Tleilaxu we have examined has hidden his inner self from us. They are naturally immune to an Ixian Probe! Secrecy at the deepest levels, that is their ultimate armor and their ultimate weapon.\n - Bene Gesserit Analysis, Archives Code: BTXX441WOR\n On a morning of Sheeana\u0027s fourth year in priestly sanctuary, the reports of their spies brought a gleam of special interest to the Bene Gesserit watchers on Rakis.\n \"She was on the roof, you say?\" the Mother Commander of the Rakian Keep asked.\n Tamalane, the commander, had served previously on Gammu and knew more than most about what the Sisterhood hoped to conjoin here. The spies\u0027 report had interrupted Tamalane\u0027s breakfast of cifruit confit laced with melange. The messenger stood at ease beside the table while Tamalane resumed eating as she reread the report.\n \"On the roof, yes, Reverend Mother,\" the messenger said. Tamalane glanced up at the messenger, Kipuna, a Rakian native acolyte being groomed for sensitive local duties. Swallowing a mouthful of her confit, Tamalane said: \" \u0027Bring them back!\u0027 Those were her exact words?\"\n Kipuna nodded curtly. She understood the question. Had Sheeana spoken with preemptory command?\n Tamalane resumed scanning the report, looking for the sensitive signals. She was glad they had sent Kipuna herself. Tamalane respected the abilities of this Rakian woman. Kipuna had the soft round features and fuzzy hair common among much of the Rakian priestly class, but there was no fuzzy brain under that hair. \n","sourceLink":"https://allnovel.net/heretics-of-dune-dune-chronicles-5/page-6.html","bookId":2157,"book":{"id":2157,"title":"Heretics of Dune (Dune Chronicles #5)","description":"Storyline: \n Heretics of Dune (Dune Chronicles #5) \n With more than ten million copies sold, Frank Herbert\u0027s magnificent Dune books stand among the major achievements of the human imagination. In this, the fifth and most spectacular Dune book of all, the planet Arrakis--now called Rakis--is becoming desert again. The Lost Ones are returning home from the far reaches of space. The great sandworms are dying. And the children of Dune\u0027s children awaken from empire as from a dream, wielding the new power of a heresy called love...\n \n","cover":"https://allnovel.net/images/heretics-of-dune-dune-chronicles-5.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/heretics-of-dune-dune-chronicles-5.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:26:29 PM"}}
