{"id":85354,"no":24,"title":"Page 24","content":"“Gavin, I’m sorry. I told you… I don’t know what I want. How can I possibly know that when I don’t even know who I am?”\\n\\n I can hear the desperation in my voice and so can he.\\n\\n His face softens a bit in reaction.\\n\\n “Gav, I told you this on the boat the other day. I said that I was afraid to pursue this because I never want to lose you. And you said that it wouldn’t matter—that I would never lose you, no matter what.”\\n\\n Now his eyes are really soft as he looks down at me.\\n\\n “So, you don’t want to lose me… but you don’t know that you want me, either?”\\n\\n My heart hurts at his words.\\n\\n Like, it literally hurts.\\n\\n “I don’t know what to say, Gavin,” I tell him. “I know that I love you in some way. I know that you are sexy as hell and you make me laugh and you know me like no one else does. I know that I love being with you—I love laughing with you and swimming with you and kissing you. But something seems to be holding me back and I don’t know what it is.”\\n\\n I’m crying now. I feel the tears streaking down my face and Gavin moves to wipe them away. I lean into his hand and he cups my cheek.\\n\\n “Let me know when you figure it out,” he says softly.\\n\\n And then he leaves me by the pool.\\n\\n Alone.\\n\\n I am stunned.\\n\\n Gavin, easy-going, always laughing, always ready Gavin, just left me alone because I hurt him.\\n\\n And I definitely didn’t mean to.\\n\\n Yet I did.\\n\\n And now my heart seriously hurts.\\n\\n I sink to my knees by the water and cry. Anyone who ever thought I’m a bad ass should see me right now, because I cry until my lungs hurt. The ugly kind of cry, too. Not the pretty, delicate sniff-into-a-tissue cry. Oh, no. I’m crying the dreaded gut-wrenching, mascara-ruining ugly cry.\\n\\n And I don’t care.\\n\\n I don’t even care when I hear someone behind me.\\n\\n “I need a minute,” I call out, sniffing into my hand. I don’t have a tissue, so I wipe my snotty nose on my hand. Gross, but necessary.\\n\\n “Are you alright?”\\n\\n Quinn’s husky voice is quiet in the dark.\\n\\n I freeze. I know I look like some sort of monster with black-rimmed swollen eyes and a runny nose. But worse than that, I don’t want him to see me this way—sad and broken. Not when he thinks I’m some sort of bad-ass. And especially not when I’m crying because I don’t know what my heart wants. How pathetic is that??\\n\\n “I’m fine,” I tell him without lifting my head.\\n\\n There is more rustling behind me. And then I feel his hand on my back. It’s warm and large and comforting.\\n\\n “You don’t seem fine,” he says softly.\\n\\n “I’m not,” I admit limply. I look up now, knowing full well that he will see me in all of my raccoon-eyed glory. But he doesn’t even flinch. He’s just staring at me with the most concerned look.\\n\\n “What’s wrong?” he asks simply. “Can I help?”\\n\\n I swallow.\\n\\n “I don’t know,” I tell him. “Can you fix the holes in my memory so that I know what I want?”\\n\\n Quinn stares at me. He’s serious and calm and thoughtful as he tries to decide what to say. Finally, his lips move. I know this because I’m staring at them.\\n\\n “No, I can’t fix your memory,” he tells me as he scoots closer to me. “But who cares? You don’t need your memory to figure out what you want.”\\n\\n I snort, then remember too late that my nose is gunky and runny. I sound like a snotted up pig. I blush, but he doesn’t seem to notice.\\n\\n “You don’t,” he insists. “You know who you are even if you don’t remember it.”\\n\\n “That’s what Reece said,” I mutter. “But it’s easy to say when you’re not the one who is clueless.”\\n\\n “Oh, I’m clueless,” he nods. “Trust me. Or you can just ask Reece. She can tell you. I’m very, very clueless about many, many things.”\\n\\n I smile now, even through my snot.\\n\\n “Why are you here?” I ask curiously. “How did you know I was out here?”\\n\\n Quinn shakes his head. “It wasn’t hard. When you ran out of the room chasing Gavin, I didn’t think it was going to end well.”\\n\\n I’m still now.\\n\\n The night is cool against my skin and my heart beats hard against my ribs. It’s so quiet out here that I can almost hear it.\\n\\n “You knew I was chasing Gavin? And you still came after me?”\\n\\n Quinn nods slowly.\\n\\n “How did you know that it wasn’t going to end well?”\\n\\n Quinn rocks back on his heels and he stares at the pool thoughtfully.\\n\\n “I just knew. Gut instinct.”\\n\\n “So you came after me.”\\n\\n I’m stunned by this. What kind of boy would come after me when he knew that I was chasing another guy? Clearly, one who is self-confident. And Quinn is that. And clearly, a boy who is caring and kind. And Quinn is that, too.\\n\\n But still.\\n\\n Holy Whoa. How amazing is he?\\n\\n “Thank you for not pressuring me,” I tell him randomly. I feel so tired and drained. And I’m just so thankful for his presence. So I tell him that.\\n\\n He smiles.\\n\\n “You’re welcome. And I’m not going to pressure you. Do I think you’re cute as hell and twice as sexy? Yes. I do. Do I love your sassy-ass sense of humor? Yep. That too. But I’m going to wait until you realize that you like me, too. I might be clueless about many, many things, but even I know that I can’t make someone like me. If someone likes you, they’ll realize it. And then it will be worth the wait.”\\n\\n “You think I’m worth the wait?”\\n\\n I’m whispering now. I don’t know why because we’re all alone in the moonlight. Quinn smiles his sexy lop-sided, knee-weakening grin.\\n\\n “Yes. I do.”\\n\\n “You seem so confident that my mixed up head is going to decide that you’re the one for me.” I state this calmly as if this conversation wasn’t insanely ridiculous. I’m sitting here with a gorgeous American cowboy discussing the fact that I don’t know if I like him. Is this even happening? Ohmygosh.\\n\\n “Oh, your mixed up head will definitely decide that,” Quinn answers with a grin. Then he winks. “Because it’s the right choice.”\\n\\n Then he grabs my hand, completely ignoring the fact that I’ve been wiping my nose with it. He pulls me to my feet.\\n\\n “Will you dance with me?”\\n\\n I look at him uncertainly.\\n\\n “I don’t really want to go back inside. I’m a mess. And I don’t want to see Gavin right now.”\\n\\n “That’s fine,” Quinn assures me. “I meant right here. We can hear the music from here. And it’s sexier to dance under the stars, anyway.”\\n\\n Quinn McKeyen can’t get any sexier. I decide that in this instant. He pulls me to his tuxedoed chest and I rest my cheek against his satin lapel. His strong arms close around me and we sway together in the light of the moon.\\n\\n My heart pounds.\\n\\n He is so, so sexy.\\n\\n And patient.\\n\\n And strong.\\n\\n And amazing.\\n\\n I sigh.\\n\\n He’s got quite a long list of good traits.\\n\\n I melt into him and let him hold me. And we dance, swaying together under the twinkling stars. We dance through the next several songs. Then we sit and chat by the pool. And then we dance some more.\\n\\n And honestly, by the end of the evening, even in spite of the whole crumbling-into-a-sobbing-heap thing, I can say it’s been the best benefit event I ever remember attending at the Old Palace.\\n\\n I know that doesn’t say a lot considering that my memory has holes in it.\\n\\n But still.\\n\\n I wake up to a knock on my bedroom door.\\n\\n I growl and cover my head with my pillow. After not getting home until 2:00a.m, there is no way that I’m getting out of bed at 8:00.\\n\\n Not.\\n\\n Gonna.\\n\\n Happen.\\n\\n I bury my head deep under my pillows and squeeze my eyes shut.\\n\\n But whoever it is won’t give up. They knock again and again.\\n\\n And then finally, they get tired of knocking.\\n\\n My door opens.\\n\\n And Quinn is standing there. He looks breathtakingly sexy and fills up my entire doorframe. He’s wearing old jeans that fit him exactly right, his cowboy boots and a blue faded button up shirt. The shirt looks soft and worn and it hugs his chest.\\n\\n I peer out from under my pillows to get a better look.\\n\\n He grins at me.\\n\\n “Why are you so early???” I groan, flipping onto my back and staring at him. “And so cheerful already? Plus, you’re dressed and everything. Ugh.”\\n\\n He raises an eyebrow as he approaches the bed. I only just now notice that he’s carrying two cups.\\n\\n “Would you prefer that I wasn’t dressed?” he asks innocently. He holds out a cup. “I come bearing gifts. Coffee with one shot of espresso plus enough cream and sugar to make cake batter.”\\n\\n I stare at him now as I sit up.\\n\\n “How did you know how I like my coffee? Stalk much?”\\n\\n Quinn laughs and I decide that I might want to marry his laugh. It’s just that sexy.\\n\\n “I don’t stalk you, tiny tot. I don’t have to. I know you’ll come to me someday. I asked Marietta how you take your coffee. And then she made it. So if it sucks, don’t blame me.”\\n\\n I smile and roll my eyes.\\n\\n Marietta might have made it, but Quinn brought it to me. And that’s pretty dang sweet. But I don’t say that.\\n\\n Instead, I take a sip of the nectar of the gods and stare at him over the cup.\\n\\n “So, what’s the occasion? Why have you come bearing gifts?”\\n\\n Quinn perches himself on the edge of my bed. And no, the fact doesn’t escape me that now Quinn is technically in my bed. With me. And I’m half naked.\\n\\n My heart flutters again.\\n\\n Down girl, I silently tell it. Then I return my attention to Quinn, waiting for an answer.\\n\\n “I want to continue with your riding lessons. And I figured you’d need some coffee to wake up.”\\n\\n I’m already shaking my head.\\n\\n “Oh, no. I don’t get up this early. The old me didn’t and the new me doesn’t either. And neither one of us is getting up this early to go riding on a gigantic demon. Nope. Not gonna happen.”\\n\\n I am up and dressed five minutes later.\\n\\n Hey, don’t judge.\\n\\n Quinn can be pretty compelling while sitting on the side of my bed smiling at me.\\n\\n Okay, fine.\\n\\n I’m weak. Weak, weak, weak. Quinn’s cocky grin does that to me.\\n\\n But I admit it, so that’s something, right?\\n\\n Right before I duck out the door to meet Quinn outdoors, I text Gavin.\\n\\n I’m really sorry about last night. I hope you can forgive me. I hate that you’re upset.\\n\\n There’s no immediate answer. And I leave my phone in my room.\\n\\n Quinn is already waiting for me outside. And now he’s wearing his cowboy hat which only makes him even sexier.\\n\\n “Hey tiny tot,” he greets me. “I have something for you.”\\n\\n And he hands me a pale pink cowboy hat.\\n\\n No. Lie.\\n\\n I laugh as I take it and shove it onto my head.\\n\\n “Where in Caberra did you find a cowboy hat?”\\n\\n He grins. “There’s a woman in town who makes straw hats. I showed her mine and asked her to make a smaller one for you. In pink. She did a good job.” \\n\\n","sourceLink":"https://allnovel.net/mia-s-heart/page-24.html","bookId":2762,"book":{"id":2762,"title":"Mia\u0027s Heart","description":"Storyline: Mia\u0027s Heart (The Paradise Diaries #2) \\n My name is Mia Giannis. \\n I am seventeen years old. \\n I live in Valese, Caberra. \\n This has become my mantra and my lifeline, having recently lost my memory due to a scary natural disaster. \\n Yeah. I have amnesia. Messed up, right? \\n You don\u0027t know the half of it. \\n Not remembering anything has turned my world upside down. My parents try their hardest to “remind” me of who I was, but it doesn\u0027t feel right. Or, if what they\u0027re saying is true and that really was me, I\u0027m not sure I like that person very much. \\n And then there’s my love life. Apparently, Gavin Ariastasis is my oldest and best friend in the world. Also, apparently, we’ve never dated. But now, noticing him for what feels like the first time, he’s making my heart do somersaults. He knows me inside and out—the real me. Plus, he’s sexy and charming as hell. Sounds perfect, right? \\n But then... there’s the new guy. Quinn McKeyen – tall, gorgeous and deliciously American. His mischievous grin and slow Midwestern drawl turn my insides to mush in two seconds flat making me question who I really am and what I really want. \\n Seriously. What am I supposed to do with all that?! I feel torn between them, but I barely even know who I am, let alone what I want. \\n I just hope my indecisive heart will clue me in. And sooner rather than later…before I lose what little of my mind that I have left.\\n","cover":"https://allnovel.net/images/mia-s-heart.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mia-s-heart.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:05:34 PM"}}
