{"id":29121,"no":14,"title":"Chapter 14","content":"With the advent of visitors the professor\u0027s house became the centre of gayety in the quadrangle. The women of the other households were glad to show friendliness to the young girl, in whom they felt a warm interest, but who had seemed in her content to need no one. Visits and invitations, drives and supper parties transformed the quiet household. The professor made one stand for himself. Susan had asked for a scullion and named a boy, who was promptly engaged. \"And, Susan,\" the professor had commanded, \"see that he keeps a good fire in the parlor; show every one who calls in there. Leave the library undisturbed.\" \"I must have some peace!\" added the professor to himself, who found this whirl a trial, but endured it for Frances\u0027 sake. For Frances seemed to thoroughly enjoy this[Pg 184] dispensing of hospitality; she planned gayeties far ahead. She accepted and returned the invitations from their neighbors. She spent hours in the kitchen while her guests were dispatched on pleasures, and fought Susan\u0027s wrath for each of those hours. There was no idle moment when accusing thoughts might sting, or when some seeker for such opportunity would find her alone. Lawson, he scarcely knew how, was made the special attendant of the visitors; and though he was restless and chafing, and keenly watchful for his chances, he yet enjoyed the gay expeditions and the presence of the pretty, fun-loving young women. Montague, when he came, was warmly welcomed and made one of them; but it was a busy season on the farm; he was kept away enough to have something of the feeling of an outsider and to see the things one from the outside sees. He was vaguely conscious of a troubled atmosphere, and he saw, too, what no one else did, that there was a feverish restlessness about Frances and a constant guarded effort at control. His [Pg 185]instinctive thought of her warned him that in spite of her apparent blitheness she needed befriending. He was constantly alert for her, constantly watchful. Whenever he was with them Frances felt, somehow, helped and more at peace with herself. So for the allotted time of the visit. The days had nearly sped by when Frances found the professor one morning gathering up his books and papers for the day\u0027s lectures. The contrast between the quiet room, lined with bookshelves, the grave, scholarly man standing there by the paper-littered table, and the room across the hall, from which floated the sound of chatter and laughter, smote the professor\u0027s daughter keenly. \"Does all this visiting and calling and confusion bother you?\" she asked, as she slipped her hand through his arm and ran her soft palm childishly up and down the heavy wool of his sleeve. \"Not at all!\" The professor looked lovingly into the eyes of his daughter, who was as tall as he was. [Pg 186] \"Because,\" she went on whimsically, \"they are going to stay longer!\" She made a pretence of holding her breath. The professor thought of the loved quiet of his home and the still more loved comradeship of his daughter, and was silent. \"I don\u0027t think it\u0027s altogether on my account,\" added Frances demurely. The professor chuckled. \"I don\u0027t think it is!\" he replied. \"They are enjoying their visit.\" \"So it seems!\" And then, after a short silence, \"Are you enjoying it also?\" \"I? Of course!\" \"Then it\u0027s all right!\" He slipped a rubber band about his papers and laid them on his books. \"I drove out to young Montague\u0027s yesterday,\" he said to his daughter, standing idly before the fire. Frances had found so few moments alone with her father lately that she was making the most of these. \"It\u0027s dreary out there,\" the professor complained; \"these winter days are going to be hard for him.\" [Pg 187] \"Don\u0027t worry! I\u0027ve never seen a man less inclined to be doleful!\" \"Do you think so,\" said the professor eagerly, \"now, lately he hasn\u0027t seemed so—so bright as he used to be. I thought perhaps he was finding it lonely. He is an excellent farmer, do you know,\" he said with sudden enthusiasm, \"he has sold enough wood off the place to pay half of the cost of it.\" \"Oh! what a pity!\" \"Pity!\" \"The hills will look so bare; I shall always remember the beautiful forest sweeping up to the mountain tops.\" \"Oh! the wood will be cut far up the range and there is enough about there for the country not to suffer for the want of it. We went over it together.\" \"Then I know it is all right!\" teased Frances. \"He\u0027s working too hard,\" the professor went on, keeping to the topic in which he was so keenly interested. \"You know this is a busy season; after a[Pg 188] while he can rest. You know what you often say, winter is the farmer\u0027s holiday.\" \"Yes, but shut up out there! I must send him some books.\" Frances watched in amusement as her father went to the shelves where his light literature was kept. \"Pope\u0027s Iliad,\" he said thoughtfully, \"read it in the original of course; Herodotus, I wonder how much Greek he knows; Carlyle, hm! Drummond, that will make him think at least—What?\" for Frances was leaning against his shoulder and was laughing. \"What do you like yourself when you are idle or half sick, when there\u0027s a good hot fire to read and dream before?\" The professor reddened with conscience-stricken remembrance of a pile of paper-bound novels in the attic. \"Get him something yourself, then!\" \"I will!\" \"I dare say he will like it better,\" retorted her father, who, blind to Lawson\u0027s attentions, had begun to suspicion Montague\u0027s, and to think with a half-pleased apprehension that[Pg 189] it might be a desirable thing for some far-off day. Frances was about to answer when the bell rang insistently. \"Good Lord!\" groaned the professor. \"I don\u0027t think it is a visitor,\" soothed Frances. \"What is it, Susan?\" The old woman came briskly into the room. \"I dunno! Some sassy niggah jes\u0027 poked dis box at me an\u0027 run off.\" Susan was always ready to find fault with the manners of the rising generation; she put the box down gingerly just on the professor\u0027s papers. \"Here!\" he snatched it up and set it forcibly on the hearth. \"Flowers! And the thing is wet!\" Frances, delighted, knelt by the box. \"Miss Frances Holloway,\" she read; \"give me your knife! Oh!\" for the top wrenched off disclosed a sheaf of chrysanthemums, white and yellow, and a card, \"Mr. Frank Lawson.\" \"They are for all, of course!\" she filled her arms with them and got to her feet. \"Take this box in the kitchen, Susan.\" [Pg 190] \"Wait!\" her father called, \"what are you going to do to-day?\" \"We are going shopping in the morning, and there is a tally-ho party to Monticello this afternoon.\" \"You are going?\" \"This morning.\" \"And this afternoon?\" \"I scarcely think I shall go. I have been up to Monticello so often, and I think I\u0027ll stay at home and make a cake.\" \"Why don\u0027t you go, Frances?\" her father protested. \"It will be a chocolate cake,\" she was laughing at him over the sheaf of chrysanthemums, \"and you shall have all you want!\" And the professor was disarmed. Some one else had noticed this same tendency of housekeeping. When Frances was busily beating eggs in the kitchen, the bell rang. She went on with her work without a thought of visitors, for the tally-ho party was large and included all their friends, the younger ones at least. Susan had gone on an errand, and the boy, [Pg 191]hurrying carelessly through kitchen and dining-room and library, left each door open as he went through. \"T\u0027aint no one home but Miss Frances,\" he said to the young man on the door-step, \"and she\u0027s busy in the kitchen.\" The young man went past him into the library; through the doors he glimpsed Frances, back towards him. He stepped out of the line of vision, \"Very well!\" he said in a low tone to the boy gaping in the doorway, \"you need not tell her; I\u0027ll announce myself!\" The boy, green, untrained, as Lawson knew him to be, hastened on through the back door of the hall to his work at the woodpile. Lawson trod softly across the rooms. The swift beater in Frances\u0027 hands deafened her ears to other sounds. He came close behind her, and spoke her name before she knew the warm sunny kitchen held any but herself. She went white to the lips with fright. \"How dare you?\" she cried. Lawson had thought of some flattering[Pg 192] speech to appease her; instead his anger flared as hot as hers. \"Did you not know I would dare anything?\" The piteous red flushing over the pallor of cheek and forehead told him the shot had told brutally. \"Did you not know I would dare anything to see you?\" He pleaded conscience stricken at his blunder. \"I asked you, I told you, the night you came home, to give me an opportunity to—to see you.\" \"You have!\" she flashed, anger once more coming to her aid. \"You know what I meant, not with a crowd about you, but when I—I—you have made a hedge of your visitors,\" he accused. It was exactly what she had done, and done wilfully. \"You knew I longed to see you.\" Frances rolled down her shirt-sleeves and buttoned them coolly. \"Will you walk into the library?\" she asked icily. \"No!\" \"I did not know you were fond of the kitchen. Have this chair,\" pulling Susan\u0027s low flag chair beside the window. [Pg 193] Lawson took it from her. His eyes were red with wrath, but Frances took no heed. \"Does it remind you of home?\" went on the young woman sarcastically. \"God forbid!\" he blurted, with a flashing memory of the chef presiding there in the kitchen. The calm was coming back to Frances\u0027 manner; she felt herself yet mistress. \"Sit down; I will show you what a Virginia kitchen is like. I\u0027ll bake you a cake,\" she added, with a saucy air, for all the fear that was tugging at her heart, \"if you are a good boy.\" \"I was never good!\" he blazed. \"No,\" thoughtfully; \"well, it\u0027s good to be truthful. I\u0027ll give you a cake for that.\" \"I want none of your cakes!\" Frances opened wide her innocent-seeming eyes, though her lip trembled. \"I want you!\" She leaned back against the table\u0027s edge as he came close to her. She clenched her hands, striving for the hot words she wanted, which would not come. [Pg 194] \"I love you; you know it—\" Her eyes flashed blazing denial. \"Will you marry me?\" For one instant heart and pulse stopped. \"Marry him—marry him—\" All her fancies and conclusions were whirling in her brain; flirtations, of which she had accused him, were not apt to go so far. \"You know how I love you, long for you. Why have you kept this distance between us, Frances?\" He put his hands on her shoulders and looked down into her drooping face. \"You will be my wife?\" but at that word a sudden swift memory smote him icy cold and speechless. Frances looking shyly up thought it anxiety for her answer. Into the gray eyes came stealing, flashing, the look he had dreamed of, had resolved to kindle there and read, himself glorified as he read. With a sob in his breath he caught her to him. \"Frances,\" he began hurriedly, soon as speech would come, \"there is something I must tell you now, you must know—\" but Frances, covered with confusion, was pulling away from him. She had heard[Pg 195] Susan\u0027s step outside, \"Susan is coming,\" she panted. Lawson gave her one passionate look, that hardened into triumphant love as he gazed deep into her eyes. \"So be it,\" he said within himself; \"I accept!\" He slipped through the doors, closing them as he went. When Susan came into the kitchen he was softly shutting the outer one. He went triumphant. For one instant the joy of possession had fought with a deeper and higher love, but desire had won.","sourceLink":"http://novel.tingroom.com/ertong/2276/63864.html","bookId":593,"book":{"id":593,"title":"A Girl of Virginia","description":"简介： Good morning! The voice was cheery, insistent. It brought the young girl on the porch above to the white wooden rail about its edge.Good morning! she called back lightly....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2276","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
