{"id":29123,"no":16,"title":"Chapter 16","content":"When Frances drove from the station, for the first time in all her healthy young life she found herself dreading the day which stretched before her. She tied Starlight outside the quadrangle and walked up the corridor slowly. Every window of her house was opened wide. Susan, beturbanned, met her at the door. \"Honey,\" she said, \"don\u0027t yuh want to go in yo\u0027 room dis damp day an\u0027 res\u0027 yo\u0027self?\" Frances gave a little shiver at the idea of being shut in her room all the morning. Her expression was answer sufficient. \"Den yuh bettah dribe in town an\u0027 git sumpin\u0027 to eat; we\u0027s cleaned clar out.\" \"What do you want?\" asked Frances, glad of the errand. \"Want! Yuh jes\u0027 step in hyar one minute.\" The old woman pointed with [Pg 210]dramatic hand towards the empty shelves, and began a list of all the eatables she could think of. \"We needs \u0027em fur shuah!\" she ended. \"Ise gwine begin my Christmas cake termorrer; Ise jes\u0027 been waiting to git de place clar, an\u0027 I tell yuh fer a fac\u0027 I wants dis house all to myself dis one mornin\u0027. Ise tiahed o\u0027 dried-up flowers an\u0027 empty boxes an\u0027—an\u0027—sich! Honey,\" she wheedled, \"if yuh gits through early, yuh might go visitin\u0027.\" Frances was laughing at Susan\u0027s earnestness, when she went out again. There was nothing in the day, though the mist dripped from shrub and tree and bespangled the grass and veiled the mountains, to foster heartache. The streets were filled with carriages, mud-splashed and encrusted, the horses red with clay above their fetlocks. The stores were bright with holly and cedar. Before the grocers\u0027 shops were coops of turkeys and strings of hams and barrels of oysters. The confectioners\u0027 windows were piled high with oranges and dates and nuts and raisins and candies. The dry-goods[Pg 211] windows showed alluring furs and coats and breadths of cloth. Waiting at the curb was a string of carriages, their occupants calling gay greetings from one to another. Frances pulling close into the press felt herself one of the Christmas crowd. A shopper stopped at her wheel for a word or two; the busy clerk, when he at last found time for her order, had a ready jest: there was store after store to be visited. Frances felt the cheer of the blessed commonplaces. She was as bright as any of the crowd. Her cheeks were reddened with the soft damp air, her hair curled rebelliously about her forehead under the brim of her big hat. It was long past noon when she turned homeward. She went slowly. The crush of carriage and cart, of farm wagons loaded with cedar and holly, and ox-carts piled with cord-wood, demanded careful driving. She was nearly out of the shopping district when she heard her father call her. \"I thought you were at home,\" she called back. \"And I thought you were there.\" [Pg 212] \"You can drive up with me.\" She pulled as close to the curb as she could. \"I don\u0027t know; Edward is in here,\" pointing to the store before which he stood. \"What have you been doing?\" The professor flushed with a guilty knowledge of the Greek cameo in his pocket. \"Oh, I have been helping him select some Christmas presents. He\u0027s going home, you know, for the holidays. Here he is now. Can\u0027t you go out with us?\" asked the professor, soon as the young man had greeted Frances. \"I am afraid I ought not.\" \"I\u0027ll drive you up by the stables,\" suggested Frances. \"I wish you would. Have you time to see my new horse?\" he asked, as Frances drove slowly and skilfully along the crowded street. \"I didn\u0027t know you had a new horse.\" \"No? I have been intending to ride her in when you could see her, but you have had so little time—\" \"But I have time now,\" said the young woman, enthusiastically, as she stopped [Pg 213]before the stables. \"Can\u0027t we go in and see her?\" to her father. \"Certainly.\" The young man put his mare through her paces up and down the stable aisle. \"I want you to ride her some time,\" he declared, as Frances waxed eloquent over the horse\u0027s slender head and liquid eyes and shapely legs. \"When can you bring her in? She\u0027s a beauty! I\u0027d like to ride her now.\" \"Shall I put your saddle on?\" questioned Mr. Carver, who stood with the group admiring the animal. \"I am afraid Mr. Montague has not time,\" faltered Frances. Edward had one fleeting vision of the work awaiting him, then he put it out of his mind. \"Certainly,\" he said, \"if you will allow me to reconsider. I will go out with you, and Mr. Carver can send the horse to the house.\" \"Oh!\" said Frances, softly. \"You had better go with her,\" declared the professor, who was never quite sure of his daughter when it was a question of horses. \"Can\u0027t you ride Starlight?\" [Pg 214] Montague\u0027s eyes were questioning Frances\u0027 face; he saw the quick look of pleasure, as she cried, \"I shall be delighted.\" They went up the long street together. As they crossed the high bridge above the railroad, there was to each of the young people a quick unwelcome memory. Frances recalled a young man\u0027s debonair manner as he made his adieux that morning, and Edward had a swift remembrance of the still, frosty morning when he stood there, unconscious, and watched the glittering coaches slipping away, Frances in one of them; and he thought of all the tangle since. Frances had wondered with secret amusement what Susan would say to the guest. The old darkey was the soul of affability. The house was in its regular, quiet order, and was spotless. She waited on the table, brisk good humor in every movement. The boy was out of sight. Soon as the dinner was over she asked \"Marse Robert\" to step into the kitchen. \"I done discharged dat boy,\" she announced briefly. [Pg 215] \"Why, Susan, what was the matter?\" the professor asked carelessly. \"I got no need o\u0027 him nohow, an\u0027 Ise tiahed o\u0027 his sass, an\u0027 Ise tiahed o\u0027 seeing so many folks aroun\u0027.\" The professor secretly agreed with her. \"He wants his money,\" went on the old darkey, shamefacedly. \"He \u0027low as how he\u0027s comin\u0027 back dis ebenin\u0027.\" \"All right. How much is it?\" Susan named a sum, and the professor handed it to her, and hurried on into the library. He had had no such opportunity for days for a talk with Montague, but he found that young man so inattentive a listener that he was not sorry when Frances pulled aside the portière and called that she was ready and the horse was there. Frosts and rains had made the roads rough, but here and there by wayside path or sandy stretch, the mare showed her gait, swift and smooth. It was a beautiful world through which they rode, the mists closing about them shutting in the distant peaks and clinging to the bare fields\u0027 breast and [Pg 216]condensing in jewelled drops on fence and bush and dried brown grasses; and the exhilaration of movement, the comfort of thoughtful, watchful companionship which roused no hateful mood, cheered the young girl to forgetfulness of all else. But there was the next day for remembrance, when the rain shut her in, and the storm lashed along the mountains and beat across the quadrangle; and the next, when the clouds held sullen guard over the hill-tops. Three days had gone by, and Lawson had not returned. It was the evening of that third day that, sitting in her old chair before the library fire, while her father was reading absorbedly not far away, Frances heard the bell ring sharply. She did not know that every nerve in her was tense as she heard the voice in the hall when Susan opened the door. \"Mr. Lawson,\" said Susan, coming into the room; \"he walked straight on into the parlor.\" Frances kept her face turned away; she felt the hot flush there, as she got to her feet[Pg 217] and pulled her fleecy scarf about her bare neck. There was a strange feeling of suffocation in her throat, but she set her lips firmly and held her head high as she walked across the hall, her gown rustling about her. \"Frances!\" Lawson sprang to meet her as the portière dropped behind her. What she saw in his face and what she felt in her own heart held her speechless, but to Lawson it looked adorable confusion,—the warm flush and lowered lids, and red, proud mouth. \"Frances!\" He strode across to her and would have put his arms about her, but that she shrank back. His eyes showed quick amusement. He loved her a hundred times better so, with all her changeableness; he was never quite sure of her or of her mood. \"You do not know how I have longed to see you,\" he whispered. Her eyelids fluttered up, he had one searching look from darkened eyes, and then he knew he must make his peace. [Pg 218] \"In Richmond,\" he began—\"but you are not going to stand here?\" He stood aside as she went past him, her scarlet skirt swishing against his feet, and he watched her with a delight he would not let her know for worlds. So she was angry! He followed her and leaned against the mantel. She, too, was standing, as if to intimate that what he had to say were best said quickly. \"In Richmond,\" he began again, and hastened on, \"I didn\u0027t see—you don\u0027t know what I wished for you,\"—he would act as if there were no possible shadow between them,—\"I searched the stores and searched. I went to Washington—\" Surely this were explanation enough, though he had a swift and guilty remembrance of the one brief day in Washington, of the theatre party and the supper at the Jefferson when he came back to Richmond that night, which Elizabeth Martin had been so quick to arrange at his invitation and to promise not to write of, and then of the german next night. They had trusted to Frances not hearing, and she had not, nor ever did. [Pg 219] He drew from a pocket of the overcoat he still had on, a satin case and laid it on the table, watching Frances with keen delighted eyes. The mouth was drooping a little now, the cheek paling, there was even a suspicion of tears about the lowered lids. \"Are you not going to look?\" he asked softly as he touched the spring and threw back the lid. Frances scarcely turned her head, though the sparkle under the electric light was magnetic. The young man made a step closer to her, put his hand upon her shoulder as if to turn her face toward the table; but Frances shrank back into the chair close by and hid her face against the cushions. All her anger, her jealousy, were but a part of her own wretched self, and he was innocent, her generous heart accused; she was shamed to the quick. But Lawson had no key to this. He was genuinely frightened, and quick as the fear was the old ungovernable will to win. He knelt by her, striving to pull her hands from[Pg 220] her face, whispering all the endearing words he could muster. He cursed his folly and the insanity that had beset him. He knew, why had he ever thought of it lightly, that she was the one thing the world held for him desirable. He was wild with fear. He would try one other way. \"Frances,\" he pleaded finally, as he got to his feet, \"if you do not look at me, speak to me, I shall—I shall know you do not wish to at all,\" his voice was as firm as he could command it. And Frances stumbling to her feet with face averted, held out her hands. It was many minutes later that he began to talk to her of the jewels. They were magnificent. Frances\u0027 simplicity was affrighted. It was a part of his composite nature to remember her with passionate devotion while he was outwardly forgetful and to search for the finest gems he could find. \"I can never wear them,\" faltered Frances. \"But you will, and many others,\" he assured, as he went on ardently to tell her of[Pg 221] all he should do for her, not obtruding his wealth, yet not losing sight of it; but when he was done he was astonished at Frances\u0027 answer. She was looking at something in her own heart and striving to show it to him. \"Do you know,\" she began falteringly, \"there is something I must tell you. You must be quite sure—you may think you do, but you must be sure you—you\"—the voice sank very low—\"you love me!\" \"Love you,\" pleaded Lawson, \"there are no words to tell you how I do!\" and there were none for the depth and height of the love he felt then as he looked into her wistful eyes. \"But I am afraid I am unreasonable—or—or— Let me tell you,\" her voice was distinct and decided now. \"I cannot stand a half-hearted devotion, a devotion to be shared with—\"—\"every pretty face\" her heart said, but her lips—\"with any one. Better nothing at all. Don\u0027t offer it to me!\" She was speaking wildly, perhaps, remembering some things. \"A man\u0027s whole love I should demand, pure, sincere, unshared, or nothing.[Pg 222] I—\" she faltered, seeing Lawson had grown white to the lips. \"I love you!\" he said hoarsely. \"Yes, now,\" the girl insisted; \"but a year from now—ten?\" Lawson turned away, strode back to her and looked questioningly, sternly, into her eyes. Even in her excitement she knew he was white as his shirt, that his eyes glowed strangely and his hand as he grasped her arm was cold as ice. She felt herself trembling as she leaned against the mantel, awaiting his words breathlessly. As she had appealed from the depths of her being, so she expected the truth from his. Were he given to wavering it were better, it were the only manly thing to do, to tell her even now and free her. She could live through that. The other were impossible. But he made no answer. She saw his chest heave as a woman\u0027s might in anguish, she saw the set of his face, strong, determined, though the pallor lingered. Then he spoke suddenly. [Pg 223] \"Your father is in there?\" he questioned, motioning across the hall. \"Yes,\" she said, her eyes wide with wonder. \"I am going to speak to him, Frances.\" He took her hands gently, \"I am going to ask him to give you to me.\" This, then, was his answer. Her lips trembled. Lawson looked long and searchingly, saying no other word. He bent, kissed her, almost as if in consecration, and walked with quick step across the room. Frances leaned, shaken with tremulous happiness; she saw the glitter of jewels on the table and smiled happily, she took from its case the hoop of diamonds and ran it on her finger, her eyes too dim to watch its sparkle aright. The others she left untouched. She heard the voices across the hall, and she remembered again, with a shock of sorrow, what this would mean to her father. How could she leave him; how could he let her go? She walked across the room restlessly, she heard a chair pushed back—Lawson\u0027s footstep. A sudden shyness possessed her. Down at the end of the room was another door, opening on the hall behind the stairway, she closed it softly, and stood there hidden as Lawson\u0027s quick step rang across the hall; then she slipped into the dining-room, and pulled aside the portière. Her father\u0027s head was sunken on the table, his arm flung above it. She ran up to him. \"Father,\" she pleaded as she bent over him. But he never moved. \"Father, don\u0027t think I love you less,\" she whispered. He pushed back his chair and faced her. \"Did you know,\" he demanded, \"did you know Lawson was a divorced man?\"","sourceLink":"http://novel.tingroom.com/ertong/2276/63866.html","bookId":593,"book":{"id":593,"title":"A Girl of Virginia","description":"简介： Good morning! The voice was cheery, insistent. It brought the young girl on the porch above to the white wooden rail about its edge.Good morning! she called back lightly....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2276","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
