{"id":29124,"no":17,"title":"Chapter 17","content":"\n \"Divorced!\" She felt herself reeling, hands outstretched before her, feeling for something tangible. \"Divorced!\" \n \n \"My God, I might have known you did not know.\" \n \n \"It\u0027s not true!\" she whispered hoarsely. \n \n \"True!\" repeated the professor with bitter emphasis. \n \n \"Then—why—\" Frances put her hands up to her throat. Her father swept his arm about her and half lifted her into the dining-room and into the kitchen beyond. They would have no scene which that rascal there could look upon—the professor never varied his term again—say no wild words he could hear. The kitchen was deserted, Susan abed. The father put his daughter down in the darkey\u0027s old flag chair beside the stove where the fire yet gleamed. \n \n [Pg 226] \n \n \"God only knows,\" he groaned, \"how it was we never knew it.\" \n \n \"Did he tell you?\" whispered Frances. \n \n \"Yes, he told me,\" grimly, \"he asked me—he said he had your consent, Frances.\" \n \n The girl, white, wide-eyed, nodded her answer. \n \n \"It would have been hard—but you know—you know—\" \n \n She felt for his hand on her shoulder and clasped it, she knew he would do anything he felt would make for her happiness. \n \n \"I had not thought much; I had not even—I had thought—\" he blundered, daring no word of what he had borne dimly in mind. \"How blind I have been! I should have known!\" \n \n There was dead silence between them, only the crackling of the dying fire in the stove. The dark was insupportable. The professor felt for the electric bulb and flashed up the light; it gave him courage. \n \n \"When he first spoke, I was dumbfounded. I asked him if\"—he came back to his daughter\u0027s side. \"He told me\"— Again[Pg 227] the silence. \"Then he began to speak of settlements, settlements! He hesitated along time, and then he said, \u0027You know, I suppose, I am a divorced man!\u0027 I felt—\" He clenched his hands, the veins stood out in his forehead. No need to put the emotion into words. \n \n Frances got to her feet and pushed back her chair. \n \n \"Where are you going?\" \n \n \"To speak to him!\" \n \n \"You shall not!\" \n \n \"I shall!\" She walked past him, drew a glass of water from the spigot above the kitchen sink and drank it. \n \n \"I must!\" she said more gently, \"and, father, you must trust me. No!\" as he made some motion to follow her, \"I shall need no help!\" proudly. \n \n She went in by the door through which she had left, went softly, and Lawson did not hear her. He stood before the fire waiting, all his soul burned and scorched with the agony he had felt when first he faced what, spite of his brave words and courage,[Pg 228] would ever be to his inmost self a stigma—waiting! \n \n For one instant all her heart cried out for him, as she saw the attitude, the droop of his face, unlike the bravado she had sometimes thought too gay. Then she went across to him. \n \n He had not dared to turn. That first look, he knew, would tell him all. He had not dared. She stood near. \"Mr. Lawson.\" Ah, that tone told the tale! He held himself upright and turned to look at her calmly. \n \n \"My father has just told me,\" she began; then, one look into his eyes at the suffering she saw there, \"Why, oh why did you do it?\" she cried, as she flung herself into a chair. \n \n Lawson never touched her, never spoke, though she was sobbing bitterly; but when the sobs quieted, \"Do what?\" he asked coldly. \n \n \"Live this lie!\" she accused hotly, from the shelter of her arms. \n \n \"Lie!\" he strode a step closer. \n \n \"You knew—\" \n \n [Pg 229] \n \n \"I knew every paper reeked with it five years ago—that I could not pick up a sheet without seeing the shameful words. Every man I met home or abroad showed his knowledge of it. It\u0027s been branded on every hour of my life since that cursed day.\" \n \n \"You knew we did not know.\" \n \n \"How should I? Why shouldn\u0027t you?\" \n \n \"You should have told—\" \n \n \"Is it a pleasant tale to tell? No!\" with slow bitterness, \"I should not have told. Then you would have married me, and I—oh God!\" \n \n \"Married you—you, with another wife!\" \n \n \"Wife!\" \n \n \"A woman bearing your name.\" \n \n \"She does!\" sullenly. \n \n \"And I!\" she cried. \"And I?\" \n \n \"You speak as— You! You would have been my legal, loved, idolized wife. Listen, for you shall know! My God, it\u0027s hard enough! I was a fool, young! I had to send for my father to sign my license, and he, he was taken in too. She was beautiful. Her family, her position— Well, all she[Pg 230] wanted was money, and she got it. I paid her enough for my freedom, God knows. She fooled us both.\" \n \n \"Paid her! And she is bearing your name, living on your money!\" \n \n \"It was what she wanted! She got both!\" \n \n \"And you, you loved her!\" \n \n Lawson shrank as if struck. \"It was the passion of a crude idiot!\" he cried. \n \n \"And you tired of her?\" \n \n \"Put it truthfully—she of me, if ever she wanted me!\" \n \n \"You loved her, and you have forgotten her! How do I know,\" blazed Frances, \"that you might not forget me?\" \n \n \"Frances!\" the young man raised his hand, as though to ward off a blow. \n \n \"Forget me—me!\" \n \n \"Frances, you cannot dream, I cannot tell you. She—she wanted only a man to shield herself behind\"—the girl he spoke to could not know what he meant, and he could not dare to make her understand, even to excuse himself—\"and the money for jewels and clothes and fine living and show.\" He could[Pg 231] not tell her of the life that woman led, which might be fast and might be worse. \"I\u0027m no saint, but I could not stand it. She took scant time to show me what she thought. Once—once— \n \n \"I tell you with truth I thought at first that you knew it. I thought every one, wherever I should go, would know. It was a spicy enough scandal for the paper\u0027s headlines; I thought it blazoned everywhere, even if it were five years ago.\" \n \n \"We never read such things,\" said Frances in indignant defence. \n \n \"So I find; but even then, there is always some one ready to speak.\" \n \n \"There was none here.\" \n \n \"So I find,\" he repeated wearily, \"and so all this blunder.\" \n \n \"As to you knowing, Frances,\" he said gently, \"I knew you did not. I tried to tell you once, and then, the opportunity gone, let myself stray in this fool\u0027s paradise.\" It was paradise to him, now the gates were closed. \"I feared your crude views; you will never know the temptation I fought to be silent.\" \n \n [Pg 232] \n \n She started to speak, but he raised his hand deprecatingly. \"Leave me no bitterer words to remember,\" he begged. \"I shall say good-by!\" He spoke with steady dignity. \n \n She held out one hand unsteadily. He took both, and, looking down, they saw the sparkle of his ring on her finger. Without a word she slipped it off and gave it to him. He thrust it into his pocket. \n \n \"The others,\" she whispered. \n \n He snapped the lid and thrust the case after the ring. \n \n \"Good-by!\" he said once more. \"I shall not say I will not see you again. I am not given to heroics. I,\" he spoke bitterly, \"am commonplace, quite. It is likely I shall stay here as if nothing had happened, but this is good-by!\" He raised her hand, kissed it where his ring had been, and was gone. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/2276/63867.html","bookId":593,"book":{"id":593,"title":"A Girl of Virginia","description":"简介： Good morning! The voice was cheery, insistent. It brought the young girl on the porch above to the white wooden rail about its edge.Good morning! she called back lightly....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2276","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
