{"id":29825,"no":13,"title":"CHAPTER XIII THE SECOND CAMPAIGN IN FRANCE","content":"The time was now come when Henry was to make his great effort for the conquest of France. The first necessity was to provide for the safe passage of the army by clearing the Channel of the enemy’s ships. This was done by the Earl of Huntingdon. He met nine ships, which had been hired by the French king from the Republic of Genoa, sank three of them, and captured three more with their admiral and a large sum of money. On July 23rd the army started from Southampton. In addition to one thousand pioneers and other workmen, it numbered twenty-five thousand five hundred and twenty-eight combatants, of whom between sixteen and seventeen thousand were men-at-arms. The transporting fleet consisted of about fifteen hundred ships of all sizes. No attempt was made to oppose the landing of the army. The disaster of Agincourt had so far broken the courage of the French that they had no idea of meeting the English in the field. The plan of campaign seems to have been that the fortified towns should be garrisoned as strongly as possible, and the invading force left to exhaust itself by the effort of taking them. Two or three sieges, as costly to the conquerors as that of110 Harfleur had been, would leave little to be done by way of active operations for the defence of the country. The plan, we shall see, failed of success. Henry was earlier in the field than he had been in the campaign of Agincourt, his army was better furnished for siege operations, he had acquired new experience, and he had the advantage of a more favourable season. Castles and walled towns fell in rapid succession into the hands of the English. Touques, a royal castle, which was the first to be assaulted, offered some resistance. The garrison made a vigorous sally upon the besiegers, and held out for two days against the incessant cannonade with which it was plied. But on August 3rd (the army had landed on the first of the month) it was agreed that if the place were not relieved in six days it should be surrendered. Relieving force indeed there was none, and the scattered garrisons throughout Normandy soon realised the hopelessness of their situation. Damvilliers, Harcourt, Evreux, and other places were surrendered without a struggle. Monstrelet says that the other towns in the duchy were astonished at the facility of the English conquests, and that scarcely any place attempted a defence. And he goes on to give a reason which must have been at least as potent for this result as any demoralisation caused by the remembrance of the English victories. It was due, he says, to the divisions among the nobles, some of whom were for the King and some for the Duke of Burgundy, and each party was in consequence fearful of trusting the other. Moreover, the Constable had drawn off most of the forces in the district to be ready to act against the Duke, who was daily expected with a large army. 111 Not the least important factor in Henry’s success was the admirable order in which he kept his army. All violence and plunder were forbidden. Ecclesiastical persons were put, as might be expected, under a special protection, and to insult or rob one of this privileged class was an offence to be punished with death. To the laity was offered a similar protection if they would own the English king’s authority. This policy, carried out with the unflinching firmness which was one of Henry’s characteristics, at once secured the kindly feeling of the population and made the army a more effective instrument. About the middle of August Henry commenced the siege of Caen. Anticipating that the garrison would destroy the suburbs and so deprive him of the cover by help of which he could approach the town, he sent the Duke of Clarence with a strong force to occupy them. The Duke was just in time to save them from being burnt. Henry’s character for piety may have had something to do in gaining for him another advantage. The French forces had occupied St. Stephen’s Abbey, which lay outside the town. On the approach of the English they resolved to destroy it. The monks, on the other hand, were bent on saving it; and they did so by secretly introducing an English force. On the King’s arrival before the town, an attempt was made to carry it by assault. The storming parties were repulsed with heavy loss. Henry then set his engineers to work. Mines were carried up to the walls, which were also battered by the cannon. When all was ready for an assault, he offered terms to the garrison. They were refused. The next morning the assault was112 delivered, every detail of the operation having been first carefully arranged by the King. It was completely successful, the attacking parties making their way into the town on both sides, and this without any great loss. From first to last the siege did not cost the English more than five hundred men, a number which contrasts strongly with the almost disastrous expense that had attended the capture of Harfleur. Henry, after duly returning thanks in the cathedral, proceeded to deal with the conquered town. The castle, which still held out, was admitted to surrender on certain conditions if not relieved in twelve days’ time. The inhabitants generally were mercifully treated. Indeed Henry’s conduct so raised his reputation for clemency that many neighbouring towns at once offered to capitulate. As usual, however, nothing was allowed to interfere with military policy. Caen was to be made a garrison, and accordingly fifteen hundred “women and impotent people, who were unserviceable and useless,” were sent out of it. After the fall of Caen, Lisieux, Alen?on, and many other places capitulated without making any attempt at resistance. A more important gain than the possession of any city or fortress was the adherence of the Duke of Britanny. On October 27th this Prince came under safe-conduct to a conference with Henry. The terms of their agreement were not precisely known; but it was certain that a truce was made which was to be in force till the following Michaelmas. It was also reported that the Duke kneeled to the King as to his suzerain, and offered to hold Britanny as a fief under the English crown, or rather the French crown as now united with that of England. Falaise, which was surrendered113 on January 2nd, was the last conquest of the year 1417. The castle did not capitulate until six weeks later. It would be unnecessary to relate in detail the military operations that now followed in uninterrupted succession. During the first weeks of the new year (1417–18) Henry was active in the field, and though, with the devoutness which so strongly characterised him, he spent Lent in strict retirement, his brothers were busily employed. The great successes of the year were won at Cherbourg and Rouen. Cherbourg was taken by the Duke of Gloucester, aided by a force which the King had ordered to be despatched from some of the western harbours of England. The mere sight of its approach is said to have determined the surrender of the garrison. The siege of Rouen was one of the most important operations of the war, and as it was carried on throughout under Henry’s superintendence it demands a more particular notice. In May the King left Bayeux and marched up the southern bank of the Seine. His first object was to possess himself of the strong position of Pont de l’Arche, situate about eight miles above Rouen, and commonly called the Key of the River. The bridge itself was held by the French in such strength that it could not have been forced without a great sacrifice of men. Henry accordingly marched some three miles lower down the stream to a place where it was divided by an island. The French followed him. While their attention was distracted by a feint (one of the ingenious stratagems with which great commanders are so ready), the island was occupied by a small force of English gunners. A114 cannonade drove away the troops that had been left to guard the passage, and some thousands of men then crossed without meeting any resistance. Henry now held both banks of the Seine. He constructed a bridge of boats to join his two camps, and in about three weeks’ time received the capitulation of Pont de l’Arche. Leaving a considerable garrison in it, he proceeded to invest Rouen, which was now practically isolated from the rest of France. It was a great, and, considering the strength of the place, even a perilous enterprise. But success would be of inestimable value: the possession of Rouen would mean the acquisition of Normandy. The place was very strong. It lay, not, as now, on both sides of the river, always a circumstance adverse to effective defence, but wholly on the northern side. The walls were high and strong, and well supplied with artillery, with cannons of a size then unusual, and with catapults, an engine of war which the invention of gunpowder had not yet driven out of use. The garrison again was unusually large. There was a local militia numbering at least fifteen thousand men, and a force of not less than seven thousand regular troops and artillerymen. On the other hand, the provisioning of so large a force would in any circumstances have been a matter of difficulty. As it was, this difficulty was enormously increased by circumstances which Henry had doubtless taken into account. To the usual population of the town was added a multitude of country-folk who had flocked in from the neighbourhood to avail themselves of the shelter of the walls. And the siege was begun so early that the harvest of the year could not be secured. 115 Henry speedily completed the investment of the land side of the town. Each of the six gates was commanded by a strong fort, and these forts were connected by palisaded trenches. The river was rendered impassable, both above and below, to any relieving force that might attempt to approach the town. Chains and booms were stretched across it, and a flotilla was brought up from Harfleur, part of which, as it would have been dangerous to pass under the guns of the town, was dragged over land to a point above the walls. A body of Welshmen watched the town from the south bank of the river, and many hundreds of Irish kernes, lightly armed and fleet of foot, accompanied the English cavalry in their excursions into the neighbouring country. “The greater part of them,” says Monstrelet, “had a stocking and shoe on one foot only, while the other was quite naked. They had targets, short javelins, and a strange sort of knives. Those who were on horseback had no saddles, but rode excellently well on small mountain horses, and were mounted on such panniers as are used by the carriers of corn in parts of France. They were, however, miserably accoutred in comparison with the English, and without any arms which could much hurt the French, whenever they might meet them.” This miscellaneous force was kept by their general under the strictest discipline. He was especially careful to prevent all straggling. The men were rigidly forbidden to lodge outside the military lines; and on one occasion two soldiers who were discovered transgressing this order were summarily executed. Henry made no assault upon the town. He was too careful of the lives of his men to waste them in so116 perilous an enterprise. He contented himself with repelling the frequent sallies of the besieged, which the strength of his lines of circumvallation and the state of readiness in which he always kept his troops enabled him to do without serious loss. He kept his men employed indeed with the construction of siege works, with the driving of mines, and with the construction of systematic approaches to the town; but his chief reliance was a blockade. The vast population, military and civil, ordinary and extraordinary, that crowded the walls of Rouen could not be long fed on any stores that had been laid up in this place, while effectual measures had been taken against the throwing in of any relief. The first-fruits of this policy of starvation were seen in the surrender of the fortified post of the Abbey of St. Catherine. This was given up by the force that garrisoned it within a month of the investment of the city, and given up because provisions had failed. Henry’s own camp meanwhile was abundantly supplied with provisions, furnished by stores of his own, or brought in by the parties which ravaged the neighbouring country. Rouen soon began to feel the pressure of famine. Its governor made an attempt to relieve it by expelling from the town twelve thousand non-combatants. Henry refused to let these miserable creatures pass through his lines, and they perished by degrees under the walls. The story of their fate is pitiable in the extreme. Some of them lingered on till the very end of the siege. Many of the soldiers on either side had hearts more tender, or perhaps it should be said intelligences less alive to the necessities of the military situation, than the generals who directed the attack and the defence of117 Rouen. These secretly supplied the outcasts with such provisions as they could spare. Henry himself departed from the severity of his policy by furnishing the few who were left alive on Christmas Day with a meal. But neither the Governor nor the King relented. It may be mentioned as an incident eminently characteristic of the time, that new-born children were raised in baskets to the top of the walls, duly baptized, and then let down again to perish of hunger. Henry has been severely blamed for the inhumanity that he is said to have displayed on this occasion. It may be allowed that there have been great soldiers who would sooner have relinquished a military advantage than allow such misery to exist under their eyes, but Henry was not of this type. He was a soldier first; and to his conception of a soldier’s duty, which was to use every military advantage that fell in his way, he subordinated everything. For wanton cruelty he had no taste: it did not come within the scope of his business; but from cruelty that was not wanton—that is, was dictated by some consideration of necessity or expediency—he never shrank. There is something, it must be allowed, that is repulsive about this, and it is made more repulsive by the contrast which it makes with Henry’s almost ostentatious piety. This is a contrast, however, which is apparent rather than real. Henry’s belief that the French crown belonged to him of right was, incredible as it may seem, a genuine conviction, even, it may be said, a religious conviction. This feeling, it may well be believed, still further fortified his heart against any thought of concession to mere human weakness. As far as regards his118 military pitilessness he strongly resembles C?sar and Napoleon. A messenger from the besieged succeeded in making his way through the English lines and in reaching Paris. He saw the Duke of Burgundy, and delivered in emphatic terms the message of the citizens of Rouen: “If by your negligence we are conquered by the King of England, we shall become the worst and bitterest enemies you have.” The Duke promised help, a promise which greatly encouraged the town to persevere in its defence. The oriflamme, the sacred banner of France, was indeed taken from the Abbey of St. Denis later in the year, and an army nominally at least intended to relieve Rouen followed it; but it never approached the town. There was indeed no one to act for France. This appeal, as has been said, was made to the Duke of Burgundy. The Dauphin meanwhile had opened negotiations for peace with the English king. A formal peace Henry would not make. To do so would, he conceived, be a renunciation of his claims to the French crown. Indeed he carefully avoided conceding directly to the Dauphin the title of Regent of France: in the commissions which were issued to the English ambassadors he is the “Regent so-called.” A truce was proposed, which was preliminary to a treaty. The English demands included all the territories mentioned in the great Peace of Bretigny, and Guienne as well. A stipulation was added that if the Duke should refuse to come into this treaty the king of England should march with as many troops as might be necessary to Paris, and deliver that city with the royal family into the hands of the Dauphin. In return for this service119 he was to have Flanders, a possession of the Dukes of Burgundy. In an interesting document Henry sets forth for the consideration of his ambassadors various difficulties which were involved in these proposals. Could he, without prejudice to his right to the crown of France, join arms with the Dauphin? Could he still receive the Duke of Burgundy, should the Duke submit to him? Could he justly invade Flanders while the truce was unexpired? A number of military problems were also suggested. Finally it was asked whether the Dauphin was qualified to conclude a valid truce. A supplementary commission authorised the ambassadors to treat for the hand of the Princess Katherine; and elaborate instructions were given to them as to their action in case of a partial concession of their demands. The negotiations went on for a time, if not with success, at least without coming to a manifest end. On one point the Dauphin returned an emphatic answer. He would not join with the English king in acting against the Duke of Burgundy. “I will never make peace,” he said, “with the ancient enemy of my country in order to destroy a vassal.” On November 17th the French commissioners, accompanied by the Cardinal d’Ursins, who was to act as mediator, came to Pont de l’Arche, and there met the English ambassadors. After a preliminary difficulty about the language in which the proceedings of the conference should be carried on had been disposed of, the conditions were discussed. The French envoys presented the King with a picture of the Princess Katherine, a present which he is said to have received120 with the greatest satisfaction. But he did not abate one jot from his demands, which indeed it is not too much to say he had made of set purpose impossible. He claimed the hand of the Princess Katherine, the duchies of Normandy and Acquitaine, and other principalities, all of them to be held in his own right and without any dependence on the king of France. The French commissioners at once rejected these terms as impossible, and the English retorted by questioning their authority to treat. In the end nothing was done. Rouen was now left to its fate, and that fate was evidently close at hand. Early in December a sally was planned, it being arranged that two thousand men were to issue simultaneously from each of the gates. The plan was only partially carried out, and though some loss was suffered by the English, nothing of real importance was effected. About the middle of the month a definite intimation was given to the inhabitants of Rouen that they must no longer expect relief. The distress in the town had by that time reached the point of agony. The richest among the citizens were reduced to eating horse-flesh; the poorer were glad to devour dogs and cats, rats and mice. Terrible stories were told that some had eaten human flesh. According to one chronicler, not less than fifty thousand died of starvation during the six months of the siege. The number is incredible, but it is certain that the famine reached an intensity that has seldom been equalled. When the last hope of relief was gone, it became absolutely intolerable. The inhabitants rose in revolt against the magistrates, demanding that negotiations should be immediately opened with the besiegers.121 There was indeed no reason why this should not be done, and on January 2nd the envoys of the town were admitted to Henry’s presence. At first he refused to grant any terms: Rouen must open its gates and admit its conqueror. A truce indeed for eight days was allowed; but the days passed without any result being attained. All that the English King would say was that the inhabitants of Rouen must submit themselves absolutely to his mercy. The people then formed a desperate resolution. They would fire their town in several places; a great length of the wall was to be undermined and supported temporarily with props; these were to be suddenly removed, and the whole population was simultaneously to sally forth. All who could bear arms were to fight their way out, while the women and children were to endeavour to make their escape. Henry then relented. This purpose of the people meant the destruction of Rouen, and he did not wish to lose the chief city of Normandy. He renewed negotiations, and terms of capitulation that were at least tolerable were finally agreed upon. A ransom of three hundred thousand crowns of gold was to be paid, and all material of war was to be delivered to the King. The lives of all persons in the town, with a few named exceptions, were to be granted to them, and all who would swear allegiance to the King should retain their property; others might depart. One noteworthy provision, as indicating Henry’s persuasion that he was dealing, not with an enemy, but with rebellious subjects, was that the King should have a space, either within or without the walls, for the building of a palace,122 but that he should duly purchase such ground from its owners. On January 22nd Henry entered the town with his customary show of magnificence. It was noticed, with much speculation as to the meaning of the symbol, that a page rode behind him bearing a lance to which a fox’s brush was attached after the manner of a pennon. His first care, as usual, was to return thanks in the cathedral for his victory. That done, he received the homage of the citizens. All but five of the persons excepted from the amnesty were either pardoned or released on payment of a fine. A noted partisan leader, Alan Blanchart, who had treated his prisoners with great cruelty, was beheaded; and the Vicar-General, who had excommunicated the English king, was condemned to imprisonment for life. The fall of Rouen was soon followed by the submission of the rest of Normandy. Henry at once set himself to the task of administering the province which he had acquired. He kept his court as Duke of Normandy, wearing the robes which belonged to that dignity. The province was to have its proper exchequer and coinage; a standard for measures was established, and regulations were made for the conduct of trade. In the brief opportunities that were given him Henry seems to have showed himself a capable administrator of civil affairs. His new subjects were impressed by the experience of a government more firm and just than that which their native rulers had exercised.","sourceLink":"http://novel.tingroom.com/duanpian/2721/74809.html","bookId":1420,"book":{"id":1420,"title":"Henry the Fifth","description":"简介： Henry was born in the castle of Monmouth on August 9th, 1387. He was the eldest of the six children of Henry of Lancaster by Mary de Bohun, younger daughter and co-heiress of Humphrey de Bohun.1 Humphrey, as the last male descendant of the De Bohuns,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2721","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
