{"id":19375,"no":18,"title":"THE VICOMTESSE DE CAMBES.XVIII.","content":"Let us now take a step backward, and direct the attention of our readers to the events that had taken place at Vayres, with which they are as yet only imperfectly acquainted. \\n\\n \\n\\n After several assaults, which were the more terrible in that the royalist general sacrificed his men recklessly in order to save time, the outworks were carried; but their brave defenders, after contesting the ground foot by foot and heaping up the dead and wounded at the foot of the ramparts, retired by the underground passage, and intrenched themselves in the main fortification. Now Monsieur de La Meilleraie did not fail to realize that, if he had lost five or six hundred men in carrying a wretched earthwork surmounted by a palisade, he was practically certain to lose six times as many in carrying a fort surrounded by stout walls, and defended by a man whose strategic skill and soldierly gallantry he had discovered to his cost. \\n\\n \\n\\n He had determined therefore to open trenches and lay siege to the place in due form, when he spied the advance guard of the Duc d\u0027épernon\u0027s army, which had effected its junction with his own, so that the royal forces were doubled. This put an entirely different face upon the affair. It was at once decided to undertake with twenty-four thousand men what they dared not undertake with twelve thousand, and to make an assault on the following day. \\n\\n \\n\\n By the cessation of work upon the trenches, by the new dispositions which were seen to be in progress, and above all by the appearance of strong reinforcements, Richon understood that the besiegers proposed to give him no rest; and apprehending an assault upon the morrow, he called his men together, in order to make sure of the state of feeling among them, although he had no reason to doubt their zeal, in view of the manner in which they had supported him in the defence of the outworks. \\n\\n \\n\\n His astonishment knew no bounds, therefore, when he discovered the change in the attitude of the garrison. His men gazed gloomily and uneasily at the royal army, and threatening murmurs arose in the ranks. \\n\\n \\n\\n Richon had no patience with pleasantry in war-time, especially pleasantry of that sort. \\n\\n \\n\\n \"Who\u0027s muttering there?\" he demanded, turning toward the spot where the sounds were most distinct. \\n\\n \\n\\n \"I!\" replied one man, bolder than his fellows. \\n\\n \\n\\n \"You?\" \\n\\n \\n\\n \"Yes, I.\" \\n\\n \\n\\n \"Come forward, and answer my questions.\" \\n\\n \\n\\n The man left the ranks and approached his chief. \\n\\n \\n\\n \"What do you lack that you dare to complain?\" said Richon, folding his arms and fixing his eyes sternly upon the malcontent. \\n\\n \\n\\n \"What do I lack?\" \\n\\n \\n\\n \"Yes, what do you lack? Have you your ration of bread?\" \\n\\n \\n\\n \"Yes, commandant.\" \\n\\n \\n\\n \"Your ration of wine?\" \\n\\n \\n\\n \"Yes, commandant.\" \\n\\n \\n\\n \"Are your quarters unsatisfactory?\" \\n\\n \\n\\n \"No.\" \\n\\n \\n\\n \"Are any arrears due you?\" \\n\\n \\n\\n \"No.\" \\n\\n \\n\\n \"Tell me, then, what you want? What do these murmurs mean?\" \\n\\n \\n\\n \"They mean that we are fighting against our king, and that comes hard to the French soldier.\" \\n\\n \\n\\n \"So you sigh to be in his Majesty\u0027s service?\" \\n\\n \\n\\n \"Dame! yes.\" \\n\\n \\n\\n \"And you wish to join your king?\" \\n\\n \\n\\n \"Yes,\" said the soldier, who was deceived by Richon\u0027s calm manner, and supposed that the affair would end with his simple exclusion from the garrison. \\n\\n \\n\\n \"Very well,\" said Richon, seizing the man by his baldric; \"but as the gates are closed, you must take the only road that is left open to you.\" \\n\\n \\n\\n \"What is that?\" queried the terrified soldier. \\n\\n \\n\\n \"This,\" retorted Richon, lifting him with his herculean arm, and tossing him over the parapet. \\n\\n \\n\\n The soldier, with a yell of terror, dropped into the moat, which, luckily for him, was full of water. \\n\\n \\n\\n This energetic action was greeted with gloomy silence. Richon believed that he had crushed the sedition, and turned to his men with the air of a gambler who risks everything to gain everything. \\n\\n \\n\\n \"Now,\" said he, \"if there are any partisans of the king here, let them say so, and they will be allowed to go and join him by the same road.\" \\n\\n \\n\\n A hundred voices answered:— \\n\\n \\n\\n \"Yes! yes! we are on the king\u0027s side, and we want to leave the fort!\" \\n\\n \\n\\n \"Oho!\" exclaimed Richon, realizing that he had to deal, not with the whim of a single man, but with a general revolt; \"oho! that\u0027s another matter; I thought that I had simply one malcontent to deal with, but I see that I have five hundred cowards!\" \\n\\n \\n\\n Richon did very wrong to include the whole garrison in his accusation: only a hundred men or thereabouts had spoken; the rest had held their peace, but they began to grumble too, when they were included in the charge of cowardice. \\n\\n \\n\\n \"Come, come,\" said Richon, \"let us not talk all together; if there is an officer who is willing to be false to his oath let him speak for all; I give you my word that he may speak with impunity.\" \\n\\n \\n\\n Ferguzon thereupon stepped out from the ranks, and said, saluting his commanding officer with irreproachable courtesy:— \\n\\n \\n\\n \"Commandant, you hear the wish expressed by the garrison. You are fighting against his Majesty our king. Now the greater number of us were not informed that we enlisted to make war upon such a foe. One of these brave fellows, finding this violence done to his opinions, might easily, in the excitement of the assault, have made a mistake in his aim and lodged a bullet in your brain; but we are loyal soldiers, not cowards, as you wrongfully called us. This, then, is our ultimatum, which we make known to you with due respect: send us to the king, or we shall go to him of our own motion.\" \\n\\n \\n\\n This speech was received with a universal shout of approval, which proved that the opinion expressed by the lieutenant was shared by the greater part, if not the whole, of the garrison. Richon saw that all was lost. \\n\\n \\n\\n \"I cannot defend the place alone,\" he said, \"and I do not propose to surrender; as my soldiers abandon me, let some one negotiate for them, as he and they think best, but that some one shall not be myself. If the few brave fellows who remain faithful to me, provided that there are any such, are promised their lives, I ask nothing more. Who will be your spokesman?\" \\n\\n \\n\\n \"I will be, commandant, if you have no objection, and if my comrades honor me with their confidence.\" \\n\\n \\n\\n \"Yes, yes, Lieutenant Ferguzon!\" cried five hundred voices, among which those of Barrabas and Carrotel could easily be distinguished. \\n\\n \\n\\n \"You are to be the man, monsieur,\" said Richon. \"You are free to go out and in, as you choose.\" \\n\\n \\n\\n \"And you have no special instructions to give me, commandant?\" \\n\\n \\n\\n \"Liberty for my men.\" \\n\\n \\n\\n \"And for yourself?\" \\n\\n \\n\\n \"Nothing.\" \\n\\n \\n\\n Such disinterestedness would have brought to their senses men who had been misled simply, but these men were sold. \\n\\n \\n\\n \"Yes! yes! liberty for us!\" they cried. \\n\\n \\n\\n \"Have no fear, commandant; I will not forget you in the capitulation.\" \\n\\n \\n\\n Richon smiled sadly, shrugged his shoulders, and withdrew to his own apartments, where he shut himself in. \\n\\n \\n\\n Ferguzon at once visited the royalist camp. Monsieur de La Meilleraie would do nothing, however, without the queen\u0027s authorization; and the queen had left Nanon\u0027s little house, in order, as she herself said, to avoid witnessing the further humiliation of her army, and had betaken herself to the h?tel de ville at Libourne. \\n\\n \\n\\n The marshal therefore placed Ferguzon under guard, took horse, and galloped to Libourne, where he found Monsieur de Mazarin, to whom he had, as he supposed, momentous news to announce. But at the marshal\u0027s first words, the minister stopped him, to say with his stereotyped smile:— \\n\\n \\n\\n \"We know all that, Monsieur le Maréchal: it was all arranged last evening. Treat with Lieutenant Ferguzon, but make no terms for Monsieur Richon except upon your word.\" \\n\\n \\n\\n \"What\u0027s that?—except upon my word?\" exclaimed the marshal; \"when my word is given it is as sacred, I trust, as any written engagement.\" \\n\\n \\n\\n \"Go to, go to, Monsieur le Maréchal; I have received special indulgences from his Holiness, which make it possible for me to relieve people from their oaths.\" \\n\\n \\n\\n \"That may be,\" said the marshal, \"but those indulgences do not apply to marshals of France.\" \\n\\n \\n\\n Mazarin smiled and signified to the marshal that he was at liberty to return to the camp. \\n\\n \\n\\n The marshal took his leave grumbling, and gave Ferguzon his written guaranty for himself and his men, but simply pledged his word concerning Richon. \\n\\n \\n\\n Ferguzon returned to the fort, which he and his companions abandoned an hour before dawn, after informing Richon of the marshal\u0027s verbal promise. Two hours later, as he was watching from his window the arrival of Ravailly with reinforcements, Richon was arrested in the name of the queen. \\n\\n \\n\\n At the announcement the gallant commandant\u0027s face expressed the liveliest satisfaction. If he were allowed to be at liberty, Madame de Condé might suspect him of treason; a captive, his captivity would justify him in her sight. It was this hope which led him to remain behind, instead of leaving the fort with the others. \\n\\n \\n\\n They did not content themselves, however, with taking his sword simply, as he expected; but when he was disarmed, four men who were awaiting him at the door threw themselves upon him and bound his hands behind his back. \\n\\n \\n\\n Richon endured this unworthy treatment with the tranquillity and resignation of a martyr. He was one of the steadfast, stern-tempered souls, who begat the popular heroes of the eighteenth and nineteenth centuries. \\n\\n \\n\\n He was taken under guard to Libourne and carried before the queen, who eyed him arrogantly; before the king, who, honored him with a ferocious, withering gaze; and before Monsieur de Mazarin, who said to him:— \\n\\n \\n\\n \"You played a bold game, Monsieur Richon.\" \\n\\n \\n\\n \"And lost, did I not, monseigneur? Now it only remains for me to find out what the stake was.\" \\n\\n \\n\\n \"I greatly fear that the stake was your head,\" said Mazarin. \\n\\n \\n\\n \"Inform Monsieur d\u0027épernon that the king desires his presence,\" said Anne of Austria. \"Let this fellow await his trial here.\" \\n\\n \\n\\n With superb disdain in her every movement, she left the room, leading the king by the hand and followed by Monsieur de Mazarin and her courtiers. \\n\\n \\n\\n Monsieur d\u0027épernon had arrived an hour before; but like the amorous old fellow he was, his first visit was to Nanon. In the heart of Guyenne he learned of the glorious defence made by Canolles at ?le Saint-Georges, and, having always the utmost confidence in his mistress, he congratulated her upon the conduct of her beloved brother, whose countenance, however, he frankly observed, did not give promise of so great nobility of soul, or so great valor. \\n\\n \\n\\n Nanon had something else to do than laugh in her sleeve at the prolongation of the blunder. At that moment she had to think, not only of her own happiness, but of her lover\u0027s liberty. Nanon loved Canolles so devotedly that she could not harbor the thought of his infidelity, although that thought came often to her mind. She had seen naught but affectionate solicitude in the pains he had taken to send her away from him; she believed him to be an unwilling prisoner; she wept and thought of nothing but the moment when, with the powerful assistance of Monsieur d\u0027épernon, she might obtain his freedom. So it was that she had written again and again to the dear duke, doing everything in her power to hasten his return. \\n\\n \\n\\n At last he had arrived, and Nanon lost no time in presenting to him her petition touching her pretended brother, whom she was insanely anxious to rescue at the earliest possible moment from the hands of his enemies, or rather from those of Madame de Cambes, for she believed that Canolles in reality was in danger of no worse fate than falling in love with the viscountess. \\n\\n \\n\\n But that in Nanon\u0027s eye was the worst of all dangers. She therefore implored Monsieur d\u0027épernon, upon her knees, to set her brother at liberty. \\n\\n \\n\\n \"Why, it could not happen better,\" replied the duke. \"I have this moment learned that the governor of Vayres has allowed himself to be taken, and we will exchange him for our brother Canolles.\" \\n\\n \\n\\n \"Oh!\" cried Nanon, \"this is a special favor from heaven, my dear duke.\" \\n\\n \\n\\n \"You love this brother of yours very dearly, do you not, Nanon?\" \\n\\n \\n\\n \"Oh, yes! more than my life.\" \\n\\n \\n\\n \"How strange it is that you never mentioned him to me until that day when I was fool enough—\" \\n\\n \\n\\n \"Then Monsieur le Duc, you will—?\" said Nanon. \\n\\n \\n\\n \"I will send the governor of Vayres to Madame de Condé, who will send Canolles to us; that is done every day in war-time,—an exchange, pure and simple.\" \\n\\n \\n\\n \"But will not Madame de Condé deem Monsieur de Canolles of more value than a simple officer?\" \\n\\n \\n\\n \"Oh, well, in that case we will send her two or three officers instead of one; in short, we will arrange the matter to your satisfaction, my love; and when our gallant governor of ?le Saint-Georges arrives at Libourne, we will give him a triumph.\" \\n\\n \\n\\n Nanon\u0027s delight was beyond words. To have Canolles once more in her possession was her one burning desire. As for what Monsieur d\u0027épernon might say when he learned who Canolles really was, she cared but little. Once Canolles was safe beside her, she would tell the duke that he was her lover; she would proclaim it from the housetops, that all the world might hear. \\n\\n \\n\\n At this juncture the queen\u0027s messenger appeared. \\n\\n \\n\\n \"Well, well,\" said the duke, \"this is most fortunate, dear Nanon; I will wait upon her Majesty, and bring back with me the request for the exchange.\" \\n\\n \\n\\n \"So that my brother may be here?\" \\n\\n \\n\\n \"To-morrow, perhaps.\" \\n\\n \\n\\n \"Go, then, go!\" cried Nanon, \"and do not lose an instant. Oh! to-morrow, to-morrow,\" she added, raising her arms with a lovely imploring expression, \"to-morrow,—God grant it!\" \\n\\n \\n\\n \"Ah! what a loving heart!\" muttered Monsieur d\u0027épernon as he left the room. \\n\\n \\n\\n When the Duc d\u0027épernon entered the queen\u0027s apartment, Anne of Austria, flushed with wrath, was biting her thick Austrian lips, which were the special admiration of her courtiers, for the very reason that they were her only ugly feature. Monsieur d\u0027épernon, a famous squire of dames, and accustomed to their smiles, was received like one of the Bordelais rebels. \\n\\n \\n\\n He looked at the queen in amazement; she did not acknowledge his salutation, but gazed at him, with a threatening frown, from the height of her royal majesty. \\n\\n \\n\\n \"Aha! is it you, Monsieur le Duc?\" she said at last after a pause of some duration; \"come hither that I may offer you my congratulations upon your selection of officials within your jurisdiction.\" \\n\\n \\n\\n \"What have I done, madame, I pray to know?\" demanded the wondering nobleman; \"what has happened?\" \\n\\n \\n\\n \"It has happened that you appointed to be governor of Vayres a man who has fired upon the king; that is all.\" \\n\\n \\n\\n \"I, madame!\" cried the duke. \"Your Majesty is most certainly in error; I did not appoint the governor of Vayres,—at least, not that I am aware of.\" \\n\\n \\n\\n D\u0027épernon made this reservation because his conscience reproached him with not always making his appointments without assistance. \\n\\n \\n\\n \"Ah! this is interesting,\" said the queen; \"Monsieur Richon was not appointed by you, perhaps?\" And she emphasized the last word most maliciously. \\n\\n \\n\\n The duke, who knew Nanon\u0027s talent for selecting fit men for the places to be filled, soon recovered his confidence. \\n\\n \\n\\n \"I do not recall the appointment of Monsieur Richon,\" said he, \"but if I did appoint him he must be a faithful servant of the king.\" \\n\\n \\n\\n \"God\u0027s mercy!\" retorted the queen; \"Monsieur Richon, in your judgment, is a faithful servant of the king!—a faithful servant, in good sooth, who kills five hundred men for us in less than three days!\" \\n\\n \\n\\n \"Madame,\" said the duke, \"if such is the case I shall be forced to admit that I am wrong. But before I am convicted, allow me to go and procure the proof that I appointed him.\" \\n\\n \\n\\n The queen\u0027s first impulse was to detain him, but she thought better of it. \\n\\n \\n\\n \"Go,\" said she, \"and when you have brought me your proof, I will give you mine.\" \\n\\n \\n\\n Monsieur d\u0027épernon hastened from the room, and ran all the way back to Nanon. \\n\\n \\n\\n \"Well,\" said she, \"have you the request for the exchange of prisoners, my dear duke?\" \\n\\n \\n\\n \"Oh, yes! of course! it was an excellent time to speak of that,\" rejoined the duke; \"the queen is in a tearing rage.\" \\n\\n \\n\\n \"What is the cause of that?\" \\n\\n \\n\\n \"Because either you or I appointed Monsieur Richon governor of Vayres, and this same governor, who seems to have defended the place like a lion, killed five hundred of our men.\" \\n\\n \\n\\n \"Monsieur Richon!\" repeated Nanon; \"I do not know that name.\" \\n\\n \\n\\n \"The devil take me if I do.\" \\n\\n \\n\\n \"Then tell the queen boldly that she is mistaken.\" \\n\\n \\n\\n \"But are you sure that you are not mistaken?\" \\n\\n \\n\\n \"Wait a moment; I prefer to have no reason for self-reproach, so I will tell you.\" \\n\\n \\n\\n Nanon went to her study, and consulted her register at the letter R. It contained no memorandum of a commission issued to Richon. \\n\\n \\n\\n \"You can go back to the queen,\" she said, returning, \"and tell her fearlessly that she is in error.\" \\n\\n \\n\\n Monsieur d\u0027épernon did not pause to take breath between Nanon\u0027s house and the h?tel de ville. \\n\\n \\n\\n \"Madame,\" said he, proudly, as he entered the queen\u0027s apartment, \"I am innocent of the crime imputed to me. The appointment of Monsieur Richon was made by your Majesty\u0027s ministers.\" \\n\\n \\n\\n \"In that case my ministers sign themselves D\u0027épernon,\" retorted the queen, dryly. \\n\\n \\n\\n \"How so?\" \\n\\n \\n\\n \"It must be so, as that signature is written at the foot of Monsieur Richon\u0027s commission.\" \\n\\n \\n\\n \"Impossible, madame!\" rejoined the duke, in the hesitating tone of a man who begins to doubt himself. \\n\\n \\n\\n \"Impossible?\" said the queen, with a shrug. \"Very good! read for yourself.\" And she took from the table a document upon which her hand was laid. \\n\\n \\n\\n Monsieur d\u0027épernon seized the commission, and ran it through eagerly, examining every fold of the paper, every word, every letter; a terrible thought came to his mind, and kept him rooted to his place. \\n\\n \\n\\n \"May I see this Monsieur Richon?\" he asked. \\n\\n \\n\\n \"Nothing easier,\" replied the queen; \"I ordered him to be detained in the adjoining room, in order to afford you that satisfaction. Bring in the villain,\" she added to the guards who were awaiting her orders at the door. \\n\\n \\n\\n In a moment Richon was led in, with his hands bound behind his back, and his hat on his head. The duke walked up to him, and fastened his eyes upon him in a piercing gaze, which he endured with his wonted dignity. \\n\\n \\n\\n One of his guards knocked his hat to the floor with the back of his hand; but this insult did not cause the slightest evidence of excitement on the part of the governor of Vayres. \\n\\n \\n\\n \"Throw a cloak over his shoulders, put a mask on his face, and give me a lighted candle,\" said the duke. \\n\\n \\n\\n The first two orders were first obeyed. The queen looked on in amazement at these strange preparations. \\n\\n \\n\\n The duke walked around Richon, scrutinizing him with the greatest care, trying to refresh his memory upon every detail, but evidently still in doubt. \\n\\n \\n\\n \"Bring me the candle I asked for,\" said he; \"that test will set my doubts at rest.\" \\n\\n \\n\\n The candle was brought. The duke held the commission close to the flame, and the heat caused a double cross, drawn below the signature with invisible ink, to appear upon the paper. \\n\\n \\n\\n At the sight the duke\u0027s brow cleared, and he cried: \\n\\n \\n\\n \"Madame, this commission is signed by me, it is true; but it was not signed for Monsieur Richon, or for any other person; it was extorted from me by this man in a sort of ambuscade; but before I delivered it to him, signed in blank, I had made this mark on the paper which your Majesty can see, and it furnishes us with overwhelming proof against the culprit. Look.\" \\n\\n \\n\\n The queen eagerly seized the paper, and looked at the cross which the duke pointed out to her. \\n\\n \\n\\n \"I do not understand a single word of the charge you make against me,\" said Richon, simply. \\n\\n \\n\\n \"What\u0027s that?\" cried the duke; \"you were not the masked man to whom I handed this paper upon the Dordogne?\" \\n\\n \\n\\n \"I have never spoken to your lordship before this day; I have never been upon the Dordogne, masked,\" replied Richon, coldly. \\n\\n \\n\\n \"If it was not you it was some man sent by you.\" \\n\\n \\n\\n \"It would serve no purpose to conceal the truth,\" said Richon, as calm as ever; \"the commission which you hold in your hand, Monsieur le Duc, I received from Madame la Princesse de Condé, by the hands of Monsieur le Duc de La Rochefoucauld; my name had then been inserted by Monsieur Lenet, with whose writing you are perhaps familiar. How the paper came into the hands of Madame la Princesse, or of Monsieur de La Rochefoucauld; when and where my name was written upon that paper by Monsieur Lenet, I have absolutely no idea, nor do I care, for it does not concern me.\" \\n\\n \\n\\n \"Ah! do you think so?\" retorted the duke, in a bantering tone. \\n\\n \\n\\n Thereupon he drew near the queen and in a low tone told her a long story, to which she listened with close attention; it was the story of his meeting with Cauvignac, and the adventure of the Dordogne. \\n\\n \\n\\n The queen, being a woman, perfectly appreciated the duke\u0027s jealousy. When he had finished, she said:— \\n\\n \\n\\n \"It\u0027s an infamous act, to add to the high treason; the man who does not hesitate to fire upon his king, may well be capable of selling a woman\u0027s secret.\" \\n\\n \\n\\n \"What the devil are they saying there?\" muttered Richon, with a frown; for while he could not hear enough to follow the conversation, he heard enough to arouse a suspicion that his honor was being brought in question. Moreover, the flashing eyes of the duke and the queen promised nothing agreeable, and, courageous as the governor of Vayres was, he could not avoid a feeling of uneasiness, although it would have been impossible, from the calm, disdainful expression of his features, to guess what was taking place in his heart. \\n\\n \\n\\n \"He must be tried at once,\" said the queen. \"Assemble a court-martial. You will preside, Monsieur le Duc d\u0027épernon; so select your associates, and lose no time.\" \\n\\n \\n\\n \"Madame,\" said Richon, \"there is no occasion for assembling a court-martial, or for a trial. I am a prisoner upon the word of Monsieur le Maréchal de La Meilleraie. I am a voluntary prisoner, for I could have gone out of Vayres with my soldiers; I could have made my escape before or after their evacuation, and I did not do it.\" \\n\\n \\n\\n \"I know nothing of business of this nature,\" said the queen, rising to go into the adjoining room; \"if you have satisfactory explanations to make, you can urge them upon your judges. Will not this room serve your purpose, Monsieur le Duc?\" \\n\\n \\n\\n \"Yes, madame,\" replied D\u0027épernon, who immediately selected twelve officers from among those in attendance, and constituted the court. \\n\\n \\n\\n Richon began to understand his situation, as the judges took their places, and the judge-advocate demanded his name and rank. \\n\\n \\n\\n Richon answered these questions. \\n\\n \\n\\n \"You are accused of high treason in having fired upon the soldiers of the king,\" said the judge-advocate; \"do you admit your guilt?\" \\n\\n \\n\\n \"To deny it would be to deny what you all saw; yes, monsieur, I fired upon the king\u0027s troops.\" \\n\\n \\n\\n \"By virtue of what right?\" \\n\\n \\n\\n \"By virtue of the laws of war, by virtue of the same right which Monsieur de Conti, Monsieur de Beaufort, Monsieur d\u0027Elb?uf, and so many others, have invoked under the like circumstances.\" \\n\\n \\n\\n \"That right does not exist, monsieur, for it is nothing more nor less than rebellion.\" \\n\\n \\n\\n \"But it was by virtue of that right that my lieutenant capitulated. I appeal to the terms of the capitulation.\" \\n\\n \\n\\n \"Capitulation!\" cried Monsieur d\u0027épernon, ironically, for he felt that the queen was listening, and the feeling dictated the insult; \"you, treat with a marshal of France!\" \\n\\n \\n\\n \"Why not, when a marshal of France treated with me?\" \\n\\n \\n\\n \"Produce your capitulation, then, and we will judge of its value.\" \\n\\n \\n\\n \"It was a verbal agreement.\" \\n\\n \\n\\n \"Produce your witnesses.\" \\n\\n \\n\\n \"I have but one witness to produce.\" \\n\\n \\n\\n \"Who is that?\" \\n\\n \\n\\n \"The marshal himself.\" \\n\\n \\n\\n \"Let the marshal be called,\" said the duke. \\n\\n \\n\\n \"It\u0027s useless,\" interposed the queen, opening the door behind which she was listening; \"Monsieur le Maréchal set out two hours since with the advance-guard, to march upon Bordeaux.\" \\n\\n \\n\\n With that she closed the door once more. \\n\\n \\n\\n This apparition froze the blood in every heart, for it imposed upon the judges the necessity of convicting Richon. \\n\\n \\n\\n \"Ah!\" said he, \"that is all the regard Monsieur de La Meilleraie has for his word. You were right, monsieur,\" he added, turning to the Duc d\u0027épernon, \"I was foolish to treat with a marshal of France.\" \\n\\n \\n\\n From that moment Richon maintained a disdainful silence, and refused to reply to any and all questions. This course simplified the proceedings greatly, and the trial lasted little more than an hour. They wrote little and spoke still less. The judge-advocate closed by demanding the imposition of the death penalty, and at a sign from the Duc d\u0027épernon the judges unanimously voted for death. \\n\\n \\n\\n Richon listened to the sentence as if he were a simple spectator, and, as impassive and dumb as ever, was turned over on the spot to the provost of the army. \\n\\n \\n\\n The Duc d\u0027épernon betook himself to the apartments of the queen, whom he found in a charming humor, and who invited him to dinner. The duke, who believed himself to be in disgrace, accepted, and returned to Nanon to inform her of his good fortune in retaining his standing in the good graces of his sovereign. \\n\\n \\n\\n He found her stretched out upon a reclining chair by a window which looked upon the public square of Libourne. \\n\\n \\n\\n \"Well,\" said she, \"have you discovered anything?\" \\n\\n \\n\\n \"I have discovered everything, my dear.\" \\n\\n \\n\\n \"Nonsense!\" said Nanon, not without some in-quietude. \\n\\n \\n\\n \"Mon Dieu! I mean what I say. You remember that accusation I was idiot enough to believe,—the accusation that you were carrying on an intrigue with your brother?\" \\n\\n \\n\\n \"Well?\" \\n\\n \\n\\n \"You remember the blank signature that I was required to give the informer?\" \\n\\n \\n\\n \"Yes, what then?\" \\n\\n \\n\\n \"The informer is in our hands, my dear, taken in the meshes of his blank signature, like a fox in the trap.\" \\n\\n \\n\\n \"Can it be?\" said Nanon, in dismay; for she knew that Cauvignac was the man, and although she had no very deep affection for her real brother, she did not wish that any ill should befall him; moreover, that same brother might, to extricate himself, tell a multitude of things which Nanon preferred to have remain secret. \\n\\n \\n\\n \"Himself, my dear,\" continued D\u0027épernon; \"what do you say to that? The rascal, with the assistance of my signature, appointed himself governor of Vayres on his own authority; but Vayres is taken and the culprit is in our hands.\" \\n\\n \\n\\n All these details were so like Cauvignac\u0027s ingenious combinations that Nanon\u0027s alarm redoubled. \\n\\n \\n\\n \"What have you done with this man?\" she asked in a voice that betrayed her emotion. \\n\\n \\n\\n \"Why,\" said the duke, \"in a moment you can see for yourself what we have done with him. Yes, \u0027faith,\" he added, rising, \"it couldn\u0027t be better; raise the curtain, or rather throw the window open; he\u0027s an enemy of the king, and you can see him hanged.\" \\n\\n \\n\\n \"Hanged!\" cried Nanon. \"What do you say, Monsieur le Duc? the man of the blank signature is to be hanged?\" \\n\\n \\n\\n \"Yes, my love. Look yonder; do you not see the rope dangling from the beam, and the crowd flocking to the square? And see, there are the fusileers coming with the man himself, over at the left. Look! there is the king at his window.\" \\n\\n \\n\\n Nanon\u0027s heart was in her mouth; one rapid glance, however, was enough to show her that the man in custody was not Cauvignac. \\n\\n \\n\\n \"Well, well,\" said the duke, \"Sieur Richon is to be hanged as high as Haman; that will teach him to slander women.\" \\n\\n \\n\\n \"But,\" cried Nanon, seizing the duke\u0027s hand, and summoning all her strength for the struggle, \"but the poor wretch is not guilty; perhaps he\u0027s a gallant soldier; perhaps he\u0027s an honorable man; it may be that you are murdering one who is innocent!\" \\n\\n \\n\\n \"No, no, you are greatly mistaken, my dear; he is a forger and a slanderer. Besides, if there were nothing against him but his being governor of Vayres, he would still be guilty of high treason, and it seems to me that, even if that were all, it would be quite enough.\" \\n\\n \\n\\n \"But hadn\u0027t he Monsieur de La Meilleraie\u0027s word?\" \\n\\n \\n\\n \"He said so, but I do not believe him.\" \\n\\n \\n\\n \"Why did not the marshal enlighten the court-martial on so important a point?\" \\n\\n \\n\\n \"He left Libourne two hours before the court convened.\" \\n\\n \\n\\n \"O mon Dieu! mon Dieu!\" cried Nanon; \"something tells me that he is innocent, and that his death will bring bad luck to us all. Ah! monsieur, you have great influence, and you say there is nothing you would not do for me—in Heaven\u0027s name, then, grant me that man\u0027s pardon!\" \\n\\n \\n\\n \"I cannot, my dear; the queen herself condemned him, and where she is, there is no other power.\" \\n\\n \\n\\n Nanon uttered a sigh which much resembled a groan. \\n\\n \\n\\n At that moment Richon reached the market-place, and, still tranquil and silent, was led beneath the beam to which the rope was attached; a ladder was already in place awaiting his coming. Richon mounted the ladder with unfaltering step, his noble head towering above the crowd, upon which he gazed with cold contempt. The provost passed the noose around his neck, and the crier proclaimed in a loud voice that the king was about to do justice upon the body of étienne Richon, forger, traitor, and plebeian. \\n\\n \\n\\n \"The day has come,\" said Richon, \"when it is more honorable to be a plebeian as I am than to be a marshal of France.\" \\n\\n \\n\\n The words were hardly out of his mouth when the ladder was pulled from under him, and his body hung trembling from the fatal beam. \\n\\n \\n\\n A universal feeling of horror scattered the crowd, without a single shout of Vive le roi! although every one could see the two royal personages at their window. Nanon hid her face in her hands and fled to the farthest corner of the room. \\n\\n \\n\\n \"Whatever you may think, dear Nanon,\" said the duke, \"I believe that this execution will have a good effect. I am curious to know what they will do at Bordeaux when they learn that we are hanging their governors.\" \\n\\n \\n\\n As she thought of what they might do, Nanon opened her mouth to speak, but she could only utter a heartrending shriek, raising her hands to heaven as if in entreaty that Richon\u0027s death might not be avenged; then, as if all the springs of life were dried up within her, she fell at full length upon the floor. \\n\\n \\n\\n \"Well, well!\" cried the duke, \"what\u0027s the matter Nanon? What does this mean? Is it possible that it puts you in such a state as this to see a mere upstart hanged? Come, dear Nanon, come to your senses! Why, God forgive me, she has fainted!—and the people of Agen say that she has no feeling! Ho there! help! salt! cold water!\" \\n\\n \\n\\n But no one came at his call, so the duke ran from the room to procure himself what he called for in vain from her servants, who probably did not hear him, so engrossed were they by the spectacle with which the royal generosity regaled them, free of charge. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1647/48679.html","bookId":1205,"book":{"id":1205,"title":"The War of Women Volume 2","description":"简介： Two days later they came in sight of Bordeaux, and it became necessary to decide at once how they should enter the city. The dukes, with their army, were no more than ten leagues away, so that they were at liberty to choose between a peaceable and a...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1647","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
