{"id":19380,"no":23,"title":"THE VICOMTESSE DE CAMBES.XXIII.","content":"The threatening shouts of the excited crowd had not, in fact, escaped Canolles\u0027 attention. Through the bars at his window he was able to feast his eyes upon the animated, changing picture which was presented to his view, and which varied little from one end of the city to the other. \\n\\n \\n\\n \"Pardieu!\" said he, \"this is an annoying mischance, Richon\u0027s death. Poor Richon! he was a gallant fellow! His death will redouble the severity of our captivity; they will not allow me to go about the city as before; no more meetings, and no marriage, unless Claire can resign herself to the chapel of a prison. She will be content with that, I know. One can be married as well in one chapel as another. But it\u0027s an evil omen, none the less. Why the deuce could they not have received the news to-morrow instead of to-day?\" \\n\\n \\n\\n He went to the window and looked out. \\n\\n \\n\\n \"What a strict watch they are keeping!\" he continued; \"two sentries! When I think that I shall be mewèd up here a week, a fortnight perhaps, until something new occurs to make them forget this! Fortunately, events follow rapidly on one another\u0027s heels just now, and the Bordelais are fickle-minded; meanwhile I shall have passed some very unpleasant hours all the same. Poor Claire! she must be in despair; luckily she knows that I have been arrested. Yes, she knows it and so knows that I am not at fault—Good lack! where are all those people going? They seem to be bound for the Esplanade!—but there can be no parade there, nor an execution, at this hour. They are all going in the same direction. Upon my word one would say that they know I am here, like a bear, behind my bars.\" \\n\\n \\n\\n Canolles began to pace up and down with folded arms; finding himself within the walls of a real prison, his mind turned for a moment to philosophical ideas, with which he commonly bothered his head but little. \\n\\n \\n\\n \"What an idiotic thing war is!\" he muttered. \"Here is poor Richon, with whom I dined hardly a month ago, dead! He ought to have made sure of death by a cannon-ball, as I would have done—as I would have done if any other than the viscountess had besieged me. This war of women is, in good sooth, the most to be dreaded of all wars. At least, I have had no share in the death of a friend. Thank God, I haven\u0027t drawn my sword against my brother! that is a consolation to me. And it is to my little feminine good genius that I owe that, too. Take it for all in all, I owe her many things.\" \\n\\n \\n\\n At that moment an officer entered, and interrupted Canolles\u0027 soliloquy. \\n\\n \\n\\n \"Do you wish for supper, monsieur?\" he asked. \"If so, give your orders; the jailer is instructed to furnish you with whatever you desire.\" \\n\\n \\n\\n \"Well, well,\" said Canolles, \"it would seem that they propose at least to treat me honorably while I remain here. I feared something different for an instant, when I saw the stern face of the princess, and the repellent bearing of all her judges.\" \\n\\n \\n\\n \"I am waiting,\" rejoined the officer, bowing. \\n\\n \\n\\n \"Ah! to be sure; I beg your pardon. The extreme courtesy of your question led to certain reflections. Let us return to the matter in hand. Yes, monsieur, I will sup, for I am very hungry; but I am of sober habits, and a soldier\u0027s supper will content me.\" \\n\\n \\n\\n \"Now,\" said the officer, drawing nearer to him with evident interest, \"have you no commissions,—in the city? Do you expect nothing? You say that you are a soldier; so am I; look upon me, therefore, as a comrade.\" \\n\\n \\n\\n Canolles stared at him in amazement. \\n\\n \\n\\n \"No, monsieur,\" said he; \"no, I have no commissions in the city; no, I expect nothing, unless it be a certain person whom I may not name. As for looking upon you as a comrade, I thank you for the suggestion. Here is my hand, monsieur, and later, if I need anything, I will remember what you say.\" \\n\\n \\n\\n It was the officer\u0027s turn to stare at Canolles in amazement. \\n\\n \\n\\n \"Very well, monsieur,\" said he, \"you will be served at once;\" and he withdrew. \\n\\n \\n\\n A moment later two soldiers entered with the supper; it was more elaborate than Canolles had asked for, and he sat down at the table and ate heartily. \\n\\n \\n\\n The soldiers in their turn gazed wonderingly at him. Canolles mistook their amazement for envy, and as the wine was excellent Guyenne, he said to them:— \\n\\n \\n\\n \"My friends, order two glasses.\" \\n\\n \\n\\n One of the soldiers smiled, and procured the articles in question. Canolles filled them; then poured a few drops of wine into his own. \\n\\n \\n\\n \"Your health, my friends!\" said he. \\n\\n \\n\\n The two soldiers took their glasses, mechanically touched them to Canolles\u0027, and drank without reciprocating his toast. \\n\\n \\n\\n \"They are not very polite,\" thought Canolles, \"but they drink well; one cannot have everything.\" \\n\\n \\n\\n He continued his supper, and brought it triumphantly to a close. When he had finished he rose, and the soldiers removed the table. \\n\\n \\n\\n The officer returned. \\n\\n \\n\\n \"Pardieu! monsieur,\" said Canolles, \"you should have supped with me; the supper was excellent.\" \\n\\n \\n\\n \"I could not enjoy that honor, monsieur, for I have just left the table myself. I return—\" \\n\\n \\n\\n \"To bear me company?\" said Canolles. \"If so, accept my warmest thanks, monsieur, for it is very kind of you.\" \\n\\n \\n\\n \"No, monsieur, my errand is less agreeable. I come to inform you that there is no minister in the prison, and that the chaplain is a Catholic; I know you to be a Protestant, and this fact may annoy you somewhat—\" \\n\\n \\n\\n \"Annoy me, monsieur? how so?\" demanded Canolles, innocently. \\n\\n \\n\\n \"Why,\" said the embarrassed officer, \"in the matter of your devotions.\" \\n\\n \\n\\n \"My devotions! Nonsense!\" laughed Canolles. \"I will think of that to-morrow. I pray only in the morning.\" \\n\\n \\n\\n The officer stared at Canolles in open-mouthed astonishment, which gradually changed to profound compassion. He bowed and left the room. \\n\\n \\n\\n \"Damnation!\" said Canolles, \"why, every one is crazy! Since poor Richon\u0027s death everybody I meet has the aspect of an idiot or a madman. Sarpejeu! shall I never see a sensible face again?\" \\n\\n \\n\\n The words were hardly out of his mouth when the door opened once more, and before he had time to see who had opened it, some one threw herself into his arms, and winding her arms around his neck deluged his face with tears. \\n\\n \\n\\n \"God\u0027s mercy!\" cried the prisoner, extricating himself from the embrace; \"another lunatic! Upon my soul, I believe I am in an asylum!\" \\n\\n \\n\\n But the gesture that he made in stepping back knocked the new-comer\u0027s hat to the floor, and the lovely blond tresses of Madame de Cambes fell down about her shoulders. \\n\\n \\n\\n \"You here!\" he cried, rushing to her, and taking her in his arms once more. \"You! oh! forgive me for not recognizing you, or rather for not divining your presence.\" \\n\\n \\n\\n \"Hush!\" said she, picking up her hat and hastily replacing it on her head; \"hush! for if they knew it was I, perhaps they would turn me out. At last I am permitted to see you once more! Oh, mon Dieu! mon Dieu! how happy I am!\" \\n\\n \\n\\n Her bosom heaved, and she sobbed as if her heart would break. \\n\\n \\n\\n \"Once more!\" said Canolles; \"you are permitted to see me once more, you say? In Heaven\u0027s name, are you not to see me more than this once?\" he added, with a laugh. \\n\\n \\n\\n \"Oh! do not laugh!\" said Claire; \"my dear love, your gayety distresses me. Do not laugh, I implore you! I have had such difficulty in procuring admission,—if you knew!—and I was so near not being able to come at all! Except, for Lenet, the best of men—But let us talk of yourself, my poor dear. Mon Dieu / it is really you, is it not? It is really you whom I can press to my heart again?\" \\n\\n \\n\\n \"Why, yes, it is I, it is really I,\" said Canolles, smiling. \\n\\n \\n\\n \"Oh! do not affect this cheerful demeanor,—it is useless, I know all. They did not know that I loved you, so they hid nothing from me—\" \\n\\n \\n\\n \"What is it that you know, pray?\" queried Canolles. \\n\\n \\n\\n \"You expected me, didn\u0027t you?\" the viscountess continued. \"You were displeased by my silence? Were you not already blaming me?\" \\n\\n \\n\\n \"Unhappy and dissatisfied I was, beyond question, but I did not blame you. I suspected that circumstances stronger than your will kept you from my side; and the main cause of my unhappiness, through it all, has been the necessary postponement of our marriage for a week,—perhaps for two weeks.\" \\n\\n \\n\\n Claire stared at Canolles in like amazement to that exhibited by the officer a moment before. \\n\\n \\n\\n \"Are you speaking seriously?\" said she; \"are you not really any more alarmed than you seem to be?\" \\n\\n \\n\\n \"Alarmed?\" said Canolles, \"alarmed at what? Can it be,\" he added with a laugh, \"that I am exposed to some danger of which I know nothing?\" \\n\\n \\n\\n \"Oh! the poor fellow!\" cried Claire; \"he knew nothing of it!\" \\n\\n \\n\\n Dreading, doubtless, to reveal the whole truth without warning to him whose life was imperilled thereby, she checked, by a violent effort, the words that had risen from her heart to her lips. \\n\\n \\n\\n \"No, I know nothing,\" said Canolles, gravely. \"But you will tell me, won\u0027t you? I am a man! Speak, Claire, speak.\" \\n\\n \\n\\n \"You know that Richon is dead?\" said she. \\n\\n \\n\\n \"Yes, I know it.\" \\n\\n \\n\\n \"But do you know how he died?\" \\n\\n \\n\\n \"No, but I suspect. He was killed at his post, was he not, in the breach at Vayres?\" \\n\\n \\n\\n Claire was silent for a moment; then, in a tone as solemn as that of a bell tolling for the dead, she replied: \\n\\n \\n\\n \"He was hanged in the market place at Libourne!\" \\n\\n \\n\\n Canolles started back. \\n\\n \\n\\n \"Hanged!\" he cried; \"Richon,—a soldier!\" \\n\\n \\n\\n Suddenly the color fled from his cheeks, and he drew his trembling hand across his brow. \\n\\n \\n\\n \"Ah! now I understand it all,\" said he; \"I understand my arrest, my examination, the officer\u0027s words, and the silence of the soldiers; I understand the step you have taken, your tears when you found me so cheerful; I understand the crowds, the cries, and the threats. Richon was murdered! and they will revenge Richon upon me!\" \\n\\n \\n\\n \"No, no, my beloved! no, beloved of my heart!\" cried Claire, beaming with joy, seizing both Canolles\u0027 hands, and gazing with all her soul into his eyes. \"No, they will not sacrifice you, dear prisoner! You were not mistaken,—you were marked out for the sacrifice; you were condemned; you were doomed to die; death was very near to you, my darling fiancé. But have no fear; you may speak of happiness and of the future, for she whose whole life is consecrated to you has saved your life! Be joyous and happy, but beneath your breath; for you may awake your ill-fated companion, upon whose head the storm will break, who is to die in your place!\" \\n\\n \\n\\n \"Oh! hush, hush, dear love! you freeze my blood with horror,\" said Canolles, hardly recovered, despite Claire\u0027s ardent caresses, from the terrible blow he had received. \"I, so calm and confident, so idiotically happy, was in imminent danger of death! And when? at what moment of all others? Just Heaven! at the moment when I was to become your husband! Upon my soul, it would have been a double murder!\" \\n\\n \\n\\n \"They call that \u0027reprisal,\u0027\" said Claire. \\n\\n \\n\\n \"Yes, yes,—it is true; they are right.\" \\n\\n \\n\\n \"Now you are frowning and pensive again.\" \\n\\n \\n\\n \"Oh!\" cried Canolles, \"it isn\u0027t that I fear death; but death would part us—\" \\n\\n \\n\\n \"If you had died, my love, I should have died too. But, instead of giving way to sadness, rejoice with me. Look you, to-night—perhaps within an hour—you will leave the prison. Either I will come here myself for you, or I will await you at the outer door. Then, without losing a moment, a second, we will fly—oh! instantly! I cannot wait! this accursed city terrifies me. To-day I have succeeded in saving you; but to-morrow some other unforeseen mischance may take you from me again!\" \\n\\n \\n\\n \"Ah! Claire, my best beloved, do you know that this is almost too great happiness at a single stroke; yes, in very truth, too great happiness! I shall die of it—\" \\n\\n \\n\\n \"Well, then,\" said Claire, \"be joyous and cheerful, as you naturally are.\" \\n\\n \\n\\n \"Why do not you do the same?\" \\n\\n \\n\\n \"See, I am laughing.\" \\n\\n \\n\\n \"And that sigh?\" \\n\\n \\n\\n \"The sigh, my dearest, is for the poor wretch who pays for our joy with his life.\" \\n\\n \\n\\n \"Yes, yes, you are right! Oh! why can you not take me away with you at this moment? Come, my good angel, open your wings and fly away with me!\" \\n\\n \\n\\n \"Patience, patience! my beloved husband! To-morrow I will carry you—where? I neither know nor care—to the paradise of our love. Meanwhile I am here.\" \\n\\n \\n\\n Canolles took her in his arms and strained her to his breast. She threw her arms around his neck and lay unresistingly, trembling with agitation, against that heart, which was scarcely beating, so oppressed was it by conflicting emotions. \\n\\n \\n\\n Suddenly, for the second time, a heart-breaking sob shook her frame, and happy as she was, her tears fell thick and fast upon Canolles\u0027 face. \\n\\n \\n\\n \"Well, well!\" said he, \"is this your cheerfulness, my poor dear angel?\" \\n\\n \\n\\n \"It is the last remnant of my sorrow.\" \\n\\n \\n\\n As she spoke the door opened, and the same officer announced that the half-hour had expired. \\n\\n \\n\\n \"Adieu!\" whispered Canolles; \"or rather hide me in the folds of your cloak, and take me with you!\" \\n\\n \\n\\n \"Hush, dear love!\" she replied, in a low tone, \"for you break my heart! Do you not see that I am dying with longing to do it? Be patient for your own sake, and for mine. In a few hours we shall meet again never to part.\" \\n\\n \\n\\n \"I am patient,\" said Canolles, joyfully, completely comforted by this assurance; \"but we must part now. Courage, my dear, and let us say adieu. Adieu, Claire, adieu!\" \\n\\n \\n\\n \"Adieu!\" said she, trying to smile; \"ad—\" \\n\\n \\n\\n But she could not complete the cruel word. For the third time her voice was stifled with sobs. \\n\\n \\n\\n \"Adieu! adieu!\" cried Canolles, seizing her in his arms anew, and covering her brow with burning kisses, \"adieu!\" \\n\\n \\n\\n \"The devil!\" muttered the officer, \"luckily I know that the poor fellow has no great reason to fear, or this scene would break my heart!\" \\n\\n \\n\\n He escorted Claire to the door and then returned. \\n\\n \\n\\n \"Now, monsieur,\" said he to Canolles, who had fallen back upon a chair, exhausted by his emotion, \"it\u0027s not enough for you to be happy, you must be compassionate too. Your neighbor, your unfortunate fellow-prisoner, who is to die, is entirely alone; no one is interested in him, and he has no one to comfort him. He desires to see you. I have taken it upon myself to allow him to do so, but your consent also is necessary.\" \\n\\n \\n\\n \"My consent!\" cried Canolles, \"oh! I give it willingly. Poor devil! I await him with open arms! I do not know him, but that makes no difference.\" \\n\\n \\n\\n \"He seems to know you, however.\" \\n\\n \\n\\n \"Is he aware of the fate in store for him?\" \\n\\n \\n\\n \"No, I think not. You understand that he must be left in ignorance of it.\" \\n\\n \\n\\n \"Oh! never fear.\" \\n\\n \\n\\n \"Listen, then: eleven o\u0027clock will soon strike, and I shall return to the guard-house; after eleven o\u0027clock the jailers are supreme in the interior of the prison. Your jailer has been warned that your neighbor will be with you, and he will come here for him when it is time for him to return to his own cell. If he knows nothing, tell him nothing; if he does know, tell him from us that we soldiers all pity him from the bottom of our hearts. To die is nothing, but sacrebleu! to be hanged is to die twice over.\" \\n\\n \\n\\n \"Is it decided that he is to die?\" \\n\\n \\n\\n \"By the same death as Richon, in order that the reprisal may be complete. But we are chattering here, while he is awaiting your reply, anxiously no doubt.\" \\n\\n \\n\\n \"Go to him, monsieur, and believe that I am deeply grateful to you, both for him and myself.\" \\n\\n \\n\\n The officer opened the door of the adjoining cell, and Cauvignac, somewhat pale, but with a jaunty air and with head erect, entered the cell of Canolles, who walked forward several steps to meet him. \\n\\n \\n\\n Thereupon the officer waved his hand to Canolles, cast a pitying glance at Cauvignac, and took his leave, taking with him his soldiers, whose heavy footfalls could be heard for some time in the corridors. \\n\\n \\n\\n Soon the jailer made his round; they heard the clashing of his keys in the different doors. \\n\\n \\n\\n Cauvignac was not depressed, because there was in the man an unalterable confidence in himself, an inextinguishable hope in the future. But, beneath his calm exterior and his mask of cheerfulness, a bitter grief was biting at his heart like a serpent. That sceptical soul, which had always doubted everything, had come at last to doubt its very doubts. \\n\\n \\n\\n Since Richon\u0027s death Cauvignac had not eaten or slept. \\n\\n \\n\\n Accustomed as he was to make light of the misfortunes of others because he took his own so gayly, our philosopher had not once thought of laughing at an event which led to so terrible a result as that, and, despite himself, he saw, in all the mysterious threads which led up to his responsibility for Richon\u0027s death, the unswerving hand of Providence, and he began to believe, if not in the reward of good deeds, at least in the punishment of evil deeds. \\n\\n \\n\\n He resigned himself to his fate, therefore, and gave himself over to thought; but, as we have said, the result of his resignation was that he no longer ate or slept. \\n\\n \\n\\n It was a strange and mysterious fact that his own death, which he anticipated, moved him much less than the death of the comrade in misfortune, whom he knew to be within two yards of him, awaiting the fatal decree, or execution without the formality of a decree. All this turned his thoughts once more to Richon, his avenging spectre, and the twofold catastrophe resulting from what had seemed to him a charming piece of mischief. \\n\\n \\n\\n His first idea had been to escape; for, although he was a prisoner on parole, he thought that he might without scruple disregard his engagements, as his captors had disregarded theirs by putting him in prison. But he was shrewd enough to realize that escape was impossible, despite his ingenuity. Thereupon he became more firmly convinced than ever that he was fast in the clutches of inexorable fatality; and he had but one desire,—namely, to talk for a few moments with his companion, whose name had caused him a feeling of sad surprise, and to effect a reconciliation in his person with the whole human race he had outraged so shamefully. \\n\\n \\n\\n We do not affirm that all these reflections of his were the results of remorse,—no, Cauvignac was too much of a philosopher to suffer from remorse,—but it was something that closely resembled it, namely violent self-reproach for having done evil for nothing. With time, and a combination of circumstances suited to maintain him in this frame of mind, this sentiment might perhaps have had the same result as remorse; but time was lacking. \\n\\n \\n\\n Upon entering Canolles\u0027 cell, Cauvignac waited first of all, with his ordinary prudence, until the officer who showed him in had withdrawn; then, when he saw that the door was securely fastened, and the wicket hermetically closed, he walked up to Canolles, who, as we have said, had taken some steps to meet him, and warmly pressed his hand. \\n\\n \\n\\n Notwithstanding the gravity of his situation, Cauvignac could not forbear a smile as his eye fell upon the handsome, refined young man, of venturesome and joyous disposition, whom he had twice before surprised in very different situations, once when his mission was to send him to Nantes, and again to take him to ?le Saint-Georges. Furthermore, he recalled his momentary usurpation of his name, and the amusing mystification of the duke resulting therefrom; and gloomy and forbidding as the prison was, the souvenir was so mirth-provoking that, for a moment, the present was forgotten. \\n\\n \\n\\n For his part, Canolles recognized him at the first glance as the person with whom he had come in contact on the two occasions we have mentioned; and as Cauvignac, on those two occasions had been, all things considered, a messenger of good tidings, his compassion for the poor fellow\u0027s sad fate increased tenfold, especially as he knew that it was his own safety that made Cauvignac\u0027s death inevitable; and in so sensitive a mind as his such a thought caused infinitely deeper remorse than a downright crime would have caused his companion. \\n\\n \\n\\n He welcomed him therefore with the greatest kindness of manner. \\n\\n \\n\\n \"Well, baron,\" Cauvignac began; \"what do you say to our present situation? It is a little too precarious to be comfortable, it seems to me.\" \\n\\n \\n\\n \"Yes, here we are in prison, and God knows when we shall get away from here,\" rejoined Canolles, trying to put a good face on the matter, in order to lighten his companion\u0027s agony with a ray of hope. \\n\\n \\n\\n \"When we shall get away from here!\" repeated Cauvignac. \"May God, whom you invoke, vouchsafe, in his mercy, to postpone it as long as possible! But I do not think he is disposed to respite us for long. I saw from my window, as you must have seen from yours, an excited crowd rushing in a certain direction,—toward the Esplanade, unless I am much mistaken. You know the Esplanade, my dear baron, and you know to what uses it is put?\" \\n\\n \\n\\n \"Oh, nonsense! You exaggerate the danger, I am sure. The crowd were heading for the Esplanade, it is true, but it was to see some military punishment, no doubt. To make us pay for Richon\u0027s death would be frightful; for, after all, we are both entirely innocent of his death.\" \\n\\n \\n\\n Cauvignac started and fastened his eyes upon Canolles\u0027 face with, a gloomy expression which gradually softened to one of pity. \\n\\n \\n\\n \"Well, well,\" he said to himself, \"here\u0027s a poor fellow who deceives himself as to the situation. But I must tell him how it really stands; for where would be the use of encouraging him in his error only to make the blow more crushing at the last? whereas, when one has time to prepare, the fall always seems a little easier.\" \\n\\n \\n\\n After a pause of some duration, he took both Candles\u0027 hands in his, and gazing into his face with an intentness which greatly embarrassed him, he said:— \\n\\n \\n\\n \"Monsieur, my dear monsieur, let us send for a bottle or two of the excellent Braune wine you know of. Alas! I might have drunk my fill of it if I had been governor a little longer, and I will even go so far as to admit that my predilection for that vintage led me to apply for that position in preference to any other. God punishes me for my gluttony.\" \\n\\n \\n\\n \"I shall be glad to join you,\" said Canolles. \\n\\n \\n\\n \"Very good, and as we drink we will talk; if what I have to tell you is not very pleasant, the wine will be good at least, and one will make up for the other.\" \\n\\n \\n\\n Canolles knocked on the door, but there was no response; he knocked still louder, and a child, who was playing in the corridor, came to the door. \\n\\n \\n\\n \"What do you want?\" he asked. \\n\\n \\n\\n \"Wine,\" said Canolles; \"tell your papa to bring two bottles.\" \\n\\n \\n\\n The child ran off, and a moment later returned to say: \\n\\n \\n\\n \"Papa is busy talking with a gentleman just now; he will come very soon.\" \\n\\n \\n\\n \"Will you let me ask you a question, my dear?\" said Cauvignac. \\n\\n \\n\\n \"What is it?\" \\n\\n \\n\\n \"What gentleman is your papa talking with?\" he asked in his most insinuating tone. \\n\\n \\n\\n \"With a tall gentleman.\" \\n\\n \\n\\n \"This is a charming child,\" said Cauvignac; \"wait a moment and we shall learn something. How is the gentleman dressed?\" \\n\\n \\n\\n \"All in black.\" \\n\\n \\n\\n \"The devil! Do you hear? all in black! What is the name of this tall gentleman dressed all in black? Do you happen to know that, my dear?\" \\n\\n \\n\\n \"His name is Monsieur La Vie.\" \\n\\n \\n\\n \"Aha!\" said Cauvignac; \"the king\u0027s advocate! I fancy that we have no reason to be apprehensive of anything he is likely to do. Let us take advantage of their conversation to converse ourselves. Here, my little fellow\" he added, slipping a piece of money under the door, \"here\u0027s something to buy marbles with. It\u0027s a good thing to make friends everywhere,\" he continued, as he stood erect once more. \\n\\n \\n\\n The child joyfully seized the coin, and thanked the donor. \\n\\n \\n\\n \"Well, monsieur,\" said Canolles, \"you were saying—\" \\n\\n \\n\\n \"Oh, yes! I was saying that you seem to me to be sadly astray as to the fate that awaits us when we leave the prison; you speak of the Esplanade, of military punishments; but I am inclined to think that we are the objects of the public attention, and that there is something more than mere flogging in the wind.\" \\n\\n \\n\\n \"Nonsense!\" said Canolles. \\n\\n \\n\\n \"Zounds! monsieur, you look at things in rather a more cheerful light than I am able to do; perhaps because you haven\u0027t the same reasons for alarm that I have. But don\u0027t boast too much of your prospects, for they \u0027re not over-flattering. Yours are nothing, however, compared to mine, and mine,—I must say it because I am firmly convinced that it is so,—are most infernally dark. Do you know who I am, monsieur?\" \\n\\n \\n\\n \"That\u0027s a strange question surely. You are Captain Cauvignac, Governor of Braune, I suppose.\" \\n\\n \\n\\n \"Yes, for the moment; but I have not always borne that name or that title. I have changed my name very often, and have tried many different titles. For instance, one day I called myself Baron de Canolles, just as you call yourself.\" \\n\\n \\n\\n Canolles looked him in the eye. \\n\\n \\n\\n \"Yes, I understand,\" pursued Cauvignac, \"you are wondering whether I am insane, are you not? Have no fears on that score, for I am in full possession of all my mental faculties, and have never been more completely sane.\" \\n\\n \\n\\n \"Explain yourself, then,\" said Canolles. \\n\\n \\n\\n \"Nothing easier. Monsieur le Duc d\u0027épernon—You know Monsieur le Duc d\u0027épernon, do you not?\" \\n\\n \\n\\n \"By name only; I never saw him.\" \\n\\n \\n\\n \"Luckily for me. Monsieur d\u0027épernon, I say, surprised me one day at a certain house where I knew that you were a favored guest, so I took the liberty of borrowing your name.\" \\n\\n \\n\\n \"Monsieur, what mean you?\" \\n\\n \\n\\n \"There, there, softly! Don\u0027t be selfish enough to be jealous of one woman just as you are on the point of marrying another! And even if you should be,—and it would be quite consistent with human nature, for man is a vile brute,—you will forgive me in a moment. I am too closely connected with you for you to quarrel with me.\" \\n\\n \\n\\n \"I do not understand a word that you are saying, monsieur.\" \\n\\n \\n\\n \"I say that I have a right to be treated by you as a brother, or at least as a brother-in-law.\" \\n\\n \\n\\n \"You speak in enigmas, and I am still all at sea.\" \\n\\n \\n\\n \"Very good; I will enlighten you with a single word. My true name is Roland de Lartigues, and Nanon is my sister.\" \\n\\n \\n\\n Canolles\u0027 suspicions gave way before a sudden swelling of the heart. \\n\\n \\n\\n \"You, Nanon\u0027s brother!\" he cried. \"Oh, poor fellow!\" \\n\\n \\n\\n \"Yes, poor fellow, indeed!\" rejoined Cauvignac; \"you have hit the point exactly; for in addition to a multitude of other disagreeable circumstances connected with my encounter with the authorities here, is that of bearing the name of Roland de Lartigues, and of being Nanon\u0027s brother. You are aware that my dear sister is not in the odor of sanctity in the nostrils of Messieurs les Bordelais. Once let it be known that I am Nanon\u0027s brother, and I am thrice lost. Now there is one La Rochefoucauld here, and one Lenet, who know everything.\" \\n\\n \\n\\n \"Ah!\" said Canolles, in whose mind Cauvignac\u0027s Words awoke certain memories; \"ah! I understand now why poor Nanon called me her brother in that letter. Dear girl!\" \\n\\n \\n\\n \"Yes,\" said Cauvignac, \"she was indeed a dear girl, and I much regret that I did not always follow her instructions to the letter; but what would you have? if one could foretell the future there would be no need of God.\" \\n\\n \\n\\n \"What has become of her?\" Canolles asked. \\n\\n \\n\\n \"Who can say? Poor child! She is in despair, no doubt,—not on my account, for she doesn\u0027t know of my arrest, but for you, whose fate it is more than likely that she has learned.\" \\n\\n \\n\\n \"Have no fear,\" said Canolles. \"Lenet will not disclose the fact that you are Nanon\u0027s brother, and Monsieur de La Rochefoucauld has no reason to wish you ill; so no one will know anything about it.\" \\n\\n \\n\\n \"If they know nothing about that, they will know enough else, believe me; for instance, they will know that it was I who provided a certain document signed in blank, and that that blank signature—but, damnation! let us forget, if we can. What a pity that the wine doesn\u0027t come!\" he continued, looking toward the door. \"There\u0027s nothing like wine to make a fellow forget.\" \\n\\n \\n\\n \"Come, come,\" said Canolles, \"courage!\" \\n\\n \\n\\n \"Pardieu! do you think that I lack it? Wait until you see me at the critical moment when we go for a turn on the Esplanade. But there is one thing that worries me; shall we be shot, beheaded, or hanged?\" \\n\\n \\n\\n \"Hanged!\" cried Canolles. \"Great God! we are noblemen, and they will not inflict such an outrage on the nobility.\" \\n\\n \\n\\n \"Oh! you will see that they are quite capable of picking flaws in my genealogy; then, too—\" \\n\\n \\n\\n \"What now?\" \\n\\n \\n\\n \"Will you or I be the one to go first?\" \\n\\n \\n\\n \"For God\u0027s sake! my dear friend,\" said Canolles, \"don\u0027t get such ideas in your head! Nothing is less certain than this death that you anticipate so confidently; people are not tried, condemned, and executed in a night.\" \\n\\n \\n\\n \"Hark ye,\" rejoined Cauvignac; \"I was over yonder when they tried poor Richon, God rest his soul! Trial, judgment, hanging, all together, lasted hardly more than three or four hours; let us allow for somewhat less activity in this case,—for Madame Anne d\u0027Autriche is Queen of France, and Madame de Condé is only a princess of the blood,—and that gives us four or five hours. As it is three hours since we were arrested, and two since we appeared before our judges, we can count upon an hour or two more to live; that\u0027s but a short time.\" \\n\\n \\n\\n \"In any event,\" said Canolles, \"they will wait till daybreak before executing us.\" \\n\\n \\n\\n \"Ah! that is not at all certain; an execution by torch-light is a very fine spectacle; it costs more, to be sure, but as Madame la Princesse is much in need of the assistance of the Bordelais, it may well be that she will decide to incur the extra expense.\" \\n\\n \\n\\n \"Hush!\" said Canolles, \"I hear footsteps.\" \\n\\n \\n\\n \"The devil!\" exclaimed Cauvignac, turning a shade paler. \\n\\n \\n\\n \"It\u0027s the wine, no doubt,\" said Canolles. \\n\\n \\n\\n \"Ah, yes!\" said Cauvignac, gazing more than earnestly at the door, \"it may be that. If the jailer enters with the bottles, all is well; if on the other hand—\" \\n\\n \\n\\n The door opened, and the jailer entered without the bottles. \\n\\n \\n\\n Canolles and Cauvignac exchanged a significant glance, but the jailer took no note of it,—he seemed to be in such haste, the time was so short, and it was so dark in the cell. \\n\\n \\n\\n He entered and closed the door. \\n\\n \\n\\n Then he walked up to the prisoners and said, drawing a paper from his pocket:— \\n\\n \\n\\n \"Which of you is Baron de Canolles?\" \\n\\n \\n\\n \"The devil!\" they exclaimed with one voice, exchanging a second glance. \\n\\n \\n\\n Canolles hesitated before replying, and Cauvignac did the same; the former had borne the name too long to doubt that the question was meant for him; but the other had borne it sufficiently long to fear that his falsehood was coming home to him. \\n\\n \\n\\n However, Canolles understood that he must reply, so at last he said:— \\n\\n \\n\\n \"I am he.\" \\n\\n \\n\\n The jailer drew nearer to him. \\n\\n \\n\\n \"You were the governor of a fortress?\" he inquired. \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"But so was I governor of a fortress; I, too, have borne the name of Canolles,\" said Cauvignac. \"Come, explain yourself, and let there be no mistake. Mischief enough has come out of my transactions with regard to poor Richon, without my being the cause of another man\u0027s death.\" \\n\\n \\n\\n \"So your name is Canolles now?\" said the jailer to Canolles. \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"And your name was formerly Canolles?\" he said to Cauvignac. \\n\\n \\n\\n \"Yes,\" was the reply, \"for a single day, and I begin to think that I made a great fool of myself that day.\" \\n\\n \\n\\n \"You were both governors of fortresses?\" \\n\\n \\n\\n \"Yes,\" they replied, in the same breath. \\n\\n \\n\\n \"Now for one more question, which will clear up the whole matter.\" \\n\\n \\n\\n The two prisoners waited in absolute silence. \\n\\n \\n\\n \"Which of you,\" said the jailer, \"is the brother of Madame Nanon de Lartigues?\" \\n\\n \\n\\n Cauvignac made a grimace which would have been comical at a less solemn moment. \\n\\n \\n\\n \"Did I not tell you,\" he said to Canolles, \"did I not tell you, my dear fellow, that that was where they would attack me? If I should tell you,\" he added, turning to the jailer, \"that I am Madame Nanon de Lartigues\u0027 brother, what would you say to me, my friend?\" \\n\\n \\n\\n \"I should tell you to follow me instantly.\" \\n\\n \\n\\n \"Damnation!\" ejaculated Cauvignac. \\n\\n \\n\\n \"But she has also called me her brother,\" said Canolles, trying in some degree to avert the storm that was evidently gathering over the head of his unfortunate companion. \\n\\n \\n\\n \"One moment, one moment,\" said Cauvignac, passing in front of the jailer, and taking Canolles aside; \"one moment, my young friend; it isn\u0027t fair that you should be Nanon\u0027s brother under such circumstances. I have made others pay my debts enough, and it\u0027s no more than fair that I should take my turn at paying them.\" \\n\\n \\n\\n \"What do you mean?\" demanded Canolles. \\n\\n \\n\\n \"Oh! it would take too long to tell you, and you see our jailer is losing patience, and tapping his foot on the floor. It\u0027s all right, my friend, all right; never fear, I will go with you. Adieu, my dear fellow; my doubts are set at rest on one point at least, for I know that I am to go first. God grant that you do not follow me too quickly. Now it remains to know what sort of death it is to be. The devil! if only it isn\u0027t hanging! Oh! I am coming, pardieu! I am coming. You \u0027re in a terrible hurry, my good man. Well then, my dear brother, my dear brother-in-law, my dear friend,—a last adieu, and good-night!\" \\n\\n \\n\\n With that Cauvignac stepped toward Canolles and held out his hand, which Canolles grasped in both of his own and pressed affectionately. \\n\\n \\n\\n Meanwhile Cauvignac was looking at him with a strange expression. \\n\\n \\n\\n \"What do you want?\" said Canolles; \"have you any request to make?\" \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Then make it boldly.\" \\n\\n \\n\\n \"Do you sometimes pray? \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Well, then, when you pray, say a word for me.\" He turned to the jailer, whose impatience was visibly increasing. \\n\\n \\n\\n \"I am Madame Nanon de Lartigues\u0027 brother,\" said he; \"come, my friend—\" \\n\\n \\n\\n The jailer did not wait for him to say it a second time, but hastily left the room, followed by Cauvignac, who waved a last farewell to Canolles from the threshold. \\n\\n \\n\\n The door closed behind them, their steps receded rapidly, and everything relapsed into absolute silence, which seemed to him who was left behind like the silence of death. \\n\\n \\n\\n Canolles fell into a melancholy frame of mind, which resembled terror. This fashion of spiriting a man away by night, without commotion, without guards, was more alarming than the preparations for the infliction of the death penalty when made in broad daylight. All his fear, however, was on his companion\u0027s behalf, for his confidence in Madame de Cambes was so great that since he had seen her he was absolutely without fear for himself, notwithstanding the alarming nature of the news she brought. \\n\\n \\n\\n So it was that the sole subject of his absorption at that moment was the fate in store for the comrade who was taken from him. Thereupon Cauvignac\u0027s last request came to his mind; he fell upon his knees and prayed. \\n\\n \\n\\n In a few moments he rose, feeling comforted and strong, and awaiting calmly the arrival of the succor promised by Madame de Cambes, or her own presence. \\n\\n \\n\\n Meanwhile Cauvignac followed the jailer through the dark corridor without a word, and reflecting as deeply as his nature allowed him to do. \\n\\n \\n\\n At the end of the corridor, the jailer closed the door with the least possible noise, and after listening for a moment to certain ill-defined sounds which came up from the lower floors, turned sharply to Cauvignac, and said: \\n\\n \\n\\n \"Come! my gentleman, off we go.\" \\n\\n \\n\\n \"I am ready,\" rejoined Cauvignac, majestically. \\n\\n \\n\\n \"Don\u0027t speak so loud,\" said the jailer, \"and walk faster;\" and he started down a stairway leading to the underground dungeons. \\n\\n \\n\\n \"Oho!\" said Cauvignac to himself, \"do they propose to cut my throat in some dark corner, or consign me to a dungeon? I have heard it said that they sometimes content themselves with exhibiting the four limbs on a public square, as C?sar Borgia did with Ramiro d\u0027Orco. This jailer is all alone, and his keys are at his belt. The keys must open some door or other. He is short, I am tall; he is weak, I am strong; he is in front, I am behind; I can very soon choke the life out of him if I choose. Do I choose?\" \\n\\n \\n\\n Cauvignac, having decided that he did choose, had already extended his muscular hands to put his plan in execution, when the jailer suddenly turned about in a great fright. \\n\\n \\n\\n \"Hush!\" said he, \"do you hear nothing?\" \\n\\n \\n\\n \"Upon my word,\" said Cauvignac, still speaking to himself, \"there is something decidedly mysterious in all this; and so much caution ought to alarm me greatly, if it doesn\u0027t reassure me.\" \\n\\n \\n\\n He stopped abruptly, and demanded:— \\n\\n \\n\\n \"Whither are you taking me?\" \\n\\n \\n\\n \"Don\u0027t you see?\" said the jailer; \"into the vaults.\" \\n\\n \\n\\n \"Deuce take me!\" said Cauvignac: \"do they propose to bury me alive?\" \\n\\n \\n\\n The jailer shrugged his shoulders, and led the way through a labyrinth of winding corridors, until they came to a low arched door, on which the moisture stood in great drops; from the other side came a strange roaring sound. \\n\\n \\n\\n The jailer opened the door. \\n\\n \\n\\n \"The river!\" cried Cauvignac, starting back in dismay-as his eyes fell upon a swiftly flowing stream as black and forbidding as Acheron. \\n\\n \\n\\n \"Yes, the river; do you know how to swim?\" \\n\\n \\n\\n \"Yes—no—that is to say—Why the devil do you ask me that?\" \\n\\n \\n\\n \"Because if you can\u0027t swim, we shall have to wait for a boat that is stationed over yonder, and that means a loss of quarter of an hour, to say nothing of the danger that some one may hear the signal I shall have to give, and so discover us.\" \\n\\n \\n\\n \"Discover us!\" cried Cauvignac. \"In God\u0027s name, my dear fellow, are we escaping?\" \\n\\n \\n\\n \"Pardieu! of course we are.\" \\n\\n \\n\\n \"Where are we going?\" \\n\\n \\n\\n \"Where you please.\" \\n\\n \\n\\n \"I am free, then?\" \\n\\n \\n\\n \"As free as the air.\" \\n\\n \\n\\n \"Oh, my God!\" cried Cauvignac. \\n\\n \\n\\n Without adding a word to that eloquent exclamation, without looking to right or left, without thought as to whether his companion was following him, he darted to the river, and plunged in more rapidly than a hunted otter. The jailer imitated him, and after a quarter of an hour of silent efforts to stem the current, they both were within hailing distance of the boat. The jailer whistled three times; the oarsmen, recognizing the pre-concerted signal, rowed toward them, promptly lifted them into the boat, bent to their oars without a word, and in less than five minutes set them both ashore upon the other bank. \\n\\n \\n\\n \"Ouf!\" said Cauvignac, who had not uttered a single word from the moment that he threw himself into the stream. \"Ouf! I am really saved! Dear jailer of my heart, God will reward you!\" \\n\\n \\n\\n \"I have already received forty thousand livres,\" said the jailer, \"which will help me to wait patiently for the reward God has in store for me.\" \\n\\n \\n\\n \"Forty thousand livres!\" cried Cauvignac in utter stupefaction. \"Who the devil can have put out forty thousand livres for me?\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1647/48684.html","bookId":1205,"book":{"id":1205,"title":"The War of Women Volume 2","description":"简介： Two days later they came in sight of Bordeaux, and it became necessary to decide at once how they should enter the city. The dukes, with their army, were no more than ten leagues away, so that they were at liberty to choose between a peaceable and a...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1647","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
