{"id":23294,"no":7,"title":"CHAPTER VII.","content":"\"LOOK THROUGH MINE EYES WITH THINE, TRUE WIFE.\" \n \n There were steamers plying between Fowey and Falmouth in this summer weather, and Colonel Disney suggested next morning that Isola should go with him on his journey in search of Tabitha. They would go by water and return in the afternoon by rail. The morning was lovely, and the trip round the coast would be delightful. \n \n \"I don\u0027t want to see Tabitha,\" Isola answered, with a touch of impatience. \"If you are so bent upon seeing her I had rather you went alone.\" \n \n \"But I had rather not spend a whole day away from you. As for Tabitha, a visit of ten minutes will be quite enough for me. I have brought her a Rhampoor Chuddah—a warm red one. I have only to make her my little gift, and to say a few words—without any anger—about her breach of faith.\" \n \n \"It was really not a breach of faith. I gave her full permission to go. I was getting just a little tired of her fussi[Pg 92]ness. She was not my old servant, you know, Martin. I had not been used to her all my life, as you have.\" \n \n \"Ah, but she is so good—such a thoroughly good woman.\" \n \n \"Yes, she is good, no doubt.\" \n \n \"Well, we\u0027ll go to Falmouth together, and you can stop at the Green Bank, where we can lunch, while I go and find Tabitha. You know her address, I suppose?\" \n \n \"Yes. She lives at No. 5, Crown Terrace, overlooking the harbour.\" \n \n This conversation took place in the garden, where they breakfasted, under a square striped awning, an apology for a tent, set up on the lawn by the river. A badly cooked breakfast seemed less offensive in the garden, where the summer air, and the perfume of the roses eked out the meal. After breakfast Disney called his wife to the drawing-room, where he had brought his spoil from the East, and laid his offerings, as it were, at the feet of his idol. \n \n \"See, love, here is a shawl which you can use as a couvre-pied,\" he said, flinging a fine cashmere over a chair, \"since Fashion decrees that women shall wear shawls no more. And here are some ivory chessmen to assist you in puzzling your brains over the game of Eastern antiquity; and here are vases and things for odd corners. And I have brought you a carved Persian screen, and some Peshawur curtains for your door-ways, and a lamp from Cairo, to make your drawing-room a little more fantastically pretty. I know you love these things.\" \n \n She was enraptured with his gifts. Her face lighted up like the face of a child, and she ran from one object to the other in a confused gladness, scarcely able to look at one thing at a time. \n \n \"They will make the room too lovely,\" she cried; \"and they will tell everybody of your far-away travels. I can never thank you half enough for all these treasures.\" \n \n \"Love me a little, and that will be more than enough.\" \n \n \"A little. Ah, Martin, I love you so much.\" \n \n \"Then why do you sigh as you say it? There need be no sighing over our love now. I never shall leave you again.\" \n \n [Pg 93] \n \n He caught her to his breast as he spoke, and kissed the pale sweet face, with a kind of defiant rapture, as if he challenged Fate to do him any harm. The pain of separation from that fair young wife had been so keen an agony that there was a touch of savage exultancy in the joy of re-union—some such fierce gladness as a knight-crusader might have felt in days of old, coming back to his beloved after years of war and travel. \n \n God help the crusader\u0027s wife of those rough days if she had turned from the path of virtue during his exile. There would be a short shrift and a bloody shroud for such a sinner! \n \n They walked into Fowey by that pathway which Isola had trodden so often in the year that was gone—not always alone. The pleasure steamer was waiting in the little haven, where the two rivers part under the cloven hills. Out seaward the air blew fresh and free, and the spray was dashing up against the rocks, and Polruan\u0027s grey roofs were wrapped in morning shadows while Fowey laughed in the sunshine. \n \n That water journey to Falmouth was delicious upon such a morning, and it needed not a brass band of three men and a boy, blaring out the new and popular music-hall song of the year before last, to enliven the voyage. Those arable lands yonder, undulating with every curve of the ever-varying coast-line, the emerald green of young corn shining in the sunlight, copse and spinney here and there in the clefts and hollows, the Gribbin Head standing up stony and grim on the crest of the topmost hill, and, anon, Par harbour lying low upon the level sands, and then this point and that, till they meet the gallant fleet of fishing-boats sailing out from Mevagissey, like a peaceful Armada, and skim past the haven, and the little town and quay crowded at the foot of the hill, and the coastguard\u0027s stronghold yonder, high up against the bright blue sky, whiter than any other mortal habitation ever was or will be. And so to Falmouth, with porpoises playing under their bows, like sportive dolphins, as if they carried Dionysius or Arion on their deck—a brief summer sail, in the keen sweet air of an English summer. To Martin Disney\u0027s British nostrils that atmosphere seemed soul-inspiring, the[Pg 94] very breath of life and gladness, after the experiences of a hot-weather campaign. \n \n And here was Falmouth, with proud Pendennis on a sunny height, and bay and harbour, town and hill, terrace above terrace, tower and steeple—the town and streets all crowded and clustered in the foreground, where the river winds inward to the heart of the land. \n \n The Green Bank gave them cordial welcome, and luncheon was speedily spread in a private sitting-room, at a snug round table by a window overlooking the harbour—luncheon, and of the best, tongue and chicken, and salad, cherry pasty, junket and cream. \n \n Colonel Disney applied himself to the meal with a hearty relish. \n \n \"There is just this one advantage in bad cooking at home that it makes one so thoroughly enjoy everything one gets abroad,\" he said, laughing at his own prowess. \n \n \"I\u0027ll try and get a better cook, if you like, Martin,\" Isola said, with rather a helpless air. \n \n To a wife of one and twenty there seems such futility in worrying about a cook. \n \n \"You couldn\u0027t possibly get a worse. How long have you put up with this one?\" \n \n \"Ever since Tabitha left.\" \n \n \"Good heavens! You have been starving upon ill-cooked food for six months. No wonder you look thin and out of health.\" \n \n \"I am really very well. There is nothing the matter with me.\" \n \n \"Yes, yes, there is a great deal the matter. A bad cook, solitude, no one to watch over you and care for you. But that is all over now. You are eating no lunch—not even that superb cherry pasty. I\u0027ll be off to find Tabitha. I shan\u0027t be more than half an hour, unless Crown Terrace is at the extremity of Falmouth. Have you brought a book to read while I am away? No, foolish child. Never mind. There is the county paper, and there is the harbour, with all its life, for you to look at.\" \n \n [Pg 95] \n \n He started on his voyage of discovery, with the warm, comfortable shawl which he had bought for his mother\u0027s old servant hanging over his arm. It was a small disappointment amidst the infinite delight of his home-coming, but when he bought the shawl he had fancied himself putting it round Tabitha\u0027s ample shoulders in the little housekeeper\u0027s room at the Angler\u0027s Nest, a room that was just large enough to hold a linen cupboard, a Pembroke table, a comfortable armchair, and Tabitha, who seemed bigger than all the furniture put together. \n \n He was a man of warm affections, and of that constancy of mind and temper to which forgetfulness of old ties or indifference to past associations is impossible. Tabitha\u0027s image was associated with all the tenderest memories of his youth; with his mother\u0027s widowhood, and with her second marriage—a foolish marriage. At seven and thirty years of age she had taken to herself a second husband, some years her junior, in the person of George Leland, a well-meaning and highly intellectual curate with weak lungs, a union entered upon while her only son was a cadet, and which left her four years later again a widow, with an infant daughter, a child born amidst sickness and sorrow, and christened at the father\u0027s desire Allegra, as if she had entered a world of joy. Through that Indian summer of his mother\u0027s second love, in all the cares and griefs of her second marriage, Tabitha had been trusty and devoted, nursing the frail husband through that last year of fading life which was one long illness, comforting the widow, and rearing the sickly baby until it blossomed into a fine healthy child, whose strength and beauty took every one by surprise. \n \n With all the joys and sorrows of his mother\u0027s life Tabitha had been associated for five and thirty years of conscientious service; and to have lost the good soul now from his fireside was a positive affliction to Martin Disney. Her loss gave an air of instability to his domestic life. Who would ever care for his property as Tabitha had cared—Tabitha who had seen the china and the pictures and drawings collected piece[Pg 96] by piece, who had seen the old family silver drop in by way of legacy from this and that aunt or uncle, till the safe was full of treasures, every one of which had its distinct history? What would a new housekeeper care for General Disney\u0027s coffee-pot, for the George the Second urn that had belonged to his uncle the Indian judge, for his grandmother\u0027s decanter stands? A modern servant would scoff at decanter stands; would wonder they were not melted down. No, rejoiced as he was to be at home once more, home without Tabitha would be something less than home to Martin Disney. \n \n He found Crown Terrace, a row of neat little houses high above the harbour on the Helston road. He had no need to look at the numbers on the doors. He knew Tabitha\u0027s house at a glance, four or five doors off. Who else would have devised such pretty window-boxes, so simple and so artistic; or who else would have hit upon so perfect a harmony of colour in the flowering plants? Who else, of that lowly status, would have chosen such curtains or draped them so gracefully? The little bow-windowed band-box of a house was as pretty as a Parisian toy. \n \n Tabitha was in the window, working with scissors and sponge at one of the flower-boxes. Never an aphid was allowed to rest on Tabitha\u0027s roses or geraniums. She gave a little cry of mixed alarm and delight as she saw that stalwart figure come between her and the sunshine. \n \n \"Lor\u0027 sakes, Captain Martin, is it you?\" she cried. \n \n \"Yes, Tabby, it is I—and I want to know what you\u0027ve got to say to me. Do you know how a deserter feels when he suddenly finds himself face to face with his commanding officer? I never had such a knock-down blow as when I came home the day before yesterday and found you had deserted your post—you whom I trusted so implicitly.\" \n \n Tabitha looked at him dumbly—entreatingly—as if she were mutely supplicating him not to be angry. She took this reproof with an air of having thoroughly deserved it, of not having any plea to offer in her defence. \n \n \"You\u0027ll come in and sit down a bit, won\u0027t you, Captain[Pg 97] Martin?\" she said deprecatingly; and then, without waiting for an answer, she bustled out of the parlour, and anon appeared at the open door. \n \n \"Yes, of course I am coming in. I have a great deal to say to you—much more than can be said in the open street.\" \n \n Tabitha ushered him into the little parlour; so neat, so cool and dainty a bower, albeit the whole of its contents would scarcely have realized ten pounds at an auction. She offered him her most luxurious easy-chair—a large Madeira chair, with pale chintz cushions and artistic draping; and then, when he had seated himself, she stood before him like a prisoner at the bar, and with unmistakable guilt disturbing the broad placidity of her countenance. \n \n \"Tabby, there is my offering from the Indies. May it keep you warm when you run out upon your mysterious errands on autumn evenings, as you used to do in my mother\u0027s time. Sit down, pray; I have lots to say to you.\" \n \n Tabitha received the comfortable gift with rapturous thanks. That Captain Martin should have thought of her, so far away, with his head full of fighting, and with death looking him in the face! It was too much, and the tears rolled down her honest cheeks as she thanked him. \n \n \"And now, Tabitha, I want a candid answer to a straight question. Why did you leave my wife last January?\" \n \n \"That\u0027s easily explained, sir. I\u0027m getting old, and I was tired of service. Mrs. Disney was very well able to spare me. Perhaps she didn\u0027t set the same value on me as you did. Young people like young faces about them.\" \n \n \"All that I can understand; but it didn\u0027t exonerate you from your duty to me. You promised me to take care of my young wife.\" \n \n \"I did my best, Captain Martin, as long as I could give satisfaction,\" faltered Tabitha, growing very pale under this reproof. \n \n \"Had you any misunderstanding with Mrs. Disney? Did she find fault with you?\" \n \n \"Oh no, sir. Mrs. Disney is not one to find fault. She\u0027s[Pg 98] too easy, if anything. No one could be sweeter than she was to me. God knows, if she had been my own daughter I could not have loved her better than I did.\" \n \n Here Tabitha broke down altogether, and sobbed aloud. \n \n \"Come, come, my good soul, don\u0027t distress yourself,\" cried Disney, touched by this emotion. \"You loved her; you could not help loving her, could you? And yet you left her.\" \n \n \"I was getting tired and old, sir; and I had saved enough money to furnish a small house; and my sister, Mrs. David, being a widow without chick or child, wanted me to join her in a lodging-house at the seaside. She\u0027s a beautiful cook, is my sister, much better than ever I was. So perhaps I was over-persuaded: and here I am. What\u0027s done cannot be undone, Captain Martin; but if ever Mrs. Disney should be ill or in grief or trouble, and she should want me, I\u0027ll go to her without an hour\u0027s loss of time. I can never forget that she is your wife, and that she was a kind mistress to me.\" \n \n Martin Disney breathed more freely after this speech. He had been curiously disturbed at the idea of a breach between his wife and the old and faithful servant. \n \n \"Well, Tabby, I\u0027m glad at least you and my wife are not ill friends,\" he said. \"I do not care for the loosening of old ties. And now I must be off. Mrs. Disney is waiting for me at the Green Bank.\" \n \n Tabitha seemed a little startled on hearing that her late mistress was in Falmouth, but she made no remark upon the fact. \n \n \"Good-bye, Tabby. Stay, there\u0027s one favour you can do me. Get me a good cook. The woman we have at present would be a blight upon the happiest home in Christendom.\" \n \n \"I\u0027ll find you a better one, sir. I\u0027ll set about hunting for a good one this afternoon.\" \n \n Martin shook hands with her on the door-step, and she stood watching him till he disappeared at the turn of the road. She watched him with a countenance full of sorrow. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2255/63445.html","bookId":438,"book":{"id":438,"title":"All along the River","description":"简介： It had been raining all the morning, and it was raining still, in that feeble and desultory manner which presages a change of some kind, when the postman came with the long-expected Indian letter....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2255","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
