{"id":67299,"no":34,"title":"Page 34","content":"When Alex and I are alone we don’t do much—just sit and talk—but still time seems to shrivel away, fast as paper catching on fire. One minute it’s three o’clock in the afternoon. The next minute, I swear, the light is draining from the sky and it’s almost curfew. Alex tells me stories about his life: about his “aunt” and “uncle,” and some of the work they do, although he’s still pretty vague about what the sympathizers and the Invalids are aiming for and how they’re working to achieve it. That’s okay. I’m not sure I want to know. When he mentions the need for resistance, there is a tightness to his voice, and anger coiling underneath his words. At those times, and only for a few seconds, I’m still afraid of him, still hear the word Invalid drumming in my ear. But mostly Alex tells me normal stuff, about his aunt’s Frito pie and how whenever they get together his uncle gets a little too tipsy and tells the same stories about the past over and over. They’re both cured, and when I ask him whether they aren’t happier now, he shrugs and says, “They miss the pain, too.” This seems incredible to me, and he looks at me out of the corner of his eye and says, “That’s when you really lose people, you know. When the pain passes.” Mostly, though, he talks about the Wilds and the people who live there, and I lay my head on his chest and close my eyes and dream of it: of a woman everyone calls Crazy Caitlin, who makes enormous wind chimes out of scrap metal and crushed soda cans; of Grandpa Jones, who must be at least ninety but still hikes through the woods every day, foraging for berries and wild animals to eat; of campfires outside and sleeping under the stars and staying up late to sing and talk and eat, while the night sky goes smudgy with smoke. I know that he still goes back there sometimes, and I know he still considers it his real home. He nearly says as much when I tell him one time that I’m sorry I can’t go home with him to check out his studio on Forsyth Street, where he has lived since starting at the university—if any of his neighbors saw me going into the building with him, we’d be finished. But he corrects me really quickly, “That’s not home.” He admits that he and the other Invalids have found a way to get in and out of the Wilds, but when I press him for details he clams up. “Someday maybe you’ll see,” is all he says, and I’m equal parts terrified and thrilled. I ask him about my uncle, who escaped before he could stand trial, and Alex frowns and shakes his head. “Hardly anybody goes by a real name in the Wilds,” he says, shrugging. “He doesn’t sound familiar, though.” But he explains that there are thousands and thousands of settlements all around the country. My uncle could have gone anywhere—north or south or west. At least we know he didn’t go east; he would have ended up in the ocean. Alex tells me that there are at least as many square miles of wilderness in the USA as there are recognized cities. This is so incredible to me that for a while I can’t believe it, and when I tell Hana she can’t believe it either. Alex is a good listener, too, and can stay silent for hours while I tell him about growing up in Carol’s house, and how everybody thinks Grace can’t speak and only I know the truth. He laughs out loud when I describe Jenny, and her pinched look and old-lady face and habit of looking down her nose at me like I’m the nine-year-old. I feel comfortable talking about my mother with him too, and how it used to be when she was alive and it was just the three of us—me, her, and Rachel. I tell him about the sock hops and the way my mom used to sing us lullabies, even though I can only remember a few snatches of the songs. Maybe it’s the way he listens so quietly, and stares at me steadily with his eyes bright and warm, and never judges me. One time I even tell him about the last thing my mom ever said to me, and he just sits and rubs my back when suddenly I feel like I’m about to cry. The feeling passes. The warmth of his hands draws it out of me. And, of course, we kiss. We kiss so much that when we’re not kissing it feels weird, like I get used to breathing through his lips and into his mouth. Slowly, as we get more comfortable, I start to explore other parts of his body too. The delicate structure of his ribs under his skin, his chest and shoulders like chiseled stone, the soft curls of pale hair on his legs, the way his skin always smells a little bit like the ocean—all beautiful and strange. Even crazier is that I let him look at me, too. First I’ll only let him pull my shirt aside and kiss my collarbone and shoulders. Then I let him draw my whole shirt over my head and lie me down in the bright sunshine and just stare at me. The first time I’m shaking. I keep having the urge to cross my hands over my chest, to cover up my breasts, to hide. I’m suddenly aware of how pale I look in the sunshine, and how many moles I have spotting up and down my chest, and I just know he’s looking at me thinking I’m wrong or deformed. But then he breathes, “Beautiful,” and when his eyes meet mine I know that he really, truly means it. That night, for the first time in my life, I stand in front of the bathroom mirror and don’t see an in-between girl. For the first time, with my hair swept back and my nightgown slipping off one shoulder and my eyes glowing, I believe what Alex said. I am beautiful. But it’s not just me. Everything looks beautiful. The Book of Shhh says that deliria alters your perception, disables your ability to reason clearly, impairs you from making sound judgments. But it does not tell you this: that love will turn the whole world into something greater than itself. Even the dump, shimmering in the heat, an enormous mound of scrap metal and melting plastic and stinking things, seems strange and miraculous, like some alien world transported to earth. In the morning light the seagulls perched on the roof of city hall look like they’ve been coated in thick white paint; as they light up against the pale blue sky I think I’ve never seen anything so sharp and clear and pretty in my life. Rainstorms are incredible: falling shards of glass, the air full of diamonds. The wind whispers Alex’s name and the ocean repeats it; the swaying trees make me think of dancing. Everything I see and touch reminds me of him, and so everything I see and touch is perfect. The Book of Shhh also doesn’t mention the way that time will start to run away from you. Time jumps. It leaps. It pours away like water through fingers. Every time I come down to the kitchen and see that the calendar has flipped forward yet another day I refuse to believe it. A sick feeling grows in my stomach, a leaden sensation that gets heavier every day. Thirty-three days until the procedure. Thirty-two days. Thirty days. And in-between, snapshots, moments, mere seconds; Alex smearing chocolate ice cream on my nose after I’ve complained I’m too hot; the heavy drone of bees circling above us in the garden, a neat line of ants marching quietly over the remains of our picnic; Alex’s fingers in my hair; the curve of his elbow under my head; Alex whispering, “I wish you could stay with me,” while another day bleeds out on the horizon, red and pink and gold; staring up at the sky, inventing shapes for the clouds: a turtle wearing a hat, a mole carrying a zucchini, a goldfish chasing a rabbit that is running for its life. Snapshots, moments, mere seconds: as fragile and beautiful and hopeless as a single butterfly, flapping on against a gathering wind. Chapter Seventeen “There has been significant debate in the scientific community about whether desire is a symptom of a system infected with amor deliria nervosa, or a precondition of the disease itself. It is unanimously agreed, however, that love and desire enjoy a symbiotic relationship, meaning that one cannot exist without the other. Desire is enemy to contentment; desire is illness, a feverish brain. Who can be considered healthy who wants? The very word want suggests a lack, an impoverishment, and that is what desire is: an impoverishment of the brain, a flaw, a mistake. Fortunately, that can now be corrected.” —From The Roots and Repercussions of Amor Deliria Nervosa on Cognitive Functioning, 4th edition, by Dr. Phillip Berryman August makes itself comfortable in Portland, breathes its hot and stinking breath over everything. The streets are unbearable during the day, the sun unrelenting, and people rush the parks and beaches, desperate for shade or breeze. It gets harder to see Alex. East End Beach— normally unpopular—is packed most of the time, even in the evenings after I get off work. Twice I show up to meet him and it’s too dangerous for us to talk or make a sign to each other, except for the quick nod that might pass between two strangers. Instead we lay out beach towels fifteen feet apart on the sand. He slips on his headphones and I pretend to read. Whenever our eyes meet my whole body lights up like he’s lying right next to me, rubbing his hand on my back, and even though he keeps a straight face, I can tell by his eyes that he’s smiling. Nothing has ever been so painful or delicious as being so close to him and being unable to do anything about it: like eating ice cream so fast on a hot day you get a splitting headache. I start to understand what Alex said about his “aunt” and “uncle”—about how they even missed the pain after their procedures. Somehow, the pain only makes it better, more intense, more worth it. Since the beaches are out, we stick to 37 Brooks. The garden is suffering from the heat. It hasn’t rained in more than a week, and the sunlight filtering through the trees—which in July fell softly, like the lightest footstep—now slices daggerlike through the canopy of trees, turning the grass brown. Even the bees seem drunk in the heat, circling slowly, colliding, hitting up against the withering flowers before thudding to the ground, then starting dazedly back into the air. One afternoon Alex and I are lying on the blanket. I’m on my back; the sky above me seems to break apart into shifting patterns of blue and green and white. Alex is lying on his stomach and seems nervous about something. He keeps lighting matches, watching them flare, and blowing them out only when they’re almost at his fingertips. I think about what he told me that time in the shed: his anger about coming to Portland, the fact that he used to burn things. There is so much about him I don’t know—so much past and history buried somewhere inside of him. He has had to learn to hide it, even more than most of us. Somewhere, I think, there is a center to him. It glows like a coal being slowly crushed into diamond, weighed down by layers and layers of surface. So much I haven’t asked him, and so much we never talk about. Yet in other ways I feel like I do know him, and have always known him, without having to be told anything at all. “It must be nice to be in the Wilds right now,” I blurt out, just for something to say. Alex turns to look at me, and I stammer quickly, “I mean—it must be cooler there. Because of all the trees and shade.” “It is.” He props himself up on one elbow. I close my eyes and see spots of color and light dancing behind my lids. For a second Alex doesn’t say anything, but I can feel him watching me. “We could go there,” he says at last.","sourceLink":"https://allnovel.net/delirium-delirium-1/page-34.html","bookId":1716,"book":{"id":1716,"title":"Delirium (Delirium #1)","description":"Storyline: Delirium (Delirium #1) Ninety-five days, and then I\u0027ll be safe. I wonder whether the procedure will hurt. I want to get it over with. It\u0027s hard to be patient. It\u0027s hard not to be afraid while I\u0027m still uncured, though so far the deliria hasn\u0027t touched me yet. Still, I worry. They say that in the old days, love drove people to madness. The deadliest of all deadly things: It kills you both when you have it and when you don\u0027t.","cover":"https://allnovel.net/images/delirium-delirium-1.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/delirium-delirium-1.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:03:56 AM"}}
