{"id":63537,"no":14,"title":"Page 14","content":"\"He had a boy with him. Early teens, light brown hair. Might have been his son.\"\\n\\n \"Oh, I did see them,\" Chance said. \"At least I saw a father and son in the front row, but I couldn\u0027t tell you what either one of them looked like. The only reason I noticed them at all is he might have been the only child in the place.\"\\n\\n \"But you know who I mean.\"\\n\\n \"Yes, but I can\u0027t tell you who he is.\" He closed his eyes. \"I can almost picture him, you know what I mean? I can just about see him sitting there, but if you asked me to describe him I don\u0027t think I could do it, beyond parroting back the description you just gave. What did he do?\"\\n\\n \"Do?\"\\n\\n \"It\u0027s some kind of case, isn\u0027t it? I thought you were in Maspeth just to watch the fights, but I guess you were working, weren\u0027t you?\"\\n\\n On another case, but there was no reason to go into all that. \"I had business there,\" I said.\\n\\n \"And this fellow\u0027s a part of it but you don\u0027t know who he is.\"\\n\\n \"He might be a part of it. I have to identify him in order to know.\"\\n\\n \"I get you.\" He considered it. \"He was right up in front,\" he said. \"Must be a real fan. Maybe he goes all the time. I was about to say I haven\u0027t seen him at the Garden or anywhere else, but the truth is I\u0027ve only been getting to the fights regularly since I bought an interest in Rasheed.\"\\n\\n \"You have a big piece of him, Chance?\"\\n\\n \"Very small, what you\u0027d call minimum participation. You still like him? You said you did last night.\"\\n\\n \"He\u0027s impressive. He got hit too much with the right hand, though.\"\\n\\n \"I know he did. The Kid was saying the same thing. That Dominguez, though, his right came over the top very quickly.\"\\n\\n \"He was sudden, all right.\"\\n\\n \"He was indeed. And then, suddenly, he was gone.\" He smiled. \"I love boxing.\"\\n\\n \"So do I.\"\\n\\n \"It\u0027s brutal, it\u0027s barbaric. I can\u0027t justify it. But I don\u0027t care. I love it.\"\\n\\n \"I know. Have you been to Maspeth before, Chance?\"\\n\\n He shook his head. \"Way at the ass end of nowhere, isn\u0027t it? It\u0027s actually not that far from where I am in Greenpoint, except I didn\u0027t leave from Greenpoint when I went out there, and I didn\u0027t go to Greenpoint when I left there, so it didn\u0027t make me a whole lot of difference. I only went there because we had the fight there.\"\\n\\n \"Will you be going back?\"\\n\\n \"If we get another booking there, and if I don\u0027t have something else requiring my presence. Next bout scheduled is three weeks from this coming Tuesday in Atlantic City.\" He smiled. \"Donald Trump\u0027s place, it should be a little more luxurious than the New Maspeth Arena.\"\\n\\n He told me who Rasheed was matched up with and said I ought to come down. I said I\u0027d try. They wanted Rasheed to fight every three weeks, he said, but it was working out more like once a month.\\n\\n \"I\u0027m sorry I can\u0027t help you,\" he said. \"I could ask around if you\u0027d like. The people in Rasheed\u0027s corner, they\u0027re at the fights all the time. You still at the hotel?\"\\n\\n \"Same place.\"\\n\\n \"If I hear anything-\"\\n\\n \"I appreciate it, Chance. And, you know, it\u0027s nice to see how everything\u0027s turned out.\"\\n\\n \"Thank you.\"\\n\\n At the door I said, \"Oh, I almost forgot. Do you know anything about the placard girl?\"\\n\\n \"The what?\"\\n\\n \"You know. Prances around the ring holding up the number of the next round.\"\\n\\n \"They call that a placard girl?\"\\n\\n \"I don\u0027t know. I suppose you could call her Miss Maspeth. I just wondered-\"\\n\\n \"If I knew anything about her. I can tell you she had long legs.\"\\n\\n \"I noticed that myself.\"\\n\\n \"And skin, I seem to remember she had a lot of skin. I\u0027m afraid that\u0027s the extent of my knowledge, Matthew. I\u0027m out of that business, thanks to you.\"\\n\\n \" \u0027Out of that business.\u0027 You think she looked like a working girl?\"\\n\\n \"No,\" he said, \"I think she looked like a nun.\"\\n\\n \"One of the Poor Clares.\"\\n\\n \"I was thinking a Sister of Charity. But you could be right.\"\\n\\n Chapter 8\\n\\n There\u0027s a saloon called Hurley\u0027s on Sixth Avenue, diagonally across the street from the glass and steel tower where Five Borough Cable Sportscasts had a suite of offices. People from NBC have gone there for years, and Johnny Carson made the place famous back when he did his show live from New York; it was the site of all of his Ed McMahon drinking jokes. Hurley\u0027s is still in its original location, housed in one of the only older buildings still standing on that stretch of Sixth. Television people still patronize the place, to kill an hour or an afternoon, and one fairly frequent visitor was Richard Thurman. He often came in at the end of the workday and stayed long enough to have one drink, sometimes two, before heading on home.\\n\\n I didn\u0027t have to be the world\u0027s greatest detective to learn this, because it was in the file Joe Durkin had let me read. I got to Hurley\u0027s around four-thirty and stood at the bar with a glass of club soda. I\u0027d had the thought of trying to pump the bartender but the place was crowded and he was far too busy for that sort of exploratory conversation. Besides, we\u0027d have had to shout at each other in order to be heard.\\n\\n The fellow next to me wanted to talk about the Super Bowl, which had taken place the preceding Sunday. It was too one-sided to sustain a conversation for long, and it turned out we\u0027d both turned it off at halftime. That common bond moved him to buy me a drink, but his enthusiasm dimmed when he found out I was drinking soda water and winked out altogether when I tried to turn the conversation to boxing. \"That\u0027s no sport,\" he said. \"A couple of ghetto kids trying to beat each other to death. Why not pull the stops out, give \u0027em both guns and let \u0027em shoot each other.\"\\n\\n A little after five I saw Thurman come in. He was with another man about his age and they found standing room down at the far end of the bar from me. They ordered drinks, and after ten or fifteen minutes Thurman left by himself.\\n\\n A few minutes later so did I.\\n\\n THE restaurant on the ground floor of Thurman\u0027s building on West Fifty-second was called Radicchio\u0027s. I stood across the street and established that there were no lights on in the top-floor apartment. The one a flight below, the Gottschalk place, was also dark, with Ruth and Alfred in West Palm Beach for the season.\\n\\n I had skipped lunch, so I had an early dinner at Radicchio\u0027s. There were only two other tables occupied, both by young couples deep in earnest conversation. I felt like calling Elaine and telling her to hop in a cab and join me, but I wasn\u0027t sure that would be a good idea.\\n\\n I had some veal and a half-portion of farfalle, I think it\u0027s called, a bowtie-shaped pasta which they served with a spicy red sauce. The small salad that came with the meal held plenty of the bitter leaf that had given the restaurant its name. A line on the menu advised me that a dinner without wine was like a day without sunshine. I drank water with my meal, and espresso afterward. The waiter brought an unrequested bottle of anisette to my table. I motioned for him to take it away.\\n\\n \"Is no charge,\" he assured me. \"You put a drop in your \u0027spresso, makes it taste good.\"\\n\\n \"I wouldn\u0027t want it to taste that good.\"\\n\\n \"Scusi?\"\\n\\n I motioned again for him to take the bottle and he shrugged and carried it back to the bar. I drank my espresso and tried not to imagine it tasting of anisette. Because it wasn\u0027t the taste that something in me yearned for, any more than it was the taste that prompted them to bring the bottle to the table. If anise improved the flavor of coffee people would add a spoonful of seeds to the coffee grounds, and nobody does.\\n\\n It was the alcohol, that\u0027s what called to me, and I suppose it had been crooning to me all day long, but its siren song had grown stronger in the past hour or two. I wasn\u0027t going to drink, I didn\u0027t want to drink, but some stimulus had triggered a cellular response and awakened something deep within me, something that would always be there.\\n\\n If I do go out, if I go and pick up a drink one of these days, it\u0027ll be a quart of bourbon in my room, or maybe a bottle of Mick\u0027s twelve-year-old Irish. It won\u0027t be a demitasse of espresso with a spoonful of fucking anisette floating on the top.\\n\\n I looked at my watch. It was barely past seven, and the meeting at St. Paul\u0027s doesn\u0027t get under way until eight-thirty. But they open the doors an hour before the meeting starts, and it wouldn\u0027t hurt me to get there early. I could help set up chairs, put out the literature and the cookies. On Friday nights we have a step meeting, with the discussion centering on one of the Twelve Steps that comprise AA\u0027s spiritual program. This week we\u0027d be back on the First Step. \"We admitted we were powerless over alcohol- that our lives had become unmanageable.\"\\n\\n I caught the waiter\u0027s eye and signaled for the check.\\n\\n AT the end of the meeting Jim Faber came up to me and confirmed our dinner date for Sunday. He\u0027s my sponsor and we have a standing date for Sunday dinner, unless one of us has to cancel.\\n\\n \"I think I\u0027ll stop at the Flame,\" he said. \"I\u0027m in no rush to get home.\"\\n\\n \"Something the matter?\"\\n\\n \"It\u0027ll keep until Sunday. How about you, you want to get some coffee?\"\\n\\n I begged off and walked up to Sixty-first and over to Broadway. The video store was open, and looked unchanged since six months ago. It had more of a crowd this time, though, with people looking to insure themselves against an empty weekend. There was a short line at the counter and I joined it. The woman in front of me took home three movies and three packages of microwave popcorn.\\n\\n The owner still needed a shave. I said, \"You must sell a lot of popcorn.\"\\n\\n \"It\u0027s a good item for us,\" he agreed. \"Most of the shops carry it. I know you, don\u0027t I?\"\\n\\n I gave him a card. It had my name and phone number and nothing else. Jim Faber had printed up a whole box of them for me. He looked at it and at me, and I said, \"Back in July. A friend of mine rented a copy of The Dirty Dozen, and I-\"\\n\\n \"I remember. What\u0027s the matter now? Don\u0027t tell me it happened again.\"\\n\\n \"Nothing like that. But something\u0027s come up that makes it important for me to trace the source of that cassette.\"\\n\\n \"I think I told you. An old woman brought it in along with a whole batch of others.\"\\n\\n \"You told me.\"\\n\\n \"And did I tell you I never saw her before or since? Well, it\u0027s been six months and I still haven\u0027t seen her. I\u0027d love to help you, but-\"\\n\\n \"You\u0027re busy now.\"\\n\\n \"That\u0027s for sure. It\u0027s always like this on Friday nights.\"\\n\\n \"I\u0027d like to come back when it\u0027s quieter.\"\\n\\n \"That\u0027d be better,\" he said, \"but I don\u0027t know what I\u0027d be able to tell you. I didn\u0027t have any more complaints, so I think that one tape must have been the only one with a dirty movie dubbed on top of it. As far as locating the woman, the source of it, you know everything I know.\"\\n\\n \"You may know more than you realize. What\u0027s a good time tomorrow?\"\\n\\n \"Tomorrow? Tomorrow\u0027s Saturday. We open at ten in the morning and it\u0027s pretty quiet before noon.\"\\n\\n \"I\u0027ll come at ten.\"\\n\\n \"You know what? Make it nine-thirty. I generally get here early to catch up on the paperwork. I\u0027ll let you in and we can have a half hour before I open up.\"\\n\\n THE next morning I read the Daily News with my eggs and coffee. An elderly Washington Heights woman had been killed watching television, struck in the head by a stray bullet from a drive-by shooting on the street outside her apartment. The intended victim had undergone emergency surgery at Columbia Presbyterian and was in critical condition. He was sixteen years old, and police believed the shooting was drug-related. \\n\\n","sourceLink":"https://allnovel.net/a-dance-at-the-slaughter-house-matthew-scudder-9/page-14.html","bookId":2327,"book":{"id":2327,"title":"A Dance at the Slaughter House (Matthew Scudder #9)","description":"Storyline: A Dance At The Slaughterhouse (Matthew Scudder #9) \\n A Dance At The SlaughterhouseIn Matt Scudder\u0027s mind, money, power, and position elevate nobody above morality and the law. Now the ex-cop and unlicensed p.i. has been hired to prove that socialite Richard Thurman orchestrated the brutal murder of his beautiful, pregnant wife. During Scudder\u0027s hard drinking years, he left a piece of his soul on every seedy corner of the Big Apple. But this case is more depraved and more potentially devastating than anything he experienced while floundering in the urban depths. Because this investigation is leading Scudder on a frightening grand tour of New York\u0027s sex-for-sale underworld -- where an innocent young life is simply a commodity to be bought and perverted ... and then destroyed.\\n","cover":"https://allnovel.net/images/a-dance-at-the-slaughter-house-matthew-scudder-9.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-dance-at-the-slaughter-house-matthew-scudder-9.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:50:57 AM"}}
