{"id":63560,"no":37,"title":"Page 37","content":"\"What about the other boy? Bobby, the younger one.\"\n \"Jesus,\" he said. \"What have you got? You\u0027ve got a sketch based on a look you got at him sitting next to Stettner at a boxing match. You got some kid somebody hunted up who says he recognizes the kid and his name\u0027s Bobby, but he doesn\u0027t know his last name or where he\u0027s from or what happened to him. You got somebody else who says Bobby used to be with a pimp who used to threaten kids that he\u0027d send them out and they wouldn\u0027t come back.\"\n \"His name\u0027s Juke,\" I said. \"He shouldn\u0027t be too hard to trace.\"\n \"He was a cinch, as a matter of fact. People complain a lot about the computer system but it makes some things easy. Juke is a guy named Walter Nicholson. A/k/a Juke, a/k/a Juke Box. First bit he did was for breaking into coin-operated vending machines, which is where the nickname came from. Arrested for statutory rape, contributing to the delinquency of a minor, and immoral solicitation. In other words a lot of pimping arrests, a whole profile of pimping kids. A class act.\"\n \"Can\u0027t you pick him up? He could tie Bobby to Stettner.\"\n \"You got to get him to talk, which would be hard without having something to hold over his head, which I don\u0027t see here. And then you\u0027d have to get somebody to believe anything a scumbag like Juke might say. But you can\u0027t do any of that because the prick happens to be dead.\"\n \"Stettner got him.\"\n \"No, Stettner didn\u0027t get him. He-\"\n \"The same as he got Thurman, to get rid of a witness before anybody could get to him. Dammit, if I\u0027d come in right away, if I hadn\u0027t waited over the weekend-\"\n \"Matt, Juke got killed a week ago. And Stettner didn\u0027t have anything to do with it and probably doesn\u0027t even know it happened. Juke and another of Nature\u0027s noblemen shot each other in a social club on Lenox Avenue. They were fighting over a ten-year-old girl. Must be some hot broad, got two grown men shooting each other over her, don\u0027t you think?\"\n I didn\u0027t say anything.\n \"Look,\" he said, \"I fucking hate this. I got the word last night and I went in this morning and carried on, and they\u0027re right. They\u0027re wrong but they\u0027re right. And I waited until tonight to call you because I wasn\u0027t looking forward to this conversation, believe it or not. Much as I like your company under other circumstances.\" He poured more whiskey into his glass. I got a whiff of it, but it didn\u0027t make me want it. Nor was it the worst smell in Pete\u0027s All-American.\n I said, \"I think I understand, Joe. I knew it was thin with Thurman dead.\"\n \"With Thurman alive I think we probably would have had them. But once he\u0027s dead there\u0027s no case.\"\n \"But if you mount a full-scale investigation-\"\n \"Jesus,\" he said, \"don\u0027t you get it? There\u0027s no grounds for an investigation. There\u0027s no complaint to act on, there\u0027s no probable cause for a warrant, there\u0027s a whole lot of nothing is what there is. The man\u0027s not a criminal, for openers. Never been arrested. You say mob connections, but his name\u0027s not in any files, never came up in any RICO investigations. Man\u0027s clean as a whistle. Lives on Central Park South, makes a good living trading in foreign currencies-\"\n \"That\u0027s money laundering.\"\n \"So you say, but can you prove it? He pays his taxes, he gives to charities, he\u0027s made substantial political contributions-\"\n \"Oh?\"\n \"Don\u0027t give me that. It\u0027s not any clout that makes it impossible to take him down. Nobody ordered us off it because the prick\u0027s untouchable, he\u0027s got a hook with somebody important. No such thing. But he\u0027s not some street kid you can push around and never hear about it. You gotta have something\u0027ll stand up in court, and you want to know what stands up in court? Let me just say two words. You wanna hear two words? Warren Madison.\"\n \"Oh.\"\n \"Yeah, \u0027Oh.\u0027 Warren Madison, terror of the Bronx. Deals dope, kills four other dealers we know for sure and is listed as probable for five others, and when they finally corner this wanted fugitive in his mother\u0027s apartment he shoots six cops before they get the cuffs on him. He shoots six cops!\"\n \"I remember.\"\n \"And that cocksucker Gruliow defends him, and what does he do, what he always does, he puts the cops on trial. Spins out all this shit about how the Bronx cops were using Madison as a snitch, and they were giving him confiscated cocaine to sell, and then they tried to murder him to keep him from talking. Do you fucking believe it? Six police officers with bullets in \u0027em, not a single bullet in Warren fucking Madison, and that means it was all a police department plot to kill the fuck.\"\n \"The jury bought it.\"\n \"Fucking Bronx jury, they would have cut Hitler loose, sent him home in a cab. And that\u0027s with a piece of shit of a dope dealer that everybody knew was guilty. You imagine what you\u0027d get bringing a shaky case against a solid citizen like Stettner? Look, Matt, do you see what I mean? Do you want me to go over it again?\"\n I saw, but we went over it anyway. Somewhere in the course of it the Ten High began to get the upper hand. His eyes lost their sharp focus and he started slurring his words. Pretty soon he began repeating himself, losing track of his own arguments.\n \"Let\u0027s get out of this dive,\" I said. \"Are you hungry? Let\u0027s get something to eat, maybe some coffee.\"\n \"What\u0027s that supposed to mean?\"\n \"Just that I wouldn\u0027t mind some food.\"\n \"Horseshit. Don\u0027t patronize me, you son of a bitch.\"\n \"I wasn\u0027t doing that.\"\n \"Fuck you weren\u0027t. That what they teach you at those meetings? How to be a pain in the ass when another man wants to have a quiet couple of drinks?\"\n \"No.\"\n \"Just because you\u0027re some kind of candyass who can\u0027t handle it anymore doesn\u0027t mean God appointed you to sober up the rest of the fucking world.\"\n \"You\u0027re right.\"\n \"Sit down. Where you going? For Christ\u0027s sake sit down.\"\n \"I think I\u0027ll get on home now,\" I said.\n \"Matt? I\u0027m sorry. I was out of line there, okay? I didn\u0027t mean anything by it.\"\n \"No problem.\"\n He apologized again and I told him it was fine, and then the booze took him back in the other direction and he decided he didn\u0027t like the tone of what I\u0027d said. \"Hang on one second,\" I told him. \"Stay right where you are, I\u0027ll be back in a minute.\" And I walked out of there and headed home.\n He was drunk, with the better part of a bottle still sitting there in front of him. He had his service revolver on his hip and I thought I recognized his car parked at the curb alongside a fire hydrant. It was a dangerous combination, but God hadn\u0027t appointed me to sober up the rest of the fucking world, or to make sure everybody got home safe, either.\n Chapter 20\n When I went to sleep that night the videocassette was on the table next to the clock, and it was the first thing my eyes happened to hit the next morning. I left it there and went out to meet the day. That was Thursday, and while I didn\u0027t chase out to Maspeth to watch the fights that night, I did get home in time to catch the main event on television. Somehow it wasn\u0027t the same.\n Another day passed before it occurred to me that the cassette belonged in my safety-deposit box, and by then it was Saturday and the bank was closed. I saw Elaine Saturday; we spent the late afternoon browsing through art galleries in SoHo, ate at an Italian place in the Village, and listened to a piano trio at Sweet Basil. It was a day of long silences of the sort possible only for people who have grown very comfortable together. In the cab home we held hands and didn\u0027t say a word.\n I had told her earlier about my conversation with Joe, and neither of us returned to the topic that afternoon or evening. The following night Jim Faber and I had our standing Sunday dinner date, and I didn\u0027t discuss the case with him at all. It crossed my mind once or twice in the course of our conversation but it wasn\u0027t something I felt the need to talk about.\n It seems odd now, but I didn\u0027t even spend that much time thinking about it for those several days. It\u0027s not as though I had a great deal of other things on my mind. I didn\u0027t, nor did sports provide much in the way of diversion, not in that stretch of frozen desert that extends from the Super Bowl to the start of spring training.\n The mind, from what I know of it, has various levels or chambers, and deals with matters in many other ways than conscious thought. When I was a police detective, and since then in my private work, there have not been that many occasions when I sat down and consciously figured something out. Most of the time the accretion of detail ultimately made a solution obvious, but, when some insight on my part was required, it more often than not simply came to me. Some unconscious portion of the mind evidently processed the available data and allowed me to see the puzzle in a new light.\n So I can only suppose that I made an unconscious decision to shelve the whole subject of the Stettners for the time being, to put it out of my mind (or, perhaps, into my mind, into some deeper recess of self) until I knew what to do about it.\n It didn\u0027t take all that long. As to how well it worked, well, that\u0027s harder to say.\n TUESDAY morning I dialed 411 and asked for the number for Bergen Stettner on Central Park South. The operator told me she could not give out that number, but volunteered that she had a business listing for the same party on Lexington Avenue. I thanked her and broke the connection. I called back and got a different operator, a man, and identified myself as a police officer, supplying a name and shield number. I said I needed an unlisted number and gave him the name and address. He gave me the number and I thanked him and dialed it.\n A woman answered and I asked for Mr. Stettner. She said he was out and I asked if she was Mrs. Stettner. She took an extra second or two to decide, then allowed that she was.\n I said, \"Mrs. Stettner, I have something that belongs to you and your husband, and I\u0027m hoping that you\u0027re offering a substantial reward for its return.\"\n \"Who is this?\"\n \"My name is Scudder,\" I said. \"Matthew Scudder.\"\n \"I don\u0027t believe I know you.\"\n \"We met,\" I said, \"but I wouldn\u0027t expect you to remember me. I\u0027m a friend of Richard Thurman\u0027s.\"\n There was a pronounced pause this time, while I suppose she tried to work out whether her friendship with Thurman was a matter of record. Evidently she decided that it was.\n \"Such a tragic affair,\" she said. \"It was a great shock.\"\n \"It must have been.\"\n \"And you say you were a friend of his?\"\n \"That\u0027s right. I was also a close friend of Arnold Leveque\u0027s.\"\n Another pause. \"I\u0027m afraid I don\u0027t know him.\"\n \"Another tragic affair.\"\n \"I beg your pardon?\"\n \"He\u0027s dead.\"\n \"I\u0027m very sorry, but I never knew the man. If you could tell me what it is you want-\"\n \"Over the phone? Are you sure that\u0027s what you want?\"\n \"My husband\u0027s not here at the moment,\" she said. \"If you would leave your number perhaps he\u0027ll call you back.\"\n \"I have a tape Leveque made,\" I said. \"Do you really want me to tell you about it over the phone?\"\n \"No.\"\n \"I want to meet with you privately. Just you, not your husband.\"\n \"I see.\"\n \"Someplace public, but private enough that we won\u0027t be overheard.\" \n","sourceLink":"https://allnovel.net/a-dance-at-the-slaughter-house-matthew-scudder-9/page-37.html","bookId":2327,"book":{"id":2327,"title":"A Dance at the Slaughter House (Matthew Scudder #9)","description":"Storyline: \n A Dance At The Slaughterhouse (Matthew Scudder #9) \n A Dance At The SlaughterhouseIn Matt Scudder\u0027s mind, money, power, and position elevate nobody above morality and the law. Now the ex-cop and unlicensed p.i. has been hired to prove that socialite Richard Thurman orchestrated the brutal murder of his beautiful, pregnant wife. During Scudder\u0027s hard drinking years, he left a piece of his soul on every seedy corner of the Big Apple. But this case is more depraved and more potentially devastating than anything he experienced while floundering in the urban depths. Because this investigation is leading Scudder on a frightening grand tour of New York\u0027s sex-for-sale underworld -- where an innocent young life is simply a commodity to be bought and perverted ... and then destroyed.\n \n","cover":"https://allnovel.net/images/a-dance-at-the-slaughter-house-matthew-scudder-9.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-dance-at-the-slaughter-house-matthew-scudder-9.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:50:57 AM"}}
