{"id":90253,"no":21,"title":"Page 21","content":"\\n\\n “Can you tell us what you’ve seen?” Logan asked.\\n\\n Zachary sighed, glancing toward the chapel, and Logan had to wonder just what the man was seeing. He knew the Alamo as they couldn’t, as the best scholar couldn’t, as the most historically accurate filmmaker could never quite portray it.\\n\\n “There was one rather plump, pretty girl. And she saw me. She saw me, the way you see me. I watched the man following her. I was trying to tell her. To warn her. Then he approached her, and touched her, and I couldn’t hear what he said. She gave a startled look, and she seemed to fall toward him. I thought perhaps he’d given her bad news. They left together,” Zachary said.\\n\\n “You mean…she sank against him? But she was still conscious? Moving on her own?”\\n\\n “From what I saw, yes.” He pointed toward the street. “It was busy that day. I thought that if she was afraid or in trouble, she would cry out. But she didn’t. She went with him. It was as if she knew him, and yet, when he was following her, I didn’t think she did.”\\n\\n “Can you describe him? What did he look like? Who was he?” Kelsey asked anxiously.\\n\\n “He was Davy Crockett.”\\n\\n Logan saw the surprise register on Kelsey’s face.\\n\\n “Pardon me?” she said.\\n\\n “Zachary, I’ve never seen the ghost of Davy Crockett at the Alamo,” Logan began. “You’ve told me before that you sit here and think about him, but you’ve never seen him, either. I don’t believe the ghost of Davy Crockett, if he was here, would be out to hurt people.”\\n\\n Zachary shook his grizzled head. “Not the real Davy Crockett,” he said impatiently. “This man seemed to be one of the actors they bring in when they’re doing reenactments. Lord knows, I’ve watched enough of those through the years!”\\n\\n “So, someone dressed up as Davy Crockett?” Kelsey asked.\\n\\n “Someone trying to dress up like Davy,” Zachary said. “But he was ridiculous, this man. Oh, his clothing wasn’t bad. Had on buckskin and fringe, rather like my own trousers and jacket. Had on a cotton shirt in a plaid pattern. What looked so bad was his face. Fakest whiskers I’ve ever seen, and bad wig. Worse hat.”\\n\\n “Think, Zachary,” Kelsey urged. “Had you ever seen the man before?”\\n\\n Zachary shrugged. “Don’t rightly know. I mean, there’s so many of those actors who come and go, and around here, on Halloween, there are Davy Crocketts everywhere. When I did see him, I was barely aware of him at first. I thought a school group was coming. Then I noticed that he was following the young woman, and I tried to warn her. I think she even saw me, and she was laughing. She supposed I was playing with her. I tried to get her to follow me into the chapel. There were people there. Living, breathing people. I just felt he was…odd. Then he went up to her and I couldn’t get close enough to hear what he was saying. She sagged against him, like I told you, and they went away. I didn’t think much more about it. I’ve seen a lot here over the years. Many people pass through this place. Sometimes they’re smiling, sometimes they’re serious. Sometimes they leave together, and sometimes they leave alone.”\\n\\n “Have you seen the man since?” Logan asked him.\\n\\n “Don’t think I have,” Zachary said. “Hard to say, though. You get all kinds around here. The historical society is usually in on it, but you occasionally get folks who think they’d like to be heroes, too, and they dress up and come here. Every once in a while, you get the unemployed actor with a hat out for donations. But did I see this particular fellow again? I don’t rightly know.” He shook his head again and looked at Kelsey sorrowfully. “I didn’t know women were being killed. And I’d planned to talk to Logan the other day and find out if there was anything I needed to worry about, but he brushed me off. Rude, you know what I mean?” Zachary asked.\\n\\n Kelsey actually smiled as she looked past him at Logan. “Incredibly rude,” she agreed.\\n\\n “Zachary, you know damned well that you enjoy making me look like a fool who talks to himself,” Logan said. “We waited for you,” he added. “The other day.”\\n\\n Zachary shrugged. “Sometimes I like to walk around where the walls once stood,” he said. “Sometimes I like to walk on, heading in the direction I did the day I left to get help.” He turned to Kelsey and said sadly, “Men might be willing to die. Don’t mean they want to die.”\\n\\n Kelsey started to reach for him, but her hand ended up on Logan’s thigh, and she yanked it back.\\n\\n “Zachary, I’m so sorry about all your friends here,” she said.\\n\\n “It was a long time ago. I don’t know why I stay. Can’t help them now. I just keep thinking… . The provisional government was a mess. Who knows? More men might’ve come, and more might’ve died. And I didn’t get to see everything, but I did speak to some of the women afterward. Santa Anna, he was a bastard, executing people right and left. But he didn’t kill the women or the kids.”\\n\\n Kelsey murmured sympathetically.\\n\\n “I could never help them,” Zachary said.\\n\\n “But you can help us. You can help us now,” Logan told him.\\n\\n “What can I do?” Zachary asked. “You say women are being killed. I only saw what I did that one day, and even then… So what can I do now?”\\n\\n “You can watch for us, Zachary. You can watch what goes on. I’ll stop by every day. Tell me if you see this man again or anyone who might have been this man,” Logan said.\\n\\n “I can do that. Yes, I can do that.” Zachary nodded vigorously. He stared at the chapel entrance again. Tourists were flocking around; docents and interpreters were on duty. The sun was shining, and the sky was blue, and it was a beautiful day in Texas.\\n\\n Zachary spoke directly to Kelsey. “Davy Crockett died in the fighting, you know. That’s what they told me. Travis, he was killed right away. Some say Davy was taken and executed, but I talked to Susanna Dickinson after the battle—she was the wife of my friend Almaron Dickinson—and she said there was a commotion, the women and children were hiding, but she heard that Davy went down fighting. Santa Anna sent her and Joe—Travis’s slave—on to Gonzalez to warn the folks they’d all be dead if they kept fighting. And can you imagine? Santa Anna offered to adopt her little girl! This was after her husband was killed. Good for Susanna—she didn’t give an inch.”\\n\\n Logan let Zachary talk, although he’d heard his stories many times before.\\n\\n They needed Zachary now. He could be a witness—the camera and the recording no one could find.\\n\\n “I’m so sorry,” Kelsey was telling Zachary.\\n\\n He shook his head. “So long ago, now. So long ago.” He suddenly turned to Logan. “What’s going on with the birds?” he asked.\\n\\n “What?” Frowning, Logan gave his attention to his surroundings.\\n\\n The birds were back.\\n\\n There were scores of them, and different varieties. Crows, of course. Black birds by the dozens, alighting here and there and everywhere around them. On cars, poles, wires, the eaves of the old chapel. And there were sparrows, pigeons, seagulls and more.\\n\\n As he looked, an arrow of flapping wings passed overhead and soared toward the south.\\n\\n He stood, saying, “Zachary, please keep watch for us. Tell me about anything you see, whether you think it’s important or not.”\\n\\n Zachary was on his feet, as well, and Kelsey rose at his side, studying the birds. She frowned, then said to Zachary, “Thank you so much. I’m so glad to know you.”\\n\\n “My pleasure to serve you, beautiful lady.” Zachary made a slight bow.\\n\\n Logan regarded her for a moment himself. Kelsey was just that, a “beautiful lady.” He believed she could be tough, and he was sure she knew how to use her weapon, and that she was effective in law enforcement. But there was a ladylike quality about her, in her movements, her manner of speech, the empathy in her emerald eyes.\\n\\n And yes, she was beautiful.\\n\\n “We have to go,” he said.\\n\\n Her level gaze reminded him that they’d searched before and found nothing.\\n\\n But she nodded; they had to keep trying.\\n\\n They returned to Logan’s car. “The birds were flying south,” he said.\\n\\n “We already went south, but we could have missed something.” She stared out the window intently while Logan drove as slowly as he could.\\n\\n “Are we looking for an actor?” she asked.\\n\\n “It could be an actor,” he said. “Or someone who knows there are always actors and would-be actors around. It’s easy—strange as that sounds—to dress up in buckskin and look like you belong at the Alamo. I wish Zachary could’ve just said, yes, he saw the man—he was tall and light-haired or short and swarthy, blue-eyed, green-eyed, businesslike, a bum… . But all we know is someone’s using history.”\\n\\n “Using history to find history,” she murmured. She turned to face him, her focus now on their quest, the anger gone from her voice. “I wonder if Zachary knew Rose Langley. The saloon would’ve been frequented by men who were at the Alamo—not when the siege happened, of course, but when they first came. There was a community here. And some of them must have known Rose.”\\n\\n “We’ll talk to him again,” Logan said. “We’ll talk to him every day until we learn the truth. Keep your eye on the street, okay?”\\n\\n “We’ve been here before,” she said.\\n\\n “We didn’t look hard enough.”\\n\\n “I’m keeping an eye out for trash piles, dumps, old construction heaps,” Kelsey said. “Fresh gardens, old gardens…”\\n\\n “I think this guy likes hiding his victims in plain sight, if that makes sense. He wants them to rot, and then be discovered.”\\n\\n “If he wants them discovered,” she said.\\n\\n “Oddly enough, I think he does.”\\n\\n “Stop!” Kelsey shouted.\\n\\n “Where?”\\n\\n “Anywhere around here.” \\n\\n","sourceLink":"https://allnovel.net/the-unseen-krewe-of-hunters-5/page-21.html","bookId":2279,"book":{"id":2279,"title":"The Unseen (Krewe of Hunters #5)","description":"Storyline: The Unseen (Krewe of Hunters #5) \\n 1800s. San Antonio, Texas: In room 207 at the Longhorn Saloon, in the long shadow of the Alamo itself, a woman renowned for her beauty was brutally murdered. Her killer was never found. \\n One year ago: In that same historic room, another woman vanished without a trace. Her blood was everywhere…but her body was never recovered. \\n Now: In the last month, San Antonio has become a dumping ground for battered bodies. \\n All young women, many of them long missing, almost all forgotten. Until now. \\n Texas Ranger Logan Raintree cannot sit by and let his city\u0027s most vulnerable citizens be slain. So when he is approached to lead a brand-new group of elite paranormal investigators working the case, he has no choice but to accept the challenge. And with it, his powerful ability to commune with the dead. \\n Among Logan\u0027s new team is Kelsey O\u0027Brien, a U.S. marshal known for her razor-sharp intuition and a toughness that belies her delicate exterior. Kelsey has been waiting all her life to work with someone who can understand her ability to \"see\" the past unfolding in the present. Now she has her chance. \\n Together, Kelsey and Logan follow their instincts to the Alamo and to the newly reopened Longhorn, which once tempted heroes with drink, cards and women. If the spirits of those long-dead Texans are really appearing to the victims before their deaths, only Kelsey and Logan have the skills to find out why. \\n And if something more earthly is menacing the city\u0027s oldest, darkest corners, only they can stop it—before more innocent women join the company of San Antonio\u0027s restless ghosts….\\n","cover":"https://allnovel.net/images/the-unseen-krewe-of-hunters-5.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-unseen-krewe-of-hunters-5.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:40:35 PM"}}
