{"id":96889,"no":4,"title":"Page 4","content":"SECTION II HALO CHAPTER TWO Deployment+00 hours:03 minutes:24 seconds (Major Silva Mission Clock) / Command HEV, in combat drop to surface of Halo. Consistent with standard UNSC insertion protocols, Major Antonio Silva’s HEV accelerated once it was launched so that it was among the first to enter Halo’s atmosphere. There were a number of reasons for this, including the strongly held belief that officers should lead rather than follow, be willing to do anything their troops were asked to do, and expose themselves to the same level of danger. There were still other reasons, however, beginning with the need to collect, sort, and organize the troops the moment their boots touched ground. Experience demonstrated that whatever the Helljumpers managed to accomplish during the first so-called golden hour would have a disproportionate effect on the success or failure of the entire mission. Especially now, as the Marines dropped onto a hostile world without any of the Intel briefings, virtual reality sims, or environment-specific equipment mods they would normally receive prior to such an insertion. To offset this, the command pod was equipped with a lot of gear that the regular “eggs” weren’t, including some high-powered imaging gear, and the Class C military AI required to operate it. This particular intelligence had been programmed with a male persona, the name Wellsley—after the famous Duke of Wellington—and a personality to match. Though he was a good deal less capable than a top-level AI like Cortana, all of Wellsley’s capabilities were focused on things military, which made him extremely useful if somewhat narrow-minded. The HEV shook violently and flipped end for end as the interior temperature rose to 98 degrees. Sweat poured down Silva’s face. “So,” Wellsley continued, his voice coming in via the officer’s ear plugs, “based on the telemetry available from space, plus my analysis, it appears that the structure tagged as HS2604 will meet your needs.” The AI’s tone changed slightly as a conversational subroutine kicked in. “Perhaps you would like to call it ‘Gawilghur,’ after the fortress I conquered in India?” “Thanks,” Silva croaked as the pod inverted a second time, “but no thanks. First: you didn’t take the fortress, Wellington did. Second: There weren’t any computers in 1803. Third: none of my troops would be able to pronounce ‘Gawilghur.’ The designator ‘Alpha Base’ will do just fine.” The AI issued a passable rendition of a human sigh. “Very well, then. As I was saying, ‘Alpha Base’ is located at the top of this butte.” The curvilinear screen located just six inches from the end of the Marine’s nose seemed to shiver and the video morphed into a picture of a thick, pillarlike formation topped by a mesa with some variegated flat-roofed structures located at one end. That was all Silva got to see before the HEV’s skin started to slough away revealing the alloy crash cage that contained the officer and his equipment. The air turned cold and ripped at his clothes. A moment later, the chute unfurled and assumed the shape of an airfoil. Silva winced as the pod decelerated with a bone-rattling jerk. His harness bit into his shoulders and chest. Wellsley sent an electronic signal to the rest of the Helljumpers. The remains of their HEVs turned in whatever direction was necessary in order to orient themselves on the command pod and follow it down through the atmosphere. All except for Private Marie Postly, who heard a snap as her main chute tore away. There was a sickening moment of freefall, then a jolt as the back-up chute deployed. A red light flashed on the instrument panel in front of her. She started to scream on freq two, until Silva cut her off. He closed his eyes. It was the death that every Helljumper feared, but none of them talked about. Somewhere, down toward Halo’s surface, Postly was about to dig her own grave. Silva felt his HEV stabilize and took another look at the butte. It was tall enough to provide anyone who owned it with a good view of the surrounding countryside, plus the sheer cliffs would force attackers to either come by air or fight their way up along narrow paths. As a bonus, the structures located on top would provide his Marines with defensible shelter. “It looks good. I like it.” “I thought you would,” Wellsley replied smugly. “There is one little problem, however.” “What’s that?” Silva shouted as the last section of the HEV’s skin peeled away and the slipstream tore at his mask. “The Covenant owns this particular piece of real estate,” the AI replied, calmly, “and if we want it, we’ll have to take it.” Deployment+00 hours:02 minutes:51 seconds (SPARTAN-117 Mission Clock) / Lifeboat Lima Foxtrot Alpha 43, in emergency descent to surface of Halo. The Master Chief watched the ring open up in front of him as the pilot guided the lifeboat in past a thick silvery edge, and down “under” the construct’s inner surface, before putting the tiny ship into a shallow dive calculated to place it on the strange landscape below. As he looked forward, he saw mountains, hills, and a plain that curved up and eventually out of focus as the ring swooped upward to complete itself somewhere over his head. The sight was beautiful, strange, and disorienting all at the same time. Then the sightseeing was over as the ground came up to meet them. The Master Chief couldn’t tell whether the lifeboat took enemy fire, suffered an engine failure, or nicked an obstacle on final approach. It really didn’t matter; the result was the same. The pilot had time to yell, “We’re coming in too fast!” A moment later, the hull bounced off something solid, and the Spartan was knocked off his feet. Pain stabbed through his temples as his helmet slammed into the bulkhead on his way to the deckplates—followed by clinging blackness . . . “Chief . . . Chief . . . Can you hear me?” Cortana’s voice echoed in his head. The Spartan opened his eyes and found himself facing the overhead light panels. They flickered and sparked. “Yes, I can hear you,” he replied. “There’s no need to shout.” “Oh, really ?” the AI replied in an arch tone. “Maybe you’d like to file a complaint with the Covenant. The crash triggered a lot of radio traffic and it’s my guess that the welcome wagon is on the way.” The Master Chief struggled to his feet and was just about to answer in kind when he saw the bodies. The impact of the crash had ripped the boat open and mangled the unprotected people within. No one else had survived. There was no time to dwell on that, not if he wanted to stay alive, and keep Cortana from falling into enemy hands. He hurried to gather as much ammo, grenades, and supplies as he could carry. He had just finished checking the pins on a quartet of frag grenades when Cortana piped up in alarm: “Warning—I’ve detected multiple Covenant dropships on approach. I recommend moving into those hills. If we’re lucky, the Covenant will believe that everyone aboard the lifeboat died in the crash.” “Acknowledged.” Cortana’s plan made sense. The Spartan surveyed the area for threats, then hurried toward a canyon and the bridge that crossed it. The span was devoid of safety railings, and was constructed from a strange, burnished metal. Beneath the bridge, a towering waterfall thundered down a massive drop-off. The rest of the world arched high overhead. Large outcroppings of weather- smoothed gray rock rose ahead, and a scattering of what looked like conifers reminded him of the forests he’d trained in on Reach. There were differences, however, like the way the ring tapered up from the horizon, the manner in which its shadow fell upon the land, and the crisp, clean air that came in through his filters. It was beautiful, breathtakingly so, but potentially dangerous as well. “Alert—Covenant dropship inbound.” Cortana’s voice was calm but insistent. The prophecy soon proved correct as a large shadow floated over the far end of the bridge and the ship’s engines screamed a warning. There was very little doubt that the Spartan had been spotted, so he made plans to deal with it. He reached the end of the bridge, saw a likely-looking boulder off to his left, and hurried to take advantage of it. He skirted the cliff edge, ignoring the long drop. Careful to watch his footing, the Master Chief circled the rock and found a crevice where the boulder touched the cliff. Now, with his back to the wall, he had a chance to defend himself. He checked his motion tracker, and realized that a pair of Covenant Banshees were practically on top of him. The alien aircraft boasted plasma cannon and fuel rod guns. Though not especially fast, they were still dangerous, especially against ground troops. Combined with air support, the Grunts and Elites that dropped from the fork- shaped alien troop carrier were a serious threat. He steadied his aim and sighted on the nearest Banshee. Careful not to fire early, the Spartan waited for the Banshee to come within range, then squeezed the trigger. The first assault ship came straight at him, which made it relatively easy to stay on target. Bullet impacts sparked on the Banshee’s hull as his ammo counter dwindled. The ship shuddered as at least some of the armor-piercing rounds penetrated the fuselage, pulled up out of its dive, and started to trail smoke. The Master Chief was in no position to appreciate the results of his efforts, however, as the second Banshee swooped out of the sun, pounded the area around him with plasma fire. His shield display dropped, then pulsed red. An alarm whined in his helmet speakers. The Master Chief returned fire. Without pause, he thumbed the magazine release and slammed a fresh clip into the receiver. He crouched, searched the sky for targets, and spotted Banshee number one in the nick of time. He braced himself for another assault. The Spartan allowed the enemy aircraft to approach, took a slight lead, and squeezed the trigger again. The Covenant ship ran into the stream of bullets, exploded into flames, and slammed into the cliff wall. The second ship was still up there, flying in lazy circles, but the Spartan knew better than to stand around and watch it. A half dozen red dots had appeared on his motion sensors. Each blip represented a potential assailant and most were located to his rear. The Master Chief waited for his shields to return to their full charge, then turned, jumped up onto the boulder, and took a quick look around. The Covenant dropship had deposited a clutch of Grunts on the far side of the canyon where they were busy examining the wreckage of his lifeboat. But that wasn’t all. To his left, on his side of the bridge, another group of Grunts was working its way through the trees, moving in his direction. They were still a ways off, however—which gave him a few seconds to prepare. Though not armed with the standard S2 AM Sniper’s Rifle, his weapon of choice for this sort of situation, the Spartan was packing the M6D pistol that Keyes had given him. It was equipped with a 2X scope and, in the hands of an expert, it could reach out and touch someone. The Master Chief drew the sidearm, turned to the group gathered around the wreckage, and placed the targeting circle over the nearest Grunt. In spite of the fact that they were of no immediate threat, the aliens on the other side of the canyon were in an ideal position to flank him, which meant he would deal with them first. Twelve shots rang out, and seven Grunts fell. Satisfied that his right flank was reasonably secure, he slammed a fresh clip into the pistol and shifted his attention to the enemy troops that were emerging from the trees. This group of Grunts was closer now, much closer, and they opened fire. The Master Chief chose to target the most distant alien first, thereby ensuring that he would still get a crack at the others, even if they turned and tried to escape. The pistol shots came in quick succession. The Grunts barked, hooted, and gurgled as the well-aimed bullets hurled their lifeless carcasses down the reverse slope. When there were no more targets to fire at, the Master Chief took a moment to reload the handgun, clicked on the safety, and returned the weapon to its holster. He jumped off the boulder and crouched under an outcropping of rock. He eyed the Banshee above. It was still there, circling well out of range, waiting to pounce should he emerge from cover. That meant he could sit there and wait for more ground forces to arrive, or he could abandon his hiding place and attempt to slip away. The Spartan had never been one for standing around, so he readied his assault rifle and slid forward over the rock. Once on open ground it was a short dash past the scattering of dead Grunts. He crouched beneath the cover offered by a copse of trees. He counted to three, then dashed from boulder to boulder. He leapfrogged uphill, still very much aware of the Banshee at his back, but reasonably certain he’d given the aircraft the slip. There were no blips on his threat detector, until he topped the rise and paused to examine the terrain ahead. A telltale red dot popped onto his HUD. The Master Chief eased his way forward, waiting for the moment of contact. Then he saw movement as hunched bodies dashed from one scrap of cover to the next. There were four of them, including a blue-armored Elite. The Elite charged recklessly forward, firing as he came. He’d engaged such Elites before—there was some significance to the aliens’ armor colors—and they always fought like aggressive rookies. A thin smile touched the Master Chief’s lips. He ignored the alien’s badly-placed shots, stood, and returned fire. The Elite’s advance stalled, and the Grunts began to fall back toward a stand of trees. His threat indicator sounded a warning and a red arrow pointed to the right. The Master Chief drew and primed an M9 HE-DP grenade. He turned just in time to see another Elite—this one in the scarlet armor of a veteran—charge him. The grenade was already in hand, and the distance to the target was sufficient, so the soldier let the M9 fly. The grenade detonated with a loud whump! and tossed the enemy soldier into the air, while stripping a nearby tree of half its branches. The rookie was close now, and roared a battle cry. The alien hosed the Master Chief with plasma fire. His shields dropped precipitously. The Spartan backed away, fired his assault rifle in short controlled bursts, and finally managed to knock the remaining Elite off his feet. With their leader down, the Grunts broke ranks and began to scamper away. The Master Chief cut their retreat short in a hail of bullets. He eased up on the trigger, felt the silence settle in around him, and knew he had made a mistake. The veteran had damned near blindsided him. How? He realized with a start that he was still fighting like part of a unit. Though he was trained to act independently, he had spent most of his military career as part of a team. The Elite had managed to flank him because his was simply accustomed to one of his fellow Spartans watching out for him. He was cut off from the chain of command, alone, and most likely surrounded by the enemy. He nodded, his face grim behind the mirrored visor. This mission would require a major revision in his tactics. He pushed his way up through a meadow thick with knee-high, spiky grass. He could hear the distant chatter of automatic weapons fire and knew some Marines were somewhere up ahead. He sprinted toward the sound of battle. Perhaps he wouldn’t be on his own for long. Deployment+00 hours:05 minutes:08 seconds (Captain Keyes’ Mission Clock) / Lifeboat Kilo Tango Victor 17, in emergency descent to surface of Halo. Maybe it was because the Autumn ’s navigator, Ensign Lovell, was at the controls, or maybe it was simply a matter of good luck, but whatever the reason, the rest of the trip down through Halo’s atmosphere was completely uneventful. So peaceful that it made Keyes nervous. “Where would you like me to put her down, sir?” Lovell inquired, as the lifeboat skimmed a grassy plain. “Anywhere,” Keyes answered, “so long as there aren’t any Covenant forces around. Some cover would be nice—since this boat will act like a magnet if we leave it out in the open.” Like most of its kind, the lifeboat had never been intended for extended atmospheric use; it flew like a rock, in fact. But the suggestion made sense, so the pilot turned toward what he had arbitrarily designated as the “west,” and the point where the grasslands met a tumble of low rolling hills. The lifeboat was low, so low that the Covenant patrol barely had time to see what it was before the tiny vessel flashed over their heads and disappeared. The veteran Elites, both of whom were mounted on small single-seat hoversleds, Ghosts, stood to watch the lifeboat skim the plain. The senior of the pair called the sighting in. They turned toward the hills and opened their throttles. What had promised to be a long, boring day suddenly seemed a great deal more interesting. The Elites glanced at each other, bent over their controls, and raced to see which of them could reach the lifeboat first—and which of them would score the first kill of the afternoon. Deep in the hills ahead, Lovell fired the lifeboat’s bow thrusters, dropped what flaps the stubby little wings had, and jazzed the boat’s belly jets. Keyes watched in admiration as the young pilot dropped the boat into a gully where it would be almost impossible to spot, except from directly overhead. Lovell had been a troubled officer, well on his way to a dishonorable discharge, when Keyes had recruited him. He’d come a long way since then. “Nice job,” the Captain said as the lifeboat settled onto its skids. “Okay, boys and girls, let’s strip this ship of everything that might be useful, and put as much distance between it and ourselves as we can. Corporal, post your Marines as sentries. Wang, Dowski, Abiad, open those storage compartments. Let’s see what brand of champagne the UNSC keeps in its lifeboats. Hikowa, give me a hand with this body.” There was a certain amount of commotion as ’Nosolee’s corpse was carried outside and unceremoniously dumped into a crevice, the boat was stripped, and the controls were disabled. With emergency packs on their backs, the bridge crew started up into the hills. They hadn’t gone far when a sonic boom rolled over the land, the Pillar of Autumn roared across the sky, and dropped over the horizon to the arbitrary “south.” Keyes held his breath as he waited to see what would happen. He, like all COs, had neural implants that linked him to the ship, the ship’s AI, and key personnel. There was a pause, followed by what felt like a mild earth tremor. A moment later, a terse message from Cortana’s subroutine scrolled across his vision, courtesy of his neural lace: CSR-1 :: BURST BROADCAST :: PILLAR OF AUTUMNIS DOWN. THOSE SYSTEMS WHICH REMAIN FUNCTIONAL ARE ON STANDBY. OPERATIONAL READINESS STANDS AT 8.7%. CSR-1 OUT. It wasn’t the sort of message that any commanding officer would want to receive. In spite of the fact that the Autumn would never swim through space again, Keyes took some small comfort from the fact that his ship still had the equivalent of a pulse, and might still come in handy. He forced a smile. “Okay, people, what are we waiting for? Our cave awaits. The last one to the top digs the latrine.” The bridge personnel continued their climb. In spite of efforts to keep the HEVs together, the Helljumpers came down in a landing zone that stretched approximately three kilometers in diameter. Some of the landings were classic two-point affairs in which the more fortunate Marines were able to jettison their crash cages about fifty meters off the ground, and land like sim soldiers in a training vid. Others were a good deal less graceful, as the skeletal remains of their drop pods smashed against cliffs, dropped into lakes, and in one unfortunate case rolled into a deep ravine. As the surviving Helljumpers extricated themselves from their HEVs, a homing beacon snapped to life, and they were able to orient themselves to the red square which appeared on their transparent eye-screens. That was where Major Silva had landed, a temporary HQ had been established, and the battalion would regroup. Each pod was stripped of extra weapons, ammo, and other supplies, which meant that the force which converged on the hot dry plateau was well equipped. Helljumpers were supposed to be able to operate without external resupply for two-week periods, and Silva was pleased that his troops had retained most of their gear, despite the difficult drop conditions.","sourceLink":"https://allnovel.net/halo-the-flood-halo-2/page-4.html","bookId":1634,"book":{"id":1634,"title":"Halo: The Flood (Halo #2)","description":"Storyline: Halo: The Flood (Halo #2) The Human-Covenant War, a desperate struggle for humankind’s very survival, has reached its boiling point on the mysterious, ring world called Halo. But the fierce Covenant warriors, the mightiest alien military force known, are not the only peril lying in wait. As the fortress world of Reach and its brave defenders were bombarded to rubble, a single cruiser fled the carnage with the battle’s only human survivors—Captain Keyes, his crew of a few hundred Marines, and the last remaining SPARTAN super-soldier, the Master Chief. With the cruiser’s artificial intelligence, Cortana, concealed in his battle armor, the Master Chief crash lands on Halo in the midst of a massive Covenant occupation. Curiously, the alien soldiers appear to be searching for something hidden on the ring. Built by a long-dead race, Halo harbors many deadly secrets, but one overshadows them all. Now the Master Chief must lead the scattered troops in a brutal race to unravel Halo’s darkest mystery—and unleash its greatest source of power. . . .","cover":"https://allnovel.net/images/halo-the-flood-halo-2.jpg","author":"William C. Dietz","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-the-flood-halo-2.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:23:14 PM"}}
