{"id":32660,"no":3,"title":"CHAPTER III. STARTLING NEWS.","content":"Fred Sheldon was the only child of a widow, who lived on a small place a mile beyond the village, and managed to eke out a living thereon, assisted by a small pension from the government, her husband having been killed during the late war. A half-mile beyond stood a large building, gray with age and surrounded with trees, flowers and climbing vines. The broad bricks of which it was composed were known to have been brought from Holland long before the revolution, and about the time when George Washington was hunting for the cherry-tree with his little hatchet. In this old structure lived the sisters Perkinpine—Annie and Lizzie—who were nearly seventy years of age. They were twins, had never been married, were generally known to be wealthy, but preferred to live entirely by themselves, with no companion but three or four cats, and not even a watch-dog. Their ancestors were among the earliest settlers of the section, and the Holland bricks could show where they had been chipped and broken by the bullets of the Indians who howled around the solid old structure,[Pg 18] through the snowy night, as ravenous as so many wolves to reach the cowering women and children within. The property had descended to the sisters in regular succession, and there could be no doubt they were rich in valuable lands, if in nothing else. Their retiring disposition repelled attention from their neighbors, but it was known there was much old and valuable silver, and most probably money itself, in the house. Michael Heyland was their hired man, but he lived in a small house some distance away, where he always spent his nights. Young Fred Sheldon was once sent over to the residence of the Misses Perkinpine after a heavy snowstorm, to see whether he could do anything for the old ladies. He was then only ten years old, but his handsome, ruddy face, his respectful manner, and his cheerful eagerness to oblige them, thawed a great deal of their natural reserve, and they gradually came to like him. He visited the old brick house quite often, and frequently bore substantial presents to his mother, though, rather curiously, the old ladies never asked that she should pay them a visit. The Misses Perkinpine lived very well indeed, and Fred Sheldon was not long in discovering it. When he called there he never could get away without eating some of the vast hunks of gingerbread and enormous pieces of thick, luscious pie, of which Fred, like all boys, was very fond. There was no denying that Fred had established himself as a favorite in that peculiar household, as he well deserved to be. [Pg 19] On the afternoon succeeding his switching at school he reached home and did his chores, whistling cheerily in the meanwhile, and thinking of little else than the great circus on the morrow, when he suddenly stopped in surprise upon seeing a carriage standing in front of the gate. Just then his mother called him to the house and explained: \"Your Uncle William is quite ill, Fred, and has sent for me. You know he lives twelve miles away, and it will take us a good while to get there; if you are afraid to stay here alone you can go with us.\" Fred was too quick to trip himself in that fashion. To-morrow was circus day, and if he went to his Uncle Will\u0027s, he might miss it. \"Miss Annie asked me this morning to go over and see them again,\" he said, alluding to one of the Misses Perkinpine, \"and they\u0027ll be mighty glad to have me there.\" \"That will be much better, for you will be so near home that you can come over in the morning and see that everything is right, but I\u0027m afraid you\u0027ll eat too much pie and cake and pudding and preserves.\" \"I ain\u0027t afraid,\" laughed Fred, who kissed his mother good-by and saw the carriage vanish down the road in the gloom of the gathering darkness. Then he busied himself with the chores, locked up the house and put everything in shape preparatory to going away. He was still whistling, and was walking rapidly toward the gate, when he was surprised and a little startled by[Pg 20] observing the figure of a man, standing on the outside, as motionless as a stone, and no doubt watching him. He appeared to be ill-dressed, and Fred at once set him down as one of those pests of society known as a tramp, who had probably stopped to get something to eat. \"What do you want?\" asked the lad, with an air of bravery which he was far from feeling, as he halted within two or three rods of the unexpected guest, ready to retreat if it should become necessary. \"I want you to keep a civil tongue in your head,\" was the answer, in a harsh rasping voice. \"I didn\u0027t mean to be uncivil,\" was the truthful reply of Fred, who believed in courtesy to every one. \"Who lives here, then?\" asked the other in the same gruff voice. \"My mother, Mrs. Mary Sheldon, and myself, but my mother isn\u0027t at home.\" The stranger was silent a moment, and then looking around, as if to make sure that no one was within hearing, asked in a lower voice: \"Can you tell me where the Miss Perkinpines live?\" \"Right over yonder,\" was the response of the boy, pointing toward the house, which was invisible in the darkness, but a star-like twinkle of light showed where it was, surrounded by trees and shrubbery. Fred came near adding that he was on his way there, and would show him the road, but a sudden impulse restrained him. The tramp-like individual peered through the gloom in the direction indicated, and then inquired: [Pg 21] \"How fur is it?\" \"About half a mile.\" The stranger waited another minute or so, as if debating with himself whether he should ask some other questions that were in his mind; but, without another word, he moved away and speedily disappeared from the road. Although he walked for several paces on the rough gravel in front of the gate, the lad did not hear the slightest sound. He must have been barefooted, or more likely, wore rubber shoes. Fred Sheldon could not help feeling very uncomfortable over the incident itself. The question about the old ladies, and the man\u0027s looks and manner impressed him that he meant ill toward his good friends, and Fred stood a long time asking himself what he ought to do. He thought of going down to the village and telling Archie Jackson, the bustling little constable, what he feared, or of appealing to some of the neighbors; and pity it is he did not do so, but he was restrained by the peculiar disposition of the Misses Perkinpine, who might be very much displeased with him. As he himself was about the only visitor they received, and as they had lived so long by themselves, they would not thank him, to say the least—that is, viewing the matter from his standpoint. \"I\u0027ll tell the ladies about it,\" he finally concluded, \"and we\u0027ll lock the doors and sit up all night. I wish they had three or four dogs and a whole lot of guns; or if I had a lasso,\" he added, recalling one of the circus[Pg 22] pictures, \"and the tramp tried to get in, I\u0027d throw it over his head and pull him half way to the top of the house and let him hang there until he promised to behave himself.\" Fred\u0027s head had been slightly turned by the circus posters, and it can hardly be said that he was the best guard the ladies could have in case there were any sinister designs on the part of the tramp. But the boy was sure he was never more needed at the old brick house than he was on that night, and hushing his whistle, he started up the road in the direction taken by the stranger. It was a trying ordeal for the little fellow, whose chief fear was that he would overtake the repulsive individual and suffer for interfering with his plans. There was a faint moon in the sky, but its light now and then was obscured by the clouds which floated over its face. Here and there, too, were trees, beneath whose shadows the boy stepped lightly, listening and looking about him, and imagining more than once he saw the figure dreaded so much. But he observed nothing of him, nor did he meet any of his neighbors, either in wagons or on foot, and his heart beat tumultuously when he drew near the grove of trees, some distance back from the road, in the midst of which stood the old Holland brick mansion. To reach it it was necessary to walk through a short lane, lined on either hand by a row of stately poplars, whose shade gave a cool twilight gloom to the intervening space at mid-day. [Pg 23] \"Maybe he isn\u0027t here, after all,\" said Fred to himself, as he passed through the gate of the picket fence surrounding the house, \"and I guess——\" Just then the slightest possible rustling caught his ear, and he stepped back behind the trunk of a large weeping willow. He was not mistaken; some one was moving through the shrubbery at the corner of the house, and the next minute the frightened boy saw the tramp come stealthily to view, and stepping close to the window of the dining-room, peer into it. As the curtain was down it was hard to see how he could discover anything of the inmates, but he may have been able to detect something of the interior by looking through at the side of the curtain, or possibly he was only listening. At any rate he stood thus but a short time, when he withdrew and slowly passed from view around the corner. The instant he was gone Fred moved forward and knocked softly on the door, so softly indeed, that he had to repeat it before some one approached from the inside and asked who was there. When his voice was recognized the bolt was withdrawn and he was most cordially welcomed by the old ladies, who were just about to take up their knitting and sewing, having finished their tea. When Fred told them he had come to stay all night and hadn\u0027t had any supper, they were more pleased than ever, and insisted that he should go out and finish a[Pg 24] large amount of gingerbread, custard and pie, for the latter delicacy was always at command. \"I\u0027ll eat some,\" replied Fred, \"but I don\u0027t feel very hungry.\" \"Why, what\u0027s the matter?\" asked Miss Annie, peering over her spectacles in alarm; \"are you sick? If you are we\u0027ve got lots of castor oil and rhubarb and jalap and boneset; shall I mix you up some?\" \"O my gracious! no—don\u0027t mention \u0027em again; I ain\u0027t sick that way—I mean I\u0027m scared.\" \"Scared at what? Afraid there isn\u0027t enough supper for you?\" asked Miss Lizzie, looking smilingly down upon the handsome boy. \"I tell you,\" said Fred, glancing from one to the other, \"I think there\u0027s a robber going to try and break into your house to-night and steal everything you\u0027ve got, and then he\u0027ll kill you both, and after that I\u0027m sure he means to burn down the house, and that\u0027ll be the last all of you and your cats.\" When the young visitor made such a prodigious declaration, he supposed the ladies would scream and probably faint away. But the very hugeness of the boy\u0027s warning caused emotions the reverse of what he anticipated. They looked kindly at him a minute or so and then quietly smiled. \"What a little coward you are, Fred,\" said Miss Annie; \"surely there is nobody who would harm two old creatures like us.\" \"But they want your money,\" persisted Fred, still standing in the middle of the floor. [Pg 25] Both ladies were too truthful to deny that they had any, even to such a child, and Lizzie said: \"We haven\u0027t enough to tempt anybody to do such a great wrong.\" \"You can\u0027t tell about that, then I \u0027spose some of those silver dishes must be worth a great deal.\" \"Yes, so they are,\" said Annie, \"and we prize them the most because our great, great, great-grandfather brought them over the sea a good many years ago, and they have always been in our family.\" \"But,\" interposed Lizzie, \"we lock them up every night.\" \"What in?\" \"A great big strong chest.\" \"Anybody could break it open, though.\" \"Yes, but it\u0027s locked; and you know it\u0027s against the law to break a lock.\" \"Well,\" said Fred, with a great sigh, \"I hope there won\u0027t anybody disturb you, but I hope you will fasten all the windows and doors to-night.\" \"We always do; and then,\" added the benign old lady, raising her head so as to look under her spectacles in the face of the lad, \"you know we have you to take care of us.\" \"Have you got a gun in the house?\" \"Mercy, yes; there\u0027s one over the fire-place, where father put it forty years ago.\" \"Is there anything the matter with it?\" \"Nothing, only the lock is broke off, and I think father said the barrel was bursted.\" [Pg 26] Fred laughed in spite of himself. \"What under the sun is such an old thing good for?\" \"It has done us just as much good as if it were a new cannon—but come out to your supper.\" The cheerful manner of the old ladies had done much to relieve Fred\u0027s mind of his fears, and a great deal of his natural appetite came back to him. He walked into the kitchen, where he seated himself at a table on which was spread enough food for several grown persons, and telling him he must not leave any of it to be wasted, the ladies withdrew, closing the door behind them, so that he might not be embarrassed by their presence. \"I wonder whether there\u0027s any use of being scared,\" said Fred to himself, as he first sunk his big, sound teeth into a huge slice of buttered short-cake, on which some peach jam had been spread! \"If I hadn\u0027t seen that tramp looking in at the window I wouldn\u0027t feel so bad, and I declare,\" he added in dismay, \"when they questioned me, I never thought to tell \u0027em that. Never mind, I\u0027ll give \u0027em the whole story when I finish five or six slices of this short-cake and some ginger-cake, and three or four pieces of pie, and then, I think, they\u0027ll believe I\u0027m right.\" For several minutes the boy devoted himself entirely to his meal, and had the good ladies peeped through the door while he was thus employed they would have been highly pleased to see how well he was getting along. \"I wish I was an old maid and hadn\u0027t anything to do but to cook nice food like this and play with the cats—my gracious!\" [Pg 27] Just then the door creaked, and, looking up, Fred Sheldon saw to his consternation the very tramp of whom he had been thinking walk into the room and approach the table. His clothing was ragged and unclean, a cord being drawn around his waist to keep his coat together, while the collar was up so high about his neck that nothing of the shirt was visible. His hair was frowsy and uncombed, as were his huge yellow whiskers, which seemed to grow up almost to his eyes, and stuck out like the quills on a porcupine. As the intruder looked at the boy and shuffled toward him, in his soft rubber shoes, he indulged in a broad grin, which caused his teeth to shine through his scraggly beard. He held his hat, which resembled a dishcloth, as much as anything, in his hand, and was all suavity. His voice sounded as though he had a bad cold, with now and then an odd squeak. As he bowed he said: \"Good evening, young man; I hope I don\u0027t intrude.\" As he approached the table and helped himself to a chair, the ladies came along behind him, Miss Lizzie saying: \"This poor man, Frederick, has had nothing to eat for three days, and is trying to get home to his family. I\u0027m sure you will be glad to have him sit at the table with you.\" \"Yes, I\u0027m awful glad,\" replied the boy, almost choking with the fib. \"I was beginning to feel kind of lonely, but I\u0027m through and he can have the table to himself.\" [Pg 28] \"You said you were a shipwrecked sailor, I believe?\" was the inquiring remark of Miss Lizzie, as the two sisters stood in the door, beaming kindly on the tramp, who began to play havoc with the eatables before him. \"Yes, mum; we was shipwrecked on the Jarsey coast; I was second mate and all was drowned but me. I hung to the rigging for three days and nights in the awfullest snow storm you ever heard of.\" \"Mercy goodness,\" gasped Annie; \"when was that?\" \"Last week,\" was the response, as the tramp wrenched the leg of a chicken apart with hands and teeth. \"Do they have snow storms down there in summer time?\" asked Fred, as he moved away from the table. The tramp, with his mouth full of meat, and with his two hands grasping the chicken-bone between his teeth, stopped work and glared at the impudent youngster, as if he would look him through and through for daring to ask the question. \"Young man,\" said he, as he solemnly resumed operations, \"of course, they have snow storms down there in summer time; I\u0027m ashamed of your ignorance; you\u0027re rather small to put in when grown-up folks are talking, and I\u0027d advise you to listen arter this.\" Fred concluded he would do so, using his eyes meanwhile. \"Yes, mum,\" continued the tramp; \"I was in the rigging for three days and nights, and then was washed off by the breakers and carried ashore, where I was robbed of all my clothing, money and jewels.\" [Pg 29] \"Deary, deary me!\" exclaimed the sisters in concert. \"How dreadful.\" \"You are right, ladies, and I\u0027ve been tramping ever since.\" \"How far away is your home?\" \"Only a hundred miles, or so.\" \"You have a family, have you?\" \"A wife and four babies—if they only knowed what their poor father had passed through—excuse these tears, mum.\" The tramp just then gave a sniff and drew his sleeve across his forehead, but Fred Sheldon, who was watching him closely, did not detect anything like a tear. But he noted something else, which had escaped the eyes of the kind-hearted ladies. The movement of the arm before the face seemed to displace the luxuriant yellow beard. Instead of sitting on the countenance as it did at first, even in its ugliness, it was slewed to one side. Only for a moment, however, for by a quick flirt of the hand, as though he were scratching his chin, he replaced it. And just then Fred Sheldon noticed another fact. The hand with which this was done was as small, white and fair as that of a woman—altogether the opposite of that which would have been seen had the tramp\u0027s calling been what he claimed. The ladies, after a few more thoughtful questions, withdrew, so that their guest might not feel any delicacy[Pg 30] in eating all he wished—an altogether unnecessary step on their part. Fred went out with them, but after he had been gone a few minutes he slyly peeped through the crack of the door, without the ladies observing the impolite proceeding. The guest was still doing his best in the way of satisfying his appetite, but he was looking around the room, at the ceiling, the floor, the doors, windows and fire-place, and indeed at everything, as though he was greatly interested in them, as was doubtless the case. All at once he stopped and listened, glancing furtively at the door, as if he feared some one was about to enter the room. Then he quietly rose, stepped quickly and noiselessly to one of the windows, took out the large nail which was always inserted over the sash at night to keep it fastened, put it in his pocket, and, with a half chuckle and grin, seated himself again at the table. At the rate of eating which was displayed, he soon finished, and, wiping his greasy hands on his hair, he gave a great sigh of relief, picked up his slouchy hat, and moved toward the door leading to the room in which the ladies sat. \"I\u0027m very much obleeged to you,\" said he, bowing very low, as he shuffled toward the outer door, \"and I shall ever remember you in my prayers; sorry I can\u0027t pay you better, mums.\" The sisters protested they were more than repaid in the gratitude he showed, and they begged him, if he ever came that way, to call again. [Pg 31] He promised that he would be glad to do so, and departed. \"You may laugh all you\u0027re a mind to,\" said Fred, when he had gone, \"but that\u0027s the man I saw peeping in the window, and he means to come back here to-night and rob you.\" The boy told all that he knew, and the ladies, while not sharing his fright, agreed that it was best to take extra precautions in locking up.","sourceLink":"http://novel.tingroom.com/duanpian/3290/89940.html","bookId":461,"book":{"id":461,"title":"A Young Hero","description":"简介： A fight! A fight! Form a ring! A dozen or more excited boys shouted these words, and, rushing forward, hastily formed a ring around two playmates who stood in the middle of the road, their hats off, eyes glaring, fists clenched, while they panted wit...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3290","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
