{"id":108166,"no":16,"title":"Page 16","content":"\u0027What did he write?\u0027 \u0027He was an itinerant poet. He was particularly at home with the haiku, the verse of seventeen syllables.\u0027 Tiger assumed a contemplative expression. He intoned: \u0027In the bitter radish that bites into me, I feel the autumn wind. \u0027Does that not say anything to you? Or this: \u0027The butterfly is perfuming its wings, in the scent of the orchid. \u0027You do not grasp the beauty of that image?\u0027 \u0027Rather elusive compared to Shakespeare.\u0027 \u0027In the fisherman\u0027s hut mingled with dried shrimps crickets are chirping.\u0027 Tiger looked at him hopefully. \u0027Can\u0027t get the hang of that one,\u0027 said Bond apologetically. \u0027You do not catch the still-life quality of these verses? The flash of insight into humanity, into nature? Now, do me a favour, Bondo-san. Write a haiku for me yourself. I am sure you could get the hang of it. After all you must have had some education?\u0027 Bond laughed. \u0027Mostly in Latin and Greek. All about Caesar and Balbus and so on. Absolutely no help in ordering a cup of coffee in Rome or Athens after I\u0027d left school. And things like trigonometry, which I\u0027ve totally forgotten. But give me a pen and a piece of paper and I\u0027ll have a bash, if you\u0027ll forgive the bad joke.\u0027 Tiger handed them over and Bond put his head in his hands. Finally, after much crossing out and rewriting he said, \u0027Tiger, how\u0027s this? It makes just as much sense as old Basho and it\u0027s much more pithy.\u0027 He read out: \u0027You only live twice: Once when you are born And once when you look death in the face.\u0027 Tiger clapped his hands softly. He said with real delight, \u0027But that is excellent, Bondo-san. Most sincere.\u0027 He took the pen and paper and jotted some ideograms up the page. He shook his head. \u0027No, it won\u0027t do in Japanese. You have the wrong number of syllables. But it is a most honourable attempt.\u0027 He looked keenly at Bond. \u0027You were perhaps thinking of your mission?\u0027 \u0027Perhaps,\u0027 said Bond with indifference. \u0027It is weighing on your mind?\u0027 \u0027The practical difficulties are bound to do so. I have swallowed the moral principles involved. Things being as they are, I have to accept that the end justifies the means.\u0027 \u0027Then you are not concerned with your own safety?\u0027 \u0027Not particularly. I\u0027ve had worse jobs to do.\u0027 \u0027I must congratulate you on your stoicism. You do not appear to value your life as highly as most Westerners.\u0027 Tiger looked at him kindly. \u0027Is there perhaps a reaso\u0027n for that?\u0027 Bond was offhand. \u0027Not that I can think of. But for God\u0027s sake chuck it, Tiger 1 None of your Japanese brain-washing! More sake, and answer my question of yesterday. Why weren\u0027t those men disabled by those terrific slashes to the groin? That might be of some practical value to me instead of all this waffle about poetry.\u0027 Tiger ordered the sake. He laughed. \u0027Unfortunately you are too old to benefit. I would need to have caught you at the age of about fourteen. You see, it is this way. You know the sumo wrestlers? It is they who invented the trick many centuries ago. It is vital for them to be immune from damage to those parts of the body. Now, you know that, in men, the testicles, which until puberty have been held inside the body, are released by a particular muscle and descend between the legs?\u0027 \u0027Yes.\u0027 \u0027Well the sumo wrestler will have been selected for his profession by the time of puberty. Perhaps because of his weight and strength, or perhaps because he comes of a sumo family. Well, by assiduously massaging those parts, he is able, after much practice, to cause the testicles to re-enter the body up the inguinal canal down which they originally descended.\u0027 \u0027My God, you Japanese!\u0027 said Bond with admiration. \u0027You really are up to all the tricks. You mean he gets them right out of the way behind the bones of the pelvis or what not?\u0027 \u0027Your knowledge of anatomy is as vague as your appreciation for poetry, but that is more or less so, yes. Then, before a fight, he will bind up that part of the body most thoroughly to contain these vulnerable organs in their hiding-place. Afterwards, in the bath, he will release them to hang normally. I have seen them do it. It is a great pity that it is now too late for you to practise this art. It might have given you more confidence on your mission. It is my experience that agents fear most for that part of the body when there is fighting to be done or when they risk capture. These organs, as you know, are most susceptible to torture for the extraction of information.\u0027 \u0027Don\u0027t I know it!\u0027 said Bond from the heart. \u0027Some of our chaps wear a box when they think they\u0027re in for a rough house. I don\u0027t care for them. Too uncomfortable.\u0027 \u0027What is a box?\u0027 \u0027It is what our cricketers wear to protect those parts when they go out to bat. It is a light padded shield of aluminium.\u0027 \u0027I regret that we have nothing of that nature. We do not play cricket in Japan. Only baseball.\u0027 \u0027Lucky for you you weren\u0027t occupied by the British,\u0027 commented Bond. \u0027Cricket is a much more difficult and skilful game.\u0027 \u0027The Americans say otherwise.\u0027 \u0027Naturally. They want to sell you baseball equipment.\u0027 They arrived at Beppu in the southern island of Kyushu as the sun was setting. Tiger said that this was just the time to see the famous geysers and fumaroles of the little spa. In any case, there would be no time in the morning as they would have to start early for Fukuoka, their final destination. Bond shivered slightly at the name. The moment was rapidly approaching when the sake and sightseeing would have to stop. Above the town of Beppu, they visited in turn the ten spectacular \u0027hells\u0027 as they are officially designated. The stink of sulphur was disgusting, and each bubbling, burping nest of volcanic fumaroles was more horrific than the last. The steaming mud and belching geysers were of different colours - red, blue, and orange - and everywhere there were warning notices and skulls and crossbones to keep visitors at a safe distance. The tenth \u0027hell\u0027 announced in English and Japanese that there would be an eruption punctually every twenty minutes. They joined a small group of spectators under the arc lights that pinpointed a small quiescent crater in a rock area bespattered with mud. Sure enough, in five minutes, there came a rumbling from underground and a jet of steaming grey mud shot twenty feet up into the air and splashed down inside the enclosure. As Bond was turning away, he noticed a large red painted wheel, heavily padlocked and surrounded by wire-netting in a small separate enclosure. There were warning notices above it and a particularly menacing skull and crossbones. Bond asked Tiger what it was. \u0027It says that this wheel controls the pulse of the geyser. It says that if this wheel were screwed down it could result in the destruction of the entire establishment. It gives the explosive force of the volcano, if the exhaust valve of the geyser were to be closed, as the equivalent of a thousand pounds of TNT. It is, of course, all a bit of nonsense to attract the tourists. But now, back to the town, Bondo-sanl Since it is our last day together,\u0027 he added hastily, \u0027on this particular voyage, I have arranged a special treat. I ordered it by radio from the ship. A fugu feast!\u0027 Bond cursed silently. The memory of his eggs Benedict the night before was intolerably sweet. What new monstrosity was this? he asked. \u0027Fugu is the Japanese blow-fish. In the water, it looks like a brown owl, but when captured it blows itself up into a ball covered with wounding spines. We sometimes dry the skins and put candles inside and use them as lanterns. But the flesh is particularly delicious. It is the staple food of the sumo wrestlers because it is supposed to be very strength-giving. The fish is also very popular with suicides and murderers because its liver and sex glands contain a poison which brings death instantaneously.\u0027 \u0027That\u0027s just what I would have chosen for dinner. How thoughtful of you, Tiger.\u0027 \u0027Have no fear, Bondo-san. Because of the dangerous properties of the fish, every fugu restaurant has to be manned by experts and be registered with the State.\u0027 They left their bags at a Japanese inn where Tiger had reserved rooms, enjoyed the o-furo, honourable bath, together in the blue-tiled miniature swimming pool whose water was very hot and smelled of sulphur and then, totally relaxed, went off down the street leading to the sea. (Bond had become enamoured of the civilized, vaguely Roman, bathing habits of the Japanese. Was it because of these, because they washed outside the bath instead of wallowing in their own effluvia, that they all smelled so clean? Tiger said bluntly that, at the very best, Westerners smelled of sweet pork.) The restaurant had a giant blow-fish hanging as a sign above the door, and inside, to Bond\u0027s relief, there were Western-style chairs and tables at which a smattering of people were eating with the intense concentration of the Japanese. They were expected and their table had been prepared. Bond said, \u0027Now then, Tiger, I\u0027m not going to commit honourable suicide without at least five bottles of sake inside me.\u0027 The flasks were brought, all five of them, to the accompaniment of much tittering by the waitresses. Bond downed the lot, tumbler by tumbler, and expressed himself satisfied. \u0027Now you can bring on this blasted blow-fish,\u0027 he said belligerently, \u0027and if it kills me it will be doing a good turn to our friend the doctor in his castle.\u0027 A very beautiful white porcelain dish as big as a bicycle wheel was brought forward with much ceremony. On it were arranged, in the pattern of a huge flower, petal upon petal of a very thinly sliced and rather transparent white fish. Bond followed Tiger\u0027s example and set to with his chopsticks. He was proud of the fact that he had reached Black Belt standard with these instruments-the ability to eat an underdone fried egg with them. The fish tasted of nothing, not even of fish. But it was very pleasant on the palate and Bond was effusive in his compliments because Tiger, smacking his lips over each morsel, obviously expected it of him. There followed various side-dishes containing other parts of the fish, and more sake, but this time containing raw fugu fins. Bond sat back and lit a cigarette. He said, \u0027Well, Tiger. This is nearly the end of my education. Tomorrow you say I am to leave the nest. How many marks out of a hundred?\u0027 Tiger looked at him quizzically. \u0027You have done well, Bondo-san. Apart from your inclination to make Western jokes about Eastern customs. Fortunately I am a man of infinite patience, and I must admit that your company has given me much pleasure and a certain amount of amusement. I will award you seventy-five marks out of a possible hundred.\u0027 As they rose to go, a man brushed past Bond to get to the exit. He was a stocky man with a white masko over his mouth and he wore an ugly leather hat. The man on the train! Well, welll thought Bond. If he shows up on the last lap to Fukuoka, I\u0027ll get him. If not I\u0027ll reluctantly put it down to \u0027Funny Coincidence Department\u0027. But it looks like nought out of a hundred to Tiger for powers of observation. Part Two ... than to arrive\u0027 12 APPOINTMENT IN SAMARA AT six in the morning, a car from the Prefect of Police in Fukuoka came for them. There were two police corporals in the front seat. They went off northwards on the coast road at a good pace. After a while, Bond said, \u0027Tiger, we\u0027re being followed. I don\u0027t care what you say. The man who stole my wallet was in the fugu restaurant last night, and he\u0027s now a mile behind on a motor-cycle - or I\u0027ll eat my hat. Be a good chap and tell the driver to dodge up a side-road and then go after him and get him. I\u0027ve got a sharp nose for these things and I ask you to do what I say.\u0027 Tiger grunted. He looked back and then issued rapid instructions to the driver. The driver said, \u0027Hai!\u0027 briskly, and the corporal at his side unbuttoned the holster of his M-14 automatic. Tiger flexed his powerful fingers.","sourceLink":"https://allnovel.net/you-only-live-twice-james-bond-12/page-16.html","bookId":1554,"book":{"id":1554,"title":"You Only Live Twice (James Bond #12)","description":"Storyline: You Only Live Twice (James Bond (Original Series) #12) Bond, a shattered man after the death of his wife at the hands of Ernst Stavro Blofeld, has gone to pieces as an agent, endangering himself and his fellow operatives. M, unwilling to accept the loss of one of his best men, sends 007 to Japan for one last, near-impossible mission. But Japan proves to be Bond\u0027s downfall, leading him to a mysterious residence known as the \u0027Castle of Death\u0027 where he encounters an old enemy revitalized. All the omens suggest that this is the end for the British agent and, for once, even Bond himself seems unable to disagree...","cover":"https://allnovel.net/images/you-only-live-twice-james-bond-12.jpg","author":"Ian Fleming","type":"Adventure","source":"allnovel","link":"https://allnovel.net/you-only-live-twice-james-bond-12.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:15:42 PM"}}
