{"id":6312,"no":14,"title":"Chapter 13","content":"　　TWO SAD YEARS--ISABELLA\u0027S DEATH--COLUMBUS ATSEVILLE --HIS ILLNESS--LETTERS TO THE KING--JOURNEYSTO SEGOVIA, SALAMANCA, AND VALLADOLID--HIS SUITTHERE--PHILIP AND JUANA--COLUMBUS EXECUTES HISWILL--DIES--HIS BURIAL AND THE REMOVAL OF HIS BODY-HIS PORTRAITS--HIS CHARACTER. 　　Columbus had been absent from Spain two years and six months. Hereturned broken in health, and the remaining two years of his life are onlythe sad history of his effort to relieve his name from dishonor and to leaveto his sons a fair opportunity to carry forward his work in the world. 　　Isabella, alas, died on the twenty-sixth day of November, only a shorttime after his arrival. Ferdinand, at the least, was cold and hard towardhim, and Ferdinand was now engaged in many affairs other than those ofdiscovery. He was satisfied that Columbus did not know how to bring goldhome from the colonies, and the promises of the last voyage, that theyshould strike the East, had not been fulfilled. 　　Isabella had testified her kindly memory of Columbus, even while hewas in exile at Jamaica, by making him one of the body-guard of heroldest son, an honorary appointment which carried with it a handsomeannual salary. After the return to Spain of Diego Mendez, the loyal friendwho had cared for his interests so well in San Domingo, she had raisedhim to noble rank. 　　It is clear, therefore, that among her last thoughts came in the wish todo justice to him whom she had served so well. She had well done herduty which had been given her to do. She had never forgotten the newworld to which it was her good fortune to send the discoverer, and in herdeath that discoverer lost his best friend. 　　On his arrival in Seville, where one might say he had a right to resthimself and do nothing else, Columbus engaged at once in efforts to seethat the seamen who had accompanied him in this last adventure should beproperly paid. Many of these men had been disloyal to him and unfaithfulto their sovereign, but Columbus, with his own magnanimity, represented eagerly at court that they had endured great peril, that they brought greatnews, and that the king ought to repay them all that they had earned. 　　He says, in a letter to his son written at this period, \"I have not a roofover my head in Castile. I have no place to eat nor to sleep excepting atavern, and there I am often too poor to pay my scot.\" This passage hasbeen quoted as if he were living as a beggar at this time, and the world hasbeen asked to believe that a man who had a tenth of the revenue of theIndies due to him in some fashion, was actually living from hand to mouthfrom day to day. But this is a mere absurdity of exaggeration. 　　Undoubtedly, he was frequently pressed for ready money. He says tohis son, in another letter, \"I only live by borrowing.\" Still he had goodcredit with the Genoese bankers established in Andalusia. In writing to hisson he begs him to economize, but at the same time he acknowledges thereceipt of bills of exchange and considerable sums of money. 　　In the month of December, there is a single transaction in Hispaniolawhich amounts to five thousand dollars of our money. We must not,therefore, take literally his statement that he was too poor to pay for anight\u0027s lodging. On the other hand, it is observed in the correspondencethat, on the fifteenth of April, 1505, the king ordered that everythingwhich belonged to Columbus on account of his ten per cent should becarried to the royal treasury as a security for certain debts contracted bythe Admiral. 　　The king had also given an order to the royal agent in Hispaniola thateverything which he owned there should be sold. All these details havebeen carefully brought together by Mr. Harrisse, who says truly that wecannot understand the last order. 　　When at last the official proceedings relating to the affairs in Jamaicaarrived in Europe, Columbus made an effort to go to court. A litter wasprovided for him, and all the preparations for his journey made. But hewas obliged once more by his weakness to give up this plan, and he couldonly write letters pressing his claim. Of such letters the misfortune is, thatthe longer they are, and the more of the detail they give, the less likely arethey to be read. Columbus could only write at night; in the daytime hecould not use his hands. 　　He took care to show Ferdinand that his interests had not beenproperly attended to in the islands. He said that Ovando had been carelessas to the king\u0027s service, and he was not unwilling to let it be understoodthat his own administration had been based on a more intelligent policythan that of either of the men who followed him. 　　But he was now an old man. He was unable to go to court in person. 　　He had not succeeded in that which he had sailed for--a strait opening tothe Southern Sea. He had discovered new gold mines on the continent, buthe had brought home but little treasure. His answers from the courtseemed to him formal and unsatisfactory. At court, the stories of the Porrasbrothers were told on the one side, while Diego Mendez and Carvajalrepresented Columbus. 　　In this period of the fading life of Columbus, we have eleven lettersaddressed by him to his son. These show that he was in Seville as late asFebruary, 1505. From the authority of Las Casas, we know that he left thatpart of Spain to go to Segovia in the next May, and from that place hefollowed the court to Salamanca and Valladolid, although he was so weakand ill. 　　He was received, as he had always been, with professions of kindness;but nothing followed important enough to show that there was anythinggenuine in this cordiality. After a few days Columbus begged that someaction might be taken to indemnify him for his losses, and to confirm thepromises which had been made to him before. The king replied that hewas willing to refer all points which had been discussed between them toan arbitration. Columbus assented, and proposed the Archbishop Diego deDeza as an arbiter. 　　The reader must remember that it was he who had assisted Columbusin early days when the inquiry was made at Salamanca. The king assentedto the arbitration, but proposed that it should include questions whichColumbus would not consider as doubtful. One of these was hisrestoration to his office of viceroy. 　　Now on the subject of his dignities Columbus was tenacious. Heregarded everything else as unimportant in comparison. He would notadmit that there was any question that he was the viceroy of the Indies, and all this discussion ended in the postponement of all consideration ofhis claims till, after his death, it was too late for them to be considered. 　　All the documents, when read with the interest which we take in hischaracter and fortunes, are indeed pathetic; but they did not seem so to theking, if indeed they ever met his eye. 　　In despair of obtaining justice for himself, Columbus asked that hisson Diego might be sent to Hispaniola in his place. The king wouldpromise nothing, but seems to have attempted to make Columbusexchange the privileges which he enjoyed by the royal promise for aseignory in a little town in the kingdom of Leon, which is named notimproperly \"The Counts\u0027 Carrion.\"It is interesting to see that one of the persons whom he employed, inpressing his claim at the court and in the management of his affairs, wasVespucci, the Florentine merchant, who in early life had been known asAlberigo, but had now taken the name of Americo. 　　The king was still engaged in the affairs of the islands. He appointedbishops to take charge of the churches in the colonies, but Columbus wasnot so much as consulted as to the persons who should be sent. WhenPhilip arrived from Flanders, with his wife Juana, who was the heir ofIsabella\u0027s fortunes and crown, Columbus wished to pay his court to them,but was too weak to do so in person. 　　There is a manly letter, written with dignity and pathos, in which hepresses his claims upon them. He commissioned his brother, theAdelantado, to take this letter, and with it he went to wait upon the youngcouple. They received him most cordially, and gave flattering hopes thatthey would attend favorably to the suit. But this was too late for Columbushimself. Immediately after he had sent his brother away, his illnessincreased in violence. 　　The time for petitions and for answers to petitions had come to an end. 　　His health failed steadily, and in the month of May he knew that he wasapproaching his death. The king and the court had gone to Villafranca deValcacar. 　　On the nineteenth of May Columbus executed his will, which had beenprepared at Segovia a year before. In this will he directs his son and his successors, acting as administrators, always to maintain \"in the city ofGenoa, some person of our line, who shall have a house and a wife in thatplace, who shall receive a sufficient income to live honorably, as beingone of our relatives, having foot and root in the said city, as a native; sincehe will be able to receive from this city aid in favor of the things of hisservice; because from that city I came forth and in that city I was born.\"This clause became the subject of much litigation as the century went on. 　　Another clause which was much contested was his direction to his sonDiego to take care of Beatriz Enriquez, the mother of Fernando. Diego isinstructed to provide for her an honorable subsistence \"as being a personto whom I have great obligation. What I do in this matter is to relieve myconscience, for this weighs much upon my mind. The reason of this cannotbe written here.\"The history of the litigation which followed upon this will and uponother documents which bear upon the fortunes of Columbus is curious, butscarcely interesting. The present representative of Columbus is DonCristobal Colon de la Cerda, Duke of Veragua and of La Vega, a grandeeof Spain of the first class, Marquis of Jamaica, Admiral and SeneschalMajor of the Indies, who lives at Madrid. 　　Two days after the authentication of the will he died, on the twentyfirst of May, 1506, which was the day of Ascension. His last words werethose of his Saviour, expressed in the language of the Latin Testament, \"Inmanus tuas, Pater, commendo spiritum meum,\"--\"Father, into thy hands Icommend my spirit.\" The absence of the court from Valladolid took with it,perhaps, the historians and annalists. For this or for some other reason,there is no mention whatever of Columbus\u0027s funeral in any of thedocuments of the time. 　　The body was laid in the convent of San Francisco at Valladolid. Suchat least is the supposition of Navarrete, who has collected the originaldocuments relating to Columbus. He supposes that the funeral serviceswere conducted in the church of the parish of Santa Maria de la Antigua. 　　From the church of Saint Francis, not many months after, the body wasremoved to Seville. A new chapel had lately been built there, called SantaMaria de las Cuevas. In this chapel was the body of Columbus entombed. 　　In a curious discussion of the subject, which has occupied much morespace than it is worth, it is supposed that this was in the year 1513, but Mr. 　　Harrisse has proved that this date is not accurate. 　　For at least twenty-eight years, the body was permitted to remainunder the vaults of this chapel. Then a petition was sent to Charles V, forleave to carry the coffin and the body to San Domingo, that it might beburied in the larger chapel of the cathedral of that city. To this the emperorconsented, in a decree signed June 2, 1537. It is not known how soon theremoval to San Domingo was really made, but it took place before manyyears. 　　Mr. Harrisse quotes from a manuscript authority to show, that whenWilliam Penn besieged the city of San Domingo in 1655, all the bodiesburied under the cathedral were withdrawn from view, lest the hereticsshould profane them, and that \"the old Admiral\u0027s\" body was treated likethe rest. 　　Mr. Harrisse calls to mind the fact that the earthquake of the nineteenthof May, 1673, demolished the cathedral in part, and the tombs which itcontained. He says, \"the ruin of the colony, the climate, weather, andcarelessness all contributed to the loss from sight and the forgetfulness ofthe bones of Columbus, mingled with the dust of his descendants\"; and Mr. 　　Harrisse does not believe that any vestige of them was ever foundafterwards, in San Domingo or anywhere else. This remark, from theperson who has given such large attention to the subject, is interesting. Forit is generally stated and believed that the bones were afterwards removedto Havana in the island of Cuba. The opinion of Mr. Harrisse, as it hasbeen quoted, is entitled to very great respect and authority. 　　A very curious question has arisen in later times as to the actual placewhere the remains now are. On this question there is great discussionamong historians, and many reports, official and unofficial, have beenpublished with regard to it. 　　In the year 1867, the proposal was made to the Holy Father at Rome,that Columbus should receive the honors known in the Roman CatholicChurch as the honors of beatification. In 1877, De Lorgues, theenthusiastic biographer of Columbus, represents that the inquiry had gone so far that these honors had been determined on. One who reads his bookwould be led to suppose that Columbus had already been recognized as onthe way to be made a saint of the Church. But, in truth, though some suchinquiry was set on foot, he never received the formal honors ofbeatification. -------We have one account by a contemporary of the appearance ofColumbus.[*] We are told that he was a robust man, quite tall, of floridcomplexion, with a long face.\"[*] In the first Decade of Peter Martyr. 　　In the next generation, Oviedo says Columbus was \"of good aspect,and above the middle stature. His limbs were strong, his eyes quick, andall the parts of his body well proportioned. His hair was decidedly reddish,and the complexion of his face quite florid and marked with spots of red.\"Bishop Las Casas knew the admiral personally, and describes him inthese terms: \"He was above the middle stature, his face was long andstriking, his nose was aquiline, his eyes clear blue, his complexion light,tending towards a distinct florid expression, his beard and hair blonde inhis youth, but they were blanched at an early age by care. 　　Las Casas says in another place, he was rude in bearing, and carelessas to his language. He was, however, gracious when he chose to be, but hewas angry when he was annoyed.\"Mr. Harrisse, who has collected these particulars from the differentwriters, says that this physical type may be frequently met now in the cityand neighborhood of Genoa. He adds, \"as for the portraits, whetherpainted, engraved, or in sculpture, which appear in collections, in privateplaces, or as prints, there is not one which is authentic. They are all purelyimaginary.\"For the purpose of the illustration of this volume, we have used thatwhich is best known, and for many reasons most interesting. It ispreserved in the city of Florence, but neither the name of the artist nor thedate of the picture is known. It is generally spoken of as the \"Florentineportrait.\" The engraving follows an excellent copy, made by the order ofThomas Jefferson, and now in the possession of the MassachusettsHistorical Society. We are indebted to the government of this society for permission to use it.[*] 　　[*] The whole subject of the portraits of Columbus is carefullydiscussed in a learned paper presented to the Wisconsin Historical Societyby Dr. James Davie Butler, and published in the Collections of thatSociety, Vol. IX, pp. 79-96. 　　A picture ascribed to Titian, and engraved and circulated by thegeographer, Jomard, resembles closely the portraits of Philip III. Thecostume is one which Columbus never wore. 　　In his youth Columbus was affiliated with a religious brotherhood, thatof Saint Catherine, in Genoa. In after times, on many occasions when itwould have been supposed that he would be richly clothed, he appeared ina grave dress which recalled the recollections of the frock of the religiousorder of Saint Francis. According to Diego Columbus, he died, \"dressed inthe frock of this order, to which he had always been attached.\" -------The reader who has carefully followed the fortunes of the greatdiscoverer understands from the history the character of the man. Hewould not have succeeded in his long suit at the court of Ferdinand andIsabella, had he not been a person of single purpose and iron will. 　　From the moment when he was in command of the first expedition,that expedition went prosperously to its great success, in precisely the waywhich he had foreseen and determined. True, he did not discover Asia, ashe had hoped, but this was because America was in the way. He showed inthat voyage all the attributes of a great discoverer; he deserved the honorswhich were paid to him on his return. 　　As has been said, however, this does not mean that he was a greatorganizer of cities, or that he was the right person to put in charge of anewly founded colony. It has happened more than once in the history ofnations that a great general, who can conquer armies and can obtain peace,has not succeeded in establishing a colony or in governing a city. 　　On the other hand, it is fair to say that Columbus never had a chance toshow what he would have been in the direction of his colonies had theybeen really left in his charge. This is true, that his heart was always ondiscovery; all the time that he spent in the wretched detail of thearrangement of a new-built town was time which really seemed to him wasted. 　　The great problem was always before him, how he should connect hisdiscoveries with the knowledge which Europe had before of the coast ofAsia. Always it seemed to him that the dominions of the Great Khan werewithin his reach. Always he was eager for that happy moment when heshould find himself in personal communication with that great monarch,who had been so long the monarch of the East--who, as he thought, wouldprove to be the monarch of the West. 　　Columbus died with the idea that he had come close to Asia. Even ageneration after his death, the companions of Cortes gave to the peninsulaof California that name because it was the name given in romance to thefarthest island of the eastern Indies. 　　Columbus met with many reverses, and died, one might almost say, abroken-hearted man. But history has been just to him, and has placed himin the foremost rank of the men who have set the world forward. And,outside of the technical study of history, those who like to trace the lawson which human progress advances have been proud and glad to see thathere is a noble example of the triumph of faith. 　　The life of Columbus is an illustration constantly brought forward ofthe success which God gives to those who, having conceived of a greatidea, bravely determine to carry it through. 　　His singleness of purpose, his unselfishness, his determination tosucceed, have been cited for four centuries, and will be cited for centuriesmore, among the noblest illustrations which history has given, of successwrought out by the courage of one man.","sourceLink":"http://novel.tingroom.com/mingren/245/344.html","bookId":204,"book":{"id":204,"title":"哥伦布传 The Life Of Christopher Columbus","description":"简介： 　　This book contains a life of Columbus, written with the hope ofinteresting all classes of readers. 　　His life has often been written, and it has sometimes been well written. 　　The great book of our countryman, Washington ...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/245","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
