{"id":6313,"no":15,"title":"Appendix A","content":"　　[The following passages, from Admiral Fox\u0027s report, give his reasonsfor believing that Samana, or Atwood\u0027s Key, is the island where Columbusfirst touched land. The interest which attaches to this subject at themoment of the centennial, when many voyages will be made by personsfollowing Columbus, induces me to copy Admiral Fox\u0027s reasonings indetail. I believe his conclusion to be correct.]\\n\\n 　　This method of applying Columbus\u0027s words in detail to refute each ofthe alleged tracks, and the study that I gave to the subject in the winter of1878-79 in the Bahamas, which has been familiar cruising ground to me,has resulted in the selection of Samana or Atwood\u0027s Key for the firstlanding place.\\n\\n 　　It is a little island 8.8 miles east and west; 1.6 extreme breadth, andaveraging 1.2 north and south. It has 8.6 square miles. The east end is inlatitude 23 degrees 5\u0027 N.; longitude 73 degrees 37\u0027 west of Greenwich. Thereef on which it lies is 15 by 2 1/2 miles.\\n\\n 　　On the southeast this reef stretches half a mile from the land, on theeast four miles, on the west two, along the north shore one-quarter to one-half mile, and on the southwest scarcely one-quarter. Turk is smaller thanSamana, and Cat very much larger.\\n\\n 　　The selection of two so unlike in size show that dimension has notbeen considered essential in choosing an island for the first landfall.[*]\\n\\n 　　[*] I am indebted to T. J. McLain, Esq., United States consul at Nassau,for the following information given to him by the captains of this port,who visit Samana or Atwood\u0027s Key. The sub-sketch on this chart issubstantially correct: Good water is only obtained by sinking wells. Thetwo keys to the east are covered with guano; white boobies hold the largerone, and black boobies the other; neither intermingles.\\n\\n 　　The island is now uninhabited, but arrow heads and stone hatchets aresometimes found; and in places there are piles of stones supposed to havebeen made by the aborigines. Most of the growth is scrubby, with a fewscattered trees.\\n\\n 　　The Nassau vessels enter an opening through the reef on the south sideof the island and find a very comfortable little harbor with from two to twoand a half fathoms of water. From here they send their boats on shore to\"strip\" guano, and cut satin, dye woods and bark.\\n\\n 　　When Columbus discovered Guanahani, the journal called it a \"littleisland.\" After landing he speaks of it as \"bien grande,\" \"very large,\" whichsome translate, tolerably, or pretty large. November 20, 1492 (Navarette,first edition, p. 61), the journal refers to Isabella, a larger island thanGuanahani, as \"little island,\" and the fifth of January following (p. 125)San Salvador is again called \"little island.\"The Bahamas have an area of about 37,000 square miles, six per centof which may be land, enumerated as 36 islands, 687 keys, and 2,414rocks. The submarine bank upon which these rest underlies Florida also.\\n\\n 　　But this peninsula is wave-formed upon living corals, whose growth andgradual stretch toward the south has been made known by Agassiz.\\n\\n 　　I had an unsuccessful search for a similar story of the Bahamas, tolearn whether there were any probable changes within so recent a periodas four hundred years.\\n\\n 　　The common mind can see that all the rock there is coral, none ofwhich is in position. The surface, the caves, the chinks, and the numerouspot-holes are compact limestone, often quite crystalline, while beneath it isoolitic, either friable or hard enough to be used for buildings. The hills aresand-blown, not upheaved. On a majority of the maps of the sixteenthcentury there were islands on Mouchoir, and on Silver Banks, where noware rocks \"awash;\" and the Dutch and the Severn Shoals, which lay to theeast, have disappeared.\\n\\n 　　It is difficult to resist the impression that the shoal banks, and the reefsof the Bahamas, were formerly covered with land; and that for ageological age waste has been going on, and, perhaps, subsidence. Thecoral polyp seems to be doing only desultory work, and that mostly on thenortheast or Atlantic side of the islands; everywhere else it has abandonedthe field to the erosive action of the waves.\\n\\n 　　Columbus said that Guanahani had abundance of water and a verylarge lagoon in the middle of it. He used the word laguna--lagoon, not lago--lake. His arrival in the Bahamas was at the height of the rainy season.\\n\\n 　　Governor Rawson\u0027s Report on the Bahamas, 1864, page 92, Appendix 4,gives the annual rainfall at Nassau for ten years, 1855--\u002764, as sixty-fourinches. From May 1, to November 1 is the wet season, during which 44.7inches fall; the other six months 19.3 only. The most is in October, 8.5inches.\\n\\n 　　Andros, the largest island, 1,600 square miles, is the only one that hasa stream of water. The subdivision of the land into so many islands andkeys, the absence of mountains, the showery characteristic of the rainfall,the porosity of the rock, and the great heat reflected from the white coral,are the chief causes for the want of running water. During the rainy seasonthe \"abundance of water\" collects in the low places, making ponds andlagoons, that afterward are soaked up by the rock and evaporated by thesun.\\n\\n 　　Turk and Watling have lagoons of a more permanent condition,because they are maintained from the ocean by permeation. The lagoonwhich Columbus found at Guanahani had certainly undrinkable water, orhe would have gotten some for his vessels, instead of putting it off until hereached the third island.\\n\\n 　　There is nothing in the journal to indicate that the lagoon at Guanahaniwas aught but the flooding of the low grounds by excessive rains; andeven if it was one communicating with the ocean, its absence now may bereferred to the effect of those agencies which are working incessantly toreshape the soft structure of the Bahamas.\\n\\n 　　Samana has a range of hills on the southwest side about one hundredfeet high, and on the northeast another, lower. Between them, and alsoalong the north shore, the land is low, and during the season of rains thereis a row of ponds parallel to the shore. On the south side a conspicuouswhite bluff looks to the southward and eastward.\\n\\n 　　The two keys, lying respectively half a mile and three miles east of theisland, and possibly the outer breaker, which is four miles, all might havebeen connected with each other, and with the island, four hundred yearsago. In that event the most convenient place for Columbus to anchor in thestrong northeast trade-wind, was where I have put an anchor on the subsketch of Samana.\\n\\n 　　[In a subsequent passage Admiral Fox says:--]\\n\\n 　　There is a common belief that the first landing place is settled by oneor another of the authors cited here. Nevertheless, I trust to have shown,paragraph by paragraph, wherein their several tracks are contrary to thejournal, inconsistent with the true cartography of the neighborhood, and tothe discredit, measurably, both of Columbus and of Las Casas. Theobscurity and the carelessness which appear in part of the diary throughthe Bahamas offer no obstacle to this demonstration, provided that they donot extend to the \"log,\" or nautical part.\\n\\n 　　Columbus went to sea when he was fourteen years of age, and servedthere almost continuously for twenty-three years. The strain of a sea-faringlife, from so tender an age, is not conducive to literary exactness. Still, forthe very reason of this sea experience, the \"log\" should be correct.\\n\\n 　　This is composed of the courses steered, distances sailed over,bearings of islands from one another, trend of shores, etc. The recording ofthese is the daily business of seamen, and here the entries were byColumbus himself, chiefly to enable him, on his return to Spain, toconstruct that nautical map, which is promised in the prologue of the firstvoyage.\\n\\n 　　In crossing the Atlantic the Admiral understated to the crew each day\u0027srun, so that they should not know how far they had gone into an unknownocean. Las Casas was aware of this counterfeit \"log,\" but his abridgment isfrom that one which Columbus kept for his own use.\\n\\n 　　If the complicated courses and distances in this were originally wrong,or if the copy of them is false, it is obvious that they cannot be \"plotted \"upon a correct chart. Conversely, if they ARE made to conform to asuccession of islands among which he is known to have sailed, it isevident that this is a genuine transcript of the authentic \"log\" of Columbus,and, reciprocally, that we have the true track, the beginning of which is theeventful landfall of October 12, 1492.\\n\\n 　　The student or critical reader, and the seaman, will have to determinewhether the writer has established this conformity. The public, probably,desires to have the question settled, but it will hardly take any interest in a discussion that has no practical bearing, and which, for its elucidation,leans so much upon the jargon or the sea.\\n\\n 　　It is not flattering to the English or Spanish speaking peoples that thefour hundredth anniversary of this great event draws nigh, and is likely tocatch us still floundering, touching the first landing place.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/245/345.html","bookId":204,"book":{"id":204,"title":"哥伦布传 The Life Of Christopher Columbus","description":"简介： 　　This book contains a life of Columbus, written with the hope ofinteresting all classes of readers. 　　His life has often been written, and it has sometimes been well written. 　　The great book of our countryman, Washington ...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/245","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:18:23 AM"}}
