{"id":22410,"no":3,"title":"The Talisman of Solomon.","content":"Aben Hassen the Wise and the King of Demons of the Earth There was once upon a time a man whom other men called Aben Hassen the Wise. He had read a thousand books of magic, and knew all that the ancients or moderns had to tell of the hidden arts. The King of the Demons of the Earth, a great and hideous monster, named Zadok, was his servant, and came and went as Aben Hassen the Wise ordered, and did as he bade. After Aben Hassen learned all that it was[30] possible for man to know, he said to himself, “Now I will take my ease and enjoy my life.” So he called the Demon Zadok to him, and said to the monster, “I have read in my books that there is a treasure that was one time hidden by the ancient kings of Egypt—a treasure such as the eyes of man never saw before or since their day. Is that true?” “It is true,” said the Demon. “Then I command thee to take me to that treasure and to show it to me,” said Aben Hassen the Wise. “It shall be done,” said the Demon; and thereupon he caught up the Wise Man and transported him across mountain and valley, across land and sea, until he brought him to a country known as the “Land of the Black Isles,” where the treasure of the ancient kings was hidden. The Demon showed the Magician the treasure, and it was a sight such as man had never looked upon before or since the days that the dark, ancient ones hid it. With his treasure Aben Hassen built himself palaces and gardens and paradises such as the world never saw before. He lived like an emperor, and the fame of his doings rang through all the four corners of the earth. Now the queen of the Black Isles was the most beautiful woman in the world, but she was[31] as cruel and wicked and cunning as she was beautiful. No man that looked upon her could help loving her; for not only was she as beautiful as a dream, but her beauty was of that sort that it bewitched a man in spite of himself. One day the queen sent for Aben Hassen the Wise. “Tell me,” said she, “is it true that men say of you that you have discovered a hidden treasure such as the world never saw before?” And she looked at Aben Hassen so that his wisdom all crumbled away like sand, and he became just as foolish as other men. “Yes,” said he, “it is true.” Aben Hassen the Wise spent all that day with the queen, and when he left the palace he was like a man drunk and dizzy with love. Moreover, he had promised to show the queen the hidden treasure the next day. As Aben Hassen, like a man in a dream, walked towards his own house, he met an old man standing at the corner of the street. The old man had a talisman that hung dangling from a chain, and which he offered for sale. When Aben Hassen saw the talisman he knew very well what it was—that it was the famous talisman of King Solomon the Wise. If he who possessed the talisman asked it to speak, it would tell that man both what to do and what not to do. [32] The Wise Man bought the talisman for three pieces of silver (and wisdom has been sold for less than that many a time), and as soon as he had the talisman in his hands he hurried home with it and locked himself in a room. “Tell me,” said the Wise Man to the Talisman, “shall I marry the beautiful queen of the Black Isles?” “Fly, while there is yet time to escape!” said the Talisman; “but go not near the queen again, for she seeks to destroy thy life.” “But tell me, O Talisman!” said the Wise Man, “what then shall I do with all that vast treasure of the kings of Egypt?” “Fly from it while there is yet chance to escape!” said the Talisman; “but go not into the treasure-house again, for in the farther door, where thou hast not yet looked, is that which will destroy him who possesses the treasure.” “But Zadok,” said Aben Hassen; “what of Zadok?” “Fly from the monster while there is yet time to escape,” said the Talisman, “and have no more to do with thy Demon slave, for already he is weaving a net of death and destruction about thy feet.” The Wise Man sat all that night pondering and thinking upon what the Talisman had said.[34] When morning came he washed and dressed himself, and called the Demon Zadok to him. “Zadok,” said he, “carry me to the palace of the queen.” In the twinkling of an eye the Demon transported him to the steps of the palace. Aben Hassen speaking with the Talisman “Zadok,” said the Wise Man, “give me the staff of life and death;” and the Demon brought from under his clothes a wand, one-half of which was of silver and one-half of which was of gold. The Wise Man touched the steps of the palace with the silver end of the staff. Instantly all the sound and hum of life was hushed. The thread of life was cut by the knife of silence, and in a moment all was as still as death. “Zadok,” said the Wise Man, “transport me to the treasure-house of the king of Egypt.” And instantly the Demon had transported him thither. The Wise Man drew a circle upon the earth. “No one,” said he, “shall have power to enter here but the master of Zadok, the King of the Demons of the Earth.” “And now, Zadok,” said he, “I command thee to transport me to India, and as far from here as thou canst.” Instantly the Demon did as he was commanded; and of all the treasure that he had, the Wise Man took nothing with him but a jar of golden money and a jar of silver money. As soon as the Wise Man stood upon the ground[35] of India, he drew from beneath his robe a little jar of glass. “Zadok,” said he, “I command thee to enter this jar.” Then the Demon knew that now his turn had come. He besought and implored the Wise Man to have mercy upon him; but it was all in vain. Then the Demon roared and bellowed till the earth shook and the sky grew dark overhead. But all was of no avail; into the jar he must go, and into the jar he went. Then the Wise Man stoppered the jar and sealed it. He wrote an inscription of warning upon it, and then he buried it in the ground. “Now,” said Aben Hassen the Wise to the Talisman of Solomon, “have I done everything that I should?” “No,” said the Talisman, “thou shouldst not have brought the jar of golden money and the jar of silver money with thee; for that which is evil in the greatest is evil in the least. Thou fool! The treasure is cursed! cast it all from thee while there is yet time.” “Yes, I will do that, too,” said the Wise Man. So he buried in the earth the jar of gold and the jar of silver that he had brought with him, and then he stamped the mould down upon it. After that the Wise Man began his life all over again.[36] He bought, and he sold, and he traded, and by-and-by he became rich. Then he built himself a great house, and in the foundation he laid the jar in which the Demon was bottled. Then he married a young and handsome wife. By-and-by the wife bore him a son, and then she died. This son was the pride of his father’s heart; but he was as vain and foolish as his father was wise, so that all men called him Aben Hassen the Fool, as they called the father Aben Hassen the Wise. Then one day death came and called the old man, and he left his son all that belonged to him—even the Talisman of Solomon. Young Aben Hassen the Fool had never seen so much money as now belonged to him. It seemed to him that there was nothing in the world he could not enjoy. He found friends by the dozens and scores, and everybody seemed to be very fond of him. He asked no questions of the Talisman of Solomon, for to his mind there was no need of being both wise and rich. So he began enjoying himself with his new friends. Day and night there was feasting and drinking and singing[37] and dancing and merrymaking and carousing; and the money that the old man had made by trading and wise living poured out like water through a sieve. Then, one day came an end to all this junketing, and nothing remained to the young spendthrift of all the wealth that his father had left him. Then the officers of the law came down upon him and seized all that was left of the fine things, and his fair-weather friends flew away from his troubles like flies from vinegar. Then the young man began to think of the Talisman of Wisdom. For it was with him as it is with so many of us: When folly has emptied the platter, wisdom is called in to pick the bones. “Tell me,” said the young man to the Talisman of Solomon, “what shall I do, now that everything is gone?” “Go,” said the Talisman of Solomon, “and work as thy father has worked before thee. Advise with me and become prosperous and contented, but do not go dig under the cherry-tree in the garden.” “Why should I not dig under the cherry-tree in the garden?” says the young man; “I will see what is there, at any rate.” So he straightway took a spade and went out[38] into the garden, where the Talisman had told him not to go. He dug and dug under the cherry-tree, and by-and-by his spade struck something hard. It was a vessel of brass, and it was full of silver money. Upon the lid of the vessel were these words, engraved in the handwriting of the old man who had died: “My son, this vessel full of silver has been brought from the treasure-house of the ancient kings of Egypt. Take this, then, that thou findest; advise with the Talisman; be wise and prosper.” “And they call that the Talisman of Wisdom,” said the young man. “If I had listened to it I never would have found this treasure.” The next day he began to spend the money he had found, and his friends soon gathered around him again. The vessel of silver money lasted a week, and then it was all gone; not a single piece was left. Then the young man bethought himself again of the Talisman of Solomon. “What shall I do now,” said he, “to save myself from ruin?” “Earn thy bread with honest labor,” said the Talisman,[39] “and I will teach thee how to prosper; but do not dig beneath the fig-tree that stands by the fountain in the garden.” the young man unearths a copper vessel The young man did not tarry long after he heard what the Talisman had said. He seized a spade and hurried away to the fig-tree in the garden as fast as he could run. He dug and dug, and by-and-by his spade struck something hard. It was a copper vessel, and it was filled with gold money. Upon the lid of the vessel was engraved these words in the handwriting of the old man who had gone: “My son, my son,” they said,[40] “thou hast been warned once; be warned again. The gold money in this vessel has been brought from the treasure-house of the ancient kings of Egypt. Take it; be advised by the Talisman of Solomon; be wise and prosper.” “And to think that if I had listened to the Talisman, I would never have found this,” said the young man. The gold in the vessel lasted maybe for a month of jollity and merrymaking, but at the end of that time there was nothing left—not a copper farthing. “Tell me,” said the young man to the Talisman, “what shall I do now?” “Thou fool,” said the Talisman, “go sweat and toil, but do not go down into the vault beneath this house. There in the vault is a red stone built into the wall. The red stone turns upon a pivot. Behind the stone is a hollow space. As thou wouldst save thy life from peril, go not near it!” “Hear that now,” says the young man, “first, this Talisman told me not to go, and I found silver. Then it told me not to go, and I found gold; now it tells me not to go—perhaps I shall find precious stones enough for a king’s ransom.” He lit a lantern and went down into the vault beneath the house. There, as the Talisman had[41] said, was the red stone built into the wall. He pressed the stone, and it turned upon its pivot as the Talisman had said it would turn. Within was a hollow space, as the Talisman said there would be. In the hollow space there was a casket of silver. The young man snatched it up, and his hands trembled for joy. Upon the lid of the box were these words in the father’s handwriting, written in letters as red as blood: “Fool, fool! Thou hast been a fool once, thou hast been a fool twice; be not a fool for a third time. Restore this casket whence it was taken, and depart.” “I will see what is in the box, at any rate,” said the young man. He opened it. There was nothing in it but a hollow glass jar the size of an egg. The young man took the jar from the box; it was as hot as fire. He cried out and let it fall. The jar burst upon the floor with a crack of thunder; the house shook and rocked, and the dust flew about in clouds. Then all was still; and when Aben Hassen the Fool could see through the cloud of terror that enveloped him he beheld a great, tall, hideous being as black as ink, and with eyes that shone like coals of fire. When the young man saw that terrible creature his tongue clave to the roof of his mouth,[42] and his knees smote together with fear, for he thought that his end had now certainly come. “Who are you?” he croaked, as soon as he could find his voice. “I am the King of the Demons of the Earth, and my name is Zadok,” answered the being. “I was once thy father’s slave, and now I am thine, thou being his son. When thou speakest I must obey, and whatever thou commandest me to do that I must do.” “For instance, what can you do for me?” said the young man. “I can do whatsoever you ask me; I can make you rich.” “You can make me rich?” “Yes, I can make you richer than a king.” “Then make me rich as soon as you can,” said Aben Hassen the Fool, “and that is all that I shall ask of you now.” “It shall be done,” said the Demon; “spend all that thou canst spend, and thou shalt always have more. Has my lord any further commands for his slave?” “No,” said the young man, “there is nothing more; you may go now.” And thereupon the Demon vanished like a flash. “And to think,” said the young man, as he[44] came up out of the vault—“and to think that all this I should never have found if I had obeyed the Talisman.” the young man asks the demon for riches Such riches were never seen in that land as the young man now possessed. There was no end to the treasure that poured in upon him. He lived like an emperor. He built a palace more splendid than the palace of the king. He laid out vast gardens of the most exquisite beauty, in which there were fountains as white as snow, trees of rare fruit and flowers that filled all the air with their perfume, summer-houses of alabaster and ebony. Every one who visited him was received like a prince, entertained like a king, given a present fit for an emperor, and sent away happy. The fame of all these things went out through all the land, and every one talked of him and the magnificence that surrounded him. It came at last to the ears of the king himself, and one day he said to his minister, “Let us go and see with our own eyes if all the things reported of this merchant’s son are true.” So the king and his minister disguised themselves as foreign merchants, and went that evening to the palace where the young man lived. A servant dressed in clothes of gold and silver cloth stood at the door, and called to them to come in[45] and be made welcome. He led them in, and to a chamber lit with perfumed lamps of gold. Then six black slaves took them in charge and led them to a bath of white marble. They were bathed in perfumed water and dried with towels of fine linen. When they came forth they were clad in clothes of cloth of silver, stiff with gold and jewels. Then twelve handsome white slaves led them through a vast and splendid hall to a banqueting-room. When they entered they were deafened with the noise of carousing and merrymaking. Aben Hassen the Fool sat at the head of the table upon a throne of gold, with a canopy of gold above his head. When he saw the king and the minister enter, he beckoned to them to come and sit beside him. He showed them special favor because they were strangers, and special servants waited upon them. The king and his minister had never seen anything like what they then saw. They could hardly believe it was not all magic and enchantment. At the end of the feast each of the guests was given a present of great value, and was sent away rejoicing. The king received a pearl as big as a marble; the minister a cup of wrought gold. The next morning the king and the prime-minister[46] were talking over what they had seen. “Sire,” said the prime-minister, “I have no doubt but that the young man has discovered some vast hidden treasure. Now, according to the laws of this kingdom, the half of any treasure that is discovered shall belong to the king’s treasury. If I were in your place I would send for this young man and compel him to tell me whence comes all this vast wealth.” “That is true,” said the king; “I had not thought of that before. The young man shall tell me all about it.” So they sent a royal guard and brought the young man to the king’s palace. When the young man saw in the king and the prime-minister his guests of the night before, whom he had thought to be only foreign merchants, he fell on his face and kissed the ground before the throne. But the king spoke to him kindly, and raised him up and sat him on the seat beside him. They talked for a while concerning different things, and then the king said at last, “Tell me, my friend, whence comes all the inestimable wealth that you must possess to allow you to live as you do?” “Sire,” said the young man, “I cannot tell you whence it comes. I can only tell you that it is given to me.” the young man kisses the ground before the king\u0027s throne [48] The king frowned. “You cannot tell,” said he; “you must tell. It is for that that I have sent for you, and you must tell me.” Then the young man began to be frightened. “I beseech you,” said he, “do not ask me whence it comes. I cannot tell you.” Then the king’s brows grew as black as thunder. “What!” cried he, “do you dare to bandy words with me? I know that you have discovered some treasure. Tell me upon the instant where it is; for the half of it, by the laws of the land, belongs to me, and I will have it.” At the king’s words Aben Hassen the Fool fell on his knees. “Sire,” said he, “I will tell you all the truth. There is a demon named Zadok—a monster as black as a coal. He is my slave, and it is he that brings me all the treasure that I enjoy.” The king thought nothing else than that Aben Hassen the Fool was trying to deceive him. He laughed; he was very angry. “What,” cried he, “do you amuse me by such an absurd and unbelievable tale? Now I am more than ever sure that you have discovered a treasure and that you wish to keep the knowledge of it from me, knowing, as you do, that the one-half of it by law belongs to me. Take him away!” cried he to his attendants.[49] “Give him fifty lashes, and throw him into prison. He shall stay there and have fifty lashes every day until he tells me where his wealth is hidden.” It was done as the king said, and by-and-by Aben Hassen the Fool lay in the prison, smarting and sore with the whipping he had had. Then he began again to think of the Talisman of Solomon. “Tell me,” said he to the Talisman, “what shall I do now to help myself in this trouble?” “Bear thy punishment, thou fool,” said the Talisman. “Know that the king will by-and-by pardon thee and will let thee go. In the meantime bear thy punishment; perhaps it will cure thee of thy folly. Only do not call upon Zadok, the King of the Demons, in this thy trouble.” The young man smote his hand upon his head. “What a fool I am,” said he, “not to have thought to call upon Zadok before this!” Then he called aloud, “Zadok, Zadok! If thou art indeed my slave, come hither at my bidding.” In an instant there sounded a rumble as of thunder. The floor swayed and rocked beneath the young man’s feet. The dust flew in clouds, and there stood Zadok as black as ink, and with eyes that shone like coals of fire. “I have come,” said Zadok, “and first let me cure thy smarts, O master.” He removed the cloths from the young ma[50]n’s back, and rubbed the places that smarted with a cooling unguent. Instantly the pain and smarting ceased, and the merchant’s son had perfect ease. “Now,” said Zadok, “what is thy bidding?” “Tell me,” said Aben Hassen the Fool, “whence comes all the wealth that you have brought me? The king has commanded me to tell him and I could not, and so he has had me beaten with fifty lashes.” “I bring the treasure,” said Zadok, “from the treasure-house of the ancient kings of Egypt. That treasure I at one time discovered to your father, and he, not desiring it himself, hid it in the earth so that no one might find it.” “And where is this treasure-house, O Zadok?” said the young man. “It is in the city of the queen of the Black Isles,” said the King of the Demons; “there thy father lived in a palace of such magnificence as thou hast never dreamed of. It was I that brought him thence to this place with one vessel of gold money and one vessel of silver money.” “It was you who brought him here, did you say, Zadok? Then, tell me, can you take me from here to the city of the queen of the Black Isles, whence you brought him?” “Yes,” said Zadok, “with ease.” “Then,” said the young man,[51] “I command you to take me thither instantly, and to show me the treasure.” The demon flies, carrying the young man by the girdle. “I obey,” said Zadok. He stamped his foot upon the ground. In an instant the walls of the prison split asunder, and the sky was above them. The Demon leaped from the earth, carrying the young man by the girdle, and flew through the air so swiftly that the stars appeared to slide away behind them.[52] In a moment he set the young man again upon the ground, and Aben Hassen the Fool found himself at the end of what appeared to be a vast and splendid garden. “We are now,” said Zadok, “above the treasure-house of which I spoke. It was here that I saw thy father seal it so that no one but the master of Zadok may enter. Thou mayst go in any time it may please thee, for it is thine.” “I would enter into it now,” said Aben Hassen the Fool. “Thou shalt enter,” said Zadok. He stooped, and with his finger-point he drew a circle upon the ground where they stood; then he stamped with his heel upon the circle. Instantly the earth opened, and there appeared a flight of marble steps leading downward into the earth. Zadok led the way down the steps and the young man followed. At the bottom of the steps was a door of adamant. Upon the door were these words in letters as black as ink, in the handwriting of the old man who had gone: “Oh, fool! fool! Beware what thou doest. Within here shalt thou find death!” There was a key of brass in the door. The King of the Demons turned the key and opened the door. The young man entered after him. Aben Hassen the Fool found himself in a vast[53] vaulted room, lit by the light of a single carbuncle set in the centre of the dome above. In the middle of the marble floor was a great basin twenty paces broad, and filled to the brim with money such as he had found in the brazen vessel in the garden. The young man could not believe what he saw with his own eyes. “Oh, marvel of marvels!” he cried; “little wonder you could give me boundless wealth from such a storehouse as this.” Zadok laughed. “This,” said he, “is nothing; come with me.” He led him from this room to another—like it vaulted, and like it lit by a carbuncle set in the dome of the roof above. In the middle of the floor was a basin such as Aben Hassen the Fool had seen in the other room beyond; only this was filled with gold as that had been filled with silver, and the gold was like that he had found in the garden. When the young man saw this vast and amazing wealth he stood speechless and breathless with wonder. The Demon Zadok laughed. “This,” said he, “is great, but it is little. Come and I will show thee a marvel indeed.” He took the young man by the hand and led him into a third room—vaulted as the other two had been, lit as they had been by a carbuncle in the roof above. But when the young man’s eyes[54] saw what was in this third room, he was like a man turned drunk with wonder. He had to lean against the wall behind him, for the sight made him dizzy. In the middle of the room was such a basin as he had seen in the two other rooms, only it was filled with jewels—diamonds and rubies and emeralds and sapphires and precious stones of all kinds—that sparkled and blazed and flamed like a million stars. Around the wall, and facing the basin from all sides, stood six golden statues. Three of them were statues of the kings and three of them were statues of the queens who had gathered together all this vast and measureless wealth of ancient Egypt. There was space for a seventh statue, but where it should have stood was a great arched door of adamant. The door was tight shut, and there was neither lock nor key to it. Upon the door were written these words in letters of flame: “Behold! beyond this door is that alone which shall satisfy all thy desires.” “Tell me, Zadok,” said the young man, after he had filled his soul with all the other wonders that surrounded him—“tell me what is there that lies beyond that door?” “That I am forbidden to tell thee, O master!” said the King of the Demons of the Earth. the door that hides what satisfies all desires [56] “Then open the door for me,” said the young man; “for I cannot open it for myself, as there is neither lock nor key to it.” “That also I am forbidden to do,” said Zadok. “I wish that I knew what was there,” said the young man. The Demon laughed. “Some time,” said he, “thou mayest find for thyself. Come, let us leave here and go to the palace which thy father built years ago, and which he left behind him when he quitted this place for the place in which thou knewest him.” He led the way and the young man followed; they passed through the vaulted rooms and out through the door of adamant, and Zadok locked it behind them and gave the key to the young man. “All this is thine now,” he said; “I give it to thee as I gave it to thy father. I have shown thee how to enter, and thou mayst go in whenever it pleases thee to do so.” They ascended the steps, and so reached the garden above. Then Zadok struck his heel upon the ground, and the earth closed as it had opened. He led the young man from the spot until they had come to a wide avenue that led to the palace beyond. “Here I leave thee,” said the Demon,[57] “but if ever thou hast need of me, call and I will come.” Thereupon he vanished like a flash, leaving the young man standing like one in a dream. He saw before him a garden of such splendor and magnificence as he had never dreamed of even in his wildest fancy. There were seven fountains as clear as crystal that shot high into the air and fell back into basins of alabaster. There was a broad avenue as white as snow, and thousands of lights lit up everything as light as day. Upon either side of the avenue stood a row of black slaves, clad in garments of white silk, and with jewelled turbans upon their heads. Each held a flaming torch of sandal-wood. Behind the slaves stood a double row of armed men, and behind them a great crowd of other slaves and attendants, dressed each as magnificently as a prince, blazing and flaming with innumerable jewels and ornaments of gold. But of all these things the young man thought nothing and saw nothing; for at the end of the marble avenue there arose a palace, the like of which was not in the four quarters of the earth—a palace of marble and gold and carmine and ultramarine—rising into the purple starry sky, and shining in the moonlight like a vision of Paradise. The palace was illuminated from top[58] to bottom and from end to end; the windows shone like crystal, and from it came sounds of music and rejoicing. When the crowd that stood waiting saw the young man appear, they shouted: “Welcome! welcome! to the master who has come again! To Aben Hassen the Fool!” The young man walked up the avenue of marble to the palace, surrounded by the armed attendants in their dresses of jewels and gold, and preceded by dancing-girls as beautiful as houris, who danced and sung before him. He was dizzy with joy. “All—all this,” he exulted, “belongs to me. And to think that if I had listened to the Talisman of Solomon I would have had none of it.” That was the way he came back to the treasure of the ancient kings of Egypt, and to the palace of enchantment that his father had quitted. For seven months he lived a life of joy and delight, surrounded by crowds of courtiers as though he were a king, and going from pleasure to pleasure without end. Nor had he any fear of an end coming to it, for he knew that his treasure was inexhaustible. He made friends with the princes and nobles of the land. From far and wide people came to visit him, and the renown of his magnificence filled all the world. When men would[60] praise any one they would say, “He is as rich,” or as “magnificent,” or as “generous, as Aben Hassen the Fool.” the young man walked up the avenue of marble to the palace So for seven months he lived a life of joy and delight; then one morning he awakened and found everything changed to grief and mourning. Where the day before had been laughter, to-day was crying. Where the day before had been mirth, to-day was lamentation. All the city was shrouded in gloom, and everywhere was weeping and crying. Seven black slaves stood on guard near Aben Hassen the Fool as he lay upon his couch. “What means all this sorrow?” said he to one of the slaves. Instantly all the slaves began howling and beating their heads, and he to whom the young man had spoken fell down with his face in the dust, and lay there twisting and writhing like a worm. “He has asked the question!” howled the slaves—“he has asked the question!” “Are you mad?” cried the young man. “What is the matter with you?” At the doorway of the room stood a beautiful female slave, bearing in her hands a jewelled basin of gold, filled with rose-water, and a fine linen napkin for the young man to wash and dry his[61] hands upon. “Tell me,” said the young man, “what means all this sorrow and lamentation?” Instantly the beautiful slave dropped the golden basin upon the stone floor, and began shrieking and tearing her clothes. “He has asked the question!” she screamed—“he has asked the question!” The young man began to grow frightened; he arose from his couch, and with uneven steps went out into the anteroom. There he found his chamberlain waiting for him with a crowd of attendants and courtiers. “Tell me,” said Aben Hassen the Fool, “why are you all so sorrowful?” Instantly they who stood waiting began crying and tearing their clothes and beating their hands. As for the chamberlain—he was a reverend old man—his eyes sparkled with anger, and his fingers twitched as though he would have struck if he had dared. “What,” he cried, “art thou not contented with all thou hast and with all that we do for thee without asking the forbidden question?” Thereupon he tore his cap from his head and flung it upon the ground, and began beating himself violently upon the head with great outcrying. they who stood waiting began crying and tearing their clothes Aben Hassen the Fool, not knowing what to think or what was to happen, ran back into the[62] bedroom again. “I think everybody in this place has gone mad,” said he. “Nevertheless, if I do not find out what it all means, I shall go mad myself.” Then he bethought himself, for the first time since he came to that land, of the Talisman of Solomon. “Tell me, O Talisman,” said he, “why all these people weep and wail so continuously?” “Rest content,” said the Talisman of Solomon, “with knowing that which concerns thine own self, and seek not to find an answer that will be to thine own undoing. Be thou also further advised: do not question the Demon Zadok.” “Fool that I am,” said the young man, stamping his foot; “here am I wasting all this time when, if I had but thought of Zadok at first, he would have told me all.” Then he called aloud, “Zadok! Zadok! Zadok!” Instantly the ground shook beneath his feet, the dust rose in clouds, and there stood Zadok as black as ink, and with eyes that shone like fire. “Tell me,” said the young man; “I command thee to tell me, O Zadok! why are the people all gone mad this morning, and why do they weep and wail, and why do they go crazy when I do but ask them why they are so afflicted?” “I will tell thee,” said Zadok.[64] “Seven-and-thirty years ago there was a queen over this land—the most beautiful that ever was seen. Thy father, who was the wisest and most cunning magician in the world, turned her into stone, and with her all the attendants in her palace. No one since that time has been permitted to enter the palace—it is forbidden for any one even to ask a question concerning it; but every year, on the day on which the queen was turned to stone, the whole land mourns with weeping and wailing. And now thou knowest all!” “What you tell me,” said the young man, “passes wonder. But tell me further, O Zadok, is it possible for me to see this queen whom my father turned to stone?” “Nothing is easier,” said Zadok. “Then,” said the young man, “I command you to take me to where she is, so that I may see her with mine own eyes.” “I hear and obey,” said the Demon. He seized the young man by the girdle, and in an instant flew away with him to a hanging-garden that lay before the queen’s palace. “Thou art the first man,” said Zadok, “who has seen what thou art about to see for seven-and-thirty years. Come, I will show thee a queen, the most beautiful that the eyes of man ever looked upon.” the young man follows the demon up the steps to the palace [66] He led the way, and the young man followed, filled with wonder and astonishment. Not a sound was to be heard, not a thing moved, but silence hung like a veil between the earth and the sky. Following the Demon, the young man ascended a flight of steps, and so entered the vestibule of the palace. There stood guards in armor of brass and silver and gold. But they were without life—they were all of stone as white as alabaster. Thence they passed through room after room and apartment after apartment crowded with courtiers and nobles and lords in their robes of office, magnificent beyond fancying, but each silent and motionless—each a stone as white as alabaster. At last they entered an apartment in the very centre of the palace. There sat seven-and-forty female attendants around a couch of purple and gold. Each of the seven-and-forty was beautiful beyond what the young man could have believed possible, and each was clad in a garment of silk as white as snow, embroidered with threads of silver and studded with glistening diamonds. But each sat silent and motionless—each was a stone as white as alabaster. Upon the couch in the centre of the apartment reclined a queen with a crown of gold upon her head. She lay there motionless, still. She was[67] cold and dead—of stone as white as marble. The young man approached and looked into her face, and when he looked his breath became faint and his heart grew soft within him like wax in a flame of fire. He sighed; he melted; the tears burst from his eyes and ran down his cheeks. “Zadok!” he cried—“Zadok! Zadok! What have you done to show me this wonder of beauty and love! Alas! that I have seen her; for the world is nothing to me now. O Zadok! that she were flesh and blood, instead of cold stone! Tell me, Zadok, I command you to tell me, was she once really alive as I am alive, and did my father truly turn her to stone as she lies here?” “She was really alive as thou art alive, and he did truly transform her to this stone,” said Zadok. “And tell me,” said the young man, “can she never become alive again?” “She can become alive, and it lies with you to make her alive,” said the Demon.[68] “Listen, O master. Thy father possessed a wand, half of silver and half of gold. Whatsoever he touched with silver became converted to stone, such as thou seest all around thee here; but whatsoever, O master, he touched with the gold, it became alive, even if it were a dead stone.” “Tell me, Zadok,” cried the young man; “I command you to tell me, where is that wand of silver and gold?” “I have it with me,” said Zadok. “Then give it to me; I command you to give it to me.” “I hear and obey,” said Zadok. He drew from his girdle a wand, half of gold and half of silver, as he spoke, and gave it to the young man. “Thou mayst go now, Zadok,” said the young man, trembling with eagerness. Zadok laughed and vanished. The young man stood for a while looking down at the beautiful figure of alabaster. Then he touched the lips with the golden tip of the wand. In an instant there came a marvellous change. He saw the stone melt, and begin to grow flexible and soft. He saw it become warm, and the cheeks and lips grow red with life. Meantime a murmur had begun to rise all through the palace. It grew louder and louder—it became a shout. The figure of the queen that had been stone opened its eyes. “Who are you?” it said. Aben Hassen the Fool fell upon his knees. “I am he who was sent to bring you to life,” he said.[70] “My father turned you to cold stone, and I—I have brought you back to warm life again.” the young man and the alabaster queen The queen smiled—her teeth sparkled like pearls. “If you have brought me to life, then I am yours,” she said, and she kissed him upon the lips. He grew suddenly dizzy; the world swam before his eyes. For seven days nothing was heard in the town but rejoicing and joy. The young man lived in a golden cloud of delight. “And to think,” said he, “if I had listened to that accursed Talisman of Solomon, called ‘The Wise,’ all this happiness, this ecstasy that is now mine, would have been lost to me.” “Tell me, beloved,” said the queen, upon the morning of the seventh day—“thy father once possessed all the hidden treasure of the ancient kings of Egypt—tell me, is it now thine as it was once his?” “Yes,” said the young man, “it is now all mine as it was once all his.” “And do you really love me as you say?” “Yes,” said the young man, “and ten thousand times more than I say.” “Then, as you love me, I beg one boon of you.[71] It is that you show me this treasure of which I have heard so much, and which we are to enjoy together.” The young man was drunk with happiness. “Thou shalt see it all,” said he. Then, for the first time, the Talisman spoke without being questioned. “Fool!” it cried; “wilt thou not be advised?” “Be silent,” said the young man. “Six times, vile thing, you would have betrayed me. Six times you would have deprived me of joys that should have been mine, and each was greater than that which went before. Shall I now listen the seventh time? Now,” said he to the queen, “I will show you our treasure.” He called aloud, “Zadok, Zadok, Zadok!” Instantly the ground shook beneath their feet, the dust rose in clouds, and Zadok appeared, as black as ink, and with eyes that shone like coals of fire. “I command you,” said the young man, “to carry the queen and myself to the garden where my treasure lies hidden.” Zadok laughed aloud. “I hear thee and obey thee, master,” said he. He seized the queen and the young man by the girdle, and in an instant transported them to the garden and to the treasure-house. [72] “Thou art where thou commandest to be,” said the Demon. The young man immediately drew a circle upon the ground with his finger-tip. He struck his heel upon the circle. The ground opened, disclosing the steps leading downward. The young man descended the steps with the queen behind him, and behind them both came the Demon Zadok. The young man opened the door of adamant and entered the first of the vaulted rooms. When the queen saw the huge basin full of silver treasure, her cheeks and her forehead flushed as red as fire. They went into the next room, and when the queen saw the basin of gold her face turned as white as ashes. They went into the third room, and when the queen saw the basin of jewels and the six golden statues her face turned as blue as lead, and her eyes shone green like a snake’s. “Are you content?” asked the young man. The queen looked about her. “No!” cried she, hoarsely, pointing to the closed door that had never been opened, and whereon were engraved these words: “Behold! Beyond this door is that alone which shall satisfy all thy desires.” the young man drew a circle upon the ground with his fingertip [74] “No!” cried she. “What is it that lies behind yon door?” “I do not know,” said the young man. “Then open the door, and let me see what lies within.” “I cannot open the door,” said he. “How can I open the door, seeing that there is no lock nor key to it?” “If thou dost not open the door,” said the queen, “all is over between thee and me. So do as I bid thee, or leave me forever.” They had both forgotten that the Demon Zadok was there. Then the young man bethought himself of the Talisman of Solomon. “Tell me, O Talisman,” said he, “how shall I open yonder door?” “Oh, wretched one!” cried the Talisman, “oh, wretched one! fly while there is yet time—fly, for thy doom is near! Do not push the door open, for it is not locked!” The young man struck his head with his clinched fist. “What a fool am I!” he cried. “Will I never learn wisdom? Here have I been coming to this place seven months, and have never yet thought to try whether yonder door was locked or not!” “Open the door!” cried the queen. They went forward together. The young man[75] pushed the door with his hand. It opened swiftly and silently, and they entered. Within was a narrow room as red as blood. A flaming lamp hung from the ceiling above. The young man stood as though turned to stone, for there stood a gigantic Black Demon with a napkin wrapped around his loins and a scimitar in his right hand, the blade of which gleamed like lightning in the flame of the lamp. Before him lay a basket filled with sawdust. When the queen saw what she saw she screamed in a loud voice, “Thou hast found it! thou hast found it! Thou hast found what alone can satisfy all thy desires! Strike, O slave!” The young man heard the Demon Zadok give a yell of laughter. He saw a whirl and a flash, and then he knew nothing. The Black had struck—the blade had fallen, and the head of Aben Hassen the Fool rolled into the basket of sawdust that stood waiting for it. [76] “Aye, aye,” said St. George, “and so it should end. For what was your Aben Hassen the Fool but a heathen Paniem? Thus should the heads of all the like be chopped off from their shoulders. Is there not some one here to tell us a fair story about a saint?” “For the matter of that,” said the Lad who fiddled when the Jew was in the bramble-bush—“for the matter of that I know a very good story that begins about a saint and a hazel-nut.” “Say you so?” said St. George. “Well, let us have it. But stay, friend, thou hast no ale in thy pot. Wilt thou not let me pay for having it filled?” “That,” said the Lad who fiddled when the Jew was in the bramble-bush, “may be as you please, Sir Knight; and, to tell the truth, I will be mightily glad for a drop to moisten my throat withal.” “But,” said Fortunatus, “you have not told us what the story is to be about.” “It is,” said the Lad who fiddled for the Jew in the bramble-bush, “about—”","sourceLink":"http://novel.tingroom.com/ertong/2336/65263.html","bookId":590,"book":{"id":590,"title":"Twilight Land","description":"简介： Once upon a time there came a soldier marching along the road, kicking up a little cloud of dust at each stepas strapping and merry and bright-eyed a fellow as you would wish to see in a summer day. Tramp! tramp! tramp! he marched, whistling as he jo...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2336","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
