{"id":73419,"no":5,"title":"Page 5","content":"“You’ve got a New York accent,” Chad noted after we’d been swapping crazy customer stories for a while. “I never noticed before.”\n I shrugged. “Yeah. As heard on TV in ten thousand cop shows.”\n Chad laughed.\n “It’s because she’s on her own turf,” Denise explained.\n I didn’t add anything. No biggie that he’d noticed. The accent always came out when I was hanging with family or friends, when my defenses were relaxed and I felt more like the me I used to be.\n “It’s cute,” he teased, exaggerating his own. “Y’all know I’ve got one, too.”\n “She’s gotten good at hiding it,” Denise said, her platinum hair with hot pink tips arranged into artful braids. She had piercings in her nose and brow, and a sleeve of tattoos on her left arm. She was also five months pregnant and just beginning to show. I was so excited about that. I was dying to be an aunt.\n My smartphone started ringing in my purse, and I reached over to the counter to dig it out. Maybe Lei needed me after all. She hadn’t been kidding about the hours when she’d hired me. I’d had 2:00 a.m. calls and weekend calls, but I loved them all because those happened when she was really pumped about something.\n Looking at the screen, I didn’t recognize the New York number and was about to let it go to voice mail when I decided to indulge Chad with my accent a little more.\n “Gianna Rossi’s office,” I answered naturally. “How can I help you?”\n Silence greeted me, then... “Gia.”\n I held my breath, rocked by the way Jax said my name. The way he used to when we were lovers and he’d call just to hear my voice.\n “Say something,” he said gruffly.\n Fortified by the sight of my stricken face in the unforgiving mirror, I replied with chilly calm. “How did you get this number?”\n “Give me a break,” he snapped. “Talk like you used to. The real you.”\n “You’re the one who called me.”\n He bit out something under his breath. “Have lunch with me tomorrow.”\n “No.” I slid out of the chair and walked toward the front of the beauty shop.\n “Yes, Gia. We need to talk.”\n “I don’t have anything to say to you.”\n “Then listen.”\n I rubbed the tip of my stiletto over a crack in a floor tile. Denise had just started turning a profit and there were improvements she wanted to make to the shop. Still, the location was newly hip again and she’d been smart to go with gorgeous vintage pinups on the walls and great retro décor that distracted the eye from minor flaws.\n God, I was a mess over Jax. My scattered brain was bouncing random thoughts all over the place.\n I focused on the man driving me crazy. “If I have lunch with you, will you go away and leave me alone?”\n “I won’t promise that.”\n “Then I won’t go,” I countered. “You’ve got no right to invade my life like this. None of this is your business. You shouldn’t be butting in—”\n “Damn it. I didn’t know you were in love with me, Gia.”\n My eyes closed against the pain of hearing those words from his lips. “If that’s true, you didn’t know me at all.”\n I hung up.\n Chapter 5\n “I FOUND SOMETHING tying Pembry with the Rutledges,” I told Lei first thing Friday morning, following her into her office as she arrived for the day. “An article in FSR magazine.”\n She glanced aside at me. “How long have you been here?”\n “Half an hour, maybe.” But I’d been up late doing my homework, unable to sleep. I needed to know why Jax was meddling in my life and how to get him back out of it again.\n I didn’t want an apology from him or an explanation. I didn’t want to be friends. I didn’t want any reason to hope, because it’d become painfully obvious to me that I was still in love with him. And now, he was becoming aware of it, too.\n I’d learned my lesson the first time, and he’d confirmed it—our relationship had to end at some point. No do-overs.\n I slid the article from Full-Service Restaurant across her desk. “A tiny mention of Pembry supporting and contributing to Rutledge campaigns in a bigger piece on restaurateurs and politics.”\n “Hmm.” Her astute gaze lifted to meet mine. “I lived with Ian for five years. He never once voted in any election. And he’s too much of a tight-ass to spend the kind of money it takes to get the Rutledges’ personal attention.”\n Lei leaned back, twisting her chair side to side. “That said,” she went on, “I can’t see a venture capitalist taking an interest in Ian’s business over mine without some personal motivation. It doesn’t make fiscal sense.”\n Lifting my hands, I admitted, “I don’t get it, either.”\n “Would Jackson tell you what sparked his interest in Ian if you asked him?”\n “Maybe.” I took a seat in front of her desk. “But he’s not the deciding factor here. Stacy prefers Ian. Chad prefers us. We’ve got a grip on this.”\n “Aren’t you curious?”\n “Not enough to go out of my way to talk to him. He’s starting to realize I took our fling more seriously than I should have and that’s...awkward.”\n Lei’s gaze was warm with sympathy. “I guess the best solution is to get this wrapped up. I’m talking with the team at Mondego today about moving forward with just Chad. They’re not as excited—no surprise there—but I think I have an appealing alternative.”\n I leaned forward, and she smiled at my eagerness.\n “These two.” She swiveled her monitor around to face me, revealing two very different women. One darkly exotic, the other a fresh-faced blonde. “I’ve been keeping my eye on them for a few months now. Isabelle, the brunette, specializes in regional Italian, while Inez, the blonde, has a flair for regional French.”\n A soft laugh bubbled up. “Dueling kitchens international.”\n “More work to get the menu right, but when you can’t deliver two, up the ante to three.”\n “Awesome.”\n Lei rubbed her hands together. “With any luck, we’ll still be cracking open bottles of bubbly.”\n I heard my desk phone ringing through the open door and stood.\n She pushed her phone over to me. “You can get that here.”\n Picking up the receiver, I hit the button for my line and answered.\n “Miss Rossi, Ian Pembry. Good morning.”\n I raised my brows and mouthed Ian to Lei. Her mouth curved.\n “Good morning, Mr. Pembry. I was just thinking about you.”\n “I was waiting for you to call, then I got impatient.” The warm amusement in his voice hit me the way I suspected it hit most women. There was no doubt about it; he had a great bedroom voice.\n “Would you be available for lunch sometime?” I asked, shooting a look at Lei to make sure she’d be okay with it. She nodded.\n “I’m flattered you’d choose me over Jackson,” he said, putting my back up. “But I was hoping for dinner instead. I have an engagement tonight and I need a date.”\n Reaching over, I hit the speaker button. “What about Stacy?”\n “She’s wonderful, of course, but I’d prefer to take you. You’ll want to come along, Lei,” he posited, addressing her directly, “and look out for your girl, which is fine. The more the merrier. It’s a formal event. Be at the Midtown heliport by six.”\n Lei grinned, clearly enjoying the exchange although she didn’t reply.\n “You’re assuming I don’t have plans on a Friday night,” I said.\n “Don’t be offended, Miss Rossi.” He sounded amused. “It’s a compliment on your dedication. Lei wouldn’t have hired you if you didn’t put the job first. See you tonight.”\n The line clicked off, and I set the receiver back in the cradle. “Well...what do you think?”\n “I think we need to go shopping.”\n WHEN I RETURNED to my desk, I found a package waiting.\n I ripped into the brown paper wrapping and discovered a foiled box of chocolates inside. The surge of desire that pierced me at the sight of that particular brand—Neuhaus—and the memories it evoked quickened my breathing. My skin heated.\n I’d had the Belgian truffles only once before, when I’d sucked them off the tips of Jax’s fingers. He’d melted them with the heat of his touch...then painted words over my body that he’d licked off with wicked lashes of his tongue.\n Sexy Gia. Sweet. And my favorite—mine.\n My thighs clenched, and I crossed my ankles, my core tightening in greedy demand. My body didn’t care that he’d dumped me without a word. It wanted Jax. Desperately.\n The note attached was simple and unsigned.\n I’d know you blindfolded.\n I COULDN’T TELL you where Lei took us to buy gowns. It was a small, unmarked storefront that had a permanent Closed sign on the door. Appointments only. The moment Lei’s town car pulled up out front, we were ushered inside a showroom of quiet luxury and served champagne with ripe strawberries. There were no price tags in evidence anywhere.\n The next hour passed in a blur of silks and taffetas. I was dazzled.\n There had been times working with Lei that I had been exposed to a world far beyond anything I knew. I always struggled to hide my wide-eyed awe on such occasions, striving to take my cues from Lei, who seemed so natural and at ease. I had to remind myself that her background wasn’t so different from mine. She’d acquired polish over the years and so could I.\n I was eyeing a black gown with lace cap sleeves when Lei set her hand on my shoulder.\n “That’s too old for you,” she said.\n I glanced at her. “I think it looks understated and elegant.”\n “It does, for a woman my age. You’re twenty-five. Enjoy it.”\n “I have to be careful,” I explained. My boss was slender as a reed, graceful and lithe. I was too curvy. “My boobs are too big. And so is my butt.”\n “You’re sexy,” she asserted bluntly. “You play it down at work, which I understand and appreciate, but don’t waste it. It’s a terrible myth that a successful woman can’t be sexy without it ruining her credibility. Don’t buy into it.”\n I caught my lower lip between my teeth. Looking around the showroom, I was intimidated by the reek of wealth it exuded. I was out of my league. The walls were draped in billowing ivory silk, for Christ’s sake, instead of wallpaper. And the finger sandwiches they had just brought out were sitting on a platter I was positive was pure, heavy silver. “Can you help me? I’m afraid I’ll make the wrong choice.”\n “That’s what I’m here for, Gianna.” She gestured at one of the three women helping us. “Let’s see what you’ve got for young, beautiful and voluptuous.”\n THE WHISTLES I got when I stepped out of my bedroom a few hours later both excited me and made me nervous. Denise had come home early to do my hair, bringing Pam, one of her stylists, with her to do my makeup. Angelo was sprawled across the couch watching stuff he’d recorded on the DVR, passing the time until his eight o’clock shift at Rossi’s.\n “Wow,” my brother said, sliding up into a sitting position. “Who are you and what have you done with my sister?”\n “Shut up,” Denise and I retorted in unison.\n “She looks like a movie star,” Pam said, returning from the kitchen, where she’d been cleaning her cosmetic brushes. “One of the real goddesses, I’d say. A Raquel Welch or Sophia Loren.”\n “Who?” Denise frowned.\n But I got it. I’d always thought of my mom the same way.\n The gown we’d chosen in the end was still black, but much sexier. A jeweled brooch held the one shoulder strap together, with inky satin ruched across the bust, cinched at the waist with a thin diamond belt, then slit down the right leg from midthigh to hem. It occurred to me that it was a good thing Vincent was already at Rossi’s. He might’ve freaked a little at how much of my legs were showing. Nico, who was living in Jersey now, would’ve loved it.\n Denise plopped down on the sofa with two beers in hand, passing one over to her husband and setting the other on the coffee table for Pam. She’d been sticking religiously to water and fruit juice since she had found out about the baby.\n Gold hoops glittered from between the crimped mass of her hair. “Is Chad going, too?” she asked.\n “I have no idea.”\n “Is Jax?” Angelo added tightly.\n I shrugged, but my pulse leaped. I had tried not to think about Jax when I’d been getting ready, but I couldn’t help hoping he could see me dolled up. I looked hot.\n “You know better,” he warned.\n “Yeah,” I agreed, “I do.”\n My smartphone rang, and I knew Lei’s driver had arrived. “Gotta run!”\n I hurried across the refinished hardwood of our joint loft to grab my heels, clutch and wrap from the bench by the door, waving at Pam before I exited through the open sliding front door. I skipped the temperamental old freight elevator and took the three flights of stairs to reach the street. Lei’s driver was used to the delay.\n Nico, Vincent and Angelo had bought the loft with the expectation of fixing it up and selling it for a profit. I’d moved in after college and eventually bought Nico’s share when he moved to New Jersey. Then Vincent and I had split the cost of Angelo’s share when he’d moved out with Denise, giving the two of us 50 percent stake each. We’d been considering selling out when Denise found out she was pregnant, and she and Angelo moved back in to save money.\n I liked coming home to a full house and missed Nico. I wasn’t sure what I’d have done with myself living alone. I think having someone around all the time had helped me focus on work and date less than I normally would have. I’d been comfortable with that, but maybe I had just been hiding from the fact I was nursing a broken heart. Maybe I should’ve faced that sooner. Certainly it was time to face it now. \n","sourceLink":"https://allnovel.net/afterburn-afterburn-aftershock-1/page-5.html","bookId":1984,"book":{"id":1984,"title":"Afterburn (Afterburn \u0026 Aftershock #1)","description":"Storyline: \n Afterburn (Afterburn \u0026 Aftershock #1) \n The realization that Jax still affected me so strongly was a jagged pill to swallow. He’d only been part of my life for five short weeks two years ago. But now he was back. Walking into a deal I’d worked hard to close. And God, he was magnificent. His eyes were a brown so dark they were nearly black. Thickly lashed, they were relentless in their intensity. Had I really thought they were soft and warm? There was nothing soft about Jackson Rutledge. He was a hard and jaded man, cut from a ruthless cloth. \n In that moment I understood how badly I wanted to unravel the mystery of Jax. Bad enough that I didn’t mind how much it was going to cost me...\n \n","cover":"https://allnovel.net/images/afterburn-afterburn-aftershock-1.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/afterburn-afterburn-aftershock-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:27:22 AM"}}
