{"id":73421,"no":7,"title":"Page 7","content":"For a second, I considered slipping away while the two men were occupied with staring hard at each other. Then Jax’s arm slipped around my waist from behind, pulling me into him and away from his father. Parker glanced at me. “I’ll bow out and see you at dinner, Gianna. Enjoy yourself.” Jax rounded me, cutting off my view of his dad’s retreating back. “You look amazing,” he said softly, pulling me closer. My shoulders ached with tension. “I’m glad you approve.” He took the first step and I followed. “Breathe, Gia,” he admonished. “I’ve got you.” “I don’t want to be here.” “That makes two of us.” He caressed my back with a soothing brush of his hand. “I hate these things.” “But you fit right in.” His eyes were shadowed with an emotion I couldn’t name. “I was born into it. I don’t live in it.” The heat of his body began to soak into mine. Every breath I took was filled with his scent; every movement he made sent echoes of memories sliding through me. “That’s better,” he coaxed. “Relax into me, baby.” “Don’t.” “You’re in my world now, Gia. My rules.” I shook my head. “I was tricked into coming here.” He pulled me closer, his lips at my temple. “I’m sorry.” “You just had to get that out, didn’t you? I don’t see why. Clearly I wasn’t the dirty little secret I thought I was.” “Not dirty.” His voice lowered. “Except when you wanted me that way. A little rough, a lot hard. Jesus. You used to turn me inside out.” I stepped on his foot on purpose. His low laugh rippled through me. “You’ve been drinking,” I accused, smelling the faint trace of liquor on his breath. “Driven to it.” He pulled back, his jaw set. “I didn’t know it’d be so damn hard to see you again.” “I’ll make it easier. Help me and Lei get out of here.” “Not yet.” His soft mouth brushed over my brow. “I spent a night with your family. You owe me a night with mine.” “Then do I get to disappear, never to be seen again?” I really wanted to. Cinderella at the ball had turned into the unsuitable girl once more. His chest brushed against my breasts as he urged me closer. “That’s the plan.” JAX KEPT ME dancing through two more songs, bluntly refusing to relinquish me to Ian or two other gentlemen who attempted to cut in. I got the message as loudly as I’m sure everyone else did: I arrived with Ian, but I was now with Jax. At that point, I decided to play my Cinderella role to the hilt. I kicked the voice in my head that had been depressing me for the past two days into a corner and flexed my toes in my proverbial glass slippers. “I want champagne,” I announced abruptly. Jax eyed me. “Is that right?” “Yep.” His eyes took on a wicked gleam I recognized. “Come on.” Grabbing my hand, he led me off the dance floor and through the crowd. It surged around him, trying to pin us in, but he was adept at brusque acknowledgments and quick rejoinders. I caught sight of a familiar face, beautiful Allison Kelsey—the woman whose fiancé’s bachelor party had brought Jax and I together—then the view changed to a brightly lit hallway. From there, Jax led me through a swinging door into a massive industrial-sized kitchen buzzing with activity. I looked around, noting the multiple cooking stations and the black-and-white service uniforms I’d only ever seen in movies. Jax snagged a bottle of champagne out of the hands of a waiter, slipped his ring finger around the stem of a flute in a practiced movement, then pulled me out a side door into another hallway. “Where are we going?” I asked, still wary of being alone with him. I wanted him. I’d never stopped. “You’ll see.” The sounds of the party grew louder, and I ignored the pang of disappointment I felt at the possibility of rejoining it. Seriously, I had to make up my mind. Jax led me through open French doors onto a terrace overlooking a magical garden. At least it looked that way to me, with its torch-lit gravel pathways and handsome old trees sparkling with white lights. “Whose house is this?” I queried. “It’s a Rutledge estate.” The way he said it conveyed more ownership than the words themselves. “Right.” “Pretend we crashed this party,” he said, leading me down cobblestone steps to a crescent-shaped marble bench. I sat, watching as he poured champagne for me and passed me the glass. “Seems like we’ve been pretending all along, doesn’t it?” Jax swigged straight out of the bottle and wiped his mouth with the back of his hand, careless and a bit defiant. “Maybe. I still know you better than you think I do.” “I don’t feel like I know you at all.” “So get to know me,” he challenged. “What are you afraid of?” I sipped my champagne. “Spinning my wheels and dead ends.” “Can’t you just enjoy the ride?” Oh, I’d love it. A surge of heated yearning pierced me. He set the bottle on the bench beside me. “I’m going to kiss you.” My breath caught. “No, you’re not.” “Try and stop me.” I surged to my feet. “Jackson—” “Shut up, Gia.” He cupped my face in both hands and took my mouth. For a moment I didn’t move, frozen by the feel of his lips on mine, so soft yet firm. Achingly familiar. Tender. His tongue licked along the seam. I opened up to him with a low moan and he slid inside. I dropped my flute. Distantly, I heard it shatter, but didn’t care. My arms were draped across his broad shoulders; my fingers were in his silky hair. I was drinking him in, tasting champagne and Jax, lifting onto my toes to deepen the connection. As always, he gave me what I demanded of him. Holding me still, he ate at my mouth, stroking with the velvet lash of his tongue, nibbling with lips and teeth, sliding his lips back and forth across mine. Savoring me. Turning a simple kiss into an erotic melding that had me trembling with pleasure. God, I’d missed him. Missed the way he made me feel. He growled, the rough sound vibrating against me. His hands slid downward, rubbing along my back, holding me in place as he rolled his hips and brushed the thick length of his erection against my cleft. Desire shot through me, flushing my skin. He smelled delicious, the subtle fragrance of his soap mixing with the virile scent that was his alone. I wanted to wallow in him the way I used to, pressing my naked body to his until even air couldn’t come between us. “Gia,” he murmured gruffly, his lips sliding along my cheek. “Christ, I want you.” I closed my eyes, my hands fisting in the thick strands of his hair. I was on fire for him, my skin feeling too tight and sensitive. “You had me.” “I made the right decision walking away.” His breath gusted over my temple. “That doesn’t mean I don’t regret it.” A tiny voice of caution was screaming. “You’ll hurt me.” “I’ll worship you.” One of his hands captured my nape. The other gripped my hip, urging me into the slide of his hardness against my clit. “You remember how it was. Hours with my hands and mouth on you, my cock inside you—” “For how long?” My core was clenching, tightening in demand for an orgasm. “Weeks.” He groaned. “Months. Jesus, I’m so hard it hurts.” I struggled out of his hold. “I need more than sex.” He let me go, but his gaze was fierce and hot. “I’ll give you everything I’ve got.” “For a few weeks?” I trembled from the effort of staying away from him when he was all I craved. “A few months?” “Gia.” Jax scrubbed his hands over his face. “Damn it. Take what I can give you.” “It’s not enough!” “It has to be. Christ... Don’t ask me to turn you into one of them!” I jerked back, startled by his vehemence. “What are you talking about?” He turned his back to the house and picked up the bottle of champagne, drinking deeply. Confused, I studied him and saw only mulish determination. I looked past him into the ballroom, seeing the glittering couples inside. Lei appeared at that moment, walking onto the terrace with Chad on her arm. In that moment I understood how badly I wanted to unravel the mystery of Jax, bad enough that I didn’t care how much it was going to cost me. “Mind if we join you?” Lei asked as she and Chad approached. Her eyes caught mine. I sank onto the bench, my body still throbbing with unappeased hunger. Glancing at Jax, I found his eyes on me. A challenge was there in those dark depths. I held my hand out for the champagne, gripping the bottle by the neck when he handed it to me. I lifted it in toast and drank to that dare. Chapter 6 DON’T DISAPPEAR. See me again.... Jax’s last words, whispered in my ear as we said goodbye, haunted me on the flight back to New York. If I tangled with him I’d get hurt, because I would hope. I wanted more. But what choice did I have? I had to know what had gone so wrong before and what was still holding him back now. I’d always assumed it was me—who I was, where I came from—not meshing with who he was and what he wanted long-term. I glanced at Lei, who was seated across from me on the plane, as she opened her clutch and withdrew a folded piece of paper. She slid it over and I smoothed it out on the table in front of us. I read the first paragraph, shot a look down to see the signature at the bottom, then lifted my head. “Oh, my God... You got Chad to sign?” “It’s a tentative agreement,” she qualified, “based on getting Isabelle and Inez on board—and you overseeing the first restaurant—but it’s got him on the hook.” “Wow.” I refolded the document carefully, taking in the fact that I’d just been handed a major responsibility. “I can’t believe you had this with you. Did you know he’d be there?” “I suspected, knowing Ian.” I handed the agreement back to her. “Rutledge took care of you tonight,” Lei noted. “Ian tried to throw you to the wolves, but Jackson kept you too close for that.” And he’d wanted me even closer. I shrugged off her unspoken query, not wanting to get into something so deeply personal. “By the way, Parker Rutledge explained the connection. Ian introduced Parker to the latest Mrs. Rutledge.” “Did he?” Lei’s elegantly arched brows rose. “Then it’s likely Ian knows Regina Rutledge intimately.” “Are you kidding?” “’Fraid not.” “Okay, then.” She leaned her head back against the seat. “Let’s enjoy the weekend. Turn off your phone, forget about work. Just recharge. We’ll hit it fresh on Monday.” That sounded perfect to me. “I’m more than game, but I’ll leave my phone on in case you need me.” Lei smiled. “I won’t need you, I promise. I’ve got a date this weekend.” “All weekend?” “I’m overdue.” I laughed. In the year I’d been with Lei, I hadn’t known her to date. She was due for a good time, all right. So was I. “Rock it.” She shot me a look. “I plan to.” WHEN I GOT HOME, it was just past two in the morning and everyone was asleep. I padded to my room on bare feet, eager to strip and scrub down to my bare skin. I was reaching for the concealed zipper on the side of my dress when I caught sight of my reflection in the mirrored closet doors. I paused, really taking a good hard look at myself. Was Jax attracted to the polished businesswoman I’d become in a way he hadn’t been to the girl I was before? Was I okay with that? “God.” I sat on the edge of my bed, wishing someone were awake that I could talk to. If Nico had been around, he’d be up. He was a night owl. Impulsively, I reached for the phone on my nightstand and speed-dialed him. It rang three times before he answered. “Hey,” he said. “This better be good.” I winced at his irritated and slightly breathless tone, suspecting I’d interrupted him when he had someone staying over. “Nico, hi. Sorry. I’ll call back tomorrow.” “Gianna.” He exhaled roughly and I heard rustling. “What’s up?” “Nothing. We’ll chat tomorrow. Bye.” “Don’t hang up on me!” he snapped. “You wanted me, you got me. Spill it.” I hung up, figuring the sooner I let him go, the sooner he’d get back to whatever he’d been doing. A half second later, the phone started ringing. I answered quickly, hoping it didn’t wake up the rest of the house. “Nico, come on. It’s not a big deal. I’m sorry I bugged you so late.” “Gianna, if you don’t start talking, I’m heading up there to kick your ass. Is this about Jackson?” I sighed. I should have known he would’ve heard the news from someone. “I’ve got a free weekend. I thought maybe I could come visit. Give you a hard time. Harass you a little. Or a lot.” “Now?” Actually, I’d been thinking about it, but... “No, tomorrow.” “Bullshit. You don’t call after two in the morning to say you want to stop by tomorrow.” “You’re busy.” “By the time you get here, I won’t be.” His voice softened. “You got a safe ride down?”","sourceLink":"https://allnovel.net/afterburn-afterburn-aftershock-1/page-7.html","bookId":1984,"book":{"id":1984,"title":"Afterburn (Afterburn \u0026 Aftershock #1)","description":"Storyline: Afterburn (Afterburn \u0026 Aftershock #1) The realization that Jax still affected me so strongly was a jagged pill to swallow. He’d only been part of my life for five short weeks two years ago. But now he was back. Walking into a deal I’d worked hard to close. And God, he was magnificent. His eyes were a brown so dark they were nearly black. Thickly lashed, they were relentless in their intensity. Had I really thought they were soft and warm? There was nothing soft about Jackson Rutledge. He was a hard and jaded man, cut from a ruthless cloth. In that moment I understood how badly I wanted to unravel the mystery of Jax. Bad enough that I didn’t mind how much it was going to cost me...","cover":"https://allnovel.net/images/afterburn-afterburn-aftershock-1.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/afterburn-afterburn-aftershock-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:27:22 AM"}}
