{"id":89054,"no":14,"title":"Page 14","content":"She woke up with a jolt, hearing her name, \"Harry,\" and for a moment she did not know where she was, but was convinced she was a prisoner. It was only Jack, standing in the doorway of the bedroom. She sighed and relaxed, conscious that much of her panic was caused by the fact that her right hand had closed only on bedclothes. Jack was looking at her quizzically; the white-knuckled right fist was not lost on him. \"It\u0027s right here,\" he said, nodding to his left, where Gonturan hung from a peg on the wall, next to silver-hiked Dalig and long Teksun. She unbent her fingers one by one, and with her left hand smoothed the bedding. Senay and Terim sat up and quietly began pulling on their boots, and Narknon lay down with an offended grunt over the pillow Harry had just vacated.\n There was food on the table again, and silent Ted stood to one side, poised and waiting to fill a plate or a cup. Harry came into the front room with her left arm close to her side and her hand across her stomach; Gonturan was hanging over her right shoulder. \"Jack,\" she said, \"do you suppose I could borrow a - a belt from you? I seem to have ... lost mine.\"\n Jack looked at her and then at the saffron- and blue-sashed waists of her two companions. \"Lost?\" he said, knowing something of Hill sashes.\n \"Lost,\" said Harry firmly.\n Ted put down his coffee-pot and went off to search for a leather Outlander belt.\n The sky was red when two dozen grim Outlanders set out beside three Hillfolk, one wearing a brass-buckled Outlander belt, heading north and west away from the Outlander fort. \"We include one first-rate bugler,\" said Jack cheerfully. \"At least we\u0027ll know whether we\u0027re coming or going.\" His men were dressed in the Homelander uniform of dull brown, with the red vertical stripe over the left breast that indicated Damarian duty. Harry permitted herself a twinge of nostalgia for her first sight of those uniforms, in the little clattering train, sitting opposite her brother. She asked, \"Is it indiscreet, or merely putting a good face on it that you\u0027re wearing your proper uniforms?\"\n Jack replied, staring toward the mountains, \"It is that most of us have little useful clothing that is not of army issue.\" He turned to her and smiled. \"And besides, familiarity also breeds comfort. And I think, just now, we might do well to think of morale whenever we can.\"\n They jogged steadily, with much jingling of tack from the fort horses; Harry had forgotten how noisy bits and chains and stirrups were, and felt that the Northerners would hear them coming from behind the mountains. They stopped just before dawn, in a valley at the beginning of the foothills. \"Tonight,\" said Senay, \"we must go east into these hills, for there my village is.\" Harry nodded.\n Jack looked uneasy. \"Harry,\" he said, \"I\u0027m not sure my lot will be very welcome in Senay\u0027s home town. If you like, we can ride a little farther along the way, so as not to lose time, and meet you near the pass - at the foot of the final trail to it, perhaps.\"\n \"Mm.\" Harry explained this to Senay, who looked at Jack and then Harry with surprise. \"We will all ride together,\" she said. \"We are comrades.\"\n Harry did not need to translate. Jack smiled a little. \"I wonder if Corlath would approve.\"\n Terim had caught the king\u0027s name, and asked Harry what was said. \"He would say the same, of course,\" Terim replied. \"It is true we are often enemies, but even when we are enemies, we are nearer each other than we can ever be to the Northerners, at least so long as only human blood runs in our veins. It is why this war is so bitter. We cannot occupy the same land. It has always been thus.\"\n \"We don\u0027t occupy the same land particularly well ourselves, however human we may be,\" said Jack, and when Terim looked inquiringly at him, Jack put it in Hill-speech.\n Terim chewed his lip a minute. \"Yes, we fight, and usually we do not love each other; but we are still the same. The Northerners are not. You will see. Where their feet step, it will be as if our land were sown with salt.\"\n Jack looked at Harry, and Harry looked at Jack. \"I am not sure of this,\" she said. \"I know the wizardry their folk produce is different than the Hillfolk\u0027s, and ... I know that any possibility of a part-blood Northerner is looked on with disgust and ... fear. You call someone half-North, thidik, and they may be forgiven for trying to kill you. Evidently,\" and Harry\u0027s voice was very even, \"Hill and Outlander blood is supposed to cross more gracefully.\"\n As Jack stared at his horse\u0027s neck, Senay leaned toward him, and touched his horse\u0027s mane. \"We are like enough, Jack Dedham; we all follow Harimad-sol.\"\n Jack smiled. \"We all follow Harimad-sol.\"\n Harry said, \"Jack, you are not following me. Don\u0027t you start.\"\n Jack looked at her, still smiling; looked up, for his stolid gelding Draco was a hand and a half shorter than Sungold. But he did not answer.\n They rested most of the day and started off again an hour before sunset, following Senay\u0027s directions. The desert was behind them now, and so neither the sun nor the conspicuousness of traveling through empty country would force them to march only by night. It was near midnight when two men stepped into the path before them, and held up torches that suddenly burst into fire. Everyone blinked, and the Outlander horses tossed their heads. Then a voice behind one torch said sharply, \"Who are you, who travel to the town of Shpardith?\"\n Senay replied, \"Thantow, have you forgotten me so quickly?\"\n Thantow walked forward, holding his torch high, and Senay dismounted. \"Senay you are,\" he said, and those near behind could see him smile. \"Your family will be pleased to see you return to them,\" although his eyes wandered over them, and the jingling of bits was very loud in Harry\u0027s ears.\n \"These are my comrades,\" Senay said simply, and Thantow nodded. He muttered a few words to his companion, who turned and trotted off, the light of his torch bobbing dizzily till he disappeared around a bend of the rocky way.\n Harry dismounted, and Narknon reappeared from the darkness to sit under Sungold\u0027s belly and watch the goings-on, and make sure she wasn\u0027t being left out of anything interesting. Senay turned to Harry and introduced her reverently as \"Harimad-sol,\" whereupon Thantow swept her a very elegant Hill bow, which included the hand gestures of respect, and Harry tried not to shuffle her feet. They all moved forward again, and after a few minutes the narrow path opened up. It broadened slowly till it turned into a round patch of grass encircled by a white path that gleamed mysteriously in the torchlight. A little breeze wandered around them, and the smell was like roses.\n Thantow led them around the white path, and at the end of the circle opposite was a tall building of brown and grey stone, built into the mountainside, with moss and tiny, carefully cultivated trees bordering its roof. In the windows of this building lights were appearing. As they approached nearer, the wooden door crashed open, and a child in what was probably a nightgown came flying out, and unerringly sprang into Senay\u0027s arms. \"You\u0027ve been gone weeks and weeks,\" the child said accusingly.\n \"Yes, love, but I did tell you I would be,\" said Senay, and the child buried her face in Senay\u0027s diaphragm and said, \"I missed you.\"\n Three other people emerged from the still-open door. First was a tall old man carrying a lantern, and limping on one leg; a younger woman strode behind him, then hurried forward to say, \"Rilly, go inside.\" Senay gently disengaged the reluctant Rilly, who backed up, one foot at a time, toward the house, not caring whom she might run into, till she bumped into the doorframe, fell through it, and disappeared from view. The young woman turned back to Senay, and embraced her long and silently. When the old man came up to them, he called Senay daughter. Harry blinked, for this man was certainly the local lord, the sola, of this place; but then, to be able to send his daughter so far to the laprun trials, perhaps it was not surprising.\n The third person was a young man, Senay\u0027s brother, for they both looked like their father; and he patted her arm awkwardly and said, \"How was it?\" He looked about sixteen.\n Senay smiled at him. \"I was well defeated,\" she said, in the traditional phrase, \"and I wear my sash so,\" and her fingers touched the torn rent. Harry sighed. \"This is Harimad-sol,\" Senay said, \"who wielded the sword that cut my sash. She took the trials.\" The old man turned to look at her sharply, and Harry met his gaze, wondering if he would comment on her obviously Outlander cast of features under the Hillman\u0027s hood; but he looked at her a moment, the lantern light shining in her eyes, and then bowed himself, and said, \"My house is honored.\" Only then did his eyes drop to the blue hilt just visible beyond the edge of her cloak. He turned to look at the rest of them, and his quiet face gave nothing away as he looked at two dozen Outlander cavalry standing uneasily at his threshold. \"These are my comrades,\" Senay said again, and her father nodded; and the woman, Senay\u0027s stepmother, said formally, \"They are welcome.\"\n Terim and Jack followed Harry and Senay into the house, while Jack\u0027s men and horses were led along the stone ridge of mountainside that the sola\u0027s house was built against, to a long low hall. \"It is the village meeting-place,\" Senay explained. \"Many of our Hill towns have them, near the sola\u0027s house, for there we can all come together to talk or to celebrate; and when it is necessary we can shelter our friends and stable their horses.\"\n Harry nodded slowly. \"And if you must ... defend?\"\n The old man smiled without humor. \"There are caves, and twisting paths that lead pursuers to walls of stone or cliffs; and we can disappear if we must. You would not have come easily to this place if Senay had not guided you. The Hills are not good country for conquerors; there are too many holes in them.\"\n \"Yes,\" murmured Jack.\n The room they entered was a large one; there were rugs on the floors and walls, and a long low table beside a long window, although it was closely curtained now. \"Rilly,\" said her mother firmly, \"you may stay up for a short while, but you must put your robe and your boots on.\" Rilly disappeared again.\n Servants entered the room bringing malak and small fat cakes, and Rilly reappeared and snuggled down by Senay, who put an arm around her. Harry waited, wondering if she would have to explain their errand; but Senay said with the same simplicity as she had explained the Outlanders as her comrades: \"We go to stop the Northerners who come through the Madamer Gate. Who is there that can come with us?\"\n Sixteen riders joined them in the morning when they set out once more, and Harry began to feel a trifle silly riding at the head of what was becoming at least a company if not an army. But it was obviously expected of her to ride first, chin in the air, staring forthrightly ahead. It\u0027s better than one mad Outlander on a Hill horse, she thought. What would I have done if Senay and Terim hadn\u0027t followed me, if Jack hadn\u0027t been at the fort?\n \"Jack,\" she said.\n \"Mmm?\"\n \"Have you ever seen Ritger\u0027s Gap?\"\n \"No. Why?\"\n \"I am wondering, in a foresightful commanding sort of way, how ridiculous a few dozen of us strung out across it are going to look when - if - the Northerners do in fact decide to use it.\"\n Jack grimaced. \"Not very - silly, I mean. I believe it\u0027s a very narrow place; there\u0027s a valley spread out on the far side of it, but the gap itself we should be able to bottle up for some time, even the few of us.\"\n Harry expelled her breath. \"I do keep thinking how much of a fool\u0027s errand this is.\"\n Jack smiled. \"A noble and well-meaning fool\u0027s errand at least.\"\n That night Harry dreamed: Ritger\u0027s Gap, the Madamer Gate, was a thin cleft of rock, no more than two-horse width; on the south side was a small rocky plateau, which then fell away abruptly into the forested mountainside. On the north was a wide bowl of valley with some dull brush and loose rock covering it; uneven footing, she thought in her dream, and no protection. Not a battlefield of choice. The valley led slowly up to the final narrow gap in the rock. She turned in her dream, and saw a little string of riders, the leader on a tall chestnut horse that gleamed like fire in the sun, striding up the path to the rocky plateau. She had seen these riders before, toiling up that mountainside. The familiarity of the vision comforted her; perhaps she had, after all, made the right choice when the path had forked. Perhaps she would justify Luthe\u0027s faith in her.\n And Corlath?\n She woke with a start. There was the greyness before true dawn in the sky, but she arose nonetheless and began to stir the fire. She noticed, with a flash of fear and anger, that her hand trembled; and then the fire burned up, and in its red heart she saw two faces. First was Corlath\u0027s. He stood quietly, staring at something she could not see; and he looked sad, and the sadness wrung her heart as though she were the cause of it. Then his face became the flames of a campfire again, but they flickered and rearranged themselves and became the face of Aerin, who smiled wryly, and it came into Harry\u0027s mind that perhaps Aerin had something to do with Senay and Terim following her, and Jack having sent Richard alone to argue for the General Mundy. Harry smiled a little, weakly, herself, at the face in the fire. Aerin looked away, as if something had caught her attention, and there was a blue glint at her side, which might have been Gonturan\u0027s hilt, or only the snapping of a small fire.\n \"Do we ride out early, then?\" said Jack, his voice rough with sleep.\n \"Yes,\" said Harry. \"I don\u0027t like my dreams - and I ... suspect that I am supposed to pay attention to some of my dreams.\"\n Their voices caused other sleepers to stir, and by the time the sun rose up over the crest of the Hills on their right, they had ridden some miles. \"We will be there by tomorrow,\" said Harry at their midday halt; and the grimness of her own voice surprised her. She was sitting on the ground as she spoke, and Narknon came to her, and wrapped herself around her shoulders and back like a fur cloak, as if to comfort her.\n There was a scuffle, suddenly, to one side, and Harry whipped around, one hand on Gonturan. A tall woman strode out from the trees, two of Jack\u0027s soldiers, looking tousled, slightly annoyed, and slightly afraid, standing on her either side. One of them held half a loaf of bread and the other a drawn dagger; but he held it like a bread knife. The woman was dressed in brown leather; there was a woven blue belt, sky blue, a color that comforted the eye, around her waist, and a dull crimson cap on her head; and she wore a quiver of arrows over her shoulder and carried loosely in her hand a long bow, with blue beads the color of her belt twisted just below the handgrip.\n \"I am Kentarre,\" she said. \"Forgive the abruptness of my arrival.\"\n \"The filanon,\" breathed Senay, standing stiffly at Harry\u0027s side.\n \"The who?\" muttered Harry; and then to the tall woman, \"You have just proven to us that we need to post sentries, even to eat a mouthful of bread. We thought ourselves alone here, and our haste to our own ends has made us careless.\"\n \"Sentries, I think, would not have stopped me, and you see - \" and Kentarre held up her bow - \"I come in peace to you, for I cannot notch an arrow before any of your people might stop me.\"\n She spoke Hill-speech, but her accent was curious, and the inflections were not predictable. Harry found she had to listen closely to be sure she heard correctly, for she was not that accustomed to the Hill tongue herself. Perhaps it was her attention that caught the unspoken \"even\" before \"I cannot notch an arrow,\" and she smiled faintly. Kentarre stood quite still, smiling in return. Narknon came to sit, in her watch-cat disguise, at Harry\u0027s feet. She gave Kentarre one of her long clear-eyed looks and then, without moving, began to purr.\n One mark in your favor, thought Harry, for Narknon\u0027s judgment is usually pretty good. \"What do you wish of us?\" she said.\n Kentarre said, \"We have heard, even in our high Hilltops, where we talk often to the clouds but rarely to strangers, that she has come who carries the Lady Aerin\u0027s sword into battle once more; and we thought that we might seek her, for our mothers\u0027 mothers\u0027 mothers followed her long ago, when Gonturan first came to Damar in the hands of the wizard Luthe. So we made ready for a long journey; and then we found that Gonturan, and the sol who carries her, were coming to us; and so we waited. Three weeks we have waited, as we were told; and you are here; and we would pledge to you.\" In the last sentence Kentarre\u0027s lofty tone left her, and she looked, quickly and anxiously, into Harry\u0027s face, and color rose to her cheekbones.\n Harry was doing some rapid calculations. Three weeks ago she had sat in a stone hall and eaten breakfast with a tall thin man who had told her that he had no clear-cut fortune for her, but that she should do what she felt she must do.\n Harry met Kentarre\u0027s gaze a little ruefully. \"If you knew so well when we would be here, perhaps you know also how pitifully few we are and how heedless an errand we pursue. But we would welcome your help in holding the Northerners back for what time we may, if such is also your desire.\"\n The last finger of the hand holding the bow gently spun one of the blue beads on its wire; and Harry thought that Kentarre was not so much older than herself. \"Indeed, we do wish it. And if any of us remain afterward, we will follow you back to your king, whom we have not seen for generations, for in this thing perhaps all of what there is left of the old Damar must come together, if any of it is to survive.\"\n Harry nodded, thinking that perhaps Kentarre\u0027s people would be convinced to go without her when the time came, for Corlath was likelier to be pleased to see them without his mutineer in their midst; but such thoughts were superfluous till they found out if any of their number would survive a meeting with the Northerners. Kentarre turned and stepped briskly back into the woods.\n \"The filanon,\" Senay murmured again.\n \"The which?\" Harry said.\n \"Filanon,\" she repeated. \"People of the trees. They are archers like none else; it is said they speak to their arrows, which will turn corners or leap obstacles to please them. They are legends now; even my people, who live so near their forests, have believed that they no longer exist, even if the old tales are true, and once the filanon, with their blue-hung bows, did live high in the mountains where no one else went.\" She paused a moment, and added, \"Very rarely one of us has found one of the blue beads; they are thought to be lucky. My father has one that his father found when he was a little boy. He was wearing it the day the gursh - boar - gored him, and he said that it would have had him in the belly, and killed him, if the blue bead had not turned the beast at the last.\"\n Jack said, \"Tell me, Captain, do you always take in the loose wanderers you find in the woods if they offer to fall in with you?\"\n Harry smiled. \"Only when they tell stories that I like. Three weeks ago I was talking to a ... wise man who told me that ... things would happen to me. I am inclined to believe that this is one of them. Besides, Narknon likes her.\"\n Jack nodded. \"I prefer to believe you. Although I have my doubts about your tabby\u0027s value as a judge of character.\" He blinked at her once or twice. \"You\u0027re different, you know, than you were when you still lived with us Outlanders. Something deeper than the sunburn.\" He said this, knowing its truth, curious to see its effect upon the young woman he had once known, had once watched staring at the Darian desert.\n Harry looked at him, and Jack was sure she knew exactly what was passing through his mind. \"I am different. But the difference is a something riding me as I ride Sungold.\" She looked wry.\n Jack chuckled. \"My dear, you are merely learning about command responsibility. If you were mine, I\u0027d promote you.\"\n They finished their noon meal without seeing anything more of Kentarre; but as they mounted, many of them looking nervously around for more tall archers to burst from the bushes upon them, the materialization suddenly took place. Kentarre stood before Harry with a dark-haired man at her elbow; he carried a bow too, but among the blue beads at its grip was one apple-green one; and his tunic was dun-colored. Then Harry without turning her head saw that the path was lined with archers; she nodded blandly as if she had expected them to appear like this - which in fact she rather had - and moved Tsornin off. Kentarre and the man fell in with her and Jack and Senay and Terim, and the rest of the archers followed after the last horses had passed. Kentarre walked with as free and swinging a pace as Sungold.\n There were about a hundred of her new troop, Harry found, when they stopped again. With them were about twenty hunting-cats: bigger-boned, with broader flatter skulls than Narknon\u0027s, and more variety of color than Harry had seen among Corlath\u0027s beasts. Narknon herself kept carefully at Harry\u0027s heels: even the indomitable Narknon seemed to feel discretion was the better part of valor when faced with twenty of her own kind, and each of them a third larger than herself.\n Harry and her company found a little rock bowl, sheltered from the northwest wind that had begun to blow that afternoon, and all of them clustered in it, around several small fires. The archers unstrung their bows and murmured to or over their arrows, and the others watched them surreptitiously. Bows seemed as outlandish to the sword-bearers as feathers on one of their horses. Jack\u0027s men felt absently for revolvers that weren\u0027t on their hips.\n At dawn they set off again, and now Harry felt that she rode into her dream; perhaps she would wake up yet and find herself in the king\u0027s tent, with unknown words on her lips and Corlath\u0027s hands on her shoulders, and pity in his eyes. They rode, the archers striding long-legged behind them, up a narrow trail into the mountain peaks; up the dark unwelcoming slopes to the border of the North. The cold thin air bit at their throats, and the sun was seen as scattered falls of light through the leaves. The ground underfoot was shaly, but Tsornin never stumbled; his ears were hard forward and his feet were set firmly. Harry tapped her fingernail on the big blue stone in the hilt of Gonturan and thought of a song she\u0027d sung as a child; the tune fluttered through her mind, but she couldn\u0027t quite catch the words. It made her feel isolated, as though her childhood hadn\u0027t really happened - or at least hadn\u0027t happened as she remembered it. Perhaps she\u0027d always lived in the Hills; she\u0027d seen Sungold foaled, and she had been the one first to put a saddle on his young back, and had trained him to rear and strike as a warhorse. Her stomach felt funny.\n They reached Ritger\u0027s Gap, the Madamer Gate, before sunset, spilling out across the little plateau that lay behind it, with trees at its back and only bare rock rising around it to the mountaintop, a few bowlengths above them. There was a long shallow cave to one side, where the mountain peak bent back on itself, and low trees protected much of the face of it. \"We\u0027ll sleep in something resembling shelter tonight,\" said Jack cheerfully. \"At least as long as the wind doesn\u0027t veer around and decide to spit at us from the south.\"\n Harry was listening to the northern breeze; it sneered at her. \"It won\u0027t,\" she said.\n Jack cocked an eyebrow at her, but she said no more about it. The plateau was loud with the panting of men and horses; they had hurried to arrive, just as her dream had told her they would, or must; the last hour, men and horses had had to scramble up, side by side. Harry leaned against Sungold\u0027s shoulder, grateful for the animal solidity of him; he turned his head to chew gently on her sleeve till she petted him. After a minute of staring around her she slowly followed Narknon as the cat paced up to the Gap itself and stared into the valley beyond. Even Narknon seemed subdued, but perhaps it was the day\u0027s hard miles.\n Two riders abreast could pass the narrow space in the rock, perhaps, but their knees would touch. On this side of the Gap, the plateau sloped up to the shoulders of the narrow cleft and down the other side, where men and clever-footed horses might climb. Harry stared through, and became conscious of Sungold\u0027s warm breath on the back of her neck. Narknon leaped down from her perch beside the cleft, turned her back on it, and began to wash. Harry stood in the Gap itself, and leaned against the spot Narknon had vacated. A pebbly slope dropped down away from her to a scrub-covered valley between the mountain\u0027s arms; there was a lower valley wall on the far side, but it fell away into foothills. Harry felt her sight reaching away, into the harsh plain beyond the dun-colored valley and scattering of low sharp hills; and on the edge of the plain she saw a haze that eddied and drifted, like a tide coming in, exploring the shore before it, reaching out to stroke the little hills before it swept over them.\n Harry turned and went back to her company. She said to no one in particular, \"They will be here tomorrow.\"\n It was a silent camp that night; everyone seemed almost superstitiously afraid to polish a dagger one last time in too obvious a fashion; much quiet checking of equipment went on, but it was a shadowy sort of motion. No one met another\u0027s eyes and there was no bright ring of metal on metal. Even footfalls were muffled.\n Jack\u0027s bay gelding Draco and Harry\u0027s Sungold had become friends over the days of carrying their riders side by side. The Outlander horses were always set out on a picket line while the Hill horses wandered where they would, never far from the human campsite; and Sungold and Draco stood nose to nose often, murmuring to each other perhaps about the weather and the footing of the day past; perhaps about the eccentricities and preoccupations of their riders. Tonight they stood near together with their heads facing the same way - watching us, Harry thought, looking back at them; or watching that awful northwest wind. Sungold nicked one ear back, then forward again, and stamped. Draco turned his head to blow thoughtfully at his companion, and then they both settled down for a nap, one hind leg slack, their eyes dim and unfocused. Harry watched enviously. The north wind gibbered.\n \"Draco, who knows almost as much about battles as I do, has told young Sungold that he should get a good night\u0027s sleep. I, world-weary warrior that I am - that\u0027s hard to say after too many hours in the saddle - am about to say the same thing to you, my brilliant young Captain.\"\n Harry sighed. \"Do stop calling me Captain. Carrying Gonturan is enough; and she\u0027s not your legend.\"\n \"You\u0027ll get used to it, Captain,\" said Jack. \"Would you deny me one small amusement? Don\u0027t answer that. Go to sleep.\"\n \"Perhaps if I could stand on three legs and let my eyes glaze over, it would help,\" she replied. \"I do not feel like sleeping and I ... dread dreaming.\"\n \"Hmm,\" said Jack. \"Even those of us who aren\u0027t compelled to believe in what we dream aren\u0027t happy about dreams the night before a battle, but that\u0027s ... inevitable.\"\n Harry nodded, then got up to unroll her blanket and dutifully laid herself down on it. Narknon couldn\u0027t settle either; she paced around the fire, wandered over to touch noses with Sungold, returned, lay down, paced some more. \"I\u0027ll send Kentarre and her people into the woods on either side of the Gap, looking down on the valley; we can all mob together here - and see what comes.\"\n \"Splendid,\" said Jack from his blanket, as he pulled off his boots. \"I couldn\u0027t arrange it better myself.\"\n Harry gave a breathless little laugh. \"There isn\u0027t much to be organized, my wise friend. Even I know that.\"\n Jack nodded. \"You could send us through that crack in the rock two at a time, to get cut in pieces; I would then object. But you aren\u0027t going to. Go to sleep, General.\" Harry grunted.\n Harry\u0027s eyes stayed open, and saw the cloud come across the moon, and heard the whine of the north wind pick up as the clouds strangled the moonlight. She heard the stamp of a horse from the picket line, and an indeterminate mumble from an uneasy sleeper; and Narknon, who had finally decided to make the best of it by going to sleep, snored faintly with her head on Harry\u0027s breast. And beyond these things she heard ... other things. She had set no sentries, for she knew, as she knew the Northerners would face them tomorrow, that they were not necessary. It was a small piece of good fortune that every one of her small company might have the chance of sleep the night before the battle, and it would be foolish not to accept any good fortune she was offered. But as she lay awake and solitary she heard the stamp of hooves not shod with iron, the shifting of the bulk of riding-animals that were not horses, the sleeping snores of riders that were not human. Then her mind drifted for a few almost peaceful minutes; but she heard a rustle, and as her drowsy mind slowly recognized the rustle as a tent flap closing she heard Corlath\u0027s voice say sharply, \"Tomorrow.\" She sat up in shock; Narknon slithered off her shoulder and rearranged herself on the ground. Around her were the small dead-looking heaps of her friends and followers, the red embers of campfires, the absolute blackness of the curve of rock and the shifting blackness that was the edge of the trees. She turned her head and could faintly see the silhouette of horse legs, and she heard the ring of iron on a kicked rock. Jack was breathing deeply; his face was turned away from the dying fire glow, and she could not see his expression; she even wondered if he were feigning sleep as a good example for her. She looked at Narknon, stretched out beside her; her head was now over Harry\u0027s knees. There was no doubt that she was sincerely asleep. Her whiskers twitched, and she muttered low in her throat.\n Harry lay down again. The wind sniggered around the rocks, but overhead it flung itself, laughing shrilly, through the mountains, into the quiet plains of Damar, bearing with it the inhuman whispers and moans of the Northern army. Harry shivered. A finger of breeze touched her cheek and she recoiled; it ran over her shoulder and disappeared. She pulled the blanket over her face.\n She must have slept, for when she pushed the blanket away from her face again the mountain was edged with dawn and her mouth tasted sticky. She sat up. Narknon was still asleep. Jack\u0027s eyes were open. He was staring grimly at nothing; she watched his eyes pull into focus to look at her. He sat up, saying nothing, and put his elbows on his knees, and rubbed his hands over the grey stubble of hair on his head. Other bodies were stirring. There was a small spring-fed pool in a fist of rock where the front of the shallow cave was sheltered by the trees; one of Jack\u0027s men filled a tin at it and brought it to one of Kentarre\u0027s archers, who had produced a slender tongue of flame from last night\u0027s ashes. Harry stared dreamily at the little fire till something black came between her and it, which proved to be Jack, kneeling down at their own bed of embers. Harry got up, kicking her blankets off, and went to fetch another tin of water.\n Jack smiled at her when she returned. She tried to smile back; she wasn\u0027t sure how successful she was.\n While they waited for the water to boil, Harry walked to the Madamer Gate and stared through it. The top of her head stood above the rock cleft, and the north wind howled down on her; her scalp felt tight and cold. The haze still hung where she had seen it the evening before, at the beginning of the foothills; but this morning she felt she could see flashes of color and motion within it. The color was the color of fear.\n The wind chewed into her and she went back to the cave. They were all sitting, hunkered down around their tiny fires; and they were all watching her; or all but Jack, who was shaving. She admired the steadiness of his hand as he bent over a ragged bit of mirror propped against a rock on the ground. She stopped just before the shadow of the cave began. \"Stay out of the wind while you can,\" she said. \"It\u0027s not ... the right sort of wind.\"\n Terim looked up, as if he could see the shape of the wind itself, and not only the way it shook the leaves and bounced pebbles from the rockfaces. \"The Northerners send their wind to chill us,\" he said.\n Harry remembered the creeping touch on her face the night before. \"Yes,\" she said slowly. \"To chill us - but I think also to discover us. I prefer that we tell it no more than we must.\"\n At midmorning Harry saddled Sungold, unrolled the tops of her boots and lashed them to her thighs, settled her leather vest with particular care across her shoulders, and Gonturan against her hip. Shield and iron-bound helm hung ready from the front of the saddle; Sungold turned to look at her. The saddle looked strange, unbalanced, without the bulky knapsacks strapped around it. Draco chewed his bit, and Tsornin pointed an ear briefly at the sound.\n Shortly before noon Harry sent Kentarre and her archers and their big soft-footed cats out beyond the Gate, into the last trees on the mountains\u0027 shoulders rising above the haggard valley. Harry watched anxiously, for the covering of stunted trees was not good, and she felt that every blue bead would be visible; but the archers disappeared as if they were no more than thrown pebbles. Harry was sure that whatever approached them knew the Gate was held against them - knew and smiled at the tale the wind brought; but she could do no more.\n Jack saw them for the first time just before Kentarre led her archers away. He was staring through a narrow black spyglass; his hands were as steady as they had been with his razor. Harry could keep hers from chafing and plucking at each other only by thinking about it constantly; she clamped them on her sword belt. They felt damp. Harry had been watching those coming toward them all morning and it took her a moment to understand Jack\u0027s sudden grunt of comprehension. The fog had flowed into the mouth of the valley, and now it resolved itself into a mass of dark moving shapes which still seemed to cast more shadow than they should, for they were very near.\n \"Mount,\" said Harry.\n The wind chuckled wildly as it tore at their hair, and pinged madly off metal as helms were settled in place, and dragged at the fingers of gloves, and sword tips, and horse tails. Sungold stood with his nose in the Gate; Draco stood at Harry\u0027s knee, stolidly, ears pricked. Harry could feel Tsornin tremble, but it was impatience; and she bit her lip in shame for herself and pride for her horse. Terim\u0027s horse tossed its head anxiously and switched its tail; Terim\u0027s face beneath the helm was unreadable. Narknon reappeared from wherever she had spent the morning, licking her chops; she hadn\u0027t been satisfied with porridge this morning. She polished her whiskers carefully, then came to the head of the column, to sit between Tsornin and Draco. \"Narknon, my dear,\" said Harry, \"why don\u0027t you go sleep by the fire for now, till ... till we come back? This isn\u0027t your sort of hunting.\"\n Narknon looked up at her, perfectly aware that she was being addressed; then she lowered her gaze again and stared out across the valley.\n \"The filanon\u0027s cats went with them,\" said Jack. \"You\u0027ll hurt her feelings if you try to leave her behind.\"\n Harry said fiercely, \"This is not the time to make silly jokes.\"\n \"On the contrary, Captain,\" replied Jack. \"This is exactly the time.\"\n Harry swallowed and looked out at the Northerners again. At the front of the army before them was a rider on a white horse. The horse was magnificent, as tall as Sungold, with the same proud head and high tail; red ribbons fluttered from its forelock and crest. His reins were golden glints against its snowy neck; and the rider\u0027s heavy sword was a great golden bar at his side. Beside him a dark rider on a mud-colored beast carried a banner: white, with a red bird on it, a bird of prey with a curved beak.\n \"No army can move that fast,\" said Jack.\n \"No,\" said Harry.\n The white horse screamed and Sungold answered, rearing; Harry punched his neck with a closed fist, and he settled back, but his haunches were tensed under him, waiting to hurl them forward.\n \"Very well,\" said Harry. \"We will go to meet them now.\"\n A rain of arrows fell from the sky into the dark sea at their feet, and some of the dark many-shadowed shapes fell, and weird cries drifted up to the watchers at the Gate. \"At least arrows pierce them,\" Harry heard Terim say. Sungold\u0027s ears lay flat to his head, and he pranced where he stood. Harry could hear the horses moving up close behind her; Senay and Terim stood with their horses\u0027 front feet half up the rock slope on either side of the Gap.\n \"Jack,\" said Harry. \"You wait here; we\u0027ll come back when we\u0027re ready for a breather, and you can argue with them for a while.\"\n \"As you say, Captain,\" said Jack. And he whispered, \"Good luck, Harimad-sol.\"\n Harry gestured to Jack\u0027s trumpeter, and they sallied out under a banner of bright brass notes, for they carried no other.\n Sungold leaped down the slope, and the white stallion reared and neighed; his rider turned him and galloped to one side, and the lightless mass of the army surged up the sides of the valley. War-cries rang in harsh throats, twisted by ill-shaped tongues.\n The ground before the Gate was in Harry\u0027s favor, for there was little room to maneuver, and no room for the overwhelming numbers of the Northerners to sweep around their small adversaries and crush them. Each side must fight on a narrow front; it was a question merely of how long the Hillfolk had the strength to fight, for there were always replacements for any Northerner who fell or grew weary. Harry pulled Gonturan from her scabbard and swung her once, shrilling through the air, splitting the northern wind into fragments that fell, crying, under Sungold\u0027s feet. \"Gonturan!\" yelled Terim. \"Harimad-sol and Gonturan!\" called Senay, not to be outdone; and then the Hillfolk met the Northerners.\n Sungold plunged and struck with teeth and hooves as Gonturan cut and thrust; and Harry felt the yellow wave rising in her mind and was glad of it, for her intellect was of little use, and that the wrong sort, just now; and she noticed that Gonturan was wet with blood, but that the blood seemed an odd color. Clouds massed to cover the sun, but they kept breaking up and drifting away again, and the Hillfolk fought more strongly for this proof that the black army was not all-powerful.\n Harry was dimly aware that Draco\u0027s head was at her knee again, and there was a momentary lull when her right arm could drop and her small shield rest heavily on her leg, and she said, \"Where did you come from?\"\n \"It looked as if you never would come back and give us a chance, and we got tired of waiting,\" said Jack; and then the battle swelled around them again, and the clank of metal and the bash of blows rose up and smothered them. There was a smear of blood along Sungold\u0027s neck, and as he tossed his head, foam flew backward and ran down Harry\u0027s forearm.\n Those they fought were hard to see clearly, even from as close as a sword stroke. Harry saw better than most and still she could not say why she was sure that those she faced were not all human. Some glittering eyes and swift arms were human enough; but others seemed to swing from curiously jointed shoulders and hips, and the eyes were set oddly in odd-shaped skulls - although perhaps the skulls were all right, and the helms were deliberately misshapen. Some of the horses too were true horses; but some had hides that sparkled like scales, and feet that hit the ground unlike hooves, and teeth that were pointed like a dog\u0027s.\n Minutes passed and Gonturan had a life of her own; and the next time Harry saw Jack, Draco crashed into them from one side and Jack\u0027s stirrup caught at her ankle; and he yelled, \"You might think of retiring for a few minutes, Captain; we\u0027ve upset them, and we deserve it.\"\n Harry looked around puzzled, but it was true; her handful had driven the dark army back; they were halfway down the valley again. \"Oh,\" she said. \"Umm. Yes.\"\n \"Back!\" shouted Jack, standing in his stirrups. \"Back to the Gap!\" The trumpeter picked it up, for he had followed Jack when the colonel struggled to reach Harry, as he had followed Colonel Dedham often before in years and battles past; and never yet had he received a wound that hindered his playing, although the border skirmishes he was acquainted with had little prepared him for this day. He was tired and bloody now, and it took him a moment to fill his lungs to make his trumpet speak; but then the notes flew out again, over the heads of the combatants, and Harry\u0027s company collected themselves to fall back to the Gap. Harry saw Senay near at hand, and then the others, one at a time, turning, half aware, in their saddles, hearing the notes of the retreat; some picking up the cry and throwing it farther; the filanon had a long clear singing note that they passed among themselves. As the Hill and Outlander horses wheeled to gallop away and Harry prepared to follow them, suddenly the white stallion was before her.\n This one almost looked like a real horse, she thought; but its teeth were bared, and they were the sharp curved fangs of a flesh-eater. Its bit came to a sharp point on each side of its jaw, so it could slash an opposing horse with a sideways twist of its head. Its long ears were flat to its skull, and its blue eyes rolled. It reared and screamed its stallion scream again, and Sungold answered; but when her horse\u0027s front feet hit the earth again, he leaped forward; and Harry saw the other stallion\u0027s rider sweep his golden sword up in challenge. Gonturan glittered in the sunlight; but when they met, the blow was of more than physical strength. The other rider\u0027s sword drew no blood, but Harry reeled in her saddle; the noise the sword had made against her fresh-stained and pitted shield sent waves of fear through her, and her yellow war-rage went grey and dim. Sungold reared and shrieked; the white stallion was not quick enough, and when the chestnut swerved away there was blood on the other\u0027s neck and shoulder and rein.\n This seemed to drive the white horse mad, and it came again; Harry heard through the deadening thunder in her ears that the other rider laughed. She raised her eyes to where his should be, under his blazing white helm, and saw spots of red fire; below that, teeth were bared in a grin in a jaw that might once have been human. The power that washed over that face, that rolled down the arms and into the sword and shield, was that of demonkind, and Harry knew she was no match for this one, and in spite of the heat of Gonturan in her hand her heart was cold with fear. The two stallions reared again, and reached out to tear each other; the white stallion\u0027s neck was now ribboned with blood, like the real ribbons he wore in his mane. Harry raised her sword arm, and felt the shock of the answer; the hilts of the swords rang together, and sparks flew from the crash, and it seemed that smoke rose from them and blinded her. The other rider\u0027s hot breath was in her face. His lips parted and she saw his tongue; it was scarlet, and looked more like fire than living flesh. Her arm was numb. The contact lasted only a moment; Sungold wrenched himself and his rider free, and Harry\u0027s legs held her on his back from habit, while she struggled only not to drop her sword. Sungold bit the white stallion just above the tail, and the horse kicked; too late, for Sungold again twisted out of the way and bit him again on the flank, and the blood flowed from the long wicked gash. The white stallion threw up his head and lunged forward, away from his enemy. Harry heard the rider laugh again, although he made no attempt to rein his horse around for another attack; an attack that Harry knew would be her last defense. He could wait. He knew the strength of his army and the size of the force that chose to try and block it, for the wind he sent had told him.\n But it was then, as the white stallion ran from them, and the banner-bearer turned to follow its leader, that from the black ground-swell a long stripy body rose and flung itself snarling at the mud-colored beast. Sungold was leaping forward again before Harry was aware of her legs closing around him; for it was Narknon. The cat slashed at the rider, and dropped away again, and then sprang at the beast\u0027s face and seized its nose in her teeth; purple blood welled out and poured down Narknon\u0027s matted sides. The beast reared, trying to tear at the cat with its clawed forefeet, but Narknon twisted in mid-air. The beast came to the ground again as its rider made a sword cut at the cat, but it missed, for Gonturan got in its way. And the beast reared up once more, mad with pain, and flung itself over backward; and neither beast nor rider rose again, and the red-and-white banner was trampled underfoot. \n","sourceLink":"https://allnovel.net/the-blue-sword-damar-2/page-14.html","bookId":2083,"book":{"id":2083,"title":"The Blue Sword (Damar #2)","description":"Storyline: \n The Blue Sword (Damar #2) \n The Blue Sword is a fantasy novel written by Robin McKinley and published by the Berkley Publishing Group in 1982. The novel The Hero and the Crown serves as a prequel. The Blue Sword has received numerous awards, including: Newbery Honor Award, ALA Best Book for Young Adults and the ALA Notable Children\u0027s Book. The story, told in the third-person omniscient perspective, is of a young woman named Angharad Crewe, called Harry, who becomes a warrior in her adopted homeland of Damar.\n \n","cover":"https://allnovel.net/images/the-blue-sword-damar-2.jpg","author":"Robin McKinley","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-blue-sword-damar-2.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:32:29 PM"}}
