{"id":89048,"no":7,"title":"Page 7","content":"She woke at once when the man of the household pushed the curtains back from her sleeping-place and set a candle on the low bronze-top table beside her pillows. She stood up, stretched, creaked, sighed; and then changed quickly into her riding clothes and gulped the malak set beside the candle. Narknon protested all this activity with a sleepy grumble; then rewove herself into the tousled blankets and went back to sleep. Harry went outside and found Mathin\u0027s dark bay and her own Sungold there already. Tsornin turned his head and sighed at her. \"I couldn\u0027t agree more,\" she whispered to him, and he took the shoulder of her robe gently in his teeth. Mathin appeared out of the darkness and a pack horse followed him.\n He nodded at her, and they mounted and rode toward the Hills that reared up so close to the camp, although she could not see them now. As the sky paled she found that they had already climbed into the lower undulations of those Hills, and the camp they had left was lost to view. The horses\u0027 hooves made a sterner thunk now as they struck the earth of the Hills. She breathed in and smelled trees, and her heart rose up, despite her fears, to greet the adventure she rode into.\n They rode all that day, pausing only to eat and pull the saddles off the horses for a few minutes and rub their backs dry. Harry had to find a rock to crawl up on before she could get back on her horse, far from the conveniences of brown-clad men who knelt and offered her their cupped hands, and Sungold obviously thought this ritual of his rider calling him over to her as she perched atop some rock pile before she mounted him very curious.\n Mathin said, \"This is the first thing I will teach you. Watch.\" He put a hand at each edge of the saddle, and flung himself up and into it, moving his right hand, on the back of the saddle, gracefully out of his way as soon as he had made the initial spring.\n \"I can\u0027t do that,\" said Harry.\n \"You will,\" said Mathin. \"Try.\"\n Harry tried. She tried several times, till Sungold\u0027s ears lay flat back and his tail clamped between his hind legs; then Mathin let her find a small rock that raised her only a few inches, and made her try again. Sungold was reluctant to be called to her and put through the whole uncomfortable process again; but he did come, and braced his feet, and Harry did get into the saddle. \"Soon you will be able to do this from the ground,\" said Mathin. And this is only the beginning, Harry thought miserably. Her wrists and shoulders ached. Sungold held no grudges, at least; as soon as she was on him again his ears came up and he took a few little dance steps.\n They rode always uphill, till Harry\u0027s legs were sore from holding herself forward in the saddle against the downward pull. Mathin did not speak, except to force her to practice the saddle-vaults at each halt; and she was content with silence. The country they were crossing was full of new things for her, and she looked at them all closely: the red-veined grey rock that thrust up beneath the patches of turf; the colors of the grass, from a pale yellow-green to a dark green that was almost purple, and the shape of the blades: the near-purple grass, if grass it was, had broad roots and narrow rounded tips; but the pack horse snatched at it like grass. The riding-horses were much too well mannered to do anything but eye it, even after so many days of the dry desert fare. Little pink-and-white flowers, like Lady Amelia\u0027s pimchie but with more petals, burst out of rocky crevasses; and little stripy brown birds like sparrows chirped and hopped and whisked over the horses\u0027 heads.\n Mathin turned in his saddle occasionally to look at her, and his old heart warmed at the sight of her, looking around her with open pleasure in her new world. He thought that Corlath\u0027s kelar had not told him so ill a thing as he had first thought when Corlath told his Riders his plan to go back to the Outlander station to steal a girl. They camped at the high narrow end of a small cup of valley; Mathin, Harry thought, knew the place from before. There was a spring welling from the ground where they set the tents, two tiny ones called tari, so low that Harry went into hers on her hands and knees. At the lower, wider end of the valley the spring flattened out and became a pool. The horses were rubbed down thoroughly and fed some grain, and freed.\n Mathin said, \"Sometimes it is necessary, away from home and in a small camp, to tether our horses, for horses are more content in a herd; but Sungold is your horse now and will not leave you, and Windrider and I have been together for many years. And Viki, the pack horse, will stay with his friends; for even a small herd is better than solitude.\"\n Mathin made dinner after the horses were tended, but Harry lingered, brushing Sungold\u0027s mane and tail long after anything resembling a tangle still existed. For all her weariness, she was glad to care for her horse herself, glad that there was no brown man of the horse to take that pleasure away from her. Perhaps she would even learn to jump into the saddle like Mathin. After a time she left her horse in peace and, having nothing better to do, hesitantly approached Windrider with her brush. The mare raised her head in mild surprise when Harry began on the long mane over her withers, as she didn\u0027t need the attention any more than Sungold had, but she did not object. When Mathin held out a loaded plate in her direction, however, Harry dropped the brush and came at once. She ate what Mathin gave her, and was asleep as soon as she lay down.\n She woke in the night as an unexpected but familiar weight settled on her feet. Narknon raised her head and began her heavy purr when Harry stirred. \"What are you doing here?\" said Harry. \"You weren\u0027t invited, and there is someone in Corlath\u0027s camp who will not be at all pleased at your absence when the hunts ride out.\" Narknon, still purring, made her boneless feline way up the length of Harry\u0027s leg, and reached out her big hunter\u0027s head, opened her mouth so that the gleaming finger-length fangs showed, and bit Harry, very gently, on the chin. The purr, at this distance, made Harry\u0027s brain clatter inside her skull, and the delicate prickle of the teeth made her eyes water.\n Mathin sat up when he heard Harry\u0027s voice. Narknon\u0027s tail stretched out from the open end of the tent, the tip of it curling up and down tranquilly. Harry, in disbelief, heard Mathin laugh: she hadn\u0027t known Mathin could laugh.\n \"They will guess where she has gone, Harimad-sol. Do not trouble yourself. The nights are cold and will grow colder here; you may be grateful for your bedmate before we leave this place. It is a pity that neither of us has the skill to hunt her; she could be useful. Go to sleep. You will find tomorrow a very long day.\"\n Harry lay down, smiling in the dark, at Mathin\u0027s courtesy: \"Neither of us has the skill to hunt her.\" The thought of her lessons with this man - particularly now that she knew he could laugh - seemed a trifle less ominous. She fell asleep with a lighter heart; and Narknon, emboldened by the informality of the little campsite and the tiny tent, stretched to her full length beside her preferred person and slept with her head under Harry\u0027s chin.\n Harry woke at dawn, as though it were inevitable that she awake just then. The idea of rolling out so soon did not appeal to her in the least, rationally, but her body was on its feet and her muscles flexing themselves before she could protest. The entire six weeks she spent in that valley were much in that tone: there was something that in some fashion took her over, or seized the part of her she always had thought of as most individually hers. She did not think, she acted; and her arms and legs did things her mind only vaguely understood. It was a very queer experience for her, for she was accustomed to thinking exhaustively about everything. She was fascinated by her own agility; but at the same time it refused to seem quite hers. Lady Aerin was guiding her, perhaps; for Harry wasn\u0027t guiding herself.\n Mathin was also, she found out, spiking their food with something. He had a small packet, full of smaller packets, rolled in with the cooking-gear. Most of these packets were harmless herbs and spices; Harry recognized a few by taste, if not by name. The ones new to her since her first taste of Hill cooking she asked about, as Mathin rubbed them between his fingers before dropping them into the stew, and their odor rose up and filled her eyes and nostrils. She had begun asking as many questions about as many things as she could, as her wariness of Mathin as a forbidding stranger wore off and affection for him as an excellent if occasionally overbearing teacher took its place. And she learned that he was in a more mellow mood when he was cooking than at almost any other time.\n \"Derth,\" he might answer, when she asked about the tiny heap of green powder in his palm; \"it grows on a low bush, and the leaves have four lobes,\" or \"Nimbing: it is the crushed dried berries of the plant that gives it its name.\" But there was also a grey dust with a heavy indescribable smell; and when she asked about it, Mathin would look his most inscrutable and send her off to clean spotless tack or fetch unneeded water. The fourth or fifth time he did this she said flatly, \"No. What is that stuff? My tack is wearing thin with cleanliness, Sungold and Windrider haven\u0027t a hair out of place, the tents are secure against anything but avalanche, and you won\u0027t use any more water. What is that stuff?\" Mathin wiped his hands carefully and rolled the little packages all together again. \"It is called sorgunal. It ... makes one more alert.\"\n Harry considered this. \"You mean it\u0027s a - \" Her Hill speech deserted her, and she used the Homelander word: \"drug.\"\n \"I do not know drug,\" said Mathin calmly. \"It is a stimulant, yes; it is dangerous, yes; but - \" here the almost invisible glint of humor Harry had learned to detect in her mentor\u0027s square face lit a tiny flame behind his eyes - \"I do know what I am doing. I am your teacher, and I tell you to eat and be still.\"\n Harry accepted her plateful and was not noticeably slower than usual in beginning to work her way through it. \"How long,\" she said between mouthfuls, \"can one use this ... stimulant?\"\n \"Many weeks,\" said Mathin, \"but after the trials you will want much sleep. You will have time for it then.\"\n The fact that neither Harry nor Mathin could hunt Narknon did not distress Narknon at all. Every day when lessons were through, and Harry and Mathin and the horses returned to the campsite, tired and dirty and at least in Harry\u0027s case sore, Narknon would be there, stretched out before the fire pit, with the day\u0027s offering - a hare, or two or three fleeks which looked like pheasant but tasted like duck, or even a small deer. In return Narknon had Harry\u0027s porridge in the mornings. \"I did not bring enough to feed three for six weeks,\" Mathin said the third morning when Harry set her two-thirds-full bowl down for Narknon to finish. \"I\u0027d rather eat leftover fleek,\" said Harry, and did.\n Harry learned to handle her sword, and then to carry the light round shield the Hillfolk used; then to be resigned, if not entirely comfortable, in the short chain-stiffened leather vest and leggings Mathin produced for her. As long as there was daylight she was put, or driven, through her steadily - alarmingly - improving paces: it was indeed, she thought, as if something had awakened in her blood; but she no longer thought of it, or told herself she did not think of it, as a disease. But she could not avoid noticing the sensation - not of lessons learned for the first time, but like old skills set aside and now, in need, picked up again. She never learned to love her sword, to cherish it as the heroes of her childhood\u0027s novels had cherished theirs; but she learned to understand it. She also learned to vault into the saddle, and Sungold no longer put his ears back when she did it.\n In the evenings, by firelight, Mathin taught her to sew. He showed her how to adapt the golden saddle till it fit her exactly; how to arrange the hooks and straps so that bundles would ride perfectly, her sword would come easily to her hand, and her helm would not bang against her knee when she was not wearing it.\n As she grew quicker and cleverer at her lessons, Mathin led her over more of the Hills around their camp in the small valley. She learned to cope, first on foot and then on horseback, with the widest variety of terrain available: flat rock, crumbling shale, and small sliding avalanches of pebbles and sand; grass and scree and even forest, where one had to worry about the indifferent blows of branches as well as the specific blows of one\u0027s opponent. She and Mathin descended to the desert again briefly, and dodged about each other there. That was at the end of the fourth week. From the trees and stones and the running stream, she recognized where the king\u0027s camp had stood, but its human visitors were long gone. And it was there on the grey sand with Tsornin leaping and swerving under her that an odd thing happened.\n Mathin always pressed her as hard as she could defend herself; he was so steady and methodical about it that at first she had not realized she was improving. His voice was always calm, loud enough for her to hear easily even when they were bashing at each other, but no louder; and she found herself responding calmly, as if warfare were a new parlor game. She knew he was a fine horseman and swordsman, and that no one was a Rider who was not magnificently skillful at both; and that he was training her. Most of the time, these weeks, she felt confused; when her mind was clearer, she felt honored if rueful; but now, wheeling and parrying and being allowed the occasional thrust or heavy flat blow, she found that she was growing angry. This anger rose in her slowly at first, faintly, and then with a roar; and she was, despite it or around it, as puzzled by it as by everything else that had happened to her since her involuntary departure from the Residency. It felt like anger, red anger, and it felt dangerous, and it was far worse than anything she was used to. It seemed to have nothing to do with losing her temper, with being specifically upset about anything; she didn\u0027t understand its origin or its purpose, and even as her temples hurt with it she felt disassociated from it. But her breath came a little quicker and then her arm was a little quicker; and she felt Tsornin\u0027s delight in her speed, and she spared a moment, even with the din in her ears rising to a terrible headache, to observe wryly that Sungold was a first-class horse with a far from first-class rider.\n Mathin\u0027s usual set grin of concentration and, she had thought recently, pride flickered a bit at her flash of attack; and he lifted his eyes briefly to her face, and even as sword met sword he ... faltered.\n Without thinking, for this was what she was training for, she pressed forward; and Windrider stumbled, and Sungold slammed into her, shoulder to shoulder, and her blade hit Mathin\u0027s hilt to hilt, and to her own horror, she gave a heave and dumped him out of the saddle. His shield clanged on a rock and flipped front down, so it teetered foolishly like a dropped plate.\n The horses lurched apart and she gazed down, appalled, at Mathin sitting in a cloud of dust, looking as surprised as she felt. The grin had disappeared for a moment - quite understandably, she thought - but by the time he had gotten to his feet and she had slid down from Sungold\u0027s back and anxiously approached him, it had returned. She tried a wavering smile back at him, standing clumsily with her sword twisted behind her as if she\u0027d rather not be reminded of its presence; and Mathin switched his dusty sword from his right hand to his left and came to her and seized her shoulder. He was half a head shorter than she was, and had to look up into her eyes. His grip was so hard that her mail pinched her shoulder, but she did not notice, for Mathin said to her: \"My honor is yours, lady, to do with what you will. I have not been given a fall such as that in ten years, and that was by Corlath himself. I\u0027m proud to have had the teaching of you - and, lady, I am not the least of the Riders.\"\n The anger had left her completely, and she felt dry and cold and empty, but then as her eyes unwillingly met Mathin\u0027s she saw a sparkle of friendship there, not merely the objective satisfaction of a teacher with a prize pupil: and this warmed her more kindly than the anger had done. For here in the Hills, she, an Outlander woman, had a friend: and he was not the least of the Riders.\n Lessons continued after that, but they were faster and more furious, and the light in Mathin\u0027s face never faded, but it had changed from the sturdy concentration of a teacher to the eager enthusiasm of a man who has found a challenge. The heat and strength they expended required now that they stop to rest at midday, when the sun was at its height, even though the Hills were much cooler than the central desert had been. Tsornin would never admit to being tired, and watched Harry closely at all times, in case he might miss something. He took her lessons afoot very badly, and would lace back his ears and stamp, and circle her and Mathin till they had to yell at him to go away. But during the last ten days he was content to stand in the shade, head down and one hind leg slack, at noontime, while she stretched out beside him.\n One day she said, \"Mathin, will you not tell me something of how the horses are trained?\" They were having their noon halt, and Sungold was snuffling over her, for she often fed him interesting bits of her lunch.\n \"My family raises horses,\" said Mathin. He was lying on his back, with his hands crossed on his chest, and his eyes were shut. For several breaths he said nothing further, and Harry wanted to shout with impatience, but she had learned that such behavior would shut Mathin up for good, while if she bit her tongue and sat still, hugging her irritability quietly, he would sometimes tell her more.\n He told her more this time: how his father and three older brothers bred and raised and trained some of Damar\u0027s finest riding-horses. \"When I was your age,\" he said bleakly, \"the best horses were taught the movements of war for the fineness of control necessary in both horse and rider; not for the likelihood that they should ever see battle.\n \"My father trained Fireheart. He is very old now, and trains no more horses, but he still carries all our bloodlines in his head, and decides which stallions should be bred to which mares.\" He paused, and Harry thought that was all; but he added slowly, \"My daughter trained Sungold.\"\n There was a long silence. Then Harry asked: \"Why did you not stay and train horses too?\"\n Mathin opened his eyes. \"It seemed to me that a father, three brothers and their families, a wife, daughter, and two sons were enough of one family to be doing the same thing. I have trained many horses. I go home ... sometimes, so that my wife does not forget my face; but I have always wished to wander. As a Rider, one wanders ... It is also possible that I was not quite good enough. None of the rest of my family has ever wished to leave what they do, even for a day. I am the only one of us for generations who has ridden to the laprun trials to win my sword.\"\n Harry said, \"Why is it that you are my teacher? Were you - Did Corlath order you?\"\n Mathin closed his eyes again and smiled. \"No. On the day after you drank Meeldtar and saw the battle in the mountains, I spoke to Corlath, for I knew by your Seeing that you would be trained for battle. It might have been Forloy, who is the only one of us who speaks your Outlander tongue, or Innath, who is the best horseman of us; but I am older, and more patient perhaps - and I trained the young Corlath, once, when I was Rider to his father.\"\n Forloy, thought Harry. Then it was Forloy. \"Mathin - \" she began, and her voice was unhappy. She was staring at the ground, plucking bits of purple grass and shredding them, and did not notice that Mathin turned to look at her when he heard the unhappiness. She had not sounded so for weeks now, and he was pleased that this should be so.\n \"Why - why did Forloy never speak to me, before I - before you began to teach me to speak your tongue? Does he hate Outlanders so much? Why does he know the - my - language at all?\"\n Mathin was silent as he considered what he could tell his new friend without betraying his old. \"Do not judge Forloy - or yourself - too harshly. When he was your age, and before he was a Rider, Forloy fell in love with a woman he met at the spring Fair in Ihistan. She had been born and raised in the south, and gone into service to an Outlander family there; and when they were sent to Ihistan, she went with them. The second year, the next Fair, he returned, and she agreed to go to the Hills with him. She loved Forloy, I think; she tried to love his land for his sake, but she could not. She taught him Outlander speech, that she might remember her life there by saying the words. She would not leave him, for she had pledged herself to live in the Hills with him; but she died after only a few years. Forloy remembers her language for her sake, but it does not make him love it.\" He paused, watching her fingers; they relaxed, and the purple stems dropped to the earth. \"I do not believe he had spoken any words of it for many years; and Corlath would not have asked it of him for any less cause.\"\n Corlath, Harry thought. He knows the story - of the young foreign woman who did not thrive when she was transplanted to Hill soil. And she was Darian born and bred, and went willingly. \"And Corlath? Why does Corlath speak Outlander?\"\n Mathin said thoughtfully, \"Corlath believes in knowing his ... rivals. Or enemies. He can speak the Northern tongue as well, and read and write it, and Outlander, as well as our Hill tongue. There are few enough of us who can read and write our own language. I am not one of them. I would not wish to be a king.\"\n There were only a few days left to run till the laprun trials. Mathin, between their more active lessons, taught her more of the Hill-speech; and each word he taught her seemed to awaken five more from where they slept in the back of a mind that was now, she had decided, sharing brain space and nerve endings with her own. She accepted it; it was useful; it permitted her to live in this land that she loved, even if she loved without reason; and she began to think it would enable her in her turn to be useful to this land. And it had won her a friend. She could not take pride in it, for it was not hers; but she was grateful to it, and hoped, if it were kelar or Aerin-sol\u0027s touch, that she might be permitted to keep it till she had won her right to stay.\n With the language lessons Mathin told her of the Hills they were in, and where the City lay from where their little valley sat; and he told her which wood burned best green, and how to find water when there seemed to be none; and how to get the last miles out of a foundered horse. And her lessons of war had strengthened her memory, or her ability to draw upon that other memory, for she remembered what he told her. And to her surprise, he also told her the names of all the wildflowers she saw, and which herbs could be made into teas and jams; and these things he spoke of with the mild expression on his face that she had seen only when he was bending over his cooking-fire; and even these things she learned. He also told her what leaves were best for stopping blood flowing, and three ways of starting a fire in the wilderness.\n He looked at her sidelong as he spoke about fire-making. \"There\u0027s a fourth way, Hari,\" he said. \"Corlath may teach it to you someday.\" There was some joke here that amused him. \"Myself, I cannot.\"\n Harry looked at him, as patiently as she could. She knew that to question him when he baited her like this would do her no good. Once, a day or two after Mathin\u0027s unexpected fall, she had let a bit more of her frustration show than she meant to, and Mathin had said, \"Hari, my friend, there are many things I cannot tell you. Some I will tell you in time; some, others will tell you; some you may never know, or you may be the first to find their answers.\"\n She had looked across their small fire at him, and over Narknon\u0027s head. They were both sitting cross-legged while the horses grazed comfortably not far away, so that the sound of their jaws could be heard despite the crackling fire. Mathin was rewiring a loose ring on his chain-encrusted vest.\n \"Very well. I understand a little, perhaps.\"\n Mathin gave a snort of laughter; she remembered how grim and silent she\u0027d thought him, he in particular of all the king\u0027s Riders. \"You understand a great deal, Harimad-sol. I do not envy the others when they see you again. Only Corlath truly expects what I will be bringing out of these Hills.\"\n This conversation had made it a little easier for her when he slyly told her of things, like the fourth way of lighting fires, which he refused to explain. She didn\u0027t understand the reasons, but she was a bit more willing to accept that a reason existed. It surprised her how much he told her about himself, for she knew that he did not find it easy to talk of these things to her; but she understood too that it was his way of making up, a little, for what he felt he could not tell her. It also, as he must have intended, made her feel as if the Hillfolk were familiar to her; that her own past was not so very different from theirs; and she began to imagine what it would have been like to have grown up in these Hills, to have always called them home.\n One of the things Mathin would tell her little of was Aerin Dragon-Killer and the Blue Sword. He would refer to Damar\u0027s Golden Age, when Aerin was queen, but he would not tell her when it was, or even what made it golden. She did learn that Aerin had had a husband named Tor who had fought the Northerners, for the Northerners had been Damar\u0027s enemies since the beginning of time and the Hills, and every Damarian age had its tale of the conflict between them; and that King Tor was called the Just.\n \"It sounds very dreary, being Just, when your wife kills dragons,\" said Harry, and while Mathin permitted himself a smile, he was not to be drawn.\n She did pry something else out of him. \"Mathin,\" she said. \"The Outlanders believe that the - the - kelar of the Hills can cause, oh, firearms not to fire, and cavalry charges to fall down instead of charging, and - things like that.\"\n Mathin said nothing; he had marinated cut-up bits of Narknon\u0027s latest antelope in a sharp spicy sauce and was now frizzling them on two sticks over the low-burning fire. Harry sighed.\n Mathin looked up from his sticks, though his fingers continued to twist them slowly. \"It is wise of the Outlanders to believe the truth,\" he said. He dug one stick, butt-end, into the ground, and thrust his short knife into the first chunk of meat. He nibbled at it delicately, with the concentrated frown of the artist judging his own work. His face relaxed and he handed Harry the stick still in his other hand. But he spoke no more of kelar.\n Mathin took no more falls, and by the middle of the sixth week Harry felt she had forgotten her first lessons because they were so far in the past. She could not remember a time when the palm of her right hand did not bear stripes of callus from the sword hilt; when the heavy vest felt awkward and unfamiliar; nor a time when she had not ridden Tsornin every day.\n She did remember that she had been born in a far green country nothing like the kelar-haunted one she now found herself in; and that she had a brother named Richard whom she still called Dickie, to his profound dismay - or would, if he could hear her - and she remembered a Colonel Jack Dedham, who loved the Hills even as she did. A thought swam into her mind: perhaps we shall meet again, and serve Damar together.\n On the fourth day of the sixth week she said tentatively to Mathin: \"I thought the City was over a day\u0027s journey from here.\"\n \"You thought rightly,\" Mathin replied; \"but there is no need of your presence on the first day of the trials.\"\n She glanced at him, a little reassured, but rather more worried.\n \"Do not fear, my friend and keeper of my honor,\" said Mathin. \"You will be as a bolt from the heavens, and Tsornin\u0027s flanks shall blind your enemies.\"\n She laughed. \"I look forward to it.\"\n \"You should look forward to it,\" he said. \"But I, who know what I will see, look forward to it even more.\" \n","sourceLink":"https://allnovel.net/the-blue-sword-damar-2/page-7.html","bookId":2083,"book":{"id":2083,"title":"The Blue Sword (Damar #2)","description":"Storyline: \n The Blue Sword (Damar #2) \n The Blue Sword is a fantasy novel written by Robin McKinley and published by the Berkley Publishing Group in 1982. The novel The Hero and the Crown serves as a prequel. The Blue Sword has received numerous awards, including: Newbery Honor Award, ALA Best Book for Young Adults and the ALA Notable Children\u0027s Book. The story, told in the third-person omniscient perspective, is of a young woman named Angharad Crewe, called Harry, who becomes a warrior in her adopted homeland of Damar.\n \n","cover":"https://allnovel.net/images/the-blue-sword-damar-2.jpg","author":"Robin McKinley","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-blue-sword-damar-2.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:32:29 PM"}}
