{"id":24300,"no":103,"title":"THE GREAT GHOSTS *","content":"* March, 1889. Long before there were any kings there were chiefs, Even in the early Feudal days the king was only the chief of the barons, and many centuries elapsed before the supremacy of the monarch was unquestioned and he became really the sovereign. It was a process of natural selection. A mob of chiefs could not rule a mob of people. There was a fierce struggle, with plenty of fighting and intrigue, and the fittest survived. Gradually, as the nation became unified, the government was centralised, and out of the chaos of competing nobles emerged the relatively cosmic authority of the Crown. Similarly in the world of religion. All gods were originally ghosts. But as polytheism declined a supreme god emerged from the crowd of deities, as the king emerged from the crowd of nobles, and ruled from a definite centre. It was Zeus in Greece, Jupiter in Rome, Brahma in India, Thor in Scandinavia, and Yahveh in Israel. \"I, the Lord thy God, am a jealous God,\" was an exclamation that sprang from Yahveh\u0027s lips (through his priests) when his godship was still in the thick of the competitive struggle. The ghosts become gods, and the gods become supreme deities, looked after the interests of their worshippers; gave them long life, good harvests, and prosperity in warfare, if they were true to them, and plagued them like the very devil if they slighted them or nodded to their rivals. According to the Old Testament, when everything went well with the Jews their God was pleased, and when things went wrong with them he was angry. This state of mind survives into our advanced civilisation, where people still talk of \"judgments,\" still pray for good things, and still implore their God for victory when they have a scrimmage with their neighbors. But this infantile conception is dying out of educated minds. Prayer is seen to be futile. The laws of nature do not vary. Providence is on the side of the big battalions. God helps those who help themselves—and no one else. Long ago, in ancient Greece and Rome, the acutest thinkers had come to the same conclusion. Lucretius, for instance, did not deny the existence of the gods; he merely asserted that they no longer concerned themselves with human affairs, which he was heartily glad of, as they were mostly bad characters. He observed \"the reign of law\" as clearly as our modern scientists, and relegated the deities to their Olympian repose, so beautifully versed by Tennyson. The Gods, who haunt The lucid interspace of world and world, Where never creeps a cloud, or moves a wind, Nor ever falls the least white star of snow, Nor ever lowest roll of thunder moans, Nor sound of human sorrow mounts to mar Their savored everlasting calm. Even the savage, in times of prolonged peace and prosperity, begins to speculate on the possibility of his god\u0027s having retired from business; for religion is born of fear, not of love, and the savage is reminded of his god by calamity rather than good fortune. This idea has been caught by Robert Browning in his marvellous Caliban upon Setebos, a poem developed out of a casual germ in Shakespeare\u0027s Tempest. Hoping the while, since evils sometimes mend, Warts rub away and sores are cured with slime, That some strange day, will either the Quiet catch And conquer Setebos, or likelier He Decrepit may doze, doze, as good as die. But presently poor Caliban is frightened out of his speculation by a thunderstorm, which makes him lie low and slaver his god, offering any mortification as the price of his escape. There is a good deal of Caliban in our modern multitudes, but the educated are working free from his theology. Science and miracle cannot live together, and miracle and providence are the same thing. How far from us is the good old God of the best parts of the Bible, who held out one ear for the prayers of his good children, and one hand, well rodded, for the backs of the naughty ones. The seed of the righteous never begged for bread, and the villain always came to a bad end. It was the childish philosophy of the \"gods\" in a modern theatre. The more critical want something truer and more natural, something more accordant with the stern realities of life. Renan has some excellent remarks on this in the Preface to his second volume of the Histoire du Peuple d\u0027 Israel. \"The work of the genius of Israel was not really affected until the eighteenth century after Jesus Christ, when it became very doubtful to spirits a little cultivated that the affairs of this world are regulated by a God of justice. The exaggerated idea of a special Providence, the basis of Judaism and Islam, and which Christianity has only corrected through the fund of liberalism inherent in our races, has been definitively vanquished by modern philosophy, the fruit not of abstract speculation, but of constant experience. It has never been observed, in effect, that a superior being occupies himself, for a moral or an immoral purpose, with the affairs of nature or the affairs of humanity.\" Kenan has elsewhere said that the negation of the supernatural is a dogma with every cultivated intelligence. God, in short, has faded into a metaphysical abstraction. The little ghosts vanished long ago, and now the Great Ghost is melting into thin air. Thousands of people have lost all belief in his existence. They use his name, and take it in vain; for when questioned, they merely stand up for \"a sort of a something.\" The fear of God, so to speak, has survived his personality; just as Madame de Stael said she did not believe in ghosts, but she was afraid of them. Mrs. Browning gives voice to this sentiment in one of her poems: And hearts say, God be pitiful, That ne\u0027er said, God be blest. The fear of the Lord is, indeed, the beginning and the end of theology. When the Great Ghost was a reality—we mean to his worshippers—he was constantly spoken of. His name was invoked in the courts of law, it figured in nearly every oath outside them, and it was to be seen on nearly every page of every book that was published. But all that is changed. To speak or print the name of God is reckoned \"bad form.\" The word is almost tabooed in decent society. You hear it in the streets, however, when the irascible carman calls on God to damn your eyes for getting in his way. There is such a conspiracy of silence about the Great Ghost, except in churches and chapels, that the mention of his name in polite circles sounds like swearing. Eyebrows are lifted, and the speaker is looked upon as vulgar, and perhaps dangerous. Thus theology gives way to the pressure of science, and religion to the pressure of civilisation. The more use we make of this life the less we look for another; the loftier man grows the less he bows to ghosts and gods. Heaven and hell both disappear, and things are neither so bad nor good as was expected. Man finds himself in a universe of necessity. He hears no response to his prayers but the echo of his own voice. He therefore bids the gods adieu, and sets himself to the task of making the best of life for himself and his fellows. Without false hopes, or bare fears, he steers his course over the ocean of life, and says with the poet, \"I am the captain of my soul.\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87980.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
