{"id":24211,"no":14,"title":"THANK GOD.","content":"The peculiarly selfish character of religion is often exemplified, but we do not remember a better illustration than the one which recently occurred at Folkestone. The twenty-seven seamen who were rescued from the Benvenue attended a thanksgiving service at the parish church, where the vicar delivered \"a short address suitable to the occasion.\" Their captain and four of his crew were drowned, and the lucky survivors thanked the Lord for saving them, though he let the others perish in the yeasty waves. We should like to see a copy of that vicar\u0027s suitable discourse. We suspect it would be an interesting study to a cynic. No doubt the man of God\u0027s chief motive was professional. The saving of those shipwrecked men was a splendid piece of work, but it required to be rounded off. It was not complete unless the parson blessed it and approved it with a text. He came in at the finish when the danger was all over, and gave the perfecting touch in the shape of a cheap benediction. Probably the man of God put in a good word for Providence. The poor sailors had been snatched from the jaws of death; their minds were therefore in a state of agitation, and at the very best they are not a logical or reflective race of men. Very likely, therefore, they assented to the theory that they owed their deliverance to the blessing of God, but a little quiet thought about the matter would possibly make them see it in a different light. The persons who visibly did save them from drowning were gallant lifeboat-men, who put their own lives in deadly peril, fighting the storm inch by inch in the hope of rescuing a number of unknown fellow creatures. All honor to them! We would sooner doff the hat to them than to any prince in Christendom. Some of them, perhaps, take a drop too much occasionally, and their language may often be more vigorous than polite. But all that is superficial. The real test of a man is what he will do when he is put to it. When those rough fellows saw a brave task before them, all the skin-deep blackguardism dropped away; the heroic came out in supreme majesty, and they were consecrated by it more truly than any smug priest at his profitable altar. As they jumped into the boat they proved the nobility of human nature, and the damnable falsehood of the Christian doctrine of original sin. What share Providence had in the matter is not very apparent. Strong arms and stout hearts were in the lifeboat, and that accounts for her reaching the wreck. Had the rowers the choice of a stimulus, we dare say they would have taken a swig of brandy in preference to any quantity of the Holy Spirit. What Providence might have done if he, she, or it was in the humor, was to keep the shipwrecked sailors safe until the lifeboat arrived. But this was not done, Those who were lashed to the rigging were saved, while the captain and four others, less fortunately situated, were lost. Where the material means were efficacious there was salvation, and where they failed there was disaster and death. So much for the logical side of the matter. Now let us look at the moral side. Religion pretends to minister to the unselfish part of our nature. That is the theory, but how does it work out in practice? Thanking God for saving the survivors of a shipwreck implies that he could have saved those who perished. It also implies that he did not choose to do so. It further implies that the saved are more worthy, or more important, than the lost; at least, it implies that they are greater favorites in the \"eye of heaven.\" Now this is a frightful piece of egotism, which everyone with a spark of manhood would be disgusted at if he saw it in its true colors. Nor is this all. It is not even the worst. There is a viler aspect of this \"thanksgiving\" business. One man is saved in a disaster and another is killed. When the first realises his good luck he congratulates himself, This is natural and pardonable, but only for a moment. The least disinterestedness, the least sympathy, the least imagination, would make him think of his dead companion. \"Did he suffer much, poor fellow? What will his wife do? How will his little ones get on without a father? After all, mightn\u0027t it have been better if he had been spared instead of me? Who knows?\" If these reflections did not occur under the stimulated instinct of self-preservation it would be bad enough. How much worse when the survivor keeps up the selfish attitude in cold blood, and deliberately goes about thanking God for his preservation! Ordinary reason and humanity would cry shame on such egotism, but religion steps in and sanctifies it. Some of these days an honest man will be provoked into a bit of good strong \"blasphemy.\" When he hears a fellow thanking Providence for his safety, while others perished, this honest man will shrug his shoulders. And when the fellow cries \"Bless God!\" this honest man will exclaim \"Damn God!\" No doubt the priests would burn that honest man alive if they had the power. But his logic and his feelings will be better than theirs. He will abhor selfishness even in the disguise of piety, and he will argue that if God is to be credited with the lives of those who are saved, he should also be debited with the lives of those who are lost. And how would the account stand then? \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87891.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
