{"id":24218,"no":21,"title":"DEAD THEOLOGY.","content":"This is an age of \"series.\" Every publisher issues one, and the number of them is legion. As far as possible they are written by \"eminent hands,\" as old Jacob Tonson used to call his wretched scribblers in Grub-street garrets. But not every publisher can secure such an eminent hand as a live Archbishop, This has been achieved, however, by Messrs. Sampson, Low, Marston, and Company. Having projected a series of \"Preachers of the Age,\" they were fortunate enough to enlist the Archbishop of Canterbury under their banner. His Grace, as it is etiquette to call him, though his natural name is Edward White Benson, leads off the publishers\u0027 attack on the British public with a volume of sermons entitled Living Theology. It is well printed on good paper, the binding is appropriate, and the price of three-and-sixpence puts it within the reach of the great middle-class public which cares for such things. We are far from sharing the opinion of a carper who remarked that, as sermons go, this volume is rather dear. Thirteen sermons by an Archbishop! Could any man in his senses expect them for less money? The real wonder is that a man with ￡15,000 a-year should condescend to publish at all. We ought to feel thankful that he does not charge us a guinea a volume. Prefixed to the thirteen sermons, at fourpence apiece, including the binding, is an excellent photogravure portrait of the Archbishop. The face is keen and scholarly, and not unpleasant. A noticeable nose, a large fluent mouth, shrewd eyes, and a high well-shaped head, make on the whole an agreeable picture. Something about the features shows the preacher, and something more the ecclesiastic. It is the type, and the best type, of the learned priest. Nobody could look at this portrait and call Edward White Benson a fool. But is any one in danger of doing so? Would not every one admit some ability in the unhereditary recipient of fifteen thousand a year? Parsons are not a brilliant body, but to wriggle, or climb, or rise to the top of the Black Army involves the possession of uncommon faculties. The Archbishop is seldom eloquent, in the popular sense of the word; but his style has a certain force and color, always within the limits of exquisite breeding. If he consigned you to Gehenna, he would do it with bland graciousness; and if he swore at all, he would swear in Latin. His language in these sermons, as in another volume we noticed a year ago, is pure and nervous, with an etymological reason for every word. Sometimes he is quite felicitous. Now and then he uses metaphor with skill and illumination. The habitual concreteness of his style shows the clearness of his perceptions. Occasionally he is epigrammatic \"Strong enemies,\" he says in one place, \"are better to us than weak friends. They show us our weak points.\" Finer and higher is another passage in the same sermon—\"The yearning of multitudes is not in vain. After yearning comes impulse, volition, movement.\" It would be difficult, if not impossible, to better this, unless a great poet cast it in the mould of a metaphor. We confess that, on the whole, we have read the Archbishop\u0027s sermons with some pleasure, as well as with much attention. It is to his credit that he defies a superficial reading. We do not expect to find another volume in the series at all comparable with his. Dr. Maclaren, who comes second, is on a lower level, and the next descent to Mr. Price Hughes is a fall into a slough of incapable and reckless sentimentalism. Living Theology is the title of the Archbishop\u0027s volume, but this is a misnomer, for the title belongs only to the first sermon. It misled us in this general application, as it will probably mislead others. We took it to be a setting forth of so much theology as the Archbishop thought living, in contradistinction to what he allowed to be dead. But we find a very miscellaneous lot of sermons, sometimes rather on Church work than on Church teaching. The title, therefore, is what Walt Whitman would call \"a suck and a sell.\" Yet it is hardly worth while to labor the complaint, for titles are often better than the pages that follow them. Sometimes, indeed, a writer puts all his head into the title, and the rest of the book displays his imbecility. But this cannot be said of the Archbishop. Another difficulty is this. The Archbishop\u0027s sermons are hard for a Freethinker to criticise. He seldom expounds and rarely argues. He addresses an audience who take the fundamentals of Christianity for granted. Yet he lays himself open here and there, and where he does so we propose to meet him. In the first sermon Dr. Benson is surely going beyond his actual belief in referring to \"the earliest race of man, with whom the whole race so nearly passed away.\" He can scarcely take the early chapters of Genesis literally at this time of day. In the very next sermon he speaks cheerfully of the age of Evolution. That sermon was preached at St. Mary\u0027s, Southampton, to the British Association in 1882. It is on \"The Spirit of Inquiry.\" \"The Spirit of Inquiry,\" he says, \"is God\u0027s spirit working in capable men, to enlarge the measure and the fulness of man\u0027s capacity.\" But if capable men are necessary, to say nothing of favorable conditions, the working of God\u0027s spirit seems lost in the natural explanation. Still, it is pleasant to find the Archbishop welcoming the Spirit of Inquiry, under any interpretation of its essence; and it may be hoped that he will vote accordingly when the Liberty of Bequest Bill reaches the Upper Chamber. It is also pleasant to read his admission that the Spirit of Inquiry (we keep his capitals) \"has made short work not only of the baser religions, but of the baser forms of ours\"—to wit, the Christian. Some of those \"baser forms\" are indicated in the following passage: \"I know not whether any stern or any sensuous religion of heathendom has held up before men\u0027s astonished eyes features more appalling or more repulsive than those of the vindictive father, or of the arbitrary distributor of two eternities, or again of the easy compromiser of offences in return for houses and lands. Dreadful shadows under which, thousands have been reared.\" Dreadful shadows indeed! And not thousands, but countless millions, have been reared under them. Those dreadful shadows were for centuries the universal objects of Christian worship. They still hover over Spurgeon\u0027s tabernacle and a host of other houses of God. But they are hateful to Dr. Benson. To him the God of orthodoxy, the God of the Thirty-nine Articles, is dead. He dismisses Predestination, a vindictive God, and Everlasting Torment. He speaks of the very \"prison\" where Christ is said to have preached after his death, as a place \"where spirits surely unlearn many a bias, many a self-wrought blindness, many a heedless error.\" Hell is therefore a place of purgation, which is certainly an infinite improvement on the orthodox idea of eternal and irremediable woe, however it fall(s) below the conception that the Creator has no right to punish his own failures. Let the reader note who makes these admissions of the intellectual and moral death of the \"baser forms\" of Christianity. It is not an irresponsible franc-tireur of the Black Army, nor an expelled soldier like Mr. Voysey, nor a resigned soldier like Dr. Momerie. It is the Archbishop of Canterbury, the highest dignitary of the Church of England. His Grace does not reflect—he cannot afford to reflect—that as the dead theology of to-day was the living theology of the past, so the living theology of to-day may be the dead theology of to-morrow. The Archbishop still dogmatises, even in this sermon on the Spirit of Inquiry. In opposition to the man of science who knows of no limits to nature, he declares that \"There is a sum of created things, and therefore a real end (however far off) to what can be known of them.\" In a certain sense, truly, there is an end to what can be known of nature, for human knowledge must ever be relative and not absolute. But the Archbishop\u0027s limit is not qualitative in man; it is quantitative in the universe. Herein he goes beyond the bounds of knowledge, and indulges in the very dogmatism for which he reprehends the materialist. It is dogmatism also to assert that \"the soul has every reason to believe itself absolutely eternal.\" Absolutely is a word of vast significance. How can it apply to \"the soul\"? Were \"the soul\" to subsist eternally in the future, it could not be absolutely eternal if it once began to be. \"Every reason\" is also too comprehensive. Dr. Benson may think he has good reasons for \"the soul\u0027s\" immortality, but he must be aware that divines of his own church have held the contrary doctrine. Before the Spirit of Inquiry, says Dr. Benson, every other religion than Christianity fades away; though he has admitted that some parts of Christianity, the \"baser forms,\" have shared the same fate. Every fresh conquest of the Spirit of Inquiry has \"brought out some trait in the character, or some divine conception in the mind of Jesus of Nazareth.\" This sweeping statement is supported by \"three very clearly marked\" instances. The first is that science shows us the unity of life. \"The latest discovered laws involve at least this, that the Life of man is one Life.\" And this is \"no more than the scientific verification of what was long ago stated, and by Christians (at least for a while) acted on.\" In support of the Christian idea of the Unity of Life the Archbishop cites St. Paul, who once asked in a callous way if God cared for oxen. Had the Archbishop appealed to Jesus he would have found the oracle dumb, or something worse; for the Nazarene distinctly told his apostles to preach only to the Jews, and leave the Samaritans and Gentiles in darkness. St. Paul took a flight beyond this narrow patriotism. It was he, and not the personal disciples of Jesus, who broke down the barriers between Jew and Gentile. It was he who scorned the idea that Jesus, to use his own language, was only sent to the lost sheep of the house ot Israel. It was he, and not Peter, or James, or John, who said that God had made all nations of one blood; he who declared \"ye are all one in Christ.\" Yet it is easy to make too much of this; for St. Paul did not include the heathen and unbelievers within the fold of brotherhood; and when he asserted the fatherhood of God, he appealed to the previous utterance of a Greek poet, thus conceding his own want of originality. One might imagine, too, that the old Jewish story of Creation—which in turn was not original—involved the common descent of the human race; and as this idea was almost, if not quite, universal, being based on the obvious generic resemblance of the various races of mankind, it seems a stretch of fancy to put it forward as \"a Christian statement\" in some way connected with \"Jesus of Nazareth.\" The Archbishop\u0027s second instance of the concurrence of modern progress with the teaching of Jesus, is, to say the least of it, peculiar. \"From the liberty to inquire,\" he says, \"comes the liberty to express the results of inquiry. And this is the preamble of the Charter of Jesus Christ.\" We defy Dr. Benson to find a single plain passage about freedom of thought in the teachings of Jesus. The Nazarene was fond of saying, \"He that hath ears to hear let him hear.\" But it was reserved for Ingersoll to say, \"He that hath a brain to think let him think.\" The Archbishop goes on to claim Darwin as \"our aged Master\"—Darwin, who rejected Christianity for forty years of his life! He quotes from Beale the sentence, \"Intellectual work of every kind must be free.\" \"And the New Testament,\" he adds, \"is still the one volume of books on religion which accepts thia whole statement.\" This is a bold—some would say a brazen—assertion. If the New Testament teaches anything clearly, it teaches that belief is necessary to salvation. That doctrine stifles free speech and extinguishes inquiry. Why investigate if you may be damned for your conclusions? And why allow investigation if another man\u0027s errors may involve your perdition? These questions have been answered logically enough by the Christian Church, and the \"Charter of Jesus Christ\" has been the worst of spiritual oppressions. No religion has been so intolerant as the Christian. Mohammedanism has been far less bigoted. Buddhism has the proud distinction of never having persecuted one human being in twenty-four centuries. The Archbishop\u0027s third instance is fantastic to the point of grotesqueness. Both Christianity and the spirit of Inquiry, he says, are at one in \"the demand for fruit.\" Does he mean to imply that other religions set their faces against \"fruit\"? Buddhism is quite imperative about moral duties. Mohammedanism gets itself obeyed in matters of conduct, while Christianity is quite ineffectual. Drink, gambling, and prostitution abound in Christian countries; in the Mohammedan world they have been sternly repressed. This is admitted by Dr. Benson in his volume on Christ and his Times; admitted, and even emphasised; so that he may, as it were, be confuted out of his own mouth. If we take a leap to the penultimate sermon in the present volume, we find Archbishop Benson indulging in the same kind of loose statement and inconsequential reasoning. Its title is \"Christ\u0027s Crucifixion, an All in All.\" The preacher scorns the Greek notion of the Crucifixion as \"the shocking martyrdom of a grand young moralist.\" Such a notion, he says, is \"quite inconsistent with the facts.\" Either we know not what Christ taught, or else he was more than man. And the Archbishop sets about proving this by means of a series of leaps over logical chasms. After dilating on the innocence of Christ, who was certainly guilty according to the Mosaic law, and deserving of death according to the express command of Jehovah, the Archbishop writes as follows: \"Then we look back through our eighteen centuries, and we see that before the age of three-and-thirty he had fashioned sayings, had compacted thoughts, had expressed principles about duty, about the relative worth of things, about life, about love, about intercourse with God, about the formation of character, the relation of classes, the spirit of law, the essence of government, the unity of man, which had not existed, or which were not formulated when he opened his lips, but which have been and are the basis of society from the time they were known till now.\" This is a tissue of false assumptions. The sayings, thoughts, and principles of Jesus did exist before, and they were formulated when he opened his lips. Not one original utterance is ascribed to him in the whole of the Gospels. It is idle to bandy generalisations; let the Archbishop select specimens of Christ\u0027s teaching, and we will find parallels to them, sometimes better and more wisely expressed, in the utterances of his predecessors. Nor is it true that Christ\u0027s teachings have been, or are, the basis of society. Society exists in defiance of them. It is never based, and it never will be based, on any abstract teaching. Its basis is self-interest, ever increasing in complexity, and ever more and more illuminated by the growth of knowledge. Take the case of oaths. Jesus said plainly, \"Swear not at all.\" But when earthly potentates wanted their subjects to swear fidelity, the Christian priests discovered that Jesus meant, \"Swear only on special occasions.\" And it was reserved for an Atheist, in the nineteenth century, to pass an Act allowing Christians to obey Jesus Christ. Take the injunction, \"Lay not up for yourselves treasures on earth.\" Society could never exist upon such a basis, so the clergy find that Jesus, like Polonius, spoke tropically. Every Christian is busy laying up treasures on earth, and Archbishop Benson is well to the front in the competition. Having made ridiculous claims for Jesus Christ, the Archbishop proceeds in this wise: \"Next ask yourself whether a stainless, loving, sincere, penetrating person like that makes or enlarges on unfounded declarations as to matters of fact. Is it consistent with such a character?\" Now Jesus speaks of \"the immense importance of his own person,\" he speaks of \"My flesh, My blood\" as of vital power, he says \"I and my Father are one.\" Could he have been deceived? Well, why not? Honesty does not guarantee us against error. The best of men have been mistaken, And sincere natures are most liable to be deceived by taking subjective impressions for external realities. There is another explanation which the Archbishop is too shrewd to pass over in silence. Perhaps others said those things for Jesus, perhaps they \"attributed to him sayings which he did not utter.\" But this, the Archbishop says, only multiplies the difficulty and the astonishment; for, to put it briefly, his biographers in that case were as good at predicting and inventing as himself. And why not? Do we not know that the story of the woman taken in adultery, which is finely told, and has all along been thought to contain some of Christ\u0027s most characteristic teaching, does not exist in the earlier manuscripts? It was invented by an unknown writer. And if one unknown writer could (and did) invent this story, other unknown writers may have invented every part of the Gospel narratives. The attempt to make Jesus sponsor for himself is the last refuge of hard-driven Christians. The frame of mind it evinces is seen in Dr. Benson\u0027s interpretation of the exclamation \"I thirst,\" ascribed to Jesus on the cross. Crucifixion produced an intolerable thirst, and the exclamation is very natural; but Dr. Benson says that Jesus meant \"I thirst for souls,\" and and adds that \"no man can doubt\" it. Such are the shifts to which Christians are reduced when they cling to faith in defiance of reason. Dr. Benson\u0027s \"living theology\" is dead theology. It is sentimentalism and make-believe. Perfectly scriptural doctrines are cast aside while others are arbitrary retained. Vague talk about \"Christ and him crucified\" takes the place of time-honored dogmas, logically deduced from the \"Word of God,\" and stamped with the deliberate approval of councils and synods. Christianity, in short, is becoming a matter of personal taste and preference. The time is approaching when every Christian will have a Christianity of his own. This is the moral of the Archbishop\u0027s volume. Had space permitted we should have liked to notice other features of his sermons. In one place he says that \"the so-called Secularist is the man who deprives things secular of all power and meaning and beauty.\" We think that he deprives Christianity of all meaning, and that being gone its \"power\" and \"beauty\" are idle themes of wasted eloquence.","sourceLink":"http://novel.tingroom.com/duanpian/3224/87898.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
