{"id":24232,"no":35,"title":"NO FAITH WITH HERETICS.","content":"During the Crusades, when the Christians were wantonly fighting against their superiors in civilisation and humanity, the doctrine, was promulgated and obeyed that no faith should be kept with infidels, and this was subsequently put in force against heretics. Thousands of Mohammedan prisoners were butchered in cold blood, although their safety had been confirmed by an oath; and this infamous practice was afterwards pursued with respect to the \"heretical\" sects when the Papal troops desolated some of the fairest parts of Europe. Not only was there no salvation outside the Church, but even the ordinary laws of human society were held to be abrogated. This wickedness, perhaps, reached its culmination in the Spanish conquest of America. Few Christians were civilised enough to condemn these purjured banditti, but Montaigne in France, and Raleigh in England, were glorious exceptions, and both of them were under a just suspicion of heterodoxy. Protestants as well as Catholics were infected with this infamous bigotry. Luther himself was not free from taint, and Calvin\u0027s treachery against Servetus is an eternal blot on his character. \"No faith with heretics\" took a new form when the downright violation of an oath became too dissonant to the spirit of an improved civilisation. It found expression in robbing the heretic of political and social rights, and above all in treating him as outside the pale of honor. Slandering him was no libel. Every bigot claimed the right to say anything against his character, for the purpose of bringing his opinions into hatred and contempt. All the dictates of charity were cast aside; his good actions were misrepresented, and his failings maliciously exaggerated. If Voltaire spent thousands in charity, he did it for notoriety; if he wrote odes to beautiful or accomplished ladies, he was a wretched debauchee. If Thomas Paine made sacrifices for liberty, he did it because he had a private grudge against authority; if he befriended the wife and family of a distressed Republican, he only sought to gratify his lust; if he spent a convivial hour with a friend, he was an inveterate drunkard; and if he contracted a malignant abscess by lying for months in a damp, unwholesome dungeon, his sufferings were the nemesis of a wicked, profligate life. An English precursor of Voltaire and Paine wrote A Discourse on Freethinking. His name was Anthony Collins, and in a certain sense he was the father of English Freethought. He was a man of exemplary life and manners, yet the saintly Bishop Berkeley said he \"deserved to be denied the common benefit of air and water.\" One of Collins\u0027s antagonists was the famous Dr. Bentley; and although Collins was a man of fortune, the ridiculous calumny was started that he sought and obtained Bentley\u0027s assistance in adversity. The author of this calumny was Richard Cumberland, a grandson of Bentley, and in other respects an estimable man. His mistake was pointed out by Isaac D\u0027Israeli, who told him the person he meant was Arthur Collins, the historical compiler. But Cumberland perpetuated the calumny, remarking that \"it should stand, because it could do no harm to any but to Anthony Collins, whom he considered little short of an Atheist.\" Another story about Collins, which has frequently done duty in Christian publications, is that a visitor found him reading the New Testament, and that he remarked, \"I have but one book, but that is the best.\" Fortunately I am able to give the origin of this story. It is told of William Collins, the poet, by Dr. Johnson, and may be found in the second volume (p. 239) of that writer\u0027s \"Miscellaneous and Fugitive Pieces,\" published by Davies in Johnson\u0027s lifetime. It was not Anthony Collins, therefore; but what does that matter? It was a gentleman named Collins; his other name is indifferent. Besides, the story is so much more affecting when told of Anthony. Look at the lying stories of infidel death-beds; glance at the scurrilities of an outcast minister which are gratuitously circulated by the enemies of Colonel Ingersoll; observe on how many platforms Mr. Brad-laugh has pulled out his watch and given the Almighty five minutes to strike him dead; listen to the grotesque libels on every leading Freethinker which are solemnly circulated by Christian malice; and you will behold the last fruit of a very old tree, which is slowly but surely perishing. It once bore scaffolds, stakes, prisons and torture rooms; it now bears but libels and insinuations. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87912.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
