{"id":24250,"no":53,"title":"MOTHER\u0027S RELIGION.","content":"Religion is the feminine element in human nature. Science is the masculine. One accepts, the other inquires; one believes, the other proves; one loves the old, the other the new; one submits, the other dares; one is conservative, and the other progressive. I say this with no disrespect to women. Evolution has made them what they are, and evolution will remake them. Nor do I slight the noble band of advanced women, the vanguard of their sex, who have shed a lustre on our century. I merely take a convenient metaphor, which crystallises a profound truth, though fully conscious of its shortcomings and exclusions. Woman is still the citadel of religion. Thither the priest flies from the attacks of scepticism. There he finds an inviolable refuge. The mother, the wife, the sister, shield him and his creed; and their white arms and soft eyes are a better guard than all the weapons in the armory of his faith. His are the coward\u0027s tactics, but all creatures—even priests—plead the necessity of living, and have the artful instinct of self-preservation. Religious by inheritance and training, woman rears her children for the Church. Spiritual as well as bodily perils shake her prophetic soul as she peers into the future through the eyes of the child upon her knee. She whispers of God with accents of awe, that fall solemnly on the little one\u0027s mind. She trains the knee to bend, the hands to meet in prayer, and the eyes to look upward. She wields the mighty spell of love, and peoples the air of life with phantoms. Infantile logic knows those dear lips cannot lie, and all is truth for all is love. Alas! the lesson has to come that the logic is faulty, that goodness may be leagued with lies, that a twisted brain may top the sweetest heart. But long ere the lesson is learnt—if it is learnt—the mischief has been wrought. The child has been moulded for the priest, and is duly burnished with catechisms and stamped with dogmas. And how often, when the strong mind grows and bursts its bonds, when the mental eyes wax strong and see the falsehood, the mother\u0027s hand, through the child\u0027s training, plucks the life back from the fulfilment of its promise. How often, also, when the vigorous manhood has swept aside all illusions, there comes at length the hour of lassitude, and as the mother\u0027s voice steals through the caverns of memory the spectres of faith are startled from their repose. Priests are always warning men against deserting the creed of their mothers. And even a savant, like Professor Gazzia, who writes on Giordano Bruno, knows the trick of touching this facile cord of the human heart. Speaking of Bruno\u0027s philosophy, he says: \"I call it plainly the Negation of God, of that God, I mean, of whom I first heard at my mother\u0027s knee.\" But Freethinking mothers—and happily there are such—will use their power more wisely; and, above all, will not shrink from their duty. They have the fashioning of the young life—a transcendent privilege, with an awful responsibility. They will see that love nurtures the affections without suborning the intellect; that the young mind is encouraged to think, instead of being stuffed with conclusions; and they will some day find their exceeding rich reward. Their children, trained in the school of self-respect and toleration, will be wiser than the pupils of faith; and the bonds of love will be all the tenderer and stronger for the perception that the free individuality of the child\u0027s life was never sacrificed to the parent\u0027s authority. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87930.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
