{"id":24254,"no":57,"title":"PROFESSOR STOKES ON IMMORTALITY.","content":"The orthodox world makes much of Sir G. G. Stokes, baronet, M.P., and President of the Royal Society. It is so grateful to find a scientific man who is naively a Christian. Many of the species are avowed, or, at any rate, strongly suspected unbelievers; while others, who make a profession of Christianity, are careful to explain that they hold it with certain reservations, being Christians in general, but not Christians in particular. Sir G. G. Stokes, however, is as orthodox as any conventicle could desire. Perhaps it was for this reason that he was selected to deliver one of the courses of Gilford Lectures. He would be a sort of set-off against the rationalism of Max Muller and the scepticism of Tylor. What other reason, indeed, could have inspired his selection? He has not the slightest reputation as a theologian or philosopher, and one of the leading reviews, in noticing his Clifford Lectures, expresses a mild but decided wonder at his appearing in such a character. Let the Gifford Lectures, however, pass—for the present. We propose to deal with an earlier effort of Sir G. G. Stokes. Nearly two years ago he delivered a lecture at the Finsbury Polytechnic on the Immortality of the Soul. It was reported in the Family Churchman, and reprinted after revision as a twopenny pamphlet, with the first title of \"I.\" This is the only pointed thing about it. The lecture is about \"I,\" or, as Sir G. G. Stokes, might say, \"All my I.\" Sir G. G. Stokes begins by promising to confine himself to the question, \"What is it that personal identity depends upon and consists in?\" But he does not fulfil the promise. After some jejune remarks upon this question he drops into theology and winds up with a little sermon. \"I cannot pretend that I am able to answer that question myself,\" says Sir G. G. Stokes. Why, then, did he not leave it alone? \"But I will endeavor,\" he says, \"to place before you some thoughts bearing in that direction which I have found helpful to myself, and which possibly may be of some help to some of you.\" Sir G. G. Stokes does not mention David Hume, but that great thinker pointed out, with his habitual force and clearness, that personal identity depends upon memory. Our scientific lecturer, with the theological twist, says it \"involves memory,\" which implies a certain reservation. Yet he abstains from elucidating the point; and as it is the most important one in the discussion, he must be held guilty of short-sightedness or timidity. Memory involves thought, says Sir G. G. Stokes. This is true; in fact, it is a truism. And what, he asks, does thought depend on? \"To a certain extent\" he allows that it \"depends upon the condition of the brain.\" But during the present life, at any rate, it depends absolutely on the condition of the brain Look at the head of an idiot, and then at the head of Shakespeare; is not the brain difference the obvious cause of the mental difference? Are there not diseases of the brain that affect thought in a definite manner? Is not thought excited by stimulants, and deadened or even annihilated by narcotics? Is it not entirely suspended in healthy sleep? Will not a man of genius become an imbecile if his brain softens? Will not a philosopher rave like a drunken fishfag if he suffers from brain inflammation? Is not thought most vigorous when the brain is mature? And is it not weakest in the first and second childishness of youth and old age? The dependence of thought on the brain is so obvious, it is so demonstrable by the logical methods of difference and concomitant variations, that whoever disputes it, or only allows it \"to a certain extent,\" is bound to assign another definite cause. A definite cause, we say; not a fanciful or speculative one, which is perfectly hypothetical. Sir G. G. Stokes does not do this. He tries to make good his reservation by a negative criticism of \"the materialistic hypothesis.\" He takes the case of a man who, while going up a ladder and speaking, was knocked on the head by a falling brickbat. For two days he was unconscious, and \"when he came to, he completed the sentence that he had been speaking when he was struck.\" Now, at first sight, this seems a strong confirmation of \"the materialistic hypothesis.\" A shock to the brain stopped its action and suspended consciousness. Automatic animal functions went on, but there was no perception, thought, or feeling. When the effects of the shock wore off the brain resumed its action, and began at the very point where it left off. But this last circumstance is seized by Sir G. G. Stokes as \"a difficulty.\" Some change must have gone on, he says, during the two days the man lay unconscious; there must have been some waste of tissues, some change in the brain; yet \"there is no trace of this change in the joining together of the thought after the interval of unconsciousness with the thought before.\" Our reply is a simple one. In the first place, Sir G. G. Stokes is making much of a single fact, which he has not weighed, in despite of a host of other facts, not in the least questionable, and all pointing in one direction. In the second place, he does not tell us what change went on in the man\u0027s brain. May it not have been, at least with respect to the cerebrum, quite infinitesimal? In the third place, Sir G. G. Stokes should be aware that all brain changes do not affect consciousness, even in the normal state. Lastly, consciousness depends upon perception; and if all the avenues of sensation were closed, and the alteration of brain tissues were exceedingly slight (as it would be if the brain were not working), it is nothing very extraordinary that the man should resume thought and volition at the point where they ceased. The second \"difficulty\" raised, rather than discovered, by Sir G. G. Stokes is this. \"I am conscious of a power which I call will,\" he says, \"and when I hold up my hand I can choose whether I shall move it to the right or to the left.\" \"Now, according to the materialistic hypothesis, everything about me is determined simply by the ponderable molecules which constitute my body acting simply and solely according to the very same laws according to which matter destitute of life might act. Well then, if we follow up this supposition to its full extent, we are obliged to suppose that, whether I move at this particular moment of time—4.25, on the 30th of March—my hand to the right or to the left, was determined by something inevitable, something which could not have been otherwise, and must have come down, in fact, from my ancestors.\" Now Sir G. G. Stokes \"confesses\" that this seems to him to \"fly completely in the face of common sense.\" And so it does, if by \"determined\" he means that somebody settled the whole business, down to the minutest details, a thousand, a million, or a thousand million years ago. But if \"determined\" simply means that every phenomenon is caused, in the philosophical—not the theological or metaphysical—meaning of the word, it does not fly in the face of common sense at all. Little as Sir G. G. Stokes may like it, he does—body and brain, thought and feeling, volition and taste—come down from his ancestors. That is the reason why he is an Englishman, a Whig, a bit of a Philistine, an orthodox Christian, and a very indifferent reasoner. After all, does not this objection come with an ill grace from a Christian Theist? Has Sir G. G. Stokes never read St. Paul? Has he never heard of John Calvin and Martin Luther? Has he never read the Thirty-nine Articles of his own Church? All those authorities teach predestination; which, indeed, logically follows the doctrine of an all-wise and all-powerful God. Yet here is Sir G. G. Stokes, a Church of England man, objecting to the \"materialistic hypothesis\" on the ground that it makes things \"determined.\" Professor Stokes next refers to \"something about us\" which we call \"will.\" This he proceeds to treat as an independent force like magnetism or electricity. What he says about it shows him to be a perfect tyro in psychology. At the end of the section he exclaims, \"So much for that theory\"—the materialistic hypothesis; and we are tempted to exclaim, \"So much for Sir G. G. Stokes.\" Next comes the \"psychic theory,\" according to which \"man consists of body and soul.\" Here the Professor shows a lucid interval. He points out that if the soul is really hampered by the body, it is strange that a blow on a man\u0027s head should \"retard the action of his thoughts.\" He also remarks that, according to this theory, the \"blow has only got to be somewhat harder till the head is smashed altogether, and the man is killed, and then the thoughts are rendered more active than ever.\" Which, as our old friend Euclid observes, is absurd. Professor Stokes dismisses the \"body and soul\" theory as \"open to very grave objections.\" He admits that it is held by \"many persons belonging to the religious world,\" nevertheless he does not think it can be \"deduced from Scripture,\" to which he goes on to appeal. Now we beg our Christian friends to notice this. Here is the great Sir G. Gr. Stokes they make so much of actually throwing up the sponge. Instead of showing scientifically that man has a soul, and thus cheering their drooping spirits, he leaves the platform, mounts the pulpit, and plays the part of a theologian. In fact he can tell them no more than the ordinary parson who sticks his nose between the pages of his Bible. With regard to the Scripture, it will afford very little comfort to the Christians to know that Professor Stokes does not believe that it teaches the immortality of the soul. He supports this view by citing the authority of the present Bishop of Durham and \"another bishop,\" who regard the doctrine of an immortal soul as no part of a Christian faith. Had Sir G. G. Stokes been better read in the literature of his own Church, he might have adduced a number of other divines, including Bishop Courtenay and Archbishop Whately, who took the same position. \"Well, what do we learn from Scripture?\" inquires Professor Stokes. And this is his answer. \"In scripture,\" he says, \"man is spoken of as consisting of body, soul, and spirit.\" And in Sir G. G. Stokes\u0027s opinion it is the third article which \"lies at the very basis of life.\" It is spirit, \"the interaction of which with the material organism produced a living being\" in the Garden of Eden. Here we pause to interject a reflection. Ordinary Christians believe in body and soul; Professor Stokes believes in body, soul, and spirit. That is, he says man is made up of three instead of two. But in step our Theosophic friends, who pile on four more, and tell us that man is sevenfold. Now who is right! According to their own account they are all right. But this is impossible. In our opinion they are all wrong. Their theories are imaginary. All they know anything of is the human body. But to return to Professor Stokes\u0027s excursion in the region of Biblical exegesis. Never have we met with anything more puerile and absurd. He finds \"soul\" and \"spirit\" in the English Bible, and he supposes them to be different things. He even builds up a fanciful theory on the fact that the expression \"living soul\" occurs in the New Testament, but he does not remember the expression \"living spirit.\" Hence he concludes that spirit is not \"living\" but \"life-making.\" Surely a little knowledge is a dangerous thing, and Professor Stokes is a capital illustration of this truth. We get \"soul\" and \"spirit\" in the New Testament, as well as in the Old, simply because both words are used indifferently by the English translators. This is owing to the composite character of the English language. One word comes from the Greek, the other from the Latin, and both mean exactly the same thing. The Hebrew ruach, the (Greek pneuma), and the Latin spiritus, all originally meant the breath; and as breathing was the most obvious function of life, persisting even in the deepest sleep, it came to signify life, when that general conception was reached; and when the idea of soul or spirit was reached, the same word was used to denote it. All this is shown clearly enough by Tylor, and is corroborated by the more orthodox Max Muller; so that Professor Stokes has fallen into a quagmire, made of the dirt of ignorance and a little water of knowledge, and has made himself a laughing-stock to everyone who possesses a decent acquaintance with the subject. Whatever it is that Professor Stokes thinks a man has apart from his body, he does not believe it to be immortal. The immortality of the soul and a future life, he says, are \"two totally different things.\" The one he thinks \"incorrect,\" the other he regards as guaranteed by Scripture; in other words, by Paul, who begins his exposition by exclaiming \"Thou fool!\" and ends it by showing his own folly. The apostle\u0027s nonsense about the seed that cannot quicken unless it die, was laughed at by the African chief in Sir Samuel Baker\u0027s narrative. The unsophisticated negro said that if the seed did die it would never come to anything. And he was right, and Paul was wrong. There is a resurrection, however, for Paul says so, and his teaching is inspired, though his logic is faulty. Men will rise from the dead somehow, and with \"a body of some kind.\" Not the body we have now. Oh dear no! Great men have thought so, but it is an \"incredible supposition.\" Being a chemist, Sir G. G. Stokes sees the ineffable absurdity, the physical and logical impossibility, of this orthodox conception, which was taught by Mr. Spurgeon without the slightest misgiving, and upheld by the teaching of the Church of England. But what is it that will rise from the dead, and get joined with some sort of inconceivable body? We have shown that Professor Stokes\u0027s distinction between \"soul\" and \"spirit\" is fanciful. It will not do for him, then, to say it is the \"spirit\" that will rise, for he denies, or does not believe, the renewed life of the \"soul.\" Here he leaves us totally in the dark. Perhaps what will rise is \"a sort of a something\" that will get joined to \"a sort of a body\" and live in \"a sort of a somewhere.\" \"What,\" asks Professor Stokes, \"is man\u0027s condition between death and the resurrection?\" He admits that the teaching of Scripture on this point is \"exceedingly meagre.\" He inclines to think that \"the intermediate state is one of unconsciousness,\" something like when we faint, and thus, as there will be no perceptions in the interval, though it be millions of years, we shall, \"when we breathe our last,\" be brought \"immediately face to face with our final account to receive our final destiny.\" And if our final destiny depends in any way on how we have used our reasoning powers, Professor Stokes will be consigned to a warm corner in an excessively high-temperatured establishment. After all, Professor Stokes admits that all he has said, or can say, gives no \"evidence\" of a future life. What is the evidence then? \"Well,\" he says, \"the great evidence which we as Christians accept is, that there is One Who has passed already before us from the one state of being to the other.\" The resurrection of Jesus Christ, he tells us, is \"an historical event,\" and is supported by an enormous amount of most weighty evidence. But he does not give us a single ounce of it. The only argument he has for a future state is advanced on the last page, and he retires at the moment he has an opportunity of proving his case. Professor Stokes says: \"I fear I have occupied your time too long. We fear so too.\" \"These are dark subjects,\" he adds. True, and he has not illuminated them. There is positively no evidence of a future life. The belief is a conjecture, and we must die to prove or disprove it.","sourceLink":"http://novel.tingroom.com/duanpian/3224/87934.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
