{"id":24259,"no":62,"title":"MELCHIZEDEK.","content":"Melchizedek is the most extraordinary person of whom we have any record. Christ was born and Adam was made, but Melchizedek never began to be and will never cease to exist. If the Bible were not such an intensely serious book without a gleam of humor, except of the unconscious Hibernian kind, we might conclude that Melchizedek was nobody, for the description admirably suits that character. But the Bible does not play and must not be played with. All its personages are bona fide realities, from the Ancient of Days with white woolly hair on the throne of heaven to the prophet Jonah who took three days\u0027 lodging in the belly of a whale. The name Melchizedek means king of justice, being derived from melec, a king, and tzedec, justice. When the gentleman bearing this name is introduced to us in the fourteenth of Genesis, he is king of Salem, which means peace. Salem was a city on the site of Zion. Originally it was called Jebus, then Zadek, then Salem, and finally Jerusalem. So says Rabbi Joseph Ben-Gorion. But other writers, no doubt just as well informed, differ from him; and while the doctors disagree, simple laymen may well hold their judgment in suspense; or, better still, dismiss Jebus, Zadek, Salem, and Jerusalem, to the limbo of learned trivialities. Counting the spots on a leopard, the quills on a porcupine, or the hairs in a cat\u0027s whiskers, is just as amusing and quite as edifying as most of the problems of divines and commentators. When Abraham returned from a successful campaign, in which he defeated five kings and their armies with three hundred and eighteen raw recruits, Melchizedek came out to meet him with victuals and drink. These two friends joined in the friendly office of scratching each other. They were, in fact, a small mutual admiration society. Abraham, although at other times a rank coward, was on this occasion a bold warrior laden with spoil; and Melchizedek besides being King of Salem, was \"the priest of the most high God.\" \"Bully for you, Abraham,\" said Melchizedek. \"Bully for you, Melchizedek,\" said Abraham. As usual, however, the priest got the best of it, for the patriarch paid him tithes, which were a capital return for his compliments. Genesis is a little confused, indeed; and what scripture is not? \"And he gave him tithes of all\" is not very clear. It reminds one of the West of England yokel, who gave his evidence on a case of homicide in this way: \"He had a stick, and he had a stick; and he hit he, and he hit he. And if he\u0027d only hit he as hard as he hit he, he\u0027d a\u0027 killed he, and not he he.\" But we must not be too hard on Bibles and yokels. So long as we can get a scintillation of their meaning we must be satisfied. Scripture, we may take it, means that the he who paid tithes was Abraham, and the him who received them was Melchizedek. Now the book of Genesis is not an early, but a very late portion of the Jewish scriptures, dating only a few centuries before Christ. And we may depend on it that this little sentence about tithes, and perhaps the whole story that leads up to it, was got up by the priests, to give the authority of Abraham\u0027s name and the sanction of antiquity to an institution which kept them in luxury at the expense of their neighbors. Our view of the case is supported by the fact that Melchizedek\u0027s name does not appear again in the whole of the Old Testament, except in the hundred and tenth Psalm, where somebody or other (the parsons of course say Christ) is called \"a priest for ever after the order of Melchizedek.\" Paul, or whoever wrote the Epistle to the Hebrews, works up this hint in fine style. It would puzzle a lunatic, or a fortune-teller, or the Archbishop of Canterbury, or God Almighty himself, to say what the Seventh of Hebrews means. We give it up as an insoluble conundrum, and we observe that every commentator with a grain of sense and honesty does the same. But there is one luminous flash in the jumble of metaphysical darkness. Melchizedek is described as \"without father, without mother, without descent, having neither beginning of days nor end of life.\" It will be easy to recognise a gentleman of that description when you meet him. When we do meet him we shall readily acknowledge him as our king and priest, and pay him an income tax of two shillings in the pound; but until then we warn all kings and priests off our doorsteps. Jewish traditions say that Melchizedek was the son of Shem, and set apart for the purpose of watching and burying Adam\u0027s carcase when it was unshipped from the Ark. Some, however, maintain that he was of a celestial race; while other (Christian) speculators have held that he was no less than Jesus Christ himself, who put in an early appearance in Abraham\u0027s days to keep the Jewish pot boiling. St. Athanasius tells a long-winded story of Melchizedek and Abraham, which shows what stuff the early Christians believed. According to the Talmud, Melchizedek composed the hundred and tenth Psalm himself; and although he is without end of days, his tomb was shown at Jerusalem in the time of Gemelli Oarrere the traveller. There was an heretical sect called the Melchizedekiana in the third century. They held that Jesus Christ was, according to Hebrews, only of the order of Melchizedek, and therefore that Melchizedek himself was the more venerable. This heresy revived in Egypt after its suppression elsewhere, and its adherents claimed that Melchizedek was the Holy Ghost. The last time Melchizedek was heard of he was a London coster-monger\u0027s donkey, but whether this was a real incarnation of the original Melchizedek no one is able to decide, unless the Lord should again, as in the case of Balaam\u0027s companion, \"open the mouth of the ass\" and inform the world of the things that belong unto its peace. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87939.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
