{"id":24285,"no":88,"title":"MRS. BESANT ON DEATH AND AFTER.","content":"When we first criticised Mrs. Besant\u0027s newly-found Theosophy, and thereby incurred her severe displeasure, we predicted that her enthusiastic nature would carry her far on the road, which she thought of true philosophy, but which we thought of gross superstition. Our prediction has been realised; and, unless for some accident, or some sudden turn in Mrs. Besant\u0027s mind or life, it will be realised still further. In this, as in other matters (as the French say) it is the first step which costs, because it involves all the following steps. Mrs. Besant placed her feet upon the high road of credulity when she succumbed to the Theosophical high priestess, whose life is a highly interesting and instructive chapter in the history of imposture. Madame Blavatsky had seen much of the world, and was up to most things. She had a surprising power of bamboozling people of some intelligence and culture. The broad-set eyes, and the great tiger-bar between and over them, indicated the species to which she belonged. Mrs. Besant, with her innocences and enthusiasms, was a baby in the hands of this female Cagliostro. She actually gave the Blavatsky credit for what she obviously did not possess. Her manners, for instance, were not such as might be expected from one who had tasted of spiritual wisdom at its secret sources; while her pretentious ignorance was enough to alarm any student not under the glamor of her audacity. She made the most grotesque mistakes in science, while pompously setting right in their own province such colossal authorities as Darwin and Haeckel. She had certainly read very widely (or got others to read very widely for her) in \"occult\" literature; but wherever one\u0027s own knowledge enabled one to test, she was a poor smatterer; and the same judgment is delivered upon her by specialists in most of the fields she invaded. It was not her learning or her intellectual power that captivated Mrs. Besant; it was her strong personality, her masculine dominance, her crafty self-possession. From the first minute of her enchantment, Mrs. Besant lost all sense of logic in relation to Theosophy. For instance, it was asserted, and the assertion was supported by positive, detailed-evidence, that the Blavatsky had practised the grossest imposture in India. And how did Mrs. Besant dispose of these charges? She says she read them, and immediately joined the Theosophical Society—as though that were any answer. It is like saying, \"I don\u0027t rebut the evidence against the prisoner in the dock, but I shall shake hands with him.\" What possible effect could that have on the sensible part of the jury? But this sort of logic has been displayed by Mrs. Besant ever since; indeed, she seems to have a dim perception of her weakness, for she dares not discuss Theosophy, or any part of it, with an out-and-out Freethinker—one who would subject it to the critical tests with which she herself was familiar when she stood upon the Secular platform. There is one aspect of Mrs. Besant\u0027s advocacy of Theosophy which we censured at first, and which we now think is something short of honest. Mrs. Besant used to present Secularism in its naked truth, to be embraced or rejected; but she follows a different course in regard to Theosophy; she puts its plausible features forward and conceals the rest, so that people who have heard her are positively astonished when they are told of some of her printed teachings. This seems especially the case when she addresses meetings, somewhat too chivalrously organised by Freethinkers. Now this is not fair, it is not really honest; though it may be in accord with the ethics of those who divide truth into \"exoteric\" and \"esoteric.\" To our mind, it is rather suggestive of the spider and the fly. \"Will you walk into my parlor?\" \"Oh yes,\" says the giddy fly, \"it looks so nice, positively inviting?\" But what of the other rooms in your house; your garret near the sky, where you do star-gazing, and your basement, where crawl the foul things of savage superstition? Many of our readers have heard Mrs. Besant in the sweet persuasive vein, and felt pleased if rather muddled. For their sakes, and not for our own satisfaction, we shall criticise her little volume on Death—and After? just issued as No. III. of a series of Theosophical Manuals. When we have done they will know more about Theosophy than if they had listened to Mrs. Besant (especially from Freethought platforms) for ten thousand years. First, let us notice Mrs. Besant\u0027s attitude. Her devotion to the Blavatsky is complete; she mentions the great woman with profound veneration, swears to all she taught, and, in fact, just stews down the Blavatsky\u0027s voluminous nonsense. Mrs. Besant is also a patient disciple of the Masters—to wit, the Mahatmas. These Masters of Wisdom never appear for inspection. They lurk in the secret fastnesses of Tibet, which is a very unexplored part of the world, large enough to hide a good many things, even things that do not exist. They know a lot, but what dribbles out of them is very commonplace when it is not pompously silly. They inhabit higher planes of life than our greatest saints and sages, but somehow they have done nothing for Tibet, which is one of the poorest, dirtiest, and most degraded countries on earth. Still, they are going to give a tremendous lift to the civilisation of Europe; and if we live long enough we shall see what we do see. Mahatmas are really the distinctive feature of Theosophy; it is absolutely nothing without them; and, in our opinion, they are a most farcical swindle Madame Blavatsky created these out of her own fertile imagination, she put them where they could not be found, and she said, \"If you want to know anything about them come to me; I am the chosen vehicle of their sublime revelations.\" And if you laughed at her Mahatmas, she was capable of indulging in expletives that would strike envy into the soul of a trooper. How curious it is, if these Mahatmas are real personages, that they do not communicate with our Masters of Wisdom. Why do they neglect our Spencers and Huxleys? Why do they choose to speak through a woman like Madame Blavatsky, or a popular lecturess like Mrs. Besant? Why are they so fond of the ladies? Cannot they have some dealings with a man, a man of great eminence as a philosopher, of high and undisputed character, and of vast influence with the educated and thoughtful classes? Why, in short, do the Mahatmas confine their attention to smaller persons with fish to fry? Relying upon these Mahatmas, and upon Madame Blavatsky, her great guide, philosopher, and friend, Mrs. Besant has an extremely easy task. She makes no attempt to prove, she simply asserts, and it seems to be a kind of blasphemy to ask for evidence. She dishes everything up in Hindu terminology, on the ground that \"the English language has as yet no equivalents.\" But will it ever have them? Never, we suspect, by the assistance of Theosophists. The oriental lingo is part of the fascination to those who like to look profound on a small stock of learning. Besides, it imposes on the open-mouthed; and, if the Hindu terminology were translated into vernacular English, they would probably exclaim, \"Good God! there\u0027s nothing in it.\" It is all very well for Mrs. Besant to pour out second-hand praise of \"technical terms.\" We all know their value. But how is it we have not got them already? Because—and this is the only answer—because we are ignorant of the things. Western experience does not coincide with oriental dreams. Mrs. Besant opens her little volume with the famous story of the conversion to Christianity of Edwin, but she tells it very loosely, and in fact wrongly; which is a proof that the infallibility of the Mahatmas has not fallen upon their disciple. She states that while Paulinus, the Christian missionary, was speaking to-Edwin of life, death, and immortality, a bird flew in through a window, circled the hall, and flew out again into the darkness; whereupon the Christian priest \"bade the king see in the flight of the bird within the-hall the transitory life of man, and claimed for his faith that it showed the soul, in passing from the\u0027 hall of life, winging its way, not in the darkness of night, but in the sunlit radiance of a more glorious world.\" Now the bird did not fly into the hall as Paulinus was speaking, nor did he preach this sermon upon its movements. It was one of Edwin\u0027s suite who introduced the bird\u0027s flight as a metaphor, reminding the king that sometimes at supper, in the winter, a sparrow would fly in out of the storm, entering at one door and passing out at another, staying but a minute, and after that minute returning to winter as from winter it came. \"Such is the life of man,\" said the Saxon speaker, \"and of what follows it, or what has preceded it, we are altogether ignorant; wherefore, if this new doctrine should bring anything more certain, it well deserves to be followed.\" This is how the incident is related by Bede, though it is probably apocryphal; nevertheless it ought not to be hashed up by fresh cooks; and if the matter is in itself of trifling importance, it is as well to be accurate, especially when you pretend a close acquaintance with the Masters of Wisdom. Many hundred years have elapsed since Paulinus talked with Edwin, and to-day, says Mrs. Besant, there are \"more people in Christendom who question whether a man has a spirit to come anywhence or to go any-whither, than, perhaps, in the world\u0027s history could ever before have been found at one time.\" We are also reminded that man has always been asking whence the soul comes, and whither it goes, and \"the answers have varied with the faiths.\" This is true, at any rate; but it does not suggest to Mrs. Besant any lesson of modesty or hesitation. Despite the discord of so many ages, she is most coolly dogmatic. It does not, apparently, occur to her to ask why the discord has perpetually prevailed. In matters of science, after investigation and discussion, the world comes to an agreement; in matters of theology (or, if you like, Theosophy) the world grows more and more at variance. Why is this? There must be an explanation. And to our mind the explanation is very simple. In matters of science men deal with facts, while in those other matters they deal with fancies, and the more freedom you give them the greater will be the variety of their preferences. Mrs. Besant\u0027s new superstition of Theosophy is, in our judgment, more foolish and less dignified than Christianity. We are therefore moved to say that she does injustice to Christianity in representing it as responsible for all the black paraphernalia and lugubrious ceremonies of death. There was, indeed, nothing of all this among the primitive Christians. Such things belong to the world\u0027s common customs and superstitions. Black was not merely a sign of sorrow, or at least of depression; it was also thought to be protective against ghosts; so that these trappings and suits of woe belong to the very \"spookology\" which is an integral part of Theosophy. Of course I freely admit that the ordinary gloom of death has been deepened by the Christian doctrine of hell, though Mrs. Besant seems to think otherwise. She inclines to the belief that the Western fear of death is ethnological, being the antithesis of its vigorous life. But it may be objected that the old Romans were comparatively free from this terror. On the other hand, it must be allowed that Mrs. Besant is right in her observation that \"the more mystical dreamy East\" has little dread of the \"shadow cloaked from head to foot,\" since it is ever ever seeking to escape from \"from the thraldom of the senses,\" and is apt to look upon \"the disembodied state as eminently desirable and as most conducive to unfettered thought.\" In other words, that \"when the brains are out,\" as Macbeth says, man\u0027s intellect undergoes a wonderful improvement; an opinion, by the way, which is quite in harmony with Theosophical teaching. After giving the Theosophical view of the \"body,\" Mrs. Besant says that when once we thus come to regard it, death loses all its terrors. But this is not the sole achievement of Theosophy. What terror had death to Charles Bradlaugh? What terror had death to Mrs. Besant while she was an Atheist? There are thousands of sceptics who do not want Theosophy to redeem them from a terror which they have long cast behind them, with the superstition by which it was bred and cherished. Let us pause to remark that Mrs. Besant quotes from Paradise Lost its magnificent description of Death. She appreciates at least the splendor of the diction, but she does not notice how poor in comparison are the words she quotes from her \"Masters.\" How is it that Milton beats the Mahatmas? What objects they look when the great English poet rises \"with his singing robes about him\"! How thin their music when he strikes upon his thrilling lyre, or blows his rousing trumpet, or rolls from his mighty organ the floods of entrancing harmony! But to return to the main subject. It is absurd, as Mrs. Besant points out, to claim for Christianity that it \"brought life and immortality to light.\" The belief in a future life was an intense conviction—or, perhaps we should say, a perfect truism—among the people of ancient India and Egypt. Yet here again, with her taste for dogmatic rhetoric, Mrs. Besant gratuitously exaggerates. \"The whole ancient world,\" she says, \"basked in the full sunshine of belief in the immortality of man, lived in it daily, voiced it in their literature, and went with it in calm serenity through the gate of Death.\" Now \"calm serenity\" is bad tautology, and the general assertion of this passage is equally open to censure. \"The whole ancient world,\" as the Americans would say, is a large order. Greece and Rome (to say nothing of the pre-Maccabean Jews) were very important parts of \"the whole ancient world,\" and whoever asserts that their citizens \"basked in the sunshine of belief in immortality\" is simply making a confession of ignorance. Greek and Roman poets and philosophers in many cases doubted, or even denied, a life beyond the grave. Even when the doctrine was entertained it does not appear to have been productive of much \"sunshine.\" Does not the poet make the shade of the great Achilles say that he would rather be the veriest day-drudge on earth than command all the armies of the ghosts in the cold pale realm of the dead? We do not ignore, on the other hand, the Islands of the Blest; we are only objecting to Mrs. Besant\u0027s loose and sweeping assertions, which prove very clearly that her new \"faith\" is not remarkable in the cultivation of accuracy. With regard to man—the entire human being, mortal and immortal—Mrs. Besant remarks that \"un-instructed Christians\" chop him into two, the body-that perishes at death, and the \"something that survives death.\" She omits to notice that a good many Christians chop him into three, to say nothing of others, like the Christadelphians, who leave him one and indivisible. Mrs. Besant, for her part, as a true Theo-sophist, goes farther than the sharpest Christian dissectors. She chops man into seven. When she was a Materialist she never suspected that her nature was so composite, and we are still in the same benighted condition. One begins to feel that the injunction, \"Man, know thyself,\" is a terrible burden. It is hard enough to get a fair knowledge of our organism, its physical constitution, its intellectual faculties, and its moral tendencies; but the task is absolutely appalling when, we have to get a satisfactory knowledge of our Atma, our Buddhi, our Manas, our Kama, our Prana, our Linga Sharira, and our Sthula Sharira. Anyone who can master all that may as well go on unto seventy times seven. The immortal soul consists of the upper three, which are a trinity in everlasting unity. The heavens may wax old as a garment, but they \"go on for ever,\" and flourish in immortal youth. Death is the first step in the process of their separation from the lower and perishable four. One after another of these is shed, as the serpent sloughs its skin, or the butterfly its chrysalis; or, to use a more familiar and pungent illustration, which we make a present of to Mrs. Besant, as you peel an onion, fold after fold, until you get to the tender core. Sthula Sharira goes first, and the organism becomes a corpse, which is buried, or cremated, or eaten by cannibals. Linga Sharira, the Astral Double, had been attached to it by a \"delicate cord,\" which is our old friend \"the thread of life\"—a convenient metaphor turned into a positive proposition. This delicate cord is snapped, not immediately, \"but some hours\" (as many as thirty-six occasionally) after \"apparent death.\" It is necessary, therefore, to be very quiet in the death-chamber, while the Linga Sharira is eloping. One shudders to think of what might happen, of the indecent haste to which Number Six might be compelled, if a corpse were cremated a few hours after death; the corpse, for instance, of a man who died from cholera or the plague. This \"delicate cord\" which attaches Number Seven to Number Six is perceptible if your eyes are constructed that way; that is, if you are a clairvoyant, one who is able to see beyond the real. Mrs. Besant does not say she has seen it herself; indeed, she is always relying on someone else. She refers us to Andrew Jackson Davis, the \"Poughkeepsie Seer\" (and a Spiritist, though she does not say so), who \"watched this escape of the ethereal body\" and states that \"the magnetic cord did not break for some thirty-six hours.\" \"Others,\" says Mrs. Besant, \"have described, in similar terms, how they saw a faint violet mist rise from the dying body, gradually condensing into a figure which was the counterpart of the expiring person, and attached to that person by a glittering thread.\" Thus the attachment is \"delicate,\" \"magnetic,\" and \"glittering.\" In the course of time, we dare say, it will be decorated with a much larger variety of adjectives. Meanwhile we may observe that if Mrs. Besant were to preach this sort of \"higher wisdom\" to savages she would find an attentive and sympathetic audience. The violet mist, the Astral Double, and the delicate, magnetic, glittering cord, are things that they are to some extent already familiar with; and if she could only get them to accept her terminology, and talk of Sthula Sharira and Linga Sharira, they would be extremely promising candidates for the Theosophical kingdom of heaven. Mrs. Besant tells us that the Linga Sharira, or Astral Double, rots away (disintegrates) in time. It is \"the ethereal counterpart of the gross body of man,\" and takes a longer time in dropping into nothingness. \"Sometimes this Double is seen by persons in the house, or in the neighborhood... the Double may be seen or heard; when seen it shows the dreamy hazy consciousness alluded to, is silent, vague in its aspect, and unresponsive.... This astral corpse remains near the physical one, and they disintegrate together; clairvoyants see these astral wraiths in churchyards, sometimes showing likeness of the dead body, sometimes as violet mists or lights. Such an astral corpse has been seen by a friend of my own.\" At this point we think it well to part company with Mrs. Besant. Who would have imagined, ten years ago, that the colleague of Charles Bradlaugh would ever descend so far into superstition as to write and talk seriously about churchyard spooks? What she may have to say about Theosophy after this can hardly be of interest to any thoroughly sane person. We therefore close with an expression of profound regret that an earnest, eloquent lady who once did such service in the cause of progress, should thus fall a victim to some of the most childish superstitions of the human race. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3224/87965.html","bookId":702,"book":{"id":702,"title":"Flowers of Freethought","description":"简介： This gentleman is of very ancient descent. His lineage dwarfs that of the proudest nobles and kings. English peers whose ancestors came in with the Conqueror; the Guelphs, Hapsburgs, and Hohenzollens of our European thrones; are things of yesterday c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3224","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
