{"id":39256,"no":42,"title":"THE BEARDED GRIFFIN.","content":"Gypaetos barbatus. Storr. \\n\\n \\n\\n The Bearded Griffin takes an intermediate station between the Eagles and the Vultures, with the former of which it agrees more closely in general appearance and external form, and with the latter in internal structure and habits. The principal point in which it differs from them both consists in the tuft of bristly hairs which take their origin partly from the cere that covers the base of the beak, and partly from the under mandible, and are directed outwards and downwards in such a manner as to give rise to that appearance from which the bird has received his epithet of Bearded. His beak is strongly arched at the extremity, and is remarkable for its great[204] vertical thickness, more especially at the point where the curvature commences. His head, flat like that of the Eagle, is covered with short feathers, which are of a dirty white; and his eyes are nearly on the same plane with the surface of his head. The general tint of his plumage is blackish brown above and grayish fawn beneath, and his legs are feathered with the latter colour down to the very toes, which are long and grayish. His claws are of moderate length and curved; but the force of his clutch is far inferior to that of the Eagles. \\n\\n \\n\\n The Bearded Griffin is the largest European bird of prey, and builds its aiery among the loftiest precipices of nearly all the alpine chains of the Old Continent. Here it displays the tyranny, but not the courage, of the Eagle, attacking such living animals only as are likely to fall an easy prey, and gorging in troops with all the rapacity of Vultures upon the most corrupted carrion. \\n\\n \\n\\n The individual figured is a fine specimen, but is not yet in perfect plumage. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1699/50032.html","bookId":1154,"book":{"id":1154,"title":"The Tower Menagerie","description":"简介： The origin of Menageries dates from the most remote antiquity. Their existence may be traced even in the obscure traditions of the fabulous ages, when the contests of the barbarian leader with his fellow-men were relieved by exploits in the chase sca...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1699","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
