{"id":39257,"no":43,"title":"THE GRIFFON VULTURE.","content":"Vultur fulvus. Linn. \n \n If the Eagles are considered as bearing a close analogy to the more noble and perfect among the Carnivorous Quadrupeds, such as the Lion and the Tiger, which live in solitary grandeur and attack none but living victims, the Vultures may, with equal propriety, be regarded as the representatives of the Jackal, the Wolf, the Hy?na, and other inferior animals of that Order, which hunt in packs and prey upon carrion. Endowed like these animals with an extreme fineness of scent, they are attracted by the smell of dead, and more especially of putrid, carcases, at an immense and almost incredible distance; and usually assemble in vast numbers to glut[206] themselves upon the disgusting banquet on the field of recent battle, or wherever the work of carnage has been carried to any great extent. Under such circumstances, however horrible that propensity may appear which leads them to prey upon the unburied corpses, they unquestionably fulfil a wise provision of nature by removing from the surface of the earth a mass of corruption and putridity which in the warmer climates where they abound would otherwise taint the very atmosphere, and might possibly give rise to diseases still more fatal in their effects than the malignant passions of man himself, from which the destruction sprung. But although such a scene affords the greatest scope for the indulgence of their depraved appetites, and consequently congregates them together in the largest numbers, it is happily of rare occurrence, and their usual subsistence is derived from the bodies of dead animals. To these they are attracted by the smell, and frequently in flocks so numerous as actually to cover and conceal the object of their attack, from which they tear away large gobbets, and swallow them entire and with insatiable avidity, never ceasing while yet a morsel remains. It is only when hard pressed by hunger that they venture to attack a living creature; and their ravages of this kind are always confined to the peaceful and timid denizens of the poultry-yard. They never carry off their victims in their talons, but uniformly devour them upon the spot; and even that portion of their prey which they transport to their young is first swallowed, and afterwards disgorged in the nest. \n \n These peculiarities of habit, by which the Vultures are strikingly contrasted not merely with the Eagles,[207] but even with the smallest of the Falcon tribe, are the necessary result of their organisation. Their beak, it is true, is like that of the Eagles strongly curved at the point alone, and they also possess all the technical characters of the Rapacious Order; but their talons are far inferior, both in size and in the degree of their curvature, and they are consequently unable to grasp their prey with sufficient force to transport it through the air. Their diminished power of flight renders them incapable of soaring upwards to search abroad with piercing eye for the objects of their rapacity; and they are therefore left dependent upon the acute sensibility of their nostrils, which amply supplies the deficiency. Of the external characters which they exhibit the most remarkable is derived from the want of plumage on the head and neck, which are covered in the greater number of the species by nothing more than a sort of down or by short and smooth hairs. The object of this provision appears to be to enable them to bury as it were their heads in the carrion on which they feed, without exposing their plumage to be soiled by the filth which it might otherwise contract. Their eyes are placed on a level with their cheeks; their heads are rounded above; they have most frequently a ruff of considerable extent round the lower part of their necks; and their legs are usually bare of feathers and covered with large scales. Their very attitudes offer the most perfect contrast to those of the Eagles; the latter constantly maintaining a bold upright posture, with their wings closely pressed to their sides, and their tails elevated, while the Vultures on the contrary are always seen bending forwards in a crouching position, with their wings depressed and separated[208] from their bodies, and their tails trailing upon the ground. \n \n The Griffon Vulture is equal in size to the larger species of Eagle; his head and neck are covered with short white down, and the latter is ornamented at its base with an extensive ruff of long feathers of a clear and brilliant white. The plumage of the body is reddish gray; the quill-feathers of the wings and tail are of a blackish brown; and the beak and claws are nearly black. He is a native of the greater part of Europe and of Asia, and inhabits during the summer the more elevated regions of the two continents, building his nest in the rocks and among inaccessible precipices. In the winter he is said to migrate to warmer and more temperate climes. His habits are precisely those of the rest of the group to which he belongs. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1699/50033.html","bookId":1154,"book":{"id":1154,"title":"The Tower Menagerie","description":"简介： The origin of Menageries dates from the most remote antiquity. Their existence may be traced even in the obscure traditions of the fabulous ages, when the contests of the barbarian leader with his fellow-men were relieved by exploits in the chase sca...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1699","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
