{"id":25517,"no":24,"title":"BOOK THE THIRD. CHAPTER I. ?grotat Animo.","content":"Miss Grace Lambert had made herself so popular at Hardriggs, had so ingratiated herself with all staying in that hospitable mansion that the news, duly conveyed to the breakfast-table by Mrs. Bloxam on the morning after Miles Challoner\u0027s visit, that she was too unwell to leave her room, threw a considerable damp over the Company assembled. Old Sir Giles, who had been very much impressed by Gertrude\u0027s quiet manner and cheerful spirits since she had been staying in the house--who had been perfectly astonished at the discovery that, though an opera-singer and a great public favourite, she had, as he phrased it, \"no d--d nonsense about her\"--was the first to break out into loudly-expressed lamentation, mingled with suggestions of sending off at once to Hastings for medical advice, or telegraphing to London with the same object. Lady Belwether was distressed beyond measure; the idea of anyone so charming, anyone capable of yielding such exquisite delight, suffering from pain or sickness seemed to be something quite beyond the old lady\u0027s ken. She was at Gertrude\u0027s bedside within five minutes after she had heard of her young friend\u0027s indisposition, and was shocked at the swollen eyelids and pallid drawn face of her idol. The Dean, too, received the news with great regret: he had experienced much pleasure in Miss Lambert\u0027s society. The very fact of her position had had its secret charm; there was something specially pleasant in being brought into daily communion with one whose status in life was considered equivocal, but whose conduct was unexceptionable, and, if occasion required, would bear any amount of scrutiny. All great men have their enemies; the Dean was not without his. The odium theologicum, than which there is nothing stronger, had made him its butt on various occasions, and many of his clerical brethren had poured out the vials of their wrath, through the medium of the Church journals to which they contributed, on his devoted head. The Dean had hitherto never replied to any of these attacks; but he had thought more than once, as he sat nursing his knee and looking out through the bay-window of the library at Hardriggs, that he should be by no means sorry if the contemporaneous visit of Miss Lambert and himself were made the subject of attack; and he had planned out a very brilliant and taking letter in reply--a letter abounding in charity and in quotations from the Fathers, Pollok\u0027s Course of Time, and the Christian Year.. The Dean expressed to Lady Belwether that, charming as her guests were in the aggregate, Miss Lambert\u0027s secession would leave among them a blank, a hiatus, which was not merely valde deflendus, but which, in point of fact, it would be impossible to fill up; and the old lady, though she did not understand Latin, comprehended the general nature of the remark, and found in it new cause for self-gratulation, and fresh weapons of defence against the insidious attacks of Martha and the Reverend Tophet. There were, it is true, certain people staying at Hardriggs who seemed to take it as a grievance that any \"person in Miss Lambert\u0027s position,\" as they were good enough to call it, should be taken ill at all; but they were in a decided minority, and most of them were very much ashamed of the opinion they had held when they found the Dean of Burwash taking the young lady\u0027s indisposition so much to heart. Had any one of them the slightest suspicion of the real cause of Gertrude\u0027s ailment? Not one. Would any one of them have given credence for a moment, if they had been told, that on the previous day the girl had refused the proffered hands of two men, one of them an earl, the other a wealthy commoner? Not one. \"Such things are all very well in books, my dear,\" Lady Belwether would have told you, adding from memory a list of ennobled actresses who had all done honour to the position in life to which they had been raised; but the chances came but seldom, and were always taken advantage of by those to whom they were offered. What would have been the effect on the host and hostess, and on the rest of their company, if it had become known that Lord Ticehurst had made Miss Lambert an offer, it would be impossible to say. They would have wondered at him, they would have wondered much more at her, and they would have professed to pity, and probably have cordially hated them both. However, that was a secret which of all in that house was known but to Gertrude alone, and she was not one who would wittingly let it pass her lips. She was ill; she had a perfect right to say so, and was not uttering the slightest falsehood in the assertion. That dreadful sinking of the heart, that utter prostration, that deep, dead blankness of spirits, that hopelessness, that refusal to be comforted--if this did not constitute illness, what did? He didlove her, then? She had known it long, but what bliss it was to hear him avow it! Should she ever lose the remembrance of him as he stood before her--the light in his eye, the poseof his head, the tone of his voice? True? She would stake her life on that man\u0027s truth. What a difference between his diffident earnestness and the theatrical swagger with which Gilbert Lloyd asked her the same question--ah, how many years ago! Lord Ticehurst, too,--she had almost forgotten his visit and its purport, so overshadowed was it by the importance of the affair which immediately succeeded it,--Lord Ticehurst--he was, in his way, considerate and kindly--meant to be all courteous and all honest; she hoped her manner to him had not been brusque or abrupt. Countess of Ticehurst, eh?--rank, wealth, station. For an instant a hard, cold, proud look, which had been a stranger to her face of late, flitted across her features, and then faded away. No! Those might have had their allurements when she first learned Gilbert Lloyd\u0027s worthlessness, and recommenced her life, scorning to yield, and merely looking on all human weaknesses as stepping-stones for her advancement. She had learned better things than that now. Miles! Could it be possible that but a comparatively short time ago he had been supremely indifferent to her? that she had looked on and seen the love for her growing in his heart, without a dream of ever reciprocating it? And now--Refused him! she could have done nothing else. And for his own sake--as she had told him, but as he seemed unable to comprehend,--for his own sake. For the love of such a man as Miles Challoner she would have risked everything, in the first appreciation of such a sentiment so fresh and novel to her in all her experience of life--and that experience had been singular and not small; to be the recipient of such a passion as that man proffered and laid at her feet, she would have let her dead past bury its dead; forgotten, buried, stamped down out of all chance of resurrection the events of her early life--her marriage, her separation from her husband The compact made between her and Gilbert Lloyd should have been more than ever religiously fulfilled. That she held that husband at her mercy she knew perfectly well: only once had he ventured to question her power that evening at Mrs. Burge\u0027s reception, and his conduct then had given her ample proof of the impossibility of his resistance to her will. She had nothing to fear from him; and she knew him well enough to be certain that he had kept that secret at least locked in his own breast. But Miles? No! she had done rightly; even if her appreciation of Miles Challoner\u0027s warm admiration and generous regard had not grown and deepened into a feeling, the strength of which forbade her striving against it, and which she knew and confessed to herself to be love, she would have rebelled against any attempt to hoodwink or deceive that loyal-hearted gentleman. But now the attempt had been treachery of the basest kind. She loved him--loved him wildly, passionately, and yet with an intermingled reverence and respect such as her girlish fancy had never dreamed of; and she had refused him, had told him--not indeed calmly or quietly, for once her self-control had failed her, but with earnestness and decision--that her fate was decided, her way of life quite fixed, and that she could never be his wife! Ah, if they could have known all, those good people downstairs, they would scarcely have wondered at Miss Lambert\u0027s indisposition. They ascribed her illness to over-exertion, over-excitement, the reaction after the feverish professional life of the past few months. A little rest, they said to each other, would \"bring her round.\" A little rest! Something more than a little rest is required, as they would have allowed, could they have seen what no one, not even Mrs. Bloxam, saw,--the favourite of the public with dishevelled hair and streaming eyes stretched prone upon her pillow, and sobbing as though her heart would break! Miss Grace Lambert\u0027s illness or indisposition, thus evoking the compassion of the company staying at Hardriggs, was, whatever the company might have thought about it, known to herself to spring purely from mental distress. The same teterrima causaacted on Lord Sandilands, but brought about a different physical result. On the morning after Miles had communicated the result of his interview with Gertrude the old nobleman awoke with a return of the symptoms which had previously alarmed him so much increased that he felt it necessary to send for a local practitioner, by whose report he would be guided as to the expediency of summoning his own ordinary physician from London. Hastings is so essentially a resort of invalids, that the faculty is to be found there in every variety. Allopathy, seated far back in its brougham, looks sedately and smugly at the saunterers on the promenade; while Homoeopathy, thinking to assume a virtue even if it have it not, and to wear the livery of medicine though scorned by regular practitioners, whirls by, black-clothed and white-chokered, in its open four-wheeler. Nor are there wanting the followers of even less generally received science. On that charming slope, midway between Hastings and St. Leonards, where a scrap of green struggles to put in an arid appearance amidst the vast masses of rock and sand, Herr Douss, the favourite pupil of Priessnitz (what a large-hearted fellow he must have been, to judge by the number of his favourite pupils!), opened a water-cure establishment, to which, for financial reasons, he has recently added the attractions of a Turkish bath, and invariably has a houseful of damp hypochondriacs. And in the immediate neighbourhood is there not the sanatorium of the celebrated Mr. Crux? a gentleman who has discovered the secret that no mortal ailment can withstand being rubbed in a peculiar manner, and who shampoos you, and rubs you, and pulls your joints, and pommels you all over until you become a miracle of youth and freshness, to which the renovated ?son could not be compared. It is not for an instant to be supposed that any of this unlicensed band were allowed to work their will on the person of Lord Sandilands. The old gentleman was far too careful of his health to quit the immediate precincts of his private physician without being relegated to someone to whom that physician had knowledge, and in whom he had trust. Sir Charles Dumfunk, of Harley-street, habitually attended Lord Sandilands, and was liked by his lordship as a friend as well as esteemed as a physician. A very courtly old gentleman was Sir Charles, one who for years had been honorary physician to the Grand Scandinavian Opera, and had written more medical certificates for sulky singers and dancers than any other member of his craft. In his capacity of fashionable physician--the lungs and throat were supposed to be his speciality--Sir Charles Dumfunk had the power of bidding many of his patients to quit their usual pursuits, and devote themselves to the restoration of their health in a softer climate. The ultra-fashionables were generally sent to Nice, Cannes, or Mentone; \"it little matters,\" the old gentleman used to remark; \"they will carry Belgrave-square and its manners and customs with them wherever they go.\" Nouveaux richeswere despatched to Madeira, energetic patients to Algiers, while mild cases were permitted to pass their winter at Hastings. At each one of these places the leading physician was Sir Charles Dumfunk\u0027s friend. Little Dr. Bede, of St. Leonards, swore by the great London Galen, who invariably sent him a score of patients during the winter, and was as good to him as a couple of hundred a-year. Lord Sandilands had come down armed with a letter of introduction to Dr. Bede, and had sent it on by his servant, accompanied by a brace of partridges from the Belwether estate, very soon after his arrival. Dr. Bede had acknowledged the receipt of letter and birds in a very neat little note, had looked-up Lord Sandilands in the Peerage--the only lay book in his medical library--and had left his card at his lordship\u0027s lodgings. Consequently, when, the morning after Miles\u0027s fiascoat Hardriggs, Dr. Bede was summoned to come to Lord Sandilands at once, physician and patient knew as much about each other as, failing a personal interview, was possible. Symptoms detailed, examination made, Dr. Bede--a very precise and methodical little gentleman, with a singularly neatly-tied black neckerchief, towards which the eye of every patient was infallibly attracted, and a curiously stony and expressionless blue eye of his own, out of which nothing could ever be gleaned,--Dr. Bede, tightly buttoned to the throat in his little black surtout, gives it as his decided opinion that it is gout, \"and not a doubt about it.\" Lord Sandilands, really half-gratified that he is literally laid by the heels by an aristocratic and gentlemanly complaint, combats the notion--no hereditary predisposition, no previous symptoms. Dr. Bede is firm and Lord Sandilands is convinced. An affair of time, of course; an affair very much at the patient\u0027s own will; entire abstinence from this and that and the other, and very little of anything else; perfect quiet and rest of mind and body--of mind quite as much as body--repeats the little doctor, with a would-be sharp glance at the patient, whose mental worry shows itself in a thousand little ways, all of which are patent to the sharp-eyed practitioner. Lord Sandilands promises obedience with a half laugh; he is very much obliged to Dr. Bede, he has thorough confidence in his comprehension and treatment of the case; there is no need to send to town for Dumfunk? Dr. Bede, with confidence dashed with humility, thinks not--of course it is for his lordship to decide; but he, Dr. Bede, has not the smallest fear, provided his instructions are strictly obeyed; and he is quite aware of the value of the charge Sir Charles Dumfunk has confided to him. So far all is arranged. The doctor will look in every day, and his lordship promises strict compliance with his instructions. So far all is arranged; but when the doctor is fairly gone, and the door is shut, and Lord Sandilands has heard the sound of the wheels of the professional brougham, low on the sand and loud on the stones, echo away, the old gentleman is fain to admit--first to himself, secondly to Miles, whom he summons immediately--that it is impossible for him to keep his word so far as being mentally quiet is concerned. \"If I\u0027m to be clapped down on this particularly slippery chintz sofa, my dear boy,\" said he, \"I must accept the fiat. It might be better, but it might be much worse. I can hear the pleasant plashing of the sea, which, though a little melancholy, is deuced musical; and I can see the boats floating away in the distance; and I have every opportunity of making myself acquainted with the hideousness of the prevailing fashion in female dress; and, if I\u0027m feeling too happy, there\u0027s safe to arrive a German band, and murder some of my favourite morceauxin a manner which reminds me that, like that king of Thingummy, I am mortal, begad! But it\u0027s no use for that little medico--polite, pleasant little person in his way, too--no use for that little medico to tell me to keep my mind perfectly quiet, and not to excite myself about anything. What a ridiculous thing for a man to prescribe! as though we hadn\u0027t all of us always something to worry ourselves about!\" Miles Challoner was, as times go, a wonderful specimen of a selfless man. He had temporarily laid aside his own trouble on finding that his old friend was really ill, and it was in genuine good faith that he said: \"Why, what in the world have you to worry you now, old friend? What should prevent your keeping rigidly to that mental repose which Dr. Bede says is so essential to your well-doing?\" \"What have I got to worry me? What is likely to prove antipathic to my being quiet?\" asked Lord Sandilands in petulant querulous tones. \"\u0027Gad, when it man\u0027s old it\u0027s imagined that he has no care, no interest but in himself! You ought to know me better, Miles; \u0027pon my soul you ought!\" \"I do know all your goodness, and--\" \"No, no! Goodness and stuff! Do you or do you not know the interest I take in you? You do? Good! Then is it likely I could allow affairs to remain as they are between you and Miss Lambert without worrying myself about them? without trying my poor possibleto bring them right?\" \"My dear old friend--\" \"Yes, yes! your dear old friend; that\u0027s all very well; you treat me like a child, Miles. I know you mean it kindly; but I\u0027ve been accustomed to act and think for myself for so long that I can\u0027t throw off the habit even now, when that dapper little fellow tells me I ought; and I must at once go into this business of Grace Lambert\u0027s. I have my own ideas on that matter, and I won\u0027t at all regard her decision as final, notwithstanding your solemn face and manner. Now, look here, my dear boy, it\u0027s of no use lifting up that warning finger; if you cross my wishes I shall become infinitely worse, and less bearable. I\u0027ve always heard that gout is a disease in which, above all others, the patient must be humoured. I must see--There! you\u0027re jumping up at once--and quite enough to give me a sharp attack--simply because you thought I was going to name your divinity. Wasn\u0027t it so? I thought as much. Nothing of the sort; I was about to say that I must see Mrs. Bloxam at once. I have some very special business to talk over with her, and I should be much obliged if you, Miles, would take a fly and go over at once to Hardriggs and bring Mrs. Bloxam back with you.\" \"I?--go over to Hardriggs after--\" \"Go over to Hardriggs! And why not? I\u0027m sure you could not complain of your reception by Sir Giles and Lady Belwether; they have been most cordially polite to you on every occasion of your visiting them, and they are the host and hostess at Hardriggs, I believe. Besides, I ask you to do me a special favour, in doing which you need expose yourself to no disagreeables, even to seeing anyone whom you would rather not see.\" \"You are quite right, and I will be off at once.\" \"That\u0027s spoken like my dear good fellow! Goodbye, Miles, goodbye!--If he does come across her in the house or the grounds?\" said the old gentleman, as the door closed behind his protégé.. \"Well, you never can tell; it might have been whim, a mere passing caprice, in which case she might be perfectly ready to revoke to-day; and no harm could be done by his meeting her again. Or it might be something more serious--is something more serious probably, for Gertrude is a girl with plenty of resolution and firm will. At any rate, I\u0027m right in having Mrs. Bloxam here to talk it over, and I think I shall hold to the programme which I have already arranged in my mind.\" The Hastings fly, drawn by the flea-bitten gray horse, which conveyed Miles Challoner to Hardriggs, went anything but gaily over the dusty, hilly road. The driver, a sullen young man, with dreary views of life, saw at a glance that his fare was in an abstracted frame of mind, and looked anything but likely to pay for extra speed. So he sat on his box, driving the usual half-crown-an-hour rate, giving the flea-bitten gray an occasional chuck with the reins, producing a corresponding \"job\" from the bit, and occupying himself now by fitting a new end to his whip-lash, now by humming dolorous ditties in the hardest Sussex twang, with a particularly painful and constantly recurring development of the letter \"r.\" Miles sat leaning back in the carriage, his hat thrust over his eyes, his hands plunged deep in his pockets. He was buried in thought of no pleasant kind, and neither heard nor heeded the chaff of the passers-by, which was loud and frequent. The first portion of the way to Hardriggs lies along the Fairlight-road, and numerous parties of cheerful Cockneys, in vehicles and on foot, on their way to the romantic Lover\u0027s Seat, and the waterfall where there is no water, and the pretty glen, passed the carriage containing the moody young man, and commented openly on its occupant. \"He don\u0027t look like a pleasurer, he don\u0027t!\" was a remark that gained immediate sympathy; while a more comic suggestion that \"he looked as if he\u0027d lost a fourpenny-piece,\" was received with tumultuous applause. Neither style of comment had the least effect on Miles Challoner, who remained chewing the cud of his own reflections until the stopping of the fly at the outer gate of Hardriggs Park reminded him of having seen Lord Ticehurst driving through that gate on the occasion of his visit on the previous day. Suddenly it flashed across him that the young nobleman\u0027s manner had been specially odd and remarkable. Could it have been that--and yet the expression of Lord Ticehurst\u0027s face was chapfallen and disconsolate, anything but that of a successful suitor. All the world had said, during the past season, that his lordship had been very strongly éprisof Miss Lambert, he had paid her constant attention, and-- That could have had no influence on her decision of yesterday; she could never have listened to Lord Ticehurst\u0027s protestations, even if he had made any such, or he would not have gone away in so melancholy and depressed a state. Besides, had not Grace told him that she loved him, Miles--that he was not mistaken in her--that she had not misled him? And yet she would not marry him? Ah, there must be some mistake, something which could be explained away? Lord Sandilands had evidently felt that when he had asked him to come over with this message to Mrs. Bloxam. He would see Miss Lambert--not asking for her directly, that would be too marked, but taking an opportunity of chancing on her, and--well, after all, the dearest object of his life might be obtained. They were pleased to see the good-looking young man at Hardriggs, as he descended from the fly and joined the pre-luncheon croquet-party on the lawn. He had been there very recently, it is true; but good-looking young men are always welcome in country-houses, where indeed a fresh face, a fresh voice, a few fresh ideas, are priceless. Miles threw a hurried glance over the croquet-players. Miss Lambert was not amongst them. They were all young people, who, after the first greeting, returned to their game and its necessary accompaniment of flirtation. But Dean Asprey was seated under a \"wide-spreading beech-tree,\" reading the Times, and he rose as he saw Miles approach, dropped the paper, and went to meet him. As the Dean approached, Miles could not help noticing his aristocratic appearance; could scarcely help smiling at the wonderful way in which the tailor had combined the fashionable and clerical element in his dress. \"How do you do, my dear Mr. Challoner?\" said Dean Asprey, in those bland mellifluous tones which had won so many hearts. \"So delighted to see you here again! With only one fear tempering my pleasure, and that is that--believing you to be alone? yes, that is so?--the fear that my dear old friend Lord Sandilands is indisposed? Say I\u0027m wrong, and set my fears at rest!\" \"I would gladly, Mr. Dean; but I cannot. Lord Sandilands has a sharp attack of the gout.\" \"Of the gout? Well, well, I can recollect John Borlase these--ah, no matter how many years; too many to trouble to recollect--and the gout was the last complaint one would have ascribed to him.\" \"Well, he has it tow, without a doubt. Dr. Bede of St. Leonards has seen him, and pronounced definitely in the matter. I have come over to ask Mrs. Bloxam, who is a very old friend of his, to go and see him.\" \"Ay, ay, indeed! Mrs. Bloxam--a very charming and estimable person, by the way, and apparently well versed in many questions which, for females at least, would be considered abstruse--Mrs. Bloxam is in great request just now. Her young charge Miss Lambert is also ill, and--\" \"Miss Lambert ill!\" cried Miles; \"what is the matter?\" \"O, nothing of any consequence, I believe,\" replied the Dean. (\"Charmingly ingenuous the youth of the present day,\" he said to himself: \"he has at once revealed the reason of his coming over here again so soon, without having the smallest idea that he has done so.\") \"Nothing of any consequence; a trifling indisposition, a migraine, a nichts, which in anyone else would be thought nothing of, but which in Miss Lambert is naturally regarded with special interest. You know her, of course. I mean know to appreciate her, rather than know in the mere ordinary sense of acquaintance?\" \"I--I--yes, O yes! I\u0027ve had, the pleasure of seeing Miss Lambert frequently in town, and think her--of course, most charming--You\u0027re sure there\u0027s nothing serious the matter with her, because Lord Sandilands, don\u0027t you know, is such an old friend of hers, and takes such interest, that--\" \"I know that perfectly, and would not dream of deceiving you for an instant. Some of us, I know, are suspected of doing evil that good may come,\" said the Dean, with a specially sweet smile; \"but it is a very dangerous doctrine, which I have always held in abhorrence. I see a servant passing the end of the lawn, and I suppose I may be considered sufficiently at home here to venture to give an order.--- James, would you be good enough to let Mrs. Bloxam know that Mr. Challoner is here, and would gladly speak with her? Thank you, very much.--And now, my dear Mr. Challoner, to return to our very interesting conversation. What were we talking about?\" \"You were mentioning that Miss Lambert was ill, and--\" \"Ay, to be sure, Miss Lambert! What a charming girl! what grace and beauty! what amiability! what unaffected-- And you have known her for some time? I can well understand her creating a great sensation in London. Such a mixture of beauty and talent is very rare, and naturally very impressive. What says Dryden?-- \u0027Old as I am, for ladies\u0027 love unfit, The power of beauty I remember yet.\u0027 What a charming couplet, is it not? And so, as you were saying, Miss Lambert is a great success in London society?\" \"Rather as you were saying, Mr. Dean,\" said Miles, with a feeble attempt at a smile,--he knew he should not see Gertrude, and the conversation was beginning to bore him,--\"though I can cordially indorse the remark. Miss Lambert made a complete conquest of everyone she met, including Lady Belwether, who is hastening towards us.--How do you do, Lady Belwether? I\u0027m sorry to learn I have left one sick friend to come to another.\" \"Our dear Grace is certainly better, my dear Mr. Challoner.--Dean, you will be glad to hear that.--Fancy my position, Mr. Challoner; the responsibility of having anyone like that in one\u0027s care, on whom so much might be said to hang, you know. Sir Giles was for telegraphing off at once to London for advice, but Grace would not have it. And she has proved to be right, as she always is, dear creature! She is much better, and she heard the message you brought, Mr. Challoner, about Mrs. Bloxam, and has not raised the least objection to her going. Indeed, so like her, sweet thing! she seems to have forgotten herself in anxiety about Lord Sandilands.\" \"I suppose, Lady Belwether, that there is not much chance of my seeing Miss Lambert?\" \"Seeing her? To-day? My dear sir, not the remotest chance in the world. I strictly forbade her thinking of leaving her room to-day; and when Mrs. Bloxam has gone away with you, I shall take her place at Grace\u0027s side.--You think I\u0027m right, Dean? The importance of such a case as this is--Exactly, I knew you\u0027d agree with me. What do you think Lady Hawksley said when she heard the darling was ill?\" \"Knowing Lady Hawksley,\" said the Dean, again with his pleasant smile, \"the field of speculation is too vast for me to attempt to enter on it. What did her ladyship remark?\" \"She said it must be a horrid bore for me; and what would Miss Lambert have done if she had been taken ill in the season, when she was singing. Did you ever hear such horrible things? But I told her that if Miss Lambert had been taken ill in town she would have had everybody\u0027s sympathy, from the Queen downwards; which is more than can be said of some people, I could not help adding.\" As the old lady finished speaking, Mrs. Bloxam appeared, and very shortly afterwards she and Miles took their leave, and started off for Hastings in the fly. Miles had rather looked forward to this drive in Mrs. Bloxam\u0027s company. The thought of it had afforded him some little consolation when he found that there was no chance of his seeing Grace. In default of the presence of the adored one it is the lover\u0027s greatest delight to find someone who will either talk about her, or will listen to his outspoken raptures. Miles thought that in Mrs. Bloxam he might possibly find both these virtues combined; and accordingly they had scarcely cleared the gates of the Hardriggs avenue before he began to ply his companion with a series of questions concerning Miss Lambert. These questions were artfully framed, and a less worldly-wise woman than Mrs. Bloxam might have been deceived as to their purport. But that worthy lady was not merely always perfectly cute and observant, but on this particular occasion she was, if possible, more than ever on her guard. Although during the previous day her fingers had been unremittingly engaged on her \"fancy-work\" during the entire period of Lord Sandilands\u0027 visit, her eyes had strayed now and then to the large looking-glass close by her, which reflected a window and a part of the garden beyond, leading to the lime-walk. In that looking-glass Mrs. Bloxam had seen her charge and Miles Challoner walking together, talking earnestly, and through the same medium Mrs. Bloxam had seen each of them return separately, and ill at ease. The ex-school-mistress had all her life been in the habit of putting two and two together, and arriving at the result with commendable quickness and accuracy, and her perspicacity did not fail her now. She felt certain that Miles had proposed, and that Gertrude had refused him, though she loved him; equally certain that Lord Sandilands was aware of a portion--she couldn\u0027t tell how much--of the real state of affairs, and that he had sent for her with the intention of discussing them with her; and Mrs. Bloxam very much deprecated the idea of any such discussion. She did not know where it might end, or what it might lead to; and there were passages in the life of her quondam pupil which Mrs. Bloxam had not thought it necessary to dilate upon, or indeed to introduce to Lord Sandilands\u0027 notice; and circumstances might render the further suppression of those passages impossible. So Mrs. Bloxam sat back in the fly and answered all Miles Challoner\u0027s questions in monosyllables, and was glad when, finding it impossible to extract anything from his companion, the young man lapsed into silence and left her to her own reflections, occupying himself with his. Neither were roseate-hued. The hope which had sprung up in Miles\u0027s breast as he journeyed to Hardriggs seemed suddenly to have paled and faded out--why he knew not. Grace was ill, to be sure, but the fact of her illness did not account for the sudden change in the aspect of his fortunes--did not account for that sinking of the heart, that depression, that avertissementof coming trouble which we have all of us experienced many times in our lives, and which just then was settling down in thick black clouds over Miles Challoner. And Mrs. Bloxam\u0027s reflections were sombre and unpleasant. What Mr. Browning calls \"the conscience-prick and the memory-smart\" were beginning to tell upon her; she had lost the power of self-possession, and the faculty of lying--at least of lying in that superior manner which she had once possessed--had deserted her. So they drove along in silence, and the holiday excursionists to Fairlight had more fun out of them and much openly-expressed chaff, opining how that \"his mother had found him out courtin\u0027 the gal, and had fetched him away;\" how that \"he\u0027d married the old woman for her money, and found out his mistake.\" But when they arrived at Robertson\u0027s-terrace, they found that Lord Sandilands had experienced a renewal of his attack, and that Dr. Bede had expressed a strong desire that his patient should be left perfectly quiet and undisturbed. To this, however, Lord Sandilands would not agree, and, pursuant to his orders, Mrs. Bloxam was shown to his room immediately after her arrival. She found the old nobleman faint and weak, just recovering from a sharp bout of pain. The sight of her seemed to rouse and please him. He asked her a few unimportant questions about the people at Hardriggs, seemed difficult to convince that Gertrude\u0027s indisposition was only of a temporary character, spoke in a manner that was anything but cheerful or reassuring about his own health, and remained so long flying round the real matter at his heart, that Mrs. Bloxam began to think he would never settle on it. At length, when the landlady of the lodgings had left the room and they were alone, Lord Sandilands said: \"Our acquaintance dates so far back, Mrs. Bloxam, and has been of such a character, that there need be no reticence on either side.\" Mrs. Bloxam winced at his words, and moved uneasily on the chair which she had taken by the sick man\u0027s bedside. But she was sufficient mistress of herself to bow and utter a few polite commonplaces. \"I could not get an opportunity of speaking to you yesterday,\" continued his lordship; \"but I know how generally observant you are, and I am sure you cannot have failed to remark that my visit to Hardriggs with my young protégé--for so I must regard Mr. Challoner--was not a mere ceremonious call. There is no need in disguising from you--if indeed you do not know it already--that he is desperately in love with Gertrude. It will further tend to place us in our proper position if I tell you plainly, and without reserve, that Mr. Challoner yesterday proposed to Gertrude, and--was rejected.\" If Mrs. Bloxam had seen all plain-sailing before her it is probable that she would have professed the liveliest astonishment, the greatest stupefaction, at this statement. But as she knew that she should have to wind her course through very doubtful channels, and would require all her skill to avoid shoals and contest storms, she thought it better to rely upon Lord Burleigh\u0027s plan, and content herself with a nod. This nod Lord Sandilands took to mean acquiescence. \"You did comprehend all that?\" he asked. \"I was only doing justice to the acuteness which I have always ascribed to you when I imagined such was the case. Now we come to the more serious part of the question. Why did Gertrude refuse that young man\u0027s offer? Not that she did not, does not, love him? I\u0027m an old fellow now, but I\u0027m not old enough to have forgotten entirely that pleasant mute language; and if woman\u0027s looks and woman\u0027s ways are the same as they were thirty years since, Gertrude is decidedly in love with Miles Challoner. You have not had many opportunities of seeing them together, and therefore cannot judge so well. But I knowit. Why did she reject him, then? Why, ma\u0027am, because, thank God, she inherits a certain proper pride; and she felt that she, an unknown woman--unknown so far as family and friends are concerned, and with a precarious income dependent on her health and strength--was not going to permit a member of an old county family to enter into what might be thought a mésalliancefor her.\" \"Very proper,\" murmured Mrs. Bloxam, having nothing else to say. \"Exactly; very proper, under circumstances. But those circumstances must be changed; they must be no longer permitted to exist. It must be my care, Mrs. Bloxam,\" continued Lord Sandilands, with additional gravity, \"as it is my duty yes, my bounden duty--to endow that young lady with such means that she can freely and frankly give herself to the man she loves; without any obligation on either side.\" \"But to do that, my lord, you must acknowledge your relationship to Gertrude?\" \"I have made up my mind to that already, Mrs. Bloxam,\" said the old gentleman; \"I have a sort of idea that I sha\u0027n\u0027t get over this attack, and that is a reparation which must be made before I die. O, not that I\u0027m going to die just now,\" he added, as he saw her face change; \"but still--\" \"Don\u0027t you think you should have a nurse, my lord,--someone more accustomed to illness, and more able to devote herself entirely to your service, than the landlady here? If I could be of any use--\" \"A thousand thanks, Mrs. Bloxam. But I have telegraphed to town for my housekeeper--ah, I forgot you have not seen her; she has only recently come to me, but seems a clear-headed, sensible woman--and she will come down and nurse me. I am a little faint just now, Mrs. Bloxam, and must ask you to leave me for the present. I will speak again to you on that subject before you and Gertrude leave Hardriggs.\" Mrs. Bloxam left the room with sentiments of a very unpleasant kind. Lord Sandilands thought it was the want of fortune that induced Gertrude to refuse Miles Challoner. But what about her relations with Mr. Gilbert Lloyd, of which his lordship was totally unaware? \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3311/90520.html","bookId":405,"book":{"id":405,"title":"The Rock Ahead.","description":"简介： Hot in Brighton, very hot. The August sun reflected off white-chalk cliff and red-brick pavement, and the sea shining and sparkling like a sapphire; the statue of George the Fourth, in its robe of verdigris, looking on in blighted perspiration at the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3311","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
