{"id":25498,"no":5,"title":"CHAPTER IV. Settled.","content":"The Vale House, Hampstead, was admirably suited in point of size and situation for a boarding-school or \"establishment\" for young ladies. It stood in its own grounds, which, though not really extensive, had been made the most of, and contrived to look as if there were a great deal more of them than there really was; and it commanded an extensive prospect from the upper windows, well elevated above the jealous walls which guarded the youth and beauty committed to Mrs. Bloxam\u0027s charge from contact with the outer world. Occasionally, or at least in one instance, as will presently appear, the security had not been altogether so inviolable as might have been desired; but, on the whole, the \"establishment\" at Vale House maintained and deserved a high character. A heavy, square, roomy, red-brick mansion, with its windows cased in white stone, and a coat-of-arms sculptured in the same material, but now nearly undecipherable, inserted over the heavy mahogany hall-door,--the Vale House belonged to a period of architecture when contract-building was unknown, when the art of \"running-up\" houses was yet undiscovered, and a family mansion among the middle-classes meant a house in which fathers and sons and grandsons intended to live and die, unbeguiled by \"splendid opportunities\" into constant migrations and rapid changes in their style and manner of living. The Vale House had, however, suffered from the changes and innovations of the age; and the grandson of its last hereditary inhabitant now dwelt in splendour in a west-end \"place,\" forming an \"annexe\" to a square of ultra-fashionable pretensions and performances, and looked and spoke as though he had never even heard the name of a locality more northern or more distant from the centre of civilisation than the Marble Arch. If the Townleys were oblivious of the Vale House, so was the Vale House of them. Except among such of the inhabitants of Hampstead as were careful and religious conservators of tradition, the origin and history of the Vale House had been forgotten; and a general notion prevailed that it had always been a school. The pupils--with the exception of such as were of a romantic turn of mind and given to the association of all old houses having plenty of room in them with the Orphan of the Forest and the Children of the Abbey--hated the place, and believed that it must always have witnessed the incarceration of unoffending girlhood. The ancient and much-effaced armorial bearings awakened no compassionate respect in the minds of these haughty young creatures, but rather a lively scorn. \"Old Bloxam was only a sea-captain, and she was a governess in some old lord\u0027s family, and they set her up in the school, and she gives herself airs as if she was a lady,\" they would remark, under the influence of irritation, arising from causes gastronomic or otherwise; and the caricaturing of these armorial bearings was a favourite jeu d\u0027esprit among the livelier and cleverer section of Mrs. Bloxam\u0027s pupils. The school at the Vale House had--been of late years a very prosperous undertaking. Mrs. Bloxam\u0027s connection was among the rich and respectable mercantile community, not the shop-keeping, be it known: she observed with the utmost strictness the distinction between wholesale and retail trades, and especially affected the learned professions. In Gertrude\u0027s time, two daughters of a Scotch baronet had effectively represented the real aristocracy; but they were \"finished\" long since, and had returned to the land of their birth, having learned to braid their sandy locks, and to tone down their hereditary freckles, and equally hereditary accents, to the admiration of all Glen Houlaghan. The real aristocracy was quite unrepresented at the Vale House, but the \"British-merchant\" element flourished there. Mrs. Bloxam had prospered of late years, and was now in circumstances which permitted her to contemplate retiring from the labours of school-keeping,--in which she had never pretended to herself to find a congenial occupation,--as a not impossible, indeed not even a very remote, contingency. Mrs. Bloxam was not at all like the conventional schoolmistress; she as little resembled the Pinkerton as the Monflathers type; and despite the contemptuous comments of her pupils was very ladylike indeed, both in appearance and manners. She was a tall slight woman, very fair of hair and complexion, with blue eyes, which were a little hard in expression, and a little shifty; with an inexpressive mouth, a graceful figure, and a good deal of character and decision in her voice, gestures, and movements. She had purchased the Vale House from its former proprietor, a distant relative of her own and, like herself, a schoolmistress, on highly advantageous terms, when she was a new-made widow, and a very young woman; and now she hoped, after a year or two, to dispose of it on terms by no means so advantageous to the purchaser. But this hope Mrs. Bloxam had not spoken of to anyone. She was of silent and secretive temperament, and liked to make up her mind completely, and in every detail, to any plan of action which she contemplated before making it known to any friend or acquaintance. Her man of business was Mrs. Bloxam\u0027s sole confidant, and even he knew no more of her affairs than was indispensable to their safe and profitable conduct. Mr. Dexter would have been as ignorant as any mere acquaintance of Mrs. Bloxam\u0027s--as any of the young girls asleep in the white beds, standing in long ranges in the \"lofty and well-ventilated dormitories\" which formed so important a feature in the prospectus that eloquently set forth the advantages of the Vale House \"establishment\"--of the nature of the contents of a bundle of letters which Mrs. Bloxam set herself to peruse, late on the same evening on which Gertrude Lloyd\u0027s letter reached her well-shaped hands. Only one individual in the world besides Mrs. Bloxam knew that the letters which she was now engaged in reading had ever been written; and their writer would probably have been surprised--as they did not contain any guarantees for the payment of money--had he known that they were still in existence. Gertrude\u0027s letter had reached Mrs. Bloxam just at the hour at which the concluding ceremonial of the school-day routine was about to be performed. She laid it aside until prayers and the formal leave-taking for the night insisted upon at the Vale House as essential to the due inculcation of good breeding had been gone through; and then, in the welcome retirement and solitude of her own sitting-room, seated before her own particular bureau, and with her own particular supper in tempting perspective, Mrs. Bloxam read, not without sympathy mingling with her astonishment, the letter of her quondam pupil. Mrs. Bloxam read the letter once and laid it down, and thought very profoundly for some minutes. Then she took it up and read it again, and once more fell into a fit of musing. The bureau before which she had seated herself had a number of small drawers at the side. One of these Mrs. Bloxam opened, and selected from among its neatly-arranged contents a packet, tied with green ribbon and docketed: \"Lord S--, from 185- to 186-.\" The parcel contained twenty letters, and Mrs. Bloxam read them all through. The task did not occupy much time; the writing was large and clear, her sight was strong and quick. When she had read the letters, she replaced them in the order which she had temporarily disturbed, retied the packet, and locked it away in the drawer whence she had taken it. Then she arranged a sheet of paper on the blotting-pad before her, took up a pen, and began to write with a rapid hand what was evidently intended to be a long letter. But in the middle of the third page Mrs. Bloxam changed her mind. \"Safer not, better not,\" she muttered to herself; \"the written letter remains. Witness these;\" and she inclined her pen-handle towards the drawer in which she had just replaced the packet of letters; \"time will show whether she had better know, or not know.\" Then Mrs. Bloxam tore the sheet, the third page of which she had begun to write on, into fragments sufficiently minute to defy the curiosity and the ingenuity of the most prying and ingenious of housemaids, and replaced it by another, on which she wrote the following words: \"The Vale House, Hampstead. \"Tuesday night. \"My Dear Gertrude,--I have your letter. I accede to your request, and will make arrangements in reference to the proposal which you have submitted to me. None of the girls now here have any recollection of you. There are several younger members of the families whose older girls were here; but your change of name prevents that being of any consequence. The servants were all changed at the Easter Term. Let me know when it will suit you to come here; and believe me yours sincerely, \"Elinor Bloxam. When she had read this brief note over, addressed it to Miss Grace Lambert, and placed it in the appointed spot for all letters to be despatched by the morning post, Mrs. Bloxam sat down to her solitary supper with a well-satisfied expression of counten. It was nearly eleven years since Gertrude Keith, a handsome, intelligent, and self-willed child of eight years old, had been confided to the care of Mrs. Bloxam and the advantages, educational and otherwise, of the Vale House. The letters which Mrs. Bloxam had read, that summer night, formed the greater part of all the correspondence which had--been addressed to her by the individual who had placed the child under her protection, and whose confidence Mrs. Bloxam had won, and to a certain extent undeniably deserved. It had been stipulated that Gertrude Keith was to be kept in ignorance of her parentage, and of the circumstances under which she had been placed in Mrs. Bloxam\u0027s establishment; and this condition the schoolmistress had conscientiously observed. Gertrude knew nothing of her own origin. She was believed by her companions, and she believed herself, to be an orphan girl, without any living relatives. Gertrude Keith was the natural daughter of Lord Sandilands, a nobleman whose wild youth had given place to a correct and irreproachable middle age, which stage of life he had now passed, and was beginning the downward descent. He had placed the child under the care of Mrs. Bloxam, who had been formerly a governess in the family of his sister, Lady Marchmont, and who retained the confidence and regard of her former employers, after she had made the adventurous and unsuccessful experiment of matrimony. Certain circumstances connected with the little girl\u0027s birth and the early death of her ill-starred mother made Lord Sandilands shrink from seeing her, with strange and strong aversion; and one of the conditions to which he had required Mrs. Bloxam\u0027s consent and adherence was, that his name was never to be spoken to the child, and that, except in the event of her illness or death, he was to be spared all communications respecting her, except at certain stated intervals. These conditions had been scrupulously observed; and Gertrude\u0027s childhood had been as happy as any childhood passed under such exceptional conditions could be. She was a handsome, healthy, brave, independent-spirited child, who did not give much trouble, and who held her own against the envy, hatred, malice, and all uncharitableness of that world in miniature--a girls\u0027 boarding-school. As for Mrs. Bloxam, she liked the handsome, sturdy child, and she liked the stylish graceful girl, who developed herself so rapidly from that promising childhood. Then Gertrude was not a troublesome, while she was a very lucrative, pupil; and there was an agreeable certainty about the very liberal payments made on her account by Lord Sandilands, and an equally agreeable uncertainty about the period of the girl\u0027s removal from the Vale House, which formed an exception to the rule in general cases; and Mrs. Bloxam highly appreciated both these advantages. A portion of the correspondence which Mrs. Bloxam had read on the evening on which she had received Gertrude\u0027s letter referred to the time when she should have attained to womanhood, and her schooldays should be over. It was Lord Sandilands\u0027 wish that the arrangement made for her in her childhood should continue; that Mrs. Bloxam should act as her protectress; that the girl should remain with her, until she should feel indisposed to stay at the Vale House any longer, or should decide upon some manner of life for herself. \"In any of these cases,\" said Gertrude\u0027s unknown father in one of his letters, \"on your communicating the facts to me, I will make the best arrangement for Gertrude within my power.\" It was not very long after this had been written, though much before the time at which either her father or Mrs. Bloxam had contemplated the probability of any change in Gertrude\u0027s life, or of the girl\u0027s taking her destiny into her own hands, that an accident made her acquainted with Gilbert Lloyd. She had not shared any of the early romance and follies of her companions: the \"young gentlemen\" of Dr. Waggle\u0027s \"establishment\" had had no charm, singly or collectively, for her; the doctor, the chemist, the music and drawing masters, even the Italian signor, who made singing-lessons a delight, and was so fascinating, though he used his hair-brush sparingly, and his nail-brush not at all,--each and all were perfectly without attraction or danger for the young girl, who seemed to ignore or despise all the petty flirtations and manoeuvrings of her schoolfellows. Of and for not one of the young girls under her care head Mrs. Bloxam less fear or anxiety. Gertrude was proud and stately, and though tall for her seventeen years, and firm as well as graceful of outline, and though she had made fair progress with her education, and in her musical studies was notably in the van, there was something childlike about her still, something which kept Mrs. Bloxam in a happy condition of unsuspecting tranquillity. But all Gertrude Keith\u0027s childlike peace and passionless calm vanished when she met Gilbert Lloyd, at a house where Mrs. Bloxam was in the habit of visiting during the vacations, and whither she brought Gertrude, in order to avoid leaving her to the portentous solitude of the Vale House, in the absence of her companions. The girl fell in love with the young man--who paid her quiet, stealthy, underhand attentions--with a suddenness and a vehemence which would have alarmed anyone who loved her, for the future of a woman endowed with so imaginative, sensitive, and passionate a nature. All the dormant romance, of which no one had suspected the existence in Gertrude\u0027s nature, whose awakening no one perceived, when the time came was aroused into force and action, and the girl was transformed. Now was the time at which the instinct, the care, the love, the caution of a mother, would have been needed to guide, direct, and save Gertrude from her own undisciplined fancy, from her own untaught impulses. But Gertrude had no such aid extended to her. Mrs. Bloxam, a good woman in her way, and of more than average intelligence, had no feelings towards the girl which even bordered on the maternal; and the habitual authority of the schoolmistress was naturally in some degree abrogated by the fact that it was vacation-time. She was not of a very confiding or unsuspicious disposition; but she had, unconsciously to herself, to deal in Gilbert Lloyd with one who knew well how to lull suspicion, and he in his turn found an apt pupil in Gertrude. They met again and again; the girl\u0027s beauty, freshness, and daring had a strong charm for a man like Lloyd; and for the first time since he had had to calculate life\u0027s chances closely, and to rely upon himself for the indulgences and luxuries which alone made life worth having to a man of his temperament, he committed the blunder of gratifying feeling at the expense of prudence. He did not fall in love with Gertrude quite so precipitately or so violently as she fell in love with him, but the second meeting did for him what the first had done for her; and in Gilbert Lloyd\u0027s case, to form a desire was to resolve to achieve it, at whatever cost to others, at whatever sacrifice of personal honour, provided it did not entail public disgrace, such gratification might necessitate or involve. The vacation enjoyed by the pupils, and not less enjoyed by the proprietor, of the Vale House, was within three days of its expiration, when a housemaid belonging to the establishment reported Miss Gertrude Keith \"missing;\" and the search and anxiety consequent on the intelligence were terminated by a letter from the fugitive, informing Mrs. Bloxam that she had been married that morning to Gilbert Lloyd by special license, and was then about to start for a short continental excursion. Mrs. Bloxam was very much shocked, and very much annoyed, in the first place, that the event should have happened at all; in the second, that Gilbert Lloyd, of whom she knew something, and cordially disapproved what she did know, should be the hero of an affair certain to bring her into discredit with Lord Sandilands, and likely, if she did not contrive to hide it very skilfully, to bring her school into discredit with the public. She had no doubt as to the veracity of Gertrude\u0027s story, no doubt that Lloyd had really married her--a copy of the certificate of the marriage was enclosed in her letter; but she bitterly regretted her own blindness and negligence, and, to do her justice, felt not a little for the girl\u0027s probable fate. Mrs. Bloxam rapidly perceived the advantage to be derived from the circumstance that the untoward event of Gertrude\u0027s elopement had taken place during the vacation. She summoned all the servants, informed them that Miss Keith had left the Vale House under certain unpleasant circumstances which it was not necessary to explain; that any indiscreet reference to the circumstance made to the other pupils on the reassembling of the school would be visited by condign punishment in the forfeiture of the offender\u0027s place; and then dismissed them, to assemble downstairs in their own domain and learn all the particulars from the housemaid, who was in Gertrude\u0027s confidence, and had been liberally bribed by Gilbert Lloyd to facilitate and connive at all the preliminary meetings which had resulted in the elopement. To this proceeding succeeded a period of reflection on the part of Mrs. Bloxam. Should she inform Lord Sandilands of the events that had taken place? Should she tell him how much sooner than she had calculated upon, Gertrude had taken the decision of her fate into her own hands? Should she tell him that the time to which she had looked forward as an eventuality, which might come about in a couple of years, had already taken place, and that now was the opportunity for fulfilling the intentions which he had continuously, if vaguely, expressed in his letters to her? Mrs. Bloxam debated this question with herself, and self-interest loudly and persistently advised her to silence. Lord Sandilands had never seen the girl, had never even hinted at seeing her, had indeed distinctly disclaimed any intention of ever seeing her. Nothing could be more improbable than that he should find out what had occurred. If she should continue to apply to his solicitor for the money which he was authorised to pay her at certain intervals, no suspicion of any change in the state of affairs could arise. And the money would be very welcome to her. By resorting to the simple expedient of holding her tongue, she might avoid scandal, avoid doing herself the injury which she most necessarily inflict upon her school by the admission of an elopement having taken place from within its walls, and secure a sum of money which would be both useful and agreeable. To be sure, the day of reckoning must come, but not yet; and if ever she should have it in her power to do any service or kindness to the poor misguided girl, who would certainly inevitably come, or she (Mrs. Bloxam) was much mistaken in Gilbert Lloyd, to need service and kindness before much time should have gone over her, she pledged herself, to herself, to show her all the kindness in her power, unreservedly and heartily. Thus did Mrs. Bloxam make the devil\u0027s bargain with herself; and very successfully did she pursue the line of conduct which she had determined to follow, from the period of Gertrude Keith\u0027s elopement to that evening on which she had received the no-longer-deluded girl\u0027s letter, two years and a half later. With the fatal facility which results from impunity, Mrs. Bloxam had almost ceased to remember Gertrude, and had quite ceased to feel uneasiness regarding the concealment she had practised towards Lord Sandilands, and the appropriation of the sum of money which he paid to her yearly. But with the perusal of Gertrude\u0027s letter the subject again arose in her mind, and, as was Mrs. Bloxam\u0027s habit, she faced it steadily and considered it maturely. Gertrude\u0027s proposition was not an entirely pleasing one. There was a certain responsibility attaching to assuming the charge of a young woman so strangely situated; and the present acceptation of the trust might involve Mrs. Bloxam in difficulties and dilemmas to which she was by no means blind or insensible. But, on the other hand, she saw in Gertrude\u0027s return a perfect security against the divulgement of her decidedly unpleasant secret. Should Lord Sandilands now make any inquiry about Gertrude, she should experience no difficulty in satisfying him or any representative he might send. Even should the change of name become known-a contingency which a little well-timed manoeuvring might prevent--Mrs. Bloxam could afford to trust to her own ingenuity to find a reason for that proceeding which should satisfy all querists. Gertrude\u0027s own interest and safety were now concerned in preserving the secret of her elopement, her marriage, and the duration of her absence from the Vale House; while the offer of her services as teacher to the junior classes was sufficiently valuable to leave Mrs. Bloxam still a gainer to the full extent of the annual stipend, even when Gertrude\u0027s maintenance and needful expenses should be taken into account--a calculation which Mrs. Bloxam made very accurately and minutely, and which was very much in her line. The result of the cogitations to which Mrs. Bloxam gave herself up after she had read Gertrude\u0027s letter has already appeared. On the following day she received from Mrs. Lloyd a few brief lines of acknowledgment and thanks; and the Saturday of the week which had begun with the death of Harvey Gore and the final parting between Gilbert Lloyd and his young wife witnessed the installation of a new inmate, holding an anomalous position--partly parlour-boarder and partly pupil-teacher--at the Vale House. This new inmate was known to her companions and pupils, in short to all concerned, as Miss Grace Lambert. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3311/90501.html","bookId":405,"book":{"id":405,"title":"The Rock Ahead.","description":"简介： Hot in Brighton, very hot. The August sun reflected off white-chalk cliff and red-brick pavement, and the sea shining and sparkling like a sapphire; the statue of George the Fourth, in its robe of verdigris, looking on in blighted perspiration at the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3311","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
