{"id":25592,"no":33,"title":"CHAPTER VII MISS MERLIN","content":"At length, by our joint efforts, the basket was extricated and placed upon its—what shall I say?—on its right end, in the landing. The pretty maid smoothed her hair and adjusted her collar, somewhat creased by her exertions. I made an effort to recover the usual dignity of my demeanour, conscious that I was, to a certain extent, in a false position, yet resolved to make the best of it. \n \n “Thank you,” said I, somewhat bashfully, as well as breathlessly. \n \n “Thank you, sir,” said Justine; laughing, I thought, rather roguishly. \n \n “Dear! how you’ve rumpled your collar,” I observed, with perfect innocence. Justine glanced reproachfully in my face, as she smoothed the collar down with a remarkably pretty hand, and, tilting the offending basket on the bannisters, paused for a space, as if to “get her wind” before proceeding any further. In a few minutes the process would be accomplished, and Justine would take wing and fly away. I should never have such an opportunity again—at least not for a considerable period. The basket, in all probability, contained articles of wearing apparel, either going to or coming from the wash. Without being a family man, I was aware such an occurrence did not usually take place more than once a week. I should have another seven days to wait before so favourable an opportunity would arise again. Stimulated by this reflection I accosted Justine with considerable energy. I am not sure that I did not take her by the hand. \n \n “Can I speak a word with you, mademoiselle?” said I, in trembling tones. I do not know why I called her Mademoiselle, except that I was flurried and eager, and inclined to be supremely polite. \n \n “Not now, sir,” replied Justine, sinking her voice, to my great alarm, incontinently to a whisper. “Some other time, Mr. Softly” (she had got my name already): “not now, sir, pray. I hear somebody coming!” \n \n “It’s only a question or two I want to ask,” I urged, as soothingly and reassuringly as I could; for, in truth, had there been fifty “somebodies coming,” there was nothing to be alarmed at. “Something you can tell me about—about your mistress.” I bounced it out, thinking it better we should understand each other at once. \n \n “Oh!” replied Justine, this time in a perfectly audible voice. “And what may you please to want to know, Mr. Softly, about my lady?” \n \n “I want to know everything about her,” said I; slipping, at the same time, a little profile of her Majesty, raised in gold, into Justine’s hand, which delicate compliment was acknowledged by the least perceptible squeeze. “When did she arrive? When is she going away again? Where did she come from? Where does she live when she is at home? Is she young or middle-aged? Of course she’s very beautiful, or she couldn’t afford to take about with her such a pretty maid as you!” \n \n The latter clause of my sentence I considered, not without reason, a master-stroke of diplomacy, and I strove to enhance its effect by again possessing myself of Justine’s hand; a man?uvre she neutralised by placing both her own in her apron-pockets, leaving the basket to take care of itself. \n \n “Why, ain’t you a hunting gentleman?” asked she, in her turn, somewhat inconsequently, as I thought. “I made sure you was a hunting gentleman, by your broken bones; and I thought every hunting gentleman knew my lady. She’s just come from the Castle—my lady. She’ll stay here exactly as long as suits her fancy, and not a moment longer. Bless you, Mr. Softly, we might never stir a foot from here this side of Easter; and we might be off, bag and baggage, first thing to-morrow morning. She’s a quiet lady, mine: a quieter lady than Miss Merlin I never wish to dress and do for; but when she says a thing, she means it, Mr. Softly, and horses couldn’t draw her the way she hasn’t a mind to go.” \n \n “And is she so very beautiful?” I inquired, determined to know the worst of this Amazon at once. Justine looked up from under her long eyelashes (she was a very pretty girl—this Justine), and shook her head, and smiled. \n \n “That depends upon taste, Mr. Softly,” replied she, shooting such a glance at me the while, as I have no doubt had often done irreparable injury amongst her adorers. \n \n “Some gentlemen doesn’t admire such a pale grave lady with dark eyes and hair. She’s a slight figure, too, has Miss Merlin; and, for as tall as she is, her waist is as small as mine. For goodness’ sake, Mr. Softly, here’s the waiter coming along the passage!” and without giving me any more information as to the size of Miss Merlin’s waist, or further opportunity of measuring her own, Justine darted up the staircase, and was soon lost in the sacred retreat of her mistress’s apartment. \n \n I am no busy-body, I humbly trust and believe. It is not my way ever to inquire into the affairs of other people; and when any obliging friend wishes to make me the depository of some secret which is growing too heavy for his own shoulders, I invariably beg that he will keep it to himself. There is no such false position, as to be told an awful mystery under oath of inviolable silence, which you feel sure has been administered with the same injunctions to some half-dozen others besides yourself. One of these lets it out; perhaps all six of them make it their everyday conversation; and you, the only trustworthy person of the lot, sustain all the blame of having divulged a circumstance which you have kept silent as the grave, or even forgotten altogether. I need not, therefore, say that it is not my custom to waylay waiting-maids, nor to set every engine in my power in motion to discover the antecedents of such ladies as may happen to occupy the same hostelry with myself. But there was something about this new arrival that interested and excited me in spite of my better judgment. It was like being in the same house with a ghost. A man may not like ghosts, or he may disbelieve in them, or, worse still, he may have an invincible terror of these apparitions; and although he laughs and jeers at such matters by a crowded fireside on a Christmas eve, he may quail and shudder in his cold sheets at the dead of night, when he lies awake, thinking of all the horrors he has ever heard and read; fancying, as people will fancy in the dark, that he hears sighs at the door, footsteps in the passage, and something moving softly and stealthily about the room. But whether he be a courageous infidel, or a superstitious believer in the possibility of apparitions, only tell him there is a phantom belonging to the establishment, and the man becomes restless and uncomfortable forthwith. You will find him poking about the attics and offices by day and night. When you are snoring healthily in your first sleep, he will be shivering in his dressing-gown, to discover the spirit or the impostor; and it is probable that in his character of detective he will alarm more of the inhabitants of the mansion in a week than the old established and considerate ghost itself has done in a century. \n \n Well, Miss Merlin was rapidly becoming my ghost. I felt a morbid desire to find out all about her. I could not rest in ignorance of the appearance, the character, and the antecedents of a lady who in her own person involved such interesting contradictions as this mysterious dame—tall, pale, and slight; with a waist as small as Justine’s, and that was certainly an extremely taper one; with a will of iron (not that there was anything unusual in THAT), and four such horses as I never saw together in one stable before. Then she was a devoted student; for had not Miss Lushington taxed her with read, read, reading all day long? Probably she was blue; possibly she might be an authoress, and I adore intellectual women! I can never see why ignorance is supposed by some men to be such an attraction in the other sex. The Tree of Knowledge is not necessarily the Tree of Evil; and, for my part, I think the more they know the better. What can be more graceful than a woman’s way of imparting her information?—the deprecating air with which she produces it, as it were, under protest, and the charming humility with which she accepts her victory when she has beaten you in argument, and swamped you with rhetoric? Oh! if Miss Merlin should turn out literary, it would be all over with me! In the meantime, how was I to find out something definite about her, before I committed myself in a personal interview? \n \n As I revolved this question in my mind, I bethought me of a club acquaintance of mine—indeed I think I may almost call him a friend—whose speciality it is to know all about everybody who floats on the surface of society, not only in London, where he resides, but also in the different counties of England, and most of the fashionable watering-places abroad. Where and how he acquires his information is to me a matter of the darkest mystery, inasmuch as I never entered “The Hat and Umbrella” in my life, without finding him making use of that commodious club; and I have been informed by other members, that with the exception of Christmas-Day—a festival which, in his dislike of congratulations, I am giving to understand he always spends in bed—he may be seen seven times a week in his accustomed arm-chair during the afternoon, and at his accustomed table when the dining-hour arrives. However, he is a man of universal information, a walking edition of “Who’s Who?” in any year of the century. And to Quizby accordingly I resolved to write, begging him at his earliest convenience to give me all the particulars he could about Miss Merlin, stating also that we were occupying the same hotel, but wording by communication with the delicacy imperatively demanded by such topics. I hope none of my friends may ever have cause to say, but that “Softly is a confoundedly guarded fellow about women, you know!” \n \n Pending my friend’s reply, it may easily be believed that I waited with no small anxiety and impatience, none the less that the fact of my being under the same roof with Miss Merlin gave me no more access to her society, no more information regarding her movements, than if we had been on different continents. The very first morning after her arrival she was off to hunt before I was out of bed, and returned so quietly as to frustrate my insidious intentions of waylaying her in the passage. Justine too, either taken to task by her mistress, or on some definite calculations of her own, avoided my presence altogether, and never gave me an opportunity of exchanging a syllable with her. Miss Lushington, whom I boldly confronted in her own dominions, was obviously on her high horse, and ill at ease. There could be no question but that, notwithstanding her simple and retiring habits, in accordance with the strict seclusion in which she lived, Miss Merlin’s arrival had completely altered the tone and destroyed the cordiality of the whole establishment. \n \n True to his post, my letter must have found Quizby at the “Hat and Umbrella,” for within eight-and-forty hours of its dispatch, I received his answer; written of course on Club paper, and sealed with our handsome Club seal—a beautiful device formed of the domestic insignia from which we take our name. I opened it eagerly, and after a few commonplace lines of inquiry and gossip, I arrived, so to speak, at the marrow of its contents. \n \n “You could not have applied, my dear Softly,” said my correspondent, “to any man in London better qualified to give you the information you require. Not only have I known Miss Merlin almost from childhood, but it was my lot in early life, when the heart is fresh and the feelings susceptible, to be by no means insensible to her charms. You ask me whether she is good-looking; and this, did I not know your extreme diffidence and scrupulous delicacy of feeling, would seem a strange question from one who is under the same roof with its object. Beauty is a matter of opinion. I need scarcely say that many years ago I thought her ‘beautiful exceedingly.’ She was then a tall pale girl, with the most thorough-bred head and neck you ever saw, with the grace and elasticity of a nymph, combined with the dignity of an empress. So haughty a young woman it has never been my fate to come across. She had full dark eyes, and very silky dark hair; regular features of the severe classical type, and the sad mournful expression, that had a great effect on me at that period. I need not be ashamed to confess it, whilst I remained an eleven-stone man I was romantic; but, like many others, increasing weight has brought with it, I trust, increasing wisdom, and I have not the slightest doubt myself that adipose matter conduces vastly to a proper equilibrium of the mind. I thought otherwise once, and Miss Merlin’s dark eyes would have led me to follow her to the end of the world—nay, even over those ghastly fences, which then, as now, it seemed to be her greatest delight to ‘negotiate,’ as I think you hunting men call it in your extraordinary vernacular. She had a wonderfully graceful figure too, as a young thing, and the narrowest, most flexible hands and feet you ever beheld. I have waltzed with her many a time—moi qui vous parle; and to think of the delicious swing with which she went down a room to the strains of Jullien and K?nig, the musical wonders of our day, almost makes me feel as if I could waltz again. When she bridled her taper neck, and put one little foot forward from beneath her draperies, she looked like a filly just going to start for the Oaks. \n \n “I have been thus particular in describing her, because they tell me she is very much aged and altered now; so that, whenever you do see her, you can judge for yourself of the difference between the Miss Merlin of to-day, and the damsel of a good many years ago, who made such an example of your old friend. \n \n “But I never had a chance with her—never! She was a singular girl, not the least like most of her own age and sex. Her mother was dead; and she lived and kept house for her father, an old clergyman of eccentric habits and extraordinary learning. Being an only child, she was accustomed to have her own way from the first; and as her father never interfered in the household arrangements, and indeed seldom came out of his study upon any provocation, she had the whole management of the establishment, and conducted it with the decision and prudence of a woman of forty. To this I partly attribute her extraordinary self-reliance and self-control. She was attached to her father, and studied with him several hours a day. At the period when we used to dance together, I think Miss Merlin was as thorough a Greek scholar as any University don I know. She was a proficient in several modern languages, and my own impression is that mathematics and algebra were as completely at her fingers’-ends, as worsted-work and crochet-knitting are to the generality of her sex. Studying hard at the Parsonage, her only relaxation was to hunt. I have already said she did exactly what she pleased; and her father, though a clergyman, was a rich man, and though a rich man a liberal one. Consequently Miss Fanny, as she was called then, was allowed to keep a couple of horses for her own use, and very good ones she took care they should be. At eighteen there was not a sportsman with the X.Y.Z. that cared to follow Fanny Merlin in a quick thing over the Vale, where the fences were largest, and the Swimley twisted and twined about, like the silver lace on a green volunteer uniform, never less than eighteen feet from bank to bank. I always hated hunting, I honestly acknowledge it; but oh! the duckings I have had in that accursed Swimley, following the flutter of her riding-habit, that I would have followed, if necessary, across the Styx. The girl never looked back either, which was sufficiently provoking. No; she rode on, always in the same calm business-like manner, perfectly quiet, and perfectly straight. She cured me of following her, though, after a time; for I found it safer and easier to skirt a little, with the generality of the other sportsmen, so as to come in somewhere at the finish, and take my chance of riding with her part of the way home. \n \n “It was hard that such devotion as mine should not have met with better success. You, my dear Softly, who are fond of that uncomfortable diversion which men call hunting, can scarcely appreciate what I had to undergo; but when I tell you that in addition to unintermitting agitation of mind, I suffered from constant abrasion of body, you will pity, though you cannot sympathise with, my distress. Apprehension, amounting to actual funk, is a disagreeable sensation enough; but to be partially flayed alive, and that on portions of the person called into daily use by a man of sedentary habits, amounts to a cruel and unbearable infliction. I wonder whether she ever pitied me! I am inclined to think she scarcely thought about me at all. \n \n “At one time, however, our acquaintance seemed likely to ripen into intimacy; and it happened that at the same period a detachment from a regiment of Hussars was quartered in our neighbourhood. The Captain hunted of course, so did the Lieutenant; and two harder riders never dirtied their coats with the X.Y.Z., nor washed them, when dirty, in the Swimley brook. Also they danced, dined, drank, and flirted, as is the custom of their kind. But the Cornet was an exception to the rule. Strange anomaly! a Cornet of Hussars, who seldom, when off duty, got upon a horse; who did not waltz or give conundrums, or squeeze young ladies’ hands; who retired from mess early, not to smoke nor play whist, nor get into scrapes, but to practise on the pianoforte; whose general appearance was sedate and steady, though, to do him justice, he was a good-looking fellow enough, in a manly Anglo-Saxon style, and, in short, whose whole character and habits appeared more those of a travelling tutor than a dissipated young officer of Dragoons. \n \n “And yet Miss Merlin fell in love with Cornet Brown. Where they met, has always been to me a mystery; and when they did meet, I cannot conceive what they found to talk about, for they had not two ideas in common. He did not even read; for, with all his quiet habits, the Cornet was as ignorant upon most topics of general information, as if he had been the fastest and idlest of his kind. His sole passion was music, and Miss Merlin did not know a note. Nevertheless, she fell in love with him—over head—such a fall as she never had in her life before, even in the Vale. She gave up hunting; she parted with her horses; she altered her whole habits and disposition and appearance, as a woman will, to identify herself the more with the man she loves. A good many of us in that part of the country had entered for the race; but we saw it was all up now—Brown in a canter, and the rest nowhere. \n \n “The Cornet, too, seemed fond of her, in his own undemonstrative way. When not practising the pianoforte in his barrack-room, he was generally to be found at the Rectory; and as he never interfered with old Merlin, who indeed hardly knew him by sight, he would have suited him as well for a son-in-law as anybody else. The thing seemed to go on swimmingly, his brother-officers laughed at him, and we all thought the Cornet and Fanny Merlin were engaged. \n \n “But this deserving young officer had an elder brother, whose views in some peculiar points it did by no means suit that his junior should commit matrimony, and the elder Brown appeared ere long upon the scene of action. He came down to stay at the barracks, where he made himself so agreeable to the Hussars, that they seriously proposed to him that he should make interest at the Horse Guards for the transfer of his brother’s commission to himself. He didn’t know a note of music—the elder Brown; but he talked, and he drank, and he smoked, and he rode, and, in short, was as jolly a fellow as ever kept a mess-table in a roar. Also, he made a slight acquaintance with Miss Merlin—not, I am bound to state, with any ulterior views; for he had a wife and promising little family of his own. He was a man of energy, you see—this gentleman—and when he meant a thing, why he went and did it without delay. \n \n “There are secrets, I am told, in all families—a fact that makes me additionally grateful that I have got none: I mean, neither family nor secrets. What arguments were used by the elder Brown in his conferences with the younger, whether he urged him by threats or plied him with entreaties, we shall never know. It is sufficient to state that he gained his point, as such men usually do, and prevailed upon the less energetic Cornet to give up Miss Merlin. Men vary much in the force of character, and I hope I know what is the wisest and the most discreet course to take in most affairs of life; but when I was his age, before I would have given up such a girl as Fanny Merlin, in consideration of any amount of threatening, reasoning, or expediency, I would have seen fifty elder brothers consigned to that place where they would have had an opportunity of comparing notes with Dives on their terrestrial prosperity. \n \n “The Cornet, however, gave way, and wrote a most affecting letter to his ladye-love, in which he assured her of his eternal attachment and regard, vowing that ‘imperious necessity would alone have induced him to forego her affection, and that although, at his brother’s injunctions, he must leave that part of the country, and they would probably not meet again, yet he could never forget her, and should always look back on their acquaintance as the happiest period of his life. In conclusion, he implored her to send him some keepsake, however trifling, that he might take with him into his banishment—anything that was her gift would be prized and valued till death,’ etc. etc. \n \n “Miss Merlin was not a young lady to make parade of a sorrow, however engrossing. She said nothing, and the most curious observer could not have discovered from her impassive face that she had sustained so cruel a wound, for she loved the Cornet very dearly, as the sequel proved; but she complied with her weak-minded swain’s request, and sent him by return of post the most appropriate present she could think of—namely, ‘a pair of leading-strings and a child’s go-cart’! Brown the elder positively roared with delight when he heard of this quiet and bitter sarcasm. But the Cornet took it very much to heart; I do not think he had seen his own conduct in its true light before. \n \n “Soon after this, old Merlin died, and there was a lawsuit instituted by his next of kin to deprive his daughter of her inheritance. The general report in the country went that Fanny Merlin was ruined, and would have to go for a governess. The Cornet was not a bad fellow after all. In defiance of his brother, he came back forthwith from the North of England, and endeavoured to renew his proposals. Of course, with such a girl as Miss Merlin, this was a forlorn hope, and equally of course the young officer became more attached to her than ever, and would have broken the leading-strings and dashed the go-cart all to pieces this time; but he never once set eyes on her whilst he remained in the neighbourhood, and retired at last in a perfect fever of fury and disappointment. Whether this contre-temps, or the accumulating pressure of many unpaid bills, chiefly for grand pianofortes, and other musical instruments, was the cause, I know not; but the following year Cornet Brown exchanged into a regiment serving in India, and the same paper which furnished the gazette of his appointment, also announced the judicial decision that restored Miss Merlin to affluence and prosperity. \n \n “She gave up her hunting, though, for a time, and practised music incessantly. I have heard that in a wonderfully short period she attained a proficiency in that science, which is not usually acquired under a lifetime. \n \n “Meanwhile the Cornet, alternating his military duties in India with a great many tiffins and a vast quantity of brandy pawnee, was invalided home in a very dangerous state of illness. The sea-voyage failed in his case to produce its usual good effect, and he arrived at Marseilles a dying man. How she heard of it, I have not the slightest idea; but Miss Merlin never was like other girls; she possessed an energy and force of will extremely rare in her sex, fortunately for ours. She started off, at a moment’s notice, without taking even a maid, and crossed France in the utmost haste, to reach her old lover, and bring him home. She had forgiven him his weakness and vacillation, had forgotten all about the leading-strings and the go-cart, now that she heard he was dying. \n \n “I am not a sentimental man, as you know, and have little sympathy to spare for those afflictions of the heart, which, in my opinion, sink into insignificance when compared with a derangement of the stomach; but it has always struck me that Miss Merlin’s was a melancholy story. When she arrived at Marseilles the Cornet had been buried eight-and-forty hours. She stood by his grave on the hill above the town, with the blue southern sky overhead, and the blue Mediterranean at her feet. I think, strong and self-reliant as she was, she had as much sorrow then for her portion as she could bear. \n \n “She remained abroad a twelvemonth, I know, for I made it my business at the time to ascertain; but what she did with herself, during that period, I have never been able to find out. Some said she had gone on into Syria, others that she was in Egypt. Archer thought he saw a person very like her eating sandwiches at Jerusalem. Aimwell is almost sure he recognised her in male attire at the First Cataract; there was a very general report prevalent that she had gone into a convent for a year on trial; but didn’t like it, which I can easily imagine, and so came away again. Be this as it may, she turned up again after a time in the X. Y. Z. country, hunting more furiously than before, riding harder, speaking less, and looking graver than she had ever done; but as the Rectory was now inhabited by a fresh incumbent, and she had no settled place of residence, she did not remain very long in the neighbourhood of her youthful home. \n \n “Since then, and it is a long time ago, she has travelled about the country, far more independently than most bachelors. In the summer she retires to some obscure town, either in the Highlands of Scotland, or on the sea-side, where she takes a quiet lodging, and devotes the time to study. In the winter she moves her horses about, to hunt with different packs of hounds, giving the Soakington country the preference, partly on account of the strong friendship which has sprung up between herself and the Earl. In fact, a room is always kept ready for her at Castle-Cropper, and she has arranged the library for the proprietor, and re-hung all the pictures in more favourable lights. So independent is she, however, in her habits, that she often prefers to remain at the Haycock, where, if you are not afraid, you may, perhaps, have an opportunity of becoming acquainted with her. I have now told you all I can about your mysterious visitor, and consign you, not without a shudder, to your fate. If she only retains half the attractions she had at eighteen, you’re a gone ’coon, Softly; and mind this—it’s a game like the pitch-and-toss we used to play at school, ‘Heads she wins, tails you lose!’ I have warned you. Adieu! Liberavi animam meam. \n \n “P.S.—A pianoforte is no use. She has never played a note since the Cornet died.” \n \n I appeal to any impartial man, whether such a communication as the above was not adding fuel to fire. I read and re-read it with an interest that increased on each fresh perusal. I resolved that, come what might, it should not be my fault if another sun went down without my obtaining at least a sight of the fair subject of Quizby’s memoir. I called up, in my mind’s eye, my correspondent himself. His jolly fat face, with the little eye, that twinkled pleasantly over a ready joke as over a slice from the haunch or a bubbling bumper of Bordeaux. I reflected on his imperturbable character, his consistent philosophy, cynical, perhaps, in language, but jovial, and thoroughly epicurean in practice; and the more I thought, the more I wondered, the more I longed to witness with my own eyes the peerless attractions that could have knocked my steady friend, so to speak, off his equilibrium. To-morrow morning then, I resolved, I would see Miss Merlin, or die in the attempt. \n \n Eagerly I scanned the hunting-card for the week. To-morrow the hounds were to meet at the kennels. Castle Cropper was but ten miles from Soakington. She could not possibly start before nine. I desired my servant to call me at eight, and retired to rest, in that frame of mind which prompts a man to shave over-night, that he may be in time, and makes him wake every half-hour lest he should over-sleep himself after all at the last. \n \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2047/58365.html","bookId":577,"book":{"id":577,"title":"Market Harborough and Inside the Bar","description":"简介： Most men have a sunny spot to which they look back in their existence, as most have an impossible future, to attain which all their energies are exerted, and their resources employed. The difference between these visionary scenes is this, that they t...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2047","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
