{"id":77982,"no":107,"title":"Page 107","content":"The silver-nosed Piper stood behind the Adderhead, one foot on a stool, his lute supported on his thigh, singing softly as his fingers slowly plucked the strings. But Meggie’s eyes did not linger on him long. At the end of the table she had seen someone she knew only too well. Her heart faltered like an old woman’s feet when Mortola returned her glance, with a smile so full of triumph that Meggie’s knees began to tremble. The man who had wounded Dustfinger in the mill sat beside Mortola. His hands were bandaged, and above his forehead the fire had burned a pathway into his hair. Basta was in an even worse state. He was sitting close to Mortola, his face so red and swollen that Meggie almost failed to recognize him. But he had escaped death once again. Perhaps the good-luck charms he always wore worked after all. Firefox clutched Meggie’s arm tightly as he walked toward the Adderhead in his heavy fox-fur cloak – as if to prove that he personally had caught this little bird. He roughly pushed her in front of the table and threw the framed photograph down aimong the dishes. The Adderhead raised his head and looked at her, with bloodshot eyes in which Meggie could still see the traces of the bad night Fenoglio’s words had given him. When he raised his greasy hand, the Piper fell silent behind him and propped his lute against the wall. “There she is!” announced Firefox, as his master wiped the grease from his fingers and lips with an embroidered napkin. “I wish we had a witch-picture like this of everyone we’re after. Then the informers wouldn’t keep bringing us the wrong people.” The Adderhead had picked up the photograph. Appraisingly, he compared it with Meggie. She tried to bend her head, but Firefox forced up her face. “Remarkable!” commented the Adderhead. “My best painters couldn’t have produced anywhere near as good a likeness of the girl.” With a bored expression, he reached for a little silver toothpick and prodded his teeth with it. “Mortola says you’re a witch. Is it true?” “Yes!” replied Meggie, looking him straight in the eye. Now they’d find out whether Fenoglio’s words would come true again. If only she had been able to read to the end! She had read a great deal of it, but she could feel the rest of the words still waiting under her dress. Forget them, Meggie, she told herself. You must make the words you have already read come true – and hope that the Adderhead plays his part just as you do. “Yes?” repeated the Adderhead. “So you admit it? Don’t you know what I usually do to witches and magicians? I burn them.” The same words. He was speaking Fenoglio’s words. Exactly as Fenoglio had put them into his mouth. Exactly as she had read them out loud in the infirmary a few hours ago. She knew what she must answer. The words came into her mind of their own accord, as if they were hers and not Fenoglio’s. Meggie looked at Basta and the other man from the mill. Fenoglio hadn’t written about them personally, but the answer was still right. “The last to burn,” she said calmly, “were your own men. Only one man commands fire in this world, and he’s not you.” The Adderhead stared at her – watchful as a fat tomcat not yet certain how to play his game most satisfactorily with the mouse he has caught. “Ah,” he said in his heavy, thick voice. “I suppose you mean that fire-dancer. He likes to go around with poachers and footpads. You think he’ll come and try to rescue you, eh? Then, at last, I could feed him to the fire that you claim obeys him so well.” “I don’t need anyone to rescue me,” replied Meggie. “I would have come to you myself in any case, even if you hadn’t had me brought here.” There was laughter among the silver columns. The Adderhead leaned across the table and examined her with unconcealed curiosity. “Well, well!” he said. “Really? Why? To plead with me to let your father go? Because that robber is your father, isn’t he? At least, Mortola says so. She even says we’ve caught your mother, too.” Mortola! Fenoglio had never thought of her. He hadn’t written a word about her, but there she sat with her magpie gaze. Don’t think about it, Meggie. Be cold. Cold to your very heart, as you were on the night when you summoned the Shadow. But where was she to get the right words from now? Improvise, Meggie, she told herself, like an actress who’s forgotten her lines. Go on! Make up your own words and then just mix them into the words Fenoglio wrote for you, like an extra spice. “The Magpie is right,” she replied to the Adderhead. And sure enough, her voice sounded calm and steady, as if her heart wasn’t thudding in her breast like a small, hunted animal. “You took my father captive when she’d almost killed him, and you’re holding my mother prisoner in your dungeons. However, I’m not here to ask for leniency. I have a deal to offer you.” “Listen to the little witch!” Basta’s voice shook with hatred. “Why don’t I just slice her up nice and thin, and you can feed her to your dogs?” However, the Adderhead ignored him. He kept his eyes fixed on Meggie’s face, as if seeking it for what she wasn’t saying. Be like Dustfinger, she told herself. You can never tell what Dustfinger is thinking or feeling from the way he looks. Try! It can’t be all that difficult. “A deal?” The Adderhead took his wife’s hand, as casually as if he had just found it lying beside his plate by chance. “What do you plan to sell me that I can’t simply take for myself?” His men laughed. Meggie tried not to notice that her fingers were numb with terror. Once again it was Fenoglio’s words that passed her lips. Words that she had read aloud. “My father,” she continued, in a carefully controlled voice, “is no robber. He’s a bookbinder and an enchanter. He is the only man alive who doesn’t fear Death. Haven’t you seen his wound? Didn’t the physicians tell you that injury ought to have killed him? Nothing can kill him. Mortola tried, and did he die? No. He has brought Cosimo the Fair back to life, although the White Women had already delivered him up to Death, and if you let him and my mother go then you need not fear Death, either, for my father,” said Meggie, taking her time over the last few words, “my father can make you immortal.” All was very quiet in the great hall. Until Mortola’s voice broke the silence. “She’s lying!” she cried. “The little witch is lying! Don’t believe a word of it. It’s her tongue, her bewitched tongue. That’s her only weapon. Her father can die, all right, indeed he can! Bring him here and I’ll prove it. I’ll kill him myself before your eyes, and this time I’ll do it properly!” No! Meggie’s heart began to race as if it would leap out of her breast. What had she done? The Adderhead was staring at her, but when at last he spoke it seemed as if he hadn’t even heard what Mortola had said. “How?” was all he asked. “How could your father do what you promise?” He was thinking of the night to come now. Meggie saw it in his eyes. He was thinking of the fear waiting for him: It would be even worse than in the night just gone, even more merciless. . Meggie leaned forward over the laden table. She spoke the words as if she were reading them aloud again. “My father will bind you a book!” she said, so quietly that apart from the Adderhead no one, except perhaps his doll-like wife, could hear her. “He will bind it for you with my help, a book with five hundred blank pages. He will cover it with wood and leather, he will give it brass clasps, and you will write your name on the first page in your own hand. In token of thanks, however, you will let him go, and with him all whose lives he asks for, and you will hide the book in a place known only to you, for hear this: As long as that book exists you will be immortal.","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-107.html","bookId":2720,"book":{"id":2720,"title":"Inkspell (Inkworld #2)","description":"Storyline: The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children. Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined.","cover":"https://allnovel.net/images/inkspell-inkworld-2.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkspell-inkworld-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:38:17 PM"}}
