{"id":78010,"no":136,"title":"Page 136","content":"“No,” said Roxane. “You least of all.”\\n\\n Chapter 77 – Where Now?\\n\\n The Giant rested back in his chair. “You’ve some stories left,” he said. “I can smell them on your skin.”\\n\\n – Brian Patten, The Story Giant\\n\\n Farid watched as they laid the injured on litters under cover of night. The injured and the dead.\\n\\n Six robbers were standing among the trees listening for any sound that might mean danger.\\n\\n Only the tops of the silver towers were to be seen in the distance, bright in the starlight, yet it seemed to them all as if the Adderhead could see them. Could he sense it up in his castle when they stole soft-footed over Mount Adder? Who could tell what the Adderhead might be able to do now? Now that he was immortal and as invincible as Death itself?\\n\\n But the night was still, as still as Dustfinger, who was to be taken back to Ombra on a cart drawn by the Black Prince’s bear. Meggie was going there, too, for the time being, to the other side of the forest, with Silvertongue and her mother. The Black Prince had told them of a village too poor and remote from any road to interest princes. He would hide them there, or on one of the nearby farms.\\n\\n Should he go with them?\\n\\n Farid saw Meggie looking at him. She was standing with her mother and the other women.\\n\\n Silvertongue was with the robbers, and hanging from his belt was the sword with which he had apparently killed Basta – and not just Basta. Almost a dozen men had died at his hands, so several of the robbers had told Farid, their voices lowered in respect. Amazing. Back in the hills around Capricorn’s village, Silvertongue couldn’t have killed a blackbird when they were in hiding together, let alone a human being. On the other hand, how had he himself learned to kill?\\n\\n The answer was not hard to find. Fear and rage. And there was enough of those in this story.\\n\\n Roxane was with the robbers, too. She turned her back on Farid when she noticed him looking at her. She treated him like air – as if he had never returned to the land of the living, as if he were only a ghost, an ill-intentioned ghost who had devoured her husband’s heart. “What was it like being dead, Farid?” Meggie had asked him. But he couldn’t remember. Or perhaps he didn’t want to remember.\\n\\n Orpheus was standing barely two paces away from him, shivering in the thin shirt he wore. The Prince had told him he must change his light-colored suit for a dark cloak and woolen trousers.\\n\\n But in spite of the clothes he still looked like a cuckoo among sparrows. Fenoglio was watching Orpheus like an old tomcat keeping a wary eye on a young one who has invaded his territory.\\n\\n “He looks a fool!” Fenoglio had whispered this comment to Meggie just loud enough for everyone to hear it. “Look at him. A callow youth, knows nothing about life, how is he going to be able to write? It might well be best to send him straight back, but never mind. There’s no saving this wretched story now, anyway.”\\n\\n He was probably right. But why hadn’t he at least tried to write Dustfinger back? Didn’t he care anything for the characters he had created? Was he just moving them like pawns in a game of chess, enjoying their pain?\\n\\n Farid clenched his fists in helpless anger. I would have tried, he thought. A hundred times, a thousand times, for the rest of my life. But he couldn’t even read those strange little signs! The few that Dustfinger had taught him would never be enough to bring him back from where he was now. Even if he wrote his name in letters of fire on the walls of the Castle of Night, Dustfinger’s face would remain as terribly still as when he last saw it.\\n\\n No, only Orpheus could try it. But he hadn’t written a single word since Meggie read him here.\\n\\n He just stood there – or paced up and down, up and down, while the robbers watched him suspiciously. The glances Silvertongue cast him were not very friendly, either. He had turned pale when he saw Orpheus again. For a moment Farid had thought he would seize Cheeseface and beat him to a pulp, but Meggie had taken his hand and drawn him away. Whatever the two of them had said to each other, she wasn’t telling Farid. She had known that her father would not approve if she read Orpheus here, but she had done it all the same. For him. Was Orpheus interested in any of that? Oh no.\\n\\n He was still acting as if his own voice, not Meggie’s, had brought him here. Stuck-up, thrice-accursed son of a bitch!\\n\\n “Farid? Have you made up your mind?” Farid came out of his gloomy thoughts. Meggie was standing in front of him. “You will come with us, won’t you? Resa says you can stay with us as long as you like, and Mo doesn’t mind, either.”\\n\\n Silvertongue was still standing with the robbers, talking to the Black Prince. Farid saw Orpheus watching the two of them .. then he began pacing up and down once more, rubbed his forehead, smoothed back his hair, muttered as if talking to himself. Like a lunatic, thought Farid. I’ve pinned my hopes on a lunatic!\\n\\n “Wait here.” He turned away from Meggie and went over to Orpheus. “I’m going with Meggie,” he said brusquely. “You can go wherever you like.”\\n\\n Cheeseface straightened his glasses. “What are you talking about? Of course I’m coming with you! After all, I want to see everything – the Way less Wood, the Laughing Prince’s castle.” He looked up at the hill. “And of course I’d have liked to see the Castle of Night, too, but after what’s happened here, I suppose it isn’t a good time. Well, this is only my first day here. . Have you seen the Adderhead yourself? Is he very terrifying? I’d like to see those silver scales on the columns. . ”\\n\\n “You’re not here to go sightseeing!” Farid’s voice was choked with anger. What on earth was Cheeseface thinking of? How could he stand there looking around him as if he were on a pleasure trip, while Dustfinger would soon be lying in some dark crypt or wherever Roxane planned to take him?\\n\\n “Oh no?” Orpheus’s round face darkened. “Is that any way to talk to me? I’ll do as I like. Do you think I’ve finally arrived where I always wanted to be just to have a snotty boy, who has no business here, anyway, order me around? You think words can simply be plucked from the empty air? This is all about Death, you stupid boy! It could take months for me to get the right idea. Who knows? You don’t call up ideas just like that, not even with fire, and we need a brilliant, a divine idea. Which means” Orpheus inspected his fingernails – “that I shall need a servant! Or do you want me to waste my time washing my own clothes and finding myself something to eat?”\\n\\n The dog. The accursed dog. “Very well. I’ll be your servant, too.” Farid brought the words out only with difficulty. “If you will bring him back.”\\n\\n “Excellent!” Orpheus smiled. “Then, for a start, get me some food. It looks as if we’re going to be embarking on a long and uncomfortable march.”\\n\\n Farid gritted his teeth, but of course he obeyed. He would have scraped the silver from the towers of the Castle of Night to get Dustfinger breathing again.\\n\\n “Farid? What is it? Are you coming with us?” Meggie stepped into his path as he ran past her, with bread and dried meat for Cheeseface in his pockets.\\n\\n “Yes – yes, we’re coming with you!” He flung his arms around her neck, but only once he saw that Silvertongue’s back was turned to him. You never knew with fathers. “I’ll save him, Meggie!” he whispered in her ear. “I’ll bring Dustfinger back. This story will have a happy ending. I swear!” \\n\\n","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-136.html","bookId":2720,"book":{"id":2720,"title":"Inkspell (Inkworld #2)","description":"Storyline: The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children. \\n Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined.\\n","cover":"https://allnovel.net/images/inkspell-inkworld-2.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkspell-inkworld-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:38:17 PM"}}
