{"id":77905,"no":30,"title":"Page 30","content":"“Later, maybe. Now go away!”\n The boy with the runny nose looked at him so sadly that, for a moment, Fenoglio was reminded of his grandson. Pippo always used to look like that when he brought Fenoglio a book and put it on his lap with a hopeful expression. .\n Ah, children! thought Fenoglio, as he walked toward the fire where he had seen the Black Prince.\n Children, they’re the same everywhere. Greedy little creatures but the best listeners in the world –\n any world. The very best of all.\n Chapter 14 – The Black Prince\n “So bears can make their own souls … ,” she said. There was a great deal in the world to know.\n – Philip Pullman, Northern Lights\n The Black Prince was not alone. Of course not; his bear was with him, as usual. He was crouching by the fire behind his master, like a shaggy shadow. Fenoglio still remembered the words he had used when he first created the Prince at the very beginning of Inkheart. He recited them quietly to himself as he approached him: “An orphan boy with skin almost as black as his curly hair, as quick with his knife as his tongue, always ready to protect those he loved – his two younger sisters, a maltreated bear, or his best friend, his very best friend, Dustfinger…\n ” . . who would have died an extremely dramatic death if it had been left to me, all the same!”\n added Fenoglio quietly as he waved to the Prince. “But luckily my black friend doesn’t know that, or I don’t suppose I’d be very welcome at his fireside!”\n The Prince returned his greeting. He probably thought he was called the Black Prince because of the color of his skin, but Fenoglio knew better. He had stolen the name from a history book in his old world. A famous knight once bore it, a king’s son who was a great robber, too. Would he have been pleased to think that his name had been given to a knife-thrower, king of the strolling players? If not, there’s nothing he can do about it, thought Fenoglio, for his own story came to its end long ago.\n On the Prince’s left sat the hopelessly incompetent physician who had almost broken Fenoglio’s jaw pulling out a tooth, and to the right of him crouched Sootbird, a lousy fire-eater who knew as little of his trade as the physician knew of drawing teeth. Fenoglio was not quite sure about the physician, but there was no way he had invented Sootbird. Heaven knew where he had come from! All who saw him inefficiently breathing fire, in terror of the blaze, instantly found another name springing to mind: the name of Dustfinger the fire-dancer, tamer of the flames. .\n The bear grunted as Fenoglio sat down by the fire with his master and scrutinized him with little yellow eyes, as if to work out how much meat there was left to gnaw on such old bones. Your own fault, Fenoglio told himself: Why did you have to make the Prince’s companion a tame bear? A dog would have done just as well. The market traders told anyone who would listen that the bear was a man under a spell, bewitched by fairies or brownies (they couldn’t decide which), but Fenoglio knew better. The bear was just a bear, a real bear who loved the Black Prince for freeing him, years ago, from the ring through his nose and from his former master, who beat him with a thorny stick to make him dance in marketplaces.\n Six more men were sitting beside the fire with the Black Prince. Fenoglio knew only two of them.\n One was an actor whose name Fenoglio kept forgetting. The other was a professional strong man who earned his living performing in marketplaces: tearing apart chains, lifting grown men into the air, bending iron bars. They all fell silent as Fenoglio joined them. They tolerated his company, but he was not by any means one of them. Only the Prince smiled at him. “Ah, the Inkweaver!” he said. “Do you have a new song about the Bluejay for us?”\n Fenoglio accepted the goblet of hot wine and honey that one of the men gave him at a sign from the Prince and sat down on the stony ground. His old bones didn’t really like hunkering down there, even on a night as mild as this, but the strolling players did not care for chairs or other forms of seating.\n “I really came to give you this,” he said, putting his hand into the breast of his doublet. He looked around before handing the Prince the sealed letter, but in this milling throng it was difficult to see if anyone who didn’t belong to the Motley Folk was watching them.\n The Prince took the letter with a nod and tucked it into his belt. “Thank you,” he said.\n “You’re welcome!” replied Fenoglio, trying to ignore the bear’s bad breath. The Prince couldn’t write, any more than most of his Motley subjects could, but Fenoglio was happy to do it for him, particularly when it was something like this he wanted. The letter was for one of the Laughing Prince’s head foresters. His men had attacked the strolling players’ women and children on the road three times. No one else seemed to mind, neither the Laughing Prince in his grief nor the men who were supposed to do justice in his place, for the victims were only strolling players. So the king of the players himself was going to do something about it: The forester would find Fenoglio’s letter on his doorstep that very night. Its contents would prevent him from sleeping in peace and with luck would keep him away from women wearing the brightly colored skirts of the Motley Folk in the future. Fenoglio was rather proud of his threatening letters, almost as proud as he was of his robber songs.\n “Have you heard the latest, Inkweaver?” The Prince stroked his bear’s black muzzle. “The Adderhead has put a price on the Bluejay’s head.”\n “The Bluejay?” Fenoglio swallowed his wine the wrong way, and the physician thumped him on the back so hard that he spilled the hot drink over his fingers. “That’s a good one!” he gasped, once he had his breath back. “Well, don’t let anyone say words are just noise and hot air! The Adder will have to search a long time for that particular robber!”\n How oddly they were looking at him! As if they knew more than he did. But more about what?\n “Haven’t you heard yet, Inkweaver?” said Sootbird quietly.\n “Your songs seem to be coming true! The Adderhead’s tax gatherers have already been robbed twice by a man in a bird mask, and one of his game wardens, a man famous for enjoying every kind of cruelty, is said to have been found dead in the forest with a feather in his mouth. Guess what bird the feather came from?”\n Fenoglio glanced incredulously at the Prince, but he was looking at the fire, stirring the embers with a stick.\n “But .. but that’s astonishing!” cried Fenoglio – and then hastily lowered his voice as he saw the others looking anxiously around. “Astonishing news, I mean!” he went on in an undertone.\n “Whatever’s going on – well, I’ll write another song this minute! Suggest something! Go on! What would you like the Bluejay to do next?”\n The Prince smiled, but the physician looked at Fenoglio with scorn. “You talk as if it were all a game, Inkweaver!” he said.\n “You sit in your own room, scribbling a few words on paper, but whoever’s playing the part of your robber risks his neck, for he’s certainly made of flesh and blood, not just words!”\n “Yes, but no one knows his face, because the Bluejay wears a mask. Very clever of you, Inkweaver. How is the Adderhead to know what face to look for? A mask like that is very useful.\n Anyone can wear it.” It was the actor speaking. Baptista. Yes, of course, that was his name. Did I make him up? Fenoglio wondered. Well, never mind; no one knew more about masks than Baptista, perhaps because his face was disfigured by pockmarks. Many of the actors got him to make them leather masks showing laughter or tears. \n","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-30.html","bookId":2720,"book":{"id":2720,"title":"Inkspell (Inkworld #2)","description":"Storyline: \n The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children. \n Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined.\n \n","cover":"https://allnovel.net/images/inkspell-inkworld-2.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkspell-inkworld-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:38:17 PM"}}
