{"id":77950,"no":75,"title":"Page 75","content":"“Are you at a loss for words, poet?” asked Cosimo. “Well, I can tell you I felt the same when I was told all these terrible things. What can one say of such a neighbor? What do you think of the rumor that the Adderhead had my wife’s mother poisoned because she liked listening to a minstrel too much? What do you think of his sending Firefox his own men-at-arms as reinforcements, to make quite sure that I never returned from the fire-raisers’ fortress? My father-in-law tried to do away with me, poet! I have forgotten a year of my life, and everything before it is as vague in my mind as if someone else had lived it. They say I was dead. They say the White Women took me away. They ask: Where have you been, Cosimo? And I don’t know the answer! But now I know who wanted my death, and I know who to blame for the way I feel now: empty like a gutted fish, younger than my own son. Tell me, what’s the appropriate punishment for crimes of such a monstrous kind against both me and others?”\n But Fenoglio could only look at him. Who is he? he asked himself. For heaven’s sake, Fenoglio, you know what he looks like, but who is he? “You tell me!” he replied at last, hoarsely.\n And Cosimo gave him that angelic smile again. “Why, there’s only one appropriate punishment, poet!” he said. “I will go to war. I’ll wage war against my father-in-law until the Castle of Night is razed to the ground and his name is forgotten.”\n Fenoglio stood there in the darkened hall, hearing his own blood roaring in his ears. War? I must have misheard, he thought. I never wrote anything about war. But a voice began whispering inside him: ” A great new age, Fenoglio! Didn’t you write something about a great new age? ”\n “He has the impudence to ride to my castle with men in his retinue who have already pillaged and burned for Capricorn; he’s made Firefox, whom I rode out to defeat, his herald; he’s sent the Piper here as protector of my son! The audacity of it! Perhaps he could deride my father in that way, but not me. I’ll show him he’s not dealing with a prince who’s either shedding tears or overeating now.” A faint flush had risen to Cosimo’s face. Anger made him even more handsome.\n War. Think, Fenoglio. Think. War! Is that what you wanted? He felt his old knees beginning to tremble.\n As for Cosimo, he laid his hand almost lovingly on his sword. He slowly drew it from the scabbard. “It was for this alone that death spared me, poet,” he said, cutting the air with the long, slender blade. “So that I could bring justice to this world and turn the Devil himself off his throne. That’s worth fighting for, don’t you think? Even worth dying for.” He was a fine sight standing there with the drawn sword in his hand. And yes, wasn’t he right? Perhaps war really was the only way to put the Adder head in his place.\n “You must help me, Inkweaver! That’s what they call you, don’t they? I like the name!” Cosimo gracefully sheathed the sword again. Tullio, who was still sitting on the steps at his feet, shuddered as the sharp blade scraped the leather scabbard. “You will write a speech for me, calling my people to arms. You will explain our cause to them, you’ll plant enthusiasm for that cause and hatred for our enemy in every heart. And we’ll use the strolling players, too – you’re a friend of theirs. Write them fiery songs, poet! Songs that will make men want to fight. You forge the words, I’ll have the swords forged. Many, many swords.”\n He stood there like an avenging angel, lacking nothing but the wings, and for the first, the very first time in his life Fenoglio felt something like affection for one of his inky creations. I’ll give him wings, he thought. I will indeed. With my words.\n “Your Highness!” When he bowed his head this time it wasn’t difficult, and for a wonderful moment he felt almost as if he had written himself the son he’d never had. Don’t go turning sentimental in your old age, he told himself, but this warning made no difference to the unaccustomed softening of his heart.\n I ought to ride with him, he thought. Yes, indeed. I’ll go to war against the Adderhead with him, old as I may be. Fenoglio, a hero in the world of his own creation, a poet and a warrior, too. It was a role he’d like. As if he had written himself the perfect part to play. Cosimo smiled again. Fenoglio would have bet everything he had that there was no more delightful smile in this or any other world. Tullio seemed to have succumbed to Cosimo’s charm, too, despite the fear the Adderhead had put into his heart. Enchanted, he stared up at the master who had come back to him, his little hands in his lap as if they were still holding the bird with the bloody breast.\n “I hear your words already!” said Cosimo, returning to the throne. “My wife loves written words, you know, words that stick to parchment and paper like dead flies, and it seems my father felt the same – but I want to hear words, not read them! Remember that, when you’re looking for the right words: You must ask yourself what they sound like! Glowing with passion, dark with sorrow, sweet with love, that’s what I want. Write words quivering with all our righteous anger at the Adderhead’s evil deeds, and soon that anger will be in every heart. You will write my accusation, my fiery accusation, and we’ll have it read out in every marketplace and spread abroad by the strolling players: Beware, Adderhead! Let it be heard all the way to his own side of the forest. Your wicked days are numbered! And soon every peasant will want to fight under my banner, every man young or old, your words will bring them flocking here to the castle! I’ve heard that when the Adderhead doesn’t like what books say he’ll sometimes have them burned in the fireplaces of his castle, but how will he burn words that everyone is singing and speaking?”\n He could always burn the man who speaks them, thought Fenoglio. Or the man who wrote them.\n It was an uncomfortable thought that cooled the ardor of his heart slightly, but Cosimo seemed to have picked it up.\n “I shall, of course, take you under my personal protection immediately,” he said. “In the future you will live here at the castle, in apartments suitable for a court poet.”\n “At the castle?” Fenoglio cleared his throat, so awkward did this offer make him feel. “That ..\n that’s very generous of you. Yes, indeed.” New times were coming, new and wonderful times. A great new age ..\n “You will be a good prince, Your Grace!” he said, his voice much moved. “A good and great prince. And my songs about you will still be sung in centuries to come, when the Adderhead is long forgotten. I promise you that.”\n Footsteps sounded behind him. Fenoglio turned, annoyed by the interruption at such an emotional moment. Violante came hurrying through the hall, holding her son’s hand, with her maid behind her.\n “Cosimo!” she cried. “Listen to him. Your son wants to say he’s sorry.”\n Fenoglio didn’t think that Jacopo looked at all sorry. Violante was having to drag him along behind her, and his face was dark as thunder. He didn’t seem particularly pleased by his father’s return. His mother, on the other hand, was radiant as Fenoglio had never seen her before, and the mark on her face was not much darker than a shadow cast by the sun.\n “The birthmark on Her Ugliness’s face faded.” Oh, thank you, Meggie, he thought. What a pity you’re not here…\n “I won’t say sorry!” announced Jacopo, as his mother propelled him none too gently up the steps to the throne. “He’s the one who ought to say sorry to my grandfather!” Unobtrusively, Fenoglio took a step back. Time for him to go.\n","sourceLink":"https://allnovel.net/inkspell-inkworld-2/page-75.html","bookId":2720,"book":{"id":2720,"title":"Inkspell (Inkworld #2)","description":"Storyline: \n The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children. \n Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined.\n \n","cover":"https://allnovel.net/images/inkspell-inkworld-2.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkspell-inkworld-2.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:38:17 PM"}}
