{"id":65821,"no":15,"title":"Page 15","content":"FIRST-CLASS OR NOT, the flight back was miserable. It was the same plane, going east to New York along the second leg of a giant triangle. It was cleaned and perfumed and checked and refueled, and it had a new crew on board. Reacher and Jodie were in the same seats they had left four hours earlier. Reacher took the window again, but it felt different. It was still two and a half times as wide as normal, still sumptuously upholstered in leather and sheepskin, but he took no pleasure in sitting in it again.\\n\\n The lights were dimmed, to represent night. They had taken off into an outrageous tropical sunset boiling away beyond the islands, and then they had turned away to fly toward darkness. The engines settled to a muted hiss. The flight attendants were quiet and unobtrusive. There was only one other passenger in the cabin. He was sitting two rows ahead, across the aisle. He was a tall, spare man, dressed in a seersucker short-sleeve shirt printed with pale stripes. His right forearm was laid gently on the arm of the chair, and his hand hung down, limp and relaxed. His eyes were closed.\\n\\n \"How tall is he?\" Jodie whispered.\\n\\n Reacher leaned over and glanced ahead. \"Maybe six one.\"\\n\\n \"Same as Victor Hobie,\" she said. \"Remember the file?\"\\n\\n Reacher nodded. Glanced diagonally across at the pale forearm resting along the seat. The guy was thin, and he could see the prominent knob of bone at the wrist, standing out in the dimness. There was slim muscle and freckled skin and bleached hair. The radius bone was visible, running all the way back to the elbow. Hobie had left six inches of his radius bone behind at the crash site. Reacher counted with his eyes. up from the guy\u0027s wrist joint. Six inches took him halfway to the elbow.\\n\\n \"About half and half, right?\" Jodie said.\\n\\n \"A little more than half,\" Reacher said. \"The stump would have needed trimming. They\u0027d have filed it down where it was splintered, I guess. If he survived.\"\\n\\n The guy two rows ahead turned sleepily and pulled his arm in close to his body and out of sight, like he knew they were talking about it.\\n\\n \"He survived,\" Jodie said. \"He\u0027s in New York, trying to stay hidden.\"\\n\\n Reacher leaned the other way and rested his forehead on the cold plastic of the porthole.\\n\\n \"I would have bet my life he isn\u0027t,\" he said.\\n\\n He kept his eyes open, but there was nothing to see out of the window. Just black night sky all the way down to the black night ocean, seven miles below.\\n\\n \"Why does it bother you so much?\" she asked, in the quiet.\\n\\n He turned forward and stared at the empty seat six feet in front of him.\\n\\n \"Lots of reasons,\" he said.\\n\\n \"Like what?\"\\n\\n He shrugged. \"Like everything, like a great big depressing spiral. It was a professional call. My gut told me something, and it looks like I was wrong.\"\\n\\n She laid her hand gently on his forearm, where the muscle narrowed a little above his wrist. \"Being wrong isn\u0027t the end of the world.\"\\n\\n He shook his head. \"Sometimes it isn\u0027t, sometimes it is. Depends on the issue, right? Somebody asks me who\u0027s going to win the Series, and I say the Yankees, that doesn\u0027t matter, does it? Because how can I know stuff like that? But suppose I was a sportswriter who was supposed to know stuff like that? Or a professional gambler? Suppose baseball was my life? Then it\u0027s the end of the world if I start to screw up.\"\\n\\n \"So what are you saying?\"\\n\\n \"I\u0027m saying judgments like that are my life. It\u0027s what I\u0027m supposed to be good at. I used to be good at it. I could always depend on being right.\"\\n\\n \"But you had nothing to go on.\"\\n\\n \"Bullshit, Jodie. I had a whole lot to go on. A whole lot more than I sometimes used to have. I met with the guy\u0027s folks, I read his letters, I talked with his old friend, I saw his record, I talked with his old comrade-in-arms, and everything told me this was a guy who definitely could not behave the way he clearly did behave. So I was just plain wrong, and that bums me up, because where does it leave me now?\"\\n\\n \"In what sense?\"\\n\\n \"I\u0027ve got to tell the Hobies,\" he said. \"It\u0027ll kill them stone dead. You should have met them. They worshiped that boy. They worshiped the military, the patriotism of it all, serving your country, the whole damn thing. Now I\u0027ve got to walk in there and tell them their boy is a murderer and a deserter. And a cruel son who left them twisting in the wind for thirty long years. I\u0027ll be walking in there and killing them stone dead, Jodie. I should call ahead for an ambulance.\"\\n\\n He lapsed into silence and turned back to the black porthole.\\n\\n \"And?\" she said.\\n\\n He turned back to face her. \"And the future. What am I going to do? I\u0027ve got a house, I need a job. What kind of a job? I can\u0027t put myself about as an investigator anymore, not if I\u0027ve started getting things completely ass-backward all of a sudden. The timing is wonderful, right? My professional capabilities have turned to mush right at the exact time I need to find work. I should go back to the Keys and dig pools the rest of my life.\"\\n\\n \"You\u0027re being too hard on yourself. It was a feeling, was all. A gut feeling that turned out wrong.\"\\n\\n \"Gut feelings should turn out right,\" he said. \"Mine always did before. I could tell you about a dozen times when I stuck to gut feelings, no other reason than I felt them. They saved my life, time to time.\"\\n\\n She nodded, without speaking.\\n\\n \"And statistically I should have been right,\" he said. \"You know how many men were officially unaccounted for after \u0027Nam? Only about five. Twenty-two hundred missing, but they\u0027re dead, we all know that. Eventually Nash will find them all, and tick them all off. But there were five guys left we can\u0027t categorize. Three of them changed sides and stayed on in the villages afterward, gone native. One disappeared in Thailand. One of them was living in a hut under a bridge in Bangkok. Five loose ends out of a million men, and Victor Hobie is one of them, and I was wrong about him.\"\\n\\n \"But you weren\u0027t really wrong,\" she said. \"You were judging the old Victor Hobie, is all. All that stuff was about Victor Hobie before the war and before the crash. War changes people. The only witness to the change was DeWitt, and he went out of his way not to notice it.\"\\n\\n He shook his head again. \"I took that into account, or at least I tried to. I didn\u0027t figure it could change him that much.\"\\n\\n \"Maybe the crash did it,\" she said. \"Think about it, Reacher. What was he, twenty-one years old? Twenty-two, something like that? Seven people died, and maybe he felt responsible. He was the captain of the ship, right? And he was disfigured. He lost his arm, and he was probably burned, too. That\u0027s a big trauma for a young guy, physical disfigurement, right? And then in the field hospital, he was probably woozy with drugs, terrified of going back.\"\\n\\n \"They wouldn\u0027t have sent him back to combat,\" Reacher said.\\n\\n Jodie nodded. \"Yes, but maybe he wasn\u0027t thinking straight. The morphine, it\u0027s like being high, right? Maybe he thought they were going to send him straight back. Maybe he thought they were going to punish him for losing the helicopter. We just don\u0027t know his mental state at the time. So he tried to get away, and he hit the orderly on the head. Then later he woke up to what he\u0027d done. Probably felt terrible about it. That was my gut feeling, all along. He\u0027s hiding out, because of a guilty secret. He should have turned himself in, because nobody was going to convict him of anything. The mitigating circumstances were too obvious. But he hid out, and the longer it went on, the worse it got. It kind of snowballed.\"\\n\\n \"Still makes me wrong,\" he said. \"You\u0027ve just described an irrational guy. Panicky, unrealistic, a little hysterical. I had him down as a plodder. Very sane, very rational, very normal. I\u0027m losing my touch.\"\\n\\n The giant plane hissed on imperceptibly. Six hundred miles an hour through the thin air of altitude, and it felt like it was suspended immobile. A spacious pastel coccoon, hanging there seven miles up in the night sky, going nowhere at all.\\n\\n \"So what are you going to do?\" she asked.\\n\\n \"About what?\"\\n\\n \"The future?\"\\n\\n He shrugged again. \"I don\u0027t know.\"\\n\\n \"What about the Hobies?\"\\n\\n \"I don\u0027t know,\" he said again.\\n\\n \"You could try to find him,\" she said. \"You know, convince him no action would be taken now. Talk some sense into him. Maybe you could get him to meet with his folks again.\"\\n\\n \"How could I find him? The way I feel right now, I couldn\u0027t find the nose on my face. And you\u0027re so keen on making me feel better, you\u0027re forgetting something.\"\\n\\n \"What?\"\\n\\n \"He doesn\u0027t want to be found. Like you figured, he wants to stay hidden. Even if he started out real confused about it, he evidently got the taste for it later. He had Costello killed, Jodie. He sent people after us. So he could stay hidden.\"\\n\\n Then the stewardess dimmed the cabin lights right down to darkness, and Reacher gave up and laid his seat back and tried to sleep, with his last thought uppermost in his mind: Victor Hobie had Costello killed, so he could stay hidden.\\n\\n THIRTY FLOORS ABOVE Fifth Avenue, he woke up just after six o\u0027clock in the morning, which for him was about normal, depending on how bad the fire dream had been. Thirty years is nearly eleven thousand days, and eleven thousand days have eleven thousand nights attached to them, and during every single one of those nights he had dreamed about fire. The cockpit broke away from the tail section, and the treetops flipped it backward. The fracture in the airframe split the fuel tank. The fuel hurled itself out. He saw it coming at him every night, in appalling slow motion. It gleamed and shimmered in the gray jungle air. It was liquid and globular and formed itself into solid shapes like giant distorted raindrops. They twisted and changed and grew, like living things floating slowly through the air. The light caught them and made them strange and beautiful. There were rainbows in them. They got to him before the rotor blade hit his arm. Every night he turned his head in the exact same convulsive jerk, but every night they still got to him. They splashed on his face. The liquid was warm. It puzzled him. It looked like water. Water should be cold. He should feel the thrill of cold. But it was warm. It was sticky. Thicker than water. It smelled. A chemical smell. It splashed across the left side of his head. It was in his hair. It plastered the hair to his forehead and ran slowly down into his eye.\\n\\n Then he turned his head back, and he saw that the air was on fire. There were fingers of flame pointing down the floating rivulets of fuel like accusations. Then the fingers were mouths. They were eating the floating liquid shapes. They ate fast, and they left the shapes bigger and blazing with heat. Then the separate globules in the air were bursting into flames ahead of each other. There was no connection anymore. No sequence. They were just exploding. He jerked his head down eleven thousand separate times, but the fire always hit him. It smelled hot, like burning, but it felt cold, like ice. A sudden ice-cold shock on the side of his face, in his hair. Then the black shape of the rotor blade, arcing down. It broke against the chest of the guy called Bamford and a fragment smacked him edge-on, precisely halfway along the length of his forearm.\\n\\n He saw his hand come off. He saw it in detail. That part was never in the dream, because the dream was about fire, and he didn\u0027t need to dream about his hand coming off, because he could remember seeing it happen. The edge of the blade had a slim aerodynamic profile, and it was dull black. It punched through the bones of his arm and stopped dead against his thigh, its energy already expended. His forearm just fell in two. His watch was still strapped to the wrist. The hand and the wrist fell to the floor. He raised the severed forearm and touched his face with it, to try and find out why the skin up there felt so cold but smelled so hot.\\n\\n He realized some time later that action had saved his life. When he could think straight again, he understood what he had done. The intense flames had cauterized his open forearm. The heat had seared the exposed flesh and sealed the arteries. If he hadn\u0027t touched his burning face with it, he would have bled to death. It was a triumph. Even in extreme danger and confusion, he had done the right thing. The smart thing. He was a survivor. It gave him a deadly assurance he had never lost.\\n\\n He stayed conscious for about twenty minutes. He did what he had to do inside the cockpit and crawled away from the wreck. He knew nobody was crawling with him. He made it into the undergrowth and kept on going. He was on his knees, using his remaining hand ahead of him, walking on the knuckles like an ape. He ducked his head to the ground and jammed his burned skin into the earth. Then the agony started. He survived twenty minutes of it and collapsed.\\n\\n He remembered almost nothing of the next three weeks. He didn\u0027t know where he went, or what he ate, or what he drank. He had brief flashes of clarity, which were worse than not remembering. He was covered in leeches. His burned skin came off and the flesh underneath stank of rot and decay. There were things living and crawling in his raw stump. Then he was in the hospital. One morning he woke up floating on a cloud of morphine. It felt better than anything had felt in his whole life. But he pretended to be in agony throughout. That way, they would postpone sending him back.\\n\\n They applied burn dressings to his face. They cleaned the maggots out of his wound. Years later, he realized the maggots had saved his life, too. He read a report about new medical research. Maggots were being used in a revolutionary new treatment for gangrene. Their tireless eating consumed the gangrenous flesh before the rot could spread. Experiments had proven successful. He had smiled. He knew.\\n\\n The evacuation of the hospital caught him by surprise. They hadn\u0027t told him. He overheard the orderlies making plans for the morning. He got out immediately. There were no guards. Just an orderly, by chance loitering on the perimeter. The orderly cost him a precious bottle of water broken across his head, but didn\u0027t delay him by more than a second.\\n\\n His long journey home started right there, a yard into the undergrowth outside the hospital fence. First task was to retrieve his money. It was buried fifty miles away, in a secret spot outside his last base camp, inside a coffin. The coffin was just a lucky chance. It had been the only large receptacle he could lay his hands on at the time, but later it would prove to be a stroke of absolute genius. The money was all in hundreds and fifties and twenties and tens, and there was a hundred and seventy pounds of it. A plausible weight to find in a coffin. Just under two million dollars.\\n\\n By then the base camp was abandoned and far behind enemy lines. But he got himself there, and faced the first of his many difficulties. How does a sick one-armed man dig up a coffin? At first, with blind perseverance. Then later, with help. He had already shifted most of the earth when he was discovered. The coffin lid was plainly visible, lying in the shallow grave. The VC patrol crashed in on him out of the trees, and he expected to die. But he didn\u0027t. Instead, he made a discovery. It ranked with the other great discoveries he made in his life. The VC stood back, fearful and muttering and uncertain. He realized they didn\u0027t know who he was. They didn\u0027t know what he was. The terrible bums robbed him of his identity. He was wearing a torn and filthy hospital night-shirt. He didn\u0027t look American. He didn\u0027t look like anything. He didn\u0027t look human. He learned that the combination of his terrible looks and his wild behavior and the coffin had an effect on anybody who saw him. Distant atavistic fears of death and corpses and madness made them passive. He learned in an instant if he was prepared to act like a madman and cling to his coffin, these people would do anything for him. Their ancient superstitions worked in his favor. The VC patrol completed the excavation for him and loaded the coffin onto a buffalo cart. He sat up high on top of it and raved and gibbered and pointed west and they took him a hundred miles toward Cambodia.\\n\\n Vietnam is a narrow country, side to side. He was passed from group to group and was in Cambodia within four days. They fed him rice and gave him water to drink and clothed him in black pajamas, to tame him and assuage their primitive fears. Then Cambodians took him onward. He bounced and jabbered like a monkey and pointed west, west, west. Two months later, he was in Thailand. The Cambodians manhandled the coffin over the border and turned and ran.\\n\\n Thailand was different. When he passed the border, it was like stepping out of the Stone Age. There were roads, and vehicles. The people were different. More modern. But they had the same old fears deep down inside. The babbling scarred man with the coffin was an object for wary pity and concern. He was not a threat. He got rides on old Chevrolet pickups and in old Peugeot trucks left over from the French days and within two weeks he found himself washed up with all the other Far Eastern flotsam in the sewer they called Bangkok.\\n\\n He lived in Bangkok for a year. He reburied the coffin in the yard behind the shack he rented, working furiously all through his first night with a black-market entrenching tool stolen from the U.S. Army. He could manage an entrenching tool. It was designed to be used one-handed, while the other hand held a rifle.\\n\\n Once his money was safe again, he went looking for doctors. There was a large supply in Bangkok. Gin-soaked remnants of an empire, fired from every other job they ever had, but reasonably competent on the days they were sober. There wasn\u0027t much they could do with his face. A surgeon rebuilt his eyelid so it would almost close, and that was it. But they were thorough with his arm. They opened the wound again and filed the bones round and smooth. They stitched the muscle down and folded the skin over tight and sealed it all back up. They told him to let it heal for a month, and then they sent him to a man who built false limbs.\\n\\n The man offered him a choice of styles. They all involved the same corset to be worn around the bicep, the same straps, the same cup molded to the exact contours of his stump. But there were different appendages. There was a wooden hand, carved with great skill and painted by his daughter. There was a three-pronged thing like some kind of a gardening tool. But he chose the simple hook. It appealed to him, though he couldn\u0027t explain why. The man forged it from stainless steel and polished it for a week. He welded it to a funnel-shaped steel sheet and built the sheet into the heavy leather cup. He carved a wooden replica of the stump and beat the leather into shape over it, and then he soaked it in resins to make it stiff. He sewed the corset and attached the straps and buckles. He fitted it carefully and charged five hundred American dollars for it.\\n\\n He lived out the year in Bangkok. At first the hook chafed and was clumsy and uncontrollable. But he got better with it. With practice, he got along. By the time he dug up the coffin again and booked passage to San Francisco on a tramp steamer, he had forgotten all about ever having two hands. It was his face that continued to bother him.\\n\\n He landed in California and retrieved the coffin from the cargo sheds and used a small portion of its contents to buy a used station wagon. A trio of frightened longshoremen loaded the coffin inside and he drove it cross-country all the way to New York City, and twenty-nine years later he was still there, with the Bangkok craftsman\u0027s handiwork lying on the floor beside his bed, where it had lain every night for the last eleven thousand nights.\\n\\n He rolled over onto his front and reached down with his left hand and picked it up. Sat up in bed and laid it across his knees and reached out to take the baby\u0027s sock from his nightstand. Ten past six in the morning. Another day of his life.\\n\\n WILLIAM CURRY WOKE up at six-fifteen. It was an old habit from working the day shift on the detective squads. He had inherited the lease on his grandmother\u0027s apartment two floors above Beekman Street. It wasn\u0027t a great apartment, but it was cheap, and it was convenient for most of the precinct houses below Canal. So he had moved in after his divorce and stayed there after his retirement. His police pension covered the rent and the utilities and the lease on his one-room office on Fletcher. So the income from his fledgling private bureau had to cover his food and his alimony. And then when he got established and built it up bigger, it was supposed to make him rich.\\n\\n Six-fifteen in the morning, the apartment was cool. It was shaded from the early sun by taller buildings nearby. He put his feet on the linoleum and stood up and stretched. Went to the kitchen counter and set the coffee going. Headed to the bathroom and washed up. It was a routine that had always gotten him to work by seven o\u0027clock, and he stuck to it.\\n\\n He came back to the closet with coffee in his hand and stood there with the door open, looking at what was on the rail. As a cop, he had always been a pants-and-jacket type of guy. Gray flannels, checked sportcoat. He had favored tweed, although he wasn\u0027t strictly Irish. In the summer, he had tried linen jackets, but they wrinkled too easily and he had settled on thin polyester blends. But none of those outfits was going to do on a day when he had to show up somewhere looking like David Forster, high-priced attorney. He was going to have to use his wedding suit.\\n\\n It was a plain black Brooks Brothers, bought for family weddings and christenings and funerals. It was fifteen years old, and being Brooks Brothers didn\u0027t look a whole lot different from contemporary items. It was a little loose on him, because losing his wife\u0027s cooking had brought his weight down in a hurry. The pants were a little wide by East Village standards, but that was OK because he planned on wearing two ankle holsters. William Curry was a guy who believed in being prepared. David Forster had said probably won\u0027t be anything involved at all, and if it worked out that way he would be happy enough, but a twenty-year man from the NYPD\u0027s worst years tends to get cautious when he hears a promise like that. So he planned on using both ankle holsters and putting his big.357 in the small of his back.\\n\\n He put the suit in a plastic cover he had picked up somewhere and added a white shirt and his quietest tie. He threaded the.357 holster onto a black leather belt and put it in a bag with the two ankle holsters. He put three handguns in his briefcase, the.357 long-barreled Magnum and two.38 snub-nosed Smith and Wessons for the ankles. He sorted twelve rounds for each gun into a box and packed it beside the guns. He stuffed a black sock into each of his black shoes and stowed them with the holsters. He figured he would get changed after an early lunch. No point in wearing the stuff all morning and showing up looking like a limp rag.\\n\\n He locked up the apartment and walked south to his office on Fletcher, carrying his luggage, stopping only to get a muffin, banana and walnut, reduced fat.\\n\\n MARILYN STONE WOKE up at seven o\u0027clock. She was bleary-eyed and tired. They had been kept out of the bathroom until well after midnight. It had to be cleaned. The thickset guy in the dark suit did it. He came out in a bad temper and made them wait until the floor dried. They sat in the dark and the silence, numb and cold and hungry, too sickened to think about asking for something to eat. Tony made Marilyn plump up the sofa pillows. She guessed he planned to sleep there. Bending over in her short dress and preparing his bed was a humiliation. She patted the pillows into place while he smiled at her.\\n\\n The bathroom was cold. It was damp everywhere and smelled of disinfectant. The towels had been folded and stacked next to the sink. She put them in two piles on the floor and she and Chester curled up on them without a word. Beyond the door, the office was silent. She didn\u0027t expect to sleep. But she must have, because she awoke with a clear sense of a new day beginning.\\n\\n There were sounds in the office. She had rinsed her face and was standing upright when the thickset guy brought coffee. She took her mug without a word and he left Chester\u0027s on the ledge under the mirror. Chester was still on the floor, not asleep, just lying there inert. The guy stepped right over him on his way out.\\n\\n \"Nearly over,\" she said.\\n\\n \"Just starting, you mean,\" Chester said back. \"Where do we go next? Where do we go tonight?\"\\n\\n She was going to say home, thank God, but then she remembered he\u0027d already realized that after about two-thirty they would have no home.\\n\\n \"A hotel, I guess,\" she said.\\n\\n \"They took my credit cards.\"\\n\\n Then he went quiet. She looked at him. \"What?\"\\n\\n \"It\u0027s never going to be over,\" he said. \"Don\u0027t you see that? We\u0027re witnesses. To what they did to those cops. And Sheryl. How can they just let us walk away?\"\\n\\n She nodded, a small, vague movement of her head, and looked down at him with disappointment. She was disappointed because he finally understood. Now he was going to be worried and frantic all day, and that would just make it harder.\\n\\n IT TOOK FIVE minutes to get the knot in the necktie neat, and then he slipped his jacket on. Dressing was the exact reverse of undressing, which meant the shoes came last. He could tie laces just about as fast as a two-handed person. The trick was to trap the loose end under the hook against the floor.\\n\\n Then he started in the bathroom. He rammed all the dirty laundry into a pillowcase and left it by the apartment door. He stripped the bed and balled the linen into another pillowcase. He put all the personal items he could find into a supermarket carrier. He emptied his closet into a garment bag. He propped the apartment door open and carried the pillowcases and the carrier to the refuse chute. Dropped them all down and clanged the slot closed after them. Dragged the garment bag out into the hallway and locked up the apartment and put the keys in an envelope from his pocket.\\n\\n He detoured to the concierge\u0027s desk and left the envelope of keys for the real-estate guy. Used the stairway to the parking garage and carried the garment bag over to the Cadillac. He locked it into the trunk and walked around to the driver\u0027s door. Slid inside and leaned over with his left hand and fired it up. Squealed around the garage and up into the daylight. He drove south on Fifth, carefully averting his eyes until he was clear of the park and safe in the bustling canyons of Midtown.\\n\\n He leased three bays under the World Trade Center, but the Suburban was gone, and the Tahoe was gone, so they were all empty when he arrived. He put the Cadillac in the middle slot and left the garment bag in the trunk. He figured he would drive the Cadillac to LaGuardia and abandon it in the long-term parking lot. Then he would take a cab to JFK, carrying the bag, looking like any other transfer passenger in a hurry. The car would sit there until the weeds grew up under it, and if anybody ever got suspicious they would comb through the LaGuardia manifests, not JFK\u0027s. It meant writing off the Cadillac along with the lease on the offices, but he was always comfortable about spending money when he got value for it, and saving his life was about the best value he could think of getting.\\n\\n He used the express elevator from the garage and was in his brass-and-oak reception area ninety seconds later. Tony was behind the chest-high counter, drinking coffee, looking tired.\\n\\n \"Boat?\" Hobie asked him.\\n\\n Tony nodded. \"It\u0027s at the broker\u0027s. They\u0027ll wire the money. They want to replace the rail, where that asshole damaged it with the cleaver. I told them OK, just deduct it from the proceeds.\"\\n\\n Hobie nodded back. \"What else?\"\\n\\n Tony smiled, at an apparent irony. \"We got more money to move. The first interest payment just came in from the Stone account. Eleven thousand dollars, right on time. Conscientious little asshole, isn\u0027t he?\"\\n\\n Hobie smiled back. \"Robbing Peter to pay Paul, only now Peter and Paul are the same damn guy. Wire it down to the islands at start of business, OK?\"\\n\\n Tony nodded and read a note. \"Simon called from Hawaii again. They made the plane. Right now they\u0027re over the Grand Canyon somewhere.\"\\n\\n \"Has Newman found it yet?\" Hobie asked.\\n\\n Tony shook his head. \"Not yet. He\u0027s going to start looking this morning. Reacher pushed him into doing it. Sounds like a smart guy.\"\\n\\n \"Not smart enough,\" Hobie said. \"Hawaii\u0027s five hours behind, right?\"\\n\\n \"It\u0027ll be this afternoon. Call it he starts at nine, spends a couple of hours looking, that\u0027s four o\u0027clock our time. We\u0027ll be out of here.\"\\n\\n Hobie smiled again. \"I told you it would work out. Didn\u0027t I tell you it would work out? Didn\u0027t I tell you to relax and let me do the thinking?\"\\n\\n REACHER WOKE UP at seven o\u0027clock on his watch, which was still set to St. Louis time as far as he could remember, which made it three o\u0027clock in the morning back in Hawaii, and six in Arizona or Colorado or wherever they were seven miles above, and already eight in New York. He stretched in his seat and stood up and stepped over Jodie\u0027s feet. She was curled in her chair, and a stewardess had covered her with a thin plaid blanket. She was fast asleep, breathing slow, her hair over her face. He stood in the aisle for a moment and watched her sleep. Then he went for a walk.\\n\\n He walked through business class, and on into coach. The lights were dimmed and it got more crowded the farther back he walked. The tiny seats were packed with people huddled under blankets. There was a smell of dirty clothes. He walked right down to the rear of the plane and looped around through the galley past a quiet huddle of cabin staff leaning on the aluminum lockers. He walked back up the other aisle, through coach, into business class. He paused there a second and scanned the passengers. There were men and women in suits, jackets discarded, ties pulled down. There were laptop computers open. Briefcases stood on unoccupied seats, bulging with folders with plastic covers and comb bindings. Reading lights were focused on tray tables. Some of the people were still working, late in the night or early in the morning, depending on where you measured it from.\\n\\n He guessed these were middle-ranking people. A long way from the bottom, but nowhere near the top. In Army terms, these were the majors and the colonels. They were the civilian equivalents of himself. He had finished a major, and might be a colonel now if he\u0027d stayed in uniform. He leaned on a bulkhead and looked at the backs of the bent heads and thought Leon made me, and now he\u0027s changed me. Leon had boosted his career. He hadn\u0027t created it, but he had made it what it became. There was no doubt about that. Then the career ended and the drifting began, and now the drifting was ended, too, because of Leon. Not just because of Jodie. Because of Leon\u0027s last will and testament. The old guy had bequeathed him the house, and the bequest had sat there like a time bomb, waiting to anchor him. Because the vague promise was enough to do it. Before, settling down had seemed theoretical. It was a distant country he knew he would never visit. The journey there was too long to manage. The fare was too high. The sheer difficulty of insinuating himself into an alien lifestyle was impossibly great. But Leon\u0027s bequest had kidnapped him. Leon had kidnapped him and dumped him right on the border of that distant country. Now his nose was pressed right up against the fence. He could see life waiting for him on the other side. Suddenly it seemed insane to turn back and hike the impossible distance in the other direction. That would turn drifting into a conscious choice, and conscious choice would turn drifting into something else completely. The whole point of drifting was happy, passive acceptance of no alternatives. Having alternatives ruined it. And Leon had handed him a massive alternative. It sat there, still and amiable above the rolling Hudson, waiting for him. Leon must have smiled as he sat and wrote out that provision. He must have grinned and thought let\u0027s see how you get out of this one, Reacher.\\n\\n He stared at the laptops and the comb-bound folders and winced inside. How was he going to cross the border of the distant country without getting issued with all this stuff? The suits and the ties and the black plastic battery-driven devices? The lizard-skin cases and the memorandums from the main office? He shuddered and found himself paralyzed against the bulkhead, panicking, not breathing, completely unable to move. He recalled a day not more than a year ago, stepping out of a truck at a crossroads near a town he had never heard of in a state he had never been. He had waved the driver away and thrust his hands deep in his pockets and started walking, with a million miles behind him and a million miles ahead of him. The sun was shining and the dust was kicking up off his feet as he walked and he had smiled with the joy of being alone with absolutely no idea where he was headed.\\n\\n But he also recalled a day nine months after that. Realizing he was running out of money, thinking hard. The cheapest motels still required some small amount of dollars. The cheapest diners, likewise. He had taken the job in the Keys, intending to work a couple of weeks. Then he had taken the evening job, too, and he was still working both of them when Costello came calling three whole months later. So the reality was that drifting was already over. He was already a working man. No point in denying it. Now it was just a question of where and how much and for who. He smiled. Like prostitution, he thought. No going back. He relaxed a little and pushed off the bulkhead and padded back through to first class.\\n\\n The guy with the striped shirt and the arms the same length as Victor Hobie\u0027s was awake and watching him. He nodded a greeting. Reacher nodded back and headed for the bathroom. Jodie was awake when he got back to his seat. She was sitting up straight, combing her hair with her fingers.\\n\\n \"Hi, Reacher,\" she said.\\n\\n \"Hey, Jodie,\" he said back.\\n\\n He bent and kissed her on the lips. Stepped over her feet and sat down.\\n\\n \"Feel OK?\" he asked.\\n\\n She ducked her head in a figure eight to put her hair behind her shoulders.\\n\\n \"Not bad. Not bad at all. Better than I thought I would. Where did you go?\"\\n\\n \"I took a walk,\" he said. \"I went back to see how the other half lives.\"\\n\\n \"No, you were thinking. I noticed that about you fifteen years ago. You always go walking when you have something to think about.\"\\n\\n \"I do?\" he said, surprised. \"I didn\u0027t know that.\"\\n\\n \"Of course you do,\" she said. \"I noticed it. I used to watch every detail about you. I was in love with you, remember?\"\\n\\n \"What else do I do?\"\\n\\n \"You clench your left hand when you\u0027re angry or tense. You keep your right hand loose, probably from weapons training. When you\u0027re bored, you play music in your head. I could see it in your fingers, like you\u0027re playing along on a piano or something. The tip of your nose moves a little bit when you talk.\"\\n\\n \"It does?\"\\n\\n \"Sure it does,\" she said. \"What were you thinking about?\"\\n\\n He shrugged.\\n\\n \"This and that,\" he said.\\n\\n \"The house, right?\" she said. \"It\u0027s bothering you, isn\u0027t it? And me. Me and the house, tying you down, like that guy in the book, Gulliver? You know that book?\"\\n\\n He smiled. \"He\u0027s a guy gets captured by tiny little people when he\u0027s asleep. They peg him down flat with hundreds of tiny little ropes.\"\\n\\n \"You feel that way?\"\\n\\n He paused a beat. \"Not about you.\"\\n\\n But the pause had been a fraction of a second too long. She nodded.\\n\\n \"It\u0027s different than being alone, right?\" she said. \"I know, I was married. Somebody else to take into account all the time? Somebody to worry about?\"\\n\\n He smiled. \"I\u0027ll get used to it.\"\\n\\n She smiled back. \"And there\u0027s the house, right?\"\\n\\n He shrugged. \"Feels weird.\"\\n\\n \"Well, that\u0027s between you and Leon,\" she said. \"I want you to know I\u0027m not putting demands on you, either way. About anything. It\u0027s your life, and your house. You should do exactly what you want, no pressure.\"\\n\\n He nodded. Said nothing.\\n\\n \"So you going to look for Hobie?\"\\n\\n He shrugged again. \"Maybe. But it\u0027s a hell of a task.\"\\n\\n \"Bound to be angles,\" she said. \"Medical records and things? He must have a prosthesis. And if he\u0027s burned, too, there\u0027ll be records of that. And you wouldn\u0027t miss him in the street, would you? A one-armed man, all burned up?\"\\n\\n He nodded. \"Or I could just wait for him to find me. I could just hang out in Garrison until he sends his boys back.\"\\n\\n Then he turned to the window and stared out at his pale reflection against the darkness and realized I\u0027m just accepting he\u0027s alive. I\u0027m just accepting I was wrong. He turned back to Jodie.\\n\\n \"Will you give me the mobile? Can you manage without it today? In case Nash finds something and calls me? I want to hear right away, if he does.\"\\n\\n She held his gaze for a long moment, and then she nodded. Leaned down and unzipped her carry-on. Took out the phone and handed it to him.\\n\\n \"Good luck,\" she said.\\n\\n He nodded and put the phone in his pocket.\\n\\n \"I never used to need luck,\" he said.\\n\\n NASH NEWMAN DID not wait until nine o\u0027clock in the morning to start the search. He was a meticulous man, attentive to tiny detail as much in his ethics as in his professional speciality. This was an unofficial search, undertaken out of compassion for a troubled friend, so it couldn\u0027t be done on company time. A private matter had to be settled privately.\\n\\n So he got out of bed at six, watching the faint red glow of tropical dawn starting beyond the mountains. He made coffee and dressed. By six-thirty he was in his office. He figured he would give it two hours. Then he would have breakfast in the mess and start his proper work on time at nine.\\n\\n He rolled open a desk drawer and lifted out Victor Hobie\u0027s medical records. Leon Garber had assembled them after patient inquiries in doctors\u0027 and dentists\u0027 offices in Putnam County. He had bundled them into an old military police folder and secured it shut with an old canvas strap. The strap had been red, but age had faded it to dusty pink. There was a fiddly metal buckle.\\n\\n He undid the buckle. Opened the folder. The top sheet was a release signed by both the Hobie parents in April. Underneath it was ancient history. He had scanned thousands of files similar to this one, and he could effortlessly place the boys they referred to in terms of their age, their geographic location, their parents\u0027 income, their ability at sports, all the numerous factors that affect a medical history. Age and location worked together. A new dental treatment might start out in California and sweep the country like a fashion, so the thirteen-year-old boy getting it in Des Moines had to have been born five years later than the thirteen-year-old boy getting it in Los Angleles. Their parents\u0027 income dictated whether they got it at all. The high school football stars had treatment for torn shoulders, the softball players had cracked wrists, the swimmers had chronic ear infections.\\n\\n Victor Truman Hobie had very little at all. Newman read between the lines and pictured a healthy boy, properly fed, conscientiously cared for by dutiful parents. His health had been good. There had been colds and flu, and a bout of bronchitis at the age of eight. No accidents. No broken bones. Dental treatment had been very thorough. The boy had grown up through the era of aggressive dentistry. In Newman\u0027s experience, it was absolutely typical of any he had seen from the New York metropolitan area in the fifties and early sixties. Dentistry through that era consisted of a war on cavities. Cavities had to be hunted down. They were hunted with powerful X rays, and when they were found they were enlarged with the drill and filled with amalgam. The result was a lot of trips to the dentist\u0027s office, which no doubt had been miserable for the young Victor Hobie, but from Newman\u0027s point of view the process had left him with a thick sheaf of films of the boy\u0027s mouth. They were good enough and clear enough and numerous enough to be potentially definitive.\\n\\n He stacked the films and carried them out into the corridor. Unlocked the plain door in the cinder-block wall and walked past the aluminum caskets to the alcove at the far end. There was a computer terminal on a wide shelf, out of sight around a corner. He booted it up and clicked on the search menu. The screen scrolled down and revealed a detailed questionnaire.\\n\\n Filling out the questionnaire was a matter of simple logic. He clicked on ALL BONES and entered NO CHILDHOOD BREAKS, POTENTIAL ADULT BREAKS. The kid didn\u0027t break his leg playing football in high school, but he might have broken it later in a training accident. Service medical records were sometimes lost. He spent a lot of time on the dental section of the questionnaire. He entered a full description of each tooth as last recorded. He marked the filled cavities, and against each good tooth he entered POTENTIAL CAVITY. It was the only way to prevent mistakes. Simple logic. A good tooth can go bad later and need treatment, but a filled cavity can\u0027t ever disappear. He stared at the X rays and against SPACING he entered EVEN, and against SIZE he entered EVEN again. The rest of the questionnaire he left blank. Some diseases show up in the skeleton, but not colds and flu and bronchitis.\\n\\n He reviewed his work and at seven o\u0027clock exactly he hit SEARCH. The hard disk whirred and chattered in the morning silence and the software started its patient journey through the database.\\n\\n THEY LANDED TIN minutes ahead of schedule, just before the peak of noon, East Coast time. They came in low over the glittering waters of Jamaica Bay and put down facing east before turning back and taxiing slowly to the terminal. Jodie reset her watch and was on her feet before the plane stopped moving, which was a transgression they don\u0027t chide you for in first class.\\n\\n \"Let\u0027s go,\" she said. \"I\u0027m real tight for time.\"\\n\\n They were lined up by the door before it opened. Reacher carried her bag out into the jetway and she hurried ahead of him all the way through the terminal and outside. The Lincoln Navigator was still there in the short-term lot, big and black and obvious, and it cost fifty-eight of Rutter\u0027s dollars to drive it out.\\n\\n \"Do I have time for a shower?\" she asked herself.\\n\\n Reacher put his comment into hustling faster than he should along the Van Wyck. The Long Island Expressway was moving freely west to the tunnel. They were in Manhattan within twenty minutes of touching down and heading south on Broadway near her place within thirty.\\n\\n \"I\u0027m still going to check it out,\" he told her. \"Shower or no shower.\"\\n\\n She nodded. Being back in the city had brought back the worry.\\n\\n \"OK, but be quick.\"\\n\\n He limited it to stopping on the street outside her door and making a visual check of the lobby. Nobody there. They dumped the car and went up to five and down the fire stairs to four. The building was quiet and deserted. The apartment was empty and undisturbed. The Mondrian copy glowed in the bright daylight. Twelve-thirty in the afternoon.\\n\\n \"Ten minutes,\" she said. \"Then you can drive me to the office, OK?\"\\n\\n \"How will you get to the meeting?\"\\n\\n \"We have a driver,\" she said. \"He\u0027ll take me.\"\\n\\n She ran through the living room to the bedroom, shedding clothes as she went.\\n\\n \"You need to eat?\" Reacher called after her.\\n\\n \"No time,\" she called back.\\n\\n She spent five minutes in the shower and five minutes in the closet. She came out with a charcoal dress and a matching jacket.\\n\\n \"Find my briefcase, OK?\" she yelled.\\n\\n She combed her hair and used a hair dryer on it. Limited her makeup to a touch of eyeliner and lipstick. Checked herself in the mirror and ran back to the living room. He had her briefcase waiting for her. He carried it down to the car.\\n\\n \"Take my keys,\" she said. \"Then you can get back in. I\u0027ll call you from the office and you can come pick me up.\"\\n\\n It took seven minutes to get opposite the little plaza outside her building. She slid out of the car at five minutes to one.\\n\\n \"Good luck,\" Reacher called after her. \"Give them hell.\"\\n\\n She waved to him and skipped across to the revolving door. The security guys saw her coming and nodded her through to the elevator bank. She was upstairs in her office before one o\u0027clock. Her secretary followed her inside with a thin file in his hand.\\n\\n \"There you go,\" he said, ceremoniously.\\n\\n She opened it up and flipped through eight sheets of paper.\\n\\n \"Hell is this?\" she said.\\n\\n \"They were thrilled about it at the partners\u0027 meeting,\" the guy said.\\n\\n She went back through the pages in reverse order. \"I don\u0027t see why. I never heard of either of these corporations and the amount is trivial.\"\\n\\n \"That\u0027s not the point, though, is it?\" the guy said.\\n\\n She looked at him. \"So what is the point?\"\\n\\n \"It\u0027s the creditor who hired you,\" he said. \"Not the guy who owes all the money. It\u0027s a preemptive move, isn\u0027t it? Because word is getting around. The creditor knows if you get alongside the guy who owes him money, you can cause him a big problem. So he hired you first, to keep that from happening. It means you\u0027re famous. That\u0027s what the partners are thrilled about. You\u0027re a big star now, Mrs. Jacob.\" \\n\\n","sourceLink":"https://allnovel.net/tripwire-jack-reacher-3/page-15.html","bookId":2341,"book":{"id":2341,"title":"Tripwire (Jack Reacher #3)","description":"Storyline: Tripwire (Jack Reacher #3) \\n Jack Reacher, ex-military policeman relaxed in Key West until Costello turned up dead. The amiable PI was hired in New York by the daughter of Reacher\u0027s mentor and former commanding officer, General Garber. Garber\u0027s investigation into a Vietnam MIA sets Reacher on collision with hand-less \"Hook\" Hobie, hours away from his biggest score.\\n","cover":"https://allnovel.net/images/tripwire-jack-reacher-3.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/tripwire-jack-reacher-3.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:58:41 AM"}}
