{"id":99262,"no":3,"title":"Page 3","content":"She stared anywhere she could but at him, knowing that his eyes were still focused on her. She figured she must be a mess; she’d consumed way too much alcohol and the wind had blown her hair loose with several strands refusing to cooperate, repeatedly falling across her face. Just when she didn’t think the silence could become any more awkward, there was a flickering of the lights, followed by darkness. There was nothing. No music coming through the speakers, no light whatsoever, not even from the buttons. Jessica could feel her heart pounding so hard she was sure the noise of it hitting her ribs could be heard by Alex. “Jessica, are you alright?” he asked her. “You aren’t claustrophobic, are you?” She took a couple of deep breaths before she said, “I’m not afraid of small places but I’m not a huge fan of the dark.” She was trying to stay brave but the seconds were ticking by and the pure blackness felt like it was closing in on her. She wouldn’t panic. The lights would flash back on at any moment and the elevator would continue going up, getting her out of the blackout. She started counting in her head. She reached twenty when she felt Alex’s hand on her arm. She jumped at his touch. She was trying so hard not to be frightened but the darkness was all consuming. “Everything will be okay. This will all be over in a moment. Buildings have contingency plans for when this kind of thing happens,” he tried to reassure her. “I don’t understand why there isn’t any noise at all,” she said as her voice shook. “We’re most likely around the fourth floor so there wouldn’t be any noise from the lobby,” he reasoned. “I wonder what happened.” “I went out earlier in the evening and there was a pretty spectacular storm outside. A power line most likely got knocked over,” she said. Talking to him was making a little of her fear subside and his touch on her arm let her know she wasn’t alone. “I’m going to feel around for the phone and see if I can get someone on the line. They need to know we’re in here and I can find out what’s happening,” he explained before releasing her arm. She had to fight herself so she wouldn’t reach out and grab him. She sunk to the floor and hugged her knees to her chest. She was grateful now she’d had a few extra drinks because it was the only thing calming her nerves. “The phone isn’t picking up.” Alex’s voice startled her. “We’re going to have to wait this out but don’t worry, elevators are extremely secure and it won’t take them long to get us out.” His voice drew closer and then his foot kicked her in the ribs. She let out a whoosh of breath. “I’m sorry, are you okay?” he dropped to his knees and began running his hands from her legs up to her side. Her lungs exploded in a gasp, as heat pooled in her core. “I’m fine, really, you barely touched me at all,” she said huskily. He seemed to realize what he was doing because his hands stilled suddenly and then they were gone. She breathed another sigh, not sure if it was relief or disappointment. Alex could hear the huskiness in her voice and it sent a kick right to his gut. He wanted her badly and now they were alone…in the dark…for who knew how long. If he didn’t keep his distance he wouldn’t be responsible for what happened next. “How long do you think it’ll take for them to get us out?” she asked, trying to fill the silence. “It won’t take long. Did you enjoy yourself this evening? I think half a million was raised by the time I left,” he said, seeming to know she needed the comfort of words to fill the void. She didn’t speak for several moments and he started to wonder if she was having a panic attack. He really hoped not. He didn’t know how to deal with hysterical women. “You know, we really are safe Jessica. These things don’t just plunge through the shaft and explode on the bottom, like in the movies. That’s just Hollywood’s way of making things exciting,” he said in an attempt to comfort her. When she still didn’t speak, he moved next to her again and let his leg rest against hers. Her body seemed to relax and he heard her breath escape in a sigh. “Sorry. I just really don’t like the dark,” she finally said to him. “What do you do in your free time?” she asked, needing to hear the sound of his voice. “I like to travel. I handle most of our international business, because my older brother has so much work to do here and Mark would choose to never fly if he could get away with it. I, on the other hand, am happy to be in a different country each month. My father usually has to drag me home,” he said with a chuckle. He was noticing lately though he was staying home more often. He’d started to really miss his family. He was even finding himself enjoying the time spent on his brother’s ranch, herding cattle. Many things that had once excited him were starting to lose their appeal. He figured he was just getting older. Of course he was only thirty-two and shouldn’t be thinking of himself as aging. “What about you? What makes Jessica happy?” “I used to travel a lot with my father but I grew bored of it. I’m really more of a homebody now. I do a lot of volunteer work which keeps me plenty busy. I’ve been taking some courses at the college, nothing major, just some fun art, cooking and photography classes. I have a Masters degree in Business because my father wanted me to go into the family corporation but I can’t stand sitting behind a desk all day,” she trailed off. Alex was surprised she’d gone so far in school. Most of the ladies he knew, with her amount of money at their disposal, didn’t feel a need to go to school. They just lived on their parents’ money and name until they snagged themselves a rich husband. Jessica sat there, extremely aware of Alex’s leg pressed up against hers. She was incredibly attracted to him but it didn’t matter because men like him didn’t give her the time of day except for a quick trip to bed. He was far too sexy and masculine for her. They always went after the ditzy blondes with huge breasts and no brains. The kind of woman like the bleach-blonde she’d seen him dancing with earlier that evening. The kind of woman who they considered a trophy for their arms. She wouldn’t reveal to him how her heart ached to be loved for herself and not her money. She wanted to be desired and to be the only thing on a man’s mind. More silence engulfed them, making her hyper aware of his scent. It would be so easy to lean into him and find some comfort. The elevator made a groaning sound and jerked slightly. Jessica let out a gasp and then she locked her arms around Alex, shaking in fear. She was going to die in the dark, tiny box. “It’s okay Jessica, the elevator’s just settling a bit. I promise you it won’t fall. There are several back-up safety features for all emergencies. Even if it did fall, which I guarantee you it won’t, we’d get a little bruised up in the worst case scenario. You have nothing to worry about.” He pulled her onto his lap and wrapped his arms around her trembling body. He kept speaking in a soothing whisper and stroked her from the small of her spine, up to her neck and back down again. She didn’t know if it was his words or the touch of his hands but soon she wasn’t so afraid. “I really am sorry Alex. I’ve just always had a fear of the dark. Believe it or not, I still have a small light on at my place. I know logically that nothing is going to come and get me from the dark but I think I watched far too many Stephen King movies as a child and they stuck with me,” she said with a little self depreciating laugh. They began talking about different topics, just passing the time. He didn’t push her aside and she didn’t offer to move from his lap. She knew she probably should but she felt so much comfort sitting there she couldn’t will herself to move. After more time passed the rubbing stopped comforting her and started making heat pool inside her stomach. His hands were traveling lower with each pass and more wide spread. She could feel him touching the sides of her breasts, stomach and hips. She started breathing heavier and could feel her body becoming more aroused. She felt his hand run up her neck and grip the back of her head. He turned her and then his lips were finally pressed against hers. She would’ve thought the heat from their lips colliding would’ve been enough to sear the walls. His tongue slipped inside her mouth and her body exploded with pleasure. She’d never been kissed so hungrily. The passion in his kiss left no doubts he would be a fantastic lover. She knew she needed to stop them from continuing. She was trying to gain the will-power to pull away when his hand slid up under her skirt and skimmed her bare hip. The only thing between his hands and her heated core was a wisp of fabric, which she was surprised hadn’t melted away from the burning of her body. Without breaking the kiss he shifted her body so she was straddling his lap, allowing his hands more access to explore her. His hands roamed all over, making her arch into him. She could feel his desire pressing against her aching heat and she damned the clothes keeping them apart. She gave into her own internal battle and let herself feel everything he was doing to her. He ran his tongue from her mouth to her neck, gently biting at her pounding pulse point. She wiggled against him while he slowly slid the thin strap of her dress down her shoulder, with his lips following its process. She felt the cool air touch her aching nipples only seconds before his mouth was lavishing the hardened peaks. She threw her head back and groaned as rolling waves of sensation washed through her. He thoroughly loved her tender breasts before his mouth licked and kissed its way back up her neck and then fastened onto her lips once more. While he continued kissing her she felt him shifting their clothing around. Finally, there was nothing between them and he was enclosed within her in one swift thrust. She gasped out loud at the unbelievable pleasure of their joined bodies. He gripped her hips, leading her up and down on his large erection. She quickly took over and started moving, encouraged by his quickly accelerated breathing. He held her head with one hand, pulling her closer, sealing their mouths, mimicking the movements of their bodies with his tongue. He brought his other hand to her swollen womanhood and flicked it, sending her over the edge in an explosion of pleasure. She began shaking around him, gripping him even tighter into her pulsating body. He grabbed her lower back and thrust up into her one final time, letting out a groan of pleasure as he spilled his seed deep inside of her. Jessica collapsed against him as they both tried to regain their breath. They were still connected together. She was so satisfied she wanted nothing more than to lay her head against his chest and fall asleep in his arms. There was another jerk of the elevator and then the lights flickered. She jumped off him in a panic, quickly straightening out her clothing. Luckily, he’d only taken the time to move her clothes instead of removing them. She backed away until she felt the wall behind her. She prayed he was putting his clothes back into place too. Suddenly the lights turned back on and stayed on. Jessica was happy to see him standing there, fully clothed. He had a look of guilt and regret on his face. The elevator started to move downward. It must be standard procedure to return to the lobby after a power failure.","sourceLink":"https://allnovel.net/the-billionaire-s-dance-billionaire-bachelors-2/page-3.html","bookId":2007,"book":{"id":2007,"title":"The Billionaire\u0027s Dance (Billionaire Bachelors #2)","description":"Storyline: The Billionaire\u0027s Dance (Billionaire Bachelors #2) Joseph Anderson has decided it is time his three successful sons find brides. Joseph wants grandchildren to fill his huge mansion, and he wants them immediately. He was successful in his eldest son\u0027s match, and in this book, his scheming brings Alex and Jessica together. Alex is a confirmed Bachelor who loves to travel all around the globe and romance as many women as possible. That is until he meets Jessica Sanders. One night with her and he is changing his views of bachelorhood and starting to think that married life is the new way for him. Jessica comes from a wealthy family, and has had one too many good looking men take advantage of her family\u0027s money. When she meets confirmed bachelor and known playboy Alex Anderson, she is distrustful of his flirting, and tries to avoid him at all costs. That is until they end up trapped in an elevator, and her fear of the dark, tight space is greater than her fear of the man she is trapped with. Alex comforts her by making steamy love in the elevator, and when she runs away once they are free, he walks away wanting more. One year later he finds out he is a father, and he makes sure Jessica has no other choice than to let him do the honorable thing. They have passion, romance, love and family to help guide them through the chaos.","cover":"https://allnovel.net/images/the-billionaire-s-dance-billionaire-bachelors-2.jpg","author":"Melody Anne","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-billionaire-s-dance-billionaire-bachelors-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:40:13 PM"}}
