{"id":108832,"no":10,"title":"Page 10","content":"\\n\\n Our gazes met, locked. “I prefer Ali.”\\n\\n She nodded and offered me a warm smile. “I looked over your transcript from Carver Academy and liked what I saw. With straight A’s, I’m guessing you didn’t sleep in class.”\\n\\n Ouch. “I wasn’t sleeping, I promise.”\\n\\n Her smile grew, letting me know that she wasn’t offended. “I know reading and writing aren’t everyone’s favorite thing, but give me a chance tomorrow, okay? If you don’t like what I’m saying, if I fail to engage you, fine. Sleep or daydream or whatever you want to call it.”\\n\\n Fair enough. “You have my word.”\\n\\n “Good.” She motioned to the door with a tilt of her chin. “Go on. You’ve got places to be, I’m sure.”\\n\\n I stepped into the hall—and prayed the world would suddenly end. Frosty and one of his more feral friends were waiting for me. Clearly. Their gazes zeroed in on me—arrow, meet bull’s-eye—and they leaped into motion, closing the distance between us. I bet they were here to warn me away from Cole.\\n\\n How humiliating! I kept walking, and they kept pace beside me, flanking me. Testosterone walled me in, neatly shutting out the rest of the world.\\n\\n “S’up. I’m Frosty,” the rough-looking blond said. Up close, I saw that his eyes were not completely brown but a pretty blueberry with flecks of chocolate.\\n\\n My stomach growled. Okay, so I was hungry, and that was probably why his eyes reminded me of delicious food. So what. An appetite was a good thing, and I’d been without one all summer.\\n\\n “This here’s my boy Bronx,” he added when I failed to respond.\\n\\n “I’m Ali.” Either I hadn’t noticed Bronx earlier—so not likely—or he’d been running late. “Bronx, huh? Is that where you’re from?”\\n\\n “Nope,” Frosty answered for him.\\n\\n Bronx said nothing, but oh, did he stare. For a guy with barbells in both of his eyebrows and hair dyed an electric blue, that stare bypassed demon-dark and went straight to devil-damned.\\n\\n “Okay,” I said. What else was I supposed to say?\\n\\n A group of jocks passed us. To my surprise, they practically flattened themselves against the row of lockers to get out of the way of my giant, muscled bookends. I could even smell their fear, an acrid scent coating the air between us, stinging my nostrils.\\n\\n So weird.\\n\\n At my old school, jocks had ruled, their word law, and the only thing they’d worried about was the next game. Different schools, different worlds, I guess.\\n\\n “Boys,” I heard Dr. Wright say. I picked up the clack clack of her heels before I spotted her at the end of the hall. “You’re not manhandling Miss Bell, correct?” She spoke as she walked toward us. Her gaze remained locked on Frosty. “I’d hate to have to ruin the rest of your day with detention.”\\n\\n “No reason to ruin, Dr. Wright,” he said with military precision at the same time I said, “I’m fine.”\\n\\n She wasn’t satisfied. “What do you want with her?”\\n\\n Frosty smiled, all innocence. “Just to talk, what else?”\\n\\n “Why?”\\n\\n Were all principals this nosy?\\n\\n “Because she’s cute?” Frosty replied, a question rather than a statement.\\n\\n In that moment, I could have fallen flat on my face and experienced less embarrassment.\\n\\n Dr. Wright’s suspicions were not assuaged, judging by the narrowing of her eyes, but she briskly passed us without trying to stop us. “Just make sure you watch your mouths or I’ll have to call your guardians,” she threw over her shoulder.\\n\\n Frosty shuddered. Bronx saluted with mock respect.\\n\\n “So how do you know Kat?” Frosty asked me, jumping back to the conversation. As determined as he looked, he was done with distractions.\\n\\n I relaxed. They weren’t here for Cole, and they weren’t here because I might be—or might not be—moderately attractive. “We ran into each other during summer break.” Hopefully that was the right thing to say. I wasn’t sure about proper etiquette when dealing with a friend’s ex.\\n\\n “Where at?” he asked, pretending an ease those M\u0026M eyes failed to project.\\n\\n “Well, uh…hmm.” How could I answer that without spilling info about myself?\\n\\n The two boys “guided” me around a corner by pressing their shoulders into mine and steering me. I’d wanted to go the other way, to my locker. Whatever. I could deal. I might not want anything to do with violence, but I could handle myself, even with bruisers like these. My dad had made sure of that.\\n\\n In fact, I’d taken my dad down a time or twelve, flipping him over, popping his eye and once even breaking his nose. Every time I’d bested him, he’d smiled, so wonderfully proud of me.\\n\\n A burning in my eyes…a tremor in my chin. Dang it, I needed to concentrate on the here and now.\\n\\n What had Frosty asked me? Oh, yeah. “If you want to know where I met Kat, you’ll have to ask Kat.” There. An answer without being an answer. Meanwhile, I’d be pulling her aside the next time I saw her and asking her to mentally torch the details.\\n\\n Frosty acted as if he’d just been stabbed in the gut. “Cruel, Ali, so cruel. At least give me a hint. Pretty please with cherries on top of me.”\\n\\n Charming. But I couldn’t forget that he’d cheated on Kat. Thinking fast, I said, “Okay, here’s a hint. A lot of people were there. There was some screaming, definitely some writhing. A looot of touching.” Doctors were very hands-on.\\n\\n In the next instant, I was given a deeper glimpse of the criminal-in-the-making Frosty was. That mask of affability fell away, revealing hard, dark eyes and lips compressed with rage. “Did she touch anyone? Did anyone touch her?”\\n\\n Dude. You left her for the entire summer. “It’s been nice talking to you and everything, but I really need to—”\\n\\n We rounded another corner and I slammed into something solid, losing my concentration as I stumbled backward.\\n\\n Bronx caught me, righted me and then let go of me as if I’d just given him third-degree burns.\\n\\n “I’m sorry,” I began, focusing on the person I’d hit.\\n\\n A girl, shorter than me by several inches. Silky dark hair curled to the middle of her back and framed a face God might have used to design his favorite angels. Her makeup was perfect. Her skin was slightly sunburned but still perfect. Her clothes were expensive and sexy, yet still elegant—and perfect. She wore a pink cashmere sweater and a flirty white skirt. She was the only diamond in a sea of glass.\\n\\n I wasn’t into girls, but…wow. This one could probably turn anyone. Not even Kat and her catalog friends could compare.\\n\\n “Is this your newest slice of tail?” she asked Frosty, all kinds of you’re beneath me in her tone. A tone clearly directed at me.\\n\\n Maybe she wouldn’t be able to turn me. I wasn’t into nasty.\\n\\n “Back off, Mackenzie,” Frosty said.\\n\\n Mackenzie. As in, Mackenzie Love. This was Cole Holland’s ex?\\n\\n Of course she is, I thought next, wanting to laugh without a bit of humor. Beautiful boys dated beautiful girls. That’s how the world worked. And yes, by those rules, I was destined to be with a lanky loner with a tragic past. Wonderful.\\n\\n “Cole wants you,” she snapped at the boys, “so your little missionary trip will have to wait.”\\n\\n Cue my exit. I’d already said my goodbye, so I pushed my way past Mackenzie and entered—the cafeteria. So that’s where they’d been taking me. Time for lunch, then. No wonder my stomach had been growling. The smell of food paired with a thousand other appetites could have turned a mannequin into a savage.\\n\\n Already lines snaked from every direction. I had no idea what was what, so I scanned the area until I spotted a familiar face in the far corner.\\n\\n Kat waved me over. Behind me, Frosty yelled for my attention while Mackenzie called him an idiot. Ignoring them, I tromped forward. The deeper I entered the room, the more I noticed the grease that coated the air. I also caught hints of sugar, perfume and cologne, everything combining to form a cloying musk. Goodbye appetite.\\n\\n “What were you doing with Frosty?” Kat asked the moment I plopped down beside her.\\n\\n No rage. Good. “He and that other boy, Bronx, were waiting for me after class. Frosty asked me how the two of us had met.”\\n\\n The roses drained from her cheeks. “What did you tell him?”\\n\\n I bullet pointed my response, praying I’d gotten it right.\\n\\n Relief wafted from her, her color returning. “Rock on! You did almost as awesome a job as I would have done.”\\n\\n I so needed that kind of confidence. “Thank you.”\\n\\n “Just don’t tell anyone where we really met, okay?” she said, her gaze pleading at me.\\n\\n No problem there. But why didn’t she want anyone to know?\\n\\n Before I could question her, the rest of her troop arrived. I greeted each with a half smile, since that’s all that I was currently capable of.\\n\\n As the girls launched into details about everything they’d learned about people I didn’t know, I felt the little hairs on the back of my neck rise. I endured the sensation for several minutes before caving and twisting in my seat, searching for the source of my discomfort.\\n\\n Cole and his gang sat a few tables away. Cole was…staring at me. Staring—such a mild word for the slitted gaze leveled on me, piercing me. If eyes could throw daggers, I’d have a few embedded in my chest. (Not that that’s where he was looking, mind you.)\\n\\n I gathered my courage and maintained contact, waiting, expectant. Except, there was no vision this time. No mental unfolding of us kissing. This morning must have been a one-time thing. A fluke.\\n\\n I was relieved about that. I wasn’t disappointed. Besides, things were better this way. Proof: the angelic Mackenzie was perched next to him, her arm draped around his shoulders, staking her claim, warning me away. She, too, glared at me as she whispered something in his ear. I didn’t have to be a mind reader to know she’d just plotted my social death.\\n\\n Whatever. Popularity wasn’t a concern for me. \\n\\n","sourceLink":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1/page-10.html","bookId":2520,"book":{"id":2520,"title":"Alice in Zombieland (White Rabbit Chronicles #1)","description":"Storyline: Alice in Zombieland (White Rabbit Chronicles #1) \\n She won’t rest until she’s sent every walking corpse back to its grave. Forever. \\n Had anyone told Alice Bell that her entire life would change course between one heartbeat and the next, she would have laughed. From blissful to tragic, innocent to ruined? Please. But that’s all it took. One heartbeat. A blink, a breath, a second, and everything she knew and loved was gone. \\n Her father was right. The monsters are real…. \\n To avenge her family, Ali must learn to fight the undead. To survive, she must learn to trust the baddest of the bad boys, Cole Holland. But Cole has secrets of his own, and if Ali isn’t careful, those secrets might just prove to be more dangerous than the zombies…. \\n I wish I could go back and do a thousand things differently. \\n I\u0027d tell my sister no. \\n I\u0027d never beg my mother to talk to my dad. \\n I\u0027d zip my lips and swallow those hateful words. \\n Or, barring all of that, I\u0027d hug my sister, my mom and my dad one last time. \\n I\u0027d tell them I love them. \\n I wish... Yeah, I wish.\\n","cover":"https://allnovel.net/images/alice-in-zombieland-white-rabbit-chronicles-1.jpg","author":"Gena Showalter","type":"Horror","source":"allnovel","link":"https://allnovel.net/alice-in-zombieland-white-rabbit-chronicles-1.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:25:32 PM"}}
