{"id":74570,"no":17,"title":"Page 17","content":"I want to be the starting point guard. I also feel like I should be helping Boy21, and I’m not sure Coach is right about Russ needing to play b-ball. But I’m not the coach, and so I say, “I’ll shoot the ball when I’m told to shoot the ball from now on.” “Good,” he says. “See you tomorrow at practice.” 27 DAD LEFT JUST AS SOON AS the game ended. He had to get to work on time. Because I want to be alone, I tell Pop that I’m going out for hot wings with the team. Erin’s parents take the old man home and I walk through the gray, dirty, trash-everywhere streets of Bellmont. Almost all the streetlights have been smashed with rocks, so it’s dark. It’s frigid out and I’m still in my shorts, with a winter coat on top. As I walk, I’m surprised that I’m not thinking about the game or losing my starting position. I’m thinking about Boy21, and how bad he must be hurting. People just don’t go around saying they’re from outer space for nothing. The deep bass of an expensive car-stereo system approaches from behind. I turn my head, but all I see are two bright headlights. Somehow I know the car’s going to stop, and it does just as it reaches me. The music turns off and I hear, “Yo, White Rabbit, get in.” It’s Terrell’s voice. I walk to the passenger-side window. He’s riding with his brother Mike. Both of them are wearing gold chains and huge diamond earrings. “Don’t just stand there lookin’ at us,” Mike yells from the driver’s seat. “Get your lily ass in the car before you freeze it off in those ball trunks. Your knees look like snowballs!” I open the back door and hop in, but Mike doesn’t drive. “You knew about this outer-space shit from the beginning, didn’t you?” Terrell asks. I don’t see the point of lying, so I nod. Terrell has turned his body so that he’s facing me, but Mike’s looking at me through dark sunglasses in the rearview mirror. It’s after ten and he’s wearing sunglasses. I smell some sort of sweet smoke in the air and then see that Mike is puffing on a joint. I want to get out of the car, but I know I can’t. “How crazy is he?” Terrell says. “I don’t know.” “Crazy like he might come to school with a gun and start shooting people, or crazy like he just says amusing things about outer space?” Terrell says. “The latter, I think,” I say. “What you mean the ladder?” Mike says. “You gon’ climb a damn tree or somethin’?” “So he’s just all talk?” Terrell says. “I don’t really know.” “Coach ask you to help him, right?” Mike says. “Yep.” “So you go and be his friend even though he gon’ end up takin’ your position?” Mike says. “Right.” “That’s White Rabbit for you,” Terrell says. “You good people,” Mike says, and then he takes a drag off his joint. “I like you, White Rabbit. You got what the old people call character.” “Russ is crazy as a mofo, but he makes us a better team,” Terrell says. “I’m’a drive you home,” Mike says. “You all right.” I don’t want to let Mike drive me home because he’s high, but there’s nothing I can do about it, so I just sit quietly in the backseat. When one of the most feared drug dealers in the neighborhood wants to drive you home, you let him drive you home. I know he’s strapped. There are probably several guns in the car, and who knows what’s in the trunk. We pull up to my house, and just before I get out, Mike says, “You need any paper, White Rabbit?” “Money,” Terrell says when I don’t answer. I shake my head no. “Let us know if your family ever needs paper,” Mike says. “You can always work for us. We like to employ people with character.” I nod once, even though I never want to be a drug runner, and then get out as fast as I can. When Mike and Terrell drive away I go inside and find my grandfather drinking a beer. My dad’s already at work, so it’ll be just Pop and me tonight. “You feel like shit, don’t you?” Pop says. “Yeah.” “Well, you shouldn’t. Your father’s always telling you that you can outwork talent, but I got a news flash for you, Finley. You could work as hard as you humanly can for the rest of your life and you’ll never be as good as what we saw tonight.” He takes a swill from his bottle and says, “I fancy a bath. You game?” I nod and push Pop into the bathroom, where I strip the old man and lift him into the tub. As I hold the detachable showerhead for Pop, he washes his hair, and I watch the suds run down his neck and over Grandmom’s green rosary beads. Pop won’t even take them off to bathe. When he finishes, he tells me to turn off the water and when I do he says, “Coach will work you into the games. Don’t worry. It’ll work out.” I’m wondering what Boy21 is thinking right now. Did he enjoy playing tonight? Did it make him feel better? Does basketball help him the way it helps me? And, if so, does he need the starting position more than I do? “I love watching you play ball, Finley. Best part of my days lately—makes me feel like I still have legs, even—but life’s more than games. This Russ, he’s special. Anyone can see that. And it’s hard to be special, Finley. You understand what I’m saying?” I don’t understand what Pop is saying, but I nod anyway. “You’re special too, Finley. You don’t always get to pick the role you’re going to play in life, but it’s good to play whatever role you got the best way you can,” Pop says. “And I know I’m a damn hypocrite for saying that tonight, but that don’t make what I said a lie. We’ve both had hard lives so far. No favors done for either of us.” I can’t think of anything to say, especially since I’m not special at all, so I just get Pop out of the tub and into bed. I lie awake all night thinking about what has happened and what it all means. 28 THE NEXT DAY, JUST AS SOON AS his grandfather drives out of sight, Boy21 reaches into his over-the-shoulder bag and pulls out a brown robe made from bath towels safety-pinned together. He slips his head and arms through the holes. On his chest he has spelled the word SPACE with red fabric that looks like it was once a T-shirt. He then ties a sparkly gold cape around his neck. The cape looks store-bought and expensive, as it has a silver clasp and the material is much heavier than what might be used to make a cheap Halloween costume. I just stare at Boy21 when he puts on a motorcycle helmet that he has spray-painted silver. He’s glued a golden eagle to the top of the helmet—the kind of eagle you might see at the end of a flag post in a classroom. I wonder why he hid the robe and cape when his grandfather must have seen the helmet, but I don’t ask, of course. “No more Russ Washington,” he says. “It’s Boy21 everywhere I go now. The time to leave Earth is soon. No point in lying about everything now. They’ve all seen my extraterrestrial powers anyway.” I give him a look that says, You sure about this? Boy21 ignores my look and says, “And after practice I’d like you to listen to a special CD that will explain everything. I’m going to ask Wes to join us as well. Will you listen to the recruiting CD with me?” I nod. What type of CD could explain everything? I want to know. But I also realize that Boy21 is losing it—or is he? Students mob us as we approach the high school. They want to know why Boy21’s wearing what he’s wearing, where exactly in outer space he came from, and how many points he’ll score in the next game. The best-looking girls blink a lot, say, “Hey, Boy21,” blow him kisses, and even reach up to touch his silver helmet in a sexy way. It’s almost unbelievable, especially if you don’t know how popular basketball is in Bellmont. More and more people crowd around us, but Boy21 just keeps moving forward with this very eerie smile on his face. Who knew that acting like a total freak would make you popular? Or is it just because he’s an extraordinary basketball player? As everyone continues to press in around us and yell questions, I start to feel invisible because no one says a word to me, even though they obviously know Boy21 and I are tight. No one ever said much to me before, but now that Boy21 has appeared, it makes me realize that maybe he has something I don’t. Not only athletic ability, but also star power, no pun intended. When we finally arrive at the high-school steps, he stops and says, “I will score many, many points in the next game—definitely more than forty, guaranteed. And I come from a place that you don’t even know exists. I will be returning to that outer-space place shortly, and anything else you might learn about me will come through my Bellmont Earthling tour guide, Finley, who will also serve as my Earthly documentarian.” Most of the students surrounding us laugh as if Boy21 is joking, but I can see Erin twenty people deep in the crowd, and she’s biting down on her lip. “Finley,” Boy21 says, “please tell the masses all they need to know about Boy21.” Everyone turns and looks at me, but, of course, I don’t speak—because I’m a minimal speaker, yes, but what would I say, even if I were a blabbermouth? “No fair!” “White Rabbit never says anything!” “How do you run basketball like that?” “We wanna know what you playin’ at!” “What’s up with that spaceman outfit? You in the Black Eyed Peas now?” “Who are you?” “I’m Boy21 from the cosmos!” Russ says, and then he turns so quickly that his sparkly gold cape flies up into the air. I march after him into the building. The questions continue all day. Boy21 just smiles and smiles and repeats the same standard lines about coming from the cosmos to learn about emotions. The less he says to our classmates, the more popular he seems to become. Everyone wants to know his secret, and that’s his power—just having one. The local papers don’t run any information about Boy21 except the number of points he scored in the game, and his assists and rebounds. The editors were probably too scared to report what Russ actually told them, but I wonder how long it’ll be before his real story comes out and he’ll have to face the truth about his past. Our teachers don’t ask Russ about his costume, which leads me to believe that they were instructed not to, because he looks absolutely ridiculous—like an insane person dressed up for Halloween or the Mummers Parade or something even crazier. I worry about lunch, when we’ll see the rest of the team without the close supervision of teachers, but we’re called down to guidance and separated just before it’s time to eat.","sourceLink":"https://allnovel.net/boy21/page-17.html","bookId":2713,"book":{"id":2713,"title":"Boy21","description":"Storyline: Basketball has always been an escape for Finley. He lives in gray, broken Bellmont, a town ruled by the Irish Mob, drugs, violence, and racially charged rivalries. At home, he takes care of his disabled grandfather, and at school he’s called “White Rabbit”, the only white kid on the varsity basketball team. He’s always dreamed of getting out somehow with his girlfriend, Erin. But until then, when he puts on his number 21, everything seems to make sense. Russ has just moved to the neighborhood. A former teen basketball phenom from a privileged home, his life has been turned upside down by tragedy. Cut off from everyone he knows, he now answers only to the name Boy21—his former jersey number—and has an unusual obsession with outer space. As their final year of high school brings these two boys together, “Boy21” may turn out to be the answer they both need.","cover":"https://allnovel.net/images/boy21.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/boy21.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:31:26 AM"}}
