{"id":74558,"no":5,"title":"Page 5","content":"“Are you finished eating?” Mrs. Allen asks me. I nod, even though I’m not, and say, “Thanks.” “You boys go have your fun,” Coach says, and then I’m back in Boy21’s room watching him arrange glow-in-the-dark sticker constellations. “You don’t talk much, do you?” Boy21 asks, looking over his shoulder. “No.” “Did something happen to you?” he asks. Truth is, many things have happened to me, both good and bad, stuff that would take a lot of words to explain, too many words for me. There’s a part of me that wants to discuss my past, why I don’t talk much, outer space even, everything, but it’s like my mind is a fist and it’s always clenched tight, trying to keep the words in. Boy21 faces me and says, “Do you believe I’m from outer space?” I shrug. “You will when I ascend, but until then I’ll need someone to help me complete my mission here on Earth. You seem like you are quite emotional, and I am very interested in studying emotions. Are you trustworthy?” I nod, because I’m generally trustworthy, but I also smile, because I’m not emotional at all. At least, I try not to be. He smiles back. “Will you show me the ways of your culture?” he asks, and then adds, “Please.” “You playing basketball this year?” Boy21 turns his back on me and says, “I am programmed to be an excellent basketball player. No Earthling can beat me. But I think I’ll be long gone before the season rolls around. I’ll be back in the cosmos well before the time period that you Earthlings call November.” I feel relieved when he says this because if he’s gone by November, it means he’ll miss basketball season, and then I remind myself how crazy this whole situation is. He’s absolutely nuts. There’s no way he’d be able to get through the demands of an organized basketball season, especially claiming to be from outer space. Basketball is a game of rules that you must submit to for the good of the team, and Boy21 is already not playing by the rules. I start to think about what’s going to happen to Russell if he pretends to be from outer space once school starts. At lunch he’ll be relegated to my table. Students will dump carrots on his plate. I don’t like the way things are in Bellmont. “You can’t tell people you’re from outer space,” I say. “Why not?” he says with a genuinely curious look on his face. “Do people enjoy hearing mistruths in this sector of Earth?” Bellmont’s too complicated for me to explain in a sentence. The drugs, the violence, the racial tension, the Irish mob—how do you explain who runs the town when you could get killed just for saying the words Irish mob? I keep my mouth shut. Boy21 faces me and says, “Why do you care about what happens to me, Earthling?” I shrug, but then I say, “I guess I just sort of care about everyone.” He smiles at me—I know this will sound weird but his expression sort of warms my chest, removes the jabbing finger from my throat; his teeth sparkle and wink—and then he returns to his glow-in-the-dark stickers. I sit down on the floor and watch him arrange constellations. He peels off the little dots of two-sided tape, places a sticky dot in the center of each star, places the star on the end of his forefinger, and then presses it onto the wall or ceiling. He hops into the air like Superman to affix the stars above him, and lands gracefully without shaking the house too much, mostly because he’s so tall that he doesn’t have to leap that high, but also because he’s obviously athletic. There’s a very determined look on his face—it’s like his eyebrows are trying to meet for the first time at the top of his nose. After ten minutes or so, he pulls the blinds, turns out the lights, and sits next to me. “Pretend you are in outer space,” he says. It’s so absurd; I almost want to laugh. I have no idea what it’s like to be in outer space, but I know that I’ve never felt quite like I do at this very moment. Maybe I should feel scared or at least alarmed, but Boy21 seems pretty harmless, so I just sit and stare. What else can I do? After a few minutes of absolute quiet, I think about why Boy21 might be arranging stars in his bedroom. Maybe he likes being in control of his own little universe, being able to arrange things how he wants, like a god or something? Maybe he likes pretending, like a little kid would. I’m not sure, but I don’t mind either. The only other person I have ever sat alone with in the dark is Erin, and since I always want to kiss her, I never get to just enjoy the quiet shared silence. It’s nice to sit with another person, although I’m not sure why. As crazy as this will sound, I’m really enjoying just being with Boy21. There aren’t many people my age who will join me in voluntary silence. Most kids in my high school talk nonstop and are always moving. The stickers glow an otherworldly green and I have to admit that I like looking at them. We just sit silently for a long time, which feels kind of right somehow, even though my skin is sort of tingling in this weird way. “Boys?” Coach says as he opens the door, letting in the hall light and breaking the spell. “What are you two doing in the dark?” “Stargazing, Earthling,” Boy21 says. “Oh,” Coach says, swiveling his head to admire Boy21’s many constellations. “Time to go, Finley.” “Where is your dwelling pod, Earthling known as Finley?” Boy21 asks when I stand. “Five twenty-one O’Shea Street,” I say. “Across town.” “I will appear to you later tonight.” Boy21 offers me his hand, which is twice the size of mine. I shake it and give Boy21 a questioning squint, but then Coach says, “Nice to see you again, Boy21. I look forward to our next meeting.” We say good-bye to the Allens and then Coach is driving me home. Watching the neighborhood go by—the sagging row homes, potholed roads, trash blowing around, tree bark tagged with graffiti—I wonder if Boy21 will really visit me tonight. Just for a laugh, I imagine him landing in our tiny front yard, maybe in a personal-size flying saucer, which would probably just fill the center circle of a basketball court. His spaceship has a green dome on top that opens up like an Easter egg. “Hello, Finley!” Boy21 says in my mind. “Let’s go cruise the galaxy!” I have to hide my smile from Coach. 10 “SO WHAT DO YOU THINK OF RUSS?” Coach asks. Here’s what comes to mind: It’s like Russ has created a force field of weirdness around himself, but as that sounds like crazy talk, I keep my mouth shut. “It’s a lot to take in at first,” Coach says. “My guess is that some of it’s just an act to keep certain people at bay. I think he might be pretending to protect himself, but what do I know? The boy’s been through a lot. I appreciate your coming tonight. Do you think you could maybe show Russ around next week when school starts?” “Of course.” “And keep Russell’s secret too?” “Yes, sir.” When we pull up to my house, Coach shakes my hand and says, “You’re a real good kid, Finley. You do know that, right?” I smile and hop out of the truck. Inside Pop’s playing War with Erin at the kitchen table. Their stacks of cards are just about even. Pop slams each card like he’s trying to karate chop a board in half, while Erin places hers lightly on the table. Whenever Erin wins she says something like, “Ah, too bad, Mr. McManus. Maybe next time, old-timer.” I love it when she’s sarcastic. So does Pop. I can tell because of the smile he tries to hide. “So,” Pop says, “what’s the new kid like?” I don’t know how to answer. I don’t want to say how weird he is, and I don’t want to betray him by giving away his secrets, so I just shrug. “Can you believe this dumb mute?” Pop says to Erin. “Couldn’t get a word out of ’im if you beat ’im with a stick.” “I forfeit. You win, Pop,” Erin says and then leads me by the hand toward my bedroom. “Get back here, missy! I got all your aces!” Pop says. “Play it out! This is War!” But we’re already halfway up the stairs. We open the screen window, hop out onto the roof, and lie down. We make out for a little while, which feels pretty nice, and then Erin lays her head on my chest and says, “Did Coach take you to meet a new player?” “A new student.” I run my fingers through her hair and massage her scalp. She loves that. “Was he nice?” “Yeah. He was.” “What’s his name?” “Boy21.” Erin laughs, like I’m joking. So I say, “Russ Washington.” And then my hand makes its way down her back and we kiss some more. When we finish, we don’t talk. We just lie there looking up at the half-moon until it’s time for me to walk her home. After gazing into her eyes for what seems like a long time, I kiss Erin good night on her porch, and then leave. It was an awesome roof night, especially since Erin is a very good kisser, but I’m not thinking about Erin right now. I’m surprised to find myself thinking about Boy21. I feel weird. I feel worried. I feel sorry for Boy21 because his parents were murdered and he thinks he’s from outer space, but, then, his knowing so much about constellations is pretty interesting. He seems very smart—intelligent enough to pretend convincingly, which makes me wonder if Coach’s theory is correct, if Boy21 is just acting. What if Boy21 snaps out of it by basketball season? If he’s even half as good as Coach thinks he is, I’ll lose my starting position. And yet Coach picks me to help Boy21. If I help him, I could end up riding the pine this season, and if I don’t help Boy21 acclimate to Bellmont, I’d be disobeying Coach for the first time in my life. Boy21’s parents were murdered, I tell myself. Murdered. Don’t be selfish! My mind also says, But this is your senior year, your last season, and Erin and you have worked so hard on your game…. Does he really truly believe that he’s from outer space? Will he want my number? I also wonder if we’ll maybe end up being friends—real friends. I’ve never really had a good guy friend. It’s always just been Erin. Boy21 and I have already sat in silence together, and on the first night we met too. What was it about the green constellations? I stop walking. “I like your dwelling pod,” Boy21 says. He’s standing very rigidly in front of my house, like he’s really nervous. “How did you get here?” I ask. “I have a map for this sector of Earth. I never go anywhere on your planet without a map.” “Why are you here?” “I was sent to your planet to gather scientific data on what you Earthlings call emotions.”","sourceLink":"https://allnovel.net/boy21/page-5.html","bookId":2713,"book":{"id":2713,"title":"Boy21","description":"Storyline: Basketball has always been an escape for Finley. He lives in gray, broken Bellmont, a town ruled by the Irish Mob, drugs, violence, and racially charged rivalries. At home, he takes care of his disabled grandfather, and at school he’s called “White Rabbit”, the only white kid on the varsity basketball team. He’s always dreamed of getting out somehow with his girlfriend, Erin. But until then, when he puts on his number 21, everything seems to make sense. Russ has just moved to the neighborhood. A former teen basketball phenom from a privileged home, his life has been turned upside down by tragedy. Cut off from everyone he knows, he now answers only to the name Boy21—his former jersey number—and has an unusual obsession with outer space. As their final year of high school brings these two boys together, “Boy21” may turn out to be the answer they both need.","cover":"https://allnovel.net/images/boy21.jpg","author":"Matthew Quick","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/boy21.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:31:26 AM"}}
