{"id":63664,"no":10,"title":"Page 10","content":"At this point, I have no idea how useful these surviving creatures will be. I’d hoped to find a bunch more like Dust, and instead I have five out-of-control shape-changing animals. Still, there’s no question they’re Chimæra, and I don’t waste any more time wondering. Instead I step over to their cages and yank them open one by one.\\n\\n “It’s okay,” I assure them, loud enough for all of them to hear me at once but low enough that I hope my voice won’t carry beyond these walls. “We’re here to help.” I have no idea if they understand me, but I figure it can’t hurt.\\n\\n For a minute none of them move, and I can’t blame them. I don’t know how long they’ve been here, or what’s been done to them, but they don’t have any reason to trust a Mog—or, for all I know, humans. The one that’s now—for the moment—back to being a monkey is the first one to edge over to its open door, poke its head through and then chitter at the others, shifting back and forth between forms as they pour out of their prison. A second later they’re all loose, crawling and swinging and pacing and fluttering every which way.\\n\\n “Right,” I tell Rex. “Time to go.”\\n\\n Almost on cue, a siren starts blaring. Flashing lights accompany it out in the hall. Then a voice erupts from speakers in the ceiling.\\n\\n “Attention, a prisoner has escaped the brig. Adamus Sutekh was last seen wearing blue jeans and a black shirt. He is five-ten, slight of build, with long hair. He is unarmed but a known traitor. If found, detain if possible—shoot if necessary. The same for any accomplices.”\\n\\n “Yeah,” Rex agrees, shaking his head. “Definitely time to go.”\\n\\n CHAPTER TWELVE\\n\\n WE RACE OUT OF THE ROOM, INTO THE HALL AND down the stairwell with the Chimæra following behind us. Rex clamps a hand on my arm and hauls me back just before I start bounding down the stairs. “Not that way!” he calls after me. “They’ll start checking the building at the bottom and work their way up. But there’s an elevator in the back that you can only access from up here. If you can fight your way to it, you can get out that way.”\\n\\n I nod and let him wheel me around and half drag me up the stairs to the fifth floor. Judging by the door we’ve come to, which is painted bright red and is made from some kind of heavy, extra-reinforced steel, we’ve reached the part of the building that they really really want to keep people out of. With a grunt, Rex yanks it open and we step inside.\\n\\n The ceilings are just as high up here, but there aren’t any inner walls. Instead it’s just one big room, crowded with computer stations around the edges and a massive topographical map of the East Coast in the center of the room. This is obviously the command center.\\n\\n “Quick, hide!” I whisper, and duck behind a computer station. Rex does the same. I worry what the Chimæra will do, but they all stick with me, and even though they’re still changing shape constantly they all shift to smaller creatures—mice and lizards and dragonflies.\\n\\n Peeking out I see a few Mogs here, typing in front of monitors or marking things on transparent touch screens suspended in midair. Others are gathered in small clusters, discussing something in low tones. Nobody’s noticed us yet, and they aren’t mobilizing to hunt for an escaped prisoner either. I guess their work is more important. Our luck can’t last though.\\n\\n And—next problem. Other than the stairs we just ran up, I don’t see any other way out. This may not have been Rex’s best plan.\\n\\n A siren begins to blare again, and I cringe, figuring this is it. They’ve spotted me, and they’re calling guards to surround and overpower us. Even if I bring the whole building down the way I did Dulce Base, I might still be trapped. And we’re currently five floors up—if the building goes, that’s a long way down.\\n\\n But this siren is different, more of a whoop than a shriek. And when someone starts speaking over it, what he says is not what I expected.\\n\\n “Attention, all units,” the announcer states, his words slightly rushed but clear. “Assemble at once. Garde located. Full-scale assault about to begin. Repeat, all units assemble at once. Full-scale assault about to begin.”\\n\\n They’ve found the Garde? Full-scale assault? I look at Rex, whose own eyes are darting everywhere. He looks worried—but excited too, with that same gleam he had when we jumped onto the train. He zeroes in on something, and I follow his gaze to a Mog officer leaning over a console. His screen is showing something—I realize all of them have the same image up now—and I rise to a crouch and edge closer to get a better look. It’s a street map, but it doesn’t look familiar—there’s a lake instead of an ocean. It’s not New York. The others in the room are rushing about, either speaking quickly into walkie-talkies or racing towards the stairs, but this guy’s still at his desk. What if he turns and sees me? I’ve apparently just moved down on the priority list, but I’m sure if he realizes who I am he’ll still grab me. I have to chance it, though. If that’s where the Garde have been hiding, Malcolm may be there as well.\\n\\n I take a few more steps, and now I can make out more details, including place names. Shedd Aquarium, Water Tower Place, North Lake Shore Drive, Lake Michigan—it’s Chicago. They’re in Chicago. And the building that’s dead center on the screen is the John Hancock Center. That must be where the Garde are.\\n\\n Just as I realize that, the Mog sitting there turns. And sees me.\\n\\n “Hey—” he starts, half rising from his chair. He looks confused, like he knows I’m not supposed to be there but hasn’t totally figured out that I’m the escaped prisoner. Then he notices something at my shoulder, and his eyes go wide. Out of the corner of my eye I see a butterfly there—and a second later it’s a hummingbird, then a bumblebee. Crap. He’s just realized who I am.\\n\\n I’m only a few steps away from him at this point. I close the distance fast, and slam my fist into his jaw as hard as I can. His eyes glaze over and he slumps back into his chair. A quick scan of the room tells me no one else noticed.\\n\\n I guess all those years of sparring with Ivan were worth something after all.\\n\\n “You’ve got to get out of here,” Rex warns, moving up beside me and grabbing my arm again. “Now, while everyone’s rushing to deploy.”\\n\\n I nod, then stop. “I’ve got to get out of here?”\\n\\n He looks down, then away. “Look,” he starts. “You saved my life. I owe you. And I didn’t betray you—I haven’t and I won’t. But—” He shrugs. “I’m not like you. I already told you that. I was just keeping my promise. I get that you probably have reasons for what you did, and maybe they make sense to you. But not to me. This is where I belong. It’s who I am.”\\n\\n It’s obvious that there’s no changing his mind. And he’s not like me. As far as I know, no other Mog is. He believes everything we were taught about being the superior race and having the right to rule, to control, to destroy. Maybe he’s come to appreciate things a little more from our time together, but at his core he’s still a loyal soldier. And sooner or later I believe he’d betray me—our beliefs are just too different.\\n\\n So I just nod, and hold out my hand. He clasps it, claps me on the back and gives me a quick grin. “Tell Dust I said good-bye,” he says, already turning towards the stairs. Then he’s gone. If he’s lucky, no one will realize he helped me. I actually hope that’s the case.\\n\\n I’m left alone in the command center, me and a handful of messed-up Chimæra—and a bunch of Mog officers who are just starting to notice the fugitive and his strange menagerie in their midst.\\n\\n “It’s the traitor!” one of them shouts, breaking that frozen moment of recognition. “Get him!”\\n\\n He rushes towards me, along with a few of the others. That’s when a huge white owl comes crashing through the window.\\n\\n It’s Dust. Shattered glass is flying everywhere, and before it can even hit the ground he’s already shifting. By the time he lands, he’s blocking the way between me and the Mogadorians. He’s a wolf again, just like the first time I saw him.\\n\\n This time, though, he lets out a guttural, almost primordial howl. The first of the guards doesn’t even have time to disintegrate before he’s been torn to shreds. At that, the rest of them do something I’ve never seen a Mogadorian do before. They run.\\n\\n CHAPTER THIRTEEN\\n\\n SEVERAL HOURS LATER, I’M SPEEDING ALONG the highway in a stolen car packed with Chimæra, heading toward Chicago. The creatures have finally stabilized their shapes and have mostly managed to settle down.\\n\\n It’s still the weirdest road trip I’ve ever taken. Not to mention the smelliest.\\n\\n But I’m making good time. I’m almost to the Illinois border when, after the fifth try, Malcolm’s phone finally picks up.\\n\\n “Malcolm!” I shout immediately, juggling the phone to my other hand as the light changes and I ease through the intersection. “Where have you been?!”\\n\\n But the voice that answers isn’t his. “This is Sam.” There’s a pause. “Adam, is that you?”\\n\\n “Sam?” It takes me a second—we didn’t exactly get introduced, and I’m a little stressed right now. Then I remember. “Sam! Where’s your father?”\\n\\n “He’s—”\\n\\n “Never mind! It doesn’t matter!” I switch the phone to my other hand so I can drive properly. “Listen to me, Sam. You’re in Chicago, right? The John Hancock Center?”\\n\\n I can hear him suck in his breath. “How—how did you know that?”\\n\\n “They know, Sam!” I don’t mean to shout, but I know I am. “They know and they’re coming for you!”\\n\\n An oncoming car honks at me as I swerve into its lane, and I’m forced to drop the phone onto the seat beside me and concentrate on driving. I warned them. That’s all I can do right now. I can only hope they listen, and that they’re prepared. They’ve just got to hold out for a little while. I glance behind me to the backseat. Dust has taken the form of a cat again, and is curled up around his recovered kin. He looks up and meets my gaze, his golden eyes to my black ones, and growls slightly, but I know that warning isn’t meant for me. It’s for the ones who did this to the other Chimæra.\\n\\n Just hang on, Malcolm, I pray as I press down on the gas and the car leaps forwards, racing into the night. I’m coming. And I’ve got the cavalry with me.\\n\\n I hope One, wherever she is now, knows what I’ve done. What I’m doing. I’d like to think she does, that there’s still a part of her out there somewhere.\\n\\n No. One’s gone. I finally accept the truth: if she lives on in any way at all it’s not because she’s a ghost or a lingering psychic imprint. All that’s left of her is what I’ve held on to in my memories. The things she told me; the way she taught me to live.\\n\\n She’s not coming back. I don’t need her to. I know she’s proud of me because I’m proud of myself.\\n\\n Because I remember her. \\n\\n","sourceLink":"https://allnovel.net/the-forgotten-ones-lorien-legacies-the-lost-files-6/page-10.html","bookId":1684,"book":{"id":1684,"title":"The Forgotten Ones (Lorien Legacies: The Lost Files #6)","description":"Storyline: The Forgotten Ones (Lorien Legacies: The Lost Files #6) \\n In this thrilling companion novella to the New York Times bestselling I Am Number Four series, learn the fate of Adam—the Mogadorian-turned-ally of the Garde who risked his life to save Sam. \\n Adam helped Sam Goode and his father Malcolm escape the Mogadorian base in Dulce, New Mexico. Using the Legacy that One bestowed upon him, he sacrificed himself and brought the entire facility crumbling down on his head. \\n Miraculously, Adam survives in one piece, and he also discovers something incredible that the Mogadorians had been hiding from the Garde. Separated from his allies, Adam sets out on a quest to find the one thing the Garde have been missing all these years. The very thing that could turn the tide in this war.\\n","cover":"https://allnovel.net/images/the-forgotten-ones-lorien-legacies-the-lost-files-6.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-forgotten-ones-lorien-legacies-the-lost-files-6.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:51:56 AM"}}
