{"id":76768,"no":18,"title":"Page 18","content":"“You’re going home with me.”\\n\\n Totally bewildered, she asked, “Why?”\\n\\n Frowning, he said, “Because I have decided so.”\\n\\n “But why would you want to take me home with you?” she asked again.\\n\\n He let out a long, drawn-out sigh. He should have known it wouldn’t be easy. Things having to do with the Buchanans always ended up being complicated, and this obviously wasn’t going to be any different.\\n\\n “It has been suggested by your cousin…”\\n\\n “The wild Buchanan?”\\n\\n “Yes…”\\n\\n “What exactly did he suggest?”\\n\\n “Stop interrupting me.”\\n\\n She was immediately contrite. “I apologize, Laird. Your announcement took me by surprise, and I—” She stopped. “I make no excuses.”\\n\\n Embarrassment made her cheeks flush, and Colm knew that if he didn’t stop noticing such things, he would never get through this. Clasping his hands behind his back, he scowled and tried once again.\\n\\n “Brodick suggested that you would be safe living with my clan under my protection.”\\n\\n She folded her arms and waited a few seconds before responding. “Why would Laird Buchanan make any suggestions regarding my welfare?”\\n\\n “Your father wasn’t at the abbey, and because Brodick is related, the duty to protect you fell on his shoulders.”\\n\\n “Brodick isn’t my guardian. My father is.”\\n\\n Colm nodded. “Yes, that is so,” he said impatiently. “But he wasn’t there, was he?” Before she could answer, he added, “We were.”\\n\\n “Yes, I know you were. When I walked into the commons, I looked up and I saw you, but I thought…that is to say, I assumed you were leaving just then.” Suddenly completely rattled, she took a step back and shook her head. “Why did I think that? Why did I assume you were leaving? I never even looked up at the wall again once the shouting started.” Frantic now, she whispered, “When did you leave?”\\n\\n “After you did.”\\n\\n She felt sick. “Then you witnessed…” She couldn’t finish the question.\\n\\n “Yes.”\\n\\n She took another step back. Had all the men with the lairds also heard and seen her humiliation? Yes, of course they had. That was why they were all staring at her now. Did they think she was a whore? A Jezebel? Why weren’t they shouting obscenities at her like the others?\\n\\n She stopped retreating and straightened her shoulders. She decided she wouldn’t defend herself or protest her innocence. She wouldn’t cower, either. If, like the mob hurling insults and stones, they wanted to think the worst of her, so be it. She summoned every last ounce of courage she possessed, but there was so little left. She was once again overwhelmed with shame for something she hadn’t done.\\n\\n Colm saw the sadness enter her eyes and the color drain from her face. He had the crazy urge to try to make her feel better. “You are a confusing woman,” he muttered.\\n\\n Gabrielle could not argue with his opinion, for her thoughts whirled in every direction. Why would this man offer her his home? What could he possibly gain from this? Nothing made sense.\\n\\n She and her guards certainly needed a safe haven while she planned for their future. Living with the MacHughs would be a sound, but temporary solution, providing she understood the laird’s reasons for offering. In her present state of mind, she didn’t dare trust anyone to do the right thing. Was MacHugh honorable, or did he have twisted motives of his own?\\n\\n “I think you must be a good man and an honorable leader—” she began.\\n\\n “How could you possibly know what I am?”\\n\\n It was the opening she was looking for. “I couldn’t possibly know—”\\n\\n “You just said—”\\n\\n “And since I couldn’t possibly know, you cannot take offense to my demand to understand your true motives. I ask you again, Laird, ‘Why do you want me—’”\\n\\n “I don’t want you. Wanting has nothing to do with this. I’m paying a debt to Brodick Buchanan, and that is all.”\\n\\n “Oh.” She didn’t know whether to be relieved or offended. Things had been happening so fast, she hadn’t had time to think. “You don’t want…that is to say, you’re paying a debt?”\\n\\n Hadn’t he just said as much? The woman was the most confounding creature Colm had ever met. Her emotions had gone from mortification to fear and despair, and now, damned if the woman didn’t look disgruntled. He had assumed she wouldn’t act favorably to being told she was to live with him, but he hadn’t suspected such a bizarre reaction. This was proving even more difficult than he had anticipated.\\n\\n “Thank you, Laird, for offering your home. Have no worries, you won’t have to put up with the inconvenience for more than a few days.”\\n\\n “I’m not offering temporary lodging, and you won’t be leaving in a few days. You’re coming home with me to stay.”\\n\\n One of his men called to him. Colm answered by putting his hand up for silence and responding to the man, “You will wait to speak until I’ve finished with this.”\\n\\n Finished with this? Apparently, Gabrielle thought, she was the “this” he was referring to.\\n\\n “I thank you for your offer of hospitality,” she said, “but I cannot go with you.”\\n\\n Declining his invitation seemed the logical thing to do because she had just come up with another destination. She and her guards would go home with Laird Buchanan. The Buchanans could keep her just as safe as the MacHughs.\\n\\n But why hadn’t Buchanan offered?\\n\\n Colm wasn’t certain how to proceed. In truth, he was astonished that she would turn down his protection. Didn’t the daft woman realize the danger she was in? Did she understand what being an outcast meant?\\n\\n He decided to enlighten her, but before he could explain how precarious and bleak her situation was, she asked, “Why didn’t Laird Buchanan offer his home and his protection? I am related to him.”\\n\\n Colm glanced over his shoulder, found Brodick in the crowd of men straining to overhear the conversation, and tilted his head toward Gabrielle.\\n\\n From the look on Colm’s face, Brodick knew the discussion wasn’t going well. He crossed the clearing, and with his gaze locked on Gabrielle, he asked, “Why is this taking so long?”\\n\\n “She’s being difficult,” Colm told him.\\n\\n She immediately protested. “I must disagree, Laird. I don’t believe I’m being in the least bit difficult.”\\n\\n “Then what’s the problem?” Brodick asked Colm. “Did you tell her what’s going to happen?”\\n\\n Ah, that’s where he went wrong. He’d told her Brodick’s suggestion instead of commanding her obedience.\\n\\n “Laird MacHugh kindly offered—”\\n\\n “I what?” he roared.\\n\\n “You kindly…” she began again.\\n\\n When his eyes narrowed and the creases in his brow deepened, she understood. Using the word “kindly” was obviously some sort of an insult. What a strange group of men these Highlanders were. She would be relieved to be rid of them.\\n\\n She didn’t dare smile. “Laird MacHugh offered me his protection, and I declined. I politely declined,” she stressed.\\n\\n “She wants to know why you didn’t offer her your home and your protection, Brodick,” Colm said.\\n\\n “You didn’t fully explain the plan?”\\n\\n “I never got that far. This woman is prone to interrupting.”\\n\\n “Gabrielle,” Brodick began, using what he believed was his most reasonable tone of voice. “I could offer you my home and my protection—and I’ll admit my wife would be happy for your company. You would be safe—”\\n\\n “I will be pleased to accept your offer as long as you understand that it will be only for a few days. Is that agreeable?”\\n\\n She hadn’t given him time to tell her that MacHugh could do more than protect her; he could give her his name. Instead, she had accepted an invitation he hadn’t extended.\\n\\n “The woman’s hell-bent on refusing help,” Colm said.\\n\\n Brodick nodded agreement.\\n\\n Colm addressed Gabrielle. “What happens in a few days? What is it you plan to do?”\\n\\n “First, I must find my father and warn him of the danger.”\\n\\n “Find him? You don’t know where he is?” Brodick asked.\\n\\n She shook her head. “He was going to King John to give his account of what happened to Monroe, and he was going to catch up with me on my way back to England.”\\n\\n “Do you think to roam the land until you happen upon him?” Colm asked.\\n\\n “Even if you do find him, you wouldn’t be able to follow him into England. You’ve been exiled,” Brodick reminded her. “If you’re caught, you’ll be executed, and if you’re captured with your father, he’ll also pay a high price.”\\n\\n They were forcing her to face reality, but she still couldn’t abide the idea of anyone having to rescue her for something she hadn’t done.\\n\\n “My father must be told what happened.”\\n\\n “He’s probably hearing about it even now,” Brodick suggested. “Or he will hear soon. Bad news travels fast. He’ll also hear that we were there,” he added with a nod toward Colm, “and I would wager he’ll come to me looking for you.”\\n\\n This made sense to her. “Yes, that is what he would do, and that is yet another reason I should go home with you.”\\n\\n Brodick sighed in frustration. He didn’t know how to make her understand.\\n\\n “You know, in a dire, dire situation…where there is no other possible solution—none at all—and it is life-threatening,” he stressed, “you can come to my home, for you are my wife’s cousin. However—”\\n\\n Colm interrupted him. “We’ve wasted enough time here, Brodick. If you don’t tell her, I will.”\\n\\n Frowning, she asked Colm, “Tell me what, Laird?”\\n\\n Brodick answered. “If you go near your father, you’ll put him in harm’s way. Is that what you want, Gabrielle?”\\n\\n “No, no, of course not, but I…”\\n\\n And then it struck her. The enormity of the situation finally penetrated. Dear God, what was she going to do? No one was safe with her. Even the Buchanans and the MacHughs were at risk.\\n\\n MacHugh’s first in command, Braeden, called out to him. Colm turned and saw another of his soldiers talking to Braeden, and both were staring at Gabrielle. Then Brodick’s commander, Dylan, joined their discussion.\\n\\n “What is it?” Colm shouted.\\n\\n Braeden explained as he walked toward him. “The English.” He glanced at Gabrielle before he continued. “Both barons are searching for her, and both have small armies with them.”\\n\\n Brodick asked, “Are they heading this way?”\\n\\n “No, Laird,” he answered. “One of the barons leads his men to the south, and the other is heading toward the Monroes.”\\n\\n “Eventually, when they can’t find Gabrielle, they’ll backtrack and come this way,” Brodick said.\\n\\n Colm agreed. He took Braeden aside to give him orders and finally turned back to her.\\n\\n “Now do you understand?” He asked irritably.\\n\\n Apparently she didn’t. “Why would they be looking for me? You were there. You heard what they called me, and you surely heard that I was condemned in King John’s name. Didn’t they say that in their eyes I no longer exist?”\\n\\n “You’re now vulnerable,” Brodick explained.\\n\\n Colm was going to have to be more direct. “Any man who is strong enough to fight off the others can have you now. Need I be more explicit?”\\n\\n Horrified, she frantically shook her head.\\n\\n “Since you no longer answer to any king nor belong to any country, you have no one to protect you from predators,” Brodick explained, his voice much kinder than Colm’s had been.\\n\\n She bowed her head while fighting the terror inside. “How will I protect my father and my guards? They’ll kill them.” She whispered her fears.\\n\\n “You worry about others instead of yourself?” Brodick asked.\\n\\n She didn’t answer. Instead, she took a deep breath and looked at the lairds. “You must leave immediately. Yes, that’s what you must do.” Her voice was strong now, determined. “All of you are in danger as long as you are with me. Go. Leave me now.”\\n\\n “Did she just dismiss us?” Colm looked incredulous.\\n\\n “Aye, she did,” Brodick said. “I don’t think she knows any better.”\\n\\n After a moment’s thought, Colm decided Gabrielle hadn’t realized she was insulting them by suggesting that they would run at the first hint of trouble. Both he and Brodick welcomed the opportunity to fight with the English, but neither would give in to the temptation as long as Gabrielle was in their care.\\n\\n Exasperated, Colm said, “Gabrielle, you will not question my authority in the future.”\\n\\n She was slow to catch on. “In the future? What future?”\\n\\n “Your future as my wife.”\\n\\n CHAPTER TWENTY-NINE\\n\\n T HERE WAS NO DISCUSSION. MACHUGH SIMPLY TOLD HER what was going to happen and then walked away.\\n\\n All things considered, Gabrielle thought she handled herself quite well. She didn’t scream or faint when the laird calmly announced that she would be spending the rest of her life with him. She might have paled, but she did not faint.\\n\\n She took solace in one certainty: no way in Hell would she marry Laird MacHugh. She didn’t like the man, and she knew he didn’t like her. The debt he had to pay to Brodick must be staggering, for why else would he ruin his life by marrying a woman he barely knew and had heard such terrible lies about? As far as she knew, MacHugh thought she was a whore.\\n\\n No, marriage was out of the question.\\n\\n How terrible would it be if, just for a little while, Gabrielle let MacHugh think she was agreeable? This small deception would give her time to work on a plan for her future. After two or three days, she would tell him the truth…as she was leaving, of course.\\n\\n She weighed the good against the bad. On the one hand, she and her guards would be safe from the barons. They would have shelter and protection. If the barons found out where she was staying, they wouldn’t dare ride onto MacHugh land, for they would surely know they wouldn’t come out alive.\\n\\n On the other hand, she would be living with…him.\\n\\n Laird Buchanan seemed most pleased with his friend’s decision. Smiling and in good cheer, he motioned to his men that it was now time to leave. Gabrielle tapped on his shoulder. She was about to ruin his good mood. \\n\\n","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-18.html","bookId":1842,"book":{"id":1842,"title":"Shadow Music (Highlands\u0027 Lairds #3)","description":"Storyline: For Princess Gabrielle of St. Biel, Scotland is a land of stunning vistas, wild chieftains, treacherous glens, and steep shadows--skullduggery, betrayal, and now murder. Prized for her exquisite beauty, the daughter of one of England\u0027s most influential barons, Gabrielle is also a perfect bargaining chip for a king who needs peace in the Highlands: King John has arranged Gabrielle\u0027s marriage to a good and gentle laird. But this marriage will never take place. \\n For Gabrielle, everything changes in one last burst of freedom--when she and her guards come upon a scene of unimaginable cruelty. With one shot from her bow and arrow, Gabrielle takes a life, saves a life, and begins a war. \\n Within days, the Highlands are aflame with passions as a battle royal flares between enemies old and new. Having come to Scotland to be married, Gabrielle is instead entangled in Highland intrigue. For two sadistic noblemen, underestimating Gabrielle\u0027s bravery and prowess may prove fatal. But thanks to a secret Gabrielle possesses, Colm MacHugh, the most feared man in Scotland, finds a new cause for courage. Under his penetrating gaze, neither Gabrielle\u0027s body nor heart is safe.\\n","cover":"https://allnovel.net/images/shadow-music-highlands-lairds-3.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/shadow-music-highlands-lairds-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:30:00 PM"}}
