{"id":76772,"no":22,"title":"Page 22","content":"Sarah rarely spread stories about anyone’s good works or good fortune. What was the point? There was nothing exciting about that. Sin was always much more fulfilling, and when the sin was one of lust, it became titillating as well. One evening during supper her brother Niall happened to mention what he had heard about the incident at Arbane Abbey. Sarah ate two biscuits listening to the tale, then gobbled down three more while she whittled every possible detail out of him. When Niall had finished relating what he had heard, Sarah was dizzy with excitement and stuffing the last biscuit into her mouth. Before noon the following day everyone in the Dunbar clan knew about Gabrielle. Then Sarah, giddy with power, branched out. After baking a double batch of her sweet biscuits, she took them to her second cousin Hilda, who was married to a Boswell. She didn’t leave the Boswell holding until she had made certain everyone in the clan knew about the infamous incident. Besides spreading vicious gossip, Sarah’s other weakness was that she liked to embellish. After telling the story thirty or forty times, she no longer felt the same rush. Her heart didn’t race, and her palms didn’t sweat. The gossip had become old news, and so she began to add a few extra little lies of her own. Nothing outrageous, of course. Just enough to spice up the telling. What harm was there in that? Two weeks later the lies had spread to the MacHugh clan. Gabrielle felt the difference in the atmosphere. Women who usually smiled as they walked past now avoided looking at her. They turned their heads and scurried away. Before anyone told her, she knew that they had heard the horrible lies. And from the way they were behaving, she also knew they believed them to be true. Colm returned home from a long day of hunting to find Braeden waiting for him in front of the stables. The look on his commander’s face told Colm the news wasn’t good. His first thought was for Gabrielle. Had something happened to her? He hadn’t even dismounted when he asked, “Is Gabrielle all right?” Braeden knew his laird didn’t realize how telling the question was. “She’s fine. No harm has come to her.” Colm’s second question was just as revealing. “What’s she done now?” “Nothing that I know of,” he assured him. Colm swung down from his horse and tossed the reins to the stablemaster as he addressed Braeden. “She hasn’t tried to leave again?” Braeden smiled. “No, at least not today, anyway.” He looked to the sky before adding, “The sun’s still out, though. She still has time.” Gabrielle was having trouble adjusting to her new home. Every day it was something new. In the past week she’d tried to leave the holding twice, and twice Colm had had to bring her back. She’d insisted she wasn’t running away. Her first excuse was that she wanted to go riding across Finney’s Flat. The second excuse was that she wanted to do a “spot” of hunting, whatever that meant. “Lady Gabrielle just needs time to understand the rules we live by here,” Braeden said, trying to defend her. Colm scoffed at the notion. “She knows the rules. She just doesn’t pay any attention to them, which is why twice now I’ve had to stop what I was doing to chase after her.” “May I point out that I offered to go after her, as did several other soldiers.” “She’s my responsibility and therefore my problem. I won’t foist her on anyone else.” Braeden knew that wasn’t the reason. Although Gabrielle had only been with them fourteen days, Colm had already become quite possessive of her. He didn’t like anyone else near her. He barely tolerated her guards. As far as he was concerned, they were useless. They only answered to Gabrielle and only obeyed her commands. Colm believed he’d put up with their behavior long enough, even though he grudgingly had to admit they did guard her well. “None of us consider Lady Gabrielle a problem. The men are infatuated with her, and the women like her as well, for she has a kind word and a smile for everyone she meets.” “Does she distract the men from their duties?” “She does,” he admitted. “Though not deliberately. Have you had a chance, Colm, to notice how pretty she is?” Exasperated, he answered, “Of course I have.” “The men have also noticed. They like looking at her.” He stiffened. “Then I’ll double their duties. If they train from sun up to sun down, they won’t have time to stare at her.” “You speak like a jealous man.” From the dark look Colm shot him, Braeden realized he shouldn’t have spoken the thought out loud. “I am your friend for many years,” Braeden reminded him. “I don’t mean to rile you, only to speak truthfully. Word has spread that you are going to marry her, but if I could suggest, I think you should make the announcement to the entire clan soon.” “I’m a busy man,” he barked. Colm knew it was a poor excuse. He should have told his followers of his intention to take Gabrielle for his wife the day he had brought her home with him, but instead he had spent the last two weeks trying to stay away from her, telling himself that he had other duties that were far more important. He could have made time for her. Colm wasn’t one to avoid unpleasant tasks. He had a debt hanging over his head, and it would be paid as soon as he married her. And since he hated being in debt to anyone, he should have been eager to wed her. Why, then, wasn’t he? This morning he finally admitted the truth: Gabrielle was a dangerous woman. He didn’t like the way she made him feel, turning his mind upside down. It started with a kiss. The damned kiss had awakened emotions he thought were long dead. The way she smiled at him only made it worse. She would turn him into a besotted fool if he let her, and no way in hell was he ever going to let another woman make him vulnerable. “I hope you will make the announcement soon, Laird.” Colm responded sharply. “What is it you have to report?” As he asked the question, he noticed two horses tethered to a tree branch, and from the markings on their hindquarters he knew who they belonged to. “What in thunder are the Boswells doing here?” “Spreading lies.” “What say you?” “The lies about Lady Gabrielle have reached our clan, and two men from the Boswell clan are responsible. Kinnon Boswell claimed that he needed to speak to his cousin Rebecca, who as you know is married to one of our soldiers. He told the guards manning the tower that the matter was urgent, yet when he was allowed entrance, he didn’t bother to go to her cottage. It seems both he and his friend Edward were determined to see Lady Gabrielle.” Furious, Colm demanded, “Did they see her?” “No, they did not,” he assured him. Colm relaxed. “Then they just might get out of here alive.” Braeden continued with his report. “I was in the west field training the younger soldiers when one of Lady Gabrielle’s guards came to me and told me there was a problem.” “Which guard?” “Lucien.” “At least one of them is learning to follow the chain of command,” he said drily. “What did he tell you?” “He asked me if we were allies with the Boswells, and when I asked him why he wanted to know, he explained that he was about to kill two of them.” “Did you let him?” “No, but I swear to you, Laird, when I heard what they were saying about Lady Gabrielle, I wanted to. I was about to throw them out when you returned.” “Where’s Gabrielle now?” “In the great hall.” “Find the Boswells,” he ordered, “and bring them to me. I want them to tell me what they’ve been saying about Gabrielle.” After giving the command, Colm continued on. He was in a hurry to get to Gabrielle before she heard about the Boswells. Gabrielle had been through enough heartache. She didn’t need any more. Damn it all, this was his fault. He should already have married her. That was the only sure way to stop this slander. No one would dare say a word against his wife…unless, of course, he had a death wish. As he approached the courtyard, Colm spotted Gabrielle. Her back was to him and she was talking to someone. A few steps farther, Colm saw the Boswells facing her. He cursed as he quickened his step. The young men seemed so intent on what they were telling her, they didn’t notice him. Nor did they hear Lucien and Faust coming up behind them. The guards were running toward the two men, but stopped when Gabrielle raised her hand slightly to signal them. The action was noticed by Kinnon. He took a step toward her and asked, “What are you doing?” She smiled as she answered. “Saving your life.” Edward was slow to catch on, but Kinnon was more astute. He whirled around and came face-to-face with Lucien. Instantly he turned back to Gabrielle and with a shaky voice said, “I was only telling you what everyone else was saying about you. I thought you would want to know. They can’t kill us for that, can they?” “They can’t, but I can,” said Colm. Had he not been so angry, he probably would have thought their reaction to his voice comical. They jerked back and bumped into each other looking for a way to escape. Gabrielle feared Colm might actually carry through on his threat and kill the Boswells, and she didn’t want that to happen. Kinnon and Edward were stupid young men with nothing better to do with their time than to come all this way just to see her reaction to their stories, but they should not have to die because of their ignorance. They should have to do some squirming, though. “Laird, I’m so happy you’re home,” she said ever so sweetly. “Come and listen to the stories the Boswells are telling me. You’re certain to be amused.” Kinnon’s face looked like it had been scorched by the sun, while Edward’s appeared to have lost all color. He resembled a corpse. ’Twas the truth, he smelled like one, too. “I doubt I’ll be amused,” Colm said. He threw his arm around her, pulled her to his side, and kissed her while the Boswells watched with wide eyes and gaping mouths. Then he turned and gave them his full attention. “I will hear what you have said to Lady Gabrielle, soon to be my wife.” “Soon to be…” Kinnon swallowed hard. “Your wife?” Edward said. “We didn’t know. We never would have…” “You would not have slandered Lady Gabrielle? Is that what you mean to say?” Colm asked. He was so furious he could barely keep from strangling the fools. He was inadvertently squeezing Gabrielle instead, and only when she pinched him did he realize what he was doing and loosen his grip. “We wanted to see what she looked like. We had heard she bewitches men and we wanted to see for ourselves,” Kinnon explained. “We were only repeating the stories we heard,” Edward said, his voice so high-pitched it neared a screech. Lucien and Faust moved closer to Kinnon and Edward, who surely felt them breathing down their necks. Both guards were watching Colm, hoping that he would give the signal to dispose of the pests. Gabrielle felt the Boswells had been sufficiently punished. “Kinnon and Edward have both convinced me that I am an amazing woman. It seems that I have given birth to four children, out of wedlock of course, and all in the span of one year,” she explained. “And with four different men.” She laughed before adding, “I must be very affectionate.” “The stories are falsehoods,” Kinnon stammered. “We realize that now. Don’t we, Edward?” His friend nodded vigorously. “We do. Yes, we do.” “If we are allowed to leave, we promise never to say another word about Lady Gabrielle. Except praise,” he hastened to add. “We will praise her. That’s what we’ll do.” “Lucien, Faust, step back. Gabrielle, go inside,” Colm ordered. Gabrielle wanted to ask him what he was going to do, but knew it would be improper to question him in front of outsiders. He wasn’t going to kill them, was he? She took her time walking away. The Boswells had said terrible things, even repeating words she knew had to be foul because of their leers and dark laughter. She shouldn’t feel sorry for them, but she did. Colm noticed she was dragging her feet and decided he would have to have a word with her about her obedience. When he gave an order, he expected it to be followed immediately. And quickly. She obviously didn’t know that. She was half English, he reminded himself, and perhaps that was why she was so headstrong. He turned his attention to the Boswells, shaking in their boots. “When you wake up, you will go to your laird, and you will tell him what happened here today. I will know if you don’t tell him every word you said to Lady Gabrielle. You will also tell him that the only reason I let you live was because you made my future wife laugh.” Edward nodded. “We’ll tell our laird every word,” he vowed. Kinnon scratched his chin. “Laird, did you say when we wake up? Are we to stay—” He never finished his question. Colm moved so fast, neither Kinnon nor Edward had time to react. One second they were standing, and the next they were crumpled on the ground. Lucien nodded approval while Faust grinned. Colm stared down at the Boswells as he ordered, “Tie them to their horses and get them the hell off my land.” Walking toward the forge a few minutes later, Colm was still furious. How dare the Boswells, or anyone for that matter, say slanderous things about Gabrielle? Anyone who met her knew she was an innocent, sweet, kind woman. He should have killed them, he decided. Gabrielle may have been upset, but it certainly would have lightened his mood. He stopped abruptly. When had that happened? When had her feelings become important to him? Colm tried to put Gabrielle out of his thoughts. He had work to do. He reached the forge and spent an hour with the smith discussing modifications he wanted made to the sword blades and then walked up to the crest overlooking the field where the men were sparring. The younger warriors were training. They held shields, but none of them were using them properly. A few were actually using them as weapons while their swords hung idly at their sides. They shouldn’t be training with any weapon yet, Colm concluded. They were too inexperienced. Braeden was bellowing at them, but wasn’t getting the results he wanted. When one of the younger ones made the mistake of grinning, Braeden promptly knocked him to the ground. Why was it that the inexperienced were the most arrogant? On a battlefield they would be a hindrance, and the seasoned warriors would have to protect them as well as fight the enemy. The distraction could prove deadly.","sourceLink":"https://allnovel.net/shadow-music-highlands-lairds-3/page-22.html","bookId":1842,"book":{"id":1842,"title":"Shadow Music (Highlands\u0027 Lairds #3)","description":"Storyline: For Princess Gabrielle of St. Biel, Scotland is a land of stunning vistas, wild chieftains, treacherous glens, and steep shadows--skullduggery, betrayal, and now murder. Prized for her exquisite beauty, the daughter of one of England\u0027s most influential barons, Gabrielle is also a perfect bargaining chip for a king who needs peace in the Highlands: King John has arranged Gabrielle\u0027s marriage to a good and gentle laird. But this marriage will never take place. For Gabrielle, everything changes in one last burst of freedom--when she and her guards come upon a scene of unimaginable cruelty. With one shot from her bow and arrow, Gabrielle takes a life, saves a life, and begins a war. Within days, the Highlands are aflame with passions as a battle royal flares between enemies old and new. Having come to Scotland to be married, Gabrielle is instead entangled in Highland intrigue. For two sadistic noblemen, underestimating Gabrielle\u0027s bravery and prowess may prove fatal. But thanks to a secret Gabrielle possesses, Colm MacHugh, the most feared man in Scotland, finds a new cause for courage. Under his penetrating gaze, neither Gabrielle\u0027s body nor heart is safe.","cover":"https://allnovel.net/images/shadow-music-highlands-lairds-3.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/shadow-music-highlands-lairds-3.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 3:30:00 PM"}}
