{"id":5728,"no":30,"title":"Chapter 30","content":"30:1 [hgb] 但 如 今 ， 比 我 年 少 的 人 戏 笑 我 。 其 人 之 父 我 曾 藐 视 ， 不 肯 安 在 看 守 我 羊 群 的 狗 中 。 \n [kjv] But now they that are younger than I have me in derision, whose fathers I would have disdained to have set with the dogs of my flock. \n [bbe] But now those who are younger than I make sport of me; those whose fathers I would not have put with the dogs of my flocks. \n 30:2 [hgb] 他 们 壮 年 的 气 力 既 已 衰 败 ， 其 手 之 力 与 我 何 益 呢 ？ \n [kjv] Yea, whereto might the strength of their hands profit me, in whom old age was perished? \n [bbe] Of what use is the strength of their hands to me? all force is gone from them. \n 30:3 [hgb] 他 们 因 穷 乏 饥 饿 ， 身 体 枯 瘦 ， 在 荒 废 凄 凉 的 幽 暗 中 啃 干 燥 之 地 。 \n [kjv] For want and famine they were solitary; fleeing into the wilderness in former time desolate and waste. \n [bbe] They are wasted for need of food, biting the dry earth; their only hope of life is in the waste land. \n 30:4 [hgb] 在 草 丛 之 中 采 咸 草 ， 罗 腾 的 根 为 他 们 的 食 物 （ 罗 腾 小 树 名 松 类 ） 。 \n [kjv] Who cut up mallows by the bushes, and juniper roots for their meat. \n [bbe] They are pulling off the salt leaves from the brushwood, and making a meal of roots. \n 30:5 [hgb] 他 们 从 人 中 被 赶 出 ， 人 追 喊 他 们 如 贼 一 般 。 \n [kjv] They were driven forth from among men, (they cried after them as after a thief;) \n [bbe] They are sent out from among their townsmen, men are crying after them as thieves \n 30:6 [hgb] 以 致 他 们 住 在 荒 谷 之 间 ， 在 地 洞 和 岩 穴 中 。 \n [kjv] To dwell in the cliffs of the valleys, in caves of the earth, and in the rocks. \n [bbe] They have to get a resting-place in the hollows of the valleys, in holes of the earth and rocks. \n 30:7 [hgb] 在 草 丛 中 叫 唤 ， 在 荆 棘 下 聚 集 。 \n [kjv] Among the bushes they brayed; under the nettles they were gathered together. \n [bbe] They make noises like asses among the brushwood; they get together under the thorns. \n 30:8 [hgb] 这 都 是 愚 顽 下 贱 人 的 儿 女 ， 他 们 被 鞭 打 ， 赶 出 境 外 。 \n [kjv] They were children of fools, yea, children of base men: they were viler than the earth. \n [bbe] They are sons of shame, and of men without a name, who have been forced out of the land. \n 30:9 [hgb] 现 在 这 些 人 以 我 为 歌 曲 ， 以 我 为 笑 谈 。 \n [kjv] And now am I their song, yea, I am their byword. \n [bbe] And now I have become their song, and I am a word of shame to them. \n 30:10 [hgb] 他 们 厌 恶 我 ， 躲 在 旁 边 站 着 ， 不 住 地 吐 唾 沫 在 我 脸 上 。 \n [kjv] They abhor me, they flee far from me, and spare not to spit in my face. \n [bbe] I am disgusting to them; they keep away from me, and put marks of shame on me. \n 30:11 [hgb] 松 开 他 们 的 绳 索 苦 待 我 ， 在 我 面 前 脱 去 辔 头 。 \n [kjv] Because he hath loosed my cord, and afflicted me, they have also let loose the bridle before me. \n [bbe] For he has made loose the cord of my bow, and put me to shame; he has sent down my flag to the earth before me. \n 30:12 [hgb] 这 等 下 流 人 在 我 右 边 起 来 ， 推 开 我 的 脚 ， 筑 成 战 路 来 攻 击 我 。 \n [kjv] Upon my right hand rise the youth; they push away my feet, and they raise up against me the ways of their destruction. \n [bbe] The lines of his men of war put themselves in order, and make high their ways of destruction against me: \n 30:13 [hgb] 这 些 无 人 帮 助 的 ， 毁 坏 我 的 道 ， 加 增 我 的 灾 。 \n [kjv] They mar my path, they set forward my calamity, they have no helper. \n [bbe] They have made waste my roads, with a view to my destruction; his bowmen come round about me; \n 30:14 [hgb] 他 们 来 如 同 闯 进 大 破 口 ， 在 毁 坏 之 间 滚 在 我 身 上 。 \n [kjv] They came upon me as a wide breaking in of waters: in the desolation they rolled themselves upon me. \n [bbe] As through a wide broken place in the wall they come on, I am overturned by the shock of their attack. \n 30:15 [hgb] 惊 恐 临 到 我 ， 驱 逐 我 的 尊 荣 如 风 ， 我 的 福 禄 如 云 过 去 。 \n [kjv] Terrors are turned upon me: they pursue my soul as the wind: and my welfare passeth away as a cloud. \n [bbe] Fears have come on me; my hope is gone like the wind, and my well-being like a cloud. \n 30:16 [hgb] 现 在 我 心 极 其 悲 伤 。 困 苦 的 日 子 将 我 抓 住 。 \n [kjv] And now my soul is poured out upon me; the days of affliction have taken hold upon me. \n [bbe] But now my soul is turned to water in me, days of trouble overtake me: \n 30:17 [hgb] 夜 间 ， 我 里 面 的 骨 头 刺 我 ， 疼 痛 不 止 ， 好 像 龈 我 。 \n [kjv] My bones are pierced in me in the night season: and my sinews take no rest. \n [bbe] The flesh is gone from my bones, and they give me no rest; there is no end to my pains. \n 30:18 [hgb] 因 神 的 大 力 ， 我 的 外 衣 污 秽 不 堪 ， 又 如 里 衣 的 领 子 将 我 缠 住 。 \n [kjv] By the great force of my disease is my garment changed: it bindeth me about as the collar of my coat. \n [bbe] With great force he takes a grip of my clothing, pulling me by the neck of my coat. \n 30:19 [hgb] 神 把 我 扔 在 淤 泥 中 ， 我 就 像 尘 土 和 炉 灰 一 般 。 \n [kjv] He hath cast me into the mire, and I am become like dust and ashes. \n [bbe] Truly God has made me low, even to the earth, and I have become like dust. \n 30:20 [hgb] 主 阿 ， 我 呼 求 你 ， 你 不 应 允 我 。 我 站 起 来 ， 你 就 定 睛 看 我 。 \n [kjv] I cry unto thee, and thou dost not hear me: I stand up, and thou regardest me not. \n [bbe] You give no answer to my cry, and take no note of my prayer. \n 30:21 [hgb] 你 向 我 变 心 ， 待 我 残 忍 ， 又 用 大 能 追 逼 我 。 \n [kjv] Thou art become cruel to me: with thy strong hand thou opposest thyself against me. \n [bbe] You have become cruel to me; the strength of your hand is hard on me. \n 30:22 [hgb] 把 我 提 在 风 中 ， 使 我 驾 风 而 行 ， 又 使 我 消 灭 在 烈 风 中 。 \n [kjv] Thou liftest me up to the wind; thou causest me to ride upon it, and dissolvest my substance. \n [bbe] Lifting me up, you make me go on the wings of the wind; I am broken up by the storm. \n 30:23 [hgb] 我 知 道 要 使 我 临 到 死 地 ， 到 那 为 众 生 所 定 的 阴 宅 。 \n [kjv] For I know that thou wilt bring me to death, and to the house appointed for all living. \n [bbe] For I am certain that you will send me back to death, and to the meeting-place ordered for all living. \n 30:24 [hgb] 然 而 ， 人 仆 倒 岂 不 伸 手 ？ 遇 灾 难 岂 不 求 救 呢 ？ \n [kjv] Howbeit he will not stretch out his hand to the grave, though they cry in his destruction. \n [bbe] Has not my hand been stretched out in help to the poor? have I not been a saviour to him in his trouble? \n 30:25 [hgb] 人 遭 难 ， 我 岂 不 为 他 哭 泣 呢 ？ 人 穷 乏 ， 我 岂 不 为 他 忧 愁 呢 ？ \n [kjv] Did not I weep for him that was in trouble? was not my soul grieved for the poor? \n [bbe] Have I not been weeping for the crushed? and was not my soul sad for him who was in need? \n 30:26 [hgb] 我 仰 望 得 好 处 ， 灾 祸 就 到 了 。 我 等 待 光 明 ， 黑 暗 便 来 了 。 \n [kjv] When I looked for good, then evil came unto me: and when I waited for light, there came darkness. \n [bbe] For I was looking for good, and evil came; I was waiting for light, and it became dark. \n 30:27 [hgb] 我 心 里 烦 扰 不 安 ， 困 苦 的 日 子 临 到 我 身 。 \n [kjv] My bowels boiled, and rested not: the days of affliction prevented me. \n [bbe] My feelings are strongly moved, and give me no rest; days of trouble have overtaken me. \n 30:28 [hgb] 我 没 有 日 光 就 哀 哭 行 去 （ 或 作 我 面 发 黑 并 非 因 日 晒 ） 。 我 在 会 中 站 着 求 救 。 \n [kjv] I went mourning without the sun: I stood up, and I cried in the congregation. \n [bbe] I go about in dark clothing, uncomforted; I get up in the public place, crying out for help. \n 30:29 [hgb] 我 与 野 狗 为 弟 兄 ， 与 鸵 鸟 为 同 伴 。 \n [kjv] I am a brother to dragons, and a companion to owls. \n [bbe] I have become a brother to the jackals, and go about in the company of ostriches. \n 30:30 [hgb] 我 的 皮 肤 黑 而 脱 落 ， 我 的 骨 头 因 热 烧 焦 。 \n [kjv] My skin is black upon me, and my bones are burned with heat. \n [bbe] My skin is black and dropping off me; and my bones are burning with the heat of my disease. \n 30:31 [hgb] 所 以 ， 我 的 琴 音 变 为 悲 音 ， 我 的 箫 声 变 为 哭 声 。 \n [kjv] My harp also is turned to mourning, and my organ into the voice of them that weep. \n [bbe] And my music has been turned to sorrow, and the sound of my pipe into the noise of weeping. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/114/1633.html","bookId":183,"book":{"id":183,"title":"约伯记 Job","description":"简介： 1:1 [hgb] 乌 斯 地 有 一 个 人 名 叫 约 伯 。 那 人 完 全 正 直 ， 敬 畏 神 ， 远 离 恶 事 。 [kjv] There was a man in the land of Uz, whose name was Job; and that man was perfect and upright, and one that feared G...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/114","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:44 AM"}}
