{"id":5732,"no":34,"title":"Chapter 34","content":"34:1 [hgb] 以 利 户 又 说 ， \n [kjv] Furthermore Elihu answered and said, \n [bbe] And Elihu made answer and said, \n 34:2 [hgb] 你 们 智 慧 人 ， 要 听 我 的 话 。 有 知 识 的 人 ， 要 留 心 听 我 说 。 \n [kjv] Hear my words, O ye wise men; and give ear unto me, ye that have knowledge. \n [bbe] Give ear, you wise, to my words; and you who have knowledge, give attention to me; \n 34:3 [hgb] 因 为 耳 朵 试 验 话 语 ， 好 像 上 膛 尝 食 物 。 \n [kjv] For the ear trieth words, as the mouth tasteth meat. \n [bbe] For words are tested by the ear, as food is tasted by the mouth. \n 34:4 [hgb] 我 们 当 选 择 何 为 是 ， 彼 此 知 道 何 为 善 。 \n [kjv] Let us choose to us judgment: let us know among ourselves what is good. \n [bbe] Let us make the decision for ourselves as to what is right; let us have the knowledge among ourselves of what is good. \n 34:5 [hgb] 约 伯 曾 说 ， 我 是 公 义 ， 神 夺 去 我 的 理 。 \n [kjv] For Job hath said, I am righteous: and God hath taken away my judgment. \n [bbe] For Job has said, I am upright, and it is God who has taken away my right; \n 34:6 [hgb] 我 虽 有 理 ， 还 算 为 说 谎 言 的 。 我 虽 无 过 ， 受 的 伤 还 不 能 医 治 。 \n [kjv] Should I lie against my right? my wound is incurable without transgression. \n [bbe] Though I am right, still I am in pain; my wound may not be made well, though I have done no wrong. \n 34:7 [hgb] 谁 像 约 伯 ， 喝 讥 诮 如 同 喝 水 呢 ？ \n [kjv] What man is like Job, who drinketh up scorning like water? \n [bbe] What man is like Job, a man who freely makes sport of God, \n 34:8 [hgb] 他 与 作 孽 的 结 伴 ， 和 恶 人 同 行 。 \n [kjv] Which goeth in company with the workers of iniquity, and walketh with wicked men. \n [bbe] And goes in the company of evil-doers, walking in the way of sinners? \n 34:9 [hgb] 他 说 ， 人 以 神 为 乐 ， 总 是 无 益 。 \n [kjv] For he hath said, It profiteth a man nothing that he should delight himself with God. \n [bbe] For he has said, It is no profit to a man to take delight in God. \n 34:10 [hgb] 所 以 你 们 明 理 的 人 ， 要 听 我 的 话 。 神 断 不 至 行 恶 ， 全 能 者 断 不 至 作 孽 。 \n [kjv] Therefore hearken unto me ye men of understanding: far be it from God, that he should do wickedness; and from the Almighty, that he should commit iniquity. \n [bbe] Now then, you wise, take note; you men of knowledge, give ear to me. Let it be far from God to do evil, and from the Ruler of all to do wrong. \n 34:11 [hgb] 他 必 按 人 所 作 的 报 应 人 ， 使 各 人 照 所 行 的 得 报 。 \n [kjv] For the work of a man shall he render unto him, and cause every man to find according to his ways. \n [bbe] For he gives to every man the reward of his work, and sees that he gets the fruit of his ways. \n 34:12 [hgb] 神 必 不 作 恶 ， 全 能 者 也 不 偏 离 公 平 。 \n [kjv] Yea, surely God will not do wickedly, neither will the Almighty pervert judgment. \n [bbe] Truly, God does not do evil, and the Ruler of all is not a false judge. \n 34:13 [hgb] 谁 派 他 治 理 地 ， 安 定 全 世 界 呢 ？ \n [kjv] Who hath given him a charge over the earth? or who hath disposed the whole world? \n [bbe] Who put the earth into his care, or made him responsible for the world? \n 34:14 [hgb] 他 若 专 心 为 己 ， 将 灵 和 气 收 归 自 己 。 \n [kjv] If he set his heart upon man, if he gather unto himself his spirit and his breath; \n [bbe] If he made his spirit come back to him, taking his breath into himself again, \n 34:15 [hgb] 凡 有 血 气 的 就 必 一 同 死 亡 ， 世 人 必 仍 归 尘 土 。 \n [kjv] All flesh shall perish together, and man shall turn again unto dust. \n [bbe] All flesh would come to an end together, and man would go back to the dust. \n 34:16 [hgb] 你 若 明 理 ， 就 当 听 我 的 话 ， 留 心 听 我 言 语 的 声 音 。 \n [kjv] If now thou hast understanding, hear this: hearken to the voice of my words. \n [bbe] If you are wise, take note of this; give ear to the voice of my words. \n 34:17 [hgb] 难 道 恨 恶 公 平 的 可 以 掌 权 吗 ？ 那 有 公 义 的 ， 有 大 能 的 ， 岂 可 定 他 有 罪 吗 ？ \n [kjv] Shall even he that hateth right govern? and wilt thou condemn him that is most just? \n [bbe] How may a hater of right be a ruler? and will you say that the upright Ruler of all is evil? \n 34:18 [hgb] 他 对 君 王 说 ， 你 是 鄙 陋 的 。 对 贵 臣 说 ， 你 是 邪 恶 的 。 \n [kjv] Is it fit to say to a king, Thou art wicked? and to princes, Ye are ungodly? \n [bbe] He who says to a king, You are an evil-doer; and to rulers, You are sinners; \n 34:19 [hgb] 他 待 王 子 不 徇 情 面 ， 也 不 看 重 富 足 的 过 于 贫 穷 的 ， 因 为 都 是 他 手 所 造 。 \n [kjv] How much less to him that accepteth not the persons of princes, nor regardeth the rich more than the poor? for they all are the work of his hands. \n [bbe] Who has no respect for rulers, and who gives no more attention to those who have wealth than to the poor, for they are all the work of his hands. \n 34:20 [hgb] 在 转 眼 之 间 ， 半 夜 之 中 ， 他 们 就 死 亡 。 百 姓 被 震 动 而 去 世 。 有 权 力 的 被 夺 去 非 借 人 手 。 \n [kjv] In a moment shall they die, and the people shall be troubled at midnight, and pass away: and the mighty shall be taken away without hand. \n [bbe] Suddenly they come to an end, even in the middle of the night: the blow comes on the men of wealth, and they are gone, and the strong are taken away without the hand of man. \n 34:21 [hgb] 神 注 目 观 看 人 的 道 路 ， 看 明 人 的 脚 步 。 \n [kjv] For his eyes are upon the ways of man, and he seeth all his goings. \n [bbe] For his eyes are on the ways of a man, and he sees all his steps. \n 34:22 [hgb] 没 有 黑 暗 ， 阴 翳 能 给 作 孽 的 藏 身 。 \n [kjv] There is no darkness, nor shadow of death, where the workers of iniquity may hide themselves. \n [bbe] There is no dark place, and no thick cloud, in which the workers of evil may take cover. \n 34:23 [hgb] 神 审 判 人 ， 不 必 使 人 到 他 面 前 再 三 鉴 察 。 \n [kjv] For he will not lay upon man more than right; that he should enter into judgment with God. \n [bbe] For he does not give man a fixed time to come before him to be judged. \n 34:24 [hgb] 他 用 难 测 之 法 ， 打 破 有 能 力 的 人 ， 设 立 别 人 代 替 他 们 。 \n [kjv] He shall break in pieces mighty men without number, and set others in their stead. \n [bbe] He sends the strong to destruction without searching out their cause, and puts others in their place. \n 34:25 [hgb] 他 原 知 道 他 们 的 行 为 ， 使 他 们 在 夜 间 倾 倒 灭 亡 。 \n [kjv] Therefore he knoweth their works, and he overturneth them in the night, so that they are destroyed. \n [bbe] For he has knowledge of their works, overturning them in the night, so that they are crushed. \n 34:26 [hgb] 他 在 众 人 眼 前 击 打 他 们 ， 如 同 击 打 恶 人 一 样 。 \n [kjv] He striketh them as wicked men in the open sight of others; \n [bbe] The evil-doers are broken by his wrath, he puts his hand on them with force before the eyes of all onlookers. \n 34:27 [hgb] 因 为 他 们 偏 行 不 跟 从 他 ， 也 不 留 心 他 的 道 ， \n [kjv] Because they turned back from him, and would not consider any of his ways: \n [bbe] Because they did not go after him, and took no note of his ways, \n 34:28 [hgb] 甚 至 使 贫 穷 人 的 哀 声 ， 达 到 他 那 里 。 他 也 听 了 困 苦 人 的 哀 声 。 \n [kjv] So that they cause the cry of the poor to come unto him, and he heareth the cry of the afflicted. \n [bbe] So that the cry of the poor might come up to him, and the prayer of those in need come to his ears. \n 34:29 [hgb] 他 使 人 安 静 ， 谁 能 扰 乱 （ 或 作 定 罪 ） 呢 ？ 他 掩 面 谁 能 见 他 呢 ？ 无 论 待 一 国 ， 或 一 人 都 是 如 此 。 \n [kjv] When he giveth quietness, who then can make trouble? and when he hideth his face, who then can behold him? whether it be done against a nation, or against a man only: \n [bbe] ... \n 34:30 [hgb] 使 不 虔 敬 的 人 不 得 作 王 ， 免 得 有 人 牢 笼 百 姓 。 \n [kjv] That the hypocrite reign not, lest the people be ensnared. \n [bbe] ... \n 34:31 [hgb] 有 谁 对 神 说 ， 我 受 了 责 罚 ， 不 再 犯 罪 。 \n [kjv] Surely it is meet to be said unto God, I have borne chastisement, I will not offend any more: \n [bbe] ... \n 34:32 [hgb] 我 所 看 不 明 的 ， 求 你 指 教 我 。 我 若 作 了 孽 ， 必 不 再 作 。 \n [kjv] That which I see not teach thou me: if I have done iniquity, I will do no more. \n [bbe] ... \n 34:33 [hgb] 他 施 行 报 应 ， 岂 要 随 你 的 心 愿 ， 叫 你 推 辞 不 受 吗 ？ 选 定 的 是 你 ， 不 是 我 。 你 所 知 道 的 只 管 说 吧 。 \n [kjv] Should it be according to thy mind? he will recompense it, whether thou refuse, or whether thou choose; and not I: therefore speak what thou knowest. \n [bbe] ... \n 34:34 [hgb] 明 理 的 人 ， 和 听 我 话 的 智 慧 人 ， 必 对 我 说 。 \n [kjv] Let men of understanding tell me, and let a wise man hearken unto me. \n [bbe] Men of knowledge, and all wise men, hearing me, will say, \n 34:35 [hgb] 约 伯 说 话 没 有 知 识 ， 言 语 中 毫 无 智 慧 。 \n [kjv] Job hath spoken without knowledge, and his words were without wisdom. \n [bbe] Job\u0027s words do not come from knowledge; they are not the fruit of wisdom. \n 34:36 [hgb] 愿 约 伯 被 试 验 到 底 ， 因 他 回 答 像 恶 人 一 样 。 \n [kjv] My desire is that Job may be tried unto the end because of his answers for wicked men. \n [bbe] May Job be tested to the end, because his answers have been like those of evil men. \n 34:37 [hgb] 他 在 罪 上 又 加 悖 逆 。 在 我 们 中 间 拍 手 ， 用 许 多 言 语 轻 慢 神 。 \n [kjv] For he addeth rebellion unto his sin, he clappeth his hands among us, and multiplieth his words against God. \n [bbe] For in addition to his sin, he is uncontrolled in heart; before our eyes he makes sport of God, increasing his words against him. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/114/1637.html","bookId":183,"book":{"id":183,"title":"约伯记 Job","description":"简介： 1:1 [hgb] 乌 斯 地 有 一 个 人 名 叫 约 伯 。 那 人 完 全 正 直 ， 敬 畏 神 ， 远 离 恶 事 。 [kjv] There was a man in the land of Uz, whose name was Job; and that man was perfect and upright, and one that feared G...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/114","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:44 AM"}}
