{"id":79906,"no":5,"title":"Page 5","content":"The legal status of the clone as property cannot be questioned. This is a decision we have taken as a species for the survival of the species. The clone is a spare-parts bank and much more. The clone falls outside the legal prohibition against experiments upon humans without their informed consent. Clones are property and that\u0027s that.\n - Morgan Hempstead, Lectures at Moonbase\n BICKEL HEARD Flattery and Timberlake enter Com-central, but was forced to keep his attention on the big board. An odd timed pulse had appeared in the primary loops of the navigational analogue banks of the computer. It appeared and vanished with no apparent cause. Each oddity of computer function forced a review of that basic question: Why had the OMCs failed?\n Was this strange pulse a thing for which the brains were unprepared? How could it be when every last OMC circuit tested open-and-operating?\n The answer to the OMC failure lay in the psychological area, Bickel felt. The seat of the problem was in that one place where they could not stick their probes - in the gray matter that once had been part of a human.\n Well, I know how we have to tackle this mess, Bickel thought. But will the others go along?\n Bickel heard Flattery slide onto his own action couch, risked a glance at the man. Flattery might be difficult to handle. Flattery was an M.D. and ship-trained, yes. He could stand a watch, repair the simpler servos and sensors, and obey the ordinary precautions that spelled out life-systems security. There was another Flattery, though: the psychiatrist-chaplain. To Bickel, the psychiatrist half of the man suggested special usefulness, but the enigma of the chaplain offered only mysticism and open-end arguments.\n I never know which mask Flattery\u0027s wearing, Bickel thought. He wished then there could have been a way to avoid having a chaplain on the Tin Egg. But there had been no way; the world\u0027s religious millions paid an enormous amount of taxes. The psychiatrists, in training Flattery and his backups, had approached the job sincerely. They had had little choice. It had been a long time since psychiatrists denied they served a witch-doctor function... and the step from witch doctor to divine was a short one.\n Timberlake came up beside Bickel, studied the gauge which showed the timed pulse in the navigational analogue banks.\n \"That acts like a Doppler reference pulse from the time log,\" he said. \"You been checking our position?\"\n \"No,\" Bickel said, and as he spoke, the answer to this variant pulse clicked home in his mind. He had set up a telltale warning net in the computer to alert him when ship damage reached a critical point. Damage to the navigational system could be most critical - especially internal damage. But unlike destruction of hardware, that internal damage would only betray itself by position errors. His telltale circuitry had alerted one of the ship computer\u0027s master programs. A running Doppler reference check was being made on their position.\n Bickel shifted to the computer board, ran a series trial on the navigational loops, read the induced resonance off the pulsing gauges. It checked.\n He explained what was happening.\n \"The computer acts... almost... human,\" Flattery said.\n Bickel and Timberlake exchanged a knowing smile. Almost human, indeed! The damn thing merely was doing what it was designed to do.\n \"We\u0027d better take the computer schematics and the design specs and have a real skull session on what the lack of an OMC may be doing to it,\" Timberlake said.\n Bickel nodded. He was thankful then that Timberlake was, in many respects, as good an electronics man as anyone on the ship - the necessary foundation for his specialty. There was always that almost qualification on his abilities, though. Life-systems work trapped men into a \"generalist\" corner. They knew plenty of biophysics, but they were not doctors. They were adept in electronics, but fell short of that smooth juggling of variables which marked the creative engineer.\n \"You ready for a break, John?\" Flattery asked.\n \"Anytime. How\u0027s Prue?\"\n \"Doctor Weygand is asleep now,\" Flattery said. \"She needs a few more hours recuperation.\"\n Why is he so formal? Bickel wondered. Raj must know I shared classes with her. She was always Prue then. Why should she suddenly be Doctor Weygand?\n \"I\u0027ll take the board on the count,\" Flattery said, and they began the change of watch.\n Timberlake, sensing Bickel\u0027s questions, realized that Flattery\u0027s emphasis on Doctor Weygand had not been aimed at the electronics engineer.\n Raj was saying something to me, Timberlake thought. He was telling me that Doctor Weygand may have had medical reasons for her strange behavior. Raj is telling me to keep my mouth shut.\n And Timberlake found himself resenting the fact that Flattery had found the warning necessary.\n Bickel closed off his link to the controls, slipped off his couch, and began exercising the stiffness out of his muscles. Remembering the classes he had shared with Prue Weygand - computer math, servo-sensor repair, ship function - he recalled the woman. She was a disturbing female-plus creature, sensitive and with her feelings all too apparent. Bickel realized then that a photograph of Prue Weygand in repose would show a rather unassuming woman with regular features and a good, but not sensational figure. She was the kind who attracted male stares, though. She radiated some vital, sparking thing - especially when she walked.\n Is that why I chose her? Bickel wondered. He broke off his exercises to consider the question. The Prue kind of woman presented a source of trouble in an otherwise all-male crew - unless they all went on anti-S. But they couldn\u0027t afford to dull their faculties that way.\n I chose her because, in a ship of quintuple backup, she appears unique, Bickel reassured himself. She is trained in ecology, medicine, and computer math. She is going to be damned useful to us.\n But doubts remained.\n Bickel forced them out of his mind by looking around Com-central, focusing his attention on the ship. The ship-cum-computer-cum-hybernating-colonists - here was one set of resources that Bickel felt they could fit into a logical pigeonhole, assess and weigh and use as they needed.\n He sensed the ship stretching out from him in its sixteen concentric shells, a great ovoid bulk almost a mile across its long axis. Beyond the water barrier and baffles that shielded the core lay miles of corridors and tubeways, self-sealing compartments. Through it all stretched the organized clutter of material needed to make life possible for humans in an alien environment.\n In the hyb tanks they had two thousand adult humans, a thousand human embryos, and more than six thousand animal embryos...full ecological spectrum.\"\n Bickel turned, looked at his own computer board. His plan involved dangerous risk to the computer, but the risk was necessary. The others might fight him, but they would have to come around.\n He looked at Flattery busy on the big board, Timberlake taking a relaxing massage on his action couch. He looked back at the computer board. The Tin Egg\u0027s computer was basically a multisystem system with internal ruby laser \"real time\" clocks to log its own \"experiences.\" It incorporated more than 800,000 specialized routines (installed by a prodigious spending of manpower). Bickel weighed the computers untried potential: its trinanosecond thoughtput and multischeduling facilities allowed it to interleave thousands of programs simultaneously. It could monitor sequencing, cuing, and input through a core memory with enormous reserves of trapping functions, branching operations, and alarm systems networks.\n With an OMC tied in as supervisory program - as supreme decision-maker - the computer and the ship it controlled had been a living creature of metal. But three brains had failed in that delicately powerful linkage. And Bickel-the-pragmatist trusted only that which worked. Without an OMC, the ship computer remained an inert mass of machinery whose output-on-demand followed a fixed design and could be accepted or rejected only after a human decision.\n \"How long until Prue will be with us?\" Bickel asked.\n \"About three hours,\" Timberlake said.\n \"I want her opinion on the postmortem,\" Bickel said. \"I\u0027m not satisfied with what we found in the first two brains.\"\n Timberlake shut down his couch massage, directed a probing stare at Flattery.\n The psychiatrist-chaplain only smiled, reminding himself that Bickel was logic-prone with a disregard of everything except the main line of reasoning that made him sound boorish at times.\n \"Moonbase\u0027ll ask some questions for which we have no answers,\" Bickel said. \"We can\u0027t afford to sound fumbling.\" He looked at Timberlake. \"They\u0027re going to take us apart, one by one - life systems to...\"\n \"Life systems were perfect!\" Timberlake snapped.\n \"We\u0027d better be able to prove it,\" Bickel said.\n \"I went through the entire console when Brain One failed,\" Timberlake said. \"Check it yourself.\"\n \"I did. A couple of things bothered me. Brain One preferred to be called Myrtle. Why? I find nothing in the memory core to explain that - except that Brain One was removed from a genetic monster that probably was female.\"\n \"Myrtle\u0027s personal life system tested within .0002 of homeostatic center on the Anders Base,\" Timberlake said.\n \"Don\u0027t let that identity preference seduce you,\" Flattery said. \"It was for our benefit - so we could anthropomorphize the ship-OMC.\"\n \"Yeah,\" Bickel said. \"That\u0027s the reason they each gave, but is it the right one?\"\n \"Those brains were as perfect as any ever born,\" Flattery said, and he wondered why he allowed Bickel\u0027s attitude to irritate him. \"Okay, they were raised from infancy as part of the total ship-sensor-servo system. So what? They didn\u0027t know any other life or want -\"\n \"You said a couple of things were bothering you,\" Timberlake interrupted. \"What\u0027s the other one?\"\n \"Your life-systems report,\" Bickel said, \"entry 9107 on Myrtle. It says: \u0027None of the systems appear then to have been at fault.\u0027 Why\u0027d you use that word appear, Tim? You have some doubts you couldn\u0027t enter in the report?\"\n \"Not a damn one!\" Timberlake said. \"Those systems were perfect!\"\n \"Then why didn\u0027t you just say so?\"\n \"He was only being cautious,\" Flattery said. \"If you have checked the records, you\u0027ll find my medical report confirms his findings in every respect.\"\n \"Except one,\" Bickel said.\n \"And what is that?\" Timberlake asked. He glared at Bickel, his face flushed. A muscle worked along his jaw.\n Bickel ignored the signs of anger, said: \"Nothing explains the internal burn damage that Raj found in those brains. \u0027Internal burn damage,\u0027 you say, \u0027especially along the overlarge axon collaterals of the afferent side.\u0027 What the devil do you mean overlarge? Overlarge compared to what?\"\n \"A main channel leading into the brain\u0027s higher centers was about four times the size of anything I had ever seen,\" Flattery said. \"I don\u0027t know why, but I can guess it was compensatory growth. These OMCs had to handle many more incoming data bits from more sensors than the normal human ever encounters. You\u0027ll note that the frontal lobes were larger, too, but the...\"\n \"The design specs on the OMC process explain all that,\" Bickel said. \"Compensatory growth, yeah, but I don\u0027t find one word about large axon collaterals. Not one word.\"\n \"These brains had been in the system longer than any others ever examined,\" Timberlake said. \"The literature reports only on four previously that died of natural causes, and we -\"\n \"Natural causes?\" Bickel asked. \"What\u0027s a natural cause fatal to an OMC?\"\n \"You know what happened as well as I do,\" Flattery said. \"Accidents - irritant matter in the food bath, a radiation shield left down for -\"\n \"Human error, not OMC error!\" Bickel snapped. \"Not natural. And here is another thing: Myrtle lapsed into catatonia or whatever you want to call it just ten days, fourteen hours, eight minutes, and eleven seconds from Moonbase. We threw Little Joe into service and he lasted six days, nine hours, one second. So we turned the ship over to Harvey - our last chance - and Harvey took fifteen hours even. Kaput!\"\n \"Greater and greater stress and they broke down faster and faster,\" Flattery said. \"But you\u0027ll notice that the last words from each betrayed a type of deterioration akin to schizo -\"\n \"Akin!\" Bickel sneered. \"That\u0027s what you see all through these damn reports: \u0027Something similar to...\u0027\u0027 A condition that reminds one of...\u0027 \u0027Akin to...\u0027\" He glared from Flattery to Timberlake. \"The truth is we don\u0027t know what the hell goes on in an OMC\u0027s gray matter.\"\n A clicking-buzzing erupted from the master board above Flattery.\n Bickel waited while Flattery fought out a manual temperature adjustment in an inner hold. Presently, Flattery wiped perspiration from his forehead, studied his gauges to be certain the balance was holding.\n \"Man, that board is murder,\" Timberlake muttered. \"I don\u0027t wonder those OMCs caved in.\"\n Flattery risked a glance away from the board. \"You know better than that, Tim. This part of the job was child\u0027s play for a functioning OMC. They could handle most ship homeostasis problems by something akin to reflex action.\"\n \"Akin,\" Bickel said.\n \"All right!\" Flattery barked, and pretended to be busy with the board to hide his confusion at allowing Bickel to get to him that way.\n A long silence settled over Com-central, broken when Flattery regained his composure and said, \"I was about to say that the end tapes on each brain show statements similar to schizophrenic writing. It makes a pretense of meaning... and sometimes stumbles onto a colorful phrase, but the essential...\"\n He broke off as the master board grew three diagonal stripes of flashing yellow. Flattery\u0027s hands darted to the controls as Bickel shouted, \"Grav shift!\" and dove for his couch.\n Cocoons snapped closed around them and they felt the creeping, jerking weight shifts, the runaway fluctuation of the field-centering system - the unexplained gravity variance that had killed Maida. \n","sourceLink":"https://allnovel.net/destination-void-destination-void-1/page-5.html","bookId":2449,"book":{"id":2449,"title":"Destination: Void (Destination: Void #1)","description":"Storyline: \n Destination: Void (Destination: Void #1) \n The starship Earthling, filled with thousands of hybernating colonists en route to a new world at Tau Ceti, is stranded beyond the solar system when the ship\u0027s three Organic Mental Cores, disembodied human brains that control the vessel\u0027s functions, go insane. An emergency skeleton crew sees only one chance for survival: to create an artificial consciousness in the Earthling\u0027s primary computer, which could guide them to their destination . . . or could destroy the human race. \n Frank Herbert\u0027s classic novel that begins the epic Pandora Sequence (written with Bill Ransom), which also includes The Jesus Incident, The Lazarus Effect, and The Ascension Factor.\n \n","cover":"https://allnovel.net/images/destination-void-destination-void-1.jpg","author":"Frank Herbert","type":"Horror","source":"allnovel","link":"https://allnovel.net/destination-void-destination-void-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:21:07 PM"}}
