{"id":79909,"no":8,"title":"Page 8","content":"I considered the being whom I had cast among mankind and endowed with the will and power to effect purposes of horror... A being whom I myself had formed, and endued with life, had met me at midnight among the precipices of an inaccessible mountain.\n - Mary Shelley\u0027s Frankenstein\n BICKEL GRABBED A hatch handle to steady himself and swung out the repair traveler. He opened a panel to get at the gravity system, identified the cables, and bent to his work. He went about it silently, angrily, with swift, decisive movements, and all the time he thought about their dilemma.\n Iron. Free ions of iron out here?\n Possible, but was there a simpler answer to the anomaly, something that would produce an illusory report on their instruments?\n Was it possible that some part of the ship\u0027s computer/reporting system had been concealed from them, shielded away from their prying? He knew it not only was possible but probable. Why would Moonbase do that?\n The complete answer escaped him, but he knew he would have to continue probing for it.\n Presently, he had an improvised cage switch clamped into the main power cable into the gravity generator. He made the connections to the breaker, tested the circuits with a false load, replaced the cover plate.\n \"It\u0027ll have to be reset manually each time,\" he said. He put a foot against the bulkhead, propelled himself back to his couch, locked in, glanced at Timberlake. \"System balanced?\"\n \"Near as you can tell from here,\" Timberlake said. \"Give it a try, Raj.\"\n Flattery checked to see that both Timberlake and Bickel were sealed in their cocoons, closed the gravity switch. The sound of the generators building up grew to a faint hiss that subsided as the system stabilized. Flattery felt the pressure against his shoulder blades, reached up to the board, slowly refined Timberlake\u0027s settings.\n \"Tim,\" Bickel said, \"I want the schematics for the OMC chamber - every sensor tie coded for function - and laid out in layers from gross to fine. I\u0027ll need the same thing for servo control, a complete -\"\n \"Why?\" Timberlake asked.\n \"Are you thinking of tying in a colonist\u0027s brain?\" Flattery demanded, trying to hide his feelings of outrage at the idea.\n \"A mature human brain probably wouldn\u0027t survive such a transfer,\" Timberlake said. And he felt shame at how much the thought had appealed to him. Every inhibition of his training cried out against such a move. But if the OMC system were restored, none of them here ever again would have to undergo the nerve-crushing responsibility of that Com-central master board. He looked up at the live green arrow denoting that Flattery had the controls, felt himself go clammy with fear at the thought of that arrow swinging back to his position.\n \"What the hell!\" Bickel snapped. \"Where\u0027d you two get that idea? Not from anything I said.\" He lifted his head from the cocoon clamps, looked from Timberlake to Flattery. \"We don\u0027t know what happened to our three perfect brains. Why the devil\u0027d I want to tie in an untested one?\" He sank back. \"It\u0027s impossible anyway. A man should have some say in what\u0027s done to him. How could we poll everyone in the hyb tanks? We can\u0027t wake them all.\"\n \"You thinking of dismantling the OMC controls and converting us to a closed ecological system?\" Flattery asked. \"If you are, you should -\"\n He broke off as the high-pitched hummm-buzzz-hummmm of the AAT receiver filled the room, alerting them that a message was being processed.\n Bickel followed the play of lights across his board as the message was gulped by the receivers, fed through the comparison blocks, refined to a single playback (with probable accuracy quotient logged beside each character), and finally was slowed to make it intelligible for human ears.\n Sure as hell took \u0027em long enough, Bickel thought. He read the time log, subtracted the distance lag. Almost seven hours. He thought then of the first ships using single-channel radio, punching their messages across the solar system with only a few watts - but the error-uncertainty factor built up with distance and cumulative adverse interference. The Tin Egg\u0027s system had been engineered for computer-monitored automatic reports over stellar distances to tell watchers as yet unborn back on Earth how things fared with their star probe.\n The message-ready chime sounded. Bickel keyed the vocoder. The voice of Morgan Hempstead, United Moonbase director, rolled out of the speakers, recognizable and still with its iced iron overtones preserved by the AAT\u0027s comparators.\n \"To UMB ship Earthling from Project Control. This is Morgan Hempstead. We hope you understand our distress and concern. Every decision from this point must have a prime motive of preserving the lives of yourselves and the colonists.\"\n So much for the record, Flattery thought. There are seven nations and four races represented in the hyb Tanks - but all just as expendable as the ones who went before us.\n \"We have several prime questions,\" Hempstead said.\n I\u0027ve a few questions of my own, Bickel thought.\n \"Why was Project Control not alerted when the first Organic Mental Core failed?\" Hempstead asked.\n Bickel mentally logged the question. He knew the answer, but it was nothing he would ever transmit. Hempstead knew it as well as he did. The Tin Egg had momentum as an idea that had survived six failures. Nothing short of another ultimate failure would stop it. Nothing short of desperate emergency could make them risk aborting the mission by calling for help.\n \"Doppler reference indicates you\u0027ll be out of the solar system in approximately three hundred and sixteen days at present stabilized speed,\" Hempstead said. \"Time to Tau Ceti: four hundred-plus years.\"\n As he listened, Bickel pictured the man behind the voice: flintlike face with gray hair and gray-blue eyes - that aura of momentous decision even in his smallest gesture. The psych boys had called him \"Big Daddy\" behind his back, but they had jumped when he commanded. Now, Bickel focused on the fact that they never again expected to see Hempstead, yet the man still could reach into their midst with his decisions.\n \"First analysis indicates these possibilities,\" Hempstead went on. \"You could turn back to orbit around UMB until the problem is solved and new Organic Mental Cores installed. That would return us to the old problem of sterile control under less than ideal conditions. It also would remove the ship from the situation of probable cause in the OMC breakdowns, perhaps making solution impossible.\"\n \"He always was a long-winded bore,\" Timberlake said.\n \"Second possibility,\" Hempstead said, \"would be for you to convert to a closed ecology and continue at present speed, enlisting replacements from your hybernation tanks or breeding and raising your own crew complement. You would, of course, face high probability of genetic damage through the necessity of staying outside your core-shield areas long enough to build quarters for prolonged occupation. However, food would be your major problem unless you adopted a more closely integrated recycling system.\"\n \"Closely integrated recycling,\" Flattery said. \"He means cannibalism. It was discussed.\"\n Bickel turned to stare at Flattery. The idea of cannibalism was repellent, but that was not what had caught Bickel\u0027s attention. \"It was discussed.\" That simple statement contained volumes of unanswered questions and hidden implications.\n \"Third possibility,\" Hempstead was saying, \"would be to build the necessary consciousness into your robo-pilot, using the ship computer as a basis. Our computations indicate you have sufficient materials, including neuron packages intended for colony robots in your stores. This is theoretically feasible.\"\n \"Theoretically feasible!\" Timberlake sneered. \"Does he think we\u0027ve never heard about all the failures in -\"\n \"Shhhh,\" Flattery hissed.\n \"Project Council suggests you continue present course and speed,\" Hempstead said, \"as long as you are within the solar system. If a solution has not been reached by then, present opinion is that you will be ordered to turn back.\" There followed a long silence, then: \"....nless you have alternative suggestions.\"\n \"You will be ordered to turn back,\" Flattery thought. He turned to see how those key words sat with Bickel. They were aimed at Bickel, contrived for him, fitted specially to trigger his deepest motives.\n Bickel lay in thoughtful silence staring up at the speech microscope display above the vocoder, checking the accuracy of message reception.\n \"At this time,\" Hempstead said, \"Project Control requires a detailed report on condition of all ship systems with special reference to hybernating colonists. It is recognized that prolonging the voyage increases probability of hybernation failure. We recognize that you must replace crew losses from the tanks. Suggestions on replacements will be made upon request. We share your grief at the unfortunate accidents among you, but the Project must continue.\"\n \"Detailed report on all ship systems,\" Timberlake said. \"He\u0027s out of his mind.\"\n How cold was Hempstead\u0027s commiseration, Flattery thought. The phrasing betrayed the care with which it had been composed. Just enough grief, not too much.\n The vocoder emitted a filter-dulled crackling, then: \"This is Morgan Hempstead closing transmission. Acknowledge and answer our questions immediately. UMB out.\"\n \"They left too much unsaid,\" Bickel said. He sensed the \"deletions for reasons of policy\" all through the message. The thin political line they walked had been betrayed most in what was not said.\n \"Build consciousness into our computer,\" Timberlake growled. \"How stupid can they get?\" He glanced at Bickel. \"You were on one of the original attempts at UMB, John. You get the honor of telling \u0027Big Daddy\u0027 where he can shove that idea.\"\n \"That attempt flopped and badly,\" Bickel agreed. \"But it\u0027s still the only real course open to us.\"\n Timberlake raged on as though he hadn\u0027t heard: \"There were people on the UMB fiasco who make us look like a pack of amateurs.\"\n Flattery had heart, though, and he hid a knowing smile by turning away and speaking mildly: \"We all read the report, Tim.\"\n \"The only part worth reading was their summation.\" Timberlake pitched his voice in a sneering falsetto: \"\u0027Impossible of achievement at present level of technology.\u0027\"\n \"That was an excuse, not a summation,\" Bickel said. And he thought back to UMB\u0027s fruitless search for the Artificial Consciousness Factor. There had always been that sterile wall between his part of the group and the station personnel, but the triple-glass walls had never hidden the smell of failure. It had been all around the project from the beginning. They had been lost in tangles of pseudoneuron fiber, in winking lights and the snap of relays, the hiss of tape reels and the bitter ozone smell of burnt insulation from overloaded circuits. They had looked for a mechanical way to do what the least among them could do within his own flesh - be conscious. And they had failed.\n Over them all had hung the unspoken fear, the knowledge of what had happened to the one project that reportedly had achieved success - and its own doom - back on the surface of Earth.\n Timberlake cleared his throat, lifted a hand out of his couch cocoon, studied his fingernails. \"Well, how\u0027re we going to answer their damn questions? They must be living in a dream world back there, expecting us to produce a detailed report on ship systems without the help of an OMC.\"\n \"But they had to ask for it,\" Bickel said. \"And we\u0027ll have to doctor up some kind of report.\"\n Bickel looked at Flattery. \"You can cook up a report for Hempstead, Raj. Psychiatrists are experts at deception.\"\n At times, this Bickel is uncommonly aware of subtleties, Flattery thought. I must warn Prudence. \"All of us renounced deception, John.\"\n \"Just like we renounced birth and parents,\" Bickel said. \"It was easy. Somebody did it for us.\"\n Flattery knew he had to speak quickly, before this conversation devolved into self-pity. He kept his attention on a tiny paint flaw in the hard-baked surface of the master board, chose his words carefully: \"The ship has to have conscious direction for the long haul, John. It has to. The trip involves too many unknowns that have to be dealt with on conditions of immediacy. So what do we do?\"\n \"You\u0027re asking me?\" Bickel asked. \"You\u0027re the psychiatrist.\"\n But I\u0027m not the motivator here, Flattery thought. Pin not the one who can inject purpose into our efforts.\n \"This is going to require more direct methods,\" he said.\n Bickel stared at him.\n \"Well, what\u0027re you going to tell them?\" Timberlake asked. \"They want to know why we didn\u0027t alert them when the first brain conked out. Of all the -\"\n \"There\u0027s another thing,\" Bickel said, shifting his attention to Timberlake. \"They gave us no code for that particular emergency. Are we to assume they thought it impossible for the OMCs to fail? We are not! We have to assume they had some other motive. They put the threshold high on that one for a specific purpose.\"\n \"Ali, for hell sakes,\" Timberlake protested, \"you\u0027re finding bogeymen where they don\u0027t exist, Bick.\"\n Bickel shook his head from side to side. \"No... they were telling us in no uncertain terms that once we blew the whistle we were on our own. We have to find our own long-haul driver for the Tin Egg.\"\n He\u0027s circling all around it, Flattery thought. When will he zero in?\n Bickel wet his lips with his tongue. This borderline conversation, skirting the need for a consciousness to command the ship, disturbed him deeply. He was too honest with himself to ignore this fact.\n Timberlake, picking up the threads of a previous conversation, said: \"There was no physical reason for those brains to fail. The life systems were perfect. It\u0027s as though they committed suicide... under some unknown stress.\"\n With an abrupt gesture, Bickel shifted his AAT board into transmit phase: \"Okay, we\u0027ll stall \u0027em on their detailed report. They know it\u0027ll take time, anyway. As to why we didn\u0027t alert them earlier, I\u0027ve decided to tell \u0027em flatly it was because they goofed and didn\u0027t give us a code for this particular emergency. If they -\"\n \"You\u0027ll only get Hempstead angry,\" Flattery said.\n \"Hempstead angry will be more help to us than Hempstead cool and devious,\" Bickel said. \"The angry man will make mistakes. He\u0027ll let some real help slip through to us.\"\n \"What makes you think Big Daddy would try to foul us up?\" Timberlake asked.\n \"He\u0027s a political administrator. Even if it\u0027s unconscious...\" Bickel hesitated; an idea had flicked into his mind... then eluded him. He went on, in a lower tone: \"Even if it\u0027s unconscious, he\u0027ll put political considerations ahead of anything else. His first efforts will be to keep himself in power. We\u0027re in a position to throw out political elements and concentrate on our immediate problem. To do that, we throw monkey wrenches into the political gears and focus just on what we need. The things we need will come through.\"\n Adroit, subtle, and capable of profound cunning, Flattery thought. This Bickel bears the most careful watching.\n \"Things we need,\" Timberlake said. \"Such as what?\"\n \"Such as advice from certain specialists at Moonbase, and as much computer time as they can spare us.\"\n \"You can\u0027t separate the political from everything else,\" Flattery objected. \"You\u0027ll only stir things up and -\n \"If you want to see what\u0027s in the bottom of the kettle, you have to give it one hell of a stir,\" Bickel said. \"And I want them to define consciousness for us.\"\n He was way ahead of me again, Flattery thought. I have to stop underestimating him. One slip could ruin everything. \n","sourceLink":"https://allnovel.net/destination-void-destination-void-1/page-8.html","bookId":2449,"book":{"id":2449,"title":"Destination: Void (Destination: Void #1)","description":"Storyline: \n Destination: Void (Destination: Void #1) \n The starship Earthling, filled with thousands of hybernating colonists en route to a new world at Tau Ceti, is stranded beyond the solar system when the ship\u0027s three Organic Mental Cores, disembodied human brains that control the vessel\u0027s functions, go insane. An emergency skeleton crew sees only one chance for survival: to create an artificial consciousness in the Earthling\u0027s primary computer, which could guide them to their destination . . . or could destroy the human race. \n Frank Herbert\u0027s classic novel that begins the epic Pandora Sequence (written with Bill Ransom), which also includes The Jesus Incident, The Lazarus Effect, and The Ascension Factor.\n \n","cover":"https://allnovel.net/images/destination-void-destination-void-1.jpg","author":"Frank Herbert","type":"Horror","source":"allnovel","link":"https://allnovel.net/destination-void-destination-void-1.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:21:07 PM"}}
