{"id":92788,"no":25,"title":"Page 25","content":"\\n\\n “And then they were not dead,” JT supplied. “Come on, Dez … if you’re going to try and sell me on some bullshit that they’re vampires or ghosts or something, then I really am going home to get drunk.”\\n\\n She wiped angrily at the tears. “Did I say anything about vampires? Andy wasn’t Vlad the motherfucking Impaler. He was Andy and he was dead and he was trying to bite people.”\\n\\n “Okay, so what does that make him?”\\n\\n She chewed her lip. “I don’t know. I guess it makes him fucked up.”\\n\\n They both nodded.\\n\\n “We’d better see about that other bite victim,” Dez said. JT nodded and they hurried off. But the nurse in the ER informed them that the man was in surgery under a general anesthesia. JT suggested that the nurse talk with Dr. Sengupta who was dealing with a similar bite wound. The nurse nodded and headed off to do that.\\n\\n Dez and JT walked back to the row of chairs.\\n\\n “It’s hard to believe they’re all gone,” said JT as he sat back down. “Doc, Jeff Strauss, Mike Schneider, Natalie Shanahan. Andy, too, I guess. Five people that I’ve known for years.” He snapped his fingers. “Gone just like that.”\\n\\n Dez nodded.\\n\\n JT cleared his throat. “Is this what it was like in Afghanistan?”\\n\\n Dez shook her head. “Yes and no. The shock and the grief … yeah, they were the same. But the fear was different.”\\n\\n “Different how?”\\n\\n “Over there,” she said, “it was just bullets and bombs. But this…” She shivered. “I don’t know how to be afraid of this. The right way, I mean. You know what I’m trying to say?”\\n\\n “Sadly, I do.”\\n\\n The door to the trauma room opened and the tall Indian doctor came out. It took a moment for them to recognize him because he was covered head to toe in a white hazmat suit. He came toward them but stopped ten feet away and held up a hand to keep them from coming closer to him. His hazmat suit was splattered with betadine and other chemicals.\\n\\n “Doc,” barked Dez, jumping to her feet, “what can you tell us?”\\n\\n “We are taking Officer Diviny to quarantine.”\\n\\n “What’s wrong with him?”\\n\\n “We … still need more information.” He considered them. “Since you were in direct contact with the patient, we should consider admitting you both for observation…”\\n\\n “Not a fucking chance, doc,” growled Dez. “Storm’s hitting any minute.”\\n\\n Sengupta nodded. “Then at least I would like to have a nurse draw blood from both of you. Urine samples, too.”\\n\\n They didn’t ask why. They agreed.\\n\\n “I’ve been on the phone with Poison Control and with several of my colleagues. We have specialists on their way here and I requested a hazmat team for the crime scene.”\\n\\n “What specialists?” JT asked.\\n\\n “Toxicology, epidemiology … others. This is a very … unusual … matter. I … may put a call into the Centers for Disease Control in Atlanta.”\\n\\n “The CDC?” JT frowned. “Then you do think it’s a disease.”\\n\\n “As I said, this is very unusual. We don’t know anything yet.”\\n\\n The vinyl doors opened and the team, all of them in hazmats, wheeled the gurney out and hurried away down the hall. A metal frame had been erected over the bed and it was draped with heavy protective sheeting.\\n\\n Dr. Sengupta directed a nurse to get samples from JT and Dez, and then he hurried down the hall after the gurney.\\n\\n CHAPTER THIRTY-EIGHT\\n\\n STEBBINS COUNTY\\n\\n Billy Trout climbed back in the Explorer and drove away from Selma’s place, a frown etched deeply onto his face.\\n\\n “What’d she say?” asked Goat.\\n\\n Trout fished in his pocket and removed the digital recorder, thumbed back the rewind, dialed the volume up, and pressed play. The recorder had excellent pickup and the playback was only slightly muddied by the cloth of Trout’s trousers. They listened to it twice.\\n\\n Goat said, “Interesting stuff.”\\n\\n “Isn’t it, though?” replied Trout.\\n\\n “She really got to you, didn’t she?”\\n\\n “I’m not afraid to admit it.” Trout cut him a sideways look. “What’s your take on her?”\\n\\n Goat fished a York Peppermint Pattie out of his jacket pocket, opened it, broke it in half, and handed one piece to Trout.\\n\\n “She’s really something,” Goat said, then nibbled the edge of his candy. “She was maybe twenty, twenty-five years younger, I’d have tapped that shit.”\\n\\n “Really? You listen to that tape and the only thing you can say is that you’d throw her a pity fuck?”\\n\\n “I ain’t talking a pity fuck. She looks like she was hot stuff, and not that long ago. I could really see Helen Mirren playing her, ’cause I’d tap Mirren in a heartbeat.”\\n\\n “You worry me at times, Goat.”\\n\\n “Why? ’Cause I’m on the prowl instead of pining for a redneck lady cop who’d like to see your nuts on her key chain?”\\n\\n “Don’t,” warned Trout.\\n\\n “Don’t what? You telling me you’re not still hung up on Officer Boobs?”\\n\\n “I’ve interviewed twenty serial killers over the years, Goat. I know everything there is to know about how to hide a body where it’ll never be found.”\\n\\n “Truth hurt?”\\n\\n “I’m talking dismemberment and multiple burial sites…”\\n\\n “Okay, okay. Subject closed.”\\n\\n “Selma,” Trout prompted. “Give me your professional opinion.”\\n\\n Goat shrugged. “The theater lost a major player when she decided to fuck for a living.”\\n\\n “Meaning?”\\n\\n “She’s incredibly controlled. I could barely tell where she was lying and where she was telling the truth.”\\n\\n “Whoa … barely? So, you could tell some of the times she was lying?”\\n\\n “Well, sure.”\\n\\n Trout glanced at him in the rearview mirror. “Like where?”\\n\\n Goat played part of the tape back. “Here. Listen to this.”\\n\\n Ask your questions.\\n\\n Are you Homer Gibbon’s aunt?\\n\\n Sure. Why not?\\n\\n How well did you know him?\\n\\n Seen him once in a while. Mostly when he was like seventeen and older. After he ran away from foster care the last time.\\n\\n When was the last time you saw him?\\n\\n A pause.\\n\\n Could you be a bit more specific?\\n\\n I don’t know. Maybe back in ninety, ninety-one.\\n\\n Goat hit the pause button. “See?”\\n\\n “No,” admitted Trout.\\n\\n “The pauses. First when you asked her if she was Homer Gibbon’s aunt. She lost about half a second answering.”\\n\\n “So?”\\n\\n “So … why the hesitation? She knew that you were going to ask that, and yet she still stumbles over her answer. And then again when you asked when she saw him last.”\\n\\n “She shrugged.”\\n\\n “Okay, she shrugged. She should have had that answer on the tip of her tongue.”\\n\\n “Damn, kid, she’s dying of cancer and her only nephew was just executed yesterday. How smooth can a person be after all that?”\\n\\n Goat spread his hands. “I’m just saying. In film, pauses mean something, they convey meaning. Same thing happens in conversation. Maybe not always as calculated as theater, but people uses pauses to convey a message or allow a person to stall in order to write a script for a specific message.”\\n\\n “And people call me cynical.”\\n\\n “You asked.”\\n\\n “No, keep going. What else?”\\n\\n Goat played another fragment.\\n\\n That was after he had committed several murders.\\n\\n Alleged murders. He was never convicted for anything back then.\\n\\n “See? She not only threw ‘alleged’ at you, she got kinda pissed that you didn’t use it.”\\n\\n “She’s related to him.”\\n\\n “No doubt,” said Goat. “But I don’t think that’s why she got pissed.”\\n\\n “Why, then? You think she thinks he’s innocent?”\\n\\n “No … I don’t think she cares. That’s a family thing. Especially families on the edge like this. Kind of the ‘my country right or wrong’ mentality distilled down to a single family. People can fuck up and do all manner of harm, but at the end of the day if their name and your name are spelled the same, then there’s going to be some kind of … I don’t know … acceptance? Forgiveness? Maybe even allowance?”\\n\\n “So … what’s your bottom line here?” asked Trout. “Why’s she being so dodgy?”\\n\\n “How should I know? I read performance; you’re the writer … You build the story.”\\n\\n Trout grunted. He rounded a turn too fast and his BlackBerry slid out of the little tray below the dash. Goat picked it up.\\n\\n “You got mail,” said Goat, showing Trout the flashing red light. “You got your ringer turned off?”\\n\\n “Usually. I have two ex-wives and they have aggressive lawyers. I’ll subject myself to that shit later.”\\n\\n Goat grunted. “Looks like you have a zillion missed calls and one e-mail.”\\n\\n “That’ll be from Marcia. Probably the Volker stuff. We’ll be at Volker’s place in ten minutes, so read it for me.”\\n\\n Goat punched the keys and peered at the lines of text. “This is an hour old. Mmm … looks like a bunch of biographical stuff first. She says that Dr. Herman Volker was born in someplace called Panevėžys. No idea how to pronounce it. In Lithuania.”\\n\\n “That fits. I thought he sounded more Slavic than German.”\\n\\n “Father was German, but he was raised in Lithuania. Always into medicine. Worked as a lab tech as a teenager, went to medical school. Did residencies in psychiatry and epidemiology. Went into the Soviet army as a doctor. Then he’s off the radar for a while, but get this … he surfaces again as a field surgeon with the Russian forces in Afghanistan, and while he’s there, he defects to U.S. personnel.” \\n\\n","sourceLink":"https://allnovel.net/dead-of-night-dead-of-night-1/page-25.html","bookId":2570,"book":{"id":2570,"title":"Dead of Night (Dead of Night #1)","description":"Storyline: Dead of Night (Dead of Night #1) \\n A prison doctor injects a condemned serial killer with a formula designed to keep his consciousness awake while his body rots in the grave. But all drugs have unforeseen side-effects. Before he could be buried, the killer wakes up. Hungry. Infected. Contagious. This is the way the world ends. Not with a bang…but a bite.\\n","cover":"https://allnovel.net/images/dead-of-night-dead-of-night-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/dead-of-night-dead-of-night-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:56:28 PM"}}
