{"id":88813,"no":11,"title":"Page 11","content":"Hannah stirred.\\n\\n She vaguely felt that something was wrong, something needed doing. Then she remembered. The car!\\n\\n She had to stay awake, had to keep the car on the road. . .\\n\\n Her eyes flew open.\\n\\n She was already off the road. The Ford had gone roving over the open prairie, where there was almost\\n\\n nothing to hit except sagebrush and tumble-weeds. It had ended up with its front bumper against a\\n\\n prickly pear, bending the cactus at an impossible angle.\\n\\n The night was very quiet. She looked around and found that she could see the light of Chess\u0027s house,\\n\\n behind her and to the left.\\n\\n The engine was off. Hannah turned the key in the ignition, but only got a grinding sound.\\n\\n Now what? Should I get out and walk?\\n\\n She tried to concentrate on her body, to figure out how she felt. She ought to feel terrible-after all, she\u0027d\\n\\n lost blood and swallowed who knew what kind of poison from Thierry\u0027s veins.\\n\\n But instead she only felt strangely dizzy, slightly dreamy.\\n\\n I can walk. I\u0027m fine.\\n\\n Holding on to her length of dowel, she got out of the car and started toward the light. She could hardly\\n\\n feel the rough ground and the bluestem grass under her feet.\\n\\n She had gone about a hundred yards toward the light when she heard a wolf howl.\\n\\n It was such a distinctive sound-and so incongruous. Hannah stopped in her tracks. For a wild moment\\n\\n she wondered if coyotes howled.\\n\\n But that was ridiculous. It was a wolf, just like the wolves that had attacked her at Paul\u0027s. And she didn\u0027t\\n\\n have anything made of silver.\\n\\n Just keep walking, she thought. She didn\u0027t need the cool wind voice to tell her that.\\n\\n Even in her lightheaded state, she was frightened. She\u0027d seen the savagery of teeth and claws close up.\\n\\n And the part of her that was Hana of the Three Rivers had a gut-deep fear of wild animals that the\\n\\n civilized Hannah Snow could never begin to approach.\\n\\n She gripped her stick in a clammy palm and kept walking grimly.\\n\\n The howl sounded again, so close that Hannah jumped inside her skin. Her eyes darted, trying to pick\\n\\n objects out in the darkness. She felt as if she could see better than usual at night-could the vampire blood\\n\\n have done that? But even with her new vision, she couldn\u0027t spot anything moving. The world around her\\n\\n was deserted and eerily quiet.\\n\\n And the stars were very far away. They blazed in the sky with a cold blue light as if to show how distant\\n\\n they were from human affairs.\\n\\n I could die here and they\u0027d go right on shining, Hannah thought. She felt very small and very\\n\\n unimportant-and very alone.\\n\\n And then she heard a breath drawn behind her.\\n\\n Funny. The wolf howls had been so loud, and this was so soft... and yet it was much more terrifying. It\\n\\n was close-intimate. A personal sound that told her she definitely wasn\u0027t alone.\\n\\n Hannah whirled with her stick held ready. Her skin was crawling and she could feel a wash of acid from\\n\\n her stomach, but she meant to fight for her life. She was at one with the cool wind voice; her heart was\\n\\n dark and cold and steely.\\n\\n A tall figure was standing there. Starlight reflected off pale blond hair.\\n\\n Thierry.\\n\\n Hannah leveled her stick.\\n\\n \"What\u0027s the matter? Come back for more?\" she said, and she was pleased to find her voice steady.\\n\\n Husky, but steady. She waved her stick at him to show what kind of \"more\" she meant.\\n\\n \"Are you all right?\" Thierry said.\\n\\n He looked-different from the last time she\u0027d seen him. His expression was different. His dark eyes\\n\\n seemed pensive again, the sort of expression a star might have if it cared about anything that was going\\n\\n on underneath it. Infinitely remote, but infinitely sad, too.\\n\\n \"Why should you care?\" A wave of dizziness went through her. She fought it off-and saw that he was\\n\\n stepping toward her, hand reaching out. She whipped the stick up to the exact level of his hand, an inch\\n\\n from his palm. She was impressed with herself for how fast she did it. Her body was moving the way it\\n\\n had with the werewolves, instinctively and smoothly.\\n\\n I suppose I had a life as a warrior, she mused. I think that\u0027s where the cool wind voice comes from, just\\n\\n the way the crystal voice comes from Hana of the Three Rivers.\\n\\n \"I do care,\" Thierry said. His voice said he didn\u0027t expect her to believe it.\\n\\n Hannah laughed. The combination of her dizziness and her body instinct was having an odd effect. She\\n\\n felt brashly, stupidly overconfident. Maybe this is what drunk feels like, she thought, her mind wandering\\n\\n again. \"Hannah-\"\\n\\n Hannah made the stick whistle in the air, stopping him from coming any closer to her. \"Are you crazy?\"\\n\\n she said. There were tears in her eyes. \"Do you think that you can just attack me and then come back\\n\\n and say I\u0027m sorry\u0027 and it\u0027s all going to be okay? Well, it isn\u0027t. If there was ever anything between us, it\u0027s all\\n\\n over now. There is no second chance.\"\\n\\n She could see his face tense. A muscle twitched in ~ his tight jaw. But the strangest thing was that she\\n\\n could have sworn he had tears in his eyes, too.\\n\\n It infuriated her. How dare he pretend to be hurt by her, after what he\u0027d done?\\n\\n \"I hate you.\" She spat the words with a force that startled even her. \"I don\u0027t need you. I don\u0027t want\\n\\n you. And I\u0027m telling you for the third time, keep the hell away from me.\"\\n\\n He had opened his mouth as if he were about to say something, but when she got to \u0027I don\u0027t need, you,\u0027\\n\\n he suddenly shut it. When she finished, he looked away, across the shortgrass prairie.\\n\\n \"And maybe that\u0027s best,\" he said almost inaudibly.\\n\\n \"For you to keep away?\"\\n\\n \"For you to hate me.\" He looked at her again. Hannah had never seen eyes like that before. They were\\n\\n impossibly distant and shattered and still... like the peace after a war that killed everyone.\\n\\n \"Hannah, I came to tell you that I am going away,\" he went on. His voice was like his eyes, bloodless\\n\\n and quenched. \"I\u0027m going home. I won\u0027t bother you again. And you\u0027re right; you don\u0027t need me. You can\\n\\n live a long and happy life without me.\"\\n\\n If he expected her to be impressed, she wasn\u0027t. She wouldn\u0027t believe words from him anymore.\\n\\n \"There\u0027s just one thing.\" He hesitated. \"Before I go, would you let me look at you? At your neck. I want\\n\\n to make sure that\"-another fleeting hesitation-\"that I didn\u0027t hurt you when I attacked you.\"\\n\\n Hannah laughed again, a short, sharp bark of a laugh. \"How stupid do you think I am? I mean, really.\"\\n\\n She laughed again and heard an edge of hysteria in it. \"If you want to do something for me, you can turn\\n\\n around and go. Go away forever.\"\\n\\n \"I will.\" There was so much strain on his face. \"I promise. I\u0027m just worried about you getting indoors\\n\\n before you faint.\"\\n\\n \"I can take care of myself. I don\u0027t need any help from you.\" Hannah was feeling dizzier by the minute, but\\n\\n she tried not to let it show. \"If you would just leave, I\u0027ll be fine.\"\\n\\n In fact, she knew she wasn\u0027t going to be fine. The gray spots were swarming in front of her eyes again.\\n\\n She was going to pass out soon.\\n\\n Then I\u0027d better start for Chess\u0027s, she thought. It was insanity to turn her back on him, but it was worse\\n\\n insanity to stand here until she collapsed at his feet.\\n\\n \"I\u0027m leaving now,\" she said, trying to sound clear and precise and unlike someone who was about to fall\\n\\n over unconscious. \"And I don\u0027t want you to follow me.\"\\n\\n She turned and started walking.\\n\\n I will not faint, I will not faint, she told herself grimly. She swung her stick and tried to take deep breaths\\n\\n of the cool night air. But tufts of grass seemed to be trying to trip her up with every step and the entire\\n\\n landscape seemed to rock every time she looked up.\\n\\n I ... will... not... faint. She knew her life depended on it. The ground seemed rubbery now, as if her\\n\\n feet were sinking into it and then rebounding. And where was the light that marked Chess\u0027s house? It had\\n\\n somehow gotten over to the right of her. She corrected her course and stumbled on.\\n\\n I will not faint....\\n\\n And then her legs simply melted. She didn\u0027t have legs. The rest of her fell slowly toward the ground.\\n\\n Hannah managed to break her fall with her arms. Then everything was still and dark.\\n\\n She didn\u0027t go out completely. She was floating in darkness, feeling woozy even though she was lying\\n\\n down, when she sensed someone beside her.\\n\\n No, she thought. Get the stick. He\u0027ll bite you; he\u0027ll kill you.\\n\\n But she couldn\u0027t move. Her hand wouldn\u0027t obey her.\\n\\n She felt a gentle hand brush her hair off her face.\\n\\n No ...\\n\\n Then a touch on her neck. But it was only gentle fingers, running lightly over the skin where she\u0027d been\\n\\n bitten tonight. They felt like a doctor\u0027s fingers, exploring to diagnose. She heard a sigh that sounded like\\n\\n relief, and then the fingers trailed away.\\n\\n \"You\u0027ll be all right.\" Thierry\u0027s voice came to her softly. She realized he didn\u0027t think she could hear him.\\n\\n He thought she was unconscious. \"As long as you stay away from vampires for the next week.\"\\n\\n Was that a threat? Hannah didn\u0027t understand. She braced herself for the piercing pain of teeth.\\n\\n Then she felt him touch her again, just his fingertips brushing her face. The touch was so immeasurably\\n\\n gentle. So tender.\\n\\n No, Hannah thought. She wanted to move, to kick him away. But she couldn\u0027t.\\n\\n And those delicate fingers were moving on, tracing her features one by one. With the lightest of touches\\n\\n that sent helpless chills through her.\\n\\n I hate you, Hannah thought.\\n\\n The touch followed the curve of her eyebrow, trailed down her cheek to her birthmark. Hannah shivered\\n\\n inwardly. It sketched the line of her jaw, then moved to her lips.\\n\\n The skin was so sensitive here. Thierry\u0027s fingers traced the outline of her lips, the join between upper and\\n\\n lower. The chills became a fluttering inside Hannah. Her heart swelled with love and longing.\\n\\n I won\u0027t feel this way. I hate you. ...\\n\\n But a voice was whispering in her mind, a voice she hadn\u0027t heard in what seemed like a long time. A\\n\\n crystal voice, soft but ringing.\\n\\n Feel him. Does this feel like that other one? Sense him. Does he smell the same, sound the same... ?\\n\\n Hannah didn\u0027t know what to make of the words and didn\u0027t want to. She just wanted Thierry to stop.\\n\\n The fingers brushed over her eyelashes, thumb stroking over the fragile skin of her eyelids as if to keep\\n\\n them shut. Then she felt him bend closer.\\n\\n No, no, no....\\n\\n Warm lips touched her forehead. Again, just the barest touch. Then they were gone.\\n\\n \"Goodbye, Hannah,\" Thierry whispered.\\n\\n Hannah felt herself lifted. She was being carried in strong gentle arms, moving swiftly and smoothly.\\n\\n It was harder for her to stay conscious than it had been before. She had a strange feeling of tranquillity,\\n\\n of security. But she fought to open her eyes just a crack.\\n\\n She wanted to see his hands. She didn\u0027t think there had been enough time for the pencil wound to heal\\n\\n completely.\\n\\n If the pencil wound was there.\\n\\n But her eyes wouldn\u0027t open-not until she felt herself being lowered and placed on solid ground. Then she\\n\\n managed to lift heavy eyelids and dart a glance at his hands.\\n\\n There were no marks.\\n\\n The knowledge burned through her-but she didn\u0027t have any strength left. She felt her eyes lapsing shut\\n\\n again. Dimly, very far away, she could hear the faint echo of a doorbell.\\n\\n Then a soft voice in her head. You don\u0027t have to be afraid anymore. I\u0027m going away-and so is she.\\n\\n Don\u0027t go. Wait. I have to talk to you. I have to ask you ...\\n\\n But she could feel cold air all around her and she knew he was gone.\\n\\n A moment later she heard the door open, and the sound of Chess\u0027s mother gasping. She was on the\\n\\n Clovises\u0027 doorstep. People were shaking her, talking to her.\\n\\n Hannah wasn\u0027t interested in any of it. She let the darkness take her.\\n\\n It was when she let go completely that she began to dream. She was Hana of the Three Rivers and she\\n\\n was seeing the end of her own life.\\n\\n She saw the bruised and bloody figure of Thierry rising up to kill his torturers. She felt it as her turn\\n\\n came. She looked up and saw his savage face, saw the animal light in his eyes. She felt her life flow\\n\\n Then she saw the end of the story. The glimpse of the corridor through time, the recognition of her\\n\\n soulmate. The forgiveness and the promise.\\n\\n And then just shadows. But Hannah slept peacefully in the shadows until morning, unafraid.\\n\\n The first thing Hannah saw when she woke up was a pair of glowing green cat-eyes looking down at\\n\\n her.\\n\\n \"How do you feel?\" Chess asked.\\n\\n She was lying in Chess\u0027s bed. Sunlight was streaming in the window.\\n\\n \"I ... can\u0027t tell yet,\" Hannah said. Disjointed images were floating in her head, not quite forming a whole\\n\\n picture.\\n\\n \"We found you last night,\" Chess said. \"You ran your dad\u0027s car off the road, but you managed to make it\\n\\n here before you collapsed.\"\\n\\n \"Oh... yeah. I remember.\" She did remember; the pieces of the puzzle suddenly clicked together.\\n\\n Maya. Thierry. The attack. The car. Thierry again. And finally her dream. Her own voice saying, \"I\\n\\n forgive you.\"\\n\\n And now he was gone. He\u0027d gone home, wherever home was.\\n\\n She had never felt so confused.\\n\\n \"Hannah, what happened? Are you sick? We didn\u0027t know whether to take you to a hospital last night or\\n\\n what. But you didn\u0027t have a fever and you seemed to be breathing fine-so my mom said you could just\\n\\n sleep a while.\"\\n\\n \"I\u0027m not sick.\" This was the time to tell Chess everything. After all, that was the reason she\u0027d been\\n\\n running to Chess in the first place last night.\\n\\n But now... now in the bright morning light, she didn\u0027t want to tell Chess. It wasn\u0027t just that it might put\\n\\n Chess in danger, either from Thierry or the Night World in general. It was that Hannah didn\u0027t need to talk\\n\\n about it; she could cope on her own. It wasn\u0027t Chess\u0027s problem.\\n\\n And I don\u0027t even know the truth yet, Hannah thought. But that is going to change.\\n\\n \"Hannah, are you even listening to me?\"\\n\\n \"Yeah. I\u0027m sorry. And I\u0027m okay; I felt kind of dizzy last night, but now I\u0027m better. Can I use your\\n\\n phone?\"\\n\\n \"Can you what?\"\\n\\n \"I have to call Paul-you know, the psychologist. I need to see him, fast.\"\\n\\n She jumped up, steadied herself against a brief wave of giddiness, and walked past Chess, who was\\n\\n watching her in bewilderment.\\n\\n \"No,\" Paul said. \"No, it\u0027s absolutely out of the question.\" He waved his hands, then patted his pockets\\n\\n nervously, coming up empty.\\n\\n \"Paul, please. I have to do this. And if you won\u0027t help me, I\u0027ll try it on my own. I think self-hypnosis\\n\\n should work. I\u0027ve been doing a pretty good job of dreaming the past lately, anyway.\"\\n\\n \"It\u0027s... too... dangerous.\" Paul said each word separately, then sank into his chair, hands at his\\n\\n temples. \"Don\u0027t you remember what happened the last time?\"\\n\\n Hannah felt sorry for him. But she said ruthlessly, \"If I do it on my own, it may be even more dangerous.\\n\\n Right? At least if you hypnotize me you can be there to wake me up. You can throw a glass of water in\\n\\n my face again.\"\\n\\n He looked up sharply. \"Oh, yeah? And what if it doesn\u0027t work this time?\"\\n\\n Hannah dropped her eyes. Then she raised them and looked at Paul directly. \"I don\u0027t know,\" she\\n\\n admitted quietly. \"But I\u0027ve still got to try. I have to know the truth. If I don\u0027t, I really think I may go\\n\\n insane.\" She didn\u0027t say it melodramatically. It was a simple statement of fact.\\n\\n Paul groaned. Then he grabbed a pen and started chewing on it, glancing around the room. \"What is it\\n\\n that you would want to know? Just presuming that I agreed to help you.\" His voice sounded squashed.\\n\\n Hannah felt a surge of relief. \"I want to know about this woman who keeps warning me,\" she said. \"Her\\n\\n name is Maya. And I want to know how I die in my other lives.\"\\n\\n \"Oh, terrific. That sounds like fun.\"\\n\\n \"I have to do it.\" She took a deep breath. She wouldn\u0027t let herself look away from him, even though she\\n\\n could feel the warmth as her eyes filled. \"Look, I know you don\u0027t understand. And I can\u0027t explain to you\\n\\n how important it is to me. But it is ... important.\"\\n\\n There was a silence, then Paul said, \"All right. All right. But only because I think it\u0027s safer for you to be\\n\\n with somebody.\"\\n\\n Hannah whispered, \"Thank you.\"\\n\\n Then she blinked and unfolded a piece of paper. \"I wrote down some questions for you to ask me.\"\\n\\n \"Great. Wonderful. I\u0027m sure you\u0027ll be getting your degree in psychology soon.\" But he took the paper.\\n\\n Hannah walked over to the couch and got herself settled. She shut her eyes, telling her muscles to relax.\\n\\n \"Okay,\" Paul said. His voice was very slightly unsteady, but Hannah could tell he was trying to make it\\n\\n soothing. \"I want you to imagine a beautiful violet light...\" \\n\\n","sourceLink":"https://allnovel.net/night-world-soulmate-night-world-6/page-11.html","bookId":2080,"book":{"id":2080,"title":"Night World : Soulmate (Night World #6)","description":"Storyline: Soulmate (Night World Book 6) \\n Hannah Snow\u0027s life was perfect...until the notes started appearing. Notes in her own handwriting, warning her: Dead before Seventeen. Then she starts having visions of another time, another life. And of a stranger who tore her world apart. Now the stranger, Thierry, Lord of the Night World, is back. Convinced Hannah is his soulmate, he has searched for her throughout the years, waiting for her to be reborn. But if Hannah’s destiny is death, can even Thierry\u0027s love protect her?\\n","cover":"https://allnovel.net/images/night-world-soulmate-night-world-6.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-world-soulmate-night-world-6.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:30:54 PM"}}
