{"id":107383,"no":33,"title":"Page 33","content":"Bond impatiently snapped his fingers for the waiter. Poor darling. She must be dead beat. Why hadn\u0027t he thought of the strain she was going through? He cursed himself for his selfishness. Thank heavens for Nash. Efficient sort of chap, for all his uncouthness.\n Bond paid the bill. He took up the heavy little bag and walked as quickly as he could down the crowded train.\n He tapped softly on the door of No. 7. Nash opened the door. He came out with his finger on his lips. He closed the door behind him. \u0027Threw a bit of a faint,\u0027 he said. \u0027She\u0027s all right now. The beds were made up. She\u0027s gone to sleep in the top one. Been a bit much for the girl I expect, old man.\u0027\n Bond nodded briefly. He went into the compartment. A hand hung palely down from under the sable coat. Bond stood on the bottom bunk and gently tucked the hand under the corner of the coat. The hand felt very cold. The girl made no sound.\n Bond stepped softly down. Better let her sleep. He went into the corridor.\n Nash looked at him with empty eyes. \u0027Well, I suppose we\u0027d better settle in for the night. I\u0027ve got my book.\u0027 He held it up. \u0027War and Peace. Been trying to plough through it for years. You take the first sleep, old man. You look pretty flaked out yourself. I\u0027ll wake you up when I can\u0027t keep my eyes open any longer.\u0027 He gestured with his head at the door of No. 9. \u0027Hasn\u0027t shown yet. Don\u0027t suppose he will if he\u0027s up to any monkey tricks.\u0027 He paused. \u0027By the way, you got a gun, old man?\u0027\n \u0027Yes. Why, haven\u0027t you?\u0027\n Nash looked apologetic. \u0027Fraid not. Got a Luger at home, but it\u0027s too bulky for this sort of job.\u0027\n \u0027Oh, well,\u0027 said Bond reluctantly. \u0027You\u0027d better take mine. Come on in.\u0027\n They went in and Bond shut the door. He took out the Beretta and handed it over. \u0027Eight shots,\u0027 he said softly. \u0027Semi-automatic. It\u0027s on safe.\u0027\n Nash took the gun and weighed it professionally in his hand. He clicked the safe on and off.\n Bond hated someone else touching his gun. He felt naked without it. He said gruffly, \u0027Bit on the light side, but it\u0027ll kill if you put the bullets in the right places.\u0027\n Nash nodded. He sat down near the window at the end of the bottom bunk. \u0027I\u0027ll take this end,\u0027 he whispered. \u0027Good field of fire.\u0027 He put his book down on his lap and settled himself.\n Bond took off his coat and tie and laid them on the bunk beside him. He leant back against the pillows and propped his feet on the bag with the Spektor that stood on the floor beside his attaché case. He picked up his Ambler and found his place and tried to read. After a few pages he found that his concentration was going. He was too tired. He laid the book down on his lap and closed his eyes. Could he afford to sleep? Was there any other precaution they could take?\n The wedges! Bond felt for them in the pocket of his coat. He slipped off the bunk and knelt and forced them hard under the two doors. Then he settled himself again and switched off the reading light behind his head.\n The violet eye of the nightlight shone softly down.\n \u0027Thanks, old man,\u0027 said Captain Nash softly.\n The train gave a moan and crashed into a tunnel.\n Chapter Twenty-Six\n The Killing Bottle\n The light nudge at his ankle woke Bond. He didn\u0027t move. His senses came to life like an animal\u0027s.\n Nothing had changed. There were the noises of the train–the soft iron stride, pounding out the kilometres, the quiet creak of the woodwork, a tinkle from the cupboard over the washbasin where a toothglass was loose in its holder.\n What had woken him? The spectral eye of the nightlight cast its deep velvet sheen over the little room. No sound came from the upper bunk. By the window, Captain Nash sat in his place, his book open on his lap, a flicker of moonlight from the edge of the blind showing white on the double page.\n He was looking fixedly at Bond. Bond registered the intentness of the violet eyes. The black lips parted. There was a glint of teeth.\n \u0027Sorry to disturb you, old man. I feel in the mood for a talk!\u0027\n What was there new in the voice? Bond put his feet softly down to the floor. He sat up straighter. Danger, like a third man, was standing in the room.\n \u0027Fine,\u0027 said Bond easily. What had there been in those few words that had set his spine tingling? Was it the note of authority in Nash\u0027s voice? The idea came to Bond that Nash might have gone mad. Perhaps it was madness in the room, and not danger, that Bond could smell. His instincts about this man had been right. It would be a question of somehow getting rid of him at the next station. Where had they got to? When would the frontier come?\n Bond lifted his wrist to look at the time. The violet light defeated the phosphorus numerals. Bond tilted the face towards the strip of moonlight from the window.\n From the direction of Nash there came a sharp click. Bond felt a violent blow on his wrist. Splinters of glass hit him in the face. His arm was flung back against the door. He wondered if his wrist had been broken. He let his arm hang and flexed his fingers. They all moved.\n The book was still open on Nash\u0027s lap, but now a thin wisp of smoke was coming out of the hole at the top of its spine and there was a faint smell of fireworks in the room.\n The saliva dried in Bond\u0027s mouth as if he had swallowed alum.\n So there had been a trap all along. And the trap had closed. Captain Nash had been sent to him by Moscow. Not by M. And the M.G.B. agent in No. 9, the man with an American passport, was a myth. And Bond had given Nash his gun. He had even put wedges under the door so that Nash would feel more secure.\n Bond shivered. Not with fear. With disgust.\n Nash spoke. His. voice was no longer a whisper, no longer oily. It was loud and confident.\n \u0027That will save us a great deal of argument, old man. Just a little demonstration. They think I\u0027m pretty good with this little bag of tricks. There are ten bullets in it–.25 dum-dum, fired by an electric battery. You must admit the Russians are wonderful chaps for dreaming these things up. Too bad that book of yours is only for reading, old man.\u0027\n \u0027For God\u0027s sake stop calling me \u0027\u0027old man\u0027\u0027.\u0027 When there was so much to know, so much to think about, this was Bond\u0027s first reaction to utter catastrophe. It was the reaction of someone in a burning house who picks up the most trivial object to save from the flames.\n \u0027Sorry, old man. It\u0027s got to be a habit. Part of trying to be a bloody gentleman. Like these clothes. All from the wardrobe department. They said I\u0027d get by like this. And I did, didn\u0027t I, old man? But let\u0027s get down to business. I expect you\u0027d like to know what this is all about. Be glad to tell you. We\u0027ve got about half an hour before you\u0027re due to go. It\u0027ll give me an extra kick telling the famous Mister Bond of the Secret Service what a bloody fool he is. You see, old man, you\u0027re not so good as you think. You\u0027re just a stuffed dummy and I\u0027ve been given the job of letting the sawdust out of you.\u0027 The voice was even and flat, the sentences trailing away on a dead note. It was as if Nash was bored by the act of speaking.\n \u0027Yes,\u0027 said Bond. \u0027I\u0027d like to know what it\u0027s all about. I can spare you half an hour.\u0027 Desperately he wondered: was there any way of putting this man off his stride? Upsetting his balance?\n \u0027Don\u0027t kid yourself, old man,\u0027 the voice was uninterested in Bond, or in the threat of Bond. Bond didn\u0027t exist except as a target. \u0027You\u0027re going to die in half an hour. No mistake about it. I\u0027ve never made a mistake or I wouldn\u0027t have my job.\u0027\n \u0027What is your job?\u0027\n \u0027Chief Executioner of SMERSH.\u0027 There was a hint of life in the voice, a hint of pride. The voice went flat again. \u0027You know the name I believe, old man.\u0027\n SMERSH. So that was the answer–the worst answer of all. And this was their chief killer. Bond remembered the red glare that flickered in the opaque eyes. A killer. A psychopath–manic depressive, probably. A man who really enjoyed it. What a useful man for SMERSH to have found! Bond suddenly remembered what Vavra had said. He tried a long shot. \u0027Does the moon have any effect on you, Nash?\u0027\n The black lips writhed. \u0027Clever aren\u0027t you, Mister Secret Service. Think I\u0027m barmy. Don\u0027t worry. I wouldn\u0027t be where I am if I was barmy.\u0027\n The angry sneer in the man\u0027s voice told Bond that he had touched a nerve. But what could he achieve by getting the man out of control? Better humour him and gain some time. Perhaps Tatiana. . . .\n \u0027Where does the girl come into all this?\u0027\n \u0027Part of the bait,\u0027 the voice was bored again. \u0027Don\u0027t worry. She won\u0027t butt in on our talk. Fed her a pinch of chloral hydrate when I poured her that glass of wine. She\u0027ll be out for the night. And then for every other night. She\u0027s to go with you.\u0027\n \u0027Oh really.\u0027 Bond slowly lifted his aching hand on to his lap, flexing the ringers to get the blood moving. \u0027Well, let\u0027s hear the story.\u0027\n \u0027Careful, old man. No tricks. No Bulldog Drummond stufFll get you out of this one. If I don\u0027t like even the smell of a move, it\u0027ll be just one bullet through the heart. Nothing more. That\u0027s what you\u0027ll be getting in the end. One through the centre of the heart. If you move it\u0027ll come a bit quicker. And don\u0027t forget who I am. Remember your wrist watch? I don\u0027t miss. Not ever.\u0027\n \u0027Good show,\u0027 said Bend carelessly. \u0027But don\u0027t be frightened. You\u0027ve got my gun. Remember? Get on with your story.\u0027\n \u0027All right, old man, only don\u0027t scratch your ear while I\u0027m talking. Or I\u0027ll shoot it off. See? Well, SMERSH decided to kill you–at least I gather it was decided even higher up, right at the top. Seems they want to take one good hard poke at the Secret Service–bring them down a peg or two. Follow me?\u0027\n \u0027Why choose me?\u0027\n \u0027Don\u0027t ask me, old man. But they say you\u0027ve got quite a reputation in your outfit. The way you\u0027re going to be killed is going to bust up the whole show. It\u0027s been three months cooking, this plan, and it\u0027s a beaut. Got to be. SMERSH has made one or two mistakes lately. That Khoklov business for one. Remember the explosive cigarette case and all that? Gave the job to the wrong man. Should have given it to me. I wouldn\u0027t have gone over to the Yanks. However, to get back. You see, old man, we\u0027ve got quite a planner in SMERSH. Man called Kronsteen. Great chess player. He said vanity would get you and greed and a bit of craziness in the plot. He said you\u0027d all fall for the craziness in London. And you did, didn\u0027t you, old man?\u0027\n Had they? Bond remembered just how much the eccentric angles of the story had aroused their curiosity. And vanity? Yes, he had to admit that the idea of this Russian girl being in love with him had helped. And there had been the Spektor. That had decided the whole thing–plain greed for it. He said non-committally: \u0027We were interested.\u0027\n \u0027Then came the operation. Our Head of Operations is quite a character. I\u0027d say she\u0027s killed more people than anyone in the world–or arranged for them to be killed. Yes, it\u0027s a woman. Name of Klebb–Rosa Klebb. Real swine of a woman. But she certainly knows all the tricks.\u0027\n Rosa Klebb. So at the top of SMERSH there was a woman! If he could somehow survive this and get after her! The fingers of Bond\u0027s right hand curled softly.\n The flat voice in the corner went on: \u0027Well, she found this Romanova girl. Trained her for the job. By the way, how was she in bed? Pretty good?\u0027\n No! Bond didn\u0027t believe it. That first night must have been staged. But afterwards? No. Afterwards had been real. He took the opportunity to shrug his shoulders. It was an exaggerated shrug. To get the man accustomed to movement.\n \u0027Oh, well. Not interested in that sort of thing myself. But they got some nice pictures of you two.\u0027 Nash tapped his coat pocket. \u0027Whole reel of 16 millimetre. That\u0027s going into her handbag. It\u0027ll look fine in the papers.\u0027 Nash laughed–a harsh, metallic laugh. \u0027They\u0027ll have to cut some of the juiciest bits, of course.\u0027 \n","sourceLink":"https://allnovel.net/from-russia-with-love-james-bond-5/page-33.html","bookId":1548,"book":{"id":1548,"title":"From Russia With Love (James Bond #5)","description":"Storyline: \n From Russia With Love (James Bond (Original Series) #5) \n Every major foreign government organization has a file on British secret agent James Bond. Now, Russia\u0027s lethal SMERSH organization has targeted him for elimination. SMERSH has the perfect bait in the irresistible Tatiana Romanova, who lures 007 to Istanbul promising the top-secret Spektor cipher machine. But when Bond walks willingly into the trap, a game of cross and double-cross ensues, with Bond both the stakes and the prize.\n \n","cover":"https://allnovel.net/images/from-russia-with-love-james-bond-5.jpg","author":"Ian Fleming","type":"Adventure","source":"allnovel","link":"https://allnovel.net/from-russia-with-love-james-bond-5.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 11:05:53 PM"}}
