{"id":24569,"no":18,"title":"Chapter 19 The Stairs of Cirith Ungol","content":"Gollum was tugging at Frodo\u0027s cloak and hissing with fear and impatience. \u0027We must go,\u0027 he said. \u0027We mustn\u0027t stand here. Make haste!\u0027 Reluctantly Frodo turned his back on the West and followed as his guide led him, out into the darkness of the East. They left the ring of trees and crept along the road towards the mountains. This road, too, ran straight for a while, but soon it began to bend away southwards, until it came right under the great shoulder of rock that they had seen from the distance. Black and forbidding it loomed above them, darker than the dark sky behind. Crawling under its shadow the road went on, and rounding it sprang east again and began to climb steeply. Frodo and Sam were plodding along with heavy hearts, no longer able to care greatly about their peril. Frodo\u0027s head was bowed; his burden was dragging him down again. As soon as the great Cross-roads had been passed, the weight of it, almost forgotten in Ithilien, had begun to grow once more. Now, feeling the way become steep before his feet, he looked wearily up; and then he saw it, even as Gollum had said that he would: the city of the Ringwraiths. He cowered against the stony bank. A long-tilted valley, a deep gulf of shadow, ran back far into the mountains. Upon the further side, some way within the valley\u0027s arms high on a rocky seat upon the black knees of the Ephel D產th, stood the walls and tower of Minas Morgul. All was dark about it, earth and sky, but it was lit with light. Not the imprisoned moonlight welling through the marble walls of Minas Ithil long ago, Tower of the Moon, fair and radiant in the hollow of the hills. Paler indeed than the moon ailing in some slow eclipse was the light of it now, wavering and blowing like a noisome exhalation of decay, a corpse-light, a light that illuminated nothing. In the walls and tower windows showed, like countless black holes looking inward into emptiness; but the topmost course of the tower revolved slowly, first one way and then another, a huge ghostly head leering into the night. For a moment the three companions stood there, shrinking, staring up with unwilling eyes. Gollum was the first to recover. Again he pulled at their cloaks urgently, but he spoke no word. Almost he dragged them forward. Every step was reluctant, and time seemed to slow its pace. so that between the raising of a foot and the setting of it down minutes of loathing passed. So they came slowly to the white bridge. Here the road, gleaming faintly, passed over the stream in the midst of the valley, and went on, winding deviously up towards the city\u0027s gate: a black mouth opening in the outer circle of the northward walls. Wide flats lay on either bank, shadowy meads filled with pale white flowers. Luminous these were too, beautiful and yet horrible of shape, like the demented forms in an uneasy dream; and they gave forth a faint sickening charnel-smell; an odour of rottenness filled the air. From mead to mead the bridge sprang. Figures stood there at its head, carven with cunning in forms human and bestial, but all corrupt and loathsome. The water flowing beneath was silent, and it steamed, but the vapour that rose from it, curling and twisting about the bridge, was deadly cold. Frodo felt his senses reeling and his mind darkening. Then suddenly, as if some force were at work other than his own will, he began to hurry, tottering forward, his groping hands held out, his head lolling from side to side. Both Sam and Gollum ran after him. Sam caught his master in his arms, as he stumbled and almost fell, right on the threshold of the bridge. \u0027Not that way! No, not that way! \u0027 whispered Gollum, but the breath between his teeth seemed to tear the heavy stillness like a whistle, and he cowered to the ground in terror. \u0027Hold up, Mr. Frodo! \u0027 muttered Sam in Frodo\u0027s ear. \u0027Come back! Not that way. Gollum says not, and for once I agree with him.\u0027 Frodo passed his hand over his brow and wrenched his eyes away from the city on the hill. The luminous tower fascinated him, and he fought the desire that was on him to run up the gleaming road towards its gate. At last with an effort he turned back, and as he did so, he felt the Ring resisting him, dragging at the chain about his neck; and his eyes too, as he looked away, seemed for the moment to have been blinded. The darkness before him was impenetrable. Gollum, crawling on the ground like a frightened animal, was already vanishing into the gloom. Sam, supporting and guiding his stumbling master, followed after him as quickly as he could. Not far from the near bank of the stream there was a gap in the stone-wall beside the road. Through this they passed, and Sam saw that they were on a narrow path that gleamed faintly at first, as the main road did, until climbing above the meads of deadly flowers it faded and went dark, winding its crooked way up into the northern sides of the valley. Along this path the hobbits trudged, side by side, unable to see Gollum in front of them, except when he turned back to beckon them on. Then his eyes shone with a green-white light, reflecting the noisome Morgul-sheen perhaps, or kindled by some answering mood within. Of that deadly gleam and of the dark eyeholes Frodo and Sam were always conscious, ever glancing fearfully over their shoulders, and ever dragging their eyes back to find the darkening path. Slowly they laboured on. As they rose above the stench and vapours of the poisonous stream their breath became easier and their heads clearer; but now their limbs were deadly tired, as if they had walked all night under a burden, or had been swimming long against a heavy tide of water. At last they could go no further without a halt. Frodo stopped and sat down on a stone. They had now climbed up to the top of a great hump of bare rock. Ahead of them there was a bay in the valley-side, and round the head of this the path went on, no more than a wide ledge with a chasm on the right; across the sheer southward face of the mountain it crawled upwards, until it disappeared into the blackness above. \u0027I must rest a while, Sam,\u0027 whispered Frodo. \u0027It\u0027s heavy on me, Sam lad, very heavy. I wonder how far I can carry it? Anyway I must rest before we venture on to that.\u0027 He pointed to the narrow way ahead. \u0027Sssh! ssh! \u0027 hissed Gollum hurrying back to them. \u0027Sssh! \u0027 His fingers were on his lips and he shook his head urgently. Tugging at Frodo\u0027s sleeve, he pointed towards the path; but Frodo would not move. \u0027Not yet,\u0027 he said, \u0027not yet.\u0027 Weariness and more than weariness oppressed him; it seemed as if a heavy spell was laid on his mind and body. \u0027I must rest,\u0027 he muttered. At this Gollum\u0027s fear and agitation became so great that he spoke again, hissing behind his hand, as if to keep the sound from unseen listeners in the air. \u0027Not here, no. Not rest here. Fools! Eyes can see us. When they come to the bridge they will see us. Come away! Climb, climb! Come! \u0027 \u0027Come, Mr. Frodo,\u0027 said Sam. \u0027He\u0027s right, again. We can\u0027t stay here.\u0027 \u0027All right,\u0027 said Frodo in a remote voice, as of one speaking half asleep. \u0027I will try.\u0027 Wearily he got to his feet. But it was too late. At that moment the rock quivered and trembled beneath them. The great rumbling noise, louder than ever before, rolled in the ground and echoed in the mountains. Then with searing suddenness there came a great red flash. Far beyond the eastern mountains it leapt into the sky and splashed the lowering clouds with crimson. In that valley of shadow and cold deathly light it seemed unbearably violent and fierce. Peaks of stone and ridges like notched knives sprang out in staring black against the uprushing flame in Gorgoroth. Then came a great crack of thunder. And Minas Morgul answered. There was a flare of livid lightnings: forks of blue flame springing up from the tower and from the encircling hills into the sullen clouds. The earth groaned; and out of the city there came a cry. Mingled with harsh high voices as of birds of prey, and the shrill neighing of horses wild with rage and fear, there came a rending screech, shivering, rising swiftly to a piercing pitch beyond the range of hearing. The hobbits wheeled round towards it, and cast themselves down, holding their hands upon their ears. As the terrible cry ended, falling back through a long sickening wail to silence, Frodo slowly raised his head. Across the narrow valley, now almost on a level with his eyes, the walls of the evil city stood, and its cavernous gate, shaped like an open mouth with gleaming teeth, was gaping wide. And out of the gate an army came. All that host was clad in sable, dark as the night. Against the wan walls and the luminous pavement of the road Frodo could see them, small black figures in rank upon rank, marching swiftly and silently, passing outwards in an endless stream. Before them went a great cavalry of horsemen moving like ordered shadows, and at their head was one greater than all the rest: a Rider, all black, save that on his hooded head he had a helm like a crown that flickered with a perilous light. Now he was drawing near the bridge below, and Frodo\u0027s staring eyes followed him, unable to wink or to withdraw. Surely there was the Lord of the Nine Riders returned to earth to lead his ghastly host to battle? Here, yes here indeed was the haggard king whose cold hand had smitten down the Ring-bearer with his deadly knife. The old wound throbbed with pain and a great chill spread towards Frodo\u0027s heart. Even as these thoughts pierced him with dread and held him bound as with a spell, the Rider halted suddenly, right before the entrance of the bridge, and behind him all the host stood still. There was a pause, a dead silence. Maybe it was the Ring that called to the Wraith-lord, and for a moment he was troubled, sensing some other power within his valley. This way and that turned the dark head helmed and crowned with fear, sweeping the shadows with its unseen eyes. Frodo waited, like a bird at the approach of a snake, unable to move. And as he waited, he felt, more urgent than ever before, the command that he should put on the Ring. But great as the pressure was, he felt no inclination now to yield to it. He knew that the Ring would only betray him, and that he had not, even if he put it on, the power to face the Morgul-king-not yet. There was no longer any answer to that command in his own will, dismayed by terror though it was, and he felt only the beating upon him of a great power from outside. It took his hand, and as Frodo watched with his mind, not willing it but in suspense (as if he looked on some old story far away), it moved the hand inch by inch towards the chain upon his neck. Then his own will stirred; slowly it forced the hand back. and set it to find another thing, a thing lying hidden near his breast. Cold and hard it seemed as his grip closed on it: the phial of Galadriel, so long treasured, and almost forgotten till that hour. As he touched it, for a while all thought of the Ring was banished from his mind. He sighed and bent his head. At that moment the Wraith-king turned and spurred his horse and rode across the bridge, and all his dark host followed him. Maybe the elven-hoods defied his unseen eyes, and the mind of his small enemy; being strengthened, had turned aside his thought. But he was in haste. Already the hour had struck, and at his great Master\u0027s bidding he must march with war into the West. Soon he had passed, like a shadow into shadow, down the winding road, and behind him still the black ranks crossed the bridge. So great an army had never issued from that vale since the days of Isildur\u0027s might; no host so fell and strong in arms had yet assailed the fords of Anduin; and yet it was but one and not the greatest of the hosts that Mordor now sent forth. Frodo stirred. And suddenly his heart went out to Faramir. \u0027The storm has burst at last,\u0027 he thought. \u0027This great array of spears and swords is going to Osgiliath. Will Faramir get across in time? He guessed it, but did he know the hour? And who can now hold the fords when the King of the Nine Riders comes? And other armies will come. I am too late. All is lost. I tarried on the way. All is lost. Even if my errand is performed, no one will ever know. There will be no one I can tell. It will be in vain.\u0027 Overcome with weakness he wept. And still the host of Morgul crossed the bridge. Then at a great distance, as if it came out of memories of the Shire, some sunlit early morning, when the day called and doors were opening, he heard Sam\u0027s voice speaking. \u0027Wake up, Mr. Frodo! Wake up! \u0027 Had the voice added: \u0027Your breakfast is ready,\u0027 he would hardly have been surprised. Certainly Sam was urgent. \u0027Wake up, Mr. Frodo! They\u0027re gone,\u0027 he said. There was a dull clang. The gates of Minas Morgul had closed. The last rank of spears had vanished down the road. The tower still grinned across the valley, but the light was fading in it. The whole city was falling back into a dark brooding shade, and silence. Yet still it was filled with watchfulness. \u0027Wake up, Mr. Frodo! They\u0027re gone, and we\u0027d better go too. There\u0027s something still alive in that place, something with eyes, or a seeing mind, if you take me; and the longer we stay in one spot, the sooner it will get on to us. Come on, Mr. Frodo! \u0027 Frodo raised his head, and then stood up. Despair had not left him, but the weakness had passed. He even smiled grimly, feeling now as clearly as a moment before he had felt the opposite, that what he had to do, he had to do, if he could, and that whether Faramir or Aragorn or Elrond or Galadriel or Gandalf or anyone else ever knew about it was beside the purpose. He took his staff in one hand and the phial in his other. When he saw that the clear light was already welling through his fingers, he thrust it into his bosom and held it against his heart. Then turning from the city of Morgul, now no more than a grey glimmer across a dark gulf, he prepared to take the upward road. Gollum, it seemed, had crawled off along the ledge into the darkness beyond, when the gates of Minas Morgul opened, leaving the hobbits where they lay. He now came creeping back, his teeth chattering and his fingers snapping. \u0027Foolish! Silly! \u0027 he hissed. \u0027Make haste! They mustn\u0027t think danger has passed. It hasn\u0027t. Make haste! \u0027 They did not answer, but they followed him on to the climbing ledge. It was little to the liking of either of them, not even after facing so many other perils; but it did not last long. Soon the path reached a rounded angle where the mountain-side swelled out again, and there it suddenly entered a narrow opening in the rock. They had come to the first stair that Gollum had spoken of. The darkness was almost complete, and they could see nothing much beyond their hands\u0027 stretch; but Gollum\u0027s eyes shone pale, several feet above, as he turned back towards them. \u0027Careful! \u0027 he whispered. \u0027Steps. Lots of steps. Must be careful! \u0027 Care was certainly needed. Frodo and Sam at first felt easier, having now a wall on either side, but the stairway was almost as steep as a ladder, and as they climbed up and up, they became more and more aware of the long black fall behind them. And the steps were narrow, spaced unevenly, and often treacherous: they were worn and smooth at the edges, and some were broken, and some cracked as foot was set upon them. The hobbits struggled on, until at last they were clinging with desperate fingers to the steps ahead, and forcing their aching knees to bend and straighten; and ever as the stair cut its way deeper into the sheer mountain the rocky walls rose higher and higher above their heads. At length, just as they felt that they could endure no more, they saw Gollum\u0027s eyes peering down at them again. \u0027We\u0027re up,\u0027 he whispered. \u0027First stair\u0027s past. Clever hobbits to climb so high, very clever hobbits. Just a few more little steps and that\u0027s all, yes.\u0027 Dizzy and very tired Sam, and Frodo following him, crawled up the last step, and sat down rubbing their legs and knees. They were in a deep dark passage that seemed still to go up before them, though at a gentler slope and without steps. Gollum did not let them rest long. \u0027There\u0027s another stair still,\u0027 he said. \u0027Much longer stair. Rest when we get to the top of next stair. Not yet.\u0027 Sam groaned. \u0027Longer, did you say? \u0027 he asked. \u0027Yes, yess, longer,\u0027 said Gollum. \u0027But not so difficult. Hobbits have climbed the Straight Stair. Next comes the Winding Stair.\u0027 \u0027And what after that? \u0027 said Sam. \u0027We shall see,\u0027 said Gollum softly. \u0027O yes, we shall see! \u0027 \u0027I thought you said there was a tunnel,\u0027 said Sam. \u0027Isn\u0027t there a tunnel or something to go through? \u0027 \u0027O yes, there\u0027s a tunnel,\u0027 said Gollum. \u0027But hobbits can rest before they try that. If they get through that, they\u0027ll be nearly at the top. Very nearly, if they get through. O yes! \u0027 Frodo shivered. The climb had made him sweat, but now he felt cold and clammy, and there was a chill draught in the dark passage, blowing down from the invisible heights above. He got up and shook himself. \u0027Well, let\u0027s go on! \u0027 he said. \u0027This is no place to sit in.\u0027 The passage seemed to go on for miles, and always the chill air flowed over them, rising as they went on to a bitter wind. The mountains seemed to be trying with their deadly breath to daunt them, to turn them back from the secrets of the high places, or to blow them away into the darkness behind. They only knew that they had come to the end, when suddenly they felt no wall at their right hand. They could see very little. Great black shapeless masses and deep grey shadows loomed above them and about them, but now and again a dull red light flickered up under the lowering clouds, and for a moment they were aware of tall peaks, in front and on either side, like pillars holding up a vast sagging roof. They seemed to have climbed up many hundreds of feet, on to a wide shelf. A cliff was on their left and a chasm on their right. Gollum led the way close under the cliff. For the present they were no longer climbing, but the ground was now more broken and dangerous in the dark, and there were blocks and lumps of fallen stone in the way. Their going was slow and cautious. How many hours had passed since they had entered the Morgul Vale neither Sam nor Frodo could any longer guess. The night seemed endless. At length they were once more aware of a wall looming up, and once more a stairway opened before them. Again they halted, and again they began to climb. It was a long and weary ascent; but this stairway did not delve into the mountain-side. Here the huge cliff face sloped backwards, and the path like a snake wound to and fro across it. At one point it crawled sideways right to the edge of the dark chasm, and Frodo glancing down saw below him as a vast deep pit the great ravine at the head of the Morgul Valley. Down in its depths glimmered like a glow-worm thread the wraith-road from the dead city to the Nameless Pass. He turned hastily away. Still on and up the stairway bent and crawled, until at last with a final flight, short and straight, it climbed out again on to another level. The path had veered away from the main pass in the great ravine, and it now followed its own perilous course at the bottom of a lesser cleft among the higher regions of the Ephel D產th. Dimly the hobbits could discern tall piers and jagged pinnacles of stone on either side, between which were great crevices and fissures blacker than the night, where forgotten winters had gnawed and carved the sunless stone. And now the red light in the sky seemed stronger; though they could not tell whether a dreadful morning were indeed coming to this place of shadow, or whether they saw only the flame of some great violence of Sauron in the torment of Gorgoroth beyond. Still far ahead, and still high above, Frodo, looking up, saw, as he guessed, the very crown of this bitter road. Against the sullen redness of the eastern sky a cleft was outlined in the topmost ridge, narrow, deep-cloven between two black shoulders; and on either shoulder was a horn of stone. He paused and looked more attentively. The horn upon the left was tall and slender; and in it burned a red light, or else the red light in the land beyond was shining through a hole. He saw now: it was a black tower poised above the outer pass. He touched Sam\u0027s arm and pointed. \u0027I don\u0027t like the look of that! \u0027 said Sam. \u0027So this secret way of yours is guarded after all,\u0027 he growled, turning to Gollum. \u0027As you knew all along, I suppose? \u0027 \u0027All ways are watched, yes,\u0027 said Gollum. \u0027Of course they are. But hobbits must try some way. This may be least watched. Perhaps they\u0027ve all gone away to big battle, perhaps! \u0027 \u0027Perhaps,\u0027 grunted Sam. \u0027Well, it still seems a long way off, and a long way up before we get there. And there\u0027s still the tunnel. I think you ought to rest now, Mr. Frodo. I don\u0027t know what time of day or night it is, but we\u0027ve kept going for hours and hours.\u0027 \u0027Yes, we must rest,\u0027 said Frodo. \u0027Let us find some corner out of the wind, and gather our strength-for the last lap.\u0027 For so he felt it to be. The terrors of the land beyond, and the deed to be done there, seemed remote, too far off yet to trouble him. All his mind was bent on getting through or over this impenetrable wall and guard. If once he could do that impossible thing, then somehow the errand would be accomplished, or so it seemed to him in that dark hour of weariness, still labouring in the stony shadows under Cirith Ungol. In a dark crevice between two great piers of rock they sat down: Frodo and Sam a little way within. and Gollum crouched upon the ground near the opening. There the hobbits took what they expected would be their last meal before they went down into the Nameless Land, maybe the last meal they would ever eat together. Some of the food of Gondor they ate, and wafers of the waybread of the Elves. and they drank a little. But of their water they were sparing and took only enough to moisten their dry mouths. \u0027I wonder when we\u0027ll find water again? \u0027 said Sam. \u0027But I suppose even over there they drink? Orcs drink, don\u0027t they? \u0027 \u0027Yes, they drink,\u0027 said Frodo. \u0027But do not let us speak of that. Such drink is not for us.\u0027 \u0027Then all the more need to fill our bottles,\u0027 said Sam. \u0027But there isn\u0027t any water up here: not a sound or a trickle have I heard. And anyway Faramir said we were not to drink any water in Morgul.\u0027 \u0027No water flowing out of Imlad Morgul, were his words,\u0027 said Frodo. \u0027We are not in that valley now, and if we came on a spring it would be flowing into it and not out of it.\u0027 \u0027I wouldn\u0027t trust it,\u0027 said Sam, \u0027not till I was dying of thirst. There\u0027s a wicked feeling about this place.\u0027 He sniffed. \u0027And a smell, I fancy. Do you notice it? A queer kind of a smell, stuffy. I don\u0027t like it.\u0027 \u0027I don\u0027t like anything here at all.\u0027 said Frodo, \u0027step or stone, breath or bone. Earth, air and water all seem accursed. But so our path is laid.\u0027 \u0027Yes, that\u0027s so,\u0027 said Sam. \u0027And we shouldn\u0027t be here at all, if we\u0027d known more about it before we started. But I suppose it\u0027s often that way. The brave things in the old tales and songs, Mr. Frodo: adventures, as I used to call them. I used to think that they were things the wonderful folk of the stories went out and looked for, because they wanted them, because they were exciting and life was a bit dull, a kind of a sport, as you might say. But that\u0027s not the way of it with the tales that really mattered, or the ones that stay in the mind. Folk seem to have been just landed in them, usually -- their paths were laid that way, as you put it. But I expect they had lots of chances, like us, of turning back, only they didn\u0027t. And if they had, we shouldn\u0027t know, because they\u0027d have been forgotten. We hear about those as just went on -- and not all to a good end, mind you; at least not to what folk inside a story and not outside it call a good end. You know, coming home, and finding things all right, though not quite the same -- like old Mr Bilbo. But those aren\u0027t always the best tales to hear, though they may be the best tales to get landed in! I wonder what sort of a tale we\u0027ve fallen into? \u0027 \u0027I wonder,\u0027 said Frodo. \u0027But I don\u0027t know. And that\u0027s the way of a real tale. Take any one that you\u0027re fond of. You may know, or guess, what kind of a tale it is, happy-ending or sad-ending, but the people in it don\u0027t know. And you don\u0027t want them to.\u0027 \u0027No, sir, of course not. Beren now, he never thought he was going to get that Silmaril from the Iron Crown in Thangorodrim, and yet he did, and that was a worse place and a blacker danger than ours. But that\u0027s a long tale, of course, and goes on past the happiness and into grief and beyond it -- and the Silmaril went on and came to Edrendil. And why, sir, I never thought of that before! We\u0027ve got -- you\u0027ve got some of the light of it in that star-glass that the Lady gave you! Why, to think of it, we\u0027re in the same tale still! It\u0027s going on. Don\u0027t the great tales never end? \u0027 \u0027No, they never end as tales,\u0027 said Frodo. \u0027But the people in them come, and go when their part\u0027s ended. Our part will end later -- or sooner.\u0027 \u0027And then we can have some rest and some sleep,\u0027 said Sam. He laughed grimly. \u0027And I mean just that, Mr. Frodo. I mean plain ordinary rest, and sleep, and waking up to a morning\u0027s work in the garden. I\u0027m afraid that\u0027s all I\u0027m hoping for all the time. All the big important plans are not for my sort. Still, I wonder if we shall ever be put into songs or tales. We\u0027re in one, or course; but I mean: put into words, you know, told by the fireside, or read out of a great big book with red and black letters, years and years afterwards. And people will say: \"Let\u0027s hear about Frodo and the Ring! \" And they\u0027ll say: \"Yes, that\u0027s one of my favourite stories. Frodo was very brave. wasn\u0027t he, dad?\" \"Yes, my boy, the famousest of the hobbits, and that\u0027s saying a lot.\"\u0027 \u0027It\u0027s saying a lot too much,\u0027 said Frodo, and he laughed, a long clear laugh from his heart. Such a sound had not been heard in those places since Sauron came to Middle-earth. To Sam suddenly it seemed as if all the stones were listening and the tall rocks leaning over them. But Frodo did not heed them; he laughed again. \u0027Why, Sam,\u0027 he said, \u0027to hear you somehow makes me as merry as if the story was already written. But you\u0027ve left out one of the chief characters: Samwise the stouthearted. \"I want to hear more about Sam, dad. Why didn\u0027t they put in more of his talk, dad? That\u0027s what I like, it makes me laugh. And Frodo wouldn\u0027t have got far without Sam, would he, dad? \" \u0027 \u0027Now, Mr. Frodo,\u0027 said Sam, \u0027you shouldn\u0027t make fun. I was serious. \u0027 \u0027So was I,\u0027 said Frodo, \u0027and so I am. We\u0027re going on a bit too fast. You and I, Sam, are still stuck in the worst places of the story, and it is all too likely that some will say at this point: \"Shut the book now, dad; we don\u0027t want to read any more.\" \u0027 \u0027Maybe,\u0027 said Sam, \u0027but I wouldn\u0027t be one to say that. Things done and over and made into part of the great tales are different. Why, even Gollum might be good in a tale, better than he is to have by you, anyway. And he used to like tales himself once, by his own account. I wonder if he thinks he\u0027s the hero or the villain? \u0027Gollum!\u0027 he called. \u0027Would you like to be the hero -- now where\u0027s he got to again?\u0027 There was no sign of him at the mouth of their shelter nor in the shadows near. He had refused their food, though he had, as usual, accepted a mouthful of water; and then he had seemed to curl up for a sleep: They had supposed that one at any rate of his objects in his long absence the day before had been to hunt for food to his own liking; and now he had evidently slipped off again while they talked. But what for this time? \u0027I don\u0027t like his sneaking off without saying,\u0027 said Sam. \u0027And least of all now. He can\u0027t be looking for food up here, not unless there\u0027s some kind of rock he fancies. Why, there isn\u0027t even a bit of moss! \u0027 \u0027It\u0027s no good worrying about him now,\u0027 said Frodo. \u0027We couldn\u0027t have got so far, not even within sight of the pass, without him, and so we\u0027ll have to put up with his ways. If he\u0027s false, he\u0027s false.\u0027 \u0027All the same, I\u0027d rather have him under my eye,\u0027 said Sam. \u0027All the more so, if he\u0027s false. Do you remember he never would say if this pass was guarded or no? And now we see a tower there -- and it may be deserted, and it may not. Do you think he\u0027s gone to fetch them, Orcs or whatever they are?\u0027 \u0027No, I don\u0027t think so,\u0027 answered Frodo. \u0027Even if he\u0027s up to some wickedness, and I suppose that\u0027s not unlikely, I don\u0027t think it\u0027s that: not to fetch Orcs, or any servants of the Enemy. Why wait till now, and go through all the labour of the climb, and come so near the land he fears? He could probably have betrayed us to Orcs many times since we met him. No, if it\u0027s anything, it will be some little private trick of his own-that he thinks is quite secret.\u0027 \u0027Well, I suppose you\u0027re right, Mr. Frodo,\u0027 said Sam. \u0027Not that it comforts me mightily. I don\u0027t make no mistake: I don\u0027t doubt he\u0027d hand me over to Orcs as gladly as kiss his hand. But I was forgetting -- his Precious. No, I suppose the whole time it\u0027s been The Precious for poor Smjagol. That\u0027s the one idea in all his little schemes, if he has any. But how bringing us up here will help him in that is more than I can guess.\u0027 \u0027Very likely he can\u0027t guess himself,\u0027 said Frodo. \u0027And I don\u0027t think he\u0027s got just one plain scheme in his muddled head. I think he really is in part trying to save the Precious from the Enemy. as long as he can. For that would be the last disaster for himself too. if the Enemy got it. And in the other part, perhaps, he\u0027s just biding his time and waiting on chance.\u0027 \u0027Yes, Slinker and Stinker, as I\u0027ve said before,\u0027 said Sam. \u0027But the nearer they get to the Enemy\u0027s land the more like Stinker Slinker will get. Mark my words: if ever we get to the pass, he won\u0027t let us really take the precious thing over the border without making some kind of trouble.\u0027 \u0027We haven\u0027t got there yet,\u0027 said Frodo. \u0027No, but we\u0027d better keep our eyes skinned till we do. If we\u0027re caught napping, Stinker will come out on top pretty quick. Not but what it would be safe for you to have a wink now, master. Safe, if you lay close to me. I\u0027d be dearly glad to see you have a sleep. I\u0027d keep watch over you; and anyway, if you lay near, with my arm round you, no one could come pawing you without your Sam knowing it.\u0027 \u0027Sleep!\u0027 said Frodo and sighed, as if out of a desert he had seen a mirage of cool green. \u0027Yes, even here I could sleep.\u0027 \u0027Sleep then, master! Lay your head in my lap.\u0027 And so Gollum found them hours later, when he returned, crawling and creeping down the path out of the gloom ahead. Sam sat propped against the stone, his head dropping sideways and his breathing heavy. In his lap lay Frodo\u0027s head, drowned deep in sleep; upon his white forehead lay one of Sam\u0027s brown hands, and the other lay softly upon his master\u0027s breast. Peace was in both their faces. Gollum looked at them. A strange expression passed over his lean hungry face. The gleam faded from his eyes, and they went dim and grey, old and tired. A spasm of pain seemed to twist him, and he turned away, peering back up towards the pass, shaking his head, as if engaged in some interior debate. Then he came back, and slowly putting out a trembling hand, very cautiously he touched Frodo\u0027s knee -- but almost the touch was a caress. For a fleeting moment, could one of the sleepers have seen him, they would have thought that they beheld an old weary hobbit, shrunken by the years that had carried him far beyond his time, beyond friends and kin, and the fields and streams of youth, an old starved pitiable thing. But at that touch Frodo stirred and cried out softly in his sleep, and immediately Sam was wide awake. The first thing he saw was Gollum -- \u0027pawing at master,\u0027 as he thought. \u0027Hey you!\u0027 he said roughly. \u0027What are you up to?\u0027 \u0027Nothing, nothing,\u0027 said Gollum softly. \u0027Nice Master!\u0027 \u0027I daresay,\u0027 said Sam. \u0027But where have you been to -- sneaking off and sneaking back, you old villain? \u0027 Gollum withdrew himself, and a green glint flickered under his heavy lids. Almost spider-like he looked now, crouched back on his bent limbs, with his protruding eyes. The fleeting moment had passed, beyond recall. \u0027Sneaking, sneaking!\u0027 he hissed. \u0027Hobbits always so polite, yes. O nice hobbits! Smjagol brings them up secret ways that nobody else could find. Tired he is, thirsty he is, yes thirsty; and he guides them and he searches for paths, and they say sneak, sneak. Very nice friends, O yes my precious, very nice.\u0027 Sam felt a bit remorseful, though not more trustful. \u0027Sorry.\u0027 he said. \u0027I\u0027m sorry, but you startled me out of my sleep. And I shouldn\u0027t have been sleeping, and that made me a bit sharp. But Mr. Frodo. he\u0027s that tired, I asked him to have a wink; and well, that\u0027s how it is. Sorry. But where have you been to? \u0027 \u0027Sneaking,\u0027 said Gollum, and the green glint did not leave his eyes. \u0027O very well,\u0027 said Sam, \u0027have it your own way! I don\u0027t suppose it\u0027s so far from the truth. And now we\u0027d better all be sneaking along together. What\u0027s the time? Is it today or tomorrow? \u0027 \u0027It\u0027s tomorrow,\u0027 said Gollum, \u0027or this was tomorrow when hobbits went to sleep. Very foolish, very dangerous-if poor Smjagol wasn\u0027t sneaking about to watch.\u0027 \u0027I think we shall get tired of that word soon,\u0027 said Sam. \u0027But never mind. I\u0027ll wake master up.\u0027 Gently he smoothed the hair back from Frodo\u0027s brow, and bending down spoke softly to him. \u0027Wake up, Mr. Frodo! Wake up! \u0027 Frodo stirred and opened his eyes, and smiled, seeing Sam\u0027s face bending over him. \u0027Calling me early aren\u0027t you, Sam?\u0027 he said. \u0027It\u0027s dark still! \u0027 \u0027Yes it\u0027s always dark here,\u0027 said Sam. \u0027But Gollum\u0027s come back Mr. Frodo, and he says it\u0027s tomorrow. So we must be walking on. The last lap.\u0027 Frodo drew a deep breath and sat up. \u0027The last lap! \u0027 he said. \u0027Hullo, Smjagol! Found any food? Have you had any rest? \u0027 \u0027No food, no rest, nothing for Smjagol,\u0027 said Gollum. \u0027He\u0027s a sneak.\u0027 Sam clicked his tongue, but restrained himself. \u0027Don\u0027t take names to yourself, Smjagol,\u0027 said Frodo. \u0027It\u0027s unwise whether they are true or false.\u0027 \u0027Smjagol has to take what\u0027s given him,\u0027 answered Gollum. \u0027He was given that name by kind Master Samwise, the hobbit that knows so much.\u0027 Frodo looked at Sam. \u0027Yes sir,\u0027 he said. \u0027I did use the word, waking up out of my sleep sudden and all and finding him at hand. I said I was sorry, but I soon shan\u0027t be.\u0027 \u0027Come, let it pass then,\u0027 said Frodo. \u0027But now we seem to have come to the point, you and I, Smjagol. Tell me. Can we find the rest of the way by ourselves? We\u0027re in sight of the pass, of a way in, and if we can find it now, then I suppose our agreement can be said to be over. You have done what you promised, and you\u0027re free: free to go back to food and rest, wherever you wish to go, except to servants of the Enemy. And one day I may reward you, I or those that remember me.\u0027 \u0027No, no, not yet,\u0027 Gollum whined. \u0027O no! They can\u0027t find the way themselves, can they? O no indeed. There\u0027s the tunnel coming. Smjagol must go on. No rest. No food. Not yet.\u0027","sourceLink":"http://novel.tingroom.com/ertong/47/208.html","bookId":836,"book":{"id":836,"title":"The Two Towers双塔奇兵","description":"简介： 护戒联盟中的哈比人梅里与皮平被奥克斯掳走，护戒使者们不得不分头行事。弗拉多与好友山姆继续向索隆领地莫都进发，途中他们制服了也在疯狂寻找魔戒的怪物古鲁姆，魔戒曾经为他带来了长寿与隐身之道直到弗拉多的前辈毕尔博拿走了这枚戒指。由于通向莫都的路途十分艰险，...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285403016512bd.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/47","creation":"Aug 1, 2019 12:23:04 AM","modification":"Aug 1, 2019 12:23:04 AM"}}
