{"id":22135,"no":1,"title":"Introduction","content":"I wrote Little Brother in a white-hot fury between May 7, 2007 and July 2,2007: exactly eight weeks from the day I thought it up to the day I fin-ished it (Alice, to whom this book is dedicated, had to put up with meclacking out the final chapter at 5AM in our hotel in Rome, where wewere celebrating our anniversary). I\u0027d always dreamed of having a bookjust materialize, fully formed, and come pouring out of my fingertips, nosweat and fuss — but it wasn\u0027t nearly as much fun as I\u0027d thought itwould be. There were days when I wrote 10,000 words, hunching overmy keyboard in airports, on subways, in taxis — anywhere I could type. \\n\\n The book was trying to get out of my head, no matter what, and I missedso much sleep and so many meals that friends started to ask if I wasunwell. \\n\\n When my dad was a young university student in the 1960s, he was oneof the few \"counterculture\" people who thought computers were a goodthing. For most young people, computers represented the de-humaniza-tion of society. University students were reduced to numbers on apunchcard, each bearing the legend \"DO NOT BEND, SPINDLE, FOLDOR MUTILATE,\" prompting some of the students to wear pins that said,\"I AM A STUDENT: DO NOT BEND, SPINDLE, FOLD OR MUTILATEME.\" Computers were seen as a means to increase the ability of the au-thorities to regiment people and bend them to their will. \\n\\n When I was a 17, the world seemed like it was just going to get morefree. The Berlin Wall was about to come down. Computers — which hadbeen geeky and weird a few years before — were everywhere, and themodem I\u0027d used to connect to local bulletin board systems was now con-necting me to the entire world through the Internet and commercial on-line services like GEnie. My lifelong fascination with activist causes wentinto overdrive as I saw how the main difficulty in activism — organizing— was getting easier by leaps and bounds (I still remember the first timeI switched from mailing out a newsletter with hand-written addresses tousing a database with mail-merge). In the Soviet union, communicationstools were being used to bring information — and revolution — to thefarthest-flung corners of the largest authoritarian state the Earth had everseen. \\n\\n But 17 years later, things are very different. The computers I love arebeing co-opted, used to spy on us, control us, snitch on us. The NationalSecurity Agency has illegally wiretapped the entire USA and gottenaway with it. Car rental companies and mass transit and traffic4authorities are watching where we go, sending us automated tickets,finking us out to busybodies, cops and bad guys who gain illicit access totheir databases. The Transport Security Administration maintains a \"no-fly\" list of people who\u0027d never been convicted of any crime, but who arenevertheless considered too dangerous to fly. The list\u0027s contents aresecret. The rule that makes it enforceable is secret. The criteria for beingadded to the list are secret. It has four-year-olds on it. And US senators. \\n\\n And decorated veterans — actual war heroes. \\n\\n The 17 year olds I know understand to a nicety just how dangerous acomputer can be. The authoritarian nightmare of the 1960s has comehome for them. The seductive little boxes on their desks and in theirpockets watch their every move, corral them in, systematically deprivingthem of those new freedoms I had enjoyed and made such good use of inmy young adulthood. \\n\\n What\u0027s more, kids were clearly being used as guinea-pigs for a newkind of technological state that all of us were on our way to, a worldwhere taking a picture was either piracy (in a movie theater or museumor even a Starbucks), or terrorism (in a public place), but where we couldbe photographed, tracked and logged hundreds of times a day by everytin-pot dictator, cop, bureaucrat and shop-keeper. A world where anymeasure, including torture, could be justified just by waving your handsand shouting \"Terrorism! 9/11! Terrorism!\" until all dissent fell silent. \\n\\n We don\u0027t have to go down that road. \\n\\n If you love freedom, if you think the human condition is dignified byprivacy, by the right to be left alone, by the right to explore your weirdideas provided you don\u0027t hurt others, then you have common cause withthe kids whose web-browsers and cell phones are being used to lockthem up and follow them around. \\n\\n If you believe that the answer to bad speech is more speech — not cen-sorship — then you have a dog in the fight. \\n\\n If you believe in a society of laws, a land where our rulers have to tellus the rules, and have to follow them too, then you\u0027re part of the samestruggle that kids fight when they argue for the right to live under thesame Bill of Rights that adults have. \\n\\n This book is meant to be part of the conversation about what an in-formation society means: does it mean total control, or unheard-ofliberty? It\u0027s not just a noun, it\u0027s a verb, it\u0027s something you do. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1848/53586.html","bookId":973,"book":{"id":973,"title":"Little Brother","description":"简介： I wrote Little Brother in a white-hot fury between May 7, 2007 and July 2,2007: exactly eight weeks from the day I thought it up to the day I fin-ished it (Alice, to whom this book is dedicated, had to put up with meclacking out the final chapter at...","cover":"http://novel.tingroom.com/file/upload/201803/30/15-16-33-94-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1848","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
