{"id":93451,"no":15,"title":"Page 15","content":"\\n\\n It was a beautiful day, not a cloud in the sky—which made a random airship cloud all the more peculiar. The girls looked a picture. It was still cold for spring, but out had come pretty flowered muslins and striped seersucker walking dresses. There were parasols galore, and embroidered fringed shawls, not to mention shepherdess hats and Italian straw bonnets. Admittedly, the stylish dresses had been modified by belts with dangling gadgets, wrist attachments, suspiciously heavy chatelaines, and, in Sophronia’s case, a large reticule that looked like a metal sausage dog.\\n\\n Lessons, it must be confessed, were not a resounding success. The students were distracted easily. Sophronia and the debuts joined with some of the middle-level girls and all of the visiting boys for a lesson with Lady Linette in how to stroll in Hyde Park. Much time was spent going over the different ways to cut an unwelcome suitor, how tightly a man’s arm might be grasped, and the best way to engage in espionage under direct sunlight. They also discussed the distribution, use, and application of stealth spy rocks.\\n\\n There was a light picnic of broiled beef, roast duck, braised pork pie, cold poached chicken in cream sauce, pickles and relishes, crusty French bread, and stewed fruit, accompanied by punch, which was followed by tea with pear turnovers, cabinet pudding, and apricot macaroons. They learned how to sit on wet ground and still eat with delicacy. Conversation centered mainly on the various evil projects under the purview of their gentlemen visitors, with the young ladies inventing new uses and applications. It turned into a kind of game. Lord Dingleproops, for example, was working on mustache-curling and waxing technologies, and the girls wondered if his wax might be used to convey secret messages, or even if the curl of a man’s mustache might function in just such a manner. The discussion evolved to the interesting question of whether a gentleman could tattoo a secret message upon his chin, then grow out his beard, thus transporting said message into enemy territory with no one the wiser. Would a man want a message permanently upon his chin? That was the quandary. And could one legitimately ascribe nefarious intent to any many with a full beard as a result?\\n\\n “I’ve always thought beards suspicious,” said Dimity with conviction.\\n\\n Sophronia felt Lord Dingleproops might be improved by a beard. After all, no one would know his chin appeared to have eloped with, quite probably, Monique’s brain and Preshea’s sense of humor.\\n\\n After the picnic, the ladies and gentlemen were permitted to socialize further. Flirting was cautiously encouraged, with Lord Dingleproops and Lord Mersey being instantly subsumed by Preshea and Monique respectively. Sophronia and Dimity linked arms and tootled around. Agatha trailed dutifully behind her mark, as ordered, along with a small gaggle of fellow sycophants. Sidheag mooched off with a stick to beat a tree or something. The teachers settled into a group near the hilltop to keep an eye on the mingling young people.\\n\\n Sophronia and Dimity wandered into the small forest, where they found an empty patch of ground and put Bumbersnoot down to have a snuffle in the fallen leaves. He was given strict instructions not to catch anything on fire, although it was damp enough that he would have had to put considerable effort into the attempt.\\n\\n He squeaked about, his stubby mechanical legs getting caught on twigs, his ears flapping with toots of smoke, and his tail wagging back and forth eagerly. Sophronia did not bother to remove the lace bits wrapped about him, so that he trailed ribbons and straps in his wake like an entirely disreputable bride.\\n\\n They talked of nothing consequential and watched the mechanimal’s antics. Bumbersnoot was wrestling with a large stick, and Sophronia couldn’t tell whether he wanted to swallow it into his storage compartment or his boiler. Suddenly, the little creature sat back and whistled, pressing out steam forcefully in some kind of an alarm, like a teakettle.\\n\\n Both girls were startled. They’d had no idea he could make any noise whatsoever, aside from the clang when he stumbled into furniture.\\n\\n Moments later three slablike men materialized out of the trees. One of them grabbed Dimity, and another Sophronia. The third stood with arms akimbo, as if he intended to make a speech.\\n\\n Sophronia found herself most indelicately confined. There was one beefy arm about her waist, trapping her arms against her side, and another over her mouth, preventing her from shouting for assistance.\\n\\n “Where’s the boy?” demanded the third ruffian, looking around. “We need him as well.”\\n\\n Sophronia tried to kick her captor, lashing out with one booted foot, but heavy skirts and copious petticoats prevented her from doing any damage.\\n\\n Dimity was also struggling. Sophronia could see her friend’s wide hazel eyes above the other ruffian’s arm.\\n\\n Bumbersnoot, ignored by their attackers, took temporary refuge behind a stump.\\n\\n Sophronia really didn’t want to, but she did the only thing she could. She opened her mouth and bit down hard on the man’s sweaty arm.\\n\\n The man howled in pain but didn’t let her go, only jerked her head back and tightened his grip into her mouth in a most uncomfortable manner.\\n\\n “The boy should be with them; they are siblings, after all.”\\n\\n Pillover. They want Pillover, too.\\n\\n Bumbersnoot, not at all pleased with this treatment of his mistress, circled about and approached Sophronia’s captor.\\n\\n Sophronia couldn’t give him any orders. Even if she were able to speak, he rarely obeyed verbal commands. She had no idea what he might do. She was terribly afraid he would get himself permanently damaged; one swift kick from the ruffian’s anvil-sized boot and he was done for.\\n\\n Her mind cataloged lessons. They’d had nothing on freeing themselves from larger, stronger captors. Her elbows were tight to her waist, but she made an attempt to reach for her chatelaine—the Depraved Lens of Crispy Magnification hung there. It was a weapon, of sorts. She couldn’t get hold of it, but she could reach her other wrist.\\n\\n She still wore the hurlie. She rarely took it off except to bathe. She managed to use one hand to release the catch.\\n\\n Bumbersnoot moved closer.\\n\\n Sophronia couldn’t point the grapple at her own captor, and she daren’t risk hitting Dimity, but the man who had spoken was an easy target. She angled her wrist at him and fired. She got the grapple over the ruffian’s shoulder, jerking back to bring the hook into the flesh of his upper back. The man screamed and turned, scrabbling with his hands.\\n\\n “Get it off, get it out!” he yelled. There was blood leaking down his shirt—he was without a jacket. All three of them were. So thuggish.\\n\\n In the same instant, Bumbersnoot snuck up against Sophronia’s captor’s leg and blasted hot steam on the man’s bare ankle, scalding him badly. That’ll teach him not to wear hose, thought Sophronia.\\n\\n The man yelled in surprise and let her go. Sophronia dove down, scooped up Bumbersnoot, and rolled out of reach. Lady Linette had made them practice that maneuver in full skirts. The extra material actually helped, cushioning the somersault. Sophronia couldn’t get very far, however, as her wrist was still attached to the other man via the hurlie.\\n\\n At the sight of the blood, Dimity fainted, becoming a dead weight in her ruffian’s arms. He swore and tried to keep hold, but Dimity’s chiffon dress was slippery, and she hadn’t Sophronia’s propensity for covering herself with gadgets. Without handholds, the man lost his grip. Dimity collapsed to the forest floor.\\n\\n The bleeding man managed to free himself from Sophronia’s hurlie, which she retracted. Momentarily unencumbered, Sophronia pulled out her letter opener. She’d begun to carry it right after they started knife-fighting lessons, as soon as she realized it would work just as well and be more innocuous. After all, a lady might expect a missive at any moment. It wouldn’t do to be without a letter opener. She made a mental note to start wearing and training with her hurlie in her left hand so she could use both as weapons in a fight.\\n\\n With one ruffian trying to pick up a limp Dimity, another clutching his burned leg, and the third trying to grab his own bleeding back, it looked like Sophronia had the best of them. She was no fool, however. It was her and Bumbersnoot, whose ribbon strap she threw over her neck, against three fully grown men. She ought to run, but she wasn’t about to leave Dimity in their clutches!\\n\\n The men were wary of coming at her again. She was, after all, armed with a projectile. She wished for a gun. If this kind of thing were to become a regular occurrence, munitions lessons really shouldn’t be left for older students. Then her training kicked in: get them talking.\\n\\n “What do you want?” she asked, pleased with how steady her voice sounded.\\n\\n “Oh, no, little miss, we know better then that,” said one.\\n\\n Another said to his companions, “We can’t let her go. She’ll alert the others.”\\n\\n “Good idea,” said Sophronia, at which juncture she threw her head back and screamed at the top of her lungs.\\n\\n Instantly, not so very far away, she heard someone crashing through the trees. She screamed again.\\n\\n Apparently, deciding it was most important to hush her, two ruffians charged. Sophronia took aim and fired with her hurlie a second time. It hit the burned man in the chest and bounced harmlessly off. The hooks were made to catch on the draw back, not the firing. I should get Vieve to mount a sharp point in the middle that pops out when I release the turtle. Still the man howled in surprise; the spring-loaded release was strong, so it would at least bruise. Then the other man was upon her.\\n\\n Sophronia fell into Captain Niall’s best defensive stance for the smaller personage when faced with a large opponent and raised her letter opener. The ruffian moved in, no doubt relying on the fact that she was female and could not possibly know anything about fighting. Captain Niall had only taught them a single attack, but he had made them practice it over and over and over. Sophronia slashed out, opening up a long gash on the man’s arm.\\n\\n He backed away warily.\\n\\n The other ruffian stopped, grabbed at her grappling hook, and began tugging on it. Soon he would have Sophronia by a leash, and she had no time to undo the turtle from her wrist, focused as she was on fighting the first man. Sophronia prepared to kick. That was a dirty tactic, not taught by Captain Niall, but Soap had shown her a few tricks and she was prepared to use them if necessary.\\n\\n It was not necessary, for a rescuer appeared out of the forest.\\n\\n “You screamed, madam?”\\n\\n “Why, Lord Mersey, what are you doing here?”\\n\\n “Following you, of course. Spot of bother?”\\n\\n “Little bit of one, yes.”\\n\\n The young man looked with interest at Sophronia’s opponents, one holding a collapsed Dimity, one bleeding from a gash to the arm, and the third bleeding from a wound to the back.\\n\\n “My dear Ria, you hardly need my help.”\\n\\n “Hardly.”\\n\\n “Have I told you recently how much I admire a capable woman?” As he spoke, the young lord reached inside his coat and produced the most remarkable gadget. It wasn’t very big and was rather flat, which explained how he could keep it in his coat without upsetting the lines, but it was extremely evil looking. It was long and sharp with multiple attachments and a nozzle blackened from extruding some toxic substance. It looked highly flammable and quite deadly. Vieve would have been enthralled.\\n\\n The ruffians were suitably impressed. They stopped.\\n\\n “Put down the young lady,” said Felix.\\n\\n The man holding Dimity hesitated.\\n\\n Felix was an aristocrat and accustomed to instant obedience. “This moment!” He swung the weapon to aim at the man and Dimity. “I assure you, I am a very good shot. I will most certainly hit you, not her.”\\n\\n “What is that thing?” quavered the ruffian.\\n\\n “Oh, this?” Felix was casual. “This is a ballistic exploding steam missile fire prong. It’s my latest invention, and it’s very, very good at being deadly.”\\n\\n That did it. The ruffian holding Dimity dropped her once more, and she flopped becomingly, like a sleeping princess from a fairy story.\\n\\n The man who had been hurlied said to the other two, “We ain’t paid enough for this.”\\n\\n The others apparently agreed. “Leave it.”\\n\\n With little more to-do, the three ruffians dashed away into the forest.\\n\\n Sophronia and Felix looked at each other.\\n\\n “Nice prong,” said Sophronia after a moment.\\n\\n Felix grinned and waggled his eyebrows lasciviously. “Thank you for saying so.”\\n\\n Sophronia was instantly suspicious. “You mean that isn’t a ballistic exploding steam missile fire prong?”\\n\\n “No such thing, my dear Ria, but it certainly sounds wicked, doesn’t it?”\\n\\n “Then what is it?”\\n\\n He handed the evil-looking object over. “Ah, a portable boot-blackening apparatus with pressure-controlled particulate emissions, and attached accoutrement to achieve the highest possible shine. For the stylish gentleman on the go.” He presented his own well-turned-out leg, proving that his boots were as shiny as could be, despite exposure to the outside environment. \\n\\n","sourceLink":"https://allnovel.net/curtsies-conspiracies-finishing-school-2/page-15.html","bookId":1613,"book":{"id":1613,"title":"Curtsies \u0026 Conspiracies (Finishing School #2)","description":"Storyline: Curtsies \u0026 Conspiracies (Finishing School #2) \\n Sophronia, second year at Miss Geraldine\u0027s Finishing Academy, helps Dimity avoid London kidnappers and Vieve 10 attend Bunson boys\u0027 school. Someone kills for malfunctioning guidance valves that can control \u0027aether\u0027 atmosphere level. Again, she flirts with \u0027sootie\u0027 coal-worker Soap from the boiler room, and cuts Felix, son of Duke Golborne, at come-out ball. Teacher Captain Niall turns werewolf; vampire Prof Braithwope braves \u0027tether\u0027; mechanimal Bumbersnoot plays essential role.\\n","cover":"https://allnovel.net/images/curtsies-conspiracies-finishing-school-2.jpg","author":"Gail Carriger","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/curtsies-conspiracies-finishing-school-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:01:30 PM"}}
