{"id":93439,"no":3,"title":"Page 3","content":"\n Sophronia could feel herself flushing. It was a fair assessment, but she did not like criticism. She knew she was good. Better than many of the other girls of her age-group. True, Sidheag could beat her in physical combat, Dimity and Preshea were more ladylike, and Monique was better at social graces, but Sophronia was the best at espionage. Nevertheless, she held her tongue and stared at her hands, forcing herself not to clasp them tightly. Lady Linette had only said that most lone intelligencers were male. Perhaps once in a while there was room for a female.\n “Thank you, Miss Temminnick. You are dismissed.”\n Sophronia bobbed a curtsy. It was just shy of being too high and too brief and thus rude. But before Lady Linette could comment, Sophronia swept from the room in a manner so grand that no teacher at Mademoiselle Geraldine’s would critique the action.\n RESULTS DISORIENTATED\n Sophronia found Dimity waiting in the hallway. Her friend’s face was white, and her lower lip trembled.\n “Oh, Sophronia,” she cried. “Wasn’t that perfectly ghastly?”\n She’s getting more and more dramatic, thought Sophronia. Overexposure to Mademoiselle Geraldine. “It certainly was odd.” Sophronia’s gift for understatement was almost as good as Dimity’s gift for overstatement.\n “I poured the cold tea,” admitted Dimity. “Did you?”\n Sophronia nodded.\n “Oh, good, I thought you might. You’re usually right about these things.”\n “Not always.”\n Dimity was crestfallen. “Oh, dear. Your assessment wasn’t wholly positive?”\n “Not by half!”\n Dimity brightened. “Really? Neither was mine. That’s good, then. Perhaps I won’t fail.”\n “I thought you wanted to be sent down. I thought you wanted to be put into a real finishing school, to become an ordinary lady with a respectable parliamentary husband and no concerns beyond planning the next dinner party.”\n “I did. I mean, I do. But Mummy would be so very disappointed, and I would have to leave you. And Sidheag. And Bumbersnoot.”\n Sophronia could only agree with Dimity’s logic. “True.”\n “Speaking of which, I must talk with you about this letter I received.” Dimity flashed a suspiciously embossed missive.\n Sophronia grabbed for it.\n Dimity was faster. “No, you can’t see it until we are with the others.”\n Sophronia stuck her tongue out but waited obligingly until after luncheon. Due to the presence of Monique and Preshea in the drawing room, Agatha and Sidheag joined Sophronia and Dimity in their private room for a gossip.\n Dimity produced the letter, both embarrassed and excited. “It’s from Lord Dingleproops!”\n “Dimity,” objected Agatha, “should you be getting private correspondences from an unattached gentleman friend?”\n “No, but this is the first. I didn’t write to him! And it can’t be that bad; our families are acquainted.”\n Agatha was properly concerned. “Has he permission to court you?” Agatha Woosmoss was small, round, and redheaded, with a freckled face that wore a perpetual expression of distressed confusion, not unlike that of a damp cat.\n Dimity flushed even redder. “No, but I’m certain he would.”\n Sidheag was reading the hastily scrawled note. “It’s worse than simply a letter. He wants to meet with you, in private and secretly!”\n “Dimity!” Sophronia said. “Why didn’t you tell me?”\n Dimity was truculent. “Because I knew you’d be all Sophroniaish about it. That’s why. It’s not that bad, is it? He probably only wants to chat a bit about the weather or something.”\n Sidheag, still in possession of the shocking missive, said, “Since it says here that he intends to come to you on this airship, it can’t be that banal.” Sidheag Maccon was an overly tall young woman, almost of an age with Sophronia. She had a long, proud face and a general attitude of indifference to both manners and dress that drove their teachers to distraction.\n Sophronia was having none of it. “Dimity, he’d have to steal an airdinghy and then try to find us. I’ve no idea where we are over Dartmoor, do you? I’m sure he doesn’t. Besides, I don’t think Bunson’s has airdinghies. The whole idea is foolhardy.”\n Dimity liked Lord Dingleproops rather more than she ought and was disposed to think well of him. “It must be important, then, mustn’t it? Perhaps it’s a declaration!”\n “Oh, Dimity, really!” said Agatha.\n Sophronia added, “You’re only just fourteen, and he’s what, sixteen?”\n Dimity protested, “My birthday was weeks ago!”\n Sidheag, the blunt one, said, “He isn’t even holding yet. He can’t declare without his parents’ permission.” Sidheag could be quite crass, the result of having been raised by men, or Scots, or soldiers, or werewolves, or all four. Since she was also Lady Kingair, her crassness would have been an accepted eccentricity—in a much older aristocrat. In a fourteen-year-old, such vulgarity was as odd and uncomfortable as last season’s hat.\n Sophronia took the missive out of Sidheag’s hand and examined it. It under the Earl of Dingleproops’s heading, which gave it a certain weight. But she did wonder what the son was doing with his father’s stationery. Probably using it to write angry letters to poor tradesmen in his father’s name and to torture decent young ladies like Dimity.\n “He wants to meet with you on the back squeak deck in a week and a half?”\n Dimity nodded. “Isn’t that romantic?”\n Agatha protested. “You’re not going?”\n “Of course I’m going! He will have come all this way.”\n “It’ll all end in tears,” foretold Sidheag morosely.\n Sophronia said nothing further; Dimity could be awful stubborn. Privately, Sophronia vowed to follow Dimity. Lord Dingleproops was up to something.\n They were made to wait until the end of the week for their test assessments. At long last, after supper, instead of the customary parlor games and card counting, their age-group was separated from the others. Agatha looked like she might faint, or cry, or palpitate, or all three—which would be a real feat. Preshea—small, dark, and unreasonably lovely—looked like she intended to kill someone. But then, Preshea always looked that way. Dimity’s round porcelain face was set. Monique, having been through this before, swept her skirts behind her with an air of determination. Sidheag loped along as though she hadn’t a care in the aether. Sidheag could be irritating like that.\n Sophronia wondered how she herself was showing tension. Not at all, to those who did not look at her shoulders. She would have been surprised by how impressed Lady Linette was with this accomplishment. Lady Linette had also been impressed when Sophronia ate only the vegetables from the meal provided after the exam. Sophronia was the only student to have considered that the test might include the meal. Even Monique, who should have known better, had eaten seven bites of her meat and all her pudding.\n Lady Linette led them to her own teaching quarters. These were decorated as if a boudoir had procreated with the set of She Stoops to Conquer. There were red curtains, a good deal of gold, and chaise longues instead of chairs. Several fluffy cats with funny scrunched-up faces and possessive attitudes to hassocks lounged about.\n Lady Linette left the six girls there.\n They sat in expectant silence. Agatha stared at her feet. Sidheag slouched. Both knew better but were regressing into bad habits out of anxiety.\n Professor Lefoux entered the room.\n An almost audible groan met the appearance of this, the harshest of their teachers.\n Professor Lefoux was not so much a battle-ax as a pair of pinking cutters—sharp, toothy, and uneven in temper but very useful. They hadn’t any lessons with her yet. Rumor had it she was deemed too fierce for the younger girls. Tall and bony, with a stiff face and hair scraped back into a bun, she looked mean. She also had a French accent, which hundreds of years of animosity had trained nice young Englishwomen to suspect as evil.\n Professor Lefoux did not bother to explain her presence. “Monique de Pelouse, your assessment is not really one of six months, as you have now been in attendance at this school for four years and eight months. Nevertheless, due to your attempted theft of the crystalline valve prototype last year and your regression in status as a result of that failure, you are undergoing public review along with the others of your rank.”\n Monique sat silent, her gaze straight forward, her attitude one of superiority rather than penance.\n “Your marks are as expected. You are a fair intelligencer but prone to lack of creativity, which could get you killed. You are ladylike but favor overt manipulation, which could get you ostracized. Given your age, it is the recommendation of the staff that you marry with no second attempt at finishing.”\n Monique looked, for the first time in Sophronia’s miserable association with the girl, as if she might genuinely cry. Sophronia had seen her fake cry on several occasions, but never had an honest tear come from those pretty blue eyes. The blonde said, “How could you? Why, I ought to have my father refuse funding. I shall report you to my special friend for this.”\n Sophronia perked up. She knew Monique had an advocate on staff, but this was the first time the girl had admitted it publicly.\n Professor Lefoux interrupted any further tirade. “Silence, young lady. You are to remain a student here until your coming-out ball and will conduct yourself as such. You will do very well for yourself in society, but it is the formal assessment of this institution that even with retraining, you could not exceed your personality. You are not to be made an agent.”\n Am I seeing things, wondered Sophronia, or is that a smile on Professor Lefoux’s face?\n Monique rose as though she might storm from the room.\n “Sit down, Miss Pelouse!” ordered Professor Lefoux. “You are required to witness all the assessments.”\n Monique resumed her seat, almost trembling.\n “Preshea Buss.” Preshea’s dark eyes were wide, and her normally crafty face was carefully blank.\n “You are adept at social manipulation but too apt to trade on your looks for assistance. You underestimate intelligence, even your own. Improve your execution, or you will be good only for marriage without covert orders.”\n Preshea protested, “But I’ve been here only a few months!” She spoke precisely and sharply, as though each word were being murdered by her mouth.\n “Which is why we tell you this now.”\n “What if I want to get married?” grumbled Preshea under her breath to Agatha.\n “I thought that was one of the ways to finish,” Sophronia whispered to Dimity.\n “It is, but to be dismissed into marriage without covert orders is dishonorable.”\n “Miss Temminnick, Miss Plumleigh-Teignmott, if you would like to include the rest of the class in your discussion?” Professor Lefoux’s ire was turned abruptly on them.\n Dimity and Sophronia looked up. “Sorry, Professor,” they singsonged in tandem.\n Professor Lefoux glared but clearly wished to continue. “Agatha Woosmoss,” she barked.\n Agatha’s bottom lip wobbled.\n “Very poor marks indeed. Have you been paying any attention at all in your lessons? You are hereby put on probationary status for six months. You must improve both covert and social aspects of training. Your father is a great patron of our insitution, but we cannot play favorites with a weak component.”\n Agatha began to cry, fishing about for a handkerchief. As usual, she had misplaced hers. Sophronia passed her a spare, wincing in sympathy.\n Professor Lefoux continued. “Sidheag Maccon, Lady Kingair.”\n Sidheag looked directly at the teacher, like a soldier facing execution. The girl’s unique yellow eyes were wary.\n “You chose all the weapons and showed excellent use of them, even the fan. However, your social skills are middling, and your dress and posture have entirely failed to improve. We understand your background is unusual and that your expectations are different from those of other students. We are sending you into Scottish society, but you will be presented at court eventually. A woman of your rank will need all skills, not only the ones you find interesting. You too are on probation, and your father has been informed of this.”\n Sidheag look more worried than Sophronia had ever seen her. Her so-called father, Lord Maccon, was really her great-great-great-grandfather and Alpha werewolf of the Kingair Castle pack. Sidheag always spoke of him with a fond irreverence. Now Sophronia could tell from her friend’s expression that he could also be fierce.\n Professor Lefoux moved to Dimity. “Miss Plumleigh-Teignmott.”\n Dimity’s face was ashen. \n","sourceLink":"https://allnovel.net/curtsies-conspiracies-finishing-school-2/page-3.html","bookId":1613,"book":{"id":1613,"title":"Curtsies \u0026 Conspiracies (Finishing School #2)","description":"Storyline: \n Curtsies \u0026 Conspiracies (Finishing School #2) \n Sophronia, second year at Miss Geraldine\u0027s Finishing Academy, helps Dimity avoid London kidnappers and Vieve 10 attend Bunson boys\u0027 school. Someone kills for malfunctioning guidance valves that can control \u0027aether\u0027 atmosphere level. Again, she flirts with \u0027sootie\u0027 coal-worker Soap from the boiler room, and cuts Felix, son of Duke Golborne, at come-out ball. Teacher Captain Niall turns werewolf; vampire Prof Braithwope braves \u0027tether\u0027; mechanimal Bumbersnoot plays essential role.\n \n","cover":"https://allnovel.net/images/curtsies-conspiracies-finishing-school-2.jpg","author":"Gail Carriger","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/curtsies-conspiracies-finishing-school-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:01:30 PM"}}
