{"id":84272,"no":11,"title":"Page 11","content":"\n Abruptly, the door to the kitchen was flung open and the wait staff flooded into the room ready for their breakfast.\n Chapter 5\n 1. The Away Party\n Katie took point with her group since she was more experienced with weapons. It didn’t escape her how ironic it was that she was finally doing what her father had always hoped for. Being a good solider. She had considered following his footsteps into the Marines, but had opted for college and law school instead. Now she was wondering if she should have gone into the Marines. Maybe if she had she wouldn’t be scared shitless.\n Travis tripped and fell over a chair in the hallway.\n They all froze.\n Katie turned to give him a dark look and whispered, “Shhhh” at him.\n “Sorry,” Travis muttered.\n Their destination was the first floor lobby. The idea was to clear out the center of the first floor first and work outwards. The lobby was quite large, so they were taking the left-hand side. Another group was taking the right. Two halls lead to the lobby.\n Katie walked slowly, her steps measured, cautious. Nearing the archway leading into the lobby, she took a deep breath. If the front door was open, they were most likely fucked. Sunlight was very visible on the far wall, illuminating their way. Something was open.\n Travis and Roger behind her, she moved slowly along the wall, and out onto the tiled floor, her boots making soft tapping sounds. The enormous oak staircase cut the lobby in half and they slipped along its side. Katie glanced upwards, toward the railing and the second floor.\n Nothing.\n Slowly, one of the large windows came into view. Light was pouring in through it, but the front doors were closed. Chained, in fact.\n She sighed with relief and turned to see a zombie staring at her. It was a maid, standing on the stairs. Her head was hanging by sinews and flopped sideways on her chest. She would have appeared headless from the behind. But from her angle, she could clearly see the barely attached head and its crazed eyes. It was obviously too confused by its condition to know what to do. It scuttled one way then the other, uncoordinated.\n “Damn,” Roger whispered.\n Katie drew her bowie knife from her belt and approached the creature slowly. It blinked at her, its mouth open, trying to scream at her, and started snapping its jaws at her. Again it swayed back and forth, obviously not sure how to move toward its prey.\n With a grunt, Katie shoved the creature over and it landed hard on the stairs. Its head flopped to one side, its teeth snapping. Lifting the knife over her shoulder, Katie narrowed her eyes, aimed, and struck the zombie through the eye as hard as she could. The knife hit bone and she twisted, pushing further in. The jaws stopped snapping. Katie braced her foot on the head and drew out her knife. Cleaning the blade on the dead maid’s dress, she looked up to see Roger and Travis looking at her in shock.\n “What?”\n “Damn,” Roger said.\n Katie looked around and saw the other team lead by Katarina entering the far side of the room. They signaled that they were clear and Katie nodded.\n The walkie-talkie sputtered, “Dining room! Now! Fuck Fuck!\n Fuck!” Jenni’s voice was frantic.\n The gun shots began.\n 2. Nothing Ever Goes As Planned\n In some ways it was just like a video game. You fired until the gun clicked empty, reloaded, fired again, reloaded…\n There just needed to be an annoying male voice telling you when to reload and it would be perfect. But there wasn’t and the zombies rushing them weren’t carbon copies of each other and wouldn’t vanish when hit. They were dressed alike in their waiter costume, but very different. Some were almost sprinting toward them. Others were struggling just to walk. The more whole “I obviously died by my throat being bit out” were fast and the “I got swarmed by a bunch of them and obviously got really eaten up” staggered.\n The runners went down fast, since they were the front of the pack, but they were so quick they closed the gap between the living and the undead with startling swiftness.\n Luckily, Ashley and Ned did exactly what they were supposed to do. Mike had taught them to divide up the zombies into, as he put it, “Pie slices” with everyone taking one slice to concentrate on. Jenni fired right down the center. Ashley fired at anything to the left of them as Ned took care of those on the right.\n The swarming zombies fell quickly as the shots hit them true. Some even tripped over their comrades, landing hard on their faces, before having their heads blown off.\n The three humans backed up slowly, all trying not to panic as the gush of zombies faded out to a trickle. As the last shot echoed through the room and the last zombie toppled forward, they all three let out the breaths they had been holding.\n “We did it!” Ashley beamed happily.\n Jenni nodded grimly, and said, “But listen.”\n From the distance was the sound of running feet, grunts and growls.\n “Shit, they’re coming,” Ned muttered.\n They ran across the dining room, jumping over the dead bodies, moving to the far side. Jenni began to shove over the heavy tables, making a barrier as fast as she could. The other two joined her.\n Mike, Nerit, and the rest of their teams ran in the door. Seeing the upturned tables and all the dead bodies, they quickly understood what was happening.\n “Check the kitchen,” Mike ordered.\n Nerit moved faster than any woman her age should be able to and motioned to Shane to heave her up onto the bar behind the upturned tables. She immediately aimed toward the main doors.\n The grunting, moaning, screaming zombies were drawing closer.\n “Kitchen is clear with only a back door into the side street,” Felix said.\n “If we have to, that’s the way we’ll fall back,” Mike answered.\n The dining room doors busted open and Travis, Katie and Roger ran in. Katie sprinted across the room, evading the tables and bodies, with Travis close behind. Roger huffed, as his huge girth swayed as he moved, but he managed to reach the overturned tables just as the doors swung open again.\n Katarina\u0027s team ran in. They rushed headlong through the tables, knocking over chairs, and tripping in their panicked state. The reason for their desperation became quickly clear. The doors never closed for they caught on the mangled, mutilated bodies of the dead right behind the last team.\n Katarina fell in her haste to get around a table. The first zombie in the mob reached down to grab her and Nerit put a hole through his head.\n There was hesitation to fire from the people huddled behind the tables. With three people running in desperate haste toward them and blocking their view, Nerit took a majority of the shots.\n Jenni aimed for the zombies furthest from the running humans and fired off a few shots. She could feel the tension growing steadily as the room slowly filled.\n Katarina managed to get up and run again, but four more zombies grabbed hold of her denim jacket. She twisted, yanked, and squirmed her way out of the jacket and broke free, running again.\n Jenni heard a man’s scream and barely saw one of the men, whose name she did not remember, go down. Gunshots rang out steadily, but the man kept screaming.\n “Nerit!” Mike’s voice was an order.\n Another shot, then the man stopped screaming.\n Katarina reached the tables and squirmed behind them. She quickly turned to fire at a zombie in hot pursuit.\n There was no sign of the other man. He had gone down so silently, no one had noticed. The room was now clogged with the undead. They were tripping over their dead comrades and falling over chairs and tables. The most agile had pursued Katarina, but as they had drawn near the barricade, they had gone down in a hail of bullets.\n Jenni kept firing, aiming as much as she could, but she was terrified and that terror made some of her shots go wide.\n Her gun clicked empty, and Mike shouted at her, “Reload.”\n She almost burst out laughing.\n 3. The Madness of War\n Katie found herself wedged behind a table with her back against the wall with Travis beside her and Nerit standing on the bar behind them.\n She hated being stuck in the corner.\n The gun kept jerking in her hands. Her fingers ached as she tried to aim true and take the heads off as many of the zombies as possible.\n There had been estimates that only twenty people were in the hotel.\n That estimate had been seriously low. At least a dozen lay dead on the ground and maybe thirty were still moving around and trying to get to the living flesh.\n A zombie pushed his way past a nearby table and charged at the barricade. He hit the table Katie was behind and it started to tip.\n Pressing her back against the wall and bracing the table with one foot, she aimed at his head as he snarled, reaching for her. Pulling the trigger, she was already flinching, knowing blood and gore would splatter her.\n “Gross,” she muttered as wiped brains off her face, and aimed at the next one rushing toward them.\n Next to her, Travis was busy reloading someone else’s gun for them. Jenni was screaming at the zombies as she fired. Nerit was cold and calculating above them as she systematically eliminated the quickest of the undead, leaving the slower, more mutilated ones staggering toward the tables.\n “Gawddammit! Why are there so many?” Felix exclaimed. \n","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-11.html","bookId":2482,"book":{"id":2482,"title":"Fighting to Survive (As the World Dies #2)","description":"Storyline: \n Fighting to Survive (As the World Dies #2) \n Katie and Jenni have found new lives with the survivors of their makeshift fort, but danger still lurks. Nothing is easy in the new world where the dead walk and every day is a struggle to keep safe. As the elements, bandits, and the zombie horde threaten their safe haven, Jenni and Katie join the other survivors in fighting to survive as the world dies.\n \n","cover":"https://allnovel.net/images/fighting-to-survive-as-the-world-dies-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:56:45 PM"}}
