{"id":84273,"no":12,"title":"Page 12","content":"Beside him, Shane didn\u0027t answer as he shoved the end of his rifle into a snarling zombie mouth and fired. Four zombies hit the barricade at the same time and some people had to stop firing so they could brace it. Nerit was in the midst of reloading so Travis picked up a heavy candlestick and brought it down hard on the head of one of the female zombies snarling at them. Katie screamed as something grabbed her leg. She looked down to see the hand of a zombie gripping her ankle. It had reached through the gap between the table and wall. Its growling face was barely visible. With surprising strength, it tugged on her, sending her tumbling backward into the bar. Travis brought the candlestick down hard on the head of another zombie as more hit the barricades. Now only a few people were firing into the crowd of zombies. The others tried to keep the tables from toppling over and allowing the zombies through. The room was filled with the screams of the humans and the growls of the zombies. It seemed everyone was shouting at once: Mike ordering people to hold the tables in place, Katarina screaming that her table was slipping, Nerit telling everyone to be calm, Felix and Shane were shouting as several zombies were trying to topple their table, Katie screaming because the zombie was dragging her leg out into the open. It was chaos. Travis continued to slam the candlestick downward, blood and gore flying everywhere. One of the zombies grabbed his arm and, for a horrible moment, everyone panicked. Nerit put a bullet through the zombie’s head, but more were grabbing at Travis’s arm. “Jacket off!” It was Katarina’s voice. Travis yanked his arm through the sleeve as fast as he could, Katarina helping him pull the jacket off. It was ripped off him and dragged into the mouths of the hungry zombies on the other side of the barricade. Jenni grabbed Travis\u0027 arm and saw that he had escaped without a bite. “Shit! That was close! You\u0027re fine!” she said, and went back to firing at the very frustrated looking zombies. Katie, meanwhile, was on the floor and trying to pull her leg away from the zombie. She had trouble getting leverage to yank her leg back. “Some help here!” Katie tried to aim at the zombie’s head, but it was out of view behind her captured foot. “Keep the tables in place!” Shane roared. Beside him, Charles and Ned struggled with a table. Mike’s voice was fierce over the shots and screams. “Hold the line! Don\u0027t let them through!” Nerit kicked Mike in the shoulder. “Katie’s in trouble!” Mike looked over to see what was happening. “Shit! Travis! A zombie has Katie!” Travis turned to see what was going on and went very white. He grabbed the first thing he saw on the bar. Falling to his knees, he began to stab the dead hand as hard as he could with the corkscrew. “Fuck!” Roger was beginning to lose his fight to keep one of the heavy tables up as four zombies growled and reached for him. Jenni turned and fired as the table was righted. She and Roger ended up staring over the table at the zombies. Katie struggled to find anything to grip onto as the zombie kept pulling on her foot and drawing her leg closer to the gap that would bring it into the open. Katarina picked up a chair and hurled it at one of the zombies trying to climb over the tabletop toward Jenni and Roger. It was hit square in the face. It rolled off the table and tried to crawl under it. Roger shoved the table back over and pinned the zombie under it. Jenni fired point blank into its head, then aimed over the edge of the table at the remaining ones, firing a little wildly, but managing to kill them. “Someone shoot this sonofabitch!” Travis kept stabbing the grayish dead hand as hard as he could, breaking bones and tendons. Still, it pulled Katie’s foot. It almost had her whole booted foot in the open now and was obviously aiming to get to the more tender calf. “I can’t get a clear shot,” Nerit responded. More shots, more growls, more people swearing. Katie grabbed hold of Travis, trying to pull herself free from the unrelenting grasp of the zombie. Suddenly, there was silence. “That’s it,” Katarina whispered in awe. “Gawddamn, fuckin\u0027 zombies!” Shane cursed and threw his table over onto the dead creatures. “We have this fucker left,” Travis shouted. The zombie’s other hand slid through the gap, grabbed Katie’s ankle, and yanked her leg out into the open with one swift pull. “Fuck!” “Travis!” Travis shoved the table over onto the zombie. Mike and Roger grabbed Katie and yanked her free. An enormous zombie was growling, still after its prey as it reached for Katie desperately. It wiggled back and forth under the table. Jenni ran over and jumped on top of the table and began hopping up and down on it. Roger laughed and joined her, the table seesawing dangerously. Katarina got on the table, braced herself on the wall and jumped up and down as hard as she could. Mike added his weight as well, grinning. The others joined in, almost hysterical smiles on their faces, as the adrenaline rush in the veins spurred them on. As they slowly crushed the zombie beneath the table into mush, its bones cracking under their weight, they did a jovial little dance of death. Nerit let herself down from the bar slowly, cursing in Hebrew, while Travis helped Katie to her feet. Looking across the room, Katie was overcome by the stench of death and the gore that was splattered everywhere. There was a loud, sickening popping noise from under the table, and the zombie’s growls ended. Katie ran into the kitchen and threw up in the sink. She was shaking hard, her hands trembling, her stomach recoiling at what had just happened, and her near death. “Well,” Jenni’s voice said from the other room, “I’m glad I’m not cleaning up this mess.” 4. Words are Dangerous Juan helplessly stood outside along with everyone else that was not part of the original entry teams. There was an utter sense of horror and desperation that gripped them as they listened to the gunfire within the hotel and the unholy sounds that accompanied it. Like the others, he could not take his eyes off the closed door into the janitor’s closet. Through the padlocked gate, the painted bluishgray door, splashed with dried blood, seemed ominous. What if it cracked open and those things poured through into the small courtyard? Suddenly, the wrought iron gate seemed inconsequential. His grip tightened on his gun as he lifted his walkie-talkie to his mouth. He hesitated, realizing that in the midst of battle the last thing they needed was him yelling for them to report in. Then, as quickly as the gunshots had erupted, there was silence. He immediately pressed the button, “What the fuck happened?” There was a long pause, static, laughter, and then, finally, Mike’s voice came through the static. “We got swarmed, but we’re okay now. I have a feeling that every zombie outside of a locked door headed our way.” Juan was about to ask about Jenni when he heard her voice plainly. He felt the tight knots in his back release. “Did we lose anyone?” “Yeah, Mark and Wallace.” “Damn.” “We’re going to need to start room to room now. Send in the backup teams and have them meet me in the lobby. Still use caution, there could be stragglers,” Mike’s voice said through the static. Juan heard Jenni yell, “Love you, babe” and he smiled slightly. “Okay, sending them in. Take care of yourselves.” Turning, he motioned to Bill and Curtis to head in with their teams. Glancing toward Jason, he gave the boy a slight smile. “Your Mom’s okay.” “I know,” the teenager said in a quiet, distrustful tone. Juan hesitated, then shrugged. The kid hated him and he knew it, but at least the boy still had his Mom and he still had his loca. He watched Bill and Curtis’ team disappear into the building and felt the knots in his back return. Ashley stood quietly to one side as everyone flipped the tables back over and began the process of making sure the zombies were truly dead. Caution was the key word, and everyone was very careful. But their aim had been true and the many dead were finally at peace. During the fracas, Ashley and Ned had been constantly reloading guns. It wasn’t until toward the end, she had ended up helping brace a table. Now she stood looking at her fingers and the long scrape across them. Nearby, Jenni used a broken chair leg to bash in the last zombie’s head as a precaution. Meanwhile, Ashley just stared at her hand. It was just a scrape. That’s all it was. Just a scrape. Katie rinsed her mouth out with water from the faucet. It tasted odd, but Juan had explained the hotel used well water. Watching the water swirl down the drain, she ran her wet fingers over her brow and took a steadying breath. Of course, the kitchen reeked of death, so she threw up again. Finally, she was done. She wiped her mouth again and looked around. There were buffet bins filled with decayed food laid out for what was probably going to be a brunch. A large menu was tacked up on a board. Next to it was an easel with a large placard on it. “The Daughters of Texas present The Restoration of Historical Ashley Oaks.” it read at the top and listed the guest speakers.","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-12.html","bookId":2482,"book":{"id":2482,"title":"Fighting to Survive (As the World Dies #2)","description":"Storyline: Fighting to Survive (As the World Dies #2) Katie and Jenni have found new lives with the survivors of their makeshift fort, but danger still lurks. Nothing is easy in the new world where the dead walk and every day is a struggle to keep safe. As the elements, bandits, and the zombie horde threaten their safe haven, Jenni and Katie join the other survivors in fighting to survive as the world dies.","cover":"https://allnovel.net/images/fighting-to-survive-as-the-world-dies-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:56:45 PM"}}
