{"id":84291,"no":30,"title":"Page 30","content":"\n “I look at you and I want to save the world. I can’t help it,” he answered.\n “Are you sweet talking me again?” she lightly kidded.\n He laughed and shook his head. “No, no. I mean it. But I always had grandiose dreams.” His gaze grew more intense as he looked up at her. “Sometimes I get lucky and they come true.”\n Katie smiled softly at him and kissed him. He immediately responded and the kiss deepened as the passion rose quickly between them. Katie relished the feel of his lips and tongue against hers. As his hands slid up to unfasten her bra, she drew back long enough to whisper, “What about lunch?”\n “Later,” Travis whispered huskily, and kissed her again.\n It was hard to resist his touch and harder to resist her own desire for him. She felt absolutely intoxicated with him. As their kisses grew more fevered, they struggled to free each other from their clothes. The hunger for each other was so intense, they never made it close to Travis’ sofa bed or fully managed to undress.\n Chapter 10\n 1. Past, Present, Future\n Jenni was annoyed. Up three stories from street level on the fire escape of the hotel, she was on sentry duty overlooking where Main St. intersected Morris Avenue. It was way too hot and windy and the chair she had dragged out to sit on wasn’t very comfortable. This, on top of the insinuation that Juan was behind Jimmy joining the ranks of the undead, was really annoying.\n Slouching down in her chair, holding her rifle across her lap, and hooking her foot up on railing, she looked over the street as the wind blew her dark hair around her face. She wished a fucking zombie would show up so she could blow its head off. It would make her feel so much better.\n When the window opened and Katie slipped out, Jenni was surprised, but relieved.\n “Hey girlfriend!”\n “Hey,” Katie answered. She kissed Jenni’s forehead, then sat down on the windowsill and looked over the street. “Quiet, huh?”\n “I find myself craving zombies. Isn’t that twisted?”\n “It’s been a weird day,” Katie decided.\n “But lunch was good.”\n “Yeah, it was, wasn’t it?” Katie grinned, but her expression was odd.\n Jenni reached out and tapped her knee. “What’s up?”\n “Well,” Katie started slowly, as if measuring her thoughts before making them into words. “Travis and I just had some really intense, throw you up against the wall, earth-shattering sex.”\n “All right!” Jenni held out her hand for a high five.\n Katie looked at her hand, and added, “Without any protection.”\n “Oh, shit.” Jenni dropped her hand.\n “Yeah. We both really spaced it. Completely. I’m not sure he even realizes what happened.” Katie sighed softly.\n “Um…shit?”\n “Yeah. Shit.” Katie ran her hands over her face, then looked at Jenni. “Lesbian sex is not this complicated!”\n Jenni laughed and shook her head. “Nope, it\u0027s not. I mean your girlfriend can’t knock you up. It’s not like dildos come fully loaded with that baby making stuff.”\n Katie burst out laughing and covered her face with one hand. “Oh, gawd.”\n Jenni smiled, but then her expression grew as serious as her thoughts. “You okay?”\n With a nod, Katie sighed. “Yeah. I am. Weirdly. I don’t really feel panicked at all. I mean, honestly, I had not even thought about it. You know. Babies. But, I guess I have to. Travis…” She smiled at the sound of his name on her lips. “Travis is like Lydia. The one you keep until death parts you. He’s in my heart now and I guess I need to think like…uh…”\n “A straight woman,” Jenni offered.\n “A woman who can now have babies biologically with her mate and doesn’t have to worry about in vitro-fertilization and the proper donor.” Katie smiled at the memories of her and Lydia\u0027s discussion about making a family or not. They had opted not to in the end. “Now, right now, this could be it. Babyville.”\n “I’m sure we could find a pill down in the pharmacy stash,” Jenni offered.\n “No, no.” Katie shook her head. “No. If something happens then it happens. I’ll deal with it. We both will.”\n “You know, I have a feeling that Travis would love a baby with you,” Jenni said.\n “Me, too. Me, too. But what about you? You and Juan. Being careful?”\n “Tubes tied,” Jenni said sadly. “Stupid Lloyd didn’t want anymore kids. Of course, I had to be the one to face the knife, the bastard.”\n “Oh, Jenni, I\u0027m so sorry.”\n “It’s okay. I told Juan. He was real quiet then shrugged it off. Said it was kinda cool not to have to worry about condoms. Later on he said something about when people do start having kids that Hillary Clinton will have her wish because it will be a village, literally, raising them. I guess he figures that somehow he’ll get in on the kid thing. I mean, if you have a kid, I’m so gonna be Auntie Jenni.”\n “Oh, yeah, you will be,” Katie said with a wide grin. Her smile faded and she looked very thoughtful. “I’m madly in love with him.\n It’s different. Very different. I’m still adjusting. His body, his… smell…the way he touches me…all different, but I love him. I kept wanting to not love him, but I do. And if we have a baby out of our fuck up, I’m okay with that. Because…”\n Jenni reached out and hugged her as Katie started to cry. She smoothed her blond curls back, kissed her brow and held her close.\n Katie clung to her, sobbing, both happy and sad, and Jenni knew she just needed to hold her.\n “Hey, lesbos,” Shane’s voice said from afar. “Can you watch the fucking street instead of making out? We’re heading out again.”\n Jenni looked down to see Shane and three other men getting into a delivery truck. All day, they had been going in and out of the hotel since it appeared to be a slow day in zombieville. Already they had returned twice with truckloads of supplies.\n “Fuck off, Shane,” Jenni yelled down at him.\n “Save your pussy eating for later, bitch,” Shane responded.\n “Bite me, asshole,” Jenni shouted back.\n “I have no trouble smacking up a dyke. Trying to be all manly up there like you have a big cock,” Shane snapped back.\n “Somebody’s gotta since you\u0027re hung like a light switch,” Jenni retorted.\n “Fuck you, bitch.”\n Katie leaned over the rail next to Jenni. “You’re just jealous ‘cause the girls like me, not you.”\n Jenni saw such intense rage overwhelm Shane’s features that, for the first time, she felt afraid of him.\n He merely pointed at them and got into the driver’s seat of the truck. It roared down the street.\n “He’s such a scary fucktard,” Jenni said softly.\n “Why doesn’t someone throw him over the wall?” Katie muttered.\n They were both quiet for a while, sitting back down and staring over the streets. The wind was hot and the sky was growing overcast in the distance. Another summer thunderstorm was coming. “I wonder if the heat will make them rot faster,” Katie said after a while.\n “Yeah, I wish they were like Romero’s zombies.” Jenni wistfully sighed. “They’d be so much easier to deal with. What the hell?”\n A man was coming down the street on a scooter. Its engine was coughing and sputtering and the exhaust was a cloud of dark smoke.\n He was a tall man dressed in very old jeans and a leather jacket. On top of his head was a beat up, greasy straw cowboy hat that was warped out of its shape so badly it looked like a banana sitting on his head. Even from this great distance he looked dirty and smelly.\n “Who the hell is that?” Jenni stood up and tried to get a better view.\n Seeing her, the man waved to her and aimed the scooter toward them. Behind him, in the distance were some shambling shapes.\n Katie stood up beside Jenni and drew her pistol. “What does he think he’s doing?”\n The man cruised up to just under the fire escape. “Now, I am a tax paying citizen of not only this country, but the city and county as well and when the Mayor decides to steal my property be sending out rabid CIA clones to try to tear down my fence and get onto my property, I have a God given, constitutional right to defend my property. Now if you think I’m going to just sit back and not complain, you have another thing coming. I fully intend to speak with the police, even if they are a bunch of coke snorting, mafia thugs, about what the Mayor has been doing and I will have justice. I may have had to kill the clones, but I figure since they are clones they really don’t count as a life form. Besides, the mixture was bad on that batch and they had all sorts of things wrong with them…”\n The man spoke earnestly, in the voice of someone giving an interview with Larry King on a TV show, his hands moving eloquently as he talked.\n “Is he for real?” Jenni asked.\n “I think so,” Katie answered.\n “…and even if they are going to sit outside my house and snort up on coke so they don’t feel a damn thing, I will defend myself. A good knock to the head seems to do the trick. Took me awhile to figure that one out. But now that I know how the clones have got to be killed, I won’t have an issue with them. Now the aliens, well, they don’t die so easily…” \n","sourceLink":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2/page-30.html","bookId":2482,"book":{"id":2482,"title":"Fighting to Survive (As the World Dies #2)","description":"Storyline: \n Fighting to Survive (As the World Dies #2) \n Katie and Jenni have found new lives with the survivors of their makeshift fort, but danger still lurks. Nothing is easy in the new world where the dead walk and every day is a struggle to keep safe. As the elements, bandits, and the zombie horde threaten their safe haven, Jenni and Katie join the other survivors in fighting to survive as the world dies.\n \n","cover":"https://allnovel.net/images/fighting-to-survive-as-the-world-dies-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/fighting-to-survive-as-the-world-dies-2.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:56:45 PM"}}
