{"id":38493,"no":9,"title":"VIII. How Siegfried went to the Niblung Land for his Knights","content":"So thence to the strand and the haven Siegfried hied him away In the Hood of Darkness shrouded. Now a boat by the wharf-side lay, And thereinto from men’s eyes hidden stepped Siegfried Siegmund’s son, And he thrust it forth o’er the waters, as it were by a wind driven on. {p. 66} Now no one beheld that steersman, though swift was the barge’s flight Sped on by the strength of Siegfried, so passing-great was his might. Who marked it, deemed that it drifted before a strange strong wind: None dreamed it was driven of Siegfried the child of Siegelind. In the space of that day and the night-tide that followed was he brought To a certain land, by the mighty strength wherewithal he wrought. It was leagues full three-and-thirty, yea, more peradventure, away. This was the Land of the Niblungs, where he won the Hoard for a prey. Alone stepped forth the hero on to an eyot wide; And he fastened, that knight resourceful, the boat to the river-side. Then he passed unto where a castle stood on a craggy bent, And therein sought harbourage, even as a wayfarer toil-forspent. So he came before that burg-gate: fast locked and barred did it stand; For jealous aye for their honour were the warders of that land. On the massy door ’neath the gate-tower did the unknown one begin Straightway to beat, and his smiting roused up therewithin A mighty one and a giant, that there kept watch and ward, And night and day beside him his armour lay and his sword: And he spake: “Who knocketh so roughly on the burg-gate therewithout?” In a feigned voice Siegfried the valiant sent back the answering shout: “Up! I am a knight belated. Knave, open to me forthright, Else I with strokes heavy-handed shall gall a laggard wight Who loveth to keep his chamber and lie in the sluggard’s bed!” Then exceeding wroth was the warder for the word that Siegfried said. His armour hath that fierce giant in haste on his huge limbs done, And his helmet hath he settled on his head, that mighty one. In haste hath he snatched his buckler and the castle gate swung wide: In a fury of rage against Siegfried forth did he swiftly stride. “How dar’st thou wake,” he shouted, “all these of our gallant band?” Then fell fast-raining buffets, dealt by his mighty hand: From the shield of the noble stranger glanced fierce blows many and rude, Yet the steel shards flew from his shield-rim as the giant warder hewed {p. 67} With a massy mace of iron, that the thane was hard-bestead. Well-nigh began the hero the very death to dread At the smiting of that huge porter, as the lightning vehement. Yet was his liege-lord Siegfried with his faithfulness well content. So furious was their battling, the keep rang echoing round, And afar in the hall of King Niblung was heard the tempest-sound: Yet at last he o’ermastered the warder, and bound him foot and hand. —Ere long men laughed at the story through all the Niblung land. As the thunder of that conflict through the mountain’s heart far rolled, It was heard of the Dwarf, the dauntless Albrich, the tameless-souled. In haste he armed him, and thither he ran, and behold, he found That noble stranger-warrior, and the giant warder bound. Of fiery mood was Albrich, and mighty strength he had: In hauberk-rings and in helmet was his body for battle clad; And a morning-star huge-headed of gold had he gripped in his hand. With swift feet rushed he onward unto where did Siegfried stand. Seven balls spike-studded and massy by chains from the mace-head swung, Wherewith on the shield that the hero’s arm before him flung He hailed down blows so bitter that in fragments all it flew, So that somewhat adread that noble guest for his own life grew. The shield by that flail of battle shattered he flung from his hand, And he thrust back into the scabbard Balmung, the long keen brand: He would smite not therewith, lest his faithful seneschal should die; For aye was he noble-hearted, and the flower of chivalry. But the hero leapt upon Albrich with his strong bare hands alone, And fast by the beard he gripped him, that hoary-headed one, And he mightily plucked, that the Earth-dwarf shrieked for very pain, As the hero-knight tamed Albrich with his fingers’ bitter strain. Loud cried the erstwhile aweless: “Ah, leave my life unto me! Had I not to another hero sworn true fealty, And bowed myself in homage to be vassal to him for aye, Thee would I serve to my death-day,” did the crafty-wise one say. {p. 68} Then bound he Albrich, even as he bound that giant before: Of a truth the prowess of Siegfried galled him exceeding sore! Then asked the Dwarf of the hero: “I pray thee, how named art thou?” And he answered: “My name is Siegfried: thou hast heard that name, I trow.” Spake Albrich: “For these tidings of a truth mine heart is fain! Of thy strength, the strength of a hero, hast thou given proof again, Hast shown how well thou art worthy to be lord of the Niblung Land. So thou spare me for that I withstood thee, will I do all thy command.” Answered the good knight Siegfried: “Up then, and speedily Bring thou unto me my bravest which here in the fortress be, A thousand Niblungs: before me now would I see them brought.” But the cause for the which he desired them thus, he told him not. Then Albrich and the giant from their bonds the hero unbound; And the Dwarf to the place ran swiftly where the Niblung knights slept sound; And in eager haste he uproused them, the men of the Niblung array, Crying, “Up, ye heroes! to Siegfried your lord must ye go straightway.” Upsprang they from their couches, and they clad themselves with speed; And a thousand eager warriors stood arrayed in battle-weed; And he led them to where Prince Siegfried abode them in that great hall; And they gave to him loving greeting by word and by deed withal. They have kindled a hundred torches, they have poured the wine for their lord; And for that their speedy coming he thanked them with gracious word; And he said to them: “Now shall ye follow with me far hence oversea.” And those valiant knights and loyal consented willingly. Stout vassal-knights three thousand had gathered at his call, And of these he chose a thousand, the goodliest of them all; And their helmets were brought to the chosen, and all their harness of war, Forasmuch as their lord would lead them unto Brunhild’s land afar. And he spake: “O knights true-hearted, I would say unto you this thing: Ye must take rich raiment for wearing in the presence of Queen and King; {p. 69} For there shall ye look upon many a maiden fair to see: Therefore ye needs must adorn you with seemly bravery.” (C) Now perchance might a simple-one chide me—“Not sooth is this thy song! How might in the castle be gathered so vast a knightly throng? Wherewithal should all these be nourished, and whence purvey them attire? Though realms he had thirty, never had he brought to pass his desire.” (C) Tush!—surely ye know this—Siegfried was a passing-wealthy lord: He had that realm in possession, and his was the Niblung Hoard. So he gave to his war-thanes freely so much as they lacked, nay, more. How much he lavished soever, unminished still was his store. Lo, in the dimness of dawning forth on the sea they fare: —Ho for the eager warriors that Siegfried had gathered there!— With goodly battle-horses and lordly attire sailed they: So unto the land of Brunhild they came, a knightly array. On her battlements many a fair one stood gazing over the sea. Then spake that Daughter of Princes: “Knoweth any man who they be Whom yonder I see far fleeting o’er the waters in gallant show? How rich be the sails that waft them!—they be whiter than driven snow!” Then spake the Lord of Rhineland: “My royal train be these Whom I left as I journeyed hither not far behind overseas. I have sent to speed them hither: lo, now be they come, O Queen.” With wondering eyes the coming of those knightly guests was seen. Men saw on a ship’s prow Siegfried standing foremost of all In princely vesture: beside him was many a warrior tall. Then spake that Daughter of Princes: “Lord King, I pray thee, declare: Shall I greet these guests at their coming, or shall I from greeting forbear?” He said: “Thou shalt go to meet them with welcome in thy face Forth of thy palace-portals, that none may doubt of thy grace.” So did that Daughter of Princes according as Gunther bade: But cold and haughty greeting from Brunhild Siegfried had. So they gave them lodging, and safely laid by their battle-gear. And by this were guests so many there gathered from far and near, {p. 70} That for these too strait was the city as they thronged on every hand. And now would the valiant heroes fare home to Burgundia-land. Then spake that Daughter of Princes: “Unto him were I thankful-souled Who for me would deal out my bounty of my silver and my gold Unto my guests and King Gunther’s; for full is my treasury.” Then Dankwart, Giselher’s liegeman, made answer gallantly: “O noble Daughter of Princes, unto me commit the key, And I will deal forth thy treasure,” said the valiant thane, “for thee. If any cry out on the niggard, on me be all blame thrown!” —That Dankwart was open-handed, full soon was to all men known. When to Hagen’s brother committed was the key of her treasury, The hand of the hero scattered rich gifts all lavishly. Who craved but one mark only, on him was so much showered That the poor of the land through their life-days might aye live gladness-dowered. Pounds of silver uncounted by hundreds lavished he; And forth of her halls passed many in goodly bravery Who never before in their life-tide clad in such splendour went. But when Queen Brunhild heard it, was she passing ill-content. She arose and she spake unto Gunther the King: “I dare well say That nought is like to be left me of all my fair array Through your chamberlain’s reckless dealing: he squandereth all my gold! Whosoever should bridle his folly, to him were I thankful-souled. Yon thane, he dreameth, quotha!—such rich gifts doth he give— I have sent unto Death to take me! Nay, still am I minded to live. And as for the gold of my fathers, myself can waste it, I trow. Steward so open-handed never had queen ere now!” Then answered Hagen of Troneg: “Be it known, O Lady, to thee, Gold hath the King of Rhineland and raiment fair to see To bestow in such rich abundance, that in sooth he needeth not Of all the treasure of Brunhild to carry hence one jot.” {p. 71} “Now nay, by your love I charge you,” that Queen to the Rhine-lords spake, “With gold and with silken raiment coffers filled would I take Twice ten with me for my journey: myself with mine own hand Will bestow my royal bounty, when we come to Burgundia-land,” For the Queen then stored they the coffers with many a precious gem; And the chamberlains of Brunhild the while must be watching them: She would suffer not Gunther’s liegeman in the storing thereof to partake; And thereover Gunther and Hagen into merry laughter brake. “Now to whom,” said that Daughter of Princes, “shall I commit my land Ere we go? Be a warder appointed by mine and by thine hand.” Made answer Gunther the noble: “Summon thou hitherward Whomsoever thou pleasest: appoint him its governor and lord.” Then the Lady looked on her kinsmen, and beheld one nigh at hand, And the man was her mother’s brother; and to him gave she her command: “Now let my land and my castles be given in charge from this day Unto thee, till it please King Gunther to take them under his sway.” Out of the train of her vassals two thousand men chose she For them which should fare on the journey with her unto Burgundy With the thousand knights of the Niblungs that with Siegfried voyaged o’er. For the journey they made them ready: men saw them ride to the shore. Four-score and six fair ladies did she lead with her overseas, And withal a hundred maidens, and sweet to see were these. Now forth and away would they hasten; they would linger there no more; But of such as they took not with them many an one wept sore. In fashion as well befitteth a queen, so left she the land: She kissed her nearest and dearest at the last farewell by the strand. And so with fair leave-taking they launched on the northern main; And the ancient land of her fathers the maid saw never again. Still as they voyaged, joyance made music through all the way: With manifold merry pastime they whiled the hours away. {p. 72} They were wafted on to the outsea by a breeze that followed fast; And so with mirth and laughter from land unto land they passed. Yet not upon that voyage would she be King Gunther’s bride; But his bliss awhile must tarry until the bridal-tide In the Castle of Worms, at the stately marriage-festival, When with joy they should come with their heroes unto Gunther’s royal hall. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3304/90335.html","bookId":422,"book":{"id":422,"title":"The Lay of the Nibelung Men","description":"简介： If we accept as our definition of an Epic:(a) A long poem, (b) of an interest not less than national[1], describing (c) in noble language (d) a series of naturally and organically connected actions (e) of heroic actors, we shall find that, while we m...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3304","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
