{"id":95836,"no":21,"title":"Page 21","content":"Dragons was the theme. There were letters from the Cavern Club Exhibitions Committee and the Friendly Flamethrowers League. There were pamphlets and appeals from the Sunshine Sanctuary for Sick Dragons- “Poor little VINNY\u0027s fires were nearly Damped after Five years\u0027 Cruel Use as a Paint-Stripper, but now-” And there were requests for donations, and talks, and things that added up to a heart big enough for the whole world, or at least that part of it that had wings and breathed fire.\\n\\n If you let your mind dwell on rooms like this, you could end up being oddly sad and full of a strange, diffuse compassion which would lead you to believe that it might be a good idea to wipe out the whole human race and start again with amoebas.\\n\\n Beside the drift of paperwork was a book. Vimes twisted painfully and looked at the spine. It said: Diseases of the Dragon, by Sybil Deidre Olgivanna Ramkin.\\n\\n He turned the stiff pages in horrified fascination. They opened into another world, a world of quite stupefying problems. Slab Throat. The Black Tups. Dry Lung. Storge. Staggers, Heaves, Weeps, Stones. It was amazing, he decided after reading a few pages, that a swamp dragon ever survived to see a second sunrise. Even walking across a room must be reckoned a biological triumph.\\n\\n The painstakingly-drawn illustrations he looked away from hurriedly. You could only take so much innards.\\n\\n There was a knock at the door.\\n\\n “I say? Are you decent?” Lady Ramkin boomed cheerfully.\\n\\n “Er-”\\n\\n “I’ve brought you something jolly nourishing.”\\n\\n Somehow Vimes imagined it would be soup. Instead it was a plate stacked high with bacon, fried potatoes and eggs. He could hear his arteries panic just by looking at it.\\n\\n “I\u0027ve made a bread pudding, too,” said Lady Ramkin, slightly sheepishly. “I don\u0027t normally cook much, just for myself. You know how it is, catering for one.”\\n\\n Vimes thought about the meals at his lodgings. Somehow the meat was always grey, with mysterious tubes in it.\\n\\n “Er,” he began, not used to addressing ladies from a recumbent position in their own beds. “Corporal Nobbs tells me-”\\n\\n “And what a colourful little man Nobby is!” said Lady Ramkin.\\n\\n Vimes wasn\u0027t certain he could cope with this.\\n\\n “Colourful?” he said weakly.\\n\\n “A real character. We\u0027ve been getting along famously.”\\n\\n “You have?”\\n\\n “Oh, yes. What a great fund of anecdotes he has.”\\n\\n “Oh, yes. He\u0027s got that all right.” It always amazed Vimes how Nobby got along with practically everyone. It must, he\u0027d decided, have something to do with the common denominator. In the entire world of mathematics there could be no denominator as common as Nobby.\\n\\n “Er,” he said, and then found he couldn\u0027t leave this strange new byway, “you don\u0027t find his language a bit, er, ripe?”\\n\\n “Salty,” corrected Lady Ramkin cheerfully. “You should have heard my father when he was annoyed. Anyway, we found we\u0027ve got a lot in common. It\u0027s an amazing coincidence, but my grandfather once had his grandfather whipped for malicious lingering.”\\n\\n That must make them practically family, Vimes thought. Another stab of pain from his stricken side made him wince.\\n\\n “You\u0027ve got some very bad bruising and probably a cracked rib or two,” she said. \"If you roll over I\u0027ll put some more of this on.\u0027\u0027 Lady Ramkin flourished a jar of yellow ointment.\\n\\n Panic crossed Vimes\u0027s face. Instinctively, he raised the sheets up around his neck.\\n\\n “Don\u0027t play silly buggers, man,” she said. \"I shan\u0027t see anything I haven\u0027t seen before. One backside is pretty much like another. It\u0027s just that the ones I see generally have tails on. Now roll over and up with the nightshirt. It belonged to my grandfather, you know.\u0027\u0027\\n\\n There was no resisting that tone of voice. Vimes thought about demanding that Nobby be brought in as a chaperon, and then decided that would be even worse.\\n\\n The cream burned like ice.\\n\\n “What is it?”\\n\\n “All kinds of stuff. It\u0027ll reduce the bruising and promote the growth of healthy scale.”\\n\\n “What?”\\n\\n \"Sorry. Probably not scale. Don\u0027t look so worried.\\n\\n I\u0027m almost positive about that. Okay, all done.\" She gave him a slap on the rump.\\n\\n “Madam, I am Captain of the Night Watch,” said Vimes, knowing it was a bloody daft thing to say even as he said it.\\n\\n “Half naked in a lady\u0027s bed, too,” said Lady Ramkin, unmoved. “Now sit up and eat your tea. We\u0027ve got to get you good and strong.”\\n\\n Vimes\u0027s eyes filled with panic.\\n\\n “Why?” he said.\\n\\n Lady Ramkin reached into the pocket of her grubby jacket.\\n\\n “I made some notes last night,” she said. “About the dragon.”\\n\\n “Oh, the dragon.” Vimes relaxed a bit. Right now the dragon seemed a much safer prospect.\\n\\n “And I did a bit of working out, too. I\u0027ll tell you this: it\u0027s a very odd beast. It shouldn\u0027t be able to get airborne.”\\n\\n “You\u0027re right there.”\\n\\n “If it\u0027s built like swamp dragons, it should weigh about twenty tons. Twenty tons! It\u0027s impossible. It\u0027s all down to weight and wingspan ratios, you see.”\\n\\n “I saw it drop off the tower like a swallow.”\\n\\n \u0027 \u0027I know. It should have torn its wings off and left a bloody great hole in the ground,“ said Lady Ramkin firmly. ”You can\u0027t muck about with aerodynamics. You can\u0027t just scale up from small to big and leave it at that, you see. It\u0027s all a matter of muscle power and lifting surfaces.\"\\n\\n “I knew there was something wrong,” said Vimes, brightening up. “And the flame, too. Nothing goes around with that kind of heat inside it. How do swamp dragons manage it?”\\n\\n “Oh, that\u0027s just chemicals,” said Lady Ramkin dismissively. “They just distill something flammable from whatever they’ve eaten and ignite the flame just as it comes out of the ducts. They never actually have fire inside them, unless they get a case of blowback.” “What happens then?”\\n\\n “You\u0027re scraping dragon off the scenery,” said Lady Ramkin cheerfully. “I\u0027m afraid they\u0027re not very well-designed creatures, dragons.” Vimes listened.\\n\\n They would never have survived at all except that their home swamps were isolated and short of predators. Not that a dragon made good eating, anyway-once you\u0027d taken away the leathery skin and the enormous flight muscles, what was left must have been like biting into a badly-run chemical factory. No wonder dragons were always ill. They relied on permanent stomach trouble for supplies of fuel. Most of their brain power was taken up with controlling the complexities of then- digestion, which could distill flame-producing fuels from the most unlikely ingredients. They could even rearrange their internal plumbing overnight to deal with difficult processes. They lived on a chemical knife-edge the whole time. One misplaced hiccup and they were geography.\\n\\n And when it came to choosing nesting sites, the females had all the common sense and mothering instinct of a brick.\\n\\n Vimes wondered why people had been so worried about dragons in the olden days. If there was one in a cave near you, all you had to do was wait until it self-ignited, blew itself up, or died of acute indigestion.\\n\\n “You\u0027ve really studied them, haven\u0027t you,” he said.\\n\\n “Someone ought to.”\\n\\n “But what about the big ones?”\\n\\n “Golly, yes. They\u0027re a great mystery, you know,” she said, her expression becoming extremely serious.\\n\\n “Yes, you said.”\\n\\n “There are legends, you know. It seems as though one species of dragon started to get bigger and bigger and then . . . just vanished.”\\n\\n “Died out, you mean?”\\n\\n “No . . . they turned up, sometimes. From somewhere. Full of vim and vigour. And then, one day, they stopped coming at all.” She gave Vimes a triumphant look. “I think they found somewhere where they could really be. ”\\n\\n “Really be what?”\\n\\n “Dragons. Where they could really fulfil their potential. Some other dimension or something. Where the gravity isn\u0027t so strong, or something.”\\n\\n “I thought when I saw it,” said Vimes, “I thought, you can\u0027t have something that flies and has scales like that.”\\n\\n They looked at each other.\\n\\n “We\u0027ve got to find it in its lair,” said Lady Ramkin.\\n\\n “No bloody flying newt sets fire to my city,” said Vimes.\\n\\n “Just think of the contribution to dragon lore,” said Lady Ramkin.\\n\\n “Listen, if anyone ever sets fire to this city, it\u0027s going to be me. ”\\n\\n “It\u0027s an amazing opportunity. There\u0027s so many questions ...”\\n\\n “You\u0027re right there.” A phrase of Carrot\u0027s crossed Vimes\u0027s mind. “It can help us with our enquiries,” he suggested.\\n\\n “But in the morning,” said Lady Ramkin firmly.\\n\\n Vimes\u0027s look of bitter determination faded.\\n\\n “I shall sleep downstairs, in the kitchen,” said Lady Ramkin cheerfully. “I usually have a camp bed made up down there when it\u0027s egg-laying time. Some of the females always need assistance. Don\u0027t you worry about me.”\\n\\n “You\u0027re being very helpful,” Vimes muttered.\\n\\n “I\u0027ve sent Nobby down to the city to help the others set up your headquarters,” said Lady Ramkin.\\n\\n Vimes had completely forgotten die Watch House. “It must have been badly damaged,” he ventured.\\n\\n “Totally destroyed,” said Lady Ramkin. “Just a patch of melted rock. So I\u0027m letting you have a place in Pseudopolis Yard.”\\n\\n “Sorry?”\\n\\n “Oh, my father had property all over the city,” she said. “Quite useless to me, really. So I told my agent to give Sergeant Colon the keys to the old house in Pseudopolis Yard. It\u0027ll do it good to be aired.”\\n\\n “But that area-I mean, there\u0027s real cobbles on the streets-the rent alone, I mean, Lord Vetinari won\u0027t-”\\n\\n “Don\u0027t you worry about it,” she said, giving him a friendly pat. “Now, you really ought to get some sleep.”\\n\\n Vimes lay in bed, his mind racing. Pseudopolis Yard was on the Ankh side of the river, in quite a high-rent district. The sight of Nobby or Sergeant Colon walking down the street in daylight would probably have the same effect on the area as the opening of a plague hospital.\\n\\n He dozed, gliding in and out of a sleep where giant dragons pursued him waving jars of ointment . . .\\n\\n And awoke to the sound of a mob.\\n\\n Lady Ramkin drawing herself up haughtily was not a sight to forget, although you could try. It was like watching continental drift in reverse as various subcontinents and islands pulled themselves together to form one massive, angry protowoman.\\n\\n The broken door of the dragon house swung on its hinges. The inmates, already as highly strung as a harp on amphetamines, were going mad. Little gouts of flame burst against the metal plates as they stampeded back and forth in their pens. “Hwhat,” she said, “is the meaning of this?” If a Ramkin had ever been given to introspection she\u0027d have admitted that it wasn\u0027t a very original line.\\n\\n But it was handy. It did the job. The reason that cliches become cliches is that they are the hammers and screwdrivers in the toolbox of communication.\\n\\n The mob filled the broken doorway. Some of it was waving various sharp implements with the up-and-down motion proper to rioters. \\n\\n","sourceLink":"https://allnovel.net/guards-guards-discworld-8/page-21.html","bookId":1627,"book":{"id":1627,"title":"Guards! Guards! (Discworld #8)","description":"Storyline: Guards! Guards! (Discworld #8) \\n Here there be dragons . . . and the denizens of Ankh-Morpork wish one huge firebreather would return from whence it came. Long believed extinct, a superb specimen of draco nobilis (\"noble dragon\" for those who don\u0027t understand italics) has appeared in Discworld\u0027s greatest city. Not only does this unwelcome visitor have a nasty habit of charbroiling everything in its path, in rather short order it is crowned King (it is a noble dragon, after all . . .).\\n","cover":"https://allnovel.net/images/guards-guards-discworld-8.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/guards-guards-discworld-8.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:16:48 PM"}}
