{"id":95823,"no":8,"title":"Page 8","content":"Vimes saluted. The black depression that always lurked ready to take advantage of his sobriety moved in on his tongue.\\n\\n “Right you are, Mr Secretary, ” he said. “I\u0027ll see to it that he learns that arresting thieves is against the law. ”\\n\\n He wished he hadn\u0027t said that. If he didn\u0027t say things like that he\u0027d have been better off now. Captain of the Palace Guard, a big man. Giving him the Watch had been the Patrician\u0027s little joke. But Wonse was already reading a new document on his desk. If he noticed the sarcasm, he didn\u0027t show it.\\n\\n “Very good, ” he said.\\n\\n Dearest Mother [Carrot wrote] It has been a much better day. I went into the Thieves\u0027 Guild and arrested the chief Miscreant and dragged him to the Patrician\u0027s Palace. No more trouble from him, I fancy. And Mrs Palm says I can stay in the attic because, it is always useful to have a man around the place. This was because, in the night, there were men the Worse for Drink making a Fuss in one of the Girl\u0027s Rooms, and I had to speak to them and they Showed Fight and one of them tried to hurt me with his knee but I had the Protective and Mrs Palm says he has broken his Patella but I needn\u0027t pay for a new one.\\n\\n I do not understand some of the Watch duties. I have a partner, his name is Nobby. He says I am too keen. He says I have got a lot to learn. I think this is true, because, I have only got up to Page 326 in, The Laws and Ordinances of the Cities of Ankh and Morpork. Love to all, Your Son, Carrot.\\n\\n PS. Love to Minty.\\n\\n It wasn\u0027t just the loneliness, it was the back-to-front way of living. That was it, thought Vimes.\\n\\n The Night Watch got up when the rest of the world was going to bed, and went to bed when dawn drifted over the landscape. You spent your whole time in the damp, dark streets, in a world of shadows. The Night Watch attracted the kind of people who for one reason or another were inclined to that kind of life.\\n\\n He reached the Watch House. It was an ancient and surprisingly large building, wedged between a tannery and a tailor who made suspicious leather goods. It must have been quite imposing once, but quite a lot of it was now uninhabitable and patrolled only by owls and rats. Over the door a motto in the ancient tongue of the city was now almost eroded by time and grime and lichen, but could just be made out:\\n\\n FABRICATI DIEM, PVNC\\n\\n It translated-according to Sergeant Colon, who had served in foreign parts and considered himself an expert on languages-as \u0027To Protect and to Serve\u0027.\\n\\n Yes. Being a guard must have meant something, once.\\n\\n Sergeant Colon, he thought, as he stumbled into the musty gloom. Now there was a man who liked the dark. Sergeant Colon owed thirty years of happy marriage to the fact that Mrs Colon worked all day and Sergeant Colon worked all night. They communicated by means of notes. He got her tea ready before he left at night, she left his breakfast nice and hot in the oven in the mornings. They had three grown-up children, all born, Vimes had assumed, as a result of extremely persuasive handwriting.\\n\\n And Corporal Nobbs... well, anyone like Nobby had unlimited reasons for not wishing to be seen by other people. You didn\u0027t have to think hard about that. The only reason you couldn\u0027t say that Nobby was close to the animal kingdom was that the animal kingdom would get up and walk away.\\n\\n And then, of course, there was himself. Just a skinny, unshaven collection of bad habits marinated in alcohol. And that was the Night Watch. Just the three of them. Once there had been dozens, hundreds. And now-just three.\\n\\n Vimes fumbled his way up the stairs, groped his way into his office, slumped into the primeval leather chair with its prolapsed stuffing, scrabbled at the bottom drawer, grabbed bottle, bit cork, tugged, spat out cork, drank. Began his day.\\n\\n The world swam into focus.\\n\\n Life is just chemicals. A drop here, a drip there, everything\u0027s changed. A mere dribble of fermented juices and suddenly you\u0027re going to live another few hours.\\n\\n Once, in the days when this had been a respectable district, some hopeful owner of the tavern next door had paid a wizard a considerable sum of money for an illuminated sign, every letter a different colour. Now it worked erratically and sometimes short-circuited in the damp. At the moment the E was a garish pink and flashed on and off at random.\\n\\n Vimes had grown accustomed to it. It seemed like part of life.\\n\\n He stared at the flickering play of light on the crumbling plaster for a while, and then raised one sandalled foot and thumped heavily on the floorboards, twice.\\n\\n After a few minutes a distant wheezing indicated that Sergeant Colon was climbing the stairs.\\n\\n Vimes counted silently. Colon always paused for six seconds at the top of the flight to get some of his breath back.\\n\\n On the seventh second the door opened. The sergeant\u0027s face appeared around it like a harvest moon.\\n\\n You could describe Sergeant Colon like this: he was the sort of man who, if he took up a military career, would automatically gravitate to the post of sergeant. You couldn\u0027t imagine him ever being a corporal. Or, for that matter, a captain. If he didn\u0027t take up a military career, then he looked cut out for something like, perhaps, a sausage butcher; some job where a big red face and a tendency to sweat even in frosty weather were practically part of the specification.\\n\\n He saluted and, with considerable care, placed a scruffy piece of paper on Vimes\u0027s desk and smoothed it out.\\n\\n “Evenin\u0027, Captain, ” he said. “Yesterday\u0027s incident reports, and that. Also, you owe fourpence to the Tea Club. ”\\n\\n “What\u0027s this about a dwarf, Sergeant?” said Vimes abruptly.\\n\\n Colon\u0027s brow wrinkled. “What dwarf?”\\n\\n “The one who\u0027s just joined the Watch. Name of-” Vimes hesitated-“Carrot, or something. ”\\n\\n “Him?” Colon\u0027s mouth dropped open. “He\u0027s a dwarf? I always said you couldn\u0027t trust them little buggers! He fooled me all right, Captain, the little sod must of lied about his height!” Colon was a sizeist, at least when it came to people smaller than himself.\\n\\n “Do you know he arrested the President of the Thieves\u0027 Guild this morning?”\\n\\n “What for?”\\n\\n “For being president of the Thieves\u0027 Guild, it seems. ”\\n\\n The sergeant looked puzzled. “Where\u0027s the crime in that?”\\n\\n “I think perhaps I had better have a word with this Carrot, ” said Vimes.\\n\\n “Didn\u0027t you see him, sir?” said Colon. “He said he\u0027d reported to you, sir. ”\\n\\n “I, uh, must have been busy at the time. Lot on my mind, ” said Vimes.\\n\\n “Yes, sir, ” said Colon, politely. Vimes had just enough self-respect left to look away and shuffle the strata of paperwork on his desk.\\n\\n “We\u0027ve got to get him off the streets as soon as possible, ” he muttered. “Next thing you know he\u0027ll be bringing in the chief of the Assassins\u0027 Guild for bloody well killing people! Where is he?”\\n\\n “I sent him out with Corporal Nobbs, Captain. I said he\u0027d show him the ropes, sort of thing. ”\\n\\n “You sent a raw recruit out with Nobby?” said Vimes wearily.\\n\\n Colon stuttered. “Well, sir, experienced man, I thought, Corporal Nobbs could teach him a lot-”\\n\\n “Let\u0027s just hope he\u0027s a slow learner, ” said Vimes, ramming his brown iron helmet on his head. “Come on. ”\\n\\n When they stepped out of the Watch House there was a ladder against the tavern wall. A bulky man at the top of it swore under his breath as he wrestled with the illuminated sign.\\n\\n “It\u0027s the E that doesn\u0027t work properly, ” Vimes called up.\\n\\n “What?”\\n\\n “The E. And the T sizzles when it rains. It\u0027s about time it was fixed. ”\\n\\n “Fixed? Oh. Yes. Fixed. That\u0027s what I\u0027m doing all right. Fixing. ”\\n\\n The Watch men splashed off through the puddles.\\n\\n Brother Watchtower shook his head slowly, and turned his attention once again to his screwdriver.\\n\\n Men like Corporal Nobbs can be found in every armed force. Although their grasp of the minutiae of the Regulations is usually encyclopedic, they take good care never to be promoted beyond, perhaps, corporal. He tended to speak out of the corner of his mouth. He smoked incessantly but the weird thing, Carrot noticed, was that any cigarette smoked by Nobby became a dog-end almost instantly but remained a dog-end indefinitely or until lodged behind his ear, which was a sort of nicotine Elephant\u0027s Graveyard. On the rare occasions he took one out of his mouth he held it cupped in his hand.\\n\\n He was a small, bandy-legged man, with a certain resemblance to a chimpanzee who never got invited to tea parties.\\n\\n His age was indeterminate. But in cynicism and general world weariness, which is a sort of carbon dating of the personality, he was about seven thousand years old.\\n\\n “A cushy number, this route, ” he said, as they strolled along a damp street in the merchants\u0027 quarter. He tried a doorhandle. It was locked. “You stick with me, ” he added, “and I\u0027ll see you\u0027re all right. Now, you try the handles on the other side of the street. ”\\n\\n “Ah. I understand, Corporal Nobbs. We\u0027ve got to see if anyone\u0027s left their store unlocked, ” said Carrot.\\n\\n “You catch on fast, son. ”\\n\\n “I hope I can apprehend a miscreant in the act, ” said Carrot zealously.\\n\\n “Er, yeah, ” said Nobby, uncertainly.\\n\\n “But if we find a door unlocked I suppose we must summon the owner, ” Carrot went on. “And one of us would have to stay to guard things, right?”\\n\\n “Yeah?” Nobby brightened. “I\u0027ll do that, ” he said.\\n\\n “Don\u0027t you worry about it. Then you could go and find the victim. Owner, I mean. ”\\n\\n He tried another doorknob. It turned under his grip.\\n\\n “Back in the mountains, ” said Carrot, “if a thief was caught, he was hung up by the-”\\n\\n He paused, idly rattling a doorknob.\\n\\n Nobby froze.\\n\\n “By the what?” he said, in horrified fascination.\\n\\n “Can\u0027t remember now, ” said Carrot. “My mother said it was too good for them, anyway. Stealing is Wrong. ”\\n\\n Nobby had survived any number of famous massacres by not being there. He let go of the doorknob, and gave it a friendly pat.\\n\\n “Got it!” said Carrot. Nobby jumped.\\n\\n “Got what?” he shouted.\\n\\n “I remember what we hang them up by, ” said Carrot.\\n\\n “Oh, ” said Nobby weakly. “Where?”\\n\\n “We hang them up by the town hall, ” said Carrot. “Sometimes for days. They don\u0027t do it again, I can tell you. And Bjorn Stronginthearm\u0027s your uncle. ”\\n\\n Nobby leaned his pike against the wall and fumbled a fag-end from the recesses of his ear. One or two things, he decided, needed to be sorted out.\\n\\n “Why did you have to become a guard, lad?” he said.\\n\\n “Everyone keeps on asking me that, ” said Carrot. “I didn\u0027t have to. I wanted to. It will make a Man of me. ”\\n\\n Nobby never looked anyone directly in the eye. He stared at Carrot\u0027s right ear in amazement.\\n\\n “You mean you ain\u0027t running away from anything?” he said.\\n\\n “What would I want to run away from anything for?”\\n\\n Nobby floundered a bit. “Ah. There\u0027s always something. Maybe-maybe you was wrongly accused of something. Like, maybe, ” he grinned, “maybe the stores was mysteriously short on certain items and you was unjustly blamed. Or certain items was found in your kit and you never knew how they got there. That sort of thing. You can tell old Nobby. Or, \u0027\u0027 he nudged Carrot, ”p\u0027raps it was something else, eh? Shershay la fern, eh? Got a girl into trouble?\" \\n\\n","sourceLink":"https://allnovel.net/guards-guards-discworld-8/page-8.html","bookId":1627,"book":{"id":1627,"title":"Guards! Guards! (Discworld #8)","description":"Storyline: Guards! Guards! (Discworld #8) \\n Here there be dragons . . . and the denizens of Ankh-Morpork wish one huge firebreather would return from whence it came. Long believed extinct, a superb specimen of draco nobilis (\"noble dragon\" for those who don\u0027t understand italics) has appeared in Discworld\u0027s greatest city. Not only does this unwelcome visitor have a nasty habit of charbroiling everything in its path, in rather short order it is crowned King (it is a noble dragon, after all . . .).\\n","cover":"https://allnovel.net/images/guards-guards-discworld-8.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/guards-guards-discworld-8.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:16:48 PM"}}
