{"id":38288,"no":16,"title":"CHAPTER XVI. AT THE STAKE.","content":"IT was on the evening of the fifth day after her capture by the Indians, that Ethel Hardy rode into a wide valley in the heart of the mountains. It was entered by a narrow gorge, through which ran a stream. Beyond this the hill receded, forming a nearly circular basin a mile in diameter, from the sides of which the rocks ascended almost perpendicularly, so that the only means of entering it was through the gorge. Clumps of trees were scattered everywhere about, and nearly in the centre stood a large Indian village, numbering about three hundred lodges, the population of which, consisting almost entirely of women and children, came out with shrill cries of welcome to meet the returning band. This was two hundred- 326 - strong. Before them they drove about four hundred cattle and fifteen hundred sheep. In the midst of the band Ethel Hardy rode, apparently unwatched, and forming part of it. The girl was very pale, and turned even more so at the wild yells of triumph which rose around her, when those who had been left behind learned how signal had been the success of their warriors, and heard that the captive in their midst was one of the family which had inflicted such terrible loss upon the tribe two years previously. Fortunately she could not understand the volleys of threats and curses which the women of the tribe heaped upon her, although she could not mistake their furious ejaculations. Ethel had cried at first until she could cry no more, and had now nerved herself for the worst. She had heard that the Indians have neither mercy nor pity for any one who may exhibit fear of death; she knew that no entreaties or tears would move them in the slightest, but that courage and firmness would at any rate command their respect and admiration. She had therefore schooled herself to show no emotion when the time came; and now, except that she had given an involuntary shudder at the sight of the gesticulating throng, she betrayed no sign whatever of her emotion, but looked round so calmly- 327 - and unflinchingly, that the violent abuse and gesticulations died away in a murmur of admiration of the pale-faced child who looked so calmly on death. Ethel\u0027s Capture by the Indians. Ethel’s Capture by the Indians.—Page 327. Nevertheless, as the troop drew up in front of the council hut, and alighted, the women pressed round as usual to heap abuse upon the prisoner; but one of the Indians stepped up to her, and waved them back, and saying, ‘She is the child of a great chief,’ took her by the arm, and handed her over to the care of the wife of one of the principal chiefs. The selection was a good one; for the woman, who was young, was known in the tribe as the Fawn for her gentle disposition. She at once led the captive away to her lodge, where she bade her sit down, offered her food, and spoke kindly to her in her low, soft, Indian tongue. Ethel could not understand her, but the kindly tones moved her more than the threats of the crowd outside had done, and she broke down in a torrent of tears. The Indian woman drew the girl to her as a mother might have done, stroked her long fair hair, and soothed her with her low talk. Then she motioned to a pile of skins in the corner of the hut; and when Ethel gladly threw herself down upon them, the Indian woman covered her up as she would have done a child, and with a nod of farewell tripped off to welcome her- 328 - husband and hear the news, knowing that there was no possibility of the captive making her escape. Exhausted with fatigue and emotion, Ethel’s sobs soon ceased, and she fell into a sound sleep. Of that terrible catastrophe at the Mercers’ she had but a confused idea. They were sitting round the table talking, when, without the slightest notice or warning, the windows and doors were burst in, and dozens of dark forms leapt into the room. She saw Mr. Mercer rush to the wall and seize his pistols, and then she saw no more. She was seized and thrown over the shoulder of an Indian before she had time to do more than leap to her feet. There was a confused whirl of sounds around her,—shrieks, threats, pistol shots, and savage yells,—then the sounds swam in her ears, and she fainted. When she recovered consciousness, she found that she was being carried on a horse before her captor, and that the air was full of a red glare, which she supposed to arise from a burning house. On the chief, who carried her, perceiving that she had recovered her senses, he called to one of his followers, who immediately rode up, bringing a horse upon which a sidesaddle had been placed. To this Ethel was transposed, and in another minute was galloping along by the side of her captor.- 329 - Even now she could hardly persuade herself that she was not dreaming. That instantaneous scene at the Mercers’,—those confused sounds,—this wild cavalcade of dark figures who rode round her,—could not surely be real. Alas! she could not doubt it; and as the thought came across her, What would they say at home when they heard it? she burst into an agony of silent tears. Towards daybreak she was often startled to hear the words, ‘Hope, Ethel, hope!’ in Spanish distinctly spoken close to her. She turned hastily, but there rode the dark forms as usual. Still, she felt sure that she was not mistaken. Her own name she had distinctly heard; and although she could not form a conjecture who this unknown friend could be, still it was a great consolation to her to feel that she had at any rate one well-wisher among her enemies. He had told her to hope, too; and Ethel’s spirits, with the elasticity of youth, rose at the word. Why should she not hope? she thought. They were sure to hear it at home next morning, even if no one escaped and took them the news earlier; and she was certain that within a few hours of hearing it her father and friends would be on their trail. Before the night fell, at latest, they would be assembled. Twenty-four hours’ start would be the utmost that the Indians could- 330 - possibly obtain, and her friends would travel as fast or faster than they could, for they would be free from all encumbrances. How far she was to be taken she could not say, but she felt sure that in a week’s travelling her friends would make up for the day lost at starting. She knew that they might not be able to attack the Indians directly they came up, for they could not be a very strong party, whereas the Indians were several hundreds strong; but she believed that sooner or later, in some way or other, her father and brothers would come to her rescue. Ethel from that time forward did not doubt for a moment. Trusting thus firmly in her friends, she gained confidence and courage; and when the troops halted at nine in the morning, after nine hours’ riding, Ethel was able to look round with some sort of curiosity and interest. It was here that an incident occurred, which, although she knew it not at the time, entirely altered her destination and prospects. She was sitting upon the ground, when a man, who by his bearing appeared to be the principal chief present, passed in earnest talk with another chief. In the latter she recognised at once one of the wounded Indian prisoners. ‘Tawaina,’ she said, leaping to her feet.- 331 - He paid no attention to her call, and she repeated it in a louder tone. The principal chief stopped; Tawaina did the same. Then he walked slowly towards the captive. ‘Save me, Tawaina,’ she said, ‘and send me back again home.’ Tawaina shook his head. ‘Not can,’ he said. ‘Tawaina friend. Help some time,—not now.’ And he turned away again. ‘Does the Raven know the White Bird,’ the chief asked him, ‘that she sings his name?’ Tawaina paused and said,— ‘Tawaina knows her. Her father is the great white brave.’ The Indian chief gave a bound of astonishment and pleasure. ‘The white brave with the shooting flames?’ Tawaina nodded. The Raven’s meeting with Ethel had been apparently accidental, but was in reality intentional. Her actual captor was one of the chiefs, although not the principal one, of the Pampas Indians; and in the division of the spoil, preparations for which were going on, there was no doubt that she would be assigned to that tribe, without any question upon the part of the Raven’s people.- 332 - Now, however, that the Stag knew who the prisoner was, he determined to obtain her for his tribe. He therefore went direct to the chief of the Pampas Indians, and asked that the white girl might fall to his tribe. The chief hesitated. ‘She is our only captive,’ he said. ‘The people will like to see her, and she will live in the lodge of the Fox, who carried her off.’ ‘The Stag would like her for a slave to his wife. He will give fifty bullocks and two hundred sheep to the tribe, and will make the Fox’s heart glad with a present.’ The offer appeared so large for a mere puny girl, that the chief assented at once; and the Fox was content to take a gun, which proved part of the spoil, for his interest in his captive. The Indians of the Stag’s tribe murmured to themselves at this costly bargain upon the part of their chief. However, they expressed nothing of this before him, and continued the work of counting and separating the animals in proportion to the number of each tribe present,—the tribes from the plains being considerably the more numerous. Not until four o’clock were they again in motion, when each tribe started direct for home.- 333 - In three hours’ riding they reached the spring, and then the Stag ordered a small tent of skins to be erected for Ethel’s accommodation. From this she came out an hour later to gaze upon the great wave of fire which, kindled at a point far away by their scouts, now swept along northward, passing at a distance of three or four miles from the spring. It was when sitting gravely round the fire later on, that the Stag deigned to enlighten his followers as to his reasons for giving what seemed to them so great a price for a pale-faced child. The delight of the Indians, when they found that they had the daughter of their twice victorious enemy in their hands, was unbounded. Vengeance is to the Indian even more precious than plunder; and the tribe would not have grudged a far higher price even than had been paid for the gratification of thus avenging themselves upon their enemy. The news flew from mouth to mouth, and triumphant whoops resounded throughout the camp; and Ethel inside her tent felt her blood run cold at the savage exultation which they conveyed. She was greatly troubled by the fire, for she saw that it must efface all signs of the trail, and render the task of her friends long and difficult, and she felt greatly depressed at what she looked upon as a certain postponement- 334 - of her rescue. She lay thinking over all this for a long time, until the camp had subsided into perfect quiet. Then the skins were slightly lifted near her head, and she heard a voice whisper,— ‘Me, Tawaina,—friend. Great chief come to look for girl. Two trails,—eyes blinded. Tawaina make sign,—point way. Give piece dress that great chief may believe.’ Ethel at once understood. She cautiously tore off a narrow strip from the bottom of her dress, and put it under the skin to the speaker. ‘Good,’ he said. ‘Tawaina friend. Ethel, hope.’ Greatly relieved by knowing that a clue would be now given to her friends, and overpowered by fatigue, Ethel was very shortly fast asleep. At daybreak they set off again, having thus thirty hours’ start of their pursuers. They travelled six hours, rested from eleven till three, and then travelled again until dark. Occasionally a sheep lagged behind, footsore and weary. He was instantly killed and cut up. For four days was their rate of travelling, which amounted to upwards of fifty miles a day, continued, and they arrived, as has been said, the last evening at their village. During all this time Ethel was treated with courtesy and respect. The best portion of the food was put aside- 335 - for her, the little tent of skins was always erected at night, and no apparent watch was kept over her movements. The next morning she was awake early, and, had it not been for the terrible situation in which she was placed, she would have been amused by the busy stir in the village, and by the little copper-coloured urchins at play, or going out with the women to collect wood or fetch water. There was nothing to prevent Ethel from going out among them, but the looks of scowling hatred which they cast at her made her draw back again into the hut, after a long anxious look around. It was relief at least to have halted, great as her danger undoubtedly was. She felt certain now that hour by hour her father must be approaching. He might even now be within a few miles. Had it not been for the fire, she was certain that he would already have been up, but she could not tell how long he might have been before he recovered the trail. Towards the middle of the day two or three Indians might have been seen going through the village, summoning those whose position and rank entitled them to a place at the council. Soon they were seen approaching, and taking their seats gravely on the ground in front of the hut of the principal chief. The women, the youths, and such men- 336 - as had not as yet by their feats in battle distinguished themselves sufficiently to be summoned to the council, assembled at a short distance off. The council sat in the form of a circle, the inner ring being formed of the elder and leading men of the tribe, while the warriors sat round them. Struck by the hush which had suddenly succeeded to the noise of the village, Ethel again went to the door. She was greatly struck by the scene, and was looking wonderingly at it, when she felt a touch on her shoulder, and on looking round saw the Fawn gazing pityingly at her, and at the same time signing to her to come in. The truth at once flashed across Ethel’s mind. The council had met to decide her fate, and she did not doubt for a moment what that decision would be. She felt that all hope was over, and, retiring into the hut, passed the time in prayer and in preparation for the fearful ordeal which was at hand. After the council had met, there was a pause of expectation, and the Stag then rose. ‘My brothers, my heart is very glad. The Great Spirit has ceased to frown upon his children. Twice we went out, and twice returned empty-handed, while many of our lodges were empty. The guns which shoot without loading were too strong for us, and we returned sorrowful.- 337 - Last year we did not go out; the hearts of our braves were heavy. This year, we said perhaps the Great Spirit will no longer be angry with his children, and we went out. This time we have not returned empty-handed. The lowing of cattle is in my ear, and I see many sheep. The white men have felt the strength of our arms; and of the young men who went out with me there is not one missing. Best of all, we have brought back a captive, the daughter of the white chief of the flying fires and the guns which load themselves. Let me hand her over to our women; they will know how to make her cry; and we will send her head to the white chief, to show that his guns cannot reach to the Indian country. Have I spoken well?’ A murmur of assent followed the chief’s speech; and supposing that no more would be said upon the matter, the Stag was about to declare the council closed, when an Indian sitting in the inner circle rose. ‘My brothers, I will tell you a story. The birds once went out to attack the nest of an eagle, but the eagle was too strong for them; and when all had gone, he went out from his nest with his children, the young eagles, and he found the raven and two other birds hurt and unable to fly, and instead of killing them, as they might have done, the eagles took them up to their nest, and nursed them- 338 - and tended them until they were able to fly, and then sent them home to their other birds. So was it with Tawaina and his two friends.’ And the speaker indicated with his arm two Indians sitting at the outer edge of the circle. ‘Tawaina fell at the fence where so many of us fell, and in the morning the white men took him and gave him water, and placed him in shelter, and bandaged his wound; and the little White Bird and her sister brought him food and cool drinks every day, and looked pitifully at him. But Tawaina said to himself, The white men are only curing Tawaina, that when the time comes they may see how an Indian can die. But when he was well, they brought horses, and put a bow and arrows into our hands, and bade us go free. It is only in the battle that the great white chief is terrible. He has a great heart. The enemies he killed he did not triumph over. He laid them in a great grave. He honoured them, and planted trees with drooping leaves at their head and at their feet, and put a fence round that the foxes might not touch their bones. Shall the Indian be less generous than the white man? Even those taken in battle they spared and sent home. Shall we kill the White Bird captured in her nest? My brothers will not do so. They will send back the White Bird to the great white chief. Have I spoken well?’- 339 - This time a confused murmur ran round the circle. Some of the younger men were struck with this appeal to their generosity, and were in favour of the Raven’s proposition; the elder and more ferocious Indians were altogether opposed to it. Speaker succeeded speaker, some urging one side of the question, some the other. At last the Stag again rose. ‘My brothers,’ he said, ‘my ears have heard strange words, and my spirit is troubled. The Raven has told us of the ways of the whites after a battle; but the Indians’ ways are not as the whites’ ways, and the Stag is too old to learn new fashions. He looks round, he sees many lodges empty, he sees many women who have no husband to hunt game, he hears the voices of children who cry for meat. He remembers his brothers who fell before the flying fire and the guns which loaded themselves, and his eyes are full of blood. The great white chief has made many wigwams desolate: let there be mourning in the house of the white chief. Have I spoken well?’ The acclamations which followed this speech were so loud and general that the party of the Raven was silenced, and the council at once broke up. A cry of exultation broke from the women when they- 340 - heard the decision, and all prepared for the work of vengeance before them. At a signal from the Stag, two of the young Indians went to the hut and summoned Ethel to accompany them. She guessed at once that her death was decided upon, and, pale as marble, but uttering no cry or entreaty, which she knew would be useless, she walked between them. For a moment she glanced at the women around her, to see if there was one look of pity or interest; but faces distorted with hate and exultation met her eyes, and threats and imprecations assailed her ears. The sight, though it appalled, yet nerved her with courage. A pitying look would have melted her,—this rage against one so helpless as herself nerved her; and, with her eyes turned upwards and her lips moving in prayer, she kept along. The Indians led her to a tree opposite the centre of the village, bound her securely to it, and then retired. There was a pause before the tragedy was to begin. Some of the women brought faggots for the pile, others cut splinters to thrust under the nails and into the flesh. The old women chattered and exulted over the tortures they would inflict; a few of the younger ones stood aloof, looking on pityingly.- 341 - The men of the tribe gathered in a circle, but took no part in the preparations,—the torture of women was beneath them. At last all was ready. A fire was lit near; the hags lit their firebrands and advanced. The chief gave the signal, and with a yell of exultation they rushed upon their victim, but fell back with a cry of surprise, rudely thrust off by three Indians who placed themselves before the captive. The women retreated hastily, and the men advanced to know the reason of this strange interruption. The Raven and his companions were unarmed. The Indians frowned upon them, uncertain what course to pursue. ‘My brothers,’ the Raven said, ‘I am come to die. The Raven’s time is come. He has flown his last flight. He and his brothers will die with the little White Bird. The Raven and his friends are not dogs. They have shed their blood against their enemies, and they do not know how to cry out. But their time has come, they are ready to die. But they must die before the little White Bird. If not, her spirit will fly to the Great Spirit, and will tell him that the Raven and his friends, whom she had sheltered and rescued, had helped to kill her; and the Great Spirit would shut the gates of the happy hunting-grounds against them. The Raven has spoken.’- 342 - There was a pause of extreme astonishment, followed by a clamour of voices. Those who had before espoused the cause of the Raven again spoke out loudly, while many of the others hesitated as to the course to be pursued. The Stag hastily consulted with two or three of his principal advisers, and then moved forward, waving his hand to command silence. His countenance was calm and unmoved, although inwardly he was boiling with rage at this defiance of his authority. He was too politic a chief, however, to show this. He knew that the great majority of the tribe was with him; yet the employment of force to drag the Raven and his companions from their post would probably create a division in the tribe, the final results of which none could see, and for the consequences of which he would, in case of any reverse, be held responsible and looked upon with disapproval by both parties. ‘The Raven and his friends have great hearts,’ he said courteously. ‘They are large enough to shelter the little White Bird. Let them take her. Her life is spared. She shall remain with our tribe.’ The Raven inclined his head, and, taking a knife from a warrior near, he cut the cords which bound Ethel, and, beckoning to the Fawn, handed the astonished girl again- 343 - into her charge, saying as he did so, ‘Stop in hut. Not go out; go out, bad.’ And then, accompanied by his friends, he retired without a word to one of their huts. A perfect stillness had hung over the crowd during this scene; but when it became known that Ethel was to go off unscathed, a murmur broke out from the elder females, disappointed in their work of vengeance. But the Stag waved his hand peremptorily, and the crowd scattered silently to their huts, to talk over the unusual scene that had taken place. The Raven and his friends talked long and earnestly together. They were in no way deceived by the appearance of friendliness which the Stag had assumed. They knew that henceforth there was bitter hatred between them, and that their very lives were insecure. As to Ethel, it was, they knew, only a short reprieve which had been granted her. The Stag would not risk a division in the tribe for her sake, nor would attempt to bring her to a formal execution; but the first time she wandered from the hut, she would be found dead with a knife in her heart. The Raven, however, felt certain that help was at hand. He and his friends, who knew Mr. Hardy, were alone of the tribe convinced that a pursuit would be attempted. The fact that no such attempt to penetrate- 344 - into the heart of the Indian country had ever been made, had lulled the rest into a feeling of absolute security. The Raven, indeed, calculated that the pursuers must now be close at hand, and that either on that night or the next they would probably enter the gorge and make the attack. The result of the council was that he left his friends and walked in a leisurely way back to his own hut, taking no notice of the hostile glances which some of the more violent of the Stag’s supporters cast towards him. On his entrance he was welcomed by his wife, a young girl whom he had only married since his return from the expedition, and to whom, from what he had learned of the position of women among the whites, he allowed more freedom of speech and action than are usually permitted to Indian women. She had been one of the small group who had pitied the white girl. ‘The Raven is a great chief,’ she said proudly; ‘he has done well. The Mouse trembled, but she was glad to see her lord stand forth. The Stag will strike, though,’ she added anxiously. ‘He will look for the blood of the Raven.’ ‘The Stag is a great beast,’ the Indian said sententiously; ‘but the Raven eat him at last.’ Then, sitting down upon a pile of skins, the chief- 345 - filled his pipe, and made signs to his wife to bring fire. Then he smoked in silence for some time until the sun went down, and a thick darkness closed over the valley. At length he got up, and said to his wife, ‘If they ask for the Raven, say that he has just gone out; nothing more. He will not return till daybreak; and remember,’ and he laid his hand upon her arm to impress the caution, ‘whatever noise the Mouse hears in the night, she is not to leave the hut till the Raven comes back to her.’ The girl bowed her head with an Indian woman’s unquestioning obedience; and then, drawing aside the skin which served as a door, and listening attentively to hear if any one were near, the Raven went out silently into the darkness.","sourceLink":"http://novel.tingroom.com/duanpian/3169/86943.html","bookId":865,"book":{"id":865,"title":"Out on the Pampas","description":"简介： Well, my dear, I was thinking of a good many things. In the first place, I think, I began with wondering what I should make of the boys; and that led to such a train of thoughts about ourselves and our circumstances, that I hardly knew where I was wh...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3169","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
