{"id":41701,"no":21,"title":"CHAPTER XIX.","content":"STILL REVOLUTIONARY—THE FIRST FOURTH OF JULY TAKES PLACE—DECLARATION OF INDEPENDENCE—AN ABLE DOCUMENT—PARLIAMENT IS MUCH MOVED AND GETS OUT YELLOW HANDBILLS. One hot sultry day in the summer of 1776 Thomas Jefferson eased his mind in an essay called the Declaration of Independence, which said in effect that the United Colonies of America had saved up money enough to start in business for themselves, and henceforth there was to be no connection with over the way. This document, dated July 4, 1776, was signed by John Hancock and a few other members 104of Congress who had learned to write, and was duly published in all the daily papers. We received a marked copy of one of the papers in which it appeared at the time, and with a sort of vague instinct that we might find it useful some day, cut it out and preserved it with religious care. We reproduce it here in facsimile. 105It will be found to be a very readable article, and we advise our readers to peruse it carefully, if they have to skip all the rest of the book. The gentlemen who signed the Declaration have courteously furnished us their autographs, which we also take the liberty of placing before our readers. When the attention of Parliament was accidentally called to this article, in one of the papers above alluded to, its feelings may be more readily imagined than described. And 106when that quaint old fossil Disraeli put on his spectacles and read it “out loud” there was not a dry eye in the house. Parliament cried like a child, or, more properly, like a whole orphan asylum. Becoming calmer after awhile they got out immense illustrated yellow posters, representing an enraged lion engaged in bitter discussion with a sanguinary one-eared mule, and after stating that this was the Lion and the Unicorn, the poster went on to say that the Americans were rebels and humbugs, and further cautioned the public against selling them goods on credit. When these handbills were posted conspicuously and profusely on every stone wall, barn, and rail-fence in America, the spirit of ’76 rose to several per cent. above proof. War was declared, and General 107Washington was appointed commander-in-chief of the Continental army. He gave strict orders to place none but Americans on guard, while England sent more troops to America, and expected every man to do his duty.","sourceLink":"http://novel.tingroom.com/jingdian/1974/56554.html","bookId":716,"book":{"id":716,"title":"Comic history of the United States","description":"简介： It seems the printer has left a blank place on this page for a dedication. In the early stages of this work, it is true, the author had thought of inscribing it to a wealthy aunt, (who has no other incumbrances,) but on more mature deliberation he ha...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1974","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
