{"id":99392,"no":11,"title":"Page 11","content":"I know instantly that we\u0027re in trouble. Beranabus is fighting a variety of demons, snake-like, but with arms and claws, heads of tigers, lions, vultures. Several are locked in battle with the elderly magician, ripping at him with talons and fangs, moving incredibly fast. He\u0027s striking back with bolts of lightning. A couple of demons are lying in pieces around him. But there are more to come. In the distance, I spot another window and a demon leaving through it. I\u0027m not certain, but I think it\u0027s Cadaver! In a rush of excitement I start towards the window, but then one of the other demons spots me. Shrieks like a bird of prey. Lashes backwards with its scaly tail, driving itself at me. I freeze, losing my new-found confidence. Looking past the demon, I see the window come apart and I lose hope too. Cut off from my prey, isolated and terrified, I stand motionless and defenceless. Raz steps through the window behind me. Yells with surprise and fear, then pushes ahead of me and grabs the attacking demon by its arms. Sinks his teeth into its throat. Bites it open, then spits the slimy flesh out. Puts his teeth up close to the hole in the thrashing demon\u0027s throat. Blows into it - but magic comes out of his mouth, not air. Enters through the gash. The demon explodes. Raz tosses its remains aside and moves to deal with the next in line. Sharmila steps through, then Nadia. Sharmila gasps, looks around in wild terror, then gains control and steps up beside Raz. A jackal-headed demon leaps on her. She thrusts a hand at its stomach. As soon as she touches it, flames burst from her fingers. Seconds later, the demon\u0027s on fire, writhing in the dust. Nadia curses, starts forward, then looks back at me. \"Shut the window!\" \"But... we have to go back... we can\u0027t stay here... there are - \" \"The barrier won\u0027t hold now that we\u0027ve moved on!\" she shouts. \"If you don\u0027t close it, the Kallin will be able to follow us through!\" I hate turning my back on the fighting, but I can\u0027t ignore her warning. I stare at the window of white light, not sure what to do. So I try the first thing that comes into my head. Reach into the window, to rip it apart. But my hands slide through the light and nothing happens. I can\u0027t see anything through the window, but I imagine the Kallin massing on the other side. They could come slithering through at any second. I should run, get away from here, flee for my... I force myself to take a breath. Consider the problem. It was easy to put the patches of light together, so it must be easy to take them apart. But how? I begin to reach into the window again. Pause. Half close my eyes and study it carefully. Although it looks like a solid wall of light, if I squint, I can make out thin lines where the original patches join. Tiny cracks running through the window, almost invisible. I run my index finger round one of the larger patches near the centre, thinking. Then, without trying to touch it, I slide my finger at the patch from the side, willing it to move. The patch comes loose and glides away from my finger, becoming a pulsing strawberry colour. After a few seconds it stops pulsing, hangs in the air a moment, then drifts away. I work on freeing other patches. After removing about a dozen, the window disintegrates. The patches regain their original colours and slide away from one another in a slow, graceful explosion. No time for pride. I check what\u0027s happening with the demons. There aren\u0027t as many as on the needle of rock, but they\u0027re larger and stronger, and there\u0027s no time to construct a barrier to keep them at bay. They\u0027re all around Beranabus and his Disciples. A few have caught hold of Raz and dragged him to the ground. He\u0027s lashing out with his fists, trying to chew their throats open. But they worry him like savage hounds. One rips off most of his right leg and devours the flesh, howling with satisfaction. A claw strikes his head and slices half his face away. He tries to scream, but he no longer has a tongue. I cry out with pity and terror, but there\u0027s nothing I can do to help the fat black man who was so nice to me, who saved my life mere moments ago. He\u0027s stronger than me. He knows how to fight demons. A true being of magic. If he can\u0027t handle these monsters, what hope do I have? My eyes dart from Raz to the others. More than a dozen demons are at war with Beranabus. Five are focused on Sharmila. Nadia is fending off several more, making the ground explode in front of them, hitting them with bolts of magic, roaring hatefully like I do when I fight. Two more barrel towards me, tails whipping from side to side, snarling, arms and claws extended. Driven by desperate instinct, I reach towards two patches of purple and orange light. I clap my hands together, driving the patches hard at each other. They smash together and create a blinding flash of purplish-orangey light. The instinct which told me to try this also tells me to close my eyes - sharpish! When I look a few seconds later, the demons are down, screaming with pain and confusion, eyes melted in their sockets. I\u0027m stunned by the power I\u0027ve unleashed. Confidence comes flooding back. Once again I\u0027m Kernel Fleck - defeater of the Demonata! Then one of the fallen demons scrapes the gooey mess clear of its empty sockets. New globes grow, the demon using magic to construct a fresh pair of eyes. I realise I\u0027ve only slowed the creatures down, not put them out of action forever. Different universe - different rules. Panic sets in again. The Disciples are doomed. Beranabus is finished. Cadaver set another trap for us and there\u0027s no way out of this one. My choice is simple - perish with the others or save myself. I don\u0027t think of anywhere specific. I merely scream with all my inner senses - \"Somewhere safe!\" When nothing happens, I add rapidly, \"Earth! A city!\" Patches of light pulse around me. Frantic, I push them together, forming a new window as quickly as I can. I don\u0027t look up or think about the demons which might be bearing down on me. Focus on the lights. I\u0027m working quicker than I did on the needle, learning all the time, feeling power bubble through me. Then, out of the corner of my eye, I catch a glimpse of a demon lurching at me. I flinch but don\u0027t stop. The demon rushes closer... closer... It\u0027s one of the pair I blinded. Seething for revenge. A few more seconds and it\u0027ll be on me. I should turn to deal with it, but my hands won\u0027t stop moving. There\u0027s nothing I can do. Then the demon\u0027s knocked aside. It grunts heavily, then screams. I can\u0027t see what\u0027s happening to it and I don\u0027t look. Keep working on the window. Sweating heavily. Mouth dry. Weeping softly. Something steps up beside me. I cry out, expecting the worst. But it\u0027s not a demon. It\u0027s Nadia. \"Hurry!\" she hisses. \"Get us out of here!\" \"I\u0027m trying,\" I groan, hands a whir of motion. Nadia stands with her back against mine, protecting me. I work faster, desperate to be out of here, somewhere real and normal, where demons can\u0027t get me. The lights pulse together a few times, then turn red. A window opens. \"Nadia!\" I shout. \"Good work.\" She yells Beranabus\u0027 name, then Sharmila\u0027s. I look around. I can\u0027t see Beranabus - he\u0027s completely surrounded by demons. Sharmila\u0027s losing her battle too - six of the monsters are on her and although a few are aflame, she can\u0027t fight them off. She\u0027s lost an arm at the elbow. Bleeding from deep wounds. Panting heavily, with the wild look of a horse caught in a thunderstorm. Raz is dead. A pair of demons have torn his head off. As I watch, they rip it in two then each retreats with half, dipping their foul jowls into his skull, scooping out his brains with their fangs and tongues. I get sick again, though there isn\u0027t much to come up this time. \"Let\u0027s go,\" Nadia says, taking my right arm. \"What about the others?\" I cry. \"We can\u0027t help them.\" \"But...\" I stare at her. Although my plan was to flee by myself, now that she\u0027s voiced it, I don\u0027t want to. I don\u0027t care much about the aloof Beranabus, but Sharmila has been a true friend. She tried to stop Cadaver stealing Art. We should help her, free her, take her with us. \"I\u0027m going,\" Nadia snarls. \"You do what you like.\" And, releasing my hand, she ducks through the window, disappearing in an instant. I hesitate, torn between escape and nobility. Then a demon catches sight of me and slithers across. It has a vulture\u0027s head. There are bits of Raz\u0027s brains dripping from its beak. Something within me snaps. Cowardice triumphs. And without any shame, I turn my back on the demons - and Beranabus and Sharmila - and dive through the window after Nadia.","sourceLink":"https://allnovel.net/demon-thief-the-demonata-2/page-11.html","bookId":2176,"book":{"id":2176,"title":"Demon Thief (The Demonata #2)","description":"Storyline: Demon Thief (The Demonata #2) This story is told through the eyes of lonely child Cornelius \"Kernel\" Fleck and takes place probably somewhere in the United Kingdom or Ireland and during the 1970s. Kernel always been different - he can see strange patches of light in the air around him. The other kids and his parents think he\u0027s mad and as a result he has no friends. But when he manages to link some of the lights to each other, he creates a window into another universe. After seeing a red demon - Lord Loss, although Kernel doesn\u0027t know it - went through and then went back into the window, Kernel makes a rash decision and follows the demon into the other universe. Kernel then disappears for several days. When he returns he comes back with a baby named Art. Kernel has no memory of what he during the seven days he went missing or how he got Art. At first Kernel tells his parents what he remembered up until he went into the light but neither of his parents believe him, thinking that Kernel is lying or is in shock...","cover":"https://allnovel.net/images/demon-thief-the-demonata-2.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/demon-thief-the-demonata-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:41:33 PM"}}
