{"id":99401,"no":22,"title":"Page 22","content":"Searing heat. I scream and thrash, splashing lava up into the air. I go under, immersed in the fiery liquid, feeling it fill my mouth, nose, ears, burning away the soft flesh of my lips and ear lobes, destroying my eyelids, setting to work on the jelly-like globes of my eyes. I come up. Spit out lava. Scream again, tongue crackling, throat pinched tight, sizzling eyes wide with terror. I don\u0027t try using magic to protect myself. Panic has taken over. I\u0027m helpless. Caught by the river. Lost. I start to sink. My legs kick out automatically, like when I\u0027m swimming, to keep my head up. Gasping for air. I feel my toes burning away, and the acid of the lava eats its way through the wall of my stomach. A few more seconds and it\u0027ll all be over. I\u0027ll just be scraps of flesh and bone smeared across the surface of the river - then nothing. I hear a shout to my left, but I\u0027m not able to look round. I\u0027m going under. No lower legs left to kick with. Bones are showing through the flesh of my fingers. The skin of my throat is peeling back like burning paper. Then hands snake around the remains of my chest and I\u0027m hauled out of the lava. My lidless eyes focus blearily. It\u0027s a woman, her face contorted by my ruined eyes. She\u0027s yelling, but my ears are full of lava. I can\u0027t hear what she\u0027s saying. The woman pulls what\u0027s left of me free of the river and races with me to the bank, dumping me on hard, cold land. Falls beside me, her feet and shins on fire. She slaps at the flames, then stops, stares, quenches them with magic. I\u0027m bubbling away to nothing beside her, covered with lava that\u0027s still eating through my flesh. When the woman has put out her own flames, she turns her attention to me. Shouts the words of a spell and waves a hand over me. The lava explodes off me in splatters, out of my nose, mouth and ears. I take an unbelievably welcome breath of air, then cry out my agony to the world. \"Kernel!\" the woman yells. \"You have to help me! The damage is too great - I can\u0027t repair it by myself.\" I\u0027m gasping like a dying fish, unable to respond. I never thought there could be so much pain this side of death. The woman casts another spell. A cool wave washes through me, numbing me to the worst of the torment. I draw back from the brink of pain-fuelled insanity. Lay my head down, moaning weakly instead of screaming madly. \"Use magic,\" the woman urges me. \"Help yourself. Restore the flesh that\u0027s been burnt away. It\u0027ll hurt like hell, but you have to do it.\" I want to say that I can\u0027t, I\u0027m too weary and don\u0027t know the spells. But my incinerated vocal cords and lips won\u0027t let me form the words. Annoyed, I try to fix the damage, so I can tell the woman I\u0027m finished. Magic flows to the areas which I\u0027ve targeted and cells knit together in response to my command. As my lips return, bloody and stinging, but workable, I start to complain. Then I realise - the fact I can complain proves I have the power to heal myself. So instead of whinging, I set to work on the rest of my wrecked body. It takes several minutes, and is every bit as painful as the woman predicted, but eventually, I\u0027m almost whole again, scorched and blackened from the heat, pink new flesh glistening sorely in the yellow light, scarred around the places where I\u0027ve had to create fresh flesh and bones, tender as... well, as somebody who\u0027d been dunked in a river of lava! But I\u0027m alive and mostly in one piece. Smiling painfully, I lift my face to thank the woman who came to my rescue. I\u0027m expecting Sharmila - I figure she couldn\u0027t stand by and watch me die, so she entered the Board to save me - but the face my new eyes fix on is much younger and paler than the Indian lady\u0027s. But just as familiar. \"Nadia!\" I gasp. She stares at me with an angry but wary expression. \"You should have been prepared for an attack. You fell too easily. It would have served you right if I\u0027d left you.\" \"But you\u0027re dead!\" I cry. She laughs. \"Then you have a ghost to thank.\" She stands and looks into the distance. \"Dervish is on his way. I was leading him to you when I sensed you fall into the lava.\" She starts to walk away. \"Wait! I don\u0027t understand! I saw you die. How can you be here?\" She hesitates and looks up. Following the direction of her gaze, I see that the sky is hazy now, cutting off my view of Lord Loss and Beranabus. \"You must not tell him,\" Nadia says quietly. \"Tell who what?\" I frown. \"Beranabus. That I\u0027m alive.\" She faces me and now she wears a cool, flat look. \"I had enough of it, Kernel. He treated me like scum, using me any way he wished. I had no freedom or say over my life. So I decided to trade allegiances and go where I\u0027d be appreciated and rewarded.\" \"You mean...?\" I can\u0027t bring myself to say it. \"I joined Lord Loss,\" she whispers. \"I spoke to him secretly when we arrived at his castle. Told him of my gift. Promised to serve him if he\u0027d allow me a few simple pleasures and some time to myself.\" \"But he\u0027s a demon!\" I shout. \"They kill humans!\" \"Yes,\" she answers smoothly. I gawp at her, unable to believe it. She shifts uneasily and looks away. \"Beranabus can\u0027t see us now. He\u0027ll never know I\u0027m alive. Unless you tell him.\" \"But Lord Loss is our enemy. You - \" \"I saved your life!\" she snaps. \"I didn\u0027t have to. I could have left you to sink.\" \"Why did you save me?\" I ask softly. \"Because I like you.\" She laughs and there are tears in her eyes. \"I like all of you - except Beranabus. I hate him, with good reason. But I don\u0027t wish harm to anyone else. I came here to hide. Lord Loss separated my soul before destroying my body - or most of it. He kept my brain and heart whole. He can put my flesh and bones back together around them later, and restore my soul from here. When I felt you and the others enter the Board, I asked Lord Loss if I could help you. He said I could, but only once. So this is it. You\u0027re on your own now.\" \"Nadia... you mustn\u0027t do this. Lord Loss is evil. If you stay with him, he might ask you to do evil things.\" \"I\u0027m certain he will.\" She shrugs. \"But I no longer care. I\u0027ve been apart from humans so long, I don\u0027t feel like I have anything in common with them. This might be the last decent act I ever perform. But I\u0027m fine with that. If I\u0027m to become like the Demonata... like my new master...\" She draws herself up straight, blinking the tears away, eyes flashing. \"So be it.\" \"Nadia...\" I try again, but she stops me. \"I saved your life, Kernel. In return, I\u0027d like you to keep my secret and tell no one I\u0027m alive. I can\u0027t make you promise, but I\u0027ll be disappointed if you betray me.\" \"I won\u0027t tell,\" I mutter. \"Thank you.\" She smiles awkwardly, but it quickly fades. \"One last warning. If you escape this Board and our paths cross in the future, we\u0027ll be on different sides. Don\u0027t expect me to ever help you again.\" With that, she turns, raises her face to the sky, extends her arms, then turns into a beautiful, swan-like demon. As I watch, she gracefully rises and glides away, picking up speed, soaring higher and higher, until she\u0027s only a speck against the skyline... then gone. Dervish arrives some time later. I\u0027m lying in the same spot, still in agony, using magic to make little changes and tweaks. As Dervish fusses over me, I tell him about the attack and my fall, but claim I pulled myself out and patched my body together unassisted. I don\u0027t mention Nadia. \"Can you stand?\" Dervish asks, fanning his face, sweating from the heat of the river. \"I don\u0027t think so,\" I croak. \"How about levitate?\" I manage a chuckle. \"I\u0027m not Beranabus. I can\u0027t fly.\" \"Then I\u0027m going to pick you up,\" he says. \"We need to get away from here. I\u0027ll be as gentle as possible. Ready?\" I nod, gritting my teeth so I don\u0027t cry out too loudly when he touches me. As carefully as he can, Dervish sneaks one arm under my neck, the other beneath my knees, and lifts. It\u0027s not as bad as I thought, but I can\u0027t stop myself from gasping and shutting my newly grown eyelids against the pain. \"Sorry,\" Dervish says, then hobbles away from the lava, carrying me like a baby. Resting behind a hill, sheltered from the heat of the river. I\u0027m still working on my body, using magic to undo the damage and smooth over the cracks. Make sure all my bones are solid. Regrow fingernails and fingerprints. Separate my toes. Try to get my ears the right shape. Let warm energy circulate through my legs, strengthening them, knowing I\u0027ll have to get up soon and walk. No more faces in the sky. Just a ceiling of yellow light. I asked Dervish about them, but he didn\u0027t see Lord Loss or Beranabus. He\u0027d been wandering like me, but in this zone of light, not darkness. Then he spotted a white, winged demon. Since it seemed to be the only living creature, he followed it until it vanished. Having no better plan, he kept going in the same direction - and found me. \"Where do you think Shark is?\" I ask. Dervish shrugs. \"He could be anywhere. I\u0027ve no idea how large this place is.\" I tell him my idea, that it\u0027s laid out like a chess board, thirty-two dark areas, thirty-two light zones. Dervish hadn\u0027t thought of that. \"I think you\u0027re right,\" he says. \"But we\u0027ve no way of working out the size of each square.\" \"Did you find any water?\" I ask. \"I\u0027m thirsty.\" \"Don\u0027t think about it,\" he advises. \"You can keep thirst and hunger at bay, like sleep. Your body will do almost anything you tell it here.\" He strokes his spikes of hair, stiff and upright again, a few inches longer than before. He\u0027s putting on a brave front, but I can see he\u0027s terrified. He\u0027s not much older or more experienced than me. He\u0027s never been in a situation like this. He\u0027s acting grown-up, but I bet - like me - he\u0027d give anything to have somebody to turn to for help. \"We need a plan,\" I say, wanting to make things a bit easier for Dervish. \"We can\u0027t just stagger around, waiting to be attacked. We should have a purpose.\" \"Getting the hell out of here would be a good start,\" Dervish mutters. \"Yes, but Lord Loss said we could only get out if I found and named the demon thief. First, I think we should find Shark. Then we can try to figure out a way to unearth Cadaver.\" Dervish nods. \"That sounds good. But how will we look for Shark? Just pick a direction at random?\" I suppose... \"But what if we\u0027re in a square at one end of the Board and he\u0027s in a square at the opposite end?\" \"Then it\u0027ll be a long walk.\" Dervish laughs. \"What else can we do?\" I ask. Dervish frowns. \"Maybe one of the demons could lead us to him - the hell-child or the winged monster.\" He walks around to the other side of the hill to look for them. Returns a minute later, shaking his head. \"There will be others,\" I say. \"Lord Loss won\u0027t want to watch us walk around in circles for too long. That would be boring. I bet he\u0027ll send lots of demons to attack us.\" \"Great.\" Dervish doesn\u0027t sound too optimistic. \"I could use the patches of light to find Shark, except there aren\u0027t any here. The Board isn\u0027t like the outside universes. The rules are different.\" Dervish chuckles. \"From one universe of insanity to another.\" \"Maybe I could...\" I stop and dig the marbles out of my pocket, remembering how I used one to create light in the maze of darkness. \"What are those?\" Dervish asks. \"Marbles. My brother was playing with them before he was kidnapped.\" \"Oh. I was hoping they were some sort of magical globes.\" \"Maybe they are... or can be.\" I tell him about the maze, how I tried to create light but couldn\u0027t, until I got one of the marbles out. \"But we don\u0027t need light here,\" Dervish says. \"Thanks for pointing out the obvious,\" I snap. \"What I meant was, if I could use a marble as a torch, maybe I could use it as some other instrument. Like a compass or a tracking device?\" Dervish looks sceptical but says, \"Well, go on, give it a try.\" I study the orange marbles and again find myself thinking of that night in Sally\u0027s house, Art holding them up over his eyes. Shutting the image out, I focus on thoughts of Shark, asking the marbles to lead me to him. Nothing happens immediately, but then Dervish gasps and leans in closer. The orange swirls at the heart of the marbles have turned mistlike, and through the mist we can see Shark, battling demons, his hands wet with blood. \"Where is he?\" Dervish cries. \"I don\u0027t know.\" I try to bring the land around Shark into clearer focus but can\u0027t. Abandoning that tactic, I let the pictures of him fade and ask the marbles to guide us to him. They quiver in the palm of my hand, then leap into the air like jumping beans. I cringe away from them. Dervish does too. But when they just hang there, we recover and grin at each other. I get to my feet, Dervish helping me. Pain flares afresh, but I use magic to fight it. Then I focus on the marbles, still hanging in the air above us. \"Shark,\" I say quietly, directing my magic towards the marbles. They dart off ahead of me at a furious speed, twin bolts of orange lightning. \"Wait!\" I shout. They come to a halt, hovering in the air like bees. I glance at Dervish and he claps slowly. I stumble forward, feet still blistered from the lava, Dervish supporting me. As we come up to the marbles, I again ask them to lead us to Shark. \"But slowly,\" I add. \"Don\u0027t get too far ahead of us.\" The marbles bob in the air, as though nodding, then float smoothly over the volcanic landscape, leading us in search of our demon-tormented friend.","sourceLink":"https://allnovel.net/demon-thief-the-demonata-2/page-22.html","bookId":2176,"book":{"id":2176,"title":"Demon Thief (The Demonata #2)","description":"Storyline: Demon Thief (The Demonata #2) This story is told through the eyes of lonely child Cornelius \"Kernel\" Fleck and takes place probably somewhere in the United Kingdom or Ireland and during the 1970s. Kernel always been different - he can see strange patches of light in the air around him. The other kids and his parents think he\u0027s mad and as a result he has no friends. But when he manages to link some of the lights to each other, he creates a window into another universe. After seeing a red demon - Lord Loss, although Kernel doesn\u0027t know it - went through and then went back into the window, Kernel makes a rash decision and follows the demon into the other universe. Kernel then disappears for several days. When he returns he comes back with a baby named Art. Kernel has no memory of what he during the seven days he went missing or how he got Art. At first Kernel tells his parents what he remembered up until he went into the light but neither of his parents believe him, thinking that Kernel is lying or is in shock...","cover":"https://allnovel.net/images/demon-thief-the-demonata-2.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/demon-thief-the-demonata-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:41:33 PM"}}
