{"id":99403,"no":24,"title":"Page 24","content":"Nothing happens when I ask the marbles to lead me to the demon thief. So I ask them to find Cadaver instead, and they immediately set off, guiding us through the vastness of space. We\u0027d be lost without the marbles. Impossible to tell up from down in this void. We couldn\u0027t even find our way back to the panels we came through. I wonder if Lord Loss knew about the marbles when he sent us here. Perhaps we have an advantage he didn\u0027t count on.\n After what feels like less than a day we come to a pair of white panels. The marbles hesitate, then split, one going left, one right. I stop them before they slip through. Glance at Dervish and Shark for their opinions.\n \"Looks like it doesn\u0027t matter which way we go,\" Dervish says.\n \"But Cadaver can\u0027t be in two zones at once, can he?\" Shark frowns.\n \"Maybe he\u0027s straddling them,\" Dervish suggests. \"A foot in each world.\"\n \"Or maybe the marbles are trying to split us up,\" Shark says suspiciously. \"We don\u0027t know where their power comes from. This might be the work of Lord Loss - he separates us, throws us together, then splits us up again.\"\n \"I doubt it,\" Dervish says. \"Anyway, if that\u0027s the case, it\u0027s easy to outfox him - we just don\u0027t part. We go through one panel together. Kernel, which do you prefer?\"\n I shrug. \"I\u0027ve no idea.\"\n \"Then let\u0027s go left,\" Dervish decides. When neither of us objects, he moves to a spot just behind me, Shark slides up in front, and in a close line we follow the marbles through the panel, into a new zone of fresh horrors.\n Guts everywhere. Every sort of inner organ imaginable. Stacked in piles, splattered around in pieces, some draping off trees of bone. A foul stench. The ground beneath our feet slippery with blood, mucous and all sorts of slime. I choke from the stench, vomit spewing out of my mouth. Dervish and Shark are the same. All three of us on our knees, vomiting, clutching our noses shut, gasping for air.\n Demons are slithering through the mass of guts, ripping them apart, bathing in the blood and goo, feeding greedily. Most are worm-like, some as short as caterpillars, others several feet long. They\u0027re blind. They carry on shredding and guzzling, ignorant of our presence. One slides over the back of my legs, sniffs at me, decides there are richer pickings elsewhere and moves on.\n \"Magic!\" Dervish gasps, eyes red and watery. \"Create a... field... like in... the last place!\"\n It\u0027s hard to focus. The magic doesn\u0027t come easily here. The stench is foul, but it isn\u0027t fatal, so my body doesn\u0027t automatically generate a magical force field. After a minute or two of fumbling, I construct a weak field of air around my face. It\u0027s not as strong as the field I created in space, and some of the smell seeps through, but it blocks out the worst and allows me to breathe normally.\n Shark finds it more difficult than Dervish or me. His magic isn\u0027t designed for subtle spells. With Dervish\u0027s help, he manages to create half a field around the front of his face, but it soon flickers out of existence. In the end he curses, rips a sleeve off his shirt and wraps it round his mouth and nose. For Shark, that\u0027s as good as it\u0027s going to get.\n \"Let\u0027s backtrack,\" Dervish says, nodding at the black panels behind us. \"Try the other panel. It can\u0027t be any worse than - \"\n \"Wait,\" I stop him. The marbles have darted forward and are hovering above a pile of pink and brown intestines. The guts heave upwards regularly, then subside, as though the pile is breathing. There must be a demon underneath, feasting on the guts, burrowing through them like a rat.\n I advance slowly, digging my toes into the soft ground so I don\u0027t slip, only now realising that it isn\u0027t really ground, simply a floor of guts. Maybe we\u0027re inside the stomach of a huge demon like the sky monster. If so, I hate to think of where we might have to pass through to get out!\n I\u0027m almost level with the base of the pile when the guts on top are thrust off. A demon sticks its head out of the mess and happily shakes it hard from side to side. A green head, a cross between a human\u0027s and a dog\u0027s, with long draping ears and wide, white eyes.\n \"Cadaver!\" I roar, startling the demon. When his eyes focus on me, he snarls, claws himself out of the pile of guts and scrabbles away across the floor of intestines.\n \"After him!\" Shark yells, words muffled by his mask. He bounds over the pile of guts, slips and slides into a filthy pool of green and brown liquid. Comes up vomiting again, tearing his mask loose, wheezing for air.\n Dervish darts to Shark\u0027s aid while I jog after Cadaver, not too fast, knowing it\u0027s better to go slow and keep my balance than speed up and slip as Shark did.\n With his long legs and hairy feet - the hairs acting as grips - Cadaver soon pulls away from me, weaving around mounds of guts and leaping over murky, bubbling pools of blood and waste. I don\u0027t worry about losing track of him - the marbles are hot on his trail, obeying my orders, dogging the demon.\n Cadaver treads on one of the longer worm-like monsters. It squeals and writhes beneath him, knocking him over. He screeches with his newly created mouth, hairs on his arms lengthening. Lashes out at the worm, slicing open a long gash down its side. Coiled layers of guts ooze out, adding to the ghoulish stew around it. The worm thrashes wildly, knocks Cadaver down again, pins him beneath its fleshy carcass. Cadaver slashes at the worm with his hairy arms and chews his way through strands of gut which have wrapped round his snout. He soon wriggles free - but by then I\u0027ve caught up with him.\n I grab Cadaver\u0027s ears and slam him down on top of the dying worm demon. I\u0027m roaring triumphantly. Cadaver yowls and tries slapping me away. The hairs of one hand graze the side of my face, slicing my right cheek open. But the blood only drives me on with more passion. I grab his throat and throttle him, forgetting what Lord Loss said about naming the thief, intent only on killing this vile beast.\n The hairs of Cadaver\u0027s hands snake around my neck and tighten, forming a lasso. We\u0027re strangling each other, face to face, snarling. The first to weaken will be the first to die.\n My fingers begin to relax. I glare at them, willing them to close again, to finish the job they started. But they don\u0027t obey. I\u0027m losing - perhaps I\u0027ve already lost. Cadaver is grinning. The hairs tighten another notch, biting into the flesh of my throat, cutting off the last of my air supply. I feel my mouth gasping, eyes bulging, fingers scrabbling at the hairs instead of Cadaver\u0027s throat, trying to undo them.\n Then a dripping, stinking Shark is beside me. A tattooed fist smashes Cadaver between the eyes. The demon grunts and the hairs loosen. Shark hits him again. The hairs slip away. I topple. Dervish catches me and props me up while Shark pummels Cadaver, beating all the fight out of the demon.\n I breathe again, painfully, oxygen trickling through to my lungs. It feels like my throat has been crushed to splinters. Dervish places my hands on my wounded flesh and says, \"Magic.\" I repair the damage. It doesn\u0027t take long. I\u0027m getting used to fixing up my body.\n When my throat\u0027s working normally, I check on Shark and Cadaver. The ex-soldier is still hitting the demon, but with less force, just to keep him in place. Shark catches my eye and winks. \"You can take him off my hands or leave him to me for a few hours. I don\u0027t mind either way.\"\n \"It\u0027s OK,\" I tell him. \"You\u0027ve done enough. Thanks.\"\n Shark steps away and I take his place. Cadaver glowers at me, his face bruised and bloody. I hear Shark complaining about the stench and how he doubts he\u0027ll ever be able to wash himself clean. I tune him out and focus. Recall Lord Loss\u0027 words. Touch Cadaver\u0027s forehead. Start to call him the demon thief.\n Then stop.\n Is this really the one who stole Art? Maybe it\u0027s another demon in disguise and Lord Loss is trying to trick me. I look for the marbles and find them floating a few feet above us. \"Locate Cadaver,\" I mutter and they immediately strike at the demon beneath me, causing him to yelp and turn his head aside. I grab the marbles, stick them in my pocket, then - with one hand still on Cadaver\u0027s forehead - shout, \"This is the demon thief!\"\n Nothing happens. I was expecting a flash of lightning, a peal of thunder or an earthquake, something suitably dramatic. But there\u0027s no difference. I start to shout it again, in case I wasn\u0027t heard the first time. But somebody claps before I get the words out. I whirl and spot Lord Loss, floating in the air thirty feet above us, smiling sadly, applauding sarcastically.\n \"Such courage and imagination, Cornelius,\" the demon master murmurs. \"The marbles were an excellent idea. They\u0027re only ordinary marbles, but you made them a catalyst for your magic, channelled your power through them. That spoilt my fun slightly - brought us to this juncture sooner than I anticipated - but I cannot bear a grudge. You are a true Disciple and master of magic.\"\n He stops clapping and sighs. \"But you miscalled the name of the thief. Cadaver is not the guilty party. One chance gone - you have two more.\"\n \"No!\" I scream as Cadaver shuffles backwards, sneering at me. \"He stole Art! It\u0027s him, not a demon in disguise! It\u0027s Cadaver!\"\n \"Yes,\" Lord Loss agrees pleasantly. \"It is Cadaver. But he is not the true demon thief.\"\n \"But... he must be... he...\"\n Inspiration strikes. Lord Loss said I had to find the true thief. Cadaver was a hired stooge. A puppet in the hands of his employer. He carried out the actual theft of Art, but he wasn\u0027t the brains behind it. The real thief must be the one who planned it, gave the order and paid the bounty.\n I crouch, directing magic into my legs. Fix on Lord Loss. Adjust my aim. Then launch myself at him, flying through the air, leaping like a frog or cricket, covering the thirty feet in the flash of an eyelid.\n Lord Loss is taken by surprise. He brings his eight hands together to ward me off, but too late. I have hold of him before he can repel me. Digging my fingers into his lumpy flesh - dough-like in feel as well as appearance - I scream at him, sure I\u0027m right this time. \"You\u0027re the true thief!\"\n Lord Loss throws me down. I hit a bulging sac of intestines. It explodes, showering me with blood, an acidy liquid and fragments of guts. I laugh carelessly, wallowing in the mess as though taking a bath, jeering at Lord Loss, smug at having beaten him at his own game. Dervish and Shark are staring at me uncertainly. They don\u0027t have my insight. They\u0027re not sure I\u0027m right. But I am. As sure as I\u0027ve ever been of anything. All that\u0027s left now is for Lord Loss to...\n \"Very clever, Cornelius,\" he says, cutting short my celebration. \"But not clever enough, my poor young friend. I am not the true thief.\n \"Two chances gone - one remains.\"\n His smile is chilling. \n","sourceLink":"https://allnovel.net/demon-thief-the-demonata-2/page-24.html","bookId":2176,"book":{"id":2176,"title":"Demon Thief (The Demonata #2)","description":"Storyline: \n Demon Thief (The Demonata #2) \n This story is told through the eyes of lonely child Cornelius \"Kernel\" Fleck and takes place probably somewhere in the United Kingdom or Ireland and during the 1970s. Kernel always been different - he can see strange patches of light in the air around him. The other kids and his parents think he\u0027s mad and as a result he has no friends. But when he manages to link some of the lights to each other, he creates a window into another universe. After seeing a red demon - Lord Loss, although Kernel doesn\u0027t know it - went through and then went back into the window, Kernel makes a rash decision and follows the demon into the other universe. Kernel then disappears for several days. When he returns he comes back with a baby named Art. Kernel has no memory of what he during the seven days he went missing or how he got Art. At first Kernel tells his parents what he remembered up until he went into the light but neither of his parents believe him, thinking that Kernel is lying or is in shock...\n \n","cover":"https://allnovel.net/images/demon-thief-the-demonata-2.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/demon-thief-the-demonata-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:41:33 PM"}}
