{"id":17954,"no":18,"title":"Chapter 2","content":"Maurice had never known an hour so disordered as that which followed his declaration. His mind was like a locomotive factory trying at a moment\u0027s notice to make balloons. It was a scene of astounding and fantastic compromises. The attitude for the occasion appeared to be a clear high joyousness tinged with the overwhelming sense of an unlooked-for favour. Something approaching that in appearance he did certainly achieve; enough to make for the girl the moment of its immense significance; to give it the acclamation, the splendour of crowning circumstance. His gladness, like the colour of a flag that suddenly dyes the air with victory, brought the strangest, the most assuring tumult to her heart. She heard it, as the beleaguered hear the guns that end their siege, too faint, too happy, too amazed to answer. He heard it with amazement too; heard in his own mouth the note of triumph, of a triumph which seemed to put an end to all his hopes, to mock with its thin pretence the lost promise of such a moment, the passionate exultation which it might have yielded him. Yet he heard it; that was something; and, though he hardly knew what he was saying, he could read its radiant answer upon the girl\u0027s face. If he was missing the full measure of the hour—and that was to put his misfortune meagrely—she at least had not suspected it. He had that single satisfaction—but, to his schooling, a supreme one—the reflection, as he voiced it to his trouble, that he was \u0027playing the game.\u0027 He was inspired to suggest tea. They had brought it with them, and, though it might have seemed a higher compliment to forget both that and the hour, it was one that Maurice had not the pluck to pay. He still felt to be an intruder to the occasion, to be sustaining what some one else had achieved. The sense of duplicity made him clumsy as a man under a load; he could not use with a lover\u0027s audacity the exquisite immaturity of the moment. The very kisses which her eyes expected left a traitor\u0027s taste upon his lips. Action, though it was but tea-making, gave him breathing space; it dismissed, for a while at least, the most protesting part of him from service into which so breathlessly it had been pressed. With a kettle in his hand, and under shelter of the hamper, his irresponsible buoyancy came back to him, his humorous appreciation of circumstance even when it told so heavily against himself; and his talk across the table he was spreading was only a shade too vivid to be a lover\u0027s. Its gay note was thrown up by the girl\u0027s silence; a silence lightened only by a happy nod or smile. She seemed to wish, sitting intently there, to feel her senses afloat on the invading flood of his devotion, as a boat is floated by the incoming tide. It was for that she sat so still, unwilling by any impulse of her own, to dilute her consciousness of this strange strong thing, which crept to her very skin and carried her away, surgingly intimate as the living sea. Maurice had set her silence down to shyness, till something in the soft rapture of her face told him its true meaning. The pathos of that and, for him, the shame of it, hurt him as an air too rare to breathe. The thought of this woman measuring with grateful wonderment the magnitude of a thing which had no existence, but in which he had brought her to believe, wrung him with a keen distress. And in that sharp moment of shame and pity he came very near loving her; came near enough, at any rate, to dedicate the future to her illusion. As he knelt before her on the sand, offering her a tea-cup in both his hands as though it were some sacrifice to an idol, he realized, by the glance which accepted both the humour and the service, what a big thing he had in hand. It was big enough even, so he found before long, to hide his own immense disappointment, which shrank into a small affair beside that which she must never be allowed to feel. He had received his discomfiture from a false trust in Fate, but hers would come from a false trust in him. So Maurice reflected as he watched Miss Nevern trying to persuade herself that cake on such an occasion was as easy to consume as cake on any other. In that, however, despite an excellent intention, she did not succeed; and her failure, absurd as it might sound, lit in him a pride of responsibility which her \"I love you\" had not. Here, at any rate, was an unequivocal effect; beyond evasion he was chargeable with this; and no priestly sacrament could have so pledged his allegiance as that little dryness of her throat. She set down her half-emptied cup with the prettiest pretence of satiety, a pretence which Caragh, with the hot thirst of a wound upon him, and having already drained the tea-pot, felt it best became him to ignore. The wind, which had died at mid-day, freshened in the shadows of the September evening, and ruffled the flat face of the water into one rich dark hue. Along the northern shore of the bay the shade of the bluff had fallen, and made a leaden edging to the sea. Southward the low sun blazed, a dull rose-red, against the scarp of cliff, and turned the further waters and the dim head-lands beyond them to a wine-dipped purple. \"It\u0027s as solemnly gorgeous as you could well have it,\" Maurice affirmed as he hauled in the boat, \"and we\u0027re going out of this spiny harbour under all sail to show we take the display in a proper spirit.\" There was something so boyishly absurd in his determination, that Lettice, too numb with happiness to be determined about anything, went with a sigh of abdication into the bow, and leaning over the stem-post, with her fingers through the lower cringle in the luff, called the course with the quick decision of a river pilot. But for one long strident scrape—during which each held a breath—against a sunken ledge which the helmsman found her too close hauled to clear, they came valorously into the open sea, and Maurice, sitting over the gunwale to windward with the sheet in his hand, brought Lettice aft to steer. He had the position of vantage, for she sat a foot beneath him, and, unlike hers, his eyes owed no attention to the sail. She begged him not to look at her; but, feeling that observation was to her advantage, he only complied for a moment with her request. Observation was to his advantage too; for if, with shut eyes, it was easier to remember what he had lost in his new possession, with them open it was impossible to forget what he had gained. Only a dull man would have called Lettice Nevern beautiful, but the dullest could not have thought her plain. She had, in its most dainty shape, that perfect imperfection known as prettiness. Distractingly pretty, most women called her; and men who were not thought easy of distraction had justified the label. She had a figure a sculptor would have prized, full, buoyant, flexible, with the grace of splendid health in every line. It was a consolation, Maurice reflected, to be able to admire an acquisition, even though one did not desire it. She had, too, an admirable temper, an eye for what became her, a dozen interests in the open air. That made for mutual accommodation, and he could imagine nothing in her which could lessen his respect. His ignorance of women was based on too wide an acquaintance to be neglected, yet he felt sure that Lettice was no coquette. And despite the gaiety with which her face was so charmingly inscribed, she could endure quietness—enjoy it even, as four summers at Ballindra proved. On the whole he felt cause to thank Providence, as a man might, able to nurse his damaged limbs after an accident, that the catastrophe was, for him, no worse. He was beginning to wonder what it might be for her. They raced home under more canvas than one who knew the shore winds of Ballindra would have cared to carry; but neither, for diverse reasons, was inclined to prudence, and the wake they blazed across that blue-black surface was a joy to see. Caragh\u0027s right hand went to and fro, as though it held a bolting horse, and the sheet wore a deep red furrow about his palm. Lettice kept her eyes on her work, for, as they felt the tide-race, it took some little coaxing through the stiffer gusts to hold the boat\u0027s nose on the Head in front of them. The wind that swept the sea was channelled by the contour of the cliffs into blustering draughts that streamed from the deep cut coombes, with spaces almost of calm between them. Slantwise across these lay their course, and as the boat leapt, like a hurt thing, at each fresh blow, Maurice could feel the quick restraint of the girl\u0027s guiding fingers. As his arm gave with the gust, the pressure of hers upon the tiller seemed to answer it, and that sensation of swift divination and subtle responsiveness between his hand and hers was worth the risk of an upset, and Maurice only wished it were less impossible to discover if Miss Nevern shared it. He supposed not. Women, so time had taught him, were seldom sensitive to the unexpected. As they cleared the Head, and the mystery of the river lay in the dark hills before them, Caragh came again to his senses. \"Down helm!\" he said. She woke out of her reverie, but with her hand hard over. \"What are you going to do?\" she asked. \"Shorten sail,\" he said, letting go the halyards. \"You\u0027re very cautious,\" she flouted. \"It\u0027s the timidity of sudden happiness,\" he smiled, making fast the first reef cringle to the boom; \"you\u0027ve given me too much to lose.\" She touched for an instant the hand which clipped the leech beside her, and the print of her warm fingers came like an oath for sanctity, turning to truth what had had for his own ear but a jesting bitterness: she had given him too much to lose. \"Well!\" he laughed, when they were going again, as the full draught of the river laid them over, and, ahead, the orange lights of Ballindra gleamed in the cleft purple of the land, \"would you like that tuck out of her skirts?\" She set her lips, as they shaved the outmost ledges of the southern shore, and came about in the banging wind. \"You ought to row,\" she said, smiling. \"Not a doubt of it,\" he admitted blandly; \"you\u0027ve only to say the word.\" But she did not. Though the harbour was not full, there were riding lights enough upon the water to make, in that dusk, the threading of their way exciting, even without the tide under them, which hummed and jumped against the quivering anchor-chains. But she was proud of her seamanship, and of her knowledge of the river, and conscious that the man who watched her could appreciate the skill in every turn of her wrist, and the pluck which kept it steady as they grazed the great black shapes of ships, or spun about as a straining cable snapped up at them out of the dark water. Tim Moran, the old boatman who put them ashore, had a melancholy headshake at her rashness. \"Bedad, sor, it\u0027s not meself that larned her to be so vinturesome!\" he explained apologetically to Caragh as he pocketed an unlooked-for piece of silver at the slip. \"She\u0027s a wilful little thing, I\u0027m afraid,\" Maurice murmured, slipping his arm in hers, as they went up into the obscurity of the shore, \"and rather given to running risks in the dark.\" She gave him her face for answer; and the kiss he put upon it was her seal of safety in the darkest risk that she had run. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3257/89257.html","bookId":597,"book":{"id":597,"title":"The Plague of the Heart","description":"简介： Have you heard, Captain Terrington? cried the girl gaily. There\u0027s to be a Durbar after all! So you were wrong. It\u0027s to be in the Palace too, that you were so set against, and Lewis and Mr. Langford are going with Sir Colvin, and just the littlest gua...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3257","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
