{"id":17956,"no":20,"title":"Chapter 4","content":"Caragh found at his rooms, when he arrived in London, in the forefront of his correspondence, a letter and a telegram. Both were from Lady Ethel Vernon, and had an appositeness with which their recipient could very readily have dispensed. They had been propped against a photograph of the sender, a coincidence not remarkable considering the number of her likenesses which the room held. These agreed in the presentment of a woman, dark and slight, with a finely carried head, deep eyes that might be passionate, and a mouth that knew something of disdain. Caragh took up one of the portraits when he had read his letter, looked at it along while without expression, and set it down again. The letter, which bore a foreign postmark and was some days old, spoke to the writer\u0027s probable departure with her husband for Budapest, where the latter, who had been an under secretary, wished to study some question of religious politics which was to come before the House of Deputies. It groaned at the necessity of such a sojourn at such a season, and suggested, if a hint so imperious could be called suggestion, that Maurice Caragh\u0027s presence might be required in the Hungarian capital. The telegram merely added that it was. Caragh picked up an English Bradshaw, and after turning its pages absently for five minutes in search of continental routes, realized the inadequacy of the volume, took up his hat, and went out. Piccadilly dozed in the September sun, with a strange air of tired quietness, inert and listless as a weary being. A stale warm haze of sunlight filled the air, silent, unstirred, that made a misty thickness in the plumage of the trees, while from some by-street were blown pale vapours with the smoky reek of bitumen, which told of autumn\u0027s leisurely repairs. The dust on the roadway rose about the spray of a water-cart, and beyond it rumbled a solitary bus. On the park-stand waited, driverless, a worn four-wheeler, its horse asleep; and, here and there along the forsaken pavement, desultory figures, which the season never saw there, came and went. Caragh, on the doorstep of his club, inhaled gratefully the dormant air, which sank like an opiate into the senses. How happy if those for whose pleasure this highway rang, worn and sleepless, during the hours of June, could only imitate in their recessions the soothing passiveness of its repose. But the reflection led him to the banks of the Danube, and so, by the Orient express, indoors. There he lunched, looked out his train, worked through his letters, and went out into the dozing afternoon. If he had ever been before in London during its first September days he felt he had been there to no purpose. He had missed it all. The silence, the sense of space, the strange exhausted air, the curious people moving aimlessly about, like the queer creatures that sometimes take possession of a deserted warren. He strolled vaguely through the deserted streets, out of which suddenly the inhabitants had sunk as water through a sieve. A housemaid\u0027s laughing challenge from a doorway to the grocer\u0027s boy rang round an empty square. A lean cat went softly along the pavement, yet one could hear the fall of her pads. Everywhere blinds were drawn behind the windows. The place was in mourning for a people that died annually, like seedling flowers. Caragh drifted from street to street, amused, philosophic, in that oblivion to his own before and after of which he was so profusely capable. When he was tired he returned to the club. Then he remembered; and, after deciding regretfully against the adequateness of a telegram, wrote four pages of penitent affection, which he hoped might read more exhilarating in Ballindra than he could pretend to find them. With their execution his consciousness quickened, and he spent a melancholy evening at the play. Two days later he was in Vienna. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3257/89259.html","bookId":597,"book":{"id":597,"title":"The Plague of the Heart","description":"简介： Have you heard, Captain Terrington? cried the girl gaily. There\u0027s to be a Durbar after all! So you were wrong. It\u0027s to be in the Palace too, that you were so set against, and Lewis and Mr. Langford are going with Sir Colvin, and just the littlest gua...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3257","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
