{"id":17942,"no":6,"title":"Chapter 6","content":"Terrington brought back his men with an undiminished precaution, Mir Khan\u0027s affability merely increasing his distrust, and Afzul Singh, his equal in subtlety and in knowledge of the foe, had prepared a sally should the force require assistance in getting out of the Bazaar. Mir Khan, however, to his own everlasting regret, held his hand, so that the little expedition returned without a shot fired, and the gates of the Fort were shut and barred behind it. Afzul Singh had been already entrusted with the duty of putting every alien out of the Fort, but to prevent more securely the escape of information, the guards were strengthened, and sentries patrolled the entire front of the Fort with orders to shoot any man attempting to enter or leave it before dawn. When the men were dismissed Terrington called Walcot and Dore into the women\u0027s durbar hall and sent for Hussain Shah and Afzul Singh, who were the two senior native officers. \"I should like to break the news to Mrs. Chantry if I may,\" said Walcot in the doorway. \"The news?\" enquired Terrington. \"Of her husband\u0027s death,\" Walcot explained. Terrington\u0027s face showed a certain blankness of apprehension. He had forgotten that there was any one in the Fort, whose hopes or fears could be affected by the confirmation obtained of that morning\u0027s tragedy. \"Oh, certainly,\" he said. The room was a long gloomy one on the ground floor, used by Langford partly as an office, partly as a store. Bales and boxes still filled two of its corners, and the space in front of them was littered with Sir Colvin\u0027s and the Chantrys\u0027 belongings, which were being removed from the Residency with ostentation. One dark window in the further wall lent what dim light the room had, and the table at which Terrington seated himself was drawn somewhat towards it. He was writing when the two native officers entered, and he assigned to them the two seats on his right, with the grave silent courtesy with which the East had coloured so curiously his English manner. Dore, nervously tired by the excitement of the morning, had dropped limply on to a bale of clothing, and lit a cigarette, but the two Sikhs sat erect and impassive beside the table. Clones came in to requisition some stores, and reported Langford to be insensible and sinking. \"If you can spare a few moments you might spend them here,\" said Terrington. The doctor nodded, and sat down on a packing-case beside Dore, rising again at once as Mrs. Chantry, followed by Walcot, entered the room. She was wearing still the frock of creamy lace in which she was to have watched the polo that afternoon. Her face looked listless and white and faded above it like a broken flower. Her eyes sought Terrington\u0027s in the dim room with a sort of frightened submissiveness. \"May I come in?\" she said. \"Of course,\" he answered, getting out of his chair to hand it to her; but Walcot had already drawn forward a seat of Sari rush from the relics of the Residency, and she dropped into it limply, with a nod of acknowledgment to Terrington, amid all the crushed and huddled fragments of her own lost little home. Walcot sat down on a box beside her. A tiny jade god slid down the pile of rugs and bowls and cushions, and lay at her feet with a severed arm. He had been for years the very dearest of her household treasures, and now to find him maimed and friendless moved in her a despondent misery which she had not felt at her husband\u0027s death. She hid the little broken body in the hollow of her hand, and sat there, her head bent over it, shaking with sobs. It was the very smallness of the grief that brought her tears. Terrington blotted the notes he had written and laid down his pen. He made no sort of preamble: for anything in his manner the occasion might have been the most ordinary in the world. \"I wish,\" he said, \"to explain my plans. Some of us may not come through the next few weeks, and I don\u0027t want those who do to be saddled with my mistakes. So I\u0027ll enter any protest, to cover you in case I\u0027m not with you at the finish. We leave Sar to-night.\" Even the two dark impassive faces on his right reflected the unexpectedness of his announcement, and Walcot half rose to his feet. \"Abandon the Fort?\" he exclaimed. \"Abandon the Fort, and everything we cannot carry, and retire by the Palári upon Rashát,\" said Terrington quietly. \"But I understood, if you\u0027ll excuse me,\" continued Walcot, trying to control his excitement, \"that all the defences of the Fort which we\u0027ve been at for the last month were your idea.\" \"They were,\" said Terrington. \"Have you changed your mind then?\" asked the other sharply. \"No,\" said Terrington slowly, \"but I\u0027ve changed my position. I\u0027ve only so far had to decide how to make the Fort defensible if it had to be defended.\" \"Yes, but!\" Walcot objected, \"the clearing of the Residency, the blowing down of these trees; all that has taken place since! What\u0027s been the object of that if you didn\u0027t mean to stay?\" \"In war,\" said Terrington quietly, \"it\u0027s sometimes as well to keep your intentions from the enemy.\" \"Did Sir Colvin mean us to stay here, sir?\" enquired Dore. \"Yes,\" said Terrington. \"Sir Colvin intended to hold out in Sar if anything went wrong till a relieving force could get up here from Sampur.\" \"You absolutely disagree with him, then?\" Walcot rapped out. Terrington looked at him thoughtfully. \"I have another point of view,\" he said. \"And what\u0027s that?\" snapped the other. \"He was a political officer and I am a soldier,\" said Terrington simply. Dore turned his shoulder upon Walcot, with a wrinkle of annoyance at his carping note. \"Don\u0027t you think we could hold Sar, sir?\" he asked with boyish eagerness for a stand-up fight. \"Yes,\" said Terrington, kindling sympathetically at the thought of the fight he too had longed for, \"I think we just could, though it might be a near thing. I\u0027ve decided to clear out,\" he went on, addressing the others, \"because the value of being penned up here doesn\u0027t impress me politically, and because digging us out of this in mid-winter would mean a horrible waste of life. There are only a few hundred of us to be wiped out at the worst, but it might take thousands of the men who came to save us. These little sieges are often very costly things.\" \"I shouldn\u0027t think our retirement will be very popular at home,\" Clones suggested. \"I don\u0027t suppose it will,\" said Terrington; \"at home they\u0027re rather fond of a siege; it makes the paper more interesting.\" \"And how about the intentions of the Government, Colonel,\" Clones continued in his reasonable way; \"I suppose you were sent up here to carry them out.\" \"No doubt,\" said Terrington with his grave smile, \"but without being told what its intentions were. Consequently one rather seems to be here to make intentions for the Government, and I\u0027m very possibly making them all wrong. But that\u0027s their fault for not having sent a better man.\" \"There\u0027s one point, Terrington, you don\u0027t seem to have considered,\" Walcot interjected; \"that you\u0027ve got to take a woman over passes which even the natives won\u0027t cross at this time of year.\" \"I haven\u0027t considered it for a moment,\" said Terrington shortly. Walcot\u0027s face curdled with anger. \"That\u0027s hardly been the habit of Englishmen hitherto out here,\" he exclaimed. \"I dare say not,\" said Terrington with dry indifference. Rose Chantry, with her hand still closed about the little broken god in her lap, looked up at him through the tears that hung across her eyes. Beyond the cool darkness of the entrance door, against the far wall of the blazing courtyard she could see the row of charpoys with their burden of dead men, mere rolls of sallow dungari cloth, waiting till the grave being dug beside the Residency gate should be wide enough to hold them. It was the most dreadful moment of her life, when she needed above all to be petted and comforted into a sense of her importance, but the man who should have done it was indifferent even to her safety. She had already begun to cheer herself with the thought of a siege; the delicacy of her position; the solicitous homage of all the men; her cheerful and inspiring effect upon them; the excitement in England so intensified by the presence of a woman among the besieged; the accounts of her in the papers, made more touching by her loss; and then the thrill of the relief—she took the relief for granted—the sound of the guns, the fight through the streets of Sar, the cheers of the British troops, the ardent congratulations, the soft abandonment of that moment at the end of the suspense, and herself the one woman in a British army. And the coming home after such an experience; the woman of the moment, every one wanting to meet her; perhaps a command from the Queen. All her dream was shattered by Terrington\u0027s implacable decree. She looked at him with despairing hate. She thought of the reckless sacrifices Englishmen had made for women during the Mutiny, and hated him the more. She felt sure that she could never live through the snows of those passes about which she had heard such awful stories. The cold would kill her; the cold always shrivelled her up; and she had nothing to wear, nothing warmer than was wanted for an Indian winter. And that very morning, only a few hours back, as the party started for the Durbar, she had exulted in her triumph over him, she whose folly had given everything into his hand! What ages it seemed since Lewis had swung buoyantly into his saddle, and Sir Colvin, ruddy and cheery, had waved her an \"au revoir.\" Now they were rolls of yellow dungari lying out there in the sun. In her absorption of self-pity she scarcely heard Captain Walcot\u0027s expressions of dissent from his leader\u0027s plans, which were more forcible than soldierly. He was seething with wrath at Terrington\u0027s treatment of her, and Terrington, aware of his excitement, but quite at fault as to its cause, heard him with determined patience. \"And by which pass do you mean to retire?\" he exclaimed at last, unable to shake Terrington\u0027s resolve. \"By the Palári,\" said the other. \"The Palári!\" cried Walcot derisively. \"Why, it\u0027s the worst pass on this side of the Pamir. May I ask why you\u0027ve chosen it?\" \"Have you been through the Palári or Darai?\" Terrington enquired. \"No.\" \"Then you can hardly appreciate why I\u0027ve chosen it,\" said Terrington quietly. \"The Palári is the only one which we\u0027ve a chance of reaching without being cut off; it\u0027s the only one not commanded from above at this time of year, and Freddy Gale, holding this end of it at Rashát, is absolutely done for unless we dig him out.\" His reasons were listened to by the room in absorbing silence. Then Walcot blurted out: \"Is this a council of war?\" \"No,\" said Terrington; \"it\u0027s an opportunity for protest. I wished to put your advice on record, but I didn\u0027t propose to take it.\" Walcot thereupon declared himself emphatically in favour of remaining in Sar; Dore followed him less assertively. Clones gave a shrug of his shoulders. \"It\u0027s all one to me where I doctor you,\" he smiled. Terrington turned to the two men beside him, who had sat, immovably attentive, throughout the discussion. \"We are as the print of thy footsteps,\" said Afzul Shah, and Hussain nodded. Terrington wrote for some moments, then read aloud his own dispositions and the objections which had been urged against retirement. His own plans and reasons were very bluntly outlined, but he gave the case for the occupation of Sar with a fulness and cogency that astonished its advocates, who did not suspect how dear the scheme had been to his ambition, nor what its abandonment had cost him. He handed the paper to Walcot. \"Will you sign it?\" he said. The best that was in the other man responded instinctively to such treatment: \"You\u0027ve put it a long way stronger than I could myself,\" he said, taking up the pen. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3257/89245.html","bookId":597,"book":{"id":597,"title":"The Plague of the Heart","description":"简介： Have you heard, Captain Terrington? cried the girl gaily. There\u0027s to be a Durbar after all! So you were wrong. It\u0027s to be in the Palace too, that you were so set against, and Lewis and Mr. Langford are going with Sir Colvin, and just the littlest gua...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3257","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
