{"id":17943,"no":7,"title":"Chapter 7","content":"Langford came back to consciousness an hour before he died, and Terrington sat beside him to the end, writing instructions to cover every detail of the departure while he spoke and listened to the dying man. Langford was a fine horseman and a very capable soldier, and the only one of his subordinates on whose decision Terrington could rely. He had left in India an uncompleted love affair but he spoke of nothing in his last moments but the safety of the force. \"You\u0027ll have to watch those Bakót chaps,\" he murmured, \"there\u0027s no fight in \u0027em.\" And again with more difficulty. \"Those beggars \u0027ll cut you off at the Sorágh Gul; get round by the Bewal road. You\u0027ll have to smash \u0027em there.\" His mind was evidently away with the retreating troops. His grip tightened on Terrington\u0027s hand. \"If only I could go along with you, old man. Oh, it\u0027s hard to come to grief at the first hurdle.\" He shut his eyes with that inconsolable sigh, and it was his unconscious soul that whispered, \"Give my love to Helen,\" with the last beats of his heart. Terrington went on writing as Langford\u0027s head fell back, then he loosened the dead man\u0027s fingers from his hand, and left the room. The sheer pressure of thought seemed to have squeezed out of him the power of feeling. In the women\u0027s durbar hall he found Walcot and Mrs. Chantry turning over the litter of the Residency rooms. Terrington had left the porterage of the reserve ammunition to Walcot\u0027s arrangement, and had been expecting his report for half an hour. Walcot had, however, considered the packing of Mrs. Chantry\u0027s boxes of more importance. The expression of Terrington\u0027s opinion on his preference was a good deal tempered by Mrs. Chantry\u0027s presence; but even so was caustic enough to burn itself into Walcot\u0027s memory. As he left the hall without a word, Rose Chantry lifted an Afghan poshteen from the heap beside her. \"Did you send me this?\" she asked. It was lined with astrachan, and exquisitely embroidered, and was the most valuable of Terrington\u0027s few possessions. \"Yes,\" he said, \"it was the only warm thing I could get for you. You will want everything you can wear, and you can put that on over a good deal. There are some boots to come.\" She did not know that he had sent her the thing of which he had most need himself, and his giving had about it no air of gallantry; but the proof that he had thought of her at a moment when he had to think of everything touched her far more than had Walcot\u0027s voluble commiseration. She held out her hand to him and tried to speak, but her throat closed and her lips trembled. He took her hand in both of his. \"Poor, poor thing!\" he said. Gholam Muhammed entered with the long lamb-lined boots at that moment and laid them with a salaam in front of her. They had been made for Terrington and were long enough to reach to a man\u0027s knee, and Rose, whose every breath at the moment compromised with a sob, thrust out her pretty foot beside them with unconscious coquetry. \"Oh, that\u0027s all right,\" said Terrington, smiling; \"they\u0027ll go over the others. You\u0027ll not find them a bit too big.\" He lifted one, with its tassels and showy crimson calf, and, taking her wrist as if she had been a child, thrust her hand down through the woolly lining which almost filled the top. The loose sleeve slid back to her elbow against the leather edge, and as she looked into his face with a surprised compliance, something in the softness of the curling silken warmth against her skin touched her suddenly beyond her power of control. She snatched her arm away from him, and, flinging herself upon the heap of curtains and cushions, burst into tears. Terrington, completely at fault, made no attempt to console her. He knew when to leave a man unhindered and to give a horse its head, and the instinct helped him with a woman\u0027s tears. He stood watching her sobbing shoulders, and the shadows on her golden hair, but his thoughts, the instant they were freed from her, flew forward to the forcing of the Sorágh Gul, the double-headed defile on the road to Rashát, where he knew Mir Khan could intercept him and compel him to face an attack from three sides at once. He tried to compel his memory to yield some details of the position which he might turn to account, for his own field-sketches only supplied features which would be useful to the enemy. The sinking of Rose Chantry\u0027s sobs brought his mind back to the dim hall. He put his hand gently on her shoulder. \"What was it, child?\" he said. She raised her head from the crimson silk, leaning towards him against his hand, and mopping her eyes with the ghost of a handkerchief. \"It was the fur,\" she sobbed; \"it felt so soft.\" The explanation explained nothing to Terrington—a woman never seemed so unreasonable to him as when she gave her reasons—but its incomprehensibility absolved him from attempted consolation. \"Well,\" he smiled, \"you mustn\u0027t cry again till you\u0027re across the border. Hukm hai!\" She looked up at him, leaning still against his hand. \"I\u0027m afraid of your orders,\" she said shyly. \"Well, there\u0027s another,\" he went on with his paternal air; \"you must wear everything warm you\u0027ve got and pack only what you can put on later.\" \"I\u0027ve nothing warm,\" she said with half a sob. \"Oh, come!\" he rallied her; \"then I\u0027ll have to send round the men who are padding your doolie to pad you too! How about that shooting suit of yours?\" His remembrance of it pleased her far more than her possession. \"It\u0027s not very warm,\" she murmured. \"Well, it\u0027s a good deal warmer than these flimsy things,\" he said, lifting the laces that lay round her neck; \"and we\u0027ll turn a feather quilt into a petticoat for you, cut you a boa out of the mess-room bearskin, and put the poshteen on top of all. Mind, you\u0027ll have to parade in full marching order, or we\u0027ll leave you behind for Mir Khan to take care of.\" An orderly entering with a chit at that moment made an end to the boyish talk that was meant to put fresh heart into her, and Terrington, after a glance at the scrap of paper, left her at once with a smile and a nod and an instant\u0027s tightening of his fingers upon her shoulder. At sunset he read the sentences of the burial service over the trench beside the Residency in which the bodies of the three Englishmen were laid. The dusk was spreading under the autumn twilight, while the pale spaces of eternal snow beyond Rashát were veiled with rose in the clear heaven above the purple ramparts of the valley and the flames of the pyres on which the dead Hindus were burned blazed in clear spires of light through the increasing gloom. Rose Chantry stood next to Terrington, in a shooting costume of golden-brown tweed, with a leather hunting-belt, a broad band of leather about the short skirt, brown leather boots that laced half way to the knee, and a brown tam-o\u0027-shanter pinned tight upon her curls. She hardly knew what he was reading as she looked across the miles of evening to the tinted snows, and heard the crackle of the funeral fires on either side of her. Life had been suddenly changed altogether into something hard and glaring and stale and ugly like a ball-room opened to the dawn, and she felt to be growing hard and plain and matter of fact to match it. The melancholy volleys were fired above the grave, the level flash of orange light splitting the darkness like the sweep of a sword, for Terrington, well aware that he was watched, would omit nothing which might by its absence suggest a desire for concealment. While the ostentation of the funeral was distracting the attention of Mir Khan\u0027s spies, all the outward openings in the walls were being closed, so that when the funeral party returned to the Fort the arrangements for immediate departure could be pushed forward with continued speed and in complete concealment. The twinkle of lanterns everywhere made the labyrinth of the old mud walls look as if invaded by a flight of fire-flies. In ordered lines across the courtyard the bearers squatted, brown and impassive, beside their burdens; line after line, hour after hour, filing forth from the dark doorways of the Fort, till half the space between its walls was full. The other half was covered with accoutrements and bristled with piled arms. In the stables the Lancers were removing every needless detail from their equipment, and a wisp of rag was twisted round any piece of metal from which a sound might be shaken. In the long gully between the stable and the Fort stood strings of mules with a few zabus, snorting and shuffling under the loads that were being heaped upon their backs. An hour after midnight the gate of the courtyard was thrown open, and a dark stream of horsemen poured silently out and turned north-east towards the river. They had left their lances broken behind them, but took every ounce of food that they could carry and three hundred rounds a man. Hard on the dust of their hoofs followed the Sikhs and Bakót levies under Dore; the Sikhs, long and lithe, fine marchers and good fighters all of them; the Bakót men short and square, very doubtful shooters and untried in fight, but hard hill-men, at home in the snow, and equal to almost any labour. After them came the long lines of mules out of the gully snorting and shaking their packs and harness, and kicking up more dust than the horsemen. Rose Chantry\u0027s doolie followed in rear of these. It had been padded for her with quilts of Armak wool and lined with camel\u0027s hair curtains fastened down to keep out the wind, and carried a mattress of feathers, a span in depth, to save her from the joltings of the road. Terrington had literally sketched its construction with one hand while he wrote a despatch with the other, and had himself gone down to the yard to explain away the carpenter\u0027s difficulties. But he shook his head at the boxes in which Rose had packed what she considered \"absolutely necessary.\" \"No good!\" he said. \"Even if we got them to the Palári, we\u0027d have to leave them in the snow.\" \"How many bearers have I?\" Rose demanded. He looked down at her smiling. \"Four for the doolie and a mule for your baggage,\" he said; \"about what\u0027s allowed for half a company. And there\u0027s a tent for you on the mule already.\" \"I can have some one else\u0027s tent,\" she exclaimed crossly. \"No one else has a tent,\" he said with the same dry smile. She turned from him petulantly. \"You can leave them all behind if you like; I don\u0027t care!\" Yet she repacked submissively—with the help of the khansamah, whom Terrington sent to the assistance of her pride—what she most needed in the space allowed her; with a new dull kindling of anger against the man who could compel her so easily to obey. But the eager preparations in the darkness subdued her with the sense of an impending fate, the silent streaming forth of the little force into the night towards the day of battle and the awful snows, and she was gratefully reassured when Terrington suddenly appeared beside her as the doolie drew up, and helped her in with a comforting pressure of the hand. \"Sleep if you can,\" he said; \"we\u0027re perfectly safe for the next twelve hours.\" His own beloved Guides brought up the rear, and he rode last with them out of the Fort. For the next day and night danger only could threaten from direct pursuit, and so his place was for the present with the rear-guard. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3257/89246.html","bookId":597,"book":{"id":597,"title":"The Plague of the Heart","description":"简介： Have you heard, Captain Terrington? cried the girl gaily. There\u0027s to be a Durbar after all! So you were wrong. It\u0027s to be in the Palace too, that you were so set against, and Lewis and Mr. Langford are going with Sir Colvin, and just the littlest gua...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3257","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
