{"id":100712,"no":27,"title":"Page 27","content":"\\n\\n Jorgen went back to all fours and leaned forward, his face very near to mine. His breath stank, and he tilted so that I could see into his nearest black eye. In that one eye was all the hatred Jorgen felt for me, for the situation he was in—where I had put him. He’d kill me if he could—but he needed me right now. We’d get along until then, was what that eye told me, but afterward? Who knew.\\n\\n I looked back into my apartment and waved to Catrina. “Okay. Let’s go.”\\n\\n She let Jorgen smell her precious sweater. I’d never seen a Hound do what one does before. He was still for a moment, waiting. And then I’d have sworn he seemed pleased. He bounded to the bottom of the stairs, rippling like a weasel or ferret or some other creature with an extra half a spine, then looked back, waiting for us.\\n\\n I figured we were walking toward the station halfway there. Catrina was quiet, just watching Jorgen pace along. The Hound could be faster than we were, but there was no point in jogging after him when we didn’t know how far we’d have to go.\\n\\n “How long have you known him?” Catrina asked me.\\n\\n “I first met him in December.” I didn’t want to go into the details of my past with Jorgen. “How long have you known Hector?” I deflected instead.\\n\\n “Since December.”\\n\\n I was a little stunned. “Really? He seems so entrenched here.”\\n\\n “Oh, he is. He’s done a world of good. He was a friend of the original doctor, who was getting quite old.”\\n\\n “Hmm.” That didn’t fit the picture of Hector’s life that I’d created in my head.\\n\\n When we reached the station, I wondered how Jorgen would get through. I fed in my card for myself and Catrina, and the turnstile clicked as we passed through. I looked back at Jorgen, trapped on the other side. Leaning back, I passed my card through again, and he reared back onto two legs, waddling through the turnstile in a creepy half-human fashion, jerking spastically forward like a monster chasing me in a bad dream. When he was through he fell to all fours again, his ill-furred loose skin swinging down after him.\\n\\n There was no way not to see him in the station’s brighter light. His human skin was pale and blue-veined where it was visible in patches through his fur. He looked so wrong it made it hard to talk to him. “Where to now?” I asked aloud.\\n\\n He got his bearings, and we waited quietly for the southbound train.\\n\\n Why wasn’t I surprised when we got off at the clinic’s stop? The homeless people were sleeping in their makeshift shelter. I hoped that neither of them had the don like Catrina—I didn’t want to have to explain Jorgen to anyone. At the same time, I felt safer traveling at night with a nightmarish creature beside me. I hoped that just because normal people couldn’t see him didn’t mean he couldn’t affect them. I’d hate to get into trouble and not be able to count on my horrific imaginary friend.\\n\\n “Here?” Catrina asked, plainly disappointed when we reached the bottom step.\\n\\n “You wanted somewhere more exotic?”\\n\\n “I just figured she wouldn’t be so close.”\\n\\n Because close … was probably bad. The best answer for why Luz hadn’t been able to find Adriana was that she was dead after all. I could see Catrina steeling herself to find out the truth, any truth, just to finally know. I didn’t respond.\\n\\n We walked in a direction I hadn’t gone yet on my short tours with Olympio and last night with Hector. At night, this side of town seemed much grimmer. The colors were washed out, and all that showed up was dirt and darkness. A few dogs ran up to us as we passed an alley—half feral and growling. Jorgen leered at them, and the shy ones ran away. The braver ones trailed us with a litany of barks, until yells of frustration from the closed windows we passed shook them off.\\n\\n “Can he tell us what we’re in for?” Catrina asked.\\n\\n “I don’t think so.” At County Hospital, for patients who couldn’t talk or write, we had boards with likely complaints. They could point to a picture of a toilet, and we’d know to bring a bedpan. What kind of board of horrors would Jorgen need to tell me what we were going into? A knife, in the alley, with Colonel Mustard. Heh.\\n\\n There were some people sleeping in the street—on a hot night, you didn’t need a shelter. And if you were too drunk or crazy to get into one, odds were that no one would mess with you.\\n\\n Other people were lurking in corners. I could feel them watching us. I didn’t know if it was Jorgen’s presence that kept them at bay, or if we possessed some frightening luck.\\n\\n We turned onto a new block, and there was a bright light at the end of it. My first thought was of a train. I couldn’t help but stare.\\n\\n “Here?” Catrina whispered in disgust. “All this time—here?”\\n\\n An effigy of Santa Muerte was standing in the window, draped in a purple robe, trimmed in gold, with embroidered gold-thread stars. The street was strewn with flowers and petals. I had a suspicion where we were.\\n\\n “Maldonado’s current church?” I guessed. She nodded. The altar’s light illuminated the grimace on her face. We walked toward the church, Jorgen bold, us more slowly behind.\\n\\n A person raced out in front of us, crossing the street, and started sweeping up the flowers with both arms.\\n\\n “Oy!” A man I hadn’t noticed stepped out from beside the altar, hidden by the shadows of the building behind. “Stop that!” He shoved the other person down, and pulled back his leg like he was going to kick whoever he’d shoved. I saw a bony arm rise up in supplication.\\n\\n “Hey!” I said, without thinking about it first. Catrina yanked me back. The man stopped, mid-kick, distracted by me, and the person I’d saved scrambled over. In the altar’s light, the bony flower thief had stringy hair and was wearing two hospital gowns, one in each direction, only three buttons snapped between them. “Oh, God. Not you.” It was the woman I’d saved, who’d infected me.\\n\\n “¿Quién eres?” the man said, coming over.\\n\\n “You’re kicking someone’s grandmother!” I said, emboldened by Jorgen’s presence beside me.\\n\\n “She’s stealing flowers to resell. It’s against the law. Those flowers are Santa Muerte’s.” I could see the three cross tattoos on either side of his neck.\\n\\n “The flowers are in the street. Technically they’re trash,” Catrina said, stepping forward, into the altar’s light.\\n\\n “Cállate, no sabes lo que estás hablando,” he said, and stepped forward. I really hoped Jorgen was looming somewhere behind. “Wait—I know you—” He looked Catrina up and down, then put a hand to something at his waist.\\n\\n Jorgen bowled him down. The man fell with a grunt, and Jorgen’s mouth stretched comically wide. His jaw unhinged, like a python’s, and he barely had the man’s head in his mouth before the man began to scream. Three bizarre gulping bites and the man was gone; only Jorgen remained.\\n\\n What had that man been reaching for? A gun? A knife? A phone? Too late now, we’d never know.\\n\\n “Where did he go?” Catrina whispered, horrified.\\n\\n “Do you really care?” I said, my voice rising higher. Jorgen’s formerly slack-skinned stomach was stretched taut like a drum. I thought I could see a foot pressing out from the inside, like a perverted kicking baby.\\n\\n The elderly woman started babbling between us, holding her hands up in a placating fashion. I gladly concentrated on her instead.\\n\\n “Grandmother—Abuela—” I said, trying to calm her down. She must have made it to County; I recognized the pattern of her hospital gowns. I reached out and touched her forehead, and she didn’t jerk away. She didn’t have a fever, that was good—hopefully she wasn’t contagious anymore. “What happened to you?”\\n\\n She began speaking in fast Spanish that I couldn’t understand. Catrina translated quickly. “She doesn’t like it here, everyone is mean to her, there is no respect left in this world. And she’s scared of that dog.”\\n\\n Well. She had every right to be. She bent over and started scrabbling on the ground, rooting through the discarded flowers like she’d lost a contact lens. I didn’t want to leave her behind here for the next Three Crosses guard to kick. “Catrina—is there somewhere you can take her?”\\n\\n “Why?”\\n\\n “We can’t just leave her here is why.”\\n\\n “Doesn’t she have a home?”\\n\\n “Look, Jorgen will only listen to me. And we’re near where your sister is. Maybe you can just trust me to find things out.” I didn’t want to state the obvious: that we both knew what the answer would be—that Jorgen would most likely lead me up the street so he could dig away at a shallow trash pit in a narrow backyard. I gestured to the elderly woman. “She needs your help. Can you take her back to the Reina’s? Get her some food?”\\n\\n Catrina looked from the old woman to me, and then past us to Jorgen, whom we’d both just seen swallow a man alive. Even though she had the don, the weirdness tonight was mounting in a way I could tell made Catrina uncomfortable. Maybe that, and being too close to the final truth. She frowned but agreed. “Okay. But you better come to work tomorrow and you tell me what you find out.”\\n\\n “I will. I swear it.”\\n\\n Catrina reached out and gently herded the old woman away.\\n\\n CHAPTER TWENTY-SEVEN\\n\\n “This whole night is hard to swallow. But you know all about that, huh?” I asked Jorgen in an attempt to be lighthearted. He had just eaten a person. It was weird. Should I offer him some Tums, or should I go off and violently puke out my disgust in a corner? I didn’t know, so I decided to press on. “Where to?”\\n\\n Jorgen took off toward the far end of the street, and I followed him. We reached an alley, and Jorgen dove in. I chased after him. “Hey! No eating people!” I whispered as loudly as I dared.\\n\\n We snaked to the back of the building we’d just been in front of. There were dogs in cages out back. They started whining as soon as they felt, or maybe saw, Jorgen. Trapped in cages, all of them were cowed. \\n\\n","sourceLink":"https://allnovel.net/shapeshifted-edie-spence-3/page-27.html","bookId":2620,"book":{"id":2620,"title":"Shapeshifted (Edie Spence #3)","description":"Storyline: Shapeshifted (Edie Spence #3) \\n Nurse Edie Spence is once again called upon to save a life…and this time, it’s personal. Can her new community of zombies, vampires, and shapeshifters come to her rescue when she needs them most? \\n When Edie was fired from her paranormal nursing job at County Hospital, her whole world came crashing down. Now she’s is once again shaken to her core. Her mother is deathly ill and there’s only one thing that will save her: vampire blood. But with the paranormal community shunning Edie, where can she obtain it…without losing her own life in the process? \\n SHAPESHIFTED \\n Edie hopes to procure it at her new job at the clinic across town, where the forces of evil loom large. Vampire gang wars are rampant. Old underground enemies are rising to the surface. And Edie’s zombie ex-boyfriend has arrived at the scene—but is he the same man he used to be? And what should she make of the enigmatic doctor with whom she shares an unexpected connection? She’ll have to figure it out soon, because all hell is about to break loose—literally—and time is running out…\\n","cover":"https://allnovel.net/images/shapeshifted-edie-spence-3.jpg","author":"Cassie Alexander","type":"Horror","source":"allnovel","link":"https://allnovel.net/shapeshifted-edie-spence-3.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:54:09 PM"}}
