{"id":100714,"no":29,"title":"Page 29","content":"\\n\\n “Come on already.” I waved him to come forward. The charge around me, what I’d felt when I first came into this cursed place, was increasing now. The pins and needles were beginning to feel more like teeth.\\n\\n “I can’t. I need your help.” He reached out to me, with his arm that ended in a stump.\\n\\n “And swear to help my mom,” I added.\\n\\n “I swear, but only if you hurry the fuck up,” he hissed.\\n\\n I’d wanted to save my mom, right? And I’d found Adriana. Only I couldn’t get her out. I was torn between the two rooms, like a kid frozen between horrors at a haunted house. Neither of the rooms was a good option, and everything felt like it was getting worse, fast—it was act, or run, and don’t stop running, don’t think of looking back.\\n\\n I ran toward him instead, and drew myself up short at his bedside. He was lashed down, restrained across his chest, abdomen, thighs, and feet. I ratcheted the ties off him, unlacing their ends, freeing him. He gasped as the last one came loose, and pushed himself up.\\n\\n He lurched up, swung his arm around my neck, and shoved himself off the table. He hobbled, as if one of his legs didn’t work. Because it didn’t. I looked down at his other flaccid arm.\\n\\n “The bones. They take them out each night. Alternating. And then I heal, and then they take them out again.” His voice was dancing on the edge of mania.\\n\\n I grit my teeth to not puke, and took a step forward. Stumbling, he came with me. Okay, okay, okay. Do this. Don’t run.\\n\\n “Jorgen’s outside.”\\n\\n “Good. Let’s go.” Dren said, his face tucked in against my neck.\\n\\n I would have rather saved the old grandmother again than Dren. This place was so much worse than the storm drain where I’d found her. It’d only been trash there, things forgotten. This place was full of bad intent. Someone had done this to Dren—was doing that to Adriana.\\n\\n “Is there any way—” I started to ask, even though I had no idea how I’d manage to carry them both out. And Dren couldn’t even use both his arms.\\n\\n “No. She’s as good as dead. Just hurry—go—” he pleaded.\\n\\n I was saving the vampire instead of the girl. I heard her whimpering as we crossed the upper landing. She must know we were leaving her behind. She deserved saving more than Dren, but he was the only one I could get out. It felt so wrong, but I couldn’t think of how I could undo her cage’s knot.\\n\\n How much more moral ambiguity could I take? I’d work on sorting it out tomorrow.\\n\\n “I’ll come back,” I whispered to the girl, praying that she could hear me, that she’d understand—that no one had ever lied and told her that before.\\n\\n I just needed to get Dren over to Jorgen. Who knew where the hell they would go together, but after that, he would owe me. This had to be worth some blood.\\n\\n And then maybe I could come back for her. I didn’t know what I could do against welded rebar and magic, but there had to be something, something, something—we reached the top of the stairs, and the door opened below.\\n\\n Fuck.\\n\\n Dren started panting into my neck. “Don’t let him hurt me, Edie. Don’t let him hurt me again—” His voice was rising like a boy’s.\\n\\n “Shhhhh.” There was nowhere for us to hide, only one way out. I thought about throwing Dren down the stairs—it wasn’t like he could die, right?—and somehow tumbling after him, getting the door open again, somehow hauling Jorgen inside to help us.\\n\\n That was a lot of somehows.\\n\\n The bottom floor’s new occupant arrived at the bottom of the stairs, putting his foot on the first creaky step. He stepped into the half-light the downstairs switch provided. And I knew him.\\n\\n “Ti?” My zombie ex-boyfriend. I almost dropped Dren in surprise.\\n\\n “Ti—this is awesome timing—can you help?” I shouldered Dren up higher as he hung limp against me, like a rag doll. “Dren’s been hurt, and there’s this girl upstairs—” I began, and I realized my great luck. “You’re strong enough to open her cage, awesome!”\\n\\n “Edie,” Dren warned, with true fear in his voice.\\n\\n Ti was silent as he came up the second and third stairs.\\n\\n “Ti?” He had to have seen me. Right? “Come on. Hurry up and help.”\\n\\n Dren started quivering, trying to control his disobedient limbs and lurch away. “See if you can get us past him—hurry!”\\n\\n “What—” I looked down at Dren, who was trying to let go of me and brace himself against the wall, and then back to the still-ascending Ti.\\n\\n Who was holding a long butcher knife.\\n\\n “No. No no no. This is not happening,” I bartered aloud. I backed us up an awkward step as Ti rose. “Ti—you can’t do this. This isn’t you.”\\n\\n The Ti I knew put honor above almost everything else in life. Wanted to help people, not hurt them, not unless they deserved it. Wanted to get to go to heaven when he died, once he’d earned back the lost half of his soul. “Ti, please—”\\n\\n I could see his expressionless face. There was nothing of the man I’d once loved there, nothing of anyone, nothing at all.\\n\\n “Ti—stop,” I ordered, hoping it would trigger something in him. “Stop this right now. I’m Edie. You remember me. I know you do.”\\n\\n The electric currents of this place were roiling now; it felt like my hair was on end. I pushed Dren sideways, into the wall, and blocked him from Ti with my body. I was going to be killed by my zombie ex-boyfriend, and my bones put into the room with that poor woman. Silver didn’t work on zombies. I pulled out my badge and prayed to someone, anyone, that it might still protect me the way it used to when I was on Y4.\\n\\n It struck up like a lit match, and Ti paused one stair down from us.\\n\\n “Dren—go. Somehow. Just go.”\\n\\n Dren fought against my back, and I moved forward. He fell down a few steps, tumbling past Ti, and then started crawling forward, dragging himself down the stairs with his one good arm.\\n\\n Ti made to follow him. I raced down the stairs until I was below him, badge still out. The electric jolts were sharper, running up and down my body in sharp snaps, like the charges from a violet wand. My badge sputtered like a dying sparkler, and Ti took a step down, implacable, following Dren. I put myself in his way.\\n\\n “Ti, say something,” I pleaded, but he wouldn’t. Or couldn’t. I was close enough now to see that his eyes were glazed. He was not himself here. He took another step forward, and I took another step back.\\n\\n “Please, Ti. No.” The butcher knife was still at his side. I was in striking range now. I had to believe that Ti wouldn’t kill me—I put my dying badge against Ti’s chest, breathing heavy, the electricity in the room buzzing in my ears. We danced together down another stair.\\n\\n “Ti—I know you remember me.” His eyes tracked me. Was that good, or bad? I hoped that whatever in him was human was listening. “You broke up with me once. You do not get to kill me again.” He stopped advancing. The knife was still low. I could hear Dren behind me, pulling himself against the linoleum floor.\\n\\n “I’m out!” Dren called from below, just as the light from my badge disappeared.\\n\\n I took three steps back. Ti didn’t follow me. His body might belong to someone else now, but his eyes were still his, watching me. I didn’t want to leave him here. “Ti—”\\n\\n “Edie—hurry!” Dren called from the alley.\\n\\n I dropped my badge, turned my back, and ran for the door.\\n\\n CHAPTER TWENTY-NINE\\n\\n Outside, Dren was scrabbling along on the wet ground, and Jorgen was standing guard over him. What had happened to Ti?\\n\\n “Okay, okay—” If I stopped telling myself what to do I would panic. I reached down and pulled Dren up. He hissed at me, fangs out. “Don’t you dare—”\\n\\n “Just get me out of here.”\\n\\n The man who was still lying back there with his broken leg started trying to crawl backward at the sight of Dren.\\n\\n Dren’s shirt slipped through my fingers as I tried to haul him up. I’d only imagined springing him—it hadn’t occurred to me that after that, we’d somehow have to run and that he wouldn’t be able to walk. I hadn’t thought about bringing a wheelchair along.\\n\\n Jorgen knelt awkwardly, and I tried to hoist Dren up onto his back, but Dren kept sliding off. There was surprised shouting from down the alley. Perhaps the disappearance of Jorgen’s first victim had been discovered. I couldn’t understand their words, but I could hear their angry tone.\\n\\n “Dren, we’re going to have company soon. Can you send them away?” We were still trying to scrape our way down the alley, the three of us, unsuccessfully. But I’d been with Dren before when he’d made everyone ignore him, entire train cars full of normal people.\\n\\n “Can’t. Too weak. Too close to the bruja’s power.” He hauled himself up Jorgen’s side desperately and planted his fangs into the Hound’s neck. Jorgen snarled and twisted, dislodging him.\\n\\n “Horrible beast!” Dren yelled, back on the ground.\\n\\n “This is not the time to be feeding, Dren—”\\n\\n “I need blood!” Dren yelled.\\n\\n The man we’d threatened earlier had crawled backward to hide behind the dog cages, and then he started yelling for help.\\n\\n “Shit!” I hissed. “Come on.” Jorgen looked behind us and took a flying leap back toward the dog cages. “No!” I shouted at him. The dogs squealed. Jorgen stopped, but he was standing over the man who’d given us away. The man started praying at the top of his lungs. Santa Muerte this, Santa Muerte that.\\n\\n “You’d be better off praying to me!” I hauled Dren away, dragging him down the alleyway like a dead body. Three Crosses men raced out of the building like angry ants, weapons drawn. At a command from someone among their ranks, they held fire and moved aside. I’d never seen so many guns before. My stomach turned to ice.\\n\\n “What’s happening here?” I recognized his voice. From the clinic—Maldonado. Somehow he was even more frightening than the weaponry. \\n\\n","sourceLink":"https://allnovel.net/shapeshifted-edie-spence-3/page-29.html","bookId":2620,"book":{"id":2620,"title":"Shapeshifted (Edie Spence #3)","description":"Storyline: Shapeshifted (Edie Spence #3) \\n Nurse Edie Spence is once again called upon to save a life…and this time, it’s personal. Can her new community of zombies, vampires, and shapeshifters come to her rescue when she needs them most? \\n When Edie was fired from her paranormal nursing job at County Hospital, her whole world came crashing down. Now she’s is once again shaken to her core. Her mother is deathly ill and there’s only one thing that will save her: vampire blood. But with the paranormal community shunning Edie, where can she obtain it…without losing her own life in the process? \\n SHAPESHIFTED \\n Edie hopes to procure it at her new job at the clinic across town, where the forces of evil loom large. Vampire gang wars are rampant. Old underground enemies are rising to the surface. And Edie’s zombie ex-boyfriend has arrived at the scene—but is he the same man he used to be? And what should she make of the enigmatic doctor with whom she shares an unexpected connection? She’ll have to figure it out soon, because all hell is about to break loose—literally—and time is running out…\\n","cover":"https://allnovel.net/images/shapeshifted-edie-spence-3.jpg","author":"Cassie Alexander","type":"Horror","source":"allnovel","link":"https://allnovel.net/shapeshifted-edie-spence-3.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:54:09 PM"}}
