{"id":71284,"no":2,"title":"Page 2","content":"Ali raised her eyebrows. “You know my mom, Em. She’s more anal than Spencer.” She snickered.\n Spencer faux-glared at Ali while Emily ran her thumb along one of the grooves in the teak patio table.\n “But don’t worry, girls, I’m not grounded or anything.” Ali pressed her palms together. “Our sleepover extravaganza can proceed as planned!”\n The four of them sighed with relief, and the odd, uneasy mood began to evaporate. Only, each of them had a weird feeling Ali wasn’t telling them everything—it certainly wouldn’t be the first time. One minute, Ali would be their best friend, and the next, she’d drift away from them, making covert phone calls and sending secret texts. Weren’t they supposed to share everything? The other girls had certainly shared enough of themselves—they’d slipped secrets to Ali that no one, absolutely no one else, knew. And, of course, there was the big secret that they all shared about Jenna Cavanaugh—the one they’d sworn to take to the grave.\n “Speaking of our sleepover extravaganza, I have huge news,” Spencer said, breaking them out of their thoughts. “Guess where we’re having it?”\n “Where?” Ali leaned forward on her elbows, slowly morphing back into her old self.\n “Melissa’s barn!” Spencer cried. Melissa was Spencer’s older sister, and Mr. and Mrs. Hastings had renovated the family’s backyard barn and allowed Melissa to use it as her own personal pied-à-terre during her junior and senior years of high school. Spencer would get the same privilege, once she was old enough.\n “Sweet!” Ali whooped. “How?”\n “She’s flying out to Prague tomorrow night after graduation,” Spencer answered. “My parents said we could use it, so long as we clean it up before she gets back.”\n “Nice.” Ali leaned back and laced her hands together. Suddenly, her eyes focused on something a bit to the left of the workers. Melissa herself was traipsing through the Hastingses’ bordering yard, her posture rigid and proper. Her white graduation gown swung from a hanger in her hand, and she’d slung the school’s royal blue valedictorian mantle over her shoulders.\n Spencer let out a groan. “She’s being so obnoxious about the whole valedictorian thing,” she whispered. “She even told me I should feel grateful that Andrew Campbell will probably be valedictorian instead of me when we’re all seniors—the honor is ‘such a huge responsibility.’” Spencer and her sister hated each other, and Spencer had a new story about Melissa’s bitchiness nearly every day.\n Ali stood up. “Hey! Melissa!” She started waving.\n Melissa stopped and turned around. “Oh. Hey, guys.” She smiled cautiously.\n “Excited to go to Prague?” Ali singsonged, giving Melissa her brightest smile.\n Melissa tilted her head slightly. “Of course.”\n “Is Ian going?” Ian was Melissa’s gorgeous boyfriend. Just thinking about him made the girls swoon.\n Spencer dug her nails into Ali’s arm. “Ali.” But Ali pulled her arm away.\n Melissa shaded her eyes in the harsh sunlight. The royal blue mantle flapped in the wind. “No. He’s not.”\n “Oh!” Ali simpered. “Are you sure that’s a good idea—leaving him alone for two weeks? He might get another girlfriend!”\n “Alison,” Spencer said through her teeth. “Stop it. Now.”\n “Spencer?” Emily whispered. “What’s going on?”\n “Nothing,” Spencer said quickly. Aria, Emily, and Hanna looked at one another again. This had been happening lately—Ali would say something, one of them would freak, and the rest of them would have no clue what was going on.\n But this clearly wasn’t nothing. Melissa straightened the mantle around her neck, squared her shoulders, and turned. She looked long and hard at the giant hole at the edge of the DiLaurentises’ yard, then walked into the barn, slamming the door behind her so hard that it made the twig-braided wreath on the back of the door thump up and down.\n “Something’s certainly up her butt,” Ali said. “I was just kidding, after all.” Spencer made a little whimpering noise at the back of her throat, and Ali started giggling. She had a faint smile on her face. It was the same smile Ali gave them whenever she dangled a secret over one of their heads, taunting that she could tell the others if she wanted to.\n “Anyway, who cares?” Ali gazed at each of them, her eyes bright. “You know what, girls?” She drummed her fingers excitedly on the table. “I think this is going to be the Summer of Ali. The Summer of All of Us. I can just feel it. Can’t you?”\n A stunned moment passed. It seemed like a humid cloud hung above them, fogging up their thoughts. But slowly, the clouds faded and an idea formed in each of their minds. Maybe Ali was right. This could be the best summer of their lives. They could turn their friendship around and make it as strong as it had been last summer. They could forget all the scary, scandalous things that had happened and just start over.\n “I can feel it, too,” Hanna said loudly.\n “Definitely,” Aria and Emily said at the same time.\n “Sure,” Spencer said softly.\n They all grabbed hands and squeezed hard.\n It rained that night, a hard, pounding rain that made puddles in driveways, watered gardens, and created little mini pools on top of the Hastingses’ swimming pool cover. When the rain stopped in the middle of the night, Aria, Emily, Spencer, and Hanna awakened and sat up in bed at almost the exact same moment. A foreboding feeling had settled over each of them. They didn’t know if it was from something they’d just dreamed about, or excitement about the next day. Or maybe it was due to something else entirely…something far deeper.\n They each looked out their windows onto Rosewood’s tranquil, empty streets. The clouds had shifted and all the stars had come out. The pavement shone from the rain. Hanna stared at her driveway—only her mother’s car was there now. Her father had moved out. Emily looked at her backyard and the forest beyond it. She’d never braved those woods—she’d heard ghosts lived in them. Aria listened to the sounds emanating from her parents’ bedroom, wondering if they’d woken up, too—or perhaps they were fighting again and hadn’t fallen asleep yet. Spencer gazed at the DiLaurentises’ back porch, then across their yard to the huge hole the workers had dug for the gazebo’s foundation. The rain had turned some of the dug-up dirt to mud. Spencer thought about all the things in her life that made her angry. Then she thought about all the things in her life she wanted to have—and all the things she wanted to change.\n Spencer reached under her bed, found her red flashlight, and shone it into Ali’s window. One flash, two flashes, three flashes. This was her secret code to Ali that she wanted to sneak out and talk in person. She thought she saw Ali’s blond head sitting up in bed, too, but Ali didn’t flash back.\n All four of them fell back onto their pillows, telling themselves that the feeling was nothing and they needed their sleep. In twenty-four short hours, they’d be at the end of their seventh-grade sleepover, the first night of summer. The summer that would change everything.\n How right they were.\n 1\n THE ZEN IS MIGHTIER THAN THE SWORD\n Aria Montgomery woke up mid-snore. It was Sunday morning, and she was curled up on a blue vinyl chair in the Rosewood Memorial Hospital waiting room. Everyone—Hanna Marin’s parents, Officer Wilden, Hanna’s best friend Mona Vanderwaal, and Lucas Beattie, a boy in her class at Rosewood Day who looked like he’d just arrived—was staring at her.\n “Did I miss something?” Aria croaked. Her head felt like it was stuffed with marshmallow Peeps. When she checked the Zoloft clock hanging over the waiting room entrance, she saw it was only eight thirty. She’d been out for just fifteen minutes.\n Lucas sat down next to her and picked up a copy of Medical Supplies Today magazine. According to the cover, the issue featured all the latest colostomy bag models. Who puts a medical supplies magazine in a hospital waiting room? “I just got here,” he answered. “I heard about the accident on the morning news. Have you seen Hanna yet?”\n Aria shook her head. “They still won’t let us.”\n The two of them fell gravely silent. Aria surveyed the others. Ms. Marin wore a rumpled gray cashmere sweater and a pair of great-fitting distressed jeans. She was barking into her little Motorola earpiece, even though the nurses had said they couldn’t use cell phones in here. Officer Wilden sat next to her, his Rosewood PD jacket unbuttoned to his mid-chest and showing a frayed white T-shirt beneath it. Hanna’s father was slumped in the chair closest to the intensive care unit’s two giant double doors, jiggling his left foot. In a pale pink Juicy sweat suit and flip-flops, Mona Vanderwaal looked uncharacteristically disheveled, her face puffy from crying. When Mona looked up and saw Lucas, she gave him an annoyed stare, as if to say, This is for close friends and family only. What are you doing here? Aria couldn’t blame everyone for feeling testy. She had been here since 3 A.M., after the ambulance came to the Rosewood Day Elementary School parking lot and swept Hanna off to the hospital. Mona and the others had arrived at various points in the morning, when the news had begun to circulate. The last update the doctors had given them was that Hanna had been moved to intensive care. But that was three hours ago.\n Aria reviewed the previous night’s horrific details. Hanna had called to tell her that she knew the identity of A, the diabolical messenger who had been taunting Hanna, Aria, Emily, and Spencer for the past month. Hanna hadn’t wanted to reveal any details over the phone, so she’d asked Aria and Emily to meet her at the Rosewood Day swings, their old special spot. Emily and Aria had arrived just in time to see a black SUV mow Hanna down and speed away. As the paramedics rushed to the scene, put a cervical collar around Hanna’s neck, and carefully lifted her onto a stretcher and into the ambulance, Aria had felt numb. When she pinched herself hard, it didn’t hurt.\n Hanna was still alive…but barely. She had internal injuries, a broken arm, and bruises everywhere. The accident had caused head trauma, and now she was in a coma.\n Aria shut her eyes, ready to burst into tears again. The most inconceivable thing about all of this was the text Aria and Emily had received after Hanna’s accident. She knew too much. It was from A. Which meant…A knew what Hanna knew. Just like A knew everything else—all their secrets, the fact that it had been Ali, Aria, Spencer, Emily, and Hanna who’d blinded Jenna Cavanaugh, not Jenna’s stepbrother, Toby. A probably even knew the truth about who killed Ali.\n Lucas tapped Aria on the arm. “You were there when that car hit Hanna, right? Did you get a look at the person who did it?”\n Aria didn’t know Lucas very well. He was one of those kids who loved school activities and clubs, whereas Aria was the type to stay far, far away from all things involving her Rosewood Day peers. She didn’t know what connection he had to Hanna, but it seemed sweet that he was here. “It was too dark,” she mumbled. \n","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-2.html","bookId":2381,"book":{"id":2381,"title":"Unbelievable (Pretty Little Liars #4)","description":"Storyline: \n Unbelievable (Pretty Little Liars #4) \n Behind Rosewood\u0027s grand façades, where the air smells like apples and Chanel No. 5 and infinity pools sparkle in landscaped backyards, nothing is as it seems. It was here, back in seventh grade, that five best friends shared everything?Seven jeans, MAC makeup, and their deepest, darkest secrets. For Aria, Spencer, Hanna, and Emily, it was a dream come true . . . until Alison, the most beautiful of them all, suddenly vanished. \n Now someone named A has turned their charmed lives into a living nightmare. Emily has been shipped off to her hyper-conservative cousins in Iowa. Aria is stuck living with her dad and his home-wrecker girlfriend. And Spencer fears she had something to do with Alison\u0027s murder. But Hanna\u0027s fate is far worse than all of that?she\u0027s clinging to life in the hospital, because she knew too much. \n With A\u0027s threats turning dangerous and Ali\u0027s killer still on the loose, the girls must uncover the truth?about A, about Ali, and about what happened to Hanna?before they become A\u0027s next victims. But as they unravel Rosewood\u0027s mysteries and secrets, will it bring an end to the horror . . . or is this just the beginning?\n \n","cover":"https://allnovel.net/images/unbelievable-pretty-little-liars-4.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/unbelievable-pretty-little-liars-4.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:34 AM"}}
