{"id":71316,"no":34,"title":"Page 34","content":"Spencer shut her eyes, wishing she could just pass out from fear. Mona sighed dramatically. “Then again, you’ve been doing stupid things for years, haven’t you? Starting with good old Jenna Cavanaugh.” She winked. Spencer’s mouth dropped open. Mona…knew? Of course she knew. She was A. Mona stole a quick glance at Spencer’s horrified face and made a faux-surprised face in return. Then Mona pulled down the side zipper of her halter dress, revealing a black silky bra and a good portion of her stomach. There was a huge, wrinkled laceration circling the bottom of her rib cage. Spencer stared at it for a few seconds until she had to look away. “I was there the night you hurt Jenna,” Mona whispered, her voice rough-edged. “Jenna and I were friends, which you might have known if you hadn’t been so effing self-absorbed. I went over to Jenna’s to surprise her that night. I saw Ali…I saw everything…and I even got a little souvenir from it.” She stroked her burn scars. “I tried to tell people it was Ali, but no one believed me. Toby took the blame so fast, my parents thought I was blaming Ali because I was jealous of her.” Mona shook her head, her blond hair swinging back and forth. As soon as she finished her cigarette and tossed it out the window, she lit another one, sucking hard on the filter. “I even tried to talk to Jenna about it, but Jenna refused to listen. She kept saying, ‘You’re wrong. It was my stepbrother.’” Mona mimicked Jenna’s voice at a higher octave. “Jenna and I weren’t friends after that,” Mona went on. “But every time I’m in front of my mirror at home and look at my otherwise perfect self, I’m reminded of what you bitches did. I know what I saw. And I. Will. Never. Forget.” Her mouth dripped into an eerie smile. “This summer, I found a way to get you bitches back. I found Ali’s diary among all that crap the new people were throwing away. I knew it was Ali’s instantly—and she wrote tons of secrets about all of you. Really damaging ones, actually. It’s like she wanted the diary to fall into enemy hands.” A flash came to Spencer—the day before Ali went missing, discovering Ali in her bedroom, hungrily reading a notebook, an amused, greedy smile on her face. “Why didn’t the cops find her diary when she went missing?” she sputtered. Mona pulled the car under a thicket of trees and stopped. There was only darkness ahead of them, but Spencer could hear rushing water and smell moss and wet grass. “Who the hell knows? But I’m glad they didn’t and I did.” Mona rezipped her dress, then turned to face Spencer, her eyes bright. “Ali wrote down every horrible thing you guys did. How you guys tortured Jenna Cavanaugh, that Emily kissed her in her tree house, that you, Spencer, kissed your sister’s boyfriend. It made it so easy for me to just…I don’t know, become her. All it took was for me to get a second phone with a blocked number. And I really had you going that it was Ali contacting you at first, didn’t I?” Mona grabbed Spencer’s hand and laughed. Spencer recoiled from her touch. “I can’t believe it was you the whole time.” “I know, right? It must have been so annoying not knowing!” Mona clapped happily. “It was so fun watching you guys go crazy…and then Ali’s body showed up and you really went crazy. Sending myself notes, though, was pure brilliance….” She reached around and patted her left shoulder blade. “I had to do a lot of running around, anticipating your moves before even you knew what they’d be. But the whole thing was so elegantly done, almost like a couture dress, don’t you think?” Mona’s eyes canvassed Spencer for a reaction. Then, slowly, she reached out and punched Spencer jokily on the arm. “You look so freaked right now. Like I’m going to hurt you or something. It doesn’t have to be this way, though.” “Be…what way?” Spencer whispered. “I mean, at first, I hated you, Spencer. You most of all. You were always closest to Ali, and you had everything.” Mona lit another cigarette. “But then…we became friends. It was so fun, planning Hanna’s party, spending time together. Didn’t you have fun flashing those boys? Wasn’t it nice, really talking? So I thought…maybe I could be a philanthropist. Like Angelina Jolie.” Spencer blinked, dumbstruck. “I decided to help you,” Mona explained. “The Golden Orchid thing—that was a fluke. But this—I honestly want to make your life better, Spencer. Because I truly, honestly care about you.” Spencer knitted her brow. “W-what are you talking about?” “Melissa, silly!” Mona exclaimed. “Setting her up as the killer. It’s so perfect. Isn’t it what you always wanted? Your sister in jail for murder and out of your life, for good. You’ll look so perfect in comparison!” Spencer stared at her. “But…Melissa had a motive.” “Did she?” Mona grinned. “Or is that just what you want to believe?” Spencer opened her mouth, but no sound came out. Mona had sent the text that said, Ali’s murderer is right in front of you. And the IM that said, She did it, you know. Mona had planted the photo in Spencer’s purse. Mona gave Spencer a devious look. “We can turn this around. We can go back to the police station and tell Hanna it’s a huge misunderstanding—that she’s not remembering things properly. We can pin A on someone else, someone you don’t like. How about Andrew Campbell? You’ve always hated him, haven’t you?” “I…” Spencer sputtered. “We can put your sister in jail,” Mona whispered. “And we can both be A. We can control everyone. You’re just as conniving as Ali was, Spence. And you’re prettier, smarter, and richer. You should’ve been the leader of the group, not her. I’m giving you the chance, now, to be the leader you’re meant to be. Your life at home would be perfect. Your life at school would be perfect.” Her lips spread into a smile. “And I know how badly you want to be perfect.” “But you hurt my friends,” Spencer whispered. “Are you sure they’re your friends?” Mona’s eyes glittered. “You know who I set up as the killer before Melissa? You, Spencer. I fed your good friend Aria all kinds of clues that you did it—I heard you fighting with Ali that night she went missing, over your wall. And Aria, your BFF? She totally bought it. She was all ready to turn you in.” “Aria wouldn’t do that,” Spencer shrieked. “No?” Mona raised an eyebrow. “Then why did I hear her telling Wilden exactly that in the hospital on Sunday morning, the day after Hanna’s accident?” She put accident in air quotes. “She wasted no time, Spence. Lucky for you, Wilden didn’t buy it. Now, why would you call someone who did that to you your friend?” Spencer took a few deep breaths, not knowing what to believe. A thought spiraled into her head. “Wait…if Melissa didn’t kill Ali, then you did.” Mona leaned back in her seat, the leather crinkling underneath her. “No.” She shook her head. “I do know who did, though. Ali wrote about it on the last page of her diary—poor widdle girl, the last thing she ever wrote before she died.” Mona stuck out her lip in a pout. “She said, Ian and I are having a supersecret meeting tonight.” Mona did a fake Ali voice, too, but the voice sounded more like a diabolical doll in a horror movie. “And I gave him an ultimatum. I told him that he better break up with Melissa before she goes to Prague—or I’d tell her and everyone else about us.” Mona sighed, sounding bored. “It’s pretty obvious what happened—she pushed Ian to his breaking point. And he killed her.” The wind picked up the edges of Mona’s hair. “I modeled myself after Ali—she was the perfect bitch. No one was safe from her blackmail. And if you want, no one will be safe from yours, either.” Spencer shook her head slowly. “But…but you hit Hanna with your car.” Mona shrugged. “Had to do it. She knew too much.” “I’m…I’m sorry,” Spencer whispered. “There’s no way I want to…to be A with you. To rule the school with you. Or whatever it is you’re offering. That’s nuts.” Mona’s disappointed expression morphed into something darker. She knitted her eyebrows together. “Fine. Have it your way, then.” Mona’s voice felt like a knife cutting into Spencer’s skin. The crickets chirped hysterically. The rushing water beneath sounded like blood gushing through a vein. In one swift movement, Mona burst forward and wrapped her hands around Spencer’s neck. Spencer screamed and jerked back, flailing to hit the UNLOCK button again. She kicked Mona’s chest. As Mona squealed and recoiled, Spencer yanked at the door handle and shoved it open, tumbling out of the car to the spiny grass. Immediately, she pushed herself up and sprinted into the darkness. She felt the grass under her feet, then gravel, then dirt, then mud. The noise of the water grew louder and louder. Spencer could tell she was nearing the quarry’s rocky edge. Mona’s footsteps rang out behind her, and Spencer felt Mona’s arms wrap around her waist. She fell heavily to the ground. Mona climbed on top of her and wrapped her hands around her neck. Spencer kicked and struggled and choked. Mona giggled, as if this were all a game. “I thought we were friends, Spencer.” Mona grimaced, trying to keep Spencer still. Spencer struggled to breathe. “I guess not!” she screamed. Using all her might, Spencer pressed her legs onto Mona’s body, throwing her backward. Mona landed on her butt a few feet away, her bright yellow gum spewing out of her mouth. Spencer scrambled quickly to her feet. Mona got up, too, her eyes flashing and her teeth clenched. Time seemed to spread out as Mona advanced on her, her mouth a triangle of fury. Spencer shut her eyes and just…reacted. She grabbed Mona around her legs. Mona’s feet went out from under her, and she started to fall. Spencer felt her arms pressing against Mona’s stomach, pushing as hard as she could. She saw the whites of Mona’s eyes as they widened, and heard Mona’s screams in her ears. Mona fell backward, and in a blink, she disappeared. Spencer didn’t realize it at first, but she was falling, too. Then she hit the ground. She heard a scream echo through the gulch, and thought for a moment that it was her own. Her head hit the ground with a crack…and her eyes fluttered shut. 37 SEEING IS BELIEVING Hanna crammed into the back of Wilden’s squad car next to Aria and Emily. It was where criminals—not that Rosewood had many—typically sat. Even though she could barely see Wilden through the metal grates connected to the front seat, she could tell by his tone of CB radio voice that he was as worried and tense as she was. “Has anyone found anything yet?” he said into the walkie-talkie. They were idling at a stop sign as Wilden decided which way to go next. They had just driven around the main mouth of Morrell Stream, but they’d only found a couple of public-school kids lying on the grass getting stoned. There weren’t signs of Mona’s Hummer anywhere.","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-34.html","bookId":2381,"book":{"id":2381,"title":"Unbelievable (Pretty Little Liars #4)","description":"Storyline: Unbelievable (Pretty Little Liars #4) Behind Rosewood\u0027s grand façades, where the air smells like apples and Chanel No. 5 and infinity pools sparkle in landscaped backyards, nothing is as it seems. It was here, back in seventh grade, that five best friends shared everything?Seven jeans, MAC makeup, and their deepest, darkest secrets. For Aria, Spencer, Hanna, and Emily, it was a dream come true . . . until Alison, the most beautiful of them all, suddenly vanished. Now someone named A has turned their charmed lives into a living nightmare. Emily has been shipped off to her hyper-conservative cousins in Iowa. Aria is stuck living with her dad and his home-wrecker girlfriend. And Spencer fears she had something to do with Alison\u0027s murder. But Hanna\u0027s fate is far worse than all of that?she\u0027s clinging to life in the hospital, because she knew too much. With A\u0027s threats turning dangerous and Ali\u0027s killer still on the loose, the girls must uncover the truth?about A, about Ali, and about what happened to Hanna?before they become A\u0027s next victims. But as they unravel Rosewood\u0027s mysteries and secrets, will it bring an end to the horror . . . or is this just the beginning?","cover":"https://allnovel.net/images/unbelievable-pretty-little-liars-4.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/unbelievable-pretty-little-liars-4.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:34 AM"}}
