{"id":71318,"no":36,"title":"Page 36","content":"Spencer felt her friends’ eyes on her. She gathered up strength to go on.\n “I got so mad…I shoved her. She fell against the rocks. There was this awful crack noise.” A tear wobbled out of the corner of her eye and spilled down her cheek. She hung her head. “I’m sorry, guys. I should’ve told you. I just…I didn’t remember. And then when I did, I was so scared.”\n When she looked up, her friends were aghast. Even Wilden’s head tilted toward the back, as if he were trying to listen. If they wanted to, they could throw the Ian theory out the window. They could make Wilden stop the car and make Spencer repeat exactly what she’d said. Things could go in a horrible direction from here.\n Emily was the first to take Spencer’s hand. Then Hanna placed hers on top of Emily’s, and then Aria laid hers on top of Hanna’s. It reminded Spencer of when they used to all touch the photo of the five of them that hung in Ali’s foyer. “We know it wasn’t you,” Emily whispered.\n “It was Ian. It all makes sense,” Aria said forcefully, gazing into Spencer’s eyes. It seemed like she believed Spencer wholly and completely.\n They reached Spencer’s street, and Wilden pulled into her family’s long, circular driveway. Spencer’s parents weren’t home yet, and the house was dark. “Do you want me to stay with you guys until your folks get home?” Wilden asked as the girls got out.\n “It’s okay.” Spencer glanced around at the others, suddenly relieved that they were here.\n Wilden backed out of the driveway and turned slowly around the cul-de-sac, first passing the DiLaurentises’ old house, then the Cavanaughs’, and then the Vanderwaals’, the big monstrosity with the detached garage down the street. There was no one home at Mona’s, obviously. Spencer shuddered.\n A flash of light in the backyard caught her eye. Spencer cocked her head, her heart speeding up. She walked down the stone path that led to her backyard and curled her hands along the stone wall surrounding their property. There, past the deck, the rock-lined pool, the burbling hot tub, the expansive yard, and even the renovated barn, at the very back of the property near where Ali had fallen, Spencer saw two figures, lit only by moonlight. They reminded her of something.\n The wind picked up, tiptoeing up and down Spencer’s back. Even though it wasn’t the right season, the air briefly smelled like honeysuckle, just as it had that horrible night four and a half years ago. All at once, her memory broke free. She saw Ali fall backward into the stone wall. A crack rang out through the air, as loud as church bells. When Spencer heard the girlish gasp in her ear, she turned. No one was behind her. No one was anywhere. And when she turned back, Ali was still slumped against the stone wall, but her eyes were open. And then, Ali grunted and pushed herself to her feet.\n She was fine.\n Ali glared at Spencer, about to speak, but something down the path distracted her. She took off fast, disappearing into a thicket of trees. In seconds, Spencer heard Ali’s signature giggle. There was rustling, and then two distinct shapes. One was Ali’s. Spencer couldn’t tell who the other person was, but it didn’t look like Melissa. It was hard to believe that, only moments after this, Ian would push Ali into the DiLaurentises’ half-dug gazebo hole. Ali might’ve been a bitch, but she didn’t deserve anything like that.\n “Spencer?” Hanna said softly, her voice sounding far away. “What’s wrong?”\n Spencer opened her eyes and shuddered. “I didn’t do it,” she whispered.\n The figures near the barn stepped into the light. Melissa’s posture was stiff and Ian’s fists clenched. The wind carried their voices to the front yard, and it sounded like they were fighting.\n Spencer’s nerves felt ignited. She wheeled around and looked down her street. Wilden’s car was gone. Frantically, she fumbled in her pocket for her phone, but remembered—Mona had thrown it out the window.\n “I got it,” Hanna said, pulling out her own BlackBerry and dialing a number. She handed the phone to Spencer. Calling WILDEN, the screen said.\n Spencer had to hold the phone with two hands, her fingers were trembling so badly. Wilden answered after two rings. “Hanna?” He sounded confused. “What is it?”\n “It’s Spencer,” Spencer bleated. “You have to turn around. Ian’s here.”\n 39\n THE ALL-NEW MONTGOMERYS, DISTURBING AS EVER\n The following afternoon, Aria sat on Meredith’s living room futon, absently flicking the William Shakespeare bobblehead Ezra had given her. Byron and Meredith sat next to her, and they were all staring at Meredith’s television. There was a press conference about Ali’s murder on TV. Ian Thomas arrested, said a big banner at the bottom of the screen.\n “Mr. Thomas’s arraignment is set for Tuesday,” a newscaster said, standing in front of the grand stone steps of the Rosewood County Courthouse. “No one in this community ever expected that a quiet, polite boy like Ian Thomas could be behind this.”\n Aria pulled her knees into her chest. The cops had gone to the Vanderwaal residence this morning and had found Ali’s diary underneath Mona’s bed. Mona had been telling Spencer the truth about the last entry—it was about how Ali had given Ian an ultimatum that he either break up with Melissa Hastings or she would tell the world about them. The news showed the police leading Ian to the station in handcuffs. When asked to make a statement, all Ian said was “I’m innocent. This is a mistake.”\n Byron scoffed in disbelief. He reached over and grabbed Aria’s hand. Then, predictably, the news flashed to the next story—Mona’s death. The screen showed the string of yellow police tape around the Floating Man Quarry, then a shot of the Vanderwaal house. A random BlackBerry phone icon appeared in the corner. “Miss Vanderwaal had been stalking four Rosewood Day girls for over a month now, and the threats had turned deadly,” the newscaster said. “There was a scuffle between Miss Vanderwaal and an unnamed minor last night at the edge of the quarry, which is notoriously dangerous. Miss Vanderwaal slipped off the edge, breaking her neck in the fall. Police found Miss Vanderwaal’s personal BlackBerry in her purse at the bottom of the Quarry, but they’re still looking for a second phone—the one she used to send most of the troubling messages.”\n Aria gave Shakespeare’s head another bobble. Her head felt like an overstuffed suitcase. Too much had happened in the last day for her to process things. And her emotions were all mixed up. She felt terrible that Mona had died. She felt freaked out and weirdly wounded that Jenna’s accident hadn’t really been an accident—that Jenna and Ali had set it up all along. And after all this time, the killer was Ian…. The newscaster made a sympathetic, relieved face and said, “Finally, the whole community of Rosewood can put this horrible story behind them”—something everyone had been saying all morning. Aria burst into tears. She didn’t feel resolved at all.\n Byron looked over at her. “What is it?”\n Aria shook her head, unable to explain. She cupped the bobblehead in her hands, letting the tears drip on top of Shakespeare’s plastic head.\n Byron let out a frustrated sigh. “I realize this is overwhelming. You had a stalker. And you never talked about it to us. You should have. We should talk about it now.”\n “I’m sorry.” Aria shook her head. “I can’t.”\n “But we need to,” Byron urged. “It’s important you get this out.”\n “Byron!” Meredith hissed sharply. “Jesus!”\n “What?” Byron asked, raising his arms in surrender.\n Meredith jumped up, placing herself between Aria and her father. “You and your discussions,” Meredith scolded. “Hasn’t Aria been through enough these last few weeks? Just give her some space!”\n Byron shrugged, looking cowed. Aria’s mouth fell open. She met Meredith’s eyes, and Meredith smiled. There was an understanding glimmer in her eye that seemed to say, I get what you’re going through. And I know it’s not easy. Aria stared at the pink spiderweb tattoo on Meredith’s wrist. She thought about how eager she had been to find out something damaging about Meredith, and here Meredith was, sticking up for her.\n Byron’s cell phone vibrated, scooting across the scuffed coffee table. He stared at the screen, frowning, then picked it up. “Ella?” His voice cracked.\n Aria tensed. Byron’s eyebrows knitted together. “Yes…she’s here.” He passed the phone to Aria. “Your mother wants to talk to you.”\n Meredith cleared her throat awkwardly, standing up and drifting toward the bathroom. Aria stared at the phone as if it were a piece of putrefied shark, which someone in Iceland had once dared her to eat. After all, the Vikings used to eat it. She put the phone tentatively to her ear. “Ella?”\n “Aria, are you all right?” Ella’s voice cried from the other end.\n “I’m…fine,” Aria said. “I don’t know. I guess. I’m not hurt or anything.”\n There was a long silence. Aria pulled out her father’s little antenna and pushed it back in again.\n “I’m so sorry, honey,” Ella gushed. “I had no idea you were going through this. Why didn’t you tell us someone was threatening you?”\n “Because…” Aria wandered into her tiny bedroom off Meredith’s studio and picked up Pigtunia, her pig puppet. Explaining A to Mike had been hard. But now that it was over, and Aria didn’t have to worry about A’s retaliation, she realized the real reason didn’t matter. “Because you guys were caught up in your own stuff.” She sank onto her lumpy twin bed, and the bedsprings let out a mooing groan. “But…I’m sorry, Ella. For everything. It was terrible of me not to say anything about Byron for all that time.”\n Ella paused. Aria snapped on the tiny TV that sat in the windowsill. The same press conference images emerged on the screen. “I get why you didn’t,” Ella finally said. “I should’ve understood that. I was just angry, that’s all.” She sighed. “My relationship with your dad hadn’t been good for a long time. Iceland stalled the inevitable—we both knew this was coming.”\n “Okay,” Aria said softly, running her hands up and down Pigtunia’s pink fur.\n Ella sighed. “I’m sorry, sweetie, and I miss you.”\n An enormous, egg-shaped lump formed in Aria’s throat. She stared up at the cockroaches Meredith had painted on the ceiling. “I miss you too.”\n “Your room is here if you want it,” her mother said.\n Aria hugged Pigtunia to her chest. “Thanks,” she whispered, and clapped the phone shut. How long had she been waiting to hear that? What a relief it would be to sleep in her own bed again, with its normal mattress and soft, downy pillows. To be among all her knitting projects and books and her brother and Ella. But what about Byron? Aria listened to him coughing in the other room. “Do you need a Kleenex?” Meredith called from the bathroom, sounding concerned. She thought about the card Meredith had made for Byron and pinned up on the fridge. It was a cartoon elephant saying, Just stamping by to say I hope you have a great day! It seemed the kind of thing that Byron—or Aria—would do. \n","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-36.html","bookId":2381,"book":{"id":2381,"title":"Unbelievable (Pretty Little Liars #4)","description":"Storyline: \n Unbelievable (Pretty Little Liars #4) \n Behind Rosewood\u0027s grand façades, where the air smells like apples and Chanel No. 5 and infinity pools sparkle in landscaped backyards, nothing is as it seems. It was here, back in seventh grade, that five best friends shared everything?Seven jeans, MAC makeup, and their deepest, darkest secrets. For Aria, Spencer, Hanna, and Emily, it was a dream come true . . . until Alison, the most beautiful of them all, suddenly vanished. \n Now someone named A has turned their charmed lives into a living nightmare. Emily has been shipped off to her hyper-conservative cousins in Iowa. Aria is stuck living with her dad and his home-wrecker girlfriend. And Spencer fears she had something to do with Alison\u0027s murder. But Hanna\u0027s fate is far worse than all of that?she\u0027s clinging to life in the hospital, because she knew too much. \n With A\u0027s threats turning dangerous and Ali\u0027s killer still on the loose, the girls must uncover the truth?about A, about Ali, and about what happened to Hanna?before they become A\u0027s next victims. But as they unravel Rosewood\u0027s mysteries and secrets, will it bring an end to the horror . . . or is this just the beginning?\n \n","cover":"https://allnovel.net/images/unbelievable-pretty-little-liars-4.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/unbelievable-pretty-little-liars-4.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:34 AM"}}
