{"id":71289,"no":7,"title":"Page 7","content":"Ezra squeezed his eyes shut, swinging Aria’s hands back and forth. “I think you should look me up in a couple years. Because, I mean, I feel that way about you, too. But I have to get out of here. You know it, and I know it.”\n Aria dropped his hands. She felt like someone had opened up her chest and removed her heart. Just last night, for a few hours, everything had been perfect. And then Sean—and A—had ripped it all apart again.\n “Hey,” Ezra said, noting the tears spilling down Aria’s cheeks. He pulled her into him and held her tight. “It’s okay.” He peered into one of his boxes, then handed her his William Shakespeare bobblehead. “I want you to have this.”\n Aria gave him a tiny smile. “Seriously?” The first time she’d come here, after Noel Kahn’s party back in the beginning of September, Ezra had told her the bobblehead was one of his favorite possessions.\n Ezra traced the line of Aria’s jaw with the tip of his pointer finger, starting at her chin and ending at her earlobe. Shivers went up her spine. “Really,” he whispered.\n She could feel his eyes on her as she turned for the door. “Aria,” he called, just as she was stepping over a big pile of old phone books to get out into the hall.\n She stopped, her heart lifting. There was a wise, calm look on Ezra’s face. “You’re the strongest girl I’ve ever met,” he said. “So just…screw ’em, you know? You’ll be fine.”\n Ezra leaned down, sealing up boxes with clear packing tape. Aria backed out of the apartment in a daze, wondering why he’d suddenly turned all guidance counselor on her. It was like he was saying that he was the adult, with responsibilities and consequences, and she was just a kid, her whole life in front of her.\n Which was exactly what she didn’t want to hear right then.\n “Aria! Welcome!” Meredith cried. She stood at the edge of the kitchen, wearing a black-and-white striped apron—which Aria was trying to imagine as a prison uniform—and a cow-shaped oven mitt covered her right hand. She was grinning like a shark about to swallow a minnow.\n Aria dragged in the last of the bags Sean had dumped at her feet last night and looked around. She knew Meredith had quirky taste—she was an artist, and taught classes at Hollis College, the same place where Byron was tenured—but Meredith’s living room looked like a psychopath had decorated it. There was a dentist’s chair in the corner, complete with a tray for all the instruments of torture. Meredith had covered a whole wall with pictures of eyeballs. She branded messages into wood as a form of artistic expression, and there was a big wood chunk across the mantel that said, BEAUTY IS ONLY SKIN DEEP, BUT UGLY GOES CLEAN TO THE BONE. There was a large cutout of the Wicked Witch of the West pasted over the kitchen table. Aria was half tempted to point to it and say she hadn’t known Meredith’s mother was from Oz. Then she saw a raccoon in the corner and screamed.\n “Don’t worry, don’t worry,” Meredith said quickly. “He’s stuffed. I bought him at a taxidermy store in Philly.”\n Aria wrinkled her nose. This place rivaled the Mütter Museum of medical oddities in Philadelphia, which Aria’s brother loved almost as much as the sex museums he’d visited in Europe.\n “Aria!” Byron appeared from behind a corner, wiping his hands on his jeans. Aria noted that he was wearing dark denim jeans with a belt and a soft gray sweater—maybe his usual uniform of a sweat-stained Sixers T-shirt and frayed plaid boxers wasn’t good enough for Meredith. “Welcome!”\n Aria grunted, hefting up her duffel again. When she sniffed the air, it smelled like a combination of burnt wood and Cream of Wheat. She eyed the pot on the stove suspiciously. Perhaps Meredith was cooking gruel, like an evil headmistress in a Dickens novel.\n “So let me show you your room.” Byron grabbed Aria’s hand. He led her down the hall to a large, square room that contained a few big chunks of wood, some branding irons, an enormous band saw, and welding tools. Aria assumed this was Meredith’s studio—or the room where she finished off her victims.\n “This way,” Byron said. He led her to a space in the corner of the studio that was separated from the rest of the room by a floral curtain. When he pushed the curtain back, he crowed, “Taa-daaa!”\n A twin bed and a dresser missing three of its drawers occupied a space only slightly larger than a shower stall. Byron had carried in her other suitcases earlier, but because there was no room on the floor, he’d piled them on the bed. There was one flat, yellowed pillow propped up against the headboard, and someone had balanced a tiny portable TV in the windowsill. There was a sticker on the top of it that said in old, faded, seventies lettering, SAVE A HORSE, RIDE A WELDER.\n Aria turned to Byron, feeling nauseated. “I have to sleep in Meredith’s studio?”\n “She doesn’t work at night,” Byron said quickly. “And look! You have your own TV and your own fireplace!” He pointed to a huge brick monstrosity that took up most of the far wall. Most Old Hollis houses had fireplaces in every room because their central heating systems sucked. “You can make it cozy in here at night!”\n “Dad, I have no idea how to light a fireplace.” Then Aria noticed a trail of cockroaches going from one corner of the ceiling to another. “Jesus!” she screamed, pointing at them and cowering behind Byron.\n “They’re not real,” Byron reassured her. “Meredith painted them. She’s really personalized this place with an artistic touch.”\n Aria felt like she was going to hyperventilate. “They look real to me!”\n Byron looked honestly surprised. “I thought you’d like this place. It was the best we could put together on such short notice.”\n Aria shut her eyes. She missed Ezra’s shabby little apartment, with its bathtub and thousands of books and map of the New York City subway system shower curtain. There were no roaches there, either—real or fake.\n “Honey?” Meredith’s voice rang out from the kitchen. “Dinner’s ready.”\n Byron gave Aria a tight smile and turned for the kitchen. Aria figured she should follow. In the kitchen, Meredith was setting bowls at each of their plates. Thankfully, dinner wasn’t gruel, but innocent-looking chicken soup. “I thought this would be best for my stomach,” she admitted.\n “Meredith’s been having some stomach issues,” Byron explained. Aria turned to the window and smiled. Maybe she’d get lucky and Meredith would have somehow contracted the bubonic plague.\n “It’s low-salt.” Meredith punched Byron in the arm. “So it’s good for you, too.”\n Aria looked at her father curiously. Byron used to salt every single bite while it was on the fork. “Since when do you eat low-salt stuff?”\n “I have high blood pressure,” Byron said, pointing to his heart.\n Aria wrinkled her nose. “No, you don’t.”\n “Yes, I do.” Byron tucked his napkin into his collar. “I have for a while now.”\n “But…but you’ve never eaten low-salt stuff before.”\n “I’m a slave driver,” Meredith insisted, scraping back a seat and sitting down. Meredith had positioned Aria at the head of the Wicked Witch cutout. Aria slid her bowl over to cover the witch’s pea-green visage. “I keep him on a regimen,” Meredith went on. “I make him take vitamins, too.”\n Aria slumped, dread welling in her stomach. Meredith was already acting like Byron’s wife, and he’d only lived with her for a month.\n Meredith pointed to Aria’s hand. “Whatcha got there?”\n Aria stared down at her lap, realizing she was still holding the Shakespeare bobblehead Ezra had given her. “Oh. It’s just…something from a friend.”\n “A friend who likes literature, I guess.” Meredith reached out and made Shakespeare’s head bob up and down. There was a tiny glint in her eye.\n Aria froze. Could Meredith know about Ezra? She glanced at Byron. Her father slurped his soup, oblivious. He wasn’t reading at the table, something he constantly did at home. Had Byron seriously been unhappy at home? Did he honestly enjoy bug-painting, taxidermy-loving Meredith more than he loved Aria’s sweet, kind, loving mother, Ella? And what made Byron think Aria could just sit idly by and accept this?\n “Oh, Meredith has a surprise for you,” Byron piped up. “Every semester, she gets to take a class at Hollis for free. She says you can use this semester’s credit to take a class instead.”\n “That’s right.” Meredith passed the Hollis College continuing education course book to Aria. “Maybe you’d like to take one of the art classes I’m teaching?”\n Aria bit down hard on the inside of her cheek. She’d rather have shards of glass permanently lodged in her throat than spend a single additional moment with Meredith.\n “Come on, pick a class,” Byron urged. “You know you want to.”\n So they were forcing her to do this? Aria whipped open the book. Maybe she could take something in German filmmaking, or microbiology, or Special Topics in Neglected Children and Maladjusted Family Behavior.\n Then something caught her eye. Mindless Art: Create uniquely crafted masterpieces in tune with your soul’s needs, wants, and desires. Through sculpture and touch, students learn to depend less on their eyes and more on their inner selves.\n Aria circled the class with the gray ROCKS ROCK! Hollis geology department pencil she’d found wedged in the course book. The class definitely sounded kooky. It might even end up being like one of those Icelandic yoga classes where instead of stretching, Aria and the rest of the students danced with their eyes closed, making hawk noises. But she needed a little mindlessness right now. Plus, it was one of the few art classes that Meredith wasn’t teaching. Which pretty much made it perfect.\n Byron excused himself from the table and bounded off to Meredith’s minuscule bathroom. After he turned on the bathroom’s overhead fan, Meredith laid down her fork and looked squarely at Aria. “I know what you’re thinking,” she said evenly, rubbing her thumb along the pink spiderweb tattoo on her wrist. “You hate that your father’s with me. But you’d better get used to it, Aria. Byron and I are going to be married as soon as your parents’ divorce goes through.”\n Aria accidentally swallowed an unchewed bite of noodles. She coughed up the broth, sputtering it all over the table. Meredith jumped back, her eyes wide. “Something you ate not agreeing with you?” she simpered.\n Aria looked away sharply, her throat burning. Something hadn’t agreed with her, all right, but it wasn’t the Wicked Witch’s soup.\n 6\n EMILY’S JUST A SWEET, INNOCENT MIDWESTERN GAL\n “Come on!” Abby urged, pulling Emily across the farmyard. The sun was sinking over the flat Iowa horizon, and all sorts of long-legged Midwestern bugs were coming out to play. Apparently, Emily, Abby, and Emily’s two eldest boy cousins, Matt and John, were also going out to play.\n The four of them stopped at the edge of the road. John and Matt had both changed out of their plain white T-shirts and work pants into baggy jeans and T-shirts with beer slogans. Abby pulled at the bodice of her tube top and checked her lipstick in her little compact mirror. Emily, in the same jeans and swimming T-shirt she’d worn when she arrived, felt plain and underdressed—which was pretty much how she always felt back in Rosewood. \n","sourceLink":"https://allnovel.net/unbelievable-pretty-little-liars-4/page-7.html","bookId":2381,"book":{"id":2381,"title":"Unbelievable (Pretty Little Liars #4)","description":"Storyline: \n Unbelievable (Pretty Little Liars #4) \n Behind Rosewood\u0027s grand façades, where the air smells like apples and Chanel No. 5 and infinity pools sparkle in landscaped backyards, nothing is as it seems. It was here, back in seventh grade, that five best friends shared everything?Seven jeans, MAC makeup, and their deepest, darkest secrets. For Aria, Spencer, Hanna, and Emily, it was a dream come true . . . until Alison, the most beautiful of them all, suddenly vanished. \n Now someone named A has turned their charmed lives into a living nightmare. Emily has been shipped off to her hyper-conservative cousins in Iowa. Aria is stuck living with her dad and his home-wrecker girlfriend. And Spencer fears she had something to do with Alison\u0027s murder. But Hanna\u0027s fate is far worse than all of that?she\u0027s clinging to life in the hospital, because she knew too much. \n With A\u0027s threats turning dangerous and Ali\u0027s killer still on the loose, the girls must uncover the truth?about A, about Ali, and about what happened to Hanna?before they become A\u0027s next victims. But as they unravel Rosewood\u0027s mysteries and secrets, will it bring an end to the horror . . . or is this just the beginning?\n \n","cover":"https://allnovel.net/images/unbelievable-pretty-little-liars-4.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/unbelievable-pretty-little-liars-4.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:34 AM"}}
