{"id":94637,"no":10,"title":"Page 10","content":"\n And what was that name Mother Rose had mentioned?\n Thanatos.\n Lilah frowned. The name tugged at a memory. Not someone she’d ever met, but something she’d read. She didn’t push at it; instead she relaxed her thoughts and let the memory float to the top.\n Thanatos. One of two aspects of death from ancient Greek culture. Her frown deepened because as she remembered it, Thanatos was the nonviolent death god. The one who came to relieve suffering. And yet all these people were heavily armed. Lilah decided that whoever this “Carter” person was, she was glad she was not in his shoes.\n Below, Brother Simon clamped his jaws shut, clearly struggling with something else that he wanted to say, or perhaps feared to say.\n Mother Rose saw this and touched his face. “What is it?”\n “A few of the scouts have sighted a, um . . . girl with a slingshot among Carter’s refugees.” He spoke as if prying the words from his mouth. “The descriptions match Sister Margaret.”\n Everyone gasped and took involuntary steps away from Brother Simon, as if they expected lightning to strike him for some great sin. Suddenly the giant dropped his sledgehammer and caught Brother Simon by the throat, lifting him effortlessly until the reaper stood on the very tips of his shoes.\n “We do not speak that name,” he growled. Brother Simon’s face turned red and then purple as the giant squeezed his hand.\n Mother Rose leaned past the giant. “Are you sure, brother?” she asked in a voice that was as cold and hard as a knife blade.\n “Y-yes,” croaked Brother Simon in a strangled little voice.\n The giant glanced at Mother Rose, who studied the choking reaper with narrowed eyes. She touched the giant’s arm, a soft brush of fingertips over the landscape of his bulging muscles.\n “Brother Alexi . . . ,” she said, and the giant released Brother Simon, who collapsed to his knees, gasping and honking as he fought to drag in a breath. The giant, Alexi, picked up his sledgehammer and returned to his station just behind Mother Rose.\n The woman reached out and touched Brother Simon’s cheek. “Tell me,” she said.\n “I—I have it from five separate scouts, your holiness,” stammered Brother Simon, his throat still raw. “The description matches, even to the markings.” As he said this, he touched the pattern of flowers tattooed on his scalp. “Wild roses and thorns.”\n “Sister Margaret is dead,” said Mother Rose in a harsh whisper. “My daughter abandoned her family and her god. She runs with heretics and blasphemers. She is dead.” Mother Rose spat this last word. “The gift of darkness is not for her. I hope that her flesh lives on forever. Lost, alone, and damned.”\n The reaper placed his forehead on the dirt by Mother Rose’s feet. “Holiness, forgive this foolish sinner for causing you pain.” His body shook with sobs, and Lilah could not tell if his tears were from grief, regret, or fear.\n The scene below held for a moment longer, and then Mother Rose bent to the man, kissed his head, and drew him to his feet. “There is no sin in telling the truth, beloved Brother Simon,” she said. “Be at peace with the knowledge that the darkness waits to enfold you.”\n Brother Simon’s mumbled reply was too faint for Lilah to hear. He faded back into the crowd. A few of the other reapers touched him lightly on the shoulder.\n Lilah sneered at this. When the others thought that he was going to be punished, they’d all stepped back and disowned him; but in the light of Mother Rose’s forgiveness, they crowded around to share in the blessing he’d been given. That was not faith, not as Lilah defined it. It was cowardice. These reapers, dangerous as they may be, were ruled by fear as much as by devotion to their strange faith.\n Lilah hoped she would not need the knowledge, but she filed it away nonetheless.\n A female reaper bowed. Mother Rose said, “Speak freely, Sister Caitlyn.”\n “Before I heard the darkness call me—”\n “All praise the darkness,” intoned the others.\n “—I lived in Red Rock, near Las Vegas. I worked as a hunter for a group of refugees, and I know the desert and these woods as well as anyone. There are game paths all through here, and from the trail-sign I’ve seen, I think it’s clear that the, uh, person who used to be your daughter is leading Carter’s people along those trails. Rumors say that she’s lived out here since leaving the grace of the church. If so, then she must know every one of these trails. There are some that aren’t easy to spot.”\n “You think she can help the heretics slip past us?” asked Mother Rose, one eyebrow arched.\n Sister Caitlyn flushed, but she lifted her chin. “I know I could do it, and there are some experienced hunters with Carter. The desert is not as empty as people think. There are always places to hide.”\n Mother Rose nodded. “Thank you, Sister Caitlyn. Your service to our god makes smooth your pathway to the holy darkness.”\n The young woman bobbed her head. “Holiness, if the person who was your daughter is leading Carter’s people south, then I think we have to accept that she’s told them about Sanctuary.”\n Every single one of the reapers gasped in horror.\n 19\n “DON’T MOVE,” WHISPERED NIX.\n Benny had no intention of moving. He wasn’t sure he actually could.\n The lion stood in the tall grass, head raised, wind ruffling its thick mane. Its golden eyes were fixed on them. It snarled silently, baring more of its teeth but making no sound. Even the birds in the trees had been stilled by the presence of this great cat.\n Nix clutched Eve to her chest, and the little girl moaned softly in her sleep; a defensive, troubled moan.\n “Don’t provoke it,” cautioned Chong.\n “Really wasn’t planning to,” murmured Benny.\n “God,” said Nix in a hoarse whisper, “there’s another one!”\n Benny turned to his right and there, just beyond the bristlecone tree, stood another lion. A big female. Easily three hundred and fifty pounds. Tawny and lithe, her whole body rippled with muscular tension.\n Benny opened his mouth to try and say something—anything—but before he could, there was movement to his left. A third lion.\n And beyond that, another.\n Benny felt icy sweat run in lines down his back. He had his katana slung over his shoulder, and Chong wore his bokken in a sling at his hip. And Nix had her pistol.\n Would that be enough? He doubted it. In fact, he knew for sure that it wouldn’t stop more than one of these beasts. Maybe Tom could have managed something, but Tom was dead.\n The lions stood watching them. Four pairs of hungry eyes, four cunning minds analyzing the situation, just as Benny was trying to do. He knew that he was losing the battle of wits here as well.\n “Benny . . .?” whispered Chong.\n “I’m working on something,” Benny lied.\n Sure, Nix had the gun, but she was also holding Eve. In order to draw her gun she would have to set Eve down or hand her to someone else. That would certainly wake Eve up, and probably scare her into another fit of loud hysterics. Benny could sympathize. Loud hysterics seemed like the best way to react to this moment.\n Tom! What should I do?\n Nothing. No voice in his head, no answer.\n Benny tried to remember his training. One of the Warrior Smart rules was to always be aware of your resources. And always know your routes into and out of any situation.\n Behind them was the ravine filled with zoms. Across the ravine was certain death in the form of a legion of pale flesh-eaters. There were dense forests to hide in, but they were on the other side of the pack of lions.\n Crap, Benny thought. C’mon, Tom . . . now would be a really good time for some snazzy battle tactics. How do we get out of this? How do we not die?\n But all he heard inside his head were the echoes of his own pounding heart.\n 20\n LILAH INCHED FORWARD SO SHE COULD HEAR BETTER.\n “Sanctuary is a myth,” declared one of the reapers.\n “No, it’s not,” said another reaper. “I heard that the monks there are really scientists.”\n “I heard that too,” said another. “They used to work for the government. Some kind of bioweapons thing.”\n “No,” a female reaper chimed in, “the monks there are supposed to be trying to cure the disease so people can repopulate the world.”\n “Sinners!” growled a few.\n “Before I joined the Night Church,” said a man with a Navajo face, “I heard that there are two Sanctuaries. It’s supposed to be split down the middle, with the monks on one side and the scientists on the other side. The monks are just taking care of people—like hospice workers used to—and the scientists are trying to cure the plague. The monks are well intentioned but misguided. The scientists are the ones we shouldn’t trust.”\n “That’s right,” said another of the reapers. “I heard that they had cures for stuff like cancer and all those other diseases, but they kept it all secret because they had deals with pharmaceutical companies. It was all a big moneymaking scam.”\n Several of the reapers growled agreement with that. Even Lilah had heard some of these rumors. Mostly pre–First Night stuff she’d read in old books and newspapers she had salvaged, but in Mountainside everyone had one kind of conspiracy theory or another. Wriggly Sputters, the town’s eccentric mailman, was a walking encyclopedia of such stories, and he frequently said that there was a bunker or lab somewhere out in the Ruin where the government still existed. And in that bunker, the government maintained their power over the other survivors because they had control over cures to every known disease. No one really believed it, but few of the townsfolk stepped up to say that this was total nonsense. Lilah had no opinion on the subject—she cared very little for rumors.\n What she heard now, however, was fascinating.\n One reaper, a big man with a thick dark beard, laughed at the others. “Oh, please . . . you really think that the government would keep the cure to a doomsday plague to themselves after all that’s happened? Why would they let so many people die?”\n “Because it’s easier to rule a small population than try and control seven billion people,” insisted Brother Simon. “C’mon, Eric, that’s basic math. They took the best and the brightest and hid them away in these big caves and tunnels, and then they released the Gray Plague. You watch, one of these days they’re going to come out and announce a ‘cure,’ and then everyone who’s left will flock to them and hail them as the saviors of mankind. You watch.”\n “God won’t allow that to happen,” said Brother Eric.\n That quieted the reapers for a moment. It was a hard argument for any of them to knock down.\n Brother Simon shook his head. “Sure, that’s why we’re doing what we’re doing. Rather die in glory and join the darkness than live as slaves.”\n The rebuttal stalled Brother Eric for a moment, and he cut a look to Mother Rose. She gave him a bland smile.\n To Simon, Brother Eric said, “Don’t believe the myth of Sanctuary. It’s a lie told by refugees and heretics to give them false hope and to confuse us.”\n Before Brother Simon could reply, Mother Rose said, “Sanctuary is not a myth.”\n They all looked at her in surprise.\n “It is a very real place,” she continued, “and it is the most dangerous place on earth. Dangerous to everyone living, and dangerous to our own holy purpose.”\n Eric and Simon and the others shuffled in uncomfortable silence.\n “It is a weapon,” she said. “A great sword, if you will. A sword by itself is not evil. A sword can be used to slay an enemy, or release a suffering friend into the darkness. A sword can cut ropes that bind the helpless. A raised sword can be a threat or it can be a symbol of leadership.” She paused. “Consider our own war with the heretics. Many of them fight us with axes and knives and swords, and we know that in their hands these are tools of evil. And yet, behold the holy weapons you carry. They are sanctified and made pure by the purpose to which they are put. A weapon, my children, is good or evil depending on the intention of whoever holds it.”\n Lilah surprised herself by agreeing—at least in part—with what this woman said.\n The reapers milled around, murmuring and debating this with one another.\n Then Mother Rose raised her hand, and every tongue fell silent. “In the actions of heretics the schemes of evil are revealed. We know—we have been told—by the prophet Saint John that in these End Times the struggle to conquer evil will be hard fought. We know this. You, my warrior reapers, have endured fire and blood to send heretics into the darkness. You know, as I know, as Saint John knows, that at the end of our struggles the darkness waits for us. Once we have accomplished our holy purpose on earth, the darkness will embrace us and grant us everlasting peace. There will be no more hunger, no more sickness, no more fear. The darkness is eternal.”\n “Praise be to the darkness,” they intoned.\n “But we are all sinners. Everyone who remains clothed in flesh and who pollutes the earth by walking upon it is a sinner. God commanded that all human life should end. He made the dead rise and he opened the pathway to darkness for all who accept this truth.”\n They stared at her, totally rapt.\n “Only two kinds of people are left here in this hell of flesh and pain. The heretics who refuse to accept the truth and the will of our god,” said Mother Rose, her voice strident and powerful, “and us—the sanctified soldiers of God. We are the reapers sent among the wayward fields to cut down the infection that is life.”\n “Praise be to the darkness!” they cried. \n","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-10.html","bookId":2583,"book":{"id":2583,"title":"Flesh and Bone (Benny Imura #3)","description":"Storyline: \n Flesh and Bone (Benny Imura #3) \n Reeling from the tragic events of Dust \u0026 Decay, Benny Imura and his friends plunge deep into the zombie-infested wastelands of the great Rot \u0026 Ruin. Benny, Nix, Lilah and Chong journey through a fierce wilderness that was once America, searching for the jet they saw in the skies months ago. If that jet exists then humanity itself must have survived…somewhere. Finding it is their best hope for having a future and a life worth living. \n But the Ruin is far more dangerous than any of them can imagine. They are hunted by fierce animals escaped from zoos and circuses. They must raid zombie-infested towns for food and medical supplies. They discover the very real truth in the old saying: In the Rot \u0026 Ruin…everything wants to kill you. \n And what is happening to the zombies? Swarms of them are coming from the east, devouring everything in their paths. These zoms are different. Faster, smarter, infinitely more dangerous. Has the zombie plague mutated, or is there something far more sinister behind this new invasion of the living dead? \n In Flesh \u0026 Bone, Benny Imura, Nix Riley, Lou Chong and Lilah the Lost Girl are pitted against dangers greater than anything they\u0027ve ever faced. To survive, each of them must rise to become the warriors Tom trained them to be.\n \n","cover":"https://allnovel.net/images/flesh-and-bone-benny-imura-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/flesh-and-bone-benny-imura-3.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:08:44 PM"}}
