{"id":94640,"no":13,"title":"Page 13","content":"\\n\\n Lilah doubted it. Her instincts were screaming at her to get back.\\n\\n She backed away from the clearing and made a wide circle around the scene of carnage. As she did so, she caught sight of a ridge of white rocks just past a line of bushy pines. Lilah frowned at them. The rocks were unnaturally bright, almost like they had been painted with whitewash. Were they rocks or a structure?\\n\\n She ran through the trees toward them, intending to cut past them and head west again.\\n\\n However, the closer she got, the more her frown deepened, because it became quickly apparent that they were not rocks at all. Nor was it an old building.\\n\\n Lilah slowed from a jog to a walk, and as she emerged from the trees she stopped stock-still. Her mouth dropped open in shock.\\n\\n “No . . . ,” she whispered.\\n\\n The thing lay there. Huge. Ugly. Impossible.\\n\\n The thing was perched precariously on a shelf of rock that overlooked a long drop into a cleft that was thick with dark scrub pines and creeper vines. Someone had taken red paint—or perhaps blood—and written these words on the broad, white side of this impossible thing:\\n\\n WOE TO THE FALLEN\\n\\n Nearby, on a mound of dirt, three bodies in ragged military-style uniforms were hung on wooden posts. Zoms. They thrashed against the ropes that bound them.\\n\\n Lilah turned quickly and looked back the way she’d come, staring at the woods as if she could still see Nix and the others. Indecision tore at her. Should she tell her friends about this, or steer them away from it and never say a word about it?\\n\\n She thought about what it would do to Nix and Benny. Even to Chong.\\n\\n Lilah shut her eyes for a moment and ground her teeth in helpless frustration. It was so much simpler living alone. You never had to hurt anyone you cared about, because there was no one to care about. Telling her friends about this would be exactly like stabbing them through the heart.\\n\\n She lingered there, thinking it through, wrestling with it, aching with doubt.\\n\\n Then a voice behind her said, “There’s one!”\\n\\n Lilah instantly leaped to one side, twisting in midair to land facing the way she had come, her spear ready in her strong hands.\\n\\n Thirty feet down the path she had just come stood a pair of men dressed in black with red streamers tied to their clothes.\\n\\n Reapers.\\n\\n Lilah gaped.\\n\\n Not at the reapers, but at the figures who milled behind them.\\n\\n Zoms!\\n\\n There were at least a half dozen of the living dead—men, women, even a child. All newly dead, some of them glistening with blood that had not yet dried.\\n\\n Lilah’s heart sank. Now she knew what had happened to the other people who had camped here. The zoms moaned in freshly awakened hunger. They staggered through the tall grass, hands reaching awkwardly toward her, completely ignoring the two reapers as they shuffled past.\\n\\n “Hey, girl!” yelled one of the reapers. “Drop your spear and give yourself up to the darkness. It wants you. The darkness wants to open the red door in your flesh. Why fight it? The darkness is beautiful. The darkness is eternal. The darkness is yours if you stop fighting and allow it to enfold you.”\\n\\n The words had a cadence like scripture, but they were from no holy book Lilah had ever read—and in her solitude, she had read most of them. These words were intended to coax, but instead they made the hands that held her spear tighten with anger.\\n\\n “Come on, kid,” said the second reaper. “Accept the truth. The darkness wants to take you. The darkness wants to take us all. It’s the will of God.”\\n\\n Lilah had never been much for profanity, but as the men continued to call for her to open herself to the darkness, she responded with a series of phrases she’d learned at Gameland. It shocked the men to silence.\\n\\n The dead kept coming.\\n\\n Fifteen feet away now.\\n\\n Lilah debated pulling her Sig Sauer. She had no doubt that she could put all the zoms down as well as the two men with less than a full magazine.\\n\\n It would be noisy, though, and Lilah liked the quiet.\\n\\n Instead she gave her spear a single arrogant twirl and charged straight at the zoms.\\n\\n And the dead rushed at her on stiff and clumsy legs. All but one. A tall woman whose throat had been slashed rushed ahead of the pack, arms outstretched, mouth wide, racing toward Lilah.\\n\\n A fast zom.\\n\\n The running zombie grabbed for her, and Lilah uttered a feral growl as she jumped left and used the short leap to channel power into a vicious cut that took the zom across the upper chest. The heavy blade sheared through one arm, part of the chest, and clean through the dead woman’s spine; and the shock of the powerful blow reverberated through Lilah’s entire body. The creature instantly dropped into a boneless heap that would never move again.\\n\\n Lilah’s heart was racing as adrenaline flooded through her bloodstream.\\n\\n The slower zoms had reached her now and attacked in a ragged line. Two reached her first.\\n\\n Lilah spun and swept the spear low, cutting the first one’s leg off at the knee; then she continued the swing and brought the weighted opposite end around in an overhand sweep that crushed the second zombie’s skull. Before it even had a chance to fall, Lilah pivoted and used the same metal knob to end the torment of the child zom.\\n\\n Three down in two seconds.\\n\\n She kicked out at one zom as it tried to dive for her thigh, its teeth clacking in the air. The kick jolted it to a stop in a half crouch, and she swept the knob up under its chin so hard and fast that its head snapped back, breaking its neck.\\n\\n “Hey!” yelled one of the men, but Lilah ignored him. She’d seen no firearms on them. They could wait.\\n\\n A cold hand closed on her shoulder, knotting her shirt in dead fingers as it sought to pull her backward toward its bloody teeth. Lilah went with the pull, but as she did so she spun her body in a violent pirouette. The torsion bent the zom’s arm backward so fast that bones splintered and the creature lost its grip. Lilah rammed the shaft of her spear across its throat and drove it into the last of the zoms, knocking them both to the ground. She thrust the blade into the neck of one, severing the spinal cord; then tore the blade free, twirled the spear again, and brought the heavy knob down on the last zombie’s skull. There was a pulpy whack and then the trail was still.\\n\\n She turned toward the two reapers, who stood where they had been, their eyes goggling, mouths hanging open in total shock.\\n\\n Lilah smiled at them.\\n\\n And charged.\\n\\n It had taken her five seconds to destroy the six zoms.\\n\\n It took two seconds to cut both reapers down.\\n\\n They reeled away, each of them clutching identical red lines across their throats. They gagged. They tried to speak, perhaps to protest the impossibility of everything that had just happened; but neither of them would ever speak their confusion. They dropped to their knees. One fell forward onto his face. The other toppled backward.\\n\\n In the trees above them, the monkeys screamed in panic at the smell of death and blood.\\n\\n Lilah stood above the dead reapers, her chest heaving, sweat glistening on her cheeks and throat.\\n\\n Her heart sank, though. Without wanting to, she had taken sides in the war between the reapers and the people they called heretics. Which meant it was her war now.\\n\\n Would it get her killed?\\n\\n Would it get Chong killed?\\n\\n She looked down at the two men, wondering if they would reanimate. Or had the zombie plague truly changed?\\n\\n Then a cloud moved above, and fresh sunlight blazed on the big white thing behind her on the edge of the cliff. She turned and stared at what she had thought was a line of white rocks.\\n\\n “God,” she murmured. This was going to really kill the others.\\n\\n Between this and the thought that she had dragged her friends into someone else’s war, her entire mind was in turmoil.\\n\\n She never saw the shape that stepped out of the woods behind her.\\n\\n It, however, saw her, and its lips peeled back from jagged teeth as it charged at her. Not in a slow, shambling gait—death raced at Lilah at incredible speed.\\n\\n 23\\n\\n “DO AS SHE SAYS,” GROWLED A VOICE BEHIND THEM, AND BENNY, NIX, and Chong wheeled around to see a man come stalking out of the woods beyond the bristlecone tree. He was tall and middle-aged, with black hair tied back in a ponytail and bloody bandages around one thigh and his forehead.\\n\\n He stopped forty yards away and raised a shotgun to his shoulder, the barrel pointed at Benny’s head.\\n\\n “Riot,” barked the man, “take their weapons and gear.”\\n\\n The slingshot girl—Riot—gave a short, harsh laugh. “Y’all heard the man. Drop all the goodies and maybe y’all will still be sucking air come sundown.”\\n\\n Benny did not drop his sword, but instead moved to stand in front of Eve.\\n\\n “Ry-Ry!” cried the little girl.\\n\\n Riot looked past Benny. “You okay, squirt?”\\n\\n “Ry-Ry . . . where’s—?” Then the little girl saw the man and shrieked with joy. “Daddy!”\\n\\n Chong said, “‘Daddy’?”\\n\\n The man’s face went white, but his eyes hardened. “Take your filthy hands off my daughter!”\\n\\n “Whoa, mister!” said Benny. “Everything’s cool here and—”\\n\\n “I won’t tell you a second time,” growled the man as he took a threatening step forward.\\n\\n Nix swung the pistol toward him and met his eyes with her own uncompromising stare. “You pull that trigger, mister, and I’ll kill you where you stand.”\\n\\n The man snorted. “You’re at a long range for a pistol, girl.”\\n\\n “And you’re at a long range for a shotgun. Let’s see who’s left standing to take the next shot.”\\n\\n Benny said, “And you really want to fire a shotgun with a kid here?”\\n\\n They were all in bad positions. Benny felt the moment becoming incredibly fragile. If someone pulled a trigger, probably everyone would die.\\n\\n The man’s face was flushed, and fury seethed in his eyes as he looked from them to Eve and back again. “Why can’t you freaks just let us be?”\\n\\n “What are you talking about?” barked Nix. “How are we bothering you?”\\n\\n A third stranger came hurrying out of the woods behind the clearing, and once more Benny realized that he and his friends were boxed in.\\n\\n The newcomer was a woman wearing a hooded sweatshirt that was smeared with bright blood. She held an ax in her hands, and its blade glistened with red.\\n\\n Blood, whispered Tom inside Benny’s mind. Zoms don’t bleed.\\n\\n I know, Benny told him. So who’d she chop with that thing?\\n\\n Behind Benny, Eve cried, “Mommmeeeee!”\\n\\n Chong tried to hold Eve, but Riot shot a stone at Chong, missing his nose by half an inch. Eve broke free and ran like lightning across the clearing toward the woman.\\n\\n The woman fairly shrieked. “EVE! Oh my God . . . Evie!”\\n\\n She dropped her ax and swept Eve into her arms.\\n\\n “Okay,” said Chong, “this is heartwarming and all that, but if they’re here, then where’s Lilah?”\\n\\n Benny cut a cautious look around, but there was no sign of the Lost Girl.\\n\\n The man with the shotgun grinned at the reunion between his daughter and wife, but he kept his shotgun pointed at Benny. They were thirty yards away, and Benny took a step toward him, raising his hand.\\n\\n “Hey, mister, we’re glad to—”\\n\\n “You freeze right where you are, boy,” barked the man in a voice that was hard and flat. An uncompromising voice. “If you reaper scum harmed a hair on my little girl’s head, I’ll see you dead—and it won’t be no ticket to paradise. No sir, it’ll be slow and ugly. Tell me I’m lying.”\\n\\n Benny froze, and his smile flaked away like peeling paint in a stiff wind. “No,” he said neutrally, “I think you’re telling the absolute truth. But you aren’t making any sense. I think we need to—”\\n\\n “I got nothing more to say to you.”\\n\\n “‘Reaper scum’?” echoed Chong. “I’m real certain I don’t like the sound of that.”\\n\\n “Benny—?” began Nix, but Benny cut in.\\n\\n Under his breath he said, “Keep your gun on him.”\\n\\n Benny shifted position again, putting himself squarely between Nix and Riot.\\n\\n “Sarah,” said the man with the shotgun, “is she hurt? Did they do anything to her?”\\n\\n “I’m okay, Daddy,” began Eve, but the man growled at her.\\n\\n “Hush, girl.”\\n\\n The woman—Sarah—did a quick but thorough examination of her daughter, then pulled her into another hug. “She’s fine, Carter. They didn’t hurt her.”\\n\\n “They didn’t have time,” sneered Riot. “I told you we’d find her.”\\n\\n “Of course we didn’t hurt her,” snapped Nix. “We rescued her.”\\n\\n “Oh yeah,” mocked Riot, “I’m sure.”\\n\\n “What’s the truth of it, Evie?” said Carter. “None of your pretend stories now. Did these people hurt you? Did they touch you?”\\n\\n Eve shook her head. Her eyes were wide and filled with doubt and confusion.\\n\\n “It’s true, mister,” insisted Benny. “She was being chased by zoms, and we rescued her. She’s fine.”\\n\\n Riot edged forward, tightening her aim at Nix. “Rescued, huh? Don’t buy that bullcrap, Carter. I’ll bet my dear ol’ mom sent them to grab Eve so they could sacrifice her. That’s just the kind of thing she’d like.”\\n\\n “Sacrifice?” gasped Benny. “What are you, nuts or something? It was like I said. Eve was being chased and—”\\n\\n “We know she was being chased,” cut in Riot. “How stupid do you think we are?”\\n\\n “You really want an answer to that, baldy?” asked Nix coldly.\\n\\n “Well, ain’t you got a smart mouth?” said Riot, grinning a nasty little grin. “I’d love to kick it off your face.” \\n\\n","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-13.html","bookId":2583,"book":{"id":2583,"title":"Flesh and Bone (Benny Imura #3)","description":"Storyline: Flesh and Bone (Benny Imura #3) \\n Reeling from the tragic events of Dust \u0026 Decay, Benny Imura and his friends plunge deep into the zombie-infested wastelands of the great Rot \u0026 Ruin. Benny, Nix, Lilah and Chong journey through a fierce wilderness that was once America, searching for the jet they saw in the skies months ago. If that jet exists then humanity itself must have survived…somewhere. Finding it is their best hope for having a future and a life worth living. \\n But the Ruin is far more dangerous than any of them can imagine. They are hunted by fierce animals escaped from zoos and circuses. They must raid zombie-infested towns for food and medical supplies. They discover the very real truth in the old saying: In the Rot \u0026 Ruin…everything wants to kill you. \\n And what is happening to the zombies? Swarms of them are coming from the east, devouring everything in their paths. These zoms are different. Faster, smarter, infinitely more dangerous. Has the zombie plague mutated, or is there something far more sinister behind this new invasion of the living dead? \\n In Flesh \u0026 Bone, Benny Imura, Nix Riley, Lou Chong and Lilah the Lost Girl are pitted against dangers greater than anything they\u0027ve ever faced. To survive, each of them must rise to become the warriors Tom trained them to be.\\n","cover":"https://allnovel.net/images/flesh-and-bone-benny-imura-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/flesh-and-bone-benny-imura-3.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:08:44 PM"}}
