{"id":94641,"no":14,"title":"Page 14","content":"\n “Try it. I don’t mind shooting girls, either.”\n Riot’s grin flickered.\n “She’s not joking,” Benny said, and pointed his sword at her. “Neither am I. Don’t try it.”\n “Ooooh,” said Riot, “fierce.”\n “Get stuffed,” said Nix. She focused her attention on Carter. “Eve’s fine because of us, mister. I don’t know who you think we are, but you’re wrong.”\n “Reapers don’t open their mouths unless they plan to lie,” warned Riot. “Believe me, I know.”\n “We’re not reapers, whatever they are,” said Nix angrily. “We’re travelers. We’re looking for something.”\n “Looking for what? The darkness?” demanded Carter in a tone that was heavy with disgust. Riot gave a harsh laugh of agreement.\n “Darkness?” echoed Benny, but Nix ignored him.\n “We’re looking for an airplane,” she said. “A jet.”\n Carter’s expression changed from open hostility to doubt. He shot a look at Sarah, who frowned.\n “They saw it too,” she said. “Carter—they saw it too!”\n “You saw it?” demanded Nix, her tone suddenly urgent. “When? Where?”\n “Don’t say anything,” warned Riot, but Sarah ignored her.\n “The last time we saw it, it was heading south.”\n “Last time?” echoed Chong.\n “You’ve seen it more than once?” Nix gasped.\n “Sarah, hush,” said Carter. “This isn’t the time or place.”\n “But, Carter—look at them. They don’t look like reapers. Look at their clothes. No wings. No tassels or anything. And they don’t have the mark.”\n As Sarah said this, she touched her head, but Benny did not understand the reference. What mark?\n “Enough!” growled Carter.\n “Look, guys,” said Benny, “I think we should all chill out and talk about this. No one wants to hurt anyone here—”\n “Speak for yourself,” said Riot with quiet menace.\n “—and it sounds like we have a lot to talk about,” Benny concluded, pasting on his best “aw shucks, we’re all friends” smile. The kind that used to get him a bottle of pop at Lafferty’s General Store, even when he had no ration dollars.\n Carter wasn’t impressed. “If you want to talk, then tell the young miss there to put her gun down.”\n “The young miss says, ‘Bite me,’” replied Nix. “You put your gun down first and then we’ll see.”\n “Not a chance,” said Carter, and Riot gave a snigger of agreement.\n “Look, how about you both put your guns down at the same time,” suggested Chong. “On a count of three, okay? One, two, three . . .”\n They ignored him.\n “This is stupid,” Benny yelled. “Nobody here wants to hurt anyone else.”\n “Don’t bet on it,” said Riot.\n “Absolutely,” agreed Nix.\n “They’re reapers, Carter,” said Riot. “Maybe they even have some quads hidden somewhere.”\n “What’s a quad?” Chong asked, but no one heard him.\n “They don’t look like reapers,” repeated Sarah.\n “Then they’re new converts,” countered Riot. “They could have taken the vow but haven’t yet done the ceremony of purity. But it doesn’t matter. They had Eve!”\n “Yeah, we were keeping her safe,” replied Nix. “What were you doing to protect her? Letting her run around in woods full of wild animals and zoms?”\n “Yeah, nice try, Freckles,” snorted Riot. “C’mon, Carter, don’t let her scramble your grits. My mother’s people are gonna be here soon. These punks are scouts or something equally squirrelly. Let’s put ’em down before we get overrun.”\n Carter’s face was rigid with tension, but there was doubt in his eyes. “Sarah—?”\n Eve’s mother looked up, and if Benny was expecting her to be the voice of reason, he was dead wrong. “She’s right, Carter, we can’t take any chances. Don’t hurt them, but take their weapons and gear. Then we have to go. We have to get to Sanctuary and—”\n “Jesus! Hush your mouth, woman!” screeched Riot.\n “Sarah,” Carter said with quiet horror. “What have you done?”\n The woman clapped a hand to her mouth and her face went dead pale. “Oh God,” she said. “I’m sorry . . . I’m so sorry. I didn’t mean to . . .”\n Carter nervously shifted the shotgun barrel between Nix and Benny, as if trying to decide which of them should die first. Or maybe, thought Benny, trying to decide which one would be easier to kill without losing too much of his own soul. Benny did not believe that this man wanted to fire that gun, but he looked desperate and shoved to the edge of panic. Benny knew full well how panic could inspire the worst possible choices.\n Riot’s face hardened. “Now we got no choice at all, Carter.”\n In a voice loud enough for only Benny and Chong to hear, Nix muttered, “Screw this.”\n “Nix,” warned Benny too quietly for the strangers to hear, “don’t do anything crazy.”\n “Wouldn’t dream of it,” she murmured.\n And then she fired at Carter.\n 24\n LILAH HAD NO CHANCE.\n She heard the scuff of a footfall on stone behind her, but before she could turn the thing slammed into her. Even then she tried to dodge, but pain exploded along her side and suddenly she was flying through the air.\n Blood trailed behind her like the tail of a comet, spattering the leaves and bristles of the shrubs. Her spear spun away into the weeds. Then Lilah struck the ground on the edge of the cracked shelf of rock, and the impact knocked all the air from her lungs.\n She lay there, firestorms of pain racing up and down her spine. She clung to the edge of the shelf and to the edge of consciousness. Blood pooled under her. Every part of her was wrapped in pain. She tried to get up, tried to see what it was that had attacked her, but fresh pain detonated in her lower neck and back. She collapsed down with a helpless cry.\n The thing wheeled toward her and grunted in awful hunger.\n Lilah craned her neck and stared at it. At the impossibility of it.\n It was a massive wild boar. Five hundred pounds of muscle and hunger. Brutish, ugly, with a barrel chest, short legs, and wicked tusks.\n But that was not the worst part of it.\n Flesh hung in bloodless strips from the massive shoulders. Its teeth were caked with rotted meat. It stank of rot and death.\n It was impossible.\n And yet . . . it was a zombie.\n Lilah screamed.\n The monster roared with terrible hunger as it charged.\n 25\n NIX’S SHOT GALVANIZED EVERYONE INTO MOTION.\n Carter flung himself to the ground, twisting and firing as he fell. Nix dropped down to avoid the buckshot, but the pellets went high and wild, chasing birds screaming from the trees.\n Sarah clutched Eve to her chest and dove into the tall grass.\n Chong staggered backward from the blast and stood teetering on the edge of the ravine, his arms pinwheeling, while below him the zoms let out a renewed moan of hunger.\n Benny had to drop his sword to grab him, but he spun fast and flung Chong with unintended force straight into Riot. They slammed down on the ground and vanished into the brush.\n For a moment only Benny was left standing.\n Then Nix and Carter both rose to their knees, guns coming up. Benny dove for his sword and skidded five feet on his chest.\n “Don’t!” he cried, but Nix fired again, forcing Carter to dive sideways again.\n Benny heard a thwop sound, and something whipped through the air a finger’s width from his cheek. He saw Riot lying on her side with the slingshot in her hands. She’d aimed at Chong, who was already on his feet, but the stone missed him and almost hit Benny.\n Riot’s hands moved with incredible speed as she fished out another stone and seated it into the sling.\n “Chong—run!” yelled Benny, but Chong was already in motion, cutting away from them toward the nearest stand of pinyon trees. His only weapon was a wooden bokken, and that was the wrong thing to bring to this fight. Benny was relieved to see Chong dive into the shadowy woods.\n Carter got to his knees again and put his shotgun to his shoulder.\n “Riot!” he yelled. “Get out of the way.”\n Benny turned to see that Riot was aiming her next rock at Nix. Benny dove into Nix, knocking her out of the way. Riot’s stone hit hard on his hip, and it hurt like hell.\n He landed sloppily but got up fast, bringing his sword up.\n Riot snarled at him, and there was murder in her eyes as she fished out another stone.\n “Don’t,” he warned.\n She drew back the sling—and froze.\n Carter and Sarah and Eve froze too, all of them staring at the eastern woods, their eyes wide.\n Benny heard it then.\n The motor sound he’d heard earlier.\n It was back. Louder.\n And it was heading their way, closing fast from at least three different points in the forest.\n “Reapers!” screamed Sarah.\n Riot shot a brief look at Benny and Nix, and then she spun on her heels and ran full tilt into the woods, following the same direction Chong had taken.\n “What’s going on?” begged Nix, her pistol still held out in a two-handed grip.\n Carter began backing away from the forest, edging toward a thin stand of trees due south. Sarah rose, clutching Eve to her chest; the eyes of both were wild with fear.\n “Nix!” called Eve, reaching a hand toward her.\n For a split second, Carter and Sarah looked at their daughter’s face and then across the field to Nix and Benny.\n Carter lowered his shotgun.\n “Run,” he said.\n The motor sounds were everywhere now, getting louder and louder.\n “RUN!” screamed Sarah.\n She and Carter whirled and ran for the trees.\n Benny glanced at Nix.\n The ravine was behind them and there were woods all around the clearing.\n Nix pointed her pistol at the closest of the motor sounds. “What is that?”\n “I don’t know,” Benny said, pushing her arm down. “But let’s not find out. Let’s go.”\n They backed up several steps, then together they turned and ran as hard as they could for the forest.\n 26\n LILAH TRIED TO PULL HER PISTOL AS THE MONSTER RACED TOWARD HER.\n But it was too fast and too close.\n She tried to get up, but her left side was a furnace of heat and blood. Her leg buckled, and she fell back.\n Over the edge of the cliff.\n The darkness below swallowed her—body, screams, and all.\n 27\n LOU CHONG RAN FOR HIS LIFE.\n It was, he realized with some despair, something he had to do way too often.\n Chong was lean and fit, but he was not a good runner. He felt that his body was better suited to climbing a tree with a good book in his back pocket, wading out into slow streams with a fishing pole, or sitting at a picnic table eating apple pie and discussing either fishing or books. Eluding hot pursuit had never been on his list of things to enjoy before he got old. Neither, for that matter, was fighting zoms in a ravine, staring down the mouths of lions, or looking into the barrels of shotguns.\n Nevertheless, he ran.\n This forest was sparse compared to the denser woods back home in central California. Even so, Chong managed to use the meager vegetation for cover as he put as much distance as he could between himself and the craziness back on the field.\n He paused only once, to gape in wonder at the men and women on motorized machines who came tearing out of nowhere.\n Jeez, he thought dryly, Nix is going to love this.\n And not for the first time—or even the first time that day—Chong wished that Tom was still here.\n But . . .\n The motor sounds faded a bit, and Chong felt a splinter of relief that those newcomers were not chasing him. The others, though . . . Riot, Carter, and Sarah. They could be anywhere out here, and Riot had already demonstrated that she was capable of moving like a ghost through the forest and tall grass.\n Moving like Lilah.\n Chong wanted to find her more than anything in the world.\n In the far distance he could see a ridge of rocks that were eye-hurtingly white, but he decided not to go that way. With his dark jeans and shirt, he’d be like a black fly on white linen.\n Instead he headed along a ridge of red rocks that cut through the forest and seemed to curve around to the east. Lilah probably went east to find Eve’s parents, so Chong angled that way.\n When he was a mile into the woods, Chong dropped into a low squat and listened. He was a very good listener, with sharp senses that he’d honed for months as a tower guard on the fence line between Mountainside and the Ruin. Tom had helped him refine his understanding of the information his senses offered to him. The difference between the rustle of branches in a variable breeze and the sounds of someone—or something—moving stealthily through the brush. The difference between the moan of wind through rusted metal on a deserted farm or abandoned car and the hungry cry of a distant zom. He made his body go absolutely still as he listened.\n The motor sounds were far away, and the woods around him were still. The forest, though, is never silent; nature never totally holds its breath. There are always small sounds—insects and animals, the subtle noises made as the temperature changes throughout the day, causing wood to expand and contract. He listened for sounds that shouldn’t be there.\n There was nothing.\n Until there was something.\n Chong tilted his head to try and catch the ghost of a sound. He almost dismissed it because it was in time with the breeze, but then he listened closer. No, not in time with the breeze; just behind it. He nodded to himself. What he heard was the sound a careful person made when they were trying to move with the breeze, but they were doing it slightly wrong. They were waiting for the wind to stir the branches and then moving with the swaying brush; but that wasn’t the way Tom had taught them. \n","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-14.html","bookId":2583,"book":{"id":2583,"title":"Flesh and Bone (Benny Imura #3)","description":"Storyline: \n Flesh and Bone (Benny Imura #3) \n Reeling from the tragic events of Dust \u0026 Decay, Benny Imura and his friends plunge deep into the zombie-infested wastelands of the great Rot \u0026 Ruin. Benny, Nix, Lilah and Chong journey through a fierce wilderness that was once America, searching for the jet they saw in the skies months ago. If that jet exists then humanity itself must have survived…somewhere. Finding it is their best hope for having a future and a life worth living. \n But the Ruin is far more dangerous than any of them can imagine. They are hunted by fierce animals escaped from zoos and circuses. They must raid zombie-infested towns for food and medical supplies. They discover the very real truth in the old saying: In the Rot \u0026 Ruin…everything wants to kill you. \n And what is happening to the zombies? Swarms of them are coming from the east, devouring everything in their paths. These zoms are different. Faster, smarter, infinitely more dangerous. Has the zombie plague mutated, or is there something far more sinister behind this new invasion of the living dead? \n In Flesh \u0026 Bone, Benny Imura, Nix Riley, Lou Chong and Lilah the Lost Girl are pitted against dangers greater than anything they\u0027ve ever faced. To survive, each of them must rise to become the warriors Tom trained them to be.\n \n","cover":"https://allnovel.net/images/flesh-and-bone-benny-imura-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/flesh-and-bone-benny-imura-3.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:08:44 PM"}}
