{"id":94647,"no":20,"title":"Page 20","content":"The pain was . . . immense. But her hand closed on the branch. She took everything the pain could throw at her. She bit down on it, snarled at it, opened her mouth and howled it out of her as she pulled on that branch. Broken twigs slashed at her side and legs and arms, but she took that pain too. Pain had never owned Lilah, and it did not own her now. Screaming with agony and rage, she whipped her other hand up, pulling now with both arms, with the muscles of her shoulders and chest and back. Suddenly she heard a sharp crack beneath her, and the main branch on which she lay collapsed away from her, leaving her hanging. The pain, clever and deceitful as it always was, revealed that it had so much more to give. She screamed, but she took it. The muscles all along her tanned arms stood taut against her skin. Hot wetness ran down from her torn side, and fat drops of blood fell down into the shadows. Below her the infected hogs sent up a squeal of hellish hunger. “Damn you,” she growled as she pulled herself up. The whole tree swayed, tilting outward as if trying to shake her off. Lilah pulled. The pigs were in a frenzy, smashing themselves against the trunk. Lilah pulled. Pinecones rained down on her. Blood roared in her ears. Lilah pulled. She forced her knees up, forced her feet out to explore, forced them to find something solid. And there it was. The stump of the branch that had just broken. Twenty inches of solid wood. Lilah stretched one foot out and shifted her weight onto it. The branch held. With the last of her strength, she swung her body above the branch and settled her other foot on it. Safe. Gasping, bleeding, sweating, dizzy, and sick. But safe. When she dared open her eyes, she looked down at the boars below her. Six of them. Dead pig eyes stared back up at her. They wanted her flesh. They had the patience of eternity to wait her out. Even with her pistol and spear she could never hope to defeat two of them, let alone a half dozen. Nevertheless Lilah bent over so they could see her face. And she smiled at them. 36 SAINT JOHN OF THE KNIFE RAN LIKE A GHOST, MAKING ONLY THOSE sounds he chose to make. The children—the false Nyx and her knight—were clever, and they had some woodcraft, but they were not a tenth as silent as the man who followed them. Behind and around Saint John there were other sounds. The distant roar of the quads as his reapers scoured the woods to hunt down the last of Carter’s heretics. And, closer to hand, the artless footfalls of the following dead, coaxed in this direction by occasional blasts of his dog whistle. Twice Saint John encountered reapers and twice he sent them away, declining their offer of help, ordering them to continue with the hunt for the heretics. By nightfall the last of that party should be accounted for, their bodies opened by sanctified blades so the darkness could enter. It had been a long chase from Treetops, the clever tree-house town in Wyoming. A thousand wooden houses built amid the boughs of the sturdy pines of the Bighorn National Forest. He smiled at the thought. Wooden houses in wooden trees. Lovely to the eye, but so foolish, and ultimately no protection from torches and blades. No protection from the will of God. The memories of that conflagration enchanted his mind as he ran. The graceful pines reaching like the arms of green titans into the endless star field of the night sky. The mingling of a hundred shades of yellow and orange and red as the trees caught fire. The screams of the blasphemers, crying out to a god who could not answer, for he did not exist. Saint John wished that he could be inside their minds at the moment when the darkness took them. How wonderful it must be to suddenly see and know the infinite truths. It made him want to weep, as he had wept then. In the morning he had moved through the ashes, and his tears fell onto blackened bodies that now knew the glory of the eternal darkness. Saint John had fallen to his knees, his arms red to the elbow with blood, his mouth smeared with it, his cheeks streaked with tears. There he had led the faithful in a prayer. Mercy for those who were too blind to see the truth. Grace for those who had embraced the darkness as the flames and the blades sanctified them. And patience to the reapers who each longed to step into that darkness, but whose sacred duty kept them here. In ugly, mortal flesh, attached to this world of hurt and misery until the work of their god was accomplished. His wonderful memories were shattered by a gruff voice yelling from the woods. “There’s one of them!” Saint John slowed from a run to a walk and then stood still as three men emerged from the darkness of the forest. They were tough-looking. Big and muscular, each of them armed with a vicious farm tool. One man had a pitchfork, another had a sledgehammer that he held as if it were a tack hammer, and the third carried a pair of sickles. Carter’s people. Heretics. Their clothes were filthy and streaked with mud and blood. They were unshaven, and there was a desperate wildness in their eyes. “Welcome, my friends,” he said. “Welcome, he says,” growled the man with the sledgehammer. “I’ll show him a welcome,” laughed the man with the sickles. “I offer the grace and blessings of Thanatos,” said Saint John, “praise be to the darkness.” The man with the pitchfork pointed the wicked tines at him as the men closed in and spread out to form a loose ring. “You bastards killed Andy Harper’s family, and the Millers and the Cohens and half the town.” “More than half, I assure you,” murmured Saint John. “Many more than that.” The sledgehammer man gaped at him. “And you stand there and make jokes?” Saint John shook his head. “No jokes, brother.” “My sister’s husband is nothing but ashes because of you,” said the sledgehammer man, “and her kids don’t have their father. How is that anything but the devil’s work?” “If children grieve, then there is a path to release from all hurts and harms,” replied Saint John. “We offered it to you. That offer still stands.” “Offer?” sneered the man with the pitchfork. “What kind of crap is that? You and your bunch are nothing but killers. You’re no different from the walking dead.” “Oh, they’re different,” countered the man with the sickles. “The dead can’t think. They’re just mindless corpses, there ain’t no evil in them, ’cept in what they do; but this scumbag and that psychotic witch Rose—they’re pure evil.” He glared at Saint John. “Evil to the core, and may you burn in hellfire forever for what you’ve done.” “There is no hellfire,” murmured Saint John. “There is only the red doorway and the darkness.” “Red doorway?” demanded the sledgehammer man. “What the heck’s that?” Saint John drew his two knives, and in the shadows under the junipers, he showed them. The screams of the three men chased all the birds from the trees. 37 SO MANY THINGS WENT WRONG ALL AT THE SAME TIME. Chong heard the twang of the bowstring. He heard Sarah’s inarticulate cry of grief and hatred. He heard sounds of impact. Meaty and wet. He heard Eve’s shrill screech of horror. He heard the laughter of the reaper named Brother Andrew. Then all those separate sounds and all the disparate events snapped together into one terrible moment of action. Time whipped up and slammed into everyone, and suddenly the lives and fates of every person in that clearing changed forever. Chong was no longer running. He stood still, locked into a posture of attack, jerked to a sudden stop as surely as if he’d run into a wall. His bokken was in his hands, but the blade was shattered and the shock of a fading impact still trembled in his arms. The woman, Eve’s mother, was falling slowly, slowly to her knees, her protests silenced in the ugliest possible way. Eve’s face was covered with blood that was not her own, and her eyes danced with madness that was equal parts incomprehension and dreadful awareness. Brother Andrew began to turn toward her. But the archer. The archer . . . . . . was falling. Danny looked at Chong with a challenging perplexity. His eyes met Chong’s, then drifted down to the arrow he had just fired. The arrow that stood out straight and immutable from Chong’s torso. Chong looked down to see the feathered end of the arrow standing straight out from his stomach. He craned his neck and looked over his shoulder. The barbed tip of the arrow stuck out red and glistening behind him. “Oh,” said Chong. The archer opened his mouth to speak, but instead of words, blood poured from between his lips. His skull looked wrong to Chong. Misshapen. Dented. Chong looked down at the broken wooden sword. The top half of the sword lay on the ground between him and the archer, shattered by the force of the blow he had just delivered. “Oh,” he said again. With a wet gurgle, the archer dropped to his knees, then fell sideways, making no effort at all to catch his fall. Brother Andrew turned away from the woman he had just murdered, and his grinning face went slack with shock. “Danny . . .?” he asked uncertainly. Danny—the archer—was beyond answering. Chong felt his legs beginning to tremble. I’m shot, he thought. The handle of the bokken tumbled from his rubbery fingers. I’m in shock. There was no pain. There was . . . nothing. I’m dead. And . . . Well . . . that’s what town boys get for trying to be heroes. Brother Andrew took a step forward as he swung the scythe around to point at Chong. “You little piece of scum. Do you know what you’ve done?” Chong wanted to explain. At the very least he wanted to ask why this man, this reaper, would be angry at the death of the archer. Clearly they were dedicated to death itself. It did not make sense that he would be angry at an incident that was part of his own beliefs. That was the thread of logic that was sewn through Chong’s mind, and he wanted to discuss this philosophical point with Brother Andrew. Chong found enough of his voice to croak out two words: “I’m sorry.” It was the wrong thing to say, and he really did not mean to give that apology to the reaper. He wanted Eve to hear it. Because her parents both lay dead on the sandy ground; but more so because Chong knew that he was not going to be able to save the little girl from this big brute. He wanted to, though. He would even have accepted death as a price for saving her. That’s what a samurai would do. There was justice in that. There was closure in that. But to die with half the job done . . . You’re not a hero, he told himself, but don’t die a loser. Don’t let them win. Chong took a step, but his knees buckled and he dropped down beside Danny’s body. The bow was right there, inches away. The arrows were spilled all around him. The universe is throwing you a bone, he told himself. Take it. He reached for the bow with clumsy fingers. Picked it up. Picked up an arrow. The black goo smeared on the tip smelled horrible, like cadaverine or something worse. But even as he fumbled it onto the string, Chong felt his strength pumping away. Flowing out of him. He looked past Brother Andrew to where Eve stood. “Run . . . ,” he croaked. The girl was frozen to the spot. Wide-eyed, voiceless with horrors so vast that she could do absolutely nothing but stand and stare. And die. Chong knew that she was going to die. She’d stand there and be killed and never lift a hand because there just wasn’t enough of her left for even that. Brother Andrew seemed to snap out of his own daze. His lip curled in anger, and he adjusted his grip on his scythe as he began stalking across the clearing toward Chong. “Run,” begged Chong. He raised the bow and arrow, but his hands trembled with the palsy of shock and injury. “I’ll make you pay for what you’ve done,” promised the reaper. “I’ll make this last. I’ll hear you scream and beg before I let you taste the darkness. By the god of death so I will.” “Will you please just shut up,” Chong said between gritted teeth. Then, with the last energy he had, he pulled the string and released the arrow. It flew straight and true and buried itself in the dirt between Andrew’s feet. The reaper laughed and raised his scythe, and its shadow painted a promise of darkness across his face. FROM NIX’S JOURNAL Before we left town, I did something nobody else knows about. I went to the cemetery and dug a little hole next to where my mom’s buried. I put two things in it. The key to the house we used to live in and a drawing of me that Benny did. It looks just like I did before everything went bad. I wanted to bury the me who used to live there, because that person was dead. It’s a different person who left town. 38 LILAH STEADIED HERSELF AGAINST THE TREE TRUNK AND EXAMINED HER wounds. There were plenty of minor cuts and scrapes, but the real problem was a deep gash in her side that ran from just above the belt line on her left side to the middle of her thigh. The gash was uneven, deepest where the boar’s tusk had struck her and going quickly shallow as it ran down her leg. Her gun belt had probably kept her from being impaled. The belt was gone, lying wherever it had landed, taking her gun with it. She still wore her vest, but all the pockets on the left had been ripped open, and the contents—including her first aid kit—were gone. She had to stop the bleeding, though. She patted her other pockets and found that she still had her folding knife, which had a sturdy three-inch blade. That was a relief. With a flick of her wrist she snapped the blade into place and used its razor edge to cut away both her trouser legs from mid-thigh down. The left side was useless, soaked with blood and smeared with some black goo that Lilah feared might have come from the boar’s mouth. With a small grunt of disgust, she tossed it away. A moment later she heard squeals and furious grunts as the boars fought over the blood-soaked piece of cloth.","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-20.html","bookId":2583,"book":{"id":2583,"title":"Flesh and Bone (Benny Imura #3)","description":"Storyline: Flesh and Bone (Benny Imura #3) Reeling from the tragic events of Dust \u0026 Decay, Benny Imura and his friends plunge deep into the zombie-infested wastelands of the great Rot \u0026 Ruin. Benny, Nix, Lilah and Chong journey through a fierce wilderness that was once America, searching for the jet they saw in the skies months ago. If that jet exists then humanity itself must have survived…somewhere. Finding it is their best hope for having a future and a life worth living. But the Ruin is far more dangerous than any of them can imagine. They are hunted by fierce animals escaped from zoos and circuses. They must raid zombie-infested towns for food and medical supplies. They discover the very real truth in the old saying: In the Rot \u0026 Ruin…everything wants to kill you. And what is happening to the zombies? Swarms of them are coming from the east, devouring everything in their paths. These zoms are different. Faster, smarter, infinitely more dangerous. Has the zombie plague mutated, or is there something far more sinister behind this new invasion of the living dead? In Flesh \u0026 Bone, Benny Imura, Nix Riley, Lou Chong and Lilah the Lost Girl are pitted against dangers greater than anything they\u0027ve ever faced. To survive, each of them must rise to become the warriors Tom trained them to be.","cover":"https://allnovel.net/images/flesh-and-bone-benny-imura-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/flesh-and-bone-benny-imura-3.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:08:44 PM"}}
