{"id":94659,"no":32,"title":"Page 32","content":"“You already know what it is,” he asked quietly, “don’t you?”\n Riot nodded.\n Chong closed his eyes for a moment. Instead of it being dark behind his eyelids, he saw twisted threads of bright red forking like lightning inside his personal darkness.\n Then he opened his eyes and took a tentative sniff. He smelled what she had smelled.\n “No,” he said, and his denial matched frequency with hers. This wasn’t something you just could refuse to accept.\n Riot said nothing.\n “Why . . . why would anyone do something like that?” demanded Chong.\n “Why do you think?”\n The answer was obvious, but it took all his courage to say it. “So . . . even if he just wounded someone . . . they’d . . . they’d . . .”\n Words failed him.\n Riot sighed and sat down on the floor, placing the arrows well away from Eve.\n However, the smell lingered in Chong’s nose. He knew exactly what it was, and why it smelled like cadaverine.\n The archer had dipped his arrows in the infected flesh of the living dead.\n And now that infection was burning its way through Chong’s flesh.\n 62\n “HONORED ONE!” CRIED SISTER AMY AS SHE DASHED OUT OF THE WOODS.\n The saint and Brother Peter turned and waited for her to catch up with them. Amy was badly winded, and she dropped to her knees before them, bending to kiss the red tassels on their legs.\n When she could speak without panting, Sister Amy told them about finding the ranger named Joe, and watching as he rescued a white-haired girl, tended to her wounds, and spoke with her. She told the saint everything and saved the choicest bit for last.\n Saint John listened, and when she was finished, his eyes blazed with inner light.\n “Nine towns,” he murmured. “In central California?”\n “No militia,” mused Brother Peter. “Living up there in the mountains, they probably think they have nothing to fear except wandering gray people.”\n “From what the girl said,” added Sister Amy, “they seem to believe that everything beyond their fence lines is wasteland.”\n “How naive,” said Saint John. “How arrogant.”\n He turned and looked toward the northwest as if he could see across all those miles.\n “Nine towns,” he said softly.\n 63\n “WE BETTER NOT STAY HERE LONG,” SAID BENNY. “LET’S TAKE A QUICK look through this stuff, then get the heck out of here before those reapers come back. And we have to find Lilah and Chong. They don’t know about all this crazy stuff.”\n Nix gave a noncommittal grunt as she set to work searching the cabinets and closets in the cockpit.\n A few seconds later Nix opened one cabinet and jumped back as papers, maps, and other items came tumbling out. A mouse squeaked and dropped to the floor before scurrying into a tiny opening in the control panel. Benny squatted down and began poking through the papers. Nix picked up the maps and began unfolding them.\n Benny saw a sheaf of papers on a clipboard hanging from a hook inside the cabinet. He pulled it down and began leafing through the pages in hopes of finding something that might provide answers to the mysteries that were stacking up all around them.\n What he found instead dried the spit in his mouth and made his heart begin pounding like the hooves of a galloping horse.\n “Nix!” he hissed. “My God . . . look at this.”\n “What is . . . ?” She trailed off as she began reading.\n What they read changed their world.\n McREADY, MONICA A., M.D. / FIELD NOTES\n Hope 1 / Maj. Sancho Ruiz commanding\n Date: December 2, 14 A.R.\n Observation: The specimens collected in the Pacific Northwest represent reanimates displaying both general and acute behavioral qualities. They have been categorized into the following subgroups:\n R1: Reanimates consistent with all known examples prior to 7/22/13. These are the standard “slow walkers.” All field-tested subjects scored in the expected range of 2.1 to 3.6 on the Seldon Scale.\n Specimens: 26 (coded yellow)\n R2: Moderately mobile reanimates (“fast walkers”) matching the behavior first recorded by Colonel G. Dietrich in Tulsa, Oklahoma, in July of last year. Tissue samples are in dry ice, bin #101. Limited field-testing tentatively places these subjects in the 4.4 to 5.1 range of the Seldon Scale.\n Specimens: 4 (coded blue)\n R3: Acutely mobile reanimates (“runners”). This is an entirely new classification; however, it verifies reports by independent witnesses dating 9/14/14 and later. Subjects display a marked increase in walking speed and the capability of coordinated running over short distances. Sensory acuity appears to be correspondingly increased. Limited field-testing and observation places this group generally in the 6.5 to 7.5 range on the Seldon Scale. If this is verified, then we are seeing the first incidents of reanimates exceeding the 5.3 ceiling.\n Specimens: 2 (coded green)\n Addendum: The two collected specimens are the only survivors of at least seven observed cases. Other specimens were destroyed during attempts to capture them. From (as yet) unverified observation, it appears that there may be as many as four distinct subgroups within the R3’s.\n R3/A: These reanimates appear to be capable of running over/around obstacles, including random objects, hallways, stairs, etc., as long as the obstacles are stationary. They did not, however, display competence in avoiding obstacles introduced into their paths. There appears to be some disconnect with perception and reaction time.\n R3/B: These reanimates were not only able to run over/around obstacles, but they demonstrated a marked ability to avoid additional obstacles introduced at varying speeds. NOTE: One such specimen avoided a rock thrown at its head and attempted to leap over a shopping cart shoved at it by one of the soldiers in our detail. It failed in its attempt, however, and was subsequently put down by the soldier.\n R3/C: One observed specimen presented the greatest number of radical behavioral changes. It was able to negotiate obstacles and avoid many of the objects thrown at it or tossed into its path; and it demonstrated a shocking tendency to use simple tools. At various times during a running fight, it used rocks and sticks as clubs and even threw (ineffectually) a stone at one of the soldiers.\n R3/D: It is this specimen that most disturbs me. In the absence of formal study, this reanimate appeared to be able to grasp certain concepts, particularly stealth and subterfuge. It appeared to hide behind an overturned car and wait until a soldier walked past, at which point it attacked the soldier, inflicting a serious bite. While other soldiers pursued it, the specimen twice hid, and twice changed its gait to imitate the slow walkers. As a result, two additional soldiers received bites. Though both wounds were superficial, the infection did take hold. In light of secondhand observation only and no formal investigation, I hesitate to rate this subspecies according to the Seldon Scale. However, Dr. Han and Maj. Dietrich both suggested that it would probably rate in the high 8’s. If they are correct, and if this is anything more than a regional fluke, this is a potential disaster.\n NOTE D.1: All three of the soldiers who were bitten expired within seventy-two hours.\n NOTE D.2: Two of the three soldiers reanimated.\n NOTE D.3: One of the reanimated soldiers (Lance Corporal Herschel Cohen) displayed all the behavior patterns of the classic slow walker.\n NOTE D.4: One of the reanimated soldiers (Private Zachery Bloom) displayed characteristics typical of the R2’s.\n NOTE D.5: Staff Sergeant Linda Czerkowski did not reanimate, even though she was observed continuously for forty-eight hours. Samples of her blood, tissue, and brain matter were collected and are in dry ice, bin #119.\n Conclusions:\n I think we can put to rest the debate as to whether the Reaper pathogen has mutated.\n We have been able to isolate fairly pure examples of the parasite, and we can begin studying them once we get back to Sanctuary.\n The sequencer at Hope 1 is on the fritz again, so we have been unable to sequence the DNA, either of the parasite or these new mutations; however, it seems clear that Reaper is continuing to mutate. There is no way at this point to know how many new strains of the disease are active within the reanimate population.\n I would like to again strongly urge the lifting of the communication ban. Without open discussions with colonies of survivors, we will never be able to amass a reliable body of information. We simply do not know enough, and it is imperative that we establish the location and spread of new Reaper strains.\n I am gravely concerned about the R3 variations. Does this mutation occur only in new reanimates? If not, is there a possibility it could spread to the existing population of R1’s? It’s doubtful we could survive a catastrophe of that magnitude.\n I believe we should put five to ten more field teams in play before the end of January. The sooner we can verify this information and collect data, the better.\n Postscript: There are reports, as yet unverified by our teams, of reanimates moving in clusters. This seems improbable, but in light of other radical changes I believe it would be prudent to investigate this. Perhaps Captain Ledger and his rangers would be best suited for this.\n There was more of it, but what they had just read was almost too much to grasp.\n “Captain Ledger?” echoed Benny. “Hey, I know him . . . I mean, I have a Zombie Card with him on it.”\n Nix said nothing. Her eyes were closed and she swayed for a moment, and then suddenly her knees buckled and she sagged to the floor. Benny caught her under the arm and steadied her.\n “Whoa! Nix, what’s wrong?”\n She shook her head. Tears rolled down her cheeks. “It’s all real,” she murmured. “The jet . . . other people. The world isn’t . . . isn’t . . . ”\n She threw her arms around Benny’s neck, buried her face against his chest, and began to cry.\n Dumbfounded and confused, Benny wrapped his arms around her as she wept.\n All the time Nix kept saying, “It’s real . . . it’s real.”\n 64\n SAINT JOHN AND BROTHER PETER SQUATTED IN THE DIRT ON EITHER SIDE of a burly man with a bushy brown beard and the iron-hard muscles of the steelworker he had been in his youth.\n Now that man lay screaming, and with each scream he yielded up more and more of his power to the saint and the high priest of the Night Church. Red mouths had been opened by the score in his trembling flesh. Every bit of bravado and contempt and resistance had flowed out of him.\n This man, Brother Eric, was one of Mother Rose’s most trusted team leaders. A deacon of great power among the reapers. Close friend to Brother Simon and Brother Alexi. A confidant of Her Holiness.\n And sadly for him, he was intimately aware of what Mother Rose was planning.\n Where once he had thought himself too committed to her and too powerful in himself to be forced to betray even the most casual secret, now he could not scream enough of the truth.\n Saint John rose and turned away from the screaming man.\n “He has told us everything of use,” he said quietly. “He has paid for his sins and now the darkness wants him. Send him on.”\n Brother Peter looked down at the blade in his hand and stifled a disappointed sigh. He would never question an order from the saint, however. With a deft flick of his wrist, the screaming stopped.\n “Praise be to the darkness,” he murmured as he wiped his knife clean with a handful of grass. He rose and stood with the saint. “I am sorry for your pain.”\n Saint John shook his head.\n “I knew about this betrayal long ago. I have already shed my tears.”\n Even so, Brother Peter could see the glisten in the saint’s eyes. It filled him with a red rage that howled in his head. That anyone would bring harm to this beloved servant of their god was unbearable. There was nothing he would not do to remove that hurt from this holy man.\n However, he was also filled with doubts.\n “Honored One,” he began, “the infection within the Night Church runs so deep.”\n “Yes. To its very heart.”\n “How can it be purged?”\n Saint John looked at the bloody knife in his own hand. He watched a drop of red fall and splatter on a green leaf.\n “Mother Rose believes that her victory lies beyond the walls of Sanctuary.” He gestured as if shooing away a fly. “Let her have it.”\n “But—”\n “Let her take her ‘chosen ones,’ Peter. Let her carve the infection out of our army. Whoever is left . . . well, we know we can trust them.”\n “We won’t help her attack Sanctuary?”\n “No.”\n “Honored One . . . we’ve spent so much time preparing for this, searching for this place. Our people fear it as a citadel of evil. We can’t just walk away.”\n Saint John said, “That is exactly what we will do. We will leave this place of evil to Mother Rose.”\n “But—”\n The saint turned and looked toward the northwest. “I feel that we are called elsewhere, Peter. I feel that call with all my heart and soul.”\n “California? Those nine towns?”\n “Those nine towns.”\n “May I ask why?”\n “Mother Rose will attack Sanctuary. The ranger, Joe, may warn Sanctuary before she does so. We will watch what happens. If Mother Rose takes it, then we will come back and take it from her. She is not as wise a general as she believes.”\n “And if Sanctuary defeats her?”\n “You can learn much about an enemy when you watch him win. We will watch and learn . . . and plan. Either way, Sanctuary will wait for us.”\n 65\n “SO . . . THAT’S IT?” ASKED CHONG IN A HOLLOW VOICE. “I JUST DIE? I become a zom?”\n His eyes burned with tears, but the rest of him felt cold. \n","sourceLink":"https://allnovel.net/flesh-and-bone-benny-imura-3/page-32.html","bookId":2583,"book":{"id":2583,"title":"Flesh and Bone (Benny Imura #3)","description":"Storyline: \n Flesh and Bone (Benny Imura #3) \n Reeling from the tragic events of Dust \u0026 Decay, Benny Imura and his friends plunge deep into the zombie-infested wastelands of the great Rot \u0026 Ruin. Benny, Nix, Lilah and Chong journey through a fierce wilderness that was once America, searching for the jet they saw in the skies months ago. If that jet exists then humanity itself must have survived…somewhere. Finding it is their best hope for having a future and a life worth living. \n But the Ruin is far more dangerous than any of them can imagine. They are hunted by fierce animals escaped from zoos and circuses. They must raid zombie-infested towns for food and medical supplies. They discover the very real truth in the old saying: In the Rot \u0026 Ruin…everything wants to kill you. \n And what is happening to the zombies? Swarms of them are coming from the east, devouring everything in their paths. These zoms are different. Faster, smarter, infinitely more dangerous. Has the zombie plague mutated, or is there something far more sinister behind this new invasion of the living dead? \n In Flesh \u0026 Bone, Benny Imura, Nix Riley, Lou Chong and Lilah the Lost Girl are pitted against dangers greater than anything they\u0027ve ever faced. To survive, each of them must rise to become the warriors Tom trained them to be.\n \n","cover":"https://allnovel.net/images/flesh-and-bone-benny-imura-3.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/flesh-and-bone-benny-imura-3.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:08:44 PM"}}
