{"id":84354,"no":30,"title":"Page 30","content":"She reaches behind her, pressing her tits forward, releasing the zipper on her dress. Unhurriedly, she peels it off her body. Revealing a sheer, black, strapless bra trimmed in bright blue with a matching thong. Her br**sts are firm and high and completely visible through the shadowy fabric—including my favorite plaything, Dee’s sparkling diamond nipple piercing. Her dress lays forgotten on the floor as she gyrates and turns. I lick my suddenly dry lips, refocus the lens of the camera, and shoot. Click, click. Delores’s hands slide down her thighs then skim up her stomach, cupping her br**sts the way I want to. My fingers twitch and I grip the camera tighter. Click, click. My voice is rough as I say, “Come here, Dee.” And miraculously, she actually does. The moment she steps close enough, I pull her down on top of me, one hand fisting in her hair, the other kneading her smooth, tight ass. She moans against my lips. Then her hands fumble with my belt, pushing my pants and boxers down in one fell swoop. Taking her—and the camera—with me, I slide from the couch to my knees, then down onto the floor. The fabric of Dee’s lingerie feels whisper soft against my straining cock—but not as soft as her skin. I lay her down flat, then I rear back. Keeping eye contact, I slide her almost nonexistent panties off first. When I tug at the peek-a-boo bustier, it rips up both sides, but I don’t let that stop me. “I’ll buy you a new one,” I promise gruffly. Dee gives the slightest nod. When she’s beautifully bare, ready and writhing, I pick the camera back up. Click, click, click, click. I set the camera down, close by, and cover Dee’s body with my own—giving all my attention to her amazing br**sts. I squeeze with one hand while I worship the other with my mouth. I lick around her nipple, then I encase it with my lips—scraping with my teeth, flicking with my tongue, suckling hard until Dee cries out in that stunning symphony of elation and pain. Then I start all over again with its exquisite twin. “Do you like my tits, Matthew?” Dee moans. I rub the pink peak with my firm tongue, then answer, “I love them. They’re perfect. I could do this all f**king night.” “You like licking them?” She whimpers. “Yes.” “Pinching them?” She sighs. “Yes.” “Sucking on them?” “Shit, yes.” “Do you want to f**k them, Matthew?” White-hot need goes straight to my cock—making me moan. Because giving her br**sts a thorough f**king is a fantasy I’ve courted since the second I laid eyes on them. “Yes,” I practically beg. “God, yes, I f**king want that.” She smiles, tantalizingly. A perfect seductress—the face and body of an angel with a devil’s desire. All willing and wanting. “Me too.” Delores glides down beneath me, trailing kisses as she goes, pausing when her face is directly under my raging erection. As I hover over her, she takes me into the superb wetness of her mouth, all the way—until I feel the tightness of her throat. She eases back, leaving a heavy coating of moisture behind when she removes her mouth. I rise up onto my knees. Dee lies between them, her br**sts overflowing in her own hands, perfectly aligned with my c**k above them. Gently, I sit back, bracing most of my weight on my calves. She presses her br**sts together, encasing my rigid dick between their perfect, slick softness. I savor the sensation. My eyes squeeze shut. “Fuck me.” There’s a smile in her voice as she tells me, “That’s my line.” I want to move—I want to pound against her in a frenzied rush until I find that paradise that I know is just waiting to be reached. But I hold back—and force myself to go easy. To let her take the lead. I open my eyes and meet Dee’s fiery gaze. She pushes her tits up and down—jerking me off with them—again and again. The feeling—Jesus Christ—it’s more incredible than I ever conceived. Dee’s hands still, just maintaining the snug fit, while I drive my hips forward and back—slowly—drawing out the indulgence. Then I hunch over and speed up—my breaths come faster, my heart tries to break out of my chest. Dee pants beneath me. “Use the camera, Matthew. I want to see the pictures. After.” I hiss and I groan. Then I do what she demands. I grab the camera from the floor. And take the pictures. Click, click. But it’s not the view of my c**k sliding between her luscious tits that I capture—that image is already seared into my brain until the end of time. Click, click. It’s her lips—open in pleasure. Click. Her wet, seeking tongue. Click. Her amber eyes blazing with intensity . . . and trust. Click, click, click. Those are the images I immortalize. The ones I need to hold on to. Because outside of this moment—beyond our searing attraction and erotic endeavors—Delores doesn’t trust me. Not fully. Not yet. She wants to. She hopes I’m worthy. But doubt still lingers, protecting her heart—preventing her from putting her faith in me completely. And it’s okay. I don’t know what scars she carries. I don’t know the experiences that taught her to be so guarded. I’ll wait until she’s ready to show me. I’ll work at convincing her, that I’m one of the chosen few she can give her trust to. Because Delores is worth waiting and working for. But here—now—Dee’s body already believes what her mind is still wary of. That I’ll never hurt her. That I want her—desire her—more than any other woman before her. That I’ll cherish every part of her—her body, her mind . . . her heart—for as long as she’ll let me. The song’s drumbeat pounds. And the singer’s words resonate. This is my kingdom come. This is my kingdom come. My c**k slides smoothly between her br**sts in a sensational, steady rhythm. Then Dee lifts her head. She leans forward and wraps her lips around me, pulling as much of me into her mouth as she can reach—sucking hard. And it feels so fantastic, I swear I could frigging cry. Pure undiluted ecstasy rips through me. I moan her name as I come hard and deep—from the marrow of my f**king bones. After Dee swallows every drop, she releases me from her mouth. Then she smiles mischievously. “That’s what I was thirsty for.” I keel over to the side, my legs no longer able to hold me up. And I try like hell to catch my breath.","sourceLink":"https://allnovel.net/tamed-tangled-3/page-30.html","bookId":1811,"book":{"id":1811,"title":"Tamed (Tangled #3)","description":"Storyline: Stop me if you’ve heard this one before: girl meets player, they fall in love, player changes his ways. It’s a good story. But it’s not our story. Ours is a lot more colorful. When I met Dee I knew right away that she was special. When she met me, she thought I was anything but special--I was exactly like every other guy who’d screwed her over and let her down. It took some time to convince her otherwise, but turns out I can make a convincing argument when sex is at stake. You might know where this story’s headed. But the best part isn\u0027t where we ended up. It’s how we got there. Tamed goes back in time to the Tangled days. But this time around, it’s not Drew dishing out the advice and opinions – it’s his best friend Matthew, who of course is dealing with Dee Dee.","cover":"https://allnovel.net/images/tamed-tangled-3.jpg","author":"Emma Chase","type":"Humorous","source":"allnovel","link":"https://allnovel.net/tamed-tangled-3.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 4:57:40 PM"}}
