{"id":43625,"no":17,"title":"CHAPTER XVII","content":"In the weeks which followed the settling of the trouble in the camp, Kay flourished and grew. Great trainloads of supplies were daily dumped on the platform of the railway station, to be checked off and sorted, before the final haul up to camp. The old rough road to the station had become hard and smooth by the continual pounding of the heavy, six-mule wagons. Under McKay’s master direction, the framework bridges on the route had been replaced by substantial structures. Wherever a ca?on or gulch opened, sluice boxes had been buried beneath the road surface, so that a heavy rain no longer meant washouts and consequent stoppage of coke and supplies. The coke teams struggled back to the railroad almost as heavily laden with matt, as on the upward trip they had been with coke. Each day saw new framework houses built, and new families settling their possessions. Wagons were driven into camp laden with battered stoves, broken chairs, a stray dog or[275] two, and in general the household belongings of new settlers; for the growth of the “lilies of the field” is as nothing compared with that of a prosperous mining camp. Each day the office was filled with men clamoring for lumber: “Only a little, Boss! Just to put in a flooring. We can get along with two boards on the sides. Anything just so as we can get settled.” And Loring sat behind his desk, speaking with kindly but evasive words, telling each that the Company longed to build him a perfect palace, but that under the present conditions he must wait. For fast as lumber was hauled into camp, still faster came the need for it for mine timbering, for storehouses, and for a thousand and one necessities. The construction work had been rushed to completion. The huge new ore cribs were a triumph of McKay’s ingenuity, built by a clever system of bracing from the unseasoned lumber that had been at hand, and supporting with perfect safety the enormous strain to which they were subjected. The Company was rapidly becoming the controlling factor in the copper output of the district. It was the time for the arrival of the evening[276] mail and the office was full of men and tobacco smoke. McKay had pre-empted the safe and sat on the top of it, clanking his heels against the sides. His sandy colored hair matched the color of the pine boards of the wall against which he was propped. The draughting tables carried their load of men, as did each of the well-worn chairs, and the three-legged stool. A babel of voices prevailed. Every now and then Reade opened the door from the back office, and poking his head into the room with a disgusted expression upon his face, called out: “Soft pedal there, soft pedal! How in hell can a man do any work with you fellows raising such a racket?” Stephen, as usual sat at his roll-top desk in the corner, his feet up on the slide, both hands in his pockets, the while he rocked his pipe gently up and down in his teeth. One of the clerks was telling with becoming modesty of his social triumphs in Ph?nix at the “Elks” ball. The audience listened with the listless attention of those whose curiosity hangs heavy on their hands. “I was the candy kid, all right,” remarked the narrator. [277] His fervid discourse was interrupted by a drawl from some one in the background. “I reckon that some time you must have drunk copiouslike of the Hassayampeh River.” A machinery drummer who was in the office cocked up his ears, thinking that perhaps behind the allusion lay a doubtful story. “What’s that about the river?” he asked. “I never heard of that.” “Why, they say,” answered the first speaker, “that whoever drinks of the Hassayampeh River can’t ever tell the truth again so long as he lives.” “And also,” added McKay; “that no matter where he drifts to, he is sure to wander back again to the old territory; that he’ll die in Arizona.” “How was that story ever started?” Loring asked. “The valley of the Hassayampeh was one of the first trails into the ore country,” answered McKay, “and the lies that emanated from the camps along that river was of such a fearful, godless and prize package variety that they made the old river famous. There was a fellow in camp here only the other day was telling me[278] about prospectin’ down there in seventy-three. He said all they had to eat was fried Gila monster. I guess that was after he’d drunk the water though,” finished McKay reflectively. “The territory sure has gone off since those days,” said a cattleman who had ridden into camp for his mail. “Only last year down near Roosevelt I shot two Mexicans, and say, it cost me a hundred dollars for negligence,” he went on indignantly, “and the sons of guns warn’t wurth more than twelve dollars and two bits apiece.” “You are right about the way Arizona is going to hell,” said the mine foreman. “I don’t know as any of you fellows ever knowed ‘Teeth’ Barker. Anyhow, next to what his father must have been, he was the ugliest creature that ever lived on this earth. All of his teeth just naturally stuck out like the cowcatcher of an engine. Well, in spite of that, he always was a good friend of mine. Least he used to be. “About six months ago I was up to Jerome, and they was telling about an accident there. A man no one knowed at all was killed, but a fellow said he had the ugliest tusks he ever seed. I knew at once that must be[279] Barker. They said they’d planted him up on the knoll, and so,” continued the foreman sadly, “and so, although it was a powerful hot day, I struggled up to the knoll with a nice piece of pine board, and a jack-knife, and I sort of located ‘Teeth’ with a handsome monument and an exaggerated epitaph. “I came down as hot as the devil, and steps into a saloon to get a drink, when who should walk up to me but ‘Teeth’ Barker himself! “‘You’re dead,’ said I. “‘Do I look like it?’ he asked. He got sort of hot under the collar about it, too. “Well, the long and short of it all was that I had gone and taken all that trouble with a tombstone for a stranger. “‘The least that you can do, “Teeth” Barker,’ said I, ‘is to come up and see that beautiful monument I erected over you. It took as much trouble to make as a year’s assessment work.’ “Well, he didn’t see it that way. Said he wouldn’t go up there if I was to pay him. And that was after I had taken all that trouble! Gratitude! There ain’t no such thing any more in Arizona,” concluded the foreman. Story after story was put forth for the edification[280] of the crowd until the grating of wheels outside told of the arrival of the stage. A moment later heavy footsteps resounded on the porch, and the burly stage-driver, with two great mail-sacks slung over his shoulder, swung into the office. “Evening, gents!” he called in answer to the general salutation. He stepped over to Stephen’s desk and threw down a little bunch of envelopes. “Four telegrams,” he said. Loring rapidly slit open the envelopes, laying the telegrams on one side, and after running through the contents, began to sort the mail. “Any passengers?” he asked the driver. “Yes, six. Drummers mostly. They are over there eating now. There was two men and a lady; but they stopped to eat supper at the station. They will be up later.” “It’s lucky Mrs. Brown built those new sleeping quarters to her place; she’ll be running a regular hotel here soon,” said the driver, as he swung on his heel and tramped out to unharness his horses. Stephen sorted the mail rapidly, and deftly scaled the letters to the fortunate recipients. “That is all,” he said, as he tossed the last.[281] Every one left the office with the exception of McKay who, with a woebegone expression on his face, lingered behind. “What is the matter?” asked Loring. “Nothing,” answered McKay gruffly. “Well, how is this?” said Stephen, taking from his pocket a letter which was addressed in large square characters to McKay. “You see she did not forget you, after all.” McKay blushed to the roots of his hair, then opened the letter with seeming nonchalance. “It seems to me that you have a pretty steady correspondent there,” said Stephen, while he straightened up his desk preparatory to the evening’s work. “I have handed you a letter like that every night this week.” McKay colored even more, then stretched out his hand. “Shake, Steve! I am going to get spliced. I have been meaning to tell you before this.” Loring jumped up and pounded him on the back. “You gay winner of hearts, who is she?” “Do you remember Jane Stevens, back at Quentin? Well, it’s her.” Loring’s eyes twinkled. “How did you ever get the nerve?” he asked. [282] At the thought of his audacity, the perspiration broke out on McKay’s forehead. “Well she had me plumb locoed. I remember once a horse had me buffaloed the same way,” he explained. “I was scared, scared blue, Steve; but finally I got up my nerve and thought I’d go and break my affections to her gentle and polite like. So one day I rode over to their place,—you know where it is was, just south of the Dominion trail,—and I thought I’d go to see her brother Charlie and fix it up with him. When I reached their shack she came to the door looking as neat as a partridge and with a sort of smile hidden somewhere in her face, and—and I’ll be damned if I didn’t kiss her right then without any formalities.” “That was the simplest solution of the problem, wasn’t it?” laughed Stephen. “When are you going to be married?” “Oh, soon, I guess; but I wish it could be managed as simply as these Mexicans do. And how about you, Steve?” continued McKay. “You ain’t been took this way yourself, have you? Not that woman you was telling me about in Mexico.” [283] Loring shook his head. “Unfortunately she was a married woman.” “I sort of thought,” went on McKay, “that you and Miss Cameron was—” “Well, you thought wrongly,” interrupted Loring sharply. “I never expect to see Miss Cameron again.” There came a ripple of laughter from the doorway, and looking up quickly he saw Jean and her father walk into the office. Behind them stood Baird Radlett. “What a hospitable form of welcome!” exclaimed Miss Cameron, smiling at him frankly. For a moment Loring swayed in his chair, then he rose stiffly, as a man in a trance. He stared at Jean with an absorption that was almost rude, as if there were nothing in the universe beyond her. There lay a hint of laughter in the gray depths of her eyes. “What is the matter?” asked Radlett. “Are you surprised to see us? Didn’t you get my letter?” “It is probably in to-night’s mail which haven’t opened yet,” answered Loring, still half dazed. “Mr. Cameron has consented to come and[284] make a report on the property for me,” explained Baird. Mr. Cameron came forward and held out his hand. “Mr. Loring, I have heard of the splendid work that you have done here. I want to congratulate you.” This little speech was a hard one for Mr. Cameron to make; but he was a man who, when he had once made up his mind to the right course, followed it to the end. The expression of pride in Stephen’s face turned to one of appreciation, and he shook Mr. Cameron’s hand with a firm, grateful pressure. But all the while he was looking at Jean longingly, worshipingly, all unconscious of the intensity of his gaze, as a man who for days has been in the desert without water looks upon the sudden spring. In all the months that he had thought of her, dreamed of her, she had never seemed to have the beauty, the potential tenderness, which marked her now when she stood before him, her look telling him that she was proud of what her friend had been and done. To Radlett, looking at them both, came a sudden suspicion, and a sudden despair. [285] Jean, at Loring’s request, seated herself at his desk, in the big revolving chair, and while playing absent-mindedly with the papers on the desk, kept up a laughing discussion with Baird. Loring, at the other side of the room, was answering Mr. Cameron’s businesslike questions as to the grade of the ore, the force, the cost of production, accurately and fast, as though almost every faculty in his body and mind were not concentrated upon the girl who seemed to be having such an interesting talk with Radlett. Finishing his talk with Mr. Cameron, Loring left the office to arrange for sleeping quarters for the visitors. In a few minutes he returned with the announcement that all was ready, and led the way to the long, low building next the mess, whose many rooms, opening on a broad porch, served as accommodations for strangers in camp. Loring walked beside Miss Cameron, doing his best to talk unconcernedly of every-day matters, but the hoarseness of his voice betrayed him. “I am very sorry to have to offer you such rough quarters,” he said to Jean, as they[286] reached the house, “but they are the best that we have. In another month we hope to have something more comfortable to give to our guests.” “In another month, Stephen, you will have an up-to-date city constructed here,” exclaimed Radlett, with an almost reluctant enthusiasm. At the steps Stephen and Radlett said good-night to the others, and walked slowly back to Stephen’s quarters, which they were to share. Loring sat on the edge of his cot, and smoked slowly while he watched Baird unpack his valise, and with the method of an orderly nature put everything away in the rough chest of drawers, or on the black iron hooks which protruded from the wall. Espying a tin of expensive tobacco neatly packed amidst a circle of collars, Stephen pounced upon it, and knocking out the contents of his pipe, proceeded to fill it with the new mixture. Radlett finished his unpacking, and recovering the tobacco can from Loring, filled his own pipe. Then he tipped a chair back against the wall, and sitting in it, regarded Loring for a moment in silence. “Stephen,” he remarked after a few seconds,[287] “you have done a good piece of work. I knew that you would.” Loring’s irrelevant answer was to the effect that the tobacco which he had stolen was good. It was an odd characteristic of this man that though his nature contained many streaks of vanity, praise for work which he knew was good embarrassed him. At length he began to appreciate the ungraciousness of his response to Radlett’s advances, and leaning forward, with his elbows on his knees, he said: “You cannot guess what it means to me, Baird, to have you say things like that, to be patted on the back and made to feel as if I had done something, and that by a man who has succeeded in everything to which he has turned his hand, who has won all the big prizes of life.” Radlett drew back into the shadow where the lamplight could not reveal the expression of his face. “All the prizes in life?” he queried with scornful emphasis. “No, not all by a damn sight. You see, Stephen, I feel as if Fate had stood over me with a deuced ironical smile, and said: ‘You shall have your every wish in life—except the one thing that you want[288] most of all—the one thing that would make you happy.’” “Hm,” murmured Loring, shaking out the embers from his pipe and gazing into the empty bowl. “With any one else I should say that meant a woman; but with you it could not be.” “Why not with me as well as with any other man?” “Because there is no woman alive who would be fool enough to refuse you.” “Bless your heart, Stephen! It is only your blind loyalty that makes you think me irresistible.” “Do you mean that there really is a woman so benighted? What is she thinking of?” “I imagine,” answered Radlett slowly, “that you might change that ‘what’ to whom.” “You would have me believe that knowing you, she prefers some one else?” asked Loring incredulously. “Why, Baird, it is impossible.” “By no means. I think I know the man.” Loring’s blood boiled. “Who is the brute?” he cried out. “Tell me and I will kill him, break his neck, shoot him.” Baird smiled wryly, blew a cloud of smoke[289] toward the roof, and observed: “If I were you, Stephen, I would do nothing rash. But come, we have talked long enough of me and my affairs. Let us talk now about you and yours! Suppose, for instance, you tell me why you turned the color of a meerschaum pipe when Miss Cameron appeared in the doorway to-night.” Loring started and looked quickly at Radlett. “You noticed that, did you? Well, you have quick eye and a gift for drawing conclusions, but they may not always be right.” “Not always, no; but this time they are, aren’t they? Be honest, Stephen, are you or are you not in love with Jean Cameron?” “Excuse me, but that can not interest you to know.” “Perhaps not, and perhaps it is a damned impertinence to inquire, but after all an old friendship gives some privileges.” “Of course it does!” exclaimed Stephen, tilting down his chair. He walked across the room to Radlett’s seat and stood behind him. “See here, Baird. I did not want to speak of this thing because I was afraid of breaking down and making an ass of myself generally.[290] You don’t know what it is to be placed as I am. When you asked a girl to marry you, you had something to offer her, whether she had the sense to take it or not. You offered her a clean life, a fortune honorably made, an untarnished name, while I,—why even if there were the remotest chance that Miss Cameron would look at me, I should be a brute to ask her. The more I cared for her, the less I could do it. So you see, for me it must be ‘the desire of the moth for the star.’ A man must abide by the consequences of his acts; he must take his medicine, and if mine is bitter, it may do me all the more good only—only I cannot talk about it. Good night!” Radlett did not answer; but long after Stephen was asleep, or pretended to be, Baird lay staring at the rafters. “To lay down his life for his friend,” he said to himself. “That would not be the hardest thing. To lay down his love! I wonder if I am man enough to do it.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3336/91286.html","bookId":355,"book":{"id":355,"title":"The Up Grade","description":"简介： Stephen Loring sat on the edge of the sidewalk, his feet in the gutter. He was staring vacantly at the other side of the street, completely oblivious of his surroundings. No one would select a Ph?nix sidewalk as an attractive resting-place, unle...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3336","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
