{"id":43610,"no":2,"title":"CHAPTER II","content":"At half-past six the next morning the whistle in the upper camp blew long and clear. It is a strange fact that the dispassionate whistle in the morning is the brutal enemy of labor, calling its victims to the struggle; but that at noon it is impartial and cheerful. It then attempts the r?le of referee in the great game between labor and capital and, like a good umpire, favors neither. Yet the same whistle at night, when it calls the game off, becomes the warm ally of the workman, encouraging him openly with promise of rest and supper. It is then as if it said to him: “I was compelled to be impartial. That is my duty; but frankly, now that it is over, I am glad that you have won.” Loring opened his eyes as he heard the morning whistle, and, at first a little dazed, looked about him. Then he rose and stretched himself. Every bone in his body ached as the result of the night on the hard ground. All around him[22] men were yawning sleepily as they crawled out of their blankets. Close beside the camp ran the tawny Gila river. Stephen walked down to the bank, and kneeling on a small rock which lay half afloat in the ooze mud, endeavored to wash. Then, refreshed, if not much cleaner, he made his way to the cook tent. Here under a fly stretched on poles were four long tables, heaped with tin plates and condensed milk cans. The monotony of the table furnishings was broken by a few dingy cans, decorated with labels of very red tomatoes, which served as sugar and salt holders. The old inhabitants of the camp were noisily greeting the newcomers, pounding on their cups and whistling whenever they perceived some old acquaintance. The labor of the Southwest is of a very vagrant quality. A man merely works until he has money enough to move. Each time that he moves he spends all his money on a celebration, so that his wanderings, though frequent, are not long in duration. Thus many of these men had met before, around the smelters in Globe, in the Tucson district, or north in the Yavapai. Loring found a place on one of the rickety benches, and looked toward the coffee-bucket.[23] Sullivan, who was opposite to him, growled gloomily: “Say, the grub is rank. This coffee is festered water.” The description, though not an appetizing one with which to begin a meal, was not without truth. In varying degree it might have been applied to the rest of the breakfast, from the red, tasteless frijollas to the stew, which consisted of a few shreds of over-cooked meat, in the midst of a nondescript mass of questionable grease. As Loring had finished eating what he could of the meal, and was contemplating borrowing some tobacco, the foremen, who, as etiquette demands, had eaten their breakfast in a group apart from the men, began to look at their watches, and to stir about actively. “Hurry up now, boys! Out on the grade—quick! Vamos! Only five minutes more now!” they called. The tools of the old workmen were scattered along the grade, where each had dropped them at the end of the previous day’s work. The newcomers were marched single file, through the tool-house, where each picked out his implements, then started off to the place assigned him. Loring, not from altruism, but because[24] he did not know the difference which well chosen tools make in a long day’s toil, made no effort to grab. In consequence he emerged from the shed supplied with a split shovel, and a dull, loose-headed pick. A foreman beckoned him to a place on the grade, opposite to the cook tent. He immediately started to swing his pick. “Don’t be in such a hell of a hurry!” called Sullivan, “you’ll have plenty to do later.” The seven o’clock whistle blew sharply. “Lope her, boys!” sang out the section foreman. All talking stopped abruptly, and the click of picks, swung with steady blows, and the rasp of shovels echoed all along the grade. Loring, new to “mucking,” swung his pick with all the strength of his back, bringing it down, with rigid full arm strokes, upon the rocky soil. The foreman noticed this with amusement. “He’ll bust in an hour,” he thought; but he only said: “Loosen your grip a bit or you’ll get stone-bruises.” Then he passed on up the line, to tell a Mexican, who had already stopped to light a cigarette, that “this ain’t no rest cure.” Hop Wah from the depths of the cook tent perceived Loring’s energetic labors, and called[25] out to him: “Hey, me bludder, no swing like that! No damnee use. Just let him pick fall!” Stephen nodded gratefully, and complied with the practical advice. He worked steadily, only pausing to exchange his pick for a shovel, whenever he had broken enough earth, or loosened some large stone. “Surely,” he thought, “I can keep this up for ten hours. Here, at last, is a job that I can do.” Stephen Loring had never in his life “made good.” He had started well on many ventures, and then given out. His friends had at first been intensely admiring, and had predicted great things for him; but gradually they had given him up as hopeless. They would have lent him money cheerfully; but a determination not to borrow was one of his few virtues. In consequence, having fallen stage by stage, he was now reduced to being a day laborer, a “mucker,” watched by a foreman to see that he did not shirk. If the same method had been applied to him earlier, it might have been his salvation. As it was, he had sunk beneath the current. The next hour seemed to Loring twice as long as the first. His wrist pulsed with agony[26] from the jar of the blows. He was compelled to wrap his handkerchief around his right hand, as he had worn great blisters sliding it up and down the pick handle. The sweat, as it rolled down from his forehead, made his cheeks smart. Every few minutes he was forced to rest. At ten o’clock the time-keeper came to him, and, drawing a shabby brown book from his pocket, entered Stephen’s name on the rolls. Then he drew from his pocket and handed to Loring a brass tag, like a baggage check. “Your number is four fifty-three; keep this now!” Stephen looked at the tag for a second, then slipped it into his pocket. It did not jangle against anything. He leaned on his pick handle for a moment, and with mild interest listened to the time-keeper, as he accosted the Mexican who was working next to him. “Eh, hombre! What’s your name? Cómo se llama?” The foreman spoke sharply to Stephen, and with the blood rising slightly to his temples at the rebuke, he fell to work again. Loring possessed a strong imagination and he had solaced many a hardship by either planning[27] for pleasanter occupations in the future, or vividly reconstructing worse ones in the past. But imagination is a dangerous plaything. The men working on either side of him thought of nothing, except perhaps some solution of the great problem of the human race, how to make the greatest possible show of work with the least effort. Stephen, however, was accompanied in his work by imagination. To-day it was of a sort which was neither subtle nor pleasant. It began by saying to him: “You are healthy. You will probably live for thirty years or more. They will be pleasant years, won’t they? There are three hundred and sixty-five days in a year, so if you work ten hours a day for thirty years, perhaps you may grow used to work. Work is a great companion, is it not, Stephen? It is unfortunate,” finished imagination glibly, “that you must do this forever.” Loring spoke aloud in answer to his imagination, timing his syllables to the already shortened strokes of his pick. “Not forever?” “Well,” rejoined imagination, “I see no alternative, do you? And what is more,” added the Devil who at this moment was operating imagination, “You are not even building the[28] railroad. All you are doing is moving rocks. Any one can move rocks.” By noon time Stephen was limp and exhausted. The hour’s respite seemed to him to go by like a flash, and he started upon the afternoon’s work in a hopeless frame of mind, his muscles stiffened instead of rested by the short relaxation. After an hour’s labor, he moved to a place where the ground was soft, and for a while his delight in this supported him. It is little things such as this which make the epochs in a day of manual labor. As he toiled on grimly, in a few short hours, he had reversed his views on Socialism. “Of course the laborer is the chief factor in production,” he murmured wearily to himself, as he grew more and more dizzy. At three o’clock, McKay, with a surveying party, reached the section of the grade where Loring was working. Stephen watched him, as he stooped over the level and waved his hand up and down. He heard him shout “O. K. back sight! Ready fore sight!” Then “O. K. fore sight! ’Sta ’ueno!” and somehow the cheery tones braced Loring for his work. [29] McKay, as he came up, nodded cheerfully: “I left that hat for you in the cook tent,” he said; “it will make you look like a real man!” Then noticing the agonized swings of the pick, he looked at Loring quizzically. “Say, I reckon you ain’t done this sort of thing for some time, have you? I guess a short spell at flagging wouldn’t discourage you. Go up to the tool-house, and get a white flag that you’ll find there. Then go up to that point back there, where the wagon road crosses the grade. I’ll put another flagman on the point below, and when he waves, you stop anything that comes along. In a few minutes we are going to “shoot” all along here, and I don’t want to blow up any teams or people that are going up to the copper camp.” Loring dropped his pick with alacrity, and started for the tool-shed. As he walked back along the grade, he looked with curious interest at the men who were still working. Somehow their labors seemed a part of himself. His back ached sympathetically as they stooped to their work. At the shed he found the dirty white rag and stick which served for flagging.[30] Then he hurried to his place. He passed Sullivan, who waved joyously to him. “The boss has set me flagging, too. Gee, what a graft! Me for a nap, as soon as they start to shoot. There won’t any teams go by, when they hear the shots, and I can get a good sleep.” “You had better not,” answered Loring. Then, feeling that it was none of his business, he went on to the place which McKay had assigned to him. He seated himself on a large rock, from which he could see far in all directions. He was at the end of the grade nearest to the copper camp, and he could see the great iron chimneys of the smelter, protruding above the hills to the north, belching forth black smoke against the brilliant blue of the sky. “The whole country looks as if it had been made with a hack-saw,” he mused, as he looked at the jagged rocks and irregular mountains about him. “I would give a great deal to see something green besides this accursed cactus; but I suppose that grass and civilization go together.” Then, watching for a signal, he fixed his eyes on the point of rock where Sullivan was stationed. After a few minutes he saw, against[31] the brown background of the rocks, a spot of white move quickly up and down. He immediately ran out into the road, and stopped a line of coke teams that was coming down from the camp. The drivers merely threw on their brakes, and let the thin-boned, almost transparent horses tug uselessly at the traces, until they discovered the vainness of the effort. Then horses, like drivers, relapsed into the comatose acceptance of conditions, which in the land of the cactus becomes part of man and beast. McKay came up on horseback, calling out to the first of the drivers: “Hold your horses! The e-l-ephants are about to pass!” The Mexican, just as though he had understood, grinned, then again dozed off. One by one, far down the grade, little puffs of smoke began to curl at the places where the drillers’ gangs had been working. The men, howling in mock terror, came tearing past the place where Loring and McKay were standing. They would run several hundred yards further than safety required in order to delay by a few moments their return to work when the blasting was finished. As the men surged by, McKay, in spite of his disgust, grinned. [32] “Trust a Mex to find some way to shorten work,” he said to Loring. In rapid succession the “shots” began to go off; whole sections of the cliffs seemed to swell, then gave forth a fat volume of smoke, and finally burst, hurling fragments of brown-black rock against the sky line. Then, a fraction of an instant later, the dull, muffled boom carried to the ear. “Regular bombardment, ain’t it!” exclaimed McKay. “Wo-op! duck!” As a large jagged piece of shale came whizzing over their heads he and Loring simultaneously dropped to the ground. “Ain’t it funny?” said McKay, as they got to their feet again. “Now time and again these things won’t go fifty feet, then all of a sudden they chase a fellow who is a quarter of a mile away.” The heaviest “shot” of all was to be fired in a place near Loring’s position, where a deep spur of black diorite protruded across the grade. During five days gangs had been drilling on this spur, so that its face was honeycombed with ten deep holes, for diorite is almost as hard as iron, and to make any impression upon it requires an immense load of powder. McKay[33] himself had superintended the loading, patting the charges firmly down with the tamping rod, until, as he expressed it, he had enough powder there to “blow hell up to heaven.” They had waited to fire these “shots” until the last of the others had exploded, and now the little group of men who were nearest began to look everywhere for shelter. The waiting teams were backed up close against the ledge, while the drivers crawled underneath the wagons for protection. Loring and McKay stood beside a large boulder, behind which they could drop when the explosion came. Into every niche men crawled, waiting for the shock. The foreman bent over the first fuse, and a wisp of thin blue smoke arose at the touch of his hand. “Hope he ain’t cut the fuses too long,” growled McKay anxiously. “If one of those loads misses fire, it won’t be safe to work in this neighborhood.” The foreman stepped quickly from fuse to fuse, and spurt after spurt of smoke began to curl from the rock, some hanging low, some rising. The foreman stooped over one of the fuses for a second time. “It’s missed!” exclaimed McKay. “No,[34] he’s got it. Hey, beat it! Quick!” he shouted, as the thin smoke began to turn from whitish-blue to yellow-brown. The foreman ran back a up the grade towards them. “The damned fool!” breathed McKay. “Like as not he’ll kill himself, and it will take me a week to find another man who can shoot the way he can. About thirty seconds more, and that rock is going to jump!” Loring raised his eyes. Far down the grade, beyond the point, he saw a speck. The speck grew larger and became a horse and rider. McKay saw it too. “Sullivan will warn him,” he said tersely. “My God!” he yelled, “it’s a woman, and her pony is running away.” Loring made a jump into the grade and dashed towards the smoke. The yellow-brown turned to the black-brown that just precedes an explosion. It poured forth from the ground like a volcano. “He can’t even reach the ‘shots,’” gasped McKay. “Oh, my God, where was the other flagman! Only fifty yards more—He must make it!—He will!—He’s reached the spot; he’s past it. He will—God, and there’s ten shots there!” Even as he spoke the surface[35] of the earth belched forth rumbling thunder and burst into fragments. McKay dropped flat on the ground, behind the sheltering boulder. A great cloak of brown smoke punctured with huge black rocks shut out the scene. Then, with dull, splashing thuds, the rocks began to fall into the muddy river which dragged itself along beside the grade. First came a few solemn splashes as the large rocks fell, then faster, a very hailstorm of fragments, as the smaller pieces showered down. The Mexicans were cursing frantically, adding to the roar a shrill pitch. The first three “shots” went off in lightning succession. A pause, then two more. “Five!” yelled McKay. Then three more “shots” boomed deeply. McKay and the foreman knelt behind the boulder, pale, breathing hard, striving to guess what lay behind that wall of smoke. Another pause, then a terrific report. “Nine, only one more!” shouted the foreman. They waited ten seconds,—no other shot. Then ten seconds more. They rose to their feet and started forward. “Two must have gone off at once,” yelled McKay. Another[36] roar, and they had barely time to reach cover before the shower of rocks again fell. “Ten! Come on!” roared McKay. The rocks had hardly fallen, before he, followed by a dozen others, was rushing through the smoke to what he knew must be beyond. The grade was blocked with great masses of rock, and by the time they had climbed over these barriers, the smoke had cleared. They found Loring lying on his face, his right hand still grasping the bridle of the dead horse. The girl was kneeling beside him. As McKay reached her side, he recognized the daughter of the manager of the mine. He raised her to her feet, while as if dazed by the miracle he repeated: “You ain’t hurt, Miss Cameron? You ain’t hurt?” She shook herself free from him, then knelt again by Stephen, trying to stanch with her handkerchief the blood that was flowing from a great cut in his temple. She looked up at McKay with an anxious appeal in her eyes. “Is he dead?” she asked. “The girl was kneeling beside him.” Page 36 McKay bent over, and opening the rough shirt felt Loring’s heart. “No, he’s alive still, but he’s pretty close to gone,” he answered. He untwisted the tight clenched fingers from the bridle, and half[37] raised the unconscious body. It lay limp in his arms. He turned to one of the foremen who were gathered around. “Smith, get a horse and ride like hell for the company doctor!” The man was off for the corral in an instant. “Now, Miss, you just leave him to us!” went on McKay. “See now, your skirt is getting all blood.” For reply, she raised Loring’s head gently and placed it in her lap. “Now, send some one for blankets and water,” she directed. “Agua, hey, ag-ua!” shouted McKay, and in a minute a little pale-faced water boy came stumbling up with a bucket of muddy water. McKay looked on in wonder while the girl deftly washed the dirt from the wounds. “She has her nerve,” he thought. “There ain’t nothing like a woman.” One of the Mexicans came back from the cook tent with a blanket, and upon this they gently lifted Stephen. Then four men carried him to the nearest tent. Jean walked beside them, holding her wet handkerchief tightly against Loring’s forehead, in vain attempt to stop the bleeding. They laid him on the ground, inside the tent. “Now you must go, Miss Cameron,” implored[38] McKay. “I’ll send you up to camp in one of the teams. Your father would never forgive me if I let you stay. Why you are as pale as—” The girl interrupted him decisively. “Are there any cloths here for bandages?” He looked hopelessly around the tent with its pile of dirty quilts. “I don’t see anything,” he murmured. Jean seized the soft white stock about her neck, and with a quick tug tore it off. “This will do,” she breathed, as she placed the impromptu bandage about Loring’s head. “Now tie this! I can’t pull it tightly enough.” McKay drew the ends of the bandage together, and clumsily knotted them. Then he thought of his one universal remedy. Meekly turning to Jean he asked: “How about some whisky for him?” She nodded, and he drew a flask from his pocket. With strong fingers he pried open Stephen’s jaws, and poured the whisky down his throat. The stimulant brought a slight color to the mask-like face. “I guess he would sure enjoy this some, if he were conscious,” thought McKay grimly. The men had been sent back to work, and only he and Miss Cameron knelt in the tent by Stephen, feeling[39] anxiously for the slow heart-beats in the big helpless frame. Then came the pound of horses’ hoofs on the road, the sliding sound of a pony flung back in full career upon his haunches, and the doctor stood pulling open the flaps of the tent. Jean rose to her feet. “I shall only be in the way now,” she said, and stepped outside into the vivid sunlight. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3336/91271.html","bookId":355,"book":{"id":355,"title":"The Up Grade","description":"简介： Stephen Loring sat on the edge of the sidewalk, his feet in the gutter. He was staring vacantly at the other side of the street, completely oblivious of his surroundings. No one would select a Ph?nix sidewalk as an attractive resting-place, unle...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3336","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
