{"id":43617,"no":9,"title":"CHAPTER IX","content":"The next morning Stephen awoke with a start, conscious that some one was standing beside his cot, as he lay fully dressed outside the blankets. Mr. Cameron was looking down upon him. When he struggled to his feet, Loring’s mind was all confused. He ran his hand through his matted hair. “Where am I?” he murmured. Mr. Cameron’s face was set decisively. It was easy to see from which parent Jean had inherited the modeling of the lower portion of her face. “Come outside, Loring!” There was a chill incisiveness in the words which shocked Stephen into recollection. He followed Mr. Cameron out of the tent. The bright, early morning sunlight made his hot eyeballs water, and he blinked uncomfortably. His knees shook from weakness so that he leaned against the fence beside his tent. Such absolute misery possessed him that he[145] could not think. His brain was numb. His mouth felt as if all the moisture had been baked out of it. Mr. Cameron looked him over carefully and contemptuously, then fumbled in his waistcoat pocket, and produced a cigar. Eyeing Loring all the while, he slowly bit off the end, and lighted the cigar. Before he spoke, he took several deliberate puffs. It was a good cigar; but the rich smell of the fumes made Loring turn a shade whiter. “Well, Loring, I suppose you know what this means for you?” began Mr. Cameron slowly. “A rather nice piece of work of yours, on the whole. Two men killed by your efficiency! I do not suppose that there is any use in asking you if you were drunk?” There was very little of the question in Mr. Cameron’s voice. Stephen gripped the fence hard, then shook his head. “I do not like to dismiss you, Loring, for I am in your debt for saving my daughter’s life.” Judging from his expression as he said this, the thought of the debt did not greatly please Mr. Cameron. [146] Stephen looked out over the mountains. His eyes were glistening with moisture—and this time it was not caused by the glare. It cut him to the quick that the man who was so righteously dismissing him should be the father of the girl whom he loved. In a bitter moment there flashed before his mind the vision of all his broken resolutions, of his now useless plans for success. The whole fabric, which in the past months he had woven for himself, he suddenly saw torn to shreds. Mr. Cameron’s next words were lost to Stephen. It was some seconds before he could again focus his attention. When he caught up the thread, Mr. Cameron was saying: “I had hoped better things from you, Loring. I should have known better, that when a man is a drifter, such as you are, there is no hope. Still I had hoped! Well, I was wrong. Here is your pay check, for what is due to you. That is all.” Mr. Cameron turned and walked towards the office. Stephen stood looking dumbly after him, with the check fluttering loosely in his fingers. McKay, going by on his way to work, saw him, and came up to him. He held out his hand in sympathy. [147] “Damn it, Steve, I’m sorry for you! You ain’t worth a damn; but I like you.” Stephen looked at him in silence. His only conscious thought, as he gripped McKay’s hand, was the mental reiteration: “I am worth a damn, I am worth a damn.” McKay went on in friendly solicitude: “Of course, it ain’t none of my business, Steve, but if I was you I’d beat it pretty quick. Just at present the friends of those men ain’t losing any love on you. I think if I was in your boots the Dominion trail would look pretty good to me. It’s about up to you to vamos.” “I will go,” said Loring. “It isn’t that I fear what these Mexicans may do, because I don’t care. But I can’t stand it here. Good-bye, Mac! You have been a good friend to me. I know I deserved to be fired. Deserved a lot worse; but Mac,” he added desperately, “I will make good somewhere!” McKay almost imperceptibly shook his head, then smiled and again extended his hand. “Well, anyhow, buck up, Steve! I’ve got to get down to work now. Good-bye, and good luck!” [148] “Wait just a minute!” Loring called after him. McKay turned, and Stephen held out his newly received pay check. “Will you be kind enough to give this to Hankins up at the saloon, when you get time? I owe it to him, and to his partner.” “You certainly did do things up in great shape last night, Steve,” said McKay, as he took the check, after Stephen had endorsed it with a shaking hand. “Got cheated, I suppose?” “Rather,” answered Loring. “It is strange,” thought McKay to himself, as he walked away, “with fellows like these saloon keepers. You could give them everything that you have, and no matter what happened they would keep it safely for you. But play cards and they’ll stick it into you for keeps.” Re-entering his tent, Stephen began to put his few belongings into a saddle-bag. His packing was not a long operation. He looked rather wistfully about the little tent, which had grown to seem to him almost a home. Then, slinging the bag over his shoulder, he started for the corral. [149] It was still very early, and few people were about. One or two of the Mexican teamsters were at the corral, sleepily kicking their horses into the traces. These looked at Stephen blackly, for in a mining camp news travels very fast. Stephen’s hands shook so that he had great difficulty in forcing the bit into the restive jaws of his pony. At last, however, “Muy Bueno” was saddled, and led out into the road. As Loring was putting up the corral bars again, a bare-footed little Mexican girl came pattering past. Stephen had often befriended her in small ways, so now she greeted him with shy warmth. “Buenos dies, amigo!” she chattered. The little child’s greeting started the tears to his eyes. Fumbling in his pocket, from among his few coins, he brought out a quarter. With a dismal attempt at a smile, he tossed it to her. “Eh, Se?orita Rosa, here is two bits for you, dos reales, buy candy with big pink stripes.” The child ran up to him and gratefully seized his hand with both of her grimy little paws. He cut short her repeated thanks with a quick “No hay de que,” and swung into the saddle. “á Dios,” he called to her. Then slowly he rode to the watering-trough. “Muy Bueno”[150] buried his nose deep in the cool water, and drank with great gulps. Stephen could feel the barrel of the pony swell beneath the cinch. When he could hold no more, “Muy Bueno” raised his head from the trough questioningly, the drops of water about the gray muzzle glistening in the sun. Stephen pressed the reins against the horse’s neck, and turned him towards the Dominion trail, which showed as a ribbon of white upon the hills to the eastward. Close behind him he heard a familiar voice singing an old song: “La, la, boom, boom. La, la, boom, boom.” The last word was sung with unusual emphasis, serving as a salutation and hail. Wah, beaming with his usual joyousness, was trotting towards him. “Hey, me bludder, me bludder. You gettee canned! Oh, me bludder, you allee samee fool gettee drunk. You beat it to Dominion? Me bludder welly wise! La, la, boom, boom!” Wah concluded his outburst with a peal of laughter. Stephen looked down solemnly at him. “Damned funny, isn’t it, Wah?” “Oh, me bludder, me bludder!”—Wah[151] could get no further, before another paroxysm of laughter overcame him. Recovering somewhat, he produced from his blouse a greasy looking package. “Me bludder get nothing to eat before he come to Dominion. Wah bring him pie, oh, lubbly, lubbly pie.” Stephen was deeply touched by the Chinaman’s kindness. He shook his hand warmly. “I had forgotten all about food. Good-bye, Wah, and thank you a lot.” “Oh, me bludder, wait one minnie moming. I have note. Missee Cameron, she send me bludder a note!” Wah, with some labor, produced from his pocket a little envelope, and handed it to Loring. “Oh, lubbly, lubbly note! Oh, lubbly—” “Shut up, Wah!” flared Stephen. White as death, he took the note from Wah, and slipped it inside his shirt. He could not trust himself to read it. “Please thank her, Wah, and—” He could say no more. Slowly he turned his horse, and rode towards the hills. Wah walked away, murmuring beneath his[152] breath: “La, la, boom, boom, me poor bludder. He must habee hellee headache. La, la, boom, boom.” Stephen soon reached the place on the trail where was situated the old deserted “Q” ranch. A rusty iron tank by the shanty bore the crudely painted sign: “Water, Cattle 10 cts. per head. Horses 25 cts.” Beside the tank, however, in what had evidently formerly been an empty bed, gushed a clear stream of water. Stephen smiled when he saw how nature had thwarted the primitive monopoly. Dismounting, he lifted the saddle from his horse’s back. Then he deftly hobbled him, and left him to eat what grass there was by the rocky stream bed, within a radius which he could cover with his fore legs tied together. Stephen then seated himself on the ground, propped the saddle behind his back, and proceeded to light a pipe, and to think. All the events of the past few hours had come upon him with such rapidity that he had had no time for reflection. Seated there in the open, beneath the vivid blue sky, with no sound but that of the softly, coolly running water near, all the scene of the accident loomed clearly before him, far more[153] clearly than it had done in the morning when he had still been in the camp, and surrounded by the routine of life there. The very warmth of the sunlight, which should have made a man’s heart bound with the joy of living, merely added to the blackness of his mood. He was very nervous, and smoked with quick, hard puffs. Once his pony started at something. The sound brought Loring to his feet, all of a quiver. He sat down again, wiping the perspiration from his forehead with an excited gesture. Gripping his hands together hard, he thought the situation over and over. The more he thought of it, the worse it seemed. This was not a case which could be called the result of negligence, or drifting. It came very close to crime, and he knew it. Stephen Loring was a man who, when he sat in judgment upon himself, was unflinching. He weakened only when it came to carrying out the sentence which the court imposed. He thought of Miss Cameron, as she had been on the ride which they had taken together; then of what she must think of him now. This brought a flush of shame to his cheeks. Suddenly he recalled the note which Wah had brought to him, and he took it reverently from[154] his blouse. It was the first time that he had ever seen her handwriting. His name was written upon the envelope in clear, decided letters, which coincided well with the character of the writer. Stephen looked at the writing, with an infinite tenderness softening the lines on his face. He started to tear open the envelope, then suddenly he stopped. “I won’t,” he exclaimed, half aloud. “I will not read it until I am worthy to do so, or until I have a great need of it.” Reluctantly he slid the note back into his blouse. Then, coloring, he pushed it over to his left side. His heart seemed to beat more strongly, more manfully, for the companionship. He had eaten no breakfast, and began to be conscious of a great hunger. He ate, down to the last crust, the pie which Wah had given to him. It was as good as its maker had claimed it to be. There is nothing in the world equal to food for restoring self-respect, and Stephen, having eaten, began to see the world more normally. Tightening his belt, he took a long drink from the stream, then saddled “Muy Bueno” and started again on his way. [155] All the afternoon he rode continually up hill, till towards five o’clock he struck the Dominion divide, and timber. The air here, in contrast to the valley below, was cold, and Loring, only thinly dressed, shivered. Several times cattle “outfits” passed him on the trail. Men were driving in from the range scraggly bunches of steers, to be fattened before selling. Once he did not pull his horse out of the trail in time, and sent a bunch of frightened cattle stampeding into the underbrush. He was so engrossed in his thoughts that he hardly noticed the cursing which he received from the ranchmen. At dusk, beside the trail, he saw a bright fire in front of a tent. Two men, occupied in frying bacon, and boiling coffee, were seated before it. The smell that arose from the cooking appealed strongly to Stephen, and he reined in his horse. “Howdy, stranger! Making for Dominion?” one of the men called out. “Well, you won’t get there for some time yet. It is twelve miles from here. Better let us stake you to a meal. Come from Quentin, do you? Me and my pardner was going there to-morrow.” Stephen, with alacrity, accepted the proffered hospitality. [156] “Much obliged, friend,” he said. “I’m pretty well broke, and I was not expecting to get anything to eat to-night.” “Don’t worry about that. You shan’t go by our outfit hungry. We ain’t made that way. There was a cuss I knowed once,” continued one of Loring’s hosts, “up in Cochise County. I was broke, flat busted, when I was there, and I asked him to stake me to a meal, and say, the mean skunk wouldn’t come through at all. Said I could ‘watch him eat.’ Now what do you think of that?” As he recalled the crime against hospitality, the man kicked vigorously at one of the logs on the fire. Loring listened, with due sympathy, to the tale, the while he eyed with hopeful glances the coffee-pot, at the edge of which a yellow foam soon appeared, serving as signal that the meal was ready. “Sorry we can’t give you flapjacks,” remarked one of the men, as he lifted the bacon off the fire. “Pardner here makes swell ones, but we’re pretty low on our grub outfit now. Hope we can get work at Quentin. Any jobs floating round loose there?” Stephen slowly filled his tin cup with coffee,[157] and paused, after the western fashion, to blow into it a spoonful of condensed milk, before he answered. “I am not sure,” he said, “but I think that there is a vacancy on one of the hoists. I think they fired a man there recently.” “That’s good for us,” exclaimed one of the men. “Wish they’d fire some more!” Stephen did not continue the discussion. After a quiet smoke beside the embers of the fire, Stephen rose, and thanking his hosts warmly, prepared to leave. As he was mounting he happened to feel a flask that was in his pocket. He remembered vaguely having filled it the night before. Reaching down from the saddle he held out the flask. “Have a drink, gentlemen?” he asked. One of the men took the flask in his hands, almost reverently. “I don’t know that I won’t,” he said. He took a long pull, then handed the flask to his partner. “Regards!” drawled the latter. The words brought to Loring a bitter train of memories. “Keep the damned stuff if you want it. I[158] am through with it,” he said. Then, with a quick good night, he rode off. The men, in mild wonder, looked after him for a moment. Then they relighted their pipes, and settled themselves by the fire. “Mighty nice chap, that,” remarked one, “but he must feel powerful bad about something to give away good whisky like that.” It was nearly nine o’clock in the evening when Stephen rode into Dominion. The main street was brightly lighted, and as it was Saturday night, the sidewalks were crowded with people walking restlessly up and down. The shop windows glowed attractively. Through several open doors he could see men gathered about pool tables. The bright lights by the cinematograph theater showed clearly the faces of the passing crowd. Dominion had passed from the camp into the town stage, as was evinced by the liberal scattering of brick houses among those of wooden construction. Many horsemen were passing in the street. Fresh from the hills, Loring felt almost dazed by this renewed contact with established humanity. His first care was to seek a stable for “Muy[159] Bueno.” Seeing in one of the side streets a livery sign, he entered the place and tied his pony among the long line of horses in the shed. Then, after saying to the proprietor: “Hay and not oats,” he walked out into the street. “I hope the confounded expensive little beast won’t order champagne for himself,” he thought. “He is almost clever enough to do so.” As he walked slowly along, he mentally calculated his resources. Three dollars in cash. Nothing in credit. A few cents Mexican in prospect. He would have to sell the pony and saddle to complete the payment of his poker debt. A group of men, thoroughly drunk, passed by, singing noisily. Idly, Stephen followed after them, until they came to the little creek that runs through the center of the town. Across the creek, high above the dark, silent water, lay a narrow swinging bridge. One of the group of men called out: “Let’s go across the bridge of sighs to Mowrie’s.” The others noisily assented and soon Loring could hear the bridge ahead of him creaking beneath their weight. He stood for a moment, hesitating, staring at the lights across the bridge, then he deliberately followed. The opposite shore of the creek was lined[160] with “cribs” and shanties stretched in a long, sodden row along the bank. From many of them came the brazen notes of gramophones in a jarring discord of popular tunes. Women’s voices were mixed with the music, in shrill unpleasant laughter. A board walk ran before the close built houses, and up and down this tramped throngs of men, talking noisily, singing, swearing. The faces of some group or other were now and then visible, as some one scratched a match to light a cigarette. Women of almost every nationality on the globe stood in the doorways, French, Japanese, Negroes, Swedes, all dressed in flaunting kimonas. They called to the men in the crowd, exchanged jests, or leaned idly against the door-posts, staring fixedly into the faces of the men. From many of the places a bright light streamed out across the water. The shutters of several were drawn. In strange contrast to the scene, in one of the houses some one was singing in a clear tenor voice, which sounded as sweet and pure as if it had been in a choir. For a moment the murmur of voices and tramp of feet ceased, as people paused to listen. [161] Stephen walked slowly down the street. A woman in one of the darker doorways called out to him. He stopped, bit his lip hard. “Why not? What is the use, now?” he thought. He ran up the steps and opened the door. Inside, half a dozen painted women were drinking with the men there. The proprietress beckoned to him to enter. Then like a veil, before his eyes dropped a cloud of memory. He saw the shed at the hoist, two bodies laid limply on the ground; figures moving in dim lantern light. He staggered out into the street, drew a deep breath and strode back across the bridge. “I am through with this sort of thing for good,” he muttered. “I owe the world too big a debt of reparation now. But I will pay it.” For the first time in his life, Loring’s smile was a smile of power, that power which rises sometimes from a supreme sorrow, sometimes from supreme holiness, sometimes, as now, springing from the black soil of crime; but bespeaking the discipline which has learned to control passion, to bring desire to heel, and to make a man master of himself despite all the[162] devils that this world or the next can send against him. He had learned his lesson at last, learned it at the cost of two lost lives, and the cost to himself of an overshadowing remorse which he could never escape, let the future hold what it would. But he had learned it. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3336/91278.html","bookId":355,"book":{"id":355,"title":"The Up Grade","description":"简介： Stephen Loring sat on the edge of the sidewalk, his feet in the gutter. He was staring vacantly at the other side of the street, completely oblivious of his surroundings. No one would select a Ph?nix sidewalk as an attractive resting-place, unle...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3336","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
