{"id":8603,"no":14,"title":"CHAPTER XIV. THE ARTIST\u0027S SECRET.","content":"Frederic Vernon sat in his studio, toying with his brush. The canvas was before him, but he seemed to be in a brown study. \"What has got into me?\" he asked himself, impatiently. \"I cannot fix my mind upon my work. I am no longer on the verge of destitution, or compelled to labor for a mere pittance; yet my mind is less at ease than when I hardly knew where the next day\u0027s food was to come from.\" Vernon\u0027s circumstances had improved. He had taken a lighter and more cheerful studio, and moved with his mother into better rooms. He was no longer forced to court the penurious patronage of young ladies like Miss Framley, and, thanks to the influence of Miss Dearborn, he was never without some work in hand. Yet, though he ought to have been cheerful, he found himself restless, and his work often had to wait upon his moods. \"Frederic, what is the matter with you?\" asked his mother, earnestly, one day. [Pg 112]\"Why do you ask, mother? I am well,\" he answered, evasively. \"You have lost your appetite, and your mind seems preoccupied. Is anything troubling you?\" \"Anything troubling me?\" he asked, with a forced smile. \"What a strange idea!\" \"Nay, my son; you cannot conceal it from your mother\u0027s eyes that something is amiss with you. What is it?\" \"I am sure I cannot tell, mother.\" \"Is not your work proceeding well, Frederic?\" \"Oh, yes. I had another order to-day.\" \"You should look happy, then, my son. Compare your position to-day with what it was three months since. Then——\" \"I was almost a beggar, mother.\" \"True.\" \"Forced to paint portraits for mean, shoddy people for a mere song.\" \"Yes. But things have changed with you now, Frederic.\" \"Yes, thanks to Providence—and Grace Dearborn.\" Unconsciously he pronounced this name with a tenderness which revealed to his mother something that he had not intended she should know. A look of intelligence overspread her face. \"I begin to see how it is, my boy,\" she said, gently. [Pg 113]\"How what is, mother?\" \"I think I understand what is the matter with you.\" \"Have you turned seeress?\" he asked, smiling faintly. \"No; but I can minister to a mind diseased when I know the nature of the disease.\" \"Well, what is my disease, mother mine?\" he asked, lightly. \"Frederic, you are in love!\" \"In love!\" he repeated, flushing. \"Then perhaps you can tell with whom I am in love?\" \"I think I can.\" \"Say on, mother.\" \"You love Grace Dearborn.\" He started, and his face flushed. \"What makes you think that, mother?\" he asked, slowly. \"Your face would tell me if I had no other evidence. Is it not true?\" \"Well, mother, you have my secret,\" he answered, after a pause. \"You know my disease. Now canst thou minister to a mind diseased?\" \"Perhaps so.\" \"I know what you would say. You would tell me to root out the foolish fancy from my heart, and devote myself unflinchingly to my art. Well, mother, I have tried it, and I have failed.\" [Pg 114]\"You mistake me, Frederic. If you feel that your love for this young lady is deep and earnest, such a love as comes but once in a life-time, let her know of it, and give her a chance to accept or reject it.\" \"Mother, are you mad? Do you know that Grace Dearborn is a wealthy heiress—that she moves in the most exclusive society of Chicago—that she is admired by many who are rated as eligible matches?\" \"Yes, I know all that—or I have guessed it from what you have told me. And what then?\" \"Do you think of the difference between us? What am I?\" \"You are an artist, a gentleman, and a man of talent.\" \"Even were it so, I earn, for my entire income, less in all probability than this young lady spends for her wardrobe in a single year.\" \"That may be, Frederic.\" \"And yet you bid me hope?\" \"Yes, I bid you hope. If Miss Dearborn is what I think she is, she will not set an undue estimate upon wealth. She will understand how many vulgar and ill-bred men possess it, and will rate higher the talent, the refinement, and the culture of a gentleman, and the good heart that makes him ever a loyal and affectionate son. Such a man cannot fail to make a desirable husband.\" [Pg 115]\"Ah, mother,\" said Vernon, smiling, \"you are a mother, and, like all mothers, you overrate your son. If Grace would but look upon me with your eyes, perhaps I might hope. As it is, were I to open my lips to her, I should only subject myself to the mortification of having my suit contemptuously spurned.\" \"That would never be. Even if rejected, there would be nothing to injure your pride or bring a blush of mortification to your cheek.\" \"I think you are right there, mother. Grace is too gentle, too much of a lady, to let me see how unjustifiable were my hopes.\" \"Frederic, will you be guided by me in this matter?\" \"Let me hear your advice first, mother. Then I will decide.\" \"Try to make yourself more worthy of her. Make the most of your talent. Become something more than a portrait painter. Become a great artist; and when all men acknowledge your talent, Miss Dearborn will be proud to accept your devotion, and to reward it. Is my advice good?\" \"Mother, you put new life into me,\" said the young man, his face glowing with new hope. \"I have always wished to become a true artist. I am a portrait painter because poverty made it necessary.\" \"And you would become an artist if you could?\" \"Yes; it is my strongest wish.\" [Pg 116]\"Then form the plan of some great picture, select some worthy and inspiring subject, devote your leisure to it, and think that you are working for her you love.\" \"I will mother. You are not only my best friend, but my wisest counselor. Henceforth I shall feel that I have an object for which to labor.\" Frederic Vernon returned to his studio with quickened steps, and resumed work with an ardor he had not felt since Grace Dearborn sat in his studio as the subject of his brush. It was some time before a suitable idea came to him, but at last it flashed upon him, and he gave to his picture all the time he could save from his sittings. In the midst of his labors there appeared to him one day the postman. It was a dainty missive he held in his hand, addressed, in delicate chirography, to Frederic Vernon, Esq. Vernon opened it, and read with a quickened movement of the heart a card of invitation to a party given by Mrs. Caroline Sheldon, to celebrate the birthday of her niece, Miss Grace Dearborn. Vernon\u0027s face lighted up with joy. \"She has not forgotten me, then,\" he said to himself. Then came the thought, \"Shall I go?\" Would[Pg 117] he feel at home in the fashionable circle to which he would be a stranger? He hesitated, but it was not for long. \"Since Grace bids me, for I know it was at her suggestion that I am invited, I will attend.\" Just then his studio was invaded by a young lady, upon whose portrait he was engaged. She did not come alone. With her was Major Ashton, who has already been named as the unsuccessful suitor of Grace. Vernon laid down the invitation hastily, but it was still open, and Major Ashton, who was observant, saw it, and a glance revealed to him its contents. His face betrayed his surprise and annoyance. \"Is it possible that Miss Dearborn has invited this portrait painter to her party?\" he asked himself. Then his eyes dwelt critically on the refined and handsome face of the artist, and a vague feeling of jealousy sprang up within him, for he was still firmly resolved upon marrying Grace. \"But no,\" he thought, recovering himself; \"Grace would not stoop to a fellow like that. She only wishes to patronize him.\"","sourceLink":"http://novel.tingroom.com/ertong/3009/83085.html","bookId":282,"book":{"id":282,"title":"The Train Boy","description":"简介： The four o\u0027clock afternoon train from Milwaukee, bound for Chicago, had just passed Truesdell, when the train boy passed through the cars with a pile of magazines under his arm....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3009","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
