{"id":8617,"no":28,"title":"CHAPTER XXVIII. MR. MANSON IS SURPRISED.","content":"Emanuel Manson felt too late that he had made a mistake. He had intended to humiliate Paul by making him his own errand boy, but our hero\u0027s firm refusal to serve him made the humiliation his own. He did not venture to report the matter to Mr. Bradford, for he knew that he had no right to call upon Paul to do his own errands; yet to let it pass would seem like a confession of weakness. \"I can\u0027t do anything at present,\" he decided, \"but I will take the first opportunity to prejudice Mr. Bradford against the young rascal and procure his dismissal.\" In other words, Mr. Manson proposed to bide his time. He had no idea of foregoing his vengeance, but thought it politic to defer it. Meanwhile he had plenty of opportunities to make things disagreeable to Paul, and availed himself of them. At the end of the first week a very disagreeable surprise awaited Mr. Manson. The time came to pay off the clerks, and among others Paul. [Pg 207]He drew from the cash-box four dollars and handed it to our hero, with the remark: \"There\u0027s your pay, though it is more than you have earned.\" Paul glanced at the two two-dollar bills which lay in his hand, and said, quietly: \"Why do you pay me four dollars?\" \"Three would be enough, but I didn\u0027t suppose you would be modest enough to admit it.\" \"I am not. I suppose Mr. Bradford hasn\u0027t told you how much my wages are to be.\" \"How much?\" inquired the book-keeper, with a sneer. \"Ten dollars, I presume.\" \"You are right. I will trouble you to give me six dollars more.\" \"Are you crazy?\" gasped Manson. \"Not that I am aware of,\" answered Paul, coolly. \"If you are trying to humbug me, you may as well give up the attempt. I wasn\u0027t born last year.\" \"I am neither crazy nor trying to humbug you,\" said Paul, with easy self-possession. \"Mr. Bradford has kindly agreed to pay me ten dollars a week, and——\" \"I never heard a more outrageous falsehood!\" ejaculated Manson. \"The idea of paying a raw, inexperienced boy ten dollars a week! Why, it is utterly[Pg 208] ridiculous. I shall take care to report your attempted swindle to Mr. Bradford.\" \"Just as you like, Mr. Manson; but first, will you cast your eyes over this note?\" Paul produced a folded sheet of note-paper, and passed it to the book-keeper. Manson read to his amazement these words over the signature of Alexander Bradford: \"I have fixed the wages of Paul Palmer at ten dollars per week, and you are authorized to pay him that sum.\" \"Where did you get this paper?\" asked Manson. \"From Mr. Bradford.\" \"When?\" \"Yesterday. He thought you would require his authority for paying so large a sum.\" \"How do I know but you have forged this note?\" asked Manson. \"Probably you know Mr. Bradford\u0027s handwriting and signature. Besides, it would be foolish in me to attempt a forgery which would immediately be found out.\" In fact, Manson knew that the note was genuine. He could not be mistaken in Mr. Bradford\u0027s handwriting, but he wanted to find some excuse for delaying or refusing payment. On the whole, he did not venture to do either, as he knew his employer would be offended. [Pg 209]\"There\u0027s your money,\" he said, throwing the balance on the desk. \"I can\u0027t say I understand it at all. I shall feel it necessary to speak to Mr. Bradford on the subject.\" \"I wish you would, sir, so as to remove any doubts you may have.\" \"It is about three times as much as you have earned.\" \"I won\u0027t dispute you, sir. I am quite aware that it is more than I can earn.\" \"Then why did Mr. Bradford pay you so much?\" \"Probably he will tell you when you speak to him on the subject.\" Manson was baffled, but he felt all the more annoyed that his nephew Julius had lost a situation which carried so much pay with it. He dispatched Paul on an errand, and during his absence Julius came in. \"Well, Julius,\" said his uncle, \"I have just been paying that boy who has got your place.\" \"I wish you had been paying me. I haven\u0027t got a cent to my name. Four dollars would have come mighty convenient.\" \"Four dollars!\" \"Yes; isn\u0027t that what he gets? Three dollars would be too mean.\" \"The boy gets ten dollars a week!\" [Pg 210]\"Ten dollars!\" gasped Julius. \"Oh, come now, you\u0027re fooling.\" \"Not at all. Do you see that?\" He showed Julius the note of Mr. Bradford previously referred to. \"Good gracious! I can\u0027t believe it!\" exclaimed Julius. \"Why, it\u0027s tremendous pay. Can\u0027t you turn him off and get me in his place? What a swell I\u0027d cut on ten dollars a week!\" \"I wish you had the place,\" said Manson, thoughtfully; \"but I don\u0027t know how to manage it.\" \"Try to think of some way, Uncle Emanuel,\" pleaded Julius. \"I should have liked it at four, for ma only gives me a dollar a week allowance, and that is hardly enough to buy my cigarettes.\" \"You\u0027d be a good deal better off if you gave up cigarettes. They are doing you no good.\" And here Mr. Manson gave his nephew good advice. \"Put me in the place, and I\u0027ll do whatever you want me to,\" said Julius. \"I\u0027ll do my part,\" said the book-keeper.","sourceLink":"http://novel.tingroom.com/ertong/3009/83099.html","bookId":282,"book":{"id":282,"title":"The Train Boy","description":"简介： The four o\u0027clock afternoon train from Milwaukee, bound for Chicago, had just passed Truesdell, when the train boy passed through the cars with a pile of magazines under his arm....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3009","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
