{"id":8619,"no":30,"title":"CHAPTER XXX. PAUL IS PROMOTED.","content":"\"You are to go to Mr. Bradford at once,\" said Manson, as he received the letters Paul had brought. There was a triumphant smile on the book-keeper\u0027s face which Paul did not fail to observe. \"What does it mean?\" he thought. \"Has he been complaining of me?\" This would not have troubled him but for Manson\u0027s evident satisfaction. It was clear, he thought, that something disagreeable was about to happen during the interview that awaited Paul. However, he did not propose to give his enemy the satisfaction of knowing that he had given him anxiety. He merely said in his usual tone, \"Very well, sir,\" and proceeded to open the door of the inner office. \"Mr. Manson told me you wished to see me, sir,\" he said. \"Oh, yes,\" said Mr. Bradford, wheeling round in his office chair. \"Manson has been making complaints against you.\" \"I am not surprised at that, sir. From the first,[Pg 216] he appears to have disliked me. May I ask what he says?\" \"He says you are not respectful to him.\" \"I am as respectful as I can be, but he is continually finding fault. It is impossible to please him.\" \"He wants me to discharge you.\" Paul\u0027s heart beat quickly. It would be a misfortune to him to leave so good a place, especially as he was not sure whether he could regain his place as train boy, and it would operate against him to have it known that he had been discharged by Mr. Bradford. \"Of course, sir,\" he answered, soberly, \"that is as you please.\" \"Moreover,\" the manufacturer proceeded, \"he wants me to take his nephew, Julius, in your place.\" \"I knew he wanted Julius in my place,\" said Paul, despondently. \"And I have about made up my mind to let him try the experiment.\" The blow had fallen! Poor Paul thought it hard, but his pride sustained him. He could not understand, however, how Mr. Bradford could so desert him and side with his enemy, the book-keeper. \"Then, sir, I suppose I am to go,\" he answered. \"Well, I can hardly employ two boys in the office, since there is not more than work enough for one.\" [Pg 217]\"I am very sorry, sir,\" said Paul, in a subdued tone. \"I have tried to be faithful to you.\" \"And that is the reason why I intend to promote you,\" said the manufacturer, smiling. Promote! The word fell like music on Paul\u0027s ears. It was all right. His friend had not deserted him after all. \"Oh, thank you, sir,\" he said, his face brightening. \"Come now, Paul, you didn\u0027t really think I meant to discharge you, did you?\" \"It looked like it, sir,\" said Paul. \"I shouldn\u0027t have made you feel so uncomfortable,\" said his employer. \"Now about this change. I am letting Manson have his way only to prove to him how unfit Julius is for the post. He hasn\u0027t tried him yet. When he does he will find him idle, lazy, and unreliable, and he will find such fault that his nephew will probably himself resign the place in disgust.\" \"I don\u0027t know,\" said Paul. \"Ten dollars will reconcile him as it did me.\" \"Oh, bless your soul! Julius isn\u0027t to have ten dollars. He is to have four, like all his predecessors except yourself.\" On the whole Paul was rather glad of that. It made Mr. Manson\u0027s momentary triumph less important. \"Now about your own affairs,\" said Mr. Bradford. \"Are you willing to leave Chicago and travel West?\" [Pg 218]\"I would like it above all things, sir,\" said Paul, his eyes sparkling. \"I thought you would. Well, I am about to give you an important commission. Do you know where the Black Hills are situated?\" \"Yes, sir; in Wyoming.\" \"Precisely. Well, I suppose you know that multitudes have flocked there in search of gold.\" \"Yes, sir.\" \"I myself own half a mine there. It is known as the Blackstone. A man named Fox, who is resident at the mine, owns the other half, and its working is done under his direction. Now I have a shrewd suspicion that he is cheating me, taking advantage of my absence and probable inability to form any adequate judgment of the mine and its value.\" \"What makes you think so, sir?\" \"His continually writing discouraging accounts of the mine, expressing his great disappointment with it. In his last letter he winds up by saying that he is willing to give or take two thousand dollars for it, though it cost the two of us ten thousand.\" \"Doesn\u0027t he run a risk in making such an offer?\" \"Yes, but he thinks I can\u0027t attend to it myself, and will sacrifice my interest readily, just to get rid of anxiety.\" \"I see.\" [Pg 219]\"Now I want you to go out and form a judgment as to the man\u0027s motives, and get an idea of the real value of the mine.\" \"But, sir, I don\u0027t know anything about mines.\" \"Very true. Still you have good common sense, and can institute inquiries without exciting suspicion. No one would suppose I would select as my agent a boy of sixteen.\" \"Perhaps it is rash,\" said Paul. \"Nine out of ten would say so, but somehow I have more confidence in you than in many men, and I believe you would serve me faithfully.\" \"You are right there, sir, at any rate.\" \"Now as to the compensation. Will twenty-five dollars a week and your traveling expenses content you?\" \"Twenty-five dollars!\" ejaculated Paul. \"Are you in earnest?\" \"Quite so. Paul, I don\u0027t pay you according to your age, but according to the nature of your work, and twenty-five dollars a week is not too much. Now, when can you start?\" \"Day after to-morrow, sir.\" \"That will do.\" \"I was thinking how I could arrange about my mother, Mr. Bradford. She will need money while I am gone.\" [Pg 220]\"She can call every Saturday at the office and collect what you thinks she needs. Shall it be ten dollars a week? If so, it can be deducted from your week\u0027s wages.\" \"That will be very satisfactory, sir.\" \"Very well. Go home, make preparations for setting out, and come to me to-morrow for instructions. Don\u0027t tell anybody except your mother where you are going.\" \"All right sir.\" As Paul entered the presence of the book-keeper, the latter glanced at him eagerly to see his downcast looks. He was perplexed to see that Paul seemed in excellent spirits, and feared Mr. Bradford had reconsidered his decision. But Paul reassured him. \"Mr. Manson,\" he said, \"I am about to leave you.\" \"So Mr. Bradford has found you out, and discharged you,\" sneered Manson. \"At any rate,\" answered Paul, \"I shall no longer be office-boy. Julius is to take my place.\" \"If you had been more respectful to me you might have staid,\" said Manson. \"Mr. Bradford didn\u0027t say anything about that,\" said Paul, smiling. \"Well, good-day.\" \"There\u0027s something about this I don\u0027t understand,\"[Pg 221] thought the perplexed book-keeper. \"I thought he would make a fuss. Well, at any rate, I\u0027ve carried my point. He\u0027s bounced, and Julius is in his place.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3009/83101.html","bookId":282,"book":{"id":282,"title":"The Train Boy","description":"简介： The four o\u0027clock afternoon train from Milwaukee, bound for Chicago, had just passed Truesdell, when the train boy passed through the cars with a pile of magazines under his arm....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3009","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
