{"id":8628,"no":39,"title":"CHAPTER XXXIX. A THIEF FOILED.","content":"Until that moment Denton had not taken the trouble to notice the face of his roommate. He had only observed that he was a boy. The recognition was mutual, and it is hard to tell who was the more surprised. \"The train boy, as I\u0027m a sinner!\" ejaculated Denton, in amazement. \"Luke Denton!\" ejaculated Paul in turn. \"How came you here?\" asked the man. \"What are you doing with my carpet-bag?\" demanded Paul. \"Oh, bother!\" returned Denton, defiantly. \"That\u0027s my business!\" \"I should say that it was my business,\" retorted Paul. \"Where do you keep your money? I don\u0027t find any in the bag.\" \"I don\u0027t keep any there.\" \"Give me your pocket-book quick, youngster. I am hard up, and I must have money.\" [Pg 266]As he spoke he advanced toward the bed. \"You can\u0027t have mine, Mr. Denton,\" said Paul. \"When did you get out of jail?\" \"Boy, do you want me to kill you?\" demanded Denton, fiercely. \"No, and I sha\u0027n\u0027t permit you to rob me either.\" \"Listen to me!\" said Denton, rapidly. \"I am a desperate man, as I have already told you. I have escaped from prison, but I have used up what money I had. I must have more. I don\u0027t forget that you were the means of sending me to prison, but if you will give me all the money you have about you, I will let you go this time.\" \"Suppose I refuse?\" said Paul. \"Then I will strangle you first, and rob you afterward,\" answered Luke Denton, wickedly. As he spoke he moved nearer the bed, but he paused suddenly when Paul drew a revolver from beneath his pillow, and pointed it at him. \"Stop there, Mr. Luke Denton,\" he said, firmly. \"I should be very unwilling to shoot you, but I mean to defend myself. One step nearer and I fire!\" \"You wouldn\u0027t dare do it,\" said Denton, chafing with disappointment. \"You\u0027d better not take the risk.\" \"I was only joking,\" said Denton. \"I thought I would see if I could scare you. I\u0027m going to bed.\" [Pg 267]\"Not in this room.\" \"What do you mean?\" \"You don\u0027t go to bed in this room,\" repeated Paul. \"This room is mine. I have a better claim to it than you, for I engaged it first.\" \"I do not feel safe in passing the night in your company.\" \"That is nothing to me.\" \"Listen, Luke Denton. Unless you leave this room at once I will ring the bell, summon the landlord, and denounce you as an escaped convict.\" Luke Denton was so angry that, had he been armed, he might have fired at our hero, but his stock of money had been too limited to allow him to purchase a pistol. \"Nonsense!\" he said. \"I will do you no harm.\" \"Are you going?\" asked Paul, still keeping him covered with his weapon. There was no help for it. With a muttered execration Luke Denton left the room, and Paul, glad to be rid of him, locked the door, and breathed a sigh of relief. It may be well to add here that Denton was not recaptured, but months afterward was shot in California by a miner whom he had robbed. It was a sad ending to a life which might have been honorably spent, for he was a man of excellent abilities and capacity, but[Pg 268] preferred the hazardous career of a thief to the more prosaic paths of industry and honesty. Next day Paul purchased a ticket for Chicago. As he stood at the depot waiting for his train his attention was drawn to the pale and sorrowful face of a woman who had just inquired the price of a ticket to Chicago, and, as if it were beyond her means, turned away with a deep sigh. \"Are you in trouble, madam?\" he asked. \"Yes,\" she answered. \"It is important for me to go to Chicago, but I have not money enough within five dollars.\" \"I will advance the money,\" said Paul, stirred with pity. \"God bless you, young man!\" exclaimed the lady, fervently. \"You don\u0027t know how important it is for me to make this journey.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3009/83110.html","bookId":282,"book":{"id":282,"title":"The Train Boy","description":"简介： The four o\u0027clock afternoon train from Milwaukee, bound for Chicago, had just passed Truesdell, when the train boy passed through the cars with a pile of magazines under his arm....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3009","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
