{"id":9365,"no":20,"title":"CHAPTER XX. TWO MIDNIGHT PROWLERS.","content":"On the night of the day we are writing about, there was something unusual happening. It was neither a sentry nor an officer, this stealthy figure that stole out of a tent in the street of Company A. He waited cautiously until the sentry behind his tent had passed on to the other end, and then with the slyness of an Indian he crept down the path. And when he disappeared again, it was the big tent of the first captain that swallowed him up. \\n\\n \\n\\n Fischer was expecting that visit. He was up and dressing, and ready for the other. \\n\\n \\n\\n \"There are the clothes, Mr. Powers,\" he whispered. \"Leave your uniform here and slip into them quickly.\" \\n\\n \\n\\n The captain\u0027s voice was trembling with excitement, and some little nervousness, too. This was a desperate errand for him. It might cost him his chevrons, if not worse; for he had desperate deeds to do that night. \\n\\n \\n\\n \"Have you got the guns?\" he whispered. \\n\\n \\n\\n By way of answer Texas slipped two shining revolvers into the other\u0027s hands. Fischer gripped the cold steel for a moment to steady his nerves, and then thrust the weapons into the pocket of the rough coat he wore. \\n\\n \\n\\n [Pg 168]\"Come on,\" he said. \"I\u0027m ready.\" \\n\\n \\n\\n He stepped out of the tent, Texas close at his heels. The two crept around the side, then crouched and waited. Suddenly Fischer put his fingers to his lips and gave a low whistle. The effect was instantaneous. Sentries Number Three and Four promptly faced about and marched off the other way. It was contrary to orders for sentries to face in opposite directions at the same time. But it was handy, for it kept them from \"seeing any one cross their beats.\" Texas and his companion had sprung up and dashed across the path and disappeared over the earthworks of old Fort Clinton. \\n\\n \\n\\n \"That was neatly done,\" chuckled Texas. \"We\u0027re safe now.\" \\n\\n \\n\\n \"It would be a sad state of affairs, indeed,\" laughed the other, \"if a first captain couldn\u0027t \u0027fix\u0027 two sentries of his own class. We\u0027re all right if we don\u0027t make any noise.\" \\n\\n \\n\\n A person who glanced at the two would not have taken them for cadets. They were clad in old dilapidated clothing, with collars turned up to increase the effect. To complete this disguise, they took two black handkerchiefs from their pockets, and in a few minutes more were as desperate-looking burglars as ever roamed the night. \\n\\n \\n\\n \"Burglary\u0027s not much worse than conspiracy, any[Pg 169]way,\" muttered Fischer, as he hurried along. \"I wonder what time it is.\" \\n\\n \\n\\n \"Twelve o\u0027clock and all\u0027s we-ell!\" rang the voice of the sentry from camp just then—an answer to the question. And the two villainous-looking men crept on in silence, gripping their weapons the tighter as they went. \\n\\n \\n\\n The hotel lies very near the camp; it was only a short walk for the two, even creeping and dodging as they were, before they were safely hidden close to the porch of the building. The house is in Colonial style, with big, high pillars, painted white. It was a difficult climb, but the two lost not one moment in hesitation. They evidently knew just why they came, and had planned their task beforehand. Texas sprang up on the shoulders of the other, and a short while later was lying breathless upon the tin roof of the piazza. \\n\\n \\n\\n Fischer had dodged back into the shadow to wait. The other lay where he was for a short while, to glance about him and recover his breath; then he rolled over and crept softly and silently along until he reached one of the windows. Texas had found out which one beforehand; he could afford to waste no time now, for this was a State\u0027s prison offense he was at. \\n\\n \\n\\n He raised himself and glanced over the sill of the open window; he glanced hastily about the room inside,[Pg 170] and then dropped down again and crept to the edge of the roof. \\n\\n \\n\\n \"They aren\u0027t there,\" he whispered. \"S-sh!\" \\n\\n \\n\\n \"Not there!\" echoed the other. \"Then they haven\u0027t come home yet. drop down.\" \\n\\n \\n\\n Texas slid down that pillar with alacrity that would have scared a cat. And the two were hiding in the bushes a moment or two later. \\n\\n \\n\\n \"Gee whiz!\" muttered Fischer. \"Just think of the risks we took. They might have come in on us.\" \\n\\n \\n\\n \"Where can they be?\" whispered Texas, anxiously. \"I hadn\u0027t any idea they wouldn\u0027t be in by twelve.\" \\n\\n \\n\\n \"There\u0027s nothing they can be doing around here,\" said Fischer. \"I don\u0027t know——\" \\n\\n \\n\\n \"Look a here!\" muttered Texas, excitedly, as a sudden idea occurred to him. \"I saw \u0027em a-goin\u0027 down to Highland Falls this evenin\u0027, an——\" \\n\\n \\n\\n Fischer gripped him by the arm. \\n\\n \\n\\n \"Jove!\" he cried. \"We\u0027ll go down and lay for \u0027em. It\u0027s a faint chance, but if we catch \u0027em there it\u0027ll be a thousand times less dangerous for us. And if we miss them we can come back. Let\u0027s hurry.\" \\n\\n \\n\\n It was a dangerous business, that getting down to Highland Falls. There were the camp sentries and the sentries of the regular army, besides, patroling most of the paths. And any of them would have stopped those[Pg 171] two rough-looking men if they had seen them skulking about the post. But Fischer had been there three years, and he knew most of the \"ropes.\" He dodged from building to building, always keeping the road in view so as to see their victims if they passed—and finally came out upon the road just at the beginning to cadet limits. Here they hid in a thick clump of bushes and lay down to wait amid the silence of that dark, deserted spot. \\n\\n \\n\\n \"I wonder if they\u0027ll come,\" whispered Texas. \"I wish I had one of \u0027em by the neck. The rascals——\" \\n\\n \\n\\n The words were choked in their utterance; for the officer suddenly nudged his companion and pointed down the road. \\n\\n \\n\\n \"Look!\" \\n\\n \\n\\n That was all he said. Texas turned and glanced as he directed. There were two figures, clearly outlined in the moonlight, walking slowly up the road. \\n\\n \\n\\n \"It\u0027s they,\" whispered Fischer. \"Shall we try it?\" \\n\\n \\n\\n And Texas gripped the two revolvers in his pocket and muttered, \"Yes, we shall!\" \\n\\n \\n\\n The two came nearer and nearer. Out of the black shadows where they lay the cadets stared hard, watching them anxiously, waiting, panting with impatience and excitement. The strangers were slightly built, both of them, and young; Texas recognized one of them plainly. It was Benny Bartlett; that the other was the printer\u0027s[Pg 172] boy, he took for granted. Then suddenly he noticed one of them stagger. \\n\\n \\n\\n \"That solves it,\" whispered Fischer. \"They\u0027ve been down to Cranston\u0027s getting drunk. The beasts!\" \\n\\n \\n\\n That last word cut Texas like a knife; he had been that way not a week ago himself. Texas was slowly learning the civilized view of drunkenness. \\n\\n \\n\\n He forgot that in a few moments more, however. There was excitement, plenty of it, to fill his mind. The pair drew nearer still in the bright moonlight, and the time for their desperate deed was almost upon the cadets. \\n\\n \\n\\n \"For Heaven\u0027s sake don\u0027t let them get away,\" whispered Fischer. \"If they cry out, make a break for camp, and I\u0027ll fix it.\" \\n\\n \\n\\n That word was the last to be spoken; they lay in silence after that, listening to the others. Benny Bartlett, it appeared, was the more hilarious of the two, as such feeble hilarity goes. The other was trying hard to keep him quiet. The bushes that hid the cadets were right beside the road; and as Benny drew near they made out that he was trying to sing. \\n\\n \\n\\n \"We won\u0027t go home till morning; we won\u0027t go——\" \\n\\n \\n\\n \"Shut up, you fool!\" the other muttered, shaking him by no means gently. \"You\u0027ll wake the old man, and——\" \\n\\n \\n\\n The two watchers rose upon their knees. Two re[Pg 173]volvers clicked gently, which made the printer\u0027s boy start in alarm, and then came a subdued \"Now!\" \\n\\n \\n\\n Before the victims could move or utter a sound two stalwart, roughly dressed, black-masked figures sprang out into the road. And the half-drunken pair found themselves gazing into the muzzles of two glistening revolvers. \\n\\n \\n\\n \"Hold up your hands!\" \\n\\n \\n\\n Half dead with terror the printer obeyed; the other sunk in a heap to the ground, his teeth fairly chattering. \\n\\n \\n\\n \"Not a sound!\" was the next gruff order, obeyed equally well; and then the robbers got quickly to work. \\n\\n \\n\\n It was all done so expeditiously that the victims scarcely realized it. One of the men covered the two with his weapons and the other went swiftly through the pockets of both. \\n\\n \\n\\n He did not seem to care for watches or money. It was papers he looked for, and he glanced at what he found with feverish impatience. He had a matchbox in his hand, and he turned away from the party as he struck a light and read one after the other, tossing them aside with an angry exclamation. He searched the printer first and seemed to find nothing. Then he went for Benny, tumbling him about the ground and not forgetting to administer sundry vigorous kicks. \\n\\n \\n\\n He had almost searched Benny, too, without success,[Pg 174] when suddenly he gave an exclamation of joy, an exclamation which almost caused the other to drop his revolvers. The searcher had put his hand into a small, out-of-the-way pocket, and found a bit of carefully folded paper. \\n\\n \\n\\n \"This\u0027ll do it!\" he whispered. \"Come on.\" \\n\\n \\n\\n Texas\u0027 heart began to throb with joy—Texas was the one with the gun. \\n\\n \\n\\n \"Victory! Victory!\" he muttered. \"Wow!\" \\n\\n \\n\\n Ready to shout with excitement at his success he started to follow the other, who was already making for the dense woods at the side of the road. He backed away slowly, still facing the two horrified lads, still leveling his weapons at them. \\n\\n \\n\\n \"Not a sound!\" he muttered gruffly. \"Remember!\" \\n\\n \\n\\n He reached the edge of the shadow in safety, and then suddenly a noise caught his sharp ear. It was not from the two, but from up the road. It was the sound of a horse\u0027s hoofs, accompanied by a jingling of sword and spur. Texas glanced around quickly; it was a horseman trotting up the road, an officer from the cavalry post! And in an instant more Texas had sprung into the woods and was dashing away with all his speed. \\n\\n \\n\\n \"Run, run!\" he whispered to the cadet just in front. \"Somebody\u0027s coming.\" \\n\\n \\n\\n Benny Bartlett had not nerve to give an alarm; but[Pg 175] the printer\u0027s boy had. The fleeing pair heard his voice shouting: \\n\\n \\n\\n \"Help! help! Murder!\" \\n\\n \\n\\n And an instant later came a clatter and thunder of hoofs as the soldier dashed up. \\n\\n \\n\\n \"What\u0027s the matter?\" he cried. \\n\\n \\n\\n \"Robbers!\" shrieked the two. \"We\u0027ve been held up! They ran in there! Help! Help!\" \\n\\n \\n\\n The rescuer wheeled his horse sharply about; he whipped his sword from its scabbard and plunged furiously into the woods. The two heard his horse dashing up, and they knew their danger was great indeed. \\n\\n \\n\\n Texas was flying on ahead, running for his life; but Fischer, who was a good deal the cooler of the two in the emergency, seized him by the arm and forced him into a clump of bushes on one side. \\n\\n \\n\\n \"Lie there!\" he cried. \"S-sh! Not a sound!\" \\n\\n \\n\\n The wisdom of the ruse was apparent. Crashing footsteps gave the officer something to follow; without it he might not find them in the black woods. They heard his horse thrashing about in the underbrush; the man was evidently afraid of nothing even in the darkness, for he plunged through it furiously, riding back and forth and beating the bushes. Once he passed so near to them that Texas heard the sword swish and felt for his revolvers[Pg 176] instinctively. But that was the best the man could do, and finally he gave it up in disgust and rode out to the road again. \\n\\n \\n\\n Then the two highwaymen arose and stole softly away in the darkness, congratulating themselves upon that narrow escape and still more upon their success. \\n\\n \\n\\n When they reached the camp, which they did in a great hurry, for they knew the officer would alarm the post, they passed the sentry in the same way, and separated, Texas hurrying into his own tent. To his amazement he found his tent mates awake and sitting up, for what reason he had no idea. \\n\\n \\n\\n \"What\u0027s the matter?\" he cried anxiously, for he saw at once that something horrible had happened. \\n\\n \\n\\n \"Matter enough!\" cried Mark in just as much anxiety. \"It\u0027s not enough for me to get dismissed, but you have to go to work and get yourself in the same scrape.\" \\n\\n \\n\\n \"I dismissed!\" echoed Texas, in amazement. \"How?\" \\n\\n \\n\\n \"Your absence has been noticed,\" groaned Mark. \"Lieutenant Allen has ordered an inspection of the tent every half hour until you return. They\u0027ve been here twice now, and you\u0027re a goner. And what makes it ten thousand times worse, I know it\u0027s on account of me. You\u0027ve been doing something to clear me.\" \\n\\n \\n\\n All this was said in about as lugubrious a tone as one[Pg 177] could well imagine. But as for Texas, he merely chuckled as if he didn\u0027t care in the least. \\n\\n \\n\\n \"I reckon it\u0027ll be all right,\" he chuckled, as he began to shed his \"cits\" clothing. \"Jes\u0027 you fellers go to bed an\u0027 be good. I reckon it\u0027ll all come out all right. Good-night.\" \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3246/88974.html","bookId":641,"book":{"id":641,"title":"On Guard","description":"简介： The speaker was a tall, handsome lad, a plebe at the West Point Military Academy. At the moment he was gazing inquiringly out of the tent door at a small orderly....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3246","creation":"Aug 1, 2019 12:19:05 AM","modification":"Aug 1, 2019 12:19:05 AM"}}
