{"id":90724,"no":11,"title":"Page 11","content":"HAUNTED SHARK It is not easy getting an old ghost in a shark suit underneath the edge of a tent, but we did it. We crept around the back of the mushroom sheds to get to the tent since I thought that people might notice a shark walking around. On the way I had told Sir Horace, \"When someone with a really annoying squeaky voice calls you Dad, you have to pretend that is who you are. You are Dad. Got that? And then you have to tell her that Wanda and I are running the show. Okay?\" Sir Horace did not say anything for a bit and then he said, \"Why?\" \"Because that is a really important part of my plan. Trust me. \" Wanda snorted like a pig, but I ignored her as I was too busy pushing Sir Horace under- neath the tent. The tent was empty except for Nosy Nora, who was hanging around beside the big fish tank looking worried. Outside the crowd was getting impatient to come in--the Fish Frolics Show was already twenty minutes late. You could hear babies crying, children squealing, and people grumbling to each other. I gave Sir Horace a push and said, \"Just go and stand by the fish tank. Remember you are called Dad. Okay?\" I think Sir Horace nodded but it was hard to tell. But as he floated off toward the fish tank Nosy Nora yelled, \"Hey, Dad! Where have you been?\" \"Come on, Wanda, \" I said. \"Let\u0027s leave him to it. We\u0027ve got to find Aunt Tabby and Brenda and sort them out now. \" And I pushed her back outside. We found Aunt Tabby and Brenda in Squid Caf talking with Vera and Mabel. Aunt Tabby was holding our hats and she looked really irritated. Vera and Mabel did not look happy. Brenda zoomed in on Wanda. \"Where have you been? You\u0027re covered in mud and spider- webs. \" I could see a handkerchief moment coming on. Sure enough, Brenda fished out a big pink hanky, spat on it, and started rubbing at Wanda\u0027s face. \"Mo-om, \" said Wanda in a muffled way, and wriggled out of Brenda\u0027s grasp. \"Don\u0027t. \" Wanda did not tell Brenda where we had been, which was good. I thought Wanda\u0027s training was going quite well, as when she had first come to Spookie House she used to tell Brenda everything we did, which had led to a lot of Aunt Tabby trouble. However, I could see we were heading straight for Aunt Tabby trouble here. \"Ara- minta, \" she said sternly. \"I have bought your hats back. If you need extra spending money you should ask me. I can\u0027t believe how much you made Vera and Mabel pay for these. \" \"Oh, but we wanted to, \" said Vera--or was it Mabel? \"Oh yes, we really did, \" said Mabel--or was it Vera? I got out my detective notebook. \"I can take an order for more, \" I said. \"No, Araminta, you can\u0027t, \" said Aunt Tabby. \"Oh please, \" said Mabel--or was it Vera-- \"we would love to order some more. \" \"How many would you like?\" I asked before Aunt Tabby could say anything. \"We\u0027ll have two of each, \" said Mabel/Vera. \"So that there\u0027s no fighting, \" giggled Vera/Mabel. \"I will give your order to our resident knit- ter, \" I told them. \"It will be ready in two weeks. \" \"Araminta, really . . . \" Aunt Tabby said very faintly. But she didn\u0027t say anything else. Suddenly Nosy Nora\u0027s squeaky voice came over the loudspeakers. \"Ladies and gentlemen, please make your way to the Water Wonder- land tent where the world-famous Fish Frolics Show is about to begin!\" The loudspeaker did a horrible high-pitched squeak and everyone winced. Then we all heard Nora say, \"What was that, Dad? I can\u0027t hear what you\u0027re saying. What? Are you sure?\"There was a silence, then the loudspeaker came on again. \"Um. Would Wanda Wizzard and Araminta Spookie please make their way to the big tent as soon as pos- sible. Dad--are you sure?\" Then there was a crackle and the loudspeaker went dead. \"We\u0027ve got to go, \" I told Aunt Tabby. \"They can\u0027t start without us. Come on, Wanda. \" \"You are not going anywhere without your hats, \" said Aunt Tabby. \"At least then I can keep an eye on you. Put them on. \" There was no time to waste arguing over hats. I stuffed my squid hat on and Wanda crammed on her fish hat and we zoomed off into the crowd. Nosy Nora was not pleased to see us. \"You keep getting me into trouble, \" she said. \"Did you know there are two old ladies wearing hats just like yours? I chased them all the way to Squid Caf and nearly got trapped by your creepy aunt. \" \"Really?\" I said. \"What a coincidence. \" Nosy Nora looked at me like I was one of those horrible suckerfish stuck on the side of that tank. \"Anyway, \" she said, \"I don\u0027t know why Dad wants you to help, \" she said grumpily. \"He\u0027s not thinking straight. He sounds like he\u0027s got a cold or something. \" \"I expect he thinks you can\u0027t do it all n your own, \" I said. \"There\u0027s not exactly a lot to do anyway, \" said Nora sulkily. \"It\u0027s only the stupid frogs and then Dad does the shark thing and splashes everyone and then they all go home. \" \"I\u0027ll do the frogs, \" Wanda piped up. \"Oh all right, \" said Nora. \"They\u0027re nasty, slimy things anyway. \" She picked up the red frog bucket and handed it to Wanda. Wanda grabbed the bucket. \"I\u0027ve got the fro-ogs, I\u0027ve got the fro-ogs!\" she sang and did a weird Wanda-dance around in circles. That was a mistake. She blew our cover. One thing a detective should never do is blow her cover. It leads to trouble. Nosy Nora looked suspicious--very suspi- cious. \"What\u0027s going on?\u0027 she asked. \"Don\u0027t ask me, \" said the shark, peering out from behind the big striped curtain at the back of the tank. \"Shh, \" I told Sir Horace--but it was too late. Nora stared at me. \"I don\u0027t believe it is Dad under there, \" she said. \"I\u0027ve heard all about you, Araminta Spookie, and I think you are fibbing. \" \"But--\" I said. I was going to tell her that I had never said it was Old Morris in the shark suit, but Nosy Nora wasn\u0027t listening. \"I think it\u0027s your creepy aunt in there. It\u0027s just the kind of weird thing she\u0027d do. I\u0027m going to look!\" \"No, its not Aunt--\" But it was too late. Nora unzipped the shark suit and went pale. \"There\u0027s no one there!\" she yelled. \"It\u0027s haunted!\" \"That\u0027s right, \" I told her since, whatever anyone may think, I do not tell fibs. \"Where\u0027s my dad?\" she yelled. \"What have you done with him?\" We didn\u0027t say anything. \"I\u0027ll find him! I\u0027ll find him and then you\u0027ll be sorry!\" Nosy Nora raced over to the tent flaps and threw them open. An excited mur- mur went up from the people waiting to come in. \"You do the show, you and your horrible spooky shark--since you\u0027re so smart!\" Nora shouted and she disappeared into the crowd. Before Wanda and I had time to think, everyone rushed in and started fighting over the best seats. Aunt Tabby and Brenda won, along with Mabel and Vera, who plonked themselves down right in front of the fish tank. That was bad enough, but I couldn\u0027t believe my eyes when right behind them I saw NurseWatkins and Uncle Drac. How did they get there? But I didn\u0027t have time to think about that for long. Soon everyone was sitting down and a horrible hush came over the tent. A whole forest of eyes stared at us like they expected us to do something. \"What are we going to dooooo?\" wailed Wanda under her breath. There was only one thing we could do-- the all-new Spookie Shark Show.","sourceLink":"https://allnovel.net/frognapped-araminta-spook-3/page-11.html","bookId":2804,"book":{"id":2804,"title":"Frognapped (Araminta Spook #3)","description":"Storyline: Frognapped (Araminta Spook #3) When something\u0027s amiss in Spookie House, there\u0027s usually only one person to blame--Araminta. But this time she had nothing to do with the disappearance of Barry Wizzard\u0027s frogs, and she is determined to find them. Of course, it\u0027s not going to be that easy, especially when dealing with a crazy character named Old Morris, a dangerous shark, and a demanding aquarium show audience. Can Araminta find the frogs and steal the show?","cover":"https://allnovel.net/images/frognapped-araminta-spook-3.jpg","author":"Angie Sage","type":"Humorous","source":"allnovel","link":"https://allnovel.net/frognapped-araminta-spook-3.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:44:16 PM"}}
