{"id":93857,"no":4,"title":"Page 4","content":"Trisha bolted along the strip where the needle-coated floor of the forest gave way to the bald rock marking the edge of the cliff. She ran with some confused and roaring knowledge of what had almost happened to her, and also some vague memory of a science fiction movie in which the hero had lured a rampaging dinosaur into running over a cliff to its death.\n Ahead of her an ash tree had fallen with its final twenty feet jutting over the drop like the prow of a ship, and Trisha grabbed it with both arms and hugged it, her scraped and bloody cheek jammed against the smooth trunk, each breath whistling into her with a shriek and emerging in a terrified sob. She stood that way for a long time, shuddering all over and embracing the tree. At last she opened her eyes.\n Her head was turned to the right and she was looking down before she could stop herself.\n At this point the cliff\u0027s drop was only fifty feet, ending in a pile of glacial, splintery rubble that sprouted little clumps of bright green bushes. There was a heap of rotting trees and branches, as well - deadwood blown over the cliff\u0027s edge in some long-ago storm. An image came to Trisha then, one that was terrible in its utter clarity. She saw herself falling toward that jackstraw pile, screaming and waving her arms as she went down; saw a dead branch punching through the undershelf of her jaw and up between her teeth, tacking her tongue to the roof of her mouth like a red memo, then spearing into her brain and killing her.\n \"No!\" she screamed, both revolted by the image and ter-rified by its plausibility. She caught her breath.\n \"I\u0027m all right,\" she said, speaking low and fast. The bramble-scratches on her arms and the scrape on her cheek throbbed and stung with sweat - she was just now becom-ing aware of these little hurts. \"I\u0027m okay. I\u0027m all right. Yeah, baby.\" She let go of the ash tree, swayed on her feet, then clutched it again as panic lunged inside her head. An irra-41 tional part of her actually expected the ground to tilt and spill her off the edge.\n \"I\u0027m okay,\" she said, still low and fast. She licked her upper lip and tasted damp salt. \"I\u0027m okay, I\u0027m okay.\" She repeated it over and over, but it was still three minutes before she could persuade her arms to loosen their death-clutch on the ash tree a second time. When she finally man-aged it, Trisha stepped back, away from the drop. She reset her cap (turning it around so the bill pointed backward without even thinking about it) and looked out across the valley. She saw the sky, now sagging with rainclouds, and she saw roughly six trillion trees, but she saw no sign of human life - not even smoke from a single campfire.\n \"I\u0027m all right, though - I\u0027m okay.\" She took another step back from the drop and uttered a little scream as something (snakes snakes) brushed the backs of her knees. Just bushes, of course.\n More checkerberry bushes, the woods were full of em, yuck-yuck.\n And the bugs had found her again. They were re-forming their cloud, hundreds of tiny black spots dancing around her eyes, only this time the spots were bigger and seemed to be bursting open like the blooms of black roses.\n Trisha had just time enough to think, I\u0027m fainting, this is fainting, and then she went down on her back in the bushes, her eyes rolled up to whites, the bugs hanging in a shim-mering cloud above her small pallid face. After a moment or two the first mosquitoes alit on her eyelids and began to feed.\n Top of the Fourth\n HER MOTHER was moving furniture - that was Trisha\u0027s first returning thought. Her second was that Dad had taken her to Good Skates in Lynn and what she heard was the sound of kids rollerblading past on the old canted track. Then something cold splashed onto the bridge of her nose and she opened her eyes. Another cold drop of water splashed down dead center on her forehead. Bright light ran across the sky, making her wince and squint. This was followed by a sec-ond crash of thunder that startled her into a sideways roll.\n She pulled instinctively into a fetal position, uttering a croaky little scream as she did so. Then the skies opened.\n Trisha sat up, grabbing and replacing her baseball cap when it fell off without even thinking about it, gasping like someone who has been tossed rudely into a cold lake (and that was what it felt like). She staggered to her feet. Thun-der boomed again and lightning opened a purple seam in the air. As she stood with rain dripping from the tip of her nose and her hair lying lank against her cheeks, she saw a tall, half-dead spruce on the valley floor below her suddenly 43. explode and fall in two flaming pieces. A moment later the rain was sheeting down so thickly that the valley was only a sketched ghost wrapped in gray gauze.\n She backed up, getting into the cover of the woods again.\n She knelt, opened her pack, and got out the blue poncho.\n She put it on (better late than never, her father would have said) and sat on a fallen tree. Her head was still woozy and her eyelids were all swollen and itchy. The surrounding woods caught some of the rain but not all of it; the down-pour was too fierce. Trisha flipped up the poncho\u0027s hood and listened to the drops tap on it, like rain on the roof of a car.\n She saw the ever-present cloud of bugs dancing in front of her eyes and waved at them with a strengthless hand. Noth-ing makes them go away and they\u0027re always hungry, they fed on my eyelids when I was passed out and they\u0027ll feed on my dead body, she thought, and began to cry again. This time it was low and dispirited. As she wept she continued waving at the bugs, cringing each time the thunder roared overhead.\n CHAPTER 3\n With no watch and no sun there was no time. All Trisha knew was that she sat there, a small figure in a blue poncho huddled on a fallen tree, until the thunder began to fade eastward, sounding to her like a vanquished but still trucu-lent bully. Rain dripped down on her. Mosquitoes hummed, one caught between the inside wall of her poncho\u0027s hood and the side of her head. She jabbed a thumb against the outside of the hood and the hum abruptly stopped.\n \"There,\" she said disconsolately. \"That takes care of you, you\u0027re jam.\" She started to get up and her stomach rum-bled.\n She hadn\u0027t been hungry before but she was now. The thought that she had been lost long enough to get hungry was awful in its own way. She wondered how many more awful things were waiting and was glad she didn\u0027t know, couldn\u0027t see. Maybe none, she told herself. Hey, girl, get happy - maybe all the awful things are behind you now.\n Trisha took off her poncho. Before opening her pack, she looked ruefully down at herself. She was wet from head to toe and covered with pine needles from her faint - her very first fainting spell. She would have to tell Pepsi, always assuming she ever saw Pepsi again.\n \"Don\u0027t start that,\" she said, and unbuckled the pack\u0027s flap.\n She took out the stuff she had brought to eat and drink, lay-ing the items out before her in a neat line. At the sight of the paper sack with her lunch in it, her stomach rumbled more fiercely. How late was it? Some deep mental clock attached to her metabolism suggested it might be around three in the afternoon, eight hours since she\u0027d sat in the breakfast nook slurping up Corn Flakes, five since she\u0027d started off on this endless idiotic shortcut. Three o\u0027clock. Maybe even four.\n In her lunch-sack was a hardboiled egg still in the shell, a tuna fish sandwich, and some celery sticks. There was also the bag of chips (small), the bottle of water (pretty big), the bottle of Surge (the large twenty-ounce size, she loved Surge), and the Twinkies.\n Looking at the bottle of lemon-lime soda, Trisha sud-denly felt more thirsty than hungry... and mad for sugar.\n She spun off the cap, brought the bottle to her lips, then paused. It wouldn\u0027t be smart to go chugging half of it down, she thought, thirsty or not. She might be out here awhile. Part of her mind moaned and tried to draw away from that idea, just call it ridiculous and draw away, but Trisha couldn\u0027t afford to let it. She could think like a kid again once she was out of the woods, but for the time being she had to think as much like an adult as possible.\n You saw what\u0027s out there, she thought, a big valley with noth-45 ing in it except trees. No roads, no smoke. You have to play it smart.\n You have to conserve your supplies. Mom would tell you the same thing and so would Dad.\n She allowed herself three big gulps of soda, took the bot-tle away from her mouth, belched, took another two fast swallows. Then she recapped the bottle securely and debated over the rest of her supplies.\n She decided on the egg. She shelled it, careful to put the pieces of shell back in the Baggie the egg had come in (it never occurred to her, then or later, that littering - any sign that she\u0027d been there - might actually save her life), and sprinkled it with the little twist of salt. Doing that made her sob briefly again, because she could see herself in the Sanford kitchen last night, putting salt on a scrap of waxed paper and then twisting it up the way her mother had shown her.\n She could see the shadows of her head and hands, thrown by the overhead light, on the Formica counter; she could hear the sound of the TV news from the living room; could hear creaks as her brother moved around upstairs. This memory had a hallucinogenic clarity that elevated it almost to the status of a vision. She felt like someone who drowns remem-bering what it was like to still be on the boat, so calm and at ease, so carelessly safe.\n She was nine, though, nine going on ten and big for her age. Hunger was stronger than either memory or fear. She sprinkled the egg with salt and ate it quickly, still sniffling.\n It was delicious. She could have eaten another easily, maybe two. Mom called eggs \"cholesterol bombs,\" but her Mom wasn\u0027t here and cholesterol didn\u0027t seem like a very big deal when you were lost in the woods, scratched up and with your eyelids so swollen by bug-bites that they felt weighted down with something (flour-paste stuck to the lashes, perhaps).\n Trisha eyed the Twinkies, then opened the package and ate one of them. \"SECK-shoo-al,\" she said - one of Pepsi\u0027s all-timegreat compliments. She chased everything with a gulp of water. Then, moving quickly before either hand could turn traitor and stuff something else into her mouth, she put the remaining food back in the lunch-sack (the top rolled down quite a bit further now), rechecked the seal on her three-quarter-full bottle of Surge, and stowed everything in the pack. As she did, her fingers brushed a bulge in the pack\u0027s sidewall and a sudden burst of elation - perhaps par-tially fueled by fresh calories - lit her up.\n Her Walkman! She had brought her Walkman! Yeah, baby!\n She unzipped the inner pocket and lifted it out as rever-ently as any priest has ever handled the eucharist. The head-phone wire was wrapped around the body of the Walkman and the tiny earbuds were clipped neatly to the sides of its black plastic body. Her and Pepsi\u0027s current favorite tape (Tubthumper, by Chumbawamba) was in there, but Trisha didn\u0027t care about music just then. She slipped the head-phones on, nestled the earbuds into place, flipped the switch from TAPE to RADIO, and turned it on.\n At first there was nothing but a soft rush of static, because she had been tuned to WMGX, a Portland station.\n But a little further down the FM band she came to WOXO in Norway, and when she tuned up the other way she got WCAS, the little station in Castle Rock, a town they had passed through on their way to the Appalachian Trail. She could almost hear her brother, his voice dripping with that newly discovered teenage sarcasm of his, saying something like \"WCAS! Hicksville today, tomorrow the world!\" And it was a Hicksville station, no doubt about that. Whiny cowboy singers like Mark Chestnutt and Trace Adkins alternated with a female announcer who took calls from people who wanted to sell washers, dryers, Buicks, and hunting rifles.\n Still, it was human contact, voices in the wilderness, and Trisha sat on the fallen tree, transfixed, waving absently at the constant cloud of bugs with her cap. The first time-check she heard was three-oh-nine.\n At three thirty, the female announcer put the Commu-nity Trading Post on hold long enough to read the local news. Folks in Castle Rock were up in arms about a bar where there were now topless dancers on Friday and Satur-day nights, there had been a fire at a local nursing home (no one hurt), and Castle Rock Speedway was supposed to re-open on the Fourth of July with brand-new stands and loads of fireworks. Rainy this afternoon, clearing tonight, sunny tomorrow with highs in the mid-eighties. That was it. No missing little girl. Trisha didn\u0027t know whether to be relieved or worried.\n She reached to turn off the power and save the batteries, then paused as the female announcer added, \"Don\u0027t forget that the Boston Red Sox take on those pesky New York Yankees tonight at seven o\u0027clock; you can catch all the action right here on WCAS, where we\u0027ve got our Sox on.\n And now back to - \"\n Now back to the shittiest day a little girl ever had, Trisha thought, turning off the radio and wrapping the cord around the slim plastic body again. Yet the truth was that she felt almost all right for the first time since that nasty minnow had started swimming around in her midsection.\n Having something to eat was partially the reason, but she suspected that the radio had more to do with it. Voices, real human voices, and sounding so close.\n There was a cluster of mosquitoes on each of her thighs, trying to drill through the material of her jeans. Thank God she hadn\u0027t worn shorts. She would have been chuck steak by now.\n She swatted the mosquitoes away, then got up. What now? Did she know anything at all about being lost in the woods? Well, that the sun rose in the east and went down in the west; that was about all. Once someone had told her that moss grew on the north or south side of a tree, but she couldn\u0027t remember which. Maybe the best thing would be just to sit here, try to make some sort of shelter (more against the bugs than the rain, there were mosquitoes inside the hood of her poncho again and they were driving her crazy), and wait for someone to come. If she had matches, maybe she could make a fire - the rain would keep it from spreading - and someone would see the smoke. Of course, if pigs had wings, bacon would fly. Her father said that.\n \"Wait a minute,\" she said. \"Wait a minute.\"\n Something about water. Finding your way out of the woods by water. Now what - ?\n It came to her, and she felt another burst of elation. This one was so strong that it made her feel almost giddy; she actually swayed a little on her feet, as one will at the sound of catchy music.\n You found a stream. Her mother hadn\u0027t told her that, she had read it in one of the Little House books a long time ago, maybe way back when she\u0027d been seven. You found a stream and followed it and sooner or later it would either lead you out or to a bigger stream. If it was a bigger stream, you followed it until it led you out or to a bigger stream yet.\n But in the end running water had to lead you out because it always ran to the sea, and there were no woods there, only the beach and rocks and the occasional lighthouse. And how would she find running water? Why, she would follow the bluff, of course. The one she had almost run off the edge of, stupidnik that she was. The bluff would lead her in one steady direction, and sooner or later she\u0027d find a brook. The woods were full of em, as the saying went. \n","sourceLink":"https://allnovel.net/the-girl-who-loved-tom-gordon/page-4.html","bookId":2578,"book":{"id":2578,"title":"The Girl Who Loved Tom Gordon","description":"Storyline: \n Nine-year-old Trisha McFarland strays from the path while she and her recently divorced mother and brother take a hike along a branch of the Appalachian Trail. Lost for days, wandering farther and farther astray, Trisha has only her portable radio for comfort. A huge fan of Tom Gordon, a Boston Red Sox relief pitcher, she listens to baseball games and fantasizes that her hero will save her. Nature isn\u0027t her only adversary, though - something dangerous may be tracking Trisha through the dark woods.\n \n","cover":"https://allnovel.net/images/the-girl-who-loved-tom-gordon.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-girl-who-loved-tom-gordon.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:04:15 PM"}}
