{"id":110813,"no":7,"title":"Page 7","content":"I bolted upright, every part of me awake and alert. There were no city lights to shine through the window, and it took me several seconds to make out anything in the darkened room. Sydney was curled up in her own bed, her face unusually at peace as she slept.\\n\\n Where was the Strigoi? Definitely not in our room. Was it in the house? Everyone had said the road to Dimitri\u0027s town was dangerous. Still, I would have thought Strigoi would be going after Moroi and dhampirs-though humans were a big part of their diet too. Thinking of the nice couple who\u0027d welcomed us into their home, I felt something tight clench in my chest. No way would I let anything happen to them.\\n\\n Slipping quietly out of the bed, I grabbed a hold of my stake and crept from the room without disturbing Sydney. No one else was awake, and as soon as I was in the living room, the nausea went away. Okay. The Strigoi wasn\u0027t inside, which was a good thing. It was outdoors, apparently on the side of the house near my room. Still moving silently, I went out the house\u0027s front door and walked around the corner, as quiet as the night around me.\\n\\n The nausea grew stronger as I approached the barn, and I couldn\u0027t help but feel smug. I was going to surprise this Strigoi who\u0027d thought it could sneak into a tiny human village for dinner. There. Right near the barn\u0027s entrance, I could see a long shadow moving. Gotcha, I thought. I readied the stake and started to spring forward-And then something struck me on the shoulder.\\n\\n I stumbled, astonished, and looked into the face of a Strigoi. Out of the corner of my eye, I saw the shadow by the barn materialize into another Strigoi striding forward. Panic shot through me. There were two, and my secret detection system hadn\u0027t been able to tell the difference. Worse, they\u0027d gotten the drop on me.\\n\\n A thought immediately flashed into my mind: What if one\u0027s Dimitri?\\n\\n It wasn\u0027t. At least, this close one wasn\u0027t. It was a woman. I had yet to get a feel for the second one. That one was approaching from my other side, moving fast. I had to deal with this immediate threat, though, and swiped at the woman with my stake, hoping to wound her, but she dodged so quickly, I hardly saw her move. She struck out toward me in an almost casual way. I wasn\u0027t fast enough to react and went flying toward the other Strigoi-a guy who was not Dimitri.\\n\\n I responded quickly, leaping up and kicking him. I held the stake out, creating distance between us, but it did little good when the woman came up from behind and grabbed me, jerking my body against hers. I gave a muffled cry and felt her hands on my throat. She was probably going to break my neck, I realized. It was a fast, easy technique for Strigoi that then let them drag off a victim for feeding.\\n\\n I struggled, jostling her hands slightly, but as the other Strigoi leaned over us, I knew it was useless. They\u0027d surprised me. There were two of them.\\n\\n They were strong.\\n\\n Panic surged in me again, an overwhelming sense of fear and desperation. I was afraid every time I fought Strigoi, but this fear was reaching a breaking point. It was unfocused and out of control, and I suspected it was touched by a bit of the madness and darkness I\u0027d absorbed from Lissa.\\n\\n The feelings exploded within me, and I wondered if they\u0027d destroy me before the Strigoi did. I was in very real danger of dying here-of letting Sydney and the others get killed. The rage and distress of that thought were smothering.\\n\\n Then, suddenly, it was like the earth burst open. Translucent forms, glowing softly in the darkness, sprang up everywhere. Some looked like normal people. Others were horrible, their faces gaunt and skull-like. Ghosts. Spirits. They surrounded us, their presence making my hair stand on end and sending a splitting headache through my skull.\\n\\n The ghosts turned toward me. I\u0027d had this happen before, on a plane, when apparitions had swarmed and threatened to consume me. I braced myself, trying desperately to summon up the strength to build barriers that would shut me off from the spirit world. It was a skill I\u0027d had to learn, one I usually kept in place without any effort. The desperation and panic of this situation had cracked my control. In that horrible, blood-curdling moment, I again selfishly wished Mason hadn\u0027t found peace and left this world. I would have felt better if his ghost were here.\\n\\n Then I realized I wasn\u0027t their target.\\n\\n The ghosts were mobbing the two Strigoi. The spirits didn\u0027t have solid forms, but every place they touched and passed through me felt like ice. The female Strigoi immediately began waving her arms to fend the apparitions off, snarling in rage and something almost like fear. The ghosts didn\u0027t appear to be able to hurt the Strigoi, but they were apparently pretty annoying-and distracting.\\n\\n I staked the male Strigoi before he ever saw me coming. Immediately, the ghosts around him moved to the woman. She was good, I\u0027d give her that. Despite struggling to fend the spirits off, she was still able to dodge my attacks fairly well. A lucky punch from her made stars burst before my eyes and sent me into the barn wall. I still had that ghost-induced splitting headache, and my head slamming into the barn didn\u0027t help. Staggering up, dizzy, I made my way back to her and continued my efforts to get a shot in at her heart. She managed to keep her chest out of my range-at least until one particularly terrifying ghost caught her off guard. Her momentary distraction gave me my chance, and I staked her, too. She fell to the ground-leaving me alone with the spirits.\\n\\n With the Strigoi, the ghosts had clearly wanted to attack them. With me, it was a lot like on the plane. They seemed fascinated by me, desperate to get my attention. Only, with dozens of phantoms swarming, it might as well have been an attack.\\n\\n Desperately, I tried again to summon my walls, to block the ghosts off from me as I\u0027d done long ago. The effort was excruciating. Somehow, my out-of-control emotions had brought the spirits, and while I was calmer now, that control was harder to bring about. My head continued throbbing.\\n\\n Gritting my teeth, I focused every ounce of my strength into blocking out the ghosts.\\n\\n \"Go away,\" I hissed. \"I don\u0027t need you anymore.\"\\n\\n For a moment, it looked like my efforts were going to be useless. Then, slowly, one by one, the spirits began to fade. I felt the control I\u0027d learned before gradually slip into place. Soon, there was nothing there but me, the darkness, and the barn-and Sydney.\\n\\n I noticed her just as I collapsed to the ground. She was running out of the house in her pajamas, face pale. Kneeling at my side, she helped me sit up, legitimate fear all over her. \"Rose! Are you okay?\"\\n\\n I felt like every scrap of energy in my brain and body had been sucked out. I couldn\u0027t move. I couldn\u0027t think.\\n\\n \"No,\" I told her.\\n\\n And then I passed out.\\n\\n I dreamed of Dimitri again, his arms around me and beautiful face leaning over me to care for me as he\u0027d done so often when I was sick. Memories of things past came to me, the two of us laughing over some joke. Sometimes, in these dreams, he\u0027d carry me away. Sometimes, we\u0027d be riding in a car. Occasionally, his face would start to take on that fearsome Strigoi image that always tormented me. Then I\u0027d quickly order my mind to brush such thoughts away.\\n\\n Dimitri had taken care of me so many times and had always been there when I needed him. It had gone both ways, though. Admittedly, he had not seemed to end up in the infirmary as much as me. That was just my luck. Even when he was injured, he wouldn\u0027t acknowledge it. And as I dreamed and hallucinated, images came to me of one of the few times I\u0027d been able to take care of him.\\n\\n Just before the school had been attacked, Dimitri had been involved in a number of tests with me and my fellow novices to see how well we reacted to surprise assaults. Dimitri was so tough that he was almost impossible to beat, though he still got bruised up a number of times. I\u0027d run into him in the gym once during these tests, surprised to see a cut on his cheek. It was hardly fatal, but there was a fair amount of blood showing.\\n\\n \"Do you realize you\u0027re bleeding to death?\" I\u0027d exclaimed. It was kind of an exaggeration, but still.\\n\\n He touched his cheek absentmindedly and seemed to notice the injury for the first time. \"I wouldn\u0027t quite go that far. It\u0027s nothing.\"\\n\\n \"It\u0027s nothing until you get an infection!\"\\n\\n \"You know that\u0027s not likely,\" he said obstinately. That was true. Moroi-aside from contracting the occasional rare disease, as Victor had-hardly ever got sick. We dhampirs had inherited that from them, just as Sydney\u0027s tattoo gave her some protection. Nonetheless, I wasn\u0027t about to let Dimitri bleed all over.\\n\\n \"Come on,\" I said, pointing to the small bathroom in the gym. My voice had been fierce, and to my surprise, he\u0027d actually obeyed.\\n\\n After wetting a washcloth, I gently cleaned his face. He continued protesting at first but finally fell quiet. The bathroom was small, and we were just a few inches from each other. I could smell his clean, intoxicating scent and studied every detail of his face and strong body. My heart raced in my chest, but we were supposed to be on good behavior, so I tried to appear cool and collected. He was eerily calm too, but when I brushed his hair back behind his ears to clean the rest of his face, he flinched. My fingertips touching his skin had sent shock waves through me, and he\u0027d felt them too. He caught hold of my hand and pulled it away.\\n\\n \"Enough,\" he said, voice husky. \"I\u0027m fine.\"\\n\\n \"Are you sure?\" I asked. He hadn\u0027t released my hand. We were so, so close. The small bathroom seemed ready to burst with the electricity building between us. I knew this couldn\u0027t last but hated to let go of him. God, it was hard being responsible sometimes.\\n\\n \"Yes,\" he said. His voice was soft, and I knew he wasn\u0027t mad at me. He was afraid, afraid of how little it would take to ignite a fire between us. As it was, I was warm all over, just from the feel of his hand. Touching him made me feel complete, like the person I was always meant to be. \"Thank you, Roza.\"\\n\\n He released my hand, and we left, both off to do our own things that day. But the feel of his skin and hair stayed with me for hours afterward...\\n\\n I don\u0027t know why I dreamed that memory after being attacked near the barn. It seemed weird that I\u0027d dream of taking care of Dimitri when I was the one who needed care. I guess it didn\u0027t really matter what the memory was, so long as it involved him. Dimitri always made me feel better, even in my dreams, giving me strength and resolve.\\n\\n But as I lay in that delirium and moved in and out of consciousness, his comforting face would occasionally take on those terrible red eyes and fangs. I\u0027d whimper, fighting hard to push that sight away. Other times, he didn\u0027t look like Dimitri at all. He\u0027d turn into a man I didn\u0027t know, an older Moroi with dark hair and cunning eyes, gold jewelry glinting on his neck and ears. I\u0027d cry out for Dimitri again, and eventually, his face would return, safe and wonderful.\\n\\n At one point, though, the image shifted again, this time into a woman\u0027s. Clearly, she wasn\u0027t Dimitri, but there was something about her brown eyes that reminded me of him. She was older, in her forties maybe, and a dhampir. She laid a cool cloth across my forehead, and I realized I wasn\u0027t dreaming anymore. My body ached, and I was in an unfamiliar bed, in an unfamiliar room. No sign of the Strigoi. Had I dreamed them, too? \"Don\u0027t try to move,\" the woman said with the faintest trace of a Russian accent. \"You took some bad hits.\"\\n\\n My eyes widened as the events by the barn came back to me, the ghosts I\u0027d summoned up. It hadn\u0027t been a dream. \"Where\u0027s Sydney? Is she okay?\"\\n\\n \"She\u0027s fine. Don\u0027t worry.\" Something in the woman\u0027s voice told me I could believe her.\\n\\n \"Where am I?\"\\n\\n \"In Baia.\"\\n\\n Baia, Baia. Somewhere, in the back of my head, that name was familiar. All of a sudden, it clicked. Long, long ago, Dimitri had said it. He\u0027d only ever mentioned his town\u0027s name once and, even though I\u0027d tried, I had never been able to remember it. Sydney would never tell me the name. But now we were here. Dimitri\u0027s home.\\n\\n \"Who are you?\" I asked.\\n\\n \"Olena,\" she said. \"Olena Belikova.\" \\n\\n","sourceLink":"https://allnovel.net/blood-promise-vampire-academy-4/page-7.html","bookId":2063,"book":{"id":2063,"title":"Blood Promise (Vampire Academy #4)","description":"Storyline: Vampire Academy Series 4: Blood Promise \\n The heart of the story focuses on the hero Rose Hathaway\u0027s journey to fulfill the promise she made to herself and Dimitri. During this journey, Rose finds herself in situations she would never have imagined--mob-like characters whose intentions are ambiguous, other aspects of Moroi life she was not privvy to, along with her first encounter with a dhampir commune, meeting other dhampirs with a vendetta like her, and finally, her heart stopping confrontation with Dimitri. No spoilers will be given, for that would take away at the amazing story Mead has created, but rest assured, you have seen absolutely nothing yet. \\n The novel was a mind-blowing experience full of amazing adventures and action that showed no signs of letting up at any point during the reading. Richelle Mead\u0027s writing has grown more sophisticated and despite the dark setting is full of humor and will make you race through the pages, leaving yourself blinking at the last page wondering where all the time went.\\n","cover":"https://allnovel.net/images/blood-promise-vampire-academy-4.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/blood-promise-vampire-academy-4.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:04:26 AM"}}
