{"id":2253,"no":34,"title":"Chapter 34 Thanksgiving","content":"It was actually all Sergeant Knight’s fault that Yossarian busted Nately in the nose on Thanksgiving Day, aftereveryone in the squadron had given humble thanks to Milo for providing the fantastically opulent meal on whichthe officers and enlisted men had gorged themselves insatiably all afternoon and for dispensing like inexhaustiblelargess the unopened bottles of cheap whiskey he handed out unsparingly to every man who asked. Even beforedark, young soldiers with pasty white faces were throwing up everywhere and passing out drunkenly on theground. The air turned foul. Other men picked up steam as the hours passed, and the aimless, riotous celebrationcontinued. It was a raw, violent, guzzling saturnalia that spilled obstreperously through the woods to the officers’\\n\\n 　　club and spread up into the hills toward the hospital and the antiaircraft-gun emplacements. There were fist fightsin the squadron and one stabbing. Corporal Kolodny shot himself through the leg in the intelligence tent whileplaying with a loaded gun and had his gums and toes painted purple in the speeding ambulance as he lay on hisback with the blood spurting from his wound. Men with cut fingers, bleeding heads, stomach cramps and brokenankles came limping penitently up to the medical tent to have their gums and toes painted purple by Gus andWes and be given a laxative to throw into the bushes. The joyous celebration lasted long into the night, and thestillness was fractured often by wild, exultant shouts and by the cries of people who were merry or sick. Therewas the recurring sound of retching and moaning, of laughter, greetings, threats and swearing, and of bottlesshattering against rock. There were dirty songs in the distance. It was worse than New Year’s Eve.\\n\\n 　　Yossarian went to bed early for safety and soon dreamed that he was fleeing almost headlong down an endlesswooden staircase, making a loud, staccato clatter with his heels. Then he woke up a little and realized someonewas shooting at him with a machine gun. A tortured, terrified sob rose in his throat. His first thought was thatMilo was attacking the squadron again, and he rolled of his cot to the floor and lay underneath in a trembling,praying ball, his heart thumping like a drop forge, his body bathed in a cold sweat. There was no noise of planes.\\n\\n 　　A drunken, happy laugh sounded from afar. “Happy New Year, Happy New Year!” a triumphant familiar voiceshouted hilariously from high above between the short, sharp bursts of machine gun fire, and Yossarianunderstood that some men had gone as a prank to one of the sandbagged machine-gun emplacements Milo hadinstalled in the hills after his raid on the squadron and staffed with his own men.\\n\\n 　　Yossarian blazed with hatred and wrath when he saw he was the victim of an irresponsible joke that haddestroyed his sleep and reduced him to a whimpering hulk. He wanted to kill, he wanted to murder. He wasangrier than he had ever been before, angrier even than when he had slid his hands around McWatt’s neck tostrangle him. The gun opened fire again. Voices cried “Happy New Year!” and gloating laughter rolled downfrom the hills through the darkness like a witch’s glee. In moccasins and coveralls, Yossarian charged out of histent for revenge with his .45, ramming a clip of cartridges up into the grip and slamming the bolt of the gun backto load it. He snapped off the safety catch and was ready to shoot. He heard Nately running after him to restrainhim, calling his name. The machine gun opened fire once more from a black rise above the motor pool, andorange tracer bullets skimmed like low-gliding dashes over the tops of the shadowy tents, almost clipping thepeaks. Roars of rough laughter rang out again between the short bursts. Yossarian felt resentment boil like acidinside him; they were endangering his life, the bastards! With blind, ferocious rage and determination, he racedacross the squadron past the motor pool, running as fast as he could, and was already pounding up into the hillsalong the narrow, winding path when Nately finally caught up, still calling “Yo-Yo! Yo-Yo!” with pleadingconcern and imploring him to stop. He grasped Yossarian’s shoulders and tried to hold him back. Yossariantwisted free, turning. Nately reached for him again, and Yossarian drove his fist squarely into Nately’s delicateyoung face as hard as he could, cursing him, then drew his arm back to hit him again, but Nately had dropped out of sight with a groan and lay curled up on the ground with his head buried in both hands and blood streamingbetween his fingers. Yossarian whirled and plunged ahead up the path without looking back.\\n\\n 　　Soon he saw the machine gun. Two figures leaped up in silhouette when they heard him and fled into the nightwith taunting laughter before he could get there. He was too late. Their footsteps receded, leaving the circle ofsandbags empty and silent in the crisp and windless moonlight. He looked about dejectedly. Jeering laughtercame to him again, from a distance. A twig snapped nearby. Yossarian dropped to his knees with a cold thrill ofelation and aimed. He heard a stealthy rustle of leaves on the other side of the sandbags and fired two quickrounds. Someone fired back at him once, and he recognized the shot.\\n\\n 　　“Dunbar? he called.\\n\\n 　　“Yossarian?”\\n\\n 　　The two men left their hiding places and walked forward to meet in the clearing with weary disappointment, theirguns down. They were both shivering slightly from the frosty air and wheezing from the labor of their uphillrush.\\n\\n 　　“The bastards,” said Yossarian. “They got away.”\\n\\n 　　“They took ten years off my life,” Dunbar exclaimed. “I thought that son of a bitch Milo was bombing us again.\\n\\n 　　I’ve never been so scared. I wish I knew who the bastards were.\\n\\n 　　“One was Sergeant Knight.”\\n\\n 　　“Let’s go kill him.” Dunbar’s teeth were chattering. “He had no right to scare us that way.”\\n\\n 　　Yossarian no longer wanted to kill anyone. “Let’s help Nately first. I think I hurt him at the bottom of the hill.”\\n\\n 　　But there was no sign of Nately along the path, even though Yossarian located the right spot by the blood on thestones. Nately was not in his tent either, and they did not catch up with him until the next morning when theychecked into the hospital as patients after learning he had checked in with a broken nose the night before. Natelybeamed in frightened surprise as they padded into the ward in their slippers and robes behind Nurse Cramer andwere assigned to their beds. Nately’s nose was in a bulky cast, and he had two black eyes. He kept blushinggiddily in shy embarrassment and saying he was sorry when Yossarian came over to apologize for hitting him.\\n\\n 　　Yossarian felt terrible; he could hardly bear to look at Nately’s battered countenance, even though the sight wasso comical he was tempted to guffaw. Dunbar was disgusted by their sentimentality, and all three were relievedwhen Hungry Joe came barging in unexpectedly with his intricate black camera and trumped-up symptoms ofappendicitis to be near enough to Yossarian to take pictures of him feeling up Nurse Duckett. Like Yossarian, hewas soon disappointed. Nurse Duckett had decided to marry a doctor—any doctor, because they all did so well inbusiness—and would not take chances in the vicinity of the man who might someday be her husband. HungryJoe was irate and inconsolable until—of all people—the chaplain was led in wearing a maroon corduroybathrobe, shining like a skinny lighthouse with a radiant grin of self-satisfaction too tremendous to be concealed.\\n\\n 　　The chaplain had entered the hospital with a pain in his heart that the doctors thought was gas in his stomach andwith an advanced case of Wisconsin shingles.\\n\\n 　　“What in the world are Wisconsin shingles?” asked Yossarian.\\n\\n 　　“That’s just what the doctors wanted to know!” blurted out the chaplain proudly, and burst into laughter. No onehad ever seen him so waggish, or so happy. “There’s no such thing as Wisconsin shingles. Don’t youunderstand? I lied. I made a deal with the doctors. I promised that I would let them know when my Wisconsinshingles went away if they would promise not to do anything to cure them. I never told a lie before. Isn’t itwonderful?”\\n\\n 　　The chaplain had sinned, and it was good. Common sense told him that telling lies and defecting from duty weresins. On the other hand, everyone knew that sin was evil, and that no good could come from evil. But he did feelgood; he felt positively marvelous. Consequently, it followed logically that telling lies and defecting from dutycould not be sins. The chaplain had mastered, in a moment of divine intuition, the handy technique of protectiverationalization, and he was exhilarated by his discovery. It was miraculous. It was almost no trick at all, he saw,to turn vice into virtue and slander into truth, impotence into abstinence, arrogance into humility, plunder intophilanthropy, thievery into honor, blasphemy into wisdom, brutality into patriotism, and sadism into justice.\\n\\n 　　Anybody could do it; it required no brains at all. It merely required no character. With effervescent agility thechaplain ran through the whole gamut of orthodox immoralities, while Nately sat up in bed with flushed elation,astounded by the mad gang of companions of which he found himself the nucleus. He was flattered andapprehensive, certain that some severe official would soon appear and throw the whole lot of them out like apack of bums. No one bothered them. In the evening they all trooped exuberantly out to see a lousy Hollywoodextravaganza in Technicolor, and when they trooped exuberantly back in after the lousy Hollywoodextravaganza, the soldier in white was there, and Dunbar screamed and went to pieces.\\n\\n 　　“He’s back!” Dunbar screamed. “He’s back! He’s back!”\\n\\n 　　Yossarian froze in his tracks, paralyzed as much by the eerie shrillness in Dunbar’s voice as by the familiar,white, morbid sight of the soldier in white covered from head to toe in plaster and gauze. A strange, quavering,involuntary noise came bubbling from Yossarian’s throat.\\n\\n 　　“He’s back!” Dunbar screamed again.\\n\\n 　　“He’s back!” a patient delirious with fever echoed in automatic terror.\\n\\n 　　All at once the ward erupted into bedlam. Mobs of sick and injured men began ranting incoherently and runningand jumping in the aisle as though the building were on fire. A patient with one foot and one crutch was hoppingback and forth swiftly in panic crying, “What is it? What is it? Are we burning? Are we burning?”\\n\\n 　　“He’s back!” someone shouted at him. “Didn’t you hear him? He’s back! He’s back!”\\n\\n 　　“Who’s back?” shouted someone else. “Who is it?”\\n\\n 　　“What does it mean? What should we do?”\\n\\n 　　“Are we on fire?”\\n\\n 　　“Get up and run, damn it! Everybody get up and run!”\\n\\n 　　Everybody got out of bed and began running from one end of the ward to the other. One C.I.D. man was lookingfor a gun to shoot one of the other C.I.D. men who had jabbed his elbow into his eye. The ward had turned intochaos. The patient delirious with the high fever leaped into the aisle and almost knocked over the patient withone foot, who accidentally brought the black rubber tip of his crutch down on the other’s bare foot, crushingsome toes. The delirious man with the fever and the crushed toes sank to the floor and wept in pain while othermen tripped over him and hurt him more in their blind, milling, agonized stampede. “He’s back!” all the menkept mumbling and chanting and calling out hysterically as they rushed back and forth. “He’s back, he’s back!”\\n\\n 　　Nurse Cramer was there in the middle suddenly like a spinning policeman, trying desperately to restore order,dissolving helplessly into tears when she failed. “Be still, please be still,” she urged uselessly through hermassive sobs. The chaplain, pale as a ghost, had no idea what was going on. Neither did Nately, who kept closeto Yossarian’s side, clinging to his elbow, or Hungry Joe, who followed dubiously with his scrawny fistsclenched and glanced from side to side with a face that was scared.\\n\\n 　　“Hey, what’s going on?” Hungry Joe pleaded. “What the hell is going on?”\\n\\n 　　“It’s the same one!” Dunbar shouted at him emphatically in a voice rising clearly above the raucous commotion.\\n\\n 　　“Don’t you understand? It’s the same one.”\\n\\n 　　“The same one!” Yossarian heard himself echo, quivering with a deep and ominous excitement that he could notcontrol, and shoved his way after Dunbar toward the bed of the soldier in white.\\n\\n 　　“Take it easy, fellas,” the short patriotic Texan counseled affably, with an uncertain grin. “There’s no cause to beupset. Why don’t we all just take it easy?”\\n\\n 　　“The same one!” others began murmuring, chanting and shouting.\\n\\n 　　Suddenly Nurse Duckett was there, too. “What’s going on?” she demanded.\\n\\n 　　“He’s back!” Nurse Cramer screamed, sinking into her arms. “He’s back, he’s back!”\\n\\n 　　It was, indeed, the same man. He had lost a few inches and added some weight, but Yossarian remembered himinstantly by the two stiff anus and the two stiff, thick, useless legs all drawn upward into the air almostperpendicularly by the taut ropes and the long lead weights suspended from pulleys over him and by the frayedblack hole in the bandages over his mouth. He had, in fact, hardly changed at all. There was the same zinc piperising from the hard stone mass over his groin and leading to the clear glass jar on the floor. There was the sameclear glass jar on a pole dripping fluid into him through the crook of his elbow. Yossarian would recognize him anywhere. He wondered who he was.\\n\\n 　　“There’s no one inside!” Dunbar yelled out at him unexpectedly.\\n\\n 　　Yossarian felt his heart skip a beat and his legs grow weak. “What are you talking about?” he shouted withdread, stunned by the haggard, sparking anguish in Dunbar’s eyes and by his crazed look of wild shock andhorror. “Are you nuts or something? What the hell do you mean, there’s no one inside?”\\n\\n 　　“They’ve stolen him away!” Dunbar shouted back. “He’s hollow inside, like a chocolate soldier. They just tookhim away and left those bandages there.”\\n\\n 　　“Why should they do that?”\\n\\n 　　“Why do they do anything?”\\n\\n 　　“They’ve stolen him away!” screamed someone else, and people all over the ward began screaming, “They’vestolen him away. They’ve stolen him away!”\\n\\n 　　“Go back to your beds,” Nurse Duckett pleaded with Dunbar and Yossarian, pushing feebly against Yossarian’schest. “Please go back to your beds.”\\n\\n 　　“You’re crazy!” Yossarian shouted angrily at Dunbar. “What the hell makes you say that?”\\n\\n 　　“Did anyone see him?” Dunbar demanded with sneering fervor.\\n\\n 　　“You saw him, didn’t you?” Yossarian said to Nurse Duckett. “Tell Dunbar there’s someone inside.”\\n\\n 　　“Lieutenant Schmulker is inside,” Nurse Duckett said. “He’s burned all over.”\\n\\n 　　“Did she see him?”\\n\\n 　　“You saw him, didn’t you?”\\n\\n 　　“The doctor who bandaged him saw him.”\\n\\n 　　“Go get him, will you? Which doctor was it?”\\n\\n 　　Nurse Duckett reacted to the question with a startled gasp. “The doctor isn’t even here!” she exclaimed. “Thepatient was brought to us that way from a field hospital.”\\n\\n 　　“You see?” cried Nurse Cramer. “There’s no one inside!”\\n\\n 　　“There’s no one inside!” yelled Hungry Joe, and began stamping on the floor.\\n\\n 　　Dunbar broke through and leaped up furiously on the soldier in white’s bed to see for himself, pressing hisgleaming eye down hungrily against the tattered black hole in the shell of white bandages. He was still bent overstaring with one eye into the lightless, unstirring void of the soldier in white’s mouth when the doctors and theM.P.s came running to help Yossarian pull him away. The doctors wore guns at the waist. The guards carriedcarbines and rifles with which they shoved and jolted the crowd of muttering patients back. A stretcher onwheels was there, and the solder in white was lifted out of bed skillfully and rolled out of sight in a matter ofseconds. The doctors and M.P.s moved through the ward assuring everyone that everything was all right.\\n\\n 　　Nurse Duckett plucked Yossarian’s arm and whispered to him furtively to meet her in the broom closet outsidein the corridor. Yossarian rejoiced when he heard her. He thought Nurse Duckett finally wanted to get laid andpulled her skirt up the second they were alone in the broom closet, but she pushed him away. She had urgentnews about Dunbar.\\n\\n 　　“They’re going to disappear him,” she said.\\n\\n 　　Yossarian squinted at her uncomprehendingly. “They’re what?” he asked in surprise, and laughed uneasily.\\n\\n 　　“What does that mean?”\\n\\n 　　“I don’t know. I heard them talking behind a door.”\\n\\n 　　“Who?”\\n\\n 　　“I don’t know. I couldn’t see them. I just heard them say they were going to disappear Dunbar.”\\n\\n 　　“Why are they going to disappear him?”\\n\\n 　　“I don’t know.”\\n\\n 　　“It doesn’t make sense. It isn’t even good grammar. What the hell does it mean when they disappear somebody?”\\n\\n 　　“I don’t know.”\\n\\n 　　“Jesus, you’re a great help!”\\n\\n 　　“Why are you picking on me?” Nurse Duckett protested with hurt feelings, and began sniffing back tears. “I’monly trying to help. It isn’t my fault they’re going to disappear him, is it? I shouldn’t even be telling you.”\\n\\n 　　Yossarian took her in his arms and hugged her with gentle, contrite affection. “I’m sorry,” he apologized, kissingher cheek respectfully, and hurried away to warn Dunbar, who was nowhere to be found.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/651/3672.html","bookId":85,"book":{"id":85,"title":"第二十二条军规 Catch-22","description":"简介： 《第二十二条军规》是一部严肃的、讽刺性极强的小说。通过这部小说，约瑟夫海勒将他眼中的美国社会展现在读者眼前。这个社会处于一种有组织的混乱、一种制度化了的疯狂之中，...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/651","creation":"Aug 1, 2019 12:18:14 AM","modification":"Aug 1, 2019 12:18:14 AM"}}
