{"id":108715,"no":7,"title":"Page 7","content":"\"Next time,\" Stefan said quietly, \"I won\u0027t leave.\"\\n\\n Elena knew he meant it, and it terrified her. But just now her emotions were quietly coasting in neutral, and she didn\u0027t want to argue.\\n\\n \"He was there,\" she said. \"Inside an ordinary house full of ordinary people, just as if he had every right to be. I wouldn\u0027t have thought he would dare.\"\\n\\n \"Why not?\" Stefan said briefly, bitterly. \"I was there in a ordinary house full of ordinary people, just as if I had every right to be.\"\\n\\n \"I didn\u0027t mean that the way it sounded. It\u0027s just that the only other time I\u0027ve seen him in public was at the Haunted House when he was wearing a mask and costume, and it was dark. Before that it was always somewhere deserted, like the gym that night I was there alone, or the graveyard...\"\\n\\n She knew as soon as she said that last part that it was a mistake. She still hadn\u0027t told Stefan about going to find Damon three days ago. In the driver\u0027s seat, he stiffened.\\n\\n \"Or the graveyard?\"\\n\\n \"Yes... I meant that day Bonnie and Meredith and I got chased out. I\u0027m assuming it must have been Damon who chased us. And the place was deserted except for the three of us.\"\\n\\n Why was she lying to him? Because, a small voice in her head answered grimly, otherwise he might snap. Knowing what Damon had said to her, what he had promised was in store, might be all that was needed to send Stefan over the edge.\\n\\n Then he\u0027ll never know, she promised herself. No matter what I have to do, I\u0027ll keep them from fighting each other over me. No matter what.\\n\\n For a moment, apprehension chilled her.\\n\\n Five hundred years ago, Katherine had tried to keep them from fighting, and had succeeded only in forcing them into a death match. Butshe wouldn\u0027t make the same mistake, Elena told herself fiercely. Katherine\u0027s methods had been stupid and childish. Who else but a stupid child would kill herself in the hope that the two rivals for her hand would become friends? It had been the worst mistake of the whole sorry affair. Because of it, the rivalry between Stefan and Damon had turned into implacable hatred. And what\u0027s more, Stefan had lived with the guilt of it ever since; he blamed himself for Katherine\u0027s stupidity and weakness.\\n\\n Groping for another subject, she said, \"Do you think someone invited him in?\"\\n\\n \"Obviously, since hewas in.\"\\n\\n \"Then it\u0027s true about - people like you. You have to be invited in. But Damon got into the gym without an invitation.\"\\n\\n \"That\u0027s because the gym isn\u0027t a dwelling place for the living. That\u0027s the one criterion. It doesn\u0027t matter if it\u0027s a house or a tent or an apartment above a store. If living humans eat and sleep there, we need to be invited inside.\"\\n\\n \"But I didn\u0027t invite you intomy house.\"\\n\\n \"Yes, you did. That first night, when I drove you home, you pushed the door open and nodded to me. It doesn\u0027t have to be a verbal invitation. If the intent is there, that\u0027s enough. And the person inviting you doesn\u0027t have to be someone who actually lives in the house. Any human will do.\"\\n\\n Elena was thinking. \"What about a houseboat?\"\\n\\n \"Same thing. Although running water can be a barrier in itself. For some of us, it\u0027s almost impossible to cross.\"\\n\\n Elena had a sudden vision of herself and Meredith and Bonnie racing for Wickery Bridge. Because somehow she had known that if they got to the other side of the river they\u0027d be safe from whatever was after them.\\n\\n \"Sothat\u0027s why,\" she whispered. It still didn\u0027t explain how she\u0027d known, though. It was as if the knowledge had been put into her head from some outside source. Then she realized something else.\\n\\n \"You took me across the bridge. You can cross running water.\"\\n\\n \"That\u0027s because I\u0027m weak.\" It was said flatly, with no emotion behind it. \"It\u0027s ironic, but the stronger your Powers are, the more you\u0027re affected by certain limitations. The more you belong to the dark, the more the rules of the dark bind you.\"\\n\\n Stefan looked at her. \"Yes,\" he said, \"I think it\u0027s time you knew. The more you know about Damon, the more chance you\u0027ll have of protecting yourself.\"\\n\\n Of protecting herself? Perhaps Stefan knew more than she thought. But as he turned the car onto a side street and parked, she just said, \"Okay. Should I be stocking up on garlic?\"\\n\\n He laughed. \"Only if you want to be unpopular. There are certain plants, though, that might help you. Like vervain. That\u0027s an herb that\u0027s supposed to protect you against bewitchment, and it can keep your mind clear even if someone is using Powers against you. People used to wear it around their necks. Bonnie would love it; it was sacred to the Druids.\"\\n\\n \"Vervain,\" said Elena, tasting the unfamiliar word. \"What else?\"\\n\\n \"Strong light, or direct sunlight, can be very painful. You\u0027ll notice the weather\u0027s changed.\"\\n\\n \"I\u0027ve noticed,\" said Elena after a beat. \"You mean Damon\u0027s doing that?\"\\n\\n \"He must be. It takes enormous power to control the elements, but it makes it easy for him to travel in daylight. As long as he keeps it cloudy, he doesn\u0027t even need to protect his eyes.\"\\n\\n \"And neither do you,\" Elena said. \"What about - well, crosses and things?\"\\n\\n \"No effect,\" said Stefan. \"Except that if the person holding onebelieves it\u0027s a protection, it can strengthen their will to resist tremendously.\"\\n\\n \"Uh... silver bullets?\"\\n\\n Stefan laughed again shortly. \"That\u0027s for werewolves. From what I\u0027ve heard they don\u0027t like silver in any form. A wooden stake through the heart is still the approved method for my kind. There are other ways that are more or less effective, though: burning, beheading, driving nails through the temples. Or, best of all - \"\\n\\n \"Stefan!\" The lonely, bitter smile on his face dismayed her. \"What about changing into animals?\" she said. \"Before, you said that with enough Power you could do that. If Damon can be any animal he likes, how will we ever recognize him?\"\\n\\n \"Not any animal he likes. He\u0027s limited to one animal, or at the most two. Even with his Powers I don\u0027t think he could sustain any more than that.\"\\n\\n \"So we keep looking out for a crow.\"\\n\\n \"Right. You may be able to tell if he\u0027s around, too, by looking at regular animals. They usually don\u0027t react very well to us; they sense that we\u0027re hunters.\"\\n\\n \"Yangtze kept barking at that crow. It was as if he knew there was something wrong about it,\" Elena remembered. \"Ah... Stefan,\" she added in a changed tone as a new thought struck her, \"what about mirrors? I don\u0027t remember ever seeing you in one.\"\\n\\n There was nothing to do but hold on to him, and Elena did. \"I love you,\" she whispered. It was the only comfort she could give him. It was all they had.\\n\\n His arms tightened around her; his face was buried in her hair. \"You\u0027re the mirror,\" he whispered back.\\n\\n It was good to feel him relax, tension flowing out of his body as warmth and comfort flowed in. She was comforted, too, a sense of peace infusing her, surrounding her. It was so good that she forgot to ask him what he meant until they were at her front door, saying good-bye.\\n\\n \"I\u0027m the mirror?\" she said then, looking up at him.\\n\\n \"You\u0027ve stolen my soul,\" he said. \"Lock the door behind you, and don\u0027t open it again tonight.\" Then he was gone.\\n\\n \"Elena, thank heavens,\" said Aunt Judith. When Elena stared at her, she added, \"Bonnie called from the party. She said you\u0027d left unexpectedly, and when you didn\u0027t come home I was worried.\"\\n\\n \"Stefan and I went for a ride.\" Elena didn\u0027t like the expression on her aunt\u0027s face when she said that. \"Is there a problem?\"\\n\\n \"No, no. It\u0027s just...\" Aunt Judith didn\u0027t seem to know how to finish her sentence. \"Elena, I wonder if it might be a good idea to... not see quite so much of Stefan.\"\\n\\n Elena went still. \"You, too?\"\\n\\n \"It isn\u0027t that I believe the gossip,\" Aunt Judith assured her. \"But, for your own sake, it might be best to get a little distance from him, to - \"\\n\\n \"To dump him? To abandon him because people are spreading rumors about him? To keep myself away from the mudslinging in case any of it sticks on me?\" Anger was a welcome release, and the words crowded in Elena\u0027s throat, all trying to get out at once. \"No, Idon\u0027t think that\u0027s a good idea, Aunt Judith. And if it were Robert we were talking about, you wouldn\u0027t either. Or maybe you would!\"\\n\\n \"Elena, I will not have you speaking to me in that tone - \"\\n\\n \"I\u0027m finished anyway!\" Elena cried, and whirled blindly for the stairs. She managed to keep the tears back until she was in her own room with the door locked. Then she threw herself on the bed and sobbed.\\n\\n She dragged herself up a while later to call Bonnie. Bonnie was excited and voluble. What on earth did Elena mean, had anything unusual happened after she and Stefan left? The unusual thing was their leaving! No, that new guy Damon hadn\u0027t said anything about Stefan afterward; he\u0027d just hung around for a while and then disappeared. No, Bonnie hadn\u0027t seen if he left with anybody. Why? Was Elena jealous? Yes, Elena immediately deduced that Alaric Saltzman\u0027s eyes were hazel.\\n\\n She got off the phone at last and only then remembered the note she\u0027d found in her purse. She should have asked Bonnie if anyone had gone near her purse while she was in the dining room. But then, Bonnie and Meredith had been in the dining room part of the time themselves. Someone might have done it then.\\n\\n The very sight of the violet paper made her taste tin at the back of her mouth. She could hardly bear to look at it. But now that she was alone shehad to unfold it and read it again, all the time hoping that somehow this time the words might be different, that she might have been mistaken before.\\n\\n But they weren\u0027t different. The sharp, clean block letters stood out against the pale background as if they were ten feet high.\\n\\n I want to touch him. More than any boy I\u0027ve ever known. And I know he wants it, too, but he\u0027s holding back on me.\\n\\n Her words. From her diary. The one that had been stolen.\\n\\n The next day Meredith and Bonnie rang her doorbell.\\n\\n \"Stefan called me last night,\" said Meredith. \"He said he wanted to make sure you weren\u0027t walking to school alone. He\u0027s not going to be at school today, so he asked if Bonnie and I could come over and walk with you.\\n\\n \"Escort you,\" said Bonnie, who was clearly in a good mood. \"Chaperone you. I think it\u0027s terribly sweet of him to be so protective.\"\\n\\n \"He\u0027s probably an Aquarius, too,\" said Meredith. \"Come on, Elena, before I kill her to shut her up about Alaric.\"\\n\\n Elena walked in silence, wondering what Stefan was doing that kept him from school. She felt vulnerable and exposed today, as if her skin were on inside out. One of those days when she was ready to cry at the drop of a hat.\\n\\n On the office bulletin board was tacked a piece of violet paper.\\n\\n She should have known. Shehad known somewhere deep inside. The thief wasn\u0027t satisfied with letting her know her private words had been read. He was showing her they could be made public.\\n\\n She ripped the note off the board and crumpled it, but not before she glimpsed the words. In one glance they were seared onto her brain.\\n\\n I feel as if someone has hurt him terribly in the past and he\u0027s never gotten over it. But I also think there\u0027s something he\u0027s afraid of, some secret he\u0027s afraid I\u0027ll find out.\\n\\n \"Elena, what is that? What\u0027s the matter? Elena, come back here!\"\\n\\n \"Okay,\" said Meredith loudly, \"senior privilege. You!\" She rapped on the only closed door. \"Come out.\"\\n\\n Some rustling, then a bewildered freshman emerged. \"But I didn\u0027t even - \"\\n\\n \"Out. Outside,\" Bonnie ordered. \"Andyou ,\" she said to the girl washing her hands, \"stand out there and make sure nobody comes in.\"\\n\\n \"But why? What are you - \"\\n\\n \"Move, chick. If anybody comes through that door we\u0027re holding you responsible.\"\\n\\n When the door was closed again, they rounded on Elena.\\n\\n \"Okay, this is a stickup,\" said Meredith. \"Come on, Elena, give.\"\\n\\n Elena ripped the last tiny shred of paper, caught between laughter and tears. She wanted to tell them everything, but she couldn\u0027t. She settled for telling them about the diary.\\n\\n They were as angry, as indignant, as she was.\\n\\n \"It had to be someone at the party,\" Meredith said at last, once they had each expressed their opinion of the thief\u0027s character, morals, and probable destination in the afterlife. \"But anybody there could have done it. I don\u0027t remember anyone in particular going near your purse, but that room was wall-to-wall people, and it could have happened without my noticing.\"\\n\\n \"But why would anyonewant to do this?\" Bonnie put in. \"Unless... Elena, the night we found Stefan you were hinting around at some things. You said you thought you knew who the killer was.\"\\n\\n \"I don\u0027t think I know; Iknow. But if you\u0027re wondering if this might be connected, I\u0027m not sure. I suppose it could be. The same person might have done it.\"\\n\\n Bonnie was horrified. \"But that means the killer is a student at this school!\" When Elena shook her head, she went on. \"The only people at that party who weren\u0027t students were that new guy and Alaric.\" Her expression changed. \"Alaric didn\u0027t kill Mr. Tanner! He wasn\u0027t even in Fell\u0027s Church then.\"\\n\\n \"I know. Alaric didn\u0027t do it.\" She\u0027d gone too far to stop now; Bonnie and Meredith already knew too much. \"Damon did.\"\\n\\n \"That guy was thekiller ? The guy thatkissed me?\"\\n\\n \"Bonnie, calm down.\" As always, other people\u0027s hysteria made Elena feel more in control. \"Yes, he\u0027s the killer, and we all three have to be on guard against him. That\u0027s why I\u0027m telling you. Never, never ask him into your house.\"\\n\\n Elena stopped, regarding the faces of her friends. They were staring at her, and for a moment she had the sickening feeling that they didn\u0027t believe her. That they were going to question her sanity.\\n\\n \"Yes. I\u0027m sure. He\u0027s the murderer and the one who put Stefan in the well, and he might be after one of us next. And I don\u0027t know if there\u0027s any way to stop him.\"\\n\\n \"Well, then,\" said Meredith, lifting her eyebrows. \"No wonder you and Stefan were in such a hurry to leave the party.\"\\n\\n Caroline gave Elena a vicious smirk as Elena walked into the cafeteria. But Elena was almost beyond noticing.\\n\\n One thing she noticed right away, though. Vickie Bennett was there.\\n\\n Vickie hadn\u0027t been to school since the night Matt and Bonnie and Meredith had found her wandering on the road, raving about mist and eyes and something terrible in the graveyard. The doctors who checked her afterward said there was nothing much wrong with her physically, but she still hadn\u0027t returned to Robert E. Lee. People whispered about psychologists and the drug treatments they were trying.\\n\\n She didn\u0027t look crazy, though, Elena thought. She looked pale and subdued and sort of crumpled into her clothing. And when Elena passed her and she looked up, her eyes were like a startled fawn\u0027s.\\n\\n It was strange to sit at a half-empty table with only Bonnie and Meredith for company. Usually people were crowding to get seats around the three of them.\\n\\n \"We didn\u0027t finish talking this morning,\" Meredith said. \"Get something to eat, and then we\u0027ll figure out what to do about those notes.\"\\n\\n \"I\u0027m not hungry,\" said Elena flatly. \"And whatcan we do? If it\u0027s Damon, there\u0027s no way we can stop him. Trust me, it\u0027s not a matter for the police. That\u0027s why I haven\u0027t told them he\u0027s the killer. There isn\u0027t any proof, and besides, they would never... Bonnie, you\u0027re not listening.\"\\n\\n \"Sorry,\" said Bonnie, who was staring past Elena\u0027s left ear. \"But something weird is going on up there.\"\\n\\n Elena turned. Vickie Bennett was standing at the front of the cafeteria, but she no longer seemed crumpled and subdued. She was looking around the room in a sly and assessing manner, smiling.\\n\\n \"Well, she doesn\u0027t look normal, but I wouldn\u0027t say she was beingweird , exactly,\" Meredith said. Then she added, \"Wait a minute.\"\\n\\n Vickie was unbuttoning her cardigan. But it was theway she was doing it - with deliberate little flicks of her fingers, all the while looking around with that secretive smile - that was odd. When the last button was undone, she took the sweater daintily between forefinger and thumb and slid it down over first one arm and then the other. She dropped the sweater on the floor.\\n\\n \"Weird is the word,\" confirmed Meredith.\\n\\n Students crossing in front of Vickie with laden trays glanced at her curiously and then looked back over their shoulders when they had passed. They didn\u0027t actually stop walking, though, until she took off her\\n\\n She did it gracefully, catching the heel of one pump on the toe of the other and pushing it off. Then she kicked off the second pump.\\n\\n \"She can\u0027t keep going,\" murmured Bonnie, as Vickie\u0027s fingers moved to the simulated pearl buttons on her white silk blouse.\\n\\n Heads were turning; people were poking one another and gesturing. Around Vickie a small group had gathered, standing far enough back that they didn\u0027t interfere with everyone else\u0027s view.\\n\\n The white silk blouse rippled off, fluttering like a wounded ghost to the floor. Vickie was wearing a lacy off-white slip underneath.\\n\\n There was no longer any sound in the cafeteria except the sibilance of whispers. No one was eating. The group around Vickie had gotten larger.\\n\\n Vickie smiled demurely and began to unfasten clasps at her waist. Her pleated skirt fell to the floor. She stepped out of it and pushed it to one side with her foot.\\n\\n Somebody stood up at the back of the cafeteria and chanted, \"Take itoff! Take itoff!\" Other voices joined in.\\n\\n \"Isn\u0027t anybody going to stop her?\" fumed Bonnie.\\n\\n Elena got up. The last time she\u0027d gone near Vickie the other girl had screamed and struck out at her. But now, as she got close, Vickie gave her the smile of a conspirator. Her lips moved, but Elena couldn\u0027t make out what she was saying over the chanting.\\n\\n \"Come on, Vickie. Let\u0027s go,\" she said.\\n\\n Vickie\u0027s light brown hair tossed and she plucked at the strap of her slip.\\n\\n Elena stooped to pick up the cardigan and wrap it around the girl\u0027s slender shou lders. As she did, as she touched Vickie, those half-closed eyes opened wide like a startled fawn\u0027s again. Vickie stared about her wildly, as if she\u0027d just been awakened from a dream. She looked down at herself and her expression turned to disbelief. Pulling the cardigan around her more tightly, she backed away, shivering.\\n\\n The room was quiet again.\\n\\n \"It\u0027s okay,\" said Elena soothingly. \"Come on.\"\\n\\n At the sound of her voice, Vickie jumped as if touched by a live wire. She stared at Elena, and then she exploded into action.\\n\\n \"You\u0027re one of them! I saw you! You\u0027re evil!\"\\n\\n She turned and ran barefoot out of the cafeteria, leaving Elena stunned. \\n\\n","sourceLink":"https://allnovel.net/the-vampire-diaries-the-struggle-the-vampire-diaries-2/page-7.html","bookId":2032,"book":{"id":2032,"title":"The Vampire Diaries: The Struggle (The Vampire Diaries #2)","description":"Storyline: Picking up where The Awakening left off, Elena confronts Damon about Stefan\u0027s disappearance. But when Elena stands firm on her rejection of Damon\u0027s romantic advances, Damon refuses to help her find Stefan. Elena must turn to her best friends, Bonnie McCullough and Meredith Sulez. Bonnie, who is believed to have psychic powers, uses magic to track down Stefan. The girls discover Stefan trapped in the bottom of a well, close to death. After Stefan\u0027s rescue, Elena offers him her blood to recover. Because of the belief that he perpetrated the horrific \u0027animal\u0027 attacks, Stefan still faces hostility in the town. And as the town\u0027s monumental anniversary, \u0027Founder\u0027s Day\u0027 approaches, Elena reaches her breaking point. Elena\u0027s adversary, Caroline Forbes, has stolen Elena\u0027s diary. Elena confesses all her secrets to her diary, and its contents can be read as evidence that Stefan is a violent criminal...\\n","cover":"https://allnovel.net/images/the-vampire-diaries-the-struggle-the-vampire-diaries-2.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-vampire-diaries-the-struggle-the-vampire-diaries-2.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:23:56 PM"}}
