{"id":78150,"no":17,"title":"Page 17","content":"Daneel would allow no immediate action.\n \"Tomorrow!\" he had said with respectful firmness. \"That is my suggestion, Partner Elijah. It is late and you are in need of rest.\"\n Baley had to admit the truth of it, and besides there was the need of preparation; a considerable quantity of it. He had the solution of the murder, he felt sure of that, but it rested on deduction, as much as had Daneel\u0027s theory, and it was worth as little as evidence. Solarians would have to help him.\n And if he were to face them, one Earthman against half a dozen Spacers, he would have to be in full control. That meant rest and preparation.\n Yet he would not sleep. He was certain he would not sleep. Not all the softness of the special bed set up for him by smoothly functioning robots nor all the soft perfume and softer music in the special room of Gladia\u0027s mansion would help. He was sure of it.\n Daneel sat unobtrusively in one darkened corner.\n Baley said, \"Are you still afraid of Gladia?\"\n The robot said, \"I do not think it wise to allow you to sleep alone and unprotected.\"\n \"Well, have your way. Are you clear as to what I want you to do, Daneel?\"\n \"I am, Partner Elijah.\"\n \"You have no reservations under the First Law, I hope.\"\n \"I have some with respect to the conference you wish arranged. Will you be armed and careful of your own safety?\"\n \"I assure you, I will.\"\n Daneel delivered himself of a sigh that was somehow so human that for a moment Baley found himself trying to penetrate the darkness that he might study the machine-perfect face of the other.\n Daneel said, \"I have not always found human behavior logical.\"\n \"We need Three Laws of our own,\" said Baley, \"but I\u0027m glad we don\u0027t have them.\"\n He stared at the ceiling. A great deal depended on Daneel and yet he could tell him very little of the whole truth. Robots were too involved. The planet, Aurora, had its reasons for sending a robot as representative of their interests, but it was a mistake. Robots had their limitations.\n Still, if all went right, this could all be over in twelve hours. He could be heading back to Earth in twenty-four, bearing hope. A strange kind of hope. A kind he could scarcely believe himself, yet it was Earth\u0027s way out. It must be Earth\u0027s way out.\n Earth! New York! Jessie and Ben! The comfort and familiarity and dearness of home!\n He dwelled on it, half asleep, and the thought of Earth failed to conjure the comfort he expected. There was an estrangement between himself and the Cities.\n And at some unknown point in time it all faded and he slept.\n Baley, having slept and then wakened, showered and dressed. Physically he was quite prepared. Yet he was unsure. It was not that his reasoning seemed any less cogent to himself in the pallor of morning. It was rather the necessity of facing Solarians.\n Could he be sure of their reactions after all? Or would he still be working blind?\n Gladia was the first to appear. It was simple for her, of course. She was on an intramural circuit, since she was in the mansion itself. She was pale and expressionless, in a white gown that draped her into a cold statue.\n She stared helplessly at Baley. Baley smiled back gently and she seemed to take comfort from that.\n One by one, they appeared now. Attlebish, the Acting Head of Security, appeared next after Gladia, lean and haughty, his large chin set in disapproval. Then Leebig, the roboticist, impatient and angry, his weak eyelid fluttering periodically. Quemot, the sociologist, a little tired, but smiling at Baley out of deep-set eyes in a condescending way, as though to say: We have seen one another, we have been intimate.\n Kiorissa Cantoro, when she appeared, seemed uneasy in the presence of the others. She glanced at Gladia for a moment with an audible sniff, then stared at the floor. Dr. Thool, the physician, appeared last. He looked haggard, almost sick.\n They were all there, all but Gruer, who was slowly recovering and for whom attendance was physically impossible. (Well, thought Baley, we\u0027ll do without him.) All were dressed formally; all sat in rooms that were well curtained into enclosure.\n Daneel had arranged matters well. Baley hoped fervently that what remained for Daneel to do would work as well.\n Baley looked from one Spacer to the other. His heart thudded. Each figure viewed him out of a different room and the clash of lighting, furniture, and wall decoration was dizzying.\n Baley said, \"I want to discuss the matter of the killing of Dr. Rikaine Delmarre under the heading of motive, opportunity, and means, in that order - \"\n Attlebish interrupted. \"Will this be a long speech?\"\n Baley said sharply, \"It may be. I have been called here to investigate a murder and such a job is my specialty and my profession. I\n know best how to go about it.\" (Take nothing from them now, he\n thought, or this whole thing won\u0027t work. Dominate! Dominate!)\n He went on, making his words as sharp and incisive as he could. \"Motive first. In a way, motive is the most unsatisfactory of the three items. Opportunity and means are objective. They can be investigated factually. Motive is subjective. It may be something that can be observed by others; revenge for a known humiliation, for instance. But it may also be completely unobservable; an irrational, homicidal hate on the part of a well-disciplined person who never lets it show.\n \"Now almost all of you have told me at one time or another that you believed Gladia Delmarre to have committed the crime. Certainly, no one has suggested an alternate suspect. Has Gladia a motive? Dr. Leebig suggested one. He said that Gladia quarreled frequently with her husband and Gladia later admitted this to me. The rage that can arise out of a quarrel can, conceivably, move a person to murder. Very well.\n \"The question remains, though, whether she is the only one with a motive. I wonder. Dr. Leebig, himself - \"\n The roboticist almost jumped. His hand extended rigidly in the direction of Baley. \"Watch what you - say, Earthman.\"\n \"I am only theorizing,\" said Baley coldly. \"You, Dr. Leebig, were working with Dr. Delmarre on new robot models. You are the best man in Solaria as far as robotics is concerned. You say so and I believe it.\"\n Leebig smiled with open condescension.\n Baley went on. \"But I have heard that Dr. Delmarre was about to break off relations with you for matters concerning yourself of which he disapproved.\"\n \"False! False!\"\n \"Perhaps. But what if it were true? Wouldn\u0027t you have a motive to get rid of him before he humiliated you publicly by breaking with you? I have a feeling you could not easily bear such humiliation.\"\n Baley went on rapidly to give Leebig no chance to retort. \"And you, Mrs. Cantoro. Dr. Delmarre\u0027s death leaves you in charge of fetal engineering, a responsible position.\"\n \"Skies above, we talked about that before,\" cried Kiorissa in anguish.\n \"I know we did, but it\u0027s a point that must be considered, anyway. As for Dr. Quemot, he played chess with Dr. Delmarre regularly. Perhaps he grew annoyed at losing too many games.\"\n The sociologist interposed quietly. \"Losing a chess game is insufficient motive surely, Plainclothesman.\"\n \"It depends on how seriously you take your chess. Motives can seem all the world to the murderer and completely insignificant to everyone else. Well, it doesn\u0027t matter. My point is that motive alone is insufficient. Anyone can have a motive, particularly for the murder of a man such as Dr. Delmarre.\"\n \"What do you mean by that remark,\" demanded Quemot in indignation.\n \"Why, only that Dr. Delmarre was a \u0027good Solarian.\u0027 You all described him as such. He rigidly fulfilled all the requirements of Solarian custom. He was an ideal man, almost an abstraction. Who could feel love, or even liking, for such a man? A man without weaknesses serves only to make everyone else conscious of his own imperfections. A primitive poet named Tennyson once wrote: \"He is all fault who has no fault at all.\"\n \"No one would kill a man for being too good,\" said Klorissa, frowning.\n \"You little know,\" said Baley, and went on without amplification. \"Dr. Delmarre was aware of a conspiracy on Solaria, or thought he was; a conspiracy that was preparing an assault on the rest of the Galaxy for purposes of conquest. He was interested in preventing that. For that reason, those concerned in the conspiracy might find it necessary to do away with him. Anyone here could be a member of the conspiracy, including, to be sure, Mrs. Delmarre, but including even the Acting Head of Security, Corwin Attlebish.\"\n \"I?\" said Attlebish, unmoved.\n \"You certainly attempted to end the investigation as soon as Gruer\u0027s mishap put you in charge.\"\n Baley took a few slow sips at his drink (straight from its original container, untouched by human hands others than his own, or robotic hands, either) and gathered his strength. So far, this was a waiting game, and he was thankful the Solarians were sitting still for it. They hadn\u0027t the Earthman\u0027s experience of dealing with people at close quarters. They weren\u0027t in-fighters.\n He said, \"Opportunity next. It is the general opinion that only Mrs. Delmarre had opportunity since only she could approach her husband in actual personal presence.\n \"Are we sure of that? Suppose someone other than Mrs. Delmarre had made up his or her mind to kill Dr. Delmarre? Would not such a desperate resolution make the discomfort of personal presence secondary? If any of you were set on murder, wouldn\u0027t you bear personal presence just long enough to do the job? Couldn\u0027t you sneak into the Delmarre mansion - \"\n Attlebish interposed frigidly. \"You are ignorant of the matter, Earthman. Whether we would or would not doesn\u0027t matter. The fact is that Dr. Delmarre himself would not allow seeing, I assure you. If anyone came into his personal presence, regardless of how valued and long-standing a friendship there was between them, Dr. Delmarre would order him away and, if necessary, call robots to help with the ejection.\"\n \"True,\" said Baley, \"if Dr. Delmarre were aware that personal presence was involved.\"\n \"What do you mean by that?\" demanded Dr. Thool in surprise, his voice quavering.\n \"When you treated Mrs. Delmarre at the scene of the murder,\" replied Baley, looking full at his questioner, \"she assumed you were viewing her, until you actually touched her. So she told me and so I believe. I am, myself, accustomed only to seeing. When I arrived at Solaria and met Security Head Gruer, I assumed I was seeing him. When at the end of our interview, Gruer disappeared, I was taken completely by surprise.\n \"Now assume the reverse. Suppose that for all a man\u0027s adult life, he had been viewing only; never seeing anyone, except on rare occasions his wife. Now suppose someone other than his wife walked up to him in personal presence. Would he not automatically assume that it was a matter of viewing, particularly if a robot had been instructed to advise Delmarre that viewing contact was being set up?\"\n \"Not for a minute,\" said Quemot. \"The sameness of background would give it away.\"\n \"Maybe, but how many of you are aware of background now? There would be a minute or so, at least, before Dr. Delmarre would grow aware that something was wrong and in that time, his friend, whoever he was, could walk up to him, raise a club, and bring it down.\"\n \"Impossible,\" said Quemot stubbornly.\n \"I think not,\" said Baley. \"1 think opportunity must be canceled out as absolute proof that Mrs. Delmarre is the murderess. She had opportunity, but so might others.\"\n Baley waited again. He felt perspiration on his forehead, but wiping it away would have made him look weak. He must maintain absolute charge of the proceedings. The person at whom he was aiming must be placed in self-convinced inferiority. It was hard for an Earthman to do that to a Spacer.\n Baley looked from face to face and decided that matters were at least progressing satisfactorily. Even Attlebish looked quite humanly concerned.\n \"And so we come,\" he said, \"to means, and that is the most puzzling factor of all. The weapon with which the murder was committed was never found.\"\n \"We know that,\" said Attlebish. \"If it were not for that point, we would have considered the case against Mrs. Delmarre conclusive. We would never have required an investigation.\"\n \"Perhaps,\" said Baley. \"Let\u0027s analyze the matter of means, then.\n There are two possibilities. Either Mrs. Delmarre committed the murder, or someone else did. If Mrs. Delmarre committed the murder, the weapon would have had to remain at the scene of the crime, unless it were removed later. It has been suggested by my partner, Mr. Olivaw of Aurora, who is not present at the moment, that Dr. Thool had the opportunity to remove the weapon. I ask Dr. Thool now, in the presence of all of us, if he did this, if he removed a weapon while examining the unconscious Mrs. Delmarre?\"\n Dr. Thool was shaking. \"No, no. I swear it. I\u0027ll abide any questioning. I swear I removed nothing.\"\n Baley said, \"Is there anyone who wishes to suggest at this point that Dr. Thool is lying?\"\n There was a silence, during which Leebig looked at an object outside of Baley\u0027s field of vision and muttered something about the time.\n Baley said, \"The second possibility is that someone else committed the crime and carried the weapon off with him. But if that were so, one must ask why. Carrying the weapon away is an advertisement of the fact that Mrs. Delmarre was not the murderess. If an outsider were the murderer, he would have to be a complete imbecile not to leave the weapon with the corpse to convict Mrs. Delmarre. Either way, then, the weapon - must be there! Yet it was not seen.\"\n Attlebish said, \"Do you take us for fools or for blind men?\"\n \"I take you for Solarians,\" said Baley calmly, \"and therefore incapable of recognizing the particular weapon that was left at the scene of the crime as a weapon.\"\n \"I don\u0027t understand a word,\" muttered Klorissa in distress.\n Even Gladia, who had scarcely moved a muscle during the course of the meeting, was staring at Baley in surprise.\n Baley said, \"Dead husband and unconscious wife were not the only individuals on the scene. There was also a disorganized robot.\"\n \"Well?\" said Leebig angrily.\n \"Isn\u0027t it obvious, then, that, in having eliminated the impossible, what remains, however improbable, is the truth. The robot at the scene of the crime was the murder weapon, a murder weapon none of you could recognize by force of your training.\"\n They all talked at once; all but Gladia, who simply stared.\n Baley raised his arms. \"Hold it. Quiet! Let me explain!\" And once again he told the story of the attempt on Gruer\u0027s life and the method\n by which it could have been accomplished. This time he added the attempt on his own life at the baby farm.\n Leebig said impatiently, \"I suppose that was managed by having one robot poison an arrow without knowing it was using poison, and having a second robot hand the poisoned arrow to the boy after telling him that you were an Earthman, without its knowing that the arrow was poisoned.\"\n \"Something like that. Both robots would be completely instructed.\"\n \"Very farfetched,\" said Leebig.\n Quemot was pale and looked as though he might be sick at any moment. \"No Solarian could possibly use robots to harm a human.\"\n \"Maybe so,\" said Baley with a shrug, \"but the point is that robots can be so manipulated. Ask Dr. Leebig. He is the roboticist.\"\n Leebig said, \"It does not apply to the murder of Dr. Delmarre. I told you that yesterday. How can anyone arrange to have a robot smash a man\u0027s skull?\"\n \"Shall I explain how?\"\n \"Do so if you can.\"\n Baley said, \"It was a new-model robot that Dr. Delmarre was testing. The significance of that wasn\u0027t plain to me until last evening, when I had occasion to say to a robot, in asking for his help in rising out of a chair, \u0027Give me a hand!\u0027 The robot looked at his own hand in confusion as though he thought he was expected to detach it and give it to me. I had to repeat my order less idiomatically. But it reminded me of something Dr. Leebig had told me earlier that day. There was experimentation among robots with replaceable limbs.\n \"Suppose this robot that Dr. Delmarre had been testing was one such, capable of using any of a number of interchangeable limbs of various shapes for different kinds of specialized tasks. Suppose the murderer knew this and suddenly said to the robot, \u0027Give me your arm.\u0027 The robot would detach its arm and give it to him. The detached arm would make a splendid weapon. With Dr. Delmarre dead, it could be snapped back into place.\"\n Stunned horror gave way to a babble of objection as Baley talked. His last sentence had to be shouted, and, even so, was all but drowned Out.\n Attlebish, face flushed, raised himself from his chair and stepped forward. \"Even if what you say is so, then Mrs. Delmarre is the murderess. She was there, she quarreled with him, she would be watching her husband working with the robot, and would know of the replaceable-limb situation - which I don\u0027t believe, by the way. No matter what you do, Earthman, everything points to her.\"\n Gladia began to weep softly.\n Baley did not look at her. He said, \"On the contrary, it is easy to show that, whoever committed the murder, Mrs. Delmarre did not.\n Jothan Leebig suddenly folded his arms and allowed an expression of contempt to settle on his face.\n Baley caught that and said, \"You\u0027ll help me do so, Dr. Leebig. As a roboticist, you know that maneuvering robots into actions such as indirect murder takes enormous skill. I had occasion yesterday to try to put an individual under house arrest. I gave three robots detailed instructions intended to keep this individual safe. It was a simple thing, but I am a clumsy man with robots. There were loopholes in my instructions and my prisoner escaped.\"\n \"Who was the prisoner?\" demanded Attlebish.\n \"Beside the point,\" said Baley impatiently. \"What is the point is the fact that amateurs can\u0027t handle robots well. And some Solarians may be pretty amateurish as Solarians go. For instance, what does Gladia Delmarre know about robotics?... Well, Dr. Leebig?\"\n \"What?\" The roboticist stared.\n \"You tried to teach Mrs. Delmarre robotics. What kind of a pupil was she? Did she learn anything?\"\n Leebig looked about uneasily. \"She didn\u0027t...\" and stalled.\n \"She was completely hopeless, wasn\u0027t she? Or would you prefer not to answer?\"\n Leebig said stiffly, \"She might have pretended ignorance.\"\n \"Are you prepared to say, as a roboticist, that you think Mrs. Delmarre is sufficiently skilled to drive robots to indirect murder?\"\n \"How can I answer that?\"\n \"Let me put it another way. Whoever tried to have me killed at the baby farm must have had to locate me by using interrobot communications. After all, I told no human where I was going and only the robots who conveyed me from point to point knew of my whereabouts. My partner, Daneel Olivaw, managed to trace me later in the day, but only with considerable difficulty. The murderer, on the other hand, must have done it easily, since, in addition to locating\n me, he had to arrange for arrow poisoning and arrow shooting, all before I left the farm and moved on. Would Mrs. Delmarre have the skill to do that?\"\n Corwin Attlebish leaned forward. \"Who do you suggest would have the necessary skill, Earthman?\"\n Baley said, \"Dr. Jothan Leebig is self-admittedly the best robot man on the planet.\"\n \"Is that an accusation?\" cried Leebig.\n \"Yes!\" shouted Baley.\n The fury in Leebig\u0027s eyes faded slowly. It was replaced not by calm, exactly, but by a kind of clamped-down tension. He said, \"I studied the Delmarre robot after the murder. It had no detachable limbs. At least, they were detachable only in the usual sense of requiring special tools and expert handling. So the robot wasn\u0027t the weapon used in killing Delmarre and you have no argument.\"\n Baley said, \"Who else can vouch for the truth of your statement?\"\n \"My word is not to be questioned.\"\n \"It is here. I\u0027m accusing you, and your unsupported word concerning the robot is valueless. If someone else will bear you out, that would be different. Incidentally, you disposed of that robot quickly. Why?\"\n \"There was no reason to keep it. It was completely disorganized. It was useless.\"\n \"Why?\"\n Leebig shook his finger at Baley and said violently, \"You asked me that once before, Earthman, and I told you why. It had witnessed a murder which it had been powerless to stop.\"\n \"And you told me that that always brought about complete collapse; that that was a universal rule. Yet when Gruer was poisoned, the robot that had presented him with the poisoned drink was harmed only to the extent of a limp and a lisp. It had actually itself been the agent of what looked like murder at the moment, and not merely a witness, and yet it retained enough sanity to be questioned.\n \"This robot, the robot in the Delmarre case, must therefore have been still more intimately concerned with murder than the Gruer robot. This Delmarre robot must have had its own arm used as the murder weapon.\"\n \"All nonsense,\" gasped out Leebig. \"You know nothing about robotics.\"\n Baley said, \"That\u0027s as may be. But I will suggest that Security Head Attlebish impound the records of your robot factory and maintenance shop. Perhaps we can find out whether you have built robots with detachable limbs and, if so, whether any were sent to Dr. Delmarre, and, if so, when.\"\n \"No one will tamper with my records,\" cried Leebig.\n \"Why? If you have nothing to hide, why?\"\n \"But why on Solaria should I want to kill Delmarre? Tell me that. What\u0027s my motive?\"\n \"I can think of two,\" said Baley. \"You were friendly with Mrs. Delmarre. Overly friendly. Solarians are human, after a fashion. You never consorted with women, but that didn\u0027t keep you immune from, shall we say, animal urges. You saw Mrs. Delmarre - I beg your pardon, you viewed her - when she was dressed rather informally and - \"\n \"No,\" cried Leebig in agony.\n And Gladia whispered energetically, \"No.\"\n \"Perhaps you didn\u0027t recognize the nature of your feelings yourself,\" said Baley, \"or if you had a dim notion of it, you despised yourself for your weakness, and hated Mrs. Delmarre for inspiring it. And yet you might have hated Delmarre, too, for having her. You did ask Mrs. Delmarre to be your assistant. You compromised with your libido that far. She refused and your hatred was the keener for that. By killing Dr. Delmarre in such a way as to throw suspicion on Mrs. Delmarre, you could be avenged on both at once.\"\n \"Who would believe that cheap, melodramatic filth?\" demanded Leebig in a hoarse whisper. \"Another Earthman, another animal, maybe. No Solarian.\"\n \"I don\u0027t depend on that motive,\" said Baley. \"I think it was there, unconsciously, but you had a plainer motive, too. Dr. Rikaine Delmarre was in the way of your plans, and had to be removed.\"\n \"What plans?\" demanded Leebig.\n \"Your plans aiming at the conquest of the Galaxy, Dr. Leebig,\" said Baley. \n","sourceLink":"https://allnovel.net/the-naked-sun-robot-2/page-17.html","bookId":2430,"book":{"id":2430,"title":"The Naked Sun (Robot #2)","description":"Storyline: \n The Naked Sun (Robot #2) \n A millennium into the future, two advancements have altered the course of human history: the colonization of the Galaxy and the creation of the positronic brain. \n On the beautiful Outer World planet of Solaria, a handful of human colonists lead a hermit-like existence, their every need attended to by their faithful robot servants. To this strange and provocative planet comes Detective Elijah Baley, sent from the streets of New York with his positronic partner, the robot R. Daneel Olivaw, to solve an incredible murder that has rocked Solaria to its foundations. The victim had been so reclusive that he appeared to his associates only through holographic projection. Yet someone had gotten close enough to bludgeon him to death while robots looked on. Now Baley and Olivaw are faced with two clear impossibilities: Either the Solarian was killed by one of his robots--unthinkable under the laws of Robotics--or he was killed by the woman who loved him so much that she never came into his presence!\n \n","cover":"https://allnovel.net/images/the-naked-sun-robot-2.jpg","author":"Isaac Asimov","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-naked-sun-robot-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 4:03:06 PM"}}
