{"id":78140,"no":5,"title":"Page 5","content":"\"It was only viewing, you see,\" said Gladia contritely. She was wrapped in something that left her arms and shoulders free. One leg showed to mid-thigh, but Baley, entirely recovered and feeling an utter fool, ignored it stoically. He said, \"It was the surprise, Mrs. Delmarre - \" \"Oh, please. You can call me Gladia, unless - unless that\u0027s against your customs.\" \"Gladia, then. It\u0027s all right. I just want to assure you there was nothing repulsive about it, you understand. Just the surprise.\" Bad enough for him to have acted the fool, he thought, without having the poor girl think he found her unpleasant. As a matter of fact, it had been rather - rather. Well, he didn\u0027t have the phrase, but he knew quite certainly that there was no way he would ever be able to talk of this to Jessie. \"I know I offended you,\" Gladia said, \"but I didn\u0027t mean to. I just wasn\u0027t thinking. Of course I realize one must be careful about the customs of other planets, but the customs are so queer sometimes; at least, not queer,\" she hastened to add, \"I don\u0027t mean queer. I mean strange, you know, and it\u0027s so easy to forget. As 1 forgot about keeping the windows darkened.\" \"Quite all right,\" muttered Baley. She was in another room now with all the windows draped and the light had the subtly different and more comfortable texture of artificiality. \"But about the other thing,\" she went on earnestly, \"it\u0027s just viewing, you see. After all, you didn\u0027t mind talking to me when I was in the drier and I wasn\u0027t wearing anything then, either.\" \"Well,\" said Baley, wishing she would run down as far as that subject was concerned, \"hearing you is one thing, and seeing you is another.\" \"But that\u0027s exactly it. Seeing isn\u0027t involved.\" She reddened a trifle and looked down. \"I hope you don\u0027t think I\u0027d ever do anything like that, I mean, just step out of the drier, if anyone were seeing me. It was just viewing.\" \"Same thing, isn\u0027t it?\" said Baley. \"Not at all the same thing. You\u0027re viewing me right now. You can\u0027t touch me, can you, or smell me, or anything like that. You could if you were seeing me. Right now, I\u0027m two hundred miles away from you at least. So how can it be the same thing?\" Baley grew interested. \"But I see you with my eyes.\" \"No, you don\u0027t see me. You see my image. You\u0027re viewing me.\" \"And that makes a difference?\" \"All the difference there is.\" \"I see.\" In a way he did. The distinction was not one he could make easily, but it had a kind of logic to it. She said, bending her head a little to one side, \"Do you really see?\" \"Yes.\" \"Does that mean you wouldn\u0027t mind if I took off my wrapper?\" She was smiling. He thought: She\u0027s teasing and I ought to take her up on it. But aloud he said, \"No, it would take my mind off my job. We\u0027ll discuss it another time.\" \"Do you mind my being in the wrapper, rather than something more formal? Seriously.\" \"I don\u0027t mind.\" \"May I call you by your first name?\" \"If you have the occasion.\" \"What is your first name?\" \"Elijah.\" \"All right.\" She snuggled into a chair that looked hard and almost ceramic in texture, but it slowly gave as she sat until it embraced her gently. Baley said, \"To business, now.\" She said, \"To business.\" Baley found it all extraordinarily difficult. There was no way even to make a beginning. On Earth he would ask name, rating, City and Sector of dwelling, a million different routine questions. He might even know the answers to begin with, yet it would be a device to ease into the serious phase. It would serve to introduce him to the person, make his judgment of the tactics to pursue something other than a mere guess. But here? How could he be certain of anything? The very verb \"to see\" meant different things to himself and to the woman. How many other words would be different? How often would they be at cross-purposes without his being aware of it? He said, \"How long were you married, Gladia?\" \"Ten years, Elijah.\" \"How old are you?\" \"Thirty-three.\" Baley felt obscurely pleased. She might easily have been a hundred thirty-three. He said, \"Were you happily married?\" Gladia looked uneasy. \"How do you mean that?\" \"Well - \" For a moment Baley was at a loss. How do you define a happy marriage. For that matter, what would a Solarian consider a happy marriage? He said, \"Well, you saw one another often?\" \"What? I should hope not. We\u0027re not animals, you know.\" Baley winced. \"You did live in the same mansion? I thought - \" \"Of course, we did. We were married. But I had my quarters and he had his. He had a very important career which took much of his time and I have my own work. We viewed each other whenever necessary.\" He saw you, didn\u0027t he? \"It\u0027s not a thing one talks about but he did see me.\" \"Do you have any children?\" Gladia jumped to her feet in obvious agitation. \"That\u0027s too much. Of all the indecent - \" \"Now wait. Wait!\" Baley brought his fist down on the arm of his chair. \"Don\u0027t be difficult. This is a murder investigation. Do you understand? Murder. And it was your husband who was murdered. Do you want to see the murderer found and punished or don\u0027t you?\" \"Then ask about the murder, not about - about - \" \"I have to ask all sorts of things. For one thing I want to know whether you\u0027re sorry your husband is dead.\" He added with calculated brutality, \"You don\u0027t seem to be.\" She stared at him haughtily. \"I\u0027m sorry when anyone dies, especially when he\u0027s young and useful.\" \"Doesn\u0027t the fact that he was your husband make it just a little more than that?\" \"He was assigned to me and, well, we did see each other when scheduled and - and\" - she hurried the next words - \"and, if you must know, we don\u0027t have children because none have been assigned us yet. I don\u0027t see what all that has to do with being sorry over someone being dead.\" Maybe it had nothing to do with it, Baley thought. It depended on the social facts of life and with those he was not acquainted. He changed the subject. \"I\u0027m told you have personal knowledge of the circumstances of the murder.\" For a moment she seemed to grow taut. \"I - discovered the body. Is that the way I should say it?\" \"Then you didn\u0027t witness the actual murder?\" \"Oh no,\" she said faintly. \"Well, suppose you tell me what happened. Take your time and use your own words.\" He sat back and composed himself to listen. She began, \"It was on three-two of the fifth - \" \"When was that in Standard Time?\" asked Baley quickly. \"I\u0027m not sure. I really don\u0027t know. You can check, I suppose.\" Her voice seemed shaky and her eyes had grown large. They were a little too gray to be called blue, he noted. She said, \"He came to my quarters. It was our assigned day for seeing and I knew he\u0027d come.\" \"He always came on the assigned day?\" \"Oh yes. He was a very conscientious man, a good Solarian. He never skipped an assigned day and always came at the same time. Of course, he didn\u0027t stay long. We have not been assigned ch - \" She couldn\u0027t finish the word, but Baley nodded. \"Anyway,\" she said, \"he always came at the same time, you know, so that everything would be comfortable. We spoke a few minutes; seeing is an ordeal, but he always spoke quite normally to me. It was his way. Then he left to attend to some project he was involved with; I\u0027m not sure what. He had a special laboratory in my quarters to which he could retire on seeing days. He had a much bigger one in his quarters, of course.\" Baley wondered what he did in those laboratories. Fetology, perhaps, whatever that was. He said, \"Did he seem unnatural in any way? Worried?\" \"No. No. He was never worried.\" She came to the edge of a small laugh and buried it at the last moment. \"He always had perfect control, like your friend there.\" For a brief moment her small hand reached out and indicated Daneel, who did not stir. \"I see. Well, go on.\" Gladia didn\u0027t. Instead she whispered, \"Do you mind if I have myself a drink?\" \"Please do.\" Gladia\u0027s hand slipped along the arm of her chair momentarily. In less than a minute, a robot moved in silently and a warm drink (Baley could see the steam) was in her hand. She sipped slowly, then set the drink down. She said, \"That\u0027s better. May I ask a personal question?\" Baley said, \"You may always ask.\" \"Well, I\u0027ve read a lot about Earth. I\u0027ve always been interested, you know. It\u0027s such a queer world.\" She gasped and added immediately, \"I didn\u0027t mean that.\" Baley frowned a little. \"Any world is queer to people who don\u0027t live on it.\" \"I mean it\u0027s different. You know. Anyway, I want to ask a rude question. At least, I hope it doesn\u0027t seem rude to an Earthman. I wouldn\u0027t ask it of a Solarian, of course. Not for anything.\" \"Ask what, Gladia?\" \"About you and your friend - Mr. Olivaw, is it?\" \"Yes.\" \"You two aren\u0027t viewing, are you?\" \"How do you mean?\" \"I mean each other. You\u0027re seeing. You\u0027re there, both of you.\" Baley said, \"We\u0027re physically together. Yes.\" \"You could touch him, if you wanted to.\" \"That\u0027s right.\" She looked from one to the other and said, \"Oh.\" It might have meant anything. Disgust? Revulsion? Baley toyed with the idea of standing up, walking to Daneel and placing his hand flat on Daneel\u0027s face. It might be interesting to watch her reaction. He said, \"You were about to go\u0027 on with the events of that day when your husband came to see you.\" He was morally certain that her digression, however interesting it might have been intrinsically to her, was primarily motivated by a desire to avoid just that. She returned to her drink for a moment. Then: \"There isn\u0027t much to tell. I saw he would be engaged, and I knew he would be, anyway, because he was always at some sort of constructive work, so I went back to my own work. Then, perhaps fifteen minutes later, I heard a shout.\" There was a pause and Baley prodded her. \"What kind of a shout?\" She said, \"Rikaine\u0027s. My husband\u0027s. Just a shout. No words. A kind of fright. No! Surprise, shock. Something like that. I\u0027d never heard him shout before.\" She lifted her hands to her ears as though to shut out even the memory of the sound and her wrapper slipped slowly down to her waist. She took no notice and Baley stared firmly at his notebook. He said, \"What did you do?\" \"I ran. I ran. I didn\u0027t know where he was - \" \"I thought you said he had gone to the laboratory he maintained in your quarters.\" \"He did, E-Elijah, but I didn\u0027t know where that was. Not for sure, anyway. I never went there. It was his. I had a general idea of its direction. I knew it was somewhere in the west, but I was so upset, I didn\u0027t even think to summon any robot. One of them would have guided me easily, but of course none came without being summoned. When I did get there - I found it somehow - he was dead.\" She stopped suddenly and, to Baley\u0027s acute discomfort, she bent her head and wept. She made no attempt to obscure her face. Her eyes simply closed and tears slowly trickled down her cheeks. It was quite soundless. Her shoulders barely trembled. Then her eyes opened and looked at him through swimming tears. \"I never saw a dead man before. He was all bloody and his head was - just - all - I managed to get a robot and he called others and I suppose they took care of me and of Rikaine. I don\u0027t remember. I don\u0027t - \" Baley said, \"What do you mean, they took care of Rikaine?\" \"They took him away and cleaned up.\" There was a small wedge of indignation in her voice, the lady of the house careful of its condition. \"Things were a mess.\" \"And what happened to the body?\" She shook her head. \"I don\u0027t know. Burned, I suppose. Like any dead body.\" \"You didn\u0027t call the police?\" She looked at him blankly and Baley thought: No police! He said, \"You told somebody, I suppose. People found out about the matter.\" She said, \"The robots called a doctor. And I had to call Rikaine\u0027s place of work. The robots there had to know he wouldn\u0027t be back.\" \"The doctor was for you, I suppose.\" She nodded. For the first time, she seemed to notice her wrapper draped about her hips. She pulled it up into position, murmuring forlornly, \"I\u0027m sorry. I\u0027m sorry.\" Baley felt uncomfortable, watching her as she sat there helpless, shivering, her face contorted with the absolute terror that had come over her with the memory. She had never seen a dead body before. She had never seen blood and a crushed skull. And if the husband-wife relationship on Solaria was something thin and shallow, it was still a dead human being with whom she had been confronted. Baley scarcely knew what to say or do next. He had the impulse to apologize, and yet, as a policeman, he was doing only his duty. But there were no police on this world. Would she understand that this was his duty? Slowly, and as gently as he could, he said, \"Gladia, did you hear anything at all? Anything besides your husband\u0027s shout.\" She looked up, her face as pretty as ever, despite its obvious distress - perhaps because of it. She said, \"Nothing.\" \"No running footsteps? No other voice?\" She shook her head. \"I didn\u0027t hear anything.\" \"When you found your husband, he was completely alone? You two were the only ones present?\" \"Yes.\" \"No signs of anyone else having been there?\" \"None that I could see. I don\u0027t see how anyone could have been there, anyway.\" \"Why do you say that?\" For a moment she looked shocked. Then she said dispiritedly, \"You\u0027re from Earth. I keep forgetting. Well, it\u0027s just that nobody could have been there. My husband never saw anybody except me; not since he was a boy. He certainly wasn\u0027t the sort to see anybody. Not Rikaine. He was very strict; very custom-abiding.\" \"It might not have been his choice. What if someone had just come to see him without an invitation, without your husband knowing anything about it? He couldn\u0027t have helped seeing the intruder regardless of how custom-abiding he was.\" She said, \"Mayke, but he would have called robots at once and had the man taken away. He would have! Besides no one would try to see my husband without being invited to. I couldn\u0027t conceive of such a thing. And Rikaine certainly would never invite anyone to see him. It\u0027s ridiculous to think so.\" Baley said softly, \"Your husband was killed by being struck on the head, wasn\u0027t he? You\u0027ll admit that.\" \"I suppose so. He was - all - \" \"I\u0027m not asking for the details at the moment. Was there any sign of some mechanical contrivance in the room that would have enabled someone to crush his skull by remote control.\" \"Of course not. At least, I didn\u0027t see any.\" \"If anything like that had been there, I imagine you would have seen it. It follows then that a hand held something capable of crushing a man\u0027s skull and that hand swung it. Some person had to be within four feet of your husband to do that. So someone did see him.\" \"No one would,\" she said earnestly. \"A Solarian just wouldn\u0027t see anyone.\" \"A Solarian who would commit murder wouldn\u0027t stick at a bit of seeing, would he?\" (To himself that statement sounded dubious. On Earth he had known the case of a perfectly conscienceless murderer who had been caught only because he could not bring himself to violate the custom of absolute silence in the community bathroom.) Gladia shook her head. \"You don\u0027t understand about seeing. Earthmen just see anybody they want to all the time, so you don\u0027t understand it... .\" Curiosity seemed to be struggling within her. Her eyes lightened a bit. \"Seeing does seem perfectly normal to you, doesn\u0027t it?\" \"I\u0027ve always taken it for granted,\" said Baley. \"It doesn\u0027t trouble you?\" \"Why should it?\" \"Well, the films don\u0027t say, and I\u0027ve always wanted to know - Is it all right if I ask a question?\" \"Go ahead,\" said Baley stolidly. \"Do you have a wife assigned to you?\" \"I\u0027m married. I don\u0027t know about the assignment part.\" \"And I know you see your wife any time you want to and she sees you and neither of you thinks anything of it.\" Baley nodded. \"Well, when you see her, suppose you just want to - \" She lifted her hands elbow-high, pausing as though searching for the proper phrase. She tried again, \"Can you just - any time...\" She let it dangle. Baley didn\u0027t try to help. She said, \"Well, never mind. I don\u0027t know why I should bother you with that sort of thing now anyway. Are you through with me?\" She looked as though she might cry again. Baley said, \"One more try, Gladia. Forget that no one would see your husband. Suppose someone did. Who might it have been?\" \"It\u0027s just useless to guess. It couldn\u0027t be anyone.\" \"It has to be someone. Agent Gruer says there is reason to suspect some one person. So you see there must be someone.\" A small, joyless smile flickered over the girl\u0027s face. \"I know who he thinks did it.\" \"All right. Who?\" She put a small hand on her breast. \"I.\"","sourceLink":"https://allnovel.net/the-naked-sun-robot-2/page-5.html","bookId":2430,"book":{"id":2430,"title":"The Naked Sun (Robot #2)","description":"Storyline: The Naked Sun (Robot #2) A millennium into the future, two advancements have altered the course of human history: the colonization of the Galaxy and the creation of the positronic brain. On the beautiful Outer World planet of Solaria, a handful of human colonists lead a hermit-like existence, their every need attended to by their faithful robot servants. To this strange and provocative planet comes Detective Elijah Baley, sent from the streets of New York with his positronic partner, the robot R. Daneel Olivaw, to solve an incredible murder that has rocked Solaria to its foundations. The victim had been so reclusive that he appeared to his associates only through holographic projection. Yet someone had gotten close enough to bludgeon him to death while robots looked on. Now Baley and Olivaw are faced with two clear impossibilities: Either the Solarian was killed by one of his robots--unthinkable under the laws of Robotics--or he was killed by the woman who loved him so much that she never came into his presence!","cover":"https://allnovel.net/images/the-naked-sun-robot-2.jpg","author":"Isaac Asimov","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-naked-sun-robot-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 4:03:06 PM"}}
