{"id":95138,"no":26,"title":"Page 26","content":"The librarian shook his head, and tugged insistently.\n “Ook,” he explained, “Ook.”\n He dragged her reluctantly down a side alley-way in the maze of ancient shelving a few seconds before a party of senior wizards, drawn by the noise, rounded the corner.\n “The books have been fighting again . . . .”\n “Oh, no! It\u0027ll take ages to capture all the spells again, you know they go and find places to hide . . . .”\n “Who\u0027s that on the floor?”\n There was a pause.\n “He\u0027s knocked out. A shelf caught him, by the looks of it.”\n “Who is he?”\n “That new lad. You know; the one they say has got a whole head full of brains?”\n “If that shelf had been a bit closer we\u0027d be able to see if they were right.”\n “You two, get him along to the infirmary. The rest of you better get these books rounded up. Where\u0027s the damn librarian? He ought to know better than to let a Critical Mass build up.”\n Esk glanced sideways at the orang-outan, who waggled his eyebrows at her. He pulled a dusty volume of gardening spells out of the shelves beside him, extracted a soft brown banana from the recess behind it, and ate it with the quiet relish of one who knows that whatever the problems are, they belong firmly to human beings.\n She looked the other way, at the staff in her hand, and her lips went thin. She knew her grip hadn\u0027t slipped. The staff had lunged at Simon, with murder in its heartwood.\n The boy lay on a hard bed in a narrow room, a cold towel folded across his forehead. Treatle and Cutangle watched him carefully.\n “How long has it been?” said Cutangle.\n Trestle shrugged. “Three days.”\n “And he hasn\u0027t come around once?”\n “No.”\n Cutangle sat down heavily on the edge of the bed, and pinched the bridge of his nose wearily. Simon had never looked particularly healthy, but now his face had a horrible sunken look.\n “A. brilliant mind, that one,” he said. “His explanation of the fundamental principles of magic and matter - quite astounding.”\n Trestle nodded.\n “The way he just absorbs knowledge,” said Cutangle: “I\u0027ve been a working wizard all my life, and somehow I never really understood magic until he explained it. So clear. So, well, obvious.”\n “Everyone says that,” said Trestle gloomily. “They say it\u0027s like having a hoodwink pulled off and seeing the daylight for the first time.”\n “That\u0027s exactly it,” said Cutangle, “He\u0027s sourcerer material, sure enough. You were right to bring him here.”\n There was a thoughtful pause.\n “Only -”said Trestle.\n “Only what?” asked Cutangle.\n “Only what was it you understood?” said Trestle. “That\u0027s what\u0027s bothering me. I mean, can you explain it?”\n “How do you mean, explain?” Cutangle looked worried.\n “What he keeps talking about,” said Trestle, a hint of desperation in his voice. “Oh, it\u0027s the genuine stuff, I know. But what exactly is it?”\n Cutangle looked at him, his mouth open. Eventually he said, “Oh, that\u0027s easy. Magic fills the universe, you see, and every time the universe changes, no, I mean every time magic is invoked, the universe changes, only in every direction at once, d\u0027you see, and -” he moved his hands uncertainly, trying to recognise a spark of comprehension in Trestle\u0027s face. “To put it another way, any piece of matter, like an orange or the world or, or -”\n “- a crocodile?” suggested Trestle.\n “Yes, a crocodile, or - whatever, is basically shaped like a carrot.”\n “I don\u0027t remember that bit,” said Trestle.\n “I\u0027m sure that\u0027s what he said,” said Cutangle. He was starting to sweat.\n “No, I remember the bit where he seemed to suggest that if you went far enough in any direction you would see the back of your head,” Trestle insisted.\n “You\u0027re sure he didn\u0027t mean someone else\u0027s head?”\n Trestle thought for a bit.\n “No, I\u0027m pretty sure he said the back of your own head,” he said. “I think he said he could prove it.”\n They considered this in silence.\n Finally Cutangle spoke, very slowly and carefully.\n “I look at it all like this,” he said. “Before I heard him talk, I was like everyone else. You know what I mean? I was confused and uncertain about all the little details of life. But now,” he brightened up, “while I\u0027m still confused and uncertain it\u0027s on a much higher plane, d\u0027you see, and at least I know I\u0027m bewildered about the really fundamental and important facts of the universe.”\n Trestle nodded. “I hadn\u0027t looked at it like that,” he said, “but you\u0027re absolutely right. He\u0027s really pushed back the boundaries of ignorance. There\u0027s so much about the universe we don\u0027t know.”\n They both savoured the strange warm glow of being much more ignorant than ordinary people, who were ignorant of only ordinary things.\n Then Trestle said: “I just hope he\u0027s all right. He\u0027s over the fever but he just doesn\u0027t seem to want to wake up.”\n A couple of servants came in with a bowl of water and fresh towels. One of them carried a rather tatty broomstick. As they began to change the sweat-soaked sheets under the boy the two wizards left, still discussing the vast vistas of unknowingness that Simon\u0027s genius had revealed to the world.\n Granny waited until their footsteps had died away and took off her headscarf.\n “Damn thing,” she said. “Esk, go and listen at the door.” She removed the towel from Simon\u0027s head and felt his temperature.\n “It was very good of you to come,” said Esk. “And you so busy with your work, and everything.”\n “Mmmph.” Granny pursed her lips. She pulled up Simon\u0027s eyelids and sought his pulse. She laid an ear on his xylophone chest and listened to his heart. She sat for some time quite motionless, probing around inside his head.\n She frowned.\n “Is he all right?” said Esk anxiously.\n Granny looked at the stone walls.\n “Drat this place,” she said. “It\u0027s no place for sick people.”\n “Yes, but is he all right?”\n “What?” Granny was startled out of her thoughts. “Oh. Yes. Probably. Wherever he is.”\n Esk stared at her, and then at Simon\u0027s body.\n “Nobody\u0027s home,” said Granny, simply.\n “What do you mean?”\n “Listen to the child,” said Granny. “You\u0027d think I taught her nothing. I mean his mind\u0027s Wandering. He\u0027s gone Out of his Head.”\n She looked at Simon\u0027s body with something verging on admiration.\n “Quite surprisin\u0027, really,” she added. “I never yet met a wizard who could Borrow.”\n She turned to Esk, whose mouth was a horrified O.\n “I remember when I was a girl, old Nanny Annaple went Wanderin\u0027. Got too wrapped up with being a vixen, as I recall. Took us days to find her. And then there was you, too. I never would have found you if it wasn\u0027t for that staff thing, and what have you done with it, girl?”\n “It hit him,” Esk muttered. “It tried to kill him. I threw it in the river.”\n “Not a nice thing to do to it after it saved you,” said Granny.\n “It saved me by hitting him?”\n “Didn\u0027t you realise? He was callin\u0027 to - them Things.”\n “That\u0027s not true!”\n Granny stared into Esk\u0027s defiant eyes and the thought came to her mind: I\u0027ve lost her. Three years of work down the privy. She couldn\u0027t be a wizard but she might have been a witch.\n “Why isn\u0027t it true, Miss Clever?” she said.\n “He wouldn\u0027t do something like that!” Esk was near to tears. “I heard him speak, he\u0027s - well, he\u0027s not evil, he\u0027s a brilliant person, he nearly understands how everything works, he\u0027s -”\n “I expect he\u0027s a very nice boy,” said Granny sourly. “I never said he was a black wizard, did I?”\n “They\u0027re horrible Things!” Esk sobbed. “He wouldn\u0027t call out to them, he wants everything that they\u0027re not, and you\u0027re a wicked old -”\n The slap rang like a bell. Esk staggered back, white with shock. Granny stood with her hand upraised, trembling.\n She\u0027d struck Esk once before - the blow a baby gets to introduce it to the world and give it a rough idea of what to expect from life. But that had been the last time. In three years under the same roof there had been cause enough, when milk had been left to boil over or the goats had been carelessly left without water, but a sharp word or a sharper silence had done more than force ever could and left no bruises.\n She grabbed Esk firmly by the shoulders and stared into her eyes.\n “Listen to me,” she said urgently. “Didn\u0027t I always say to you that if you use magic you should go through the world like a knife goes through water? Didn\u0027t I say that?”\n Esk, mesmerised like a cornered rabbit, nodded.\n “And you thought that was just old Granny\u0027s way, didn\u0027t you? But the fact is that if you use magic you draw attention to yourself. From Them. They watch the world all the time. Ordinary minds are just vague to them, they hardly bother with them, but a mind with magic in it shines out, you see, it\u0027s a beacon to them. It\u0027s not darkness that calls Them, it\u0027s light, light that creates the shadows!”\n “But - but - why are They interested? What do They wwant?”\n “Life and shape,” said Granny.\n She sagged, and let go of Esk.\n “They\u0027re pathetic, really,” she said. “They\u0027ve got no life or shape themselves but what they can steal. They could no more survive in this world than a fish could live in a fire, but that doesn\u0027t stop them trying. And they\u0027re just bright enough to hate us because we\u0027re alive.”\n Esk shivered. She remember the gritty feel of the cold sand.\n “What are They? I always thought they were just a sort - a sort of demon?”\n “Nah. No one really knows. They\u0027re just the Things from the Dungeon Dimensions outside the universe, that\u0027s all. Shadow creatures.”\n She turned back to the prone form of Simon.\n “You wouldn\u0027t have any idea where he is, would you?” she said, looking shrewdly at Esk. “Not gone off flying with the seagulls, has he?”\n Esk shook her head.\n “No,” said Granny, “I didn\u0027t think so. They\u0027ve got him, haven\u0027t they.”\n It wasn\u0027t a question. Esk nodded, her face a mask of misery.\n “It\u0027s not your fault,” said Granny, “His mind gave them an opening, and when he was knocked out they took it back with them. Only. . . .”\n She drummed her fingers on the edge of the bed, and appeared to reach a decision.\n “Who\u0027s the most important wizard around here?” she demanded.\n “Um, Lord Cutangle,” said Esk. “He\u0027s the Archchancellor. He was one of the ones who was in here.”\n “The fat one, or the one like a streak of vinegar?”\n Esk dragged her mind from the image of Simon on the cold desert and found herself saying: “He\u0027s an Eighth Level wizard and a 33° mage, actually.”\n “You mean he\u0027s bent?” said Granny. “All this hanging around wizards has made you take them seriously, my girl. They all call themselves the Lord High this and the Imperial That, it\u0027s all part of the game. Even magicians do it, you\u0027d think they\u0027d be more sensible at least, but no, they call around saying they\u0027re the Amazing-Bonko-and-Doris. Anyway, where is this High Rumtiddlypo?” \n","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-26.html","bookId":1622,"book":{"id":1622,"title":"Equal Rites (Discworld #3)","description":"Storyline: \n Equal Rites (Discworld #3) \n On Discworld, a dying wizard tries to pass on his powers to an eighth son of an eighth son, who is just at that moment being born. The fact that the son is actually a daughter is discovered just a little too late. The town witch insists on turning the baby into a perfectly normal witch, thus mending the magical damage of the wizard\u0027s mistake. But now the young girl will be forced to penetrate the inner sanctum of the Unseen University--and attempt to save the world with one well-placed kick in some enchanted shins! Reissue.\n \n","cover":"https://allnovel.net/images/equal-rites-discworld-3.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/equal-rites-discworld-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:12:10 PM"}}
