{"id":95139,"no":27,"title":"Page 27","content":"“They\u0027ll be at dinner in the Great Hall,” said Esk. “Can he bring Simon back, then?” “That\u0027s the difficult part,” said Granny. “I daresay we could all get something back easily enough, walking and talking just like anyone. Whether it would be Simon is quite another sack of ferrets.” She stood up. “Let\u0027s find this Great Hall, then. No time to waste.” “Um, women aren\u0027t allowed in,” said Esk. Granny stopped in the doorway. Her shoulders rose. She turned around very slowly. “What did you say?” she said. “Did these old ears deceive me, and don\u0027t say they did because they didn\u0027t.” “Sorry,” said Esk. “Force of habit.” “I can see you\u0027ve been getting ideas below your station,” said Granny coldly. “Go and find someone to watch over the lad, and let\u0027s see what\u0027s so great about this hall that I mustn\u0027t set foot in it.” And thus it was that while the entire faculty of Unseen University were dining in the venerable hall the doors were flung back with a dramatic effect that was rather spoiled when one of them rebounded off a waiter and caught Granny a crack on the shin. Instead of the defiant strides she had intended to make across the chequered floor she was forced to half-hop, half-limp. But she hoped that she hopped with dignity. Esk hurried along behind her, acutely aware of the hundreds of eyes that were turned towards them. The roar of conversation and the clatter of cutlery faded away. A couple of chairs were knocked over. At the far end of the hall she could see the most senior wizards at their high table, which in fact bobbed a few feet off the floor. They were staring. A medium-grade wizard - Esk recognised him as a lecturer in Applied Astrology - rushed towards them, waving his hands. “Nononono,” he shouted. “Wrong door. You must go away.” “Don\u0027t mind me,” said Granny calmly, pushing past him. “Nonono, it\u0027s against the lore, you must go away now. Ladies are not allowed in here!” “I\u0027m not a lady, I\u0027m a witch,” said Granny. She turned to Esk. “Is he very important?” “I don\u0027t think so,” said Esk. “Right.” Granny turned to the lecturer: “Go and find me an important wizard, please. Quickly.” Esk tapped her on the back. A couple of wizards with a rather greater presence of mind had nipped smartly out of the door behind them, and now several college porters were advancing threateningly up the hall, to the cheers and catcalls of the students. Esk had never much liked the porters, who lived a private life in their lodge, but now she felt a pang of sympathy for them. Two of them reached out hairy hands and grabbed Granny\u0027s shoulders. Her arm disappeared behind her back and there was a brief flurry of movement that ended with the men hopping away, clutching bits of themselves and swearing. “Hatpin,” said Granny. She grabbed Esk with her free hand and swept towards the high table, glaring at anyone who so much as looked as if they were going to get in her way. The younger students, who knew free entertainment when they saw it, stamped and cheered and banged their plates on the long tables. The high table settled on the tiles with a thump and the senior wizards hurriedly lined up behind Cutangle as he tried to summon up his reserves of dignity. His efforts didn\u0027t really work; it is very hard to look dignified with a napkin tucked into one\u0027s collar. He raised his hands for silence, and the hall waited expectantly as Granny and Esk approached him. Granny was looking interestedly at the ancient paintings and statues of bygone mages. “Who are them buggers?” she said out of the corner of her mouth. “They used to be chief wizards,” whispered Esk. “They look constipated. I never met a wizard who was regular,” said Granny. “They\u0027re a nuisance to dust, that\u0027s all I know,” said Esk. Cutangle stood with legs planted wide apart, arms akimbo and stomach giving an impression of a beginners\u0027 ski slope, the whole of him therefore adopting a pose usually associated with Henry VIII but with an option on Henry IX and X as well. “Well?” he said, “What is the meaning of this outrage?” “Is he important?” said Granny to Esk. “I, madam, am the Archchancellor! And I happen to run this University! And you, madam, are trespassing in very dangerous territory indeed! I warn you that - stop looking at me like that!” Cutangle staggered backwards, his hands raised to ward off Granny\u0027s gaze. The wizards behind him scattered, turning over tables in their haste to avoid the stare. Granny\u0027s eyes had changed. Esk had never seen them like this before. They were perfectly silver, like little round mirrors, reflecting all they saw. Cutangle was a vanishingly small dot in their depths, his mouth open, his tiny matchstick arms waving in desperation. The Archchancellor backed into a pillar, and the shock made him recover. He shook his head irritably, cupped a hand and sent a stream of white fire streaking towards the witch. Without dropping her iridescent stare Granny raised a hand and deflected the flames towards the roof. There was an explosion and a shower of tile fragments. Her eyes widened. Cutangle vanished. Where he had been standing a huge snake coiled, poised to strike. Granny vanished. Where she had been standing was a large wicker basket. The snake became a giant reptile from the mists of time. The basket became the snow wind of the Ice Giants, coating the struggling monster with ice. The reptile became a sabre-toothed tiger, crouched to spring. The gale became a bubbling tar pit. The tiger managed to become an eagle, stooping. The tar pits became a tufted hood. Then the images began to flicker as shape replaced shape. Stroboscope shadows danced around the hall. A magical wind sprang up, thick and greasy, striking octarine sparks from beards and fingers. In the middle of it all Esk, peering through streaming eyes, could just make out the two figures of Granny and Cutangle, glossy statues in the midst of the hurtling images. She was also aware of something else, a high-pitched sound almost beyond hearing. She had heard it before, on the cold plain - a busy chittering noise, a beehive noise, an anthill sound .... “They\u0027re coming!” she screamed about the din. “They\u0027re coming now!” She scrambled out from behind the table where she had taken refuge from the magical duel and tried to reach Granny. A gust of raw magic lifted her off her feet and bowled her into a chair. The buzzing was louder now, so that the air roared like a three-week corpse on a summer\u0027s day. Esk made another attempt to reach Granny and recoiled when green fire roared along her arm and singed her hair. She looked around wildly for the other wizards, but those who had fled from the effects of the magic were cowering behind overturned furniture while the occult storm raged over their heads. Esk ran down the length of the hall and out into the dark corridor. Shadows curled around her as she hurried, sobbing, up the steps and along the buzzing corridors towards Simon\u0027s narrow room. Something would try to enter the body, Granny had said. Something that would walk and talk like Simon, but would be something else .... A cluster of students were hovering anxiously outside the door. They turned pale faces towards Esk as she darted towards them, and were sufficiently shaken to draw back nervously in the face of her determined progress. “Something\u0027s in there,” said one of them. “We can\u0027t open the door!” They looked at her expectantly. Then one of them said: “You wouldn\u0027t have a pass key, by any chance?” Esk grabbed the doorhandle and turned it. It moved slightly, but then spun back with such force it nearly took the skin off her hands. The chittering inside rose to a crescendo and there was another noise, too, like leather flapping. “You\u0027re wizards!” she screamed. “Bloody well wizz!” “We haven\u0027t done telekinesis yet,” said one of them. “I was ill when we did Firethrowing -” “Actually, I\u0027m not very good at Dematerialisation -” Esk went to the door, and then stopped with one foot in the air. She remembered Granny talking about how even buildings had a mind, if they were old enough. The University was very old. She stepped carefully to one side and ran her hands over the ancient stones. It had to be done carefully, so as not to frighten it - and now she could feel the mind in the stones, slow and simple, but still mind. It pulsed around her; she could feel the little sparkles deep in the rock. Something was hooting behind the door. The three students watched in astonishment as Esk stood rock still with her hands and forehead pressed against the wall. She was almost there. She could feel the weight of herself, the ponderousness of her body, the distant memories of the dawn of time when rock was molten and free. For the first time in her life she knew what it was like to have balconies. She moved gently through the building-mind, refining her impressions, looking as fast as she dared for this corridor, this door. She stretched out one arm, very carefully. The students watched as she uncurled one finger, very slowly. The door hinges began to creak. There was a moment of tension and then the nails sprang from the hinges and clattered into the wall behind her. The planks began to bend as the door still tried to force itself open against the strength of -whatever was holding it shut. The wood billowed. Beams of blue light lanced out into the corridor, moving and dancing as indistinct shapes shuffled through the blinding brilliance inside the room. The light was misty and actinic, the sort of light to make Steven Spielberg reach for his copyright lawyer. Esk\u0027s hair leapt from her head so that she looked like an ambulant dandelion. Little firesnakes of magic crackled across her skin as she stepped through the doorway. The students outside watched in horror as she disappeared into the light. It vanished in a silent explosion. When they eventually found enough courage to look inside the room, they saw nothing there but the sleeping body of Simon. And Esk, silent and cold on the floor, breathing very slowly. And the floor was covered with a fine layer of silver sand. Esk floated through the mists of the world, noticing with a curious impersonal feeling the precise way in which she passed through solid matter. There were others with her. She could hear their chittering. Fury rose like bile. She turned and set out after the noise, fighting the seductive forces that kept telling her how nice it would be just to relax her grip on her mind and sink into a warm sea of nothingness. Being angry, that was the thing. She knew it was most important to stay really angry. The Discworld fell away, and lay below her as it did on the day she had been an eagle. But this time the Circle Sea was below her - it certainly was circular, as if God had run out of ideas - and beyond it lay the arms of the continent, and the long chain of the Ramtops marching all the way to the Hub. There were other continents she had never heard of, and tiny island chains. As her point of view changed, the Rim came into sight. It was night time and, since the Disc\u0027s orbiting sun was below the world, it lit up the long waterfall that girdled the Edge. It also lit up Great A\u0027Tuin the World Turtle. Esk had often wondered if the Turtle was really a myth. It seemed a lot of trouble to go to just to move a world. But there It was, almost as big as the Disc it carried, frosted with stardust and pocked with meteor craters.","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-27.html","bookId":1622,"book":{"id":1622,"title":"Equal Rites (Discworld #3)","description":"Storyline: Equal Rites (Discworld #3) On Discworld, a dying wizard tries to pass on his powers to an eighth son of an eighth son, who is just at that moment being born. The fact that the son is actually a daughter is discovered just a little too late. The town witch insists on turning the baby into a perfectly normal witch, thus mending the magical damage of the wizard\u0027s mistake. But now the young girl will be forced to penetrate the inner sanctum of the Unseen University--and attempt to save the world with one well-placed kick in some enchanted shins! Reissue.","cover":"https://allnovel.net/images/equal-rites-discworld-3.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/equal-rites-discworld-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:12:10 PM"}}
