{"id":95116,"no":3,"title":"Page 3","content":"Frayed nerves and boredom and bad temper made the air hum like thunderstorm weather.\\n\\n “Right! That\u0027s it. That\u0027s just about enough!” shouted Esk\u0027s mother. “Cern, you and Gulta and Esk can go and see how Granny is and -where\u0027s Esk?”\\n\\n The two youngest boys looked up from where they were halfheartedly fighting under the table.\\n\\n “She went out to the orchard,” said Gulta. “Again.”\\n\\n “Go and fetch her in, then, and be off.”\\n\\n “But it\u0027s cold!”\\n\\n “It\u0027s going to snow again!”\\n\\n “It\u0027s only a mile and the road is clear enough and who was so keen to be out in it when we had the first snowfall? Go on with you, and don\u0027t come back till you\u0027re in a better temper.”\\n\\n They found Esk sitting in a fork of the big apple tree. The boys didn\u0027t like the tree much. For one thing, it was so covered in mistletoe that it looked green even in midwinter, its fruit was small and went from stomach-twisting sourness to wasp-filled rottenness overnight, and although it looked easy enough to climb it had a habit of breaking twigs and dislodging feet at inconvenient moments. Cern once swore that a branch had twisted just to spill him off. But it tolerated Esk, who used to go and sit in it if she was annoyed or fed up or just wanted to be by herself, and the boys sensed that every brother\u0027s right to gently torture his sister ended at the foot of its trunk. So they threw a snowball at her. It missed.\\n\\n “We\u0027re going to see old Weatherwax.”\\n\\n “But you don\u0027t have to come.”\\n\\n “Because you\u0027ll just slow us down and probably cry anyway.”\\n\\n Esk looked down at them solemnly. She didn\u0027t cry a lot, it never seemed to achieve much.\\n\\n “If you don\u0027t want me to come then I\u0027ll come,” she said. This sort of thing passes for logic among siblings.\\n\\n “Oh, we want you to come,” said Gulta quickly.\\n\\n “Very pleased to hear it,” said Esk, dropping on to the packed snow.\\n\\n They had a basket containing smoked sausages, preserved eggs and - because their mother was prudent as well as generous - a large jar of peach preserve that no one in the family liked very much. She still made it every year when the little wild peaches were ripe, anyway.\\n\\n The people of Bad Ass had learned to live with the long winter snows and the roads out of the village were lined with boards to reduce drifting and, more important, stop travellers from straying. If they lived locally it wouldn\u0027t matter too much if they did, because an unsung genius on the village council several generations previously had come up with the idea of carving markers in every tenth tree in the forest around the village, out to a distance of nearly two miles. It had taken ages, and re-cutting markers was always a job for any man with spare time, but in winters where a blizzard could lose a man within yards of his home many a life had been saved by the pattern of notches found by probing fingers under the clinging snow.\\n\\n It was snowing again when they left the road and started up the track where, in summer, the witch\u0027s house nestled in a riot of raspberry thickets and weird witch-growth.\\n\\n “No footprints,” said Cern.\\n\\n “Except for foxes,” said Gulta. “They say she can turn herself into a fox. Or anything. A bird, even. Anything. That\u0027s how she always knows what\u0027s going on.”\\n\\n They looked around cautiously. A scruffy crow was indeed watching them from a distant tree stump.\\n\\n “They say there\u0027s a whole family over Crack Peak way that can turn themselves into wolves,” said Gulta, who wasn\u0027t one to leave a promising subject, \"because one night someone shot a wolf and next day their auntie was limping with an arrow wound in her leg, and ....\\n\\n “I don\u0027t think people can turn themselves into animals,” said Esk, slowly.\\n\\n “Oh yes, Miss Clever?”\\n\\n “Granny is quite big. If she turned herself into a fox what would happen to all the bits that wouldn\u0027t fit?”\\n\\n “She\u0027d just magic them away,” said Cern.\\n\\n “I don\u0027t think magic works like that,” said Esk. “You can\u0027t just make things happen, there\u0027s a sort of - like a seesaw thing, if you push one end down, the other end goes up . . . .” Her voice trailed off.\\n\\n They gave her a look.\\n\\n “I can\u0027t see Granny on a seesaw,” said Gulta. Cern giggled.\\n\\n “No, I mean every time something happens, something else has to happen too - I think,” said Esk uncertainly, picking her way around a deeper than usual snowdrift. “Only in the . . . opposite direction.”\\n\\n “That\u0027s silly,” said Gulta, “because, look, you remember when that fair came last summer and there was a wizard with it and he made all those birds and things appear out of nothing? I mean it just happened, he just said these words and waved his hands, and it just happened. There weren\u0027t any seesaws.”\\n\\n “There was a swing,” said Cern. “And a thing where you had to throw things at things to win things.”\\n\\n “And you didn\u0027t hit anything, Gul.”\\n\\n “Nor did you, you said the things were stuck to the things so you couldn\u0027t knock them off, you said . . . .”\\n\\n Their conversation wandered away like a couple of puppies. Esk listened with half an ear. I know what I mean, she told herself. Magic\u0027s easy, you just find the place where everything is balanced and push. Anyone could do it. There\u0027s nothing magical about it. All the funny words and waving the hands is just . . . it\u0027s only for....\\n\\n She stopped, surprised at herself. She knew what she meant. The idea was right up there in the front of her mind. But she didn\u0027t know how to say it in words, even to herself.\\n\\n It was a horrible feeling to find things in your head and not know how they fitted. It....\\n\\n “Come on, we\u0027ll be all day.”\\n\\n She shook her head and hurried after her brothers.\\n\\n The witch\u0027s cottage consisted of so many extensions and lean-tos that it was difficult to see what the original building had looked like, or even if there had ever been one. In the summer it was surrounded by dense beds of what Granny loosely called “the Herbs” - strange plants, hairy or squat or twining, with curious flowers or vivid fruits or unpleasantly bulging pods. Only Granny knew what they were all for, and any woodpigeon hungry enough to attack them generally emerged giggling to itself and bumping into things (or, sometimes, never emerged at all.\\n\\n Now everything was deep under the snow. A forlorn windsock flapped against its pole. Granny didn\u0027t hold with flying but some of her friends still used broomsticks.\\n\\n “It looks deserted,” said Cem.\\n\\n “No smoke,” said Gulta.\\n\\n The windows look like eyes, thought Esk, but kept it to herself.\\n\\n “It\u0027s only Granny\u0027s house,” she said. “There\u0027s nothing wrong.”\\n\\n The cottage radiated emptiness. They could feel it. The windows did look like eyes, black and menacing against the snow. And no one in the Ramtops let their fire go out in the winter, as a matter of pride.\\n\\n Esk wanted to say “Let\u0027s go home,” but she knew that if she did the boys would run for it. Instead she said, “Mother says there\u0027s a key on a nail in the privy,” and that was nearly as bad. Even an ordinary unknown privy held minor terrors like wasps\u0027 nests, large spiders, mysterious rustling things in the roof and, one very bad winter, a small hibernating bear that caused acute constipation in the family until it was persuaded to bed down in the haybam. A witch\u0027s privy could contain anything.\\n\\n “I\u0027ll go and look, shall I?” she added.\\n\\n “If you like,” said Gulta airily, almost successfully concealing his relief.\\n\\n In fact, when she managed to get the door open against the piled snow, it was neat and clean and contained nothing more sinister than an old almanac, or more precisely about half an old almanac, carefully hung on a nail. Granny had a philosophical objection to reading, but she\u0027d be the last to say that books, especially books with nice thin pages, didn\u0027t have their uses.\\n\\n The key shared a ledge by the door with a chrysalis and the stump of a candle. Esk took it gingerly, trying not to disturb the chrysalis, and hurried back to the boys.\\n\\n It was no use trying the front door. Front doors in Bad Ass were used only by brides and corpses, and Granny had always avoided becoming either. Around the back the snow was piled in front of the door and no one had broken the ice on the water butt.\\n\\n The light was starting to pour out of the sky by the time they dug through to the door and managed to persuade the key to turn.\\n\\n Inside, the big kitchen was dark and chilly and smelled only of snow. It was always dark, but they were used to seeing a big fire in the wide chimney and smelling the thick fumes of whatever it was she was boiling up this time, which sometimes gave you a headache or made you see things.\\n\\n They wandered around uncertainly, calling, until Esk decided they couldn\u0027t put off going upstairs any longer. The clonk of the thumb-latch on the door to the cramped staircase sounded a lot louder than it ought to.\\n\\n Granny was on the bed, with her arms tightly folded across her chest. The tiny window had blown open. Fine snow had blown in across the floor and over the bed.\\n\\n Esk stared at the patchwork quilt under the old woman, because there were times when a little detail could expand and fill the whole world. She barely heard Cern start to cry: she remembered lien father, strangely enough, making the quilt two winters before when the snow was almost as bad and there wasn\u0027t much to do in the forge, and how he\u0027d used all kinds of rags that had found their way to Bad Ass from every part of the world, like silk, dilemma leather, water cotton and tharga wool and, of course, since he wasn\u0027t much good at sewing either, the result was a rather strange lumpy thing more like a flat tortoise than a quilt, and her mother had generously decided to give it to Granny last Hogswatchnight, and ....\\n\\n “Is she dead?” asked Gulta, as if Esk was an expert in these things.\\n\\n Esk stared up at Granny Weatherwax. The old woman\u0027s face looked thin and grey. Was that how dead people looked? Shouldn\u0027t her chest be going up and down?\\n\\n Gulta pulled himself together.\\n\\n “We ought to go and get someone and we ought to go now because it will get dark in a minute,” he said flatly. “But Cern will stay here.”\\n\\n His brother looked at him in horror.\\n\\n “What for?” he said.\\n\\n “Someone has got to stay with dead people,” said Gulta. “Remember when old Uncle Derghart died and Father had to go and sit up with all the candles and things all night? Otherwise something nasty comes and takes your soul off to . . . to somewhere,” he ended lamely. “And then people come back and haunt you.”\\n\\n Cern opened his mouth to start to cry again. Esk said hurriedly, “I\u0027ll stay. I don\u0027t mind. It\u0027s only Granny.”\\n\\n Gulta looked at her in relief.\\n\\n “Light some candles or something,” he said. “I think that\u0027s what you\u0027re supposed to do. And then -”\\n\\n There was a scratching from the windowsill. A crow had landed, and stood there blinking suspiciously at them. Gulta shouted and threw his hat at it. It flew off with a reproachful caw and he shut the window.\\n\\n “I\u0027ve seen it around here before,” he said. “I think Granny feeds it. Fed it,” he corrected himself. “Anyway, we\u0027ll be back with people, we\u0027ll be hardly any time. Come on, Ce.”\\n\\n They clattered down the dark stairs. Esk saw them out of the house and bolted the door behind them.\\n\\n The sun was a red ball above the mountains, and there were already a few early stars out. \\n\\n","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-3.html","bookId":1622,"book":{"id":1622,"title":"Equal Rites (Discworld #3)","description":"Storyline: Equal Rites (Discworld #3) \\n On Discworld, a dying wizard tries to pass on his powers to an eighth son of an eighth son, who is just at that moment being born. The fact that the son is actually a daughter is discovered just a little too late. The town witch insists on turning the baby into a perfectly normal witch, thus mending the magical damage of the wizard\u0027s mistake. But now the young girl will be forced to penetrate the inner sanctum of the Unseen University--and attempt to save the world with one well-placed kick in some enchanted shins! Reissue.\\n","cover":"https://allnovel.net/images/equal-rites-discworld-3.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/equal-rites-discworld-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:12:10 PM"}}
