{"id":95146,"no":34,"title":"Page 34","content":"The steam also rose from the flagstones of the Archchancellor\u0027s personal verandah, and from the teapot on the table. Granny lay back in an ancient cane chair and let the unseasonal warmth creep around her ankles. She idly watched a team of city ants, who had lived under the flagstones of the University for so long that the high levels of background magic had permanently altered their genes, anthandling a damp sugar lump down from the bowl on to a tiny trolley. Another group was erecting a matchstick gantry at the edge of the table. Granny may or may not have been interested to learn that one of the ants was Drum Billet, who had finally decided to give Life another chance. “They say,” she said, “that if you can find an ant on Hogswatch Day it will be very mild for the rest of the winter.” “Who says that?” said Cutangle. “Generally people who are wrong,” said Granny. “I makes a note in my Almanack, see. I checks. Most things most people believe are wrong.” “Like `red sky at night, the city\u0027s alight\u0027,” said Cutangle. “And you can\u0027t teach an old dog new tricks.” “I don\u0027t think that\u0027s what old dogs are for,” said Granny. The sugar lump had reached the gantry now, and a couple of ants were attaching it to a microscopic block and tackle. “I can\u0027t understand half the things Simon says,” said Cutangle, \"although some of the students get very excited about it. “I understand what Esk says all right, I just don\u0027t believe it,” said Granny. “Except the bit about wizards needing a heart.” “She said that witches need a head, too,” said Cutangle. “Would you like a scone? A bit damp, I\u0027m afraid.” “She told me that if magic gives people what they want, then not using magic can give them what they need,” said Granny, her hand hovering over the plate. “So Simon tells me. I don\u0027t understand it myself, magic\u0027s for using, not storing up. Go on, spoil yourself.” “Magic beyond magic,” snorted Granny. She took the scone and spread jam on it. After a pause she spread cream on it too. The sugar lump crashed to the flagstones and was immediately surrounded by another team of ants, ready to harness it to a long line of red ants enslaved from the kitchen garden. Cutangle shifted uneasily in his seat, which creaked. “Esmerelda,” he began, “I\u0027ve been meaning to ask -” “No,” said Granny. “Actually I was going to say that we think we might allow a few more girls into the University. On an experimental basis. Once we get the plumbing sorted out,” said Cutangle. “That\u0027s up to you, of course.” “And, and, it occurred to me that since we seem destined to become a co-educational establishment, as it were, it seemed to me, that is -” “Well?” “If you might see your way clear to becoming, that is, whether you would accept a Chair.” He sat back. The sugar lump passed under his chair on matchstick rollers, the squeaking of the slavedriver ants just at the edge of hearing. “Hmm,” said Granny, “I don\u0027t see why not. I\u0027ve always wanted one of those big wicker ones, you know, with the sort of sunshade bit on the top. If that\u0027s not too much trouble.” “That isn\u0027t exactly what I meant,” said Cutangle, adding quickly, “although I\u0027m sure that could be arranged. No, I mean, would you come and lecture the students? Once in a while?” “What on?” Cutangle groped for a subject. “Herbs?” he hazarded. “We\u0027re not very good on herbs here. And headology. Esk told me a lot about headology. It sounds fascinating.” The sugar lump disappeared through a crack in a nearby wall with a final jerk. Cutangle nodded towards it. “They\u0027re very heavy on the sugar,” he said, “but we haven\u0027t got the heart to do anything about it.” Granny frowned, and then nodded across the haze over the city to the distant glitter of the snow on the Ramtops. “It\u0027s a long way,” she said. “I can\u0027t be keeping on going backwards and forwards at my time of life.” “We could buy you a much better broomstick,” said Cutangle. “One you don\u0027t have to bump start. And you, you could have a flat here. And all the old clothes you can carry,” he added, using the secret weapon. He had wisely invested in some conversation with Mrs Whitlow. “Mmph,” said Granny, “Silk?” “Black and red,” said Cutangle. An image of Granny in black and red silk trotted across his mind, and he bit heavily into his scone. “And maybe we can bring some students out to your cottage in the summer,” Cutangle went on, “for extra-mural studies.” “Who\u0027s Extra Muriel?” “I mean, there\u0027s lots they can learn, I\u0027m sure.” Granny considered this. Certainly the privy needed a good seeing-to before the weather got too warm, and the goat shed was ripe for the mucking-out by spring. Digging over the Herb bed was a chore, too. The bedroom ceiling was a disgrace, and some of the tiles needed fixing. “Practical things?” she said, thoughtfully. “Absolutely,” said Cutangle. “Mmph. Well, I\u0027ll think about it,” said Granny, dimly aware that one should never go too far on a first date. “Perhaps you would care to dine with me this evening and let me know?” said Cutangle, his eyes agleam. “What\u0027s to eat?” “Cold meat and potatoes.” Mrs Whitlow had done her work well. There was. Esk and Simon went on to develop a whole new type of magic that no one could exactly understand but which nevertheless everyone considered very worthwhile and somehow comforting. Perhaps more importantly, the ants used all the sugar lumps they could steal to build a small sugar pyramid in one of the hollow walls, in which, with great ceremony, they entombed the mummified body of a dead queen. On the wall of one tiny hidden chamber they inscribed, in insect hieroglyphs, the true secret of longevity. They got it absolutely right and it would probably have important implications for the universe if it hadn\u0027t, next time the University flooded, been completely washed away. The End","sourceLink":"https://allnovel.net/equal-rites-discworld-3/page-34.html","bookId":1622,"book":{"id":1622,"title":"Equal Rites (Discworld #3)","description":"Storyline: Equal Rites (Discworld #3) On Discworld, a dying wizard tries to pass on his powers to an eighth son of an eighth son, who is just at that moment being born. The fact that the son is actually a daughter is discovered just a little too late. The town witch insists on turning the baby into a perfectly normal witch, thus mending the magical damage of the wizard\u0027s mistake. But now the young girl will be forced to penetrate the inner sanctum of the Unseen University--and attempt to save the world with one well-placed kick in some enchanted shins! Reissue.","cover":"https://allnovel.net/images/equal-rites-discworld-3.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/equal-rites-discworld-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:12:10 PM"}}
