{"id":24821,"no":122,"title":"CHAPTER XVIII","content":"ABOUKIR On the 14th of June, after a retreat across the burning sands of Syria almost as disastrous as the retreat from Moscow through the snows of the Beresina, Bonaparte entered Cairo in the midst of an immense concourse of people. The sheik, who was awaiting him, presented him with a magnificent horse and the Mameluke Roustan. Bonaparte had said in his bulletin dated from Saint-Jean-d\u0027Acre, that he was returning to Egypt to oppose the landing of a Turkish force assembled in the Island of Rhodes. He had been correctly informed upon this point, and the lookouts at Alexandria signalled on the 11th of July that they had sighted seventy-six sails in the offing, of which twelve were men-of-war, flying the Ottoman flag. General Marmont, who was in command, sent courier after courier to Cairo and Rosetta, ordering the commander at Ramanieh to send him all the troops at his disposal, and sent two hundred men to the fort at Aboukir to reinforce that point. That same day Colonel Godard, the commander at Aboukir, wrote to Marmont: The Turkish fleet is moored in the roadstead; I and my men will hold out until the last man falls rather than yield. The 12th and 13th were employed by the enemy in hastening the arrival of some battalions which were behindhand. [Pg 663] There were one hundred and thirty ships in the roadstead on the evening of the 13th, of which thirteen carried seventy-four guns each, nine were frigates, and seventeen gunboats. The remainder were transports. On the following evening Godard and his men had kept their word. He and his men were dead, and the redoubt was captured. Thirty-five men were still shut up in the fort under the command of Colonel Vinache. They held the fort for two days against the whole Turkish army. Bonaparte learned of this while he was at the Pyramids. He started for Ramanieh, where he arrived on the 19th. The Turks, now masters of the fort and the redoubt, had landed their whole artillery. Marmont, who had only eighteen hundred troops of the line, and two hundred sailors composing the nautical legion, with which to oppose the Turks at Alexandria, sent courier after courier to Bonaparte. Fortunately, instead of marching upon Alexandria, as Marmont had feared, or upon Rosetta, as Bonaparte had feared, the Turks with their customary indolence contented themselves with occupying the peninsula, and throwing out to the left of the redoubt a great line of intrenchments bordering upon Lake Madieh. They fortified little mounds some five or six feet in front of the redoubt, placing a thousand men in one and two thousand in another. They had eighteen thousand men in all. But they seemed to have come to Egypt for the sole object of being besieged. On the 23d Bonaparte ordered the French army, which was now only distant a couple of hours\u0027 march from the Turkish army, to advance. The advance-guard, composed of Murat\u0027s cavalry and three of General Destaing\u0027s battalions, with two pieces formed the centre. The division of General Rampon, who had Generals Fugière and Lanusse under his orders, was on the left. On the right General Lannes\u0027s division advanced along the shores of Lake Madieh. Davoust, with two squadrons of cavalry and a hundred dromedaries, was placed between Alexandria and the army,[Pg 664] with orders to head off Mourad Bey, or any one else who should come to the assistance of the Turks, and to keep communication open between Alexandria and the army. Kléber was expected, and he was to take command of the reserve. And finally Menou, who had gone toward Rosetta, found himself at dawn near the end of the bar of the Nile, by the ferry which crosses Lake Madieh. The French were within sight of the intrenchments almost before the Turks were aware of their proximity. Bonaparte formed the columns of attack. General Destaing, who commanded them, marched straight against the fortified hill at the right, while two hundred of Murat\u0027s cavalry, stationed between the two hills, left their positions, and circling both sides of the hill to the right, cut off the retreat of the Turks who were attacked by General Destaing. Meanwhile Lannes marched against the hill on the left, which was defended by two thousand Turks, and Murat sent two hundred more of his cavalry around that hill. Destaing and Murat attacked at almost the same moment and with equal success. The two hills were carried at the bayonet\u0027s point. The fugitive Turks met the French cavalry, and threw themselves into the sea. Destaing, Lannes, and Murat then marched against the village which formed the centre of the peninsula, and attacked in front. A column left the camp at Aboukir and came to the support of the village. Murat drew his sabre, a thing he never did until the last moment, gave the word to his cavalry, charged the column, and drove it back to Aboukir. Meanwhile Lannes and Destaing captured the village. The Turks fled on all sides only to meet Murat\u0027s cavalry as it was returning. The battlefield was already strewed with four or five hundred corpses. The French had only one man wounded. He was a mulatto, a compatriot of my father\u0027s, the commander of a squad of the Hercules Guides. The French now found themselves upon the highroad which covered the Turkish front. [Pg 665] Bonaparte had it in his power to box the Turks up in Aboukir, and harass them with bombs and shells while he was awaiting the arrival of Kléber and Régnier with their divisions; but he preferred to deal a decisive blow and have done with them. He ordered the army to march straight at the second line of defence. Lannes and Destaing, supported by Lanusse, still bore the brunt of the battle, and won the honors of the day. The redoubt which defends Aboukir is the work of the English, and consequently it is constructed on the most scientific plan. It was now defended by nine or ten thousand Turks. It was connected with the sea by a causeway. As the Turks had not had time to dig far enough in the other direction, it did not connect with the Lake of Madieh. A space some three hundred feet in length remained open, but it was occupied by the enemy and swept by the gunners at one and the same time. Bonaparte ordered an attack to the right and the front. Murat, who was ambushed in a grove of palms, was to attack on the left, and crossing the space where there was no causeway, under fire of the gunners, was to drive the enemy before him. The Turks sent out four detachments of about two thousand men each, when they saw these arrangements, who marched against our troops. The battle would inevitably be a desperate one, for the Turks realized that they were shut up in the peninsula with the sea before them and a wall of French bayonets behind. A heavy cannonade directed against the redoubt and the intrenchments of the right was the signal for a fresh attack. General Bonaparte thereupon sent General Fugière forward. He followed the bank, and turned to the right of the Turks. The thirty-second, which was stationed on the left of the hamlet which had recently been captured, was to hold the enemy in cheek, and sustain the eighteenth. It was then that the Turks left their intrenchments and came to meet the French. The latter uttered a joyful shout. This was what they wanted. They rushed upon the enemy[Pg 666] with fixed bayonets. The Turks discharged their guns first, then their pistols, and finally drew their sabres. The French soldiers, who were not even checked by the triple discharge, closed in upon them with their sabres. It was not until then that the Turks realized with what kind of men and weapons they had to reckon. With their guns slung over their shoulders and the sabres hanging by their cords they began a hand-to-hand fight, trying to snatch the terrible bayonets from the rifles, which pierced their breasts as they stretched forth their hands to grasp them. But nothing could stop the eighteenth. They continued to advance at the same pace, driving the Turks before them to the foot of the intrenchments, which they attempted to carry by storm; but there the soldiers were driven back by a hot fire which raked them diagonally. General Fugière, who led the attack, received a bullet in the head in the beginning. The wound was a slight one, and he kept on, and spoke encouragingly to his men. But when a ball carried away his arm he was obliged to stop. Adjutant-general Lelong, who came up with a battery of the seventy-fifth, made heroic efforts to induce the soldiers to defy this hurricane of fire. Twice he led them up to it and twice he was repulsed. The third time he darted forward and was on the verge of springing over the intrenchments when he fell dead. Roland, who was standing near Bonaparte, had for a long time been asking for a command of some sort, which the latter hesitated to give him, until at length he felt that the moment had come for a supreme effort. He turned toward him. \"Very well, go!\" he said to him. \"Thirty-second brigade!\" shouted Roland. And the gallant survivors of Saint-Jean-d\u0027Acre ran off after him, led by their major, Armagnac. Sub-lieutenant Faraud, recovered from his wound, was in the first rank. Meanwhile, Brigadier-general Morange had made another attempt; but he was also driven back, leaving thirty men on the glacis and in the trench. The Turks thought[Pg 667] that they had conquered. Carried away by their custom of cutting off the heads of the dead, for which they received fifty paras apiece, they left the redoubt in disorder, and began the bloody work. Roland pointed them out to his indignant soldiers. \"All our men are not dead,\" he cried; \"some of them are only wounded. Let us save them.\" At that moment Murat caught a glimpse through the smoke of what was going on. He darted forward under the fire of the artillery, passed through it, cut off the redoubt from the village with his cavalry, and fell upon the men who were engaged in the horrible operation of cutting off heads on the other side of the redoubt, while Roland attacked it in front, dashing in among the Turks with his usual reckless daring, where he mowed down the harvesters. Bonaparte saw that the Turks had been taken at a disadvantage by this unexpected onslaught, and he sent Lannes with two battalions. Lannes attacked the redoubt with his usual impetuosity, on the left face and at the gorge. Pressed thus on all sides the Turks tried to reach the village of Aboukir; but Murat was between the village and the redoubt with his cavalry, and behind him was Roland and the thirty-second brigade, and at their right Lannes and his two divisions. Their only refuge was the sea. They threw themselves into it wild with terror; for, since they were not in the habit of giving quarter to their prisoners, they preferred the sea, and the chance of reaching their ships, to death at the hands of the Christians whom they despised. At this juncture the French were masters of the two hills, where they had begun the assault; of the hamlet where the remainder of those who had been defending the hills had taken refuge; of the redoubt which had cost so many brave men their lives. And now they were before the camp, and the Turkish reserve. They fell upon them. Nothing could stop the French soldiers, who were drunk with the carnage which they had just perpetrated. Murat\u0027s[Pg 668] cavalry fell upon the pasha\u0027s guard like a whirlwind, a simoom, a hurricane. Ignorant of the result of the battle, Mustapha, when he heard the shouting and uproar, mounted his horse, and placing himself at the head of his icoglans, he rushed to meet the French, encountered Murat, fired upon him at close range, and inflicted a slight wound. Murat cut off two of his fingers with the first blow of his sabre. With the second he would have cut off his head, but an Arab threw himself in front of the pasha, received the blow and fell dead. Mustapha gave up his cimeter, and Murat sent him to Bonaparte as a prisoner. See Gros\u0027s magnificent picture. The remnant of the army took refuge within the fort of Aboukir; the others were killed or drowned. Never had such annihilation been seen since two armies had marched against each other. Aside from the two hundred Janissaries and the hundred men shut up in the fort, nothing was left of the army of eighteen thousand Turks. Kléber arrived toward the close of the day. He asked about the battle, and inquired where he could find Bonaparte. Bonaparte was musing out on the most advanced point of Aboukir. He was looking at the gulf which had swallowed up the French fleet—his sole hope of returning to France. Kléber went up to him and took him by the arm; and while Bonaparte\u0027s eyes remained veiled and sombre, he exclaimed: \"General, you are the greatest man in the world!\"","sourceLink":"http://novel.tingroom.com/duanpian/3318/90878.html","bookId":398,"book":{"id":398,"title":"The Whites and the Blues","description":"简介： In the preface of The Companions of Jehu I told why that romance had been written; and those who have read it cannot fail to have seen where I borrowed from Nodier in the description of the execution, of which he was an ocular witness. In short, I bo...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3318","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
