{"id":24702,"no":3,"title":"PROLOGUE THE PRUSSIANS ON THE RHINE CHAPTER I","content":"FROM THE H?TEL DE LA POSTE TO THE H?TEL DE LA LANTERNE On the 21st Frimaire of the year II. (11th of December, 1793), the diligence from Besan?on to Strasbourg stopped at nine o\u0027clock in the evening in the courtyard of the H?tel de la Poste, behind the cathedral. Five travellers descended from it, but the youngest only merits our attention. He was a boy of thirteen or fourteen, thin and pale, who might have been taken for a girl dressed in boy\u0027s clothes, so sweet and melancholy was the expression of his face. His hair, which he wore cut à la Titus—a fashion which zealous Republicans had adopted in imitation of Talma—was dark brown; eyelashes of the same color shaded eyes of deep blue, which rested, with remarkable intelligence, like two interrogation points, upon men and things. He had thin lips, fine teeth, and a charming smile, and he was dressed in the fashion of the day, if not elegantly, at least so carefully that it was easy to see that a woman had superintended his toilet. The conductor, who seemed to be particularly watchful of the boy, handed him a small package, like a soldier\u0027s knapsack, which could be hung over the shoulders by a pair of straps. Then, looking around, he called: \"Hallo![Pg 8] Is there any one here from the H?tel de la Lanterne looking for a young traveller from Besan?on?\" \"I\u0027m here,\" replied a gruff, coarse voice. And a man who looked like a groom approached. He was hardly distinguishable in the gloom, in spite of the lantern he carried, which lighted nothing but the pavement at his feet. He turned toward the open door of the huge vehicle. \"Ah! so it\u0027s you, Sleepy-head,\" cried the conductor. \"My name\u0027s not Sleepy-head; it\u0027s Coclès,\" replied the groom, in a surly tone, \"and I am looking for the citizen Charles.\" \"You come from citizeness Teutch, don\u0027t you?\" said the boy, in a soft tone that formed an admirable contrast to the groom\u0027s surly tones. \"Yes, from the citizeness Teutch. Well, are you ready, citizen?\" \"Conductor,\" said the boy, \"you will tell them at home—\" \"That you arrived safely, and that there was some one to meet you; don\u0027t worry about that, Monsieur Charles.\" \"Oh, ho!\" said the groom, in a tone verging upon a menace, as he drew near the conductor and the boy. \"Well, what do you mean with your \u0027Oh, ho\u0027?\" \"I mean that the words you use may be all right in the Franche-Comté, but that they are all wrong in Alsace.\" \"Really,\" said the conductor, mockingly, \"you don\u0027t say so?\" \"And I would advise you,\" continued citizen Coclès, \"to leave your monsieurs in your diligence, as they are not in fashion here in Strasbourg. Especially now that we are so fortunate as to have citizens Lebas and Saint-Just within our walls.\" \"Get along with your citizens Lebas and Saint-Just! and take this young man to the H?tel de la Lanterne.\" And, without paying further heed to the advice of citizen Coclès, the conductor entered the H?tel de la Poste. [Pg 9] The man with the torch followed the conductor with his eyes, muttering to himself; then he turned to the boy: \"Come on, citizen Charles,\" he said. And he went on ahead to show the way. Strasbourg, even at its best, was never a gay, lively town, especially after the tattoo had been beaten for two hours; but it was duller than ever at the time when our story opens; that is to say, during the early part of the month of December, 1793. The Austro-Prussian army was literally at the gates of the city. Pichegru, general-in-chief of the Army of the Rhine, after gathering together all the scattered forces at his command, had, by force of will and his own example, restored discipline and resumed the offensive on the 18th Frimaire, three days before; organizing a war of skirmishing and sharpshooting, since he was powerless to offer battle. He had succeeded Houchard and Custine, who had been guillotined because they had met with reverses, and Alexandre de Beauharnais, who was also in danger of being guillotined. Furthermore, Saint-Just and Lebas were there, not only commanding Pichegru to conquer, but decreeing the victory. The guillotine followed them, charged with executing their decrees the instant they were made. And three decrees had been issued that very day. The first one ordered the gates of Strasbourg to be closed at three o\u0027clock in the afternoon; anyone who delayed their closing, if only for five minutes, did so under pain of death. The second decree forbade any one to flee before the enemy. The rider who put his horse to a gallop, or the foot-soldier who retreated faster than a walk, when turning his back on the enemy on the field of battle, thereby incurred the penalty of death. The third decree, which was due to fear of being surprised by the enemy, forbade any soldier to remove his clothing at night. Any soldier who disobeyed this order, no matter what his rank, was condemned to death. The boy who had just entered the city was destined to[Pg 10] see each of these three decrees carried into effect within six days after his arrival in the city. As we have said, all these circumstances, added to the news which had just arrived from Paris, increased the natural gloominess of the city. This news told of the deaths of the queen, the Duc d\u0027Orléans, Madame Roland, and Bailly. There was talk of the speedy recapture of Toulon from the English, but this was as yet a mere rumor. Neither was the hour liable to make Strasbourg appear to advantage in the new-comer\u0027s eyes. After nine o\u0027clock in the evening the dark, narrow streets were wholly given up to the patrol of the civic guard and of the company of the Propagande, who were watching over the public welfare. Nothing, in fact, could be more depressing and mournful to a traveller newly arrived from a town which is neither in a state of war nor on the frontier than the sound of the nocturnal tramp of an organized body, stopping suddenly at an order given in a muffled tone, and accompanied by the clashing of arms and the exchange of the password each time two squads met. Two or three of these patrols had already passed our young traveller and his guide, when they met another, which brought them to a halt with the challenging, \"Who goes there?\" In Strasbourg there were three different ways of replying to this challenge, which indicated in a sufficiently characteristic way the varying opinions. The indifferent ones replied, \"Friends!\" The moderates, \"Citizens!\" The fanatics, \"Sans Culottes!\" \"Sans Culottes!\" Coclès energetically answered the guard. \"Advance and give the watchword!\" cried an imperious voice. \"Ah, good!\" said Coclès, \"I recognize that voice; it belongs to citizen Tétrell. Leave this to me.\" \"Who is citizen Tétrell?\" asked the boy. \"The friend of the people, the terror of the aristocrats,[Pg 11] an out-and-outer.\" Then, advancing like a man who has nothing to fear, he said: \"It is I, citizen Tétrell!\" \"Ah! you know me,\" said the leader of the patrol, a giant of five feet ten, who reached something like a height of seven feet with his hat and the plume which surmounted it. \"Indeed I do,\" exclaimed Coclès. \"Who does not know citizen Tétrell in Strasbourg?\" Then, approaching the colossus, he added: \"Good-evening, citizen Tétrell.\" \"It\u0027s all very well for you to know me,\" said the giant, \"but I don\u0027t know you.\" \"Oh, yes you do! I am citizen Coclès, who was called Sleepy-head in the days of the tyrant; it was you yourself who baptized me with the name when your horses and dogs were at the H?tel de la Lanterne. Sleepy-head! What, you don\u0027t remember Sleepy-head?\" \"Why, of course I do; I called you that because you were the laziest rascal I ever knew. And who is this young fellow?\" \"He,\" said Coclès, raising his torch to the level of the boy\u0027s face—\"he is a little chap whom his father has sent to Euloge Schneider to learn Greek.\" \"And who is your father, my little friend?\" asked Tétrell. \"He is president of the tribunal at Besan?on, citizen,\" replied the lad. \"But one must know Latin to learn Greek.\" The boy drew himself up and said: \"I do know it.\" \"What, you know it?\" \"Yes, when I was at Besan?on my father and I never spoke anything but Latin.\" \"The devil! You seem to be pretty well advanced for one of your age. How old are you? Eleven or twelve?\" \"I am almost fourteen.\" \"And what made your father send you to Euloge Schneider to learn Greek?\" \"Because my father does not know Greek as well as he does Latin. He taught me all he knew, then he sent me[Pg 12] to Euloge Schneider, who speaks Greek fluently, having occupied the chair of Greek at Bonn. See, this is the letter my father gave me for him. Besides, he wrote him a week ago, informing him that I would arrive this evening, and it was he who ordered my room to be made ready at the H?tel de la Lanterne, and sent citizen Coclès to fetch me.\" As he spoke the boy handed citizen Tétrell the letter, to prove that he had told him nothing but the truth. \"Come, Sleepy-head, bring your light nearer,\" said Tétrell. \"Coclès, Coclès,\" insisted the groom, obeying his former friend\u0027s order nevertheless. \"My young friend,\" said Tétrell, \"may I call your attention to the fact that this letter is not addressed to citizen Schneider but to citizen Pichegru?\" \"Ah! I beg pardon, I made a mistake; my father gave me two letters and I have handed you the wrong one.\" Then, taking back the first letter, he gave him a second. \"Ah! this time we are right,\" said Tétrell. \"To the citizen Euloge Schneider.\" \"éloge Schneider,\" repeated Coclès, correcting in his own way the first name of the public prosecutor, which he thought Tétrell had mispronounced. \"Give your guide a lesson in Greek,\" laughed the leader of the patrol, \"and tell him that the name Euloge means—come, my lad, what does it mean?\" \"A fine speaker,\" replied the boy. \"Well answered, upon my word! do you hear, Sleepy-head?\" \"Coclès,\" repeated the groom, obstinately, more difficult to convince regarding his own name than concerning that of the public prosecutor. In the meantime Tétrell had drawn the boy aside, and, bending down until he could whisper in his ear, he said: \"Are you going to the H?tel de la Lanterne?\" \"Yes, citizen,\" replied the child. [Pg 13] \"You will find two of your compatriots there, who have come here to defend and reclaim the adjutant-general, Charles Perrin, who is accused of treason.\" \"Yes, citizens Dumont and Ballu.\" \"That\u0027s right. Well, tell them that not only have they nothing to hope for their client, but their stay here bodes them no good. It is merely a question of their heads. Do you understand?\" \"No, I do not understand,\" replied the boy. \"What! don\u0027t you understand that Saint-Just will have their heads cut off like two chickens if they remain? Advise them to go, and the sooner the better.\" \"Shall I tell them that you said so?\" \"No, indeed! For them to make me pay for the broken pots, or, rather, for the pots that are not broken.\" Then, straightening up, he cried: \"Very well, you are good citizens, go your way. Come, march, you others!\" And citizen Tétrell went off at the head of his patrol, leaving Coclès very proud of having talked for ten minutes with a man of such importance, and citizen Charles much disturbed by the confidence which had just been reposed in him. Both continued their way in silence. The weather was dark and gloomy, as it is apt to be in December in the north and east of France; and although the moon was nearly at its full, great black clouds swept across its face like equinoctial waves. To reach the H?tel de la Lanterne, which was in the street formerly called the Rue de l\u0027Archévêque, and was now known as the Rue de la Déesse Raison, they had to cross the market square, at the extremity of which rose a huge scaffolding, against which the boy, in his abstraction, almost stumbled. \"Take care, citizen Charles,\" said the groom, laughing, \"you will knock down the guillotine.\" The boy gave a cry and drew back in terror. Just then the moon shone out brilliantly for a few seconds. For an instant the horrible instrument was visible and a pale, sad ray quivered upon its blade. [Pg 14] \"My God! do they use it?\" asked the boy, ingenuously, drawing closer to the groom. \"What! do they use it?\" the latter replied, gayly; \"I should think so, and every day at that. It was Mother Raisin\u0027s turn to-day. In spite of her eighty years she ended her life there. It didn\u0027t do her any good to tell the executioner: \u0027It\u0027s not worth while killing me, my son; wait a bit and I\u0027ll die by myself.\u0027 She was slivered like the rest.\" \"What had the poor woman done?\" \"She gave a bit of bread to a starving Austrian. She said that he had asked her in German and so she thought he was a compatriot, but it was no use. They replied that since the time of I don\u0027t know what tyrant, the Alsatians and the Austrians were not compatriots.\" The poor child, who had left home for the first time, and who had never experienced so many varying emotions in the course of one evening, suddenly felt cold. Was it the effect of the weather or of Coclès\u0027 story? Whatever it was he threw a final glance at the instrument, which, as the moonbeams faded, retreated into the night like a shadow, and then asked, with chattering teeth: \"Are we far from the Lanterne?\" \"Faith, no; for here it is,\" replied Coclès, pointing to an enormous lantern hanging over the doorway, which lighted the street for twenty feet around it. \"It\u0027s time,\" said the boy, with a shiver. And, running the rest of the way, he opened the door of the hotel and darted into the kitchen, where a great fire burning in an immense chimney-piece drew forth a cry of satisfaction from him. Madame Teutch answered the exclamation with a similar one, for, although she had never seen him, she recognized in him the young boy who had been recommended to her care, as she saw Coclès appear in turn on the threshold with his light.","sourceLink":"http://novel.tingroom.com/duanpian/3318/90759.html","bookId":398,"book":{"id":398,"title":"The Whites and the Blues","description":"简介： In the preface of The Companions of Jehu I told why that romance had been written; and those who have read it cannot fail to have seen where I borrowed from Nodier in the description of the execution, of which he was an ocular witness. In short, I bo...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3318","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
