{"id":24738,"no":39,"title":"CHAPTER II","content":"A GLIMPSE OF PARIS—THE INCROYABLES All these great victories naturally had their echo in Paris—Paris, that short-sighted city which has ever had a limited horizon, save when some great national excitement has driven her beyond her material interests. Paris, weary of bloodshed, eagerly sought after pleasure, and was only too glad to turn her eyes toward the theatre of war, so glorious was the drama which was there being enacted. Most of the players of the Comédie-Fran?aise and the Théatre Feydeau, who had been imprisoned as royalists, had been liberated after the 9th Thermidor. Larive, Saint-Prix, Molé, Dazincourt, Saint-Phare, and Elleviou had been received with frantic applause at the Comédie-Fran?aise and at the Feydeau. Everybody rushed to the theatres, where the \"Marseillaise\" was beginning to give place to the \"Reveil du Peuple.\" And at last the jeunesse dorée (gilded youth) of Fréron began to appear. Every day we utter those words \"Fréron\" and \"jeunesse dorée\" without having a clear idea of what they mean. Let us see. There have been two Frérons in France; one was an honorable man, an upright and severe critic, who may perhaps have been mistaken, but who erred in good faith. This was Fréron, senior—Elie-Catherine Fréron. The other knew neither law nor faith, his only religion was hate, his sole motive was vengeance, and his one god was self-interest. This was Fréron, junior—Louis-Stanislas Fréron. The father saw the whole of the eighteenth century pass before him. He was opposed to every innovation in art, and, in the name of Racine and Boileau, he attacked all such in literature. He was opposed to all political innovations, and[Pg 235] attacked them in the name of religion and royalty. He recoiled before none of the giants of modern philosophism.[4] [4] We do not believe that philosophism is good French from the standpoint of the academician, but it expresses our meaning better than philosophy does. He attacked Diderot, who had come from his little town of Langres in sabots and jacket, half priest, half philosopher. He attacked Jean-Jacques, who had come from Geneva, penniless and without a jacket. He attacked D\u0027Alembert, a foundling discovered on the steps of a church, who was for a long time called Jean Lerond, from the name of the place where he was found. He attacked those great lords called Buffon and Montesquieu. Finally, surviving even the anger of Voltaire, who had tried to injure him with his satire, \"The Poor Devil,\" to kill him with his epigrams, and to annihilate him with his comedy of \"The Scotchwoman,\" he stood up and cried out to Voltaire in the midst of his triumph, \"Remember that thou art mortal!\" He died before his two great antagonists, Voltaire and Rousseau. In 1776 he succumbed to an attack of gout, occasioned by the suppression of his journal, \"The Literary Year.\" This had been his weapon, and when it was broken he no longer cared to live. The son, who had for godfather King Stanislas, and, who had been a schoolfellow of Robespierre, drank to the dregs the draught which public opinion had poured into the paternal cup. The injuries accumulated during thirty years upon the father\u0027s head fell like an avalanche of shame upon the son; and as his heart held neither faith nor fidelity, he could not bear up under them. Belief in a duty nobly fulfilled had made the father invincible. The son, having no counterpoise to the scorn which overwhelmed him, became ferocious; wrongfully held in contempt, since he was not responsible for his father\u0027s acts, he resolved to make himself hated on his own account. The laurels which Marat culled in editing \"L\u0027Ami du Peuple\" destroyed Fréron\u0027s rest. He founded \"The Orator of the People.\" [Pg 236] Naturally timid, Fréron could not restrain his cruelty, being too weak and fearful. When sent to Marseilles he became the terror of the city. While Carlier drowned his prisoners at Nantes, and Collot d\u0027Herbois shot his at Lyons with musketry, at Marseilles Fréron did better—he used grape-shot. One day, after a discharge of artillery, suspecting that some had fallen unharmed with those who were struck, and were counterfeiting death, he called out, in order to save the time necessary to search for them: \"Let those who are not harmed stand up, and they will be pardoned.\" The unfortunates who were not hurt trusted in his word, and stood up. \"Fire!\" said Fréron. And the gunners began again, doing their work with more accuracy, for this time no one stood up. When he returned to Paris, Paris had made a step on the road to mercy. The friend of Robespierre became his enemy. The Jacobin took a step backward and became a Cordelier. He scented the 9th Thermidor. He made himself a Thermidorian with Barras and Tallien, he denounced Fouquier-Tinville, and, like Cadmus, he sowed the teeth of the dragon which was called the Revolution, and they sprang up at once amid the blood of the old régime and the filth of the new, in the shape of that jeunesse dorée which took his name, and whose chief he was. The jeunesse dorée, as distinguished from the sans-culottes, who wore short hair, round jackets, trousers, and the red cap, either wore long tresses of hair, revived from the time of Louis XIII., and called \"cadenettes\" (from the name of its inventor, Cadenet, a younger son of Luynes), or hair falling over their shoulders, in what was styled \"dog\u0027s-ears.\" They also revived the use of powder, and wore it plentifully upon their hair, which was turned back with a comb. Their morning costume consisted of a very short frock-coat and small-clothes of black or green[Pg 237] velvet. When in full-dress they wore, instead of this frock-coat, a coat of light color cut square, buttoned over the stomach, with tails coming down to the calves of their legs. Their muslin cravat was high and had enormous ends. The waistcoat was of piqué or white dimity, with broad facings and trimmings; two watch-chains hung over small-clothes of gray or apple-green satin, which came down half-way over the calves of the legs, where they buttoned with three buttons, and were finished off with a knot of ribbon. Silk stockings, striped either red, yellow, or blue, and pumps, which were the more elegant in proportion to their lightness, an opera-hat under the arm, and an enormous cane in the hand, completed the costume of an Incroyable. Now why did those scoffers, who seize upon everything, call the individuals who compose the gilded youth of Paris the incroyables? We are about to tell you. Change of dress did not suffice to distinguish a man from the revolutionists, he must also change his pronunciation. A honeyed dialect was substituted for the rude speech of 1793 and the democratic thou; consequently, instead of rolling their r\u0027s as the pupils of the conservatory do to-day, they suppressed them altogether, and the letter became very near being entirely lost, like the Greek dative. Its bones were taken out of the language, together with its strength, and instead, as formerly, of giving one another their Parrole d\u0027honneur, with a strong emphasis on the consonant, they contented themselves with giving their Paole d\u0027honneu. According to circumstances, they had a gande paole d\u0027honneu, or a petite paole d\u0027honneu; but whichever of these two was used to support something either difficult or impossible to believe, the listener, too polite to contradict the person with whom he was conversing, contented himself with saying: \"It is incoyable\" (incredible), suppressing the r in incroyable. Whereupon the other would say: \"I give you my solemn grande (or, as they said, gande) word of honor.\" And then, of course, no doubt remained. [Pg 238] Hence the designation Incroyable changed to Incoyable, given to the jeunesse dorée. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3318/90795.html","bookId":398,"book":{"id":398,"title":"The Whites and the Blues","description":"简介： In the preface of The Companions of Jehu I told why that romance had been written; and those who have read it cannot fail to have seen where I borrowed from Nodier in the description of the execution, of which he was an ocular witness. In short, I bo...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3318","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
