{"id":24766,"no":67,"title":"CHAPTER XXX","content":"THE PRETENDED INCROYABLE As we have said, the two ladies, excited over their predictions, had scarcely paid any attention to the young man who was waiting his turn. During the long session that Madame de Beauharnais had with the sibyl, Madame Tallien had tried more than once to discover to what class of incroyable the young man in question belonged. But he, evidently little inclined to respond to her attempts at conversation, had drawn his hair over his eyes, his cravat over his chin, and his dog\u0027s-ears over his cheeks, and had settled down in his chair with a sort of grunt, like a man who would not be sorry to shorten the time of waiting by a short nap. Madame de Beauharnais\u0027s long sitting had passed thus:[Pg 366] Madame Tallien pretending to read, and the incroyable pretending to sleep. But as soon as the ladies had gone out, and he had followed them with his eyes until they had disappeared, he presented himself in turn at the door of Mademoiselle Lenormand\u0027s cabinet. The appearance of this new client was so grotesque that it brought a smile to her lips. \"Mademoiselle,\" he said, affecting the ridiculous speech of the young dandies of the day, \"will you have the goodness to tell me the fortunate or unfortunate vicissitudes which destiny has reserved for the person of your humble servant. Nor will he conceal from you that that person is so dear to him that he will learn with gratitude whatever agreeable presages you may impart to him. He must add, however, that owing to his great self-control, he will listen with equanimity to whatever catastrophes with which you may be pleased to threaten him.\" Mademoiselle Lenormand looked at him anxiously for a moment. Did his indifference amount to madness, or was she dealing with one of those young men of the day who took pleasure in mocking the holiest things, and who would, therefore, have no scruple about insulting the sibyl of the Rue Tournon, firmly established though she was in the good opinion of the inhabitants of the Faubourg Saint-Germain. \"Do you wish me to cast your horoscope?\" she asked. \"Yes, my horoscope—a horoscope like that which was cast at the birth of Alexander, son of Philip of Macedon. Without expecting to attain to the renown of the conqueror of Porus, and the founder of Alexandria, I intend some day to make a stir in the world. Have the goodness therefore to prepare whatever may be necessary, and to predict the best of good fortune for me.\" \"Citizen,\" said Mademoiselle Lenormand, \"I employ different methods.\" \"Let us hear what they are,\" said the incroyable, thrusting his stomach forward, and slipping his thumbs into the[Pg 367] armholes of his waistcoat and letting his cane dangle from the cord around his wrist. \"For example, I prophesy by the whites of eggs, the analysis of coffee grounds, spotted or algebraic cards, and I sometimes read the future by means of a cock.\" \"The last would suit me very well,\" said the young man. \"But we should need a living cock, and a glassful of wheat; have you got them?\" \"I have them,\" replied Mademoiselle Lenormand. \"I also use catoptromancy at times.\" \"I am looking for a Venetian mirror; for, as nearly as I can remember,\" said the young man, \"catoptromancy is performed with a Venetian mirror and a drop of water spilled upon it.\" \"Exactly, citizen. You seem to be well informed concerning my art.\" \"Bah!\" said the young man. \"Yes, yes; I take an occasional turn at the occult sciences.\" \"There is also chiromancy,\" observed Mademoiselle Lenormand. \"Ah! that is what I want. All the other practices are more or less diabolical, while chiromancy has never been censured by the Catholic Church, being a science founded upon principles drawn from Holy Writ and transcendental philosophy. As much cannot be said for hydromancy, you will concede, citizeness, which has to do with a ring thrown into water; nor of pyromancy, which consists of placing the victim in the midst of a fire; of geomancy, which is performed by tracing cabalistic signs upon the ground; of capnomancy, where poppy seeds are thrown on burning coals; of coscinomancy, in which the hatchet, the sieve and the tongs are employed; nor, finally, of anthropomancy, in which human victims are sacrificed.\" Mademoiselle watched her interlocutor with a certain uneasiness. Was he speaking seriously? Was he making fun of her? Or did he conceal beneath his assumed indifference a desire to remain unrecognized? [Pg 368] \"Then you prefer chiromancy?\" she asked. \"Yes,\" replied the incroyable; \"for with chiromancy, were you the devil himself, or his wife Proserpine,\" and he bowed gallantly to Mademoiselle Lenormand, \"I should not fear for the safety of my soul, since the patriarch Job has said (verse 7, chapter xxxvii.), \u0027God hath drawn lines in the hands of men in order that each may know his destiny.\u0027 And Solomon, the pre-eminently wise king, added: \u0027Length of life is marked in the right hand, and the lines of the left hand betoken wisdom and glory.\u0027 Finally we read in the prophet Isaiah, \u0027Your hand denotes that you will live a long time.\u0027 Here is mine, what does it say?\" As he spoke, the young incroyable took off his glove and extended a hand that was delicate and well-shaped, although thin and tanned by the sun. Its proportions were perfect, the fingers long and smooth; and he wore no rings. Mademoiselle Lenormand took it and examined it carefully. Then her eyes turned from the young man\u0027s hand to his face. \"Sir,\" said she, \"it must have cost your natural dignity much to clothe yourself as you have, and in so doing, you must have yielded, either to a great curiosity, or to the first expression of an unconquerable feeling. You are wearing a disguise and not your accustomed attire. Your hand is that of a soldier accustomed to wield the sword rather than to twirl the cane of an incroyable, or the switch of a dandy. Neither is this language you now affect natural to you. You know all of these sciences which you have mentioned, but you have learned them while studying others which you deemed more important. You have a taste for occult researches, but your future is not that of a Nicolas Flamel or a Cagliostro. You have asked in jest for a horoscope similar to the one which was cast at the birth of Alexander, son of Philip of Macedon. It is too late to cast the horoscope of your birth, but I can tell you what has happened to you since your birth, and what the future holds in store for you.\" [Pg 369] \"Faith, you are right,\" said the young man in his natural voice, \"and I confess that I am ill at ease in this disguise; neither, as you have said, am I accustomed to this language which I have just now used. Had you been deceived by my language and my attire, I should have said nothing, and would have left you with a shrug of the shoulders. The discovery which you have made in spite of my efforts to deceive you, proves to me that there is something in your art. I well know that it is tempting God,\" he added gloomily, \"to seek to wrest from him the secrets of the future; but where is the man who feels within himself the power to achieve great things, who would not wish to aid, by a knowledge of the future, the events which life holds in store for him? You say that you will tell me of my past life. I ask but a few words on that score, being anxious rather to know the future. I repeat, here is my hand.\" Mademoiselle Lenormand\u0027s eyes rested for a moment on the palm of his hand, then, raising her head, she said: \"You were born on an island, of a family which, though noble, has neither wealth nor renown. You left your country to be educated in France, you entered the service in a special branch, the artillery. You have gained a great victory, which was of immense use to your country, but for which you were poorly recompensed. For a time you thought of leaving France. Fortunately obstacles multiplied and you remained. You have just forced yourself into notoriety by a brilliant stroke which has assured you the support of the future Directory. This very day—and mark well the date—though it has been signalled by the most ordinary events alone, will become one of the most important landmarks of your life. Do you believe in my art now, and shall I continue?\" \"Certainly,\" replied the pretended incroyable, \"and that you may have every facility in your work, I will begin by showing you my real features.\" At these words he took off his hat, threw aside his wig,[Pg 370] untied his cravat, and revealed that head of bronze, of which it has been said that it seemed to have been modelled from an antique medal. He frowned slightly, brushed his hair from his temples with his hand, and his eye grew stern, resolute, almost haughty, as did his voice; and he said, no longer with the lisp of the incroyable, or the gentleness of a man addressing a woman, but with the firmness of a command, as he presented his hand to the sibyl for the third time: \"Look!\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3318/90823.html","bookId":398,"book":{"id":398,"title":"The Whites and the Blues","description":"简介： In the preface of The Companions of Jehu I told why that romance had been written; and those who have read it cannot fail to have seen where I borrowed from Nodier in the description of the execution, of which he was an ocular witness. In short, I bo...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3318","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
