{"id":24780,"no":81,"title":"CHAPTER XII","content":"IN WHICH THE READER WILL MEET SOME OLD ACQUAINTANCES We must now ask our readers to follow us to Milan, where, as we have said, Bonaparte, who no longer called himself Buonaparte, had his headquarters. The same day, and at the very hour when Diane de Fargas recovered her brother in so pitiful and tragic a manner, three men came out of the barracks of the Army of Italy, while three others issued from the adjacent barracks, which were occupied by the Army of the Rhine. General Bonaparte had demanded a reinforcement after his first victories, and two thousand men had been detached from Moreau\u0027s army, and sent, under command of Bernadotte, to the Army of Italy. The six men made their way toward the eastern gate, walking in two separate groups, each at a little distance from the other. This was the gate behind which occurred the numerous duels which resulted from personal rivalry[Pg 437] of valor, and the differences of opinion between the soldiers from the North and those who had always fought in the South. An army is always modelled upon the characteristics of its general. His peculiarities extend to his officers, and from them they spread to the soldiers. The division of the Rhine, which had come South under Bernadotte\u0027s command, was formed upon Moreau\u0027s model. The royalist faction looked longingly toward Moreau and Pichegru. The latter had been all ready to yield, but he had wearied of the indecision of the Prince de Condé. Nor had he been willing to introduce the enemy into France without having determined beforehand the conditions which should circumscribe the rights of the prince whom he was admitting, as well as those of the people who were to receive him. Nothing had actually taken place between himself and the Prince de Condé except a correspondence which had borne no fruit. He had, moreover, resolved to bring about this revolution, not through his military influence, but through that of the high position which his fellow-citizens had bestowed upon him in making him president of the Five Hundred. Moreau\u0027s Republicanism could not be shaken. Careless, moderate, unemotional, with no taste for politics beyond his capacity, he held himself in reserve, sufficiently nattered by the praise which his friends and the royalists had bestowed upon his masterly retreat from the Danube, which they likened to that of Xenophon. His army, therefore, was like him, cold, phlegmatic and submissive to his discipline. The Army of Italy, on the contrary, was composed of our Southern revolutionists—brave hearts who were as impulsive in their opinions as in their courage. Having been the centre for more than a year and a half of the glory which the French arms were reaping before the eyes of all Europe, the attention of that continent was fixed upon them. It could pride itself, not upon masterly re[Pg 438]treats, but upon victories. Instead of being forgotten by the government, as were the armies of the Rhine and the Sambre-et-Meuse, generals, officers and soldiers were overwhelmed with praise and honors, gorged with money and sated with pleasure. Serving first under General Bonaparte—that is to say, under the star which had been shedding a light so brilliant that it had dazzled all Europe—then under Generals Masséna, Joubert, and Augereau, who set the example of the most ardent republicanism, they were, by order of Bonaparte, kept informed of the events which were transpiring at Paris (through the medium of the journals which the general circulated among them), that is to say, of a reaction which threatened to equal that of Vendémiaire. To these men—who did not form their opinions by discussion, but who received them ready-made—the Directory, the heir and successor of the Convention, was still the revolutionary government to whom their services were devoted, as in 1792. They asked but one thing, now that they had conquered the Austrians and thought that they had nothing more to do in Italy, and that was to cross the Alps again, in order to put the aristocrats in Paris to the sword. These two groups on their way to the Eastern gate presented a fair sample of the two armies. One—which, as its uniform denoted, belonged to that tireless infantry which, starting from the foot of the Bastille, had made the tour of the world—consisted of Sergeant-major Faraud, who had married the Goddess of Reason, and his two inseparable companions, Groseiller and Vincent, who had both attained to the rank of sergeant. The other group belonged to the cavalry, and was composed of the chasseur Falou—who, it will be remembered, had been appointed quartermaster-general by Pichegru—and two of his comrades, one a quartermaster, the other a brigadier. Falou, who belonged to the Army of the Rhine, had not advanced a step since his promotion by Pichegru. Faraud, it is true, had remained in the same rank which[Pg 439] he had received at the lines of Weissembourg—the rank which stops so many poor fellows whose education will not permit of their taking the examination necessary for a commission. But he had been twice mentioned in the order of the day of the Army of Italy, and Bonaparte had ordered him brought before him, and had said to him: \"Faraud, you are a fine fellow.\" The result was that Faraud was as well satisfied with these two orders of the day, and Bonaparte\u0027s words, as though he had been promoted to the rank of a sub-lieutenancy. Now, Quartermaster-general Falou and Sergeant-major Faraud had had a few words on the previous evening, which had seemed sufficient to them to warrant this promenade to the Eastern gate—in other words, to use the terms employed under such circumstances, the two friends were about to refresh themselves with a sword-thrust or two. And, in fact, as soon as they were outside the gate, the seconds of both parties began to look for a suitable spot where each would have the advantage of sun and ground. When this was found, the seconds notified the principals, who at once followed them, apparently satisfied by their choice, and promptly prepared to utilize these advantages by throwing aside their foraging caps, coats and waistcoats. Then each turned back the right sleeve as far as the elbow. Faraud had a flaming heart and the words, \"The Goddess of Reason,\" tattooed upon his arm. Falou, less concentrated in his affections, had this Epicurean device, \"Long live wine! Long live love!\" The fight was to be conducted with the infantry swords known as briquets. Each received his weapon from one of his seconds and fell upon his adversary. \"What the devil can one do with such a kitchen knife as this,\" growled chasseur Falou, who was accustomed to the long cavalry sabre and who handled the short sword as if it had been a pen. \"This is only fit to cut cabbages and to scrape carrots.\" [Pg 440] \"It will serve also,\" said Faraud with that peculiar movement of the neck which we have already noticed in him, \"it will serve also, for those who are not afraid to come to close quarters, to shave an enemy\u0027s mustache.\" And making a feint to thrust at his adversary\u0027s thigh, he thrust at the other\u0027s head and was successfully parried. \"Oh!\" said Falou, \"very good, sergeant, the mustaches are according to orders. It is forbidden to cut them off in our regiment, and, above all, to let any one else cut them off. Those who permit such a thing are usually punished. Punished for it,\" he repeated, watching his chance, \"punished for it by a touch on the wrist.\" And with such rapidity that his opponent had no time to parry, Falou made the thrust which is known by the portion of the body at which it is aimed. The blood spurted from Faraud\u0027s arm on the instant, but, furious at being wounded, he cried: \"It is nothing. It is nothing. Let us go on!\" And he stood on guard. But the seconds sprang between the combatants, declaring that honor was satisfied. Thereupon Faraud threw down his weapon and held out his arm. One of the seconds drew a handkerchief from his pocket and, with a dexterity that proved he was no novice at the art, bound up the wound. He was in the midst of this operation, when a group of eight or ten horsemen appeared from behind a clump of trees not twenty yards distant. \"The deuce! The commander-in-chief!\" said Falou. The soldiers looked for some way of escaping the notice of their chief; but he had already seen them, and was urging his horse toward them with whip and spur. They stood motionless, saluting with one hand, and with the other at their side. The blood was streaming from Faraud\u0027s arm. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3318/90837.html","bookId":398,"book":{"id":398,"title":"The Whites and the Blues","description":"简介： In the preface of The Companions of Jehu I told why that romance had been written; and those who have read it cannot fail to have seen where I borrowed from Nodier in the description of the execution, of which he was an ocular witness. In short, I bo...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3318","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
