{"id":71326,"no":6,"title":"Page 6","content":"Half a million miles above Saturn, Mario Rioz was cradled on nothing and sleep was delicious. He came out of it slowly and for a while, alone in his suit, he counted the stars and traced lines from one to another.\\n\\n At first, as the weeks flew past, it was scavenging all over again, except for the gnawing feeling that every minute meant an additional number of thousands of miles away from all humanity. That made it worse.\\n\\n They had aimed high to pass out of the ecliptic while moving through the Asteroid Belt. That had used up water and had probably been unnecessary. Although tens of thousands of world-lets look as thick as vermin in two-dimensional projection upon a photographic plate, they are nevertheless scattered so thinly through the quadrillions of cubic miles that make up their conglomerate orbit that only the most ridiculous of coincidences would have brought about a collision.\\n\\n Still, they passed over the Belt and someone calculated the chances of collision with a fragment of matter large enough to do damage. The value was so low, so impossibly low, that it was perhaps inevitable that the notion of the \"space-float\" should occur to someone.\\n\\n The days were long and many, space was empty, only one man was needed at the controls at any one time. The thought was a natural.\\n\\n First, it was a particularly daring one who ventured out for fifteen minutes or so. Then another who tried half an hour. Eventually, before the asteroids were entirely behind, each ship regularly had its off-watch member suspended in space at the end of a cable.\\n\\n It was easy enough. The cable, one of those intended for operations at the conclusion of their journey, was magnetically attached at both ends, one to the space suit to start with. Then you clambered out the lock onto the ship\u0027s hull and attached the other end there. You paused awhile, clinging to the metal skin by the electromagnets in your boots. Then you neutralized those and made the slightest muscular effort.\\n\\n Slowly, ever so slowly, you lifted from the ship and even more slowly the ship\u0027s larger mass moved an equivalently shorter distance downward. You floated incredibly, weightlessly, in solid, speckled black. When the ship had moved far enough away from you, your gauntleted hand, which kept touch upon the cable, tightened its grip slightly. Too tightly, and you would begin moving back towards the ship -and it toward you. Just tightly enough, and friction would halt you. Because your motion was equivalent to that of the ship, it seemed as motionless below you as though it had been painted against an impossible background while the cable between you hung in coils that had no reason to straighten out.\\n\\n It was a half-ship to your eye. One half was lit by the light of the feeble Sun, which was still too bright to look at directly without the heavy protection of the polarized space-suit visor. The other half was black on black, invisible.\\n\\n Space closed in and it was like sleep. Your suit was warm, it renewed its air automatically, it had food and drink in special containers from which it could be sucked with a minimal motion of the head, it took care of wastes appropriately. Most of all, more than anything else, there was the delightful euphoria of weightlessness.\\n\\n You never felt so well in your life. The days stopped being too long, they weren\u0027t long enough, and there weren\u0027t enough of them.\\n\\n They had passed Jupiter\u0027s orbit at a spot some 30 degrees from its then position. For months, it was the brightest object in the sky, always excepting the glowing white pea that was the Sun. At its brightest, some of the Scavengers insisted they could make out Jupiter as a tiny sphere, one side squashed out of true by the night shadow.\\n\\n Then over a period of additional months it faded, while another dot of light grew until it was brighter than Jupiter. It was Saturn, first as a dot of brilliance, then as an oval, glowing splotch.\\n\\n (\"Why oval?\" someone asked, and after a whiles someone else said, \"The rings, of course,\" and it was obvious.)\\n\\n Everyone space-floated at all possible times toward the end, watching Saturn incessantly.\\n\\n (\"Hey, you jerk, come on back in, damn it. You\u0027re on duty.\"\\n\\n \"Who\u0027s on duty? I\u0027ve got fifteen minutes more by my watch.\"\\n\\n \"You set your watch back. Besides, I gave you twenty minutes yesterday.\"\\n\\n \"You wouldn\u0027t give two minutes to your grandmother.\"\\n\\n \"Come on in, damn it, or I\u0027m coming out anyway.\"\\n\\n \"All right, I\u0027m coming. Holy howlers, what a racket over a lousy minute.\" But no quarrel could possibly be serious, not in space. It felt too good.)\\n\\n Saturn grew until at last it rivaled and then surpassed the Sun. The rings, set at a broad angle to their trajectory of approach, swept grandly about the planet, only a small portion being eclipsed. Then, as they approached, the span of the rings grew still wider, yet narrower as the angle of approach constantly decreased.\\n\\n The larger moons showed up in the surrounding sky like serene fireflies.\\n\\n Mario Rioz was glad he was awake so that he could watch again.\\n\\n Saturn filled half the sky, streaked with orange, the night shadow cutting it fuzzily nearly one quarter of the way in from the right. Two round little dots in the brightness were shadows of two of the moons. To the left and behind him (he could look over his left shoulder to see, and as he did so, the rest of his body inched slightly to the right to conserve angular momentum) was the white diamond of the Sun.\\n\\n Most of all he liked to watch the rings. At the left, they emerged from behind Saturn, a tight, bright triple band of orange fight. At the right, their beginnings were hidden in the night shadow, but showed up closer and broader. They widened as they came, like the flare of a horn, growing hazier as they approached, until, while the eye followed them, they seemed to fill the sky and lose themselves.\\n\\n From the position of the Scavenger fleet just inside the outer rim of the outermost ring, the rings broke up and assumed their true identity as a phenomenal cluster of solid fragments rather than the tight, solid band of light they seemed.\\n\\n Below him, or rather in the direction his feet pointed, some twenty miles away, was one of the ring fragments. It looked like a large, irregular splotch, marring the symmetry of space, three quarters in brightness and the night shadow cutting it like a knife. Other fragments were farther off, sparkling like star dust, dimmer and thicker, until, as you followed them down, they became rings once more.\\n\\n The fragments were motionless, but that was only because the ships had taken up an orbit about Saturn equivalent to that of the outer edge of the rings.\\n\\n The day before, Rioz reflected, he had been on that nearest fragment, working along with more than a score of others to mold it into the desired shape. Tomorrow he would be at it again.\\n\\n Today-today he was space-floating.\\n\\n \"Mario?\" The voice that broke upon his earphones was questioning.\\n\\n Momentarily Rioz was flooded with annoyance. Damn it, he wasn\u0027t in the mood for company.\\n\\n \"Speaking,\" he said.\\n\\n \"I thought I had your ship spotted. How are you?\"\\n\\n \"Fine. That you, Ted?\"\\n\\n \"That\u0027s right,\" said Long.\\n\\n \"Anything wrong on the fragment?\"\\n\\n \"Nothing. I\u0027m out here floating.\"\\n\\n \"You?\"\\n\\n \"It gets me, too, occasionally. Beautiful, isn\u0027t it?\"\\n\\n \"Nice,\" agreed Rioz.\\n\\n \"You know, I\u0027ve read Earth books-.\"\\n\\n \"Grounder books, you mean.\" Rioz yawned and found if difficult under the circumstances to use the expression with the proper amount of resentment.\\n\\n \"-and sometimes I read descriptions of people lying on grass,\" continued Long. \"You know that green stuff like thin, long pieces of paper they have all over the ground down there, and they look up at the blue sky with clouds in it. Did you ever see any films of that?\"\\n\\n \"Sure. It didn\u0027t attract me. It looked cold.\"\\n\\n \"I suppose it isn\u0027t, though. After all, Earth is quite close to the Sun, and they say their atmosphere is thick enough to hold the heat. I must admit that personally I would hate to be caught under open sky with nothing on but clothes. Still, I imagine they like it.\"\\n\\n \"Grounders are nuts!\"\\n\\n \"They talk about the trees, big brown stalks, and the winds, air movements, you know.\"\\n\\n \"You mean drafts. They can keep that, too.\"\\n\\n \"It doesn\u0027t matter. The point is they describe it beautifully, almost passionately. Many times I\u0027ve wondered. \u0027What\u0027s it really like? Will I ever feel it or is this something only Earth-men can possibly feel?\u0027 I\u0027ve felt so often that I was missing something vital. Now I know what it must be like. It\u0027s this. Complete peace in the middle of a beauty-drenched universe.\"\\n\\n Rioz said, \"They wouldn\u0027t like it. The Grounders, I mean. They\u0027re so used to their own lousy little world they wouldn\u0027t appreciate what it\u0027s like to float and look down on Saturn.\" He flipped his body slightly and began swaying back and forth about his center of mass, slowly, soothingly.\\n\\n Long said, \"Yes, I think so too. They\u0027re slaves to their planet. Even if they come to Mars, it will only be their children that are free. There\u0027ll be starships someday; great, huge things that can carry thousands of people and maintain their self-contained equilibrium for decades, maybe centuries. Mankind will spread through the whole Galaxy. But people will have to live their lives out on shipboard until new methods of inter-stellar travel are developed, so it will be Martians, not planet-bound Earthmen, who will colonize the Universe. That\u0027s inevitable. It\u0027s got to be. It\u0027s the Martian way.\"\\n\\n But Rioz made no answer. He had dropped off to sleep again, rocking and swaying gently, half a million miles above Saturn. \\n\\n","sourceLink":"https://allnovel.net/the-martian-way-and-other-stories/page-6.html","bookId":1751,"book":{"id":1751,"title":"The Martian Way and Other Stories","description":"Storyline: This collection of four famous science fiction tales masterfully exemplifies author Isaac Asimov\u0027s ability to create quickly a believable human milieu in the midst of alien circumstances. Each of the long stores also shows his considerable skill in fully fleshing out a speculative scientific or social possibility.\\n","cover":"https://allnovel.net/images/the-martian-way-and-other-stories.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-martian-way-and-other-stories.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:19:25 AM"}}
