{"id":71712,"no":10,"title":"Page 10","content":"Melissa started the car. NPR blared, and she quickly turned it down. “I’m back because I heard about your brush with death. Obviously. And I wanted to see the destruction from the fire. It’s terrible, huh? The woods . . . the windmill . . . even the barn. So much of my stuff, too.” Spencer hung her head. The barn had been Melissa’s apartment all through high school. She had stashed tons of yearbooks, journals, memorabilia, and clothes there. “Mom told me about you, too.” Melissa backed out of the space, almost hitting a CNN cameraman filming the front of the school. “About . . . the surrogate thing. How are you doing?” Spencer shrugged. “It was a shock. But for the best. It’s good that I know.” “Yeah, well.” They passed the journalism barn and then the teachers’ parking area. It was filled with cars that were considerably older and humbler than the ones in the student lot. “I wish you wouldn’t have said I put the idea in your head. Mom really whaled on me for that. She was ruthless.” Spencer felt a hot twinge of anger. Poor you, she wanted to snap. Like that really compared to what Spencer had been through. They came to a stop at the light behind a Jeep Cherokee full of meaty-shouldered boys in baseball caps. Spencer took a long look at her sister. Melissa’s skin looked papery and tired, there was a zit on her forehead, and ligaments stood out in her neck, as if she was clenching her jaw tight. Last week, Spencer had noticed someone who looked suspiciously like Melissa searching through the woods behind their house, not far from where they’d discovered Ian’s body. Aria had found Ian’s ring in the woods just before the fire started—was that what Melissa had been looking for? But before Spencer could ask, her cell phone bleated. She unclasped her purse and pulled it out. Take tomorrow off from school, a text said. Let’s have a spa day. My treat. Mom. Spencer let out an involuntary squeal of delight. “Mom and I are having a spa day tomorrow!” Melissa paled. Several emotions washed over her face at once. “You are?” She sounded incredulous. “Uh-huh.” Spencer hit reply and typed Yes! Definitely. Melissa smirked. “Is she trying to buy your love now?” “No.” Spencer bristled. “It’s not like that.” The light turned green, and Melissa hit the gas. “I guess our roles are reversed,” she said breezily, taking a corner too fast. “Now you’re Mom’s favorite and I’m the outcast.” “What do you mean?” Spencer asked, trying to ignore the fact that Melissa had referred to her as an outcast. “Aren’t you getting along?” Melissa rolled her jaw until the joint cracked. “Forget it.” Spencer debated just letting it drop—Melissa was always overly theatrical. But curiosity got the best of her. “What happened?” They whizzed past Wawa, Ferra’s Cheesesteaks, and the Rosewood Historical District, a string of old buildings that had been converted into candle shops, day spas, and real estate offices. Melissa let out a long sigh. “Before Ian was arrested, Wilden came over and questioned us about the night Ali went missing. He asked if we’d been together the whole time, if we saw anything strange, whatever.” “Yeah?” Spencer had never told Melissa that she’d spied on her and Ian from the stairs that day, worried her sister was going to mention the fight Spencer and Ali had had outside the barn right before Ali disappeared. It was a memory Spencer had suppressed for years, but she’d let it slip to Melissa, even mentioning that Ali had admitted that she and Ian were secretly together and teased Spencer for wanting Ian too. Spencer had shoved Ali out of frustration, and Ali had slipped and hit her head on the rocky path. Luckily, Ali had been okay—until a few minutes later, anyway, when someone else shoved her in that half-dug hole in her backyard. “I told Wilden that we hadn’t seen anything strange and that we’d been together the whole time,” Melissa went on. Spencer nodded. “But after that, Mom asked if I would’ve given Wilden the same story if Ian hadn’t been in the room with me. I told her it was the truth. But after she kept pushing, I slipped up and said we’d been drinking. Mom pounced on me. ‘You need to be really, really sure about what you tell the police,’ she kept saying. ‘The truth really matters.’ She kept grilling me about it until I suddenly wasn’t really sure what happened. I mean, there might have been a couple minutes when I woke up and Ian wasn’t there. I was pretty wasted that night. And I mean, I don’t even know if I was in my room the whole time or . . .” She stopped abruptly, a muscle in her eye twitching. “My point is, I finally buckled. I said that maybe Ian had gotten up . . . even though I really didn’t know if he had or not. And she was like, ‘Okay then. You have to tell the cops that.’ Which is why we called Wilden back in to talk to me again. It was the day after you had that memory of Ian being in our yard when Ali died. My account was just the final nail in the coffin.” Spencer’s jaw dropped. “But that’s the thing,” she whispered. “I’m not sure I remember Ian in the yard anymore. I saw someone . . . but I have no idea if it was him.” Melissa made a left onto Weavertown Road, which was narrow and filled with apple orchards and farm co-ops. “Then I guess we both were wrong. And Ian paid the price.” Spencer sat back, thinking about that second time Wilden had come to their house. The night before, they’d discovered that Mona Vanderwaal was A, and she had almost pushed Spencer over the edge of Floating Man Quarry. The next morning, Melissa had slumped guiltily on the couch. Their parents stood at the back of the room, their arms crossed impassively at their chests, the disappointment obvious on both their faces. “I was a mess that day,” Melissa said, as if reading Spencer’s thoughts. She turned onto the Hastingses’ street, sweeping past the cop cars and landscaping trucks that were parked at the curb. Across the street, a plumber’s truck sat in the Cavanaughs’ driveway. During the latest freeze, one of the family’s main water pipes had burst. “I acted like I was really ashamed for not coming forward with the information sooner,” Melissa said. “But really, I was upset because I felt like I was selling out Ian for something I wasn’t sure he’d done.” So that was why Melissa had seemed so sympathetic to Ian when he was in prison. “We should go to the cops,” she said. “Maybe they’ll drop the case against Ian.” “There’s nothing we can do now.” Melissa gave her a wary sidelong glance, and Spencer wanted to ask if she was in contact with Ian, too. She had to be, didn’t she? But there was something closed-off about Melissa’s expression as she pulled up the driveway and into the garage. Her fingers gripped the steering wheel tightly, even after they’d come to a complete stop. “Why do you think Mom pushed you to say Ian was guilty?” she asked instead. Melissa turned, reaching for her Foley + Corinna purse from the backseat. “Maybe she sensed something was wrong with my story and was just trying to get the truth out of me. Or maybe . . .” An uncomfortable look crossed her face. “Maybe . . . what?” Spencer pressed. Melissa shrugged, pressing her thumb on the Mercedes logo in the middle of the steering wheel. “Who knows? Maybe she just felt guilty because she wasn’t exactly Ali’s biggest fan.” Spencer squinted, feeling more lost than before. As far as she knew, her mom had liked Ali as much as she’d liked Spencer’s other friends. If anyone hadn’t liked Ali, it was Melissa. Ali had stolen Ian from her. Melissa gave Spencer a taut smile. “I don’t even know why I brought any of this up,” she said breezily, patting Spencer’s shoulder. Then she stepped out of the car. Spencer watched numbly as Melissa navigated around her dad’s line of power tools and into the house. Her head felt like an upended suitcase, the contents of her brain like jumbled clothes all over the floor. Everything her sister just said was crazy. Melissa had been wrong about Spencer’s adoption, and she was wrong about this, too. The interior lights in the Mercedes snapped off. Spencer unbuckled her seat belt and climbed out of the car. The garage smelled like a dizzying combination of motor oil and fumes from the fire. In the Mercedes side mirror she caught a glimpse of a flash of dark hair across the street. It felt like someone’s eyes were on her back. When she turned, there was no one there. She reached for her phone, about to call Emily or Hanna or Aria and tell them what Melissa just said about Ian. But then she noticed an alert on her screen. One new text message. As she pressed read, an ache of dread wormed its way through her abdomen. All those clues I’ve given you are right, Little Liar—just not in the way you think. But since I’m such a nice person, here’s another hint. There’s a major cover-up taking place right under your nose . . . and someone close to you has all the answers.—A Chapter 8 Hanna, Interrupted Bright and early on Tuesday morning, Hanna’s father navigated a narrow, woodsy back road somewhere in Bumblefuck, Delaware. Isabel, who was sitting in the front passenger seat, suddenly leaned forward and pointed. “There it is!” Mr. Marin cut the wheel sharply. They veered onto a blacktopped road and stopped at a security gate. The plaque on the bars said THE PRESERVE AT ADDISON-STEVENS. Hanna slumped in the backseat. Mike, who was sitting next to her, squeezed her hand. They’d been driving around lost for a half hour. Even the GPS didn’t know where they were—it kept bleating “Recalculating route!” without actually recalculating anywhere for them to go. Hanna had hoped with all her heart that this place didn’t exist. All she wanted was to go home, snuggle with Dot, and forget about this whole train wreck of a day. “Hanna Marin, checking in,” Hanna’s father said to a khaki-clad man in the security hut. The guard consulted his clipboard and nodded. The gate behind him slowly lifted. The past twenty-four hours had galloped by, everyone rushing around and making decisions about Hanna’s life without bothering to ask her opinion. It was as if she were a helpless baby or a troublesome pet. After her panic attack at breakfast, Mr. Marin called the hospital Hanna was sure A had recommended. And wouldn’t you know it, the Preserve at Addison-Stevens was able to accommodate Hanna the very next day. Next, Mr. Marin called up Rosewood Day and told Hanna’s guidance counselor that Hanna would be missing two weeks of school, and if anyone asked, she was visiting her mom in Singapore. Then he rang Officer Wilden and told him that if the press showed up at the hospital, he would sue the entire police force. And finally, in a move that further complicated how Hanna felt about her dad, he looked squarely at Kate, who was still lingering in the kitchen, no doubt loving every minute of this, and said that if Hanna’s visit to the hospital got out to anyone at school, he’d immediately blame her. Hanna was so thrilled that she didn’t bother to point out that even if Kate kept quiet about Hanna’s disappearance, it didn’t mean A would.","sourceLink":"https://allnovel.net/heartless-pretty-little-liars-7/page-10.html","bookId":2384,"book":{"id":2384,"title":"Heartless (Pretty Little Liars #7)","description":"Storyline: Heartless (Pretty Little Liars #7) The newest installment in Sara Shepard’s bestselling Pretty Little Liars series is packed with juicy drama and delicious surprises that will keep readers guessing to the very end. Hanna, Aria, Emily, and Spencer have been telling some outrageous tales; only, the proof always seems to go missing. The friends insist they’re telling the truth, but all of Rosewood thinks they’re just out for attention—and nobody likes a girl who cries wolf. So when the big bad killer comes after them, will anyone believe the girls. . . or will they be the next to disappear?","cover":"https://allnovel.net/images/heartless-pretty-little-liars-7.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heartless-pretty-little-liars-7.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:15 AM"}}
