{"id":71713,"no":11,"title":"Page 11","content":"Hanna’s father continued up the drive. Isabel shifted in her seat. Hanna stroked the two pieces of Time Capsule flag that were carefully nestled in her purse, one of them Ali’s, the other the piece she’d found at the Rosewood Day coffee bar last week. She didn’t want to let either flag out of her sight. Mike craned his neck, trying to get a view of the facility. Unlike Kate, Hanna didn’t have to worry about Mike uttering a word about this—she’d threatened to make her boobs off-limits if he did.\\n\\n They pulled into a circular roundabout. A stately white building with Grecian columns and small terraces on the second and third floors loomed in front of them, looking more like a railroad baron’s mansion than a hospital. Mr. Marin killed the ignition, and both he and Isabel turned around. Hanna’s dad attempted a smile. Isabel still had that pitying, puckered-lips face she’d been making all morning.\\n\\n “It looks really nice,” Isabel tried, gesturing at the bronze sculptures and carefully maintained topiaries in the doorway. “Like a palace!”\\n\\n “It does,” Mr. Marin agreed quickly, releasing his seat belt. “I’ll get your stuff out of the trunk.”\\n\\n “No,” Hanna snapped. “I don’t want you to come in, Dad. And I especially don’t want her.” She nodded at Isabel.\\n\\n Mr. Marin’s eyes narrowed. He was probably about to say that Hanna needed to show Isabel some respect, she was going to be her stepmom soon, blah, blah, blah. But Isabel laid an orangey, cronelike hand on his arm. “It’s okay, Tom. I understand.” Which made Hanna’s scowl even deeper.\\n\\n She shot out of the car and began to haul her suitcases out of the trunk. A full wardrobe had come along—just because she was being committed didn’t mean she was going to walk around in a hospital gown and Crocs. Mike climbed out too and loaded the suitcases onto a large, unwieldy cart and pushed them into the facility. The lobby was a wide, marble-floored expanse that smelled like the clementine soap she kept on her dressing table. There were large, modern oil paintings on the walls, a bubbling fountain in the center, and a wide stone desk at the back. The receptionists wore white lab coats, just like skin care specialists at Kiehl’s, and youngish, attractive people sat on wheat-colored sofas, laughing and talking.\\n\\n “This doesn’t look like Alcatraz,” Mike said, scratching his head.\\n\\n Hanna’s eyes darted back and forth. Okay, the lobby was nice, but it had to be a front. These people were probably actors rented out for the day, like the Shakespearean troupe Spencer’s parents had hired to perform A Midsummer Night’s Dream for her thirteenth birthday party. Hanna was sure the real patients were hidden in the back of the building, probably in wire-mesh dog kennels.\\n\\n A blond woman wearing a wireless headset and a sage sheath dress rushed over. “Hanna Marin?” She stuck out her hand. “I’m Denise, your concierge. We’re looking forward to having you stay with us.”\\n\\n “Uh, good for you,” Hanna deadpanned. There was no way she was going to kiss this woman’s ass and say she was looking forward to it, too.\\n\\n Denise turned to Mike and smiled apologetically. “We can’t have visitors past this point. You’ll have to say your good-byes here, if that’s okay.”\\n\\n Hanna gripped Mike’s hand, wishing he were a teddy bear she could drag inside with her. Mike pulled Hanna out of earshot. “Now listen.” His voice dropped an octave. “I snuck a Pepperidge Farm cheese Danish into your red suitcase. Inside it is a file. You can saw through the bars of your room and slip out when the guards aren’t looking. It’s the oldest trick in the book.”\\n\\n Hanna laughed nervously. “I don’t really think there are going to be bars on the doors.”\\n\\n Mike put a finger to his lips. “You never know.”\\n\\n Denise reappeared and placed her arm on Hanna’s shoulder, telling her it was time to go. Mike gave her a long kiss, gestured suggestively at her red suitcase, and then walked backward toward the entrance. One of his shoes was untied; the lace flapped against the marble floor. His Rosewood Day lacrosse bracelet flopped around his wrist. Tears blurred Hanna’s eyes. They’d only been an official couple for three days. This wasn’t fair.\\n\\n When he was gone, Denise shot Hanna a crisp, rehearsed smile, swiped a card through a reader at a door at the far end of the lobby, and ushered Hanna into a corridor. “Your room is just through here.”\\n\\n A strong scent of mint wafted through the air. Surprisingly, the corridor was as nice as the lobby, with lush, potted plants, black-and-white photographs, and carpeting that didn’t appear to be speckled with blood or tufts of hair torn straight from crazy people’s scalps. Denise stopped at a door marked 31. “Your home away from home.”\\n\\n The door opened into a dark room. It had two queen-size beds, two desks, two walk-in closets, and a big picture window that overlooked the front drive.\\n\\n Denise looked around. “Your roommate isn’t here right now, but you’ll meet her soon enough.” Then she explained the protocol at the facility—Hanna would be assigned to a therapist, and they would meet anywhere from a few times a week to once a day. Breakfast was at nine, lunch noon, and dinner six. Hanna was free to do what she wished for the rest of the day, and Denise encouraged Hanna to meet and mingle with the other residents—they were all very nice. Right, Hanna thought wryly. Did she look like the kind of girl who made friends with schitzos?\\n\\n “Privacy is of the utmost importance to us, so your door has a lock and only you, your roommate, and the security guards have the key. And there’s one more thing we need to take care of before I leave,” Denise added. “I need you to surrender your cell phone.”\\n\\n Hanna flinched. “W-what?”\\n\\n Denise’s lips were candy pink. “Our mantra here is ‘no outside influences.’ We only allow phone calls between four and five P.M. on Sundays. We don’t allow you to surf the Internet or read the paper, and we don’t allow live TV. We do have an extensive selection of DVDs for you to choose from. And lots of books and board games!”\\n\\n Hanna opened her mouth, but only a small, squeaky ohh sound came out. No TV? No Internet? No phone calls? How the hell was she supposed to talk to Mike? Denise held out her palm, waiting. Helplessly, Hanna handed over the iPhone and watched as Denise wound the little earbuds around the device and dropped it in her lab coat pocket.\\n\\n “Your schedule is on your nightstand,” Denise said. “You have an evaluation with Dr. Foster at three today. I really think you’ll enjoy it here, Hanna.” She squeezed Hanna’s hand and left. The door swished shut.\\n\\n Hanna collapsed on her bed, feeling like Denise had just beaten her up. What the hell was she going to do here? Peering out the window, she saw Mike climbing back into her dad’s car. The Acura slowly pulled away. Hanna was suddenly gripped with the same panic she used to experience when her parents dropped her off at Rosewood Happyland Day Camp every summer morning. It’s only for a couple hours, her dad always used to say when Hanna tried to convince him that she’d be happier accompanying him to work instead. And now, he’d shipped her off to the Preserve at the slightest provocation, falling for A’s fake guidance counselor note. As if counselors at Rosewood Day even noticed the students! But her dad seemed thrilled to get rid of her. Now he could live his perfect life with perfect Isabel and perfect Kate in Hanna’s house.\\n\\n Hanna twisted the blinds shut. Nice job, A. So much for A being their BFF and wanting them to hunt down Ali’s true killer—there wasn’t much Hanna could do locked up in the nuthouse. But maybe what A really wanted was for Hanna to be crazy, miserable, and isolated from Rosewood forever.\\n\\n If that was the case, A had most definitely succeeded.\\n\\n Chapter 9\\n\\n Aria Crosses Over\\n\\n Tuesday after school, Aria stood on the sidewalk in downtown Yarmouth, a town a few miles from Rosewood. Dirty piles of slush from last week’s snow lined the sidewalks, making the stores look dingy. There was a chalkboard in front of the Yee-Haw Saloon, advertising that it was Drink Three Beers, Get Two Free night. The neon sign in the window of the salon next door was half burnt out so that only lon was illuminated.\\n\\n Aria took a deep breath and faced the store in front of her, the reason she’d come. YE OLDE MYSTICK SPIRIT SHOPPE, said the calligraphy on the awning. There was a neon pentacle in the window and a green sign on the door that read TAROT CARDS, PALM READINGS, PAGAN, WICCAN, CURIOS. And underneath that, SEANCES AND OTHER PSYCHIC SERVICES OFFERED HERE. INQUIRE INSIDE.\\n\\n After Aria’s talk with Byron yesterday, she’d become more and more convinced that they’d seen Ali’s ghost. It made so much sense—for months, Aria had sworn someone had been watching her, looming near her old bedroom window, peeking out of the thick woods, ducking out of sight around a corner at Rosewood Day. In some of those instances, the girl might’ve been Mona Vanderwaal, collecting secrets as A . . . but maybe not always. What if Ali had something to tell Aria and the others about the night she died? Wasn’t it their duty to listen?\\n\\n Bells tinkled as she entered. The shop smelled like patchouli, probably from the sticks of incense that smoldered in every corner. Crystal amulets, apothecary bottles, and dragon-inscribed chalices lined the shelves.\\n\\n A radio was perched on a shelf behind the register, tuned to the news. “The Rosewood police are investigating the cause of the fire that decimated ten acres of suburban woods and almost killed Rosewood’s Pretty Little Liars,” the WKYW reporter squawked, the sound of typing in the background.\\n\\n Aria let out a low growl. She hated their new nickname. It made them sound like deranged Barbie dolls.\\n\\n “In related news,” the reporter added, “the police are teaming up with the FBI to broaden the search for Miss DiLaurentis’s alleged killer, Ian Thomas. There’s also some discussion over whether Mr. Thomas had accomplices. More to come after this short break.”\\n\\n Someone cleared his throat, and Aria looked up. A balding guy in his twenties in a vest made out of what looked like horsehair was slumped by the register. HI, I’M BRUCE, said his name tag. RESIDENT WITCH. There was a musty, ornately bound book in his lap, and he was studying her as if he thought she might shoplift. Aria backed away from the table of ritual oils and gave him a sweet smile.\\n\\n “Uh, hi.” Aria’s voice cracked. “I’m here for the seance. It starts in fifteen minutes, right?” She’d found a seance schedule on the store’s website.\\n\\n The shopkeeper flipped a page, looking bored. He slid a clipboard across the table. “put your name on the list. It’s twenty bucks.”\\n\\n Aria rifled through her yak-fur bag and scraped together a couple of limp bills. Then she leaned over and wrote her name on the sign-in sheet. Three other people had registered for today’s event.\\n\\n “Aria?”\\n\\n She jumped and looked up. Standing next to a wall of voodoo talismans was a boy in a Rosewood Day blazer, a yellow rubber Rosewood Day lacrosse bracelet circling his wrist, and a huge, pleased smile on his face.\\n\\n “Noel?” Aria sputtered. Noel Kahn was her brother’s best friend, the typicalest Typical Rosewood Boy she’d ever met, and just about the last person she’d ever expect to see in a place like this. Back in sixth and seventh grade, when being popular mattered, Aria had had a huge crush on Noel—but of course he was crazy for Ali instead. Everyone loved Ali. Irony of ironies, the moment she’d stepped off the plane from Iceland at the beginning of this year, Noel had been all over her, suddenly finding her exotic instead of kooky. Or maybe he finally noticed she had boobs. \\n\\n","sourceLink":"https://allnovel.net/heartless-pretty-little-liars-7/page-11.html","bookId":2384,"book":{"id":2384,"title":"Heartless (Pretty Little Liars #7)","description":"Storyline: Heartless (Pretty Little Liars #7) \\n The newest installment in Sara Shepard’s bestselling Pretty Little Liars series is packed with juicy drama and delicious surprises that will keep readers guessing to the very end. \\n Hanna, Aria, Emily, and Spencer have been telling some outrageous tales; only, the proof always seems to go missing. The friends insist they’re telling the truth, but all of Rosewood thinks they’re just out for attention—and nobody likes a girl who cries wolf. So when the big bad killer comes after them, will anyone believe the girls. . . or will they be the next to disappear?\\n","cover":"https://allnovel.net/images/heartless-pretty-little-liars-7.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heartless-pretty-little-liars-7.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:15 AM"}}
