{"id":71726,"no":24,"title":"Page 24","content":"“It wasn’t in her bedroom,” Tara cried. She pointed toward the hall. “It was on the window seat near the lobby.”\\n\\n “That’s impossible!” Iris screamed, whirling around and facing Dr. Felicia again. Her eyes yo-yoed from the magazine in Dr. Felicia’s fist to Hanna’s stricken face. “And you. You tried to come off as so cool, Hanna. But you’re just as messed up as everyone else in here.”\\n\\n “Pretty Little Liar,” a girl across the room teased.\\n\\n A huge lump formed in Hanna’s throat. Now all eyes were on her again. She wanted to get up and run out of the room, but it felt like her butt was stitched into the seat. “I’m not a liar,” she said in a small voice.\\n\\n Iris snorted, looking Hanna up and down disdainfully, as if Hanna had suddenly sprouted a rash of zits all over her face and arms. “Whatever.”\\n\\n “Girls, stop!” Dr. Felicia pulled Iris by her sleeve. “And, Iris and Tara, you both broke the rules and you’re both in trouble.” She shoved People into her back pocket, then pulled Tara to her feet, grabbed Iris’s arm, and marched both girls out the door. Before they left, Tara turned around and shot Hanna a smirk.\\n\\n “Iris,” Hanna pleaded to Iris’s receding back, “it’s not what you think!”\\n\\n Iris turned in the doorway, staring at Hanna blankly, as if she were a stranger. “Sorry, but I don’t talk to freaks.” And then she whirled around and followed Felicia down the hall, leaving Hanna behind.\\n\\n Chapter 21\\n\\n The Truth Hurts\\n\\n A big Greyhound huffed in the parking lot of the Lancaster bus station, its final destination, Philadelphia, emblazoned above the windshield. Emily tentatively climbed aboard, breathing in the smell of new upholstery and heavy-duty bathroom cleaner. Even though she’d only spent a few days with Lucy and her family, the bus seemed jarringly modern, almost monstrous.\\n\\n Emily had barely said a word to Lucy after Lucy admitted that Wilden had been her dead sister’s old boyfriend. Lucy had repeatedly asked Emily what was wrong, but Emily said she was fine—just tired. What could she say? I know your sister’s old boyfriend. I think he really might have killed Leah. There’s a hole in the back of someone’s yard where he might have dumped her.\\n\\n Her brain had been on warp speed ever since, circling memory after memory of that horrible time. The day after Ali vanished, after their talk with Mrs. DiLaurentis, Emily and her friends went in opposite directions. Emily had passed right by the big hole where they’d eventually find the body.\\n\\n The workers, she remembered, had been filling the hole with concrete that very day. All their cars were along the curb next to the DiLaurentises’ lawn. There was one at the end that she’d studied for a second or two, wondering where she’d seen it before. It was an old black sedan, like something out of a sixties or seventies movie. It was the same car that screeched up to the Rosewood Day Lower School curb the day Ali bragged to everyone that she was going to find a piece of the Time Capsule flag. After his fight with Ian, Jason DiLaurentis had yanked open the passenger door to that car and slumped inside. It was the same car that chugged outside the DiLaurentis house the day Emily and the others tried to steal Ali’s flag. And here it was in her memory again, looming at the DiLaurentises’ house the day the concrete covered up that body for three long years. That car belonged to Darren Wilden.\\n\\n The bus pulled away a few minutes later, the green fields of Lancaster disappearing behind them. There were only four other passengers, so Emily had a row to herself. Spying an outlet near her feet, she leaned down, plugged in her cell phone, and switched it on. The screen glowed with life.\\n\\n Emily had to do something about what she’d learned, but what? If she called Spencer, Hanna, or Aria, they’d tell her she was crazy for thinking Ali was alive and for following A’s instructions to go to Amish Country. She couldn’t call her parents, either—they thought she was in Boston. And she couldn’t call the police—Wilden was the police.\\n\\n It was incredible that Wilden had really once been Amish. Emily knew very little about his life, only that he’d been a rebel at Rosewood Day but then had reinvented himself as a cop. It probably wouldn’t take too much effort to find out when Wilden had left the community and started school at Rosewood Day, though, and when he spoke to Emily and the others in the hospital, he’d mentioned that he’d lived with his uncle in high school. According to Lucy, Wilden had convinced Leah, Lucy’s sister, to leave the community as well. Maybe when she refused, he’d gotten angry . . . and made plans to do away with her for good.\\n\\n Wilden could have talked to Ali about her secret dreams to run away since he and Jason were friends. Wilden might have even promised Ali to help her run away for good, sneaking her out of Rosewood the night she went missing. He dumped a body into the hole in the DiLaurentises’ backyard, making it look like Ali had been killed. But the body in that hole didn’t belong to Ali. It belonged to the girl who broke Wilden’s heart.\\n\\n Horribly, it all fit. It explained why Leah had never been found. It explained why Ali showed up in the woods last Saturday and why Wilden was dissuading the police force from investigating the possibility that Ali was alive—if they realized it wasn’t her body in that hole, they’d have to figure out whose body it was. It was why Wilden didn’t believe in A and didn’t buy that Ian knew a secret about what happened that night. A had been right all along—there had been a secret. But it wasn’t about Ali’s death. It was about who had been killed in Ali’s place.\\n\\n Emily stared at the graffiti someone had drawn on the wall of the bus under the window. MIMI LUVS CHRISTOPHER. TINA HAS A FAT ASS. There was even a sketch of two fat butt cheeks next to it. Ali was out there, somewhere, just as she’d always known. But where had she been all this time? It seemed implausible that a seventh grader could survive on her own. or perhaps she’d known someone who’d taken her in. Why hadn’t she contacted Emily to let her know she was okay? Or maybe she hadn’t wanted to contact anyone. Maybe she’d decided to forget her entire life in Rosewood, even her four best friends.\\n\\n Emily’s phone beeped, signaling three unread texts. She scrolled through her inbox. Two were from her sister Caroline; both subject lines read People Survey. Aria had sent a text too; its subject line said We need to talk.\\n\\n An old woman at the front of the bus coughed. The bus rolled past a farm, and the cabin temporarily smelled like manure. Emily moved the cursor from text to text, trying to decide which to read first. Just then, her phone pinged again, this time with a text from an unknown number. Her pulse raced. This had to be from A. And for once, Emily couldn’t wait to know what A had to say. She pressed read immediately.\\n\\n It was a photo text. The picture was of a bunch of blurry papers fanned out on a table. The top document was titled ALISON DILAURENTIS DISAPPEARANCE: TIMELINE. The paper below it said INTERVIEW, JESSICA DILAURENTIS, JUNE 21, 10:30 P.M. Another paper had a crest of something called the Preserve at Addison-Stevens, with the last name “DiLaurentis” shown. A red stamp on each of the papers said PROPERTY OF ROSEWOOD POLICE DEPARTMENT. EVIDENCE. DO NOT REMOVE.\\n\\n Emily gasped.\\n\\n Then, she noticed a final piece of paper peeking out from underneath the others. Emily squinted until her eyes hurt. DNA REPORT, it said. But Emily couldn’t read the results.\\n\\n “No,” Emily moaned, feeling like she was going to explode. Then, as the bus went over a bone-jarring bump, she noticed an accompanying note with the photo.\\n\\n Wanna see for yourself? The evidence room is in the back of the Rosewood police station. I’ll leave a door open.—A\\n\\n Chapter 22\\n\\n Ali Returns . . . Sort Of\\n\\n Friday after school, Noel picked Aria up at Byron’s house. As she got in the car, he leaned over and gave her a little kiss on the cheek. Despite the butterflies eating away at Aria’s stomach lining, she felt a thrill run down her spine.\\n\\n They drove through the winding streets of various neighborhoods, passing the old farmhouses and the township playground that still had a couple of discarded Christmas trees at the far end of the parking lot. Neither Aria nor Noel spoke, though the silence felt comfortable instead of awkward. Aria was grateful not to have to scramble for small talk.\\n\\n Aria’s phone rang just as they were turning onto Ali’s old street. Private caller, said the screen. Aria answered. “Ms. Montgomery?” chirped a voice. “This is Bethany Richards from Us Weekly!”\\n\\n “Sorry, not interested,” Aria said quickly, cursing herself for answering.\\n\\n She was about to hang up the phone when the reporter breathed in sharply. “I just wanted to know if you had a response to the People article.”\\n\\n “What People article?” Aria snapped. Noel glanced at her worriedly.\\n\\n “The one with the poll that says ninety-two percent of people surveyed think you and your friends killed Alison DiLaurentis!” The reporter sounded giddy.\\n\\n “What?” Aria gasped. “It’s not true!” Then she stabbed end and dropped her phone into her bag. Noel gazed at her, an anxious look on his face. “There’s an article in People that says we killed Ali,” she whispered.\\n\\n Noel’s eyebrows knit together in a v. “Jesus.”\\n\\n Aria pressed her head to the window, staring vacantly at a passing green sign for the Hollis Arboretum. How on earth could people believe such a crazy thing? Just because of their stupid nickname? Because they hadn’t wanted to answer any of the press’s rude, prying questions?\\n\\n They pulled up to Ali’s old cul-de-sac. Aria could smell the singed remains from the fire even through the rolled-up windows. The trees were twisted and black, like decomposed limbs, and the Hastingses’ windmill was now a pulpy, incinerated carcass. But the worst thing was the Hastingses’ barn. Half of it had collapsed, nothing more than a bunch of dark, ruined planks on the ground. The old porch glider, once painted antique white, was now a dirty, rusted color, hanging creakily by one hinge. It swayed gently, as if a ghost were lazily swinging back and forth.\\n\\n Noel drew his bottom lip into his mouth, eyeing the barn. “It’s like the House of Usher.”\\n\\n Aria gawked at him, amazed. Noel shrugged. “You know. The Poe story where the crazy guy buries his sister in that old, ruined, scary house? And for a while he feels really unsettled and even crazier, and it’s because it turns out she’s not really dead?”\\n\\n “I can’t believe you know that story,” Aria said, pleased.\\n\\n Noel looked hurt. “I’m in AP English, same as you. I do read from time to time.”\\n\\n “I didn’t mean it like that,” Aria said quickly, although she wondered if she kind of did.\\n\\n They parked in front of the DiLaurentises’ house and got out. The new owners, the St. Germains, had moved back in after the Ali media circus had died down, but they didn’t look to be home, which was a relief. Even better, there wasn’t a single news van parked at the curb. Then Aria spied Spencer at her mailbox, a stack of envelopes in her hand. Spencer saw Aria at the exact same time. Her eyes shifted from Aria to Noel, looking a little confused. “what are you guys doing here?” she blurted. \\n\\n","sourceLink":"https://allnovel.net/heartless-pretty-little-liars-7/page-24.html","bookId":2384,"book":{"id":2384,"title":"Heartless (Pretty Little Liars #7)","description":"Storyline: Heartless (Pretty Little Liars #7) \\n The newest installment in Sara Shepard’s bestselling Pretty Little Liars series is packed with juicy drama and delicious surprises that will keep readers guessing to the very end. \\n Hanna, Aria, Emily, and Spencer have been telling some outrageous tales; only, the proof always seems to go missing. The friends insist they’re telling the truth, but all of Rosewood thinks they’re just out for attention—and nobody likes a girl who cries wolf. So when the big bad killer comes after them, will anyone believe the girls. . . or will they be the next to disappear?\\n","cover":"https://allnovel.net/images/heartless-pretty-little-liars-7.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heartless-pretty-little-liars-7.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:15 AM"}}
