{"id":71729,"no":27,"title":"Page 27","content":"“I’m golden,” Iris said blandly. She walked over to the mirror and began to inspect her pores.\n “I didn’t know I was going to get you in trouble,” Hanna gushed. “I’m so sorry Felicia took away your magazines.”\n Iris’s eyes met Hanna’s in the mirror. Her face was etched with disappointment. “It’s not about the magazines, Hanna. I told you everything about me, but I had to find out everything about you from some stupid magazine. Tara knew before I did.”\n Hanna swung her legs over the bed. “I’m sorry.”\n Iris crossed her arms over her chest. “Sorry doesn’t cut it. I thought you were normal. And you’re not.”\n Hanna pressed her thumbs into her eye sockets. “So some shit happened to me,” she blurted. “You heard some of it in group.” She launched into an explanation about the night Ali went missing, her makeover, A, and how Mona had tried to kill her. “Everyone around me is crazy, but I’m normal, I swear.” Hanna dropped her hands in her lap and looked at Iris’s eyes in the mirror. “I wanted to tell you, but I just don’t know who to trust anymore.”\n Iris stood very still for a few long moments, her back still turned. The vanilla-scented Glade plug-in in the corner outlet let out a sfft. It reminded Hanna eerily of Ali. Finally, Iris whirled around. “God, Hanna.” She exhaled. “That sounds awful.”\n “It was,” Hanna admitted.\n And then the tears came fast and hot. It felt like every shred of tension and fear she’d been holding in for months erupted from her. For so long, she’d thought if she pretended she was over Mona and Ali and A, it all would eventually fade away. But it wasn’t fading. She was so angry at Mona it physically hurt. She was angry at Ali for being so nasty to Mona that she’d turned into vicious, heartless A. And she was furious at herself for falling for Mona’s friendship—and Ali’s.\n “If I hadn’t been friends with Ali, none of this would’ve happened,” Hanna wailed, crying so hard now that her chest heaved uncontrollably. “I wish she’d never been in my life. I wish I never knew her.”\n “Shhhh.” Iris petted Hanna’s hair. “You don’t mean that.”\n But Hanna did mean it. All Ali gave Hanna was a few months of bliss and then many years of pain. “Would it have been the worst thing if I had stayed an ugly, chubby loser?” Hanna asked. At least then she wouldn’t have hurt people. At least people wouldn’t have hurt her. “Maybe I deserved what Mona did to me. Maybe Ali deserved what someone did to her, too.”\n Iris sat back, flinching as if Hanna had pinched her. Hanna realized too late how her words probably sounded. But then Iris stood and straightened her skirt. “The staff is making us watch Ella Enchanted in the theater room.” She rolled her eyes and made a face. “I’ll tell them you’re sick if you want me to. Maybe you need some time alone. I understand if you don’t want to see Tara and the others right now.”\n Hanna was about to nod, but then her stomach let out a gurgle. She squared her shoulders. It was true—she didn’t want to face Tara and the other patients, now that they knew the truth. But all of a sudden, she didn’t really care. Everyone here was screwed up. They were no better than she was.\n “I’ll be there,” she decided.\n Iris smiled. “Take your time.” The door clonked shut on her way out.\n Hanna felt her pulse begin to slow. She dabbed her eyes with more Kleenexes, slid her feet into her Ugg slippers, and walked to the mirror. Fixing her puffy eyes was going to take a lot of makeup. Then, she noticed Iris’s black patent leather Chanel purse on the bureau, the corner of a magazine poking out. Hanna pulled at it, hardly believing what she saw.\n It was the newest issue of People. The one with the story about Hanna inside.\n Alarm bolted through her. Hadn’t the nurses taken this away? Frantically, Hanna leafed to the page where the story about her began. A Week of Secrets and Lies. Her eyes scanned the text. There were details about their friendship with Alison. Their dealings with Mona-as-A. Seeing Ian Thomas’s body, narrowly escaping the fire. There was the box that said 92 percent of the country thought Hanna and the others killed Ali. And then Hanna noticed another sidebar. And where’s Hanna Marin? said bold type. You’ll never believe it! Next to it was a picture of the front of the Preserve.\n Hanna’s blood went ice-cold.\n There was a list of drugs Hanna was taking, the sleeping pills and the Valium. There was an itinerary of how she spent her days, down to what she ate for breakfast, how long she ran on the treadmill, and how often she wrote in her leather-bound food journal. Below the article was a blurry picture of Hanna in leggings and a T-shirt, sticking her tongue out at the camera, the graffiti on the walls of the secret attic room behind her. Hanna’s raised middle finger had been cropped out, as had the other girl in the picture. “Oh my God,” Hanna whispered.\n She stared at the magazine, nausea burbling up in her stomach. In group, Hanna had blamed Tara. But something didn’t fit. Even if Tara had somehow found Iris’s disposable camera, some of these details were too specific. They were things only someone who spent every waking moment with Hanna could know.\n Just before Hanna hurled the magazine across the room, she saw something else in the photo. Behind her head, right next to Iris’s sketch of the wishing well, was another drawing in the exact same style and the same color ink. It was of a girl with a heart-shaped face, Cupid-bow lips, and wide, big blue eyes. Hanna brought the magazine closer to her face, staring at it until her eyes crossed. It was the spitting image of a girl Hanna knew very, very well. A girl she thought she’d seen in the woods the week before.\n And suddenly, Ali’s voice lilted in her ear. She wants to hurt you just like she already hurt me.\n Ali hadn’t been talking about Tara at all; she’d been talking about Iris.\n Chapter 25\n Aria Says Good-Bye\n An hour after her meeting with Esmeralda, Aria parked at the gates of St. Basil’s cemetery. The majestic mausoleums and headstones were dappled with silver moonlight. A couple of tall, old-fashioned lanterns lit the brick pathway. There was a gentle breeze shaking the bare willow trees. Aria knew every step to Ali’s grave, but that wouldn’t make the journey there any easier.\n Ali killed Ali. It was shocking . . . and unbelievable . . . and filled Aria with penetrating, unbelievable guilt. Someone murdering Ali was one thing, truly tragic. But Ali killing herself? It could have been prevented. Ali could have sought help.\n And still, Aria was skeptical that Ali could have done such a thing. She’d seemed so happy, so carefree. But the day Mrs. DiLaurentis questioned them about Ali’s whereabouts, after Aria and her friends parted ways, she’d started down the DiLaurentises’ driveway and noticed the lid to one of their garbage cans had blown off. Bending down to put it back on the can, she spied an empty bottle for pills nestled atop the trash bags. The prescription was for Ali, but the medication’s name had been rubbed off. At the time, Aria hadn’t thought much of it, but now she reexamined the memory more closely. What if the pills were to treat depression or anxiety? What if Ali took a whole handful of them on the night of the seventh-grade sleepover, too overcome to go on? She could have climbed into that hole on purpose, folded her hands over her chest, and waited for the drugs to take effect. But there was no way to prove it—Ali’s body had been so decomposed by the time the workers found her that there was no way to test for a drug overdose.\n R U avoiding me? Ali had texted Aria in those last few weeks she was alive. I want 2 talk. But Aria had ignored almost every one of them—there was only so much teasing about Byron’s affair she could take. What if Ali had needed to talk about something else? How had Aria missed something so huge?\n Even though she’d only seen Noel an hour ago, she pulled out her phone and called him. He answered right away. “I’m at the cemetery,” she said. Then she paused, figuring Noel would know why.\n “It’ll be okay,” Noel said. “It’ll make you feel better, I promise.”\n Aria picked up the crinkly wrapping around the bouquet of flowers she’d picked up at the grocery store just minutes ago. She wasn’t sure what she was going to say to Ali here—or what answers she’d get. But at this point, she was willing to try anything to feel better. She swallowed hard, pressing the phone to her ear. “Ali might have been reaching out to me about something, but I ignored her. This is all my fault.”\n “It’s not,” Noel soothed. The other end crackled with static. “I think that about my brother sometimes, too . . . but you can’t. It’s nothing I could’ve prevented, and it’s nothing you could’ve stopped, either. And it wasn’t like you were Ali’s only friend. She could’ve reached out to Spencer or Hanna or her parents. But she didn’t.”\n “I’ll talk to you later, okay?” Aria said, her voice thick with tears. Then she hung up, grabbed the flowers, opened the passenger door, and started up the walk. The grass was wet and squishy under her feet. Within minutes, she was climbing the hill and approaching Ali’s headstone. Someone had set up fresh flowers at the headstone’s base and taped a picture of Ali to the stone itself.\n “Aria? “\n She jumped. A shiver went down her back. Jason DiLaurentis was standing a few feet away under a big sycamore tree. She braced herself, ready for him to get angry, but he just stood there, his eyes darting back and forth. He wore a heavy black jacket with a thick, padded hood, black pants, and black gloves. For a wild second Aria wondered if he was going to rob a bank.\n “H-hey,” she finally sputtered. “I just . . . wanted to talk to Ali. Is that okay?”\n Jason shrugged. “Sure.” He began to walk down the hill, giving her space. “Wait,” Aria called. Jason stopped, leaned his hand against a tree, and peered at her.\n Aria considered her words. One short week ago, when they were dating, Jason had encouraged her to discuss Ali with him—he said everyone else seemed too uncomfortable to even utter her name in his presence. She brushed her hands on her jeans. “We’ve found out a lot about Ali that we didn’t know,” she finally said. “A lot that’s really painful. I’m sure it’s been hard on you, too.”\n Jason kicked his toe into a loose clump of soil. “Yeah.”\n “And sometimes you just don’t know what’s going on inside of people,” Aria added, thinking about how Ali had happily pirouetted across the lawn the evening seventh grade ended, seemingly overjoyed to see her best friends. “People always seem so perfect on the surface,” she added. “But . . . it’s not always the case. Everyone hides things.”\n Jason’s toe kicked up more dirt.\n “But it’s not your fault,” Aria went on. “It’s not any of our faults.”\n And all of a sudden, she really believed that. If Ali really had committed suicide, and if she’d known she was going to do it ahead of time, Aria still might not have been able to do anything to stop her. It broke her heart that she hadn’t sensed it coming, and it sucked that she didn’t know why Ali had done it . . . but maybe she just had to accept it, grieve, and move on. \n","sourceLink":"https://allnovel.net/heartless-pretty-little-liars-7/page-27.html","bookId":2384,"book":{"id":2384,"title":"Heartless (Pretty Little Liars #7)","description":"Storyline: \n Heartless (Pretty Little Liars #7) \n The newest installment in Sara Shepard’s bestselling Pretty Little Liars series is packed with juicy drama and delicious surprises that will keep readers guessing to the very end. \n Hanna, Aria, Emily, and Spencer have been telling some outrageous tales; only, the proof always seems to go missing. The friends insist they’re telling the truth, but all of Rosewood thinks they’re just out for attention—and nobody likes a girl who cries wolf. So when the big bad killer comes after them, will anyone believe the girls. . . or will they be the next to disappear?\n \n","cover":"https://allnovel.net/images/heartless-pretty-little-liars-7.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heartless-pretty-little-liars-7.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:15 AM"}}
