{"id":67562,"no":10,"title":"Page 10","content":"Elizabeth was enrolled in the International Chateau Lemand, a girls\u0027 school situated in the village of Sainte-Blaise, overlooking the Lake of Neuchatel. The age of the girls ranged from fourteen to eighteen. It was one of the finest schools in the excellent Swiss educational system.\\n\\n Elizabeth hated every minute of it.\\n\\n She felt exiled. She had been sent away from home, and it was like some dire punishment for a crime she had not committed. On that one magic evening she had felt that she was on the verge of something wonderful, discovering her father, and her father discovering her, and their becoming friends. But now he was farther away than ever.\\n\\n Elizabeth was able to keep track of her father in the newspapers and magazines. There were frequent stories and photographs of him meeting with a Prime Minister or a President, opening a new pharmaceutical plant in Bombay, mountain climbing, dining with the Shah of Iran. Elizabeth pasted all the stories in a scrapbook which she constantly pored over. She hid it next to the book of Samuel.\\n\\n Elizabeth remained aloof from the other students. Some of the girls shared rooms with two or three others, but Elizabeth had asked for a room by herself. She wrote long letters to her father, then tore up the ones that revealed her feelings. From time to time she received a note from him, and there were gaily wrapped packages from expensive stores on her birthday, sent by his secretary. Elizabeth missed her father terribly.\\n\\n She was going to join him at the villa in Sardinia for Christmas, and as the time drew nearer, the waiting became almost unbearable. She was sick with excitement. She made a list of resolutions for herself and carefully wrote them down:\\n\\n Do not be a pest.\\n\\n Be interesting.\\n\\n Do not complain about anything, especially school.\\n\\n Do not let him know you are lonely.\\n\\n Do not interrupt while he is speaking.\\n\\n Be well groomed at all times, even at breakfast.\\n\\n Laugh a lot so that he can see how happy you are.\\n\\n The notes were a prayer, a litany, her offering to the gods. If she did all these things, maybe - maybe - Elizabeth\u0027s resolutions merged into fantasies. She would make profound observations about the Third World and the nineteen developing nations, and her father would say, \"I didn\u0027t know you were so interesting\" (rule number two). \"You\u0027re a very bright girl, Elizabeth.\" Then he would turn to his secretary and say, \"I don\u0027t think Elizabeth needs to go back to school. Why don\u0027t I keep her here with me?\"\\n\\n A prayer, a litany.\\n\\n A company Learjet picked Elizabeth up at Zurich and flew her to the airport at Olbia, where she was met by a limousine. Elizabeth sat in the back of the car, silent, forcing her knees together to keep them from trembling. No matter what happens, she thought fiercely, I won\u0027t let him see me cry. He mustn\u0027t know how much I\u0027ve missed him.\\n\\n The car drove up the long, winding mountain highway that led to the Costa Smeralda, then off onto the small road that wound to the top. This road had always frightened Elizabeth. It was very narrow and steep, with the mountain on one side and a terrifying abyss on the other.\\n\\n The car pulled up in front of the house, and Elizabeth stepped out and began walking toward the house and then running, her legs carrying her as fast as they could. The front door opened and Margherita, the Sardinian housekeeper, stood there smiling \"Hello, Miss Elizabeth.\"\\n\\n \"Where\u0027s my father?\" Elizabeth asked.\\n\\n \"He had to go to Australia on some emergency. But he left a lot of pretty presents for you. It\u0027s going to be a lovely Christmas.\" \\n\\n","sourceLink":"https://allnovel.net/bloodline/page-10.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \\n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\\n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
