{"id":67567,"no":15,"title":"Page 15","content":"BOOK TWO\n Chapter 15\n Portugal.\n Wednesday, September 9.\n Midnight.\n In the bedroom of a small rented apartment in Rua dos Bombeiros, one of the winding, dangerous back alleys of Alto Estoril, a motion-picture scene was being filmed. There were four people in the room. A cameraman, and on a bed the two actors in the scene, the man in his thirties and a young blond girl with a stunning figure. She wore nothing except a vivid red ribbon tied around her neck. The man was large, with a wrestler\u0027s shoulders and a barrel-shaped, incongruously hairless chest His phallus, even in detumescence, was huge. The fourth person in the room was a spectator, seated in the background, wearing a black broad-brimmed hat and dark glasses.\n The cameraman turned to the spectator, questioningly, and the spectator nodded. The cameraman pressed a switch and the camera began to whir. He said to the actors, \"All right. Action.\"\n The man knelt over the girl and she took his penis in her mouth until it began to grow hard. The girl took it out and said, \"Jesus, that\u0027s big!\"\n \"Shove it in her,\" the cameraman ordered.\n The man slid down over the girl and put his penis between her legs.\n \"Take it easy, honey.\" She had a high, querulous voice.\n \"Look as though you\u0027re enjoying it.\"\n \"How can I? It\u0027s the size of a fucking watermelon.\"\n The spectator was leaning forward, watching every move as the man entered her. The girl said, \"Oh, my God, that feels wonderful. Just take it slow, baby.\"\n The spectator was breathing harder now, staring at the scene on the bed. This girl was the third, and she was even prettier than the others.\n She was writhing from side to side now, making little moaning noises. \"Oh, yes,\" she gasped. \"Don\u0027t stop!\" She grasped the man\u0027s hips and began pulling them toward her. The man began to pump harder and faster, in a frantic, pounding motion. Her movements began to quicken, and her nails dug into the man\u0027s naked back. \"Oh, yes,\" she moaned. \"Yes, yes, yes! I\u0027m coming!\"\n The cameraman looked toward the spectator, and the spectator nodded, eyes glistening behind the dark glasses.\n \"Now!\" the cameraman called to the man on the bed.\n The girl, caught in her own furious frenzy, did not even hear him. As her face filled with a wild ecstasy, and her body began to shudder, the man\u0027s huge hands closed around her throat and began to squeeze, closing off the air so that she could not breathe. She stared up at him, bewildered, and then her eyes filled with a sudden, terrified comprehension.\n The spectator thought: This is the moment. Now! Jesus God! Look at her eyes! They were dilated with terror. She fought to tear away the iron bands around her throat, but it was useless. She was still coming, and the deliciousness of her orgasm and the frantic shudder of her death throes were blending into one.\n The spectator\u0027s body was soaked with perspiration. The excitement was unbearable. In the middle of life\u0027s most exquisite pleasure the girl was dying, her eyes staring into the eyes of death. It was so beautiful.\n Suddenly it was over. The spectator sat there, exhausted, shaken with spasms of pleasure, lungs filled with long, deep breaths. The girl had been punished.\n The spectator felt like God. \n","sourceLink":"https://allnovel.net/bloodline/page-15.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: \n Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\n \n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
