{"id":67571,"no":19,"title":"Page 19","content":"The room looked as though a hurricane had swept through it. The storm had blown open the French doors during the night, and the wind and the rain had wreaked havoc, scattering everything before it. A few loose pages of the report lay on the wet rug, but the rest of the pages had obviously been carried away by the wind.\n Elizabeth stepped to the French windows and looked out. She could see no papers on the lawn, but the wind could easily have blown them over the cliff. That must have been what happened.\n No COPIES. She must find out the name of the investigator Sam had hired. Perhaps Kate Erling would know. But Elizabeth could not be sure now that Sam had trusted Kate. This had become like a terrible game, where no one could trust anybody. She would have to move very carefully.\n Elizabeth suddenly remembered that there was no food in the house. She could shop at Cala di Volpe and be back before Alec arrived. She went to the hall closet and got her raincoat and a scarf for her hair. Later, when the rain let up, she would search the grounds for the missing papers. She went into the kitchen and took the key to the Jeep from the key rack. She walked out the back door that led to the carport\n Elizabeth started the engine and carefully backed the Jeep out of the carport. She turned it around and headed out the private driveway, braking to slow down because of the wet surface. At the bottom of the driveway she turned right, onto the narrow mountain road that led to the little village of Cala di Volpe below. There was no traffic on the road at this hour, but there seldom was, for few houses had been built up this high. Elizabeth glanced down to her left and saw that the sea below had become dark and angry, swollen with the night storm.\n She drove slowly, for this part of the road became treacherous. It was narrow, with two lanes that had been cut into the side of the mountain, along a sheer precipice. On the inside lane was the solid rock of the mountain, and on the outside, a drop of hundreds of feet to the sea below. Elizabeth kept as close as she could to the inside lane, braking to fight the momentum of the steep mountain gradient.\n The car was approaching a sharp curve. Automatically, Elizabeth put her foot on the brakes to slow the Jeep down.\n The brakes were dead.\n It took a long moment to register. Elizabeth pressed again, harder, pushing down on the pedal with all her strength, and her heart began to pound as the Jeep kept gathering speed. It took the curve and was moving faster now, racing down the steep mountain road, gaining momentum with each second. She pressed down on the brakes again. They were useless.\n Another curve lay ahead. Elizabeth was afraid to take her eyes off the road to look at the speedometer, but out of the corner of her eye she could see the needle racing upward and she was filled with an icy terror. She reached the curve and skidded around it, much too fast. The back wheels slid toward the edge of the precipice, then the tires found their traction and the Jeep plunged forward again, hurtling down the steep road ahead. There was nothing to stop it now, no barriers, no controls, only the swift roller-coaster ride down, and the deadly, beckoning curves ahead.\n Elizabeth\u0027s mind raced frantically, seeking some escape. She thought of jumping. She risked a quick look at the speedometer. She was going seventy miles an hour now, and building up speed every moment, trapped between the solid mountain wall on one side and the deadly drop into space on the other. She was going to die. And in an instant revelation, Elizabeth knew that she was being murdered, and that her father had been murdered. Sam had read the report, and he had been killed. As she was going to be killed. And she had no idea who her murderer was, who hated them enough to do this terrible thing. Somehow she could have borne it better if it had been a stranger. But it was someone she knew, someone who knew her. Faces flashed through her mind. Alec...Ivo...Walther...Charles...It had to be one of them. Someone in the highest echelon of the company\n Her death would be listed as an accident, as Sam\u0027s had been. Elizabeth was crying now, silently, her tears mixing with the fine mist of rain that was falling, but she was not even aware of it. The Jeep was beginning to skid out of control on the wet surface, and Elizabeth fought to keep the wheels on the road. She knew it was only a matter of seconds before she hurtled over the cliff, into oblivion. Her body became rigid, and her hands were numb from gripping the steering wheel. There was nothing in the universe now but herself, careering down the mountain road, with the roaring wind tugging at her, saying Come join me, tearing at the car, trying to push it over the brink of the cliff. The Jeep started into another skid, and Elizabeth fought desperately to straighten it out, remembering what she had been taught. Steer into the skid, always into the skid, and the rear wheels straightened out and the car continued racing downhill. Elizabeth stole another quick glance at the speedometer...eighty miles an hour. She was catapulting toward a steep hairpin curve ahead, and she knew she was not going to make this one.\n Something in her mind seemed to freeze, and it was as if there was a thin veil between her and reality. She heard her father\u0027s voice saying, What are you doing down here alone in the dark? and he was picking her up and carrying her to bed and she was on stage dancing and turning and turning and turning and she could not stop, and Mme. Net-turova was screaming at her (or was it the wind?) and Rhys was there, saying, How many times does a girl have her twenty-first birthday? And Elizabeth thought, I\u0027ll never see Rhys again, and she screamed his name and the veil disappeared, but the nightmare was still there. The sharp curve was looming closer now, the car speeding toward it like a bullet. She would go over the cliff. Let it happen quickly, she prayed silently.\n At that moment, to the right, just before the hairpin curve, Elizabeth caught a glimpse of a small firebreak trail that had been cut through the rock, going up the mountainside. She had to make a decision in a split second. She had no idea where the trail led. All she knew was that it went upward, that it might slow her momentum, give her a chance. And she took it. At the last instant, as the Jeep reached the trail, Elizabeth swung the wheel hard to the right. The rear wheels started to skid, but the front wheels were on the gravel road and the momentum gave them enough traction to hold. The Jeep was now hurtling upward, and Elizabeth was fighting the wheel, trying to keep the car on the narrow trail. There was a thin line of trees and their branches were slashing at her as she raced by them, tearing at her face and her hands. She looked ahead, and to her horror, she could see the Tyrrhenian Sea below. The path had merely led to the other side of the cliff. There was no safety here at all.\n She was getting closer and closer to the brink now, moving too fast to jump from the Jeep. The edge of the cliff was just ahead of her, the sea hundreds of feet below. As the Jeep hurtled toward the edge, it went into a wild skid, and the last thing Elizabeth remembered was a tree looming up in front of her and then an explosion that seemed to fill the universe.\n After that the world became still and white and peaceful and silent. \n","sourceLink":"https://allnovel.net/bloodline/page-19.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: \n Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\n \n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
