{"id":67578,"no":26,"title":"Page 26","content":"London.\n Friday, November 2.\n Five p.m.\n Alec Nichols was alone in the club sauna when the door opened and a man walked into the steam-filled room, wearing a towel around his waist. He sat down on the wooden bench, next to Alec. \"Hot as a witch\u0027s tit in here, ain\u0027t it, Sir Alec?\"\n Alec turned. It was Jon Swinton. \"How did you get in here?\"\n Swinton winked. \"I said you was expectin\u0027 me. He looked into Alec\u0027s eyes and asked, \"You was expectin\u0027 me, wasn\u0027t you, Sir Alec?\"\n \"No,\" Alec replied. \"I told you I need more time.\"\n \"You also told us your little cousin was going to sell the stock, and you\u0027d give us our money.\"\n \"She - she changed her mind.\"\n \"Ah, then you\u0027d better change it back for her, hadn\u0027t you?\"\n \"I\u0027m trying. It\u0027s a question of - \"\n \"It\u0027s a question of how much more horseshit we\u0027re going to take from you.\" Jon Swinton was moving closer, forcing Alec to slide along the bench. \"We don\u0027t want to get rough with you \u0027cause it\u0027s nice to have a good friend like you in Parliament. You know what I mean? But there\u0027s a limit.\" He was leaning against Alec now, and Alec slid farther away from him. \"We did you a favor. Now it\u0027s time to pay us back. You\u0027re gonna get hold of a shipment of drugs for us.\"\n \"No! That\u0027s impossible,\" Alec said. \"I can\u0027t. There\u0027s no way - \"\n Alec suddenly found that he had been crowded to the end of the bench, next to the large metal container filled with hot rocks. \"Be careful,\" Alec said.\n Swinton grabbed hold of Alec\u0027s arm and twisted it, forcing it toward the bed of rocks. Alec could feel the hair on his arm begin to singe.\n \"No!\"\n The next instant his arm was pressed down onto the rocks, and he screamed with pain and fell to the floor in agony. Swinton was standing over him.\n \"You find a way. We\u0027ll be in touch.\" \n","sourceLink":"https://allnovel.net/bloodline/page-26.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: \n Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\n \n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
