{"id":67584,"no":32,"title":"Page 32","content":"The funeral parlor at Sihlfeld was crowded. It was an ornate, old-fashioned building of stone and marble, with preparation rooms and a crematorium. Inside the large chapel two dozen executives and employees of Roffe and Sons occupied the front row of seats. Toward the rear were the friends, the community representatives and the press. Detective Hornung was seated in the last row, thinking that death was illogical. Man reached his prime and then, when he had the most to give, the most to live for, he died. It was inefficient.\n The casket was mahogany and covered with flowers. More waste, Detective Hornung thought. The casket had been ordered sealed. Max could understand why. The minister was speaking in a doomsday voice, \"...death in the midst of life, born in sin, ashes to ashes.\" Max Hornung paid little attention. He was studying those in the chapel.\n \"The Lord giveth, and the Lord taketh away,\" and people were beginning to stand and head for the exit. The services were over.\n Max stood near the door, and as a man and a woman approached him, he stepped in front of the woman and said, \"Miss Elizabeth Roffe? I wonder if I might have a word with you?\"\n Detective Max Hornung was seated with Elizabeth Roffe and Rhys Williams in a booth at a Konditorei across from the funeral parlor. Through the window they could see the coffin being loaded into a gray hearse. Elizabeth looked away. Her eyes were haunted.\n \"What\u0027s this all about?\" Rhys demanded. \"Miss Roffe has already given her statement to the police.\"\n Detective Max Hornung said, \"Mr. Williams, isn\u0027t it? There are just a few little details I want to check out.\"\n \"Can\u0027t they wait? Miss Roffe has been through a very trying - \"\n Elizabeth put her hand on Rhys\u0027s. \"It\u0027s all right. If I can be of any help - \" She turned to Max. \"What would you like to know, Detective Hornung?\"\n Max stared at Elizabeth, and for the first time in his life he was at loss for words. Women were as foreign to Max as creatures from an alien planet. They were illogical and unpredictable, subject to emotional reactions rather than rational ones. They did not compute. Max had few sexual stirrings, for he was mind-oriented, but he could appreciate the precise logic of sex. It was the mechanical construction of moving parts fitting together into a coordinated, functioning whole that excited him. That, for Max, was the poetry of loving. The sheer dynamics if it. Max felt that the poets had all missed the point. Emotions were imprecise and untidy, a waste of energy that could not move the smallest grain of sand one inch, while logic could move the world. What was puzzling Max now was that he felt comfortable with Elizabeth. It made him uneasy. No woman had ever affected him that way before. She did not seem to think he was an ugly, ridiculous little man, the way other women did. He forced himself to look away from her eyes so that he could concentrate.\n \"Were you in the habit of working late at night, Miss Roffe?\"\n \"Very often,\" Elizabeth said. \"Yes.\"\n \"How late?\"\n \"It varied. Sometimes until ten. Sometimes until midnight, or after.\"\n \"So it was a kind of pattern? That is, people around you would have known about it?\"\n She was studying him, puzzled. \"I suppose so.\"\n \"On the night the elevator crashed, you and Mr. Williams and Kate Erling were all working late?\"\n \"Yes.\"\n \"But you didn\u0027t leave together?\"\n Rhys said, \"I left early. I had an engagement.\"\n Max regarded him a moment, then turned back to Elizabeth. \"How long after Mr. Williams left did you leave?\"\n \"I think it was about an hour.\"\n \"Did you and Kate Erling leave together?\"\n \"Yes. We got our coats and went out into the hall.\" Elizabeth\u0027s voice faltered. \"The - the elevator was there, waiting for us.\"\n The special express elevator.\n \"What happened then?\"\n \"We both got in. The telephone in the office rang. Kate - Miss Erling - said, \u0027I\u0027ll get it,\u0027 and she started to get out. But I was expecting an overseas call I had placed earlier, so I told her I would answer it.\" Elizabeth stopped, her eyes suddenly brimming with tears. \"I got out of the elevator. She asked if she should wait, and I said, \u0027No, go ahead.\u0027 She pressed the lobby button. I started back to the office, and as I was opening the door, I heard - I heard the screaming, then - \" She was unable to go on.\n Rhys turned to Max Hornung, his face clouded with anger. \"That\u0027s enough. Will you tell us what this is all about?\"\n It was about murder, Max thought. Someone had tried to kill Elizabeth Roffe. Max sat there concentrating, recalling everything he had learned in the past forty-eight hours about Roffe and Sons. It was a deeply plagued company, forced to pay astronomical damages in lawsuits, swamped by bad publicity, losing customers, owing enormous sums of money to banks that had grown impatient. A company ripe for a change. Its president, Sam Roffe, who had held the controlling vote, had died. An expert mountain climber who had been killed in a climbing accident. The controlling stock had gone to his daughter, Elizabeth, who had almost died in a Jeep accident in Sardinia, and had narrowly missed being killed in an elevator that had passed a recent inspection. Someone was playing deadly games.\n Detective Max Hornung should have been a happy man. He had found a loose thread. But now he had met Elizabeth Roffe, and she was no longer simply a name, an equation in a mathematical puzzle. There was something very special about her. Max felt an urge to shield her, to protect her.\n Rhys said, \"I asked what this - \"\n Max looked at him and said vaguely, \"Er - police procedure, Mr. Williams. Just routine.\" He rose. \"Excuse me.\"\n He had some urgent work to do. \n","sourceLink":"https://allnovel.net/bloodline/page-32.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: \n Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\n \n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
