{"id":67602,"no":50,"title":"Page 50","content":"Zurich.\\n\\n Thursday, December 4.\\n\\n It was exactly noon when the call came through the switchboard at the Kriminal Polizei headquarters in Zurich. It was routed through to Chief Inspector Schmied\u0027s office, and when the chief inspector had finished talking, he went to find Detective Max Hornung.\\n\\n \"It\u0027s all over,\" he told Max. \"The Roffe case has been solved. They\u0027ve found the killer. Get out to the airport. You\u0027ve just got time to catch your plane.\"\\n\\n Max blinked at him. \"Where am I going?\"\\n\\n \"To Berlin.\"\\n\\n Chief Inspector Schmied telephoned Elizabeth Williams. \"I am calling to bring you some good news,\" he said. \"You will no longer need a bodyguard. The murderer has been caught.\"\\n\\n Elizabeth found herself gripping the telephone. At long last she was going to learn the name of her faceless enemy. \"Who is it?\" she asked.\\n\\n \"Walther Gassner.\"\\n\\n They were speeding along the autobahn, heading for Wannsee. Max was in the back seat, next to Major Wageman, and two detectives sat in front. They had met Max at Tempelhof Airport, and Major Wageman had briefed Max on the situation as they drove. \"The house is surrounded, but we have to be careful how we move in. He\u0027s holding his wife hostage.\"\\n\\n Max asked, \"How did you get on to Walther Gassner?\"\\n\\n \"Through you. That\u0027s why I thought you would like to be here.\"\\n\\n Max was puzzled. \"Through me?\"\\n\\n \"You told me about the psychiatrist he visited. On a hunch, I sent out Gassner\u0027s description to other psychiatrists and found out that he had gone to half a dozen of them, looking for help. Each time he used a different name, then ran away. He knew how ill he was. His wife had phoned us for help a couple of months ago, but when one of our men went out to investigate, she sent him away.\" They were turning off the autobahn now, only a few minutes from the house. \"This morning we received a call from a cleaning woman, a Frau Mendler. She told us she was working at the Gassner house on Monday and that she talked to Mrs. Gassner through the locked door of her bedroom. Mrs. Gassner told her that her husband had killed their two children and was going to kill her.\"\\n\\n Max blinked. \"This happened on Monday? And the woman didn\u0027t call you until this morning?\"\\n\\n \"Frau Mendler has a long police record. She was afraid to come to us. Last night she told her boyfriend what had happened, and this morning they decided to call us.\"\\n\\n They had reached the Wannsee. The car pulled up a block away from the entrance to the Gassner estate, behind an unmarked sedan. A man got out of the sedan and hurried toward Major Wageman and Max. \"He\u0027s still inside the house, Major. I have men all around the grounds.\"\\n\\n \"Do you know if the woman is still alive?\"\\n\\n The man hesitated. \"No, sir. All the blinds are drawn.\"\\n\\n \"All right. Let\u0027s make it fast and quiet. Get everyone in place. Five minutes.\"\\n\\n The man hurried off. Major Wageman reached into the car and pulled out a small walkie-talkie. He began rapidly to issue orders. Max was not listening. He was thinking of something that Major Wageman had said to him a few minutes ago. Something that made no sense. But there was no time to ask him about it now. Men were starting to move toward the house, using trees and shrubs as cover. Major Wage-man turned to Max. \"Coming, Hornung?\"\\n\\n It seemed to Max that there was an army of men infiltrating the garden. Some of them were supplied with telescopic rifles and armored vests; others carried snubnosed tear gas rifles. The operation was carried out with mathematical precision. At a signal from Captain Wageman, tear gas grenades were simultaneously hurled through the downstairs and upstairs windows of the house and at the same instant the front and rear doors were smashed in by men wearing gas masks. Behind them came more detectives with drawn guns.\\n\\n When Max and Major Wageman ran through the open front door, the hallway was filled with acrid smoke, but it was rapidly being dispersed by the open windows and doors. Two detectives were bringing Walther Gassner into the hallway in handcuffs. He was wearing a robe and pajamas and he was unshaven and his face looked gaunt and his eyes swollen.\\n\\n Max stared at him, seeing him for the first time in person. Somehow he seemed unreal to Max. It was the other Walther Gassner who was real, the man in the computer, whose life had been spelled out in digits. Which was the shadow and which was the substance?\\n\\n Major Wageman said, \"You\u0027re under arrest, Herr Gassner. Where is your wife?\"\\n\\n Walther Gassner said hoarsely, \"She\u0027s not here. She\u0027s gone! I - \"\\n\\n Upstairs there was the sound of a door being forced open, and a moment later a detective called down, \"I\u0027ve found her. She was locked in her room.\"\\n\\n The detective appeared on the staircase, supporting a trembling Anna Gassner. Her hair was stringy and her face was streaked and blotchy, and she was sobbing.\\n\\n \"Oh, thank God,\" she said. \"Thank God you\u0027ve come!\"\\n\\n Gently the detective led her downstairs toward the group standing in the enormous reception hall. When Anna Gassner looked up and saw her husband, she began to scream.\\n\\n \"It\u0027s all right, Frau Gassner,\" Major Wageman said soothingly. \"He can\u0027t harm you anymore.\"\\n\\n \"My children,\" she cried. \"He killed my children!\"\\n\\n Max was watching Walther Gassner\u0027s face. He was staring at his wife with an expression of utter hopelessness. He looked broken and lifeless.\\n\\n \"Anna,\" he whispered. \"Oh, Anna.\"\\n\\n Major Wageman said, \"You have the right to remain silent or to ask for a lawyer. For your own sake I hope you will cooperate with us.\"\\n\\n Walther was not listening. \"Why did you have to call them, Anna?\" he pleaded. \"Why? Weren\u0027t we happy together.\"\\n\\n \"The children are dead,\" Anna Gassner shrieked. \"They\u0027re dead.\"\\n\\n Major Wageman looked at Walther Gassner and asked, \"Is that true?\"\\n\\n Walther nodded, and his eyes looked old and defeated. \"Yes...They\u0027re dead.\"\\n\\n \"Murderer! Murderer!\" his wife was shrieking.\\n\\n Major Wageman said, \"We would like you to show us the bodies. Will you do that?\"\\n\\n Walther Gassner was crying now, the tears rolling down his cheeks. He could not speak.\\n\\n Major Wageman said, \"Where are they?\"\\n\\n It was Max who answered. \"The children are buried in Saint Paul\u0027s graveyard.\"\\n\\n Everyone in the room turned to stare at him. \"They died at birth five years ago,\" Max explained.\\n\\n \"Murderer!\" Anna Gassner screamed at her husband.\\n\\n And they turned and saw the madness blazing out of her eyes. \\n\\n","sourceLink":"https://allnovel.net/bloodline/page-50.html","bookId":2356,"book":{"id":2356,"title":"Bloodline","description":"Storyline: Sheldon\u0027s sweeping saga of greed and betrayal, sabotage and danger, and the ties that can kill... \\n Roffe and Sons is a family firm, an international empire filled with desperate, cash-hungry family members. At its head was one of the wealthiest men in the world, a man who has just died in a mysterious accident and left his only daughter, Elizabeth, in control of the company. Now as this intelligent, tough, and beautiful young woman dares to save -- not sell -- Roffe and Sons, she will have to outwit those who secretly want her power, and the unknown assassin who wants her life.\\n","cover":"https://allnovel.net/images/bloodline.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/bloodline.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:04:26 AM"}}
