{"id":80896,"no":21,"title":"Page 21","content":"Mr. irons had been a very bad man. A sick man. Sherry supposed she\u0027d known it all along on some level, but seeing his secret torture chamber, like some mad doctor\u0027s workshop, made it a lot more real. The room was just gross, bones and bottles and a smell even worse than the zombies. Perhaps that was why seeing the shape on the floor, the incomplete body shape beneath the bloodstained tarp, didn\u0027t bother her half as much as Claire seemed to think it would. Sherry stared at it, wondering what had hap- pened exactly. \"Come on, sweetie, let\u0027s get going,\" Claire said, and the forced note of brightness in her voice told Sherry that Mr. Irons had been severely messed up. All Claire had told her was that Mr. Irons had attacked her, and then something had attacked him, and that there was a chance they could get somewhere safe if they went down into the basement. Sherry had been so relieved to see Claire at all that she hadn\u0027t bothered to ask questions.\n Not big enough to be a whole person under there...\n did he get eaten? Or chopped into pieces?\n \"Sherry? Let\u0027s go, okay?\"\n Claire laid a hand on her shoulder, gently pulling her away from what was left of the police chief. Sherry let herself be led toward the dark hole in the corner, deciding that it was best to keep her questions to herself. She thought about saying that she didn\u0027t care that Mr. Irons was dead, but she didn\u0027t want to appear rude or disrespectful. Besides which, Claire was trying to take care of her, and Sherry didn\u0027t mind that at all. Claire went down the ladder first, and after a second, called up to her that it was safe to come down. Sherry stepped carefully on the metal rungs, feeling really happy for the first time in days. They were doing something, they were getting out of the RPD station and headed for escape; whatever else hap-pened, it was a good way to feel. Claire helped her down the last couple of rungs, lifting her and setting her on the metal floor. Sherry turned and looked around, her eyes widening. \"Wow,\" she said, and the word whispered away into the dim shadows and came whispering back, reflected off\" the strange walls. \"Yeah,\" Claire said. \"Come on.\" Claire started walking, her boots clanking out ech-oes, and Sherry followed closely, still looking around in amazement. It was like a bad guy\u0027s lair in a spy movie, some factory passage inside of a mountain or something. They were on a catwalk surrounded by rails, a murky green light coming up through the grate floor from somewhere far below and although there was rough brick to their right, to the left was an actual cave wall. She could see giant, dripping pillars of stone that stretched off into the dark, natural forma- tions of rock that were stained green by the weak and ghostly light. Sherry wrinkled her nose. As interesting as it was, it smelled pretty rotten. And she didn\u0027t like the way that sound carried in the chill air, making everything seem hollow. \"What do you think this place is?\" she asked softly.\n Claire shook her head. \"I\u0027m not sure. Between the smell and the location, I\u0027d say we\u0027re in part of a sewage treatment plant.\"\n Sherry nodded, glad to know and even more glad to see the way out just ahead of them. The walkway wasn\u0027t very long; it turned left, and there was another ladder at the end, one that went up. When they got to it, Claire hesitated, peering up at the opening over-head and then back around at the dark and empty cave.\n \"I should go up first... how \u0027bout you climb up right behind, but stay on the ladder until I say it\u0027s clear?\"\n Sherry nodded, relieved. For a second, she\u0027d been afraid that Claire was going to tell her to stay down here and wait, like before.\n No way. It\u0027s dark, stinky, and lonely. If I were a monster, this is where I\u0027d be...\n Claire went up, boosting herself easily through the hole, and Sherry clambered up just behind, holding the cool metal of the rungs tightly. After a few seconds, Claire\u0027s long, slender arms reached down to help her out. They were back on solid ground, a short cement hallway that seemed incredibly bright after the cave. Sherry figured they were still in the sewage plant; the smell wasn\u0027t as bad, but the hall was bordered on the left by a motionless river of sludge water, maybe a foot deep and five or six feet across; the muddy water ran off in either direction, one end through a low, rounded tunnel, the other stopped by a big metal door. It was all overlooked by a kind of balcony, but Sherry didn\u0027t see any stairs.\n Which means... oh, yuck. \"Do we have to?\" she asked. Claire sighed. \u0027\"Fraid so. But look at the bright Side - no sane monster would follow us through that.\"\n Sherry smiled. It wasn\u0027t particularly funny, but she appreciated what Claire was trying to do - it was the same as covering up Mr. Irons\u0027s body, or telling her that her parents were probably safe.\n She\u0027s trying to shield me from how bad things really are...\n Sherry liked that, so much so that she was already dreading the moment when Claire would leave her for good. Eventually, she would; Claire had a whole life somewhere else, her own friends and family, and once they got out of Raccoon, she would go back to wherever she came from and Sherry would be alone again. Even if her parents were okay, she would be alone... and though she wanted very much for them to be safe and well, she wasn\u0027t looking forward to the end of her time with Claire. She was only twelve, but she\u0027d known for a couple of years that her family was different from most. The other kids at school had parents who spent time with them, had birthday parties and went on camping trips, and had brothers and sisters and pets. She\u0027d never had any of those things. She knew that her parents meant well, and that they loved her, but sometimes, she felt like no matter how quiet and good and self-sufficient she was, she was still in their way...\n \"You ready for this?\"\n Claire\u0027s soft, pretty voice brought her back to the situation, reminding her that she needed to be more alert. Sherry nodded, and Claire stepped down into the dark, dirty water, reaching back to help her. The water was cold and greasy, and came up to Sherry\u0027s knees; it was gross, but not puking bad. Claire motioned toward the big metal door to their left with her new gun, looking as disgusted as Sherry felt.\n \"Looks like we\u0027re going to...\"\n A loud noise from the balcony cut her off, and they both looked up, Sherry instinctively moving closer to Claire as the noise came again. It sounded like foot- steps, but too slow and too loud to be normal...... and Sherry saw a man in a long, dark coat walk into view, and felt her mouth go dry with fear. He was a giant, maybe as tall as ten feet, and his bald skull gleamed as white as a dead fish belly. She couldn\u0027t see him clearly because of the angle, but she could see enough - and she could feel that he was bad, that there was something very wrong and bad about him. It radiated off of him like sickness. \"Claire?\" she squeaked, her voice breaking as the giant man stalked across the balcony, as he started to turn toward them - slowly, so slowly, and Sherry didn\u0027t want to see his face, didn\u0027t want to see the face of a man that could frighten her so deeply by just walking onto a balcony...\n \"Run!\"\n Claire grabbed her hand and the two of them ran, splashing through the thick water toward the sealed door. Sherry concentrated on not falling, on praying that the door would open -\n - don\u0027t be locked, don\u0027t be locked! -\n -and on not looking back, not wanting to see what the giant, bad man was doing. The door was close but it seemed to take forever, each second stretched out as they fought against the weight of the cold and oily water. They stumbled to the hatch and Claire found its control, slamming at the button in a kind of panic that made Sherry even more afraid. The door split in the middle, one half sliding up into the ceiling and the other slipping beneath the rippling waves. Sherry didn\u0027t look back, but Claire did. Whatever she saw made her leap through the door, pulling Sherry off her feet and hurtling into the long, dark tunnel that lay behind the hatch. As soon as they were through, Claire fumbled at the wall and the door slid closed behind them, sealing them into the dripping darkness. \"Don\u0027t move and be quiet,\" Claire whispered, and in the very dim light that came from somewhere up ahead, Sherry could see that she was holding the gun out in front of her, trying to search the heavy shadows for any new threats. Sherry obeyed, her heart pound- ing, wondering who, what that man had been - it was the man Claire had asked her about before, that much was obvious, but what was he? People didn\u0027t get that big, and Claire had been scared, too... Clink. A metal noise, soft and muffled from the wall behind her and Sherry felt the water around her feet start to move suddenly, a swift rush of current that pulled on her legs, pulled her off balance...... and she stumbled, tripped, plunging face-first into the cold and nasty water as the current got stronger, sucking her backwards. Sherry reached out, trying to find something, anything, to hold on to, and felt slimy stone whip beneath her clutching fingers as the waters rushed her away, away from Claire.\n - can\u0027t breathe -\n Sherry kicked wildly, twisting her body, her eyes stinging from the bad water and managed to take a breath as her head broke the surface, as she realized that she was in a tunnel, a pitch black shaft no bigger than the vents from the station. The swift waters carried her along, Sherry taking deep gasps of the foul air overhead, forcing herself not to struggle against the relentless power of the hissing liquid. The tunnel had to end somewhere and wherever it came out, she had to be ready to run.\n Claire, please find me, please don\u0027t give up on me...\n She was lost, blind and deaf, sliding down through the dark and farther... and farther away from the only person who could protect her from the nightmare creatures that had taken over Raccoon.\n Annette no longer doubted that her husband had escaped the laboratory levels. Not only were half of the facility entrances unsealed, the fences that sur- rounded the factory had been breached and the sewer tunnels, the tunnels that should have been mostly empty, were crawling with human carriers that had to have come from outside. Even as advanced as they\u0027d been in terms of cellular deterioration, she\u0027d had to shoot down five of them just to clear a path from the tram to the sewage operations room. After what seemed an eternity of trudging through the semi-treated, inky waters of the labyrinthian system, she came to the platform she\u0027d been looking for. Annette stepped up into the concrete tunnel, gazing warily at the closed door a few meters in front of her. Closed and undamaged, a good sign, but what if he\u0027d gone through before he\u0027d lost all trace of human intelligence, before he\u0027d grown into an un- thinking, violent animal? Even now, he might still retain something resembling memory; the truth was, she didn\u0027t know. The G-Virus hadn\u0027t been tested on humans yet...\n ... and if he did go through? If he made it to the police station?\n No. She couldn\u0027t, wouldn\u0027t entertain the possibili- ty. Considering what she did know about the progres- sive chemophysiologic changes - what he would be capable of doing if the virus worked the way it was supposed to - the thought of him getting to an unin- fected population... well, it was unthinkable. The station is safe, she thought firmly. Irons may be an incompetent ass, but his cops aren\u0027t. Wherever William is, he couldn\u0027t have gotten past them. She couldn\u0027t afford to believe anything else; Sherry was there, if she\u0027d done what she was supposed to do and besides being her own flesh and blood (which, she reminded herself, was reason enough), Sherry played a very important role in her future plans. Annette leaned against one cold and sweating wall, aware that time was running out but simply unable to go on without resting for a moment. She\u0027d been counting on the encoded territorial instinct to keep him close to the lab, and had been so sure that she would find him, that her live, human scent would lure him to her... but she was almost at the end of the contained area, and all she\u0027d found were a dozen ways in which he could have escaped.\n And Umbrella will be here soon. I have to get back, I have to activate the fail-safe before they can stop me.\n William deserved to be at peace, but beyond that, destroying the creature that had once been her hus- band would eradicate all of her doubts about the success of her objective. What if she blew the lab and escaped, only to find that Umbrella had captured him? All of her struggles, all of his work, for nothing... Annette closed her eyes, wishing that there was an easy way to make the decision that had to be made. The fact was, William\u0027s death simply wasn\u0027t as crucial as getting rid of the lab. And there was a good chance that they wouldn\u0027t find him, that they weren\u0027t even aware of his transformation...\n ... and it\u0027s not as though I have a choice. He\u0027s not here, he\u0027s not anywhere.\n She pushed away from the wall, walking slowly toward the door. She would check the last few tun-nels, perhaps see if the conference rooms showed any sign of damage and then she would go back. Go back and finish what Umbrella had started. Annette pushed the door open...... and heard footsteps, echoing through the lonely corridor from somewhere up ahead; the hall was shaped like a \"T,\" the sounds melting into them- selves, making it impossible to tell from which direc- tion they were coming, but they were the strong, sure steps of an uninfected human, perhaps more than one, and that could only mean one thing.\n Umbrella. They\u0027ve finally come.\n Rage boiled up through her, making her hands shake, her lips curl back from gritted teeth. It had to be them, it had to be one of their murdering spies; besides Irons and a few of the city officials, only Umbrella knew that these tunnels were still in use and that they led to the underground facility. The possibility that it was some innocent survivor of the spill didn\u0027t cross her mind, and neither did running; she raised the handgun and waited for the heartless, murdering bastard to appear. A figure stepped into sight, a woman in red, and Annette fired...... bam, but she was trembling, screaming inside, and the shot went high. It ricocheted off the cement wall with a whining, zipping sound, and the woman was raising a weapon of her own...... and Annette fired again, barn-zip, but suddenly there was another one, a blurred, flying shape that leapt in front of the woman, knocking her out of the way, all of it happening at once...... and Annette heard the cry of pain, a man\u0027s cry, and felt a burst of roaring triumph.\n Got him, I got him...\n But there could be more, she hadn\u0027t hit the woman and they were trained killers. Annette turned and ran, her dirty lab coat flying, her wet shoes slapping against the cement. She had to get back to the lab, fast. Time had run out. \n","sourceLink":"https://allnovel.net/city-of-the-dead-resident-evil-3/page-21.html","bookId":2458,"book":{"id":2458,"title":"City Of The Dead (Resident Evil #3)","description":"Storyline: \n On the front steps of City Hall, Mayor Harris announced in a press conference yesterday afternoon that the City Council will be hiring at least ten new police officers to join the Raccoon police, in response to the continued suspension of the Special Tactics and Rescue Squad (S.T.A.R.S.), in effect since the brutal murders that plagued Raccoon earlier this summer. Joined by Police Chief Brian Irons and all of Raccoon\u0027s Council members, Harris assured the gathered citizens and reporters that Raccoon City will once again be a safe community in which to live and work, and that the investigation into the eleven \"cannibal\" murders and three fatal wild-animal attacks is far from closed.\n \n","cover":"https://allnovel.net/images/city-of-the-dead-resident-evil-3.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/city-of-the-dead-resident-evil-3.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:30:42 PM"}}
