{"id":62757,"no":7,"title":"Page 7","content":"“There’s nothing to get over.” “Still lovin’ and leavin’ ’em?” He caught her gaze and held it. “No.” Her lush mouth twisted wryly. “Sorry. Fuckin’ and leavin’ ’em?” “No, damn it.” “Fine. Don’t tell me. But don’t expect to interrogate me. It goes both ways, Bri.” “Really?” he said grimly, his muscles hard with building anger and barely tempered jealousy. “Did you save your body for me, baby? Did you think of me at night and get yourself off? Were your fingers—maybe some toys—the only things to fuck that sweet, hot cunt of yours, because damned if you’d let another man touch what’s mine?” “Ha!” She straightened. “As if you spent the last five years jacking off to memories of me. Jacob told me all about you, Bri. Tried to warn me off of crushing on you with stories of your many, many conquests. You can’t keep it in your pants.” “Did those stories make you hot?” he purred, pissed off that she didn’t give him the credit he damn well deserved. “You sure asked about them often enough.” “Fuck you.” “Only you.” Layla shut up, her open mouth snapping closed. She glared at him. “Say you don’t believe me,” he coaxed darkly, reaching between his legs to rub his palm over his cock. “You’re a crazy-assed motherfucker if you’re serious.” Her voice was clipped and hard. “You sure found it easy enough to let my golden pussy get away.” “Letting you go was a lot of things, but easy sure as hell wasn’t one of them.” “At what point did you realize you’d made a mistake?” He breathed in and out carefully, trying to rein in his temper. “The instant before you walked out the door. I knew I couldn’t live without you.” “But you did. For two years before that trip to Mexico screwed up my life.” She sat up and reached for her coffee. “We hooked up before you had a chance to grow up. I felt like I’d pulled you straight out of high school into a marriage-like situation and you hadn’t had the opportunity to get your bearings or really figure out what you wanted.” “Always trying to make all the decisions for me, because I’m just a kid.” “What the fuck? I tore my heart out giving you the opportunity to make all the decisions you wanted.” “And who made the decision that I needed those opportunities?” Putting the coffee down, she dug into the bag for a burrito and dropped it into his lap, then grabbed one for herself. “I’m not hungry.” “I decided you are. Eat.” Brian cursed under his breath. “I knew what I wanted, Bri—you. I knew there wasn’t another man in the world for me. I didn’t want to check out the scenery or waste time that could be spent with you.” “Then why did you leave?” Keeping one hand on the wheel, he used his teeth to rip the foil wrapping off the burrito. “You know why.” “And you knew what I did for a living when we started.” “You lied to me when you joined the Marshals Service.” “Bullshit.” “You never said anything about volunteering for the Shadow Stalkers!” She tore a chunk out of the burrito with violent gusto. “I was qualified.” She chewed angrily, then washed down her food with a large swallow of coffee. “You were also qualified as a security expert.” He put the burrito down. Starting his own firm had been a dream he’d shared with Jacob. After his best friend died, Brian felt as if the dream had died, too. He couldn’t imagine going forward with the endeavor without Jacob on board. “Things changed.” “You didn’t. You’re an adrenaline junkie with a hero complex.” “And a big dick,” he lashed out, stung. “Don’t forget that.” Her gaze bore into him. “Truth hurts, doesn’t it?” “Your pussy doesn’t seem to mind.” She flipped him off and resumed eating, canting her body toward the window. He’d wanted to at least have a dialogue about his work with the Marshals Service Special Operations Group before she tossed out her ultimatum, but she’d said the discussion should have been held before he volunteered for SOG and she wasn’t staying with a guy who had a death wish. “What about your painful truths, Layla? Your fear of abandonment kept you from trusting me. You were always laying out ultimatums, with the proof of whether or not I loved you hanging in the balance. You were always waiting for some excuse to say I wasn’t going to stick around after all.” “And you gave it to me, didn’t you?” “Look for something hard enough, you find it, whether it’s really there or not.” Shrugging, she said, “People have baggage. When you love someone, you deal with it.” “I was dealing with yours. You’re the one who couldn’t deal with mine.” “You know what?” Layla pivoted on the seat to face him. “I don’t know why we’re talking about this. It really boils down to the fact that our personal issues conflict. What you require to be happy is exactly what makes me unhappy and vice versa.” “And the fact that I need you and you need me?” he challenged. “What about that?” “What about it? In forty-eight hours or so, I’m going to disappear and you’re going to face whatever the hell you’re going to face for going rogue with a witness.” With a sigh, she faced forward again. “We’ve been trumped by fate, Bri. Consider it a blessing. God knows we’re too stupid to stay away from something that’ll never work.” Maybe, he thought savagely. But stupid or not, he wasn’t giving her up again without a fight. Chapter 6 They holed up for the night in Joplin, Missouri. The motel Brian chose was cheap and in need of serious updating, but Layla was so relieved to get off her ass that she didn’t care. She stumbled into the room and collapsed on the bed face-first, pointing her toes to stretch out her legs. She heard Brian bring the suitcases in and sighed with gratitude, eager to take a hot shower. “What do you want for dinner?” he asked, his hand wrapping around her ankle and squeezing. “A salad with grilled chicken or fish. Nothing fried. I can’t keep eating crap while sitting on my butt all day. I’m starting to feel icky.” “Good call. I’ll be back in a bit. You know the drill.” “Yes. Don’t answer a knock at the door, even if it’s you.” He closed the drapes before leaving the room and Layla crawled off the bed. She repeated her preparations from the night before, wondering as she pulled out another disposable razor if Brian was thinking at all about the box of condoms they’d left in the trash in the other motel. Condoms were something they’d never used. She’d always been on the pill and they’d both been too addicted to the feeling of total connection to put a barrier between them, not to mention how spontaneous they were. He probably thought she was still on birth control. She wasn’t. What was the point when she wasn’t having sex? Remembering his assertion that he’d been celibate since they broke up, Layla felt a surge of guilt. She’d taken lovers after they’d broken up. Enough to prove what she had always suspected—no other man would ever make her feel like Brian did. She’d found men who were similarly attractive, men who had dark and ravenous appetites, men with experience and the patience to make sure she had a good time. But sex was just sex without love, no matter how good it was. She’d never gotten over the feeling that she was in bed with the wrong guy. She took a long, leisurely shower. She shaved her legs smooth and rubbed the motel’s complimentary lotion into her skin. Anticipation thrummed through her veins, along with the steady flow of adrenaline brought on by their circumstances and the desperation of knowing they were only two days away from losing each other again. When she left the bathroom, she found Brian sprawled on the bed in just his jeans. He’d freed the buttons on his fly and sat with his back against the headboard and his bare feet crossed at the ankles. Holding the remote in one hand and a bottle of water in the other, he was watching the news until she came out. When he looked at her, his eyes became dark and hot with want. “Feel better?” His voice was low. Rough. Layla soaked up the sight of him. His chest was tanned from his daily shirtless runs, the broad expanse covered in a light dusting of hair that tapered into a thin line bisecting washboard abs. His arms were a work of art, the ripped biceps flexing when he lifted the water to his lips and drank deeply. His throat worked with each swallow, making her body tighten with need. She was starved for the feel of him. He was so damn sexy. Deliciously powerful and virile. She nodded. “What are you thinking about, sweetheart?” He licked a drop of water off his lower lip. “How bad I want your mouth on my pussy.” His low growl made her nipples hard. He came off the bed in an agile rush of movement. “Eat your dinner while I grab a shower. Then, I’ll eat you.” The look he gave her made her nipples hard. His gaze lowered to her chest as he approached and stopped in front of her. “I’ve been thinking about licking your mouthwatering cunt since you stopped me last night. I fantasized about pulling over at a rest stop, dragging you into the back of the Bronco, and tonguefucking you until you screamed.” “Brian.” He pushed his hand into her panties and cupped her. “Umm . . . you’re hot and juicy already.” Her legs parted at his urging, her heart racing. He was such a highly sexual man and unashamed of his needs. His lack of inhibition turned her on and drove her crazy.","sourceLink":"https://allnovel.net/taking-the-heat-shadow-stalkers-2/page-7.html","bookId":1918,"book":{"id":1918,"title":"Taking the Heat (Shadow Stalkers #2)","description":"Storyline: Taking the Heat (Shadow Stalkers #2) He had three days to fix everything. Three days to remind her of how good they were together. She was a captive audience… Layla Creed and Deputy US Marshal Brian Simmons have a history that is as hot and heartbreaking as it is unforgettable. Now their paths have crossed once again. This time things are twice as hot. Layla—a protected witness—has been persuaded to come out of hiding and testify in a sensational murder trial. But as far as Brian’s concerned, there’s an even more pressing problem. Once Layla testifies she’ll get sucked back into the Witness Protection Program. A new identity, a new location, a new occupation—and a new inspector to check up on her. In other words, out of his life forever. There is one more option—take Layla and go on the run. Rekindling what they once had should be easy. But a stranger in their shadow has plans of his own, forcing Brian and Layla to risk everything in the name of love.","cover":"https://allnovel.net/images/taking-the-heat-shadow-stalkers-2.jpg","author":"Sylvia Day","type":"Romance","source":"allnovel","link":"https://allnovel.net/taking-the-heat-shadow-stalkers-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:48:32 AM"}}
