{"id":100391,"no":15,"title":"Page 15","content":"“Go ahead. Just don’t dally too long.” I could tell by his narrow-eyed look that he meant sparking, and I sighed.\n With Rex in the room, it was unlikely I would crawl all over Fade, even if he could stand for me to do so. Despite my wishing, we weren’t back to our old standing yet. I just nodded as I moved past Edmund, navigated the counter, and stepped into the dim room where all the materials were gathered. Fade was smearing something that smelled awful on a stretched skin while Rex handled another portion of the process. They both glanced up on my arrival, and Fade actually smiled.\n “Come to admire my work?” he teased.\n I pretended to study the rack, then offered a patently false criticism, as I had no idea what they were about or if it was well done. Rex laughed, which was the point. It was good to see my foster brother getting along with Fade. We chatted a while, but I couldn’t linger, as they had work to do, and I had to reassure my mother that I numbered among the living, despite her fears.\n With a wave for Edmund, I hurried out of the shop. Though it had been dark when I watched them go into their little house, I found it fine. It was smaller than their place in Salvation had been, just a room full of beds, really, and they were odd, too, stacked on top of each other, so there was no privacy at all. I found Momma Oaks sweeping a floor that didn’t need it. Here, she had no place to cook, she’d left her beloved dog behind, and the soldiers didn’t seem to value her work. When you got right down to it, our circumstances were similar.\n But she brightened when she spotted me. “I’m so glad you’re here.”\n Few people had said that to me and meant it. Other than Fade, I couldn’t think of anyone who treated me like the sun. Momma Oaks genuinely loved me, however, even when I was difficult for her to understand.\n “This is an odd place,” I said.\n At best, it was shelter. Surely there were normal homes, where families cooked their meals and gathered in the parlor to share stories. I’d seen them dotted here and there, but my family had been allotted this instead. Refugees had no rights, though, no reason to expect better.\n But my mother didn’t show a hint of dissatisfaction.\n “I’m told it used to house soldiers who had no family, but many people died of fever last winter and the Muties have gotten others. So it was standing empty, waiting for us.” She put on a smile. “Isn’t that lucky?”\n I loved this woman so much that my heart hurt with it. I wanted to keep my whole family safe and happy, and it cut me to the bone that it might be beyond my power.\n Summons\n True to his word, Harry Carter had supper the next night with Fade and me in the mess hall. He took short walks around town, building his strength, and I admired his determination. The following day, a runner came to the workshop, where I was pitching in. Since they wouldn’t let me train with the men, I had to keep strong somehow—and cleaning served the purpose. This soldier was young, barely older than I was, but apparently of age to volunteer. He stared at the industry as he’d likely never seen people practice a trade before.\n “Do you need something?” Edmund asked.\n “I’ve been asked to fetch the girl and her friend to the colonel.”\n I couldn’t imagine why, but I dusted my hands on my thighs, then called to Fade, “Can you pause for a bit?”\n He said something to Rex, then stepped out into the main room. “What’s going on?”\n “The colonel needs you,” the messenger said.\n Fade shrugged. “Let’s go see what she wants.”\n Soldiers were running as usual. Others practiced with melee weapons. From the perimeter, the sentries kept calling the all clear. It wasn’t too far, distance-wise, so the silence from the enemy troubled me. If Stalker wasn’t so mad at me, I’d ask for an update on the horde’s position; and it wasn’t his anger that prevented me from inquiring, only the surety he’d snarl and refuse to reply.\n I figured the town leader had a job for us. There was no other reason for such a summons. Fade was quiet until we reached headquarters, then he said, “How bad do you suppose it’ll be?”\n “If she had anybody who could do whatever it is, she wouldn’t need us,” I answered.\n He nodded as we passed into the staging room. If anything it was messier than before with documents and papers spread all over. There was a huge map laid on a battered table and it had markers on it, spread in no pattern I could detect, some red, some black. Morgan cleared his throat to draw the colonel’s attention, and she managed a weary smile. That told me things were dire. People in power only smiled when they wanted something.\n “Good, you got my message. How much do you know about our preparations?”\n “Nothing,” I muttered. “They wouldn’t let me join up.”\n “We’re trying to avoid involving a generation of children … but we might not have a choice down the line. If we lower the enlistment age, you’ll be the first to know.” She paused, looking us over in way that made Fade bristle. “But I can make an exception for covert and special operations.”\n That sounded like a fancy way of breaking the rules, just like they had done for Edmund, because they needed new boots. The government of Soldier’s Pond would do whatever it wanted and then come up with an explanation to justify the decision later. I folded my arms and waited, giving her nothing. My silence set her to pacing, which told me she was worried. I had no interest in going to fetch help, if that was on her mind. It hadn’t saved Salvation, and that tactic wouldn’t work here, either. The Freaks outnumbered us, plain and simple; we needed a new strategy to defeat them.\n The devil if I know what, though.\n “What’s that?” Fade asked, when it became clear I was keeping quiet.\n “Special ops are initiatives undertaken for the good of the town, but not common knowledge to the other soldiers.”\n “A dirty secret then,” I said.\n “Not exactly, but I could see how it would sound that way. First, how familiar are you with what we’ve laid out here?” She indicated the map and all its markers.\n I shrugged. “I can see what it is, but I don’t know what those wood pieces mean.”\n “The black ones stand for settlements,” she explained. “And the red represents all the Mutie movements scouts have spotted in the vicinity.”\n “Has the horde broken into smaller groups?” I asked.\n “No. This is it.” The colonel touched the biggest red piece on the map.\n It covered what looked like impressive ground in the middle of the territory, plus there were all the smaller forces to contend with as well. I had no idea it was this dire. Stalker probably did. And he didn’t tell you. And there was nothing I could do about it. I curled my hands into fists. My knives were paltry against such a threat.\n “What do you want?” Fade asked. “It’s fine to show us how bad things are, but that’s not why you summoned us.”\n “No. After talking to some of my men and hearing stories, some of which I don’t entirely believe, I’ve come to the conclusion that the two of you might be the best suited to undertake a mission for me.”\n “Let me guess—” I started.\n The colonel held up a hand. “Don’t waste my time with sarcasm. Hear me out. It’s a simple yes or no. We need info from a settlement to the northwest … and it’ll help us combat the Muties. But getting through enemy lines won’t be easy, and I need someone who’s used to traveling quick and quiet. Your mission is simple—avoid detection whenever possible, find Dr. Wilson, retrieve the scientific data, and get back here fast.”\n Fade arched a brow. “Is he a medical doctor?”\n Good question. If so, Tegan would want to meet him for sure. Now that her patients were better, she was currently working with the doctor in Soldier’s Pond, but she didn’t think highly of his skills. So maybe we could persuade Wilson to come to Soldier’s Pond. If he wasn’t used to travel, that might make the return journey difficult, but it’d be worth it to see her smile again.\n But the colonel shook her head. “Not exactly. He’s a scientist, and he’s been studying the Muties for twenty years. Last contact we had, he was close to finding a weakness, something we can exploit to counter their greater numbers.”\n “That won’t be enough,” I said. “You need an army, not facts and figures.”\n Her expression went flat. “We have one, but I won’t send them out ill-prepared when Wilson could potentially save lives.”\n “Your army is too small.” I had been thinking about this for a while, and the truth crystallized for me like candy Momma Oaks used to make. “The only way we win is for all the settlements to band together, pool their people and resources.”\n She laughed at me, then shook her head ruefully. “It’s a nice idea, Deuce, but folks have gotten too used to their independence. We can barely come to consensus here, let alone get another town to agree on the action we should take. The territories have turned into a bunch of separate city-states … we haven’t cooperated in over a hundred years.”\n I didn’t know what a city-state was, but it sounded counterproductive. It’s unlikely we can win this war with all the towns acting alone. But the colonel wasn’t interested in my advice, only in using me.\n “Then we’ve already lost,” Fade said. “And this trip is pointless. We may as well go about our business until the horde swoops in. You’ll last longer since your fortifications are metal and you have an ammo stockpile, but sooner or later, they’ll overrun you.”\n His assessment matched mine completely, and I gave a short nod. The colonel planted her hands on her hips, trying to stare us down, but it didn’t work. Silk had a much worse glare and her punishments had been truly cruel. I doubted the colonel had anything like that kind of ruthless streak—until she proved me wrong.\n “Do you know what conscription is?” she asked me.\n Immediately, I tensed, more at her tone than the word. “No.”\n Her smile genuinely frightened me. “What about a draft?”\n “Like when a cool wind gets in through cracks in the house?” I guessed that wasn’t it.\n She shook her head, proving me right. “Historically speaking, armies and navies could demand that a person sign up for service and enforce that requirement by any means necessary in times of war. I’d say this qualifies, wouldn’t you?”\n Since I’d long thought the Freaks weren’t just killing us for food—that they saw us as their enemies—I could hardly dispute her statement. So I stared at her hard, hoping she felt my active dislike. In her smooth tone, I sensed a trap; I just couldn’t make out its shape just yet.\n “No need to answer. Your eyes speak plainly enough. So that being the case, I might have no choice but to call someone else up for active duty, if you refuse this mission.” She paused delicately, pacing a step or two, as if contemplating who it might be. “Your brother, Rex, perhaps. He seems strong, hearty enough.” \n","sourceLink":"https://allnovel.net/horde-razorland-3/page-15.html","bookId":1654,"book":{"id":1654,"title":"Horde (Razorland #3)","description":"Storyline: \n Horde (Razorland #3) \n The horde is coming. \n Salvation is surrounded, monsters at the gates, and this time, they\u0027re not going away. When Deuce, Fade, Stalker and Tegan set out, the odds are against them. But the odds have been stacked against Deuce from the moment she was born. She might not be a Huntress anymore, but she doesn\u0027t run. With her knives in hand and her companions at her side, she will not falter, whether fighting for her life or Fade\u0027s love. \n Ahead, the battle of a lifetime awaits. Freaks are everywhere, attacking settlements, setting up scouts, perimeters, and patrols. There hasn\u0027t been a war like this in centuries, and humans have forgotten how to stand and fight. Unless Deuce can lead them. \n This time, however, more than the fate of a single enclave or outpost hangs in the balance. This time, Deuce carries the banner for the survival of all humanity.\n \n","cover":"https://allnovel.net/images/horde-razorland-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/horde-razorland-3.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:51:02 PM"}}
