{"id":100429,"no":53,"title":"Page 53","content":"“I hurt you too.” Fade was referring to his harsh words on my naming day, when he’d told me everything was over between us. To convince him that was all in the past, I scooted up and brushed my lips against his raspy jaw. I had a fuzzy idea that we might manage some quiet kissing, but oblivion took me before I did more than nuzzle his cheek. We were so weary that neither of us stirred all day. Some point after dark, I woke and Fade nudged me down the ladder, where my brat-mates fed me. Blearily I acknowledged him helping me to the facilities out back, then upstairs again. He stayed close, a warm comfort in my sleep. All told, I was out for almost eighteen hours. Given that I’d been living rough for weeks, had nearly drowned, then hiked to the west side of the island and back, staying up all night, it was no wonder I was too tired to function. When I roused next, it was time to prepare for battle. Meld I spent the day dealing with last-minute details, making sure we were ready for the fight. That included various errands, begging a few items from the vendors, and dealing with the boatmen. Morrow asked his father to smooth our way—and the governor was willing to help, even without knowing why. I liked him more for that; it meant he trusted his son’s judgment. But it was a good thing I’d slept most of the prior day because I wouldn’t rest again before the appointed hour. The villagers didn’t know what was going on, only that the soldiers they housed were saying thanks and farewell. That night, after I wrapped up my work, I met the officers of Company D at the Cup and Bowl, Rosemere’s only pub. It was nicer than the one in Otterburn; the furniture was finished, and the people were friendly, not frightened. But that came from their safety due to the river more than any natural tendency. As a girl approached our table, I wondered if all islands had fared so well. It comforted me to imagine pockets of joy and security around the world, untouched by chemicals, Freaks, or violence. “Nothing for me,” I started to say, as I didn’t have any local chits. Morrow spoke over me. “I’ll pay for the group.” I shrugged. If the storyteller wanted to buy our drinks, that was fine. In response to his request, she brought us a pitcher of ale, which I privately thought was disgusting. The smell should persuade a person not to drink it, but the others seemed pleased as Tegan poured. They’d just returned from the Uroch camp, their expressions stunned and hopeful. While they drank, Morrow and Tegan talked nonstop about Szarok, their voices pitched so nobody but our table could hear. “I trust him,” Tegan murmured. “He seems sincere about the alliance. And I was surprised by how many physiological differences I noted between these and the older ones.” She elaborated on that, but I wasn’t interested in the properties of their blood or other distinctions. When she paused for breath, Morrow added, “I find their culture fascinating. Did you know they share memories with a touch?” “Szarok showed me … a girl in Otterburn changed everything.” “What do you mean?” Spence asked. In answer, I told the story about how one little girl, saving an injured Freak, led us here. Once I finished, Tegan was teary. At first I didn’t understand why until she said, “If we survive, it’s because of her, and she’ll never know.” “She might still be alive,” I suggested, hoping to cheer her. “Since I plan to ride around notifying the families of our fallen men, afterward, I’ll look for her too.” She nodded. “That would mean a lot to me.” Tully seemed less moved by the story. Her mind was clearly on the battle ahead, not what came after, and that was wise. “I don’t know how this arrangement will work long term, but we need their numbers.” Spence downed his ale in a gulp. “No question. I still don’t like the odds, but it’s the best chance we’re likely to get, provided those Gulgur do their part.” “Did you see any when you visited the camp?” I asked. Morrow broke into a smile. “A group was arriving as we left. I spoke with them for a few moments. Funny little fellows, aren’t they?” Nodding, I contemplated the coming battle. There were so many variables; the fight might turn into a massacre, but without help, Company D was doomed. I’d carried them as far as I could on our own. There was no way to produce soldiers from thin air, so we had to accept aid from strange sources. Briefly I wished I could say good-bye to Edmund and Momma Oaks in case things went wrong at the river, but at least Rex was here; and I’d do my best to protect him. Tegan pulled something out of her bag and offered it to me. When I unwrapped it, I held an odd artifact; it had a long, slender red tail, a small cylinder at the top, wrapped in paper, then a string hung down. “What is this?” “Szarok said they’re useful for sending signals. When we’re ready to attack, plant the stick in the ground, light the wick, and step back.” I studied the strange item for a few seconds more, then shrugged and stowed it in my pack. “If he says it’ll work, then we’ll try it.” “He said to wait to a count of two hundred once we light it and then begin the attack. They will do the same from the west.” “They’re smarter than I expected,” Spence said. “And better spoken,” Morrow added. Fade was quiet; the idea of working with the Uroch must be bothering him, after what their brethren had done to him. I touched his leg and he nudged it closer to mine, so our thighs nestled while the others talked. It hit me hard that this could be the last time … for all of this. Any of us could fall tomorrow; there were no guarantees—and my heart hurt with the finality of it. I raised my glass. “I just want to say, it’s been an honor to know you all.” “I’ll drink to that,” Tully said. “Does anyone have questions?” I asked. There were a few, and I answered them. Once we finished the ale, we agreed it was time to get some rest, as we’d soon be meeting the boatmen at the dock. Since there were so many soldiers, they’d make multiple trips. Once we crossed, there was no turning back. But I’d passed that point when Tully said she couldn’t live with knowing we’d let everyone die so we could live, if we gave up and stayed in Rosemere. Morrow stopped me as we left the Cup and Bowl. “You were right about the Uroch. And about the villagers too, I think.” Alarm sputtered to life. “What happened?” “Nothing. But when I saw them encamped, I knew how people here would react. It would’ve been terrible … and so completely avoidable.” “Did you tell your father anything?” Morrow shook his head. “He wouldn’t thank me for keeping this secret, but the council would’ve insisted on some imprudent, hastily concocted defense strategy, and instead of new allies, we’d be fighting on two fronts. We can’t afford that.” “True.” He smiled, glancing down the lane. “I should get on. Tegan’s waiting for me.” “You took her home to meet your parents, did you?” The storyteller ducked his head. “Not like that. But, yes.” “And she doesn’t realize?” I guessed. “Give her time.” “I’m made of it.” He flourished a mocking bow and strode off to where she stood beneath a lamp. When she took his arm, I glimpsed the future, and it beckoned like the wind blowing through a field of wildflowers. The moon glowed overhead, though its curve was waning. I liked it best when it was a slice of silver in the night sky, not so full that it overwhelmed the stars. Here, they shone like chips of ice, so bright that the darkness seemed almost blue by contrast. The sky over Rosemere might be the loveliest I’d ever seen. Fade walked back to where I stood, staring up. Then I realized I hadn’t told him what might make this pact easier to swallow. Quickly, I repeated Szarok’s explanation for how they’d learned our language. I concluded, “So … what you went through? It mattered. If I hadn’t come for you, the Uroch would never have slipped away with the other captives. They wouldn’t have been able to communicate, even if they’d wanted to.” I took Fade’s hand. “You’re the reason we have any hope of winning.” He stood very still, as if listening to the stars. “That’s not true. You’ve carried us this far, my sun. But yes … it helps, knowing I didn’t suffer for nothing.” “I’m glad. It’s hard to believe we’re finally here,” I said softly. “On the eve before the reckoning?” At my nod, Fade trailed his fingertips over my wrist, his eyes glimmering. “It’s a night for taking risks, I think.” I gazed up at him. “And for not leaving things undone.” The memory of his last kiss swept over me. I had been too tired then … but between all the sleep I’d stored up and the looming battle, there was no way I’d close my eyes tonight. In that moment, I wanted only Fade. “I bet Stone and Thimble are asleep by now,” he whispered. “Likely.” They kept early hours, driven by Robin. “We’ll need to be quiet.” “I hope that’s possible.” Fade’s grin held a wicked edge. And I shivered, because he was so obviously talking about more than creeping up the ladder. My fingers tightened on his, and we were running. Fortunately, there were few people about to see our urgency and question it. When we reached the cottage, the door was unlatched. I slipped in with Fade close behind me. The fire was banked low in the hearth, all the supper things put away. There were two rooms at the back of the cottage, one where Stone and Thimble slept, the other for Robin. Just inside, I bent and removed my boots, then carried them with me to the loft. Fade followed soon after; above lay a cozy space with a feather mattress, just big enough for me to sit up at the tallest point. Fade and I had nestled here together, but I remembered only bit and pieces of it. Tonight, I’d memorize every moment. Fade knelt at the edge of the pallet, the hearth downstairs lighting his features enough for me to see his uncertainty. “Do you want this too? I can wait if—” “No.” I swallowed hard, aching, nervous, and excited all at the same time. “I don’t want either of us to regret that we never did.” That was as close as I could come to admitting how scared I was that he wouldn’t be around when the fighting ended. The prospect of my own death didn’t bother me as much, except for how it would hurt Fade. I’d come up with the expectation that I might die protecting others, and my nature hadn’t changed entirely, though I was now able to perceive the beauty of living without a knife strapped to your thigh. “No regrets,” he whispered. I opened my arms, and Fade came to me on his knees, but only because that was what the low ceiling required. There was no begging between us. He kissed me in soft, delicate glides of lips and tongue, as if I’d become fragile. I sank my fingers into his hair and fell into him; that was enough for a while, until he got brave and his hands roved down to my hips. Since I wasn’t a Breeder, nobody had ever told me how this worked, though I’d figured out the gist from noises down below and being close to Fade. I wished I wasn’t nervous, but it was tough, especially considering how little I knew.","sourceLink":"https://allnovel.net/horde-razorland-3/page-53.html","bookId":1654,"book":{"id":1654,"title":"Horde (Razorland #3)","description":"Storyline: Horde (Razorland #3) The horde is coming. Salvation is surrounded, monsters at the gates, and this time, they\u0027re not going away. When Deuce, Fade, Stalker and Tegan set out, the odds are against them. But the odds have been stacked against Deuce from the moment she was born. She might not be a Huntress anymore, but she doesn\u0027t run. With her knives in hand and her companions at her side, she will not falter, whether fighting for her life or Fade\u0027s love. Ahead, the battle of a lifetime awaits. Freaks are everywhere, attacking settlements, setting up scouts, perimeters, and patrols. There hasn\u0027t been a war like this in centuries, and humans have forgotten how to stand and fight. Unless Deuce can lead them. This time, however, more than the fate of a single enclave or outpost hangs in the balance. This time, Deuce carries the banner for the survival of all humanity.","cover":"https://allnovel.net/images/horde-razorland-3.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/horde-razorland-3.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:51:02 PM"}}
