{"id":105573,"no":12,"title":"Page 12","content":"John clenched his hands. \"I\u0027ve never wanted to kill someone so badly in my life,\" he admitted without rancor or guilt. Tiff snorted. \"Yeah, well, after I did my Brain Counting that Nightingale taught me to do... I was pissed enough I wanted to pull his pathetic pecker out and run it up and down his zipper like an accordion.\" John\u0027s brows lifted. Tiff contemplated, then, \"About five or six hundred times.\" John guffawed. \"Really?\" he asked slowly. \"Really,\" Tiff responded definitively. \"Of course, I\u0027d have to touch it.\" She shuddered. \"You\u0027d have to find it,\" John added, playing the game, making it light. Tiff grinned at him, her happiness was palpable and he grabbed it midair, like a species threatened with extinction, greedy for the rarity of her pleasure. The moment passed and John pulled up in front of the Weller house. \"You don\u0027t have to walk me to the door every time, John,\" Tiff said, her small hand on the door handle. \"I know,\" he said quietly, pulsing off the engine. Tiff watched the sun slant through the window and cut through his hair, making it look ablaze. She had a disturbing premonition. John saw her face and frowned. \"What?\" Tiff stared at him a beat longer then shook it off. \"Nothing,\" she said, feeling kinda lame. John and Tiff walked to the front door and she opened it. Inside there were toys strewn everywhere. John saw Legos all over and instantly grimaced at the feet mutilator those were. \"I\u0027ll pick you up tomorrow for class.\" Tiff nodded. It still made her feel uptight to go to the self-defense classes. But she was three months in and her instructor claimed she was a natural. She hated the ultimate precept: that girls should aim for getting away. Not fighting. The focus of the class was about disarming and gaining time to get help. Tiff was more than a runner. She was a fighter. It was a deep-seated need to defend her own person. That Carson had beaten and sexually assaulted her lay like a raw and open wound on the very fabric of who Tiff was. She didn\u0027t say those things to John when he referenced chaperoning her tomorrow. Tiff\u0027s eyes did. It caused worry to bloom instantly inside John, who had more intuition than he gave himself credit for. He knew that she wanted a go at Carson. John was afraid for himself. They\u0027d better dump him in jail and throw away the pulsekey if that fucker touched Tiff. Because John knew he\u0027d kill him if he touched her. Slowly, if time allowed. They didn\u0027t speak their thoughts to each other in that still moment of time outside the chaos of her house. Instead, John bent and put his lips on Tiff\u0027s, palming both sides of her small face as she wrapped her small arms around his neck. He ended the kiss buried in that fragrant soft spot that all girls\u0027 held between their neck and shoulder, tickling her. Tiff pulled away with a small smile and put her hand on the side of his face, feeling a light golden red stubble there. \"I love ya, John Terran,\" she said with a husky catch. He blinked slowly, tears that burned his eyes staying put by the barest margin. John managed to nod as he turned away, swiping at his eyes. Tiffany Weller so had him. He\u0027d told her a hundred times he loved her. Tiff had told him once. It clicked her position into his heart with a clanging finality that echoed long after he left her stoop. Carson Carson Hamilton watched the lovebirds from his mandatory one hundred meter distance. That stupid bitch had put the bite on him alright. Her little tag on his ass at the graduation reception had landed him with a pulse anklet. A nifty-as-fuck \u0027distance monitor\u0027. Carson was ready to go the distance. The dumb thing gave him a one meter warning beep when he violated the football field distance of his restraining order. If he went outside his limits, it lit him up like a Christmas tree. It hurt like a bitch. After the graduation reception they\u0027d wasted no time in shackling him with the anklet. Carson stewed, just far enough away to need binoculars as he watched Terran walk away from that stupid twat. Actually, Tiff Weller wasn\u0027t stupid. That was the problem. He\u0027d tried to knock her brains out on the locker but that hadn\u0027t worked. He lowered the binoculars, tapping them restlessly against his thigh. Carson wasn\u0027t popular at home. Dad was pissed because he\u0027d made him look bad. They were fighting the rape charge, but it might stick. And he\u0027d not even gotten to do her, Carson ruminated sullenly. It had been a near thing. Just the thought of how close he\u0027d come from being able to do his worst. He clenched his eyes shut. Carson could remember her fragile and vulnerable underneath him, a hairsbreadth away from his mercy. He\u0027d wanted to put Tiff Weller in her place in the worst way, he could taste it. It had been choking his fucking tongue. Carson stared at her small form by the door while his rage swelled. Then he saw that brick head of a brother come to the door, he about shit when the lug looked straight at him. But Carson had camouflaged himself well, so he knew Weller didn\u0027t see him. It was disconcerting as hell, though. That shithead had made the Hamilton yard Carson\u0027s chore now, he\u0027d dumped his dad\u0027s house like a hot rock when he got his own landscaping gig. Like he was too good to shovel steer manure onto their postage stamp lawn. Those Wellers were too big for their britches. They needed to be taken down a peg or two. Carson eyeballed that house of theirs with a keen eye. Carson Hamilton could be the big bad wolf. He\u0027d blow their house of sticks down. He swung his glance to Terran as he got into his eco-car. A natural gas hybrid. A car for dickheads. He frowned when he thought of Terran doin\u0027 that stuck up Weller bitch. Tiff had always claimed Carson didn\u0027t have a dick. What made Terran so special? Hamilton thought Terran would be a problem. He needed to make sure Terran wasn\u0027t in the picture. \u0027Cuz the plans he had for his bitch girlfriend wouldn\u0027t happen if his Null ass was around. Carson walked away without a backward glance. Caleb \"Wow... that was so bad,\" Jade said, throwing her heels off into the well of the Camaro\u0027s floorboards and putting her feet on the dash. The weather was warm and her feet were bare with hot pink on her toenails, courtesy of Sophie. I had an errant thought, was Sophie like a part time manicurist? \"Hot feet, babe,\" I said, winking. Then, \"Sophie did your manicure, right?\" Jade did a cute little frown that I wanted to kiss away but my Sex Impulses interfered with my goal of Driving without Wrecking. \"Ah... no. I did it, I think she worked Tiff over though,\" Jade gave a giggle behind her mouth and I scowled, I knew something was coming. \"You\u0027re so cute when you screw up girl stuff.\" Screw up girl stuff. Yeah, that was me. \"It\u0027s a pedi, Caleb.\" She studied her pretty toenails with absorbed attention. Oh right, feet is pedicure, hands are manicure, I remembered too late to sound remotely knowledgeable. Kinda like the difference between a manifold and an engine. Made all kinds of sense. I was dying here, could she throw me a bone? I wondered. Jade patted me on my knee and my thoughts shifted instantly. She gave a low throaty laugh. \"I hear you, stud.\" And she winked. \"Loud. And. Clear.\" \"Good,\" I said, practically panting like a dog on her leash. \"Glad we\u0027re on the same pulselength.\" She smiled and batted her eyelashes. Then, thoroughly bashing the mood said, \"So what\u0027s gonna happen with Carson Hamilton?\" Ugh. I shifted in my seat, trying to think about a dickhead instead of more exciting things and finally responded with, \"Terran\u0027s got it.\" \"I don\u0027t know,\" Jade said hesitantly, thinking about the episode at Terran\u0027s house. I snapped my eyes off the road for a second and latched onto her face. I only looked for three seconds. \"You feel something, Jade?\" I asked. She looked at me for a second more. \"Yeah, I kinda... Caleb!\" she shrieked and the adrenaline surged as something so unexpected rose up in my vision. It was another bear. Not mine. But quite dead. The Camaro plowed into it and the bear tumbled over the low slung, racing style car with a thump that cracked the windshield in an elaborate spider web. The impact threw us against our harness restraints and they did their job, snapping us into place. An airbag would\u0027ve killed Jade. But Gramps had that grandfathered for this vehicle. No airbags, real fossil fuel, and and all-steel carriage. It was a heavy car with a huge engine and that bear tore over the roof, careening over the trunk and crunching the spoiler on the back as it thunked to the ground behind my skidding car. Jade and I looked at each other. \"What the hell was that?\" she asked in a breathy voice. \"It\u0027s a bear,\" I said, my hands gripping the wheel. \"Oh my gawd!\" she cried, her open palm striking the center of her chest. \"The poor thing!\" Jade got big crocodile tears sliding down her face because of the poor bear. Uh-huh. \"It\u0027s dead,\" I said in a flat voice that belied the racing of my heart. \"Wait... what?\" Jade asked, turning in her seat and facing me. Then her eyes took on a look I knew too well. Knowledge. Fear. \"You mean...\" she said weakly. I nodded. \"Oh yeah.\" The bear lumbered over to the passenger window and pawed the glass. I grabbed Jade just as it shattered it behind her, large sheets of glass falling where she\u0027d been sitting a heartbeat before. Non-tempered glass breaks in shards. Sometimes grandfathering sucked. Like now. I popped the door and hauled her out with one arm. I couldn\u0027t even believe it myself. The bear straightened up on its hind legs and opened its mouth wide. It roared at me, its great head shaking, the sound deafening from that distance. Jade shuddered, cleaving to me like a second skin. My girlfriend was standing in the middle of a little-traveled road, barefoot in her post-graduation finery. With a zombie bear that wasn\u0027t mine just stepping out with perfect timing in front of my car. Yeah, right. That level of coincidence always happens to me. Uh-huh. I tore off the tie that my parents had insisted I wear and got ready to figure this whole mess out when I had a moment of intense relief. I thought it was Jonesy pulling up behind us, coming to a slow stop. I looked quickly but it wasn\u0027t Jonesy, it was Gramps\u0027 car. Before I could figure out why Jonesy and Gramps were together, the bear dropped on all fours and lumbered around the edge of the car, working his way to where we stood. I backed up and the dead eyes of the bear bore into mine, rotten plums in a black face. There was no pull of death from me to him. He was being fueled by another Cadaver-Manipulator. But who? Gramps took in the mess of the Camaro, completely ignoring the bear. \"Caleb? What\u0027s this with the car, son?\" Jonesy snickered in the background. Cripes on a crutch. \"Not now, Gramps, kinda got some zombie shit brewing.\" Gramps snorted. \"Fine. Let Parker deal with furnuts here and I\u0027ll see what the hell\u0027s happened to this old gal,\" Gramps said in that casual way of his. When nothing was remotely casual. Parker? I whirled around and there Jeffrey Parker stood. \"Hey, Caleb.\" He looked thinner, I thought. \"Watch out!\" Parker yelled. I turned and the paw descended as if in slow-motion and I shoved Jade away, letting that power over the dead flow out. It was more about not holding back than trying. It struck the bear between he eyes and it paused. \"Is this yours?\" I yelled at him as I used its hesitation to grab Jade and run to Parker, who was shaking his head. Gramps jerked a thumb at Parker. \"You can\u0027t call off Wild Kingdom, pal?\" Parker smirked. \"No. That is actually not mine.\" Before I could figure out whose it was or really, what in the blue hell was going on, Gramps said, \"Well, it\u0027s not just the zoo, Caleb.\" I saw them in the trees that lined the road. Rotting sentinels that I didn\u0027t own. That Parker didn\u0027t own. There were simply too many. Too many dead, not enough weapons; even with Parker\u0027s help I couldn\u0027t rein in my emotions hard enough for control. Then Jonesy sprang forward. \"Who\u0027s in charge of these zombies?\" he asked, all man-of-the-hour. Parker and I looked at each other as a wave of nauseating rot reached us like a spoiling tide landing at shore. It was funny, really. A necromancer liked their own brand. But raise a horde of zombies that weren\u0027t mine and I wanted to spew chunks.","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-12.html","bookId":2494,"book":{"id":2494,"title":"Unrequited Death (Death #6)","description":"Storyline: Unrequited Death (Death #6) The Graysheets remain ominously quiet during the teen\u0027s senior year. When tragedy strikes Tiff, her confidence shatters into a million pieces and the group doesn\u0027t know how to pick up the splintered mess of her emotional health. As the control of the Zondorae scientists slips away, they make a final move to swing the balance in their favor, negotiating a future for the paranormals that is so final, a covert group moves to halt the momentum of their control over humanity with Jeffrey Parker as the catalyst. In a final bid to protect everyone, Caleb discovers he was at the center from the beginning, an unwilling pawn moved on a chess board that no longer exists. Will he have a future of safety and happiness for himself and Jade? Or will the decisions made before the fateful day of inoculation remain to hinder that forever?","cover":"https://allnovel.net/images/unrequited-death-death-6.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/unrequited-death-death-6.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:48:08 PM"}}
