{"id":105591,"no":31,"title":"Page 31","content":"I watched Jade put away last minute things, her deep green dress grazing her feet, jeweled sandals peeking out from under the almost sheer material. Sexy toes painted a pale frosty white. Her belly swelled now and I moved closer to her, putting my face against the hard heat of it just as the baby gave a huge roll and she laughed, putting her hand on her stomach. \"Hey guy,\" I said softly against her rounded belly. \"What if it\u0027s a girl?\" Jade asked just as softly and I rolled my eyes up to look into hers. \"Hey girl,\" I repeated in the same tone of voice as our gazes locked and hers shone with her love for me, her hand moving away from her belly and into to my hair. Maybe we didn\u0027t need to go right this second, I thought. \"Uh-uh, stud,\" she said, getting a gander at my thoughts. \"We\u0027ll be late.\" I frowned. \"Not that late,\" I said and moved her into the cradle of my body. We were late and my tie was crooked. Clyde didn\u0027t say anything when we arrived, taking in our flushed faces and eyes that were bright and happy. He smiled that secret smile of his. Understanding. Then we followed him inside a church that he\u0027d always wanted to be in. But for different reasons. There had been a girl he\u0027d loved when he lived in a different time. After he died their love had remained unrequited. But the fates had spoken. Clyde got what others before him had never realized: a second chance at life. We\u0027d held death at bay, robbing the grim reaper of one more subject, unlike love it was death, unrequited death. I swallowed the lump in my throat, knowing that for all the horrible things that happened in this blue marble we lived on, sometimes, something that was truly deserved transpired. I stood next to my zombie on his wedding day. His large hands, calloused from farming and fighting, took Roberta Gale\u0027s in his. They turned to face each other as their vows were spoken and she looked just like Jade in profile, her belly swollen with their child. It was a true miracle. When the priest voiced the final blessing in Latin, they bent forward and pressed a chaste kiss to each others lips. Then it deepened and for the first time, I saw Clyde\u0027s control slip a little, his happiness unrestrained and raw, he swept Bobbi against him, his heavy and muscular body wrapping her small one against his own. Clyde shook as he wept against Gale\u0027s hair and the gang and I stood, clapping and cheering. Mom cried and Dad\u0027s eyes had that tell-tale guy sheen as our gazes met and he gave me a nod. I guess we\u0027d done okay after all. Sophie squealed in excited girl delight, throwing rose petals at the pair after the kiss broke and they walked swiftly down the aisle. Clyde\u0027s eyes caught mine before he exited the cathedral, his hand wrapped in his bride\u0027s. I was humbled to my marrow by what I saw there. Gratitude. CHAPTER 23 early autumn Jade and I sat at our small, Salvation Army kitchen table. The entire house was furnished this way, thriftstore chic, Sophie called it. I didn\u0027t give a hot damn what the décor was. Jade was becoming quite a cook and the table held the food she made. From a guy\u0027s point of view, that was all that was needed. Women spent a lot of time complicating things with men. Trying to figure us out. We were terribly simplistic: feed us and... well, Jade was very good at the other. I gave a couple moments of thought to that and Jade giggled. Her hand had been on my forearm and I thought for the millionth time how awesome having an Empath wife was. \"I am not your sex-minion,\" she said, resting her cup of tea on her belly, the thing distractingly placed between breasts that were wonderfully huge. \"Uh.... huh!\" I said, grabbing for her and she squealed. \"Stop!\" She waved a letter in front of me to get my attention. \"What?\" I grumped. \"Do you think mail will distract me from my goals here?\" I asked with a smile. \"This one will,\" she said and I grabbed it. \"I\u0027m going to have my way with you later,\" I promised, giving her a soft peck on her mouth. Jade grinned. \"I know, you\u0027re a man of your word.\" I gave her a look and she blushed. But what I read absorbed my full attention. I opened the thick creamy envelope, breaking a seal of wax in the process. \"He knows you like old-fashioned stuff,\" Jade said in the background and I nodded absently as she got up to put the tea kettle back on. Who the hell even sent letters anymore? We had a glass mailbox that was over a hundred years old attached to the exterior of our house. The mailman came and delivered on Fridays, and this had arrived. When my parents were young, they\u0027d delivered every day but Sundays. I slid out the note and read it. Twice. Dear Caleb, I am still keeping tabs on you, my favorite necromancer. Nevaeh and I are getting better acquainted and expect to see you and yours again when things have quieted. Know this: that I have your back. I always did, though I couldn\u0027t always show it. There will be a future for those like ourselves. Take heart that there is a place for Randoms. Don\u0027t get discouraged and take care of your new family. Parker I sat quietly for a time and Jade let me, quietly sipping her tea. My eyes strayed back three times to the \"favorite necromancer,\" which made me smile. Then the \"better acquainted\" which made me wonder. Jade called my name. I looked up, startled. \"I\u0027ve called your name three times.\" Her eyes had become strained and tight at the corners. Instantly concerned, I put the letter down, my gaze meeting hers. \"What is is?\" \"My water broke.\" I shot up like an arrow as the doorbell rang. I rushed to the door in an unnatural panic and ripped the thing open and Gramps stood there in coveralls, dripping with carpentry tools. \"Hey,\" I said breathlessly, in a voice that squeaked like a strangled goose. Gramps eyes widened. \"Cat got your tongue?\" I stood there stupidly gaping as Jade came up behind me with a small packed bag. Gramps took in my look and Jade\u0027s calmly composed face, her small hand clutching the bag. \"I take it we\u0027re not working on that picket fence today?\" Gramps stated calmly while his eyes were full of contained mirth. I shook my head, still struck mute like a dumb ass. \"No,\" Jade said with quiet dignity, \"I\u0027ll be busy having a baby.\" My hand gripped the solid oak door. \"Maybe a ride instead, Gramps,\" I managed. Gramps smiled, clapping me on the back. \"I think I can manage a ride.\" He grabbed the bag from Jade and nearly kicked my leaden ass out the door and locked it with the keys Jade gave him. I gradually awoke from my fugue and helped Jade into the car, locking her seat restraint. She put her head on my shoulder and I pressed a kiss to her forehead. \"I\u0027m scared,\" she whispered into my chest. I moved my hands off her skin. Me too. \"Don\u0027t be, I\u0027ll be there the whole time.\" Then I cupped her head against my chest, our heartbeats syncing. Jade nodded mutely into my body and I thought how hard it was to be a woman, having to go through the pain, the unknown. I thought about how hard it was to be a man, to watch the one you breathed for go through pain you could do nothing about. In the end my fear had to take a back seat to hers. Fear was nothing but a thief of your fortitude. And it wasn\u0027t going to rob us of this moment. We sped to the hospital, the woman I loved in my arms where she belonged, my heart in her hands and those of our child that would be born. Life was good. EPILOGUE five years later Parker had finally wanted to meet so we scoped out Scenic Park. It\u0027s where the kids could play. The sounds of the park had changed since the HC mass sterilization. Where before there\u0027d been chaotic noises of playing they\u0027d fallen to a dim roar. Just a few dots of color littered the playground now. One was my wife\u0027s. Jade stood behind our son, pushing him on the swing while he pumped his little legs. He looked like her. When she leaned down to say something to him, their black hair mingled perfectly. His coat was red and hers green. Christmas colors. \"Why so long?\" I asked him without turning. He came on my death radar before he stepped out of his car. \"Just being cautious, Caleb.\" Silence rolled out then I asked, \"Are ya happy, Parker?\" I turned to look at him then and saw he\u0027d gained weight, his lean frame had finally filled out and muscle and size had replaced that svelte frame he\u0027d had back when we\u0027d busted up the HC. \"Yeah,\" he said simply and I nodded, my face turning back to watch my family. Jade\u0027s belly was swollen with another baby. We\u0027d waited before we had another. She caught me staring and lifted her hand. I waved in return. She went back to swinging Paxton and I asked Parker, \"So?\" \"Nevaeh already knows, but I thought it was fair that you did as well.\" We looked at each other and he told me that last little secret bit of information the HCs had worked out. \"They didn\u0027t think... they figured they had you on the sterilization bandwagon.\" An old expression, one Gramps still used. I understood it well. Parker\u0027s hazel eyes met mine. \"You\u0027re more than a mule, Caleb. You and Nevaeh both.\" He explained. \"You mean... we\u0027re like Noah\u0027s Ark?\" Parker laughed. \"Not exactly but that nicely circles what I\u0027m saying here. Basically, they made sure that all the unlocked markers that were in both you and Nevaeh lay dormant.\" He had my full attention. \"Swell. So now what?\" I asked, scrubbing my face, feeling the sharpness of my weekend stubble and dropping my hands to dangle between my knees. \"I\u0027m going to wake up and be... what? A paranormal prodigy?\" Parker shook his head. \"I simply don\u0027t know. What I do know is that Dr. Hart giving you that depressant as a counter to subdue your abilities pinging on your aptitude test diluted their solution to you never procreating. They wanted that gene pool present but not manifested.\" The more details that were revealed about the Helix Complex, the more I hated the HC fuckers. Of course, they were a non-issue now, but they\u0027d still managed to shape my life regardless. As Gramps said, you couldn\u0027t rewrite history, no matter how much you desired to. Then Parker dropped the bomb, \"Your genetics were altered at the molecular level, Caleb.\" Holy shit. I put everything together in a swelling leap of logic that made my heart stumble in its rhythmic progress. \"Our kids,\" I said numbly. He nodded once and Nevaeh came forward with two children. Twins. I stood, controlling the fine tremble of my hands with difficulty. Jade saw me and stopped what she was doing, tightening the band that held her black hair as she quickly walked toward us. Her eyes took in Nevaeh and Parker\u0027s kids with some caution. I\u0027d taught Jade that. I was freakishly overprotective. That was just the way I was hard-wired and mostly she was used to it. I put my body in front of Jade\u0027s and my hand palmed the top of Paxton\u0027s head. \"We\u0027re not the threat, Caleb.\" Parker stood and Nevaeh came to stand beside him, almost as tall as he, but reed thin. The two kids looked like her; they shared her coal-black hair color. But hazel eyes glittered at me and I held my ground even though they were a shade of creepy I had yet to encounter. And that was saying something. Jade took my hand and knew all, gasping when she got details maybe she\u0027d have been better not knowing. \"So the kids will have... everything?\" she asked and Parker nodded. \"It looks like your boy is already on his way,\" Nevaeh said. \"What do you mean?\" I asked. Parker gave a look behind my shoulder and Jade and I slowly turned. A group of squirrels, their bushy tails standing at attention, stared at us, their sockets empty of most of their eyeballs. It had been an amateur mass raising. Something a child would do. I could have had them looking like they were still alive. However, I was twenty-five. And they weren\u0027t looking at me. They only had eyes for Paxton, my four year old. I kept it together by the thinnest of margins. Hunkering down next to my son, I took both his hands, ignoring the audience I asked, \"What\u0027s happening, Pax?\" \"They wanted to come out, Daddy,\" he said, his wide eyes that were a bluish-gray like Mom\u0027s looking out from a face that was Jade\u0027s. \"They told you, pal?\" He nodded solemnly. This was going to be interesting. I looked at the pack of disconcerting squirrels, their collective gaze on my son and gave a hard swallow. I swung my eyes to Parker and he gave a small smile.","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-31.html","bookId":2494,"book":{"id":2494,"title":"Unrequited Death (Death #6)","description":"Storyline: Unrequited Death (Death #6) The Graysheets remain ominously quiet during the teen\u0027s senior year. When tragedy strikes Tiff, her confidence shatters into a million pieces and the group doesn\u0027t know how to pick up the splintered mess of her emotional health. As the control of the Zondorae scientists slips away, they make a final move to swing the balance in their favor, negotiating a future for the paranormals that is so final, a covert group moves to halt the momentum of their control over humanity with Jeffrey Parker as the catalyst. In a final bid to protect everyone, Caleb discovers he was at the center from the beginning, an unwilling pawn moved on a chess board that no longer exists. Will he have a future of safety and happiness for himself and Jade? Or will the decisions made before the fateful day of inoculation remain to hinder that forever?","cover":"https://allnovel.net/images/unrequited-death-death-6.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/unrequited-death-death-6.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:48:08 PM"}}
