{"id":105592,"no":32,"title":"Page 32","content":"\\n\\n One of his girls stepped forward, her hair glinting with high gloss bluish highlights as only truly black hair did, \"I can help.\"\\n\\n She looked at Paxton, her finger in her mouth and Nevaeh said, \"Go ahead, Simone, help him.\"\\n\\n And she did.\\n\\n Paxton held out his hand and she took it within her small one.\\n\\n Together they looked at the squirrels.\\n\\n The squirrels turned and scampered back to where they\u0027d died. I watched as scattered and random holes in the ground opened like mouths and the dead rodents melted into the earth, the holes closing over them like repaired wounds.\\n\\n I met Parker\u0027s eyes. \"It\u0027s a whole new world,\" I noted quietly.\\n\\n \"Wait a minute,\" Jade said, her eyes going from Simone to Paxton, \"what\u0027s this Noah\u0027s Ark thing?\"\\n\\n I smiled but Parker didn\u0027t.\\n\\n Mine faded and Jade went on, \"I remember this story. God chose three couples to be saved, saved from the flood...\"\\n\\n Nevaeh huffed. \"That\u0027s just a myth, Jade... you know that.\"\\n\\n Jade\u0027s eyes narrowed. \"Then why is it I found it in the tone of his thoughts?\" she asked indicating me.\\n\\n Nevaeh\u0027s eyes narrowed on Jade and that protective urge sprung to life, our children a pair between us.\\n\\n \"Mommy\u0027s mad,\" Pax said.\\n\\n \"Mine too,\" Simone agreed, giggling behind her hand.\\n\\n Jade\u0027s eyes widened but I was unsurprised.\\n\\n Parker nodded. \"As you would say, Caleb: they\u0027ve got the whole tamale.\"\\n\\n \"I don\u0027t think they planned on this happening.\" Parker looked at us while a lone family played at a safe distance on this cool fall day, the leaves skittering across the ground as we faced off, the sky a deep and resolute blue above us.\\n\\n The family remained ignorant, having entered the scene after the dead squirrel episode.\\n\\n I almost laughed, even though none of these revelations were remotely funny. We had children that had every paranormal ability there\u0027d ever been. Because they\u0027d laid a Trojan horse within our genetic code, freaked out, and injected us with a sterilizing concoction that hadn\u0027t worked.\\n\\n Parker watched my ruminations, then nodded. \"The group that worked to make sure us Randoms were protected made certain the mules could have children. The Helix Complex never thought about Clyde, however.\"\\n\\n Gooseflesh covered my body and I heard Jade gasp.\\n\\n Parker grinned. \"By nature\u0027s laws, he should no longer be. Yet... he is.\"\\n\\n I knew this, hell, Clyde and I got together all the time, his children with Roberta Gale were not only accepted but welcomed. The former prejudice against his undead status was gone.\\n\\n Funny how humanity would forgive anything when faced with extinction.\\n\\n \"So there are three pair?\" Jade reiterated.\\n\\n Parker nodded. \"Clyde\u0027s a wild card but Nevaeh and Caleb, they\u0027re a \u0027known\u0027,\" Parker said with airquotes.\\n\\n I had a ominous thought. \"Who knows?\"\\n\\n Parker shrugged. \"No one. The people that knew are gone.\"\\n\\n Thank God, I thought. I didn\u0027t want a rinse and repeat with yet another organization trying to lay hands on my family.\\n\\n Parker met my eyes. I could see he didn\u0027t either. He\u0027d scratched and clawed his way to be where he was today. From a life of domestic abuse and murder, to an organization that exploited him for his ability, intelligence and natural gifts.\\n\\n No, this is what he deserved, wrangling an unlikely happy ending through brute force.\\n\\n It\u0027s what we both deserved.\\n\\n He\u0027d met me here to tell me.\\n\\n And warn me.\\n\\n Duly noted.\\n\\n \"I\u0027ll keep in touch,\" Parker said, ending it.\\n\\n I grabbed his hand, our flesh squeezing together in a brutal pact of understanding and kinship. Honed through circumstance and alliance.\\n\\n Parker and I were in this together, our future uncertain, our present secure.\\n\\n I watched him leave the park, a girl in each hand and Nevaeh alongside.\\n\\n I tucked Jade against me, unconsciously turning her belly closer to my side, my hand on Pax\u0027s head.\\n\\n I led my family toward our car and to the security of our home.\\n\\n The eyes that watched us were thoughtful and remained unseen.\\n\\n Paxton turned once and looked into the dense trees that bordered the open park. He looked beyond the jungle gym playthings into the dark branches that twined together.\\n\\n \"What is it, buddy?\" I asked, following his deep gaze.\\n\\n \"I don\u0027t know,\" he said, but a small furrow marred the perfect skin between his brows.\\n\\n I ruffled his hair. \"How about some ice cream?\" I asked.\\n\\n Pax\u0027s face broke out in a grin, thoughts of dead squirrels and that troubling presence melting away.\\n\\n \"Yeah!\" he yelled in a voice that had recently lost the sound of babyhood. He jumped in the back seat, I buckled the toddler restraint around him and stepped back, his eyes once again straying to the woods.\\n\\n I looked where he did and Jade said, \"What is it?\"\\n\\n \"I don\u0027t know.\" My eyes searched the gloom beyond. Seeing nothing I rounded the front of the car and slid in, my family safely encased inside.\\n\\n I shook off the misgivings of the moment, ice cream on the brain and pulsed on the Camaro, conceding its days were numbered. With another kid on the way, I\u0027d have to get practical in a hurry.\\n\\n There was always Gramps\u0027 vintage Bronco I could talk him out of. I grinned as Jade slid her arm through mine and I kissed her forehead, flicking my eyes to the rear view mirror.\\n\\n I saw Paxton\u0027s eyes remained on the deepness of the woods.\\n\\n We pulled away, leaving that gloomy moment behind us.\\n\\n The eyes that had been watching continued until my car was out of sight.\\n\\n The End \\n\\n","sourceLink":"https://allnovel.net/unrequited-death-death-6/page-32.html","bookId":2494,"book":{"id":2494,"title":"Unrequited Death (Death #6)","description":"Storyline: Unrequited Death (Death #6) \\n The Graysheets remain ominously quiet during the teen\u0027s senior year. When tragedy strikes Tiff, her confidence shatters into a million pieces and the group doesn\u0027t know how to pick up the splintered mess of her emotional health. \\n As the control of the Zondorae scientists slips away, they make a final move to swing the balance in their favor, negotiating a future for the paranormals that is so final, a covert group moves to halt the momentum of their control over humanity with Jeffrey Parker as the catalyst. \\n In a final bid to protect everyone, Caleb discovers he was at the center from the beginning, an unwilling pawn moved on a chess board that no longer exists. Will he have a future of safety and happiness for himself and Jade? Or will the decisions made before the fateful day of inoculation remain to hinder that forever?\\n","cover":"https://allnovel.net/images/unrequited-death-death-6.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/unrequited-death-death-6.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:48:08 PM"}}
