{"id":109387,"no":8,"title":"Page 8","content":"\"You seem sad,\" Hickory said, as we took the shuttle back to Phoenix Station. Dickory sat next to Hickory, impassive as ever.\n \"I am sad,\" I said. \"I miss my mother and father.\" I glanced over to John, who was sitting in the front of the shuttle with the pilot, Lieutenant Cloud. \"And I think all this moving and leaving and going is getting to me a little bit. Sorry.\"\n \"No need to apologize,\" Hickory said. \"This journey has been stressful for us, too.\"\n \"Oh, good,\" I said, turning back to the two of them. \"Misery loves company.\"\n \"If you would like we would be happy to try to cheer you up,\" Hickory said.\n \"Really,\" I said. This was a new tactic. \"How would you do that?\"\n \"We could tell you a story,\" Hickory said.\n \"What story?\" I asked.\n \"One that Dickory and I have been working on,\" Hickory said.\n \"You\u0027ve been writing?\" I said. I didn\u0027t bother to keep the incredulousness out of my voice.\n \"Is it that surprising?\" Hickory said.\n \"Absolutely,\" I said. \"I didn\u0027t know you had it in you.\"\n \"The Obin don\u0027t have stories of their own,\" Hickory said. \"We learned about them through you, when you had us read to you.\"\n I was puzzled for a minute, and then I remembered: When I was younger I asked Hickory and Dickory to read bedtime stories to me. It was a failed experiment, to say the least; even with their consciousness machines on, neither of them could tell a story to save their lives. The beats were all wrong - they didn\u0027t know how to read the emotions in the story is the best way I can put it. They could read the words, all right. They just couldn\u0027t tell the story.\n \"So you\u0027ve been reading stories since then,\" I said.\n \"Sometimes,\" Hickory said. \"Fairy tales and myths. We are most interested in myths, because they are stories of gods and creation. Dickory and I have decided to make a creation myth for the Obin, so we have a story of our own.\"\n \"And this is the story you want to tell me,\" I said.\n \"If you think it would cheer you up,\" Hickory said.\n \"Well, is it a happy creation myth?\" I asked.\n \"It is for us,\" Hickory said. \"You should know you play a part in it.\"\n \"Well, then,\" I said. \"I definitely want to hear it now.\"\n Hickory conferred with Dickory quickly, in their own language. \"We will tell you the short version,\" Hickory said.\n \"There\u0027s a long version?\" I said. \"I\u0027m really intrigued.\"\n \"The remainder of the shuttle ride will not be long enough for the long version,\" Hickory said. \"Unless we then went back down to Phoenix. And then back up. And then back down again.\"\n \"The short version it is,\" I said.\n \"Very well,\" Hickory said, and began. \"Once upon a time - \"\n \"Really?\" I said. \"\u0027Once upon a time\u0027?\"\n \"What is wrong with \u0027once upon a time\u0027?\" Hickory asked. \"Many of your stories and myths start that way. We thought it would be appropriate.\"\n \"There\u0027s nothing wrong with it,\" I said. \"It\u0027s just a little old-fashioned.\"\n \"We will change it if you like,\" Hickory said.\n \"No,\" I said. \"I\u0027m sorry, Hickory, I interrupted you. Please start again.\"\n \"Very well,\" Hickory said. \"Once upon a time...\"\n Once upon a time there were creatures who lived on a moon of a large gas planet. And these creatures did not have a name, nor did they know they lived on a moon, nor did they know that moon circled a gas planet, nor what a planet was, nor did they know anything in a way that could be said that they were knowing it. They were animals, and they had no consciousness, and they were born and lived and died, all their lives without thought or the knowledge of thought.\n One day, although the animals knew nothing of the idea of days, visitors came to the moon that circled the gas planet. And these visitors were known as Consu, although the animals on the planet did not know that, because it was what the Consu called themselves, and the animals were not smart and could not ask the Consu what they called themselves, or know that things could have names.\n The Consu came to the moon to explore and they did, noting all the things about the moon, from the air in its sky to the shape of its lands and waters to the shape and manner of all the life that lived in the moon\u0027s land, air and water. And when they came to these certain creatures who lived on this moon, the Consu became curious about them and how they lived their lives, and studied them and how they were born and lived and died.\n After the Consu had watched the creatures for some time the Consu decided that they would change the creatures, and would give them something that the Consu possessed and that the creatures did not, which was intelligence. And the Consu took the genes of the creatures and changed them so that their brains, as they grew, would develop intelligence well beyond what the creatures would themselves achieve through experience or through many years of evolution. The Consu made these changes to a few creatures and then set them back on the moon and over many generations all the creatures became intelligent.\n Once the Consu gave intelligence to the creatures they did not stay on the moon, nor shared themselves with the creatures, but departed and left machines above the sky, which the creatures would not see, to watch the creatures. And so the creatures for a very long time did not learn of the Consu and what they had done to the creatures.\n And for a very long time these creatures who now had intelligence grew in number and learned many things. They learned how to make tools and create a language and work together for common goals and to farm the land and mine metals and create science. But although the creatures thrived and learned, they did not know that they among all intelligent creatures were unique, because they did not know there were other intelligent creatures.\n One day, after the creatures had gained intelligence, another race of intelligent people came to visit the moon, the first since the Consu, although the creatures did not remember the Consu. And these new people called themselves the Arza and each of the Arza also had a name. And the Arza were amazed that the creatures on the moon, who were intelligent and who had built tools and cities, did not have a name and did not have names for each of their number.\n And it was then the creatures discovered through the Arza what made them unique: They were the only people in all the universe who were not conscious. Although every creature could think and reason, it could not know itself as every other intelligent creature could know itself. The creatures lacked awareness of who they were as individuals, even as they lived and thrived and grew on the face of the moon of the planet.\n When the creatures learned this, and although no individual could know it felt this, there grew within the race of these creatures a hunger for that thing they did not have: for the consciousness that the creatures knew collectively they did not have as individuals. And this is when the creatures first gave themselves a name, and called themselves \"Obin,\" which in their language meant \"The ones who lack,\" although it might be better translated as \"The deprived ones\" or \"The ones without gifts,\" and although they named their race they did not give names to each of their individual number.\n And the Arza took pity on the creatures who now called themselves Obin, and revealed to them the machines that floated in the sky and that were put there by the Consu, who they knew to be a race of immense intelligence and unknowable aims. The Arza studied the Obin and discovered that their biology was unnatural, and so the Obin learned who had created them.\n And the Obin asked the Arza to take them to the Consu, so they could ask why the Consu had done these things, but the Arza refused, saying the Consu met only with other races to fight them, and they feared what would happen to the Arza if they brought the Obin before the Consu.\n So it was the Obin determined they must learn to fight. And while the Obin did not fight the Arza, who had been kind to the Obin and took pity on them and then left the Obin in peace, there came another race of creatures called the Belestier, who planned to colonize the moon on which the Obin lived and kill all the Obin because they would not live in peace with them. The Obin struggled with the Belestier, killing all those who landed on their moon, and in doing so found they had an advantage; because the Obin did not know themselves, they were not afraid of death, and had no fear where others had fear in abundance.\n The Obin killed the Belestier, and learned from their weapons and technology. In time the Obin left their own moon to colonize other moons and grow their numbers and make war on other races when those other races chose to make war on the Obin.\n And there came a day, after many years, when the Obin decided they were ready to meet the Consu, and found where they lived and set out to meet them. Although the Obin were strong and determined, they did not know the power of the Consu, who brushed them aside, killing any Obin who dared to call or attack, and there were many thousands of these.\n Eventually the Consu became curious about the creatures they had made and offered to answer three questions for the Obin, if half the Obin everywhere would offer themselves up as a sacrifice to the Consu. And this was a hard bargain, because although no individual Obin would know its own death, such a sacrifice would wound the race, because by this time it had made many enemies among the intelligent races, and they would most certainly attack the Obin when they were weak. But the Obin had a hunger and needed answers. So one half of the Obin willingly offered themselves to the Consu, killing themselves in all manner of ways, wherever they were.\n And the Consu were satisfied and answered our three questions. Yes, they had given the Obin intelligence. Yes, they could have given the Obin consciousness but did not, because they wanted to see what consciousless intelligence was like. No, they would not now give us consciousness, nor would they ever, nor would they allow us to ask again. And since that day the Consu have not allowed the Obin to speak to them again; each embassy to them since that day has been killed.\n The Obin spent many years fighting many races as it returned itself to its former strength, and in time it became known to other races that to fight with the Obin meant death, for the Obin would not relent or show mercy or pity or fear, because the Obin did not know these things themselves. And for a long time this was the way of things.\n One day a race known as the Rraey attacked a human colony and its space station, killing all the humans they could. But before the Rraey could complete their task, the Obin attacked them, because the Obin wanted the colony world for themselves. The Rraey were weakened after their first attack and were defeated and killed. The Obin took the colony and its space station, and because the space station was known as a scientific outpost, the Obin looked through its records to see what useful technology they could take.\n It was then that the Obin discovered that one of the human scientists, who was named Charles Boutin, was working on a way to hold and store consciousness outside of the human body, in a machine based on technology the humans had stolen from the Consu. The work was not done, and the technology was not something the Obin at the space station could follow, nor the Obin scientists whom they had brought along. The Obin looked for Charles Boutin among the human survivors of the space station attacks, but he was not to be found, and it was discovered that he was away from the station when it was attacked.\n But then the Obin learned that Charles Boutin\u0027s daughter Zoe had been on the space station. The Obin took her from the station and she alone was spared among the humans. And the Obin kept her and kept her safe and found a way to tell Charles Boutin that she was alive and offered to return her if he would give the Obin consciousness. But Charles Boutin was angry, not at the Obin but at the humans who he thought had let his daughter die, and demanded in exchange for giving the Obin consciousness, that the Obin would make war on the humans, and defeat them. The Obin could not do this themselves but allied with two other races, the Rraey, whom they had just attacked, and the Enesha, who were allies of the humans, to make war on the humans.\n Charles Boutin was satisfied and in time joined the Obin and his daughter, and worked to create consciousness for the Obin. Before he could finish his task, the humans learned of the alliance between the Obin and the Rraey and the Enesha, and attacked. The alliance was broken and the Enesha were made to war on the Rraey by the humans. And Charles Boutin was killed and his daughter Zoe was taken from the Obin by the humans. And although no individual Obin could sense it, the entire nation despaired because in agreeing to give them consciousness Charles Boutin was their friend among all friends, who would do for them what even the great Consu would not: give them awareness of themselves. When he died, their hope for themselves died. To lose his daughter, who was of him and who was dear to them because of him, compounded this despair.\n And then the humans sent a message to the Obin that they knew of Boutin\u0027s work and offered to continue it, in exchange for an alliance and the agreement by the Obin to war on the Enesha, who had allied with the Obin against the humans, once the Enesha had defeated the Rraey. The Obin agreed to this but added the condition that once the Obin were given consciousness that two of their number would be allowed to know Zoe Boutin, and to share that knowledge with all other Obin, because she was what remained of Charles Boutin, their friend and their hero.\n And so it was that the Obin and the humans became allies, the Obin attacked and defeated the Enesha in due time, and the Obin, thousands of generations after their creation, were given consciousness by Charles Boutin. And among their number, the Obin selected two, who would become companions and protectors to Zoe Boutin and share her life with her new family. And when Zoe met them she was not afraid because she had lived with the Obin before, and she gave the two of them names: Hickory and Dickory. And the two of them became the first Obin to have names. And they were glad, and they know they are glad, because of the gift Charles Boutin gave them and all Obin.\n And they lived happily ever after.\n Hickory said something to me I didn\u0027t hear. \"What?\" I said.\n \"We are not sure \u0027and they lived happily ever after\u0027 is the appropriate ending,\" said Hickory, and then stopped and looked closely at me. \"You are crying,\" it said.\n \"I\u0027m sorry,\" I said. \"I was remembering. The parts of it I was in.\"\n \"We told them wrong,\" Hickory said.\n \"No,\" I said, and put up my hand to reassure it. \"You didn\u0027t tell it wrong, Hickory. It\u0027s just the way you tell it and the way I remember it are a little...\" I wiped a tear off my face and searched for the right word. \"They\u0027re just a little different, is all.\"\n \"You do not like the myth,\" Hickory said.\n \"I like it,\" I said. \"I like it very much. It\u0027s just some things hurt me to remember. It happens that way for us sometimes.\"\n \"I am sorry, Zoe, for causing you distress,\" Hickory said, and I could hear the sadness in its voice. \"We wanted to cheer you up.\"\n I got up from my seat and went over to Hickory and Dickory and hugged them both. \"I know you did,\" I said. \"And I\u0027m really glad you tried.\" \n","sourceLink":"https://allnovel.net/zoe-s-tale-old-man-s-war-4/page-8.html","bookId":1561,"book":{"id":1561,"title":"Zoe\u0027s Tale (Old Man\u0027s War #4)","description":"Storyline: \n How do you tell your part in the biggest tale in history? I ask because it\u0027s what I have to do. I\u0027m Zoe Boutin Perry: A colonist stranded on a deadly pioneer world. Holy icon to a race of aliens. A player (and a pawn) in a interstellar chess match to save humanity, or to see it fall. Witness to history. Friend. Daughter. Human. Seventeen years old. Everyone on Earth knows the tale I am part of. But you don\u0027t know my tale: How I did what I did - how I did what I had to do - not just to stay alive but to keep you alive, too. All of you. I\u0027m going to tell it to you now, the only way I know how: not straight but true, the whole thing, to try make you feel what I felt: the joy and terror and uncertainty, panic and wonder, despair and hope. Everything that happened, bringing us to Earth, and Earth out of its captivity. All through my eyes. It\u0027s a story you know. But you don\u0027t know it all.\n \n","cover":"https://allnovel.net/images/zoe-s-tale-old-man-s-war-4.jpg","author":"John Scalzi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/zoe-s-tale-old-man-s-war-4.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:35:31 PM"}}
