{"id":112083,"no":11,"title":"Page 11","content":"\u0027I can\u0027t do this,\u0027 Paul said suddenly. It was the first time that either he or Donna had spoken for more than an hour. \u0027Can\u0027t do what?\u0027 \u0027Stay here like this. I can\u0027t handle it. I can\u0027t just sit here knowing they\u0027re out there waiting...\u0027 \u0027Well you\u0027re going to have to handle it, aren\u0027t you? There\u0027s not a lot else we can do.\u0027 Still crouching in the training room where they\u0027d hidden since the incident hours earlier, the two survivors knew that there were still bodies out on the landing. Occasionally Donna plucked up the courage to peer out through the window, immediately moving out of sight again at the faintest sign of activity in the corridor outside. She had spent the last hours trying to work out why the creatures were there at all. Had they been trapped by the heavy landing doors swinging shut, or had they made a conscious decision to wait there for the survivors to emerge again? Were they even capable of conscious decision making? It was impossible to tell. Assuming that it had been sound that first attracted them to the tenth floor, Donna had come to the conclusion that it had been a domino effect of sorts that had drawn others to the scene. It seemed logical that the noise made by the first body trying to force its way inside had attracted another which in turn had attracted another and another and so on... \u0027So what are we going to do?\u0027 Paul moaned. Christ, he really was beginning to irritate Donna now. \u0027Jesus,\u0027 she sighed, \u0027I don\u0027t know.\u0027 \u0027We can\u0027t sit here forever, can we?\u0027 \u0027But what are we going to gain from leaving?\u0027 \u0027We\u0027re ten floors up here. The only way out is to go down the staircase and if any more of those things appear then we\u0027re going to have a hell of a job trying to get through them when we need to get out, aren\u0027t we?\u0027 He was right. She didn\u0027t bother to acknowledge him but she had to admit that he was right. Much as she wanted to stay hidden in the office, she knew that if she followed her earlier line of thinking through, then more and more of the bodies could be attracted to the scene until it became impossible for the two of them to get away. Her options looked decidedly bleak; take her chances with the diseased population or sit here and wait endlessly with this whinging mouse of a man. For a few seconds she sat and weighed up the odds before deciding it was time to move. \u0027All right then,\u0027 she said, \u0027let\u0027s do it. We\u0027ll try and find somewhere safer, if anywhere\u0027s going to be any safer, that is.\u0027 She watched Paul\u0027s face. He looked terrified. Although he had been the one who had suggested they leave, it was obvious that the grim reality of his suggestion was only just beginning to sink in. \u0027But how?\u0027 he stammered. \u0027How are we going to get past them. We don\u0027t know how many of them are...\u0027 Donna thought for a moment. \u0027Distract them,\u0027 she said eventually. \u0027There are doors at either end of the landing, aren\u0027t there? We\u0027ll draw them towards one end of the office and then get out through the other.\u0027 Paul looked into space, thinking carefully. The expression on his face slowly began to change and Donna started to wonder whether she\u0027d been hasty in her judgment of him. He had listened and he suddenly looked ready to overcome his obvious nervousness and take what was left of his life in his hands to leave the relative safety of the office. \u0027Okay,\u0027 he said quietly, his voice a little more positive and purposeful than it had been all morning, \u0027so where do we go once we\u0027re out there?\u0027 \u0027Don\u0027t know. From what I can see we can pretty much take our pick of the entire city, maybe even the country.\u0027 \u0027We could find ourselves a car and try and get away...\u0027 Donna shook her head. \u0027I don\u0027t think that\u0027s a good idea. If those things outside are able to hear us now, all we\u0027d be doing is drawing more attention to ourselves. What we need is to find somewhere secure like this place, but with more than one way out.\u0027 \u0027There must be hundreds of places like that round here. This is a city centre for God\u0027s sake.\u0027 \u0027There\u0027s the main police station round the corner for a start. Then there\u0027s the hospital, the university, shops, pubs...\u0027 \u0027If we could find somewhere with food supplies and drinks...\u0027 \u0027Christ, I could murder a drink...\u0027 \u0027Or beds? What about finding somewhere with real beds? Bloody hell, a decent-sized house would do, wouldn\u0027t it?\u0027 \u0027There aren\u0027t many houses round here,\u0027 Donna said, suddenly feeling a fraction more positive about their situation. \u0027But you\u0027re right, when we\u0027re ready we could head out into the suburbs, maybe even further?\u0027 Paul stopped to think again. \u0027There\u0027s one thing that we\u0027re not taking into consideration here,\u0027 he sighed. \u0027What\u0027s that?\u0027 \u0027The bodies. We both saw what that one tried to do to you. As soon as we go outside we\u0027ll be...\u0027 \u0027I still don\u0027t think that body tried to do anything to me,\u0027 she interrupted, \u0027it just reacted to me being there. I think if I\u0027d stood still and stayed quiet it would have walked straight past.\u0027 \u0027I\u0027m not sure...\u0027 \u0027They don\u0027t seem to be attacking each other, do they?\u0027 \u0027I don\u0027t know. I haven\u0027t seen enough to be able to say...\u0027 \u0027Look, assuming their senses are gradually returning, how would they know that we\u0027re not like the rest of them if we played dead? We\u0027re stronger and we look in better condition than they do, but after everything that\u0027s happened to them are they really going to be able to tell?\u0027 Paul shrugged his shoulders. \u0027I don\u0027t know. Can we afford to take a chance like that?\u0027 \u0027Can we afford not to? You\u0027re right, Paul, we could be trapped in here. There might be thousands of those things here in just a few hours, there might even be that many out there now. We don\u0027t have an option.\u0027 \u0027When then? Now?\u0027 \u0027Tonight.\u0027 \u0027Why wait?\u0027 \u0027If we\u0027re relying on the fact that their senses are poor, then why not wait a little longer until it\u0027s dark outside? If they can\u0027t see us properly in daylight, what chance have they got at night?\u0027","sourceLink":"https://allnovel.net/autumn-the-city-autumn-2/page-11.html","bookId":2558,"book":{"id":2558,"title":"Autumn: The City (Autumn #2)","description":"Storyline: Autumn: The City (Autumn #2) A bastard hybrid of War of the Worlds and Night of the Living Dead, the Autumn series chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... While the first Autumn novel focused on those who escaped the city, Autumn: The City focuses on those who didn\u0027t. Without ever using the \u0027Z\u0027 word, the Autumn series offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.","cover":"https://allnovel.net/images/autumn-the-city-autumn-2.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-the-city-autumn-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:51:14 AM"}}
