{"id":112101,"no":30,"title":"Page 30","content":"Ignorant to the potential dangers of being out alone, and with a sense of smug satisfaction warming him against the cold late autumn wind, Michael stood on top of a bleak hillside and watched as another truck full of soldiers clattered down the overgrown track back, he presumed, towards their base. He\u0027d found the track again earlier and had followed it as far as he\u0027d dared to go on foot before heading back to the relative safety of the motorhome. He and Emma had then driven to the point where he\u0027d stopped walking. Michael sensed that they were near to finding the base and the return now of more troops in their transport was proof that they were close.\n Feeling more positive than he had been for days he turned around and put his thumbs up as a salute to what felt like a small but significant victory. The afternoon light was fading and cold rain was beginning to spit down. From the comparative warmth and comfort of the motorhome a short distance away Emma watched and waved back, acknowledging his achievement. Before turning and going back inside, Michael looked down at the track for a little longer. There was a body walking along it now.\n A single pathetic, rotting, disease-ridden cadaver that pointlessly dragged itself along after the long gone transport. Even now after so many days and weeks had passed Michael found it hard to accept what had happened. He watched the lone figure with equal amounts of fear, hatred, pity and pain. Although they had intentionally stayed as far away from the rest of the remains of the world as possible, coming into contact with the corpses was inevitable. As they had earlier watched the behaviour of the creatures change from the shelter of their farmhouse hideout, so they had since seen that change continue unabated. Whereas originally these reanimated bodies had been empty shells, now emotion, control and direction was undeniably beginning to return.\n It was almost as if their brains had been anaesthetised by the disease and the numbness was gradually fading. Originally hollow and unfeeling, the bodies now seemed to be gaining a purpose. First the ability to interpret and respond to basic stimuli had returned, then something resembling base emotion - the need to protect themselves and find an answer to their pain perhaps? More recently Michael had sensed a vicious inquizitiveness about the bodies which was quickly mutating into anger and hate.\n It was cold. The wind, rain and low temperature reminded him that he wasn\u0027t safe. He ran to the motorhome. \u0027Well?\u0027 Emma asked as he let himself inside and closed, locked, barred and blacked-out the door behind him. \u0027More of them,\u0027 he answered, quietly and breathlessly. \u0027We\u0027re close, aren\u0027t we?\u0027 He nodded and wiped the rain from his face and hair. \u0027We must be.\u0027 A moment of silence followed. Michael took off his wet outdoor jacket and kicked off his muddy boots. Now that he was safely indoors Emma busied herself with what had become a nightly ritual - covering every window, vent and door with wooden boards and heavy black material.\n They knew that even the smallest pinprick of escaping light might be enough to attract the bodies. Emma didn\u0027t mind the gloom. It helped her to forget the cramped and squalid conditions that they found themselves living in. \u0027Tomorrow morning we should try and get closer again,\u0027 Michael whispered as he sat down opposite Emma at the small table. \u0027It doesn\u0027t matter how long it takes, does it? We\u0027ll take things one step at a time. I\u0027ll walk a little further down the track then we\u0027ll drive the van down when we know what\u0027s there.\u0027 \u0027Are you sure this is the right thing to do?\u0027 \u0027Of course it is, why?\u0027 Michael was surprised by her comment. \u0027Because this is the army we\u0027re dealing with here,\u0027 she explained. \u0027Do you think we\u0027re going to be welcome? They might not have come across any survivors yet. And look at the state of us. They\u0027ll probably think that we\u0027re dead and that we\u0027ve just...\u0027\n \u0027Do you really believe that?\u0027 he interrupted. He sighed and shook his head and looked down at the table. \u0027I don\u0027t know,\u0027 she stammered, unsure. \u0027We\u0027re the odd ones out around here, aren\u0027t we? They\u0027re not going to be expecting...\u0027 \u0027They\u0027re not going to be expecting fucking corpses to turn up in a camper van, are they?\u0027 \u0027No, but...\u0027 \u0027But what? They\u0027ll see the van, they\u0027ll see us and we\u0027ll be okay.\u0027 \u0027What if they see you when you\u0027re walking?\u0027 He shrugged his shoulders. \u0027Sounds like you\u0027re just trying to find reasons not to do this.\u0027 \u0027Come on, that\u0027s not fair. I\u0027m just worried that this won\u0027t work out.\u0027\n \u0027It\u0027ll work out.\u0027 \u0027There are a hundred reasons why it might not. Christ, you told me they were wearing suits. They can\u0027t even walk out in the open. They can\u0027t breathe the air because it\u0027ll do to them what it did to the rest of the population.\u0027 \u0027Yes, and that\u0027s our get out, isn\u0027t it?\u0027 \u0027What do you mean?\u0027 \u0027If things don\u0027t work out the way we want, we\u0027ll walk.\u0027 \u0027You think they\u0027ll let us?\u0027 \u0027You think they\u0027ll have a choice?\u0027 \u0027I\u0027m sorry,\u0027 Emma sighed, holding her head in her hands.\n \u0027I\u0027m not trying to be negative. I just think we need to play this whole situation very carefully.\u0027 She knew that she was going to have trouble trying to contain Michael\u0027s eagerness and excitement. She knew where he was coming from, but his cavalier approach and lack of concern worried her. They both knew what the risks were. They had already lost just about everything they had. At the farmhouse they had fought to build themselves some kind of shelter and protection from the rest of the world, and despite their huge physical and mental advantage over the countless scores of plague victims they had lost it all in the blinking of an eye.\n One mistake was all that it had taken. And although sitting in a cold motorhome in the middle of a field was far from ideal, at least they now had some degree of control again. Emma had an unsettling feeling in the pit of her stomach that they were dangerously close to losing that control.\n Every night felt like an eternity. The dark hours dragged endlessly. With no distractions or entertainment it was all that Michael and Emma could do not to dwell on the problems outside their door. Occasionally the situation became slightly lighter and more bearable.\n Most of the time, however, the musty atmosphere in the cramped motorhome was tense and overbearing. Conversation had continued to be sparse and difficult throughout the evening. As the couple had discovered on many occasions recently, there was very little they could talk about that didn\u0027t somehow lead them back to discussing everything that they had been doing their best to forget about and ignore. Going to bed sometimes brought temporarily relief, but much of the time it was of little help.\n The survivors would either lie there, unable to sleep, or they would manage to lose consciousness only to be jolted back into their bizarre reality by a dark nightmare or a sudden noise from the other side of the motorhome\u0027s paper-thin metal walls. The only true comfort that Michael had found in the days and nights since his life had been turned upside down was Emma. As they lay in bed together, holding each other tightly, keeping each other warm, he relaxed in the comfort of her closeness. He loved the sound of her voice whispering in his ear late at night, and the gentle tickle of her breath on the side of his face somehow managed to remind him that, no matter how it often felt, he was still very much alive.\n The smell of her, the feel of her body against his, the warmth that she brought to the long, cold nights, all helped reassure him that the effort of survival had been worthwhile and that, despite the considerable odds stacked against them both, there remained a faint glimmer of hope that their situation would eventually improve. He clung to the thought that, one day, the two of them might be free to walk out in the open again without fear.\n He knew that it might happen someday. The rotting bodies were deteriorating and couldn\u0027t continue to function indefinitely, could they? It was twenty past two in the morning. The wind was buffeting the side of the motorhome, rain was driving down and crashing onto the metal roof above them and they could hear a solitary body tripping and sliding randomly through the mud outside. It didn\u0027t seem to matter. For a few precious moments none of it seemed to matter to Michael. He was close to Emma and, for a couple of relaxing, refreshing and unexpected minutes he was somehow able to forget the hell outside.\n","sourceLink":"https://allnovel.net/autumn-the-city-autumn-2/page-30.html","bookId":2558,"book":{"id":2558,"title":"Autumn: The City (Autumn #2)","description":"Storyline: \n Autumn: The City (Autumn #2) \n A bastard hybrid of War of the Worlds and Night of the Living Dead, the Autumn series chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... \n While the first Autumn novel focused on those who escaped the city, Autumn: The City focuses on those who didn\u0027t. \n Without ever using the \u0027Z\u0027 word, the Autumn series offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.\n \n","cover":"https://allnovel.net/images/autumn-the-city-autumn-2.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-the-city-autumn-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:51:14 AM"}}
