{"id":112106,"no":35,"title":"Page 35","content":"\u0027What you doing out here?\u0027 Donna turned round and saw that Nathan Holmes was standing behind her. She was sitting on a wooden bench in a small enclosed courtyard just to the side of the assembly hall. She often sat there to think and be alone, and after the long conversations of the last few hours she craved a change of surroundings. The three meter square area of concrete buried between university buildings was as close as she could safely get to being outside.\\n\\n She didn\u0027t want anyone\u0027s company, least of all Holmes. She turned her back on him. Unperturbed, he sat down next to her. \u0027What do you want?\u0027 she sighed. \u0027Nothing,\u0027 he answered.\\n\\n \u0027Just thought I\u0027d come and talk to you, that\u0027s all.\u0027 \u0027Why would you want to do that? It\u0027s three o\u0027clock in the morning for Christs\u0027 sake.\u0027 He shrugged his shoulders and lit a cigarette. \u0027Don\u0027t know,\u0027 he replied, leaning back and looking up at a patch of dark and cloudy sky between the tall buildings which stretched up around them. \u0027I haven\u0027t got anything to say to you anyway,\u0027 she mumbled. \u0027You had plenty to say earlier.\u0027\\n\\n \u0027You asked for it. You\u0027re a fucking arsehole.\u0027 Holmes shook his head in mock disapproval. \u0027Don\u0027t know why you\u0027ve got it in for me,\u0027 he grinned. \u0027Just because I stand up for myself and don\u0027t want to risk...\u0027\\n\\n \u0027Your fucking problem,\u0027 Donna hissed, standing up and moving away from Holmes, \u0027is that you don\u0027t think about anyone but yourself. And worse than that, all the things you say and the decisions you make are based on fear. You\u0027re too damn frightened to even think straight.\u0027 \u0027You don\u0027t know what you\u0027re talking about,\u0027 he snarled. The tone in his voice had suddenly changed. He sounded angry and yet also strangely defensive. Donna had obviously touched a nerve.\\n\\n \u0027You haven\u0027t got a bloody clue what you\u0027re talking about.\u0027\\n\\n \u0027Let\u0027s be honest,\u0027 she continued, \u0027the only reason why you\u0027ve been making such a noise about staying here is that you\u0027re too scared to leave. You can\u0027t face the prospect of...\u0027 \u0027Bullshit,\u0027 he snapped. \u0027Are you serious? The reason I\u0027m staying here is...\u0027 \u0027The reason you\u0027re staying here is because you haven\u0027t got the balls to step outside.\u0027 \u0027I don\u0027t want to be attacked by a thousand bloody dead bodies, that\u0027s why I\u0027m not moving,\u0027 he protested. \u0027Rubbish.\u0027 \u0027You take a single step outside and they\u0027ll swallow you up. There are fucking thousands of them.\u0027 \u0027So what would you do if they get inside?\u0027 \u0027They won\u0027t.\u0027 \u0027They might. They probably will at some point.\u0027\\n\\n \u0027I\u0027ll deal with that when it happens. I tell you now, I\u0027m not going out there to risk my neck unless I\u0027ve got no other option.\u0027 \u0027You haven\u0027t got any other options.\u0027 \u0027I\u0027ll decide when I\u0027m going to make my move.\u0027 \u0027You\u0027ll never do it. You\u0027re a bloody coward. You\u0027re just going to sit here and rot...\u0027 \u0027You shut your fucking mouth or I\u0027ll...\u0027 \u0027You\u0027ll do what? Come on, big man, what exactly are you going to do? You\u0027ll still be sat in here when the rest of us leave. You\u0027ll die in this fucking place.\u0027 Holmes jumped up from the bench and lurched towards Donna. She stumbled backwards towards the door which led to the assembly hall and collided with Phil Croft.\\n\\n He\u0027d been standing in the doorway for the best part of a minute. \u0027Everything okay?\u0027 he asked, grabbing hold of Donna\u0027s shoulders. She steadied herself and turned and pushed her way past him. \u0027Fine,\u0027 she mumbled as she disappeared into the darkness. Holmes and the doctor exchanged glances before Croft turned and followed Donna back into the building.\\n\\n","sourceLink":"https://allnovel.net/autumn-the-city-autumn-2/page-35.html","bookId":2558,"book":{"id":2558,"title":"Autumn: The City (Autumn #2)","description":"Storyline: Autumn: The City (Autumn #2) \\n A bastard hybrid of War of the Worlds and Night of the Living Dead, the Autumn series chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... \\n While the first Autumn novel focused on those who escaped the city, Autumn: The City focuses on those who didn\u0027t. \\n Without ever using the \u0027Z\u0027 word, the Autumn series offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.\\n","cover":"https://allnovel.net/images/autumn-the-city-autumn-2.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-the-city-autumn-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:51:14 AM"}}
