{"id":34211,"no":39,"title":"Chapter 5","content":"In half an hour Vivian was at Mr. Cleveland’s door. \n \n “My master is at the Marquess of Carabas’, sir; he will not return, but is going immediately to Richmond, where Mrs. Cleveland is staying.” \n \n Vivian immediately wrote to Mr. Cleveland. “If your master have left the Marquess’, let this be forwarded to him at Richmond immediately.” \n \n “CLEVELAND! \n \n “You know all. It would be mockery were I to say that at this moment I am not thinking of myself. I am a ruined man in body and in mind. But my own misery is nothing; I can die, I can go mad, and who will be harmed? But you! I had wished that we should never meet again; but my hand refuses to trace the thoughts with which my heart is full, and I am under the sad necessity of requesting you to see me once more. We have been betrayed, and by a woman; but there has been revenge. Oh, what revenge! \n \n “VIVIAN GREY.” \n \n When Vivian left Mr. Cleveland’s he actually did not know what to do with himself. Home, at present, he could not face, and so he continued to wander about, quite unconscious of locality. He passed in his progress many of his acquaintance, who, from his distracted air and rapid pace, imagined that he was intent on some important business. At length he found himself in one of the most sequestered parts of Kensington Gardens. It was a cold, frosty day, and as Vivian flung himself upon one of the summer seats the snow drifted from off the frozen board; but Vivian’s brow was as burning hot as if he had been an inhabitant of Sirius. Throwing his arms on a small garden table, he buried his face in his hands and wept as men can but once weep in this world. \n \n O, thou sublime and most subtle philosopher, who, in thy lamp-lit cell, art speculating upon the passions which thou hast never felt! O, thou splendid and most admirable poet, who, with cunning words, art painting with a smile a tale of woe! tell me what is Grief, and solve me the mystery of Sorrow. \n \n Not for himself, for after the first pang he would have whistled off his high hopes with the spirit of a Ripperda; not even for Cleveland, for at this moment, it must be confessed, his thoughts were not for his friend, did Vivian Grey’s soul struggle as if it were about to leave its fleshy chamber. We said he wept as men can weep but once in this world, and yet it would have been impossible for him to have defined what, at that fearful moment, was the cause of his heart’s sorrow. Incidents of childhood of the most trivial nature, and until this moment forgotten, flashed across his memory; he gazed on the smile of his mother, he listened to the sweet tones of his father’s voice, and his hand clenched, with still more agonised grasp, his rude resting-place, and the scalding tears dashed down his cheek in still more ardent torrents. He had no distinct remembrance of what had so lately happened; but characters flitted before him as in a theatre, in a dream, dim and shadowy, yet full of mysterious and undefinable interest; and then there came a horrible idea across his mind that his glittering youth was gone and wasted; and then there was a dark whisper of treachery, and dissimulation, and dishonour; and then he sobbed as if his very heart were cracking. All his boasted philosophy vanished; his artificial feelings fled him. Insulted Nature reasserted her long-spurned authority, and the once proud Vivian Grey felt too humble even to curse himself. Gradually his sobs became less convulsed and his brow more cool; and, calm from very exhaustion, he sat for upwards of an hour motionless. \n \n At this moment there issued, with their attendant, from an adjoining shrubbery, two beautiful children. They were so exceedingly lovely that the passenger would have stopped to gaze upon them. The eldest, who yet was very young, was leading his sister hand in hand with slow and graceful steps, mimicking the courtesy of men. But when his eye caught Vivian’s the boy uttered a loud cry of exultation, and rushed, with the eagerness of infantile affection, to his gentle and favourite playmate. They were the young Clevelands. With what miraculous quickness will man shake off the outward semblance of grief when his sorrow is a secret! The mighty merchant, who knows that in four-and-twenty hours the world must be astounded by his insolvency, will walk in the front of his confident creditor as if he were the lord of a thousand argosies; the meditating suicide will smile on the arm of a companion as if to breathe in this sunny world were the most ravishing and rapturous bliss. We cling to our stations in our fellow-creatures’ minds and memories; we know too well the frail tenure on which we are in this world great and considered personages. Experience makes us shrink from the specious sneer of sympathy; and when we are ourselves falling, bitter Memory whispers that we have ourselves been neglectful. \n \n And so it was that even unto these infants Vivian Grey dared not appear other than a gay and easy-hearted man; and in a moment he was dancing them on his knee, and playing with their curls, and joining in their pretty prattle, and pressing their small and fragrant lips. \n \n It was night when he paced down — . He passed his club; that club to become a member of which had once been the object of his high ambition, and to gain which privilege had cost such hours of canvassing, such interference of noble friends, and the incurring of favours from so many people, “which never could be forgotten!” \n \n A desperate feeling actuated him, and he entered the Club-house. He walked into the great saloon and met some fifty “most particular friends,” all of whom asked him “how the Marquess did,” or “have you seen Cleveland?” and a thousand other as comfortable queries. At length, to avoid these disagreeable rencontres, and indeed to rest himself, he went to a smaller and more private room. As he opened the door his eyes lighted upon Cleveland. \n \n He was standing with his back to the fire. There were only two other persons in the room; one was a friend of Cleveland’s, and the other an acquaintance of Vivian’s. The latter was writing at the table. \n \n When Vivian saw Cleveland he would have retired, but he was bid to “come in” in a voice of thunder. \n \n As he entered he instantly perceived that Cleveland was under the influence of wine. When in this situation, unlike other men, Mr. Cleveland’s conduct was not distinguished by any of the little improprieties of behaviour by which a man is always known by his friends “to be very drunk.” He neither reeled, nor hiccuped, nor grew maudlin. The effect of drinking upon him was only to increase the intensity of the sensation by which his mind was at the moment influenced. He did not even lose the consciousness of identity of persons. At this moment it was clear to Vivian that Cleveland was under the influence of the extremest passion; his eyes rolled wildly, and seemed fixed only upon vacancy. As Vivian was no friend to scenes before strangers he bowed to the two gentlemen and saluted Cleveland with his wonted cordiality; but his proffered hand was rudely repelled. \n \n “Away!” exclaimed Cleveland, in a furious tone; “I have no friendship for traitors.” \n \n The two gentlemen stared, and the pen of the writer stopped. \n \n “Cleveland!” said Vivian, in an earnest whisper, as he came up close to him; “for God’s sake contain yourself. I have written you a letter which explains all; but — ” \n \n “Out! out upon you. Out upon your honied words and your soft phrases! I have been their dupe too long;” and he struck Vivian. \n \n “Sir John Poynings!” said Vivian, with a quivering lip, turning to the gentleman who was writing at the table, “we were school-fellows; circumstances have prevented us from meeting often in after-life; but I now ask you, with the frankness of an old acquaintance, to do me the sad service of accompanying me in this quarrel, a quarrel which I call Heaven to witness is not of my seeking.” \n \n The Baronet, who was in the Guards, and although a great dandy, quite a man of business in these matters, immediately rose from his seat and led Vivian to a corner of the room. After some whispering he turned round to Mr. Cleveland, and bowed to him with a very significant look. It was evident that Cleveland comprehended his meaning, for, though he was silent, he immediately pointed to the other gentleman, his friend, Mr. Castleton. \n \n “Mr. Castleton,” said Sir John, giving his card, “Mr. Grey will accompany me to my rooms in Pall Mall; it is now ten o’clock; we shall wait two hours, in which time I hope to hear from you. I leave time, and place, and terms to yourself. I only wish it to be understood that it is the particular desire of my principal that the meeting should be as speedy as possible.” \n \n About eleven o’clock the communication from Mr. Castleton arrived. It was quite evident that Cleveland was sobered, for in one instance Vivian observed that the style was corrected by his own hand. The hour was eight the next morning, at —— Common, about six miles from town. \n \n Poynings wrote to a professional friend to be on the ground at half-past seven, and then he and Vivian retired. \n \n Did you ever fight a duel? No? nor send a challenge either? Well! you are fresh, indeed! ’Tis an awkward business, after all, even for the boldest. After an immense deal of negotiation, and giving your opponent every opportunity of coming to an honourable understanding, the fatal letter is at length signed, sealed, and sent. You pass your mornings at your second’s apartments, pacing his drawing-room with a quivering lip and uncertain step. At length he enters with an answer; and while be reads you endeavour to look easy, with a countenance merry with the most melancholy smile. You have no appetite for dinner, but you are too brave not to appear at table; and you are called out after the second glass by the arrival of your solicitor, who comes to alter your will. You pass a restless night, and rise in the morning as bilious as a Bengal general. Urged by impending fate, you make a desperate effort to accommodate matters; but in the contest between your pride and your terror you at the same time prove that you are a coward and fail in the negotiation. You both fire and miss, and then the seconds interfere, and then you shake hands: everything being arranged in the most honourable manner and to the mutual satisfaction of both parties. The next day you are seen pacing Bond Street with an erect front and a flashing eye, with an air at once dandyish and heroical, a mixture at the same time of Brummell and the Duke of Wellington. \n \n It was a fine February morning. Sir John drove Vivian to the ground in his cabriolet. \n \n “Nothing like a cab, Grey, for the business you are going on: you glide along the six miles in such style that it actually makes you quite courageous. I remember once going down, on a similar purpose, in a post and pair, and ‘pon my soul, when I came to the ground, my hand shook so that I could scarcely draw. But I was green then. Now, when I go in my cab, with Philidor with his sixteen-mile-an-hour paces, egad! I wing my man in a trice; and take all the parties home to Pall Mall, to celebrate the event with a grilled bone, Havannahs, and Regent’s punch. Ah! there! that is Cleveland that we have just passed, going to the ground in a chariot: he is a dead man, or my name is not Poynings.” \n \n “Come, Sir John; no fear of Cleveland’s dying,” said Vivian, with a smile. \n \n “What? You mean to fire in the air, and all that sort of thing? Sentimental, but slip-slop!” \n \n The ground is measured, all is arranged. Cleveland, a splendid shot, fired first. He grazed Vivian’s elbow. Vivian fired in the air. The seconds interfered. Cleveland was implacable, and, “in the most irregular manner,” as Sir John declared, insisted upon another shot. To the astonishment of all, he fired quite wild. Vivian shot at random, and his bullet pierced Cleveland’s heart. Cleveland sprang nearly two yards from the ground and then fell upon his back. In a moment Vivian was at the side of his fallen antagonist, but the dying man “made no sign;” he stared wildly, and then closed his eyes for ever! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1408/42283.html","bookId":1393,"book":{"id":1393,"title":"Vivian Grey","description":"简介： We are not aware that the infancy of Vivian Grey was distinguished by any extraordinary incident. The solicitude of the most affectionate of mothers and the care of the most attentive of nurses did their best to injure an excellent constitution....","cover":"http://novel.tingroom.com/file/upload/201510/26/09-11-11-43-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1408","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
