{"id":34219,"no":47,"title":"Chapter 7","content":"On the following morning, Vivian met with his friend Essper George, behind a small stall in the Bazaar. “Well, my Lord, what do you wish? Here are Eau de Cologne, violet soap, and watch-ribbons; a smelling bottle of Ems crystal; a snuff-box of fig-tree wood. Name your price: the least trifle that can be given by a man who breaks a bank must be more than my whole stock-in-trade is worth. “I have not paid you yet, Essper, for my glass chain. There is your share of my winnings, the fame of which, it seems, has reached even you!” added Vivian, with no pleased air. “I thank you, sir, for the Nap; but I hope I have not offended by alluding to a certain event, which shall be passed over in silence,” continued Essper George, with a look of mock solemnity. “I really think you have but a faint appetite for good fortune. They deserve her most who value her least.” “Have you any patrons at Ems, Essper, that have induced you to fix on this place in particular for your speculations? Here, I should think, you have many active rivals,” said Vivian, looking round the various stalls. “I have a patron here who has never deceived, and who will never desert me; I want no other; and that’s myself. Now here comes a party: could you just tell me the name of that tall lady now?” “If I tell you it is Lady Madeleine Trevor, what will it profit you?” Before Vivian could well finish his sentence Essper had drawn out a long horn from beneath his small counter, and sounded a blast which echoed through the arched passages. The attention of every one was excited, and no part of the following speech was lost:— “The celebrated Essper George, fresh from Fairyland, dealer in pomatum and all sorts of perfumery, watches, crosses, Ems crystal, coloured prints, Dutch toys, Dresden china, Venetian chains, Neapolitan coral, French crackers, chamois bracelets, tame poodles, and Cherokee corkscrews, mender of mandolins and all other musical instruments, to Lady Madeleine Trevor, has just arrived at Ems, where he only intends to stay two or three days, and a few more weeks besides. Now, gracious lady, what do you wish?” “And who,” said Lady Madeleine, smiling, “is this?” “The celebrated Essper George, just — ” again commenced the conjuror; but Vivian prevented the repetition. “He is an odd knave. Lady Madeleine, that I have met with before, at other places, I believe I may add an honest one. What say you, Essper?” “More honest than moonlight, gracious lady, for that deceives every one; and less honest than self-praise, for that deceives no one.” “My friend, you have a ready wit.” “My wit is like a bustling servant, gracious lady; always ready when not wanted, and never present at a pinch.” “Come, I must have a pair of your chamois bracelets. How sell you them?” “I sell nothing; all here is gratis to beauty, virtue, and nobility: and these are my only customers.” “Thanks will not supply a stock-in-trade though, Essper,” said Vivian. “Very true! but my customers are apt to leave some slight testimonies behind them of the obligations which they are under to me; and these, at the same time, are the prop of my estate and the proof of their discretion. But who comes here?” said Essper, drawing out his horn. The sight of this instrument reminded Lady Madeleine how greatly the effect of music is heightened by distance, and she made a speedy retreat, yielding her place to a family procession of a striking character. Three daughters abreast, flanked by two elder sons, formed the first file. The father, a portly, prosperous-looking man, followed, with his lady on his arm. Then came two nursery maids, with three children, between the tender ages of five and six. The second division of the grand army, consisting of three younger sons, immediately followed. This was commanded by a tutor. A governess and two young daughters then advanced; and then came the extreme rear, the sutlers of the camp, in the persons of two footmen in rich liveries, who each bore a basket on his arm, filled with various fancy articles, which had been all purchased during the promenade of this nation through only part of the bazaar. The trumpet of Essper George produced a due effect upon the great party. The commander-in-chief stopped at his little stall, and, as if this were the signal for general attack and plunder, the files were immediately broken up. Each individual dashed at his prey, and the only ones who struggled to maintain a semblance of discipline were the nursery maids, the tutor, and the governess, who experienced the greatest difficulty in suppressing the early taste which the detachment of light infantry indicated for booty. But Essper George was in his element: he joked, he assisted, he exhibited, he explained; tapped the cheeks of the children and complimented the elder ones; and finally, having parted at a prodigious profit, with nearly his whole, stock, paid himself out of a large and heavy purse, which the portly father, in his utter inability to comprehend the complicated accounts and the debased currency, with great frankness deposited in the hands of the master of the stall, desiring him to settle his own claims. “I hope I may be allowed to ask after Miss Fane,” said Vivian. “She continues better; we are now about to join her in the Limewalk. If you will join our morning stroll, it will give us much pleasure.” Nothing in the world could give Vivian greater pleasure; he felt himself impelled to the side of Lady Madeleine; and only regretted his acquaintance with the Baron because he felt conscious that there was some secret cause which prevented that intimacy from existing between his Excellency and the Trevor party which his talents and his position would otherwise have easily produced. “By-the-bye,” said Lady Madeleine, “I do not know whether I may be allowed to congratulate you upon your brilliant success at the Redoute last night. It is fortunate that all have not to regret your arrival at Ems so much as poor Mr. Hermann.” “The run was extraordinary. I am only sorry that the goddess should have showered her favours on one who neither deserves nor desires them; for I have no wish to be rich; and as I never lost by her caprices, it is hardly fair that I should gain by them.” “You do not play, then, much?” “I never played in my life till last night. Gambling has never been one of my follies, although my catalogue of errors is fuller, perhaps, than most men’s.” “I think Baron von Konigstein was your partner in the exploit?” “He was; and apparently as little pleased at the issue as myself.” “Indeed! Have you known the Baron long?” “We are only friends of a week. I have been living, ever since I was in Germany, a very retired life. A circumstance of a most painful nature drove me from England; a circumstance of which I can hardly flatter myself, and can hardly wish, that you should be ignorant.” “I learnt the sad history from one who, while he spoke the truth, spoke of the living sufferer in terms of the fondest affection.” “A father!” said Vivian, agitated, “a father can hardly be expected to be impartial.” “Such a father as yours may, I only wish that he was with us now, to assist me in bringing about what he must greatly desire, your return to England.” “It cannot be. I look back to the last year which I spent in that country with feelings of such disgust, I look forward to a return to that country with feelings of such repugnance that — but I feel I am trespassing beyond all bounds in touching on these subjects.” “I promised your father that in case we met, I would seek your society. I have suffered too much myself not to understand how dangerous and how deceitful is the excess of grief. You have allowed yourself to be overcome by that which Providence intended as a lesson of instruction, not as a sentence of despair. In your solitude you have increased the shadow of those fantasies of a heated brain, which converse with the pure sunshine of the world would have enabled you to dispel.” “The pure sunshine of the world, Lady Madeleine! would that it had ever lighted me! My youth flourished in the unwholesome sultriness of a blighted atmosphere, which I mistook for the resplendent brilliancy of a summer day. How deceived I was, you may judge, not certainly from finding me here; but I am here because I have ceased to suffer, only in having ceased to hope.” “You have ceased to hope, because hope and consolation are not the companions of solitude, which are of a darker nature. Hope and consolation spring from the social affections. Converse with the world will do more for you than all the arguments of philosophers. I hope yet to find you a believer in the existence of that good which we all worship and all pursue. Happiness comes when we least expect it, and to those who strive least to obtain it; as you were fortunate yesterday at the Redoute, when you played without an idea of winning.” They were in the Limewalk: gay sounds greeted them, and Miss Fane came forward from a light-hearted band to welcome her cousin. She had to propose a walk to the New Spring, which she was prepared for Lady Madeleine to resist on the ground of her cousin’s health. But Miss Fane combated all the objections with airy merriment, and with a bright resource that never flagged. As she bent her head slightly to Vivian, ere she hastened back to her companions to announce the success of her mission, it seemed to him that he had never beheld so animated and beaming a countenance, or glanced upon a form of such ineffable and sparkling grace. “You would scarcely imagine, Mr. Grey, that we are travelling for my cousin’s health, nor do her physicians, indeed, give us any cause for serious uneasiness; yet I cannot help feeling at times great anxiety. Her flushed cheek and the alarming languor which succeeds any excitement make me fear her complaint may be more deeply seated than they are willing to acknowledge.” “They were saying the other day that the extraordinary heat of this season must end in an earthquake, or some great convulsion of nature. That would bring languor.” “We are willing to adopt any reasoning that gives us hope, but her mother died of consumption.”","sourceLink":"http://novel.tingroom.com/jingdian/1408/42291.html","bookId":1393,"book":{"id":1393,"title":"Vivian Grey","description":"简介： We are not aware that the infancy of Vivian Grey was distinguished by any extraordinary incident. The solicitude of the most affectionate of mothers and the care of the most attentive of nurses did their best to injure an excellent constitution....","cover":"http://novel.tingroom.com/file/upload/201510/26/09-11-11-43-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1408","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
