{"id":34225,"no":53,"title":"Chapter 13","content":"The reader will remember that Vivian had agreed to dine, on the day after the fête, with the Baron, in his private apartments. This was an arrangement which, in fact, the custom of the house did not permit; but the irregularities of great men who are attended by chasseurs are occasionally winked at by a supple ma?tre d’h?tel. Vivian had reasons for not regretting his acceptance of the invitation; and he never shook hands with the Chevalier de Boeffleurs, apparently, with greater cordiality, than on the day on which he met him at dinner at the Baron von Konigstein’s. Mr. St. George had not arrived. \\n\\n \\n\\n “Past five!” said the Baron; “riding out, I suppose, with the Fitzlooms. Aurelia is certainly a fine girl; but I should think that Lady Madeleine would hardly approve the connection. The St. Georges have blood in their veins; and would, I suppose, as soon think of marrying a Fitzloom as we Germans should of marrying a woman without a von before her name. We are quite alone, Grey, only the Chevalier and St. George. I had an idea of asking Salvinski, but he is such a regular steam-engine, and began such a long story last night about his interview with the King of Ashantee, that the bare possibility of his taking it into his head to finish it to-day frightened me. You were away early from the Grand Duke’s last night. The business went off well.” \\n\\n \\n\\n “Very well, indeed!” said the Chevalier de Boeffleurs; completing by this speech the first dozen of words which he had uttered since his stay at Ems. \\n\\n \\n\\n “I think that last night Lady Madeleine Trevor looked perfectly magnificent; and a certain lady, too, Grey, eh? Here is St. George. My dear fellow, how are you? Has the fair Aurelia recovered from the last night’s fatigues? Now, Ernstorff, dinner as soon as possible.” \\n\\n \\n\\n The Baron made up to-day, certainly, for the silence of his friend the Chevalier. He outdid himself. Story after story, adventure after adventure, followed each other with exciting haste. In fact, the Baron never ceased talking the whole dinner, except when he refreshed himself with wine, which he drank copiously. A nice observer would, perhaps, have considered the Baron’s high spirits artificial, and his conversation an effort. Yet his temper, though lively, was generally equable; and his ideas, which always appeared to occur easily, were usually thrown out in fluent phraseology. The dinner was long, and a great deal of wine was drunk: more than most of the parties present for a long time had been accustomed to. About eight o’clock the Chevalier proposed going to the Redoute, but the Baron objected. \\n\\n \\n\\n “Let us have an evening altogether: surely we have had enough of the Redoute. In my opinion one of the advantages of the fête is, that there is no New House to-night. Conversation is a novelty. On a moderate calculation I must have told you to-day at least fifty original anecdotes. I have done my duty. It is the Chevalier’s turn now. Come, de Boeffleurs, a choice one!” \\n\\n \\n\\n “I remember a story Prince Salvinski once told me.” \\n\\n \\n\\n “No, no, that is too bad; none of that Polish bear’s romances; if we have his stories, we may as well have his company.” \\n\\n \\n\\n “But it is a very curious story,” continued the Chevalier, with a little animation. \\n\\n \\n\\n “Oh! so is every story, according to the storier.” \\n\\n \\n\\n “I think, Von Konigstein, you imagine no one can tell a story but yourself,” said De Boeffleurs, actually indignant. Vivian had never heard him speak so much before, and really began to believe that he was not quite an automaton. \\n\\n \\n\\n “Let us have it!” said St. George. \\n\\n \\n\\n “It is a story told of a Polish nobleman, a Count somebody: I never can remember their crack-jaw names. Well! the point is this,” said the silent little Chevalier, who, apparently, already repented of the boldness of his offer, and, misdoubting his powers, wished to begin with the end of his tale: “the point is this, he was playing one day at ecarté with the Governor of Wilna; the stake was trifling, but he had a bet, you see, with the Governor of a thousand roubles; a bet with the Governor’s secretary, never mind the amount, say two hundred and fifty, you see; then, he went on the turn-up with the Commandant’s wife; and took the pips on the trumps with the Archbishop of Warsaw. To understand the point of the story, you see, you must have a distinct conception how the game stood. You see, St. George, there was the bet with the Governor, one thousand roubles; the Governor’s secretary, never mind the amount, say two hundred and fifty; turn-up with the Commandant’s lady, and the pips with the Archbishop of Warsaw. Proposed three times, one for the king, the Governor drew ace; the Governor was already three and the ten. When the Governor scored king, the Archbishop gave the odds, drew knave queen one hand. The count offered to propose fourth time. Governor refused. King to six, ace fell to knave, queen cleared on. Governor lost, besides bets with the whole état-major; the Secretary gave his bill; the Commandant’s lady pawned her jewels; and the Archbishop was done on the pips!” \\n\\n \\n\\n “By Jove, what a Salvinski!” \\n\\n \\n\\n “How many trumps had the Governor?” asked St. George. \\n\\n \\n\\n “Three,” said the Chevalier. \\n\\n \\n\\n “Then it is impossible: I do not believe the story; it could not be.” \\n\\n \\n\\n “I beg your pardon,” said the Chevalier; “you see the Governor had — ” \\n\\n \\n\\n “By Jove, don’t let us have it all over again!” said the Baron. “Well! if this be your model for an after-dinner anecdote, which ought to be as piquant as an anchovy toast, I will never complain of your silence in future.” \\n\\n \\n\\n “The story is a true story,” said the Chevalier; “have you got a pack of cards, Von Konigstein? I will show it you.” \\n\\n \\n\\n “There is not such a thing in the room,” said the Baron. \\n\\n \\n\\n “Well, I never heard of a room without a pack of cards before,” said the Chevalier; “I will send for one to my own apartments.” \\n\\n \\n\\n “Perhaps Ernstorff has got a pack. Here, Ernstorff, have you got a pack of cards? That’s well; bring it immediately.” \\n\\n \\n\\n The cards were brought, and the Chevalier began to fight his battle over again; but could not satisfy Mr. St. George. “You see, there was the bet with the Governor, and the pips, as I said before, with the Archbishop of Warsaw.” \\n\\n \\n\\n “My dear De Boeffleurs, let’s no more of this. If you like to have a game of ecarté with St. George, well and good; but as for quarrelling the whole evening about some blundering lie of Salvinski’s, it really is too much. You two can play, and I can talk to Don Vivian, who, by-the-bye, is rather of the rueful countenance to-night. Why, my dear fellow, I have not heard your voice this evening: frightened by the fate of the Archbishop of Warsaw, I suppose?” \\n\\n \\n\\n “Ecarté is so devilish dull,” said St. George; “and it is such a trouble to deal.” \\n\\n \\n\\n “I will deal for both, if you like,” said De Boeffleurs; “I am used to dealing.” \\n\\n \\n\\n “Oh! no, I won’t play ecarté; let us have something in which we can all join.” \\n\\n \\n\\n “Rouge-et-noir,” suggested the Chevalier, in a careless tone, as if he had no taste for the amusement. \\n\\n \\n\\n “There is not enough, is there?” asked St. George. \\n\\n \\n\\n “Oh! two are enough, you know; one deals, much more four.” \\n\\n \\n\\n “Well, I don’t care; rouge-et-noir then, let us have rouge-et-noir. Von Konigstein, what say you to rouge-et-noir? De Boeffleurs says we can play it here very well. Come, Grey.” \\n\\n \\n\\n “Oh! rouge-et-noir, rouge-et-noir,” said the Baron; “have not you both had rouge-et-noir enough? Am I not to be allowed one holiday? Well, anything to please you; so rouge-et-noir, if it must be so.” \\n\\n \\n\\n “If all wish it, I have no objection,” said Vivian. \\n\\n \\n\\n “Well, then, let us sit down; Ernstorff has, I dare say, another pack of cards, and St. George will be dealer; I know he likes that ceremony.” \\n\\n \\n\\n “No, no; I appoint the Chevalier.” \\n\\n \\n\\n “Very well,” said De Boeffleurs, “the plan will be for two to bank against the table; the table to play on the same colour by joint agreement. You can join me, Von Konigstein, and pay or receive with me, from Mr. St. George and Grey.” \\n\\n \\n\\n “I will bank with you, if you like, Chevalier,” said Vivian. \\n\\n \\n\\n “Oh! certainly; that is if you like. But perhaps the Baron is more used to banking; you perhaps don’t understand it.” \\n\\n \\n\\n “Perfectly; it appears to me to be very simple.” \\n\\n \\n\\n “No, don’t you bank, Grey,” said St. George. “I want you to play with me against the Chevalier and the Baron; I like your luck.” \\n\\n \\n\\n “Luck is very capricious, remember.” \\n\\n \\n\\n “Oh, no, I like your luck; don’t bank.” \\n\\n \\n\\n “Be it so.” \\n\\n \\n\\n Playing commenced. An hour elapsed, and the situation of none of the parties was materially different from what it had been when they began the game. Vivian proposed leaving off; but Mr. St. George avowed that he felt very fortunate, and that he had a presentiment that he should win. Another hour elapsed, and he had lost considerably. Eleven o’clock: Vivian’s luck had also deserted him. Mr. St. George was losing desperately. Midnight: Vivian had lost back half his gains on the season. St. George still more desperate, all his coolness had deserted him. He had persisted obstinately against a run on the red; then floundered and got entangled in a seesaw, which alone cost him a thousand. \\n\\n \\n\\n Ernstorff now brought in refreshments; and for a moment they ceased playing. The Baron opened a bottle of champagne; and St. George and the Chevalier were stretching their legs and composing their minds in very different ways, the first in walking rapidly up and down the room, and the other by lying very quietly at his full length on the sofa; Vivian was employed in building houses with the cards. \\n\\n \\n\\n “Grey,” said the Chevalier de Boeffleurs, “I cannot imagine why you do not for a moment try to forget the cards: that is the only way to win. Never sit musing over the table.” \\n\\n \\n\\n But Grey was not to be persuaded to give up building his pagoda: which, now many stories high, like a more celebrated but scarcely more substantial structure, fell with a crash. Vivian collected the scattered cards into two divisions. \\n\\n \\n\\n “Now!” said the Baron, seating himself, “for St. George’s revenge.” \\n\\n \\n\\n The Chevalier and the greatest sufferer took their places. \\n\\n \\n\\n “Is Ernstorff coming in again, Baron?” asked Vivian. \\n\\n \\n\\n “No! I think not.” \\n\\n \\n\\n “Let us be sure; it is disagreeable to be disturbed at this time of night.” \\n\\n \\n\\n “Lock the door, then,” said St. George. \\n\\n \\n\\n “A very good plan,” said Vivian; and he locked it accordingly. \\n\\n \\n\\n “Now, gentlemen,” said Vivian, rising from the table, and putting both packs of cards into his pocket; “now, gentlemen, I have another game to play.” The Chevalier started on his chair, the Baron turned pale, but both were silent. “Mr. St. George,” continued Vivian, “I think that you owe the Chevalier de Boeffleurs about four thousand Napoleons, and to Baron von Konigstein something more than half that sum. I have to inform you that it is unnecessary for you to satisfy the claims of either of these gentlemen, which are founded neither in law nor in honour.” \\n\\n \\n\\n “Mr. Grey, what am I to understand?” asked the quiet Chevalier de Boeffleurs, with the air of a wolf and the voice of a lion. \\n\\n \\n\\n “Understand, sir!” answered Vivian, sternly, “that I am not one who will be bullied by a blackleg.” \\n\\n \\n\\n “Grey! good God! what do you mean?” asked the Baron. \\n\\n \\n\\n “That which it is my duty, not my pleasure, to explain, Baron von Konigstein.” \\n\\n \\n\\n “If you mean to insinuate,” burst forth the Chevalier. \\n\\n \\n\\n “I mean to insinuate nothing. I leave insinuations and innuendoes to chevaliers d’industrie. I mean to prove everything.” \\n\\n \\n\\n Mr. St. George did not speak, but seemed as utterly astounded and overwhelmed as Baron von Konigstein himself, who, with his arm leaning on the table, his hands clasped, and the forefinger of his right hand playing convulsively on his left, was pale as death, and did not even breathe. \\n\\n \\n\\n “Gentlemen,” said Vivian, “I shall not detain you long, though I have much to say that is to the purpose. I am perfectly cool, and, believe me, perfectly resolute. Let me recommend to you all the same temperament; it may be better for you. Rest assured, that if you flatter yourselves that I am one to be pigeoned and then bullied, you are mistaken. In one word, I am aware of everything that has been arranged for the reception of Mr. St. George and myself this evening. Your marked cards are in my pocket, and can only be obtained by you with my life. Here are two of us against two; we are equally matched in number, and I, gentlemen, am armed. If I were not, you would not dare to go to extremities. Is it not, then, the wisest course to be temperate, my friends?” \\n\\n \\n\\n “This is some vile conspiracy of your own, fellow,” said De Boeffleurs: “marked cards, indeed! a pretty tale, forsooth! The Ministers of a first-rate Power playing with marked cards! The story will gain credit, and on the faith of whom? An adventurer that no one knows, who, having failed this night in his usual tricks, and lost money which he cannot pay, takes advantage of the marked cards, which he has not succeeded in introducing, and pretends, forsooth, that they are those which he has stolen from our table; our own cards being, previously to his accusation, concealed in a secret pocket.” \\n\\n \\n\\n The impudence of the fellow staggered even Vivian. As for Mr. St. George, he stared like a wild man. Before Vivian could answer him the Baron had broken silence. It was with the greatest effort that he seemed to dig his words out of his breast. \\n\\n \\n\\n “No, no; this is too much! It is all over! I am lost; but I will not add crime to crime. Your courage and your fortune have saved you, Mr. Grey, and your friend from the designs of villains. And you! wretch,” said he, turning to De Boeffleurs, “sleep now in peace; at length you have undone me.” He leant on the table, and buried his face in his hands. \\n\\n \\n\\n “Chicken-hearted fool!” said the Chevalier; “is this the end of all your promises and all your pledges? But remember, sir! remember. I have no taste for scenes. Good night, gentlemen. Baron, I expect to hear from you.” \\n\\n \\n\\n “Stop, sir!” said Vivian; “no one leaves this room without my permission.” \\n\\n \\n\\n “I am at your service, sir, when you please,” said the Chevalier. \\n\\n \\n\\n “It is not my intention to detain you long, sir; far from it. I have every inclination to assist you in your last exit from this room; had I time, it should not be by the door. As it is, go! in the devil’s name.” So saying he hurled the adventurous Frenchman half down the corridor. \\n\\n \\n\\n “Baron von Konigstein,” said Vivian, turning to the Baron, “you have proved yourself, by your conduct this evening, to be a better man than I imagined you. I confess that I thought you had been too much accustomed to such scenes to be sensible of the horror of detection.” \\n\\n \\n\\n “Never!” said the Baron, with emphasis, with energy. The firm voice and manner in which he pronounced this single word wonderfully contrasted with his delivery when he had last spoke; but his voice immediately died away. \\n\\n \\n\\n “’Tis all over! I have no wish to excite your pity, gentlemen, or to gain your silence, by practising upon your feelings. Be silent. I am not the less ruined, not the less disgraced, not the less utterly undone. Be silent; my honour, all the same, in four-and-twenty hours, has gone for ever. I have no motive, then, to deceive you. You must believe what I speak; even what I speak, the most degraded of men. I say again, never, never, never, never, never was my honour before sullied, though guilty of a thousand follies. You see before you, gentlemen, the unhappy victim of circumstances; of circumstances which he has in vain struggled to control, to which he has at length fallen a victim. I am not pretending, for a moment, that my crimes are to be accounted for by an inexorable fate, and not to be expiated by my everlasting misery. No, no! I have been too weak to be virtuous: but I have been tried, tried most bitterly. I am the most unfortunate of men; I was not born to be a villain. Four years have passed since I was banished from the country in which I was honoured, my prospects in life blasted, my peace of mind destroyed; and all because a crime was committed of any participation in which I am as innocent as yourselves. Driven in despair to wander, I tried, in the wild dissipation of Naples, to forget my existence and my misery. I found my fate in the person of this vile Frenchman, who never since has quitted me. Even after two years of madness in that fatal place, my natural disposition rallied; I struggled to save myself; I quitted it. I was already involved to De Boeffleurs; I became still more so, in gaining from him the means of satisfying all claims against me. Alas! I found I had sold myself to a devil, a very devil, with a heart like an adder’s. Incapable of a stray generous sensation, he has looked upon mankind during his whole life with the eyes of a bully of a gaming-house. I still struggled to free myself from this man; and I indemnified him for his advances by procuring him a place in the mission to which, with the greatest difficulty and perseverance, I had at length obtained my appointment. In public life I yet hoped to forget my private misery. At Frankfort I felt that, though not happy, I might be calm. I determined never again even to run the risk of enduring the slavery of debt. I foreswore, with the most solemn oaths, the gaming table; and had it not been for the perpetual sight of De Boeffleurs, I might, perhaps, have felt at ease; though the remembrance of my blighted prospects, the eternal feeling that I experienced of being born for nobler ends, was quite sufficient perpetually to embitter my existence. The second year of my Frankfort appointment I was tempted to this unhappy place. The unexpected sight of faces which I had known in England, though they called up the most painful associations, strengthened me, nevertheless, in my resolution to be virtuous. My unexpected fortune at the Redoute, the first night, made me forget all my resolves, and has led to all this misery. I make my sad tale brief. I got involved at the New House: De Boeffleurs once more assisted me, though his terms were most severe. Yet, yet again, I was mad enough, vile enough, to risk what I did not possess. I lost to Prince Salvinski and a Russian gentleman a considerable sum on the night before the fête. It is often the custom at the New House, as you know, among men who are acquainted, to pay and receive all losses which are considerable on the next night of meeting. The fête gave me breathing time: it was not necessary to redeem my pledge till the fourth night. I rushed to De Boeffleurs; he refused to assist me, alleging his own losses and his previous advance. What was to be done? No possibility of making any arrangement with Salvinski. Had he won of me as others have done, an arrangement, though painful, would perhaps have been possible; but, by a singular fate, whenever I have chanced to be successful, it is of this man that I have won. De Boeffleurs, then, was the only chance. He was inexorable. I prayed to him; I promised him everything; I offered him any terms; in vain! At length, when he had worked me up to the last point of despair, he whispered hope. I listened; let me be quick! why finish? You know I fell!” The Baron again covered his face, and appeared perfectly overwhelmed. \\n\\n \\n\\n “By God! it is too horrible,” said St. George. “Grey, let us do something for him.” \\n\\n \\n\\n “My dear St. George,” said Vivian, “be calm. You are taken by surprise. I was prepared for all this. Believe me, it is better for you to leave us. I recommend you to retire, and meet me in the morning. Breakfast with me at eight; we can then arrange everything.” \\n\\n \\n\\n Vivian’s conduct had been so decisive, and evidently so well matured, that St. George felt that, in the present case, it was for him only to obey, and he retired with wonder still expressed on his countenance; for he had not yet, in the slightest degree, recovered from the first surprise. \\n\\n \\n\\n “Baron von Konigstein,” said Vivian to the unhappy man, “we are alone. Mr. St. George has left the room: you are freed from the painful presence of the cousin of Captain Fane.” \\n\\n \\n\\n “You know all, then!” exclaimed the Baron quickly, looking up, “or you have read my secret thoughts. How wonderful! at that very moment I was thinking of my friend. Would I had died with him! You know all, then; and now you must believe me guilty. Yet, at this moment of annihilating sorrow, when I can gain nothing by deceit, I swear; and if I swear falsely, may I fall down a livid corpse at your feet; I swear that I was guiltless of the crime for which I suffered, guiltless as yourself. What may be my fate I know not. Probably a few hours, and all will be over. Yet, before we part, sir, it would be a relief; you would be doing a generous service to a dying man, to bear a message from me to one with whom you are acquainted; to one whom I cannot now name.” \\n\\n \\n\\n “Lady Madeleine Trevor?” \\n\\n \\n\\n “Again you have read my thoughts! Lady Madeleine! Is it she who told you of my early history?” \\n\\n \\n\\n “All that I know is known to many.” \\n\\n \\n\\n “I must speak! If you have time, if you can listen for half an hour to a miserable being, it would be a consolation to me. I should die with ease if I thought that Lady Madeleine could believe me innocent of that first great offence.” \\n\\n \\n\\n “Your Excellency may address anything to me, if it be your wish, even at this hour of the night. It may be better; after what has passed, we neither of us can sleep, and this business must be arranged at once.” \\n\\n \\n\\n “My object is, that Lady Madeleine should receive from me at this moment, at a time when I can have no interest to deceive, an account of the particulars of her cousin’s and my friend’s death. I sent it written after the horrid event; but she was ill, and Trevor, who was very bitter against me, returned the letters unopened. For four years I have never travelled without these rejected letters; this year I have them not. But you could convey to Lady Madeleine my story as now given to you; to you at this terrible moment.” \\n\\n \\n\\n “Speak on!” \\n\\n \\n\\n “I must say one word of my connection with the family to enable you fully to understand the horrid event, of which, if, as I believe, you only know what all know, you can form but a most imperfect conception. When I was Minister at the Court of London I became acquainted; became, indeed, intimate, with Mr. Trevor, then in office, the husband of Lady Madeleine. She was just married. Of myself at that time, I may say that, though depraved, I was not heartless, and that there were moments when I panted to be excellent. Lady Madeleine and myself became friends; she found in me a companion who not only respected her talents and delighted in her conversation, but one who in return was capable of instructing, and was overjoyed to amuse her. I loved her; but when I loved her I ceased to be a libertine. At first I thought that nothing in the world could have tempted me to have allowed her for an instant to imagine that I dared to look upon her in any other light than as a friend; but the negligence, the coldness of Trevor, the overpowering mastery of my own passions, drove me one day past the line, and I wrote that which I dared not utter. It never entered into my mind for an instant to insult such a woman with the commonplace sophistry of a ribald. No! I loved her with all my spirit’s strength. I would have sacrificed all my views in life, my ambition, my family, my fortune, my country, to have gained her; and I told her this in terms of respectful adoration. I worshipped the divinity, even while I attempted to profane the altar. When I had sent this letter I was in despair. Conviction of the insanity of my conduct flashed across my mind. I expected never to see her again. There came an answer; I opened it with the greatest agitation; to my surprise, an appointment. Why trouble you with a detail of my feelings, my mad hope, my dark despair! The moment for the interview arrived. I was received neither with affection nor anger. In sorrow she spoke. I listened in despair. I was more madly in love with her than ever. That very love made me give her such evidences of a contrite spirit that I was pardoned. I rose with a resolution to be virtuous, with a determination to be her friend: then I made the fatal promise which you know of, to be doubly the friend of a man whose friend I already was. It was then that I pledged myself to Lady Madeleine to be the guardian spirit of her cousin.” Here the Baron, overpowered by his emotions, leant back in his chair, and ceased to speak. In a few minutes he resumed. \\n\\n \\n\\n “I did my duty; by all that’s sacred, I did my duty! Night and day I was with young Fane. A hundred times he was on the brink of ruin; a hundred times I saved him. One day, one never-to-be-forgotten day, one most dark and damnable day, I called on him, and found him on the point of joining a coterie of desperate character. I remonstrated with him, I entreated, I supplicated him not to go, in vain. At last he agreed to forego his engagement on condition that I dined with him. There were important reasons that day for my not staying with him; yet every consideration vanished when I thought of her for whom I was exerting myself. He was frantic this day; and, imagining that there was no chance of his leaving his home, I did not refuse to drink freely, to drink deeply. My doing so was the only way to keep him at home. As we were passing down Pall Mall we met two foreigners of distinction and a noble of your country; they were men of whom we both knew little. I had myself introduced Fane to the foreigners a few days before, being aware that they were men of high rank. After some conversation they asked us to join them at supper at the house of their English friend. I declined; but nothing could induce Fane to refuse them, and I finally accompanied them. Play was introduced after supper: I made an ineffectual struggle to get Fane home, but I was too full of wine to be energetic. After losing a small sum I got up from the table, and, staggering to a sofa, fell fast asleep. Even as I passed Fane’s chair in this condition, my master thought was evident, and I pulled him by the shoulder: all was useless; I woke to madness!” It was terrible to witness the anguish of Von Konigstein. \\n\\n \\n\\n “Could you not clear yourself?” asked Vivian, for he felt it necessary to speak. \\n\\n \\n\\n “Clear myself! Everything told against me. The villains were my friends, not the sufferer’s; I was not injured. My dining with him was part of the conspiracy; he was intoxicated previous to his ruin. Conscious of my innocence, quite desperate, but confiding in my character, I accused the guilty trio; they recriminated and answered, and without clearing themselves convinced the public that I was their dissatisfied and disappointed tool. I can speak no more.” \\n\\n \\n\\n It is awful to witness sudden death; but, oh! how much more awful it is to witness in a moment the moral fall of a fellow-creature! How tremendous is the quick succession of mastering passions! The firm, the terrifically firm, the madly resolute denial of guilt; that eagerness of protestation which is a sure sign of crime, then the agonising suspense before the threatened proof is produced, the hell of detection, the audible anguish of sorrow, the curses of remorse, the silence of despair! Few of us, unfortunately, have passed through life without having beheld some instance of this instantaneous degradation of human nature. But, oh! how terrible is it when the confessed criminal has been but a moment before our friend! What a contrast to the laugh of joyous companionship is the quivering tear of an agonised frame! how terrible to be prayed to by those whose wishes a moment before we lived only to anticipate! \\n\\n \\n\\n “Von Konigstein,” said Vivian, after a long silence, “I feel for you. Had I known this I would have spared both you and myself this night of misery; I would have prevented you from looking back to this day with remorse. You have suffered for that of which you were not guilty; you shall not suffer now for what has passed. Much would I give to see you freed from that wretched knave, whose vile career I was very nearly tempted this evening to have terminated for ever. I shall make the communication you desire, and I will endeavour that it shall be credited; as to the transactions of this evening, the knowledge of them can never transpire to the world. It is the interest of De Boeffleurs to be silent; if he speak no one will credit the tale of such a creature, who, if he speak truth, must proclaim his own infamy. And now for the immediate calls upon your honour; in what sum are you indebted to Prince Salvinski and his friend?” \\n\\n \\n\\n “Thousands! two, three thousand.” \\n\\n \\n\\n “I shall then have an opportunity of ridding myself of that the acquisition of which, to me, has been matter of great sorrow. Your honour Is saved. I will discharge the claims of Salvinski and his friend.” \\n\\n \\n\\n “Impossible! I cannot allow — ” \\n\\n \\n\\n “Stop; in this business I must command. Surely there can be no feelings of delicacy between us two now. If I gave you the treasures of the Indies you would not be under so great an obligation to me as you are already: I say this with pain. I recommend you to leave Ems to-morrow; public business will easily account for your sudden departure. And now, your character is yet safe, you are yet in the prime of life, you have vindicated yourself from that which has preyed upon your mind for years; cease to accuse your fate!” Vivian was about to leave the room when the Baron started from his seat and seized his hand. He would have spoken, but the words died upon his lips, and before he could recover himself Vivian had retired. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1408/42297.html","bookId":1393,"book":{"id":1393,"title":"Vivian Grey","description":"简介： We are not aware that the infancy of Vivian Grey was distinguished by any extraordinary incident. The solicitude of the most affectionate of mothers and the care of the most attentive of nurses did their best to injure an excellent constitution....","cover":"http://novel.tingroom.com/file/upload/201510/26/09-11-11-43-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1408","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
