{"id":34227,"no":55,"title":"Chapter 15","content":"It was about a week after the departure of the Baron that two young Englishmen, who had been college friends of Mr. St. George, arrived at the Baths. These were Mr. Anthony St. Leger and Mr. Adolphus St. John. In the academic shades of Christchurch these three gentlemen had been known as “All Saints.” Among their youthful companions they bore the more martial style of “The Three Champions,” St. George, St. John, and St. Anthony. St. John and St. Anthony had just completed the grand tour, and, after passing the Easter at Rome, had returned through the Tyrol from Italy. Since then they had travelled over most parts of Germany; and now, in the beginning of July, found themselves at the Baths of Ems. Two years’ travel had not produced any very beneficial effect on either of these sainted personages. They had gained, by visiting the capitals of all Europe, only a due acquaintance with the follies of each; and the only difference that could be observed in their conduct on their return was, that their affectation was rather more fantastical, and therefore more amusing. “Corpo di Bacco, my champion! who ever thought of meeting thee thou holy saint! By the eyebrow of Venus, my spirit rejoiceth!” exclaimed St. Anthony, whose peculiar affectation was an adoption in English of the Italian oaths. “This is the sweetest spot, St. Anthony, that we have found since we left Paradiso; that is, St. George, in the vulgar, since we quitted Italia. ‘Italia! O Italia!’ I forget the rest; probably you remember it. Certainly, a most sweet spot this, quite a Gaspar!” Art was the peculiar affectation of St. John; he was, indeed, quite a patron of the Belle Arti, had scattered his orders through the studios of most of the celebrated sculptors of Italy, and spoke on all subjects and all things only with a view to their capability of forming material for the painter. According to the school of which Mr. St. John was a disciple, the only use of the human passions is, that they produce situations for the historical painter; and nature, according to these votaries of the [Greek: to kalon], is only to be valued as affording hints for the more perfect conceptions of a Claude or a Salvator. “By the girdle of Venus, a devilish fine woman!” exclaimed St. Anthony. “A splendid bit!” ejaculated St. John; “touched in with freedom, a grand tournure, great gout in the swell of the neck. What a study for Retsch!” “In the name of the Graces, who is it, mio Santo?” “Ay! name la bellissima Signora.” “The ‘fine bit,’ St. John, is my sister.” “The devil!” “Diavolo!” “Will you introduce us, most holy man?” This request from both, simultaneously arranging their mustachios. The two saints were accordingly, in due time, introduced; but finding the attention of Miss Fane always engrossed, and receiving some not very encouraging responses from Lady Madeleine, they voted her ladyship cursedly satirical; and passing a general censure on the annoying coldness of Englishwomen, they were in four-and-twenty hours attached to the suite of the Miss Fitzlooms, to whom they were introduced by St. George as his particular friends, and were received with the most flattering consideration. “By the aspect of Diana! fine girls,” swore St. Anthony. “Truly most gorgeous colouring! quite Venetian! Aurelia is a perfect Giorgione!” said St. John. “Madeleine,” said St. George, one morning, to his sister, “have you any objection to make up a party with the Fitzlooms to pass a day at Nassau? You know we have often talked of it; and as Violet is so well now, and the weather so delightful, there surely can be no objection. The Fitzlooms are very agreeable people; and though you do not admire the Santi, still, upon my word, when you know them a little more, you will find them very pleasant fellows, and they are extremely good-natured; and just the fellows for such a party. Do not refuse me. I have set my mind upon your joining the party. Pray nod assent; thank you. Now I must go and arrange everything. Let us see: there are seven Fitzlooms; for we cannot count on less than two boys; yourself, Grey, Violet, and myself, four; the Santi; quite enough, a most delightful party. Half a dozen servants and as many donkeys will manage the provisions. Then three light carriages will take us all. ‘By the wand of Mercury!’ as St. Anthony would vow, admirably planned!” “By the breath of Zephyr! a most lovely day, Miss Fane,” said St. Anthony, on the morning of the intended excursion. “Quite a Claude!” said St. John. “Almost as beautiful as an Italian winter day, Mr. St. Leger?” asked Miss Fane. “Hardly!” said St. Anthony, with a serious air; for he imagined the question to be quite genuine. The carriages are at the door; into the first ascended Mrs. Fitzloom, two daughters, and the travelling saints. The second bore Lady Madeleine, Mr. Fitzloom, and his two sons; the third division was formed of Mr. St. George and Aurelia Fitzloom, Miss Fane and Vivian. Away, away, rolled the carriages; the day was beautiful, the sky was without a cloud, and a mild breeze prevented the heat of the sun from being overpowering. All were in high spirits; for St. George had made a capital master of the ceremonies, and had arranged the company in the carriages to their mutual satisfaction. St. Anthony swore, by the soul of Psyche! that Augusta Fitzloom was an angel; and St. John was in equal raptures with Araminta, who had an expression about the eyes which reminded him, of Titian’s Flora. Mrs. Fitzloom’s natural silence did not disturb the uninterrupted jargon of the Santi, whose foppery elicited loud and continued approbation from the fair sisters. The mother sat admiring these sprigs of noble trees. The young Fitzlooms, in crimson cravats, conversed with Lady Madeleine with a delightful military air; and their happy parent, as he gazed upon them with satisfied affection, internally promised them both a commission in a crack regiment. The road from Ems to Nassau winds along the banks of the Lahn, through two leagues of delightful scenery; at the end of which, springing up from the peak of a bold and richly-wooded mountain, the lofty tower of the ancient castle of Nassau meets your view. Winding walks round the sides of the mountain lead through all the varieties of sylvan scenery, and command in all points magnificent views of the surrounding country. These finally bring you to the old castle, whose spacious chambers, though now choked up with masses of grey ruin or covered with underwood, still bear witness to the might of their former lord! the powerful Baron whose sword gained for his posterity a throne. All seemed happy; none happier than Violet Fane. Never did she look so beautiful as to-day, never was she so animated, never had she boasted that her pulse beat more melodious music, or her lively blood danced a more healthful measure. After examining all the antique chambers of the castle, and discovering, as they flattered themselves, secret passages, and dark dungeons, and hidden doors, they left this interesting relic of the middle ages; and soon, by a gradual descent through delightful shrubberies, they again found themselves at the bottom of the valley. Here they visited the modern chateau of Baron von Stein, one of the most enlightened and able politicians that Germany has ever produced. As Minister of Prussia, he commenced those reforms which the illustrious Hardenberg perfected. For upwards of five centuries the family of Stein have retained their territorial possessions in the valley of the Lahn. Their family castle, at present a ruin, and formerly a fief of the House of Nassau, is now only a picturesque object in the pleasure-grounds of the present lord. The noon had passed some hours before the delighted wanderers complained of fatigue, and by that time they found themselves in a pleasant green glade on the skirts of the forest of Nassau. It was nearly environed by mountains, covered with hanging woods, which shaded the beautiful valley, and gave it the appearance of a sylvan amphitheatre. From a rocky cleft in these green mountains a torrent, dashing down with impetuous force, and whose fall was almost concealed by the cloud of spray which it excited, gave birth to a small and gentle river, whose banks were fringed with beautiful trees, which prevented the sun’s darts from piercing its coldness, by bowing their fair heads over its waters. From their extending branches Nature’s choristers sent forth many a lovely lay Of God’s high praise, and of their loves’ sweet teen. Near the banks of this river, the servants, under the active direction of Essper George, had prepared a banquet for the party. The cloth had been laid on a raised work of wood and turf, and rustic seats of the same material surrounded the picturesque table. It glowed with materials, and with colours to which Veronese alone could have done justice: pasties, and birds, and venison, and groups of fish, gleamy with prismatic hues, while amid pyramids of fruit rose goblets of fantastic glass, worthy of the famous wines they were to receive. “Well!” said Miss Fane, “I never will be a member of an adventurous party like the present, of which Albert is not manager.” “I must not take the whole credit upon myself, Violet; St. John is butler, and St. Leger my vice-chamberlain.” “Well, I cannot praise Mr. St. John till I have tasted the malvoisie which he has promised; but as for the other part of the entertainment, Mr. St. Leger, I am sure this is a temptation which it would be a sin, even in St. Anthony, to withstand.’ “By the body of Bacchus, very good!” swore Mr. St. Leger. “These mountains,” said Mr. St. John, “remind me of one of Gaspar’s cool valleys. The party, indeed, give it a different character, quite a Watteau!” “Now, Mrs. Fitzloom,” said St. George, who was in his element, “let me recommend a little of this pike! Lady Madeleine, I have sent you some lamb. Miss Fitzloom, I hope St. Anthony is taking care of you. Wrightson, plates to Mr. St. Leger. Holy man, and much beloved! send Araminta some chicken. Grey has helped you, Violet? Aurelia, this is for you. William Pitt Fitzloom, I leave you to yourself. George Canning Fitzloom, take care of the ladies near you. Essper George! Where is Essper? St. John, who is your deputy in the wine department? Wrightson! bring those long green bottles out of the river, and put the champagne underneath the willow. Will your Ladyship take some light claret? Mrs. Fitzloom, you must use your tumbler; nothing but tumblers allowed, by Miss Fane’s particular request!” “St. George, thou holy man!” said Miss Fane, “methinks you are very impertinent. You shall not be my patron saint if you say such words.” For the next hour there was nothing heard save the calling of servants, the rattling of knives and forks, the drawing of corks, and continued bursts of laughter, which were not occasioned by any brilliant observations, either of the Saints, or any other persons, but merely the result of an exuberance of spirits on the part of every one present. “Well, Aurelia,” said Lady Madeleine, “do you prefer our present mode of life to feasting in an old hall, covered with banners and battered shields, and surrounded by mysterious corridors and dark dungeons?” Aurelia was so flattered by the notice of Lady Madeleine, that she made her no answer; probably because she was intent on a plover’s egg. “I think we might all retire to this valley,” said Miss Fane, “and revive the feudal times with great success. Albert might take us to Nassau Castle, and you, Mr. Fitzloom, might re-fortify the old tower of Stein. With two sons, however, who are about to enter the Guards, I am afraid we must be your vassals. Then what should we do? We could not have wood parties every day; I suppose we should get tired of each other. No! that does seem impossible; do not you all think so?” Omnes, “Impossible!” “We must, however, have some regular pursuit, some cause of constant excitement, some perpetual source of new emotions. New ideas, of course, we must give up; there would be no going to London for the season, for new opinions to astound country cousins on our return. Some pursuit must be invented; we all must have something to do. I have it! Albert shall be a tyrant.” “I am very much obliged to you, Violet.” “Yes! a cruel, unprincipled, vindictive, remorseless tyrant, with a long black beard, I cannot tell how long, about twenty thousand times longer than Mr. St. Leger’s mustachios.” “By the beard of Jove!” swore St. Anthony, as he almost started from his seat, and arranged with his thumb and forefinger the delicate Albanian tuft of his upper lip, “by the beard of Jove, Miss Fane, I am obliged to you.” “Well, then,” continued Violet, “Albert being a tyrant, Lady Madeleine must be an unhappy, ill-used, persecuted woman, living on black bread and green water, in an unknown dungeon. My part shall be to discover her imprisonment. Sounds of strange music attract my attention to a part of the castle which I have not before frequented. There I shall distinctly hear a female voice chaunting the ‘Bridesmaids’ Chorus,’ with Erard’s double pedal accompaniment. By the aid of the confessors of the two families, two drinking, rattling, impertinent, most corrupt, and most amusing friars, to wit, our sainted friends — ” Here both Mr. St. Leger and Mr. St. John bowed low to Miss Fane. “A most lively personage is Miss Fane,” whispered St. Anthony to his neighbour, Miss Fitzloom, “great style!” “Most amusing, delightful girl, great style! rather a display today, I think.” “Oh, decidedly! and devilish personal too; some people wouldn’t like it. I have no doubt she will say something about you next.” “Oh, I shall be very surprised, indeed, if she does! It may be very well to you, but Miss Fane must be aware — ” Before this pompous sentence could be finished an incident occurred which prevented Miss Fane from proceeding with her allotment of characters, and rendered unnecessary the threatened indignation of Miss Fitzloom. Miss Fane, as we mentioned, suddenly ceased speaking; the eyes of all were turned in the direction in which she was gazing as if she had seen a ghost. “What are you looking up at, Violet?” asked St. George. “Did not you see anything? did not any of you see anything?” “None, none!” “Mr. Grey, surely you must have seen it!” “I saw nothing.” “It could not be fancy; impossible. I saw it distinctly. I cannot be in a dream. See there! again, on that topmost branch. It moves!” Some odd shrill sounds, uttered in the voice of a Pulcinello, attracted the notice of them all; and lo! high in the air, behind a lofty chestnut tree, the figure of a Pulcinello did appear, hopping and vaulting in the unsubstantial air. Now it sent forth another shrill, piercing sound, and now, with both its hands, it patted and complacently stroked its ample paunch; dancing all the time with unremitting activity, and wagging its queer head at the astounded guests. “Who, what can it be?” cried all. The Misses Fitzloom shrieked, and the Santi seemed quite puzzled. “Who, what can it be?” Ere time could be given for any one to hazard a conjecture, the figure had advanced from behind the trees, and had spanned in an instant the festal board, with two enormous stilts, on which they now perceived it was mounted. The Misses Fitzloom shrieked again. The figure imitated their cries in his queer voice, and gradually raising one enormous stilt up into the air, stood only on one support, which was planted behind the lovely Araminta. “O! inimitable Essper George!” exclaimed Violet Fane. Here Signor Punch commenced a song, which he executed in the tone peculiar to his character, and in a style which drew applauses from all; and then, with a hop, step, and a jump, he was again behind the chestnut-tree. In a moment he advanced without his stilts towards the table. Here, on the turf, he again commenced his antics; kicking his nose with his right foot, and his hump with his left one; executing splendid somersets, and cutting every species of caper, and never ceasing for a moment from performing all his movements to the inspiring music of his own melodious voice. At last, jumping up very high in the air, he fell as if all his joints were loosened, and the Misses Fitzloom, imagining that his bones were really broken, shrieked again. But now Essper began the wonderful performance of a dead body possessed by a devil, and in a minute his shattered corpse, apparently without the assistance of any of its members, began to jump and move about the ground with miraculous rapidity. At length it disappeared behind the chestnut-tree. “I really think,” said Mr. St. George, “it is the most agreeable day I ever passed in all my life.” “Decidedly!” said St. Anthony. “St. John, you remember our party to Paestum with Lady Calabria M’Crater and the Marquis of Agrigentum. It was nothing to this! Nothing! Do you know I thought that rather dull.” “Yes, too elaborate; too highly finished; nothing of the pittore improvisatore. A party of this kind should be more sketchy in its style; the outline more free, and less detail.” “Essper is coming out to-day,” said Vivian to Miss Fane, “after a long, and, I venture to say, painful forbearance. However, I hope you will excuse him. It seems to amuse us.” “I think it is delightful. See! here he comes again.” He now appeared in his original costume; the one in which Vivian first met him at the fair. Bowing, he threw his hand carelessly over his mandolin, and having tried the melody of its strings, sang with great taste, and a sweet voice; sweeter from its contrast with its previous shrill tones; a very pretty romance. All applauded him very warmly, and no one more so than Miss Fane. “Ah! inimitable Essper George, how can we sufficiently thank you! How well he plays! and his voice is quite beautiful. Oh! could not we dance? would not it be delightful? and he could play on his guitar. Think of the delicious turf!” Omnes, “Delightful! delightful!” They rose from the table. “Violet, my dear,” asked Lady Madeleine, “what are you going to do?” “By the toe of Terpsichore!” as Mr. St. Leger would say, “I am going to dance.” “But remember, to-day you have done so much! let us be moderate; though you feel so much better, still think what a change to-day has been from your usual habits!” “But, dearest Lady Madeleine, think of dancing on the turf, and I feel so well!” “By the Graces! I am for the waltz,” said St. Anthony. “It has certainly a very free touch to recommend it,” said St. John. “No, no,” said Violet; “let us all join in a country dance.” But the Misses Fitzloom preferred a quadrille. The quadrille was soon formed: Violet made up for not dancing with Vivian at the Grand Duke’s. She was most animated, and kept up a successful rivalry with Mr. St. Leger, who evidently prided himself, as Mr. Fitzloom observed, “on his light fantastic toe.” Now he pirouetted like Paul, and now he attitudinised like Albert; and now Miss Fane eclipsed all his exertions by her inimitable imitations of Ronzi Vestris’ rushing and arrowy manner. St. Anthony, in despair, but quite delighted, revealed a secret which had been taught him by a Spanish dancer at Milan; but then Miss Fane vanquished him for ever with the pas de Zephyr of the exquisite Fanny Bias. The day was fast declining when the carriages arrived; the young people were in no humour to return; and as, when they had once entered the carriage, the day seemed finished for ever, they proposed walking part of the way home. Lady Madeleine made little objection to Violet joining the party, as after the exertion that Miss Fane had been making, a drive in an open carriage might be dangerous: and yet the walk was too long, but all agreed that it would be impossible to shorten it; and, as Violet declared that she was not in the least fatigued, the lesser evil was therefore chosen. The carriages rolled off; at about halfway from Ems, the two empty ones were to wait for the walking party. Lady Madeleine smiled with fond affection, as she waved her hand to Violet the moment before she was out of sight. “And now,” said St. George, “good people all, instead of returning by the same road, it strikes me, that there must be a way through this little wood; you see there is an excellent path. Before the sun is set we shall have got through it, and it will bring us out, I have no doubt, by the old cottage which you observed, Grey, when we came along. I saw a gate and path there; just where we first got sight of Nassau Castle; there can be no doubt about it. You see it is a regular right-angle, and besides varying the walk, we shall at least gain a quarter of an hour, which, after all, as we have to walk nearly three miles, is an object. It is quite clear, if I have a head for anything, it is for finding my way.” “I think you have a head for everything,” said Aurelia Fitzloom, in a soft sentimental whisper; “I am sure we owe all our happiness to-day to you!” “If I have a head for everything, I have a heart only for one person!” As every one wished to be convinced, no one offered any argument in opposition to Mr. St. George’s view of the case; and some were already in the wood. “Albert,” said Miss Fane, “I do not like walking in the wood so late; pray come back.” “Oh, nonsense, Violet! come. If you do not like to come, you can walk by the road; you will meet us round by the gate, it is only five minutes’ walk.” Ere he had finished speaking, the rest were in the wood, and some had advanced. Vivian strongly recommended Violet not to join them; he was sure that Lady Madeleine would not approve of it; he was sure that it was very dangerous, extremely; and, by-the-bye, while he was talking, which way had they gone? he did not see them. He halloed; all answered, and a thousand echoes besides. “We certainly had better go by the road, we shall lose our way if we try to follow them; nothing is so puzzling as walking in woods; we had much better keep to the road.” So by the road they went. The sun had already sunk behind the mountains, whose undulating forms were thrown into dark shadow against the crimson sky. The thin crescent of the new moon floated over the eastern hills, whose deep woods glowed with the rosy glories of twilight. Over the peak of a purple mountain glittered the solitary star of evening. As the sun dropped, universal silence seemed to pervade the whole face of nature. The voice of the birds was still; the breeze, which had refreshed them during the day, died away, as if its office were now completed; and none of the dark sounds and sights of hideous Night yet dared to triumph over the death of Day. Unseen were the circling wings of the fell bat; unheard the screech of the waking owl; silent the drowsy hum of the shade-born beetle! What heart has not acknowledged the influence of this hour, the sweet and soothing hour of twilight! the hour of love, the hour of adoration, the hour of rest! when we think of those we love, only to regret that we have not loved more dearly; when we remember our enemies only to forgive them! And Vivian and his beautiful companion owned the magic of this hour, as all must do, by silence. No word was spoken, yet is silence sometimes a language. They gazed, and gazed again, and their full spirits held due communion with the starlit sky, and the mountains and the woods, and the soft shadows of the increasing moon. Oh! who can describe what the o’ercharged spirit feels at this sacred hour, when we almost lose the consciousness of existence, and our souls seem to struggle to pierce futurity! In the forest of the mysterious Odenwald, in the solitudes of the Bergstrasse, had Vivian at this hour often found consolation for a bruised spirit, often in adoring nature had forgotten man. But now, when he had never felt nature’s influence more powerful; when he had never forgotten man and man’s world more thoroughly; when he was experiencing emotions, which, though undefinable, he felt to be new; he started when he remembered that all this was in the presence of a human being! Was it Hesperus he gazed upon, or something else that glanced brighter than an Evening star? Even as he thought that his gaze was fixed on the countenance of nature, he found that his eyes rested on the face of nature’s loveliest daughter! “Violet! dearest Violet!” As in some delicious dream the sleeper is awakened from his bliss by the sound of his own rapturous voice, so was Vivian roused by these words from his reverie, and called back to the world which he had forgotten. But ere a moment had passed, he was pouring forth in a rapid voice, and incoherent manner, such words as men speak only once. He spoke of his early follies, his misfortunes, his misery; of his matured views, his settled principles, his plans, his prospects, his hopes, his happiness, his bliss; and when he had ceased, he listened, in his turn, to some small still words, which made him the happiest of human beings. He bent down, he kissed the soft silken cheek which now he could call his own. Her hand was in his; her head sank upon his breast. Suddenly she clung to him with a strong grasp. “Violet! my own, my dearest; you are overcome. I have been rash, I have been imprudent. Speak, speak, my beloved! say, you are not ill!” She spoke not, but clung to him with a fearful strength, her head still upon his breast, her full eyes closed. Alarmed, he raised her off the ground, and bore her to the river-side. Water might revive her. But when he tried to lay her a moment on the bank, she clung to him gasping, as a sinking person clings to a stout swimmer. He leant over her; he did not attempt to disengage her arms; and, by degrees, by very slow degrees, her grasp loosened. At last her arms gave way and fell by his side, and her eyes partly opened. “Thank God! Violet, my own, my beloved, say you are better!” She answered not, evidently she did not know him, evidently she did not see him. A film was on her sight, and her eye was glassy. He rushed to the water-side, and in a moment he had sprinkled her temples, now covered with a cold dew. Her pulse beat not, her circulation seemed suspended. He rubbed the palms of her hands, he covered her delicate feet with his coat; and then rushing up the bank into the road, he shouted with frantic cries on all sides. No one came, no one was near. Again, with a cry of fearful anguish, he shouted as if an hyaena were feeding on his vitals. No sound; no answer. The nearest cottage was above a mile off. He dared not leave her. Again he rushed down to the water-side. Her eyes were still open, still fixed. Her mouth also was no longer closed. Her hand was stiff, her heart had ceased to beat. He tried with the warmth of his own body to revive her. He shouted, he wept, he prayed. All, all in vain. Again he was in the road, again shouting like an insane being. There was a sound. Hark! It was but the screech of an owl! Once more at the river-side, once more bending over her with starting eyes, once more the attentive ear listening for the soundless breath. No sound! not even a sigh! Oh! what would he have given for her shriek of anguish! No change had occurred in her position, but the lower part of her face had fallen; and there was a general appearance which struck him with awe. Her body was quite cold, her limbs stiffened. He gazed, and gazed, and gazed. He bent over her with stupor rather than grief stamped on his features. It was very slowly that the dark thought came over his mind, very slowly that the horrible truth seized upon his soul. He gave a loud shriek, and fell on the lifeless body of VIOLET FANE!","sourceLink":"http://novel.tingroom.com/jingdian/1408/42299.html","bookId":1393,"book":{"id":1393,"title":"Vivian Grey","description":"简介： We are not aware that the infancy of Vivian Grey was distinguished by any extraordinary incident. The solicitude of the most affectionate of mothers and the care of the most attentive of nurses did their best to injure an excellent constitution....","cover":"http://novel.tingroom.com/file/upload/201510/26/09-11-11-43-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1408","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
