{"id":34180,"no":8,"title":"Chapter 8","content":"We must endeavour to trace, if possible, more accurately the workings of Vivian Grey’s mind at this period of his existence. In the plenitude of his ambition, he stopped one day to enquire in what manner he could obtain his magnificent ends. \\n\\n \\n\\n “The Bar: pooh! law and bad jokes till we are forty; and then, with the most brilliant success, the prospect of gout and a coronet. Besides, to succeed as an advocate, I must be a great lawyer; and, to be a great lawyer, I must give up my chance of being a great man. The Services in war time are fit only for desperadoes (and that truly am I); but, in peace, are fit only for fools. The Church is more rational. Let me see: I should certainly like to act Wolsey; but the thousand and one chances against me! And truly I feel my destiny should not be on a chance. Were I the son of a millionaire, or a noble, I might have all. Curse on my lot! that the want of a few rascal counters, and the possession of a little rascal blood, should mar my fortunes!” \\n\\n \\n\\n Such was the general tenor of Vivian’s thoughts, until, musing himself almost into madness, he at last made, as he conceived, the Grand Discovery. Riches are Power, says the Economist; and is not Intellect? asks the Philosopher. And yet, while the influence of the millionaire is instantly felt in all classes of society, how is it that “Noble Mind” so often leaves us unknown and unhonoured? Why have there been statesmen who have never ruled, and heroes who have never conquered? Why have glorious philosophers died in a garret? and why have there been poets whose only admirer has been Nature in her echoes? It must be that these beings have thought only of themselves, and, constant and elaborate students of their own glorious natures, have forgotten or disdained the study of all others. Yes! we must mix with the herd; we must enter into their feelings; we must humour their weaknesses; we must sympathise with the sorrows that we do not feel; and share the merriment of fools. Oh, yes! to rule men, we must be men; to prove that we are strong, we must be weak; to prove that we are giants, we must be dwarfs; even as the Eastern Genie was hid in the charmed bottle. Our wisdom must be concealed under folly, and our constancy under caprice. \\n\\n \\n\\n “I have been often struck by the ancient tales of Jupiter’s visits to the earth. In these fanciful adventures, the god bore no indication of the Thunderer’s glory; but was a man of low estate, a herdsman, a hind, often even an animal. A mighty spirit has in Tradition, Time’s great moralist, perused ‘the wisdom of the ancients.’ Even in the same spirit, I would explain Jove’s terrestrial visitings. For, to govern man, even the god appeared to feel as a man; and sometimes as a beast, was apparently influenced by their vilest passions. Mankind, then, is my great game. \\n\\n \\n\\n “At this moment, how many a powerful noble wants only wit to be a Minister; and what wants Vivian Grey to attain the same end? That noble’s influence. When two persons can so materially assist each other, why are they not brought together? Shall I, because my birth baulks my fancy, shall I pass my life a moping misanthrope in an old chateau? Supposing I am in contact with this magnifico, am I prepared? Now, let me probe my very soul. Does my cheek blanch? I have the mind for the conception; and I can perform right skilfully upon the most splendid of musical instruments, the human voice, to make those conceptions beloved by others. There wants but one thing more: courage, pure, perfect courage; and does Vivian Grey know fear?” He laughed an answer of bitterest derision. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1408/42231.html","bookId":1393,"book":{"id":1393,"title":"Vivian Grey","description":"简介： We are not aware that the infancy of Vivian Grey was distinguished by any extraordinary incident. The solicitude of the most affectionate of mothers and the care of the most attentive of nurses did their best to injure an excellent constitution....","cover":"http://novel.tingroom.com/file/upload/201510/26/09-11-11-43-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1408","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
