{"id":67156,"no":3,"title":"Page 3","content":"He felt a brief blast of air on both eyes, and blinked instinctively. A printed strip of paper clicked out. The corpsman tore it off, glanced at it.\\n\\n \"That\u0027s fine, Dr. Johnson. If you would come this way ...\" \"I\u0027d like some information from you,\" Norman said. \"I\u0027d like to know what\u0027s going on.\"\\n\\n \"I understand, sir, but I have to finish your workup in time for your next briefing at seventeen hundred hours.\"\\n\\n Norman lay on his back, and technicians stuck needles in both arms, and another in his leg at the groin. He yelled in sudden pain.\\n\\n \"That\u0027s the worst of it, sir,\" the corpsman said, packing the syringes in ice. \"If you will just press this cotton against it, here ...\"\\n\\n There was a clip over his nostrils, a mouthpiece between his teeth.\\n\\n \"This is to measure your CO2\" the corpsman said. \"Just exhale. That\u0027s right. Big breath, now exhale. ...\"\\n\\n Norman exhaled. He watched a rubber diaphragm inflate, pushing a needle up a scale.\\n\\n \"Try it again, sir. I\u0027m sure you can do better than that.\" Norman didn\u0027t think he could, but he tried again anyway. Another corpsman entered the room, with a sheet of paper covered with figures. \"Here are his BC\u0027s,\" he said.\\n\\n The first corpsman frowned. \"Has Barnes seen this?\"\\n\\n \"Yes.\"\\n\\n \"And what\u0027d he say?\"\\n\\n \"He said it was okay. He said to continue.\"\\n\\n \"Okay, fine. He\u0027s the boss.\" The first corpsman turned back to Norman. \"Let\u0027s try one more big breath, Dr. Johnson, if you would. ...\"\\n\\n Metal calipers touched his chin and his forehead. A tape went around his head. Now the calipers measured from his ear to his chin.\\n\\n \"What\u0027s this for?\" Norman said.\\n\\n \"Fitting you with a helmet, sir.\"\\n\\n \"Shouldn\u0027t I be trying one on?\"\\n\\n \"This is the way we do it, sir.\"\\n\\n Dinner was macaroni and cheese, burned underneath. Norman pushed it aside after a few bites.\\n\\n The corpsman appeared at his door. \"Time for the seventeen-hundred-hours briefing, sir.\"\\n\\n \"I\u0027m not going anywhere,\" Norman said, \"until I get some answers. What the hell is all this you\u0027re doing to me?\"\\n\\n \"Routine deepsat workup, sir. Navy regs require it before you go down.\"\\n\\n \"And why am I off the graph?\"\\n\\n \"Sorry, sir?\"\\n\\n \"You said I was off the graph.\"\\n\\n \"Oh, that. You\u0027re a bit heavier than the Navy tables figure for, sir.\"\\n\\n \"Is there a problem about my weight?\"\\n\\n \"Shouldn\u0027t be, no, sir.\"\\n\\n \"And the other tests, what did they show?\"\\n\\n \"Sir, you are in very good health for your age and lifestyle.\"\\n\\n \"And what about going down there?\" Norman asked, half hoping he wouldn\u0027t be able to go.\\n\\n \"Down there? I\u0027ve talked with Captain Barnes. Shouldn\u0027t be any problem at all, sir. If you\u0027ll just come this way to the briefing, sir ...\"\\n\\n The others were sitting around in the briefing room, with Styrofoam cups of coffee. Norman felt glad to see them. He dropped into a chair next to Harry. \"Jesus, did you have the damn physical?\"\\n\\n \"Yeah,\" he said. \"Had it yesterday.\"\\n\\n \"They stuck me in the leg with this long needle,\" Norman said.\\n\\n \"Really? They didn\u0027t do that to me.\"\\n\\n \"And how about breathing with that clip on your nose?\"\\n\\n \"I didn\u0027t do that, either,\" Harry said. \"Sounds like you got some special treatment, Norman.\"\\n\\n Norman was thinking the same thing, and he didn\u0027t like the implications. He felt suddenly tired.\\n\\n \"All right, men, we\u0027ve got a lot to cover and just three hours to do it,\" a brisk man said, turning off the lights as he came into the room. Norman hadn\u0027t even gotten a good look at him. Now it was just a voice in the dark. \"As you know, Dalton\u0027s law governs partial pressures of mixed gases, or, as represented here in algebraic form ...\"\\n\\n The first of the graphs flashed up.\\n\\n PPa \u003d Ptot x % Vola\\n\\n \"Now let\u0027s review how calculation of the partial pressure might be done in atmospheres absolute, which is the most common procedure we employ - \"\\n\\n The words were meaningless to Norman. He tried to pay attention, but as the graphs continued and the voice droned on, his eyes grew heavier and he fell asleep.\\n\\n \" - be taken down in the submarine and once in the habitat module you will be pressurized to thirty-three atmospheres. At that time you will be switched over to mixed gases, since it is not possible to breathe Earth atmosphere beyond eighteen atmospheres - \"\\n\\n Norman stopped listening. These technical details only filled him with dread. He went back to sleep, awakening only intermittently.\\n\\n \" - since oxygen toxicity only occurs when the PO2 exceeds point 7 ATA for prolonged periods -\\n\\n \" - nitrogen narcosis, in which nitrogen behaves like an anesthetic, will occur in mixed-gas atmospheres if partial pressures exceeds 1.5 ATA in the DDS -\\n\\n \" - demand open circuit is generally preferable, but you will be using semiclosed circuit with inspired fluctuations of 608 to 760 millimeters - \"\\n\\n He went back to sleep.\\n\\n When it was over, they walked back to their rooms. \"Did I miss anything?\" Norman said.\\n\\n \"Not really.\" Harry shrugged. \"Just a lot of physics.\"\\n\\n In his tiny gray room, Norman got into bed. The glowing wall clock said 2300. It took him a while to figure out that that was 11:00 p.m. In nine more hours, he thought, I will begin the descent.\\n\\n Then he slept.\\n\\n THE DEEP\\n\\n DESCENT\\n\\n In the morning light, the submarine Charon V bobbed on the surface, riding on a pontoon platform. Bright yellow, it looked like a child\u0027s bathtub toy sitting on a deck of oildrums.\\n\\n A rubber Zodiac launch took Norman over, and he climbed onto the platform, shook hands with the pilot, who could not have been more than eighteen, younger than his son, Tim.\\n\\n \"Ready to go, sir?\" the pilot said.\\n\\n \"Sure,\" Norman said. He was as ready as he would ever be.\\n\\n Up close, the sub did not look like a toy. It was incredibly massive and strong. Norman saw a single porthole of curved acrylic. It was held in place by bolts as big as his fist. He touched them, tentatively.\\n\\n The pilot smiled. \"Want to kick the tires, sir?\"\\n\\n \"No, I\u0027ll trust you.\"\\n\\n \"Ladder\u0027s this way, sir.\"\\n\\n Norman climbed the narrow rungs to the top of the sub, and saw the small circular hatch opening. He hesitated.\\n\\n \"Sit on the edge here,\" the pilot said, \"and drop your legs in, then follow it down. You may have to squeeze your shoulders together a bit and suck in your ... That\u0027s it, sir.\" Norman wriggled through the tight hatch into an interior so low he could not stand. The sub was crammed with dials and machinery. Ted was already aboard, hunched in the back, grinning like a kid. \"Isn\u0027t this fantastic?\"\\n\\n Norman envied his easy enthusiasm; he felt cramped and a little nervous. Above him, the pilot clanged the heavy hatch shut and dropped down to take the controls. \"Everybody okay?\"\\n\\n They nodded.\\n\\n \"Sorry about the view,\" the pilot said, glancing over his shoulders. \"You gentlemen are mostly going to be seeing my hindquarters. Let\u0027s get started. Mozart okay?\" He pressed a tape deck and smiled. \"We\u0027ve got thirteen minutes\u0027 descent to the bottom; music makes it a little easier. If you don\u0027t like Mozart, we can offer you something else.\"\\n\\n \"Mozart\u0027s fine,\" Norman said.\\n\\n \"Mozart\u0027s wonderful,\" Ted said. \"Sublime.\"\\n\\n \"Very good, gentlemen.\" The submarine hissed. There was squawking on the radio. The pilot spoke softly into a headset. A scuba diver appeared at the porthole, waved. The pilot waved back.\\n\\n There was a sloshing sound, then a deep rumble, and they started down.\\n\\n \"As you see, the whole sled goes under,\" the pilot explained. \"The sub\u0027s not stable on the surface, so we sled her up and down. We\u0027ll leave the sled at about a hundred feet or so.\\n\\n Through the porthole, they saw the diver standing on the deck, the water now waist-deep. Then the water covered the porthole. Bubbles came out of the diver\u0027s scuba.\\n\\n \"We\u0027re under,\" the pilot said. He adjusted valves above his head and they heard the hiss of air, startlingly loud. More gurgling. The light in the submarine from the porthole was a beautiful blue.\\n\\n \"Lovely,\" Ted said.\\n\\n \"We\u0027ll leave the sled now,\" the pilot said. Motors rumbled and the sub moved forward, the diver slipping off to one side. Now there was nothing to be seen through the porthole but undifferentiated blue water. The pilot said something on the radio, and turned up the Mozart.\\n\\n \"Just sit back, gentlemen,\" he said. \"Descending eighty feet a minute.\"\\n\\n Norman felt the rumble of the electric motors, but there was no real sense of motion. All that happened was that it got darker and darker.\\n\\n \"You know,\" Ted said, \"we\u0027re really quite lucky about this site. Most parts of the Pacific are so deep we\u0027d never be able to visit it in person.\" He explained that the vast Pacific Ocean, which amounted to half the total surface area of the Earth, had an average depth of two miles. \"There are only a few places where it is less. One is the relatively small rectangle bounded by Samoa, New Zealand, Australia, and New Guinea, which is actually a great undersea plain, like the plains of the American West, except it\u0027s at an average depth of two thousand feet. That\u0027s what we are doing now, descending to that plain.\"\\n\\n Ted spoke rapidly. Was he nervous? Norman couldn\u0027t tell: he was feeling his own heart pound. Now it was quite dark outside; the instruments glowed green. The pilot flicked on red interior lights.\\n\\n Their descent continued. \"Four hundred feet.\" The submarine lurched, then eased forward. \"This is the river.\"\\n\\n \"What river?\" Norman said.\\n\\n \"Sir, we are in a current of different salinity and temperature; it behaves like a river inside the ocean. We traditionally stop about here, sir; the sub sticks in the river, takes us for a little ride.\"\\n\\n \"Oh yes,\" Ted said, reaching into his pocket. Ted handed the pilot a ten-dollar bill.\\n\\n Norman glanced questioningly at Ted.\\n\\n \"Didn\u0027t they mention that to you? Old tradition. You always pay the pilot on your way down, for good luck.\"\\n\\n \"I can use some luck,\" Norman said. He fumbled in his pocket, found a five-dollar bill, thought better of it, took out a twenty instead.\\n\\n \"Thank you, gentlemen, and have a good bottom stay, both of you,\" the pilot said.\\n\\n The electric motors cut back in.\\n\\n The descent continued. The water was dark. \"Five hundred feet,\" he said. \"Halfway there.\"\\n\\n The submarine creaked loudly, then made several explosive pops. Norman was startled.\\n\\n \"That\u0027s normal pressure adjustment,\" the pilot said. \"No problem.\"\\n\\n \"Uh-huh,\" Norman said. He wiped sweat on his shirtsleeve. It seemed that the interior of the submarine was now much smaller, the walls closer to his face.\\n\\n \"Actually,\" Ted said, \"if I remember, this particular region of the Pacific is called the Lau Basin, isn\u0027t that right?\"\\n\\n \"That\u0027s right, sir, the Lau Basin.\"\\n\\n \"It\u0027s a plateau between two undersea ridges, the South Fiji or Lau Ridge to the west, and the Tonga Ridge to the east.\"\\n\\n \"That\u0027s correct, Dr. Fielding.\"\\n\\n Norman glanced at the instruments. They were covered with moisture. The pilot had to rub the dials with a cloth to read them. Was the sub leaking? No, he thought. Just condensation. The interior of the submarine was growing colder. Take it easy, he told himself.\\n\\n \"Eight hundred feet,\" the pilot said. It was now completely black outside.\\n\\n \"This is very exciting,\" Ted said. \"Have you ever done anything like this before, Norman?\"\\n\\n \"No,\" Norman said.\\n\\n \"Me, neither,\" Ted said. \"What a thrill.\" Norman wished he would shut up.\\n\\n \"You know,\" Ted said, \"when we open this alien craft up and make our first contact with another form of life, it\u0027s going to be a great moment in the history of our species on Earth. I\u0027ve been wondering about what we should say.\"\\n\\n \"Say?\"\\n\\n \"You know, what words. At the threshold, with the cameras rolling.\"\\n\\n \"Will there be cameras?\"\\n\\n \"Oh, I\u0027m sure there\u0027ll be all sorts of documentation. It\u0027s only proper, considering. So we need something to say, a memorable phrase. I was thinking of \"This is a momentous moment in human history.\u0027 \"\\n\\n \"Momentous moment?\" Norman said, frowning.\\n\\n \"You\u0027re right,\" Ted said. \"Awkward, I agree. Maybe \u0027A turning point in human history\u0027?\"\\n\\n Norman shook his head.\\n\\n \"How about \u0027A crossroads in the evolution of the human species\u0027?\"\\n\\n \"Can evolution have a crossroads?\"\\n\\n \"I don\u0027t see why not,\" Ted said.\\n\\n \"Well, a crossroads is a crossing of roads. Is evolution a road? I thought it wasn\u0027t; I thought evolution was undirected.\"\\n\\n \"You\u0027re being too literal,\" Ted said.\\n\\n \"Reading the bottom,\" the pilot said. \"Nine hundred feet.\" He slowed the descent. They heard the intermittent ping of sonar.\\n\\n Ted said, \" \u0027A new threshold in the evolution of the human species\u0027?\"\\n\\n \"Sure. Think it will be?\"\\n\\n \"Will be what?\"\\n\\n \"A new threshold.\"\\n\\n \"Why not?\" Ted said.\\n\\n \"What if we open it up and it\u0027s just a lot of rusted junk inside, and nothing valuable or enlightening at all?\"\\n\\n \"Good point,\" Ted said.\\n\\n \"Nine hundred fifty feet. Exterior lights are on,\" the pilot said.\\n\\n Through the porthole they saw white flecks. The pilot explained this was suspended matter in the water.\\n\\n \"Visual contact. I have bottom.\"\\n\\n \"Oh, let\u0027s see!\" Ted said. The pilot obligingly shifted to one side and they looked.\\n\\n Norman saw a flat, dead, dull-brown plain stretching away to the limit of the lights. Blackness beyond.\\n\\n \"Not much to look at right here, I\u0027m afraid,\" the pilot said.\\n\\n \"Surprisingly dreary,\" Ted said, without a trace of disappointment. \"I would have expected more life.\"\\n\\n \"Well, it\u0027s pretty cold. Water temperature is, ah, thirty-six degrees Fahrenheit.\"\\n\\n \"Almost freezing,\" Ted said.\\n\\n \"Yes, sir. Let\u0027s see if we can find your new home.\"\\n\\n The motors rumbled. Muddy sediment churned up in front of the porthole. The sub turned, moved across the bottom. For several minutes they saw only the brown landscape.\\n\\n Then lights. \"There we are.\"\\n\\n A vast underwater array of lights, arranged in a rectangular pattern.\\n\\n \"That\u0027s the grid,\" the pilot said.\\n\\n The submarine planed up, and glided smoothly over the illuminated grid, which extended into the distance for half a mile. Through the porthole, they saw divers standing on the bottom, working within the grid structure. The divers waved to the passing sub. The pilot honked a toy horn.\\n\\n \"They can hear that?\"\\n\\n \"Oh sure. Water\u0027s a great conductor.\"\\n\\n \"My God,\" Ted said.\\n\\n Directly ahead the giant titanium fin rose sharply above the ocean floor. Norman was completely unprepared for its dimension; as the submarine moved to port, the fin blocked their entire field of view for nearly a minute. The metal was dull gray and, except for small white speckles of marine growth, entirely unmarked.\\n\\n \"There isn\u0027t any corrosion,\" Ted said.\\n\\n \"No, sir,\" the pilot said. \"Everybody\u0027s mentioned that. They think it\u0027s because it\u0027s a metal-plastic alloy, but I don\u0027t think anybody is quite sure.\"\\n\\n The fin slipped away to the stern; the submarine again turned. Directly ahead, more lights, arranged in vertical rows. Norman saw a single cylinder of yellow-painted steel, and bright portholes. Next to it was a low metal dome.\\n\\n \"That\u0027s DH-7, the divers\u0027 habitat, to port,\" the pilot said. \"It\u0027s pretty utilitarian. You guys are in DH-8, which is much nicer, believe me.\"\\n\\n He turned starboard, and after a momentary blackness, they saw another set of lights. Coming closer, Norman counted five different cylinders, some vertical, some horizontal, interconnected in a complex way.\\n\\n \"There you are. DH-8, your home away from home,\" the pilot said. \"Give me a minute to dock.\"\\n\\n Metal clanged against metal; there was a sharp jolt, and then the motors cut off. Silence. Hissing air. The pilot scrambled to open the hatch, and surprisingly cold air washed down on them.\\n\\n \"Airlock\u0027s open, gentlemen,\" he said, stepping aside. Norman looked up through the lock. He saw banks of red lights above. He climbed up through the submarine, and into a round steel cylinder approximately eight feet in diameter. On all sides there were handholds; a narrow metal bench; the glowing heat lamps overhead, though they didn\u0027t seem to do much good.\\n\\n Ted climbed up and sat on the bench opposite him. They were so close their knees touched. Below their feet, the pilot closed the hatch. They watched the wheel spin. They heard a clank as the submarine disengaged, then the whirr of motors as it moved away.\\n\\n Then nothing.\\n\\n \"What happens now?\" Norman said.\\n\\n \"They pressurize us,\" Ted said. \"Switch us over to exotic-gas atmosphere. We can\u0027t breathe air down here.\"\\n\\n \"Why not?\" Norman said. Now that he was down here, staring at the cold steel walls of the cylinder, he wished he had stayed awake for the briefing.\\n\\n \"Because,\" Ted said, \"the atmosphere of the Earth is deadly. You don\u0027t realize it, but oxygen is a corrosive gas. It\u0027s in the same chemical family as chlorine and fluorine, and hydrofluoric acid is the most corrosive acid known. The same quality of oxygen that makes a half-eaten apple turn brown, or makes iron rust, is incredibly destructive to the human body if exposed to too much of it. Oxygen under pressure is toxic - with a vengeance. So we cut down the amount of oxygen you breathe. You breathe twenty-one percent oxygen at the surface. Down here, you breathe two percent oxygen. But you won\u0027t notice any difference - \"\\n\\n A voice over a loudspeaker said, \"We\u0027re starting to pressurize you now.\"\\n\\n \"Who\u0027s that?\" Norman said.\\n\\n \"Barnes,\" the voice said. But it didn\u0027t sound like Barnes. It sounded gritty and artificial.\\n\\n \"It must be the talker,\" Ted said, and then laughed. His voice was noticeably higher-pitched. \"It\u0027s the helium, Norman. They\u0027re pressurizing us with helium.\"\\n\\n \"You sound like Donald Duck,\" Norman said, and he laughed, too. His own voice sounded squeaky, like a cartoon character\u0027s.\\n\\n \"Speak for yourself, Mickey,\" Ted squeaked.\\n\\n \"I taut I taw a puddy tat,\" Norman said. They were both laughing, hearing their voices.\\n\\n \"Knock it off, you guys,\" Barnes said over the intercom. \"This is serious.\"\\n\\n \"Yes, sir, Captain,\" Ted said, but by now his voice was so high-pitched it was almost unintelligible, and they fell into laughter again, their tinny voices like those of schoolgirls reverberating inside the steel cylinder.\\n\\n Helium made their voices high and squeaky. But it also had other effects.\\n\\n \"Getting chilled, boys?\" Barnes said.\\n\\n They were indeed getting colder. He saw Ted shivering, felt goosebumps on his own legs. It felt as if a wind were blowing across their bodies - except there wasn\u0027t any wind. The lightness of the helium increased evaporation, made them cold.\\n\\n Across the cylinder, Ted said something, but Norman couldn\u0027t understand Ted at all any more; his voice was too high-pitched to be comprehensible. It was just a thin squeal.\\n\\n \"Sounds like a couple of rats in there now,\" Barnes said, with satisfaction.\\n\\n Ted rolled his eyes toward the loudspeaker and squeaked something.\\n\\n \"If you want to talk, get a talker,\" Barnes said. \"You\u0027ll find them in the locker under the seat.\"\\n\\n Norman found a metal locker, clicked it open. The metal squealed loudly, like chalk on a blackboard. All the sounds in the chamber were high-pitched. Inside the locker he saw two black plastic pads with neck straps.\\n\\n \"Just slip them over your neck. Put the pad at the base of your throat.\"\\n\\n \"Okay,\" Ted said, and then blinked in surprise. His voice sounded slightly rough, but otherwise normal.\\n\\n \"These things must change the vocal-cord frequencies,\" Norman said.\\n\\n \"Why don\u0027t you guys pay attention to briefings?\" Barnes said. \"That\u0027s exactly what they do. You\u0027ll have to wear a talker all the time you\u0027re down here. At least, if you want anybody to understand you. Still cold?\"\\n\\n \"Yes,\" Ted said.\\n\\n \"Well, hang on, you\u0027re almost fully pressurized now.\" Then there was another hiss, and a side door slid open. Barnes stood there, with light jackets over his arm. \"Welcome to DH-8,\" he said.\\n\\n DH-8\\n\\n \"You\u0027re the last to arrive,\" Barnes said. \"We just have time for a quick tour before we open the spacecraft.\"\\n\\n \"You\u0027re ready to open it now?\" Ted asked. \"Wonderful. I\u0027ve just been talking about this with Norman. This is such a great moment, our first contact with alien life, we ought to prepare a little speech for when we open it up.\"\\n\\n \"There\u0027ll be time to consider that,\" Barnes said, with an odd glance at Ted. \"I\u0027ll show you the habitat first. This way.\" He explained that the DH-8 habitat consisted of five large cylinders, designated A to E. \"Cyl A is the airlock, where we are now.\" He led them into an adjacent changing room. Heavy cloth suits hung limply on the wall, alongside yellow sculpted helmets of the sort Norman had seen the divers wearing. The helmets had a futuristic look. Norman tapped one with his knuckles. It was plastic, and surprisingly light. He saw \"JOHNSON\" stenciled above one faceplate.\\n\\n \"We going to wear these?\" Norman asked.\\n\\n \"That\u0027s correct,\" Barnes said.\\n\\n \"Then we\u0027ll be going outside?\" Norman said, feeling a twinge of alarm.\\n\\n \"Eventually, yes. Don\u0027t worry about it now. Still cold?\"\\n\\n They were; Barnes had them change into tight-fitting jumpsuits of clinging blue polyester. Ted frowned. \"Don\u0027t you think these look a little silly?\"\\n\\n \"They may not be the height of fashion,\" Barnes said, \"but they prevent heat loss from helium.\"\\n\\n \"The color is unflattering,\" Ted said.\\n\\n \"Screw the color,\" Barnes said. He handed them light-weight jackets. Norman felt something heavy in one pocket, and pulled out a battery pack.\\n\\n \"The jackets are wired and electrically heated,\" Barnes said. \"Like an electric blanket, which is what you\u0027ll use for sleeping. Follow me.\"\\n\\n They went on to Cyl B, which housed power and life-support systems. At first glance, it looked like a large boiler room, all multicolored pipes and utilitarian fittings. \"This is where we generate all of our heat, power, and air,\" Barnes said. He pointed out the features: \"Closed-cycle IC generator, 240/110. Hydrogen-and-oxygen-driven fuel cells. LSS monitors. Liquid processor, runs on silver-zinc batteries. And that\u0027s Chief Petty Officer Fletcher. Teeny Fletcher.\" Norman saw a big-boned figure, working back among the pipes with a heavy wrench. The figure turned; Alice Fletcher gave them a grin, waved a greasy hand.\\n\\n \"She seems to know what she\u0027s doing,\" Ted said, approvingly.\\n\\n \"She does,\" Barnes said. \"But all the major support systems are redundant. Fletcher is just our final redundancy. Actually, you\u0027ll find the entire habitat is self-regulating.\"\\n\\n He clipped heavy badges onto the jumpsuits. \"Wear these at all times, even though they\u0027re just a precaution: the alarms trigger automatically if life-support conditions go below optimum. But that won\u0027t happen. There are sensors in each room of the habitat. You\u0027ll get used to the fact that the environment continually adjusts to your presence. Lights will go on and off, heat lamps will turn on and off, and air vents will hiss to keep track of things. It\u0027s all automatic, don\u0027t sweat it. Every single major system is redundant. We can lose power, we can lose air, we can lose water entirely, and we will be fine for a hundred and thirty hours.\"\\n\\n One hundred and thirty hours didn\u0027t sound very long to Norman. He did the calculation in his head: five days. Five days didn\u0027t seem very long, either.\\n\\n They went into the next cylinder, the lights clicking on as they entered. Cylinder C contained living quarters: bunks, toilets, showers (\"plenty of hot water, you\u0027ll find\"). Barnes showed them around proudly, as if it were a hotel.\\n\\n The living quarters were heavily insulated: carpeted deck, walls and ceilings all covered in soft padded foam, which made the interior appear like an overstuffed couch. But, despite the bright colors and the evident care in decoration, Norman still found it cramped and dreary. The portholes were tiny, and they revealed only the blackness of the ocean outside. And wherever the padding ended, he saw heavy bolts and heavy steel plating, a reminder of where they really were. He felt as if he were inside a large iron lung - and, he thought, that isn\u0027t so far wrong.\\n\\n They ducked through narrow bulkheads into D Cyl: a small laboratory with benches and microscopes on the top level, a compact electronics unit on the level below.\\n\\n \"This is Tina Chan,\" Barnes said, introducing a very still woman. They all shook hands. Norman thought that Tina Chan was almost unnaturally calm, until he realized she was one of those people who almost never blinked their eyes.\\n\\n \"Be nice to Tina,\" Barnes was saying. \"She\u0027s our only link to the outside - she runs the com ops, and the sensor systems as well. In fact, all the electronics.\"\\n\\n Tina Chan was surrounded by the bulkiest monitors Norman had ever seen. They looked like TV sets from the 1950s. Barnes explained that certain equipment didn\u0027t do well in the helium atmosphere, including TV tubes. In the early days of undersea habitats, the tubes had to be replaced daily. Now they were elaborately coated and shielded; hence their bulk.\\n\\n Next to Chan was another woman, Jane Edmunds, whom Barnes introduced as the unit archivist.\\n\\n \"What\u0027s a unit archivist?\" Ted asked her.\\n\\n \"Petty Officer First Class, Data Processing, sir,\" she said formally. Jane Edmunds wore spectacles and stood stiffly. She reminded Norman of a librarian.\\n\\n \"Data Processing ...\" Ted said.\\n\\n \"My mission is to keep all the digital recordings, visual materials, and videotapes, sir. Every aspect of this historic moment is being recorded, and I keep everything neatly filed.\" Norman thought: She is a librarian.\\n\\n \"Oh, excellent,\" Ted said. \"I\u0027m glad to hear it. Film or tape?\"\\n\\n \"Tape, sir.\"\\n\\n \"I know my way around a video camera,\" Ted said, with a smile. \"What\u0027re you putting it down on, half-inch or threequarter?\"\\n\\n \"Sir, we use a datascan image equivalent of two thousand pixels per side - biased frame, each pixel carrying a twelvetone gray scale.\"\\n\\n \"Oh,\" Ted said.\\n\\n \"It\u0027s a bit better than commercial systems you may be familiar with, sir.\"\\n\\n \"I see,\" Ted said. But he recovered smoothly, and chatted with Edmunds for a while about technical matters.\\n\\n \"Ted seems awfully interested in how we\u0027re going to record this,\" Barnes said, looking uneasy.\\n\\n \"Yes, he seems to be.\" Norman wondered why that troubled Barnes. Was Barnes worried about the visual record? Or did he think Ted would try to hog the show? Would Ted try to hog the show? Did Barnes have any worries about having this appear to be a civilian operation?\\n\\n \"No, the exterior lights are a hundred-fifty-watt quartz halogen,\" Edmunds was saying. \"We\u0027re recording at equivalent of half a million ASA, so that\u0027s ample. The real problem is backscatter. We\u0027re constantly fighting it.\"\\n\\n Norman said, \"I notice your support team is all women.\"\\n\\n \"Yes,\" Barnes said. \"All the deep-diving studies show that women are superior for submerged operations. They\u0027re physically smaller and consume less nutrients and air, they have better social skills and tolerate close quarters better, and they are physiologically tougher and have better endurance.\\n\\n The fact is, the Navy long ago recognized that all their submariners should be female.\" He laughed. \"But just try to implement that one.\" He glanced at his watch. \"We\u0027d better move on. Ted?\"\\n\\n They went on. The final cylinder, E Cyl, was more spacious than the others. There were magazines, a television, and a large lounge; and on the deck below was an efficient mess and a kitchen. Seaman Rose Levy, the cook, was a redfaced woman with a Southern accent, standing beneath giant suction fans. She asked Norman whether he had any favorite desserts.\\n\\n \"Desserts?\"\\n\\n \"Yes sir, Dr. Johnson. I like to make everybody\u0027s favorite dessert, if I can. What about you, you have a favorite, Dr. Fielding?\"\\n\\n \"Key lime pie,\" Ted said. \"I love key lime pie.\"\\n\\n \"Can do, sir,\" Levy said, with a big smile. She turned back to Norman. \"I haven\u0027t heard yours yet, Dr. Johnson.\"\\n\\n \"Strawberry shortcake.\"\\n\\n \"Easy. Got some nice New Zealand strawberries coming down on the last sub shuttle. Maybe you\u0027d like that shortcake tonight?\"\\n\\n \"Why not, Rose,\" Barnes said heartily.\\n\\n Norman looked out the black porthole window. From the portholes of D Cyl, he could see the rectangular illuminated grid that extended across the bottom, following the half-mile-long buried spacecraft. Divers, illuminated like fireflies, moved over the glowing grid surface.\\n\\n Norman thought: I am a thousand feet beneath the surface of the ocean, and we are talking about whether we should have strawberry shortcake for dessert. But the more he thought about it, the more it made sense. The best way to make somebody comfortable in a new environment was to give him familiar food.\\n\\n \"Strawberries make me break out,\" Ted said.\\n\\n \"I\u0027ll make your shortcake with blueberries,\" Levy said, not missing a beat.\\n\\n \"And whipped cream?\" Ted said.\\n\\n \"Well ...\"\\n\\n \"You can\u0027t have everything,\" Barnes said. \"And one of the things you can\u0027t have at thirty atmospheres of mixed gas is whipped cream. Won\u0027t whip. Let\u0027s move on.\"\\n\\n Beth and Harry were waiting in the small, padded conference room, directly above the mess. They both wore jumpsuits and heated jackets. Harry was shaking his head as they arrived. \"Like our padded cell?\" He poked the insulated walls. \"It\u0027s like living in a vagina.\"\\n\\n Beth said, \"Don\u0027t you like going back to the womb, Harry?\"\\n\\n \"No,\" Harry said. \"I\u0027ve been there. Once was enough.\"\\n\\n \"These jumpsuits are pretty bad,\" Ted said, plucking at the clinging polyester.\\n\\n \"Shows your belly nicely,\" Harry said.\\n\\n \"Let\u0027s settle down,\" Barnes said.\\n\\n \"A few sequins, you could be Elvis Presley,\" Harry said.\\n\\n \"Elvis Presley\u0027s dead.\"\\n\\n \"Now\u0027s your chance,\" Harry said.\\n\\n Norman looked around. \"Where\u0027s Levine?\" \\n\\n","sourceLink":"https://allnovel.net/sphere/page-3.html","bookId":1715,"book":{"id":1715,"title":"Sphere","description":"Storyline: A group of American scientists are rushed to a huge vessel that has been discovered resting on the ocean floor in the middle of the South Pacific. What they find defines their imaginations and mocks their attempts at logical explanation. It is a spaceship of phenomenal dimensions, apparently, undamaged by its fall from the sky. And, most startling, it appears to be at least three hundred years old.... \\n \"The suspense is real.\" \\n THE NEW YORK TIMES BOOK REVIEW \\n \"A page-turner...Chichton\u0027s writing is cinematic, with powerful visual images and nonstop action. This book should come with hot buttered popcorn.\" \\n NEWSWEEK\\n","cover":"https://allnovel.net/images/sphere.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/sphere.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:03:36 AM"}}
