{"id":67160,"no":7,"title":"Page 7","content":"\"I guess it would have been appropriate for a robot to open it after all,\" Ted said thoughtfully. \"Maybe even fitting.\"\\n\\n \"Snug fitting,\" Beth said.\\n\\n \"Pipe fitting,\" Norman said.\\n\\n \"Sort of robot-to-robot, you mean?\" Harry said. \"Sort of a meeting of the threads and treads?\"\\n\\n \"Hey,\" Ted said. \"I don\u0027t make fun of your comments even when they\u0027re stupid.\"\\n\\n \"I wasn\u0027t aware they ever were,\" Harry said.\\n\\n \"You say foolish things sometimes. Thoughtless.\"\\n\\n \"Children,\" Barnes said, \"can we get back to the business at hand?\"\\n\\n \"Point it out the next time, Ted.\"\\n\\n \"I will.\"\\n\\n \"I\u0027ll be glad to know when I say something foolish.\"\\n\\n \"No problem.\"\\n\\n \"Something you consider foolish.\"\\n\\n \"Tell you what,\" Barnes said to Norman, \"when we go back to the surface, let\u0027s leave these two down here.\"\\n\\n \"Surely you can\u0027t think of going back now,\" Ted said.\\n\\n \"We\u0027ve already voted.\"\\n\\n \"But that was before we found the object.\"\\n\\n \"Where is the object?\" Harry said.\\n\\n \"Over here, Harry,\" Ted said, with a wicked grin. \"Let\u0027s see what your fabled powers of deduction make of this.\" They walked deeper into the room, moving among the giant hands and claws. And they saw, nestled in the padded claw of one hand, a large, perfectly polished silver sphere about thirty feet in diameter. The sphere had no markings or features of any kind.\\n\\n They moved around the sphere, seeing themselves reflected in the polished metal. Norman noticed an odd shifting iridescence, faint rainbow hues of blue and red, gleaming in the metal.\\n\\n \"It looks like an oversized ball bearing,\" Harry said.\\n\\n \"Keep walking, smart guy.\"\\n\\n On the far side, they discovered a series of deep, convoluted grooves, cut in an intricate pattern into the surface of the sphere. The pattern was arresting, though Norman could not immediately say why. The pattern wasn\u0027t geometric. And it wasn\u0027t amorphous or organic, either. It was hard to say what it was. Norman had never seen anything like it, and as he continued to look at it he felt increasingly certain this was a pattern never found on Earth. Never created by any man. Never conceived by a human imagination.\\n\\n Ted and Barnes were right. He felt sure of it.\\n\\n This sphere was something alien.\\n\\n PRIORITIES\\n\\n \"Huh,\" harry said, after staring in silence for a long time.\\n\\n \"I\u0027m sure you\u0027ll want to get back to us on this,\" Ted said. \"About where it came from, and so on.\"\\n\\n \"Actually, I know where it came from.\" And he told Ted about the star record, and the black hole.\\n\\n \"Actually,\" Ted said, \"I suspected that this ship was made to travel through a black hole for some time.\"\\n\\n \"Did you? What was your first clue?\"\\n\\n \"The heavy radiation shielding.\"\\n\\n Harry nodded. \"That\u0027s true. You probably guessed the significance of that before I did.\" He smiled. \"But you didn\u0027t tell anybody.\"\\n\\n \"Hey,\" Ted said, \"there\u0027s no question about it. I was the one who proposed the black hole first.\"\\n\\n \"You did?\"\\n\\n \"Yes. No question at all. Remember, in the conference room? I was explaining to Norman about space-time, and I started to do the calculations for the black hole, and then you joined in. Norman, you remember that? I proposed it first.\" Norman said, \"That\u0027s true, you had the idea.\"\\n\\n Harry grinned. \"I didn\u0027t feel that was a proposal. I thought it was more like a guess.\"\\n\\n \"Or a speculation. Harry,\" Ted said, \"you are rewriting history. There are witnesses.\"\\n\\n \"Since you\u0027re so far ahead of everybody else,\" Harry said, \"how about telling us your proposals for the nature of this object?\"\\n\\n \"With pleasure,\" Ted said. \"This object is a burnished sphere approximately ten meters in diameter, not solid, and composed of a dense metal alloy of an as-yet-unknown nature. The cabalistic markings on this side - \"\\n\\n \" - These grooves are what you\u0027re calling cabalistic?\"\\n\\n \" - Do you mind if I finish? The cabalistic markings on this side clearly suggest artistic or religious ornamentation, evoking a ceremonial quality. This indicates the object has significance to whoever made it.\"\\n\\n \"I think we can be sure that\u0027s true.\"\\n\\n \"Personally, I believe that this sphere is intended as a form of contact with us, visitors from another star, another solar system. It is, if you will, a greeting, a message, or a trophy. A proof that a higher form of life exists in the universe.\"\\n\\n \"All well and good and beside the point,\" Harry said. \"What does it do?\"\\n\\n \"I\u0027m not sure it does anything. I think it just is. It is what it is.\\n\\n \"Very Zen.\"\\n\\n \"Well, what\u0027s your idea?\"\\n\\n \"Let\u0027s review what we know,\" Harry said, \"as opposed to what we imagine in a flight of fancy. This is a spacecraft from the future, built with all sorts of materials and technology we haven\u0027t developed yet, although we are about to develop them. This ship was sent by our descendants through a black hole and into another universe, or another part of our universe.\"\\n\\n \"Yes.\"\\n\\n \"This spacecraft is unmanned, but equipped with robot arms which are clearly designed to pick up things that it finds. So we can think of this ship as a huge version of the unmanned Mariner spacecraft that we sent in the 1970s to Mars, to look for life there. This spacecraft from the future is much bigger, and more complicated, but it\u0027s essentially the same sort of machine. It\u0027s a probe.\"\\n\\n \"Yes ...\\n\\n \"So the probe goes into another universe, where it comes upon this sphere. Presumably it finds the sphere floating in space. Or perhaps the sphere is sent out to meet the spacecraft.\"\\n\\n \"Right,\" Ted said. \"Sent out to meet it. As an emissary. That\u0027s what I think.\"\\n\\n \"In any case, our robot spacecraft, according to whatever built-in criteria it has, decides that this sphere is interesting. It automatically grabs the sphere in its big claw hand here, draws it inside the ship, and brings it home.\"\\n\\n \"Except in going home it goes too far, it goes into the past.\"\\n\\n \"Its past,\" Harry said. \"Our present.\"\\n\\n \"Right.\"\\n\\n Barnes snorted impatiently. \"Fine, so this spacecraft goes out and picks up a silver alien sphere and brings it back. Get to the point: what is this sphere?\"\\n\\n Harry walked forward to the sphere, pressed his ear against the metal, and rapped it with his knuckles. He touched the grooves, his hands disappearing in the deep indentations. The sphere was so highly polished Norman could see Harry\u0027s face, distorted, in the curve of the metal. \"Yes. As I suspected. These cabalistic markings, as you call them, are not decorative at all. They have another purpose entirely, to conceal a small break in the surface of the sphere. Thus they represent a door.\" Harry stepped back.\\n\\n \"What is the sphere?\"\\n\\n \"I\u0027ll tell you what I think,\" Harry said. \"I think this sphere is a hollow container, I think there\u0027s something inside, and I think it scares the hell out of me.\"\\n\\n FIRST EVALUATION\\n\\n \"No, Mr. Secretary,\" Barnes said into the phone. \"We\u0027re pretty sure it is an alien artifact. There doesn\u0027t seem to be any question about that.\"\\n\\n He glanced at Norman, sitting across the room. \"Yes, sir,\" Barnes said. \"Very damn exciting.\"\\n\\n They were back in the habitat, and Barnes had immediately called Washington. He was trying to delay their return to the surface.\\n\\n \"Not yet, we haven\u0027t opened it. Well, we haven\u0027t been able to open it. The door is a weird shape and it\u0027s very finely milled. ... No, you couldn\u0027t wedge anything in the crack.\" He looked at Norman, rolled his eyes.\\n\\n \"No, we tried that, too. There don\u0027t seem to be any exterior controls. No, no message on the outside. No, no labels either. All it is, is a highly polished sphere with some convoluted grooves on one side. What? Blast it open?\"\\n\\n Norman turned away. He was in D Cylinder, in the communications section run by Tina Chan. She was adjusting a dozen monitors with her usual calm. Norman said, \"You seem like the most relaxed person here.\"\\n\\n She smiled. \"Just inscrutable, sir.\"\\n\\n \"Is that it?\"\\n\\n \"It must be, sir,\" she said, adjusting the vertical gain on one rolling monitor. The screen showed the polished sphere. \"Because I feel my heart pounding, sir. What do you think is inside that thing?\"\\n\\n \"I haven\u0027t any idea,\" Norman said.\\n\\n \"Do you think there\u0027s an alien inside? You know, some kind of a living creature?\"\\n\\n \"Maybe.\"\\n\\n \"And we\u0027re trying to open it up? Maybe we shouldn\u0027t let it out, whatever is in there.\"\\n\\n \"Aren\u0027t you curious?\" Norman said.\\n\\n \"Not that curious, sir.\"\\n\\n \"I don\u0027t see how blasting would work,\" Barnes was saying on the phone. \"Yes, we have SMTMP\u0027s, yes. Oh, different sizes. But I don\u0027t think we can blast the sucker open. No. Well, if you saw it, you\u0027d understand. The thing is perfectly made. Perfect.\"\\n\\n Tina adjusted a second monitor. They had two views of the sphere, and soon there would be a third. Edmunds was setting up cameras to watch the sphere. That had been one of Harry\u0027s suggestions. Harry had said, \"Monitor it. Maybe it does something from time to time, has some activity.\"\\n\\n On the screen, he saw the network of wires that had been attached to the sphere. They had a full array of passive sensors: sound, and the full electromagnetic spectrum from infrared to gamma and X-rays. The readouts on the sensors were displayed on a bank of instruments to the left.\\n\\n Harry came in. \"Getting anything yet?\"\\n\\n Tina shook her head. \"So far, nothing.\"\\n\\n \"Has Ted come back?\"\\n\\n \"No,\" Norman said. \"Ted\u0027s still there.\"\\n\\n Ted had remained behind in the cargo bay, ostensibly to help Edmunds set up the cameras. But in fact they knew he would try to open the sphere. They saw Ted now on the second monitor, probing the grooves, touching, pushing.\\n\\n Harry smiled. \"He hasn\u0027t got a prayer.\"\\n\\n Norman said, \"Harry, remember when we were in the flight deck, and you said you wanted to make out your will because something was missing?\"\\n\\n \"Oh, that,\" Harry said. \"Forget it. That\u0027s irrelevant now.\"\\n\\n Barnes was saying, \"No, Mr. Secretary, raising it to the surface would be just about impossible - well, sir, it is presently located inside a cargo bay half a mile inside the ship, and the ship is buried under thirty feet of coral, and the sphere itself is a good thirty feet across, it\u0027s the size of a small house. ...\\n\\n \"I just wonder what\u0027s in the house,\" Tina said.\\n\\n On the monitor, Ted kicked the sphere in frustration.\\n\\n \"Not a prayer,\" Harry said again. \"He\u0027ll never get it open.\"\\n\\n Beth came in. \"How are we going to open it?\"\\n\\n Harry said, \"How?\" Harry stared thoughtfully at the sphere, gleaming on the monitor. There was a long silence. \"Maybe we can\u0027t.\"\\n\\n \"We can\u0027t open it? You mean not ever?\"\\n\\n \"That\u0027s one possibility.\"\\n\\n Norman laughed. \"Ted would kill himself.\"\\n\\n Barnes was saying, \"Well, Mr. Secretary, if you wanted to commit the necessary Navy resources to do a full-scale salvage from one thousand feet, we might be able to undertake it starting six months from now, when we were assured of a month of good surface weather in this region. Yes ... it\u0027s winter in the South Pacific now. Yes.\"\\n\\n Beth said, \"I can see it now. At great expense, the Navy brings a mysterious alien sphere to the surface. It is transported to a top-secret government installation in Omaha. Experts from every branch come and try to open it. Nobody can.\"\\n\\n \"Like Excalibur,\" Norman said.\\n\\n Beth said, \"As time goes by, they try stronger and stronger methods. Eventually they try to blow it open with a small nuclear device. And still nothing. Finally, nobody has any more ideas. The sphere sits there. Decades go by. The sphere is never opened.\" She shook her head. \"One great frustration for mankind ...\"\\n\\n Norman said to Harry, \"Do you really think that\u0027d happen? That we\u0027d never get it open?\"\\n\\n Harry said, \"Never is a long time.\"\\n\\n \"No, sir,\" Barnes was saying, \"given this new development, we\u0027ll stay down to the last minute. Weather topside is holding - at least six more hours, yes, sir, from the Metsat reports - well, I have to rely on that judgment. Yes, sir. Hourly; yes, sir.\"\\n\\n He hung up, turned to the group. \"Okay. We have authorization to stay down six to twelve hours more, as long as the weather holds. Let\u0027s try to open that sphere in the time remaining.\"\\n\\n \"Ted\u0027s working on it now,\" Harry said.\\n\\n On the video monitor, they saw Ted Fielding slap the polished sphere with his hand and shout, \"Open! Open Sesame! Open up, you son of a bitch!\"\\n\\n The sphere did not respond.\\n\\n \"THE ANTHROPOMORPHIC PROBLEM\"\\n\\n \"Seriously,\" Norman said, \"I think somebody has to ask the question: should we consider not opening it up?\"\\n\\n \"Why?\" Barnes said. \"Listen, I just got off the phone - \"\\n\\n \" - I know,\" Norman said. \"But maybe we should think twice about this.\" Out of the corner of his eye, he saw Tina nodding vigorously. Harry looked skeptical. Beth rubbed her eyes, sleepy.\\n\\n \"Are you afraid, or do you have a substantive argument?\" Barnes said.\\n\\n \"I have the feeling,\" Harry said, \"that Norman\u0027s about to quote from his own work.\"\\n\\n \"Well, yes,\" Norman admitted. \"I did put this in my report.\"\\n\\n In his report, he had called it \"the Anthropomorphic Problem.\" Basically, the problem was that everybody who had ever thought or written about extraterrestrial life imagined that life as essentially human. Even if the extraterrestrial life didn\u0027t look human - if it was a reptile, or a big insect, or an intelligent crystal - it still acted in a human way. \"You\u0027re talking about the movies,\" Barnes said.\\n\\n \"I\u0027m talking about research papers, too. Every conception of extraterrestrial life, whether by a movie maker or a university professor, has been basically human - assuming human values, human understanding, human ways of approaching a humanly understandable universe. And generally a human appearance - two eyes, a nose, a mouth, and so on.\"\\n\\n \"So?\"\\n\\n \"So,\" Norman said, \"that\u0027s obviously nonsense. For one thing, there\u0027s enough variation in human behavior to make understanding just within our own species very troublesome. The differences between, say, Americans and Japanese are very great. Americans and Japanese don\u0027t really look at the world the same way at all.\"\\n\\n \"Yes, yes,\" Barnes said impatiently. \"We all know the Japanese are different - \"\\n\\n \" - And when you come to a new life form, the differences may be literally incomprehensible. The values and ethics of this new form of life may be utterly different.\"\\n\\n \"You mean it may not believe in the sanctity of life, or \u0027Thou shalt not kill,\u0027 \" Barnes said, still impatient.\\n\\n \"No,\" Norman said. \"I mean that this creature may not be able to be killed, and so it may have no concept of killing in the first place.\"\\n\\n Barnes stopped. \"This creature may not be able to be killed?\"\\n\\n Norman nodded. \"As someone once said, you can\u0027t break the arms of a creature that has no arms.\"\\n\\n \"It can\u0027t be killed? You mean it\u0027s immortal?\"\\n\\n \"I don\u0027t know,\" Norman said. \"That\u0027s the point.\"\\n\\n \"I mean, Jesus, a thing that couldn\u0027t be killed,\" Barnes said. \"How would we kill it?\" He bit his lip. \"I wouldn\u0027t like to open that sphere and release a thing that couldn\u0027t be killed.\"\\n\\n Harry laughed. \"No promotions for that one, Hal.\" Barnes looked at the monitors, showing several views of the polished sphere. Finally he said, \"No, that\u0027s ridiculous. No living thing is immortal. Am I right, Beth?\"\\n\\n \"Actually, no,\" Beth said. \"You could argue that certain living creatures on our own planet are immortal. For example, single-celled organisms like bacteria and yeasts are apparently capable of living indefinitely.\"\\n\\n \"Yeasts.\" Barnes snorted. \"We\u0027re not talking about yeasts.\"\\n\\n \"And to all intents and purposes a virus could be considered immortal.\"\\n\\n \"A virus?\" Barnes sat down in a chair. He hadn\u0027t considered a virus. \"But how likely is it, really? Harry?\"\\n\\n \"I think,\" Harry said, \"that the possibilities go far beyond what we\u0027ve mentioned so far. We\u0027ve only considered threedimensional creatures, of the kind that exist in our threedimensional universe - or, to be more precise, the universe that we perceive as having three dimensions. Some people think our universe has nine or eleven dimensions.\"\\n\\n Barnes looked tired.\\n\\n \"Except the other six dimensions are very small, so we don\u0027t notice them.\"\\n\\n Barnes rubbed his eyes.\\n\\n \"Therefore this creature,\" Harry continued, \"may be multidimensional, so that it literally does not exist - at least not entirely - in our usual three dimensions. To take the simplest case, if it were a four-dimensional creature, we would only see part of it at any time, because most of the creature would exist in the fourth dimension. That would obviously make it difficult to kill. And if it were a five-dimensional creature - \"\\n\\n \" - Just a minute. Why haven\u0027t any of you mentioned this before?\"\\n\\n \"We thought you knew,\" Harry said.\\n\\n \"Knew about five-dimensional creatures that can\u0027t be killed? Nobody said a word to me.\" He shook his head. \"Opening this sphere could be incredibly dangerous.\"\\n\\n \"It could, yes.\"\\n\\n \"What we have here is, we have Pandora\u0027s box.\"\\n\\n \"That\u0027s right.\"\\n\\n \"Well,\" Barnes said. \"Let\u0027s consider worst cases. What\u0027s the worst case for what we might find?\"\\n\\n Beth said, \"I think that\u0027s clear. Irrespective of whether it\u0027s a multidimensional creature or a virus or whatever, irrespective of whether it shares our morals or has no morals at all, the worst case is that it hits us below the belt.\"\\n\\n \"Meaning?\"\\n\\n \"Meaning that it behaves in a way that interferes with our basic life mechanisms. A good example is the AIDS virus. The reason why AIDS is so dangerous is not that it\u0027s new. We get new viruses every year - every week. And all viruses work in the same way: they attack cells and convert the machinery of the cells to make more viruses. What makes the AIDS virus dangerous is, it attacks the specific cells that we use to defend against viruses. AIDS interferes with our basic defense mechanism. And we have no defense against it.\"\\n\\n \"Well,\" Barnes said, \"if this sphere contains a creature that interferes with our basic mechanisms - what would that creature be like?\"\\n\\n \"It could breathe in air and exhale cyanide gas,\" Beth said. \"It could excrete radioactive waste,\" Harry said.\\n\\n \"It could disrupt our brain waves,\" Norman said. \"Interfere with our ability to think.\"\\n\\n \"Or,\" Beth said, \"it might merely disrupt cardiac conduction. Stop our hearts from beating.\"\\n\\n \"It might produce a sound vibration that would resonate in our skeletal system and shatter our bones,\" Harry said. He smiled at the others. \"I rather like that one.\"\\n\\n \"Clever,\" Beth said. \"But, as usual, we\u0027re only thinking of ourselves. The creature might do nothing directly harmful to us at all.\"\\n\\n \"Ah,\" Barnes said.\\n\\n \"It might simply exhale a toxin that kills chloroplasts, so that plants could no longer convert sunlight. Then all the plants on Earth would die - and consequently all life on Earth would die.\"\\n\\n \"Ah,\" Barnes said.\\n\\n \"You see,\" Norman said, \"at first I thought the Anthropomorphic Problem - the fact that we can only conceive of extraterrestrial life as basically human - I thought it was a failure of imagination. Man is man, all he knows is man, and all he can think of is what he knows. Yet, as you can see, that\u0027s not true. We can think of plenty of other things. But we don\u0027t. So there must be another reason why we only conceive of extraterrestrials as humans. And I think the answer is that we are, in reality, terribly frail animals. And we don\u0027t like to be reminded of how frail we are - how delicate the balances are inside our own bodies, how short our stay on Earth, and how easily it is ended. So we imagine other life forms as being like us, so we don\u0027t have to think of the real threat - the terrifying threat - they may represent, without ever intending to.\"\\n\\n There was a silence.\\n\\n \"Of course, we mustn\u0027t forget another possibility,\" Bames said. \"It may be that the sphere contains some extraordinary benefit to us. Some wondrous new knowledge, some astonishing new idea or new technology which will improve the condition of mankind beyond our wildest dreams.\"\\n\\n \"Although the chances are,\" Harry said, \"that there won\u0027t be any new idea that is useful to us.\"\\n\\n \"Why?\" Barnes said.\\n\\n \"Well, let\u0027s say that the aliens are a thousand years ahead of us, just as we are relative to, say, medieval Europe. Suppose you went back to medieval Europe with a television set? There wouldn\u0027t be any place to plug it in.\"\\n\\n Barnes stared from one to another for a long time. \"I\u0027m sorry,\" he said. \"This is too great a responsibility for me. I can\u0027t make the decision to open it up. I have to call Washington on this.\"\\n\\n \"Ted won\u0027t be happy,\" Harry said.\\n\\n \"The hell with Ted,\" Barnes said. \"I\u0027m going to give this to the President. Until we hear from him, I don\u0027t want anybody trying to open that sphere.\"\\n\\n Barnes called for a two-hour rest period, and Harry went to his quarters to sleep. Beth announced that she was going off to sleep, too, but she remained at the monitor station with Tina Chan and Norman. Chan\u0027s station had comfortable chairs with high backs, and Beth swiveled in the chair, swinging her legs back and forth. She played with her hair, making little ringlets by her ear, and she stared into space.\\n\\n Tired, Norman thought. We\u0027re all tired. He watched Tina, who moved smoothly and continuously, adjusting the monitors, checking the sensor inputs, changing the videotapes on the bank of VCR\u0027s, tense, alert. Because Edmunds was in the spaceship with Ted, Tina had to look after the recording units as well as her own communications console. The Navy woman didn\u0027t seem to be as tired as they were, but, then, she hadn\u0027t been inside the spaceship. To her, that spaceship was something she saw on the monitors, a TV show, an abstraction. Tina hadn\u0027t been confronted face-to-face with the reality of the new environment, the exhausting mental struggle to understand what was going on, what it all meant.\\n\\n \"You look tired, sir,\" Tina said.\\n\\n \"Yes. We\u0027re all tired.\"\\n\\n \"It\u0027s the atmosphere,\" she said. \"Breathing the heliox.\" So much for psychological explanations, Norman thought. Tina said, \"The density of the air down here has a real effect. We\u0027re at thirty atmospheres. If we were breathing regular air at this pressure, it would be almost as thick as a liquid. Heliox is lighter, but it\u0027s far denser than what we\u0027re used to. You don\u0027t realize it, but it\u0027s tiring just to breathe, to move your lungs.\"\\n\\n \"But you aren\u0027t tired.\"\\n\\n \"Oh, I\u0027m used to it. I\u0027ve been in saturated environments before.\"\\n\\n \"Is that right? Where?\"\\n\\n \"I really can\u0027t say, Dr. Johnson.\"\\n\\n \"Navy operations?\"\\n\\n She smiled. \"I\u0027m not supposed to talk about it.\"\\n\\n \"Is that your inscrutable smile?\"\\n\\n \"I hope so, sir. But don\u0027t you think you ought to try and sleep?\"\\n\\n He nodded. \"Probably.\"\\n\\n Norman considered going to sleep, but the prospect of his damp bunk was unappealing. Instead he went down to the galley, hoping to find one of Rose Levy\u0027s desserts. Levy was not there, but there was some coconut cake under a plastic dome. He found a plate, cut a slice, and took it over to one of the portholes. But it was black outside the porthole; the grid lights were turned off, the divers gone. He saw lights in the portholes of DH-7, the divers\u0027 habitat, located a few dozen yards away. The divers must be getting ready to go back to the surface. Or perhaps they had already gone.\\n\\n In the porthole, he saw his own face reflected. The face looked tired, and old. \"This is no place for a fifty-three-year-old man,\" he said, watching his reflection.\\n\\n As he looked out, he saw some moving lights in the distance, then a flash of yellow. One of the minisubs pulled up under a cylinder at DH-7. Moments later, a second sub arrived, to dock alongside it. The lights on the first sub went out. After a short time, the second sub pulled away, into the black water. The first sub was left behind.\\n\\n What\u0027s going on, he wondered, but he was aware he didn\u0027t really care. He was too tired. He was more interested in what the cake would taste like, and looked down. The cake was eaten. Only a few crumbs remained.\\n\\n Tired, he thought. Very tired. He put his feet up on the coffee table and put his head back against the cool padding of the wall.\\n\\n He must have fallen asleep for a while, because he awoke disoriented, in darkness. He sat up and immediately the lights came on. He saw he was still in the galley.\\n\\n Barnes had warned him about that, the way the habitat adjusted to the presence of people. Apparently the motion sensors stopped registering you if you fell asleep, and automatically shut off the room lights. Then when you awoke, and moved, the lights came back. He wondered if the lights would stay on if you snored. Who had designed all this? he wondered. Had the engineers and designers working on the Navy habitat taken snoring into account? Was there a snore sensor? More cake.\\n\\n He got up and walked across to the galley kitchen. Several pieces of cake were now missing. Had he eaten them? He wasn\u0027t sure, couldn\u0027t remember.\\n\\n \"Lot of videotapes,\" Beth said. Norman turned around.\\n\\n \"Yes,\" Tina said. \"We are recording everything that goes on in this habitat as well as the other ship. It\u0027ll be a lot of material.\"\\n\\n There was a monitor mounted just above his head. It showed Beth and Tina, upstairs at the communications console. They were eating cake.\\n\\n Aha, he thought. So that was where the cake had gone. \"Every twelve hours the tapes are transferred to the submarine,\" Tina said.\\n\\n \"What for?\" Beth said.\\n\\n \"That\u0027s so, if anything happens down here, the submarine will automatically go to the surface.\"\\n\\n \"Oh, great,\" Beth said. \"I won\u0027t think about that too much. Where is Dr. Fielding now?\"\\n\\n Tina said, \"He gave up on the sphere, and went into the main flight deck with Edmunds.\"\\n\\n Norman watched the monitor. Tina had stepped out of view. Beth sat with her back to the monitor, eating the cake. On the monitor behind Beth, he could clearly see the gleaming sphere. Monitors showing monitors, he thought. The Navy people who eventually review this stuff are going to go crazy. Tina said, \"Do you think they\u0027ll ever get the sphere open?\" Beth chewed her cake. \"Maybe,\" she said. \"I don\u0027t know.\" And to Norman\u0027s horror, he saw on the monitor behind Beth that the door of the sphere was sliding silently open, revealing blackness inside.\\n\\n OPEN\\n\\n They must have thought he was crazy, running through the lock to D Cylinder and stumbling up the narrow stairs to the upper level, shouting, \"It\u0027s open! It\u0027s open!\"\\n\\n He came to the communications console just as Beth was wiping the last crumbs of coconut from her lips. She set down her fork.\\n\\n \"What\u0027s open?\"\\n\\n \"The sphere!\"\\n\\n Beth spun in her chair. Tina ran over from the bank of VCR\u0027s. They both looked at the monitor behind Beth. There was an awkward silence.\\n\\n \"Looks closed to me, Norman.\"\\n\\n \"It was open. I saw it.\" He told them about watching in the galley, on the monitor. \"It was just a few seconds ago, and the sphere definitely opened. It must have closed again while I was on my way here.\"\\n\\n \"Are you sure?\"\\n\\n \"That\u0027s a pretty small monitor in the galley. ...\"\\n\\n \"I saw it,\" Norman said. \"Replay it, if you don\u0027t believe me.\"\\n\\n \"Good idea,\" Tina said, and she went to the recorders to play the tape back.\\n\\n Norman was breathing heavily, trying to catch his breath. This was the first time he had exerted himself in the dense atmosphere, and he felt the effects strongly. DH-8 was not a good place to get excited, he decided.\\n\\n Beth was watching him. \"You okay, Norman?\"\\n\\n \"I\u0027m fine. I tell you, I saw it. It opened. Tina?\"\\n\\n \"It\u0027ll take me a second here.\"\\n\\n Harry walked in, yawning. \"Beds in this place are great, aren\u0027t they?\" he said. \"Like sleeping in a bag of wet rice. Sort of combination bed and cold shower.\" He sighed. \"It\u0027ll break my heart to leave.\"\\n\\n Beth said, \"Norman thinks the sphere opened.\"\\n\\n \"When?\" he said, yawning again.\\n\\n \"Just a few seconds ago.\"\\n\\n Harry nodded thoughtfully. \"Interesting, interesting. I see it\u0027s closed now.\"\\n\\n \"We\u0027re rewinding the videotapes, to look again.\"\\n\\n \"Uh-huh. Is there any more of that cake?\"\\n\\n Harry seems very cool, Norman thought. This is a major piece of news and he doesn\u0027t seem excited at all. Why was that? Didn\u0027t Harry believe it, either? Was he still sleepy, not fully awake? Or was there something else?\\n\\n \"Here we go,\" Tina said.\\n\\n The monitor showed jagged lines, and then resolved. On the screen, Tina was saying, \" - hours the tapes are transferred to the submarine.\"\\n\\n Beth: \"What for?\"\\n\\n Tina: \"That\u0027s so, if anything happens down here, the submarine will automatically go to the surface.\"\\n\\n Beth: \"Oh, great. I won\u0027t think about that too much. Where is Dr. Fielding now?\"\\n\\n Tina: \"He gave up on the sphere, and went into the main flight deck with Edmunds.\"\\n\\n On the screen, Tina stepped out of view. Beth remained alone in the chair, eating the cake, her back to the monitor.\\n\\n Onscreen, Tina was saying, \"Do you think they\u0027ll ever get the sphere open?\"\\n\\n Beth ate her cake. \"Maybe,\" she said. \"I don\u0027t know.\"\\n\\n There was a short pause, and then on the monitor behind Beth, the door of the sphere slid open.\\n\\n \"Hey! It did open!\"\\n\\n \"Keep the tape running!\"\\n\\n Onscreen, Beth didn\u0027t notice the monitor. Tina, still somewhere offscreen, said, \"It scares me.\"\\n\\n Beth: \"I don\u0027t think there\u0027s a reason to be scared.\"\\n\\n Tina: \"It\u0027s the unknown.\"\\n\\n \"Sure,\" Beth said, \"but an unknown thing is not likely to be dangerous or frightening. It\u0027s most likely to be just inexplicable.\"\\n\\n \"I don\u0027t know how you can say that.\"\\n\\n \"You afraid of snakes?\" Beth said, onscreen.\\n\\n All during this conversation, the sphere remained open.\\n\\n Watching, Harry said, \"Too bad we can\u0027t see inside it.\"\\n\\n \"I may be able to help that,\" Tina said. \"I\u0027ll do some image-intensification work with the computer.\"\\n\\n \"It almost looks like there are little lights,\" Harry said. \"Little moving lights inside the sphere ...\"\\n\\n Onscreen, Tina came back into view. \"Snakes don\u0027t bother me.\"\\n\\n \"Well, I can\u0027t stand snakes,\" Beth said. \"Slimy, cold, disgusting things.\"\\n\\n \"Ah, Beth,\" Harry said, watching the monitor. \"Got snake envy?\"\\n\\n Onscreen, Beth was saying, \"If I were a Martian who came to Earth and I stumbled upon a snake - a funny, cold, wiggling, tube-like life - I wouldn\u0027t know what to think of it. But the chance that I would stumble on a poisonous snake is very small. Less than one percent of snakes are poisonous. So, as a Martian, I wouldn\u0027t be in danger from my discovery of snakes; I\u0027d just be perplexed. That\u0027s what\u0027s likely to happen with us. We\u0027ll be perplexed.\"\\n\\n Onscreen, Beth was saying, \"Anyway, I don\u0027t think we\u0027ll ever get the sphere open, no.\"\\n\\n Tina: \"I hope not.\" \\n\\n","sourceLink":"https://allnovel.net/sphere/page-7.html","bookId":1715,"book":{"id":1715,"title":"Sphere","description":"Storyline: A group of American scientists are rushed to a huge vessel that has been discovered resting on the ocean floor in the middle of the South Pacific. What they find defines their imaginations and mocks their attempts at logical explanation. It is a spaceship of phenomenal dimensions, apparently, undamaged by its fall from the sky. And, most startling, it appears to be at least three hundred years old.... \\n \"The suspense is real.\" \\n THE NEW YORK TIMES BOOK REVIEW \\n \"A page-turner...Chichton\u0027s writing is cinematic, with powerful visual images and nonstop action. This book should come with hot buttered popcorn.\" \\n NEWSWEEK\\n","cover":"https://allnovel.net/images/sphere.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/sphere.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:03:36 AM"}}
