{"id":101332,"no":14,"title":"Page 14","content":"I was really hoping he would be one of the second kind. \u0027A parallel world?\u0027 There, now he was bringing in science fiction. But never mind, it didn\u0027t matter. Names are nothing more than sounds. \u0027Yes, and only people with supernatural powers can enter that world.\u0027 \u0027Vampires?\u0027 \u0027Not only. There are werewolves, witches, black magicians . . . white magicians, healers, seers.\u0027 \u0027And they all really exist?\u0027 He was soaking wet. His hair was clumped together, his sweatshirt was clinging to his body, beads of sweat were rolling down his cheeks. But still the boy never took his eyes off me and was getting ready to repulse me. As if he really had the power to do it. \u0027Yes, Egor. Some people can enter the Twilight world. They take the side of either Good or Evil. Light or Dark. They are the Others. That\u0027s what we call each other, the Others.\u0027 \u0027Are you an Other?\u0027 \u0027Yes, and so are you.\u0027 \u0027Why?\u0027 \u0027You\u0027re in the Twilight world right now. Take a look around, listen. All the colours have turned grey. The sounds have faded away. The second hand on the clock is barely moving. You entered the Twilight world . . . you wanted to see the danger and you crossed the boundary between worlds. Time moves more slowly here, everything is different here. This is the world of the Others.\u0027 \u0027I don\u0027t believe it.\u0027 Egor glanced round quickly, then looked back at me. \u0027Then why\u0027s Grey here?\u0027 \u0027The cat?\u0027 I smiled. \u0027Animals follow their own laws, Egor. Cats live in all the dimensions at once, for them there is no difference.\u0027 \u0027I don\u0027t believe you.\u0027 His voice was trembling. \u0027It\u0027s all a dream, I know! When the light fades like that. . . I\u0027m asleep. It\u0027s happened to me before.\u0027 \u0027So you\u0027ve had dreams about turning on the light and the bulb not lighting up?\u0027 I already knew the answer, and anyway I could read it in the boy\u0027s eyes. \u0027Or it lights up, but only very, very faintly, like a candle? And you\u0027re walking along with the Dark all around you, and you hold out your hand and you can\u0027t even make out your own fingers?\u0027 He didn\u0027t answer. \u0027That happens to all of us, Egor. Every Other has dreams like that. It\u0027s the Twilight world creeping into us, calling us, reminding us of itself. You are an Other. Still a young one, but you are. And you\u0027re the only one. . .\u0027 I didn\u0027t realise straightaway that his eyes had closed and his head was slumped to one side. \u0027You idiot!\u0027 Olga hissed from my shoulder. \u0027This is the first time he\u0027s entered the Twilight independently. He hasn\u0027t got the strength for this. Pull him out quickly, or he\u0027ll stay here for ever!\u0027 Twilight coma is a novice\u0027s problem. I\u0027d almost forgotten about it, because I\u0027d never worked with young Others. \u0027Egor!\u0027 I leapt across and shook him, grabbing him round the shoulders. He was light, very light – it\u0027s not only time that changes in the Twilight world. \u0027Wake up!\u0027 The boy didn\u0027t respond. He\u0027d already done what it takes others months of training to do – entered the Twilight on his own. And the Twilight world sucks the strength out of you. \u0027Pull him out!\u0027 said Olga, taking command of the situation. \u0027He won\u0027t wake up himself.\u0027 That was the hardest thing of all. I\u0027d done the emergency rescue courses, but I\u0027d never had to drag anyone out of the Twilight for real. \u0027Egor, snap out of it!\u0027 I slapped him on the cheeks. Gently at first, then I started putting real force into it. \u0027Come on, kid. You\u0027re slipping away into the Twilight world! Wake up!\u0027 He was getting lighter and lighter, melting away in my arms. The Twilight was drinking his life, the final ounces of his strength. The Twilight was changing his body, claiming it as permanent resident. What had I done? \u0027Seal yourself off]\u0027 Olga\u0027s sharp voice focused my mind. \u0027Seal yourself off, and him too.\u0027 It always used to take me more than a minute to form a sphere. This time I did it in five seconds flat. I felt a stab of pain – as if a small shell had exploded inside my head. I threw my head back when the sphere of exclusion emerged from my body, shrouding me like a shimmering soap bubble. The bubble expanded, reluctantly enveloping me and the boy. \u0027That\u0027s it, now hold it there. I can\u0027t do anything to help you, Anton. Hold that sphere!\u0027 Olga was wrong. She\u0027d already helped me, with her advice. I\u0027d probably have realised that I ought to form a sphere, but I could have lost precious seconds along the way. It started getting lighter. The Twilight was still draining our strength – mine with an effort, the boy\u0027s with ease – but now it only had a few cubic metres of space to operate with. The ordinary laws of physics don\u0027t apply here, but there are parallels. A balance was being established between our living bodies and the Twilight. Either the Twilight would dissolve and release its prey, or the boy would remain an inhabitant of the Twilight world. For ever. It\u0027s what happens to magicians who have pushed themselves beyond the limit, either through carelessness or because they have no choice. It\u0027s what happens with novices who don\u0027t know how to protect themselves against the Twilight properly and allow it to take more than they should. I looked at Egor: his face was turning grey. He was slipping away into the infinite expanses of the shadow world. I threw the boy across my right arm, took a penknife out of my left pocket and opened the blade with my teeth. \u0027That\u0027s dangerous,\u0027 Olga warned me. I didn\u0027t answer. I just slashed my wrist. When the blood spurted out, the Twilight hissed like a red-hot frying pan. Everything blurred. It wasn\u0027t just the loss of the blood, my very life was seeping away with it. I\u0027d ruptured my own defences against the Twilight. But the dose of energy was too large for it to absorb. The world turned brighter, my shadow leaped on to the floor and I stepped through it. The rainbow film of the sphere of exclusion burst, releasing us into the everyday world. CHAPTER 5 A THIN STREAM of blood splashed on to the carpet. The boy was slumped in my arms, still unconscious, but his face was beginning to turn pink. The cat was yowling in the next room as if his throat was being cut. I lowered Egor on to the sofa, sat down beside him and told Olga to find a bandage. The owl launched off my shoulder and dashed away like a white streak into the kitchen. She must have slipped into the Twilight on the way, because she was back in a few seconds with a bandage in her beak. Egor opened his eyes just at the moment when I took the bandage from the owl and started binding up my wrist. He asked: \u0027Who\u0027s that?\u0027 \u0027An owl. Surely you can see that!\u0027 \u0027What happened to me?\u0027 he asked. His voice was hardly trembling at all. \u0027You lost consciousness.\u0027 \u0027Why?\u0027 His eyes wandered anxiously over the traces of blood on the floor and my clothes. I\u0027d managed not to get any on Egor. \u0027It\u0027s my blood,\u0027 I explained. \u0027I cut myself by accident. You have to be careful when you enter the Twilight, Egor. It\u0027s an alien environment, even for us, the Others. While we\u0027re in the Twilight world, we have to expend our strength constantly, feeding its vital energy. But a little at a time. If you don\u0027t keep control of the process, the Twilight will suck all the life out of you. It\u0027s just a price we have to pay.\u0027 \u0027And I paid more than I should have done?\u0027 \u0027More than you had. And you almost stayed in the Twilight world for ever. It\u0027s not death – but maybe it\u0027s worse than death.\u0027 \u0027Let me help . . .\u0027 The boy winced as he sat up – he must have felt dizzy. I held out my hand and he started bandaging my wrist, clumsily but trying hard. The boy\u0027s aura hadn\u0027t changed, it was still iridescent, neutral. He\u0027d already entered the Twilight, but it still hadn\u0027t left its mark. \u0027Do you believe I\u0027m your friend?\u0027 I asked. \u0027I don\u0027t know. Not my enemy, I suppose. Or you can\u0027t do anything to me!\u0027 I reached out and touched the boy\u0027s neck and he instantly tensed up. I unfastened the chain and took it off his neck. \u0027You see?\u0027 \u0027So you\u0027re not a vampire?\u0027 His voice was slightly husky. \u0027No. But that\u0027s not why I could touch the garlic and the silver, Egor. They won\u0027t stop a vampire.\u0027 \u0027But in all the films . . .\u0027 \u0027And in all the films the good guys always beat the bad guys. Listen, kid, superstitions are dangerous, they give people false hope.\u0027 \u0027Isn\u0027t there any real hope?\u0027 \u0027No. Not really.\u0027 I got up and felt the bandage. Not bad, it was quite tight and holding firm. In half an hour I\u0027d be able to heal the wound with a spell, but I didn\u0027t have enough strength yet. The boy looked up at me from the sofa. Yes, he was a bit calmer now. But he still didn\u0027t trust me. It amused me that he paid no attention to the owl dozing on the television with an innocent air. It looked as if Olga had influenced his mind after all. That was all to the good: explaining who the talking owl was would have been rather tricky. \u0027Have you got any food?\u0027 I asked. \u0027What kind?\u0027 \u0027Any kind. Tea with sugar. A piece of bread. I used up a lot of strength too.\u0027 \u0027I\u0027ll find something. How did you get cut?\u0027 I didn\u0027t go into the details, but I didn\u0027t lie about it either. \u0027It was deliberate. I had to do it to get you out of the Twilight.\u0027 \u0027Thanks. If it\u0027s true.\u0027 He was a bit cheeky, but I liked that. \u0027You\u0027re welcome. If you disappeared into the Twilight, my boss would have my head.\u0027 The boy snorted and got up. But he was still keeping his distance from me. \u0027What boss is that?\u0027 \u0027A very strict one. Well, are you going to pour me some tea?\u0027 \u0027Anything for you.\u0027 Yes, he was still afraid. And he was hiding his fear by being cocky and familiar. \u0027Get this straight – I\u0027m not a human being. I\u0027m an Other. And you\u0027re an Other.\u0027 \u0027But what\u0027s the difference?\u0027 said Egor, looking me up and down challengingly. \u0027You don\u0027t look any different.\u0027 \u0027Until you give me some tea, I won\u0027t say a word. Didn\u0027t anyone teach you how to treat guests?\u0027 \u0027Uninvited ones? How did you get in?\u0027 \u0027Through the door. I\u0027ll show you. Later.\u0027 \u0027Come on then.\u0027 It looked like I was going to get my tea after all. As I set out after the boy, I couldn\u0027t help recoiling at the smell. I just had to say something. \u0027You know what, Egor, why don\u0027t you wash your neck first?\u0027 The boy shook his head without looking round, busying himself with making the tea. \u0027It any case, it\u0027s stupid only to protect your neck. There are five points on the human body where a vampire can bite.\u0027 \u0027Oh yeah?\u0027 \u0027Yeah. That is, I mean on a male body, of course.\u0027 Even the back of his neck turned red.","sourceLink":"https://allnovel.net/the-night-watch-watch-1/page-14.html","bookId":2623,"book":{"id":2623,"title":"The Night Watch (Watch #1)","description":"Storyline: Night Watch (Watch, #1) This epic saga chronicles the eternal war of the “Others,” an ancient race of humans with supernatural powers who must swear allegiance to either the Dark or the Light. The agents of the Dark – the Night Watch – oversee nocturnal activity, while the agents of the Light keep watch over the day. For a thousand years both sides have maintained a precarious balance of power, but an ancient prophecy has decreed that a supreme Other will one day emerge, threatening to tip the scales. Now, that day has arrived. When a mid-level Night Watch agent named Anton stumbles upon a cursed young woman – an uninitiated Other with magnificent potential – both sides prepare for a battle that could lay waste to the entire city, possible the world. With language that throbs like darkly humorous hard-rock lyrics about blood and power, freedom and responsibility, Night Watch is a chilling, cutting-edge thriller, a pulse-pounding ride of fusion fiction that will leave you breathless for the next instalment.","cover":"https://allnovel.net/images/the-night-watch-watch-1.jpg","author":"Sergei Lukyanenko","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-night-watch-watch-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 9:59:54 PM"}}
